[
  {
    "text": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call\nAuthor: محمد بن عبد العزيز بن مانع\nYear: 1385",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 1
  },
  {
    "text": "sn: 303\nbook_title: التعليقات الأثرية على العقيدة الطحاوية لأئمة الدعوة السلفية\nbook_link: https://shamela.ws/book/954\nbook_id: 954\nauthor_name: محمد بن عبد العزيز بن مانع\nauthor_year: 1385\nnickname: Null\nauthor_link: https://shamela.ws/author/3042\nauthor_ID: 3042\neditor: جمع وإعداد: أحمد بن يحيى الزهراني\npublisher: Null\nedition: Null\npages: 58\nvolumes: Null\npagination: [الكتاب مرقم آليا]\ncategory: العقيدة\ncategory_id: 1",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 2
  },
  {
    "serial_number": "32000",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Creed\nBook: Athari Comments on the Tahawi Creed by Imams of the Salafi Call\nAuthor: Muhammad bin Abdul Aziz bin Mani' (Died 1385 AH)\nAbdul Aziz bin Abdullah bin Baz (Died 1420 AH)\nMuhammad Nasir al-Din al-Albani (Died 1420 AH)\nCompiled and Prepared by: Ahmed bin Yahya al-Zahrani\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nBook: Athari Comments on the Tahawi Creed by Imams of the Salafi Call\nAuthor: Muhammad bin Abdul Aziz bin Mani' (Died 1385 AH)\nAbdul Aziz bin Abdullah bin Baz (Died 1420 AH)\nMuhammad Nasir al-Din al-Albani (Died 1420 AH)\nCompiled and Prepared by: Ahmed bin Yahya al-Zahrani\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nAuthor: Muhammad bin Abdul Aziz bin Mani' (Died 1385 AH)\nAbdul Aziz bin Abdullah bin Baz (Died 1420 AH)\nMuhammad Nasir al-Din al-Albani (Died 1420 AH)\nCompiled and Prepared by: Ahmed bin Yahya al-Zahrani\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nMuhammad bin Abdul Aziz bin Mani' (Died 1385 AH)\nAbdul Aziz bin Abdullah bin Baz (Died 1420 AH)\nMuhammad Nasir al-Din al-Albani (Died 1420 AH)\nCompiled and Prepared by: Ahmed bin Yahya al-Zahrani\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nAbdul Aziz bin Abdullah bin Baz (Died 1420 AH)\nMuhammad Nasir al-Din al-Albani (Died 1420 AH)\nCompiled and Prepared by: Ahmed bin Yahya al-Zahrani\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nMuhammad Nasir al-Din al-Albani (Died 1420 AH)\nCompiled and Prepared by: Ahmed bin Yahya al-Zahrani\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nCompiled and Prepared by: Ahmed bin Yahya al-Zahrani\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\n[The book is automatically numbered]\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "954",
    "new_page_number": 3
  },
  {
    "serial_number": "32001",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call\nMuhammad bin Abdul Aziz bin Mani', may Allah have mercy on him (1298 - 1385 AH)\nAbdul Aziz bin Abdullah bin Baz, may Allah have mercy on him (1330 AH - 1420 AH)\nMuhammad Nasir al-Din al-Albani, may Allah have mercy on him (1332 AH - 1420 AH)\nCompiled and Prepared by / Ahmed bin Yahya al-Zahrani\n\nIntroduction\nIn the name of Allah, the Most Gracious, the Most Merciful.\nIndeed, all praise is due to Allah. We praise Him, we seek His help, and we seek His forgiveness. We seek refuge in Allah from the evil of our own souls and from our bad deeds. Whomever Allah guides, there is no one to misguide him, and whomever He misguides, there is no guide for him. I bear witness that there is no god but Allah alone, without partner, and I bear witness that Muhammad is His servant and messenger.\n{O you who believe! Fear Allah as He should be feared, and die not except in a state of Islam (as Muslims).} \n{O mankind! Be dutiful to your Lord, Who created you from a single person (Adam), and from him (Adam) He created his wife [Hawwa (Eve)], and from them both He created many men and women; and fear Allah through Whom you demand (your mutual rights), and (do not cut the relations of) the wombs (kinship). Indeed Allah is ever an All-Watcher over you.}\n{O you who believe! Keep your duty to Allah and fear Him, and speak (always) the truth. He will direct you to do righteous good deeds and will forgive you your sins. And whosoever obeys Allah and His Messenger, he has indeed achieved a great achievement.}\nTo proceed:\nIndeed, the most truthful speech is the Book of Allah, and the best guidance is the guidance of Muhammad, may Allah bless him and grant him peace. The worst of affairs are newly invented matters, and every newly invented matter is a heresy (Bid'ah), and every heresy is a misguidance, and every misguidance is in the Fire.\nAfter that:\nHe (the Prophet), may Allah bless him and grant him peace, said: ((If you deal in 'Eeenah (a type of usury), and hold onto the tails of cows, and are content with agriculture, and abandon Jihad, Allah will inflict upon you a humiliation that He will not remove until you return to your religion)) (1).",
    "foot_note": "1. (1) \n…. (Sahih/Authentic) Narrated by Abu Dawood (3462) and see Al-Sahihah 1/Hadith (11).",
    "book_id": "954",
    "new_page_number": 4
  },
  {
    "serial_number": "32002",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "So there is no glory and no victory for the Muslims, indeed, no revival, except by returning to their religion and adhering to their correct Creed and its upright Methodology. For they (1) are the foundation of all success and prosperity. The early Muslims were not victorious except by their adherence to their Creed and Methodology, both scientifically and practically (2). What we see today of weakness, division, and partisanship between – and within – the ranks of Muslims, and the ganging up of enemies against them, is due to their neglect of this foundation.\nThe scholars of Islam realized this danger, so they rose with a strong and sincere uprising, authoring books to clarify the Creed – and its importance, the obligation of adhering to it, and the warning against contradicting it. Among those unique scholars was Abu Ja'far Ahmad bin Muhammad al-Tahawi, may Allah have mercy on him (3). He authored a text known as 'The Tahawi Creed' (Al-Aqidah Al-Tahawiyyah), which met with wide acceptance among the masses of Muslims, predecessors and successors. Scholars engaged with it through explanation, commentary, and critique, and that is only due to its importance and the great standing of its author.",
    "foot_note": "1. (1) \n…. Separating Creed (Aqeedah) from Methodology (Manhaj) is a false claim, and those who say it contradict themselves. How can a person be: Ikhwani or Tablighi or... while his Creed is Salafi!!! This is hardly conceivable. Whoever has a Salafi Creed, his Creed necessitates upon him, indeed prevents him, from drifting into these newfound methodologies. Unlike the one who follows these incoming methodologies and their false principles, for he will concede regarding following what the Prophet Muhammad, peace be upon him, and his noble companions were upon, until he almost dissolves from that, Allah forbid. This saying (of separation) was only invented to contain the Ahl al-Sunnah, deceive them, and bring them closer to the people of heresy and desires, and indeed to protect them and overlook their slips and lapses, and to distort the image of everyone who criticizes them and warns against them. So be cautious and do not be sweet lest you be swallowed!!!\n2. \n…. Meaning by knowledge, action, calling (Da'wah), and patience upon harm.\n3. \n…. See his biography in Al-Fihrist p/349, Shadharat al-Dhahab 2/288, Al-Fawa'id al-Bahiyyah fi Tarajim al-Hanafiyyah p/31-34, and Mu'jam al-Mu'allifin 2/107.",
    "book_id": "954",
    "new_page_number": 5
  },
  {
    "serial_number": "32003",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "May Allah reward Abu Ja'far for what he expended, and pardon him for the slips he fell into (1). Everyone's saying is accepted or rejected except the Messenger of Allah, peace be upon him. In order to bring this Creed closer to the people and clarify it and what it contains of the pearls and essence of the beliefs of Ahl al-Sunnah wal-Jama'ah, I undertook the collection of Athari (trace-based/traditional) Salafi (2) comments (3)",
    "foot_note": "1. (1) \n…. As in numbers (57), (61), (62), (64), and others.\n2. \n…. So that they may be within easy reach for those who seek them.\n3. \n…. Yes, Athari Salafi in Creed, Methodology, Jurisprudence, and Dealings. Our slogan is: Ahl al-Hadith (Athari and Salafi) in reality, not just a claim. Abandoning attribution to the Salaf or casting doubt on it is among the signs of the people of heresy (Ahl al-Bid'ah). Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, said as in Majmoo' al-Fatawa (4/155): \"It became known that the slogan of the people of heresy is: abandoning the attribution of following the Salaf. Therefore, Imam Ahmad said in the epistle of Abdus bin Malik: 'The principles of Sunnah with us are adhering to what the Companions of the Prophet, peace be upon him, were upon.'\"\n…. He also said in Majmoo' al-Fatawa 4/156: \"As for attributing oneself to the Salaf being a slogan of the people of heresy: this is absolutely false, for that is not possible except where ignorance abounds and knowledge is scarce.\"\n…. He said regarding the one who attributes himself to the Salaf (Majmoo' al-Fatawa 4/149): \"There is no shame on the one who manifests the school (Madhab) of the Salaf and attributes himself to it and refers to it; rather, it must be accepted from him by agreement, for the school of the Salaf is nothing but the truth.\"\n…. In this, there is sufficiency for anyone who has a grasp of reason.",
    "book_id": "954",
    "new_page_number": 6
  },
  {
    "serial_number": "32004",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "on this Creed (1) by the luminaries of guidance and lamps of the darkness – in our era – the Scholar Sheikh Muhammad bin Abdul Aziz bin Mani', may Allah have mercy on him (2), the Scholar Sheikh Abdul Aziz bin Abdullah bin Baz, may Allah have mercy on him (3), and the Scholar Sheikh Muhammad Nasir al-Din al-Albani, may Allah have mercy on him (4). These pioneering, comprehensive, and beneficial comments clarified the intended meaning of the text most fully, and refuted the specious arguments of the people of heresy, deviation, and misguidance; indeed, they finished them off in their strongholds. This is what prompted us to collect them and bring them closer to the Muslims, hoping that they find conscious hearts and attentive ears so they may return to their glory and majesty. So here it is, my Muslim brother, in your hands; bite onto it with your molars, and you will be on the right path and safe – by Allah's permission – in this world and the Hereafter. I named this book: \"The Athari Comments on the Tahawi Creed\". Asking the Lord, Exalted is His affair and Great is His ability, to make it beneficial. He is the Guardian of that and Capable of it. May peace and blessings be upon our Prophet Muhammad and upon his family and companions altogether.\nWritten by... Abu Abdullah Ahmed bin Yahya al-Zahrani",
    "foot_note": "1. (1) \n…. In this bitter era where many people have abandoned their creed, and the most cunning of them are those who conceded some of it to achieve an interest – so they claimed – as many of the movement-oriented people (Harakis) do!!!\n2. \n…. See his biography in Al-A'lam by Al-Zirikli 6/209, Rawdat al-Nazirin by Muhammad al-Qadi 2/293-302, and Tarikh Ulama Najd by Al-Bassam 6/100-113. I have denoted his comments with the letter (M).\n3. \n…. See his biography in Al-Injaz fi Tarjamat al-Imam Abdul Aziz bin Baz by Abdul Rahman al-Rahmah and Al-Ibriziyyah fi al-Tis'in al-Baziyyah (by Muhammad al-Shatwi). I have denoted his comments with the letter (Z).\n4. \n…. See his biography in Hayat al-Albani wa Atharuhu al-Ilmiyyah (by Al-Shibani), A Brief Biography of His Eminence the Muhaddith Sheikh Abu Abdul Rahman Muhammad Nasir al-Din al-Albani (by Dr. Asim al-Qaryuti), and Muhaddith al-Asr Muhammad Nasir al-Din al-Albani (by Samir al-Zuhayri). I have denoted his comments with the letter (N).",
    "book_id": "954",
    "new_page_number": 7
  },
  {
    "serial_number": "32005",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "[Author's Introduction]\nIn the name of Allah, the Most Gracious, the Most Merciful.\nPraise be to Allah, Lord of the Worlds.\nThe Scholar, the Proof of Islam, Abu Ja'far al-Warraq al-Tahawi - in Egypt, may Allah have mercy on him, said:\nThis is a mention of the clarification of the creed of Ahl al-Sunnah wal-Jama'ah according to the school (Madhab) (1) of the jurists of the religion: Abu (2) Hanifa al-Nu'man bin Thabit al-Kufi, and Abu (3)",
    "foot_note": "1. (1) \n…. His saying \"according to the school of the jurists of the religion etc.\": Know that what the author, may Allah have mercy on him, mentioned in this creed is not specific only to these mentioned Imams. Rather, the creed of Ahl al-Sunnah wal-Jama'ah from the first ones and the last ones is one; because they hold fast to the Book and the Sunnah. Whoever opposes them in their belief becomes a deviant innovator and is not excused by his independent reasoning (Ijtihad); because excuse is accepted in Ijtihad regarding the branches of rulings, not in the fundamentals of religion. Religious beliefs do not allow for a multiplicity of schools; rather, the correct way is the school of Ahl al-Sunnah wal-Jama'ah, and whatever else is false, so take note. (M)\n2. \n…. He is Imam Al-Nu'man bin Thabit al-Kufi, born in the year 80. He met a group of the Companions. Al-Khatib said: He saw Anas bin Malik. He was, may Allah have mercy on him, a scholar who acted upon his knowledge, ascetic, worshipper, pious, God-fearing, of great humility, constantly supplicating to Allah Almighty. He died in the year 150 AH, which is the year Imam Al-Shafi'i, may Allah have mercy on him, was born. (M)\n3. \n…. Abu Yusuf is the proficient Imam, the absolute Mujtahid, Abu Yusuf Yaqub bin Ibrahim al-Ansari al-Bajali; born in the year 113. He took knowledge from Imam Abu Hanifa and others, and a group took knowledge from him, among them Imam Ahmad, may Allah have mercy on him. Al-Rashid appointed him to the judiciary, and he remained in it until he died in the year 183. When Abu Yusuf died, Harun al-Rashid confirmed his son Yusuf in the judiciary until Yusuf died. When Abu Yusuf's funeral procession came out, people began saying: Jurisprudence has died; Jurisprudence has died. So someone composed verses saying:\n......O announcer of Fiqh (Jurisprudence) to its people......If Yaqub has died, and you do not know\n.........Fiqh has not died, but......It has transferred from a chest to a chest. (M)",
    "book_id": "954",
    "new_page_number": 8
  },
  {
    "serial_number": "32006",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "Yusuf Yaqub bin Ibrahim al-Ansari, and Abu Abdullah Muhammad bin al-Hasan al-Shaybani (1), may Allah be pleased with them all; and what they believe regarding the fundamentals of religion, and owe as religion to the Lord of the Worlds (2).\n\n[Belief in Allah Almighty]\n1 - We say regarding the Oneness (Tawhid) of Allah (3)",
    "foot_note": "1. (1) \n…. He is Muhammad bin al-Hasan bin Farqad al-Shaybani. Al-Rashid appointed him to the judiciary, and he went out with Al-Rashid on his journey to Khorasan, dying in Rayy and being buried there. His father was from the soldiers of the people of Sham, came to Wasit, and Muhammad was born there in the year 132. He grew up in Kufa and took knowledge from Abu Hanifa, Malik, Abu Yusuf, and others. He had a circle in Kufa when he was twenty years old. Ibrahim al-Harbi said: I said to Imam Ahmad: From where did you get these precise issues? He said: From the books of Muhammad bin al-Hasan. He died, may Allah have mercy on him, in Rayy in the year 189. Al-Sam'ani said: Muhammad bin al-Hasan and Al-Kisa'i died on the same day in Rayy, and it was said that Al-Rashid used to say: I buried Fiqh and Arabic Language in Rayy. Muhammad bin al-Hasan mentioned is the maternal cousin of Al-Farra', the Imam famous for grammar and language. May Allah have mercy on everyone. (M)\n2. \n…. Addition from manuscript (Kh) and others. (N).\n3. \n…. His saying (We say regarding the Oneness of Allah... etc.)\n…. Know that Tawhid (Monotheism), with which Allah sent the Messengers and revealed the Books, is divided into three categories according to the induction of texts from the Book and the Sunnah and according to the reality of the accountable people:\n…. The First Category: Tawhid al-Rububiyyah (Oneness of Lordship). This is unifying Allah in His actions, Glory be to Him. It is the belief that He is the Creator, the Provider, the Planner of the affairs of His creation, the Disposer of their matters in this world and the Hereafter; He has no partner in that. As the Almighty said: {Allah is the Creator of all things} [Az-Zumar: 62]. And He said: {Indeed, your Lord is Allah, who created the heavens and the earth in six days and then established Himself above the Throne, arranging the matter} [Yunus: 3]. This type was acknowledged by the polytheists who worshipped idols, even if most of them denied the Resurrection, and it did not enter them into Islam due to their associating partners with Allah in worship and worshipping idols and statues along with Him, Glory be to Him, and their lack of belief in the Messenger Muhammad, may peace and blessings be upon him and his family.\n The Second Category: Tawhid al-Ibadah (Oneness of Worship), also called Tawhid al-Uluhiyyah. This is worship. This category is what the polytheists denied, as Allah mentioned about them: {And they wonder that there has come to them a warner from among themselves. And the disbelievers say, \"This is a magician and a liar. Has he made the gods [only] one God? Indeed, this is a curious thing.\"} [Sad: 4-5], and similar verses are many. This category implies making worship purely for Allah alone and believing that He is the One deserving of it and that the worship of anyone else is false. This is the meaning of 'La ilaha illa Allah' (There is no god but Allah), for its meaning is there is no one worshipped\n…. rightfully except Allah, as Allah Almighty said: {That is because Allah is the Truth, and that what they call upon other than Him is falsehood} [Al-Hajj: 62].\n The Third Category: Tawhid al-Asma' wa al-Sifat (Oneness of Names and Attributes): It is believing in everything mentioned in the Noble Book of Allah and in the Authentic Sunnah from the Messenger of Allah, may peace and blessings be upon him and his family, regarding the Names of Allah and His Attributes, and affirming them for Allah, Glory be to Him, in a manner that befits Him, without distortion (Tahrif), negation (Ta'til), asking 'how' (Takyif), or likening Him to creation (Tamthil). As Allah Glory be to Him said: {Say, \"He is Allah, [who is] One, Allah, the Eternal Refuge. He neither begets nor is born, Nor is there to Him any equivalent.\"} [Surah Al-Ikhlas]. And He said: {There is nothing like unto Him, and He is the Hearing, the Seeing.} [Ash-Shura: 11]. And He said: {And to Allah belong the best names, so invoke Him by them.} [Al-A'raf: 180]. And He said in Surah An-Nahl: {And to Allah belongs the highest attribute. And He is the Exalted in Might, the Wise.} [An-Nahl: 60]. The verses in this meaning are many. The 'highest attribute' is the supreme description which has no deficiency. This is the saying of Ahl al-Sunnah wal-Jama'ah from the companions of the Messenger, may peace and blessings be upon him and his family, and those who follow them in goodness. They pass the verses of Attributes and their hadiths as they came, affirming their meanings for Allah, Glory be to Him—an affirmation free from likening (Tamthil)—and exalting Allah, Glory be to Him, from resembling His creation—an exaltation free from negation (Ta'til). With what they said, the evidences from the Book and Sunnah unite, and the proof is established against those who oppose them. They are the ones mentioned in His saying: {And the first forerunners [in the faith] among the Muhajireen and the Ansar and those who followed them with good conduct - Allah is pleased with them and they are pleased with Him, and He has prepared for them gardens beneath which rivers flow, wherein they will abide forever. That is the great attainment.} [At-Tawbah: 100]. May Allah make us among them by His grace and generosity. And Allah is the One sought for help. (Z)",
    "book_id": "954",
    "new_page_number": 9
  },
  {
    "serial_number": "32007",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "believing - by Allah's success -: That Allah is One, He has no partner (1)",
    "foot_note": "1. (1) \n…. Denying a partner for Allah Almighty is not complete except by denying three types of Shirk (Polytheism):\n…. First: Shirk in Lordship (Rububiyyah), which is believing that there is another creator with Allah – Glory be to Him – as is the belief of the Magians (Zoroastrians) who say that there is a creator for evil other than Allah Glory be to Him. This type is rare in this Ummah (Nation), praise be to Allah, although the saying of the Mu'tazilah is close to it: that evil is created by man. This is indicated by his saying, peace be upon him: ((The Qadariyyah are the Magians of this Ummah...)) the Hadith, which is\n…. extracted in several sources I possess, which I indicated in ((Sahih al-Jami' al-Saghir wa Ziyadatuhu)) number [4442].\n Second: Shirk in Divinity or Worship (Uluhiyyah/Ubudiyyah), which is worshipping others along with Allah, such as prophets and righteous people, like seeking aid from them and calling upon them in hardships and the like. Unfortunately, this is common in this Ummah, and the greatest burden of it is borne by those Sheikhs who support this type of Shirk under the name of Tawassul (Intercession) ((They name it by other than its name))!.\n Third: Shirk in Attributes (Sifat), which is describing some of His creation with some attributes specific to Him, the Mighty and Majestic, such as knowledge of the Unseen, for example. This type is widespread among many Sufis and those influenced by them, such as the saying of some of them in praise of the Prophet, peace be upon him:\n...... ((For from your generosity is the world and its co-wife (Hereafter) \n…. And from your sciences is the knowledge of the Tablet and the Pen!))\nFrom here came the misguidance of some impostors who claim that they see the Messenger - peace be upon him - today while awake and ask him about what is hidden from them of the inner selves of those they mix with, and they want to appoint them in some of their affairs. Yet the Messenger of Allah, peace be upon him, would not know such things during his lifetime {And if I knew the unseen, I could have acquired much good, and no evil would have touched me.} [Al-A'raf: 188], so how could he know that after his death and transfer to the Supreme Companion?!\n Whoever denies these three types of Shirk from Allah has unified Him; thus he has unified Him in His Essence, His Worship, and His Attributes. He is the Monotheist (Muwahhid) covered by all virtues specific to Monotheists. Whoever violates any part of it, to him is directed the likes of His saying Almighty: {If you should associate [anything] with Allah, your work would surely become worthless, and you would surely be among the losers.} [Az-Zumar: 65]. So memorize this, for it is the most important thing in Creed. No wonder the author, may Allah have mercy on him, began with it. Whoever wants detail should refer to the explanation of this book and the books of the Sheikhs of Islam Ibn Taymiyyah, Ibn al-Qayyim, Ibn Abdul Wahhab, and others who followed their path and pursued their way. {Our Lord, forgive us and our brothers who preceded us in faith} [Al-Hashr: 10]. (N)",
    "book_id": "954",
    "new_page_number": 10
  },
  {
    "serial_number": "32008",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": ", 2- And there is nothing like Him (1). 3- And nothing renders Him incapable. 4- And there is no god other than Him. 5- Ancient (Qadim) without beginning (2)",
    "foot_note": "1. (1) \n…. This is a principle from the principles of Tawhid, which is that there is nothing like Allah Almighty, neither in His Essence, nor in His Attributes, nor in His Actions. However, the innovators and interpreters have taken it as a basis for denying many attributes of Allah\n…. Blessed and Exalted. Whenever their hearts become constricted about believing in an attribute of His, the Mighty and Majestic, they unleash upon it the pickaxes of interpretation and demolition, so they deny it, using as evidence His saying: {There is nothing like Him}, ignoring the rest of the verse: {and He is the Hearing, the Seeing} [Ash-Shura: 11]. For it combined transcendence (Tanzih) and affirmation (Ithbat). So whoever wants safety in his creed must declare Allah Almighty transcendent above resembling created things (events), without interpretation or negation, and must affirm for Him, the Mighty and Majestic, all attributes He affirmed for Himself in His Book or the Hadith of His Prophet without likening Him (to creation). This is the school of the Salaf, and upon it is the author, may Allah have mercy on him, following Abu Hanifa and the rest of the Imams, as you see detailed in the Explanation. {So follow their guidance.} [Al-An'am: 90]. (N)\n2. \n…. a) His saying ((Ancient/Qadim)): He, Glory be to Him, is described with Pre-existence (*Qidam*) in the sense that He is informed about by that, as Ibn al-Qayyim mentioned in Al-Bada'i'; and the door of informing is wider than the door of restricted Attributes (*Tawqifiyyah*). The scholars did not mention the word *Al-Qadim* among the Beautiful Names, but they inform about Him, Glory be to Him, with it. He said in Al-Nuniyyah:\n…. And He is the Ancient (*Al-Qadim*), He has never ceased in His attributes\n…. Unique, indeed, everlasting in benevolence. (M)\n b) His saying (Ancient without beginning): This wording did not appear in the Beautiful Names of Allah as the Commentator, may Allah have mercy on him, and others pointed out. Rather, many theologians (Kalam scholars) mentioned it to prove His existence before everything. The Names of Allah are restricted (*Tawqifiyyah*); it is not permissible to affirm any of them except by text from the Noble Book or the Authentic Sunnah, and it is not permissible to affirm any of them by opinion, as stated by the Imams of the Righteous Salaf. The word *Al-Qadim* does not indicate the meaning intended by the theologians because in Arabic it means 'that which precedes others', even if it was preceded by non-existence, as in His saying Almighty: {until it returns like the old (*Al-Qadim*) date stalk} [Ya-Sin: 39]. It only indicates the true meaning with the addition mentioned by the author, which is his saying: (Ancient *without beginning*). However, it should not be counted among Allah's Beautiful Names due to its lack of textual proof, and His Name, Glory be to Him, 'Al-Awwal' (The First) suffices for it, as the Mighty and Majestic said: {He is the First and the Last} [Al-Hadid: 3]. And Allah is the Guardian of success. (Z)\n c) Know that (Al-Qadim) is not among the Names of Allah Almighty. It is from the usage of the theologians. *Al-Qadim* in the language of the Arabs in which the Quran was revealed means 'the one preceding others'. It is said: 'This is *qadim*' for old, and 'this is *jadid*' for new. They did not use this name except for what precedes others, not for what was not preceded by non-existence, as He said: {until it returns like the old (*Al-Qadim*) date stalk} [Ya-Sin: 39]. The old date stalk: that which remains until the existence of the second date stalk; so if the new one exists, the first is called old (*qadim*), even if it was preceded by another, as verified by Sheikh al-Islam in ((Majmoo' al-Fatawa)) (1/245) and the Commentator in his ((Explanation)). However, Sheikh Ibn Mani' benefitted us here in what he quoted from Ibn al-Qayyim in ((Al-Bada'i')) that it is permissible to describe Him, Glory be to Him, with Pre-existence (*Qidam*) in the sense that He is informed about by that, and the door of news is wider than the door of restricted Attributes. I say: Perhaps this is the reason Sheikh al-Islam Ibn Taymiyyah used this description sometimes, as will come in what I comment on paragraph (45). (N)",
    "book_id": "954",
    "new_page_number": 11
  },
  {
    "serial_number": "32009",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": ", Eternal without end. 6- He does not perish nor cease to exist. 7- And nothing happens except what He wills. 8- Imaginations do not reach Him, and understandings do not grasp Him. 9- And creatures do not resemble Him (1). 10- Living, He does not die; Self-subsisting, He does not sleep. 11- Creator without need, Provider without burden (2). 12- Causer of death without fear, Resurrecter without difficulty. 13- He has always been Ancient with His attributes before His creation; He did not increase by their being anything He was not before them in His attribute. And as He was Pre-eternal with His attributes, so He remains Everlasting with them. 14- Not after creating the creation did He benefit the name \"The Creator\", nor by originating the creatures did He benefit the name \"The Originator\". 15- He has the meaning of Lordship while there was no subject, and the meaning of Creator while there was no created thing. 16- And just as He is the Reviver of the dead after He revived them, He deserved this name before reviving them; likewise, He deserved the name of Creator before creating them. 17- That is because He is capable over all things (3)",
    "foot_note": "1. (1) \n…. This contains a refutation of the Anthropomorphists (*Mushabbihah*), who liken the Creator to the created, Glory be to Him and Exalted. He said: {There is nothing like unto Him, and He is the Hearing, the Seeing} [Ash-Shura: 11]. The meaning is not the negation of Attributes as the people of innovation say. From the words of Abu Hanifa, may Allah have mercy on him, in ((Al-Fiqh Al-Akbar)): \"He does not resemble anything of His creation, nor does anything of His creation resemble Him.\" Then he said after that: \"And His attributes are all different from the attributes of created beings: He knows not like our knowing, He is capable not like our capability, and He sees not like our seeing.\" End quote. (N)\n2. \n…. Meaning without heaviness or hardship, as in ((Sharh al-Aqidah al-Tahawiyyah)) (p. 125, 4th Edition). (N)\n3. \n…. It appears in the speech of some people: \"And He is capable of what He wills\" (*wa huwa 'ala ma yasha'u qadir*). This is not correct (1). Rather, the correct phrase is what came in the Book and the Sunnah: \"And He is capable over all things\" (*wa huwa 'ala kulli shay'in qadir*), due to the generality of His Will and His Capability, Exalted is He, contrary to the Mu'tazilites who say that Allah did not will the occurrence of sins from the servant, but rather they occurred by the servant's will, not Allah's will. Therefore, one of their deviants says:\nThe ignorant one claimed, and whoever holds his view\n…. That sins are from the decree of the Creator\nIf what he says is true, then why did He decree\n…. The punishment for adultery and cutting the hand of the thief?\nAbu al-Khattab, may Allah have mercy on him, said in clarifying the truth and correctness:\nThey said: What about the actions of servants? I said: There is no\n…. Creator other than the Glorious God\nThey said: So is the ugly act His desire?\n…. I said: All Will belongs to the Master\nIf He did not will it and it happened, then its opposite happened\n…. Glory be to Him from being incapacitated by vice\nThis Will mentioned by Abu al-Khattab in the question is the Universal Deterministic Will (*Al-Iradah Al-Kawniyyah Al-Qadariyyah*), not the Legislative Religious Will (*Al-Iradah Al-Kawniyyah Al-Shar'iyyah*), as will be clarified later. (M)\n1. (Caution) Al-Albani, may Allah have mercy on him, said in Al-Sahihah 6/195 Hadith number (2601): His saying in the end of the Hadith: ((But I am capable of what I will - *wa lakinni 'ala ma asha'u qadir*)) indicates the error of what appeared in the commentary on ((Al-Aqidah Al-Tahawiyyah)) (p. 20) quoting some virtuous scholars: ((It appears in the speech of some people: And He is capable of what He wills, and this is not correct...)). I say: Rather, it is the very essence of correctness after being established in this Hadith, especially as it is witnessed by His saying: {And He is Able to gather them when He wills} [Ash-Shura: 29]. That does not contradict the generality of His Will and Capability, Exalted is He, as the one referred to imagined. And Allah knows best.",
    "book_id": "954",
    "new_page_number": 12
  },
  {
    "serial_number": "32010",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": ", and everything is in need of Him. And every matter is easy for Him. He needs nothing. {There is nothing like unto Him, and He is the Hearing, the Seeing} [Ash-Shura: 11]. 18- He created the creation with His knowledge. 19- And determined destinies for them. 20- And set fixed life spans for them. 21- Nothing was hidden from Him before He created them. And He knew what they would do before He created them. 22- And He commanded them to obey Him, and forbade them from disobeying Him. 23- And everything runs according to His decree and His will, and His will is executed. There is no will for the servants except what He willed for them; so what He willed for them happened, and what He did not will did not happen (1).",
    "foot_note": "1. (1) \n…. Meaning that His Will (*Mashi'ah*) and Intent (*Iradah*) are comprehensive of everything that occurs in this universe of good or evil, guidance or misguidance. The verses indicating this are many and well-known, can be reviewed in the Explanation and elsewhere.\n…. The purpose of this paragraph is to refute the Mu'tazilah who deny the generality of His Will. However, it must be known that this does not imply that Allah loves everything that happens, for Love (*Mahabbah*) is different from Will (*Iradah*); otherwise, there would be no difference with Allah between the obedient and the sinner. This is what some major proponents of Pantheism (*Wahdat al-Wujud*) stated, that both the obedient and the sinner are obedient to Allah in His Will! The school of the Salaf, the Jurists, and most affirmers of Destiny (*Qadar*) from Ahl al-Sunnah and others differentiate between Will and Love. To that, the author of the poem ((Bad' al-Amali)) pointed by saying:\nHe wills good and the ugly evil\n…. But He is not pleased with the impossible (absurdity/evil acts as religion)\nSheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, said: ((Then the Qadariyyah said: He does not love disbelief, immorality, and disobedience, and He does not will that! So there is what He did not will, and He wills what did not happen!)). A group of the (Affirmers) said: What He willed happened and what He did not will did not happen. Therefore, He has willed disbelief, immorality, and disobedience, but He did not will it as a religion; or He willed it from the disbeliever and did not will it from the believer. Thus, for that reason, He loves disbelief, immorality, and disobedience, but does not love it as religion, and loves it from the disbeliever but does not love it from the believer.\n…. Both sayings are errors contradicting the Book and Sunnah, and the consensus of the predecessors of the Ummah and its Imams. For they agree that what Allah wills happens, and what He does not will does not happen, and that nothing happens except by His will. And (they agree) totally that He does not love corruption, and is not pleased with disbelief for His servants, and that the disbelievers {plan by night speech which He does not approve} [An-Nisa: 108]. (N)",
    "book_id": "954",
    "new_page_number": 13
  },
  {
    "serial_number": "32011",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "24- He guides whom He wills, protects and grants well-being, out of grace; and He misguides whom He wills, forsakes and tests, out of justice. 25- And all of them fluctuate within His will, between His grace and His justice. 26- And He is exalted above opposites and equals. 27- There is no repeller of His decree, no one to delay His judgment, and no one to overcome His command. 28- We have believed in all of that. And we are certain that everything is from Him.\n\n[Belief in the Prophethood of the Prophet Muhammad, peace be upon him]\n29- And (we believe) that Muhammad is His chosen servant, His selected Prophet, and His approved Messenger (1). 30- And that he is the Seal of the Prophets, the Imam of the Pious, and the Master of the Messengers (2), and the Beloved of",
    "foot_note": "1. (1) \n…. Know that every Messenger (*Rasul*) is a Prophet (*Nabi*), but not every Prophet is a Messenger. They have mentioned differences between the Messenger and the Prophet, which you can see in ((Tafsir al-Alusi)) (5/449-450) and others. Perhaps the closest is that a Messenger is one sent with a new law (*Sharia*), and a Prophet is one sent to confirm the law of one before him, and he is naturally commanded to convey it, as it is known that scholars are commanded to do so, thus they (Prophets) are more deserving of that, as is obvious. (N)\n2. \n…. I say: This creed is established in many widespread Hadiths, accepted by the Ummah. The Commentator mentioned (on page 169 - 4th Edition) a group of them, so check them there; they provide knowledge and certainty. He, peace be upon him, is the Master of Messengers with certainty. It is regrettable to say: This creed is not believed in by those who stipulate that for a Hadith to mandate belief, it must be *Mutawatir* (mass transmitted), so how can it be believed by one who declared that Creed is taken only from the Quran, like Sheikh Shaltut and others? I have refuted all of them from twenty angles in my treatise ((The Obligation of Accepting Ahad Hadith in Creed and Refuting the Doubts of Opponents)), and I mentioned at its end twenty examples of beliefs established in authentic Hadiths that they are forced to deny and not believe in; this creed is one of them. So review it, for it is printed and important. (N)",
    "book_id": "954",
    "new_page_number": 14
  },
  {
    "serial_number": "32012",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "the Lord of the Worlds (1). 31- And every claim of Prophethood after him is error and desire (2).",
    "foot_note": "1. (1) \n…. I say: Rather, he is the *Khalil* (Close Friend) of the Lord of the Worlds, for *Khullah* is a higher and more complete rank than *Mahabbah* (Love). Therefore, he, peace be upon him, said: ((Indeed, Allah has taken me as a Khalil just as He took Abraham as a Khalil)). That is why it is not established in any Hadith that he, peace be upon him, is the *Habib* (Beloved) of Allah. So take note, and refer to the next paragraph (52) for an expansion on this in the Commentator's words regarding it. (N)\n2. \n…. I say: The Prophet, peace be upon him, informed his Ummah, advising and warning them in many Hadiths, that there will be many impostors (*Dajjalun*) after him. He said in some of them: ((Every one of them claims he is a prophet, and I am the Seal of the Prophets, there is no prophet after me)). Narrated by Muslim and others (Al-Ahadith Al-Sahihah 1683). Among these impostors is ((Mirza Ghulam Ahmad Qadiani)) who claimed prophethood and has followers spread in India, Germany, England, and America; they have mosques there where they misguide Muslims. There were individuals of them in Syria; Allah uprooted them and cut off their trace. They have many beliefs other than their belief in the continuation of prophethood after him, peace be upon him. Their predecessor in this was Ibn Arabi the Sufi, and they have a treatise in which they collected his sayings to support their mentioned belief. The Sheikhs were unable to refute it because it is what Ibn Arabi said! Despite their certainty in declaring them disbelievers. There is no room to mention any of their beliefs now. They are undoubtedly among those meant by the Messenger of Allah, peace be upon him, in the authentic Hadith: ((There will be in the end of times liars and impostors coming to you with hadiths you have not heard, nor your fathers; so beware of them and let them beware of you, lest they misguide you and tempt you)). Narrated by the author in ((Mushkil al-Athar)) (4/104). It is in ((Imam Muslim)) (1/9). Among their most prominent signs is that when they begin talking about their call, they start before anything else by proving the death of Jesus, peace be upon him. If they establish that, according to their claim, they move to a second stage, which is mentioning the Hadiths reported about the descent of Jesus, peace be upon him, and pretending to believe in them. Then they quickly interpret them, since they established his death according to their claim, saying that what is meant is the descent of the *likeness* of Jesus! And that he is Ghulam Ahmad Qadiani! They have much, very much of such interpretation, which makes us certain that they are a sect of the heretical Batiniyyah. Reference to some of their deviant beliefs will come shortly, God willing. (N)",
    "book_id": "954",
    "new_page_number": 15
  },
  {
    "serial_number": "32013",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "32- He is the one sent to the generality of the Jinn (1) and all of mankind, with Truth and Guidance, and with Light and Radiance.\n\n[Belief in the Holy Quran]\n33- And (we believe) that the Quran is the Word of Allah (2), from Him it began without modality as speech, and He sent it down upon His Messenger as revelation. The believers believed him regarding that as truth, and were certain that it is the Word of Allah Almighty in reality, not created like the speech of creation. So whoever hears it and claims it is the speech of humans has disbelieved. Allah has condemned him, faulted him, and threatened him with Saqar (Hellfire), where He Almighty said: {I will drive him into Saqar} [Al-Muddaththir: 26]. Since Allah threatened with Saqar the one who said: {This is not but the word of a human being} [Al-Muddaththir: 25], we knew and were certain that it is the statement of the Creator of humans, and it does not resemble the speech of humans (3).",
    "foot_note": "1. (1) \n…. I say: Among the deviations of the Qadianiyyah is their denial of the Jinn as a creation distinct from humans. They interpret all verses and hadiths explicitly stating their existence and distinction from humans in creation, to mean that they are humans themselves or a group of them; even Iblis himself, they say he is an evil human! How misguided they are!. (N)\n2. \n…. The Great Quran is the Word of Allah, its wording and its meanings. It is not said that the Quran is the wording without the meaning as is the saying of the Mu'tazilah, nor the meaning without the wording as is the saying of the deviant Kullabiyyah and those who followed them in their falsehood from the people of blameworthy rhetoric (Kalam). Ahl al-Sunnah wal-Jama'ah say and believe that the Quran is the Word of Allah, sent down, not created; its words and meanings are the very speech of Allah. Gabriel heard it from Allah, and the Prophet heard it from Gabriel, and the Companions heard it from the Prophet. It is written in the Mushafs (copies), preserved in the chests (hearts), recited by the tongues. Al-Hafiz Ibn al-Qayyim, may Allah have mercy on him, said:\nLikewise, the Quran is the very essence of His speech\n…. Heard from Him in reality with clarification\nIt is the saying of my Lord, all of it, not part of it\n…. Wording and meaning, neither are created\nThe revelation of the Lord of the Worlds and His inspiration\n…. The wording and the meaning, without evasion (M)\n3. \n…. Sheikh al-Islam Ibn Taymiyyah quoted this speech from the author, may Allah have mercy on him, in ((Majmoo' al-Fatawa)) (12/507) citing it as evidence. The Commentator Ibn Abi al-Izz, may Allah have mercy on him (p. 179 - 4th Edition), said: ((This which Al-Tahawi, may Allah have mercy on him, recounted is the Truth indicated by the evidences of the Book and Sunnah for those who ponder them, and testified to by the sound nature (*Fitrah*) not altered by doubts, skepticisms, and false opinions. People have separated regarding the issue of Speech (*Kalam*) into nine sayings)): Then he listed them, including the third, which is that it is a single meaning subsisting in the Essence of Allah; it is Command, Prohibition, News, and Inquiry; if expressed in Arabic it is Quran, if expressed in Hebrew it is Torah. This is the saying of Ibn Kullab and those who agreed with him, like Al-Ash'ari and others. He said: And the seventh is that His speech implies a meaning subsisting in His Essence which is what He created in others; this is the saying of Abu Mansur al-Maturidi\n…. And the ninth is that He, the Exalted, has never ceased speaking if He wills, when He wills, and how He wills, and He speaks with a voice that is heard, and that the *type* of speech is Pre-eternal (*Qadim*) even if the specific voice is not Pre-eternal. This is what is narrated from the Imams of Hadith and Sunnah. His saying: ((The Word of Allah, from Him it began without modality as speech)) is a refutation of the Mu'tazilah and others. For the Mu'tazilah claim that the Quran did not begin from Him, as their saying was recounted previously. Sheikh Muhammad bin Mani', may Allah have mercy on him, said (p. 8): ((The Great Quran is the Word of Allah, its wording and its meanings. It is not said the wording without the meaning as is the saying of the Mu'tazilah, nor the meaning without the wording as is the saying of the deviant Kullabiyyah and those who followed them in their falsehood from the people of blameworthy rhetoric. Ahl al-Sunnah wal-Jama'ah say and believe that the Quran is the Word of Allah, sent down, not created; its words and meanings are the very speech of Allah. Gabriel heard it from Allah, and the Prophet heard it from Gabriel, and the Companions heard it from the Prophet. It is written in the Mushafs, preserved in the chests, recited by the tongues. =\n…. Al-Hafiz Ibn al-Qayyim, may Allah have mercy on him, said: Likewise, the Quran is the very essence of His speech, heard from Him in reality with clarification. It is the saying of my Lord, all of it, not part of it; wording and meaning, neither are created. The revelation of the Lord of the Worlds and His inspiration; the wording and the meaning, without evasion)). The Commentator, may Allah have mercy on him, said (p. 194-195): ((Al-Tahawi's speech, may Allah have mercy on him, refutes the saying of those who said: It is a single meaning that cannot be conceived as being heard from Him, and that what is heard, revealed, recited, and written is not the Word of Allah, but rather an expression of it. For Al-Tahawi, may Allah have mercy on him, says: ((The Word of Allah, from Him it began)). Likewise, others of the Salaf said, and they say: From Him it began, and to Him it returns. They only said: 'From Him it began', because the Jahmiyyah among the Mu'tazilah and others used to say that He created speech in a locus, so speech began from that locus. So the Salaf said: ((From Him it began)), meaning He is the One speaking it, so from Him it began, not from some created things. As the Almighty said: {The revelation of the Book is from Allah, the Exalted in Might, the Wise} [Az-Zumar: 1]. {But the word from Me has come into effect} [As-Sajdah: 13]. {Say, \"The Holy Spirit has brought it down from your Lord in truth\"} [An-Nahl: 102]. The meaning of their saying: ((And to Him it returns)): It will be lifted from the chests and the Mushafs, so not a verse of it will remain in the chests nor in the Mushafs. As came in several traditions. And his saying ((without modality)): meaning: the modality of His speaking it is not known. ((As speech)): not metaphorically. ((And He sent it down upon His Messenger as revelation)): meaning: He sent it down to him on the tongue of the Angel; so the Angel Gabriel heard it from Allah, and the Messenger Muhammad, peace be upon him, heard it from the Angel, and recited it to the people. The Almighty said: {And [it is] a Qur'an which We have separated by intervals that you might recite it to the people over a prolonged period. And We have sent it down progressively.} [Al-Isra: 106]. And the Almighty said: {The Trustworthy Spirit has brought it down * Upon your heart, [O Muhammad] - that you may be of the warners * In a clear Arabic language.} [Ash-Shu'ara: 193-195]. In this is affirmation of the attribute of Highness (*Uluww*) for Allah Almighty. (N)",
    "book_id": "954",
    "new_page_number": 16
  },
  {
    "serial_number": "32014",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "[Describing Allah with a meaning from human meanings]\n34- Whoever describes Allah with a meaning from human meanings has disbelieved. So whoever sees this takes heed, and from the likes of the disbelievers' speech refrains, and knows that He, in His attributes, is not like humans.\n\n[Vision of Allah is Truth]\n35- The Vision (*Al-Ru'yah*) (1) is true for the people of Paradise, without encompassing and without modality. As the Book of our Lord pronounced: {[Some] faces, that Day, will be radiant, * Looking at their Lord.} [Al-Qiyamah: 22-23]. Its explanation is as Allah Almighty willed and knew. And everything that came regarding that in the authentic Hadith from the Messenger, peace be upon him, is as he said (2).",
    "foot_note": "1. (1) \n…. There is no doubt that the believers will see their Lord on the Day of Resurrection from above them, as established from the Prophet, peace be upon him. They will see their Lord with their eyesight, a real vision, just as they see the moon and the sun clearly without clouds before them. This is Mutawatir (mass transmitted) from the Prophet, peace be upon him; no one denied it except the Mu'tazilah and those who followed them in error. He said in Al-Nuniyyah:\nAnd they see Him, Glory be to Him, from above them\nWith the look of the eye, just as the two moons (sun and moon) are seen\nThis is Mutawatir from the Messenger of Allah\nNone denied it except the corrupt in faith\nAs for in this world, no one of His servants sees Him, Glory be to Him. When the Prophet, peace be upon him, was asked: Did you see your Lord? He said: ((Light, how could I see Him?)), meaning lights prevented me from seeing Him Almighty. And Aisha said: Whoever tells you that Muhammad saw his Lord has lied. (M)\n2. \n…. Know that the Hadiths narrated regarding affirming the believers' vision of their Lord on the Day of Resurrection are very numerous, reaching the level of Tawatur (mass transmission) as asserted by a group of Imams. Among them is the Commentator, who referenced some of them and then said: ((About thirty Companions narrated the Hadiths of the Vision)). Whoever encompasses knowledge of them cuts (is certain) that the Messenger said them. Were it not that I committed to brevity, I would have cited the Hadiths on the topic. Then he said: ((Likening the vision of Allah Almighty to the vision of the sun and moon is not likening Allah, but rather likening the act of seeing to the act of seeing, not likening the Seen to the seen. But in it is evidence of Allah's Highness (*Uluww*) over His creation; otherwise, is vision conceivable without facing? Whoever says: He is seen not in a direction, let him check his mind!! Either he is denying his mind or there is something (wrong) in his mind. Otherwise, if he says He is seen neither in front of the seer, nor behind him, nor to his right, nor to his left, nor above him, nor below him, everyone who hears him refutes him with his sound nature)). I say: As for seeing Him Almighty in this world, the Messenger of Allah, peace be upon him, informed in the authentic Hadith that none of us will see Him until he dies. Narrated by Muslim. As for he himself, peace be upon him, nothing established has been narrated affirming it for him upon which proof can be based. Rather, it is authentically reported from him indicating its negation when he was asked about it, saying: =\n…. ((Light, how could I see Him?)). Moreover, Lady Aisha asserted its negation as in the Two Sahihs (Bukhari and Muslim), and this is the basic principle so it should be adhered to. (N)",
    "book_id": "954",
    "new_page_number": 17
  },
  {
    "serial_number": "32015",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "And its meaning is according to what He willed. We do not enter into that interpreting with our opinions, nor deluding with our desires. For no one is safe in his religion except he who submits to Allah, the Mighty and Majestic, and to His Messenger, peace be upon him, and refers the knowledge of what is ambiguous to him to its Knower.\n\n[Submission and Surrender]\n36- ((And the foot of Islam is not firm except on the back of submission and surrender)) (1). So whoever seeks knowledge of what has been barred from him to know, and his understanding is not satisfied with submission, his seeking veils him from pure Tawhid, clear gnosis, and correct faith. He oscillates between disbelief and faith, confirmation and denial, acknowledgment and rejection; obsessed, wandering, doubting, deviating; neither a confirming believer, nor a denying rejecter.\n37- And belief in the Vision - for the people of the Abode of Peace - is not correct for one who considers it with delusion (*Wahm*) (2) or interprets it with understanding (*Ta'wil*) (3); since the interpretation of the Vision - and the interpretation of every meaning attributed to Lordship - is by abandoning interpretation and adhering to submission. And upon this is the religion of the Muslims (4). And whoever does not guard against negation (*Nafy*) and anthropomorphism (*Tashbih*) has slipped and has not hit upon transcendence (*Tanzih*) (5).",
    "foot_note": "1. (1) \n…. This paragraph precedes the previous paragraph in the three manuscripts and also in the edition of our Sheikh Al-Tabbakh, may Allah have mercy on him, and perhaps it is more appropriate. (N)\n2. \n…. a) Meaning: He imagines that Allah Almighty is seen in such-and-such description, thus imagining a likeness. And his saying \"or interprets it with understanding\" means he claims to understand an interpretation for it that contradicts its apparent meaning and what every Arab understands from its meaning. (M)\n…. b) Meaning: He imagines that Allah Almighty is seen in such-and-such description, thus imagining a likeness. Sharh al-Tahawiyyah. (N)\n3. \n…. Meaning he claims to understand an interpretation for it that contradicts its apparent meaning, and what every Arab understands from its meaning. (N)\n4. \n…. In the three manuscripts and printed versions: ((Al-Mursalin - The Messengers)). (N)\n5. \n…. a) That is because the Mu'tazilah claim they are purifying (making *Tanzih* of) Allah Almighty by this negation. Is purification achieved by negating attributes of perfection? For negating Vision is not an attribute of perfection, as the non-existent is what is not seen; perfection is in affirming Vision. (M)\n b) I say: That is because the deniers of Attributes and Vision from the Mu'tazilah and others only deny them as a purification of Allah Almighty, according to their claim, from likeness (*Tashbih*). This is a slip, deviation, and error. How can that be purification when it denies attributes of perfection from Allah, including Vision? For the non-existent is what is not seen. Perfection lies in affirming the Vision established in the Book and Sunnah. The Anthropomorphists (*Mushabbihah*) slipped due to their excess in affirming attributes and likening the Creator to the creature, Glory be to Him. The truth is between these and those: Affirmation without likeness (*Tashbih*), and Purification (*Tanzih*) without negation/disabling (*Ta'til*). How excellent is the saying: The Negator (*Mu'attil*) worships nothingness, and the Anthropomorphist (*Mujassim*) worships an idol. (N)",
    "book_id": "954",
    "new_page_number": 18
  },
  {
    "serial_number": "32016",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "For our Lord, Mighty and Majestic, is described with attributes of Oneness, characterized by characteristics of Uniqueness; no one from creation is in His meaning.\n\n[Refutation of the Anthropomorphists]\n38- And He is Exalted (1) above limits (*Hudud*) (2), ends (*Ghayat*) (3),",
    "foot_note": "1. (1) \n…. In the three manuscripts and other printed versions: ((Ta'ala)) without the Waw (And). Perhaps it is more correct. (N)\n2. \n…. His saying \"Exalted above limits... etc.\" He intends by this to refute the Anthropomorphists (*Mushabbihah*). However, these words are generalized and ambiguous, and are not among the terms recognized by Ahl al-Sunnah wal-Jama'ah. Refuting them with texts from the Book and Sunnah is more worthy and appropriate than mentioning words that imply contrary to correctness. In His saying Almighty: {There is nothing like unto Him, and He is the Hearing, the Seeing} is a refutation of the Anthropomorphists and the Negators (*Mu'attilah*). So the seeker of truth should not turn to such ambiguous words nor rely on them. For Allah Glory be to Him is described with attributes of perfection, characterized by characteristics of greatness and majesty. He, Glory be to Him, is above His creatures, established (*Mustawin*) on His Glorious Throne in His Essence, separate from His creation. He descends every night to the lowest heaven and comes on the Day of Resurrection, all of that in reality (*Haqiqah*). We do not interpret it (*Nu'awwiluhu*) just as we do not interpret the Hand as Power, nor Descent as the descent of His command, and other attributes. Rather, we affirm that as an affirmation of existence, not an affirmation of modality (*Takyif*). How rich the Imam Author was to dispense with such generalized, delusive, invented words. If it were said they were inserted upon him and are not his words, that would not be far-fetched to me, thinking well of this Imam. In any case, falsehood is rejected upon\n…. its speaker whoever he is. Whoever reads the biography of the author Al-Tahawi, especially in Lisan al-Mizan, knows he is among the greatest scholars and grandest men. This is what led us to think well of him in many places where there is room for a critic. (M)\n3. \n…. His saying: ((Exalted above limits, ends, pillars, limbs, tools, and the six directions like all\n…. originated things)). This speech contains ambiguity which the people of interpretation (*Ta'wil*) and heresy (*Ilhad*) in Allah's names and attributes might exploit. But they have no argument in it because his intention, may Allah have mercy on him, is declaring the Creator, Glory be to Him, transcendent above resembling creatures. However, he used a generalized phrase needing detailing to remove ambiguity. By \"limits\" (*Hudud*) he means those known to humans; for He, Glory be to Him, His limits are known only to Him, Glory be to Him, because creation does not encompass Him in knowledge, as the Mighty and Majestic said in Surah Taha: {He knows what is [presently] before them and what will be after them, but they do not encompass it in knowledge.} [Taha: 110]. Whoever among the Salaf spoke of affirming a limit (*Hadd*) regarding *Istiwa* (Rising) or otherwise, meant a limit known to Allah Glory be to Him and not known to the servants. As for (ends, pillars, limbs, tools), his intention, may Allah have mercy on him, is declaring Him transcendent above resembling creatures in His wisdom and His essential attributes like Face, Hand, Foot, and similar things. He, Glory be to Him, is described with that, but His attributes are not like the attributes of creation, and none knows their modality except Him, Glory be to Him. The people of innovation use such terms to deny Attributes using words other than what Allah spoke and affirmed for Himself, so they are not exposed and so the people of truth do not condemn them. The author Al-Tahawi, may Allah have mercy on him, did not intend this objective because he is from Ahl al-Sunnah who affirm Allah's attributes. His speech in this Creed explains itself and verifies itself, and its ambiguous parts are interpreted by its clear parts. Likewise his saying (the six directions do not encompass Him like all originated things); his intent is the six *created* directions, and his intent is not to deny Allah's Highness (*Uluww*) and His Rising (*Istiwa*) over His Throne, because that is not included in the six directions; rather He is above the world and encompassing it. Allah has created His servants with the innate nature (*Fitrah*) to believe in His Highness, Glory be to Him, and that He is in the direction of Above. Ahl al-Sunnah wal-Jama'ah from the Companions of the Prophet, peace be upon him and his family, and those who follow them in goodness, have agreed on that. The evidences from the Book and the Authentic Mutawatir Sunnah all indicate that He is in the Highness (*Uluww*), Glory be to Him. So pay attention to this great matter, O noble reader, and know that it is the Truth and whatever else is false. And Allah is the Guardian of success. (Z)",
    "book_id": "954",
    "new_page_number": 19
  },
  {
    "serial_number": "32017",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "pillars, members, and tools. The six directions do not encompass Him (1) like all originated things (2).",
    "foot_note": "1. (1) \n…. The evidences of the Book and Sunnah indicate that Allah Almighty is above His creatures, established over His Throne, as the Almighty said: {The Most Merciful rose over the Throne}. And He said: {And He is the Subjugator over His servants}. So the six directions are non-existent in His right because He Almighty is above them, as Ibn al-Qayyim said in Al-Nuniyyah:\nAll directions in their entirety are non-existent in His right\nHe is above them, clearly\nHe is separate from them all, for He is the Encompasser\nAnd the Creator of universes is not encompassed. (M)\n2. \n…. I say: The author's intention, may Allah have mercy on him, with this paragraph is to refute two groups: First: The Anthropomorphists (*Mujassimah*) and Likening Ones (*Mushabbihah*) who describe Allah as having a body, mass, and members, etc. Exalted is Allah above what they say with great highness. And the other: The Negators (*Mu'attilah*) who deny His Highness (*Uluww*) over His creation and that He is separate from His creation. Rather, some of them declare that He exists in His Essence in all existence! This means Allah dwelling (*Hulul*) in His creatures. And (they claim) that He is encompassed by the six created directions, and not above them. So the author denied that with this speech. However, some innovators might exploit this and interpret it in a way leading to Negation (*Ta'til*) as the Commentator, may Allah have mercy on him, explained. Sheikh Muhammad bin Mani', may mercy be upon him, summarized his words saying (p. 10): ((His intention by that is refuting the Mushabbihah, but these words are generalized and ambiguous and are not the familiar terms of Ahl al-Sunnah wal-Jama'ah. Refuting them with texts of the Book and Sunnah is more worthy and appropriate than mentioning words implying contrary to correctness. For in His saying Almighty: {There is nothing like unto Him, and He is the Hearing, the Seeing} is a refutation of the Mushabbihah and Mu'attilah. So the seeker of truth should not turn to such words nor rely on them. For Allah Glory be to Him is described with attributes of perfection, characterized by characteristics of greatness and majesty. He, Glory be to Him, is above His creatures, established on His Glorious Throne in His Essence, separate from His creation. He descends every night to the lowest heaven and comes on the Day of Resurrection, all of that in reality. We do not interpret it, just as we do not interpret the Hand as Power and Descent as the descent of His command and other attributes. Rather, we affirm that as an affirmation of existence, not an affirmation of modality. How rich the Imam Author was to dispense with such generalized, delusive, invented words. If it were said they were inserted upon him and are not his words, that would not be far-fetched to me, thinking well of this Imam. In any case, falsehood is rejected upon its speaker whoever he is. =\n…. Whoever reads the biography of the author Al-Tahawi, especially in Lisan al-Mizan, knows he is among the greatest scholars and grandest men. This is what led us to think well of him in many places where there is room for a critic)). End of Ibn Mani's speech, may Allah have mercy on him. (N)",
    "book_id": "954",
    "new_page_number": 20
  },
  {
    "serial_number": "32018",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "[Belief in the Night Journey and Ascension]\n39- The Ascension (*Mi'raj*) is true. The Prophet, peace be upon him, was taken on a Night Journey (*Isra*), and ascended in person while awake to the Heaven, and from there to where Allah willed of the Heights. Allah honored him with what He willed and revealed to him what He revealed: {The heart did not lie about what it saw} (1) [An-Najm: 11]. So may Allah bless him and grant him peace in the Hereafter and the First (life).\n\n[Belief in the Pond, Intercession, and Covenant]\n40- The Pond (*Al-Hawd*) which Allah Almighty honored him with - as a succor for his Ummah - is true (2).\n41- The Intercession (*Al-Shafa'ah*) which He stored for them is true, as narrated in the traditions (*Akhbar*) (3).\n42- The Covenant (*Al-Mithaq*) which Allah Almighty took from Adam and his offspring is true (4)",
    "foot_note": "1. (1) \n…. I say: Meaning of the Great Signs of his Lord. As for saying that he, peace be upon him, saw his Lord that night with his eye, it is not established as previously noted recently. Therefore, the Commentator and others said: ((The correct view is that he saw Him with his heart and did not see Him with the eye of his head)). (N)\n2. \n…. I say: The Hadiths in which the Pond is mentioned are very numerous, reaching the level of Tawatur as declared by a group of Imams. Some thirty-odd Companions narrated them. Al-Hafiz Ibn Kathir exhausted their chains in ((Al-Nihayah)) at the end of his history. Al-Hafiz Ibn Abi Asim dedicated seven chapters to them in ((Kitab al-Sunnah)) (Numbers 155-161) and Hadith numbers (697-776 - my checking), indicating their Tawatur at the end by saying: ((The reports we mentioned regarding the Pond of the Prophet, peace be upon him, necessitate knowledge)). (N)\n3. \n…. It is also Mutawatir. Ibn Abi Asim dedicated six chapters to it in ((Al-Sunnah)) (163-168) Hadith numbers (784-832). The Commentator, may Allah have mercy on him, cited a group of them in his explanation, including that his intercession, peace be upon him, is of eight types. Whoever wishes to research and verify should review it, for it is important. (N)\n4. \n…. I say: He refers to some Hadiths explicitly stating that Allah Almighty extracted the offspring from the loins of Adam, peace be upon him. Four of them are mentioned in the Explanation, and they are referenced in my notes on it and in: =\n…. ((Takhrij al-Sunnah)) (Nos. 195-205). I had excluded in the referenced note (p. 266 - 4th Edition) the wiping of the back mentioned in the Hadith of Umar from being authentic, and that was an oversight from me, I ask Allah Almighty to forgive me. I have realized that it has a good supporting evidence (*Shahid Hasan*) from the Hadith of Abu Hurairah mentioned in ((The Explanation)) and another from the Hadith of Ibn Abbas with a weak chain which I referenced in ((Al-Sunnah)) (203), so a notification was required. (N)",
    "book_id": "954",
    "new_page_number": 21
  },
  {
    "serial_number": "32019",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "[Belief in Allah's Knowledge]\n43- Allah Almighty has known since eternity the number of those entering Paradise and the number of those entering the Fire as a single total; nothing is added to that number nor subtracted from it (1).\n\n[Actions of the Servants]\n44- And likewise their actions, regarding what He knew from them that they would do. Every person is facilitated for what he was created for (2).",
    "foot_note": "1. (1) \n…. The author, may Allah have mercy on him, refers to the Hadith of Abdullah bin Amr who said: The Messenger of Allah, peace be upon him, came out to us with two books in his hand. He said: ((Do you know what these two books are?)) We said: ((No, O Messenger of Allah, unless you tell us)). He said regarding the one in his right hand: ((This is a book from the Lord of the Worlds, containing the names of the people of Paradise, and the names of their fathers and tribes, then it is summed up at the end, so no one will be added to them nor subtracted from them ever)). Then he said regarding the one in his left: ((This is a book from the Lord of the Worlds containing the names of the people of the Fire, and the names of their fathers and tribes, then it is summed up at the end, so no one will be added to them nor subtracted from them ever)). His companions said: So why work if the matter is already finished? He said: ((Aim for correctness and closeness, for the person of Paradise will have his life sealed with the deed of the people of Paradise, regardless of what he did before. And the person of the Fire will have his life sealed with the deed of the people of the Fire, regardless of what he did before)). Then the Messenger of Allah, peace be upon him, gestured with his hands and threw them down, then said: ((Your Lord has finished with the servants: {A group in Paradise and a group in the Blaze} [Ash-Shura: 7])). Narrated by Al-Tirmidhi who authenticated it, along with others. It is referenced in ((Al-Sahihah)) (848). (N)\n2. \n…. This is a piece of the Hadith of Ali narrated in the ((Two Sahihs)). I referenced it in ((Takhrij al-Sunnah)) under number (171). It is authentic that some Companions, when they heard this Hadith from him, peace be upon him, said: \"Then we shall strive.\" And in a narration: \"So now we strive, now we strive, now we strive.\" See ((Al-Sunnah)) (161 and 167). In it is a clear refutation of the fatalistic Jabriyyah who understand from the Hadith contrary to the understanding of the Companions, so reflect. (N)",
    "book_id": "954",
    "new_page_number": 22
  },
  {
    "serial_number": "32020",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "[Actions are by Endings]\nAnd actions are by endings (1). The happy one is he who is happy by Allah's decree, and the wretched one is he who is wretched by Allah's decree (2).\n\n[Belief in Decree and Destiny]\n45- The foundation of Destiny (*Qadar*) is the secret of Allah Almighty in His creation (3)",
    "foot_note": "1. (1) \n…. This is part of a Hadith of Sahl bin Sa'd al-Sa'idi, narrated by Ahmad and Al-Bukhari. Referenced in the previous source (216). (N)\n2. \n…. a) Al-Hafiz Ibn Rajab said: Belief in Destiny is on two levels; First: Belief that Allah preceded in His knowledge what servants will do of good and evil, obedience and disobedience, before creating and bringing them into existence, and who among them is of the people of Paradise and who is of the people of Fire, and prepared for them reward and punishment as recompense for their deeds before creating and forming them, and that He wrote that with Him and counted it, and that servants' deeds run according to what preceded in His knowledge and writing. Second: That Allah created all actions of servants, disbelief and faith, obedience and disobedience, and willed them from them. This level is affirmed by Ahl al-Sunnah wal-Jama'ah and denied by the Qadariyyah. The first level was affirmed by many Qadariyyah and denied by their extremists like Ma'bad al-Juhani. Many of the Salaf said: Debate the Qadariyyah regarding Knowledge (*Ilm*); if they affirm it, they are defeated, and if they deny it, they disbelieve. How excellent is the saying of Imam Al-Shafi'i:\nWhat You willed happened, even if I did not will\nAnd what I willed, if You did not will, did not happen\nYou created servants upon what You knew\nSo in Knowledge runs the young and the old\nUpon this one You bestowed favor, and this one You forsook\nAnd this one You aided, and that one You did not aid\nSo among them is wretched, and among them is happy\nAnd among them is ugly, and among them is beautiful. (M)\n b) This is the meaning of a Hadith narrated by Al-Bazzar and others from Abu Hurairah raised (to the Prophet) with the wording: ((The wretched one is wretched in his mother's womb, and the happy one is happy in his mother's womb)). Its chain is authentic as I clarified in ((Al-Rawd al-Nadir)) (1098) and ((Takhrij al-Sunnah)) (188). (N)\n3. \n…. The Commentator said: The foundation of Destiny is Allah's secret in His creation, which is that He created and destroyed, impoverished and enriched, caused death and gave life, misled and guided. What Ahl al-Sunnah wal-Jama'ah are upon is that everything is by Allah's Decree and Destiny, and that Allah Almighty is the Creator of servants' actions. He Almighty said: {Indeed, all things We created with predestination} [Al-Qamar: 49]. And that Allah Almighty =\n…. wants disbelief from the disbeliever and wills it, but does not accept it nor love it; so He wills it cosmically/existentially (*Kawnan*) but does not accept it religiously (*Dinan*). I say: This Will is the Universal Deterministic Will (*Al-Iradah Al-Kawniyyah Al-Qadariyyah*). As for willing faith from the believer and all righteous deeds, it is a Universal Deterministic Religious Will (*Iradah Kawniyyah Qadariyyah Shar'iyyah* - Note: Religious will implies love, Deterministic implies occurrence). All actions of servants, obedience and disobedience, disbelief and faith, occur from them by Allah Almighty's Will. This is the meaning of 'What Allah willed happened, and what He did not will did not happen.' (M)",
    "book_id": "954",
    "new_page_number": 23
  },
  {
    "serial_number": "32021",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "Neither a drawn-near angel nor a sent prophet has reviewed that. Deep diving and looking into that is a means to forsakenness, a ladder to deprivation, and a degree of transgression. So beware, all beware, of that in looking, thinking, and whispering (1). For Allah Almighty folded the knowledge of Destiny from His creatures and forbade them from seeking it, as He Almighty said in His Book: {He is not questioned about what He does, but they will be questioned} (2)",
    "foot_note": "1. (1) \n…. I say: This deep diving is what is meant—and Allah knows best—by his saying, peace be upon him: ((...and when Destiny is mentioned, hold back)). It is an authentic Hadith, narrated from a group of Companions, and I referenced it in ((Al-Sahihah)) (34). (N)\n2. \n…. Meaning due to the perfection of His wisdom, mercy, and justice, not merely His dominance and power as Jahm and his followers say. Thus in ((The Explanation)). Refer therein to the verification that the basis of servitude and faith is submission and not asking about the details of wisdom in commands, prohibitions, and laws, for it is very important. Were it not for space constraints, I would have quoted it entirely for its value and rarity. Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, said in ((Majmoo' al-Fatawa)) (1/148-150) condensing some paragraphs: ((Belief in Destiny is on two degrees, each degree containing two things: First Degree: Belief that Allah Almighty knew what creation would do with His Ancient Knowledge which He is described with eternally, and knew all their states of obedience and disobedience, provisions and lifespans. Then Allah wrote the destinies of creation in the Preserved Tablet. ((The first thing Allah created was the Pen, He said (*) to it: =\n(*) Thus it appeared here, meaning the narration ((Fa-qala lahu)), but the preponderant view to me is the other narration with the wording: ((Thumma qala lahu - Then He said to it)) as I verified in ((Takhrij Sharh al-Tahawiyyah)). It has a supporting evidence from Ibn Abbas referenced in Al-Sahihah (133). (N)\n…. Write. It said: What shall I write? He said: Write what will exist until the Day of Resurrection. Whatever hit a person was not to miss him, and whatever missed him was not to hit him. The pens have dried and the sheets folded, as the Almighty said: {Do you not know that Allah knows what is in the heaven and earth? Indeed, that is in a Record. Indeed that, for Allah, is easy.} [Al-Hajj: 70].\n…. This estimation following His knowledge, Glory be to Him, occurs in places generally and specifically. He wrote in the Preserved Tablet what He willed. And when He creates the body of the fetus before blowing the soul into it, He sends an angel to it, who is commanded with four words: Write his provision, his lifespan, his deed, and whether wretched or happy, and the like. This Destiny was denied by the extremists of the Qadariyyah in the past, but its deniers today are few. The Second Degree: His Executed Will (*Mashi'ah*) and Comprehensive Ability (*Qudrah*). It is the belief that what Allah willed happened, and what He did not will did not happen, and that there is no movement or stillness in the heavens and earth except by the Will of Allah Glory be to Him. Nothing happens in His dominion except what He wants. And He, Glory be to Him and Exalted, is capable over all things existing and non-existing. Yet, He commanded servants to obey Him and obey His messengers, and forbade them from disobeying Him. He, Glory be to Him, loves the pious, the doers of good, and the just. He is pleased with those who believe and do righteous deeds. He does not love the disbelievers, is not pleased with the defiantly disobedient people, does not order immorality, is not pleased with disbelief for His servants, and does not love corruption. Servants are doers in reality, and Allah is the Creator of their actions. The servant is the believer and the disbeliever, the righteous and the wicked, the praying and the fasting. Servants have ability over their actions and have a will; Allah is their Creator and the Creator of their ability and will, as the Almighty said: {For whoever wills among you to take a right course * And you do not will except that Allah wills - Lord of the worlds} [At-Takwir: 28, 29]. This degree of Destiny is denied by the general Qadariyyah, whom the Prophet, peace be upon him, called the Magians of this Ummah. And a group of the Affirmers (of Qadar) went to extremes in it until they stripped the servant of his ability and choice, and removed wisdom and interests from Allah's actions and rulings. I say: He refers by his last statement to the Ash'arites, for they are the ones who went to extremes and denied Wisdom (*Hikmah*) as detailed by Ibn al-Qayyim in ((Shifa' al-Alil fi al-Qada' wa al-Qadar wa al-Hikmah wa al-Ta'lil)). So review it for it is very important. (N)",
    "book_id": "954",
    "new_page_number": 24
  },
  {
    "serial_number": "32022",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "[Al-Anbiya: 23]. So whoever asks: 'Why did He do it?' has rejected the ruling of the Book, and whoever rejects the ruling of the Book is among the disbelievers.\n46- This is the sum (1) of what is needed by the one whose heart is illuminated among the allies (*Awliya*) of Allah Almighty. It is the degree of those firmly grounded in knowledge, because knowledge is two types: Knowledge existent in creation, and Knowledge missing in creation (2)",
    "foot_note": "1. (1) \n…. What is referred to by 'This' is what was mentioned previously regarding what must be believed and acting upon what the Sharia brought. His saying: 'It is the degree of those firmly grounded in knowledge' means knowing what the Messenger brought in general and detail, negation and affirmation. By 'Missing Knowledge' he means the knowledge of Destiny (*Qadar*) which Allah folded away from His creatures and forbade them from seeking. By 'Existent Knowledge' he means the knowledge of Sharia, its fundamentals and branches. So whoever denies anything of what the Messenger brought is among the disbelievers, and whoever claims knowledge of the Unseen is among the disbelievers (End from the Explanation). He mentioned evidences for these rulings, so refer to it. (M) (N)\n2. \n…. He means, may Allah have mercy on him, by 'Missing Knowledge' the knowledge of the Unseen (*Ghayb*), which is specific to Allah Almighty. Whoever claims it among people disbelieves, due to the saying of Allah Glory be to Him: {And with Him are the keys of the unseen; none knows them except Him} [Al-An'am: 59]. {Say, \"None in the heavens and earth knows the unseen except Allah\"} [An-Naml: 65]. And the saying of the Prophet, peace be upon him and his family: ((The keys of the unseen are five, none knows them except Allah)) then he recited His saying Glory be to Him: {Indeed, Allah [alone] has knowledge of the Hour and sends down the rain} [Luqman: 34]. And due to many authentic Hadiths reported on the subject indicating that the Prophet, peace be upon him and his family, does not know the Unseen, even though he is the best of creation and master of Messengers; so others are more so. He, peace be upon him and his family, does not know of it except what He, Glory be to Him, taught him. When the people of slander spoke about Aisha, may Allah be pleased with her, he did not know her innocence until the revelation came down. And when her necklace was lost in some of his travels, peace be upon him and his family, he sent a group to search for it and did not know its place until they made the camel stand up and found it under it. The evidences from the Book and Sunnah on this are many, and praise be to Allah. (Z)",
    "book_id": "954",
    "new_page_number": 25
  },
  {
    "serial_number": "32023",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "So denying the Existent Knowledge is disbelief (Kufr), and claiming the Missing Knowledge is disbelief. Faith is not established except by accepting the Existent Knowledge and abandoning the quest for the Missing Knowledge.\n\n[Belief in the Tablet and the Pen]\n47- We believe in the Tablet (1)",
    "foot_note": "1. (1) \n…. a) His saying 'We believe in the Tablet and the Pen... etc.': Allah Almighty said {But this is an honored Qur'an * [Inscribed] in a Preserved Slate}. So the Holy Quran is written in the Preserved Tablet (*Lawh Mahfuz*), as Allah Glory be to Him informed. Gabriel, peace be upon him, heard it from Allah and conveyed it to our Prophet Muhammad, peace be upon him, sent down from your Lord in truth. He did not say 'from the Preserved Tablet', and there is no contradiction between it being in the Preserved Tablet and its revelation from Allah as verified by Sheikh al-Islam Ibn Taymiyyah. Sheikh al-Islam said: The Preserved Tablet is above the heavens. It came in the Hadith that none looks into it except Allah Almighty. I say: From this, the error of those who say the soul of the servant views the Preserved Tablet becomes clear to us. This is the saying of philosophers and the myths of worshippers of the righteous or the wicked, as is established among them, so beware of it for it is a lie.\n As for the mentioned Pen, it is what Allah created and wrote the Destinies with in the Preserved Tablet, as in the Hadith of Ubada bin al-Samit narrated by Abu Dawood raised (to the Prophet): ((The first thing Allah created was the Pen, so He said to it: Write. It said: My Lord, and what shall I write? He said: Write the measures of everything until the Hour is established)). Scholars differed: Is the Pen the first of creations or the Throne? On two opinions recounted by Ibn al-Qayyim in Al-Nuniyyah, and he chose that the Pen was created after the creation of the Throne. Therefore he said:\nAnd people differ regarding that with which\n…. The Decree was written by the Judge\nWas it before the Throne or after it?\n…. Two opinions with Abu al-Ala al-Hamadhani\nThe truth is the Throne was before, because\n…. At the time of writing, it possessed pillars\nAnd the writing of the Noble Pen followed\n…. Its creation without a separation of time. (M)\n b) I say: It is what is mentioned in His saying Almighty: {But this is an honored Qur'an * [Inscribed] in a Preserved Slate} [Al-Buruj: 22]. It is of the Unseen which must be believed in, and its reality is known only to Allah. Believing that some righteous people view what is in it is disbelief in the verses and hadiths explicitly stating that none knows the Unseen except Allah Almighty. (N)",
    "book_id": "954",
    "new_page_number": 26
  },
  {
    "serial_number": "32024",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "and the Pen (1), and in everything written in it. If all creation gathered upon something Allah Almighty wrote in it that it would exist, to make it non-existent - they would not be able to do so. And if they gathered upon something Allah Almighty did not write in it, to make it exist - they would not be able to do so. The Pen has dried with what will be until the Day of Resurrection (2). And what missed the servant was not to hit him, and what hit him was not to miss him (3).",
    "foot_note": "1. (1) \n…. I say: The Commentator mentioned here that scholars differed on whether the Pen is the first creation or the Throne, on two opinions with no third. Although the preponderant view to me is the first (the Pen), as I stated in =\n…. my comments on it (p. 295), I say now: Whether the correct view is this or that, the mentioned disagreement indicates by implication that scholars agreed there is a 'first creature'. Those who say 'events have no beginning' (*Hawadith la awwala laha*) contradict this agreement, because they state that there is no creature but there is a creature before it, and so on to infinity, as Ibn Taymiyyah stated in some of his books. If they say: The Throne is the first creature, as is apparent from the Commentator's words, they contradict their saying of 'events with no beginning'. And if they do not say that, they oppose the agreement! So contemplate this for it is important. And Allah is the Granter of success. (N)\n2. \n…. This is a part of the famous Hadith of Ibn Abbas with the wording: ((Preserve Allah, He will preserve you...)) the Hadith. It is an authentic Hadith as I mentioned in ((Al-Takhrij)) (p. 274). (N)\n3. \n…. This is from the completion of the Hadith of Ibn Abbas referred to previously in a narration from him. (N)",
    "book_id": "954",
    "new_page_number": 27
  },
  {
    "serial_number": "32025",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "48- The servant must know that Allah's knowledge preceded in every existing thing of His creation (1). He estimated that with a firm, precise estimation, having no canceller, no delayer, no remover, no changer, no subtractor, and no adder from His creation in His heavens and His earth. That (2) is from the knot of faith, the principles of gnosis, and the acknowledgment of Allah Almighty's Oneness and Lordship (3). As He Almighty said in His Book: {And He created everything and determined it with [precise] determination} [Al-Furqan: 2]. And He Almighty said: {And the command of Allah is a decree determined} [Al-Ahzab: 38]. So woe to him who became an opponent to Allah Almighty regarding Destiny, and brought a sick heart to look into it. He has indeed sought (4) by his delusion to investigate the Unseen, a deeply concealed secret. And he returned, by what he said regarding it, a sinful liar.",
    "foot_note": "1. (1) \n…. This contains a refutation of what the extremist Mu'tazilah went to, who denied Allah being All-Knowing in eternity, and said that Allah Almighty does not know the actions of servants until they do them. Exalted is Allah above what they say with great highness. Allah Almighty said: {Does He who created not know, while He is the Subtle, the Acquainted?} [Al-Mulk: 14]. (M)\n2. \n…. The reference is to what was mentioned previously regarding belief in Destiny, and Allah's foreknowledge of existing things before creating them. (M)\n3. \n…. His saying 'and the acknowledgment of Allah's Oneness and Lordship': Meaning Tawhid and acknowledgment of Lordship are not complete except by believing in the attributes of Allah Almighty. For whoever claims a creator other than Allah has associated partners, so how about one who claims that everyone creates his own action? Therefore, the Qadariyyah were the Magians of this Ummah. (M)\n4. \n…. His saying 'He has indeed sought by his delusion to investigate the Unseen, a deeply concealed secret': Meaning by his delusion in searching for the Resurrection (or Qadar?) a hidden secret; for Destiny is Allah's secret in His creation; he aims by his search to view the Unseen. Allah has said: {Knower of the unseen, and He does not disclose His unseen to anyone}. His saying 'And he returned by what he said regarding it' i.e., regarding Destiny, 'a sinful liar' (*Affakan Athiman*) i.e., burdened with sin. End of explanation. (M)",
    "book_id": "954",
    "new_page_number": 28
  },
  {
    "serial_number": "32026",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "[Belief in the Throne and the Chair]\n49- The Throne (*Al-Arsh*) and the Chair (*Al-Kursi*) are true (1).",
    "foot_note": "1. (1) \n…. a) When the author mentioned the Throne and the Chair which is before the Throne, he mentioned after that His independence, Glory be to Him, from the Throne and what is below the Throne, as the Almighty said {He is the Free of need, the Praiseworthy}. To clarify that His creation of the Throne to rise over it is not due to His need for it; rather, He has wisdom in that necessitating it. Then know that the Rising (*Istiwa*) over the Throne happened only after the creation of the heavens and the earth, as the Almighty said: {Indeed, your Lord is Allah, who created the heavens and the earth in six days and then established Himself above the Throne} [Al-A'raf: 54]. 'Then' (*Thumma*) here is for sequence, not just conjunction; as the poet said:\nHe decreed His creation then rose over His Throne\nAnd no place in the earth is devoid of His knowledge\nAs for the meaning of *Istiwa* in the language of the Arabs in which the Quran was revealed, it is Highness (*Uluww*), Elevation (*Irtifa'*), Settling (*Istiqrar*), and Ascent (*Su'ud*), as Ibn al-Qayyim mentioned saying:\nAnd they have four expressions for it\nWhich have been achieved by the stabbing knight\nAmong them is *Istaqarra* (settled), and *Ala* (became high)\nAnd likewise *Irtafa'a* (rose), in which there is no denial\nAnd likewise *Sa'ida* (ascended), which is the fourth\nAnd Abu Ubaidah, owner of Al-Shayban\nChooses this saying in his explanation\nMore knowledgeable than the Jahmi regarding the Quran\nAnd the Ash'ari says the explanation of *Istawa* is\nIn reality *Istawla* (conquered), out of falsehood\nThe Nun of the Jews and the Lam of the Jahmi\nAre two additions in the Revelation of the Lord of the Throne (M)\n b) Know that the Throne is a very great creation as indicated by Quranic verses and Prophetic Hadiths. Therefore, the Exalted attributed it to Himself in His saying: {Owner of the Throne}, and there are other verses you will find in ((The Explanation)). Linguistically it is the bed of the King. Among its descriptions in the Quran: {and eight will bear the Throne of your Lord above them, that Day} [Al-Haqqah: 17], and that it is upon water. In the Sunnah, the distance between the earlobe and shoulder of one of the Throne bearers is a journey of seven hundred years, and it has pillars, and it is the roof of Jannat al-Firdaus. This came in authentic Hadiths mentioned in ((The Explanation)). All of this invalidates the interpretation of the Throne as being an expression for Dominion and expanse of Authority!.\n As for the Chair (*Kursi*), regarding it is His saying: {His Chair extends over the heavens and the earth} [Al-Baqarah: 255]. The Chair is what is before the Throne. It is authentically reported from Ibn Abbas as his own statement (Mawquf): ((The Chair is the place of the two Feet, and the Throne cannot be estimated in measure except by Allah Almighty)). It is referenced in my book ((Mukhtasar al-Uluww by Al-Dhahabi)) may Allah facilitate its printing (1). Nothing authentic raised to the Prophet (Marfu') is established regarding it except his saying, peace be upon him: ((The seven heavens in relation to the Chair are like a ring thrown in a desert land, and the superiority of the Throne over the Chair is like the superiority of that desert over that ring)). This also invalidates interpreting the Chair as Knowledge. This interpretation from Ibn Abbas is not authentic as I clarified in ((Al-Sahihah)) (109). (N)",
    "book_id": "954",
    "new_page_number": 29
  },
  {
    "serial_number": "32027",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "50- And He is independent of the Throne and what is below it (1).",
    "foot_note": "1. (1) \n…. The Commentator, may Allah have mercy on him, said: The Sheikh, may Allah have mercy on him, only said this here because when he mentioned the Throne and the Chair, he mentioned after that His independence, Glory be to Him, from the Throne and what is below the Throne, to clarify that His creating the Throne to rise over it is not due to His need for it, but He has wisdom in that which necessitated it. The fact that the High is above the Low does not imply that the Low encompasses the High, surrounds it, or carries it. Nor that the Highest is in need of them. The Lord Almighty is greater in status and more majestic than for His Highness to imply that. Rather, the necessities of His Highness are of His characteristics, which are His carrying of the low by His power, the poverty of the low, His independence, Glory be to Him, from the low, and His encompassing of it, Mighty and Majestic. So He is above the Throne, while carrying the Throne and its bearers by His power, independent of the =\n1. \n…. Printed in a volume among the publications of Al-Maktab Al-Islami. =\n…. Throne, while the Throne is in need of Him. He encompasses the Throne, and the Throne does not encompass Him. He besieges the Throne, and the Throne does not besiege Him. These implications are negated for the creature. If the deniers of Highness, the people of Negation (*Ta'til*), had detailed with this detailing, they would have been guided to the straight path, known the conformity of reason to revelation, and followed behind the proof. But they separated from the proof, so they strayed from the straight path. The matter in that is as Imam Malik, may Allah have mercy on him, said when asked about His saying Almighty: {Then He established Himself above the Throne} [Al-A'raf: 54] and others: How did He establish? He said: The Establishment (*Istiwa*) is known, and the modality (*Kayf*) is unknown. (N)",
    "book_id": "954",
    "new_page_number": 30
  },
  {
    "serial_number": "32028",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "51- Encompassing everything and Above it (1), and He has rendered His creation incapable of encompassing. \n\n[Affirmation of Speech for Allah Almighty]\n52- And we say: Allah took Abraham as a close friend (*Khalil*), and Allah spoke to Moses directly (*Taklima*), believing, confirming, and submitting.\n\n[Belief in Angels, Prophets, and Revealed Books]\n53- And we believe in the Angels, the Prophets, and the Books sent down upon the Messengers, and we bear witness that they were upon the clear Truth.\n54- And we call the people of our Qiblah Muslims, Believers, as long as they acknowledge what the Prophet, peace be upon him, brought, and believe him in everything he said and informed of (2).",
    "foot_note": "1. (1) \n…. I say: The copies differed regarding this word (*wa fawqahu* - and above it). In the Commentator's copy it is as you see, and likewise in manuscripts (A, B) and Sheikh Ibn Mani's print. In manuscript (C) and print (Kh): (*fawqahu*) without the conjunction Waw. Manuscript (Gh) deviated, containing (*wa bima fawqahu* - and what is above it)! There is no doubt about its irregularity and the one before it, in narration and meaning. As for narration, because it contradicts most copies. As for meaning, the Commentator explained it by saying (p. 281): ((The first version is the correct one)), meaning: He Almighty encompasses everything and is above everything. The meaning of the second is that He encompasses everything *above* the Throne. This - and Allah knows best - was either dropped by some scribes inadvertently and then people copied from that copy, or some deviant distorters dropped it intentionally for corruption and to deny the attribute of Highness (*Fawqiyyah*)! Otherwise, proof has established that the Throne is above creatures, and there is nothing of creatures above it. So there remains no meaning for saying: ((Encompassing)) - in the sense of: encompassing everything above the Throne - in this case, since there are no creatures above the Throne to encompass. Thus, the affirmation of the Waw is determined, and the meaning is: He, Glory be to Him, encompasses everything and is *Above* everything)). (N)\n2. \n…. a) Mere belief and acknowledgment are not sufficient for the Islam and Iman commanded by Allah and His Messenger. The Islam and Iman upon which salvation revolves are those mentioned in the famous Hadith of Gabriel, peace be upon him, which includes belief, acknowledgment, and action. (M)\n b) The Commentator said: The Sheikh, may Allah have mercy on him, indicates that Islam and Iman are one, and that a Muslim does not exit Islam by committing a sin unless he deems it lawful. The meaning of his saying: ((People of our Qiblah)) is those who claim Islam and face the Kaaba, even if they are people of desires (innovation) or people of sin, as long as they do not deny anything the Messenger, peace be upon him, brought. (N)",
    "book_id": "954",
    "new_page_number": 31
  },
  {
    "serial_number": "32029",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "[Prohibition of delving into Allah's Essence and disputing in Allah's Religion and His Quran]\n55- We do not delve into (the essence of) Allah, nor do we dispute regarding the religion of Allah.\n56- We do not argue about the Quran, and we bear witness that it is the Word of the Lord of the Worlds (1)",
    "foot_note": "1. (1) \n…. I say: One of the greatest tribulations that afflicted some Islamic sects due to theological rhetoric (*Ilm al-Kalam*) is that it deviated them from believing that the Holy Quran is the Word of the Lord of the Worlds in reality (*Haqiqah*), not metaphorically (*Majaz*). As for the Mu'tazilah who say it is created, their matter is clear and exposed. But there is a group that attributes itself to the Sunnah and refutes this saying of the Mu'tazilah and other things in which they deviated from Islam, namely the Ash'aris and Maturidis. In reality, they agree with the Mu'tazilah in saying the Quran is created and that it is not the saying of the Lord of the Worlds, except that they do not declare that openly. They hide behind their interpretation of Divine Speech as ancient inner speech (*Kalam Nafsi Qadim*) not heard by any angel or messenger, and that He Almighty does not speak if He wills, but is speaking since eternity. I saw an important research by Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, invalidating this interpretation of theirs. He said after affirming the pre-existence of Speech: ((Speech is an attribute of perfection; one who speaks is more perfect than one who does not, just as one who knows and is capable is more perfect than one who does not know or is not capable. One who speaks by his will and ability is more perfect than one who does not speak by his will and ability, and more perfect than one who speaks without his will and ability, if that is conceivable. It can be decided based on the principles of the Salaf by saying: Either He is capable of speech or not capable. If He is not =\n…. capable, He is mute (*Akhras*). If He is capable but does not speak, He is silent (*Sakit*). As for the Kullabiyyah (followed by Ash'aris in this issue), Speech according to them is not subject to ability (*Maqdur*). So they cannot argue with this. It is said: This indicated the pre-existence of Speech, but does it imply the pre-existence of a specific speech without His ability and will? Or does it imply that He has never ceased speaking by His will and ability? The first: The saying of the Kullabiyyah. The second: The saying of the Salaf, the Imams, and Ahl al-Hadith wal-Sunnah. It is said: It implies the second, not the first, because affirming speech subsisting in the essence of the speaker without his will and ability is neither rational nor known. Judgment on a thing is a branch of conceptualizing it. It is said to the arguer: Neither you nor any rational person can conceive of speech subsisting in the essence of the speaker without his will and ability, so how do you affirm by rational evidence something irrational? Also, your saying: ((If He were not described with speech, He would be described with muteness and silence)) is only intelligible regarding speech with letters and sounds; if a living being lacks them, he is not a speaker. So either he is capable of speech and does not speak, which is the silent one, or he is not capable of it, which is the mute one. As for what they claim of Inner Speech (*Kalam Nafsi*), that is not intelligible, that whoever is devoid of it is silent or mute. So assuming its existence does not indicate that one devoid of it must be silent or mute. Also, the ancient psychological speech you affirmed, you did not establish what it is? Nay, you did not even conceive it! Affirming a thing branches from conceiving it. So whoever does not conceive what he affirms, how is it permissible for him to affirm it? That is why Abu Sa'id Ibn Kullab - the head of this sect (meaning Ash'aris) and its Imam in this issue - does not mention in explaining it anything intelligible. Rather he says: It is a meaning contradicting silence and muteness! Silence and muteness are only conceived if speech is conceived. The silent is one silent from speech, and the mute is one incapable of it, or who has a defect in the place of pronunciation preventing him from speech. Thus, the silent and mute are not known until speech is known, and speech is not known until the silent and mute are known. So it became clear that they did not conceive what they said nor established it. Rather, in speech, they resemble the Christians regarding the 'Word' (*Kalimah*) and what they said regarding the 'Hypostases' (*Aqanim*), 'Trinity', and 'Union'. For they say what they do not conceive nor clarify. The Messengers, peace be upon them, if they inform of something we do not conceive, it is obligatory to believe them. =\n…. As for what is affirmed by reason, the one saying it must conceive it, otherwise he has spoken without knowledge. The Christians speak without knowledge; so their speech was contradictory and no rational saying resulted for them. Likewise, whoever speaks about Allah's Speech without knowledge, his speech is contradictory, and no intelligible saying results for him. That is why among the things denounced upon these people is that they argued for the foundation of their religion and knowing the reality of speech - Allah's speech and all creation's speech - with the saying of a Christian poet called Al-Akhtal:\nIndeed, speech is in the heart, and only\n......The tongue was made an indicator of the heart\nA group said this is not his poetry. Assuming it is his poetry, rational realities, or the named 'speech' which all humans speak, reference is not made therein to the saying of a thousand virtuous poets, let alone a Christian poet named Al-Akhtal\n….)) End summarized from ((Majmoo' al-Fatawa)) (6/294-297). (N)",
    "book_id": "954",
    "new_page_number": 32
  },
  {
    "serial_number": "32030",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": ", with which the Trustworthy Spirit (Gabriel) descended, and taught to the Master of Messengers, Muhammad, may Allah bless him and his family and grant them peace. It is the Word of Allah Almighty, nothing of the speech of creatures equals it. We do not say it is created (1), and we do not oppose the community (*Jama'ah*) of Muslims.",
    "foot_note": "1. (1) \n…. Know that the most famous of those saying the Quran is created are two sects: One is the Mu'tazilah, for they say: The Quran brought by Gabriel is the Word of Allah in reality but it is created. The second are the Theologians (*Mutakallimun*) from the Kullabiyyah and their followers. They say Allah's Speech is a single meaning subsisting in His Essence Almighty; if expressed in Hebrew it becomes Torah, if expressed in Syriac it becomes Gospel, and if expressed in Arabic it becomes Quran. This superstition is what they believe as religion owed to Allah. They agree with the Mu'tazilah that the Quran brought by Gabriel is created, except that the Mu'tazilah say it is Allah's Word in reality, while the Kullabiyyah and their followers say it is an expression (*Ibarah*) and narrative (*Hikayah*) of Allah's Word. According to the saying of these Kullabiyyah and their followers, the Prophet, peace be upon him, did not convey Allah's Word, but rather conveyed what indicates it and is a narrative of it. In this is a denial of the Message, because the Messenger only conveys the speech of the Sender. Ahl al-Sunnah obligated them with this. Ibn al-Qayyim said in Al-Nuniyyah:\nIf the attribute of Speech is negated\nLikewise Sending is negated without distinction\nFor the message of the sent one is conveying the speech\nOf the Sender, the Caller, without decrease\nTo the end of what he mentioned of great verses to be held onto with molars. It is most amazing that a scholar from the followers of Kullabiyyah discusses such researches, and if the Jahmiyyah and Mu'tazilah are mentioned, he says =\n…. they have perished and no trace or eye remains of them or their beliefs. The poor man does not know that he is the heir of Jahmism and Mu'tazilism, and that his belief is exactly their belief. (M)",
    "book_id": "954",
    "new_page_number": 33
  },
  {
    "serial_number": "32031",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "[Not declaring People of Qiblah Disbelievers for Sins]\n57- We do not declare anyone of the people of the Qiblah a disbeliever (*Kafir*) due to a sin, as long as he does not deem it lawful (*Yastahilluhu*) (1).",
    "foot_note": "1. (1) \n…. a) His saying 'We do not declare anyone of the people of the Qiblah... etc.': The intent by People of the Qiblah is those who unify Allah in His worship, are sincere to Him in dealing, act upon the meaning of the word of Tawhid outwardly and inwardly, believe the Messenger of Allah in all he informed, comply with his command, and do not commit what nullifies 'La ilaha illa Allah'. To this meaning the Author pointed previously saying: 'And we call the people of our Qiblah Muslims, Believers, as long as they acknowledge what the Prophet brought... etc.' because we believe the intent is complete Faith comprising belief, acknowledgment, and action. The Sheikh's intention, may Allah have mercy on him, with this speech is to refute the Khawarij who say one becomes a disbeliever by every sin. (M)\n b) His saying (We do not declare anyone of the people of the Qiblah a disbeliever due to a sin as long as he does not deem it lawful): He means, may Allah have mercy on him, that Ahl al-Sunnah wal-Jama'ah do not declare the monotheist Muslim who believes in Allah and the Last Day a disbeliever due to a sin he commits, like adultery, drinking alcohol, usury, disobedience to parents, and the like, as long as he does not deem that lawful. If he deems it lawful, he disbelieves because he thereby denies Allah and His Messenger and exits His religion. But if he does not deem it lawful, he does not disbelieve according to Ahl al-Sunnah wal-Jama'ah; rather he is weak in faith and has the ruling of the sins he committed regarding being labeled a sinner (*Fasiq*) and establishing penalties (*Hudud*) and so on as came in the purified Sharia. This is the saying of Ahl al-Sunnah wal-Jama'ah, contrary to the Khawarij, Mu'tazilah, and those who tread their false path. For the Khawarij declare disbelief for sins, and the Mu'tazilah place him in a station between two stations (neither believer nor disbeliever) in this world, but in the Hereafter they agree with the Khawarij that he is eternally in the Fire. The saying of both sects is false by the Book, Sunnah, and consensus of the predecessors of the Ummah. Their matter confused some people due to lack of knowledge, but their matter is praise be to Allah clear to the people of truth as we explained. And Allah is the Guardian of success. (Z)\n c) Meaning heart-felt doctrinal deeming of lawfulness (*Istihlal Itiqadi*); otherwise, every sinner deems his sin lawful practically, i.e., commits it. Therefore, one must differentiate between the one who deems it lawful doctrinally - he is a disbeliever by consensus - and the one who deems it lawful practically not doctrinally - he is a sinner deserving the punishment befitting him unless Allah forgives him, then his faith saves him. Contrary to the Khawarij and Mu'tazilah who judge him to be eternally in the Fire even if they differ in naming him Disbeliever or =\n…. Hypocrite. A new shoot (*Nabitah*) has sprouted following these (Khawarij) in declaring the masses of Muslims, leaders and subjects, disbelievers without exception. I met groups of them in Syria, Mecca, and elsewhere. They have doubts like the doubts of the Khawarij, such as texts saying 'Whoever does such has disbelieved'. The Commentator, may Allah have mercy on him, cited a group of these here, and quoted Ahl al-Sunnah - who say Faith is speech and action, increasing and decreasing - that the sin, whatever it is, is practical disbelief (*Kufr Amali*) not doctrinal (*Itiqadi*), and that Disbelief to them is of levels: Disbelief less than Disbelief (*Kufr duna Kufr*), just like Faith. Then he struck an important example often missed by the referred new shoot. He said, may Allah have mercy on him (p. 323): Here is a matter that must be noticed, which is that Ruling by other than what Allah revealed may be Disbelief transferring from the Millah (Major Kufr), and may be a sin: major or minor, and be disbelief: either metaphorically, or minor disbelief, according to the two mentioned views. That depends on the state of the ruler. If he believes that ruling by what Allah revealed is not obligatory, and that he has a choice in it, or disdains it while certain it is Allah's ruling: this is Major Disbelief. If he believes the obligation of ruling by what Allah revealed and knows it in this incident, but turns away from it while acknowledging he deserves punishment, this is a sinner and is called a disbeliever in a metaphorical sense, or minor disbelief. If he was ignorant of Allah's ruling in it while expending his effort and capacity to know the ruling and erred, this is a mistaken one (*Mukhti'*) who has a reward for his Ijtihad, and his error is forgiven. (N)",
    "book_id": "954",
    "new_page_number": 34
  },
  {
    "serial_number": "32032",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "[Refutation of the Murji'ah]\n58- And we do not say (1) that a sin does not harm faith for the one who commits it (2).",
    "foot_note": "1. (1) \n…. His saying: 'And we do not say that a sin does not harm faith... etc.' He intends by this speech to refute the Murji'ah who say a sin does not harm with faith just as obedience does not benefit with disbelief. These are at one extreme and the Khawarij at another; for they (Khawarij) say the Muslim disbelieves by every sin or every major sin. Likewise the Mu'tazilah who say his entire faith is annulled by a major sin so nothing of faith remains with him, but the Khawarij say he exits faith and enters disbelief, while the Mu'tazilah say he exits faith and does not enter disbelief. This erroneous saying is the 'Station between two stations' which is the specific school of the Mu'tazilah. By saying he exits faith, they necessitated his eternal abode in the Fire. (Caution) I used to read in books of sects and people's differences in beliefs and find the extremism of Mu'tazilah in their doctrines, then return to biographical books and search for the biographies of their senior Sheikhs, and find therein the objectionable strange matter of playing with religion and violating its sanctities. It became confirmed to me that this is =\n…. from the bad omen of their doctrines and the corruption of their sect. Whoever reads the biography of Al-Nazzam, Abu al-Hudhayl al-Allaf, and the dissolute Al-Jahiz knows that. We ask Allah for safety. (M)\n2. \n…. That is because it is from the saying of the Murji'ah leading to belying the verses of threat and its hadiths narrated regarding the sinners of this Ummah, and that groups of them enter the Fire, then exit from it by Intercession or otherwise. (N)",
    "book_id": "954",
    "new_page_number": 35
  },
  {
    "serial_number": "32033",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "59- We hope for the good-doers among the believers that He pardons them and enters them into Paradise by His mercy, but we are not secure over them, nor do we testify for them of Paradise (1).",
    "foot_note": "1. (1) a) His saying 'nor do we testify for them of Paradise': Know that what Ahl al-Sunnah wal-Jama'ah are upon is that they do not testify for anyone who died of the Muslims with Paradise or Fire except whom the Messenger of Allah testified for and informed about. However, they hope for the good-doer and fear for the evildoer. By this, you know what many people are upon; if they mention a scholar, emir, king, or others, they say: 'The late forgiven one' (*Al-Maghfur lahu*) or 'Dweller of Paradise'. Worse than that is their saying: 'Transferred to the Supreme Companion'. There is no doubt this is speaking about Allah without knowledge, and speaking about Allah without knowledge is equal to Shirk as the Almighty said {and that you associate with Allah that for which He has not sent down authority, and that you say about Allah that which you do not know} [Al-A'raf: 33]. As for the polytheist, we testify for him of the Fire because Allah said: {Indeed, he who associates others with Allah - Allah has forbidden him Paradise, and his refuge is the Fire. And there are not for the wrongdoers any helpers.} [Al-Ma'idah: 72]. (M) (N)\n b) He means, may Allah have mercy on him, except whom the Messenger, peace be upon him and his family, testified for of Paradise like the Ten and others, as will come at the end of his speech. Knowing that the creed of Ahl al-Sunnah wal-Jama'ah is to testify for believers and pious ones *in general* that they are people of Paradise, and that disbelievers, polytheists, and hypocrites are people of the Fire, as indicated by the noble verses and Mutawatir Sunnah from the Messenger of Allah, peace be upon him and his family. From that is His saying Glory be to Him: {Indeed, the righteous are in gardens and pleasure} [At-Tur: 17]. And His saying Mighty and Majestic: {Allah has promised the believing men and believing women gardens beneath which rivers flow, wherein they abide eternally} [At-Tawbah: 72] in many verses indicating this meaning. And His saying Glory be to Him regarding disbelievers: {And for those who disbelieve will be the fire of Hell. [Death] is not decreed for them so they may die, nor will its torment be lightened for them. Thus do We recompense every ungrateful one.} [Fatir: 36]. And His saying Glory be to Him: {Indeed, the hypocrites will be in the lowest depths of the Fire - and never will you find for them a helper} [An-Nisa: 145] in other verses indicating this meaning. And Allah is the Guardian of success. (Z)",
    "book_id": "954",
    "new_page_number": 36
  },
  {
    "serial_number": "32034",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "And we seek forgiveness for their wrongdoers, and we fear for them, but we do not make them despair.\n\n[Security and Despair]\n60- Security (*Al-Amn*) and Despair (*Al-Iyas*) transfer one out of the religion (*Millah*) of Islam. The path of Truth is between them for the people of the Qiblah (1).\n61- And a servant does not exit Faith except by denying what entered (2) him into it (3).",
    "foot_note": "1. (1) \n…. The Commentator said: The servant must be fearful and hopeful. Praiseworthy truthful fear is what prevents its owner from Allah's prohibitions; if it exceeds that, despair (*Ya's*) and hopelessness (*Qunut*) are feared. Praiseworthy hope is the hope of a man who did an act of obedience to Allah upon light from Allah, so he hopes for His reward; or a man who committed a sin then repented from it to Allah, so he hopes for His forgiveness. As for if a man persists in negligence and sins, hoping for Allah's mercy without action, this is delusion, wishful thinking, and false hope. (M)\n2. \n…. He intends by this to refute the Khawarij and Mu'tazilah who said he exits Faith by committing a major sin. (M). I say: And the likes of these today who judge the Muslims of all Islamic lands without exception with Kufr, and obligate their followers to separate and disassociate from them, exactly as the Khawarij did before them. May Allah guide them, and forgive the extremists who were the cause of this dangerous deviation. (N)\n3. \n…. This restriction is questionable. For the disbeliever enters Islam by the Two Testimonies if he does not pronounce them. If he pronounces them, he enters Islam by repentance from what necessitated his disbelief. He may exit Islam without\n…. Denial (*Juhud*) for many reasons explained by scholars in the chapter of the Ruling of the Apostate. Among them is insulting Islam or the Prophet, peace be upon him and his family, or mocking Allah, His Messenger, His Book, or anything of His legislation Glory be to Him, due to His saying Glory be to Him: {Say, \"Is it Allah and His verses and His Messenger that you were mocking?\" * Make no excuse; you have disbelieved after your belief.} [At-Tawbah: 65-66]. Also among them is worshipping idols or statues, or calling upon the dead and seeking aid from them and asking them for support and help and the like, because this contradicts the statement 'La ilaha illa Allah', for it indicates that worship is the right of Allah alone. Among worship is Supplication, Seeking Aid, Bowing, Prostrating, Slaughtering, Vowing, etc. So whoever directs any of this to other than Allah, such as idols, statues, angels, Jinn, grave occupants, and other creatures, has associated partners with Allah and has not realized the statement 'La ilaha illa Allah'. These issues all expel one from Islam by consensus of scholars, and they are not issues of Denial (*Juhud*). Their evidences are known from the Book and Sunnah. There are many other issues by which a Muslim disbelieves not called Denial, mentioned by scholars in the chapter of the Ruling of the Apostate, so check them if you wish. And Allah is the Guardian of success. (Z)",
    "book_id": "954",
    "new_page_number": 37
  },
  {
    "serial_number": "32035",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "[Definition of Faith]\n62- Faith (*Iman*) (1): is affirmation (*Iqrar*) with the tongue, and ratification (*Tasdiq*) with the heart (2).",
    "foot_note": "1. (1) \n…. His saying: 'And Faith is affirmation with the tongue and ratification with the heart.' The author restricted it to these two pillars in defining Faith, which is the saying of the Murji'ah. Malik, Al-Shafi'i, Ahmad, and all Ahl al-Hadith went to the view that it is ratification with the heart, affirmation with the tongue, and action with the limbs; it increases with obedience and decreases with disobedience. This is the truth and correctness. (M)\n2. \n…. a) This definition has observation and deficiency. The correct view upon which Ahl al-Sunnah wal-Jama'ah are is that Faith is speech, action, and belief; it increases with obedience and decreases with disobedience. Evidences for this from the Book and Sunnah are too many to count. The Commentator Ibn Abi al-Izz mentioned a group of them, so review them if you wish. Excluding action from Faith is the saying of the Murji'ah. The disagreement between them and Ahl al-Sunnah in this is not (merely) verbal, rather it is verbal and semantic, and many rulings result from it known to whoever contemplates the speech of Ahl al-Sunnah and the speech of the Murji'ah. And Allah is the One sought for help. (Z)\n b) This is the school of the Hanafis and Maturidis, contrary to the Salaf and the majority of Imams like Malik, Al-Shafi'i, Ahmad, Al-Awza'i and others, for these added to Affirmation and Ratification: Action with the limbs. The difference between the two schools is not a formal (*Suri*) difference as the Commentator, may Allah have mercy on him, argued on the pretext that they all agreed that the committer of a major sin does not exit Faith, and that he is under Allah's will, if He wills He punishes him and if He wills He pardons him. For this agreement, even if correct, the Hanafis, if they were not opposing the majority a real opposition in denying that Action is part of Faith, would have agreed with them that Faith increases and decreases, and that its increase is by obedience and its decrease by disobedience, given the abundance of evidences from the Book, Sunnah, and Salafi traditions on that. The Commentator mentioned a good group of them (342-344). But the Hanafis insisted on speaking contrary to those explicit evidences regarding increase and decrease, and burdened themselves in interpreting them with apparent, nay false, affectation. The Commentator (p. 342) mentioned a sample of that; indeed he recounted from Abu al-Mu'in al-Nasafi that he impugned the authenticity of the Hadith ((Faith is seventy-odd branches...))\n…. despite all Imams of Hadith using it as proof, including Al-Bukhari and Muslim in their ((Two Sahihs)); it is referenced in ((Al-Sahihah)) (1769). This is only because it is explicit in contradicting their school! Then how can the mentioned difference be formal, when they allow the most dissolute of them to say: My faith is like the faith of Abu Bakr Al-Siddiq! Nay, like the faith of Prophets and Messengers and Gabriel and Michael, peace be upon them! How, when based on this school of theirs, they do not allow one of them—no matter how dissolute and immoral—to say: 'I am a believer, if Allah wills' (*Insha'Allah*), but rather he says: 'I am a believer truly!'? While Allah Almighty says: {The believers are only those who, when Allah is mentioned, their hearts become fearful, and when His verses are recited to them, it increases them in faith; and upon their Lord they rely * Who establish prayer and spend from what We have provided them * Those are the believers, truly.} [Al-Anfal: 2-4] {And who is more truthful than Allah in statement.} [An-Nisa: 22]. Based on all that, they went to extremes in their partisanship, mentioning that whoever makes an exception (*Istithna* - saying Insha'Allah) in his faith has disbelieved! They branched from it that it is not permissible for a Hanafi to marry a Shafi'i woman! Some of them were lenient—they claimed—and allowed that without the reverse, justifying it by saying: Treating her like the People of the Book! I know a person from the Hanafi Sheikhs whose daughter was proposed to by a man from the Shafi'i Sheikhs, and he refused saying:\n…. Were it not that you are Shafi'i! Is there room for doubt after this that the difference is real? Whoever wishes to expand on this issue should return to the book of Sheikh al-Islam Ibn Taymiyyah: ((Al-Iman)), for it is the best written on this subject. (N)",
    "book_id": "954",
    "new_page_number": 38
  },
  {
    "serial_number": "32036",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "63- And all (1) that is authenticated from the Messenger of Allah, peace be upon him, regarding the Sharia and Clarification is all Truth (2).",
    "foot_note": "1. (1) \n…. His saying 'And all that is authenticated from the Messenger of Allah... etc.': He intends by that to refute all the Jahmiyyah Negators, the Mu'tazilah, and the Rafidah who say that reports are of two types: Mutawatir and Ahad. Mutawatir, even if definitive in chain, is not definitive in indication because verbal evidences do not yield certainty; therefore they impugned the indication of the Quran regarding Attributes. They said Ahad (solitary reports) do not yield knowledge and they do not use them as proof regarding their text. So they blocked the hearts from knowing the Lord Almighty, His names, and His actions from the direction of the Messenger, and referred people to imaginary cases and imaginative premises they called rational definitives. The truth and correctness is what the major investigative Imams went to, that the report of a single just person yields knowledge, as in Fath al-Majid and the treatise of Sheikh al-Islam Ibn Taymiyyah on Principles of Tafsir. Likewise Ibn al-Qayyim prolonged the discussion in Al-Nuniyyah and Al-Sawa'iq with what heals and suffices. More than one held that the report of the Two Sahihs yields definitive knowledge (refer to the beginning of Lawa'ih al-Anwar by Al-Saffarini) and it is the truth. (M)\n2. \n…. Meaning without differentiating between what is Ahad report or Mutawatir, as long as it is authenticated from the Messenger of Allah, peace be upon him. This is the truth in which there is no doubt. Differentiating between them is an innovation and philosophy introduced into Islam, contrary to what the Righteous Salaf and Mujtahid Imams were upon, as I verified in my treatise ((The Obligation of Accepting Ahad Hadith in Creed and Refuting the Doubts of Opponents)), which is printed and famous. (N)",
    "book_id": "954",
    "new_page_number": 39
  },
  {
    "serial_number": "32037",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "64- Faith is one (1), and its people are equal in its foundation (2). The variation between them is by fear and piety, opposing desire, and adhering to the worthier (3). 65- All believers are Allies (*Awliya*) of the Most Merciful (4), and the most noble of them to Allah are the most obedient",
    "foot_note": "1. (1) \n…. His saying (Faith is one and its people are equal in its foundation) has observation; rather it is false. People of faith are not equal in it; rather they vary greatly. The faith of Messengers is not like the faith of others, just as the faith of the Rightly Guided Caliphs and the rest of Companions, may Allah be pleased with them, is not like the faith of others. Likewise, the faith of believers is not like the faith of sinners. This variation is according to what is in the heart of knowledge of Allah, His names, His attributes, and what He legislated for His servants. This is the saying of Ahl al-Sunnah wal-Jama'ah contrary to the Murji'ah and those who said their saying. And Allah is the One sought for help. (Z)\n2. \n…. The truth which has no ambiguity is that Faith varies in its foundation. The faith of individual people is not like the faith of Gabriel nor like the faith of the Messenger of Allah. The saying that people are equal in the foundation of faith is not from the beliefs of Ahl al-Sunnah. (M)\n3. \n…. This is based on his previous statement that Faith is affirmation and ratification only. You have known that the correct view is that it varies in its foundation, and that the faith of the righteous is not like the faith of the wicked. So review it. (N)\n4. \n…. a) The Allies of the Most Merciful (*Awliya al-Rahman*) are: Those who acted upon what appeared in the Book and Sunnah, performed what Allah obliged upon them, and abandoned what He forbade of sins. They are the ones drawing closer to Allah by obeying Him and obeying His Messenger, peace be upon him. =\n…. As for the people of quackery and deception claiming to enter fire and hold snakes, these are allies of Satan. (M)\n b) They are those described in His saying Almighty: {Unquestionably, [for] the allies of Allah there will be no fear concerning them, nor will they grieve * Those who believed and were fearing Allah} [Yunus: 62-63]. *Karamah* (sainthood/miracle) is not claiming miracles and supernatural acts as many people imagine; rather, that is of the insults that distort the beauty of Islam. (N)",
    "book_id": "954",
    "new_page_number": 40
  },
  {
    "serial_number": "32038",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "and the most following of the Quran (1).\n\n[Pillars of Faith]\n66- Faith is: Belief in Allah, His Angels, His Books, His Messengers, the Last Day, and Destiny (*Qadar*), its good and its evil, its sweet and its bitter, are from Allah Almighty (2).\n67- We are believers in all of that. We do not differentiate between any of His messengers, and we believe them all regarding what they brought.",
    "foot_note": "1. (1) \n…. In this is a subtle indication refuting the fanatics of Madhhabs (Schools of Thought), who prefer following the Madhhab over following the Book and Sunnah. That is because there is no correlation between following Madhhabs and following the Quran, for Madhhabs differ, and the Quran has no difference in it, as the Almighty said about it: {If it had been from other than Allah, they would have found within it much contradiction} [An-Nisa: 82]. So the more a Muslim follows the Quran, the more noble he is to Allah Almighty, and the more he increases in imitation (Taqlid), the more he increases in distance. To this, the author pointed by his saying: ((None imitates except a fanatic or a fool)). See ((Sifat al-Salah)) (p. 23). (N)\n2. \n…. Know that this does not contradict his saying, peace be upon him, in the opening supplication: ((And all good is in Your hands, and evil is not attributed to You)) narrated by Muslim. Because the meaning is: You do not create pure evil; rather, everything You create has a wisdom, which by consideration is good, but it might contain evil for some people. This is partial, relative evil. As for\n…. total evil or absolute evil, the Lord, Glory be to Him and Exalted, is transcendent above it. This was benefitted in ((The Explanation)). Review the detail if you wish in ((Shifa' al-Alil)) by Ibn al-Qayyim, may Allah have mercy on him. From it you know the lie of whoever attributed that there is a creator for evil other than Allah Almighty, in an article published unfortunately in Al-Hadarah Magazine (p. 50-52, Issue (5) Year 18). (N)",
    "book_id": "954",
    "new_page_number": 41
  },
  {
    "serial_number": "32039",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "[People of Major Sins among Believers do not stay eternally in Hell]\n68- And the people of major sins ((from the Ummah of Muhammad, peace be upon him (1))) will not remain eternally in the Fire, if they died as monotheists (*Muwahhidun*), even if they were not repentant, after they met Allah as knowers (*Arifin*) (2)",
    "foot_note": "1. (1) \n…. What is between the brackets did not appear in the three manuscripts, nor in the print of (Kh). Deleting it is more correct, because the implication of this addition is that people of major sins from a nation other than the Ummah of Muhammad, peace be upon him, before those laws were abrogated by him, have a ruling different from the people of major sins from the Ummah of Muhammad. There is observation in that, for the Prophet, peace be upon him, informed that: ((Whoever has an atom's weight of faith in his heart will exit the Fire)) and did not restrict his Ummah with that, but mentioned faith absolutely. So reflect on it. Know that they differed in defining major sins on several opinions; the most likely is that it is what incurs a Hadd (legal punishment), or is threatened with Fire, Curse, or Anger. Review ((The Explanation)) and ((Majmoo' al-Fatawa)) by Sheikh al-Islam Ibn Taymiyyah (11/650). (N)\n2. \n…. His saying 'Knowers' (*Arifin*): It is not hidden that heart-knowledge alone is not sufficient for Faith. The author contradicted what he went to previously that Faith is ratification by the heart and affirmation by the tongue. This is the school of Abu Hanifa and his companions regarding Faith. As for the school of the Salaf, Faith is belief in the heart, speech by the tongue, and action by the limbs; this is the correct view. The Karramiyyah went to saying it is speech by the tongue. The Jahmiyyah said: It is belief in the heart, and this is what the author restricted himself to (here). Based on this, there is no disbeliever among people, for they acknowledge the existence of Allah and that He is their Lord and Creator. Allah said: {And if you asked them, \"Who created the heavens and earth?\" they would surely say, \"Allah.\"}. So Allah Almighty declared the polytheists disbelievers despite their acknowledgment that He is the Creator of the heavens and earth. Likewise Iblis, Abu Jahl, Pharaoh, Qarun, Haman, and other sects of disbelief are all believers according to the claim of Jahm and his followers, because they acknowledge that Allah is their Lord\n…. and Creator; so they are believers according to this false, rejected saying. The Imams of Islam like Ibn al-Qayyim and others refuted what the author mentioned. He, may Allah have mercy on him, said in Al-Nuniyyah:\nThey said: Servants' acknowledgment that He is their Creator\nIs the limit of Faith\nAnd people in Faith are one thing\nLike a comb when the teeth are equal\nSo ask Abu Jahl and his faction\nAnd those who allied with them of idol worshippers\nAnd ask the father of Jinn, the Cursed one, do you know\nThe Creator or have you become a denier?\nAnd ask likewise the Imam of every Negator (*Mu'attil*)\nPharaoh, with Qarun, with Haman\nWas there among them a denier of the Creator\nThe Great Lord, Former of Universes?\nSo let them rejoice, there is no disbeliever among them\nThey are, according to Jahm, perfect in Faith (M)",
    "book_id": "954",
    "new_page_number": 42
  },
  {
    "serial_number": "32040",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "((believers)) (1). They are in His will (*Mashi'ah*) and judgment. If He wills, He forgives them and pardons them by His grace, as He, Mighty and Majestic, mentioned in His Book: {and forgives what is less than that (2) for whom He wills} [An-Nisa: 48, 116]. And if He wills, He punishes them in the Fire by His justice, then brings them out of it by His mercy and the intercession of intercessors from the people of His obedience, then sends them to His Paradise. That is because Allah Almighty became the Guardian (*Wali*) of the people of His knowledge (3), and did not make them in the two abodes like the people of His denial, who failed (to receive) His guidance and did not obtain His guardianship. O Allah, O Guardian of Islam and its people, make us firm on Islam until we meet You with it (4).\n\n[Obligation of obeying Imams and Rulers]\n69- We see (the validity of) prayer behind every righteous (5)",
    "foot_note": "1. (1) \n…. Addition from manuscript (A, B, Gh). It is an important addition not established in some copies, including the Commentator's copy, for he said: ((His saying: (Knowers - Arifin), if he said: Believers (*Mu'minin*) instead of (Knowers) it would have been better, because whoever knows Allah but does not believe in Him is a disbeliever. Only Jahm sufficed with knowledge alone, and his saying is rejected and false...)). (N)\n2. \n…. Meaning Shirk, which is Kufr. There is no difference between them legally; every Kufr is Shirk and every Shirk is Kufr. As indicated by the dialogue of the believer to the disbeliever owner of the two gardens mentioned in Surah (Al-Kahf). So take note of this, for by it many ambiguities are removed from you. And praise be to Allah by whose grace good deeds are completed. (N)\n3. \n…. His saying: 'That is because Allah is the Guardian of the people of His knowledge' (Ma'rifah): regarding it is said what was previously mentioned of editing and clarification (re: knowledge vs faith). (M)\n4. \n…. This supplication was narrated as Marfu' (from the Prophet). It is referenced in ((Al-Sahihah)) (1823) as I mentioned in ((Takhrij al-Sharh)), but it appeared there as (1833) which is a typo requiring correction. (N)\n5. \n…. His saying: 'We see prayer behind every righteous and wicked person': He intends by that to refute the Rafidah. Scholars, may Allah have mercy on them, differed regarding the validity of prayer behind a Fasiq (sinner). Al-Shafi'i and Abu Hanifa went to its validity with dislike (*Karahah*). Ahmad and Malik went to invalidity. The Fasiq is one who commits a major sin or persists in a minor one. There is no difference in the validity of prayer behind a Fasiq according to Imam Ahmad whether his Fihq is in belief or action. According to Imam Ahmad, prayer is valid behind every righteous and wicked person =\n…. for Friday prayer and Eid if performing them behind another is impossible. As for other prayers, they are not valid behind a Fasiq according to the Madhhab, due to his saying, peace be upon him: (Make your Imams the best of you) and his saying: (Let not a wicked person lead a believer). Sheikh al-Islam Ibn Taymiyyah said: As for the opponent arguing with the statement 'Prayer is permissible behind every righteous and wicked person', this is a Hadith that is not established. Discussion on this issue has been elaborated in the Chapter of Imamate in Fiqh books. (M)",
    "book_id": "954",
    "new_page_number": 43
  },
  {
    "serial_number": "32041",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "and wicked person from the people of the Qiblah, and over who dies among them (1).\n70- We do not send anyone of them to Paradise (2)",
    "foot_note": "1. (1) \n…. The evidence for that is the practice of the Companions upon it, as you see explained in ((The Explanation)), and they are sufficient proof. Along with them is the likes of his saying, peace be upon him, regarding Imams: ((They pray for you; if they are correct, it is for you and them; if they err, it is for you and against them)) narrated by Al-Bukhari, Ahmad, and Abu Ya'la. Regarding prayer over who dies among them, there are other evidences, you see them in ((Ahkam al-Jana'iz)) (p. 79). As for the Hadith ((Pray behind every righteous and wicked person, and pray over every righteous and wicked person...)), it is of weak chain as I indicated in ((The Explanation)) and clarified in ((Da'if Abu Dawood)) (97) and ((Al-Irwa)) (520). There is no evidence for the invalidity of prayer behind a Fasiq. The Hadith ((Make your Imams the best of you)) has a very weak chain as I verified in ((Al-Da'ifah)) (1822); even if authentic, it only indicates the obligation of making Imams from the best, which is one thing, and the invalidity of prayer behind a Fasiq is another thing, especially if he is imposed by the ruler. Yes, if the Hadith ((...and let not a wicked person lead a believer...)) were authentic, it would be apparent evidence for the invalidity of his Imamate, but it is also not authentic in its chain as I clarified in the beginning of ((Al-Jumu'ah)) from ((Al-Irwa)) (No. 591). (N)\n2. \n…. Except the Ten given glad tidings of Paradise, Abdullah bin Salam, and others; we testify for them of Paradise based on the testimony of the Messenger, peace be upon him. The author, may Allah have mercy on him, declared this in paragraph (95). Among the misguidance of some writers today and their ignorance is their criticizing Abdullah bin Salam for his Judaism before his Islam, despite the Prophet's testimony, peace be upon him, for him of Paradise as in ((Sahih Al-Bukhari)). I wish I knew what difference there is between one who was Jewish\n…. then embraced Islam, and one who was pagan and embraced Islam, were it not for Pre-Islamic tribal partisanship. Indeed there is a difference, for it came in the ((Two Sahihs)), his saying, peace be upon him: ((Three have their reward twice...)) and he mentioned among them ((and a man from the People of the Book who believed in his Prophet and reached the Prophet, peace be upon him, so he believed in him, followed him, and confirmed him)). This one has two rewards, unlike the pagan if he embraces Islam, for he has one reward. (N)",
    "book_id": "954",
    "new_page_number": 44
  },
  {
    "serial_number": "32042",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "nor to Fire, nor do we bear witness against them of Kufr (disbelief) nor Shirk (polytheism) nor Nifaq (hypocrisy), as long as nothing of that appears from them, and we leave their inner secrets to Allah Almighty.\n71- We do not see (the use of) the sword against anyone from the Ummah of Muhammad, peace be upon him, except upon whom the sword is obligatory.\n72- We do not see rebelling against our Imams and rulers of our affairs, even if they oppress (1)",
    "foot_note": "1. (1) \n…. The Commentator mentioned in that regard many Hadiths which you can see referenced in his book. Then he said: ((As for the obligation of obeying them even if they oppress, it is because the corruption resulting from rebelling against their obedience is manifold greater than what results from their oppression. Rather, in patience over their oppression is expiation of sins, for Allah only empowered them over us due to the corruption of our deeds, and recompense is of the type of deed. So we must strive in seeking forgiveness, repentance, and rectifying deeds. The Almighty said: {And whatever strikes you of disaster - it is for what your hands have earned; but He pardons much.} [Ash-Shura: 30]. {And thus will We make some of the wrongdoers allies of others for what they used to earn.} [Al-An'am: 129]. So if the subjects want to rid themselves of the oppression of the Emir, let them abandon oppression.\n…. I say: In this is a clarification of the path to salvation from the oppression of rulers who are ((of our skin and speak with our tongues)), which is that Muslims repent to their Lord, correct their creed, and raise themselves and their families on correct Islam, realizing His saying Almighty: {Indeed, Allah will not change the condition of a people until they change what is in themselves} [Ar-Ra'd: 11]. To that, one of the contemporary callers pointed by saying: ((Establish the state of Islam in your hearts, it will be established for you on your land)). The path of salvation is not what some people imagine, which is armed revolution against rulers through military coups. For besides being among the innovations of the modern age, they are contrary to Sharia texts which command changing what is in the selves. Likewise, the foundation must be rectified to build the structure upon it {And Allah will surely support those who support Him. Indeed, Allah is Powerful and Exalted in Might.} [Al-Hajj: 40]. (N)",
    "book_id": "954",
    "new_page_number": 45
  },
  {
    "serial_number": "32043",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": ", nor do we supplicate against them, nor do we withdraw a hand from their obedience. We view their obedience as part of obedience to Allah, Mighty and Majestic, as an obligation (1), as long as they do not order disobedience. We pray for their rectification and well-being.",
    "foot_note": "1. (1) \n…. It is clear that this is specific to the Muslims among them, due to His saying Almighty {Obey Allah and obey the Messenger and those in authority among you} [An-Nisa: 59]. As for the colonialist disbelievers, there is no obedience to them; rather, complete preparation =\n…. material and moral is obligatory to expel them and cleanse the land of their filth. As for interpreting His saying Almighty {among you} as 'in you' (!), it is a Qadiani heresy and English intrigue, to misguide Muslims and compel them to obey colonialist disbelievers. May Allah cleanse Muslim lands from them all. (N)",
    "book_id": "954",
    "new_page_number": 46
  },
  {
    "serial_number": "32044",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "[Following Ahl al-Sunnah wal-Jama'ah]\n73- We follow the Sunnah and the Jama'ah (1), and avoid oddity (*Shudhudh*) (2), disagreement, and division (3).\n74- We love the people of justice and trust, and hate the people of oppression and treachery.\n75- We say 'Allah knows best' regarding what is ambiguous to us in knowledge.",
    "foot_note": "1. (1) \n…. Sunnah: The way of the Messenger of Allah. Jama'ah: The community of Muslims, who are the Companions and those who follow them in goodness until the Day of Judgment. Following them is guidance, and opposing them is misguidance. (N)\n2. \n…. This contains the safety of a person's religion. He should, in issues of disagreement, take the saying of the majority of scholars, because what contradicts the majority opinion is odd (*Shadh*) and not relied upon, unless there is a textual evidence from the Book or Sunnah, then taking it is obligatory. This is consensus as narrated by Imam Al-Shafi'i, may Allah have mercy on him. (M)\n3. \n…. Meaning oddity from the Sunnah and opposing the Jama'ah who are the Salaf as you learned. It is not oddity at all for a Muslim to choose an opinion from the disputed opinions due to evidence appearing to him, even if the majority is contrary to it, contrary to those who imagine otherwise. For there is no evidence in the Book or Sunnah that everything the majority holds is more correct than what their opponents hold when evidence is lacking! Yes, if Muslims agree on something without known disagreement among them, it is obligatory to follow it due to His saying Almighty: {And whoever opposes the Messenger after guidance has become clear to him and follows other than the way of the believers - We will give him what he has taken and drive him into Hell, and evil it is as a destination} [An-Nisa: 115]. As for during disagreement, the obligation is returning to the Book and Sunnah. Whoever the truth becomes clear to follows it, and whoever not, consults his heart, whether he agrees with the majority or opposes them. I do not think anyone can be a 'Majoritarian' (!) in everything where truth is not clear to him; rather he is sometimes this way and sometimes that way, according to the reassurance of his soul and expansion of his chest. The Messenger of Allah, peace be upon him, spoke truth when he said: ((Consult your heart, even if the verdict-givers give you a verdict)). (N)",
    "book_id": "954",
    "new_page_number": 47
  },
  {
    "serial_number": "32045",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "76- We see (the validity of) wiping over leather socks (*Khuffayn*) (1), in travel and residence, as came in the tradition (*Athar*).",
    "foot_note": "1. (1) \n…. a) His saying: 'We see wiping over leather socks... etc.' Meaning due to its establishment from the Prophet, peace be upon him, in action and speech from the narration of seventy Companions as narrated by Al-Hasan. Imam Ahmad said: There is nothing in my soul regarding wiping over =\n…. leather socks; there are forty Hadiths about it from the Prophet, peace be upon him. Al-Suyuti counted the Hadiths of wiping over socks among the Mutawatir Hadiths, where he said in Alfiyyat al-Hadith:\nSeventy narrated it, among whom are those who denounced falsehood\nAnd among them are the Ten, then it was attributed\nTo it are the Hadith of raising hands, the Pond\nAnd wiping over leather socks\nNo one denies wiping over leather socks except people of innovation like the Rafidah who do not restrict themselves to the established Sunnah but reject it with their stagnant, corrupt opinions. (M)\n b) I say: The author, following other authors in ((Al-Sunnah)), mentioned wiping over leather socks (*Khuffayn*) without mentioning socks (*Jawrabayn*) and sandals (*Na'layn*) for two reasons: First: Wiping over leather socks is Mutawatir from the Messenger of Allah, peace be upon him. Second: The Rafidah oppose this Sunnah, so the argument against them is stronger in using what is Mutawatir from the Messenger of Allah, peace be upon him. Mentioning leather socks does not negate the establishment of wiping over socks and sandals as well. This is detailed in the book ((Al-Mash 'ala al-Jawrabayn)) by Sheikh Al-Qasimi, and I followed it with an appendix in which I verified many rulings of wiping; it is printed by Al-Maktab Al-Islami. (N)",
    "book_id": "954",
    "new_page_number": 48
  },
  {
    "serial_number": "32046",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "[Obligation of Hajj and Jihad until the Day of Resurrection]\n77- Hajj and Jihad continue with those in authority of the Muslims, their righteous and their wicked, until the establishment of the Hour (1); nothing invalidates them nor annuls them.\n\n[Belief in Angels and the Barzakh]\n78- We believe in the Noble Scribes (Angels), for Allah (2) has made them guardians over us.\n79- We believe in the Angel of Death (3), who is entrusted with seizing the souls of the worlds.",
    "foot_note": "1. (1) \n…. Know that Jihad is of two types: First: Individual Obligation (*Fard Ayn*), which is repelling the enemy attacking some Muslim lands, like the Jews now who occupied Palestine; all Muslims are sinful until they expel them from it. The other: Collective Obligation (*Fard Kifaya*), if performed by some, it falls off the rest. It is Jihad for the sake of conveying the Islamic Call to other lands until Islam rules them. Whoever submits from their people, fine; whoever stands in its way is fought until the Word of Allah is supreme. This Jihad continues until the Day of Resurrection, let alone the first type. It is regrettable that some writers today deny it, and not only that, but make that denial one of the virtues of Islam! This is only an effect of their weakness and inability to undertake the Individual Jihad. The Messenger of Allah, peace be upon him, spoke truth when he said: ((If you deal in 'Eeenah, and hold onto the tails of cows, and are content with agriculture, and abandon Jihad in the path of Allah, Allah will inflict upon you a humiliation that He will not remove from you until you return to your religion)) ((Al-Sahihah)) (11). (N)\n2. \n…. In manuscript (C): ((And that)) (*Wa anna*), likewise in Sheikh Raghib's print. Perhaps it is more correct. (N)\n3. \n…. I say: This is his name in the Quran. As for naming him (Azrael) as is common among people, it has no basis; it is from the Isra'iliyyat (Judeo-Christian traditions). (N)",
    "book_id": "954",
    "new_page_number": 49
  },
  {
    "serial_number": "32047",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "80- And (we believe) in the punishment of the grave for those who deserve it (1), and the questioning of Munkar and Nakir in his grave about his Lord, his religion, and his Prophet, according to what the reports came with from the Messenger of Allah, peace be upon him (2), and from the Companions, may Allah be pleased with them.\n81- The grave is a garden from the gardens of Paradise, or a pit from the pits of Hellfire (3).\n\n[Belief in the Day of Resurrection and its Scenes]\n82- We believe in the Resurrection and the Recompense of deeds on the Day of Resurrection, the Presentation, the Reckoning, the Reading of the Book, the Reward and Punishment, the Bridge (*Sirat*), and the Scale (*Mizan*).\n\n[Belief in Paradise and Hell]\n83- Paradise and Hell (4)",
    "foot_note": "1. (1) \n…. Meaning from the disbelievers and the dissolute Muslims. The first is definitive, stated in the Quran. The other is likewise stated in many Hadiths reaching the level of Tawatur as the Commentator and others mentioned. It must be believed in, but one should not delve into its modality, as the mind has no access to its modality. The Sharia does not bring what reason deems impossible, but it may bring what reason is baffled by. So submission is obligatory. You find some of the referenced Hadiths in ((The Explanation)) and in ((Al-Sunnah)) by Ibn Abi Asim (No. 863-877 with my checking and referencing). (N)\n2. \n…. They are Mutawatir as I mentioned just now. Except for naming the two angels Munkar and Nakir; regarding that is a Hadith with a Hasan chain, referenced in ((Al-Sahihah)) (1391). (N)\n3. \n…. This is a piece of a Hadith narrated by Al-Tirmidhi (2/75) from Abu Sa'id raised (to the Prophet) with a weak chain. The first part was narrated by Abu Ya'la and it contains Darraj as in ((Al-Majma')) (3/55), who has objectionable narrations. (N)\n4. \n…. His saying 'Paradise and Hell are created and never perish': Ahl al-Sunnah wal-Jama'ah agreed that Paradise and Hell are created because the evidences of the Book and Sunnah indicating that, and the story of Adam entering Paradise and being expelled from it, are known to everyone who reads the Holy Quran or hears it. May Allah have mercy on Ibn al-Qayyim where he said:\nSo come to Gardens of Eden for they are\n......Our first dwellings and in them is the camp\nMany Hadiths indicating the existence of Paradise and Hell have been reported, as in the Eclipse Prayer Hadith where the Prophet, peace be upon him, explicitly mentioned seeing Paradise and Hell. Ahl al-Sunnah wal-Jama'ah agreed that Paradise does not perish or cease to exist due to His saying Almighty {Its fruit is lasting and its shade} and His saying: {a gift without interruption} and other evidences. As for the Fire, it is likewise according to the majority of the Salaf; it does not perish or cease to exist, nor does anyone of its people exit it, as the Almighty said: {And they are not to emerge from the Fire}. Rather, the people of Paradise and the people of Fire are eternal in them as came in the authentic Hadith: ((O people of Paradise, eternity and no death; O people of Fire, eternity and no death)). It has been reported from some past scholars the saying of the perishing of the Fire, and this was attributed to Sheikh al-Islam Ibn Taymiyyah, but it is not established from him. Likewise, his student Ibn al-Qayyim elaborated on this issue in his book Shifa' al-Alil and Hadi al-Arwah, but he\n…. did not assert the perishing of the Fire. Rather he said, after mentioning more than twenty proofs for that: If it is asked: where did your foot end in this great issue? It is said: To His saying Almighty {Indeed, your Lord is an effecter of what He intends}. But he declared in the book Al-Wabil al-Sayyib that Paradise and Hell do not perish, and that the fire that perishes is the fire of the disobedient monotheists. Caution: Ibn al-Qayyim cited in Shifa' al-Alil and Hadi al-Arwah His saying Almighty {And they will not be removed from it} regarding the people of Fire, but the correct view is that it was said regarding the people of Paradise, so memorize this. Then know that the intent of Ahl al-Sunnah wal-Jama'ah in mentioning the creation of Paradise and Hell and their non-perishing is to refute Jahm and his followers who oppose the texts of the Book and Sunnah with their false opinions and corrupt beliefs. Ibn al-Qayyim and others from Ahl al-Sunnah undertook recounting their sayings and refuting them, supporting the Sunnah and defending it. Jahm only took this grave path to be consistent with his proof, which is the proof =\n…. called 'Proof of Occurrences' (*Dalil al-Akwan*), as its basis is cutting off infinite regress (*Tasalsul*), which is preventing events that have no beginning; so likewise events that have no end must be prevented. The refutation of him is detailed in Al-Nuniyyah. Ibn al-Qayyim recounted Jahm's saying on the perishing of Paradise and Hell and refuted him in verses, including:\nHe ruled that the Fire was not created nor Gardens of Eden\nRather they are two non-existents\nSo if they are created for the day of our return\nThen they are, over times, perishing\nAnd Al-Allaf (Mu'tazili) was subtle among his followers\nSo he came with the laugh of an ignorant jester\nHe said perishing happens in movements\nNot in essence; wonder at this delirium (M)",
    "book_id": "954",
    "new_page_number": 50
  },
  {
    "serial_number": "32048",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "are created, they never perish nor cease to exist (1). Allah Almighty created Paradise and Hell before creation, and created inhabitants for them. Whoever He wills among them to Paradise is out of His grace, and whoever He wills among them to the Fire is out of His justice. Everyone works for what has been finished for him (2), and is going towards what he was created for.\n\n[Actions of Servants are Allah's Creation and Servants' Acquisition]\n84- Good and Evil are decreed upon the servants.",
    "foot_note": "1. (1) \n…. Know that the Fire in the Hereafter is two fires: a fire that perishes, and a fire that remains forever and does not perish. The first is the fire of the disobedient sinners among the Muslims, and the other is the fire of the disbelievers and polytheists. This is the summary of what Ibn al-Qayyim edited in ((Al-Wabil al-Sayyib)), and it is the truth in which there is no doubt, and by which evidences are reconciled. Do not be deceived by what the Commentator mentioned here and Ibn al-Qayyim in ((Shifa' al-Alil)) and ((Hadi al-Arwah)) which might contradict what I summarized, for they did not adopt that, and there is no clear authentic evidence indicating the perishing of the fire of the disbelievers. Allah Almighty, just as He said regarding the people of Paradise: {No fatigue will touch them therein, nor from it will they [ever] be removed} [Al-Hijr: 48], He said the like regarding the disbelievers: {And they are not to emerge from the Fire} [Al-Baqarah: 167]. What is narrated from Umar and others is not authentic in chain as I clarified in my comments on ((The Explanation))\n…. so take note, then in ((The Weak Hadiths)) Volume Two, [606-607], and it will be released soon by Allah's permission (1). (N)\n2. \n…. Referring to his saying, peace be upon him: ((Allah finished with every servant regarding five: his lifespan, his provision, his trace, his resting place, and whether wretched or happy)). It is an authentic Hadith referenced in ((Al-Mishkat)) (113) and ((Al-Sunnah)) (303-309). Hadiths with this meaning are many and known. (N)\n1. \n…. Printed among the publications of Maktabat al-Ma'arif.",
    "book_id": "954",
    "new_page_number": 51
  },
  {
    "serial_number": "32049",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "85- The Capacity (*Istita'ah*) by which action becomes obligatory, which is like success (*Tawfiq*) that cannot be attributed to the creature (as a permanent trait), is with the action. As for the Capacity from the aspect of health, ability (*Wus'*), possibility (*Tamakkun*), and soundness of instruments, it is before the action, and the address (of command/prohibition) relates to it. It is as the Almighty said: {Allah does not charge a soul except [with that within] its capacity} (1) [Al-Baqarah: 286].",
    "foot_note": "1. (1) \n…. The first (capacity with action) was held by the Ash'aris, and the other (capacity before action) was held by the Mu'tazilah. The correct view is asserting both together according to the detail mentioned by the author, may Allah have mercy on him. Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, clarified that with a healing clarification; there is no harm in quoting it entirely for its importance. He said, may Allah's mercy be upon him, in ((Majmoo' al-Fatawa)) (8/371-376): ((People from our companions and others have spoken regarding the ((servant's capacity)): is it with his action or before it? They made them two contradictory sayings. A group made capacity with the action only. This is predominant among the Affirmers of Destiny, the Theologians from the companions of Al-Ash'ari and those who agreed with them from our companions and others. A group made capacity before the action, which is predominant among the Deniers (of Destiny) from the Mu'tazilah and Shia. The first group made power valid only for one action, as it accompanies it and does not separate from it. The others made capacity valid only for opposites, never accompanying the action. The Qadariyyah are more deviant, for they prevent power being with the action at all; according to them, the influencer must precede the effect and never accompany it, whether power, will, or command.\n…. The truth indicated by the Book and Sunnah is that Capacity precedes the action and accompanies it as well, and another capacity accompanies it which is not valid for anything else. Capacity is of two types: Preceding valid for opposites, and Accompanying which is only with the action. The former is the correcting/enabling one for the action, making it possible; the latter is the obligating one for the action, realizing it. Allah Almighty said regarding the first: {And [due] to Allah from the people is a pilgrimage to the House - for whoever is able to find thereto a way} [Al Imran: 97]. If this capacity were only with the action, Hajj would not be obligatory except on the one who performed Hajj, and no one would disobey by abandoning Hajj, nor would Hajj be obligatory on anyone before entering Ihram: nay, before finishing it! And the Almighty said: {So fear Allah as much as you are able} [At-Taghabun: 16]. He commanded fear according to ability; if He meant accompanying capacity, fear would not be obligatory on anyone except what he did only, since that is what that capacity accompanied. And the Almighty said: {Allah does not charge a soul except [with that within] its capacity} =\n…. [Al-Baqarah: 286]. *Wus'* (Capacity) is the scope, what it contains and can bear. If accompanying capacity were meant, no one would be tasked except with the action he performed only, excluding the obligations he abandoned. \n…. Analogues to this are numerous. Every command in the Book and Sunnah whose obligation is suspended on capacity and lack thereof on lack of capacity does not mean accompanying capacity; otherwise, Allah would have only obligated duties on those who did them, and dropped them from those who didn't, so no one would sin by leaving the mentioned duty! As for the accompanying obligating capacity, it is like His saying Almighty: {They were not able to hear and they used to not see} [Hud: 20]. This capacity is the accompanying obligating one, since the other is necessary for obligation. The first is the Legal (*Shar'iyyah*) which is the basis of command and prohibition, reward and punishment; jurists speak of it, and it is dominant in people's custom. The second: is the Universal (*Kawniyyah*) which is the basis of Decree and Destiny; by it existence of the action is realized. The first is for Legal Command Words. The second is for Creative Universal Words, as He said: {and she believed in the words of her Lord and His scriptures} [At-Tahrim: 12]. People differed regarding the servant's power to do other than what the Truth knew or willed. The verification is that he may be capable by the first Legal Power preceding the action, for Allah is also capable of other than the Known and Willed, otherwise He would not be capable except of what He did. But the servant is not capable of that by the Power accompanying the action; for nothing exists except what Allah knew would exist and willed its existence, for what Allah willed happened, and what He did not will did not happen. Likewise the saying of the Disciples: {Can your Lord send down to us a table from the heaven?} [Al-Ma'idah: 112]; they only asked about this power. Likewise Jonah thought {that We would not decree [an extent] for him} [Al-Anbiya: 87] i.e., interpreted as power (*Qudrah*), as one says to a man: Can you do such? Meaning will you do it? This is famous in people's speech. When the Qadariyyah believed that the first (capacity before action) is sufficient for the occurrence of the action, and that the servant originates his will, they made him independent of Allah during the action! Just as the Jabriyyah, when they believed that the second is obligating for the action, and it is from other than him, saw him forced upon the action. Both are ugly errors. For the servant has a will which is subordinate to Allah's will as Allah mentioned in several places in His Book. If Allah made the servant willing, choosing, intending, it is impossible to say: He is forced and coerced, while He made him willing. It is impossible that he (the servant) originated =\n…. the will for himself. If it is said: He is forced to choose, compelled to will, this has no parallel, and is not the concept of compulsion by necessity, and none is capable of that except Allah. Therefore, the Qadariyyah and Jabriyyah separated into two contradictory extremes, and both are correct in what they affirmed but not in what they denied. Ibn al-Khatib and similar Jabriyyah claim that knowledge of the need for a preponderator other than the servant for the servant's action to occur over its omission is necessary, because the possible with equal sides does not preponderate one side over the other except by a preponderator. Both sayings are correct, but the claim that one necessitates negating the other is not correct. For the servant is the originator of his actions, earner of them, and this origination needs an originator. So the servant is a doer, maker, originator; and being a doer, maker, originator after not being so necessitates a Maker for him, as He said: {For whoever wills among you to take a right course} [At-Takwir: 28], so if he wills rectitude he becomes rectified, then He said: {And you do not will except that Allah wills - Lord of the worlds} [At-Takwir: 29]. So what is known by necessity and what auditory and rational evidences indicated is all truth. That is why there is no might nor power except by Allah. The servant is poor to Allah, a poverty essential to him in his essence, attributes, and actions, even though he has an essence, attributes, and actions. So negating his actions is like negating his attributes and essence; it is denial of the truth, resembling the extremism of the extreme Sufis who make him (the servant) the Truth (God), and making anything of him independent of Allah or existing without Him is denial of the truth resembling the extremism of the one who said: {I am your most high lord} [An-Nazi'at: 24] and said he created himself. The truth is only what Ahl al-Sunnah wal-Jama'ah are upon)). (N)",
    "book_id": "954",
    "new_page_number": 52
  },
  {
    "serial_number": "32050",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "86- Actions of the servants (1) are the creation of Allah and acquisition (*Kasb*) of the servants.\n\n[Tasking with what is bearable]\n87- Allah Almighty did not task them except with what they can bear, and they cannot bear (2) except what He tasked them with (3).",
    "foot_note": "1. (1) \n…. Here in the original is an addition: (Hiya - are), and since it did not appear in any of the originals we have, we deleted it. (N)\n2. \n…. This is incorrect. Rather, the tasked ones can bear more than what He, Glory be to Him, tasked them with, but He, Mighty and Majestic, was kind to His servants and made it easy for them and did not place upon them in their religion any difficulty, out of His grace and benevolence. And Allah is the Guardian of success. (Z)\n3. \n…. a) His saying 'and they cannot bear except what He tasked them with': Meaning they cannot bear except what He enabled them to do. The Commentator refuted the Author on that, saying that *Taklif* (tasking) is not used in the sense of enabling, but in the sense of command and prohibition. Then he =\n…. said: And that is not correct, meaning his saying 'and they cannot bear except what He tasked them with', rather they can bear more than what He tasked them with. I say: Because it is within man's possibility to pray more than five, fast more than a month, and perform Hajj more than once. But He, Glory be to Him, wants ease for His servants and does not want hardship for them. The Almighty said: {Allah wants to lighten for you}. And He said {and [He] has not placed upon you in the religion any difficulty}. What the Book of Allah and the Sunnah of His Messenger indicate is the truth and correctness. (M)\n b) Meaning: nor can they bear except what He enabled them to do. This 'bearing' is what is like success (*Tawfiq*), not that which is of health, ability, possibility, and soundness of instruments. However, there is a problem in the author's speech which the Sheikh Commentator clarified saying: ((For *Taklif* is not used in the sense of enabling (*Iqdar*), but is used in the sense of command and prohibition. Yet he said: ((He does not task them except with what they can bear, and they cannot bear except what He tasked them)). Its apparent meaning returns to one sense, and that is not correct, because they can bear more than what He tasked them with. But He, Glory be to Him, wants ease and lightening for His servants, as the Almighty said: {Allah intends for you ease and does not intend for you hardship} [Al-Baqarah: 185]. And said: {Allah wants to lighten for you} [An-Nisa: 28]. And said: {and has not placed upon you in the religion any difficulty} [Al-Hajj: 78]. If He increased what He tasked us with, we would bear it, but He favored us, had mercy on us, lightened for us, and did not place hardship on us in religion. This problem is answered by what preceded: that the intent is the capacity which is like success, not from the aspect of possibility and soundness of instruments. There is awkwardness in the phrase, so reflect on it)). (N)",
    "book_id": "954",
    "new_page_number": 53
  },
  {
    "serial_number": "32051",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "And this is the explanation of: ((There is no might nor power except by Allah)). We say: There is no stratagem for anyone, no movement for anyone, and no turning away for anyone from disobeying Allah except by Allah's aid. And there is no power for anyone to establish obedience to Allah and remain firm on it except by Allah's success (*Tawfiq*).\n88- Everything runs by the Will of Allah Almighty, His Knowledge, His Decree, and His Destiny. His Will overcame all wills, and His Decree overcame all stratagems (1). He does whatever He wills and He is never unjust (2).",
    "foot_note": "1. (1) \n…. Here in the text of ((The Explanation)) is a phrase not present in the copies we have, so we deleted it. (N)\n2. \n…. a) Meaning because He, Glory be to Him, forbade injustice upon Himself as He forbade it upon His servants. Injustice is placing things in other than their places. The evidences of the Book and Sunnah indicate that Allah Almighty is capable of injustice but He does not do it, as the Almighty said: {Indeed, Allah does not do injustice, [even] as much as an atom's weight} and He said: {But he who does of =\n…. righteous deeds while he is a believer - he will neither fear injustice nor deprivation}. Deprivation (*Hadm*) is to decrease the reward of his good deeds, and Injustice (*Zulm*) is to punish him for the sins of others. So He, Glory be to Him, prevented Himself from injustice to His servants despite His capability over it, out of generosity, nobility, and benevolence from Him. (M).\n b) The Commentator said (p. 448): ((What the Quran indicated regarding Allah purifying Himself from doing injustice to servants necessitates a middle saying between the sayings of the Qadariyyah and the Jabriyyah. Not everything that is injustice and ugly from the sons of Adam is injustice and ugly from Him, as the Qadariyyah and Mu'tazilah and their likes say! For that is likening Allah to His creation! And measuring Him by them! He is the Rich Powerful Lord, and they are the poor overpowered servants. Nor is injustice an expression for the impossible which does not fall under power, as said by those who say it from the Theologians and others, saying it is impossible for there to be injustice in the possible capable! Rather, everything possible is - if He did it - just from Him, since injustice is only from one commanded and forbidden by another, and Allah is not like that! For His saying Almighty: {But he who does of righteous deeds while he is a believer - he will neither fear injustice nor deprivation} [Taha: 112], and His saying: {The word will not be changed with Me, and never will I be unjust to the servants} [Qaf: 29], and His saying: {We did not wrong them, but they were the wrongdoers} [Az-Zukhruf: 76], and His saying: {And they will find what they did present [before them]. And your Lord does injustice to no one.} [Al-Kahf: 49], and His saying: {This Day every soul will be recompensed for what it earned. No injustice today! Indeed, Allah is swift in account.} [Ghafir: 17] indicate the opposite of this saying. From it is His saying narrated from Him by His Messenger: ((O My servants, I have forbidden injustice on Myself, and made it forbidden among you, so do not be unjust to one another)). This indicated two things: One, He forbade injustice on Himself, and the impossible is not described by that. Second: He informed He forbade it on Himself, just as He informed He prescribed Mercy on Himself. This invalidates their argument that injustice is only from a commanded/forbidden one, and Allah is not like that. It is said to them: He, Glory be to Him, prescribed Mercy on Himself and forbade Injustice on Himself; He only prescribed on Himself and forbade on Himself what He is capable of, not what is impossible for Him. (N)",
    "book_id": "954",
    "new_page_number": 54
  },
  {
    "serial_number": "32052",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "He is sanctified from every evil and destruction (*Hin*) (1), and purified from every defect and blemish. {He is not questioned about what He does, but they will be questioned} [Al-Anbiya: 23].\n89- In the supplication of the living and their charities, there is benefit (2) for the dead (3).\n90- Allah Almighty answers supplications and fulfills needs.\n\n[Allah is the Rich and we are poor to Him]\n91- He owns everything, and nothing owns Him. There is no independence from Allah Almighty for the blink of an eye. Whoever thinks himself independent from Allah for the blink of an eye has disbelieved and become of the people of destruction (*Hin*) (4).",
    "foot_note": "1. (1) \n…. *Al-Hin*: Destruction. What is between brackets is an addition from manuscript (Gh) and print (Kh). (N)\n2. \n…. Dropped from the Commentator's copy, but established in other copies, and the context requires it. (N)\n3. \n…. a) Meaning the living are the ones who pray for the dead and ask Allah for mercy and forgiveness for them. The grave worshippers have reversed this, invoking them with Allah and besides Allah. Their invocation is Major Shirk, even though they (the dead) do not hear the call of those who call them nor respond to them with anything. Allah Almighty said: {If you invoke them, they do not hear your supplication; and if they heard, they would not respond to you. And on the Day of Resurrection they will deny your association.} He named this invocation Shirk. Grave worshippers claim the dead bring them closer to Allah in station. (M)\n b) The Commentator, may Allah have mercy on him, cited the agreement of Ahl al-Sunnah on that, then cited evidences from the Book and Sunnah for it. However, regarding charity, he only mentioned what indicates the benefit of a child's charity for his parent, and this is more specific than the claim, as is obvious. I explained this and examined the mentioned agreement in ((Ahkam al-Jana'iz)) (p. 173), so review it. (N)\n4. \n…. a) *Al-Hayn* with Fatha is destruction. (M)\n b) It is destruction as mentioned just now. (N)",
    "book_id": "954",
    "new_page_number": 55
  },
  {
    "serial_number": "32053",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "92- Allah gets angry and becomes pleased, not like anyone from creation (1).\n\n[Love of the Companions of the Prophet, peace be upon him]\n93- We love the Companions of the Messenger of Allah, peace be upon him, and we do not exceed the limit in loving anyone of them (2); nor do we disown anyone of them (3). We hate those who hate them, and those who mention them with other than good. We only mention them with good. Loving them is religion, faith, and excellence (*Ihsan*); and hating them is disbelief, hypocrisy, and transgression.\n94- We affirm the Caliphate after the Messenger of Allah, peace be upon him: first for Abu Bakr Al-Siddiq, may Allah be pleased with him, preferring him and putting him ahead of the entire Ummah; then for Umar bin Al-Khattab, may Allah be pleased with him; then for Uthman bin Affan, may Allah be pleased with him; then for Ali bin Abi Talib, may Allah be pleased with him. They are the Rightly Guided Caliphs and the Guided Imams (4).",
    "foot_note": "1. (1) \n…. In this is a refutation of the interpreting Negators from the Ash'aris and others who said the meaning of Anger and Pleasure is the Will of benevolence! I wish I knew, what is the difference between their acceptance of the attribute of Will and their denial of the two mentioned attributes by interpreting them, when they are like it in the servant being described with them too?! Why didn't they say about them as they said about Divine Will: It is different from the will described for the servant, even if each is a reality befitting the one described with it? The Commentator, may Allah have mercy on him, elaborated on that, so review it. (N)\n2. \n…. Meaning we do not go beyond the limit in loving anyone of them, claiming infallibility for them, as the Shia say about Ali, may Allah be pleased with him, and others of their Imams. (N)\n3. \n…. Meaning as the Rafidah did; for them, there is no loyalty (*Wala*) without disavowal (*Bara*). Meaning one does not ally with Ahl al-Bayt until he disavows Abu Bakr and Umar, may Allah be pleased with them both. Ahl al-Sunnah ally with them all and place them in their stations which they deserve with justice and fairness, not with obsession and partisanship. (N)\n4. \n…. Sheikh al-Islam Ibn Taymiyyah said: Whoever impugns the caliphate of anyone of these Imams is more astray than his family's donkey. ((Majmoo' al-Fatawa)) (3/153). (N)",
    "book_id": "954",
    "new_page_number": 56
  },
  {
    "serial_number": "32054",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "95- And that (1) the Ten whom the Messenger of Allah, peace be upon him, named and gave glad tidings of Paradise, we testify for them of Paradise, based on the testimony of the Messenger of Allah, peace be upon him, for them; and his saying is the Truth. They are: Abu Bakr, Umar, Uthman, Ali, Talha, Al-Zubayr, Sa'd, Sa'id, Abdul Rahman bin Awf, and Abu Ubaidah bin Al-Jarrah - who is the Trustee of this Ummah - may Allah be pleased with them all.\n96- Whoever speaks well of the Companions of the Messenger of Allah, peace be upon him, and his wives purified from every filth, and his offspring sanctified from every abomination, is absolved of hypocrisy.\n97- The scholars of the Salaf from the predecessors, and those after them from the successors - the people of goodness and tradition (*Athar*), and people of Fiqh and reflection - are not mentioned except with beauty. Whoever mentions them with evil is on other than the path.\n\n[Prophets are better than Walis (Saints)]\n98- We do not prefer any of the Walis over any of the Prophets (2), peace be upon them. We say: One Prophet is better than all Walis (3).",
    "foot_note": "1. (1) \n…. In copy (Kh): ((We love the Ten... and testify for them...)). (N)\n2. \n…. His saying: 'We do not prefer any of the Walis over any of the Prophets': He intends by this to refute the people of Union (*Ittihad*) who say: Wilayah (Sainthood) is greater than Prophethood, and Prophethood is greater than Messengerhood. They chant: 'The station of Prophethood is in an isthmus... a little above the Messenger and below the Wali'. They say: The Wilayah of the Prophet is greater than his Prophethood, and his Prophethood is greater than his Messengerhood. This is from ignorance of Allah and His Prophets and Messengers. Was the Wali a Wali except by fearing Allah, complying with His commands, leaving His prohibitions, and following Allah's Messengers whom Allah obliged obeying and following their traces? But this is from the extremism of the Ittihadiyyah and Mutasawwifah (Sufis) and their deviation from the straight path. (M)\n3. \n…. He said in The Explanation: The Sheikh, may Allah have mercy on him, points to refuting the Ittihadiyyah and ignorant Sufis; otherwise, the people of rectitude advise following knowledge and following the Sharia. Allah obligated all creation to follow the Messengers. He said: {And We did not send any messenger except to be obeyed by permission of Allah} [An-Nisa: 64]. Many of these think they reach, by their exercises and diligence in worship and purifying themselves, to what the Prophets reached without following their way! Some think they have become better than the Prophets!! Some say Prophets and Messengers only take knowledge of Allah from the niche of the Seal of Walis!! And he claims for himself that he is the Seal of Walis!! That knowledge becomes the reality of Pharaoh's saying, which is that the witnessed existence is necessary by itself, having no Maker separate from it, but this one says: It is Allah! Pharaoh showed denial completely, but Pharaoh was inwardly more knowledgeable of Allah than them, for he =\n…. was affirming the Maker. These thought the created existence is the Creator Existence, like Ibn Arabi and his likes!! When he saw that the apparent Sharia cannot be changed, he said: Prophethood is sealed, but Wilayah is not sealed! He claimed in Wilayah what is greater than Prophethood and what belongs to Prophets and Messengers, and that Prophets benefit from it! As he said: 'The station of Prophethood is in an isthmus... a little above the Messenger and below the Wali!!' This is overturning the Sharia. For Wilayah is established for the pious believers, as He Almighty said: {Unquestionably, [for] the allies of Allah there will be no fear concerning them, nor will they grieve * Those who believed and were fearing Allah} [Yunus: 62-63]. Prophethood is more specific than Wilayah, and Messengerhood is more specific than Prophethood as previously noted. (N)",
    "book_id": "954",
    "new_page_number": 57
  },
  {
    "serial_number": "32055",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "99- We believe in what came of their Karamat (miracles) (1), and what was authenticated from trustworthy narrators of their reports (2).\n\n[Belief in the Signs of the Hour]\n100- We believe in the signs of the Hour: like the emergence of the Dajjal, the descent of Jesus son of Mary, peace be upon him, from the sky (3). We believe in the rising of the sun from its west, and the emergence of the Beast of the Earth from its place.\n101- We do not believe a soothsayer (*Kahin*) nor a fortune-teller (*Arraf*), nor anyone who claims anything contradicting the Book, the Sunnah, and the Consensus of the Ummah.\n102- We see the Jama'ah (4) as truth and correctness, and division as deviation and punishment.",
    "foot_note": "1. (1) \n…. Miracles of Walis (*Karamat*) are true, established by the Book and Sunnah. They are Mutawatir; none denies them except people of innovation like the Mu'tazilah and those who followed their path among Theologians. The people of Truth declared those who deny them misguided because by denying them they clashed with the Book and Sunnah. Whoever opposes and clashes with them by his corrupt opinion and stagnant mind is a deviant innovator. (M)\n2. \n…. I say: The author did well by restricting that to what is authenticated of narrations. That is because people, especially later ones, expanded in narrating Karamat to the point of narrating under its name falsehoods whose invalidity is not doubted by anyone with an atom of reason. Indeed, sometimes they contain Major Shirk, and in Lordship! The book 'Tabaqat al-Awliya' by Al-Sha'rani is one of the widest books mentioning such falsehoods, among which is the saying of one of his Walis (!): \"I abandoned my saying to a thing 'Be, and it is' for twenty years out of etiquette with Allah!\" Exalted is Allah above what the wrongdoers say with great highness. You will find a good collection of authentic Karamat of some Companions in the book ((Riyad al-Salihin)) by Imam Al-Nawawi (Chapter 253 Hadiths 1516-1523 with my checking). (N)\n3. \n…. The Hadiths regarding that are Mutawatir as testified by many skilled Hafiz. I have a treatise on that I named: ((The Story of the Antichrist (Dajjal), and the Descent of Jesus peace be upon him and his Killing of him)). I hope Allah facilitates its drafting for me. (N)\n4. \n…. It is what the Messenger of Allah, peace be upon him, and his companions were upon. And in the Saved Sect, which is the group of Ahl al-Hadith and those who follow their path from the followers of the Madhhabs and others. (N)",
    "book_id": "954",
    "new_page_number": 58
  },
  {
    "serial_number": "32056",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "[The Religion with Allah is Islam]\n103- The religion of Allah in the earth and the heaven is one, and it is the religion of Islam. Allah Almighty said: {Indeed, the religion in the sight of Allah is Islam} [Al Imran: 19]. And He said: {and have approved for you Islam as religion} [Al-Ma'idah: 3] (1).\n\n[The Middle Path of Religion]\n104- It is between excess and negligence, between likening (*Tashbih*) and negation (*Ta'til*), between fatalism (*Jabr*) and denial of destiny (*Qadar*), and between security (*Amn*) and despair (*Iyas*).\n\n[This is our Religion]\n105- This is our religion and our belief, outwardly and inwardly. We are free before Allah Almighty from everyone who opposes what we have mentioned and clarified.",
    "foot_note": "1. (1) \n…. The Commentator, may Allah have mercy on him, said: The religion of Islam is what Allah Glory be to Him legislated for His servants on the tongues of His Messengers. The origin of this religion and its branches is its narration from the Messengers. It is apparent with utmost clarity. Every discerner, small or big, eloquent or non-Arab, smart or dull, can enter it in the shortest time. And exiting from it happens even faster than that, by denying a word, belying, opposing, lying against Allah, doubting the word of Allah Almighty, rejecting what He revealed, doubting what Allah negated doubt about, or other things of similar meaning. The Book and Sunnah indicated the clarity of the religion of Islam, ease of learning it, and that a delegate learns it then leaves in his time. The Prophet's teaching, peace be upon him, varied in some wordings according to the learner. If he was from a far land, like Dimam bin Tha'labah al-Najdi and the delegation of Abdul Qais, he taught them what they could not be ignorant of, ==\n…. knowing that his religion would spread in the horizons, and he would send to them those who teach them Fiqh in all they need. Whoever was from a nearby land could come every time, so he learns gradually—or if he knew he already knew the essentials—he answered him according to his state and need, as indicated by the context of the questioner, like his saying: ((Say I believe in Allah then stand firm)). As for one who legislates a religion Allah did not permit, it is known that its principles necessitating it cannot be narrated from the Prophet, peace be upon him, nor from other Messengers, for it is false, and the requirement of falsehood is false, just as the requirement of truth is truth. (N)",
    "book_id": "954",
    "new_page_number": 59
  },
  {
    "serial_number": "32057",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "[Deviant Sects]\nWe ask Allah Almighty to make us firm on Faith, seal our lives with it, and protect us from conflicting desires, scattered opinions, and vile sects (1), such as: The Anthropomorphists (*Mushabbihah*), Mu'tazilah, Jahmiyyah, Jabriyyah, Qadariyyah, and others (2)",
    "foot_note": "1. (1) \n…. Every sect opposing what Ahl al-Sunnah wal-Jama'ah are upon is a vile, false sect. Allah refuted the Mushabbihah and the negationist Jahmiyyah by His saying: {There is nothing like unto Him, and He is the Hearing, the Seeing}. The Anthropomorphist worships an idol, the Negator worships nothingness, and the Affirmer worships One Lord, Unique, Eternal Refuge. How excellent is the saying of Ibn al-Qayyim in Al-Nuniyyah:\nWe do not liken His description to our attributes\nIndeed, the Anthropomorphist is an idol worshipper\nNay, nor do we empty Him of His attributes\nIndeed, the Negator is a worshipper of falsehood\nThen know that the Jahmiyyah are deniers of Attributes; Jabriyyah are those who said the servant has no optional action; Qadariyyah are those who said servants create their actions; Rafidah are those who declared Companions disbelievers and took the path of Jahmiyyah in denying Attributes. All these sects are sects of deviation and misguidance. Jahm is the one who innovated Negation, Jabr (Fatalism), and Irja' as narrated in Al-Nuniyyah. If anything of it is attributed to others, it is because they supported and backed it. How excellent is what was said:\nYou oppose people in what they saw and narrated\nAnd all of them claim winning the victory\nSo take a saying supported by the text\nEither from Allah or from the Master of Mankind (M)\n2. \n…. Such as the Blind Imitators (*Muqallidah*) who made imitation (*Taqlid*) an obligatory religion upon everyone who came after the fourth century AH, and due to that turned away from being guided by the light of the Book and Sunnah. They accused everyone who tried to escape sectarian stagnation towards adhering to the guidance of the Prophet, peace be upon him, with whatever their desires dictated. May Allah have mercy on the Imam of Sunnah where he says:\nThe religion of the Prophet Muhammad is reports (*Akhbar*)\nYes, the mount for the young man is traditions (*Athar*)\n.........Do not turn away from Hadith and its people\n..................For Opinion is night and Hadith is day\nPerhaps a young man is ignorant of the trace of guidance\nWhile the sun is rising having lights (N)",
    "book_id": "954",
    "new_page_number": 60
  },
  {
    "serial_number": "32058",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Athari Comments on the Tahawi Creed by Imams of the Salafi Call",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": ", from those who opposed the Sunnah and the Jama'ah, and allied with misguidance. We are free from them, and they are to us astray and vile (1). And with Allah is protection and success.",
    "foot_note": "1. (1) \n…. After this in manuscript (A): ((And Allah Glory be to Him and Exalted is the Guide to Truth. This is the end of what we intended, and to which we pointed. And Praise be to Allah, Lord of the Worlds)). And may Allah bless Muhammad, his family, and grant them peace. (N) Praise be to Allah, Lord of the Worlds.",
    "book_id": "954",
    "new_page_number": 61
  }
]