[
  {
    "text": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace\nAuthor: عز الدين محمد بن جماعة\nYear: 819",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "category_id": "24",
    "category": "Prophetic Biography",
    "new_page_number": 1
  },
  {
    "text": "sn: 5908\nbook_title: الغرر والدرر في سيرة خير البشر صلي الله عليه وسلم\nbook_link: https://shamela.ws/book/681\nbook_id: 681\nauthor_name: عز الدين محمد بن جماعة\nauthor_year: 819\nnickname: Null\nauthor_link: https://shamela.ws/author/2704\nauthor_ID: 2704\neditor: تحقيق وتعليق: عدنان أبو زيد\npublisher: دار النوادر، دمشق - سوريا\nedition: الأولى، 1428 هـ - 2007 م\npages: 99\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: السيرة النبوية\ncategory_id: 24",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "category_id": "24",
    "category": "Prophetic Biography",
    "new_page_number": 2
  },
  {
    "serial_number": "5125948",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Prophetic Biography\nBook: Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace\nAuthor: Izz al-Din Muhammad bin Jama'ah (Died 819 AH)\nVerification and Commentary: Adnan Abu Zaid\n[Book numbering corresponds to the printed version]\nDate of publication on Al-Shamela: 24 Jumada al-Akhirah 1443",
    "foot_note": "None",
    "book_id": "681",
    "new_page_number": 3
  },
  {
    "serial_number": "5125949",
    "category_id": "24",
    "category": "Prophetic Biography",
    "category_en": "Prophetic Biography (Seerah)",
    "book_title": "الغرر والدرر في سيرة خير البشر صلي الله عليه وسلم",
    "book_title_en": "The Pearls and Jewels in the Biography of the Best of Mankind, ﷺ",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "edition_en": "First Edition, 1428 AH - 2007 CE",
    "publisher": "دار النوادر، دمشق - سوريا",
    "publisher_en": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 5,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرّحيم المقدمة إن الحمد لله، نحمده، ونستعينه، ونستغفره، ونعوذ بالله من شرور أنفسنا، وسيئات أعمالنا، من يهد الله فلا مضلّ له، ومن يضلل فلا هادي له، وأشهد أن لا إله إلا الله وحده لا شريك له، وأشهد أن محمدا عبده ورسوله. {يا أَيُّهَا الَّذِينَ آمَنُوا اِتَّقُوا اللهَ حَقَّ تُقاتِهِ وَلا تَمُوتُنَّ إِلاّ وَأَنْتُمْ مُسْلِمُونَ} [آل عمران:102] {يا أَيُّهَا النّاسُ اِتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ واحِدَةٍ وَخَلَقَ مِنْها زَوْجَها وَبَثَّ مِنْهُما رِجالاً كَثِيراً وَنِساءً وَاِتَّقُوا اللهَ الَّذِي تَسائَلُونَ بِهِ وَالْأَرْحامَ إِنَّ اللهَ كانَ عَلَيْكُمْ رَقِيباً} [النساء:1] {يا أَيُّهَا الَّذِينَ آمَنُوا اِتَّقُوا اللهَ وَقُولُوا قَوْلاً سَدِيداً (70) يُصْلِحْ لَكُمْ أَعْمالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَمَنْ يُطِعِ اللهَ وَرَسُولَهُ فَقَدْ فازَ فَوْزاً عَظِيماً} [الأحزاب:70 - 71] أما بعد: فإن أصدق الحديث كتاب الله، وأحسن الهدي هدي محمد صلى الله عليه وسلم، وشرّ الأمور محدثاتها، وكلّ محدثة بدعة، وكلّ بدعة ضلالة، وكلّ ضلالة في النار.",
    "text_en": "In the Name of Allah, the Most Merciful, the Most Compassionate. Introduction: All praise is due to Allah. We praise Him, seek His help, and ask His forgiveness. We seek refuge in Allah from the evils of ourselves and the misdeeds of our actions. Whomever Allah guides, none can mislead; and whomever He allows to stray, none can guide. I bear witness that there is no god but Allah alone without partner, and I bear witness that Muhammad is His servant and messenger. \n\n{O you who believe! Fear Allah as He should be feared, and do not die except as Muslims} [Āl ‘Imrān: 102]. \n\n{O mankind! Fear your Lord who created you from a single soul, and created from it its mate, and spread from both many men and women. And fear Allah, through whom you ask one another, and the wombs; surely Allah is ever watching over you} [An-Nisā’: 1]. \n\n{O you who believe! Fear Allah and speak words of appropriate justice. He will rectify your deeds for you and forgive your sins. And whoever obeys Allah and His Messenger has certainly achieved a great triumph} [Al-Aḥzāb: 70–71]. \n\nTo proceed: The truest speech is the Book of Allah, and the best guidance is the guidance of Muhammad (peace be upon him). The worst of matters are newly invented ones; every innovation is a misguidance, and every misguidance is in the Fire.",
    "foot_note": "None",
    "book_id": "681",
    "new_page_number": 4
  },
  {
    "serial_number": "5125950",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 6,
    "volume_number": 1,
    "text": "This is one of the books of Sheikh Imam Izz al-Din Muhammad bin Abi Bakr bin Abd al-Aziz bin Muhammad bin Jama'ah, the scholar of the Egyptian lands in rational sciences of his time. He addressed the Prophetic Biography in a gentle and concise style, where he said in his introduction: 'This is a small-sized book, precious in knowledge, containing important aspects of the biography of our master Muhammad, may Allah bless him and grant him peace, and I named it: \"Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar\"' (1). I present it to the Islamic library as a service to the true religion. I have verified it and made a comprehensive biography for the author introducing him. I exerted my effort, energy, and capability in producing the book in the best form. Whatever correctness is in it, is from the guidance of the Most Merciful, and whatever error is in it, is from me, and Exalted is He who possesses perfection. I hope from Allah - Glory be to Him and Exalted - that I have been successful in that, for He is the best to be asked and the best to answer.\nAdnan Abu Zaid\n***",
    "foot_note": "1. See: Page number (29).",
    "book_id": "681",
    "new_page_number": 5
  },
  {
    "serial_number": "5125951",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 7,
    "volume_number": 1,
    "text": "Author's Biography\n\n1 - His Name and Lineage:\nMuhammad bin Abi Bakr bin Abd al-Aziz bin Muhammad bin Ibrahim bin Sa'd Allah bin Jama'ah bin Muhammad bin Ali bin Hazim bin Sakhr bin Abdullah, Izz al-Din, Abu Abdullah son of Sheikh Shams al-Din son of Chief Judge Izz al-Din son of Chief Judge Badr al-Din, Al-Kinani, originally from Hama, Egyptian, Shafi'i.\n\n2 - His Birth and Family:\nOur translator (biographee) Al-Izz was born in the year seven hundred and forty-nine in the city of Yanbu, which is a city on the coast of the Red Sea on the side of the Arabian Peninsula (1).\nBiographical dictionaries paid great attention to the family of Al Jama'ah, because it is one of the large scientific families that produced many unique scholars who served the true religion. Their presence was not limited to a specific country over another; rather, we find them in Sham (Levant), Jerusalem, Mecca, and Cairo. Among them:",
    "foot_note": "1. See: \"Mu'jam al-Buldan\" (449/ 5).",
    "book_id": "681",
    "new_page_number": 6
  },
  {
    "serial_number": "5125952",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 8,
    "volume_number": 1,
    "text": "Are Hadith scholars, jurists, judges, and preachers (Khatibs). Some of them attained the rank of Sheikh of Sheikhs, and some combined all the mentioned ranks.\n\nHere are some notables of this family:\n1 - Chief Judge Badr al-Din Muhammad bin Ibrahim bin Sa'd Allah bin Jama'ah Al-Kinani, born in Hama, Shafi'i. He heard much, taught, issued fatwas, and authored. He combined judgeship and preaching in Jerusalem and the Umayyad Mosque, and the position of Sheikh of Sheikhs. Leadership ended up with him in his time, along with his piety, devoutness, and integrity. He died in the year (733 AH) (1).\n2 - Chief Judge Izz al-Din Abd al-Aziz bin Muhammad bin Ibrahim bin Sa'd Allah bin Jama'ah, Al-Kinani, born in Damascus, Egyptian, Shafi'i. He grew up in a house of knowledge and dignity. He heard and read much, and his sheikhs by hearing and authorization exceed one thousand three hundred. He sat for teaching at the age of fourteen. He narrated hadith, issued fatwas, and authored. He performed Hajj and stayed in Mecca (Mujawarah) frequently. He used to wish to die in one of the Two Holy Sanctuaries removed from judgeship, and he attained that, dying as a pilgrim in the year (767 AH) (2).\n3 - The Imam Sheikh Badr al-Din Ibrahim bin Muhammad bin Ibrahim bin Sa'd Allah bin Jama'ah, Al-Kinani, Shafi'i, judge of Egypt and Sham. He combined",
    "foot_note": "1. See: \"Al-Bidaya wa Al-Nihaya\" (163/ 14), \"Al-Durar Al-Kaminah\" (280/ 3 - 283), \"Shadharat Al-Dhahab\" (105/ 6). \n2. See: \"Tabaqat Al-Shafi'iyyah\" by Ibn Qadi Shuhbah (253/ 2), \"Al-Durar Al-Kaminah\" (378/ 2 - 382), and \"Al-Badr Al-Tali'\" (359/ 2).",
    "book_id": "681",
    "new_page_number": 7
  },
  {
    "serial_number": "5125953",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 9,
    "volume_number": 1,
    "text": "Leadership, preaching, and the position of Sheikh of Sheikhs. He assumed the preaching of Jerusalem after his father. He was the senior of the group of jurists, beloved by the people, and to him ended the leadership of scholars in his time. He taught, issued fatwas, and authored. He died in the year (790 AH) (1).\n\n3 - Some of his Sheikhs:\n1 - Ahmad bin Ali bin Abd al-Kafi Baha' al-Din Al-Subki (2).\n2 - Ahmad bin Muhammad Ala' al-Din Al-Sirami Al-Hanafi (3).\n3 - Abd al-Rahman bin Muhammad bin Muhammad, Al-Hadrami, Al-Maliki, author of \"Al-Muqaddimah\", famous as Ibn Khaldun (4).\n4 - Abd al-Aziz bin Muhammad bin Ibrahim bin Sa'd Allah bin Jama'ah, Izz al-Din, Chief Judge, his grandfather (5).\n5 - Abd al-Wahhab bin Ali bin Abd al-Kafi, Taj al-Din Al-Subki (6).\n6 - Umar bin Raslan bin Nusayr bin Salih bin Shihab bin Abd al-Khaliq bin Abd al-Haqq, Sheikh al-Islam, Siraj al-Din Al-Bulqini (7).",
    "foot_note": "1. See: \"Al-Durar Al-Kaminah\" (38/ 1), \"Tabaqat Al-Shafi'iyyah\" by Ibn Qadi Shuhbah (290/ 2), and \"Shadharat Al-Dhahab\" (105/ 3). \n2. \"Al-Durar Al-Kaminah\" (210/ 1). \n3. \"Al-Durar Al-Kaminah\" (307/ 1). \n4. \"Al-Badr Al-Tali'\" (337/ 1). \n5. \"Inba' Al-Ghamr\" (115/ 3). \n6. \"Al-Durar Al-Kaminah\" (425/ 2). \n7. \"Al-Badr Al-Tali'\" (506/ 1).",
    "book_id": "681",
    "new_page_number": 8
  },
  {
    "serial_number": "5125954",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 10,
    "volume_number": 1,
    "text": "7 - Muhammad bin Ishaq bin Ahmad Al-Ghaznawi, Siraj al-Din Al-Hindi, judge of the Hanafis (1).\n8 - Muhammad bin Khalil bin Muhammad, Shams al-Din, Al-'Aradi, Al-Shafi'i (2).\n9 - Muhammad bin Muhammad bin Abdullah bin Mahmoud, known as Jar Allah, judge of the Hanafis (3).\n\n4 - Some of his Students:\n1 - Ahmad bin Ali bin Muhammad bin Hajar Al-Asqalani, Al-Hafiz, the Egyptian (4).\n2 - Salih bin Umar bin Raslan, Alam al-Din, Al-Bulqini (5).\n3 - Abdullah bin Muhammad bin Tayman, Jamal al-Din, Al-Taymani, the Egyptian (6).\n4 - Ali bin Ahmad, Ala' al-Din Al-Qalqashandi (7).",
    "foot_note": "1. \"Inba' Al-Ghamr\" (27/ 1). \n2. \"Inba' Al-Ghamr\" (205/ 2). \n3. \"Inba' Al-Ghamr\" (229/ 1). \n4. \"Inba' Al-Ghamr\" (115/ 3). \n5. \"Al-Badr Al-Tali'\" (286/ 1). \n6. \"Tabaqat Al-Shafi'iyyah\" by Ibn Qadi Shuhbah (355/ 2). \n7. \"Al-Nujum Al-Zahirah\" (12/ 16).",
    "book_id": "681",
    "new_page_number": 9
  },
  {
    "serial_number": "5125955",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 11,
    "volume_number": 1,
    "text": "5 - Muhammad bin Al-Allamah Zadah Ahmad bin Muhammad, Al-Hanafi, famous as Ibn Mawlana Zadah (1).\n6 - Muhammad bin Ahmad bin Uthman bin Nu'aym Shams al-Din Al-Bisti Al-Maliki (2).\n7 - Muhammad bin Abi Bakr bin Ali bin Yusuf, Najm al-Din, Al-Marjani (3).\n8 - Muhammad bin Hasan bin Ali bin Uthman, Al-Nawaji, the poet (4).\n\n5 - His Upbringing:\nAmong the most important factors that helped build his scientific personality, after divine care, are the internal and external environments in which the author lived. The internal environment represented by the family, which has a great and effective role in building the personality of any individual. His upbringing - may Allah have mercy on him - in the care of a large scientific family had a great role in supporting and encouraging him, especially his grandfather, Chief Judge Al-Izz Abd al-Aziz bin Jama'ah. Then the external environment in which the author lived, represented by his era which was teeming with many scholars in various arts of knowledge, so that had...",
    "foot_note": "1. \"Al-Nujum Al-Zahirah\" (179/ 16). \n2. \"Al-Badr Al-Tali'\" (112/ 2). \n3. \"Tabaqat Al-Shafi'iyyah\" by Ibn Qadi Shuhbah (425/ 2). \n4. \"Al-Badr Al-Tali'\" (156/ 2).",
    "book_id": "681",
    "new_page_number": 10
  },
  {
    "serial_number": "5125956",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 12,
    "volume_number": 1,
    "text": "A great impact on building his personality and talent, creating an effective factor in his brilliance and advancement over his peers. Add to that the natural aptitude he enjoyed, along with what Allah Almighty endowed him with of care and success, without which guidance is not complete. So he desired knowledge and its acquisition, and the love of its people, after he tasted its sweetness, until he reached the high ambition he reached. He would not look at anything without wanting to stand on its origin and participate in it. May Allah Almighty have mercy on the ascetic Sheikh Muhammad bin al-Fadl al-Balkhi when he said: \"Whoever tastes the sweetness of knowledge cannot be patient from it\" (1).\nSo he grew up occupied with knowledge, and heard much from a group of senior scholars. He heard from Al-Qalanisi, Al-'Aradi, Al-Tabbani, his grandfather Abd al-Aziz, and others. He attended Al-Maydumi, and a group of Levantines and Egyptians granted him Ijazah through the care of Sheikh Zain al-Din Al-Iraqi. He studied jurisprudence with Sheikh Siraj al-Din Al-Bulqini.\nThen he inclined towards rational sciences, so he read under the scholars of logic in his time, such as Al-Sirami, Al-Izz Al-Razi, and Ibn Khaldun, until he mastered this science, and became pointed out with fingertips (famous), and students sought him from every direction, and he became a nation by himself in it.\nIn the later part of his life, he turned to looking into books of Hadith. He borrowed from Ibn al-Adim \"Takhrij Ahadith Al-Rafi'i Al-Kabir\" by Sheikh Ibn al-Mulaqqin, which is in seven volumes. He went through all of it, summarized it, and finished it...",
    "foot_note": "1. \"Tabaqat Al-Sufiyyah\" by Al-Sulami (215).",
    "book_id": "681",
    "new_page_number": 11
  },
  {
    "serial_number": "5125957",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 13,
    "volume_number": 1,
    "text": "At the death of Ibn al-Adim, then he did not stay long after that, so his last covenant with knowledge was the science of Hadith.\nHis student Al-Hafiz Ibn Hajar said (1): He did not marry as far as I knew, but he had his father's wife, so she used to manage his house affairs, and he was dutiful to her and kind to her. It did not happen that he performed Hajj, despite his companions' eagerness for him to do so. He was criticized for dressing in the Persian style with a long mustache and lack of Siwak (tooth stick), until his teeth fell out.\n\n6 - Scholars' Praise of Him:\nHe reached such high ambition that Al-Hafiz Ibn Hajar reports to us (2) saying: He inclined to rational sciences; so he mastered them, until he became a nation by himself, and all the students of the country remained dependent on him in that. He authored many widespread works, and for every book he taught - even though he almost taught all these summaries - he had a work, two works, or three, ranging from margin notes (Hashiyah), points (Nukat), and explanation (Sharh). He was the wonder of his age in good presentation.\nIbn Qadi Shuhbah mentioned (3): He was a sign among signs in knowing literary and rational sciences, and the two principles (Usul al-Fiqh and Usul al-Din). Most people of Egypt took from him.\nAl-Hafiz Ibn Hajar (4) also said: He was in sciences such that he is judged...",
    "foot_note": "1. \"Inba' Al-Ghamr\" (116/ 3). \n2. \"Inba' Al-Ghamr\" (115/ 3). \n3. \"Tabaqat Al-Shafi'iyyah\" (379/ 2). \n4. \"Inba' Al-Ghamr\" (116/ 3).",
    "book_id": "681",
    "new_page_number": 12
  },
  {
    "serial_number": "5125958",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 14,
    "volume_number": 1,
    "text": "In every art with comprehensiveness, this along with withdrawal from worldly people, and leaving exposure to positions. A market opened for him in the Muayyadi state, and the Sultan gifted him several times a sum of gold, yet he refrained from meeting him, and changed if that was offered to him.\nThen he said in \"Inba' al-Ghamr\" (116/3): He used to be kind to his companions, equal them in sitting, and exaggerate in honoring them.\nHe also mentioned: He used to maintain purity, so he never broke ritual purity without performing ablution. He would not let anyone backbite anyone in his presence. This is along with what he was upon of love for humor, joking, and appreciating anecdotes. I stuck to him from the year ninety until he died. He loved me greatly, testified to my precedence in my absence, and was extremely polite with me, despite my exaggeration in honoring him, such that I would not call him in his absence except: \"Imam of Imams\".\nThe verifier of the book \"Inba' al-Ghamr\" (1), Dr. Hassan Habashi, mentioned: That it was written on the margin of the original in the handwriting of Sheikh Ibrahim al-Biqa'i the following text: Sheikh Muhibb al-Din Muhammad bin Mawlana Zadah, famous as Ibn al-Aqsara'i, the Hanafi, the Sultan's Imam, told me - and Muhammad was one of those who stuck to Sheikh Izz al-Din greatly: That he saw a Takruri man named: Uthman Maghafa - with dotted Ghayn and Fa - who arrived in Cairo, and he had ten grown sons. He brought them to Sheikh Izz al-Din to benefit. He read a book to him, and when he explained a mas'ala (issue) to him and he understood it, he stood up and turned three times like a dancer, then bowed to the Sheikh in the form of...",
    "foot_note": "1. \"Hamish Inba' Al-Ghamr\" (116/ 3).",
    "book_id": "681",
    "new_page_number": 13
  },
  {
    "serial_number": "5125959",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 15,
    "volume_number": 1,
    "text": "The one bowing (Ruku'), and sat down. When he sat, his ten sons stood up after him and did exactly as he did.\n\n7 - His Works:\nThe majority of his scientific works that he authored were explanations, points, and summaries of books he taught to students. He enjoyed a keen mind and broad understanding, so you see him writing on a single book three works, ranging from margin notes, explanation, or points. He was the wonder of his age in good presentation, but he was not gifted with the faculty or happiness in good authorship. It appears: That he intended by them to remember what he wanted to deliver and present; therefore, there was between them (his writing and speaking) as between the earth and the Pleiades (huge difference). Rather, there was between his pen and his tongue as between him and individual students of his. He authored many works: religious, literary, technical, and other sciences prevalent in his era. They exceed two hundred works, varied in twenty arts. He collected them in a single volume, and most of them were lost at the hands of students, as reported by Al-Hafiz Ibn Hajar (1), Ibn Qadi Shuhbah (2), and Al-Sakhawi (3).\n\nHere is a list of some names of his works that I came across:\n1 - Forty Hadiths on Jihad, titled: \"Al-Imdad fi ma yata'allaq bi-l-Jihad\" (4).",
    "foot_note": "1. \"Inba' Al-Ghamr\" (116/ 3). \n2. \"Tabaqat Al-Shafi'iyyah\" (379/ 2). \n3. \"Wajiz Al-Kalam\" (442/ 2). \n4. Located within his collection that I have.",
    "book_id": "681",
    "new_page_number": 14
  },
  {
    "serial_number": "5125960",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 16,
    "volume_number": 1,
    "text": "2 - \"Al-Anwar fi Al-Tibb\" (Lights in Medicine) (1).\n3 - \"Al-Tabyin Sharh Al-Arba'in Al-Nawawiyyah\" (Clarification: Explanation of Nawawi's Forty) (2).\n4 - \"Tasnif fi Al-Rumh\" (A work on the Spear) (3).\n5 - \"Tasnif fi Al-Raml\" (A work on Sand Geomancy) (4).\n6 - \"Thalath Nukat 'ala Mukhtasar Ibn al-Hajib\" (Three Points on Ibn al-Hajib's Summary) (5).\n7 - \"Al-Jami' fi Al-Tibb\" (The Comprehensive in Medicine) (6).\n8 - \"Hashiyah 'ala Sharh Al-Alfiyyah\" by Ibn al-Musannif (Margin notes on the Explanation of Alfiyyah) (7).\n9 - \"Hashiyah 'ala Al-Tawdih\" (Margin notes on Al-Tawdih) (8).\n10 - \"Hashiyah 'ala Sharh Ibn al-Ibri 'ala Minhaj Al-Usul\" (Margin notes on Ibn al-Ibri's Explanation on Minhaj al-Usul) (9).\n11 - \"Hashiyah 'ala Al-Adud\" (Margin notes on Al-Adud) (10).",
    "foot_note": "1. \"Kashf Al-Zunun\" (196/ 1). \n2. \"Al-Badr Al-Tali'\" (148/ 2). \n3. \"Tabaqat Al-Shafi'iyyah\" by Ibn Qadi Shuhbah (379/ 2). \n4. \"Tabaqat Al-Shafi'iyyah\" by Ibn Qadi Shuhbah (379/ 2). \n5. \"Kashf Al-Zunun\" (1855/ 2). \n6. \"Al-A'lam\" (57/ 6). \n7. \"Kashf Al-Zunun\" (151/ 1). \n8. \"Kashf Al-Zunun\" (154/ 1). \n9. \"Kashf Al-Zunun\" (1879/ 2). \n10. \"Tabaqat Al-Shafi'iyyah\" by Ibn Qadi Shuhbah (379/ 2).",
    "book_id": "681",
    "new_page_number": 15
  },
  {
    "serial_number": "5125961",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 17,
    "volume_number": 1,
    "text": "12 - \"Hashiyah 'ala Sharh Al-Aqidah Al-Nasafiyyah\" by Al-Taftazani (Margin notes on the Explanation of Nasafi Creed) (1).\n13 - \"Hashiyah 'ala Mukhtasar Ibn al-Hajib\" (Margin notes on Ibn al-Hajib's Summary) (2).\n14 - \"Hashiyah 'ala Mukhtasar Al-Mutawwal\" by Al-Taftazani, titled: \"Sabk Al-Nadir fi Hawashi Al-Sharh Al-Saghir\" (3).\n15 - Margin notes on \"Matali' Al-Anwar\" by Al-Armawi, in Logic (4).\n16 - Margin notes on \"Al-Mutawwal\" by Al-Taftazani, titled: \"Al-Mu'awwal\" (5).\n17 - Margin notes on \"Minhaj Al-Usul\" by Al-Baydawi (6).\n18 - Explanation of \"Jam' Al-Jawami'\" (7).\n19 - \"Sharh Ulum Al-Hadith\" by Ibn al-Salah (Explanation of Hadith Sciences) (8).\n20 - \"Sharh Al-Qawa'id Al-Sughra\" by Ibn Hisham (Explanation of Minor Rules) (9).\n21 - \"Sharh Al-Qawa'id Al-Kubra\" by Ibn Hisham (Explanation of Major Rules).",
    "foot_note": "1. \"Kashf Al-Zunun\" (1147/ 2). \n2. \"Kashf Al-Zunun\" (1855/ 2). \n3. \"Inba' Al-Ghamr\" (116/ 3). \n4. \"Kashf Al-Zunun\" (1715/ 2). \n5. \"Inba' Al-Ghamr\" (115/ 3). \n6. \"Kashf Al-Zunun\" (1879/ 2). \n7. \"Tabaqat Al-Shafi'iyyah\" by Ibn Qadi Shuhbah (379/ 2). \n8. \"Al-Badr Al-Tali'\" (148/ 2). \n9. \"Al-Badr Al-Tali'\" (148/ 2), and \"Sharh Al-Qawa'id Al-Kubra\" likewise.",
    "book_id": "681",
    "new_page_number": 16
  },
  {
    "serial_number": "5125962",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 18,
    "volume_number": 1,
    "text": "22 - \"Al-Safwa fi Al-Tasawwuf\" (The Elite in Sufism) (1).\n23 - \"Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar, may Allah bless him and grant him peace\" (2), which is in your hands.\n24 - \"Al-Muthallath fi Al-Lugha\" (The Triangular in Language) (3).\n25 - \"Lum'at Al-Anwar fi Al-Tashrih\" (Gleam of Lights in Anatomy) (4).\n26 - \"Mukhtasar Takhrij Ahadith Al-Rafi'i Al-Kabir\" by Ibn al-Mulaqqin, which is his last book (5).\n27 - \"Al-Manhaj Al-Sawi Sharh Al-Manhal Al-Rawi\" (6) by his grandfather.\n\n8 - His Death:\nIn the year (819), the plague epidemic befell people in Cairo. He - may Allah have mercy on him - used to forbid his companions from entering public baths during plague days. When the epidemic was about to lift from people, he entered the bath, came out, and was stricken shortly after. He died on the twentieth of the month of Rabi' al-Akhir of the same year. People's sorrow for him intensified, and he left no one like him behind.\nHe concluded - may Allah have mercy on him - with two things, we ask Allah - Blessed and Exalted - that it be a good ending:",
    "foot_note": "1. \"Kashf Al-Zunun\" (1080/ 2), and I have a copy of it within a collection of his. \n2. \"Al-A'lam\" (57/ 6), and it occupies the forefront in the collection I have. \n3. \"Kashf Al-Zunun\" (1587/ 2). \n4. \"Al-A'lam\" (57/ 6). \n5. \"Inba' Al-Ghamr\" (116/ 3). \n6. \"Al-Badr Al-Tali'\" (148/ 2).",
    "book_id": "681",
    "new_page_number": 17
  },
  {
    "serial_number": "5125963",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 19,
    "volume_number": 1,
    "text": "First: His last contact with knowledge (1) was with the Hadiths of the Prophet, peace and blessings be upon him. We ask Allah - Blessed and Exalted - to resurrect us and him in the company of the people of Hadith, and make us among those arriving at the Basin of the Prophet, peace and blessings be upon him.\nSecond: His dying of the plague, and the Prophet, peace and blessings be upon him, says: \"Plague is martyrdom for every Muslim\" (2).\n***",
    "foot_note": "1. See: Page number (14). \n2. Narrated by Muslim (1522/ 3).",
    "book_id": "681",
    "new_page_number": 18
  },
  {
    "serial_number": "5125964",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 20,
    "volume_number": 1,
    "text": "Study of the Book\n\n1 - Description of the Adopted Copy\nI relied in verifying the book on a photocopy of the manuscript which exists within a collection containing three of his books: \"Mukhtasar Al-Sirah\" (Summary of Biography) - which is this book of ours, \"Al-Safwa fi Al-Tasawwuf\", and \"Forty Hadiths on Jihad\". I have viewed the manuscript myself, and its handwriting is good and legible. The name of the book is confirmed at its beginning. It falls in (10) leaves, written in clear Naskh script, ruled, each page of it: (19) lines. It has an ownership statement like this: Al-Hajj Sidi, and stamped with his seal as you see in the picture of sample leaves of the manuscript. After scrutinizing his seal; it contains his father's name, so it is: Sidi bin Hasan Al-Sa'di. Its editing was on Friday the third of the month of Shawwal Al-Mukarram year (975 AH) in Aleppo.\nThe name of the owner of the copy from which this copy was transferred, as he wrote on it: Suspended it for himself, and for whom he wills after him, trusting in the Eternal One, Ubaydullah: Umar bin Ahmad bin Khalifa, Al-Halabi, Al-Sa'di. It is predominantly...",
    "foot_note": "None",
    "book_id": "681",
    "new_page_number": 19
  },
  {
    "serial_number": "5125965",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 21,
    "volume_number": 1,
    "text": "Thought: That he transferred it from the author's copy, due to the proximity of time between its writing and the author's death, or at least it was transferred from a copy compared against the author's copy.\n\n2 - Proving the Validity of Attribution of the Book:\nFor the purpose of proving the attribution of the book to the author, here is the following:\nThe name of the book was written on the cover of the original: \"Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar\" authored by the Scholar Allama Izz al-Din Muhammad Ibn Jama'ah.\nAl-Zirikli mentioned in \"Al-A'lam\" (57/ 6) in the author's biography among his works: A summary in Prophetic Biography.\nThe existence of the book within a collection containing the book: \"Al-Safwa fi Al-Tasawwuf\" which the author of \"Kashf Al-Zunun\" (1855/ 2) confirmed its attribution to him.\nFrom the foregoing, I can confirm the attribution of the book to him, and Allah knows best.\n\n3 - My Work on the Book:\nAfter viewing the manuscript collection (1), I made a photocopy of it, then did the following:",
    "foot_note": "1. I was shown it by the virtuous brother Muhammad bin Abd al-Jalil al-Baghdadi, may Allah thank his effort. I say: This virtuous brother passed away in the sinful treacherous explosion that occurred in Al-Mutanabbi Street in Baghdad, in late March of the year 2007 AD, which claimed the lives of more than a hundred booksellers, and dozens of libraries were burned in it, -",
    "book_id": "681",
    "new_page_number": 20
  },
  {
    "serial_number": "5125966",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 22,
    "volume_number": 1,
    "text": "1 - I transcribed the book by hand, then compared it with the original.\n2 - I compared the book with major books of Seerah, and what I found of the book's sources, and commented on some places in the book.\n3 - I documented the Hadiths and Athar in the book.\n4 - I mentioned the manuscript page number at the beginning and end of the leaf.\n5 - I made a comprehensive biography for the author.\nI pray to Allah - Mighty and Majestic - to make all my work sincere for His Noble Face, and to guide us to follow the biography of our Noble Prophet, peace and blessings be upon him, and benefit Muslims with this effort. May Allah bless and grant peace to our Prophet Muhammad, and his family and companions all together.\n***",
    "foot_note": "1. -And Allah is the Helper. I knew in this brother truthfulness of dealing, and good performance, not to mention his distinctive expertise in manuscripts and rare publications. So may Allah have wide mercy on him, forgive him, and I ask every reader of this book to pray for mercy and forgiveness for him. (Nur al-Din Talib).",
    "book_id": "681",
    "new_page_number": 21
  },
  {
    "serial_number": "5125967",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 23,
    "volume_number": 1,
    "text": "Images of Manuscripts",
    "foot_note": "None",
    "book_id": "681",
    "new_page_number": 22
  },
  {
    "serial_number": "5125968",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 25,
    "volume_number": 1,
    "text": "Image of the cover of the original copy, showing the name of the book",
    "foot_note": "None",
    "book_id": "681",
    "new_page_number": 23
  },
  {
    "serial_number": "5125969",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 26,
    "volume_number": 1,
    "text": "Image of the first leaf of the manuscript",
    "foot_note": "None",
    "book_id": "681",
    "new_page_number": 24
  },
  {
    "serial_number": "5125970",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 27,
    "volume_number": 1,
    "text": "Image of the last leaf of the manuscript",
    "foot_note": "None",
    "book_id": "681",
    "new_page_number": 25
  },
  {
    "serial_number": "5125971",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 29,
    "volume_number": 1,
    "text": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar, may Allah bless him and grant him peace\nAuthored by Sheikh Imam Allama Izz al-Din Muhammad bin Jama'ah Died year / 819 AH\nVerification and Commentary Adnan Abu Zaid",
    "foot_note": "None",
    "book_id": "681",
    "new_page_number": 26
  },
  {
    "serial_number": "5125972",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 31,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\nThe Sheikh, the Imam, the Allama, Mufti of Muslims, Unique of working scholars Muhammad bin Jama'ah (1) - may Allah be kind to him in this world and the Hereafter - said after praising Allah, and sending blessings upon His Messenger Muhammad and upon his family and companions and peace:\nThis is a small-sized book, precious in knowledge, containing important aspects of the biography of our master Muhammad, may Allah bless him and grant him peace, and I named it Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar.\nUpon the Generous Allah is my reliance, and to Him is my delegation and support, and He is my Sufficiency and best Disposer of affairs.",
    "foot_note": "1. See his biography in the following sources: \"Inba' Al-Ghamr\" by Ibn Hajar (115/ 3 - 117), \"Tabaqat Al-Shafi'iyyah\" by Ibn Qadi Shuhbah (378/ 2 - 380), \"Al-Daw' Al-Lami'\" by Al-Sakhawi (171/ 7 - 174), \"Wajiz Al-Kalam\" by Al-Sakhawi (441/ 2 - 442), \"Bughyat Al-Wu'ah\": (25 - 27), \"Husn Al-Muhadarah\" (317/ 1), \"Shadharat Al-Dhahab\" (139/ 4), \"Al-Badr Al-Tali'\" (171/ 2 - 174), \"Al-A'lam\" (5657), and \"Mu'jam Al-Mu'allifin\" (111/ 9).",
    "book_id": "681",
    "new_page_number": 27
  },
  {
    "serial_number": "5125973",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 32,
    "volume_number": 1,
    "text": "1 - 2 - His Lineage, may Allah bless him and grant him peace, and His Names\nHe is Abu al-Qasim Muhammad (1) bin Abdullah bin Abd al-Muttalib (2) bin Hashim (3) bin Abd Manaf (4) bin [Qusayy (5) bin Kilab] (6) bin Murrah bin Ka'b bin Lu'ayy bin Ghalib bin Fihr bin Malik bin An-Nadr bin Kinanah bin Khuzaymah bin Mudrikah (7) bin Ilyas [bin Mudar bin Nizar] bin Ma'ad bin Adnan, this is what is agreed upon (8).",
    "foot_note": "1. I saw fit to establish here the meaning of his name, peace and blessings be upon him, and the virtues it included as mentioned by Ibn al-Qayyim in \"Zad al-Ma'ad\" (89/ 1), he said: \"It is a passive participle from Hammada (praised much), so he is Muhammad: if he has many qualities for which he is praised. Therefore, it was more eloquent than Mahmoud; for Mahmoud is from the triliteral simple verb, and Muhammad is from the doubled verb; for exaggeration, so he is the one who is praised more than others among humans are praised; and for this reason - and Allah knows best - he was named so in the Torah; due to the many praiseworthy qualities by which he, his religion, and his nation were described in the Torah, until Moses - peace be upon him - wished to be among them\". \n2. Abd al-Muttalib is a nickname for him, and his name is: Shaybah. \n3. And his name is: Amr. \n4. And his name is: Al-Mughira. \n5. And his name is: Zaid. \n6. What is between brackets was missed, perhaps a slip of the pen from the copyist. \n7. And his name is: Amir. \n8. Up to here is known authenticity agreed upon among genealogists, and there is absolutely no disagreement about it, and what is above Adnan is disputed, and there is no disagreement among them that Adnan is from the children of Ishmael - peace be upon him. Said by Ibn al-Qayyim in \"Zad al-Ma'ad\" (71/ 1).",
    "book_id": "681",
    "new_page_number": 28
  },
  {
    "serial_number": "5125974",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 33,
    "volume_number": 1,
    "text": "And among his names, may Allah bless him and grant him peace (1):\n1 - Ahmad.\n2 - And Al-Mahi.\n3 - And Al-Hashir.\n4 - And Al-'Aqib.\n5 - And Al-Munaqqi (2).\n6 - And Prophet of Repentance.\n7 - And Prophet of Mercy.\n8 - And Prophet of Al-Malhamah (Battles).\n9 - And Al-Fatih.\n10 - And Abdullah.\n11 - And Al-Mubashir.",
    "foot_note": "1. And in \"Sahih Muslim\" (1828/ 4): That the Messenger of Allah, peace and blessings be upon him, said: \"Indeed I have names, I am: Muhammad, and I am Ahmad, and I am Al-Mahi by whom Allah erases disbelief, and I am Al-Hashir at whose feet people are gathered, and I am Al-'Aqib after whom there is no one\", and Allah named him Ra'uf (Kind) Rahim (Merciful). Also in the same volume and page: From Abu Musa Al-Ash'ari, he said: Then the Messenger of Allah, peace and blessings be upon him, used to name himself names for us; he said: \"I am Muhammad, Ahmad, Al-Muqaffi, Al-Hashir, Prophet of Repentance, and Prophet of Mercy\". \n2. Thus in the original, and I did not find it in the sources I have that listed his names, and perhaps it is: (Al-Muqaffi), which is mentioned by them among his names, peace and blessings be upon him.",
    "book_id": "681",
    "new_page_number": 29
  },
  {
    "serial_number": "5125975",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 34,
    "volume_number": 1,
    "text": "12 - And Al-Nadhir.\n13 - And Al-Amin.\n14 - And Mustafa.\n15 - And Al-Mutawakkil.\n16 - And Ta-Ha.\n17 - And Ya-Sin (1).\nNotice: Ibn Dihya [said] (2): If investigated, they reach three hundred.\n\n3 - His Mother, peace and blessings be upon him:\nAmina bint Wahb bin Abd Manaf bin Zuhrah bin Kilab.\nHis father died (3) while he was a fetus - according to the correct view (4) - two months before his birth,",
    "foot_note": "1. Al-Dhahabi said in the Prophetic Biography from \"Tarikh al-Islam\" (31): \"And Waki' said from Ismail, from Ibn Umar, from Ibn al-Hanafiyyah, he said: Ya-Sin: Muhammad, peace and blessings be upon him. And from some of them, he said: The Messenger of Allah, peace and blessings be upon him, has five names in the Quran: Muhammad, Abdullah, Ya-Sin, and Ta-Ha\". \n2. He is: Umar bin Al-Hasan bin Ali bin Muhammad bin Faraj bin Khalaf bin Dihya Al-Kalbi, Al-Andalusi, Al-Zahiri, Hadith scholar Hafiz, traveler, settled in Bejaia, author of the book \"Nihayat al-Sul fi Khasais al-Rasul, peace and blessings be upon him\". See: \"Wafayat al-A'yan\" (482/ 1), \"Al-Siyar\" (217/ 13), and \"Shadharat al-Dhahab\" (16/ 5). \n3. He died in Medina at his maternal uncles Banu al-Najjar, he had passed by them while on a trade trip, fell ill, stayed with them for a month, then died, and was buried in the house of one of Banu al-Najjar. See: \"Tabaqat Ibn Sa'd\" (99/ 1). \n4. This is Ibn Ishaq's opinion, see: \"Al-Sirah Al-Nabawiyyah\" by Ibn Hisham (167/ 1).",
    "book_id": "681",
    "new_page_number": 30
  },
  {
    "serial_number": "5125976",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 35,
    "volume_number": 1,
    "text": "And it was said: While he was two months old (1), and it was said: Seven, and it was said: Twenty-eight months (2), and it was said: Thirty.\n\n4 - Duration of His Gestation, peace and blessings be upon him:\nIt was said: Ten, and it was said: Nine, and it was said: Eight, and it was said: Seven, and it was said: Six.\n\n5 - His Birth, peace and blessings be upon him:\nThe famous opinion: That it was the Year of the Elephant (3) in Mecca in Rabi' al-Awwal on a Monday. And the correct view: On the tenth (4) passed of it when dawn broke. And it was said: The second. And it was said: The third. And it was said: The eighth. And it was said: The twelfth (5).",
    "foot_note": "1. Ibn Sayyid al-Nas mentioned it in his \"Sirah\" (38/ 1) quoting Ibn Abi Khaythamah. \n2. Written in the original: Year (Sana), which is a clear mistake, and Allah knows best. \n3. Khalifa bin Khayyat said in his \"Tarikh\" (53): \"The consensus is that he was born in the Year of the Elephant\". \n4. Al-Dhahabi transmitted that in the Sirah from his \"Tarikh\" (27), quoting his Sheikh Al-Dimyati. \n5. Which is Ibn Ishaq's opinion, as transmitted by Ibn Hisham in \"Al-Sirah\" (167/ 1).",
    "book_id": "681",
    "new_page_number": 31
  },
  {
    "serial_number": "5125977",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 36,
    "volume_number": 1,
    "text": "And it was said: The twelfth of Ramadan (1). And it was said: In Rabi' al-Akhir.\n\n6 - [His Attributes, peace and blessings be upon him]:\nNotice: He was born circumcised (2), with cut umbilical cord (Masrur) (3).\n- From Ka'b al-Ahbar (4): Adam was created circumcised, and thirteen prophets from his children",
    "foot_note": "1. Al-Dhahabi transmitted that in the Prophetic Biography from \"Tarikh al-Islam\" (25), and deemed it weak. \n2. Ibn al-Qayyim said in \"Zad al-Ma'ad\" (81/ 1): \"There was disagreement about it on three opinions: First: That he was born circumcised with cut umbilical cord, and a hadith was narrated regarding that which is not authentic, mentioned by Abu al-Faraj ibn al-Jawzi in \"Al-Mawdu'at\", and there is no confirmed hadith about it, and this is not one of his specific characteristics, for many people are born circumcised\". Then he said: \"Second opinion: That he was circumcised on the day angels split his heart at his wet nurse Halima. Third opinion: That his grandfather Abd al-Muttalib circumcised him on his seventh day, made a banquet for him, and named him: Muhammad\". \n3. Ibn Sa'd mentioned that (103/ 1), from Ibn Abbas from his father - may Allah be pleased with them both. Al-Dhahabi said in \"Al-Sirah Al-Nabawiyyah\" (27): \"From Ibn Abbas - may Allah be pleased with them both: That Abd al-Muttalib circumcised the Prophet, peace and blessings be upon him, on his seventh day, made a banquet for him, and named him Muhammad; and this is the more correct of the two. Narrated by Ibn Sa'd, and he mentioned Ibn Sa'd's chain to Ibn Abbas from his father Al-Abbas - may Allah be pleased with them both, who said: The Prophet, peace and blessings be upon him, was born circumcised with cut umbilical cord\". Also, Ibn Kathir transmitted in \"Al-Sirah Al-Nabawiyyah\" (209/ 1) the reports narrated regarding that, and said afterwards: \"Some have claimed its authenticity; because of the paths narrated for it, until some claimed it is Mutawattir, and there is question in all this, and the meaning of Makhtunan: i.e., with cut foreskin, and Masruran: i.e., with umbilical cord cut from his mother's womb\". \n4. Al-Salihi mentioned that in \"Subul al-Huda wa al-Rashad fi Sirat Khayr al-Ibad\" (348/ 1), quoting Ibn Duraid in \"Al-Wishah\", and Ibn al-Jawzi in \"Al-Talqih\".",
    "book_id": "681",
    "new_page_number": 32
  },
  {
    "serial_number": "5125978",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 37,
    "volume_number": 1,
    "text": "Were created circumcised: Muhammad, Seth, Idris, Noah, Shem, Lot, Joseph, Moses, Solomon, Shu'ayb, John, Hud, and Salih.\n- And it was said: Abd al-Muttalib circumcised him on his seventh day, made a banquet for him, and named him: Muhammad (1).\n- And it was said: Gabriel circumcised him when he purified his heart (2).\nThe [Iwan] (3) of Kisra cracked on the night of his birth, and fourteen balconies fell from it, and the fire of Persia died out, having not died out for a thousand years before, and Lake Sawa sank (4). Iblis used to penetrate the heavens; when Jesus was born, he was veiled from three; and when Muhammad, peace and blessings be upon him, was born, he was veiled from all (5).\n\n7 - [His Suckling, peace and blessings be upon him]:\nThuwaybah Al-Aslamiyyah (6), the freed slave of Abu Lahab, suckled him for days with the milk of her son Masruh, and there is disagreement regarding her Islam.",
    "foot_note": "1. This is the correct view, and the Sunnah proceeded with it for every newborn. \n2. Al-Dhahabi said in \"Al-Sirah Al-Nabawiyyah\" (28): \"My Sheikh Al-Dimyati said: And it is narrated from Abu Bakra who said: Gabriel circumcised the Messenger of Allah, peace and blessings be upon him, when he purified his heart, then he said afterwards, I say: This is Munkar (rejected)\". \n3. Fell from the original. \n4. See \"Tarikh al-Tabari\" (166/ 1), and \"Tarikh Dimashq\" by Ibn Asakir (361/ 37). \n5. See: \"Sirat Ibn Hisham\" (217/ 1), and \"Subul al-Huda wa al-Rashad\" (350/ 1). \n6. She is the first who suckled the Messenger of Allah, peace and blessings be upon him, with the milk of a son of hers, called: Masruh, for days before Halima arrived. She had suckled Hamza bin Abd al-Muttalib before him, and suckled-",
    "book_id": "681",
    "new_page_number": 33
  },
  {
    "serial_number": "5125979",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 38,
    "volume_number": 1,
    "text": "Then Umm Kabsha: Halima Al-Sa'diyyah (1) suckled him.\n&",
    "foot_note": "1. = after him Abu Salamah bin Abd al-Asad al-Makhzumi. See: \"Tabaqat Ibn Sa'd\" (108/ 1), and Al-Sirah from \"Tarikh al-Islam\" by Al-Dhahabi (45). \n1. There is disagreement regarding her Islam. Ibn al-Qayyim said in \"Zad al-Ma'ad\" (83/ 1): \"And she suckled with him his cousin Abu Sufyan bin al-Harith bin Abd al-Muttalib, who was intensely hostile to the Messenger of Allah, peace and blessings be upon him, then embraced Islam in the Year of Conquest, and his Islam was good. Hamza was with him being suckled in Banu Sa'd bin Bakr, so his mother suckled the Messenger of Allah, peace and blessings be upon him, one day, while he was with his mother Halima, so Hamza was the foster brother of the Messenger of Allah, peace and blessings be upon him, from two sides: from the side of Thuwaybah, and from the side of Al-Sa'diyyah\". Halima bint Abi Dhu'ayb Al-Sa'diyyah, the mother of the Messenger of Allah, peace and blessings be upon him, who suckled him, narrated: That she went out from her country with her husband and a small son of hers she was suckling among women from Banu Sa'd bin Bakr, seeking infants to suckle. She said: That was in a year of drought that left us nothing. She said: I went out on a grey she-donkey of mine, with us was an old she-camel of ours, by Allah it did not yield a drop. We did not sleep all our night because of our boy who was with us crying from hunger; there was nothing in my breasts to satisfy him, nor in our old she-camel what would feed him. Ibn Hisham said: It is said: 'yughadhihi' (feeds him). But we were hoping for rain and relief; so I went out on that she-donkey of mine, and indeed it lagged behind the caravan, until that was hard on them due to weakness and emaciation, until we arrived in Mecca seeking infants to suckle. Not a woman of us but the Messenger of Allah, peace and blessings be upon him, was offered to her and she refused him, when it was said to her: He is an orphan. That is because we only hoped for kindness from the boy's father, so we said: An orphan! What can his mother and grandfather do! So we disliked him for that. No woman remained who came with me but she took an infant other than me. When we agreed to depart, I said to my husband: By Allah! I hate to return among my companions without taking an infant. By Allah! I will go to that orphan and take him. He said: No harm if you do, perhaps Allah will place blessing in him for us. She said: So I went to him and took him, and nothing carried me to take him except that I found no other. She said: When I took him, I returned with him to my saddle. When I put him in my lap, my breasts accepted him with whatever he wished-",
    "book_id": "681",
    "new_page_number": 34
  },
  {
    "serial_number": "5125980",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 39,
    "volume_number": 1,
    "text": "8 - [His Upbringing (Hadanah), peace and blessings be upon him]:\nUmm Ayman: Barakah Al-Habashiyyah brought him up, and he had inherited her from his father. After a while, he freed her and married her to Zayd bin Haritha his freed slave (1).\n\n9 - [His Guardianship (Kafalah), peace and blessings be upon him]:\nHis grandfather Abd al-Muttalib took care of him, and he died when he reached eight years (2),",
    "foot_note": "1. = of milk, so he drank until satisfied, and his brother drank with him until satisfied, then they slept, and we used not to sleep with him before that. My husband went to that old she-camel of ours, and behold it was full of milk. He milked from it what he drank, and I drank with him until we ended quenched and full, so we spent the best night. She said: My husband said when we woke up: Know, by Allah, O Halima! You have taken a blessed soul. Al-Dhahabi said in \"Al-Sirah\" (45): \"She took him, peace and blessings be upon him, with her to her land, and he stayed with her in Banu Sa'd for about four years, then she returned him to his mother\". I say: And the incident of splitting his honorable chest occurred to him, peace and blessings be upon him, while he was with Halima Al-Sa'diyyah; Muslim narrated from the hadith of Anas - may Allah be pleased with him: \"That the Messenger of Allah, peace and blessings be upon him, Gabriel came to him while he was playing with boys; he took him and laid him down, split his heart, extracted the heart, extracted a clot from it, and said: This is Satan's share of you. Then he washed it in a gold basin with Zamzam water, then joined it, then returned it to its place. The boys came running to his mother - meaning: his wet nurse -, and said: Muhammad has been killed; so they received him while he was pale in color. Anas said: I used to see the trace of that stitching in his chest\". His honorable chest was split a second time before he was taken on the Night Journey, peace and blessings be upon him. \n1. So she bore him Usama - may Allah be pleased with them all. \n2. Sirat Ibn Hisham (178).",
    "book_id": "681",
    "new_page_number": 35
  },
  {
    "serial_number": "5125981",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 40,
    "volume_number": 1,
    "text": "And he entrusted him to Abu Talib (1).\n\n10 - [His Upbringing and Life Before Mission, peace and blessings be upon him]:\nWhen he reached twelve years, two months and ten days, and it was said: nine years, he went out with Abu Talib to Sham (Levant), until he reached Busra; Bahira saw him; and recognized him by his description (2). Then he went out a second time with Maysara (3); when he arrived in Sham, Nastura saw him (4), and informed of his prophethood. When he returned, he married Khadija bint Khuwaylid - may Allah be pleased with her. Her father married her to him, which is Ibn Ishaq's opinion (5), and it was said: her uncle, which is Al-Waqidi's choice (6), and it was said: her brother.",
    "foot_note": "1. See: \"Tabaqat Ibn Sa'd\" (118/ 1 - 119), and \"Sirat Ibn Hisham\" (189/ 1). \n2. See: \"Tabaqat Ibn Sa'd\" (121/ 1), \"Sirat Ibn Hisham\" (191/ 1 - 194), and \"Uyun al-Athar\" (41/ 1). \n3. Maysara: Khadija's servant mentioned in the Biography. He was the companion of the Prophet, peace and blessings be upon him, in Khadija's trade before he married her, and narrated some proofs of his prophethood. Al-Hafiz listed him in \"Al-Isabah\" as a possibility (240/ 6). \n4. This was during his exit, peace and blessings be upon him, in Khadija's trade - may Allah be pleased with her. See: \"Tabaqat Ibn Sa'd\" (129/ 1 - 131), and \"Uyun al-Athar\" (70/ 1). \n5. See \"Al-Sirah Al-Nabawiyyah\" by Ibn Hisham (201/ 1), and Ibn Hisham said: \"When the Messenger of Allah, peace and blessings be upon him, reached twenty-five years, he married Khadija\". \n6. As his student Ibn Sa'd transmitted from him in his \"Tabaqat\" (133/ 1).",
    "book_id": "681",
    "new_page_number": 36
  },
  {
    "serial_number": "5125982",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 41,
    "volume_number": 1,
    "text": "When he reached thirty-five years, he witnessed the building of the Kaaba, and Quraysh were pleased with his judgment, and he placed the Stone with his hand (1).\n\n11 - [His Prophethood, peace and blessings be upon him]:\nAllah sent him to mankind entirely while his age was forty years (2), and it was said: and ten days, and it was said: and two months, and it was said: forty-three years. The people of Mecca besieged him in the Shi'b (ravine); he stayed less than three [years], and came out of the siege while he was forty-nine years old. Eight months and eleven days after that, Abu Talib died (3). When he reached fifty-two years - according to the famous view - he was taken on the Night Journey (Isra'), and ascended (Mi'raj), and the five prayers were obligated upon him and his nation.\n\n12 - [His Migration, peace and blessings be upon him]:\nHe migrated from Mecca to Medina while he was fifty-three years old, and it was said: five, and it was said: fifty, on Monday of Rabi' al-Awwal, and it was said: it was in Safar. He entered Medina (4) on Monday, twelve nights having passed... . . . . . . .",
    "foot_note": "1. See \"Sirat Ibn Hisham\" (204/ 1 - 211), \"Tabaqat Ibn Sa'd\" (145/ 1), and \"Tarikh al-Tabari\" (523/ 1 - 526). \n2. Narrated by Al-Bukhari from Ibn Abbas - may Allah be pleased with him - in his \"Sahih\" (1398/ 3), and Ibn Sa'd from Anas - may Allah be pleased with him - in his \"Tabaqat\" (190/ 1). \n3. Then after him, the Mother of Believers Khadija - may Allah be pleased with her - died. \n4. Al-Bukhari said in his \"Sahih\" (1421/ 3): \"Ibn Shihab said: So informed me-",
    "book_id": "681",
    "new_page_number": 37
  },
  {
    "serial_number": "5125983",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 42,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "foot_note": "1. = Urwa bin al-Zubayr, then the Messenger of Allah, peace and blessings be upon him, met Al-Zubayr in a caravan of Muslims who were merchants returning from Sham. Al-Zubayr clothed the Messenger of Allah, peace and blessings be upon him, and Abu Bakr in white clothes. The Muslims in Medina heard of the departure of the Messenger of Allah, peace and blessings be upon him, from Mecca. They used to go out every morning to the Harrah (volcanic field) waiting for him until the midday heat turned them back. One day they returned after waiting long; when they reached their houses, a man from the Jews climbed one of their forts for something he was looking at; he saw the Messenger of Allah, peace and blessings be upon him, and his companions dressed in white, the mirage disappearing by them. The Jew could not help but shout at the top of his voice: O assembly of Arabs! This is your luck/grandfather whom you wait for. The Muslims rushed to weapons; they met the Messenger of Allah, peace and blessings be upon him, at the back of the Harrah. He turned with them to the right until he camped with them in Banu Amr bin Auf. That was on Monday of the month of Rabi' al-Awwal. Abu Bakr stood for the people, and the Messenger of Allah, peace and blessings be upon him, sat silent. Those of the Ansar who came and had not seen the Messenger of Allah, peace and blessings be upon him, began greeting Abu Bakr, until the sun hit the Messenger of Allah, peace and blessings be upon him. Abu Bakr came and shaded him with his cloak. So the people recognized the Messenger of Allah, peace and blessings be upon him, from that. The Messenger of Allah, peace and blessings be upon him, stayed in Banu Amr bin Auf for ten-odd nights, and established the mosque that was founded on piety, and the Messenger of Allah, peace and blessings be upon him, prayed in it. Then he rode his mount, and proceeded with people walking with him, until it kneeled at the mosque of the Messenger of Allah, peace and blessings be upon him, in Medina, where some Muslim men were praying that day. It was a place for drying dates belonging to Suhayl and Sahl, two orphan boys under the care of As'ad bin Zurarah. The Messenger of Allah, peace and blessings be upon him, said when his mount kneeled with him: \"This, if Allah wills, is the place.\" Then the Messenger of Allah, peace and blessings be upon him, called the two boys and bargained with them for the drying place to take it as a mosque. They said: No, rather we gift it to you, O Messenger of Allah. The Messenger of Allah, peace and blessings be upon him, refused to accept it from them as a gift until he bought it from them. Then he built it as a mosque. The Messenger of Allah, peace and blessings be upon him, started moving bricks with them in its building, saying while moving bricks: \"This load is not the load of Khaybar, this is more righteous to our Lord and purer\", and saying: \"O Allah, indeed the reward is the reward of the Hereafter, so have mercy on the Ansar and the Muhajirah.\" He quoted poetry of a Muslim man",
    "book_id": "681",
    "new_page_number": 38
  },
  {
    "serial_number": "5125984",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 43,
    "volume_number": 1,
    "text": "Of it (1), which is Al-Dimyati's choice (2). And it was said: on the eighth. And it was said: Friday. And it was said: at its beginning. So he stayed there ten years; by agreement.\n***",
    "foot_note": "1. = unnamed to me. Ibn Shihab said: We have not been informed in the Hadiths that the Messenger of Allah, peace and blessings be upon him, quoted a verse of poetry [other than] this verse\". Al-Bukhari narrated it as you see suspended in a decisive form from Al-Zuhri. Ibn Hisham said in \"Al-Sirah\" (240/ 2): \"Ziyad bin Abdullah Al-Bakka'i told us, from Muhammad bin Ishaq Al-Muttalibi, he said: The Messenger of Allah, peace and blessings be upon him, arrived in Medina on Monday when the forenoon heat intensified, and the sun almost reached its zenith, on the twelfth night passed of the month of Rabi' al-Awwal, and this is the date, as Ibn Hisham said. Ibn Ishaq said: And the Messenger of Allah, peace and blessings be upon him, was on that day fifty-three years old, and that was after Allah - Mighty and Majestic - sent him by thirteen years\". \n1. i.e., Rabi' al-Awwal. \n2. He is Abd al-Mu'min bin Khalaf bin Abi al-Hasan bin Sharaf bin al-Khadr bin Musa al-Dimyati, Sharaf al-Din, Abu Muhammad, the Muhaddith, the Jurist, the Genealogist. Born in Damietta year 613. He heard in Alexandria, Cairo, the Two Holy Sanctuaries, and Iraq. He adhered to Al-Mundhiri, and Al-Mizzi, Ibn Sayyid al-Nas, Al-Dhahabi, and others heard from him. He authored much. Among his works: \"Al-Sirah Al-Nabawiyyah\" from which his students: Al-Dhahabi and Ibn Sayyid al-Nas quote in their \"Sirahs\". He died in Cairo year 705 AH. See: \"Tabaqat Al-Shafi'iyyah\" by Ibn Qadi Shuhbah (75/ 2), \"Al-Durar Al-Kaminah\" (417/ 2), \"Shadharat Al-Dhahab\" (12/ 6), \"Mu'jam Al-Mu'allifin\" (197/ 6).",
    "book_id": "681",
    "new_page_number": 39
  },
  {
    "serial_number": "5125985",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 44,
    "volume_number": 1,
    "text": "What Occurred In It of Wars and Some Events\n\n13 - [Events] in the First Year (1):\n1 - Ghazwah of Al-Abwa' (2): It is a Ghazwah, and it was in Safar.\n2 - In it the prayer of residence was made four Rak'ahs, a month after his arrival.\n3 - Abdullah bin Zaid bin Abd Rabbih was shown the Adhan in it (3), so he ordered Bilal to teach it.",
    "foot_note": "1. Some placed it in the second; like Al-Dhahabi; because it was in Safar, and he, peace and blessings be upon him, entered Medina in Rabi' al-Awwal; so according to this, the second year of Hijra would have entered, and it would be in the second year correctly, not in the first, and Allah knows best. See: \"Sirat Ibn Hisham\" (241/ 2), \"Al-Durar\" by Ibn Abd al-Barr (95), and \"Sirat Ibn Sayyid al-Nas\" (224/ 1). \n2. Al-Bukhari said in his \"Sahih\" (1453/ 4) chapter of Ghazwah of Al-Ashirah or Al-Asirah, \"Ibn Ishaq said: The first the Prophet, peace and blessings be upon him, raided was Al-Abwa', then Buwat, then Al-Ashirah\". It is called: Waddan, and it is the first Ghazwah he, peace and blessings be upon him, led himself. It was in Safar, and he went out intercepting a caravan of Quraysh; but he met no plot. See: \"Zad al-Ma'ad\" (164/ 3). \n3. Imam Ahmad narrated in his \"Musnad\" (43/ 1) from him - may Allah be pleased with him, he said: \"Then when the Messenger of Allah, peace and blessings be upon him, ordered the bell; to be struck for the people to gather for prayer; a man carrying a bell in his hand circled around me while I was sleeping. I said to him: O servant of Allah! Do you sell the bell? He said: What will you do with it? He said: I said: We call with it to prayer. He said: Shall I not guide you to what is better than that? He said: I said to him: Yes. He said: You say: Allah is Greatest, Allah is Greatest. Allah is Greatest, Allah is Greatest. I bear witness that there is no god but Allah. I bear witness that there is no god-",
    "book_id": "681",
    "new_page_number": 40
  },
  {
    "serial_number": "5125986",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 45,
    "volume_number": 1,
    "text": "4 - And Abdullah bin Salam embraced Islam (1).",
    "foot_note": "1. = but Allah. I bear witness that Muhammad is the Messenger of Allah. I bear witness that Muhammad is the Messenger of Allah. Come to prayer. Come to prayer. Come to success. Come to success. Allah is Greatest, Allah is Greatest. There is no god but Allah. Then he said: You say when the prayer is established: Allah is Greatest, Allah is Greatest. I bear witness that there is no god but Allah. I bear witness that Muhammad is the Messenger of Allah. Come to prayer. Come to success. Prayer has been established, Prayer has been established. Allah is Greatest, Allah is Greatest. There is no god but Allah; When I woke up, I came to the Messenger of Allah, peace and blessings be upon him, and told him what I saw. He said: «It is a true vision if Allah wills; so stand with Bilal, and cast upon him what you saw, let him call with it, for he has a louder voice than you», he said: So I stood with Bilal, and started casting it upon him, and he called with it. He said: Umar bin al-Khattab heard that while he was in his house, so he came out dragging his cloak saying: By the One who sent you with the truth! I have seen the like of what he was shown. He said: The Messenger of Allah, peace and blessings be upon him, said: «So to Allah belongs praise». Also narrated by Abu Dawood (120/ 1), Al-Tirmidhi (122/ 1), and Ibn Majah (232/ 1). \n1. In \"Al-Bukhari\" the story of his Islam (1211/ 3): \"From Anas - may Allah be pleased with him, he said: Then Abdullah bin Salam heard of the arrival of the Messenger of Allah, peace and blessings be upon him, in Medina, so he came to him and said: I am asking you about three things no one knows except a prophet: What is the first sign of the Hour? What is the first food the people of Paradise eat? From what does the child resemble his father? And from what does he resemble his maternal uncles? The Messenger of Allah, peace and blessings be upon him, said: «Gabriel informed me of them just now», he said: Abdullah said: That is the enemy of the Jews among the angels. The Messenger of Allah, peace and blessings be upon him, said: «As for the first sign of the Hour, it is a fire that gathers people from East to West. As for the first food the people of Paradise eat; it is the caudate lobe of whale liver. As for the resemblance in the child; if the man has intercourse with the woman; and his water precedes hers, the resemblance is to him, and if her water precedes, the resemblance is to her», he said: I bear witness that you are the Messenger of Allah. Then, he said: O Messenger of Allah! The Jews are a people of slander, if they know of my Islam before you ask them, they will slander me to you; so the Jews came, and Abdullah entered the house. The Messenger of Allah, peace and blessings be upon him, said: «What kind of man is Abdullah bin-",
    "book_id": "681",
    "new_page_number": 41
  },
  {
    "serial_number": "5125987",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 46,
    "volume_number": 1,
    "text": "14 - Events in the Second Year:\n1 - Ghazwah of Buwat in Rabi' al-Awwal (1).\n2 - Then Badr Al-Ula (The First) in it.\n3 - Then Dhu Al-Ashirah in Jumada (3).",
    "foot_note": "1. -Salam among you»? They said: Our most learned, and son of our most learned, and our best, and son of our best. The Messenger of Allah, peace and blessings be upon him, said: «What if you see Abdullah become Muslim?» They said: May Allah protect him from that; so Abdullah came out to them, and said: I bear witness that there is no god but Allah, and I bear witness that Muhammad is the Messenger of Allah. They said: Our worst, and son of our worst, and they disparaged him». \n1. Ibn al-Qayyim said in \"Zad al-Ma'ad\" (165/ 3): \"The Messenger of Allah, peace and blessings be upon him, raided Buwat in the month of Rabi' al-Awwal at the head of thirteen months from his migration. Sa'd bin Abi Waqqas carried his flag, which was white. He appointed Sa'd bin Mu'adh over Medina. He went out with two hundred of his companions intercepting a caravan of Quraysh containing Umayyah bin Khalaf al-Jumahi, and a hundred men of Quraysh, and two thousand five hundred camels. He reached Buwat, which are two branching mountains from one origin of the mountains of Juhaynah towards the road of Sham. Between Buwat and Medina is about four Burud (stages); he met no plot, so he returned\". \n2. Ibn al-Qayyim said in \"Zad al-Ma'ad\" (166/ 3): \"Then he went out at the head of thirteen months from his migration seeking Kurz bin Jabir al-Fihri. Ali bin Abi Talib - may Allah be pleased with him - carried his flag, which was white. He appointed Zaid bin Haritha over Medina. Kurz had raided the grazing camels of Medina and drove them away, and they were grazing at Al-Hima; so the Messenger of Allah pursued him until he reached a valley called: Safwan from the direction of Badr. Kurz missed him, and he did not catch him, so he returned to Medina\". See: \"Sirat Ibn Hisham\" (251/ 2), and \"Sirat Ibn Sayyid al-Nas\" (225/ 1). \n3. It was in Jumada al-Ula, where the Prophet, peace and blessings be upon him, went out seeking a caravan of Quraysh carrying trade for them. Hamza - may Allah be pleased with him - was carrying his flag. When he reached-",
    "book_id": "681",
    "new_page_number": 42
  },
  {
    "serial_number": "5125988",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 47,
    "volume_number": 1,
    "text": "4 - Then Badr Al-Kubra (The Great) (1) on Friday the seventeenth passed of Ramadan.\n5 - Then Banu Qaynuqa' in Shawwal (2).\n6 - Then Al-Sawiq (3) in Dhu al-Hijjah.",
    "foot_note": "1. = Al-Ashirah - which is from the direction of Yanbu between Mecca and Medina - he made a pact with Banu Mudlij and their allies from Damra, and returned, and met no plot. He appointed Abu Salamah bin Abd al-Asad over Medina. \n1. It is Badr the Second, the greatest of battles in virtue for those who witnessed it. See: \"Tarikh al-Tabari\" (57/ 1 - 58), \"Tarikh Khalifa\" (57/ 1 - 58), \"Ansab al-Ashraf\" (135/ 1), and \"Sirat Ibn Sayyid al-Nas\" (241/ 1). \n2. Its cause: An Arab woman came with goods of hers, sold them in the market of Banu Qaynuqa', and sat at a jeweler's there. They wanted her to uncover her face, but she refused. The jeweler took the edge of her garment and tied it to her back. When she stood up, her private parts were exposed, so they laughed at her. She shouted. A Muslim man jumped on the jeweler and killed him, and he was a Jew. The Jews attacked the Muslim and killed him. The family of the Muslim called for help from the Muslims against the Jews. The Muslims became angry, and after that the battle occurred due to their breaking their covenant and their aggression against the Muslims. It was in the second year, and some made it in the third year. See: \"Sirat Ibn Hisham\" (50/ 3), \"Tabaqat Ibn Sa'd\" (28/ 2 - 29), and \"Tarikh al-Tabari\" (48/ 2). \n3. Ibn al-Qayyim said in \"Zad al-Ma'ad\" (189/ 3): \"When the polytheists returned to Mecca distressed and sad, Abu Sufyan vowed not to touch his head with water until he raids the Messenger of Allah, peace and blessings be upon him. He went out with two hundred riders until he reached Al-Arid at the edge of Medina, and spent one night with Sallam bin Mishkam the Jew, who gave him wine to drink, and revealed to him the news of the people. When morning came, he cut palm trees, and killed a man from the Ansar and an ally of his, then turned back. The Messenger of Allah, peace and blessings be upon him, was warned of him, so he went out in-",
    "book_id": "681",
    "new_page_number": 43
  },
  {
    "serial_number": "5125989",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 48,
    "volume_number": 1,
    "text": "7 - Then Qarqarat Al-Kudr (1) in Muharram.\n8 - In it the Qibla was changed (2): Monday, mid-Rajab, and it was said: Tuesday, mid-Sha'ban (3).\n9 - And fasting of Ramadan was obligated (4) in Sha'ban (5).\n&",
    "foot_note": "1. = his pursuit, reaching Qarqarat Al-Kudr, but Abu Sufyan escaped him. The disbelievers threw away much Sawiq (barley mush) from their provisions to lighten their load, so the Muslims took it, hence it was called: Ghazwah of Al-Sawiq. That was two months after Badr\". See: \"Sirat Ibn Hisham\" (47/ 3), and \"Sirat Ibn Sayyid al-Nas\" (344/ 1). \n1. Al-Tabari said in his \"Tarikh\" (50/ 2): \"Then he raided Qarqarat Al-Kudr when he heard of the gathering of Banu Sulaym and Ghatafan. He left Medina on Friday after the sun rose, the beginning of Shawwal of the second year of Hijra to it\". It is also called: Ghazwah of Banu Sulaym, and he met no war in it. See: \"Sirat Ibn Hisham\" (46/ 3), and \"Sirat Ibn Sayyid al-Nas\" (344/ 1). \n2. Al-Baladhuri said in \"Ansab al-Ashraf\" (271/ 1): \"The Qibla was turned to the Kaaba from the direction of Bayt al-Maqdis in the Dhuhr (prayer) of Tuesday, the middle of Sha'ban, year two of Hijra, and it is said: at the head of sixteen months\". \n3. Which is Al-Tabari's opinion as he established in his \"Tarikh\" (17/ 2 - 18); where he said: \"In the second year of the arrival of the Prophet to Medina in Sha'ban. The Salaf scholars differed on the time it was turned in this year. Some said, and they are the vast majority: It was turned in the middle of Sha'ban at the head of eighteen months from the arrival of the Messenger of Allah to Medina\". \n4. Ibn Abd al-Barr said in \"Al-Durar\" (97): \"A year before the changing of the Qibla\". \n5. Ibn al-Qayyim established that in \"Zad al-Ma'ad\" (171/ 3), and Al-Baladhuri in \"Ansab al-Ashraf\" (272/ 1).",
    "book_id": "681",
    "new_page_number": 44
  },
  {
    "serial_number": "5125990",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 49,
    "volume_number": 1,
    "text": "10 - And Zakat al-Fitr was obligated two days before Eid, before Zakat was obligated, as Ibn Sa'd said (1). It was said: Zakat was obligated in this year, and it was said: Before Hijra, which is unlikely.\n11 - And the Prophet, peace and blessings be upon him, ordered the sacrifice (Udhiyah).\n12 - And Ali consummated marriage with Fatima - may Allah be pleased with them both, after Badr.\n\n15 - Events in the Third Year:\n1 - Ghazwah of Ghatafan to Najd, which is Ghazwah of Anmar, which is Dhu Amar (2) in Rabi' al-Awwal.",
    "foot_note": "1. \"Al-Tabaqat Al-Kubra\" (248/ 1). \n2. Ibn Sa'd said in his \"Tabaqat\" (34/ 2): \"The Ghazwah of the Messenger of Allah against Ghatafan to Najd, which is: Dhu Amar - area of Al-Nakhil - in the month of Rabi' al-Awwal at the head of twenty-five months from his migration. That is because the Messenger of Allah heard: That a gathering of Banu Tha'labah and Muharib, at Dhu Amar, had gathered wanting to strike the outskirts of the Messenger of Allah, peace and blessings be upon him, gathered by a man of them called: Du'thur bin al-Harith from Banu Muharib. So the Messenger of Allah called up the Muslims, and went out twelve nights passed of the month of Rabi' al-Awwal with four hundred and fifty men, having horses. He appointed Uthman bin Affan over Medina. They caught a man of them at Dhu al-Qassah called: Jabbar, from Banu Tha'labah. He was brought to the Messenger of Allah, peace and blessings be upon him, and informed him of their news, and said: They will not meet you, if they hear of your march, they flee to the tops of mountains, and I am marching with you. The Messenger of Allah invited him to Islam, so he became Muslim, and the Messenger of Allah, peace and blessings be upon him, joined him to Bilal. The Messenger of Allah, peace and blessings be upon him, did not meet anyone, except that he saw them on the tops of mountains. Rain hit the Messenger of Allah, peace and blessings be upon him, and his companions. The Messenger of Allah took off his clothes and spread them to dry, and threw them on a tree, and lay down. A man from the enemy came,-",
    "book_id": "681",
    "new_page_number": 45
  },
  {
    "serial_number": "5125991",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 50,
    "volume_number": 1,
    "text": "2 - Then Banu Sulaym at Bahran (1) in Jumada al-Ula.\n3 - Then Uhud (2) on Saturday, seven [days] passed of Shawwal.\n4 - Then Hamra' al-Asad (3) in Shawwal.",
    "foot_note": "1. = called: Du'thur bin al-Harith, with a sword, until he stood at the head of the Messenger of Allah, peace and blessings be upon him, then said: Who protects you from me today? The Messenger of Allah, peace and blessings be upon him, said: «Allah», and Gabriel pushed him in his chest, so the sword fell from his hand. The Messenger of Allah took it, and said to him: «Who protects you from me?» He said: No one, I bear witness that there is no god but Allah, and that Muhammad is the Messenger of Allah. Then he went to his people and began calling them to Islam. This verse was revealed about him: O YOU WHO HAVE BELIEVED, REMEMBER THE FAVOR OF ALLAH UPON YOU WHEN A PEOPLE DETERMINED... the verse [Al-Ma'idah:11]. Then the Messenger of Allah returned to Medina, and met no plot. His absence was eleven nights\". See: \"Sirat Ibn Hisham\" (49/ 3), and \"Sirat Ibn Sayyid al-Nas\" (203/ 1). \n1. Ibn Hisham said (50/ 3): \"Then the Messenger of Allah, peace and blessings be upon him, raided wanting Quraysh, and appointed Ibn Umm Maktum over Medina. Ibn Ishaq said: Until he reached Bahran, a mine in Hijaz from the area of Al-Furu'. He stayed there the month of Rabi' al-Akhir and Jumada al-Ula, then returned to Medina, and met no plot\". \n2. See: \"Sirat Ibn Hisham\" (64/ 3), and \"Ansab al-Ashraf\" (148/ 1). \n3. Ibn Ishaq said: \"When it was the next day, Sunday, sixteen nights passed of Shawwal, the caller of the Messenger of Allah, peace and blessings be upon him, announced to the people to pursue the enemy. His caller announced that: No one should go out with us except one who attended our day yesterday. Jabir bin Abdullah bin Amr bin Haram spoke to him, saying: O Messenger of Allah! My father left me to care for seven sisters of mine, and said to me: O my son! It is not fitting for me, nor for you to leave these women with no man among them, and I am not one to prefer you over myself for Jihad with the Messenger of Allah, peace and blessings be upon him, so stay with your sisters. So I stayed with them. So the Messenger of Allah, peace and blessings be upon him, permitted him, so he went out with him. The Messenger of Allah, peace and blessings be upon him, only went out to terrorize the enemy, and to let them know that he went out in their pursuit-",
    "book_id": "681",
    "new_page_number": 46
  },
  {
    "serial_number": "5125992",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 51,
    "volume_number": 1,
    "text": "5 - In it Al-Hasan was born.\n6 - And wine was forbidden, and it was said: In the fourth.\n\n16 - Events in the Fourth Year:\n1 - Ghazwah of Banu Al-Nadir (1) in Rabi' al-Awwal.\n2 - Then Dhat Al-Riqa' (2) in Muharram.",
    "foot_note": "1. = to make them think he has strength, and that what befell them at Uhud did not weaken them against their enemy\". See: \"Tarikh al-Tabari\" (75/ 2), \"Sirat Ibn Hisham\" (107/ 3), and \"Sirat Ibn Sayyid al-Nas\" (37/ 2). \n1. Its cause was that the Prophet, peace and blessings be upon him, said to Amr bin Umayyah: «You have killed two men, I shall surely pay blood money for them». The Prophet, peace and blessings be upon him, went out to Banu Al-Nadir for their help in their blood money; due to the alliance between him and them. They said: Yes. He sat with Abu Bakr, Umar, Ali and a group of his companions. The Jews gathered and consulted, and said: Who is a man to throw this millstone on Muhammad and kill him? The most wretched of them, Amr bin Jahhash - may Allah curse him - volunteered. Gabriel came down from the Lord of the Worlds to His Messenger informing him of what they intended. The Messenger of Allah rose immediately returning to Medina, then prepared and went out himself to fight them. He besieged them for six nights, and appointed Ibn Umm Maktum over Medina. That was in Rabi' al-Awwal. Allah cast terror into their hearts, disgraced them, and defeated them. They surrendered on condition that they have what their camels carry except weapons, and depart from their homes. See: \"Sirat Ibn Hisham\" (199/ 3), \"Tarikh al-Tabari\" (83/ 2 - 85), and \"Al-Tabaqat Al-Kubra\" (57/ 2). \n2. The Messenger of Allah, peace and blessings be upon him, stayed in Medina after the Ghazwah of Banu Al-Nadir for the month of Rabi' al-Akhir and part of Jumada. Then he raided Najd wanting Banu Muharib and Banu Tha'labah of Ghatafan. He appointed Abu Dharr Al-Ghifari over Medina, and it is said: Uthman bin Affan, until he reached Nakhl,-",
    "book_id": "681",
    "new_page_number": 47
  },
  {
    "serial_number": "5125993",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 52,
    "volume_number": 1,
    "text": "3 - And in it, in this year, he, peace and blessings be upon him, prayed the Fear Prayer, and it was said: In the fifth.\n4 - And in it prayer was shortened.\n\n17 - In the Fifth Year:\n1 - Ghazwah of Dumat al-Jandal (1) in Rabi' [al-Awwal] (2).\n2 - Then Al-Muraysi' (3), which is the Ghazwah of Banu Al-Mustaliq in Sha'ban.",
    "foot_note": "1. = which is Ghazwah of Dhat Al-Riqa'. It was named by this name because their feet were pierced, so they wrapped rags around them. And it was said: Because they patched their flags in it. It is said: Dhat Al-Riqa' is a tree in that place called: Dhat Al-Riqa'. And it was said: Rather the mountain they descended upon had land of colors of red, yellow and black, so they named their Ghazwah: Dhat Al-Riqa'. See: \"Sirat Ibn Hisham\" (213/ 3), \"Ansab al-Ashraf\" (163/ 1), and \"Sirat Ibn Sayyid al-Nas\" (52/ 2). \n1. Its cause: It reached the Prophet, peace and blessings be upon him: That there was a gathering of polytheists there, and they wrong whoever passes by them, and they want to approach Medina. So he raided them, but met no plot. He left Suba' bin Urfutah Al-Ghifari over Medina. The Muslims gained camels and sheep found for them. See: \"Sirat Ibn Hisham\" (224/ 3), \"Tabaqat Ibn Sa'd\" (62/ 2), \"Ansab al-Ashraf\" (164/ 1), and \"Sirat Ibn Sayyid al-Nas\" (54/ 2). \n2. Fell from the original. \n3. Its cause: That when it reached the Prophet, peace and blessings be upon him: That Al-Harith bin Abi Dirar, master of Banu Al-Mustaliq, marched among his people and those of the Arabs he could, wanting war. He sent Buraydah bin Al-Husaib Al-Aslami to know that for him. He came to them and returned to the Prophet, informing him of their news. The Prophet called up the people, so they hastened to go out. A group went out with them-",
    "book_id": "681",
    "new_page_number": 48
  },
  {
    "serial_number": "5125994",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 53,
    "volume_number": 1,
    "text": "3 - Then Ghazwah of Al-Khandaq (The Trench) (1), which is Ghazwah of Al-Ahzab (The Confederates).",
    "foot_note": "1. = of hypocrites who had not gone out in a Ghazwah before it. He appointed Zaid bin Haritha over Medina, and it was said: Abu Dharr, and it was said: Numaylah bin Abdullah Al-Laythi. He went out on Monday, two nights passed of Sha'ban. The news of the Messenger of Allah's march reached Al-Harith bin Abi Dirar and those with him, and his killing of the spy he had sent to bring him his news and the news of the Muslims. So they feared intensely, and those with them of Arabs dispersed from them. The Messenger of Allah reached Al-Muraysi', which is a place of water, and raided them, capturing their offspring and wealth as in \"Al-Sahih\": \"The Messenger of Allah raided Banu Al-Mustaliq while they were heedless, and mentioned the Hadith. Among the captives was Juwayriyah daughter of the master of the people, who fell in the share of Thabit bin Qais. She wrote a contract of freedom (Mukatabah), and the Messenger of Allah, peace and blessings be upon him, paid for her and married her. So the Muslims freed because of this one hundred of Banu Al-Mustaliq\". See: \"Al-Bukhari\" (898/ 2), \"Sirat Ibn Hisham\" (203/ 3), \"Ansab al-Ashraf\" (64/ 1), and \"Zad al-Ma'ad\" (255/ 3 - 258). \n1. Its cause: That the Jews, when they saw the victory of the polytheists on the day of Uhud, and knew of Abu Sufyan's appointment to raid the Muslims, he went out for that, then returned for the next year. Some of them; like Sallam bin Abi Al-Huqayq, Sallam bin Mishkam, and others went out to Mecca inciting them to raid Medina, and rallying them against the Muslims, promising them victory. Quraysh responded to them. Then they toured Arab tribes calling them to that. A group responded to them. Quraysh went out, their leader Abu Sufyan with four thousand, and some Arab tribes of polytheists joined them. Those who attended the Trench from the disbelievers were ten thousand. When the Messenger of Allah, peace and blessings be upon him, heard of their march towards him, he consulted the Companions. Salman Al-Farisi - may Allah be pleased with him - advised him to dig a trench to intervene between the enemy and Medina. He ordered it, and the Muslims rushed to it, and he, peace and blessings be upon him, worked in it himself. They surprised the disbelievers' attack on them. The trench was dug in front of Sal' (mountain), and Sal' was a mountain behind the Muslims' backs, and the trench between them and the disbelievers. He, peace and blessings be upon him, went out with-",
    "book_id": "681",
    "new_page_number": 49
  },
  {
    "serial_number": "5125995",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 54,
    "volume_number": 1,
    "text": "4 - Then Banu Qurayzah (1). Both in Dhu al-Qa'dah, and it was said: in Shawwal. Ibn Hazm: It is established that Ghazwah of Al-Khandaq was in the fourth (2); due to Amr's hadith: That it was before Dumat al-Jandal without doubt. It was said: Hajj was obligated in it, and it was said: year six, and it was said: nine, and some preferred it. In it was the story of Al-Ifk (Slander) (3) at Al-Muraysi', and it was said: in the sixth. And the verse of Tayammum was revealed after it, and it was said: in the fourth.",
    "foot_note": "1. -three thousand Muslims, fortifying himself with the mountain behind him, and the trench in front of him\". See: \"Al-Bukhari\" (1504/ 4 - 1510), \"Sirat Ibn Hisham\" (226/ 3), and \"Zad al-Ma'ad\" (270/ 3 - 271). \n1. Al-Bukhari extracted in his \"Sahih\" (1410/ 4) from Aisha - may Allah be pleased with her, she said: \"Then when the Prophet, peace and blessings be upon him, returned from Al-Khandaq, put down arms and washed, Gabriel - peace be upon him - came to him and said: You have put down arms? By Allah, we have not put them down. Go out to them. He said: To where? He said: Here, and pointed to Banu Qurayzah. So the Prophet, peace and blessings be upon him, went out to them\". \n2. This is the opinion of Musa bin Uqbah as Al-Bukhari quoted from him in his \"Sahih\" (1504/ 4): \"It is Al-Ahzab. Musa bin Uqbah said: It was in Shawwal year four\". This is a weak opinion, weakened by Al-Dhahabi in Al-Maghazi from his \"Tarikh\": (296 - 297), and Ibn Hajar in \"Al-Fath\" (393/ 7). \n3. In it was revealed: INDEED, THOSE WHO CAME WITH FALSEHOOD ARE A GROUP AMONG YOU. DO NOT THINK IT BAD FOR YOU; RATHER IT IS GOOD FOR YOU. FOR EVERY PERSON AMONG THEM IS WHAT [PUNISHMENT] HE HAS EARNED FROM THE SIN, AND HE WHO TOOK UPON HIMSELF THE GREATER PORTION THEREOF FOR HIM IS A GREAT PUNISHMENT (Al-Nur:11), to the completion of ten verses. See: \"Sahih Al-Bukhari\" (1517/ 4 - 1523), and \"Sirat Ibn Hisham\" (10/ 3 - 14).",
    "book_id": "681",
    "new_page_number": 50
  },
  {
    "serial_number": "5125996",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 55,
    "volume_number": 1,
    "text": "18 - Events in the Sixth Year:\n1 - Ghazwah of Banu Lihyan (1) in Rabi' al-Awwal.\n2 - Then Al-Ghabah (2).\n3 - Then Al-Hudaybiyah (3) in Dhu al-Qa'dah.\n4 - And in it he, peace and blessings be upon him, prayed for rain (Istisqa') in Ramadan, and they were given rain.\n\n19 - Events in the Seventh Year:\nGhazwah of Khaybar (4) in Jumada al-Ula.",
    "foot_note": "1. See: \"Sirat Ibn Hisham\" (292/ 3), \"Ansab al-Ashraf\" (167/ 1), \"Tabaqat Ibn Sa'd\" (78/ 2 - 79), and \"Zad al-Ma'ad\" (276/ 3). \n2. Its cause was the raid of Uyaynah bin Hisn Al-Fazari among Banu Abdullah bin Ghatafan on the milch camels of the Prophet, driving them away, killing their shepherd, and carrying off his wife. The Prophet went out with a group of Companions in their pursuit. The Messenger of Allah appointed Ibn Umm Maktum over Medina. Salamah bin Al-Akwa' had a wonderful story in it. See: \"Al-Bukhari\": (1536/ 4), \"Muslim\" (1432/ 3 - 1439), \"Sirat Ibn Hisham\" (293/ 3), and \"Sirat Ibn Sayyid al-Nas\" (84/ 2). It is also called: Ghazwah of Dhu Qarad. \n3. The Prophet, peace and blessings be upon him, went out in it performing Umrah with his companions, and they were between a thousand five hundred or four hundred. Quraysh prevented him. In it Surah Al-Fath was revealed. The famous treaty was concluded after which came the victory for Muslims, and the Pledge of Ridwan. The Prophet, peace and blessings be upon him, said regarding those who pledged: «No one who pledged allegiance under the tree will enter the Fire» extracted by Muslim (1942/ 3), and \"Al-Tirmidhi\" (695/ 5). See: \"Al-Bukhari\" (1524/ 4), \"Muslim\" (1433/ 3), \"Sirat Ibn Hisham\" (321/ 3), and \"Tabaqat Ibn Sa'd\" (95/ 2). \n4. See: \"Ibn Hisham\" (342/ 3), \"Tabaqat Ibn Sa'd\" (106/ 2), and \"Ansab-",
    "book_id": "681",
    "new_page_number": 51
  },
  {
    "serial_number": "5125997",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 56,
    "volume_number": 1,
    "text": "2 - And in it Abu Huraira (1) and Imran bin Husayn (2) embraced Islam - may Allah be pleased with them both.\n\n20 - Events in the Eighth Year:\n1 - Ghazwah of Al-Fath (The Conquest) (3) in Ramadan.\n2 - Then Hunayn (4) in Shawwal.\n3 - Then Al-Ta'if (5).",
    "foot_note": "1. = Al-Ashraf\" (169/ 1), \"Sirat Ibn Sayyid al-Nas\" (130/ 2), and \"Zad al-Ma'ad\" (316/ 3). \n1. See the story of his Islam - may Allah be pleased with him - in: \"Tabaqat Ibn Sa'd\" (325/ 4), and \"Al-Isabah\" (426/ 7). \n2. See: \"Al-Isti'ab\" (1208/ 3), and \"Al-Isabah\" (705/ 4). \n3. It is the Great Conquest by which Allah honored His religion and His Messenger, and people entered the religion of Allah in multitudes. It was when ten days of Ramadan had passed. The cause was: That Kinanah aggressed against Khuza'ah, and Quraysh aided them in that. Khuza'ah had entered the covenant of the Messenger of Allah, peace and blessings be upon him, in the Treaty of Hudaybiyah, so that was a breach of the covenant by Quraysh. The Prophet, peace and blessings be upon him, gathered the people and conquered Mecca after Khuza'ah sought his help. See: \"Sahih Al-Bukhari\" (1557/ 4), \"Ansab al-Ashraf\" (170/ 1), \"Sirat Ibn Sayyid al-Nas\" (163/ 2), and \"Zad al-Ma'ad\" (394/ 3). \n4. Also called: Ghazwah of Awtas. Hunayn and Awtas: Two places between Mecca and Ta'if, so the Ghazwah was named after its place. Also called: Ghazwah of Hawazin; because they were the ones who came to fight the Messenger of Allah, peace and blessings be upon him. See: \"Sahih Al-Bukhari\" (1568/ 4 - 1576), \"Sirat Ibn Sayyid al-Nas\" (187/ 2), and \"Zad al-Ma'ad\" (465/ 3). \n5. It was in Shawwal year eight, said Musa bin Uqbah, mentioned by Al-Bukhari in-",
    "book_id": "681",
    "new_page_number": 52
  },
  {
    "serial_number": "5125998",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 57,
    "volume_number": 1,
    "text": "4 - And in it Khalid, Uthman bin Talha, and Amr bin Al-Aas came to Medina; and embraced Islam. It was said: Khalid and Amr embraced Islam before that and witnessed Khaybar.\n5 - And the pulpit of the Messenger of Allah, peace and blessings be upon him, was made. It is the first pulpit made in Islam, consisting of two steps and a seat, and he preached on it.\n6 - And the trunk by which he used to preach yearned for him (1).\n\n21 - Events in the Ninth Year:\n1 - Ghazwah of Tabuk (2), which is the last of the Ghazwat.",
    "foot_note": "1. = \"His Sahih\": (1572/ 4). See: \"Sirat Ibn Sayyid al-Nas\" (200/ 2), and \"Zad al-Ma'ad\" (495/ 3). \n1. Hadith of the trunk yearning for him, peace and blessings be upon him, extracted by Al-Bukhari in his \"Sahih\" from Jabir bin Abdullah - may Allah be pleased with them both, saying, \"Then the mosque was roofed on trunks of palm trees. The Prophet, peace and blessings be upon him, when he preached, used to stand by a trunk of them. When the pulpit was made for him, and he was on it, we heard for that trunk a sound like the sound of pregnant camels, until the Prophet, peace and blessings be upon him, came and placed his hand on it, so it quieted\". \n2. Ibn al-Qayyim said in \"Zad al-Ma'ad\" (/526): \"It was in the month of Rajab year nine. Ibn Ishaq said: It was in a time of hardship for people, drought in the land, and when fruits ripened, and people loved staying in their fruits and shades, and disliked leaving them in that state. The Messenger of Allah, peace and blessings be upon him, rarely went out in a Ghazwah but he alluded to it and pretended another, except what was of Ghazwah of Tabuk; due to the distance of the journey and severity of time\". Therefore it is called: Ghazwah of Al-Usrah (Hardship). See: \"Sahih Al-Bukhari\" (1602/ 4), and \"Sirat Ibn Sayyid al-Nas\" (215/ 2).",
    "book_id": "681",
    "new_page_number": 53
  },
  {
    "serial_number": "5125999",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 58,
    "volume_number": 1,
    "text": "2 - And their number is twenty-seven. And it was said: twenty-five. And it was said: twenty-four, and twenty-one. And it was said: nineteen.\n3 - He fought (1) in nine: Badr, [Uhud] (2), Al-Khandaq, Qurayzah, Al-Mustaliq, Khaybar, Al-Fath, Hunayn, and Al-Ta'if. And it was said: he fought in Banu Al-Nadir and Al-Ghabah.\n4 - And this is called: The Year of Delegations (3).\n5 - In it he, peace and blessings be upon him, conducted Lian [between] (4) Uwaymir Al-Ajlani (5) and his wife in his mosque after Asr in Sha'ban.\n\n22 - Events in the Tenth Year:\n1 - The saying of the Almighty was revealed: {O YOU WHO HAVE BELIEVED, LET THOSE WHOM YOUR RIGHT HANDS POSSESS ASK PERMISSION OF YOU} [Al-Nur:58], and they did not use to do that before (6).\n2 - And Musaylimah the Liar, [claimer] (7) of Prophethood, apostatized (8).\n&",
    "foot_note": "1. In original: Qala (Said), which is an error. \n2. Fell from the original. \n3. Named so; due to the large number of delegations that came to the Prophet, peace and blessings be upon him, announcing their Islam. \n4. Addition by me to complete the meaning. \n5. Hadith of Lian extracted by: Al-Bukhari (1771/ 4), and Ibn Majah (667/ 1). \n6. Extracted by Abu Dawood suspended from Ibn Abbas (349/ 4). \n7. Fell from the original. \n8. Al-Bukhari extracted in (1325/ 3), and Muslim (1780/ 4), from Ibn Abbas - may Allah be pleased with them both, said: \"Musaylimah the Liar came during the time of the Messenger of Allah, peace and blessings be upon him, -",
    "book_id": "681",
    "new_page_number": 54
  },
  {
    "serial_number": "5126000",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 59,
    "volume_number": 1,
    "text": "3 - And the Prophet, peace and blessings be upon him, performed the Farewell Hajj.\n4 - And revealed to him at Arafah (1): {THIS DAY I HAVE PERFECTED FOR YOU YOUR RELIGION} [Al-Ma'idah:3]. A hundred and twenty thousand stood with him. He did not perform Hajj after migration other than it. Ibn Hazm: He performed Hajj and Umrah before Prophethood, and after it before Migration, Hajjs and Umrahs whose number is unknown. Ibn Sa'd (2): He did not perform Hajj since he was made prophet other than the Farewell Hajj. And it was said: He performed another Hajj in Mecca after Prophethood. And it was said: two Hajjs (3).\nHe performed four Umrahs after Migration, all of them [in] Dhu al-Qa'dah:\n1 - Umrah of Al-Hudaybiyah.\n2 - And the Make-up (Qada') the following year.",
    "foot_note": "1. = and began saying: If Muhammad makes the command for me after him, I will follow him. He came with many of his people. The Messenger of Allah, peace and blessings be upon him, came to him, with Thabit bin Qais bin Shammas, and in the hand of the Messenger of Allah, peace and blessings be upon him, was a piece of palm branch. He stood over Musaylimah among his companions and said: «If you asked me for this piece, I would not give it to you, and you will not escape the command of Allah regarding you, and if you turn back, Allah will surely destroy you, and I see you as the one who was shown to me in what I saw». Abu Huraira informed me: That the Messenger of Allah, peace and blessings be upon him, said: «While I was sleeping, I saw in my hand two gold bracelets, and their matter worried me, so it was revealed to me in sleep: that I blow on them. So I blew on them, and they flew away. I interpreted them as two liars coming out after me», one was: Al-Ansi, and the other: Musaylimah the Liar, owner of Al-Yamama». \n1. See: \"Sahih Al-Bukhari\" (1683/ 4), and \"Sahih Muslim\" (2312/ 4). \n2. \"Al-Tabaqat\" (189/ 2). \n3. Also mentioned by Al-Tabari from Jabir (210/ 2).",
    "book_id": "681",
    "new_page_number": 55
  },
  {
    "serial_number": "5126001",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 60,
    "volume_number": 1,
    "text": "3 - And Al-Ji'ranah.\n4 - And the one with his Hajj (1).\n\n23 - His Saraya (Expeditions), peace and blessings be upon him:\nThey were around sixty, said Al-Dimyati. And it was said: forty-eight. And it was said: thirty-six (2).\n\n24 - Events in the Eleventh Year:\n1 - Al-Aswad Al-Ansi the Liar appeared in Yemen, and claimed Prophethood. Fayruz Al-Daylami killed him (3) in his house.\n2 - And the Prophet, peace and blessings be upon him, died.\n\n25 - His Children, peace and blessings be upon him:\n1 - The first of them Al-Qasim: Born in Mecca before Prophethood (4). Ibn Hazm: He lived a few days, and it was said: two years, and it was said: until he rode the beast and marched on the she-camel.\n2 - Then Zainab, and it was said: she was older [than] (5) Al-Qasim; she married",
    "foot_note": "1. See Al-Bukhari (631/ 3), and Muslim (916/ 3), from the hadith of Anas - may Allah be pleased with him. \n2. See: \"Tarikh al-Tabari\" (206/ 2 - 207), and \"Tabaqat Ibn Sa'd\" (5/ 2). \n3. See: \"Tabaqat Ibn Sa'd\" (533/ 5). \n4. He is the first of his children to die, peace and blessings be upon him. See: \"Tabaqat Ibn Sa'd\" (133/ 1), (7/ 3), \"Al-Mu'jam Al-Kabir\" by Al-Tabarani (297/ 23), and \"Subul al-Huda wa al-Rashad\" (19/ 11). \n5. Fell from the original.",
    "book_id": "681",
    "new_page_number": 56
  },
  {
    "serial_number": "5126002",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 61,
    "volume_number": 1,
    "text": "Abu Al-Abbas bin Al-Rabi'. Her daughter Umamah whom the Prophet, peace and blessings be upon him, carried in his prayer (1); Ali married her after Fatima.\n3 - Then Ruqayyah.\n4 - And Umm Kulthum.\n5 - And Fatima.\nRegarding each of them it was said: that she is younger in age than her two sisters. Uthman married: Ruqayyah, and after her death: Umm Kulthum; hence he was named: Dhu al-Nurayn (Possessor of Two Lights) (2).\nFatima married: Ali; she bore: Hasan, Husayn, and Muhsin who died young (3). And Umm Kulthum; Umar bin al-Khattab married her; she bore Zaid (4). And Zainab, married by: Abdullah bin Ja'far; she bore: Ali.",
    "foot_note": "1. Extracted by Al-Bukhari (2235/ 5), and Muslim (385/ 1). \n2. Ibn Abd al-Barr said in \"Al-Isti'ab\" (1039/ 3): \"Al-Muhallab bin Abi Sufra was asked: Why was Uthman called: Dhu al-Nurayn? He said: Because it is not known that anyone lowered a curtain over two daughters of a prophet other than him\", what a great virtue! \n3. Ibn Hazm said in \"Al-Jamharah\": (38): \"Al-Muhsin died very young shortly after his birth\". \n4. Umm Kulthum and her son died on the same day. Zaid was injured in a war among Banu Adi, he went out to reconcile between them, and was struck on the head in the dark, lived for days, and his mother was sick, so they died on the same day. Said by Ibn Hajar in \"Al-Isabah\" (294/ 8).",
    "book_id": "681",
    "new_page_number": 57
  },
  {
    "serial_number": "5126003",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 62,
    "volume_number": 1,
    "text": "Fatima (1) died after him, peace and blessings be upon him, by six months, and it was said: by eight, and it was said: by three, or less. Abd al-Ghani and others chose the first.\nThen born to him in Mecca after Prophethood:\n6 - Abdullah; also called: Al-Tayyib.\n7 - And Al-Tahir - according to the correct view, died in Mecca as a child (2); so Al-Aas bin Wa'il Al-Sahmi said: His progeny is cut off; so he is Abtar (cut off) (3); so revealed was: {INDEED, YOUR ENEMY IS THE ONE CUT OFF} [Al-Kawthar:3].\nThen born to him in Medina:\n8 - Ibrahim, in Dhu al-Hijjah year eight (4). He, peace and blessings be upon him, performed Aqiqah for him with two rams on his seventh day, shaved his head, gave charity with its weight in silver, and ordered his hair buried. He died as a child in Rabi' al-Awwal in the tenth of Hijra; Gabriel gave him (the Prophet) his Kunya (Abu Ibrahim); so he was pleased with that.",
    "foot_note": "1. Muslim extracted in his \"Sahih\" (1904/ 4) from the Mother of Believers Aisha - may Allah be pleased with her: \"That the Messenger of Allah, peace and blessings be upon him, called Fatima his daughter, whispered to her, so she wept, then whispered to her, so she laughed. Aisha said: So I said to Fatima: What is this which the Messenger of Allah, peace and blessings be upon him, whispered to you, so you wept, then whispered, so you laughed? She said: He whispered to me informing me of his death, so I wept, then whispered to me informing me: that I am the first of his family to follow him, so I laughed\". \n2. See: \"Al-Tabaqat by Ibn Sa'd\" (133/ 1), \"Nasab Quraysh\" by Al-Zubayr bin Bakkar (21), and \"Jamharat Ansab al-Arab\" by Ibn Hazm (16). \n3. See: \"Al-Tabaqat by Ibn Sa'd\" (133/ 1), and \"Tafsir al-Qurtubi\" (222/ 2). \n4. See: \"Sahih Muslim\" (1807/ 4), \"Musnad Ahmad\" (194/ 3), and \"Tabaqat Ibn Sa'd\" (135/ 1).",
    "book_id": "681",
    "new_page_number": 58
  },
  {
    "serial_number": "5126004",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 63,
    "volume_number": 1,
    "text": "All his children are from Khadija, except Ibrahim (1); for he is from Mariya bint Sham'un Al-Qibtiyyah (2). Khadija used to perform Aqiqah for every boy with two sheep, and for the girl one sheep, hire wet nurses for them, and prepare that before her delivery (3).\n\n26 - His Uncles, peace and blessings be upon him:\n1 - Abu Talib, his name is Abd Manaf.\n2 - And Al-Zubayr (4).\n3 - And Abd Al-Ka'bah.\n4 - And Hamza.\n5 - And Al-Muqawwam.\n6 - And Al-Mughira, his nickname is Jahl - with Jim first -, and it was said the reverse (Hajl).\n7 - And Al-Awwam.\n8 - And Al-Abbas.",
    "foot_note": "1. Born year eight of Hijra, and died as a child before weaning, year ten. \"Al-Isabah\" (172/ 1). \n2. She is the one gifted to the Prophet, peace and blessings be upon him, by Al-Muqawqis, ruler of the Copts, Lord of Alexandria. \n3. See: \"Tabaqat Ibn Sa'd\" (134/ 1), \"Sirat Ibn Sayyid al-Nas\" (364/ 2). \n4. Thus Al-Salihi vocalized it in \"Subul al-Huda wa al-Rashad\" (82/ 11) quoting from a vocalized compared copy of \"Ansab al-Ashraf\" he viewed, and also from Hafiz Mughlatay in his book \"Al-Zahr Al-Basim\", and others.",
    "book_id": "681",
    "new_page_number": 59
  },
  {
    "serial_number": "5126005",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 64,
    "volume_number": 1,
    "text": "9 - And Dirar.\n10 - And Al-Harith, by him Abd al-Muttalib was nicknamed (Abu al-Harith).\n11 - And Qutham.\n12 - And Abu Lahab (1).\n13 - And Al-Ghaydaq (2).\nSome counted them: Eleven, and some counted them: Ten (3).\nNotice: Hamza and Al-Abbas embraced Islam among them. Hamza [embraced Islam in the second] (4), and it was said: sixth. He is his brother, peace and blessings be upon him, through suckling (5). He used to fight before the Messenger of Allah, peace and blessings be upon him, with two swords, nicknamed: Lion of Allah. He was martyred",
    "foot_note": "1. His name is: Abd al-Uzza. \n2. Al-Ghaydaq is his nickname, his name is: Mus'ab, and it was said: Nawfal. \n3. See: \"Ansab al-Ashraf\" (87/ 1 - 91), \"Sirat Ibn Sayyid al-Nas\" (369/ 2), \"Zad al-Ma'ad\" (104/ 1), and \"Subul al-Huda wa al-Rashad\" (82/ 11). \n4. Fell from the original, established from sources. \n5. He is his brother from two ways: First: From the side of Thuwaybah, freed slave of Abu Lahab, the first to suckle the Prophet, peace and blessings be upon him, for days before Halima came, and she had suckled Hamza bin Abd al-Muttalib before him. Second: From the side of Halima Al-Sa'diyyah, she suckled Hamza one day, when he was also being suckled in Banu Sa'd. See: \"Tabaqat Ibn Sa'd\" (108/ 1), \"Al-Isabah\" (121/ 2), and \"Subul al-Huda wa al-Rashad\" (6/ 1).",
    "book_id": "681",
    "new_page_number": 60
  },
  {
    "serial_number": "5126006",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 65,
    "volume_number": 1,
    "text": "On the day of Uhud after killing thirty-one (1). The oldest of them was Al-Harith, and the youngest Al-Abbas, who was older than the Prophet, peace and blessings be upon him, by three years. It was narrated he embraced Islam before Badr secretly, and it was said: before Khaybar. He witnessed the Conquest of Mecca, Hunayn, and Ta'if, and stood firm on the day of Hunayn.\n\n27 - His Aunts, peace and blessings be upon him:\n1 - Umm Hakim.\n2 - And Atikah.\n3 - And Barrah.\n4 - And Arwa.\n5 - And Umaymah.\n6 - And Safiyyah.\nNotice: Safiyyah embraced Islam among them. Atikah and Arwa are disputed (2); the correct view regarding them is: Islam.\nBranch: Ibn Sa'd (3): Progeny from Banu Abd al-Muttalib [in]:",
    "foot_note": "1. That was in the middle of Shawwal year three of Hijra, he lived less than sixty. The Prophet, peace and blessings be upon him, nicknamed him: Lion of Allah, and named him: Master of Martyrs. See: \"Sahih Al-Bukhari\" (1494/ 4 - 1495). \n2. See the disagreement in: \"Al-Tabaqat Al-Kubra\" (43/ 8), (42/ 8) where Ibn Sa'd sees: they embraced Islam, \"Al-Isti'ab\" (1880/ 4), (1778/ 4), \"Al-Isabah\" (13/ 8), (480/ 7), and \"Zad al-Ma'ad\" (105/ 1). \n3. \"Al-Tabaqat Al-Kubra\" (94/ 1), and full speech: \"Hamza, Al-Muqawwam, -",
    "book_id": "681",
    "new_page_number": 61
  },
  {
    "serial_number": "5126007",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 66,
    "volume_number": 1,
    "text": "Al-Abbas (1), Abu Talib, Al-Harith, and Abu Lahab.\n\n28 - His Wives, peace and blessings be upon him (2):\n1 - Khadija (3): He married her when he was twenty-five, and it was said: thirty, and it was said: twenty-one. She died in Mecca ten days passed of Ramadan three years before Migration, and it was said: five, and it was said: four, after Abu Talib's death by three days, and it was said: by a month and five days. He, peace and blessings be upon him, did not marry another while she was alive until she died. She is the first to believe in him among women.\n2 - Then Sawda (4): He, peace and blessings be upon him, married her in the month of Ramadan, after Khadija's death",
    "foot_note": "1. = and Hajl sons of Abd al-Muttalib had children from their loins, then they perished, and the rest did not leave progeny. The number from Banu Hashim was in Banu Al-Harith, then shifted to Banu Abi Talib, then became in Banu Al-Abbas\". \n1. Ibn al-Qayyim said in \"Zad al-Ma'ad\" (105/ 1): \"The youngest of them in age: Al-Abbas, and from him came progeny until his children filled the earth\". \n2. See: \"Tabaqat Ibn Sa'd\" (216/ 8 - 219), \"Tarikh al-Tabari\" (211/ 2 - 215), \"Al-Isti'ab\" (44/ 1 - 46), \"Sirat Ibn Sayyid al-Nas\" (386/ 2 - 392), and \"Zad al-Ma'ad\" (105/ 1 - 114). \n3. Al-Hafiz Ibn Hajar said in \"Al-Isabah\" (600/ 7): \"Khadija bint Khuwaylid bin Asad bin Abd al-Uzza bin Qusayy, Al-Qurashiyyah Al-Asadiyyah, wife of the Prophet, peace and blessings be upon him, and the first to believe in his mission absolutely. Al-Zubayr bin Bakkar said: She used to be called before the Mission: Al-Tahirah (The Pure)\". See: \"Tabaqat Ibn Sa'd\" (131/ 1), \"Ansab al-Ashraf\" (396/ 1), and \"Sirat Ibn Sayyid al-Nas\" (381/ 2). \n4. She is Umm al-Mu'minin: Sawda bint Zam'a bin Qais bin Abd Shams bin Abd Wudd bin-",
    "book_id": "681",
    "new_page_number": 62
  },
  {
    "serial_number": "5126008",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 67,
    "volume_number": 1,
    "text": "By days, and gave her a dowry of four hundred dirhams. She is the one who gifted her day to Aisha (1). He did not divorce her (2), and it was said: he divorced her then took her back. Most say she died at the end of Umar's caliphate, and it was said: in Shawwal year fifty-four. Al-Waqidi (3) said: It is the established view.\n3 - Then a month after marrying her; he married Umm Abdullah Aisha bint Abi Bakr bin Abi Quhafah Uthman bin Amir bin Amr bin Ka'b bin Sa'd bin Tamim bin Murrah, two years before Migration, and it was said: three, while she was six years old, and it was said: seven. Abd al-Ghani (4) said: The first is more correct. He consummated the marriage in Shawwal at the head of",
    "foot_note": "1. = Nasr bin Malik bin Hisl bin Amir bin Lu'ayy. See: \"Tabaqat Ibn Sa'd\" (52/ 8), and \"Al-Isabah\" (720/ 7). \n1. Hadith of gifting her day to Aisha - may Allah be pleased with them both, extracted by Muslim (1058/ 2), and Al-Bukhari (916/ 2). \n2. Al-Tirmidhi extracted in his \"Sunan\" (3040) from Ibn Abbas, said: Sawda feared the Prophet, peace and blessings be upon him, would divorce her so she said: Do not divorce me, keep me, and I make my day for Aisha. He did so. Revealed was: AND IF A WOMAN FEARS FROM HER HUSBAND ILL CONDUCT OR DESERTION, THERE IS NO SIN UPON THEM IF THEY MAKE TERMS OF SETTLEMENT BETWEEN THEM - AND SETTLEMENT IS BEST [Al-Nisa:128]. Whatever they reconciled on is permissible. \n3. See: \"Al-Tabaqat Al-Kubra\" (55/ 8). \n4. He is Imam Hafiz Model Taqi al-Din Abd al-Ghani bin Abd al-Wahid bin Ali bin Surur, Abu Muhammad Al-Maqdisi Al-Jama'ili Al-Dimashqi Al-Hanbali. He has a work on Prophetic Biography. Died year 600 AH. See his biography in: \"Siyar A'lam al-Nubala\" (444/ 21 - 471), and \"Al-Maqsad Al-Arshad fi Dhikr Ashab Al-Imam Ahmad\" (152/ 2 - 155).",
    "book_id": "681",
    "new_page_number": 63
  },
  {
    "serial_number": "5126009",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 68,
    "volume_number": 1,
    "text": "Eighteen months, while she was nine years old. He did not marry a virgin other than her. She was born in year four of Prophethood. She died Tuesday night, seventeen passed of Ramadan year fifty-eight. Abu Huraira prayed over her, [and she was buried] (1) in Al-Baqi'. It was narrated she miscarried a fetus (2) from the Prophet, peace and blessings be upon him, named Abdullah, by whom she was given Kunya, but it is not authentic. In \"Sunan Abi Dawood\" (3): That he, peace and blessings be upon him, gave her Kunya by her nephew Abdullah bin al-Zubayr.\n4 - Then Hafsa bint Umar bin al-Khattab bin Nufayl bin Abd al-Uzza bin Rabah bin Abdullah bin Qurtah bin Rizah bin Adi bin Ka'b. He married her in Sha'ban at the head of thirty months from Migration, two months before Uhud. Thus Al-Dimyati asserted. Ibn Abd al-Barr (4): After Uhud. Before him she was with Khunays bin Hudhafah, who witnessed Badr, and there is disagreement about Uhud. She was born five years before Prophethood. She died in Sha'ban year forty-five, Al-Dimyati asserted, and other dates were said.",
    "foot_note": "1. Addition by me to complete the sentence. \n2. Al-Salihi said in \"Subul al-Huda wa al-Rashad\" (18/ 11): Ibn al-A'rabi narrated in his \"Mu'jam\", from Aisha - may Allah be pleased with her: That she miscarried a fetus from the Prophet, peace and blessings be upon him, named: Abdullah, by whom she was given Kunya. Its chain revolves around Dawud bin al-Muhabbir, who is Matruk (abandoned), and a group accused him of fabrication. \n3. Extracted in his \"Sunan\" (293/ 4) with authentic chain. \n4. \"Al-Isti'ab\" (452/ 2).",
    "book_id": "681",
    "new_page_number": 64
  },
  {
    "serial_number": "5126010",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 69,
    "volume_number": 1,
    "text": "5 - Then Zainab (1): He married her in Ramadan in the third year of Hijra. Her Kunya: Umm al-Masakin (Mother of the Poor); for her kindness to them. She died in Rabi' al-Akhir under him (as his wife) in the fourth year. He, peace and blessings be upon him, prayed over her, and buried her in Al-Baqi'. She had reached thirty years, or thereabouts. Abd al-Ghani asserted: She stayed with him, peace and blessings be upon him, two or three months. Postscript: None of his wives, peace and blessings be upon him, died in his lifetime other than her, and Khadija. There is disagreement regarding Rayhanah.\n6 - Then Umm Salamah, her name: Hind, and it was said: Ramlah. He married her in Shawwal year four, and consummated marriage in it. This Al-Dimyati asserted. Ibn Abd al-Barr (2): He married her in year two after Badr in Shawwal, and consummated marriage in it. She died in Shawwal year sixty-two in the reign of Muawiyah, and it was said: year fifty-nine in Dhu al-Qa'dah.\n7 - Then Umm Hakim: Zainab bint Jahsh. He, peace and blessings be upon him, married her at the crescent of Dhu al-Qa'dah year four, and it was said: three, and it was said: five. She was thirty-five years old. She is the daughter of his aunt Umaymah. Her name was: Barrah (3), so he named her: Zainab.",
    "foot_note": "1. She is: Zainab bint Khuzaymah bin Al-Harith bin Abdullah bin Amr bin Abd Manaf bin Hilal bin Amir bin Sa'sa'ah. She was called: Umm al-Masakin in Jahiliyyah. See: \"Tabaqat Ibn Sa'd\" (115/ 8), and \"Tarikh al-Tabari\" (214/ 2). \n2. \"Al-Isti'ab\" (45/ 1). \n3. See: \"Sahih Al-Bukhari\" (2289/ 5), and \"Muslim\" (1686/ 3).",
    "book_id": "681",
    "new_page_number": 65
  },
  {
    "serial_number": "5126011",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 70,
    "volume_number": 1,
    "text": "And in it was revealed (1): {SO WHEN ZAYD HAD ACCOMPLISHED} [Al-Ahzab:37]. She used to say: Allah married me. In it the verse of Hijab was revealed. She died in year twenty; she was the first of his wives to join him. In \"Muslim\" (2): He, peace and blessings be upon him, said: «The quickest of you to join me is the one with the longest hand», and she had short hands, he meant: length of charity. She is the first carried on a bier (Na'sh); Asma bint Umays suggested it; she saw it in Abyssinia (3).\n8 - Then Juwayriyah bint Al-Harith: He, peace and blessings be upon him, married her in the sixth year when she was twenty years old. Al-Sha'bi said: The Messenger of Allah, peace and blessings be upon him, freed her and married her. Al-Hasan said: He, peace and blessings be upon him, manumitted her and married her. It was said: Her father paid her ransom, then married her to the Messenger of Allah, peace and blessings be upon him. She died in Rabi' al-Awwal year fifty-six, and it was said: year fifty.\n9 - Then Rayhanah bint Zaid bin Amr bin Khunafah bin Sham'un bin Zaid, from Banu Al-Nadir. Al-Dimyati said: She was married to a man called: Al-Hakam from Banu Qurayzah. She was (4) the chosen share (Safiyy) of the Messenger of Allah, peace and blessings be upon him, from the captives; he gave her choice between Islam,",
    "foot_note": "1. Extracted by Al-Tirmidhi (354/ 5). \n2. \"His Sahih\" (1907/ 4), and \"Al-Bukhari\" (515/ 2). \n3. Famous: That was regarding Fatima - may Allah be pleased with her, as established in sources. \n4. In original: Kana (He was).",
    "book_id": "681",
    "new_page_number": 66
  },
  {
    "serial_number": "5126012",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 71,
    "volume_number": 1,
    "text": "And her religion; she chose Islam; so he freed her and married her. He gave her dowry: twelve Uqiyyahs. They traveled. He consummated marriage with her in Muharram of the sixth year. She became jealous; so he divorced her, then took her back. She died upon his return from the Farewell Hajj, and he buried her in Al-Baqi'. It was said: He used to be intimate with her by right of possession (Milk al-Yamin). He gave her choice; she chose Milk al-Yamin. Al-Dimyati said: The first is more affirmed according to: Muhammad bin Umar (1), and it is according to scholars.\n10 - Then Umm Habibah: Ramlah, and it was said: Hind bint Abi Sufyan Sakhr bin Harb bin Umayyah bin Abd Shams bin Abd Manaf. He, peace and blessings be upon him, sent Amr bin Umayyah Al-Damri to Al-Najashi in Muharram, and it was said: in Rabi' al-Awwal of the seventh year; so he married her to him. The contract executor: Khalid bin Sa'id bin Al-Aas, and it was said: Uthman bin Affan. Al-Najashi gave dowry on his behalf four hundred dinars, and it was said: four thousand dirhams. He sent her with Shurahbil bin Hasana, that was in the seventh year. And it was said: six. And it was said: after her return from Abyssinia he married her. In \"Muslim\" (2): That Abu Sufyan requested the Prophet, peace and blessings be upon him, to marry her; so he answered him to that.",
    "foot_note": "1. Meaning: Al-Waqidi. \n2. \"His Sahih\" (1945/ 4), see following footnote.",
    "book_id": "681",
    "new_page_number": 67
  },
  {
    "serial_number": "5126013",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 72,
    "volume_number": 1,
    "text": "Ibn Al-Athir considered this among errors (1). He prepared her from his own. She died year forty-four, and was buried in Medina, and it was said: in Damascus.\n11 - Then Safiyyah bint Huyayy Al-Nadriyyah from the line of Aaron - peace be upon him. He, peace and blessings be upon him, chose her, freed her, married her, and made her freedom her dowry. She had not reached sixteen years. She died in Ramadan year fifty, and it was said: fifty-two, and it was said: thirty-six. She was buried in Al-Baqi'.\n12 - Then Maymunah bint Al-Harith; her name was: Barrah (2). The Messenger of Allah, peace and blessings be upon him, changed it. Al-Abbas married her to him in Shawwal of the seventh year. She was the maternal aunt of Khalid bin Al-Walid, and Abdullah bin Abbas - may Allah be pleased with them. She died at Sarif year fifty-one, having reached eighty years. And it was said:",
    "foot_note": "1. Because this Hadith is problematic, for Umm Habibah - may Allah be pleased with her - the Prophet, peace and blessings be upon him, married her in year seven, and Abu Sufyan's Islam was the Year of Conquest year eight, as is famous among Imams of Seerah. A group of scholars exerted themselves interpreting the Hadith with many interpretations, some close probable, some very far. Some scholars counted it among narrators' illusions, and that the Hadith is a mistake without hesitation, and Allah knows best. See: \"Sharh Muslim\" by Al-Nawawi, and \"Hashiyat Ibn al-Qayyim 'ala Sunan Abi Dawood\" (76/ 6). \n2. See: \"Sahih Muslim\" (1687/ 3).",
    "book_id": "681",
    "new_page_number": 68
  },
  {
    "serial_number": "5126014",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 73,
    "volume_number": 1,
    "text": "Year sixty-three, and it was said: sixty-six.\nNotice: His wives with whom marriage was consummated: twelve women. He died leaving nine of them. The order mentioned regarding them is what Al-Mundhiri and his student Al-Dimyati are upon.\n\n29 - His Concubines (1), peace and blessings be upon him:\n1 - Mariya: Died year ten, and it was said: fifteen. Umar - may Allah be pleased with him - prayed over her, and she was buried in Al-Baqi'.\n2 - Rayhanah: According to Al-Baghawi: He took her captive, then freed her; so she joined her family, which is incorrect.\nAnd others:\n3 - Jamilah; acquired in captivity.\n4 - And a slave girl gifted to him by Zainab bint Jahsh.\nQatada: He, peace and blessings be upon him, had two slave girls: Mariya and Rayhanah. Some [say]: Rabihah Al-Quraziyyah.\n\n30 - His Servants, peace and blessings be upon him:\n1 - Abu Hamza Anas bin Malik Al-Ansari.\n2 - And Rabi'ah bin Ka'b Al-Aslami.",
    "foot_note": "1. See: \"Al-Mustadrak\" (41/ 4), (45/ 4), \"Ansab al-Ashraf\" (448/ 1 - 454), \"Tabaqat Ibn Sa'd\" (212/ 8), (129/ 8), \"Tarikh al-Tabari\" (214/ 2), and \"Sirat Ibn Sayyid al-Nas\" (394/ 2 - 395).",
    "book_id": "681",
    "new_page_number": 69
  },
  {
    "serial_number": "5126015",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 74,
    "volume_number": 1,
    "text": "3 - And Abdullah bin Mas'ud, he was the keeper of his shoes.\n4 - And Uqbah bin Amir Al-Juhani, he was the keeper of his mule.\n5 - And Asla' bin Sharik, he was the keeper of his mount.\n6 - 7 - Bilal the Mu'adhin, and Sa'd: freed slaves of Abu Bakr.\n8 - And Abu Al-Hamra' (1).\n9 - And Dhu Mikhmar (2), and it is said: Mukhaymir son of Al-Najashi's brother, and it was said: his sister's son.\n10 - And Bukayr (3).\n11 - And Abu Dharr Al-Ghifari.\n12 - And Muhajir.\n\n31 - His Freed Slaves (Mawali), peace and blessings be upon him:\nAmong them (4):\n1 - Zaid bin Haritha bin Shurahbil.",
    "foot_note": "1. Famous by his Kunya, his name is: Hilal bin Al-Harith, and it is said: Hilal bin Zafar. See: \"Al-Isti'ab\" (1633/ 4), Al-Isabah (548/ 6). \n2. See: \"Al-Isti'ab\" (475/ 2), and \"Al-Isabah\" (417/ 2), in it: He came to the Prophet, peace and blessings be upon him, served him, then settled in Sham. In \"Nuzhat Al-Albab\" (309/ 1): \"Dhu Mikhmar, and it is said: with Ba instead of Mim, son of Al-Najashi's brother, said his name is: Yazid\". \n3. Al-Hafiz Ibn Hajar said in \"Al-Isabah\" (324/ 1): \"Bakr bin Al-Shaddakh Al-Laythi, and he is called: Bukayr\". \n4. See: \"Ansab al-Ashraf\" (467/ 1 - 485), \"Tarikh al-Tabari\" (216/ 2 - 218), \"Sirat Ibn Sayyid al-Nas\" (397/ 2), and \"Zad al-Ma'ad\" (114/ 1 - 116), and they mentioned others.",
    "book_id": "681",
    "new_page_number": 70
  },
  {
    "serial_number": "5126016",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 75,
    "volume_number": 1,
    "text": "2 - And his son: Usama.\n3 - And his brother from mother: Ayman.\n4 - And Aslam bin Ubayd.\n5 - And Abu Rafi'.\n6 - And Abu Kabsha.\n7 - And Thawban bin Bajdad.\n8 - And Rabah.\n9 - And Yasar; killed by the Uraniyyin (1).\n10 - 11 - And Fadalah.\n12 - And Abu Al-Samh.\n13 - And Rafi'.\n14 - And Ma'bur the Eunuch.\n15 - And Karkarah.",
    "foot_note": "1. Muslim extracted in his Sahih (1296/ 3) from Anas bin Malik: That people from Uraynah came to the Messenger of Allah, peace and blessings be upon him, in Medina, and the climate did not suit them. The Messenger of Allah, peace and blessings be upon him, said to them «If you wish, go out to the camels of charity, and drink from their milk and urine», so they did, and became healthy. Then they attacked the shepherds, killed them, apostatized from Islam, and drove away the camels of the Messenger of Allah, peace and blessings be upon him. That reached the Prophet, peace and blessings be upon him, so he sent in their pursuit. They were brought, so he cut their hands and feet, cauterized their eyes, and left them in the Harrah, until they died.",
    "book_id": "681",
    "new_page_number": 71
  },
  {
    "serial_number": "5126017",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 76,
    "volume_number": 1,
    "text": "16 - And Tahman or Kaysan or Dhakwan or Marwan, and it was said also: Maymun.\n17 - And Badham.\n18 - And Hurmuz.\n19 - And Abu Lubabah.\n*From Women: Among them (1):\n1 - Umm Ayman.\n2 - And Mariya.\n3 - And Rayhanah.\n4 - And Rabihah.\n5 - And Khadrah (2).\n6 - And Radwa.\n7 - And Maymunah bint Abi Asib.\n8 - And Umm Damirah.",
    "foot_note": "1. See: \"Ansab al-Ashraf\" (485/ 1), \"Sirat Ibn Sayyid al-Nas\" (398/ 2 - 399), and \"Zad al-Ma'ad\" (116/ 1). \n2. In original: Khadirah, which is a mistake, correct is what I established as in sources, and Allah knows best.",
    "book_id": "681",
    "new_page_number": 72
  },
  {
    "serial_number": "5126018",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 77,
    "volume_number": 1,
    "text": "32 - His Scribes (1), peace and blessings be upon him:\n1 - Abu Bakr.\n2 - And Umar.\n3 - And Uthman.\n4 - And Ali.\n5 - And Amir bin Fuhayrah.\n6 - 7 - 8 - And Khalid, Aban, and Sa'id sons of Al-Aas.\n9 - And Abdullah bin Al-Arqam.\n10 - And Hanzalah, he was the substitute for any scribe absent [from] his work.\n11 - And Ubayy bin Ka'b, he is the first who wrote for him.\n12 - And Thabit bin Qais.\n13 - And Zaid bin Thabit.\n14 - And Shurahbil.\n15 - 16 And Muawiyah, and his brother Yazid.\n17 - [And Khalid] (2) bin Al-Walid.",
    "foot_note": "1. See: \"Tarikh al-Tabari\" (218/ 2), \"Sirat Ibn Sayyid al-Nas\" (401/ 2), and \"Zad al-Ma'ad\" (117/ 1). \n2. Fell from the original.",
    "book_id": "681",
    "new_page_number": 73
  },
  {
    "serial_number": "5126019",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 78,
    "volume_number": 1,
    "text": "18 - And Amr bin Al-Aas.\n19 - And Abdullah bin Rawaha.\n20 - And Muhammad bin Maslamah.\n21 - And Mu'ayqib.\n22 - And Abu Ayyub.\n23 - And Jahm.\n24 - And Juhaym.\n25 - And Hudhayfah bin Al-Yaman.\n26 - And Abdullah bin Sa'd, Al-Waqidi said: He is the first to write for him from Quraysh, then apostatized, then embraced Islam.\n27 - And Abu Maslamah.\n28 - And Huwaytib.\n29 - And Abu Sufyan.\n30 - And Hatib bin Amr.\nIbn Hazm: Muawiyah and Zaid bin Thabit were the only ones adhering to writing before the Messenger of Allah, peace and blessings be upon him, in Revelation and others, having no work (1) other than that.",
    "foot_note": "1. In original: Lahu (For him).",
    "book_id": "681",
    "new_page_number": 74
  },
  {
    "serial_number": "5126020",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 79,
    "volume_number": 1,
    "text": "33 - His Messengers, peace and blessings be upon him:\n1 - The first of them: Amr bin Umayyah; he, peace and blessings be upon him, sent him to Al-Najashi, his name: Ashamah bin Abjar, meaning: Gift. He wrote him two letters, inviting him in one: to Islam; he placed it on his eyes, descended from his throne, sat on the ground, embraced Islam, testified the testimony of truth, and said: If I could come to him I would. In the other: To marry him to Umm Habibah, and send those with him of the Companions, and carry them. He did so, and called for an ivory box; placed the two letters of the Prophet, peace and blessings be upon him, in it, and said: Abyssinia will not cease to be in good as long as these two letters are among them (1).\n2 - And Dihyah bin Khalifah Al-Kalbi [to Caesar King of Rome, his name: Heraclius] (2), he intended Islam; but the Romans did not agree; so he withheld fearing for his kingdom from them (3).",
    "foot_note": "1. This is Ibn Sa'd's opinion in his \"Tabaqat\" (258/ 1). Ibn al-Qayyim transmitted in \"Zad al-Ma'ad\" (120/ 1) from Ibn Hazm: That this Najashi to whom the Prophet, peace and blessings be upon him, sent Amr bin Umayyah did not embrace Islam, rather the one who embraced Islam was another. \n2. What is between brackets fell from the original. \n3. In \"Sahih Al-Bukhari\" (10/ 1): That he said: O assembly of Romans! Do you want success, guidance, and your kingdom to remain established, so you pledge allegiance to this Prophet? They bolted like wild donkeys to the doors, finding them locked. When Heraclius saw their aversion, and despaired of faith, he said: Bring them back to me, and said: I said my statement just now to test your firmness on your religion, and I have seen. So they prostrated to him, and were pleased with him. That was the last of Heraclius's affair.",
    "book_id": "681",
    "new_page_number": 75
  },
  {
    "serial_number": "5126021",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 80,
    "volume_number": 1,
    "text": "3 - And Abdullah bin Hudhafah Al-Sahmi to Kisra, his name: Aparviz bin Hormizd; he tore the letter; so the Prophet, peace and blessings be upon him, said: «Allah tore his kingdom» (1), and so it was.\n4 - And Hatib bin Abi Balta'ah Al-Lakhmi to Al-Muqawqis, his name: Jurayj bin Mina, King of Alexandria and Egypt, Grand of Copts. He spoke good, came close, did not embrace Islam, gave a gift (2).\n5 - And Shuja' bin Wahb Al-Asadi to Al-Harith bin Abi Shamir Al-Ghassani King of Al-Balqa'.\n6 - And Salit bin Amr Al-Amiri to Hawdhah (3) bin Ali Al-Hanafi. Ibn Hazm: Sent him to him, and to Thumamah (4) after that.",
    "foot_note": "1. See: \"Sahih Al-Bukhari\" (36/ 1), \"Al-Tabaqat\" by Ibn Sa'd (260/ 1), and \"Tarikh al-Tabari\" (133/ 2). \n2. Ibn al-Qayyim said in \"Zad al-Ma'ad\" (122/ 1): \"He gifted the Prophet Mariya, and her two sisters: Sirin and Qaysara. He took Mariya as concubine, gave Sirin to Hassan bin Thabit. He gifted him another girl, a thousand mithqals of gold, twenty garments of Egyptian Coptic cloth, a gray mule: Duldul, a gray donkey: Ufayr, a eunuch boy called: Mabur, and it was said: he is Mariya's cousin, a horse: Al-Lazzaz, a glass cup, and honey. The Prophet said: The wicked one was stingy with his kingdom, and there is no permanence for his kingdom\". \n3. Written in original: Sawda. \n4. Ibn al-Qayyim said in \"Zad al-Ma'ad\" (122/ 1): \"Thumamah bin Uthal Al-Hanafi. Hawdhah did not embrace Islam, and Thumamah embraced Islam after that\". In \"Al-Bukhari\" (1589/ 4), from Abu Huraira - may Allah be pleased with him, said: Then the Prophet, peace and blessings be upon him, sent cavalry towards Najd, they came with a man from Banu Hanifa called: Thumamah bin Uthal, they tied him-",
    "book_id": "681",
    "new_page_number": 76
  },
  {
    "serial_number": "5126022",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 81,
    "volume_number": 1,
    "text": "7 - And Amr bin Al-Aas in Dhu al-Qa'dah year eight to Jayfar and Abd sons of Al-Julanda, from Azd [Kings of Oman] (1), and the King is Jayfar; so they embraced Islam.\n8 - And Al-Ala' bin Al-Hadrami to Al-Mundhir bin Sawa Al-Abdi King of Bahrain upon his return from Al-Ji'ranah, and it was said: before the Conquest; so he embraced Islam.\n9 - And Al-Muhajir bin Abi Umayyah Al-Makhzumi to Al-Harith bin Abd Kulal Al-Himyari.",
    "foot_note": "1. = to a pillar of the mosque pillars. The Prophet, peace and blessings be upon him, came out to him and said: «What do you have, O Thumamah?» He said: I have good, O Muhammad. If you kill, you kill one with blood (avenged), if you are gracious, you are gracious to a grateful one, if you want money, ask from it what you wish. He was left until the next day. Then he said to him: «What do you have, O Thumamah?» He said: What I told you: If you are gracious, you are gracious to a grateful one. He left him until the day after. He said: «What do you have, O Thumamah?» He said: I have what I told you. He said: «Release Thumamah». He went to a palm grove near the mosque, washed, then entered the mosque and said: I bear witness that there is no god but Allah, and I bear witness that Muhammad is the Messenger of Allah. O Muhammad! By Allah! There was no face on earth more hateful to me than your face, so your face became the most beloved of faces to me. By Allah! There was no religion more hateful to me than your religion, so your religion became the most beloved religion to me. By Allah! There was no land more hateful to me than your land, so your land became the most beloved land to me. Your cavalry took me while I wanted Umrah, so what do you see? The Messenger of Allah, peace and blessings be upon him, gave him glad tidings, and ordered him to perform Umrah. When he arrived in Mecca, someone said to him: You apostatized (Sabuta). He said: No, but I embraced Islam with Muhammad, Messenger of Allah, peace and blessings be upon him. No, by Allah, not a grain of wheat will come to you from Yamama until the Prophet, peace and blessings be upon him, permits it». \n1. Disorder in original, correction from \"Tabaqat Ibn Sa'd\" (262/ 1), \"Tarikh al-Tabari\" (145/ 2), and other sources.",
    "book_id": "681",
    "new_page_number": 77
  },
  {
    "serial_number": "5126023",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 82,
    "volume_number": 1,
    "text": "10 - 11 - And Abu Musa Al-Ash'ari, and Mu'adh bin Jabal to Yemen upon his return from Tabuk, and it was said: in Rabi' al-Awwal year ten; so the generality of its people and their kings embraced Islam obediently.\n\n34 - His Mu'adhins, peace and blessings be upon him:\n1 - [Bilal] (1) bin Rabah.\n2 - And Amr bin Umm Maktum (2).\n3 - And Abu Mahdhurah Aws bin Mughira Al-Jumahi.\n4 - And Sa'd Al-Qaraz.\nNotice: The first two in Medina, and the last two in Quba.\n\n35 - His Emirs (Governors), peace and blessings be upon him:\n1 - 2 - Badhan, also called: Badham bin Sasan bin Balash son of King Jamasp son of King Firuz son of King Yazdegerd son of King Bahram Gur: over all of Yemen. Then his son Shahr: over Sana'a.\n3 - And Al-Muhajir bin Umayyah: Kinda and Al-Sadaf.\n4 - And Ziyad bin Labid: Hadramout.\n5 - And Abu Musa Al-Ash'ari: Zabid, Aden, and the Coast.\n6 - And Mu'adh bin Jabal: Al-Janad.",
    "foot_note": "1. Dropped by copyist. \n2. Written in original: Kulthum, which is wrong.",
    "book_id": "681",
    "new_page_number": 78
  },
  {
    "serial_number": "5126024",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 83,
    "volume_number": 1,
    "text": "7 - And Attab bin Asid: Over Mecca, establishing the season, and Hajj with Muslims year eight, being under twenty, and it was said: twenty-one years.\n8 - And Abu Sufyan: Over Najran.\n9 - And Yazid bin Abi Sufyan: Over Tayma.\n10 - And Khalid bin Sa'id: Over Sana'a, killed after Shahr (1); killed by Al-Aswad Al-Ansi the Liar.\n11 - And his brother Amr: Over Wadi al-Qura.\n12 - And their brother Al-Hakam: Over villages of Uraynah, which are Fadak and others.\n13 - And their brother Aban: Over Medina al-Ula in Bahrain.\n14 - And Al-Ala' bin Al-Hadrami: Over Al-Qatif in Bahrain.\n15 - And Amr bin Al-Aas: Over Oman and its works.\n16 - And Uthman bin Abi Al-Aas Al-Thaqafi: Over Ta'if.\n17 - And Ali bin Abi Talib (2): Over the fifths (Khums) in his presence, and over the fifths in Yemen, and judiciary.\n18 - And Adi bin Hatim: Over charities of Banu Asad and Tayy.\n19 - And Abu Bakr: Over Hajj season year nine.",
    "foot_note": "1. i.e., Shahr bin Badhan, mentioned earlier. \n2. Unclear in original, correction from sources.",
    "book_id": "681",
    "new_page_number": 79
  },
  {
    "serial_number": "5126025",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 84,
    "volume_number": 1,
    "text": "36 - His Weapons (1), peace and blessings be upon him:\n* Nine Swords:\n1 - Ma'thur, which is the first sword he owned, inherited from his father.\n2 - And Al-'Adb.\n3 - And Dhu Al-Faqar from spoils of Badr (2), and it was said: Al-Hajjaj bin Ilat gifted it to him. He never parted with it.\n4 - And Al-Qala'i (3).\n5 - And Al-Battar.\n6 - And Al-Hatf.\n7 - And Al-Rasub.\n8 - And Al-Mikhdham.\n9 - And Al-Qadib.\n&",
    "foot_note": "1. See: \"Ansab al-Ashraf\" (523/ 1), \"Tabaqat Ibn Sa'd\" (485/ 1), \"Tarikh al-Tabari\" (220/ 2), \"Sirat Ibn Sayyid al-Nas\" (405/ 2), and \"Zad al-Ma'ad\" (130/ 1). \n2. Extracted by Al-Tirmidhi from Ibn Abbas (130/ 4), called Dhu Al-Faqar: because in its middle were like vertebrae of the back engraved on its blade. \n3. Al-Hafiz said in \"Al-Fath\" (96/ 6): \"Al-Qala'ah: A place in the desert to which it is attributed, and swords are attributed to it too, so called: Qala'iyyah swords\".",
    "book_id": "681",
    "new_page_number": 80
  },
  {
    "serial_number": "5126026",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 85,
    "volume_number": 1,
    "text": "*And Seven Coats of Mail (Adra'):\n1 - Dhat Al-Fudul.\n2 - And Dhat Al-Wishah.\n3 - And Dhat Al-Hawashi.\n4 - And Al-Sughdiyyah, it was said: It was David's mail he wore when he killed Goliath.\n5 - And Fiddah.\n6 - And Al-Batra'.\n7 - And Al-Khirniq (1).\nBranch: On him on the day of Uhud were: Dhat Al-Fudul and Fiddah. On the day of Hunayn: Dhat Al-Fudul and Al-Sughdiyyah.\n\n*And Six Bows:\n1 - Al-Zawra'.\n2 - And Al-Rawha'.\n3 - And Al-Safra'.\n4 - And Al-Bayda'.\n5 - And Al-Katum, broken on the day of Uhud.",
    "foot_note": "1. In original: Al-Jarlaq, which is a mistake. Correct is what I established as in sources. Al-Khirniq: Young rabbit. See: (entry: Khirniq) in \"Lisan al-Arab\" by Ibn Manzur.",
    "book_id": "681",
    "new_page_number": 81
  },
  {
    "serial_number": "5126027",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 86,
    "volume_number": 1,
    "text": "6 - And the sixth a rectangular bow (1); mentioned by some.\n*And he had a quiver, and a belt of tanned leather with three silver rings, buckle, and edge.\n*And Three Shields:\n1 - Al-Zaluq.\n2 - And Al-Fataq.\n3 - And a shield gifted to him with image of an eagle or ram; he put his hand on it; so Allah removed it.\n*And Three Spears:\n1 - Spear called: Al-Mathwi.\n2 - And spear called: Al-Munthani (2).\n*And a large lance: Al-Bayda'. And a small lance less than a spear like a staff, called: Al-Anazah, it was said: He took it from Al-Zubayr, and Al-Zubayr from Al-Najashi (3). And another Anazah. And a lance called: Al-Nab'ah.",
    "foot_note": "1. Its name: Al-Sadad, extracted by Al-Tabarani in \"Al-Mu'jam Al-Kabir\" (111/ 11), but the Hadith's chain contains: Ali bin Urwah, who is Matruk. \n2. See: \"Tabaqat Ibn Sa'd\" (489/ 1), \"Sirat Ibn Sayyid al-Nas\" (406/ 2), and \"Subul al-Huda wa al-Rashad\" (370/ 7). \n3. At Ibn Sayyid al-Nas (406/ 2): (Al-Muthni), and likewise in \"Zad al-Ma'ad\" (131/ 1). \n4. See: \"Tabaqat Ibn Sa'd\" (249/ 1).",
    "book_id": "681",
    "new_page_number": 82
  },
  {
    "serial_number": "5126028",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 87,
    "volume_number": 1,
    "text": "And he had a helmet of iron, crushed on his honorable head on the day of Uhud, and another. And a baton called: Al-Arjun. And a rod of Shawhat called: Al-Mamshuq (1). And a Hirawah, which is: The Staff.\nAnd a black banner called: Al-Uqab. And white flags (2), and perhaps black was put in it. Perhaps they were from the headcovers of his wives - may Allah be pleased with them. And a dusty flag. It was narrated from the Hadith of Ibn Abbas (3): That written on his banner: La ilaha illa Allah Muhammadun Rasulullah.",
    "foot_note": "1. See \"Sirat Ibn Kathir\" (715/ 4), and \"Subul al-Huda wa al-Rashad\" (114/ 6), he said: \"Shawhat: with Fatha on dotted Shin, Sukun on Waw, Fatha on Ha and undotted Ta, a type of mountain tree from which bows are made\". See: \"Al-Nihaya\" by Ibn Al-Athir (508/ 2). \n2. Ibn Majah extracted in his \"Sunan\" (914/ 2) with Hasan chain, from Ibn Abbas, said: The banner of the Messenger of Allah, peace and blessings be upon him, was black, and his flag white. \n3. The Hadith extracted by Ibn Adi in \"Al-Kamil fi Du'afa' Al-Rijal\" (240/ 2), in biography of: Hammad bin Abi Hamid, who is Muhammad bin Abi Hamid, and said: Hammad is a nickname, Abu Ibrahim Al-Zuraqi Al-Ansari Al-Madani. He quoted Yahya bin Ma'in saying: His hadith is nothing. Also quoted Al-Bukhari saying: Munkar al-Hadith. Ibn Hajar said in \"Al-Fath\" (127/ 6): And for Abu Al-Sheikh from hadith of Ibn Abbas: Written on his banner was: La ilaha illa Allah Muhammadun Rasulullah, and its chain is weak. Indicated by author saying: Yurowa (It is narrated); i.e., conveyed in weak form.",
    "book_id": "681",
    "new_page_number": 83
  },
  {
    "serial_number": "5126029",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 88,
    "volume_number": 1,
    "text": "37 - His Clothing, peace and blessings be upon him:\nHe had a turban called: Al-Sahab; he clothed Ali with it (1). And his Rida' (cloak) called: Al-Fath, he entered the Day of Conquest (2) wearing a black turban, and preached like that. He used to hang his turban between his shoulders, turn it, and tuck it behind him. From Anas (3): His shirt was cotton, short in length, short-sleeved. From Jabir (4): He used to wear his red Burd (cloak) on the two Eids, and Friday. He, peace and blessings be upon him, had a cloth he wiped with when he performed ablution (5). He had two green Burds, a black Kisa', a waist-wrapper (Izar) five spans long, and a saffron-dyed quilt. The most beloved clothes to him: The shirt (Qamis), white clothes, and Hibarah (striped Yemeni cloth).",
    "foot_note": "1. Ibn al-Qayyim said in \"Zad al-Ma'ad\" (135/ 1): \"He had a turban called: Al-Sahab, he clothed Ali with it. He used to wear it, and wear a cap (Qalansuwah) under it. He used to wear a cap without a turban, and wear a turban without a cap. When he turbaned, he hung his turban between his shoulders\". \n2. See: \"Sahih Muslim\" (990/ 2). \n3. Extracted by: Ibn Sa'd in his \"Tabaqat\" (458/ 1). \n4. Extracted by: Ibn Sa'd in his \"Tabaqat\" (451/ 1). \n5. Al-Tirmidhi (74/ 1) extracted from Aisha - may Allah be pleased with her, said: The Messenger of Allah, peace and blessings be upon him, had a cloth he dried with after ablution. He said after it: Aisha's hadith is not established, and nothing authentic from the Prophet, peace and blessings be upon him, exists on this subject.",
    "book_id": "681",
    "new_page_number": 84
  },
  {
    "serial_number": "5126030",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 89,
    "volume_number": 1,
    "text": "He wore at a time a Jubbah with tight sleeves (1), and at a time: a Qaba' (outer garment). He took a ring of silver, its stone from it, its engraving: Muhammad Rasulullah; he wore it on the right little finger, and perhaps on the left, putting the stone towards the palm (2). Postscript: Engraving of Abu Bakr's ring: Ni'ma Al-Qadir Allah. Umar: Idhkur Al-Mawt Ya Umar. Uthman: Billah Al-Azim. Ali: Allah Al-Malik. Muawiyah and his son Yazid: La Quwwata Illa Billah. Umar bin Abd al-Aziz: Umar Yu'minu Billah Mukhlisan, said Al-Kalbi.\nAl-Najashi gifted him two plain black leather socks (Khuffayn); he wore them and wiped over them. He had four pairs of Khuffs obtained from Khaybar. He had two Sa'diyyah sandals. A mattress of leather stuffed with palm fiber. Hafsa was asked: What was the mattress of the Messenger of Allah, peace and blessings be upon him? She said: A sackcloth we folded twice, and he slept on it. And he prayed. He, peace and blessings be upon him, had a tent called: Al-Kinn. A cup called: Al-Rayyan. And another chained. A stone vessel called: Al-Mikhdab. And a brass vessel",
    "foot_note": "1. It is: A Levantine Jubbah he, peace and blessings be upon him, used to wear in his travels as Al-Bukhari (2185/ 5) and Muslim (229/ 1) transmitted from him. \n2. See: \"Al-Bukhari\" (2203/ 5), and \"Muslim\" (1656/ 3).",
    "book_id": "681",
    "new_page_number": 85
  },
  {
    "serial_number": "5126031",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 90,
    "volume_number": 1,
    "text": "containing henna. A water skin called: Al-Sadirah. An oil container. A comb of ivory, it was said: It is Al-Dabl. A Kohl container. Scissors. Siwak. A bowl called: Al-Ghabra', carried by four. A Sa' (measure). A Mudd (measure). A velvet cloth. A bed whose legs were of teak.\n\n38 - His Mounts, peace and blessings be upon him:\n* From Horses:\n1 - Al-Sakb (1), the first horse he owned (2).\n2 - Al-Murtajiz (3) - Ashhab (grey): Khuzaimah testified for him; so he made his testimony equal to two men. It was said: It is Al-Taraf. It was said: It is Al-Najib.\n3 - And Al-Lahif (4).\n4 - And Al-Lazzaz.",
    "foot_note": "1. Likened to pouring water and its flow, for its speed. \n2. The Prophet, peace and blessings be upon him, bought it from a Bedouin for ten Uqiyyahs. It was called: Al-Daris, so the Prophet, peace and blessings be upon him, changed it; it was the first he raided upon at Uhud. The Muslims had no horse that day other than it, and a horse for Abu Burdah bin Niyar. See: \"Ansab al-Ashraf\" (509/ 1), and \"Tabaqat Ibn Sa'd\" (489/ 1). \n3. Ibn Sayyid al-Nas said (409/ 1): Named so for the beauty of its neighing, as if reciting Rajaz poetry. \n4. In \"Al-Bukhari\" (1049/ 3), from hadith of Abbas bin Sahl, from his father, from his grandfather, said: Then the Prophet, peace and blessings be upon him, had a horse in our garden called: Al-Lahif. Abu Abdullah said: Some said: Al-Lakhif; i.e., with Kha.",
    "book_id": "681",
    "new_page_number": 86
  },
  {
    "serial_number": "5126032",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 91,
    "volume_number": 1,
    "text": "5 - And Al-Zharib.\n6 - And Sabhah (1).\n7 - And Al-Ward; these are agreed upon (2).\n*And he had:\n8 - Al-Ablaq.\n9 - And Dhu Al-Iqal.\n10 - And Dhu Al-Limmah.\n11 - And Al-Murtajil.\n12 - And Al-Mirwah.\n13 - And Al-Sarhan.\n14 - And Al-Ya'sub.\n15 - And Al-Ya'bub.\n16 - And Al-Bahr.",
    "foot_note": "1. Ibn Sa'd mentioned it in his \"Tabaqat\" (490/ 1): Sayhah - with Ya -; where he narrated from Anas bin Malik, said: The Messenger of Allah, peace and blessings be upon him, bet on a horse called: Sayhah; it came first, so he was delighted and pleased. \n2. i.e., The seven previously mentioned: Al-Sakb, Al-Murtajiz, Al-Lahif, Al-Lazzaz, Al-Zharib, Sabhah, and Al-Ward. Al-Dhahabi transmitted that in the Sirah from his \"Tarikh\" (519), from his Sheikh Al-Dimyati, then transmitted from him that he: mentioned after them fifteen horses disputed upon, and said: We explained them in the book: \"Al-Khayl\".",
    "book_id": "681",
    "new_page_number": 87
  },
  {
    "serial_number": "5126033",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 92,
    "volume_number": 1,
    "text": "17 - And Al-Adham.\n18 - And Al-Shajja'.\n19 - And Al-Sijl.\n20 - And Malawih.\n21 - And Al-Taraf.\n22 - And Al-Najib.\n*From Mules:\n1 - Duldul, the first mule ridden in Islam, gifted to him by Al-Muqawqis (1).\n2 - And Fiddah (2).",
    "foot_note": "1. See: \"Tarikah al-Nabi, peace and blessings be upon him\" by Hammad bin Ishaq bin Ismail Al-Azdi: (99), \"Tabaqat Ibn Sa'd\" (134/ 1), and \"Tarikh al-Tabari\" (141/ 2). \n2. It is the mule gifted to him by Farwah Al-Judhami, who was an agent for the Romans on the adjacent Arab lands, his home was in Ma'an. He embraced Islam. When the Romans knew, they sought him, took him, and beheaded him, as Ibn Sa'd mentioned in \"Al-Tabaqat\" (355/ 1). He, peace and blessings be upon him, was riding it in the battle of Hunayn. As Muslim extracted in his \"Sahih\" (1398/ 3): From Al-Abbas - may Allah be pleased with him, said: \"I witnessed with the Messenger of Allah, peace and blessings be upon him, the day of Hunayn. I and Abu Sufyan bin Al-Harith bin Abd al-Muttalib stuck to the Messenger of Allah, peace and blessings be upon him, and did not leave him. The Messenger of Allah, peace and blessings be upon him, was on a white mule of his gifted to him by Farwah bin Nufathah Al-Judhami. When Muslims and disbelievers met; Muslims turned fleeing. The Messenger of Allah, peace and blessings be upon him, started spurring his mule towards the disbelievers. Al-Abbas said: I was holding the bridle of the Messenger of Allah's mule,-",
    "book_id": "681",
    "new_page_number": 88
  },
  {
    "serial_number": "5126034",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 93,
    "volume_number": 1,
    "text": "3 - And a grey mule.\n4 - And another.\n*From Donkeys:\n1 - Ufayr, gifted to him by Al-Muqawqis (1).\n2 - Ashhab.\n3 - And Ya'fur.\n*From Camels:\n1 - The she-camel he migrated on, named: Al-Adba'. Muhibb al-Din Al-Tabari said: The Prophet, peace and blessings be upon him, did not bear revelation when it descended upon him",
    "foot_note": "1. = holding it back so it wouldn't speed up, and Abu Sufyan holding the stirrup of the Messenger of Allah, peace and blessings be upon him. The Messenger of Allah, peace and blessings be upon him, said: «O Abbas! Call the people of Al-Samurah (Tree)». Abbas said - and he was a loud-voiced man - so I said at the top of my voice: Where are the people of Al-Samurah? He said: By Allah! It was as if their turning when they heard my voice was the turning of cows to their calves. They said: Ya Labbayk Ya Labbayk. He said: They fought the disbelievers. The call was among the Ansar saying: O Assembly of Ansar! O Assembly of Ansar! He said: Then the call was restricted to Banu Al-Harith bin Al-Khazraj, saying: O Banu Al-Harith bin Al-Khazraj! O Banu Al-Harith bin Al-Khazraj! The Messenger of Allah, peace and blessings be upon him, looked while on his mule stretching up on it towards their fighting. The Messenger of Allah, peace and blessings be upon him, said: «This is when the oven heated up (battle intensified)». He said: Then the Messenger of Allah, peace and blessings be upon him, took pebbles; and threw them at the faces of the disbelievers, then said: «Be defeated by the Lord of Muhammad». He said: I went to look; and the fighting was as it was, as I saw. He said: By Allah! It was only that he threw them with his pebbles; that I kept seeing their edge blunted, and their affair retreating». \n1. See: \"Tabaqat Ibn Sa'd\" (491/ 1), and \"Tarikh al-Tabari\" (141/ 2).",
    "book_id": "681",
    "new_page_number": 89
  },
  {
    "serial_number": "5126035",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 94,
    "volume_number": 1,
    "text": "On other than her. He bought her for four hundred dirhams (1). She is Al-Qaswa'.\n2 - And Al-Jad'a', she is the one that was outraced. The Prophet, peace and blessings be upon him, said: «It is a right upon Allah that He does not raise anything of this world except He lowers it» (2). It was said: The outraced one is another. It was said: They are three.\n3 - And he, peace and blessings be upon him, stood in the Farewell Hajj on a red camel.\n4 - And he had a camel called: Al-Tha'lab (3). A camel was gifted to him on the day of Hudaybiyah (4).\nHe had twenty milk-camels (Liqhah) (5), tended by Yasar at Dhu Al-Jadar (6),",
    "foot_note": "1. In \"Ansab al-Ashraf\" (511/ 1): \"Abu Bakr - may Allah be pleased with him - bought it for four hundred dirhams, and the Prophet, peace and blessings be upon him, took it from him for that price. It is established that he gifted it, and he accepted, and migrated on it\". \n2. Extracted by Al-Bukhari in \"His Sahih\" (1053/ 3), Al-Nasa'i (227/ 6), Abu Ya'la in \"His Musnad\" (90/ 6), Al-Bayhaqi in \"Al-Kubra\" (16/ 10), all from the hadith of Anas, with it. The she-camel that was outraced: Is Al-Adba' as they mentioned, not Al-Jad'a', as the author mentioned. \n3. The Prophet, peace and blessings be upon him, sent Kharash bin Umayyah to Quraysh on the day of Hudaybiyah on this camel. Quraysh harmed him and hamstrung his camel. See: \"Al-Isti'ab\" by Ibn Abd al-Barr (445/ 2). \n4. Abu Dawood extracted in his \"Sunan\" (145/ 2) from Ibn Abbas - may Allah be pleased with him: That the Messenger of Allah, peace and blessings be upon him: gifted in the year of Hudaybiyah among the sacrificial animals of the Messenger of Allah, peace and blessings be upon him, a camel that belonged to Abu Jahl with a silver nose ring in its head, angering thereby the polytheists, gained by the Prophet, peace and blessings be upon him, on the day of Badr. \n5. See: \"Tabaqat Ibn Sa'd\" (495/ 1), and \"Sirat Ibn Sayyid al-Nas\" (411/ 2). \n6. Written in original: \"Al-Jadal\", which is a mistake. What I established is correct. Dhu Al-Jadar-",
    "book_id": "681",
    "new_page_number": 90
  },
  {
    "serial_number": "5126036",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 95,
    "volume_number": 1,
    "text": "And seven milk-camels at Dhu Al-Jadar also, and a milk-camel named: Marwah. And a hundred sheep (1), and a sheep called: Ghawthah, and it was said: Ghaythah, and a sheep called: Qamar. And a goat called: Al-Yaman, and seven Manaih (milk-goats lent for milking) tended by Umm Ayman, and a white rooster.\n\n39 - His Death, peace and blessings be upon him:\nThe pain he died of started in the house of Maymunah (2), and it was said: in the house of",
    "foot_note": "1. = is: Sheep pasture six miles from Medina, in the area of Quba. Said by Al-Salihi in \"Subul al-Huda wa al-Rashad\" (30/ 6). \n1. Imams Ahmad (211/ 4) and Abu Dawood (35/ 1) extracted from Laqit bin Sabrah, said: I was the delegate of Banu Al-Muntafiq, or in the delegation of Banu Al-Muntafiq to the Messenger of Allah, peace and blessings be upon him. He said: When we came to the Messenger of Allah, peace and blessings be upon him, we did not find him in his house, and met Aisha Mother of Believers. He said: She ordered Khazirah (meat soup) for us, so it was made for us. He said: And we were brought a Qina', and Qutayba did not say: Al-Qina', and Al-Qina' is the tray with dates. Then the Messenger of Allah, peace and blessings be upon him, came and said: «Did you get anything? Or was anything ordered for you?». He said: We said: Yes, O Messenger of Allah. He said: While we were sitting with the Messenger of Allah, peace and blessings be upon him, the shepherd drove his sheep to the pen, and with him was a bleating kid. He said: «What did she give birth to, O so-and-so?». He said: A female kid. He said: «Slaughter a sheep for us in its place». Then he said: «Do not think, and he did not say La tahsabanna, that we slaughtered it for your sake. We have a hundred sheep we do not want to increase. So if the shepherd brings a female kid, we slaughter a sheep in its place». See: \"Sirat Ibn Sayyid al-Nas\" (411/ 2). \n2. This is narrated in the Sahih as Muslim extracted (312/ 1), from Aisha - may Allah be pleased with her, said: Then the first the Messenger of Allah, peace and blessings be upon him, complained (of illness) was in the house of Maymunah.",
    "book_id": "681",
    "new_page_number": 91
  },
  {
    "serial_number": "5126037",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 96,
    "volume_number": 1,
    "text": "Zainab bint Jahsh, and it was said: in the house of Rayhanah. He asked permission of his wives to be nursed in the house of Aisha (1); they permitted him. His pain intensified, so he said: «Indeed I suffer pain as two men of you suffer» (2); to increase his reward. When death attended him, he started wiping his face with water, saying: «O Allah help me against the stupors of death» (3). Allah gave him choice; he chose meeting Him. He passed away, peace and blessings be upon him, leaning on Aisha's chest, being sixty-three years old (4), and it was said:",
    "foot_note": "1. Al-Bukhari (914/ 2) and Muslim (312/ 1) mentioned that in \"Their Sahihs\": Aisha - may Allah be pleased with her - said: Then when the Prophet, peace and blessings be upon him, became heavy, and his pain intensified; he asked permission of his wives to be nursed in my house. They permitted him. So he went out between two men, his feet dragging on the ground. \n2. Al-Bukhari (2143/ 5) and Muslim (1991/ 4) extracted in \"Their Sahihs\" from Abdullah bin Mas'ud - may Allah be pleased with him, said: I entered upon the Messenger of Allah, peace and blessings be upon him, while he was suffering severe pain; I touched him with my hand, and said: O Messenger of Allah! You are suffering severe pain. The Messenger of Allah, peace and blessings be upon him, said: «Yes, I suffer as two men of you suffer». I said: Is that because you have double reward? The Messenger of Allah, peace and blessings be upon him, said: «Yes». Then the Messenger of Allah, peace and blessings be upon him, said: «No Muslim is afflicted by harm or illness, or other than that, but Allah sheds his sins from him as the tree sheds its leaves». \n3. Al-Bukhari extracted in his \"Sahih\" (2387/ 5) from Aisha - may Allah be pleased with her, said: The Messenger of Allah, peace and blessings be upon him, had before him a Rakwah, or a box containing water. He started putting his hand in the water, wiping his face with it, saying: «There is no god but Allah, indeed death has stupors». Then he raised his hand, and started saying: «In the Highest Companionship», until he passed away, and his hand fell. Abu Abdullah said: The box is of wood, and the Rakwah is of leather. \n4. This is the correct view, as Al-Bukhari (1300/ 3), (1416/ 3), and Muslim (1825/ 4), (1826/ 4), (1827/ 4) extracted in \"Their Sahihs\" from hadith of Aisha, Ibn Abbas, Muawiyah, and Anas - may Allah be pleased with them all.",
    "book_id": "681",
    "new_page_number": 92
  },
  {
    "serial_number": "5126038",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 97,
    "volume_number": 1,
    "text": "Sixty-five, and it was said: sixty. He was covered with a Burd. It was said: Angels covered him, and came for condolence; heard but not seen: Peace be upon you O People of the House and Allah's mercy and blessings. Every soul shall taste death, and you will only be given your full compensation on the Day of Resurrection. Indeed in Allah is consolation for every calamity, compensation for every deceased, and attainment for everything missed; so in Allah trust, and in Him hope; for the afflicted one is deprived of reward. Peace be upon you and Allah's mercy and blessings. They used to think this condolence was from Al-Khidr (1) peace be upon him. He was washed in his shirt (2), and shrouded in three white Sahuli cloths not",
    "foot_note": "1. There is question in this. Ibn al-Jawzi said in \"Al-Mawdu'at\" (199/ 1): Ibn al-Munadi said: All reports mentioning Al-Khidr are flimsy in beginning and end. They are one of two things: *Either inserted into some hadiths of late narrators by deception. *Or they belong to people who knew their status; narrated them out of wonder, then attributed to them as fact. He said: Most gullible people think Al-Khidr remains?! Eternity is not for a human, Allah - Mighty and Majestic - said: AND WE DID NOT GRANT TO ANY HUMAN BEFORE YOU ETERNITY [Al-Anbiya from verse:34]. He said in (200/ 1): Abu Bakr Al-Naqqash narrated: That Muhammad bin Ismail Al-Bukhari was asked about Al-Khidr and Elias, are they alive? He said: How can that be, when the Prophet, peace and blessings be upon him, said: «No one of those on the face of the earth will remain at the head of a hundred years»?! \n2. Imam Ahmad extracted in his \"Musnad\" (267/ 6) from Aisha - may Allah be pleased with her, said: «When they wanted to wash the Messenger of Allah, peace and blessings be upon him, they differed in it. They said: By Allah! We do not see how to act? Do we strip the Messenger of Allah, peace and blessings be upon him, as we strip our dead, or do we wash him with his clothes on? -",
    "book_id": "681",
    "new_page_number": 93
  },
  {
    "serial_number": "5126039",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 98,
    "volume_number": 1,
    "text": "Containing a shirt (Qamis), nor a turban (1). His uncle Al-Abbas prayed over him, then Banu Hashim, then the Muhajirun, then the Ansar. Abu Talhah Al-Ansari made a niche (Lahd) in his grave and dug it (2). Nine bricks were placed over his niche (3).\n\n40 - Duration of his illness, peace and blessings be upon him: Thirteen nights, and it was said: twelve nights (4). He died on Monday, two nights passed of Rabi' al-Awwal, and it was said: twelve passed of Rabi' al-Awwal when the forenoon intensified. This is preponderant according to Ibn Hazm and a group. It was said: beginning of Rabi' al-Awwal (5). The preponderant view with the majority: That it was twelve passed of Rabi' al-Awwal. There is question in it, and Allah knows best.",
    "foot_note": "1. = She said: When they differed, Allah sent sleep upon them, until by Allah not a man of the people but his chin was on his chest sleeping. She said: Then someone spoke to them from the side of the house, they do not know who he is, saying: Wash the Prophet, peace and blessings be upon him, with his clothes on. She said: They rose to him, and washed the Messenger of Allah, peace and blessings be upon him, while he was in his shirt, pouring water and Sidr over him, and men rubbing him with the shirt. She used to say: If I had known earlier what I know now, none would have washed the Messenger of Allah, peace and blessings be upon him, except his wives». \n1. Extracted by Al-Bukhari (425/ 1), and Muslim (649/ 2). \n2. See: \"Sunan Al-Tirmidhi\" (365/ 3), and \"Tabaqat Ibn Sa'd\" (298/ 2). \n3. See: \"Tabaqat Ibn Sa'd\" (297/ 2 - 298). \n4. Al-Hafiz Ibn Hajar said in \"Fath al-Bari\" (129/ 8): \"They differed on the duration of his illness. Most say thirteen days. It was said more by a day, and said less\". \n5. This is the opinion of Musa bin Uqbah, Al-Layth, and others, as transmitted by Al-Hafiz in \"Al-Fath\" (129/ 8).",
    "book_id": "681",
    "new_page_number": 94
  },
  {
    "serial_number": "5126040",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Al-Ghurar wa Al-Durar fi Sirat Khayr Al-Bashar (The Blazes and Pearls in the Biography of the Best of Mankind), may Allah bless him and grant him peace",
    "edition": "First Edition, 1428 AH - 2007 AD",
    "publisher": "Dar Al-Nawadir, Damascus - Syria",
    "page_number": 99,
    "volume_number": 1,
    "text": "And may Allah bless our master and mawla Muhammad and his family and companions and grant peace. And may Allah be pleased with the Companions, and the Kindred all together, and with the Followers, and the Followers of the Followers with goodness until the Day of Judgment. And our last call is that praise be to Allah, Lord of the Worlds.\nDone\n***",
    "foot_note": "None",
    "book_id": "681",
    "new_page_number": 95
  }
]