[
  {
    "serial_number": "285027",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Sects and Refutations. Book: The Study of Religious Science - Its Importance and the Methodologies of Researchers in It. Author: Dr. Abdul Majeed bin Muhammad Al-Wa'lan. Number of Pages: 53. [The book is not printed]. Date of publication in Shamela: 25 Safar 1442.\nBook: The Study of Religious Science - Its Importance and the Methodologies of Researchers in It. Author: Dr. Abdul Majeed bin Muhammad Al-Wa'lan. Number of Pages: 53. [The book is not printed]. Date of publication in Shamela: 25 Safar 1442.\nAuthor: Dr. Abdul Majeed bin Muhammad Al-Wa'lan. Number of Pages: 53. [The book is not printed]. Date of publication in Shamela: 25 Safar 1442.\nNumber of Pages: 53. [The book is not printed]. Date of publication in Shamela: 25 Safar 1442.\n[The book is not printed]. Date of publication in Shamela: 25 Safar 1442.\nDate of publication in Shamela: 25 Safar 1442",
    "foot_note": "None",
    "book_id": "69",
    "new_page_number": 1
  },
  {
    "serial_number": "285028",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "The Study of Religious Science: Its Importance and the Methodologies of Researchers in It\nDr. Abdul Majeed bin Muhammad Al-Wa'lan",
    "foot_note": "None",
    "book_id": "69",
    "new_page_number": 2
  },
  {
    "serial_number": "285029",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "Introduction\nPraise be to Allah who sent His Messenger with guidance and the religion of truth to manifest it over all religion, although those who associate others with Allah dislike it. I bear witness that there is no deity but Allah alone, with no partner, and I bear witness that Muhammad is His servant and Messenger, the seal of the prophets and messengers, may Allah bless him and his family and all his companions and those who follow them in goodness until the Day of Judgment. To proceed.\nThe study of religious science, its importance and Sharia regulations, the methodologies of researchers in it in the past and present, and the clarification of the true methodology in terms of reception, inference, and presentation, are among the topics related to the Creed (Aqeedah) that should be given attention. \"The importance of writing on this subject comes from the danger of those misguided religions and deviant, destructive sects and trends to Muslims and humanity as a whole. And because a Muslim must be highly aware, vigilant, and concerned about his religion and his nation, and knowledgeable and insightful about the opinions, methodologies, and misguided trends revolving around him that are storming Muslims and all of humanity, to be the best caller to guidance and the best savior from misguidance. The conflict between truth and falsehood is Allah's way in His creation, and the truth is only supported by those who know the good and act upon it and call to it, and know the evil and avoid it and warn against it\" (1).\nThis research includes an introduction, a preface, five chapters, and a conclusion.\nAs for the introduction, it includes:\n- The importance of the research.\n- The research plan.\n- The research methodology.\nAs for the preface, it includes:\n- Definition of religious science and its names.\nChapter One:\n- The legitimacy of studying religious science, and it includes three sections:\n- Section One: Evidence from the Holy Quran.\n- Section Two: Evidence from the Prophetic Sunnah.\n- Section Three: Evidence from the traditions of the Companions and the Predecessors (Salaf).",
    "foot_note": "1. Al-Mujaz fi Al-Adyan wa Al-Madhahib Al-Mu'asirah (A Summary of Religions and Contemporary Sects), by Nasser Al-Qaffari and Nasser Al-Aql, p. 6, Dar Al-Sumai'i, Riyadh, First Edition, with slight modification. See also Muqaddimat fi Ilm Al-Maqalat (Introductions to the Science of Creeds) by Dr. Muhammad Khalifa Al-Tamimi, pp. 26-31, Adwaa Al-Salaf, Riyadh - First Edition.",
    "book_id": "69",
    "new_page_number": 3
  },
  {
    "serial_number": "285030",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "Chapter Two:\n- Benefits of studying religious science, and it includes five sections:\n- Section One: Preservation of Islam.\n- Section Two: Calling disbelievers to Islam.\n- Section Three: Refuting the misconceptions of the followers of religions.\n- Section Four: Lessons and admonition.\n- Section Five: Clarifying the path of criminals.\nChapter Three: The Sharia Regulations for Studying Religious Science, and it includes seven regulations:\n- Regulation One: Sincerity (Ikhlas).\n- Regulation Two: Knowledge (Ilm).\n- Regulation Three: Weighing benefits and harms in studying religious science.\n- Regulation Four: Referring to sources.\n- Regulation Five: Freedom from whim/desire (Hawa).\n- Regulation Six: Justice and fairness.\n- Regulation Seven: Adhering to Sharia terminologies.\nChapter Four: Methodologies of Researchers in Studying Religious Science in General, and it includes four sections:\n- Section One: Definition of this science.\n- Section Two: Importance of research methodologies.\n- Section Three: Relationship of this science to religious science.\n- Section Four: Research methodologies, and it includes six requirements:\nRequirement One: The Historical Descriptive Method.\nRequirement Two: The Analytical Critical Method.\nRequirement Three: The Comparative Method.\nRequirement Four: The Empirical Scientific Method.\nRequirement Five: The Method of Debate, Refutation, and Argumentation.\nRequirement Six: The Comprehensive Scientific Method in Studying Religions.",
    "foot_note": "None",
    "book_id": "69",
    "new_page_number": 4
  },
  {
    "serial_number": "285031",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Chapter Five: The Methodology of Ahlus-Sunnah in Studying Religions, and it includes three sections:\n- Section One: Methodology of reception and sources of inference.\n- Section Two: Methodology of inference.\n- Section Three: Methodology of presentation and refutation.\nChapter Six: Methodologies of those opposing Ahlus-Sunnah in studying religious science and critiquing them, and it includes four sections:\n- Section One: Methodologies of the theologians (Ahl al-Kalam) in studying religious science.\n- Section Two: The methodological foundations for studying religions according to the theologians and critiquing them.\n- Section Three: Methodologies of disbelievers in studying religious science.\n- Section Four: Methodologies of Orientalists in studying religious science and sects and evaluating them, and it includes three requirements:\nRequirement One: The postulates from which Orientalists proceeded.\nRequirement Two: The Orientalists' methodology in studying religions.\nRequirement Three: The Orientalists' methods in Islamic studies.\nAs for the conclusion, I mentioned the most important results I reached.\nAs for my methodology in the research, it is as follows:\n1 - Attributing Quranic verses to their locations in the Quran, by stating the surah name and verse number and placing them between brackets {}.\n2 - Referencing Hadiths and traditions (Athar) by mentioning the source, the hadith number if available, and the volume and page number.\n3 - Creating an index of references.\n4 - Creating an index of topics.\nI ask Allah, Glory be to Him, the Most High, to make this work purely for His Noble Face. Allah knows best, and may Allah bless our Prophet Muhammad and his family and companions.\nDr. Abdul Majeed bin Muhammad Al-Wa'lan\nawalaan@gmail.com",
    "foot_note": "None",
    "book_id": "69",
    "new_page_number": 5
  },
  {
    "serial_number": "285032",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "Preface\nDefinition of Religious Science and its Names:\nIt is the science concerned with the creeds (maqalat) of disbelieving nations. Creeds generally are divided into two parts:\nPart One: Creeds occurring within this Ummah (Nation).\nPart Two: Creeds of other nations.\nTherefore, when Abu al-Hasan al-Ash'ari wrote about the science of creeds, he authored a book he named \"Maqalat al-Islamiyyin\" (Creeds of the Muslims) and another book he named \"Maqalat Ghayr al-Islamiyyin\" (Creeds of Non-Muslims). However, what has become established in the present time is the separation between these two types of creeds, by naming the creeds of non-Muslims as \"Religious Science\" (Ilm al-Adyan) and the creeds of Muslims as \"Sectarian Science\" (Ilm al-Firaq).\nIt is known that in the current era, some sciences have branched out and several sciences have stemmed from them. Among these is the science of creeds (Ilm al-Maqalat), which branched into the following sciences:\n1 - Science of Sects (Ilm al-Firaq).\n2 - Science of Religions (Ilm al-Adyan).\n3 - Science of Contemporary Doctrines (Ilm al-Madhahib al-Mu'asirah) (1).\nReligious science has several terminologies, including: History of Religions, Comparative Religion, Creeds (Maqalat), and Religions and Sects (Al-Milal wa Al-Nihal).\nResearchers mention (2) that religious science includes three sections:\nSection One: History of Religions: This is the descriptive, analytical study specific to each religion individually, which can introduce us to the origin of a religion, the life of its founder... and the reasons for its spread and the types of its development.\nSection Two: Foundations and Principles: This section studies the relationships between the foundations on which different religions are based, including creed, worship, law, ethics, and transactions, and the goals they aim for. Among the most important topics in this section is the topic of Divinity.\nSection Three: Comparative Religion: It studies the characteristics and features of each religion and balances them against the characteristics and features of other religions (3).",
    "foot_note": "1. Muqaddimat fi Ilm Al-Maqalat, pp. 13-14.\n2. Ilm Al-Milal wa Manahij Al-Ulama Fihi (Science of Religions and Scholars' Methodologies In It), by Ahmad Joud, pp. 11-12, Dar Al-Fadila, Riyadh, First Edition.\n3. Al-Adyan Dirasah Tarikhiyah Muqaranah (Religions: A Comparative Historical Study) - Part One, Dr. Rushdi Aliyan and Saadoun Al-Samuk, p. 18, Ministry of Higher Education and Scientific Research, University of Baghdad.",
    "book_id": "69",
    "new_page_number": 6
  },
  {
    "serial_number": "285033",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "Chapter One: The Legitimacy of Studying Religious Science\nOne who contemplates the texts of the Holy Quran and the Prophetic Sunnah finds that there is attention given to the aspect of religious science. The texts have mentioned a number of religions and cited aspects of their beliefs, some of which were upon the truth and then were distorted. For example, Judaism, Christianity, Sabianism, idol worship, and others were mentioned. Then the texts clarified their opposition to the truth and their falseness, warned against them, and condemned their followers. We will mention, God willing, the evidence for this.\n\nSection One: Evidence from the Holy Quran:\nThe mention of religions came in the Quran clearly and extensively. Some verses gathered six of the religions, which is His saying, the Most High: {Indeed, those who have believed and those who were Jews and the Sabeans and the Christians and the Magians and those who associated with Allah - Allah will judge between them on the Day of Resurrection. Indeed Allah is, over all things, Witness.} [Al-Hajj: 17] (1).\nAmong the verses in which religions and some of their beliefs were mentioned, and the refutation of them, is His saying, the Most High: {Abraham was neither a Jew nor a Christian, but he was one inclining toward truth, a Muslim [submitting to Allah]. And he was not of the polytheists.} [Ali 'Imran: 67] (2).\nAnd His saying, the Most High: {And We sent, following in their footsteps, Jesus, the son of Mary, confirming that which came before him in the Torah; and We gave him the Gospel, in which was guidance and light and confirming that which preceded it of the Torah as guidance and instruction for the righteous.} [Al-Ma'idah: 46] (3).\nAnd His saying, the Most High: {And they did not kill him, nor did they crucify him; but [another] was made to resemble him to them. And indeed, those who differ over it are in doubt about it. They have no knowledge of it except the following of assumption. And they did not kill him, for certain. (157) Rather, Allah raised him to Himself. And ever is Allah Exalted in Might and Wise. (158)} [An-Nisa: 157-158] (4).\nTo other such verses.",
    "foot_note": "1. Surah Al-Hajj, Verse: 17.\n2. Surah Ali 'Imran, Verse: 67.\n3. Surah Al-Ma'idah, Verse: 46.\n4. Surah An-Nisa, Verses: 157-158.",
    "book_id": "69",
    "new_page_number": 7
  },
  {
    "serial_number": "285034",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Section Two: Evidence from the Sunnah:\nThe Sunnah is the second revelation, and in it came mention of religions just as it came in the Holy Quran. The Prophet, peace be upon him, continued to mention these religions and warn against them even at his death, where he, peace be upon him, said: \"May the curse of Allah be upon the Jews and the Christians; they took the graves of their prophets as places of worship\" (1).\nThe Prophet, peace be upon him, informed his nation about \"the prophets and their nations, and what happened to them and what happened to him with them, as if they were among them\" (2).\nTherefore, you find in the books of Sunnah, books and chapters talking about the prophets, such as the Book of Stories of the Prophets in Sahih Al-Bukhari.\nEvidence for this includes his saying, peace be upon him: \"Convey from me even if it is a verse, and narrate from the Children of Israel and there is no harm, and whoever lies about me intentionally, let him take his seat in the Fire\" (3), and his saying, peace be upon him: \"The Jews split into seventy-one sects or seventy-two sects, and the Christians likewise, and my nation will split into seventy-three sects\" (4), and other hadiths.\n\nSection Three: Evidence from the traditions of the Companions and the Predecessors:\nThe Companions are the generation chosen by Allah to accompany His Prophet, peace be upon him. Therefore, they are the most knowledgeable of people about the intent of Allah and the intent of His Messenger, peace be upon him, and they are the best of generations by the testimony of the Prophet, peace be upon him, for them, where he said: \"The best of people are my generation, then those who follow them, then those who follow them\" (5).\nThe positions of the Companions in this regard are many, including: the dialogue of Ja'far bin Abi Talib with the Negus and the delegation of Quraysh (6). And the debate of Abu Bakr, may Allah be pleased with him, with the Jews (7), and the debate of Umar, may Allah be pleased with him, with the Jews (8).\nThose are some indications of what the Book of Allah Almighty and the Sunnah of His Prophet, peace be upon him, and the guidance of his Companions, may Allah be pleased with them, contained regarding the mention of false religions and debating their people, which confirms the necessity of paying attention to those religions with the intention of clarifying their deviation and corruption, refuting them, and warning against them and against falling into them.",
    "foot_note": "1. Narrated by Muslim: Book of Mosques, Chapter on the Prohibition of Building Mosques on Graves, Taking Images in Them, and the Prohibition of Taking Graves as Places of Worship, p. 214, Hadith No. 529.\n2. I'lam al-Muwaqqi'in by Ibn al-Qayyim 4/285-286 - Al-Kutub Al-Ilmiyyah, Beirut, First Edition.\n3. Narrated by Al-Bukhari: Book of Stories of the Prophets, Chapter on What Was Mentioned About the Children of Israel, Hadith No. 3461.\n4. Narrated by Abu Dawood No. 4583. And Al-Tirmidhi Hadith No. 2778.\n5. Narrated by Al-Bukhari: Book of Testimonies, Chapter: One Should Not Bear Witness to False Testimony If He Witnessed It, p. 502, Hadith No. 2652.\n6. Al-Sirah Al-Nabawiyyah by Abu Muhammad Abdul Malik bin Hisham, reviewed and annotated by Muhammad Muhyi al-Din Abdul Hamid, p. 2/187-188, Maktabat Al-Turath, Cairo.\n7. Previous source p. 2/187-188.\n8. Jami' al-Bayan 'an Ta'wil Ay al-Quran, by Abu Ja'far Muhammad bin Jarir al-Tabari, 1/433-434, Mustafa Al-Babi Al-Halabi and Sons Press, Third Edition.",
    "book_id": "69",
    "new_page_number": 8
  },
  {
    "serial_number": "285035",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "Chapter Two: Benefits of Studying Religious Science\n\nSection One: Preservation of Islam:\n\"Since Muhammad, peace be upon him, was the seal of the prophets, and there was no messenger after him, He, Glorified and Exalted, did not cease to establish causes for the renewal of the religion as required for its manifestation, as promised in the Book. Thus, the beauties of faith and its comprehensive aspects are shown through it, and the evils of disbelief and its corruptions are known by it. Among the greatest causes for the manifestation of faith and religion, and the clarification of the truth of the news of the messengers, is the appearance of opponents to it from the people of evident falsehood, as the Most High said: {And thus We have made for every prophet an enemy - devils from mankind and jinn, inspiring to one another decorative speech in delusion. But if your Lord had willed, they would not have done it, so leave them and what they invent. (112) And [it is] so the hearts of those who do not believe in the Hereafter will incline toward it and that they will be satisfied with it and that they will commit that which they are committing. (113) [Say], \"Then is it other than Allah I should seek as judge while it is He who has revealed to you the Book explained in detail?\" And those to whom We [previously] gave the Scripture know that it is sent down from your Lord in truth, so never be among the doubters. (114) And the word of your Lord has been fulfilled in truth and in justice. None can alter His words, and He is the Hearing, the Knowing. (115)} [Al-An'am: 112-115]. (1) That is because the truth - if denied and opposed with misconceptions - Allah Almighty establishes for it that by which the truth is realized and falsehood is nullified from clear signs, by what He shows of the proofs of truth and its clear evidences, and the corruption of the refutable arguments opposing it\" (2).\n\nSection Two: Calling Disbelievers to Islam:\n\"The first and fundamental goal of studying religions for Muslims is inviting its people to Islam, proceeding from the belief in the obligation of Da'wah (call to Islam). Many texts have been reported commanding Da'wah, including: The saying of the Most High {Invite to the way of your Lord with wisdom and good instruction, and argue with them in a way that is best.} [An-Nahl: 125] (3). And the saying of the Most High: {So to that [religion of Allah] invite, and remain on a right course as you are commanded} [Ash-Shura: 15] (4).",
    "foot_note": "1. Surah Al-An'am Verses: 112-115.\n2. Al-Jawab Al-Sahih Li Man Baddala Din Al-Masih (The Correct Answer to Those Who Altered the Religion of Christ) by Ibn Taymiyyah, investigation by Dr. Ali Al-Alma'i, Dr. Abdul Aziz Al-Askar, and Dr. Hamdan Al-Hamdan, p. 1/60-61, Dar Al-Fadila, Riyadh, First Edition.\n3. Surah An-Nahl Verse: 125.\n4. Surah Ash-Shura Verse: 15.",
    "book_id": "69",
    "new_page_number": 9
  },
  {
    "serial_number": "285036",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "The Prophet, peace be upon him, undertook the call to Allah in compliance with his Lord's command, so he called all people of religions to Islam. He sent his messengers to all the kings of the earth, and debated all categories of those opposing the truth, especially the People of the Scripture. The Most High said: {Say, \"O People of the Scripture, come to a word that is equitable between us and you - that we will not worship except Allah and not associate anything with Him and not take one another as lords instead of Allah.\" But if they turn away, then say, \"Bear witness that we are Muslims [submitting to Him].\" (64)} [Ali 'Imran: 64] (1)\" (2).\n\nSection Three: Refuting the Misconceptions of the People of Religions:\nIn the history of religions and sects, no religion or sect has been subjected to attempts of distortion and alteration, and raising doubts about it by its adversaries, like the religion of Islam. Its fundamentals and branches have been subjected to a fierce attack since the Prophet, peace be upon him, stood proclaiming the call of truth, conveying the message of his Lord, and calling people to enter the true religion of Allah, and to reject all other religions and sects.\nFrom that time, the people of falsehood declared their war on Islam, and raising doubts and suspicions were the most important reasons and the most effective means for them. The Quran confronted their doubts and refuted them with decisive arguments and proofs. The Most High said: {And they do not come to you with an argument except that We bring you the truth and the best explanation. (33)} [Al-Furqan: 33] (3).\nSo Allah informs His Messenger that they do not bring an argument or a doubt, nor say a saying opposing the truth, except that We answer them with what is the truth in the matter itself, and clearer, more evident, and more eloquent than their sayings (4).\nWhen the enemies of religion undertook raising doubts and suspicions among Muslims, and began innovating matters that have no basis in religion, and dividing Muslims, Muslim scholars stood up to fulfill Allah's right upon them. They exposed the types of conspiracies that were against Islam, refuted the doubts that the people of religions were spreading among Muslims in their desperate attempts to stop the march of Islam. Thus, Islam triumphed in the field of thought as it triumphed in the field of Jihad with the spear.\nExposing the falseness of falsehood, clarifying the doubts fabricated by the people of falsehood, and refuting them with a firm refutation is a great principle of Islam, and a door of Jihad. Sheikh al-Islam Ibn Taymiyyah said: \"The one who refutes the people of innovation is a Mujahid\" (5). And it was narrated from Yahya bin Yahya that he said: \"Defending the Sunnah is better than Jihad\" (6). And Sheikh Bakr Abu Zaid said: \"Refuting the people of falsehood, debating them, and arguing with them until their doubt is cut off and their harm is removed from Muslims is a rank among the stations of Jihad with the tongue, and the pen is one of the two tongues\" (7). By this, the protection and guarding of the religion is accomplished (8).",
    "foot_note": "1. Surah Ali 'Imran Verse: 64.\n2. See: Ilm Al-Milal wa Manahij Al-Ulama Fihi, p. 157.\n3. Surah Al-Furqan Verse: 33.\n4. See: Tafsir Ibn Kathir 3/298, Dar Al-Mufid, Beirut First Edition.\n5. See: Majmu' Al-Fatawa by Sheikh al-Islam Ibn Taymiyyah, collected and arranged by Abdul Rahman bin Qasim, p. 4/13, Dar Alam Al-Kutub, Riyadh, 1412.\n6. Previous Source 4/13.\n7. Al-Radd 'Ala Al-Mukhalif Min Usul Al-Islam (Refuting the Opposer is from the Principles of Islam) by Bakr Abu Zaid, p. 29, Dar Al-Hijrah, Second Edition.\n8. Ilm Al-Milal wa Manahij Al-Ulama Fihi, pp. 161-164.",
    "book_id": "69",
    "new_page_number": 10
  },
  {
    "serial_number": "285037",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "Section Four: Lessons and Admonition:\nThe Quran spoke a lot about the stories of the predecessors. The Most High said: {Thus We relate to you from the news of what has preceded. And We have certainly given you from Us the Message (Dhikr). (99)} [Taha: 99] (1). And He said after speaking about the nations of the predecessors: {Those cities - We relate to you some of their news. And certainly did their messengers come to them with clear proofs} [Al-A'raf: 101] (2).\nAnd Allah - Glory be to Him - commanded His Prophet Muhammad, peace be upon him, to relate stories to people {So relate the stories that perhaps they will give thought. (176) How evil an example [is that of] the people who denied Our signs and used to wrong themselves.} [Al-A'raf: 176-177] (3).\nHe, Glory be to Him, described those stories mentioned in the Quran as true stories, saying: {Indeed, this is the true explanation. And there is no deity except Allah.} [Ali 'Imran: 62] (4). That is because of their conformity to reality. And He, Glory be to Him, described those stories as the best of stories, saying: {Indeed, We have sent it down as an Arabic Qur'an that you might understand. (2) We relate to you, [O Muhammad], the best of stories in what We have revealed to you of this Qur'an although you were, before it, among the unaware. (3)} [Yusuf: 2-3] (5).\nIn the verse is an indication that we must be content regarding the stories of the predecessors with what was mentioned in the Quran, because it is sufficient over all other books (6). And because whatever else is either unreliable books, or doubtful, just as the news of the predecessors became for us a matter of the Unseen which cannot be reached except through a reliable source. The Most High said: {That is from the news of the unseen which We reveal to you, [O Muhammad]. And you were not with them when they cast their pens as to which of them should be responsible for Mary. Nor were you with them when they disputed. (44)} [Ali 'Imran: 44] (7).",
    "foot_note": "1. Surah Taha Verse: 99.\n2. Surah Al-A'raf Verse: 101.\n3. Surah Al-A'raf Verses: 176-177.\n4. Surah Ali 'Imran Verse: 62.\n5. Surah Yusuf Verse: 2.\n6. Tafsir Ibn Kathir 2/425.\n7. Surah Ali 'Imran Verse: 44.",
    "book_id": "69",
    "new_page_number": 11
  },
  {
    "serial_number": "285038",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "Stories, with the similar events they contain, help a person know the divine laws (Sunan) which do not fail - unless Allah wills - by measuring the present against the past. Ibn Taymiyyah, may Allah have mercy on him, said: \"From this chapter, the stories of the predecessors became a lesson for us. Were it not for analogy (Qiyas), and the consistency of His action and Sunnah, taking lessons from them would not be valid, because taking lessons is only possible if the ruling of a thing is the ruling of its like, such as the parables struck in the Quran\" (1).\n\nSection Five: Clarifying the Path of Criminals:\nAmong the most important objectives and greatest goals obtained from studying religions is knowing the path of criminals. The Most High said following His speech about the messengers and messages: {And thus do We detail the verses, and [thus] the way of the criminals will become evident.} [Al-An'am: 55] (2).\nAllah has detailed in His Book the path of the believers in detail, and the path of the criminals in detail, and the consequence of these in detail, and the consequence of those in detail, and the deeds of these, and the deeds of those, and the allies of these, and the allies of those, and His abandonment of these, and His success granted to those, and the reasons by which He granted success to those, and the reasons by which He abandoned those... And those knowledgeable of Allah, His Book, and His religion knew the path of the believers in detail, and the path of the criminals in detail, so both paths became clear to them, just as the path leading to his destination and the path leading to destruction become clear to the traveler. These are the most knowledgeable of creation, the most beneficial to people, and the most sincere advisor to them, and they are the guides. By this, the Companions excelled over everyone who came after them until the Day of Judgment, for they grew up in the path of misguidance, disbelief, polytheism, and the paths leading to destruction, and they knew them in detail. Then the Messenger came to them, so he brought them out from those darknesses to the path of guidance and Allah's straight path (3).\n\"And Allah - Glory be to Him - loves that the path of His enemies be known to be avoided and hated, just as He loves that the paths of His allies be known to be loved and followed. In this knowledge are benefits and secrets that none knows but Allah...\" (4).\nThe distinction of the people of truth from the people of falsehood, from the people of desires and innovations, and from the people of false religions and sects, is an issue of utmost importance. The Predecessors (Salaf) - may Allah be pleased with them - were keen on that. Naming the people of truth with titles such as \"Ahlus-Sunnah wal-Jama'ah\" (People of Sunnah and Community), \"Al-Salaf\" (The Predecessors), \"Ahl al-Hadith\" (People of Hadith), and \"Ahl al-Athar\" (People of Tradition) is only from the aspect of differentiation and clarifying the path of truth from the paths of the people of misguidance. If differentiation from the people of innovation who are from the people of the Qibla (Muslims) is required by Sharia, then differentiation from others among the people of false religions and sects is even more appropriate (5).",
    "foot_note": "1. Jami' al-Rasa'il, by Ibn Taymiyyah, investigation by Muhammad Rashad Salim p. 55, Al-Madani Press, Cairo, First Edition. See: Ilm Al-Milal wa Manahij Al-Ulama Fiha 167-169.\n2. Surah Al-An'am Verse: 55.\n3. See: Al-Fawa'id by Ibn al-Qayyim al-Jawziyya, investigation by Muhammad Uthman al-Khashb p. 161, Dar Al-Kitab Al-Arabi - Beirut, Fourth Edition 1410 AH 1990 AD.\n4. Previous Source p. 164.\n5. See: Ilm Al-Milal wa Manahij Al-Ulama Fihi p. 165-166.",
    "book_id": "69",
    "new_page_number": 12
  },
  {
    "serial_number": "285039",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "Chapter Three: The Sharia Regulations for Studying Religious Science\nThis science has regulations that must be adhered to, and these regulations are not specific to it, but rather general for every matter intended to be researched. Among these regulations:\n\nRegulation One: Sincerity:\nIt is that a person seeks the Face of Allah Almighty with his knowledge and action. The Most High said: {So whoever would hope for the meeting with his Lord - let him do righteous work and not associate in the worship of his Lord anyone. (110)} [Al-Kahf: 110]. So the accepted work from the servant is what conforms to the Sharia, intended for the Face of Allah alone (1).\nIn the authentic Hadith on the authority of Umar bin Al-Khattab, may Allah be pleased with him, he said: I heard the Messenger of Allah, peace be upon him, say: \"Actions are but by intentions, and every man shall have only what he intended\" (2).\nSo the basis for the validity or corruption of actions is the intention. The one standing in defense of the truth, calling to it, and arguing for it is in greater need of sincerity than others. Therefore, the presence of soundness of intention and purpose is a fundamental condition for anyone who engages in the study of religions. His intention in this must be guarding the religion, defending it, guiding people to guidance, and stabilizing them upon it (3), and he should not have any other purpose.\nImam al-Haramayn al-Juwayni said, explaining the etiquettes of debate: \"The first thing in it incumbent upon the debater is to intend drawing closer to Allah - Glory be to Him - and seeking His pleasure in complying with His command regarding what He ordered, and to exert his utmost capability in clarification and exposure, to realize the truth and eradicate falsehood. And to fear Allah lest he intends by his debate showing off, seeking status, earning, disputation, contention, and hypocrisy. And to beware of the painful punishment of Allah - Glory be to Him - and his intention should not be triumph over the opponent, and joy in overcoming and subduing, for that is the habit of male livestock, like rams and roosters\" (4).",
    "foot_note": "1. See: Tafsir Ibn Kathir 3/103.\n2. Narrated by Al-Bukhari, Book of Revelation, Chapter: How the Revelation Began to the Messenger of Allah, peace be upon him, p. 21, Hadith No. 1.\n3. Al-Radd 'Ala Al-Mukhalif Min Usul Al-Islam by Bakr Abu Zaid p. 54.\n4. Al-Kafiyah fi Al-Jadal, by Imam al-Haramayn al-Juwayni, investigation by Dr. Fawqiyah Hussein Mahmoud p. 529, printed by Issa Al-Babi Press, Cairo 1399 AH / 1979 AD. See: Ilm Al-Milal wa Manahij Al-Ulama Fihi p. 237-239.",
    "book_id": "69",
    "new_page_number": 13
  },
  {
    "serial_number": "285040",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "Regulation Two: Knowledge:\nKnowledge is among the necessary matters and important regulations for one who engages in religious science. That is because the one engaged in studying religions, if he is not qualified for it, his harm is greater than his benefit. Knowledge is one of the most important conditions that must be met by one who undertakes the function of defending the religion, because knowledge precedes action. The Most High said: {So know, [O Muhammad], that there is no deity except Allah and ask forgiveness for your sin and for the believing men and believing women. And Allah knows your movement and your resting place. (19)} [Muhammad: 19] (1). Imam Al-Bukhari, may Allah have mercy on him, was alert to this, so he titled a chapter for this verse saying: Chapter: Knowledge before speech and action (2).\nSo knowledge precedes speech and action, because it is a condition for the validity of speech and action, so they are not considered except with it (3).\nAmong the evidences indicating the condemnation of speaking before knowledge is the saying of the Most High: {And of the people is he who disputes about Allah without knowledge or guidance or an enlightening book (8)} [Al-Hajj: 8] (4). The verse indicated the condemnation of the disputant without knowledge. And the Most High said condemning the People of the Scripture who disputed without knowledge: {O People of the Scripture, why do you argue about Abraham while the Torah and the Gospel were not revealed until after him? Then will you not reason? (65) Here you are - those who have argued about that of which you have [some] knowledge, but why do you argue about that of which you have no knowledge? And Allah knows, while you know not. (66)} [Ali 'Imran: 65-66] (5).\nIndeed, we find that Sheikh al-Islam Ibn Taymiyyah sees that he who judges in sects and religions without knowledge or justice is more deserving of the Fire than one who judges between people in wealth, blood, and honor without knowledge or justice. He says: \"Since the followers of the prophets are the people of knowledge and justice, the speech of the people of Islam and Sunnah with disbelief and the people of innovation was with knowledge and justice, not with conjecture and what souls desire. For this reason, the Prophet, peace be upon him, said: (Judges are three: two judges in the Fire, and one judge in Paradise. A man who knew the truth and judged by it is in Paradise, and a man who knew the truth and judged contrary to it is in the Fire, and a man who judged for people out of ignorance is in the Fire) (6).",
    "foot_note": "1. Surah Muhammad Verse: 19.\n2. Sahih Al-Bukhari Book of Knowledge, Chapter: Knowledge before Speech and Action p. 39.\n3. See: Fath Al-Bari Sharh Sahih Al-Bukhari, by Al-Hafiz Ibn Hajar Al-Asqalani, numbering by Muhammad Fuad Abdul Baqi, p. 2/193, Dar Al-Rayyan li Al-Turath, Second Edition.\n4. Surah Al-Hajj Verse: 8.\n5. Surah Ali 'Imran Verse: 65-66.\n6. Narrated by Abu Dawood Hadith No. 3573, cared for by Abu Suhaib Al-Karmi, Dar Al-Afkar, edition of year 1419.",
    "book_id": "69",
    "new_page_number": 14
  },
  {
    "serial_number": "285041",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "If the one who judges between people in wealth, blood, and honor - if he is not knowledgeable and just - is in the Fire, then how about the one who judges in sects, religions, fundamentals of faith, divine knowledge, and universal landmarks without knowledge or justice\" (1).\nKnowledge in the field of studying religions includes knowledge of Islam from its primary sources of the Quran and Sunnah, and what explains them from the sayings of the Predecessors, or what helps in understanding them from the instrumental sciences like Arabic language. It also includes knowledge of the misconceptions of the people of religions and sects, and methods of refuting them (2).\n\nRegulation Three: Estimating Benefit and Harm in Studying Religions:\nStudying religions and disbelief sects and engaging in them is not without dangers and pitfalls that may harm the one engaged in it, such as the misconceptions of the people of those religions leaving something in his heart. Or he may cause harm to the truth he possesses, if he is weak in refuting the opponents' misconceptions. Studying them can also lead to spreading them and promoting their principles, especially if the refutation is not solid. Therefore, before exposing oneself to studying any religion or sect, the benefit and harm in this study should be estimated. The relied-upon saying in estimating benefit and harm is: the saying of the scholars trusted with their religion (3).\n\nRegulation Four: Returning to Sources:\nReturning to the sources of the researched beliefs, quoting texts from them literally, and accuracy in attributing opinions to their owners. As for attributing sayings to people through an incorrect path, or through a path whose correctness is doubted, or through a path whose adherence to truthfulness and justice is unknown, this is from the conjecture which we were forbidden to follow, as the Most High said: {O you who have believed, avoid much [negative] assumption. Indeed, some assumption is sin.} [Al-Hujurat: 12] (4). And Allah - the Exalted - condemned the followers of conjecture and desire, saying: {They follow not except assumption and what [their] souls desire} [An-Najm: 23] (5).\nThe scholars of the Salaf adhered to this. Here is Sheikh al-Islam Ibn Taymiyyah - may Allah have mercy on him - saying in his refutation of the Christians: \"And I mention what they mentioned in their exact words, section by section, and I follow each section with what suits it of answer, branch and root, tying and untying\" (6).",
    "foot_note": "1. Al-Jawab Al-Sahih 1/107-108.\n2. See: Ilm Al-Milal wa Manahij Al-Ulama Fihi p. 240-242.\n3. See: Ilm Al-Milal wa Manahij Al-Ulama Fihi p. 236.\n4. Surah Al-Hujurat: Verse 12.\n5. Surah An-Najm: Verse 23.\n6. Al-Jawab Al-Sahih p. 1/64.",
    "book_id": "69",
    "new_page_number": 15
  },
  {
    "serial_number": "285042",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "Regulation Five: Freedom from Whim (Hawa):\nFor whim drives one to differ and speak falsehood. Allah the Blessed and Exalted has said: {They follow not except assumption and what [their] souls desire} [An-Najm: 23] (1). And He, the Most High, said: {[And do not follow] desire, as it will lead you astray from the way of Allah.} [Sad: 26] (2).\n\nRegulation Six: Justice and Fairness:\nJustice, fairness, and scientific integrity are among the most important qualities that those who differ and dispute should possess, so that no injustice falls on either party. The Most High said: {O you who have believed, be persistently standing firm in justice, witnesses for Allah, even if it be against yourselves or parents and relatives. Whether one is rich or poor, Allah is more worthy of both. So follow not [personal] inclination, lest you not be just.} [An-Nisa: 135] (3). And He, the Most High, said: {And when you speak, be just} [Al-An'am: 152] (4).\nSheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, explaining the obligation of justice in every case, and the prohibition of injustice absolutely, said: \"It is known that if we speak about those below the Companions, such as kings disputing over the kingdom, and scholars and sheikhs disputing in knowledge and religion, speech must be with knowledge and justice, not with ignorance and injustice. For justice is obligatory for everyone towards everyone in every situation, and injustice is forbidden absolutely, not permissible ever in any situation. The Most High said: {And do not let the hatred of a people prevent you from being just. Be just; that is nearer to righteousness.} [Al-Ma'idah: 8] (5). This verse was revealed because of their hatred for the disbelievers, which is a commanded hatred. If the hatred commanded by Allah prohibits its owner from wronging the one he hates, then how about hating a Muslim\" (6).",
    "foot_note": "1. Surah An-Najm: Verse 23.\n2. Majallat Al-Dirasat Al-Arabiyyah, Manahij Al-Bahth fi Al-Aqeedah, by Sheikh Yusuf Al-Saeed, Issue Seven January 2002.\n3. Surah An-Nisa Verse: 135.\n4. Surah Al-An'am: Verse 152.\n5. Surah Al-Ma'idah Verse: 8.\n6. See: Tafsir Ibn Kathir: 2/12, and Ilm Al-Milal wa Manahij Al-Ulama Fihi p. 244-246.",
    "book_id": "69",
    "new_page_number": 16
  },
  {
    "serial_number": "285043",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "Regulation Seven: Adhering to Sharia Terminologies:\nThe issue of controlling terminologies is a matter the Holy Quran alerted the believers to during the era of revelation. Allah forbade the believers from saying {Ra'ina} [Al-Baqarah: 104] and commanded them to say {Unzurna} [Al-Baqarah: 104]. The Most High said: {O you who have believed, say not [to the Messenger], \"Ra'ina\" but say, \"Unzurna\"} [Al-Baqarah: 104] (1). That is because the Jews used the word {Ra'ina} [Al-Baqarah: 104] for a corrupt meaning carrying an insult to the Prophet, peace be upon him (2).\nThe Prophet, peace be upon him, informed about people coming at the end of time who name alcohol by other than its name (3).\nThe stance of Ahlus-Sunnah regarding the matter of terminologies attributed to prophets or predecessors or opponents is summarized as follows:\n1 - Verifying the authenticity of the attribution of the term and its meaning: Sheikh al-Islam said: \"What is transmitted from the predecessors and scholars needs knowledge of the confirmation of its wording, and knowledge of its indication, just as what is transmitted from Allah and His Messenger needs that\" (4). The matter in this is that knowledge needs authenticated transmission and verified consideration (5).\n2 - Following the transmitted terminologies from the Quran and Sunnah: That is because following the wordings of the Quran and Sunnah is better than any other wordings in determining matters of religion, because that leads to agreement with the texts in wording and meaning.\n3 - Understanding terminologies: This is by knowing the indication of the term and knowing the intent of the speaker using it. \"That is because the indication of speech is only by the language of the speaker and his known habit in his speech, not by a language, habit, and convention invented by other people after the extinction of the era of those whom he addressed with his language and habit (6) as the Most High said: {And We did not send any messenger except [speaking] in the language of his people to state clearly for them} [Ibrahim: 4] (7).",
    "foot_note": "1. Surah Al-Baqarah: Verse 104.\n2. See: Tafsir Ibn Kathir: 1/374.\n3. Sunan Abu Dawood: Book of Drinks, Chapter on Dhadhi - Drink of the Immoral - No. 3688.\n4. Majmu' Al-Fatawa: p. 1/246.\n5. Previous Reference: p. 1/246.\n6. Dar' Ta'arud Al-Aql wa Al-Naql: p. 7/123, Manhaj Ibn Taymiyyah fi Al-Da'wah by Dr. Abdullah bin Rashid Al-Hoshani, p. 1/87-89, Dar Ishbiliya, First Edition.\n7. Surah Ibrahim: Verse 4.",
    "book_id": "69",
    "new_page_number": 17
  },
  {
    "serial_number": "285044",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "Chapter Four: Methodologies of Researchers in Studying Religious Science in General\n\nSection One: Definition of this Science:\nMethodology (Manhaj) linguistically: It is a noun of place from the root 'nahaja' 'yanhaju' 'nahjan', and it is the clear straight path. Al-Jawhari said: \"Nahaja the road: He made it clear and distinct. And Nahajahu: He treaded it. And Al-Minhaj: The clear road\" (1).\nAl-Fairuzabadi said: \"Istanhaja the road: It became a clear path (Nahj). And so-and-so Nahaja the way of so-and-so, i.e., treaded his path\" (2).\nAs for its terminological definition: It has been defined by many definitions, including:\n1 - It is the way leading to the recognition of truth in sciences, through a set of general rules which dominate the course of the mind and determine its operations, until it reaches a known result.\n2 - It is the law or rule that governs any attempt at scientific study in any field.\n3 - The scientific rules that the mind follows in its movement to search for the truth in any field of knowledge.\nThese definitions are singular in meaning even if the expression differs in wording, because their axis is the rules that the researcher follows or that guide the researcher when he wants to research any scientific issue. \"Muslim scholars used to express methodology as Principles (Usul) and Rules (Qawa'id)\" (3).\nDefinition of the Science of Research Methodologies in Creed (Aqeedah):\nIt is a science concerned with studying the evidences of issues that each sect adopts in terms of its sources, method of inference with them, its stance on the sources of others, and its method in studying creed (4).\nRegarding the definition of studying religious science, what was said in the definition of the science of research methodologies in creed applies; but it is specific to religions: It is a science concerned with studying the evidences of issues that each religion adopts in terms of its sources, method of inference with them, its stance on the sources of others, and its method in studying religions.",
    "foot_note": "1. Al-Sihah fi Al-Lughah wa Al-Ulum by Al-Jawhari, investigation by Nadim Mar'ashli and Osama Mar'ashli, p. 1/346, Dar Al-Hadarah Al-Arabiyyah, Beirut.\n2. Al-Qamus Al-Muhit, Muhammad bin Yaqub Al-Fairuzabadi, p. 266, Mu'assasat Al-Risalah, Dar Al-Rayyan li Al-Turath, Second Edition.\n3. Manhaj Kitabat Al-Tarikh Al-Islami by Dr. Muhammad bin Samil Al-Sulami, p. 89, Dar Taiba, Riyadh, First Edition.\n4. Manahij Al-Bahth fi Al-Aqeedah by Al-Saeed p. 263.",
    "book_id": "69",
    "new_page_number": 18
  },
  {
    "serial_number": "285045",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "Section Two: Importance of Research Methodologies:\nResearch methodologies in sciences have great importance, as they are the path leading to any knowledge. Sciences are diverse in their subjects, goals, elements, sources, and research methodologies. Sciences are not defined by their subjects; because subjects help in researching this science or that, and the same goes for goals. Rather, what helps in that is the correct research methodology. To the extent that the research methodology is strong, upright, based on a sound methodological basis, and appropriate for the subject being researched, the results reached will be scientifically valid (1).\nMethodology has a great impact and role in the originality of thought and the soundness of deduced ideas, information, theories, and concepts. Unless the methodology of research and thinking is sound or consistent with its direction, the results will not be correct and harmonious. A researcher without a methodology falls into mazes of chaos, confusion, contradiction, and confusion of opinions and results. The research remains confused and sterile, and its deductive outcome is contradictory, without unity in direction and result. Thus, many results that the research could have yielded are lost if it had followed sound research methodological principles and foundations, with clear goals and features, and sound visions (2).\nTherefore, it was also necessary to determine for each subject of science and human knowledge its appropriate methodology and special method. So natural sciences have a specific methodology, history has a specific methodology, and each of jurisprudence, creeds, mathematics, philosophy... etc. has its own special methodology within a unified logical scientific framework. That is because methodology preserves for science its order and consistency (3). The progress and retardation of science is dependent on the issue of methodology, revolving with it in existence and non-existence (4).\nIf the matter is so, it is - also - of great danger to adopt incorrect methodologies. Adopting these methodologies is like the absence of the correct methodology, rather it is more dangerous. If a nation adopts a methodology, believes it to be correct, and adheres to it, while this methodology is misleading and does not lead to the desired truth and required knowledge, then this nation would have entangled itself in great mazes and illusions that deviate it from the desired path and the required goal (5).\nAs for its importance in the science of creed and religions in particular, it should be known that the issue of choosing the methodology, and the method of understanding and doctrinal interpretation, is not a subjective issue linked to personal inclinations, or subjective perceptions and desires. Rather, the doctrinal methodology is closely linked to Sharia principles, and to the rational concepts of faith that revolve around the center of departure and the base of understanding and thinking (the doctrine of Monotheism), just as it is linked to the subject of research and its nature.",
    "foot_note": "1. See: Nazra Amma fi Ba'd Manahij Al-Bahth Al-Islamiyyah Dr. Taha Al-Alwani, research published in Majallat Adwa' Al-Sharia issue (8) Jumada Al-Akhirah year 1397 p. 400.\n2. See: Manahij Al-Bahth fi Al-Aqeedah Al-Islamiyyah fi Al-Asr Al-Hadir: Dirasah li Manahij Al-Fikr Al-Islami Al-Mu'asir wa Al-Anasir Al-Manhajiyyah fi Dirasat Usul Al-Din, by Abdul Rahman bin Zaid Al-Zunaidi, p. 18, Dar Ishbiliya, 1416.\n3. See: Manhaj Al-Istidlal 'Ala Masa'il Al-I'tiqad by Uthman bin Ali Hasan, p. 1/21, Maktabat Al-Rushd, Riyadh, Third Edition.\n4. See: Manhaj Al-Bahth Al-Ilmi 'Inda Al-Arab Dr. Jalal Musa p. 271, Manhaj Al-Istidlal 'Ala Masa'il Al-I'tiqad 1/21.\n5. Manahij Al-Bahth fi Al-Aqeedah by Al-Saeed p. 264-265.",
    "book_id": "69",
    "new_page_number": 19
  },
  {
    "serial_number": "285046",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "The researcher in the science of creeds, religions, sects, and doctrines finds himself before a great momentum of contradictory opinions, caused by deviating from the straight path and correct methodology. This confirms the saying of Allah Almighty: {Then do they not reflect upon the Qur'an? If it had been from [any] other than Allah, they would have found within it much contradiction (82)} [An-Nisa: 82] (1) and His saying: {But they denied the truth when it came to them, so they are in a confused condition (5)} [Qaf: 5] (2).\nSince the matter is so, it is not fitting for the researcher seeking the truth to research issues and then judge their owners without researching the evidences that resulted in those issues. For errors in issues cannot be treated without looking into the principles upon which they were built; so researching them remains sterile and futile.\nWith the scientific research methodology in creed, the Muslim researcher can remove many of the problems facing him today. Many sciences and theories called science have been researched according to special research methodologies described as methodical or objective and scientific, and have gained the confidence of all researchers in these fields, indeed won their faith. The results reached are results that clash - in many cases - with the Muslim's creed, and rarely harmonize with the Muslim's overall idea of the universe, man, and life. Objecting to that is almost an objection to accepted scientific issues, because they were researched according to a scientific research methodology, and behind the research methodology itself is the philosophy of other people which the Muslim cannot accept as is. Therefore, it was necessary to work on seeking a methodology for research in these sciences that would be a law protecting the Muslim researcher in them from falling into the errors others fall into, and helping him reach results consistent with the Muslim's creed and his view of the universe, man, and life (3).",
    "foot_note": "1. Surah An-Nisa: Verse 82.\n2. Surah Qaf: Verse 5.\n3. Nazra Amma fi Ba'd Manahij Al-Bahth Al-Islamiyyah Dr. Taha Jabir Al-Alwani, research published in Majallah: Adwa' Al-Sharia, Issue 8 year 1398 (401). See: Manahij Al-Bahth fi Al-Aqeedah p. 266-269.",
    "book_id": "69",
    "new_page_number": 20
  },
  {
    "serial_number": "285047",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "Section Three: Relationship of this Science to Religious Science:\nThe science of research methodologies in creed has a close connection with sciences related to belief. Among these sciences is the science of balancing between religions, or what is known as comparative religion, religious science, religions and sects, or the science of creeds, etc.\nThe science of research methodologies in creed researches the principles from which the people of each religion derived their religion and sayings. Is the origin: Revelation, or something else? Is this revelation distorted, or is it preserved from distortion?... etc. So this science, meaning the science of methodologies, is a basis for knowing religious science, so the researcher in this science cannot do without looking into it (1).\n\nSection Four: Research Methodologies:\nStudents of the science of creed and religions have multiple methodologies in studying them, depending on the purpose of their study. I will mention here the most prominent of these methodologies:\n\nRequirement One: The Historical Descriptive Method:\nIn this methodology, authors follow the aspect of historical descriptive narrative presentation, without judging the statements or critiquing them. This type was followed by early scholars, like Abu al-Hasan al-Ash'ari and al-Shahrastani. Also, there are non-Muslims who followed it, such as Ibn Kammuna the Jew, in his book: \"Tanqih al-Abhath lil-Milal al-Thalath\" (Revision of Inquiries into the Three Faiths).\nThe truth is that this methodology does not perform the required role of the scholar. Rather, such a methodology may lead to what is called the rapprochement of religions. Therefore, this methodology was \"the most abundant of Muslims' methodologies in luck and praise among Western scholars, and with it they are satisfied that scholars of Islam deal with religions\" (2). This is a matter not to be rejoiced at. For this reason, we did not find such a methodology among the scholars of Ahlus-Sunnah wal-Jama'ah, but rather it was found among others.",
    "foot_note": "1. Manahij Al-Bahth fi Al-Aqeedah by Al-Saeed p. 270-272.\n2. Ilm Al-Milal wa Manahij Al-Ulama Fihi p. 188.",
    "book_id": "69",
    "new_page_number": 21
  },
  {
    "serial_number": "285048",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "Requirement Two: The Analytical Critical Method:\nAnalysis is \"a process intended to discover the elements of a specific subject for a special purpose\" (1). And criticism is intended to present those elements to precise scales, to know their correctness from their corruption. The summary of this methodology is: observing phenomena, then judging them, and discussing them.\nThe methodology of analysis and criticism is one of the most prominent characteristics that distinguished Muslim scholars, and specifically: the scholars of the Salaf, Ahlus-Sunnah wal-Jama'ah. For the comprehensiveness of the creed with them, the comprehensiveness of verification and criticism came accompanying it. We find this methodology frequently in the books of the Salaf, especially what relates to refutations of sects and groups or those carrying contrary thought. There is no one among the people of innovation and desires who cared for this matter as much as Ahlus-Sunnah wal-Jama'ah. This methodology has benefited Ahlus-Sunnah wal-Jama'ah greatly, for they preserved their creed by it over the ages and succession of centuries, so you find no contradiction or difference among them (2).\n\nRequirement Three: The Comparative Method:\nIt is a methodology that follows the path of linking multiple subjects, to extract similarities or differences between them, then coming out of that with a judgment supported by the results of the process (3). This methodology in studying beliefs, religions, and sects is a unique methodology characterized by an important result, which is coming out of that comparison with aspects of goodness that implicitly call for the obligation of following it, and discarding falsehood.\nAmong the features of this methodology: showing points of agreement and disagreement between separated sects and different religions. This in turn leads to correct consideration by the wise people of those sects into the truth that others have. Allah Almighty said: {Say, \"O People of the Scripture, come to a word that is equitable between us and you - that we will not worship except Allah and not associate anything with Him and not take one another as lords instead of Allah.\" But if they turn away, then say, \"Bear witness that we are Muslims [submitting to Him].\" (64)} [Ali 'Imran: 64] (4).",
    "foot_note": "1. Manhaj Ahl Al-Sunnah wa Al-Jama'ah fi Al-Radd 'Ala Al-Nasara Dirasah Ilmiyyah min Khilal Juhud Sheikh Al-Islam Ibn Taymiyyah by Dr. Abdul Radi Abdul Mohsen, p. 143 Maktabat Al-Tarbiyah Al-Islamiyyah li Ihya' Al-Turath Al-Islami, First Edition.\n2. Manahij Al-Bahth fi Al-Aqeedah by Al-Saeed p. 295-296.\n3. See Al-Mu'jam Al-Falsafi prepared by the Academy of the Arabic Language, p. 189, Cairo, 1403.\n4. Surah Ali 'Imran Verse: 64.",
    "book_id": "69",
    "new_page_number": 22
  },
  {
    "serial_number": "285049",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "And the Most High said: {Say, \"Praise be to Allah, and peace upon His servants whom He has chosen. Is Allah better or what they associate with Him?\" (59) [More precisely], is He [not best] who created the heavens and the earth and sent down for you rain from the sky, causing to grow thereby gardens of joyful beauty which you could not [otherwise] have grown the trees thereof? Is there a deity with Allah? [No], but they are a people who ascribe equals [to Him]. (60) Is He [not best] who made the earth a stable ground and placed within it rivers and made for it firmly set mountains and placed between the two seas a barrier? Is there a deity with Allah? [No], but most of them do not know. (61) Is He [not best] who responds to the desperate one when he calls upon Him and removes evil and makes you inheritors of the earth? Is there a deity with Allah? Little do you remember. (62) Is He [not best] who guides you through the darknesses of the land and sea and who sends the winds as good tidings before His mercy? Is there a deity with Allah? High is Allah above what they associate with Him. (63) Is He [not best] who begins creation and then repeats it and who provides for you from the heaven and earth? Is there a deity with Allah? Say, \"Produce your proof, if you should be truthful.\" (64)} [An-Naml: 59-64] (1).\nThis methodology was followed by Muslim scholars in their writings and in what they recorded of books (2).\n\nRequirement Four: The Empirical Scientific Method:\nThis methodology is a modern one in which some Muslims in the last Hijri century followed the leaders of modern European thought who stripped themselves of every belief except worldly beliefs. Its followers exist in Islamic countries whose people came into contact with the Western colonizer and intellectual currents coming from the West to the Islamic world, as well as those whose religious and intellectual studies were in the lands of disbelief or universities established in some Islamic countries which belong to disbelieving countries, like some universities belonging to missionary missions.\nThese people have strange opinions on the tools of human knowledge, as they rely only on sensory and experimental methods, and reject any other methodology that contradicts what they are upon, such as the transmission methodology (Naqli) and the rational methodology (Aqli). They attempt to search for divine knowledge and religion with the methods of practical sciences and field experience (3).\nAmong the effects of this doctrine became the interpretation of miracles with a materialistic interpretation and the interpretation of prophethood with genius and human brilliance. What drove them to this was: the desire for renewal and keeping up with worldly scientific development. So they saw that interpreting the Quran with scientific facts and modern discoveries is a strong way to demonstrate the greatness of the Quran and its comprehensiveness of everything.",
    "foot_note": "1. Surah An-Naml Verse: 59-64.\n2. Manahij Al-Bahth fi Al-Aqeedah by Al-Saeed p. 297-298.\n3. See: Al-Tawhid Al-Khalis aw Al-Islam wa Al-Aql Dr. Abdul Halim Mahmoud, Introduction, Dar Al-Kutub Al-Hadithah, 1973.",
    "book_id": "69",
    "new_page_number": 23
  },
  {
    "serial_number": "285050",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "This methodology is dangerous to the Islamic creed, especially if it is known that some concessions and interpretations in it reach the point of apostasy from Islam for its owner. The danger of this methodology has been proven by: the sweeping wave of atheism that engulfed Europe as a result of its incorrect application of this methodology.\nAlso, in this methodology is a great crime against the Holy Quran and the noble Prophetic Sunnah, due to what this matter carries of lack of trust in the Quranic wording and Prophetic wording. Also, this methodology restricts research to cosmic phenomena, and it is known that there are many matters not entering under experiment nor sense. Furthermore, this methodology does not perform the required role, but rather is a way to empower enemies over all doctrinal postulates. Then it becomes difficult for the one who followed this methodology to distinguish between matters, since there is no matter except that it is possible to interpret it by any theory introduced by an innovator just as others were interpreted by other theories (1).\n\nRequirement Five: The Method of Dialogue, Debate, Refutation, and Argumentation:\nSome Muslim scholars in their study of religions followed a defensive direction, confronting missionary campaigns and skepticism that lie in wait for the Islamic society and stir up sedition among Muslims. This direction took the form of live debates between Muslim scholars and disbelievers, from the owners of different religions and sects, and through dialogues and refuting written misconceptions in letters or books. This methodology represents the majority of Muslim scholars' books (2).\n\nRequirement Six: The Comprehensive Scientific Method in Studying Religions:\nThe intended meaning of the comprehensive method is the method that includes all previous methodologies, where it cares for presenting what it deals with in study with an honest presentation, along with discussion, comparison, critical analysis, and refuting falsehood and clarifying it. This may take place in the form of a dialogue or debate. This comprehensive methodology is the ideal one in dealing with the study of religions, as describing religions alone does not suffice, and undirected comparison is useless, and criticism and refutations before fulfilling presentation and discussion might involve avoiding honesty and fairness. Whoever tracks the books of Muslims in studying religions finds this comprehensive methodology. Perhaps the best model for this methodology is the book \"Al-Jawab Al-Sahih Li Man Baddala Din Al-Masih\" (The Correct Answer to Those Who Altered the Religion of Christ) by Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him (3).",
    "foot_note": "1. Manahij Al-Bahth fi Al-Aqeedah by Al-Saeed 299-301.\n2. Ilm Al-Milal wa Manahij Al-Ulama Fihi p. 189.\n3. Previous Source p. 189-190.",
    "book_id": "69",
    "new_page_number": 24
  },
  {
    "serial_number": "285051",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "Chapter Five: The Methodology of Ahlus-Sunnah in Studying Religious Science\nThe true methodology in studying religious science is the one that relies on rules and regulations referring to three matters:\n1 - Sources of inference in studying religions.\n2 - Methodology in inference.\n3 - Method of presentation and refutation.\nI will mention, God willing, in this chapter the methodology of Ahlus-Sunnah in these matters.\n\nSection One: Sources of Inference for Religious Science according to Ahlus-Sunnah:\nThe difference in sources leads to a difference in methodologies and results. Two people might research one subject with different sources, and that would be a cause for their difference in results. Hence, determining sources was among the necessary matters. Ahlus-Sunnah agreed on the sources they relied upon in religious studies:\nFirst: The Holy Quran:\nThe Holy Quran, according to Ahlus-Sunnah wal-Jama'ah, is the first source for knowing truth and falsehood, good and evil. It is the decisive criterion in everything that happens between servants. Holding fast to it has been commanded in more than one place in His Book and by the tongue of His Messenger, peace be upon him. Among that is His saying - the Most High -: {And this [Qur'an] is a Book We have revealed [which is] blessed, so follow it and fear Allah that you may receive mercy. (155)} [Al-An'am: 155] (1). And His saying, the Most High: {Say, \"Obey Allah and the Messenger.\" But if they turn away - then indeed, Allah does not like the disbelievers. (32)} [Ali 'Imran: 32] (2). And His saying, the Most High: {[This is] a Book whose verses are perfected and then presented in detail from [one who is] Wise and Acquainted. (1)} [Hud: 1] (3). And His saying, the Most High: {And thus do We detail the verses, and [thus] the way of the criminals will become evident.} [Al-An'am: 55] (4).\nTherefore, the scholars of the Salaf derived their judgments on other religions from the Holy Quran.",
    "foot_note": "1. Surah Al-An'am Verse: 155.\n2. Surah Ali 'Imran Verse: 32.\n3. Surah Hud Verse: 1.\n4. Surah Al-An'am: 55.",
    "book_id": "69",
    "new_page_number": 25
  },
  {
    "serial_number": "285052",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "Ibn Hazm, may Allah have mercy on him, says: \"We - God willing - will mention the description of the modes of transmission that Muslims possess for their Book and their religion, then what they transmitted from their Imams so that the believer and disbeliever, the scholar and the ignorant, may stand upon it visibly, God willing, so they know where the transmission of other religions stands in relation to their transmission\" (1).\n\nSecond: The Prophetic Sunnah:\nThe Sunnah is everything that issued from the Prophet, peace be upon him, of saying, action, or approval. It is revelation like the Quran. The Most High said: {Nor does he speak from [his own] inclination. (3) It is not but a revelation revealed. (4)} [An-Najm: 3-4] (2). It is like the Quran in authority. The Prophet, peace be upon him, said: \"Verily I have been given the Book and something like it with it...\" (3). Based on this, they relied on it in the field of studying religions.\n\nThird: Consensus (Ijma'):\nConsensus is a proof by indication of the Quran, Sunnah, and reason. From the Quran is His saying, the Most High: {And whoever opposes the Messenger after guidance has become clear to him and follows other than the way of the believers - We will give him what he has taken and drive him into Hell, and evil it is as a destination. (115)} [An-Nisa: 115] (4).\nFrom the Sunnah is his saying, peace be upon him: \"Indeed Allah will not gather my nation - or he said the nation of Muhammad, peace be upon him - on misguidance, and the Hand of Allah is with the congregation (Jama'ah), and whoever deviates, deviates into the Fire\" (5).",
    "foot_note": "1. See: Al-Fisal fi Al-Milal wa Al-Ahwa' wa Al-Nihal, by Ibn Hazm, investigation by Muhammad Ibrahim Nasr, Abdul Rahman Umayra, 2/219, Dar Al-Jeel, Beirut.\n2. Surah An-Najm Verses 3-4.\n3. Narrated by Abu Dawood, Hadith No. 4591, see: Awn Al-Ma'bud: 12/231.\n4. Surah An-Nisa Verse: 115.\n5. Narrated by Al-Tirmidhi, Hadith No.: 2255 and he said this is a Gharib Hadith from this aspect. See: Tuhfat Al-Ahwadhi Sharh Sunan Al-Tirmidhi, by Abu Al-Ala Muhammad bin Abdul Rahman Al-Mubarakpuri, 6/322, Dar Al-Kutub Al-Ilmiyyah, Beirut, First Edition, and Mishkat Al-Masabih, by Muhammad Abdullah Al-Khatib Al-Tabrizi, investigation by Muhammad Nasir al-Din al-Albani, Hadith No. 24 p. 1/61, Al-Maktab Al-Islami, Beirut, Second Edition, and Al-Albani authenticated it.",
    "book_id": "69",
    "new_page_number": 26
  },
  {
    "serial_number": "285053",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "Sheikh al-Islam Ibn Taymiyyah says: \"And Consensus is the third principle relied upon in knowledge and religion\" (1). Ahlus-Sunnah wal-Jama'ah do not differentiate in the authority of Consensus between doctrinal matters and others. Also, Consensus repels the probability of error that might occur in speculative matters (Zanniyat), so they rise - thanks to Consensus - to the status of definitive matters (Qat'iyat) (2).\nThe intent here is to clarify that Consensus is a source of religious knowledge for Ahlus-Sunnah wal-Jama'ah, and that it is relied upon in all chapters of religion, and that includes legal rulings related to people of other religions. So everyone engaged in studying religions should know the places of Consensus in the rulings of the people of religions.\n\nFourth: Reason (Aql):\nSheikh al-Islam Ibn Taymiyyah says clarifying the concept of reason according to Ahlus-Sunnah: \"Reason is a condition for knowing sciences, and the perfection of the righteousness of deeds. By it, knowledge and action are completed, but it is not independent in that\" (3). So reason, according to Ahlus-Sunnah, is an innate instinct in humans, by which they can distinguish between truth and falsehood in beliefs, and right and wrong in sayings and actions, but without independence from Revelation. This limitation of the concept of reason indicates that the Salaf cared for reason realizing its great status.\nThe scholars of Ahlus-Sunnah made reason one of their pillars in studying religions. Here is Ibn Taymiyyah saying, explaining the foundations of his methodology in refuting the Christians: \"And we will clarify - God willing - that what the Christians hold of Trinity and Union was not indicated by anything from the Books of God, neither the Gospel nor others. Rather, they indicated the opposite of that. Nor did reason indicate that; rather, explicit reason with the texts of the prophets indicates the opposite of that\" (4).",
    "foot_note": "1. Majmu' Al-Fatawa 3/154.\n2. See: Manhaj Al-Istidlal 'Ala Masa'il Al-I'tiqad 1/151-154.\n3. Majmu' Al-Fatawa 3/338-339.\n4. See: Al-Jawab Al-Sahih 1/23.",
    "book_id": "69",
    "new_page_number": 27
  },
  {
    "serial_number": "285054",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "Section Two: Methodology of Inference:\nKnowing this methodology is important, as everyone who affiliates with Islam claims to derive their rulings from the Quran and Sunnah and rely on them. The difference in the methodology of inference is the deciding factor between the methodology of Ahlus-Sunnah in dealing with evidences and the methodologies of opponents. Ahlus-Sunnah have methodological rules that distinguish and regulate their methodology in inference. Adherence to these rules spared them the turmoil in methodology and intellectual confusion that accompanied other sects. Among the most important of these rules in the field of studying religions are:\n\n1 - Belief in all texts of the Quran and Sunnah and submitting to them:\nThe Most High said: {So do you believe in part of the Scripture and disbelieve in part? Then what is the recompense for those who do that among you except disgrace in worldly life; and on the Day of Resurrection they will be sent back to the severest of punishment.} [Al-Baqarah: 85] (1).\nAhlus-Sunnah wal-Jama'ah adhered to this rule in compliance with Allah's command, and precaution against this threat directed to those who believed in part of the Book and disbelieved in part. Sheikh al-Islam, may Allah have mercy on him, said: \"Whatever came in the Book and Sunnah, it is obligatory for every believer to believe in it even if he does not understand its meaning\" (2).\nIbn Abi Al-Izz said: \"So the obligation is complete submission to the Messenger, peace be upon him, compliance with his command, and receiving his report with acceptance and belief, without opposing it with a false imagination we call reasonable, or carrying it as a doubt, or prioritizing men's opinions and the scum of their minds over it. So we single him out with judgment, submission, compliance, and obedience\" (3).\n\n2 - The Quran and Sunnah Contain the Fundamentals of Religion:\nAhlus-Sunnah wal-Jama'ah believe that the Quran and Sunnah are sufficient for matters of religion, fundamentals and branches. The Most High said: {And We have sent down to you the Book as clarification for all things and as guidance and mercy and good tidings for the Muslims. (89)} [An-Nahl: 89] (4). And the Most High said: {We have not neglected in the Register a thing.} [Al-An'am: 38] (5).",
    "foot_note": "1. Surah Al-Baqarah Verse: 85.\n2. Majmu' Al-Fatawa 3/41.\n3. Sharh Al-Aqeedah Al-Tahawiyyah by Ibn Abi Al-Izz Al-Hanafi investigation by Dr. Al-Turki and Al-Arnaout, p. 1/228, Mu'assasat Al-Risalah, 1415.\n4. Surah An-Nahl Verse: 89.\n5. Surah Al-An'am Verse: 38.",
    "book_id": "69",
    "new_page_number": 28
  },
  {
    "serial_number": "285055",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "Even opponents from other nations testified to this perfection and sufficiency in everything. A Jew said to Salman Al-Farisi, may Allah be pleased with him: \"Your Prophet, peace be upon him, has taught you everything, even defecation. He said: Yes, indeed he forbade us from facing the Qiblah for defecation or urination\" (1). If the Prophet, peace be upon him, taught the nation even defecation, then it is more appropriate that he teach them the universals of this religion. This is what Ahlus-Sunnah firmly believe, unshaken by doubts or tribulations. Their sayings have corroborated this:\nIbn Hazm says: \"The Book of Allah Almighty... is the gatherer of the sciences of the ancients and the later ones... He did not neglect anything in it... whoever understands it, it suffices him, and the Sunnahs of the Messenger of Allah, peace be upon him, are the clarification of truth and the light of intellects\" (2).\nIbn Taymiyyah says: \"Everything people need in their religion, Allah and His Messenger have clarified it with a healing clarification\" (3).\nThe importance of this rule and its great benefit appeared among the scholars of the Salaf in the field of studying religions, especially in comparing Islam with Judaism and Christianity.\n\n3 - The Fundamentals of Religion are One, No Abrogation in Them nor in Reports:\nKnowing what accepts abrogation from what does not in the Sharia is a matter of utmost importance, because through it one realizes that abrogation does not entail an impossible matter; rather it is for wisdom and benefit. Also, the lie of one who claims abrogation of what does not accept abrogation in matters of religion is known by it. The reality of the matter is that Sharia is of two types:\nFirst: News (Khabar): This includes everything Allah Almighty informed that will be, or was, or promised us, or narrated to us from the news of past nations, and what He narrated to us from the news of Paradise and Hell, Reckoning, Punishment, Resurrection, Gathering, Creation of Heavens and Earth... as well as what Allah Almighty informed us about His Self, Attributes, and Actions. This and the like of pure news does not accept abrogation (4).\nSecond: Commands and Prohibitions: Abrogation is permissible in them provided they do not relate to beliefs, mothers of ethics (major moral principles), and fundamentals of worship and transactions, because Sharia is built on preserving these universals (5).",
    "foot_note": "1. Narrated by Muslim: Book of Purification, Chapter on Etiquette of Defecation p. 129, Hadith No. 262.\n2. See: Al-Fisal fi Al-Milal wa Al-Ahwa' wa Al-Nihal 2/234 with modification.\n3. Majmu' Al-Fatawa 2/237.\n4. See: Al-Idah li Nasikh Al-Quran wa Mansukhihi by Abu Muhammad Makki Ibn Abi Talib Al-Qaisi investigation by Ahmed Hasan Farhan, p. 57, Imam Muhammad bin Saud Islamic University, First Edition.\n5. Previous Source p. 75, Manahil Al-Irfan fi Ulum Al-Quran by Muhammad Abdul Azim Al-Zarqani, p. 2/211, Issa Al-Babi Al-Halabi Press. Mabahith fi Ulum Al-Quran by Sheikh Manna' Al-Qattan, p. 233, Mu'assasat Al-Risalah Thirty-Second Edition.",
    "book_id": "69",
    "new_page_number": 29
  },
  {
    "serial_number": "285056",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "Based on this, speech is directed to the first type when it is said that the fundamentals of heavenly religions are one with no abrogation in them, and to the second type when it is said that Islam abrogates previous religions. The intent here is to clarify that Muslim scholars determined what accepts abrogation from what does not. So what is transmitted from previous prophets is confined to either being of the type that accepts abrogation - so if this contradicts an established ruling in Islam, it is known to be either abrogated or altered - or if something is transmitted contradicting Islamic Sharia from what does not accept abrogation, the falseness of this transmitted matter is known definitively. This approach is only sound for one who proceeds from this rule.\n\n4 - Referring Disputes to the Quran and Sunnah:\nThe methodology of Ahlus-Sunnah is distinguished by judging by Sharia and seeking judgment from it in what people dispute about in matters of religion, in compliance with the command of Allah Almighty: {And if you disagree over anything, refer it to Allah and the Messenger, if you should believe in Allah and the Last Day. That is the best [way] and best in result. (59)} [An-Nisa: 59] (1).\nAnd out of certainty from them that the Book came to judge between people in what they differed in. The Most High said: {...painful. (63) And We have not revealed to you the Book, [O Muhammad], except for you to make clear to them that wherein they have differed and as guidance and mercy...} [An-Nahl: 64] (2).\nIbn Hazm said: \"It is not permissible for a Muslim who acknowledges Monotheism to refer in dispute to other than the Quran and the report from the Messenger of Allah, peace be upon him, nor to refuse what is found in them. If he does that after the proof is established against him, he is a sinner (Fasiq). As for the one who does it considering exiting their command lawful, and necessitating obedience to someone other than them, he is a disbeliever (Kafir) without doubt to us in that\" (3).\nThe people of truth used this rule with the People of the Scripture, and in this matter they are following the Quran which demanded them to establish their religion and judge by what Allah revealed to them. The Most High said: {O People of the Scripture, you are [standing] on nothing until you uphold [the law of] the Torah, the Gospel, and what has been revealed to you from your Lord.} [Al-Ma'idah: 68] (4). And the Most High said: {And let the People of the Gospel judge by what Allah has revealed therein. And whoever does not judge by what Allah has revealed - then it is those who are the defiantly disobedient. (47)} [Al-Ma'idah: 47] (5).",
    "foot_note": "1. Surah An-Nisa Verse: 59.\n2. Surah An-Nahl Verse: 64.\n3. Al-Ihkam: p. 1/99.\n4. Surah Al-Ma'idah Verse: 68.\n5. Surah Al-Ma'idah Verse: 47.",
    "book_id": "69",
    "new_page_number": 30
  },
  {
    "serial_number": "285057",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "5 - Warding off Contradiction between Texts of the Quran and Sunnah:\nFrom the starting points of Ahlus-Sunnah's methodology and its postulates is certainty in the impossibility of contradiction between texts of the Quran and Sunnah with each other, as all of it is revelation from Allah. Allah says: {Then do they not reflect upon the Qur'an? If it had been from [any] other than Allah, they would have found within it much contradiction (82)} [An-Nisa: 82] (1). Likewise, the Sunnah is revelation by indication of the Quran, {Nor does he speak from [his own] inclination. (3) It is not but a revelation revealed. (4)} [An-Najm: 3-4] (2).\nIf someone thinks there is a contradiction between some texts, it is in the understanding of the observer, not in the matter itself. Al-Shatibi said: \"Evidences of Sharia do not contradict in the matter itself. Therefore, you will never find two evidences on whose contradiction Muslims agreed, such that suspension was obligatory upon them. But contradiction may occur in the understanding of the observer\" (3).\nMuslims used this rule in refuting the People of the Scripture, and clarifying the invalidity of their religions, by proving the differences and contradictions present in their books, which indicate that these books have been distorted and altered, and do not represent in any way a revelation sent down from Allah.\n\n6 - Warding off Contradiction between Transmitted Evidences and Rational Evidences:\nFrom the methodological foundations in dealing with evidences according to Ahlus-Sunnah wal-Jama'ah is certainty in the non-contradiction between auditory legal evidences (revelation) and rational evidences. That is because authentic transmission and explicit reason are both legal evidences, and legal evidences all came from Allah, so their contradiction is impossible. Whatever issues are imagined to have a contradiction between reason and transmission, the matter is not devoid of: either it is not from the evident issues known by explicit reason, or the transmission used as evidence is a fabricated lie known to the people of transmission to be a lie, or the transmission is authentic but in a weak indication which the one using it as evidence mistakenly attributed to the Sharia (4). Every explicit sound reason free from misconceptions matches the authentic explicit transmission (5).",
    "foot_note": "1. Surah An-Nisa Verse: 82.\n2. Surah An-Najm Verses: 3-4.\n3. Al-Muwafaqat fi Usul Al-Sharia, by Abu Ishaq Ibrahim Al-Shatibi, p. 4/294, Al-Maktabah Al-Tijariyah Al-Kubra, Cairo.\n4. See: Dar' Ta'arud Al-Aql wa Al-Naql 1/148.\n5. See: Majmu' Al-Fatawa 18/240.",
    "book_id": "69",
    "new_page_number": 31
  },
  {
    "serial_number": "285058",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "Sheikh al-Islam Ibn Taymiyyah said: \"I have contemplated that in most of what people disputed about, and I found what contradicted authentic explicit texts to be corrupt misconceptions, known by reason to be invalid. Rather, reason knows the proof of its contradictory which agrees with the Sharia. I contemplated it in major fundamental issues, like issues of Tawhid, Attributes, Predestination, Prophethoods, Hereafter and other than that, and I found what is known by explicit reason was never contradicted by hearing (revelation)\" (1).\nAnd Sheikh al-Islam Ibn Taymiyyah said when explaining his methodology in refuting the Christians: \"We - and to Allah belongs praise and favor - show that everything they argued with of auditory argument from the Quran, or from books preceding the Quran, or rational, there is no argument for them in any of it. Rather, all books along with the Quran, and reason are arguments against them not for them. Rather, most of what they argue with from texts of prophets, and from rationality is itself an argument against them, and the corruption of their saying appears from it\" (2).\n\n7 - Combining Belief in the Ambiguous (Mutashabih) and Acting upon the Clear (Muhkam):\nAhlus-Sunnah wal-Jama'ah took a correct stance regarding the clear and ambiguous, represented in believing in the whole Book, its clear and ambiguous, with acting upon the clear, and believing in the ambiguous (3) until its meaning becomes clear and its indication becomes evident, by contemplating it, continuing to look, or referring it to the clear texts, for texts explain each other (4).\nAhlus-Sunnah used this rule after editing and defining it in this manner in refuting the followers of religions from Jews and Christians, whose habit was following ambiguities and leaving explicit texts, whether in their religions or in what they argued with of Quranic texts for the validity of their religions.\n\n8 - Taking the Apparent Meanings of Texts:\nThe intended meaning of apparent meanings of texts is what comes to the mind of the addressee of meanings, not the terminological 'Apparent' (Zahir) according to Usul scholars which corresponds to 'Text' (Nass) (5). The intent here is that the apparent meanings of texts are understood by the addressees (6). So they must be taken. The evidence for that is that Allah sent His messengers in the languages of their people. He said: {And We did not send any messenger except [speaking] in the language of his people to state clearly for them} [Ibrahim: 4] (7).",
    "foot_note": "1. Dar' Ta'arud Al-Aql wa Al-Naql 1/147.\n2. Al-Jawab Al-Sahih 1/104, Dar Al-Asimah.\n3. See: Majmu' Al-Fatawa 17/386, Al-I'tisam 2/336.\n4. See: Manhaj Al-Istidlal 'Ala Masa'il Al-I'tiqad 2/491.\n5. See Bada'i Al-Fawa'id by Ibn al-Qayyim, p. 4/9, Dar Al-Kitab Al-Arabi, Beirut.\n6. See: Manhaj Al-Istidlal 'Ala Masa'il Al-I'tiqad 2/437.\n7. Surah Ibrahim Verse: 4.",
    "book_id": "69",
    "new_page_number": 32
  },
  {
    "serial_number": "285059",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "The reason for sending messengers in the languages of their people is to achieve clarification (Tabyin), which is the explanation by which the intended meaning is obtained, the argument is established, and the excuse is cut off. This implies that the prophets came with clear speech understood by those addressed by it. This is the doctrine of the Salaf, so they did not divert texts from their apparent meaning indicated by the Arabic language, and understood them according to the custom of Arabs in speech.\n\n9 - Islam is the Religion Dominant over Other Religions:\nBased on this, Islam is the only religion through which the reality of previous religions is known, for it is the source and document for them. Thus He said: {And We have revealed to you, [O Muhammad], the Book in truth, confirming that which preceded it of the Scripture and as a criterion over it.} [Al-Ma'idah: 48] (1).\nThe Quran is the criterion (Muhaimin), meaning the trusted witness. It witnesses to what is in the books of the People of the Scripture of truth, clarifies what was distorted in them, judges by what Allah confirmed and commanded of their rulings, and abrogates what Allah abrogated. It is a trustee over them in all that (2).\nFor this reason, Ibn Jarir said: \"The Quran is a trustee over the books preceding it. Whatever of them agrees with it is truth, and whatever opposes it is falsehood\" (3).",
    "foot_note": "1. Surah Al-Ma'idah Verse: 48.\n2. Munazarah Bayna Al-Islam wa Al-Nasraniyyah prepared by Jamal Abdul Hadi, p. 402, edition of the General Presidency for Departments of Scientific Research, Ifta, Da'wah and Guidance.\n3. See: Tafsir Ibn Kathir 2/62.",
    "book_id": "69",
    "new_page_number": 33
  },
  {
    "serial_number": "285060",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "Section Three: Methodology in Presentation and Refutation:\nThe one who contemplates the books of the Salaf on religions and sects notices that their methodology in presentation, discussion, refutation, and debates was distinguished from other methodologies by characteristics representing rules and regulations in presentation, discussion, refutation, and debate. It is a comprehensive methodology that presents the religions required for study, discusses their principles, analyzes them critically, then refutes the falsehood in them.\n\nFirst: Presentation and its Characteristics:\nPresentation is the form or mold through which the author presents his subject. Styles of presentation vary from author to author, and vary according to the difference in the research subject. Since engaging in religious science is linked to the Muslim's creed as a tool for calling to Allah Almighty and defending the religion, he must make his presentation of religions and sects a presentation that achieves the legal goals for which this science is studied, and be consistent with the Quran's methodology in presenting religions and critiquing them. The observer of Salaf's books finds that their presentation of them is characterized by matters including:\n1 - Clarity:\nThe clarity that characterized the Salaf's methodology in studying religions goes back to their following the Quranic methodology which presents issues of religion in an easy clear style understood by all people. The Most High said: {And We have certainly made the Qur'an easy for remembrance, so is there any who will remember? (17)} [Al-Qamar: 17] (1). And following the methodology of the Prophet, peace be upon him, who used to treat matters with few clear words that run the course of proverbs and wisdom due to fewness of words, abundance of meanings, and clarity. If you contemplate his saying, peace be upon him: \"What I forbade you, avoid, and what I commanded you, do of it as much as you can. For those before you were only destroyed by their excessive questioning and their disagreeing with their prophets\" (2), the reason for the destruction of previous nations becomes clear to you, which is their excessive questioning and disagreeing with their prophets.\n2 - Accuracy and Comprehensiveness in Presentation:\nAccuracy and comprehensiveness are requirements of scientific integrity, and it is required in everything presented regardless of the opponent's enmity. Lying against him is not permissible; rather his creed and thoughts are presented as they are in the sources considered by him.",
    "foot_note": "1. Surah Al-Qamar Verse: 17.\n2. Narrated by Muslim: Book of Virtues, Chapter on Revering him, peace be upon him, and leaving excessive questioning about what is not necessary, or not related to obligation, and what does not occur and the like, p. 959, Hadith No. 1337.",
    "book_id": "69",
    "new_page_number": 34
  },
  {
    "serial_number": "285061",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "If you contemplate the books of religions and sects, you find that their commitment is a natural result of their belief in the absolute obligation of justice, and their realization that critiquing religions and sects is not valid for them with a deficiency in presenting them, because that allows the opponent to argue against them that the presentation is deficient and the critique is false (1).\nIbn Taymiyyah says in his refutation of the Christians: \"And I mention what they mentioned in their exact words, section by section, and I follow each section with what suits it of answer, branch and root, tying and untying\" (2).\nFrom that also is not issuing a general judgment on the people of a religion or sect before research and induction are achieved. So they were keen on the comprehensiveness of induction, and not issuing general judgments except after verification and scrutiny. With this accuracy resulting from wide reading and comprehensive induction, the Salaf used to present the beliefs and opinions of the people of religions and sects.\n3 - Presentation Suggesting the Legal Ruling:\nOne of the characteristics of Ahlus-Sunnah's methodology in presenting beliefs and ideas of those opposing Islam is that the legal ruling of the religions being studied appears through the presentation and context in which they cite, and the introductions and starting points they present which suggest the judgment of what will be presented. Also through adherence to legal terms that the Lawgiver applied to the people of religions and sects such as naming them disbelievers and enemies. Then by their keenness to present falsehood in its true form which shows its corruption. Sheikh al-Islam Ibn Taymiyyah said: \"As for the false saying, if it is clarified, its clarification shows its corruption\" (3).\n\nSecond - In Discussion and Refutation:\nIf some historians of religions and sects sufficed with describing religions and presenting them without clarifying their correct from their corrupt, the scholars of the Salaf described and presented them for the sake of discussion and criticism. Their ability to discuss goes back to the following matters:\n1 - Being owners of a clear methodology free from errors, contradictions, and confusion.\n2 - The intensity of their enthusiasm, jealousy, and keenness to protect the religion, and their dedication to defending it against all opponents. This enthusiasm and jealousy drove them to engage in discussions and debates with opponents, consequently gaining them experience and knowledge in methods of dialogue and discussion.\n3 - Their wide knowledge and high standing in Sharia sciences.",
    "foot_note": "1. See: Muslimu Ahl Al-Kitab wa Atharuhum fi Al-Difa' 'an Al-Qadaya Al-Quraniyyah, Dr. Muhammad Al-Suhaim, p. 2/774, Dar Al-Furqan, First Edition.\n2. Al-Jawab Al-Sahih 1/99.\n3. Majmu' Al-Fatawa: p. 2/145. See: Ilm Al-Milal wa Manahij Al-Ulama Fihi p. 225-233.",
    "book_id": "69",
    "new_page_number": 35
  },
  {
    "serial_number": "285062",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "They discussed the creeds of nations and their ideas with a discussion based on knowledge and justice, far from provocative emotion, or pretension and desire. Among the pillars of this discussion were critical analysis: scientific comparison far from detestable fanaticism, and solid refutation.\nComparison according to the scholars of the Salaf sometimes occurs between truth and falsehood, such as the comparison between Islam and distorted religions (1). Sometimes it is between two truths, such as the comparison between Islam and Judaism before its distortion and abrogation. And sometimes it is between two falsehoods, such as the comparison between false religions, to show that the disbelief of some and the corruption of their creeds is more severe than others. This is a Quranic methodology. The Most High said: {You will surely find the most intense of the people in animosity toward the believers [to be] the Jews and those who associate others with Allah} [Al-Ma'idah: 82] (2).\nThe intent of all these comparisons is to clarify the truth and expose falsehood.\nThe refutation according to the Salaf was distinguished by matters, the most important of which are: strength of refutation, and the tight dismantling of the misconceptions of the people of religions and sects, such that what the people of falsehood think are arguments and proofs cannot stand. Due to the importance of this matter, the Salaf forbade debating with those who are not qualified for debate.\nSheikh al-Islam Ibn Taymiyyah said: \"They may forbid arguing and debating if the debater is weak in knowledge of the proof and answering the misconception...\" (3).",
    "foot_note": "1. Al-Jawab Al-Sahih 2/4, 2/52, 4/46.\n2. Surah Al-Ma'idah Verse: 82.\n3. Dar' Ta'arud Al-Aql wa Al-Naql: 7/173. See: Ilm Al-Milal wa Manahij Al-Ulama Fihi p. 233-235.",
    "book_id": "69",
    "new_page_number": 36
  },
  {
    "serial_number": "285063",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "Chapter Six: Methodologies of those opposing Ahlus-Sunnah in studying religions and critiquing them\n\nSection One: Methodologies of the theologians (Ahl al-Kalam) in studying religious science:\nSome innovative sects have a role in this science, which makes it necessary for every researcher in the methodologies of Muslim scholars in studying religious science and sects to address them with study, criticism, and scrutiny to distinguish truth from falsehood. By clarifying the error of the methodologies of those opposing the methodology of Ahlus-Sunnah wal-Jama'ah, the correctness and validity of the methodology of Ahlus-Sunnah wal-Jama'ah becomes clear.\nThe trends opposing the methodology of Ahlus-Sunnah in studying religions and sects varied, and they are the same trends that opposed the methodology of Ahlus-Sunnah in the fundamentals of religion. Based on the foundations they were built upon and the rules they adopted in inference and understanding texts, they studied religions, although some of these trends did not have clear efforts in studying religions.\nFor example, Sufism does not have apparent efforts in the field of religious science and sects like some other theological sects; this is due to their isolation from mixing with others. Then their methodology in acquiring knowledge contributes to this, as most Sufis differentiate between knowledge (Ilm) and gnosis (Ma'rifah), claiming that Ma'rifah requires direct connection - meaning without an intermediary between the servant and his Creator - and that the word Ilm is not synonymous with the word Ma'rifah. The meaning is that Sufis did not rely on senses, nor on reason and transmission, but rather relied on states, tastes, and ecstasies which are of the emotional type that are not known by reason but by the heart only, and which are not derived from experience, nor a teacher, nor a book, but from an inner tasting experience, and the knowledge of the heart that knows and witnesses (1).\nThe isolation of Sufism and their innovation of this methodology, which led them to deny the legal methodology based on transmission and reason, led to their lack of prominence in the field of religious science and sects, since this science is among the sciences that rely on transmission and reason. This trend cannot represent Islam and its methodology in the field of studying religions due to its opposition to the methodology of Ahlus-Sunnah wal-Jama'ah in practice and belief.\nAs for the philosophers, whether they were pure philosophers or those who mixed philosophy with theological opinions, they were not far from the field of religious science and sects. Philosophy, by the nature of its subject and the scientific environment that was dominated by theological sects, helped philosophers in Islam to delve into the field of religious science and sects.\nReligious science and sects according to this trend, which leaned towards the ancient philosophers and adopted their method in establishing unseen truths, researching matters of religion, and defending it, was nothing but a collection of opinions, logical syllogisms, and philosophical justifications. Religious science and sects according to the method of these people is useless in establishing the truth and defending it because it is built on a methodology foreign to the truth, so it should be excluded.\nPerhaps the locus of error and danger in this trend can be summarized as follows:\n1 - The statements of philosophers regarding Divinity, Prophethood, and the Hereafter clash with the fundamentals of the Islamic religion, where philosophers claim the eternity of the world, that Allah knows universals but not particulars, the resurrection of souls without bodies, and making prophethood of the same genus as dreams.\n2 - Reliance on reason in establishing beliefs.",
    "foot_note": "1. See: Al-Firaq Al-Kalamiyyah Al-Islamiyyah Dr. Ali Abdul Fattah Al-Maghribi, p. 119, Maktabat Wahbah, Cairo, Second Edition.",
    "book_id": "69",
    "new_page_number": 37
  },
  {
    "serial_number": "285064",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "As for the theological trend, it is one of the most important trends because most innovative sects fall under it. The Shia, Maturidis, Kullabis, Mu'tazila, Ash'aris, and other innovative sects that took a rational approach are classified in this trend. Also, this trend is considered one of the trends most interested in religious science and sects. Although each of these categories dealt with establishing the Islamic creed and refuting its opponents according to the perspective it chose, the framework that unites them is the theological methodology.\nThe Mu'tazila, for example, had efforts in religious science and sects. They had rounds and bouts in confronting the people of religions, sects, and creeds that rarely have a parallel in other theological sects. Their efforts included refuting Jews and Christians, and positive religions like Zoroastrianism, Sabianism, Zoroastrianism, and Brahminism, and against heretics and other opponents within Islam or the sect (1).\nThe errors of the Mu'tazila in the field of studying religions occurred where religious science and sects were studied in light of their Five Principles. The Mu'tazila believed in the Five Principles (2) and subjected the texts of revelation to these principles, either by interpretation (Ta'wil) or by rejecting the Sunnah which they claimed were Ahad (solitary) hadiths. Then, in light of those principles, they resisted the doctrinal challenges that originated from the people of different religions. Monotheism (Tawhid) or absolute transcendence of Allah, which for the Mu'tazila means \"negating the attributes of the Lord,\" was in confrontation with the saying of multiple gods believed by Christians and Dualists, and anthropomorphism and likening (Tashbih) which was known in Jewish beliefs, and Union (Ittihad) and Incarnation (Hulul) whose source was either Jews or the religions of India like Brahmins and Buddhism (3).\nThe error into which the Mu'tazila fell is that they confronted an error with an error.\nAs for the Ash'aris, they presented great efforts in the field of religious science and sects. These efforts were represented in independent works for this science, and in topics included in other sciences, especially in Ilm al-Kalam (Theology) and in the refutations and debates that used to happen between Ash'ari notables and followers of religions, sects, and creeds. Therefore, you find that most books that spoke about sects, creeds, and religions are Ash'ari books. Among them is Al-Baqillani who refuted all categories of religions, sects, and creeds through his book Al-Tamhid. And Al-Juwayni presented many efforts through his theological books like Al-Shamil and Al-Irshad and through his book \"Shifa' Al-Ghalil\". And Al-Ghazali who wrote in refutation of Christians. Then Al-Shahrastani, the owner of the encyclopedia and circle of knowledge in religions and sects. And Al-Baghdadi, the author of the book Al-Milal wa Al-Nihal. However, they also refuted error with error based on their beliefs in Tawhid, Names and Attributes, and other doctrines. Discussion about clarifying their error in that will come in the next section.",
    "foot_note": "1. See: Tarikh Al-Madhahib Al-Islamiyyah by Muhammad Abu Zahrah, p. 131, Dar Al-Fikr Al-Arabi 1989 AD., Muqaddimat Al-Ulum wa Al-Manahij by Anwar Al-Jundi, p. 2/96-99, Dar Al-Ansar, Cairo.\n2. See: Al-Usul Al-Khamsah 'Inda Al-Mu'tazila by Awad Al-Mu'taq.\n3. Mabahith fi Manhajiyyat Al-Fikr Al-Islami, Dr. Abdul Majeed Al-Najjar, p. 83, Dar Al-Gharb Al-Islami, First Edition.",
    "book_id": "69",
    "new_page_number": 38
  },
  {
    "serial_number": "285065",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "Section Two: The Methodological Foundations for Studying Religions and Sects according to the Theologians and Critiquing them:\n\nFirst: Sources of Inference according to Opponents:\nWhat is established in this issue among most sects is that the sources of inference are: the same sources as Ahlus-Sunnah. Wasil, the leader of the Mu'tazila, said clarifying the sources of inference: \"The truth is known from four aspects: A speaking Book (Quran), an agreed-upon report (Hadith), a rational argument, or a consensus of the Ummah\" (1).\nIt was stated in Sharh Al-Usul Al-Khamsah: That the evidences are four: Argument of reason, the Book, the Sunnah, and Consensus (2). This is according to the Mu'tazila. As for when we come to the Ash'aris, we find them adding another source to the previous four, which is Analogy (Qiyas) (3). But some of them returned Analogy to the Text and Consensus, so evidences were restricted for him to the other four (4).\nTheoretically, it is close to the methodology of Ahlus-Sunnah, even if it differed in differentiating between Mutawatir and Ahad hadiths. But if we move to the stance of the people of desires regarding the indication of texts and how to arrange and infer from them, we find it contrary to the methodology of Ahlus-Sunnah; in that they prioritized reason over transmission, opposed Sharia texts with reason, and so on.\n\nSecond: Prioritizing Reason over Transmission:\nThe Mu'tazila, Ash'aris, and other innovators oppose Ahlus-Sunnah in the order of sources of inference and the authority of their indication, as they prioritized reason over transmission. Consequently, it is not valid to infer with an auditory (textual) evidence on any of the theological issues related to the existence of Allah Almighty and His attributes and everything on which the validity of prophethood depends.\nIndeed, excess reached some theologians where they tried to weaken the auditory evidence absolutely, whether Quran or Sunnah, in issues of creed, and prioritize rational evidence over it, as Al-Razi did when he said: \"Auditory evidences do not provide certainty or decisiveness,\" claiming that \"Verbal evidences are based on speculative premises, and what is based on speculative premises is speculative: so inference by discourse yields only conjecture\" (5).",
    "foot_note": "1. See: Nash'at Al-Fikr Al-Falsafi fi Al-Islam Dr. Ali Sami Al-Nashar 1/403, Dar Al-Ma'arif, Third Edition.\n2. Sharh Al-Usul Al-Khamsah, by Abdul Jabbar bin Ahmad Al-Mu'tazili, investigation by Abdul Karim Uthman, p. 88, Maktabat Wahbah, Cairo, First Edition.\n3. See: Al-Ihkam fi Usul Al-Ahkam Al-Amidi 1/135, investigation by Ibrahim Al-Ajouz, Dar Al-Kutub Al-Ilmiyyah, Beirut, First Edition.\n4. See: Previous Source 1/136.\n5. Al-Mahsul fi Ilm Usul Al-Fiqh, by Fakhr Al-Razi investigation by Dr. Taha Jabir Al-Alwani, p. 1/547, Imam Muhammad bin Saud Islamic University 1399.",
    "book_id": "69",
    "new_page_number": 39
  },
  {
    "serial_number": "285066",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "In light of this approach that weakens Sharia texts and excessively venerates reason, the theologians discussed followers of other religions. Here is Judge Abdul Jabbar saying in the context of his discussion of Christian beliefs: \"As for the one among them who relies in this chapter on following predecessors, returning to books, and imitating disciples, his saying is invalid, because speech about the attribute of the Eternal (Al-Qadim) Almighty and what is valid for Him and what is not, it is not permissible to return in it to hearing (texts)...\" (1).\nIndeed, we find him declaring that his use of texts as evidence, even in issues where he cited texts, was for the sake of support not reliance. The Judge says in the chapter \"Proving that he, peace be upon him, is sent to all people\" after citing many transmitted texts: \"We only mention these wordings for confirmation, and the reliance is what we mentioned of necessary knowledge of his religion and intent...\" (2).\n\nThird: Theological Interpretation (Ta'wil):\nProceeding from the obligation of prioritizing reason over transmission, theologians went to the obligation of interpreting texts whose apparent meaning they saw as contradicting reason. Al-Ghazali says: \"Every report indicating the affirmation of an attribute for the Creator Almighty whose apparent meaning implies something impossible in reason, is looked into. If it is susceptible to interpretation, it is accepted and interpreted. If no possibility is subsumed under it, the lie of the transmitter becomes definitively clear\" (3).\nAs for Al-Razi, he claimed that resorting to interpretation is inevitable (4) and came with the \"Universal Law\" which states the obligation of prioritizing reason and interpreting transmission or consigning its meaning (Tafwid).\nThe groups of innovators used interpretation in their discussions with non-Muslims, whether in their answers to questions directed to them or in the criticism they directed at other religions. Look at the answers of Fakhr al-Din al-Razi in his debate with a Christian when the Christian claimed that there are verses in the Quran suggesting anthropomorphism (Tashbih) and gave as examples His saying, the Most High: {The Most Merciful on the Throne established (5)} [Taha: 5] (5) and His saying: {And your Lord has come and the angels, rank upon rank (22)} [Al-Fajr: 22] (6) and His saying: {And the heavens will be folded in His right hand} [Az-Zumar: 67] (7) and verses from the verses indicating the voluntary attributes of the Lord (8). So Fakhr al-Razi said answering according to the doctrine of the one negating voluntary attributes: \"As for the answer to the Hadiths and verses suggesting anthropomorphism, know that if it is established for every rational person, for example, that a wall is inanimate not living, then it is described afterwards with will in His saying, the Most High: {a wall wants to collapse} [Al-Kahf: 77] (9), it is known definitively by the necessity of reason that describing it with will is only by way of metaphor not by way of reality\" (10).",
    "foot_note": "1. Al-Mughni fi Abwab Al-Tawhid wa Al-Adl by Judge Abdul Jabbar Al-Mu'tazili, investigation by Mahmoud Muhammad Al-Khudayri, p. 5/142.\n2. Previous Source 16/424, investigation by Amin Al-Khouli.\n3. Al-Mankhul min Ta'liqat Al-Usul, by Abu Hamid Al-Ghazali investigation by Muhammad Hasan Hitu p. 286.\n4. See: Asas Al-Taqdis by Fakhr Al-Razi investigation by Dr. Ahmed Hijazi Al-Saqqa p. 95 Dar Al-Jeel - Beirut.\n5. Surah Taha Verse: 5.\n6. Surah Al-Fajr Verse: 22.\n7. Surah Az-Zumar Verse: 67.\n8. See: Munazarat fi Al-Radd 'Ala Al-Nasara by Al-Razi, investigation by Abdul Majeed Al-Najjar, p. 57-58, Dar Al-Gharb Al-Islami, Beirut 1986.\n9. Surah Al-Kahf Verse: 77.\n10. Munazarat fi Al-Radd 'Ala Al-Nasara p. 69.",
    "book_id": "69",
    "new_page_number": 40
  },
  {
    "serial_number": "285067",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "He continued answering until he said: \"Similarly, if it is known that the Creator Almighty is transcendent above corporeality, accidentality, limit, direction, organs, limbs, movement, and rest, and transcendent above inclination, luck, aversion, and tenderness, then if He is described afterwards with love, pleasure, anger, concern, or with movement and limb, it is known definitively that applying that to Him is metaphor not reality...\" (1).\nLikewise, we find Judge Abdul Jabbar following the same methodology with Christians, saying in his discussion with them: \"Even if what they claimed was established by hearing (text), it would be obligatory to interpret it according to what reason requires\" (2).\nIf we come to Al-Ghazali in his book \"Al-Radd Al-Jamil\", we find the word \"Interpretation\" (Ta'wil) repeated in the book. You find it in the preamble of the book as you find it in its conclusion. Indeed, we find Al-Ghazali establishing two principles he mentioned are agreed upon among scholars:\nOne of them: That texts, if they arrive, if they agree with the rational, they and their apparent meanings are left alone. And if they contradict explicit reason, it is obligatory to interpret them, and believe that their realities are not intended, so they must be returned then to metaphor.\nThe second: That proofs, if they contradict, and some indicate affirming a ruling and some indicate negating it, we do not leave them contradictory unless we have sensed from ourselves the inability due to the impossibility of combining them, and the prevention of gathering them supporting one meaning (3).\nThen he proceeded to critique Christian beliefs in light of these two principles, where he interpreted the texts of the Gospels whose apparent meaning indicates the divinity of Jesus, peace be upon him, inferring with texts indicating his humanity.\nThe intent here is to clarify that theological interpretation, because of which the general people of desires and theologians specifically suspended Sharia texts, was one of the methodological foundations in studying religions for the theologians.\n\nFourth: Reliance on Logic and Philosophy:\nFrom the foundations on which the methodology of opponents is based: Reliance on logical rules and philosophical methods and using their terminologies in establishing beliefs. The authors of creeds tried to defend Islam and its truths with logic, and used the philosophical style to confront the philosophical arguments used by followers of religions and atheists.\nYou may find no difficulty in striking examples indicating the theologians' use of philosophy in studying religions; since all books of the people of desires on creeds - with rare exceptions - were built on this foundation. Words like: substance (Jawhar), accident (Arad), body (Jism), space-occupying (Mutahayyiz), composite (Murakkab), and opposing states are what meet you in the opening of those books at the first principle that must be proven, which is the existence of Allah. Here is Fakhr Al-Razi saying in the beginning of his debate with the Christian: \"So I said to him, speech on Prophethood must be preceded by knowledge of the God, and this which you say is false, and faces indicate it: The first face: That the God is an expression of an existence necessarily existing by itself, such that He is not a body, nor space-occupying, nor an accident...\" (4).",
    "foot_note": "1. Previous Source p. 70.\n2. Al-Mughni fi Abwab Al-Tawhid wa Al-Adl 5/142.\n3. Al-Radd Al-Jamil li Uluhiyyat Al-Masih, by Abu Hamid Al-Ghazali, investigation by Abdul Aziz Abdul Haq Hilmi, 242-243, Al-Hay'ah li Shu'un Al-Matabi' Al-Amiriyyah, Al-Maktabah Al-Asriyyah, Beirut, 1393.\n4. Munazarat fi Al-Radd 'Ala Al-Nasara p. 22.",
    "book_id": "69",
    "new_page_number": 41
  },
  {
    "serial_number": "285068",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "Criticism of the Methodologies of Ilm al-Kalam (Theology):\nIt becomes clear to us from the foregoing that the methodologies of the theologians deviated from the correct path due to their pursuing that approach immersed in Aristotelian inferences and rational premises deep in disputation and controversy. Scathing criticism was directed at this methodology by the pillars of Ilm al-Kalam before its opponents, and many of them repented from it, such as Abu Hamid Al-Ghazali, Fakhr Al-Din Al-Razi, and Imam Al-Haramayn Al-Juwayni (1).\nSo it was known that the theological methodology - even if intended to defend Islam - led to the opposite of the intention, and its errors were exposed to the public. Perhaps the most important of these errors can be summarized as follows:\nFirst: It distanced itself from the methodology of the Quran in calling to establish the creed or defend it, and preferred over it theories and proofs that raise more doubts than persuasion, thus throwing their people into confusion and doubt - let alone others. Sheikh al-Islam said: \"You find the people of Kalam the most frequent of people in shifting from one saying to another, and being decisive about a saying in one place, and decisive about its contradictory and declaring its sayer a disbeliever in another subject, and this is proof of lack of certainty\" (2). And Al-Shahrastani declared as Ibn Taymiyyah mentioned: \"That he found nothing with philosophers and theologians but confusion and regret\" (3).\nSecond: The methodologies of opponents, after the method of Kalam and the method of philosophy mixed in them, became purely theoretical methodologies organizing premises and extracting results, contrary to the Quranic methodology which addresses reason and stirs emotion and thought in its formation of the creed.\nThird: The people of desires, by relying on reason alone and judging by it in everything, even in what it is not capable of such as unseen matters, have committed a crime against both reason and Sharia. For they distorted the Sharia due to false interpretation, and divided people completely, and threw them into hatred and animosity, which gave enemies an opportunity to gloat over Islam and its people.\nFourth: The methodologies of the people of desires committed a crime against Islam as they presented it to people in other than its reality due to interpreting or rejecting some texts. They also committed a crime against non-Muslims as they blocked the reality of Islam from them and invited them to innovations and contradictory opinions.",
    "foot_note": "1. See: Majmu' Al-Fatawa 4/72-73.\n2. Majmu' Al-Fatawa 4/50.\n3. Previous Source 4/73.",
    "book_id": "69",
    "new_page_number": 42
  },
  {
    "serial_number": "285069",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "Fifth: The weakness of the methodologies of the people of desires in defending the truth and their inadequacy in refuting falsehood. Sheikh al-Islam said: \"And among the greatest causes of the innovations of theologians from Jahmiyyah and others is their inadequacy in debating disbelievers and polytheists. For they debate them and argue with them without truth and justice to support Islam - so they claimed - so those fall upon them due to what is in them of ignorance and injustice, and argue with them with objections and oppositions. So they need then to deny a group of the truth that the Messenger, peace be upon him, came with, and injustice and aggression towards their Muslim brothers due to what those polytheists overcame them with. So their saying became encompassing faith and disbelief, guidance and misguidance, righteousness and error, and combined between contradictories, and they became opposers to disbelievers and believers, like those who fight disbelievers and believers...\" (1).\nWith all this, it is fair and just to mention for the theologians their credit in the field of religious science and sects, for they had a role in refuting falsehood and cutting off the arguments of falsifiers, and this is praiseworthy for them. Sheikh al-Islam said: \"And likewise the theologians of the people of affirmation like the Kullabiyyah, Karramiyyah, and Ash'ariyyah, were only accepted and followed and praised by the general Ummah for what they affirmed of the fundamentals of faith from affirming the Maker and His attributes, and affirming Prophethood, and refuting the disbelievers from polytheists and People of the Scripture and clarifying the contradiction of their arguments...\" (2). However, this effort does not exempt them from criticism due to their methodological and doctrinal errors which were mentioned previously.\nAll that preceded confirms to us that the methodology of the Salaf which agrees with the Quranic methodology regulated by Sharia controls is the only methodology in light of which religions and sects should be studied, and it is the appropriate methodology to face contemporary challenges in the field of studying religions and sects (3).",
    "foot_note": "1. Majmu' Al-Fatawa Al-Kubra by Ibn Taymiyyah 5/35, Dar Al-Qalam, Beirut, First Edition.\n2. Dar' Al-Ta'arud 8/275.\n3. See: Ilm Al-Milal wa Manahij Al-Ulama Fiha p. 252-343.",
    "book_id": "69",
    "new_page_number": 43
  },
  {
    "serial_number": "285070",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "Section Three: Methodologies of Disbelievers in Studying Religious Science\nThe West did not know the study of religious science and sects in its scientific concept before the modern era. The reason for that is that Christians did not acknowledge the existence of other religions; rather, they considered everything other than Christianity \"heresy\". Most of the attention of clergymen in that was focused on theological studies, and refuting opinions or religions they saw as posing a danger to Christian beliefs. Add to that, Christianity was protected - according to their claim - by sanctity preventing any criticism directed at it.\nBut starting from the European Renaissance era - the fifteenth century AD - a major transformation began. Western man began to criticize the Christian religion, just as his interest began in knowing other religions and the beliefs of different nations.\nSome scholars determine that the appearance of the term \"Comparative Religion\" or \"Comparative Religion\" among Westerners was at the end of the nineteenth century to indicate for them the scientific study of religions to differentiate between this new type of study and the theological studies known to Christianity since its inception.\nThen the scope of the science of comparative religion expanded in the twentieth century to include: \"History of Religions\", \"Philosophy of Religions\", \"Sociology of Religion\", \"Psychology of Religion\", and \"Phenomenology of Religion\".\nThe summary is: Religious science in the modern West was born out of the conflict between the Christian religion and the pioneers of the European Renaissance. Those who adopted it were not clergymen, but rather philosophers opposing the Church and its men.",
    "foot_note": "None",
    "book_id": "69",
    "new_page_number": 44
  },
  {
    "serial_number": "285071",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "Section Four: Methodologies of Orientalists in Studying Religious Science and Sects and Evaluating them:\nDespite the multiplicity of Orientalists' trends, the difference in their orientations, the variance in their fields, and the disparity in their scientific capabilities, they mostly end up in their studies of sects - especially Islam - with one result. That is because they proceed from one set of postulates and issue from methodological foundations planned for specific goals.\n\nRequirement One: The Postulates from which Orientalists Proceeded:\n1 - Proceeding from distorted Christianity as a standard for evaluating other religions that are the subject of research and study - especially Islam - such that these religions are not accepted unless they agree with the main propositions of Christianity. And considering everything that deviates from the Christian spiritual model as a deficiency or shortcoming expressing the corruption of this religion, its weakness, and its unreasonableness.\n2 - Denying the prophethood of Muhammad, peace be upon him, or considering it specific to Arabs, and considering the Quran as his authorship. Orientalists are either secularists who do not believe in the Unseen, or People of the Scripture who do not believe in the truthfulness of the message that followed Christianity.\n3 - Equating the Islamic religion with other pagan religions like the religions of India and China, and distorted heavenly religions. Orientalist Gibb says: \"The Islamic religion in itself is one of a group of religions that include alongside Zoroastrianism, Judaism, and Christianity, and it shares with them the same basic principles\" (1).\n4 - Proceeding from a racist ethnic view that reduces humanity to two races \"We\" and \"They\", where the peoples of the earth were divided into superior races and backward ones; the first being Aryan peoples and the second Semitic peoples.\n5 - Considering the European experience a normative model for human development. Orientalist studies were dominated by a type of unscientific comparison where Islamic history and its social systems were subjected to Western standards, such that the European experience became the reference that other societies must emulate.\n6 - Proceeding from a hostile stance towards Islam, its Prophet peace be upon him, and Muslims. Most Orientalists proceeded from a doctrinal starting point fueled by Crusader hatred for Islam, and fanaticism that blinds eyes from facts.\nProceeding from these starting points and those postulates of theirs led Orientalists to use unscientific methods and methodologies that do not lead to correct results in the field of Islamic studies.",
    "foot_note": "1. Manahij Ilm Al-Kalam fi Muwajahat Al-Qadaya Al-Fikriyyah Al-Mu'asirah, by Rizq Yusuf, p. 202-203, PhD thesis in Dar Al-Ulum Faculty - Cairo quoting from the book Wijhat Al-Islam: Nazra fi Al-Harakat Al-Hadithah fi Al-Alam Al-Islami by Orientalist Gibb, translation by Muhammad Abdul Hadi, The Islamic Press, 1933.",
    "book_id": "69",
    "new_page_number": 45
  },
  {
    "serial_number": "285072",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "Requirement Two: Methodologies of Orientalists in Studying Religions and Sects:\nOrientalists used in studying sects generally and Islamic studies specifically many methodologies, combined or separate. The most important of these methodologies are:\n\n1 - The Historical Critical Method:\nHistorical criticism of holy books began in the West in the seventeenth century, after publishing holy books in several languages so comparison between different texts became possible... in order to search for the original text. So the texts of the two Testaments were subjected to historical criticism starting from their inception. This criticism included everything related to the two Testaments of translation or explanations. In the nineteenth century, this methodology began to expand and transform into what they called Scientific Criticism based on verifying texts and comparing them, and relying on philology and comparative mythology in this century. The rules of this methodology were laid down and its different schools emerged.\nThis methodology led Westerners to atheism, when they knew that their religion was incorrect. Whatever the case, the West represented by Orientalist studies applied this methodology to Islamic studies. Paret says: \"We in this apply to Islam and its history and to the Arabic works we work on the same critical standard that we apply to the history of thought among us, and to the recorded sources of our own world\" (1).\nDespite this claim from \"Paret\", the application of this methodology to Islamic studies was not like its application to Christian or Jewish studies due to what was mentioned previously that the West proceeded in its study from a hostile starting point to Islam, and due to the preconceived judgments Orientalists carried. Therefore, it is said: Most Westerners were not sincere to this methodology in their studies of Islam, and had they been sincere to its rules, it would have been possible for them to reach correct results.\n\n2 - The Analytical Method:\nThe analytical method is one of the methodologies Orientalists applied to Islamic studies. This methodology means fragmenting the intellectual phenomenon, or the subject required to be studied, into a group of elements that are combined in a heterogeneous bundle of factors or facts that created it. Meaning, this methodology fragments the intellectual phenomenon and returns it to its primary elements like social, political, or religious circumstances. If the Orientalist applies this methodology while influenced by his mood, culture, environment, and religion in which he grew up, he arrives with it in Islamic studies to unsound results. That is because through this methodology they bring every strange interpretation, and return Islamic concepts to non-Islamic origins.",
    "foot_note": "1. Al-Dirasat Al-Arabiyyah wa Al-Islamiyyah fi Al-Jami'at Al-Almaniyyah Rudi Paret translation by Mustafa Maher, p. 10, Dar Al-Katib Al-Arabi, Cairo 1967.",
    "book_id": "69",
    "new_page_number": 46
  },
  {
    "serial_number": "285073",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "3 - The Projective Method:\nI mean projecting the positivist secular vision and contemporary environmental influences onto historical facts. Islam was studied, whether creed or biography and history, with contemporary Western concepts, and compared with Western historical data. Between religious residues, secular tendency, and philosophical opinions, Islam was studied through a positivist vision restricted to the visible, rejecting everything spiritual or unseen, on the basis that it is a fall into the umbrella of imagination, myth, and unscientific. Nothing resulted from applying this methodology to Islamic studies except arbitrary judgments having no connection to sound scientific analysis (1).\n\n4 - Method of Impact and Influence:\nSome contemporary researchers see that among the conditions of a researcher in religious science is not to rush when comparing in determining the connection between two phenomena in two religions before the type of relationship between them appears to him, is it similarity, identity, opposition, or contradiction so he does not fall into error (2).\nThis is what justice and fairness require. But when we come to the methodology of Orientalists in Islamic studies, we find them applying this methodology in a cunning way and without controls. Through this methodology, they conclude that Islam is nothing but a mixture derived from other religions and false sects.\nThese methodologies used by Orientalists in Islamic studies - from historical criticism, analytical method, impact and influence method, and projective method - contradict those methodologies used by Muslim scholars in the field of studying religions, even if they resemble them outwardly, or agree with them in name. That is because the goal for which Muslim scholars used it differs from the West's goals from it. Their methodologies were built on justice and fairness. No Muslim scholar fabricated lies against people of a religion, nor distorted the history of a nation. Nor did they come with analyses and conclusions that have no basis in truth. How could that be from them when their intention is knowing the reality of religions as they are in reality, so it is possible for them to apply Allah's law on their people.\nAs for Orientalists, they are either people whose livers Crusader hatred has eaten, or Jews whose hearts hatred filled and arrogance blinded, or secularists and atheists proceeding from a religious background with atheism and disbelief, so they increased in disbelief with their disbelief.",
    "foot_note": "1. See: Al-Zahirah Al-Istishraqiyyah p. 1/202-203.\n2. Dirasat fi Al-Yahudiyyah bayna Al-Millah wa Al-Nihlah wa Al-Harakah, Dr. Jabr Muhammad Hasan Jabr p. 8-9.",
    "book_id": "69",
    "new_page_number": 47
  },
  {
    "serial_number": "285074",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "Requirement Three: Orientalists' Methods in Islamic Studies:\nWhat reveals to us the reality of Orientalists' goals through this methodology of theirs, are the methods they used to achieve these methodologies, or features indicating methodological betrayal. The most prominent of these methods:\n\n1 - The Selective Method:\nOrientalists do not study Islam as an integrated unit; rather, they study selected topics from it. They focus on topics they see they can employ according to their desires, especially topics representing a negative side in the history of the Islamic nation like innovative sects. \"The incoming Western methodology speaks with huge celebration about Mu'tazilism and the Mu'tazila, and sees that their fall was a source of great danger to Islamic thought, and that their methodology is the truest methodology this thought knew...\" (1).\nFrom selection also is selecting sources: They select the sources they rely on in Islamic studies, if they don't fabricate them entirely. Their preferred sources are literature books, and books of sects deviating from the correct methodology. From that also is selecting evidences. That is, correct evidences and weak or anomalous evidences might appear in the subject they study, so they choose the anomalous evidences because they agree with their desires, and ignore or pretend blindness to correct evidences, or cast doubt on their authenticity.\n\n2 - Distortion and Inverting Facts:\nOrientalists distort texts... intentional distortion, or invert their meanings when they find no room for distortion; by using what is called the reverse method, which is that the Orientalist comes to the most trustworthy news and truest reports and inverts them - intentionally - to their opposite.\n\n3 - Lying and Fabrication:\nAmong the cunning methods indicating bad intention, and violating methodology for Orientalists: Using methods of deception and camouflage, such as attributing to non-existent sources and references. An example of this is what Dr. Abdul Rahman Badawi mentioned about the Orientalist Lammens where he says: \"And the ugliest thing Lammens did, especially in his book Fatima and the Daughters of Muhammad peace be upon him, is that he refers in footnotes to references with their pages. I reviewed most of these references in the books he referred to, and I found that either he refers to places absolutely non-existent in these books, or understands the text in a twisted, malicious way, or extracts implications with extreme arbitrariness, indicating corruption of mind and malice of intention. Therefore, the reader should not rely on his references to sources, for most of them are camouflage, lies, and arbitrariness in understanding texts\" (2).",
    "foot_note": "1. Akhta' Al-Manhaj Al-Gharbi Al-Wafid p. 130.\n2. Mawsu'at Al-Mustashriqin Dr. Abdul Rahman Badawi, p. 348, Dar Al-Ilm Lil-Malayin, Beirut 1984.",
    "book_id": "69",
    "new_page_number": 48
  },
  {
    "serial_number": "285075",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "4 - Reliance on Hypotheses and Conjecture:\nReliance on hypotheses and conjectures is a distinctive feature of the Westerners' methodology for studying religions, and it is one of the reasons that threw them into methodological confusion. It is the preferred style for Orientalists in Islamic studies. Orientalist Montgomery Watt says: \"Since our knowledge is fragmentary relying on Islamic sources except for inscriptions, there is a large place for assumption and conjecture. We will not treat this subject here, it suffices to mention that it is usually agreed upon that idol worship no longer had influence in the days of Muhammad\" (1).\n\n5 - Claiming Objectivity and Detachment:\nAmong the deceptive methods Orientalists use is claiming objectivity and detachment from desires, but if we come to reality we find no trace of it, rather the opposite is true, which is a matter Orientalists themselves admit. It is strange that you find in most introductions to Orientalists' works the claim of adhering to objectivity in their study of Islam. However, you do not take a single step after the introduction before this same Orientalist surprises you with what contradicts his claim.\nOrientalists dealt with religions with these methodologies and used those methods in Islamic studies especially. So their studies regarding Islam came filled with skepticism and defamation, and saying its source is human. Whatever the case, Orientalism has represented in the modern era the spearhead used by enemies against Islam. Its malicious effects on the Islamic nation are not hidden from anyone. It is regrettable to find among Muslims those who glorify the methodologies of Orientalists, and claim that their methodology is the correct scientific methodology. It is regrettable that the production of these fanatics fills the Islamic arena, and that their methodology is a standard for evaluation and criticism in many scientific institutions in the Islamic world, and that \"religious science and sects\" whose function is confronting the challenge of these people is judged in some houses of knowledge by the methodology of these people.\nThe intent here from clarifying the methodology of Orientalists is that these Orientalists are more dangerous to Islam than any other force, and that they entered this field while they are not qualified for it, because they are devoid of objectivity and scientific integrity, not to mention what they conceal or declare of hatred and plotting against Islam stemming from an old doctrinal hostility as old as this religion. Despite that - and very regrettably - we will not lack among Muslims those who glorify this methodology, gather for it colors of praise and commendation, and make it a standard and scale for scientific research, even Sharia sciences like the science of religions and sects whose function is defending the religion.\nExiting subordination and imitation of enemies imposes on us to return to our authenticity, by returning to Islam, and liberating ourselves from incoming methodologies. If one of the most dangerous methodologies coming to us is the methodology of studying religions, or history of religions, or comparative religion as they call it in the West because it cares for studying this religion as creed, Sharia, politics and others, then that places the science of sects, and correcting its approach at the beginning of the ladder of our Islamic system. This correction will not be completed except by returning to the Sharia controls established by the people of knowledge, and by liberating from Western methodologies in whole and in detail. Liberation will not be complete unless an alternative comes in this field from scientific encyclopedias and circles of knowledge that dispense researchers from Western sources.",
    "foot_note": "1. Muhammad at Mecca, Montgomery Watt translation by Sha'ban Barakat, p. 51, Al-Maktabah Al-Asriyah, Beirut.",
    "book_id": "69",
    "new_page_number": 49
  },
  {
    "serial_number": "285076",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "Conclusion\n1 - It became clear that the science of religions and sects is among the Sharia sciences whose legitimacy was indicated by the Book, Sunnah, and positions of the Salaf, and that its legitimacy is contingent on its agreement with the Quranic methodology.\n2 - Through the methodologies of scholars in the science of religions and sects, it became clear that the scholars of the Salaf adhered to the Sharia methodology.\n3 - It was shown through the research that there are methodologies opposing Ahlus-Sunnah wal-Jama'ah in studying religious science, and they are two methodologies:\nFirst: Methodologies of the theologians and those who agreed with them.\nSecond: Methodologies of disbelievers and Orientalists.\n4 - That some methodologies opposing the methodology of Ahlus-Sunnah have a role in studying religious science like the theologians, which places a large burden on Ahlus-Sunnah to perform this duty; so that no one is deceived by opposing methodologies.\n5 - That these methodologies oppose Ahlus-Sunnah in sources and methodologies of inference, in the method of presentation and refutation, and in the method of research.\n6 - That research in religious science and studying it has several methodologies including: The descriptive historical method, the analytical critical method, the comparative method, the empirical scientific method, and the comprehensive method.\n7 - That Ahlus-Sunnah used from these methodologies what agrees with the truth and leads to it, with its Sharia controls, unlike their opponents who used what agrees with their desires, serves their goals, and achieves their ends.\nThis, and I ask Allah Almighty to honor His religion and support His word and guide us to what contains good and honor for our nation and support for its religion, for He Almighty is the Grantor of success and the Guide to the straight path. And may Allah send peace and blessings upon our Prophet Muhammad, who clarified for us the path of truth and commanded us to follow it, and clarified for us the path of misguidance and error and forbade us from falling into it, and his family and companions and those who followed them in goodness until the Day of Judgment.",
    "foot_note": "None",
    "book_id": "69",
    "new_page_number": 50
  },
  {
    "serial_number": "285077",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "Reference Index\n1 - Al-Ihkam fi Usul Al-Ahkam by Abu Al-Hasan Ali bin Ali Al-Amidi, investigation by Ibrahim Al-Ajouz, Dar Al-Kutub Al-Ilmiyyah, Beirut, First Edition.\n2 - Akhta' Al-Manhaj Al-Gharbi Al-Wafid (Errors of the Incoming Western Methodology), by Anwar Al-Jundi, Dar Al-Kitab Al-Lubnani, Beirut.\n3 - Al-Adyan Dirasah Tarikhiyah Muqaranah (Religions: A Comparative Historical Study) - Part One, Dr. Rushdi Aliyan and Saadoun Al-Samuk, Ministry of Higher Education and Scientific Research, University of Baghdad.\n4 - Asas Al-Taqdis by Fakhr Al-Razi investigation by Dr. Ahmed Hijazi Al-Saqqa Dar Al-Jeel - Beirut.\n5 - Al-I'tisam by Abu Ishaq Ibrahim bin Musa Al-Shatibi, Dar Al-Fikr.\n6 - I'lam Al-Muwaqqi'in by Ibn Al-Qayyim, Al-Kutub Al-Ilmiyyah, Beirut, First Edition.\n7 - Al-Idah Li Nasikh Al-Quran wa Mansukhihi by Abu Muhammad Makki Ibn Abi Talib Al-Qaisi investigation by Ahmed Hasan Farhan, Imam Muhammad bin Saud Islamic University, First Edition.\n8 - Bada'i Al-Fawa'id by Ibn Al-Qayyim, Dar Al-Kitab Al-Arabi, Beirut.\n9 - Tarikh Al-Madhahib Al-Islamiyyah (History of Islamic Schools) by Muhammad Abu Zahrah, Dar Al-Fikr Al-Arabi 1989 AD.\n10 - Tuhfat Al-Ahwadhi Sharh Sunan Al-Tirmidhi, by Abu Al-Ala Muhammad bin Abdul Rahman Al-Mubarakpuri, Dar Al-Kutub Al-Ilmiyyah, Beirut, First Edition.\n11 - Tafsir Ibn Kathir, Dar Al-Mufid, Beirut First Edition.\n12 - Al-Tawhid Al-Khalis aw Al-Islam wa Al-Aql (Pure Monotheism or Islam and Reason) Dr. Abdul Halim Mahmoud, Dar Al-Kutub Al-Hadithah, 1973.\n13 - Jami' Al-Bayan 'an Ta'wil Ay Al-Quran, by Abu Ja'far Muhammad bin Jarir Al-Tabari, Mustafa Al-Babi Al-Halabi and Sons Press, Third Edition.\n14 - Jami' Al-Rasa'il, by Ibn Taymiyyah, investigation by Muhammad Rashad Salim, Al-Madani Press, Cairo, First Edition.\n15 - Al-Jawab Al-Sahih Li Man Baddala Din Al-Masih by Ibn Taymiyyah, Al-Madani Press, Cairo, and Dar Al-Asimah edition, and Dar Al-Fadila investigation by Ali Al-Alma'i, Abdul Aziz Al-Askar and Hamdan Al-Hamdan, First Edition.\n16 - Dar' Ta'arud Al-Aql wa Al-Naql by Ibn Taymiyyah, investigation by Muhammad Rashad Salim, Imam Muhammad bin Saud Islamic University edition 1402.\n17 - Al-Dirasat Al-Arabiyyah wa Al-Islamiyyah fi Al-Jami'at Al-Almaniyyah (Arab and Islamic Studies in German Universities) Rudi Paret translation by Mustafa Maher, Dar Al-Katib Al-Arabi, Cairo 1967.",
    "foot_note": "None",
    "book_id": "69",
    "new_page_number": 51
  },
  {
    "serial_number": "285078",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "18 - Dirasat fi Al-Yahudiyyah bayna Al-Millah wa Al-Nihlah wa Al-Harakah (Studies in Judaism between Religion, Sect, and Movement), Dr. Jabr Muhammad Hasan Jabr.\n19 - Al-Radd Al-Jamil li Uluhiyyat Al-Masih (The Beautiful Refutation of the Divinity of Christ), by Abu Hamid Al-Ghazali, investigation by Abdul Aziz Abdul Haq Hilmi, Al-Hay'ah li Shu'un Al-Matabi' Al-Amiriyyah, Al-Maktabah Al-Asriyyah, Beirut, 1393.\n20 - Al-Radd 'Ala Al-Mukhalif Min Usul Al-Islam (Refuting the Opposer is from the Principles of Islam) by Bakr Abu Zaid, Dar Al-Hijrah, Second Edition.\n21 - Sunan Ibn Majah, by Abu Abdullah Muhammad Al-Qazwini, cared for by Abu Suhaib Al-Karmi, Dar Al-Afkar, edition of year 1419.\n22 - Sunan Abu Dawood, cared for by Abu Suhaib Al-Karmi, Dar Al-Afkar, edition of year 1419.\n23 - Sunan Al-Tirmidhi, cared for by Abu Suhaib Al-Karmi, Dar Al-Afkar, edition of year 1419.\n24 - Al-Sirah Al-Nabawiyyah by Abu Muhammad Abdul Malik bin Hisham reviewed and annotated by Muhammad Muhyi al-Din Abdul Hamid, Maktabat Al-Turath, Cairo.\n25 - Sharh Al-Usul Al-Khamsah, by Abdul Jabbar bin Ahmad Al-Mu'tazili, investigation by Abdul Karim Uthman, Maktabat Wahbah, Cairo, First Edition.\n26 - Sharh Al-Aqidah Al-Tahawiyyah by Ibn Abi Al-Izz Al-Hanafi investigation by Dr. Al-Turki and Al-Arnaout, Mu'assasat Al-Risalah, 1415.\n27 - Al-Sihah fi Al-Lughah wa Al-Ulum by Al-Jawhari, investigation by Nadim Mar'ashli and Osama Mar'ashli, Dar Al-Hadarah Al-Arabiyyah, Beirut, First Edition.\n28 - Sahih Al-Bukhari, cared for by Abu Suhaib Al-Karmi, Dar Al-Afkar, edition of year 1419.\n29 - Sahih Muslim, cared for by Abu Suhaib Al-Karmi, Dar Al-Afkar, edition of year 1419.\n30 - Al-Zahirah Al-Istishraqiyyah wa Atharuha 'Ala Al-Dirasat Al-Islamiyyah (The Orientalist Phenomenon and its Impact on Islamic Studies), by Sasi Salim Al-Hajj, Center for World Islamic Studies, First Edition.\n31 - Ilm Al-Milal wa Manahij Al-Ulama Fihi (Science of Religions and Scholars' Methodologies In It), by Ahmad Joud, First Edition, Dar Al-Fadila, Riyadh.\n32 - Awn Al-Ma'bud Sharh Sunan Abu Dawood, by Abu Al-Tayyib Muhammad Shams Al-Haqq Al-Azim Abadi, Dar Al-Kutub Al-Ilmiyyah, Beirut, First Edition.\n33 - Al-Fatawa Al-Kubra by Ibn Taymiyyah, Dar Al-Qalam, Beirut, First Edition.\n34 - Fath Al-Bari Sharh Sahih Al-Bukhari, by Al-Hafiz Ibn Hajar Al-Asqalani, numbering by Muhammad Fuad Abdul Baqi, Dar Al-Rayyan li Al-Turath, Second Edition.\n35 - Al-Firaq Al-Kalamiyyah Al-Islamiyyah (Islamic Theological Sects) Dr. Ali Abdul Fattah Al-Maghribi, Maktabat Wahbah, Cairo, Second Edition.",
    "foot_note": "None",
    "book_id": "69",
    "new_page_number": 52
  },
  {
    "serial_number": "285079",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "36 - Al-Fisal fi Al-Milal wa Al-Ahwa' wa Al-Nihal, by Ibn Hazm, investigation by Muhammad Ibrahim Nasr, Abdul Rahman Umayra, Dar Al-Jeel, Beirut.\n37 - Fiqh Al-Ta'amul Ma'a Al-Mukhalif (Jurisprudence of Dealing with the Opponent) Dr. Abdullah Al-Turaiqi, Dar Al-Watan, First Edition.\n38 - Al-Fawa'id by Ibn Al-Qayyim, investigation by Muhammad Uthman Al-Khashb, Dar Al-Kitab Al-Arabi, Beirut, Fourth Edition.\n39 - Fi Al-Falsafah Al-Islamiyyah: Manhaj wa Tatbiq (In Islamic Philosophy: Methodology and Application) Dr. Ibrahim Madkour, Dar Al-Ma'arif, Cairo.\n40 - Al-Qamus Al-Muhit, Muhammad bin Yaqub Al-Fairuzabadi, Mu'assasat Al-Risalah, Dar Al-Rayyan li Al-Turath, Second Edition.\n41 - Al-Kafiyah fi Al-Jadal, by Imam al-Haramayn al-Juwayni, investigation by Dr. Fawqiyah Hussein Mahmoud, printed by Issa Al-Babi Press, Cairo 1399 AH.\n42 - Mabahith fi Ulum Al-Quran by Sheikh Manna' Al-Qattan, Mu'assasat Al-Risalah Thirty-Second Edition.\n43 - Mabahith fi Manhajiyyat Al-Fikr Al-Islami (Studies in the Methodology of Islamic Thought), Dr. Abdul Majeed Al-Najjar, Dar Al-Gharb Al-Islami, First Edition.\n44 - Majmu' Al-Fatawa by Sheikh al-Islam Ibn Taymiyyah, collected and arranged by Abdul Rahman bin Qasim, Dar Alam Al-Kutub, Riyadh, 1412.\n45 - Al-Mahsul fi Ilm Usul Al-Fiqh, by Fakhr Al-Razi investigation by Dr. Taha Jabir Al-Alwani, Imam Muhammad bin Saud Islamic University 1399.\n46 - Muhammad fi Makkah (Muhammad at Mecca), Montgomery Watt translation by Sha'ban Barakat, Al-Maktabah Al-Asriyah, Beirut.\n47 - Al-Mustadrak 'Ala Al-Sahihayn by Abu Abdullah Al-Hakim Al-Naysaburi, Maktab Al-Matbu'at Al-Islamiyyah, Beirut.\n48 - Muslimu Ahl Al-Kitab wa Atharuhum fi Al-Difa' 'an Al-Qadaya Al-Quraniyyah (Muslims of the People of the Book and their Impact on Defending Quranic Issues), Dr. Muhammad Al-Suhaim, Dar Al-Furqan, First Edition.\n49 - Mishkat Al-Masabih, by Muhammad Abdullah Al-Khatib Al-Tabrizi, investigation by Muhammad Nasir al-Din al-Albani, Al-Maktab Al-Islami, Beirut, Second Edition.\n50 - Al-Mu'jam Al-Falsafi prepared by the Academy of the Arabic Language, Cairo, 1403.\n51 - Al-Mughni fi Abwab Al-Tawhid wa Al-Adl by Judge Abdul Jabbar Al-Mu'tazili, investigation by Mahmoud Muhammad Al-Khudayri.\n52 - Muqaddimat Al-Ulum wa Al-Manahij (Introductions to Sciences and Methodologies) by Anwar Al-Jundi, Dar Al-Ansar, Cairo.\n53 - Muqaddimat fi Al-Ahwa' wa Al-Iftiraq (Introductions in Desires and Division), Dr. Nasser Al-Aql, Dar Al-Watan, First Edition.\n54 - Muqaddimat fi Ilm Al-Maqalat (Introductions in the Science of Creeds) by Dr. Muhammad Khalifa Al-Tamimi Dar Adwaa Al-Salaf, Riyadh, First Edition.\n55 - Munazarat fi Al-Radd 'Ala Al-Nasara (Debates in Refuting Christians) by Al-Razi, investigation by Abdul Majeed Al-Najjar, Dar Al-Gharb Al-Islami, Beirut 1986.",
    "foot_note": "None",
    "book_id": "69",
    "new_page_number": 53
  },
  {
    "serial_number": "285080",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Study of Religious Science - Its Importance and the Methodologies of Researchers in It",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "56 - Munazarah Bayna Al-Islam wa Al-Nasraniyyah (Debate between Islam and Christianity) prepared by Jamal Abdul Hadi, edition of the General Presidency for Departments of Scientific Research, Ifta, Da'wah and Guidance.\n57 - Manahij Al-Bahth fi Al-Aqeedah Al-Islamiyyah fi Al-Asr Al-Hadir: Dirasah li Manahij Al-Fikr Al-Islami Al-Mu'asir wa li Al-Anasir Al-Manhajiyyah fi Dirasat Usul Al-Din (Research Methodologies in Islamic Creed in the Present Era: A Study of Contemporary Islamic Thought Methodologies and Methodological Elements in Studying Fundamentals of Religion), by Abdul Rahman bin Zaid Al-Zunaidi, Dar Ishbiliya, 1416.\n58 - Manahij Al-Bahth fi Al-Aqeedah (Research Methodologies in Creed), by Sheikh Yusuf Al-Saeed, Majallat Al-Dirasat Al-Arabiyyah, Issue Seven January 2002.\n59 - Manahij Ilm Al-Kalam fi Muwajahat Al-Qadaya Al-Fikriyyah Al-Mu'asirah (Theology Methodologies in Facing Contemporary Intellectual Issues), by Rizq Yusuf, PhD thesis in Dar Al-Ulum Faculty - Cairo quoting from the book Wijhat Al-Islam: Nazra fi Al-Harakat Al-Hadithah fi Al-Alam Al-Islami by Orientalist Gibb, translation by Muhammad Abdul Hadi, The Islamic Press, 1933.\n60 - Manahil Al-Irfan fi Ulum Al-Quran by Muhammad Abdul Azim Al-Zarqani, Issa Al-Babi Al-Halabi Press.\n61 - Al-Mankhul min Ta'liqat Al-Usul, by Abu Hamid Al-Ghazali investigation by Muhammad Hasan Hitu.\n62 - Manhaj Al-Istidlal 'Ala Masa'il Al-I'tiqad (Methodology of Inference on Issues of Belief) by Uthman Ali Hasan, Maktabat Al-Rushd, Riyadh, Third Edition.\n63 - Manhaj Al-Bahth Al-Ilmi 'Inda Al-Arab (Scientific Research Methodology among Arabs) by Jalal Musa, Dar Al-Kitab Al-Lubnani, First Edition.\n64 - Manhaj Ahl Al-Sunnah wa Al-Jama'ah fi Al-Radd 'Ala Al-Nasara Dirasah Ilmiyyah min Khilal Juhud Sheikh Al-Islam Ibn Taymiyyah (Methodology of Ahlus-Sunnah wal-Jama'ah in Refuting Christians: A Scientific Study through the Efforts of Sheikh Al-Islam Ibn Taymiyyah) Dr. Abdul Radi Abdul Mohsen, Maktabat Al-Tarbiyah Al-Islamiyyah li Ihya' Al-Turath Al-Islami, First Edition.\n65 - Manhaj Kitabat Al-Tarikh Al-Islami (Methodology of Writing Islamic History) Dr. Muhammad bin Samil Al-Sulami, Dar Taiba, Riyadh, First Edition.\n66 - Al-Muwafaqat fi Usul Al-Sharia, by Abu Ishaq Ibrahim Al-Shatibi, Al-Maktabah Al-Tijariyah Al-Kubra, Cairo.\n67 - Al-Mujaz fi Al-Adyan wa Al-Madhahib Al-Mu'asirah (A Summary of Religions and Contemporary Sects), Dr. Nasser Al-Qaffari and Dr. Nasser Al-Aql, Dar Al-Sumai'i, Riyadh, First Edition.\n68 - Mawsu'at Al-Mustashriqin (Encyclopedia of Orientalists), Dr. Abdul Rahman Badawi, Dar Al-Ilm Lil-Malayin, Beirut 1984.\n69 - Nash'at Al-Fikr Al-Falsafi fi Al-Islam (Origin of Philosophical Thought in Islam), Dr. Ali Sami Al-Nashar, Dar Al-Ma'arif, Third Edition.\n70 - Nazra Amma fi Ba'd Manahij Al-Bahth Al-Islamiyyah (General View on Some Islamic Research Methodologies), Dr. Taha Al-Alwani, research published in Majallat Adwa' Al-Sharia issue 8 Jumada Al-Akhirah year 1397.",
    "foot_note": "None",
    "book_id": "69",
    "new_page_number": 54
  }
]