[
  {
    "text": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers\nAuthor: عبد العزيز بن عبد الله بن باز\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 1
  },
  {
    "text": "sn: 361\nbook_title: إقامة البراهين على حكم من استغاث بغير الله أو صدق الكهنة والعرافين\nbook_link: https://shamela.ws/book/572\nbook_id: 572\nauthor_name: عبد العزيز بن عبد الله بن باز\nauthor_year: 1420\nnickname: Null\nauthor_link: https://shamela.ws/author/67\nauthor_ID: 67\neditor: Null\npublisher: الكتاب منشور على موقع وزارة الأوقاف السعودية بدون بيانات\nedition: Null\npages: 63\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: العقيدة\ncategory_id: 1",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 2
  },
  {
    "serial_number": "12860",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Creed. Book: Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers. Author: Abdul Aziz bin Abdullah bin Baz (Died 1420 AH). Publisher: The book is published on the Saudi Ministry of Endowments website without data. Number of pages: 63 [Book numbering matches the printed version]. Publication date on Shamela: 8 Dhu al-Hijjah 1431.",
    "foot_note": "None",
    "book_id": "572",
    "new_page_number": 3
  },
  {
    "serial_number": "12861",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 3,
    "volume_number": 1,
    "text": "[The First Treatise: Clarifying the ruling on seeking relief (Istighatha) from the Prophet (peace be upon him) and seeking victory through him] [Victory is in the hands of Allah alone and not in the hands of the Prophet (peace be upon him)] Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "foot_note": "None",
    "book_id": "572",
    "new_page_number": 4
  },
  {
    "serial_number": "12862",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 7,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. The First Treatise. Praise be to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. To proceed: The Kuwaiti newspaper 'Al-Mujtama' published in its issue No. 15, dated 19/4/1395 AH, verses under the title (In Memory of the Noble Prophet's Birthday) containing supplications for relief to the Prophet (peace be upon him) and seeking victory through him to save the Ummah (nation), grant it victory, and save it from the division and discord it has fallen into. It was signed by someone calling herself 'Amina'. This is the text of the verses referred to: 'O Messenger of Allah, save a world... that ignites war and burns in its flames. O Messenger of Allah, save a nation... that has walked long in the darkness of doubt. O Messenger of Allah, save a nation... whose visions have been lost in the mazes of sorrow.'",
    "foot_note": "None",
    "book_id": "572",
    "new_page_number": 5
  },
  {
    "serial_number": "12863",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 8,
    "volume_number": 1,
    "text": "Until she said: 'O Messenger of Allah, save a nation... that has walked long in the darkness of doubt. Hasten victory just as you hastened it... on the day of Badr when you called upon the God. So humiliation turned into a magnificent victory... Indeed, Allah has soldiers you do not see.' (Allah is the Greatest). Thus, this writer directs her call and plea for relief to the Messenger (peace be upon him), asking him to save the Ummah by hastening victory, forgetting or ignorant of the fact that victory is in the hands of Allah alone. It is not in the hands of the Prophet (peace be upon him) nor any other creature, as Allah Glory be to Him says in His clear Book: {And victory is not but from Allah, the Exalted in Might, the Wise} [Al-Imran: 126] (1). And the Almighty said: {If Allah should aid you, no one can overcome you; but if He should forsake you, who is there that can aid you after Him?} [Al-Imran: 160] (2). [Allah Glory be to Him created creation to worship Him and sent Messengers to clarify that worship and invite to it]. It is known by text and consensus that Allah...",
    "foot_note": "1. (1) Surah Al-Imran Verse 126. \n2. Surah Al-Imran Verse 160.",
    "book_id": "572",
    "new_page_number": 6
  },
  {
    "serial_number": "12864",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 9,
    "volume_number": 1,
    "text": "...Glory be to Him created creation to worship Him, and sent Messengers and revealed Books to clarify that worship and invite to it, as He Glory be to Him said: {And I did not create the jinn and mankind except to worship Me} [Adh-Dhariyat: 56] (1). And the Almighty said: {And We certainly sent into every nation a messenger, [saying], \"Worship Allah and avoid Taghut.\"} [An-Nahl: 36] (2). And the Almighty said: {And We sent not before you any messenger except that We revealed to him that, \"There is no deity except Me, so worship Me.\"} [Al-Anbiya: 25] (3). And the Almighty said: {Alif, Lam, Ra. [This is] a Book whose verses are perfected and then presented in detail from [one who is] Wise and Acquainted. That you not worship except Allah. Indeed, I am to you from Him a warner and a bringer of good tidings} [Hud: 1-2] (4). So He Glory be to Him clarified in these decisive verses that He did not create the two races (Jinn and Mankind) except to worship Him alone with no partner, and clarified that He sent Messengers, peace be upon them, to command this worship and forbid its opposite. And He Almighty informed that He perfected the verses of His Book and detailed them so that none should be worshipped other than Him...",
    "foot_note": "1. (1) Surah Adh-Dhariyat Verse 56. \n2. Surah An-Nahl Verse 36. \n3. Surah Al-Anbiya Verse 25. \n4. Surah Hud Verse 1-2.",
    "book_id": "572",
    "new_page_number": 7
  },
  {
    "serial_number": "12865",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 10,
    "volume_number": 1,
    "text": "...Glory be to Him. Worship is His Tawhid (Oneness) and obedience by complying with His commands and leaving His prohibitions. Allah has commanded this in many verses, including His saying: {And they were not commanded except to worship Allah, [being] sincere to Him in religion, inclining to truth} [Al-Bayyinah: 5] (1) the verse, and His saying Almighty: {And your Lord has decreed that you not worship except Him} [Al-Isra: 23] (2) and His saying Glory be to Him: {So worship Allah, [being] sincere to Him in religion. Unquestionably, for Allah is the pure religion} [Az-Zumar: 2-3] (3). The verses in this meaning are many, all indicating the obligation of sincerity of worship to Allah alone and abandoning the worship of others, such as Prophets and others. There is no doubt that Dua (supplication) is one of the most important types of worship and the most comprehensive, so it must be sincerely for Allah alone, as the Almighty said: {So invoke Allah, [being] sincere to Him in religion, although the disbelievers dislike it} [Ghafir: 14] (4). And the Almighty said:",
    "foot_note": "1. (1) Surah Al-Bayyinah Verse 5. \n2. Surah Al-Isra Verse 23. \n3. Surah Az-Zumar Verse 2-3. \n4. Surah Ghafir Verse 14.",
    "book_id": "572",
    "new_page_number": 8
  },
  {
    "serial_number": "12866",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 11,
    "volume_number": 1,
    "text": "{And [He revealed] that the masjids are for Allah, so do not invoke with Allah anyone} [Al-Jinn: 18] (1). This includes all creatures, Prophets and others, because \"anyone\" (ahadan) is indefinite in the context of prohibition, so it encompasses everyone other than Allah Glory be to Him. And He Almighty said: {And do not invoke besides Allah that which neither benefits you nor harms you} [Yunus: 106] (2). This is addressed to the Prophet (peace be upon him), and it is known that Allah Glory be to Him protected him from Shirk (polytheism), but the intent is to warn others. Then the Almighty said: {for if you did, then indeed you would be of the wrongdoers} [Yunus: 106] (3). So if the Master of the sons of Adam, peace be upon him, would be among the wrongdoers if he invoked other than Allah, then what about others? And wrongdoing (Dhulm), when used absolutely, refers to Major Shirk, as He Glory be to Him said: {And the disbelievers - they are the wrongdoers} [Al-Baqarah: 254] (4). And the Almighty said: {Indeed, association [with him] is great injustice} [Luqman: 13] (5). It is known by these verses and others that invoking other than Allah, such as the dead, trees, idols, and others, is Shirk with Allah Almighty which contradicts...",
    "foot_note": "1. (1) Surah Al-Jinn Verse 18. \n2. Surah Yunus Verse 106. \n3. Surah Yunus Verse 106. \n4. Surah Al-Baqarah Verse 254. \n5. Surah Luqman Verse 13.",
    "book_id": "572",
    "new_page_number": 9
  },
  {
    "serial_number": "12867",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 12,
    "volume_number": 1,
    "text": "...the worship for which Allah created the two races, sent Messengers, and revealed Books to explain and invite to. This is the meaning of \"La ilaha illa Allah\" (There is no god but Allah), for its meaning is that there is no true deity worthy of worship except Allah. It negates worship from other than Allah and affirms it for Allah alone, as Allah Glory be to Him said: {That is because Allah is the Truth, and that what they call upon other than Him is falsehood} [Luqman: 30] (1). This is the foundation of the religion and the basis of the creed, and acts of worship are not valid unless this foundation is valid, as the Almighty said: {And it was already revealed to you and to those before you that if you should associate [anything] with Allah, your work would surely become worthless, and you would surely be among the losers} [Az-Zumar: 65] (2). And Glory be to Him said: {But if they had associated others with Allah, then worthless for them would be whatever they were doing} [Al-An'am: 88] (3). [The religion of Islam is built upon two great principles] And the religion of Islam is built upon two great principles:",
    "foot_note": "1. (1) Surah Luqman Verse 30. \n2. Surah Az-Zumar Verse 65. \n3. Surah Al-An'am Verse 88.",
    "book_id": "572",
    "new_page_number": 10
  },
  {
    "serial_number": "12868",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 13,
    "volume_number": 1,
    "text": "The first: That none is worshipped except Allah alone. The second: That He is not worshipped except by the Sharia (law) of His Prophet and Messenger Muhammad (peace be upon him). This is the meaning of the testimony that there is no god but Allah and that Muhammad is the Messenger of Allah. So whoever calls upon the dead among Prophets and others, or calls upon idols, trees, stones, or other creatures, or seeks relief from them, or draws near to them with sacrifices and vows, or prays to them or prostrates to them: he has taken them as lords besides Allah and made them equals to Him, Glory be to Him. This contradicts this principle and negates the meaning of La ilaha illa Allah. Just as whoever innovates in religion that which Allah has not authorized has not realized the meaning of the testimony that Muhammad is the Messenger of Allah. Allah Almighty has said: {And We will regard what they have done of deeds and make them as scattered dust} [Al-Furqan: 23] (1). These deeds are the deeds of those who died upon Shirk with Allah Almighty. Likewise are the innovative deeds which Allah has not authorized; they...",
    "foot_note": "1. (1) Surah Al-Furqan Verse 23.",
    "book_id": "572",
    "new_page_number": 11
  },
  {
    "serial_number": "12869",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 14,
    "volume_number": 1,
    "text": "...will be scattered dust on the Day of Resurrection because they did not conform to His purified Law, as the Prophet (peace be upon him) said: \"Whoever introduces into this affair of ours that which is not of it, it is rejected.\" (Agreed upon its authenticity). This writer has directed her plea for relief and supplication to the Prophet (peace be upon him) and turned away from the Lord of the Worlds, in Whose hand is victory, harm, and benefit, and no one else possesses any of that. There is no doubt that this is a great injustice and grave Shirk. Allah Almighty has commanded that He be called upon Glory be to Him, promised to answer those who call upon Him, and threatened those who are too arrogant for that with entering Hell, as the Almighty said: {And your Lord says, \"Call upon Me; I will respond to you.\" Indeed, those who disdain My worship will enter Hell [rendered] contemptible} [Ghafir: 60] (1). Meaning disgraced and humiliated. This noble verse indicates that Dua (supplication) is worship, and that whoever is too arrogant for it, his abode is Hell. So if this is the state of one who is arrogant towards calling upon Allah, then what is the state...",
    "foot_note": "1. (1) Surah Ghafir Verse 60.",
    "book_id": "572",
    "new_page_number": 12
  },
  {
    "serial_number": "12870",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 15,
    "volume_number": 1,
    "text": "...of one who calls upon other than Him and turns away from Him, while He Glory be to Him is the Near, the Responsive, the Owner of everything, and Able to do all things? As He Glory be to Him said: {And when My servants ask you concerning Me, indeed I am near. I respond to the invocation of the supplicant when he calls upon Me. So let them respond to Me [by obedience] and believe in Me that they may be [rightly] guided} [Al-Baqarah: 186] (1). The Messenger (peace be upon him) informed in the authentic Hadith that Dua is worship, and said to his cousin Abdullah bin Abbas, may Allah be pleased with them both: \"Preserve Allah, He will preserve you. Preserve Allah, you will find Him before you. If you ask, ask Allah, and if you seek help, seek help from Allah\" (Narrated by Tirmidhi and others). And he (peace be upon him) said: \"Whoever dies while calling upon a rival (Nidd) to Allah enters the Fire\" (Narrated by Bukhari). And in the two Sahihs \"from the Prophet (peace be upon him) that he was asked: Which sin is greatest? He said: That you make a rival to Allah while He created you.\" The \"Nidd\" is the equal and the peer. So anyone who calls upon other than Allah, seeks relief from him, vows to him, sacrifices to him, or directs any act of worship to him...",
    "foot_note": "1. (1) Surah Al-Baqarah Verse 186.",
    "book_id": "572",
    "new_page_number": 13
  },
  {
    "serial_number": "12871",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 16,
    "volume_number": 1,
    "text": "...other than what has been mentioned, has taken him as a rival to Allah, whether he is a Prophet, a Saint (Wali), an Angel, a Jinn, an idol, or any other creature. As for asking a living, present person for what he is capable of, and seeking his assistance in physical matters that he is capable of, that is not Shirk but rather ordinary permissible matters among Muslims, as the Almighty said in the story of Moses: {And the one from his faction sought his help against the one from his enemy} [Al-Qasas: 15] (1). And as the Almighty said in the story of Moses also: {So he left it, fearful and anticipating} [Al-Qasas: 21] (2). And just as a human seeks help from his companions in war and other matters that occur to people, where they need to assist one another. [Allah commanded His Prophet (peace be upon him) to convey to people that he possesses no benefit nor harm for anyone] Allah commanded His Prophet (peace be upon him) to convey to people that he possesses no benefit nor harm for anyone, saying in Surah Al-Jinn: {Say, \"I only invoke my Lord and do not associate with Him anyone.\"} [Al-Jinn: 20]",
    "foot_note": "1. (1) Surah Al-Qasas Verse 15. \n2. Surah Al-Qasas Verse 21.",
    "book_id": "572",
    "new_page_number": 14
  },
  {
    "serial_number": "12872",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 17,
    "volume_number": 1,
    "text": "{Say, \"Indeed, I do not possess for you [the power of] harm or right direction.\"} [Al-Jinn: 21] (1). And the Almighty said in Surah Al-Araf: {Say, \"I hold not for myself [the power of] benefit or harm, except what Allah has willed. And if I knew the unseen, I could have acquired much good, and no evil would have touched me. I am not except a warner and a bringer of good tidings to a people who believe.\"} [Al-Araf: 188] (2). The verses in this meaning are many. He (peace be upon him) calls only upon his Lord and seeks relief only from Him. On the day of Badr, he was seeking relief from Allah and seeking His victory against his enemy, insisting on that, saying: \"O Lord, fulfill for me what You promised me,\" until the Great Siddiq Abu Bakr, may Allah be pleased with him, said: \"Enough, O Messenger of Allah, for Allah will fulfill for you what He promised you.\" And Allah Glory be to Him revealed regarding that His saying: {[Remember] when you asked help of your Lord, and He answered you, \"Indeed, I will reinforce you with a thousand from the angels, following one another.\" And Allah made it not but good tidings and so that your hearts would be assured thereby. And victory is not but from Allah. Indeed, Allah is Exalted in Might and Wise} [Al-Anfal: 9-10] (3). So He reminded them in these verses...",
    "foot_note": "1. (1) Surah Al-Jinn Verse 20-21. \n2. Surah Al-Araf Verse 188. \n3. Surah Al-Anfal Verse 9-10.",
    "book_id": "572",
    "new_page_number": 15
  },
  {
    "serial_number": "12873",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 18,
    "volume_number": 1,
    "text": "...of their seeking relief from Him, and informed that He answered them by reinforcing them with angels, then He Glory be to Him clarified that victory is not from the angels, but He reinforced them with them as good tidings and reassurance, and clarified that victory is from Him, saying: {And victory is not but from Allah} [Al-Anfal: 10]. And the Almighty said in Surah Al-Imran: {And Allah had already given you victory at [the battle of] Badr while you were few in number. Then fear Allah; perhaps you will be grateful} [Al-Imran: 123] (1). So He clarified in this verse that He Glory be to Him was the Victor (Helper) for them on the day of Badr. Thus, it is known that what He gave them of weapons and strength and what He reinforced them with of angels, all of that are causes of victory, good tidings, and reassurance. Victory does not come from them; rather, it is from Allah alone. So how is it permissible for this writer or others to direct their plea for relief and request for victory to the Prophet (peace be upon him) and turn away from the Lord of the Worlds, the Owner of everything and Capable of all things?!",
    "foot_note": "1. (1) Surah Al-Imran Verse 123.",
    "book_id": "572",
    "new_page_number": 16
  },
  {
    "serial_number": "12874",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 19,
    "volume_number": 1,
    "text": "There is no doubt that this is of the ugliest ignorance, indeed of the greatest Shirk. The writer must repent to Allah Glory be to Him with sincere repentance, which is by regretting what occurred from her, quitting it, and resolving not to return to it, in glorification of Him, sincerity to Him, compliance with His command, and caution against what He forbade. This is sincere repentance. If it involves the right of creatures, a fourth matter is required in repentance: returning the right to its owner or seeking his pardon. Allah has commanded His servants to repent and promised them its acceptance as the Almighty said: {And turn to Allah in repentance, all of you, O believers, that you might succeed} [An-Nur: 31] (1). And He said regarding the Christians: {So will they not repent to Allah and seek His forgiveness? And Allah is Forgiving and Merciful} [Al-Ma'idah: 74] (2). And the Almighty said: {And those who do not invoke with Allah another deity or kill the soul which Allah has forbidden [to be killed], except by right, and do not commit unlawful sexual intercourse. And whoever should do that will meet a penalty. Multiplied for him is the punishment on the Day of Resurrection, and he will abide therein humiliated} [Al-Furqan: 68-69]",
    "foot_note": "1. (1) Surah An-Nur Verse 31. \n2. Surah Al-Ma'idah Verse 74.",
    "book_id": "572",
    "new_page_number": 17
  },
  {
    "serial_number": "12875",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 20,
    "volume_number": 1,
    "text": "{Except for those who repent, believe and do righteous work. For them Allah will replace their evil deeds with good. And ever is Allah Forgiving and Merciful} [Al-Furqan: 70] (1). And the Almighty said: {And it is He who accepts repentance from his servants and pardons misdeeds, and He knows what you do} [Ash-Shura: 25] (2). And it is authentically reported from the Messenger of Allah (peace be upon him) that he said: \"Islam demolishes what was before it, and repentance wipes out what was before it.\" Because of the great danger of Shirk, being the greatest of sins, and fearing deception by what was issued by this writer, and due to the obligation of advising for the sake of Allah and His servants, I wrote this brief word. I ask Allah Almighty to make it beneficial and to rectify our conditions and the conditions of all Muslims, and to grant us all understanding in religion and steadfastness upon it, and to seek refuge for us and the Muslims from the evils of our souls and the bad consequences of our deeds. He is the Guardian of that and Capable of it. May Allah send peace and blessings upon His servant and Messenger, our Prophet Muhammad, his family, and his companions... [The Second Treatise: Clarifying the ruling on invoking other than Allah Glory be to Him and seeking His help in difficulties] [Allah Glory be to Him created the two races to worship Him alone and to single Him out in Supplication]. The Second Treatise from Abdul Aziz bin Abdullah bin Baz to whomsoever sees it among Muslims, may Allah grant me and them success in holding fast to His religion and remaining steadfast upon it. Amen. Peace, mercy, and blessings of Allah be upon you. To proceed: Some brothers asked me about what some ignorant people do regarding invoking other than Allah Glory be to Him and seeking help from them in difficulties, such as invoking the Jinn, seeking relief from them, vowing to them, sacrificing to them, and similar acts. Examples include some saying: 'O Seven, take him' meaning seven leaders of the Jinn, 'O Seven, do such and such to him', 'Break his bones, drink his blood, mutilate him'. And among that is the saying of some: 'Take him, O Jinn of the noon, O Jinn of the afternoon'. This is found frequently in some southern regions. Included in this matter is invoking the dead among Prophets and the righteous...",
    "foot_note": "1. (1) Surah Al-Furqan Verse 68-70. \n2. Surah Ash-Shura Verse 25.",
    "book_id": "572",
    "new_page_number": 18
  },
  {
    "serial_number": "12876",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 22,
    "volume_number": 1,
    "text": "...and others, and invoking Angels and seeking relief from them. All of this and its likes occur from many who attribute themselves to Islam, out of ignorance and imitation of those before them. Some may even treat it lightly saying: 'This is something that just slips off the tongue, we do not intend it or believe it.' I was also asked about the ruling on marrying those known for these deeds, eating their slaughtered meat, praying over them (funeral prayer), and praying behind them. And about believing charlatans and fortune tellers, such as one who claims to know a disease and its causes merely by looking at something that touched the patient's body, like a turban, trousers, veil, and the like. The Answer: Praise be to Allah alone, and peace and blessings be upon him after whom there is no Prophet, and upon his family and companions and those who are guided by them until the Day of Judgment. To proceed: Allah Glory be to Him has created the two races (Jinn and Mankind) to worship Him to the exclusion of all else, and to single Him out in supplication...",
    "foot_note": "None",
    "book_id": "572",
    "new_page_number": 19
  },
  {
    "serial_number": "12877",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 23,
    "volume_number": 1,
    "text": "...seeking relief, sacrifice, vows, and all other acts of worship. He sent Messengers with this and commanded them to do so, and revealed the heavenly Books, the greatest of which is the Holy Quran, explaining this, inviting to it, and warning people against Shirk with Allah and worshipping others. This is the origin of origins and the foundation of the religion and creed. It is the meaning of the testimony that there is no god but Allah, because its meaning is that there is no true deity worthy of worship except Allah. It negates divinity - which is worship - from other than Allah, and affirms worship for Allah alone to the exclusion of all other creatures. The evidences for this from the Book of Allah and the Sunnah of His Messenger (peace be upon him) are very many, including His saying Almighty: {And I did not create the jinn and mankind except to worship Me} [Adh-Dhariyat: 56] (1). And His saying Glory be to Him: {And your Lord has decreed that you not worship except Him} [Al-Isra: 23] (2). And the Almighty's saying: {And they were not commanded except to worship Allah, [being] sincere to Him in religion, inclining to truth} [Al-Bayyinah: 5] (3). And His saying:",
    "foot_note": "1. (1) Surah Adh-Dhariyat Verse 56. \n2. Surah Al-Isra Verse 23. \n3. Surah Al-Bayyinah Verse 5.",
    "book_id": "572",
    "new_page_number": 20
  },
  {
    "serial_number": "12878",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 24,
    "volume_number": 1,
    "text": "{And your Lord says, \"Call upon Me; I will respond to you.\" Indeed, those who disdain My worship will enter Hell [rendered] contemptible} [Ghafir: 60] (1). And the Almighty said: {And when My servants ask you concerning Me, indeed I am near. I respond to the invocation of the supplicant when he calls upon Me} [Al-Baqarah: 186] (2). So He Glory be to Him clarified in these verses that He created the two races for His worship, and that He decreed that none be worshipped except Him Glory be to Him. The meaning of 'decreed' (Qada) is: commanded and advised. So He Glory be to Him commanded His servants and advised them in the decisive Quran and on the tongue of the Messenger, peace be upon him, not to worship anyone but their Lord. He Almighty clarified that Dua (supplication) is a great act of worship; whoever is arrogant towards it enters the Fire. He commanded His servants to call upon Him alone, and informed that He is near and answers their call. Therefore, it is obligatory upon all servants to single out their Lord in supplication because it is a type of worship for which they were created and commanded. And the Almighty said:",
    "foot_note": "1. (1) Surah Ghafir 60. \n2. Surah Al-Baqarah Verse 186.",
    "book_id": "572",
    "new_page_number": 21
  },
  {
    "serial_number": "12879",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 25,
    "volume_number": 1,
    "text": "{Say, \"Indeed, my prayer, my rites of sacrifice, my living and my dying are for Allah, Lord of the worlds. No partner has He. And this I have been commanded, and I am the first of the Muslims.\"} [Al-An'am: 162-163] (1). Allah commanded His Prophet (peace be upon him) to inform people that his prayer and his rites - which means slaughtering - and his life and death are for Allah, the Lord of the worlds, with no partner. So whoever slaughters for other than Allah has associated partners with Allah, just as if he prayed to other than Allah, because Allah Glory be to Him made prayer and slaughtering companions, and informed that they are for Allah alone with no partner. So whoever slaughters for other than Allah, such as Jinn, Angels, the dead, and others, seeking to draw near to them thereby, is like one who prays to other than Allah. [Shirk deserving entry into the Fire which intercession cannot reach] In the authentic Hadith, the Prophet (peace be upon him) says: \"May Allah curse the one who slaughters for other than Allah.\" Imam Ahmad narrated with a good chain of transmission from Tariq bin Shihab, may Allah be pleased with him, from the Prophet (peace be upon him) that he said: \"Two men passed by a people who had an idol which no one could pass until he offered something to it. They said to one of them: 'Offer something.' He said: 'I have nothing to offer.' They said: 'Offer even a fly.' So he offered a fly, and they let him pass, so he entered the Fire.",
    "foot_note": "1. (1) Surah Al-An'am 162-163.",
    "book_id": "572",
    "new_page_number": 22
  },
  {
    "serial_number": "12880",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 26,
    "volume_number": 1,
    "text": "They said to the other: 'Offer something.' He said: 'I would not offer anything to anyone other than Allah Almighty.' So they struck his neck (beheaded him), and he entered Paradise.\" If one who drew near to an idol and the like with a fly and the like commits Shirk deserving entry into the Fire, then what about one who calls upon Jinn, Angels, and Saints (Awliya), seeks relief from them, vows to them, and draws near to them with sacrifices hoping for the protection of his wealth, or the cure of his patient, or the safety of his livestock and crops, or does so out of fear of the evil of the Jinn or similar things? This and its likes are more deserving of being considered a polytheist deserving of entering the Fire than this man who offered a fly to the idol. Also mentioned regarding this is His Almighty saying: {So worship Allah, [being] sincere to Him in religion. Unquestionably, for Allah is the pure religion. And those who take protectors besides Him [say], \"We only worship them that they may bring us nearer to Allah in position.\" Indeed, Allah will judge between them concerning that over which they differ. Indeed, Allah does not guide he who is a liar and [confirmed] disbeliever} [Az-Zumar: 2-3] (1). And the Almighty said:",
    "foot_note": "1. (1) Surah Az-Zumar Verse 2-3.",
    "book_id": "572",
    "new_page_number": 23
  },
  {
    "serial_number": "12881",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 27,
    "volume_number": 1,
    "text": "{And they worship other than Allah that which neither harms them nor benefits them, and they say, \"These are our intercessors with Allah.\" Say, \"Do you inform Allah of something He does not know in the heavens or on the earth?\" Exalted is He and high above what they associate with Him} [Yunus: 18] (1). Allah Glory be to Him informed in these two verses that the polytheists took allies from creatures besides Him, worshipping them alongside Him through supplication, fear, hope, slaughtering, vows, and the like, claiming that those allies bring them closer to Allah and intercede for them with Him. So Allah Glory be to Him belied them, clarified their falsehood, called them liars, disbelievers, and polytheists, and exalted Himself above their Shirk, saying Almighty: {Exalted is He and high above what they associate with Him} [Yunus: 18]. Thus, it is known that whoever takes an Angel, a Prophet, a Jinn, a tree, or a stone, invoking it with Allah, seeking relief from it, and drawing near to it with vows and slaughtering, hoping for its intercession with Allah and bringing him closer to Him, or hoping for the cure of a patient or preservation...",
    "foot_note": "1. (1) Surah Yunus Verse 18.",
    "book_id": "572",
    "new_page_number": 24
  },
  {
    "serial_number": "12882",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 28,
    "volume_number": 1,
    "text": "...of wealth or safety of an absent person or similar things, has fallen into this great Shirk and grave calamity about which Allah said: {Indeed, Allah does not forgive that you associate partners with Him, but He forgives what is less than that for whom He wills. And he who associates others with Allah has certainly fabricated a tremendous sin} [An-Nisa: 48] (1). And the Almighty said: {Indeed, he who associates others with Allah - Allah has forbidden him Paradise, and his refuge is the Fire. And there are not for the wrongdoers any helpers} [Al-Ma'idah: 72] (2). Intercession occurs on the Day of Resurrection only for the people of Monotheism (Tawhid) and Sincerity, not for the people of Shirk. As the Prophet (peace be upon him) said when he was asked: \"O Messenger of Allah, who is the happiest of people with your intercession?\" He said: \"He who says La ilaha illa Allah sincerely from his heart.\" And he (peace be upon him) said: \"For every Prophet there is an answered prayer, so every Prophet hastened his prayer, but I concealed my prayer as intercession for my Ummah on the Day of Resurrection, and it will reach, if Allah wills, those of my Ummah who died not associating anything with Allah.\"",
    "foot_note": "1. (1) Surah An-Nisa Verse 48. \n2. Surah Al-Ma'idah Verse 72.",
    "book_id": "572",
    "new_page_number": 25
  },
  {
    "serial_number": "12883",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 29,
    "volume_number": 1,
    "text": "The early polytheists used to believe that Allah was their Lord, Creator, and Provider. They only attached themselves to Prophets, Saints, Angels, trees, stones, and similar things hoping for their intercession with Allah and to be brought closer to Him, as mentioned in the previous verses. Allah did not excuse them for that, nor did the Messenger of Allah (peace be upon him) excuse them. Rather, Allah denounced them in His Great Book and called them disbelievers and polytheists, and belied them in their claim that these deities intercede for them and bring them near to Allah in position. The Messenger (peace be upon him) fought them over this Shirk until they dedicated worship solely to Allah alone, acting upon His saying Glory be to Him: {And fight them until there is no fitnah and [until] the religion, all of it, is for Allah} [Al-Anfal: 39] (1). And the Messenger (peace be upon him) said: \"I have been ordered to fight the people until they testify that there is no god but Allah and that Muhammad is the Messenger of Allah, and establish prayer, and pay Zakat. If they do that, they have protected their blood and wealth from me except by the right of Islam, and their reckoning is with...",
    "foot_note": "1. (1) Surah Al-Anfal Verse 29.",
    "book_id": "572",
    "new_page_number": 26
  },
  {
    "serial_number": "12884",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 30,
    "volume_number": 1,
    "text": "...Allah.\" The meaning of his saying (peace be upon him): \"until they testify that there is no god but Allah\" is: until they single out Allah in worship to the exclusion of all else. The polytheists used to fear the Jinn and seek refuge in them, so Allah revealed regarding that His saying: {And there were men from mankind who sought refuge in men from the jinn, so they [only] increased them in burden} [Al-Jinn: 6] (1). Scholars of Tafsir said regarding the noble verse: The meaning of His saying {so they increased them in burden} (rahaqa) is: terror and fear. Because the Jinn aggrandize themselves and become arrogant when they see humans seeking refuge in them, and at that point, they increase the fear and terror for them so that they increase their worship of them and resorting to them. Allah compensated the Muslims for that with seeking refuge in Him Glory be to Him and in His perfect words, and revealed regarding that His saying Almighty: {And if an evil suggestion comes to you from Satan, then seek refuge in Allah. Indeed, He is Hearing and Knowing} [Al-Araf: 200] (2). And His saying Almighty: {Say, \"I seek refuge in the Lord of daybreak\"} [Al-Falaq: 1]",
    "foot_note": "1. (1) Surah Al-Jinn Verse 6. \n2. Surah Al-Araf Verse 200.",
    "book_id": "572",
    "new_page_number": 27
  },
  {
    "serial_number": "12885",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs regarding the Ruling on Those Who Seek Help from Other Than Allah or Believe Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 31,
    "volume_number": 1,
    "text": "(1) {Say, \"I seek refuge in the Lord of mankind\"} [An-Nas: 1] (2). And it is authentically reported from the Prophet (peace be upon him) that he said: \"Whoever stops at a place and says: 'I seek refuge in the perfect words of Allah from the evil of what He has created,' nothing will harm him until he departs from that place of his.\" From the preceding verses and Hadiths, the student seeking salvation and desiring to preserve his religion and safety from Shirk, both subtle and major, knows that attaching oneself to the dead, Angels, Jinn, and other creatures, and invoking them and seeking refuge in them and similar acts, is from the deeds of the people of Jahiliyyah (Pre-Islamic ignorance) and polytheists, and is from the ugliest Shirk with Allah Glory be to Him. So it is obligatory to abandon it, beware of it, advise others to abandon it, and denounce those who do it. [ Rulings of Polytheists apply to them] Whoever among the people is known for these polytheistic acts, it is not permissible to marry from them, nor eat their slaughtered meat, nor pray over them, nor pray behind them until they announce repentance to Allah Glory be to Him from that, and become sincere...",
    "foot_note": "1. (1) Surah Al-Falaq Verse 1. \n2. Surah An-Nas Verse 1.",
    "book_id": "572",
    "new_page_number": 28
  },
  {
    "serial_number": "12886",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 32,
    "volume_number": 1,
    "text": "Supplication (Dua) and worship are for Allah alone. Supplication is worship; rather, it is the essence of worship, as the Prophet (peace and blessings of Allah be upon him) said: 'Supplication is worship.' And in another wording: 'Supplication is the essence of worship.' And He, the Glorified, said: {And do not marry polytheistic women until they believe. And a believing slave woman is better than a polytheist, even though she might please you. And do not marry polytheistic men [to your women] until they believe. And a believing slave is better than a polytheist, even though he might please you. Those invite [you] to the Fire, but Allah invites to Paradise and to forgiveness, by His permission. And He makes clear His verses to the people that perhaps they may remember.} [Al-Baqarah: 221] (1). Allah, the Glorified, forbade the Muslims from marrying polytheistic women who worship idols, jinn, angels, and other things until they believe by dedicating worship sincerely to Allah alone, believing the Messenger (peace and blessings of Allah be upon him) in what he brought, and following his path. And He forbade giving Muslim women in marriage to polytheistic men until they believe by dedicating worship sincerely to Allah alone and believing the Messenger (peace and blessings of Allah be upon him) and following him. And He, the Glorified, informed that a believing slave woman...",
    "foot_note": "1. (1) Surah Al-Baqarah, Verse 221.",
    "book_id": "572",
    "new_page_number": 29
  },
  {
    "serial_number": "12887",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 33,
    "volume_number": 1,
    "text": "...is better than a free polytheistic woman, even if she pleases the one who looks at her and listens to her speech due to her beauty and eloquence. And [He informed] that a believing slave is better than a free polytheist, even if he pleases the listener and the beholder with his beauty, eloquence, courage, and so forth. Then He explained the reasons for this preference by His saying, the Glorified: {Those invite [you] to the Fire} [Al-Baqarah: 221] (1). By this, He means the polytheistic men and women, because they are callers to the Fire through their words, deeds, biographies, and morals. As for the believing men and women, they are callers to Paradise through their morals, deeds, and biographies; so how can these and those be equal? And He, the Majestic and Exalted, said regarding the hypocrites: {And do not pray [the funeral prayer, over] any of them who has died - ever - or stand at his grave. Indeed, they disbelieved in Allah and His Messenger and died while they were defiantly disobedient.} [At-Tawbah: 84] (2). Thus, He, the Majestic and Exalted, clarified in this noble verse that the hypocrite and the disbeliever are not to be prayed over due to their disbelief in Allah and His Messenger. Likewise, no prayer...",
    "foot_note": "1. (1) Surah Al-Baqarah, Verse 221. \n2. Surah At-Tawbah, Verse 84.",
    "book_id": "572",
    "new_page_number": 30
  },
  {
    "serial_number": "12888",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 34,
    "volume_number": 1,
    "text": "...is to be performed behind them, nor are they to be made Imams for Muslims, due to their disbelief, their lack of trustworthiness, and the great enmity between them and the Muslims, and because they are not people of prayer and worship; for disbelief and polytheism leave no [valid] deed remaining with them. We ask Allah for safety from that. And He, the Mighty and Majestic, said regarding the prohibition of carrion and the slaughtered animals of the polytheists: {And do not eat of that upon which the name of Allah has not been mentioned, for indeed, it is grave disobedience. And indeed do the devils inspire their allies [among men] to dispute with you. And if you were to obey them, indeed, you would be associators [of others with Him].} [Al-An'am: 121] (1). He, the Mighty and Majestic, forbade Muslims from eating carrion and the sacrifice of a polytheist because he is impure; thus, his sacrifice is legally considered carrion, even if he mentions the name of Allah over it, because the mention of the Name by him is invalid and has no effect, as it is an act of worship, and polytheism invalidates worship and nullifies it until the polytheist repents to Allah, the Glorified. He, the Mighty and Majestic, only permitted the food of the People of the Book in His saying, the Glorified:",
    "foot_note": "1. (1) Surah Al-An'am, Verse 121.",
    "book_id": "572",
    "new_page_number": 31
  },
  {
    "serial_number": "12889",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 35,
    "volume_number": 1,
    "text": "{And the food of those who were given the Scripture is lawful for you and your food is lawful for them.} [Al-Ma'idah: 5] (1). This is because they ascribe themselves to a heavenly religion and claim that they are followers of Moses and Jesus, even if they are untruthful in that. Allah has indeed abrogated their religion and nullified it by sending Muhammad (peace and blessings of Allah be upon him) to all people. However, Allah, the Majestic and Exalted, made their food and women lawful for us for profound wisdom and observed secrets that scholars have explained, unlike the polytheists who worship idols, dead prophets, saints, and others, because their religion has no basis or semblance [of truth]; rather, it is false from its foundation, so the sacrifice of its people is carrion and eating it is not permissible. [A person saying to someone he addresses: 'A Jinn struck you' as an insult] As for a person saying to someone he addresses: 'A Jinn struck you,' 'A Jinn took you,' 'A devil flew off with you,' and the like; this falls under abuse and cursing, and that is not permissible between Muslims, like all other types of abuse and insults. This does not fall under polytheism (Shirk), unless...",
    "foot_note": "1. (1) Surah Al-Ma'idah, Verse 5.",
    "book_id": "572",
    "new_page_number": 32
  },
  {
    "serial_number": "12890",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 36,
    "volume_number": 1,
    "text": "...the speaker believes that the Jinn dispose of affairs among people without Allah's permission and will. Whoever holds this belief regarding the Jinn or other creatures is a disbeliever due to this belief, because Allah, the Glorified, is the Owner of everything and the Able over everything; He is the Benefactor and the Harmer, and nothing exists except by His permission, will, and pre-ordainment. As He, the Mighty and Majestic, said, commanding His Prophet (peace and blessings of Allah be upon him) to inform the people of this great principle: {Say, 'I hold not for myself [the power of] benefit or harm, except what Allah has willed. And if I knew the unseen, I could have acquired much wealth, and no harm would have touched me. I am not except a warner and a bringer of good tidings to a people who believe.'} [Al-A'raf: 188] (1). So if the Master of creation and the best of them (peace and blessings be upon him) does not possess benefit or harm for himself except what Allah wills, then what of others among the creation? The verses with this meaning are numerous. [Asking fortune tellers, sorcerers, astrologers, and their likes who deal in news of the unseen] As for asking fortune tellers, sorcerers, astrologers, and their likes who deal in giving news about the unseen...",
    "foot_note": "1. (1) Surah Al-A'raf, Verse 188.",
    "book_id": "572",
    "new_page_number": 33
  },
  {
    "serial_number": "12891",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 37,
    "volume_number": 1,
    "text": "...it is an evil act and is not permissible. Believing them is even worse and more detestable; indeed, it is a branch of disbelief, due to the saying of the Prophet (peace and blessings of Allah be upon him): 'Whoever goes to a fortune teller and asks him about something, his prayer will not be accepted for forty days.' Narrated by Muslim in his Sahih. And also in his Sahih, from Muawiyah bin Al-Hakam Al-Sulami (may Allah be pleased with him), that the Prophet (peace and blessings of Allah be upon him) forbade going to soothsayers and asking them. The authors of the Sunan recorded from the Prophet (peace and blessings of Allah be upon him) that he said: 'Whoever goes to a soothsayer and believes what he says has disbelieved in what was revealed to Muhammad (peace and blessings of Allah be upon him).' The hadiths with this meaning are numerous. Therefore, it is obligatory for Muslims to beware of asking soothsayers, fortune tellers, and all charlatans occupied with giving news about the unseen and confusing Muslims, whether under the guise of medicine or otherwise, due to the aforementioned prohibition by the Prophet (peace and blessings of Allah be upon him) regarding that and his warning against it. Included in this is what some people claim in the name of medicine regarding matters of the unseen; if he smells the patient's turban or the patient's veil or the like, he says:",
    "foot_note": "None",
    "book_id": "572",
    "new_page_number": 34
  },
  {
    "serial_number": "12892",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 38,
    "volume_number": 1,
    "text": "('This male patient or this female patient did such-and-such and performed such-and-such') referring to matters of the unseen which smelling the patient's turban and the like does not indicate. The intent of this is merely to confuse the common people so they say he is knowledgeable in medicine and knows the types of diseases and their causes. Perhaps he gives them some medicine which coincides with healing by Allah's decree, so they think it was due to his medicine. Or perhaps the illness was caused by some Jinn and devils who serve that claimant of medicine and inform him of some unseen matters they observe; so he relies on that and pleases the Jinn and devils with acts of worship that suit them, causing them to lift their harm from that patient and leave what they had afflicted him with. This is something known about the Jinn and devils and those who employ them. Thus, it is obligatory for Muslims to beware of this, to advise one another to abandon it, and to rely on Allah, the Glorified, and place trust in Him in all matters. There is no harm in using...",
    "foot_note": "None",
    "book_id": "572",
    "new_page_number": 35
  },
  {
    "serial_number": "12893",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 39,
    "volume_number": 1,
    "text": "...legitimate Ruqyah (incantations), permissible medicines, and treatment by doctors who use examination of the patient to confirm his illness through sensory and logical means. It has been authentically reported from the Prophet (peace and blessings of Allah be upon him): 'Allah has not sent down a disease except that He sent down for it a cure; those who know it know it, and those who are ignorant of it are ignorant.' And he (peace and blessings of Allah be upon him) said: 'For every disease there is a medicine, so if the medicine of the disease hits the mark, it is cured by the permission of Allah.' And he (peace and blessings of Allah be upon him) said: 'O servants of Allah, seek medical treatment, but do not treat yourselves with what is unlawful (Haram).' The hadiths with this meaning are numerous. We ask Allah, the Mighty and Majestic, to rectify the conditions of all Muslims, to heal their hearts and bodies from every evil, to unite them upon guidance, and to protect us and them from misleading tribulations and from obedience to Satan and his allies. Indeed, He is capable of all things, and there is no power or might except with Allah, the Most High, the Great. And may Allah send peace and blessings upon His servant and Messenger, our Prophet Muhammad, and his family and companions.",
    "foot_note": "None",
    "book_id": "572",
    "new_page_number": 36
  },
  {
    "serial_number": "12894",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 41,
    "volume_number": 1,
    "text": "[The Third Letter clarifying the ruling on innovative and polytheistic litanies attributed to Ali bin Abi Talib] [The meaning of Worship] The third letter from Abdul Aziz bin Abdullah bin Baz to the honorable brother (... . . . . . . . . .) may Allah grant him success in every good, Amen. Peace be upon you and the mercy of Allah and His blessings. As for what follows: Your noble letter has reached me, may Allah connect you with His guidance. It included the information that there are people in your country holding onto litanies (Awrad) for which Allah has sent down no authority; some are innovative (Bid'ah) and some are polytheistic (Shirk). They attribute this to the Commander of the Faithful Ali bin Abi Talib (may Allah be pleased with him) and others. They recite these litanies in gatherings of remembrance or in mosques after the Maghrib prayer, claiming they are acts of drawing closer to Allah. Such as their saying: 'By the right of Allah, O Men of Allah, aid us by the help of Allah, and be our help by Allah.' And their saying: 'O Poles (Aqtâb), O Pegs (Awtâd), O Masters (Asyad)...",
    "foot_note": "None",
    "book_id": "572",
    "new_page_number": 37
  },
  {
    "serial_number": "12895",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 42,
    "volume_number": 1,
    "text": "...answer, O possessors of support among us, and intercede for the sake of Allah. This is your servant standing, staying at your door, fearful of his shortcomings. Aid us, O Messenger of Allah; I have no one other than you all to go to, and from you the request is obtained, and you are the best people of Allah. By Hamza, the Master of Martyrs, and whoever among you is a support for us; aid us, O Messenger of Allah.' And their saying: 'O Allah, send peace upon the one whom You made a cause for the splitting of Your Compulsive Secrets and the bursting forth of Your Merciful Lights, so he became a deputy of the Divine Presence and the successor of Your Essential Secrets.' And [you expressed] your desire for clarification on what is innovation and what is polytheism, and whether prayer is valid behind an Imam who supplicates with this supplication. All of that was understood. The Answer: Praise be to Allah alone, and peace and blessings be upon the one after whom there is no prophet, and upon his family and companions and those who are guided by his guidance until the Day of Judgment. As for what follows:",
    "foot_note": "None",
    "book_id": "572",
    "new_page_number": 38
  },
  {
    "serial_number": "12896",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 43,
    "volume_number": 1,
    "text": "Know - may Allah grant you success - that Allah, the Glorified, only created the creation and sent the Messengers (peace and blessings be upon them) so that He alone would be worshipped with no partner, to the exclusion of all else, as the Exalted said: {And I did not create the jinn and mankind except to worship Me.} [Adh-Dhariyat: 56] (1). Worship is: obeying Him, the Glorified, and obeying His Messenger Muhammad (peace and blessings of Allah be upon him) by doing what Allah and His Messenger commanded and leaving what Allah and His Messenger forbade, including faith in Allah and His Messenger and sincerity to Allah in action with the utmost love for Allah and complete humility to Him alone, as the Exalted said: {And your Lord has decreed that you not worship except Him} [Al-Isra: 23] (2). Meaning, He commanded and enjoined that He alone be worshipped. And the Exalted said: {All praise is due to Allah, Lord of the worlds - The Entirely Merciful, the Especially Merciful - Sovereign of the Day of Recompense. It is You we worship and You we ask for help.} [Al-Fatiha: 2-5] (3). He, the Glorified, made clear by these verses that He is the One deserving to be worshipped alone and asked for help...",
    "foot_note": "1. (1) Surah Ad-Dhariyat, Verse 56. \n2. Surah Al-Isra, Verse 23. \n3. Surah Al-Fatiha, Verses 2-5.",
    "book_id": "572",
    "new_page_number": 39
  },
  {
    "serial_number": "12897",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 44,
    "volume_number": 1,
    "text": "...alone. And He, the Mighty and Majestic, said: {So worship Allah, [being] sincere to Him in religion. Unquestionably, for Allah is the pure religion.} [Az-Zumar: 2-3] (1). And the Exalted said: {So invoke Allah, [being] sincere to Him in religion, although the disbelievers dislike it.} [Ghafir: 14] (2). And the Exalted said: {And [He revealed] that the mosques are for Allah, so do not invoke with Allah anyone.} [Al-Jinn: 18] (3). The verses with this meaning are numerous, and all of them indicate the obligation of singling out Allah in worship. It is known that supplication (Dua) in its various forms is worship, so it is not permissible for any person to invoke anyone except his Lord, nor seek help or succor except from Him, acting upon these noble verses and what has come in their meaning. This applies to things other than ordinary matters and tangible means which a living, present creature is capable of; for those are not [acts of divine] worship. Rather, it is permissible by text and consensus for a human to seek help from a living, capable human in ordinary matters within his power, such as seeking his help or...",
    "foot_note": "1. (1) Surah Az-Zumar, Verses 2-3. \n2. Surah Ghafir, Verse 14. \n3. Surah Al-Jinn, Verse 18.",
    "book_id": "572",
    "new_page_number": 40
  },
  {
    "serial_number": "12898",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 45,
    "volume_number": 1,
    "text": "...seeking his succor in repelling the evil of his child, servant, or dog and the like. Or for a human to seek help from a living, present, capable human, or an absent one via tangible means like correspondence and the like, in building his house or repairing his car or the like. From this category is the saying of Allah, the Mighty and Majestic, in the story of Moses (peace and blessings be upon him): {And the one from his faction called for help to him against the one from his enemy} [Al-Qasas: 15] (1). And from this is a person seeking succor from his companions in Jihad and war and the like. [Seeking succor from the dead, Jinn, angels, trees, and stones] As for seeking succor (Istighatha) from the dead, Jinn, angels, trees, and stones, that is Major Polytheism (Shirk Akbar). It is of the same genus as the deeds of the early polytheists with their gods like Al-Uzza, Al-Lat, and others. Likewise is seeking succor and help from those believed to be saints (Awliya) among the living regarding things that no one is capable of except Allah, such as healing the sick, guiding hearts, entering Paradise, and salvation...",
    "foot_note": "1. (1) Surah Al-Qasas, Verse 15.",
    "book_id": "572",
    "new_page_number": 41
  },
  {
    "serial_number": "12899",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 46,
    "volume_number": 1,
    "text": "...from the Fire and the like. The previous verses and the verses and hadiths with their meaning all indicate the obligation of directing hearts to Allah in all matters and dedicating worship sincerely to Allah alone; because the slaves were created for that and were commanded to do it, as previously mentioned in the verses and as is in His saying, the Glorified: {And worship Allah and associate nothing with Him.} [An-Nisa: 36] (1). And His saying, the Glorified: {And they were not commanded except to worship Allah, [being] sincere to Him in religion.} [Al-Bayyinah: 5] (2). And the saying of the Prophet (peace and blessings of Allah be upon him) in the hadith of Muadh (may Allah be pleased with him): 'The right of Allah upon the slaves is that they worship Him and do not associate anything with Him' (Agreed upon its authenticity). And his saying (peace and blessings of Allah be upon him) in the hadith of Ibn Masud (may Allah be pleased with him): 'Whoever dies while invoking a rival to Allah enters the Fire' (Narrated by Al-Bukhari). And in the two Sahihs from the hadith of Ibn Abbas (may Allah be pleased with them): That the Prophet (peace and blessings of Allah be upon him), when he sent Muadh to Yemen, said to him: 'You are going to...",
    "foot_note": "1. (1) Surah An-Nisa, Verse 36. \n2. Surah Al-Bayyinah, Verse 5.",
    "book_id": "572",
    "new_page_number": 42
  },
  {
    "serial_number": "12900",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 47,
    "volume_number": 1,
    "text": "...a people of the Scripture, so let the first thing you invite them to be the testimony that there is no god but Allah.' And in a wording: 'So invite them to testify that there is no god but Allah and that I am the Messenger of Allah.' And in a narration by Al-Bukhari: 'So invite them to unify Allah (Tawheed).' And in Sahih Muslim from Tariq bin Ashyim Al-Ashja'i (may Allah be pleased with him) that the Prophet (peace and blessings of Allah be upon him) said: 'Whoever unifies Allah and disbelieves in what is worshipped other than Allah, his wealth and blood become inviolable, and his reckoning is with Allah, the Mighty and Majestic.' The hadiths with this meaning are numerous. [Tawheed is the origin of the religion of Islam and the foundation of the Creed] This Tawheed (Monotheism) is the origin of the religion of Islam, the foundation of the Creed, the head of the matter, the most important of obligations, and the wisdom behind the creation of the two weighty kinds (Jinn and Mankind) and the wisdom behind sending all the Messengers (peace and blessings be upon them), as the verses indicating that have preceded. Among them is His saying, the Glorified: {And I did not create the jinn and mankind except to worship Me.} [Adh-Dhariyat: 56] (1). And among the proofs for that also is His saying, the Mighty and Majestic: {And We certainly sent into every nation a messenger, [saying], 'Worship Allah and avoid Taghut.'} [An-Nahl: 36]",
    "foot_note": "1. (1) Surah Ad-Dhariyat, Verse 56.",
    "book_id": "572",
    "new_page_number": 43
  },
  {
    "serial_number": "12901",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 48,
    "volume_number": 1,
    "text": "(1) And His saying, the Glorified: {And We sent not before you any messenger except that We revealed to him that, 'There is no deity except Me, so worship Me.'} [Al-Anbiya: 25] (2). And the Mighty and Majestic said regarding Noah, Hud, Salih, and Shu'ayb (peace and blessings be upon them) that they said to their people: {Worship Allah; you have no deity other than Him.} [Al-A'raf: 59] (3). This is the call of all the Messengers, as indicated by the two previous verses. The enemies of the Messengers admitted that the Messengers commanded them to single out Allah in worship and to cast off the gods worshipped beside Him, as the Mighty and Majestic said in the story of Ad, that they said to Hud (peace and blessings be upon him): {They said, 'Have you come to us that we should worship Allah alone and leave what our fathers have worshipped?'} [Al-A'raf: 70] (4). And He, the Glorified and Exalted, said regarding the Quraish when our Prophet Muhammad (peace and blessings of Allah be upon him) invited them to single out Allah in worship and abandon what they worshipped beside Him, such as angels, saints...",
    "foot_note": "1. (1) Surah An-Nahl, Verse 36. \n2. Surah Al-Anbiya, Verse 25. \n3. Surah Al-A'raf, Verse 59. \n4. Surah Al-A'raf, Verse 70.",
    "book_id": "572",
    "new_page_number": 44
  },
  {
    "serial_number": "12902",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 49,
    "volume_number": 1,
    "text": "...idols, trees, and other things: {'Has he made the gods [all] one God? Indeed, this is a curious thing.'} [Sad: 5] (1). And He, the Glorified and Exalted, said about them in Surah As-Saffat: {Indeed they, when it was said to them, 'There is no deity but Allah,' were arrogant. And were saying, 'Are we to leave our gods for a mad poet?'} [As-Saffat: 35-36] (2). The verses indicating this meaning are numerous. From what we have mentioned of verses and hadiths, it becomes clear to you - may Allah grant me and you success in understanding the religion and insight into the right of the Lord of the Worlds - that these supplications and types of seeking succor which you clarified in your question are all types of Major Polytheism (Shirk Akbar); because they are worship of other than Allah, and a request for things that no one is capable of except Him, [directed] to the dead and the absent. This is uglier than the polytheism of the ancients because the ancients would commit polytheism in times of ease, but in times of hardship, they would dedicate worship sincerely to Allah because they...",
    "foot_note": "1. (1) Surah Sad, Verse 5. \n2. Surah As-Saffat, Verses 35-36.",
    "book_id": "572",
    "new_page_number": 45
  },
  {
    "serial_number": "12903",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 50,
    "volume_number": 1,
    "text": "...knew that He, the Glorified, is the One capable of saving them from distress, to the exclusion of others. As the Exalted said in His clear Book regarding those polytheists: {And when they board a ship, they supplicate Allah, sincere to Him in religion. But when He delivers them to the land, at once they associate others with Him.} [Al-Ankabut: 65] (1). And He, the Glorified and Exalted, said addressing them in another verse: {And when adversity touches you at sea, lost are [all] those you invoke except Him. But when He delivers you to the land, you turn away [from Him]. And ever is man ungrateful.} [Al-Isra: 67] (2). If a speaker from these later polytheists says: 'We do not intend that those [saints] benefit by themselves or cure our sick by themselves or benefit us by themselves or harm us by themselves; rather, we intend their intercession to Allah in that!!' The answer is to say to him: 'This is exactly the intent of the earlier disbelievers and their desire...",
    "foot_note": "1. (1) Surah Al-Ankabut, Verse 65. \n2. Surah Al-Isra, Verse 67.",
    "book_id": "572",
    "new_page_number": 46
  },
  {
    "serial_number": "12904",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 51,
    "volume_number": 1,
    "text": "...and it was not their intent that their gods create, provide, benefit, or harm by themselves, for that is nullified by what Allah mentioned about them in the Quran, that they wanted their intercession, status, and proximity to bring them closer to Allah, as He, the Glorified and Exalted, said in Surah Yunus (peace and blessings be upon him): {And they worship other than Allah that which neither harms them nor benefits them, and they say, 'These are our intercessors with Allah.'} [Yunus: 18] (1). So Allah refuted them by His saying, the Glorified: {Say, 'Do you inform Allah of something He does not know in the heavens or on the earth?' Exalted is He and high above what they associate with Him.} [Yunus: 18] (2). Thus, He, the Glorified, made clear that He does not know of any intercessor with Him in the heavens or on the earth in the manner intended by the polytheists; and what Allah does not know the existence of, does not exist, because nothing is hidden from Him, the Glorified. And the Exalted said in Surah Az-Zumar: {The revelation of the Book is from Allah, the Exalted in Might, the Wise. Indeed, We have sent down to you the Book in truth. So worship Allah, [being] sincere to Him in religion. Unquestionably, for Allah is the pure religion.} [Az-Zumar: 1-3]",
    "foot_note": "1. (1) Surah Yunus, Verse 18. \n2. Surah Yunus, Verse 18.",
    "book_id": "572",
    "new_page_number": 47
  },
  {
    "serial_number": "12905",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 52,
    "volume_number": 1,
    "text": "(1) So He, the Glorified, made clear that worship is for Him alone and that it is obligatory upon the servants to dedicate it sincerely to Him, the Mighty and Majestic; because His command to the Prophet (peace and blessings of Allah be upon him) to dedicate worship sincerely to Him is a command to everyone. The meaning of 'Religion' here is 'Worship'. And Worship is: obeying Him and obeying His Messenger (peace and blessings of Allah be upon him), as mentioned before. Included in it are supplication, seeking succor, fear, hope, slaughtering, and vows, just as prayer, fasting, and other things commanded by Allah and His Messenger are included. [Refutation of the disbelievers' intent that they only worshipped the saints besides Him so they would bring them closer to Allah] Then He, the Mighty and Majestic, said after that: {And those who take protectors besides Him [say], 'We only worship them that they may bring us nearer to Allah in position.'} [Az-Zumar: 3] (2). Meaning, they say, 'We only worship them so they may bring us closer to Allah.' So Allah refuted them by His saying, the Glorified: {Indeed, Allah will judge between them concerning that wherein they differ. Indeed, Allah does not guide he who is a liar and [confirmed] disbeliever.} [Az-Zumar: 3] (3). So He, the Glorified, explained in this noble verse...",
    "foot_note": "1. (1) Surah Az-Zumar, Verses 1-3. \n2. Surah Az-Zumar, Verse 3. \n3. Surah Az-Zumar, Verse 3.",
    "book_id": "572",
    "new_page_number": 48
  },
  {
    "serial_number": "12906",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 53,
    "volume_number": 1,
    "text": "...that the disbelievers only worshipped the saints besides Him so that they would bring them closer to Allah in position. This is the objective of the disbelievers, both ancient and modern, and Allah has invalidated that by His saying: {Indeed, Allah will judge between them concerning that wherein they differ. Indeed, Allah does not guide he who is a liar and [confirmed] disbeliever.} [Az-Zumar: 3] (1). Thus, He, the Glorified, clarified their lying in their claim that their gods bring them closer to Allah in position, and their disbelief due to the worship they directed towards them. By this, everyone with the slightest discernment knows that the disbelief of the early disbelievers was solely due to their taking prophets, saints, trees, stones, and other creatures as intercessors between them and Allah, believing that they fulfill their needs without His permission, the Glorified, or His pleasure, just as ministers intercede with kings. So they compared Him, the Mighty and Majestic, to kings and leaders, and said: 'Just as one who has a need with a king or leader seeks intercession through his intimates and ministers, so too we draw closer to Allah by worshipping His prophets and saints.' This is the falsest of falsehoods because He, the Glorified, has no likeness...",
    "foot_note": "1. (1) Surah Az-Zumar, Verse 3.",
    "book_id": "572",
    "new_page_number": 49
  },
  {
    "serial_number": "12907",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 54,
    "volume_number": 1,
    "text": "...and cannot be compared to His creation. No one intercedes with Him except by His permission, and He does not permit intercession except for the people of Monotheism (Tawheed). He, the Glorified and Exalted, is Able to do all things, Knowledgeable of all things, and He is the Most Merciful of the merciful. He does not fear anyone nor dread them, because He, the Glorified, is the Subduer above His servants and acts within them however He wills. This is unlike kings and leaders, for they are unable to do many things and do not know everything; therefore, they need those who help them with what they may be incapable of, such as their ministers, intimates, and soldiers. Just as they need those who convey to them the needs of those whose needs they do not know; thus, they need those who seek their sympathy and please them from among their ministers and intimates. As for the Lord, the Mighty and Majestic, He, the Glorified, is free of need from all His creation, and He is more merciful to them than their mothers. He is the Just Ruler who places things in their [proper] places according to His wisdom, knowledge, and ability. So it is not permissible to compare Him to His creation in any way whatsoever. For this reason, He, the Glorified, made clear in His Book that...",
    "foot_note": "None",
    "book_id": "572",
    "new_page_number": 50
  },
  {
    "serial_number": "12908",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 55,
    "volume_number": 1,
    "text": "...the polytheists admitted that He is the Creator, the Provider, the Disposer [of affairs], and that He is the One who answers the desperate, removes evil, gives life and causes death, among other actions of His, the Glorified. [The dispute between the polytheists and the Messengers is regarding dedicating worship sincerely to Allah alone] The dispute between the polytheists and the Messengers was only regarding dedicating worship sincerely to Allah alone, as the Mighty and Majestic said: {And if you asked them who created them, they would surely say, 'Allah.'} [Az-Zukhruf: 87] (1). And the Exalted said: {Say, 'Who provides for you from the heaven and the earth? Or who controls hearing and sight and who brings the living out of the dead and brings the dead out of the living and who arranges [every] matter?' They will say, 'Allah,' so say, 'Then will you not fear Him?'} [Yunus: 31] (2). The verses with this meaning are numerous. We previously mentioned the verses indicating that the conflict between the Messengers and the nations is only regarding dedicating worship sincerely to Allah alone, like His saying, the Glorified: {And We certainly sent into every nation a messenger, [saying], 'Worship Allah} [An-Nahl: 36] 56 {and avoid Taghut.'} [An-Nahl: 36] (3), and the verses that come with its meaning. He, the Glorified, explained the matter of intercession in many places in His Noble Book. He said in Surah Al-Baqarah: {Who is it that can intercede with Him except by His permission?} [Al-Baqarah: 255] (4). And He said in Surah An-Najm: {And how many angels there are in the heavens whose intercession will not avail at all except [only] after Allah has permitted [it] to whom He wills and approves.} [An-Najm: 26] (5). And He said in Surah Al-Anbiya describing the angels: {and they cannot intercede except on behalf of one whom He approves. And they, from fear of Him, are apprehensive.} [Al-Anbiya: 28] (6). And the Mighty and Majestic informed that He does not approve of disbelief from His servants, but rather approves of gratitude from them. Gratitude is: unifying Him (Tawheed) and acting in obedience to Him. So He said in Surah Az-Zumar: {If you disbelieve - indeed, Allah is Free from need of you. And He does not approve for His servants disbelief. And if you are grateful, He approves it for you.} [Az-Zumar: 7] (7). Al-Bukhari narrated in his Sahih 'from...",
    "foot_note": "1. (1) Surah Az-Zukhruf, Verse 87. \n2. Surah Yunus, Verse 31. \n3. Surah An-Nahl, Verse 36. \n4. Surah Al-Baqarah, Verse 255. \n5. Surah An-Najm, Verse 26. \n6. Surah Al-Anbiya, Verse 28. \n7. Surah Az-Zumar, Verse 7.",
    "book_id": "572",
    "new_page_number": 51
  },
  {
    "serial_number": "12909",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 57,
    "volume_number": 1,
    "text": "...Abu Huraira (may Allah be pleased with him) that he said: O Messenger of Allah, who will be the happiest of people with your intercession? He said: He who says 'There is no god but Allah' sincerely from his heart - or he said: 'from his soul'.' And in the Sahih from Anas (may Allah be pleased with him) from the Prophet (peace and blessings of Allah be upon him) that he said: 'For every prophet, there is a supplication that is answered, so every prophet hastened his supplication. But I have reserved my supplication as intercession for my Ummah (nation) on the Day of Resurrection, and it will reach, if Allah wills, those of my Ummah who died not associating anything with Allah.' The hadiths with this meaning are numerous. All of the verses and hadiths we have mentioned indicate that worship is the right of Allah alone, and that it is not permissible to direct any part of it to other than Allah, neither to prophets nor to others. And that intercession belongs to Allah, the Mighty and Majestic, as He, the Glorified, said: {Say, 'To Allah belongs [the right to allow] intercession entirely.'} [Az-Zumar: 44] (1). And no one deserves it except after His permission to the intercessor and His pleasure with the one interceded for, and He, the Glorified, is not pleased with anything except Monotheism (Tawheed), as previously mentioned. As for...",
    "foot_note": "1. (1) Surah Az-Zumar, Verse 44.",
    "book_id": "572",
    "new_page_number": 52
  },
  {
    "serial_number": "12910",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 58,
    "volume_number": 1,
    "text": "...the polytheists, they have no share in intercession, as the Exalted said: {So there will not benefit them the intercession of [any] intercessors.} [Al-Muddaththir: 48] (1). And the Exalted said: {For the wrongdoers there will be no devoted friend and no intercessor [who is] obeyed.} [Ghafir: 18] (2). Wrongdoing (Dhulm), when used absolutely, refers to polytheism (Shirk), as the Exalted said: {And the disbelievers - they are the wrongdoers.} [Al-Baqarah: 254] (3). And the Exalted said: {Indeed, association [with him] is great injustice.} [Luqman: 13] (4). [The saying of some Sufis in mosques and other places involves affectation and extremism which the Prophet warned against] As for what you mentioned in the question regarding the saying of some Sufis in mosques and other places: 'O Allah, send peace upon the one whom You made a cause for the splitting of Your Compulsive Secrets and the bursting forth of Your Merciful Lights, so he became a deputy of the Divine Presence and the successor of Your Essential Secrets...' etc. The Answer: It is said that this speech and its likes are among the affectation and extremism (Tanattu') against which our Prophet Muhammad (peace and blessings of Allah be upon him) warned...",
    "foot_note": "1. (1) Surah Al-Muddaththir, Verse 48. \n2. Surah Ghafir, Verse 18. \n3. Surah Al-Baqarah, Verse 254. \n4. Surah Luqman, Verse 13.",
    "book_id": "572",
    "new_page_number": 53
  },
  {
    "serial_number": "12911",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 59,
    "volume_number": 1,
    "text": "...in what Muslim narrated in the Sahih from Abdullah bin Masud (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'Ruined are the hair-splitters (Al-Mutanatti'un).' He said it three times. Imam Al-Khattabi (may Allah have mercy on him) said: 'The hair-splitter is the one who goes deep into a thing, acting with affectation in seeking it, following the ways of the people of Kalam (theological rhetoric) who enter into what does not concern them and delve into what their intellects cannot reach.' And Abu Al-Sa'adat bin Al-Athir said: 'They are the ones who go deep and exaggerate in speech, speaking from the furthest part of their throats; taken from 'Nita'' which is the upper palate of the mouth, then it was used for everyone who goes deep in word and deed.' By what these two Imams from the Imams of language have mentioned, it becomes clear to you and to everyone with the slightest insight that this manner of sending prayers and peace upon our Prophet and Master, the Messenger of Allah (peace and blessings of Allah be upon him), is among the forbidden affectation and extremism. What is legislated for the Muslim in this chapter is to seek the manner confirmed from the Messenger of Allah (peace and blessings of Allah be upon him) in...",
    "foot_note": "None",
    "book_id": "572",
    "new_page_number": 54
  },
  {
    "serial_number": "12912",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 60,
    "volume_number": 1,
    "text": "...the form of prayer and peace upon him, and in that there is sufficiency over anything else. Among that is what Al-Bukhari and Muslim narrated in the two Sahihs, and the wording is Al-Bukhari's, from Ka'b bin Ujrah (may Allah be pleased with him) that the Companions (may Allah be pleased with them) 'said: O Messenger of Allah, we have been commanded to send prayers upon you, so how do we send prayers upon you? He said: Say: O Allah, send prayers upon Muhammad and upon the family of Muhammad, as You sent prayers upon Abraham and upon the family of Abraham; indeed, You are Praiseworthy and Glorious. And bless Muhammad and the family of Muhammad, as You blessed Abraham and the family of Abraham; indeed, You are Praiseworthy and Glorious.' And in the two Sahihs from Abu Hamid Al-Sa'idi (may Allah be pleased with him) that they 'said: O Messenger of Allah, how do we send prayers upon you? He said: Say: O Allah, send prayers upon Muhammad and upon his wives and his offspring, as You sent prayers upon the family of Abraham. And bless Muhammad and his wives and his offspring, as You blessed the family of Abraham; indeed, You are Praiseworthy and Glorious.' And in Sahih Muslim from Abu Masud Al-Ansari (may Allah be pleased with him) who said:",
    "foot_note": "None",
    "book_id": "572",
    "new_page_number": 55
  },
  {
    "serial_number": "12913",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 61,
    "volume_number": 1,
    "text": "'Bashir bin Sa'd said: O Messenger of Allah, Allah has commanded us to send prayers upon you, so how do we send prayers upon you? He remained silent, then said: Say: O Allah, send prayers upon Muhammad and upon the family of Muhammad, as You sent prayers upon Abraham. And bless Muhammad and upon the family of Muhammad, as You blessed Abraham in the worlds; indeed, You are Praiseworthy and Glorious. And the salutation (Salam) is as you have learned.'' These wordings and their likes and others which have been confirmed from the Prophet (peace and blessings of Allah be upon him) are what a Muslim should use in his prayer and peace upon the Messenger of Allah (peace and blessings of Allah be upon him), because the Messenger (peace and blessings of Allah be upon him) is the most knowledgeable of people regarding what is appropriate to be used in his right, just as he is the most knowledgeable of people regarding what should be used in the right of his Lord in terms of expressions. As for affected and innovative expressions, and expressions that carry potential incorrect meanings like the expressions mentioned in the question, they should not be used because they contain affectation and because they might be interpreted with false meanings, along with being contrary to the expressions chosen by the Messenger of Allah (peace and blessings of Allah be upon him) -",
    "foot_note": "None",
    "book_id": "572",
    "new_page_number": 56
  },
  {
    "serial_number": "12914",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 62,
    "volume_number": 1,
    "text": "...and which he guided his Ummah to. He is the most knowledgeable of creation, the most sincere in advice, and the furthest of them from affectation; upon him from his Lord be the best prayers and peace. I hope that what we have mentioned of proofs clarifying the reality of Monotheism (Tawheed), the reality of Polytheism (Shirk), and the difference between what the early polytheists were upon and the later polytheists in this chapter, and in clarifying the legislated manner of prayer upon the Messenger of Allah (peace and blessings of Allah be upon him), contains sufficiency and satisfaction for the seeker of truth. As for the one who has no desire to know the truth, he is a follower of his desires. Allah, the Mighty and Majestic, has said: {But if they do not respond to you - then know that they only follow their [own] desires. And who is more astray than one who follows his desire without guidance from Allah? Indeed, Allah does not guide the wrongdoing people.} [Al-Qasas: 50] (1). So He, the Glorified, made clear in this noble verse that people, in relation to what Allah sent His Prophet Muhammad (peace and blessings of Allah be upon him) with of guidance and the religion of truth, are of two types: The first: One who responds to Allah and His Messenger. The second: One who follows his desire.",
    "foot_note": "1. (1) Surah Al-Qasas, Verse 50.",
    "book_id": "572",
    "new_page_number": 57
  },
  {
    "serial_number": "12915",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Establishing Proofs on the Ruling of One Who Seeks Help from Other Than Allah or Believes Soothsayers and Fortune Tellers",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without specific data",
    "page_number": 63,
    "volume_number": 1,
    "text": "And He, the Glorified, informed that there is no one more astray than he who follows his desire without guidance from Allah. So we ask Allah, the Mighty and Majestic, for safety from following desire, just as we ask Him, the Glorified, to make us and you and all our brothers among those who respond to Allah and His Messenger (peace and blessings of Allah be upon him), who venerate His law, and who warn against everything that opposes His law in terms of innovations and desires. Indeed, He is Magnanimous and Generous. And may Allah send peace and blessings upon His servant and Messenger, our Prophet Muhammad, and his family, his companions, and his followers in goodness until the Day of Judgment.",
    "foot_note": "None",
    "book_id": "572",
    "new_page_number": 58
  }
]