[
  {
    "serial_number": "97939",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Doctrine (Aqeedah). Book: The Doctrine of Belief in the Last Day and Its Effect on Reforming Society. Author: Dr. Abdul Majeed bin Muhammad Al-Wa'lan. Number of pages: 69. [The book is not printed]. Date of publication in Shamela: 25 Safar 1442.\nBook: The Doctrine of Belief in the Last Day and Its Effect on Reforming Society. Author: Dr. Abdul Majeed bin Muhammad Al-Wa'lan. Number of pages: 69. [The book is not printed]. Date of publication in Shamela: 25 Safar 1442.\nAuthor: Dr. Abdul Majeed bin Muhammad Al-Wa'lan. Number of pages: 69. [The book is not printed]. Date of publication in Shamela: 25 Safar 1442.\nNumber of pages: 69. [The book is not printed]. Date of publication in Shamela: 25 Safar 1442.\n[The book is not printed]. Date of publication in Shamela: 25 Safar 1442.\nDate of publication in Shamela: 25 Safar 1442",
    "foot_note": "None",
    "book_id": "51"
  },
  {
    "serial_number": "97940",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society\nDr. Abdul Majeed bin Muhammad Al-Wa'lan",
    "foot_note": "None",
    "book_id": "51"
  },
  {
    "serial_number": "97941",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "Introduction\nIndeed, all praise is due to Allah. We praise Him, seek His help, and ask for His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whomever Allah guides, no one can misguide, and whomever He misguides, no one can guide. I bear witness that there is no deity worthy of worship except Allah alone, having no partner, and I bear witness that Muhammad is His servant and Messenger.\n{O you who have believed, fear Allah as He should be feared and do not die except as Muslims [in submission to Him].} [Ali 'Imran: 102]\n{O you who have believed, fear Allah. And let every soul look to what it has put forth for tomorrow - and fear Allah. Indeed, Allah is Acquainted with what you do.} [Al-Hashr: 18].\nTo proceed:\nThe doctrine of belief in the Last Day is one of the fundamental issues of creed brought by Islam, upon which the structure of this creed rests after the issue of the Oneness of Allah (Tawheed). This religion—in creed, concept, character, behavior, law, and system—does not stand except upon it and by it.\nTrue life in Islam extends through time to include the limited period witnessed by humans—the period of worldly life—and the period of the Hereafter, which extends for eternity.\n(Since the connection between our life and our life in the Hereafter is strong, as this life serves as the plowing and sowing, and the Hereafter serves as the harvest and reaping, it was necessary for man to know about his life in the Hereafter what would invite him to prepare for it, and to establish his worldly life in a manner that achieves goodness and virtue for him in the Hereafter. And since the Hereafter is unseen (Ghayb) which those with piercing intellects and sighted hearts cannot penetrate its veils, let alone those beneath them, Allah the Exalted took it upon Himself to inform them about their path in the journey after life, and about their inevitable destiny. He blended the discourse on the Hereafter with the discourse on this life in a way that makes them intertwined, to achieve the reformation of souls and their rectification, in a world where many creatures, human and Jinn, toil to mislead the servants and distance them from the path of righteousness) (1).\nThe importance of this research comes at this time when many people are preoccupied with the world and its enjoyments, forgetting the Last Day. Some writers have begun to cast doubt on the apparent meaning of what the Quran and the Messenger (peace be upon him) reported, or they divert the texts from their apparent meanings, or interpret them allegorically and judge them by their intellects. Indeed, the situation has reached the point where some deny much of what happens in the Hereafter which has been authenticated by reports. Their reliance in this is on rational standards which, if they scrutinized carefully, would reveal their corruption. Had they delved into the sciences of the Hereafter, it would have become clear to them that the Hereafter is not like this world, and that the standards and scales of the Hereafter are different from the situation in this world.",
    "foot_note": "1. See: Umar Al-Ashqar - Al-Yawm Al-Akhir (The Last Day), Al-Qiyamah Al-Sughra (The Minor Resurrection), p. 7, 6th Edition, Dar Al-Nafais, Jordan, 1415 AH.",
    "book_id": "51"
  },
  {
    "serial_number": "97942",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "Furthermore, this research is a call to believe in Allah the Exalted and the Last Day, and a validation of what was reported by the Truthful and Trustworthy one who does not speak from [his own] inclination, {It is not but a revelation revealed} [An-Najm: 4], peace be upon him.\nIt is also a call to prepare for what comes after death, for the appointed time is near, and man does not know his destiny after death, whether to Paradise or to the Fire. Allah says: {But when there comes the greatest Overwhelming Calamity - The Day when man will remember that for which he strove, And Hellfire will be exposed for [all] those who see - So as for he who transgressed And preferred the life of the world, Then indeed, Hellfire will be [his] refuge. But as for he who feared the position of his Lord and prevented the soul from [unlawful] inclination, Then indeed, Paradise will be [his] refuge.} [An-Nazi'at: 34-41].\nWe ask Allah, Glorified and Exalted, to make us among the people of Paradise, and to protect us from the Fire.",
    "foot_note": "None",
    "book_id": "51"
  },
  {
    "serial_number": "97943",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Research Plan:\nThis research includes an introduction, a preamble, four chapters, and a conclusion.\n- As for the Introduction: It includes the importance of this topic and its plan.\n- As for the Preamble: I discussed the stages that humans pass through. These stages are:\n1 - The First Stage: His life as a fetus.\n2 - The Second Stage: His worldly life.\n3 - The Third Stage: His life in the Barzakh (Interval).\n4 - The Fourth Stage: His life in the Hereafter.\n- As for the First Chapter: Faith in the Last Day: It includes three sections:\nSection One: I discussed the importance of belief in the Last Day and that it is one of the fundamentals of religion. Also, the realities included in the belief in the Last Day, and the meaning of Faith (Iman) linguistically and legally (in Sharia).\nSection Two: I discussed the names of the Last Day and mentioned the evidence for them, and the reason for the multitude of names for the Last Day.\nSection Three: I discussed the relationship between belief in the Last Day and belief in the Unseen (Ghayb), clarifying the connection between them, and that belief in the Last Day is belief in the Unseen.\n- As for the Second Chapter: Signs of the Hour, it includes four sections:\nSection One: The Hour and its signs. I explained the categories of the signs of the Hour and that they are divided into two parts:\n1 - Minor Signs of the Hour.\n2 - Major Signs of the Hour.\nAnd that some of the Minor Signs have occurred while others have not yet occurred.\nSection Two: I discussed the Minor Signs of the Hour.\nSection Three: I discussed the Mahdi; because his appearance precedes the appearance of the Major Signs of the Hour. I also clarified the place of his emergence.\nSection Four: I discussed the Major Signs of the Hour.\n- As for the Third Chapter: The Realities Included in Belief in the Last Day: It includes nine sections:\nSection One: The Resurrection (Ba'th). I discussed the meaning of Resurrection, what is intended by it, the evidence for it, the Quran's methods in establishing the Return, and the doubts of those who deny the Resurrection and the refutation against them. I also discussed the Gathering (Hashr) and the differing conditions of people in it, and about the land upon which the servants will be gathered and that it is different from",
    "foot_note": "None",
    "book_id": "51"
  },
  {
    "serial_number": "97944",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "this earth of ours. Then I mentioned something of the horrors of the Day of Resurrection.\nSection Two: The approaching of the sun to the creatures. I discussed the sun approaching the creatures and the condition of people when that happens.\nSection Three: The reckoning of creatures for their deeds. I discussed the reckoning of creation, and that the reckoning of the believer is a reckoning of grace, generosity, and blessing, while the reckoning of the disbeliever is otherwise.\nSection Four: The Scale (Mizan). I discussed its meaning and the belief of Ahlus-Sunnah wal-Jama'ah regarding it, and clarified that what is weighed is the worker, the deeds, and the scrolls, and that the criterion for heaviness and lightness is the deeds.\nSection Five: The distribution of the Books. I discussed the distribution of books, and that some people will take their book with their right hand, who are the believers, and some will take their book with their left hand or from behind their back, who are the disbelievers.\nSection Six: The Cistern (Hawd). I discussed its meaning, the belief of Ahlus-Sunnah wal-Jama'ah regarding it, when it will be, and that it is for the believers only.\nSection Seven: Intercession (Shafa'ah). I discussed intercession and its types, and that some are specific to the Prophet (peace be upon him), and some are general for him and other prophets, truthful ones, martyrs, and the righteous. Then I mentioned the conditions for acceptable intercession.\nSection Eight: The Path (Sirat). I discussed its meaning, the belief of Ahlus-Sunnah wal-Jama'ah regarding it, and how people will pass over it.\nSection Nine: Entering Paradise or the Fire. I discussed the final destination on the Day of Resurrection, and that the destiny is either to Paradise or to the Fire. I clarified that Paradise and Hell are created, existent, and will not perish nor cease to exist.\n- As for the Fourth Chapter: The Effects of Belief in the Last Day on Reforming Society. I discussed the impact of belief in the Last Day and clarified the difference between one who believes in the Last Day and one who does not.\nThe Conclusion: I discussed the most important results I reached.\nIndex of Sources and References.\nIndex of Topics.",
    "foot_note": "None",
    "book_id": "51"
  },
  {
    "serial_number": "97945",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "Preamble: The Stages of Life Humans Pass Through\nMan passes through four stages of life (1):\n1 - The First Stage: His life as a fetus: The fetus in its mother's womb is a living being; it senses, moves, feels pain, grows, gets sick, and becomes healthy... until it completes the specific time decreed for it. Then it is brought out into this life as a weak child as we see. Allah Almighty says: {And We cause to remain in the wombs what We will for a specified term, then We bring you out as a child} [Al-Hajj: 5].\n2 - The Second Stage: His worldly life: Then he moves from the constriction of the womb to this vast life, living a life that has no resemblance to his life in the first stage in his mother's womb. He begins to feed from his mouth, see with his eyes, hear with his ears, grasp with his hands, and walk on his legs. Until he reaches maturity and settles, Allah grants him intellect and gives him knowledge, and he remains in this world until his appointed term... then he dies.\nDeath is the Minor Resurrection; whoever dies, his resurrection has begun, and his time has come. Aisha (may Allah be pleased with her) said: Men from the Bedouins used to come to the Prophet (peace be upon him) and ask him about the Hour. He would look at the youngest of them and say: «If this one lives, decrepitude will not overtake him until your Hour rises upon you» (2). Ibn Kathir (3) said: (The meaning is the passing of their generation and their entry into the world of the Hereafter, for whoever dies has entered into the ruling of the Hereafter. Some people say: \"Whoever dies, his resurrection has begun,\" and this statement is correct in this sense) (4).",
    "foot_note": "1. See: Al-Iman bil-Yawm Al-Akhir wa bil-Qada' wal-Qadar, Ahmed Izz al-Din al-Bayanuni, pp. 7-12, 2nd Edition, Dar Al-Salam, 1405 AH.\n2. Sahih Al-Bukhari, Book of Riqaq (Softening of Hearts), Chapter: The Agonies of Death, (11/361 - with Al-Fath), Dar Al-Fikr, with comments by Sheikh Abdulaziz bin Baz. Sahih Muslim, Book of Tribulations and Signs of the Hour, Chapter: The Proximity of the Hour, (18 - 90 - with Nawawi's explanation), Dar Al-Kitab Al-Arabi, Beirut, 1407 AH.\n3. He is Imad al-Din Abu al-Fida Ismail bin Umar bin Kathir al-Dimashqi al-Shafi'i, the Imam, Hafiz, Muhaddith, and Historian. Among his works: Tafsir al-Quran al-Azim, Al-Bidaya wan-Nihaya, and Ikhtisar Ulum al-Hadith. He died in the year 774 AH. See: Al-Durar al-Kamina: 1/400, and Shadharat al-Dhahab: 6/232.\n4. Ibn Kathir, Al-Nihaya fi al-Fitan wa al-Malahim, p. 13, edited and corrected by: Ahmed Abdul Shafi, 2nd Edition, Dar Al-Kutub Al-Ilmiyyah, Beirut, 1407 AH.",
    "book_id": "51"
  },
  {
    "serial_number": "97946",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "When the appointed time comes and a person's life nears its setting, Allah sends the messengers of death to extract the soul that manages and moves the body. Allah says: {And He is the Subjugator over His servants, and He sends over you guardian-angels until, when death comes to one of you, Our messengers take him, and they do not fail [in their duties]} [Al-An'am: 61]. The angels of death come to the believer in a good and beautiful form, and to the disbeliever and hypocrite in a terrifying form. What happens to the deceased at the moment of death is not something we witness or see, although we see its effects. Our Lord, Blessed and Exalted, has told us about the state of the dying person, saying: {Then why, when the soul reaches the throat (83) And you are at that time looking on (84) And We are nearer to him than you, but you do not see (85)} [Al-Waqi'ah: 83-85]. The subject in the verse refers to the soul when it reaches the throat during the agony of death, while those around him look at what he suffers from the stupor of death, even though they do not see the angels extracting his soul. Allah says: {And He is the Subjugator over His servants, and He sends over you guardian-angels until, when death comes to one of you, Our messengers take him, and they do not fail} [Al-An'am: 61]. And He said in the other verse: {No! When the soul reaches the collar bones (26) And it is said, \"Who will cure [him]?\" (27) And the dying one is certain that it is the [time of] separation (28) And the leg is wound about the leg (29) To your Lord, that Day, will be the procession (30)} [Al-Qiyamah: 26-30]. What reaches the collar bones is the soul. 'Taraqi' is the plural of 'tarqawah', which are the bones between the pit of the throat and the shoulder (1).\nThe Quran has explicitly stated that the angels give glad tidings to the believer of forgiveness from Allah and [His] pleasure, and give tidings to the disbeliever of Allah's wrath and anger. Allah says: {Indeed, those who have said, \"Our Lord is Allah\" and then remained on a right course - the angels will descend upon them, [saying], \"Do not fear and do not grieve but receive good tidings of Paradise, which you were promised. (30) We were your allies in worldly life and [are so] in the Hereafter. And you will have therein whatever your souls desire, and you will have therein whatever you request [or wish] (31) As accommodation from a Forgiving, Merciful.\" (32)} [Fussilat: 30-32]. This descent, as stated by a group of leading exegetes including Mujahid (2), happens at the time of death (3).\nAs for the wicked disbelievers, the angels descend upon them with the opposite of that. Allah says: {And if you could but see when the angels take the souls of those who",
    "foot_note": "1. Tafsir Ibn Kathir (4/481).\n2. He is Mujahid bin Jabr, with a Fatha on the Meem and a Sukun on the Ba, Abu Al-Hajjaj Al-Makhzumi, their freed slave, Al-Makki: A trustworthy Imam in Tafsir and knowledge, from the third generation (tabi'in). He died in the year 101, 102, 103, or 104 AH - and he was eighty-three. Taqreeb al-Tahdhib by Ibn Hajar p. 453, 1st Edition, care of: Adel Murshid, Mu'assasat al-Risalah, Beirut 1416 AH.\n3. Tafsir Ibn Kathir (4/107).",
    "book_id": "51"
  },
  {
    "serial_number": "97947",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "disbelieved... They strike their faces and their backs, [saying], \"Taste the punishment of the Burning Fire. (50) That is for what your hands have put forth [of evil] and because Allah is not ever unjust to His servants.\"} [Al-Anfal: 50-51]. Ibn Kathir (may Allah have mercy on him) said: (Even though this was regarding the Battle of Badr, it is general regarding every disbeliever. Therefore, Allah did not restrict it to the people of Badr, but said: {And if you could but see when [the angels] take the souls of those who disbelieved}...) (1).\nDeath has stupors (agonies) that every human faces at the time of dying, as Allah says: {And the intoxication of death will bring the truth; that is what you were trying to avoid} [Qaf: 19]. Even the Prophet (peace be upon him) suffered from these agonies. During his illness (peace be upon him), there was a vessel of water or a container with water before him. He started dipping his hand into the water and wiping his face with it, saying: «There is no deity but Allah, indeed death has agonies» (2). Aisha (may Allah be pleased with her) said regarding the illness of the Messenger of Allah (peace be upon him): «I have never seen the pain on anyone more severe than it was on the Messenger of Allah (peace be upon him)» (3).\nThen, when the soul is extracted, it is ascended to the heavens. On the authority of Abu Hurairah (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «When the soul of the believer comes out, two angels meet it and ascend with it.» Hammad (4) said: \"He mentioned the goodness of its scent, and mentioned musk.\" He said: \"The people of the heaven say: A good soul has come from the earth, may Allah bless you and the body you used to inhabit. Then he is taken to his Lord, the Mighty and Majestic, then He says: Take him to the end of the term [Sidrat al-Muntaha or Paradise].\" He said: \"And when the disbeliever's soul comes out - Hammad said: He mentioned its stench, and mentioned cursing - the people of the heaven say: A wicked soul from the earth. He said: It is said: Take him to the end of the term [Sijjin or Hellfire]\" (5).\nThese two stages [Fetus and Worldly Life] we see with our own eyes and realize the vast difference between them.",
    "foot_note": "1. Previous Reference (2/332).\n2. Sahih Al-Bukhari, Book of Riqaq, Chapter: The Agonies of Death, (11/361 - with Al-Fath).\n3. Sahih Al-Bukhari, Book of Patients, Chapter: Severity of Illness, (10/110 - with Al-Fath).\n4. He is Hammad bin Zaid bin Dirham Al-Azdi Al-Jahdami Abu Ismail Al-Basri, trustworthy, reliable, jurist. It was said he was blind, perhaps it happened to him later because it was authenticated that he used to write. From the major figures of the eighth generation. He died in the year 179 and he was eighty-one years old. Taqreeb al-Tahdhib p. 117.\n5. Sahih Muslim, Book of Paradise, Chapter: Showing the Deceased His Seat and Proving the Punishment of the Grave and Seeking Refuge from It (17/205).",
    "book_id": "51"
  },
  {
    "serial_number": "97948",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "3 - The Third Stage: His life in the Barzakh (Interval):\nWhen he dies, he moves from this life to a Barzakh life, where the soul separates from the body, and he is either blessed or punished. Allah says: {And the people of Pharaoh were enveloped by the worst of punishment - (45) The Fire, they are exposed to it morning and evening. And the Day the Hour appears [it will be said], \"Make the people of Pharaoh enter the severest punishment.\"} [Ghafir: 45-46]. The Prophet (peace be upon him) passed by two graves and said: «They are being punished, and they are not being punished for something major [difficult to avoid]: as for one of them, he used to go about spreading malicious gossip (namimah), and as for the other, he used not to protect himself from his urine» (1).\nThe Barzakh is the first world of the Hereafter. Barzakh in the language of the Arabs is the barrier between two things. Allah says: {And He made between them a barrier and a prohibiting partition} [Al-Furqan: 53], meaning a barrier. In the Sharia: It is the abode that follows death until the Resurrection. Allah says: {And behind them is a barrier until the Day they are resurrected} [Al-Mu'minun: 100]. Mujahid said: It is what is between death and resurrection (2).\n(The first thing that happens after death is the trial of the grave, for people are tested - meaning examined - in their graves. There is no human who dies, whether buried in the earth, thrown into the sea, eaten by predators, or scattered by the winds, except that he undergoes this trial. He is asked about three things: Who is your Lord? What is your religion? Who is your Prophet? As for the believer, he says: My Lord is Allah, my religion is Islam, and my Prophet is Muhammad. Then a caller calls from the sky: 'My servant has spoken the truth.' Then his grave is expanded for him as far as the eye can see, and it is furnished with furnishings from Paradise, and a door is opened for him to Paradise, so its breeze and bliss come to him. As for the disbeliever or the hypocrite, when asked: Who is your Lord? What is your religion? Who is your Prophet? He says: Hah, Hah, I do not know, I heard people saying something so I said it. Then he is struck with an iron hammer, and he screams a scream which everything hears except the two weight-bearing races - Jinn and Humans - and if they heard it, they would fall unconscious (3)) (4).\nIncluded in the belief in the Last Day is belief in everything the Prophet (peace be upon him) informed about regarding what happens after death,",
    "foot_note": "1. Sahih Al-Bukhari, Book of Funerals, Chapter: Punishment of the Grave due to Backbiting and Gossip, (3/242 - with Al-Fath).\n2. Al-Tadhkirah by Al-Qurtubi, p. 200, 1st Edition, Dar Al-Rayyan for Heritage, Cairo, 1407 AH.\n3. Sahih Al-Bukhari, Book of Funerals, Chapter: What came regarding the punishment of the Grave, Fath Al-Bari (3/206).\n4. Ibn Uthaymeen, Arkan Al-Iman (Pillars of Faith), 38-40, 1st Edition, Dar Al-Muslim, Riyadh, 1413 AH. Sahih Al-Bukhari, Book of Funerals, Chapter: The deceased hears the sound of footsteps, Fath Al-Bari (3/231).",
    "book_id": "51"
  },
  {
    "serial_number": "97949",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "so they believe in the trial of the grave, its punishment, and its bliss (1).\nThe commentator of At-Tahawiyyah says: (The reports from the Messenger of Allah (peace be upon him) have reached the level of Tawatur (mass transmission) regarding the confirmation of the punishment of the grave and its bliss for those who deserve it, and the questioning of the two angels. Thus, it is obligatory to believe in the affirmation of that and to have faith in it, and we do not speak about its modality (how it happens); for the intellect has no way to understand its modality, because it has no familiarity with that abode. The Sharia does not bring what intellects deem impossible, but the Sharia may bring what baffles intellects. For the return of the soul to the body is not in the manner familiar in this world; rather, it is returned to it in a manner different from the familiar return in this world) (2).\nAllah says: {Allah rewards those who fear Him - (31) The ones whom the angels take in death, [being] good and pure; [the angels] will say, \"Peace be upon you. Enter Paradise for what you used to do.\"} [An-Nahl: 31-32]. The indication in this verse regarding the bliss of the grave is His saying: {The ones whom the angels take in death} at the time of their death: {Peace be upon you. Enter Paradise}, and even if they have not entered the Paradise whose width is the heavens and the earth, they have entered the grave which contains bliss from Paradise.\n(Indications in the Quran have appeared proving the punishment of the grave. Al-Bukhari (3) titled a chapter in the Book of Funerals for the punishment of the grave, saying: 'Chapter: What came regarding the punishment of the grave,' and he cited in the chapter title the saying of Allah: {And if you could but see when the wrongdoers are in the overwhelming pangs of death while the angels extend their hands, [saying], \"Discharge your souls! Today you will be awarded the punishment of [extreme] humiliation for what you used to say against Allah other than the truth and [that] you were, toward His verses, being arrogant.\"} [Al-An'am: 93], and His saying: {We will punish them twice in this world; then they will be returned to a great punishment.} [At-Tawbah: 101], and His saying: {And the people of Pharaoh were enveloped by the worst of punishment - (45) The Fire, they are exposed to it morning and evening. And the Day the Hour appears [it will be said], \"Make the people of Pharaoh enter the severest punishment.\"} [Ghafir: 45-46].",
    "foot_note": "1. Ibn Taymiyyah, Al-Aqidah Al-Wasitiyyah, p. 142, Explanation by Saleh Al-Fawzan, 6th Edition, Maktabat Al-Ma'arif, Riyadh, 1413 AH.\n2. Sharh Al-Aqidah Al-Tahawiyyah by Ibn Abi Al-Izz (2/578), edited by Al-Turki and Al-Arna'ut, 1st Edition, Mu'assasat Al-Risalah, Beirut, 1408 AH.\n3. Muhammad bin Ismail bin Ibrahim bin Al-Mughirah Al-Ju'fi, Abu Abdullah Al-Bukhari, the mountain of memorization and the Imam of the world in the jurisprudence of Hadith, from the eleventh generation. He died in the year fifty-six in Shawwal at the age of 62. Taqreeb al-Tahdhib: 404.",
    "book_id": "51"
  },
  {
    "serial_number": "97950",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "On the authority of Aisha (may Allah be pleased with her): A Jewish woman entered upon her and mentioned the punishment of the grave, saying to her: 'May Allah protect you from the punishment of the grave.' So Aisha asked the Messenger of Allah (peace be upon him) about the punishment of the grave, and he said: «Yes, the punishment of the grave is true.» Aisha (may Allah be pleased with her) said: \"I never saw the Messenger of Allah (peace be upon him) pray a prayer after that except that he sought refuge from the punishment of the grave\" (1).\nAnd on the authority of Abdullah bin Umar (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «When one of you dies, his seat is shown to him morning and evening: if he is from the people of Paradise, then [he sees his seat] among the people of Paradise, and if he is from the people of the Fire, then [he sees his seat] among the people of the Fire. It is said: This is your seat until Allah resurrects you on the Day of Resurrection» (2).\nThe punishment in the grave is primarily upon the soul, and it may connect to the body. However, being upon the soul does not mean the body receives nothing of it; rather, it must receive something of this punishment or bliss, even if indirectly. Know that the punishment and bliss in the grave are the opposite of the punishment or bliss in this world. For the punishment or bliss in this world is upon the body, and the soul is affected by it, whereas in the Barzakh, the bliss or punishment is upon the soul, and the body is affected by it (3).\nSheikh al-Islam Ibn Taymiyyah (4) says: \"The punishment and bliss are upon the soul and the body together by the agreement of Ahlus-Sunnah wal-Jama'ah. The soul experiences bliss and punishment separately from the body, and it experiences punishment while connected to the body, and the body is connected to it. So the bliss and punishment are upon both of them in this state combined, just as it is for the soul separate from the body\" (5).\n4 - The Fourth Stage: His life in the Hereafter:\nThen the Hour begins, people are resurrected, gathered, and held accountable for their deeds: {And among them will be the wretched and the happy. (105) As for those who were wretched, they will be in the Fire. For them therein is [violent] exhaling and inhaling. (106) [They will be] abiding therein as long as the heavens and the earth endure, except what your Lord should will. Indeed, your Lord is an effecter of what He intends. (107) And as for those who were happy, they will be in Paradise, abiding therein as long as the heavens and the earth endure, except what your Lord should will - a gift without interruption. (108)} [Hud: 105-108].\nAllah the Exalted, when informing us of what awaits us in the last two stages, paved the way for belief in them through the first two stages which we see with our own eyes, namely: our life as fetuses in the wombs of our mothers, and this life of ours in the world. So the Great, Capable Creator who",
    "foot_note": "1. Sahih Al-Bukhari, Book of Funerals, Chapter: What came regarding the punishment of the Grave, Fath Al-Bari (3/231).\n2. Sahih Al-Bukhari, Book of Funerals, Chapter: The deceased is shown his seat morning and evening (1/343 - with Al-Fath).\n3. Arkan Al-Iman, pp. 42-43. Al-Qiyamah Al-Sughra, p. 49.\n4. He is Sheikh al-Islam Taqi al-Din Ahmad bin Abd al-Halim bin Abd al-Salam bin Taymiyyah al-Harrani al-Dimashqi, the Imam, the World, the Scholar, the Jurist, the Role Model. He has great works, including: Minhaj as-Sunnah an-Nabawiyyah, Dar' Ta'arud al-Aql wan-Naql, Al-Jawab as-Sahih li-man Baddala Din al-Masih, At-Tadmuriyyah, Al-Wasitiyyah, and others. He died in the year 728 AH. See: Dhayl Tabaqat al-Hanabilah by Ibn Rajab: 2/387, Al-Bidaya wan-Nihaya: 14/141, Shadharat: 6/80, and Al-Jami' li-Sirat Sheikh al-Islam Ibn Taymiyyah Khilal Sab'at Qurun, collected by Muhammad Uzair Shams and Ali Al-Imran.\n5. Majmu' Fatawa Sheikh al-Islam Ibn Taymiyyah, (4/282), compiled by: Abdur-Rahman bin Qasim, Maktabat Ibn Taymiyyah, Egypt.",
    "book_id": "51"
  },
  {
    "serial_number": "97951",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "made this amazing disparity between these two stages of life is capable of making the contrast greater and the disparity more immense between our current life and our life in the Barzakh, and then between that and our life in the Hereafter, the abode of eternal bliss or painful punishment.\nSo it should not be difficult for us to believe when the Prophet (peace be upon him) informs us that the people of Paradise enjoy bliss therein, eating and drinking, yet they do not defecate, urinate, or blow their noses, and that they are eternal in this bliss; their youth does not fade nor do their clothes wear out... and that the people of the Fire are punished therein; every time their skins are roasted through, the Powerful, the Capable One replaces them with other skins so they may taste the punishment, abiding therein eternally... and so on.\nWe will discuss - Allah willing - the Hereafter and some of the terrors within it, up until the entry of the people of Paradise into Paradise, and the entry of the people of the Fire into the Fire.",
    "foot_note": "None",
    "book_id": "51"
  },
  {
    "serial_number": "97952",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "Chapter One\nFaith in the Last Day\n\nSection One: The Importance of Faith in the Last Day:\nBelief in the Day of Resurrection is one of the fundamentals without which faith is not complete. {Righteousness is not that you turn your faces toward the east or the west, but [true] righteousness is [in] one who believes in Allah, the Last Day, the angels, the Book, and the prophets} [Al-Baqarah: 177].\nThe Quran has presented various types of sophisticated rhetorical styles to confirm its occurrence in the souls of the servants. Allah says: {He arranges [each] matter; He details the signs that you may, of the meeting with your Lord, be certain.} [Ar-Ra'd: 2].\nIn some places, the discussion about it is a simple statement. Allah says: {Allah begins creation; then He will repeat it; then to Him you will be returned.} [Ar-Rum: 11], and He says: {And the Day they are returned to Him, He will inform them of what they did.} [An-Nur: 64].\nSometimes He confirms its occurrence with \"Inna\" (Indeed), as in His saying: {Indeed, the Hour is coming.} [Taha: 15], and sometimes with \"Inna\" and the \"Lam\" (Indeed... surely), Allah says: {And indeed, the Hour is coming, so forgive with gracious forgiveness.} [Al-Hijr: 85], and He says: {Indeed, the term of Allah is coming. And He is the Hearing, the Knowing.} [Al-Ankabut: 5].\nIn some places, He negates doubt and uncertainty regarding its occurrence. Allah says: {Indeed, the Hour is coming - no doubt about it - but most of the people do not believe.} [Ghafir: 59].\nIn some verses, Allah swears that it is coming and real, sometimes by Himself, Allah says: {Allah - there is no deity except Him. He will surely assemble you for the Day of Resurrection.} [An-Nisa: 87], and sometimes by His great creations, Allah says: {By those [winds] scattering [dust] dispersing (1) And those [clouds] carrying a load [of water] (2) And those [ships] sailing with ease (3) And those [angels] apportioning [each] matter (4) Indeed, what you are promised is true. (5) And indeed, the Recompense is to occur. (6)} [Adh-Dhariyat: 1-6].\nIn some places, He commands His Messenger (peace be upon him) in the context of arguments and disputes to swear by his Lord, confirming its occurrence: {But those who disbelieve say, \"The Hour will not come to us.\" Say, \"Yes, by my Lord, it will surely come to you.\"} [Saba: 3].\nAnd in some verses, He informs that it is the truth: {Indeed, the promise of Allah is truth, so let not the worldly life deceive you}",
    "foot_note": "None",
    "book_id": "51"
  },
  {
    "serial_number": "97953",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "[Fatir: 5]. Whoever traces the method of the Quran in confirming the news of it will find many types (1).\nFaith (Iman) is a matter of great importance; as it is the foundation upon which happiness in this world and the Hereafter is built. It is one of the greatest levels of religion. When Gabriel came to the Prophet (peace be upon him) in the presence of his companions, he asked him about Islam, Iman, and Ihsan.\n«He said: O Muhammad, tell me about Islam. He said: Islam is to testify that there is no deity but Allah and that Muhammad is the Messenger of Allah, to establish prayer, to pay Zakat, to fast Ramadan, and to perform Hajj to the House if you are able to find a way.» - Thus he interpreted Islam as performing these five pillars: The two testimonies, establishing prayer, paying Zakat, fasting Ramadan, and Hajj to the House.\n«He said: You have spoken the truth. Tell me about Iman. He said: Iman is to believe in Allah, His angels, His books, His messengers, and the Last Day, and to believe in Divine Decree (Qadar), its good and its bad.» - Thus he interpreted Iman as believing in these six pillars: Belief in Allah, His angels, His books, His messengers, the Last Day, and Divine Decree, its good and its bad.\n«He said: Tell me about Ihsan. He said: Ihsan is to worship Allah as if you see Him, and if you do not see Him, then indeed He sees you» (2). Thus he clarified that Ihsan is one pillar, which is to worship Allah as if you see Him, and if you do not see Him, then indeed He sees you.\nThese are the three levels of religion: Islam, then Iman, then Ihsan, and every level has pillars.\nA Pillar (Rukn) in the language: with a Damma (on the Ra), is the strongest side and a great matter (3). (The Rukn of a thing: is its side upon which it stands. The Rukn of a house is its side upon which it stands. So Iman stands upon these six pillars; if one of them falls, a person is not a believer in it because he has lost a pillar of the pillars of Iman.",
    "foot_note": "1. See: Al-Yawm Al-Akhir – Al-Qiyamah Al-Sughra, pp. 113-114.\n2. Sahih Al-Bukhari, Book of Iman, Chapter: Gabriel's asking the Prophet (peace be upon him) about Iman, Islam, and Ihsan (1/114 - with Al-Fath), and Sahih Muslim, Book of Iman, Chapter: Clarification of Iman, Islam, and Ihsan (1/150 - with Nawawi's explanation).\n3. Al-Fairuzabadi, Al-Qamus Al-Muhit, (p. 1082), edited and documented by: Yusuf Al-Sheikh Muhammad Al-Biqa'i, Dar Al-Fikr, Beirut 1415 AH.",
    "book_id": "51"
  },
  {
    "serial_number": "97954",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "For Iman does not stand except on its pillars, just as a building does not stand except on its pillars. These six pillars are mentioned in the Holy Quran; sometimes they are mentioned all together and sometimes some of them are mentioned. Allah says: {But [true] righteousness is [in] one who believes in Allah, the Last Day, the angels, the Book, and the prophets} [Al-Baqarah: 177]. He - Mighty and Majestic - mentioned in this verse five pillars of the pillars of Iman. And He said: {The Messenger has believed in what was revealed to him from his Lord, and [so have] the believers. All of them have believed in Allah and His angels and His books and His messengers} [Al-Baqarah: 285], mentioning four of them. Sometimes He mentions two of them: Belief in Allah and the Last Day. He, Glorified is His affair, said: {Indeed, those who believed and those who were Jews or Christians or Sabeans [before Prophet Muhammad] - those [among them] who believed in Allah and the Last Day} [Al-Baqarah: 62]. As for belief in Divine Decree (Qadar), He mentioned it in His saying: {Indeed, all things We created with predestination.} [Al-Qamar: 49], and in His saying: {And He created everything and determined it with [precise] determination.} [Al-Furqan: 2] (1).\nAmong the evidences for the obligation of belief in the Last Day is His saying: {Then did you think that We created you uselessly and that to Us you would not be returned?} [Al-Mu'minun: 115]. And He said: {Then they are returned to Allah, their true Lord. Unquestionably, His is the judgement, and He is the swiftest of accountants.} [Al-An'am: 62]. And He said: {How can you disbelieve in Allah when you were lifeless and He brought you to life; then He will cause you to die, then He will bring you [back] to life, and then to Him you will be returned.} [Al-Baqarah: 28].\nBelief in the Last Day includes a set of realities mentioned in the Book and the Sunnah, so belief in all of them is required. These include: the trial of the grave, its punishment and bliss, the Hour and its signs, the Resurrection, the Gathering, the Reckoning and what follows it of reward and punishment, the Path (Sirat), Paradise, and the Fire.\nSheikh al-Islam Ibn Taymiyyah said: (And from the belief in the Last Day is the belief in everything the Prophet (peace be upon him) informed about regarding what happens after death...) (2). (This is a comprehensive rule that includes belief in the texts reported regarding the state of dying, in the grave, the Resurrection, Paradise, and Hell, and all the details contained therein...) (3).",
    "foot_note": "1. Saleh Al-Fawzan, Al-Iman bil-Mala'ikah wa Atharuhu fi Hayat Al-Ummah, p. 3, 1st Edition, Dar Al-Asimah, Riyadh, 1413 AH.\n2. Al-Aqidah Al-Wasitiyyah, p. 142, Explanation by Sheikh Saleh Al-Fawzan.\n3. Ibn Sa'di, Al-Tanbihat Al-Latifah ala ma Ihtawat Al-Aqidah Al-Wasitiyyah min Al-Mabahith Al-Munifah, p. 69, 1st Edition, edited and referenced by: Ali Hasan Abdul Hamid, Dar Ibn Al-Qayyim, 1409 AH.",
    "book_id": "51"
  },
  {
    "serial_number": "97955",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "Before discussing these points, we present an introduction clarifying some matters related to belief in the Last Day, including: the definition of Iman linguistically and legally, the definition of the Last Day, the reason for naming it so, its names, the duration of this Day, and the relationship between belief in the Last Day and belief in the Unseen.\nIman in the language: is ratification/belief (Tasdiq). In Lisan Al-Arab: Iman means Tasdiq, its opposite is denial (Takdhib). It is said: A people believed in him, and a people denied him (1).\nAl-Raghib Al-Isfahani (2) (may Allah have mercy on him) said: \"The origin of safety (Amn) is tranquility of the soul and the removal of fear\" (3).\nIman is the verbal noun of 'Amana' (to believe), 'yu'minu' (he believes), 'imanan' (believing), so he is 'mu'min' (a believer) (4). The origin of 'Amana' is 'A'mana' with two Hamzas, the second being softened (5). It comes from 'Amn' (security/safety) which is the opposite of fear (6).\nSheikh al-Islam Ibn Taymiyyah (may Allah have mercy on him) said in his definition of Iman: \"...for its derivation is from 'Amn' which is affirmation and tranquility, and that is only achieved if ratification and submission are established in the heart\" (7).\nSheikh Ibn Uthaymeen (8) said: (Iman in the language is acknowledgement of something out of belief in it. Therefore, Iman implies a meaning beyond mere ratification, which is acknowledgement and confession necessitating acceptance of news and submission to rulings) (9).\nIn the Sharia: (It is speech and action; speech of the heart and the tongue, and action of the heart, the tongue, and the limbs; it increases with obedience and decreases with disobedience) (10).\nThe Last Day is the Day of Resurrection when people are raised for reckoning and recompense. It was named so because there is no day after it,",
    "foot_note": "1. Ibn Manzur, Lisan Al-Arab, 1/140, Dar Al-Ma'arif, Cairo.\n2. Abu Al-Qasim Al-Husayn bin Mufaddal Al-Isfahani or Al-Asbahani, known as Al-Raghib. He lived in Baghdad and became famous there. Among his works: Mufradat Alfaz Al-Quran, and others. He died in the year 502 AH. See: Al-Wafi bil-Wafayat: 13/29, and Shadharat al-Dhahab: 4/34.\n3. Al-Mufradat fi Gharib Al-Quran: 90.\n4. Tahdhib Al-Lughah: 15/368.\n5. Al-Sihah: 5/2071.\n6. Al-Sihah: 5/2071, and Al-Qamus Al-Muhit: 1176.\n7. Al-Sarim Al-Maslul: 519, and see: Al-Fatawa: 7/289.\n8. He is Abu Abdullah Muhammad bin Saleh bin Muhammad bin Uthaymeen Al-Wahibi Al-Tamimi, born in Unaizah in 1347 AH. Imam and Khatib of the Great Mosque in Unaizah and lecturer at the College of Sharia in Qassim and member of the Council of Senior Scholars. He has many works. He died in the year 1421. See his biography in: Al-Jami' li Hayat Al-Allamah Muhammad bin Saleh Al-Uthaymeen by Walid Al-Hassan, and Introduction to Sharh Al-Usul Al-Thalathah by Sheikh Ibn Uthaymeen, prepared by: Fahd Al-Sulaiman, 1st Edition, Dar Al-Thuraya, Riyadh, 1414 AH. And Introduction to Sharh Al-Aqidah Al-Wasitiyyah by Ibn Uthaymeen, 2nd Edition, Dar Ibn Al-Jawzi, Dammam, 1415 AH.\n9. Ibn Uthaymeen, Sharh Al-Aqidah Al-Wasitiyyah, p. 1/54, 2nd Edition, Dar Ibn Al-Jawzi, Dammam, 1415 AH.\n10. Al-Aqidah Al-Wasitiyyah, with explanation by Al-Fawzan, p. 178.",
    "book_id": "51"
  },
  {
    "serial_number": "97956",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "as the people of Paradise settle in their dwellings and the people of the Fire in theirs (1), and because it comes after the world (2).\nThe duration of this Day in which people are held accountable is fifty thousand years, then their path is seen either to Paradise or to Hellfire. This is indicated by His saying: {The angels and the Spirit will ascend to Him during a Day the extent of which is fifty thousand years.} [Al-Ma'arij: 4].\nOn the authority of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «There is no owner of gold or silver who does not pay its due right except that when it is the Day of Resurrection, plates of fire are beaten out for him and heated in the fire of Hell, and his side, his forehead and his back are branded with them. Every time they cool down, they are returned to him, in a Day the extent of which is fifty thousand years, until judgement is passed among the servants, and he sees his path either to Paradise or to the Fire» (3)... The Hadith.\nIbn Abbas - may Allah be pleased with them both - said regarding: {to Him during a Day the extent of which is fifty thousand years}, he said: The Day of Resurrection. Its chain of narration is authentic (4).",
    "foot_note": "1. Ibn Uthaymeen, Sharh Usul Al-Iman, p. 40, 1st Edition, Dar Al-Watan, Riyadh, 1410 AH.\n2. Sharh Al-Aqidah Al-Wasitiyyah, Al-Fawzan, p. 142.\n3. Sahih Muslim, Book of Zakat, Chapter: The Sin of the Withholder of Zakat (7/67 - with Nawawi's explanation).\n4. Ibn Kathir, Tafsir Al-Quran Al-Azim (4/447).",
    "book_id": "51"
  },
  {
    "serial_number": "97957",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "Section Two: Names of the Last Day (1)\nAllah named that Day in which destruction befalls this world, followed by resurrection and gathering for recompense and account, with many names. A group of scholars paid attention to mentioning these names, and some scholars counted them reaching eighty names as Ibn Hajar (may Allah have mercy on him) says (2).\nThe most famous of these names are:\n1 - The Day of Resurrection (Yawm Al-Qiyamah): This name appears in seventy verses of the Book of Allah. Allah says: {Allah - there is no deity except Him. He will surely assemble you for the Day of Resurrection, about which there is no doubt.} [An-Nisa: 87].\n2 - The Last Day (Al-Yawm Al-Akhir): Allah says: {But [true] righteousness is [in] one who believes in Allah, the Last Day, the angels, the Book, and the prophets} [Al-Baqarah: 177]. Sometimes He names it 'The Hereafter' (Al-Akhirah) or 'The Home of the Hereafter' (Ad-Dar Al-Akhirah). Allah says: {So let those fight in the cause of Allah who sell the life of this world for the Hereafter} [An-Nisa: 74], and He says: {That home of the Hereafter We assign to those who do not desire exaltedness upon the earth or corruption. And the [best] outcome is for the righteous.} [Al-Qasas: 83].\n3 - The Hour (As-Sa'ah): Allah says: {O mankind, fear your Lord. Indeed, the convulsion of the [final] Hour is a terrible thing.} [Al-Hajj: 1].\n4 - The Day of Resurrection (Yawm Al-Ba'th): Allah says: {O People, if you should be in doubt about the Resurrection, then [consider that] indeed, We created you from dust} [Al-Hajj: 5]... The Verse.\n5 - The Day of Emergence (Yawm Al-Khuruj): Allah says: {The Day they will hear the blast [of the Horn] in truth. That is the Day of Emergence.}",
    "foot_note": "1. See: Al-Yawm Al-Akhir, Al-Qiyamah Al-Sughra, pp. 20-30.\n2. He is Shihab al-Din Abu al-Fadl Ahmad bin Ali bin Muhammad bin Muhammad bin Ali bin Hajar Al-Kinani Al-Asqalani Al-Shafi'i. He was born in the year 773 AH. He began writing at the age of twenty-three and continued doing so until just before his death. Among his most important books: Fath Al-Bari Sharh Sahih Al-Bukhari, Tahdhib Al-Tahdhib, Lisan Al-Mizan, and others. He died in the year 852. See his biography in: Al-Daw' Al-Lami': 2/36, Shadharat al-Dhahab: 7/270, Al-Badr Al-Tali': 1/87, and Introduction to Al-Nukat ala Nuzhat Al-Nazar fi Tawdih Nukhbat Al-Fikr by Ibn Hajar, by Ali Hasan Abdul Hamid, pp. 9-14, 1st Edition, Dar Ibn Al-Jawzi, Dammam, 1413 AH.",
    "book_id": "51"
  },
  {
    "serial_number": "97958",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "[Qaf: 42].\n6 - The Striking Calamity (Al-Qari'ah): Allah says: {The Striking Calamity (1) What is the Striking Calamity? (2) And what can make you know what is the Striking Calamity?} [Al-Qari'ah: 1-3].\n7 - The Day of Judgement/Separation (Yawm Al-Fasl): Allah says: {This is the Day of Judgement which you used to deny.} [As-Saffat: 21].\n8 - The Day of Recompense (Yawm Ad-Din): Allah says: {And they will say, \"O woe to us! This is the Day of Recompense.\"} [As-Saffat: 20].\n9 - The Deafening Blast (As-Sakhah): Allah says: {But when there comes the Deafening Blast} [Abasa: 33].\n10 - The Greatest Overwhelming Calamity (At-Tammah Al-Kubra): Allah says: {But when there comes the greatest Overwhelming Calamity} [An-Nazi'at: 34].\n11 - The Day of Regret (Yawm Al-Hasrah): Allah says: {And warn them, [O Muhammad], of the Day of Regret, when the matter will be concluded; and [yet], they are in [a state of] heedlessness, and they do not believe.} [Maryam: 39].\n12 - The Overwhelming (Al-Ghashiyah): Allah says: {Has there come to you the report of the Overwhelming [event]?} [Al-Ghashiyah: 1].\n13 - The Day of Eternity (Yawm Al-Khulud): Allah says: {Enter it in peace. This is the Day of Eternity.} [Qaf: 34].\n14 - The Day of Account (Yawm Al-Hisab): Allah says: {Indeed, those who mislead from the way of Allah will have a severe punishment for having forgotten the Day of Account.} [Sad: 26].\n15 - The Occurrence (Al-Waqi'ah): Allah says: {When the Occurrence occurs} [Al-Waqi'ah: 1].\n16 - The Day of Threat (Yawm Al-Wa'id): Allah says: {And the Horn will be blown. That is the Day of [carrying out] the Threat.} [Qaf: 20].\n17 - The Approaching Day (Yawm Al-Azifah): Allah says: {And warn them of the Approaching Day, when hearts are at the throats, filled [with distress].} [Ghafir: 18].\n18 - The Day of Assembly (Yawm Al-Jam'): Allah says: {And thus We have revealed to you an Arabic Qur'an that you may warn the Mother of Cities [Makkah] and those around it and warn of the Day of Assembly, about which there is no doubt.} [Ash-Shura: 7].\n19 - The Inevitable Reality (Al-Haqqah): Allah says: {The Inevitable Reality (1) What is the Inevitable Reality?} [Al-Haqqah: 1-2].",
    "foot_note": "None",
    "book_id": "51"
  },
  {
    "serial_number": "97959",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "20 - The Day of Meeting (Yawm At-Talaq): Allah says: {[He is] the Exalted above [all] degrees, Owner of the Throne; He places the inspiration of His command upon whom He wills of His servants to warn of the Day of Meeting.} [Ghafir: 15].\n21 - The Day of Calling (Yawm At-Tanad): Allah says, informing about the advice of the believer of Pharaoh's family to his people: {And O my people, indeed I fear for you the Day of Calling.} [Ghafir: 32].\n22 - The Day of Mutual Deprivation (Yawm At-Taghabun): Allah says: {The Day He will assemble you for the Day of Assembly - that is the Day of Mutual Deprivation.} [At-Taghabun: 9].\nThese are the most famous names of the Last Day. Al-Qurtubi (1) says regarding the secret behind the multitude of names for the Last Day: (Whenever a matter is of great importance, its attributes multiply and its names increase. This is common in the speech of the Arabs. Do you not see that the sword, when its position became great to them and its benefit and location were emphasized, they gathered five hundred names for it, and there are other examples. So when the Resurrection became great in its matter and its terrors multiplied, Allah Almighty named it in His Book with numerous names and described it with many descriptions) (2).",
    "foot_note": "1. He is Abu Abdullah Muhammad bin Ahmad bin Abi Bakr bin Farah Al-Ansari Al-Khazraji Al-Maliki, the author of the famous Tafsir which indicates his leadership, extensive knowledge, abundant virtue, and mastery of various arts. He died in the year 671 AH. See his biography in: Al-Dibaj Al-Mudhahhab li Ma'rifat A'yan Ulama' Al-Madhhab 2/243, Shadharat al-Dhahab: 7/584, and Introduction to Al-Jami' li Ahkam Al-Quran, correction by: Ahmed Abdul Alim, p. 4, 2nd Edition.\n2. Al-Tadhkirah (243-244).",
    "book_id": "51"
  },
  {
    "serial_number": "97960",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "Section Three: The Relationship Between Belief in the Last Day and Belief in the Unseen (Ghayb)\nBelief in the Last Day is belief in the Unseen; because no one has witnessed it personally. Rather, Allah Almighty informed us about it through His noble messengers, so its path is the authentic transmission from what came in the Book and the Sunnah.\nHowever, Allah, who informed us about the Last Day, made belief in it obligatory upon us, and made it a pillar of faith, has deposited in human nature the ability to believe in the Unseen and distinguished humans with this matter among the things He distinguished, honored, and favored them with.\nAnimals live within the limits of what the senses perceive only, and their world is confined to that scope. But Allah Almighty honored man and did not confine him within the limits of what his senses perceive only; rather, He expanded his horizons and broadened them, granting him that characteristic: the ability to believe in what the senses do not perceive. Thus, his soul became more spacious and deeper than the animal, and his horizons became wider and higher.\nAllah Almighty honored man and intended elevation for him, making belief in the Unseen the most prominent attribute of the righteous. Allah says: {Alif, Lam, Meem. (1) This is the Book about which there is no doubt, a guidance for those conscious of Allah - (2) Who believe in the unseen, establish prayer, and spend out of what We have provided for them (3)} [Al-Baqarah: 1-3].\nBelief in the Last Day is based on belief in the Unseen, but it is not blind faith without evidence. For among the attributes of the \"Servants of the Most Merciful\" is: {And those who, when reminded of the verses of their Lord, do not fall upon them deaf and blind.} [Al-Furqan: 73]. Rather, it is faith in the truth indicated by evidences even if the senses do not perceive it.\nYes, belief in the Unseen is necessary for belief in Allah and the Last Day, and for that reason, the Quran highlighted it at the forefront of the attributes of the believers. Allah Almighty described the believers in many places in the Quran as those who believe in the Unseen, making this attribute a fundamental rule of faith. Allah says: {Alif, Lam, Meem. (1) This is the Book about which there is no doubt, a guidance for those conscious of Allah - (2) Who believe in the unseen, establish prayer, and spend out of what We have provided for them, (3) And who believe in what has been revealed to you, [O Muhammad], and what was revealed before you, and of the Hereafter they are certain [in faith]. (4) Those are on [right] guidance from their Lord, and it is those who are the successful. (5)} [Al-Baqarah: 1-5].\nBelief in the Hereafter is also belief in the Unseen, for the Hour, relative to humans, is Unseen, and what happens therein of resurrection, reckoning, reward, and punishment is all Unseen which the believer believes in confirming the report of Allah, Glory be to Him.\n(Many matters of religion, its doctrines, and its rulings are essentially belief in the Unseen. Allah Almighty, relative to us, is Unseen. The Barzakh life and the Hereafter life with its introductions and existences are all Unseen, from the establishment of the Hour to the Resurrection and Gathering, to the Reckoning, the Scale, the writing of human deeds, the Path, Paradise, and Hell... etc. All of this is Unseen that must be believed in. No sooner does a human return to a moment of intellectual contemplation and awakening of conscience than he finds himself swimming with his imagination in the world of the Unseen from which he emerged or in the world of the Unseen that surrounds the sides of his soul and the universe around him, and the Unseen that awaits him and to which he is destined. So the Unseen surrounds him from every side: in the beginning, in the destiny, and in what lies between the beginning and the destiny) (1).",
    "foot_note": "1. Uthman Jumu'ah Dumayriyyah, Alam Al-Ghayb wa Al-Shahadah fi Al-Tasawwur Al-Islami (The World of the Unseen and the Witnessed in Islamic Concept), 1st Edition, Maktabat Al-Sawadi, Jeddah, 1408 AH.",
    "book_id": "51"
  },
  {
    "serial_number": "97961",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "Chapter Two: Signs of the Hour\n\nSection One: The Hour and Its Signs\nOne of the requirements of belief in the Last Day is belief in the Hour, which is the hour when the worldly life ends with all its conditions and the Resurrection begins with all its terrors.\n(Since among the doctrines that must be believed in is the Last Day and what it contains of reward and punishment, and since human vision may not extend beyond this life and its enjoyments, thus forgetting the Last Day and not working for it, Allah placed signs before the Hour indicating its realization and that it will inevitably occur, so that people do not harbor the slightest doubt about it nor let anything distract them from it. It is known that if the Truthful and Trustworthy one (peace be upon him) mentioned something of its signs and people saw the occurrence of that thing, they would know with certainty that the Hour is coming without doubt, so they would work for it, prepare for that Day, and provision themselves with righteous deeds before it is too late and the limited term expires. Allah says: {Lest a soul should say, \"Oh [how great is] my regret over what I neglected in regard to Allah and that I was among the mockers.\" (56) Or [lest] it say, \"If only Allah had guided me, I would have been among the righteous.\" (57) Or [lest] it say when it sees the punishment, \"If only I had another turn so I could be among the doers of good.\" (58)} [Az-Zumar: 56-58]) (1).\n\nDivisions of the Signs of the Hour:\nThe signs of the Hour are divided into two parts (2):\n1 - Minor Signs: These precede the Hour by long periods and are of the customary type, such as the removal of knowledge, the prevalence of ignorance, drinking alcohol, competing in constructing tall buildings... and similar things. Some of them may appear accompanying the Major Signs or after them.\n2 - Major Signs: These are the great events that appear near the establishment of the Hour and are unusual in occurrence, such as the appearance of the Dajjal (Antichrist), the descent of Jesus peace be upon him, the emergence of Ya'juj and Ma'juj (Gog and Magog), and the rising of the sun from its west.\nScholars have divided the signs of the Hour regarding their appearance into three sections:\n1 - A section that appeared and has passed.\n2 - A section that appeared and continues to follow and increase.\n3 - A section that has not appeared until now.\nThe first two sections are from the Minor Signs of the Hour, while the third section includes the Major Signs and some Minor Signs.",
    "foot_note": "1. Yusuf Al-Wabil, Ashrat As-Sa'ah (Signs of the Hour), p. 9, 2nd Edition, Dar Ibn Al-Jawzi, Dammam, 1411 AH.\n2. See: Ashrat As-Sa'ah, pp. 77-78.",
    "book_id": "51"
  },
  {
    "serial_number": "97962",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "Section Two: Minor Signs of the Hour (1)\nWe mean by this the signs that have occurred and passed and will not reoccur, and those that have not yet occurred. They are many, and we will mention some of them:\n1 - The Mission of the Prophet (peace be upon him): He (peace be upon him) informed that his mission is a proof of the proximity of the Hour and that he is the Prophet of the Hour. On the authority of Sahl (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «I and the Hour have been sent like these two» and he pointed with his two fingers, extending them (2). In a narration by Muslim: «and he joined the index and middle fingers» (3). So the first of the signs of the Hour is the mission of the Prophet (peace be upon him), for he is the last Prophet, so no other Prophet follows him. Only the Resurrection follows him as the middle finger follows the index finger, with no other finger between them or separating one from the other (4).\n2 - The Death of the Prophet (peace be upon him): Among the signs of the Hour is the death of the Prophet (peace be upon him). In the Hadith on the authority of Awf bin Malik (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «Count six things before the Hour: my death, then the conquest of Jerusalem, then a plague that will take you like the 'qu'as' (a disease) of sheep, then the abundance of wealth such that a man is given one hundred dinars and remains displeased, then a tribulation (fitnah) that will not leave a house of the Arabs except that it enters it, then a truce between you and Banu al-Asfar (the Romans/Byzantines) which they will break, and they will come to you under eighty banners, under each banner twelve thousand» (5).\n3 - The Conquest of Jerusalem: Among the signs of the Hour is the conquest of Jerusalem. In the Hadith on the authority of Awf bin Malik (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «Count six things before the Hour: ... -and he mentioned among them- the conquest of Jerusalem» (6). Jerusalem was conquered during the caliphate of Umar bin Al-Khattab (may Allah be pleased with him) in the year sixteen of the Hijra, as the Imams of biography have stated. Umar (may Allah be pleased with him) went himself, made peace with its people, opened it, purified it from the Jews and Christians, and built a mosque therein in the direction of the Qibla of Jerusalem (7).\n4 - The Plague of Amwas (8):",
    "foot_note": "1. See: Ashrat As-Sa'ah, pp. 79-235, and Al-Yawm Al-Akhir - Al-Qiyamah Al-Sughra, pp. 135-204.\n2. Sahih Al-Bukhari, Book of Riqaq, Chapter: The saying of the Prophet (peace be upon him) «I and the Hour have been sent like these two», (11/347 - with Al-Fath).\n3. Sahih Muslim, Book of Tribulations and Signs of the Hour, Chapter: Proximity of the Hour (18/89-90 - with Nawawi's explanation).\n4. See Al-Tadhkirah (711), and Fath Al-Bari (11/349).\n5. Sahih Al-Bukhari, Book of Jizya and Truce, Chapter: Warning against Treachery (6/277 - with Al-Fath).\n6. Previous Source.\n7. See: Al-Bidaya wan-Nihaya by Ibn Kathir, (7/55-57), Maktabat Al-Ma'arif, Beirut.\n8. Amwas: With a Fatha on the Ayn and Meem, a village miles away from Ramla and Jerusalem. The plague was attributed to it because it started there. See: Sharh An-Nawawi on Sahih Muslim (1/107).",
    "book_id": "51"
  },
  {
    "serial_number": "97963",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "It came in the previous Hadith of Awf bin Malik, his saying (peace be upon him): «Count six things before the Hour: ... -and he mentioned among them- then a 'mawtan' (1) (great death) that takes you like the 'qu'as' (2) of sheep» (3).\nIbn Hajar said: (It is said that this sign appeared in the plague of Amwas during the caliphate of Umar, and that was after the conquest of Jerusalem) (4).\n5 - Abundance of Wealth and Dispensing with Charity: On the authority of Abu Hurairah (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «The Hour will not be established until wealth becomes abundant among you and overflows, to the point that the owner of wealth will worry about who will accept it from him as charity, and a man will be called to it and say: I have no need for it» (5).\nMuch of what the Truthful and Trustworthy one (peace be upon him) told us has come true. Wealth became abundant during the time of the Companions (may Allah be pleased with them) due to the conquests that occurred, and they divided the wealth of the Persians and Romans. Wealth overflowed during the time of Umar bin Abdul Aziz (may Allah have mercy on him), such that a man would offer wealth for charity and find no one to accept it. Wealth will also increase at the end of time until a man offers his wealth and the one to whom it is offered says: I have no need for it. This - and Allah knows best - is a reference to what will happen in the time of the Mahdi and Jesus peace be upon him (6) regarding the abundance of wealth and the earth bringing forth its blessings and treasures.\n6 - Appearance of Tribulations (Fitan): He (peace be upon him) informed that among the signs of the Hour is the appearance of great tribulations wherein truth becomes confused with falsehood, shaking the faith such that a man becomes a believer in the morning and a disbeliever in the evening, or becomes a believer in the evening and a disbeliever in the morning. Whenever a tribulation appears, the believer says: This is my destruction. Then it clears and another appears, and he says: This one, this one. Tribulations will continue to appear until the Hour is established. Imam Muslim narrated from Abu Hurairah (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «Hasten to do good deeds before tribulations like pieces of a dark night, a man becomes a believer in the morning and a disbeliever in the evening, or becomes a believer in the evening and a disbeliever in the morning, selling his religion for a worldly gain» (7).",
    "foot_note": "1. Mawtan: With a Damma on the Meem and Sukun on the Waw, meaning death occurring frequently. See Fath Al-Bari (6/278).\n2. Qu'as: With a Damma on the Ayn (neglected) and light Qaf, a disease that afflicts beasts causing something to flow from their noses and they die suddenly. See: Al-Nihaya fi Gharib Al-Hadith by Ibn Al-Athir (4/78), 1st Edition, Comments by: Salah Uwaydah, Dar Al-Kutub Al-Ilmiyyah, Beirut, 1418 AH, and Fath Al-Bari (6/278).\n3. Previously referenced on p. 21.\n4. Fath Al-Bari (6/278).\n5. Sahih Al-Bukhari, Book of Fitan (13/81-82 - with Al-Fath), and Sahih Muslim, Book of Zakat, Chapter: Every act of kindness is charity (7/97 - with Nawawi's explanation).\n6. See: Fath Al-Bari (87-88).\n7. Sahih Muslim, Book of Iman, Chapter: Encouragement to hasten to do deeds before tribulations appear (2/133 - with Nawawi's explanation).",
    "book_id": "51"
  },
  {
    "serial_number": "97964",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "7 - Appearance of Claimants to Prophethood: Among the signs that have appeared is the emergence of liars claiming prophethood, who are close to thirty liars. Some of them appeared in the Prophet's time and in the time of the Companions, and they continue to appear. The limitation in the Hadiths does not mean everyone who claimed prophethood absolutely, for they are too many to count. Rather, the intent is those who gained power, raised a doubt, had many followers, and became famous among people (1).\nIn the two Sahihs on the authority of Abu Hurairah (may Allah be pleased with him) from the Prophet (peace be upon him) who said: «The Hour will not be established until impostors, liars, appear, close to thirty, all of them claiming to be a messenger of Allah» (2).\n8 - Spread of Security: On the authority of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «The Hour will not be established until a rider travels between Iraq and Mecca fearing nothing but losing the way» (3). This occurred in the time of the Companions (may Allah be pleased with them) when Islam and justice spread throughout the lands conquered by Muslims. It will also happen in the time of the Mahdi and Jesus peace be upon him when justice prevails over tyranny and oppression.\n9 - Appearance of the Fire of Hijaz: On the authority of Abu Hurairah (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «The Hour will not be established until a fire emerges from the land of Hijaz which will illuminate the necks of camels in Busra (4)» (5).\nAn-Nawawi (6) (may Allah have mercy on him) said: (It emerged in our time in the year six hundred and fifty-four. It was a massive fire on the eastern side of Medina behind the Harrah. Knowledge of it was widely transmitted (Tawatur) throughout the Levant and all lands. Those who were present from the people of Medina informed me about it. Scholars who were contemporary to its appearance and those after them spoke extensively describing it. This fire is not the fire that will emerge at the end of time to gather people to their place of assembly) (7).\n10 - Fighting the Turks: Muslim narrated from Abu Hurairah (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «The Hour will not be established until the Muslims fight the Turks,",
    "foot_note": "1. See: Fath Al-Bari (6/617).\n2. Sahih Al-Bukhari, Book of Virtues, Chapter: Signs of Prophethood (6/616 - with Al-Fath), and Sahih Muslim, Book of Tribulations and Signs of the Hour (18/45-46 - with Nawawi's explanation).\n3. Al-Haythami said: Narrated by Ahmad, its men are men of Sahih, Majma' Al-Zawa'id (7/639), edited by: Abdullah Al-Darwish, Dar Al-Fikr, Beirut, 1414 AH. And the investigators of Al-Musnad said: Its chain is authentic (14/427 No: 8833).\n4. Busra: With a Damma on the Ba ending with a shortened Alif: A well-known city in the Levant, also called Hawran, between it and Damascus are three stages. See: Sharh An-Nawawi on Muslim (18/30).\n5. Sahih Al-Bukhari, Book of Fitan, Chapter: The Emergence of the Fire (13/18 - with Al-Fath), and Sahih Muslim, Book of Tribulations and Signs of the Hour (18/30 - with Nawawi's explanation).\n6. He is Abu Zakariya Yahya bin Sharaf bin Hasan bin Husayn Al-Hizam An-Nawawi, one of the leading Shafi'i scholars. Among his works: Al-Majmu' Sharh Al-Muhadhdhab, Sharh Sahih Muslim, Riyad as-Salihin. He died in the year 676. See: Tadhkirat al-Huffaz: 4/1470, and Tabaqat al-Shafi'iyyah al-Kubra: 8/395.\n7. Sharh An-Nawawi on Sahih Muslim (18/28).",
    "book_id": "51"
  },
  {
    "serial_number": "97965",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "a people whose faces are like hammered (2) shields (1), wearing hair and walking in hair (shoes)» (3).\nThe matter occurred as the Messenger (peace be upon him) foretold. The Muslims fought the Turks more than once. Muslims fought the Turks since the era of the Companions (may Allah be pleased with them), specifically in the beginning of the Umayyad caliphate during the time of Mu'awiyah (may Allah be pleased with him). An-Nawawi (may Allah have mercy on him) says regarding the Tatars who swept through the Islamic world: (And they - meaning the Turks - whom the Messenger of Allah (peace be upon him) spoke about have been found in our time like this... all their characteristics mentioned by the Messenger of Allah (peace be upon him): small eyes, red faces, flat noses, broad faces, as if their faces were hammered shields, wearing hair shoes. They were found with all these qualities in our time. Muslims fought them many times, and are fighting them now. We ask Allah the Generous for a good outcome for the Muslims in their affair, and the affair of others, and all their conditions, and for the continuation of kindness and protection towards them. Peace and blessings of Allah be upon His Messenger who does not speak from inclination; it is but a revelation revealed) (4).\n11 - Fighting the Non-Arabs (Ajam) (5): On the authority of Abu Hurairah (may Allah be pleased with him) that the Prophet (peace be upon him) said: «The Hour will not be established until you fight the Khuz (6) and Kirman (7) from the non-Arabs, red-faced, flat-nosed, small-eyed, their faces like hammered shields, their shoes made of hair (8)».\n12 - Loss of Trust (Amanah): On the authority of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «If trust is lost, then wait for the Hour.» He said: How is it lost, O Messenger of Allah? He said: «When authority is given to those who do not deserve it, then wait for the Hour» (9).\n13 - Removal of Knowledge and Appearance of Ignorance: Among its signs are the removal of knowledge and the spread of ignorance. In the two Sahihs on the authority of Anas bin Malik (may Allah be pleased with him) who said: The Messenger of Allah -",
    "foot_note": "1. Al-Majan: Plural of Mijann, which is the shield (Turs). The Meem is extra because it is from 'Junnah' meaning cover/protection. See: Al-Nihaya fi Gharib Al-Hadith (4/256).\n2. Hammered Shields (Al-Majan Al-Mutraqa): Shields covered with leather (Tariq). 'Tariq An-Na'l' is when one sole is put over another. He likened their faces in width and prominent cheekbones to a shield covered with leather. See: Nihayat Gharib Al-Hadith (3/111), Sharh An-Nawawi on Sahih Muslim (18/36-37).\n3. (Sahih Muslim) Book of Tribulations and Signs of the Hour, (18/37 - with Nawawi's explanation).\n4. Sharh An-Nawawi on Sahih Muslim (18/37-38).\n5. Al-Ajam: The opposite of Arabs. Singular is Ajami, like Arabi, plural Arabs. See: Lisan Al-Arab by Ibn Manzur (5/2825), edited by: Abdullah Ali Al-Kabir, Dar Al-Ma'arif.\n6. Khuz: With a Damma on the Kha and Sukun on the Waw followed by Zay. A land in Ahwaz, and they are of non-Arab origin. It is said Khuz is a type of non-Arabs. See: Fath Al-Bari (6/607).\n7. Kirman: With a Fatha then Sukun and ending with Nun, and perhaps the Kaf is broken (Kirman). A famous city in the lands of the non-Arabs between Khorasan and the Indian Sea. See: Fath Al-Bari (6/607).\n8. Sahih Al-Bukhari, Book of Virtues, Chapter: Signs of Prophethood (6/604 - with Al-Fath).\n9. Sahih Al-Bukhari, Book of Riqaq, Chapter: Removal of Trust (11/333 - with Al-Fath).",
    "book_id": "51"
  },
  {
    "serial_number": "97966",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "peace be upon him- said: «From the signs of the Hour is that knowledge will be lifted, ignorance will be established, alcohol will be drunk, and adultery will appear» (1).\nThe removal of knowledge occurs through the death of scholars. On the authority of Abdullah bin Amr bin Al-Aas (may Allah be pleased with them both), he said: I heard the Messenger of Allah (peace be upon him) say: «Indeed, Allah does not take away knowledge by snatching it from the people, but He takes away knowledge by taking away the scholars, until when He leaves no scholar, people take ignorant heads [as leaders]. They are asked and they issue fatwas without knowledge, so they go astray and lead others astray» (2).\n14 - Increase of Police and Helpers of Oppressors: On the authority of Abu Umamah (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «There will be in this nation at the end of time men having whips like the tails of cows; they go out in the morning under Allah's wrath and return in the evening under His anger» (3). Imam Muslim narrated from Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «Two types of the people of the Fire I have not seen: people with whips like the tails of cows with which they beat the people...» (4).\n15 - Spread of Adultery (Zina): Among the signs that have appeared is the prevalence and increase of adultery among people. The Prophet (peace be upon him) informed that this is one of the signs of the Hour. In the two Sahihs on the authority of Anas (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «Indeed from the signs of the Hour... -and he mentioned among them- and adultery will appear» (5).\n16 - Spread of Usury (Riba): Among them is the appearance of usury and its spread among people and the lack of concern for consuming the unlawful. In the Hadith on the authority of Ibn Masud (may Allah be pleased with him) from the Prophet (peace be upon him) that he said: «Before the Hour, usury will appear» (6).\n17 - Appearance of Musical Instruments and Declaring them Lawful: On the authority of Sahl bin Sa'd that the Messenger of Allah (peace be upon him) said: «There will be in the end of time swallowing [by the earth], pelting [from the sky], and transmutation.» It was said: When is that, O Messenger of Allah? He said: «When musical instruments and singing girls appear and alcohol is declared lawful» (7).\n18 - Excessive Drinking of Alcohol and Declaring it Lawful: Muslim narrated from Anas bin Malik (may Allah be pleased with him) who said: I heard the Messenger of Allah (peace be upon him) saying: «From the signs of the Hour... -and he mentioned among them- and alcohol will be drunk» (8). Also, what Ibn Majah narrated from Ubadah bin As-Samit, who said: The Messenger of Allah (peace be upon him) said: «People from my nation will drink alcohol, calling it by other than its name» (9).\n19 - Decoration of Mosques and Boasting about them: On the authority of Anas (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «The Hour will not be established until people boast about mosques» (10).\n20 - Competing in Constructing Tall Buildings: On the authority of Abu Hurairah (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «The Hour will not be established until people compete in constructing tall buildings» (11).\n21 - The Slave Girl Giving Birth to Her Mistress: It came in the long Hadith of Gabriel, his saying (peace be upon him): «And I will tell you about its signs: When the slave girl gives birth to her mistress (12)». In a narration by Muslim: «When the slave girl gives birth to her master» (13).\n22 - Increase of Killing: On the authority of Abu Hurairah (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «The Hour will not be established until 'Al-Harj' increases. They said: What is Al-Harj, O Messenger of Allah? He said: Killing, killing...» (14).\n23 - Convergence of Time: On the authority of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «The Hour will not be established... until time converges» (15).",
    "foot_note": "1. Sahih Al-Bukhari, Book of Knowledge, Chapter: Removal of Knowledge and Appearance of Ignorance (1/178 - with Al-Fath), and Sahih Muslim, Book of Knowledge, Chapter: Removal and Taking away of Knowledge and Appearance of Ignorance and Tribulations at the End of Time (16/221 - with Nawawi's explanation).\n2. Sahih Al-Bukhari, Book of Knowledge, Chapter: How Knowledge is Taken Away (1/194 - with Al-Fath), and Sahih Muslim, Book of Knowledge, Chapter: Removal and Taking away of Knowledge and Appearance of Ignorance and Tribulations (16/223-224 - with Nawawi's explanation).\n3. Al-Albani said: Narrated by Ahmad and Al-Hakim. Al-Hakim said its chain is authentic, and Al-Dhahabi agreed, and it is as they said. Silsilat Al-Ahadith As-Sahihah, Al-Albani, (45174), 4th Edition, Maktabat Al-Ma'arif, Riyadh, 1408 AH.\n4. Sahih Muslim, Book of Paradise and Description of its Bliss, Chapter: Hell, may Allah protect us from it (17/190 - with Nawawi's explanation).\n5. Previously referenced on p. 25.\n6. Al-Haythami said in Majma' Al-Zawa'id: Narrated by Al-Tabarani in Al-Awsat, and its men are men of Sahih (4/213). See: As-Silsilah As-Sahihah: 7/1226 No. 3415/2.\n7. Sahih Al-Jami' As-Saghir wa Ziyadatuh, Al-Albani, (1/683), 2nd Edition, Al-Maktab Al-Islami, Beirut, 1406 AH.\n8. Previously referenced on p. 25.\n9. Sahih Sunan Ibn Majah, Book of Drinks, Chapter: Calling Alcohol by Other Names, Al-Albani (2/244), 2nd Edition, Arab Bureau of Education for the Gulf States, Riyadh, 1408 AH.\n10. Sahih Sunan Abu Dawood, Book of Prayer, Chapter: On Building Mosques, Al-Albani (1/91), 1st Edition, Arab Bureau of Education for the Gulf States, Riyadh, 1409 AH.\n11. Musnad Ahmad (16/499 No. 10858) and the investigators of Al-Musnad said: Its chain is authentic, and Al-Bukhari in Al-Adab Al-Mufrad No. 449.\n12. Meaning that slave girls will give birth to those who become masters and owners; she was owned first, and gives birth to those who become masters and owners. It is a metaphor for the rapid change of conditions. See Sharh An-Nawawi on Muslim (1/158), and Sharh Al-Arba'in An-Nawawiyyah by Ibn Uthaymeen p. 55.\n13. Previously referenced on p. 26.\n14. Sahih Muslim, Book of Tribulations and Signs of the Hour (18/13 - with Nawawi's explanation).\n15. Previously referenced on p. 26.",
    "book_id": "51"
  },
  {
    "serial_number": "97967",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "24 - Convergence of Markets: On the authority of Abu Hurairah (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «The Hour will not be established until tribulations appear, lying increases, and markets converge» (1).\n25 - Appearance of Shirk in this Nation: On the authority of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «The Hour will not be established until the buttocks of the women of Daws wobble around Dhu al-Khalasa» (2). Dhu al-Khalasa was an idol of Daws which they used to worship in the Jahiliyyah (Pre-Islamic era).\n26 - Appearance of Obscenity, Severing Ties of Kinship, and Bad Neighborship: Imam Ahmad narrated from Abdullah bin Amr (may Allah be pleased with them both) that the Messenger of Allah (peace be upon him) said: «The Hour will not be established until obscenity, indecency, severing ties of kinship, and bad neighborship appear» (3).\n27 - Aging of the Youth (or Old Men Dyeing like Youth): On the authority of Ibn Abbas (may Allah be pleased with them both) who said: The Messenger of Allah (peace be upon him) said: «There will be a people at the end of time who dye with black like the crops of pigeons; they will not smell the fragrance of Paradise» (4).\n28 - Prevalence of Stinginess: On the authority of Abu Hurairah (may Allah be pleased with him) from the Prophet (peace be upon him) who said: «Time will converge, deeds will decrease, and stinginess will be cast [into hearts]» (5).\n29 - Increase of Trade: Imam Ahmad narrated from Abdullah bin Masud (may Allah be pleased with him) from the Prophet (peace be upon him) that he said: «Before the Hour is the greeting of special people (only those known), and the spread of trade, until a woman helps her husband in trade» (6).\n30 - Increase of Earthquakes: On the authority of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «The Hour will not be established... until earthquakes increase...» (7).\n31 - Appearance of Swallowing (by earth), Transmutation, and Pelting: On the authority of Aisha (may Allah be pleased with her) who said: The Messenger of Allah (peace be upon him) said: «There will be in the end of this nation swallowing [by the earth], transmutation, and pelting.»",
    "foot_note": "1. Al-Haythami said: (It is in Al-Sahih except for the phrase: \"lying increases and markets converge.\" Narrated by Ahmad and its men are men of Sahih except Sa'id bin Sam'an who is trustworthy), Majma' Al-Zawa'id (7/632).\n2. Sahih Al-Bukhari, Book of Fitan, Chapter: Change of Time until Idols are Worshipped (13/76 - with Al-Fath) and Sahih Muslim, Book of Tribulations and Signs of the Hour (18/32-33 - Sharh An-Nawawi).\n3. Its chain is authentic, Musnad Imam Ahmad (10/20-23) edited by Ahmed Shakir, Dar Al-Ma'arif, Egypt, 1392 AH.\n4. Sunan Abu Dawood No. 4212.\n5. Sahih Al-Bukhari, Book of Fitan, Chapter: Appearance of Tribulations (3/13 - with Al-Fath).\n6. Musnad Ahmad (5/333 - edited by Ahmed Shakir) and he said: Its chain is authentic.\n7. Previously referenced on p. 25.",
    "book_id": "51"
  },
  {
    "serial_number": "97968",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "She said: I said, O Messenger of Allah! Will we be destroyed while there are righteous people among us? He said: «Yes, when wickedness becomes prevalent» (1).\n32 - Disappearance of the Righteous: On the authority of Abdullah bin Amr (may Allah be pleased with them both) who said: The Messenger of Allah (peace be upon him) said: «The Hour will not be established until Allah takes His 'Sharibah' (2) (chosen ones) from the people of the earth, and there remain the 'Ajjaj' (3) (rabble) who do not know good nor deny evil» (4).\n33 - Rise of the Lowly: Imam Ahmad narrated from Abu Hurairah (may Allah be pleased with him), the Messenger of Allah (peace be upon him) said: «There will come upon people deceptive years wherein the liar is believed and the truthful is belied, the traitor is trusted and the trustworthy is considered a traitor, and the Ruwaybidah (5) speaks. It was said: What is the Ruwaybidah? He said: The foolish man speaking in the affairs of the public» (6).\n34 - Greeting only for Acquaintance: On the authority of Ibn Masud (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «Indeed, among the signs of the Hour is that a man greets another man, not greeting him except for acquaintance (because he knows him)» (7).\n35 - Seeking Knowledge from the Young (Lowly): On the authority of Abu Umayyah Al-Jumahi (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «Indeed, among the signs of the Hour are three: One of them is that knowledge is sought from the young (Asaghir)...» (8).\n36 - Appearance of Women Clothed yet Naked: On the authority of Abdullah bin Amr (may Allah be pleased with them both) who said: I heard the Messenger of Allah (peace be upon him) say: «There will be in the last of my nation men riding on saddles (9) resembling camel-litters (10), dismounting at the doors of mosques; their women are clothed yet naked, upon their heads are like the humps of",
    "foot_note": "1. Sahih Sunan At-Tirmidhi, Book of Fitan, Chapter: What came regarding Swallowing, by Al-Albani, (2/237), 1st Edition, Arab Bureau of Education for the Gulf States, Riyadh, 1408 AH.\n2. Sharitah: Meaning the people of goodness and religion. Ashrat is from words having opposite meanings (Addad), applying to nobles and the lowly. See: Al-Nihaya fi Gharib Al-Hadith (2/412).\n3. Ajjaj: The mob and the lowly in whom there is no good. Al-Nihaya fi Gharib Al-Hadith (3/167).\n4. Musnad Ahmad (11/181-182 - edited by Ahmed Shakir) and he said its chain is authentic.\n5. Ruwaybidah: Diminutive of Rabidah, which is the incapable one who sits back from noble matters and sits seeking them, and the trivial, mean, contemptible person. See: Al-Nihaya fi Gharib Al-Hadith (2/170).\n6. Musnad Ahmad (15/37-38 edited by Ahmed Shakir) and he said: Its chain is Hasan and its text is authentic.\n7. Musnad Ahmad (5/324 - explanation by Ahmed Shakir) and he said its chain is authentic.\n8. Sahih Al-Jami' As-Saghir (2/439).\n9. Suruj: Plural of Sarj which is the saddle of a beast. See: Lisan Al-Arab (4/1983).\n10. Rihal: Plural of Rahl which is a mount for a camel. The Rahalah is larger than a saddle and covered with leather, used for horses and noble camels. Rahl is also used for a person's home and dwelling. Al-Nihaya fi Gharib Al-Hadith (2/191), and Lisan Al-Arab (3/1608).",
    "book_id": "51"
  },
  {
    "serial_number": "97969",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "lean (1) Bukht camels (1). Curse them for they are accursed. If there were a nation behind you, your women would have served their women just as the women of nations before you served you» (2).\n37 - Truthfulness of the Believer's Dream: On the authority of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «When the time approaches, the dream of a Muslim will hardly lie. The most truthful of you in dream is the most truthful in speech. And the dream of the Muslim is one of forty-five parts of Prophethood.» This is the wording of Muslim (3).\n38 - Abundance and Spread of Writing: It came in the Hadith of Ibn Masud (may Allah be pleased with him) from the Prophet (peace be upon him) who said: «Indeed, before the Hour... is the appearance of the pen (4).» The meaning of the appearance of the pen - and Allah knows best - is the appearance of writing (5) and its spread.\n39 - Negligence of Sunan Encouraged by Islam: On the authority of Ibn Masud (may Allah be pleased with him) who said: I heard the Messenger of Allah (peace be upon him) saying: «Indeed, among the signs of the Hour is that a man passes through the mosque and does not pray two rak'ahs in it» (6).\n40 - Swelling of the Crescents (Moons): On the authority of Abdullah bin Masud (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «From the approach of the Hour is the swelling of the crescents» (7).\n41 - Prevalence of Lying and Lack of Verification in Reporting News: On the authority of Abu Hurairah (may Allah be pleased with him) from the Messenger of Allah (peace be upon him) that he said: «There will be in the last of my nation people telling you what you have not heard, neither you nor your fathers, so beware of them» (8).",
    "foot_note": "1. Bukht: An Arabized word, meaning camels with long necks (1/101). Ajaf: Plural of Ajfa', meaning lean sheep etc. Al-Nihaya fi Gharib Al-Hadith (3/169).\n2. Musnad Imam Ahmad (12/36 - explanation by Ahmed Shakir) and he said: Its chain is authentic.\n3. Sahih Al-Bukhari, Book of Interpretation of Dreams, Chapter: Fetters in a Dream (12/404 - with Al-Fath) and Sahih Muslim, Book of Dreams (15/20 - with Nawawi's explanation).\n4. Previously referenced on p. 25.\n5. See: Musnad Ahmad (5/334 - edited by Ahmed Shakir).\n6. Al-Albani said in As-Silsilah As-Sahihah: (Narrated by Ibn Khuzaimah in his Sahih and others from the Hadith of Abdullah bin Masud in marfu' form. There is weakness in its chain, but the Hadith has other paths from Ibn Masud that strengthen it) (2/253).\n7. Sahih Al-Jami' As-Saghir (2/1025).\n8. Sahih Muslim, Introduction, Chapter: Prohibition of Narrating from the Weak (1/78 - with Nawawi's explanation).",
    "book_id": "51"
  },
  {
    "serial_number": "97970",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "42 - Prevalence of False Witness and Concealment of True Witness: It came in the Hadith of Abdullah bin Masud (may Allah be pleased with him), his saying (peace be upon him): «Indeed, before the Hour... is false witness and concealment of true witness...» (1).\n43 - Abundance of Women and Scarcity of Men: On the authority of Anas (may Allah be pleased with him) who said: I will tell you a Hadith that no one will tell you after me. I heard the Messenger of Allah (peace be upon him) say: «From the signs of the Hour is that knowledge decreases, ignorance appears, adultery appears, women increase, and men decrease until there will be one maintainer for fifty women» (2).\n44 - Prevalence of Sudden Death: On the authority of Anas bin Malik (may Allah be pleased with him) raising it to the Prophet (peace be upon him) who said: «Indeed, among the signs of the Hour... is the appearance of sudden death» (3).",
    "foot_note": "1. Previously referenced on p. 25.\n2. Previously referenced on p. 25.\n3. Sahih Al-Jami' As-Saghir (2/1026).",
    "book_id": "51"
  },
  {
    "serial_number": "97971",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "45 - Occurrence of Strangeness (Mutual Denial) among People: On the authority of Hudhayfah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) was asked about the Hour! He said: «Its knowledge is with my Lord. None will reveal its time except Him. But I will tell you of its signs and what comes before it. Indeed, before it is tribulation and Harj.» They said: O Messenger of Allah! We know tribulation, but what is Harj? He said: «In the Ethiopian tongue: Killing. And strangeness will be cast among people so that hardly anyone will know anyone» (1).\n46 - The Land of the Arabs Returning to Meadows and Rivers: On the authority of Abu Hurairah (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «The Hour will not be established until the land of the Arabs returns to meadows (2) and rivers» (3).\n47 - Abundance of Rain and Scarcity of Vegetation: On the authority of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «The Hour will not be established until people are rained upon with rain from which no house of clay (Madar) can shelter (4), and nothing shelters from it except houses of hair (tents)» (5).\n48 - The Euphrates (6) Uncovering a Mountain of Gold: On the authority of Abu Hurairah (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «The Hour will not be established until the Euphrates recedes from a mountain of gold over which people will fight. Ninety-nine out of every hundred will be killed, and every man among them will say: Perhaps I will be the one who survives» (7).",
    "foot_note": "1. Al-Haythami said: A part of its beginning is in Al-Sahih. Narrated by Al-Tabarani and it contains someone who was not named, Majma' Al-Zawa'id (7/627).\n2. Muruj: Plural of Marj, which is a wide open space. Land with pasture is called Marj. From it is their saying 'Maraja ad-Dabbah' (he let the beast loose) if he sent it to graze in the Marj. See: Lisan Al-Arab (7/4168).\n3. Sahih Muslim, Book of Zakat, Chapter: Every act of kindness is charity (7 - 97 - with Nawawi's explanation).\n4. Meaning: It does not shield anything from it. Meaning: That rain comes down through houses of clay, and houses of clay do not prevent its descent, and nothing prevents it except houses of hair. And He, the Exalted, is capable of all things.\n5. Musnad Imam Ahmad (13/291 - edited by Ahmed Shakir) and he said: Its chain is authentic. It is in Majma' Al-Zawa'id (7/639), Al-Haythami said: Narrated by Ahmad and its men are men of Sahih.\n6. Euphrates (Al-Furat): Very sweet water and a river in Kufa, Al-Qamus Al-Muhit p. 144.\n7. Sahih Al-Bukhari, Book of Fitan, Chapter: Emergence of the Fire (13/78 - with Al-Fath) and Sahih Muslim, Book of Tribulations and Signs of the Hour (18/18 - with Nawawi's explanation).",
    "book_id": "51"
  },
  {
    "serial_number": "97972",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "49 - Beasts and Inanimate Objects Speaking to Humans: On the authority of Abu Hurairah (may Allah be pleased with him) who said: A wolf came to a shepherd of sheep and took a sheep from them. The shepherd pursued it until he snatched it back from it. He said: The wolf climbed a hill, sat on its haunches (1), lowered its tail (2), and said: You aimed at a provision that Allah, the Mighty and Majestic, provided for me, and you snatched it from me. The man said: By Allah, I have never seen anything like today, a wolf speaking! The wolf said: More amazing than this is a man in the palms between the two lava fields (Harrahs) telling you about what has passed and what will be after you - the man was Jewish - so the man came to the Prophet (peace be upon him) and informed him. The Prophet (peace be upon him) believed him, then the Prophet (peace be upon him) said: «It is indeed a sign from the signs before the Hour. Soon a man will go out and not return until his shoes and his whip tell him what his family did after him» (3).\n50 - Wishing for Death due to Severity of Tribulation: On the authority of Abu Hurairah (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «The Hour will not be established until a man passes by the grave of another man and says: Would that I were in his place» (4).\n51 - Abundance of the Romans and their Fighting the Muslims: Al-Mustawrid Al-Qurashi said in the presence of Amr bin Al-Aas (may Allah be pleased with them both): I heard the Messenger of Allah (peace be upon him) say: «The Hour will be established while the Romans are the majority of people.» Amr said to him: Watch what you say. He said: I say what I heard from the Messenger of Allah (peace be upon him) (5). It came in the Hadith of Awf bin Malik Al-Ashja'i (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: «Count six things before the Hour... -and he mentioned among them- then a truce between you and Banu al-Asfar (Romans), but they will act treacherously and come to you under eighty banners (6), under each banner twelve thousand (7)».\n",
    "foot_note": "1. Iq'a: For a man to stick his buttocks to the ground, erect his legs and thighs, and place his hands on the ground as a dog sits. Al-Nihaya fi Gharib Al-Hadith (4/78).\n2. Istadhfara: Its origin is Istathfara, so the three-dotted Tha was changed to a dotted Dhal. You say 'Istathfara the dog' when it tucks its tail between its thighs until it sticks to its belly. See explanation of Musnad Ahmad (15/203) by Ahmed Shakir.\n3. Musnad Ahmad, (15/202-203 - explanation by Ahmed Shakir) and he said its chain is authentic.\n4. Sahih Al-Bukhari, Book of Fitan (13/81-82 - with Al-Fath), and Sahih Muslim, Book of Tribulations and Signs of the Hour (18/34 - with Nawawi's explanation).\n5. Sahih Muslim, Book of Tribulations and Signs of the Hour (18/22 - with Nawawi's explanation).\n6. Ghaya: Meaning banner/flag (Rayah). It was named so because it is the goal (Ghaya) of the follower; if it stops, he stops. See: Fath Al-Bari (6/278).\n7. Previously referenced on p. 21.",
    "book_id": "51"
  },
  {
    "serial_number": "97973",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "52 - The Conquest of Constantinople: On the authority of Abu Hurairah (may Allah be pleased with him) that the Prophet (peace be upon him) said: «Have you heard of a city, one side of which is on land and one side is in the sea?» They said: Yes, O Messenger of Allah. He said: «The Hour will not be established until seventy thousand from the Children of Isaac attack it. When they come to it, they will land and will not fight with weapons nor throw arrows. They will say: 'La ilaha illa Allah wa Allahu Akbar' (There is no deity but Allah and Allah is the Greatest), and one of its sides will fall.» Thawr (1) - one of the narrators of the Hadith - said: I do not know but that he said: The one that is in the sea. «Then they will say a second time: 'La ilaha illa Allah wa Allahu Akbar', and its other side will fall. Then they will say a third time: 'La ilaha illa Allah wa Allahu Akbar', and it will be opened for them. They will enter it and take booty. While they are dividing the spoils, a caller will come to them saying: Indeed, the Dajjal has emerged. So they will leave everything and return» (2).\n53 - Emergence of Al-Qahtani: The two Sheikhs (Bukhari and Muslim) narrated from Abu Hurairah (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «The Hour will not be established until a man from Qahtan emerges, driving people with his stick» (3).\n54 - Fighting the Jews: On the authority of Abu Hurairah (may Allah be pleased with him) from the Messenger of Allah (peace be upon him) who said: «The Hour will not be established until the Muslims fight the Jews, and the Muslims will kill them until the Jew hides behind a stone or a tree, and the stone or tree says: O Muslim! O servant of Allah: This is a Jew behind me, come and kill him. Except for the Gharqad (4), for it is from the trees of the Jews» (5).\n55 - Medina Expelling its Wicked People then its Ruin at the End of Time: On the authority of Abu Hurairah (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: «A time will come upon people when a man will call his cousin and his relative: Come to prosperity, come to prosperity. And Medina is better for them if they only knew. By the One in Whose Hand is my soul, no one leaves it out of desire for other than it except that Allah replaces him in it with someone better than him. Verily, Medina is like a furnace (KIr); it expels the impurity. The Hour will not be established until Medina expels its evil ones just as the furnace expels the impurities of iron» (6).",
    "foot_note": "1. Thawr bin Zaid Al-Dili, with a Kasra on the neglected (Dal) followed by a Ya, Al-Madani, trustworthy from the sixth generation. He died in the year one hundred and thirty-five. Taqreeb Al-Tahdhib p. 74.\n2. Sahih Muslim, Book of Tribulations and Signs of the Hour (18/43-44 - with Nawawi's explanation).\n3. Sahih Al-Bukhari, Book of Fitan, Chapter: Change of Time until Idols are Worshipped (13/76 - with Al-Fath), and Sahih Muslim, Book of Tribulations and Signs of the Hour (18/36 - with Nawawi's explanation).\n4. Gharqad: A type of thorny tree known in the land of Jerusalem, and there the killing of the Dajjal and the Jews will take place. See: Sahih Muslim Sharh An-Nawawi (18-45).\n5. Sahih Al-Bukhari, Book of Jihad, Chapter: Fighting the Jews, (6/103 - with Al-Fath), and Sahih Muslim, Book of Tribulations and Signs of the Hour (18/44-45 - with Nawawi's explanation).\n6. Sahih Muslim, Book of Hajj, Chapter: Medina expels its impurity and is called Taba and Taybah (9/153 - with Nawawi's explanation).",
    "book_id": "51"
  },
  {
    "serial_number": "97974",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "And on the authority of Abu Huraira, may Allah be pleased with him, who said: I heard the Messenger of Allah, peace and blessings be upon him, say: «You will leave Medina in the best state it ever was, covered by nothing but the 'Awafi - meaning wild beasts and birds - and the last to be gathered will be two shepherds from Muzayna intending to go to Medina, shouting at their sheep, but they will find it wild (empty of people), until when they reach Thaniyat al-Wada', they will fall on their faces» (1). \n56 - Sending the pleasant wind to take the souls of the believers: It came in the long Hadith of Al-Nawwas bin Sam'an regarding the story of the Dajjal, the descent of Isa (Jesus), peace be upon him, and the emergence of Ya'juj and Ma'juj (Gog and Magog): «Then Allah sends a pleasant wind which takes them under their armpits, taking the soul of every believer and every Muslim, and the wicked people remain, copulating therein like donkeys, and upon them the Hour will be established» (2). \n57 - The Permissibility (violation) of the Sacred House and the demolition of the Kaaba: Imam Ahmad narrated with his chain from Sa'id bin Sam'an who said: I heard Abu Huraira telling Abu Qatada that the Messenger of Allah, peace and blessings be upon him, said: «Allegiance will be pledged to a man between the Corner (Rukn) and the Station (Maqam), and the House will never be violated except by its own people. So when they violate it, do not ask about the destruction of the Arabs. Then the Abyssinians will come and destroy it a destruction after which it will never be inhabited again, and they are the ones who will extract its treasure» (3).",
    "foot_note": "1. Sahih Al-Bukhari, Book of the Virtues of Medina, Chapter: Whoever turns away from Medina (4/ 89 - 90 - with Al-Fath). \n2. Sahih Muslim, Book of Tribulations and Signs of the Hour, Chapter: Mention of the Dajjal (18/ 70 - with Al-Nawawi's explanation). \n3. Musnad Imam Ahmad (15/ 35 - verified by Ahmad Shakir) and he said: Its chain is authentic.",
    "book_id": "51"
  },
  {
    "serial_number": "97975",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "Topic Three: The Mahdi (1) Before mentioning these ten major signs, we speak about the Mahdi because his appearance precedes these signs, for he is the one whom the believers will rally around to fight the Dajjal, then Isa (Jesus), peace be upon him, will descend and pray behind him. In the end times, a man from the Ahl al-Bayt (Family of the Prophet) will emerge, through whom Allah will support the religion. He will rule for seven years, filling the earth with justice just as it was filled with tyranny and oppression. The Ummah will enjoy a great blessing during his reign; the earth will bring forth its vegetation, the sky will rain its drops, and wealth will be given without counting. This man's name is like the name of the Messenger of Allah, peace and blessings be upon him, and his father's name is like the name of the Prophet's father, peace and blessings be upon him, so his name will be Muhammad or Ahmad bin Abdullah. He is from the descendants of Fatima, the daughter of the Messenger of Allah, peace and blessings be upon him, then from the offspring of Al-Hasan bin Ali, may Allah be pleased with them. His described physical traits are that he has a broad forehead (2) and an aquiline nose (3)) (4). Place of his emergence: The Mahdi's appearance will be from the East. It came in the Hadith from Thawban, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: «Three will fight at your treasure, each one the son of a Caliph, but it will not go to any of them. Then the black banners will rise from the East, and they will kill you with a killing that no people have ever been killed with - then he mentioned something I do not remember -, then he said: So when you see him, pledge allegiance to him even if you have to crawl over snow, for he is the Caliph of Allah, the Mahdi» (5). Ibn Kathir said: (The praised Mahdi, promised to exist in the end times, his origin and emergence will be from the direction of the East, and allegiance will be pledged to him at the House [Kaaba], as indicated by some Hadiths) (6). About Abu Sa'id Al-Khudri, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: «The Mahdi will come out at the end of my nation; Allah will provide him with rain, the earth will bring forth its vegetation, he will give wealth properly, livestock will increase, and the nation will become great. He will live for seven or eight - meaning Hajj (years) -» (7).",
    "foot_note": "1. See: Ashrat al-Sa'ah (Signs of the Hour), pp. 249 - 250. And the book: 'Aqidah Ahl al-Sunnah wa al-Athar fi al-Mahdi al-Muntazar by Sheikh Abdul Muhsin al-Abbad. \n2. Al-Ajla: Light hair between the receding corners of the forehead temples, or one whose hair has receded from his forehead. See: Al-Nihayah fi Gharib al-Hadith (1/ 280). \n3. Al-Qana in the nose is length and thinness of its tip with a slight hump in its middle. See: Al-Nihayah fi Gharib al-Hadith (4/ 102). \n4. See: Al-Nihayah fi al-Fitan wa al-Malahim, pp. 23 - 25. \n5. Al-Albani said: (The Hadith is authentic in meaning except for his saying: \"for he is the Caliph of Allah, the Mahdi\". Ibn Majah narrated it via Alqamah from Ibn Masud as Marfu' similar to the second narration of Uthman, and its chain is Hasan, and it does not contain \"Caliph of Allah\". This addition \"Caliph of Allah\" has no established path nor a supporting witness, so it is Munkar [rejected]). Silsilat al-Ahadith al-Da'ifah wa al-Mawdu'ah, (1/ 120), by Al-Albani, 5th ed., Al-Maktab Al-Islami, Beirut, 1405 AH. \n6. Al-Nihayah fi al-Fitan wa al-Malahim p. 26. \n7. Al-Hakim said: Authentic chain, and Al-Dhahabi agreed. Al-Albani said: This is an authentic chain whose men are trustworthy, Silsilat al-Ahadith al-Sahihah (2/ 336).",
    "book_id": "51"
  },
  {
    "serial_number": "97976",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "Topic Four: The Major Signs of the Hour (1) There are major signs indicating the proximity of the Hour. If they appear, the Hour will follow in their tracks. In Sahih Muslim, from Hudhayfah bin Asid Al-Ghifari who said: The Prophet, peace and blessings be upon him, looked out at us while we were discussing. He said: \"What are you discussing?\" They said: \"We are mentioning the Hour.\" He said: «It will not be established until you see ten signs before it.» He mentioned the Smoke, the Dajjal, the Beast, the rising of the sun from its west, the descent of Isa bin Maryam (Jesus son of Mary), peace be upon him, Ya'juj and Ma'juj (Gog and Magog), and three landslides: a landslide in the East, a landslide in the West, and a landslide in the Arabian Peninsula, and the last of that is a fire emerging from Yemen driving the people to their gathering place» (2). The major signs follow one another in their occurrence; hardly any time separates them. They resemble in their succession the beads of a necklace when its string is cut. From Anas bin Malik, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: «The signs are beads strung on a string; if the string is cut, they follow one another» (3). The Messenger, peace and blessings be upon him, informed that the Great Battle (Al-Malhamah) between the Muslims and the Romans will happen first, then Constantinople will be conquered, then the Dajjal will emerge. Mu'adh bin Jabal, may Allah be pleased with him, narrated that the Messenger of Allah, peace and blessings be upon him, said: «The habitation of Jerusalem is the ruin of Yathrib (Medina), and the ruin of Yathrib is the emergence of the Great Battle, and the emergence of the Great Battle is the conquest of Constantinople, and the conquest of Constantinople is the emergence of the Dajjal» (4). After the emergence of the Dajjal, Isa, peace be upon him, descends and kills the Dajjal, then Ya'juj and Ma'juj emerge in the time of Isa, peace be upon him, and Allah destroys them in his time. The order up to here is clear. As for the rest of the signs, their order is not entirely clear. Yes, the rising of the sun from its west, the emergence of the Beast of the earth, and the emergence of the fire that gathers the people occur after the emergence of the Dajjal, the descent of Isa, peace be upon him, and the emergence of Ya'juj and Ma'juj. But which of them precedes the other? I mean the rising of the sun from its west, the emergence of the Beast, and the Fire gathering people. The Hadith narrated by Muslim in his Sahih from Hudhayfah is explicit that the emergence of the fire that gathers people from Yemen is the last of the signs, for the Prophet, peace and blessings be upon him, mentioned the ten major signs and said regarding the tenth sign, which is the fire: «And the last of that is a fire emerging from the land of Yemen driving the people to their gathering place» (5).",
    "foot_note": "1. See: Ashrat al-Sa'ah, pp. 239 - 426, and Al-Yawm al-Akhir - Al-Qiyamah al-Sughra, pp. 217 - 287. \n2. Sahih Muslim, Book of Tribulations and Signs of the Hour (18/ 27 - with Al-Nawawi's explanation). \n3. Al-Albani said: Al-Hakim said it is authentic according to the condition of Muslim, and Al-Dhahabi agreed, and it is as they said. Silsilat al-Ahadith al-Sahihah (4/ 361). \n4. Sahih Sunan Abi Dawood, Book of Al-Malahim, Chapter on the Signs of the Battles (3/ 809 - 810). \n5. Its extraction preceded on p. 37.",
    "book_id": "51"
  },
  {
    "serial_number": "97977",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "Six signs remain: The rising of the sun from its west, the emergence of the Beast, the Smoke, and the three Landslides. As for the rising of the sun from its west and the emergence of the Beast, they will be after the descent of Isa, peace be upon him, his killing of the Dajjal, and the destruction of Ya'juj and Ma'juj in his era, and after the corruption of people and the fading of Islam, and before the emergence of the fire that gathers people. But which is earlier, the rising of the sun or the emergence of the Beast? That is something that cannot be asserted with certainty due to the lack of certainty from the Messenger, peace and blessings be upon him, regarding that. In the Hadith of Abdullah bin Amr, may Allah be pleased with him, he heard the Messenger of Allah, peace and blessings be upon him, say: «The first of the signs to appear is the rising of the sun from its west and the emergence of the Beast to the people in the forenoon. Whichever of them happens before the other, the other is close on its tracks» (1). It is not permissible to use this Hadith as evidence that the rising of the sun from its west is before the emergence of the Dajjal, the descent of Isa, and the emergence of Ya'juj and Ma'juj because of his saying: «The first of the signs to appear is the rising of the sun»... the Hadith. (What is most likely from the reports is that the emergence of the Dajjal is the first of the major signs signaling the change of general conditions on most of the earth, ending with the death of Isa, peace be upon him. And the rising of the sun from its west is the first of the major signs signaling the change of the upper world, ending with the establishment of the Hour. Perhaps the emergence of the Beast occurs on that day when the sun rises from its west) (2). And Allah knows best. What appears is that the rising of the sun from its west precedes the emergence of the Beast, then the Beast emerges on that day or one close to it. As for the rest of the signs - the three Landslides and the Smoke - we do not know their order among the great signs, for we have not seen authentic texts determining that, and Allah knows best its reality (3). The Major Signs of the Hour: 1 - The False Messiah (Al-Masih Al-Dajjal): The trial of the Dajjal occurs at the end of time and is one of the major signs of the Hour. His trial is one of the greatest trials to pass over humanity throughout its history. For that reason, all Prophets warned their people of his trial, but our Messenger, peace and blessings be upon him, warned his nation about him the most. In Sahih Al-Bukhari from Abdullah bin Umar, may Allah be pleased with them both, said: The Messenger of Allah, peace and blessings be upon him, stood among the people, praised Allah with what He is worthy of, then mentioned the Dajjal, and said: «I warn you of him, and there is no Prophet before me except that he warned his people. But I will say to you about him a saying that no Prophet said to his people: He is one-eyed, and indeed Allah is not one-eyed...» (4). He was called Masih (Messiah) because his one eye is wiped (mamsuhah), and the Masih is the one who has no eye",
    "foot_note": "1. Sahih Muslim, Book of Tribulations, Chapter on the Emergence of the Dajjal (18/ 87 - with Al-Nawawi's explanation). \n2. Fath Al-Bari (11 - 353). \n3. See: Al-Yawm al-Akhir - Al-Qiyamah al-Sughra p. (217 - 220). \n4. Sahih Al-Bukhari, Book of Tribulations, Chapter: Mention of the Dajjal (18/ 61 - with Al-Fath).",
    "book_id": "51"
  },
  {
    "serial_number": "97978",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "or eyebrow on one side of his face except that it is leveled. It was said [he is called Masih] because he wipes (travels) the earth. As for Isa bin Maryam, he was called so because he did not wipe with his hand over anyone with an ailment except that he was healed - by Allah's permission - and other reasons were said) (1). It came in the Hadith: «The Dajjal is wiped of the eye» (2). He was called Dajjal (because he covers the truth with his falsehood. It is said: The camel is 'dajjal-ed' with tar if covered, and the vessel with gold if plated... Ibn Duraid said: He was called Dajjal because he covers the truth with lies. And it was said because of his roaming the regions of the earth... And it was said: Rather, it was said so because he covers the earth) (3). Description of the Dajjal: The Dajjal is a man from the sons of Adam. He has many attributes mentioned in the Hadiths to introduce him to the people and warn them of his evil, so that if he emerges, the believers will recognize him and not be tempted by him. Rather, they will be aware of his attributes which the Truthful One, peace and blessings be upon him, informed of. These attributes distinguish him from other people, so none is deceived by him except the ignorant one upon whom misery has been decreed; we ask Allah for safety. From Ibn Umar, may Allah be pleased with them both, that the Messenger of Allah, peace and blessings be upon him, said: «While I was sleeping, circumambulating the Kaaba, there was a man of wheatish complexion, lank hair, water dripping - or pouring - from his head. I said: Who is this? They said: The son of Maryam. Then I turned and there was a bulky man, red, curly-haired, one-eyed, as if his eye was a floating grape. They said: This is the Dajjal. The closest of people in resemblance to him is Ibn Qatan» a man from the tribe of Khuza'ah (4). And from Anas, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, who said: «No Prophet was sent except that he warned his nation of the one-eyed liar. Beware, he is one-eyed and indeed your Lord is not one-eyed, and written between his eyes is Kafir (Disbeliever)» (5). The Dajjal emerges from the East from a Persian land called Khurasan. From Abu Bakr Al-Siddiq, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, told us: «The Dajjal emerges from a land in the East called Khurasan, followed by people whose faces are like hammered shields» (6). The Companions asked the Messenger, peace and blessings be upon him, about the duration the Dajjal stays on earth. They said: How long will he stay on earth? He said: «Forty days: a day like a year, a day like a month, a day like a week, and the rest of his days are like your days.» We said: O Messenger of Allah, that day which is like a year, will the prayer of one day suffice us in it? He said: «No, estimate for it its measure» (7).",
    "foot_note": "1. See: Al-Nihayah fi Gharib al-Hadith (4/ 278 - 279). \n2. Sahih Muslim, Book of Tribulations and Signs of the Hour, Chapter: Mention of the Dajjal, (18/ 61 - with Al-Nawawi's explanation). \n3. See: Fath Al-Bari (13/ 91). \n4. Sahih Al-Bukhari, Book of Tribulations, Chapter: Mention of the Dajjal (13/ 90 - with Al-Fath), and Sahih Muslim, Book of Faith, Chapter: Mention of the Messiah son of Mary, peace be upon him, and the False Messiah (2/ 237 - with Al-Nawawi's explanation). \n5. Sahih Al-Bukhari, Book of Tribulations, Chapter: Mention of the Dajjal (13/ 91 - with Al-Fath). \n6. Sahih Sunan Al-Tirmidhi, Chapters on Tribulations, Chapter: What came regarding where the Dajjal emerges from (2/ 248). \n7. Sahih Muslim, Book of Tribulations, Chapter: Mention of the Dajjal (18/ 65 - with Al-Nawawi's explanation).",
    "book_id": "51"
  },
  {
    "serial_number": "97979",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "Allah has protected Mecca and Medina from the Dajjal. From Anas, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: «There is no land but the Dajjal will tread it, except Mecca and Medina. There is no passage among its passages but there are angels upon it in rows guarding it. Then Medina will shake with its people three times, and every disbeliever and hypocrite will go out to him» (1). Most of the followers of the Dajjal are Jews and women. From Uthman bin Abi Al-As, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: «Most of the followers of the Dajjal are Jews and women» (2). Ibn Sayyad and the Dajjal: Ibn Sayyad was a man from the Jews of Medina, his name was Saf. He resembled the Dajjal in many of his attributes. The opinions of scholars conflicted regarding him: Is he the False Messiah or not? For this reason, Al-Hafiz Ibn Hajar strived to reconcile the differing Hadiths, saying: (The closest reconciliation between what the Hadith of Tamim implies and Ibn Sayyad being the Dajjal is: That the Dajjal himself is the one Tamim saw bound, and that Ibn Sayyad was a devil who appeared in the form of the Dajjal during that period, until he went to Isfahan and concealed himself with his companion, until the time destined by Allah Almighty for his emergence comes) (3), and Allah knows best. Sheikh Ibn Uthaymeen, may Allah have mercy on him, said: (The correct view is that Ibn Sayyad is not the Dajjal who will be sent at the end of time. Rather, he is one of the Dajjals (imposters) resembling soothsayers in his fabrication and guessing, but he is not the Dajjal who will be sent when the Hour is established, whom Isa bin Maryam, peace and blessings be upon him, will kill (4). 2 - The Descent of Isa (Jesus), peace be upon him: His description, peace be upon him, came in the narrations, among them what Abu Huraira, may Allah be pleased with him, narrated: The Messenger of Allah, peace and blessings be upon him, said: «On the night I was taken on the Night Journey, I met Musa... and he described him until he said: And I met Isa... and he described him saying: Of medium height, red, as if he came out of a Dimas - meaning: the bath -» (5).",
    "foot_note": "1. Sahih Al-Bukhari, Book of the Virtues of Medina, Chapter: The Dajjal does not enter Medina (495 - with Al-Fath). \n2. Al-Haythami said: Al-Tabarani narrated it in Al-Awsat and its men are the men of the Sahih except Uqbah bin Mukram bin Uqbah Al-Dabbi, and he is trustworthy. Majma' Al-Zawaid (7/ 669). \n3. Fath Al-Bari (13/ 328). \n4. Fatawa Nur 'ala Al-Darb (4/ 2). \n5. Sahih Al-Bukhari, Book of the Stories of Prophets, Chapter: The Statement of Allah Almighty: {And mention in the Book, Mary}, (6/ 476 - with Al-Fath), and Sahih Muslim, Book of Faith, Chapter: The Night Journey of the Messenger of Allah, peace and blessings be upon him, and the Obligation of Prayers (2/ 232 - with Al-Nawawi's explanation).",
    "book_id": "51"
  },
  {
    "serial_number": "97980",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "Description of his descent, peace be upon him: After the emergence of the Dajjal and his corruption in the earth, Allah will send Isa, peace be upon him, and he will descend to the earth. His descent will be at the White Minaret east of Damascus, Syria. He will be wearing two Mahrud (dyed) garments (1), placing his hands on the wings of two angels. If he lowers his head, it drips, and if he raises it, beads like pearls descend from it. It is not permissible for a disbeliever to find the scent of his breath except that he dies, and his breath reaches as far as his sight ends. His descent will be upon the Victorious Group (Al-Ta'ifah Al-Mansurah), which fights for the truth and is gathered to fight the Dajjal. He will descend at the time of the Iqamah for prayer and will pray behind the leader of that group. In the long Hadith of Al-Nawwas bin Sam'an regarding the mention of the emergence of the Dajjal then the descent of Isa, peace be upon him, he, peace and blessings be upon him, said: «Then Allah sends the Messiah son of Mary, and he descends at the White Minaret east of Damascus, between two dyed garments, placing his hands on the wings of two angels. If he lowers his head, it drips, and if he raises it, beads like pearls descend. It is not permissible for a disbeliever to find the scent of his breath except that he dies, and his breath reaches as far as his sight ends. He will seek him - meaning: seek the Dajjal - until he catches him at the gate of Ludd and kills him. Then a people whom Allah has protected from him will come to Isa bin Maryam, and he will wipe their faces and tell them of their ranks in Paradise» (2). How Isa, peace be upon him, will rule: From Abu Huraira, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: «How will you be when the son of Mary descends among you and your Imam is from among you?!». Ibn Abi Dhi'b (3) said: Do you know what \"your Imam from among you\" means? I said: Will you tell me? He said: He will lead you by the Book of your Lord, Blessed and Exalted, and the Sunnah of your Prophet, peace and blessings be upon him (4) -. The meaning is not that he leads them in prayer, but rather the meaning is that he judges among them by the Book of Allah, Blessed and Exalted; meaning he leads them by the Book of Allah Almighty (5). The time of Isa, peace be upon him, is a time of security, peace, and prosperity. Allah sends abundant rain in it, the earth brings forth its fruit and blessing, wealth overflows, and spite, mutual hatred, and envy disappear. From Abu Huraira, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: «By Allah, the son of Mary will surely descend as a just ruler; he will break the cross, kill the swine, abolish the Jizyah, and the young she-camels (6) will be left and no one will strive for them. Spite, mutual hatred, and envy will surely disappear, and he will call to wealth, but no one will accept it» (7). Duration of his stay after his descent then his death: As for the duration of Isa's stay, peace be upon him, on earth after his descent, it came in some narrations that he stays for seven years, and in some forty years. From Abdullah bin Amr, may Allah be pleased with them both: «Then Allah sends Isa bin Maryam... then people remain for seven years with no enmity between two people. Then Allah sends a cold wind from the direction of Sham, and no one remains on the face of the earth having an atom's weight of good or faith in his heart except that it takes him» (8). In Abu Dawood: «He will stay on earth forty years, then he will die, and the Muslims will pray over him» (9). Both of these narrations are authentic, and this is problematic; unless the narration of seven years is interpreted as the duration of his stay after his descent, and that is added to his stay on earth before he was raised to the heaven, and his age at that time was thirty-three years according to the well-known view (10), and Allah knows best. 3 - Ya'juj and Ma'juj (Gog and Magog): The origin of Ya'juj and Ma'juj is from humans, from the offspring of Adam and Hawwa (Eve), peace be upon them. What indicates that they are from the offspring of Adam, peace be upon him, is what Al-Bukhari narrated from Abu Sa'id Al-Khudri, may Allah be pleased with him, from the Messenger of Allah, peace and blessings be upon him, who said: «Allah Almighty says: O Adam! He says: At Your service and at Your pleasure, and good is in Your hands. He says: Bring out the delegation of the Fire. He says: And what is the delegation of the Fire? He says: From every thousand, nine hundred and ninety-nine. At that time the young will turn grey, every pregnant female will drop her load, and you will see the people drunk, yet they are not drunk, but the punishment of Allah is severe.» They said: And which of us is that one? He said: «Rejoice, for from you is one man and from Ya'juj and Ma'juj are a thousand» (11). Allah, Blessed and Exalted, has informed that the barrier built by Dhul-Qarnayn prevents them from emerging {So they were unable to scale it, nor were they able to pierce it (97)} [Al-Kahf: 97]. He informed that this continues until the end of time when the promise of Allah comes, and He permits them to emerge. At that time, the barrier will be leveled, and they will emerge upon the people {But when the promise of my Lord comes, He will make it level, and the promise of my Lord is ever true (98)} [Al-Kahf: 98]. At that time, they will emerge in waves {And We will leave them that Day surging over each other} [Al-Kahf: 99] and that is near the Resurrection and the blowing of the Horn {And the Horn will be blown, and We will assemble them in one assembly (99)} [Al-Kahf: 99]. The Messenger, peace and blessings be upon him, informed that an opening was made in the barrier of Ya'juj and Ma'juj in his time. From Zainab bint Jahsh, may Allah be pleased with her, that the Messenger of Allah, peace and blessings be upon him, entered upon her one day terrified, saying: «La ilaha illa Allah, woe to the Arabs from an evil that has drawn near,",
    "foot_note": "1. Mahrudatan: Narrated with the un-dotted Dal and the dotted Dhal, and the un-dotted is more common. The meaning: wearing two Mahrud garments, meaning: two garments dyed with Wars then Saffron. See: Al-Nawawi's explanation of Sahih Muslim (18/ 67). \n2. Sahih Muslim, Book of Tribulations and Signs of the Hour, Chapter: Mention of the Dajjal (1867 - 68 - with Al-Nawawi's explanation). \n3. He is Muhammad bin Abdurrahman bin Al-Mughirah bin Abi Dhi'b Al-Qurashi Al-Amiri Abu Al-Harith Al-Madani, trustworthy, jurist, virtuous, from the seventh layer, died in year 58, and it was said year nine. Taqrib Al-Tahdhib p. 427. \n4. Sahih Al-Bukhari, Book of Stories of Prophets, Chapter: Descent of Isa bin Maryam peace be upon him (6/ 491 - with Al-Fath), and Sahih Muslim, Book of Faith, Chapter: Descent of Isa bin Maryam as a ruler (2/ 193 - with Al-Nawawi's explanation). \n5. See: Al-Yawm al-Akhir - Al-Qiyamah al-Sughra, p. 261. \n6. Al-Qilas: with Kasra on Qaf, plural of Qalus with Fatha on Qaf, which is the young she-camel. See: Al-Nihayah fi Gharib al-Hadith (4/ 88). \n7. Sahih Muslim, Book of Faith, Chapter: Descent of Isa peace be upon him (2/ 192 - with Al-Nawawi's explanation). \n8. Sahih Muslim Book of Tribulations and Signs of the Hour, Chapter: Mention of the Dajjal (18/ 75 - 76 - with Al-Nawawi's explanation). \n9. Sahih Sunan Abi Dawood, Book of Al-Malahim, Chapter: Emergence of the Dajjal (3/ 815). \n10. See: Al-Nihayah fi al-Fitan wa al-Malahim, p. 99. \n11. Sahih Al-Bukhari, Book of Prophets, Chapter: Story of Ya'juj and Ma'juj (6/ 382 - with Al-Fath).",
    "book_id": "51"
  },
  {
    "serial_number": "97981",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "an opening has been made today in the barrier of Ya'juj and Ma'juj like this» - and he made a circle with his two fingers: the thumb and the one next to it. Zainab said: I said, O Messenger of Allah, will we perish while the righteous are among us? He said: «Yes, if wickedness (Al-Khabath) increases» (1). Their emergence occurs after the descent of Isa, peace be upon him, and his defeat of the Dajjal. From Al-Nawwas bin Sam'an in his long Hadith, he said: The Messenger of Allah, peace and blessings be upon him, said: «Then a people whom Allah has protected from him - meaning from the Dajjal - will come to Isa bin Maryam, and he will wipe their faces and tell them of their ranks in Paradise. While he is like that, Allah reveals to Isa: I have brought out servants of Mine against whom no one has the ability to fight (2), so take My servants to safety to Al-Tur. And Allah sends Ya'juj and Ma'juj, and they swarm from every mound (3). Their first ones pass by Lake Tiberias and drink what is in it, and their last ones pass and say: There used to be water here once. Prophet of Allah Isa and his companions will be besieged until the head of a bull will be better for one of them than a hundred Dinars for one of you today. So Prophet of Allah Isa and his companions will beseech Allah, and Allah will send worms (4) in their necks, and they will die (Farsa) (5) like the death of a single soul. Then Prophet of Allah Isa and his companions will descend to the earth, and they will not find a hand span place in the earth except that it is filled with their putrefaction (6) and stench. So Prophet of Allah Isa and his companions will beseech Allah, and He will send birds like the necks of Bactrian camels (7), which will carry them and throw them where Allah wills. Then Allah will send rain which no house of clay (8) or hair (tent) will keep out, and it will wash the earth until it leaves it like a mirror (or smooth rock)» (9).",
    "foot_note": "1. Sahih Al-Bukhari, Book of Tribulations, Chapter: Ya'juj and Ma'juj (13/ 106 - with Al-Fath). \n2. Meaning: No power or capability. See: Al-Nawawi's explanation of Sahih Muslim (18/ 68). \n3. Al-Hadab: It is every rough, elevated place. The meaning is they appear from the rough and elevated ground. See: Al-Nihayah fi Gharib al-Hadith (1/ 336). \n4. Al-Naghaf: With movement (vowels), worms that are in the noses of camels and sheep, singular is Naghafah. Al-Nihayah fi Gharib al-Hadith (5/ 75). \n5. Farsa with Fatha on Fa', meaning: dead/slain. Singular is Faris, from when the wolf breaks (Farasa) the sheep's neck and preys on it when it kills it. Al-Nihayah fi Gharib al-Hadith (3/ 384). \n6. With Fatha on Ha', meaning their grease and their foul smell. Al-Nawawi's explanation on Muslim (17/ 69). \n7. Al-Bukht are long-necked camels, and it is an Arabized word. Al-Nihayah fi Gharib al-Hadith (1/ 101). \n8. Meaning: No house prevents the rain from falling. Al-Madar with Fatha on Mim and Dal is hard clay/mud. Al-Nawawi's explanation of Sahih Muslim (18/ 69). \n9. Sahih Muslim, Book of Tribulations and Signs of the Hour, Chapter: Mention of the Dajjal (18/ 68 - 69 - with Al-Nawawi's explanation).",
    "book_id": "51"
  },
  {
    "serial_number": "97982",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "4 - The Three Landslides: The meaning of Khasf (Landslide): It is said: The place Khasafa (swallowed/sunk), Yakhsifu, Khusufan if it goes into the earth and disappears into it (1). The three landslides which are among the signs of the Hour were mentioned in the Hadiths among the major signs. From Hudhayfah bin Asid, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: «It will not be established until you see ten signs before it... - and he mentioned among them - and three landslides: a landslide in the East, a landslide in the West, and a landslide in the Arabian Peninsula» (2). 5 - The Smoke: Among the major signs occurring shortly before the Hour is the Smoke. Allah Almighty said: {Then watch for the Day when the sky will bring a visible smoke (10) Covering the people; this is a painful punishment (11)} [Surah Ad-Dukhan: 10-11]. Regarding what is meant by this smoke? And has it occurred? Or is it among the awaited signs? There are two opinions for the scholars: First: That this smoke is what afflicted Quraysh of hardship and hunger when the Prophet, peace and blessings be upon him, invoked against them when they did not respond to him, so they began seeing the sky like smoke. Second: That this smoke is among the awaited signs that have not come yet, and it will occur near the establishment of the Hour. What indicates strongly that the Smoke is among the major signs is what Muslim narrated from Hudhayfah bin Asid, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: «It will not be established until you see ten signs before it... - and he mentioned among them - the Smoke» (3). However, some scholars held the view that they are two smokes; one appeared and the other remains, and it is the one that will occur at the end of time (4). And Allah knows best. 6 - The Rising of the Sun from its West: Among the clear signs indicating the occurrence of the Hour is the rising of the sun from its west. From Abu Huraira, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: «The Hour will not be established until the sun rises from its west. So when it rises and the people see it, they will all believe. That is when a soul will not benefit from its faith if it had not believed before or earned good through its faith» (5). 7 - The Emergence of the Beast: This Beast is a sign from the signs of Allah that emerges at the end of time, when evil increases and corruption becomes widespread, and good is scarce in",
    "foot_note": "1. Al-Qamus Al-Muhit p. 723. \n2. Its extraction preceded on p. 37. \n3. Its extraction preceded on p. 37. \n4. Al-Nawawi's explanation of Sahih Muslim (18/ 27). \n5. Sahih Al-Bukhari, Book of Al-Riqaq (11/ 352 - with Al-Fath), and Sahih Muslim, Book of Faith, Chapter: Explanation of the time when Allah does not accept faith (2/ 195 - with Al-Nawawi's explanation).",
    "book_id": "51"
  },
  {
    "serial_number": "97983",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "that time. This Beast is the one Allah mentioned in His saying: {And when the word befalls them, We will bring forth for them a creature from the earth speaking to them, [saying] that the people were, of Our verses, not certain (82)} [Al-Naml: 82]. From Abu Huraira, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: «Three, if they emerge, a soul will not benefit from its faith if it had not believed before or earned good through its faith: The rising of the sun from its west, the Dajjal, and the Beast of the earth» (1). 8 - The Fire that gathers people: It is the last of the major signs of the Hour, and the first of the signs signaling the establishment of the Hour. The narrations stated that the emergence of this fire will be from Yemen, from the bottom of Aden. It came in the Hadith of Hudhayfah bin Asid regarding the mention of the major signs of the Hour, his saying, peace and blessings be upon him: «And the last of that is a fire emerging from Yemen, driving the people to their gathering place» (2). When this great fire appears from Yemen, it spreads in the earth and drives people to the land of gathering. Those who are gathered are in three manners. From Abu Huraira, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, who said: «The people will be gathered in three manners: hoping and fearing; and two on a camel, and three on a camel, and four on a camel, and ten on a camel. And the rest of them will be gathered by the Fire; it will nap with them where they nap, stay the night with them where they stay the night, be with them in the morning where they are in the morning, and be with them in the evening where they are in the evening» (3). People will be gathered to Sham (Syria/Levant) in the end of time, and it is the land of gathering, as the Hadiths stated. Among them is what was narrated from Ibn Umar - may Allah be pleased with them both - regarding the mention of the emergence of the fire, and in it: He said: O Messenger of Allah! So what do you command us? He said: «Stick to Sham» (4). This gathering happens in the world before the Day of Resurrection. Scholars said: (This gathering is at the end of the world just before the Resurrection and before the blowing of the Horn, evidenced by his saying - peace and blessings be upon him: «The rest of them will be gathered by the Fire; it will stay the night with them and nap and be with them in morning and evening») (5), and Allah knows best.",
    "foot_note": "1. Sahih Muslim, Book of Faith, Chapter: The time when faith is not accepted (2/ 195 – with Al-Nawawi's explanation) \n2. Its extraction preceded on p. 37. \n3. Sahih Al-Bukhari, Book of Al-Riqaq, Chapter: The Gathering (11/ 377 – with Al-Fath), and Sahih Muslim, Book of Paradise and Description of its Bliss, Chapter: The perishing of the world and explanation of the Gathering on the Day of Resurrection (17/ 194 - 195 – with Al-Nawawi's explanation). \n4. Sahih Sunan Al-Tirmidhi, Chapters on Tribulations, Chapter: The Hour will not be established until a fire emerges from the direction of Hijaz (2/ 243). \n5. Al-Nawawi's explanation of Sahih Muslim (17/ 194 - 195).",
    "book_id": "51"
  },
  {
    "serial_number": "97984",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "Chapter Three: The Facts Included in Belief in the Last Day (1) Topic One: The Resurrection (Al-Ba'th) (2) The Quran gave great attention to the scenes of the Day of Resurrection: the Resurrection and the Reckoning, and the Bliss and the Punishment. So that other world which people were promised after this present world did not remain just described, but became pictured and tangible, living and moving, prominent and looming. The Muslims lived in this world a complete life; they saw its scenes and were affected by them. Their hearts beat fast at times, their skins shivered at times, panic flowed in their souls once, and tranquility returned to them another time. Thus, they came to know this world as it was reported in the Book and the Sunnah before the Promised Day. This world is simple in all simplicity, clear as the clarity of the Islamic creed: death and resurrection, bliss and punishment. As for those who believed and did righteous deeds, for them is Paradise with what is in it of bliss. And as for those who disbelieved and denied the meeting with Allah, for them is the Fire with what is in it of hell. There is no intercession there, nor ransom from the punishment, nor the slightest imbalance in the scale of precise justice. Allah Almighty said: {So whoever does an atom's weight of good will see it (7) And whoever does an atom's weight of evil will see it (8)} [Surah Az-Zalzalah: 7-8]. Indeed, the Quran speaks to the believers about the Last Day and embodies it for them as if they see it right now before them, and live its living scenes with their conscience. Indeed, the Quran's miracle in depicting the scenes of the Day of Resurrection reached such an extent that a person feels as if the Day of Resurrection is the standing present, and as if the world is a past that has elapsed and folded away a long time ago. (Belief in Allah and the Last Day includes belief in the Origin and the Return, which is belief in Creation and Resurrection, just as He combined them in His saying: {And of the people are some who say, \"We believe in Allah and the Last Day,\" but they are not believers (8)} [Al-Baqarah: 8], and He Almighty said: {Your creation and your resurrection are only as a single soul} [Luqman: 28]) (3). The intended meaning of Resurrection (Ba'th) is the bodily return, and the reviving of servants on the Day of Return. So when Allah Blessed and Exalted wills the return of the servants and their revival, He commands Israfil, so he blows into the Horn, and the souls return to the bodies, and people stand for the Lord of the Worlds {And the Horn will be blown, and whoever is in the heavens and whoever is on the earth will fall dead except whom Allah wills. Then it will be blown again, and at once they will be standing, looking on (68)} [Az-Zumar: 68]. Allah Blessed and Exalted has informed us about the scene of Resurrection saying: {And the Horn will be blown; and at once from the graves to",
    "foot_note": "1. See: Arkan al-Iman (Pillars of Faith), pp. 44 - 63. \n2. See: Umar Al-Ashqar, Al-Yawm al-Akhir - Al-Qiyamah al-Kubra, pp. 51 - 68, 6th ed., Dar Al-Nafais, Jordan, 1415 AH. \n3. Ibn Taymiyyah, Al-Fatwa Al-Hamawiyyah, p. 35, Intro by: Muhammad Hamza, Al-Madani Press, Egypt.",
    "book_id": "51"
  },
  {
    "serial_number": "97985",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "their Lord they will hasten (51) They will say, \"O woe to us! Who has raised us up from our sleeping place?\" [The reply will be], \"This is what the Most Merciful had promised, and the messengers told the truth.\" (52) It will not be but one blast, and at once they are all brought present before Us (53)} [Surah Yasin: 51-53]. The Hadiths came informing that preceding the second blowing into the Horn is the descent of water from the sky, from which the bodies of the servants will grow. From Abdullah bin Amr, may Allah be pleased with them both, who said: The Messenger of Allah, peace and blessings be upon him, said: «Then the Horn will be blown, and no one will hear it except that he tilts his neck (1) and raises his neck. He said: And the first to hear it is a man plastering the basin of his camels. He said: So he will fall dead, and the people will fall dead. Then Allah sends - or he said Allah sends down - rain like dew or shadow, from which the bodies of people will grow. Then it is blown again, and at once they will be standing, looking on» (2). Man is formed in the Last Day from a small bone, which is the tailbone (Ajb al-Dhanab). From Abu Huraira, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: «Between the two blowings is forty. Then water comes down from the sky, and they grow as vegetation grows. There is nothing of the human but it decays, except one bone, which is the tailbone (3); from it creation is assembled on the Day of Resurrection» (4). It is known that the bodies of the Prophets are not affected by the decay and annihilation that affects the bodies of servants, for in the Hadith: «Allah has forbidden the earth to consume the bodies of the Prophets» (5). The Resurrection here is a return (recreation) and not a renewal (new creation), as He Almighty said: {He says, \"Who will give life to bones while they are disintegrated?\" (78) Say, \"He will give them life who produced them the first time} [Surah Yasin: 78-79], and He Almighty said: {As We began the first creation, We will repeat it} [Al-Anbiya: 104]. And because if it were a new creation, the body that did evil deeds in the world would be safe from punishment, and a new body would be brought and punished, and this is contrary to justice. Text and reason have indicated that Resurrection is not renewal but repetition) (6). The first one whom the earth will split open for is our Prophet Muhammad, peace and blessings be upon him. From Abu Huraira, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said",
    "foot_note": "1. Al-Layt: With Kasra on Lam and ending with Ta' with two dots above, is the side of the neck. Asgha means tilted. Al-Nawawi's explanation of Sahih Muslim (18/ 76). \n2. Sahih Muslim, Book of Tribulations and Signs of the Hour, Chapter: Mention of the Dajjal (18/ 68). \n3. Ajb al-Dhanab: Al-Ajb with Sukun, the bone at the bottom of the spine at the rump, which corresponds to the tail bone in animals. Al-Nihayah fi Gharib al-Hadith (3/ 167). \n4. Sahih Al-Bukhari, Book of Quran Interpretation, Chapter {The Day the Horn will be blown} (8/ 689 - with Al-Fath). \n5. Sahih Sunan Abi Dawood, Book of Prayer, Chapter: Virtue of Friday and Friday Night (1/ 196). \n6. Arkan Al-Iman, p. 44.",
    "book_id": "51"
  },
  {
    "serial_number": "97986",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": ": «I am the master of the children of Adam on the Day of Resurrection, and the first whom the grave splits open for, and the first intercessor and the first whose intercession is accepted» (1). Wherever the servants perished, Allah is capable of bringing them forth. Allah Almighty said: {Wherever you may be, Allah will bring you forth all together. Indeed, Allah is over all things competent} [Al-Baqarah: 148]. And He Almighty said: {And We will gather them and not leave behind from them anyone (47)} [Al-Kahf: 47]. Allah gathers all creatures barefoot, naked, and uncircumcised. From Aisha, may Allah be pleased with her, who said: I heard the Messenger of Allah, peace and blessings be upon him, say: «The people will be gathered on the Day of Resurrection barefoot, naked, and uncircumcised.» She said: O Messenger of Allah, men and women together, looking at one another? He said: «O Aisha, the matter is too severe for them to look at one another...» (2). But people are not equal on that difficult Day. Rather, their conditions differ according to their deeds. Allah Almighty said: {[Some] faces, that Day, will be radiant, (22) Looking at their Lord. (23) And [some] faces, that Day, will be contorted, (24) Expecting that there will be done to them [something] backbreaking. (25)} [Surah Al-Qiyamah: 22-25]. And He Almighty said: {And on the Day of Resurrection you will see those who lied about Allah [with] their faces blackened} [Az-Zumar: 60]. And He Almighty said: {The Day We will gather the righteous to the Most Merciful as a delegation (85) And will drive the criminals to Hell in thirst (86)} [Surah Maryam: 85-86]. The earth upon which the servants are gathered on the Day of Resurrection is another earth other than this earth. Allah Almighty said: {[It will be] on the Day the earth will be replaced by another earth, and the heavens [as well], and all will come out before Allah, the One, the Prevailing (48)} [Ibrahim: 48]. The Messenger, peace and blessings be upon him, told us about the description of this new earth upon which the gathering will be. From Sahl bin Sa'd, may Allah be pleased with him, who said: I heard the Messenger of Allah, peace and blessings be upon him, say: «People will be gathered on the Day of Resurrection on a reddish-white land like a pure loaf of bread, having no landmark for anyone (3)» (4). The time when this replacement takes place is the time of people passing over the Sirat (Bridge) or shortly before that. From",
    "foot_note": "1. Sahih Muslim, Book of Virtues, Chapter: Virtue of the lineage of the Prophet peace be upon him (15/ 37 - with Al-Nawawi's explanation). \n2. Sahih Al-Bukhari, Book of Al-Riqaq, Chapter: The Gathering (11/ 377 - with Al-Fath), Sahih Muslim, Book of Paradise and Description of its Bliss and People, Chapter: The perishing of the world and explanation of the Gathering on the Day of Resurrection (17/ 193). \n3. Al-'Afra': With the un-dotted 'Ain and Madd, white tending towards redness. Al-Naqi: With Fatha on Nun, Kasra on Qaf and Shadda on Ya', is pure flour (Huwwari), which is Darmak, meaning good land. \"No landmark for anyone\" means no sign of habitation, building, or trace. See: Al-Nawawi's explanation of Sahih Muslim (17/ 134). \n4. Sahih Al-Bukhari, Book of Al-Riqaq, Chapter: Allah grasps the earth (11/ 372 - with Al-Fath), and Sahih Muslim, Book of Description of Resurrection, Paradise and Fire, Chapter: Resurrection and Rising (4/ 215 - with Al-Nawawi's explanation).",
    "book_id": "51"
  },
  {
    "serial_number": "97987",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "Aisha, may Allah be pleased with her, said: I asked the Messenger of Allah, peace and blessings be upon him, about the saying of Allah Almighty: {On the Day the earth will be replaced by another earth, and the heavens [as well]}, so where will the people be? He said: «On the Sirat (Bridge)» (1). The doubt of the deniers of Resurrection and the refutation against them: Since the issue of Resurrection and Reckoning, and the restoration of life to the dead after the disintegration of those bodies and their mixing with parts of the earth, is one of the major issues in which the polytheists went astray and considered its occurrence unlikely, and this unlikelihood necessitated the wonder of the deniers of Resurrection regarding its occurrence from those who say it and believe in its occurrence. Allah Almighty said, clarifying and explaining the wonder of these deniers: {Qaf. By the honored Qur'an. (1) But they wonder that there has come to them a warner from among themselves, and the disbelievers say, \"This is an amazing thing. (2) When we have died and become dust, is that a far return?\" (3)} [Surah Qaf: 1-3]. The greatest doubt among the deniers of Resurrection is: considering it unlikely to restore bodies after they have been torn apart, crumbled, and then mixed with parts of the earth. As they become envisioned in the form of dust, so how can they be returned to the state they were in before?) (2) Their poet expressed that denial, indicating that talking about it is a myth, saying: Life then death then resurrection ... ** ... is a myth O Umm Amr Does Ibn Kabsha promise me that we will live ... ** ... and how can there be life for owls and skulls (3) Evidences for Resurrection (4): Belief in the Return is indicated by the Book, the Sunnah, Reason, and sound Fitrah (innate nature). There is no validity to what the misguided claim that minds negate the occurrence of Resurrection and Rising, for minds do not prevent its occurrence, and Prophets do not come with what minds deem impossible, even if they come with what baffles the minds.",
    "foot_note": "1. Sahih Muslim, Book of Description of Resurrection, Paradise and Fire, Chapter: Resurrection and Rising (17/ 134 - with Al-Nawawi's explanation). \n2. See: Ali Al-Faqihi, Manhaj Al-Quran fi Al-Da'wah ila Al-Iman, p. 289, 1st ed., 1405 AH. \n3. See: Al-Shi'r wa Al-Shu'ara (2/ 796), Muhadarat Al-Udaba wa Muhawarat Al-Shu'ara wa Al-Bulagha (2/ 436). \n4. See: Al-Yawm al-Akhir - Al-Qiyamah al-Kubra, pp. 73 - 86.",
    "book_id": "51"
  },
  {
    "serial_number": "97988",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "Among the ways of the Quran in affirming the Return is (Reporting the perfection of Allah Almighty's power and the effectiveness of His will, and that nothing incapacitates Him; so restoring servants after their death is one of the individual effects of His power. Among them is reminding servants of the first origin, and that He who created them when they were not a mentioned thing must restore them as He began them. Among them is His reviving of the lifeless dead earth after its death, and that He who revived it will revive the dead. He affirmed that by His power over what is greater than that, which is the creation of the heavens and earth and great creatures. He affirmed that by the vastness of His knowledge and perfection of His wisdom, and that it is not befitting of Him nor good that He leaves His creation in vain, neglected, not commanded nor forbidden, nor rewarded nor punished; and this is a way by which He affirmed Prophethood and the matter of Return. And among what He affirmed Resurrection with: Recompensing the good-doers with their good and the evildoers with their evil, what He reported of His days among past nations and bygone centuries, and how He saved the Prophets and their followers and destroyed those who denied them and denied the Resurrection, and diversified punishments upon them and brought about exemplary punishments on them. This is an expedited recompense and a model of the Hereafter's recompense shown by Allah to His servants so that those who perished would perish upon evidence and those who lived would live upon evidence. Among that is what Allah showed His servants of His reviving the dead in this world, as Allah mentioned regarding the owner of the cow, the thousands of the Children of Israel, the one who passed by a town which had fallen into ruin, the story of Ibrahim the Friend and the birds, Isa bin Maryam reviving the dead, and other things Allah showed His servants in this abode so they know that He is Strong, Possessor of Ability, and that the servants must be returned, and the settlement is either in Paradise or Fire. These meanings Allah initiated and repeated in many places, and Allah knows best) (1). Among the evidences proving Resurrection and Rising are the following: First: The report of the All-Knowing, the All-Aware about the occurrence of Resurrection: The greatest evidence indicating the occurrence of the Return is the report of Allah Blessed and Exalted about that. So whoever believes in Allah, and confirms His Messenger whom He sent, and His Book which He revealed, has no escape from believing in what He informed us of Resurrection, Rising, Recompense, Reckoning, Paradise, and Fire. Allah Blessed and Exalted diversified the styles of reporting to be more impactful on the souls and more emphasized in the hearts. In some places, the talk about it is a bare statement, Allah Almighty said: {Allah begins creation; then He will repeat it; then to Him you will be returned (11)} [Ar-Rum: 11], and He Almighty said: {And the Day they are returned to Him, He will inform them of what they did} [An-Nur: 64]. Sometimes He emphasizes its occurrence with \"Inna\" (Indeed), like His saying Almighty: {Indeed, the Hour is coming} [Ta-Ha: 15], and sometimes with \"Inna\" and \"Lam\", Allah Almighty said: {And indeed, the Hour is coming, so forgive with gracious forgiveness (85)} [Al-Hijr: 85], and He Almighty said: {Indeed, the term of Allah is coming. And He is the Hearing, the Knowing (5)} [Al-Ankabut: 5]. In some places, He negates doubt and skepticism about its occurrence, Allah Almighty said: {Indeed, the Hour is coming, no doubt about it, but most of the people do not believe (59)} [Ghafir: 59]. In some verses, Allah Almighty swears that it is coming and occurring, sometimes by Himself, Allah Almighty said: {Allah - there is no deity except Him. He will surely assemble you for the Day of Resurrection} [An-Nisa: 87], and sometimes by His great creations, Allah Almighty said: {By those [winds] scattering [dust] dispersing (1) And those [clouds] carrying a load [of water] (2) And those [ships] sailing with ease (3) And those [angels] apportioning [each] matter (4) Indeed, what you are promised is true (5) And indeed, the Recompense is to occur (6)} [Surah Adh-Dhariyat: 1-6].",
    "foot_note": "1. Ibn Sa'di, Al-Qawa'id Al-Hisan fi Tafsir Al-Quran, pp. 15 - 16.",
    "book_id": "51"
  },
  {
    "serial_number": "97989",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "In some places, He commands His Messenger in the field of arguments and disputes to swear by his Lord emphasizing its occurrence: {But those who disbelieve say, \"The Hour will not come to us.\" Say, \"Yes, by my Lord, it will surely come to you\"} [Saba: 3]. In some verses, He informs that it is true {Indeed, the promise of Allah is truth, so let not the worldly life delude you and be not deluded about Allah by the Deceiver} [Surah Fatir: 5] ... to other styles. Second: Reasoning for the Second Creation by the First Creation: Those who ask for proof of Resurrection after death overlook the fact that their creation in this manner is the greatest proof. The One capable of creating them is capable of repeating their creation. Allah Almighty said: {And the human says, \"When I have died, am I going to be brought forth alive?\" (66) Does man not remember that We created him before, while he was nothing? (67)} [Surah Maryam: 66-67], and He Almighty said: {And it is He who begins creation; then He repeats it, and that is easier for Him. To Him belongs the highest attribute in the heavens and earth. And He is the Exalted in Might, the Wise (27)} [Ar-Rum: 27]. Third: The One capable of creating the Greater is capable of creating what is less than it: Allah Almighty said: {Do they not see that Allah, who created the heavens and earth and did not fail in their creation, is able to give life to the dead? Yes. Indeed, He is over all things competent (33)} [Al-Ahqaf: 33], and He Almighty said: {The creation of the heavens and earth is greater than the creation of} [Ghafir: 57]. Ibn Taymiyyah said: (For it is known by the axiom of intellects that the creation of the heavens and earth is greater than the creation of the likes of the sons of Adam, and the ability to do so is more profound, and that this easier thing is more worthy of possibility and ability than that) (1). Fourth: His Ability, Blessed and Exalted, to transform creation from one state to another: Allah Blessed and Exalted clarified in more than one place that part of the perfection of His Divinity, Lordship, Names, and Attributes is His ability to transform creation from one state to another. Thus, He causes death and gives life, creates and annihilates, brings out the living from the dead, and the dead from the living. Allah Almighty said: {Indeed, Allah is the cleaver of grain and date seeds. He brings the living out of the dead and brings the dead out of the living. That is Allah; so how are you deluded? (95) [He is] the cleaver of daybreak and has made the night for rest and the sun and moon for calculation. That is the determination of the Exalted in Might, the Knowing (96)} [Surah Al-An'am: 95-96]. Indeed, the turning of servants: death then life, then death then life, is a great proof of Allah's power causing souls to submit to His greatness and authority. Allah Almighty said: {How can you disbelieve in Allah when you were lifeless and He brought you to life; then He will cause you to die, then He will bring you [back] to life, and then to Him you will be returned} [Al-Baqarah: 28].",
    "foot_note": "1. Majmu' Fatawa Sheikh Al-Islam: 3/ 299.",
    "book_id": "51"
  },
  {
    "serial_number": "97990",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "Fifth: Reviving some dead in this life: Allah showed His servants the reviving of the dead in this world. Examples of this include: The people of Musa when they said to him: We will not believe you until we see Allah outright, so Allah caused them to die then revived them. Allah Almighty said addressing the Children of Israel: {And [recall] when you said, \"O Moses, we will never believe you until we see Allah outright\"; so the thunderbolt took you while you were looking on. (55) Then We revived you after your death that perhaps you would be grateful (56)} [Surah Al-Baqarah: 55-56]. And Isa, peace be upon him, used to create from clay the form of a bird then breathe into it, and it would become a bird by Allah's permission, and he used to revive the dead by Allah's permission. Allah Almighty said: {And [make him] a messenger to the Children of Israel, [who will say], 'Indeed I have come to you with a sign from your Lord in that I design for you from clay [that which is] like the form of a bird, then I breathe into it and it becomes a bird by permission of Allah. And I cure the blind and the leper, and I give life to the dead - by permission of Allah. And I inform you of what you eat and what you store in your houses. Indeed in that is a sign for you, if you are believers} [Surah Ali Imran: 49]. Sixth: Striking a parable by reviving the earth with vegetation: The earth is dead and lifeless with no green tree in it, then rain falls upon it, and it stirs living and green with every beautiful pair. The One capable of reviving it after its death is capable of reviving the dead. Allah Almighty said: {And of His signs is that you see the earth stilled, but when We send down upon it rain, it quivers and grows. Indeed, He who has given it life is the Giver of Life to the dead. Indeed, He is over all things competent (39)} [Fussilat: 39]. Seventh: Allah's wisdom requires resurrecting servants for Recompense and Reckoning: Allah's wisdom and justice require that He resurrects His servants to recompense them for what they presented. For Allah created creation for His worship, sent Messengers, and revealed Books to clarify the path by which they worship Him. So among the servants are those who remained steadfast in obedience to Allah and spent themselves and their wealth in that path. And among them are those who refused steadfastness in obedience to Allah, transgressed, and oppressed. Is it fitting after that for the righteous and the wicked to die, and Allah not reward the good-doer for his good and the evildoer for his evil? Allah Almighty said: {Then will We treat the Muslims like the criminals? (35) What is [the matter] with you? How do you judge? (36) Or do you have a scripture in which you learn (37) That indeed for you is whatever you choose?} [Surah Al-Qalam: 35-38]. Indeed, the misguided disbelievers are those who think that the universe was created in vain and falsehood without wisdom, and that there is no difference between the fate of the reforming believer and the corrupting disbeliever, nor between the fate of the pious and the libertine. Allah Almighty said: {And We did not create the heaven and the earth and that between them aimlessly. That is the assumption of those who disbelieve, so woe to those who disbelieve from the Fire. (27) Or should we treat those who believe and do righteous deeds like corrupters in the land? Or should We treat those who fear Allah like the wicked? (28)} [Surah Sad: 27-28].",
    "foot_note": "None",
    "book_id": "51"
  },
  {
    "serial_number": "97991",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "The Horrors of the Day of Resurrection: Many verses of the Quran affirm that massive astronomical events will take place on that Day. All of them point to a complete change in the system binding the parts of this visible universe, its orbits, and its stars. And to an inversion in its conditions, forms, and connections, marking the end of this world. It is an inversion not limited to the Earth, but includes the stars, planets, and orbits. Allah Almighty said: {When the sun is wrapped up (1) And when the stars fall, dispersing (2) And when the mountains are removed (3) And when full-term she-camels are neglected (4) And when the wild beasts are gathered (5) And when the seas are filled with flame (6)} [Surah At-Takwir: 1-6], ... {When the sky breaks apart (1) And when the planets fall, scattering (2) And when the seas are erupted (3) And when the [contents of] graves are scattered (4)} [Surah Al-Infitar: 1-4], ... {When the sky has split (1) And has listened to its Lord and was obligated [to do so] (2) And when the earth has been extended (3) And has cast out that within it and relinquished [it] (4) And has listened to its Lord and was obligated [to do so] (5)} [Surah Al-Inshiqaq: 1-5], ... {And when the heaven is split open and becomes rose-colored like oil} [Ar-Rahman: 37], ... {When the earth is shaken with convulsion (4) And the mountains are broken down, crumbling (5) And become dust dispersing} [Surah Al-Waqi'ah: 4-6], ... {Then when the Horn is blown with one blast (13) And the earth and the mountains are lifted and leveled with one blow (14) Then on that Day, the Resurrection will occur (15) And the heaven will split [open], for that Day it is infirm (16)} [Surah Al-Haqqah: 13-16], ... {The Day the sky will be like murky oil (8) And the mountains will be like wool} [Surah Al-Ma'arij: 8-9], ... {When the earth is shaken with its [final] earthquake (1) And the earth discharges its burdens (2)} [Surah Az-Zalzalah: 1-2], ... {It is the Day people will be like moths, dispersed (4) And the mountains will be like wool, fluffed up (5)} [Surah Al-Qari'ah: 4-5], ... {Then watch for the Day when the sky will bring a visible smoke (10) Covering the people; this is a painful punishment (11)} [Surah Ad-Dukhan: 10-11], ... {On the Day the earth and the mountains will convulse and the mountains will become a heap of sand pouring down (14)} [Al-Muzzammil: 14], ... {The heaven will break apart therefrom; ever is His promise fulfilled (18)} [Al-Muzzammil: 18], ... {When the earth has been leveled - pounded and crushed (21) And your Lord has come} [Al-Fajr: 21], ... {So when vision is dazzled (7) And the moon darkens (8) And the sun and the moon are joined (9)} [Surah Al-Qiyamah: 7-9], ... {Then when the stars are obliterated (8) And when the heaven is cleft asunder (9) And when the mountains are blown away (10)} [Surah Al-Mursalat: 8-10], ... {And they ask you about the mountains, so say, \"My Lord will blow them away with a blast. (105) And He will leave the earth a level plain; (106) You will not see therein a depression or an elevation.\" (107)} [Surah Ta-Ha: 105-107], ... {And you see the mountains, thinking them rigid, while they will pass as the passing of clouds} [An-Naml: 88], ... {And the Day We will cause the mountains to pass away and you will see the earth prominent} [Al-Kahf: 47], ... {[It will be] on the Day the earth will be replaced by another earth, and the heavens [as well]} [Ibrahim: 48], ... {The Day We will fold the heaven like the folding of a [written] sheet for the records} [Al-Anbiya: 104], ... {And the Day the heaven will split open with [emerging] clouds, and the angels will be sent down in successive descent (25) True sovereignty, that Day, is for the Most Merciful. And it will be upon the disbelievers a difficult Day (26)} [Surah Al-Furqan: 25-26]. All these verses predict that the end of this world will be a horrific end, in which the earth will quake and be leveled, the mountains will be blown away, and the seas will explode. Likewise, the stars will be obliterated and fall, the sky will split and break apart, the planets will shatter and scatter, distances will be disrupted bringing the sun and moon together, and the sky will appear sometimes like smoke and sometimes red flaming... up to the end of this terrible cosmic horror... {And it will be upon the disbelievers a difficult Day (26)} [Al-Furqan: 26] with what it contains of terror and what it contains of punishment.",
    "foot_note": "None",
    "book_id": "51"
  },
  {
    "serial_number": "97992",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "And He Almighty has described the situation of Resurrection with the severity of all that (1), as He Almighty said: {Do they not think that they will be resurrected (4) For a tremendous Day - (5) The Day when mankind will stand before the Lord of the worlds?} [Surah Al-Mutaffifin: 4-6], and He Almighty said: {And never think that Allah is unaware of what the wrongdoers do. He only delays them for a Day when eyes will stare [in horror]. (42) Racing ahead, their heads raised up, their glance does not come back to them, and their hearts are void (43)} [Surah Ibrahim: 42-43], and He Almighty said: {To Him in a Day the extent of which is fifty thousand years} [Al-Ma'arij: 4] - up to His saying - {(9) And no friend will ask [anything of] a friend, (10) They will be shown each other. The criminal will wish that he could be ransomed from the punishment of that Day by his children (11) And his wife and his brother (12) And his nearest kindred who shelter him (13) And whoever is on earth entirely [so] then it could save him (14)} [Surah Al-Ma'arij: 10-14], and He Almighty said: {The Horn (8) That Day will be a difficult day (9) For the disbelievers, not easy} [Surah Al-Muddaththir: 9-10], and He Almighty said: {And fear a Day whose evil will be widespread (7)} [Al-Insan: 7] - up to His saying - {Indeed, We fear from our Lord a Day austere and distressful. (10) So Allah will protect them from the evil of that Day and give them radiance and happiness (11)} [Surah Al-Insan: 10-11], and He Almighty said: {Indeed, these [disbelievers] love the immediate and leave behind them a grave Day (27)} [Al-Insan: 27]. In the Sahih from Ibn Umar, may Allah be pleased with them both, from the Prophet, peace and blessings be upon him, who said: «The Day when mankind will stand before the Lord of the worlds, he said: One of them will stand in his sweat up to halfway to his ears» (2). Topic Two: The Nearness of the Sun to the Creatures Part of belief in the Last Day is to believe that the sun will draw near to the creatures by the measure of a mile. The mile could mean the needle of the kohl container, or it could mean the distance measure on earth. Whether it is the kohl needle or the distance mile, the sun will be close to the heads. From Al-Miqdad, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: «The sun will be brought near the creation on the Day of Resurrection until it is about a mile from them. People will be in sweat according to their deeds; some will be in sweat up to their ankles, some up to their knees, some up to their waists (3), and some will be bridled by sweat completely» (4). Topic Three: Holding Creatures Accountable for Their Deeds Also included in belief in the Last Day is believing that creatures will be held accountable for their deeds. Allah named the Day of Resurrection the Day of Reckoning, because it is the day man is held accountable for his work. The reckoning is a reckoning of favor, kindness, and generosity for the believer; for Allah, Glory be to Him and the Most High, takes account of the believer, secludes him, places His covering over him - meaning His screen - and makes him confess his sins, saying to him: You did such and such on such and such day, until he admits and confesses. When he admits and confesses, Allah, Glory be to Him and the Most High, says to him: «I screened it for you in the world and I forgive it for you today» (5). As for the disbelievers - and we seek refuge in Allah - they are not reckoned with this reckoning, rather they are confronted with their deeds, and He says: You did such and such. If they deny, their tongues, hands, and feet testify against them regarding what they used to do. Even the skins testify, so they say to their skins: {And they will say to their skins, \"Why have you testified against us?\" They will say, \"We were made to speak by Allah, who has made everything speak; and He created you the first time, and to Him you are returned. (21) And you were not covering yourselves, lest your hearing testify against you or your sight or your skins, but you assumed that Allah does not know much of what you do. (22) And that was your assumption which you assumed about your Lord. It has brought you to ruin, and you have become among the losers.\" (23) So [even] if they are patient, the Fire is a residence for them; and if they ask to appease [Allah], they will not be of those who are allowed to appease (24)} [Surah Fussilat: 21-24]. The disbelievers confront their deeds and are disgraced by them, and it is called out before the witnesses: {These are the ones who lied about their Lord; unquestionably, the curse of Allah is upon the wrongdoers (18)} [Hud: 18]. A multitude that none can count but Allah is saved from this reckoning. The Prophet, peace and blessings be upon him, said: «His nation was presented to him, and among them are seventy thousand who will enter Paradise without reckoning or punishment; they are those who do not seek Ruqyah (incantations), do not use branding (cauterization), do not believe in bad omens, and rely upon their Lord» (6).",
    "foot_note": "1. See: Hafiz Al-Hakami, Ma'arij Al-Qabul bi Sharh Sullam Al-Wusul ila 'Ilm Al-Usul, p. (2/ 816), 3rd ed., verification: Umar Mahmud Abu Umar, Dar Ibn Al-Qayyim, 1414 AH. \n2. Sahih Muslim, Book of Paradise and Description of its Bliss and People, Chapter: Description of the Day of Resurrection, (17/ 195 - with Al-Nawawi's explanation). \n3. Haqwayhi: With Fatha on Ha' and Kasra, is the place where the lower garment is tied. The meaning here is what aligns with that place on his side. Al-Nawawi's explanation of Sahih Muslim (17/ 180 - 181). \n4. Sahih Muslim, Book of Paradise and Description of its Bliss and People, Chapter: Description of the Day of Resurrection (17/ 196 - with Al-Nawawi's explanation). \n5. Sahih Al-Bukhari, Book of Al-Mazalim, Chapter: The statement of Allah Almighty: {Unquestionably, the curse of Allah is upon the wrongdoers}, (5/ 96 – with Al-Fath). \n6. Sahih Al-Bukhari, Book of Al-Riqaq, Chapter: Seventy thousand enter Paradise without reckoning (11/ 405 - with Al-Fath).",
    "book_id": "51"
  },
  {
    "serial_number": "97993",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "Topic Four: The Balance (Mizan) What is included in belief in the Last Day: The Balance. Allah Almighty said: {And the weighing [of deeds] that Day will be the truth} [Al-A'raf: 8], and He Almighty said: {And We place the scales of justice for the Day of Resurrection} [Al-Anbiya: 47]. The Balance according to Ahl al-Sunnah is a real balance by which the deeds of servants are weighed. Ibn Hajar said: \"Al-Zajjaj said: Ahl al-Sunnah agreed on belief in the Balance, and that the deeds of servants are weighed by it on the Day of Resurrection, and that the Balance has a tongue and two pans and tilts with deeds\" (1). (The mention of weighing and scales has appeared in many verses of the Quran, and the sum of texts indicates that the worker, the work, and the scroll are weighed, and there is no contradiction between them, for all are weighed, but the consideration in heaviness and lightness is by the deed itself, not by the essence of the worker nor by the scroll, and Allah knows best) (2). And recompensing people for their deeds, their Jinn and their humans, Allah sets up the scales and weighs the deeds of servants. So this one's scale is heavy and he is the happy one, and this one's scale is light and he is the perished one. And this one is given his book in his right hand and he is the happy one, and this one is given his book in his left hand and he is the wretched one, we ask Allah for safety and well-being. Scholars differed regarding the Balance: is it one or multiple? There are two opinions; this is because the texts came regarding the Balance sometimes in singular and sometimes in plural, like His saying Almighty: {And We place the scales [Mawazin - plural] of justice} [Al-Anbiya: 47], and singular in like his saying, peace and blessings be upon him: «Two words... heavy in the Balance [Mizan - singular]» (3). Some scholars said: The Balance is one, and it is pluralized in consideration of what is weighed or in consideration of the nations, so this Balance weighs the deeds of the nation of Muhammad, the deeds of the nation of Musa, the deeds of the nation of Isa, and so on; thus the Balance is pluralized considering the multiplicity of nations. Those who said it is multiple in itself said: Because this is the basic principle in plurality, and it is possible that Allah Almighty makes a balance for every nation or makes a balance for obligatory deeds and a balance for voluntary deeds. What appears - and Allah knows best - is that the intention is that the Balance is one, but it is multiple in consideration of what is weighed (4).",
    "foot_note": "1. See: Fath Al-Bari (13/ 538), and Sharh Al-Aqidah Al-Wasitiyyah by Sheikh Salih Al-Fawzan p. 148. \n2. Sharh Al-Aqidah Al-Wasitiyyah by Sheikh Salih Al-Fawzan p. 148. \n3. Sahih Al-Bukhari, Book of Supplications, Chapter: Virtue of Tasbih, (11/ 206 - with Al-Fath). \n4. Arkan Al-Iman: p. 52.",
    "book_id": "51"
  },
  {
    "serial_number": "97994",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "Topic Five: Spreading of the Books And included in belief in the Last Day is: The spreading of the registers, which are the Books. They are spread among people, so people differ in taking these books; some take them with the right hand, and some take them with the left. Allah Almighty said: {So as for he who is given his record in his right hand, he will say, \"Here, read my record! (19) Indeed, I was certain that I would be meeting my account.\" (20) So he will be in a pleasant life - (21) In an elevated garden, (22) Its [fruit] to be picked hanging near. (23) [They will be told], \"Eat and drink in satisfaction for what you put forth in the days past.\" (24) But as for he who is given his record in his left hand, he will say, \"Oh, I wish I had not been given my record (25) And had not known what is my account. (26)} [Surah Al-Haqqah: 19-26]. And He Almighty said: {But as for he who is given his record behind his back (10)} [Al-Inshiqaq: 10], meaning: he takes it with his left hand, but the left hand is dislocated to the back from behind his back. The recompense is of the same nature as the deed; just as this man put the Book of Allah behind his back, he is given his book on the Day of Resurrection from behind his back, a fitting recompense. This book has written in it what the human does, as He Almighty said: {No! But you deny the Recompense. (9) And indeed, [appointed] over you are keepers, (10) Noble and recording; (11)} [Surah Al-Infitar: 9-11], and it is said to the human: {Read your record. Sufficient is yourself against you this Day as accountant (14)} [Al-Isra: 14]. Topic Six: The Cistern (Al-Hawd) And included in belief in the Last Day is: The Cistern, the Cistern of the Prophet, peace and blessings be upon him. This Cistern is a vast cistern, its length is a month['s journey] and its width is a month['s journey]. Its vessels are like the stars of the sky in their number and beauty. Its water is whiter than milk, sweeter than honey, and more fragrant than the scent of musk. Whoever drinks a drink from it will never be thirsty again. The Cistern derives its water from Al-Kawthar, which is a river given to the Prophet, peace and blessings be upon him, in Paradise; two spouts pour from it into the Cistern, so the Cistern remains always full. The believers from the nation of the Messenger, peace and blessings be upon him, come to it and drink from it. This Cistern is in the courts of the Resurrection during the intense heat and the people's fatigue, worry, and distress, so they drink from this Cistern after which they will never thirst again. From Abdullah bin Amr, may Allah be pleased with them both, who said: The Messenger of Allah, peace and blessings be upon him, said: «My Cistern is a month's journey, its corners are equal, its water is whiter than silver (Wariq), its scent is better than musk, and its cups are like the stars of the sky; whoever drinks from it will never thirst again» (1). (The time of the Cistern is before crossing the Sirat, because the situation requires that, since people are in need of drinking in the courts of the Resurrection before crossing the Sirat) (2).",
    "foot_note": "1. Sahih Al-Bukhari Book of Al-Riqaq, Chapter on the Cistern (11/ 463), and Sahih Muslim, Book of Virtues, Chapter: The Cistern of the Prophet peace be upon him and its description (15/ 55). \n2. Sharh Al-Aqidah Al-Wasitiyyah, Sheikh Muhammad bin Uthaymeen, (2/ 158).",
    "book_id": "51"
  },
  {
    "serial_number": "97995",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "Topic Seven: Intercession (Shafa'ah) And included in belief in the Last Day is: Intercession. It is of two types: One: Exclusive to the Prophet, peace and blessings be upon him. The Second: General for him and for all Prophets, Truthful ones (Siddiqin), Martyrs, and Righteous people. As for the Intercession Exclusive to the Prophet, peace and blessings be upon him -: First: The Great Intercession which is for judgment among the people. That is because people on the Day of Resurrection will be afflicted with distress, worry, and grief that they cannot bear, because they remain for fifty thousand years, with the sun above their heads, and sweat may bridle some of them, so they find worry, grief, and distress. They seek someone to intercede for them to Allah Almighty to save them from that. Allah Almighty inspires them to go to Adam, who is the father of mankind. They come to him and ask him for intercession, but he excuses himself saying he disobeyed his Lord by eating from the tree which Allah forbade him to eat from; because the station of intercession is a great station requiring the intercessor to be free of everything, for he is an intercessor wanting to mediate for another, so if he is sinful, how can he be an intercessor? So people go to Nuh (Noah), peace be upon him, and ask him for intercession, but he excuses himself saying he asked for what he had no knowledge of, and he had asked Allah Almighty to save his disbelieving son from drowning, so he excuses himself. Then they come to Ibrahim (Abraham), the Friend of the Most Merciful, peace be upon him, and he excuses himself saying he lied three lies. Then they come to Musa (Moses), peace be upon him, after that, and he excuses himself saying he killed a soul he was not commanded to kill. Then they come to Isa (Jesus), peace be upon him, and he does not offer an excuse, but he acknowledges the virtue of the Prophet, peace and blessings be upon him, saying to them: Go to Muhammad, peace and blessings be upon him, a servant whose past and future sins Allah has forgiven. So they come to the Prophet, peace and blessings be upon him, and ask him for intercession. He intercedes to Allah Almighty, and Allah Almighty descends to judge between the servants. This intercession is called the Great Intercession, and it is from the Praiseworthy Station (Maqam Mahmud) about which Allah said: {It may be that your Lord will raise you to a Praised Station (79)} [Al-Isra: 79]. So the Prophet, peace and blessings be upon him, intercedes to Allah Almighty, and Allah Almighty descends to judge between His servants and relieves them from this standing (1). Second: From the intercession exclusive to the Messenger, peace and blessings be upon him, is that he intercedes for the people of Paradise to enter Paradise. For when the people of Paradise cross the Sirat and reach the gate of Paradise, they find it closed. So the Prophet, peace and blessings be upon him, intercedes to Allah to open the gate of Paradise for them. Allah indicated this intercession saying: {And those who feared their Lord will be driven to Paradise in groups; until when they reach it while its gates have been opened} [Surah Az-Zumar: 73], and He did not say: until when they reach it, they were opened, as He said regarding the Fire: {And those who disbelieved will be driven to Hell in groups; until when they reach it, its gates are opened} [Surah Az-Zumar: 71]. But regarding the people of Paradise He said: {while its gates have been opened}; because they are not opened except after intercession. Third: His intercession, peace and blessings be upon him, for his uncle Abu Talib that the punishment be lightened for him.",
    "foot_note": "1. Sahih Muslim, Book of Faith, Chapter: Intercession, (3/ 53 - 58 - with Al-Nawawi's explanation).",
    "book_id": "51"
  },
  {
    "serial_number": "97996",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "General Intercession: As for that in which intercession is general, for him and for all Prophets, Truthful ones, Martyrs, and Righteous people, it is of types: First: Intercession for the people of the Fire among the believers that they be brought out of the Fire. Second: Intercession for those among the believers who deserved the Fire that they do not enter the Fire. Third: Intercession to raise the ranks of some people of Paradise. Fourth: Intercession for those whose good deeds and bad deeds were equal, that they enter Paradise. Fifth: Intercession for the entry of some believers into Paradise without reckoning or punishment (1). Intercession must have three conditions. First: Allah's pleasure with the intercessor. Then: His pleasure with the one interceded for. Then: His permission. Allah Almighty said: {And how many angels there are in the heavens whose intercession will not avail at all except [only] after Allah has permitted [it] to whom He wills and approves (26)} [An-Najm: 26], and He Almighty said: {And they cannot intercede except on behalf of one whom He approves} [Al-Anbiya: 28]. Topic Eight: The Bridge (Al-Sirat) And included in belief in the Last Day is: The Sirat. It is a bridge extended over the Fire. People pass over it according to their deeds. Some of them pass like the blink of an eye, some pass like lightning, some pass like the wind, according to their deeds. Whoever was quick in the world to accept the truth and act upon it will be quicker in crossing the Sirat. And the slower a person was to accept the truth and act upon it, the slower he will be on the Sirat. The people of Paradise pass over this Sirat and cross it. As for the disbelievers, they do not pass over it, because they are driven to the Fire - and we seek refuge in Allah -, coming to it thirsty. From Abu Sa'id Al-Khudri, may Allah be pleased with him, describing the crossing of the Sirat, he said: The Messenger of Allah, peace and blessings be upon him, said: «Then the bridge is laid across Hell, and intercession is allowed, and they say: O Allah, save, save. It was said: O Messenger of Allah! What is the bridge? He said: A slippery slope (2) containing hooks, claws, and thorns (3) like in Najd which has a small thorn called Al-Sa'dan. The believers pass like the blink of an eye, like lightning, like wind, like birds, and like excellent horses and camels. So one is saved safe, one is scratched but released, and one is piled into the fire of Hell» (4).",
    "foot_note": "1. See: Sharh Al-Aqidah Al-Wasitiyyah, by Sheikh Salih Al-Fawzan p. 158. \n2. Dahd and Mazalla mean the same thing, which is the place where feet slip and do not stabilize. Al-Nawawi's explanation of Sahih Muslim (3/ 29). \n3. Hasak: Hard thorns made of iron. Al-Nawawi's explanation of Sahih Muslim (3/ 29). \n4. Sahih Muslim, Book of Faith, Chapter: The last of the people of Paradise to enter (3/ 25 - 34).",
    "book_id": "51"
  },
  {
    "serial_number": "97997",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "Topic: Entering Paradise or Fire It is the last of stages, where the people of Paradise enter Paradise, and the people of Fire enter the Fire. Here we reach the end of the line... the end of the long journey, a part of which began on earth in the worldly life, and today reaches its end after Resurrection, Gathering, Presentation, and Questioning. Allah Almighty said: {As He began you, so you will return (29) A group He guided, and a group deserved [to be in] error} [Surah Al-A'raf: 29-30]. Here the picture is complete, the truth is established, and everything reaches settlement. As for those who were steadfast on the path in their worldly life, believed in Allah, adhered to His commands, were certain of the Day of meeting Him, avoided His wrath, strove for His pleasure, toiled and labored for that, endured what they endured of hardship, and were patient over what they met of harm and fatigue on the path, those have deserved Allah's pleasure and His Paradise, and deserved to reach the Abode of Safety where nothing worries, nothing frightens, and nothing disturbs the bliss: {They will not taste death therein except the first death, and He will have protected them from the punishment of Hellfire (56)} [Ad-Dukhan: 56]. As for those who disbelieved and lied, persisted in their error, disobeyed the command of their Lord and His messengers, enjoyed the worldly life unjustly, toiled but for Satan, and rejoiced in their wrong deeds so they became tyrannical and arrogant with them, they have deserved to reach Hell, where there is no death nor life, and not even a day of punishment is lightened for them. Paradise and Fire exist right now. Allah Almighty said - regarding the Fire -: {And fear the Fire, which has been prepared for the disbelievers (131)} [Ali Imran: 131], and preparation means making ready. And regarding Paradise, Allah Almighty said: {And hasten to forgiveness from your Lord and a garden as wide as the heavens and earth, prepared for the righteous (133)} [Ali Imran: 133], and preparation also means making ready. In Sahih Muslim and others in the story of the solar eclipse, the Prophet, peace and blessings be upon him, stood to pray and Paradise and Fire were displayed to him. He saw Paradise until he intended to take a cluster [of grapes] from it, then it appeared to him not to do so, peace and blessings be upon him. And he saw the Fire and saw in it Amr bin Luhayy Al-Khuza'i dragging his intestines - meaning his bowels - in the Fire, having spilled out of his stomach, so he drags them - we seek refuge in Allah - in the fire of Hell (1), which indicates that Paradise and Fire exist right now.",
    "foot_note": "1. Sahih Muslim, Book of Eclipses, Chapter: What was displayed to the Prophet – peace and blessings be upon him in the Eclipse Prayer (6/ 206 - with Al-Nawawi's explanation).",
    "book_id": "51"
  },
  {
    "serial_number": "97998",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "Paradise and Fire remain; Paradise remains for ever and ever, and the Fire remains for ever and ever. Allah Almighty said: {(6) Indeed, they who have believed and done righteous deeds - those are the best of creatures. (7) Their reward with Allah will be gardens of perpetual residence beneath which rivers flow, wherein they will abide forever, Allah being pleased with them and they with Him. That is for whoever has feared his Lord (8)} [Surah Al-Bayyinah: 7-8]. Regarding the Fire, Allah mentioned eternity in three verses of the Quran. Allah Almighty said: {Indeed, those who disbelieve and commit wrong [or injustice] - never will Allah forgive them, nor will He guide them to a path. (168) Except the path of Hell; they will abide therein forever} [Surah An-Nisa: 168-169]. And He Almighty said: {Indeed, Allah has cursed the disbelievers and prepared for them a Blaze. (64) Abiding therein forever} [Surah Al-Ahzab: 64-65]. And He Almighty said: {And whoever disobeys Allah and His Messenger - then indeed, for him is the fire of Hell; they will abide therein forever (23)} [Al-Jinn: 23]. So the Fire and Paradise exist now, and they remain, and they never perish.",
    "foot_note": "None",
    "book_id": "51"
  },
  {
    "serial_number": "97999",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "Chapter Four: The Effects of Belief in the Last Day on Reforming Society Belief in the Last Day is a pillar of faith, and a fundamental doctrine of Islam. The issue of Resurrection in the Hereafter is what the structure of creed stands upon after the issue of the Oneness of Allah Almighty. Belief in what is in the Last Day and its signs is belief in the Unseen which the intellect cannot perceive, and there is no way to know it except by text through Revelation. Hardly do you pass a page of the Quran without finding in it a discussion about the Last Day and what is in it of reward and punishment. The true life in Islam is not just this short limited worldly life, nor is it only the short limited life span of a human. True life in Islam extends in time to eternity, and extends in place to another abode in a Paradise as wide as the heavens and earth, or a Fire spacious enough for many generations that populated the face of the earth for eras of years. Allah Almighty said: {Race toward forgiveness from your Lord and a Garden whose width is like the width of the heavens and earth, prepared for those who believed in Allah and His messengers} [Al-Hadid: 21]. And He Almighty said: {On the Day We will say to Hell, \"Have you been filled?\" and it will say, \"Are there any more?\" (30)} [Qaf: 30]. Belief in the Last Day has extreme importance in human life and profound effects. We can understand in light of this fact that the Quran linked in many places between belief in Allah and belief in the Last Day. Allah Almighty said: {They believe in Allah and the Last Day, and they enjoin what is right and forbid what is wrong} [Ali Imran: 114]. And He Almighty said: {That is instructed to whoever of you believes in Allah and the Last Day} [At-Talaq: 2]. So belief in the Last Day is directly linked to belief in Allah. Indeed, belief in Allah and the Last Day and what is in it of reward and punishment is the true guide for human behavior towards the path of good. There is no human law that can make human behavior upright and straight as belief in the Last Day does. Therefore, there is a big difference and a vast gap between the behavior of one who believes in Allah and the Last Day, and knows that the world is the plantation for the Hereafter, and that righteous deeds are the provision for the Hereafter, as Allah Almighty said: {And take provisions, but indeed, the best provision is piety} [Al-Baqarah: 197].",
    "foot_note": "None",
    "book_id": "51"
  },
  {
    "serial_number": "98000",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "The one who believes in the Day of Judgment works while looking at the scale of Heaven, not the scale of Earth, and for the account of the Hereafter, not the account of the world. He has unique behavior in life; we see in him uprightness, breadth of vision, strength of faith, firmness in adversities, and patience over calamities, seeking reward and recompense, for he knows that what is with Allah is better and more lasting. Imam Muslim narrated from Suhayb, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: «Amazing is the affair of the believer! Indeed, all of his affair is good, and that is not for anyone except the believer. If prosperity strikes him, he is grateful, and that is good for him. And if adversity strikes him, he is patient, and that is good for him...» (1). This feeling is from the effects of belief in Allah and the Last Day, and the sense of the heavy responsibility and the greatness of the Trust which man bore and from which the heavens, the earth, and the mountains shied away. For he knows that every big and small thing he is responsible for, accountable for, and recompensed for; if good then good, and if evil then evil. {The Day every soul will find what it has done of good present [before it] and what it has done of evil, it will wish that between itself and that [evil] was a great distance} [Ali Imran: 30]. And He Almighty said: {And the record [of deeds] will be placed, and you will see the criminals fearful of that within it, and they will say, \"Oh, woe to us! What is this book that leaves nothing small or great except that it has enumerated it?\" And they will find what they did present [before them]. And your Lord does injustice to no one (49)} [Al-Kahf: 49]. As for the one who does not believe in Allah nor in the Last Day and what is in it of reckoning and recompense, he tries hard to achieve his goals in the worldly life, panting after its pleasures, scrambling to collect it, preventing good from reaching people through him. He has made the world his greatest concern and the limit of his knowledge. He measures matters by his private benefit; he does not care about others, nor does he pay attention to his fellow humans except within the limits of what achieves benefit for him in this short limited life. He moves while his boundaries are the earth and the limits of this lifespan. Hence, his calculation changes, the results of his scales differ, and he ends up with wrong results, because he considers Resurrection unlikely {But man desires to continue in sin. (5) He asks, \"When is the Day of Resurrection?\" (6)} [Surah Al-Qiyamah: 5-6]. You find this type of people among the most eager of people for life, because they do not believe in Resurrection after death, as He Almighty said describing the polytheists among the Jews and others: {And you will surely find them the most greedy of people for life - [even] more than those who associate others with Allah. One of them wishes that he could be granted life a thousand years, but it would not remove him in the least from the punishment that he should be granted life. And Allah is Seeing of what they do (96)} [Al-Baqarah: 96].",
    "foot_note": "1. Sahih Muslim, Book of Asceticism, Chapter: Miscellaneous Hadiths (18/ 125 - with Al-Nawawi's explanation).",
    "book_id": "51"
  },
  {
    "serial_number": "98001",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "For the polytheist does not hope for resurrection after death, so he loves long life. And the Jew has known what disgrace awaits him in the Hereafter due to what he did with the knowledge he has (1). So this kind and those like them are the worst of people. You find spreading among them: greed, avarice, oppression of peoples, enslaving them, and looting their wealth, out of their eagerness to enjoy the pleasures of the worldly life. Therefore, moral decay and bestial behavior appear among them. If they see the worldly life's troubles and pains exceed what they hope for of immediate pleasures, they have no barrier preventing them from committing suicide. They do not value responsibility in another life, so they have nothing preventing them from ending this life. For this reason, Islam cared, and emphasis came in the Quran on the issue of belief in the Last Day, and proving Resurrection, Reckoning, and Recompense. It denied the ignorant ones' deeming it unlikely, and commanded its Prophet to swear that it is true: {Say, \"Yes, by my Lord, you will surely be resurrected; then you will surely be informed of what you did. And that, for Allah, is easy.\" (7)} [At-Taghabun: 7]. And it mentioned the conditions of the Day of Resurrection, what He prepared for His pious servants of reward, and what He prepared for the disobedient of punishment. It drew the attention of the deniers to the proofs of its reality, to uproot doubt from the souls, and so that people place this Day and its hair-raising horrors before their eyes, so their behavior in this life becomes upright by following the true religion brought to them by their Messenger, peace and blessings be upon him (2). Indeed, correct belief in Allah and all that came from Allah, and belief in the Messenger of Allah and all that came from the Messenger of Allah has fruits. Ripe fruits, good delicious fruits. Fruits that are the joy of souls, nourishment of spirits, and tranquility of the heart. Among them is saying \"La ilaha illa Allah Muhammad Rasul Allah\" with knowledge, certainty, truthfulness, sincerity, love, acceptance, and submission. Among the fruits of faith and affirmation is doing all obligations and leaving all prohibitions. And judging by the laws of Islamic Sharia, and removing man-made laws. Among the fruits is enjoining good and forbidding evil, fulfilling covenants and pacts, performing trusts, adorning oneself with patience and truthfulness, righteousness and kindness, maintaining ties of kinship, kindness to parents, loving believers and hating disbelievers, piety, certainty, fear of the Lord of the Worlds, giving full measure and weight, giving sincere advice to Allah, His Messenger, His servants, and the leaders of Muslims, compassion, sympathy, and mercy for the poor, orphans, and needy, asceticism and piety, truthful dealing with Allah, spending generously, and refraining from harm. All of that is from the fruits of faith and affirmation.",
    "foot_note": "1. See: Tafsir Ibn Kathir (1/ 184). \n2. See: Ashrat al-Sa'ah, pp. 27 - 33.",
    "book_id": "51"
  },
  {
    "serial_number": "98002",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "So what made the Muslims endure harm and be patient over affliction? It is belief in Allah Almighty and the Last Day, the belief whose source is from the core of the hearts. Among the fruits of faith is that Allah Almighty takes the believers as allies. Allah Almighty said: {Indeed, the most worthy of Abraham among the people are those who followed him [in submission to Allah] and this prophet, and those who believe [in his message]. And Allah is the ally of the believers (68)} [Ali Imran: 68]. And whoever Allah takes as an ally is happy in this world and the Hereafter. Among the fruits of faith is what Allah informed about His believing servants, He Almighty said: {Indeed, the righteous will be among gardens and springs, (15) Accepting what their Lord has given them. Indeed, they were before that doers of good. (16) They used to sleep but little of the night, (17) And in the hours before dawn they would ask forgiveness, (18) And from their properties was [given] the right of the [needy] petitioner and the deprived (19)} [Surah Adh-Dhariyat: 15-19]. Among the fruits of faith is the desire to perform obedience and eagerness for it hoping for the reward of that Day. Among the fruits of faith is the fear of committing sin and accepting it, and distancing from prohibitions and all evils out of fear of the punishment of that Day. Among the fruits of faith is consoling the believer for what he misses of the world by what he hopes for of the Hereafter's bliss and reward (1). Among the fruits of faith is that the angels of the Most Merciful pray for and ask forgiveness for the believers. Allah Almighty said: {Those [angels] who carry the Throne and those around it exalt [Allah] with praise of their Lord and believe in Him and ask forgiveness for those who have believed, [saying], \"Our Lord, You have encompassed all things in mercy and knowledge, so forgive those who have repented and followed Your way and protect them from the punishment of Hellfire (7)} [Ghafir: 7] (2), and other fruits.",
    "foot_note": "1. See: Sharh Usul Al-Iman, Muhammad bin Uthaymeen, p. 46, 1st ed., Dar Al-Watan, Riyadh, 1410 AH. \n2. See: 'Aqidat Al-Muslimin wa Al-Radd 'ala Al-Mulhidin, Salih Al-Balayhi (1/ 50 - 55), 1st ed., Al-Matabi' Al-Ahliyah, Riyadh, 1401 AH.",
    "book_id": "51"
  },
  {
    "serial_number": "98003",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "Conclusion After this, it has become clear to us through this research that the foundation upon which the rectification of the individual - who is the building block of society - stands is the correct creed and firm belief in Allah Almighty, and what follows that of belief in Resurrection and Recompense for the deeds that occurred from the accountable ones in this life. This is because belief in the Last Day has importance in reforming societies and stabilizing their conditions, for there is no happiness for a society whose individuals do not believe in the Last Day and the Day of Recompense and Reckoning. The Holy Quran has clarified that the existence of this human on this earth is not in vain, rather Allah Almighty created him for a purpose and wisdom. Allah Almighty said: {Then did you think that We created you uselessly} [Al-Mu'minun: 115], meaning the matter is not so; rather there is a goal, and there is a purpose for this life. So there must be a return to Allah Almighty after the journey of this human in this worldly life. Allah Almighty said: {O people, if you are in doubt about the Resurrection, then indeed, We created you from dust, then from a sperm-drop, then from a clinging clot, and then from a lump of flesh, formed and unformed - that We may show you. And We settle in the wombs whom We will for a specified term, then We bring you out as a child, and then [We develop you] that you may reach your [time of] maturity. And among you is he who is taken in [early] death, and among you is he who is returned to the most decrepit [old] age so that he knows, after [once having] knowledge, nothing. And you see the earth barren, but when We send down upon it rain, it quivers and swells and grows [something] of every beautiful kind. (5) That is because Allah is the Truth and because He gives life to the dead and because He is over all things competent (6) And [that] the Hour is coming - no doubt about it - and that Allah will resurrect those in the graves (7)} [Surah Al-Hajj: 5-7]. And that the believer must submit and believe in everything that came in the Book and the Sunnah regarding unseen matters. And that reason and sound nature indicate the occurrence of Resurrection and Rising. O Allah, we ask You for Paradise and what draws near to it of words and deeds, and we seek refuge in You from the Fire and what draws near to it of words and deeds. Our Lord, do not let our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower. And may Allah send blessings and peace upon our Prophet Muhammad and upon his family and companions.",
    "foot_note": "None",
    "book_id": "51"
  },
  {
    "serial_number": "98004",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "Index of Sources and References \n1 - Arkan Al-Iman (Pillars of Faith), by Ibn Uthaymeen, 1st ed., Dar Al-Muslim, Riyadh, 1413 AH. \n2 - Ashrat Al-Sa'ah (Signs of the Hour), Yusuf Al-Wabil, 2nd ed., Dar Ibn Al-Jawzi, Dammam, 1411 AH. \n3 - Al-Iman bi Al-Mala'ikah wa Atharuhu fi Hayat Al-Ummah (Belief in Angels and its Effect on the Life of the Ummah), Salih Al-Fawzan, 1st ed., Dar Al-Asimah, Riyadh, 1413 AH. \n4 - Al-Iman bi Al-Yawm Al-Akhir wa bi Al-Qada' wa Al-Qadar (Belief in the Last Day and in Decree and Destiny), Ahmad Izz al-Din Al-Bayanuni, 2nd ed., Dar Al-Salam, 1405 AH. \n5 - Al-Bidaya wa Al-Nihaya by Ibn Kathir, verification: Ahmad Abu Mulhim, 3rd ed., Dar Al-Kutub Al-Ilmiyyah, Beirut, 1407 AH. And another edition: Al-Bidaya wa Al-Nihaya by Ibn Kathir, Maktabat Al-Ma'arif, Beirut. \n6 - Al-Tadhkirah by Al-Qurtubi, 1st ed., Dar Al-Rayyan li Al-Turath, Cairo, 1407 AH. \n7 - Tafsir Al-Quran Al-Azim by Ibn Kathir, intro: Dr. Yusuf Al-Mar'ashli, 2nd ed., Dar Al-Ma'rifah, Beirut, 1407 AH. \n8 - Taqrib Al-Tahdhib by Ibn Hajar, care of: Adel Murshid, 1st ed., Mu'assasat Al-Risalah, Beirut 1416 AH. \n9 - Al-Tanbihat Al-Latifah 'ala ma Ihtawat Al-Aqidah Al-Wasitiyyah min Al-Mabahith Al-Munifah, Ibn Sa'di, 1st ed., adjustment and extraction: Ali Hasan Abdul Hamid, Dar Ibn Al-Qayyim, Dammam, 1409 AH. \n10 - Al-Jami' li Ahkam Al-Quran by Al-Qurtubi, correction: Ahmad Abdul Alim Al-Barduni, 2nd ed. \n11 - Silsilat Al-Ahadith Al-Sahihah, Al-Albani, 4th ed., Maktabat Al-Ma'arif, Riyadh, 1408 AH. \n12 - Silsilat Al-Ahadith Al-Da'ifah wa Al-Mawdu'ah wa Atharuha Al-Sayyi' fi Al-Ummah, Al-Albani, 5th ed., Al-Maktab Al-Islami, Beirut, 1405 AH. \n13 - Sharh Usul Al-Iman, Ibn Uthaymeen, 1st ed., Dar Al-Watan, Riyadh, 1410 AH. \n14 - Sharh Al-Usul Al-Thalathah by Sheikh Ibn Uthaymeen, prepared by: Fahd Al-Sulaiman, 1st ed., Dar Al-Thuraya, Riyadh, 1414 AH. \n15 - Sharh Al-Aqidah Al-Wasitiyyah, Ibn Uthaymeen, 2nd ed., Dar Ibn Al-Jawzi, Dammam, 1415 AH. \n16 - Sahih Al-Jami' Al-Saghir wa Ziyadatuhu, Al-Albani, 2nd ed., Al-Maktab Al-Islami, Beirut, 1406 AH. \n17 - Sahih Sunan Ibn Majah, Al-Albani, 2nd ed., Arab Bureau of Education for the Gulf States, Riyadh, 1408 AH. \n18 - Sahih Sunan Abi Dawood, Al-Albani, 1st ed., Arab Bureau of Education for the Gulf States, Riyadh, 1409 AH. \n19 - Sahih Sunan Al-Tirmidhi, Al-Albani, 1st ed., Arab Bureau of Education for the Gulf States, Riyadh, 1408 AH. \n20 - Sahih Muslim with Al-Nawawi's explanation, Dar Al-Kitab Al-Arabi, Beirut, 1407 AH. \n21 - 'Alam Al-Ghayb wa Al-Shahadah fi Al-Tasawwur Al-Islami (The World of the Unseen and the Seen in Islamic Conception), Uthman Jum'ah Dumayriyyah, 1st ed., Maktabat Al-Sawadi, Jeddah, 1408 AH.",
    "foot_note": "None",
    "book_id": "51"
  },
  {
    "serial_number": "98005",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in the Last Day and Its Effect on Reforming Society",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "22 - Al-Aqidah Al-Tahawiyyah Sharh Ibn Abi Al-Izz, verification: Al-Turki and Al-Arna'ut, 1st ed., Mu'assasat Al-Risalah, Beirut, 1408 AH. \n23 - 'Aqidat Al-Muslimin wa Al-Radd 'ala Al-Mulhidin (Creed of Muslims and Refutation of Atheists), authored by: Salih Al-Balayhi, 1st ed., Al-Matabi' Al-Ahliyah, Riyadh, 1401 AH. \n24 - Fath Al-Bari Sharh Sahih Al-Bukhari by Ibn Hajar, with commentary by: Sheikh Abdul Aziz bin Baz, Dar Al-Fikr. \n25 - Al-Fatwa Al-Hamawiyyah by Ibn Taymiyyah, intro: Muhammad Hamza, Al-Madani Press, Egypt. \n26 - Al-Qamus Al-Muhit by Al-Firuzabadi, adjustment and documentation: Yusuf Al-Sheikh Muhammad Al-Baqa'i, Dar Al-Fikr, Beirut 1415 AH. \n27 - Al-Qawa'id Al-Hisan fi Tafsir Al-Quran, Ibn Sa'di. \n28 - Lisan Al-Arab by Ibn Manzur, verification: Abdullah Ali Al-Kabir, Dar Al-Ma'arif. \n29 - Majma' Al-Zawa'id by Al-Haythami, verification: Abdullah Al-Darwish, Dar Al-Fikr, Beirut, 1414 AH. \n30 - Majmu' Fatawa Sheikh Al-Islam Ibn Taymiyyah, compiled by: Abdul Rahman bin Qasim, Maktabat Ibn Taymiyyah, Egypt. \n31 - Musnad Al-Imam Ahmad, verification: Ahmad Shakir, Dar Al-Ma'arif, Egypt, 1392 AH. \n32 - Ma'arij Al-Qabul bi Sharh Sullam Al-Wusul ila 'Ilm Al-Usul, by Hafiz Al-Hakami, verification: Umar Mahmud Abu Umar, 3rd ed., Dar Ibn Al-Qayyim, 1414 AH. \n33 - Manhaj Al-Quran fi Al-Da'wah ila Al-Iman (Quran's Method in Calling to Faith), Ali Al-Faqihi, 1st ed., 1405 AH. \n34 - Al-Nukat 'ala Nuzhat Al-Nazar fi Tawdih Nukhbat Al-Fikr, by Ibn Hajar, penned by: Ali Hasan Abdul Hamid, 1st ed., Dar Ibn Al-Jawzi, Dammam, 1413 AH. \n35 - Al-Nihayah fi Al-Fitan wa Al-Malahim, by Ibn Kathir, adjustment and correction: Ahmad Abdul Shafi, 2nd ed., Dar Al-Kutub Al-Ilmiyyah, Beirut, 1407 AH. \n36 - Al-Nihayah fi Gharib Al-Hadith, by Ibn Al-Athir, commentary: Salah Uwaytah, 1st ed., Dar Al-Kutub Al-Ilmiyyah, Beirut, 1418 AH. \n37 - Al-Yawm Al-Akhir - Al-Qiyamah Al-Sughra (The Last Day - The Minor Resurrection), Umar Al-Ashqar, 6th ed., Dar Al-Nafais, Jordan, 1415 AH. \n38 - Al-Yawm Al-Akhir - Al-Qiyamah Al-Kubra (The Last Day - The Major Resurrection), Umar Al-Ashqar, 6th ed., Dar Al-Nafais, Jordan, 1415 AH.",
    "foot_note": "None",
    "book_id": "51"
  }
]