[
  {
    "text": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study\nAuthor: يمن علي عبد الرؤوف صالح\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "new_page_number": 1
  },
  {
    "text": "sn: 3905\nbook_title: العوامل المؤثرة في نوط الحكم بالمظنة أو بالحكمة - دراسة أصولية\nbook_link: https://shamela.ws/book/1106\nbook_id: 1106\nauthor_name: يمن علي عبد الرؤوف صالح\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/1561\nauthor_ID: 1561\neditor: Null\npublisher: بحث منشور في: مجلة كلية العلوم الإسلامية - بغداد، العدد ٧٠، ذو الحجة ١٤٤٣ هـ\nedition: Null\npages: 58\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: أصول الفقه\ncategory_id: 11",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "new_page_number": 2
  },
  {
    "serial_number": "3433333",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Principles of Islamic Jurisprudence. Book: Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study. Author: Dr. Ayman Saleh. Research published in: Journal of the College of Islamic Sciences - Baghdad, Issue 70, Dhu al-Hijjah 1443 AH. Number of pages: 58 [Book numbering matches the printed version]. Publication date in Shamela: 18 Rabi' al-Thani 1444.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 3
  },
  {
    "serial_number": "3433334",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 99,
    "volume_number": 1,
    "text": "Factors Affecting the Suspension of Ruling on Probability or Wisdom: An Usuli Study. Ayman Saleh, Professor of Jurisprudence and its Principles, Qatar University.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 4
  },
  {
    "serial_number": "3433335",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 100,
    "volume_number": 1,
    "text": "Abstract: There is a theoretical debate in Usul books, both old and new, regarding the permissibility of justifying a ruling by its wisdom (Hikmah), or whether it must be justified by an apparent, disciplined probability (Mazannah/Illah). Looking at the practical branches of jurists, we found them suspending rulings on wisdom itself at times, and on probability/cause (Illah) at other times. Thus, it was necessary to know the factors influencing these choices. through induction, the researcher identified nine factors affecting the suspension of ruling on probability or wisdom in occurrences. Keywords: Justification by Wisdom, Justification by Probability, Cause (Illah), Wisdom (Hikmah).",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 5
  },
  {
    "serial_number": "3433336",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 101,
    "volume_number": 1,
    "text": "Introduction: Praise be to Allah, and prayers and peace be upon the Messenger of Allah, his family, and those who follow him. To proceed: The science of Maqasid al-Sharia (Objectives of Islamic Law) has reached a great extent in these times, in terms of the spread of its discussion and the abundance of writings on it. It is a science worthy of care and attention, of great benefit and significant return, especially in guiding the view on contemporary issues of Ijtihad. However, at the same time, it is a slippery slope if taken in isolation from its origin and source, the science of Usul al-Fiqh (Principles of Jurisprudence), which includes the mechanisms for determining objectives, their conditions, and the controls for their implementation. The historical truth that should not be overlooked is that the science of Maqasid al-Sharia is a branch of Usul al-Fiqh; it emerged from it and was derived from it. A branch should not return to invalidate its origin, or else it invalidates itself. Many of those engaging in Maqasid research, especially non-specialists in Usul, rush with excessive enthusiasm towards objectives, or what they imagine to be objectives, without adhering to the established rules of the Usulis regarding the controls for determining and implementing them. This is either due to ignorance of these rules because of the ruggedness of their topics, their precision, and the abundance of disagreement and confusion in the chapters of Qiyas (Analogy) in Usul books, or due to turning away from them with the intention of circumventing the legal rulings indicated by the texts and suspending them under the pretext of implementing objectives, as clearly seen in the writings of modernists and secularists with new readings of religious texts. On the other hand, there is a group of Sharia scholars who are \"reserved\" about the science of Maqasid as a whole, because they see arbitrariness in its employment and using it as a pretext to encroach upon the Sharia and suspend its apparent meanings, texts, and established rules by many who are mostly outsiders to Sharia sciences.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 6
  },
  {
    "serial_number": "3433337",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 102,
    "volume_number": 1,
    "text": "Away from these two paths: the path of the negligent and the path of the reserved, this research comes to link the science of Maqasid with the science of Usul al-Fiqh by clarifying several factors mentioned by Usulis, explicitly or implicitly, that influence the suspension of rulings: either on objectives and wisdoms, or on probabilities (Mazann) and causes (Asbab). This research is the third in this context, preceded by two important introductory studies. One: titled \"Cause (Illah), Wisdom (Hikmah), and Justification by Wisdom: A Terminological Study,\" which aimed to clarify the terms related to the subject of justification by wisdom, such as Illah, Hikmah, Sabab (cause), Mazannah (probability), and Dabit al-Sabab (control of the cause), especially since some of these terms reached the utmost ambiguity and confusion, leading to many disputes in defining them and in the consequent conditions and issues related to them in Usuli studies, both old and new. Among the aims of the mentioned research was also to define the point of dispute among Usulis regarding the legitimacy of suspending the ruling: in existence, non-existence, or both, on wisdom without probability/cause, which is called by them justification by wisdom. The second research: titled \"Justification by Probability Not Wisdom: An Usuli Study,\" aimed to root the saying of suspending rulings on apparent, disciplined descriptions (causes or probabilities, not wisdoms and objectives) by explaining its meaning, evidence from scholars' sayings, its legal proofs, and its purpose representing the Usuli philosophy it is based on. It was indicated in the mentioned research that justification by probability, although dominant in Sharia rulings, can be deviated from to consider wisdom wholly or partially, in existence or non-existence, in special circumstances. This is what we will explain in this research, God willing. After completing this research, the need remains in the coming days to accomplish detailed applied research dealing with specific contemporary jurisprudential issues, in which we explain the practical mechanism for implementing the rules and factors we concluded in this trilogy of theoretical research, as we did in our recent book on DNA fingerprinting, which we ask Allah Almighty to facilitate for us with His help and success.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 7
  },
  {
    "serial_number": "3433338",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 103,
    "volume_number": 1,
    "text": "Research Problem: There is a theoretical debate in Usul books, old and new, regarding the saying of the permissibility of justifying a ruling by its wisdom, or whether it must be justified by the apparent disciplined probability (Illah). Looking at the practical branches of jurists, we found them suspending rulings on wisdom itself at times, and on probability/Illah at other times. Thus, it was necessary to induce the factors influencing these choices. Therefore, the research problem focuses on the following question: What are the factors affecting the suspension of a ruling on its probability or its wisdom, as indicated by the discussions of Usulis and the schools of jurists? This main question is preceded by two introductory questions: One: What is the summary of the statement in defining the terms circulating in the chapter of justification by wisdom and justification by probability? Second Question: What are the forms of jurists' actions when a ruling oscillates between being suspended on probability or wisdom? Research Objectives: 1. Mentioning the summary of the statement in defining the terms used in the topic of justification by probability or wisdom. 2. Inducing the forms of jurists' actions when a ruling oscillates between being suspended on probability or wisdom. 3. Inducing the factors affecting the suspension of a ruling on probability or wisdom according to Usulis and jurists, and clarifying them. Research Methodology: The research relied on both analytical and inductive methods equally.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 8
  },
  {
    "serial_number": "3433339",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 104,
    "volume_number": 1,
    "text": "Previous Studies: With the abundance of what contemporaries have written in the chapter of justification (Ta'lil) generally, and in the issue of justification by wisdom specifically, the vast majority of these researches dealt with major issues in the mentioned topics, and few of them entered into minute details, meaning details of details. Also, most of them lacked a foundational framework regulating the mechanism of justification by wisdom when it conflicts with justification by probability, and explaining how to employ it in jurisprudential issues, both old and contemporary. This is what some researchers in Usuli renewal noticed. Hussein Ait Said said: \"Justifying rulings by their wisdoms requires renewal and foundational structuring; as its chapter is still poor in terms of rooting its controls and conditions so that it can be relied upon as the deduced cause is relied upon\" (1). He said: \"The saying of justifying rulings by interests and corruptions was not a novelty in speech, but from the practical side, it suffered injustice and was afflicted with atrophy and emaciation. Attention should be paid to this aspect, rooting it more, and adding other controls and conditions to it, until it is precisely defined and fully disciplined, because the controls placed for it are insufficient in our time, and are incapable of producing sound and successful Ijtihad where particulars do not conflict with their universals, nor universals with other particulars. The field is still wide for those who renew in it among those who sense in themselves the ability to swim in the depths of this sea, and as for those who are content to hover on its shores, what exists suffices them\" (2). Among the studies we came across that have a close relation, somewhat, to our subject are two studies: First: A research titled: \"Usuli Maqasid Ijtihad: Suspending Rulings on Their Objectives as a Model,\" by Dr. Jasser Auda, published among several other researches on Maqasid in a book titled: Maqasid Ijtihad from Usuli Conception to Practical Implementation, Arab Network for Research and Publishing, Beirut, 1st ed., 2013 AD. Pages 45 - 89.",
    "foot_note": "1. Said, \"Renewal in Jurisprudential Justification,\" in Jurisprudential Ijtihad: What Role and What is New, 121.\n2. Previous reference, 122.",
    "book_id": "1106",
    "new_page_number": 9
  },
  {
    "serial_number": "3433340",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 105,
    "volume_number": 1,
    "text": "The research is extracted with slight modifications from the researcher's master's thesis discussed in the year 1425 AH/2004 AD, and was later published in a book titled: Fiqh of Maqasid: Suspending Rulings on Their Objectives, International Institute of Islamic Thought, Virginia, 1st ed., 1427 AH/2006 AD. The research aimed to answer the question: \"Is the objective suitable as a description to which the ruling relates, as is the case with the cause (Illah) whose authority most jurists agree upon\" (1). The research came - as the author said - in the context of renewal in Maqasid research, attempting: \"To contribute to this contemporary renewal through implementing Maqasid in cases of conflicting texts and their interpretation, and proposing the following rule: 'Practical Sharia rulings revolve with their objectives: in existence and non-existence, just as they revolve with their causes: in existence and non-existence'\" (2). The author relied on a single control for the permissibility of justifying by the objective, by differentiating between it and wisdom, saying: \"Although the wisdom of the ruling does not differ from the objective of the ruling according to many Usulis, it seems to me that there is a significant difference between what is meant by wisdom and what is meant by objective, and this difference has its effect on the issue of justification. Wisdom is an interest resulting from the ruling, while the objective is an interest, or a set of interests, stipulated by the Lawgiver or predominantly thought by the Mujtahid to be the intent of the ruling, meaning without it the ruling would not have been legislated originally. Based on that, I see that wisdom may differ from the objective, may be part of the objective, or may equal the objective, and that the criticism directed at justification by wisdom and suspending the ruling on it does not necessarily apply to justification by the objective\" (3). In summary, the author believes that wisdom is more general than the objective, and the objective is more specific than it, and the ruling revolves with the objective not with absolute what is called wisdom. The objective for him is what without which the ruling would not have been legislated at all, while wisdom may be so, thus the ruling is suspended on it, just like the objective, or it may be merely an interest resulting from the ruling without being the total motive for it, and this [latter type] is not suspended on.",
    "foot_note": "1. Auda, Fiqh of Maqasid: Suspending Rulings on Their Objectives, 55.\n2. Previous reference, 54.\n3. Auda, Maqasid Ijtihad from Usuli Conception to Practical Implementation, 79.",
    "book_id": "1106",
    "new_page_number": 10
  },
  {
    "serial_number": "3433341",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 106,
    "volume_number": 1,
    "text": "The research, in my view, does not offer anything new in this context. Moreover, it is based on a common erroneous understanding of the saying of those Usulis who permitted justification by wisdom. This appears from the researcher's action of citing a number of jurisprudential branches used to object to suspending ruling on wisdom: such as suspending the woman's waiting period (Iddah) on womb clearance not on the number of cycles (Quru'), suspending breaking fast in travel on the hardship itself not on travel, and suspending prohibition resulting from breastfeeding on the partiality not on the act of breastfeeding itself, and his affectation in answering these branches. It seems from this that he understood from the saying of those Usulis who permitted justification by wisdom that they oblige it with every wisdom, whereas the word \"permissibility\" indicates the lack of such obligation. Rather, every issue is subject to the Mujtahid's consideration and what can be observed of other conditions available in the wisdom under consideration, such as its exclusivity to the ruling, its effect, lack of invalidation, lack of contradiction by others, and similar things mentioned in the conditions of the suitable cause (Illah) on which rulings are suspended. The one who says justification by wisdom is permissible only abandons one condition of the cause, which is appearance and discipline, and does not abandon the rest of the conditions. This is intuitively understood from Usulis' discussion on justification by wisdom. This understanding of the doctrine of those permitting justification by wisdom - incorrect in our view - is what forced the researcher to depart from the common terminology among Usulis regarding wisdom and objective; thus he differentiated between them while Usulis and jurists did not differentiate between them in the course of their speech. Departing from common terminology - without dire need - is another error added to the error that led to it. In any case, this research does not meet with our study in goal or content, because our study is concerned with inducing the factors affecting justification by probability or justification by wisdom in individual occurrences, while the researcher's study was concerned with explaining the permissibility - or rather necessity - of justification by wisdom (objective) alongside justification by probability, meaning justification by wisdom to expand the ruling, not at the expense of justification by probability, nor in opposition to it. As the author said: \"Justification by objectives here is not proposed",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 11
  },
  {
    "serial_number": "3433342",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 107,
    "volume_number": 1,
    "text": "as an alternative to justification by disciplined apparent causes, but rather justification by objectives is an addition to justification by causes and an expansion of its concept\" (1). So our study is regarding the conflict between justification by probability and justification by wisdom in individual occurrences, and his study assumes compatibility between them, although assuming such compatibility is theoretical and rarely occurs, as the overwhelming majority is that justification by wisdom in an issue affects justification by probability in the same issue, because it affects the individuals and particulars falling under it directly and inversely, narrowly and broadly, except rarely. The second study: A research titled \"The Impact of Difference in Suspending the Ruling on its Cause or Wisdom on Jurists' Disagreement\" by our colleague Dr. Iyad Nimer, Jordan Journal of Islamic Studies, Vol (12), No (1), 1437 AH/2016 AD, Pages 191 - 212. The research aimed to explain the justifications for suspending the ruling on both the cause or wisdom according to Usulis, shedding light on the impact of the reflection of hesitation in suspending the ruling on its cause or wisdom on the Ijtihads of jurists in Usuli analogy (Qiyas), or in justification devoid of analogy. The researcher concluded the possibility of convergence between the cause and wisdom in suspending rulings on each of them, if the controls of the cause and the conditions of the considered wisdom are observed, which protect the jurist from being dragged behind analogy devoid of its wisdom, or wisdom contrary to the apparent meanings of the texts on which the analogy was built. The researcher went - following some researchers in justification by wisdom (2) - to stipulate that the wisdom justified by must be apparent and disciplined (3). This stipulation - in my view - empties the subject of saying justification by wisdom is permissible of its content, which is justification by the hidden or undisciplined description, because if wisdom is apparent and disciplined, it becomes wisdom and cause at the same time, and then no disagreement is realized in the permissibility of justifying by it between Usulis and jurists. In any case, this research also does not meet with our study in goal or content, as our research aims to induce the factors affecting the suspension of the ruling on probability or wisdom according to Usulis and jurists, and explaining them, which the mentioned research did not address, but rather addressed explaining...",
    "foot_note": "1. Previous reference, 82.\n2. Abu Mu'nis, Methodology of Justification by Wisdom, 168.\n3. Nimer, \"The Impact of Difference in Suspending the Ruling on its Cause or Wisdom on Jurists' Disagreement,\" Jordan Journal of Islamic Studies, Vol 12, Issue 1, 202.",
    "book_id": "1106",
    "new_page_number": 12
  },
  {
    "serial_number": "3433343",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 108,
    "volume_number": 1,
    "text": "the general motives and justifications that can be relied upon to say justification by wisdom is permissible alongside saying justification by probability. Scientific Addition in the Research: The most important scientific additions in this research: First: Inducing the forms of jurists' actions in occurrences when the ruling oscillates between being suspended on probability or wisdom, and the researcher has limited them to four general forms. Second: Inducing the factors affecting the suspension of the ruling either on wisdom or on probability, in individual occurrences, from the writings of Usulis and the actions of jurists, and the researcher reached nine factors. Third: Insights and critiques on partial issues scattered throughout the research, both Usuli and jurisprudential. Research Structure: After this introduction, the research included three sections and a conclusion: Section One: Summary of the statement in defining the terms circulating in the chapter of justification by wisdom and justification by probability. Section Two: Forms of jurists' actions when the ruling oscillates between probability and wisdom. Section Three: Factors affecting the suspension of the ruling on probability or wisdom. And a conclusion on the research results.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 13
  },
  {
    "serial_number": "3433344",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 109,
    "volume_number": 1,
    "text": "Section One: Summary of the Statement in Defining the Terms Circulating in the Chapter of Justification by Wisdom and Justification by Probability. Justifying the ruling by probability (Mazannah)/cause (Illah) is a term opposed to justifying it by wisdom (Hikmah). What one of them requires in determining the branch area covered by the text-based ruling differs from what the other requires, in breadth and narrowness, directly and inversely. For example, prohibiting a woman from traveling except with a husband or Mahram (unmarriageable kin), if justified by the probability mentioned in the Hadith, which is travel, differs in what it requires and includes of occurrences from if it is justified by the rational wisdom of the prohibition - as seen by Al-Shafi'i and a group - which is the lack of safety for the woman and the fear of her being assaulted if not accompanied by a husband or Mahram (1): Suspending the ruling on probability (travel) requires prohibiting a woman's travel except with a husband and Mahram, even if a safe road is found, while suspending it on wisdom (lack of safety) requires the permissibility of her travel without a Mahram or husband if she is safe from the danger of the road, such as the road being safe in itself by the security of the land, or the woman being in the company of other than a husband and Mahram, like trustworthy women. On the other hand, suspending on wisdom requires prohibiting a woman's movement alone in what is less than absolute travel or has not reached the distance designated by jurists for minimal travel, if safety is lacking in this movement and the woman is vulnerable to assault and harassment, as in some countries, while probability does not require that; because this movement, even if safety is lacking, does not fall under the concept of travel. Below is a diagram clarifying the points of divergence and intersection between the circles of what probability requires and what wisdom requires in the example of prohibiting a woman's travel except with a Mahram or husband.",
    "foot_note": "1. Al-Shafi'i, Al-Umm, 2/127.",
    "book_id": "1106",
    "new_page_number": 14
  },
  {
    "serial_number": "3433345",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 110,
    "volume_number": 1,
    "text": "Figure 1: The divergence of the branch area covered by Probability and Wisdom in the example of the prohibition of women's travel and their intersection | To fully understand what is meant by the terms justification by probability/cause and justification by wisdom, one must understand the partial terms composing them: Justification (Ta'lil), Wisdom (Hikmah), and Probability (Mazannah)/Cause (Illah). I had published a detailed research in which I elaborated on defining these terms, verifying them, and distinguishing accurately between them (1). Then I followed it with a second research to show that \"Justification by Probability\" is dominant in justification intended to link rulings to the causal reasons necessitating them and established for the accountable person as a sign for their application, and I provided extensive evidence for that with details explaining the Usuli Maqasid philosophy on which justification by probability is based (2). This was necessary in light of the severe criticism directed by some esteemed contemporaries (3) towards Usulis for their care and prioritization of justification by probability/cause over justification by wisdom, and that criticism stemmed from confusion among these esteemed individuals in defining what is meant by \"Justification by Wisdom\" which Usulis disagreed on its permissibility.",
    "foot_note": "1. Saleh, \"Cause, Wisdom, and Justification by Wisdom,\" Journal of Emir Abdelkader University of Islamic Sciences, Vol 31, Issue 2, 65.\n2. Saleh, \"Justification by Probability Not Wisdom: An Usuli Study,\" Al-Sirat Journal, Vol 21, Issue 38, 48.\n3. Shalabi, Justification of Rulings, 184; Imam, \"Research on Justification by Wisdom,\" Journal of Faculty of Sharia and Law in Assiut, Vol 3, Issue 18, 665; Al-Jubouri, \"Justification by Wisdom according to Usulis,\" Journal of Faculty of Arts - University of Baghdad, Issue 15, 191; Al-Hakami, \"The Truth of Disagreement in Justification by Wisdom,\" Journal of Umm Al-Qura University, Issue 9, 12.",
    "book_id": "1106",
    "new_page_number": 15
  },
  {
    "serial_number": "3433346",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 111,
    "volume_number": 1,
    "text": "I suffice here in this introductory section by quoting what serves the purpose from those two researches, lightening much of attribution and elongation, referring whoever wants more detail, examples, and documentation to the mentioned researches. So I say: Illah (Cause) is a common term with multiple meanings in the speech of Usulis, and it comes to them with two main meanings: Cause (Sabab) and Wisdom (Hikmah). As for Cause (Sabab), it is the apparent disciplined description whose occurrence necessitates the occurrence of the ruling regarding the accountable person, to achieve a wisdom, such as travel which necessitates the permissibility of breaking fast in Ramadan, and the sun's decline (Duluk) which necessitates the obligation of Dhuhr prayer. It is often expressed regarding the Cause among Usulis and jurists with other terms such as: Illah, Mujib (Obligator), Mu'arrif (Identifier), Manat (Basis), Muqtadi (Requirer), Causal Illah, Amarat al-Maslahah (Sign of Interest), and Mazannah (Probability). As for Wisdom (Hikmah), it is the intent of the ruling, or that for which the ruling was legislated. It can be defined as: The appropriate meaning of interest intended to be brought or warded off by the legislation of the ruling if it is taklifi (imposing obligation), or implied in it if it is wad'i (declaratory), or say: it is the motive of the Lawgiver for imposing the ruling, or for establishing it. Al-Ghazali said: \"We do not mean by wisdom anything other than the imaginary cause (Illah Mukhayalah) and the appropriate meaning\" (1). Al-Tufi said: \"What is meant by the wisdom of the ruling: is the appropriate meaning from which the ruling originated\" (2). It is expressed in the speech of jurists and Usulis as Interest (Maslahah), Eye of Interest, Face of Interest, Meaning, Imaginary Meaning, Appropriate Meaning, Illah, Ma'innah (Sign), Reality of Illah, Spirit of Illah, Cause of the Cause (Illat al-Sabab), Cause of the Illah, Motive, Carrier, Caller, Mover, Purpose, Significance, Aim, Intent, Objective, Intention, Goal, Benefit, and Final Cause. It is of two types: Wisdom of the Ruling, and Wisdom of the Cause. The Wisdom of the Ruling: is the appropriate meaning of interest intended to be brought or warded off by legislating the Taklifi ruling:",
    "foot_note": "1. Al-Ghazali, Shifa al-Ghalil, 613.\n2. Al-Tufi, Sharh Mukhtasar al-Rawdah, 1/423.",
    "book_id": "1106",
    "new_page_number": 16
  },
  {
    "serial_number": "3433347",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 112,
    "volume_number": 1,
    "text": "• Like the preservation of the mind intended from the prohibition of drinking alcohol. And achieving deterrence, and thus reducing killing, intended from the obligation of retribution (Qisas). • And like the preservation of family and lineage intended from the prohibition of adultery. • And like warding off hardship (=facilitation or alleviation) intended from the permissibility of breaking fast for the traveler. This type of wisdom is more worthy of being specifically named Objective (Maqsad), Purpose (Gharad), or Motive (Ba'ith). Wisdom of the Cause: is the meaning of interest for which the Lawgiver suspended the ruling on this cause due to the cause containing it, in order to achieve the wisdom of the Taklifi ruling resulting from this cause in the end: • Like the hardship contained in travel for which travel was made a cause for the permissibility of breaking fast; to achieve the wisdom of facilitation. • And like the loss of property contained in theft, for which theft was made a cause for the obligation of amputation; to achieve the wisdom of deterrence from wasting property. • And like the confusion of the mind contained in the judge's anger, for which anger was made a cause for the dislike or prohibition of judgment; to achieve the wisdom of justice. • And like intoxication contained in drinking alcohol, for which drinking alcohol was made a cause for the obligation of the prescribed punishment (Hadd); to achieve the wisdom of deterrence from wasting the mind, and warding off the corruptions resulting from its waste. The names most attached to this wisdom are: Meaning, Ma'innah (Sign), Cause of the Cause, Cause of the Illah, and Reality of the Illah. As for Probability (Mazannah), with Fatha on Mim and Kasra on Za, it is the locus/apparent disciplined description in which the existence of wisdom is thought to be. This locus - which is the probability of wisdom - differs according to the type of ruling: • If the ruling is Taklifi (imposing obligation), such as obligation and prohibition etc.: the locus is the action of the accountable person to which the ruling relates. For example, the locus in the ruling of prohibiting drinking alcohol is the act \"drinking alcohol,\" and this act...",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 17
  },
  {
    "serial_number": "3433348",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 113,
    "volume_number": 1,
    "text": "...is a probability for causing intoxication. The locus of the ruling in the prohibition of theft is the act of theft, and it is a probability for the loss of property. The locus of the ruling in the permissibility of sale is the act of sale (contracting), and it is a probability for the mutual consent of the buyers to exchange ownership, and this mutual consent is a probability for their desire, or need, for this exchange, and so on... • If the ruling is Wad'i (declaratory), such as cause, condition, and impediment, the locus is the action, attribute, or event that the Lawgiver placed or made a cause, condition, or impediment. It is the cause itself, or the condition, or the impediment, themselves: like the act of travel which is the cause for permitting breaking fast, and a probability for hardship. And the attribute of puberty which is a condition for the obligation of prayer, and a probability for the completion of reason. And the act of killing which is an impediment to entitlement to inheritance, and a probability for rushing something before its time by a forbidden act. Therefore, Probability (Mazannah), although famously used for Illah meaning Cause, is more general than it, because it includes the condition, the impediment, and the locus of the Taklifi ruling; as all of those are probabilities for the wisdom of the ruling related to them, whether Taklifi or Wad'i. The intended meaning of Illah when mentioned in the speech of Usulis is determined by context clues. If Illah and Cause (Sabab) are mentioned in one context, as Al-Shatibi and others mention, then the intended meaning of Illah then is Wisdom (i.e., the Final Cause). If Illah and Wisdom are mentioned in one context, like the saying of many Usulis: The ruling revolves with the Illah not with the Wisdom, then the intended meaning of Illah in this context is the Cause or Probability (Causal Illah). As for Justification (Ta'lil), it is used in Usul for: stating the cause of the ruling, whether that is by the action of the Lawgiver or the Mujtahid, and whether that is merely to show the legislative wisdom of the ruling without linking the ruling to this wisdom in existence and non-existence, or for the purpose of suspending the ruling on it in existence - as in Qiyas al-Tard (Analogy of Co-extensiveness) - or in non-existence - as in Qiyas al-Aks (Analogy of Inverse) - or both. Justification is also used for the saying that rulings are justified by interests. Those who advocate Justification are the majority (Jumhur), and they are opposed by the Zahiris (Literalists) who deny Justification.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 18
  },
  {
    "serial_number": "3433349",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 114,
    "volume_number": 1,
    "text": "As for the terms: Justification by Probability and Justification by Wisdom, what is meant by them is suspending the ruling on the cause (Illah), whether it is a causal cause (Probability), or a final cause (Wisdom). So the saying of Usulis: Justification by wisdom is permissible - or not permissible - means: Suspending the ruling on wisdom, in existence or non-existence, is permissible - or not permissible. It does not mean: that rulings are principally justified by interests and wisdoms, nor does it mean merely stating the legislative wisdom of the ruling without suspending it on it. If the preceding is established, then \"Justification by Probability\" is suspending the ruling, in existence, or non-existence, or both, on the probability, and it is used in contrast to \"Justification by Wisdom\" which is suspending the ruling, in existence, or non-existence, or both, on wisdom. The meaning of Suspension in existence: Affirming the ruling in every locus where probability or wisdom is found. This may require Qiyas al-Tard (Analogy of Co-extensiveness), as in measuring extreme hunger and pain against anger; because they confuse the mind (existence of wisdom). And as in measuring rice against wheat by the cause of volume measure (Kayl) which is the control of the locus of the ruling prohibiting Riba al-Fadl according to Hanafis (existence of probability). The meaning of Suspension in non-existence: Negating the ruling from every locus where probability or wisdom is absent. This may require Qiyas al-Aks (Analogy of Inverse), such as negating the ruling of dislike for the judge's judgment with slight anger; because it does not confuse (absence of wisdom). And as in the Hanafis' negation of the ruling of prohibition for selling a small amount of wheat for a small amount of wheat, like a handful for two handfuls; because it is not measured by volume (absence of probability). The occurrence of probability and wisdom in individual occurrences being judged has three states: First: That they occur together in the occurrence being judged. Second: That they are absent together. Third: That one of them exists in the occurrence without the other. Only in this last case does a jurisprudential problem arise, and Ijtihad is needed to differentiate and balance between justification by probability and justification by wisdom.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 19
  },
  {
    "serial_number": "3433350",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 115,
    "volume_number": 1,
    "text": "The general rule governing the process of balancing between suspending the ruling on probability and suspending it on wisdom among jurists and Usulis, by consensus, is that the origin and predominant practice is to suspend the ruling on probability (which is usually text-based) not on wisdom (which is usually deduced). This origin is departed from in special cases which we will clarify in this research, God willing. The purpose of suspending the ruling on probability not on wisdom is the Lawgiver's aspiration for discipline, decisiveness, and clarity in establishing rulings and enacting laws. This objective of discipline implies other objectives or interests. Discipline, upon verification, is not an end in itself, but the true end is the interests resulting from it for the accountable individuals and groups. These interests - resulting from discipline - are represented in three meanings that can be counted as the utilitarian goals for suspending rulings on probabilities rather than wisdoms, which are: Facilitation, Precaution, and Cutting off Dispute. These goals may gather, all or some, in a single example and issue, and the singling out of one or its dominance over others may be manifested in other examples or issues. Section Two: Forms of Jurists' Actions When the Ruling Oscillates Between Probability and Wisdom. Through induction and reflection on what is found among jurists of jurisprudential issues, where the ruling oscillates between being suspended on probability, or suspended on wisdom, I found that their actions take four forms: First: That they sever the ruling from the text-based probability, and revolve it with wisdom in existence and non-existence, and this is if the wisdom is unique to the ruling, and clearly understood from the text on probability. Example: \"A judge should not judge between two while he is angry\" (1), they revolved the ruling of dislike of judgment with confusion of the mind (Wisdom) in existence and non-existence, and severed it from revolving with anger itself (the text-based Probability), so everything that confuses - like extreme pain, congestion, hunger, and thirst - judgment is disliked with it. And slight non-confusing anger lifts the ruling of dislike. So anger itself is no longer the basis for the ruling, but rather the confusion of the mind, in existence and non-existence (2).",
    "foot_note": "1. Ahmad, Al-Musnad, 34/14 and the wording is his. Al-Arna'ut said: Its chain is authentic; Al-Bukhari, Al-Sahih, 9/65; Muslim, Al-Sahih, 3/1342.\n2. See: Ibn Al-Mundhir, Al-Ishraf 'ala Madhahib al-Ulama, 4/185; Ibn Hajar, Fath al-Bari, 13/137.",
    "book_id": "1106",
    "new_page_number": 20
  },
  {
    "serial_number": "3433351",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 116,
    "volume_number": 1,
    "text": "Another example: The majority's Ijtihad regarding the Hadith: \"If one of you wakes up from his sleep, let him wash his hand before putting it into his ablution water, for one of you does not know where his hand spent the night\" (1). They revolved the ruling of the recommendation of washing the hand on the doubt of its impurity (Wisdom), whether that was due to waking up from sleep (the text-based Probability), or other cases, and lifted the ruling of recommendation of washing from the one waking up from sleep who is certain of his hand's lack of impurity, such as one who slept with his hands tied behind his back, or one who slept with his hands in gloves. So waking up from sleep is not the basis for the ruling, but rather the doubt regarding the hand's impurity, in existence and non-existence (2). The second form: Opposite of the first, which is: That they revolve the ruling with the text-based Probability, and sever it from Wisdom completely, and this is in devotional, estimated, and specific-to-their-owners rulings. Example: The prohibition of pork, its wisdom is being filth and unclean, yet nothing else of animals is measured against it, even if assumed to be dirtier than it, and the ruling of prohibition is not lifted from the pig, even if we made it live in a clean environment, and fed it only clean food. So the ruling of prohibition here revolves with the Probability (locus of ruling), which is eating pork, in existence and non-existence, and is severed from the wisdom of prohibition, which is the pig being filth and unclean or a source of many diseases, and other things said about the wisdom of prohibiting eating pork. Another example: The obligation of starting prayer according to the majority with the wording of Takbir \"Allahu Akbar\" for the wisdom of glorifying and exalting Allah Almighty, and no other wording is measured against the wording of Takbir, even if it conveys the meaning of glorification and exaltation, such as \"Allahu A'zam\" and \"Allahu Ajall\", and prayer is valid with the wording of Takbir, even if the worshiper at that time is heedless of the meaning of exaltation and glorification (loss of Wisdom) (3). Another example: Rulings specific by text, such as the testimony of Khuzaymah which was made equal to the testimony of two men (4), and the sufficiency of a young female goat (Anaq) for Abu Burdah (5), and the permissibility of marriage to more than four for the Prophet, peace be upon him, and other rulings specific to their owners by text, whose wisdom of specification might be understood, but despite that, they are not measured against.",
    "foot_note": "1. Al-Bukhari, Al-Sahih, 1/44; Muslim, Al-Sahih, 1/233.\n2. See: Al-Nawawi, Sharh Sahih Muslim, 3/180; Ibn Hajar, Fath al-Bari, 1/264.\n3. See: Ibn Daqiq al-Eid, Ihkam al-Ahkam Sharh Umdat al-Ahkam, 1/260.\n4. Al-Albani said: \"Authentic. Narrated by Abu Dawood (3607), Al-Nasa'i (2/229), Al-Hakim (2/17-18), and Ahmad (5/215)\". Al-Albani, Irwa al-Ghalil, 5/127.\n5. Al-Bukhari, Al-Sahih, 2/23; Muslim, Al-Sahih, 3/1552.",
    "book_id": "1106",
    "new_page_number": 21
  },
  {
    "serial_number": "3433352",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 117,
    "volume_number": 1,
    "text": "The third form: That they keep the ruling revolving with the text-based Probability not with Wisdom, but they stipulate an additional condition in the Probability turning towards Wisdom. Example: The ruling of permitting breaking fast in Ramadan with travel, they revolved the ruling with travel not with hardship, so they did not permit porters and owners of hard professions to break fast like the traveler (1). Despite this, in their majority, they restricted the travel permitting breaking fast to being long, and defined its length: either by a specific distance, like four Burud, or by a distance crossed in a specific period, like a journey of three days, or a day and night, turning towards the meaning of hardship (2). Similarly, the illness permitting breaking fast, they disciplined it being one with which fasting is difficult or harmful, immediately or eventually (3). Another example: The ruling of breaking ablution by touching a woman according to the majority, the text-based cause is absolute touching of women, yet jurists stipulated conditions in this touching to be a probability for Wisdom, i.e., for the meaning appropriate for the occurrence of breaking ablution by touching a woman, which is desire. Malikis (4) and Hanbalis (5) stipulated the existence of desire (pleasure) or intending it. Hanafis (6) stipulated the existence of obscene touching, i.e., direct skin-to-skin contact, as what is considered by them is strong desire that is a probability for the emission of Madhy (pre-seminal fluid), not just any desire. Shafi'is (7) stipulated that the woman be one who is usually intended by touching for pleasure and desire, so they did not consider touching young girls, nor touching Mahrams, because they are not a probability for desire. All these stipulations - despite their variation - turn in the end to the wisdom of the ruling of breaking ablution by touching a woman, which is that it is a probability for desire and pleasure. The fourth form: Opposite of the previous: That they revolve the ruling with Wisdom not with the text-based Probability, but they stipulate with the realization of Wisdom an additional condition turning towards the text-based Probability. Example: The Ijtihad of Shafi'is (8) and Hanbalis (9) in the Hadith of cleaning oneself (Istinja) that he, peace be upon him, \"ordered three stones\" (10). They revolved the ruling on cleaning the place from impurity (Wisdom), and did not revolve it on using three stones (Probability). From the side of existence: They measured against stones every...",
    "foot_note": "1. See: Ibn Abidin, Hashiyat Ibn Abidin, 2/420; Al-Bakri Al-Dimyati, I'anat al-Talibin, 2/267; Al-Bahuti, Daqa'iq Uli al-Nuha, 1/478; Kuwaiti Fiqh Encyclopedia, 17/176.\n2. See: Ibn Qudamah, Al-Mughni, 3/106; Ibn Al-Humam, Fath al-Qadir, 2/30.\n3. Ibn Al-Mundhir, Al-Ishraf 'ala Madhahib al-Ulama, 3/138; Kuwaiti Fiqh Encyclopedia, 28/45.\n4. Al-Hattab, Mawahib al-Jalil fi Sharh Mukhtasar Khalil, 1/296.\n5. Al-Bahuti, Kashshaf al-Qina', 1/301.\n6. Al-Zayla'i, Tabyin al-Haqa'iq Sharh Kanz al-Daqa'iq, 1/12.\n7. Al-Shirbini, Mughni al-Muhtaj, 1/145.\n8. Previous reference, 1/163.\n9. Al-Bahuti, Kashshaf al-Qina', 1/139.\n10. Abu Dawood, Sunan Abu Dawood, 1/208. Strengthened by Al-Arna'ut and classified Hasan by Al-Albani.",
    "book_id": "1106",
    "new_page_number": 22
  },
  {
    "serial_number": "3433353",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 118,
    "volume_number": 1,
    "text": "pure remover, like paper and others, and from the side of non-existence: They said three stones are not sufficient if they do not clean the place. However, with that, they stipulated in the remover that it be used in three wipes at least, and this stipulation is turning towards the word 'three' appearing in the text-based Probability. As for Hanafis (1) and Malikis (2), they revolved the ruling with the wisdom of cleaning and severed it from Probability completely, so they permitted cleaning oneself with every pure remover, and said three stones are not sufficient if they do not clean the place, and did not stipulate in the remover that it be used in three wipes, but one wipe suffices if it is cleaning, so consideration for them is by the wisdom of cleaning not by the remover itself nor its number. They revolved the ruling with Wisdom entirely, in existence and non-existence, due to its clarity and uniqueness, so their Ijtihad in this issue is of the first form. Shafi'is and Hanbalis revolved it with Wisdom, but they stipulated with it a condition derived from the text-based Probability, either out of respect for the apparent text, or because they estimated the existence of a type of worship (Ta'abbud) in the text-based ruling. Or for a moral matter which is that cleaning the anus is difficult to be with one wipe, and it is usually difficult to verify the occurrence of cleaning in reality due to the absence of its place from the cleaner's sight, so precaution was not to suffice with less than three wipes. And it is a valid observation. Section Three: Factors Affecting the Suspension of Ruling on Probability or Wisdom in Occurrences: Theoretically, justification by Wisdom itself is preferred over justification by Probability in terms of being justification by the intent of the ruling itself, not by what is a means to it, and this is closer to achieving the Lawgiver's intent from the ruling without missing it in any particular of the ruling's particulars. Conversely, justification by Probability is preferred over justification by Wisdom in terms of achieving secondary interests represented in Discipline with what this discipline implies of Facilitation, Precaution, and Cutting off Dispute, in addition to achieving Wisdom and the intent of the ruling in most particulars. And the sacrifice of missing the achievement of the intent of the ruling in some particulars; resulting from suspension on Probability, is compensated by other interests resulting from Discipline and the regularity of rulings.",
    "foot_note": "1. Ibn Al-Humam, Fath al-Qadir, 1/213.\n2. Al-Hattab, Mawahib al-Jalil fi Sharh Mukhtasar Khalil, 1/289.",
    "book_id": "1106",
    "new_page_number": 23
  },
  {
    "serial_number": "3433354",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 119,
    "volume_number": 1,
    "text": "For the sake of this theoretical equivalence between these two types of justification, each from a side, jurists oscillate between them in individual occurrences. Some justify the ruling by Wisdom in an occurrence, and another jurist opposes him and justifies the ruling by Probability in the same occurrence, and sometimes a single Mujtahid has two opinions in the same occurrence: one revolving with Probability, and another revolving with Wisdom. Although the dominant practice is that the Lawgiver justifies by disciplined Probabilities, as mentioned by more than one Usuli (1), His justification by Wisdoms, and by absolute descriptions not disciplined by themselves with all discipline, is also frequent. Examples of the oscillation of the ruling of an occurrence between being conducted with the requirement of Probability, or with the requirement of Wisdom - as passed by us, and will also pass in the remainder of this research - are very many. And the inclination of the jurist to determine the ruling according to what Probability requires (Justification by Probability), or what Wisdom requires (Justification by Wisdom), is influenced by multiple factors. It is of great importance to shed light on these factors, but before that, the point of dispute in justification by Wisdom which conflicts with justification by Probability must be defined; since defining that is an indispensable introduction to realizing the extent of the influence of these factors on suspending the ruling on Probability or Wisdom. Therefore, this section came in two branches: One: Defining the point of dispute in justification by Wisdom which conflicts with justification by Probability. Second Branch: Explaining the factors affecting the suspension of ruling on Probability or Wisdom in occurrences. First Branch: Defining the point of dispute in justification by Wisdom which conflicts with justification by Probability: Usulis agreed - in principle - on the permissibility of justification by Probability: text-based or Ijtihadi. They agree - as it appears to us - on the permissibility of justification by Wisdom in three places (2): One: If the justification is intended merely to show appropriateness and interest without suspending the ruling on Wisdom.",
    "foot_note": "1. See: Saleh, \"Justification by Probability Not Wisdom: An Usuli Study,\" Al-Sirat Journal, Vol 21, Issue 38, 53.\n2. See: Saleh, \"Cause, Wisdom, and Justification by Wisdom,\" Journal of Emir Abdelkader University of Islamic Sciences, Vol 31, Issue 2, 97.",
    "book_id": "1106",
    "new_page_number": 24
  },
  {
    "serial_number": "3433355",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 120,
    "volume_number": 1,
    "text": "The second place: If Wisdom is apparent and disciplined, then what applies to Illah/Probability applies to it. The third place: If Wisdom is a wisdom for a ruling derived from primary Taklifi address (i.e., not based on a cause), even if it is not apparent or disciplined, and the ruling is suspended on it in existence, such as the ruling of prohibiting theft to preserve wealth; so everything that leads to wasting wealth is measured against it in prohibition - not in the obligation of Hadd - such as grave robbing, pickpocketing, embezzlement... etc. They disagreed on the permissibility of justification by Wisdom in two places: One: In the wisdom of the Wad'i ruling (wisdom of cause, impediment, and condition) - or the Taklifi address resulting from it - whether it is permissible to extend the ruling by it or not, which is known as the issue of Analogy in Causes (Qiyas fi al-Asbab), such as measuring grave robbing, pickpocketing, and embezzlement against theft in the obligation of Hadd for the wisdom of deterrence from wasting wealth, and measuring hard labor against travel in permitting breaking fast in Ramadan for the wisdom of warding off hardship, where transmitters reported - as Al-Ghazali said - from Abu Zaid Al-Dabbusi (d. 430 AH): \"That rulings follow causes not wisdoms, and causes are not justified, and establishing causes by opinion and analogy has no validity, and wisdom is the fruit of the ruling and its intent not its cause\" (1). He said: \"It is not for us to establish legal rulings nor lift them by opinion, nor establish their causes, and establishing causes implies establishing rulings, nor their conditions, for establishing impeding conditions implies lifting rulings. And if that is not for us by opinion, the justification of its claimant is invalid because he justifies for establishing\" (2). What Al-Dabbusi said falls under what his Sheikh's Sheikh Al-Karkhi established when he said: (d. 340 AH): \"The principle is that one differentiates between the cause of the ruling and its wisdom, for its cause is obligatory and its wisdom is not obligatory\" (3). What Usulis deduce on the disagreement in this issue is the disagreement between the Majority and Hanafis in: measuring the grave robber against the thief, in the obligation of amputation, and the sodomite against the adulterer, in the obligation of Hadd, and the killer with a heavy object against the killer with a sharp object, in the obligation of Qisas.",
    "foot_note": "1. Al-Ghazali, Shifa al-Ghalil, 604.\n2. Al-Dabbusi, Taqwim al-Adillah fi Usul al-Fiqh, 295.\n3. Al-Karkhi, \"Usul Al-Karkhi,\" in Risalah fi al-Usul allati 'alayha Madar Furu' al-Hanafiyyah, 127.",
    "book_id": "1106",
    "new_page_number": 25
  },
  {
    "serial_number": "3433356",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 121,
    "volume_number": 1,
    "text": "This deduction is not sound from our point of view; as it can be attributed to their disagreement in analogy in causes of Hodoud (prescribed punishments) specifically, not in general causes, and Hodoud have the feature of being warded off by doubt, therefore some Hanafis did not accept singular reports (Khabar al-Wahid) in proving them, let alone analogy (1). The saying of preventing analogy in causes faced severe criticism from non-Hanafi Usulis. Al-Ghazali described it as \"corrupt, and the proof is decisive that establishing the cause is a legal ruling, so its rationale can be conceived, and it can be extended to another cause\" (2). Ibn Taymiyyah said: It is \"contrary to what jurists are upon, and it is a decidedly false saying\" (3). I say: What confirms its corruption and invalidity is the consensus of those who use analogy, even Hanafis, on measuring what confuses the mind against anger in \"A judge should not judge while he is angry,\" for it is \"measuring probability against probability\" as Ibn Daqiq al-Eid said (4). The branches reported from Abu Hanifa, may Allah have mercy on him, which result in measuring causes against causes, are many, but Hanafis excuse them by saying they are not analogy but rather indication of text (Dalalat Nass - concept of agreement), or refinement of the basis (Tanqih al-Manat) (5). If that is the case, the issue reverts to a disagreement in wording and naming, and has no fruit, which is what a number of those who singled out the issue for research concluded (6). The second place: They disagreed on the Final Cause (Wisdom of the Ruling or Wisdom of the Cause) if it returns - inversely - to its text-based probability by specification or restriction, whether this probability is a locus for Taklifi ruling, or Wad'i, as happened in Al-Shafi'i's exception of \"Safe Travel\" from the generality of Probability (Travel) in the Hadith prohibiting women's travel except with a Mahram. We have devoted research, rooting, and examples to the issue of the cause returning to its origin by specification in the book \"The Impact of Justifying the Text on its Indication,\" and increased its clarification in the research \"Benefits of Justifying Rulings.\" The summary of the statement in it: It is permissible in principle to specify and restrict by the Cause, yet every jurisprudential issue remains subject to a special view from the Mujtahid on its own, depending on balancing between the strength of the Cause/Wisdom on one hand, and the strength of the inclusion of the Generality/Absolute for the locus or individual intended to be excluded from it...",
    "foot_note": "1. Abu Al-Hussein Al-Basri, Al-Mu'tamad, 2/96.\n2. Al-Mustasfa, 329 adapted.\n3. Ibn Taymiyyah, Al-Sarim Al-Maslul, 487.\n4. Ihkam al-Ahkam Sharh Umdat al-Ahkam, 2/272.\n5. Al-Sarakhsi, Usul Al-Sarakhsi, 1/242.\n6. See: Al-Rabiah, \"Analogy in Causes,\" Adwa' al-Sharia, Issue 12, 93; Al-Namla, Al-Muhadhdhab fi Ilm Usul al-Fiqh al-Muqaran, 4/1946.",
    "book_id": "1106",
    "new_page_number": 26
  },
  {
    "serial_number": "3433357",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 122,
    "volume_number": 1,
    "text": "...by Wisdom on the other hand. Just as Wisdom has degrees in terms of strength, Generality also varies in the strength of its indication of individuals/locales included in it, depending on the individual/locale intended for specification: is it frequent or rare, common or scarce, comes to mind when mentioning the General or not. If the preceding is established and the point of dispute in justification by Wisdom which opposes justification by Probability is defined, it is time to explain the factors affecting justification by one of the two when meeting: Probability or Wisdom. Second Branch: Explanation of the Factors Affecting the Suspension of Ruling on Probability or Wisdom in Occurrences: They are, by our induction, the following nine factors: 1. Probability or Wisdom being text-based or Ijtihadi. 2. Existence of an explicit text canceling justification by Probability or Wisdom in the specific occurrence. 3. Extent of need for justification by Probability, or Wisdom, to interpret the apparent text or specify it. 4. Doctrines of the Companions in the occurrence under consideration, and whether they went with Probability or Wisdom. 5. Extent of hiddenness or fluctuation in Wisdom, which may change with changing time. 6. Extent of Probability leading to Wisdom, which may change with changing time. 7. Extent of strength of Wisdom's appropriateness to the ruling of the occurrence. 8. Extent of Wisdom's exclusivity to the ruling of the occurrence. 9. The occurrence being justified is in a field where Worship (Ta'abbud) is frequent, or in a field where Justification (Ta'lil) is frequent. First: Probability or Wisdom being text-based or Ijtihadi: There is no doubt that the legal text has priority in the view of the Mujtahid when determining the legal ruling in places of disagreement; it overrides and is not overridden, judges and is not judged upon. Therefore, Probabilities not based on explicit text - being said by scholars through Ijtihad - as well as derived Wisdoms...",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 27
  },
  {
    "serial_number": "3433358",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 123,
    "volume_number": 1,
    "text": "...do not enjoy the same weight and consideration attained by text-based or agreed-upon Probabilities and Wisdoms. Probability and Wisdom in individual occurrences have four states in terms of reliance on text or Ijtihad, as follows: First: Probability is text-based and Wisdom is Ijtihadi. Second: The opposite: Wisdom is text-based and Probability is Ijtihadi. Third: Probability and Wisdom are both text-based. Fourth: The opposite: Probability and Wisdom are both Ijtihadi. Below is shedding light on these four states: First State: Probability is text-based and Wisdom is Ijtihadi: Example: Prohibition of women's travel except with a Mahram or husband. Travel, which is the Probability, is text-based. As for Wisdom, which is road safety, it is deduced. Therefore, the majority revolved with Probability and disputed that safety alone is intended by the prohibition, because a woman, in addition to safety, also needs someone to take care of her needs during travel (1). Another example is cutting off Zakat for those whose hearts are to be reconciled (Al-Mu'allafatu Qulubuhum), as in the Ijtihad of Abu Hanifa, may Allah have mercy on him, because the Prophet's giving to them, peace be upon him, was justified by the wisdom of Muslims' weakness. So giving to them was for the state's need for them to ward off their potential danger if they turned, or ward off the danger of those behind them of disbelievers, or to increase the number of Muslims. With the glory of Islam, its spread, and abundance of followers, this wisdom is negated. The majority revolved with Probability which is the existence of the description of reconciliation (Ta'lif) itself, not with the mentioned Wisdom, and saw that reconciliation and endearment to Islam is also intended regardless of the state's need for those reconciled or lack thereof, and thus is not affected by the state's strength or weakness (2).",
    "foot_note": "1. See: Ibn Al-Humam, Fath al-Qadir, 2/421.\n2. See: Abu Ubaid, Al-Amwal, 720; Ibn Hubayrah, Ikhtilaf al-A'immah al-Ulama, 1/215.",
    "book_id": "1106",
    "new_page_number": 28
  },
  {
    "serial_number": "3433359",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 124,
    "volume_number": 1,
    "text": "Second State: Wisdom is text-based and Probability is Ijtihadi: Dominant in Sharia is stating Probability not Wisdom, but there are cases where the Lawgiver states a description not reaching the utmost discipline and appearance, or perhaps corruption would result from it with changing time, so jurists strive to place a control for this description to be a probability for it, and suspend the ruling on this Ijtihadi Probability, and sever it from the text-based legal description (Text-based Probability), meaning they substitute the Ijtihadi Probability for the Text-based Probability. Then the Text-based Probability becomes a wisdom relative to the Ijtihadi Probability; because this latter (Ijtihadi Probability) leads to it (i.e., to the Text-based Probability) and disciplines it. We had indicated that considering a description as \"Probability\" or \"Wisdom\" is relative in many instances governed by the phenomenon of sequence of causes and descriptions, so the description is a probability relative to what falls after it in the sequence of descriptions, and is a wisdom, at the same time, relative to what falls before it (1). Example of this state is the suspension by the majority of jurists of full dowry obligation on the husband merely by his seclusion with the woman, although the text suspended the ruling apparently on consummation (Dukhul) and did not mention seclusion. But when many jurists saw that consummation is characterized by hiddenness from witnesses, making it difficult to prove in judicial proceedings if claimed by the woman and denied by the husband, they suspended the ruling on its probability, which is seclusion, and revolved the ruling with it regardless of the occurrence of consummation or not (2). Another example is jurists suspending puberty on a specific age, whether signs of puberty appeared on the accountable person or not, although Sharia stated wet dream and menstruation and did not state age, but they considered this age a probability for true puberty, and differed much in estimating it. Similarly, they differed on the age at which lineage is established from the husband; some made it the age of puberty itself; because it is a probability for the ability to procreate; and some went below that; because true puberty is often less than that in reality, and lineage is based on precaution (3).",
    "foot_note": "1. Saleh, \"Cause, Wisdom, and Justification by Wisdom,\" Journal of Emir Abdelkader University of Islamic Sciences, Vol 31, Issue 2, 86.\n2. See: Al-Tahawi, Mukhtasar Ikhtilaf al-Ulama, 2/348.\n3. See: Al-Subki, Ibraz al-Hukm min Hadith Raf' al-Qalam, 70.",
    "book_id": "1106",
    "new_page_number": 29
  },
  {
    "serial_number": "3433360",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 125,
    "volume_number": 1,
    "text": "Close to that also is the Ijtihad of Abu Hanifa, may Allah have mercy on him, in defining the age of Rushd (maturity) (at which the guardian hands over wealth to the orphan) as not exceeding twenty-five years (1), although the verse obligating handover made perceiving maturity from the orphan absolute without limiting it to a specific age. But Abu Hanifa, may Allah have mercy on him, saw that the age of twenty-five is a predominant probability for maturity, so he suspended the ruling on it, whether maturity was actually perceived from the orphan or not, seemingly to prevent guardians' abuse in claiming the orphan's lack of maturity. Third State: Probability and Wisdom are both text-based: This is frequent in Sharia, as the text came in the license of breaking fast in Ramadan in travel and illness for the wisdom of Facilitation. And the command for ablution when standing for prayer for the wisdom of Purification. And the command for marriage when having ability (Ba'ah) because it lowers the gaze and protects the private parts. And the recommendation to limit to one wife because it is further from injustice or poverty depending on exegetes' difference on the Almighty's saying: {That is more suitable that you may not incline [to injustice] (or burden yourselves)} [An-Nisa: 3] (2). And the prohibition of alcohol and gambling for enmity, hatred, and hindering from remembrance. The prohibition of alcohol came in the Sunnah justified by intoxication, which is a type of discipline for the Wisdom mentioned in the Quran, because the occurrence of intoxication is a probability for the occurrence of enmity, hatred, and hindering from prayer and remembrance. And the prohibition of traveling with the Quran for fear the enemy might seize it. And the prohibition of two conspiring without the third; because that grieves him, and much more. Fourth State: Probability and Wisdom are both Ijtihadi: This is only in rulings whose probability and wisdom are not text-based, which are rulings based on unrestricted interest (Istishlah Mursal), such as in administrative regulations and Wad'i rulings, like obligating the Mufti and Judge to judge by a specific school or the adopted opinion within it, for the wisdom of disciplining the judiciary and preventing manipulation of it. And obligating people with traffic rules and punishing for leaving them. And likewise obligating them to obtain ID cards, passports, work and residence permits, and other...",
    "foot_note": "1. Al-Sarakhsi, Al-Mabsut, 24/162.\n2. See: Al-Tabari, Jami' al-Bayan, 7/458.",
    "book_id": "1106",
    "new_page_number": 30
  },
  {
    "serial_number": "3433361",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 126,
    "volume_number": 1,
    "text": "...administrative regulations aiming to preserve interests for people and ward off corruptions from them by means disciplined by their causes, conditions, and impediments through Ijtihad not text. The absence of legal text on these means/probabilities specifically, nor on a close counterpart to measure against, does not mean their illegitimacy and lack of consideration, because the interests resulting from them fall under legal interests in their higher genera. Being Mursala (unrestricted) rulings means they are unrestricted from text and analogy indicating the interest meaning resulting from them specifically or by their close type, not unrestricted from the genus of legal interests, such as the general preservation of religion, self, mind, wealth, lineage, and honor; rather they are included in them. Therefore, these Probabilities achieving these interests included in the general objectives of Sharia were considered legal probabilities. The summary after reviewing these four states and their examples is that stating Probability or Wisdom or Consensus on them gives them a merit and consideration stronger than if they were not text-based, due to the indication of the Lawgiver's consideration carried by the text - and likewise Consensus. It is worth noting here that stating each of Probability or Wisdom may be by a single text or a group of texts, and may be by explicit or non-explicit (indicative) text(s). All this affects the strength of reliance on each of Probability or Wisdom. Example: The issue of prohibiting women's travel except with a Mahram, its wisdom, which is road safety, is deduced, but Shafi'is strengthened it with the indicative meaning in the Hadith: \"You will surely see the woman in a litter (traveling) from Al-Hirah until she circumambulates the Kaaba, fearing no one but Allah\" (1). Another example is the prohibition of trailing the garment (Isbal), it came absolute in texts and restricted in others by the wisdom of vanity (Khuyala') (2). And the suspension of the ruling of trailing, in non-existence, on vanity came in a semi-explicit text, where he, peace be upon him, said to Abu Bakr: \"You do not do that out of vanity\" (3). This had...",
    "foot_note": "1. Al-Bukhari, Al-Sahih, 4/197.\n2. See: Previous reference, 7/141; Muslim, Al-Sahih, 1/102.\n3. Al-Bukhari, Al-Sahih, 5/6.",
    "book_id": "1106",
    "new_page_number": 31
  },
  {
    "serial_number": "3433362",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 127,
    "volume_number": 1,
    "text": "...a great impact on the majority of jurists adopting the saying of not suspending the ruling of prohibition on mere trailing (Probability), but on what trailing implies customarily of the meaning of vanity (Wisdom). Second: Existence of an explicit text canceling justification by Probability or Wisdom in the specific occurrence: This factor affects in a way opposite to the previous factor; instead of supporting the consideration of Probability or Wisdom by text, the Lawgiver may intend to cancel the consideration of justification by one of them by stating this cancellation. Examples include not considering \"Resemblance\" in attaching the newborn's lineage to the husband or master; as there is no doubt that the lack of resemblance between the newborn and husband - like a white child to black parents or vice versa - although not decisive in negating lineage, is a strong probability for doubting it. Yet, the Prophet, peace be upon him, canceled it on its own as evidence for proving or negating lineage, as indicated by the two Hadiths: the Hadith \"Perhaps a gene pulled him\" (1), and the Hadith of Zam'ah's son: \"The child is for the bed\" (2). Another example is the disbeliever declaring his Islam with existing indications of his lack of truthfulness in that, such as declaring the word of faith under the sword, so the predominant thought is that he submitted seeking refuge to save his blood not out of faith. Yet the text came with the necessity of acting on Probability (declaring the word of Islam), and abandoning reliance on Wisdom (reality of Faith), as indicated by the Hadith of Usamah bin Zaid, may Allah be pleased with him, when he killed one who uttered the word of Tawhid out of fear of the sword, so the Prophet, peace be upon him, said to him: \"O Usamah, did you kill him after he said La Ilaha Illa Allah\" (3). Among them: Abandoning reliance on the thought of breaking ablution (Hadath) in prayer by mere internal sensation, without hearing an apparent sound or smelling a scent (4). In this is evidence for the necessity of abandoning the hidden sign (probability of Hadath), and relying on the definitive apparent sign with which the occurrence of Wisdom (reality of Hadath) is certain; it is transferring consideration from Probability to Ma'innah/Wisdom. Similarly, in ruling on the impurity of clothes or place, several legal evidences indicated considering Ma'innah/Wisdom and not relying on Probabilities.",
    "foot_note": "1. Previous reference, 7/53; Muslim, Al-Sahih, 2/1137.\n2. Al-Bukhari, Al-Sahih, 3/81; Muslim, Al-Sahih, 2/1080.\n3. Al-Bukhari, Al-Sahih, 5/144; Muslim, Al-Sahih, 1/96.\n4. See: Al-Bukhari, Al-Sahih, 1/39; Muslim, Al-Sahih, 1/276.",
    "book_id": "1106",
    "new_page_number": 32
  },
  {
    "serial_number": "3433363",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 128,
    "volume_number": 1,
    "text": "Examples of canceling the consideration of justification by Wisdom in some places include what the text indicated of remaining rulings after the removal of their wisdom for which they were legislated initially, such as his jogging (Ramal) and uncovering the right shoulder (Idtiba'), peace be upon him, in the Farewell Pilgrimage, while there was no polytheist in Mecca that day. This indicated canceling justification by Wisdom for which jogging and Idtiba' were legislated in Umrah al-Qada', which is showing strength and endurance to polytheists (1). Also among them: Canceling justification by the wisdom of fear for which shortening prayer in travel was legislated: {And when you travel throughout the land, there is no blame upon you for shortening the prayer, [especially] if you fear that those who disbelieve may disrupt [or attack] you} [An-Nisa: 101], due to the continuation of the Prophet's action, peace be upon him, of shortening, even with the lifting of fear, and his saying when questioned about that: \"It is a charity Allah has bestowed upon you, so accept His charity\" (2). It is worth noting here that the removal of wisdom in these occurrences does not mean the ruling continued without wisdom absolutely, this is not possible because the Lawgiver is Wise. Rather, all there is to it is that the ruling was legislated initially for a specific wisdom then continued for another wisdom that succeeded the first wisdom. Third: Extent of need for justification by Probability, or Wisdom, to interpret the apparent text or specify it: It is not necessary that the Probability or Wisdom said by Ijtihad be occurring opposite to an explicit text, but rather opposite to an apparent or general text. Then, jurists' paths vary in following either. Example: The famous incident of the command to pray in Banu Qurayzah (3). Those who considered Wisdom looked at hastening, so they prayed on the road when they feared missing the time, excepting this case from the generality of the text in all conditions. Those who did not consider Wisdom due to its contradiction with the apparent text prayed in Banu Qurayzah even outside the time. Or it is said that they saw stopping for prayer on the road with what it entails of delay, even if slight, misses the wisdom of hastening even partially. Then the disagreement between the parties is not merely due to conflict between wording and meaning, as many have customarily mentioned, but due to difference of opinion in what achieves Wisdom fully or diminishes it somewhat. This is what we prefer because the meaning of hastening...",
    "foot_note": "1. Al-Bukhari, Al-Sahih, 2/159; Muslim, Al-Sahih, 2/923.\n2. Muslim, Al-Sahih, 1/478.\n3. Al-Bukhari, Al-Sahih, 2/15; Muslim, Al-Sahih, 3/1391.",
    "book_id": "1106",
    "new_page_number": 33
  },
  {
    "serial_number": "3433364",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Suspension of Ruling on Probability or Wisdom - An Usuli Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 129,
    "volume_number": 1,
    "text": "...understood from the text is extremely clear, and it is unlikely that a large group of Companions would ignore it completely and cling to wordings rigidly, in the manner of Zahiris. We had pointed previously in the introduction of this section to the issue of \"Impact of Justifying the Text on its Indication,\" and the summary of the statement in it, so we do not repeat the speech here. Sometimes the Probability said by Ijtihad is what contradicts the apparent text not the Wisdom, as in the majority's Ijtihad in suspending establishment of dowry on seclusion not consummation, and as in Abu Hanifa's Ijtihad restricting perceiving maturity to a specific age contrary to the absolute text of the Lawgiver. In these cases - when Wisdom or Ijtihadi Probability occurs opposite to the apparent text - the Mujtahid resorts to balancing between the two assumptions (Zann): the assumption derived from the apparent text, and the assumption derived from Wisdom or Ijtihadi Probability. No doubt he does not turn to what Probability or Wisdom requires unless he finds one of them strong enough to exceed the strength of appearance in the wordings of the text opposite to it. Fourth: Doctrines of the Companions in the occurrence under consideration, and whether they went with Probability or Wisdom: Doctrines of the Companions, may Allah be pleased with them, enjoy great appreciation from jurists. There is no doubt that if the Companions agree on the ruling of the issue, whether their ruling goes with Probability or Wisdom, jurists follow it. But what happens often is that their sayings differ, or the issue is reported from one of them, or a few, without verifying the spread of their saying and what might be an indicator of their consensus on it. Then jurists vary in acting on their sayings running with Probability or Wisdom, especially if these sayings necessitate interpreting the legal text or specifying it. Like the Ijtihad of Umar, may Allah be pleased with him, regarding those whose hearts are to be reconciled (1), where he suspended the ruling on a deduced wisdom, specifying the text to a condition over another. And like his Ijtihad, may Allah be pleased with him, in transferring blood money (Diyyah) from the Aqilah (paternal male relatives) to the people of the Diwan (registry) (2), which is measuring probability against probability with the wisdom of mutual support (Tanasur). And like the Ijtihad of Uthman, may Allah be pleased with him, in inheriting the irrevocably divorced woman in death sickness (3); looking at the Wisdom, which is treating the divorcer in death sickness...",
    "foot_note": "1. I said: \"Narrated from the story of Abidah Al-Salmani by Ibn Abi Shaybah (Al-Musannaf: 6/473) briefly. And Al-Bukhari (Al-Tarikh Al-Awsat: 1/56) briefly, and Yaqub bin Sufyan Al-Fasawi (Al-Ma'rifah wal-Tarikh: 3/293) ... And Al-Bayhaqi (Al-Sunan Al-Kubra: 7/32), and Ibn Asakir (Tarikh Dimashq: 9/195), 'with an authentic chain', as Ibn Hajar said (Al-Isabah fi Tamyiz Al-Sahabah: 1/254)\" See: Saleh, People of Wordings and People of Meanings: A Study in the History of Jurisprudence, 23.\n2. Abd al-Razzaq al-San'ani, Al-Musannaf, 9/159.\n3. Previous reference, 7/26; Authenticated by Al-Albani, Irwa al-Ghalil, 6/159.",
    "book_id": "1106",
    "new_page_number": 34
  },
  {
    "serial_number": "3433365",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 130,
    "volume_number": 1,
    "text": "death with the opposite of his intention, even though this specifies the general texts that decree no inheritance for the irrevocably divorced woman (Mabtuta), and excludes the case of death-sickness from them. Also, as in Umar's (may Allah be pleased with him) and most Companions' establishing the full dowry based on seclusion (Khulwa) rather than consummation (1), and their ruling on the death of a missing person after four years (2), and their setting the punishment for drinking alcohol at eighty lashes (3); because the drinker is in the presumption (Mazanna) of being a slanderer, so he was annexed to him. This is an analogy based on presumptions (Mazann), and this is contrary to how things were during the time of the Prophet (peace be upon him) and the time of Abu Bakr (may Allah be pleased with him) (4). When the Companions differ, it is noticeable that Al-Shafi'i (may Allah have mercy on him) usually follows the schools that do not necessitate specifying or interpreting the texts, even if those holding that view were a minority of Companions who disagreed with the majority, or disagreed with the schools of the Rightly Guided Caliphs. This is unlike the rest of the three Mujtahid Imams: Abu Hanifa, Malik, and Ahmad (may mercy be upon them). Therefore, Al-Shafi'i did not opine for the inheritance of the irrevocably divorced woman in death-sickness (5), nor for ruling the death of a missing person in four years (6), nor for transferring the blood money to the people of the registry (Diwan) (7), nor for eighty lashes for alcohol (8), nor for establishing the full dowry by seclusion (9), and other examples which, if investigated, would be found to be many. Perhaps this was the reason for the misconception of some Shafi'is who said: Al-Shafi'i does not use the sayings of Companions as evidence, even though this contradicts what he explicitly stated regarding his reliance on them (10). Perhaps the correct statement is that he uses the traditions of the Companions and the statements of their majority as evidence, but only if they do not require interpreting the text. The issues mentioned above are cases where the majority of their statements contradict the apparent meaning of the text, so perhaps for this reason he did not adopt them, may Allah have mercy on him. And Allah knows best.\n\nFifth: The extent of obscurity or instability in the Wisdom (Hikmah), which may change with the change of time.\n\nWisdom is the true description intended by the ruling. However, the Lawgiver turns away from linking the ruling to this description if it is hidden or unstable, and instead links it to an apparent, consistent description which is a presumption (Mazanna) for it. This deviation is for three purposes: facilitation, precaution, and ending disputes. We have elaborated on this in a previous research (11).",
    "foot_note": "1. Abd al-Razzaq al-San'ani, Al-Musannaf, 6/338; authenticated by Al-Albani, Irwa' al-Ghalil, 6/356.\n2. Abd al-Razzaq al-San'ani, Al-Musannaf, 7:47; authenticated by Al-Albani, Irwa' al-Ghalil, 6/150.\n3. Muslim, Al-Sahih, 3/1331.\n4. Previous reference.\n5. Al-Shafi'i, Al-Umm, 5/241.\n6. Previous reference, 1/299.\n7. Previous reference, 6/124.\n8. Previous reference, 7/192.\n9. Previous reference, 5/264.\n10. Al-Ala'i, Ijmal al-Isabah fi Aqwal al-Sahabah, 37.\n11. Saleh, \"Reasoning by Presumption not by Wisdom: A Fundamental Study\", Al-Sirat Journal, Vol 21, Issue 38, 59.",
    "book_id": "1106",
    "new_page_number": 35
  },
  {
    "serial_number": "3433366",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 131,
    "volume_number": 1,
    "text": "Wisdoms, regarding their description of being hidden or unstable, have two extremes and a middle ground:\nSome wisdoms are apparent and consistent, upon which most jurists agree to link the ruling in existence and non-existence, such as the wisdom of intoxication in wine, the wisdom of cleaning in cleaning after defecation (Istijmar), the wisdom of cleaning teeth in using the Siwak, and the wisdom of terrorizing the enemy in the command to prepare power and tethered horses, and other wisdoms with which the ruling revolves in existence and non-existence.\nSome wisdoms are extremely hidden or unstable, so jurists agree not to link the ruling to them essentially, but to their presumption (Mazanna), such as the description of consent in contracts, intent in murder necessitating retribution, hardship in the license to break the fast, and deterrence in the obligation of punishments (Hudud).\nSome wisdoms are in the middle, and thus jurists differ between linking the ruling to them directly or to their presumption: such as the wisdom of establishing the full dowry, whether it is by seclusion or intercourse. Because intercourse is inherently not hidden, but is apparent and consistent, and the Lawgiver has suspended many rulings upon it, such as the obligation of Ghusl (ritual bath), the obligation of Hadd punishment, and so on. However, in the subject of establishing the dowry, there was a need for an apparent factor that can be proven when spouses - or their heirs - dispute over it between denial and affirmation. Intercourse is difficult to prove by evidence during a dispute, so seclusion was established in its place according to the majority; because it is easy to prove by evidence in case of denial (1).\nAlso among these is the wisdom of desire - or pleasure - to which the Malikis (2) and Hanbalis (3) linked the ruling of invalidating ablution (Wudu); as its matter often becomes confused for the accountable person. Therefore, the Shafi'is (4) linked the ruling to its presumption, not to it itself, which is touching women who are a presumption of desire, whether desire occurred or not.\nIt is worth noting here that the wisdom might be hidden or unstable at the time of the text, or after it, so the Lawgiver or jurists link the ruling to its presumption. But with the change of time, this wisdom may transform from",
    "foot_note": "1. See: Ibn Rajab, Al-Qawa'id, 3/132; Ibn Qudamah, Al-Mughni, 8/100.\n2. Al-Hattab, Mawahib al-Jalil fi Sharh Mukhtasar Khalil, 1/296.\n3. Al-Bahuti, Kashshaf al-Qina', 1/301.\n4. Al-Shirbini, Mughni al-Muhtaj, 1/145.",
    "book_id": "1106",
    "new_page_number": 36
  },
  {
    "serial_number": "3433367",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 132,
    "volume_number": 1,
    "text": "a description of obscurity to a description of clarity. In that case, the issue requires renewed independent reasoning (Ijtihad); because the ruling was legislated for the wisdom, not for the presumption. It was linked to the presumption at the time of the text or the time of the jurists as an exception for the interest of regulation and facilitation. So if it becomes possible to link it directly to the wisdom in later times because it has become apparent and consistent, then that is more appropriate.\nAl-Amidi (d. 631 AH) said: \"If the wisdom - which is the intent of legislating the ruling - is equal to the description in clarity and consistency, it is more worthy of being the cause\" (1).\nAl-Zanjani (d. 656 AH) said: \"Where we considered the forms of causes rather than their content, that was due to the impossibility of accessing and viewing their content. Otherwise, whenever it is possible to view the content of the cause, it is what is considered, not the form of the cause\" (2).\nAl-Qarafi (d. 684 AH) said: \"The rule is: One does not resort to the presumption except when the description [i.e., the wisdom] is inconsistent always or mostly\" (3).\nIbn Taymiyyah (d. 728 AH) said: \"The presumption is only established in place of the reality if the wisdom is hidden or inconsistent. As for when it is apparent and consistent, then no\" (4).\nAl-Rahuni (d. 773 AH) said: \"If an abstract wisdom exists, and it is apparent and consistent such that it can be considered and known, it is permissible to consider it and link rulings to it according to the correct view; because we know definitively that it is what the Lawgiver intended. The consideration of the presumption was due to the impediment of its obscurity and instability. So if the impediment to considering it is removed, it is definitively permissible to consider it\" (5).\nAl-Wansharisi (d. 914 AH) said: \"The prohibition of reasoning by wisdom is conditional upon obscurity or lack of consistency. As for [when there is] clarity and consistency, then no [prohibition], according to the chosen view\" (6).\nExamples of this include the ruling of some jurists regarding the impermissibility of cutting open the belly of a deceased pregnant woman to extract the fetus, because generally, it dies with her death. So they linked the ruling to the presumption; because ascertaining the reality of its life was not possible in their time. Ishaq ibn Rahwayh (d. 238 AH) said: \"How can that be permissible, when no one is certain that it is a living child?!\" (7). As for today, there is no need to link the ruling to the presumption; rather, it is linked directly to the reality of the wisdom, which is the life of the fetus. So it is said: If it is alive and can be extracted alive, it is permissible to cut her belly to extract it; otherwise, it is not permissible. It is easy for doctors today to determine whether the fetus in her belly is alive or dead before performing the incision using ultrasound devices.",
    "foot_note": "1. Al-Amidi, Al-Ihkam, 3/203.\n2. Al-Zanjani, Takhrij al-Furu' ala al-Usul, 300.\n3. Al-Qarafi, Al-Furuq, 2/170.\n4. Ibn Taymiyyah, Iqtida' al-Sirat al-Mustaqim, 1/348.\n5. Al-Rahuni, Tuhfat al-Mas'ul, 4/28.\n6. Al-Wansharisi, Al-Mi'yar al-Mu'rab, 6/295.\n7. Al-Kawsaj, Masa'il al-Imam Ahmad bin Hanbal wa Ishaq bin Rahwayh, 7/3743.",
    "book_id": "1106",
    "new_page_number": 37
  },
  {
    "serial_number": "3433368",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 133,
    "volume_number": 1,
    "text": "Another example is linking the establishment of lineage to secondary causes other than marriage, such as testimony, acknowledgment, physiognomy (Qiyafah), lots, and similar things, and linking the ruling of denying lineage to Li'an (oath of condemnation). The wisdom of establishing lineage, as indicated by Sharia texts and agreed upon by jurists, is the biological partiality - or partness - between the parent and the child, i.e., this one being from the loins of that one: {And the wives of your sons who are from your [own] loins} [An-Nisa: 23]. However, since it was impossible to ascertain this precisely due to its obscurity, the ruling of lineage was linked to other apparent causes, such as the marital bed (Al-Firash), and causes annexed to it. In these days, it has become possible to ascertain the biological partiality itself between the child and the husband with certainty through DNA testing. Therefore, the Ijtihad-based rulings that jurists resorted to in determining the causes of lineage and its denial should be reconsidered; because they based them on the obscurity of the wisdom in their time, while the wisdom is now apparent. And if the wisdom becomes apparent and consistent, the ruling is linked to it, not to its presumption. We have presented extensive jurisprudential perspectives on this, based on Sharia evidences, fundamental rules, and the methodologies of jurists, in a separate book we dedicated to this purpose, so it may be consulted there (1).\n\nSixth: The extent to which the Presumption leads to the Wisdom, which may change with the change of time.\nPresumption (Mazanna) - as we stated previously - is the locus where the existence of the wisdom is predominant. It was named Mazanna because the ruling is presumed (Yuzann) at it. If this presumption does not lead to realizing the wisdom of the ruling and its objective in all individuals and particulars subsumed under the ruling, or most of them, then it is not a presumption, and it loses the merit for which the Lawgiver linked the ruling to it instead of linking it to the wisdom itself.\nPart of what being a presumption implies is accepting the existence of some particulars that this presumption covers with the ruling, yet the intended objective of the ruling (the wisdom) is not realized in them. This does not annul the presumption being a presumption, nor does it annul that there is another wisdom that justified passing the ruling on these particulars despite the absence of this ruling's wisdom in them. This [other] wisdom is Regulation (Dabt), including what it may encompass of facilitation, precaution, and resolving disputes. Sheikh Abd al-Rahman al-Mu'allimi said: \"The breach of the original wisdom was forgiven ... in some",
    "foot_note": "1. Saleh, Verification of Lineage by DNA Testing and Disclosure of its Incidental Results: New Jurisprudential Perspectives, 143.",
    "book_id": "1106",
    "new_page_number": 38
  },
  {
    "serial_number": "3433369",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 134,
    "volume_number": 1,
    "text": "particulars out of regard for the wisdom of Regulation, which is more important\" (1). Khallaf said: \"The failure of the wisdom in some particulars has no effect, in exchange for the integrity of obligations and the consistency of rulings\" (2).\nFor example: Drinking a small amount of date-wine (Nabidh) does not lead to intoxication, which consists of the absence of reason with the persistence of senses, leading to enmity, hatred, and hindering from remembrance and prayer. Despite this, this small amount is covered by the ruling of prohibition according to the majority of jurists, even with the absence of this wisdom in it. This is due to the presence of another wisdom that succeeded the original wisdom, which is Regulation and Precaution, expressed in this particular as cutting off the substance of corruption. For if this small amount were not prohibited, it would not be possible to prevent the circulation, acquisition, and trading of intoxicants, and individuals would become lenient in drinking them; because drinking a little of it leads, with habituation and familiarity, to drinking a lot. This is in addition to the fact that the amount that does not intoxicate is not consistent; what intoxicates some people does not intoxicate others, and what intoxicates a single person in one state may not intoxicate him in another state. Thus, the wisdom of prohibiting a small amount of date-wine is not the occurrence of intoxication itself and its consequences, as in the prohibition of a large amount, but it is blocking the means to intoxication by way of precaution and regulation.\nSimilarly, linking the ruling of the license to break fast in Ramadan to travel realizes the wisdom mostly, which is repelling the unusual hardship of fasting due to long travel. However, it may still be absent in some long travels for some people. Despite this, the license covers them; because this wisdom (excessive hardship) is inconsistent. People vary in estimating and feeling it, so the ruling was linked to long travel which is a presumption for it, even if it is not actually realized for some people, by way of facilitation, regulation, and removing confusion from the accountable person when complying with the ruling.\nThe conclusion is that the particulars or individuals covered by the presumption, wherein the wisdom of the ruling is not realized when linked to the presumption, are characterized by two traits:\nFirst: They are a minority and an exception relative to the rest of the particulars and individuals covered by the ruling of the presumption.",
    "foot_note": "1. Al-Mu'allimi al-Yamani, Athar al-Sheikh al-Allamah Abd al-Rahman bin Yahya al-Mu'allimi al-Yamani, 2/83.\n2. Khallaf, Ilm Usul al-Fiqh, 66.",
    "book_id": "1106",
    "new_page_number": 39
  },
  {
    "serial_number": "3433370",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 135,
    "volume_number": 1,
    "text": "Second: Even if the wisdom of the ruling itself is not realized in them, another wisdom has succeeded it necessitating their inclusion in this ruling, which is Regulation, and what it involves of facilitation, precaution, and ending disputes.\nWhile accepting the above in general terms, fundamentalists differ regarding some particulars and individuals covered by the presumption but not covered by the wisdom: Are they excluded from the ruling of the presumption and is it lifted from them due to the lack of wisdom or not? These particulars are those where the wisdom of the ruling is absent with certainty, meaning there is no probability of the wisdom occurring in them at all. Their majority is of the view that these particulars definitively lacking the wisdom are excluded from the ruling of the presumption and it is lifted from them. The Hanafis disagreed on this, as the ruling for them revolves with the presumption, even if the wisdom is negated with certainty from the particular individual in dispute.\nAl-Amidi (d. 631 AH) said: \"The intent of legislating rulings is the wisdoms, so legislating rulings with the certainty of the negation of wisdom is not useful, so the Sharia does not bring it, contrary to the companions of Abu Hanifa\" (1).\nFundamentalists illustrate this with the famous issue: The marriage of the Eastern man to the Western woman (i.e., the marriage of someone in the East to someone in the West by proxy without meeting). The majority do not establish the lineage of the child if the Western woman brings one, due to the impossibility of meeting between her and her husband. Thus, the wisdom of biological partiality indicated by the possibility of intercourse between them is definitively negated in this case. As for Abu Hanifa, he links the ruling of lineage to the marriage contract itself, whether the meeting is definitively negated or not.\nSimilar to this issue is also one who marries and divorces in the same gathering in the presence of the judge and witnesses, and likewise one who says to a woman \"If I marry you, you are divorced,\" so she is divorced immediately upon marrying her. The majority do not establish the lineage of her child from this husband due to the certainty that intercourse did not occur between them, whereas Abu Hanifa, may Allah have mercy on him, establishes lineage in these cases if the woman brings the child within the period of pregnancy, considering the existence of the contract (2).",
    "foot_note": "1. Al-Ihkam, 3/273.\n2. Previous reference; Al-Zanjani, Takhrij al-Furu' ala al-Usul, 302; Ibn al-Subki, Al-Ashbah wa al-Naza'ir, 2/176; Al-Zarkashi, Al-Bahr al-Muhit, 4/294; Ibn Amir Hajj, Al-Taqrir wa al-Tahbir, 3/146.",
    "book_id": "1106",
    "new_page_number": 40
  },
  {
    "serial_number": "3433371",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 136,
    "volume_number": 1,
    "text": "Another example is some contracts and pronouncements, such as marriage and divorce. Abu Hanifa, may Allah have mercy on him, validates them if the presumption exists, which is the formula (Sigha), even if the wisdom for which the formula was considered—which is consent—is negated, as in cases of coercion; because he adheres to the presumption, which is present, and does not pay attention to the wisdom even if it is negated definitively. As for the majority, they exclude cases where consent is definitively flawed, so they do not validate these contracts and pronouncements. Ibn al-Humam of the Hanafis said: \"All that is established with coercion are ten dispositions: Marriage, divorce, revocation of divorce (Raj'ah), vows of continence (Ila'), returning (Fay'), dhihar, manumission, pardon from retribution, oath, and vow\" (1).\nAl-Taj al-Subki said: \"The People of Opinion (Ashab al-Ra'y) strove unknowingly and generalized the saying that the forms of legal causes are what is considered in rulings regardless of their meanings, even if they are as clear as the sun. The Imam Al-Muttalibi [Al-Shafi'i], may Allah be pleased with him, restricted that to forms whose meanings are unstable, hidden, or too subtle for understanding, causing more confusion; to prevent disputes; so the gap does not widen by the loss of regulation; carrying the tolerant Hanifiyyah [Islam] in matters of this nature; applying it to meanings; and revealing wisdoms where its face is apparent\" (2).\nIn this regard, it should be noted that the time factor may affect the extent to which the presumption leads to the wisdom in some events. The presumption might be leading to the wisdom mostly in the time of the text if this presumption is textually stated, or in the time of the jurists if it is ijtihad-based, but with the change of time and conditions, its leading to the wisdom decreases or vanishes. Here, it is appropriate to re-evaluate the linking of the ruling to this presumption.\nAn example of this is the command to prepare tethered horses mentioned in the Quran, and what came in the Sunnah regarding the virtue of acquiring horses, raising them, and spending on them (3). The wisdom is that they were a decisive and important means in Jihad and achieving victory: {And prepare against them whatever you are able of power and of steeds of war by which you may terrify the enemy of Allah and your enemy} [Al-Anfal: 60]. As for today, horses are no longer an effective means in war,",
    "foot_note": "1. Fath al-Qadir, 3/489.\n2. Al-Ashbah wa al-Naza'ir, 2/176.\n3. See: Al-A'zami, Al-Jami' al-Kamil fi al-Hadith al-Sahih al-Shamil, 7/282.",
    "book_id": "1106",
    "new_page_number": 41
  },
  {
    "serial_number": "3433372",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 137,
    "volume_number": 1,
    "text": "meaning that the presumption no longer leads to the wisdom for which it was legislated as it was previously. Consequently, the text's ruling—which is the recommendation to acquire them—is lifted from it, and its ruling returns to the origin, which is permissibility.\nAnother example is the ruling of breaking the fast during travel. Travel appeared absolutely in the Holy Quran, with its wisdom textually stated as facilitation (Taysir). The majority of Companions saw—considering the wisdom—to restrict this absolute [term] to long travel. They differed on the limit of 'long' into many opinions, which some counted to be around twenty opinions (1). Many jurists accepted from these opinions the one stating it is a travel distance of four Burud (85 km); because this distance is indeed a presumption for hardship, and anything less is not. This ijtihad from the Companions, may Allah be pleased with them, and those who followed them from the Imam jurists, falls under restricting the absolute text by the wisdom derived from it, which is a common type of ijtihad among Companions and Imam jurists, as we explained in \"The Effect of Rationalizing the Text on its Indication\" (2).\nIf traveling four Burud (85 km) was indeed a presumption for hardship in the time of the Companions and jurists, and after them until close to our era for most people, it is—without doubt—no longer so now; because the mentioned distance is covered in less than an hour by car in these times of ours, whereas in the time of the Companions and jurists it was covered in two or three days and nights. Therefore, the issue needed a re-examination of the criterion of travel permitting the license to break the fast. Because, as we said, if the presumption does not lead to the wisdom mostly, it is incorrect to describe it as its presumption. Consequently, legislating the ruling with it means the loss of its wisdom and objective in the majority of individuals, not just some of them, as was the case in the time of the text and the time of the jurists.\nIt is not said here: Jurists and fundamentalists stated that the ruling in the issue of travel revolves with distance regardless of hardship, so the license is prescribed for one who covers the mentioned distance in a moment, like one who uses Jinn for example, or one who is luxurious in his travel like a carried king.",
    "foot_note": "1. Ibn Hajar, Fath al-Bari, 2/556.\n2. Saleh, Athar Ta'lil al-Nass ala Dalalatihi (The Effect of Rationalizing the Text on its Indication), 81.",
    "book_id": "1106",
    "new_page_number": 42
  },
  {
    "serial_number": "3433373",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 138,
    "volume_number": 1,
    "text": "This is because cases of covering the mentioned distance without hardship were rare in their time, so their rarity did not affect the validity of the presumption to link the ruling to it. The dominant condition of people back then was that they found hardship in covering the mentioned distance, and the failure of the wisdom in some individuals did not harm; the ruling applied to them consistently in line with the presumption whose general ruling is not affected by rare failures. As for today, the mentioned distance is not a presumption for hardship for most people, if not all of them. The Lawgiver, when establishing this license, followed it by saying: {Allah intends for you ease and does not intend for you hardship} [Al-Baqarah: 185]. The meaning of lifting difficulty is observed in the legitimacy of breaking the fast during travel and illness definitively. Based on this, the Companions' and jurists' restriction of the travel permitting the license to 'long travel' was built, even if they differed in estimating that.\nThe difference between our time and the time of the jurists is that the distance they determined was a presumption for hardship in their time, and the absence of hardship upon covering it was rare. As for our time, this distance is no longer a presumption for hardship at all. What was considered rare in their time has now become the norm and the dominant case. Therefore, the issue necessitated a re-examination. It is not appropriate for us to adhere to the rulings of branches (Furu') written by jurists without paying attention to the rules upon which they built the rulings of those branches. The branches are often characterized by changing and fluctuating rulings with the change of times, unlike the rules which are characterized by stability.\nAmong what may be proposed in this specific issue: Either re-estimating the distance permitting the license and increasing it, as it is not Tawqifi (divinely fixed) evidenced by the abundance of differences in the Salaf's opinions in estimating it.\nOr - and perhaps better than the previous - linking the ruling to the duration of travel not its distance. This is the Hanafi method in estimating distance; therefore, the distance necessitating license for them differs in a rugged road from an easy road, and in sea from land. However, the duration they specified to regulate the distance (a three-day journey) is appropriate in its length for their era, not ours; because most travels in our era are",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 43
  },
  {
    "serial_number": "3433374",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 139,
    "volume_number": 1,
    "text": "less than that duration, unlike in ancient times. Adopting this duration to regulate distance now removes the license from most of what is called travel in our time, which we do not think is the Lawgiver's intent.\nOr - and this is what I incline towards - linking breaking the fast during travel to hardship itself, leaving its estimation to the honesty of the accountable person, exactly like illness. So it is said to the accountable person: If fasting is hard for you during travel, then break the fast; otherwise, do not. Just as it is said to him: If fasting is hard for you with illness or you fear harm with it, then break the fast. Travel and illness are two licenses for breaking the fast mentioned in one context, and they are rationalized by one wisdom which is facilitation; so it is more appropriate to equate them in the ruling. And Allah knows best (1).\nThis issue allows for more elaboration than this, but we suffice with this amount because the intent is illustration and sparking jurisprudential thought, nothing more. What we want to reach here is that the change of times may have an effect on the presumption turning away from being a presumption, such that this presumption needs a re-examination and new calibration, so that it remains truly a presumption performing its function of leading to the wisdom mostly.\nThe summary of the statement on this factor is that the extent to which the presumption leads to the wisdom in a given event has a significant impact on the extent of the jurists' commitment to linking the ruling of this event to this presumption, or severing it from it, due to the negation of the wisdom or the improbability of its occurrence. Establishing this statement and clarifying it is the purpose of presenting what we presented. Otherwise, discussing the issue of excluding what does not realize the wisdom from the ruling of the presumption deserves more elaboration and detail than what was said here, and it is worthy of being singled out for research to root it with evidences, regulate it with rules, and explain how to apply it to new developments.\n\nSeventh: The strength of the suitability of the Wisdom to the ruling of the event.\nLifting the ruling from some particulars covered by the text in its generality due to the absence of wisdom from them is not a simple matter, especially if the wisdom is derived (Mustanbatah) and not textual; because it is a form of abandoning the apparent meaning of",
    "foot_note": "1. What we said here is limited to the travel for the license of breaking the fast. As for the travel for the license of shortening prayers (Qasr), this does not apply to it, and Allah knows best; because the wisdom of legislating Qasr is originally fear, not hardship, and because it does not transform into a substitute unlike fasting which is made up later, and because Qasr is an Azimah (strict obligation) or recommended by consensus unlike breaking fast in travel. Therefore, it was more appropriate not to equate the travel of Qasr with the travel of breaking fast. Rather, if the ruling applied to it with the absolute wording, as Ibn Hazm and others said, it would not be far-fetched, and there are several evidences pointing to that.",
    "book_id": "1106",
    "new_page_number": 44
  },
  {
    "serial_number": "3433375",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 140,
    "volume_number": 1,
    "text": "the text based on opinion. For this reason, scholars differ and hesitate on issues of this category: between those proceeding with the presumption indicated by the apparent text, and others proceeding with what the negation of wisdom requires. Despite this, what the eye of the inductor does not miss regarding the branches that jurists exclude from the general ruling of the textual presumption, out of regard for the negation of wisdom, is that the text's indication of this wisdom is extremely clear. It almost rivals the text's apparent meaning in strength, visibility, and precedence to the listener's understanding. Such as the wisdom of mental confusion in the prohibition of a judge judging while angry, the wisdom of doubt regarding hand impurity in the command to wash hands before putting them in a vessel, the wisdom of preventing what affects Khushu' (humility/focus) in the command to prioritize dinner over Isha prayer, the wisdom of the child being part of the parent in establishing his lineage from him, the wisdom of desire in the command of ablution from touching women, the wisdom of harm in the prohibition of approaching the mosque when eating garlic and onions, the wisdom of distraction from striving for prayer in the prohibition of selling at the time of the call for Friday prayer, the wisdom of cleaning in the command of Istijmar, the wisdom of harm in the prohibition of a Muslim selling over his brother's sale and proposing over his proposal, and similar issues.\nHowever, if the derived wisdom is not strongly apparent, jurists do not apply it to specify the text in the same way as the previous wisdoms. Instead, they weigh it against the text's inclusion of the individual intended to be excluded due to the absence of this wisdom. Perhaps the coverage of the apparent text outweighs it, or perhaps lifting the text's ruling from it due to the absence of wisdom is weightier and more appropriate. There is no disciplined rule determined in this matter; rather, each issue returns to a specific ijtihad taste, as we mentioned when discussing the third factor.\nAn example that can be given in this context is what many jurists went to regarding restricting the prohibited monopoly (Ihtikar) to staple foods and in times of high prices. This is based on the view that the intent of the prohibition is harming the general public, and this is only realized in what they need. Thus, the monopoly of luxury goods, as well as necessary goods when they are abundant, falls outside the prohibition; so it is permissible to hoard them and wait for their price to rise.\nAl-Nawawi (d. 676 AH) said: \"Scholars said: The wisdom in prohibiting monopoly is repelling harm from",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 45
  },
  {
    "serial_number": "3433376",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 141,
    "volume_number": 1,
    "text": "the general public... As for what was mentioned in the book about Sa'id ibn al-Musayyib and Ma'mar, the narrator of the hadith, that they used to hoard, Ibn Abd al-Barr and others said: They used to hoard oil, and they interpreted the hadith as hoarding staple food when there is a need for it and high prices. Al-Shafi'i, Abu Hanifa, and others interpreted it likewise, and it is the correct view\" (1).\nAl-San'ani (d. 1182 AH) said: \"The apparent meaning of Muslim's hadith is the prohibition of hoarding food and other things... Abu Yusuf went to its generality, saying: Whatever harms people to withhold is monopoly, even if it is gold or clothes. It was said: There is no monopoly except in human food and animal food, which is the view of the Hadawiyyah and Shafi'is. It is not hidden that the hadiths reported in prohibiting monopoly came absolutely... This implies that the absolute [text] is acted upon in prohibiting monopoly absolutely, and it is not restricted to the two foods... It is as if the majority restricted it to the two foods considering the wisdom suitable for prohibition, which is repelling harm from the general public, and mostly repelling harm from the public occurs regarding the two foods, so they restricted the absolute by the suitable wisdom\" (2).\nI say: The validity of Abu Yusuf's view (may Allah have mercy on him) to proceed with the presumption in its absolute form in the text without restricting it to staples is not hidden. For the wisdom relied upon by the majority, although its occurrence in staples is clear due to the general public's need for them, can also be realized in other goods that some people might need, not most or all of them. Harm befalls these people from the monopoly of what is not a staple. Even the one not needing the commodity, for whom it is a luxury, suffers harm from its monopoly due to the price increase resulting from the monopoly inevitably.\nRestricting the wisdom to the harm of the general public and excluding the harm occurring to some of them is arbitrary. Because harm in Sharia is removed entirely; there is no difference in it between general harm and specific harm except when balancing between them if a conflict occurs. But where it is possible to repel both harms, it is more appropriate. So how about if this 'more appropriate' option in opinion is consistent with the apparent text? It is added strength upon strength. If the apparent text bears a correct suitable meaning, it is far-fetched to drop it for another suitable meaning based on pure opinion. The conclusion is that reasoning monopoly by harming the general public is weak, and it is more appropriate to rationalize it by harm absolutely, even if to a group of people. And Allah knows best.",
    "foot_note": "1. Sharh Sahih Muslim, 11/43.\n2. Subul al-Salam, 2/33.",
    "book_id": "1106",
    "new_page_number": 46
  },
  {
    "serial_number": "3433377",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 142,
    "volume_number": 1,
    "text": "Eighth: The extent of the Wisdom's singularity regarding the ruling of the event:\nThe wisdom by which the ruling was rationalized might be correct and strong in itself, not weak, but it is not unique to the ruling. Rather, the ruling has other wisdoms and objectives besides it. This invalidates the converse (aks) of this wisdom, meaning that the ruling is not negated by its negation because it is established by the other wisdom or wisdoms.\nBased on this, Al-Amidi's example of the marriage of a menopausal woman - whose marriage does not usually lead to procreation and reproduction - his using her as an example of a ruling whose objective is rarely achieved (1); is not a valid example for the permissibility of legislating a ruling in a locus where the occurrence of its objective and wisdom is improbable. This is from two aspects:\nFirst: The menopausal woman is a partial exceptional case of the general ruling, which is the legitimacy of marriage. Thus, one cannot conclude from it that the ruling - absolutely like this - is legislated even with the frequent negation of its wisdom. Rather, the extent of the inference is to say: The ruling may be legislated with the negation of realizing its objective in some partial forms. This is what we explained previously, that generalizing the ruling according to presumptions is not undermined by rare failures.\nThe second aspect - which is our purpose in mentioning it - is that marriage was not legislated for the purpose of procreation alone. Rather, it has many wisdoms, such as physical, psychological, and emotional dwelling (Sakan), intimacy, obtaining maintenance, service or cooperation in carrying out tasks reasonably, and so on. So the negation of the wisdom of procreation does not mean the negation of others, and thus the ruling remains legislated with the other wisdoms. Yes, the example is intended to clarify the idea not to prove it, but Al-Amidi did not provide evidence that the ruling is legislated with the negation of its wisdom mostly with anything other than what he mentioned of this example. It is as if he inferred existence from occurrence. So his example was worthy of criticism so that determinations would be available to find another example better than it, if found.\nAn example that may illustrate the extent of the impact of the wisdom's singularity regarding the ruling of the event on the trends of ijtihad therein is the issue of mandating the waiting period (Iddah) on a woman, even if we verified the emptiness of her womb. Some have proposed excepting cases where the emptiness of the womb can be verified with certainty (2), as in the woman whose",
    "foot_note": "1. Al-Ihkam, 3/272.\n2. Munjiya al-Swayhi, \"Is the Iddah in Islam Imprisonment for Women\", Elaph, 19/11/2008, http://elaph.com/Web/ElaphWriter/2008/11/383948.htm, Date of access: 1/8/2018.",
    "book_id": "1106",
    "new_page_number": 47
  },
  {
    "serial_number": "3433378",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 143,
    "volume_number": 1,
    "text": "uterus has been removed. Others added those whose lack of pregnancy can be verified by blood tests, although this is presumed, not certain, as there are types of Cryptic Pregnancy which blood tests do not reveal, and with which a woman's menstruation does not stop until late periods (1). In both cases, this proposal in its absolute form is unacceptable; because the Iddah was not legislated only to verify the emptiness of the womb. If it were so, it would have been limited to one menstruation, as in the exoneration of female slaves (Istibra'), and would not have been determined by three menstrual cycles (Quru'), or by several months, as in the Iddah of death, and the Iddah of those who have despaired of menstruation. This indicates that the duration is intended. This is clear in the revocable divorcee, as well as the irrevocably divorced by annulment, because the long period gives room for retraction and reconciliation. As for the irrevocably divorced due to the exhaustion of the number of divorces, with the certainty of the impossibility of her pregnancy - such as one whose uterus has been removed - it is not hidden that there is a general custom that disapproves of a woman marrying another immediately after her divorce, and brings gossip to her. This might be intended by mandating the waiting period on the likes of her. Nevertheless, the opinion of not mandating the waiting period on such a woman (i.e., divorced three times and her uterus removed) is open to ijtihad, and Allah knows best.\nThe conclusion is that if the wisdoms are multiple for a single ruling, it is not lifted by the lifting of some of them; rather, all of them must be lifted. This is an important factor in jurists' determination of linking the ruling to a specific wisdom in individual events.\n\nNinth: The fact that the rationalized event is in a field where worship (Ta'abbud) abounds, or in a field where rationalization (Ta'lil) abounds:\nAmong the factors affecting the rotation of the ruling with its presumption or its wisdom is the field of the ruling: is it in acts of worship (Ibadat) or in other matters? One does not dare to rationalize acts of worship with wisdoms and link them to them as one dares to rationalize what was reported in habits and transactions. In acts of worship, the ruling might not be linked to the wisdom even with a text stating it. In habits and transactions, jurists link the ruling to the wisdom, even if it has weak suitability sometimes. This is because scholars estimate in devotional rulings meanings, wisdoms, and hidden secrets that the Sharia did not inform us about, unlike habits and transactions which mostly target immediate interests and noble character. Therefore, Al-Shatibi established his famous rule: \"The principle in acts of worship regarding",
    "foot_note": "1. \"What Is a Cryptic Pregnancy? Symptoms, Length, and More\", Healthline, 26/2/2019, https://www.healthline.com/health/pregnancy/cryptic-pregnancy, Date of access: 20/8/2021.",
    "book_id": "1106",
    "new_page_number": 48
  },
  {
    "serial_number": "3433379",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 144,
    "volume_number": 1,
    "text": "the accountable person is devotion (Ta'abbud) without paying attention to meanings, and the principle of habits is paying attention to meanings\" (1). However, this rule is not consistent in application among jurists. We have found Abu Hanifa, may Allah have mercy on him, proceeding in rationalizing acts of worship with wisdoms and interest-based meanings that affect their presumptions by expanding and restricting, contradicting the approach of the other three Imams. Examples of this include his saying: Permissibility of paying values in Zakat considering the wisdom of fulfilling needs (2), permissibility of removing impurity with other than water considering the wisdom of cleaning (3), not stipulating intention in ablution nor continuity nor order, because the intent of ablution by text is cleaning: {Allah only intends to purify you}, and the mentioned pillars are neither textual nor influential in achieving the wisdom or its negation; since the wisdom is achieved with or without them (4), permitting saying what indicates magnification in place of Takbir al-Ihram like 'Allah A'zam' (Allah is Greatest) and 'Allah Ajall' (Allah is Most Majestic) and similar phrases (5), and bolder than all of this is his permission - in the apparent narration - to recite the Quran by meaning and in other than Arabic in prayer even for one capable of reading it in Arabic, because he brought the meaning, which is the intent in his opinion (6).\nDespite the validity of Abu Hanifa's school, may Allah have mercy on him, in some of what he said in these issues and their likes, that does not cancel Al-Shatibi's rule from our point of view nor invalidate it for him. We cannot say that Abu Hanifa does not rely on it absolutely. It suffices us to say that he is bolder than the rest of the Imams in rationalizing devotional rulings for the purpose of expanding them and using analogy upon them.\nThe conclusion is that the field of the ruling has an undeniable effect on rationalizing it by wisdom or presumption.",
    "foot_note": "1. Al-Muwafaqat, 2/513.\n2. Al-Sarkhasi, Al-Mabsut, 2/156.\n3. Previous reference, 1/66.\n4. Previous reference, 1/56.\n5. Previous reference, 1/36.\n6. Previous reference, 1/37.",
    "book_id": "1106",
    "new_page_number": 49
  },
  {
    "serial_number": "3433380",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 145,
    "volume_number": 1,
    "text": "Conclusion\nImportant Results:\n1. Although the general rule among jurists is linking the ruling to its presumption not its wisdom, the ruling for them often hesitates between being linked to the presumption or the wisdom.\n2. There are four forms of jurists' handling of the ruling when it hesitates between being rationalized by the presumption or the wisdom, which are:\nFirst: Severing it from the textual presumption, and making it revolve with the wisdom in existence and non-existence.\nSecond: The opposite of the first, which is: making the ruling revolve with the textual presumption, and severing it from the wisdom completely.\nThird: Keeping the ruling revolving with the textual presumption not with the wisdom, but stipulating an additional condition in the presumption out of regard for the wisdom.\nFourth: The opposite of the previous: Making the ruling revolve with the wisdom not with the textual presumption, but stipulating an additional condition with the realization of wisdom out of regard for the textual presumption.\n3. The jurist's inclination to establish the ruling according to what the presumption requires (reasoning by presumption), or what the wisdom requires (reasoning by wisdom), is influenced by multiple factors. By our induction, they are the following nine factors:\n(a) Whether the Presumption or Wisdom is textual or ijtihad-based.\n(b) The existence of an explicit text canceling reasoning by Presumption or Wisdom in the specific event.\n(c) The extent to which reasoning by Presumption, or by Wisdom, needs interpreting the apparent text or specifying it.\n(d) The schools of the Companions in the event under consideration, and whether they proceeded with the Presumption or with the Wisdom.\n(e) The extent of Obscurity or Instability in the Wisdom, which may change with the change of time.\n(f) The extent to which the Presumption leads to the Wisdom, which may change with the change of time.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 50
  },
  {
    "serial_number": "3433381",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 146,
    "volume_number": 1,
    "text": "(g) The strength of the suitability of the Wisdom to the ruling of the event.\n(h) The extent of the Wisdom's singularity regarding the ruling of the event.\n(i) The fact that the rationalized event is in a field where worship abounds, or in a field where rationalization abounds.\nAnd our last prayer is that praise be to Allah, Lord of the Worlds.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 51
  },
  {
    "serial_number": "3433382",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 149,
    "volume_number": 1,
    "text": "List of Sources and References\nIbn al-Subki, Taj al-Din Abd al-Wahhab bin Taqi al-Din. Al-Ashbah wa al-Naza'ir. 1st ed. Beirut: Dar al-Kutub al-Ilmiyyah, 1991/1411.\nIbn al-Mundhir, Muhammad bin Ibrahim. Al-Ishraf 'ala Madhahib al-Ulama. Edited by Saghir al-Ansari. 1st ed. Ras al-Khaimah: Maktabat Makkah al-Thaqafiyyah, 2004/1425.\nIbn al-Humam, Kamal al-Din Muhammad bin Abd al-Wahid al-Siwasi. Fath al-Qadir. Beirut: Dar al-Fikr, n.d.\nIbn Amir Hajj, Shams al-Din Muhammad bin Muhammad bin Muhammad. Al-Taqrir wa al-Tahbir. 2nd ed. Beirut: Dar al-Kutub al-Ilmiyyah, 1983/1403.\nIbn Taymiyyah, Taqi al-Din Ahmad bin Abd al-Halim bin Abd al-Salam. Iqtida' al-Sirat al-Mustaqim li Mukhalafat Ashab al-Jahim. Edited by Nasir al-Aql. 7th ed. Beirut: Dar Alam al-Kutub, 1999/1419.\n-. Al-Sarim al-Maslul 'ala Shatim al-Rasul. Edited by Muhammad Muhyi al-Din Abd al-Hamid. Saudi Arabia: Saudi National Guard, n.d.\nIbn Hajar, Ahmad bin Ali al-Asqalani. Fath al-Bari Sharh Sahih al-Bukhari. Edited by Muhammad Fuad Abd al-Baqi. Beirut: Dar al-Ma'rifah, 1959/1379.\nIbn Daqiq al-Eid, Taqi al-Din Abu al-Fath Muhammad bin Ali bin Wahb bin Muti' al-Qushayri. Ihkam al-Ahkam Sharh Umdat al-Ahkam, n.d.\nIbn Rajab, Zain al-Din Abd al-Rahman bin Ahmad. Taqrir al-Qawa'id wa Tahrir al-Fawa'id [Known as \"Qawa'id Ibn Rajab\"]. Edited by Mashhur Al Salman. 1st ed. Saudi Arabia: Dar Ibn Affan, 1999/1419.\nIbn Abidin, Muhammad Amin bin Umar bin Abd al-Aziz. Hashiyat Ibn Abidin (Radd al-Muhtar 'ala al-Durr al-Mukhtar). 2nd ed. Beirut: Dar al-Fikr, 1992/1412.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 52
  },
  {
    "serial_number": "3433383",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 150,
    "volume_number": 1,
    "text": "Ibn Qudamah, Muwaffaq al-Din Abdullah bin Ahmad bin Muhammad. Al-Mughni. Edited by Abdullah al-Turki and Abd al-Fattah al-Hilu. 3rd ed. Saudi Arabia: Dar Alam al-Kutub, 1968/1388.\n- Al-Mughni. Cairo: Maktabat al-Qahirah, 1968/1388.\nIbn Hubayra, Yahya bin Hubayra bin Muhammad. Ikhtilaf al-A'immah al-Ulama. Edited by Al-Sayyid Yusuf Ahmad. 1st ed. Beirut: Dar al-Kutub al-Ilmiyyah, 2002/1423.\nAbu al-Hussein al-Basri, Muhammad bin Ali al-Tayyib. Al-Mu'tamad fi Usul al-Fiqh. Edited by Khalil Muhyi al-Din al-Mays. 1st ed. Beirut: Dar al-Kutub al-Ilmiyyah, 1982/1403.\nAbu Dawood, Sulaiman bin al-Ash'ath. Sunan Abi Dawood. Edited by Shu'ayb al-Arna'ut. 1st ed. Beirut: Mu'assasat al-Risalah, 2009/1430.\nAbu Ubaid, Al-Qasim bin Salam. Al-Amwal. Edited by Khalil Harras. Beirut: Dar al-Fikr, n.d.\nAbu Mu'nis, Ra'id. Manhaj al-Ta'lil bi al-Hikmah wa Atharuhu fi al-Tashri' al-Islami: Dirasah Usuliyyah Tahliliyyah. 1st ed. Virginia - USA: International Institute of Islamic Thought, 2007/1427.\nAhmad, Ibn Hanbal. Musnad al-Imam Ahmad bin Hanbal. Edited by Shu'ayb al-Arna'ut. 1st ed. Beirut: Mu'assasat al-Risalah, 2001/1421.\nAl-Amidi, Sayf al-Din Ali bin Abi Ali al-Amidi. Al-Ihkam fi Usul al-Ahkam. Edited by Abd al-Razzaq Afifi. Beirut: Al-Maktab al-Islami, n.d.\nAl-A'zami, Muhammad Abdullah. Al-Jami' al-Kamil fi al-Hadith al-Sahih al-Shamil al-Murattab 'ala Abwab al-Fiqh. 1st ed. Riyadh: Darussalam, 2016/1437.\nAl-Albani, Muhammad Nasir al-Din. Irwa' al-Ghalil fi Takhrij Ahadith Manar al-Sabil. 2nd ed. Beirut: Al-Maktab al-Islami, 1985/1405.\nAl-Bukhari, Muhammad bin Isma'il. Sahih al-Bukhari. Edited by Muhammad Zuhair al-Nasir. 1st ed. Beirut: Dar Tawq al-Najat, 2001/1422.\nAl-Bakri al-Dimyati, Uthman bin Muhammad. I'anat al-Talibin 'ala Hall Alfaz Fath al-Mu'in. 1st ed. Cairo: Dar al-Fikr, 1997/1418.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 53
  },
  {
    "serial_number": "3433384",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 151,
    "volume_number": 1,
    "text": "Al-Bahuti, Mansur bin Yunus bin Salah al-Din. Daqa'iq Uli al-Nuha li Sharh al-Muntaha. 1st ed. Beirut: Alam al-Kutub, 1993/1414.\n- Kashshaf al-Qina' 'an Matn al-Iqna'. 1st ed. Saudi Arabia: Ministry of Justice, 2008/1429.\nAl-Jubouri, Hussein Khalaf. \"Al-Ta'lil bi al-Hikmah 'inda al-Usuliyyin\". Journal of the College of Arts - Baghdad University, Issue 15 (1972/1391): 183 - 193.\nAl-Hattab, Muhammad bin Muhammad bin Abd al-Rahman. Mawahib al-Jalil fi Sharh Mukhtasar Khalil. 3rd ed. Beirut: Dar al-Fikr, 1992/1412.\nAl-Hakami, Ali bin Abbas bin Uthman. \"Haqiqat al-Khilaf fi al-Ta'lil bi al-Hikmah\". Umm Al-Qura University Journal, Issue 9 (1994/1414): 11 - 85.\nAl-Dabbusi, Abdullah bin Umar bin Isa. Taqwim al-Adillah fi Usul al-Fiqh. Edited by Khalil Muhyi al-Din al-Mays. 1st ed. Beirut: Dar al-Kutub al-Ilmiyyah, 2001/1421.\nAl-Rabi'ah, Abd al-Aziz. \"Al-Qiyas fi al-Asbab\". Adwa' al-Shari'ah, Issue 12 (1981/1401): 67 - 95.\nAl-Rahuni, Abu Zakariya Yahya bin Musa. Tuhfat al-Mas'ul fi Sharh Mukhtasar Muntaha al-Sul. Edited by Al-Hadi Shabili and Yusuf al-Qayyim. 1st ed. Dubai: Dar al-Buhuth, 2002/1422.\nAl-Zarkashi, Badr al-Din Muhammad bin Abdullah bin Bahadur. Al-Bahr al-Muhit. 1st ed. Egypt: Dar al-Kutubi, 1994/1414.\nAl-Zanjani, Mahmoud bin Ahmad. Takhrij al-Furu' 'ala al-Usul. Edited by Muhammad Adib al-Salih. 2nd ed, 1978/1398.\nAl-Zayla'i, Uthman bin Ali. Tabyin al-Haqa'iq Sharh Kanz al-Daqa'iq. 1st ed. Cairo: Al-Matba'ah al-Kubra al-Amiriyyah, 1895/1313.\nAl-Subki, Abu al-Hasan Taqi al-Din Ali bin Abd al-Kafi. Ibraz al-Hukm min Hadith Rufi'a al-Qalam. Edited by Muhammad Khalifa Kilani. 1st ed. Beirut: Dar al-Basha'ir al-Islamiyyah, 1992/1412.\nAl-Sarkhasi, Muhammad bin Ahmad bin Abi Sahl. Usul al-Sarkhasi. Beirut: Dar al-Ma'rifah, n.d.\n- Al-Mabsut. Beirut: Dar al-Ma'rifah, 1993/1414.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 54
  },
  {
    "serial_number": "3433385",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 152,
    "volume_number": 1,
    "text": "Al-Swayhi, Munjiya. \"Hal al-Iddah fi al-Islam Habs lil-Mar'ah\". Elaph, 19/11/2008.\nAl-Shatibi, Ibrahim bin Musa. Al-Muwafaqat. Edited by Mashhur Al Salman. 1st ed. Saudi Arabia: Dar Ibn Affan, 1997/1417.\nAl-Shafi'i, Muhammad bin Idris. Al-Umm. Beirut: Dar al-Ma'rifah, 1990/1410.\nAl-Shirbini, Shams al-Din Muhammad bin Ahmad al-Khatib. Mughni al-Muhtaj. 1st ed. Beirut: Dar al-Kutub al-Ilmiyyah, 1994/1415.\nAl-San'ani, Muhammad bin Isma'il bin Salah. Subul al-Salam. Cairo: Dar al-Hadith, n.d.\nAl-Tabari, Abu Ja'far Muhammad bin Jarir. Jami' al-Bayan fi Ta'wil al-Quran. Edited by Mahmoud Shakir. Makkah: Dar al-Tarbiyah wa al-Turath, n.d.\nAl-Tahawi, Ahmad bin Muhammad. Mukhtasar Ikhtilaf al-Ulama. 2nd ed. Beirut: Dar al-Basha'ir al-Islamiyyah, 1995/1416.\nAl-Tufi, Sulaiman bin Abd al-Qawi. Sharh Mukhtasar al-Rawdah. Edited by Abdullah al-Turki. 1st ed. Beirut: Mu'assasat al-Risalah, 1987/1407.\nAl-Ala'i, Salah al-Din Abu Sa'id Khalil bin Kaykildi. Ijmal al-Isabah fi Aqwal al-Sahabah. Edited by Muhammad al-Ashqar. Kuwait: Jam'iyyat Ihya' al-Turath al-Islami, 1987/1407.\nAl-Ghazali, Muhammad bin Muhammad. Al-Mustasfa. 1st ed. Beirut: Dar al-Kutub al-Ilmiyyah, 1993/1413.\n- Shifa' al-Ghalil. Edited by Hamad al-Kubaisi. 1st ed. Baghdad: Matba'at al-Irshad, 1971/1390.\nAl-Qarafi, Shihab al-Din Ahmad bin Idris. Al-Furuq. Beirut: Alam al-Kutub, n.d.\nAl-Karkhi, Abu al-Hasan Ubaidullah bin al-Hussein. \"Ta'sis al-Nazar\". In Risalah fi al-Usul, edited by Mustafa al-Qabbani. Beirut: Dar Ibn Zaidun, n.d.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 55
  },
  {
    "serial_number": "3433386",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 153,
    "volume_number": 1,
    "text": "Al-Kawsaj, Ishaq bin Mansur. Masa'il al-Imam Ahmad bin Hanbal wa Ishaq bin Rahwayh. 1st ed. Madinah: Islamic University, 2004/1425.\nAl-Mu'allimi al-Yamani, Abd al-Rahman bin Yahya. Athar al-Sheikh al-Allamah Abd al-Rahman bin Yahya al-Mu'allimi al-Yamani. Edited by Ali bin Muhammad al-Imran. 1st ed. Makkah: Alam al-Fawa'id, 2013/1434.\nKuwaiti Fiqh Encyclopedia. Kuwait: Dhat al-Salasil, n.d.\nAl-Namla, Abd al-Karim. Al-Muhadhdhab fi Ilm Usul al-Fiqh al-Muqaran. 1st ed. Riyadh: Maktabat al-Rushd, 1999/1420.\nAl-Nawawi, Muhyi al-Din Yahya bin Sharaf. Al-Minhaj Sharh Sahih Muslim. 2nd ed. Beirut: Dar Ihya' al-Turath al-Arabi, 1972/1392.\nAl-Wansharisi, Ahmad bin Yahya. Al-Mi'yar al-Mu'rab. Morocco: Ministry of Awqaf, 1981/1401.\nImam, Salah Ahmad Abd al-Rahim. \"Bahth fi al-Ta'lil bi al-Hikmah\". Journal of the Faculty of Sharia and Law in Assiut, Issue 18 (2006/1426): 457 - 693.\nKhallaf, Abd al-Wahhab. Ilm Usul al-Fiqh. Egypt: Maktabat al-Da'wah, n.d.\nSa'id, Al-Hussein Ait. \"Al-Tajdid fi al-Ta'lil al-Fiqhi\". In Al-Ijtihad al-Fiqhi. Rabat: Mohammed V University, 1996/1416.\nShalabi, Muhammad Mustafa. Ta'lil al-Ahkam. 2nd ed. Beirut: Dar al-Nahda al-Arabiyyah, 1981/1401.\nSaleh, Ayman. Athar Ta'lil al-Nass 'ala Dalalatihi. 1st ed. Amman: Dar al-Ma'ali, 1999.\n- Al-Tahaqquq min al-Nasab bi Fahs al-Basmah al-Wirathiyyah. 1st ed. Qatar: Qatar University Press, 2020/1441.\n- \"Al-Ta'lil bi al-Mazanna la bi al-Hikmah\". Al-Sirat Journal 21, Issue 38 (2018): 48 - 77.\n- \"Al-Illah wa al-Hikmah wa al-Ta'lil bi al-Hikmah\". Journal of Emir Abdelkader University, Issue 2 (31/12/2017): 65 - 114.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 56
  },
  {
    "serial_number": "3433387",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Factors Affecting the Association of Rulings with Presumption (Mazanna) or Wisdom (Hikmah) - A Fundamental Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 154,
    "volume_number": 1,
    "text": "- Ahl al-Alfaz wa Ahl al-Ma'ani: Dirasah fi Tarikh al-Fiqh. 1st ed. Germany: Al-Noor Publishing, 2016.\nAbd al-Razzaq al-San'ani. Al-Musannaf. 2nd ed. Cairo: Dar al-Ta'sil, 2013/1437.\nAuda, Jasser. Al-Ijtihad al-Maqasidi. 1st ed. Beirut: Arab Network for Research and Publishing, 2013.\n- Fiqh al-Maqasid. 1st ed. Virginia - USA: International Institute of Islamic Thought, 2006/1427.\nMuslim, Muslim bin al-Hajjaj. Sahih Muslim. Edited by Muhammad Fuad Abd al-Baqi. Beirut: Dar Ihya' al-Turath al-Arabi, n.d.\nNimr, Iyad. \"Athar al-Ikhtilaf fi Inatat al-Hukm bi Illatihi aw Hikmatihi\". Jordanian Journal in Islamic Studies 12, Issue 1 (2016/1437): 191 - 212.\n\"What Is a Cryptic Pregnancy? Symptoms, Length, and More\". Healthline, 26/2/2019.",
    "foot_note": "None",
    "book_id": "1106",
    "new_page_number": 57
  }
]