[
  {
    "text": "Al-Shawkani's Stance in his Tafsir regarding Munasabat (Correlations)\nAuthor: أحمد بن محمد الشرقاوى سالم\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat (Correlations)",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "new_page_number": 1
  },
  {
    "text": "sn: 1414\nbook_title: موقف الشوكاني في تفسيره من المناسبات (بحث محكم بكلية أصول الدين جامعة الأزهر ١٤٢٥ هـ)\nbook_link: https://shamela.ws/book/943\nbook_id: 943\nauthor_name: أحمد بن محمد الشرقاوى سالم\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/29\nauthor_ID: 29\neditor: Null\npublisher: Null\nedition: Null\npages: 91\nvolumes: Null\npagination: [الكتاب مرقم آليا]\ncategory: علوم القرآن وأصول التفسير\ncategory_id: 4",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat (Correlations)",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "new_page_number": 2
  },
  {
    "serial_number": "1135299",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat (Correlations)",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Quranic Sciences and Principles of Tafsir\nBook: Al-Shawkani's Stance in his Tafsir regarding Munasabat (A peer-reviewed research at the Faculty of Usul al-Din, Al-Azhar University, 1425 AH)\nAuthor: Ahmad bin Muhammad Al-Sharqawi Salem",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 3
  },
  {
    "serial_number": "1135300",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Dedication from the author to the library of the Tafsir and Quranic Studies Network www.tafsir.net\n\n**Introduction**\n\nIn the name of Allah, the Most Gracious, the Most Merciful.\n\nPraise be to Allah, Lord of the Worlds. We praise Him, seek His help, seek His guidance, turn to Him in repentance, and ask His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whomever Allah guides is the guided one, and whomever He leaves astray, you will not find for him a protecting guide. We send prayers and peace upon the Beloved Chosen One and the Selected Messenger, the Master of Creation and the Beloved of the Truth, Muhammad bin Abdullah, the trustworthy Arab Prophet, may my Lord's prayers and peace be upon him, his family, his companions, and those who follow his path until the Day of Judgment.\n\nNow then:\n\nThe Holy Quran is the eternal miracle with which Allah Almighty supported His Messenger, peace be upon him. It is the general address directed to all minds and understandings, the protection and cure for all ailments and diseases, and the purification and innocence from the darkness of doubt and illusions. The Almighty distinguished it by revealing it piecemeal according to events and the gradual legislation of rulings, and He, the Mighty and Majestic, collected it in a collection of utmost precision and regularity, until its arrangement became one of its sciences which ancient and modern exegetes cared for with great attention. Through it, we stand upon one of the aspects of the inimitability of the Quran, in addition to understanding meanings, knowing purposes, preferring between opinions, and removing ambiguity. From this standpoint, ancient and modern exegetes cared for it, with varying degrees of interest and depth in this subject. However, Imam Al-Shawkani had another stance, as he called for turning away from it and claimed that there is no benefit in it, and criticized those interested in it. He mentioned that in the introduction to his Tafsir, but he did not remain firm on his stance, as he mentioned some aspects of correlations (Munasabat) between verses in the folds of his Tafsir. In this research, we present his words, then respond to them with general responses, followed by detailed responses to the most important issues he raised in the course of his talk about Munasabat. And Allah is the Grantor of success and the Guide to the straight path.\n\nAhmad bin Muhammad Al-Sharqawi\nAl-Qassim - Unaizah\n11 Shawwal 1423 AH\nAssociate Professor at Al-Azhar University and the College of Education for Girls in Unaizah\nSharkawe2000@yahoo.com",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 4
  },
  {
    "serial_number": "1135301",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "**Preface**\n\n**First: With the Tafsir and the Mufassir (Exegete)**\n\nOne of the masterpieces of Tafsir books and its comprehensive foundations is the Tafsir of Imam Al-Shawkani named \"Fath al-Qadir al-Jami' bayna Fannay al-Riwayah wa al-Dirayah min 'Ilm al-Tafsir\" (The Opening of the All-Powerful, Combining the Two Arts of Narration and Knowledge from the Science of Exegesis). This Tafsir is considered a basic reference in its field; this is because it included Tafsir by narration (Riwayah), which relies on the four sources of traditional Tafsir:\n1. Interpretation of the Quran by the Quran.\n2. Interpretation of the Quran by the Sunnah.\n3. Interpretation of the Quran by the sayings of the Companions.\n4. Interpretation of the Quran by the sayings of the Successors (Tabi'in).\n\nThis Tafsir also included Tafsir by opinion (Ra'y), which is the interpretation of the Holy Quran through Ijtihad (independent reasoning) after the exegete's knowledge of the Arabic language, standing upon the causes of revelation, and knowledge of the abrogating and abrogated, the general and specific, and other Quranic sciences, alongside his reference to traditional Tafsir which is considered the primary reference for the exegete.\n\nImam Al-Shawkani needs no introduction: He is a prominent figure in jurisprudence and a leader of da'wah and reform in his era, and an encyclopedic writer. His lineage goes back to the village of Shawkan, one of the villages of Sana'a. He was born in the year 1173 AH and grew up in the city of Sana'a, memorizing the Quran in its Great Mosque. He grew up in a house of knowledge and virtue, for his father Ali bin Muhammad bin Ali Al-Shawkani held the position of judge of Sana'a. He drank from his knowledge and benefited from his library teeming with mother books in various sciences and arts. Al-Shawkani moved between the scholars of Sana'a just as a bee moves from flower to flower and from orchard to orchard, sipping nectar to bring forth from its belly a drink of varying colors containing healing for people. He read with his sheikhs the mother books in various sciences: in creed, jurisprudence and its principles, language and its literature, Hadith and its sciences, logic, the etiquette of research and debate, and in Tafsir and its sciences, and other sciences in which he excelled. He wrote biographies for his sheikhs in his book \"Al-Badr al-Tali' bi Mahasin man ba'd al-Qarn al-Sabi'\" (The Rising Full Moon regarding the Virtues of Those after the Seventh Century).",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 5
  },
  {
    "serial_number": "1135302",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "He, may Allah have mercy on him, has numerous works, most of which are printed. Among the most important are his Tafsir \"Fath al-Qadir\", his book \"Nayl al-Awtar Sharh Muntaqa al-Akhbar\", \"Al-Fawa'id al-Majmu'ah fi al-Ahadith al-Mawdu'ah\", \"Al-Badr al-Tali' bi Mahasin man ba'd al-Qarn al-Sabi'\", \"Al-Sayl al-Jarrar al-Mutadaffiq 'ala Hada'iq al-Azhar\", \"Irshad al-Fuhul ila Tahqiq al-Haqq min 'Ilm al-Usul\", \"Tuhfat al-Dhakirin fi Sharh 'Uddat al-Hisn al-Hasin\", and others. (1)\n\n**Second: Definition of the Science of Munasabat (Correlations):**\n\nMunasabat is the plural of Munasaba. Munasaba in language means resemblance, similarity, and closeness (2). From it comes Al-Nasib: the close relative, like brothers, a cousin, and the like, between whom there is a 'Munasaba', i.e., a tie linking them, which is kinship.\nAmong the Usulis (scholars of principles of jurisprudence): Munasaba in the cause ('Illah) in the chapter of Analogy (Qiyas) is the description close to the ruling, because if its closeness to it occurs, the existence of the ruling is thought upon the existence of that description (3).\nAmong the rhetoricians: Proportionality (Tanasub) is the arrangement of brotherly meanings that harmonizes and does not conflict (4).\nIn the terminology of exegetes: Ibn al-Arabi defined it in his book \"Siraj al-Muridin\" as: \"The connection of the verses of the Quran with one another so that they are like a single word, consistent in meanings, regular in structures.\" (5)\nAl-Zarkashi defined it in \"Al-Burhan\" as: A reasonable matter which, if presented to minds, is accepted by them. (6)\nThus, the science of Munasaba is a science concerned with highlighting the aspects of connection and proportionality of verses and Surahs.\n\n**The First Topic: Al-Shawkani's Words about Munasabat**",
    "foot_note": "1. (1) - See his biography in Mu'jam al-Mu'allifin by Omar Rida Kahhala 11/53 and Al-Mujaddidun fi al-Islam by Abd al-Muta'al al-Sa'idi p. 472 \n2. - See Mu'jam Maqayis al-Lugha by Ibn Faris 5/324 and Al-Sihah 1/422 \n3. - See Usul al-Fiqh by Abu Zahra p. 241, Dar al-Fikr al-Arabi edition \n4. - See Al-Mu'jam al-Mufassal fi 'Ulum al-Balagha compiled and arranged by Dr. In'am Akkawi within the Al-Khizana al-Lughawiyya series 6/430, Dar al-Kutub al-Ilmiyya edition \n5. - Siraj al-Muridin by Judge Abu Bakr Ibn al-Arabi, quoted from Al-Itqan 2/108 \n6. - Al-Burhan fi 'Ulum al-Quran 1/36",
    "book_id": "943",
    "new_page_number": 6
  },
  {
    "serial_number": "1135303",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "**Presentation and General Responses**\n\nAl-Shawkani claims that researching this science is a form of affectation (takalluf), that there is no benefit from it, and that it is speaking by pure opinion which is forbidden. He criticizes Al-Biqa'i and others for their attention to this science. Below is a presentation of his words with general responses to them:\n\nAl-Shawkani says in the introduction of his Tafsir, opposing the science of Munasaba, denying it, and criticizing those interested in it:\n\"Know that many exegetes came with an affected science and waded into a sea they were not tasked to swim in, and consumed their times in an art that does not return a benefit to them. Rather, they threw themselves into speaking by pure opinion which is forbidden in matters related to the Book of Allah Almighty. That is because they wanted to mention the correlation between the Quranic verses listed in this arrangement present in the Mushafs, so they came with affectations and arbitrariness from which fairness is innocent and the speech of eloquent people is exalted, let alone the speech of the Lord Almighty. Until they singled that out with authorship and made it the most important purpose of composition, as Al-Biqa'i did in his Tafsir and those who preceded him, as mentioned in his sermon.\" (1)\n\nWe agree with Al-Shawkani that affectation is forbidden in Tafsir or otherwise, and that it is not permissible to speak by pure forbidden opinion. However, the science of Munasabat requires reflection and contemplation, not affectation and arbitrariness. It is a science indispensable for any exegete because it aids in understanding the meaning, preferring between opinions, knowing the general objectives of verses and Surahs, and other benefits. The correlation might be clear and evident, or it might need precise contemplation and deep reflection. If the correlation is hidden, it should not be denied or negated. As it has been said:\n*And if you do not see the crescent moon, then submit to people who saw it with eyes.*\n\nAl-Shawkani questions: How can we seek correlations for verses when they were revealed piecemeal according to events, so there is no correlation between them then?",
    "foot_note": "1. (1) - Fath al-Qadir 1 / 72, 73",
    "book_id": "943",
    "new_page_number": 7
  },
  {
    "serial_number": "1135304",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "Regarding this, Al-Shawkani says:\n\"Indeed, this is among the strangest things heard by one who knows that this Quran continued to be revealed piecemeal according to the incidents necessitating its revelation since the revelation of inspiration to the Messenger of Allah, peace be upon him and his family, until Allah Almighty took him unto Himself. Every sane person, let alone a scholar, does not doubt that these incidents necessitating the revelation of the Quran are different in themselves, nay, they may be contradictory, such as prohibiting a matter that was lawful and making lawful a matter that was prohibited, and establishing a matter for a person or persons that contradicts what was established for them before. Sometimes the speech is with the Muslims, sometimes with the disbelievers; sometimes with those who passed, sometimes with those present; at times regarding worship, at times regarding transaction; a time in encouragement, a time in intimidation; an occasion in glad tidings, an occasion in warning; a phase in a worldly matter, a phase in a Hereafter matter; once in future obligations, and once in past stories. If the causes of revelation differ this much and diverge this divergence with which harmony is not facilitated, then the Quran revealed in them is, considering itself, different like their difference. So how can a sane person seek correlation between the lizard and the whale, water and fire, the sailor and the camel driver?\"",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 8
  },
  {
    "serial_number": "1135305",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "Similar to this is what Imam Al-Izz bin Abd al-Salam said, as quoted by Al-Zarkashi in Al-Burhan:\nImam Al-Izz bin Abd al-Salam, may Allah have mercy on him, said: \"Munasaba is a good science, but it is a condition for the goodness of connection of speech that it occurs in a unified matter connected from its beginning to its end. If it occurs due to different causes, the connection of one to the other is not conditional. He said: Whoever connects that is affecting what he cannot do except with a weak tie from which good speech is protected, let alone the best of it. For the Quran was revealed over twenty-odd years regarding different rulings and for different reasons. Whatever is like that, it is not possible to link some of it to others, since it is not proper to link the actions of the Deity in His creation and rulings to one another given the difference in causes and reasons, like the actions of kings, rulers, and muftis, and the actions of a human himself in compatible, different, and opposing matters. No one has the right to seek linking some of those actions to others given their difference in themselves and difference in their times. End quote.\" (1)\n\nHowever, Al-Izz, may Allah have mercy on him, does not deny the existence of Munasaba absolutely, but considers it good if it occurs between unified speech connected from beginning to end.\n\nI say: The Holy Quran was revealed piecemeal according to incidents and events and observing gradualism in legislation, but it was collected in breasts (memory) and lines (writing) according to how it is in the Preserved Tablet, where Gabriel, peace be upon him, used to teach the Messenger of Allah, peace be upon him, the place of every verse in its Surah, in addition to the arrangement of Surahs as will be explained. If its revelation piecemeal has wisdoms and benefits that are not hidden, then its collection in this divinely appointed arrangement has wisdoms and benefits. And if its revelation piecemeal is a characteristic by which it was unique among previous books, then this arrangement is a characteristic of its characteristics. Is it reasonable that its arrangement in the Mushaf is different from the order of its revelation and then there is no wisdom for that? Why do we strive in seeking wisdoms and objectives of divine legislations and then demand ignoring the wisdom of the divine arrangement of the Noble Mushaf!",
    "foot_note": "1. (1) - Al-Burhan 1/37",
    "book_id": "943",
    "new_page_number": 9
  },
  {
    "serial_number": "1135306",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Imam Al-Zarkashi said in Al-Burhan: \"Some of our verifying sheikhs said: He who said that correlation is not sought for the noble verses because they are according to scattered occurrences has erred. The decisive speech is that they are according to occurrences in revelation, and according to wisdom in arrangement. The Mushaf is like the noble scriptures in accordance with what is in the Hidden Book, all its Surahs and verses arranged by divine instruction (Tawqif). If a memorizer of the Great Quran were asked for fatwa regarding multiple rulings, or debated about them, or dictated them, he would mention the verse of every ruling according to what he was asked. If he returned to recitation, he would not recite as he gave fatwa nor as it was revealed piecemeal, but as it was sent down wholly to the House of Glory (Bayt al-Izza). Among the clear miracles are its style and dazzling order, for it is (a Book whose verses are perfected and then presented in detail from [one who is] Wise and Acquainted) (1). He said: What should be researched in every verse first of all is its being complementary to what is before it or independent. Then regarding the independent one, what is the face of its correlation to what is before it? In that is abundant knowledge. Likewise in Surahs, the face of their connection to what is before them and what they were driven for is sought.\" (2)\n\nI say also: Not all Quranic Surahs were revealed piecemeal. Indeed, among the long Surahs are those revealed wholly, like Surah Al-An'am for example, and Surah Al-Fatiha and others. So do we not seek a correlation for them as well? (3) Also, some Surahs had large sections revealed wholly, so do we leave talking about their interconnection and correlation?",
    "foot_note": "1. (1) - Surah Hud 1 \n2. - Al-Burhan fi 'Ulum al-Quran 1 / 38 \n3. ? - Regarding Asma bint Yazid, she said: Surah Al-An'am was revealed to the Prophet, peace be upon him, all at once; it almost broke the bone of the she-camel due to its weight. Narrated by Al-Tabarani, and it contains Shahr bin Hawshab who is weak, but Majma' al-Zawa'id 7/20 declared him trustworthy. Al-Hakim narrated it in Al-Mustadrak with his chain from Jabir, may Allah be pleased with him, who said: Then when Surah Al-An'am was revealed, the Messenger of Allah, peace be upon him, glorified Allah then said: As many angels escorted this Surah as blocked the horizon. This is a Sahih hadith on the condition of Muslim, for this Ismail is Al-Suddi, and Al-Bukhari did not narrate it. Al-Mustadrak 'ala al-Sahihayn 2/ 344 - 3226",
    "book_id": "943",
    "new_page_number": 10
  },
  {
    "serial_number": "1135307",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "I also say: Isn't it strange that Al-Shawkani criticizes Al-Biqa'i for his interest in this science in his Tafsir \"Nazm al-Durar\"? Then we see him praising this Tafsir and the path of its author in it, saying in his book \"Al-Badr al-Tali'\" during his biography of him: \"Whoever examines deeply his book translated for him in Tafsir which he made about the correlations between verses and Surahs knows that he is among the vessels of knowledge, excessive in intelligence, combining the science of reason and tradition. Often something in the Book confuses me, so I return to the extensive and concise Tafsirs and find nothing that cures, and I return to this book - Nazm al-Durar - and find in it what is beneficial mostly.\" (1)\n\nAl-Shawkani claims that researching this science is nothing but \"opening doors of doubt and expanding the circle of suspicion for one in whose heart is a disease or whose disease is mere ignorance and deficiency. For if he finds scholars talking about proportionality between all verses of the Quran and singling that out with authorship, it becomes established in his mind that this is a necessary matter and that the Quran is not eloquent nor miraculous unless the face requiring the correlation appears and the matter necessitating the connection becomes clear. So if he finds difference between verses and returns to what the speakers said about that and finds it pure affectation and clear arbitrariness, what he was safe and sound from sparks in his heart.\" (2)\n\nI say: The correlation of verses and Surahs is an aspect of Quranic rhetoric, where there is quality of casting, splendor of order, beauty of structures, and ingenuity of styles. This correlation is a face of the faces of inimitability (I'jaz), and no one said that inimitability is based on it alone, or that Quranic rhetoric is represented only in it. The aspects of inimitability are multiple, and the rhetoric of the Quran is branched and its styles and colors are numerous.",
    "foot_note": "1. (1) - Al-Badr al-Tali' bi Mahasin man ba'd al-Qarn al-Sabi' by Al-Shawkani 2/1 \n2. - Fath al-Qadir 1/ Introduction",
    "book_id": "943",
    "new_page_number": 11
  },
  {
    "serial_number": "1135308",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "Did anyone say that researching the rhetorical inimitability in the Holy Quran might imply that there is no inimitability except from this aspect? So we should not research the rhetoric of the Quran lest someone imagine that the Quran will not be miraculous unless we research its rhetoric? Rather, researching this science increases the believer in faith and certainty and refutes the claims of the people of disbelief and misguidance who claim that the Quran has no arrangement.\n\nAl-Shawkani says, thinking that this science has no benefit: \"How little is the benefit of such [a thing], how rare is its fruit, and how despicable is its utility. Rather, for one who understands what he says and what is said to him, it is a waste of times and spending of hours in a matter that returns no benefit to its doer nor to the one who stands upon it from the people.\" (1)\n\nI say: This science has immense benefits. Through it, a face of the faces of Quranic inimitability, a characteristic of its characteristics, and the wisdom of its arrangement become clear to us. We also use it to reflect upon the speech of Allah Almighty and study it, understand its meanings and purposes, and other benefits which we will talk about in their place, God willing. It is part of reflecting upon the speech of Allah Almighty, and through it we extract lessons and sermons and recognize the purposes of Surahs and verses. Allah Almighty has commanded us to reflect upon His Noble Book. He said: {Then do they not reflect upon the Qur'an? If it had been from [any] other than Allah, they would have found within it much contradiction {82}} And He, Glory be to Him, said: {[This is] a blessed Book which We have revealed to you, [O Muhammad], that they might reflect upon its verses and that those of understanding would be reminded {29}}",
    "foot_note": "1. (1) - Same Reference - Introduction",
    "book_id": "943",
    "new_page_number": 12
  },
  {
    "serial_number": "1135309",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "Al-Shawkani also says, denying the possibility of linking between verses and Surahs and finding the thematic unity of the Quran: \"You know that if a man of knowledge undertook the task of finding correlation between what a man of eloquence said in his sermons, letters, and compositions, or to what a poet of the poets said in poems that are sometimes praise and other times satire, sometimes love poetry and sometimes elegy, and other different types; and this undertaker intended that collection and correlated between its paragraphs and sections, then affected another affectation and correlated between the sermon he gave on Jihad, the sermon he gave on Hajj, and the sermon he gave on marriage and the like, and correlated between the composition in condolence and the composition in congratulation and what resembles that; this undertaker for such [a task] would be considered mentally afflicted, playing with his times, tampering with his life which is his capital. If such is the case regarding this status, which is riding folly in human speech, how do you see it being in the speech of Allah Almighty, whose rhetoric incapacitated the eloquent of the Arabs and whose fluency silenced the eloquent of Adnan? Every deficient and perfect person knows that Allah Almighty described this Quran as Arabic and revealed it in the language of the Arabs and followed in it their paths in speech and ran with it in discourse. We have known that their orator used to stand in a single situation and bring different arts and divergent ways, let alone two situations, let alone situations, let alone all that he said as long as he lived. Likewise their poet. Let us suffice with this alert to this corruption in whose arenas many verifiers stumbled. We only mentioned this discussion in this place because the speech here has shifted to the Children of Israel after it was before it with the father of mankind, Adam, peace be upon him. If an affecter says: 'How did this correlate to what was before it?' We say: 'No how. So leave aside a spoil whose sides were shouted in, and bring a hadith; what is the hadith of the riding camels?'\" (1)\n\nI say: Is it reasonable to measure human speech against the speech of the Creator of humans? Is this matter acceptable? Are revelation sent down from Allah and a stray rhyme in the worlds equal?",
    "foot_note": "1. (1) - Same Reference",
    "book_id": "943",
    "new_page_number": 13
  },
  {
    "serial_number": "1135310",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "Do we compare human speech, which is not free from defect and deficiency, with the speech of the Subtle, the Acquainted, the Knower of what is in the breasts? Do we equate this with that? While Allah Almighty says about His Noble Book: {A Book whose verses are perfected and then presented in detail from [one who is] Wise and Acquainted {1}} [Surah Hud]. It is a book perfected in its order, perfected in its purposes, perfected in its construction, perfected in its consistency. It is a book where parts of it resemble others in the splendor of styles, precision of words, sublimity of purposes, unity of construction, correlation of verses, and interconnection of Surahs. Allah Almighty says in a Surah: {Allah has sent down the best statement: a consistent Book wherein is reiteration. The skins shiver therefrom of those who fear their Lord; then their skins and their hearts relax at the remembrance of Allah. That is the guidance of Allah by which He guides whom He wills. And one whom Allah leaves astray - for him there is no guide {23}}\n\nThis is a general response to the words of Imam Al-Shawkani, may Allah have mercy on him. The hiddenness of aspects of correlation is not a proof for denying it. It has been said: *And if you do not see the crescent moon, then submit to people who saw it with eyes.* It is strange that despite his stance preventing correlation as is clear from his words, we see him in his Tafsir citing numerous correlations. We will have a pause with them, God willing, through the subsequent topic where we offer detailed responses to some raised issues.\n\n**The Second Topic**\n**Detailed Responses**\n\n**First Requirement: His Claim that Munasabat is a Science without Benefit**\n\nImam Al-Shawkani claims that the science of Munasabat is a science without benefit. The truth is that this science has numerous benefits and useful fruits about which we will speak in this topic, God willing. We say, and success is from Allah:\nFrom the benefits of studying this science:\n\n**Knowing an Aspect of the Aspects of the Inimitability of the Holy Quran:**\nThe Holy Quran: Allah's profound argument, His renewed signs, and the Messenger's eternal miracle. A miracle for every generation and tribe, a miracle in every era and land, a miracle for all humanity in various stages of its life, nay, a miracle also for the Jinn.",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 14
  },
  {
    "serial_number": "1135311",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "Allah Almighty said: {Say, \"If mankind and the jinn gathered in order to produce the like of this Qur'an, they could not produce the like of it, even if they were to each other assistants.\" {88} And We have certainly diversified for the people in this Qur'an from every [kind of] example, but most of the people refused [anything] except disbelief. {89}}\nAmong the most prominent aspects of the inimitability of the Holy Quran is its inimitability in terms of the correlation of its verses and the harmony and embrace of its Surahs. The Holy Quran is a single thematic unity, and its verses and Surahs are a single structure:\n*Like pearls increasing in beauty when strung... And not decreasing in value when unstrung.*\nAl-Suyuti mentioned in his book \"Mu'tarak al-Aqran fi I'jaz al-Quran\" among the aspects of inimitability: [The fourth aspect of aspects of inimitability: the correlation of its verses and Surahs and the connection of some to others so that they are like a single word, consistent in meanings, regular in structures]. However, he repeated in this place what he had previously mentioned in Al-Itqan. (1)\nImam Al-Razi said in his Tafsir of Surah Al-Baqarah: \"Whoever contemplates the subtleties of the order of this Surah and the wonders of its arrangement knows that the Quran, just as it is miraculous in terms of the eloquence of its words and the honor of its meanings, is also so in terms of its arrangement and the order of its verses. Perhaps those who said it is miraculous in terms of its style meant that. However, I saw the majority of exegetes turning away from these subtleties, not attentive to these secrets. The matter in this chapter is nothing but as was said:\n*And the star, eyes belittle its image... And the fault is with the eye, not with the star in smallness.*\" (2)\nAl-Baqillani says in his book \"I'jaz al-Quran\": \"The third aspect of its inimitability aspects: It is of innovative order, wondrous composition, reaching an extremity in rhetoric to the limit that creation is known to be incapable of.\"",
    "foot_note": "1. (1) - Mu'tarak al-Aqran fi I'jaz al-Quran, The Fourth Aspect 1 / 54, see Al-Itqan 2 / 288 \n2. - Mafatih al-Ghayb 7 / 183..",
    "book_id": "943",
    "new_page_number": 15
  },
  {
    "serial_number": "1135312",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "He also says: \"...We have contemplated the order of the Quran and found all that it deals with of the faces (1) we mentioned before to be on one level in goodness of order and wonder of composition and arrangement. There is no disparity in it, nor descent from the highest rank, nor stooping in it to the lowest rank. Likewise, we contemplated the modes of address in long and short verses and saw inimitability in all of them on one level differing not. Also, people's speech may vary when retelling a single story a clear variation and differ a great difference. We looked at the Quran in what is retold of a single story and found it not different nor varying.\" (2)\nHe also says: \"As for the method of the Quran, its order, composition, and arrangement, minds wander in its direction, are bewildered in its sea, and stray short of its description. We mention to you in detailing this what you can use as evidence for the purpose, seize the span, reach the destination, conceive its inimitability as you conceive the sun, be certain of the extremity of its rhetoric as you are certain of the dawn, bring close the obscure to you, and ease the difficult for you. Know that this is a science of noble place, great standing, few students, and weak companions.\" (3)",
    "foot_note": "1. (1) - He means by that what is mentioned in the Quran of stories, sermons, arguments, wisdom, rulings, excusing, warning, promise, threat, good tidings, frightening, descriptions, teaching noble morals, high traits, traditional biographies, and other faces it contains. \n2. - I'jaz al-Quran by Al-Baqillani p. 37 summarized \n3. - Same Reference p. 185, 184..",
    "book_id": "943",
    "new_page_number": 16
  },
  {
    "serial_number": "1135313",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "Then Al-Baqillani mentions numerous examples indicating the splendor of the Quranic order, among which we mention the following:\n\"Contemplate the Surah in which the Ant is mentioned (Al-Naml) and look into it word by word and section by section. He began by mentioning the Surah until He clarified that the Quran is from Him, so He Almighty said: {And indeed, you are receiving the Qur'an from One, Wise and Knowing}. Then He connected to that the story of Moses, peace be upon him, and that he saw a fire {He said to his family, \"Stay here; indeed, I have perceived a fire. I will bring you from it information or bring you a burning torch that you may warm yourselves.\"}. And He said in Surah Ta-Ha in this story {that I may bring you from it a torch or find at the fire guidance}. And in a place {that I may bring you from it information or a burning coal from the fire that you may warm yourselves}. He has varied the modes and brought the mention of the story in varieties to teach them their inability regarding all ways of that. For this reason, He said {Then let them produce a statement like it} to be more effective in incapacitating them and more apparent as an argument against them. Every word of these words, even if informing about a story, is eloquent in itself, complete in its meaning. Then He said {But when he came to it, he was called, \"Blessed is whoever is at the fire and whoever is around it. And exalted is Allah, Lord of the worlds\"}. Look at what He ran the speech for, regarding the highness of this call's matter and the greatness of this praise's status. How it was organized with the first speech, how it connected to that introduction, and how He connected with it what followed of informing about Lordship and what He indicated it with of turning the staff into a snake and making it a proof guiding to Him and a miracle leading to Him. Look at the single words standing by themselves in beauty and in what they contain of noble meanings. Then what followed this verse and was paired with this indication regarding the white hand from the light of proof without harm. Then look into it verse by verse and word by word; do you find it as we described of wondrous order and innovative arrangement? Every word, if isolated, would be a peak in beauty and a sign in indication. So how about when its sisters accompany it and its likes join it, running in beauty its course and taking in its meaning? Then from story to story and from chapter to chapter without defect occurring in the order of section to section, until He portrays for you the separation as a connection with wondrous composition and eloquent revelation. If you want to clarify what...",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 17
  },
  {
    "serial_number": "1135314",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "...we said with extra clarification and verify what we claimed with extra verification: If you are of the people of the craft, intend a story of these stories and a hadith of these hadiths, express it with a phrase from your side and inform about it with words from you, until you see in what you brought the apparent deficiency and discern in the order of the Quran the dazzling proof.\" (1)\nProfessor Al-Rafi'i (2) said in his book \"I'jaz al-Quran wa al-Balagha al-Nabawiyya\": \"One of the most amazing things that agreed in this Quran of the faces of its inimitability is that its meanings run in the precision of order the course of its words according to what we explained of their matter - meaning what he previously mentioned of their beauty, splendor, and rhetoric - [This inimitability in the meanings of the Quran and their connection is a matter in which there is no doubt. It is more profound in its meaning if you pay attention to the fact that the Surah was not revealed in this arrangement. It was more likely not to harmonize and for some parts not to suit others, and for its verses to go every way in difference. But it is a spirit from the command of Allah that separated miraculously, and when it gathered, another miracle gathered for it so that those of understanding would be reminded]\" (3)\nHe, may Allah have mercy on him, says: [And you are bewildered if you contemplate the composition of the Quran and the order of its words in the different faces in which it varies. Expression fails you if you try to proceed in describing it, until you do not see in the entire language anything more indicative of your purpose and more gathering for what is in your soul. And where is there for this reality other than the word 'I'jaz' (Inimitability)?] (4)\nDr. Muhammad Abdullah Draz, may Allah have mercy on him, says: \"By my life, if the Quran has miracles in the rhetoric of its expression, miracles in the styles of its arrangement, miracles in its truthful prophecy, and miracles in all that it used of the facts of psychological and cosmic sciences; by my life, in the arrangement of its verses, it is the miracle of miracles.\" (5)\n\n**Seeking Help from the Science of Munasabat in Understanding Meaning:**",
    "foot_note": "1. (1) - Same Reference p. 40 \n2. - Mustafa Sadiq Al-Rafi'i: A late Egyptian writer and thinker \n3. - I'jaz al-Quran wa al-Balagha al-Nabawiyya p. 278 \n4. - Same Reference p. 280 \n5. - Al-Naba' al-Azim by Dr. Muhammad Abdullah Draz, may Allah have mercy on him, p. 209..",
    "book_id": "943",
    "new_page_number": 18
  },
  {
    "serial_number": "1135315",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "The exegete cannot do without studying this science and deepening in it. Through it, he seeks help in understanding the meaning, preferring between opinions in light of the context, removing ambiguity or problem, repelling illusion, knowing the wisdom of citing Quranic stories, or other benefits. Therefore, there must be a comprehensive holistic view and reflection on the purposes of the Surah and determining the general axis around which it revolves, and dividing the verses into sections, each section representing a single thematic unity interconnected, cohesive, and consistent with its predecessor and successor.\nImam Al-Razi, may Allah have mercy on him, says: \"The science of Munasabat is a great science in which many of the subtleties and wonders of the Quran are deposited. It is a reasonable matter which, if presented to minds, is accepted by them.\" (1)\nAl-Zarkashi said: \"What should be researched in every verse first of all is its being complementary to what is before it or independent. Then regarding the independent one, what is the face of its correlation to what is before it? In that is abundant knowledge. Likewise in Surahs, the face of their connection to what is before them and what they were driven for is sought.\" (2)\n\n**Standing upon a Special Characteristic of the Characteristics of the Holy Quran:**\nJust as the Holy Quran was unique in being revealed piecemeal - according to incidents and occurrences - contrary to what is customary in previous books which were revealed all at once: The Glorious Quran was distinguished by this unique order, this arranged casting, this wondrous variation, this diversity in styles, richness in performance, and transition from subject to subject, from wisdom to wisdom, from story to story, and from parable to parable, without that leading to disturbance or defect, boredom or weariness, contradiction or difference. Rather, consistency and harmony, observing the nature of souls, easing for readers, and providing insight and reminder for those of intellect.",
    "foot_note": "1. (1) - Al-Burhan 1 / 35 \n2. 2- Al-Burhan fi 'Ulum al-Quran 1 / 38..",
    "book_id": "943",
    "new_page_number": 19
  },
  {
    "serial_number": "1135316",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "A table filled and teeming, and gardens of joy, fresh, flowering, lush, fruitful, pleasing the looking eyes. Their branches intertwined, their flowers embraced, their birds harmonized, their fruits resembled each other, their streams mixed, their pearls were ordered, and their jewels were consistent in a regular necklace:\n*Like pearls increasing in beauty when strung... And not decreasing in value when unstrung.*\nAllah Almighty said in Surah Al-Isra: {And We have certainly diversified [the verses] in this Qur'an that they might be reminded, but it increases them in nothing but aversion. {41}}\nAnd He Almighty said in Surah Ta-Ha: {And thus We have sent it down as an Arabic Qur'an and have diversified therein the warnings that perhaps they will avoid [sin] or it would cause them remembrance. {113}}\nAnd He, Glory be to Him, said in Surah Al-Furqan explaining the wisdom of revealing the Quran piecemeal: {And those who disbelieve say, \"Why was the Qur'an not revealed to him all at once?\" Thus [it is] that We may strengthen thereby your heart. And We have recited it with distinct recitation. {32}}\nSo the coming of the Quran piecemeal over twenty-three years according to what incidents and occurrences necessitate, what suits circumstances and conditions, and what keeps pace with the stages the Da'wah passed through, then its arrangement according to what exists in the Preserved Tablet with this wisdom and splendor: is a characteristic of the characteristics of this Quran, and a feature of its features by which it was unique among previous books which were revealed all at once...",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 20
  },
  {
    "serial_number": "1135317",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "Despite the diversity of subjects in a single Surah, including rulings, creed, stories, parables, promises, and threats, we find them gathered in one context, proportional, consistent, all pouring into one goal, all revolving around one axis, organized by one necklace, and linked by one link. There is no contradiction, disturbance, disintegration, or repulsion between subjects. This arrangement is compatible with the general goal of the Quran, which is renewed reminding, confirming His Almighty's saying: {And thus We have sent it down as an Arabic Qur'an and have diversified therein the warnings that perhaps they will avoid [sin] or it would cause them remembrance. {113}} Surah Ta-Ha.",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 21
  },
  {
    "serial_number": "1135318",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "About that, the author of \"Manahil al-Irfan\" says, explaining a property of the Quran's properties which is: \"Quality of its casting and precision of its narration: This means that the Quran reached in the interconnection of its parts and cohesion of its words, sentences, verses, and Surahs a level no other speech approaches, despite its length, diversity of purposes, and its artistry and coloring in a single subject. The sign of that is if you contemplate the Holy Quran, you find it a complete body with nerves, skins, and membranes linking its parts. You glimpse in it a general spirit sending life and sensation upon interlacing and support between its organs. So it is a cohesive, harmonious unity while being a diverse, different multitude. Between the words of a single sentence is such consistency that made it wondrously homogeneous and attractive. Between the sentences of a single Surah is such interlacing and interconnection that made it a small unity with mutually taking parts and embracing verses. Between the Surahs of the Quran is such proportionality that made it a book of good appearance, an Arabic Quran without crookedness. As if it is a single ingot taking the eyes, while it is composed of rings. Each ring has an independent unity in itself with parts, and each part has a specific place in the ring, and each ring has a specific place in the ingot. But due to the quality of casting and precision of narration, He made from these scattered, separate parts a wondrous, harmonious unity showing you the perfection of harmony between every part and part, then between every ring and ring, then between the beginnings of the ingot, its ends, and its middles. This precision and interconnection in the Quran is known to everyone who pays attention to the proportionality common in it without disintegration, failure, dissolution, or repulsion, while the subjects are different and diverse, from legislation to stories to argument to description to other than that.\" (1)\n\n**Refuting Suspicions Raised by Enemies of Islam about the Thematic Unity of the Quran:**",
    "foot_note": "1. (1) - Manahil al-Irfan 2 / 228, 229..",
    "book_id": "943",
    "new_page_number": 22
  },
  {
    "serial_number": "1135319",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "Many Orientalists and missionaries have attacked the Unity, claiming that the verses of the Quran are not gathered by a context and have no agreement between them. They recommended reordering the Quran according to the causes of its revelation to facilitate for the reader and help him understand the meaning - according to their false claim and sick understanding. The French Orientalist Blachère (1) says: \"The reordering of Surahs proposed by [Nöldeke] (2) attains here full importance because it casts reassuring lights on the Mushaf and returns the placement of texts to horizons easy to perceive by being linked to the reasonable historical context [meaning according to their revelation].\" Blachère also says: \"The Western reader then reaches with logic containing no affectation the conviction that life has been restored to the pages, so it no longer appears in the form of an artificial sequential and irregular arrangement of texts, but in the form of a series of topics treated by Muhammad over twenty years according to the requirements of his mission.\" Then he says on the same subject: \"What is important from that moment is that the reader of the Quran accepts submission. Experience indicates, it seems, that adherence to the chronological stages of the arrangement proposed by Nöldeke and adopted by some translators makes reading the Mushaf easy, indeed enjoyable.\" (3)",
    "foot_note": "1. (1) - French Orientalist. Among his most famous books are History of Arabic Literature and The Quran: Its Revelation, Recording, Translation, and Influence. See his biography in the book Al-Mustashriqun by Professor Najib al-Aqiqi 1/309:312, Dar al-Ma'arif edition \n2. - German Orientalist d. 1930 AD. He has numerous works including History of the Quranic Text. See his biography in the book Al-Mustashriqun by Professor Najib al-Aqiqi 2/ 379:383 \n3. - The Quran: Its Revelation, Recording, Translation, and Influence by Blachère, translation by Rida Saadeh p. 23:44",
    "book_id": "943",
    "new_page_number": 23
  },
  {
    "serial_number": "1135320",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "What Blachère went to, and Nöldeke before him, was exceeded by the Jewish Orientalist Goldziher in his book \"Schools of Islamic Exegesis\", where he says: \"The Quran in the entire ancient run of Islamic history did not achieve inclination towards doctrinal unification of the text except slight victories.\" (1) Thus, the enemies of Islam conspired and advised one another on these false claims that indicate the deficiency of their understanding and superficiality of their study, or indicate bad intentions and malicious inner thoughts. {Did they suggest it to them? Rather, they are a transgressing people. {53} So turn away from them, for you are not to be blamed. {54} And remind, for indeed, the reminder benefits the believers. {55}} Surah Al-Dhariyat. {Or do their minds command them to [do] this, or are they a transgressing people? {32} Or do they say, \"He has made it up\"? Rather, they do not believe. {33} Then let them produce a statement like it, if they should be truthful. {34}} Surah At-Tur.",
    "foot_note": "1. (1) - Schools of Islamic Exegesis by Goldziher p. 5, translated by Dr. Abd al-Halim al-Najjar..",
    "book_id": "943",
    "new_page_number": 24
  },
  {
    "serial_number": "1135321",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "From here we realize the importance of studying the Thematic Unity which answers many questions and refutes numerous suspicions. One of the most interested in this aspect, Sheikh Sa'id Hawwa, may Allah have mercy on him, noticed this. He says in the introduction of his book \"Al-Asas fi al-Tafsir\" - that book which includes a complete theory on the thematic unity of the Holy Quran, explaining the secret of his interest in this subject -: \"I have been asked more than once by some to whom I presented my point of view in my understanding of the connection between verses and Surahs about the benefit of this subject. I used to answer that this subject contains a refutation of the suspicion of the enemies of Islam who claimed that this Quran does not gather its verses in a single Surah by a gatherer nor link its Surahs by a link. That is not befitting of human speech, so how about the speech of the Lord of the Worlds? It is a very terrible suspicion that an attempter tries to make a Muslim feel that the Book of Allah descends below the book of humans in this regard. I have been able, praise be to Allah, to prove that the perfection of the Quran is in the unity of its verses in a single Surah and its perfection in the comprehensive unity that gathers between its Surahs and verses in a way the world has not known a like to, nor crosses the heart of a human (1). I have been able by this to return the arrow to the liver of its shooter from the enemies of Allah in this point specifically.\" (2)\nI say: This is a wisdom of the wisdoms of the Knowing, the Acquainted, that He destines from the enemies of religion those who serve Islam without perceiving. For the raising of this false suspicion by the enemies of Islam pushed many of the jealous ones to study this subject deeply. (3)",
    "foot_note": "1. (1) - I studied this theory in my thesis \"Methodology of Sheikh Sa'id Hawwa in Tafsir\" and published it in a book under the title \"Lectures in Quranic Sciences\" and also published it in Al-Nour Egyptian newspaper in the blessed month of Ramadan 1419 AH \n2. - Al-Asas fi al-Tafsir 1/27 \n3. - And Abu Tammam spoke the truth in his saying: *And if Allah wanted to spread a virtue that was folded... He made available for it the tongue of an envier. Were it not for the ignition of fire in what it neighbored... The pleasant scent of oud would not be known.* [Kamil Meter] Diwan Abi Tammam p. 85, Dar al-Kutub al-Ilmiyya edition..",
    "book_id": "943",
    "new_page_number": 25
  },
  {
    "serial_number": "1135322",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "And the poet Abu Tammam spoke the truth in his saying:\n*And if Allah wanted to spread a virtue that was folded... He made available for it the tongue of an envier.*\n*Were it not for the ignition of fire in what it neighbored... The pleasant scent of oud would not be known.*\nFrom the foregoing, it becomes clear to us: The importance, nay necessity, of studying the science of Munasabat. This science is indispensable for the exegete in understanding the meaning, preferring between opinions, repelling illusion, or removing ambiguity, in addition to highlighting an aspect of Quranic inimitability in the proportionality of its verses and unity of its Surahs, alongside refuting the suspicions of the enemies of Islam regarding the arrangement of the Quran.\n\n**Most Important Works Concerned with This Science (1):**\nDue to the importance of this science, many exegetes, ancient and modern, cared for it. Scholars discussed it in books of Quranic sciences, and some devoted separate works to it. Below we point out the most important books concerned with it:\n- Al-Itqan fi 'Ulum al-Quran by Al-Suyuti.\n- Al-I'jaz al-Bayani fi Tartib Ayat al-Quran wa Suwarih, a scientific thesis by Dr. Muhammad Ahmad Yusuf Al-Qasim, Professor at Al-Azhar and Umm Al-Qura universities, containing a definition of this science, its importance, types of correlations in the Quran, etc.\n- Al-Burhan fi Tanasub Suwar al-Quran by Abu Ja'far Ahmad bin Ibrahim bin al-Zubayr - printed at Imam Muhammad bin Saud Islamic University, edited by Sa'id Jum'a al-Falah.\n- Al-Burhan fi 'Ulum al-Quran by Badr al-Din al-Zarkashi d. 794.\n- Tanasuq al-Durar fi Tanasub al-Suwar by Jalal al-Din al-Suyuti d. 911 may Allah have mercy on him.\n- Jawahir al-Bayan fi Tanasub Suwar al-Quran by Abdullah Muhammad bin Siddiq al-Ghumari.\n- Rabt al-Suwar wa al-Ayat by Muhammad bin al-Mubarak known as Hakim Shah al-Qazwini d. 920 AH.\n- Simt al-Durar fi Rabt al-Ayat wa al-Suwar by Muhammad Zahir bin Ghulam from the scholars of India d. 1407 AH.\n- Mu'tarak al-Aqran fi 'Ulum al-Quran by Al-Suyuti.\n- Manahil al-Irfan fi 'Ulum al-Quran by Professor Abd al-Azim al-Zarqani.\n- Al-Naba' al-Azim by Dr. Muhammad Abdullah Draz may Allah have mercy on him.",
    "foot_note": "1. (1) - Arranged alphabetically..",
    "book_id": "943",
    "new_page_number": 26
  },
  {
    "serial_number": "1135323",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "- Nazrat al-Ajlan fi Aghrad al-Quran by Ibn Shahid Maysalun Muhammad bin Kamal al-Khatib. In this book, its author argued that Surah Al-Fatiha is an axis for the entire Holy Quran.\n- Al-Wahda al-Mawdu'iyya lil-Surah al-Quraniyya, a study by Dr. Rif'at Fawzi Abd al-Muttalib, Dar al-Salam edition, Cairo.\n- Al-Wahda al-Mawdu'iyya lil-Quran al-Karim by Dr. Muhammad Mahmud Hijazi, may Allah have mercy on him, author of Al-Tafsir al-Wadih. In this thesis, he deals with the unity of subject in the Quran.\n\nFrom Tafsir Books:\n1. Irshad al-Aql al-Salim ila Mazaya al-Kitab al-Karim by the scholar Abu al-Saud (Muhammad bin Muhammad Mustafa al-Imadi al-Hanafi d. 982 AH).\n2. Al-Asas fi al-Tafsir by Sheikh Sa'id Hawwa may Allah have mercy on him d. 1409 AH.\n3. Adwa' al-Bayan fi Idah al-Quran bi al-Quran by Al-Shanqiti Muhammad al-Amin bin Muhammad al-Mukhtar al-Jakni d. 1993 AH.\n4. Anwar al-Tanzil wa Asrar al-Ta'wil by Al-Baydawi (Abdullah bin Umar d. 685 AH).\n5. Al-Bahr al-Muhit by Imam Muhammad bin Yusuf famous as Abu Hayyan al-Andalusi d. 754 AH.\n6. Tafsir Ibn Juzayy al-Kalbi, Dar al-Kitab al-Arabi edition, Beirut 1403 AH.\n7. Tafsir al-Quran al-Hakim famous as Tafsir al-Manar by Sayyid Muhammad Rashid Rida.\n8. Al-Tahrir wa al-Tanwir by Professor Muhammad al-Tahir bin Ashur d. 1393 AH.\n9. Al-Tafsir al-Qurani lil-Quran by Professor Abd al-Karim al-Khatib.\n10. Al-Tafsir al-Qayyim by Imam Ibn al-Qayyim, collected by Muhammad Uways al-Nadwi and edited by A/Muhammad Hamid al-Fiqi.\n11. Al-Tafsir al-Munir by Wahbah al-Zuhayli.\n12. Hashiyat al-Sawi 'ala al-Jalalayn by Imam Ahmad bin Muhammad al-Sawi al-Masri al-Maliki d. 1241 AH.\n13. Hashiyat Muhyi al-Din Sheikh Zadah 'ala Tafsir al-Baydawi.\n14. Ruh al-Bayan by Al-Burusawi Ismail Haqqi al-Burusawi d. 1370 AH.\n15. Ruh al-Ma'ani fi Tafsir al-Quran al-Azim wa al-Sab' al-Mathani by Imam Al-Alusi Shihab al-Din al-Sayyid Mahmud al-Alusi d. 1270 AH.",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 27
  },
  {
    "serial_number": "1135324",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "16. Al-Siraj al-Munir fi al-I'anah 'ala Ma'rifat Ba'd Ma'ani Kalimat Rabbina al-Hakim al-Khabir by Imam Shams al-Din Muhammad bin Ahmad al-Khatib al-Shirbini d. 977 AH.\n17. Ghara'ib al-Quran wa Ragha'ib al-Furqan by Nizam al-Din al-Nisaburi d. 728 AH.\n18. Al-Futuhat al-Ilahiyya bi Tawdih Tafsir al-Jalalayn lil-Daqa'iq al-Khafiyya by Imam Sulayman bin Umar al-Ujayli al-Shafi'i famous as Al-Jamal d. 1204 AH.\n19. Fi Zilal al-Quran by Professor Sayyid Qutb d. 1966 AD.\n20. Lata'if al-Isharat by Imam Abd al-Karim al-Qushayri d. 465 AH.\n24. Mafatih al-Ghayb (Al-Tafsir al-Kabir) by Imam Fakhr al-Din al-Razi d. 606 AH.\n25. Al-Mizan fi Tafsir al-Quran by Professor Muhammad Husayn al-Tabataba'i.\n26. Nazm al-Durar fi Tanasub al-Ayat wa al-Suwar by Burhan al-Din al-Biqa'i.\n\n**The Second Requirement**\n**His Claim That Correlation is Not Sought for Verses Because They Were Revealed Separately According to Incidents and Occurrences**\n\n**Important Facts That Must Be Clarified:**\nSome opponents of the science of Munasabat might use the excuse that the Holy Quran was revealed piecemeal according to incidents and occurrences, so there is no room for the affectation of searching for aspects of its interconnection. We respond to those by reminding of the following facts:\n\n**Arrangement of the Mushaf as in the Preserved Tablet:**\nThe Holy Quran, as we know, is recorded in the Preserved Tablet. The Lord of Glory informed about that saying: \"{And indeed it is, in the Mother of the Book with Us, exalted and full of wisdom.} [Surah Az-Zukhruf Verse: 4].\" Meaning the Quran in the Preserved Tablet is \"with Us, exalted and full of wisdom\", i.e., lofty, precise, with no difference or contradiction in it. Allah Almighty said: \"Indeed, it is a noble Qur'an. In a Register well-protected.\" [Al-Waqi'a: 77-78] And He Almighty said: \"But this is an honored Qur'an. [Inscribed] in a Preserved Tablet.\" [Al-Buruj: 21, 22].\n\n**There were multiple descents of the Holy Quran:**\nIt descended wholly from the Preserved Tablet to the House of Glory (Bayt al-Izza), and from the House of Glory to the heart of the Chosen One, peace be upon him, piecemeal...",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 28
  },
  {
    "serial_number": "1135325",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "* Al-Tabari narrated in his Tafsir from Ibn Abbas, may Allah be pleased with them both, who said: \"The Night of Decree is the Blessed Night, and it is in Ramadan. The Quran was revealed all at once from the Zubar (1) to the Inhabited House (Al-Bayt al-Ma'mur), which is the positions of stars in the lowest heaven where the Quran fell. Then it was revealed to Muhammad after that regarding command, prohibition, and wars, gradually.\" (2)\n* And Al-Tabari narrated in his Tafsir with his chain from Sa'id bin Jubayr from Ibn Abbas, may Allah be pleased with them both, who said: The Quran was revealed on the Night of Decree from the highest heaven to the heaven all at once, then separated over the years afterwards. He said: And Ibn Abbas recited this verse (So I swear by the setting of the stars). He said: It was revealed piecemeal. (3)\n\n**The Arrangement of the Holy Quran as it is in the Mushaf is a Divinely Appointed Arrangement (Tawqifi) according to what is present in the Preserved Tablet, not according to the order of its revelation.** It is according to incidents, occurrences, and interests in revelation, and according to the requirement of wisdom in arrangement.\n\n**The Trustworthy of Revelation, Gabriel peace be upon him, Teaches the Messenger of Allah peace be upon him the Arrangement of the Quran:**\nRevelation would descend upon the Messenger, peace be upon him, and as soon as the Trustworthy of Revelation, Gabriel peace be upon him, finished, what was revealed would be collected in the heart of the Messenger of Allah, peace be upon him. The Trustworthy of Revelation used to inform the Messenger of Allah, peace be upon him, of the place of every verse in every Surah.",
    "foot_note": "1. (1) - He means by that the Preserved Tablet \n2. - Tafsir Al-Tabari 2/145. Narrated by Al-Nasa'i in Al-Sunan Al-Kubra Hadith 11372 and Al-Hakim in Al-Mustadrak 'ala al-Sahihayn 2 / 578 - 3958 and said this is a Sahih hadith on the condition of the two Sheikhs and they did not narrate it. Narrated by Al-Diya' in Al-Ahadith Al-Mukhtara 10 / 153 and its narrators are trustworthy. Al-Haythami cited it in Majma' al-Zawa'id 7 / 140 and its text from Ibn Abbas said: The Quran was revealed all at once until it was placed in the House of Glory in the lowest heaven, and Gabriel revealed it to Muhammad peace be upon him... Narrated by Al-Tabarani and Al-Bazzar briefly. The men of Al-Bazzar are the men of the Sahih, and in Al-Tabarani's chain is Amr bin Abd al-Ghaffar who is weak. \n3. - Same Reference..",
    "book_id": "943",
    "new_page_number": 29
  },
  {
    "serial_number": "1135326",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "**The Messenger of Allah, peace be upon him, Following the Revelation to Him, Would Summon the Scribes and Dictate to Them What Was Revealed to Him, Informing Them of the Position of Verses and Their Order in Their Surahs and the Order of Surahs as Well:**\nIndicating this is:\n* What Imam Ahmad narrated in his Musnad from Uthman bin Abi al-As, may Allah be pleased with him, who said: I was sitting with the Messenger of Allah, peace be upon him, when he fixed his gaze and then lowered it, then said: Gabriel came to me and ordered me to place this verse in this place of the Surah: {Indeed, Allah orders justice and good conduct and giving to relatives} the verse, Surah Al-Nahl 90. (1)\n* And what Muslim narrated from Umar, may Allah be pleased with him, who said: I did not ask the Prophet about anything more than I asked him about Al-Kalala, until he poked his finger in my chest and said: \"The verse of summer which is at the end of Surah Al-Nisa is sufficient for you.\" So he guided him to the place of that verse in Surah Al-Nisa, which is His saying Almighty: {They request from you a [legal] ruling. Say, \"Allah gives you a ruling concerning one having neither descendants nor ascendants [as heirs].\"} to the end of the last verse of Surah Al-Nisa. (2)\n\n**Gabriel peace be upon him Studies the Quran with the Messenger of Allah peace be upon him Every Year According to its Arrangement:**\nIn the month of Ramadan of every year, Gabriel peace be upon him used to review the Quran with the Messenger of Allah peace be upon him, until the year in which the Messenger of Allah peace be upon him passed away, he reviewed it with him twice.",
    "foot_note": "1. (1) - Narrated by Imam Ahmad in his Musnad Volume Four Musnad al-Shamiyyin. Cited by Al-Haythami in Al-Majma' Book of Tafsir. - Chapter Surah Al-Nahl. In Hadith number: 10708 - And said narrated by Ahmad and its chain is Hasan. \n2. - Narrated by Imam Muslim in his Sahih 23 - Book of Inheritance 2 - Chapter Inheritance of Al-Kalala. Hadith number: 9 - (1617) ..",
    "book_id": "943",
    "new_page_number": 30
  },
  {
    "serial_number": "1135327",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "* Al-Bukhari narrated in his Sahih from Ibn Abbas, may Allah be pleased with them both, who said: The Messenger of Allah, peace be upon him, was the most generous of people, and he was most generous in Ramadan when Gabriel met him. He used to meet him every night of Ramadan to study the Quran with him. So the Messenger of Allah, peace be upon him, was more generous in good than the sent wind. (1)\n* And Al-Bukhari narrated in his Sahih with his chain from Aisha, may Allah be pleased with her, who said:",
    "foot_note": "1. (1) - Sahih Al-Bukhari 1 - Beginning of Revelation. 1 - Chapter: How was the beginning of revelation to the Messenger of Allah, peace be upon him. Hadith number: 6. Narrated by Muslim in his Sahih 43 - Book of Virtues. (12) Chapter: The Prophet, peace be upon him, was the most generous of people in good than the sent wind. Hadith number: 2308 (12) Chapter: The Prophet, peace be upon him, was the most generous of people in good than the sent wind.",
    "book_id": "943",
    "new_page_number": 31
  },
  {
    "serial_number": "1135328",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "Fatima came walking, her gait as if it were the gait of the Prophet, peace be upon him. The Prophet, peace be upon him, said: (Welcome, my daughter). Then he seated her on his right or his left, then he whispered a hadith to her and she wept. I said to her: Why do you weep? Then he whispered a hadith to her and she laughed. I said: I have never seen like today joy closer to sadness. I asked her what he said. She said: I would not disclose the secret of the Messenger of Allah, peace be upon him. Until the Prophet, peace be upon him, passed away, I asked her. She said: He whispered to me: (Gabriel used to review the Quran with me once every year, and he reviewed it with me twice this year, and I do not see it but that my term has approached, and you are the first of my family to join me). So I wept. He said: (Are you not pleased to be the mistress of the women of Paradise, or the mistress of the believing women). So I laughed at that. (1)\n* Al-Nasa'i narrated in Al-Sunan Al-Kubra with his chain from Abu Huraira, may Allah be pleased with him, who said: The Quran used to be presented to the Messenger of Allah, peace be upon him, in every Ramadan. When it was the year in which he, peace be upon him, passed away, it was presented to him twice. He used to perform I'tikaf for the last ten days, but when it was the year in which he passed away, he performed I'tikaf for twenty. (2)\n\n**The Arrangement of the Quran is a Manifestation of Allah's Preservation of His Book:**",
    "foot_note": "1. (1) - Sahih Al-Bukhari - Book of Virtues (Manaqib). 22 - Chapter: Signs of Prophethood in Islam. The words are found in Hadith number: 3426/3427 - Narrated by Muslim in Virtues of the Companions, Chapter: Virtues of Fatima daughter of the Prophet peace be upon him, Number: 2450. (Reviews the Quran with me) from Mu'arada which is comparing in reading by heart. (Joy closer to sadness) meaning joy was near sadness. (Disclose) from Ifsha' which is revealing. (My term has approached). My death is near]. \n2. 8 - Al-Sunan Al-Kubra 5 / 7 Hadith 7992..",
    "book_id": "943",
    "new_page_number": 32
  },
  {
    "serial_number": "1135329",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "Among the manifestations of Allah's preservation of His Book is that He preserved it arranged as it is in the Preserved Tablet, from which the Quran descended wholly to the lowest heaven before descending piecemeal according to occurrences, incidents, and occasions. Allah Almighty said in Surah Al-Hijr: {Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian. {9}} And He, Glory be to Him, said addressing His Noble Messenger: {Move not your tongue with it, [O Muhammad], to hasten with recitation of it. {16} Indeed, upon Us is its collection [in your heart] and [to make possible] its recitation. {17} So when We have recited it [through Gabriel], then follow its recitation. {18} Then upon Us is its clarification. {19}} Surah Al-Qiyama. So the Quran, even if revealed piecemeal, Allah Almighty guaranteed to collect it in the heart of His Messenger, peace be upon him, arranged, as the Trustworthy of Revelation Gabriel, peace be upon him, used to explain to the Messenger, peace be upon him, the position of every verse and the place of every Surah...",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 33
  },
  {
    "serial_number": "1135330",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "When the Quran was collected in one Mushaf during the reign of Uthman, may Allah be pleased with him, its arrangement which the Companions learned from the Messenger of Allah, peace be upon him, was observed in its collection.\nAs for what Al-Hakim and others narrated from Ibn Abbas, may Allah be pleased with them both: I said to Uthman bin Affan, may Allah be pleased with him: What compelled you to take Al-Anfal, which is from the Mathani (oft-repeated/medium length), and Al-Bara'ah (Al-Tawbah), which is from the Mi'in (hundreds), and join them together and not write the line 'In the name of Allah, the Most Gracious, the Most Merciful' between them, and place them in the Seven Long ones? What compelled you to do that? Uthman, may Allah be pleased with him, said: The Messenger of Allah, may Allah be pleased with him (sic), used to have times when Surahs with numbers (of verses) were revealed to him. When something was revealed to him, he would call some of those who wrote it and say: 'Place this in the Surah in which such and such is mentioned.' And a verse would be revealed to him and he would say: 'Place this in the Surah in which such and such is mentioned.' Al-Anfal was among the first revealed in Medina, and Bara'ah was from the last of the Quran. Its story was similar to its story. The Messenger of Allah, peace be upon him, passed away and did not clarify to us that it was part of it. Therefore, I joined between them and did not write the line 'In the name of Allah, the Most Gracious, the Most Merciful' between them. (1)",
    "foot_note": "1. (1) - Narrated by Al-Hakim in Al-Mustadrak 'ala al-Sahihayn 2 / 242 - Hadith 2875 and said this is a Sahih hadith on the condition of the two Sheikhs and they did not narrate it, and Al-Dhahabi agreed, and Imam Ahmad in his Musnad Hadith 399 - 1/57. Narrated by Al-Tirmidhi in Al-Sunan Book of Tafsir 5/272 Hadith 3086, and said this is a Hasan hadith, we do not know it except from the hadith of Awf from Yazid al-Farisi from Ibn Abbas. Yazid al-Farisi is from the Tabi'in of Basra. Narrated by Abu Dawood in Al-Sunan Chapters on Prayer, Chapter on who recited it aloud Hadith 786, 787. Sheikh Ahmad Shakir, may Allah have mercy on him, mentioned in his Takhrilj of Al-Musnad commenting on Al-Tirmidhi's words: The correct copies of Sunan Al-Tirmidhi only have 'and it is a Hasan hadith' ... So Al-Tirmidhi's declaring it Hasan, Al-Hakim's declaring it Sahih, and Al-Dhahabi's agreement have no weight; the weight is for proof and evidence.\" Musnad Ahmad edited by the hadith scholar Ahmad Shakir, may Allah have mercy on him 1/57. Yazid bin Aban al-Raqashi is from the Tabi'in of Basra, and he is younger than Yazid al-Farisi. Yazid al-Raqashi only narrates from Anas bin Malik. I say: This Yazid is Munkar al-Hadith (his hadith is rejected). The author of Al-Mughni fi al-Du'afa' said: Yazid bin Aban al-Raqashi the worshiper, from Anas, Al-Nasa'i and others said he is Matruk (abandoned). In Al-Du'afa' wa al-Matrukin by Ibn al-Jawzi: \"Yazid bin Aban al-Raqashi, Shu'ba narrates from him and said: To commit adultery is more beloved to me than to narrate from Yazid al-Raqashi.\" In Mizan al-I'tidal fi Naqd al-Rijal: \"Yazid bin Aban al-Raqashi al-Basri Abu Amr, the worshiper, from Anas, Ghunaym bin Qays, and Al-Hasan. Hammad bin Salama, Al-Fa' bin Sulayman and a group narrated from him.\" In Al-Du'afa' wa al-Matrukin by Al-Nasa'i: \"Yazid bin Aban al-Raqashi, Matruk, Basri.\" In Du'afa' al-Uqayli: \"Shu'ba said: To engage in highway robbery is more beloved to me than to narrate from Yazid al-Raqashi. Abdullah bin Ahmad told us, he said: Ibn Yazid al-Raqashi was mentioned to my father, he said: Shu'ba used to liken him to Aban bin Abi Ayyash. Abdullah said: I heard my father say: Yazid al-Raqashi is above Aban bin Abi Ayyash. Muhammad bin Isa told us, he said: Amr told us, he said: Yahya used not to narrate from Yazid al-Raqashi, while Abd al-Rahman used to narrate from him. Zakariyya bin Yahya told us, he said: Muhammad bin al-Muthanna told us, he said: Abd al-Rahman narrated to us from Al-Rabi' bin Sabih from Yazid al-Raqashi. Muhammad bin Ahmad told us, Muawiyah bin Salih told us, he said: I heard Yahya say: Yazid al-Raqashi is weak.\" In Taqrib al-Tahdhib: \"Yazid bin Aban al-Raqashi Abu Amr al-Basri, the Storyteller (Al-Qass) with stress on the neglected Sad, an ascetic, weak, from the fifth category, died before the 120s.\" In Al-Tarikh al-Kabir: \"Yazid bin Aban al-Raqashi al-Basri from Anas, Shu'ba used to criticize him. Nasr told us, Rawh told us, from Harith who heard Yazid al-Raqashi, he was called Abu Amr.\" - Al-Mughni fi al-Du'afa' 2 / 747 - entry 7082; Al-Du'afa' wa al-Matrukin by Ibn al-Jawzi 3 / 206 - entry 3770; Mizan al-I'tidal fi Naqd al-Rijal 1 / 7 - entry 232; Al-Du'afa' wa al-Matrukin by Al-Nasa'i 1 / 110; Al-Du'afa' by Al-Uqayli 4 / 373 - 1983; Taqrib al-Tahdhib 1 / 599 - 7683; Al-Tarikh al-Kabir Vol: 8 p: 320 - 3166; Al-Jarh wa al-Ta'dil by Ibn Abi Hatim 9 / 251 - 1053. Narrated by Al-Bazzar in his Musnad 2/8 and said: We do not know this hadith narrated from the Messenger of Allah peace be upon him except from this aspect, and we do not know anyone who narrated it from the Messenger of Allah peace be upon him except Uthman, nor did anyone narrate it from Uthman except Ibn Abbas. Narrated by Ibn Hibban in his Sahih as in Al-Mawarid 1/125-Hadith 452. Ibn Kathir cited it in Fada'il al-Quran p. 24 and said its chain is strong and good.",
    "book_id": "943",
    "new_page_number": 34
  },
  {
    "serial_number": "1135331",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "Even assuming the authenticity of the hadith, Abdullah bin Abbas, may Allah be pleased with them both, did not object to their arrangement in the Mushaf. Rather, he was asking about the wisdom of joining them together, making them like a single Surah, and considering them among the Seven Long ones, knowing that Al-Anfal is from the Mathani and Bara'ah is from the Mi'in.\nUthman, may Allah be pleased with him, responded by stating that the arrangement of the Mushaf follows the Divinely Appointed Arrangement (Tawqifi) which the Companions learned from the Messenger of Allah, peace be upon him; there is no room for Ijtihad (personal reasoning) in that. Uthman joined them and considered them as one Surah only because of the similarity between them in subject and goal, even though Al-Anfal was among the first revealed in Medina and Al-Tawbah among the last. But the criterion is not the order of revelation. Hence, he did not separate them with the Basmala and considered them as a single unit or single Surah with which the section of the Long ones ends.\nSupporting this is what Al-Nahhas narrated in Al-Nasikh wa al-Mansukh from Uthman, may Allah be pleased with him, who said: \"Al-Anfal and Bara'ah were called 'The Two Pairs' (Al-Qarinatan) in the time of the Messenger of Allah, peace be upon him; that is why I put them in the Seven Long ones.\" (1) Meaning he counted them as one Surah with which the Seven Long ones end.\nThere is nothing in the hadith indicating that Uthman, may Allah be pleased with him, is the one who arranged them in the Mushaf or that he merged them making them one Surah. If Al-Anfal and Al-Tawbah were one Surah, they would have had one name, and the number of Quranic Surahs would be 113. But the Ummah is agreed that the number of Surahs is 114, and that each has an independent name. The reason Surah Bara'ah did not begin with the Basmala is because of the disavowal and threat to the polytheists mentioned at its beginning; so it did not start with the Basmala which implies mercy, because the context does not suit talking about mercy.\nAl-Tibi said: \"This speech indicates that they descended in the status of one Surah and the Seven Long ones were completed by it. Then it was said the Seven Long ones are Al-Baqarah, Bara'ah, and what is between them.\" (2)",
    "foot_note": "1. (1) - Al-Nasikh wa al-Mansukh by Abu Ja'far Al-Nahhas Hadith 552-2/397 \n2. - Tuhfat al-Ahwadhi 8/ 381..",
    "book_id": "943",
    "new_page_number": 35
  },
  {
    "serial_number": "1135332",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "I have previously spoken about the stage of Quran collection during the reign of Uthman, may Allah be pleased with him, and the documentation and precision that characterized this collection. Uthman, may Allah be pleased with him, formed a committee of senior reciters, entrusted them with the task of collection, and supervised them. Uthman, may Allah be pleased with him, did what he did with the consultation of the Companions. He was not one to be arbitrary in opinion or use Ijtihad against a text, and no objector objected to that.\nAl-Bukhari narrated in his Sahih with his chain from Ibn al-Zubayr who said: I said to Uthman bin Affan, may Allah be pleased with him, regarding (And those who are taken in death among you and leave wives...) Al-Baqarah 234: The other verse abrogated it, so why do you write it or leave it? Meaning why do you write it, or he said why do you leave it written even though it is abrogated? He said: O nephew, I do not change anything from its place. (1)\n\n**Partitioning the Quran According to its Arrangement:**\nThe Messenger, peace be upon him, had a daily portion (Wird) of the Book of Allah Almighty which he was keen to read so that he would complete the Quran every now and then. The noble Companions, may Allah be pleased with them, had their daily portions, and some of them sought guidance from the Messenger of Allah, peace be upon him, in determining their portion.\n* Imam Ibn Khuzaimah narrated in his Sahih with his chain from Anas, may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, felt some pain one night. When morning came, it was said: O Messenger of Allah, the trace of pain is apparent on you. He said: Indeed, despite what you see, praise be to Allah, I read the Seven Long ones last night.\" (2)",
    "foot_note": "1. (1) 3 - Sahih Al-Bukhari 68 - Book of Tafsir. 43 - Chapter: {And those who are taken in death among you and leave wives determined for themselves four months and ten [days]. And when they have reached their term, then there is no blame upon you for what they do with themselves in an acceptable manner. And Allah is [fully] Acquainted with what you do.} Al-Baqarah / 234 - Hadith number: 4256 - \n2. 4 - Sahih Ibn Khuzaimah 2/ 177 Hadith 1136..",
    "book_id": "943",
    "new_page_number": 36
  },
  {
    "serial_number": "1135333",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "* And Ibn Majah narrated in his Sunan with his chain from the hadith of Aws bin Hudhayfah, and in it... So I said: O Messenger of Allah, you were late coming to us tonight. He said: It occurred to me [to complete] my portion (hizb) of the Quran, so I disliked coming out until I completed it. Aws said: So I asked the Companions of the Messenger of Allah, peace be upon him: How do you partition the Quran? They said: Three, five, seven, nine, eleven, thirteen, and the portion of the Mufassal. (1)\n* And Al-Bukhari narrated in his Sahih with his chain from the hadith of Abdullah bin Amr, and in it: He, peace be upon him, said to him: How do you fast? I said: Every day. He said: And how do you complete [the Quran]? I said: Every night. He, peace be upon him, said: Fast three days in every month and read the Quran in every month. I said: I can do more than that. He said: Fast three days in the week (Friday). I said: I can do more than that. He said: Break fast for two days and fast one day. I said: I can do more than that. He said: Fast the best fast, the fast of David: fasting one day and breaking fast one day, and read [the Quran] once every seven nights. I wish I had accepted the concession of the Messenger of Allah, peace be upon him, for I have grown old and weak. He used to read the seventh of the Quran to some of his family during the day; what he reads he presents during the day so it would be lighter for him at night. If he wanted to gain strength, he would break fast for days and count them, then fast days like them, hating to leave anything upon which he parted from the Prophet, peace be upon him.\" (2)",
    "foot_note": "1. (1) 4 - Sunan Ibn Majah 1 / 427 - Chapter: In how much is it desirable to complete the Quran Hadith 1345 \n2. 5- Sahih Al-Bukhari 4 / 1926 - Book of Virtues of the Quran - Chapter: In how much is the Quran read 4765..",
    "book_id": "943",
    "new_page_number": 37
  },
  {
    "serial_number": "1135334",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "Imam Ahmad narrated in his Musnad from Wathila bin al-Asqa' who said: The Messenger of Allah, peace be upon him, said: \"I was given the Seven Long ones in place of the Torah, the Mi'in in place of the Psalms (Zabur), the Mathani in place of the Gospel (Injil), and I was favored with the Mufassal.\" (1)\nThese four divisions of the Holy Quran indicate its Divinely Appointed Arrangement.\n\nFrom the foregoing, it becomes clear to us:\n* The Holy Quran descended wholly from the Preserved Tablet to the House of Glory, and from the House of Glory to the heart of the Chosen One, peace be upon him, piecemeal.\n* The arrangement of the Quran as it is in the Mushaf is Divinely Appointed (Tawqifi); there is no room for opinion in it, nor do the Companions have any intervention in its regard. It was by the command of the Messenger of Allah, peace be upon him, as he learned it from the Trustworthy of Revelation Gabriel, peace be upon him. The arrangement of the Mushaf is according to what is recorded in the Preserved Tablet, an arrangement that involves numerous wisdoms encompassed only by the Revealer of this Book, Majestic is His Majesty.\n* Gabriel, peace be upon him, used to study the Quran with the Messenger of Allah, peace be upon him, in the month of Ramadan every year, until the year the Messenger of Allah, peace be upon him, passed away, he reviewed it with him twice, observing its arrangement present in the Preserved Tablet and upon which is the Uthmani Mushaf.\n* The Messenger, peace be upon him, had a daily portion of the Book of Allah Almighty which he was keen to read until he completed the Quran every now and then. The noble Companions, may Allah be pleased with them, had their daily portions. Some of them memorized the entire Quran during the life of the Messenger, peace be upon him, and some completed memorizing it after his death, peace be upon him, all according to its arrangement.",
    "foot_note": "1. (1) 6 - Narrated by Imam Ahmad in his Musnad 4 / 107 - and Abu Dawood Al-Tayalisi in his Musnad Hadith 1012, Abu Ubayd in Fada'il al-Quran p. 119, Al-Bayhaqi in Al-Shu'ab Hadith 2415, and Al-Tabarani in Al-Kabir 22/76, and its chain is Hasan. The Mi'in are every Surah reaching one hundred [verses] or more. The Mathani are every Surah less than the Mi'in and above the Mufassal. \n....",
    "book_id": "943",
    "new_page_number": 38
  },
  {
    "serial_number": "1135335",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "* Among the manifestations of Allah's preservation of His Book is that He preserved it arranged as it is in the Preserved Tablet, from which the Quran descended wholly to the lowest heaven before descending piecemeal according to occurrences, incidents, and occasions.\n\n**The Third Requirement**\n**His Claim That There is No Correlation Between the Discussion of the Children of Israel in Surah Al-Baqarah and What Preceded It**\n\n*****\nImam Al-Shawkani, in his interpretation of the verse in Surah Al-Baqarah {O Children of Israel, remember My favor which I have bestowed upon you and fulfill My covenant upon you that I will fulfill your covenant from Me, and be afraid of [only] Me {40}} etc., went to the view that there is no correlation between the discussion of the Children of Israel and the story of Adam that preceded it, and that researching this is a form of affectation, for the discussion of the Children of Israel is new speech cut off from what is before it.\nHowever, if we look closely and reflect for long, we would find numerous links and many correlations that do not require arbitrariness or affectation to highlight. We will have pauses with them in this topic, God willing. We say, and success is from Allah:\n\n**Correlation between the Discussion of the Children of Israel and the Axis and Purposes of the Surah:**\nOne of the substantial pillars and basic axes of this noble Surah is: Talking about the Children of Israel, their past and present, revealing their secrets, warning against their plots and corruptions, reminding them of Allah's favors upon them, warning them lest they befall the like of what befell their ancestors, inviting them to believe in what Allah revealed to His Prophet and Chosen One, peace be upon him, opening the door of repentance and acceptance before them, and warning Muslims against following their ways. Therefore, the discussion about them took up numerous verses in multiple places of the noble Surah...",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 39
  },
  {
    "serial_number": "1135336",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "Surah Al-Baqarah is a Madinan Surah. Its revelation began after the Hijra to support and build the nascent Muslim society in that new atmosphere which brought together believers and other factions, the most dangerous of which were the Jews and the Hypocrites. It was necessary to talk about them in detail and clarification suitable for their mention in the longest Surah of the Quran, that Surah whose revelation took nine years. The discussion about the Jews in particular was one of the basic axes around which the noble Surah revolved - for they are the most dangerous hostile forces to this religion, and they have diverse methods and numerous means in cunning, deception, and plotting which the Quran alerted us to so we would be wary of them.\nIn this regard, Professor Sayyid Qutb, may Allah have mercy on him, says:\n\"The wisdom of the prolonged discussion about the Jews: This campaign - whether what came of it in this lesson or what follows in the context of the Surah - was necessary first and foremost to demolish the claims of the Jews, expose their plot, and clarify their reality and the reality of their motives in plotting against Islam and Muslims. It was also necessary to open the eyes and hearts of Muslims to these intrigues and plots directed at their new society and at the foundations on which it stands; just as they are directed at the unity of the Muslim rank to destabilize it and spread sedition within it...",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 40
  },
  {
    "serial_number": "1135337",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "On the other hand, it was necessary to warn Muslims against the slippery paths where the feet of the nation succeeded before them stumbled, so it was deprived of the position of vicegerency and stripped of the honor of upholding Allah's trust on earth and His methodology for leading humanity. This campaign was interspersed with explicit and implicit directives to Muslims warning them of those slippages, as will come in the second part of it. How much the Muslim community in Medina needed this and that! And how much the Muslim nation at all times needs to contemplate these directives and to study this Quran with an open eye and insightful sense, to receive from it the instructions of the divine, supreme leadership in its battles it wages against its traditional enemies; and to know from it how to respond to the deep, malicious plot they direct at it tirelessly, by the most hidden means and most cunning ways...\" (1)",
    "foot_note": "1. (1) - Fi Zilal al-Quran 1 / 28 - 1/65, 66",
    "book_id": "943",
    "new_page_number": 41
  },
  {
    "serial_number": "1135338",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "Professor Qutb, may Allah have mercy on him, clarifies that the discussion about the Children of Israel is one of the basic subjects and substantial pillars of this noble Surah. He says, may Allah have mercy on him: \"This Surah comprises several subjects. But the axis that gathers them all is a single double axis where the two main lines are strongly interconnected. On one hand, it revolves around the stance of the Children of Israel towards the Islamic Call in Medina, their reception of it, their confrontation with its Messenger, peace be upon him, and the emerging Muslim community based on it... and all matters related to this stance, including that strong relationship between the Jews and Hypocrites on one side, and between the Jews and Polytheists on the other. On the other hand, it revolves around the stance of the Muslim community at its inception; and preparing it to carry the trust of Da'wah and Vicegerency on earth, after the Surah announces the refusal of the Children of Israel to carry it, their breaking of Allah's covenant regarding it, and their stripping of the honor of true affiliation to Abraham - peace be upon him - the owner of the first Hanifiyya (true monotheism), and enlightening the Muslim community and warning it against the stumbles that caused the stripping of the Children of Israel of this great honor... All subjects of the Surah revolve around this double axis with its two main lines, as will come in its detailed review.\" \"To clarify the extent of the connection between the axis of the Surah and its subjects on one hand, and the course of the Da'wah early in Medina and the life of the Muslim community and its circumstances on the other... it is good to shed light on the summary of these circumstances which the verses of the Surah were revealed to confront initially. With the constant reminder that these circumstances in general are the circumstances that the Islamic Call and its people continued to face - with slight difference - throughout ages and times; from its enemies and allies alike. This makes these Quranic directives the constitution of this eternal Call; breathes into these texts a life that renews to face every age and phase; and raises them as landmarks for the path before the...",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 42
  },
  {
    "serial_number": "1135339",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "Muslim Ummah to guide itself by on its long, arduous path, amidst enmities of multiple appearances but unified nature... This is the inimitability, one of its aspects appearing in this fixed characteristic distinctive in every Quranic text. The heart lives with it as if living with a living spirit of distinct features, traits, and breaths! It has a main subject or several main subjects tied to a specific axis. It has a specific atmosphere shadowing all its subjects; making its context deal with these subjects from specific aspects that achieve consistency between them according to this atmosphere. It has a specific musical rhythm - if it changes within the context, it changes for a specific objective occasion... This is a general character in all Surahs of the Quran. Long Surahs like this one are no exception to this rule.\" (1)\nProfessor Dr. Muhammad Abdullah Draz, may Allah have mercy on him, mentioned in his valuable book \"Al-Naba' al-Azim\" that the discussion about the Children of Israel in Surah Al-Baqarah is a basic objective among its four objectives, which are as follows:\nFirst Objective: Inviting all people to embrace Islam.\nSecond Objective: Inviting the People of the Book specifically to leave their falsehood and enter the Religion of Truth.\nThird Objective: Presenting the laws of this religion in detail.\nFourth Objective: Mentioning the religious restraint and motive that incites adherence to those laws and protects from violating them. (2)",
    "foot_note": "1. (1) - Same Reference \n2. - Al-Naba' al-Azim, Dr. Muhammad Abdullah Draz, may Allah have mercy on him, p. 163..",
    "book_id": "943",
    "new_page_number": 43
  },
  {
    "serial_number": "1135340",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "**A Word on the Context:**\n\nThe Surah began by talking about Quranic guidance and people's stance towards it. Then came the first call in the Surah directed to all people inviting to the worship of Allah alone, for He, Glory be to Him, is the Creator, the Ordainer, the Manager, the Provider. Since the talk at the beginning of the Surah was about the Holy Quran as a book of guidance, talk about it came again from another perspective, which is its being a living, eternal, renewed miracle, with intimidation of those turning away from it, doubting it despite the appearance of proof and clarity of the path. The verses also carried glad tidings to the righteous believers of eternity in gardens of bliss. The context moved to talk about an eloquent style the Quran often takes to approximate meanings and establish them in minds in tangible molds; it is the style of striking parables, that lofty style which did not escape the criticism of the disbelievers.",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 44
  },
  {
    "serial_number": "1135341",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "Then was the reminder of the blessing of the first and second creation, and yet there are those who took the path of disbelief and persisted in it. Allah Almighty said: {And give good tidings to those who believe and do righteous deeds that they will have gardens beneath which rivers flow. Whenever they are provided with a provision of fruit from there, they will say, \"This is what we were provided with before.\" And it is given to them in likeness. And they will have therein purified spouses, and they will abide therein eternally. {25} Indeed, Allah is not timid to present an example - that of a mosquito or what is smaller than it. And those who have believed know that it is the truth from their Lord. But as for those who disbelieve, they say, \"What did Allah intend by this as an example?\" He misleads many thereby and guides many thereby. And He misleads not except the defiantly disobedient, {26} Who break the covenant of Allah after contracting it and sever that which Allah has ordered to be joined and cause corruption on earth. It is those who are the losers. {27} How can you disbelieve in Allah when you were lifeless and He brought you to life; then He will cause you to die, then He will bring you [back to] life, and then to Him you will be returned. {28} It is He who created for you all of that which is on the earth. Then He directed Himself to the heaven, [His being above all creation], and made them seven heavens, and He is Knowing of all things. {29}}",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 45
  },
  {
    "serial_number": "1135342",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "Just as He, the Mighty and Majestic, reminded us of the blessing of creation, He reminded us of the blessing of choosing our father Adam and establishing him and his progeny as vicegerents on earth, in addition to honoring him, peace be upon him, with the prostration of angels and dwelling him in Paradise with his wife Eve, and his eating from the tree after the whispering of the cursed Satan, and what resulted from that of exiting Paradise and descending to earth after Allah accepted the repentance of Adam and Eve. Allah Almighty said: {And [mention, O Muhammad], when your Lord said to the angels, \"Indeed, I will make upon the earth a successive authority.\" They said, \"Will You place upon it one who causes corruption therein and sheds blood, while we declare Your praise and sanctify You?\" He said, \"Indeed, I know that which you do not know.\" {30} And He taught Adam the names - all of them. Then He showed them to the angels and said, \"Inform Me of the names of these, if you are truthful.\" {31} They said, \"Exalted are You; we have no knowledge except what You have taught us. Indeed, it is You who is the Knowing, the Wise.\" {32} He said, \"O Adam, inform them of their names.\" And when he had informed them of their names, He said, \"Did I not tell you that I know the unseen [aspects] of the heavens and the earth? And I know what you reveal and what you have concealed.\" {33} And [mention] when We said to the angels, \"Prostrate before Adam\"; so they prostrated, except for Iblees. He refused and was arrogant and became of the disbelievers. {34} And We said, \"O Adam, dwell, you and your wife, in Paradise and eat from it in [ease and] abundance from wherever you will. But do not approach this tree, lest you be among the wrongdoers.\" {35} But Satan caused them to slip out of it and removed them from that [condition] in which they had been. And We said, \"Go down, [all of you], as enemies to one another, and you will have upon the earth a place of settlement and provision for a time.\" {36} Then Adam received from his Lord [some] words, and He accepted his repentance. Indeed, it is He who is the Accepting of repentance, the Merciful. {37} We said, \"Go down...}",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 46
  },
  {
    "serial_number": "1135343",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "{...from it, all of you. And when guidance comes to you from Me, whoever follows My guidance - there will be no fear concerning them, nor will they grieve. {38} And those who disbelieve and deny Our signs - those will be companions of the Fire; they will abide therein eternally.\" {39}}\n\nThen came the divine call directed to a specific group, the group of the Children of Israel, where Allah, the Mighty and Majestic, reminded them of His favors upon them and commanded them to fulfill the covenant which requires them to believe in the Seal Prophet, peace be upon him... Allah Almighty said: {O Children of Israel, remember My favor which I have bestowed upon you and fulfill My covenant upon you that I will fulfill your covenant from Me, and be afraid of [only] Me. {40} And believe in what I have sent down confirming that which is [already] with you, and be not the first to disbelieve in it. And do not exchange My signs for a small price, and fear [only] Me. {41} And do not mix the truth with falsehood or conceal the truth while you know [it]. {42} And establish prayer and give zakah and bow with those who bow [in worship and obedience]. {43} Do you order righteousness of the people and forget yourselves while you recite the Scripture? Then will you not reason? {44} And seek help through patience and prayer, and indeed, it is difficult except for the humbly submissive [to Allah] {45} Who are certain that they will meet their Lord and that they will return to Him. {46} O Children of Israel, remember My favor which I have bestowed upon you and that I preferred you over the worlds. {47} And fear a Day when no soul will suffice for another soul at all, nor will intercession be accepted from it, nor will compensation be taken from it, nor will they be aided. {48}} etc. verses...",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 47
  },
  {
    "serial_number": "1135344",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "Abu al-Saud said in his Tafsir: \"'O Children of Israel' is a coloring of speech and directing it to a specific group of disbelievers contemporary to the Prophet to remind them of the varieties of favors poured upon them, after directing it to the Messenger of Allah, peace be upon him, and commanding him to remind them all of the general favor to the children of Adam entirely by His saying Almighty (And when your Lord said) etc. and (And when We said to the angels) etc. Because the meaning as indicated is: Convey My speech to them and mention to them when We made their father a vicegerent on earth and prostrated to by angels, peace be upon them, and honored him by teaching names and accepted his repentance.\" (1)",
    "foot_note": "1. (1) - Tafsir Abi al-Saud 1 / 94..",
    "book_id": "943",
    "new_page_number": 48
  },
  {
    "serial_number": "1135345",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "Al-Biqa'i, may Allah have mercy on him, said: \"...Since the disbelievers were two types: a type whose disbelief was pure, and a type mixed with hypocrisy and deception. And the pure type was of two types: a type having no knowledge from a previous book, who are the polytheists of the Arabs, and a type having a book from which they know the truth. Allah Almighty mentioned the pure type encompassing both its knowledgeable and ignorant parts, saying Glory be to Him {Indeed, those who disbelieve - it is all the same for them whether you warn them or do not warn them - they will not believe {6} Allah has set a seal upon their hearts and upon their hearing, and over their vision is a veil. And for them is a great punishment {7}}. Then He followed it with the type of hypocrites so [believers] would be wary of their deception, saying Glory be to Him {And of the people are some who say, \"We believe in Allah and the Last Day,\" but they are not believers {8}} etc. verses. When He finished that and what followed it of commanding Oneness, establishing its proofs, pouring forth its virtues, wondering at those who disbelieved despite the establishment of proofs, warning against those calamities, and soliciting sympathy by mentioning favors: He began mentioning a part of the pure [disbelievers] who are like the hypocrite in that they know the truth and hide it. The hypocrite became familiar with disbelief then quit it and showed clothing in Islam while continuing on disbelief internally. This part - meaning the Children of Israel - was upon belief in this Prophet before his mission. When he called them, they erased the faith they were clothed in and showed disbelief, and their state continued on showing disbelief and hiding the knowledge which is the principle of faith. Their condition, as you see, is most similar to the condition of hypocrites; that is why you see them paired with them in much of the Quran. He delayed them only due to the length of their story and what it contains of proofs of prophethood and signs of messengership by revealing what they hid of the details of their conditions...\" (1)",
    "foot_note": "1. (1) - Nazm al-Durar 1/ 309, 310",
    "book_id": "943",
    "new_page_number": 49
  },
  {
    "serial_number": "1135346",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "Regarding the consistency of the discussion about the Children of Israel with the context, the author of \"Al-Zilal\", may Allah have mercy on him, says: \"Then we notice from the aspect of artistic and psychological consistency in the Quranic performance, that the start of this round fuses with the conclusion of the story of Adam, and with the suggestions we pointed to there. This is an aspect of complementarity in the Quranic context between stories and the context in which they are presented: The context proceeded before that establishing that Allah created everything on earth for man. Then the story of Adam's vicegerency on earth by Allah's explicit precise covenant; his honoring over angels; the command and forgetfulness, regret and repentance, guidance and forgiveness; and equipping him with the first experience in the long struggle on earth, between forces of evil, corruption, and destruction represented by Iblis, and forces of good, righteousness, and construction represented by man holding fast to faith. The context proceeded with all this in the Surah. Then He followed it with this round with the Children of Israel, mentioning Allah's covenant with them and their breaking of it; His favor upon them and their denial of it; and arranging upon this their deprivation of vicegerency, prescribing humiliation upon them, and warning the believers of their plot as He warned them of their slippages. So there was an apparent connection between the story of Adam's vicegerency and the story of the Children of Israel's vicegerency, and a clear consistency in context and performance. This is all alongside the broad claim that they alone are guided; that Allah is pleased only with them, and that all religions are false and all nations astray except them! Which the Quran invalidates in this round, establishing that everyone who believes in Allah and the Last Day and does righteous deeds from all religions, they have their reward with their Lord and no fear will be concerning them, nor will they grieve...\" (1)",
    "foot_note": "1. (1) - Same Reference 1 / 65..",
    "book_id": "943",
    "new_page_number": 50
  },
  {
    "serial_number": "1135347",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "He also says: \"Reviewing the places where the story of the Children of Israel occurred here and there shows that it agrees with the context in which it was presented, complementing its goals and directives... It is here consistent with the context before it. The context of honoring man, the covenant to him, and forgetfulness. Including indications of the unity of humanity, unity of Allah's religion revealed to it, unity of His messages, with glances and touches on the human soul and its constituents, and the consequences of deviating from these constituents to which man's vicegerency on earth was attached; whoever disbelieves in them disbelieves in his humanity, loses the reasons for his vicegerency, and relapses into the animal world. The story of the Children of Israel is the most frequent story in the Holy Quran; care in presenting its situations and lesson is apparent, suggesting Allah's wisdom in treating the affair of this Muslim Ummah, raising it, and preparing it for the Great Vicegerency...\" (1)",
    "foot_note": "1. (1) - Same Reference",
    "book_id": "943",
    "new_page_number": 51
  },
  {
    "serial_number": "1135348",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "Furthermore, Imam Abu Hayyan al-Andalusi has good words clarifying the consistency of the discussion about the Children of Israel with what preceded it, where he says, may Allah have mercy on him: \"His saying Almighty (O Children of Israel, remember My favor) etc. verses: This is the opening of speech with the Jews and Christians. The appropriateness of speaking to them here is apparent. That is because this Surah opened by mentioning the disbelievers stamped with misery, mentioning the hypocrites and mentioning sentences of their conditions, then commanded people entirely to worship Allah Almighty, then mentioned the inimitability of the Quran to other things He mentioned. Then He alerted them by mentioning their origin Adam and what happened to him of eating from the tree after the prohibition from it and that the motive for him to do that was Iblis. These two groups, meaning the Jews and Christians, were People of the Book showing following of messengers and imitating what came from Allah Almighty. Their mention was included generally in His saying (O mankind, worship) etc. the verse. So He singled out their mention here specifically since speech with polytheists and hypocrites had passed, and speech with Jews and Christians remained. So He spoke to them here and mentioned what requires them to believe in this Book as they believed in their previous books. Speech with them suited the story of Adam peace be upon him because after they were given clear explanation and evident proof mentioned in the Torah and Gospel regarding fulfilling the covenant and believing in the Quran, a contrary (behavior) appeared from them by their disbelief in the Quran and the one who came with it.\" (1)\n\n**Correlation between the Discussion of the Children of Israel and Surah Al-Fatiha:**\nWhen He, Glory be to Him, informed in Surah Al-Fatiha about His exclusive entitlement to praise due to what He Almighty is described with of attributes of Majesty and qualities of Perfection - for He is the Praised One and continues to be for the favors He showed and generosity He extended - He clarified in Surah Al-Baqarah a side of His favors Almighty, which includes His favor upon the Children of Israel, His mercy upon them, reminding them of the Day of Judgment, and inviting them to worship Him and seek help from Him alone.",
    "foot_note": "1. (1) - Al-Bahr al-Muhit 1/ 173..",
    "book_id": "943",
    "new_page_number": 52
  },
  {
    "serial_number": "1135349",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "Since the supplication of the believers was for guidance to the straight path, the path of those upon whom Allah has bestowed favor, not of those who have evoked [His] anger - who are the Jews - nor of those who are astray - who are the Christians, Surah Al-Baqarah dealt with the Jews in some detail, just as Surah Al-Imran spoke about the Christians, and talk about both groups appeared in Surahs Al-Nisa and Al-Ma'idah. This is of the chapter of detailing after summarizing. Thus the connection becomes clear to us between Surah Al-Fatiha which falls in the arrangement of the Mushaf before Surah Al-Baqarah.\n\n**Correlation of the Discussion of the Children of Israel with the Title of the Surah:**\nA clear correlation. The story of the Cow is one of the greatest evidences and clearest examples indicating the nature of the Children of Israel, where sterile argument, obstinacy, questioning divine commands, mocking prophets, and making things difficult for themselves, in addition to their concealment of truth and hardness of heart despite the succession of facts and arrival of softening signs. Also, the noble Surah revealed to us the secrets and hidden things of the Jews; it ripped open (baqarat) these facts which time had folded and Jews sought to hide with their propaganda methods based on clothing truth with falsehood and concealing truth. From here appears to us the connection between the title of the Surah and the talk about the ill intention, malicious inner self, and corruption of the Jews' natures as mentioned in this noble Surah (1).\n\n**Correlation between the Introduction of the Surah and the Discussion of the Children of Israel:**\n* Since the noble Surah opened by talking about the Quran as a book of guidance {Alif, Lam, Meem {1} This is the Book about which there is no doubt, a guidance for those conscious of Allah {2}}, talk came about an aspect of that guidance which is His informing about previous nations to take lessons and sermons from their conditions, inviting them to follow the path of guidance, warning the pious of their plots, enlightening them about their natures, and warning them against following their ways.",
    "foot_note": "1. (1) - Baqara al-shay': He split it open and brought out what was in it. From it is the saying of the Bedouin when the wolf hamstrung his sheep: *You ripped open my little sheep and pained my heart... while you were a foster child to our sheep*..",
    "book_id": "943",
    "new_page_number": 53
  },
  {
    "serial_number": "1135350",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "* Also, when He Almighty mentioned in the beginning of the Surah the stance of the pious towards Quranic guidance and their attributes of faith, Allah Almighty invited the Children of Israel to join this group and walk on its path. He Glory be to Him invited them to remember His favors, fulfill His covenant, fear Him, believe in what was revealed to the Seal of His Messengers, peace be upon him, fear Him Almighty with true piety, establish prayer, and give zakah. He Almighty said {Alif, Lam, Meem {1} This is the Book about which there is no doubt, a guidance for those conscious of Allah {2} Who believe in the unseen, establish prayer, and spend out of what We have provided for them, {3} And who believe in what has been revealed to you, [O Muhammad], and what was revealed before you, and of the Hereafter they are certain [in faith]. {4} Those are upon [right] guidance from their Lord, and it is those who are the successful. {5}}. And He Glory be to Him said {O Children of Israel, remember My favor which I have bestowed upon you and fulfill My covenant upon you that I will fulfill your covenant from Me, and be afraid of [only] Me {40} And believe in what I have sent down confirming that which is [already] with you, and be not the first to disbelieve in it. And do not exchange My signs for a small price, and fear [only] Me. {41} And do not mix the truth with falsehood or conceal the truth while you know [it]. {42} And establish prayer and give zakah and bow with those who bow [in worship and obedience]. {43}}.\nWhen He mentioned among the attributes of the pious belief in what was revealed to the Seal of Prophets and what was revealed before him to his brothers of prophets and messengers, it suited that to talk about some prophets and nations. So the Surah talked about Adam peace be upon him as it talked about the Children of Israel, and invited them to believe in what was revealed to the Messenger of Allah peace be upon him and what was revealed to the prophets who preceded him...",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 54
  },
  {
    "serial_number": "1135351",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "He Almighty mentioned in the opening of the Surah the stance of the disbelievers and hypocrites towards the Holy Quran. In this is a preparation for the discussion of the Children of Israel and warning them against following the path of disbelief and hypocrisy.\n\n**Correlation between the First Call in the Surah and the Call Directed to the Children of Israel:**\nWhen the first call in this noble Surah came in a general form directed to all people inviting to the worship of Allah alone and reminding of His favors Almighty upon them, He Almighty said {O mankind, worship your Lord, who created you and those before you, that you may become righteous {21} [He] who made for you the earth a bed [spread out] and the sky a ceiling and sent down from the sky, rain and brought forth thereby fruits as provision for you. So do not attribute to Allah equals while you know [that there is nothing similar to Him]. {22} And if you are in doubt about what We have sent down upon Our Servant [Muhammad], then produce a surah the like thereof and call upon your witnesses other than Allah, if you should be truthful. {23} But if you do not - and you will never be able to - then fear the Fire, whose fuel is men and stones, prepared for the disbelievers. {24}}:\nThe first call came with a general invitation directed to all people to worship Allah Almighty, for He alone is deserving of worship, and worship is the path to piety. The Quran is the greatest sign with which Allah challenged all people, so there is no way to produce a Surah like it. There is no doubt in its being revealed from Allah nor doubt in what it contained of wisdom, rulings, stories, and parables.\nThe second call came directed to a specific group, the Children of Israel, reminding of His favors Almighty upon them and inviting them to believe in the Seal Prophet peace be upon him. So the first call came directed to all people and the second call came directed to a specific group, and this is mentioning the specific after the general...",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 55
  },
  {
    "serial_number": "1135352",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "Ibn Juzayy al-Kalbi said in his Tafsir: \"When He presented the invitation to people generally and mentioned their beginning: He invited the Children of Israel specifically, who are the Jews. The speech continued with them from here to the Hizb 'The foolish will say'. Sometimes He invites them with kindness and mentioning the favor upon them and their fathers, and sometimes with intimidation.\" (1)\nAlso, when the noble Surah talked about the Holy Quran in terms of its inimitability, it suited that to talk about some aspects of inimitability, including Quranic stories. So the story of Adam was mentioned, and after it the story of the Children of Israel.\nImam Al-Baydawi said: \"Know that when He, Glory be to Him and Exalted, mentioned the proofs of Monotheism, Prophethood, and the Hereafter, and followed it by enumerating general blessings as affirmation and confirmation - for they, as precise occurrences, indicate a Wise Originator who has Creation and Command alone with no partner; and as reporting them according to what is established in previous books from one who did not learn them nor practice anything of them is informing of the unseen, miraculous, indicating the prophethood of the one informing about them; and as containing the creation of man and his origin and what is greater than that, indicate that He is capable of return (resurrection) just as He was capable of initiation - He addressed the people of knowledge and scripture among them and commanded them to remember Allah Almighty's favors upon them and fulfill His covenant in following the truth and pursuing arguments to be the first to believe in Muhammad, peace be upon him, and what was revealed to him. So He said {O Children of Israel}.\" (2)\n\n**Correlation between the Story of Adam and the Story of the Children of Israel:**",
    "foot_note": "1. (1) - Tafsir Ibn Juzayy 1/ 25 \n2. - Tafsir Al-Baydawi p: 307..",
    "book_id": "943",
    "new_page_number": 56
  },
  {
    "serial_number": "1135353",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "It was appropriate that the invitation of the Children of Israel, who are People of the Book and knowledge - before the invitation to believe in the Seal Prophet is directed to them, that this be preceded by - presenting a set of shining proofs and evidences paving the way to invite them, being People of the Book, to believe in this Seal Prophet. In the previous verses, it was established that the Holy Quran is a miraculous book with which Allah challenges all people, and that it is a book of guidance to the path of success and happiness in both abodes, and that it included the invitation to worship Allah alone, populate the universe, and work for the Hereafter, and that it contained the decisive word, profound wisdom, and clear truth in the stories of the predecessors. Among that is the verses' talk about the story of Adam peace be upon him, which is considered a shining proof that the Quran is from Allah; for how could Muhammad, if the Quran were from him, know this story which is only known through divine revelation? From here, these arguments, proofs, and facts which only appeared in the Holy Quran, among which was the talk about Adam peace be upon him, preceded the invitation of the Children of Israel to believe in the Seal Prophet.\nWhen He Almighty mentioned His favors upon our father Adam peace be upon him, where He chose him, honored him, and dwelt him in Paradise with his wife Eve, but he was not safe from Satan's whispering and disobeyed Allah Almighty by eating from the forbidden tree, then repented and Allah accepted his repentance and he was expelled from Paradise for one sin: He mentioned Almighty His favors upon the Children of Israel; where He chose them, guided them, and saved them from Pharaoh and his soldiers, but they exchanged Allah's favor for disbelief and exchanged what is better for what is lower, and were insolent about the command of their Lord and persisted in rebellion and disobedience...",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 57
  },
  {
    "serial_number": "1135354",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "Imam Al-Nisaburi said in his Tafsir: \"When He Almighty established the proofs of Monotheism, Prophethood, and the Hereafter, then mentioned general favors to mankind, among which is the creation of Adam to the end of his story, He followed it with special favors upon the ancestors of the Jews to soften their obstinacy, win over their hearts, and alert to the prophethood of Muhammad peace be upon him; in terms of being news of the unseen included in the folds of that which guides them to the principles of religions and noble morals.\" (1).\nIf Adam peace be upon him was expelled from Paradise for one sin, what about them having surrendered their rein to Satan and followed desire yet they covet the Gardens? And he spoke truth who said:\n*O looker gazing with the eyes of a sleeper... And witnessing the matter not as a witness.*\n*Sins connect to sins and you hope... for the degrees of gardens by them and the success of the worshiper.*\n*Did you forget that Allah expelled Adam from it... to the world for a single sin.*\nImam Al-Alusi said: \"'O Children of Israel, remember My favor which I have bestowed upon you' is an address to a specific group of disbelievers contemporary to the Prophet, peace and blessings be upon him, after the general address. He Glory be to Him placed it after the story of Adam because these people, after being given clear explanation and evident proof, and commanded, forbidden, and incited to follow the Unlettered Prophet whom they find written with them, the opposite appeared from them. So they exited the high paradise of faith and descended to the land of nature. Words were presented to them but they did not receive them with acceptance, so they missed what they missed. He turned to them calling to move them to listen to what comes of commands and prohibitions.\" (2)\nFrom the foregoing, it becomes clear to us: That the discussion about the Children of Israel is one of the main axes and basic objectives of this noble Surah which was revealed after Hijra accompanying the building of the Islamic state, supporting it, fortifying it from the plots of enemies, laying the foundations of dealing with non-Muslims, and clarifying the optimal method in dialogue with them alongside inviting them.",
    "foot_note": "1. (1) 2 - Ghara'ib al-Quran wa Ragha'ib al-Furqan by Al-Nisaburi 1 / 293 \n2. 3 - Ruh al-Ma'ani 1 / 241..",
    "book_id": "943",
    "new_page_number": 58
  },
  {
    "serial_number": "1135355",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "The discussion about the Children of Israel is appropriate to the introduction of the Surah; and its basic objectives which are building the Muslim society and fortifying it, and stating the foundations of relationship with the new society in Medina which includes various factions including the Jews. What preceded the discussion about the Children of Israel is but a preparation for it and a paving, where arguments and proofs preceded the invitation of the Children of Israel to believe in the Prophet Muhammad peace be upon him. Also, the correlation is clear between the general call mentioned in the Surah and the special call directed to the Children of Israel, as a way of mentioning the specific after the general to care for and draw attention to that specific. The correlation between the story of Adam peace be upon him and the story of the Children of Israel is multifaceted as previously mentioned. Both stories are full of lessons and sermons, rich in facts indicating that this Quran is from the Knower of the Unseen who knows what was and what will be, knows what is before us and what is behind us. The Children of Israel are the most in need of taking lesson from the story of our father Adam peace be upon him who left Paradise for one sin, tasted the bitterness of disobedience, saw its effect, and endured its consequences, despite Allah's prior choosing and honoring of him. Will the Jews take lesson? Or will they fall into Satan's traps and snares? In which party will they be and with which team will they stand? {We said, \"Go down from it, all of you. And when guidance comes to you from Me, whoever follows My guidance - there will be no fear concerning them, nor will they grieve. {38} And those who disbelieve and deny Our signs - those will be companions of the Fire; they will abide therein eternally.\" {39}}\nHere I should point out that the Surah from its beginning is a general address including all people including the Children of Israel, but the address directed to them and specific to them began from verse forty of the Surah.",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 59
  },
  {
    "serial_number": "1135356",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "**The Fourth Requirement: His Inclusion of Many Munasabat (Correlations) in His Tafsir!**\n\nWhoever contemplates Al-Shawkani's Tafsir finds that he has included numerous correlations in his Tafsir, contrary to his prior opinion on Munasabat. This opinion with which he prefaced his Tafsir is opposition and denial of those who undertook it and cared for it like Al-Biqa'i, Al-Haralli, Al-Razi (1) and others. Below we mention these faces contained in his Tafsir. We say, and success is from Allah:\n\n**Explanatory Resumption (Al-Istin'af al-Bayani):**\nResumption: is bringing after complete speech a saying understood as an answer to an implied question (2).\nAn example of that is His saying Almighty in Surah Al-Baqarah {{Alif, Lam, Meem {1} This is the Book about which there is no doubt, a guidance for those conscious of Allah {2} Who believe in the unseen, establish prayer, and spend out of what We have provided for them, {3} And who believe in what has been revealed to you, [O Muhammad], and what was revealed before you, and of the Hereafter they are certain [in faith]. {4} Those are upon [right] guidance from their Lord, and it is those who are the successful. {5}}.\nSo His saying Almighty {Those are upon [right] guidance from their Lord, and it is those who are the successful. {5}}.\n* As Al-Shawkani said in his Tafsir: [Speech resumed as explanatory resumption, as if it was said: What is the state of those combining piety, belief in the unseen, performing obligatory duties, and belief in what was revealed to the Messenger of Allah, peace be upon him and his family, and to those before him of prophets, peace be upon them? So it was said: Those are upon guidance. It can also be news about those who believe in the unseen etc., so it would be connected to what is before it.] (3)",
    "foot_note": "1. (1) - I wrote biographies for the first and last in my book \"Women in Quranic Stories\" and translated for Al-Haralli in my book \"Tafsir Ayat al-Kursi\" p. 27 \n2. - Al-Mu'jam al-Mufassal fi 'Ulum al-Balagha compiled by Dr. In'am Akkawi p. 66 \n3. - Fath al-Qadir 1 / 37 ..",
    "book_id": "943",
    "new_page_number": 60
  },
  {
    "serial_number": "1135357",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "And His saying Almighty in Surah Al-Imran following the discussion about the Battle of Uhud: {And never think of those who have been killed in the cause of Allah as dead. Rather, they are alive with their Lord, receiving provision, {169} Rejoicing in what Allah has bestowed upon them of His bounty, and they receive good tidings about those [to be martyred] after them who have not yet joined them - that there will be no fear concerning them, nor will they grieve. {170} They receive good tidings of favor from Allah and bounty and [of the fact] that Allah does not allow the reward of believers to be lost. {171}}",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 61
  },
  {
    "serial_number": "1135358",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "* Al-Shawkani said in his Tafsir: [When Allah Glory be to Him clarified that what happened to the believers on the Day of Uhud was a test to distinguish the believer from the hypocrite and the liar from the truthful, He clarified here that whoever was not defeated and was killed has this honor and blessing, and that such is what competitors compete for, not what is feared and warned against as said by those about whom Allah reported (1) \"If they had been with us, they would not have died and would not have been killed\" (2) and said \"If they had obeyed us, they would not have been killed\" (3). So this sentence is resumed to clarify this meaning] (4).",
    "foot_note": "1. (1) - Expression with \"reported\" (haka) does not befit the speech of the Creator Almighty. Rather we say for example: as Allah informed about them or as He Almighty clarified \n2. - Allah said in Surah Al-Imran {O you who have believed, do not be like those who disbelieved and said about their brothers when they traveled through the land or went out to fight, \"If they had been with us, they would not have died or been killed,\" so Allah makes that [misconception] a regret within their hearts. And it is Allah who gives life and causes death, and Allah is Seeing of what you do. {156} And if you are killed in the cause of Allah or die - then forgiveness from Allah and mercy are better than whatever they accumulate. {157}} \n3. - Allah said in Surah Al-Imran {And that He might make evident those who schemed hypocrisy. And it was said to them, \"Come, fight in the way of Allah or [at least] defend.\" They said, \"If we knew [there would be] fighting, we would have followed you.\" They were nearer to disbelief that day than to faith, saying with their mouths what was not in their hearts. And Allah is most knowing of what they conceal. {167} Those who said about their brothers while sitting [at home], \"If they had obeyed us, they would not have been killed.\" Say, \"Then prevent death from yourselves, if you should be truthful.\" {168} \n4. - Same Reference 1 / 398 and see also what he mentioned in his Tafsir 2/ 437..",
    "book_id": "943",
    "new_page_number": 62
  },
  {
    "serial_number": "1135359",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "**Confirming Resumption (Al-Istin'af al-Taqriri):**\nAn example of that is His saying Almighty in Surah Al-Ma'idah {You will surely find the most intense of the people in animosity toward the believers [to be] the Jews and those who associate others with Allah; and you will find the nearest of them in affection to the believers those who say, \"We are Christians.\" That is because among them are priests and monks and because they are not arrogant. {82}}\nAl-Shawkani said: [His saying {You will surely find} etc. is a resumed sentence confirming what is before it of enumerating the evils of the Jews and their faults] (1), which is by clarifying the intensity of their enmity to Muslims.\nAnd in his interpretation of His saying Almighty from Surah Al-Nur {Allah is the Light of the heavens and the earth} [Verse 35 of Surah Al-Nur], the Sheikh clarifies the face of connection between this verse and the verses preceding it, saying: [When Glory be to Him clarified the rulings He clarified, He followed that with His being, Glory be to Him, in the utmost perfection. This sentence is resumed to confirm what is before it] (2). Meaning to confirm those previous rulings and clarify that they issued from the Possessor of Perfection and Majesty.\n\n**Diversity in Speech and Moving from One Style to Another:**\nIt has been said: *The soul is not set right if it is diverted... except by moving from state to state.*\nIn the variety of styles is confirmation of arguments and proofs, establishment of creed and rulings, strengthening of souls and consoling them, and renewing their activity and turning to the Book of Allah Almighty.\n* Al-Shawkani said explaining the secret of citing the story of Noah, peace be upon him, in Surah Hud:",
    "foot_note": "1. (1) - Same Reference 2 /67 \n2. - Same 4 / 33..",
    "book_id": "943",
    "new_page_number": 63
  },
  {
    "serial_number": "1135360",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "[When Glory be to Him presented to the disbelievers contemporary to Muhammad, peace be upon him and his family, types of evidences which are clearer than the sun, He confirmed that by mentioning stories in the manner of diversity in speech and moving it from one style to another so that the sermon be more apparent, the argument clearer, and acceptance more complete. He said {{And We had certainly sent Noah to his people, [saying], \"Indeed, I am to you a clear warner {25} That you not worship except Allah. Indeed, I fear for you the punishment of a painful day. {26}} [Surah Hud]] 0 (1)\n\n**Antithesis (Al-Tadadd):**\nIt is combining a meaning and its opposite. It is one of the rhetorical styles, like combining encouragement and intimidation, talking about disbelievers after talking about believers, and talking about Paradise after talking about Hell, and so on. It has been said:\n*And by its opposite, things become clear*\n*Two opposites when they gather are good... And the opposite shows its goodness by the opposite*\nIn Al-Shawkani's Tafsir, there are numerous examples where he highlighted this linking face between many verses. Below we mention examples from his Tafsir indicating that:\n* In his interpretation of His saying Almighty from Surah Al-Baqarah ({Indeed, those who disbelieve - it is all the same for them whether you warn them or do not warn them - they will not believe. {6} Allah has set a seal upon their hearts and upon their hearing, and over their vision is a veil. And for them is a great punishment. {7}}), Al-Shawkani says: [Glory be to Him mentioned the party of evil after mentioning the party of good, cutting this speech from the first speech, titling it with what indicates that the nature of the disbeliever type is that warning is futile for them and that what is required of them of faith does not result from it, and that the existence of that (warning) is like its non-existence.] 0 (2)",
    "foot_note": "1. (1) - Same Reference 2 / 493 \n2. - Same Reference 1/38",
    "book_id": "943",
    "new_page_number": 64
  },
  {
    "serial_number": "1135361",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "* And in his interpretation of His saying Almighty {And of the people are some who say, \"We believe in Allah and the Last Day,\" but they are not believers. {8} They [think to] deceive Allah and those who believe, but they deceive not except themselves and perceive [it] not. {9}} etc. verses that talked about the faction of hypocrites: Al-Shawkani says in highlighting the connection between it and its predecessor: [Glory be to Him mentioned in the beginning of this Surah the pure believers, then mentioned after them the pure disbelievers, then mentioned thirdly the hypocrites, who were not of one of the two factions but became a third sect because they agreed outwardly with the first faction and inwardly with the second faction, yet they are the people of the lowest depth of the Fire.] 0 (1)\n* And in his interpretation of His saying Almighty from Surah Al-Baqarah {And give good tidings to those who believe and do righteous deeds that they will have gardens beneath which rivers flow. Whenever they are provided with a provision of fruit from there, they will say, \"This is what we were provided with before.\" And it is given to them in likeness. And they will have therein purified spouses, and they will abide therein eternally. {25}}, Al-Shawkani said: [When Almighty mentioned the reward of the disbelievers, He followed it with the reward of the believers to combine encouragement and intimidation, promise and threat, as is His habit Glory be to Him in His Noble Book, for what is in that of invigorating His believing servants and discouraging His disbelieving servants from His disobedience.] (2)",
    "foot_note": "1. (1) - Same 1/ 40 \n2. 0 - Same 1 / 54..",
    "book_id": "943",
    "new_page_number": 65
  },
  {
    "serial_number": "1135362",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "* And in his interpretation of His saying Almighty in Surah Al-Ra'd {For each one are successive [angels] before and behind him who protect him by the decree of Allah. Indeed, Allah will not change the condition of a people until they change what is in themselves. And when Allah intends for a people ill, there is no repelling it. And there is not for them besides Him any patron. {11} It is He who shows you lightening, [causing] fear and hope, and generates the heavy clouds. {12} And the thunder exalts [Allah] with praise of Him - and the angels [as well] from fear of Him - and He sends thunderbolts and strikes therewith whom He wills while they dispute about Allah; and He is severe in assault. {13}}, Al-Shawkani says: [When Glory be to Him frightened His servants with sending down what cannot be repelled, He followed it with matters that are hoped for from some aspects and feared from some, which are lightning, clouds, thunder, and thunderbolt.] (1)\n\n**Appending Results to Premises:**\nAmong the faces of connection found in the Tafsir of Fath al-Qadir, for example, is what he mentioned in the interpretation of Allah's saying {Do they not look at what Allah has created - [how] their shadows incline to the right and to the left, prostrating to Allah, while they are humble? {48} And to Allah prostrates whatever is in the heavens and whatever is on the earth of living creatures, and the angels, and they are not arrogant. {49} They fear their Lord above them, and they do what they are commanded. {50} And Allah has said, \"Do not take for yourselves two deities. He is but one God, so fear only Me.\" {51}} [Surah Al-Nahl].",
    "foot_note": "1. (1) 1 - Same Reference 3 / 72..",
    "book_id": "943",
    "new_page_number": 66
  },
  {
    "serial_number": "1135363",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "[When Glory be to Him clarified that His heavenly and earthly creatures are compliant to Him, submissive to His majesty, He followed that with the prohibition of Shirk by His saying {And Allah has said, \"Do not take for yourselves two deities. He is but one God\"}. So He Glory be to Him forbade taking two deities, then affirmed that divinity is exclusive to one God, who is Allah Glory be to Him.] (1)\n\n**Mentioning the Specific after the General:**\nOf that is what he mentioned in the interpretation of His saying Almighty from Surah Al-Nahl {And fulfill the covenant of Allah when you have taken it} He said: \"Glory be to Him singled out from among the commands contained in His saying {Indeed, Allah orders justice and good conduct...} the fulfillment of covenant, so He said {And fulfill the covenant of Allah when you have taken it}.\" (2)\n\n**Arrangement of the Surah's Subjects:**\nWhoever reflects on the Quranic Surahs finds for each Surah its thematic unity through the interconnection of its sections, the proportionality of its verses, and the sequence of its subjects which, although numerous and diverse, revolve around one subject and aim at one purpose. Al-Shawkani pointed to this in his Tafsir, saying in the interpretation of Surah Al-Furqan explaining the secret of the arrangement of its subjects: \"Glory be to Him spoke in this Surah on Monotheism because it is oldest and most important, then on Prophethood because it is the medium, then on the Hereafter because it is the conclusion.\" Thus the subjects of the Surah came arranged and sequential, all revolving around establishing the Islamic Creed with its three aspects: Divinities, Prophethoods, and Unseen Matters.\n\n**Mentioning What Follows a Legal Ruling of Rulings Attached to it:**\nAn example of that is what Al-Shawkani mentioned in the interpretation of His saying Almighty {Mothers may breastfeed their children two complete years for whoever wishes to complete the nursing [period]. Upon the father is the mothers' provision and their clothing according to what is acceptable...} to the end of verse {233} of Surah Al-Baqarah}. He said: [When Allah Glory be to Him mentioned marriage and divorce, He mentioned breastfeeding because the spouses might separate while having a child between them. That is why it was said this is specific to divorced women, and it was said it is general.] (3)\n\n*****",
    "foot_note": "1. (1) 2 - Same Reference 3 / 168 \n2. 6 - Same 3 /190 \n3. 7 - Same 1 /244..",
    "book_id": "943",
    "new_page_number": 67
  },
  {
    "serial_number": "1135364",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "**Drawing Parallels (Al-Tanzir):**\nIt is attaching the analogue to the analogue and clarifying the link between them:\n* In Al-Shawkani's Tafsir, there are numerous examples of this. Among them is what he mentioned in highlighting the face of connection between the story of the two sons of Adam and what preceded it of the discussion about the Children of Israel. He Almighty said: {And recite to them the story of Adam's two sons, in truth, when they both offered a sacrifice [to Allah], and it was accepted from one of them but was not accepted from the other. Said [the latter], \"I will surely kill you.\" Said [the former], \"Indeed, Allah only accepts from the righteous [who fear Him].\" {27}} etc. verses mentioned in Surah Al-Ma'idah.\nAl-Shawkani says: [The face of connecting this to what is before it is alerting from Allah that the injustice of the Jews and their breaking of covenants and pacts is like the injustice of the son of Adam to his brother; for the disease is old and the evil is deep-rooted.] (1)\n* Also among that is what he cited in clarifying the face of connection between His saying Almighty in Surah Al-Anfal {[It is] just as when your Lord brought you out of your home [for the battle of Badr] in truth, while indeed, a party among the believers were unwilling, {5} Arguing with you concerning the truth after it had become clear, as if they were being driven toward death while they were looking on. {6}} and what is before it:",
    "foot_note": "1. (1) 8- Same 2/30..",
    "book_id": "943",
    "new_page_number": 68
  },
  {
    "serial_number": "1135365",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "He says, may Allah have mercy on him: [His saying {Just as when your Lord brought you out of your home in truth}, meaning: The spoils are established for you just as your Lord brought you out of your home in truth, i.e., like the bringing out of your Lord. The meaning is: proceed with your command regarding spoils and give extra (Nafl) to whomever you wish even if they dislike it, because some of the Companions said to the Messenger of Allah, peace be upon him and his family, when he gave something to everyone who brought a prisoner: 'Most people remained without anything.' So the position of Kaf is accusative (Nasb) as we mentioned, and Al-Farra' said this. Abu Ubaida said it is an oath, meaning: 'By the One Who brought you out,' so the Kaf has the meaning of Waw and Ma has the meaning of Alladhi (The One Who). Al-Akhfash Sa'id bin Mas'ada said the meaning is: {Those are the believers, truly} just as your Lord brought you out. Ikrimah said the meaning is: 'Obey Allah and His Messenger just as your Lord brought you out.' It was said 'Just as He brought you out' is related to His saying 'For them are degrees,' meaning this promise to the believers is true in the Hereafter just as your Lord brought you out of your home with the truth obligated to Him, so He fulfilled your promise and gave you victory over your enemy and fulfilled for you. Al-Nahhas mentioned this and chose it. It was said the Kaf in Kama is the Kaf of similitude by way of recompense, like the saying of a speaker to his slave: 'Just as I sent you to my enemies and they deemed you weak and you asked for help so I helped you and strengthened you and removed your ailment, so take them now and punish them.' It was said the Kaf is in the position of nominative (Raf') as the predicate of an omitted subject, the estimation being: 'This state is like the state of your bringing out,' meaning that their state in disliking what you saw regarding giving extra to the warriors is like their state in disliking your exit for war. The author of Al-Kashshaf mentioned this. 'In truth' is related to an omitted word, the estimation being: 'An exit clothed in truth in which there is no doubt.' The sentence 'while indeed, a party among the believers were unwilling' is in the position of accusative as circumstantial (Hal), meaning: Just as He brought you out in the state of their dislike for that. Because when Allah promised them one of the two parties, either the caravan or the band (army), they desired the caravan for what was in it of spoil and safety from fighting, as will be explained. The sentence 'Arguing with you concerning the truth after it had become clear' is either in the position of accusative as a second Hal or resumed as an answer to an implied question. Their arguing was when he called them to one of the two parties, and the caravan was missed, and he ordered them to fight the band, and they did not have much preparation for that. It was hard on them and they said: 'If you had informed us of fighting, we would have prepared and completed the equipment.'] (1)",
    "foot_note": "1. (1) - Same 2 / 287..",
    "book_id": "943",
    "new_page_number": 69
  },
  {
    "serial_number": "1135366",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "* Also from attaching the analogue to the analogue is what he mentioned in his interpretation of Surah Al-Nahl regarding the correlation between verses containing various proofs of the perfection of His power Almighty and the wonder of His craftsmanship, where Glory be to Him used as evidence the wonders of the animal world and the oddities of the plant world, then followed it with the wonder of human creation. He Almighty said {And Allah has sent down rain from the sky and given life thereby to the earth after its lifelessness. Indeed in that is a sign for a people who listen. {65} And indeed, for you in grazing livestock is a lesson. We give you drink from what is in their bellies - between excretion and blood - pure milk, palatable to drinkers. {66} And from the fruits of the palm trees and grapevines you take intoxicant and good provision. Indeed in that is a sign for a people who reason. {67} And your Lord inspired to the bee, \"Take for yourself among the mountains, houses, and among the trees and [in] that which they construct. {68} Then eat from all the fruits and follow the ways of your Lord laid down [for you].\" There emerges from their bellies a drink, varying in colors, in which there is healing for people. Indeed in that is a sign for a people who give thought. {69} And Allah created you; then He will take you in death. And among you is he who is reversed to the most decrepit [old] age so that he will not know, after [having had] knowledge, a thing. Indeed, Allah is Knowing and Competent. {70}}\n* Imam Al-Shawkani said: [When Glory be to Him used as evidence for His existence, perfection of His power, and wonder of His craftsmanship the wonders of the conditions of animals, He wanted to mention using as evidence for the objective the oddities of the conditions of plants, so He said {And Allah has sent down from the sky}].\n* He said, may Allah have mercy on him: [When Glory be to Him mentioned some conditions of animals and what is in them of wonders of dazzling craftsmanship and characteristics of overwhelming power, He followed it with the wonders of human creation and what is in it of lessons, saying {And Allah created you; then He will take you in death}] (1)",
    "foot_note": "1. (1) 20 - Same 3 /153..",
    "book_id": "943",
    "new_page_number": 70
  },
  {
    "serial_number": "1135367",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "* And from observing the analogue is what he mentioned in the interpretation of His saying Almighty {And among the People of the Scripture is he who, if you entrust him with a great amount [of wealth], he will return it to you. And among them is he who, if you entrust him with a [single] silver coin, he will not return it to you unless you are constantly standing over him [demanding it]. That is because they say, \"There is no [blame] upon us regarding the unlearned.\" And they speak untruth about Allah while they know [it]. {75}} [Al-Imran] [This is a commencement in clarifying the betrayal of the Jews in money after clarifying their betrayal in religion.] (1)\n\n**Detailing after Summarizing:**\nThis correlation is one of the most prominent correlations mentioned by Al-Shawkani and most indicative of affirming this science and its necessity for the exegete.\n* Of that is what he mentioned in the interpretation of His saying Almighty {[This is] a surah which We have sent down and made [that within it] obligatory and revealed therein verses of clear evidence that you might remember. {1} The [unmarried] woman or [unmarried] man found guilty of sexual intercourse - lash each one of them with a hundred lashes, and do not be taken by pity for them in the religion of Allah, if you should believe in Allah and the Last Day. And let a group of the believers witness their punishment. {2}} Al-Shawkani said in clarifying the face of connection between the first and second verse [This is a commencement in detailing what was summarized of the clear verses.] (2).",
    "foot_note": "1. (1) 1 - Same 1 /353 \n2. - Same 4 / 2..",
    "book_id": "943",
    "new_page_number": 71
  },
  {
    "serial_number": "1135368",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "* In his interpretation of Surah Al-Isra, he mentions the connection between the divine directives contained in this Surah, starting with His saying Almighty {Do not make [as equal] with Allah another deity and [thereby] become censured and forsaken. {22} And your Lord has decreed that you not worship except Him, and to parents, good treatment. Whether one or both of them reach old age [while] with you, say not to them [so much as], \"uff,\" and do not repel them but speak to them a noble word. {23}} to His saying Almighty {That is from what your Lord has revealed to you, [O Muhammad], of wisdom. And do not make [as equal] with Allah another deity, lest you be thrown into Hell, blamed and banished. {39}}\nImam Al-Shawkani says: [When Glory be to Him summarized the deeds of righteousness in His saying 'And whoever desires the Hereafter and strives for it with the necessary effort while he is a believer' (1), He began detailing that, starting with the most noble of them, which is Monotheism, so He said 'Do not make [as equal] with Allah another deity', and the address is to the Prophet, peace be upon him and his family.] (2)\n\n* In his interpretation of Surah Al-Naml, he clarifies the connection between the introduction of the Surah and the stories contained in it. He mentions that these stories are of the chapter of detailing after summarizing, where those stories came detailing His saying Almighty {And indeed, you are receiving the Qur'an from One, Wise and Knowing. {6}}. Regarding that, he says: [When Glory be to Him finished the story of Moses, He commenced the story of David and his son Solomon. These stories and what is before them and after them are like explanation and confirmation of His saying {And indeed, you are receiving the Qur'an from One, Wise and Knowing}.] (3).",
    "foot_note": "1. (1) - The verse {And whoever desires the Hereafter and strives for it with the necessary effort while he is a believer - those, their effort is ever appreciated {19}} \n2. - Same 3 / 217 \n3. - Same 4 / 129..",
    "book_id": "943",
    "new_page_number": 72
  },
  {
    "serial_number": "1135369",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "The Sheikh links the story of Thamud with the Prophet of Allah Salih, peace be upon him, and the previous story, the story of the Prophet of Allah David and his son Solomon, peace be upon them, saying: [His saying {And We had certainly sent to Thamud...} etc. is conjoined to His saying {And We had certainly given to David and Solomon}, and the Lam is paving for an oath. This story is part of the explanation of His saying {And indeed, you are receiving the Qur'an from One, Wise and Knowing}.] (1).\nIn his interpretation of Surah Al-Ankabut, he highlights the connection between the story of Noah, peace be upon him, and the introduction of the Surah, saying: [Glory be to Him summarized the story of Noah as confirmation of His saying in the beginning of the Surah {And We have certainly tried those before them}. In it is strengthening for the Prophet, peace be upon him and his family, as if it was said to him: Noah stayed a thousand years less fifty calling his people, yet only a few believed in him. So you are more worthy of patience due to the shortness of your stay and the large number of your nation.] (2).\n\n**Preface and Paving:**\nOf that is the preface and paving for stories that are mentioned. Al-Shawkani says in his interpretation of Surah Al-Naml: [Then Glory be to Him paved a beneficial introduction for what He will mention after that of wondrous news, saying {And indeed, you are receiving the Qur'an from One, Wise and Knowing}, meaning it is cast upon you, so you receive it and take it from One of much Wisdom and Knowledge.] (3)\nAnd the preface and paving for legal rulings that are mentioned. Al-Shawkani says in his interpretation of Surah Al-Ahzab: [Then Glory be to Him mentioned a parable as paving and preparation for what follows of Quranic rulings which are from the revelation He commanded to be followed, saying {Allah has not made for a man two hearts in his interior}. There is difference regarding the cause of revelation of this verse as will come. It was said it is a parable Allah struck for the one who pronounces Zihar (comparing wife to mother's back), meaning just as a man cannot have two hearts, likewise the wife of the one pronouncing Zihar is not his mother so that there would be two mothers for him, and likewise the adopted son is not a son of two men. It was said one of the hypocrites used to say: I have a heart ordering me such and a heart such. So the verse was revealed to refute hypocrisy and clarify that it does not combine with Islam just as two hearts do not combine...] (4)",
    "foot_note": "1. (1) - Same 4 / 142 \n2. - Same 4 /196 \n3. - Same 4/126 \n4. - Same 4/ 260..",
    "book_id": "943",
    "new_page_number": 73
  },
  {
    "serial_number": "1135370",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "**Thematic Unity of a Single Verse:**\nThe face of interconnection between the parts of a single verse might not appear clear. Of that is the face of interconnection in His saying Almighty {They ask you, [O Muhammad], about the new moons. Say, \"They are measurements of time for the people and for Hajj.\" And it is not righteousness to enter houses from the back, but righteousness is [in] one who fears Allah. And enter houses from their doors. And fear Allah that you may succeed. {189}}\nIn this case, the matter requires reflection and depth in understanding the noble verse. The question is about new moons, and the answer is: they are measurements of time for people and Hajj. But what is the connection of that to His saying Almighty {And it is not righteousness to enter houses from the back, but righteousness is [in] one who fears Allah. And enter houses from their doors. And fear Allah that you may succeed {189}}?",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 74
  },
  {
    "serial_number": "1135371",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "Al-Shawkani answers this in his Tafsir, saying: [{They ask you about the new moons. Say, \"They are measurements of time for the people and for Hajj\"} In it is clarification of the face of wisdom in the increase and decrease of the crescent moon, and that is for the sake of clarifying the timings by which people time their worships and transactions, such as fasting, breaking fast, Hajj, gestation period, waiting period ('Iddah), leases, oaths, and other things... Glory be to Him singled out Hajj for mention because it is something where knowing the time is needed, and postponing (Nasi') regarding its time is not permissible, and due to the great hardship on one to whom the time of his rituals becomes confused or who misses its time or the time of some of it. Some scholars of rhetoric made this answer, i.e., His saying {Say, \"They are measurements of time\"}, of the wise style (Uslub al-Hakim), which is meeting the addressee with other than what he expects, alerting that it is more worthy of intent. The face of that is that they asked about the bodies of crescent moons regarding their increase and decrease, so they were answered with the wisdom for which that increase and decrease existed, because that is more worthy to be intended by the questioner and more deserving to look for its knowledge. His saying {And it is not righteousness to enter houses from the back}. The face of connection of this to the question about new moons: The Ansar, when they performed Hajj, would not enter from the doors of their houses if one of them returned to his house after his Ihram before completing his Hajj, because they believed that the Muhrim (pilgrim in Ihram) should not have a barrier between him and the sky. They used to scale the backs of their houses. Abu Ubaida said: This is a proverb. The meaning is: Righteousness is not that you ask the ignorant, but righteousness is piety, so ask the scholars, just as you say: I approached this matter from its door. It was said: It is a metaphor for sexual intercourse with women, and that they were commanded to approach them from the front, not the rear. And other things were said.] (1)\n\n**Stating the Evidence for What was Previously Established:**",
    "foot_note": "1. (1) - Same 1 / 198..",
    "book_id": "943",
    "new_page_number": 75
  },
  {
    "serial_number": "1135372",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "Of that is what Al-Shawkani mentioned in the interpretation of His saying Almighty {And your god is one God. There is no deity [worthy of worship] except Him, the Entirely Merciful, the Especially Merciful. {163} Indeed, in the creation of the heavens and earth, and the alternation of the night and the day, and the [great] ships which sail through the sea with that which benefits people, and what Allah has sent down from the heavens of rain, giving life thereby to the earth after its lifelessness and dispersing therein every [kind of] moving creature, and [His] directing of the winds and the clouds controlled between the heaven and the earth are signs for a people who use reason. {164}} [Surah Al-Baqarah]. Al-Shawkani said: [When Glory be to Him mentioned Monotheism by His saying {And your god is one God}, He followed that with the evidence indicating it, which is these matters that are of the greatest craftsmanship of the Wise Maker, with the knowledge of every sane person that it is not possible for any of the gods affirmed by the disbelievers to come with any of them or be capable of it or part of it.] (1)\n\n**Correlation between the Surah and its Predecessor:**\nAl-Shawkani did not care much for this aspect, but in the interpretation of Surah Al-Hajj, he cited a correlation between it and what is before it, saying: \"When the speech in the conclusion of the previous Surah dragged on to the mention of Resurrection and what is before it and after it, Glory be to Him started in this Surah by mentioning the Resurrection and its horrors, urging piety which is the most beneficial provision, so He Almighty said: (O mankind, fear your Lord. Indeed, the convulsion of the [final] Hour is a terrible thing). (2)\nIn the interpretation of Surah Quraysh, he mentioned its connection to its predecessor, i.e., Surah Al-Fil which precedes it in the arrangement of the Mushaf. Surah Al-Fil was revealed after Surah Al-Kafirun, and Surah Quraysh was revealed after Surah Al-Tin.",
    "foot_note": "1. (1) - Same 1/ 182 \n2. - - Same 3 / 435..",
    "book_id": "943",
    "new_page_number": 76
  },
  {
    "serial_number": "1135373",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "Al-Shawkani, may Allah have mercy on him, says: [The Lam in His saying {Li-ilafi} (For the accustomed security): It was said it relates to the end of the Surah before it, as if He Glory be to Him said: I destroyed the companions of the elephant for the coalition of Quraysh. Al-Farra' said: This Surah is connected to the first Surah because Glory be to Him reminded the people of Mecca of His great favor upon them in what He did to the Abyssinians, then He said {For the accustomed security of Quraysh}, meaning We did that to the companions of the elephant as a favor from Us to Quraysh. That is because Quraysh used to go out for their trade and were not raided in Jahiliyyah; people would say they are the people of the House of Allah Almighty. Until the owner of the elephant came to demolish the Kaaba and take its stones to build a house in Yemen for people to make pilgrimage to. So Allah Almighty destroyed them and reminded them of His favor, meaning He did that for the accustomed security of Quraysh, i.e., so they remain accustomed to going out and are not dared against. Ibn Qutayba mentioned something similar. Al-Zajjaj said: The meaning is 'So He made them like eaten straw for the accustomed security of Quraysh', meaning Allah destroyed the companions of the elephant so that Quraysh and what they were accustomed to of the winter and summer journey would remain. In Al-Kashshaf, it is said: The Lam is related to His saying 'So let them worship'; He commanded them to worship Him for the sake of their habit of the two journeys. The Fa' entered because of the meaning of condition in the speech. Al-Khalil bin Ahmad preceded the author of Al-Kashshaf to this saying. The meaning is: If they do not worship Him for His other favors, let them worship Him for this majestic favor. Al-Kisa'i and Al-Akhfash said: The Lam is Lam of wonder, meaning: Wonder at the accustomed security of Quraysh. And it was said it means 'Ila' (to).] (1).\n\n**Appropriateness of Citing the Story:**\nAmong the correlations the Sheikh highlighted sometimes is clarifying the occasion for which the story was driven. Of that is what he mentioned regarding the appropriateness of citing the story of the two sons of Adam, peace be upon him, in Surah Al-Ma'idah in the context of talking about the corruptions and injustice of the Children of Israel: [The face of connecting this to what is before it is alerting from Allah that the injustice of the Jews and their breaking of covenants and pacts is like the injustice of the son of Adam to his brother; for the disease is old and the evil is deep-rooted.] (2)",
    "foot_note": "1. (1) - Fath al-Qadir 5 / 497 \n2. - Same 2 / 30..",
    "book_id": "943",
    "new_page_number": 77
  },
  {
    "serial_number": "1135374",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "Of that also is what he mentioned regarding the secret of citing the story of the wife of Lot and the wife of Noah in Surah Al-Tahrim, where he says, may Allah have mercy on him: [Yahya bin Salam said: Allah struck a parable for those who disbelieved to warn Aisha and Hafsa against opposing the Messenger of Allah, peace be upon him and his family, when they backed each other against him. How excellent is he who said: Mentioning the two wives of the two Prophets after mentioning their story and their backing against the Messenger of Allah, peace be upon him and his family, guides most completely and hints most eloquently that the intended meaning is frightening them along with the rest of the Mothers of the Believers, and clarifying that even if they are under the protection of the best of Allah's creation and the Seal of His Messengers, that does not avail them against Allah at all. Allah protected them from the sin of that backing by the sincere correct repentance that occurred from them.] (1)\n* In his interpretation of Surah Hud, where numerous stories of Prophets were mentioned starting with the story of Noah peace be upon him, Al-Shawkani says: [When Glory be to Him presented to the disbelievers contemporary to Muhammad, peace be upon him and his family, types of evidences which are clearer than the sun, He confirmed that by mentioning stories in the manner of diversity in speech and moving it from one style to another so that the sermon be more apparent, the argument clearer, and acceptance more complete. He said {{And We had certainly sent Noah to his people, [saying], \"Indeed, I am to you a clear warner {25} That you not worship except Allah. Indeed, I fear for you the punishment of a painful day. {26}} (2)\n\n**Linking Story to Story:**\nAmong the faces of correlations highlighted by the Sheikh is linking between story and story. In his interpretation of Surah Saba', he mentions the correlation between the stories of David and Solomon, peace be upon them, and the story of Saba', saying: [When Glory be to Him mentioned the state of some of those grateful for His favors, He followed it with the state of some of those denying them, so He said {There was for [the tribe of] Saba'} (3) ] (4)",
    "foot_note": "1. (1) - Fath al-Qadir 5 / 256 \n2. - Same 2 / 493 \n3. - The verses Surah Saba' from 15 to 20 \n4. - Same 4 / 319..",
    "book_id": "943",
    "new_page_number": 78
  },
  {
    "serial_number": "1135375",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "And in his interpretation of His saying Almighty in Surah Al-Isra {And We gave Moses the Scripture and made it a guidance for the Children of Israel that you not take other than Me as Disposer of affairs {2}}, Al-Shawkani says: [And We gave Moses the Scripture, meaning the Torah. It was said the meaning is: We honored Muhammad with the Ascension (Mi'raj) and We honored Moses with the Scripture. And We made it, meaning that Scripture, and it was said Moses, a guidance for the Children of Israel by which they are guided.] (1)\n\n**Connection of the Story to What is Before It and After It:**\nOf that is what Al-Shawkani mentioned in the interpretation of His saying Almighty from Surah Hud {So do not be in doubt, [O Muhammad], as to what these [polytheists] worship. They worship not except as their fathers worshipped before. And indeed, We will give them their share undiminished. {109}} [When Allah Glory be to Him finished with the stories of the disbelievers and clarifying the state of the happy and the wretched, He consoled His Messenger, peace be upon him and his family, by explaining the states of the disbelievers of his people.] (2)\nAnd in his interpretation of His saying Almighty from Surah Sad {The people of Noah denied before them, and [the tribe of] 'Aad, and Pharaoh, the owner of stakes {12}}, he says: [When Glory be to Him mentioned the states of the disbelievers contemporary to the Messenger of Allah, peace be upon him and his family, He mentioned their likes of those who preceded them and did their deed of disbelief and denial, saying {The people of Noah denied before them, and 'Aad, and Pharaoh, the owner of stakes}] (3)\n\n**Repelling Illusion:**\nThis is by the subsequent coming to repel what might be imagined from the antecedent. Below we mention examples from Fath al-Qadir:",
    "foot_note": "1. (1) - Same 3 / 207 \n2. - Same 2 / 528 \n3. - Same 4 / 423..",
    "book_id": "943",
    "new_page_number": 79
  },
  {
    "serial_number": "1135376",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "* Al-Shawkani says regarding his interpretation of His saying Almighty {And those who are taken in death among you and leave wives determined for themselves four months and ten [days]. And when they have reached their term, then there is no blame upon you for what they do with themselves in an acceptable manner. And Allah is [fully] Acquainted with what you do. {234} [Surah Al-Baqarah 234] [When Glory be to Him mentioned the waiting period of divorce, and connected to its mention the mention of breastfeeding, He followed that by mentioning the waiting period of death so it would not be imagined that the waiting period of death is like the waiting period of divorce.] (1)\n* And regarding his interpretation of His saying Almighty from Surah Al-Nisa {Those who commit unlawful sexual intercourse of your women - bring against them four [witnesses] from among you. And if they testify, confine the guilty women to houses until death takes them or Allah ordains for them [another] way. {15}} [Al-Nisa 15] Al-Shawkani says: [When Glory be to Him mentioned in this Surah kindness to women and delivering their dowries to them and their inheritance with men, He mentioned severity against them in what they commit of immorality so they do not imagine that leaving chastity is permissible for them.] (2)\n\n**Observing the Correlation between the Introduction of the Surah and its Purposes and Content:**\nIn his interpretation of His saying Almighty {Indeed, those who do not expect the meeting with Us and are satisfied with the life of this world and feel secure therein and those who are heedless of Our signs {7} Those - their refuge is the Fire for what they used to earn. {8}} Surah Yunus",
    "foot_note": "1. (1) - Same 1 / 248 \n2. - Same 1 / 437",
    "book_id": "943",
    "new_page_number": 80
  },
  {
    "serial_number": "1135377",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "He says, may Allah have mercy on him: [Allah Glory be to Him commenced explaining the conditions of those who do not believe in the Hereafter and those who believe in it. He presented the faction that did not believe because the speech in this Surah is with the disbelievers who wonder at what has no wonder in it and neglect looking and thinking about what should not be neglected of what is witnessed by every living being throughout his life. So neglecting look and truthful thinking causes lack of belief in the Hereafter.] (1)\n\n**Observing the Context:**\nImam Al-Shawkani may seek help in understanding the meaning, preferring between opinions, or clarifying the ruling from the general context of the verses. In this is indication of his submission to the existence of interconnection and correlation between verses by whose light he is guided.\n*** In his Tafsir are numerous examples indicating his reference to context:\n* In his interpretation of His saying Almighty from Surah Al-Baqarah {And [mention, O Muhammad], when Abraham was tried by his Lord with commands and he fulfilled them. [Allah] said, \"Indeed, I will make you a leader for the people.\" [Abraham] said, \"And of my descendants?\" [Allah] said, \"My covenant does not include the wrongdoers.\" {124} He says: [There is difference regarding the intended meaning of 'covenant'. It was said Imamate (leadership), and it was said Prophethood, and it was said Allah's covenant is His command, and it was said safety from the punishment of the Hereafter, and Al-Zajjaj preferred it. But the first is more apparent as the context benefits.] (2)\n* In his interpretation of His saying Almighty from Surah Al-Baqarah {Those to whom We gave the Scripture know him as they know their own sons. But indeed, a party of them conceal the truth while they know [it]. {146}} He says: [And His saying 'Those to whom We gave the Scripture know him': it was said the pronoun refers to Muhammad, peace be upon him and his family, meaning they know his prophethood. That was narrated from Mujahid, Qatada, and a group of people of knowledge. And it was said they know the shifting of the Qiblah from Bayt al-Maqdis to the Kaaba. A group of exegetes said this. The author of Al-Kashshaf preferred the first. In my opinion, the second is more likely as indicated by the context for which these verses were driven.] (3) Which is the talk about the Qiblah.",
    "foot_note": "1. (1) - Same 2 /426 \n2. - Same 1 / 138 \n3. - Same 1 / 154..",
    "book_id": "943",
    "new_page_number": 81
  },
  {
    "serial_number": "1135378",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "* In his interpretation of His saying Almighty in Surah Al-Ma'idah {Because of that, We decreed upon the Children of Israel that whoever kills a soul unless for a soul or for corruption [done] in the land - it is as if he had slain mankind entirely. And whoever saves one - it is as if he had saved mankind entirely. And our messengers had certainly come to them with clear proofs. Then indeed many of them, [even] after that, throughout the land, were transgressors. {32}} [His saying 'Because of that' means because of that killer and his crime and due to his sin. The meaning is that the story of the two sons of Adam is what caused the mentioned decree upon the Children of Israel. The majority of exegetes are on this. He singled out the Children of Israel for mention because the context is in enumerating their crimes and because they are the first nation upon whom the threat regarding killing souls was revealed, and severity occurred among them then due to their frequent shedding of blood and killing of prophets...] (1)\n* In his interpretation of His saying Almighty from Surah Yunus {Say, \"I possess not for myself any harm or benefit except what Allah should will. For every nation is a [specified] term. When their time has come, then they will not remain behind an hour, nor will they precede [it].\" {49}} He says: [{Say, \"I possess not for myself any harm or benefit\"} Meaning I have no power to bring benefit to it nor repel harm from it, so how can I possess that for others? He prioritized harm because the context is for showing inability.] (2)\n* In his interpretation of His saying Almighty in Surah Al-Shu'ara {Thus have We inserted it into the hearts of the criminals. {200}} He says, may Allah have mercy on him: [({Thus have We inserted it into the hearts of the criminals}) meaning like that insertion We inserted it, i.e., entered it into their hearts, meaning the Quran, until they understood its meanings and knew its eloquence and that it is miraculous. Al-Hasan and others said: We inserted polytheism and denial into the hearts of the criminals. Ikrimah said: We inserted hardness.",
    "foot_note": "1. (1) - Same 3 /33 \n2. - Same 2 / 449..",
    "book_id": "943",
    "new_page_number": 82
  },
  {
    "serial_number": "1135379",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "The first is more likely because the context is regarding the hadith of the Quran (1)] (2)\n* In his interpretation of His saying Almighty in Surah Al-Zukhruf {And they said, \"Why was this Qur'an not sent down upon a great man from [one of] the two cities?\" {31} Do they distribute the mercy of your Lord? We have distributed between them their livelihood in the life of this world, and We have raised some of them above others in degrees [of rank] that they may make use of one another for service. But the mercy of your Lord is better than whatever they accumulate. {32}}",
    "foot_note": "1. (1) - Allah Almighty said {And indeed, it is the revelation of the Lord of the worlds. {192} The Trustworthy Spirit has brought it down {193} Upon your heart, [O Muhammad] - that you may be of the warners - {194} In a clear Arabic language. {195} And indeed, it is in the scriptures of the former peoples. {196} And has it not been a sign to them that it is recognized by the scholars of the Children of Israel? {197} And even if We had revealed it to one among the foreigners {198} And he had recited it to them, they would not have been believers in it. {199} Thus have We inserted it into the hearts of the criminals. {200} \n2. - Same 4 / 118",
    "book_id": "943",
    "new_page_number": 83
  },
  {
    "serial_number": "1135380",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "He says, may Allah have mercy on him: [(Do they distribute the mercy of your Lord?) meaning Prophethood or what is more general than it. The interrogation is for denial. Then He clarified that Glory be to Him is the One who distributed between them what they live by of worldly matters, so He said {We have distributed between them their livelihood in the life of this world} and We did not delegate that to them. No servant has the right to control anything; rather the judgment belongs to Allah alone. If Allah Glory be to Him is the One who distributed their provisions among them and raised some of them above others in degrees, then how can they not be satisfied with His distribution in the matter of Prophethood and delegating it to whom He wills of His creation? Muqatil said: He says: Are the keys of Message in their hands so they place them where they wish? The meaning of 'We have raised some of them above others in degrees' is that He differentiated between them, making some better than others in the world in provision, leadership, strength, freedom, mind, and knowledge. Then He mentioned the cause for raising some of them above others in degrees, saying 'that they may make use of one another for service' (Sukhriyya), meaning so that some of them use others. So the rich uses the poor, the chief the subordinate, the strong the weak, the free the slave, and the intelligent the one below him in intellect, and the scholar the ignorant. This is in the majority of conditions of worldly people. By it their interests are completed, their livelihood is organized, and each of them reaches his desire. For every worldly craft is perfected by some people and not others, so He made some need others to achieve mutual help between them in worldly enjoyment. This one needs that one, this makes for that, and this gives this... It was said it is from Sukhriyya which means mockery (Istihza'), and this, although matching the linguistic meaning, is far from the meaning of the Quran and contrary to what is intended by the context.] (1)",
    "foot_note": "1. (1) - Same 4 / 554..",
    "book_id": "943",
    "new_page_number": 84
  },
  {
    "serial_number": "1135381",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 82,
    "volume_number": 1,
    "text": "* In his interpretation of His saying Almighty in Surah At-Tur {And they will approach one another, inquiring of each other. {25} They will say, \"Indeed, we were previously among our people fearful [of displeasing Allah]. {26} So Allah conferred favor upon us and protected us from the punishment of the Scorching Fire. {27} Indeed, we used to supplicate Him before. Indeed, it is He who is the Beneficent, the Merciful.\" {28}} in the context of talking about the conditions of the people of Paradise: Al-Shawkani says: [And they will approach one another, inquiring of each other, meaning some of them asking others in Paradise about their condition and what they were in of worldly fatigue and fear of the outcome. So they praise Allah who removed from them sadness, fear, and worry, and what they were in of toil and distress in seeking livelihood and obtaining what is necessary of provision. It was said some say to others: 'By what did you reach this high rank?' It was said the questioning is between them at the Resurrection from graves. But the first is more likely due to the indication of the context that they have become in Paradise.] (1)\nIn his interpretation of Surah Al-Rahman, which was driven to clarify numerous favors of Allah Almighty upon the two weighty kinds (Jinn and Mankind), Al-Shawkani explains the aspect of favor in some verses. For the favors of Allah Almighty are apparent and hidden, and hidden favors need contemplation and thought until we realize the aspect of their being favors. Thus the aspects of interconnection between the verses driven to enumerate favors become clear to us:\n* Of that is what he cited regarding the aspect of annihilation being of the favors of the Most Merciful. He Almighty said {Everyone upon it will perish. {26} And there will remain the Face of your Lord, Owner of Majesty and Honor. {27} So which of the favors of your Lord would you deny? {28}}",
    "foot_note": "1. (1) - Same 5 / 98..",
    "book_id": "943",
    "new_page_number": 85
  },
  {
    "serial_number": "1135382",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 83,
    "volume_number": 1,
    "text": "He said in his Tafsir: [{Everyone upon it will perish} meaning everyone on earth of animals is perishing. He made the rational predominant over others, so He expressed all with the word 'Man' (who). It was said He meant whoever is on it of Jinn and Mankind. {And there will remain the Face of your Lord, Owner of Majesty and Honor} The aspect of favor in the annihilation of creation is that death is the cause of transfer to the abode of recompense and reward. Muqatil said the aspect of favor in the annihilation of creation is equality between them in death, and with death, feet become equal.] (1)\n* In his interpretation of His saying Almighty {Whoever is within the heavens and earth asks Him; every day He is in a matter. {29} So which of the favors of your Lord would you deny? {30}}, he explains the aspect of His being Almighty every day in a matter: a favor. He says: [{Every day He is in a matter (Sha'n)} Sha'n is the affair. Among His affairs Glory be to Him is giving the people of heavens and earth what they ask of Him despite the difference in their needs and variance of their purposes. The exegetes said: Of His affair is that He gives life and causes death, provides and impoverishes, honors and humiliates, sickens and heals, gives and withholds, forgives and punishes, to other than that which cannot be counted. It was said the intended meaning by the mentioned day is the day of the world and the day of the Hereafter. {So which of the favors of your Lord would you deny?} For the difference of His affairs Glory be to Him in managing His servants is a favor that cannot be denied, nor is it easy for a denier to deny.] (2)",
    "foot_note": "1. (1) - Same 5 / 136, and see my thesis \"Patience at the Loss of a Child\", Dar al-Salam edition, Cairo. \n2. - Same Reference 5 / 137..",
    "book_id": "943",
    "new_page_number": 86
  },
  {
    "serial_number": "1135383",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 84,
    "volume_number": 1,
    "text": "In his interpretation of His saying Almighty {There will be sent upon you a flame of fire and [burning] copper, and you will not be helped. {35} So which of the favors of your Lord would you deny? {36} And when the heaven is split open and becomes rose-colored like oil - {37} So which of the favors of your Lord would you deny? {38} Then on that Day none will be asked about his sin among men or jinn. {39} So which of the favors of your Lord would you deny? {40}}, he explains the aspect of that threat of severe punishment being a favor. He says: [{So which of the favors of your Lord would you deny?} For among them is what is in this threat and intimidation of good outcome by turning to good and turning away from evil.] 0 (1)\n\nWith these examples we cited from Al-Shawkani's Tafsir, it becomes clear to us that he refers to the general context of verses, seeking help from it to understand the meaning, exclude a weak opinion, prefer between opinions, show wisdom, repel illusion, or stand upon the splendor of order and beauty of arrangement. In this is what indicates the Sheikh's realization of the proportionality between verses and his reliance on it, contrary to what he mentioned in the introduction of his book of denial on those who cared for this science and contributed to it. In this is the most eloquent response to his stance, for his Tafsir is full of it.\n\n**Conclusion**\n**Summary of Research and Results**\n\nThe book \"Fath al-Qadir al-Jami' bayna Fannay al-Riwayah wa al-Dirayah min 'Ilm al-Tafsir\" by Imam Al-Shawkani is one of the masterpieces of Tafsir books and its comprehensive foundations. It included Tafsir by narration as well as Tafsir by knowledge (Tafsir by tradition and Tafsir by opinion).\nAl-Shawkani went in his Tafsir to the view that researching the science of Munasabat is a form of affectation, that there is no benefit from it, and that it is speaking by pure forbidden opinion, and he criticized Al-Biqa'i and others for their attention to this science.",
    "foot_note": "1. (1) Same 5 / 138..",
    "book_id": "943",
    "new_page_number": 87
  },
  {
    "serial_number": "1135384",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 85,
    "volume_number": 1,
    "text": "I have responded to him in this research while discussing the most important issues he raised. I clarified the benefits and fruits of studying the science of Munasabat, this beneficial science through which a face of the faces of the Holy Quran's inimitability becomes clear to us: that is in terms of the correlation of its verses and coordination of its Surahs. The Holy Quran is a single thematic unity, and its verses and Surahs are a single structure like pearls increasing in beauty when strung and not decreasing in value when unstrung. This is in addition to clarifying meanings and their richness, and the clarity of purposes before exegetes who cannot do without it.\nThe Glorious Quran was distinguished by this unique order, this arranged casting, this wondrous variation, this richness in styles, and moving from subject to subject, from wisdom to wisdom, from story to story, and from parable to parable, without that leading to disturbance or defect, lethargy or boredom, contradiction or difference. Rather, consistency and harmony, observing the nature of souls, easing for readers, and providing insight and reminder for those of intellect. This is alongside its piecemeal revelation - according to incidents and occurrences - contrary to what is customary in previous books which were revealed all at once. Thus it combined numerous characteristics not present in previous books: its revelation wholly according to wisdom, its revelation separately according to events and what legislation requires of gradation in rulings, in addition to this wondrous arrangement. A table filled and teeming, gardens lush and fresh, flowering and fruitful, pleasing the looking eyes. Its branches intertwined, its flowers embraced, its birds harmonized, its fruits ripened, its streams mixed, its pearls ordered, and its jewels consistent in a unique necklace and arranged wire.\nThe one looking into Al-Shawkani's Tafsir witnesses in it numerous and diverse examples of correlations between verses, where he highlighted many faces of connection between verses, including:\n* Explanatory Resumption\n* Confirming Resumption\n* Diversity in speech and moving it from one style to another\n* Antithesis: combining a meaning and its opposite, like combining encouragement and intimidation\n* Appending Results to Premises..",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 88
  },
  {
    "serial_number": "1135385",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 86,
    "volume_number": 1,
    "text": "* Mentioning the Specific after the General\n* Arrangement of the Surah's subjects\n* Mentioning what follows a legal ruling of rulings attached to it\n* Drawing Parallels (Al-Tanzir): attaching the analogue to the analogue and clarifying the link between them\n* Detailing after Summarizing\n* Preface and Paving\n* Thematic Unity of a single verse\n* Stating the evidence for what was previously established\n* Appropriateness of citing the story\n* Connection of the story to what is before it and what is after it\n* Linking the story to the story following it\n* Repelling Illusion\n* Observing the correlation between the introduction of the Surah and its purposes and content\n* Observing the Context\nIn this is what indicates the Sheikh's realization of the proportionality between verses and his reliance on it, contrary to what he mentioned in the introduction of his book of denial on those who cared for this science and contributed to it. In this is the most eloquent response to his stance, for his Tafsir is full of it.\nWe support Al-Shawkani in that affectation is forbidden in Tafsir or otherwise, and that it is not permissible to speak by pure forbidden opinion. The science of Munasabat requires reflection and contemplation, not affectation and arbitrariness. It requires a comprehensive holistic view of the verses, reflecting on their meanings and purposes, their connection to the general purpose of the Surah, and their connection to their predecessor and successor, with stating the type of link binding the verses. This science is indispensable for any exegete, because it aids in understanding the meaning, preferring between opinions, knowing the general purposes of verses and Surahs, and other benefits.",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 89
  },
  {
    "serial_number": "1135386",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 87,
    "volume_number": 1,
    "text": "The Holy Quran was revealed piecemeal according to incidents and occurrences, observing gradualism in legislation, keeping pace with the stages the Islamic Da'wah passed through in its Meccan and Madinan eras and what each stage required. It was collected in breasts and lines according to what is in the Preserved Tablet, where Gabriel peace be upon him used to teach the Messenger of Allah peace be upon him the place of every verse in its Surah, in addition to the arrangement of Surahs as will be explained. The Companions may Allah be pleased with them memorized it according to this arrangement, and that was observed in the Uthmani Mushafs. If its revelation piecemeal had wisdoms and benefits that are not hidden, then its collection in this Divinely Appointed arrangement has wisdoms and benefits. And if its revelation piecemeal is a characteristic of its characteristics unique from previous books, then this arrangement is a characteristic of its characteristics. If its revelation piecemeal is miracles and miracles, then its collection in this splendor and beauty is the miracle of miracles. Is it reasonable that its arrangement in the Mushaf be different from the order of its revelation and then there is no wisdom for that? Why do we strive in seeking wisdoms and purposes of divine legislations and then demand ignoring the wisdom of the divine arrangement of His Mighty Book! 0\nThe wonder of wonders is how Al-Shawkani criticized Al-Biqa'i for his interest in this science in his Tafsir \"Nazm al-Durar\", then we see him praising this Tafsir and the path of its author in it as stated in his book \"Al-Badr al-Tali'\" during his biography of him: \"Whoever examines deeply his book translated for him in Tafsir which he made about the correlations between verses and Surahs knows that he is among the vessels of knowledge, excessive in intelligence, combining the science of reason and tradition. Often something in the Book confuses me, so I return to the extensive and concise Tafsirs and find nothing that cures, and I return to this book - Nazm al-Durar - and find in it what is beneficial mostly.\" So the wonder is how he criticizes his care for this noble science, then you see him praising him and his path in his Tafsir which combined tradition and opinion! Doesn't this remind us of Al-Buhturi's saying...",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 90
  },
  {
    "serial_number": "1135387",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 88,
    "volume_number": 1,
    "text": "*If my good deeds which I boast of were my sins... then tell me how do I apologize!*\nDoes not all what we mentioned indicate that Imam Al-Shawkani is not among the absolute deniers of this noble science, but he affirms it in Tafsir, and even shows hidden correlations whose showing needs contemplation and look, even if he does not expand in this matter 0\n{Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people. {286}}\n\n**Research References**\n*   The Holy Quran\n\n**Tafsir References**\n*   Irshad al-Aql al-Salim ila Mazaya al-Kitab al-Karim by the scholar Abu al-Saud (Muhammad bin Muhammad Mustafa al-Imadi al-Hanafi d. 982 AH, Dar al-Fikr edition, no date).\n*   Al-Asas fi al-Tafsir by Sheikh Sa'id Hawwa d. 1409 AH, Dar al-Salam edition, 1st ed. 1405.\n*   Anwar al-Tanzil wa Asrar al-Ta'wil by Al-Baydawi (Abdullah bin Umar d. 685 AH), Dar al-Jil edition, Beirut, no date 0.\n*   Al-Bahr al-Muhit by Imam Muhammad bin Yusuf famous as Abu Hayyan al-Andalusi al-Gharnati d. 754 AH, Dar Ihya al-Turath al-Arabi edition, 2nd ed. 1411 AH 0.\n*   Tafsir Ibn Juzayy al-Kalbi, Dar al-Kitab al-Arabi edition, Beirut 1403 AH.\n*   Tafsir al-Quran al-Hakim famous as Tafsir al-Manar by Sayyid Muhammad Rashid Rida, Dar al-Manar edition 1372 AH / 1953 AD, 2nd ed. 0.\n*   Taysir al-Karim al-Rahman fi Tafsir Kalam al-Mannan by Sheikh Abd al-Rahman bin Nasir al-Sa'di d. 1376 AH, General Presidency for Scholarly Research and Ifta edition, Riyadh, 1404.\n*   Al-Tahrir wa al-Tanwir by Professor Muhammad al-Tahir bin Ashur d. 1393 AH, Dar Sahnun edition, Tunisia, no date 0.\n*   Al-Tafsir al-Qurani lil-Quran by Professor Abd al-Karim al-Khatib, Dar al-Fikr al-Arabi edition, Cairo, no...",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 91
  },
  {
    "serial_number": "1135388",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 89,
    "volume_number": 1,
    "text": "*   Jami' al-Bayan fi Tafsir al-Quran by Imam Abu Ja'far Muhammad bin Jarir al-Tabari d. 310 AH, Dar al-Rayyan lil-Turath and Dar al-Hadith edition, Cairo 1407 AH.\n*   Al-Jami' li-Ahkam al-Quran by Al-Qurtubi (Abu Abdullah Muhammad bin Ahmad al-Ansari al-Qurtubi d. ...), Egyptian General Book Organization edition 1987 AD 0.\n*   Al-Durr al-Manthur fi al-Tafsir bi al-Ma'thur by Jalal al-Din al-Suyuti d. 911 AH, Dar al-Fikr edition.\n*   Ruh al-Bayan by Al-Burusawi Ismail Haqqi al-Burusawi d. 1370 AH, Dar al-Fikr edition without.\n*   Ruh al-Ma'ani fi Tafsir al-Quran al-Azim wa al-Sab' al-Mathani by Imam Al-Alusi Shihab al-Din al-Sayyid Mahmud al-Alusi d. 1270 AH, Dar Ihya al-Turath al-Arabi edition, 4th ed. 1405 AH.\n*   Ghara'ib al-Quran wa Ragha'ib al-Furqan by Nizam al-Din al-Hasan bin Muhammad bin al-Husayn al-Qummi al-Nisaburi d. 728 AH, Al-Babi al-Halabi edition 1381 AH 1st ed.\n*   Fath al-Qadir al-Jami' bayna Fannay al-Riwayah wa al-Dirayah min 'Ilm al-Tafsir by Imam Muhammad bin Ali bin Muhammad Al-Shawkani d. 1255 AH, Al-Babi al-Halabi edition 1350 AH 1st ed.\n*   Fi Zilal al-Quran by Professor Sayyid Qutb d. 1966 AD, Dar al-Shuruq 1407 AH.\n*   Mafatih al-Ghayb (Al-Tafsir al-Kabir) by Imam Fakhr al-Din al-Razi d. 606 AH, Dar al-Fikr edition 1405 AH 0.\n*   Nazm al-Durar fi Tanasub al-Ayat wa al-Suwar by Burhan al-Din Ibrahim bin Umar bin Hasan al-Biqa'i, Dar al-Kitab al-Islami edition, Cairo, 2nd ed. 1413 AH.\n\n**References in Quranic Sciences**\n*   Al-Itqan fi 'Ulum al-Quran by Jalal al-Din al-Suyuti d. 911, Al-Babi al-Halabi edition 1370 AH.\n*   I'jaz al-Quran by Judge Abu Bakr al-Baqillani d. 403 AH, Dar al-Ma'arif edition.\n*   I'jaz al-Quran wa al-Balagha al-Nabawiyya by Professor Mustafa Sadiq al-Rafi'i.\n*   Al-Burhan fi 'Ulum al-Quran by Badr al-Din al-Zarkashi d. 794, edited by Muhammad Abu al-Fadl Ibrahim, Al-Babi al-Halabi edition.\n*   Fada'il al-Quran by Ibn Kathir, Al-Babi al-Halabi edition.\n*   Mu'tarak al-Aqran fi I'jaz al-Quran by Al-Suyuti, Dar al-Fikr al-Arabi edition.",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 92
  },
  {
    "serial_number": "1135389",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 90,
    "volume_number": 1,
    "text": "*   Manahil al-Irfan fi 'Ulum al-Quran by Sheikh Muhammad Abd al-Azim al-Zarqani, Al-Babi al-Halabi edition.\n*   Al-Nasikh wa al-Mansukh by Abu Ja'far al-Nahhas d. 338 AH, edited by Dr. Sulayman al-Lahim, Mu'assasat al-Risala edition.\n*   Al-Naba' al-Azim by Dr. Muhammad Abdullah Draz may Allah have mercy on him, Dar al-Qalam edition.\n\n**References in Prophetic Sunnah**\n*   Al-Ahadith al-Mukhtara Abu Abdullah Muhammad bin Abd al-Wahid bin Ahmad al-Hanbali al-Maqdisi d. 643 AH, Maktabat al-Nahda al-Haditha edition, Mecca 1410 AH.\n*   Al-Ihsan bi Tartib Sahih Ibn Hibban - by Prince Ala' al-Din Ali bin Balban al-Farisi d. 739 AH – Edited by Shu'ayb al-Arna'ut – Mu'assasat al-Risala edition, Beirut 0.\n*   Sunan Abu Dawood (Abu Dawood Sulayman bin Ash'ath al-Sijistani al-Azdi d. 257 AH), Dar al-Fikr edition without date 0.\n*   Sunan Ibn Majah (Abu Abdullah Muhammad bin Yazid al-Qazwini d. 275 AH), Dar al-Rayyan lil-Turath edition without date 0.\n*   Sunan al-Tirmidhi (Abu Isa Muhammad bin Isa bin Sawra al-Tirmidhi d. 297 AH), Dar al-Fikr edition 1408 AH 0.\n*   Sunan al-Darimi (Abdullah bin Abd al-Rahman al-Darimi al-Samarqandi d. 255 AH), Dar al-Rayyan lil-Turath edition 1407 AH 1st ed. 0.\n*   Sunan al-Kubra by Al-Bayhaqi (Abu Bakr Ahmad bin al-Husayn al-Bayhaqi), Dar al-Fikr edition without date.\n*   Al-Sunan al-Kubra by Al-Nasa'i - Edited by Dr. Abd al-Ghaffar Sulayman al-Bundari and Sayyid Kasrawi Hasan, Dar al-Kutub al-Ilmiyya edition, Beirut Lebanon 1st ed. 1411 AH.\n*   Sunan al-Nasa'i (Ahmad bin Shu'ayb al-Nasa'i d. 303 AH) with commentary by Al-Suyuti and footnotes by Al-Sindi, Dar al-Kitab al-Arabi edition, Beirut without date 0.\n*   Shu'ab al-Iman by Al-Bayhaqi, Dar al-Kutub al-Ilmiyya edition 1410 AH 1st ed. 0.\n*   Sahih Ibn Khuzaimah (Abu Bakr Muhammad bin Ishaq bin Khuzaimah al-Sulami al-Nisaburi d. 311 AH), Al-Maktab al-Islami edition, edited by Dr. Muhammad Mustafa al-A'zami 1st ed. 1395 AH 0.\n*   Sahih Al-Bukhari with Al-Sindi's footnotes 0.\n*   Sahih Muslim with Al-Nawawi's commentary (Imam Muslim bin al-Hajjaj bin Muslim al-Qushayri d. 261 AH), Dar Ihya al-Turath al-Arabi edition, 3rd ed. without date 0.",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 93
  },
  {
    "serial_number": "1135390",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Al-Shawkani's Stance in his Tafsir regarding Munasabat",
    "edition": "None",
    "publisher": "None",
    "page_number": 91,
    "volume_number": 1,
    "text": "*   Al-Kamil fi Du'afa' al-Rijal by Abdullah bin Adi bin Abdullah al-Jurjani d. 365 AH, Dar al-Fikr edition 1409 AH.\n*   Majma' al-Zawa'id wa Manba' al-Fawa'id by Al-Haythami, Dar al-Kitab al-Arabi edition, Beirut 1402 AH 0.\n*   Al-Mustadrak 'ala al-Sahihayn by Imam Abu Abdullah al-Hakim al-Nisaburi d. 405 AH, and in its tail Talkhis al-Mustadrak by Imam Shams al-Din al-Dhahabi d. 848 AH 0.\n*   Musnad Imam Ahmad bin Hanbal, Al-Maktab al-Islami edition without date 0.\n\n**References in Language**\n*   Mu'jam Maqayis al-Lugha by Ibn Faris, Maktabat Wahba edition, Cairo 1972 AD.\n*   Al-Sihah by Al-Jawhari, edited by Ahmad Abd al-Ghafur al-Attar, Dar al-Ilm lil-Malayin edition 1399 AH.\n*   Mu'jam al-Mufassal fi 'Ulum al-Balagha compiled and arranged by Dr. In'am Akkawi within Al-Khizana al-Lughawiyya series, Dar al-Kutub al-Ilmiyya edition.\n\n**Foreign References**\n*   The Quran: Its Revelation, Recording, Translation, and Influence by Blachère, translation by Rida Saadeh, Dar al-Kitab al-Lubnani edition, Beirut 1974 AD.\n*   Schools of Islamic Exegesis by Goldziher, translation by Dr. Abd al-Halim al-Najjar, Al-Sunnah al-Muhammadiyya Press 1374 AH.",
    "foot_note": "None",
    "book_id": "943",
    "new_page_number": 94
  }
]