[
  {
    "text": "Commands and Prohibitions According to Al-Shafi'i\nAuthor: إسماعيل بن يحيى بن إسماعيل أبو إبراهيم المزني\nYear: 264",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "new_page_number": 1
  },
  {
    "text": "sn: 4183\nbook_title: الأمر والنهي على معنى الشافعي\nbook_link: https://shamela.ws/book/955\nbook_id: 955\nauthor_name: إسماعيل بن يحيى بن إسماعيل أبو إبراهيم المزني\nauthor_year: 264\nnickname: أبو إبراهيم\nauthor_link: https://shamela.ws/author/429\nauthor_ID: 429\neditor: أبي عامر عبد الله شرف الدين الداغستاني\npublisher: دار مدارج للنشر - الرياض\nedition: الأولى، 1440 هـ - 2019 م\npages: 57\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الفقه الشافعي\ncategory_id: 16",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "new_page_number": 2
  },
  {
    "serial_number": "3909984",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Shafi'i Jurisprudence\nBook: Commands and Prohibitions According to Al-Shafi'i (Al-Amr wal-Nahy 'ala Ma'na al-Shafi'i)\nNarrated by: Abu Ishaq Ibrahim bin Ishaq from him (Printed with Mukhtasar Al-Muzani)\nAuthor: Abu Ibrahim Ismail bin Yahya Al-Muzani (d. 264 AH)\nCorrection and Commentary: Abu Amir Abdullah Sharaf al-Din al-Daghestani\n[Book numbering matches the printed version]\nDate of publication in Shamela: 15 Muharram 1444\n\nBook: Commands and Prohibitions According to Al-Shafi'i\nNarrated by: Abu Ishaq Ibrahim bin Ishaq from him (Printed with Mukhtasar Al-Muzani)\nAuthor: Abu Ibrahim Ismail bin Yahya Al-Muzani (d. 264 AH)\nCorrection and Commentary: Abu Amir Abdullah Sharaf al-Din al-Daghestani\n[Book numbering matches the printed version]\nDate of publication in Shamela: 15 Muharram 1444",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 3
  },
  {
    "serial_number": "3909985",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 327,
    "volume_number": 1,
    "text": "Supplement to the Introductions: The Book of Commands and Prohibitions According to Al-Shafi'i, may Allah have mercy on him, from the questions of Al-Muzani, may Allah be pleased with him, narrated by Abu Ishaq Ibrahim bin Ishaq from him.",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 4
  },
  {
    "serial_number": "3909986",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 329,
    "volume_number": 1,
    "text": "I saw fit to append to these studies a booklet, small in size but large in content, which is «The Book of Commands and Prohibitions According to Al-Shafi'i, may Allah have mercy on him, from the questions of Al-Muzani, may Allah be pleased with him, narrated by Abu Ishaq Ibrahim bin Ishaq from him». This is done to complete the act of righteousness and to collect what has reached us of Al-Muzani's texts.\n\nManuscript Copy and Editions:\nA unique copy of this book has reached us from the Al-Zahiriyah Library under number: (2895) in twelve images. It is an old copy whose script resembles the scripts of the third century. The book has been printed based on it several times. The best of them, to my knowledge, is the edition by Dar Al-Siddiq, investigated by Anwar Hisham Darwish. However, my undertaking of the verification of «Al-Mukhtasar» made me desire to append this book to my project. So, I re-read the manuscript and corrected the book against it. This resulted in some minor choices in reading where I differed from the Dar Al-Siddiq edition. Also, the printed version deleted the poetry section of the book, which Abu Ishaq the narrator had appended, and I have included what I was able to read of it. I also added a chapter to the book in which I appended two lengthy texts from Al-Muzani regarding the legitimacy of reasoning (Nazar) and the prohibition of blind imitation (Taqlid). It must be noted that the manuscript does not have a unified system for spelling, and much of it is contrary to the standard, and sometimes contrary to eloquent syntax. Since I did not have another copy to rely on for correction, I decided to preserve the spelling and syntax methods found in the manuscript. It will not be difficult for the intelligent reader to recognize this and trace it back to its correct form with the slightest reflection, Allah willing.",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 5
  },
  {
    "serial_number": "3909987",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 330,
    "volume_number": 1,
    "text": "The Narrator of the Book:\nIt is mentioned on the title page of the book that it is «from the questions of Al-Muzani, may Allah be pleased with him, narrated by Abu Ishaq Ibrahim bin Ishaq». The narrator was not distinguished more than that. It could be Abu Ishaq Al-Harbi; he was born in the year 198 and died in the year 285. It appears at the end of the book that he narrates some poetry from Abu Ishaq Al-Warraq, who is Ismail bin Aban (d. 216 AH).\n\nAttribution of the Book:\nThe issue of the book's attribution remains. Three names appear on the title page of the book: Al-Shafi'i, may Allah have mercy on him, Al-Muzani, may Allah be pleased with him, and Abu Ishaq Ibrahim bin Ishaq. The question is: Who is the owner and author of the book?\nI say: The book has been attributed in all its publications to Al-Muzani, explaining Al-Shafi'i's doctrine on the meaning of commands and prohibitions. However, some objected to this and considered it one of Al-Shafi'i's books on Usul (legal theory), correctly attributed to him and narrated by his student Al-Muzani. One said: «Unfortunately, this book was printed a long time ago; an orientalist printed it and attributed it to Al-Muzani, and the Arabs who printed the book followed him, their evidence being what came in the manuscript attributing it to Al-Muzani.» He continued: «But the Sheikh of the Madhhab and the preserver of Imam Al-Shafi'i's books: Imam Al-Bayhaqi in his book (Manaqib Al-Shafi'i) attributed the book to Al-Shafi'i with a verified attribution, and repeated this attribution multiple times. Indeed, when he dedicated a chapter to Al-Shafi'i's books on Usul, he listed it among his books regarding which there is no dispute that they belong to Al-Shafi'i.» Then he mentioned some of Al-Bayhaqi's texts attributing the «Book of the Description of Command and Prohibition» to Al-Shafi'i, and said: «This declaration from Imam Al-Bayhaqi cuts off all dispute and corrects the attribution of the book to Imam Al-Shafi'i.» He added: «This is what the printers of the book did not realize.»",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 6
  },
  {
    "serial_number": "3909988",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 331,
    "volume_number": 1,
    "text": "This is the summary of his claim. The noble researcher Mashari Al-Shathri refuted him, saying: The Sheikh has missed the mark in what he mentioned. Al-Bayhaqi's words do not mean that that specific book is the intended one, especially if it is proven to be a different book. The book Al-Bayhaqi refers to is not this book attributed to Al-Muzani. He said: The book «Sifat al-Amr wal-Nahy» (Description of Command and Prohibition) by Al-Shafi'i is extant and preserved within the book «Al-Umm» (1). This book begins with Al-Shafi'i saying: «Ibn Uyaynah informed us». Within this book, there is a subheading titled: «Description of the Prohibition of the Messenger of Allah, peace be upon him». What diverted attention from this book under this name was the assumption that this book was part of the book «Jima' al-Ilm». Sheikh Rif'at - the investigator of the Al-Wafaa edition - made it part of the book «Jima' al-Ilm», and before him Sheikh Shakir, who published «Jima' al-Ilm» separately, appended this book to it. Then he mentioned (p. 8) a possibility that this title: «Description of the Prohibition of the Messenger of Allah, peace be upon him» is an independent book, and that it is what was intended by those who wrote biographies of Al-Shafi'i and listed among his books the book «Sifat al-Amr wal-Nahy». The possibility mentioned by Sheikh Shakir is correct, except that he overlooked the fact that the intended book does not begin with this title; rather, it begins before that. This title is merely the title of a chapter within it. The correct view is that the book «Sifat al-Amr wal-Nahy» includes what is in (9: 46 - 55) of the Al-Wafaa edition, beginning with Al-Shafi'i's saying: «Ibn Uyaynah informed us» and ending with his saying: «I only said he would be disobedient in it if the proof was established against the man that he knew that the Prophet, peace be upon him...». He said: I add to that another matter, and say that the book «Jima' al-Ilm» does not end at the book «Sifat al-Amr wal-Nahy», but ends before that, specifically at...",
    "foot_note": "1. It is located in (9: 46 - 55) of the Al-Wafaa edition.",
    "book_id": "955",
    "new_page_number": 7
  },
  {
    "serial_number": "3909989",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 332,
    "volume_number": 1,
    "text": "...his saying: «if the disagreement was found in their actions» (9: 42). The title following it, «Clarification of the Obligation of Allah, Blessed and Exalted», is an independent book and not a chapter of it. It was mentioned by those who wrote biographies of Al-Shafi'i, such as Al-Bayhaqi in «Al-Manaqib» (1: 246). Then comes after it the book «Sifat al-Amr wal-Nahy» with the description I presented. Thus, it turns out that what is printed under the name «Jima' al-Ilm» is in reality three books: First: «Jima' al-Ilm» (1). Second: «Bayan Fara'id Allah Tabaraka wa Ta'ala» (Clarification of the Obligations of Allah) (2). Third: «Sifat al-Amr wal-Nahy» (Description of Command and Prohibition) (3). The proof of this is that each of these three books treats an independent subject. Stronger proof is that this appeared in a good manuscript of «Al-Umm», which is preserved in the Murad Molla Library. Each of these books came with an independent title, prefaced with an independent opening. In (6: 127 b): «Jima' al-Ilm. In the name of Allah, the Most Gracious, the Most Merciful. And He is sufficient for me». And in (6: 137 b): «...if the disagreement was found in their actions. The book is completed. Following it in the eighth part is Clarification of the Obligation of Allah, Blessed and Exalted». Then in (6: 139 a): «In the name of Allah, the Most Gracious, the Most Merciful. And He is sufficient for me. Clarification of the Obligation of Allah, Blessed and Exalted». And in (6: 140 a): «In the name of Allah, the Most Gracious, the Most Merciful. And He is sufficient for me. Description of Command and Prohibition». The scribe wrote this title again in the margin of the manuscript to indicate that it is the beginning of an independent book, and each of these titles is distinguished in red ink.",
    "foot_note": "1. It is located in (9: 5 - 42) Al-Wafaa edition. \n2. It is located in (9: 42 - 46) ending with Al-Shafi'i's saying: «then he performed the obligation». \n3. It is located in (9: 46 - 55).",
    "book_id": "955",
    "new_page_number": 8
  },
  {
    "serial_number": "3909990",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 333,
    "volume_number": 1,
    "text": "The intended point from researcher Mashari Al-Shathri's words ends here, and it is sufficient and adequate in negating the attribution of the book to Al-Shafi'i. Whoever reads the book completely cannot even imagine that it belongs to Al-Shafi'i, how could they when it contains questions asked to Al-Muzani which he answered? So how can it be said that it belongs to Al-Shafi'i? However, proving the attribution of the book to Al-Muzani remains. I mentioned the consensus of the book's publishers on this attribution, but there are issues with it: First - The repetition of the phrase: «Al-Muzani was asked about...» in most of the chapter's issues. This is evidence that the book is from the notes of its narrator from Al-Muzani, indicating that the book is not among the books written by Al-Muzani himself. Second - The presence of additions at the end of the book comprising poetry and wisdom, which are from the book's narrator Abu Ishaq Ibrahim bin Ishaq narrating from Abu Ishaq Ismail bin Aban Al-Warraq (d. 216 AH). But it is said: He appended these additions after the completion of the book. Third - The phrase: «From the questions of Al-Muzani, may Allah be pleased with him» appearing on the title page of the book. This is the main support for attributing the book to Al-Muzani, but while indicating the origin of the attribution, it also indicates that the book is part of another book by Al-Muzani. This is supported by the absence of any mention of a book named «Commands and Prohibitions According to Al-Shafi'i» in the list of Al-Muzani's works. The conclusion: The book is a recording by its narrator Abu Ishaq Ibrahim bin Ishaq from some of Al-Muzani's books, possibly from the book «Al-Masa'il Al-Mu'tabarah» or «Al-Manthur». The attribution of the material presented in the book to Al-Muzani is not denied; it is his, Allah willing. Al-Muzani's style is apparent in it; he summarized many discussions from Al-Shafi'i's book «Al-Risalah», and it contains stylistic features Al-Muzani was known for and benefited",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 9
  },
  {
    "serial_number": "3909991",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 334,
    "volume_number": 1,
    "text": "from Al-Shafi'i. Among them: Rejecting blind imitation (Taqlid); he mentioned the meanings of General and Specific and Command and Prohibition, then said: «This is the manner of Al-Shafi'i's doctrine, so understand it and do not blindly imitate the one who established it». Among them: Hesitation in the issue and lack of assertiveness where there is no certainty in the evidence; he mentioned some issues of expenses and then said: «This is what occurred to me, and that did not satisfy me as I desire». Among them: Seeking guidance from Allah (Istikhara) where there is doubt in the issue; he mentioned some issues of divorce and said: «I seek Allah's guidance in that, and the analogy according to me is as I described».",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 10
  },
  {
    "serial_number": "3909992",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 335,
    "volume_number": 1,
    "text": "The Book of Commands and Prohibitions According to Al-Shafi'i, may Allah have mercy on him\nFrom the questions of Al-Muzani, may Allah be pleased with him\nNarrated by Abu Ishaq Ibrahim bin Ishaq from him\nIn the name of Allah, the Most Gracious, the Most Merciful (1)\nAl-Muzani, may Allah have mercy on him, was asked about the general principle of Command and Prohibition according to the doctrine of Al-Shafi'i. He said: Al-Shafi'i's doctrine according to me, and success is with Allah: Is that Command and Prohibition from Allah, Mighty and Majestic, and from His Messenger, peace be upon him, are upon Generality (Umum), Appearance (Zahir), and Obligation (Hatm), unless there comes in the context of the report or elsewhere something indicating that Specificity (Khusus), an Interior meaning (Batin), Guidance (Irshad), Permissibility (Ibahah), or a mere Indication (Dalalah) was intended. In that case, accepting the evidence is binding. So if Allah, Mighty and Majestic, or His Messenger, peace be upon him, commands a matter and names it... then whatever the name applies to, the ruling applies to it upon Generality and Obligation. This is because had Allah, Blessed and Exalted, or His Messenger, peace be upon him, not intended the General and intended something else, He would have clarified it. Since He did not clarify it, we know that He did not intend what He did not clarify; just as He did not command except with what He clarified; because He does not task [us] with knowledge of the Unseen. Allah, Mighty and Majestic, said: (Say, \"None in the heavens and earth knows the unseen except Allah\") [An-Naml: 65], and He said: (And We did not send any messenger except [speaking] in the language of his people to state clearly for them) [Ibrahim: 4], and He said: (And Allah would not let a people stray after He has guided them until He makes clear to them what they should avoid) [At-Tawbah: 115], and He said: (And do not pursue that of which you have no knowledge. Indeed, the hearing, the sight and the heart - about all those [one] will be questioned) [Al-Isra: 36]. So whoever claims regarding what the Quran or Sunnah stated generally - whose meaning is clear in the language - that a specific meaning was intended to the exclusion of another... it is said to him: Your statement",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 11
  },
  {
    "serial_number": "3909993",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 336,
    "volume_number": 1,
    "text": "«that it was intended» is [claiming knowledge of] the Unseen, and the Unseen is not reached except by a report. The one claiming that without right is isolated, and it is not accepted from a claimant except with evidence, nor is an argument removed without an argument. (2) This is the answer to a question used as evidence by one who reflects, and needs explanation for the one who has not reflected. I have described to you a little from every aspect that indicates much, Allah willing. (3)\nFrom the General Command in the Quran: The saying of Allah, Blessed and Exalted: (Indeed, Allah commands you to render trusts to whom they are due) [An-Nisa: 58]. He said: (And give the women [upon marriage] their dower as a free gift) [An-Nisa: 4]. And He said: (If you perceive in them sound judgement, release their property to them) the Verse [An-Nisa: 6]. (4)\nFrom the General Prohibition in the Quran: Allah, Mighty and Majestic, said: (And do not kill the soul which Allah has forbidden, except by right) [Al-Isra: 33]. And He said: (And do not approach unlawful sexual intercourse. Indeed, it is ever an immorality and is evil as a way) (1) [Al-Isra: 32]. And He said: (Do not consume usury, doubled and multiplied) (2) [Al-Imran: 130]. (5)\nFrom the General Command in the Sunnah: The Messenger of Allah, peace be upon him, said: «Whoever sleeps through a prayer or forgets it, let him pray it when he remembers it; for Allah, Mighty and Majestic, says: (And establish prayer for My remembrance) [Ta-Ha: 14]». And he, peace be upon him, commanded the woman with Istihadah (irregular bleeding) to perform Ghusl upon the expiration of menses, and to pray during the days of Istihadah. And the Prophet commanded the one who imagined something in prayer not to leave until he hears a sound or finds a smell.",
    "foot_note": "1. In the original: (Indeed it was an immorality and hateful and evil as a way), it seems the word entered upon Al-Muzani from the verse in Surat An-Nisa (22): (And do not marry those [women] whom your fathers married, except what has already occurred. Indeed, it was an immorality and hateful and evil as a way). \n2. In the original: «Do not consume», and the 'Waw' (And) is not from the verse.",
    "book_id": "955",
    "new_page_number": 12
  },
  {
    "serial_number": "3909994",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 337,
    "volume_number": 1,
    "text": "(6) From the General Prohibition in the Sunnah: The prohibition of the Prophet, peace be upon him, regarding [selling] gold for gold, silver for silver, wheat for wheat, barley for barley, dates for dates, and salt for salt, except like for like, equal for equal, hand to hand. And he, peace be upon him, forbade selling food until it is fully possessed, and he forbade [selling] debt for debt. (7)\nFrom the General which the Quran indicated was intended to be Specific: Allah, Mighty and Majestic, said regarding the polytheists: (And fight them until there is no fitnah and [until] the religion, all of it, is for Allah) [Al-Anfal: 39]. Had He not said other than this, it would have been General. But when He commanded fighting the polytheists from the People of the Book until they give the Jizya... this indicated Specificity, and that the people of polytheism are two types: People of the Book, and People of Idols. Disbelief and the command to fight them united them in one meaning, but a distinction was made between them in giving Jizya; it was accepted from the Kitabi (Person of the Book) and fighting him became forbidden, but it was not accepted from the idolater so leaving him became forbidden. (8)\nAnd He said: (The [unmarried] woman or [unmarried] man found guilty of sexual intercourse - lash each one of them with a hundred lashes) [An-Nur: 2]. Had He not said other than this, every freeman and slave would be lashed one hundred times. But when He said regarding slave girls: (But when they are sheltered in marriage, then if they commit immorality, they shall be subject to half the punishment that is for free women) [An-Nisa: 25], this indicated Specificity. So Zina united the slave and the freeman in one meaning, but a distinction was made between them in that the hundred was placed on the free virgin, and half on the slave. (9)\nAnd He, Mighty and Majestic, said: (Then marry those that please you of women, two or three or four) [An-Nisa: 3]. Had He not said other than this, every believing and polytheistic woman would be lawful. But when He said: (And do not marry polytheistic women until they believe, and a believing slave woman is better than a polytheist, even though she might please you) [Al-Baqarah: 221], this indicated Specificity. Then, had He not said other than this, no polytheist woman, whether Kitabi or idolater, would be lawful. But when He said: (And [lawful in marriage are] chaste women from those who were given the Scripture before you) [Al-Ma'idah: 5], it indicated that the prohibition applies to other than the People of the Book.",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 13
  },
  {
    "serial_number": "3909995",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 338,
    "volume_number": 1,
    "text": "(10) From the General in the Sunnah which indicated that a specific meaning was intended: The Messenger of Allah, peace be upon him, said: «In what is watered by the sky, one-tenth, and in what is watered by irrigation, half of one-tenth». Had he not said other than this, Zakat would be in a Mudd (a small measure) and less. But when he said: «There is no charity (Zakat) in less than five Awsuq», it indicated that he intended by it the Specific, which is what reaches five Awsuq and above. (11)\nAnd he, peace be upon him, said: «The neighbor has more right to his neighbor's proximity (property via pre-emption)». Had he not said only this, every neighbor would have pre-emption. But when he said: «If the boundaries are set, there is no pre-emption», it indicated that he intended the Specific, which is the neighbor who is a partner sharing the property, not the neighbor who shares a boundary. (12)\nAnd he forbade selling dates for fresh dates. Had he not said other than this, selling dates for fresh dates would never be permissible. But when he permitted the sale of Araya - which is dates for fresh dates - it indicated that he intended by the prohibition: what is other than Araya. (13)\nFrom the General in the Quran which the Sunnah indicated was intended to be Specific: Allah, Blessed and Exalted, said: (O you who have believed, when you rise to [perform] prayer, wash your faces) to His saying: (and your feet to the ankles) [Al-Ma'idah: 6]. Had He not said other than this, it would be upon the servants whenever a man rose to pray to perform ablution (Wudu), whether he had Wudu or not. But when the Messenger of Allah prayed several prayers with one Wudu, that indicated that He intended by those rising to prayer those who do not have Wudu. And when he wiped over the leather socks (Khuffayn), it indicated that He intended by those rising to prayer those who do not have leather socks on. (14)\nAnd He, Mighty and Majestic, said: ([As for] the thief, the male and the female, amputate their hands in recompense for what they committed) [Al-Ma'idah: 38]. Had He not said other than this, anyone to whom the name of theft applies would have [their hand] cut. But when the Prophet, peace be upon him, said: «Amputation is in a quarter of a dinar and above», it indicated that Allah, Mighty and Majestic, intended some thieves to the exclusion of others.",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 14
  },
  {
    "serial_number": "3909996",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 339,
    "volume_number": 1,
    "text": "(15) And He said: (And if he has divorced her [for the third time], then she is not lawful to him afterward until [after] she marries a husband other than him) [Al-Baqarah: 230]. Had He not said other than this, then if she married another and he divorced her before consummating with her, she would be lawful to the first. But when the Messenger of Allah, peace be upon him, said to the wife of Rifa'ah, who had divorced her three times and she had remarried: «Do you want to return to Rifa'ah? No, until you taste his sweetness and he tastes your sweetness», it indicated that He intended: The husband who consummates, to the exclusion of the husband who did not consummate. (16)\nFrom the Command which the Quran stated absolutely, its clarification indicates it is permissible: Since dispersing and seeking Allah's bounty were permissible, He prevented them by His saying: (When the call is made for prayer on Friday, then proceed to the remembrance of Allah) [Al-Jumu'ah: 9], and He said: (But when they saw a transaction or some diversion, they rushed to it and left you standing) [Al-Jumu'ah: 11]. So He informed that their prevention from the permissible was due to what He obliged upon them of attending Friday prayer, and so they would not leave the Messenger of Allah standing during the obligatory prayer. When He said: (And when the prayer has been concluded, disperse within the land and seek from the bounty of Allah) [Al-Jumu'ah: 10], its meaning was the permissibility of both as they were before, not that it is an obligation upon them. (17)\nFrom that is that hunting was permissible by the saying of Allah, Mighty and Majestic: (And what you teach of hunting animals which you train as handlers... eat of what they catch for you) [Al-Ma'idah: 4], and He said: (which your hands and spears reach) [Al-Ma'idah: 94]. But when He, Mighty and Majestic, said: (Do not kill game while you are in the state of ihram) [Al-Ma'idah: 95], then said: (But when you come out of ihram, then [you may] hunt) [Al-Ma'idah: 2], its meaning was returning them to the permissible as it was at first, not that it is an obligation upon them. (18)\nFrom that is that it is permissible for a man to eat from his wealth or leave it. When he gives his wife her dowry, Allah, Mighty and Majestic, said: (And it is not lawful for you to take anything of what you have given them) (1) [Al-Baqarah: 229], and He said: (And how could you take it while you have gone in unto each other) [An-Nisa: 21],",
    "foot_note": "1. In the original: «And do not take...», his saying: «And it is not lawful for you to» was dropped.",
    "book_id": "955",
    "new_page_number": 15
  },
  {
    "serial_number": "3909997",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 340,
    "volume_number": 1,
    "text": "So He informed that [what prevented] him from it was her ownership of it unless she gives it willingly. When He said: (But if they give up willingly to you anything of it, then take it in satisfaction and ease) [An-Nisa: 4], if she gives it willingly, the prohibition is lifted by the lifting of the prevention, and it returns to being permissible as it was at first, not that it is an obligation upon them; just as the prohibition of dispersing and seeking Allah's bounty was lifted by the conclusion of the prayer, and just as the prohibition of hunting was lifted by the end of Ihram. The meaning in all of that returns to the permissible as it was at first, not that it is an obligation that they disperse, nor that they seek Allah's bounty, nor that they hunt, nor that they eat. Similar to it is: (then take it in satisfaction and ease) [An-Nisa: 4], and (eat of what they catch for you) [Al-Ma'idah: 4], it is not an obligation that he eats. So understand it and do not blindly imitate the one who established it.\n\nThe Prohibition that makes Haram from the Sunnah\n(19) Al-Muzani was asked about some Sunnahs of the Messenger of Allah, peace be upon him, that prohibit. He said: From that is his prohibition of selling Gharar (uncertainty), selling fruits for years ahead, [selling] debt for debt, Muhaqalah, Muzabanah, Munabadhah, Habal al-Habalah (unborn fetus), two sales in one, profit of what is not guaranteed, selling fruits until their ripeness appears, Nikah al-Mut'ah (temporary marriage), Shighar marriage, and what is in the meaning of this.\n\nProhibition regarding Preference (Choice/Adab)\n(20) Al-Muzani was asked about that. He said: His prohibition of eating two dates together (Qiran), while the dates belong to the eater; the interpretation of that according to us is regarding the etiquette of eating. And his prohibition, peace be upon him, of checking the inside of the date; it seems to me that it is lest he finds inside it what makes him disgusted with it, and he suspects the same of others and his self is not pleased to eat them,",
    "foot_note": "1. The word between brackets is not clear in the original, and I read it based on conjecture.",
    "book_id": "955",
    "new_page_number": 16
  },
  {
    "serial_number": "3909998",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 341,
    "volume_number": 1,
    "text": "or he is not content with what Allah has bestowed upon him of it so he eats it when that reaches him. And his prohibition of sleeping (Ta'ris) on the middle of the road; its meaning according to me is regarding good care for the one spending the night. His saying: «For it is the shelter of snakes» is evidence that it is out of fear for them from their harm; due to his compassion and mercy for them, peace be upon him, not a prohibition [Haram] of sleeping on the road. From that: his prohibition of eating from the top of the Tharid (dish); his saying: «For the blessing descends from the top» is evidence that he intended the continuity of blessing for the eater, not a prohibition [Haram] of eating from the top. And his saying, peace be upon him: «Mention Allah's name and eat from what is next to you» is regarding good manners and beautiful companionship in eating. (21) And from his prohibition regarding actions with property being Haram: From that is that he, peace be upon him, said: «He who drinks in a vessel of silver is only dragging the fire of Hell into his belly». The silver might be the property of the drinker, and Allah has obliged Zakat on silver, and the Prophet, peace be upon him, wore a silver ring, and the women of the believers adorned themselves with it. Silver is lawful, but the action with it as the Prophet, peace be upon him, forbade is Haram. He forbade wearing silk, which is property for believers and lawful for their women. So prohibiting it and prohibiting gold for men is Haram from the aspect of adornment; just as drinking from a silver vessel is Haram from the aspect of extravagance and arrogance. And his prohibition of wrapping oneself in the Samma' garment, and that a man sits holding his legs (Ihtiba') in a single garment with nothing over his private parts. The garment may be the property of the one wrapping or sitting, so his property is lawful, but his action with it is Haram due to the cause of revealing 'Awrah (nakedness), like the forbidden action in drinking from a silver vessel and wearing silk as I described. This is the manner of Al-Shafi'i's doctrine, so understand it and do not blindly imitate the one who established it. And success is with Allah.",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 17
  },
  {
    "serial_number": "3909999",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 342,
    "volume_number": 1,
    "text": "[Issues in Hadith (1)]\n(22) Al-Muzani was asked about the saying of the Prophet, peace be upon him: «Whoever cuts a Sidr tree, Allah will pour his head into the Fire». He said: If it is established that the Prophet said it, it seems likely that he was asked about someone who attacked and cut a Sidr tree belonging to a man or an orphan or someone for whom Allah made it forbidden to cut it upon him, so he transgressed against it and cut it after the prohibition of Allah, Mighty and Majestic, or the prohibition of His Messenger, peace be upon him, or by indication. Thus, he deserves what was said due to his attack in opposition to Allah or His Messenger. So the question preceded the listener hearing the answer, so he heard the answer but did not hear the question, and conveyed what he heard without what he didn't hear. Analogous to what Usama narrated that the Messenger of Allah said: «Riba is only in credit (Nasi'ah)». The interpretation of that is potentially that the Messenger of Allah was asked: Is there Riba in gold for gold, like for like? So he said: «Riba is only in credit», so he heard the answer and did not hear the question. The evidence for that is the saying of the Prophet, peace be upon him: «Do not sell gold for gold except like for like, hand to hand». The evidence for [the permissibility of] cutting the Sidr tree according to me, and success is with Allah: Is that a person has more right to his property, and it is permissible for him to make his garden a house to live in, cutting what is in it of trees, Sidr and others. And since I have not seen anyone refraining from [using] the leaves of the Sidr tree - and leaves are part of the tree like the branch - and the Messenger of Allah equated regarding what is forbidden to cut between it and stripping its leaves ('Adh) by his saying regarding the trees of Mecca: «Its trees shall not be stripped ('Yu'dad')», so stripping is in the meaning of cutting in prohibition. And the Prophet permitted washing with Sidr, which is evidence that if cutting it from its tree were Haram, he would not have permitted benefiting from what is forbidden to cut. In that is evidence of its permissibility. If it were permissible for me not to depart from the wording of the Hadith without indication from another Hadith, nor consensus, nor what scholars specifically transmitted, acceptance would be more binding than rejecting inference.",
    "foot_note": "1. Title added by me to the original.",
    "book_id": "955",
    "new_page_number": 18
  },
  {
    "serial_number": "3910000",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 343,
    "volume_number": 1,
    "text": "(23) And the Messenger of Allah said: «You and your wealth belong to your father». If one did not reason by interpretation, he [the father] would have the right to sell his son just as he sells his slave and his slave's wealth, and it would not be lawful for his son to have intercourse with his own slave girls (1) because the private parts would belong to another. And when he dies, the grandfather would inherit the amount he inherits from the living son's wealth, and the son's buying and selling would be invalid except with his father's permission. And if the son died, his son nor his wife nor his child would inherit him; because he has no wealth and it is only for his father. Much is like this. So the interpretation of «You and your wealth belong to your father» according to me, and success is with Allah: Is that he, peace be upon him, obliged him out of kindness (Birr) to his father not to withhold what his father wanted from his self and his wealth, unless he asks for excess or something forbidden, then that is not part of the kindness that is obligatory upon him. Not (2) that its meaning is that he and his wealth are property of his father. (24) Similar to that also: What he, peace be upon him, forbade of selling water; because there is no disagreement among us that selling what a man's vessel contains is lawful. So its meaning according to us is a specific prohibition, which is different from selling water in its place where it was created; like his saying: «Let not one of you withhold surplus water to prevent thereby [surplus grass]». So he permitted that for one who grazes in the pasture, and forbade withholding surplus water; because withholding it prevents the establishment of livestock on the pasture; because they have no sustenance except with water. As for one who drew it with his bucket, or took it with his jug, this specifically has become his property, he sells it and it is inherited from him. (25) From it: What was narrated that the Messenger of Allah, peace be upon him, forbade three things in prayer: The pecking of the crow, the spreading of the beast of prey, and that a man settles in a place like the settling of a camel. Al-Muzani said: The meaning of this prohibition according to me, and success is with Allah, is on two aspects: One - That he does not reserve the spot by settling, preventing others from it, becoming like an owner, while the mosque and every spot in it belongs to whoever gets there first, so he does not exclusively hold it to",
    "foot_note": "1. I established it thus based on conjecture, as it is unclear in the original. The apparent script in the original is: «Watrju». \n2. Apparent in the original: «Illa» (Except/Unless).",
    "book_id": "955",
    "new_page_number": 19
  },
  {
    "serial_number": "3910001",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 344,
    "volume_number": 1,
    "text": "prevent others. The other aspect - That he sees his settling as increasing his reward, attaining reward by settling. The argument in that: Is that every spot in the mosque is equal to its like, and that people are equal in it. Were it not so as I described, Allah willing, it would not be permissible for a man to pray consecutive times in one place in the mosque where there is no one else, nor anyone he harms by praying there, nor would it be permissible for a man to make a Qibla in his house where he settles to pray. In that is evidence for what we said, and success is with Allah. (26) From it: That Makhlad bin Khufaf said: A slave was shared between partners, so they sold him while one of the partners was absent. When he arrived, he refused to approve. So they disputed regarding that before Hisham bin Ismail, who judged that the slave be returned and followed by the people to take the earnings (Kharaj) from him. The earnings in the past years were found to be a thousand dirhams. He said: So two boys of mine were sold. He said: So I came to Urwah bin Al-Zubayr and mentioned that to him. He said: Aisha told me that the Messenger of Allah said: «The profit follows the liability (Al-Kharaj bi-l-Daman)». He said: So Urwah entered upon Hisham and told him that, so he returned the sale of the two boys and returned the earnings. Al-Muzani said: Al-Shafi'i narrated that Makhlad bin Khufaf mentioned to Urwah regarding a slave he bought and found a defect in, so it was judged against him to return him and return his earnings. Urwah said: The Messenger of Allah judged in the likes of this that profit follows liability. He is the one who narrated the Hadith from Aisha, and it contains the addition of his saying: «in the likes of this», which is the lawful sale which the buyer possessed, so the earnings occurred in the buyer's ownership from what he bought. That was never in the seller's ownership. When he found a defect in him, he returned him because he is the purchased item, and did not return his earnings because they were not purchased. And his ownership was lawful, so what his lawful ownership earned was likewise lawful. Distinct from that is one who buys usurped property, or a man usurps a slave, or buys with a corrupt purchase, so he does not own any of that, such that he would own his earnings. So he must return him and return his earnings; because he is in the ownership of another.",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 20
  },
  {
    "serial_number": "3910002",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 345,
    "volume_number": 1,
    "text": "And likewise whatever is a branch of another's property. The counterpart of what I owned lawfully or earned is lawful, and what was owned by another is not lawful for me but forbidden [to keep]. Whoever adds a meaning to the report from the Messenger of Allah, peace be upon him, is an affirmer (Muthbit), and whoever does not bring it is not a proof against whoever brought it. Just as Bilal narrated about the Messenger of Allah inside the House (Kaaba) while Osama and Uthman bin Talha were with him, and another said: «He did not do it». And just as Ibn Umar and others narrated that the Prophet used to raise [his hands] when he said Takbir for opening and when he raised his head from bowing, and Ibn Masud narrated that he used to raise in the first time then not return. So the one who affirms is a witness, and the one who does not affirm is not a witness, [he] was heedless. Do you not see that if two men testified against a man that he said: «My wife is divorced thrice», and two others testified with them to what they testified against him, but added in their testimony that he connected: «if you enter the house»... that no divorce is upon him; due to the addition of the two witnesses regarding what they added of the report in their testimony, and there is no meaning for the two who cut off at divorce, and due to the dropping of knowledge of what others affirmed. Similarly, we said regarding the report: Whoever added a meaning from the Messenger of Allah, peace be upon him, was a witness, and whoever did not affirm it had no meaning in that. (27) From it: What was narrated from Amir Al-Sha'bi, he said: From Jabir bin Abdullah that he was traveling on a camel of his that had become exhausted. He said: The Messenger of Allah caught up with me and struck it, and said: «Go». So it walked a pace the likes of which it had not walked. Then he said: «Sell it to me for an ounce». So I sold it to him for an ounce and stipulated its use for carrying me to my family. When I reached my family, I came to him with the camel, and he paid its price in cash. I returned, then he sent after me, saying: «Do you think I bargained with you to take your camel? Take your camel and your dirhams, for they are yours». And Al-Muttalib bin Hantab from Jabir bin Abdullah, he said: The Messenger of Allah bought a camel from me and lent me its back to Medina.",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 21
  },
  {
    "serial_number": "3910003",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 346,
    "volume_number": 1,
    "text": "Al-Muzani said: This bears several interpretations: Among them - That this was permissible before he, peace be upon him, said regarding the condition of Barirah's masters upon Aisha that the Wala' (loyalty/inheritance) is theirs: «What is the matter with people who stipulate conditions that are not in the Book of Allah?! Whoever stipulates a condition not in the Book of Allah, it is void». The meaning of one who frees... is that he has the Wala', and the meaning of one who owns a camel... is that he has its back. So what Jabir said would be abrogated, and what the Messenger of Allah clarified of the invalidity of the condition would be abrogating. Among them - That it was a promise to Jabir without a contract; if he wished he did it, and if he wished he didn't. Among them - That there was no promise, and the purchase was absolute, and no promise before that. When the Messenger of Allah bought it, he graciously granted its back to Jabir. I do not know of any disagreement among Muslims that whoever owns a camel has the right to ride it, sell it, and rent it out, and that it is not permissible to stipulate preventing him from what is his in the contract of purchase. In that is evidence for one of the aspects we described, and success is with Allah. (28) From it: What was narrated from Jabir, he said: We had surplus land, so the Messenger of Allah said to us: «Whoever has land, let him farm it, or grant it to his brother, or let it be». Al-Muzani said: It bears what the hadith of Usama from the Prophet, peace be upon him: «Riba is only in credit» bore; he was preceded by the question and heard the answer. It implies that the Prophet might have been asked about the sharecropping (Mukhabarah) they used to do, so the Prophet said: «Whoever has land, let him farm it, or grant it to his brother, or let it be». The Prophet says: Leaving it is better than sharecropping it; because Mukhabarah involves renting the land for a portion of what comes out of it according to us, so it is a corrupt rental and an unknown risk (Gharar). So the Prophet forbade that. The evidence for that is: That Rafi' narrated that the Prophet, peace be upon him, forbade renting land. It was said to him: For gold and silver? He said: No. This is an answer from the Messenger of Allah, peace be upon him. Scholars have permitted renting houses, and lands are like them in analogy.",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 22
  },
  {
    "serial_number": "3910004",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 347,
    "volume_number": 1,
    "text": "(29) From it: What was narrated from Abdullah bin Al-Daylami, from his father, he said: I came to the Prophet, peace be upon him, with the head of Al-Aswad Al-Ansi the liar. We said: O Messenger of Allah, you know who we are? And where we are from? So to whom do we belong? He said: «To Allah and to His Messenger». We said: O Messenger of Allah, we have grapes, what should we do with them? He said: «Dry them as raisins». We said: What should we do with the raisins? He said: «Soak them in the morning and drink in the evening, and soak them in the evening and drink in the morning. Soak them in skins, and do not soak them in earthenware jars; for if it stays long after squeezing, it becomes vinegar». Al-Muzani said: There is nothing in his saying: «Soak them in the morning and drink them in the evening, and soak them in the evening and drink them in the morning» that implies the prohibition of drinking it after that while it is sweet because it intoxicates. If it were only according to the description he described in the phrasing, and whatever exited the phrasing was prohibited, it would be prohibited for us to drink it at lunch or dinner, and it would never be lawful except at lunch or dinner. Since it is lawful at other than lunch and dinner, it indicates that he did not prohibit what fell outside the description. Since the prohibition of the Prophet, peace be upon him, regarding Nabeedh is if a large amount intoxicates, the cause of its prohibition was intoxication. It is possible that the proximity of what he described of Nabeedh drunk at lunch and dinner allows avoiding leaving it until it becomes strong, entering the limit of prohibition. So he took precaution with what is clearly lawful due to the proximity of time from its making, and success is with Allah. (30) From it: What was narrated from Rafi' bin Khadij, he said: The Messenger of Allah, peace be upon him, said: «The cupper and the cupped have broken their fast». And I heard the Messenger of Allah, peace be upon him, saying: «The earning of a cupper is wicked (Khabith), the dowry of a prostitute is wicked, and the price of a dog is wicked». Al-Muzani said: It bears several meanings: Among them - That the cupper and the cupped were hypocrites so they broke their fast, so the Messenger of Allah informed his companions about them by Allah's revelation informing him",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 23
  },
  {
    "serial_number": "3910005",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 348,
    "volume_number": 1,
    "text": "of that from them. It is possible that they were believers who ate after dawn without knowing, so the Messenger of Allah said: «The cupper and the cupped have broken their fast» to inform that they must make it up. It is possible that they fell into backbiting their brother, so he, peace be upon him, said: «The cupper and the cupped have broken their fast»; i.e., they ate the flesh of their brother, thus breaking their fast. Allah, Mighty and Majestic, said in His Book: (Would one of you like to eat the flesh of his brother when dead?) [Al-Hujurat: 12]. Not that cupping by the cupper and the cupped is breaking the fast. That is because Allah, Glorious is His praise, made fasting refraining from food, drink, and intercourse. He, Blessed and Exalted, said: (It has been made lawful for you the night preceding fasting to go to your wives) [Al-Baqarah: 187], and He said: (and eat and drink until the white thread of dawn becomes distinct to you from the black thread [of night]. Then complete the fast until the sunset) [Al-Baqarah: 187]. This is the meaning of fasting. There is no breaking of the fast in what comes out of the anus, genitals, or body such as excrement, madhiy, wadi, unintentional wet dream, sweat, blood, and other things from the body. Were it not for the report from the Messenger of Allah, peace be upon him: «Whoever is overcome by vomiting, no makeup is upon him, and whoever induces vomiting, upon him is makeup», it would have been the same. So inducing vomiting was specific. Do you not see that if food or drink enters his throat while forced, or a woman is forced into intercourse, that is breaking the fast? If what came out of the throat were like it, then being overcome by vomiting while forced would be breaking the fast. Since being overcome by vomiting is not breaking the fast, doing it intentionally or under duress would be the same, were it not that the Prophet, peace be upon him, made inducing vomiting a breaker of the fast. So it became specific, and there is no analogy on the specific. (31) From it: What was narrated from Abdullah bin Amr bin Al-Aas, he said: The Messenger of Allah, peace be upon him, said: «Convey from me even a verse, and narrate from the Children of Israel and there is no harm, and whoever lies about me intentionally, let him take his seat in the Fire».",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 24
  },
  {
    "serial_number": "3910006",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 349,
    "volume_number": 1,
    "text": "Al-Muzani said: Its meaning according to us, and success is with Allah, is that when he said: «and narrate from the Children of Israel and there is no harm», he obliged that nothing be accepted from him except trustworthy from trustworthy; because what is accepted from him is religion by which Allah, Glorious is His praise, is worshipped. As for what is narrated from the Children of Israel, there is no religion in accepting it by which Allah is worshipped, so he is not required to seek trustworthiness in it as he seeks it in the Hadith from the Messenger of Allah, peace be upon him. Not that in that is permission to accept from a narrator reporting from the Children of Israel one whose hadith he deems a lie; because it was narrated that whoever narrates a hadith from one he sees as a liar is one of the two liars. Because he, peace be upon him, does not permit lying about the Children of Israel or others. He warned against narrating anything but the truth, and against accepting anything except from known truthful people. He did not make this investigation [obligatory] in the report from the Children of Israel, not that he permitted accepting the hadith of liars, nor that he made a sin in that. (32) From it: What was narrated from Abdullah bin Masud, he said: The Messenger of Allah, peace be upon him, sent an expedition. A man from the polytheists took refuge in a tree, so he ordered the tree to be burnt. That reached the Prophet, peace be upon him, so he said: «I was not sent to punish with the punishment of Allah. I was only commanded to strike necks and tighten bonds». Al-Muzani said: The meaning of what he, peace be upon him, forbade, and success is with Allah: Is that he forbade punishing one who is captured with the punishment of Allah. There is no prohibition in that against fighting with fire. The punisher only punishes the one he has power over, so he was in the meaning of one who is in his hands. And his saying: «I was only sent to strike necks and tighten bonds», and that is only regarding the one overpowered. In that is evidence that he only forbade burning him because he became in the meaning of the overpowered. Trees do not feel torture. The Prophet, peace be upon him, burnt the properties of Banu Nadir, and said to Usama: «Go to Yubna in the morning then burn». Only a possessor of a soul feels pain. Do you not see that the Prophet said: «Whoever kills a sparrow without its right, will be held accountable for it on the Day of Resurrection»? It was said:",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 25
  },
  {
    "serial_number": "3910007",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 350,
    "volume_number": 1,
    "text": "O Messenger of Allah, what is its right? He said: «That you slaughter it and eat it, and not cut off its head and throw it away». So he forbade torturing it, and there is no torture in non-animals. It became clear by that, that what he forbade regarding burning in the tree was the one burnt in it while having power over him. And success is with Allah. (33) From it: What was narrated from Ibn Umar, he said: The Messenger of Allah, peace be upon him, said: «The two parties to a sale have the option as long as they do not separate». And from Abdullah bin Masud that he sold a slave girl to Al-Ash'ath bin Qays, and they disagreed on the price. Abdullah said: Appoint between me and you whomever you wish. He said: You are between me and yourself. He said: Then I judge between me and you what the Messenger of Allah, peace be upon him, judged: The assertion is the assertion of the owner of the commodity if it is standing in its essence (intact), or they return [the sale]. Al-Muzani said: Each hadith stands by itself and has a different meaning. As for the hadith of Ibn Umar from the Prophet: The two parties are agreed on the sale and price, so the Prophet affirmed the option, so whichever of them wishes may annul the sale as long as they do not separate. If they separate, neither has an option to annul the contract except for a cause other than the contract, such as a defect or otherwise. And the hadith of Ibn Masud regarding the two parties if they disagree even if they separated: He made the seller's commodity not leave his hands except by his word, and prohibited the buyer's price from leaving his ownership except by his word. The seller claimed much of the price as his property for his commodity, and the buyer claimed its ownership for a small price. Each of them is a claimant and a defendant. So each of them swears to his companion and is absolved of his companion's claim. Confirming that is the Prophet's saying: «The burden of proof is on the claimant, and the oath is on the defendant».",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 26
  },
  {
    "serial_number": "3910008",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 351,
    "volume_number": 1,
    "text": "(34) From it: What was narrated from Ma'mar, from Al-Zuhri, from Saeed bin Al-Musayyib, from Abu Huraira, he said: The Messenger of Allah, peace be upon him, said: «Every child is born on Fitrah (natural disposition), until his parents make him Jewish or Christian or Magian; just as the animal is born whole, do you perceive in it any mutilation until you yourselves mutilate it?». Ma'mar said: I said to Al-Zuhri: Why do you narrate this while you are upon other than it? He said: We narrate what we heard. Al-Muzani said: The meaning of this according to me, and success is with Allah: Is that since Allah judges servants by their deeds, and lifted obligation from their young, He clarified that there is no obedience or disobedience for them in their deeds. When the Prophet said: «Every child is born on Fitrah», Fitrah does not escape one of two stations: Either it is on Islam; if it were so, it would be permissible for Muslims to be made Christian, Jewish, or Magian. Since it is not permissible for Muslims to be Christianized and this wording does not apply to them, that is invalid. The other station - That Fitrah is the Creation (Khilqah). Allah, Mighty and Majestic, said: (Originator [Fatir] of the heavens and the earth) [Al-An'am: 14], and He said: ([Adhere to] the fitrah of Allah upon which He has created [people] - no change should there be in the creation of Allah) [Ar-Rum: 30]. And a man says regarding a well: «I originated it (Fatartuha)»; meaning: I created it. This is the more appropriate of the two matters regarding the newborn, that he is upon the Creation, he has not reached what makes him a Muslim or non-Muslim by his action. So the Messenger of Allah made his ruling the ruling of his parents. The meaning of: «they make him Jewish» became: that his ruling is like their ruling; just as the ruling of the believer's newborn is like his ruling. So whenever the Jew's newborn comes of age and remains on Judaism, he disbelieves by his action. And if he accepts Islam, he exits the religion of his parents by his action. The evidence for that: That Al-Sa'b bin Jathamah said: I said: O Messenger of Allah, the people of the abodes of the polytheists are raided at night and we hit some of their offspring? He said: «They are from them». He says: They are in the meaning of their fathers, that there is no expiation or fine for them; just as there isn't for their fathers. There is no permission in this to kill children;",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 27
  },
  {
    "serial_number": "3910009",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 352,
    "volume_number": 1,
    "text": "because the Messenger of Allah forbade killing them when able to distinguish, but did not forbid killing them in night raids due to ignorance [of who they are]. What we described regarding the matter of the newborn being on Fitrah is evidence for what we said, and success is with Allah. Do you not see that the Prophet, peace be upon him, said: «Just as camels are born whole, there is no mutilated one among them, until you yourselves mutilate them»? Likewise, the newborn is on Creation, he does not conceive of disbelief yet until he reaches maturity and initiates disbelief. He is only called a Jew by the ruling of his father; just as the believer's newborn is called a believer by the ruling of his father. And success is with Allah.\nThe book is completed with the help of Allah and His beneficence.",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 28
  },
  {
    "serial_number": "3910010",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 353,
    "volume_number": 1,
    "text": "[Issues in Jurisprudence (Fiqh) (1)]\n(35) Al-Muzani said: People differed regarding the offspring of a domestic female donkey from a wild donkey. Al-Muzani said: Since it was produced from lawful and forbidden, I prohibited eating it due to the cause of the forbidden sharing in it. Likewise the offspring of a gazelle from a goat killed by a Muhrim (pilgrim), and the offspring of geese from vultures, and what resembles that. So understand it.\n(36) Issue: A man bought a slave girl from a man, but he [the seller] withheld the slave girl until he pays him the price. The buyer transgressed upon her while she was in the seller's hands and had intercourse with her. She became pregnant then died in the seller's hands. Al-Muzani said: The price drops from the buyer, and the seller has no claim against him for the intercourse if she was a non-virgin (Thayyib). If she was a virgin, whatever decreased from her price drops from the seller, and he returns the rest of the price.\n(37) Issue: Al-Muzani said: If a man buys a garment or a slave girl from a man, and a defect occurs in it with him, and he finds another old defect... then the buyer has the choice. If he wishes, he returns it and what he decreased of it, and if he wishes he keeps it and takes the compensation for the defect from him. The Kufan said: He has no way to return, and he has the value of the defect. Al-Shafi'i said it. Al-Muzani said: The analogy according to me is that he does not return it, based on their consensus that if the seller knew of the defect with him [the buyer], he would not have the right to return it and what he decreased of it. Likewise also, the buyer does not have the right to return it and what he decreased of it.\n(38) He said: I asked Al-Muzani about a man who appointed a man as an agent to sell a slave girl of his. The agent met him and said: I have sold the slave girl, but he hadn't sold her. Then he sold her after that? He said: The sale is valid; because the agency is still standing and has not been annulled. It was said: Is it not that when he said:",
    "foot_note": "1. Title added by me to the original.",
    "book_id": "955",
    "new_page_number": 29
  },
  {
    "serial_number": "3910011",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 354,
    "volume_number": 1,
    "text": "«I sold the slave girl» he informed him of the expiration of the agency regarding the sale, and he is now only an agent for receiving the price in his report? He said: Yes. It was said: Why then wasn't the sale invalid due to his admission of that? He said: Because his admission is false, and he remains upon what was contracted for him of agency until the principal initiates an annulment; just as if we guaranteed the agency and each of them admitted he is not an agent for his companion due to forgetfulness, then the agent remembered the agency, his sale is valid. Al-Muzani said: The more likely of the two matters is that his statement is a lie, and the sale is valid.\n(39) He said: It was said to Al-Muzani: What do you say regarding Salam (forward sale) in heads and eggs? He said: Permissible if he says: heads of rams or sheep, and eggs of chickens or geese. It was said: Even if that varies in size? He said: Even if that varies in size, by analogy to what they agreed upon regarding the difference in quality of wheat, and that if I made a Salam for good wheat, that is permissible. And the recipient of Salam is not owed except what the name «good» falls upon, even if that varies. So likewise what the names «eggs» and «heads» fall upon.\n(40) Issue of a brother owning his brother: Al-Muzani said: A questioner asked me about what Al-Shafi'i argued regarding a brother owning his brother. The closest thing that occurred to me at the time of this writing of mine: That there is no disagreement that Allah, Blessed and Exalted, obliged upon the parent provision and clothing for the child according to what is reasonable. Likewise there is no disagreement that the wealthy son has an obligatory maintenance for his chronically ill and poor father. They did not agree that Allah, Blessed and Exalted, obliged upon the wealthy brother the obligation of maintenance for the poor brother. Had the meaning of father to son and son to father been like the meaning of brother, the obligation would have been due to him from the brother as it was due from the father and from the son. Since their consensus on the obligation for the brother was lifted, and their consensus on the father for the son and the son for the father was not lifted, and that was not between",
    "foot_note": "1. In the original: «Akhlaf» then crossed out the Alif.",
    "book_id": "955",
    "new_page_number": 30
  },
  {
    "serial_number": "3910012",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 355,
    "volume_number": 1,
    "text": "brother and brother... it was likewise that the son does not own the father, nor the father the son; due to the greatness of what we described of the obligation of each of their maintenance upon the other. And the brother owning his brother was due to their exit from the great sanctity between father and son, and between son and father. And since the child and the child's child, however low, are like the child in prohibition (of marriage), and the mother and the mother's mother, however high, are like the mother in prohibition, the people of this column do not marry each other in any case ever. And brothers, if a son is born to one and a daughter to the other, it is permissible for them to marry; because their children became cousins. Likewise the children of paternal aunts and maternal aunts. Not so the children of daughters nor mothers of mothers. When the two types separated in the way we described according to our companions' saying, likewise they separate in ownership. And the branches of a thing are like it. Since the branches of brothers can marry each other, but it is not permissible in the branches of daughters nor in mothers... they separated. Likewise ownership among brothers, its counterpart is permissible, and it is not permissible among child and parent. This is what occurred to me, and that did not satisfy me as I desire. And success is with Allah.\n(41) Issue in Divorce: Al-Muzani said regarding a man who is told: «Is your wife divorced?», and he said: «Yes»: The Medinan says divorce is binding on him. Al-Muzani said: What I memorize from the Kufan is likewise. Al-Muzani said: The analogy according to me is that that is binding in judgment; because the statement of the first had no meaning at the time of his speaking, its completion, and its interruption. So the speaker's saying: «Yes», and «Yes» is not a word of divorce nor resembles divorce, but is news. So if no divorce preceded from him, his saying: «Yes» in analogy does not establish anything between him and Allah. As for the judgment, it binds him. I seek Allah's guidance in that, and the analogy according to me is as I described.",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 31
  },
  {
    "serial_number": "3910013",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 356,
    "volume_number": 1,
    "text": "(42) Issue in Zihar: Al-Muzani was asked about one who said to his wife: «You are to me like my mother's back if I do not marry upon you, or I will surely marry upon you», should he be stopped from intercourse? Or when does Zihar attach to him? Al-Muzani said: The answer according to me, and success is with Allah: Is that Zihar is not obligatory upon him except in the state of inability to marry. It might be in the state of his dying. So it is as if he said: If that state happens, then you are to me like my mother's back. So no expiation is binding upon him; because it is only obligatory by Zihar and returning (to the wife), and according to Al-Shafi'i it is if he executed her divorce while sane and that was possible for him. This one has no possibility according to what I described. If his death was in a place far from what he set a limit for his marriage, it is not possible for him until he dies. The analogy on Al-Shafi'i's saying whereby he makes him break the oath by mistake, contrary to his saying regarding one who lifts the oath by mistake, the analogy on that is that he owes freeing a slave. It was possible for him not to return by divorcing her, so he returned by leaving her lawful for him.\n(43) Issue in Used Water: Al-Muzani said: People differed regarding a man who performs Wudu with water in a clean vessel: Does he have the right to perform Wudu with it a second time or not? The Medinan said: He performs Wudu with it if he finds no other. Al-Shafi'i, the Kufan, and the Basran refused that. Al-Muzani said: The analogy according to me is that he does not perform Wudu with it nor drink it, due to their consensus that if he finds other water, it does not suffice him. If it sufficed in its previous state, finding other water would not harm it. Another proof: Since they agreed that if I have enough water to perform Wudu, and I fear thirst, I perform Tayammum and do not perform Wudu with it, keeping it for my lips, this was evidence",
    "foot_note": "1. The word «upon you» is crossed out in the original.",
    "book_id": "955",
    "new_page_number": 32
  },
  {
    "serial_number": "3910014",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 357,
    "volume_number": 1,
    "text": "that if drinking it were permissible after performing an obligation, they would have ordered me to perform Wudu with it in a clean vessel, so I perform my obligation of Wudu and there remains for my lips what suffices me. Since this was not permissible, it indicated that it transitioned from its first state in what I say. And success is with Allah.\nAnd may Allah bless Prophet Muhammad and his family and grant them peace.",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 33
  },
  {
    "serial_number": "3910015",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 358,
    "volume_number": 1,
    "text": "[Additions of Abu Ishaq from Poetry and Wisdom (1)]\n(44) Abu Ishaq Al-Warraq recited to me, he said: Abu Al-Hussein Al-Katib recited to me:\nFear Allah and hope in Him for every distress ... And do not obey the persistent soul lest you regret\nAnd be between these two, fear and hope ... And rejoice in Allah's pardon if you are a Muslim\nWhen my heart hardened and my tribulation prolonged ... I made my hope a ladder to Your pardon\nWere it not for You, a worshipper would not stand (2) against Iblis ... How so when he misled Your chosen one, Adam?!\nIf You pardon me, You pardon a rebel (3) ... An oppressor, unjust, never leaving sin\nAnd I commit the sin knowing its magnitude ... And I know that Allah is Higher and Greater\nMy sin seemed great to me, but when I compared it ... To Your pardon, my Lord, Your pardon was greater\n(45) He said: And Abu Al-Hasan also recited to me:\nWealth raises a house that has no pillars ... And poverty destroys the house of glory, scandalous\nAnd praise is the best garment you wear ... So wear for yourself the garment of praise, O friend (4)",
    "foot_note": "1. Title added by me to the original. \n2. Thus in the original, and in biographical books: «Yaghwa» (be misled), and the established is more correct, and Allah knows best. \n3. Thus in biographical books, and its face was not clear to me in the original. \n4. One page remained from the original containing some verses I could not read, and its image is in the list of manuscript images.",
    "book_id": "955",
    "new_page_number": 34
  },
  {
    "serial_number": "3910016",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 359,
    "volume_number": 1,
    "text": "[Addition of two texts from Al-Khatib Al-Baghdadi for Al-Muzani (1)]\n(46) Al-Khatib Al-Baghdadi extracted in «Al-Faqih wal-Mutafaqqih» (2/29 - 35) saying: Abu Ibrahim Ismail bin Yahya Al-Muzani has exhaustive speech regarding those who denied asking about what has not happened. I present it due to the many benefits and abundant gains it contains: Abu Al-Hasan Muhammad bin Ahmad bin Umar Al-Sabuni told us, Abu Sulayman Muhammad bin Al-Hussein bin Ali Al-Harrani told us, Abu Ali Ahmad bin Ali bin Al-Hasan bin Shu'ayb Al-Mada'ini told us, he said: Al-Muzani said:\nIt is said to those who denied questioning in researching what has not happened: Why did you deny that? If they say: Because the Messenger of Allah, peace be upon him, disliked questioning... It is said: He also disliked it after questions were raised to him, because he disliked that Allah would impose obligations due to questioning and burden his nation, out of his compassion and mercy for them. That [fear] was lifted with the lifting [death] of the Messenger of Allah, peace be upon him, so no obligation happens after him ever. If they say: Because Umar denied asking about what has not happened... It is said: His denial might bear the aspect of obstinacy and sophistry, not understanding (Fiqh) and benefit. It was narrated that he said to Ibn Abbas: «Ask whatever appears to you; if we have it [we answer], otherwise we ask others about it from the companions of the Messenger of Allah, peace be upon him». Just as it was narrated from Ali regarding his denial of Ibn Al-Kawwa' asking out of obstinacy, and he ordered him to ask for understanding. It was narrated from Umar, Ali, Ibn Masud, and Zaid regarding a man giving his wife the choice [of divorce], so Umar and Ibn Masud said: «If she chooses her husband, nothing happens, and if she chooses herself, it is one [divorce] and he possesses the right of return». And",
    "foot_note": "1. This chapter I added from myself.",
    "book_id": "955",
    "new_page_number": 35
  },
  {
    "serial_number": "3910017",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 360,
    "volume_number": 1,
    "text": "Ali said: «If she chooses her husband, it is one [divorce] and he possesses the right of return, and if she chooses herself, it is one irrevocable». And Zaid bin Thabit said: «If she chooses herself, it is three, and if she chooses her husband, it is one irrevocable». They all answered regarding two matters, one of which did not happen. If answering about what didn't happen were disliked, they would only have answered what happened and remained silent about what didn't. Also from Zaid that he said to Ali regarding the Mukatab (slave buying freedom): Would you stone him if he committed adultery? He said: No. He said: Would you accept his testimony if he testified? He said: No. So Zaid asked him and Ali answered him regarding what hadn't happened, based on understanding and insight. And from Ibn Masud in his questioning of Abidah Al-Salmani: «Do you see? Do you see?». We mentioned previously what was narrated of Umar's saying to Ibn Abbas: «Ask me», and Ali's saying: «Ask me», and Abu Darda's saying: «Discuss these issues». Had this questioning not been permissible except for what happened, the companions of the Prophet, peace be upon him, would not have engaged in an answer that is impermissible ever, Allah willing. It is said to him: Is it not upon every Muslim to seek the obligations in purity, prayer, zakat, fasting, and the like from the Book and Sunnah before that [situation] befalls, and it is religion? If he says: Yes... It is said: Then how is it permissible to seek that in some of the religion and answer in it, and not permissible in some, while all of it is religion?! It is said to him: Is the issue whose answer you denied before it happens free from having a hidden ruling that cannot be reached except by reflection and deduction, or does it have no ruling? If it has no ruling, there is no face for that, what is the point of the question in it whether it happened or not? If it has a ruling that cannot be reached except by debate and deduction, then proceeding to uncover the hidden, knowing it, and preparing it for the issue before its occurrence is better. So if it occurs, its ruling is known, so right reaches its people thereby, and the oppressor is prevented from",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 36
  },
  {
    "serial_number": "3910018",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 361,
    "volume_number": 1,
    "text": "his oppression. That was better or superior than pausing until reflection on the issue is correct at the time of disputation. That might be slow, and in pausing there might be harm preventing the adversary from his right, preventing lawful intimacy, and leaving the oppressor upon his oppression. They, or some of them, likened the occurrence - as reached me - if it happens to necessity, and the answer in it to eating dead meat. So they permitted the answer in the occurrence just as they permitted dead meat in necessity. It is said to them: Do you claim that what we mentioned of your narrations from the companions of the Messenger of Allah, peace be upon him, regarding what they answered of what hadn't happened, and their addressing the answer of what they were not asked about, that they became thereby in the meaning of one who ate dead meat without necessity? It is said to them: A man fearing death for himself and being ordered to revive it by eating dead meat does not resemble the answerer except regarding what is lawful for the owner of the issue. If this analogy held, then if necessity befell a man, eating dead meat would be lawful for another; just as if an issue befell a man, the answer to the issue would be lawful for another. The worthier of the two analogies, if it is permissible to analogize on dead meat, is that the ignorant one whom the issue befell is more entitled to the answer by which he pushes away the harm of the issue from himself; just as by the necessity of the distressed, dead meat becomes lawful for him to push away the harm of necessity from himself. Al-Muzani said: If they, or some of them, say: We only claimed that if the issue occurs and the scholar is asked about it, he is like the distressed, so he must answer just as the distressed must eat dead meat... It is said to them: Then your narration from a hundred and twenty of the companions of the Messenger of Allah, peace be upon him, when asked - this one referred the issue to that one until the issue circled and returned to the first, necessitates in your saying that they abandoned what Allah obliged upon them; because the distressed is obliged to revive himself with dead meat and not kill it by leaving eating dead meat. The companions of the Messenger of Allah, peace be upon him, abandoned what was obliged upon them in the meaning of your saying!",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 37
  },
  {
    "serial_number": "3910019",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 362,
    "volume_number": 1,
    "text": "It is said to them: Isn't it only obligatory on them to answer the one whom it befell; so he repels his ignorance by it, and knows by the answer what is forbidden to him and lawful? If he says: Yes... It is said to him: The issue has returned to the fact that necessity by another obliged the answer upon him, so likewise due to the necessity of the distressed by another, eating dead meat should be obligatory upon him, otherwise they are distinct and the answer in the issue does not resemble dead meat. It is said to him: Is it not that if the issue occurs and the scholar is asked about it, answering becomes lawful for him by the question; just as if necessity befalls him, eating dead meat becomes lawful for him by compulsion? If he says: Yes... It is said: And likewise if the question is lifted, the answer becomes forbidden again; just as if compulsion is lifted, dead meat becomes forbidden again? If they say: Yes... It is said to them: Why did you ask about the answers of the past people and filled books with them while they are forbidden to you, and only became lawful for the scholar by the question, then became forbidden by the lifting of the question; just as dead meat became lawful for the distressed by compulsion, then became forbidden by the lifting of compulsion? If they say: Because that question and answer had happened... It is said: Likewise compulsion and eating dead meat by compulsion had happened, so what is the difference between that if the answer according to you is analogous to dead meat? If they say: That is merely a narration and not a question or answer... It is said to them: Then there is no meaning in what you narrated to be used as evidence for Fiqh and knowledge regarding what has not descended? If they say: Yes... they established the narration in place of the answer, and prohibiting question and answer regarding what didn't happen becomes binding on them, which is a contradiction of their statement. If they say: No meaning more than narration... It is said: Then there is no difference between narrating what doesn't harm and what doesn't benefit, and between what you narrated of the answers of the companions of the Messenger of Allah, peace be upon him. So what is the meaning of what jurists and scholars narrated from the predecessors, then from the successors and their following the answers of the companions of the Messenger of Allah, peace be upon him?",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 38
  },
  {
    "serial_number": "3910020",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 363,
    "volume_number": 1,
    "text": "It is said to them: Do you see if a Magian came to you from his country, desiring Islam, loving Muhammad, peace be upon him, and said: Teach me entry into Islam. So you taught him, and he entered it. Then he said: I am returning to my country, so what is upon us of purity so I can be knowledgeable of it before the entry of prayer time? And what necessitates Ghusl and breaks purification? And what is prayer? And what invalidates it? And what is the ruling of increase in it, decrease from it, and forgetfulness in it? And what is in ten dinars and a hundred dirhams of Zakat? And what is fasting? And what is the ruling of eating in it intentionally or forgetfully? And what is upon one of us who is sick, old, or weak? And is there harm in [exchanging] a dirham for two dirhams? And what contains retribution of blood and wounds and the ruling of mistake? And are men and women equal in that? For I am returning to my country, and my family and tribe are awaiting my return for their Islam, so I and they would be knowledgeable of our religion, acting by it and drawing close to Allah, and you be rewarded for it. All that is clear to you, you do not doubt it. Is it permissible for them to teach him that? Or do you say: We will not inform you until an occurrence befalls you, breaking his enthusiasm thereby, and making his soul wicked due to his recent era of disbelief, leaving him on his ignorance? Or do you seize the opportunity of his desire for Islam, and the Islam of those awaiting him, and teaching the ignorant what they do well of knowledge, while it was narrated from the Prophet, peace be upon him: (Whoever is asked about knowledge and conceals it, will be brought on the Day of Resurrection bridled with a bridle of fire)? If they say: We teach him that before it occurs... they abandoned their saying; because some of that is principle and some is analogy. If they say: We teach him some even if it didn't occur, and leave some until it occurs... It is said: What is the difference between that, while all of it is religion? Look, may Allah have mercy on you, at what is in your hadiths which you collected, and seek knowledge from the people of Fiqh, you will be Faqihs (jurists), Allah willing.",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 39
  },
  {
    "serial_number": "3910021",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 364,
    "volume_number": 1,
    "text": "(47) And Al-Khatib extracted in «Al-Faqih wal-Mutafaqqih» (2/136 - 137), saying: Muhammad bin Ahmad bin Umar Al-Sabuni told us, Abu Sulayman Muhammad bin Al-Hussein bin Ali Al-Harrani told us, Ahmad bin Ali bin Al-Hasan bin Shu'ayb Al-Mada'ini told us, he said: Al-Muzani said: It is said to one who ruled by Imitation (Taqlid): Do you have proof for what you ruled? If he says: Yes... he invalidated Imitation; because the proof necessitated that for him, not Imitation. If he says: Without proof... It is said to him: Why then did you shed blood, permit private parts, and destroy wealth, while Allah forbade all that, so you permitted it without proof? If he says: I know that I was correct even if I didn't know the proof; because my teacher is among the senior scholars, and I saw him advanced in knowledge, so he didn't say that except with a proof hidden from me... It is said: Then imitating your teacher's teacher is worthier than imitating your teacher; because he does not speak except with a proof hidden from your teacher just as your teacher didn't speak except with a proof hidden from you? If he says: Yes... he leaves imitating his teacher to imitating his teacher's teacher, and likewise whoever is higher until he ends at the Scholar from the companions of the Messenger of Allah, peace be upon him. If he refuses that... he contradicted his statement. It is said to him: How is it permissible to imitate one who is smaller and less knowledgeable, and not permissible to imitate one who is bigger and more knowledgeable? This is contradictory! If he says: Because my teacher, even if smaller, has gathered the knowledge of those above him to his knowledge, so he is more insightful regarding what he took, and more knowledgeable regarding what he left... It is said: Likewise whoever learned from your teacher has gathered the knowledge of your teacher and the knowledge of those above him to his knowledge, so imitating him and leaving the imitation of your teacher becomes binding on you. Likewise, you are worthier to imitate yourself than your teacher; because you gathered his knowledge and the knowledge of those above him to your knowledge.",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 40
  },
  {
    "serial_number": "3910022",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 365,
    "volume_number": 1,
    "text": "If he follows his saying... he makes the smaller and whoever comes later of minor scholars worthier of imitation than the companions of the Messenger of Allah, peace be upon him. Likewise, the Companion must imitate whoever is below him, and likewise imitating the higher the lower forever in the analogy of his saying, along with what binds him of correcting the one who imitated other than his teacher in faulting his teacher, thus becoming faulty to his teacher and his imitation of him.",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 41
  },
  {
    "serial_number": "3910023",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 366,
    "volume_number": 1,
    "text": "Samples of Manuscript Images",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 42
  },
  {
    "serial_number": "3910024",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 367,
    "volume_number": 1,
    "text": "Title page of the Zahiriyah copy symbolized by the letter (Z)",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 43
  },
  {
    "serial_number": "3910025",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 368,
    "volume_number": 1,
    "text": "The first page of the Zahiriyah copy symbolized by the letter (Z)",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 44
  },
  {
    "serial_number": "3910026",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 369,
    "volume_number": 1,
    "text": "The last page of the Zahiriyah copy (Z)",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 45
  },
  {
    "serial_number": "3910027",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 370,
    "volume_number": 1,
    "text": "Title page of the Suleimaniyah copy symbolized by the letter (S)",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 46
  },
  {
    "serial_number": "3910028",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 371,
    "volume_number": 1,
    "text": "The first page of the Suleimaniyah copy (S)",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 47
  },
  {
    "serial_number": "3910029",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 372,
    "volume_number": 1,
    "text": "Image documenting the comparison with the Bulqini copy on plate (19) of the Suleimaniyah copy (S)",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 48
  },
  {
    "serial_number": "3910030",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 373,
    "volume_number": 1,
    "text": "The last page of the Suleimaniyah copy (S)",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 49
  },
  {
    "serial_number": "3910031",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 374,
    "volume_number": 1,
    "text": "Title page of the Azhariyah copy symbolized by the letter (Z)",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 50
  },
  {
    "serial_number": "3910032",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 375,
    "volume_number": 1,
    "text": "The first page of the Azhariyah copy (Z)",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 51
  },
  {
    "serial_number": "3910033",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 376,
    "volume_number": 1,
    "text": "The last page of the Azhariyah copy (B)",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 52
  },
  {
    "serial_number": "3910034",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 377,
    "volume_number": 1,
    "text": "The first page of the Azhariyah copy symbolized by the letter (B)",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 53
  },
  {
    "serial_number": "3910035",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 378,
    "volume_number": 1,
    "text": "The last plate of the Azhariyah copy (B)",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 54
  },
  {
    "serial_number": "3910036",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 379,
    "volume_number": 1,
    "text": "The first page of the Egyptian National Library copy (B 2)",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 55
  },
  {
    "serial_number": "3910037",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 380,
    "volume_number": 1,
    "text": "The last page of the Egyptian National Library copy (B 2)",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 56
  },
  {
    "serial_number": "3910038",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 381,
    "volume_number": 1,
    "text": "Title page for the copy of the Book of Commands and Prohibitions by Al-Muzani",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 57
  },
  {
    "serial_number": "3910039",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 382,
    "volume_number": 1,
    "text": "The first page of the Book of Commands and Prohibitions by Al-Muzani",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 58
  },
  {
    "serial_number": "3910040",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 383,
    "volume_number": 1,
    "text": "The last page which I could not read from the Book of Commands and Prohibitions by Al-Muzani",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 59
  },
  {
    "serial_number": "3910041",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Commands and Prohibitions According to Al-Shafi'i",
    "edition": "First, 1440 AH - 2019 AD",
    "publisher": "Dar Madarij for Publishing - Riyadh",
    "page_number": 384,
    "volume_number": 1,
    "text": "Image of the part 'Naming those who narrated from Al-Muzani' by Ibn Al-Akfani",
    "foot_note": "None",
    "book_id": "955",
    "new_page_number": 60
  }
]