[
  {
    "text": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages\nAuthor: محمود بن إبراهيم الخطيب\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "new_page_number": 1
  },
  {
    "text": "sn: 1662\nbook_title: تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي\nbook_link: https://shamela.ws/book/989\nbook_id: 989\nauthor_name: محمود بن إبراهيم الخطيب\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/1648\nauthor_ID: 1648\neditor: Null\npublisher: Null\nedition: Null\npages: 82\nvolumes: Null\npagination: [الكتاب مرقم آليا غير موافق للمطبوع]\ncategory: التجويد والقراءات\ncategory_id: 5",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "new_page_number": 2
  },
  {
    "serial_number": "1159918",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Tajweed and Readings\nBook: Evaluating Methods of Teaching the Holy Quran in General and University Education Stages\nAuthor: Dr. Mahmoud bin Ibrahim Al-Khatib\n\nBook: Evaluating Methods of Teaching the Holy Quran in General and University Education Stages\nAuthor: Dr. Mahmoud bin Ibrahim Al-Khatib\n\nAuthor: Dr. Mahmoud bin Ibrahim Al-Khatib\n\n\n[The book is automatically numbered, not matching the printed version]",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 3
  },
  {
    "serial_number": "1159919",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages\nPrepared by Dr. Mahmoud bin Ibrahim Al-Khatib\nAssistant Professor, Department of Islamic Studies, Teachers College in Al-Qunfudhah\nHead of the Center for Educational Research and Studies\n\nIntroduction:\nPraise be to Allah, Lord of the Worlds, who sent down the Quran as guidance for mankind and clear proofs of guidance and criterion, guiding to that which is most upright. Peace and blessings be upon him after whom there is no prophet, our master Muhammad, peace be upon him, and upon his family and companions and those who followed their guidance until the Day of Judgment. He left us on a clear white path, its night is like its day, no one deviates from it except he who is doomed.\nTo proceed:\nAllah Almighty has guaranteed the preservation of His Noble Book by His saying: {Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian} (Al-Hijr: 9). Allah Almighty has destined for carrying out this great trust in this era the government of the Custodian of the Two Holy Mosques, which has taken the Book of Allah as its basis in life and governance. It has cared for it with utmost care, and this has appeared clearly in multiple fields, including its recitation, Tajweed, memorization, organizing local and international competitions, establishing schools and colleges specific to it, printing and distributing it, translating its meanings, and disseminating it through every possible means.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 4
  },
  {
    "serial_number": "1159920",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "The Ministry of Islamic Affairs, Endowments, Da'wah and Guidance, represented by the King Fahd Complex for the Printing of the Holy Quran in Medina, has done well by holding a symposium on the care of the Kingdom of Saudi Arabia for the Holy Quran and its sciences, achieving numerous goals. Among these is introducing methods of teaching the Holy Quran and the possibility of benefiting from modern technology in doing so. I am honored to contribute to this blessed symposium by writing on the topic: \"Evaluating Methods of Teaching the Holy Quran in General and University Education Stages\".",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 5
  },
  {
    "serial_number": "1159921",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "Research Problem:\nGiven the development of teaching methods in general and the possibility of benefiting from these methods in teaching the Holy Quran, and the adherence of many teachers to inherited non-educational styles and procedures that take place in the classroom setting, there was a need to evaluate the prevailing methods of teaching the Holy Quran in general and university education to know their effectiveness and feasibility.\nThis matter requires posing the following questions:\nWhat are the prevailing methods of teaching the Holy Quran in general education? And what are their positives and negatives?\nWhat are the prevailing methods of teaching the Holy Quran in university education? And what are their positives and negatives?\nAre there differences between the different methods of teaching the Holy Quran in different stages of education?",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 6
  },
  {
    "serial_number": "1159922",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Importance of the Research:",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 7
  },
  {
    "serial_number": "1159923",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "The importance of the research is highlighted through the status of the Holy Quran in the lives of Muslims in general, as it represents the symbol of the unity of the Ummah and is a fundamental source in Islamic education and for every correct Islamic thought. It is the base upon which Islam rests in creed, legislation, and organization.\nSince the teaching of the Holy Quran has made great strides these days, where the government of the Kingdom of Saudi Arabia has given great importance to its teaching and emphasized the necessity of caring for its recitation, memorization, and precision; and since many of those who undertake teaching the Holy Quran are not educationally qualified and have no knowledge of modern educational methods of teaching in general, along with their lack of utilizing modern technologies in education—as most teachers in the elementary stage hold a diploma from the secondary teachers' institute or intermediate teachers' colleges, and most teachers of readings in teachers' colleges specifically hold the High Certificate in Readings—it was necessary to evaluate the methods followed in teaching the Holy Quran so that the results correspond to the effort exerted. For teaching the Holy Quran results in positive effects that help the recipient in his scientific and practical life, in addition to the great reward and recompense he attains and what nourishes...",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 8
  },
  {
    "serial_number": "1159924",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "...his soul with faith.\nBased on the important educational, instructional, and religious role of the Holy Quran, there becomes a pressing need to conduct research and studies to understand the methods of teaching the Holy Quran and evaluate them, by diagnosing the reality and measuring what has been achieved to correct areas of weakness and reinforce aspects of strength (1), and identifying the means that must be secured to improve teaching methods (2), to reach the optimal methods for teaching the Holy Quran with the possibility of benefiting from modern technology suitable for each stage of education. All this is due to the importance of the Quran in building a balanced Muslim personality that will lead the Muslim to occupy a leading position as the righteous predecessors were.\nThe researcher presents a questionnaire that can be used to evaluate the performance of the generous teacher in the classroom setting to reveal the methods followed in different stages of education.",
    "foot_note": "1. (1) Shahata, 1420 AH, 323.\n2. Ahmed, 1416 AH, 197.",
    "book_id": "989",
    "new_page_number": 9
  },
  {
    "serial_number": "1159925",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Study Terms:\nEvaluation: The process of issuing a judgment on the value of things, people, or subjects. It includes all aspects of the educational process, including teaching methods. It also implies improvement, modification, or development based on previously defined educational foundations and standards (1). It is a means used to diagnose reality and measure what has been achieved to correct areas of weakness and reinforce aspects of strength (2).",
    "foot_note": "1. (1) Rashid, 1408 AH, 214; Al-Bashir, 1416 AH, 86.\n2. Shahata, 1419 AH, 323; Abdul Qader, 1416 AH, 165.",
    "book_id": "989",
    "new_page_number": 10
  },
  {
    "serial_number": "1159926",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "Teaching Method: What the teacher follows of sequential, successive, and interconnected steps and procedures, adhering to them in classroom situations (1) to achieve a planned educational goal or set of goals (2) by delivering the subject matter to students' minds in the easiest ways and with the least time and expense (3).",
    "foot_note": "1. (1) Eid, 1420 AH, 18.\n2. (4) Qandil, 1418 AH, 155.\n3. (5) Abdul Qader, 1416 AH, 18; Jan, 1418 AH, 424.",
    "book_id": "989",
    "new_page_number": 11
  },
  {
    "serial_number": "1159927",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "Teaching (Instruction): Refers to the entire educational process, but intended here (in the research) is teaching or the role performed by the teacher in the educational process. Every teaching method has its nature and various elements intertwined in a single fabric that includes objectives, facilitating educational aids, lesson preparation style (1), and procedures followed to teach a group of learners in a specific time and under the conditions of various obstacles in the educational environment (2). The teaching process in reality is merely the product of a set of diverse teaching methods that achieve the purposes of the educational situation (3).",
    "foot_note": "1. (1) Al-Laqani, 1988, 220; Rushdi, 1983, 29-30.\n2. Al-Qa'id, 1414 AH, 218.\n3. Qandil, 1418 AH, 170.",
    "book_id": "989",
    "new_page_number": 12
  },
  {
    "serial_number": "1159928",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "The Holy Quran: It is the Book of Allah revealed to Muhammad, peace be upon him, whose recitation is an act of worship (1).",
    "foot_note": "1. (1) Al-Rumi, 1420 AH, 21.",
    "book_id": "989",
    "new_page_number": 13
  },
  {
    "serial_number": "1159929",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "General Education Stages: (In the research) this refers to the elementary, intermediate, and secondary stages in schools, excluding Quran memorization schools and schools of the General Presidency for Girls' Education.\nUniversity Education: Any education joined by those who have completed the secondary stage, to study educational and training programs in various theoretical and practical specializations, usually for a duration of four years.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 14
  },
  {
    "serial_number": "1159930",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "Theoretical Framework:\nThe Holy Quran is the word of Allah Almighty revealed to the master of mankind, peace be upon him, whose recitation is an act of worship (1). It has a unique structure and miraculous composition. Its recitation is a devotional act that refines the soul, grants it the ability to confront worldly life, and prepares it for the afterlife. Upon reciting it, we must adopt the etiquette of the Quran, including humility, submission, and purity, so that this penetrates the hearts of learners, and we become role models to be followed, observing the following principles during recitation:\nPronouncing letters from their articulation points with clarity of words and elucidation of meanings.\nObserving the rules of Tajweed regardless of the level of the listener to the recitation, because that is more conducive to simulation and imitation for beginner learners, while adhering to applying the rules of sound reading for advanced learners.\nKnowing the terms and signs present in the Mushaf and learning how to pause and how to act when forced to pause (2).\nControlling the words of the Holy Quran with diacritics; due to the extreme importance of this relating to matters of creed, because deviating a vowel from its place leads to changing the meaning, and corrupting the reading leads to making faith disbelief and truth falsehood.",
    "foot_note": "1. (1) Al-Rumi, 1420 AH, 21.\n2. Shahata, 1420 AH, 232.",
    "book_id": "989",
    "new_page_number": 15
  },
  {
    "serial_number": "1159931",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "Recitation from the Mushaf, and introducing learners to the script of words in it (Uthmani Script), and that Muslims have preserved this script for a wisdom we may not know, not because those who wrote it were ignorant of the rules of spelling.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 16
  },
  {
    "serial_number": "1159932",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "The teacher should observe the following principles for teaching and learning the Holy Quran at different stages:\n1. Prior Learning: The teacher usually listens in the Quran lesson to a blessed recitation of a group of verses that the learner has previously learned in the previous lesson. He can raise a set of questions about the general or specific ideas contained in the mentioned verses; so that he can link the previous to the subsequent if possible. Thereby, the teacher knows the points of weakness and gives them attention, and knows the points of strength so he does not waste his time on them.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 17
  },
  {
    "serial_number": "1159933",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "2. Introduction (Preparation): The teacher paves the way for the Surah or noble verses with an easy talk related to the subject of the lesson. It is possible to discuss with students through questions touching the content of the lesson, or the content of the previous lesson if it is related to the new lesson, by stimulating their stored information. This is to excite students and attract their attention to knowing the subject of the verses that will be recited (1), because questions are a means to uncover facts and acquire information, stimulate thinking, activate students, and encourage struggling students if given easy questions (2), for the question is the tool of knowledge as the Messenger of Allah, peace be upon him, said: «Knowledge is treasure troves, and questioning is their key» (3).",
    "foot_note": "1. (1) Musa, 1420 AH, 198.\n2. Jan, 1418 AH, 302-307.\n3. Al-Darimi, 1386 AH, Hadith No. 545.",
    "book_id": "989",
    "new_page_number": 18
  },
  {
    "serial_number": "1159934",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "3. Model Reading: The teacher reads the verses subject of the lesson a model recitation, chanted (Tartil), free of errors, observing the articulation of letters from their points, adhering to stop signs and the humility befitting the Quran, while students listen and look at the verses in their Mushafs. The reading can be repeated several times, with the help of a recorder in chanting the mentioned verses, to excite students and ward off boredom. The repetition of recitation depends on the students' level (1). \"Among what Muslim educational scholars noted is the necessity of chanting the Holy Quran such that letters and words appear in the reading with good Tajweed and perfected articulation points and pronunciation, because that helps in understanding the meaning. It is also necessary for venerating the Holy Quran. Scholars who wrote on Quranic sciences hold this view and advise reading with Tahqiq (precision/slow recitation) and Tartil (measured recitation) for their benefit in education. Tahqiq in reading is for exercising tongues and straightening words, and it is recommended to adopt it. Some mentioned that Tahqiq is for exercise, education, and practice, and Tartil is for contemplation, thinking, and deduction\" (2). After the model reading, the teacher can assign students silent (mental) reading, thereby preparing for loud reading, explanation, discussion, and analysis.",
    "foot_note": "1. (1) Musa, 1420 AH, 170.\n2. Yunus, 1999, 244.",
    "book_id": "989",
    "new_page_number": 19
  },
  {
    "serial_number": "1159935",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "4. Collective Reading with the Teacher (Suitable for Primary Stage): The teacher prepares students that he will read the Surah or text subject of the lesson part by part, and they must repeat after him every part he reads. Then he reads the text in parts, and monitors the children as they read after him. In this field, Muslim educational scholars noticed that collective rhythm and collective repetition arising from the gathering of boys excites them for learning and pushes them towards it. Such collective rhythm and chanting is advocated specifically by all language teaching scholars in early education stages (1).",
    "foot_note": "1. (1) Yunus, 1999, 243.",
    "book_id": "989",
    "new_page_number": 20
  },
  {
    "serial_number": "1159936",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "5. Competition in Collective Reading and Dividing Students According to Intellectual Abilities: The teacher tries to divide students into groups according to their seating in the classroom, where each group repeats what the teacher reads, then he assigns another group to repeat, and so on... to incite competition among them in mastering reading. They can be divided into groups according to their intellectual abilities, to teach them according to their capacities, taking into account individual differences among them in terms of achievement ability. In this field, Muslim educators say: The teacher must diagnose the nature of the learner in terms of intelligence and stupidity according to his capacity, and not burden him with what he cannot bear. If he is burdened, he despairs of acquiring knowledge, follows whims, and his education becomes difficult. In this, the teacher must limit the learner to the extent of his understanding (1). Regarding this, Imam Al-Ghazali says: \"Were it not for it [difference in understanding], people would not differ in understanding sciences, and they would not be divided into the dull who does not understand by explanation except after long fatigue from the teacher, and the intelligent who understands by the slightest sign and gesture, and the perfect from whose soul the realities of things emanate without instruction... and that is like the prophets\" (2).",
    "foot_note": "1. (1) Yunus, 1999, 245.\n2. 1420 AH, Vol 1 / 122.",
    "book_id": "989",
    "new_page_number": 21
  },
  {
    "serial_number": "1159937",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "6. Individual Reading: The teacher assigns a number of proficient students to recite the blessed verses subject of the lesson, then assigns others to recite. It is preferable that the largest possible number of class students read. The teacher must follow the students' reading and correct their mistakes. In his correction, he follows the method of dialogue and deduction which ultimately leads to the student discovering the mistake himself. He must not interrupt him during reading, but let him complete the verse, then search for the mistake. If the student discovers it, he continues reading; otherwise, the opportunity is left for another to discover it. If no one can do that, the teacher points it out (1). If the number of students in the class is large, especially in primary stages, the teacher seeks the help of a number of intelligent students to assist him in monitoring the reading of other students. Al-Ghazali says in this field: \"As for the first stage, the teacher in it had to teach a limited number of boys. If students increased in his Kuttab (school), he appointed a number of monitors (Areefs) proportionate to the number of students, so that each monitor had a small number of boys\" (2). This is what is called in modern education 'Peer Tutoring'.",
    "foot_note": "1. (1) Musa, 1420 AH, 176.\n2. Yunus, 1999, 246.",
    "book_id": "989",
    "new_page_number": 22
  },
  {
    "serial_number": "1159938",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "7. Importance of Meaning and Method of Discussing it: Meaning has great importance in every read material. Read material means nothing unless its meaning is understood and known through meaning. Reading is a means to understanding; it is not an end in itself. Therefore, the teacher in the Quran lesson must explain the blessed verses and their concepts an explanation commensurate with his students' abilities, so that learners can grasp the goals, rulings, and general and specific ideas indicated by the verses. This should be through the method of discussion and seeking help from various means, until learners realize that what they are learning relates to their beliefs and lives. Thus, the link between the noble verses and the reality of students' lives is achieved. Because the weakness of studying the Holy Quran in terms of recitation, understanding, contemplation, and memorization has made the Holy Quran retreat into a remote corner of the educational curriculum pillars in many Islamic countries, thus distancing life from the path of the Quran (1).",
    "foot_note": "1. (1) Madkour, 1991, 151.",
    "book_id": "989",
    "new_page_number": 23
  },
  {
    "serial_number": "1159939",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "Among the means useful in realizing the concepts of the Holy Quran are the blackboard and what it includes of illustration and explanation, as well as various educational aids, role-playing, and striking proverbs, as is clear in the stories of prophets and people. We should not overlook the role of documentary films, pictures, and maps in bringing perceptions closer, clarifying them, and giving them a vivid image. Documentary films can be useful in clarifying Quranic verses related to Hajj rituals, rites, and places, and can also be useful in conveying a vivid image of performing the obligation itself, and what Allah promised in the Holy Quran: {And proclaim to the people the Hajj [pilgrimage]; they will come to you on foot and on every lean camel; they will come from every deep and distant pass} (Al-Hajj: 27). It is useful to mention here that maps depicting the plans of battles mentioned in the Holy Quran, and the journeys of Muslim Mujahideen here and there, also play an important role in clarifying verses dealing with this battle or that, according to different concepts. Modern display means and boards of various types can also be used, such as magnetic boards, pocket charts, flannel boards, and enlarged illustrated boards with Quranic verses on them. In addition to considering...",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 24
  },
  {
    "serial_number": "1159940",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "...the chanting of students proficient in recitation as a means that pushes their brothers to raise the level of their performance (1).",
    "foot_note": "1. (1) Al-Zaabalawi, 1420 AH, 89; Al-Shafi'i, 1984, 283.",
    "book_id": "989",
    "new_page_number": 25
  },
  {
    "serial_number": "1159941",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "8. Extracurricular Activities Related to the Prescribed Quran Class: The clarity of the goal of studying the blessed verses and reciting them for learners in advance—meaning the learner knows in this class the goal of studying the noble verses (from-to) in the next class—is the best motivation for learners to research and refer to various research sources, to achieve the required goal, and participate positively in class activities. The teacher must focus on quality not quantity. The problem of quantity can be overcome by giving his students homework specific to the recitation lesson, or giving them questions they try to answer from the verses that will be recited, and practicing in their homes and at leisure the recitation of the verses that will be given.\nThis is the most important of what the researcher aspires to achieve in the Holy Quran lesson in different stages, each according to their abilities. Therefore, he designed a questionnaire (Appendix No. 2) to reveal the methods of teaching the word of Allah and their ways in classrooms for different levels in general and university education stages.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 26
  },
  {
    "serial_number": "1159942",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "Field Research Procedures\n\nResearch Sample:\nDeterminants of Research Selection: Since the aim of the research is to evaluate methods of teaching the Holy Quran in general and university education stages, individuals from the research sample were selected from all stages of general and university education. The education stages were divided into several categories (levels):\nLower grades of elementary stage (First, Second, and Third grades).\nUpper grades of elementary stage (Fourth, Fifth, and Sixth grades).\nIntermediate and Secondary stage.\nUniversity Education.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 27
  },
  {
    "serial_number": "1159943",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "Sample Description: The research sample consisted of (350) teachers in all stages, selected from several educational regions (Bisha, Muhayil, Al-Qunfudhah, Makkah Al-Mukarramah, Al-Lith, Al-Makhwah), and colleges and universities in (Riyadh, Al-Bahah, Jazan, Al-Qunfudhah, Makkah Al-Mukarramah, Abha, Madinah, Jeddah). A large group of questionnaires arrived, from which those not meeting conditions were excluded. The analysis included as a study sample (50) questionnaires for lower elementary grades (First, Second, and Third), (50) questionnaires for upper elementary grades (Fourth, Fifth, and Sixth), (60) questionnaires for intermediate and secondary stages, and (30) questionnaires for university education. Thus, the total number of questionnaires subject to analysis is (190) questionnaires.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 28
  },
  {
    "serial_number": "1159944",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "Research Tools: A special questionnaire was designed to evaluate methods of teaching the Holy Quran in general and university education stages after reviewing specialized references in general teaching methods and teaching methods for Islamic courses (Islamic Education, Sharia Sciences) and teaching and education books in general. Validity and reliability tests were conducted for the questionnaire in various ways according to the following:\nFirst - Validity: Before application, the questionnaire was presented to a group of specialists in education, teaching methods, measurement and evaluation, educational supervisors, and school principals, Appendix No. (1), to test the comprehensiveness and validity of the questionnaire to cover different methods of teaching the Holy Quran. After reviewing their opinions, discussing them, and benefiting from them, the questionnaire was designed in its final form (Appendix No. 1).\nSecond - Reliability: The same questionnaire (Appendix No. 2) was applied twice to a number of Quran teachers in different education stages in elementary, intermediate, secondary, and university education to test the reliability of the questionnaire through the correlation coefficient. It was found that the correlation coefficient is 0.86 according to Spearman's rank correlation coefficient, which indicates the validity of the sample individuals' responses.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 29
  },
  {
    "serial_number": "1159945",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "The questionnaires of these teachers were excluded from the research.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 30
  },
  {
    "serial_number": "1159946",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "First - Elementary Stage - Lower Grades (First, Second, and Third Grades): See Appendix (3) for Percentages\nPrior Learning Test: It is noted that the highest percentage was obtained by the first item, which is assigning proficient students to read the verses of the previous lesson first at the beginning of the classroom situation, but it did not rise to the degree of acceptance, as it obtained 44%, which is an unacceptable percentage.\nLack of interest by teachers in discussing with students the implications of words and the general meaning of the previous lesson according to the instructions of the Education Administration. Whereas explaining the general meaning of the Surah in a narrative style excites students to follow the lesson (1), and makes them recall the atmosphere of the Surah in general, leading to instilling correct Islamic concepts in their souls from a tender age, especially regarding creed. The short Surahs of the Holy Quran learned by students in the lower stage include all rulings brought by the Quran. Enemies of Islam teach their children love for their religion from a young age despite its deviation, so how about teaching a true religion?",
    "foot_note": "1. (1) Al-Zaabalawi, 1420 AH, 99.",
    "book_id": "989",
    "new_page_number": 31
  },
  {
    "serial_number": "1159947",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "Lesson Presentation: From the extracted percentages, the following is noted:\nA- Asking questions or telling a story to excite students' interest only obtained 36%, which is a low percentage, although the element of suspense is considered one of the most important factors on which Herbart's teaching method was based (1).\nB- Not giving students the opportunity for silent (mental) reading, although silent reading accustoms the student from the beginning to develop such a skill, especially since first-grade students specifically memorize Surahs by heart, so they can be assigned silent reading.\nC- Observing recitation principles received a high percentage reaching 100% in reciting the lesson with Tajweed, and good educational pauses as in items 9-11 of the questionnaire. The percentage of relying on the reading of proficient students first rose to 88%, which is a good percentage, although this was neglected at the beginning of the classroom situation.",
    "foot_note": "1. (1) Ahmed, 1416 AH, 117.",
    "book_id": "989",
    "new_page_number": 32
  },
  {
    "serial_number": "1159948",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "Despite this, the issue of applying Tajweed rules by students did not rise to more than 55%. However, it is required to accustom students to Tajweed reading from a young age so their tongues are trained on correct pronunciation of words, and getting used to letter characteristics like Tafkhim (heaviness) and Tarqiq (thinness), while overlooking what they cannot do. With the necessity of teachers paying attention to individual reading and starting with the proficient ones so they become role models for their colleagues, and in that is stimulation for competition and speeding up the recitation process (1).\nD- It is noted that collective loud reading reached 60%, and it is hoped to rise more due to the many benefits of collective reading in encouraging students, as it is a motivation for them to learn more.\nE- Lack of inclination towards group (Zumari) loud reading, where the percentage of teachers applying such reading only reached 42%, although Education Administration instructions encourage such type of reading to create a spirit of competition between different groups, where the teacher divides the class into two groups for example, listens to the first while noting who makes mistakes, then listens to the second group.",
    "foot_note": "1. (1) Musa, 1420 AH, 175.",
    "book_id": "989",
    "new_page_number": 33
  },
  {
    "serial_number": "1159949",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "Teachers do not tend to classify students into groups according to their abilities, although individual differences between students encourage the proficient and help the stumbling. The percentage of classifying students only reached 38%, which is an unacceptable percentage. (Kingsley) believes it is necessary for the teacher to distinguish between the gifted and non-gifted student, because not caring for the gifted accustoms them to laziness, whereas if left under normal teaching conditions, they accomplish only 40% of their potential energies (1). Teachers in this stage tend not to distribute students into groups despite their large number; 56% of teachers did not agree to this, although distributing students into groups facilitates the teaching process. Only 2% agreed to this, even though this method was used in the past by appointing a monitor (Areef) over each group from the intelligent ones, which is what the teaching assistant does these days, and is called in educational custom 'Peer Tutoring', and 42% were hesitant about it.",
    "foot_note": "1. (1) Al-Dush, 1418 AH, 62.",
    "book_id": "989",
    "new_page_number": 34
  },
  {
    "serial_number": "1159950",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "Formative Evaluation: The following is noted:\nTeachers do not follow sound educational methods in correcting mistakes, as 82% of teachers correct mistakes themselves. While the percentage of those who leave the opportunity for the reading student to correct himself when he errs in reading did not reach the acceptance level, amounting to 36% of teachers. 38% of teachers answered that another student corrects the mistakes. The correct way is that the opportunity is left for the student to correct himself after completing the verse (1) or the segment that can be paused at, by asking him about the letter or vowel he erred in, or the sign he did not observe (2). He is not asked about Tajweed rules at this stage, but is accustomed to applying Tajweed rules through dictation/inculcation (Talqin). If he is unable to do so, the opportunity is left for another colleague to correct the mistake. If everyone fails to correct, the teacher's role in correcting comes. In this is training for the student to discover his mistake or the mistake of others, and in it is attracting students' attention and stimulating the spirit of competition among them.",
    "foot_note": "1. (1) Musa, 1420 AH, 176.\n2. Shahata, 1420 AH, 231.",
    "book_id": "989",
    "new_page_number": 35
  },
  {
    "serial_number": "1159951",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "Lack of interest by teachers in discussing with students the implications of vocabulary, where the percentage of teachers using this procedure reached 26%, the percentage of discussing the general meaning 18%, the percentage of discussing general ideas 24%, and the percentage of discussing partial ideas 20%. While they tend towards it, as the percentages of not accepting these procedures at all ranged between 20-42% as shown in Appendix No. (3).",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 36
  },
  {
    "serial_number": "1159952",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "Use of Educational Aids: From the percentages mentioned in Appendix (3), the following is noted:\nFocusing on the use of educational aids on only two aids generally: the blackboard, whose usage percentage by teachers reached 68%, while the usage percentage of cassette tapes rose to 84%. Only 6% rejected these two means. It is preferable that the use of tapes mediates students' individual recitation after the recitation of the proficient ones to be an opportunity to raise their performance level (1). Using tapes diversifies reading and introduces students to the importance of tapes in learning, encouraging them to use them at home to raise their ability levels, especially using the Mu'allim Mushaf (Teaching Quran).\nThe use of various boards did not reach an acceptable percentage, as its usage reached 32%, although using different boards is important. Boards help the teacher reduce time wasted in writing on the chalkboard. The teacher can display an enlarged board or use a pocket chart to place a specific word or set of words, especially difficult words, and explain how to pronounce them.",
    "foot_note": "1. (1) Al-Zaabalawi, 1420 AH, 102.",
    "book_id": "989",
    "new_page_number": 37
  },
  {
    "serial_number": "1159953",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "As for transparencies, only 10% of teachers used them, whereas using the overhead projector is easy and accessible. Through it, the largest possible number of issues can be displayed in the least possible time, especially since transparencies, if movements and letters are colored in them, are the most effective means to convey information and correct mistakes. Verses can be photocopied from a teaching Mushaf, enlarged to the required size, and displayed using this device. This diversifies means, and the teacher can point via the enlarged board to the phonetic segments he pauses at.\nD. As for the language lab, the percentage of those who do not use it reached 66%, which is a relatively high percentage, and perhaps the percentage is much higher due to the lack of language labs originally in schools. But in this stage, in reality, the lab is not used for technical reasons, yet it is necessary because it helps the student if he uses it for correct reception without interference from others.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 38
  },
  {
    "serial_number": "1159954",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "E. As for films, they were not used generally, as the usage percentage reached 2%, although using films, especially in this primary stage of education, is important to excite students for the lesson as it links the student to place and image, such as a film about Eid Al-Adha prayer first, then explaining the sacrifice secondly on Eid Al-Adha as explained in Surah Al-Kawthar, or a film about the Levant, Yemen, and Mecca and the link between them in Surah Quraish... etc. Choosing the appropriate means enriches educational situations if used correctly, making it meaningful and functionally effective for students if suitable for students' ages, levels, and previous experiences related to new experiences provided by these means (1).",
    "foot_note": "1. (1) Al-Khatib, 1998, 44.",
    "book_id": "989",
    "new_page_number": 39
  },
  {
    "serial_number": "1159955",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "Reinforcement, Extracurricular Activity, Application, and Curricula. From Appendix (3) the following can be observed:\nTeachers tend towards reinforcement in the classroom situation, where the percentage of those who reinforce students' actions reached 56%. This percentage should be higher because reinforcement supports and encourages students and stimulates them to prepare for the class in the future. Because reinforcement is a stimulus leading to increased probability of repeating the response, the subject of reinforcement. Reinforcement can be verbal like correct, good... etc., or non-verbal by facial expressions or any understood movement (1). Reinforcement might also be material like prizes.\nTeachers do not tend to assign students to prepare for the lesson before giving it, perhaps due to their lack of confidence in students' abilities, but a student who knows the letter can spell and thus knows the pronunciation. In this is training for self-learning.\nTeachers believe that chanting the Holy Quran has a benefit in learning, thinking, and deduction, where the percentage of those who see that reached 82%.",
    "foot_note": "1. (1) Al-Khatib, 1998, 74-76.",
    "book_id": "989",
    "new_page_number": 40
  },
  {
    "serial_number": "1159956",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "As for linking the meanings of verses to general life, only 10% of teachers rejected it completely, yet only 50% of teachers agreed to it. Knowing that linking the meanings of verses to general life affects the future of this nation because the Holy Quran is life. The goal of the Holy Quran is building a balanced Muslim personality, an integrated Muslim society, and a united Muslim nation capable of achieving the goals and objectives of Islam (1) in realizing necessities, needs, and improvements while preserving religion, self, mind, money, and honor. So the Quran must be linked to life.\nE. Less than 50% of teachers use the inculcation (Talqin) method only in teaching the Holy Quran, where the percentage of those relying on the inculcation method only reached 46%. Although inculcation is the optimal method in teaching the Quran, because it is not permissible to narrate the Quran by meaning or Ijtihad, and mastering its recitation is an obligatory worship (2). Muhammad, peace be upon him, received the Holy Quran from Gabriel, peace be upon him, by inculcation. This does not prevent using other methods in teaching the Holy Quran, as Muslim educators criticized the inculcation method and the method of memorization without understanding, preferring over it the discussion and dialogue method (3), along with inculcation which is the basis of teaching the Holy Quran.",
    "foot_note": "1. (1) Madkour, 1991, 151.\n2. Eid, 1420 AH, 184.\n3. Mursi, 1982, 129.",
    "book_id": "989",
    "new_page_number": 41
  },
  {
    "serial_number": "1159957",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "Knowing that circulars of Education Administrations in the Kingdom - especially in Al-Qunfudhah Governorate - focus on teaching the Quran in the first grade specifically to be by inculcation, because students cannot read from the Mushaf well.\nF. Most teachers commit to completing the syllabus, where the percentage of those completing the syllabus reached 76%, and none of them said they do not complete the syllabus. This is a good thing for which teachers are thanked.\nG. 56% of teachers focus on students mastering reading regardless of completing the syllabus. However, the problem of not completing the syllabus can be overcome by following any appropriate method according to students' levels and abilities, either by advising them to join Quran memorization circles or assigning them homework... etc.\nH. As for holding competitions in mastering the Quran among students, no one rejected it, and the percentage of those holding competitions was 72%. This is an acceptable percentage, due to the effect of competitions in stimulating the spirit of competition among students, raising their levels, and serving the prescribed curriculum of the Holy Quran.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 42
  },
  {
    "serial_number": "1159958",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "Prior Learning Test: It is noted that teachers assign students with low abilities to read the verses of the previous lesson first at the beginning of the class with a percentage of 48%, which is greater than the percentage of assigning proficient students which reached 38%, unlike lower stage teachers who presented proficient students first. The percentage of assigning average ability students was lower, reaching 28%. The sound procedure is presenting proficient students first, then average abilities, then low abilities. Thus, it can be said: Teachers do not care for this axis.\nA decrease is noted in the percentage of discussing with students the implications of words contained in the previous lesson's verses, reaching 18%, and the percentage of discussing the general meaning with students reached 16%. While it was more appropriate for students to know the meanings of words contained in the verses and their general meaning or that of the Surah in general, because understanding the meaning of the Surah helps in speed of recitation. The student stumbling in reading finds it hard to understand the meaning and taste the Quranic style as the student's interest is confined to pronunciation not meaning (1).",
    "foot_note": "1. (1) Al-Zaabalawi, 1420 AH, 96.",
    "book_id": "989",
    "new_page_number": 43
  },
  {
    "serial_number": "1159959",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "Lesson Presentation: The following is noted:\nTeachers of this stage do not care about exciting students for the new lesson generally, where the percentage of those raising questions or telling a story reached 32%, which is lower than the lower grades percentage. We have explained the effect of exciting students in the educational process and preparing students' minds for the new lesson.\nTeachers of this stage do not give silent reading attention, although students in this stage can practice silent mental reading more than their counterparts in lower grades due to their better ability to read. The percentage of those assigning silent reading to students reached 36%, which is an unacceptable percentage. Knowing that silent reading facilitates loud recitation, as some consider it a prelude to it (1). A first-grade teacher might overlook silent reading, but it is necessary in upper elementary grades.\nTeachers of this stage do not care about revealing the general meaning of the new lesson's verses, where the percentage of those interested in revealing the general meaning reached 24%, which is an unacceptable percentage. It seems Quran teachers resort to assigning students to open their Mushafs directly without introductions.",
    "foot_note": "1. (1) Al-Zaabalawi, 1420 AH, 97.",
    "book_id": "989",
    "new_page_number": 44
  },
  {
    "serial_number": "1159960",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "Teachers' interest in reciting verses in multiple clear ways appears through recorded percentages, where the percentage of those reciting full verses with Tajweed reached 98%, those pausing at verse endings 68%, and those caring for vowel control 96%. These are acceptable percentages, although 38% of teachers mentioned they do not pause at verse endings, which is contrary to correct reading principles.\nE. There is a clear contradiction between the first item of prior learning test and item number (12), where the percentage of assigning proficient students to read the previous lesson at the start of class was 38%, while the percentage of those assigning proficient students to read after the teacher's recitation reached 98%. The principle is assigning proficient students.\nIt is noted that teachers do not acceptably tend to assign students to read randomly, where the percentage of random assignment (without order) reached 44%. While it is better for reading to be without order, as that always attracts the student's attention, expecting to be called to read at any time. This is an unacceptable percentage.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 45
  },
  {
    "serial_number": "1159961",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "Teachers in this stage (upper grades) do not tend to use collective loud reading, while lower grade teachers tended to use collective loud reading, reaching 60% in lower grades versus 34% in upper grades. Knowing that collective loud reading is necessary in this stage to help students simulate their peers in addition to dispelling the element of shyness from some.\nThe percentage of teachers asking students to apply Tajweed rules in their recitation reached 70%, which is more than their percentage in the lower stage which reached 54%. This might be due to Education Administrations emphasizing the necessity of caring for Tajweed rules in this stage. This percentage is acceptable, although applying Tajweed rules should be cared for better.\nTeachers of this stage do not tend to group (Zumari) reading, where the percentage of those applying it reached 22%, which is lower than their counterparts in the lower stage which reached 42%. Because group reading helps stimulate the spirit of competition between different groups and contains excitement and motivation for reading.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 46
  },
  {
    "serial_number": "1159962",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "Teachers of this stage do not tend to classify students into groups according to their intellectual abilities, where the percentage of teachers doing so reached 20%, which is lower than their counterparts in the lower stage. There is no harm in that. The Holy Quran has clarified to us the existence of individual differences between people; The Almighty said: {And He raised some of you above others in degrees} (Al-An'am: 165) and said: {Allah does not charge a soul except [with that within] its capacity} (Al-Baqarah: 286). So why not encourage the outstanding and help the stumbling? This can only happen by knowing individual abilities.\nIt is noted that 88% of teachers in this stage monitor students moving their fingers with every word, which is close to their counterparts in the lower stage. In this is a link between pronunciation and script.\nOnly 6% of teachers in this stage distribute students into groups if their number is large. This is a very low percentage knowing that this procedure helps the teacher greatly in monitoring students, ensuring their memorization, and providing opportunity to complete the syllabus, especially with the presence of intelligent students in class who undertake monitoring their peers as monitors.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 47
  },
  {
    "serial_number": "1159963",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "60% of teachers in this stage assign students to repeat verses after them. This percentage, although acceptable, does not really rise to what it should be, as teaching the Quran is by inculcation. This percentage is much lower than their counterparts in the lower stage.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 48
  },
  {
    "serial_number": "1159964",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "Formative Evaluation: From Appendix (4) we notice:\nJust as lower stage teachers fell into the error of relying on immediate correction of students' mistakes in recitation by themselves, upper stage teachers fell into the same error. The percentage of teachers relying on immediate correction by themselves reached 58%, which is high. It was more appropriate for them to rely on leaving the opportunity for the reading student to correct himself when he errs, where the percentage applying this procedure reached 42%, and relying on a student to correct the reading student's mistake reached 30%. These percentages are unacceptable because reliance should be on the student himself first, then others, then the teacher.\nIt is noted that teachers of this stage, like their counterparts in the lower stage, did not exceed 34% in discussing with students the implications of vocabulary, general meaning, general ideas, and partial and detailed ideas of the new lesson's verses, reaching respectively 34%, 30%, 18%, and 26%. This matter must be noted, knowing that all this is not at the expense of recitation but within the general time distribution of the period according to sound lesson planning principles.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 49
  },
  {
    "serial_number": "1159965",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "Use of Means: From percentages established in Appendix (4) the following is noted:\nDependence of teachers of this stage on using the blackboard to establish correct aspects of the lesson, where the percentage relying on it reached 72%, and relying on tapes as a suitable means for Quran recitation reached 74%. These are close percentages and acceptable. However, it appears these two means are relied upon by elementary stage teachers generally in lower and upper grades.\nIt is noted that using educational aids other than blackboard and tapes is very weak, not exceeding 18% for teachers using various boards to clarify lesson ideas and concepts. While usage of transparencies reached 4%, usage of labs 8%, and usage of appropriate films was not better off than other means, reaching also 4%. This indicates lack of benefiting from modern means in teaching the Holy Quran, despite the importance of using modern technology in teaching it, especially with the development of computer uses which served the Quran and its teaching well.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 50
  },
  {
    "serial_number": "1159966",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "Reinforcement, Activity, Application, and Curricula: From percentages established in Appendix (4), it is noted that percentages achieved in this stage in this field specifically are lower than those achieved in the lower stage generally, although teachers should pay attention to caring for what this field includes. In any case, the following is noted:",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 51
  },
  {
    "serial_number": "1159967",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "Teachers in this stage tend to praise students' commendable actions and blame disliked actions by 50%, which is a passable percentage. But greater care must be given to achieving this procedure due to the commendable effects of praise and other reinforcement means in pushing students to more seriousness and giving. Using reinforcement after answering adds an atmosphere of vitality inside the class (1), stimulates learners' motivation, and carries them to more achievement, success, and excellence. Hence comes the importance of encouraging academically delayed and shy students, because that strengthens their self-confidence. We have a good example in the Messenger of Allah in encouragement and praise. «From Ubayy bin Ka'b - his Kunya was Abu Al-Mundhir - said: The Messenger of Allah, peace be upon him, said: \"O Abu Al-Mundhir, do you know which verse from the Book of Allah with you is greatest? I said: I said (Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence...). He said: So he struck my chest and said: Congratulations on knowledge, O Abu Al-Mundhir\"» Narrated by Muslim and Abu Dawood (2).",
    "foot_note": "1. (1) Al-Khatib, 1998, 76.\n2. Muslim, Book of Travelers' Prayer and its Shortening, Vol 6 / 92.",
    "book_id": "989",
    "new_page_number": 52
  },
  {
    "serial_number": "1159968",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "Teachers of this stage do not tend to assign students to prepare for the lesson before giving it, where this procedure is used by 22%, although preparation helps speed of understanding and recitation and positive participation in class activities, and getting used to research and inquiry.\n66% of teachers in this stage see a benefit in students chanting Quranic verses for learning, thinking, and deduction. This is relatively acceptable, but lower than their counterparts in the lower stage. Teachers must encourage students to ponder what came in the Holy Quran according to their ability.\nTeachers of this stage do not use the inculcation method only in teaching the Holy Quran, where the percentage using this method reached 26%, which is much lower than the lower stage despite what was said earlier regarding this method. The teacher can use many methods permanently, as every procedure is considered a method.\nE. 68% of teachers in this stage commit to completing the curriculum, while 58% of them focus on students mastering reading regardless of completing the syllabus. Completing the curriculum does not prevent mastery.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 53
  },
  {
    "serial_number": "1159969",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "Teachers of this stage do not tend to hold competitions in mastering recitation among students, where the percentage of those conducting competitions reached 42%. This is a low unacceptable percentage that does not rise to the percentage of their counterparts in the lower stage who encourage competitions. It was more appropriate for teachers, to encourage students and motivate them, to conduct mentioned competitions because it motivates students to compete and raise their educational levels, especially in extracurricular activity periods.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 54
  },
  {
    "serial_number": "1159970",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "Prior Learning Test: It is noted that teachers of this stage do not care for this axis with acceptable care, due to the low percentage of those committed to following the procedures established in this axis, where the highest percentage did not exceed 30%, which is the lowest percentage at all in all education stages. The percentage of those discussing with students the implications of words contained in previous lesson verses reached 6.6%, as if these teachers do not care at all about linking previous verses to subsequent ones. The percentage of those discussing general meanings was not better off, reaching 8.3%.\nTeachers of this stage do not tend to assign good, average, or low ability students to read previous lesson verses, reaching respectively 30%, 20%, and 25%. This might lead to students neglecting this great course because the teacher's lack of asking leads to the student's lack of preparation. The duty is to assign proficient ones to read at the beginning of the classroom situation.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 55
  },
  {
    "serial_number": "1159971",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "Lesson Presentation: It is noted that teachers of this stage do not care about paving the way for lesson presentation, where the percentage of those exciting students for the new lesson with a story or question reached 8.3%. This is also the lowest percentage across all educational stages, although exciting introduction makes this subject interesting and encourages students to more vitality in the lesson.\nTeachers of this stage do not tend to assign students silent reading of the verses subject of the lesson despite the immense benefits of such procedure, where the percentage reached 41.7%. It is necessary in circumstances of few Quran classes.\nAs for discussing with students to reach the general meaning of new lesson verses, it only received 13.3% of teachers' attention. Teachers of this stage must pay intense attention to the general meaning of verses, deducing most important benefits and rulings, and linking those verses to student's life to increase his feeling of the Quran's importance for his life in this world and the Hereafter (1). This does not mean turning the recitation class into Tafsir (exegesis), although Education Administration bulletins urge explaining word meanings, causes of revelation, creed foundations, and general rulings and etiquettes included in verses (2). This is not followed by teachers.",
    "foot_note": "1. (1) Al-Faraj, 1416 AH, 73.\n2. Bulletin of Al-Qunfudhah Education Administration, 22/11/1419 AH.",
    "book_id": "989",
    "new_page_number": 56
  },
  {
    "serial_number": "1159972",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "Teachers' interest in recitation in its various forms is noted: recitation with Tajweed, pausing at verse endings, and controlling vowels. The percentage of teachers applying this always reached respectively 86.7%, 56.7%, and 85%. These are acceptable percentages, but we hope to raise them.\nE. As for the procedure of assigning proficient students to recite verses after the teacher's recitation, 58% of teachers in this stage apply it.\nTeachers of this stage do not tend to assign students reading without order, with their percentage reaching 48.3%. The correct way is assigning students reading without order.\nTeachers of this stage tend not to apply collective loud reading, group loud reading, dividing students into groups according to abilities, and students repeating verses after the teacher or recorder behind a monitor, through percentages established in Appendix (5), reaching 65%, 73.3%, 53.3%, and 51.7%. Naturally, this does not suit this stage generally according to some opinions, although collective, loud, group reading and reading behind teacher or recorder have good returns through field experience.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 57
  },
  {
    "serial_number": "1159973",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "Teachers of this stage ask their students to apply Tajweed rules in their recitation, reaching 88.3%, an acceptable percentage. This is not strange, because students from fourth grade to third secondary grade are required to apply Tajweed rules, and this is at the core of the syllabus.\nTeachers of this stage tend to monitor their students during reading from the Mushaf and ensure they move their fingers with every word, reaching 51.7%. This procedure is good if actually applied, given the general weakness in students' levels, despite its unsuitability for this stage according to some opinions.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 58
  },
  {
    "serial_number": "1159974",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "Formative Evaluation: From percentages established in Appendix (5) the following is noted:\nTeachers of this stage falling into the same error as elementary stage teachers by relying on immediate correction by the teacher, where 55% of teachers correct immediately themselves, and 41.7% leave opportunity for student to correct himself. These are unacceptable percentages because the basis is that the student corrects the mistake himself, then his colleague, then the teacher. Teachers also fell into another error by absolutely not relying on assigning a student to correct the reading student's mistake, with 10%, also an unacceptable percentage.\nTeachers in this stage do not tend to discuss with students the implications of verse vocabulary, nor general meaning, general ideas, partial and detailed ideas of the new lesson. The percentages were respectively 20%, 20%, 11.7%, and 11.7%. These are very low percentages, among the lowest in all stages generally. Attention must be paid to this due to these procedures encouraging research and inquiry.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 59
  },
  {
    "serial_number": "1159975",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "Use of Means: From Appendix (5) the following can be observed:\nAlthough using the blackboard as an educational aid is common in all stages, where difficult words, meanings, rulings... etc. are written on it, teachers of this stage do not tend to use it well, with only 40% using it. This is a low percentage and neglect of an easy accessible means.\nDespite the common use of cassette tapes as a comfortable means for the teacher who recites well and who does not, teachers of this stage do not tend to use the cassette as an educational aid, reaching 28.3% for those using it always. This is absolutely unacceptable, because the older student does not differ from others in needing variety of means, lesson suspense, and increased motivation. In a study by Abdul Rahman Saleh, he clarified the effect of using the recorder and its effectiveness in learning Quran recitation in Jordan in secondary stage, as using the recorder gives the teacher a better chance to focus on students' performance in recitation as they repeat verses they hear from the recorder (1).",
    "foot_note": "1. (1) Musa, 1420 AH, 156-157 - study date not mentioned.",
    "book_id": "989",
    "new_page_number": 60
  },
  {
    "serial_number": "1159976",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "Other means are not better off than blackboard and tape. Other means like various boards, transparencies, language lab, and films are almost unused by teachers, reaching respectively 5%, 5%, 5%, and 8.3%. It is noted that teachers of this stage do not rely permanently on any means. Naturally, this contradicts what educational authorities aspire to. It does not mean the Quran teacher does not need modern means; rather he is most in need of following modern developments and reviving the spirit of suspense for students by using different means.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 61
  },
  {
    "serial_number": "1159977",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "Reinforcement, Extracurricular Activity, Application, and Curricula: From percentages in Appendix (5) we note:\nTeachers in this stage tend to (reinforce) praise students' commendable actions and blame disliked actions, reaching 68.3%.\nTeachers of this stage do not assign students to prepare for the lesson before giving it and refer to various knowledge sources, reaching 31.7%. This is a low percentage. If teachers perform this procedure, it facilitates teaching the course and complements the shortage in allocated Quran classes, especially if their achievement is generally below average.\nTeachers of this stage see benefit in students chanting Quran verses for learning, thinking, and deduction, reaching 68.3%. This is acceptable, but must be accompanied by stimulating students' resolve for research and excavation.\n55% of teachers in this stage link meanings of lesson verses to general life giving examples. This is acceptable but must rise more at a time when enemies of the Ummah strive against linking the Quran to life, as the intermediate and secondary stage is a sensitive stage in building youth thought.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 62
  },
  {
    "serial_number": "1159978",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "E. Teachers of this stage do not see using the inculcation method in teaching Quran, reaching 28.30%.\nTeachers of this stage focus on finishing the syllabus and not on students mastering reading, reaching 70% and 36.7% respectively. The duty is to finish the syllabus focusing on mastery. The teacher can treat students' weakness in Quran by urging them to review verses at home, join Quran circles in the mosque, and hold an evening circle for students at school (1).\nTeachers of this stage do not tend to hold competitions in mastering Quran recitation among students, reaching 26.6% for those supporting permanent competitions. Reality should be otherwise by encouraging competitions of all kinds through student activity committees and activity periods in this stage.",
    "foot_note": "1. (1) Al-Faraj, 1416 AH, 73.",
    "book_id": "989",
    "new_page_number": 63
  },
  {
    "serial_number": "1159979",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "Prior Learning Test: Instructors do not give this axis acceptable attention except assigning students to read previous lesson verses first at start of class, reaching 43.3%. But it is better than secondary and intermediate teachers.\nInstructors in this stage do not tend to discuss with students implications of words nor general meaning of previous lesson verses, reaching 26.6% for each procedure. This is unacceptable but better than secondary and intermediate stage.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 64
  },
  {
    "serial_number": "1159980",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "Lesson Presentation: Quran instructors in this stage do not care for good introduction of new lesson, where asking questions or telling a story to excite students to reveal new lesson subject reached 36.6%. This is low. The university professor must exert maximum effort to excite the student mentally (1).\nAssigning students silent reading of new lesson verses reached 30%. This is low due to silent reading's educational effects facilitating learning as mentioned, especially in this stage where students need competency raising, especially accustoming them to silent reading and understanding. The university instructor must exert maximum effort to make his students participate effectively in research, exploration, and more learning (2). This does not appear through percentages in Appendix (5) items 8, 24, 25, 26, 27. Discussing with students to reach general meaning (general idea) of new lesson verses reached 36.6%. This is low but better than secondary and intermediate education.",
    "foot_note": "1. (1) Rashid, 1408 AH, 108.\n2. Rashid, 1408 AH, 108.",
    "book_id": "989",
    "new_page_number": 65
  },
  {
    "serial_number": "1159981",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "Instructors' interest in recitation in various ways is noted: full recitation of new lesson verses with Tajweed several times, pausing at verse endings, and reciting with vowel control, reaching respectively 70%, 66.6%, and 76.6%. These are acceptable percentages though we aspire for higher.\nE. Instructors of this stage assign proficient students to recite new lesson verses after their recitation, reaching 76.6%. This is acceptable but lower than other stages.\nInstructors of this stage do not tend to assign students reading without order, reaching 26.6%. The principle is the opposite due to the random style's effect in always attracting student to the lesson waiting to be assigned reading.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 66
  },
  {
    "serial_number": "1159982",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "Instructors of this stage do not tend to collective loud reading, group loud reading, classifying students into groups and reading according to mental abilities, distributing into groups with a monitor for each if numbers are large, and assigning students to repeat after instructors. Percentages were respectively 20%, 16.6%, 23.3%, 13.3%, and 43.3%. But they didn't reject it absolutely unlike secondary and intermediate teachers who tended to reject it, with rejection percentages 65%, 73.3%, 53.3%, 70%, and 51.7% (from Appendix 5).\n93.3% of teachers in this stage demand students apply Tajweed rules in recitation, which is obligatory and natural.\nInstructors of this stage monitor students' reading from Mushaf ensuring finger movement with every word. This issue is questionable, reaching 66.6%, because this procedure does not suit this stage.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 67
  },
  {
    "serial_number": "1159983",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "Formative Evaluation: Quran instructors in this stage do not differ from others in relying on themselves for immediate correction of student mistakes, reaching 80%. This is high and an educational error as mentioned. Leaving opportunity for student to correct himself is 40%, unacceptable. Assigning a student to correct the reader reached 20%. Most pre-university teachers also fell into the educational error of teacher correcting reader immediately.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 68
  },
  {
    "serial_number": "1159984",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "We mentioned in paragraph (C) of Lesson Presentation that instructors of this stage do not care about students' role generally. They do not tend to discuss with students implications of vocabulary, general meaning, general ideas, partial and detailed ideas. Percentages were respectively 26.6%, 33.3%, 26.6%, and 16.6%. These are unacceptable because the university instructor must discuss with students to train them on reflective and creative thinking, leading to appropriate response patterns from the student. The best course needing reflection and discussion is the Holy Quran to establish correct Islamic creed in students in the era of knowledge globalization.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 69
  },
  {
    "serial_number": "1159985",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "Use of Means: Instructors of this stage rely on the blackboard as an educational aid, occupying first place in reinforcing correct aspects, reaching 60%. While 23.3% rely on tapes. It seems intermediate, secondary, and university instructors do not tend to use tapes, which is unsound. The tape is a successful means if well used, especially with general weakness in students' Quran recitation levels. Video tapes combine sound and image showing mouth movements and pronunciation making them effective.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 70
  },
  {
    "serial_number": "1159986",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "Instructors of this stage do not use other educational aids like different boards to clarify lesson ideas and concepts. If the student doesn't learn using different means, how will he convey information to his students? Outputs expected from the student are returns of inputs. If there is no input especially regarding means, how can we ask this student to use a means in future when he becomes a teacher? Teachers' neglect in general education stages of using different means might be due to weakness in educational aspect in university education, where only 10% used boards.\n26.6% of instructors use transparencies to clarify general and partial ideas. This is low given the spread of modern aids. The overhead projector is easy to use, replaces blackboard, and has advantages eliminating blackboard negatives. The instructor can enlarge words and images and prepare multiple transparency forms in addition to controlling lesson step presentation.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 71
  },
  {
    "serial_number": "1159987",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "It appears from instructors' answers summary that they use language labs minimally, reaching 10%. Perhaps it's much lower due to lack of labs originally, although a lab facilitates teaching and learning generally.\nE. A small percentage of instructors use appropriate films to realize verse concepts, reaching 6.6%. This is unacceptable despite films' effectiveness in conveying information easily. In any case, how can we ask instructors to use such means when most are not educationally qualified, without diminishing the ability of diligent teachers. This is noted through instructors' qualifications teaching Quran.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 72
  },
  {
    "serial_number": "1159988",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "Reinforcement, Extracurricular Activity, Application, and Curricula: Instructors in this stage tend to reinforce students' actions, reaching 63.3%. This is acceptable while no one rejects it. This percentage is close to secondary and intermediate stage. A student needs reinforcement regardless of age.\nInstructors of this stage distinguished themselves by assigning students to prepare for the lesson and refer to knowledge sources, reaching 56.6%, while other stages didn't reach acceptable degrees. Such procedure is necessary to encourage research and inquiry, motivating positive participation increasing learning motivation.\nMost instructors see importance of students chanting Quran verses in learning, thinking, and deduction, reaching 90%. Instructors must develop the faculty of thinking and deduction from Allah's verses with this huge amount of information wealth.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 73
  },
  {
    "serial_number": "1159989",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "60% of instructors link verse meaning to general life with examples due to its importance in forming strong Muslim personality. This is among the highest percentages across stages.\nE. 53.3% of instructors tend to use inculcation method only, agreeing with the optimal Quran teaching style.\n80% commit to completing the syllabus, while 33.3% focus on mastery regardless of completion. This isn't an acceptable excuse because mastery occurs with completion if the instructor proceeds according to principles and resorts to successful solutions in overcoming difficulties for average students, encouraging them to join Quran circles and continuous follow-up.\n50% of instructors tend to hold recitation competitions among students. This is acceptable and better than secondary and intermediate percentages.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 74
  },
  {
    "serial_number": "1159990",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "After this analysis, we have answered the research questions by stating prevailing teaching methods in general and university education stages, stating their negatives and positives, and comparing between stages as much as possible. Following is a summary of the most prominent results and recommendations to be adopted.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 75
  },
  {
    "serial_number": "1159991",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "Prominent Research Results and Recommendations\nFirst: Important results can be summarized as follows:\nTeachers in all stages commit to reciting verses in multiple ways but with different percentages, noting some neglect pausing at verse endings especially upper elementary teachers.\nTeachers oblige students to adhere to Tajweed rules in all stages.\nAll teachers see benefit in students chanting Quran verses for learning, thinking, and deduction.\nTeachers link verse meaning to general life with examples.\nAll teachers in all stages commit to completing the syllabus.\nTeachers focus on mastery regardless of completion except secondary, intermediate, and university teachers.\nQuran teachers in all stages do not care for prior learning test axis whether by assigning reading of previous lesson or discussing meanings, leading to students neglecting revision.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 76
  },
  {
    "serial_number": "1159992",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "Suspense element and good introduction to excite students didn't reach acceptance degree in all stages.\nLack of interest by Quran teachers in all stages in silent reading despite its good effects in facilitating learning.\nTeachers generally don't care for collective or group reading, nor dividing students into groups regardless of numbers.\nTeachers don't follow educational methods in correcting mistakes, correcting themselves without leaving opportunity for student or peer correction.\nTeachers rely on old means especially blackboard and recorder in elementary only, despite modern means development.\nGeneral education teachers don't care for students' role, not assigning preparation for new lesson.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 77
  },
  {
    "serial_number": "1159993",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "General education teachers don't rely on inculcation only, while university teachers do.\nUpper elementary and intermediate teachers don't tend to hold competitions.\nSecond: Recommendations:\nIslamic Education supervisors should ensure teachers apply all Quran teaching procedures seriously suitable for each stage, holding model lessons using modern technologies.\nQuran teachers should prepare for lessons considering:\nGood introduction and suspense.\nAttention to all reading types (silent, collective, loud, group, individual).\nFollowing educational principles in correcting mistakes.\nUsing appropriate aids at right time.\nActivating students' role and increasing motivation and improving levels by all means.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 78
  },
  {
    "serial_number": "1159994",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "Attention to inculcation in all stages.\nAttention to extracurricular activities to motivate students, including serious competitions with increased material reinforcement.\nAnd Allah is the Grantor of success.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 79
  },
  {
    "serial_number": "1159995",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "Appendix (1)\nNames of Content Validity Arbitrators\n1- Dr. Muhammad bin Ibrahim Al-Khatib, PhD Curricula and Teaching Methods, Educational Supervisor at Zarqa College - Balqa University - Jordan, (formerly) and Educational Supervisor at Royal Commission Education Department in Jubail.\n2- Dr. Ahmed Muhammad Al-Zu'bi, PhD Counseling Psychology, Assistant Professor Department of Education and Psychology and Educational Aids, Teachers College in Al-Qunfudhah.\n3- Dr. Sayed Sayih Hamdan, PhD Curricula and Teaching Methods, Head of Curricula and Teaching Methods Department Teachers College in Al-Qunfudhah.\n4- Prof. Dr. Abdul Hafiz Al-Jazouli, PhD Technologies, Head of Education and Psychology and Educational Aids Department Teachers College in Al-Qunfudhah.\n5- Dr. Eid Al-Shatnawi, PhD Islamic Education Foundations, Assistant Professor Department of Education and Psychology and Educational Aids Teachers College in Al-Qunfudhah.\n6- Dr. Muhammad Awad Al-Karim Al-Dush, PhD Sharia, Dean of Faculty of Fundamentals of Religion Omdurman Islamic University (formerly).\n7- Dr. Adel Mahmoud Al-Minshawi, PhD Measurement and Evaluation, Assistant Professor Department of Measurement and Evaluation, Alexandria University.\n8- Mr. Ibrahim Al-Asmari, Quran Teaching Methods Instructor Teachers College in Al-Qunfudhah.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 80
  },
  {
    "serial_number": "1159996",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "9- Mr. Muhammad Amir, Principal of Quran Memorization School in Al-Qunfudhah.\n10- Mr. Ali Ahmed Al-Rashidi, Islamic Education Educational Guide Al-Qunfudhah Education Administration.\n11- Mr. Ali Musa Al-Shardi, Islamic Education Educational Guide Al-Qunfudhah Education Administration.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 81
  },
  {
    "serial_number": "1159997",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "Study References\n1- The Holy Quran.\n2- Al-Abrashi, Muhammad Atiya, Islamic Education and its Philosophers, Dar Al-Fikr Al-Arabi, 1396 AH-1976 AD.\n3- Ahmed, Muhammad Abdul Qader, General Teaching Methods, Maktabat Al-Nahda Al-Masriya, Cairo, 1416 AH-1995 AD.\n4- Al-Bashir, Muhammad Muzammil, and Muhammad Malik Muhammad Saeed, Introduction to Curricula and Teaching Methods, Dar Al-Liwa for Publishing, 1416 AH-1995 AD.\n5- Jan, Muhammad Saleh bin Ali, The Precious Guide to Islamizing Teaching Methods, Dar Al-Tarafain, Taif, 1418 AH.\n6- Al-Khatib, Muhammad Ibrahim, Teacher's Guide in Classroom Situation, Maktabat Al-Falah, Dar Hunayn, Kuwait - Amman, 1998 AD.\n7- Al-Darimi, Abdullah Abdul Rahman, Sunan Al-Darimi, Investigation by Abdullah Hashem Yamani, Dar Al-Mahasin, Cairo, 1386 AH-1966 AD.\n8- Al-Dush, Muhammad bin Abdullah, The Teacher and Guidance Skills, Dar Al-Watan - Riyadh, 1418 AH.\n9- Rashid, Ali, University and University Teaching, Dar Al-Shorouk, Jeddah, 1408 AH-1988 AD.\n10- Al-Rumi, Fahd bin Abdul Rahman, Studies in Quran Sciences, Maktabat Al-Tawba, Riyadh, 1420 AH.\n11- Rushdi, Labib, Teaching - Objectives, Foundations, Methods, Result Evaluation and Applications, Alam Al-Kutub - Cairo, 1983 AD.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 82
  },
  {
    "serial_number": "1159998",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "12- Al-Zaabalawi, Muhammad Al-Sayyid, Methods of Teaching Quran, Maktabat Al-Tawba - Riyadh, 1420 AH.\n13- Salem, Abdul Rashid Abdul Aziz, Islamic Education and its Teaching Methods, Dar Al-Buhuth Al-Ilmiyya - Kuwait, 1979 AD.\n14- Al-Shafi'i, Ibrahim Muhammad Al-Shafi'i, Islamic Education and its Teaching Methods, 2nd Ed, Maktabat Al-Falah - Kuwait, 1404 AH-1984 AD.\n15- Shahata, Zain Muhammad, and Abdullah Al-Jughayman, Methods of Teaching Sharia Subjects in Elementary Stage, World Assembly of Muslim Youth - Al-Ahsa, 1420 AH.\n16- Uthman, Hassan Mulla, Methods of Teaching Islamic Subjects in Intermediate and Secondary Schools, Dar Alam Al-Kutub, Riyadh, 1417 AH-1996 AD.\n17- Eid, Yahya Ismail, Islamic Education Teaching Methods - Between Originality and Modernity - Amman, 1420 AH.\n18- Al-Ghazali, Muhammad bin Hamid, Revival of Religious Sciences, Al-Maktaba Al-Asriya, Sidon, 1420 AH.\n19- Al-Faraj, Abdul Rahman bin Mubarak, Methods of Teaching Islamic Education Subjects, Maktabat Dar Al-Humaidhi - Dar Al-Kitab wa Al-Sunnah, Riyadh - Islamabad, 1406 AH-1996 AD.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 83
  },
  {
    "serial_number": "1159999",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "20- Al-Qa'id, Ibrahim bin Hamad, and Eid bin Abdullah Al-Shammari, (Translators), Principles of Language Learning and Teaching (by Douglas Brown), Arab Bureau of Education for the Gulf States, Riyadh, 1414 AH-1994 AD.\n21- Qandil, Yasin Abdul Rahman, Teaching and Teacher Preparation, 2nd Ed, Dar Al-Nashr Al-Dawli, Riyadh, 1418 AH-1998 AD.\n22- Al-Kilani, Majid Irsan, Philosophy of Islamic Education, Dar Al-Rayyan, Beirut, 1419 AH-1998 AD.\n23- Labib, Rushdi, and Jaber Abdul Hamid Jaber, and Munir Atallah, General Foundations of Teaching, Dar Al-Nahda Al-Arabiya, Beirut, 1983 AD.\n24- Al-Laqani, Ahmed Hussein, and Prince Ahmed Radwan, Teaching Social Studies, 3rd Ed, Alam Al-Kutub, Cairo, 1988 AD.\n25- Madkour, Ali Ahmed, Sharia Sciences Teaching Methodology, Dar Al-Shawaf, Riyadh, 1991 AD.\n26- Mursi, Muhammad Munir Mursi, Islamic Education - Origins and Development in Arab Countries, Alam Al-Kutub, Cairo, 1982 AD.\n27- Muslim, Muslim bin Al-Hajjaj, Sahih Muslim with Nawawi's Explanation, Dar Al-Fikr, Beirut.\n28- Musa, Mustafa Ismail, Teaching Islamic Education, Theoretical Foundations and Applied Models, Dar Abu Hilal, 1996 AD.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 84
  },
  {
    "serial_number": "1160000",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Evaluating Methods of Teaching the Holy Quran in General and University Education Stages",
    "edition": "None",
    "publisher": "None",
    "page_number": 82,
    "volume_number": 1,
    "text": "29- Yunus, Fathi Ali, and Mahmoud Kamel Al-Naqa, and Ali Ahmed Madkour, Basics of Teaching Arabic Language and Religious Education, Dar Al-Thaqafa, Cairo, 1981 AD.\n30- Yunus, Fathi Ali, and Mahmoud Abdu Ahmed, and Mustafa Abdullah Ibrahim, Islamic Religious Education Between Originality and Modernity, Alam Al-Kutub, Cairo, 1999 AD.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 85
  }
]