[
  {
    "text": "Al-Luma' fi Asbab Wurud al-Hadith (Glimpses into the Causes of Hadith Revelation)\nAuthor: عبد الرحمن بن أبي بكر جلال الدين السيوطي\nYear: 911",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith (Glimpses into the Causes of Hadith Revelation)",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "new_page_number": 1
  },
  {
    "text": "sn: 3013\nbook_title: اللمع في أسباب ورود الحديث\nbook_link: https://shamela.ws/book/976\nbook_id: 976\nauthor_name: عبد الرحمن بن أبي بكر جلال الدين السيوطي\nauthor_year: 911\nnickname: Null\nauthor_link: https://shamela.ws/author/7\nauthor_ID: 7\neditor: مكتب البحوث والدراسات في دار الفكر للطباعة والنشر والتوزيع (بإشراف)\npublisher: Null\nedition: الأولى، 1416 هـ / 1996 م\npages: 95\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: شروح الحديث\ncategory_id: 7",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith (Glimpses into the Causes of Hadith Revelation)",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "new_page_number": 2
  },
  {
    "serial_number": "2414355",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith (Glimpses into the Causes of Hadith Revelation)",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Explanations of Hadith. Book: Al-Luma' fi Asbab Wurud al-Hadith. Author: Abd al-Rahman bin Abi Bakr, Jalal al-Din al-Suyuti (d. 911 AH). Supervised by: The Research and Studies Office at Dar Al-Fikr for Printing, Publishing, and Distribution. Edition: First, 1416 AH / 1996 AD. [The book numbering corresponds to the printed version]. Number of pages: 95. Published on Shamela: 8 Dhu al-Hijjah 1431.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 3
  },
  {
    "serial_number": "2414356",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Causes of Hadith Revelation or Glimpses into the Causes of Hadith Revelation by Hafiz Jalal al-Din Abd al-Rahman al-Suyuti who died in the year 911. A new revised and corrected edition with vowelized verses and hadiths. Supervised by the Research and Studies Office at Dar Al-Fikr for Printing, Publishing, and Distribution.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 4
  },
  {
    "serial_number": "2414357",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "All reprint rights reserved to the publisher. 1416 AH / 1996 AD. First Edition.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 5
  },
  {
    "serial_number": "2414358",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "**Biography of the Author**\n\nAl-Suyuti wrote his own biography in his book \"Husn al-Muhadarah,\" saying: I only mentioned my biography in this book following the example of the hadith scholars before me, for rarely did any of them write a history without mentioning his own biography in it. Among those who did this: Imam Abd al-Ghaffar al-Farisi in \"Tarikh Naysabur,\" Yaqut al-Hamawi in \"Mu'jam al-Udaba',\" Lisan al-Din Ibn al-Khatib in \"Tarikh Gharnata,\" Hafiz Taqi al-Din al-Fasi in \"Tarikh Makkah,\" Hafiz Abu al-Fadl Ibn Hajar in \"Qudat Misr,\" and Abu Shama in \"Al-Rawdatayn,\" and he is the most pious and ascetic of them.\n\n**His Name and Lineage:**\nAl-Suyuti said: Biography of the author of this book - Husn al-Muhadarah - Abd al-Rahman bin al-Kamal Abi Bakr bin Muhammad bin Sabiq al-Din bin al-Fakhr Uthman bin Nazir al-Din Muhammad bin Sayf al-Din Khidr bin Najm al-Din Abi al-Salah Ayyub bin Nasir al-Din Muhammad bin Sheikh Humam al-Din al-Humam al-Khudayri al-Asyuti. As for our attribution 'Al-Khudayri,' I do not know what this attribution refers to except \"Al-Khudayriyyah,\" a locality in Baghdad. Someone I trust told me that he heard my father, may Allah have mercy on him, say that his great-grandfather was a non-Arab or from the East, so it appears the attribution is to the mentioned locality.\n\n**His Birth and Upbringing:**\nAl-Suyuti said: My birth was after sunset on the night of Sunday, the beginning of Rajab, year 849. I was carried during my father's life to Sheikh Muhammad al-Majdhub, a man who was one of the great saints near the Shrine of Nafisa, and he blessed me.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 6
  },
  {
    "serial_number": "2414359",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Al-Aydarus (1) says: His father brought him, when he was three years old, to the assembly of Sheikh al-Islam Ibn Hajar once. While young, he attended the assembly of the hadith scholar Sheikh Zayn al-Din Ridwan al-Utbi, and studied under Sheikh Siraj al-Din Umar al-Wardi. Then he engaged in knowledge with several sheikhs.\nAl-Suyuti said: I grew up an orphan. I memorized the Quran before I was eight years old. Then I memorized \"Al-Umdah\" (2), \"Minhaj al-Fiqh\" (3), \"Al-Usul\" (4), and \"Alfiyyat Ibn Malik.\"\nAl-Aydarus (5) said: His father died on the night of Monday, the fifth of Safar, year 855. He appointed Sheikh Kamal al-Din Ibn al-Humam as his guardian, so he looked after him with care and attention.\n\n**His Family:**\nAs for my great-grandfather Humam al-Din, he was among the people of spiritual reality (Haqiqah) and sheikhs of the paths... Those below him were people of status and leadership; some held the judiciary in their town, some held the Hisba (market inspection), some were merchants in the company of Emir Shaykhun and built a school in Asyut and endowed it. Some were travelers. I do not know of any of them who served knowledge properly except my father.",
    "foot_note": "1. (1) Al-Nur al-Safir p. 510. \n2. Meaning \"Umdat al-Ahkam\" by Ibn Daqiq al-Eid (d. 702 AH). \n3. Meaning \"Minhaj al-Talibin\" by al-Nawawi (d. 676 AH). \n4. Meaning \"Minhaj al-Wusul ila 'Ilm al-Usul\" by al-Baydawi (d. 685 AH). \n5. Al-Nur al-Safir p. 51. (*)",
    "book_id": "976",
    "new_page_number": 7
  },
  {
    "serial_number": "2414360",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "As for his mother, Al-Sakhawi (1) informs us in Al-Daw' al-Lami' that his mother was Turkish. Al-Aydarus (2) says about her: A Turkish Umm Walad (slave mother).\n\n**His Travels:**\nAl-Suyuti said: I traveled, praise be to Allah, to the lands of Sham, Hijaz, Yemen, India, Maghreb, and Takrur. He also has a journey within Egypt, mentioned by Al-Sakhawi in Al-Daw' al-Lami' (3), who said: Then he traveled to Fayyum, Damietta, and Mahalla, and wrote from a group.\nThen Al-Suyuti said: When I performed Hajj, I drank Zamzam water for several matters: among them to reach in Fiqh the rank of Sheikh Siraj al-Din al-Bulqini, and in Hadith the rank of Hafiz Ibn Hajar.\n\n**His Sheikhs:**\nAl-Suyuti took extensively from sheikhs. He gathered their names in a dictionary (Mu'jam) saying: As for my sheikhs in narration via hearing and license (Ijazah), they are many. I listed them in the Mu'jam I collected them in, and they number about one hundred and fifty. I did not increase in hearing narration because I was busy with what is more important, which is reading Dirayah (comprehension/knowledge).\nAl-Suyuti said: I started engaging in knowledge at the beginning of the year 864. I took Fiqh and Grammar from a group of sheikhs. I took Inheritance Law (Fara'id) from the Allamah, the Fara'idi of his time, Sheikh Shihab al-Din al-Sharmasahi, who was...",
    "foot_note": "1. (1) Al-Daw' al-Lami' 4 / 65. \n2. Al-Nur al-Safir p. 51. \n3. Al-Daw' al-Lami' 4 / 65. (*)",
    "book_id": "976",
    "new_page_number": 8
  },
  {
    "serial_number": "2414361",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "...said to have reached a very old age, exceeding one hundred by much, Allah knows best. I read with him his commentary on \"Al-Majmu'.\" I was licensed to teach Arabic at the beginning of the year 866. I authored in this year; the first thing I authored was \"Sharh al-Isti'adha wa al-Basmala.\" I showed it to our Sheikh, Sheikh al-Islam Alam al-Din al-Bulqini, and he wrote a eulogy on it. I stuck with him in Fiqh until he died. Then I stuck with his son, reading with him from the beginning of \"Al-Tadrib\" by his father to \"Al-Wakala,\" and heard from him from the beginning of \"Al-Hawi al-Saghir\" to (Al-Adad), and from the beginning of \"Al-Minhaj\" to (Zakat), and from the beginning of \"Al-Tanbih\" to near (Bab al-Zakat), and a portion of \"Al-Rawda\" from (Bab al-Qada'), and a portion of \"Takmilat Sharh al-Minhaj\" by Al-Zarkashi, and from (Ihya' al-Mawat) to (Al-Wasaya) or thereabouts. He licensed me to teach and issue fatwas from the year 876 and attended my first lecture. When he died in the year 878, I stuck with Sheikh al-Islam Sharaf al-Din al-Munawi. I read with him a portion of \"Al-Minhaj\" and heard him on it in divisions, except sessions I missed. I heard lessons from the commentary on \"Al-Bahja\" and a gloss on it, and from \"Tafsir al-Baydawi.\"\nIn Hadith and Arabic, I stuck with our Sheikh Imam Allamah Taqi al-Din al-Shibli al-Hanafi. I attended him regularly for four years. He wrote a eulogy for me on \"Sharh Alfiyyat Ibn Malik\" and on \"Jam' al-Jawami' fi al-Arabiyya\" authored by me. He testified for me more than once regarding my advancement in sciences with his tongue and pen. He retracted his own view simply based on my word regarding a hadith; for he cited in his \"Hashiya 'ala al-Shifa\" the hadith of Abu al-Hamra' regarding Isra', attributing it to Ibn Majah. I needed to cite it with its chain, so I searched Ibn Majah in its expected place but did not find it. I went through the entire book but did not find it. I doubted my sight...",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 9
  },
  {
    "serial_number": "2414362",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "...so I went through it a second time and did not find it, then returned a third time and did not find it. I saw it in \"Mu'jam al-Sahaba\" by Ibn Qani'. So I came to the Sheikh and informed him. As soon as he heard that from me, he took his copy, took the pen, crossed out the word: Ibn Majah, and appended Ibn Qani' in the margin. I considered that great and was awed by it due to the great status of the Sheikh in my heart and my contempt for myself. I said: Won't you wait, perhaps you might review? He said: No, I only imitated Al-Burhan al-Halabi in saying: Ibn Majah. I did not separate from the Sheikh until he died.\nI stuck with our Sheikh, the Allamah, the Master of Existence, Muhyi al-Din al-Kafiji for fourteen years. I took from him the arts of Tafsir, Usul, Arabic, Ma'ani, and others. He wrote me a great license. I attended numerous lessons with Sheikh Sayf al-Din al-Hanafi in \"Al-Kashshaf,\" \"Al-Tawdih\" and his gloss on it, \"Talkhis al-Miftah,\" and \"Al-Adud.\"\nI began authoring in the year 866. My works reached up to now - meaning about twelve years before his death - three hundred books, other than what I washed off and retracted. Al-Aydarus (1) says: His works reached about six hundred, other than what he retracted and washed off.\nAl-Suyuti said: I was granted depth in seven sciences: Tafsir, Hadith, Fiqh, Syntax, Ma'ani, and Bayan, according to the way of the Arabs and eloquent ones, not the way of the non-Arabs and philosophers. Below these seven in knowledge: Usul al-Fiqh, Dialectic (Jadal), and Morphology (Tasrif),",
    "foot_note": "1. (1) Al-Nur al-Safir p. 52 (*)",
    "book_id": "976",
    "new_page_number": 10
  },
  {
    "serial_number": "2414363",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "and below them Composition (Insha'), Correspondence (Tarassul), and Inheritance (Fara'id). Below them Readings (Qira'at), which I did not take from a sheikh. Below them Medicine. As for Arithmetic (Hisab), it is the hardest thing for me and furthest from my mind; if I look at a problem related to it, it is as if I am trying to carry a mountain. In the beginning of seeking knowledge, I read in Logic (Mantiq), then Allah cast aversion to it in my heart. I heard that Ibn al-Salah issued a fatwa prohibiting it, so I left it for that reason. Allah compensated me for it with the science of Hadith, which is the noblest of sciences.\nWhat I believe is that what I have reached in these seven sciences, other than Fiqh and the transmitted texts I have viewed in them, none of my sheikhs reached, let alone those below them. As for Fiqh, I do not say that about it; rather, my sheikh in it has a broader view and longer reach.\nHe says: The tools of Ijtihad have now been completed for me. He mentions the motive for this claim of his, saying: I say that speaking of Allah's blessing, not out of pride. What is there in the world to seek its attainment by boasting? Departure has drawn near, gray hair has appeared, and the best of life has gone. If I wished to write a book on every issue with its sayings, transmitted and analogical evidences, its basis, refutations, answers, and balancing between the different schools of thought in it, I would be able to do that by the grace of Allah, not by my power or strength. There is no power nor strength except by Allah. What Allah wills [happens], there is no power except by Allah.\n\n**His Character and Scholars' Praise of Him:**\nNajm al-Din al-Ghazzi (1) says: When he reached forty years of age, he began to devote himself to worship, cut himself off for Allah Almighty, occupy himself purely with Him, and turn away...",
    "foot_note": "1. (1) Al-Nur al-Safir p. 52 (*)",
    "book_id": "976",
    "new_page_number": 11
  },
  {
    "serial_number": "2414364",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "...from the world and its people as if he knew none of them. He began editing his works, left issuing fatwas and teaching, and apologized for that in a work he authored named \"Al-Tanfis.\" He resided in Rawdat al-Miqyas and did not move from it until he died. He did not open the windows of his house overlooking the Nile from his residence. Emirs and the wealthy used to come to visit him and offer him precious wealth, but he would return it. Al-Ghawri gifted him a eunuch and a thousand dinars; he returned the thousand, took the eunuch, freed him, and made him a servant in the Prophetic Chamber. He said to the Sultan's messenger: Do not ever come back to us with a gift, for Allah Almighty has enriched us from such things. He did not frequent the Sultan or anyone else. He was summoned repeatedly but did not attend.\nAl-Aydarus (1) says: It is narrated about him that he said: I saw in a dream as if I was before the Prophet, peace be upon him. I mentioned to him a book I started authoring in Hadith, which is \"Jam' al-Jawami'.\" I said to him: Shall I read something from it to you? He said to me: Bring it, O Sheikh of Hadith. He said: This glad tiding is greater to me than the world and all it contains.\n\n**His Works:**\nIbn al-Imad (2) says: Most of his works became famous during his lifetime in the quarters of the earth, east and west. He was a great sign in the speed of authorship, such that his student Al-Dawudi said: I witnessed the Sheikh write three quires (kararis) in one day, authoring and editing. With that, he would dictate Hadith and answer contradictory ones with good answers. He was the most knowledgeable of the people of his time in the science of Hadith and its arts, regarding narrators...",
    "foot_note": "1. (1) Shadharat al-Dhahab 8 / 53. \n2. Al-Kawakib al-Sa'irah 1 / 228. (*)",
    "book_id": "976",
    "new_page_number": 12
  },
  {
    "serial_number": "2414365",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "...and strange terms (Gharib), text and chain, and deducing rulings from it. He informed about himself that he memorized two hundred thousand hadiths. He said: If I found more, I would have memorized them. He said: Perhaps there is not more than that on the face of the earth now.\nAl-Aydarus says in \"Al-Nur al-Safir\" (1): He was nicknamed Ibn al-Kutub (Son of Books), because his father was a man of knowledge and needed to consult a book. He ordered his mother to bring the book from among his books. She went to bring it, and labor pains came to her while she was among the books, so she gave birth to him.\nNajm al-Din al-Ghazzi (2) says: He authored numerous, complete, comprehensive, beneficial, perfected, edited, relied upon, and considered works. Their number exceeded five hundred works. Al-Dawudi exhausted them in his biography... Most of his works became famous during his lifetime in the Hijaz, Sham, Aleppo, Rum (Turkey), Maghreb, Takrur, India, and Yemen. In the speed of writing and authoring, he was a great sign of Allah's signs.\nHere is a list of the names of his works, including (281) works he mentioned in his book \"Husn al-Muhadarah.\" He said: These are the names of my works for benefit:\n**1 - The Art of Tafsir and its Attachments and Readings:**\n1. Al-Itqan fi 'Ulum al-Quran.\n2. Al-Durr al-Manthur fi al-Tafsir al-Ma'thur.",
    "foot_note": "1. (1) Al-Nur al-Safir p. 51. \n2. Al-Kawakib al-Sa'irah 1 / 228. (*)",
    "book_id": "976",
    "new_page_number": 13
  },
  {
    "serial_number": "2414366",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "3. Turjuman al-Quran fi al-Tafsir al-Musnad.\n4. Asrar al-Tanzil, called \"Qatf al-Azhar fi Kashf al-Asrar.\"\n5. Lubab al-Nuqul fi Asbab al-Nuzul.\n6. Mufhimat al-Aqran fi Mubhamat al-Quran.\n7. Al-Muhadhdhab fima Waqa'a fi al-Quran min al-Mu'arrab.\n8. Al-Iklil fi Istinbat al-Tanzil.\n9. Takmilat Tarjamat al-Sheikh Jalal al-Din al-Mahalli.\n10. Al-Tahbir fi 'Ulum al-Tafsir.\n11. Hashiyah 'ala Tafsir al-Baydawi.\n12. Tanasuq al-Durar fi Tanasub al-Suwar.\n13. Marasid al-Matali' fi Tanasub al-Maqati' wa al-Matali'.\n14. Majma' al-Bahrayn wa Matla' al-Badrayn fi al-Tafsir.\n15. Mafatih al-Ghayb fi al-Tafsir.\n16. Al-Azhar al-Fa'ihah 'ala al-Fatihah.\n17. Sharh al-Isti'adha wa al-Basmala.\n18. Al-Kalam 'ala Awwal al-Fath, which is an opening speech I delivered when I commenced teaching at Jami' Shaykhun in the presence of our Sheikh Al-Bulqini.\n19. Sharh al-Shatibiyyah.\n20. Al-Alfiyyah fi al-Qira'at al-Ashr.\n21. Khama'il al-Zahr fi Fada'il al-Suwar.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 14
  },
  {
    "serial_number": "2414367",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "22. Fath al-Jalil lil-Abd al-Dhalil fi al-Anwa' al-Badi'iyyah al-Mustakhrajah min Qawlihi Ta'ala (Allah Waliyy al-ladhina amanu...) al-Ayah, numbering one hundred and twenty types.\n23. Al-Qawl al-Fasih fi Ta'yin al-Dhabih.\n24. Al-Yad al-Busta fi al-Salat al-Wusta.\n25. Mu'tarak al-Aqran fi Mushtarak al-Quran.\n\n**2 - The Art of Hadith and its Attachments:**\n26. Kashf al-Mughatta fi Sharh al-Muwatta.\n27. Is'af al-Mubatta bi-Rijal al-Muwatta.\n28. Al-Tawshih 'ala al-Jami' al-Sahih.\n29. Al-Dibaj 'ala Sahih Muslim bin al-Hajjaj.\n30. Mirqat al-Su'ud ila Sunan Abi Dawud.\n31. Sharh Ibn Majah.\n32. Tadrib al-Rawi fi Sharh Taqrib al-Nawawi.\n33. Sharh Alfiyyat al-Iraqi, the Alfiyyah is called \"Nazm al-Durar fi 'Ilm al-Athar\" and its explanation is called \"Qatr al-Durar.\"\n34. Al-Tahdhib fi al-Zawa'id 'ala al-Taqrib.\n35. Ayn al-Isabah fi Ma'rifat al-Sahaba.\n36. Kashf al-Talbis 'an Qalb Ahl al-Tadlis.\n37. Tawdih al-Mudrik fi Tashih al-Mustadrak.\n38. Al-La'ali' al-Masnu'ah fi al-Ahadith al-Mawdu'ah.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 15
  },
  {
    "serial_number": "2414368",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "39. Al-Nukat al-Badi'at 'ala al-Mawdu'at.\n40. Al-Dhayl 'ala al-Qawl al-Musaddad.\n41. Al-Qawl al-Hasan fi al-Dhabb 'an al-Sunan.\n42. Lubb al-Lubab fi Tahrir al-Ansab.\n43. Taqrib al-Gharib.\n44. Al-Mudraj ila al-Mudraj.\n45. Tadhkirat al-Mu'tasi bi-man Haddatha wa Nasi.\n46. Tuhfat al-Nabih bi-Talkhis al-Mutashabih.\n47. Al-Rawd al-Mukallal wa al-Wird al-Mu'allal fi al-Mustalah.\n48. Muntaha al-Amal fi Sharh Hadith Innama al-A'mal.\n49. Al-Mu'jizat wa al-Khasa'is al-Nabawiyyah.\n50. Sharh al-Sudur bi-Sharh Hal al-Mawta wa al-Qubur.\n51. Al-Budur al-Safira 'an Umur al-Akhira.\n52. Ma Rawahu al-Wa'un fi Akhbar al-Ta'un.\n53. Fadl Mawt al-Awlad.\n54. Khasa'is Yawm al-Jumu'ah.\n55. Minhaj al-Sunnah, wa Miftah al-Jannah.\n56. Tamhid al-Farsh fi al-Khisal al-Mujiba li-Zill al-Arsh.\n57. Buzugh al-Hilal fi al-Khisal al-Mujiba lil-Zilal.\n58. Miftah al-Jannah fi al-I'tisam bi al-Sunnah.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 16
  },
  {
    "serial_number": "2414369",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "59. Matla' al-Badrayn fi-man Yu'ta Ajrayn.\n60. Siham al-Isabah fi al-Da'awat al-Mujabah.\n61. Al-Kalim al-Tayyib.\n62. Al-Qawl al-Mukhtar fi al-Ma'thur min al-Da'awat wa al-Adhkar.\n63. Adhkar al-Adhkar.\n64. Al-Tibb al-Nabawi.\n65. Kashf al-Salsalah 'an Wasf al-Zalzalah.\n66. Al-Fawa'id al-Kaminah fi Iman al-Sayyida Aminah, also called \"Al-Ta'zim wa al-Minnah fi anna Abaway al-Nabi salla Allahu 'alayhi wa sallam fi al-Jannah.\"\n67. Al-Musalsalat al-Kubra.\n68. Jiyad al-Musalsalat.\n69. Abwab al-Sa'ada fi Asbab al-Shahada.\n70. Akhbar al-Mala'ika.\n71. Al-Thughur al-Basima fi Manaqib al-Sayyida Aminah.\n72. Manahij al-Safa fi Takhrij Ahadith al-Shifa.\n73. Al-Asas fi Manaqib Bani al-Abbas.\n74. Durr al-Sahaba fi-man Dakhala Misr min al-Sahaba.\n75. Zawa'id Shu'ab al-Iman lil-Bayhaqi.\n76. Lamm al-Atraf wa Damm al-Atraf.\n77. Itraf al-Ashraf bi-al-Ishraf 'ala al-Atraf.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 17
  },
  {
    "serial_number": "2414370",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "78. Jami' al-Masanid.\n79. Al-Fawa'id al-Mutakathira fi al-Akhbar al-Mutawatira.\n80. Al-Azhar al-Mutanathira fi al-Akhbar al-Mutawatira.\n81. Takhrij Ahadith al-Durra al-Fakhira.\n82. Takhrij Ahadith al-Kifaya, called Tajrubat al-Inaya.\n83. Al-Hasr wa al-Isha'a li-Ashrat al-Sa'a.\n84. Al-Durar al-Muntathira fi al-Ahadith al-Mushtahira.\n85. Zawa'id al-Rijal 'ala Tahdhib al-Kamal.\n86. Al-Durr al-Munazzam fi al-Ism al-Mu'azzam.\n87. Juz' fi al-Salat 'ala al-Nabi salla Allahu 'alayhi wa sallam.\n88. Man 'Asha min al-Sahaba Mi'a wa 'Ishrin.\n89. Juz' fi Asma' al-Mudallisin.\n90. Al-Luma' fi Asma' Man Wada'.\n91. Al-Arba'un al-Mutabayina.\n92. Durar al-Bihar fi al-Ahadith al-Qisar.\n93. Al-Riyad al-Aniqa fi Sharh Asma' Khayr al-Khaliqa.\n94. Al-Mirqat al-Aliyya fi Sharh al-Asma' al-Nabawiyyah.\n95. Al-Ayah al-Kubra fi Sharh Qissat al-Isra.\n96. Arba'un Hadithan min Riwayat Malik 'an Nafi' 'an Ibn Umar.\n97. Fihrist al-Marwiyyat.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 18
  },
  {
    "serial_number": "2414371",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "98. Bughyat al-Ra'id fi al-Dhayl 'ala Majma' al-Zawa'id.\n99. Azhar al-Akam fi Akhbar al-Ahkam.\n100. Al-Hiba al-Saniyya fi al-Hay'a al-Saniyya.\n101. Takhrij Ahadith Sharh al-Aqa'id.\n102. Fadl al-Jald.\n103. Al-Kalam 'ala Hadith Ibn Abbas: \"Ihfaz Allah Yahfazk,\" which is an opening speech I delivered when I took charge of the Hadith lesson at Al-Shaykhuniyyah.\n104. Arba'un Hadithan fi Fadl al-Jihad.\n105. Arba'un Hadithan fi Raf' al-Dayn fi al-Du'a.\n106. Al-Ta'rif bi-Adab al-Ta'lif.\n107. Al-Ushariyyat.\n108. Al-Qawl al-Ashbah fi Hadith: \"Man 'Arafa Nafsah Fa-qad 'Arafa Rabbah.\"\n109. Kashf al-Niqab 'an al-Alqab.\n110. Nashr al-Abir fi Takhrij Ahadith al-Sharh al-Kabir.\n111. Man Wafaqat Kunyatuhu Kunyata Zawjih min al-Sahaba.\n112. Dhamm Ziyarat al-Umara'.\n113. Zawa'id Nawadir al-Usul lil-Hakim al-Tirmidhi.\n114. Takhrij Ahadith al-Sihah, called Falaq al-Sabah.\n115. Dhamm al-Maks.\n116. Adab al-Muluk.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 19
  },
  {
    "serial_number": "2414372",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "**3 - The Art of Fiqh and its Attachments:**\n117. Al-Azhar al-Ghada fi Hawashi al-Rawda.\n118. Al-Hawashi al-Sughra.\n119. Mukhtasar al-Rawda, called Al-Qunya.\n120. Mukhtasar al-Tanbih, called Al-Wafi.\n121. Sharh al-Tanbih.\n122. Al-Ashbah wa al-Naza'ir.\n123. Al-Lawami' wa al-Bawariq fi al-Jawami' wa al-Fawariq.\n124. Nazm al-Rawda, called Al-Khulasa.\n125. Its explanation, called Raf' al-Khasasa.\n126. Al-Waraqat al-Muqaddimah.\n127. Sharh al-Rawd.\n128. Hashiya 'ala al-Qit'a lil-Isnawi.\n129. Al-Adhb al-Salsal fi Tashih al-Khilaf al-Mursal.\n130. Jam' al-Jawami'.\n131. Al-Yanbu' fima Zada 'ala al-Rawda min al-Furu'.\n132. Mukhtasar al-Khadim, called \"Tahsin al-Khadim.\"\n133. Tashnif al-Asma' bi-Masa'il al-Ijma'.\n134. Sharh al-Tadrib.\n135. Al-Kafi, Zawa'id al-Muhadhdhab 'ala al-Wafi.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 20
  },
  {
    "serial_number": "2414373",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "136. Al-Jami' fi al-Fara'id.\n137. Sharh al-Rahbiyyah fi al-Fara'id.\n138. Mukhtasar al-Ahkam al-Sultaniyyah lil-Mawardi.\n\n**4 - Individual Treatises on Specific Issues Arranged by Chapters:**\n139. Al-Zafar bi-Qalam al-Zufur.\n140. Al-Iqtinas fi Mas'alat al-Tamass.\n141. Al-Mustatrafa fi Ahkam Dukhul al-Hashafa.\n142. Al-Sulala fi Tahqiq al-Maqarr wa al-Istihala.\n143. Al-Rawd al-Arid fi Tuhr al-Mahid.\n144. Badhl al-Asjad li-Su'al al-Masjid.\n145. Al-Jawab al-Hazm 'an Hadith al-Takbir Jazm.\n146. Al-Qudhadha fi Tahqiq Mahall al-Isti'adha.\n147. Mizan al-Ma'dala fi Sha'n al-Basmala.\n148. Juz' fi Salat al-Duha.\n149. Al-Masabih fi Salat al-Tarawih.\n150. Bast al-Kaff fi Itmam al-Saff.\n151. Al-Lum'a fi Tahqiq al-Rak'a li-Idrak al-Jumu'a.\n152. Wusul al-Amani bi-Usul al-Tahani.\n153. Bulghat al-Muhtaj fi Manasik al-Hajj.\n154. Al-Salaf fi al-Tafsil bayna al-Salat wa al-Tawaf.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 21
  },
  {
    "serial_number": "2414374",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "155. Shadd al-Athwab fi Sadd al-Abwab fi al-Masjid al-Nabawi.\n156. Qat' al-Mujadala 'inda Taghyir al-Mu'amala.\n157. Izalat al-Wahan 'an Mas'alat al-Rahn.\n158. Badhl al-Himma fi Talab Bara'at al-Dhimma.\n159. Al-Insaf fi Tamyiz al-Awqaf.\n160. Unmudhaj al-Labib fi Khasa'is al-Habib.\n161. Al-Zahr al-Basim fima Yuzawwiju fihi al-Hakim.\n162. Al-Qawl al-Mudi fi al-Hinth fi al-Mudi.\n163. Al-Qawl al-Mushriq fi Tahrim al-Ishtighal fi al-Mantiq.\n164. Fasl al-Kalam fi Dhamm al-Kalam.\n165. Jazil al-Mawahib fi Ikhtilaf al-Madhahib.\n166. Taqrir al-Isnad fi Taysir al-Ijtihad.\n167. Raf' Manar al-Din wa Hadm Bina' al-Mufsidin.\n168. Tanzih al-Anbiya' 'an Tasfih al-Aghbiya'.\n169. Dhamm al-Qada'.\n170. Fasl al-Kalam fi Hukm al-Salam.\n171. Natijat al-Fikr fi al-Jahr bi-al-Dhikr.\n172. Tayy al-Lisan 'an Dhamm al-Taylasan.\n173. Tanwir al-Halak fi Imkan Ru'yat al-Nabi wa al-Malak.\n174. Adab al-Futya.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 22
  },
  {
    "serial_number": "2414375",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "175. Ilqam al-Hajar li-man Zakka Sabbab Abi Bakr wa Umar.\n176. Al-Jawab al-Hatim 'an Su'al al-Khatim.\n177. Al-Hujaj al-Mubina fi al-Tafdil bayna Makkah wa al-Madina.\n178. Fath al-Maghaliq min Anti Taliq.\n179. Fasl al-Khitab fi Qatl al-Kilab.\n180. Sayf al-Nazzar fi al-Farq bayna al-Thubut wa al-Takrar.\n\n**5 - The Art of Arabic and its Attachments:**\n181. Sharh Alfiyyat Ibn Malik, called Al-Bahja al-Mardiyya fi Sharh al-Alfiyyah.\n182. Al-Farida fi al-Nahw wa al-Tasrif wa al-Khat.\n183. Al-Nukat 'ala al-Alfiyya wa al-Kafiya wa al-Shafiya wa al-Shudhur wa al-Nuzha.\n184. Al-Fath al-Qarib 'ala Mughni al-Labib.\n185. Sharh Shawahid al-Mughni.\n186. Jam' al-Jawami'.\n187. Its explanation, called Ham' al-Hawami'.\n188. Sharh al-Mulha.\n189. Mukhtasar al-Mulha.\n190. Mukhtasar al-Alfiyya wa Daqa'iquha.\n191. Al-Akhbar al-Marwiyya fi Sabab Wad' al-Arabiyya.\n192. Al-Masa'id al-Aliyya fi al-Qawa'id al-Nahwiyyah.\n193. Al-Iqtirah fi Usul al-Nahw wa Jadalihi.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 23
  },
  {
    "serial_number": "2414376",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "194. Raf' al-Sinna fi Nasb al-Zinna.\n195. Al-Sham'a al-Mudi'a.\n196. Sharh Kafiyat Ibn Malik.\n197. Durr al-Taj fi I'rab Mushkil al-Minhaj.\n198. Mas'alat Darbi Zaydan Qa'iman.\n199. Al-Silsila al-Muwashshaha.\n200. Al-Shahd.\n201. Shadha al-Arf fi Ithbat al-Ma'na lil-Harf.\n202. Al-Tawshih 'ala al-Tawdih.\n203. Al-Sayf al-Saqil fi Hawashi Ibn Aqil.\n204. Hashiya 'ala Sharh al-Shudhur.\n205. Sharh al-Qasida al-Kafiya fi al-Tasrif.\n206. Qatr al-Nada fi Wurud al-Hamza lil-Nida.\n207. Sharh Tasrif al-Izzi.\n208. Sharh Daruri al-Tasrif li-Ibn Malik.\n209. Ta'rif al-A'jam bi-Huruf al-Mu'jam.\n210. Nukat 'ala Sharh al-Shawahid lil-Ayni.\n211. Fajr al-Thamad fi I'rab Akmal al-Hamd.\n212. Al-Zand al-Wari fi al-Jawab 'an al-Su'al al-Iskandari.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 24
  },
  {
    "serial_number": "2414377",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "**6 - The Art of Usul, Bayan, and Sufism:**\n213. Sharh Lum'at al-Ishraq fi al-Ishtiqaq.\n214. Al-Kawkab al-Sati' fi Nazm Jam' al-Jawami'.\n215. Its explanation.\n216. Sharh al-Kawkab al-Waqqad fi al-I'tiqad.\n217. Nukat 'an al-Talkhis, called Al-Ifsah.\n218. Uqud al-Juman fi al-Ma'ani wa al-Bayan.\n219. Its explanation.\n220. Sharh Abyat Talkhis al-Miftah.\n221. Its abridgment.\n222. Nukat 'ala Hashiyat al-Mutawwal li-Ibn al-Fanari, may Allah have mercy on him.\n223. Hashiya 'ala al-Mukhtasar.\n224. Al-Badi'iyyah.\n225. Its explanation.\n226. Ta'yid al-Haqiqa al-Aliyya wa Tashyid al-Tariqa al-Shadhiliyya.\n227. Tashyid al-Arkan fi Laysa fi al-Imkan Abda' mimma Kan.\n228. Darj al-Ma'ali fi Nusrat al-Ghazali 'ala al-Munkir al-Mutaghali.\n229. Al-Khabar al-Dall 'ala Wujud al-Qutb wa al-Awtad wa al-Nujaba' wa al-Abdal.\n230. Mukhtasar al-Ihya'.\n231. Al-Ma'ani al-Daqiqa fi Idrak al-Haqiqa.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 25
  },
  {
    "serial_number": "2414378",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "232. Al-Nuqaya fi Arba'at Ashar 'Ilman.\n233. Its explanation.\n234. Shawarid al-Fawa'id.\n235. Qala'id al-Fara'id.\n236. Nazm al-Tadhkira, called Al-Fulk al-Mashhun.\n237. Al-Jam' wa al-Tafriq fi al-Anwa' al-Badi'iyyah.\n\n**7 - The Art of History and Literature:**\n... - Tarikh al-Sahaba (History of the Companions), mentioned before (1).\n238. Tabaqat al-Huffaz.\n239. Tabaqat al-Nuhat al-Kubra.\n240. And Al-Wusta (Intermediate).\n241. And Al-Sughra (Small).\n242. Tabaqat al-Mufassirin.\n243. Tabaqat al-Usuliyyin.\n244. Tabaqat al-Kuttab.\n245. Hilyat al-Awliya'.\n246. Tabaqat Shu'ara' al-Arab.\n247. Tarikh Misr [meaning Husn al-Muhadarah].",
    "foot_note": "1. (1) Mentioned as \"Ayn al-Isabah\" number (35).",
    "book_id": "976",
    "new_page_number": 26
  },
  {
    "serial_number": "2414379",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "248. Tarikh al-Khulafa'.\n249. Tarikh Asyut.\n250. Mu'jam Shuyukhi al-Kabir, called \"Hatib Layl wa Jarif Sayl.\"\n251. Al-Mu'jam al-Saghir, called \"Al-Muntaqa.\"\n252. Tarjamat al-Nawawi.\n253. Tarjamat al-Bulqini.\n254. Al-Multaqat min al-Durar al-Kamina.\n255. Tarikh al-Umr, a tail to Inba' al-Ghumr.\n256. Raf' al-Ba's 'an Bani al-Abbas.\n257. Al-Nafha al-Miskiyya wa al-Tuhfa al-Makkiyya, in the style of Unwan al-Sharaf.\n258. Durar al-Kalim wa Ghurar al-Hikam.\n259. Diwan Khutab.\n260. Diwan Shi'r.\n261. Al-Maqamat.\n262. Al-Rihla al-Fayyumiyya.\n263. Al-Rihla al-Makkiyya.\n264. Al-Rihla al-Dumyatiyya.\n265. Al-Wasa'il ila Ma'rifat al-Awa'il.\n266. Mukhtasar Mu'jam al-Buldan.\n267. Yaqut al-Shamareekh fi 'Ilm al-Tarikh.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 27
  },
  {
    "serial_number": "2414380",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "268. Al-Jumana, a treatise explaining common words.\n269. Maqati' al-Hijaz.\n270. Nur al-Hadiqa min Nazm al-Qawl.\n271. Al-Mujmal fi al-Radd 'ala al-Muhmal.\n272. Al-Muna fi al-Kuna.\n273. Fasl al-Shita'.\n274. Mukhtasar Tahdhib al-Asma' lil-Nawawi.\n275. Al-Ajwiba al-Zakiyya 'an al-Alghaz al-Subkiyya.\n276. Raf' Sha'n al-Hubshan.\n277. Ahsan al-Aqbas fi Mahasin al-Iqtibas.\n278. Tuhfat al-Mudhakir fi al-Muntaqa min Tarikh Ibn Asakir.\n279. Sharh Banat Su'ad.\n280. Tuhfat al-Zurafa' bi-Asma' al-Khulafa'.\n281. Qasida Ra'iyya.\n282. Mukhtasar Shifa' al-Ghalil fi Dhamm al-Sahib wa al-Khalil. End.\nFor more, see the list of Al-Suyuti's works preserved at the American University - Beirut.\n\n**His Illness and Death:**\nNajm al-Din al-Ghazzi (1) says: His death, may Allah be pleased with him, was at...",
    "foot_note": "1. (1) Al-Kawakib al-Sa'irah 1 / 231. (*)",
    "book_id": "976",
    "new_page_number": 28
  },
  {
    "serial_number": "2414381",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "...dawn on the night of Friday, the nineteenth of Jumada al-Ula, year 911, in his home at Rawdat al-Miqyas, after being ill for seven days with a severe swelling in his left arm. He had completed sixty-one years, ten months, and eighteen days of age. He had a great funeral procession and was buried in Hawsh Qarsun outside Bab al-Qarafa. Absentee funeral prayer was performed for him in Damascus at the Umayyad Mosque on Friday, the eighth of Rajab, year 911. It is said that the washer took his shirt and cap; some people bought his shirt from the washer for five dinars to seek blessing from it, and his cap was sold for three dinars for the same purpose. Abd al-Basit bin Khalil al-Hanafi eulogized him in a long poem saying:\nJalal al-Din, the rain of mankind, has died * The Mujtahid of the age, the Imam of existence\nThe Guardian of Sunnah, the Guide of Guidance * The Director of the lost with returning benefit\nSo O my eyes, flow after him * And O hearts, break apart with burning fuel\nAnd darken, O world, for it is right * Nay, it is right for thunders to roar in you.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 29
  },
  {
    "serial_number": "2414382",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "**Description of Manuscripts**\nIn verifying the book, we relied on two manuscripts. First: At the Egyptian National Library, Tal'at Library, No. 3 Majami'. Second: Al-Azhar Manuscript, under No. 56 Majami' - 1115 - Endowment to the Turkish Riwaq. Our reliance in verification was on the first copy - due to the soundness of the text and clarity of the script. As for the second copy, it was an auxiliary copy in case the text became confused or understanding it was difficult. The first copy is distinguished by being in the handwriting of the author's student Al-Dawudi, as he mentioned at its end: \"The end of what was found in the author's handwriting, may Allah have mercy on him. It was his intention to produce a comprehensive work, but death overtook him, and there is no power nor strength except by Allah. Written by: From the handwriting of his student Muhammad bin Ali al-Dawudi, may Allah Almighty have mercy on him.\"",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 30
  },
  {
    "serial_number": "2414383",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "**In the Name of Allah, the Most Gracious, the Most Merciful, and in Him we seek help**\n\nPraise be to Allah, the Causer of causes and the Driver of clouds, and prayers and peace upon our Master Muhammad and the Family and Companions... To proceed:\nAmong the types of Hadith sciences is knowing its causes, like the causes of revelation of the Quran. Imams have authored books on the causes of revelation of the Quran, and the book of Al-Wahidi is famous among them. I have a comprehensive work on it called \"Lubab al-Nuqul fi Asbab al-Nuzul.\"\nAs for the causes of Hadith, some of the predecessors wrote on it, but we have not come across it; they only mentioned it in his biography. Hafiz Abu al-Fadl Ibn Hajar mentioned it in \"Sharh al-Nukhba.\" I loved to compile a book on it, so I tracked the collections of Hadith and picked fragments from them, gathering them in this book. And Allah is the Grantor of success and Guide to the right path.\n\n**Section**\nSheikh al-Islam Siraj al-Din al-Bulqini said in his book \"Mahasin al-Istilah\": The sixty-ninth type: Knowing the causes of Hadith.\nSheikh Abu al-Fath al-Qushayri, known as Ibn Daqiq al-Eid, may Allah have mercy on him, said in \"Sharh al-Umdah\" discussing the hadith: \"Actions are but by intentions\" in the ninth research: Some late scholars of Hadith began classifying the causes of Hadith, just as was classified for the causes of revelation of the Noble Book. I came across a little of that.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 31
  },
  {
    "serial_number": "2414384",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "The hadith: \"Actions are but by intentions\" falls into this category, and many analogues join this for whoever intends to track it. This is the Sheikh's speech.\nAl-Bulqini said: Know that the cause may be transmitted within the hadith, as in the hadith: Gabriel asking about Islam and Ihsan and others. And the hadith: The two Qullahs (large jars), he was asked about water in the desert and what befalls it from carnivores and animals. And the hadith: Intercession, its cause is his saying, peace be upon him: \"I am the master of the children of Adam, and no pride.\" And the hadith: The question of the Najdi. And the hadith: \"Pray, for you have not prayed.\" And the hadith: \"Take a piece of musk.\" And the hadith: Asking about menstrual blood affecting the garment. And the hadith: The questioner: Which deeds are best? And the hadith: Asking which sin is greatest? And that is frequent.\nThe cause may not be transmitted in the hadith, or transmitted in some of its routes, so that is what should be cared for. Among that is the hadith: \"The best prayer of a person is in his house except the obligatory.\" Narrated by Al-Bukhari, Muslim, and others from the hadith of Zayd bin Thabit. It was reported in some hadiths in response to a questioner's question, which is what Ibn Majah narrated in his Sunan and Al-Tirmidhi in Al-Shama'il from the hadith of Abdullah bin Sa'd who said: I asked the Messenger of Allah, peace be upon him: Which is better, prayer in my house or prayer in the mosque? He said: \"Do you not see my house? How close it is to the mosque! Yet to pray in my house is more beloved to me than to pray in the mosque, unless it be an obligatory prayer.\"\nThen Al-Bulqini mentioned several examples and said: What is mentioned in this type of causes, it may be that what is mentioned after that cause from the words of the Prophet, peace be upon him, was the first thing spoken by...",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 32
  },
  {
    "serial_number": "2414385",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "...the Prophet, peace be upon him, at that time. And he might have spoken it before that, for a similar cause or for no cause. Sometimes it is determined to be the first time he spoke it at that time due to indications. This becomes apparent to one knowledgeable in this field. In the chapters of Sharia and stories and others, there are hadiths that have causes whose explanation would be lengthy. What we mentioned is a model for whoever wants to know that, and an entrance for whoever wants to add an extensive work on that. The hope from Allah Almighty is for help on an extensive work on it by His grace and generosity.\nIbn al-Mulaqqin said in Sharh al-Umdah: Know that some late scholars of Hadith began classifying the causes of Hadith. Sheikh Izz al-Din attributed this to some late scholars, and Ibn al-Attar in his explanation attributed it to Ibn al-Jawzi. I heard someone mention: that Abd al-Ghani bin Sa'id al-Hafiz classified a work on it the size of Al-Umdah. Whoever tracks the hadiths is capable of extracting a group of them, and I hope to undertake it, God willing. End.\n\n**Chapter on Purification**\n\n[1] **Hadith:** The six Imams (1) narrated from Umar bin al-Khattab, may Allah be pleased with him, who said: I heard the Messenger of Allah, peace be upon him, saying: \"Actions are but by intentions and every man shall have only what he intended. Thus he whose migration was to Allah and His Messenger, his migration was to Allah...",
    "foot_note": "1. (1) Narrated by Al-Bukhari in Beginning of Revelation 1 / 2. Narrated by Muslim in Book of Leadership 4 / 572. Narrated by Al-Nasa'i in Book of Purification 1 / 51. Narrated by Ibn Majah in Book of Asceticism 2 / 1413. (*)",
    "book_id": "976",
    "new_page_number": 33
  },
  {
    "serial_number": "2414386",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "...and His Messenger, and he whose migration was for some worldly asset he would gain or a woman he would marry, his migration was to that to which he migrated.\"\n**Cause:** Al-Zubayr bin Bakkar said in Akhbar al-Madina: Muhammad bin al-Hasan told me from Muhammad bin Talha bin Abd al-Rahman from Musa bin Muhammad bin Ibrahim bin al-Harith from his father who said: When the Messenger of Allah, peace be upon him, arrived in Medina, his companions suffered fever there. A man arrived and married a woman who had migrated. The Messenger of Allah, peace be upon him, sat on the pulpit and said: \"O people, actions are only by intention\" three times. \"So whoever's migration was to Allah and His Messenger, his migration was to Allah and His Messenger. Whoever's migration was for a worldly gain he seeks, or a woman he proposes to, his migration is only to what he migrated to.\" Then he raised his hands and said: \"O Allah, remove the epidemic from us\" three times. When morning came, he said: I was brought the fever tonight, and behold, it was a black woman held by the neck in the hand of the one who brought her. He said: This is the fever, what do you see? I said: Put her in Khumm.\n\n[2] **Hadith:** Malik, Al-Shafi'i, Ahmad, and Ibn Abi Shaybah (1) narrated from Abu Huraira who said: The Messenger of Allah, peace be upon him, said regarding the sea: \"Its water is purifying, its dead animals are lawful.\"\n**Cause:** Ahmad, Al-Hakim, and Al-Bayhaqi narrated from Abu Huraira who said: We were with the Messenger of Allah, peace be upon him, one day, and a fisherman came and said: O Messenger of Allah, we set out on the sea seeking to fish. One of us carries a water skin with him hoping to catch fish soon. Sometimes he finds it so, and sometimes he does not find fish until he reaches a place in the sea he did not think he would reach. perhaps he has a wet dream or needs to perform ablution. If he bathes or performs ablution with this water (from the skin),",
    "foot_note": "1. (1) Mentioned by Malik in Al-Muwatta in Book of Purification. Narrated by Al-Shafi'i in his Musnad 1 / 2. Ahmad in Al-Musnad 3 / 373. Narrated by Ibn Abi Shaybah 1 / 301. (*)",
    "book_id": "976",
    "new_page_number": 34
  },
  {
    "serial_number": "2414387",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "thirst might kill one of us. Do you see fit regarding sea water that we bathe with it or perform ablution with it if we fear that? The Messenger of Allah, peace be upon him, said: \"Bathe from it and perform ablution, for its water is purifying and its dead animals are lawful.\"\n\n[3] **Hadith:** Ahmad, Ibn Khuzaimah, and Ibn Hibban (1) narrated from Ibn Abbas who said: The Messenger of Allah, peace be upon him, said: \"Water is not made impure by anything.\"\n**Cause:** Ahmad, Abu Dawood, Al-Tirmidhi, and Al-Nasa'i - and the wording is his - narrated from Ibn Sa'id al-Khudri who said: I passed by the Prophet, peace be upon him, while he was performing ablution from the well of Buda'ah. I said: Do you perform ablution from it while things disliked of filth are thrown into it? He said: \"Water is not made impure by anything.\"\n\n[4] **Hadith:** Abu Ahmad al-Hakim and Al-Bayhaqi (2) narrated from Yahya bin Ya'mar that the Prophet, peace be upon him [said]: \"If water reaches two Qullahs (large jars), it does not carry impurity nor harm - or he said filth.\"\n**Cause:** Ahmad narrated from Ibn Umar, who said: I heard the Messenger of Allah, peace be upon him, being asked about water in the open land and what befalls it from animals and carnivores. The Prophet, peace be upon him, said: \"If water reaches two Qullahs, nothing makes it impure.\"\n\n[5] **Hadith:** Al-Tirmidhi (3) narrated from Abdullah bin Mas'ud who said: The Messenger of Allah, peace be upon him, said: \"Do not clean yourselves (after defecation) with dung nor with bones, for it is the provision of your brothers from the Jinn.\"",
    "foot_note": "1. (1) Narrated by Ahmad 1 / 235. Narrated by Ibn Khuzaimah 1 / 60. Narrated by Ibn Hibban in Al-Taqrib 2 / 389. \n2. Narrated by Al-Hakim 1 / 133. Narrated by Al-Bayhaqi in Al-Sunan Al-Kubra 1 / 263. \n3. Narrated by Al-Tirmidhi in Book of Purification 1 / 151. (*)",
    "book_id": "976",
    "new_page_number": 35
  },
  {
    "serial_number": "2414388",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "**Cause:** Al-Tabarani and Abu Nu'aym in \"Al-Dala'il\" narrated from Ibn Mas'ud who said: While we were with the Messenger of Allah, peace be upon him, in Mecca, and he was with a group of his companions, he said: \"Let a man from you stand with me, and let no man stand with me who has in his heart an atom's weight of deceit.\" He said: So I stood with him and took a water skin, thinking it was only water. I went out with the Messenger of Allah, peace be upon him, until when we were at the top of Mecca, I saw gathered black shapes. He said: The Messenger of Allah, peace be upon him, drew a line for me then said: \"Stand here until I come to you.\" He said: So I stood and the Messenger of Allah, peace be upon him, went to them, and I saw them swarming towards him. He said: The Messenger of Allah, peace be upon him, conversed with them for a long night until he came to me at dawn. He said to me: \"Are you still standing, O Ibn Mas'ud?\" He said: I said to him: O Messenger of Allah, did you not tell me to stand until you come to me? He said: Then he said to me: \"Do you have water (Wudu')?\" He said: I said: Yes. I opened the skin and behold it was Nabidh (date water). He said: I said to him: O Messenger of Allah! By Allah, I took the skin thinking it was only water, and behold it is Nabidh. The Messenger of Allah, peace be upon him, said: \"A good fruit and purifying water.\" He said: Then he performed ablution from it. When he stood to pray, two individuals from them caught up with him and said to him: O Messenger of Allah, we would like you to lead us in our prayer. He said: So the Messenger of Allah, peace be upon him, lined them up behind him, then prayed with us. When he finished, I said to him: Who are these, O Messenger of Allah? He said: \"These are the Jinn of Nusaybin, they came to me disputing about matters between them, and they asked me for provision, so I provided for them.\" He said: I said to him: And do you have, O Messenger of Allah, anything to provide them with? He said: He said: \"I have provided for them.\" I said: What did you provide them with? He said: \"Refuse (dung); whatever dung they find, they find it as barley, and whatever bone they find, they find it clothed (with meat).\" He said: At that, the Messenger of Allah, peace be upon him, forbade cleaning oneself with dung and bone.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 36
  },
  {
    "serial_number": "2414389",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "[6] **Hadith:** Al-Bukhari, Muslim, and Al-Tirmidhi (1) narrated from Abu Huraira who said: The Messenger of Allah, peace be upon him, said: \"Woe to the heels from the Fire.\"\n**Cause:** Al-Bukhari and Muslim narrated from Abdullah bin Amr who said: The Prophet, peace be upon him, lagged behind us in a journey we traveled. He caught up with us while prayer time was pressing and we were performing ablution. We began wiping over our feet. He called out with his loudest voice: \"Woe to the heels from the Fire\" twice or thrice.\nAhmad narrated from Jabir who said: The Messenger of Allah, peace be upon him, saw people performing ablution, and water did not touch their heels, so he said: \"Woe to the heels from the Fire.\"\n\n[7] **Hadith:** Narrated [\"Wipe over the leather socks (Khuffayn) and the head cover (Khimar)\"] (2).\n**Cause:** Ahmad and Abu Dawood narrated from Thawban: The Messenger of Allah, peace be upon him, sent a detachment and they were affected by cold. When they returned to the Messenger of Allah, peace be upon him, they complained to him about the cold they encountered. So he ordered them to wipe over turbans (Asa'ib) and foot warmers (Tasakhin).\n\n[8] **Hadith:** Malik and the six Imams (3) narrated from Umar that the Messenger of Allah, peace be upon him, said: \"If one of you comes to Friday prayer, let him bathe.\"\n**Cause:** Ahmad, Abu Dawood, and Al-Hakim (who authenticated it, and the wording is his) narrated via",
    "foot_note": "1. (1) Mentioned by Al-Bukhari in Book of Knowledge 1 / 23. Narrated by Muslim in Book of Purification 1 / 528. Narrated by Al-Tirmidhi in Book of Purification 1 / 30. \n2. Blank in the original, supplementation from Musnad Ahmad 6 / 13. \n3. Narrated by Malik in Book of Friday 1 / 102. Narrated by Al-Bukhari and Muslim in Book of Friday. Narrated by Al-Nasa'i Book of Friday 3 / 76. Narrated by Ibn Majah in Book of Establishing Prayer 1 / 346. (*)",
    "book_id": "976",
    "new_page_number": 37
  },
  {
    "serial_number": "2414390",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "Ikrimah from Ibn Abbas that two men from the people of Iraq came to him and asked him about bathing on Friday, is it obligatory? Ibn Abbas said to them: Whoever bathes, it is better and purer, and I will tell you why bathing started. People in the time of the Messenger of Allah, peace be upon him, were needy, wearing wool, watering palms on their backs. The mosque was narrow and close. The Messenger of Allah, peace be upon him, went out on Friday on a hot summer day. His pulpit was short, only three steps. He preached to the people, and the people sweated in the rows. Their bodies emitted the smell of sweat and wool until they almost harmed each other, until their smells reached the Messenger of Allah, peace be upon him, while he was on the pulpit. He said: \"O people, when this day comes, bathe, and let one of you touch the best perfume or oil he finds.\"\nAl-Nasa'i narrated from Al-Qasim bin Muhammad bin Abi Bakr that they mentioned bathing on Friday in the presence of Aisha. She said: People used to live in the high lands (Al-Aliyah) and attend Friday prayer with dirt on them. When the breeze hit them, their smells wafted and people were harmed by it. That was mentioned to the Messenger of Allah, peace be upon him, so he said: \"Will you not bathe?\"\nIbn Hibban narrated via Urwa bin al-Zubayr from Aisha that she said: People used to take turns attending Friday prayer from their homes in the high lands (Al-Awali). They would come in cloaks, covered in dust and sweat, and a smell would emanate from them. One of them came to the Messenger of Allah, peace be upon him, while he was with me. The Messenger of Allah, peace be upon him, said: \"If only you would purify yourselves for this day of yours.\"",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 38
  },
  {
    "serial_number": "2414391",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "**Chapter on Prayer**\n\n[9] **Hadith:** Al-Bukhari and Muslim (1) narrated from Anas who said: The Messenger of Allah, peace be upon him, said: \"Whoever sleeps through a prayer or forgets it, its expiation is to pray it when he remembers it; there is no expiation for it except that, (and establish prayer for My remembrance).\"\n**Cause:** Abu Ahmad al-Hakim, whose name is Muhammad bin Ishaq the Hafiz, said in a session of his dictations: Abu Ja'far Muhammad bin al-Husayn al-Hinnawi told us, Muhammad bin al-Ala' told us, Khalaf bin Ayyub al-Amiri told us, Ma'mar told us, from Al-Zuhri, from Sa'id bin al-Musayyib, from Abu Huraira that the Messenger of Allah, peace be upon him, on the night he was taken on the night journey (Isra'), slept until the sun rose, then he prayed and said: \"Whoever sleeps through a prayer or forgets it, let him pray it when he remembers it.\" Then he recited (and establish prayer for My remembrance).\nI saw in the handwriting of Sheikh Wali al-Din al-Iraqi in some of his collections, citing this hadith with its text: Abu Ahmad al-Hakim narrated it in a session of his dictations and said: Strange from the hadith of Ma'mar, from Al-Zuhri, from Sa'id, from Abu Huraira raised (musnad). I do not know anyone who narrated it other than Khalaf bin Ayyub al-Amiri from this narration, and Aban bin Yazid al-Attar from him, meaning from Ma'mar.\nSheikh Wali al-Din said: It is good to be about the famous answer, which is: Gabriel's explanation did not occur except at Zuhr, and prayer had been obligated at night? It is said: The Prophet, peace be upon him, was sleeping at the time of Fajr, and the sleeper is not accountable. He said: This is a great benefit. And the hadith has an authentic chain. End.\nI say: It is not as he said. For the intended meaning in...",
    "foot_note": "1. (1) Narrated by Al-Bukhari in Book of Prayer Times 1 / 154. Narrated by Muslim in Book of Mosques 2 / 334. (*)",
    "book_id": "976",
    "new_page_number": 39
  },
  {
    "serial_number": "2414392",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "...this hadith is the night he traveled (Isra' here meaning night travel) in a journey and slept through the Fajr prayer, not the night he was taken on the night journey to heaven. So the word 'Isra' confused him.\n**Second Cause:** Al-Tirmidhi (who authenticated it) and Al-Nasa'i narrated from Abu Qatada who said: They mentioned to the Prophet, peace be upon him, their sleeping through prayer. He said: \"There is no negligence in sleep; negligence is only in wakefulness. So if one of you forgets a prayer or sleeps through it, let him pray it when he remembers it.\"\nAhmad narrated from Abu Qatada who said: We were with the Messenger of Allah, peace be upon him. He said: \"If you do not reach water tomorrow, you will be thirsty.\" The people rushed wanting water. I stuck to the Messenger of Allah, peace be upon him. His mount leaned with the Messenger of Allah, peace be upon him, so the Messenger of Allah, peace be upon him, dozed off. I supported him, so he leaned. Then he leaned until he almost fell off his mount, so I supported him, and he woke up. He said: \"Who is the man?\" I said: Abu Qatada. He said: \"How long have you been traveling?\" I said: Since the night. He said: \"May Allah preserve you as you preserved His Messenger.\" Then he said: \"If we rest (sleep).\" He leaned towards a tree and dismounted. He said: \"Look, do you see anyone?\" I said: Here is a rider, here are two riders, until it reached seven. He said: \"Guard our prayer for us.\" We slept, and nothing woke us but the heat of the sun. We woke up. The Messenger of Allah, peace be upon him, rode and traveled, and we traveled a little. Then he dismounted and said: \"Do you have water?\" He said: I said: Yes, I have a vessel with some water. He said: \"Bring it.\" I brought it to him. He said: \"Touch from it.\" The people performed ablution and a sip remained. He said: \"Keep it, O Abu Qatada, for it will have a story.\" Then Bilal called Adhan, and they prayed the two rak'ahs before Fajr, then they prayed Fajr. Then they rode and we rode. Some said to others: We have neglected our prayer. The Messenger of Allah, peace be upon him, said: \"What are you saying? If it is a matter of your world, it is your affair; if it is a matter of your religion, it is to me.\" We said: O Messenger of Allah, we neglected our prayer. He said: \"There is no negligence in...",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 40
  },
  {
    "serial_number": "2414393",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "...sleep; negligence is only in wakefulness. So if that happens, pray it, and its time is the next day.\"\n\n[10] **Hadith:** Ahmad (1) narrated from Al-Sa'ib bin Abi al-Sa'ib from the Prophet, peace be upon him, who said: \"The prayer of the sitting person is half the prayer of the standing person.\"\nAnd Al-Bukhari narrated from Imran bin Husayn that the Messenger of Allah, peace be upon him, said: \"Whoever prays sitting has half the reward of the standing person.\"\n**Cause:** Abd al-Razzaq in Al-Musannaf and Ahmad narrated from Anas who said: When the Prophet, peace be upon him, arrived in Medina, it was fever-ridden, so the people got fever. The Prophet, peace be upon him, entered the mosque while people were praying sitting. The Prophet, peace be upon him, said: \"The prayer of the sitting person is half the prayer of the standing person.\" So the people forced themselves to pray standing.\nAbd al-Razzaq narrated from Abdullah bin Amr who said: We arrived in Medina and a severe epidemic of Medina's fever struck us. People frequently prayed their voluntary prayers sitting. The Prophet, peace be upon him, came out at midday while they were praying their voluntary prayers sitting. He said: \"The prayer of the sitter is half the prayer of the stander.\" He said: So the people then began forcing themselves to stand.\n\n[11] **Hadith:** Al-Bukhari and Muslim (2) narrated from Abu Huraira that the Messenger of Allah, peace be upon him, said: \"Does one of you not fear, or does one of you not fear, that if he raises his head before the Imam, Allah will turn his head into a donkey's head or turn his form into a donkey's form?\"\n**Cause:** Ahmad narrated from Abu Sa'id al-Khudri who said: A man prayed...",
    "foot_note": "1. (1) Narrated by Ahmad 4 / 435. \n2. Narrated by Al-Bukhari 1 / 177 and Muslim 2 / 73. (*)",
    "book_id": "976",
    "new_page_number": 41
  },
  {
    "serial_number": "2414394",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "...behind the Prophet, peace be upon him, and began bowing before he bowed and raising before he raised. When the Prophet, peace be upon him, finished the prayer, he said: \"Who did this?\" He said: I, O Messenger of Allah, I loved to know if you know that or not. He said: \"Fear invalidating the prayer. If the Imam bows, then bow, and if he raises, then raise.\"\n\n[12] **Hadith:** Abu Dawood (1) narrated from Abu Sa'id al-Khudri that the Messenger of Allah, peace be upon him, used to say when he said: \"Allah hears him who praises Him\": \"O Allah our Lord, to You is praise, filling the heavens and filling the earth and filling whatever You wish of anything after. O Worthy of Praise and Glory, the most truthful thing a slave said, and we are all Your slaves. None can prevent what You have given, and none can give what You have prevented, and the wealth of the wealthy does not avail him against You.\"\n**Cause:** Ibn Majah and Abu Muti' in his Amali narrated from Umar who said: I heard Abu Juhayfa, may Allah be pleased with him, saying: Fortunes (Judud) were mentioned in the presence of the Messenger of Allah, peace be upon him, while he was in prayer. A man said: So-and-so's fortune is in horses. Another said: So-and-so's fortune is in camels. Another said: So-and-so's fortune is in sheep. Another said: So-and-so's fortune is in slaves. When the Messenger of Allah, peace be upon him, finished his prayer and raised his head from the last rak'ah, he said: \"O Allah our Lord, to You is praise filling the heavens and filling the earth and filling whatever You wish of anything after. O Allah, none can prevent what You have given, and none can give what You have prevented, and the wealth (Jadd) of the wealthy does not avail him against You.\" The Messenger of Allah, peace be upon him, prolonged his voice with \"Al-Jadd\" so they would know it is not as they say.\n\n[13] **Hadith:** The six Imams (2) narrated from Abu Huraira who said: The Messenger of...",
    "foot_note": "1. (1) Narrated by Abu Dawood in Book of Prayer 1 / 195. \n2. Narrated by Al-Bukhari in Book of Adhan 1 / 164. Narrated by Muslim in Book of Mosques 2 / 245. Also narrated by Al-Nasa'i in Book of Prayer and Ibn Majah in Book of Mosques. (*)",
    "book_id": "976",
    "new_page_number": 42
  },
  {
    "serial_number": "2414395",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "...Allah, peace be upon him, said: \"If the prayer is established, do not come to it running, but come to it walking, and have tranquility. Whatever you catch, pray, and whatever you missed, complete.\"\n**Cause:** Ahmad, Al-Bukhari, and Muslim narrated from Abu Qatada from his father who said: While we were praying with the Messenger of Allah, peace be upon him, he heard the commotion of men. When he prayed, he called them and said: \"What is your matter?\" They said: O Messenger of Allah! We hurried to the prayer. He said: \"Do not do that. If you come to the prayer, have tranquility. Whatever you catch, pray, and whatever preceded you, complete.\"\n\n[14] **Hadith:** Al-Tirmidhi (1) narrated from Ali and from Amr bin Murrah from his father from Ibn Abi Layla from Mu'adh who said: The Messenger of Allah, peace be upon him, said: \"If one of you comes to the prayer and the Imam is in a state, let him do as the Imam does.\"\n**Cause:** Al-Tabarani narrated from Mu'adh who said: People in the time of the Messenger of Allah, peace be upon him, if one of them was late for part of the prayer, he would ask them, and they would signal to him what he missed. He would pray what he missed then join them in their prayer. Mu'adh came and the people were sitting in their prayer, so he sat with them. When the Messenger of Allah, peace be upon him, said salam, he stood to make up what he missed. The Messenger of Allah, peace be upon him, said: \"Do what Mu'adh did.\" In a narration of his: I said: I will not find him in a state except that I will be on it. So I was in their state in which I found them. The Messenger of Allah, peace be upon him, said: \"Mu'adh has set a sunnah for you, so follow him. If one of you comes and has missed part of the prayer, let him pray with the Imam in his prayer, and when the Imam finishes, let him make up what he missed.\"\n\n[15] **Hadith:** Al-Bukhari and Muslim (2) narrated from Ibn Umar that the Messenger of Allah...",
    "foot_note": "1. (1) Narrated by Al-Tirmidhi in Prayer 2 / 51. \n2. Narrated by Muslim in Book of Mosques 2 / 196 and Al-Bukhari in Book of Beginning... _________ .",
    "book_id": "976",
    "new_page_number": 43
  },
  {
    "serial_number": "2414396",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "...peace be upon him said: \"Whoever eats from this plant should not approach our mosque until its smell goes away.\" Meaning garlic. Muslim narrated from Abu Huraira who said: The Messenger of Allah, peace be upon him, said: \"Whoever eats from this tree should not approach our mosque, for he harms us with the smell of garlic.\"\n**Cause:** Ahmad narrated from Al-Mughira bin Shu'ba who said: I ate garlic then came to the Prophet's place of prayer, peace be upon him. I found he had preceded me by one rak'ah. When he prayed, I stood to make up. He found the smell of garlic and said: \"Whoever eats from this plant should not approach our mosque until its smell goes away.\" He said: When I finished the prayer, I came and said: O Messenger of Allah, I have an excuse, give me your hand. He said: I found him, by Allah, easy. He gave me his hand, and I put it inside my sleeve to my chest; he found it bandaged. He said: \"You have an excuse.\"\n**Cause:** Ahmad and Muslim narrated from Jabir that the Prophet, peace be upon him, forbade onions and leeks at the time of Khaybar. Some people ate them and came to the mosque. The Prophet, peace be upon him, said: \"Did I not forbid these two foul trees?\" They said: Yes, O Messenger of Allah, but hunger exhausted us. The Messenger of Allah, peace be upon him, said: \"Whoever eats them should not attend our mosque, for the angels are harmed by what the children of Adam are harmed by.\"\nAhmad narrated from Abu Tha'labah al-Khushani who said: I fought with the Messenger of Allah, peace be upon him, and people were hungry. We found domestic donkeys there and slaughtered them. He said: The Prophet, peace be upon him, was informed, so he ordered Abd al-Rahman bin Awf to call out among the people: \"The meat of domestic donkeys is not lawful for anyone who testifies that I am the Messenger of Allah.\" He said: We found in its gardens onions and garlic...",
    "foot_note": "1. = of Adhan 1 / 216. (*)",
    "book_id": "976",
    "new_page_number": 44
  },
  {
    "serial_number": "2414397",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "...and the people were hungry, so they strove and ate. Then suddenly the mosque smelled of onions and garlic. The Messenger of Allah, peace be upon him, said: \"Whoever eats from this foul plant should not approach us.\" And he said: \"Plundering is not lawful, nor is every fanged beast of prey, nor the Mujaththama (animal tied up and shot).\"\nAhmad and Muslim narrated from Abu Sa'id who said: We had barely conquered Khaybar when we fell upon that plant and ate from it voraciously, and people were hungry. Then we went to the mosque, and the Messenger of Allah, peace be upon him, found the smell. He said: \"Whoever eats anything from this foul tree should not approach the mosque.\" The people said: It has been forbidden, it has been forbidden. That reached the Messenger of Allah, peace be upon him, so he said: \"O people, it is not for me to forbid what Allah has made lawful, but it is a tree whose smell I dislike.\"\n\n[16] Al-Bukhari and Muslim (1) narrated from Abu Qatada bin Rab'i, may Allah be pleased with him, who said: The Prophet, peace be upon him, said: \"If one of you enters the mosque, let him not sit until he prays two rak'ahs.\"\n**Cause:** Al-Bukhari, Ahmad, and Muslim narrated from Jabir bin Abdullah that Sulayk came while the Prophet, peace be upon him, was preaching and sat down. The Prophet, peace be upon him, ordered him to pray two rak'ahs, then turned to the people and said: \"If one of you comes while the Imam is preaching, let him pray two rak'ahs and be brief in them.\"\nAhmad, Al-Bukhari, and Muslim narrated from Abu Qatada who said: I entered the mosque while the Messenger of Allah, peace be upon him, was sitting among the people, so I sat. The Messenger of Allah, peace be upon him, said: \"What prevented you from praying two rak'ahs before sitting?\" I said: I...",
    "foot_note": "1. Narrated by Al-Bukhari in Book of Shortening Prayer 2 / 70. Narrated by Muslim in Book of Mosques 2 / 526. (*)",
    "book_id": "976",
    "new_page_number": 45
  },
  {
    "serial_number": "2414398",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "...saw you sitting and the people sitting. He said: \"If one of you enters the mosque, let him not sit until he prays two rak'ahs.\"\n\n[17] **Hadith:** Al-Bukhari and Muslim (1) narrated from Zayd bin Thabit that the Messenger of Allah, peace be upon him, said: \"Pray, O people, in your houses, for the best prayer of a person is in his house, except the obligatory prayer.\"\n**Cause:** Ahmad, Al-Bukhari, and Muslim narrated from Zayd bin Thabit that the Prophet, peace be upon him, made a room in the mosque from a mat and prayed in it for nights. People gathered to him, then they missed his voice and thought he had slept. Some of them began clearing their throats so he would come out to them. He said: \"What I saw of your action continued until I feared it would be written (made obligatory) upon you as you stood for it. So pray, O people, in your houses, for the best prayer of a person is in his house, except the obligatory prayer.\"\n\n[18] **Hadith:** Al-Bukhari and Muslim (2) narrated from Ibn Umar who said: The Messenger of Allah, peace be upon him, said: \"If the heat becomes intense, cool it down by (delaying) the prayer, for the intensity of heat is from the breath of Hell.\"\n**Cause:** Ahmad narrated from Al-Mughira bin Shu'ba who said: We were praying the Zuhr prayer with the Prophet, peace be upon him, at midday. The Messenger of Allah, peace be upon him, said to us: \"Cool down by (delaying) the prayer, for the intensity of heat is from the breath of Hell.\"",
    "foot_note": "1. (1) Mentioned by Al-Bukhari in Book of Adherence to the Book and Sunnah 9 / 117, and mentioned by Muslim in Book of Travelers' Prayer 2 / 248. \n2. Narrated by Al-Bukhari Book of Prayer Times 1 / 142. Narrated by Muslim Book of Mosques 2 / 264. (*)",
    "book_id": "976",
    "new_page_number": 46
  },
  {
    "serial_number": "2414399",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "[19] **Hadith:** Abu Dawood, Ibn Majah, and Al-Hakim (1) narrated from Al-Bara' that the Prophet, peace be upon him, said: \"Indeed Allah and His angels send blessings upon the first row.\"\n**Cause:** Ibn Abi Shaybah narrated from Mujahid who said: The Messenger of Allah, peace be upon him, saw thinness (gaps) in the front row, so he said: \"Indeed Allah and His angels send blessings upon the first rows.\" So the people crowded.\n\n[20] **Hadiths of Tashahhud:** ...\n**Cause:** ... Al-Tabarani narrated from Abdullah bin Abi Awfa who said: When the polytheists entered Mecca, they said to their idols: 'You have been greeted and made good' (Hayyitum wa Tubtum). So Allah revealed to His Prophet: Say: (Greetings belong to Allah and good things belong to Allah).\n\n**Chapter on Funerals**\n\n[21] **Hadith:** Al-Hakim in Al-Mustadrak, Al-Mahamili in his Isfahani Dictations, and Al-Daylami in his route narrated from Anas who said: The Messenger of Allah, peace be upon him, said: \"Indeed Allah Almighty has angels on earth who speak on the tongues of the children of Adam regarding what is in a person of good and evil.\"\n**Cause:** Al-Hakim (who authenticated it) and Al-Bayhaqi in Shu'ab al-Iman narrated from Anas who said: I was sitting with the Prophet, peace be upon him and his family, when a funeral passed by. He said: \"What is this funeral?\" They said: The funeral of So-and-so son of So-and-so; he used to love Allah and His Messenger and work in obedience to Allah and strive in it. The Messenger of Allah, peace be upon him...",
    "foot_note": "1. (1) Mentioned by Abu Dawood in Book of Prayer 1 / 154. (*)",
    "book_id": "976",
    "new_page_number": 47
  },
  {
    "serial_number": "2414400",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "...and his family said: \"It has become obligatory, it has become obligatory, it has become obligatory.\" Another funeral passed by. They said: The funeral of So-and-so son of So-and-so; he used to hate Allah and His Messenger and work in disobedience to Allah and strive in it. He said: \"It has become obligatory, it has become obligatory, it has become obligatory.\" They said: O Messenger of Allah, your saying regarding the funeral and praising it! Good was praised for the first and evil for the last, and you said in both: It has become obligatory, it has become obligatory, it has become obligatory? He said: \"Yes, O Abu Bakr, indeed Allah has angels who speak on the tongues of the children of Adam regarding what is in a person of good and evil.\"\n\n[22] **Hadith:** Abu Dawood (1) narrated from Aisha that the Messenger of Allah, peace be upon him, said: \"Breaking the bone of the deceased is like breaking it while he is alive.\"\n**Cause:** In a part of the hadith of Ibn Mani', Ibn Mani' said: Muhriz bin Awf told us, Al-Qasim bin Muhammad told us from Abdullah bin Aqil, from Jabir who said: We went out with a funeral with the Messenger of Allah, peace be upon him. When we reached the grave, it was not yet finished. The Prophet, peace be upon him, sat on the edge of the grave, and we sat with him. The digger brought out a bone, a shin or an upper arm, and went to break it. The Prophet, peace be upon him, said: \"Do not break it, for your breaking it while he is dead is like your breaking it while he is alive, but bury it in the side of the grave.\"\n\n[23] **Hadith:** Al-Tirmidhi and Ibn Majah (2) narrated from Abu Qatada who said: The Messenger of Allah, peace be upon him, said: \"If one of you takes charge of his brother, let him shroud him well.\"\n**Cause:** Ahmad and Muslim narrated from Jabir, from the Prophet, peace be upon him, that he preached one day and mentioned a man of his companions who died and was shrouded in an insufficient shroud and buried at night. He rebuked...",
    "foot_note": "1. (1) Narrated by Abu Dawood Book of Funerals. \n2. Narrated by Al-Tirmidhi in Funerals 2 / 233 and also Ibn Majah in Funerals 1 / 473. (*)",
    "book_id": "976",
    "new_page_number": 48
  },
  {
    "serial_number": "2414401",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "...The Prophet, peace be upon him, rebuked burying a man at night until prayer is offered for him, unless a person is compelled to that. And the Prophet, peace be upon him, said: \"If one of you shrouds his brother, let him shroud him well.\"\n\n[24] **Hadith:** Abu Dawood, Al-Tirmidhi, Al-Nasa'i, and Ibn Majah (1) narrated from Ibn Abbas who said: The Messenger of Allah, peace be upon him, said: \"The niche (Lahd) is for us and the trench (Shaqq) is for others.\"\n**Cause:** Ahmad narrated from Jarir bin Abdullah who said: We went out with the Messenger of Allah, peace be upon him. When we left Medina, a rider came speeding towards us. The Messenger of Allah, peace be upon him, said: It seems this rider wants you. He said: The man reached us and greeted, and we returned the greeting. The Prophet, peace be upon him, said to him: \"Where did you come from?\" He said: From my family, children, and tribe. He said: \"And where do you want to go?\" He said: The Messenger of Allah, peace be upon him. He said: \"You have reached him.\" He said: O Messenger of Allah, teach me what is Faith? He said: \"You testify that there is no god but Allah, and that Muhammad is the Messenger of Allah, establish prayer, give Zakat, fast Ramadan, and perform Hajj to the House.\" He said: I have acknowledged. He said: Then his camel's foot entered a jerboa hole, so it fell with others and the man fell, landing on his head, and he died. The Messenger of Allah, peace be upon him, said: \"Bring the man to me.\" He said: Ammar bin Yasir and Hudhayfah jumped to him and sat him up. They said: O Messenger of Allah, the man has died. The Messenger of Allah, peace be upon him, turned away from them. Then the Messenger of Allah, peace be upon him, said to them: \"Did you see my turning away from the two men? For I saw two angels feeding him fruits of Paradise into his mouth, so I knew he died hungry.\" Then the Messenger of Allah, peace be upon him, said: This, by Allah, is of those about whom Allah Almighty said: (They who believe and do not mix their belief with injustice - those will have security, and they are [rightly] guided)",
    "foot_note": "1. Narrated by Abu Dawood in Book of Funerals 2 / 190. Narrated by Al-Tirmidhi in Book of Funerals 2 / 254. Narrated by Al-Nasa'i in Book of Funerals 4 / 66. (*)",
    "book_id": "976",
    "new_page_number": 49
  },
  {
    "serial_number": "2414402",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "[Al-An'am / 82]. He said: Then he said: \"Take your brother.\" He said: We carried him to the water, washed him, embalmed him, shrouded him, and carried him to the grave. The Messenger of Allah, peace be upon him, came and sat on the edge of the grave. He said: He said: \"Make a niche (Lahd) and do not make a trench (Shaqq), for the niche is for us and the trench is for others.\"\n\n[25] **Hadith:** Ahmad narrated from Umar bin Hazm that he heard the Messenger of Allah, peace be upon him, say: \"Do not sit on graves.\"\n**Cause:** Ahmad narrated from Umar bin Hazm who said: The Messenger of Allah, peace be upon him, saw me while I was leaning on a grave, so he said: \"Do not harm the owner of the grave.\"\n\n[26] **Hadith:** Ahmad and Muslim narrated from Anas who said: The Messenger of Allah, peace be upon him, said: \"Were it not that you would not bury one another, I would have prayed to Allah to make you hear the punishment of the grave.\"\n**Cause:** Ahmad narrated from Anas who said: The Messenger of Allah, peace be upon him, entered a garden of the gardens of Medina belonging to Banu Najjar. He heard a voice from a grave. He asked about it: When was this one buried? They said: O Messenger of Allah, this one was buried in the Jahiliyyah. That pleased him and he said: \"Were it not that you would not bury one another, I would have prayed to Allah to make you hear the punishment of the grave.\"\nAhmad narrated from Jabir bin Abdullah who said: The Prophet, peace be upon him, entered a palm grove of Banu Najjar one day. He heard the voices of men from Banu Najjar who died in the Jahiliyyah being punished in their graves. The Messenger of Allah, peace be upon him, came out terrified and ordered his companions to seek refuge from the punishment of the grave.\n\n**Hadiths Prohibiting Cursing the Dead**\n\n[27] Ahmad (1) narrated from Al-Mughira bin Shu'ba who said: The Messenger of Allah...",
    "foot_note": "1. (1) Narrated by Ahmad 4 / 252. (*)",
    "book_id": "976",
    "new_page_number": 50
  },
  {
    "serial_number": "2414403",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "...peace be upon him, said: \"Do not curse the dead and thereby harm the living.\"\n**Cause:** Ibn Sa'd, Ahmad, and Al-Hakim (who authenticated it) narrated from Ibn Abbas that a man mentioned Abu al-Abbas (Abbas's father) and insulted him. In a wording: He said to him: I saw Abd al-Muttalib bin Hashim and Al-Ghaytalah, the priestess of Banu Sahm, Allah gathered them both in the Fire. So Al-Abbas slapped him. They gathered and said: By Allah, we will slap Al-Abbas as he slapped him. This reached the Messenger of Allah, peace be upon him, so he preached and said: \"Who are the most noble of people to Allah?\" They said: You. He said: \"Indeed Al-Abbas is from me and I am from him. Do not curse our dead and thereby harm the living.\"\nIbn Sa'd and Al-Hakim (who authenticated it) narrated from Umm Salamah who said: Ikrimah bin Abi Jahl complained to the Prophet, peace be upon him, that when he passed by in Medina, it was said to him: This is the son of the enemy of Allah. The Messenger of Allah, peace be upon him, stood preaching and said: \"People are minerals (of various qualities); the best of them in Jahiliyyah are the best of them in Islam if they understand. Do not harm a Muslim because of a disbeliever.\" The wording of Ibn Sa'd said: \"What is wrong with people who harm the living by cursing the dead? Lo, do not harm the living by insulting the dead.\"\nIbn Asakir narrated in his History from Nabat bin Sharit who said: The Prophet, peace be upon him, passed by the grave of Abu Uhayhah. Abu Bakr said: This is the grave of Abu Uhayhah the wicked. Khalid bin Sa'd said: By Allah, it does not please me that he is in the highest Illiyyin and that he is like Abu Quhafah. The Prophet, peace be upon him, said: \"Do not curse the dead and anger the living.\"\nAl-Khara'iti narrated in Masawi' al-Akhlaq from Muhammad bin Ali that the Prophet, peace be upon him, forbade that the slain of Badr from the polytheists be cursed. He said: \"Indeed what you say does not reach them, but you harm the living thereby. Lo, indeed foul speech is meanness.\"",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 51
  },
  {
    "serial_number": "2414404",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "[28] **Hadith:** Al-Bukhari (1) narrated from Anas bin Malik, may Allah be pleased with him, who said: I heard the Messenger of Allah, peace be upon him, say: \"Indeed Allah said: If I test my servant with his two beloveds and he is patient, I compensate him for them with Paradise\" meaning his eyes.\n**Cause:** Ibn Sa'd and Al-Bayhaqi in Al-Shu'ab narrated via Abu Zilal from Anas that Gabriel came to the Messenger of Allah, peace be upon him, while Ibn Umm Maktum was with him. He said: When did your sight go? He said: When I was a boy. He said: Allah Blessed and Exalted said: If I take the beloved (Karima) of my servant, he has no reward but Paradise.\nAl-Bayhaqi narrated via Hilal bin Suwayd that he heard Anas say: Ibn Umm Maktum passed by us and greeted. The Messenger of Allah, peace be upon him, said: \"Shall I not tell you what Gabriel told me? Indeed Allah says: It is a right upon Me that from whomever I took his two beloveds (Karimatayh), he has no reward but Paradise.\"\nAl-Bayhaqi narrated from Anas who said: The Messenger of Allah, peace be upon him, said: \"Gabriel told me from the Lord of the Worlds that He said: The reward of him whose two beloveds—meaning his eyes—I took away is eternity in My Abode and looking at My Face.\"\n\n**Chapter on Fasting**\n\n[29] **Hadith:** Ahmad and Muslim (2) narrated from Sa'd bin Abi Waqqas who said: The Messenger of Allah, peace be upon him, came out to us striking one of his hands on the other saying: \"The month is like this and like this and like this, then he reduced his finger in the third.\"\nAhmad, Al-Bukhari, and Muslim narrated from Ibn Umar who said: The Messenger of Allah...",
    "foot_note": "1. (1) Narrated by Al-Bukhari in Book of Medicine 7 / 151. \n2. Narrated by Ahmad 1 / 184 - And narrated by Muslim in Book of Fasting 3 / 141 (*)",
    "book_id": "976",
    "new_page_number": 52
  },
  {
    "serial_number": "2414405",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "...peace be upon him said: \"Indeed the month is twenty-nine, so do not fast until you see it, and do not break fast until you see it. If it is obscured from you, then estimate for it.\"\n**Cause:** Ahmad and Muslim narrated from Jabir bin Abdullah who said: The Prophet, peace be upon him, stayed away from his wives for a month. He came out to us on the morning of the twenty-ninth. Some people said: O Messenger of Allah! We have reached the morning of the twenty-ninth. The Prophet, peace be upon him, said: \"Indeed the month can be twenty-nine.\" Then the Prophet, peace be upon him, clapped his hands three times: twice with all fingers of his hands and the third with nine of them.\nAl-Bukhari narrated from Anas, may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, took an oath regarding his wives for a month, and sat in an upper room of his. He came down on the twenty-ninth. It was said: O Messenger of Allah, you took an oath for a month? He said: \"Indeed the month is twenty-nine.\"\nAhmad narrated from Ibn Umar from the Prophet, peace be upon him, who said: \"The month is twenty-nine.\" They mentioned that to Aisha, so she said: May Allah have mercy on Abu Abd al-Rahman. Did the Messenger of Allah, peace be upon him, abandon his wives for a month then come down on the twenty-ninth, and it was said to him, so he said: \"Indeed the month can be twenty-nine\"?\n\n[30] **Hadith:** Ahmad and Al-Nasa'i (1) narrated from Usama bin Zayd who said: The Messenger of Allah, peace be upon him, said: \"The cupper and the cupped have broken their fast.\"\nAbu Dawood narrated from Thawban who said: The Messenger of Allah, peace be upon him, said: \"The cupper and the cupped have broken their fast.\"\n**Cause:** Ahmad and Al-Tirmidhi narrated from Shaddad bin Aws that the Messenger of Allah...",
    "foot_note": "1. (1) Narrated by Ahmad 5 / 210. (*)",
    "book_id": "976",
    "new_page_number": 53
  },
  {
    "serial_number": "2414406",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "...peace be upon him, came upon a man in Al-Baqi' who was being cupped, while he was holding my hand, on the eighteenth of Ramadan. He said: \"The cupper and the cupped have broken their fast.\"\nAl-Bayhaqi narrated in Shu'ab al-Iman via Ghiyath bin Kilab al-Kufi, from Mutarrif bin Samura bin Jundub from his father who said: The Messenger of Allah, peace be upon him, passed by a man in front of a cupper, and that was in the month of Ramadan while they were backbiting a man. He said: \"The cupper and the cupped have broken their fast.\" Al-Bayhaqi said: This Ghiyath is unknown.\nAhmad narrated from Ibn Abbas who said: The Messenger of Allah, peace be upon him, was cupped while fasting and in Ihram and fainted. He said: Therefore, cupping was disliked for the fasting person.\n\n[31] **Hadith:** Ahmad and Al-Tabarani (1) narrated from Ka'b bin Asim al-Ash'ari who said: The Messenger of Allah, peace be upon him, said: \"Laysa min am-birr siyam fi am-safar\" (It is not righteousness to fast in travel - in the Himyari dialect).\n**Cause:** Ahmad, Al-Bukhari, and Muslim narrated from Jabir bin Abdullah who said: The Messenger of Allah, peace be upon him, was on a journey. He saw a man around whom people had gathered and he was being shaded. They said: This is a fasting man. The Messenger of Allah, peace be upon him, said: \"It is not righteousness to fast in travel.\"\n\n[32] **Hadith:** Ahmad, Muslim, and the Four (2) narrated from Abu Huraira who said: The Messenger of Allah, peace be upon him, said: \"Do not precede Ramadan by fasting a day or two days, except a man who was fasting a fast, then let him fast it.\"",
    "foot_note": "1. (1) Narrated by Ahmad 5 / 434 - and Al-Tabarani in Al-Kabir. \n2. Narrated by Ahmad 2 / 521. Narrated by Al-Bukhari in Book of Fasting 3 / 35 - Narrated by Muslim in Book of Fasting 3 / 139. (*)",
    "book_id": "976",
    "new_page_number": 54
  },
  {
    "serial_number": "2414407",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "Abu Dawood and Al-Bayhaqi narrated from Ibn Abbas who said: The Messenger of Allah, peace be upon him, said: \"Do not precede the month by fasting a day or two days.\"\n**Cause:** Ibn al-Najjar narrated in his History from Ibn Abbas who said: The Messenger of Allah, peace be upon him, said: \"Fast upon sighting the crescent and break fast upon sighting it. If it is obscured from you, then count thirty.\" We said: O Messenger of Allah, shall we not proceed before it by a day or two days? He got angry and said: \"No.\"\n\n[33] Ahmad, Al-Bukhari, Muslim, and Abu Dawood (1) narrated from Abu Huraira who said: The Messenger of Allah, peace be upon him, said: \"A woman should not fast while her husband is present except with his permission, other than Ramadan.\"\n**Cause:** Ahmad, Abu Dawood, and Al-Hakim narrated from Abu Sa'id who said: A woman came to the Prophet, peace be upon him, while we were with him and said: O Messenger of Allah, my husband Safwan bin al-Mu'attal beats me if I pray, makes me break fast if I fast, and does not pray Fajr prayer until the sun rises. He said: Safwan was with him, so he asked him about what she said. He said: O Messenger of Allah, as for her saying he beats me if I pray, she recites two Surahs, and I have forbidden her. He (the Prophet) said: \"If it were one Surah, it would suffice the people.\" As for her saying: he makes me break fast, she goes and fasts, and I am a young man and I cannot have patience. The Messenger of Allah, peace be upon him, said on that day: \"A woman should not fast. And Ahmad's wording: Let none of you women fast except with her husband's permission.\" As for her saying: I do not pray until the sun rises, we are a household known for that, we hardly wake up until the sun rises. He said: \"When you wake up, pray.\"",
    "foot_note": "1. (1) Narrated by Ahmad 2 / 476 - Narrated by Al-Bukhari in Book of Marriage 7 / 39 - Narrated by Muslim in Book of Zakat 3 / 65. (*)",
    "book_id": "976",
    "new_page_number": 55
  },
  {
    "serial_number": "2414408",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "**Chapter on Hajj**\n\n[34] **Hadith:** Muslim, Al-Nasa'i, and Ibn Majah (1) narrated from Abu Huraira who said: The Messenger of Allah, peace be upon him, said: \"Leave me as I left you, for those before you were destroyed by their excessive questioning and their disagreement with their prophets. If I command you with something, do of it what you can, and if I forbid you from something, leave it.\"\n**Cause:** Ibn Hibban narrated from Abu Huraira that the Messenger of Allah, peace be upon him, preached and said: \"O people, Allah Almighty has obligated Hajj upon you.\" A man stood up and said: Every year, O Messenger of Allah? He remained silent until he repeated it three times. He said: \"If I said yes, it would become obligatory, and you would not be able to do it. Leave me as I left you, for those before you were destroyed by their excessive questioning and their disagreement with their prophets. If I forbid you from something, avoid it, and if I command you with something, do of it what you can.\"\n\n[35] **Hadith:** Al-Bukhari and Muslim (2) narrated from Abu Huraira who said: The Messenger of Allah, peace be upon him, said: \"Prayer in this mosque of mine is better than a thousand prayers in other mosques except the Sacred Mosque.\"\n**Cause:** Abd al-Razzaq said in Al-Musannaf: Ibrahim al-Makki from Ata bin Abi Rabah who said: Al-Sharid came to the Prophet, peace be upon him, on the Day of Conquest and said: I vowed that if Allah granted you victory, I would pray in Bayt al-Maqdis. He said: The Prophet, peace be upon him, said to him: \"Here\" is better, three times, then said:",
    "foot_note": "1. (1) Mentioned by Muslim in Book of Hajj 3 / 481. Narrated by Al-Nasa'i in Book of Hajj Rituals. \n2. Narrated by Muslim in Book of Hajj 3 / 537. Narrated by Al-Bukhari in Book of Prayer 2 / 76. (*)",
    "book_id": "976",
    "new_page_number": 56
  },
  {
    "serial_number": "2414409",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "\"By the One in Whose hand is my soul, if you prayed here, it would suffice you.\" He said: \"Prayer in this mosque is better than a hundred thousand prayers in other mosques.\" Ahmad narrated from Al-Arqam bin Abi Al-Arqam that he came to the Prophet, peace be upon him, and greeted him. He said: \"Where do you want to go?\" He said: I wanted, O Messenger of Allah, there—pointing his hand towards Bayt al-Maqdis. He said: \"Does trade take you out there?\" He said: I said: No, but I wanted to pray in it. He said: \"Then prayer here—and he pointed his hand to Mecca—is better than a thousand prayers here\"—and he pointed his hand to Sham.\n\n[36] **Hadith:** Ibn Abi Shaybah narrated from Jabir who said: The Messenger of Allah, peace be upon him, said: \"Medina is like the bellows; it cleanses its good (sic - likely typo for bad) and expels its filth.\"\n**Cause:** Ahmad, Al-Bukhari, and Muslim narrated from Jabir who said: A Bedouin man came to the Messenger of Allah, peace be upon him, and embraced Islam and pledged allegiance to him on migration. Before long, he came to the Prophet, peace be upon him, and said: Release me (from the pledge). He said: \"I will not release you.\" Then he came to him and said: Release me. He said: \"I will not release him.\" Then he came to him and said Release me. He said: \"No.\" So he fled. He said: \"Medina is like the bellows; it expels its filth and cleanses its good.\"\n**Second Cause:** Ahmad, Al-Bukhari, and Muslim narrated from Zayd bin Thabit that the Messenger of Allah, peace be upon him, went out to Uhud. Some people who went out with him returned. The companions of the Messenger of Allah, peace be upon him, were divided into two parties: a party saying we fight them, and a party saying no. So Allah Almighty revealed: (What is [the matter] with you [that you are] two groups concerning the hypocrites) [Al-Nisa / 88]. The Messenger of Allah, peace be upon him, said: \"It is pure (Taybah), and it expels filth just as fire expels the impurities of silver.\"",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 57
  },
  {
    "serial_number": "2414410",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "**Chapter on Sales**\n\n[37] **Hadith:** Ahmad (1) narrated from Ubadah bin al-Samit who said: The Messenger of Allah, peace be upon him, decreed that there should be no harm and no reciprocating harm, and he decreed that the vein of an oppressor has no right. Ahmad narrated from Ibn Abbas who said: The Messenger of Allah, peace be upon him, said: \"No harm and no reciprocating harm.\"\n**Cause:** Abd al-Razzaq in Al-Musannaf: Ibn al-Tamimi told us, from Al-Hajjaj bin Arta'ah, Abu Ja'far informed me that a palm tree was between two men. They disputed about it before the Prophet, peace be upon him. One of them said: Split it in half between me and you. The Prophet, peace be upon him, said: \"No harm in Islam.\"\n\n[38] **Hadith:** Ibn Majah (2) narrated that Abu al-Hamra' said: The Messenger of Allah, peace be upon him, said: \"Whoever cheats us is not of us.\"\n**Cause:** Ahmad and Muslim narrated from Abu Huraira that the Messenger of Allah, peace be upon him, passed by a man selling food. He asked him: How do you sell? He informed him. Allah revealed to him: Put your hand in it. He put his hand in it, and behold it was wet. The Messenger of Allah, peace be upon him, said: \"He who cheats us is not of us.\"\nAbu Nu'aym and Ibn al-Najjar narrated from Ibn Umar that the Messenger of Allah, peace be upon him, passed by the market of Medina by some food that pleased him. He put his hand inside the food and brought out something that was not apparent. The Messenger of Allah, peace be upon him, said 'Uff' to the owner of the food, then called out: \"O people, no cheating among Muslims. Whoever cheats us is not of us.\"",
    "foot_note": "1. Narrated by Ahmad 5 / 327. \n2. Narrated by Ibn Majah in Book of Trade 2 / 749. (*)",
    "book_id": "976",
    "new_page_number": 58
  },
  {
    "serial_number": "2414411",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "[39] Al-Bukhari and Muslim (1) narrated from Ibn Umar that the Messenger of Allah, peace be upon him, forbade selling fruit until its suitability appears (it ripens), forbidding the seller and the buyer.\nMuslim narrated from Abu Huraira who said: The Messenger of Allah, peace be upon him, said: \"Do not buy fruits until their suitability appears.\"\n**Cause:** Ahmad and Al-Bukhari narrated from Zayd bin Thabit who said: The Messenger of Allah, peace be upon him, arrived in Medina while we used to trade fruits before their suitability appeared. The Messenger of Allah, peace be upon him, heard a dispute. He said: \"What is this?\" It was said to him: These bought fruits, and they say: The pomegranate was struck by blight (Tisham). The Messenger of Allah, peace be upon him, said: \"Do not trade them until their suitability appears.\"\n\n[40] **Hadith:** Al-Bukhari and Muslim (2) narrated from Zayd bin Thabit that the Messenger of Allah, peace be upon him, permitted Ariya (selling fresh dates on the tree for dried dates).\n**Cause:** Al-Shafi'i said in the Book of Sales: Mahmoud bin Labid said to a man from the companions of the Prophet, peace be upon him: What are these Ariyas of yours? He said: So-and-so and So-and-so, and named needy men from the Ansar who complained to the Prophet, peace be upon him, that fresh dates come while they have no cash in hand to buy fresh dates to eat with the people, but they have surplus of their food from dried dates. So he permitted them to buy Ariyas by estimating them in dried dates from what they had in hand, to eat them fresh.\nAl-Shafi'i said: Sufyan's hadith indicates the like of this hadith, which is what Al-Shafi'i narrated from Sufyan from Yahya bin Sa'id from Bashir bin Yasar who said:",
    "foot_note": "1. (1) Narrated by Al-Bukhari in Book of Sales 3 / 100 and narrated by Muslim in Book of Sales 4 / 29. \n2. Narrated by Al-Bukhari in Book of Sales 3 / 96. Narrated by Muslim Book of Sales 4 / 22. (*)",
    "book_id": "976",
    "new_page_number": 59
  },
  {
    "serial_number": "2414412",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "I heard Sahl bin Abi Khaythama say: The Prophet, peace be upon him, forbade selling fruit for dates, except that he permitted regarding Ariya that they be sold by their estimation in dates for their owners to eat fresh.\n\n[41] **Hadith:** Al-Bukhari, Muslim (1), and Abu Dawood narrated from Sa'id bin Yazid from the Prophet, peace be upon him, who said: \"Whoever revives dead land, it is his, and the vein of an oppressor has no right.\"\n**Cause:** Abu Dawood narrated via Urwa who said: A man from the companions of the Prophet, peace be upon him, told me—and I strongly think it is Abu Sa'id al-Khudri—that two men disputed before the Messenger of Allah, peace be upon him. One of them planted palm trees in the land of the other. He judged the land for the land owner, and ordered the palm owner to remove his palms from it. He said: I saw it being struck at its roots with axes, and it was indeed tall palms, until it was removed from it.\n\n[42] **Hadith:** Ahmad (2) narrated via Ata from Jabir bin Abdullah that the Prophet, peace be upon him, said: \"The Umra (life-grant) is inheritance for its people.\"\nAhmad narrated from Zayd bin Thabit that the Messenger of Allah, peace be upon him, made the Umra for the heir.\n**Cause:** Ahmad narrated via Muhammad bin Ibrahim from Jabir that a man from the Ansar gave his mother a garden of palms for her life. She died, and her two brothers came and said: We are equal partners in it. They disputed before the Prophet, peace be upon him, and he divided it between them as inheritance.\n\n[43] **Hadith:** Al-Shafi'i, Ahmad, the Four, and Ibn Hibban (3) narrated from...",
    "foot_note": "1. (1) Mentioned by Al-Bukhari in Book of Sharecropping 3 / 139. \n2. Narrated by Ahmad 3 / 297. \n3. Narrated by Al-Shafi'i 3 / 60. Narrated by Abu Dawood in Book of Rent. Narrated by Al-Tirmidhi in Book of Sales 3 / 376 and narrated by Ahmad 6 / 80. (*)",
    "book_id": "976",
    "new_page_number": 60
  },
  {
    "serial_number": "2414413",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "...Aisha that the Prophet, peace be upon him, decreed that profit follows responsibility (Al-Kharaj bi-al-Daman).\n**Cause:** Abu Dawood narrated from Aisha that a man bought a slave who stayed with him as long as Allah willed him to stay. Then he found a defect in him and disputed with him before the Prophet, peace be upon him. He returned him to him. The man said: O Messenger of Allah! He has used my slave. The Messenger of Allah, peace be upon him, said: \"Profit follows responsibility.\"\n\n[44] **Hadith:** Ahmad, Al-Bukhari, and Muslim (1) narrated from Nafi' that Ibn Umar used to rent his farms during the time of the Prophet, peace be upon him, Abu Bakr, Umar, Uthman, and the beginning of Muawiyah's emirate. Then he was told on the authority of Rafi' bin Khadij that the Prophet, peace be upon him, forbade renting farms. Ibn Umar went to Rafi' bin Khadij, and I went with him. He asked him, and he said: The Prophet, peace be upon him, forbade renting farms.\nAhmad and Muslim narrated from Ibn Umar who said: We used to engage in Mukhabara (sharecropping) and saw no harm in it until Rafi' claimed that the Messenger of Allah, peace be upon him, forbade it, so we left it.\n**Cause:** Ahmad, Al-Bukhari, and Muslim narrated from Rafi' bin Khadij who said: We were the most farming people of Medina. We used to rent land for the side (produce of a specific part), designated for the master of the land. He said: Sometimes that would be hit (by calamity) and the land safe, or the land hit and that safe. So we were forbidden. As for gold and silver, they did not exist then.\nAhmad narrated from Urwa bin al-Zubayr who said: Zayd bin Thabit said: May Allah forgive Rafi' bin Khadij, I am, by Allah, more knowledgeable about the hadith than him. Only two men came who had fought...",
    "foot_note": "1. (1) Mentioned by Al-Bukhari in Book of Cultivation 3 / 141. Narrated by Muslim in Book of Sales 4 / 49. Mentioned by Ahmad 2 / 64. (*)",
    "book_id": "976",
    "new_page_number": 61
  },
  {
    "serial_number": "2414414",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "...so the Messenger of Allah, peace be upon him, said: \"If this is your affair, do not rent farms.\" So Rafi' heard his saying: \"Do not rent farms.\"\nAhmad, Abu Dawood, and Al-Nasa'i narrated from Sa'd bin Abi Waqqas that farm owners in the time of the Prophet, peace be upon him, used to rent their farms for what is on the irrigation channels of crops and what was watered by water around the plant. They came to the Messenger of Allah, peace be upon him, and disputed regarding some of that. The Messenger of Allah, peace be upon him, forbade them to rent for that and said: \"Rent for gold and silver.\"\n\n**Chapter on Marriage**\n\n[45] **Hadith:** Al-Bukhari and Muslim (1) narrated from Abu Huraira, may Allah be pleased with him, from the Prophet, peace be upon him, who said: \"A woman is married for four things: for her wealth, her lineage, her beauty, and her religion. So succeed with the one of religion, may your hands be dusted.\"\n**Cause:** Ahmad and Muslim narrated from Jabir bin Abdullah who said: I married a woman during the time of the Messenger of Allah, peace be upon him. He said: \"O Jabir, did you marry?\" I said: Yes. He said: \"A virgin or a matron (previously married)?\" He said: I said: A matron. He said: \"Why not a virgin whom you could play with?\" He said: I said: O Messenger of Allah! I have sisters, and I feared she might interfere between me and them. He said: \"Indeed, a woman is married for her religion and her beauty, so stick to the one of religion, may your hands be dusted.\"\n\n[46] **Hadith:** Ibn Majah (2) narrated from Ibn Abbas who said: The Messenger of Allah, peace be upon him, said: \"Nothing has been seen for those who love each other like marriage.\"",
    "foot_note": "1. (1) Narrated by Al-Bukhari in Book of Marriage 7 / 9. Narrated by Muslim in Book of Suckling 3 / 651. \n2. Narrated by Ibn Majah in Book of Marriage 1 / 596. (*)",
    "book_id": "976",
    "new_page_number": 62
  },
  {
    "serial_number": "2414415",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "**Cause:** Abu Ali al-Hasan bin Ahmad bin Shadhan in his Mashyakha and Ibn al-Najjar in Tarikh Baghdad narrated from Jabir bin Abdullah who said: A man came to the Prophet, peace be upon him, and said: O Messenger of Allah! We have an orphan girl who has been proposed to by two men, a wealthy one and a poor one. She desires the poor one, and we desire the wealthy one. The Messenger of Allah, peace be upon him, said: \"Nothing has been seen for those who love each other like marriage.\"\nAl-Khara'iti in I'tidal al-Qulub narrated from Ibn Abbas that a man said: O Messenger of Allah, in my care is an orphan girl. A wealthy man and a destitute man proposed to her. We like the wealthy one and she likes the destitute one. The Messenger of Allah, peace be upon him, said: \"There is nothing for those who love each other like marriage.\"\n\n[47] **Hadith:** Ahmad narrated from Ali who said: The Messenger of Allah, peace be upon him, said: \"The child belongs to the bed (legal husband/master), and for the adulterer is the stone.\"\nAl-Bukhari and Muslim narrated from Abu Huraira who said: The Messenger of Allah, peace be upon him, said: \"The child belongs to the bed, and for the adulterer is the stone.\"\n**Cause:** Al-Bukhari and Muslim narrated from Aisha, may Allah be pleased with her, who said: Sa'd bin Abi Waqqas and Abd bin Zam'a disputed over a boy. Sa'd said: O Messenger of Allah, this is the son of my brother Utba bin Abi Waqqas. He covenanted to me that he is his son; look at his resemblance. Abd bin Zam'a said: This is my brother, O Messenger of Allah, born on my father's bed from his slave girl. The Messenger of Allah, peace be upon him, looked at his resemblance and saw a clear resemblance to Utba. He said: \"He is yours, O Abd bin Zam'a. The child belongs to the bed, and for the adulterer is the stone. And veil yourself from him, O Sawda bint Zam'a.\" So she never saw him.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 63
  },
  {
    "serial_number": "2414416",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "**Chapter on Crimes (Jinayat)**\n\n[48] **Hadith:** Abd al-Razzaq, Al-Bukhari, Muslim, and Abu Dawood (1) narrated from Abu Huraira that the Messenger of Allah, peace be upon him, said: \"The beast is exempt (Jubar - injury caused by it is not compensated), the well is exempt, the mine's injury is exempt, and in the buried treasure (Rikaz) is one-fifth.\"\n**Cause:** Abd al-Razzaq said in Al-Musannaf from Ibn Jurayj from Ya'qub bin Utba, Salih, and Ismail bin Muhammad who claimed that the Messenger of Allah, peace be upon him, decreed that the beast is exempt, the well is exempt, the mine is exempt, and in the Rikaz is one-fifth. He said: The people of Jahiliyyah used to make the tribe liable for what their beasts, wells, and mines caused. When that was mentioned to the Messenger of Allah, peace be upon him, he said regarding that what he said of the decree.\nAbd al-Razzaq said from Ibn Jurayj who said: Abd al-Aziz bin Umar informed me from a letter of Umar bin Abd al-Aziz in which: It reached us that the Messenger of Allah, peace be upon him, said regarding two men, one hired a mine and the other killed a beast. He said: \"What the mine killed is exempt, and what the beast killed is exempt.\" Jubar in the language of Tihama means waste (Hadr - uncompensated).\n\n[49] **Hadith:** Al-Bukhari and Muslim (2) narrated from Abdullah bin Mughaffal that the Messenger of Allah, peace be upon him, forbade stone throwing (Hadhf) and said: \"It does not inflict damage on the enemy nor kill game, but it breaks the tooth and gouges the eye.\"",
    "foot_note": "1. (1) Narrated by Abd al-Razzaq 10 / 65. Narrated by Al-Bukhari in Book of Diya (Blood money) 9 / 15. Narrated by Muslim in Book of Hudud 4 / 298. Narrated by Abu Dawood in Book of Diya 2 / 52. \n2. Narrated by Al-Bukhari in Book of Slaughters 7 / 112. Narrated by Muslim in Book of Hunting 4 / 641. (*)",
    "book_id": "976",
    "new_page_number": 64
  },
  {
    "serial_number": "2414417",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "**Cause:** Abu Dawood and Al-Nasa'i narrated from Burayda that a woman threw a stone at another woman, causing her to miscarry. That was raised to the Messenger of Allah, peace be upon him, and he set the blood money for her fetus at five hundred sheep, and forbade stone throwing that day.\n\n[50] **Hadith:** Ahmad, Al-Bukhari, and Muslim (1) narrated from Jabir that the Messenger of Allah, peace be upon him, said: \"Do not combine fresh dates and unripened dates, nor raisins and dates in Nabidh.\"\n**Cause:** Abd al-Razzaq narrated from Abu Ishaq that a man asked Ibn Umar saying: Shall I combine dates and raisins? He said: No. He said: Why? He said: The Prophet, peace be upon him, forbade it. He said: Why? He said: A man got drunk, so the Prophet, peace be upon him, gave him the hadd punishment, then ordered to look at what his drink was. Behold it was dates and raisins. So the Prophet, peace be upon him, forbade combining dates and raisins and said: \"Each one of them alone is sufficient.\"\n\n[51] **Hadith:** Al-Bukhari, Muslim, Al-Tirmidhi, and Al-Nasa'i narrated from Ibn Mas'ud (2) who said: The Messenger of Allah, peace be upon him, said: \"There is no one more jealous (protective of honor) than Allah Almighty; for that reason He forbade immoralities, what is apparent of them and what is concealed. And there is no one who loves praise more than Allah; for that reason He praised Himself. And there is no one who loves excusing more than Allah Almighty; for that reason He sent prophets as bringers of good tidings and warners.\"\n**Cause:** Ahmad, Al-Bukhari, and Muslim narrated from Al-Mughira bin Shu'ba who said: Sa'd bin Ubada said: If I saw a man with my wife, I would strike him with the sword not with the flat side. This reached the Messenger of Allah, peace be upon him, so he said: \"Do you wonder at Sa'd's jealousy? By Allah, I am...",
    "foot_note": "1. (1) Narrated by Ahmad 3 / 294. Narrated by Al-Bukhari in Book of Drinks 3 / 140. Narrated by Muslim in Book of Drinks 4 / 688. \n2. Narrated by Al-Tirmidhi in Book of Supplications. (*)",
    "book_id": "976",
    "new_page_number": 65
  },
  {
    "serial_number": "2414418",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "...more jealous than him, and Allah is more jealous than me. Because of Allah's jealousy, He forbade immoralities, what is apparent of them and what is concealed. And no person is more jealous than Allah, and no person loves excusing more than Allah; for that reason Allah sent bringers of good tidings and warners. No person loves praise more than Allah; for that reason Allah promised Paradise.\"\n\n[52] **Hadith:** Al-Bukhari narrated from Anas, may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, said: \"Help your brother, whether he is an oppressor or oppressed.\" It was said: O Messenger of Allah, we help him if oppressed, but how do we help him if he is an oppressor? He said: \"You hold his hands.\"\n**Cause:** Ahmad and Muslim narrated from Jabir bin Abdullah who said: Two boys fought, a boy from the Muhajirin and a boy from the Ansar. The Muhajiri said: O Muhajirin! And the Ansari said: O Ansar! The Messenger of Allah came out and said: \"Is it the call of Jahiliyyah?\" They said: No, by Allah, except that two boys struck each other. He said: \"No harm. Let a man help his brother whether oppressor or oppressed. If he is an oppressor, let him stop him, for that is his help; and if he is oppressed, let him help him.\"\n\n**Chapter on Sacrifice (Udhiyah)**\n\n[53] **Hadith:** Al-Bukhari and Muslim narrated from Jundub al-Bajali who said: The Prophet, peace be upon him, prayed on the Day of Sacrifice, then preached, then slaughtered. He said: \"Whoever slaughtered before praying, let him slaughter another in its place. And whoever has not slaughtered, let him slaughter in the name of Allah.\"\n**Cause:** Ahmad narrated from Jundub al-Bajali that he prayed with the Messenger of Allah, peace be upon him, on the Day of Adha. The Messenger of Allah, peace be upon him, turned and saw meat and sacrificial animals, so the Messenger of Allah, peace be upon him, knew they were slaughtered before he prayed. The Messenger of Allah, peace be upon him, said: \"Whoever slaughtered before he prayed, let him slaughter another. And whoever has not slaughtered until we prayed...",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 66
  },
  {
    "serial_number": "2414419",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "...let him slaughter in the name of Allah.\"\nAhmad narrated from Jundub who said: We went out with the Messenger of Allah, peace be upon him, on the Day of Adha to people who had slaughtered or sacrificed, and people who had not slaughtered or sacrificed. He said: \"Whoever slaughtered or sacrificed before our prayer, let him repeat. And whoever did not slaughter or sacrifice, let him slaughter or sacrifice in the name of Allah.\"\n\n**Chapter on Foods**\n\n[54] **Hadith:** Al-Bukhari (1) and Muslim narrated from Ibn Umar from the Prophet, peace be upon him, that he forbade on the Day of Khaybar the meat of domestic donkeys.\nAhmad, Al-Bukhari, and Muslim narrated from Abu Tha'labah al-Khushani who said: The Messenger of Allah, peace be upon him, forbade the meat of domestic donkeys and the meat of every fanged beast of prey.\nAhmad narrated from Zayd bin Khalid al-Juhani that he heard the Prophet, peace be upon him, forbid looting and snatching.\n**Cause:** Ahmad narrated from Jabir bin Abdullah who said: When it was the Day of Khaybar, famine struck the people, so they took domestic donkeys, slaughtered them, and filled the pots with them. That reached the Prophet, peace be upon him. Jabir said: The Messenger of Allah, peace be upon him, ordered us, so we overturned the pots. He said: \"Indeed Allah Almighty will bring you provision that is more lawful for you than this and better for you than this.\" He said: So we overturned the pots that day while they were boiling. The Messenger of Allah, peace be upon him, forbade on that day domestic donkeys, the meat of mules, every fanged beast of prey, every bird with a claw, and forbade Al-Mujaththama, snatching, and looting.",
    "foot_note": "1. (1) Narrated by Al-Bukhari in Book of Slaughters, Chapter: Meat of Domestic Donkeys. Narrated by Muslim in Book of Hunting, Chapter: Prohibition of eating meat of domestic donkeys. (*)",
    "book_id": "976",
    "new_page_number": 67
  },
  {
    "serial_number": "2414420",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "Ahmad narrated from Khalid bin al-Walid who said: We raided with the Messenger of Allah, peace be upon him, the Battle of Khaybar. The people hastened into the enclosures of the Jews. He ordered me to call out: 'Prayer is gathering (As-Salatu Jami'ah), and none enters Paradise except a Muslim.' Then he said: \"O people, you have hastened into the enclosures of the Jews. Lo, the property of those under covenant is not lawful except by right. Forbidden to you are the meat of domestic donkeys, their horses and mules, every fanged beast of prey, and every bird with a claw.\"\n\n[55] **Hadith:** Ahmad and Muslim (1) narrated from Jabir who said: The Messenger of Allah, peace be upon him, forbade that any animal be killed by being tied up and shot (Sabran).\n**Cause:** Al-Tabarani narrated from Ibn Abbas that the Prophet, peace be upon him, came out to people who had set up a live pigeon and were shooting at it. He said: \"This is Al-Mujaththama; it is not lawful to eat it.\"\n\n[56] **Hadith:** Abu Dawood narrated from Abu Waqid al-Laythi who said: The Messenger of Allah, peace be upon him, said: \"Whatever is cut from a beast while it is alive is carrion (Maitah).\"\n**Cause:** The Prophet, peace be upon him, arrived while they loved camel humps and cut off sheep tails. So he said: \"Whatever is cut from a beast while it is alive is carrion.\"\n\n**Chapter on Etiquette**\n\n[57] **Hadith:** \"Visit intermittently, you will increase in love.\" Ibn Adi narrated it in Al-Kamil from the hadith of Abu Huraira, Ibn Umar, Abu Dharr, and Habib bin Maslama who said the Messenger of Allah, peace be upon him, said: \"Visit intermittently, you will increase in love.\"\nIbn Adi narrated from Ibn Umar who said: We used to say in Jahiliyyah: Visit intermittently...",
    "foot_note": "1. (1) Narrated by Muslim in Book of Hunting, Chapter: Prohibition of killing animals by confinement. Narrated by Ahmad 3 / 111. (*)",
    "book_id": "976",
    "new_page_number": 68
  },
  {
    "serial_number": "2414421",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "...you will increase in love. The Prophet, peace be upon him, said to us: 'Visit intermittently, you will increase in love.'\"\n**Cause:** Ibn Adi narrated via Ata bin Abi Rabah from Abu Huraira that the Prophet, peace be upon him, said: \"O Abu Huraira, where were you yesterday?\" He said: I visited some of my family. In a wording: He said: I visited some of my family from the Muslims. He said: \"Visit intermittently, you will increase in love.\"\nIbn Adi narrated via Ismail bin Wardan from Abu Huraira who said: The Messenger of Allah, peace be upon him, came out of Aisha's house, and I followed him. Then he came out of Umm Salamah's house, and I followed him. He turned to me and said: O Abu Huraira, \"Visit intermittently, you will increase in love.\"\n\n[58] **Hadith:** Ahmad (1) and Abu Dawood narrated from Jabir bin Abdullah who said: The Messenger of Allah, peace be upon him, disliked that a man should come to his family (wife) at night (Turuqan). Ahmad's wording: The Messenger of Allah, peace be upon him, forbade that a man knocks on his family at night. In a wording: \"If one of you is absent for a long time, let him not knock on his family at night.\"\nAhmad narrated from Sa'd bin Abi Waqqas that he said: The Messenger of Allah, peace be upon him, forbade that a man knocks on his family after Isha prayer.\n**Cause:** Abd al-Razzaq narrated in Al-Musannaf from Ibn Jurayj from a man from Muhammad bin Ibrahim al-Tamimi that Ibn Rawaha was in a detachment. He returned and came to his house girding his sword. Behold, he saw a lamp. He became suspicious, climbed over, and behold, his wife was lying on a bed with what he saw as a man with disheveled hair beside her. He intended to strike, then piety overtook him, so he pinched his wife. She woke up and said: Back off, back off. He said: Woe to you...",
    "foot_note": "1. (1) Ahmad 3 / 992. (*)",
    "book_id": "976",
    "new_page_number": 69
  },
  {
    "serial_number": "2414422",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "...who is this? She said: My sister, she stayed with me and washed her hair. When that reached the Prophet, peace be upon him, he forbade knocking on women (coming unexpectedly at night). Two men disobeyed him and knocked on their families, and each of them found a man with his wife. When that reached the Prophet, peace be upon him, he said: \"Did I not forbid you from knocking on women?\"\nAhmad narrated via Abu Salamah from Abdullah bin Rawaha, that he arrived from a journey at night and hastened to his wife. Behold, there was a lamp in his house, and something with his wife. He took the sword. His wife said: Away from me! So-and-so is combing my hair. He came to the Prophet, peace be upon him, and informed him. So he forbade that a man knocks on his family at night.\n\n[59] **Hadith:** Al-Bukhari and Muslim (1) narrated from Ibn Umar who said: The Prophet, peace be upon him, led us in Isha prayer at the end of his life. When he said salam, he stood and said: \"Do you see this night of yours? At the head of one hundred years from it, no one who is on the surface of the earth will remain.\"\n**Cause:** Ahmad and Muslim narrated from Jabir bin Abdullah who said: I heard the Prophet, peace be upon him, saying a month before he died: \"You ask me about the Hour, and knowledge of it is only with Allah. I swear by Allah, there is no living soul on earth upon whom one hundred years will pass.\"\n\n[60] **Hadith:** Ibn Majah (2) narrated from Abu Juhayfa who said: The Messenger of Allah, peace be upon him, said: \"Whoever establishes a good sunnah (practice) which is acted upon after him, he will have its reward and the like of their rewards without diminishing anything from their rewards. And whoever establishes a bad sunnah and it is acted upon after him, upon him is its burden and the like of their burdens without diminishing anything from their burdens.\"",
    "foot_note": "1. (1) Mentioned by Al-Bukhari in Book of Knowledge, Chapter: Staying up for Knowledge, and Muslim in Book of Virtues of Companions, Chapter: Clarification of the meaning of his saying 'at the head of one hundred years' etc. \n2. Narrated by Ibn Majah Chapter: Whoever establishes a good or bad sunnah. (*)",
    "book_id": "976",
    "new_page_number": 70
  },
  {
    "serial_number": "2414423",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "**Cause:** Ahmad and Muslim narrated from Jarir bin Abdullah al-Bajali who said: We were with the Messenger of Allah, peace be upon him, in the early part of the day. He said: A group of people came, barefoot, naked, wearing striped woollen clothes or cloaks, girded with swords, most of them from Mudar, rather all of them from Mudar. The face of the Messenger of Allah, peace be upon him, changed when he saw the poverty they were in. He entered then came out and ordered Bilal, who called Adhan and Iqama. He prayed then preached saying: (O mankind, fear your Lord, who created you from one soul) to the end of the verse (Indeed Allah is ever, over you, an Observer) [Al-Nisa / 1] and the verse in Al-Hashr (Fear Allah, and let every soul look to what it has put forth for tomorrow - and fear Allah) [Al-Hashr / 18]. \"Let a man give charity from his dinar, his dirham, his garment, his sa' of wheat, his sa' of dates.\" Until he said: \"Even if with half a date.\" He said: A man from the Ansar came with a purse which his palm was almost unable to hold, nay it was unable. He said: Then people followed until I saw two heaps of food and clothes, until I saw the face of the Messenger of Allah, peace be upon him, shining as if it were gold. The Messenger of Allah, peace be upon him, said: \"Whoever establishes in Islam a good sunnah, he has its reward and the reward of those who act upon it after him without diminishing anything from their rewards. And whoever establishes in Islam a bad sunnah, upon him is its burden and the burden of those who act upon it after him without diminishing anything from their burdens.\"\nAhmad narrated from Hudhayfah who said: A man asked in the time of the Prophet, peace be upon him, and the people withheld. Then a man gave him, and the people gave. The Prophet, peace be upon him, said: \"Whoever initiates good and it is followed, he has its reward and part of the rewards of those who follow him without diminishing anything from their rewards. And whoever initiates evil and it is followed, upon him is its burden and part of the burdens of those who follow him without diminishing anything from their burdens.\"\nAhmad narrated from Abu Huraira who said: A man came to the Messenger of Allah, peace be upon him, and he urged (charity) for him. A man said: I have such and such. He said: There remained no one in the assembly...",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 71
  },
  {
    "serial_number": "2414424",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "...except he gave charity, little or much. The Messenger of Allah, peace be upon him, said: \"Whoever initiates good and it is followed, he has its reward complete, and from the rewards of those who follow it, nothing is diminished from their rewards. And whoever initiates evil and it is followed, upon him is its burden complete, and from the burdens of those who follow it, nothing is diminished from their burdens.\"\n\n[61] **Hadith:** Al-Bukhari and Muslim (1) narrated from Ibn Umar that the Messenger of Allah, peace be upon him, said: \"The upper hand is better than the lower hand.\"\n**Cause:** Ahmad, Al-Bukhari, and Muslim narrated from Hakim bin Hizam, may Allah be pleased with him, who said: I asked the Messenger of Allah, peace be upon him, and he gave me. Then I asked him and he gave me. Then I asked him and he gave me. Then he said: \"O Hakim, indeed this wealth is green and sweet. Whoever takes it with generosity of soul (without greed), it is blessed for him. And whoever takes it with expectation of soul (greed), it is not blessed for him, and he is like one who eats and is not satisfied. The upper hand is better than the lower hand.\" Hakim said: I said, O Messenger of Allah, by the One who sent you with the truth, I will not take anything from anyone after you until I leave the world.\nAhmad narrated from Hakim bin Hizam who said: I asked the Messenger of Allah, peace be upon him, for money and was persistent. He said to me: \"O Hakim, how much is your asking? O Hakim, indeed this wealth is green and sweet, and yet it is the filth of people's hands. The Hand of Allah is above the hand of the giver, and the hand of the giver is above the hand of the recipient, and the lowest of hands is the hand of the recipient.\"\n\n[62] **Hadith:** Al-Bukhari and Muslim (2) narrated from Amr bin al-As that he...",
    "foot_note": "1. (1) Mentioned by Al-Bukhari in Book of Zakat, Chapter: No charity except from wealth, and Muslim in Book of Zakat, Chapter: Clarification that the upper hand is better than the lower hand. \n2. Narrated by Al-Bukhari in Book of Adherence, Chapter: Reward of the ruler if he strives and hits...",
    "book_id": "976",
    "new_page_number": 72
  },
  {
    "serial_number": "2414425",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "...heard the Messenger of Allah, peace be upon him, say: \"If a judge judges and strives (makes Ijtihad) then is correct, he has two rewards. And if he judges and strives then errs, he has one reward.\"\n**Cause:** Ahmad narrated from Abdullah bin Amr bin al-As who said: Two disputants came to the Messenger of Allah, peace be upon him, disputing. He said to Amr: \"Judge between them, O Amr.\" He said: You are more worthy of that than me, O Messenger of Allah. He said: \"Even if!\" He said: If I judge between them, what is for me? He said: \"If you judge between them and hit the judgment correctly, you have ten good deeds. And if you strive and err, you have one good deed.\"\n\n[63] Ahmad (1) narrated from Ubadah bin al-Samit that the Prophet, peace be upon him, said: \"Guarantee me six from yourselves, I guarantee you Paradise: Speak the truth when you speak, fulfill when you promise, deliver when you are entrusted, guard your private parts, lower your gaze, and restrain your hands.\"\n**Cause:** Ahmad said in Al-Zuhd: Abd al-Samad told us, Abd al-Jalil told us: Al-Hasan bin Abi al-Hasan told us, said: The Children of Israel ended up with Moses, peace be upon him, and said: The Torah is too great for us, so tell us a summary of the matter that has lightness. Allah revealed: Tell them: Do not wrong each other in inheritance, let no eye of a servant enter a house until he asks permission, and let him perform ablution from food as he performs ablution for prayer. They found them light for a little while, then they did not uphold them. He said: The Messenger of Allah, peace be upon him, said at that: \"Accept six from me, I accept Paradise for you: whoever speaks let him not lie, whoever promises let him not break, whoever is entrusted let him not betray...",
    "foot_note": "1. ...or errs, and Muslim in Book of Judgments, Chapter: Clarification of the reward of the ruler if he strives and hits or errs. \n1. Ahmad 4 / 205. (*)",
    "book_id": "976",
    "new_page_number": 73
  },
  {
    "serial_number": "2414426",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "...guard your hands, your eyes, and your private parts.\"\n\n[64] **Hadith:** Muslim (1) narrated from Jarir from the Prophet, peace be upon him, who said: \"He who is deprived of gentleness is deprived of good.\"\n**Cause:** Abu Dawood narrated from Aisha who said: The Messenger of Allah, peace be upon him, used to go out to the desert to these valleys. He wanted to go to the desert once, so he sent me a difficult she-camel from the camels of charity. He said to me, O Aisha: \"Be gentle, for gentleness was never in anything but it adorned it, and was never removed from anything but it disgraced it.\"\n\n[65] **Hadith:** Abu Dawood (2) narrated from Abu Huraira who said: The Messenger of Allah, peace be upon him, said: \"By Allah, I will not accept after this day of mine a gift from anyone unless he is a Quraishi Muhajir, or an Ansari, or Dusi, or Thaqafi.\"\n**Cause:** Ahmad narrated from Ibn Abbas that a Bedouin gifted the Prophet, peace be upon him, a gift, so he rewarded him for it. He said: \"Are you satisfied?\" He said: No. So he increased him. He said: \"Are you satisfied?\" He said: No. So he increased him. He said: \"Are you satisfied?\" He said: Yes. He said: The Messenger of Allah, peace be upon him, said: \"I have resolved not to accept a gift except from a Quraishi, or Ansari, or Thaqafi.\"\nAhmad narrated from Abu Huraira that a Bedouin gifted the Messenger of Allah, peace be upon him, a young camel. He compensated him for it with six young camels. He (the Bedouin) was displeased. That reached the Prophet, peace be upon him, so he praised Allah and extolled Him then said: \"So-and-so gifted me a she-camel, and it is my she-camel which I know as I know some of my family; it went missing from me on the day of Zaghabat. I compensated him for it with six young camels, yet he remained displeased. I have...",
    "foot_note": "1. (1) Narrated by Muslim in Book of Birr, Chapter: Treating with gentleness one whose obscenity is certain. \n2. Abu Dawood in Book of Sales, Chapter: Accepting gifts. (*)",
    "book_id": "976",
    "new_page_number": 74
  },
  {
    "serial_number": "2414427",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "...resolved not to accept a gift except from a Quraishi, or Ansari, or Thaqafi, or Dusi.\"\n\n[66] **Hadith:** Al-Bukhari (1) narrated from Abu Huraira, may Allah be pleased with him, who said: I heard the Messenger of Allah, peace be upon him, say: \"Indeed Allah created mercy on the day He created it as one hundred mercies. He withheld ninety-nine mercies and sent one mercy to all His creation.\"\nAhmad narrated from Abu Sa'id who said: The Messenger of Allah, peace be upon him, said: \"Allah Almighty has one hundred mercies. He divided one part among creation, so by it people, beasts, and birds show mercy to one another.\"\nAhmad and Muslim narrated from Salman from the Prophet, peace be upon him, who said: \"Indeed Allah Almighty has one hundred mercies. From them is one mercy by which creation shows mercy to one another, so by it beasts show affection to their young. And He delayed ninety-nine to the Day of Resurrection.\"\nAl-Bukhari narrated from Abu Huraira who said: I heard the Messenger of Allah, peace be upon him, say: \"Allah made mercy one hundred parts. He held back ninety-nine parts with Him and sent down one part to earth. From that part creation shows mercy to one another, so that a mare lifts its hoof from its foal fearing to hurt it.\"\n**Cause:** Ahmad narrated from Jundub bin Abdullah al-Bajali who said: A Bedouin came, made his camel kneel, hobbled it, then prayed behind the Messenger of Allah, peace be upon him. When the Messenger of Allah, peace be upon him, prayed, he came to his camel, untied its hobble, then rode it. Then he called out: O Allah, have mercy on me and Muhammad, and do not associate anyone in our mercy. The Messenger of Allah, peace be upon him, said: \"Do you say this one is more astray or his camel? Did you not hear what he said?\" They said: Yes. He said:",
    "foot_note": "1. (1) Narrated by Al-Bukhari in Book of Riqaq, Chapter: Hope with Fear. (*)",
    "book_id": "976",
    "new_page_number": 75
  },
  {
    "serial_number": "2414428",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "\"You have restricted it (vast thing). Allah's mercy is vast. Allah created one hundred mercies, and Allah sent down one mercy by which creatures show affection to one another, Jinn, humans, and animals. And He has ninety-nine. Do you say he is more astray or his camel?\"\n\n[67] **Hadith:** Al-Tabarani in Al-Awsat and Al-Bayhaqi in Al-Shu'ab narrated from Rafi' bin Yazid al-Thaqafi that the Messenger of Allah, peace be upon him, said: \"Indeed Satan loves red, so beware of red and every garment of fame.\"\n**Cause:** Ahmad narrated from Rafi' bin Khadij that the Messenger of Allah, peace be upon him, saw redness appearing so he disliked it. When Rafi' bin Khadij died, they put a red velvet cover on his bier, and people wondered at that.\nAhmad (1) narrated from Rafi' bin Khadij that they went out with the Messenger of Allah, peace be upon him, on a journey. He said: When the Messenger of Allah, peace be upon him, dismounted for lunch, he said: Let every man hang the halter of his camel then let it shake the trees. He said: Then we sat with the Messenger of Allah, peace be upon him. He said: And our saddles were on our camels. He said: The Messenger of Allah, peace be upon him, raised his head and saw cloaks of ours with red wool threads. He said: The Messenger of Allah, peace be upon him, said: \"Do I not see this redness has overcome you?\" He said: So we stood up quickly due to the saying of the Messenger of Allah, peace be upon him, until some of our camels bolted. We took the cloaks and removed them (the red threads) from them.\n\n[68] **Hadith:** Ahmad and Muslim (2) narrated from Jabir who said: The Messenger of Allah, peace be upon him, said: \"If one of you sees a dream he dislikes, let him spit to his left three times, and seek refuge...",
    "foot_note": "1. (1) Narrated by Ahmad 4 / 41. \n2. Narrated by Ahmad 3 / 350 and Muslim Book of Dreams. (*)",
    "book_id": "976",
    "new_page_number": 76
  },
  {
    "serial_number": "2414429",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "...in Allah from Satan three times, and turn from the side he was on.\"\nAhmad and Al-Bukhari narrated from Abu Sa'id al-Khudri that he heard the Messenger of Allah, peace be upon him, say: \"If one of you sees a dream he loves, it is from Allah; let him praise Allah for it and talk about it. And if he sees other than that which he dislikes, it is from Satan; let him seek refuge in Allah from its evil and not mention it to anyone, for it will not harm him.\"\n**Cause:** Ahmad and Muslim narrated from Jabir bin Abdullah that a man came to the Prophet, peace be upon him, and said: O Messenger of Allah, I saw in a dream that my head was cut off and was rolling, and I was following it. The Messenger of Allah, peace be upon him, said: \"That is from Satan. If one of you sees a dream he dislikes, let him not tell it to anyone, and let him seek refuge in Allah from Satan.\"\n\n[69] **Hadith:** Ahmad (1) narrated from Abu Huraira from the Prophet, peace be upon him, who said: \"If one of you sneezes, let him say 'Alhamdulillah'. If he says 'Alhamdulillah', let his brother say to him: 'Yarhamukallah'. If he is told 'Yarhamukallah', let him say: 'Yahdikumullah wa Yuslihu Balakum'.\"\n**Cause:** Ahmad narrated from Salim bin Ubayd who said: I was with the Messenger of Allah, peace be upon him, on a journey. A man sneezed and said: Peace be upon you. He said: \"Upon you and your mother.\" Then he said: \"If one of you sneezes, let him say 'Alhamdulillah' in every state or 'Alhamdulillah Rabb al-Alamin', and let it be said to him: 'Yarhamukallah', and let him say: 'Yaghfirullahu li wa Lakum'.\"\n\n[70] **Hadith:** Ahmad, Al-Bukhari, and Muslim (2) narrated from Ibn Umar who said:",
    "foot_note": "1. (1) Narrated by Ahmad 2 / 353. \n2. Narrated by Ahmad 2 / 91 and Al-Bukhari in Book of Coercion Chapter: A man's oath to his companion that he is his brother if he fears he might be killed. Narrated by Muslim Book of Birr Chapter: Prohibition of injustice. (*)",
    "book_id": "976",
    "new_page_number": 77
  },
  {
    "serial_number": "2414430",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "The Messenger of Allah, peace be upon him, said: \"A Muslim is a brother of a Muslim; he does not wrong him, nor forsake him, nor hand him over.\"\n**Cause:** Ahmad narrated from Suwayd bin Hanzala who said: We went out wanting the Messenger of Allah, peace be upon him, and Wa'il bin Hujr was with us. An enemy of his seized him. People felt reluctant to swear. I swore that he was my brother, so he let him go. We came to the Messenger of Allah, peace be upon him, and I mentioned that to him. He said: \"You were the most righteous of them and most truthful. You spoke the truth; a Muslim is a brother of a Muslim.\"\n\n[71] **Hadith:** Ahmad (1) narrated from Ibn Umar that the Prophet, peace be upon him, forbade loneliness; that a man spends the night alone or travels alone.\nAl-Bukhari narrated from Ibn Umar who said: The Messenger of Allah, peace be upon him, said: \"If people knew what is in loneliness, I do not know if anyone would travel at night ever.\"\nAhmad narrated from Abdullah bin Amr bin al-As that the Prophet, peace be upon him, said: \"One rider is a devil, two riders are two devils, and three are a riding party.\"\nAhmad narrated from Abu Huraira who said: The Messenger of Allah, peace be upon him, cursed effeminate men who imitate women, masculine women who imitate men, celibate men who say they will not marry, celibate women who say that, and the one who rides in the desert alone, and the one who sleeps alone.\n**Cause:** Ahmad narrated from Ibn Abbas who said: A man left Khaybar. Two men followed him, and another followed them saying: Four, four. Until he returned them. Then he caught up with the first and said: These two are devils, and I kept at them until I returned them. If you come to...",
    "foot_note": "1. (1) Narrated by Ahmad 2 / 91. (*)",
    "book_id": "976",
    "new_page_number": 78
  },
  {
    "serial_number": "2414431",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "...the Messenger of Allah, peace be upon him, convey my greetings to him and inform him that we are here gathering our charities; if they were suitable for him, we would have sent them to him. When the man arrived in Medina, he informed the Prophet, peace be upon him. At that time, the Messenger of Allah, peace be upon him, forbade solitude.\n\n[72] **Hadith:** Al-Bukhari and Muslim (1) narrated from Ibn Umar that the Prophet, peace be upon him, ordered the killing of dogs. Muslim added: Until we killed the dog of a woman who came from the desert.\n**Cause:** Ahmad and Al-Tabarani narrated from Abu Rafi' who said: Gabriel came asking permission to enter upon the Prophet, peace be upon him. He permitted him, but he delayed entering. The Messenger of Allah, peace be upon him, took his robe and went to him while he was standing at the door. He said: \"We permitted you.\" He said: Yes, O Messenger of Allah, but we do not enter a house in which there is a dog or a picture. They found a puppy in some of their houses. Abu Rafi' said: He ordered me in the morning, so I did not leave a dog in Medina but killed it. Then I saw a woman from the outskirts who had a dog barking. I felt mercy for her and left it. I came and he ordered me, so I returned to the dog and killed it.\n\n[73] **Hadith:** Ahmad (1) narrated from Abu Kabsha al-Anmari who said: I heard the Messenger of Allah, peace be upon him, say: \"Three I swear upon: As for the three I swear upon: The wealth of a servant does not decrease by charity. No servant is wronged a wrong and bears it patiently but that Allah Almighty increases him in honor by it. And no servant opens a door of begging but that Allah Almighty opens for him a door of poverty.\"\n**Cause:** Ahmad narrated from Abu Huraira that a man insulted Abu Bakr while the Prophet, peace be upon him, was sitting. The Prophet, peace be upon him, was wondering and smiling. When the man increased, Abu Bakr responded to some of his words.",
    "foot_note": "1. (1) Narrated by Al-Bukhari in Book of Beginning of Creation, Chapter: If a fly falls into the drink of one of you. Also narrated by Muslim in Book of Musaqah: Chapter: Command to kill dogs etc. \n…. (2) Narrated by Ahmad 4 / 236. (*)",
    "book_id": "976",
    "new_page_number": 79
  },
  {
    "serial_number": "2414432",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "The Prophet, peace be upon him, became angry and stood up. Abu Bakr caught up with him and said: O Messenger of Allah, he was insulting me while you were sitting. When I responded to some of his words, you got angry and stood up. He said: \"There was an angel with you defending you. When you responded to some of his words, Satan arrived. I was not going to sit with Satan.\" Then he said: \"O Abu Bakr, three are all true: No servant is wronged a wrong and overlooks it for the sake of Allah Almighty but that Allah honors him with victory by it. No man opens a door of giving intending connection (Silah) by it but that Allah increases him in abundance by it. And no man opens a door of begging intending increase by it but that Allah Almighty increases him in scarcity by it.\"\n\n[74] **Hadith:** Ahmad, Al-Bukhari, and Muslim (1) narrated from Jarir al-Bajali who said: The Messenger of Allah, peace be upon him, said: \"He who does not show mercy will not be shown mercy.\"\n**Cause:** Ahmad, Al-Bukhari, and Muslim narrated from Abu Huraira who said: The Prophet, peace be upon him, saw Al-Aqra' bin Habis. He (the Prophet) kissed Hasan. Al-Aqra' said: I have ten children, I never kissed any of them. The Prophet said: \"Indeed, he who does not show mercy will not be shown mercy.\"\n\n[75] **Hadith:** Muslim (2) narrated from Abu Ayyub from the Prophet, peace be upon him, who said: \"If you did not have sins for which Allah would forgive you, Allah would have brought a people who have sins to forgive them.\"\nMuslim narrated from Abu Huraira who said: The Messenger of Allah, peace be upon him, said: \"By the One in Whose hand is my soul, if you did not sin, Allah would have taken you away and brought a people who sin and ask forgiveness from Allah...",
    "foot_note": "1. (1) Narrated by Ahmad 4 / 365, Muslim in Book of Virtues, and Al-Bukhari in Book of Literature Chapter: Mercy to people and animals. \n2. Narrated by Muslim in Book of Repentance, Chapter: Dropping of sins by seeking forgiveness. Narrated by Ahmad (*)",
    "book_id": "976",
    "new_page_number": 80
  },
  {
    "serial_number": "2414433",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "...so He forgives them.\"\nAl-Tabarani narrated from Ibn Abbas who said: The Messenger of Allah, peace be upon him, said: \"If you did not sin, Allah would have brought a people who sin so He forgives them.\"\n**Cause:** Ibn Asakir narrated from Anas that the companions of the Prophet, peace be upon him, complained to him that we commit sins. He said to them: \"Were it not that you sin, Allah would have brought a people who sin and seek forgiveness from Allah so He forgives them.\"\nAl-Bayhaqi in Shu'ab al-Iman narrated from Abdullah bin Amr who said: (When the earth is shaken with its [final] earthquake) [Surah Al-Zalzalah: 1] was revealed while Abu Bakr was sitting. Abu Bakr wept. The Messenger of Allah, peace be upon him, said to him: \"What makes you weep, O Abu Bakr?\" He said: This Surah made me weep. The Messenger of Allah, peace be upon him, said to him: \"If you did not err and sin so He forgives you, Allah would create a nation after you who err and sin so He forgives them.\"\n\n[76] **Hadith:** Al-Daraqutni in Al-Afrad narrated from Ibn Umar that the Messenger of Allah, peace be upon him, said: \"It is not lawful for a Muslim to frighten a Muslim.\"\n**Cause:** Ibn Asakir narrated from Al-Waqidi who said: The first battle Zayd bin Thabit witnessed with the Messenger of Allah, peace be upon him, was when he was fifteen years old. He was among those moving dirt that day with the Muslims. The Messenger of Allah, peace be upon him, said: \"Indeed, the boy is disabled (tired).\" Sleep overcame him that day, so he slept. Umara bin Hazm came and took his weapon while he was unaware. The Messenger of Allah, peace be upon him, said: \"O sleeper, you slept until your weapon went!\" The Messenger of Allah, peace be upon him, said: \"Who has knowledge of this boy's weapon?\" Umara bin Hazm said: O Messenger of Allah! I took it. He returned it. The Messenger of Allah, peace be upon him, forbade frightening a believer and taking his belongings, playfully or seriously.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 81
  },
  {
    "serial_number": "2414434",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "[77] **Hadith:** Muslim (1) and Al-Tirmidhi narrated from Ibn Umar who said: The Messenger of Allah, peace be upon him, said: \"Trim the mustaches and grow the beards.\"\n**Cause:** Ibn al-Najjar in his History narrated from Ibn Abbas who said: A delegation of non-Arabs came to the Messenger of Allah, peace be upon him, having shaved their beards and left their mustaches. The Messenger of Allah, peace be upon him, said: \"Oppose them; trim the mustaches and grow the beards.\"\nIbn Sa'd narrated from Ubaydullah bin Abdullah who said: A Magian came to the Messenger of Allah, peace be upon him, having grown his mustache and cut his beard. He said to him: \"Who commanded you this?\" He said: My Lord. He said: \"But my Lord commanded me to trim my mustache and grow my beard.\"\nAbu al-Qasim bin Bishr in his Amali narrated from Abu Huraira: A Magian entered upon the Messenger of Allah, peace be upon him, having shaved his beard and grown his mustache. The Messenger of Allah, peace be upon him, said: \"Woe to you, who commanded you this?\" He said: Kisra commanded me with it. He said: \"But my Lord Almighty commanded me to grow my beard and trim my mustache.\"\n\n[78] **Hadith:** Al-Bukhari (2) narrated from Ibn Umar, may Allah be pleased with them both, from the Prophet, peace be upon him, who said: \"That the belly of one of you fills with pus is better for him than to fill with poetry.\"\n**Cause:** Ahmad and Muslim narrated from Abu Sa'id al-Khudri who said: While we were traveling with the Messenger of Allah, peace be upon him, at Al-Arj, a poet appeared reciting. The Messenger of Allah, peace be upon him, said:",
    "foot_note": "1. (1) Narrated by Muslim in Book of Purification Chapter: Characteristics of Fitra and Al-Tirmidhi: Chapter: What came regarding growing the beard. \n2. Narrated by Al-Bukhari in Book of Literature Chapter: What is disliked for poetry to be dominant over a person \n.... etc. (*)",
    "book_id": "976",
    "new_page_number": 82
  },
  {
    "serial_number": "2414435",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "\"Take the devil. Or catch the devil. For a man's belly to fill with pus is better for him than to fill with poetry.\"\n\n[89] **Hadith:** The Four (1) narrated from Sakhr al-Ghamidi from the Prophet, peace be upon him, who said: \"O Allah, bless my Ummah in its early hours.\"\n**Cause:** Al-Khatib and Ibn al-Najjar in Tarikh Baghdad narrated from Anas who said: I went out with the Prophet, peace be upon him, one night in the months of Ramadan. He passed by fires in the houses of the Ansar. He said: \"O Anas, what are these fires?\" I said: O Messenger of Allah, the Ansar are taking Suhoor. He said: \"O Allah, bless my Ummah in its early hours.\"\n\n[80] **Hadith:** Ahmad, Al-Bukhari, Abu Dawood, Al-Tirmidhi, Al-Nasa'i, and Ibn Majah (2) narrated from Ibn Abbas who said: The Messenger of Allah, peace be upon him, forbade drinking from the mouth of the water skin.\nAl-Bukhari, Muslim, Abu Dawood, Al-Tirmidhi, Ibn Majah, and Al-Bayhaqi in Shu'ab al-Iman narrated from Abu Sa'id from the Prophet, peace be upon him, that he forbade bending the mouths of water skins to drink from them.",
    "foot_note": "1. (1) Narrated by Abu Dawood in Book of Jihad Chapter: Leaving early in travel, Ibn Majah in Book of Trade: Chapter: Hope for blessing in early hours, Al-Tirmidhi Chapter: What came regarding earliness in trade, and narrated by Ahmad 3 / 416. \n2. Narrated by Ahmad 1 / 293, Al-Tirmidhi Chapter: What came regarding eating meat of Al-Jallalah and its milk, Al-Bukhari in Book of Drinks, Chapter: Drinking from the mouth of the water skin?, Narrated by Ibn Majah in Book of Drinks: Chapter: Drinking from the mouth of the water skin, Abu Dawood in Book of Drinks, Chapter: Bending mouths of water skins, Narrated by Al-Nasa'i in Book of Sacrifices: Chapter: Prohibition of eating meat of Al-Jallalah. (*)",
    "book_id": "976",
    "new_page_number": 83
  },
  {
    "serial_number": "2414436",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "**Cause:** Al-Bayhaqi in Shu'ab al-Iman narrated from Al-Zuhri from Abdullah bin Abi Sa'id who said: A man drank from the mouth of a water skin and a snake slipped into his belly. So the Messenger of Allah, peace be upon him, forbade bending the mouths of water skins (to drink from them directly).\n\n[81] **Hadith:** Al-Bukhari and Muslim (1) narrated from Abu Huraira who said: The Messenger of Allah, peace be upon him, said: \"O Allah, I take a covenant with You which You will not break for me; I am only a human. Any believer whom I harmed, insulted, or flogged, make it for him a prayer, purity, and a means of nearness by which You bring him near on the Day of Resurrection.\"\nAhmad and Muslim narrated from Jabir bin Abdullah: I heard the Prophet, peace be upon him, say: \"I am only a human, and I stipulated on my Lord Almighty: Any slave from the Muslims whom I insulted or cursed, let it be for him purity and reward.\"\nAhmad narrated from Abu Sa'id al-Khudri who said: The Messenger of Allah, peace be upon him, said: \"O Allah, I take a covenant with You which You will not break for me. I am only a human. Any believer whom I harmed or insulted - or he said: cursed - or flogged, make it for him a prayer, purity, means of nearness, and closeness by which You bring him near to You on the Day of Resurrection.\"\n**Cause:** Ahmad narrated from Anas that the Messenger of Allah, peace be upon him, gave a man to Hafsa daughter of Umar and said to her: Guard him. He said: Hafsa did so, but the man left. The Messenger of Allah, peace be upon him, entered and said: \"O Hafsa, what did the man do?\" She said: I was distracted from him, O Messenger of Allah, so he left. The Messenger of Allah, peace be upon him, said: \"May Allah cut your hand.\" She raised...",
    "foot_note": "1. (1) Narrated by Ahmad 2 / 316, Al-Bukhari in Book of Supplications: Chapter: The saying of the Prophet peace be upon him: Whom I harmed... etc., Narrated by Muslim in Book of Birr: Chapter: Whom the Prophet peace be upon him cursed... etc. (*)",
    "book_id": "976",
    "new_page_number": 84
  },
  {
    "serial_number": "2414437",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 82,
    "volume_number": 1,
    "text": "...her hands like this. The Messenger of Allah, peace be upon him, entered and said: \"What is the matter with you, O Hafsa?\" She said: O Messenger of Allah! You said before: to me such and such. He said: \"To her: Put down your hands, for I asked Allah Almighty that any human from my Ummah whom I prayed against, that He make it for him forgiveness.\"\nAhmad and Muslim narrated from Anas who said: Umm Sulaym had an orphan girl. The Messenger of Allah, peace be upon him, saw the orphan girl and said: \"It is you! You have grown. May your age not increase.\" The orphan girl returned to Umm Sulaym weeping. Umm Sulaym said: What is wrong, O daughter? The girl said: The Prophet of Allah, peace be upon him, prayed against me that my age not increase, so now my age will never increase, or she said my generation. Umm Sulaym went out hurriedly twisting her headcover until she met the Messenger of Allah, peace be upon him. The Messenger of Allah, peace be upon him, said to her: \"What is wrong, O Umm Sulaym?\" She said: O Prophet of Allah! Did you pray against my orphan girl? He said: \"And what is that, O Umm Sulaym?\" She said: She claimed you prayed that her age not increase and her generation not increase. He said: The Messenger of Allah, peace be upon him, laughed then said: \"O Umm Sulaym, do you not know my condition with my Lord? I stipulated on my Lord, saying: I am only a human; I am pleased as humans are pleased and I get angry as humans get angry. Anyone from my Ummah whom I prayed against with a prayer they do not deserve, make it for them purification, purity, and nearness by which You bring them near on the Day of Resurrection.\"\nAhmad narrated from the uncle of Abu al-Sawwar who said: I saw the Messenger of Allah, peace be upon him, and people following him, so I followed with them. He said: He surprised me, so I admired the people running. He said: And the people stayed (stopped). He said: The Messenger of Allah, peace be upon him, came upon me and struck me a blow either with a palm branch, stick, siwak, or something he had. He said: By Allah it did not hurt me. He said: I spent a night. He said: And I said: The Messenger of Allah, peace be upon him, only struck me for something wrong in me. He said: My soul told me to go to the Messenger of Allah, peace be upon him, when I wake up. He said: Gabriel descended...",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 85
  },
  {
    "serial_number": "2414438",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 83,
    "volume_number": 1,
    "text": "...peace be upon him to the Prophet, peace be upon him, and said: You are a shepherd who does not break the horns of his flock. He said: When we prayed the morning prayer or he said we woke up, he said: The Messenger of Allah, peace be upon him, said: \"O Allah, people follow me, and I do not like them to follow me. O Allah, whomever I struck or cursed, make it for him expiation and reward - or he said: forgiveness and mercy.\" Or as he said.\n\n[82] **Hadith:** Al-Tirmidhi (1) narrated from Aisha that the Prophet, peace be upon him, said: \"It is not fitting for a people among whom is Abu Bakr that anyone else leads them.\"\n**Cause:** Abu al-Abbas al-Zawzani narrated in the book \"Shajarat al-Aql\" from Al-Qasim bin Muhammad who said: Something happened among the Ansar from the people of the Awali. The Messenger of Allah, peace be upon him, went to reconcile between them. They returned, and the people had prayed Asr. He said: \"Who led the people in Asr?\" They said: Abu Bakr. He said: \"You did well. It is not fitting for a people among whom is Abu Bakr that anyone else leads them.\"\n\n[83] **Hadith:** Al-Bukhari (2) narrated from Abu Huraira who said: Abu al-Qasim, peace be upon him, said: \"Name yourselves with my name but do not use my Kunya (Abu al-Qasim).\"\n**Cause:** Ahmad, Al-Bukhari, and Muslim narrated from Jabir bin Abdullah that a man from the Ansar had a boy born to him, and he wanted to name him Muhammad. He came to the Messenger of Allah, peace be upon him, who said: \"Name yourselves with my name but do not use my Kunya.\"\nAl-Bukhari and Muslim narrated from Anas that the Messenger of Allah, peace be upon him, was in Al-Baqi'. A man called another man: \"O Abu al-Qasim.\" The Prophet, peace be upon him, turned. The man said: I did not mean you, O Messenger of Allah, I only meant So-and-so. The Messenger of Allah, peace be upon him, said: \"Name yourselves with my name but...",
    "foot_note": "1. (1) Narrated by Al-Tirmidhi in Virtues. \n2. Narrated by Al-Bukhari in Book of Virtues: Chapter: Kunya of the Prophet peace be upon him. (*)",
    "book_id": "976",
    "new_page_number": 86
  },
  {
    "serial_number": "2414439",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 84,
    "volume_number": 1,
    "text": "...do not use my Kunya.\"\n\n[84] **Hadith:** Ahmad (1) narrated from Abdullah bin al-Zubayr that the Prophet, peace be upon him, said: \"Every prophet has a disciple (Hawari), and Al-Zubayr is my disciple.\"\nAhmad narrated from Ali: I heard the Messenger of Allah, peace be upon him, say: \"Every prophet has disciples, and my disciple is Al-Zubayr.\"\n**Cause:** Ahmad, Al-Bukhari, and Muslim narrated from Jabir bin Abdullah who said: The Messenger of Allah, peace be upon him, said: \"Who will bring me news of the people on the Day of Ahzab?\" Al-Zubayr said: I. Then he said: \"Who will bring me news of the people?\" Al-Zubayr said: I. He said: \"Who will bring me news of the people?\" Al-Zubayr said: I. He said: \"Every prophet has a disciple, and indeed my disciple is Al-Zubayr.\"\n\n[85] **Hadith:** Al-Bukhari, Muslim, Al-Tirmidhi, and Ibn Majah (2) narrated from Ali who said: I never heard the Prophet, peace be upon him, ransom anyone with his parents except Sa'd. I heard him on the Day of Uhud saying: \"Shoot, Sa'd, may my father and mother be your ransom.\"\nIn a wording: The Messenger of Allah, peace be upon him, never combined his father and mother for anyone except Sa'd. He said to him on the Day of Uhud: \"Shoot, may my father and mother be your ransom.\"\n**Cause:** Al-Tabarani narrated from Sa'd that the Prophet, peace be upon him, combined his parents for him. He said: There was a man from the polytheists who burned (hurt) the Muslims. The Prophet, peace be upon him, said: \"Sa'd, shoot, may my father and mother be your ransom.\" He said: I pulled an arrow without a head and hit his side, so he fell...",
    "foot_note": "1. (1) Narrated by Ahmad 4 / 4. \n2. Mentioned by Al-Tirmidhi in Virtues: Chapter: Virtues of Abu Ishaq, Al-Bukhari in Book of Jihad: Chapter: The Shield and one who shields himself with his companion's shield, Muslim in Book of Virtues of Companions Chapter: On the virtue of Sa'd bin Abi Waqqas, and mentioned by Ibn Majah Chapter: Virtue of Sa'd bin Abi Waqqas. (*)",
    "book_id": "976",
    "new_page_number": 87
  },
  {
    "serial_number": "2414440",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 85,
    "volume_number": 1,
    "text": "...and his private part was exposed. The Prophet, peace be upon him, laughed until I saw his molars.\n\n[86] **Hadith:** Ahmad (1) narrated from Abdullah bin Mas'ud that Abu Bakr and Umar, may Allah be pleased with them, gave him glad tidings that the Messenger of Allah, peace be upon him, said: \"Whoever is pleased to read the Quran fresh as it was revealed, let him read according to the reading of Ibn Umm Abd.\"\nAhmad narrated from Umar bin al-Mustaliq who said: The Messenger of Allah, peace be upon him, said: \"Whoever loves to read the Quran fresh as it was revealed, let him read according to the reading of Ibn Umm Abd.\"\n**Cause:** Abdullah bin Ahmad said in Zawa'id al-Zuhd: Abu al-Kamil Fudayl bin al-Husayn told me, Al-Mufaddal al-Kufi Abu Abd al-Rahman told us, Ibrahim bin al-Muhajir told us, Ibrahim al-Nakha'i told us from Ubayda, from Abdullah bin Mas'ud who said: The Messenger of Allah, peace be upon him, ascended the pulpit and said: \"Read.\" I read Surah Al-Nisa to him until I reached (from Him when We bring from every nation a witness and we bring you against these as a witness) [Surah Al-Nisa: 41]. He nudged me with his foot, so I raised my head and saw his eyes flowing (with tears). He said: \"Whoever loves to read the Quran as it was revealed, let him read it according to the reading of Ibn Umm Abd.\"\nAhmad narrated from Umar bin al-Khattab: The Messenger of Allah, peace be upon him, used to converse at night with Abu Bakr, may Allah be pleased with him, about the affair of the Muslims, and I was with him. One night he conversed with him, and I was with him. The Messenger of Allah, peace be upon him, went out, and we went out with him. Behold, a man was standing praying in the mosque. The Messenger of Allah, peace be upon him, stood listening to his reading. When we almost recognized him, the Messenger of Allah, peace be upon him, said: \"Whoever is pleased to read the Quran fresh as it was revealed, let him read it according to the reading of Ibn Umm Abd.\"",
    "foot_note": "1. (1) Narrated by Ahmad 1 / 7. (*)",
    "book_id": "976",
    "new_page_number": 88
  },
  {
    "serial_number": "2414441",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 86,
    "volume_number": 1,
    "text": "[87] **Hadith:** Al-Tirmidhi (1) narrated via Qays bin Abi Hazim from Sa'd that the Messenger of Allah, peace be upon him, said: \"O Allah, answer Sa'd when he calls upon You.\"\n**Cause:** Al-Tabarani narrated from Amir, i.e., Al-Sha'bi, who said: It was said to Sa'd: When was your supplication answered? He said: On the Day of Badr, I was shooting in front of the Prophet, peace be upon him. I would put the arrow in the bow's handle then say: O Allah, shake their feet, terrify their hearts, and do with them and do. The Prophet, peace be upon him, would say: \"O Allah, answer Sa'd.\"\n\n[88] **Hadith:** Ahmad and Al-Tirmidhi (2) (who classified it Hasan), and Al-Hakim narrated from Ubayy bin Ka'b: I heard the Messenger of Allah, peace be upon him, say: \"Were it not for the Migration, I would have been a man from the Ansar. If people took a valley or a mountain pass, I would be with the Ansar.\"\n**Cause:** Ibn Abi Shaybah, Al-Munawi, and Muslim narrated from Abdullah bin Zayd bin Asim who said: When Allah granted His Messenger booty on the Day of Hunayn, he distributed among people to reconcile their hearts, but did not distribute nor give the Ansar anything. They seemed upset that what befell people did not befall them. He addressed them saying: \"O assembly of Ansar! Did I not find you astray and Allah guided you by me? And you were divided and Allah united you by me? And poor and Allah enriched you by me?\" He said: Whenever he said something, they said: Allah and His Messenger are most benevolent. He said: \"What prevents you from answering?\" They said: Allah and His Messenger are most benevolent. He said: \"If you wished, you could say: You came to us such and such. Are you not pleased that people go with sheep and camels, and you go with the Messenger of Allah, peace be upon him, to your dwellings? Were it not for the Migration, I would have been a man from the Ansar. If...",
    "foot_note": "1. (1) Mentioned by Al-Tirmidhi in Virtues: Chapter: Virtues of Sa'd bin Abi Waqqas. \n2. Narrated by Ahmad 5 / 137. Mentioned by Al-Tirmidhi in Virtues: Chapter: Virtue of Ansar and Quraysh. (*)",
    "book_id": "976",
    "new_page_number": 89
  },
  {
    "serial_number": "2414442",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 87,
    "volume_number": 1,
    "text": "...people took a valley or a mountain pass, I would take the valley of the Ansar and their pass. The Ansar are the inner garment and people are the outer garment. You will encounter selfishness after me, so be patient until you meet me at the Basin.\"\n\n[89] **Hadith:** Ahmad and Muslim (1) narrated from Abu Sa'id who said: The Messenger of Allah, peace be upon him, said: \"Do not insult my companions, for by the One in Whose hand is my soul, if one of you spent the like of Uhud in gold, he would not reach the mudd (handful) of one of them nor half of it.\" Al-Barqani narrated it in his Mustakhraj on Sahih (Muslim), saying: \"If one of you spent every day the like of Uhud in gold.\"\n**Cause:** Ahmad narrated from Anas who said: There was a dispute between Khalid bin al-Walid and Abd al-Rahman bin Awf. Khalid said to Abd al-Rahman bin Awf: You claim superiority over us by days you preceded us in. We were informed that this was mentioned to the Prophet, peace be upon him, so he said: \"Leave my companions alone for me. By the One in Whose hand is my soul, if you spent the like of Uhud or like mountains in gold, you would not reach their deeds.\"\nIbn Asakir narrated from Abu Sa'id al-Khudri who said: There was something between Abd al-Rahman bin Awf and Khalid bin al-Walid, so Khalid insulted him. The Messenger of Allah, peace be upon him, said: \"Do not insult anyone of my companions, for if one of you spent the like of Uhud in gold, he would not reach the mudd of one of them nor half of it.\"\nIbn Asakir narrated from Abu Huraira who said: Something that happens between people happened between Abd al-Rahman bin Awf and Khalid bin al-Walid. The Messenger of Allah, peace be upon him, said: \"Leave my companions alone for me, for if one of you spent the like of Uhud in gold, he would not reach the mudd of one of them nor half of it.\"",
    "foot_note": "1. (1) Narrated by Muslim in Book of Virtues of Companions: Chapter: Prohibition of insulting Companions. (*)",
    "book_id": "976",
    "new_page_number": 90
  },
  {
    "serial_number": "2414443",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 88,
    "volume_number": 1,
    "text": "Ibn Asakir narrated in the biography of Khalid bin al-Walid from Al-Hasan who said: There was something between Al-Zubayr and Khalid bin al-Walid. The Messenger of Allah, peace be upon him, said: \"What is the matter with you and my companions? By the One in Whose hand is my soul, if one of you spent the like of Uhud in gold, he would not reach the like of the deed of one of them for a single day.\" Ibn Asakir said: What is preserved is that the opponent of Khalid was Abd al-Rahman bin Awf and Ammar.\nIbn Asakir narrated in the biography of Ibn Awf from Al-Hasan who said: There was speech between Abd al-Rahman bin Awf and Khalid bin al-Walid. Khalid said: Do not boast over me, O Ibn Awf, that you preceded me by a day or two. That reached the Prophet, peace be upon him, so he said: \"Leave my companions alone for me. By the One in Whose hand is my soul, if one of you spent the like of Uhud in gold, he would not reach half of them.\" He said: Then after that, there was something between Abd al-Rahman and Al-Zubayr. Khalid said: O Prophet of Allah, Allah! You forbade me regarding Abd al-Rahman, and here Al-Zubayr is insulting him. He said: \"They are the people of Badr, and some of them are more entitled to each other.\"\n\n[90] **Hadith:** Al-Tirmidhi (1) narrated from Burayda who said: The Messenger of Allah, peace be upon him, said: \"No one of my companions dies in a land but he will be resurrected as a leader or light for them on the Day of Resurrection.\"\n**Cause:** Ibn Asakir narrated from Abdullah bin al-Hasan who said: Amir bin al-Akwa' died in Wadi al-Qura. The Messenger of Allah, peace be upon him, said: \"No man of my companions dies in a land of lands but Allah resurrects him on the Day of Resurrection as the master of the people of that land.\"",
    "foot_note": "1. (1) Mentioned by Al-Tirmidhi in Virtues: Chapter: Whoever insulted the Companions of the Prophet peace be upon him. (*)",
    "book_id": "976",
    "new_page_number": 91
  },
  {
    "serial_number": "2414444",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 89,
    "volume_number": 1,
    "text": "[91] **Hadith:** Al-Tirmidhi (1) narrated from Sa'id bin Zayd bin Amr bin Nufayl from the Prophet, peace be upon him, who said: \"Ten are in Paradise: Abu Bakr is in Paradise, Umar is in Paradise, Ali, Uthman, Al-Zubayr, Talha, Abd al-Rahman, Ubayda, and Sa'd bin Abi Waqqas.\" He said: He counted these nine and was silent about the tenth. The people said: We adjure you by Allah, O Abu al-A'war, who is the tenth? He said: You adjured me by Allah. Abu al-A'war is in Paradise. He said: He is Sa'id bin Zayd bin Amr bin Nufayl.\n**Cause:** Ibn Asakir narrated from Sa'id bin Zayd who said: I heard Abu Bakr al-Siddiq say to the Messenger of Allah, peace be upon him: I wish I saw a living man from the people of Paradise. The Messenger of Allah, peace be upon him, said to him: \"This is I, from the people of Paradise.\" He said: O Messenger of Allah, I do not doubt you. So he counted for him and said: \"O Abu Bakr, I am from the people of Paradise, you are from the people of Paradise, Umar is from the people of Paradise, Uthman is from the people of Paradise, Ali is from the people of Paradise, Talha is from the people of Paradise, Al-Zubayr is from the people of Paradise, Abd al-Rahman bin Awf is from the people of Paradise, Sa'd bin Malik is from the people of Paradise, and the tenth I have named.\" They adjured him by Allah: Who is the tenth? He said: \"I am.\"\n\n[92] **Hadith:** Muslim (2) narrated from Abu Huraira from the Messenger of Allah that he said: \"By the One in Whose hand is the soul of Muhammad, no one of this nation, Jew or Christian, hears of me then dies without believing in what I was sent with, but he will be of the inhabitants of the Fire.\"\n**Cause:** Al-Daraqutni in Al-Afrad narrated from Abdullah bin Mas'ud who said: A man came to the Messenger of Allah, peace be upon him, and said: O Messenger of Allah, I saw a man from...",
    "foot_note": "1. (1) Mentioned by Al-Tirmidhi in Virtues: Chapter: Virtues of Abd al-Rahman bin Awf. \n2. Narrated by Muslim in Book of Faith: Chapter: Obligation of faith in the message of our Prophet Muhammad peace be upon him. (*)",
    "book_id": "976",
    "new_page_number": 92
  },
  {
    "serial_number": "2414445",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 90,
    "volume_number": 1,
    "text": "...the Christians holding fast to the Gospel and a man from the Jews holding fast to the Torah believing in Allah and His Messenger, then he did not follow you. The Messenger of Allah, peace be upon him, said: \"Whoever hears of me from a Jew or Christian then does not follow me, he is in the Fire.\"\n\n[93] **Hadith:** ...\n**Cause:** Al-Tabarani narrated from Wahshi bin Harb that the Prophet, peace be upon him, went out for his need at night and left the door of the house open. Then he returned and found Iblis standing in the middle of the house. The Prophet, peace be upon him, said: \"Be gone, O wicked one, from my house.\" Then the Messenger of Allah, peace be upon him, said: \"If you go out of your houses at night, close their doors.\"\n\n[94] **Hadith of Umm Zar':** ...\n**Cause:** Al-Tabarani narrated from Aisha who said: I boasted about my father's wealth in Jahiliyyah, and it was the amount of a million awqiya. The Prophet, peace be upon him, said to me: \"Be silent, O Aisha, for I am to you like Abu Zar' to Umm Zar'.\" Then the Messenger of Allah, peace be upon him, began narrating that eleven women gathered in Jahiliyyah and covenanted to tell every woman what is in her husband and not lie. He mentioned the hadith in length.\n\n[95] **Hadith:** Malik, Al-Bukhari, Muslim, Al-Tirmidhi, and Al-Nasa'i (1) narrated from Jubayr bin Mut'im that the Messenger of Allah, peace be upon him, said: \"I have names: I am Muhammad, I am Ahmad, I am Al-Mahi (the Eraser) by whom disbelief is erased after me, and I am Al-Hashir (the Gatherer) who gathers...",
    "foot_note": "1. (1) Narrated by Al-Bukhari in Book of Virtues (Manaqib): Chapter: What came regarding the names of the Messenger of Allah peace be upon him in Book of Virtues (Fada'il): Chapter: regarding his names peace be upon him. Mentioned by Al-Tirmidhi in Etiquette: Chapter: What came regarding the names of the Prophet peace be upon him. (*)",
    "book_id": "976",
    "new_page_number": 93
  },
  {
    "serial_number": "2414446",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 91,
    "volume_number": 1,
    "text": "...people at my feet.\"\n**Cause:** Al-Tabarani narrated from Jubayr bin Mut'im who said: Abu Jahl bin Hisham said when he returned to Mecca leaving Hamza: O assembly of Quraysh, indeed Muhammad has settled in Yathrib and sent his vanguards. He only wants to strike something of you. So beware of passing his way and approaching him, for he is like a predatory lion. If he restricts you, you will reject him as ticks are rejected from spoils. By Allah, he has magic; I never saw him nor anyone of his companions but I saw Satan with them. You have known the two sons of Qayla; he is an enemy seeking help from an enemy.\nMut'im bin Adi said to him: O Abu al-Hakam, by Allah I have never seen anyone more truthful in tongue nor truer in promise than your brother whom you expelled. If you have done what you have done, be the most refraining people from him.\nAbu Sufyan bin al-Harith said: Be most severe in what you were upon. For if the two sons of Qayla overcome you, they will not observe in you any bond or covenant. If you obey them, make them join the news of Kinana (destroy them), or expel Muhammad from among them so he becomes alone and unique. As for the two sons of Qayla, by Allah they and destruction in humiliation are but equal. I will suffice you their seriousness. He said: I will grant a side of me rough upon what was of near and far. The men of Khazraj are people of humiliation when jest becomes serious.\nThat reached the Messenger of Allah, peace be upon him: \"By the One in Whose hand is my soul, I will kill them, crucify them, and guide them while they dislike. I am a mercy sent by Allah Almighty, and He will not take me until Allah manifests His religion. I have five names: I am Muhammad, I am Ahmad, I am Al-Mahi by whom Allah erases disbelief, I am Al-Hashir who gathers people at his hands, and I am Al-Aqib.\" Ahmad bin Salih said: I hope the hadith is authentic.",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 94
  },
  {
    "serial_number": "2414447",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 92,
    "volume_number": 1,
    "text": "[96] **Hadith:** Al-Hakim (1) narrated from Ibn Mas'ud who said: The Messenger of Allah, peace be upon him, said: \"I am pleased for my Ummah what Ibn Umm Abd is pleased for it.\"\n**Cause:** Ibn Asakir said: It was narrated from another perspective with its cause in which it appeared. Then he narrated from Amr bin Hurayth who said: The Prophet, peace be upon him, said to Abdullah bin Mas'ud: \"Read.\" He said: I read while it was revealed to you? He said: \"I love to hear it from another.\" He started Al-Nisa until he reached (from Him when We bring from every nation a witness and we bring you against these as a witness [Surah Al-Nisa: 41]. The Messenger of Allah, peace be upon him, wept, and Abdullah stopped. The Messenger of Allah, peace be upon him, said to him: \"Speak.\" He praised Allah in the beginning of his speech, extolled Allah, prayed upon the Prophet, peace be upon him, and testified the testimony of truth. He said: We are pleased with Allah as Lord, Islam as religion, and I am pleased for you what Allah and His Messenger are pleased with. The Messenger of Allah, peace be upon him, said: \"I am pleased for you what Ibn Umm Abd is pleased for you.\"\n\n[97] **Hadith:** Ahmad, Al-Bukhari, Muslim, Abu Dawood, and Al-Tirmidhi (2) narrated from Jabir who said: The Messenger of Allah, peace be upon him, said: \"War is deception.\"\n**Cause:** Ibn Abi Shaybah narrated from Urwa who said: The Messenger of Allah, peace be upon him, said on the Day of Qurayza: \"War is deception.\" He said: There was a man among the companions of the Messenger of Allah, peace be upon him, called Mas'ud, and he was a slanderer. When it was the Day of the Trench, the people of Qurayza sent to Abu Sufyan: Send us men to be in our fortresses so we fight Muhammad from the side of Medina and you fight from the side of the Trench. That was hard on the Prophet, peace be upon him...",
    "foot_note": "1. (1) Al-Hakim in Book of Knowledge of Companions. \n2. Narrated by Ahmad, and Al-Bukhari in Book of Jihad: Chapter War is Deception. And Muslim Chapter Permissibility of Deception in War. (*)",
    "book_id": "976",
    "new_page_number": 95
  },
  {
    "serial_number": "2414448",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 93,
    "volume_number": 1,
    "text": "...to fight from two fronts. He said to Mas'ud: \"O Mas'ud, we have sent to Banu Qurayza to send to Abu Sufyan to send them men, so when they come to them, they fight them.\" He said: No sooner had he heard that from the Prophet, peace be upon him, than he could not control himself until he came to Abu Sufyan and told him. He said: Muhammad spoke the truth, by Allah, he never lied. So he did not send anyone to them.\nIbn Jarir narrated in Tahdhib al-Athar from Ibn Shihab who said: Qurayza sent to Abu Sufyan and those with him from the Confederates on the Day of the Trench: Stand firm, for we will raid the heartland of Muslims from behind them. Nu'aym bin Mas'ud al-Ashja'i heard that, and he was with Uyayna bin Hisn when Banu Qurayza sent that to the Confederates. The Messenger of Allah, peace be upon him, said: \"Perhaps we ordered them to do that.\" Nu'aym stood with that word of the Messenger of Allah, peace be upon him, from the Messenger of Allah, peace be upon him, to tell Ghatafan about it. Nu'aym was a man who could not hold a story. When Nu'aym turned to go to Ghatafan, Umar bin al-Khattab said: O Messenger of Allah, this which you said: is it from Allah so you command it, or is it an opinion you saw? For the matter of Banu Qurayza is too easy for you to say something that affects you. The Messenger of Allah, peace be upon him, said: \"Rather, it is an opinion I saw; indeed war is deception.\" Then the Messenger of Allah, peace be upon him, sent after Nu'aym and said: \"Did you see what you heard me mention just now? Withhold from it and do not mention it to anyone.\" Nu'aym left until he came to Uyayna bin Hisn and those with him. He said to them: Did you know that Muhammad ever said anything but truth? They said: No. He said: He said to me regarding what Banu Qurayza sent to you: Perhaps we ordered them to do that. Then he forbade me to mention it to you. Uyayna went until he met Abu Sufyan and told him. He said: You are only in a plot from Banu Qurayza. So they departed, and that was their defeat. Thereby people permitted deception in war. Ibn Jarir said:",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 96
  },
  {
    "serial_number": "2414449",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 94,
    "volume_number": 1,
    "text": "His saying: \"Perhaps we ordered them to do that\" is a statement bearing two meanings: that it be by his command or by other than his command. That is truth in which there is no doubt and is far from lying.\nIbn Jarir narrated from Ibn Abbas who said: The Messenger of Allah, peace be upon him, sent a man from his companions to a man from the Jews and ordered him to kill him. He said to him: O Messenger, I cannot do that unless you permit me (to lie). The Messenger of Allah, peace be upon him, said to him: \"War is only deception, so do what you want.\"\n\n[98] **Hadith:** Ibn Jarir in his Tahdhib, Al-Khara'iti in Masawi' al-Akhlaq, and Al-Bayhaqi in Shu'ab al-Iman narrated via Shahr bin Hawshab from Al-Zibriqan, from Al-Nawwas bin Sam'an who said: The Messenger of Allah, peace be upon him, said: \"Why do I see you falling into lies as moths fall into fire? Lo, every lie is written against the son of Adam except in three: a man lying to his wife to please her, a man lying for war, for war is deception, and a man lying to reconcile between two men, for Allah Almighty says: (No good is there in much of their private conversation, except for those who enjoin charity or that which is right or conciliation between people).\"\nAhmad, Ibn Jarir, Al-Tabarani, and Al-Bayhaqi narrated from Shahr bin Hawshab who said: Asma' bint Yazid told me that the Prophet, peace be upon him, said: \"O people, what makes you pursue lies as moths pursue fire? Every lie is written against the son of Adam except three characteristics: a man lying to his wife to please her, or a man lying between two Muslims to reconcile between them, and a man lying in war deception.\"\n**Cause:** Ibn Jarir narrated from Shahr bin Hawshab that the Messenger of Allah, peace be upon him, sent...",
    "foot_note": "None",
    "book_id": "976",
    "new_page_number": 97
  },
  {
    "serial_number": "2414450",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "Al-Luma' fi Asbab Wurud al-Hadith",
    "edition": "First, 1416 AH / 1996 AD",
    "publisher": "None",
    "page_number": 95,
    "volume_number": 1,
    "text": "...a detachment. They stopped at a man's place. He brought them a young goat or sheep to slaughter. They said: It is lean, for Allah Almighty says: (No good is there in much of their private conversation, except for those who enjoin charity or that which is right or conciliation between people).\nAhmad, Ibn Jarir, Al-Tabarani, and Al-Bayhaqi narrated from Shahr bin Hawshab who said: Asma' bint Yazid told me that the Prophet, peace be upon him, said: \"O people, what makes you pursue lies as moths pursue fire? Every lie is written against the son of Adam except three characteristics: a man lying to his wife to please her, or a man lying between two Muslims to reconcile between them, and a man lying in war deception.\"\n**Cause:** Ibn Jarir narrated from Shahr bin Hawshab that the Messenger of Allah, peace be upon him, sent...\n\n...a detachment. They stopped at a man's place. He brought them a young goat or sheep to slaughter. They said: It is lean. They refused to slaughter it. He had a shade in which he had sheep. They said to him: Bring out the sheep so they are in the shade. He said: I fear for my sheep; my land has hot winds (Samum), if they go out. They said: Our souls are dearer to us than your sheep. They brought out the sheep, and they were in the shade. His sheep were driven out. He went and informed the Prophet, peace be upon him, of their deed. When they came, the Prophet, peace be upon him, mentioned to them what the man told him. They said: He lied, by Allah, nothing of what he says happened. The Prophet, peace be upon him, said: \"If there is good in anyone of your companions, perhaps it is you who believes me.\" He (the man) informed him as the man informed him. The Messenger of Allah, peace be upon him, said: \"You fall into lies as moths fall into fire.\" Then he said: \"Lying is written all inevitably as a lie, except that a man lies in war, for war is deception; and that a man lies between two men reconciling between them; and that he lies to his family, meaning his wife.\"",
    "foot_note": "None\n\nNone",
    "book_id": "976",
    "new_page_number": 98
  }
]