[
  {
    "text": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah\nAuthor: الحسن بن أبي عبد الله الحسين العيثاوي البقاعي الشافعي\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "new_page_number": 1
  },
  {
    "text": "sn: 4223\nbook_title: الأجوبة العيثاوية عن المسائل الطرابلسية\nbook_link: https://shamela.ws/book/297\nbook_id: 297\nauthor_name: الحسن بن أبي عبد الله الحسين العيثاوي البقاعي الشافعي\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/3100\nauthor_ID: 3100\neditor: عمرو عبد العظيم الحويني\npublisher: دار البشائر الإسلامية للطباعة والنشر والتوزيع، بيروت - لبنان\nedition: الأولى، 1436 هـ - 2015 م\npages: 64\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الفقه الشافعي\ncategory_id: 16",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "new_page_number": 2
  },
  {
    "serial_number": "3907683",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Shafi'i Fiqh. Book: Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah. Author: Al-Hasan bin Abi Abdullah Al-Husayn Al-Aithawi Al-Biqa'i Al-Shafi'i. Investigator: Amr Abdul Azim Al-Huwaini. Publisher: Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon. Edition: First, 1436 AH - 2015 AD. Number of Pages: 64 [Book numbering matches the printed version]. Publication Date in Shamela: 16 Shawwal 1442.\nBook: Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah. Author: Al-Hasan bin Abi Abdullah Al-Husayn Al-Aithawi Al-Biqa'i Al-Shafi'i. Investigator: Amr Abdul Azim Al-Huwaini. Publisher: Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon. Edition: First, 1436 AH - 2015 AD. Number of Pages: 64 [Book numbering matches the printed version]. Publication Date in Shamela: 16 Shawwal 1442.\nAuthor: Al-Hasan bin Abi Abdullah Al-Husayn Al-Aithawi Al-Biqa'i Al-Shafi'i. Investigator: Amr Abdul Azim Al-Huwaini. Publisher: Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon. Edition: First, 1436 AH - 2015 AD. Number of Pages: 64 [Book numbering matches the printed version]. Publication Date in Shamela: 16 Shawwal 1442.\nInvestigator: Amr Abdul Azim Al-Huwaini. Publisher: Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon. Edition: First, 1436 AH - 2015 AD. Number of Pages: 64 [Book numbering matches the printed version]. Publication Date in Shamela: 16 Shawwal 1442.\n[Book numbering matches the printed version]. Publication Date in Shamela: 16 Shawwal 1442.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 3
  },
  {
    "serial_number": "3907684",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwiba Al-'Aythawiyya on the Tripoli Issues",
    "edition": "First Edition, 1436 AH - 2015 CE",
    "publisher": "Dar Al-Basha’ir Al-Islamiyya for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 3,
    "volume_number": 1,
    "text": "Introduction to Verification: Indeed, all praise is due to Allah; we praise Him, seek His help, and ask His forgiveness. We seek refuge in Allah from the evils of our own selves and the misdeeds of our actions. Whoever Allah guides, none can mislead; and whoever He allows to go astray, none can guide. I bear witness that there is no deity worthy of worship except Allah alone, without partner, and I bear witness that Muhammad is His servant and messenger.\n\nO you who believe, fear Allah as He should be feared, and do not die except as Muslims. O mankind, fear your Lord who created you from a single soul and created from it its mate, and spread from them many men and women. And fear Allah, through whom you ask one another, and respect the ties of kinship. Indeed, Allah is ever a Watcher over you. O you who believe, fear Allah and speak words of uprightness; He will correct your deeds for you and forgive you your sins. And whoever obeys Allah and His Messenger has certainly attained a great success.\n\nAfter this, in the past month of March, I called His Eminence Sheikh Nizam Ya’qubi, may Allah preserve him, wishing to publish within the meetings of the last ten nights, and he welcomed the idea—may Allah reward him well.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 4
  },
  {
    "serial_number": "3907685",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 4,
    "volume_number": 1,
    "text": "So I decided to investigate a treatise that meets the conditions for publication within the 'Meetings' series, and the choice fell on this treatise in our hands. It consists of questions directed to the author, which were originally directed to his Sheikh Al-Malakawi from the city of Tripoli, so he gave them to the author to answer. He answered them in a way that indicates vast knowledge and insight. Our treatise is by one of the Imams of the Shafi'is in the eighth Hijri century, a peer of Hafiz Ibn Hajar Al-Asqalani: Abu Muhammad Badr al-Din Al-Hasan bin the righteous Sheikh Abu Abdullah Al-Husayn Al-Aithawi Al-Biqa'i Al-Shafi'i, attributed to (Aitha), one of the villages of Bekaa (between Beirut and Damascus). He has books, including these two treatises. I did not find any mention of him in the sources available to me except what was in Khair al-Din al-Zirikli in Al-A'lam (2/189) (1). From these two treatises, it appears to me that among his sheikhs are: 1 - Abu al-Abbas Shihab al-Din Ahmad bin Rashid bin Tarkhan al-Malakawi (d. 803 AH). He died approaching seventy as Ibn al-Imad said in \"Shadharat al-Dhahab\". He is the one who gave the author the Tripolitan questions to answer. It was written at the beginning of the manuscript: (... in the months of the year seven hundred and forty). I believe the author either made a mistake when writing this date, or that",
    "foot_note": "1. Rather, he is mentioned in Tarikh Ibn Qadi Shuhbah (3/514 and 4/42), Tarikh Ibn Hajar (1/320), Inba' al-Ghumr by Al-Hafiz (2/70), and Al-Daw' al-Lami' (3/129). See Mihnat Ibn Abi al-Izz al-Hanafi by Sheikh Mashhur Hasan (p. 13) [Note by Shamela preparer: This comment is not in the printed version, but the investigator added it by pen on the margin of his copy which he sent to us, may Allah reward him with good].",
    "book_id": "297",
    "new_page_number": 5
  },
  {
    "serial_number": "3907686",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 5,
    "volume_number": 1,
    "text": "these questions came to his Sheikh in this year and then he gave them to him later, but this is unlikely to me; because Al-Malakawi, as Ibn al-Imad mentioned, died approaching seventy, meaning his birth was around the year 730 AH or slightly before. So how could questions come to him to answer from Tripoli!! Then he does not answer them until he presents them to his student Al-Aithawi after that! Therefore, I guess that this date is an error and its correct form is likely: (year seven hundred and ninety). And Allah knows best. 2 - Siraj al-Din al-Bulqini Abu Hafs Umar bin Raslan (d. 805 AH). He mentioned him in his answer to the first question in the Tajiyyah Questions, and also quoted from him here in the answers to the Tripolitan questions from his book \"Manhaj Usul al-Din\". 3 - Abd al-Wahhab bin Ahmad bin Salih al-Zuhri al-Biqa'i al-Fari al-Dimashqi al-Shafi'i (d. 820 AH). I relied in investigating his treatise on a manuscript copy in his handwriting from the Chester Beatty Library (5075/3) written by the author. It consists of 24 folios, each folio having two sides, each side having 13-14 lines in good Naskh script. The treatise consists of one hundred and fourteen questions directed to him in Fiqh and other subjects, and he answered them indicating vast knowledge of the Shafi'i school. It is worth mentioning that I did not burden the footnotes with mentioning sources of other Fiqh schools and high-level disagreements so as not to distract the reader, and also this is not the place for that.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 6
  },
  {
    "serial_number": "3907687",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 6,
    "volume_number": 1,
    "text": "I sufficed with attributing the issues to the most important Shafi'i sources. Also, regarding the Usuli (principles of jurisprudence) issues that came at the end of the treatise, I cared to mention Shafi'i Usuli sources. The treatise also contained interesting issues I did not find in others. Finally,, I seek help from the Strong, the Firm, and extend palms of supplication to the One who answers the call of the desperate, to complete it in the most complete, beneficial, and general manner, and to benefit its author, investigator, reader, and all Muslims through it, and to grant me sincerity in it for what guarantees salvation for me in the Hereafter, and success that guides me to the most correct path. I hope from Him, Glory be to Him and Exalted, help in difficult matters and easy ones, and I rely on Him and hold fast to His rope, and ask Him to protect me from error and slip, and guide me to what pleases Him of deeds. Indeed, He is the best Master and the best Helper, and He is Pardoning, Generous, Capable, and worthy of answering. Written by: Amr Abdul Azim Al-Huwaini, Abu Al-Mundhir. Egypt - Kafr El-Sheikh - Huwayn Village. Wednesday Evening, 21 Dhu al-Hijjah 1435 AH. 15 October 2014 AD.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 7
  },
  {
    "serial_number": "3907688",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 7,
    "volume_number": 1,
    "text": "Images from Manuscript Copies. Image of the Manuscript Title",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 8
  },
  {
    "serial_number": "3907689",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 8,
    "volume_number": 1,
    "text": "Image of the First Plate of the Manuscript",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 9
  },
  {
    "serial_number": "3907690",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 9,
    "volume_number": 1,
    "text": "Image of the Plate Before the Last of the Manuscript, showing the conclusion of the license record and commendation from the author's Sheikh: Sheikh Ahmad bin Rashid Al-Malakawi",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 10
  },
  {
    "serial_number": "3907691",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 10,
    "volume_number": 1,
    "text": "Image of the Last Plate of the Manuscript containing the completion of the commendation by the author's Sheikh, Sheikh Abd al-Wahhab al-Zuhri",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 11
  },
  {
    "serial_number": "3907692",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 13,
    "volume_number": 1,
    "text": "(1/verso) In the name of Allah, the Entirely Merciful, the Especially Merciful, and in Him we seek help. These are questions received in a Fatwa from the protected city of Tripoli to our master and sheikh, the Sheikh, Imam, Allamah, Shihab al-Din Al-Malakawi (1) Al-Shafi'i, Sheikh of the Shafi'is in protected Damascus, may Allah Almighty grant Islam enjoyment through his survival and bestow upon him the garments of His favors, in Jumada al-Ula of the months of the year seven hundred and forty. His high signal - may Allah Almighty elevate it - occurred to his scribe that I should answer them, so I said: Praise be to Allah, Lord of the Worlds, and may Allah send blessings upon our master Muhammad, the Seal of Prophets, and upon his family, companions, and followers, and grant abundant peace until the Day of Judgment.",
    "foot_note": "1. Shihab al-Din Abu al-Abbas Ahmad bin Rashid bin Tarkhan Al-Malakawi died mid-Ramadan year 803 AH. His biography is in Ibn Nasir al-Din's \"Al-Radd al-Wafir\" (p. 78, Islamic Office ed.), Al-Sakhawi's \"Al-Daw' al-Lami'\" (1/299), and Ibn Qadi Shuhbah's \"Tabaqat al-Shafi'iyyah\" (4/14).",
    "book_id": "297",
    "new_page_number": 12
  },
  {
    "serial_number": "3907693",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 14,
    "volume_number": 1,
    "text": "To proceed,, When the high signal came to me from our Sheikh, the Allamah Imam - may Allah Almighty magnify his worth and raise his station - to answer these mentioned questions with correct, famous answers, I answered them in compliance with his command, praying for him secretly and openly. And I said in the answer after praising Allah, the Inspirer of correctness: The questioner's inquiry included one hundred (2/recto) and fourteen questions. I mentioned each question with its answer briefly without elaboration, for brevity in Fatwa is more appropriate, limiting myself to mentioning the Madhhab relied upon in Fatwa without turning to mention disagreement, even if it is stronger according to some scholars. I might mention it in some of that to alert to the sources and bases, asking Allah Almighty for success, hoping for His kindness in every ease and distress. The First Question: Regarding a latecomer [in prayer] (Masbuq) who followed another latecomer, is his following valid or not? The Answer: If he followed him while he was following [the Imam] or doubted, his following is not valid, otherwise it is valid.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 13
  },
  {
    "serial_number": "3907694",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 15,
    "volume_number": 1,
    "text": "The Second: Regarding a man who married a free woman and stipulated that he is free, then appeared to be a slave, is his marriage valid or not? The Answer: Yes, his marriage is valid provided his master permitted him in that, and she has the option [to annul], otherwise his marriage is not valid. The Third: A free man married a woman and stipulated that she is free, then she appeared to be a slave, and he is among those for whom marrying a slave is permissible, does he have the option [to annul] or not? The Answer: If she married with her master's permission, his marriage is valid and he has the option. If she married without her master's permission, the marriage is not valid. The Fourth: (2/verso) If he impregnated her in this case and she gave birth to a child, and the master fined him the value of the child, does he have recourse for it against the one who deceived him or not? The Answer: Yes, he has recourse for it against the one who deceived him. Deception is not conceivable from her master, but rather from his agent or from her. If it was from her, the liability attaches to her dhimma (liability), so she is demanded for it after manumission.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 14
  },
  {
    "serial_number": "3907695",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 16,
    "volume_number": 1,
    "text": "The Fifth: Does he have recourse for the Mahr al-Mithl (fair dower) against the one who deceived him if he paid it and annulled the marriage? The Answer: He does not have recourse for it against him. The difference between it and the value of the child: is that he did not enter the contract on the basis of guaranteeing the children, unlike the dower; and because the dower became obligatory in exchange for what was consumed, and the fine for the consumed thing settles on the consumer. The Sixth: A man said to his wife: If you absolve me from your dower upon me, which is five dinars, then you are divorced once. She said: I absolved you from it. Does divorce occur or not? And if it occurs, does it occur as irrevocable (Ba'in) or revocable (Raj'i)? The Answer: If she absolved him immediately, the divorce occurred as irrevocable, otherwise no. The Seventh: Regarding a man who said to his wife: If you give me a thousand, you are divorced. So she placed it before him. Does divorce occur or not? And if it occurs, does it occur as irrevocable or not? The Answer: Yes, the divorce occurs as irrevocable and the thousand enters his ownership. (3/recto)",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 15
  },
  {
    "serial_number": "3907696",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 17,
    "volume_number": 1,
    "text": "The Eighth: He said to his wife: If you hand over a thousand to me, you are divorced. So she placed it before him. Does divorce occur upon him or not? The Answer: Divorce does not occur upon him until he receives it from her with his hand. The Ninth: Regarding a woman who said to her husband: If you divorce me, I have absolved you from my dower upon you. Or: Then you are free from it. Its amount is ten dinars. He said to her: I divorced you on that [condition]. Does the divorce occur as irrevocable or not? The Answer: The divorce occurs but as revocable, the husband is not absolved, and nothing is obligatory upon her for him. The Tenth: A man married a woman pregnant from adultery (Zina), is his marriage valid or not? And if valid, does he have the right to have intercourse with her before delivery or not? The Answer: Yes, his marriage is valid, and the husband may have intercourse with her even if she has not delivered, contrary to Ibn Al-Haddad where he said: He has no right to have intercourse with her until she delivers. The Eleventh: If the husband divorces her in this case before her delivery, and she is one who menstruates during pregnancy, with what does she observe 'Iddah (waiting period)? The Answer: She observes 'Iddah by menstrual cycles (Quru') from the time of divorce.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 16
  },
  {
    "serial_number": "3907697",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 18,
    "volume_number": 1,
    "text": "The Twelfth: A man had intercourse with a slave woman thinking she was his free wife, with what does she observe 'Iddah from him? The Answer: She observes 'Iddah for three menstrual cycles. The Thirteenth: If he had intercourse with a slave woman thinking she was his slave wife, does she observe 'Iddah for one cycle (3/verso) or two cycles? The Answer: She observes 'Iddah for two cycles. The Fourteenth: A man divorced his wife with a revocable divorce, then took her back, then divorced her before intercourse, does she build upon the [previous] 'Iddah or start anew? The Answer: She starts a new 'Iddah, and if she was pregnant, it ends by her delivery. The Fifteenth: If he divorced her with a revocable divorce then made Khul' with her, does she build upon the 'Iddah or start a new 'Iddah? The Answer: Yes, she builds upon the 'Iddah and starting anew is not obligatory upon her. The Sixteenth: If he divorced her with a revocable divorce then died leaving her during the 'Iddah, does she build or start a new 'Iddah of death if she was not pregnant? The Answer: She must transition to the 'Iddah of death in this case.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 17
  },
  {
    "serial_number": "3907698",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 19,
    "volume_number": 1,
    "text": "The Seventeenth: If he married a slave woman then divorced her three times, is it permissible for him to marry her by ownership of the right hand before she marries another husband or not? The Answer: He has no right to have intercourse with her by ownership of the right hand in this case. His saying in the question: \"is it permissible for him to marry her?\" should correctly be: \"is it permissible for him to have intercourse with her\", for a man does not marry (Yankihu) his slave woman in the sense of contracting marriage (Tazawwuj). The Eighteenth: If he married a slave woman then divorced her with a revocable divorce, then she was manumitted during the 'Iddah, does she observe the 'Iddah of a free woman or a slave woman? The Answer: (4/recto) She observes the 'Iddah of a free woman. The Nineteenth: The Mukatabah (slave with contract of manumission), who marries her off? The Answer: Her master marries her off with her permission. The Twentieth Question: The Muba'adah (partially freed slave), who marries her off? The Answer: Each of the owner of the part and her relative marries her off with the permission of the other. If she has no relative, then the one who freed part of her. If there is none, then the Judge with permission from the owner of the part as preceded.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 18
  },
  {
    "serial_number": "3907699",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 20,
    "volume_number": 1,
    "text": "The Twenty-First: The Waqf (endowed) slave woman, who marries her off? The Answer: The Judge marries her off with the permission of the beneficiary if there is... The Twenty-Second: The slave woman of a minor girl (1), who marries her off if she has no father or grandfather? The Answer: She is not married off in this case.",
    "foot_note": "1. The slave woman of a young female.",
    "book_id": "297",
    "new_page_number": 19
  },
  {
    "serial_number": "3907700",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 21,
    "volume_number": 1,
    "text": "The Twenty-Third: The slave woman of a minor Thayyib (non-virgin) girl (1), who marries her off if there is no father or grandfather? The Answer: She is also not married off in this case. Even if she had a father or grandfather, he does not marry her off; because her mistress in this case does not have [the authority] to marry her off, so likewise her slave woman. The Twenty-Fourth: A man said to his wife: If you menstruate, you are divorced. She said: I menstruated. He denied her, so she brought evidence witnessing to that. Does divorce occur or not? And if divorce does not occur, how can its occurrence be achieved? The Answer: Divorce occurs even if (4/verso) the husband denies her; because her menstruation is not known except from her side. If this is so, there is no need to answer what the questioner branched off. The Twenty-Fifth: Is the testimony of women accepted in Waqf or not? The Answer: If they are purely women (2), their testimony is not accepted. If they witness, or two of them, with a man according to its condition, it is accepted.",
    "foot_note": "1. Meaning the slave woman of a young female. \n2. Meaning testimony of women only without men with them.",
    "book_id": "297",
    "new_page_number": 20
  },
  {
    "serial_number": "3907701",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 22,
    "volume_number": 1,
    "text": "The Twenty-Sixth: The testimony of women also regarding a man that he bequeathed money to an apostate, is it accepted or not? The Answer: In this question, it is like the one before it. The Twenty-Seventh: The testimony of women against a thief that he stole so-and-so's wealth from a secure place (Hirz), is the wealth established by it but amputation (Hadd) is not established or not? The Answer: If women are exclusive in that, neither amputation nor wealth is established for it. If they witness, or two with a man according to his condition as preceded, the wealth is established but amputation is not established. The Twenty-Eighth: The guardian over wealth, is it permissible for him to marry off what is considered wealth [slave] or not? The Answer: It is not permissible for the guardian to marry off the minor's slave woman nor his slave man because he only manages his affair regarding wealth. As for managing his affair regarding his marriage and the marriage of his slave woman, it is specific to the father and grandfather. (5/recto)",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 21
  },
  {
    "serial_number": "3907702",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 23,
    "volume_number": 1,
    "text": "The Twenty-Ninth: A woman was present and she has a grandfather who freed her and a brother of who freed her, so which of them marries her off? The Answer: The brother of who freed her marries her off; because he takes precedence over the grandfather in inheritance, so likewise in the aspects of guardianship. The Thirtieth Question: The blind man, is it permissible for him to be a guardian (Wali) in marriage or not? The Answer: Yes, that is permissible. The Thirty-First: The blind man also, is it permissible for him to be an agent (Wakil) in buying and selling or not? The Answer: Yes, it is permissible if he is appointed to sell something or buy it, and he had seen it before blindness and he [recalls] at the time of sale or purchase mentioning its attributes considered in Sharia, and it was something that does not change, otherwise his appointment is not valid.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 22
  },
  {
    "serial_number": "3907703",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 24,
    "volume_number": 1,
    "text": "The Thirty-Second: Regarding the blind man also, is it permissible for him to be an executor (Wasi) or not? The Answer: Yes, that is permissible. The Thirty-Third: Regarding the blind woman, is it permissible for her to be a custodian (Hadinah) or not? The Answer: This question is not mentioned in Al-Rafi'i nor in Al-Rawdah in the chapter of Custody, but what appears is that it is not permissible. Its evidence is what Al-Rafi'i said in his Sharh in the Book of Hire (Ijarah) that it is not permissible to hire a blind person for guarding, and there is no doubt that (5/verso) guarding is part of custody.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 23
  },
  {
    "serial_number": "3907704",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 25,
    "volume_number": 1,
    "text": "The Thirty-Fourth: If the mother wants to breastfeed the child for a wage, and the father finds a volunteer, is [the child] taken from the mother and handed to the volunteer? The Answer: Al-Rafi'i said in [the chapter of] Breastfeeding what means that the father's request is granted in this case. The Thirty-Fifth: A man said to his wife: If you enter the house, you are divorced. Then he said: You entered. He denied her [claim], so is the saying his saying or her saying? And if women testify that she entered the house, is that established or not? And if established, does divorce occur or not? The Answer: The saying is his saying with his oath. Entry is not established by the mere testimony of women only. If not established, divorce does not occur. The Thirty-Sixth: If he said: If you enter the house of your uncle Amr, you are divorced. She entered it when it had become Zaid's property or became a bathhouse, does divorce occur or not? The Answer: Divorce does not occur if it became a bathhouse absolutely due to the removal of the name. As for if it transferred from Amr to another while remaining in its form, it is either (6/recto) the swearer intended it at the time of his oath, or intended indicating it or not. If he indicated it or intended indicating it, divorce occurred ... for indication, otherwise it does not occur.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 24
  },
  {
    "serial_number": "3907705",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 26,
    "volume_number": 1,
    "text": "The Thirty-Seventh: A man borrowed a mare to carry a known thing on it to a known place, and the mare perished by use within the permitted extent, does the borrower guarantee it or not? The Answer: He does not guarantee it in this case. The Thirty-Eighth: Regarding a man who paid in advance (Salam) to another a mare for a known thing until a known term, then the mare became pregnant while with the recipient of advance payment (Muslam ilayh) and gave birth to offspring, then the subject of Salam became unavailable at the due time, so the payer of advance payment (Muslim) took back his capital. Does he take back its separated increases with it or not? The Answer: He does not take back the separated increases because of their occurrence while in the ownership of the recipient of advance payment. The Thirty-Ninth: If he found a lost item (Luqatah) and announced it for a year then possessed it, and it gave birth to offspring with him, and its owner came after that, does he take it and the separated increases or take it alone? The Answer: If it became pregnant and gave birth after his possession of it by way [of finding], he has no",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 25
  },
  {
    "serial_number": "3907706",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 27,
    "volume_number": 1,
    "text": "right to take back the separated increases due to their occurrence in his ownership, otherwise he has (6/verso) the right to take it back with its increases. The Fortieth Question: If he transferred ownership of a mare to his son and it gave birth to offspring with him, then the father took back the pawned item [gift], does he take it back with its separated increases or take it back alone? The Answer: If the pregnancy and birth occurred in the son's ownership, the father has no right to take back the separated increases, otherwise he has the right to take them back. The Forty-First: If he sold a mare to a person for a price until a known term, then the mare gave birth to offspring before the price was due, then the buyer went bankrupt and the seller took back the mare, does he take back the mentioned increases or not? The Answer in it is like the question before it. The Forty-Second: If a man usurped a mare from a person, then it gave birth to offspring with the usurper, then the usurped-from took it back, does he take it with its increases and benefits or take it alone? And if it fattened then became lean and he took it while lean, does he [usurper] guarantee the fatness or not? The Answer: Yes, he takes it with its increases and benefits, and the usurper guarantees the compensation for part of the item due to the lost fatness by its way (7/recto)",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 26
  },
  {
    "serial_number": "3907707",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 28,
    "volume_number": 1,
    "text": "The Forty-Third: A man bequeathed the benefits of a slave to a man, so upon whom is the slave's maintenance? The Answer: His maintenance is upon the owner of the neck (slave himself). The Forty-Fourth: If the owner of the neck wants to sell him to other than the legatee, is the sale valid or not? The Answer: If he bequeathed his benefit to him for a period, his sale is like the sale of rented property, and the Madhhab is its validity. If he bequeathed it forever, his sale is not valid except to the legatee. The Forty-Fifth: A man had intercourse with a married woman by mistake (Shubha) and she observed 'Iddah from him. Is the maintenance of the 'Iddah from him upon her husband or upon the one who had intercourse by mistake, or does she have no maintenance upon either of them? The Answer: There is no maintenance upon the husband due to lack of availability (Tamkin), nor upon the one who had intercourse if she did not become pregnant from his intercourse definitely, and likewise if she became pregnant according to the more correct view. The Forty-Sixth: He divorced his wife while she was pregnant by him, is maintenance obligatory for her or for the pregnancy? And is clothing obligatory for her following maintenance or not? The Answer: Maintenance and clothing are obligatory for the pregnant woman, not for the pregnancy, and for that reason they were not obligatory for a pregnant woman from intercourse by mistake.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 27
  },
  {
    "serial_number": "3907708",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 29,
    "volume_number": 1,
    "text": "The Forty-Seventh: (7/verso) If he sold green fodder (Qasil) on condition of cutting, and it grew again (Khilfah) after cutting it, does the regrowth belong to the seller or the buyer? The Answer: The regrowth belongs to the seller because the roots of the fodder did not enter into the sale, as in the tree if sold on condition of cutting, its roots do not enter. The Forty-Eighth: If he bought a tree and a wind blew and uprooted it, then after that it grew regrowth, does the regrowth belong to the seller or the buyer? The Answer: If the seller did not stipulate cutting on the buyer, the regrowth belongs to the buyer following the roots as they entered his ownership. If he stipulated cutting on him, it belongs to the seller as preceded in the fodder. The Forty-Ninth: If he sold a flock (Daffa) of tower pigeons while they are flying, is the sale valid or not? The Answer: The sale is not valid in this case. The Fiftieth Question: If he sold some bees while they are absent, is the sale valid or not? The Answer: The sale is valid on condition of seeing them before that by the seller and buyer, otherwise it is a sale of absent and unknown. The Fifty-First: If he sold a usurped slave to someone capable of retrieving him at the time of sale, then the buyer became unable (8/recto) to retrieve him after that, does he have the option and taking the price from the seller or not? The Answer: Yes, the option is established for him. If he chooses annulment, he returns to the seller for the price he paid him.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 28
  },
  {
    "serial_number": "3907709",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 30,
    "volume_number": 1,
    "text": "The Fifty-Second: If he made Salam (advance payment) in silk and there are worms in it, is the subject of Salam valid or not? The Answer: Salam in it is not valid. The Fifty-Third: If he made Salam in something in which Salam is valid and left it absolute (without specifying time), does it convene immediately or not? The Answer: Yes, it convenes immediately. The Fifty-Fourth: If he made Salam for a camel in the herd (Arin) until a known term, then the subject of Salam became unavailable at the due time and he chose annulment, and the capital was a thousand, does he take back its like or its value? And if he takes back its value, does he take back its value on the day of its delivery in the contract session or the value on the day of unavailability (Talaf)? The Answer: He takes back its value because it is evaluated (Mutaqawwam), and it is the value on the day of possession as in dower and advancing Zakat and others similar to them. The Fifty-Fifth: A man bought a mare from a man until a known term, then he sold it to another man for a received price, then he bought it (8/verso) from him for a known price until a known term, then both prices became due and the buyer went bankrupt. Does the first seller have priority in taking the mare or the second seller? The Answer: The right of the second seller attaches to the mare, so he has priority over the first, based on [the principle] that 'the returning ceased [ownership] is like that which did not return'. It is a well-known rule",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 29
  },
  {
    "serial_number": "3907710",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 31,
    "volume_number": 1,
    "text": "in Fiqh, and what we said has been preferred in this chapter as well as in Gift (Hibah). As for returning due to defect and in the chapter of Dower, it has been preferred that it is like that which did not cease. I say: The requirement of Fiqh is that the chapter of Bankruptcy should be likewise, because they only differentiated between Dower and Gift because returning in Gift is specific to the item itself, so let it be specific to the ownership obtained from the giver. As for Sale and Dower, returning in them extends to the substitute, and there is no doubt that Bankruptcy is from this chapter, known by contemplation. The Fifty-Sixth: A man rented out his slave for a known period then manumitted him during the period, is the lease annulled or not? And if not annulled, is the maintenance of the freed slave for the rest of the period upon his master or from the Public Treasury (Bayt al-Mal)? The Answer: The lease is not annulled, and his maintenance is from the Public Treasury. The Fifty-Seventh: (9/recto) A man died and left three separated sisters (from different parents) and a grandfather. From how much is the issue valid and who inherits from the mentioned heirs? The Answer: The issue is from four: for the grandfather two shares, and for the full sister two shares, and it returns ........... to two shares: for the grandfather two shares, and for the full",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 30
  },
  {
    "serial_number": "3907711",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 32,
    "volume_number": 1,
    "text": "sister two shares. Nothing for the uterine sister because she is blocked by the grandfather, and likewise nothing for the paternal sister. The Fifty-Eighth: Regarding a woman who died and left a paternal grandfather, a full sister, and a paternal brother, how is it divided? The Answer: The issue is valid from ten: for the grandfather four shares, for the full sister five shares, and for the paternal brother one share. The Fifty-Ninth: A man died and left a paternal grandmother, two full sisters, and a paternal brother. From how much is the issue divided and who inherits from the heirs? The Answer: The issue is from six: The grandmother has one-sixth (one share), the two sisters have two-thirds (four shares), and for the brother is what remains which is one share. The Sixtieth Question: A man died and left a paternal grandmother, two full sisters, a paternal brother and a paternal sister. From how much is the issue valid? The Answer: The issue is valid from eighteen: for the grandmother one-sixth (three shares), for the two full sisters two-thirds (twelve shares), and for the brother (9/verso) and sister from the father what remains which is three shares: for the male two shares and for the female one share. The Sixty-First: A man died and left a paternal grandmother, a full sister, a paternal brother and a paternal sister. From how much is the issue valid? The Answer: The issue is valid from eighteen shares also. The grandmother one-sixth: one multiplied by three equals three. For the full sister one-half: three multiplied by three equals nine. For the brother and sister from the father what remains which is two multiplied by three equals six: for the male four and for the female two.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 31
  },
  {
    "serial_number": "3907712",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 33,
    "volume_number": 1,
    "text": "The Sixty-Second: A man died and left a paternal grandmother, a full sister, and two paternal sisters. From how much is the issue valid? The Answer: The issue is valid from twelve. For the grandmother one-sixth (two shares), for the full sister one-half (six shares), and for the paternal sister one-sixth (two shares) completing the two-thirds. Two shares remain for the agnate if there is one; otherwise to the Public Treasury. The Sixty-Third: A man died and left a paternal grandmother, a wife, two full sisters, and a mother. From how much is the issue valid? The Answer: It is valid from thirteen by 'Awl (increase). For the wife one-quarter increased to three shares, for the two full sisters two-thirds (eight shares), for the mother one-sixth (two shares). Nothing for the grandmother; because she is blocked by the mother. (10/recto) The Sixty-Fourth: A woman died and left a husband, two daughters, a mother, a maternal grandfather, and a full brother and sister. From how much is the issue valid? The Answer: It is valid by 'Awl from fifteen. For the husband one-quarter (three), for the two daughters two-thirds (eight), for the mother one-sixth (two shares), for the grandfather two shares which is one-sixth. Nothing for the brother and sister. The Sixty-Fifth: A woman died and left a husband, a grandmother, two uterine brothers, and a full brother. How is the estate divided? The Answer: The issue is from six. For the husband one-half (three), for the grandmother one-sixth (one share), for the two uterine brothers one-third (two shares) in which the full brother shares with them. This is known as Al-Mushtarakah and Al-Himariyyah.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 32
  },
  {
    "serial_number": "3907713",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 34,
    "volume_number": 1,
    "text": "The Sixty-Sixth: A man (did not) (1) perform the Hajj of Islam from his capital with a known amount, then died owing debts that consume his wealth. Is the Hajj of Islam prioritized over debts, or debts over it, or is it divided between them? The Answer: I did not find in Al-Rafi'i nor in Al-Rawdah a text on the issue. What appears is that debt is prioritized because it is a human right and Hajj is Allah's right, which is built on tolerance and forgiveness, unlike human debt which is built on dispute and strictness. This is one of the opinions in Zakat if (10/verso) it combines with debt, even though Zakat contains two rights: a human right and Allah's right (2) [Then I saw in the Fatwas of our Sheikh, Sheikh al-Islam Al-Bulqini, what reads: A man died owing the Hajj of Islam and left five hundred dirhams and a debt that consumes it, is the Hajj of Islam or the debt prioritized? He answered: Hajj of Islam is prioritized, and what is prioritized is a wage considered from the Miqat not from his country, and someone is hired with it to perform Hajj on his behalf from the Miqat. End. Then I saw in Al-Tamhid by Al-Isnawi in discussing when two analogies conflict, each indicating by suitability the prioritization of an interest, one related to religion and the second related to the world, and he mentioned branches for it until he said: And among them is if debt and Hajj combine, which of them is prioritized? These opinions refer to the three known opinions in Zakat if it combines with a human debt",
    "foot_note": "1. Thus in the original. \n2. From here is appended in the margin in the author's own handwriting.",
    "book_id": "297",
    "new_page_number": 33
  },
  {
    "serial_number": "3907714",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 35,
    "volume_number": 1,
    "text": "He said - I mean Al-Isnawi -: Ibn al-Raf'ah and others narrated it, and the implication of that is that the preferable view is prioritizing Hajj as gave Fatwa ............. (1) problematic] The Sixty-Seventh: If Zakat and human debt accumulated against him then he died, is Zakat or human debt prioritized? The Answer: Zakat is prioritized. And it is said: Debt. And it is said: They are equal. The Sixty-Eighth: If one of the women absolved her husband from her dower, which is ten dinars, during death sickness, is the absolution valid from the third? And if valid, is it a bequest to an heir or not? The Answer: Yes, it is a bequest to an heir, so it requires the approval of the rest of the heirs whether it is taken from the third or not. The Sixty-Ninth: A Muslim man bequeathed that a third of his wealth be spent on the poor and needy in such city and left it absolute. Do the poor and needy of Ahl al-Dhimmah enter [in it] or not? The Answer: I did not find in the issue a specific text in Al-Rafi'i and Al-Rawdah; but what appears in the answer is that they do not enter; because the intent usually from bequest especially for the poor is closeness to Allah (Qurbah), and the Dhimmi is not eligible for drawing close by bequest to him. And because 'the poor' if used absolutely in bequest or Waqf and the like, nothing comes to mind except the poor Muslims.",
    "foot_note": "1. Erased due to photography.",
    "book_id": "297",
    "new_page_number": 34
  },
  {
    "serial_number": "3907715",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 36,
    "volume_number": 1,
    "text": "The Seventieth Question: If he made Waqf for his Christian children, is the Waqf valid or not? The Answer: Yes, it is valid if the children for whom he made Waqf are Dhimmis (11/recto) otherwise no. The Seventy-First: If a partner in Waqf sold his share, does the beneficiary of Waqf have the right of pre-emption (Shuf'ah) or not? The Answer: He has no right of pre-emption in this case. The Seventy-Second: Does pre-emption apply to trees standing on monopoly (Muhtakarah) or tax (Kharajiyyah) land? The Answer: Pre-emption is only established in owned land if sold. If it is sold with building and trees and they entered into the sale, pre-emption is established in them consequentially. As for if the building and trees are sold alone, there is no pre-emption in them. The Seventy-Third: A man has two debts against another, one with a pledge (Rahn) and the other without a pledge. If he took the two debts or part of them and said: I paid it for the pledge debt. And the creditor said: Rather for the other. Whose saying is accepted? The Answer: The saying is the saying of the payer. If he did not intend anything at the time of payment, he has the right to assign it to whichever he wishes. And it is said: It is distributed proportionally. The Seventy-Fourth: A man borrowed an item to pawn it for a debt, does the lender become a guarantor for the borrower regarding the debt or not? And if he becomes a guarantor and the pawnbroker sold the pawned item, does the lender have recourse against the borrower for what it was sold for",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 35
  },
  {
    "serial_number": "3907716",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 37,
    "volume_number": 1,
    "text": "or not? And if it perished in the hand of the pawnbroker without negligence, does the lender have recourse against the borrower for anything or not? (11/verso) The Answer: The lender himself does not become a guarantor for the debt by merely that, meaning that the creditor demands him for it. Rather, this is a guarantee of debt in the neck of that pawned item. If the pawned item is sold by its way, the lender has recourse against the borrower for what it was sold for. If it perishes in the hand of the pawnbroker without negligence, there is no guarantee. The Seventy-Fifth: A man said to a man: Do you have a wife? He said: No. Does divorce occur upon him or not? The Answer: This wording is a kinaya (metonymy). If he intended divorce by it, it occurs, otherwise no. The Seventy-Sixth: A man was told: Did you divorce your wife? He said: Yes. Does divorce occur upon him or not? The Answer: This wording is an acknowledgement of divorce. If he lied, she is his wife inwardly. If he said: I meant a past [divorce] and I took her back, he is believed. If that was said to him soliciting ..... and he said: Yes, it is explicit. And it is said: Kinaya. The Seventy-Seventh: A man said to another: I am swearing by divorce that so-and-so female does not enter my house. And he had not sworn, but only informed of that so the woman would be deterred from entering. Then she entered. Does divorce occur upon him or not? The Answer: Divorce does not occur upon him inwardly merely by that, but he is held accountable (12/recto) for it outwardly until separation is made between him and his wife.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 36
  },
  {
    "serial_number": "3907717",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 38,
    "volume_number": 1,
    "text": "The Seventy-Eighth: A man said: Divorce is binding upon me as long as I do not enter so-and-so's house. Then he entered, does divorce occur upon him or not? The Answer: Yes, his divorce occurs if he was intentional in entering, remembering, and choosing. The Seventy-Ninth: A man said: Divorce is binding upon me. Does divorce occur upon him or not? The Answer: Yes, divorce occurs upon him. The Eightieth Question: A man proposed to a woman and she said to him: I will not marry you until you divorce your wives (1). So he said to her: I divorced. And he did not intend any one of them. Does divorce occur upon him or not? The Answer: If he intended adding it to all of them, one divorce occurred on each one. If he intended adding it to a specific one of them, it occurred on her alone. Or one ambiguous one, one of them is divorced and he must specify. If he did not intend adding the divorce to one of them, nothing occurs; because the word: 'I divorced', does not effect divorce except by addition to the wife verbally or by intention. Unless it is said in this place that addition is not needed because it occurred in answer ................ so it is explicit by itself as preceded in his saying Yes.",
    "foot_note": "1. Here in the original is an appendage on the margin of the page, some of which is unreadable due to photography.",
    "book_id": "297",
    "new_page_number": 37
  },
  {
    "serial_number": "3907718",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 39,
    "volume_number": 1,
    "text": "The Eighty-First: A man said to his wife: Whenever you give birth (12/verso) to a child, you are divorced. So she gave birth to two children. How many times is she divorced and with what does she observe 'Iddah? And if she gave birth to three children, how many times is she divorced and when does her 'Iddah end? And if she gave birth to four, how many times is she divorced and at what time does her 'Iddah end? (1) The Answer: If the children are from one pregnancy, if she gave birth to two children sequentially, she is divorced by the first one time and her 'Iddah ends by the second, and a second [divorce] does not occur by him due to the expiration of her 'Iddah by him. If she gave birth to three sequentially, she is divorced by the first two twice and her 'Iddah ends by the third and a third [divorce] does not occur by him due to what preceded. If she gave birth to four sequentially, she is divorced by the first three thrice and her 'Iddah ends by the fourth. The Eighty-Second: If he said: If you give birth to a male you are divorced once, or you give birth to a female you are divorced twice. So she gave birth to both. How many times is she divorced? And how is the detail? If we detail, and she gave birth to the male first then the female, how many times is she divorced? And when does her 'Iddah end? And if she gave birth to the female first then the male, how many times is she divorced? And when does her 'Iddah end?",
    "foot_note": "1. Al-Umm by Al-Shafi'i (5/222 Al-Ma'rifah ed), Mukhtasar Al-Muzani (8/298 Al-Ma'rifah ed), Al-Hawi Al-Kabir by Al-Mawardi (10/613 Al-Fikr ed), Al-Majmu' by Al-Nawawi (17/178 Al-Fikr ed), Rawdat Al-Talibin (8/142 Al-Maktab Al-Islami ed), and Hashiyat Al-Abbadi on Al-Ghurar Al-Bahiyyah by Al-Nawawi (4/293 Al-Maymaniyyah ed)",
    "book_id": "297",
    "new_page_number": 38
  },
  {
    "serial_number": "3907719",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 40,
    "volume_number": 1,
    "text": "And if she gave birth to them at once, how many times is she divorced? And when does her 'Iddah end? And if she gave birth to a male or two females, what is the ruling in that? And when is she divorced? And if the matter needs detailing, and she gave birth to the male first then the female then the other, how many times is she divorced? And at what time does she observe 'Iddah? And if she gave birth to the female first then the male then the female, how many times is she divorced (13/recto) and at what time does she observe 'Iddah? And if she gave birth to the female then the female then the male, how many times is she divorced? And with what does she observe 'Iddah? The Answer: If she gave birth to them together, she is divorced thrice and observes 'Iddah by menstrual cycles. If she gave birth to the male then the female, she is divorced once by the male and her 'Iddah remains by the female and a second [divorce] does not occur by her as preceded. If she gave birth to the female first, she is divorced twice and her 'Iddah ends by the other. This is the ruling if she gave birth to a male or female only. As for if she gave birth to a male or two females, if she gave birth to them together, she is divorced thrice and observes 'Iddah by menstrual cycles. If she gave birth to the male first then the two females, it is either she gives birth to them, meaning the two females, twice [sequentially] or together. If she gave birth to them twice, she is divorced by the male once and by the first female twice and her 'Iddah ends by the other female. If she gave birth to them together, only one divorce by the male occurs and her 'Iddah ends by the two females. If she gave birth to one of the two females first then the male then the other female, she is divorced by the first female twice and by the male once and her 'Iddah ends by the other female. If she gave birth to the male and the other female together in this case, she is divorced twice by the first female and her 'Iddah remains by the male and female whom she gave birth to together.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 39
  },
  {
    "serial_number": "3907720",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 41,
    "volume_number": 1,
    "text": "The Eighty-Third (13/verso): A man said to his wife: Whenever I swear by your divorce, you are divorced. Does divorce occur upon him immediately or not? The Answer: Divorce does not occur upon him immediately; because the condition was not found, which is swearing by her divorce after the suspension. The Eighty-Fourth: A man said to his wife: If Zaid arrives, you are divorced a month before his arrival. He arrived before a month passed, is she divorced or not? And if he arrived after a month, is she divorced or not? The Answer: If he arrived before a month passed, she is not divorced and the oath is dissolved. If he arrived after a month passed - meaning from the time of his pronouncing divorce - then she is divorced, and it becomes clear that her divorce occurred a month before his arrival. The Eighty-Fifth: A man said to his wife: If I do not divorce you today, you are divorced today. The day passed and he did not divorce her, is she divorced or not?",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 40
  },
  {
    "serial_number": "3907721",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 42,
    "volume_number": 1,
    "text": "The Answer: Yes, she is divorced; because he suspended the occurrence of her divorce on his not divorcing her, and it did not happen. And on the estimation that if the suspended-upon condition happened, she would also be divorced, but the cause of occurrence is different. The Eighty-Sixth: When was prayer made obligatory, and in which place was it made obligatory? The Answer: It was made obligatory on the Night of Isra' in Mecca, may Allah Almighty honor it, ten years and three (14/recto) months after Prophethood, on the night of the twenty-seventh of Rajab. The Eighty-Seventh: When was fasting made obligatory? The Answer: It was made obligatory two years after the Hijra. The Eighty-Eighth: Was Zakat made obligatory before fasting or after it? The Answer: There is disagreement in this issue. The two Sheikhs, Al-Rafi'i and Al-Nawawi, may Allah have mercy on them, did not prefer anything regarding that.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 41
  },
  {
    "serial_number": "3907722",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 43,
    "volume_number": 1,
    "text": "The Eighty-Ninth: Was Hajj made obligatory in the year five, six, or nine? The Answer: It was made obligatory in the year six according to what is preferred in Al-Rafi'i and Al-Rawdah. It is said: Year five. And it is said: Nine. The Ninetieth Question: At what time did the Messenger of Allah, peace and blessings be upon him, build his mosque? And when was Adhan legislated? The Answer: He built it in the first year after Hijra, and in it Adhan was legislated. The Ninety-First: At what time was the Qibla changed to the Kaaba? And in which prayer of the five? And on which day and which month? The Answer: It was changed in the second year of Hijra, in the Zuhr prayer, on Tuesday, mid-Sha'ban, in the Mosque of the Two Qiblas, while the Prophet, peace and blessings be upon him, was rising from the second [Rak'ah], having prayed the first two Rak'ahs towards Jerusalem. The Ninety-Second: At what time was Sadaqat al-Fitr made obligatory? The Answer: It was made obligatory in the second year of Hijra?",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 42
  },
  {
    "serial_number": "3907723",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 44,
    "volume_number": 1,
    "text": "The Ninety-Third: Two men appointed a man to judge between them in something (14/verso). He judged between them and obligated one of them with the judgment against him. Is it binding on him or not? And does he have the right to judge while there is a judge in the city or not? And does he have the right to judge in marriage, retribution (Qisas), and punishment for slander (Hadd al-Qadhf) or not? The Answer: If they appointed him and were satisfied with him and continued on that until he judged against one of them with a judgment, and he has the competence for judiciary, his judgment is executed whether there is a judge in the town or not. He has the right to judge between them in marriage, retribution, and punishment for slander. The Ninety-Fourth: A man hit a man and knocked out all his teeth. Does he owe Diya (blood money) or more than a Diya? The Answer: He owes five camels for each tooth by a method whatever it reaches. The Ninety-Fifth: A man acknowledged that he owes a debt to another amounting to a thousand dirhams, then on the date of acknowledgment he also acknowledged to him five hundred dirhams. Does he owe the total or only the thousand? The Answer: If he attributed them to two different things or described them with two different descriptions or said I received early in the day for example a thousand dirhams and at noon five hundred dirhams, he owes the total; otherwise he owes only the thousand. The Ninety-Sixth: A man acknowledged that he divorced his wife a period preceding the day of acknowledgment by a month. Does the divorce take effect from the time (15/recto) of acknowledgment or from a month before it? The Answer: It is judged that divorce occurred a month before his acknowledgment holding him accountable by the ruling of this acknowledgment, but his acknowledgment does not extend to dropping the right",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 43
  },
  {
    "serial_number": "3907724",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 45,
    "volume_number": 1,
    "text": "of the wife regarding maintenance, clothing and others for the mentioned period which is the month before acknowledgment. The Ninety-Seventh: A man pawned with another a skin of sugar cane as a returned pawn. Then the pawner planted the mentioned skin and occupied a yield from it. Is the yield pawned or not? The Answer: Increases of the pawned item like fruit and offspring do not become pawned, rather if that was stipulated in the contract, the condition and contract are invalid. The Ninety-Eighth: His prayer, peace and blessings be upon him, towards Jerusalem, was it by revelation or by Ijtihad? The Answer: It was by revelation decisively; the disagreement is only whether it was by Sunnah or the Book? What appears is that it was by the Book based on the evidence of His saying Almighty \"And We did not make the Qibla which you were on... The Verse\". The Ninety-Ninth: Fasting Ashura, was it by revelation or Ijtihad? The Answer: No text on the issue is present with me now; but it can be said that it was by Ijtihad. Its evidence is what Ahmad, Al-Bukhari and Muslim narrated from Ibn Abbas, may Allah be pleased with them both, who said: The Messenger of Allah, peace (15/verso) and blessings be upon him, arrived and saw the Jews",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 44
  },
  {
    "serial_number": "3907725",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 46,
    "volume_number": 1,
    "text": "fasting Ashura. He said: What is this? They said: A righteous day in which Allah saved Moses and the Children of Israel from their enemy, so Moses fasted it. He said: I am more entitled to Moses than you, and commanded fasting it. The point of evidence: That he arranged the command to fast it on this question, so it indicated that he did not wait for revelation regarding it, noting that some people of knowledge said it was not obligatory at all. It is not hidden that this is based on the opinion of the permissibility of his Ijtihad, peace and blessings be upon him. The One Hundredth Question: Was his clarification, peace and blessings be upon him, of the amounts of Zakat by revelation or Ijtihad? The Answer: No text is present with me now regarding it either; but it can be said that it was by revelation. Its evidence is what Ahmad, Al-Bukhari, Al-Nasa'i, Abu Dawud and Al-Daraqutni narrated from Anas, may Allah be pleased with him, that Abu Bakr Al-Siddiq, may Allah be pleased with him, wrote to them that these are the obligations of charity which the Messenger of Allah, peace and blessings be upon him, imposed on Muslims, which Allah commanded His Messenger with. So whoever is asked for it from the Muslims in its proper way, let him give it, and whoever is asked for more than that, let him not give it. Regarding what is less than twenty-five camels, regarding sheep, for every five camels one sheep. And if it reaches twenty-five, there is a bint makhad (one-year-old she-camel) up to thirty-five... The Hadith. The point of evidence: Abu Bakr's saying, may Allah be pleased with him: Which Allah commanded (16/recto)",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 45
  },
  {
    "serial_number": "3907726",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 47,
    "volume_number": 1,
    "text": "His Messenger with. If it is said: It is possible that [Allah's command with it] (1) to him, peace and blessings be upon him, returns to the origin of charity only, for it is obligatory by His saying Almighty \"Take from their wealth a charity\" The Verse. I say: Its detailing after that as preceded implies that he is commanded with all of that. The One Hundred and First: His saying, peace and blessings be upon him, regarding the captives of Awtas: A pregnant woman is not to be had intercourse with until she gives birth, nor a non-pregnant until she menstruates. Was it by revelation or by Ijtihad? The Answer: No text is present with me now regarding the issue either; but it is possible to say that it was by revelation. Its evidence is what Hafiz Zaki al-Din Abd al-Azim Abu Muhammad Al-Mundhiri said in his summary of Sunan Al-Hafiz Abu Dawud Suleiman bin Al-Ash'ath Al-Sijistani: Chapter on having intercourse with captives, from Abu Sa'id Al-Khudri, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, sent an expedition on the day of Hunayn to Awtas. They met their enemy and fought them and overcame them and captured captives for them. Some people from the companions of the Messenger of Allah, peace and blessings be upon him, felt reluctant to have intercourse with them because of their husbands among the polytheists. So Allah Almighty revealed: And [also prohibited to you are all] married women except those your right hands possess. Meaning they are lawful for them when their 'Iddah ends. Muslim, Al-Tirmidhi and Al-Nasa'i narrated it. Then he said - meaning Al-Mundhiri -",
    "foot_note": "1. Smudged due to poor photography, and perhaps what I established is correct.",
    "book_id": "297",
    "new_page_number": 46
  },
  {
    "serial_number": "3907727",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 48,
    "volume_number": 1,
    "text": "from Abu Sa'id Al-Khudri may Allah (16/verso) be pleased with him, and raised it that he said regarding the captives of Awtas: A pregnant woman is not to be had intercourse with until she gives birth, nor a non-pregnant until she menstruates one cycle. The point of evidence: The revelation of the verse after the reluctance of the companions of the Messenger of Allah, peace and blessings be upon him. If it is said: This verse is general and does not contain clarification of the period of Istibra' (establishing non-pregnancy), nor did it indicate its obligation, but rather indicated the permissibility of intercourse with what the right hand possesses. I say: I concede that it is general; but the clarification of the Messenger, peace and blessings be upon him, for it is by revelation based on the evidence of His saying Almighty \"And We revealed to you the Reminder that you may make clear to the people what was sent down to them\" The Verse. The One Hundred and Second: Is it permissible to abrogate the Sunnah by the Book, and the Book by the Sunnah or not? The Answer: Yes, the majority are for the permissibility of abrogating the Sunnah by the Book absolutely and abrogating the Book by the Mutawatir Sunnah. The issue has branches and examples; this Fatwa is not the place to elaborate on them.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 47
  },
  {
    "serial_number": "3907728",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 49,
    "volume_number": 1,
    "text": "The One Hundred and Third: Is it permissible to abrogate without a replacement, and with something heavier, and what is its example? The Answer: Al-Amidi said in \"Muntaha Al-Sul\": The majority agreed on the permissibility of abrogation not to a replacement and the minority prevented it. Until he said: Those who say abrogation is permissible agreed on the permissibility of abrogating a ruling to a similar or lighter replacement, and differed regarding the heavier. The doctrine of most of our companions, theologians and jurists is its permissibility, and some Shafi'is prevented (17/recto) it. End. Al-Baydawi said: Abrogation is permissible without a replacement and with a heavier replacement. He exemplified the first by the fact that offering charity before private consultation with the Messenger, peace and blessings be upon him, was obligatory then abrogated without a replacement. And he exemplified the second by the fact that withholding from expiation was obligatory then abrogated by the obligation of fighting, and there is no doubt that fighting is harder and heavier than withholding. The One Hundred and Fourth: Is it permissible to specify the Sunnah by the Sunnah or not? The Answer: Yes, that is permissible.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 48
  },
  {
    "serial_number": "3907729",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 50,
    "volume_number": 1,
    "text": "The One Hundred and Fifth: What is the difference between Abrogation (Naskh) and Specification (Takhsis)? The Answer: Al-Baydawi said: Specification is in part, and abrogation may be regarding the whole. I heard our Sheikh ......... say: Specification is only before action, and abrogation may be after action, and may be before it as well, contrary to the Mu'tazila where they said: Abrogation is not permissible before action. Al-Amidi said: The locus of disagreement is before the time elapses, as for after it, it is permissible absolutely without disagreement. The One Hundred and Sixth: Is the Original (Asl) prioritized over the Apparent (Zahir)? The Answer: Yes, the Original is prioritized over the Apparent if the Apparent is not supported by something. If it is supported by something, it is prioritized over the Original. Examples of that are many; this Fatwa is not the place to mention them. The One Hundred and Seventh: Is Analogy (Qiyas) prioritized over (17/verso) the Solitary Report (Khabar al-Wahid) or not?",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 49
  },
  {
    "serial_number": "3907730",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 51,
    "volume_number": 1,
    "text": "The Answer: Al-Amidi said in \"Muntaha Al-Sul\" discussing them: If one of them is more general than the other, the Analogy specifies the Report and the Report specifies the Analogy if specification of the Cause ('Illah) is said to be permissible. Otherwise, they are contradictory from every aspect. If they contradict from every aspect, the Report is prioritized according to Al-Shafi'i, Ahmad and many jurists. The One Hundred and Eighth: Is the Condition (Shart) prioritized over the Conditioned (Mashrut) absolutely or does it need detailing? The Answer: If the questioner means whether the Condition is prioritized over the Conditioned in existence, then yes, it is stipulated that it precedes it, like Wudu for example, for it is a condition for prayer, and prayer is conditioned, and Wudu must precede it, otherwise it is not valid due to the impossibility of the existence of the Conditioned without the Condition. If he means whether it is permissible for it to precede it in wording only, then yes, its precedence and delay is permissible, as if he said: If you enter the house you are divorced, or You are divorced if you enter the house. If the questioner means other than that, it needs clarification. The One Hundred and Ninth: Is the Exception (Istithna') prioritized over the Excepted-from (Mustathna Minhu)? Is it a condition that it be of its genus, and that the excepted-from be mentioned from the beginning of speech to its end?",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 50
  },
  {
    "serial_number": "3907731",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 52,
    "volume_number": 1,
    "text": "The Answer: If the questioner means whether the Exception is prioritized over the Excepted-from in wording, as if he said: He has upon me except ten dirhams (18/recto) a thousand dirhams, the correct view is validity. Al-Rafi'i mentioned this at the beginning of the Book of Oaths, and narrated with it a view that it is not valid and the thousand is binding upon him. He also mentioned in the Chapter of Exception in Divorce that if he prioritized the Exception over the Excepted-from and said: You are except one divorced thrice, the Sheikh in Al-Muhadhdhab narrated from some companions that it is not valid and divorce occurs. Then he, meaning the Sheikh, said: And according to me it is valid and two divorces occur. End. If the questioner means other than that, it needs clarification. It is not a condition that the Excepted be of the genus of the Excepted-from. Rather, if he said he has upon me a thousand dirhams except a garment, it is valid; but he must specify a garment whose value is less than a thousand so it does not become consuming (all the value). If he specifies a consuming one, the explanation is invalid and so is the Exception according to the preferred view, so the thousand is binding upon him. As for his saying: Is it a condition that he be mentioning the Exception from the beginning of the oath to its end, the two Sheikhs Al-Rafi'i and Al-Nawawi, may Allah have mercy on them, differed in that in the Chapter of Divorce. Al-Rafi'i said: He must be mentioning the Exception from the beginning of the oath to its end. Al-Nawawi said: That is not stipulated, rather the connection of intention with the end of the oath suffices. What appears is that this does not apply in Acknowledgement; for Acknowledgements do not require intention at all.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 51
  },
  {
    "serial_number": "3907732",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 53,
    "volume_number": 1,
    "text": "The One Hundred and Tenth: Do the children of polytheists enter Paradise (18/verso) or not? The Answer: There is a famous old and modern disagreement in the issue among the people of knowledge, may Allah be pleased with them. The Master of the first and last and the most knowledgeable of Allah and His Sharia was asked about this issue and said: Allah knows best what they would have done. That is sufficient as an answer. [Sheikh al-Islam Al-Subki, may Allah be pleased with him, said: Whoever dies young is of divisions: Children of Prophets, peace be upon them, are in Paradise by consensus. Children of other believers are likewise according to the famous view, and stopping (Waqf) is said. Children of disbelievers have these two opinions, and it is said on the Heights (A'raf), and it is said they are tested in the Hereafter, and it is said in the Fire. It was argued for their being in Paradise by his saying in the Sahih \"And children of polytheists\". And I have in .... a view because .... regarding who died on Fitra .... that some of them are like that not all. End] (1)",
    "foot_note": "1. From the margin and the end of each line is smudged due to poor photography. I found the text in \"Fatawa Al-Ramli\" (3/106 Islamic Library ed) and he attributed it to Kamal Al-Damiri not to Al-Subki.",
    "book_id": "297",
    "new_page_number": 52
  },
  {
    "serial_number": "3907733",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 54,
    "volume_number": 1,
    "text": "The One Hundred and Eleventh: Devils - we seek refuge in Allah Almighty from them - do they give birth or lay eggs then hatch? The Answer: No text is present with me now in the issue; but it can be said: They give birth. Its evidence is His saying Almighty \"And when We said to the angels prostrate to Adam",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 53
  },
  {
    "serial_number": "3907734",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 55,
    "volume_number": 1,
    "text": "so they prostrated except Iblis. He was of the jinn and departed from the command of his Lord. Then will you take him and his descendants as allies\" The Verse. The point of evidence: His saying Almighty \"and his descendants\". Descendants (Dhurriyah) is only applied to those who are truly born. As for those hatched, they are called chicks not descendants. If it is said: From where did you get this? I said: From induction of their speech. The One Hundred and Twelfth: Are miracles of saints (Karamat al-Awliya) possible, and do they impugn the miracles of Prophets (Mu'jizat), and what is the difference between Mu'jizah and Karamah? The Answer: Our Sheikh, Sheikh al-Islam Siraj al-Din Al-Bulqini, may Allah extend his life, said in his book \"Manhaj Usul al-Din\": Issue in proving Karamah and distinguishing it from Mu'jizah (19/recto) What the people of truth have settled on is the possibility of breaking the norm for saints. The difference between it and Mu'jizah: Is that with Mu'jizah there is a claim of Prophethood unlike Karamah. The Master Abu Ishaq Al-Isfarayini inclined to preventing Karamah, and this is refuted by established transmissions in numerous stories. Those who permit differed; some stipulated for the norm-breaking Karamah that it occurs without choice from the saint, and this is the difference between Mu'jizah and Karamah according to them. Others permitted the occurrence of Karamah by choice of the saint; but he does not claim sainthood by it, and this is the difference between it and Mu'jizah according to them. Others said it is not impossible for a norm-breaking event to appear with a claim of sainthood. End.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 54
  },
  {
    "serial_number": "3907735",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 56,
    "volume_number": 1,
    "text": "And here is an important matter we should be aware of, which is: That these matters, which are breaking of habits, although their owner might be a friend (Wali) of Allah Almighty, he might be an enemy of Allah Almighty. For these supernatural events happen for many polytheists, people of the Book, hypocrites, and happen for people of innovation and from devils. It is not permissible to think that everyone who has something of these matters is a friend of Allah Almighty. Rather, friends of Allah Almighty are considered by their attributes, actions, and states indicated by the Book and Sunnah. They are known by the light of faith (19/verso) and Quran, by inner realities of faith, and outer laws of Islam. They are also known by their adherence to the Book and Sunnah, noting that none of them is infallible such that it is permissible for him or others to follow what falls into his heart without consideration of the Book and Sunnah. This is agreed upon by the friends of Allah Almighty. Whoever disagrees in this is not among the friends of Allah Almighty whom Allah commanded to follow. Rather, he is either a disbeliever or negligent in general. This is frequent in the speech of the Sheikhs, like the saying of Sheikh Abu Sulaiman Al-Darani: Indeed, a subtlety from the subtleties of the folk falls into my heart, so I do not accept it except with two witnesses: the Book and the Sunnah. Al-Junayd bin Muhammad said: Our knowledge this is restricted by the Book and Sunnah. Whoever has not read the Quran and written Hadith is not fit to speak in our knowledge. Abu Uthman Al-Naysaburi said: Whoever commands the Sunnah over himself in word",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 55
  },
  {
    "serial_number": "3907736",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 57,
    "volume_number": 1,
    "text": "and deed speaks with wisdom, and whoever commands desire over himself in word and deed speaks with innovation; because Allah Almighty says \"And if you obey him, you will be guided\". Many people err in such a place, thinking of a person that he is a friend of Allah Almighty, and thinking that a friend of Allah Almighty everything he says is accepted from him, and everything he does is submitted to, even if it contradicts the Book and Sunnah. So he agrees with that person and contradicts what (20/recto) Allah sent His Messenger with, whom He obliged all creation to believe in what he informed and obey in what he commanded. Whoever follows him is among the pious successful friends of Allah and His righteous servants. Whoever does not follow him is among the enemies of Allah, the losers. Disobeying the Messenger and agreeing with that person drags him first to innovation and misguidance, and finally to disbelief and hypocrisy. He will have a share of His saying Almighty \"And the Day the wrongdoer will bite on his hands [in regret] he will say, 'Oh, I wish I had taken with the Messenger a way. Oh, woe to me! I wish I had not taken that one as a friend. He led me away from the remembrance after it had come to me. And ever is Satan, to man, a deserter.'\" For this reason it was said about such people: They were denied arrival by neglecting the principles. For the principle of principles is realizing faith in Allah Almighty and His Messenger. Everyone who contradicts something of what the Messenger came with, imitating in that someone he thinks is a friend of Allah Almighty, has built his affair on [the premise] that he is a friend of Allah Almighty, and that a friend of Allah Almighty is not opposed in anything. Even if this man were among the greatest friends of Allah Almighty, it would not be accepted from him if he contradicted the Book and Sunnah, so how about if he is not so? You find many of these, their reliance in (20/verso) believing his being a friend of Allah Almighty is that an unveiling (Mukashafah) issued from him in some states and some supernatural stories",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 56
  },
  {
    "serial_number": "3907737",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 58,
    "volume_number": 1,
    "text": "like flying in the air to Mecca, or walking on water or similar things. There is nothing in any of these matters indicating that its owner is a friend of Allah Almighty. Rather, the friends of Allah Almighty agreed that if a man flew in the air or walked on water, he is not considered until you look at his following of the Messenger of Allah, peace and blessings be upon him, his agreement with his command and avoidance of his prohibition. The Karamats of Allah's friends are greater than these matters; but they might be found in persons where one of them does not perform Wudu nor prays the obligatory prayers, but is involved with impurities, associating with dogs, sheltering in dumps and rubbish heaps, his smell is offensive and similar things. These signs and their likes are signs of Satan's friends not signs of the Merciful's friends. If this is established, the elite friends of Allah Almighty, their Karamats are for proof in religion or for a need of Muslims, like the miracles of their Prophet, peace and blessings be upon him, such as the splitting of the moon, the praise of pebbles in his palm, the coming of trees, and the moaning of the trunk to him (21/recto) and similar things. About a thousand miracles have been collected. The Karamats of the Companions, Followers and other righteous people are very many, let us mention a part of them: Among them: That Umar bin Al-Khattab, may Allah be pleased with him, when he sent an army and appointed over it a man named Sariyah, while Umar bin Al-Khattab was giving a sermon, he began shouting on the pulpit: O Sariyah, the mountain! O Sariyah, the mountain! Then the messenger of",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 57
  },
  {
    "serial_number": "3907738",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 59,
    "volume_number": 1,
    "text": "the army arrived and said: O Commander of the Faithful, we met our enemy and they defeated us, then suddenly a shouter [said]: O Sariyah, the mountain! So we leaned our backs against the mountain and Allah Almighty defeated them. Among them: That Salman Al-Farsi and Abu Al-Darda were eating in a bowl, so what was in it praised [Allah] or it praised. Among them: That Usaid bin Hudair was reciting Surah Al-Kahf, and something like a canopy descended from the sky containing like lamps, which were angels descended to hear the Quran. Among them: That angels used to greet Imran bin Husayn. Among them: That Umm Ayman when she went out emigrating to the Messenger of Allah, peace and blessings be upon him, and she had no water or provision and nearly died of thirst. When it was time to break fast and she was fasting, she heard .... over her head, she raised it and saw a bucket .... white, so she drank from it until she was quenched, and she never got thirsty for the rest of her life. To other established Karamats. In summary, the Karamats of the friends of Allah Almighty (21/verso) only happened to them by the blessing of the Messenger, peace and blessings be upon him, and they fall under his miracles, so how can it be imagined or said that they impugn them.",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 58
  },
  {
    "serial_number": "3907739",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 60,
    "volume_number": 1,
    "text": "The One Hundred and Thirteenth: Is Fatwa treated like Judgment so that the Fatwa of a slave and a woman is not permissible, or is Fatwa broader than Judgment? The Answer: Fatwa is broader than Judgment, so the Fatwa of a slave and a woman is permissible with the considered conditions established in Fiqh books, this Fatwa is not the place to elaborate on them. The One Hundred and Fourteenth: A man pawned with another a bundle of sugar cane for a sum of dirhams, and the pawner and pawnbroker stipulated that the pawner plants the bundle at planting time, and whatever crops, candy, and sugar results from it will be pawned in its place. Is this pawn valid, and is it analogized to the issue of pawning what spoils quickly so it is sold and a pawn is made in its place or not? The Answer: It preceded that this condition and contract are invalid. If they are invalid, there is no need to answer the questioner's analogy. These are the last of the questions. And Allah, Glory be to Him and Exalted, knows best the truth, and to Him is the return and refuge. Said that and wrote: Hasan bin Husayn Al-Aithawi Al-Shafi'i, praising Allah Almighty for His blessings, praying upon His Prophet Muhammad, the best of His creation, submitting, and saying Hasbunallah (Allah is Sufficient for us). (22/recto)",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 59
  },
  {
    "serial_number": "3907740",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 61,
    "volume_number": 1,
    "text": "To proceed, after praising Allah who created man and taught him eloquence, clarified His Oneness with proof and evidence, and cleared understandings and minds with the light of His guidance. And prayer and peace upon the most noble of Messengers and seal of Prophets, master of the children of Adnan, sent with guidance and the Criterion, to fight those who oppose and disobey him with sword and spear, and give glad tidings to those who obey and ally with him of forgiveness, pleasure, and eternity in the chambers of Paradise. And upon his family and companions, the noble and beautiful, who undertook the victory of religion after its traces were erased and Satan corrupted the earth. And upon their followers and followers' followers forever as long as day and night shade and renew. The weak servant, poor to the mercy of his Lord, the Knowing, the Capable, the writer of these letters, has reviewed the answers to this questioner, the number of which equals the Surahs of the Quran, and which needed good consideration and increased clarification for their answer. I found the respondent to them in their entirety has done well and hit the mark, and brought in them wonderful marvels. He restricted their absolute, released their restricted, specified their general, clarified their ambiguous, established their principles, branched their branches, removed their defects, showed their unifier, cancelled their separator, brought in them every suitable consideration, and cancelled what deserves cancellation by division and probing with beneficial brevity and sound abbreviation. He deserves that with his diligence in seeking and his seriousness and effort in ........ to be counted among the unique and distinguished from individuals (22/verso) and soon, God willing, he will reach the utmost goal and attain the sovereignty he hopes for and more, with clear mind, superior understanding, compliant nature, and burning intelligence. He is the son, the Imam, the Scholar, the Allamah, the Brilliant, the Unique, the Perfect, the Versatile, the Researcher, the Theoretician, possessor of numerous arts and mastered sound researches: Badr al-Din Abu Muhammad Al-Hasan son of the late Sheikh",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 60
  },
  {
    "serial_number": "3907741",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 62,
    "volume_number": 1,
    "text": "the righteous Abu Abdullah Al-Husayn Al-Aithawi Al-Biqa'i Al-Shafi'i. May Allah perpetuate benefit through him and his beneficial sciences, make him a guide to every good and intercessor for it, and be kind with His great bounty to his father's soul and grant him of His immense bounty what he hopes for from the path of good ......... Said that with inability and shortcoming regarding his right and the right of brothers forever: Ahmad bin Rashid bin Tarkhan bin Ahmad Al-Malakawi Al-Shafi'i, praising Allah Almighty for His blessings, praying upon His Prophet, Beloved, Friend, and Choice of His creation Muhammad and upon his family and companions, and submitting. Allah is Sufficient for us and [He is] the best Disposer of affairs. (23/recto) To proceed, after praising Allah who expanded the chests of scholars with noble knowledge, granted them the best scholar who became like a full moon over stars, and increased them in honor and pride by establishing His Hanif religion. And the most complete and majestic blessings and peace upon our master Muhammad, the most noble of creation in rank, and the best of worlds in praise and remembrance, and upon his family and companions who allied with him secretly and openly, continuous successive prayer. The weak poor servant, confessing inability and shortcoming, writer of these lines, may Allah Almighty forgive his slips and overlook his bad deeds by His grace and generosity, has reviewed what is in these papers of questions, and what the Mufti answered to this questioner. He found him in what he transmitted agreeing with the transmission, and in what he understood indicative of his mastery of branches and principles. He is the unique who is not raced, the scholar who is not disputed, and the virtuous whose manners and virtues witnessed that he is correct regarding truth",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 61
  },
  {
    "serial_number": "3907742",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 63,
    "volume_number": 1,
    "text": "(23/verso) And in the speed of his answer, correctness of his understanding, and presentation of transmission, he is strange [unique] in this time. These questions, although they included many problems, are not what reveals to me now the merit of this respondent. For praise be to Allah Almighty, he has every amazing matter in this chapter. I have asked him for several years about many problematic issues, and his answers to them in the forefront of gatherings witnessed for him that he is mastered and perfect in sciences. And how could he not be so when he learned ........ for he scooped from the sea which became the eye of Sham and the unique flag among notable scholars. Fatwas rush to him from every deep valley, and upon his Fatwa rely foe and friend. His mention spread in all regions and his city boasted of him over most cities. He is the Imam whose merit is not denied, and how can his merit be denied when he belongs to Imam Ahmad, our master, the Sheikh, the Imam, the Scholar, the Allamah (24/recto) the 'Adawi, the Investigator, the Shihabi, Mufti of Muslims, blessing of acting scholars, benefit of students, eye of Shafi'is in protected Sham, placer of his handwriting in it. May Allah benefit Muslims by his life and return of his blessings to all. From him this respondent benefited and emerged, and by him he won the stakes of precedence and achieved. I was desired to write on that, although I am not of that [level]. By my life, he deemed fat one with swelling and blew into other than fire. I found no escape from answering his beautiful intent and observing his abundant merit. May Allah Almighty benefit him with what he knew and teach him what benefits, elevate him to the highest degrees and raise him by His grace and generosity. Amen. And praise be to Allah, Lord of the Worlds. And may Allah send blessings upon",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 62
  },
  {
    "serial_number": "3907743",
    "category_id": "16",
    "category": "Shafi'i Fiqh",
    "book_title": "Al-Ajwibah Al-Aithawiyyah 'an Al-Masa'il Al-Tarablusiyyah",
    "edition": "First, 1436 AH - 2015 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon",
    "page_number": 64,
    "volume_number": 1,
    "text": "our master Muhammad, Seal of Prophets, Imam of Messengers, and best of creatures, and upon all his family and companions, and grant abundant peace until the Day of Judgment. Written by Abd al-Wahhab bin Ahmad Al-Zuhri Al-Shafi'i, praising, praying, and submitting. Allah is Sufficient for us and [He is] the best Disposer of affairs. * * *",
    "foot_note": "None",
    "book_id": "297",
    "new_page_number": 63
  }
]