[
  {
    "text": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 1
  },
  {
    "text": "sn: 4764\nbook_title: قيام رمضان فضله وكيفية أدائه ومشروعية الجماعة فيه ومعه بحث قيم عن الاعتكاف\nbook_link: https://shamela.ws/book/11307\nbook_id: 11307\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: المكتبة الإسلامية-عمان-الأردن\nedition: الطبعة الثانية 1404هـ\npages: 41\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: مسائل فقهية\ncategory_id: 19",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 2
  },
  {
    "serial_number": "4638367",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Jurisprudential Issues. Book: The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf. Author: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH). Publisher: The Islamic Library - Amman - Jordan. Edition: Second Edition 1404 AH. Number of Pages: 41 [Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nBook: The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf. Author: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH). Publisher: The Islamic Library - Amman - Jordan. Edition: Second Edition 1404 AH. Number of Pages: 41 [Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH). Publisher: The Islamic Library - Amman - Jordan. Edition: Second Edition 1404 AH. Number of Pages: 41 [Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\n[Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "11307",
    "new_page_number": 3
  },
  {
    "serial_number": "4638368",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. Introduction to the Second Edition. Praise be to Allah, and blessings and peace be upon the Messenger of Allah, his family, his companions, and whoever followed his Sunnah and his guidance. As for what follows: This is the second edition of my treatise \"Qiyam Ramadan\" (The Night Prayer of Ramadan). I present it to the noble reader on the occasion of the approach of its blessed month in the year \"1406 AH\", after the copies of the first edition ran out and requests for it increased. So I reconsidered it, refined it, revised it, and appended to it numerous graduations (Takhrij) and new benefits that will please the beholders, Allah the Exalted willing. Among the most important of them is what the reader will see regarding \"I'tikaf\". I ask Allah, Glory be to Him and the Exalted, to make correctness my ally, and to forgive me for where my understanding deviated from correctness and where my pen strayed, and to make it purely for His Face. Indeed, He is Pardoning, Generous. Amman, 7 Sha'ban, year 1406 AH. Written by Muhammad Nasir al-Din al-Albani.",
    "foot_note": "None",
    "book_id": "11307",
    "new_page_number": 4
  },
  {
    "serial_number": "4638369",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 4,
    "volume_number": 1,
    "text": "Introduction to the First Edition. Indeed, all praise is due to Allah, we praise Him, we seek His help, we ask for His forgiveness, and we seek refuge in Allah from the evils of our own selves and the evil consequences of our deeds. Whomever Allah guides, there is none to misguide him, and whomever He leaves astray, there is none to guide him. I bear witness that there is no deity worthy of worship except Allah alone, having no partner, and I bear witness that Muhammad is His slave and His Messenger. As for what follows: It has been authentically reported from Ibn Masud as a Mawquf (statement of a Companion), and it takes the ruling of Marfu' (attributed to the Prophet) to the Prophet, may Allah bless him and grant him peace, that he said: \"How will you be when a trial (Fitnah) covers you, in which the adult grows old and the young grows up, and people take it as a Sunnah. If anything of it is left, it is said: Has the Sunnah been abandoned?\" It was said: When is that? He said: \"When your scholars pass away, your reciters increase, your jurists (Fuqaha) decrease, your leaders increase, your trustworthy ones decrease, the world is sought by the deeds of the Hereafter, and knowledge is sought for other than religion\" (1). I say: This hadith is one of the signs of his prophethood, may Allah bless him and grant him peace, and the truthfulness of his message. For every paragraph of it has been realized in the present age. Among that is the abundance of innovations and people's fascination with them until they took them as a Sunnah, and made them a religion",
    "foot_note": "1. 1 Narrated by Al-Darimi 1/64 with two chains, one is authentic (Sahih) and the other is good (Hasan), and Al-Hakim 4/514 and others.",
    "book_id": "11307",
    "new_page_number": 5
  },
  {
    "serial_number": "4638370",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 5,
    "volume_number": 1,
    "text": "to be followed. So if the people of Sunnah truly turn away from them towards the established Sunnah from him, may Allah bless him and grant him peace, it is said: The Sunnah has been abandoned! This is what befell us, the people of Sunnah in Sham (Syria), when we revived the Sunnah of Tarawih prayer as eleven Rak'ahs, while maintaining in it tranquility, Khushu' (humility), and the varied dhikr (remembrances) established from him, may Allah bless him and grant him peace, as much as possible—a matter which the masses of those who maintain praying it as twenty Rak'ahs have wasted. Despite that, their anger flared up and they raised an uproar when we issued our treatise \"Salat al-Tarawih\" (The Tarawih Prayer) (1), which is the second treatise of our book \"Tasdid al-Isabah ila man Za'ama Nusrat al-Khulafa' al-Rashidin wa as-Sahabah\" (Directing the Hit towards the one who Claimed to Support the Rightly Guided Caliphs and the Companions), when they saw the investigation therein:",
    "foot_note": "1. 1 Our brother Zuhair al-Shawish has reprinted this treatise in a second edition, year 1405 AH, with new typesetting. However, the proofs were not presented to me so I could correct them myself. Due to the difficulty of communication between Beirut and Amman, a few typographical errors occurred in it, some following the first edition. Among them is what is on p.32 and in the first edition p.37: 'Like one who prays, for example, Zuhr as five, and the Sunnah of Fajr as four!' The correct reading is: 'the Sunnah of Zuhr as five...' based on the conjunction 'and the Sunnah of Fajr', and the context. Some innovators exploited this typographical error and built upon it high structures and palaces in their letters which will be mentioned later, but they are {on the edge of a crumbling cliff...}.",
    "book_id": "11307",
    "new_page_number": 6
  },
  {
    "serial_number": "4638371",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 6,
    "volume_number": 1,
    "text": "1- That the Prophet, may Allah bless him and grant him peace, did not pray Tarawih of eleven Rak'ahs. 2- And that Umar, may Allah be pleased with him, ordered Ubayy and Tamim al-Dari to lead the people in Tarawih with eleven Rak'ahs according to the authentic Sunnah. 3- And that the narration: that people used to stand (in prayer) during the era of Umar in Ramadan with twenty Rak'ahs, is a Shadh (anomalous) and weak narration, contradicting the narration of the trustworthy ones (Thiqat) who said: eleven Rak'ahs; and that Umar, may Allah be pleased with him, ordered that. 4- And that even if the anomalous narration were authentic, taking the authentic narration would be more appropriate for its agreement with the Sunnah regarding the number. Furthermore, it does not state that Umar ordered the twenty; rather, the people did that. This is contrary to the authentic narration, for it states that he ordered eleven Rak'ahs. 5- And that even if it were authentic, it would not necessitate adherence to acting upon it and abandoning action upon the authentic narration which conforms to the Sunnah, such that the one acting upon the Sunnah is considered outside the Jama'ah (community)! Rather, the most that can be derived from it is the permissibility of twenty, with the certainty that what he, may Allah bless him and grant him peace, did and persisted upon is the best. 6- We also clarified in it the lack of proof for the twenty from any of the noble Companions. 7- And the invalidity of the claim of those who claimed that they reached a consensus (Ijma') on the twenty.",
    "foot_note": "None",
    "book_id": "11307",
    "new_page_number": 7
  },
  {
    "serial_number": "4638372",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 7,
    "volume_number": 1,
    "text": "8- We also clarified the evidence necessitating adherence to the number established in the Sunnah, and those among the scholars who denied the increase upon it, and other benefits that are rarely found collected in a book. All of that with clear evidences from the authentic Sunnah and relied-upon Athar (narrations). This matter stirred up a fierce campaign against us from a group of blind-following Sheikhs, some in their sermons and lessons, and some in treatises they authored in response (1) to our previous treatise. All of them are barren of useful knowledge and the proof indicating it. Rather, they are blackened with insults and curses, as is the habit of the falsifiers when they revolt against the truth and its people. Therefore, we did not see much benefit in wasting our time responding to them and exposing the flaws of their speech, because life is too short to accommodate that due to their large number—may Allah guide them all. There is no harm in striking an example of that with one of them—who is, in my view, among the best and most knowledgeable of them (2)—but if knowledge is not accompanied by sincerity",
    "foot_note": "1. 1 And the last of them—as far as I know—is Muhammad Ali Al-Sabouni in his treatise which he named according to the rule \"They name it...\": \"The Authentic Prophetic Guidance in Tarawih Prayer\". See the introduction to Part Four of my book \"Silsilat al-Ahadith al-Sahihah\" for the response to him!! 2 He is Sheikh Ismail Al-Ansari, an employee in the Ifta Department in the city of Riyadh.",
    "book_id": "11307",
    "new_page_number": 8
  },
  {
    "serial_number": "4638373",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 8,
    "volume_number": 1,
    "text": "and integrity in character, its harm upon its owner is greater than its benefit, as indicated by his saying, may Allah bless him and grant him peace: \"The likeness of the one who teaches people good and forgets himself is like the lamp that lights for the people and burns itself\" (1). For the one referred to has authored a treatise titled \"Authentication of the Hadith of Tarawih Prayer as Twenty Rak'ahs, and the Response to Al-Albani in Weakening It\"! In it, its author departed from the method of the people of knowledge in countering argument with argument, and proof with proof, and truthfulness in speech, and avoiding giving people an impression contrary to reality. Here we point out some of that as briefly as possible in this introduction, so we say: 1- Indeed, everyone who reads the mentioned title of his treatise, it immediately comes to his mind that he means the Marfu' (Prophetic) hadith regarding the twenty, which is weak by agreement. But if he reads pages from its beginning, it becomes clear to him that he means the Athar narrated through the path of Yazid bin Khasifah from Al-Sa'ib bin Yazid who said: They used to stand (in prayer) during the era of Umar bin Al-Khattab in the month of Ramadan with twenty Rak'ahs!",
    "foot_note": "1. 1 Narrated by Al-Tabarani and Al-Diya' Al-Maqdisi in \"Al-Mukhtarah\" from Jundub, and its chain is Jayyid (good). See \"Sahih At-Targhib\" 1/56/127.",
    "book_id": "11307",
    "new_page_number": 9
  },
  {
    "serial_number": "4638374",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 9,
    "volume_number": 1,
    "text": "Thus the reader knows that the subject of the treatise is one thing, and its title is another thing. That is Tadlis (deception) itself. We ask Allah for safety and well-being. 2- And among that is that he blackened three pages of it \"14-16\" in defending the mentioned Yazid bin Khasifah, and proving that he is Thiqah (trustworthy), in order to give the impression to the readers—who find therein a number of Imams having declared him trustworthy—that I have contradicted them all by weakening him! The matter is not so, for I have followed them in declaring him trustworthy, as will come. 3- Rather, he exceeded the limit of creating false impressions and deception to explicit, exposed lying and stating contrary to reality. He said (p. 15): \"Indeed, Al-Albani claimed his weakness.\" This is a scandalous lie, for the truth is that I explicitly stated in my treatise \"p. 57\" that he is Thiqah! The most I said about him was: \"He may be alone in narrating what the Thiqat (trustworthy ones) did not narrate, so the likes of him, his hadith is rejected if he contradicts one who is more preserving (Ahfaz) than him, and it becomes Shadh (anomalous) as established in the science of Terminology (Mustalah). And this Athar is of this type...\" Such speech, even if considered a criticism of a Thiqah by the scholars, does not mean that he is weak and rejected absolutely. Rather, it is the opposite of that; it only means that his hadith is accepted absolutely except in case of contradiction. And this is",
    "foot_note": "None",
    "book_id": "11307",
    "new_page_number": 10
  },
  {
    "serial_number": "4638375",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 10,
    "volume_number": 1,
    "text": "what I explicitly stated at the end of the mentioned speech by my saying: \"And this Athar is of this type\". My entire discussion referred to in my treatise revolves around that. Yet the accuser ignored all of that and attributed to me what I did not say. So Allah the Exalted is his Reckoner! 4- The alluded-to Sheikh was not satisfied with the mentioned fabrication; rather, he attributed to me another scandal, saying (p. 22): \"It is not appropriate for one who leaves the narration of Yazid bin Khasifah, whom all the Imams used as proof, to accept using the narration of Isa bin Jariyah as proof, whom Yahya bin Ma'in weakened and... and...\" The truth is that I never used the narration of the mentioned Isa as proof absolutely. Rather, I indicated that he is not used as proof, and that was when I said \"p. 21\": \"Its chain is Hasan (good) due to what precedes it.\" Because had I used him as proof as the Sheikh fabricated, I would not have said: \"...due to what precedes it\". For this phrase is a decisive indicator that this narrator is not among those used as proof by the one saying it; rather, he is weak according to him, used only for corroboration, and his hadith is improved (Yukassan) if something witnessing to it is found. And it was found, which is the hadith referred to by my saying: \"due to what precedes it\", which is the hadith",
    "foot_note": "None",
    "book_id": "11307",
    "new_page_number": 11
  },
  {
    "serial_number": "4638376",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 11,
    "volume_number": 1,
    "text": "of Aisha, may Allah be pleased with her, who said: The Messenger of Allah, may Allah bless him and grant him peace, did not increase in Ramadan nor in other than it upon eleven Rak'ahs... The Hadith, the two Sheikhs (Bukhari and Muslim) and others narrated it. Is the Sheikh so ignorant of the science of Hadith to the degree that he does not understand such a sentence: \"Its chain is Hasan due to what precedes it\"?! Especially since I increased the clarification when I repeated the hadith with another extraction (Takhrij) \"p. 79-80\" and quoted Al-Haythami saying that it is Hasan, so I commented on him by my saying verbatim: \"And its chain is possibly suitable for improvement (Tahsin) in my view, and Allah knows best\"! Or is it deliberate feigned ignorance and pure fabrication; due to a grudge in his heart? May Allah have mercy on the one who said: If you do not know, then that is a calamity... And if you know, then the calamity is greater. And what indicates to the reader that the Sheikh does know...! is his saying \"p. 46\"—having mentioned the hadith of Jabir: \"Do not benefit from the dead animal (Maitah) with anything\", imitating the opinion of one who declared it Hasan—: \"It is not appropriate for Al-Albani to weaken a Hasan hadith given the existence of other weak paths for it, for that is contrary to what the Imams of the Art (of Hadith) established\"! So then; when I declared the hadith of Isa bin Jariyah Hasan previously",
    "foot_note": "None",
    "book_id": "11307",
    "new_page_number": 12
  },
  {
    "serial_number": "4638377",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 12,
    "volume_number": 1,
    "text": "by the witness of Aisha's hadith for it, the Sheikh was aware that I was in agreement in that with what the Imams of the Art established! Therefore, he was unable to fault me in that, so he resorted to fabricating the statement that I used it as [independent] proof to quench the anger of his heart. So Allah, Mighty and Majestic, is his Reckoner. Then does the noble reader not notice with me the manipulation of scientific facts by this Sheikh? For if it was not appropriate for me—as he claimed—to weaken the hadith of Jabir: \"Do not benefit from the dead animal with anything\", because it has—according to his claim—another path which is weak by his admission even if by imitation, then is it appropriate for him to weaken the hadith of Jabir also, mentioned previously regarding the prayer of the Prophet, may Allah bless him and grant him peace, for Tarawih as eleven Rak'ahs, while it has an authentic witness from the hadith of Aisha, may Allah be pleased with her, in the Two Sahihs which he sees in them with his own eyes?!! Does this not mean that the Sheikh is playing on two ropes, and weighing with two scales?! So Allah is the One sought for help, and there is no power nor strength except in Allah. I add now, clarifying a fact that escaped Sheikh Ismail Al-Ansari—may Allah guide him—: I only said just now: \"according to his claim\" as an indication from me that this path, regarding which he quoted some declaring it Hasan, and criticized me for weakening it, while he sees with his own eye that it contains the 'an'ana (saying 'from') of Abu Al-Zubayr from Jabir, is the very same 'other' path by which",
    "foot_note": "None",
    "book_id": "11307",
    "new_page_number": 13
  },
  {
    "serial_number": "4638378",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 13,
    "volume_number": 1,
    "text": "he strengthened the first one, for its pivot is upon Abu Al-Zubayr as well, as in \"Nasb al-Rayah\" \"1/122\"! So did the Sheikh's knowledge encompass that among \"what the Imams of the Art established\" is that it is permissible to strengthen the weak with itself and not with its like?! Or is it following desires and attempting to support the Sheikhs even by opposing the truth! Or is it imitation of the likes of Al-Shawkani in \"Al-Nayl\" which contains much copying and gathering (Taqmish), and little verification and inspection regarding discussion on hadiths. However, this does not prevent me—by the grace of Allah and His success—from stating that I found later a strong witness for this hadith of Jabir, with its wording, from the hadith of Ibn Ukaym, may Allah be pleased with him. I did not see anyone before me mentioning it or pointing to it, and it has an authentic chain in my view, as you see it explained in my book \"Irwa' al-Ghalil\" \"1/78\". So if Sheikh Al-Ansari desired knowledge, sincere advice, and guidance, he would not have done wrong by making one path into two, and he would have done good to us by pointing out this witness. But the matter is as was said: \"He who lacks a thing cannot give it\". For I saw him mention in his response \"p. 48\" that the hadith of Ibn Ukaym is with Al-Darqutni, and that its meaning and the meaning of Jabir's hadith are one! And although I do not know, by Allah—nor do I think he knows—why he singled out Al-Darqutni for mention excluding the rest of the authors of the Sunan, while his wording and their wording",
    "foot_note": "None",
    "book_id": "11307",
    "new_page_number": 14
  },
  {
    "serial_number": "4638379",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 14,
    "volume_number": 1,
    "text": "is one: \"Do not benefit from the dead animal with hide or sinew\", and that his claim that it is synonymous with the hadith of Jabir is not conceded because it is more specific than it as is apparent, yet the wording which is the wording of Jabir's hadith exactly escaped him. So praise be to Allah who guided me—even if after a while—to it, and did not give anyone power over me—due to my previous unawareness of it—otherwise... we ask Allah for safety and well-being in this world and the Hereafter. 5- The Sheikh did not limit himself to the preceding fabrication against me; he attributed to me \"p. 41\" attributing ignorance to the Salaf! {Glory to You, this is a great slander} [An-Nur: 16]. The truth is that I have no sin with the Sheikh and his likes from the blind followers and hateful ones except that I call for following the Righteous Salaf and holding fast to their Madhhab (methodology), not the Madhhab of specific persons among them. That is what incited the Sheikh to stand against me the stance of a hateful opponent, going along with the blind-following majority, who know nothing of religion except what they found the fathers and grandfathers upon, except those whom Allah protected, and how few they are. Among the strange matters of this Sheikh is that he passed by all those issues previously alluded to, wherein we verified the speech, and undoubtedly he is with us in some of them at least or most of them, yet he did not clarify his stance on them. For example, our saying: It does not follow from the establishment of the Athar of twenty that one must abandon acting upon the other narration conforming to",
    "foot_note": "None",
    "book_id": "11307",
    "new_page_number": 15
  },
  {
    "serial_number": "4638380",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 15,
    "volume_number": 1,
    "text": "the hadith of Aisha that the Prophet, may Allah bless him and grant him peace, used not to increase in Ramadan nor in other than it upon eleven Rak'ahs. And is it better to act upon his Sunnah, may Allah bless him and grant him peace, or upon what the people did in the era of Umar assuming that is established from them?! The Sheikh did not show his stance on that, because if he preferred contrary to the Sunnah, his affair would be exposed among the people of Sunnah, and if he preferred the Sunnah, he would agree with Al-Albani, and this is something his soul does not allow for a reason or more that is not hidden from the intelligent reader! This is an example of the responses we have seen, used to reply to our treatise \"Salat al-Tarawih\", and it is among the best of the responses. Yet, the noble reader has known examples of what came in it, in which stripping oneself of fairness becomes manifest, as well as distance from the path of the people of knowledge who seek nothing but the clarification of the truth. If this is from the best and most knowledgeable of them, then what of others who have no knowledge and no character?! That, and since a not short time has passed since the printing of our mentioned treatise \"Salat al-Tarawih\", and the need called for reprinting it, and since in terms of its style it had achieved its goals and fulfilled its purposes—the most important of which was alerting the public to the Sunnah in Tarawih prayer and responding to those opposing it, until this Sunnah spread in many mosques of Syria, Jordan, and other Islamic lands,",
    "foot_note": "None",
    "book_id": "11307",
    "new_page_number": 16
  },
  {
    "serial_number": "4638381",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 16,
    "volume_number": 1,
    "text": "and praise be to Allah by Whose favor good deeds are completed. Therefore, I saw fit to summarize it in a purely scientific style, without addressing anyone in it with a response, according to the saying of the one who said: \"Cast your word and walk\", summarizing all the scientific benefits that were in the \"Original\", adding to it other benefits to complete the utility. And Allah, the Glorified, is the One asked to bring benefit by it as He brought benefit by its predecessor, and to reward me for it; indeed, He is the Most Generous One asked.",
    "foot_note": "None",
    "book_id": "11307",
    "new_page_number": 17
  },
  {
    "serial_number": "4638382",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 17,
    "volume_number": 1,
    "text": "Qiyam Ramadan (The Night Prayer of Ramadan). Merit of standing (in prayer) during the nights of Ramadan: 1- Two hadiths have come regarding it: The First: From Abu Hurairah, may Allah be pleased with him, who said: The Messenger of Allah, may Allah bless him and grant him peace, used to encourage standing in Ramadan without ordering them with a strict command, then he would say: \"Whoever stands in Ramadan out of faith and expecting reward, his past sins will be forgiven.\" Then the Messenger of Allah, may Allah bless him and grant him peace, passed away and the matter was like that (1). Then the matter was like that during the Caliphate of Abu Bakr, may Allah be pleased with him, and the beginning of the Caliphate of Umar, may Allah be pleased with him (2).",
    "foot_note": "1. 1 Meaning: upon the abandonment of congregation in Tarawih. 2 Narrated by Muslim and others. And Al-Bukhari has the Marfu' part of his saying, may Allah bless him and grant him peace. It is graduated in \"Al-Irwa'\" 4/14/906 and in \"Sahih Abi Dawud\" 1241. May Allah facilitate for me completing its authorship and then its printing. And the saying of brother Zuhair in his comment on my treatise \"Salat al-Eidain\" p. 32—and he reprinted it in the year 1404 AH—: \"And Allah has facilitated the printing of the first part of 'Sahih Abi Dawud' for our teacher Al-Albani\" (Zuhair), I do not know, by Allah, its basis, for the part is with me, and I did not authorize anyone to photocopy, print, or publish it. Similar to it is what he mentioned in his fourth edition of my book \"At-Tawassul\" year 1403 AH p. 22 that the third volume of \"Silsilat al-Ahadith al-Da'ifah\" has been issued, while up to this date Rajab - 1406 it has not yet been issued!",
    "book_id": "11307",
    "new_page_number": 18
  },
  {
    "serial_number": "4638383",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 18,
    "volume_number": 1,
    "text": "The Other: The hadith of Amr bin Murrah al-Juhani who said: A man from Quda'ah came to the Messenger of Allah, may Allah bless him and grant him peace, and said: O Messenger of Allah! What do you think if I testify that there is no deity worthy of worship except Allah, and that you are the Messenger of Allah, and I pray the five prayers, fast the month, stand in Ramadan (in prayer), and give Zakat? The Prophet, may Allah bless him and grant him peace, said: \"Whoever dies upon this is among the Truthful Ones (Siddiqin) and the Martyrs (Shuhada)\" (1). Laylat al-Qadr (The Night of Decree) and its determination: 2- And the best of its nights is Laylat al-Qadr, due to his saying, may Allah bless him and grant him peace: \"Whoever stands in Laylat al-Qadr and is granted success in it, out of faith and expecting reward, his past sins will be forgiven\" (2).",
    "foot_note": "1. 1 Narrated by Ibn Khuzaymah and Ibn Hibban in their \"Sahihs\" and others with an authentic chain. See my comment on \"Ibn Khuzaymah\" 3/340/2262 and \"Sahih At-Targhib\" 1/419/993. 2 Narrated by the two Sheikhs and others from the hadith of Abu Hurairah, and Ahmad 5/318 from the hadith of Ubadah bin al-Samit, and the addition is his, and for Muslim from Abu Hurairah. \"Alert\": I had mentioned in the first edition at the end of the hadith another addition with the wording: \"and what follows\" (wa ma ta'akhara), relying on the authentication of Al-Mundhiri, Al-Asqalani, and others for it. Then Allah the Exalted facilitated for me to track the paths of the hadith and its narrations from Abu Hurairah and Ubadah, an extensive tracking I did not see anyone else do. So it became clear to me that it is a Shadh (anomalous) addition from Abu Hurairah, and Munkar (denounced) from Ubadah, and that whoever declared this good or authenticated that was mistaken due to stopping at the appearance of the men of the chain and not tracking the narrations. I have verified that in a very extensive research which I deposited in \"Silsilat al-Ahadith al-Da'ifah\" under number 5083. Therefore, I did not mention this addition in the hadith of Abu Hurairah when I cited it in \"Sahih At-Targhib wa At-Tarhib\" 982, nor did I mention with it the hadith of Ubadah contrary to its original \"At-Targhib\". And Allah the Exalted is the Guardian of success.",
    "book_id": "11307",
    "new_page_number": 19
  },
  {
    "serial_number": "4638384",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 19,
    "volume_number": 1,
    "text": "3- And it is the night of the twenty-seventh of Ramadan most likely. Upon this are most of the hadiths, among them the hadith of Zirr bin Hubaysh who said: I heard Ubayy bin Ka'b say—when it was said to him: Abdullah bin Masud says: Whoever stands the whole year will hit Laylat al-Qadr!—So Ubayy, may Allah be pleased with him, said: May Allah have mercy on him, he wanted the people not to rely (on a specific night). By the One besides Whom there is no deity worthy of worship, indeed it is in Ramadan—he swore without making exception—and by Allah, I indeed know which night it is? It is the night which the Messenger of Allah, may Allah bless him and grant him peace, commanded us to stand in; it is the night of the morning of the twenty-seventh. And its sign is that the sun rises on the morning of its day white, having no rays. And in a narration, he raised that (attributed it) to the Prophet, may Allah bless him and grant him peace (1). Legitimacy of Congregation in the Night Prayer: 4- And congregation is legislated in the Night Prayer of Ramadan; rather, it is better than",
    "foot_note": "1. 1 Narrated by Muslim and others. And it is graduated in \"Sahih Abi Dawud\" (1247).",
    "book_id": "11307",
    "new_page_number": 20
  },
  {
    "serial_number": "4638385",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 20,
    "volume_number": 1,
    "text": "solitude, because the Prophet, may Allah bless him and grant him peace, established it himself, and clarified its merit by his saying, as in the hadith of Abu Dharr, may Allah be pleased with him, who said: We fasted Ramadan with the Messenger of Allah. He did not stand (in prayer) with us for any part of the month until seven (nights) remained, so he stood with us until a third of the night had passed. Then when it was the sixth (remaining night), he did not stand with us. Then when it was the fifth, he stood with us until half the night had passed. So I said: O Messenger of Allah! If only you would give us the voluntary prayer of standing for this night [the rest of it]. So he said: \"Indeed, when a man prays with the Imam until he departs, it is recorded for him as standing a night.\" Then when it was the fourth, he did not stand. Then when it was the third (1), he gathered his family, his wives, and the people, and he stood with us until we feared missing the Falah. He said: I said: What is the Falah? He said: The Suhur (pre-dawn meal). Then he did not stand with us the rest of the month (2). The reason for the Prophet, may Allah bless him and grant him peace, not continuing with the congregation in it: 5- He, upon him be blessings and peace, only did not stand with them the rest of the month fearing",
    "foot_note": "1. 1 Meaning the night of the twenty-seventh, which is Laylat al-Qadr most likely as preceded. Therefore, the Prophet, may Allah bless him and grant him peace, gathered in it his family and his wives. In it is the desirability of women attending this night. 2 An authentic hadith, narrated by the authors of the Sunan and others. It is graduated in \"Salat al-Tarawih\" p. 16-17 and \"Sahih Abi Dawud\" 1245 and \"Al-Irwa'\" 447.",
    "book_id": "11307",
    "new_page_number": 21
  },
  {
    "serial_number": "4638386",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 21,
    "volume_number": 1,
    "text": "that the Night Prayer in Ramadan would be made obligatory upon them, and they would be unable to do it, as came in the hadith of Aisha in the \"Two Sahihs\" and others (1). This fear was removed by his death, may Allah bless him and grant him peace, after Allah completed the Shariah. Thus the effect (the leaving of congregation) was removed, and the previous ruling remained, which is the legitimacy of congregation. Therefore, Umar, may Allah be pleased with him, revived it as in \"Sahih Al-Bukhari\" and others (2). Legitimacy of Congregation for Women: 6- And it is legislated for women to attend it as in the previous hadith of Abu Dharr. Rather, it is permissible to appoint a specific Imam for them, other than the Imam of the men. For it is established that when Umar, may Allah be pleased with him, gathered the people for the Night Prayer, he appointed Ubayy bin Ka'b over the men, and Sulaiman bin Abi Hathmah over the women. From Arfajah al-Thaqafi who said: Ali bin Abi Talib, may Allah be pleased with him, used to order the people to stand in the month of Ramadan, and he would appoint an Imam for the men and an Imam for the women. He said: So I was the Imam of the women (3).",
    "foot_note": "1. 1 See its context and graduation in \"At-Tarawih\" p. 12-14. 2 See its graduation and the speech of Ibn Abd al-Barr and others on it in the previous source p. 49-25. 3 Narrated, and the one before it, by Al-Bayhaqi 2/494. And Abd al-Razzaq also narrated the first of them in \"Al-Musannaf\" 4/258/8722. And Ibn Nasr also narrated them in \"Qiyam Ramadan\" p. 93, then used them as proof for what we mentioned p. 95.",
    "book_id": "11307",
    "new_page_number": 22
  },
  {
    "serial_number": "4638387",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 22,
    "volume_number": 1,
    "text": "I say: And the place for this in my view is if the mosque is spacious, so that one of them does not disturb the other. Number of Rak'ahs of the Standing (Qiyam): 7- Its Rak'ahs are eleven Rak'ahs. We choose not to increase upon that in following the Messenger of Allah, may Allah bless him and grant him peace, for he did not increase upon that until he departed from the world. Aisha, may Allah be pleased with her, was asked about his prayer, may Allah bless him and grant him peace, in Ramadan? So she said: The Messenger of Allah, may Allah bless him and grant him peace, did not increase in Ramadan nor in other than it upon eleven Rak'ahs. He would pray four, so do not ask about their beauty and length. Then he would pray four, so do not ask about their beauty and length. Then he would pray three (1). 8- And he may decrease from that, even if he restricts himself to the Rak'ah of Witr only, due to the evidence of his action, may Allah bless him and grant him peace, and his saying: As for the action, Aisha, may Allah be pleased with her, was asked: With how many did the Messenger of Allah, may Allah bless him and grant him peace, perform Witr? She said:",
    "foot_note": "1. 1 Narrated by the two Sheikhs and others, and it is graduated in \"Salat al-Tarawih\" 20-21 and \"Sahih Abi Dawud\" 1212.",
    "book_id": "11307",
    "new_page_number": 23
  },
  {
    "serial_number": "4638388",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 23,
    "volume_number": 1,
    "text": "He used to perform Witr with four (1) and three, and six and three, and ten and three. And he did not use to perform Witr with less than seven, nor with more than thirteen (2). As for his saying, may Allah bless him and grant him peace, it is: \"The Witr is a right (Haqq), so whoever wishes let him perform Witr with five, and whoever wishes let him perform Witr with three, and whoever wishes let him perform Witr with one\" (3). Recitation in the Standing (Qiyam): 9- As for the recitation in the Night Prayer in Qiyam Ramadan or other than it, the Prophet, may Allah bless him and grant him peace, did not set a limit in it that cannot be exceeded by increase or decrease. Rather, his recitation, may Allah bless him and grant him peace, therein used to vary in shortness and length. So sometimes he would read in every Rak'ah",
    "foot_note": "1. 1 I say: Among them are the two Rak'ahs of the Sunnah of Isha afterwards, or the two light Rak'ahs with which the Prophet, may Allah bless him and grant him peace, used to open the Night Prayer, according to what Al-Hafiz preferred. See \"Salat al-Tarawih\" p. 19-20. 2 Narrated by Abu Dawud and Ahmad and others. It is a hadith with a Jayyid (good) chain, and Al-Iraqi authenticated it. It is graduated in \"Salat al-Tarawih\" p. 98-99 and \"Sahih Abi Dawud\" 1233. 3 Narrated by Al-Tahawi and Al-Hakim and others. It is a hadith with an authentic chain as a group of Imams said. It has a witness containing a Munkar (denounced) addition, as I clarified in \"At-Tarawih\" p. 99-100.",
    "book_id": "11307",
    "new_page_number": 24
  },
  {
    "serial_number": "4638389",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 24,
    "volume_number": 1,
    "text": "the amount of {O you who wraps himself} [Al-Muzzammil], which is twenty verses. And sometimes the amount of fifty verses. And he used to say: \"Whoever prays in a night with one hundred verses will not be written among the heedless.\" And in another hadith: \"...with two hundred verses, he will be written among the devoutly obedient (Qanitin) and sincere.\" And he, may Allah bless him and grant him peace, read in a night while he was sick the Seven Long Ones (At-Tiwal), which are Surah {Al-Baqarah}, {Al Imran}, {An-Nisa}, {Al-Ma'idah}, {Al-An'am}, {Al-A'raf}, and {At-Tawbah}. And in the story of the prayer of Hudhayfah bin al-Yaman behind the Prophet, upon him be blessings and peace, [it is mentioned] that he, may Allah bless him and grant him peace, read in one Rak'ah {Al-Baqarah} then {An-Nisa} then {Al Imran}, and he was reading them slowly and leisurely (1). And it is established with the most authentic chain that Umar, may Allah be pleased with him, when he ordered Ubayy bin Ka'b to lead the people with eleven Rak'ahs in Ramadan, Ubayy, may Allah be pleased with him, used to read by the hundreds (Al-Mi'in), such that those behind him would lean on staffs due to the length of the standing, and they would not depart except in the early parts of Fajr (2).",
    "foot_note": "1. 1 All these hadiths are authentic, graduated in \"Sifat as-Salah\" 117-122. 2 Narrated by Malik with similar meaning. See \"Salat al-Tarawih\" p. 52.",
    "book_id": "11307",
    "new_page_number": 25
  },
  {
    "serial_number": "4638390",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 25,
    "volume_number": 1,
    "text": "And it is authentic from Umar also that he called the reciters in Ramadan, so he ordered the fastest of them in reading to read thirty verses, the medium twenty-five verses, and the slow twenty verses (1). Based on that, if the one standing (in prayer) prays for himself, let him lengthen as he wishes, and likewise if he has with him someone who agrees with him. The more he lengthens, the better it is, except that he should not exaggerate in lengthening to the point of spending the entire night except rarely, in following the Prophet, may Allah bless him and grant him peace, who said: \"And the best guidance is the guidance of Muhammad\" (2). However, if he prays as an Imam, he must lengthen in a way that does not cause hardship to those behind him, due to his saying, may Allah bless him and grant him peace: \"If one of you stands (in prayer) for the people, let him lighten the prayer, for among them are the young and the old, and among them are the weak, the sick, and the one with a need. And if he stands alone, let him lengthen his prayer as he wishes\" (3).",
    "foot_note": "1. 1 See its graduation in the previous source p. 71. And Abd al-Razzaq also narrated it in \"Al-Musannaf\" 4/261/7731 and Al-Bayhaqi 2/497. 2 It is part of a hadith narrated by Muslim and Al-Nasa'i and others. It is graduated in \"Ahkam al-Jana'iz\" p. 18 and \"Al-Irwa'\" 608. 3 Narrated by the two Sheikhs, and the wording and additions are for Muslim. It is graduated in \"Al-Irwa'\" 512 and \"Sahih Abi Dawud\" 759 and 760.",
    "book_id": "11307",
    "new_page_number": 26
  },
  {
    "serial_number": "4638391",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 26,
    "volume_number": 1,
    "text": "Time of the Standing (Qiyam): 10- The time for the Night Prayer is from after the Isha prayer until Fajr, due to his saying, may Allah bless him and grant him peace: \"Indeed Allah has increased a prayer for you, and it is the Witr (1), so pray it between the Isha prayer until the Fajr prayer\" (2). 11- And prayer in the last part of the night is better for the one for whom it is easy, due to his saying, may Allah bless him and grant him peace: \"Whoever fears he will not stand in the last part of the night, let him perform Witr in its beginning. And whoever hopes to stand in its end, let him perform Witr in the last part of the night, for the prayer of the last part of the night is witnessed, and that is better\" (3). 12- If the matter is between praying the first part of the night with the congregation, and between praying the last part of the night alone, then prayer with the congregation is better, because the standing of a full night is recorded for him as preceded in Paragraph 4 attributed to the Prophet, may Allah bless him and grant him peace. And upon that proceeded the action of the Companions in the era of Umar, may Allah be pleased with him. So Abdur-Rahman bin Abd al-Qari said:",
    "foot_note": "1. 1 The entire Night Prayer is called Witr because its number is Witr, meaning: an odd number. 2 Authentic hadith, narrated by Ahmad and others from Abu Basrah. It is graduated in \"Al-Sahihah\" 108 and \"Al-Irwa'\" 2/158. 3 Narrated by Muslim and others. It is graduated in \"Al-Sahihah\" 2610.",
    "book_id": "11307",
    "new_page_number": 27
  },
  {
    "serial_number": "4638392",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 27,
    "volume_number": 1,
    "text": "I went out with Umar bin Al-Khattab one night in Ramadan to the mosque. Behold, the people were scattered groups; a man praying for himself, and a man praying and a group praying by his prayer. So Umar said: By Allah, I see that if I gathered these people upon one reciter, it would be ideal. Then he resolved, so he gathered them upon Ubayy bin Ka'b. He said: Then I went out with him another night, and the people were praying by the prayer of their reciter. So Umar said: What an excellent innovation this is (Ni'mat al-Bid'ah), and the one they sleep through is better than the one they stand in—meaning the last part of the night—and people were standing in the first part of it (1). And Zaid bin Wahb said: Abdullah used to lead us in prayer in the month of Ramadan, and he would depart at night (2). The Manners (Kayfiyat) in which the Night Prayer is prayed: 13- I had detailed the speech on that in \"Salat al-Tarawih\" p. 101-115, so I see fit to summarize that here to facilitate for the reader and as a reminder:",
    "foot_note": "1. 1 Narrated by Al-Bukhari and others. It is graduated in \"At-Tarawih\" p. 48. 2 Narrated by Abd al-Razzaq 7741 and its chain is authentic. Imam Ahmad pointed to this Athar and the one before it when he was asked: Should he delay the Standing—meaning Tarawih—to the last part of the night? He said: \"No, the practice of the Muslims is more beloved to me.\" Narrated by Abu Dawud in his \"Masa'il\" p. 62.",
    "book_id": "11307",
    "new_page_number": 28
  },
  {
    "serial_number": "4638393",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 28,
    "volume_number": 1,
    "text": "The First Manner: Thirteen Rak'ahs. He opens it with two light Rak'ahs—and they are most likely the Sunnah of Isha afterwards, or two specific Rak'ahs with which he opens the Night Prayer as preceded. Then he prays two very long Rak'ahs. Then he prays two Rak'ahs less than them. Then he prays two Rak'ahs less than the two before them. Then he prays two Rak'ahs less than them. Then he prays two Rak'ahs less than them. Then he performs Witr with one Rak'ah. The Second: He prays thirteen Rak'ahs. Of them are eight where he makes Taslim (salutation) between every two Rak'ahs. Then he performs Witr with five, not sitting nor making Taslim except in the fifth. The Third: Eleven Rak'ahs, making Taslim between every two Rak'ahs, and performing Witr with one. The Fourth: Eleven Rak'ahs, praying four of them with one Taslim, then four likewise, then three. Did he use to sit between every two Rak'ahs of the four and the three? We did not find a sufficient answer regarding that. But sitting in the three is not legislated! The Fifth: He prays eleven Rak'ahs, of them eight Rak'ahs in which he does not sit except in the eighth. He recites Tashahhud and sends blessings upon the Prophet, may Allah bless him and grant him peace, then stands and does not make Taslim. Then he performs Witr with one Rak'ah, then makes Taslim. These are nine. Then he prays two Rak'ahs while he is sitting.",
    "foot_note": "None",
    "book_id": "11307",
    "new_page_number": 29
  },
  {
    "serial_number": "4638394",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 29,
    "volume_number": 1,
    "text": "The Sixth: He prays nine Rak'ahs of which six he does not sit except in the sixth of them, then he recites Tashahhud and sends blessings upon the Prophet, may Allah bless him and grant him peace, then... etc. what was mentioned in the previous manner. These are the manners that are established from the Prophet, may Allah bless him and grant him peace, explicitly from him. Other types can be added to them, by decreasing from every type of them whatever number of Rak'ahs he wishes until he restricts himself to one Rak'ah, acting upon his saying, may Allah bless him and grant him peace, mentioned previously: \"So whoever wishes let him perform Witr with five, and whoever wishes let him perform Witr with three, and whoever wishes let him perform Witr with one\" (1). So these five and three, if he wishes he prays them with one sitting and one Taslim as in the second description, and if he wishes he makes Taslim from every two Rak'ahs as in the third description and others, and it is better (2).",
    "foot_note": "1. 1 See Paragraph 8 p. 22. 2 Important Benefit: Ibn Khuzaymah said in his \"Sahih\" 2/194 after mentioning the hadith of Aisha and others regarding some of the mentioned manners: So it is permissible for a person to pray whatever number he loves of the prayer from what was narrated from the Prophet, may Allah bless him and grant him peace, that he prayed them, and upon the form that was narrated from the Prophet, may Allah bless him and grant him peace, that he prayed it. There is no restriction on anyone in any of it. I say: This, by its implication, is in complete agreement with what we chose of adhering to the number which is authentic from him, may Allah bless him and grant him peace, and not increasing upon it. So praise be to Allah for His success, and I ask Him for increase of His favor.",
    "book_id": "11307",
    "new_page_number": 30
  },
  {
    "serial_number": "4638395",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 30,
    "volume_number": 1,
    "text": "As for the prayer of five and three with a sitting between every two Rak'ahs without Taslim, we did not find it established from him. The default is permissibility, but since the Prophet, may Allah bless him and grant him peace, forbade performing Witr with three, and justified that by his saying: \"And do not resemble the Maghrib prayer\" (1); then it is necessary for whoever prays Witr as three to depart from this resemblance. That is done in two ways: The First: Taslim between the Shaf' (even) and the Witr (odd), and it is the stronger and better. The Other: That he does not sit between the Shaf' and the Witr. And Allah the Exalted knows best. Recitation in the three (Rak'ahs) of Witr: 14- It is from the Sunnah to read in the first Rak'ah of the three of Witr: {Exalt the name of your Lord, the Most High} [Al-A'la], and in the second: {Say, \"O disbelievers\"} [Al-Kafirun], and in the third: {Say, \"He is Allah, [who is] One\"} [Al-Ikhlas], and he adds to it sometimes: {Say, \"I seek refuge in the Lord of daybreak\"} [Al-Falaq] and: {Say, \"I seek refuge in the Lord of mankind\"} [An-Nas]. It has been authentically reported from him, may Allah bless him and grant him peace, that he read once in a Rak'ah of Witr one hundred verses from An-Nisa (2).",
    "foot_note": "1. 1 Narrated by Al-Tahawi and Al-Darqutni and others. See \"At-Tarawih\" (99 and 110). 2 Narrated by Al-Nasa'i and Ahmad with an authentic chain.",
    "book_id": "11307",
    "new_page_number": 31
  },
  {
    "serial_number": "4638396",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 31,
    "volume_number": 1,
    "text": "The Qunut Supplication and its Place: 15- After finishing the recitation and before bowing (Ruku'), he sometimes performs Qunut with the supplication which the Prophet, may Allah bless him and grant him peace, taught his grandson Al-Hasan bin Ali, may Allah be pleased with them both, which is: \"O Allah, guide me among those You have guided, grant me well-being among those You have granted well-being, take me into Your care among those You have taken into Your care, bless me in what You have given, and protect me from the evil of what You have decreed. For indeed You decree and none decrees upon You. Indeed, he whom You have befriended is not humiliated, and he whom You have opposed is not honored. Blessed are You, our Lord, and Exalted. There is no refuge from You except to You\" (1). He sends blessings upon the Prophet, may Allah bless him and grant him peace, sometimes, due to what comes after it (2). 16- There is no harm in placing the Qunut after the Ruku', and adding to it cursing the disbelievers, sending blessings upon the Prophet, may Allah bless him and grant him peace, and praying for the Muslims in the second half of Ramadan, due to the establishment of that from the Imams in the era of Umar, may Allah be pleased with him. For it came in the end of the hadith of Abdur-Rahman bin Abd al-Qari mentioned previously p. 26-27:",
    "foot_note": "1. 1 Narrated by Abu Dawud and Al-Nasa'i and others with an authentic chain. See \"Sifat as-Salah\" p. 95 and 96, 7th edition. 2 And see my comment on \"Fadl as-Salah 'ala an-Nabi\" (Merit of sending blessings on the Prophet) p. 33, and \"Talkhis Sifat Salat an-Nabi\" p. 45.",
    "book_id": "11307",
    "new_page_number": 32
  },
  {
    "serial_number": "4638397",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 32,
    "volume_number": 1,
    "text": "And they used to curse the disbelievers in the middle (of the month): O Allah, fight the disbelievers who obstruct Your path, and deny Your messengers, and do not believe in Your promise. Cause disagreement between their words, and cast terror into their hearts, and cast upon them Your punishment and torment, O God of Truth. Then he sends blessings upon the Prophet, may Allah bless him and grant him peace, and prays for the Muslims for what good he can, then seeks forgiveness for the believers. He said: And he used to say when he finished cursing the disbelievers, his sending blessings upon the Prophet, his seeking forgiveness for the believing men and women, and his asking: \"O Allah, You alone do we worship, and to You we pray and prostrate, and towards You we strive and hasten (1), and we hope for Your mercy, our Lord, and we fear Your earnest punishment. Indeed, Your punishment will overtake those whom You have opposed.\" Then he says Takbir and goes down prostrating (2). What he says at the end of Witr: 17- From the Sunnah is to say at the end of his Witr before the Taslim or after it: \"O Allah, I seek refuge in Your pleasure from Your anger, and in Your granting of well-being from Your punishment, and I seek refuge in You from You. I cannot enumerate praise upon You; You are as You have praised Yourself\" (3).",
    "foot_note": "1. 1 Meaning: We hurry. 2 Narrated by Ibn Khuzaymah in his \"Sahih\" 2/155-156/1100. 3 \"Sahih Abi Dawud\" 1282 and \"Al-Irwa'\" 430.",
    "book_id": "11307",
    "new_page_number": 33
  },
  {
    "serial_number": "4638398",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 33,
    "volume_number": 1,
    "text": "18- And if he makes Taslim from Witr, he says: Glory be to the King, the Holy (Subhan al-Malik al-Quddus), Glory be to the King, the Holy, Glory be to the King, the Holy, \"three times\", extending his voice with it, and raising the third (1). The Two Rak'ahs after it: 19- He may pray two Rak'ahs, due to their establishment from the Prophet, may Allah bless him and grant him peace, in action (2). Rather, he ordered his Ummah with them, saying: \"Indeed this journey is exertion and heaviness. So if one of you performs Witr, let him bow two Rak'ahs. If he wakes up [then good], otherwise they will be for him\" (3). 20- The Sunnah is to read in them: {When the earth is shaken} [Az-Zalzalah] and: {Say, \"O disbelievers\"} [Al-Kafirun] (4).",
    "foot_note": "1. 1 \"Sahih Abi Dawud\" 1284. 2 Narrated by Muslim and others. See \"At-Tarawih\" p. 108-109. 3 Narrated by Ibn Khuzaymah in his \"Sahih\" and Al-Darimi and others. It is graduated in \"Al-Sahihah\". I had hesitated regarding these two Rak'ahs for a long period of time, but when I came across this noble Prophetic command, I hastened to adopt it. And I knew that his saying, may Allah bless him and grant him peace: \"Make the last of your prayer at night Witr\" is only for preference, not obligation. This is the saying of Ibn Nasr 130. 4 Narrated by Ibn Khuzaymah 1104, 1105 from the hadith of Aisha and Anas, may Allah be pleased with them both, with two chains strengthening each other. See \"Sifat as-Salah\" p. 124.",
    "book_id": "11307",
    "new_page_number": 34
  },
  {
    "serial_number": "4638399",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 34,
    "volume_number": 1,
    "text": "I'tikaf (Seclusion in the Mosque). Its Legitimacy: 1- I'tikaf is a Sunnah in Ramadan and other than it from the days of the year. The basis for that is His saying, Exalted is He: {While you are secluded (Akifun) in the mosques} [Al-Baqarah: 187], along with the concurrence of authentic hadiths regarding his I'tikaf, may Allah bless him and grant him peace, and the mass transmission (Tawatur) of narrations from the Salaf regarding that. They are mentioned in \"Al-Musannaf\" of Ibn Abi Shaybah and Abd al-Razzaq (1). It is established that the Prophet, may Allah bless him and grant him peace, performed I'tikaf in the last ten of Shawwal (2), and that Umar said to the Prophet, may Allah bless him and grant him peace: I vowed in the Jahiliyyah (Pre-Islamic Era) to perform I'tikaf for a night in the Sacred Mosque? He said: \"So fulfill your vow\", [so he performed I'tikaf for a night] (3).",
    "foot_note": "1. 1 There was here in the previous edition a hadith regarding the merit of \"whoever performs I'tikaf for a day...\", so I deleted it because its weakness became clear to me, after I graduated it and spoke about it in detail in \"Silsilat al-Ahadith al-Da'ifah\" 5347. I uncovered in it its defect which had been hidden from me, and from Al-Haythami before me! 2 It is a piece of a hadith of Aisha, narrated by the two Sheikhs and Ibn Khuzaymah in their \"Sahihs\". It is graduated in \"Sahih Abi Dawud\" 2127. 3 Narrated by the two Sheikhs and Ibn Khuzaymah. The addition is for Al-Bukhari in a narration as in his \"Mukhtasar\" 995. It is graduated in \"Sahih Abi Dawud\" also 2136-2137.",
    "book_id": "11307",
    "new_page_number": 35
  },
  {
    "serial_number": "4638400",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 35,
    "volume_number": 1,
    "text": "2- It is most emphasized in Ramadan due to the hadith of Abu Hurairah: The Messenger of Allah, may Allah bless him and grant him peace, used to perform I'tikaf in every Ramadan for ten days. Then when it was the year in which he was taken (died), he performed I'tikaf for twenty days (1). 3- Its best time is the end of Ramadan, because the Prophet, may Allah bless him and grant him peace, used to perform I'tikaf in the last ten days of Ramadan until Allah, Mighty and Majestic, took his soul (2). Its Conditions: 1- It is not legislated except in the mosques due to His saying, Exalted is He: {And do not associate with them (3) while you are secluded in the mosques} (4). And the Lady Aisha said:",
    "foot_note": "1. 1 Narrated by Al-Bukhari and Ibn Khuzaymah in their \"Sahihs\". It is graduated in the previous source (2126-2130). 2 Narrated by the two Sheikhs and Ibn Khuzaymah 2223. It is graduated in \"Al-Irwa'\" 966 and \"Sahih Abi Dawud\" 2125. 3 Meaning do not have intercourse with them. Ibn Abbas said: Mubasharah, Mulamasah, and Mass all mean intercourse, but Allah, Mighty and Majestic, uses metonymy for what He wills with what He wills. Narrated by Al-Bayhaqi 4/321 with a chain whose men are trustworthy. 4 Al-Bukhari: 187. Imam Al-Bukhari used this verse as evidence for what we mentioned. Al-Hafiz said: The aspect of evidence from the verse is that if it were valid in other than the mosque, the prohibition of Mubasharah would not have been specific to it, because intercourse contradicts I'tikaf by consensus. So it is known from the mention of mosques that the intended meaning is that I'tikaf cannot be except in them.",
    "book_id": "11307",
    "new_page_number": 36
  },
  {
    "serial_number": "4638401",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 36,
    "volume_number": 1,
    "text": "The Sunnah for the one performing I'tikaf (Mu'takif) is that he does not leave except for his need which is unavoidable for him, nor does he visit a sick person, nor does he touch his wife, nor does he associate with her, and there is no I'tikaf except in a mosque of congregation, and the Sunnah for the one who performs I'tikaf is to fast (1). 2- It should be a Congregational Mosque (Masjid Jami') so that he is not forced to leave it for the Friday Prayer, for leaving for it is obligatory upon him, due to the saying of Aisha in a narration from her in her hadith: \"...and there is no I'tikaf except in a Congregational Mosque\" (2). Then I came across an explicit authentic hadith restricting the \"Mosques\" mentioned in the verse to the Three Mosques: The Sacred Mosque, the Prophetic Mosque, and Al-Aqsa Mosque. It is his saying, may Allah bless him and grant him peace: \"There is no I'tikaf except in the Three Mosques\" (3).",
    "foot_note": "1. 1 Narrated by Al-Bayhaqi with an authentic chain, and Abu Dawud with a good chain, and the coming narration from Aisha is his. It is graduated in \"Sahih Abi Dawud\" 2135 and \"Al-Irwa'\" 966. 2 Al-Bayhaqi narrated from Ibn Abbas who said: The most hated of matters to Allah are innovations (Bida'), and among innovations is I'tikaf in the mosques located in the houses. 3 Narrated by Al-Tahawi, Al-Isma'ili, and Al-Bayhaqi with an authentic chain from Hudhayfah bin al-Yaman, may Allah be pleased with him. It is graduated in \"Al-Sahihah\" number 2786, along with the Athar agreeing with it from what we mentioned above, and all of them are authentic.",
    "book_id": "11307",
    "new_page_number": 37
  },
  {
    "serial_number": "4638402",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 37,
    "volume_number": 1,
    "text": "This was the opinion of those among the Salaf whom I became aware of: Hudhayfah bin al-Yaman, Sa'id bin al-Musayyib, and Ata', except that he did not mention Al-Aqsa Mosque. Others said: In a Congregational Mosque absolutely. Others disagreed and said: Even in the mosque of his house. It is not hidden that taking what agrees with the hadith among them is what should be resorted to. And Allah, Glory be to Him and the Exalted, knows best. 3- The Sunnah for the one who performs I'tikaf is to fast as preceded from Aisha, may Allah be pleased with her (1). What is permissible for the Mu'takif: 1- It is permissible for him to leave it to relieve himself, and to stick his head out of the mosque to be washed and combed. Aisha, may Allah be pleased with her, said:",
    "foot_note": "1. 1 Narrated by Al-Bayhaqi with an authentic chain, and Abu Dawud with a good chain. Imam Ibn al-Qayyim said in \"Zad al-Ma'ad\": It has not been transmitted from the Prophet, may Allah bless him and grant him peace, that he performed I'tikaf while not fasting. Rather, Aisha said: There is no I'tikaf except with fasting. And He, the Glorified, did not mention I'tikaf except with fasting, nor did he, may Allah bless him and grant him peace, do it except with fasting. So the preponderant view in evidence, which is the view of the majority of the Salaf, is that fasting is a condition for I'tikaf. This is what Sheikh al-Islam Abu al-Abbas Ibn Taymiyyah used to prefer. I say: It results from this that it is not legislated for the one who intends the mosque for prayer or other than it to intend I'tikaf for the duration of his stay in it, and this is what Sheikh al-Islam explicitly stated in \"Al-Ikhtiyarat\".",
    "book_id": "11307",
    "new_page_number": 38
  },
  {
    "serial_number": "4638403",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 38,
    "volume_number": 1,
    "text": "Even if the Messenger of Allah, may Allah bless him and grant him peace, were to bring his head in to me while he was [in I'tikaf] in the mosque, [and I was in my room], I would comb him, [and in a narration: so I wash it even though between me and him is only the threshold of the door and I am menstruating]. And he used not to enter the house except for [human] need, when he was in I'tikaf (1). 2- It is permissible for the Mu'takif and others to perform ablution (Wudu) in the mosque, due to the saying of a man who served the Prophet, may Allah bless him and grant him peace: The Prophet, may Allah bless him and grant him peace, performed a light ablution in the mosque (2). 3- He may set up a small tent in the back of the mosque to seclude himself in, because Aisha, may Allah be pleased with her, used to pitch a Khibaa (tent) (3) for the Prophet, may Allah bless him and grant him peace, when he performed I'tikaf, and that was by his command, may Allah bless him and grant him peace (4).",
    "foot_note": "1. 1 Narrated by the two Sheikhs, Ibn Abi Shaybah, and Ahmad. The first addition is theirs. It is graduated in \"Sahih Abi Dawud\" 2131-2132. 2 Narrated by Al-Bayhaqi with a good chain, and Ahmad 5/364 in summary with an authentic chain. 3 The Khibaa is one of the Arab houses made of fur or wool, not of hair, and it is on two or three poles. \"Nihayah\". 4 Narrated by the two Sheikhs from the hadith of Aisha. Her action is in Al-Bukhari, and the command is in Muslim. Its graduation preceded p. 34 Comment 2.",
    "book_id": "11307",
    "new_page_number": 39
  },
  {
    "serial_number": "4638404",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 39,
    "volume_number": 1,
    "text": "And he performed I'tikaf once in a Turkish dome (1) having a mat upon its threshold (Sudda) (2). Permissibility of a woman's I'tikaf and her visiting her husband in the mosque: 4- It is permissible for a woman to visit her husband while he is in his place of I'tikaf, and for him to see her off to the door of the mosque, due to the saying of Safiyyah, may Allah be pleased with her: \"The Prophet, may Allah bless him and grant him peace, was in I'tikaf [in the mosque in the last ten days of Ramadan], so I came to him visiting him at night, [and his wives were with him, then they departed]. So I spoke to him [for an hour], then I stood up to turn back (go home). [He said: Do not rush until I depart with you]. So he stood up with me to return me—and her dwelling was in the house of Usama bin Zaid—[until when he was at the door of the mosque which is at the door of Umm Salamah],",
    "foot_note": "1. 1 Meaning a small dome. The Sudda is like a shade over the door to protect the door from rain. The meaning is that he placed a piece over its opening so that no one's sight would fall into it, as Al-Sindi said. It is more appropriate to say: So that the mind of the Mu'takif is not distracted by whoever might pass in front of him, to achieve the purpose of I'tikaf and its spirit, as Imam Ibn al-Qayyim said: \"Opposite to what the ignorant do of taking the place of I'tikaf as a place of gathering and bringing visitors and engaging in chats among themselves. This is one color, and the Prophetic I'tikaf is another color. And Allah is the Grantor of success.\" 2 It is part of a hadith of Abu Sa'id al-Khudri, narrated by Muslim and Ibn Khuzaymah in their \"Sahihs\". It is graduated in \"Sahih Abi Dawud\" 1251.",
    "book_id": "11307",
    "new_page_number": 40
  },
  {
    "serial_number": "4638405",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 40,
    "volume_number": 1,
    "text": "two men from the Ansar passed by. When they saw the Prophet, may Allah bless him and grant him peace, they hastened away. So the Prophet, may Allah bless him and grant him peace, said: \"On your way (slow down); she is Safiyyah bint Huyayy.\" They said: Glory be to Allah! O Messenger of Allah! He said: \"Indeed Satan runs in the human being like the running of blood, and indeed I feared that he might cast evil into your hearts,\" or he said: \"something\" (1). Rather, it is permissible for her to perform I'tikaf with her husband, or alone, due to the saying of Aisha, may Allah be pleased with her: A woman suffering from Istihadah (non-menstrual bleeding) performed I'tikaf with the Messenger of Allah, may Allah bless him and grant him peace—\"and in a narration she is Umm Salamah\" from his wives—so she used to see red and yellow (discharge). Perhaps we put the basin (Tast) under her while she was praying (2). And he said also: The Prophet, may Allah bless him and grant him peace, used to perform I'tikaf in the last ten days of Ramadan until Allah took his soul, then his wives performed I'tikaf after him (3).",
    "foot_note": "1. 1 Narrated by the two Sheikhs, and Abu Dawud, and the last addition is his. It is graduated in \"Sahih Abi Dawud\" 2133 and 2134. 2 Narrated by Al-Bukhari. It is graduated in \"Sahih Abi Dawud\" 2138. The other narration is for Sa'id bin Mansur as in \"Al-Fath\" 4/281, but Al-Darimi named her 1/22: Zainab. And Allah knows best. 3 Narrated by the two Sheikhs and others. Its graduation preceded p. 35 Comment number 2.",
    "book_id": "11307",
    "new_page_number": 41
  },
  {
    "serial_number": "4638406",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Night Prayer of Ramadan: Its Merit, How to Perform It, the Legitimacy of Congregation in It, Along with a Valuable Research on I'tikaf",
    "edition": "Second Edition 1404 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 41,
    "volume_number": 1,
    "text": "5- And sexual intercourse invalidates it due to His saying, Exalted is He: {And do not associate with them while you are secluded in the mosques}. Ibn Abbas said: If the Mu'takif has intercourse, his I'tikaf is invalid, and he must restart (1). There is no expiation (Kaffarah) upon him due to the lack of report of that from the Prophet, may Allah bless him and grant him peace, and his Companions. Glory be to You, O Allah, and with Your praise. I bear witness that there is no deity worthy of worship except You. I ask Your forgiveness and I repent to You. The reviewing, refining, and adding of new benefits to it was completed by the pen of its author at the dawn of Sunday, 26 Rajab, year 1406 AH. And may Allah send blessings upon Muhammad, the Unlettered Prophet, and upon his family and his companions and grant peace.",
    "foot_note": "1. 1 Narrated by Ibn Abi Shaybah 3/92 and Abd al-Razzaq 4/363 with an authentic chain. The meaning of his saying: 'He restarts' is that he repeats his I'tikaf.",
    "book_id": "11307",
    "new_page_number": 42
  }
]