[
  {
    "serial_number":"4962081",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":0,
    "volume_number":1,
    "text":"القسم: الرقائق والآداب والأذكار الكتاب : النجوم الزاهرات في فضائل الباقيات الصالحات المؤلف : عبد المنان التالبي عدد الصفحات : 72 [ البحث غير مطبوع ] تاريخ النشر بالشاملة : 1 ربيع الأول 1442\nالكتاب : النجوم الزاهرات في فضائل الباقيات الصالحات المؤلف : عبد المنان التالبي عدد الصفحات : 72 [ البحث غير مطبوع ] تاريخ النشر بالشاملة : 1 ربيع الأول 1442\nالمؤلف : عبد المنان التالبي عدد الصفحات : 72 [ البحث غير مطبوع ] تاريخ النشر بالشاملة : 1 ربيع الأول 1442\nعدد الصفحات : 72 [ البحث غير مطبوع ] تاريخ النشر بالشاملة : 1 ربيع الأول 1442\n[ البحث غير مطبوع ] تاريخ النشر بالشاملة : 1 ربيع الأول 1442\nتاريخ النشر بالشاملة : 1 ربيع الأول 1442",
    "foot_note":"None",
    "book_id":"72"
  },
  {
    "serial_number":"4962082",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":1,
    "volume_number":1,
    "text":" المبحث الأول: الباقيات الصالحات في الكتاب والسنة والأثر - الباقيات الصالحات هي تلك الكلمات المباركات التي ورد ذكرها في نصوص الكتاب الكريم، واستفاضت في ذكر فضلها ومنزلتها نصوص السنة النبوية المطهرة، ونقل عن أئمة السلف وأهل التأويل الكثير من الآثار عنها، وعليه فإن الحديث عن هذا المبحث في خمسة مطالب: - المطلب الأول: الآيات الكريمة والأحاديث الشريفة الواردة في الباقيات الصالحات. - المطلب الثاني: سبب نزول آية الباقيات الصالحات. - المطلب الثالث: آيات الباقيات الصالحات تفسيراً وبياناً. - المطلب الرابع: معاني الباقيات الصالحات. - المطلب الخامس: إضافة الحوقلة إلى الباقيات الصالحات.",
    "foot_note":"None",
    "book_id":"72"
  },
  {
    "serial_number":"4962083",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":2,
    "volume_number":1,
    "text":" المطلب الأول: الآيات الكريمة والأحاديث الشريفة الواردة في الباقيات الصالحات وردت العديد من نصوص الكتاب والسنة فيها ذكر الباقيات الصالحات وسأذكرها من خلال ثلاثة فروع: ـ  الفرع الأول: ما ورد من الآيات الكريمة في ذكر الباقيات الصالحات: ورد ذكر الباقيات الصالحات في القرآن الكريم في موضعين: الموضع الأول: في سورة الكهف: قال تعالى: [الْمَالُ وَالْبَنُونَ زِينَةُ الْحَيَاةِ الدُّنْيَا وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَخَيْرٌ أَمَلًا (46)] (1) . الموضع الثاني: في سورة مريم: قال تعالى [وَيَزِيدُ اللَّهُ الَّذِينَ اهْتَدَوْا هُدًى وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَخَيْرٌ مَرَدًّا (76)] (2) .  الفرع الثاني: ما ورد من الأحاديث النبوية الشريفة في ذكر الباقيات الصالحات: وردت العديد من الأحاديث النبوية الشريفة في دواوين السنة المطهرة فيها ذكر الباقيات الصالحات، وقد آثرت الاعتماد على ما صح منها إذ إن في الصحيح غنية عن الضعيف من هذه الأحاديث: أ) حديث أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (خذوا جُنَّتكم قالوا! يا رسول الله عدو قد حضر؟ قال: \"لا، ولكن جُنَّتُكم من النار، قولوا: \"سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر \"فإنهن يأتين يوم القيامة مُجَنَّبات ومُعَقِّبات، وهن الباقيات الصالحات) (3) . جُنَّتكم: بضم الجيم وتشديد النون: أي: ما يستركم ويقيكم. مُجَنَّبات: بفتح النون، أي: مقدمات أمامكم. معقبات: بكسر القاف المشددة، أي تعقبكُم وتأتي من ورائكم (4) . قال الحافظ المناوي رحمه الله: \"سميت معقبات، لأنها عادت مرة بعد أخرى وكل من عمل عملاً ثم عاد إليه فقد عقب\" (5) .",
    "foot_note":"1. ((الكهف (46). \n2. مريم (76). \n3. رواه النسائي في السنن الكبرى (6\/ 212) واللفظ له، والحاكم في المستدرك (1\/ 725) وقال هذا حيث صحيح على شرط مسلم ولم يخرجاه. وحسنه الألباني في صحيح الترغيب والترهيب (2\/ 112) برقم (1567). \n4. الترغيب والترهيب للمنذري (2\/ 281). \n5. التيسير بشرح الجامع الصغير (1\/ 1041)",
    "book_id":"72"
  },
  {
    "serial_number":"4962084",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":3,
    "volume_number":1,
    "text":"ب) حديث أبي هريرة رضي الله عنه أيضاًـ قال: قال رسول الله صلى الله عليه وسلم: \"سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر من الباقيات الصالحات\" (1) . ج) حديث الحارث مولى عثمان رضي الله عنه قال: \"جلس عثمان يوماً وجلسنا معه، فجاءه المؤذن فدعا بماء في إناء أظنه سيكون فيه مد، فتوضأ ثم قال: رأيت رسول الله صلى الله عليه وسلم يتوضأ وضوئي هذا، ثم قال: \" من توضأ وضوئي هذا ثم قال: فصلى صلاة الظهر غفر له ما كان بينها وبين الصبح، ثم صلى العصر غفر له ما بينها وبين صلاة الظهر ثم صلى المغرب غفر له ما بينها وبين صلاة العصر، ثم صلى العشاء غفر له ما بينها وبين صلاة المغرب، ثم لعله أن يبيت يتمرغ ليلته، ثم إن قام فتوضأ وصلى الصبح غفر له ما بينها وبين صلاة العشاء، وهن الحسنات يذهبن السيئات، قالوا هذه الحسنات فما الباقيات يا عثمان؟ قال: هن. لا إله إلا الله، وسبحان الله، والحمد لله، والله أكبر، ولا حول ولا قوة إلا بالله\" (2) . د) حديث أبي سعيد الخدر ي ــ رضي الله عنه ــ عن رسول الله صلى الله عليه وسلم قال: \"استكثروا من الباقيات الصالحات، قيل وما هي يا رسول الله؟ قال: الملَّة قيل وما هي يا رسول الله؟ قال: الملة، قيل وما هي يا رسول الله؟ قال: \"التكبير والتهليل، والتسبيح، والتحميد، ولا حول ولا قوة إلا بالله\" (3) . هـ) حديث النعمان بن بشيرـ رضي الله عنه قال: خرج علينا رسول الله صلى الله عليه وسلم ونحن في المسجد بعد صلاة العشاء، فرفع بصره إلى السماء ثم خفض حتى ظننا أنه قد حدث في السماء شيء، فقال: \"ألا إنه سيكون بعدي أمراء يكذبون ويظلمون، فمن صدقهم بكذبهم، ومالأهم على ظلمهم، فليس مني ولا أنا منه، ومن لم يصدقهم بكذبهم، ولم يمالئهم على ظلمهم، فهو مني وأنا منه، ألا وإن دم المسلم كفارته، ألا وإن سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر، هن الباقيات الصالحات\" (4) .",
    "foot_note":"1. أخرجه ابن جرير في التفسير (15\/ 166)، وحسنه الألباني في السلسلة الصحيحة (13\/ 67) برقم (3264). \n2. أخرجه أحمد في المسند (1\/ 537) برقم (513)، وحسنه شعيب الأرنؤوط في تحقيقه للمسند. \n3. أخرجه أحمد في المسند (18\/ 241) برقم (11713). قال الأرنؤوط حسن لغيره، وهذا إسناد ضعيف. وصححه أبو محمد عبد الحق رحمه الله قاله القرطبي في تفسيره (10\/ 415). \n4. أخرجه أحمد في المسند (30\/ 299) برقم (18353)، قال الأرنؤوط: صحيح لغيره وهذا إسناد ضعيف لإبهام الرجل الراوي عن النعمان بن بشير، وبقية رجاله ثقات.",
    "book_id":"72"
  },
  {
    "serial_number":"4962085",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":4,
    "volume_number":1,
    "text":"و) حديث عبد الله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"إن الله قسم بينكم أخلاقكم، كما قسم بينكم أرزاقكم، وإن الله يعطي الدنيا من يحب ومن لا يحب، ولا يعطي الإيمان إلا من أحب، فمن ضَنَّ بالمال أن ينفقه، وخاف العدو أن يجاهده، وهاب الليل أن يكابده، فليكثر من قول \"سبحان الله، والحمد لله ولا إله إلا الله، والله أكبر\" (1) . ضن: بالضاد المعجمة. قال الحافظ المناوي رحمه الله: (بتشديد النون أي بخل) (2) .  الفرع الثالث: ما ورد من الآثار في ذكر الباقيات الصالحات منها: أ- أثر عمارة بن صياد، عن سعيد بن المسيب، أنه سمعه يقول: في الباقيات الصالحات: \"إنها قول العبد، الله أكبر وسبحان الله، والحمد لله، ولا إله إلا الله، ولا حول ولا قوة إلا بالله\" (3) . ب- ما أخرجه عبد الرزاق بسنده الصحيح عن قتادة، في قوله تعالى: (والباقيات الصالحات): قال: \"لا إله الله، والله أكبر، والحمد لله، وسبحان الله، هن الباقيات الصالحات\" (4) .",
    "foot_note":"1. الأدب المفرد للبخاري (1\/ 104) برقم (275)، صححه الألباني في السلسلة الصحيحة (6\/ 213) برقم (2714) وفي رواية عند البيهقي في شعب الإيمان (12\/ 119) برقم (599) بزيادة (فإنهن مقدمات مُجَنَّبات ومُعَقِّبات، وهن الباقيات الصالحات). \n2. التيسير بشرح الجامع الصغير (1\/ 225). \n3. موطأ مالك (2\/ 295) برقم (716). \n4. موسوعة الصحيح المسبور من التفسير بالمأثور أ. د \/حكمت بن بشير ياسين (3\/ 350).",
    "book_id":"72"
  },
  {
    "serial_number":"4962086",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":5,
    "volume_number":1,
    "text":" المطلب الثاني: سبب نزول آية الباقيات الصالحات قال ابن جرير الطبري: \"وهذه الآيات من لدن قوله تعالى: [وَاتْلُ مَا أُوحِيَ إِلَيْكَ مِنْ كِتَابِ رَبِّكَ … ] إلى هذا الموضع [الْمَالُ وَالْبَنُونَ زِينَةُ الْحَيَاةِ الدُّنْيَا وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَخَيْرٌ أَمَلًا (46)] (1) ذكر أنها نزلت في (عيينة بن حصن والأقرع بن حابس) (2) . ثم ذكر ابن جرير بسنده من قال بذلك. فقال: عن خباب في قول الله تعالى: [وَلَا تَطْرُدِ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ مَا عَلَيْكَ مِنْ حِسَابِهِمْ مِنْ شَيْءٍ وَمَا مِنْ حِسَابِكَ عَلَيْهِمْ مِنْ شَيْءٍ فَتَطْرُدَهُمْ فَتَكُونَ مِنَ الظَّالِمِين] (3) قال: \"جاء الأقرع بن حابس التميمي، وعيينة بن حصن الفزاري، فوجدوا النبي صلى الله عليه وسلم قاعداً مع بلال وصهيب وعمار وخباب في أناس من الضعفاء من المؤمنين، فلما رأوهم حوله حقروهم، فأتوه فقالوا: إنا نحب أن تجعل لنا منك مجلساً تعرف لنا العرب به فضلنا، فإن وفود العرب تأتيك فنستحيي أن ترانا العرب مع هؤلاء الأعبد، فإذا نحن جئناك فأقمهم عنا فإذا نحن فرغنا فاقعد معهم إن شئت، قال نعم، قالوا: فاكتب لنا عليك بذلك كتاباً، قال: فدعا بالصحيفة ودعا علياً ليكتب، قال: ونحن قعود في ناحية إذ نزل جبريل بهذه الآية [وَلَا تَطْرُدِ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ مَا عَلَيْكَ مِنْ حِسَابِهِمْ مِنْ شَيْءٍ وَمَا مِنْ حِسَابِكَ عَلَيْهِمْ مِنْ شَيْءٍ فَتَطْرُدَهُمْ فَتَكُونَ مِنَ الظَّالِمِينَ) (4) ثم قال: [وَكَذَلِكَ فَتَنَّا بَعْضَهُمْ بِبَعْضٍ لِيَقُولُوا أَهَؤُلَاءِ مَنَّ اللَّهُ عَلَيْهِمْ مِنْ بَيْنِنَا أَلَيْسَ اللَّهُ بِأَعْلَمَ بِالشَّاكِرِينَ] (5)",
    "foot_note":"1. ((الكهف (46). \n2. جامع البيان في تأويل القرآن (18\/ 31). \n3. ((الأنعام (52). \n4. الأنعام (52). \n5. ((الأنعام (53).",
    "book_id":"72"
  },
  {
    "serial_number":"4962087",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":6,
    "volume_number":1,
    "text":"ثم قال [وَإِذَا جَاءَكَ الَّذِينَ يُؤْمِنُونَ بِآيَاتِنَا فَقُلْ سَلَامٌ عَلَيْكُمْ … كَتَبَ رَبُّكُمْ عَلَى نَفْسِهِ الرَّحْمَةَ أَنَّهُ مَنْ عَمِلَ مِنْكُمْ سُوءًا بِجَهَالَةٍ ثُمَّ تَابَ مِنْ بَعْدِهِ وَأَصْلَحَ فَأَنَّهُ غَفُورٌ رَحِيمٌ] (1) فألقى رسول الله صلى الله عليه وسلم الصحيفة من يده، ثم دعانا فأتيناه وهو يقول: [سَلَامٌ عَلَيْكُمْ … كَتَبَ رَبُّكُمْ عَلَى نَفْسِهِ الرَّحْمَةَ أَنَّهُ مَنْ عَمِلَ مِنْكُمْ سُوءًا بِجَهَالَةٍ ثُمَّ تَابَ مِنْ بَعْدِهِ وَأَصْلَحَ فَأَنَّهُ غَفُورٌ رَحِيمٌ]، فكنا نقعد معه، فإذا أراد أن يقوم قام وتركنا، فأنزل الله تعالى: [وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ وَلَا تَعْدُ عَيْنَاكَ عَنْهُمْ تُرِيدُ زِينَةَ الْحَيَاةِ الدُّنْيَا وَلَا تُطِعْ مَنْ أَغْفَلْنَا قَلْبَهُ عَنْ ذِكْرِنَا وَاتَّبَعَ هَوَاهُ وَكَانَ أَمْرُهُ فُرُطًا] قال: \"فكان رسول الله صلى الله عليه وسلم يقعد معنا بعد، فإذا بلغ الساعة التي يقوم فيها، قمنا وتركناه حتى يقوم\" (2) . قال الحافظ ابن كثير: \"هذا حديث غريب فإن هذه الآية مكية والأقرع بن حابس وعيينة إنما أسلما بعد الهجرة بدهر\" (3) . قال الشيخ أحمد شاكر بعد إيراده لكلام الحافظ ابن كثير الآنف. وهذا هو الحق إن شاء الله (4) . قال أبو سعيد الملائي: \" .. لكن اتفق العلماء على أن هذه السورة مكية، وإنما كان مجيء عيينة بن حصن والأقرع بن حابس والمؤلفة قلوبهم إلى النبي الله صلى الله عليه وسلم وخطابهم له بالمدينة هذا ما لا ريب فيه، فالظاهر والله أعلم أن هذه الآيات نزلت في عظماء المشركين من أهل مكة الذين عابوا النبي صلى الله عليه وسلم ملازمة الفقراء المؤمنين له كصهيب وبلال رضي الله عنهم، وقالوا له اطرد هؤلاء عنك حتى نأتيك لا في عيينه والأقرع، أو تكون هذه الآيات مدنية، والأول أقرب وأصح لا تفاقهم على كون السورة مكية .. \" (5) .",
    "foot_note":"1. ((الأنعام (54). \n2. تفسير الطبري (11\/ 376، 377). \n3. تفسير الحافظ ابن كثير (3\/ 260). \n4. تفسير الطبري (11\/ 377). \n5. جزء في تفسير الباقيات الصالحات (1\/ 17).",
    "book_id":"72"
  },
  {
    "serial_number":"4962088",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":7,
    "volume_number":1,
    "text":" المطلب الثالث: آيتا الباقيات تفسيراً وبياناً القرآن الكريم بحر لا ساحل له ولا عمق، ومن خلال هاتين الآيتين الكريمتين نحاول استعراض أقوال المفسرين وما حوته آيتا الباقيات الصالحات من لطائف ومعان تدل أعظم الدلالة على عظمة هذا القرآن وإعجازه وإيجازه من خلال ثلاثة فروع:  الفرع الأول: في تفسير قوله تعالى: [الْمَالُ وَالْبَنُونَ زِينَةُ الْحَيَاةِ الدُّنْيَا وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَخَيْرٌ أَمَلًا (46)] (1) .  أـ التفسير: - قال العلامة القرآني محمد الأمين الشنقيطي -رحمه الله تعالى-: \"والمراد من الآية الكريمة تنبيه الناس للعمل الصالح لئلا ينشغلوا بزينة الحياة الدنيا من المال والبنين عما ينفعهم في الآخرة عند الله من الأعمال الباقيات الصالحات\" (2) . - قال ابن عاشور -رحمه الله تعالى- في قوله تعالى: [الْمَالُ وَالْبَنُونَ زِينَةُ الْحَيَاةِ الدُّنْيَا وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَخَيْرٌ أَمَلًا (46)] (3) . قال: \"اعتراض أريد به الموعظة والعبرة للمؤمنين بأن ما فيه المشركون من النعمة من مال وبنين ما هو إلا زينة الحياة الدنيا التي علمتم أنها إلى زوال … \" (4) . - قال الشوكاني رحمه الله في قوله تعالى: [الْمَالُ وَالْبَنُونَ زِينَةُ الْحَيَاةِ الدُّنْيَا وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَخَيْرٌ أَمَلًا (46)] (5) : \"هذا رد على الرؤساء الذين كانوا يفتخرون بالمال والغنى والأبناء فأخبرهم سبحانه أن ذلك مما يتزين به في الدنيا لا مما ينفع في الآخرة … \" (6) .",
    "foot_note":"1. ((الكهف (46). \n2. أضواء البيان (3\/ 281). \n3. ((الكهف (46). \n4. ((التحرير والتنوير (15\/ 332). \n5. ((الكهف (46). \n6. فتح القدير (3\/ 414).",
    "book_id":"72"
  },
  {
    "serial_number":"4962089",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":8,
    "volume_number":1,
    "text":"- قال ابن عاشور رحمه الله في قوله: [الْمَالُ وَالْبَنُونَ زِينَةُ الْحَيَاةِ الدُّنْيَا وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَخَيْرٌ أَمَلًا (46)] (1) : \"صفتان جرتا على موصوف محذوف، أي الأعمال الصالحات الباقيات التي لا زوال لها أي لا زوال لخيرها وهو ثوابها الخالد فهي خير من زينة الحياة الدنيا التي هي غير باقية .. \" (2) . قال الشوكاني رحمه الله في قوله تعالى: [خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَخَيْرٌ أَمَلًا]: \"أي أفضل من هذه الزينة بالمال والبنين ثواباً وأكثر عائدة ومنفعة لأهلها.\" وخير أملا \" أي أفضل أملاً: أي أن هذه الأعمال الصالحة لأهلها من الأمل أفضل مما يؤمله أهل المال والبنين لأنهم ينالون بها في الآخرة أفضل مما كان يؤمله هؤلاء الأغنياء في الدنيا … \" (3) . قال ابن عاشور رحمه الله: \"ومعنى (وخير أملاً) أن أمل الآمل في المال والبنين إنما يأمل حصول أمر مشكوك في حصوله ومقصور على مدته. وأما الآمل لثواب الأعمال الصالحة فهو يأمل حصول أمر موعود به من صادق الوعد .. \" (4) .  ب- اللطائف القرآنية في الآية:  اللطيفة الأولى: قال ابن عاشور: \"كان مقتضى الظاهر في ترتيب الوصفين أن يقد م الصالحات على والباقيات لأنهما وإن كانا وصفين لموصوف محذوف إلا أن أعرفهما في وصفيه ذلك المحذوف هو الصالحات، لأنه قد شاع أن يقال الأعمال الصالحات ولا يقال الأعمال الباقيات .. ولكن خولف مقتضى الظاهر هنا فقدم الباقيات للتنبيه على أن ما ذكر قبله إنما كان مفصولاً لأنه ليس بباق وهو المال والبنون كقوله تعالى: [وَمَا الْحَيَاةُ الدُّنْيَا فِي الْآخِرَةِ إِلَّا مَتَاعٌ] (5) فكان هذا التقديم قاضياً لحق الإيجاز لإغنائه عن كلام محذوف تقديره أن ذلك زائل أو ما هو بباق والباقيات من الصالحات خير منه .. \" (6) .",
    "foot_note":"1. ((الكهف (46). \n2. التحرير والتنوير (15\/ 332). \n3. فتح القدير (3\/ 414) \n4. التحرير والتنوير (15\/ 334). \n5. الرعد (26). \n6. التحرير والتنوير (15\/ 333).",
    "book_id":"72"
  },
  {
    "serial_number":"4962090",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":9,
    "volume_number":1,
    "text":" اللطيفة الثانية: قال أبو حيان الأندلسي رحمه الله: \" .. لما ذكر مآل ما في الحياة الدنيا إلى الفناء أندرج فيه هذا الجزئي من كون المال والبنين زينة … وكل ما كان زينة الحياة الدنيا فهو سريع الانقضاء فالمال والبنون سريع الانقضاء ومن بديهة العقل أن ما كان كذلك يقبح بالعاقل أن يفتخر به أو يفرح بسببه\" (1) .  اللطيفة الثالثة: قال الإمام القرطبي رحمه الله: \"وإنما كان المال والبنون زينة الحياة الدنيا لأن في المال جمالاً ونفعاً وفي البنين قوة ودفعاً فصارا زينة الدنيا .. \" (2) . قال ابن عاشور رحمه الله: \"وتقديم المال على البنين في الذكر لأنه أسبق حضوراً لأذهان الناس، لأنه يرغب فيه الصغير والكبير والشاب والشيخ ومن له من الأولاد ما قد كفاه … \" (3) قال القاسمي رحمه الله: \"تقديم المال على البنين لعراقته فيما نيط به من الزينة والإمداد، ولكون الحاجة إليه أمس، ولأنه زينة بدونهم من غير عكس\" (4) .  اللطيفة الرابعة: قال القاسمي في محاسن التأويل: \"إفراد الزينة مع أنها مسندة إلى الاثنين، لما أنها مصدر في الأصل. أطلق على المفعول مبالغة. كأنها نفس الزينة. وإضافتها إلى الحياة اختصاصية؛ لأن زينتها مختصة بها\" (5) . قال القرطبي: \" (المال والبنون زينة الحياة الدنيا) ويجوز زينتا وهو خبر الابتداء في التثنية والأفراد\". (6)",
    "foot_note":"1. البحر المحيط (6\/ 127). \n2. الجامع لأحكام القرآن (10\/ 413). \n3. التحرير والتنوير (15\/ 333). \n4. محاسن التأويل (7\/ 42 \n…. ). \n5. محاسن التأويل (7\/ 42 \n…. )، تفسير أبي السعود (5\/ 226). \n6. الجامع لأحكام القرآن (10\/ 413).",
    "book_id":"72"
  },
  {
    "serial_number":"4962091",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":10,
    "volume_number":1,
    "text":" اللطيفة الخامسة: قال القاسمي: \"إخراج بقاء الأعمال وصلاحها مخرج الصفات المفروغ عنها، مع أن حقهما أن يكونا مقصودي الإفادة، لاسيما في مقابلة إثبات الفناء لما يقابلهما من المال والبنين على طريقة [مَا عِنْدَكُمْ يَنْفَدُ وَمَا عِنْدَ اللَّهِ بَاقٍ] (1) للإيذان بأن بقاءها أمر محقق لا حاجة إلى بيانه، بل لفظ \"الباقيات \"اسم لها لا وصف ولذلك لم يذكر الموصوف وإنما الذي يحتاج إلى التعرض له خيريتها\" (2) .  اللطيفة السادسة: قال القاسمي: \"تكرير (خير) للإشعار باختلاف حيثيتي الخيرية والمبالغة\" (3) .  الفرع الثاني: في تفسير قوله تعالى: [وَيَزِيدُ اللَّهُ الَّذِينَ اهْتَدَوْا هُدًى وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَخَيْرٌ مَرَدًّا] (4) .  أ- التفسير: قال الحافظ ابن كثير رحمه الله: لما ذكر الله تعالى إمداد من هو في الضلالة فيما هو فيه وزيادته على ما هو عليه، أخبر بزيادة المهتدين هدى كما قال تعالى: [وَإِذَا مَا أُنْزِلَتْ سُورَةٌ فَمِنْهُمْ مَنْ يَقُولُ أَيُّكُمْ زَادَتْهُ هَذِهِ إِيمَانًا فَأَمَّا الَّذِينَ آمَنُوا فَزَادَتْهُمْ إِيمَانًا وَهُمْ يَسْتَبْشِرُونَ (124) وَأَمَّا الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ فَزَادَتْهُمْ رِجْسًا إِلَى رِجْسِهِمْ وَمَاتُوا وَهُمْ كَافِرُونَ (125)] (5) (6) .",
    "foot_note":"1. النحل (96). \n2. محاسن التأويل (7\/ 42). \n3. محاسن التأويل (7\/ 42) \n4. مريم (76). \n5. التوبة (124، 125). \n6. تفسير القرآن العظيم (5\/ 285).",
    "book_id":"72"
  },
  {
    "serial_number":"4962092",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":11,
    "volume_number":1,
    "text":"قال ابن عاشور رحمه الله: \"والباقيات الصالحات صفتان لمحذوف معلوم من المقام أي الأعمال الباقي بنعيمها وخيرها، والصالحات لأصحابها هي خير عند الله من نعمة النجاة من العذاب .. \" (1) . قال ابن كثير: \"خير عند ربك ثواباً: أي جزاء\". \"وخير مردًاً: أي عاقبه ومردًاً على صاحبها\" (2) .  ب- اللطائف: قال القاسمي: \"تكرير الخبر لمزيد الاعتناء ببيانه\" (3) .  الفرع الثالث: في اختلاف المفسرين في الباقيات الصالحات: اختلف أهل التأويل في تفسير الباقيات الصالحات على أربعة مذاهب: ـ المذهب الأول: أنها الكلمات المباركات \"سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله .. \". وقد روي ذلك عن رسول الله صلى الله عليه وسلم من طريق جماعة من الصحابة كأبي هريرة، وأبي سعيد الخدري، وعثمان بن عفان، وابن عباس، وابن عمر رضي الله عنهم أجمعين. وروي عن جماعة من التابعين كسعيد بن جبير، وعطاء بن أبي رباح، وسعيد بن المسيب، واليه ذهب عكرمة، ومجاهد، والحسن، وقتادة من أئمة التفسير. وهو مذهب الجماهير من علماء التفسير (4) . وقد استدل أصحاب هذا القول بالأحاديث النبوية الشريفة التي أوردناها في المطلب الأول. المذهب الثاني: أنها الصلوات الخمس. روي هذا المذهب عن ابن عباس في رواية، وعمر وبن شرحبيل، وأبو ميسرة وسعيد من جبير في رواية عنه، ومسروق وإبراهيم (5) .",
    "foot_note":"1. تفسير القرآن العظيم (5\/ 285). \n2. التحرير والتنوير (16\/ 158). \n3. محاسن التاويل (7\/ 42). \n4. تفسير البغوي (3\/ 194، 195)، تفسير الطبري (18\/ 32، 33) ابن كثير (5\/ 161) تفسير القرطبي (10\/ 414)، المحرر الوجيز (3\/ 446) أضواء البيان (3\/ 281) \n5. تفسير ابن كثير (5\/ 161)، والبغوي (3\/ 194، 195)، والطبري (18\/ 32، 33)، القرطبي (10\/ 4141).",
    "book_id":"72"
  },
  {
    "serial_number":"4962093",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":12,
    "volume_number":1,
    "text":"المذهب الثالث: أنها الأعمال الصالحة مطلقاً. روي هذا عن ابن عباس أيضاً، وعبد الرحمن بن زيد بن أسلم، وعلي بن أبي طلحة، وإليه ذهب قتادة، ورجحه جماعة من المفسرين، أخذاً بعموم اللفظ (1) . المذهب الرابع: أنها الكلم الطيب: نقل هذا المذهب عن ابن عباس أيضاً (2) : - قال ابن عطية الأندلسي: \"وقول ابن عباس بكل الأقوال، دليل على قوله بالعموم\" (3) . مناقشة وترجيح: من خلال الأقوال السابقة لأئمة التفسير وأهل التأويل، يترجح لنا القول الأول للاعتبارات الآتية: 1 _ أنه قد ورد عن النبي صلى الله عليه وسلم تفسير الباقيات الصالحات بسبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر، كما في الأحَاديث السابقة عن أبي هريرة، وأبي سعيد الخدري، والنعمان بن بشير، وعبد الله بن مسعود رضي الله تعالى عنهم أجمعين. وقد صحت هذه الأحاديث فكانت أولى ما يرجع إليه في تفسير الباقيات الصالحات. 2 - ما ثبت عن الصحابة رضي الله عنهم من تفسير للباقيات الصالحات بسبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر، ولا حول ولا قوة إلا بالله، صح ذلك عن عثمان، وابن عمر، وابن عباس في أصح الطرق التي رويت عنه. 3 - ما ورد من آثار عن جماعة من التابعين كسعيد بن المسيب، وسعيد بن جبير، وعطاء بن أبي رباح. 4 - أن هذا القول هو مذهب جمهور المفسرين.",
    "foot_note":"1. تفسير البغوي (3\/ 195)، تفسير الطبري (18\/ 35)، ابن كثير (5\/ 164) القرطبي (10\/ 414) فتح القدير الشوكاني (3\/ 414) أضواء البيان (3\/ 281). \n2. تفسير الطبري (18\/ 34)، ابن كثير (5\/ 164). \n3. المحرر الوجيز (3\/ 546).",
    "book_id":"72"
  },
  {
    "serial_number":"4962094",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":13,
    "volume_number":1,
    "text":" المطلب الرابع: معاني الباقيات الصالحات للباقيات الصالحات معانٍ عظيمة ذكرها أهل العلم في كتب العقائد والتفسير وذكرها علماء اللغة في معاجمهم وهي أيضاً في كتب غريب الأثر فنقتصر على ذكر طرف منها في الفروع الخمسة الآتية:  الفرع الأول: في معنى التسبيح: التسبيح في اللغة هو: التنزيه (1) . وأصل النَّزه: البعد، وتنزيه الله: تبعيده عما لا يجوز عليه من النقائص (2) . وسبحان الله: اسم علم لمعنى البراءة والتنزيه (3) . والمعنى: تنزيهاً لله من الصاحبة والولد .. ونصب على المصدر أي أبريء الله من السوء براءة (4) وسبح الله نزهه وقدسه (5) . - قال ابن الجزري: \"وأصل التسبيح: التنزيه والتقديس والتبرئة من النقائص .. وقيل معناه: االتسرع إليه والخفة في طاعته. وقيل معناه: السُرعة إلى هذه اللفظة. وقد يطلق التسبيح على غيره من أنواع الذكر مجازاً، كالتحميد والتمجيد وغيرهما. وقد يطلق على صلاة التطوع والنافلة\" (6) .  الفرع الثاني: في معنى التحميد:",
    "foot_note":"1. الصحاح للجوهري (2\/ 395). \n2. الفائق في غريب الحديث (3\/ 420). \n3. تاج العروس من جواهر القاموس (6\/ 447). \n4. القاموس المحيط (1\/ 284). \n5. القاموس الفقهي (163). \n6. النهاية في غريب الأثر (2\/ 833).",
    "book_id":"72"
  },
  {
    "serial_number":"4962095",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":14,
    "volume_number":1,
    "text":"- \"الحمد: نقيض الذم (1) . \"والتحميد أبلغ من الحمد ومعناه كثرة حمد الله سبحانه بالمحامد الحسنة، قيل حمدك الله عز وجل مرة بعد مرة\" (2) . - والحمد أعم من الشكر ومعناه: الثناء الجميل على الله ويكون شكراً للنعمة التي شتملت الكل. والحمد الرضا والجزاء وقضاء الحق. - والحميد من صفات الله تعالى بمعنى المحمود على كل حال وهو من الأسماء الحسنى (3) .  الفرع الثالث: في معنى التهليل: - التهليل قول: \"لا إله إلا الله\" (4) . والمعنى العام لكلمة التوحيد: لا معبود بحق إلا الله. - قال العلامة الشنقيطي- رحمه الله -: في تفسير قوله تعالى: \"إياك نعبد وإياك نستعين\". قال: \"أشار في هذه الآية الكريمة إلى تحقيق معنى لا إله إلا الله، ومعناه مركب من أمرين: نفي وإثبات. فالمنفي: خلع جميع المعبودات غير الله تعالى في جميع أنواع العبادات. والإثبات: إفراد رب السماوات والأرض وحده بجميع أنواع العبادات على الوجه المشروع\" (5) .  الفرع الرابع: في معنى التكبير:",
    "foot_note":"1. الصحاح للجوهري (3\/ 28). \n2. لسان العرب لابن منظور (3\/ 155). \n3. تاج العروس للزبيدي (8\/ 38 - 39)، المعجم الوسيط (1\/ 196). \n4. الصحاح للجوهري (6\/ 130). \n5. أضواء البيان (1\/ 7).",
    "book_id":"72"
  },
  {
    "serial_number":"4962096",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":15,
    "volume_number":1,
    "text":"- التكبير التعظيم (1) . ومن أسماء الله الحسنى \"المتكبر والكبير\" (2) . - الله أكبر: - قال الأزهري: وفيه قولان: أحدهما: أن معناه الله كبير .. والقول الآخر: أن فيه ضميراً، المعنى: الله أكبر كبير .. وقيل معناه: الله أكبر من كل شيء، أي أعظم فحذف لوضوح معناه .. قيل معناه: الله أكبر من أن يعرف كُنهُ كبريائه وعظمته .. \" (3)  الفرع الخامس: في معنى الحوقلة: - الحوقلة: في لفظة مبنية من \"لا حول ولا قوة إلا بالله\" (4) ، وهي من الألفاظ المنحوتة. - والحول: هنا الحركة، يقال: حال الشخص يحول إذا تحرك. والمعنى: لا حركة ولا قوة إلا بمشيئة الله تعالى. - والقوة هي الشدة وخلاف الضعف (5) . - والمعنى: ولا حول بنا على العمل بالطاعة إلا بالله، ولا قوة لنا على ترك المعصية إلا بالله. قاله ابن عباس رضي الله عنهما. - \"لا حول عن معصية الله إلا بقوة الله، ولا قوة على طاعة الله إلا بعون الله\" قاله ابن مسعود رضي الله عنه. _ لا تأخذ ما تحب إلا بالله، ولا تمتنع مما تكره إلا بعون الله\". قاله زهير بن محمد (6) .",
    "foot_note":"1. لسان العرب لابن منظور (5\/ 125). \n2. النهاية في غريب الأثر لابن الجوزي (4\/ 244). \n3. تاج العروس وجواهر القاموس للزبيدي (14\/ 5). \n4. لسان العرب لابن منظور (11\/ 184)، النهاية في غريب الأثر (1\/ 1088)، معجم مقاييس اللغة لابن فارس (5\/ 36). \n5. المصدر السابق. \n6. الدر المنثور للسيوطي (9\/ 549، 550).",
    "book_id":"72"
  },
  {
    "serial_number":"4962097",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":16,
    "volume_number":1,
    "text":" المطلب الخامس: إضافة الحوقلة إلى الباقيات الصالحات الحوقلة هي \"لا حول ولا قوة إلا بالله\"، وقد ورد إضافتها إلى الباقيات الصالحات في عدة أحاديث مرفوعة إلى النبي صلى الله عليه وسلم، رويت من طريق عثمان وأبي سعيد الخدري وابن مسعود رضي الله عنهم أجمعين. - وقد ذهب إلى إضافة الحوقلة إلى الباقيات الصالحات من الصحابة عثمان بن عفان وابن عمر وابن عباس- رضي الله تعالى عنهم-. - ومن التابعين سعيد بن المسيب وعطاء بن أبي رباح وبه قال ابن وهب (1) . وإليك بعض الأحاديث والآثار الواردة في تلك الفرعين الآتيين:  الفرع الأول: الأحاديث المروية في إضافة الحوقلة إلى الباقيات الصالحات: أ) حديث أبي سعيد الخدري رضي الله عنه عن رسول الله صلى الله عليه وسلم قال: \"استكثروا من الباقيات الصالحات قيل وما هي يا رسول الله؟ قال: التكبير والتهليل والتسبيح والتحميد ولا حول ولا قوة إلا بالله\" (2) . ب) حديث عثمان رضي الله عنه فقد سئل عن الباقيات؟ قال: هن \"لا إله إلا الله وسبحان الله والحمد لله والله أكبر ولا حول ولا قوة إلا بالله\" (3) . ج) حديث أبي مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"لقيت إبراهيم ليلة أسري بي فقال يا محمد: أقرئ أمتك مني السلام وأخبرهم أن الجنة طيبة التربة، عذبة الماء، وأنها قيعان، وأن غراسها سبحان الله والحمد لله ولا إله إلا الله والله أكبر\" (4) . وزاد الطبراني في الصغير والأوسط \"لا حول ولا قوة إلا بالله\" (5) .",
    "foot_note":"1. تفسير القرآن العظيم للحافظ ابن كثير (5\/ 162 - 164). \n2. سبق تخريجه. \n3. سبق تخريجه. \n4. رواه الترمذي (5\/ 510) برقم (3462) وحسنه الألباني في صحيح الترغيب (2\/ 231 - 232) برقم (1550). \n5. رواه الطبراني في الصغير (1\/ 326) برقم (539) والأوسط (4\/ 271) برقم (4170) وحسنه الألباني في صحيح الترغيب (2\/ 231 - 232) برقم (1550)",
    "book_id":"72"
  },
  {
    "serial_number":"4962098",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":17,
    "volume_number":1,
    "text":" الفرع الثاني: الآثار المروية في إضافة الحوقلة إلى الباقيات الصالحات: أ) أثر عمارة بن صياد عن سعيد بن المسيب أنه سمعه يقول: في الباقيات الصالحات \"إنها قول العبد الله أكبر وسبحان الله والحمد لله ولا إله إلا الله ولا حول ولا قوة إلا بالله\" (1) . ب) ما روي عن ابن عمر أنه سئل عن الباقيات الصالحات؟ فقال: لا إله إلا الله والله أكبر وسبحان الله ولا حول ولا قوة إلا بالله (2) . ج) قال ابن جريج وقال عطاء بن أبي رباح مثله (3) . د) وبه قال ابن وهب (4) . هـ) وروي أيضاً عن ابن عباس رضي الله عنهما (5) .",
    "foot_note":"1. سبق تخريجه ص: \n2. تفسير الطبري (18\/ 33)، تفسير القرآن العظيم- ابن كثير (5\/ 162 - 164). \n3. المصدر السابق. \n4. المصدر السابق. \n5. المصدر السابق.",
    "book_id":"72"
  },
  {
    "serial_number":"4962099",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":18,
    "volume_number":1,
    "text":" المبحث الثاني: الباقيات الصالحات أسرارها ومكانتها للباقيات الصالحات مكانة كبيرة بين سائر الأذكار، ولها أسرار بديعة تنبئ عن مقامها الكريم وسر فضلها العظيم، فهي على وجازتها، قد حوت المعاني الكثيرة وسأكتب عن مكانتها وأسرارها في مطلبين: المطلب الأول: في بيان أسرار الباقيات الصالحات. المطلب الثاني: في مكانة الباقيات الصالحات.",
    "foot_note":"None",
    "book_id":"72"
  },
  {
    "serial_number":"4962100",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":19,
    "volume_number":1,
    "text":" المطلب الأول: في بيان سر فضل الباقيات الصالحات ذكر الشيخ عز الدين بن عبد السلام- -رحمه الله تعالى-- في رسالة له مشهورة في العقيدة أجاب فيها على بعض أهل عصره، كُتبت له امتحاناً، ذكرها الإمام تاج الدين السبكي كاملة في طبقات الشافعية الكبرى. ذكر أن أسماء الله الحسنى التسعة والتسعين التي سمى بها نفسه في كتابه وسنة رسوله صلى الله عليه وسلم مندرجة في أربع كلمات هن الباقيات الصالحات. -  الكلمة الأولى: قول سبحان الله ومعناها في كلام العرب التنزيه والسلب، فهي مشتملة على سلب النقص والعيب عن ذات الله وصفاته، فما كان من أسمائه سلباً فهو مندرج تحت هذه الكلمة كالقدوس وهو الطاهر من كل عيب، والسلام هو الذي سلم من كل آفة. -  الكلمة الثانية: قول الحمد لله وهي مشتملة على إثبات ضروب الكمال لذاته وصفاته فما كان من أسمائه متضمناً للإثبات كالعليم والقدير والسميع والبصير فهو مندرج تحت الكلمة الثانية، فقد نفينا بقولنا سبحان الله كل عيب عقلناه وكل نقص فهمناه وأثبتنا بالحمد كل كمال عرفناه وكل جلال أدركناه ووراء ما نفيناه وأثبتناه شأن عظيم قد غاب عنا جهلناه، فحققه من جهة الإجمال بقولنا الله أكبر وهيَّ. -  الكلمة الثالثة: بمعنى أنه أجل مما نفيناه وأثبتناه وذلك معنى قوله صلى الله عليه وسلم: \"لا أحصي ثناء عليكم أنت كما أثنيت على نفسك\" فما كان من أسمائه متضمناً لمدح فوق ما عرفناه وأدركناه كالأعلى والمتعالي فهو مندرج تحت قولنا الله أكبر، فإذا كان في الوجود من هذا شأنه نفينا أن يكون في الوجود من يشاكله أو يناظره فحققنا ذلك بقولنا \"لا إله إلا الله\" وهي. -  الكلمة الرابعة: فإن الألوهية ترجع إلى استحقاق العبودية ولا يستحق العبودية إلا من اتصف بجميع ما ذكرناه، فما كان من أسمائه متضمناً للجميع على الإجمال كالواحد والأحد وذي الجلال والإكرام فهو مندرج تحت قولنا لا إله إلا الله، وإنما استحق العبودية لما وجب له من أوصاف الجلال ونعوت الكمال الذي لا يصفه الواصفون ولا يعده العادون .. \" (1) . ومما سبق يتبين لنا السر في امتياز هذه الكلمات على غيرها، والمقام الكريم الذي تبوأته على سائر أنواع الذكر. قال الإمام الحافظ المناوي رحمه الله: \"وإنما هذه الكلمات الأربع أفضل الكلام لأنها تتضمن تنزيهه تعالى عن كل ما يستحيل عليه ووصفه بكل ما يجب له من أوصاف كما له وانفراده لوحدانيته واختصاصه بعظمته وقدمه المفهومين من أكبريته\" (2) .",
    "foot_note":"1. طبقات الشافعية الكبرى (8\/ 220)، جزء في الباقيات الصالحات (1\/ 44)، مشكاة المصابيح للتبريزي مع شرحها للمباركفوري (7\/ 893). \n2. مشكاة المصابيح للتبريزي مع شرحه مراعاة المفاتيح لأبي الحسن المباركفوري (7\/ 893).",
    "book_id":"72"
  },
  {
    "serial_number":"4962101",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":20,
    "volume_number":1,
    "text":" المطلب الثاني: في مكانة الباقيات الصالحات ولِعظم مكانة الباقيات الصالحات، فقد ورد في السنة النبوية المطهرة ما يدل على هذه المنزلة العظيمة والمرتبة العالية من خلال الآتي:  1 - جعلها النبي صلى الله عليه وسلم تجزيء عن القرآن الكريم في حق من لا يحسنه . لحديث عبد الله بن أبي أوفى قال: قال أعرابي: يا رسول الله إني قد عالجت القرآن فلم أستطعه، فعلمني شيئاً يُجزئ من القرآن، قال: قل: \"سبحان الله والحمد لله ولا إله إلا الله والله أكبر\"، فقالها، وأمسكها بإصبعه، فقال: يا رسول الله هذا لربي فما لي؟ قال: تقول: اللهم اغفري لي وارحمني وعافني وارزقني، وأحسبه قال: واهدني، ومضى الأعرابي، فقال رسول الله صلى الله عليه وسلم: \"ذهب الأعرابي وقد ملأ يديه خيراً\" (1) . وزاد البيهقي ولا حول ولا قوة إلا بالله ( 2). 2 - أنها تقوم مقام أمهات العبادات العظام كالجهاد في سبيل الله والإنفاق وقيام الليل -ما كان منها تطوعاً -. لحديث عبد الله بن مسعود رضي الله عنه قال: \"إن الله قسم بينكم أخلاقكم كما قسم بينكم أرزاقكم، وإن الله يؤتي المال من يحب ومن لا يُحب، ولا يؤتي الإيمان إلا من أحب، فإذا أحب الله عبداً أعطاه الإيمان، فمن ضَنَّ بالمال أن ينفقه وهاب العدو أن يجاهده، والليل أن يكابده، فليكثر من قول لا إله إلا الله والله أكبر والحمد لله وسبحان الله\" ( 3). 3 - أن مقامها حول العرش تذكر بصاحبها: ففي حيث النعمان بن بشير رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: \"إن مما تذكرون من جلال الله، التسبيح والتهليل، والتحميد، ينعطفن حول العرش، له، دوي كدوي النحل، تذكر بصاحبها، أما يحب أحدكم أن يكون له- أولا يزال له- من يذكر به\" (4) .",
    "foot_note":"1. أخرجه أبو داود (1\/ 308) برقم (132)، صحح ابن حبان (5\/ 116) وحسنه الأرنؤوط في صحيح ابن حبان برقم (1810)، وحسنه الألباني في صحيح الترغيب برقم (1561) (2\/ 236). \n2. رواه البيهقي (2\/ 381) وقال المنذري: إسناده جيد وصححه الألباني في صحيح الترغيب (2\/ 237). \n3. رواه البخاري في الأدب المفرد (1\/ 104) برقم (275) وصححه الألباني في صحيح الترغيب برقم (1571) (2\/ 242). \n4. رواه ابن ماجة واللفظ له (2\/ 1252)، والحاكم وقال: صحيح الإسناد ولم يخرجاه (1\/ 678)، وصححه الألباني في صحيح الترغيب برقم (1568) (2\/ 240).",
    "book_id":"72"
  },
  {
    "serial_number":"4962102",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":21,
    "volume_number":1,
    "text":" 4 - أنها جامعة الخير: إذ إنها تجمع لصاحبها الخير في دنياه وأخراه. - فقد ورد في حديث سعد بن أبي وقاص رضي الله عنه قال: جاء أعرابي إلى النبي صلى الله عليه وسلم فقال: علمني كلاماً أقوله. قال: \"قل: لا إله إلا الله وحده لا شريك له الله أكبر كبيرا، والحمد لله كثيرا، وسبحان الله رب العالمين، ولا حول ولا قوة إلا بالله العزيز الحكيم\" قال: هؤلاء لربي، فما لي؟ قال: \"قل: اللهم اغفر لي وارحمني واهدني وارزقني\"، وفي رواية \"وعافني\" (1) . وفي رواية قال: \"فإن هؤلاء تجمع لك دنياك وأخراك\" (2) . - وفي حديث أنس بن مالك رضي الله عنه قال: جاء رجل بدوي إلى رسول الله صلى الله عليه وسلم فقال: يا رسول الله: علمني خيراً. قال: \"قل: سبحان الله والحمد لله ولا إله إلا الله والله أكبر\"، ثم رجع فلما رآه رسول الله صلى الله عليه وسلم تبسم، وقال: \"تفكر البائس\" فقال: يا رسول الله (سبحان الله والحمد لله ولا إله إلا الله والله أكبر) هذا كله لله، فما لي؟ فقال رسول الله صلى الله عليه وسلم: إذا قلت \"سبحان الله\" قال الله: صدقت، وإذا قلت: \"الحمد لله\" قال الله: صدقت، وإذا قلت: \"لا إله إلا الله\" قال الله: صدقت، وإذا قلت: \"الله أكبر\" قال الله صدقت، فتقول: اللهم اغفر لي، فيقول الله: قد فعلت، فتقول: اللهم ارحمني، فيقول الله: قد فعلت، وتقول اللهم ارزقني، فيقول الله: قد فعلت. قال: فعقد الأعرابي سبعاً في يديه (3) .  5 - أن الله عز وجل اصطفاها من بين سائر الكلام لمكانتها وفضلها العظيم: وقد صح ذلك من حديث أبي هريرة وأبي سعيد رضي الله عنهما عن النبي صلى الله عليه وسلم قال: \"إن الله اصطفى من الكلام أربعاً سبحان الله والحمد لله ولا إله إلا الله والله أكبر، فمن قال: سبحان الله؛ كتبت له عشرون حسنة، وحطت عنه عشرون سيئة، ومن قال: الله أكبر فمثل ذلك، ومن قال: لا إله إلا الله فمثل ذلك، ومن قال: الحمد لله رب العالمين، من قبل نفسه كتبت له ثلاثون حسنة، وحطت عنه ثلاثون سيئة\" (4) .",
    "foot_note":"1. رواه مسلم (4\/ 2072) برقم (2696). \n2. رواه مسلم (8\/ 71) برقم (7026). \n3. رواه البيهقي في شعب الإيمان (2\/ 133)، وصححه الألباني في السلسلة الصحيحة برقم (3336) (13\/ 139). \n4. رواه أحمد (13\/ 387)، والحاكم (1\/ 512)، وصححه الألباني في صحيح الجامع برقم (1718).",
    "book_id":"72"
  },
  {
    "serial_number":"4962103",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":22,
    "volume_number":1,
    "text":" المبحث الثالث: في بيان فضل الباقيات الصالحات إجمالاً المتأمل في نصوص السنة المطهرة يجد أنه قد وردت أحاديث كثيرة في بيان فضل الباقيات الصالحات، منها ما ذكر مجملاً بفضل هذه الكلمات مجتمعة، ومنها ما ذكر بفضل كل كلمة منها مفصلة. ومن خلال هذا المبحث، سنعرض الأحاديث الواردة في فضل الباقيات الصالحات والمواضع التي تقال فيها إجمالاً في مطلبين: المطلب الأول: في فضل الباقيات الصالحات إجمالاً. المطلب الثاني: في المواضع التي تقال فيها إجمالاً.",
    "foot_note":"None",
    "book_id":"72"
  },
  {
    "serial_number":"4962104",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":23,
    "volume_number":1,
    "text":" المطلب الأول: في بيان فضل الباقيات الصالحات إجمالاً ورد في فضل الباقيات الصالحات مجملة أحاديث كثيرة تبين فضلها، أذكر طرفاً مما صح فيها على النحو التالي:  1 - أنها أحب الكلام إلى الله تعالى: لحديث سمرة بن جندب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"أحب الكلام إلى الله أربع: سبحان الله والحمد لله ولا إله إلا الله والله أكبر؛ لا يضرك بأيهنَّ بدأت\" (1) .  2 - أنها أطيب الكلام: كما في حديث سمرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \" … أربع من أطيب الكلام وهن من القرآن لا يضرك بأيهن بدأت: سبحان الله والحمد لله ولا إله إلا الله والله أكبر .. \" (2) . 3 - أنها أفضل الكلام: لقوله صلى الله عليه وسلم: \"أفضل الكلام أربع: سبحان الله والحمد لله ولا إله إلا الله والله أكبر\" (3) .  4 - أنها أحب مما طلعت عليه الشمس: ففي حديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"لأن أقول: سبحان الله والحمد لله ولا إله إلا الله والله أكبر؛ أحب إلي مما طلعت عليه الشمس\" (4) .  5 - أنها خير الكلام: لقوله صلى الله عليه وسلم: \"خير الكلام أربع لا يضرك بأيهن بدأت: سبحان الله والحمد لله ولا إله إلا الله والله أكبر\" (5) .",
    "foot_note":"1. رواه مسلم برقم (1685). \n2. أخرجه أحمد (33\/ 311)، وصححه الألباني في السلسلة الصحيحة (1\/ 613) برقم (346). \n3. رواه البخاري (8\/ 173). \n4. رواه مسلم (4\/ 2072) برقم (2695). \n5. صحيح ابن حبان (3\/ 117)، وصححه الألباني في صحيح الجامع برقم (3284)، والأرنؤوط في صحيح ابن حبان برقم (836).",
    "book_id":"72"
  },
  {
    "serial_number":"4962105",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":24,
    "volume_number":1,
    "text":" 6 - أنها غِراس الجنة: وقد ورد بذلك عدة أحاديث ثابتة عن رسول الله صلى الله عليه وسلم على النحو التالي: أ. حديث أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم مر به وهو يغرس غرساً، فقال: \"يا أبا هريرة ما الذي تغرس؟ قلت: غراساً، قال: \"ألا أدلك على غرس خير من هذا؟ سبحان الله والحمد لله ولا إله إلا الله والله أكبر، تغرس بكل واحدة شجرة في الجنة\" (1) . ب. حديث ابن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"لقيت إبراهيم ليلة أسري بي، فقال: يا محمد أقرئ أمتك مني السلام، وأخبرهم أن الجنة طيبة التربة، عذبة الماء، وأنها قيعان، وأن غراسها سبحان الله والحمد لله ولا إله إلا الله والله أكبر\" (2) . وفي رواية \"ولا حول ولا قوة إلا بالله\" (3) . ج. حديث سلمان رضي الله عنه قال: قال سمعت رسول الله صلى الله عليه وسلم يقول: \"إن في الجنة قيعاناً فأكثروا من غراسها. قالوا: يا رسول الله وما غرسها؟ قال: سبحان الله والحمد لله ولا إله إلا الله والله أكبر\" (4) . د. حديث ابن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: \"من قال: سبحان الله والحمد لله ولا إله إلا الله والله أكبر غُرِس له بكل واحدة منهن شجرة في الجنة\" (5) .",
    "foot_note":"1. رواه ابن ماجة (2\/ 1251) برقم (3807) وحسنه الألباني في صحيح الترغيب (2\/ 231) برقم (1549). \n2. أخرجه الترمذي (5\/ 387)، وحسنه الألباني في صحيح الجامع برقم (5152). \n3. أخرجه الطبراني في الصغير (1\/ 326)، الأوسط (4\/ 271)، وحسنه الألباني في صحيح الترغيب (2\/ 230). \n4. أخرجه الطبراني في الكبير (6\/ 48)، وحسنه الألباني في صحيح الترغيب (2\/ 232) برقم (1551). \n5. رواه الطبراني وإسناده حسن قاله المنذري وحسنه الألباني في صحيح الترغيب (2\/ 232) برقم (1552).",
    "book_id":"72"
  },
  {
    "serial_number":"4962106",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":25,
    "volume_number":1,
    "text":" 7 - عِظم أجرها خاصة لمن عجز عن العبادة: فقد ثبت في حديث أم هانئ رضي الله عنها قالت: مر بي رسول الله صلى الله عليه وسلم ذات يوم، فقلت: يا رسول قد كبرت وضعفت- أو كما قالت- فمرني بعمل أعمله وأنا جالسة قال: \"سبحي الله مائة تسبيحة؛ فإنها تعدل لك مائة رقبة تعتقينها من ولد إسماعيل، واحمدي الله مائة تحميدة؛ فإنها تعدل لك مائة فرس مسرجة ملجمة تحملين عليها في سبيل الله، وكبري الله مائة تكبيرة؛ فإنها تعدل لك مائة بدنة مقلدة متقبلة، وهللي الله مائة تهليلة. قال ابن خلف: أحسبه قال: تملأ ما بين السماء والأرض، ولا يرفع يومئذ لأحدٍ عمل، إلا أن يأتي بمثل ما أتيت\" (1) . وفي رواية: \"وهللي الله مائة تهليلة لا تذر ذنباً ولا يسبقها عمل\" (2) .  8 - أنها تثقل الميزان يوم القيامة وتملأ ما بين السماء والأرض: - لحديث أبي سلمى - راعي رسول الله صلى الله عليه وسلم قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"بَخٍ بَخٍ لخمسٍ ما أثقلهن في الميزان: لا إله إلا الله وسبحان الله والحمد لله والله أكبر، والولد الصالح يُتوفى للمرء المسلم فيحتسبه\" (3) . - وثبت في حديث أبي مالك الأشعري أن النبي صلى الله عليه وسلم قال: \"الطهور شطر الإيمان، والحمد لله تملأ الميزان، وسبحان الله والحمد لله تملآن ما بين السماء والأرض، والصلاة نور، والصدقة برهان، والصبر ضياء، والقرآن حجة لك أو عليك، كل الناس يغدو فبائع نفسه فمعتقها أو موبقها\" (4) .",
    "foot_note":"1. أخرجه أحمد (44\/ 479) وحسنه الألباني في صحيح الترغيب (2\/ 223) برقم (1553). \n2. أخرجه الطبراني في الكبير (18\/ 150)، وحسنه الألباني في صحيح الترغيب (2\/ 223) برقم (1553). \n3. أخرجه أحمد في المسند (36\/ 514)، مستدرك الحاكم (1\/ 511)، وصححه الألباني في السلسلة الصحيحة (2\/ 202) برقم (1204). \n4. صحيح مسلم بشرح النووي (1\/ 203) برقم (223).",
    "book_id":"72"
  },
  {
    "serial_number":"4962107",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":26,
    "volume_number":1,
    "text":" 9 - أنها جُنَّة يوم القيامة تأتي من أمام صاحبها ومن ورائه تقية من النار . لما في حديث أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: \"خذوا جُنتكم\" قالوا: يا رسول الله: أمن عدو قد حضر؟ قال: \"لا، ولكن جُنتكم من النار، قولوا: سبحان الله والحمد لله ولا إله إلا الله والله أكبر؛ فإنهن يأتين يوم القيامة مُجنبات ومعقبات، وهن الباقيات الصالحات\" ( 1). 10 - أنها كفارة للخطايا: تحطها حطاً وتنفضها كما تنفض الشجرة ورقها كما ثبت ذلك عن رسول الله صلى الله عليه وسلم في حديث أنس رضي الله عنه أنه أخذ غصناً فنفضه فلم ينتفض، ثم نفضته فلم ينتفض فقال رسول الله صلى الله عليه وسلم: \"إن سبحان الله والحمد لله ولا إله إلا الله والله أكبر ينفضن الخطايا كما تنقض الشجرة ورقها\" (2) . وفي حديث عبد الله بن عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: \"ما على الأرض أحد يقول: لا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله إلا كفرت عنه خطاياه، ولو كانت مثل زبد البحر\" (3) . وزاد ابن أبي الدنيا والحاكم \"سبحان الله والحمد لله\" (4) .  11 - أنها تزحزح قائلها من النار . صح ذلك في حديث عائشة رضي الله عنها؛ أن رسول الله صلى الله عليه وسلم قال: \"خُلق كل إنسان من بني آدم على ستين وثلاثمائة مفصل، فمن كبر الله، وحمد الله، وهلل الله، وسبح الله، واستغفر الله، وعزل حجراً عن طريق المسلمين، أو شوكة أو عظماً عن طريق المسلمين، وأمر بمعروف أو نهى عن منكر، عدد تلك الستين والثلاثمائة (السُلامى)؛ فإنه يمسي يومئذ وقد زَحزح نفسه عن النار\" (5) .",
    "foot_note":"1. أخرجه النسائي في السنن الكبرى (6\/ 212)، وصححه الألباني في صحيح الجامع برقم (3214). \n2. أخرجه البخاري في الأدب المفرد (1\/ 221)، وأحمد في المسند (3\/ 152)، وحسنه الألباني في السلسلة الصحيحة برقم (3168) (12\/ 1). \n3. سنن الترمذي (5\/ 509) برقم (3460)، وحسنه الألباني في صحيح الترغيب (2\/ 241) برقم (1569). \n4. مستدرك الحاكم (1\/ 682)، وحسنه الألباني برقم (1569). \n5. صحيح مسلم بشرح النووي (2\/ 698) برقم (1007).",
    "book_id":"72"
  },
  {
    "serial_number":"4962108",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":27,
    "volume_number":1,
    "text":" 12 - أنها صدقة من لم يجد الصدقة . وقد ثبت ذلك في حديث أبي ذر رضي الله عنه: إن أناساً في أصحاب النبي صلى الله عليه وسلم قالوا للنبي صلى الله عليه وسلم: يا رسول الله ذهب أهل الدثور بالأجور، يصلون كما نصلي، ويصومون كما نصوم، ويتصدقون بفُضول أموالهم. قال: \"أو ليس قد جعل الله لكم ما تصدقون به، إنَّ بكل تسبيحة صدقة، وكل تكبيرة صدقة، وكل تحميدة صدقة، وأمر بالمعروف صدقة، ونهي عن منكر صدقة، وفي بضع أحدكم صدقة\" قالوا: يا رسول الله أيأتي أحدنا شهوته ويكون له فيها أجر؟ قال: \"أرأيتم لو وضعها في حرام أكان عليه وزر؟ فكذلك إذا وضعها في الحلال كان له أجر\" (1) . قوله: الدثور- بضم الدال- جمع دَثْر بفتحها: وهو المال الكثير. والبُضع- بضم الموحدة- هو الجِماع، وقيل: الفرج نفسه. - وثبت أيضاً عن النبي صلى الله عليه وسلم أن الباقيات الصالحات من أبواب الصدقة، ففي حديث أبي ذر رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"على كل نفس في كل يوم طلعت عليه الشمس صدقة منه على نفسه من أبواب الصدقة: التكبير وسبحان الله والحمد لله ولا إله إلا الله وأستغفر الله ويأمر بالمعروف وينهى عن المنكر ويعزل الشوك عن طريق الناس والعظم والحجر وتهدي الأعمى وتُسمع الأصم والأبكم حتى يفقه وتدل المستدل على حاجة له قد علمت مكانها وتسعى بشدة ساقيك إلى اللهفان المستغيث، وترفع بشدة ذراعيك مع الضعيف، كل ذلك من أبواب الصدقة منك على نفسك .. \" (2) .  13 - تُفَتَّحُ لها أبواب السماء . كما في حديث ابن عمر رضي الله عنهما قال: بينما نحن نصلي مع رسول الله صلى الله عليه وسلم إذ قال رجل من القوم: الله أكبر كبيرا، والحمد لله كثيرا، وسبحان الله بكرة وأصيلا، فقال رسول الله صلى الله عليه وسلم: من القائل كذا وكذا؟ فقال رجل من القوم: أنا يا رسول الله. قال: \"عجبت لها فتحت لها أبواب السماء\". قال ابن عمر رضي الله عنهما: \"ما تركتهن منذ سمعتهن من رسول الله صلى الله عليه وسلم\" (3) .",
    "foot_note":"1. أخرجه أحمد في المسند (35\/ 382)، وصححه الأرنؤوط في المسند برقم (21482). \n2. أخرجه أحمد (35\/ 383)، السنن الكبرى للنسائي (5\/ 325) وصححه الألباني في صحيح الجامع برقم (4038). \n3. سنن الترمذي (5\/ 575)، وصححه الألباني في صحيح صفة الصلاة برقم (74).",
    "book_id":"72"
  },
  {
    "serial_number":"4962109",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":28,
    "volume_number":1,
    "text":" المطلب الثاني: في المواضع التي تقال فيها الباقيات الصالحات للباقيات الصالحات مواضع تقال فيها ثبتت في السنة النبوية الشريفة من هذه المواضع:  1 - إذا استيقظ من الليل . فقد ثبت أن النبي صلى الله عليه وسلم كان إذا استيقظ من الليل يفتتح بالباقيات الصالحات أو ببعضها ومن ذلك: أنه كان يكبر عشراً ويحمد عشراً ويسبح عشراً ويستغفر ويهلل عشراً. فعن شريق الهوزني قال: دخلت على عائشة رضي الله عنها فسألتها بم كان رسول الله صلى الله عليه وسلم يفتتح إذا هب من الليل، فقالت: \"سألتني عن شيء ما سألني عنه أحد قبلك، كان إذا هب من الليل كبر عشراً، وحمد عشراً، وقال سبحان الله وبحمده عشراً، وقال سبحان الملك القدوس عشراً، واستغفر عشراً، وهلل عشراً، ثم قال: اللهم إني أعوذ بك من ضيق الدنيا وضيق يوم القيامة عشراً، ثم يفتتح الصلاة\" (1) .  2 ــ إذا استفتح الصلاة . فقد صح عن النبي صلى الله عليه وسلم أنه كان يقول عند افتتاح الصلاة: الله أكبر كبيراً، والحمد لله كثيراً، وسبحان الله بكرة وأصيلاً ويكررها. كما في حديث جبير بن مطعم قال: رأيت رسول الله صلى الله عليه وسلم حينما دخل في الصلاة قال: \"الله أكبر كبيرا، الله أكبر كبيرا، والحمد لله كثيرا، الحمد لله كثيرا، سبحان الله بكرة وأصيلا، ثلاثاً، إني أعوذ بك من الشيطان الرجيم من همزه ونفخه ونفثه\" (2) .",
    "foot_note":"1. أخرجه أبو داود (1\/ 279)، وحسنه الألباني في صحيح سنن ابن ماجة برقم (1356). \n2. أخرجه أبود داود (1\/ 122)، وابن ماجة (1\/ 269)، وأحمد (4\/ 85). وصححه الألباني في صحيح الكلم الطيب (1\/ 98) برقم (80) وقال: في أصل صفة صلاة النبي صلى الله عليه وسلم مثله في الشواهد لا بأس به إن شاء الله.",
    "book_id":"72"
  },
  {
    "serial_number":"4962110",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":29,
    "volume_number":1,
    "text":" 3 - في صلاة التسابيح: فعن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال للعباس بن عبد المطلب: \"يا عباس يا عماه ألا أعطيك؟ ألا أمنحك؟ ألا أخبرك؟ ألا أفعل بك عشر خصال؟ إذا أنت فعلت ذلك غفر الله لك ذنبك أوله وآخره، قديمه وحديثه، خطأه وعمده، صغيره وكبيره، سره وعلانيته؟ عشر خصال: أن تصلي أربع ركعات تقرأ في كل ركعة فاتحة الكتاب وسورة، فإذا فرغت من القراءة في أول ركعة وأنت قائم، قلت سبحان الله والحمد لله ولا إله إلا الله والله أكبر خمس عشرة مرة، ثم تركع فتقولها وأنت راكع عشر مرات، ثم ترفع رأسك من الركوع فتقولها عشراً، ثم تهوي ساجداً قتقولها وأنت ساجد عشراً، ثم ترفع رأسك من السجود فتقولها عشراً، ثم تسجد فتقولها عشراً، ثم ترفع رأسك فتقولها عشراً، فذلك خمس وسبعون في كل ركعة، تفعل ذلك في أربع ركعات إن استطعت أن تصليها في كل يوم مرة فافعله فإن لم تفعل ففي كل جمعة مرة، فإن لم تفعل ففي كل شهر مرة، فإن لم تفعل ففي كل سنة مرة، فإن لم تفعل ففي عمرك مرة\" (1) .  4 - في أدبار الصلوات المكتوبة: وقد وردت بعدة صفات وكيفيات منها: أ) الصفة الأولى: تسبح دبر كل صلاة ثلاثاً وثلاثين وتحمد ثلاثاً وثلاثين وتكبر ثلاثاً وثلاثين وتقول تمام المائة: لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير. لحديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من سبح الله في دبر كل صلاة ثلاثاً وثلاثين وحمد الله ثلاثاً وثلاثين، وكبر الله ثلاثاً ثلاثين وقال تمام المائة لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير غفرت خطاياه وإن كانت مثل زبد البحر\" (2) . ب) الصفة الثانية: يسبح ثلاثاً وثلاثين ويحمد ثلاثاً وثلاثين ويكبر أربعاً وثلاثين. لما صح عن كعب بن عجرة رضي الله عنه مرفوعاً: \"معقبات لا يخيب قائلهن أو فاعلهن دبر كل صلاة مكتوبة ثلاث وثلاثون تسبيحة، وثلاث وثلاثون تحميدة، وأربع وثلاثون تكبيرة\" (3) . ج) الصفة الثالثة: سبحان الله والحمد لله ولا إله إلا الله والله أكبر مائة مرة.",
    "foot_note":"1. أخرجه الترمذي (2\/ 347)، أبو داود (1\/ 499)، وصححه الألباني في صحيح سنن أبي داود (5\/ 40) وقال: قد قواه جماعة من الأئمة منهم الآجُرِّي وابن منده وأبو محمد عبد الرحيم المصري وأبو الحسن المقدسي والمنذري وابن الصلاح. \n2. صحيح مسلم بشرح النووي (1\/ 418) برقم (597). \n3. صحيح مسلم بشرح النووي (1\/ 418) برقم (596).",
    "book_id":"72"
  },
  {
    "serial_number":"4962111",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":30,
    "volume_number":1,
    "text":"لحديث كعب بن عجرة أيضاً مرفوعاً وفيه قال صلى الله عليه وسلم: \"معقبات لا يخيب قائلهن سبحان الله والحمد لله ولا إله إلا الله والله أكبر مائة مرة\" (1) .  5 - إذا قرب من عرفات ووقع بصره على جبل الرحمة: شرع له أن يقول: سبحان الله والحمد لله ولا إله إلا الله والله أكبر (2) .  6 - عقد الكرب: لما ثبت عن ابن عباس رضي الله عنهما أن النبي صلى الله عليه وسلم كان يقول عند الكرب: \"لا إله إلا الله الحليم الكريم، وسبحان الله رب العرش العظيم، وسبحان الله رب السماوات السبع ورب العرش العظيم\" (3) .  7 - حين يأوي إلى فراشه: لحديث أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: من قال حين يأوي إلى فراشه: \"لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير ولا حول ولا قوة إلا بالله، وسبحان الله والحمد لله ولا إله إلا الله والله أكبر؛ عقدت ذنوبه- أو قال خطاياه- وإن كانت مثل زبد البحر\" (4) .  8 - عند أخذ المضاجع والاستعداد للنوم: فقد وصَّى النبي صلى الله عليه وسلم علي وفاطمة بذلك وقال: \"ألا أدلكما على خير مما سألتمان؟ إذا أخذتما مضاجعكما، فكبرا الله أربعاً وثلاثين، واحمدا ثلاثاً وثلاثين، وسبحا ثلاثاً وثلاثين، فإن ذلك خير لكما من خادم\" (5) .  9 - من تعارّ من الليل: كما في حديث عبادة بن الصامت قال: قال رسول الله صلى الله عليه: \"من تعارّ من الليل فقال حين يستيقظ لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله، ثم دعا رب اغفر لي- أو قال دعا- استجيب له فإن قام فتوضأ ثم صلى قبلت صلاته\" (6) .",
    "foot_note":"1. الأدب المفرد للبخاري (1\/ 218)، وصححه الألباني في صحيح الأدب المفرد (1\/ 241) برقم (622). \n2. صفة حج النبي صلى الله عليه وسلم للألباني (1\/ 54) برقم (79). \n3. سنن ابن ماجة (2\/ 1278)، وصححه الألباني في صحيح سنن ابن ماجة برقم (3883). \n4. أخرجه ابن حبان في صحيحه (12\/ 338)، والنسائي (6\/ 202)، وصححه الألباني في الصحيح برقم (3414). \n5. أخرجه أحمد (2\/ 141) والترمذي (5\/ 477)، وصححه الألباني في صحيح الجامع برقم (2619). \n6. أخرجه أبو داود (4\/ 474)، وابن ماجة (2\/ 1276)، وصححه الألباني في صحيح سنن ابن ماجة (3\/ 378) برقم (3878).",
    "book_id":"72"
  },
  {
    "serial_number":"4962112",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":31,
    "volume_number":1,
    "text":" المبحث الرابع: في بيان فضل الباقيات الصالحات تفضيلاً كما ورد في فضل الباقيات الصالحات أحاديث جملة؛ ورد فيها أيضاً أحاديث مفصلة تبين فضلها ومواضع قولها وصفاتها وكيفياتها، ومن خلال هذا المبحث نحاول جمع الأحاديث الواردة في فضل كل كلمة من الباقيات الصالحات مع بيان فضلها وذلك من خلال خمسة مطالب: المطلب الأول: في بيان فضل التسبيح. المطلب الثاني: في بيان فضل التحميد. المطلب الثالث: في بيان فضل كلمة التوحيد. المطلب الرابع: في بيان فضل التكبير. المطلب الخامس: في بيان فضل الحوقلة.",
    "foot_note":"None",
    "book_id":"72"
  },
  {
    "serial_number":"4962113",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":32,
    "volume_number":1,
    "text":" المطلب الأول: في بيان فضل التسبيح في هذا المطلب نتحدث عن التسبيح من خلال الفرعين الآتيين: -  الفرع الأول: في فضل التسبيح: والأحاديث الواردة في فضل التسبيح منها ما هو مطلق، ومنها ما هو مقيد باسم لله أو صفة أو عدد وسنبدأ بذكر ما ورد من فضل مطلق للتسبيح ثم يتلوه ما ورد مقيداً من خلال الآتي:  أ) ما ورد في فضل التسبيح المطلق:  1 - عِظم أجر قائله: - ففي حديث مصعب بن سعد قال: حدثني أبي قال: كنا عند رسول الله صلى الله عليه وسلم فقال: \"أيعجز أحدكم أن يكسب كل يوم ألف حسنة؟ \" فسأله سائل من جلسائه: كيف يكسب أحدنا ألف حسنة قال: \"سبح مائة تسبيحة، فتكتب له ألف حسنة، أو تحط عنه ألف خطيئة\" (1) . - وفي حديث أم هانئ- السابق- أن النبي صلى الله عليه وسلم قال لها: \"سبحي الله مائة تسبيحة فإنها تعدل لك مائة رقبة تعتقينها من ولد إسماعيل … \" ( 2). 2 - أنها صدقة من الصدقات: لحديث أبي ذر- السابق- وفيه: \"إن بكل تسبيحة صدقة … \" ( 3). 3 - أنها تملأ ما بين السماء والأرض: لما صح في حديث أبي مالك الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم قال: \" … وسبحان الله والحمد لله تملآن- أو تملأ- ما بين السماء والأرض … \" (4) .  ب) ما ورد في فضل التسبيح المقيد (باسم أو صفة لله أو عدد):  1 - أنه ثقيل في الميزان حبيب إلى الرحمن: كما في الصحيح من حديث أبي هريرة رضي الله عنه قال: قال النبي صلى الله عليه وسلم: \"كلمتان خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن سبحان الله وبحمده، سبحان الله العظيم\" (5) .  2 - أنه أحب الكلام إلى الله: لما في صحيح مسلم من حديث أبي ذر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"ألا أخبرك بأحب الكلام إلى الله؟ \" قلت: يا رسول الله: أخبرني بأحب الكلام إلى الله؟ فقال: \"إن أحب الكلام إلى الله؛ سبحان الله وبحمده\" (6) .  3 - أنه أفضل الكلام ولذا اصطفاه الله لعباده: ففي صحيح مسلم أن رسول الله صلى الله عليه وسلم سُئل: أي الكلام أفضل؟ قال: \"ما اصطفى الله لملائكته أو لعباده، سبحان الله وبحمده\" (7) .  4 - أنه غراس الجنة: كما في حديث عبد الله بن عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: \"من قال: سبحان الله وبحمده؛ غُرست له نخلة في الجنة\" (8) . وفي رواية عنه قال: \"سبحان الله العظيم وبحمده؛ غرست له شجرة في الجنة\" (9) .",
    "foot_note":"1. رواه مسلم (4\/ 2073) برقم (2698). \n2. سبق تخريجه. \n3. سبق تخريجه. \n4. سبق تخريجه. \n5. رواه البخاري (8\/ 107)، ومسلم (4\/ 2072). \n6. رواه مسلم (4\/ 2093) رقم (2731). \n7. رواه مسلم (4\/ 2093) برقم (2731). \n8. سبق تخريجه. \n9. صحيح ابن حبان (3\/ 109) برقم (827) وصححه الألباني في الصحيح برقم (64). وصححه الألباني في صحيح الترغيب برقم (1543).",
    "book_id":"72"
  },
  {
    "serial_number":"4962114",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":33,
    "volume_number":1,
    "text":" 5 - أن التسبيح سبب من أسباب الرزق: كما في حديث سليمان بن يسار عن رجل من الأنصار أن النبي صلى الله عليه وسلم قال: \"قال نوح لابنه: إني موصيك بوصية وقاصرها لكي لا تنساها؛ أوصيك باثنيتن وأنهاك عن اثنتين: أما اللتان أوصيك بهما فيستبشر الله بهما وصالح خلقه، وهما يُكثران الولوج على الله- وذكر منهما- وأوصيك بسبحان الله وبحمده؛ فإنهما صلاة الخلق، وبهما يرزق الخلق، [وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كَانَ حَلِيمًا غَفُورًا] (1) (2) .  6 - أنه يقوم مقام أمهات العبادات كالقيام والإنفاق والجهاد حال التطوع: لحديث أبي أمامة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من هاله الليل أن يكابده، أو بخل بالمال أن ينفقه، أو جَبُن عن العدو أن يقاتله، فليكثر من سبحان الله وبحمده؛ فإنها أحب إلى الله من جبل ذهب ينفقه في سبيل الله عز وجل\" (3) .  7 - أنه سبب لمغفرة الذنوب والخطايا: كما في حديث أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال: \"ومن قال سبحان الله وبحمده في يوم مائة مرة، غفرت له ذنوبه وإن كانت مثل زبد البحر\" (4) . وفي رواية: \"من قال سبحان الله وبحمده حَطَّ الله عنه ذنوبه وإن كانت أكثر من زبد البحر\" (5) .",
    "foot_note":"1. الإسراء (44). \n2. رواه النسائي في السنن الكبرى (6\/ 208) برقم (106608)، وصححه الألباني في صحيح الترغيب برقم (1543). \n3. رواه الطبراني (7\/ 216)، وصححه الألباني في صحيح الترغيب برقم (1541). \n4. سنن الترمذي (5\/ 511)، وصححه الألباني برقم (3466). \n5. رواه النسائي في السنن الكبرى (6\/ 207)، وصححه الألباني في صحيح الترغيب برقم (1542).",
    "book_id":"72"
  },
  {
    "serial_number":"4962115",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":35,
    "volume_number":1,
    "text":" 8 - مضاعفة الأجر لقائلها: ثبت ذلك في حديث جويرية رضي الله عنها أن النبي صلى الله عليه وسلم خرج من عندها ثم رجع بعد أن أضحى وهي جالسة فقال: \"ما زلت على الحال التي فارقتك عليها؟ \" قالت: نعم. قال النبي صلى الله عليه وسلم: \"لقد قلت بعدك أربع كلمات ثلاث مرات، لو وزنت بما قلت منذ اليوم لوزنتهن: سبحان الله وبحمده عدد خلقه، ورضا نفسه، وزنة عرشه، ومداد كلماته (1) \".  9 - أنه جامعة الذكر . لحديث أبي أمامة رضي الله عنه قال: رآني النبي صلى الله عليه وسلم وأنا أحرك شفتي، فقال لي: بأي شيء تحرك شفتيك يا أبا أمامة؟ فقلت: أذكر الله يا رسول الله؟ فقال: \"ألا أخبرك بأكثر وأفضل من ذكرك بالليل والنهار؟ \" قلت: بلى يا رسول الله. قال: \"تقول: سبحان الله عدد ما خلق، سبحان الله ملء ما خلق، سبحان الله عدد ما في الأرض، سبحان الله عدد ما أحصى كتابه، سبحان الله ملء ما أحصى كتابه، سبحان الله عدد كل شيء، سبحان الله ملء كل شيء … \" (2) .  الفرع الثاني: في مواضع التسبيح: ورد في السنة المطهرة التسبيح في عدة مواطن منها:  1 - عند الاستبشار بنصر الدين: لما ثبت عن أم المؤمنين عائشة رضي الله عنها قالت: \"كان في آخر أمره يكثر من قول سبحان الله وبحمده، أستغفر الله وأتوب إليه [قالت عائشة]: فقلت: يا رسول الله مالي أراك تكثر من قول سبحان الله وبحمده أستغفر الله وأتوب إليه. قال: إن ربي أخبرني أني سأرى علامة في أمتي، وأمرني- إذا رأيت تلك العلامة- أن أسبح بحمده وأستغفره، فقد رأيتها [إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ (1) وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا (2) فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا (3)] \" (3) .",
    "foot_note":"1. رواه مسلم (4\/ 2090) برقم (2726). \n2. صحيح ابن حبان (3\/ 111) برقم (830)، وابن خزيمة (1\/ 371) برقم (754) وصححه الألباني في صحيح الترغيب برقم (1575) وحسنه الأرنؤوط في صحيح ابن حبان (3\/ 111) برقم (830). \n3. أخرجه مسلم (2\/ 50) برقم (1116).",
    "book_id":"72"
  },
  {
    "serial_number":"4962116",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":36,
    "volume_number":1,
    "text":" 2 - عند ختم المجلس اللغو: وقد جاء فيه عدة أحاديث أتمها حديث جبير بن مطعم عن أبيه مرفوعاً: \"من قال سبحان الله وبحمده، سبحانك اللهم وبحمدك أشهد ألا إله إلا أنت أستغفرك وأتوب إليك، فقالها في مجلس ذكر كانت كالطابع يطبع عليها ومن قالها في مجلس لغو كانت له كفارة\" (1) . ومما ورد عند ختم المجلس أيضاً: - حديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من جلس في مجلس فكثر فيه لغطه فقال قبل أن يقوم من مجلسه ذلك: سبحانك اللهم وبحمدك أشهد ألا إله إلا أنت أستغفرك وأتوب إليك إلا كَفَّر الله له ما كان في مجلسه ذلك\" (2) .  3 - عند التعجب من الشيء: لحديث ذكوان عن رجل من الأنصار قال: عاد رسول الله صلى الله عليه وسلم رجلاً به جرح، فقال رسول الله صلى الله عليه وسلم: \"ادعوا له طبيب بني فلان. فقال فدعوه فجاء فقال: يا رسول الله أو يغني الدواء شيئاً؟ فقال: سبحان الله، وهل أنزل الله داء في الأرض إلا جعل له شفاء\" (3) . - ولحديث أبي هريرة رضي الله عنه قال: رأيت رسول الله صلى الله عليه وسلم في طريق من طرق المدينة وأنا جُنُب فاختنست فذهبت فاغتسلت ثم جئت، فقال: أين كنت يا أبا هريرة؟ قال: قلت: إني كنت جُنباً فكرهت أن أجالسك على غير طهارة، فقال: سبحان الله إن المؤمن لا ينجس\" ( 4). 4 - قبل طلوع الشمس وقبل غروبها: - كما في حديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من قال حين يصبح وحين يمسي سبحان الله العظيم وبحمده مائة مرة لم يأتِ أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه\" (5) . - وحديث عمرو بن شعيب عن أبيه عن جده قال: قال رسول الله صلى الله عليه وسلم: \"من قال: سبحان الله مائة مرة قبل طلوع الشمس وقبل غروبها كان أفضل من مائة بدنة … \" (6) .",
    "foot_note":"1. أخرجه الطبراني (2\/ 139)، وصححه الألباني في السلسلة الصحيحة برقم (81). \n2. الترمذي (5\/ 371)، أحمد في المسند (16\/ 261) وهو في صحيح الكلم الطيب برقم (178). \n3. أخرجه أحمد (38\/ 227)، وصححه الألباني في الصحيح برقم (517). \n4. البخاري (1\/ 79) برقم (283)، صحيح مسلم بشرح النووي (1\/ 282) برقم (371). \n5. مسلم (4\/ 2071). \n6. سنن النسائي الكبرى (6\/ 205) وحسنه الألباني في صحيح الترغيب برقم (658).",
    "book_id":"72"
  },
  {
    "serial_number":"4962117",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":37,
    "volume_number":1,
    "text":"ولما ثبت عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من قال حين يصبح سبحان الله وبحمده مائة مرة وإذا أمسى مائة مرة غفرت ذنوبه وإن كانت أكثر من زبد البحر\" (1) .  5 - في الركوع والسجود: كما في صحيح مسلم من حديث أم المؤمنين عائشة رضي الله عنها قالت: \"كان رسول الله صلى الله عليه وسلم يكثر أن يقول في ركوعه وسجوده: \"سبحانك اللهم ربنا وبحمدك اللهم اغفر لي يتأول القرآن\" (2) . والمعنى كما قال النووي: \"أي يفعل ما أمر به فيه أي من قوله عز وجل فسبح بحمد ربك واستغفره إنه كان توابا\" (3) . كما في حديث حذيفة الطويل في صفة قيام النبي صلى الله عليه وسلم قال: \"ثم ركع يقول: سبحان ربي العظيم ثم سجد فقال: سبحان ربي الأعلى … \" (4) . وصح عن النبي صلى الله عليه وسلم: \"سبحان ربي العظيم وبحمده\" (5) . وصح عنه أيضا: \"سبوح قدوس رب الملائكة والروح\" (6) . وقد أورد أدلة هذه الأذكار المحدث الألباني -رحمه الله تعالى- في صفة صلاة النبي صلى الله عليه وسلم فليراجع.  6 - لمن نابه شيء في صلاته: لما في المسند من حديث المغيرة بن شعبة قال: أمَّنا رسول الله صلى الله عليه وسلم في الظهر أو العصر فقام فقلنا: سبحان الله وأشار بيده يعني قوموا، فقمنا فلما فرغ من صلاته سجد سجدتين ثم قال: \"إذا ذكر أحدكم قبل أن يستتم قائماً فليجلس، وإذا استتم قائماً، فلا يجلس\" (7) . ولما فيه أيضاً من حديث سهل عن سعد عن النبي صلى الله عليه وسلم قال: \"من نابه شيء في صلاته فليقل: سبحان الله؛ إنما التصفيق للنساء والتسبيح للرجال\" (8) .",
    "foot_note":"1. صحيح ابن حبان (3\/ 141) برقم (859) وصححه الأرنؤوط. \n2. أخرجه مسلم (1\/ 350) برقم (484). \n3. صحيح مسلم بشرح النووي (1\/ 350). \n4. أخرجه النسائي (1\/ 246)، والحاكم (1\/ 321)، وصححه الحاكم والألباني في صفة صلاة النبي صلى الله عليه وسلم (2\/ 650). \n5. صفة صلاة النبي صلى الله عليه وسلم للألباني (2\/ 658). \n6. صفة صلاة النبي صلى الله عليه وسلم للألباني (2\/ 659). \n7. مسند أحمد (30\/ 161) برقم (18222)، قال الأرنؤوط: صحيح بطرقه. \n8. مسند الإمام أحمد (37\/ 461) برقم (22801)، قال الأرنؤوط: إسناده صحيح على شرطهما.",
    "book_id":"72"
  },
  {
    "serial_number":"4962118",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":38,
    "volume_number":1,
    "text":" المطلب الثاني: في بيان فضل التحميد نتحدث بعون الله تعالى على التحميد من خلال الفرعين الآتيين:  الفرع الأول: في فضل التحميد: ورد في فضل التحميد أحاديث منها ما هو مطلق ومنها ما هو مقيد بصفة أو عدد وسنبدأ بذكر ما ورد في التحميد المطلق ثم يتلوه ما كان مقيداً من خلال الآتي:  أ) ما ورد في فضل التحميد المطلق:  1 - أنه أفضل أنواع الشكر: كما في حديث جابر رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"أفضل الذكر لا إله إلا الله وأفضل الشكر الحمد لله\" (1) .  2 - التحميد أول ما نطق به آدم عليه السلام بعد نفخ الروح فيه: لما ثبت في حديث أنس رضي الله عنه مرفوعاً: \"لما نفخ في آدم الروح، فبلغ الروح رأسه عطس، فقال: الحمد لله رب العالمين، فقال له تبارك وتعالى: يرحمك الله\" (2) .  3 - أنه أفضل الدعاء: كما في حديث جابر بن عبد الله رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"أفضل الذكر لا إله إلا الله، وأفضل الدعاء الحمد لله\" (3) .",
    "foot_note":"1. السلسلة الصحيحة للألباني (3\/ 484) برقم (1497). \n2. أخرجه الحاكم (4\/ 292) وصححه الألباني في الصحيح (5\/ 158) برقم (2159). \n3. رواه ابن ماجة (2\/ 1249) وابن حبان، وحسنه الأرنؤوط في صحيح ابن حبان (3\/ 126) برقم (846).",
    "book_id":"72"
  },
  {
    "serial_number":"4962119",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":39,
    "volume_number":1,
    "text":" 4 - أنه أحب شيء إلى الله: كما في حديث أنس بن مالك رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"التأني من الله، والعجلة من الشيطان، وما أحد أكثر معاذير من الله، وما من شيء أحب إلى الله من الحمد\" (1) .  ب) ما ورد في فضل التحميد المقيد بصفة أو عدد:  1 - أنه سبب لنيل رحمة الله: ثبت ذلك من حديث أبي سعيد مرفوعاً: \"إذا قال العبد الحمد لله كثيرا، قال الله تعالى: اكتبوا لعبدي رحمتي كثيراً\" ( 2). 2 - أنه يملأ ميزان العبد يوم القيامة: كما في حديث أبي مالك الأشعر رضي الله عنه عن النبي صلى الله عليه وسلم قال: \" … والحمد لله تملأ الميزان .. \" ( 3). 3 - عِظم الأجر: ورد في أجر الحمد أحاديث كثيرة تبين عظم أجر قائلها وهذه الأحاديث: أ) حديث مصعب بن سعد عن أبيه رضي الله عنه، أن أعرابياً قال للنبي صلى الله عليه وسلم: علمني دعاء لعل الله أن ينفعني به، \"قال: قل اللهم لك الحمد كله وإليك يرجع الأمر كله\" (4) .",
    "foot_note":"1. رواه أبو يعلى (7\/ 247) ورجاله رجال الصحيح، وحسنه الألباني في صحيح الترغيب (2\/ 242) برقم (1572). \n2. مصنف ابن أبي شيبة (6\/ 56)، وحسنه الألباني في صحيح الترغيب (2\/ 115) برقم (1578). \n3. سبق تخريجه. \n4. رواه البيهقي (6\/ 231) وحسنه الألباني في صحيح الترغيب (2\/ 114) رقم (1576).",
    "book_id":"72"
  },
  {
    "serial_number":"4962120",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":40,
    "volume_number":1,
    "text":"ب) حديث أبي أمامة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"أفلا أخبرك بشيء إذا قلته ثم دأبت الليل والنهار لم تبلغه، قلت: بلى، قال: تقول: الحمد لله عدد ما أحصى كتابه، والحمد لله عدد ما في كتابه، والحمد لله ما أحصى خلقه، والحمد لله ملء ما في خلقه، والحمد لله ملء سماواته وأرضه، والحمد لله عدد كل شيء والحمد لله على كل شيء .. \" (1) . ــ وفي رواية: \"ألا أدلك على ما هو أكثر من ذكرك الله الليل مع النهار؟ تقول: \"الحمد لله عدد ما خلق، والحمد لله ملء ما خلق، والحمد لله عدد ما في السماوات وما في الأرض، والحمد لله عدد ما أحصى كتابه، والحمد لله على ما أحصى كتابه، والحمد لله عدد كل شيء والحمد لله ملء كل شيء .. \" (2) . د) حديث أم هانئ رضي الله عنها وفيه أن النبي صلى الله عليه وسلم قال لها: \" … واحمدي الله مائة تحميدة؛ فإنها تعدل لك مائة فرس مُسرجة مُلجمة تحملين عليها في سبيل الله .. \" (3) .  الفرع الثاني: في مواضع التحميد: وردت أحاديث كثيرة بالتحميد في عدة مواضع منها:  1 - عند ظهور ما يَسُر: لما في البخاري من حديث أنس رضي الله عنه قال: \"كان غلام يهودي يخدم النبي صلى الله عليه وسلم فمرض فأتاه النبي صلى الله عليه وسلم يعوده، فقعد عند رأسه، فقال له: أسْلِم، فنظر إليه أبوه وهو عنده، فقال له: أطع أبا القاسم صلى الله عليه وسلم، فأسلم، فخرج النبي صلى الله عليه وسلم وهو يقول: الحمد لله الذي أنقذه من النار\" (4) .",
    "foot_note":"1. أخرجه الطبراني (7\/ 273) وصححه الألباني في صحيح الترغيب (2\/ 246) برقم (1575). \n2. أخرجه الطبراني (7\/ 341) وصححه الألباني في صحيح الجامع (10\/ 327) برقم (4380). \n3. حديث حسن سبق تخريجه. \n4. البخاري (2\/ 18) برقم (1356).",
    "book_id":"72"
  },
  {
    "serial_number":"4962121",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":41,
    "volume_number":1,
    "text":" 2 - عند العطاس: كما في حديث أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"إذا عطس أحدكم فليقل الحمد لله وليقل له أخوه، أو صاحبه يرحمك الله، فإذا قال له يرحمك الله، فليقل يهديكم الله ويصلح بالكم\" (1) . وفي لفظ للطبراني: \"يغفر الله لنا ولكم\" (2) .  3 - عند الاستيقاظ من النوم: لحديث حذيفة رضي الله عنه قال: \"كان النبي صلى الله عليه وسلم إذا أخذ مضجعه من الليل وضع يده تحت خده ثم يقول: اللهم باسمك أموت وأحيا، وإذا استيقظ قال: الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور\" (3) . وفي رواية: \"إذا استيقظ أحدكم فليقل الحمد لله الذي عافاني في جسدي ورد عليَّ روحي وأذِن لي بذكره\" ( 4). 4 - إذا افتتح الصلاة: وقد ثبت افتتاح الصلاة بالحمد في عدة كيفيات:  أ) الكيفية الأولى: عن أنس أن رجلاً جاء فدخل الصف وقد حفزه النفس، فقال: الحمد لله حمداً كثيراً طيباً مباركاً فيه، فلما قضى رسول الله صلى الله عليه وسلم صلاته، قال: أيكم المتكلم بالكلمات؟ فأرم القوم فقال أيكم المتكلم بها؟ فإنه لم يقل بأساً، فقال رجل: جئت وقد حفزني في النفس، فقلتها؛ فقال: لقد رأيت اثني عشر ملكاً يبتدرونها أيهم يرفعها\" (5) . والمعنى كما قال النووي في حفزه النفس: \"أي ضغطه لسرعته ليدرك الصلاة وفارم القوم أي سكتوا\" (6) .",
    "foot_note":"1. البخاري (8\/ 61) برقم (6244). \n2. معجم الطبراني وصححه الألباني في صحيح الجامع برقم (688). \n3. البخاري (8\/ 15) برقم (6314)، صحيح مسلم بشرح النووي (4\/ 2083) برقم (2711). \n4. صحيح الكلم الطيب للألباني (1\/ 77) برقم (34). \n5. صحيح مسلم بشرح النووي (1\/ 419) برقم (600). \n6. صحيح مسلم بشرح النووي (1\/ 419).",
    "book_id":"72"
  },
  {
    "serial_number":"4962122",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":42,
    "volume_number":1,
    "text":" الكيفية الثانية: عن ابن عباس رضي الله عنهما قال: كان النبي صلى الله عليه وسلم إذا قام من الليل يتهجد قال: \"اللهم لك الحمد، أنت نور السماوات والأرض ومن فيهن، ولك الحمد أنت قيم السماوات والأرض ومن فيهن، ولك الحمد أنت مَلِك السماوات والأرض ومن فيهن ولك الحمد أنت الحق ووعدك حق، وقولك حق، ولقاؤك حق، والجنة حق، والنار حق، والساعة حق، والنبيون حق، ومحمد حق … \" (1) .  5 - عند افتتاح القراءة: لما صح عن أنس رضي الله عنه \"أن النبي صلى الله عليه وسلم وأبا بكر وعمر رضي الله عنهما كانوا يفتتحون الصلاة بالحمد لله رب العالمين\" (2) .  6 - عند ركوب الدابة: لما ثبت من حديث علي بن ربيعة \"أنه كان ردفاً لعلي رضي الله عنه، فلما وضع رجله في الركاب قال: بسم الله، فلما استوى على ظهر الدابة قال: الحمد لله ثلاثاً، والله أكبر ثلاثاً، وسبحان الذي سخر لنا هذا وما كنا له مقرنين، ثم قال: لا إله إلا أنت سبحانك إني قد ظلمت نفسي فاغفر لي ذنوبي؛ إنه لا يغفر الذنوب إلا أنت، ثم مال إلى أحد شقيه فضحك، فقلت: يا أمير المؤمنين ما يضحكك؟ قال: إني كنت ردف النبي صلى الله عليه وسلم، فصنع رسول الله صلى الله عليه وسلم كما صنعت، فسأله كما سألني، فقال رسول الله صلى الله عليه وسلم: إن الله ليعجب إلى العبد إذا قال: لا إله إلا أنت إني قد ظلمت نفسي، فاغفر لي ذنوبي إنه لا يغفر الذنوب إلا أنت، قال: عبدي عرف أن له رباً يغفر ويعاقب\" (3) .",
    "foot_note":"1. أخرجه البخاري (2\/ 61)، ومسلم بشرح النووي (1\/ 532). \n2. أخرجه البخاري (8\/ 189) برقم (743). \n3. أخرجه الحاكم (2\/ 108) وصححه الألباني في الصحيح (4\/ 211) برقم (1653).",
    "book_id":"72"
  },
  {
    "serial_number":"4962123",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":43,
    "volume_number":1,
    "text":" 7 - عند التعجب من شيء: لما ثبت في البخاري من حديث أم المؤمنين عائشة رضي الله عنها قالت: \"الحمد لله الذي وسع سمعه الأصوات، فأنزل الله تعالى على النبي صلى الله عليه وسلم [قَدْ سَمِعَ اللَّهُ قَوْلَ الَّتِي تُجَادِلُكَ فِي زَوْجِهَا] \" (1) .  8 - عند النوم وأخذ المضجع: لحديث أنس رضي الله عنه أن رسول الله صلى الله عليه وسلم كان إذا أوى إلى فراشه قال: \"الحمد لله الذي أطعمنا وسقانا وكفانا وآوانا فكم ممن لا كافي له ولا مؤوي\" (2) . وفي رواية: \"من قال إذا أوى إلى فراشه الحمد لله الذي كفاني وآواني، الحمد لله الذي أطعمني وسقاني، الحمد لله الذي مَّنَّ عليَّ وأفضل، إني أسألك بعزتك أن تنجيني من النار، فقد حمد الله بجميع محامد الخلق كلهم\" (3) .  9 - عند افتتاح الحديث: وقد ثبت ذلك في حديث عبد الله بن مسعود رضي الله عنه قال: \"علمنا رسول الله صلى الله عليه وسلم التشهد في الصلاة، والتشهد في الحاجة إن الحمد لله [نحمده] ونستعينه ونستغفره ونعوذ بالله من شرور أنفسنا وسيئات أعمالنا، فمن يهده الله فلا مضل له، ومن يضلل فلا هادي له … \" (4) .  10 - إذا رأى ما يحب أو ما يكره: لما ثبت عن أم المؤمنين عائشة رضي الله عنها قالت: \"كان صلى الله عليه وسلم إذا رأى ما يجب قال: الحمد لله الذي بنعمته تتم الصالحات، وإذا رأى ما يكره قال: الحمد لله على كل حال\" (5) .",
    "foot_note":"1. صحيح البخاري (9\/ 143) برقم (7385). \n2. صحيح مسلم بشرح النووي (4\/ 2085) برقم (2715). \n3. أخرجه الحاكم (1\/ 730)، وصححه الألباني في السلسلة الصحيحة (15\/ 20) برقم (3444). \n4. صححه الألباني في صحيح الكلم الطيب (1\/ 159) برقم (206)، خطبة الحاجة للألباني (8). \n5. أخرجه ابن ماجة (2\/ 422) والحاكم (1\/ 677) وصححه الألباني في السلسلة الصحيحة برقم (265).",
    "book_id":"72"
  },
  {
    "serial_number":"4962124",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":44,
    "volume_number":1,
    "text":" 11 - إذا رأى مبتلى: كما في حديث ابن عمر: \"من رأى مبتلى فقال: الحمد لله الذي عافاني مما ابتلاك به وفضلني على كثير ممن خلق تفضيلاً، لم يصبه ذلك البلاء\" (1) . وفي رواية: \"كان شكر تلك النعمة\" (2) .  12 - إذا أكل أو شرب أو رفع مائدته استحب له الحمد: كما في حديث أنس قال: قال رسول الله صلى الله عليه وسلم: \"إن الله ليرضى عن العبد أن يأكل الأكلة فيحمده عليها، أو يشرب الشربة فيحمده عليها\" (3) . ولما ثبت في حديث أبي أيوب الأنصاري قال: \"كان رسول الله صلى الله عليه وسلم إذا أكل أو شرب قال: الحمد لله الذي أطعم وسقى وسوغه، وجعل له مخرجاً\" (4) . وفي حديث أبي أمامة رضي الله عنه أن النبي صلى الله عليه وسلم كان إذا رفع مائدته قال: \"الحمد لله كثيراً طيباً مباركاً فيه غير مكفي ولا مودع ولا مستغنى عنه ربنا\" (5) . ولما في حديث معاذ بن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من أكل طعاماً فقال: الحمد لله الذي أطعمني هذا ورزقنيه من غير حول مني ولا قوة غفر له ما تقدم من ذنبه\" (6) . وفي حديث أبي أمامة أيضاً قال: كان إذا رفع مائدته قال: \"الحمد لله حمداً كثيراً طيباً مباركاً فيه، الحمد لله الذي كفانا وآوانا غير مكفي ولا مكفور ولا مستغنى عنه ربنا\" (7) .",
    "foot_note":"1. أخرجه الطبراني في الأوسط برقم (5457) وصححه الألباني في السلسلة الصحيحة برقم (2737). \n2. صحيح الجامع للألباني (2\/ 56) برقم (556). \n3. صحيح مسلم بشرح النووي (4\/ 2095) برقم (2734). \n4. أخرجه أبو داود (3\/ 432)، وابن حبان في صحيحه (12\/ 23) وصححه الألباني في الصحيح (5\/ 93) برقم (2061). \n5. صحيح البخاري (1\/ 2813) برقم (5458). \n6. حسنه الألباني في صحيح الكلم الطيب (1\/ 151) برقم (188). \n7. أخرجه أحمد (29\/ 613)، وأبو داود (38\/ 43)، وصححه الألباني في صحيح الجامع برقم (8862).",
    "book_id":"72"
  },
  {
    "serial_number":"4962125",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":45,
    "volume_number":1,
    "text":" 13 - حمد الله عند الولادة: لما في حديث كثير بن عبيد قال: \"كانت عائشة رضي الله عنها إذا ولد فيهم مولود- يعني في أهلها-: لا تسأل غلاماً ولا جارية، تقول: خُلِق سوياً؟ فإذا قيل: نعم، قالت: الحمد لله رب العالمين\" ( 1). 14 - الحمد عند الدعاء: كما في حديث فضالة بن عبيد رضي الله عنه قال: بينما رسول الله صلى الله عليه وسلم قاعداً إذ دخل رجل فصلى فقال: \"اللهم اغفر لي وارحمني\"، فقال رسول الله صلى الله عليه وسلم: \"عجلت أيها المُصَلِّي! إذا صليت فقعدت فاحمد الله بما هو أهله، وصلِّ عليَّ ثم ادعه\". قال: ثم صلى رجل آخر بعد ذلك، فحمد الله وصلى على النبي صلى الله عليه وسلم، فقال له النبي صلى الله عليه وسلم: \"أيها المُصَلِّي ادع تُجَبْ\" (2) .  15 - حمد الله عند تجدد النعم: لحديث أبي أمامة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"ما أنعم الله عز وجل على نعمة فحمد الله عز وجل إلا كان ذلك أفضل من تلك النعمة … \" (3) .",
    "foot_note":"1. صحيح الأدب المفرد بتحقيق الألباني (2\/ 13) وقال: \"حسن الإسناد موقوفاً\". \n2. الترمذي واللفظ له (5\/ 516)، صححه الألباني في صحيح الترغيب (2\/ 281) برقم (1643). \n3. رواه الطبراني (7\/ 214)، وحسنه الألباني في صحيح الترغيب (2\/ 243) برقم (1573).",
    "book_id":"72"
  },
  {
    "serial_number":"4962126",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":46,
    "volume_number":1,
    "text":" المطلب الثالث: في بيان فضل كلمة التوحيد والحديث عن كلمة التوحيد سيكون من خلال الفرعين الآتيين:  الفرع الأول: في فضل كلمة التوحيد: كلمة التوحيد هي: \"لا إله إلا الله\" وقد ورد في فضائلها أحاديث كثيرة عن خير البرية صلى الله عليه وسلم منها:  1 - أنها ركن الإسلام الأعظم: لحديث ابن عمر رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: \"بُني الإسلام على خمس: شهادة أن لا إله إلا الله، وأن محمداً رسول الله، وإقام الصلاة وإيتاء الزكاة، والحج، وصوم رمضان\" (1) .  2 - العاصمة المانعة: كما في حديث ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال: \"أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله، وأن محمداً رسول الله، ويقيموا الصلاة، ويؤتوا الزكاة، فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحق الإسلام وحسابهم على الله\" (2) .  3 - المُنجية من النار: كما ثبت في حديث أنس رضي الله عنه، عن النبي صلى الله عليه وسلم قال: يخرج من النار من قال: \"لا إله إلا الله وفي قلبه وزن شعيرة من خير، ويخرج من النار من قال: لا إله إلا الله، وفي قلبه وزن بُرة من خير، ويخرج من النار من قال: لا إله الله وفي قلبه وزن ذَرَّةٍ من خير\" (3) .",
    "foot_note":"1. صحيح البخاري (1\/ 9) برقم (8)، صحيح مسلم بشرح النووي (1\/ 45) برقم (16). \n2. صحيح البخاري (1\/ 13) برقم (25)، صحيح مسلم بشرح النووي (1\/ 53) برقم (22). \n3. صحيح البخاري (1\/ 17) برقم (44)، صحيح مسلم بشرح النووي (1\/ 180) برقم (325).",
    "book_id":"72"
  },
  {
    "serial_number":"4962127",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":47,
    "volume_number":1,
    "text":" 4 - مفتاح الدخول في الإسلام: لما في حديث ابن عباس رضي الله عنهما قال: إن وفد عبد القيس لما أتوا النبي صلى الله عليه وسلم قال لهم: \"أتدرون ما الإيمان بالله وحده، قالوا الله ورسوله أعلم قال: شهادة أن لا إله إلا الله، وأن محمداً رسول الله، وإقام الصلاة وإيتاء الزكاة، وصيام رمضان … \" (1) . - وفي حديث معاذ حين بعثه رسول الله صلى الله عليه وسلم إلى اليمن قال: \"فإذا جئتهم فادعهم إلى أن يشهدوا أن لا إله إلا الله وأن محمداً رسول الله … \" (2) .  5 - من قالها كان أسعد الناس بشفاعة النبي صلى الله عليه وسلم: لحديث أبي هريرة رضي الله عنه أنه قال: قيل يا رسول الله من أسعد الناس بشفاعتك يوم القيامة؟ قال رسول الله صلى الله عليه وسلم: \"لقد ظننت يا أبا هريرة أن لا يسألني عن هذا الحديث أحد أول منك لما رأيت من حرصك على الحديث، أسعد الناس بشفاعتي يوم القيامة من قال: لا إله إلا الله خالصاً من قلبه … \" (3) .  6 - تورث الجنان، وتحرم من دخول النيران: كما في حديث أنس رضي الله عنه أن النبي صلى الله عليه وسلم ومعاذ رديفه على الرحل قال: يا معاذ بن جبل، قال: لبيك يا رسول الله وسعديك، قال: يا معاذ. قال: لبيك يا رسول الله وسعديك ثلاثاً قال: \"ما من أحدٍ يشهد أن لا إله إلا الله، وأن محمداً رسول الله صدقاً من قلبه إلا حرمه الله على النار، قال: يا رسول الله أفلا أخبر به الناس فيستبشروا، قال: إذاً يتكلوا وأخبر بها معاذ عند موته تأثماً\" (4) . - وفي حديث عتبان بن مالك رضي الله عنه قال صلى الله عليه وسلم: \" … فإن الله قد حرم على النار من قال لا إله إلا الله يبتغي بذلك وجه الله\" (5) .",
    "foot_note":"1. صحيح البخاري (1\/ 21) برقم (53). \n2. صحيح البخاري (5\/ 158) برقم (1496). \n3. صحيح البخاري (1\/ 36) برقم (99). \n4. صحيح البخاري (1\/ 44) برقم (128)، صحيح مسلم بشرح النووي (1\/ 61) برقم (32). \n5. صحيح البخاري (1\/ 116) برقم (425).",
    "book_id":"72"
  },
  {
    "serial_number":"4962128",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":48,
    "volume_number":1,
    "text":"- وقال صلى الله عليه وسلم: \"أبشروا وبشروا الناس من قال لا إله إلا الله صادقاً بها دخل الجنة\" (1) . - وفي حديث عبادة بن الصامت رضي الله عنه، عن النبي صلى الله عليه وسلم: \"قال من شهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله، وأن عيسى عبد الله ورسوله وكلمته ألقاها إلى مريم وروحٌ منه، والجنة حق والنار حق أدخله الله الجنة على ما كان من العمل\" (2) .  7 - تفتح لها أبواب السماء حتى تفضي إلى العرش: لحديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"ما قال عبد لا إله إلا الله قط مخلصاً إلا فتحت له أبواب السماء حتى يفضي إلى العرش، ما اجتنب الكبائر\" (3) .  8 - أنها أفضل الذكر: كما في حديث جابر رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"أفضل الذكر لا إله إلا الله وأفضل الدعاء الحمد لله\" (4) .  9 - الجامعة النافعة: لما ثبت في حديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من قال لا إله إلا الله، نفعته يوماً من دهره، يُصيبه قبل ذلك ما أصابه\" (5) .  10 - الحسنة الماحية: كما في حديث عبد الله بن مسعود رضي الله عنه: \"من جاء بالحسنة\" قال: من جاء بلا إله إلا الله، \"ومن جاء بالسيئة\" قال: من جاء بالشرك (6) .",
    "foot_note":"1. أخرجه أحمد السلسلة الصحيحة (388) برقم (1314). \n2. صحيح البخاري (4\/ 201) برقم (3435)، واللفظ للبخاري، صحيح مسلم بشرح النووي (1\/ 57) برقم (28). \n3. رواه الترمذي (5\/ 575)، وحسنه الألباني في صحيح الترغيب (2\/ 220) برقم (1524). \n4. رواه ابن ماجة (2\/ 1249)، والنسائي (6\/ 208)، وحسنه الألباني في صحيح الترغيب (2\/ 221) برقم (1526). \n5. رواه البزار (15\/ 66)، والطبراني (4\/ 12)، وصححه الألباني في صحيح الترغيب (2\/ 221) برقم (1525). \n6. رواه الحاكم (2\/ 406)، وصححه الألباني موقوفاً (2\/ 221) برقم (1527).",
    "book_id":"72"
  },
  {
    "serial_number":"4962129",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":49,
    "volume_number":1,
    "text":"- وفي حديث أم هانئ قال صلى الله عليه وسلم: \"وهللِّي الله مائة تهليلة، لا تذر ذنباً ولا يسبقها عمل\" ( 1). 11 - وازنة السماوات والأرض: ثبت ذلك من حديث عبد الله بن عمر قال: قال رسول الله صلى الله عليه وسلم: \"ألا أخبركم بوصية نوح ابنه؟ قالوا: بلى. قال: وأوصى نوحٌ ابنه فقال لابنه: يا بني أوصيك باثنتين، وأنهاك عن اثنتين، أوصيك بقول: لا إله إلا الله؛ فإنها لو وضعت في كفة، ووضعت السماوات والأرض في كفة لرجحت بهن، ولو كانت حلقة لقصمتهن حتى تخلص إلى الله .. \" (2) . - ومن حديث عبد الله بن عمرو بن العاص رضي الله عنهما؛ أن رسول الله صلى الله عليه وسلم قال: \"إن الله يستخلص رجلاً من أمتي على رؤوس الخلائق يوم القيامة، فينشر عليه تسعة وتسعين سجلاً، كل سجل مثل مد البصر، ثم يقول: أتنكر من هذا شيئاً؟ أظلمك كتبتي الحافظون؟ فيقول: لا يا رب، فيقول: أفلك عذر؟ فيقول: لا يا رب، فيقول الله تعالى: بلى إن لك عندنا حسنة؛ فإنه لا ظلم عليك اليوم، فتخرج بطاقة فيها أشهد أن لا إله إلا الله، وأشهد أن محمداً عبده ورسوله، فيقول: احْضُر وزنك، فيقول: يا رب ما هذه البطاقة مع هذه السجلات؟ فيقال: فإنك لا تُظلم، فتوضع السجلات في كفة، والبطاقة في كفة، فطاشت السجلات، وثقلت البطاقة، فلا يثقل مع اسم الله شيء\" (3) .  12 - معتقة الرقاب: كما في حديث أبي أيوب الأنصاري رضي الله عنه، أن رسول الله صلى الله عليه وسلم قال: \"من قال لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير عشر مرات، كان كمن أعتق أربعة أنفس من ولد إسماعيل\" (4) .",
    "foot_note":"1. مسند أحمد (6\/ 425)، وحسنه الألباني في صحيح الترغيب (2\/ 233) برقم (1553). \n2. سبق تخريجه. \n3. رواه الترمذي (5\/ 24)، وابن ماجة (2\/ 1437)، وصححه الحاكم (1\/ 6)، وصححه الألباني في صحيح الترغيب (2\/ 223، 224) برقم (1533). \n4. صحيح مسلم بشرح النووي (4\/ 2071) برقم (2693).",
    "book_id":"72"
  },
  {
    "serial_number":"4962130",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":50,
    "volume_number":1,
    "text":"- وحديث أبي هريرة رضي الله عنه، أن رسول الله صلى الله عليه وسلم قال: \"من قال لا إله إلا الله وحده ولا شريك له، له الملك وله الحمد وهو على كل شيء قدير في يوم مائة مرة، كانت له عدل عشر رقاب، وكتبت له مائة حسنة، ومحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان يومه ذلك حتى يمسي، ولم يأتِ أحد بأفضل مما جاء به إلا أحد عمل أكثر من ذلك\" ( 1). 13 - خير ما قاله النبيون: ثبت ذلك من حديث عمرو بن شعيب عن أبيه عن جده؛ أن النبي صلى الله عليه وسلم قال: \"خير الدعاء الدعاء يوم عرفة، وخير ما قلت أنا والنبيون من قبلي لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير\" (2) .  14 - مالئة ما بين السماء والأرض: صح ذلك في حديث أم هانيء رضي الله عنها قال صلى الله عليه وسلم: \" … وهللي الله مائة تهليلة -قال ابن خلف-: أحسبه قال: تملأ ما بين السماء والأرض\" (3) .  15 - عظيمة الأجر: لحديث عبد الله بن عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: \"من قال لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير مائتي مرة في يوم لم يسبقه أحد كان قبله، ولم يدركه أحد بعده إلا من عمل بأفضل من عمله\" (4) .  16 - أفضل شُعب الإيمان وأعلاها: ثبت ذلك في حديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"الإيمان بضع وستون شُعبة، فأفضلها قول لا إله إلا الله وأدناها إماطة الأذى عن الطريق، والحياء شعبة من الإيمان\" (5) .",
    "foot_note":"1. أخرجه البخاري (8\/ 106) برقم (6404)، ومسلم (4\/ 2071) برقم (2691). \n2. رواه الترمذي (5\/ 572)، وحسنه الألباني في صحيح الترغيب (2\/ 226) برقم (1536). \n3. سبق تخريجه. \n4. رواه أحمد (11\/ 353)، وحسنه الألباني في صحيح الترغيب (2\/ 254) برقم (1591)، وحسنه الأرنؤوط في المسند (11\/ 353). \n5. صحيح مسلم بشرح النووي (1\/ 63) برقم (35).",
    "book_id":"72"
  },
  {
    "serial_number":"4962131",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":51,
    "volume_number":1,
    "text":" الفرع الثاني: في المواضع التي تُقال فيها كلمة التوحيد لكلمة التوحيد مواضع كثيرة تقال فيها كما ثبت ذلك في السنة المطهرة. ومن هذه المواضع:  1 - في أدبار الصلوات المكتوبة: - فقد كان النبي صلى الله عليه وسلم يقول في دبر كل صلاة مكتوبة: \"لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد\" (1) . وفي رواية: كان يقول في دبر كل صلاة مكتوبة وحين يسلم: \"لا إله إلا الله وحده لا شريك له، له الملك وله الحمد يحيي ويميت وهو حي لا يموت بيده الخير وهو على كل شيء قدير- ثلاث مرات- اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد\". - وفي حديث عبد الله بن الزبير رضي الله عنهما؛ أنه كان يقول دُبر كل صلاة حين يسلم: \"لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، لا حول ولا قوة إلا بالله، لا إله إلا الله، ولا نعبد إلا إياه، له النعمة وله الفضل وله الثناء الحسن، لا إله إلا الله مخلصين له الدين ولو كره الكافرون\" (2) . - وفي حديث أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم قال: \"من سبح لله في دبر كل صلاة ثلاثاً وثلاثين، وحمد الله ثلاثاً وثلاثين، وكبَّر الله ثلاثاً وثلاثين، وقال تمام المائة: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، غُفرت خطاياه وإن كانت مثل زبد البحر\" (3) . - وفي حديث أبي هريرة رضي الله عنه مرفوعاً قال: \"لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، بعد ما يصلي الغداة عشر مرات كتب الله عز وجل له",
    "foot_note":"1. صحيح البخاري (1\/ 214) برقم (844)، وصحيح مسلم بشرح النووي (1\/ 414) برقم (593). \n2. صحيح مسلم بشرح النووي (1\/ 415) برقم (594). \n3. صحيح مسلم بشرح النووي (1\/ 418) برقم (597).",
    "book_id":"72"
  },
  {
    "serial_number":"4962132",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":52,
    "volume_number":1,
    "text":"عشر حسنات ومحا عنه عشر سيئات، ورفع له عشر درجات، وكن له بعدل عتق رقبتين من ولد إسماعيل؛ فإن قالها حين يمسي كان له مثل ذلك، وكن له حجاباً من الشيطان حتى يصبح\" (1) .  2 - حين سماع الأذان: كما في حديث سعد بن أبي وقاص رضي الله عنه، عن رسول الله صلى الله عليه وسلم؛ أنه قال: \"من قال حين يسمع المؤذن أشهد أن لا إله إلا الله وحده لا شريك له؛ وأن محمداً عبده ورسوله، رضيت بالله رباً وبمحمدٍ رسولاً وبالإسلام ديناً غفر له ذنبه\" (2) .  3 - بعد التشهد: فقد صح أن النبي صلى الله عليه وسلم سمع رجلاً يقول في تشهده: \"اللهم إني أسألك بأن لك الحمد، لا إله إلا أنت، وحدك لا شريك لك، المنان يا بديع السماوات والأرض، يا ذا الجلال والإكرام، يا حي يا قيوم؛ إني أسألك الجنة وأعوذ بك من النار فقال النبي صلى الله عليه وسلم: \"أتدرون بما دعاء الله؟ قال: فقالوا: الله ورسوله أعلم ، قال: \" والذي نفسي بيده لقد دعى الله باسمه الأعظم الذي إذا دعي به أجاب وإذا سؤل به أعطى \" (3) .  4 - في الاستسقاء: كما في حديث عائشة رضي الله عنها قالت: شكا الناس إلى رسول الله صلى الله عليه وسلم قحوط المطر، فأمر بمنبر فوضع له في المصلى، ووعد الناس يوماً يخرجون فيه، فخرج رسول الله صلى الله عليه وسلم حين بدا حاجب الشمس، فقعد على المنبر فكبر وحمد الله عز وجل فكان مما قال في خطبته-: \"لا إله إلا الله يفعل ما يريد، اللهم أنت الله لا إله إلا أنت، أنت الغني ونحن الفقراء أنزل علينا الغيث، واجعل ما أنزلت لنا قوة وبلاغاً إلى حين … \" (4) .  5 - عند دخول السوق: كما ثبت في حديث عمر بن الخطاب رضي الله عنه؛ أن رسول الله صلى الله عليه وسلم قال: \"من دخل السوق فقال: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد،",
    "foot_note":"1. رواه الحسن بن عرفة في جزئه (1\/ 5) وصححه الألباني في السلسلة الصحيحة (1\/ 112) برقم (113). \n2. صحيح مسلم بشرح النووي (1\/ 290) برقم (386). \n3. أخرجه أحمد (21\/ 192) برقم (13570) ، وصححه الألباني في الصحيحة برقم (3411). \n4. أخرجه أبو داود (1\/ 455)، وحسنه الألباني في صحيح سنن أبي داود (4\/ 336) برقم (1064).",
    "book_id":"72"
  },
  {
    "serial_number":"4962133",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":53,
    "volume_number":1,
    "text":"يحيي ويميت وهو حي لا يموت بيده الخير وهو على كل شيء قدير، كتب له ألف ألف حسنة، ومحا عنه ألف ألف سيئة، ورفع له ألف ألف درجة\" (1) .  6 - بعد الوضوء: كما في حديث عمر بن الخطاب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"ما منكم من أحد يتوضأ فيسبغ الوضوء ثم يقول: أشهد أن لا إله إلا الله وحده لا شريك له، وأشهد أن محمداً عبده ورسوله؛ إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء\" (2) .  7 - من تعار من الليل: كما في حديث عبادة بن الصامت عن النبي صلى الله عليه وسلم قال: \"من تعار من الليل فقال: \"لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، الحمد لله وسبحان الله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله، ثم قال: اللهم اغفر لي، أو دعا استجيب؛ فإن توضأ وصلى قبلت صلاته\" (3) .  8 - إذا رجع من حج أو عمرة أو غزو: فقد روى ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم كان إذا قفل من غزوٍ أو حج أو عمرة يكبر على كل شرف من الأرض ثلاث تكبيرات، ثم يقول: \"لا إله إلا الله\" (4) . وفي رواية: \"لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير … \" (5) .",
    "foot_note":"1. أخرجه الترمذي (5\/ 491)، والحاكم (1\/ 721)، وحسنه الألباني في صحيح سنن ابن ماجة برقم (2235). \n2. صحيح مسلم بشرح النووي (1\/ 209) برقم (234). \n3. صحيح البخاري (2\/ 68) برقم (1154). \n4. صحيح البخاري (2\/ 8) برقم (1797). \n5. صحيح البخاري (4\/ 69) برقم (2995)، صحيح مسلم بشرح النووي (2\/ 980) برقم (13444).",
    "book_id":"72"
  },
  {
    "serial_number":"4962134",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":54,
    "volume_number":1,
    "text":" 9 - عند الفزع: ثبت ذلك في حديث زينب بنت جحش رضي الله عنها، أن النبي صلى الله عليه وسلم دخل عليها فزعاً يقول: \"لا إله إلا الله ويل للعرب من شر قد اقترب فتح اليوم من ردم يأجوج ومأجوج مثل هذه، وحلَّق بإصبعه الإبهام والتي تليها، قالت زينب بنت جحيش، فقلت: يا رسول الله أنهلك وفينا الصالحون، قال: نعم إذا كثُر الخبث\" (1) . 10 - في الدعاء: لحديث أبي هريرة رضي الله عنه؛ أن رسول الله صلى الله عليه وسلم كان يقول: \"لا إله إلا الله وحده أعز جنده ونصر عبده وغلب الأحزاب وحده، فلا شيء بعده\" (2) . 11 - يوم عرفة: لما ثبت في حديث عمرو بن شعيب عن أبيه عن جده، أن النبي صلى الله عليه وسلم قال: \"خير الدعاء دعاء يوم عرفة، وخير ما قلت أنا والنبيون من قبلي: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير\" (3) .  12 - في أذكار الصباح والمساء: كما ثبت ذلك في حديث أبي هريرة رضي الله عنه؛ أن رسول الله صلى الله عليه وسلم قال: \"من قال: لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد وهو على كل شيء قدير في يومٍ مائة مرة كانت له عدل عشر رقاب، وكتبت له مائة حسنة، ومحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان يومه ذلك حتى يمسي، ولم يأتِ أحد بأفضل مما جاء به إلا أحد عمل أكثر من ذلك\" (4) . - وحديث عبد الله بن عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: \"من قال: لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على",
    "foot_note":"1. صحيح البخاري (4\/ 186) برقم (3346)، صحيح مسلم بشرح النووي (4\/ 2207) برقم (2880). \n2. صحيح البخاري (5\/ 142) برقم (4114). \n3. سبق تخريجه. \n4. سبق تخريجه.",
    "book_id":"72"
  },
  {
    "serial_number":"4962135",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":55,
    "volume_number":1,
    "text":"كل شيء قدير مائتي مرة في يومٍ، لم يسبقه أحد كان قبله، ولم يدركه أحد بعده، إلا من عمل بأفضل من عمله\" (1) . - وحديث أبي أيوب رضي الله عنه؛ أن رسول الله صلى الله عليه وسلم قال: \"من قال: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير عشر مرات، كان كمن أعتق أربعة أنفس من ولد إسماعيل\" (2) . - وحديث البراء بن عازب رضي الله عنه؛ أن رسول الله صلى الله عليه وسلم قال: \" .. ومن قال: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، فهو كعتق نسمة\" (3) . - وحديث عبد الله بن مسعود رضي الله عنه قال: كان رسول الله صلى الله عليه وسلم إذا أمسى قال: \"أمسينا وأمسى الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير … \" (4) . - ولِما صح عن رسول الله صلى الله عليه وسلم: \"من قال حين يصبح: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد يحيي ويميت وهو على كل شيء قدير، عشر مرات كتب الله له بكل واحدة قالها عشر حسنات، وحط عنه عشر سيئات، ورفعه الله بها عشر درجات، وكن له كعشر رقاب، وكن له مسلحة من أول النهار إلى آخره، ولم يعمل يومئذ عملاً يقهرهن؛ فإن قال حين يمسي فمثل ذلك\" (5) .  13 - عند سكرات الموت: لحديث عائشة رضي الله عنهما قالت: \"إن من نعم الله عليَّ أن رسول الله صلى الله عليه وسلم وتوفي في بيتي وفي يومي وفي سحري ونحري؛ وأن الله جمع بين ريقي وريقه عند موته، دخل عليَّ عبد الرحمن وبيده السواك وأنا مسندة رسول الله صلى الله عليه وسلم فرأيته ينظر إليه",
    "foot_note":"1. سبق تخريجه. \n2. سبق تخريجه. \n3. رواه أحمد، وصححه الألباني في صحيح الترغيب (2\/ 225) برقم (1535). \n4. صحيح مسلم بشرح النووي (4\/ 2088) برقم (2723). \n5. أخرجه أحمد (38\/ 545)، والطبراني في الكبير (4\/ 174)، وهو في السلسلة الصحيحة (1\/ 113) برقم (114).",
    "book_id":"72"
  },
  {
    "serial_number":"4962136",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":56,
    "volume_number":1,
    "text":"وعرفت أنه يحب السواك، فقلت آخذه لك، فأشار برأسه أن نعم، فتناولته فاشتد عليه وقلت ألينه لك فأشار برأسه أن نعم، فلينته وبين يدي ركوة، -أو علبة يشك عمر- فيها ماء فجعل يدخل يديه في الماء، فيمسح بهما وجهه يقول: لا إله إلا الله إن للموت لسكرات، ثم نصب يده فجعل يقول: في الرفيق الأعلى حتى قُبض ومالت يده\" ( 1). 14 - حال الاحتضار: كما في حديث أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"لقنوا موتاكم لا إله إلا الله\" (2) . وفي رواية: \"من كان آخر كلامه لا إله إلا الله دخل الجنة\" (3) . وفي وراية: \"أكثروا من شهادة أن لا إله إلا الله، قبل أن يُحال بينكم وبينها، ولقنوها موتاكم\" (4) .  15 - عند الكرب: لما ثبت في حديث ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم كان يقول عند الكرب: \"لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السماوات ورب الأرض ورب العرش الكريم\" (5) .  16 - عند الحلف بغير ملة الإسلام: صح ذلك عن أبي هريرة رضي الله عنه، عن النبي صلى الله عليه وسلم قال: \"من حلف فقال في حلفه واللات والعزى، فليقل: لا إله إلا الله، ومن قال لصاحبه تعال أقامرك فليتصدق\" (6) .",
    "foot_note":"1. صحيح البخاري (6\/ 15، 16) برقم (4449). \n2. صحيح مسلم بشرح النووي (2\/ 631) برقم (916). \n3. رواه أبو داود. \n4. أخرجه أبو يعلى في مسنده (4\/ 1460) وهو في السلسلة الصحيحة (1\/ 466) برقم (467). \n5. صحيح البخاري (8\/ 93) برقم (6346)، صحيح مسلم بشرح النووي (4\/ 2092) برقم (2730). \n6. صحيح البخاري (8\/ 165) برقم (6650)، صحيح مسلم بشرح النووي (3\/ 1267) برقم (1647).",
    "book_id":"72"
  },
  {
    "serial_number":"4962137",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":57,
    "volume_number":1,
    "text":" المطلب الرابع: في بيان فضل التكبير والحديث عن التكبير من خلال الفرعين الآتيين:  الفرع الأول: في فضل التكبير: ورد في فضل التكبير أحاديث كثيرة، ذكرنا بعضاً منها عند الحديث على فضل الباقيات والصالحات إجمالاً وهذه بعض الفضائل التي وردت بذكر التكبير مفصلاً.  1 - كلمة الفطرة: لحديث أنس رضي الله عنه قال: \"كان النبي صلى الله عليه وسلم لا يغير إلا عند صلاة الفجر فإن سمع أذاناً أمسك وإلا أغار فاستمع ذات يوم فسمع رجلاً يقول: الله أكبر، الله أكبر، فقال: على الفطرة … \" (1) .  2 - عظيم الأجر: كما في حديث أم هانئ رضي الله عنهما قالت: قالت رسول الله صلى الله عليه وسلم: \" … وكبري الله مائة تكبيرة؛ فإنها تعدل لك مائة بدنة مُقلّدة مُتقبّلة … \" (2) .  الفرع الثاني: في المواضع التي يقال فيها التكبير للتكبير مواضع متعددة ثبتت في السنة النبوية المطهرة منها:  1 - عند افتتاح الصلاة: كما في حديث عائشة رضي الله عنها قالت: \"كان رسول الله صلى الله عليه وسلم يفتتح الصلاة بالتكبير … \" (3) . وحديث علي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"مفتاح الصلاة الطهور وتحريمها التكبير وتحليلها التسليم\" (4) .  2 - عند قيام الليل: لحديث حذيفة بن اليمان رضي الله عنه: \"أنه صلَّى مع النبي صلى الله عليه وسلم [صلاة الليل] فلمَّا كَبَّر، قال: الله أكبر [ثلاثاً] ذو الملكوت والجبروت والكبرياء والعظمة … \" (5) . - وحديث أبي سعيد الخدري رضي الله عنه قال: كان رسول الله صلى الله عليه وسلم إذا قام من الليل كبَّر، ثم يقول: \"سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدُّك ولا إله غيرك، ثم يقول: لا إله إلا الله؛ ثلاثاً، ثم يقول: الله أكبر كبيرا؛ ثلاثاً أعوذ بالله السميع العليم من الشيطان الرجيم من همزه ونفخه ونفثه … \" (6) .",
    "foot_note":"1. صحيح مسلم بشرح النووي (1\/ 288) برقم (382). \n2. سبق تخريجه. \n3. أخرجه أحمد (40\/ 32)، سنن أبي داود (1\/ 285)، وصححه الألباني ي صحيح سنن أبي داود برقم (752). \n4. سنن أبي داود (1\/ 22)، سنن الترمذي (1\/ 54)، وحسنه الألباني في صحيح سنن أبي داود برقم (55). \n5. سنن النسائي (2\/ 231)، سنن أبي داود (1\/ 325) برقم (874)، وصححه الألباني في صحيح سنن أبي داود برقم (818). \n6. أخرجه أبو داود (1\/ 281) برقم (775)، وصححه الألباني في صحيح سنن أبي داود (3\/ 361) برقم (748).",
    "book_id":"72"
  },
  {
    "serial_number":"4962138",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":58,
    "volume_number":1,
    "text":" 3 - عند الاستبشار بالنصر: كما في حديث أنس بن مالك رضي الله عنه: \"أن رسول الله صلى الله عليه وسلم غزا خيبر، فصلينا عندها صلاة الغداة بغلس فركب النبي صلى الله عليه وسلم، وركب أبو طلحة وأنا رديف أبي طلحة، فأجرى رسول الله صلى الله عليه وسلم في زقاق خيبر وإن رُكبتي لتمس فخذ رسول الله صلى الله عليه وسلم ثم حسر الإزار عن فخذه حتى إني أنظر إلى بياض فخذ النيي صلى الله عليه وسلم، فلما دخل القرية قال: الله أكبر، خربت خيبر إنا إذا نزلنا بساحة قومٍ فساء صباح المنذرين .. \" (1) .  4 - إذا خاف سلطاناً مهاباً: ثبت ذلك في حديث ابن عباس رضي الله عنهما قال: \"إذا أتيت سلطاناً مهيباً، تخاف أن يسطو بك، فقل: الله أكبر، الله أعز من خلقه جميعاً، الله أعز مما أخاف وأحاذر، وأعوذ بالله الذي لا إله إلا هو، الممسك السماوات السبع أن يقعن على الأرض إلا بإذنه، من شر عبدك فلان، وجنوده وأتباعه وأشياعه من الجن والإنس، اللهم كن لي جاراً من شرهم، جل ثناؤك، وعز جارك، وتبارك اسمك، ولا إله غيرك؛ ثلاث مرات\" (2) . وثبت ذلك في حديث عبد الله بن مسعود رضي الله عنه إذا كان على أحدكم إمام يخاف تغطرسه، أو ظلمه فليقل: \"اللهم رب السماوات السبع ورب العرش العظيم، كن لي جاراً من فلان بن فلان وأحزابه من خلائقك، أن يفرط عليَّ أحد منهم، أو يطغى، عز جارك وجل ثناؤك، ولا إله إلا أنت\" (3) .",
    "foot_note":"1. أخرجه البخاري (1\/ 104) برقم (371)، ومسلم بشرح النووي (2\/ 1042) برقم (1365). \n2. صحيح الأدب المفرد (1\/ 257) برقم (264)، وصححه الألباني موقوفاً على ابن عباس رضي الله عنهما. \n3. صحيح الأدب المفرد (1\/ 257) برقم (264)، وصححه الألباني موقوفاً على ابن مسعود رضي الله عنه.",
    "book_id":"72"
  },
  {
    "serial_number":"4962139",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":60,
    "volume_number":1,
    "text":" 5 - عند الشهادة: لحديث أنس رضي الله عنه قال: \"بعث النبي صلى الله عليه وسلم أقواماً من بني سُليم إلى بني عامر في سبعين، فلما قدموا قال لهم خالي أتقدمكم فإن أمَّنوني حتى أبلغهم عن رسول الله صلى الله عليه وسلم وإلا كنتم مني قريباً، فتقدم فأمَّنوه فبينما يحدثهم عن النبي صلى الله عليه وسلم إذ أومؤوا إلى رجل منهم فطعنه فأنفذه، فقال: الله أكبر فزت ورب الكعبة، ثم مالوا على بقية أصحابه فقتلوهم .. \" (1) .  6 - عند الصعود والإشراف على مكان: فقد صح في حديث أبي موسى الأشعري- رضي الله عنه قال: \"لما غزا رسول الله صلى الله عليه وسلم خيبر، أو قال لما توجه رسول الله صلى الله عليه وسلم أشرف الناس على وادٍ فرفعوا أصواتهم بالتكبير، الله أكبر الله أكبر، لا إله إلا الله، فقال رسول الله صلى الله عليه وسلم: أربعوا على أنفسكم، إنكم لا تدعون أصَمَّاً ولا غائباً؛ إنكم تدعون سميعاً قريباً … \" (2) .  7 - قبل طلوع الشمس وقبل غروبها: كما في حديث عمرو بن شعيب عن أبيه عن جده قال: قال رسول الله صلى الله عليه وسلم: \" .. ومن قال الله أكبر مائة مرة، قبل طلوع الشمس، وقبل غروبها، كان أفضل من عتق مائة رقبة … \" (3) .  8 - عند الصفا: لحديث جابر- رضي الله عنه قال: \"ثم خرج النبي صلى الله عليه وسلم إلى الصفا، فلما دنا من الصفا قرأ: [إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا … ] نبدأ بما بدأ الله به، فبدأ بالصفا فرقى عليه، حتى رأى البيت [الكعبة]، فاستقبل القبلة، فوحد الله وكبره ثلاثاً [الله أكبر، الله أكبر، الله أكبر] .. \" (4) .",
    "foot_note":"1. صحيح البخاري (4\/ 22) برقم (2801). \n2. صحيح البخاري (5\/ 169، 170) برقم (4205). \n3. أخرجه النسائي في السنن الكبرى (6\/ 205)، وصححه الألباني في صحيح الترغيب برقم (658). \n4. حجة النبي صلى الله عليه وسلم للألباني (1\/ 118) برقم (64).",
    "book_id":"72"
  },
  {
    "serial_number":"4962140",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":61,
    "volume_number":1,
    "text":" 9 - في العيدين وأيام التشريق: وقد ثبت التكبير في العيدين، وهو مشروع بإجماع أهل العلم ومما ورد فيه: - حديث ابن عباس رضي الله عنهما أنه كان يكبر فيقول: \"الله أكبر، الله أكبر، الله أكبر، لا إله إلا الله، والله أكبر، الله أكبر، ولله الحمد\" (1) . - وحديث ابن مسعود- رضي الله عنهما- أنه كان يكبر أيام التشريق: \"الله أكبر، الله أكبر، لا إله إلا الله، والله أكبر، الله أكبر، ولله الحمد\" (2) .  10 - في السعي بين الصفا والمروة: فقد كان صلى الله عليه وسلم يقول في السعي: \"رب اغفر وارحم وتجاوز عما تعلم .. الله أكبر ثلاثاً ولله الحمد، الله أكبر على ما هدانا، والحمد لله على ما أولانا .. \" (3) .  11 - عند الاستواء على ظهر الدابة أو المركبة: لما ورد في حديث علي بن ربيعة أنه كان ردفاً لعلي- رضي الله عنه فلما وضع رحله في الركاب قال: \"بسم الله، فلما استوى على ظهر الدابة قال: الحمد لله (ثلاثاً) والله أكبر (ثلاثاً) .. \" (4) .  12 - عند البشارة بالنصر: كما في حديث ابن عباس رضي الله عنهما قال: \"بينما النبي صلى الله عليه وسلم بالمدينة إذ قال: الله أكبر، الله أكبر جاء نصر الله، وجاء الفتح، وجاء أهل اليمن، قوم نقية قلوبهم، لينة طاعتهم، الإيمان والفقه يمان، والحكمة يمانية\" (5) .",
    "foot_note":"1. إرواء الغليل في تخريج أحاديث منار السبيل (125) برقم (617، 618). \n2. نفس المرجع السابق. \n3. حجة النبي صلى الله عليه وسلم للألباني (1\/ 118) برقم (64). \n4. سبق تخريجه. \n5. صحيح ابن حبان (16\/ 287) برقم (7298) وقال الأرنؤوط: حديث صحيح لغيره، إسناده ضعيف.",
    "book_id":"72"
  },
  {
    "serial_number":"4962141",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":62,
    "volume_number":1,
    "text":" 13 - عند رؤية الهلال: ثبت ذلك في حديث عبد الله بن عمر رضي الله عنهما قال: \"كان رسول الله صلى الله عليه وسلم إذا رأى الهلال قال: الله كبر، اللهم أهله علينا بالأمن والإيمان والسلامة والإسلام والتوفيق لما تحب وترضى، ربنا وربك الله\" ( 1). 14 - عند رؤية علامة: لحديث بريدة بن الحصيب رضي الله عنه: أنه كان بخراسان فعاد أخاً له وهو مريض، فوجده بالموت وإذا هو بعرق جبينه، فقال: الله أكبر سمعت رسول الله صلى الله عليه وسلم يقول: \"موت المؤمن بعرق الجبين\" (2) .  15 - عند البشارة بالمولود: كما في حديث أنس بن مالك- رضي الله عنه قال: \"تزوج أبو طلحة أم سليم- وذكر الحديث بطوله- وفيه أن أبا طلحة قال: يا رسول الله، ولدت أم سليم، قال: الله أكبر ما ولد؟ قلت: غلاماً، قال: الحمد لله … \" (3) .  16 - عند رؤية ما يحب: ثبت ذلك في حديث عقبة بن سويد الأنصاري؛ أنه سمع أباه، وكان من أصحاب النبي صلى الله عليه وسلم قال: \"قفلنا مع نبي الله صلى الله عليه وسلم من غزوة خيبر، فلما بدا له أُحُد، قال النبي صلى الله عليه وسلم: الله أكبر جبل يحبنا ونحبه\" (4) .  17 - عند الذبح: كما في حديث أنس بن مالك- رضي الله عنه قال: ضحى النبي صلى الله عليه وسلم بكبشين أملحين ذبحهما بيده وسمى وكبر ووضع رجله على صفاحهما\" (5) .",
    "foot_note":"1. الكلم الطيب لابن تيمية (1\/ 138) برقم (162)، صححه الألباني بشواهده عند تحقيقه للكلم الطيب. \n2. أحكام الجنائز للألباني (1\/ 35). \n3. مسند أحمد (20\/ 229) برقم (12865)، وصححه الأرنؤوط (5\/ 230). \n4. مسند أحمد (24\/ 427) برقم (15659)، وصححه الأرنؤوط (24\/ 427). \n5. البخاري مع الفتح (10\/ 39) برقم (5565)، صحيح مسلم بشرح النووي برقم (1966).",
    "book_id":"72"
  },
  {
    "serial_number":"4962142",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":63,
    "volume_number":1,
    "text":" المطلب الخامس: في بيان فضل الحوقلة الحوقلة هي: \"لا حول ولا قوة إلا بالله\"، وسنتحدث عنها من خلال الفرعين الآتيين:  الفرع الأول: في فضل الحوقلة: ورد في فضل الحوقلة جملة من الأحاديث عن رسول الله صلى الله عليه وسلم، منها:  1 - أنها كنز من كنوز الجنة: - كما في حديث أبي موسى الأشعري- رضي الله عنه قال: \"سمعني النبي صلى الله عليه وسلم وأنا أقول لا حول ولا قوة إلا بالله. قال: يا عبد الله بن قيس ألا أدلك على كلمة من كنوز الجنة؟ قلت: بلى يا رسول الله، قال: لا حول ولا قوة إلا بالله\" (1) . - وفي حديث أبي ذر- رضي الله عنه قال: قال لي رسول الله صلى الله عليه وسلم: \"ألا أدلك على كنز من كنوز الجنة؟ قلت: بلى يا رسول الله. قال: لا حول ولا قوة إلا بالله\" (2) . - وحديث أبي هريرة- رضي الله عنه قال: قال لي رسول الله صلى الله عليه وسلم: \"أكثر من قول لا حول ولا قوة إلا بالله؛ فإنها [كنز] من كنوز الجنة\" (3) .",
    "foot_note":"1. صحيح البخاري (5\/ 170) برقم (4205). \n2. سنن ابن ماجة (2\/ 1256) برقم (3825)، وصححه الألباني في صحيح الجامع برقم (7820). \n3. أخرجه الترمذي (5\/ 580)، وصححه الألباني في صحيح الترغيب (2\/ 248) برقم (1580).",
    "book_id":"72"
  },
  {
    "serial_number":"4962143",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":64,
    "volume_number":1,
    "text":" 2 - أنها كلمة من تحت العرش: لحديث أبي هريرة- رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: \"ألا أعلمك، أو لا أدلك على كلمة من تحت العرش من كنوز الجنة؟ تقول: لا حول ولا قوة إلا بالله، فيقول الله: أسلم عبدي واستسلم\" (1) .  3 - أنها باب من أبواب الجنة: ورد ذلك في حديث معاذ بن جبل- رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: \"ألا أدلك على باب من أبواب الجنة؟ قال: وما هو؟ قال: لا حول ولا قوة إلا بالله\" (2) . - وفي حديث قيس بن سعد بن عبادة أن أباه دفعه إلى النبي صلى الله عليه وسلم يخدمه، قال: فأتى عليَّ نبي الله صلى الله عليه وسلم وقد صليت ركعتين، فضربني برجله، وقال: ألا أدلك على باب من أبواب الجنة؟ قلت: بلى. قال: لا حول ولا قوة إلا بالله\" (3) .  4 - أنها غراس الجنة: كما في حديث أبي أيوب الأنصاري- رضي الله عنه \"أن رسول الله صلى الله عليه وسلم ليلة أسري به مر على إبراهيم عليه السلام، فقال: من معك يا جبريل؟ قال: هذا محمد، فقال: له إبراهيم عليه السلام: يا محمد مُر أمتك فليكثروا من غراس الجنة؛ فإن تربتها طيبة وأرضها واسعة. قال: ما غراس الجنة؟ قال: لا حول ولا قوة إلا بالله\" (4) .",
    "foot_note":"1. أخرجه الحاكم (1\/ 17)، وصححه الألباني في صحيح الترغيب برقم (1580) أيضاً. \n2. أخرجه أحمد (36\/ 321)، وصححه الألباني في صحيح الترغيب (2\/ 249) برقم (1581). \n3. رواه الحاكم وصححه (4\/ 323)، أحمد (24\/ 228)، وصححه الألباني في صحيح الترغيب (2\/ 250) برقم (1582). \n4. أخرجه أحمد (38\/ 533)، وابن حبان في صحيحه (3\/ 103)، وصححه الألباني في الترغيب (2\/ 250) برقم (1583).",
    "book_id":"72"
  },
  {
    "serial_number":"4962144",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":65,
    "volume_number":1,
    "text":"وحديث ابن عمر- رضي الله عنهما- قال: قال رسول الله صلى الله عليه وسلم: \"أكثروا من غراس الجنة؛ فإنه عذب ماؤها، طيب ترابها، فأكثروا من غراسها. قالوا: يا رسول الله أو ما غراسها. قال: ما شاء الله، لا حول ولا قوة إلا بالله\" (1) .  5 - أنها من مكفرات الخطايا: لحديث عبد الله بن عمرو قال: قال رسول الله صلى الله عليه وسلم: \"ما على الأرض أحد يقول لا إله إلا الله، والله أكبر، ولا حول ولا قوة إلا بالله، إلا كفرت عنه خطاياه، ولو كانت مثل زبد البحر\" (2) .  6 - أنها من المنجيات من النار: ثبت ذلك في حديث الأغر أبي مسلم قال: \"أشهد على أبي سعيد وأبي هريرة أنهما شهدغ على النبي صلى الله عليه وسلم؛ أنه قال: من قال لا إله إلا الله، والله أكبر صدقه ربه، فقال: لا إله إلا أنا وأنا أكبر، وإذا قال: لا إله إلا الله وحده قال: يقول الله: لا إله إلا أنا وحدي، وإذا قال: لا إله إلا الله وحده لا شريك له، قال الله: لا إله إلا أنا وحدي لا شريك لي، وإذا قال: لا إله إلا الله له الملك وله الحمد، قال الله: لا إله إلا أنا لي الملك ولي الحمد، وإذا قال: لا إله إلا الله ولا حول ولا قوة إلا بالله، قال: لا إله إلا أنا ولا حول ولا قوة إلا بي، وكان يقول: من قالها في مرضه ثم مات لم تطعمه النار\" (3) .",
    "foot_note":"1. أخرجه الطبراني في الكبير (10\/ 498)، وحسنه الألباني في صحيح الترغيب (2\/ 250) برقم (1584). \n2. أخرجه الترمذي (5\/ 509)، وحسنه الألباني في التعليق الرغيب (2\/ 249). \n3. سنن الترمذي (5\/ 492)، وابن ماجة (2\/ 1246)، وصححه الألباني في صحيح ابن ماجة برقم (3794).",
    "book_id":"72"
  },
  {
    "serial_number":"4962145",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":66,
    "volume_number":1,
    "text":" 7 - أنها من أسباب مغفرة الذنوب: كما في حديث أبي هريرة قال: قال رسول الله صلى الله عليه وسلم: \"من قال لا إله إلا الله والله أكبر، لا إله إلا الله وحده، لا إله إلا الله ولا شريك له، لا إله إلا الله له الملك وله الحمد، لا إله إلا الله ولا حول ولا قوة إلا بالله، يعقدهن خمساً بأصابعه، ثم قال من قالهن في يوم أو ليلة أو في شهر، ثم مات في ذلك اليوم أو في تلك الليلة، أو في ذلك الشهر، غفر له ذنبه\" (1) .  الفرع الثاني: في المواضع التي تقال فيها الحوقلة: ورد ذكر الحوقلة في عدة مواضع مستفادة من خلال ما صح عن النبي صلى الله عليه وسلم منها:  1 - في أدبار الصلوات: \"فقد كان صلى الله عليه وسلم يقول في دبر الصلاة إذا سلَّم قبل أن يقوم، يرفع بذلك صوته: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، ولا حول ولا قوة إلا بالله لا إله إلا الله، ولا نعبد إلا إياه، له النعمة وله الفضل، وله الثناء الحسن، لا إله إلا الله مخلصين له الدين، ولو كره الكافرون\" ( 2). 2 - عند القيام إلى صلاة الليل: ثبت ذلك في حديث ابن عباس- رضي الله عنهما- أن رسول الله صلى الله عليه وسلم كان إذا قام إلى الصلاة في جوف الليل قال: \"اللهم لك الحمد أنت قيم السماوات والأرض ومن فيهن، ولك الحمد لك ملك السماوات والأرض ومن فيهن، ولك الحمد أنت نور السماوات والأرض ومن فيهن، ولك الحمد أنت ملك السماوات والأرض، ولك الحمد أنت الحق، ووعدك حق، ولقاؤك حق، والجنة حق، والنار حق، والنبيون حق، ومحمد صلى الله عليه وسلم حق، والساعة حق، اللهم لك أسلمت، وبك آمنت، وعليك توكلت، وإليك أنبت، وبك خاصمت، وإليك حاكمت، فاغفر لي ما قدمت وما أخرت، وما أسررت وما أعلنت، وما أنت أعلم به مني، أنت المقدم وأنت المؤخر، أنت إلهي، لا إله إلا أنت ولا حول ولا قوة إلا بالله\" (3) .",
    "foot_note":"1. سنن النسائي الكبرى (6\/ 12)، قال الألباني في صحيح الترغيب صحيح لغيره برقم (3481). \n2. أخرجه الطبراني في الكبير (18\/ 392)، وصححه الألباني في الصحيح (11\/ 18) برقم (3160). \n3. صحيح البخاري (2\/ 61) برقم (1120).",
    "book_id":"72"
  },
  {
    "serial_number":"4962146",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":67,
    "volume_number":1,
    "text":" 3 - عند الخروج من المنزل: كما في حديث أنس- رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: \"إذا خرج الرجل من بيته، فقال: بسم الله توكلت على الله، ولا حول ولا قوة إلا بالله، يقال له حسبك هديت وكفيت ووقيت وتنحى عنه الشيطان\" (1) .  4 - من تعار من الليل: كما في حديث عبادة بن الصامت رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"من تعار من الليل فقال: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، الحمد لله وسبحان الله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله، ثم قال: اللهم اغفر لي، أو دعا استجيب، فإن توضأ وصلى قُبِلت صلاته\" (2) .",
    "foot_note":"1. أخرجه الترمذي وحسنه (5\/ 490)، والنسائي في الكبرى (6\/ 26)، وصححه الألباني في صحيح الترغيب (2\/ 121) برقم (1605). \n2. صحيح البخاري (2\/ 68) برقم (1154).",
    "book_id":"72"
  },
  {
    "serial_number":"4962147",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":68,
    "volume_number":1,
    "text":" المراجع العلمية  أولاً: كتب التفسير: 1 - جامع البيان في تأويل القرآن: تأليف: الإمام جعفر الطبري- تحقيق أحمد شاكر- ط. مؤسسة الرسالة. 2 - التحرير والتنوير: تأليف: محمد الطاهر بن عاشور- ط. الدار التونسية للنشر- تونس. 3 - الجامع لأحكام القرآن الكريم: تأليف: الإمام القرطبي- تحقيق: أحمد البردوني وإبراهيم أطفيش- دار الكتب المصرية- القاهرة. 4 - معالم التنزيل في تفسير القرآن: تأليف: الإمام البغوي- تحقيق: عبد الرزاق المهدي- دار إحياء التراث العربي- بيروت. 5 - تفسير البحر المحيط- لأبي حيان الأندلسي- تحقيق: عادل أحمد عبد الموجود وعلي محمد معوض- دار الكتب العلمية. 6 - تفسير القرآن العظيم، لأبي الفداء: إسماعيل بن كثير- تحقيق: سامي بن محمد سلامة- دار طيبة للنشر والتوزيع. 7 - المحرر الوجيز في تفسير الكتاب العزيز: تأليف: أبو محمد عبد الحق بن غالب بن عطية الأندلسي- دار الكتب العلمية- لبنان. 8 - محاسن التأويل- لمحمد جمال الدين القاسمي ــ تحقيق: أحمد بن علي وحمدي صبح ــ دار الحديث القاهرة. 9 - إرشاد العقل السليم إلى مزايا القرآن الكريم، لمحمد بن محمد العمادي أبو السعود- دار إحياء التراث العربي- بيروت. 10 - الدر المنثور في التفسير بالمأثور- للإمام: جلال الدين السيوطي- دار الفكر- بيروت.",
    "foot_note":"None",
    "book_id":"72"
  },
  {
    "serial_number":"4962148",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":69,
    "volume_number":1,
    "text":"11 - جزء في تفسير الباقيات الصالحات، لصلاح الدين خليل بن كيكلدي بن عبد الله العلاني- تحقيق: بدر الزمان محمد شفيه النيبالي- دار البشائر الإسلامية- بيروت. 12 - فتح القدير للإمام محمد بن علي الشوكاني- دار ابن كثير- دمشق- بيروت. 13 - أضواء البيان في إيضاح القرآن بالقرآن لمحمد الأمين الشنقيطي- دار الفكر. 14 - موسوعة الصحيح المسبور من التفسير بالمأثور: تأليف: أ. د\/ حكمت بن … بشير ابن ياسين- دار المآثر للنشر والتوزيع- المدينة المنورة.  ثانياً: كتب المعاجم والغريب: 1 - لسان العرب: لابن منظور- دار صادر- بيروت. 2 - القاموس المحيط: للفيروز آبادي. 3 - الصحاح للجوهري- دار الملايين- بيروت. 4 - تاج العروس من جواهر القاموس: للمرتضى الزبيدي- دار الهداية. 5 - معجم مقاييس اللغة: أبو الحسين أحمد بن فارس بن زكريا- تحقيق\/ … عبد السلام محمد هارون- دار الفكر. 6 - النهاية في غريب الأثر: لابن الجوزي- تحقيق: طاهر أحمد الزاوي ومحمود … محمد الطناحي- المكتبة العلمية- بيروت. 7 - الفائق في غريب الحديث: لمحمود بن عمر الزمخشري- تحقيق: علي محمد البجاوي ومحمد أبو الفضل إبراهيم- دار المعرفة- لبنان.",
    "foot_note":"None",
    "book_id":"72"
  },
  {
    "serial_number":"4962149",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":70,
    "volume_number":1,
    "text":" ثالثاً: كتب الحديث: 1 - الجامع الصحيح: للإمام البخاري- دار الشعب- القاهرة. 2 - صحيح مسلم بشرح النووي- دار إحياء التراث العربي- بيروت. 3 - سنن أبي داود: لأبي داود سليمان بن الأشعث السجستاني- دار الكتاب العربي- بيروت. 4 - سنن الترمذي: للإمام: محمد بن عيسى الترمذي- تحقيق: أحمد محمد شاكر- دار إحياء التراث العربي- بيروت. 5 - سنن ابن ماجة- لمحمد بن يزيد القزويني- تحقيق: محمد فؤاد عبد الباقي- دار الفكر- بيروت. 6 - سنن النسائي الكبرى: للإمام أبي عبد الرحمن أحمد بن شعيب النسائي- دار الكتب العلمية- بيروت. 7 - سنن النسائي الصغرى: للإمام أحمد بن شعيب النسائي- تحقيق: عبد الفتاح أبو غدة- مكتب المطبوعات الإسلامية- حلب. 8 - موطأ مالك بن أنس: تحقيق: محمد مصطفى الأعظمي- مؤسسة زايد بن سلطان. 9 - المستدرك على الصحيحين: لأبي عبد الله الحاكم النيسابوري- تحقيق: مصطفى عبد القادر عطا- دار الكتب العلمية- بيروت. 10 - مسند الإمام أحمد بن حنبل: تحقيق: شعيب الأرنؤوط، عادل مرشد، بإشراف د\/ عبد الله ابن عبد المحسن التركي- مؤسسة الرسالة. 11 - صحيح ابن حبان بترتيب ابن بلبان: لمحمد بن حيان السبتي- تحقيق: شعيب الأرنؤوط- مؤسسة الرسالة- بيروت. 12 - شعب الإيمان: لأبي بكر أحمد بن الحسين البيهقي- تحقيق: محمد السعيد بسيوني زغلول- دار الكتب العلمية- بيروت. 13 - معجم الطبراني الكبير.",
    "foot_note":"None",
    "book_id":"72"
  },
  {
    "serial_number":"4962150",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":71,
    "volume_number":1,
    "text":"14 - معجم الطبراني الأوسط: تحقيق: طارق بن عوض الله وعبد المحسن بن إبراهيم- دار الحرمين- القاهرة. 15 - معدم الطبراني الصغير: تحقيق: محمد شكور محمود- المكتب الإسلامي- بيروت. 16 - مشكاة المصابيح: للعلامة: ولي الله التبريزي مع شرحه مرعاة المفاتيح، للشيخ: أبي الحسن المباركفوري. 17 - مسند البزار: لأبي بكر احمد بن عمرو البزار- تحقيق: محفوظ الرحمن زبن الله- مكتبة العلوم والحكم- المدينة المنورة. 18 - مسند أبي يعلى- دار المأمون للتراث- دمشق- تحقيق: حسين سليم أسد. 19 - مصنف ابن أبي شيبة: تحقيق: كمال يوسف الحوت- مكتبة الرشد- الرياض. 20 - الأدب المفرد للإمام البخاري- تحقيق: محمد فؤاد عبد الباقي- دار البشائر- بيروت. 21 - التيسير بشرح الجامع الصغير: للحافظ زين الدين عبدا لرؤوف المناوي- مكتبة الإمام الشافعي- الرياض. 22 - طبقات الشافعية الكبرى: للإمام تاج الدين السبكي- تحقيق: د\/ محمد محمد الطناحي- د\/ عبد الفتاح محمد الحلو- هجر للطباعة والنشر والتوزيع. 23 - السلسلة الصحيحة للألباني. 24 - صحيح الترغيب والترهيب للألباني- مكتبة المعارف- الرياض. 25 - صحيح الدامع الصغير وزيادته للألباني- المكتب الإسلامي- بيروت. 26 - مشكاة المصابيح للتبريزي: تحقيق: الألباني- المكتب الإسلامي- بيروت. 27 - أحكام الجنائز للألباني. 28 - مختصر الشمائل المحمدية للترمذي: تحقيق واختصار: الألباني- المكتبة الإسلامية- عمان. 29 - صحيح الأدب المفرد للإمام البخاري: تحقيق: الألباني- دار الصديق.",
    "foot_note":"None",
    "book_id":"72"
  },
  {
    "serial_number":"4962151",
    "category_id":"23",
    "category":"الرقائق والآداب والأذكار",
    "book_title":"النجوم الزاهرات في فضائل الباقيات الصالحات",
    "edition":"None",
    "publisher":"None",
    "page_number":72,
    "volume_number":1,
    "text":"30 - صحيح الكلم الطيب للألباني- المكتب الإسلامي- بيروت. 31 - صفة حج النبي صلى الله عليه وسلم للألباني- المكتب الإسلامي- بيروت. 32 - صفة صلاة النبي صلى الله عليه وسلم للألباني- مكتبة المعارف- الرياض. 33 - السنة لابن أبي عاصم: تحقيق: الألباني- المكتب الإسلامي- بيروت. 34 - خطبة الحاجة: للألباني: المكتب الإسلامي- بيروت. 35 - صحيح سنن أبي داود: للألباني. 36 - صحيح سنن الترمذي: للألباني. 37 - صحيح سنن النسائي: للألباني. 38 - صحيح سنن ابن ماجة: للألباني.",
    "foot_note":"None",
    "book_id":"72"
  }
]