[
  {
    "text": "الوفية باختصار الألفية (ألفيةِ ابن مالك)\nالمؤلف: عبد الرحمن بن أبي بكر جلال الدين السيوطي\nسنة الوفاة: 911",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "category_id": "31",
    "category": "النحو والصرف",
    "new_page_number": 1
  },
  {
    "text": "sn: 7287\nbook_title: الوفية باختصار الألفية (ألفيةِ ابن مالك)\nbook_link: https://shamela.ws/book/105\nbook_id: 105\nauthor_name: عبد الرحمن بن أبي بكر جلال الدين السيوطي\nauthor_year: 911\nnickname: Null\nauthor_link: https://shamela.ws/author/7\nauthor_ID: 7\neditor: حمزة مصطفى حسن أبو توهة (دراسة وتحقيق)\npublisher: مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية\nedition: الأولى، 2019 م - 1440 هـ\npages: 97\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: النحو والصرف\ncategory_id: 31",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "category_id": "31",
    "category": "النحو والصرف",
    "new_page_number": 2
  },
  {
    "serial_number": "6606222",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: النحو والصرف الكتاب : الوفية باختصار الألفية ( ألفيةِ ابن مالك ) المؤلف : جلال الدين السيوطي ( ت : 911 هـ ) دراسة وتحقيق : حمزة مصطفى حسن أبو توهة الناشر : مؤسسة « عِلْم » لإحياء التراث والخدمات الرقمية الطبعة : الأولى ، 2019 م - 1440 هـ عدد الصفحات : 97 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 26 ربيع الأول 1442\nالكتاب : الوفية باختصار الألفية ( ألفيةِ ابن مالك ) المؤلف : جلال الدين السيوطي ( ت : 911 هـ ) دراسة وتحقيق : حمزة مصطفى حسن أبو توهة الناشر : مؤسسة « عِلْم » لإحياء التراث والخدمات الرقمية الطبعة : الأولى ، 2019 م - 1440 هـ عدد الصفحات : 97 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 26 ربيع الأول 1442\nالمؤلف : جلال الدين السيوطي ( ت : 911 هـ ) دراسة وتحقيق : حمزة مصطفى حسن أبو توهة الناشر : مؤسسة « عِلْم » لإحياء التراث والخدمات الرقمية الطبعة : الأولى ، 2019 م - 1440 هـ عدد الصفحات : 97 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 26 ربيع الأول 1442\nدراسة وتحقيق : حمزة مصطفى حسن أبو توهة الناشر : مؤسسة « عِلْم » لإحياء التراث والخدمات الرقمية الطبعة : الأولى ، 2019 م - 1440 هـ عدد الصفحات : 97 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 26 ربيع الأول 1442\nالناشر : مؤسسة « عِلْم » لإحياء التراث والخدمات الرقمية الطبعة : الأولى ، 2019 م - 1440 هـ عدد الصفحات : 97 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 26 ربيع الأول 1442\nالطبعة : الأولى ، 2019 م - 1440 هـ عدد الصفحات : 97 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 26 ربيع الأول 1442\nعدد الصفحات : 97 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 26 ربيع الأول 1442\n[ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 26 ربيع الأول 1442\nتاريخ النشر بالشاملة : 26 ربيع الأول 1442",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 3
  },
  {
    "serial_number": "6606223",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 1,
    "volume_number": 1,
    "text": "الوفية باختصار الألفية ألفيةِ ابن مالك اختصار الإمام العلامة جلال الدين السيوطي ت 911 هـ دراسة وتحقيق حمزة مصطفى حسن أبو توهة",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 4
  },
  {
    "serial_number": "6606224",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 4,
    "volume_number": 1,
    "text": "مقدمة الناشر الحمد لله القائل: {إِنَّا أَنْزَلْنَاهُ قُرْآنًا عَرَبِيًّا}، والصلاة والسلام على من أوتي جوامع الكلم، فعلم أصحابه قراءة القرآن غضا طريا، وبعد فقد ألف الإمام العلامة الحجة ابن مالك الأندلسي الجياني ألفيته التي صارت كعبة الدارسين، وشُرحت كثيرا من علماء عارفين، واختُصرت كذلك. وكان الإمام السيوطي رحمه الله صاحب همة عالية، ومجدد عصره، حاز الفنون والعلوم، وأحب أن يكون له نصيب في ذلك؛ فاختصر ألفية ابن مالك في (635) بيتا، والعجيب أن مصر خلت من نسخة من اختصار الألفية، بل خلا العالم كله فيما نعلم إلا الأندلس (أسبانيا)، فحفظ الله لنا اختصار هذه المنظومة في مكتبة الأسكوريال بأسبانيا، وهي نسخة نفيسة كتبها تلميذه النجيب الإمام العلامة محمد بن علي الداودي صاحب طبقات المفسرين، فأنعم بها من نسخة مباركة بخط إمام مبارك لإمام مبارك، اختصرت ألفية إمام مبارك، وقد حققها أخ فاضل مبارك مشتغل مُحصِّل متفنن، وهو الأخ الفاضل حمزة أبو توهة سلمه الله، من بلاد الشام المقدَّس فلسطين، والحمد لله الذي أكرمنا بنشرها، ونسأل الله النفع بها والإخلاص والقبول؛ إنه ولي الإجابة سبحانه. وكتب خادم تراث الأمة الإسلامية عبد العاطي محيي الشرقاوي أبو يعقوب الأزهري",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 5
  },
  {
    "serial_number": "6606225",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 5,
    "volume_number": 1,
    "text": "مقدمة حاز علم النحو نصيبًا وافرًا من المنظومات العلمية، منها ما كان يجمع جُلّ أبواب النحو، مثل ألفية ابن معط، وألفية ابن مالك، وألفية الآثاري، وألفية السيوطي، ومن قبلها ملحة الإعراب، ومنها ما كان يختص بمسائل مفردة، مثل القصيدة المجرادية، ونظم المرادي للجمل، ونظم الزواوي لقواعد الإعراب، والمنظومة الميمية لحازم القرطاجني. ولعل أول منظومة في النحو -كما يقال- هي منظومة الخليل بن أحمد الفراهيدي، وقد شكك الدكتور العلامة الطناحي في هذه النسبة للخليل بن أحمد، ورجح أن يكون أول عهد بالمنظومات ما بعد القرن الرابع (1) . وأشهر هذه المنظومات ملحة الإعراب للحريري، وألفية ابن معط، والوافية لابن الحاجب، وألفية ابن مالك، وألفية السيوطي المسماة بالفريدة، وألفية ابن مالك هي الأشهر على الإطلاق، حيث إنه إذا أُطلق لفظ الألفية فهو منصرف إليها من غير لبس. ولما كانت ألفية ابن مالك هي أنفع المنظومات النحوية انبرى كبار العلماء شارحين لها، درسوها في مجالسهم، وكتبوا عليها تعليقات وتقييدات وحواشي وشروحًا لشواهد شروحها، وبعضهم اختصرها. ومن أهم هذه الاختصارات \"الوفية باختصار الألفية\" للإمام جلال الدين السيوطي، وكان العزم منعقدًا على العكوف على هذا الاختصار تحقيقًا ودراسة، لما فيه من نفع للطلاب، وذلك في قالب اختصار الفائدة النحوية بلفظ أقل مع الحفاظ على القاعدة بل ربما مع زيادة فائدة على الألفية. والله الموفق حمزة مصطفى حسن أبو توهة 23\\ 7\\2018",
    "foot_note": "1. انظر: الفصول الخمسون 29.",
    "book_id": "105",
    "new_page_number": 6
  },
  {
    "serial_number": "6606226",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 7,
    "volume_number": 1,
    "text": "الدراسة",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 7
  },
  {
    "serial_number": "6606227",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 9,
    "volume_number": 1,
    "text": "ترجمة الإمام ابن مالك (1) هو محمد بن عبد اللَّه بن عبد اللَّه بن مالك، العلّامة الأوحد، جمال الدّين، أبو عبد الله الطّائيّ، الجَيّانيّ، الشّافعيّ، النّحويّ. اشتهر بـ\"ابن مالك\"، نسبة إلى جدّه الأعلى، وتكنى بأبي عبد الله، وهو نار على علم وأشهر من أن نطنب في ترجمته. اختُلف في سنة ولادته، فقد ذهب الهواري وابن قاضي شهبة إلى أنه ولد في سنة 598 هـ، وذهب ابن شاكر وابن كثير والفيروزابادي والسيوطي إلى أنه ولد سنة 600 هـ، وذهب الصفدي إلى أنه ولد عام 601 هـ، والراجح أنه ولد عام 598؛ لما قاله معاصره كمال الدين بن العديم أن ابن مالك أخبره بذلك. وُلد ابن مالك في مدينة جيان في الأندلس، وتلقى العلم فيها، ثم رحل إلى بلاد المشرق، ثم مصر، واستقر أخيرًا في دمشق، وفيها مات منتصف سنة 672 هـ. وتتلمذ على ابن مالك خلق كثير، منهم: 1. محمد بن عبد الرحمن بن محمد بن عبد الرحمن السلمي الدمشقي الحنفي، بدر الدين، المعروف بابن الفويرة ت 672. 2. محمد بن عبد القوي بن بدران المرداوي الجماعيلي الحنبلي، أبو عبد الله، شمس الدين ت 699 هـ. 3. محمد بن عبد الرحمن بن يوسف بن محمد البعلبكي الحنبلي، أبو عبد الله، شمس الدين ت 699 هـ.",
    "foot_note": "1. انظر: الوافي بالوفيات 3\\ 285 وطبقات الشافعية الكبرى 8\\ 67 وبغية الوعاة 1\\ 130 ونفح الطيب 2\\ 228 وألفية ابن مالك 11.",
    "book_id": "105",
    "new_page_number": 8
  },
  {
    "serial_number": "6606228",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 10,
    "volume_number": 1,
    "text": "4. محمد بن منصور بن موسى بن محمد الحلبي الشافعي، أبو عبد الله، شمس الدين ت 700 هـ. 5. محمد بن غالب بن يونس بن شعبة الأنصاري، أبو عبد الله، شمس الدين ت 702 هـ. 6. أبو بكر بن يعقوب بن سالم الديري الرحبي الشافعي، شهاب الدين ت 703 هـ. 7. محمد بن الفضل بن سلطان بن عماد بن تمام الجعبري الحلبي، المعروف بابن الخطيب ت 713 هـ. 8. إسماعيل بن الحسين بن أبي السائب بن أبي العيش الأنصاري الدمشقي، مجد الدين ت 721 هـ. 9. محمد بن إسماعيل بن إبراهيم الدمشقي الأنصاري العبادي، أبو عبد الله، المعروف بابن الخباز ت 756 هـ. لابن مالك ثلاثة من الأولاد، أشهرهم ابنه بدر الدين أبو عبد الله، وهو أكبر أولاده، توفي سنة 686 هـ، وابنه تقي الدين الملقب بالأسد، وهو الذي ألف ابن مالك له المقدمة الأسدية، توفي 699 هـ، وابنه شمس الدين، توفي عام 719 هـ. من تصانيف ابن مالك المؤصّل في نظم المفصل، وقد حل هذا النظم فسماه سبك المنظوم وفك المختوم، ومن قال إن اسمه فك المنظوم وسبك المختوم فقد خالف النقل والعقل، ومن كتب ابن مالك كتاب الكافية الشافية ثلاثة آلاف بيت، وشرحها، والخلاصة وهي مختصر الكافية الشافية، وإكمال الإعلام بمثلث الكلام، وهو مجلد كبير كثير الفوائد يدل على اطلاع عظيم، ولامية الأفعال وشرحها، وفعل وأفعل، والمقدمة الأسدية وضعها باسم ولده الأسد،",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 9
  },
  {
    "serial_number": "6606229",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 11,
    "volume_number": 1,
    "text": "وعدّة اللافظ وعمدة الحافظ، والنظم الأوجز فيما يهمز، والاعتضاد في الظاء والضاد مجلد، وإعراب مشكل البخاري، وتحفة المودود في المقصور والممدود، وغير ذلك كشرح التسهيل (1) .  مكانته: قال الذهبي: \"وكان إمامًا في القراءات وعللها؛ صنَّف فيها قصيدة داليّة مرموزة في مقدار الشاطبية، وأما اللغة فكان إليه المنتهى في الإكثار من نقل غريبها والاطّلاع على وحشِيّها، وأمّا النّحو والتّصريف فكان فيه بحرًا لا يُجارى وحَبرًا لا يُبارى، وأما أشعار العرب التي يُستشهد بها على اللغة والنّحو فكانت الأئمّة الأعلام يتحيّرون فيه ويتعجبّون من أين يأتي بها، وكان نظم الشعر سهلًا عليه، رجزه وطويله وبسيطه وغير ذلك، هذا مع ما هو عليه من الدّين المتين وصِدق اللهجة وكثرة النّوافل، وحُسن السَّمت، ورقّة القلب وكمال العقل والوقار والتُّؤَدَة\" (2) . وقال ابن كثير: \"وتقدم وساد في فني النحو والقراءات وحصل منهما شيئًا كبيرًا، وأربى على كثير ممن تقدمه في هذا الشأن مع الدين والصدق وحسن السمت وكثرة النوافل وكمال العقل والوقار والتودد\" (3) .",
    "foot_note": "1. انظر: نفح الطيب 2\\ 225. \n2. انظر: تاريخ الإسلام 15\\ 249. \n3. انظر: طبقات الشافعيين 908.",
    "book_id": "105",
    "new_page_number": 10
  },
  {
    "serial_number": "6606230",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 12,
    "volume_number": 1,
    "text": "ترجمة الإمام السيوطي (1)  اسمه: عبد الرحمن بن الكمال أبي بكر بن محمد بن سابق الدين بن الفخر عثمان بن ناظر الدين محمد بن سيف الدين خضر بن نجم الدين أبي الصلاح أيوب بن ناصر الدين محمد بن الشيخ همام الدين الهمام الخضيري الأسيوطي.  قال السيوطي: \"أما جدي الأعلى همام الدين، فكان من أهل الحقيقة، وأما نسبتنا بالخضيري، فلا أعلم ما تكون إليه هذه النسبة إلا بالخضيرية، محلة ببغداد، وقد حدثني من أثق به، أنه سمع والدي -رحمه الله تعالى- يذكر أن جده الأعلى كان أعجميًّا أو من الشرق، فالظاهر أن النسبة إلى المحلة المذكورة، وكان مولدي بعد المغرب ليلة الأحد مستهل رجب سنة تسع وأربعين وثمانمائة. وحملت في حياة أبي إلى الشيخ محمد المجذوب، رجل كان من كبار الأولياء بجوار المشهد النفيسي، فبرّك عليّ، ونشأت يتيمًا، فحفظت القرآن ولي دون ثماني سنين، ثم حفظت العمدة، ومنهاج الفقه والأصول، وألفية ابن مالك، وشرعت في الاشتغال بالعلم من مستهل سنة أربع وستين، فأخذت الفقه والنحو عن جماعة من الشيوخ، وأخذت الفرائض عن العلامة فرضي زمانه الشيخ شهاب الدين الشارمساحي الذي كان يقال إنه بلغ السن العالية وجاوز المائة بكثير، والله أعلم بذلك، قرأت عليه في شرحه على المجموع، وأُجِزتُ بتدريس العربية في مستهل سنة ست وستين.",
    "foot_note": "1. نقلت هذه الترجمة من ترجمة السيوطي لنفسه في حسن المحاضرة 1\\ 335.",
    "book_id": "105",
    "new_page_number": 11
  },
  {
    "serial_number": "6606231",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 13,
    "volume_number": 1,
    "text": "وقد ألفت في هذه السنة، فكان أول شيء ألفته الاستعاذة والبسملة، وأوقفت عليه شيخنا شيخ الإسلام علم الدين البلقيني، فكتب عليه تقريظًا، ولازمته في الفقه إلى أن مات، فلازمت ولده، فقرأت عليه من أول التدريب لوالده إلى الوكالة، وسمعت عليه من أول الحاوي الصغير إلى العدد، ومن أول المنهاج إلى الزكاة، ومن أول التنبيه إلى قريب من باب الزكاة، وقطعة من الروضة من باب القضاء، وقطعة من تكملة شرح المنهاج للزركشي، ومن إحياء الموات إلى الوصايا أو نحوها، وأجازني بالتدريس والإفتاء من سنة ست وسبعين، وحضر تصديري. فلما توفي سنة ثمان وسبعين لزمت شيخ الإسلام شرف الدين المناوي، فقرأت عليه قطعة من المنهاج، وسمعته عليه في التقسيم إلا مجالس فاتتني، وسمعت دروسًا من شرح البهجة، ومن حاشية عليها، ومن تفسير البيضاوي. ولزمت في الحديث والعربية شيخنا الإمام العلامة تقي الدين الشبلي الحنفي، فواظبته أربع سنين، وكتب لي تقريظًا على شرح ألفية ابن مالك وعلى جمع الجوامع في العربية تأليفي، وشهد لي غير مرة بالتقدم في العلوم بلسانه وبنانه. ولزمت شيخنا العلامة أستاذ الوجود محيي الدين الكافيجي أربع عشرة سنة، فأخذت عنه الفنون من التفسير والأصول والعربية والمعاني وغير ذلك، وكتب لي إجازة عظيمة. وحضرت عند الشيخ سيف الدين الحنفي دروسًا عديدة في الكشاف والتوضيح وحاشيته عليه، وتلخيص المفتاح، والعضد. وشرعت في التصنيف في سنة ست وستين، وسافرت بحمد الله تعالى إلى بلاد الشام والحجاز واليمن والهند والمغرب والتكرور، ولما حججت شربت من ماء زمزم لأمور، منها أن أصل في الفقه إلى رتبة الشيخ سراج الدين البلقيني، وفي الحديث إلى رتبة الحافظ ابن حجر.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 12
  },
  {
    "serial_number": "6606232",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 14,
    "volume_number": 1,
    "text": "وأفتيت من مستهل سنة إحدى وسبعين، وعقدت إملاء الحديث من مستهل سنة اثنتين وسبعين. ورزقت التبحر في سبعة علوم: التفسير، والحديث، والفقه، والنحو، والمعاني، والبيان، والبديع، على طريقة العرب والبلغاء، لا على طريقة العجم وأهل الفلسفة. والذي أعتقده أن الذي وصلت إليه من هذه العلوم السبعة سوى الفقه والنقول التي اطلعت عليها فيها، لم يصل إليه ولا وقف عليه أحد من أشياخي، فضلًا عمن هو دونهم، وأما الفقه فلا أقول ذلك فيه، بل شيخي فيه أوسع نظرًا، وأطول باعًا، ودون هذه السبعة في المعرفة: أصول الفقه والجدل والتصريف، ودونها الإنشاء والتوسل والفرائض، ودونها القراءات، ولم آخذها عن شيخ، ودونها الطب، وأما علم الحساب فهو أعسر شيء عليّ وأبعده عن ذهني، وإذا نظرت في مسألة تتعلق به فكأنما أحاول جبلًا أحمله. وقد كملت عندي الآن آلات الجهاد بحمد الله تعالى، أقول ذلك تحدثًا بنعمة الله تعالى لا فخرًا؛ وأي شيء في الدنيا حتى يطلب تحصيلها بالفخر، وقد أزف الرحيل، وبدا الشيب، وذهب أطيب العمر! ولو شئت أن أكتب في كل مسألة مصنفًا بأقوالها وأدلتها النقلية والقياسية، ومداركها ونقوضها وأجوبتها، والموازنة بين اختلاف المذاهب فيها لقدرت على ذلك من فضل الله، لا بحولي ولا بقوتي، فلا حول ولا قوة إلا بالله، ما شاء الله، لا قوة إلا بالله. وقد كنت في مبادئ الطلب قرأت شيئًا في علم المنطق، ثم ألقى الله كراهته في قلبي، وسمعت أن ابن الصلاح أفتى بتحريمه فتركته لذلك، فعوضني الله تعالى عنه علم الحديث الذي هو أشرف العلوم.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 13
  },
  {
    "serial_number": "6606233",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 15,
    "volume_number": 1,
    "text": "وأما مشايخي في الرواية سماعًا وإجازة فكثير، أوردتهم في المعجم الذي جمعتهم فيه، وعدتهم نحو مائة وخمسين، ولم أكثر من سماع الرواية لاشتغالي بما هو أهم وهو قراءة الدراية. انتهى من حسن المحاضرة. وتوفي السيوطي -رحمه الله تعالى- سنة 911 هـ.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 14
  },
  {
    "serial_number": "6606234",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 16,
    "volume_number": 1,
    "text": "الكتاب  توثيق واسم نسبة هذا الكتاب للسيوطي مما لا يختلف فيه اثنان ولا يتناطح عليه عنزان، فقد ثبت هذا لديّ بما لا يدع مجالًا للشك، اعتمدت في هذا على أمور، منها: 1. ذكره السيوطي في كتابه التحدث بنعمة الله من ضمن مؤلفاته، فقال: \"الوفية باختصار الألفية ستمئة بيت\" (1) . 2. ذكر السيوطي في فهرس مؤلفاته قائلًا: \"الوفية باختصار الألفية\" (2) . 3. قال حاجي خليفة عندما ذكر الألفية وشرح السيوطي عليها: \"وله مختصر الألفية في ستمئة وثلاثين رقيقة، وسماه \"الوفية\" (3) . 4. ويظهر هذا في مقدمة الكتاب جليًّا، حيث قال السيوطي في أول بيت: يَقُولُ رَاجِي رَحْمَةِ العَلِيِّ … عَبْدٌ لِرَحْمَنَ بْنِ السّيوطِي (4)",
    "foot_note": "1. انظر: التحدث بنعمة الله 113 و 135. \n2. انظر: فهرس مؤلفات السيوطي 11. \n3. انظر: كشف الظنون 1\\ 152. \n4. لا يتزن البيت بهذه الرواية.",
    "book_id": "105",
    "new_page_number": 15
  },
  {
    "serial_number": "6606235",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 17,
    "volume_number": 1,
    "text": "التعريف بألفية ابن مالك سبك الإمام ابن مالك ألفيته في مدينة حماه بطلب من الإمام شرف الدين البارزي، قال ابن الوردي: \"وأخبرني شيخنا قاضي القضاة شرف الدين هبة الله بن البارزي قال: نظم الشيخ جمال الدين الخلاصة الألفية بحماه عندنا برسم اشتغالي فيها، وكنت شابًّا وخدمتُه ولقد رأيت بركة خدمتي له\" (1) . وهذه الألفية تحوي ثمانية وسبعين بابًا وفصلًا، احتوت على جل مقاصد النحو كما قال ابن مالك في ختامها: نظمًا على جل المهمات اشتمل (2) وهذه الألفية في الأصل اختصار لمنظومة كبيرة لابن مالك تدعى \"الكافية الشافية\"، وعدة أبياتها ألفان وسبعمئة ونيف وخمسون بيتًا، قال ابن مالك في ختام الكافية الشافية (3) : أبياتُها ألفانِ مَعْ سَبعِمئهْ … وَزِيدَ خمسونَ ونَيْفٌ أَكْملَهْ وذكر في الألفية أن هذه الألفية اختصار للكافية الشافية فقال: أحصى من الكافية الخلاصة (4) وقد كتب الله لهذه الألفية الذيوع والانتشار، فقد سارت بها الركبان، وحملها الناس إلى كل مكان، وجمعت في رحابها كبار العلماء شارحين ومستخرجين مكنوناتها.",
    "foot_note": "1. انظر: تاريخ ابن الوردي 2\\ 216. \n2. انظر: الألفية ص 188 البيت 999. \n3. انظر: شرح الكافية الشافية 4\\ 2252. \n4. انظر: الألفية ص 188 البيت 1000.",
    "book_id": "105",
    "new_page_number": 16
  },
  {
    "serial_number": "6606236",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 18,
    "volume_number": 1,
    "text": "ومن أهم هذه الشروح شرح ابن الناظم وشرح أبي حيان وشرح المرادي وشرح ابن عقيل وشرح ابن هشام وشرح الشاطبي وشرح المكودي وشرح السيوطي، وغيرها من الشروح كثير. ومن العلماء من اختصر الألفية، ومنهم محمد بن محمد بن علي بن عمر الإسنوي، وكذلك الإمام ابن الوردي الذي اختصر الألفية في مئة وخمسين بيتًا سماها التحفة الوردية، ثم شرح هذا المختصر وقد طبع، ومنها مختصر اسمه المختصر المفيد لمحمود محفوظ الدمشقي، موجود نسخة منه في القاهرة ثان 2: 158. ومن هذه المختصرات هذا المختصر الذي نحن بصدد تحقيقه وهو الوفية باختصار الألفية للإمام السيوطي.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 17
  },
  {
    "serial_number": "6606237",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 19,
    "volume_number": 1,
    "text": "الوفية باختصار الألفية بلغت عدة أبيات الوفية ستمئة وخمسة وثلاثين بيتًا، وهي تقريبًا في حجم ثلثَي الألفية، وقد صدق السيوطي حينما قال في خاتمة الوفية (1) : نَظَمْتُهَا فِي نَحْوِ ثُلْثَيْ أَصْلِهَا … وَلَنْ تَرَى مُخْتَصَرًا كَمِثْلِهَا وهذا لا يتنافى مع ما قاله حاجي خليفة في كشف الظنون، حيث قال: \"\"وله مختصر الألفية في ستمئة وثلاثين رقيقة، وسماه \"الوفية\" (2) ، إذ إن هذا التعداد تقريبي كعادة العلماء في تحديد عدد أبيات المنظومات أو القصائد. قد يسأل سائل: ما فائدة الوفية؟ أقول إنه بالإضافة إلى كونها اختصارًا للألفية يقلل من لفظ القاعدة النحوية، هي كانت في مواضع كثيرة ذات فائدة زائدة، فانظر إلى قول السيوطي: وَيَا النَّفْسِ مَعَ الفِعْلِ يَلِي … نُونَ وِقَايَةٍ، وَفِي \"لَيْتَ\" صِلِ وَحَذْفُهَا شَذَّ، وَعَكْسُهَا \"لَعَلّْ\" … فِي أَرْبَعٍ (3) خَيِّرْ، وَيَحْيَى (4) الوَصْلُ قَلّْ فانظر إلى قوله: \"ويحيى الوصل قلّ\" فهو زائد على لفظ الألفية. وقوله: وَذُو إِضَافَةٍ يَصِيرُ عَلَمَا … إِنْ غَلَبَتْ، أَوْ \"أَلْ\" (5) ، وَحَذْفَهَا (6) الْزَمَا إِنْ تُضِفَ اوْ تُنَادِ، قُلْتُ اللَّامُ فِي … \"اللهِ\" لَمْ تُزَدْ وَلَمْ تُعَرِّفِ فانظر إليه وهو قد أضاف الخلاف في الألف واللام التي في لفظ الجلالة \"الله\".",
    "foot_note": "1. انظر البيت 632. \n2. انظر: كشف الظنون 1\\ 152. \n3. يقصد بالأربع الأحرف الناسخة غير لعل وليت، وهي: إِنّ وأَنّ ولَكِنّ وكَأَنّ. \n4. يقصد به الإمام الفراء أبا زكريا يحيى بن زياد. انظر رأيه في شرح المرادي 1\\ 381. \n5. أي وذو \"أل\" يصير علمًا إن غلبت. \n6. أي حذف أل.",
    "book_id": "105",
    "new_page_number": 18
  },
  {
    "serial_number": "6606238",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 20,
    "volume_number": 1,
    "text": "وحينما ترجع إلى مواضع الابتداء بالنكرة، وإلى قوله: وَ\"رَغْبَةٌ فِي الخَيْرِ خَيْرَةٌ\"، وَنَصّْ … حُكْمٍ يُفِيدُ، وَالذِي عَمَّ وَخَصّْ (1) فأنت تراه قد أضاف \"والذي عم وخص\". ومن خصائص هذا المختصر أنه -على صغره- لم يهمل مقارنة كلام ابن مالك بكتبه الأخرى، قال: وَشِبْهَهُ فِي \"خِلْتَنِيهِ\"، \"كُنْتُهُ\" … قَدْ رُجِّحَ الوَصْلُ، وَقَدْ رَأَيْتُهُ (2) نَاقَضَ فِي التَّسْهِيلِ (3) تابِعًا لِنَصّْ … عَمْرٍو (4) ، وَقَدِّمْ فِي اتِّصَالٍ الأَخَصّْ وقال: وَزَادَ فِي كَافِيَةٍ (5) أَشْيَا أُخَرْ … ذَاتَ اشْتِهَارٍ وَسِوَى هَذِي نَدَرْ ولم يهمل السيوطي نقل آراء العلماء في هذا المختصر، قال: وَمَا بِـ\"بِئْسَ مَا اشْتَرَوُا\" (6) مُمَيِّزُ (7) … وَسِيبَوَيْهِ (8) فَاعِلٌ وَمَيَّزُوا",
    "foot_note": "1. أرجع أبو حيان جواز بالابتداء بالنكرة إلى شيئين هما العموم والخصوص، قال في منظومته \"نهاية الإعراب في علمي التصريف والإعراب: وكل ما ذكرت في التقسيم يرجع للتخصيص والتعميم انظر: الأشباه والنظائر 2\\ 113. \n2. يعني رأيت ابن مالك. \n3. انظر: تسهيل الفوائد 27. \n4. انظر: الكتاب 2\\ 363، وشرح التسهيل 1\\ 153. \n5. انظر: شرح الكافية الشافية 4\\ 1745 - 1746. \n6. البقرة 90. \n7. انظر: التبيان للعكبري 1\\ 91 والبحر المحيط 1\\ 472 والدر المصون 1\\ 507. \n8. انظر: الكتاب 3\\ 155.",
    "book_id": "105",
    "new_page_number": 19
  },
  {
    "serial_number": "6606239",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 21,
    "volume_number": 1,
    "text": "وقال: مُسْتَقْبَلٌ مَعْنًى، وَبِالفِعْلِ تُخَصّْ … و\"أَنَّ\" مُبْتَدًا عَلَيْهِ عَمْرُو (1) نَصّْ (2) وقال: وَحَذْفُهَا شَذَّ، وَعَكْسُهَا \"لَعَلّْ\" … فِي أَرْبَعٍ (3) خَيِّرْ، وَيَحْيَى (4) الوَصْلُ قَلّْ",
    "foot_note": "1. يقصد به سيبويه. \n2. قال سيبويه: \"وتقول: لو أنه ذاهبٌ لكان خيراً له، فأنَّ مبنيَّة على لو كما كانت مبنيَّة على لولا، كأنك قلت: لو ذاك\". انظر: الكتاب 3\\ 121. \n3. يقصد بالأربع الأحرف الناسخة غير لعل وليت، وهي: إِنّ وأَنّ ولَكِنّ وكَأَنّ. \n4. يقصد به الإمام الفراء أبا زكريا يحيى بن زياد. انظر رأيه في شرح المرادي 1\\ 381.",
    "book_id": "105",
    "new_page_number": 20
  },
  {
    "serial_number": "6606240",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 22,
    "volume_number": 1,
    "text": "علاقة السيوطي بمصنفات ابن مالك كان السيوطي مدركًا لقيمة مصنفات ابن مالك، فهو من أكثر العلماء الذين تعلقوا بمصنفات ابن مالك، ونذكر منها: كتابه البهجة المرضية أو النهجة المرضية، وقد شرح فيها ألفية ابن مالك شرحًا ممتزجًا بالألفية، وهو شرح متوسط. كتابه النكت على الألفية والكافية والشافية والشذور والنزهة، حيث جمع السيوطي بين هذه الكتب، وحرر ما فيها من المسائل، وأورد ما على المهم منها من الاعتراضات، وناقش مصنفيها. كتابه همع الهوامع، وإذا سألت ما العلاقة أقول: من أعظم متون النحو متن التسهيل لابن مالك، وأعظم شروح التسهيل شرح أبي حيان المسمى بالتذييل والتكميل، وقد جرد أبو حيان هذا الشرح العظيم من تعليلات مسائله في كتاب سماه ارتشاف الضرب، وكان كتاب همع الهوامع يسير ونصب عينيه تسهيل ابن مالك وارتشاف الضرب كما صرح السيوطي في مقدمة الهمع حيث قال: \"محيط بخلاصة كتابي التسهيل والارتشاف\" (1) . وأيضًا كتاب السيوطي الفريدة وهي ألفيته في النحو، لخّص فيها ألفية ابن مالك في ستمئة بيت تقريبًا وزاد من عنده أربعمئة بيت.",
    "foot_note": "1. انظر: همع الهوامع 1\\ 20.",
    "book_id": "105",
    "new_page_number": 21
  },
  {
    "serial_number": "6606241",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 23,
    "volume_number": 1,
    "text": "بين الفريدة والوفية لعل أول من فتح الباب لنظم ألفية في النحو هو الإمام ابن معط، قال رحمه الله في مقدمة ألفيته (1) : وَذَا حَدَا إِخْوَانَ صِدْقٍ لِي عَلَى … أَنِ اقْتَضَوْا لَهُمْ مِنِّي أَنْ أَنْظِمَا أُرْجُوزَةً وَجِيزَةً فِي النَّحْوِ … عِدَّتُهَا أَلْفٌ خَلَتْ مِنْ حَشْوِ لِعِلْمِهِمْ بِأَنَّ حِفْظَ النَّظْمِ … وِفْقُ الذَّكِيِّ وَالبَعِيدِ الفَهْمِ ثم جاء بعد ابن معط الإمام ابن مالك، فنظم ألفيته المعروفة بالخلاصة، وصرح في مقدمتها أنه اقتفى أثر ابن معط في النظم، إذ إن ابن معط سابق له، وهو مستن به، قال ابن مالك عن ألفيته (2) : وَتَقْتَضِي رِضًا بِغَيْرِ سُخْطِ … فَائِقَةً أَلْفِيَّةَ ابْنِ مُعْطِ وَهْوَ بِسَبْقٍ حَائِزٌ تَفْضِيلَا … مُسْتَوْجِبٌ ثَنَائِيَ الجَمِيلَا وَاللهُ يَقْضِي بِهِبَاتٍ وَافِرَهْ … لِي وَلَهُ فِي دَرَجَاتِ الآخِرَهْ والحق الذي يُقال أن ألفية ابن مالك أجمع وأوعب، وألفية ابن معط أسلس وأعذب (3) ، وأيضًا فاقت الخلاصة بأنها نظمت على بحر واحد، أما ألفية ابن معط فكانت على بحرين: الرجز والسريع، قال ابن معط في مقدمة ألفيته (4) : لَا سِيَّمَا مَشْطُورَ بَحْرِ الرَّجَزِ … إِذَا بُنِي عَلَى ازْدِوَاجٍ مُوجَز أَوْ مَا يُضَاهِيهِ مِنَ السَّرِيعِ … مُزْدَوِجَ الشُّطُورِ كَالتَّصْرِيعِ",
    "foot_note": "1. انظر: ألفية ابن معطي 2. \n2. انظر: ألفية ابن مالك 68. \n3. انظر: نفح الطيب 2\\ 232. \n4. انظر: ألفية ابن معطي 2.",
    "book_id": "105",
    "new_page_number": 22
  },
  {
    "serial_number": "6606242",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 24,
    "volume_number": 1,
    "text": "بينما كانت ألفية ابن مالك على بحر واحد وهو بحر الرجز. وجاء بعد ذلك الإمام الآثاري، ونظم ألفية سماها \"كفاية الغلام في إعراب الكلام\"، وقد نظم فيها المقدمة المحسبة لابن بابشاذ، وصرح بهذا المؤلف في شرحه على الألفية (1) . ولا شك أن الآثاري كان مقتفيًا لنهج ابن معط وابن مالك، لذلك تجده في المقدمة قد قال عن ألفيته (2) : فَائِقَةٌ بِأَنْفَعِ المَسَالِكِ … عَنِ ابْنِ مُعْطٍ وَعَنِ ابْنِ مَالِكِ لكن هذه الألفية لم يكتب لها من الذيوع ما كتب لسابقتيها. بعد ذلك جاء الإمام السيوطي، ونظم ألفيته المشهورة بالفريدة، وشرحها في كتاب سماه بالمطالع السعيدة في شرح الفريدة، ولا شك أن السيوطي قد جعل نصب عينيه ألفية ابن مالك، إذ هي درة تاج المنظومات، قال السيوطي في المقدمة عن ألفيته (3) : فَهَذِهِ أَلْفِيَّةٌ فِيهِ حَوَتْ … أُصُولَهُ وَنَفْعَ طُلَّابٍ نَوَتْ فَائِقَةٌ أَلْفِيَّةَ ابْنِ مَالِكِ … لِكَوْنِهَا وَاضِحَةَ المَسَالِكِ وَجَمْعَهَا مِنَ الأُصُولِ مَا خَلَتْ … عَنْهُ وَضَبْطِ مُرْسَلَاتٍ أُهْمِلَتْ وقال السيوطي عن ألفيته: \"لخصت فيها ألفية ابن مالك في ستمئة بيت، وزدتها أربعمئة بيت فيها من القواعد والفوائد والزوائد ما لا يستغني طالب النحو عنه، فبذلك فاقت ألفية ابن مالك، وفاقتها أيضًا بالتنبيه على قيود أهمل ابن مالك",
    "foot_note": "1. انظر: كفاية الغلام 21. \n2. انظر: كفاية الغلام 39. \n3. انظر: الفريدة 2.",
    "book_id": "105",
    "new_page_number": 23
  },
  {
    "serial_number": "6606243",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 25,
    "volume_number": 1,
    "text": "ذكرها، وبكونها أوضح عبارة من عبارة الألفية، فهذه ثلاثة أمور فاقتها بها، والتنبيه على ذلك في النظم أحسن من السكوت عنه\" (1) . ومما لا بد منه أن نربط بين الفريدة وبين الوفية؛ إذ كان منبعهما واحد، وهو ألفية ابن مالك، ومن خلال المقارنة وجدنا أن مقدار التشابه بين النظمين الفريدة والوفية كبير، ولا شيء أدل على ذلك أكثر من أن نورد بعض الأمثلة للتمثيل لا الحصر. وقبل التمثيل من الضروري أن نحدد أي المنظومتين كانت أسبق، الفريدة أم الوفية. وبالرجوع إلى أواخر المنظومتين نجد أن الوفية نُظمت عام 869 هـ، والفريدة نظمت عام 885 هـ، قال في خاتمة الوفية (2) : خَتَمْتُهَا فِي ظَهْرِ بَحْرِ القَلْزَمِ … مُسَافِرًا لِلبَلَدِ المُحَرَّمِ وَفِي رَبِيعٍ لَاحَ زَهْرُ نَظْمِهَا … وَفِي جُمَادَى فَاحَ مِسْكُ خَتْمِهَا مِنْ عَامِ تِسْعَةٍ وَسِتِّينَ التِي … بَعْدَ ثَمَانِمِئَةٍ لِلهِجْرَةِ وقال -رحمه الله تعالى- في خاتمة الفريدة (3) : نَظَمْتُهَا نَظْمًا بَدِيعَ النَّهْجَةِ … سَهْلًا وَوَافَى الخَتْمُ فِي ذِي الحِجَّةِ مِنْ عَامِ خَمْسٍ وَثَمَانِينَ التِي … بَعْدَ ثَمَانِمِئَةٍ لِلهِجْرَة فيظهر من هذا أن استفاد من الوفية في نظم الفريدة.",
    "foot_note": "1. انظر: المطالع السعيدة 1\\ 80. \n2. انظر: الفريدة 89\\ب \n3. انظر: الفريدة: 74.",
    "book_id": "105",
    "new_page_number": 24
  },
  {
    "serial_number": "6606244",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 26,
    "volume_number": 1,
    "text": "المثال الأول: قال السيوطي في الوفية في باب الكلام وما يتألف منه: كَلَامُنَا قَوْلٌ مُفِيدٌ يُقْصَدُ … . . . . . . . . . . . . . ولو رجعت إلى الفريدة لوجدت هذا الشطر بنصه هناك (1) . قال السيوطي في الوفية في باب المعرب والمبني: وَالِاسْمُ فَابْنِهِ لِشِبْهِ الحَرْفِ فِي … وَضْعٍ وَالِاسْتِعْمَالِ وَالمَعْنَى تَفِ وَغَيْرُهُ أُعْرِبَ وَالمَاضِي بُنِي … وَالأَمْرُ وَالثَّالِثُ مُعْرَبٌ إِنِ يَعْرَ مِنَ الإِنَاثِ وَالتَّوْكِيدِ إِنْ … بَاشَرَهُ وَالحَرْفُ بِالبِنَا قَمِنْ وإذا تصفحت نفس الباب في الفريدة وجدت الأبيات الثلاثة كما هي في الفريدة، إلا أن زاد بعد البيت الثاني بيتًا (2) . المثال الثاني: قال في باب العلم من الوفية: العَلَمُ المُعَيِّنُ المُسَمَّى … مِنْ غَيْرِ قَيْدٍ لِذَوِي إِلْفٍ مَا وهذا البيت كما هو في الفريدة (3) . المثال الثالث: قال في الوفية في اسم الإشارة: أَشِرْ بِـ\"ذَا\" لِذَكَرٍ وَ\"ذِهْ\" وَ\"ذِي\" … \"تِي\"، \"تَا\" لِلُانْثَى، \"ذَانِ\"، \"تَانِ\" لِلذِي ثُنِّي، وَ\"ذَيْنِ\"، \"تَيْنِ\" غَيْرَ الرَّفْعِ … وَبِـ\"أُوَلَى\" لِمُطْلَقٍ مِنْ جَمْعِ",
    "foot_note": "1. انظر: الفريدة 2. \n2. انظر: الفريدة 3. \n3. انظر: الفريدة 10.",
    "book_id": "105",
    "new_page_number": 25
  },
  {
    "serial_number": "6606245",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 27,
    "volume_number": 1,
    "text": "ولو رجعت إلى الفريدة لوجدت البيتين هناك كما هما (1) . وعلى هذا فقس، فأمثلة المشابهة بل والمطابقة كثيرة جدًّا. ويحق لنا أن نتساءل عن سبب هذا التشابه الكبير بين الوفية والفريدة، وأقرب جواب إن لم يكن أصوبه هو أن الوفية اختصار للألفية، والسيوطي أراد أن تكون ألفيته فائقة على ألفية ابن مالك، فسعى إلى أن يلخص الألفية ويزيد عليها، وهذا ما صرح به في شرحه للفريدة حيث قال إنه لخص الخلاصة في ستمئة بيت وزاد أربعمئة بيت، ولو رجعت إلى كلام السيوطي عن الوفية فستجده قال إنه لخص الألفية في الوفية في ستمئة بيت، وبهذا تعرف سبب هذا التشابه. وبهذا تعرف أن السيوطي أراح نفسه كثيرًا عندما كان ينظم الفريدة، لأنه جهده في الوفية قد خدمه كثيرًا.",
    "foot_note": "1. انظر: الفريدة 11.",
    "book_id": "105",
    "new_page_number": 26
  },
  {
    "serial_number": "6606246",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 28,
    "volume_number": 1,
    "text": "النسخة المخطوطة اعتمدت في التحقيق على نسخة يتيمة، على أنني لم آل جهدًا في البحث عن نسخة أخرى، لكن لم أقع فيما عدت إليه من فهارس على طائل. والمخطوطة من الإسكوريال تقع في خمس وعشرين لوحة، في كل لوحة ورقتان، وهي تحت رقم 1792، من ورقة 66 ب إلى ورقة 90 ب، وهي مكتوبة بخط نسخي عادي غير مشكول، وليس عليها هوامش، وهي مقابَلة، وكتبت في حياة المؤلف عام 903 هـ.  عملي في التحقيق 1 - كتابة النسخة المخطوطة وفق القواعد الإملائية الحديثة، محاولًا جهدي الوصول إلى القراءة السليمة لكلماتها معتمدًا على ما هو متاح لديّ من مصادر. 2 - تخريج الآيات القرآنية بذكر اسم السورة ورقم الآية. 3 - تخريج الأحاديث النبوية -وهي قليلة- بذكر الكتب التي وردت فيها مع إكمال لفظ الحديث. 4 - تخريج الشواهد الشعرية من خلال نسبتها إلى قائلها وبيان بحرها وموضع الشاهد فيها، وتوثيقها من الكتب المعتمدة. 5 - توثيق النقول التي جاء بها المصنف من الكتب التي نقل منها. 6 - ربط كلام السيوطي المبهم بكلام الألفية ليتضح اللفظ الغامض. 7 - التعليق على ما يحتاج التعليق من النظم. 8 - مقابلة النسخة المخطوطة على الكتب التي لها علاقة بها كالفريدة والمطالع السعيدة والبهجة المرضية لتقويم النص على أحسن وجه أراده السيوطي.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 27
  },
  {
    "serial_number": "6606247",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 29,
    "volume_number": 1,
    "text": "صور النسخة المخطوطة ورقة العنوان",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 28
  },
  {
    "serial_number": "6606248",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 30,
    "volume_number": 1,
    "text": "الورقة الأولى",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 29
  },
  {
    "serial_number": "6606249",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 31,
    "volume_number": 1,
    "text": "الورقة الأخيرة",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 30
  },
  {
    "serial_number": "6606250",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 35,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرحيم 1. يَقُولُ رَاجِي رَحْمَةِ العَلِيِّ … عَبْدٌ لِرَحْمَنَ بْنِ السّيوطِي (1) 2. أَبْدَأُ حَامِدَ الإِلَهِ الصَّمَدِ … مُصَلِّيًا عَلَى النَّبِيِّ أَحْمَدِ (2) 3. وَأَسْتَعِينُ اللهَ فِي اخْتِصَارِ … خُلَاصَةِ النَّحْوِ بِلَا اقْتِصَارِ 4. وَرُبَّمَا أُحَرِّرُ المُتْعَرَضَا … وَرُبَّمَا أَزِيدُ شَيْئًا يُرْتَضَى 5. وَأَسْأَلُ اللهَ حِلَى الرِّضْوَانِ … لِي وَلَهُ (3) وَلِذَوِي الإِيمَانِ (4)  الكَلامُ وَمَا يَتَأَلَّفُ مِنْهُ 6. كَلَامُنَا لَفْظٌ مُفِيدٌ يُقْصَدُ … وَذُو الثَّلَاثِ كَلِمٌ (5) ، وَالمُفْرَدُ 7. كَلِمَةٌ، وَهْيَ سُمًا (6) أَوْ فِعْلُ … أَوْ حَرْفُ مَعْنًى، وَيَعُمُّ القَوْلُ (7)",
    "foot_note": "1. لا يتزن البيت بهذه الرواية. \n2. صرفه ضرورة. \n3. أي لابن مالك. \n4. في هذا إشارة لطفية، حيث تجنب السيوطي ما جاء به ابن مالك في مقدمته، حيث اعتُرض على ابن مالك عدم تعميمه للدعاء إذ قال: واللهُ يقضِي بهباتٍ وافِرَهْ \n…. لِي ولَهُ في درَجاتِ الآخِرَهْ ولكن السيوطي هنا عمّم فقال: لِي ولَهُ ولذوي الإيمانِ انظر: ألفية ابن مالك ص 68 البيت 7. \n5. أي ما جمع ثلاث كلمات هو الكلم، ولا يشترط فيه الإفادة بل يشترط العدد فقط. انظر: أوضح المسالك 35، وشرح ابن عقيل 1\\ 15. \n6. أحد لغات الاسم \"سُمَا\" \n7. يعني أن القول يعم الكلام والكلم والكلمة، فبينه وبين الكلام والكلم والكلمة عموم وخصوص مطلق. انظر: أوضح المسالك 36، وتمهيد القواعد 1\\ 138.",
    "book_id": "105",
    "new_page_number": 31
  },
  {
    "serial_number": "6606251",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 36,
    "volume_number": 1,
    "text": "8. فَالِاسْمُ بِالإِسْنَادِ وَالتَّنْوِينِ … وَالفِعْلُ بِالتَّاءَيْنِ (1) وَالتَّنْوِينِ (2) 9. سِوَاهُمَا الحَرْفُ، مُضَارِعٌ بِـ\"لَمْ\" … وَالمَاضِ بِالتَّاءَيْنِ (3) مَيِّزْهُ كَـ\"عَمّْ\" 10. وَالأَمْرُ بِالنُّونِ وَأَمْرٌ فُهِمَا (4) … وَمُفْهِمٌ لَا يَقْبَلُ النُّونَ سُمَا (5)  المُعْرَبُ وَالمَبْنِيُّ 11. وَالِاسْمُ فَابْنِهِ لِشِبْهِ الحَرْفِ فِي … وَضْعٍ وَالِاسْتِعْمَالِ وَالمَعْنَى تَفِ 12. وَغَيْرُهُ (6) أُعْرِبَ، وَالمَاضِي بُنِي … وَالأَمْرُ، وَالثَّالِثُ (7) مُعْرَبٌ إِنِ 13. يَعْرَ مِنَ الإِنَاثَ وَالتَّوْكِيدِ (8) إِنْ … بَاشَرَهُ، وَالحَرْفُ بِالبِنَا قَمِنْ (9) 14. وَالأَصْلُ فِي المَبْنِيِّ تَسْكِينٌ كَـ\"لَمْ\" … وَجَاءَ فِيهِ الفَتْحُ وَالكَسْرُ وَضَمّْ 15. رَفْعٌ وَنَصْبٌ لِذِي الِاعْرَابِ حُتِمْ (10) … وَالِاسْمُ مُنْجَرٌ وَفِعْلٌ مُنْجَزِمْ (11) 16. فَارْفَعْ بِضَمٍّ وَانْصِبَنْ فَتْحًا وَجُرّْ … كَسْرًا وَسَكِّنْ جَازِمًا كَـ\"لَمْ يَزُرْ\" 17. وَغَيْرُ ذَا يَنُوبُ، فَانْصِبْ بِالأَلِفْ … وَارْفَعْ بِوَاوٍ وَبِيَا اجْرُرْ مَا أَصِفْ 18. أَبًا أَخًا حَمًا هَنًا وَالنَّقْصُ جَلّْ (12) … فِي ذَا (13) وَقَلَّ دُونَ قَصْرٍ فِي الأُوَلْ",
    "foot_note": "1. تاء الفاعل وتاء التأنيث الساكنة. \n2. كذا في المخطوط. \n3. تاء الفاعل وتاء التأنيث الساكنة. \n4. يعني يتميز فعل الأمر بدلالته على الأمر مع جواز دخول نون التوكيد. \n5. أي اسم فعل أمر كل ما دل على الأمر ولا يقبل نون التوكيد. \n6. أي الاسم غير مشبه الحرف. \n7. أي الفعل المضارع. \n8. أي نوناهما. \n9. أي حقيق وجدير. \n10. ينقل فتحة همزة الإعراب إلى اللام قبلها، وبحذف ياء \"ذي\" واختلاس الكسرة. \n11. يعني الجر يختص بالاسم والجزم يختص بالفعل. \n12. أي أحسن وأفضل وأجل. \n13. الإشارة هنا إلى آخر مذكور وهو كلمة \"هَنًا\".",
    "book_id": "105",
    "new_page_number": 32
  },
  {
    "serial_number": "6606252",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 37,
    "volume_number": 1,
    "text": "19. وَ\"ذَا\" لِصُحْبَةٍ، \"فَمًا\" إِنْ تَحْذِفِ … آخِرَهُ، وَكُلُّهَا إِنْ تُضِفِ 20. لِغَيْرِ يًا (1) ، بِالأَلِفِ ارْفَعْ وَبِيَا … اِنْصِبْ وَجُرَّ: \"اثْنَيْنِ\" مَعْ مَا ثُنِّيَا 21. وَإِنْ تُضِفْ لِمُضْمَرٍ \"كِلْتَا\"، \"كِلَا\" … مَعَ \"اثْنَتَيْنِ\" بَعْدَ فَتْحِ مَا تَلَا (2) 22. وَارْفَعْ بِوَاوٍ وَبِيَا اجْرُرْ وَانْصِبِ … سَالِمَ جَمْعِ \"أَحْمَدٍ\" وَ\"مُجْتَبِي\" 23. وَأُلحِقَ \"العِشْرُونَ\" وَ\"السِّنُونَا\" … وَبَابُ ذَيْنِ، وَكَذَا \"الأَهْلُونَا\" 24. \"أُولُو\" وَ\"عَالَمُونَ\"، \"عِلِّيُّونَا\" … وَمِثْلُ \"حِينٍ\" قَدْ يَجِي \"سِنُونَا\" 25. وَكَسْرُ نُونٍ لِمُثَنًى اتُّبِعْ … وَقَلَّ فَتْحٌ بِخِلَافِ مَا جُمِعْ (3) 26. بِالكَسْرِ نَصْبُ جَمْعِ تَاءٍ وَأَلِفْ … كَذَا \"أُولَاتُ\" وَمُسَمًّى قَدْ أُلِفْ (4) 27. بِالفَتْحِ جَرُّ الِاسْمِ غَيْرِ المُنْصَرِفْ … فَإِنْ يُضَفْ أَوْ يَتْلُ \"أَلْ\" فَيَنْصَرِفْ 28. وَاجْعَلْ لِرَفْعِ \"تَفْعَلِينَ\" النُّونَا … وَنَحْوِ \"تَفْعَلَانِ\"، \"تَفْعَلُونَا\" 29. وَاحْذِفْ لِنَصْبٍ وَلِجَزْمٍ، وَسِمِ … كَـ\"المُصْطَفَى\" المُعْتَلَّ (5) أَوْ كَـ\"المُعْتَمِي\" 30. فَالأَوَّلُ المَقْصُورُ، كُلًّا (6) قَدِّرِ … وَالثَّانِ مَنْقُوصٌ، وَنَصْبًا أَظْهِرِ",
    "foot_note": "1. أي ياء المتكلم. \n2. أي بعد فتح الحرف الذي قبل حرف إعراب المثنى وهما الألف والياء. \n3. من الغريب أن ابن مالك نظم هذه المسألة في الخلاصة في بيتين، بينما في الكافية الشافية -وهي أمُّ الألفية والألفية اختصارها- نظمها في بيت واحد، قال في الكافية الشافية: وَالنُّونُ فِي جَمْعٍ لَهُ الفَتْحُ وَفِي تَثْنِيَةٍ كَسْرٌ وَعَكْسٌ قَدْ يَفِي وقال في الألفية: وَنُونَ مَجْمُوعٍ وَمَا بِهِ الْتَحَقْ فَافْتَحْ وَقَلَّ مَنْ بِكَسْرِهِ نَطَقْ وَنُونُ مَا ثُنِّيَ وَالمُلْحَقِ بِهْ بِعَكْسِ ذَاكَ اسْتَعْمَلُوهُ فَانْتَبِهْ انظر: ألفية ابن مالك ص 74 البيت 39 و 40، وشرح الكافية الشافية 1\\ 191. \n4. كعرفات وأذرعات. انظر: التصريح 1\\ 82. \n5. مفعول به للفعل \"سِمِ\". \n6. أي جميع الحركات.",
    "book_id": "105",
    "new_page_number": 33
  },
  {
    "serial_number": "6606253",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 38,
    "volume_number": 1,
    "text": "31. وَالفِعْلُ ذُو الوَاوِ أَخِيرًا وَالأَلِفْ … وَاليَاءِ مُعْتَلٌ فَحَذْفُهَا أُلِفْ 32. جَزْمًا، وَرَفْعُ كُلِّهَا يُقَدَّرُ … وَالنَّصْبُ فِي وَاوٍ وَيَاءٍ يَظْهَرُ  النَّكِرَةُ وَالمَعْرِفَةُ 33. قَابِلُ \"أَلْ\" مُؤَثِّرًا (1) أَوْ وَاقِعُ … مَوْقِعَهُ نَكِرَةٌ وَشَائِعُ 34. وَغَيْرُهُ مَعْرِفَةٌ كَـ: هُمْ، وَذِي … يَا رَجُلُ، الفَاضِلُ، هِنْدُ، ابْنِي، الذِي (2) 35. فَمُفْهِمُ الغَيْبَةِ وَالحُضُورِ سَمّْ (3) … بِمُضْمَرٍ، وَذُو اتِّصَالٍ مِنْهُ لَمْ 36. يَقَعْ فِي الِابْتِدَا أَوْ تِلْوَ \"إِلَّا\" … كَاليَّاءِ وَالهَا الكَافِ، وَابْنِ كُلَّا (4) 37. وَلَفْظُ ذِي الجَرِّ كَنَصْبٍ، وَلِكُلّْ … \"نَا\" (5) ، وَلِمَا خُوطِبَ أَوْ غَابَ يَدُلّْ 38. نُونٌ وَوَاوٌ أَلِفٌ وَمُضْمَرُ … خَفِي بِـ: قُمْ، صَهْ، نَأَتَ، اضْرِبْ، تُشْكُرُ 39. ذُو الفَصْلِ مَرْفُوعًا: أَنَا، أَنْتَ وَهُو … وَالفَرْعُ، \"إِيَّا\" لِلذِي تَنْصِبُهُ 40. وَلَمْ يَجِئْ مُنْفَصِلٌ إِنْ يُمْكِنِ … وَصْلٌ، بِهَا \"سَلْنِيهِ\" كُلًّا (6) حَسِّنِ",
    "foot_note": "1. أي مؤثرًا أل فيه التعريف. \n2. أشار بها إلى أنواع المعارف، هم: ضمير، ذي: اسم إشارة، يا رجل: منادى مقصود، الفاضل: المعرف بأداة التعريف، هند: العلم، ابني: المضاف إلى معرفة، الذي: الموصول. قال ابن مالك في الكافية الشافية: مَا شَاعَ فِي جِنْسٍ كَـ\"عَبْدٍ\" نَكِرَهْ وَغَيْرُهُ مَعْرِفَةٌ كَـ\"عَنْتَرَهْ\" فَمُضْمَرٌ أَعْرَفُهَا ثُمَّ العَلَمْ وَاسْمُ إِشَارَةٍ وَمَوْصُولٌ مُتَمّْ وَذُو أَدَاةٍ أَوْ مُنَادًى عُيِّنَا أَوْ ذُو إِضَافَةٍ بِهَا تَبَيَّنَا انظر: شرح الكافية الشافية 1\\ 222. \n3. أي \"سَمِّ\". \n4. أي جميع الضمائر مبنية. \n5. يعني أن الضمير \"نا\" يصلح للرفع والنصب والجر، قال تعالى: \"ربنا إننا سمعنا مناديًا\". آل عمران 193. \n6. أي الوصل والفصل، سلنيه أو سلني إياه",
    "book_id": "105",
    "new_page_number": 34
  },
  {
    "serial_number": "6606254",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 39,
    "volume_number": 1,
    "text": "41. وَشِبْهَهُ فِي \"خِلْتَنِيهِ\"، \"كُنْتُهُ\" … قَدْ رُجِّحَ الوَصْلُ، وَقَدْ رَأَيْتُهُ (1) 42. نَاقَضَ فِي التَّسْهِيلِ (2) تابِعًا لِنَصّْ … عَمْرٍو (3) ، وَقَدِّمْ فِي اتِّصَالٍ الأَخَصّْ 43. وَمَا تَشَا فِي الفَصْلِ، وَالذِّي اتَّحَدْ … فِي رُتْبَةٍ فَافْصِلْ، وَفِي الغَيْبِ (4) وَرَدْ 44. وَصْلٌ، وَيَا النَّفْسِ مَعَ الفِعْلِ يَلِي … نُونَ وِقَايَةٍ، وَفِي \"لَيْتَ\" صِلِ 45. وَحَذْفُهَا شَذَّ، وَعَكْسُهَا \"لَعَلّْ\" … فِي أَرْبَعٍ (5) خَيِّرْ، وَيَحْيَى (6) الوَصْلُ قَلّْ 46. وَنَحْوَ \"لَيْسِي\" وَ\"مِنِي\"، \"عَنِي\" ارْدُدِ … وَ\"لَدُنِي\" قَلَّ، كَذَا \"قَطْنِي\" اشْدُدِ  العَلَمُ 47. العَلَمُ: المُعَيِّنُ المُسَمَّى … مِنْ غَيْرِ قَيْدٍ لِذَوِي إِلْفٍ مَا 48. اسْمٌ وَكُنْيَةٌ وَلَقَبٌ، وَذَا (7) … مَعْ غَيْرِهِ أَخِّرْهُ، وَلْيُضَفْ إِذَا 49. فَرْدَيْنِ كَانَا وَاسْتَوَى الثَّانِي تَبَعْ … وَمِنْهُ ذُو النَّقْلِ وَالِارْتِجَالِ (8) مَعْ 50. تَرْكِيبِ إِسْنَادٍ وَمَزْجِ، وَابْنِ مَا … بِـ\"وَيْهِ\"، وَالمُضَافُ شَاعَ عَلَمَا",
    "foot_note": "1. يعني رأيت ابن مالك. \n2. انظر: تسهيل الفوائد 27. \n3. انظر: الكتاب 2\\ 363، وشرح التسهيل 1\\ 153. \n4. أي ضمير الغيبة. \n5. يقصد بالأربع الأحرف الناسخة غير لعل وليت، وهي: إِنّ وأَنّ ولَكِنّ وكَأَنّ. \n6. يقصد به الإمام الفراء أبا زكريا يحيى بن زياد. انظر رأيه في شرح المرادي 1\\ 381. \n7. يقصد به اللقب، فإنه يؤخر إذا اجتمع مع الكنية والاسم. انظر: شرح التسهيل 1\\ 174 وتخليص الشواهد 118 وتعليق الفرائد 2\\ 148. \n8. قال في الهمع: \"\"ينقسم العلم إلى منقول ومرتجل وواسطة بينهما لا توصف بنقل ولا ارتجال هذا رأي الأكثرين وذهب بعضهم إلى أن الأعلام كلها منقولة وليس منها شيء مرتجل، وذهب الزجاج إلى أنها كلها مرتجلة\". انظر: همع الهوامع 1\\ 285 والمرتجل 293 والمقدمة الجزولية 63 وتوجيه اللمع 311.",
    "book_id": "105",
    "new_page_number": 35
  },
  {
    "serial_number": "6606255",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 40,
    "volume_number": 1,
    "text": "51. وَعَلَمُ الجِنْسِ شَبِيهُ مَا سَبَقْ … لَفْظًا، وَفِي المَعْنَى بِنُكْرٍ (1) الْتَحَقْ 52. كَمِثْلِ \"أُمِّ عِرْيَطٍ\" وَ\"بَرَّهْ\" (2) … اِسْمَانِ لِلعَقْرَبِ وَالمَبَرَّهْ  اسْمُ الإِشَارَةِ 53. أَشِرْ بِـ\"ذَا\" لِذَكَرٍ وَ\"ذِهْ\" وَ\"ذِي\" … \"تِي\"، \"تَا\" لِلُانْثَى، \"ذَانِ\"، \"تَانِ\" لِلذِي 54. ثُنِّي، وَ\"ذَيْنِ\"، \"تَيْنِ\" غَيْرَ الرَّفْعِ … وَبِـ\"أُوَلَى\" لِمُطْلَقٍ مِنْ جَمْعِ 55. وَالمَدُّ أَوْلَى، وَلِكَافٍ فَزِدِ … مَعْ لَامٍ اوْ بِدُونِهَا فِي البُعْدِ 56. وَوَحْدَهَا مَعْ تِلْوِ \"هَا\"، وَالجَمْعَ مُدّْ … وَلِلمَكَانِ \"هَهُنَا\" وَإِنْ بَعُدْ 57. فَالكَافَ صِلْ كَمَا مَضَى، أَوْ \"هَنَّا\" … أَوْ \"ثَمَّ\" قُلْ، وَالتَّاءَ (3) زِدْ، أَوْ \"هِنَّا\"  المَوْصُولُ 58. لَذِي (4) التِي مَوْصُولُ الَاسما لَمْ تُثَنّْ … فَاليَا احْذِفَنْ وَالنُّونَ مِنْهُ شَدِّدَنْ 59. تَعوُّضًا (5) كَنُونِ \"ذَيْنِ\"، \"تَيْنَا\" … وَالجَمْعُ لِـ\"الذِي\": \"الأُولَى\"، \"الذِينَا\" 60. وَ\"اللّاتِ\" وَاللَّا\" (6) لِـ\"التِي\"، وَكَـ\"الذِي\" … \"اللَّا\" (7) أَتَى، وَ\"مَنْ\" وَ\"مَا\" وَ\"أَلْ\" كَذِي (8) 61. وَ\"ذُو\" بِطَيِّئٍ كَذَا، أَوْ كَـ\"التِي\" … \"ذَاتُ\" وَكَـ\"اللَّاتِي\"، \"ذَوَاتُ\" أَتَتِ",
    "foot_note": "1. أي بالنكرة. \n2. انظر: شرح المفصل 1\\ 111 وسفر السعادة 1\\ 367 والمزهر 1\\ 400. \n3. فتقول: \"ثَمَّت\". \n4. يقصد: الذي. \n5. انظر: التذييل والتكميل 3\\ 26 وشرح المكودي 34. \n6. أي اللاء. \n7. أي اللاء. \n8. يقصد أنها أسماء موصولة مثل التي مضت. انظر: شرح التسهيل 1\\ 201 والجنى الداني 202 وخزانة الأدب 23.",
    "book_id": "105",
    "new_page_number": 36
  },
  {
    "serial_number": "6606256",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 41,
    "volume_number": 1,
    "text": "62. وَ\"ذَا\" كَمَا لَمْ تُلْغَ بَعْدَ \"مَا\" وَ\"مَنْ\" … مُسْتَفْهِمًا، وَكُلَّهَا (1) فَأَلْزِمَنْ 63. إِيلَاءَهَا بِصِلَةٍ مَعْ مُضْمَرِ … يَلِيقُ، وَهْيَ جُمْلَةٌ ذُو خَبَرِ 64. أَوْ شِبْهُهَا، وَخَالِصُ الوَصْفِ لِـ\"أَلْ\" … وَمُعْرَبُ الفِعْلِ، وَشَذَّ (2) بِالجُمَلْ 65. \"أَيٌّ\" كَـ\"مَا\"، وَأُعْرِبَتْ مَا لَمْ تُضَفْ … مَعْ حَذْفِ عَائِدٍ، وَغَيْرُهَا انْحَذَفْ 66. عَائِدُهُ إِنْ طَالَ وَصْلٌ يُلْمَحُ … وَلَمْ يَكُ البَاقِي لِوَصْلٍ يَصْلُحُ 67. وَعَائِدًا مُتَّصِلًا إِنْ يُنْصَبِ … بِفِعْلٍ اوْ وَصْفٍ فَحَذْفٌ مَا أُبِي 68. كَذَا الذِي جُرَّ بِوَصْفٍ عَمِلَا … أَوْ حَرْفٍ المَوْصُولَ جَرَّ أَوَّلَا  المُعَرَّفُ بِأَدَاةِ التَّعْرِيفِ 69. \"أَلْ\" حَرْفُ تَعْرِيفٍ أَوِ اللَّامُ، وَزِدْ (3) … كَـ\"اللَّاتِ\" لَازِمًا، وَفِي الشِّعْرِ (4) وُجِدْ 70. فِي عَلَمٍ وَفِي مُمَيِّزٍ، وَصِلْ … بِعَلَمٍ لِلَمْحِ مَا عَنْهُ نُقِلْ 71. وَذُو إِضَافَةٍ يَصِيرُ عَلَمَا … إِنْ غَلَبَتْ، أَوْ \"أَلْ\" (5) ، وَحَذْفَهَا (6) الْزَمَا 72. إِنْ تُضِفَ اوْ تُنَادِ، قُلْتُ اللَّامُ فِي … \"اللهِ\" لَمْ تُزَدْ وَلَمْ تُعَرِّفِ",
    "foot_note": "1. أي كل الأسماء الموصولة. \n2. هنا السيوطي خالف ابن مالك، فالظاهر من كلام ابن مالك أو وصل أل بالجملة يجوز على قلة لا يشذ، وكان ينبغي على السيوطي ألا يخالف ابن مالك لأنه يختصر متن ابن مالك، لا ينظم شيئًا مستقلًا له. انظر: شرح التسهيل 1\\ 201 والجنى الداني 202 وأوضح المسالك 1\\ 170. \n3. يعني أنها زائدة لازمة. انظر: الكتاب 3\\ 282 والأصول في النحو 2\\ 262 والجنى الداني 197. \n4. يعني قول رشيد اليشكري: رأيتك لما أن عرفت وجوهنا صددت وطبت النفس يا قيس عن عمر حيث دخلت \"أل\" هنا على التمييز، والتمييز نكرة. انظر: شرح السيرافي 2\\ 79 وتوجيه اللمع 444 والمقاصد النحوية 1\\ 470. \n5. أي وذو \"أل\" يصير علمًا إن غلبت. \n6. أي حذف أل.",
    "book_id": "105",
    "new_page_number": 37
  },
  {
    "serial_number": "6606257",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 42,
    "volume_number": 1,
    "text": "الابْتِدِاءُ 73. مُبْتَدَأٌ وَخَبَرٌ \"ذَا دَانِي\" … وَنَحْوُ \"مَا قَائِمٌ الزَّيْدَانِ\" 74. مُبْتَدَأٌ وَفَاعِلٌ أَغْنَى لِذَا … \"أَقَائِمٌ ذَانِ\" وَ\"مَنْ يَعُدِ انْبِذَا\" 75. وَإِنْ يُطَابِقْ غَيْرُ فَرْدٍ مَا تَلَا … فَخَبَرٌ مُقَدَّمٌ ( .... ) (1) 76. رَفَعَ ابْتِدَا مُبْتَدَأً وَذَا (2) الخَبَرْ … وَهْوَ مُتِمُّ الفَيْدِ (3) ، فَرْدًا اسْتَقَرّْ 77. وَجُمْلَةً مَعْ رَابِطٍ بِالمُبْتَدَا … مَا لَمْ تَكُنْ مَعْنًى كَهُو (4) ، وَالمُفْرَدَا 78. فَرِّغْهُ جَامِدًا، وَمُضْمَرُ اسْتَتَرْ … فِي ذِي اشْتِقَاقٍ، وَوُجُوبًا اسْتَقَرّْ 79. حَيْثُ جَرَى عَلَى الذِي لَيْسَ لَهُ … كَـ\"زَيْدٌ الهُنُودُ مُفْدِهُنَّ هُو\" 80. وَظَرْفًا اوْ شَبِيهَهُ بِكَـ\"اسْتَقَرّْ\" … عُلِّقَ (5) ، وَالزَّمَانُ لَمْ يَأْتِ خَبَرْ 81. عَنْ جُثَّةٍ مَا لَمْ يُفِدْ كَالِابْتِدَا … بِالنُّكْرِ (6) نَحْوُ \"عِنْدَ أَحْمَدٍ هُدَى\" 82. وَ\"هَلْ فَتًى فِيكُمْ\"، \"فَمَا خِلٌّ لَنَا\" … وَ\"رَجُلٌ مِنَ الكِرَامِ عِنْدَنَا\" (7)",
    "foot_note": "1. مطموس وغير واضح. \n2. أي هذا الخبر. وهو أحد مذاهب متعددة. انظر: الأصول في النحو 1\\ 58 والانتصار لسيبويه 130 والإيضاح العضدي 29 وعلل النحو 263 والخصائص 167 والإنصاف 1\\ 38 وشرح المفصل 1\\ 229. \n3. أي الفائدة. \n4. يعني تكن مثله في المعنى. \n5. مسألة خلافية بين النحاة. انظر: المسائل الحلبيات 105 والإنصاف 1\\ 197 ونتائج الفكر 324. \n6. أي بالنكرة. \n7. يقال إن ابن مالك قصد به الإمام النووي. انظر: نشر فيض الانشراح 1\\ 491 وحاشية الخضري 1\\ 225.",
    "book_id": "105",
    "new_page_number": 38
  },
  {
    "serial_number": "6606258",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 43,
    "volume_number": 1,
    "text": "83. وَ\"رَغْبَةٌ فِي الخَيْرِ خَيْرَةٌ\" وَنَصّْ … حُكْمٍ يُفِيدُ، وَالذِي عَمَّ وَخَصّْ (1) 84. وَالأَصْلُ فِي الأَخْبَارِ تَأْخِيرٌ، وَقَدْ … تَسْبِقُ، وَامْنَعْ سَبْقَهُ إِنِ اتَّحَدْ 85. مَعْ مُبْتَدًا عُرْفًا وَنُكْرًا وَالتَبَسْ … أَوْ جَاءَ مَحْصُورًا، وَفِعْلًا إِذْ عَكَسْ 86. أَوْ خَبَرًا عَنْ لَازِمِ الصَّدْرِ، وَفِي … \"لِي وَلَدَيَّ دِرْهَمٌ\" قَدِّمْ تَفِ 87. كَذَا الذِي عَادَ عَلَيْهِ مُضْمَرُ … مِنْ مُبْتَدًا، أَوْ حَقُّهُ التَّصَدُّرُ 88. أَوْ كَانَ مَحْصُورًا، وَحَذْفُ مَا عُلِمْ … مِنْ مُبْتَدًا وَخَبَرٍ أَجِزْ مُتِمّْ (2) 89. وَبَعْدَ \"لَوْلَا\" وَاليَمِينُ النَّصُّ مَعْ … وَاوٍ كَـ\"مَعْ\" فَالخَبَرَ احْذِفْ تُتَّبَعْ 90. وَقَبْلَ حَالٍ لَيْسَ صَالِحًا خَبَرْ … عَنْهُ كَـ\"ضَرْبِي ذَا مُسِيئًا\" اسْتَقَرّْ 91. لِمُبْتَدًا أُخْبِرَ عَنْهُ بِقَسَمْ … أَوْ مَصْدَرٍ عَنْ فِعْلِهِ الحَذْفُ انْحَتَمْ 92. كَصُورَتَيْنِ بَعْدَ ذَا وَعَدِّدَا … بِعَطْفٍ أَوْ لَا خَبَرًا عَنْ مُبْتَدَا  كَانَ وَأَخَوَاتُهَا 93. ارْفَعْ بِـ\"كَانَ\" المُبْتَدَا اسْمًا وَانْصِبِ … خَبَرَهُ، وَظَلَّ بَاتَ تُصِبِ 94. أَضْحَى وَأَمْسَى صَارَ لَيْسَ أَصْبَحَا … فَتِئَ وَانْفَكَّ وَزَالَ بَرِحَا 95. إِنْ نَفْيًا اوْ شِبْهًا (3) يَلِي ذِي الأَرْبَعَهْ … وَ\"دَامَ\" بَعْدَ \"مَا\"، وَذَا (4) لَنْ تُمْنَعَهْ",
    "foot_note": "1. أرجع أبو حيان جواز بالابتداء بالنكرة إلى شيئين هما العموم والخصوص، قال في منظومته \"نهاية الإعراب في علمي التصريف والإعراب: وكل ما ذكرت في التقسيم يرجع للتخصيص والتعميم انظر: الأشباه والنظائر 2\\ 113. \n2. المقصود بها أن يكون فهم المعنى تامًّا، أما إذا كان المعنى لا يتم فهمه مع الحذف فلا يجوز حينئذ. \n3. شبه النفي كالنهي والدعاء. \n4. أي هذا العمل.",
    "book_id": "105",
    "new_page_number": 39
  },
  {
    "serial_number": "6606259",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 44,
    "volume_number": 1,
    "text": "96. بَقِيَّةُ التَّصَرُّفَاتِ إِنْ تَقَعْ … وَخَبَرًا وَسِّطْهُ فِيهَا، وَامْتَنَعْ 97. تَقْدِيمُهُ \"دَامَ\" ومَا (1) بِـ\"مَا\" نُفِي … وَ\"لَيْسَ\"، وَالتَّامُ (2) بِرَفْعٍ يَكْتَفِي 98. وَغَيْرُهُ النَّاقِصُ، أَلْزِمَنْ \"فَتِي\" (3) … وَ\"زَالَ\"، \"لَيْسَ\"، وَامْنَعَنْ إِيلَاءَ تِي (4) 99. مَعْمُولَ أَخْبَارٍ سِوَى الظَّرْفِ وَمَا … يُشْبِهُهُ، وَأَوِّلَنَّ مُوهِمَا 100. وَ\"كَانَ\" زِدْ فِي الحَشْوِ وَاحْذِفْ وَالخَبَرْ … أَبْقِ وَبَعْدَ \"إِنْ\" وَ\"لَوْ\" هَذَا اشْتَهَرْ 101. وَبَعْدَ \"أَنْ\" تَعْوِيضُ \"مَا\" عَنْهَا اقْتُفِي … وَنُونَ مَجْزُومِ المُضَارِعِ احْذِفِ  مَا وَلَا وَإِنْ وَلاتَ المُشَبَّهَاتُ بِـ\"لَيْسَ \" 102. كَـ\"لَيْسَ\": \"مَا\" إِنْ بَقِيَ النَّفْيُ، وَقَدْ … أُخِّرَ ذُو النَّصْبِ، وَإِنْ \"إِنْ\" (5) لَمْ تُزَدْ 103. وَسَبْقَ ظَرْفٍ وَهْوَ مَعْمُولُ الخَبَرْ … أَجِزْ، وَعَطْفٌ بَعْدَ نَصْبٍ اسْتَقَرّْ 104. بِـ\"لَكِنَ\" اوْ \"بَلْ\" رَفْعُهُ حَتْمٌ، وَجَرّْ … مِنْ بَعْدِ \"مَا\" وَ\"لَا\" وَ\"لَيْسَ\" البَا الخَبَرْ (6) 105. كَنَفْيِ \"كَانَ\" وَكَـ\"لَيْسَ\": \"لَا\" عَمِلْ … فِي النَّكِرَاتِ، ذَا (7) بِـ\"لَاتَ\"، \"إِنْ\" يَقِلّْ 106. وَ\"لَاتَ\" بِالحِينِ وَمَا لَهُ رَدِفْ … تَخْتَصُّ، وَاسْمُهَا كَثِيرًا يَنْحَذِفْ (8)  أَفْعَالُ المُقَارَبَةِ 107. كَـ\"كَانَ\": \"كَادَ\" وَ\"عَسَى\"، لَكِنْ خَبَرْ … ذَيْنِ مُضَارِعٌ، وَوَصْلُ \"أَنْ\" (9) نَدَرْ",
    "foot_note": "1. أي الذي نفي بـ\"ما\". \n2. بتخفيف الميم، إذ لا يجتمع هنا الساكنان في حشو البيت. \n3. مخففة من \"فَتِئَ\". \n4. إشارة إلى أفعال هذا الباب، وهي كان وأخواتها. \n5. يقصد بها النافية. \n6. يعني أن الباء قد تجر أخبار ما ولا وليس. \n7. أي هذا العملُ. \n8. كقوله تعالى: \"ولات حينَ مناص\". ص 3. \n9. وصلها بالخبر.",
    "book_id": "105",
    "new_page_number": 40
  },
  {
    "serial_number": "6606260",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 45,
    "volume_number": 1,
    "text": "108. فِي \"كَادَ\" لَا \"عَسَى\"، وَمِثْلُ ذِي \"حَرَى\" … وَ\"اخْلَوْلَقَ\"، الْزِمْ \"أَنْ\" لِذَيْنِ خَبَرَا 109. فِي \"أَوْشَكَ\" الغَالِبُ \"أَنْ\"، وَ\"كَرَبَا\" … كَـ\"كَادَ\"، وَالتَّرْكُ لِـ\"أَنْ\" قَدْ وَجَبَا 110. فِي \"طَفِقَ\"، \"انْشَا\" وَ\"جَعَلْتُ\" وَ\"أَخَذْ\" … \"عَلِقْ\" (1) ، وَمِنْ \"كَادَ\" وَ\"أَوْشَكَ\" اتُّخِذْ 111. مُضَارِعٌ، وَ\"أَوْشَكَ\" اسْمُ فَاعِلِ … بَعْدَ \"عَسَى\"، \"اخْلَوْلَقَ\"، \"أَوْشَكَ\" اجْعَلِ 112. \"أَنْ\" مَعَ فِعْلٍ مُغْنِيًا عَنْ خَبَرِ … وَأَضْمِرَ اوْ جَرِّدْ ذِهِ إِنْ تَذْكُرِ 113. مِنْ قَبْلِهَا اسْمًا، وَ\"عَسَيْتُ\" يُكْسَرُ … السِّينُ مِنْهُ، وَانْفِتَاحٌ أَكْثَرُ \" إِنَّ\" وَأَخَوَاتُهَا 114. لِـ\"إِنَّ\"، \"أَنَّ\" عَكْسُ مَا لِـ\"كَانَ\" قَرّْ … \"عَلَّ\"، \"كَأَنَّ\"، \"لَيْتَ\"، \"لَكِنَّ\"، الخَبَرْ 115. أَخِّرْ سِوَى الظَّرْفِ، وَهَمْزُ \"أنَّا\" (2) … عَنْ مَصْدَرٍ يُفْتَحُ (3) ، وَاكْسِرَنَّا 116. فِي الِابْتِدَا وَبَدْءِ وَصْلٍ حَلْفِ … أَوْ حُكِيَتْ بِالقَوْلِ أَوْ حَالًا تَفِ (4) 117. وَمِنْهُ مَا عُلِّقَ بِاللَّامِ وَفِي … تِلْوِ \"إِذَا\" الفَجْأَةِ (5) وَجْهَيْنِ اقْتُفِي 118. وَتِلْوَ فَا الجَزَا وَتِلْوَ قَسَمِ … لَا لَامَ بَعْدَهُ وَذَا أَيْضًا نُمِي 119. فِي نَحْوِ \"خَيْرُ القَوْلِ أَنِّي أَذْكُرُ\" … وَاللَّامَ أَلْزِمْ خَبَرَ اللَّذْ تُكْسَرُ 120. لَا فِي الذِي يُنْفَى وَفِعْلٍ كَـ\"وَلِي\" … وَمَعَ \"قَدْ\" يَلِي، وَبِالفَصْلِ صِلِ 121. وَالِاسْمُ آخِرًا وَمَعْمُولُ الخَبَرْ … وَسْطًا، وَإِنْ تَصِلْ بِهَذِي مَا نَدَرْ",
    "foot_note": "1. لأنه يحث تناف؛ فحرف \"أن\" يخلص الفعل للاستقبال، وهذه الحروف للشروع. انظر: شرح السيرافي 1\\ 18 والمسائل البصريات 1\\ 705 وأسرار العربية 223 وشرح المفصل 4\\ 375 والتذييل والتكميل 4\\ 336. \n2. الألف للإطلاق، يقصد \"أَنَّ\". \n3. يعني أنها تفتح إذا سدت مسد مصدر. \n4. مجزوم جواب الطلب \"اكسر\" في البيت السابق. \n5. يقصد الفجائية.",
    "book_id": "105",
    "new_page_number": 41
  },
  {
    "serial_number": "6606261",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 46,
    "volume_number": 1,
    "text": "122. إِعْمَالُهَا، وَاعْطِفْ عَلَى اسْمِ \"إِنَّا\" (1) … بَعْدَ كَمَالٍ رَافِعًا وَ\"أَنَّا\" (2) 123. \"لَكِنَّ\"، وَالإِهْمَالُ إِنْ خَفَّفْتَ \"إِنّْ\" … أَكْثَرُ، وَاللَّامَ الْتَزِمْ إِنْ لَمْ يَبِنِ (3) 124. وَأَوْلِهَا النَّاسِخَ غَالِبًا، وَ\"أَنّْ\" … إِنْ خُفِّفَتْ فَالِاسْمَ حَذْفًا أَلْزِمَنْ 125. وَجُمْلَةٌ خَبَرُهَا، فَإِنْ وَفَى … فِعْلًا لِغَيْرِ طَلَبٍ مُصَرَّفَا 126. فَالأَحْسَنُ الفَصْلُ بِـ\"قَدْ\" أَوْ نَفْيٍ اوْ … تَنْفِيسٍ اوْ \"لَوْ\"، وَقَلِيلٌ ذِكْرُ \"لَوْ\" 127. وَخُفِّفَتْ \"كَأَنَّ\" فَاسْمُهَا خَفِي … وَأَثْبَتُوا (4) ، وَ\"عَلَّ\" لَمْ تُخَفَّفِ \" لا\" المُشَبَّهَةُ بِـ\"إِنَّ \" 128. كَـ\"إِنَّ\": \"لَا\" فِي النَّكِرَاِت، فَانْصِبِ … مُضَافًا اوْ شَبِيهَهُ، وَرَكِّبِ 129. فَرْدًا عَلَى الفَتْحِ، وَأَوْلِهِ الخَبَرْ … وَنَحْوُ \"لَا حَوْلَ وَلَا قُوَّةَ\" قَرّْ 130. فَتْحٌ وَرَفْعُ الثَّانِ، نَصْبَ ذَا امْنَعِ … إِنْ يُرْفَعِ الأَوَّلُ، وَانْصِبْ وَارْفَعِ 131. وَافْتَحْ مُرِيدًا نَعْتَ مَبْنِيٍّ وَلِي … وَالفَتْحَ دَعْهُ إِنْ تُضِفْ أَوْ تَفْصِلِ",
    "foot_note": "1. ألفها للإطلاق. \n2. هي \"أَنَّ\" والألف للإطلاق. \n3. للفرق بين إِن المخففة من إنَّ وبينها إذا كانت نافية، فيجب وصل اللام في خبر المخففة، وقد تحذف اللام إذا كانت قرينة، كقول الشاعر: أنا ابن أباة الضيم من آل مالك وإن مالك كانت كرام المعادن انظر: شرح التسهيل 2\\ 34 وشواهد التوضيح والتصحيح 105 والدر المصون 8\\ 521. \n4. وعلى هذا البيت: ويومًا توافينا بوجه مقسم كأن ظبية تعطو إلى وارق السم في رواية رفع ظبية يكون اسمها ضمير شأن محذوف، وفي رواية نصب ظبية تكون اسمها. انظر: الكتاب 2\\ 134 والأصمعيات 157 والكامل 1\\ 71 - 72 والأصول 1\\ 245 والأضداد 107 والزاهر 1\\ 155 وحروف المعاني والصفات 29.",
    "book_id": "105",
    "new_page_number": 42
  },
  {
    "serial_number": "6606262",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 47,
    "volume_number": 1,
    "text": "132. كَالعَطْفِ مِنْ غَيْرِ تَكَرُّرٍ لِـ\"لَا\" … وَ\"لَا\" مَعَ الهَمْزَةِ كَالذِي خَلَا (1) 133. وَلِدَلِيلٍ شَاعَ حَذْفُ الخَبَرِ … وَمَنْ يُجِزْهُ مطْلَقًا لَا تَنْصُرِ (2) \" ظَنَّ\" وَأَخَوَاتُهَا 134. تَنْصِبُ \"ظَنَّ\" خَبَرًا وَمُبْتَدَا … رَأَى، عَلِمْتُ، خَالَ، عَدَّ، وَجَدَا 135. جَحَا وَهَبْ، تَعَّلَمَ، احْسَبْ وَدَرَى … زَعَمْتُ وَاجْعَلْ وَالتِي كَـ\"صَيَّرَا\" 136. وَهَبْ، تَعَلَّمْ: جَامِدَانِ، وَاجْعَلَا … لِغَيْرِ مَاضٍ مَا لَهُ، وَمَا خَلَا 137. ذَيْنِ فَأَلْغِ جَائِزًا لَا فِي ابْتِدَا … وَأَوِّلَنْ، وَقَبْلَ لَامِ الِابْتِدَا 138. يَلْزَمُ تَعْلِيقٌ وَلَامُ القَسَمِ … وَنَفْيُ \"مَا\" وَ\"إِنْ\" وَ\"لَا\" (3) المُسْتَفْهِمِ (4) 139. لِوَاحِدٍ \"ظُنَّ\" اتَّهِمْ كَعِلْمِ … عُرْفٍ، وَلِاثْنَيْنِ \"رَأَى\" فِي الحُلْمِ (5) 140. وَحَذْفُ مَفْعُولٍ أَوِ اثْنَيْنِ بِلَا … قَرِينَةٍ حَظْرٌ، وَكَالظَّنِّ اجْعَلَا 141. \"تَقُولُ\" تَالِيًا لِلِاسْتِفْهَامِ أَوْ … فَافْصِلْ بِمَعْمُولٍ وَباِلظَّرْفِ رَأَوْا \" أَعْلَمَ\" وَأَخَواتُهَا 142. اِنْصِبْ بِـ\"أَعْلَمَ\" ثَلَاثًا وَ\"أَرَى\" … أَخْبَرَ، نَبَّا (6) ، حَدَّثَ، انْبَا (7) ، خَبَّرَا 143. لِلثَّانِ وَالثَّالِثِ مِنْ ذِي مَا انْتَمَى … لِاثْنَيْ \"عَلِمْتُ\" وَ\"رَأَى\" وَ\"عَلِمَا\" 144. ذَا وَاحِدٍ بِالهَمْزِ لِاثْنَيْنِ وَصَلْ … ثَانِيهِمَا كَالثَّانِ مِنْ \"كَسَا\" حَصَلْ",
    "foot_note": "1. يعني أن حكم \"ألا\" مركبة من همزة الاستفهام ولا النافية للجنس كحكم لا النافية للجنس مفردة. \n2. يقصد به الإمام الزمخشري حيث أجاز ذلك في المفصل. انظر: المفصل 52 والبهجة المرضية 181. \n3. \"لا\" النافية. \n4. يقصد الاستفهام. \n5. في المخطوط \"الحكم\"، والتصويب من الفريدة 22 والمطالع السعيدة 1\\ 336. \n6. مخفف من نبّأَ. \n7. يقصد أنبأ.",
    "book_id": "105",
    "new_page_number": 43
  },
  {
    "serial_number": "6606263",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 48,
    "volume_number": 1,
    "text": "الفَاعِلُ 145. الفَاعِلُ الذِي كَمَرْفُوعَيْ: \"خَطَبْ … زَيْدٌ بَلِيغًا وَعْظُهُ\" (1) ، وَقَدْ وَجَبْ 146. مِنْ بَعْدِ فِعْلٍ ظَاهِرًا وُمُسْتَتِرْ (2) … وَالفِعْلُ إِنْ يُسْنَدْ لِغَيْرِ المُسْتَتِرْ 147. مِنْ عَلَمِ اثْنَيْنِ وَجَمْعٍ جُرِّدَا … وَيَرْفَعُ الفَاعِلَ فِعْلٌ مَا (3) بَدَا 148. وَالتَّا الْزِمَنْ بِالمَاضِ مُسْنَدًا إِلَى … ذَاتِ حِرٍ (4) أَوْ مُضْمَرٌ لَهَا تَلَا 149. وَالتَّرْكُ أَوْلَى إِنْ بِـ\"إِلَّا\" ذَا انْفَصَلْ … فِي غَيْرِهَا وَمُضْمَرُ المَجَازِ قَلّْ 150. وَجْهَانِ فِي ظَاهِرِ ذِي المَجَازِ قَرّْ … \"نِعْمَ\" وَجَمْعِ غَيْرِ سَالِمِ الذَّكَرْ 151. وَالأَصْلُ وَصْلُ فَاعِلٍ وَفَصْلُ … مَفْعُولِهِ، وَقَدْ يَجِيءُ الوَصْلُ 152. أَوْ يَسْبِقُ الفِعْلَ، وَتَأْخِيرٌ حُتِمْ … لِلَّبْسِ أَوْ أُضْمِرَ فَاعِلٌ وَلَمْ 153. يُحْصَرْ، وَذَا الحَصْرِ بِـ\"إِلَّا\" أَخِّرَا … أَوْ \"إِنَّمَا\"، وَقَدِّمَنْ إِنْ يَظْهَرَا 154. وَشَاعَ نَحْوُ \"خَافَ رَبَّهُ عُمَرْ\" … وَشَذَّ نَحْوُ \"زَانَ نَوْرُهُ الشَّجَرْ\" (5)  النَّائِبُ عَنِ الفَاعِلِ 155. عَنْ فَاعِلٍ فِي مَا لَهُ المَفْعُولَ (6) بِهْ … أَقِمْ، وَضُمَّ بَدْءَ فِعْلٍ كَـ\"نُبِهْ\" 156. وَقَبْلَ الَاخِرِ اكْسِرَنْ فِي مَا مَضَى … وَافْتَحْهُ فِي مُضَارِعٍ كَـ\"يُرْتَضَى\" 157. وَالثَّانِيَ التَّالِيَ تَا المُطَاوَعَهْ … وَثَالِثَ الوَصْلِ اضْمُمَنْ مُتَابِعَهْ 158. وَاكْسِرْ أَوَ اشْمِمْ فَاءَ ذِي عَيْنٍ أُعِلّْ … أَوْ ضُمَّ، وَالمُلْبِسُ مِنْ هَذَا حُظِلْ",
    "foot_note": "1. المرفوعان زيد ووعظ. \n2. يعني وجب وجود فاعل بعد الفعل سواء كان الفاعل ظاهرًا أم مستترًا. \n3. \"ما\" هنا ظرفية مصدرية. \n4. أي ذات فرج. \n5. ليس ممتنعًا عند ابن جني. انظر: الخصاص 1\\ 294 وشرح الكافية الشافية 2\\ 585. \n6. مفعول به للفعل \"أقم\" بعده.",
    "book_id": "105",
    "new_page_number": 44
  },
  {
    "serial_number": "6606264",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 49,
    "volume_number": 1,
    "text": "159. وَمِثْلُ ذَا \"حَبَّ\" وَمَا لِذِي الفَا … لِقَبْلِ عَيْنِ \"اخْتَارَ\" وَ\"انْقَدْ\" يُلْفَى 160. وَقَابِلًا مِنْ ظَرْفٍ اوْ شِبْهٍ أَقِمْ … أَوْ مَصْدَرٍ هَذَا إِذَا ذَاكَ (1) عُدِمْ 161. وَقَدْ يَنُوبُ الثَّانِ مِنْ بَابِ \"كَسَا\" … وَ\"ظَنَّ\"، \"أَعْلَمَ\" إِذَا مَا (2) الْتَبَسَا  الاشْتِغَالُ 162. إِنْ شَغَلَ المُضْمَرُ لِاسْمٍ سَابِقِ … فِعْلًا عَنِ الإِسْمِ فَبِالمُوَافِقِ 163. مُسْتَتِرًا يُنْصَبُ ذَاكَ الِاسْمُ … أَوِ ارْفَعَنْ، وَالنَّصْبُ فِيهِ حَتْمُ 164. إِنْ يَتْلُ مَا يَخْتَصُّ بِالفِعْلِ، وَمَا … بِالِابْتِدَا يَخْتَصُّ رَفْعَهُ الْزَمَا 165. كَقَبْلِ ذِي الصَّدْرِ، وَإِنْ ذَا سَبَقَا … ذَا طَلَبٍ فَالنَّصْبُ فِيهِ يُنْتَقَى 166. كَتَالِ مَا إِيلَاؤُهُ الفِعْلَ عَلَا (3) … وَتَالِ عَاطِفٍ بِلا فَصْلٍ عَلَى 167. فِعْلِيَّةٍ، فَإِن تَلَا فِعْلًا خَبَرْ … عَنْ مُبْتَدًا فَالِاسْتِوَا قَدِ اسْتَقَرّْ 168. فِي غَيْرِ ذَا رُجِّحَ رَفْعٌ، وَاسْتَقَرّْ … كَالوَصْلِ مَفْصُولٌ بِمَا يَعْمَلُ جَرّْ 169. وَعَامِلُ الوَصْفِ بِغَيْرِ مَانِعِ … كَالفِعْلِ، وَاشْغَلْ مُضْمَرًا بِتَابِعِ  تَعَدِّي الفِعْلِ وَلُزُومُهُ 170. مَا هَا (4) سِوَى المَصْدَرِ فِيهِ خَاتِمُ … هُوَ المُعَدَّى، وَسِوَاهُ اللَّازِمُ 171. نَحْوُ السَّجَايَا (5) وَ\"افْعَلَلَّ\"، \"اقْعَنْسَسَا\" … وَمَا اقْتَضَى نَظَافَةً أَوْ دَنَسَا 172. أَوْ طَاوَعَ الوَاحِدَ، وَاللَّازِمَ عَدّْ … بِحَرْفِ جَرٍّ، وَإِذَا الحَذْفُ وَرَدْ 173. فَانْصِبْ أَوُ اجْرُرْ بِسَمَاعٍ، وَقِسِ … مَعْ \"أَنْ\" وَمَعْ \"أَنَّ\" إِذَا لَمْ يُلْبِسِ 174. وَالأَصْلُ سَبْقُ فَاعِلٍ مَعْنًى، وَقَدْ … يَلْزَمُ أَوْ يُمْنَعُ حَتْمًا، وَوَرَدْ 175. حَذْفٌ لِفَضْلَةٍ بِهَذِي لَمْ يَجِبْ … أَوْ تَنْحَصِرْ، وَالنَّاصِبَ احْذِفْ (6) ، وَوَجَبْ (7)",
    "foot_note": "1. إشارة إلى المفعول به. \n2. \"ما\" هنا نافية لا مزيدة. \n3. أي غلب. \n4. يقصد هاء. \n5. يقصد أفعال السجايا. \n6. إذا عُلم. \n7. يعني في بعض المواضع وجب حذف العامل في المفعول به.",
    "book_id": "105",
    "new_page_number": 45
  },
  {
    "serial_number": "6606265",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 50,
    "volume_number": 1,
    "text": "التَّنَازُعُ فِي العَمَلِ 176. إِنْ طَلَبَ اثْنَانِ سُمًا وَمَا سَبَقْ (1) … فَوَاحِدٌ يَعْمَلُ وَالثَّانِي أَحَقّْ 177. وَالكُوفَةُ الأَوَّلُ (2) ، لَا التَّعَجُّبُ … فَعَمَلَ الثَّانِي المُجِيزُ يُوجِبُ 178. وَيَعْمَلُ المُهْمَلُ فِي ضَمِيرِ ذِي … تَنَازُعٍ لَا غَيْرَ رَفْعٍ فَخُذِ 179. لِفَضْلَةٍ حَذْفًا وَأَخِّرِ العُمَدْ … وَعَمَّ قَوْلِي مَا عَلَى الأَصْلِ وَرَدْ (3) 180. وَالمُضْمَرُ المُخْبِرُ عَنْ غَيْرِ الذِي … طَابَقَ مَا فَسَّر أَظْهِرْ وَانْبِذِ  المَفْعُولُ المُطْلَقُ 181. المَصْدَرُ اسْمُ حَدَثٍ، بِمِثْلِهِ … مُنْتَصِبٌ أَوْ وَصْفِهِ أَوْ فِعْلِهِ 182. وَذَانِ فَرْعَاهُ (4) ، وَنَوْعًا أَوْ عَدَدْ … يَجِيءُ أَوْ مُؤَكِّدًا، وَعَنْهُ سَدّْ",
    "foot_note": "1. يعني أن الاسم لم يسق العاملين بل تأخر عنهما. \n2. انظر: معاني القرآن للفراء 1\\ 19 والإنصاف 1\\ 71. \n3. يعني بالأصل الألفية، ويقصد أنه أصلح ما استدركه ابن الناظم على والده في قوله: بل حذفه الزم إن يكن غير خبر وأخرنه إن يكن هو الخبر قال ابن الناظم: \"ولو قال بدله: واحذفه إن لم يك مفعول حسب وإن يكن ذاك فأخره تصب واستدرك المرادي على ابن الناظم فقال: \"ولو قال: بل حذفه إن كان فضلة حتم وغيرها تأخيره قد التُزم لأجاد. ثم استدرك الإمام الغزي على بيت المرادي فقال: بَلْ ذِكْرُ عُمْدَةٍ وَمُوهِمٍ يَجِبْ مُؤَخَّراً وَغَيْرَهُ احْذِفْهُ تُصِبْ فالكمال لله سبحانه. انظر: ألفية ابن مالك ص 106 البيت 283، شرح ابن الناظم 188، وشرح المرادي 2\\ 642، وشرح الغزي البيت 3341. \n4. يعني أن الفعل والوصف فرعان عن المصدر الذي هو الأصل، وهذا مذهب أكثر البصريين. انظر: الإنصاف 1\\ 190 والمقاصد الشافية 3\\ 222.",
    "book_id": "105",
    "new_page_number": 46
  },
  {
    "serial_number": "6606266",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 51,
    "volume_number": 1,
    "text": "183. \"كُلٌّ\"، وَمَا عَلَيْهِ دَلَّ، وَانْفَرَدْ … مُؤَكِّدٌ، وَحَذْفُ مُقْتَضِيهِ رَدّْ (1) 184. لَا غَيْرِهِ، وَهْوَ مَعَ اتٍ بَدَلَا … مِنْ فِعْلِهِ حَتْمٌ وَمَا قَدْ فَصَّلَا 185. وَنَائِبُ الفِعْلِ الذِي جَاءَ خَبَرْ … عَنِ اسْمِ عَيْنٍ كَرَّرُوا أَوِ انْحَصَرْ 186. وَمَا لِنَفْسٍ أَوْ لِغيْرٍ أَكَّدَا … وَتَالِ جُمْلَةٍ مُشَبِّهًا بَدَا  المَفْعُولُ لَهُ 187. المَصْدَرُ المُعَلِّلُ المُتَّحِدُ … وَقْتًا وَفَاعِلًا كَـ\"خَوْفًا أَجْهَدُ\" 188. يُنْصَبُ مَفْعُولًا لَهُ، وَالحَرْفُ جَرّْ … لِفَقْدِ بَعْضِ ذِي (2) ، وَلَوْ تُوجَدُ قَرّْ (3) 189. وَقَلَّ فِي مُجَرَّدٍ، وَشَاعَ فِي … ذِي \"أَلْ\"، وَالِاسْتِوَا اعْتَقِدْ إِنْ تُضِفِ  المَفْعُولُ فِيهِ وَهُوَ المُسَمَّى ظَرْفًا 190. الظَّرْفُ وَقْتٌ أَوْ مَكَانٌ ضُمِّنَا … \"فِي\" بِاطِّرَادٍ، وَانْصِبَنَّ الأَزْمُنَا 191. بِنَاصِبِ المَصْدَرِ مُطْلَقًا وَلَوْ … مُقَدَّرًا، وَفِي مَكَانٍ قَدْ أَبَوْا 192. إِلَّا الذِي أُبْهِمْ وَالمُشْتَقَّا … وَقِسْهُ إِنْ كَانَ لِفِعْلٍ وَفْقَا (4) 193. وَذُو التَّصَرُّفِ الذِي ظَرْفًا يَرِدْ … وَغَيْرَهُ، وَمَا بِظَرْفٍ يَنْفَرِدْ 194. فَغَيْرُ ذِي تَصَرُّفٍ، وَفِي المَكَانْ … يَنُوبُ مَصْدَرٌ، وَشَاعَ فِي الزَّمَانْ  المَفْعُولُ مَعَهُ 195. يُنْصَبُ تَالِي الوَاوِ مَفْعُولًا مَعَهْ … بِسَابِقِ الفِعْلِ وَشِبْهٍ فِي السَّعَهْ 196. وَنَحْوُ \"مَا أَنْتَ وَزَيْدًا؟ \" أَضْمِرِ … كَوْنًا، وَإِذْ يُمْكِنُ عَطْفٌ اخْتَرِ",
    "foot_note": "1. يعني أن حذف عامله مردود. \n2. الشروط. \n3. أي مع وجود الشروط قد يوجد حرف الجر. \n4. يعني موافقًا للفعل في مادته.",
    "book_id": "105",
    "new_page_number": 47
  },
  {
    "serial_number": "6606267",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 52,
    "volume_number": 1,
    "text": "197. وَإِنْ يُضَعَّفْ رَجِّحِ النَّصْبَ، وَإِنْ … يُمْنَعْ فَالِانْحِتَامُ لِلنَّصْبِ زُكِنْ (1) 198. قَالَ كَـ\"مَا لَكَ وَزَيْدًا؟ \" فَانْظُرِ (2) … وَالنَّصْبُ إِنْ لَمْ يُمْكِنَا بِمُضْمَرِ  الاسْتِثْنَاءُ 199. مَا اسْتَثْنَتِ \"الَّا\" مُوجَبًا تَمَّ (3) بِهَا … فَانْصِبْ، وَتَالٍ نَفْيًا اوْ مَا أَشْبَهَا 200. مُتَّصِلًا يُتْبَعُ لَا إِنْ يَسْبِقِ … وَلَا إِذَا يُقْطَعُ، هذَا مَا (4) انْتُقِي 201. وَأَلْغِ \"إِلَّا\" إِنْ تُفَرِّغْ قَبْلَهَا … لِتِلْوِهَا، وَإِنْ تُرَكِّبْ مِثْلَهَا 202. وَإِنْ تُكَرَّرْ لَا لِتَوْكِيدٍ فَإِنْ … فَرَّغْتَ أَوْ أَخَّرْتَ فَانْصِبْهَا تَهِنْ 203. لَا وَاحِدًا، فَاجْعَلْ لَهَا الذِي اقْتُضِي … وَنَصْبُ كُلِّهَا مُقَدَّمًا رُضِي 204. وَاسْتَثْنِ مَجْرُورًا بِـ\"غَيْرٍ\" وَ\"سِوَى\" … أَعْرِبْ كَمُسْتَثْنًى بِـ\"إِلَّا\" وَ\"سُوَى\" (5) 205. بِـ\"لَا يَكُونُ\"، \"لَيْسَ\": نَصْبٌ حُتِمَا … كَذَا \"خَلَا\" \"عَدَا\"، أَوُ اجْرُرْ بِهِمَا (6) 206. وَبَعْدَ \"مَا\" انْصِبْ، وَانْجِرَارٌ نَزُرَا … وَذَانِ فِعْلَانِ إِذَا لَمْ يَجْرُرَا 207. وَكَـ\"خَلَا\": حَاشَا، حَشَا، حَاشَ، وَ\"مَا\" … لَا تَصْحَبَنْ، وَأَوِّلَنَّ مُوهِمَا  الحَالُ 208. الحَالُ وَصْفٌ فَضْلَةٌ مُفْهِمُ فِي … حَالٍ، وَالِاشْتِقَاقُ ذُو تَأَلُّفِ 209. كَالِانْتِقَالِ، وَالجُمُودُ قَدْ وَرَدْ … فِي سِعْرٍ (7) اوْ مُؤَوَّلٍ (8) ، وَيُعْتَقَدْ",
    "foot_note": "1. أي عُلم. \n2. بعُسر ظهرت القراءة من المخطوط، وفي بعض كلمات هذا الشطر قد كتبنا أقرب قراءة. \n3. أي تامّ. \n4. موصولة. \n5. إحدى لغات \"سِوى\". \n6. يكونان حينها حرفي جر. \n7. كـ\"بعته مُدًّا بكذا\". \n8. كقولك: \"كرّ زيد أسدًا\".",
    "book_id": "105",
    "new_page_number": 48
  },
  {
    "serial_number": "6606268",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 53,
    "volume_number": 1,
    "text": "210. تَنْكِيرُ حَالٍ لَفْظُهُ مَا نُكِّرَا … وَجَا كَثِيرًا مَصْدَرًا مُنَكَّرَا 211. وَلَمْ يُنَكَّرْ غَالِبًا ذُو الحَالِ إِنْ … لَمْ تُلْفِ مَا فِي الِابْتِدَاءِ قَدْ زُكِنْ 212. وَسَبْقُهَا مَجْرُورَ حَرْفٍ ذُو خِلَافْ (1) … وَلَمْ يَجِئْ مِنَ الذِي لَهُ يُضَافْ 213. سِوَى الذِي يَعْمَلُ أَوْ جُزْءِ اللَّذَا … لَهُ أُضِيفَ أَوْ كَمِثْلِ جُزْءِ ذَا 214. وَقُدِّمَتْ مَنْصُوبَةً بِالفِعْلِ أَوْ … وَصْفٍ مُصَرَّفٍ، وَسَبْقَهَا أَبَوْا 215. عَامِلَهَا اللَّذْ فِيهِ مَعْنَى الفِعْلِ قَرّْ … لَا حَرْفُهُ كَـ\"تِلْكَ\"، \"لَيْتَ\"، وَنَدَرْ 216. نَحْوُ \"سَعِيدٌ مُسْتَقِرًّا فِي حَلَبْ\" … لَا \"ذَاكَ بُسْرًا أَطْيَبُ مِنْهُ رُطَبْ\" (2) 217. وَعَدِّدِ الحَالَ لِفَرْدِ أَوْ عَدَدْ … وَهْوَ لِتَأْكِيدٍ لِعَامِلٍ وَرَدْ 218. وَجُمْلَةً أَكَّدَهَا فَأُخِّرَا … وَعَامِلٌ عَلَى الأَصَحِّ أُضْمِرَا 219. وَجِئْ بِهِ ظَرْفًا وَجُمْلَةً حَوَتْ … مُضْمَرًا انْ صَدْرٌ مُضَارِعًا ثَبَتْ 220. كَنَفْيِهِ بِـ\"مَا\" وَ\"لَا\" وَتُحْرَمُ … وَاوٌ وَمُبْتَدَا انْوِ فِي مَا يُوهِمُ 221. كَالمَاضِ قَبْلَ \"أوْ\" أَوِ \"الَّا\" قد وَلِي … وَغَيْرَ ذِي الجُمْلَةِ بِالوَاوِ صِلِ 222. أَوْ مُضْمَرٍ وَبِهِمَا وَيُحْذَفُ … عَامِلُ حَالٍ، وَوُجُوبًا يُؤْلَفُ",
    "foot_note": "1. أجازه ابن مالك تبعًا لابن كسيان وابن برهان وأبي علي الفارسي وابن جني. انظر: إيضاح الشعر لأبي علي 1\\ 481 وشرح العمدة 1\\ 429 وشرح التسهيل 2\\ 337 وهمع الهوامع 2\\ 306. \n2. هذه من أشهر المقولات التي تعج بها كتب النحو، وقد أفرد السيوطي هذه المسألة في رسالة مفردة سمّاها \"تحفة النُّجَبا في قولهم: هذا بسرًا أطيب منه رُطَبًا\" وقد ضمنها كتابه العظيم الأشباه والنظائر، وكذلك فعل ابن طولون في كتابه \"المسائل الملقبات في علم النحو\" حيث أطلق عليها \"اسم المسألة البسرية\". انظر: الأشباه والنظائر 4\\ 652 والمسائل الملقبات 61 وشرح الرضي على الكافية 2\\ 34.",
    "book_id": "105",
    "new_page_number": 49
  },
  {
    "serial_number": "6606269",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 54,
    "volume_number": 1,
    "text": "التَّمْيِيزُ 223. اسْمٌ بِمَعْنَى \"مِنْ\" مُبِينٌ نَكِرَهْ … يُنْصَبُ تَمْيِيزًا بِمَا قَدْ فَسَّرَهْ 224. مِنْ عَدَدٍ وَكَيْلٍ اوْ وَزْنٍ وَذِي (1) … مَسَاحَةٍ وَكُلِّ مَا يُشْبِهُ ذِي (2) 225. وَبَعْدَ غَيْرِ العَدَدِ اجْرُرْ إِنْ تُضِفْ … وَالنَّصْبُ بَعْدَ مَا أُضِيفَ قَدْ عُرِفْ 226. إِنْ كَانَ لَا يُغْنِي عَنِ المُضَافِ لَهُ … كَالفَاعِلِ المَعْنَى بِالِاسْمِ فَضَّلَهْ 227. وَبَعْدَ ذِي تَعَجُّبٍ فَمَيِّزَا … وَجَرُّ \"مِنْ\" (3) ذَا عَدَدٍ (4) مَا (5) جُوِّزَا 228. كَفَاعِلٍ حُوِّلَ عَنْ فَاعِلٍ اوْ … مَفْعُولٍ اوْ مُضَافِ (6) وَالغَيْرَ رَأَوْا 229. وَعَامِلُ التَّمْيِيزِ حَتْمًا سَبَقَا … وَسَبْقَهُ المُصَرَّفَ (7) الشَّيْخُ (8) انْتَقَى  حُرُوفُ الجَرِّ 230. هَاكَ حُرُوفَ الجَرِّ، \"مِنْ\" بِهَا ابْتَدِ … بَعِّضْ وَبَيِّنْ وَبِنَفْيٍ فَزِدِ 231. وَشِبْهِهِ فِي مُنْكَرٍ (9) وَبَدَلَا … تُفْهِمُ كَالبَا، وَلِلِانْتِهَا \"إِلَى\" 232. \"حَتَى\" وَلَامٌ، وَلِمِلْكٍ ذِي (10) تَلِي … وَشِبْهِهِ، وَزِدْ وَعَدِّ، عَلِّلِ",
    "foot_note": "1. بمعنى صاحب. \n2. إشارية. \n3. \"مِن\" في المعنى فاعل. \n4. \"ذا\" مفعول بع للمصدر \"جر\". \n5. \"ما\" هنا حرف نفي. \n6. حذف التنوين من \"مضاف\" ضرورة، وهو مثل \"بشاشةَ\" من قوله: تَغَيَّرَ كُلُّ ذِي طَعْمٍ وَلَوْنٍ وَقَلَّ بَشَاشَةَ الوَجْهُ المَلِيحُ انظر: الإنصاف 2\\ 545 وهمع الهوامع 3\\ 276. \n7. يعني أن يسبق التمييز عاملُه الفعل المصرف. \n8. أي ابن مالك. انظر: الألفية ص 115 البيت 363. \n9. يقصد المُنَكّر. \n10. أي اللام.",
    "book_id": "105",
    "new_page_number": 50
  },
  {
    "serial_number": "6606270",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 55,
    "volume_number": 1,
    "text": "233. بِـ\"فِي\" وَبًا ظَرْفِيَّةً وَسَبَبَا … خَذُ، وَكَـ\"مَع\" وَ\"مِنْ\" وَ\"عَنْ\" تَجِيءُ بَا 234. وَعَدِّ، عَوِّضْ، أَلْصِقِ، اسْتَعِنْ بِذِي … بِـ\"عَنْ\" تَجَاوُزًا \"عَلَى\" (1) ، \"بَعْدَ\" (2) خُذِ 235. \"عَلَى\" لِلِاسْتِعْلَا وَمَعْنَى \"عَنْ\" وَ\"فِي\" … وَالكَافَ شَبِّهْ، زِدْ وَعَلِّلْ تَقْتَفِ 236. وَقَدْ تَجِي اسْمًا كَـ\"عَلَى\" وَ\"عَنْ\"، وَجَرّْ … هَذِي بِحَرْفٍ وَمُضَافٍ اسْتَقَرّْ 237. وَ\"مُذْ\" وَ\"مُنْذُ\"، وَلِوَقْتٍ ذَانِ جَرّْ … كَـ\"مِنْ\" بِمَاضٍ، وَكَـ\"فِي\" فِيمَا حَضَرْ 238. وَاسْمَانِ إِنْ يَلِيهِمَا الجُمْلَةُ أَوْ … رَفْعٌ، وَجَرَّ غَيْرِ مُظْهَرٍ أَبَوْا 239. كَالكَافِ: حَتَّى، الوَاوُ، رُبَّ، التَّا. وَرُبّْ … خَصَّ مُنَكَّرًا وَتَاللهِ وَرَبّْ 240. وَزَيْدُ \"ما\" فِي \"مِن\" وَ\"عَنْ\" لَيْسَ يَكُفّْ … وَبًا، وَفِي الغَالِبِ \"رُبَّ\" الكَّافُ كُفّْ 241. وَأُضْمِرَتْ \"رُبَّ\" فَجَرَّتْ بَعْدَ \"بَلْ\" … وَالوَاوِ، فًا، بِغَيْرِ \"رُبَّ\" ذَاكَ قَلّْ  الإِضَافَةُ 242. تَنْوِينًا او نُونًا لِلِاعْرَابِ احْذِفِ … مِمَّا تُضِفْ، وَالثَّانِيَ اجْرُرْ وَانْوِ \"فِي\" 243. أَوْ لَامًا اوْ \"مِنْ\"، وَاخْصُصِ الأَوَّلَ أَوْ … عَرِّفْ بِثَانِ النُّكْرَ مُطْلَقًا قَفَوْا 244. فِي الأَوَّلِ المُشْبِهِ \"يَفْعَلُ\" الصِّفَهْ … وَسَمِّ ذِي لَفْظِيَّةً مُخَفِّفَهْ (3) 245. وَتِلْكَ مَعْنَوِيَّةٌ وَمَحْضَهْ (4) … وَوَصْلُ \"أَلْ\" بِذَا المُضَافِ نَرْضَهْ",
    "foot_note": "1. يقصد أنها تأتي بمعنى \"على\"، كقول الشاعر: لاه ابن عمك لا أفضلت في حسب عني ولا أنت دياني فتخزوني انظر: حروف المعاني والصفات للزجاجي 79، وإيضاح الشعر لأبي علي الفارسي 1\\ 41، وأمالي ابن الشجري 2\\ 195، وشرح التسهيل 3\\ 159. \n2. يقصد أنها تأتي بمعنى \"بعد\"، كقوله تعالى: \"لتركبن طبقًا عن طبق\". انظر: معاني القرآن للفراء 3\\ 251، والتبيان للعكبري 2\\ 1279، وتوجيه اللمع 529، وشرح الكافية الشافية 2\\ 809، والتذييل والتكميل 11\\ 225. \n3. وهي التي فيها المضاف وصف يشبه \"يفعل\". انظر: شرح ابن الناظم 275 وشرح المرادي 2\\ 786. \n4. الإشارة إلى القسم الأول الذي تكون الإضافة في على معنى حرف الجر. انظر: شرح ابن عقيل 3\\ 45 والمقاصد الشافية 4\\ 35.",
    "book_id": "105",
    "new_page_number": 51
  },
  {
    "serial_number": "6606271",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 56,
    "volume_number": 1,
    "text": "246. إِنْ كَانَ جَمْعًا أَوْ مُثَنًّى أَوْ وُصِلْ … بِالثَّانِ أَوْ مَاذا بِهِ الجَرَّ عَمِلْ 247. تَذْكِيرًا اكْسِبْ أَوَّلًا إِنْ لَوْ فُقِدْ … لَمْ يَنْخَرِمْ (1) ، وَلَا تُضِفْ لِلمُتَّحِدْ 248. مَعْنًى (2) ، وَأَوِّلْ (3) ، وَأُضِيفَ أَبَدَا … أَسْمًا (4) ، وَبَعْضُهَا بِلَفْظٍ أُفْرِدَا 249. وَبَعْضَهْا امْنَعْ أَنْ يُضَفْ لِمُظْهَرِ … كَـ\"وَحْدَ\"، \"لَبَّى\" وَ\"دَوَالَيْ\" وَحَرِي 250. وَأَلْزِمِ الجُمْلَةَ \"حَيْثُ\" وَ\"إِذِ\" … وَإِنْ تُنَوَّنْ أُفْرِدَتْ، وَمَا كَذِي 251. مَعْنًى كَذِي أَضِفْ وَذَا ابْنِ وَاعْرِبِ … وَقَبْلَ فِعْلٍ بُنِيَ البِنَا اجْتُبِي 252. وَقَبْلَ مُعْرَبٍ وَمُبْتَدًا شَذَا (5) … إِعْرَابُهُ، وَأُلْزِمَ الفِعْلَ \"إِذَا\" 253. لِاثْنَيْنِ عُرْفًا لَمْ يُفَرَّقَا: \"كِلَا\" … \"كِلْتَا\"، وَلِلفَرْدِ مُعَرَّفًا فَلَا 254. \"أَيًّا\" تُضِفْ (6) مَا لَمْ تُكَرَّرْ أَوْ قُصِدْ … أَجْزًا وَلِلمَوْصِولِ عُرْفًا اعْتَقِدْ 255. وَالحَالُ وَالوَصْفُ لِنُكْرٍ قَطُّ … وَأُطْلِقَ اسْتِفْهَامُهَا وَالشَّرْطُ 256. وَجُرَّ تَالِي \"لَدْ\" وَ\"مَعْ\" فَقلِّلِ … وَافْتَحْ أَوِ اكْسِرْ لِسُكُونٍ قَدْ وَلِي 257. وَ\"غَيْرًا\" اضْمُمْ لَازِمًا بِنَاهُ … إِنْ لَمْ تُضِفْهُ نَاوِيًا مَعْنَاهُ 258. كَـ: قَبْلُ، حَسْبُ، أَوَّلُ، دُونَ، وَرَا … عَلُ، وَإِنْ نَكَّرْتَ فَانْصِبْ (7) وَاجْرُرَا",
    "foot_note": "1. في المخطوط \"لم ينجزم\"، ولعل الصواب ما أثبتناه. \n2. لأن الشيء لا يضاف إلى نفسه. انظر: المقتضب 3\\ 241 وشرح السيرافي 1\\ 445 والتعليقة للفارسي 1\\ 142. \n3. يعني أنك تؤول كل ما ظاهره أنه أضيف إلى نفسه. \n4. مقصور من \"أسماء\" ضرورة. \n5. أي \"شذَّ\"، وهذا مذهب البصريين، والكوفيون جوزوا بناءه وتبعهم ابن مالك، لذلك قال في الألفية: \"ومِن بنى فلن يُفنَّدا\". انظر: الألفية ص 119 البيت 402 والبهجة المرضية 320. \n6. لعلها \"أَضِفْ\". \n7. في المخطوط \"انصب\" بغير الفاء، وبدونها يختل الوزن.",
    "book_id": "105",
    "new_page_number": 52
  },
  {
    "serial_number": "6606272",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 57,
    "volume_number": 1,
    "text": "259. وَيُحْذَفُ المُضَافُ فَالتَّالِي لِذَا … تُخْلِفُ فِي الحُكْمِ أَوْ اجْرُرْهُ إِذَا 260. يُمَاثِلُ المَحْذُوفُ مَا بَعْدُ عُطِفْ … وَأَوَّلٌ يَبْقَى إِذَا الثَّانِي حُذِفْ 261. بِحَالِهِ بِشَرْطِ عَطْفٍ قَدْ وَلِي … أَضَفْتَهُ لِمِثْلِ تَالِي الأَوَّلِ 262. مَفْعُولٌ اوْ ظَرْفٌ أَجِزْ أَنْ يَفْصِلَا … عَامِلَهُ المُضَافَ عَنْ ثَانٍ تَلَا 263. كَذَا اليَمِينُ مَعَ \"إِمَّا\" مُغْتَفَرْ … وَالنَّعْتُ وَالنِّدَا وَالَاجْنَبِي نَدَرْ  المُضَافُ إِلَى يَاءِ المُتَكَلِّمِ 264. آخِرَ ذِي اليَا اكْسِرْ، وَقُلْ يُسْتَثْنَى … ذُو عِلَّةٍ وَالجَمْعُ وَالمُثَنَّى 265. فَاليَاءُ وَالوَاوُ بِذِي اليَاءِ ادُّغِمْ (1) … وَأَلِفٌ لَا فِي هُذَيْلٍ (2) قَدْ سَلِمْ 266. قُلْتُ (3) : وَالَاسْمَاءُ: أَبِي، أَخِي، هَنِي … فِيَّ، حَمِي، وَذِيَّ، لَمْ يُحَسَّنِ (4)  إِعْمَالُ المَصْدَرِ 267. كَفِعْلِهِ المَصْدَرُ إِنْ حَلَّ مَحَلّْ … فِعْلٍ وَ\"أَنْ\" أَوْ \"مَا\"، مُضَافَ اوْ مَعَ \"أَلْ\" 268. أَوْ لَا، وَلَيْسَ مُضْمَرًا، وَكَمِّلِ … رَفْعًا وَنَصْبًا بَعْدَ جَرِّ مَا وَلِي 269. وَيُتْبَعُ المَجْرُورُ لَفْظًا أَوْ مَحَلّْ (5) … وَلِاسْمِ مَصْدَرٍ أَيِ المِيمِي عَمَلْ",
    "foot_note": "1. \"ادَّغَمَ\" هذا مذهب البصريين، \"أَدْغَم\" هذا مذهب الكوفين. انظر: الكتاب 4\\ 431، وشرح المفصل 5\\ 512، وشرح الكافية الشافية 4\\ 2175، والتسهيل 320. \n2. انظر: معاني القرآن للزجاج 3\\ 354 واللامات 98 وإعراب القرآن للنحاس 1\\ 48 وشرح السيرافي 4\\ 162 والمسائل العسكريات 85. \n3. يعني به السيوطي نفسه. انظر: البهجة المرضية 337. \n4. أجازه الفراء. انظر: البهجة المرضية 337. \n5. يعني: يُتبع على لفظه فيُجرّ، أو يُتبع على محله فيُنصب أو يرفع.",
    "book_id": "105",
    "new_page_number": 53
  },
  {
    "serial_number": "6606273",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 58,
    "volume_number": 1,
    "text": "إِعْمَالُ اسْمِ الفَاعِلِ 270. كَفِعْلِهِ اسْمُ فَاعِلٍ إِنْ يُعْزَلِ … عَنِ المُضِيِّ وَلِنَفيٍ قَدْ وَلِي 271. أَوْ حَرْفِ الِاسْتِفْهَامِ أَوْ جَاءَ صِفَهْ … أَوْ مُسْنَدًا أَوْ نَعْتَ مَا قَد حَذَفَهْ 272. وَإِنْ يَكُنْ صِلَةَ \"أَلْ\" فَمُطْلَقَا … \"فَعَّالٌ\" اوْ \"مِفْعَالُ\" كَاللَّذْ سَبَقَا 273. كَذَا \"فَعُولٌ\" وَ\"فَعِيلٌ\" وَ\"فَعِلْ\" … وَمَا سِوى المُفْرَدِ مِثْلَهُ عَمِلْ 274. وَعَامِلٌ يَنْصِبُ أَوْ يَخْفِضُ مَا … تَلَا وَنَصْبُ مَا سِوَاهُ حُتِمَا 275. وَيُتْبَعُ المَجْرُورُ لَفْظًا أَوْ مَحَلّْ … وَلِاسْمِ مَفْعُولٍ كَمِثْلِهِ عَمَلْ 276. بِشَرْطِهِ وَحُكْمِهِ لَا اسْتِثْنَا … أَوْ فَأَضِفْ لِذِي ارْتِفَاعٍ مَعْنَى (1)  أَبْنِيَةُ المَصَادِرِ 277. \"فَعْلٌ\" لِذِي ثَلَاثَةٍ عُدِّي (2) ، \"فَعِلْ\" … كَـ\"فَرَحٍ\" لِلَازِمٍ عَلَى \"فَعَلْ\" 278. وَ\"فَعَلَ\" اللَّازِمُ ذُو \"فُعُولِ\" … مِثْلَ \"غَدَا\" (3) وَلَيْسَ ذَا شُمُولِ 279. بَلْ ذُو امْتِنَاعٍ فَلَهُ \"فِعَالُ\" (4) … وَالدَّاءُ وَالصَّوْتُ لَهُ \"فُعَالُ\" (5) 280. وَ\"فَعَلَانٌ\" فَهْوَ ذُو تَقَلُّبِ (6) … لِلسَّيْرِ وَالصَّوْتِ \"فَعِيلًا\" اجْتُبِي (7) 281. \"فُعُولَةٌ\"، \"فَعَالَةٌ\" لِـ\"فَعُلَا\" (8) … وَمَا لِذَا خَالَفَ خُذْ مَا نُقِلَا 282. وَغَيْرُ ذِي ثَلَاثَةٍ مَقِيسُ … مَصْدَرُهُ كَـ\"قُدِّسَ التَّقْدِيسُ\" 283. وَ\"زَكِّهِ تَزْكِيَةً\" وَ\"أَجْمِلَا … إِجْمَالَ مَنْ تَجَمُّلًا تَجَمَّلَا\" 284. وَ\"اسْتَعِذِ اسْتِعَاذَةً\" ثُمَّ \"أَقِمْ … إِقَامَةً\"، وَغَالِبًا ذَا التَّا لَزِمْ",
    "foot_note": "1. إذا يجوز إضافة اسم المفعول إلى مرفوعه، ولا يجوز إضافة اسم الفاعل إلى مرفوعه. \n2. كـ: ضَرَبَ ضَرْبًا. \n3. مصدره غُدُوٌّ. \n4. كـ: أَبَى إباءً. \n5. كـ: سَعَلَ سُعالًا. \n6. كـ: دارَ دَوَرانًا. \n7. كـ\" صَرَخَ ضُراخًا. \n8. كـ: سَهُلَ سُهُولة، وجَزُلَ جَزالةً.",
    "book_id": "105",
    "new_page_number": 54
  },
  {
    "serial_number": "6606274",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 59,
    "volume_number": 1,
    "text": "285. وَمُدَّ وَافْتَحْ تِلْوَ خَتْمٍ وَاكْسِرَا … ثَالِثَ ذِي الهَمْزَةِ تُلْفِ المَصْدَرَا 286. وَالرَّابِعَ اضْمُمَنْهُ فِي \"تَفَعْلَلَا\" … \"فِعْلَالُ\" (1) أَوْ \"فَعْلَلَةٌ\" لِـ\"فَعْلَلَا\" 287. وَ\"فَاعَلَ\": \"الفِعَالُ\" وَ\"المُفَاعَلَهْ\" … وَ\"فَعْلَةٌ\" لِمَرَّةٍ مُمَاثِلَهْ 288. وَ\"فِعْلَةٌ\" لِهَيْئَةٍ، وَغَيْرُ ذِي … ثَلَاثَةٍ بِالتَّا، وَهَيْئَةَ انْبُذِ (2)  أَبْنِيَةُ أَسْمَاءِ الفَاعِلِينَ وَالصِّفَاتِ المُشَبَّهَةِ بِهَا 289. كَـ\"فَاعِلِ\" اسْمُ فَاعِلِ الثُّلَاثِي … لِـ\"فَعِلِ\" الأَلْوَانِ وَالأَحْدَاثِ 290. فَـ\"أَفْعَلٌ\" وَ\"فَعَلَانٌ\" ذُو امْتِلَا (3) … وَمَا لِلَاعْرَاضِ فَصُغْهُ \"فَعِلَا\" (4) 291. وَلَا \"فَعُلْتُ\" فَلَهُ \"فَعِيلُ\" (5) … و\"الفَعْلَ\" (6) خُذْ وَ\"أفْعَلٌ\" (7) قَلِيلُ 292. وَ\"أَفْعَلٌ\" (8) ، وَغَيْرُ \"فَاعِلِ\" اتَّصَفْ … \"فَعَلَ\" مَفْتُوحًا بِهِ كَوَصْفِ \"عَفّْ\" (9) 293. وَغَيْرُ ذِي الثَّلَاثِ كَالمُضَارِعِ … مَعْ ضَمِّ أَوَّلٍ وَكَسْرِ رَابِعِ 294. وَإِنْ فَتَحْتَ فَاسْمُ مَفْعُولٍ، وَذُو … ثَلَاثَةٍ زِنَةَ مَفْعُولٍ خُذُوا 295. وَنَابَ نَقْلًا عَنْهُ \"فِعْلٌ\" (10) وَ\"فَعَلْ\" (11) … \"فَعِيلُ\" (12) فِي مَعْنَاهُمَا عَدَا العَمَلْ  الصِّفَةُ المُشَبَّهَةُ بِاسْمِ الفَاعِلِ 296. الصِّفَةُ المُشْبِهَةُ اسْمَ الفَاعِلِ … هِيَ التِي اسْتُحْسِنَ جَرُّ فَاعِلِ 297. مِنْ لَازِمٍ لِحَاضِرٍ، وَتَعْمَلُ … كَفَاعِلٍ، وَفِي الشُّرُوطِ تُجْعَلُ",
    "foot_note": "1. في المخطوط \"فعال\"، والتصويب من الألفية. انظر: ألفية ابن مالك ص 125 البيت 453. \n2. فإنها شاذة في غير الثلاثي. \n3. نحو أحمر وشبعان. \n4. نحو أَشِر. \n5. نحو جميل. \n6. نحو ضخم. \n7. نحو بطل. \n8. نحو أخطب. \n9. فهو عفيف. \n10. نحو ذِبْح. \n11. نحو قبض بمعنى مقبوض. \n12. نحو كحيل.",
    "book_id": "105",
    "new_page_number": 55
  },
  {
    "serial_number": "6606275",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 60,
    "volume_number": 1,
    "text": "298. وَمُضْمَرَ المَوْصُوفِ بِالمَعْمُولِ صِلْ … وَسَبْقُهُ لَهَا لِفَرْعِهَا (1) حُظِلْ 299. فَارْفَعْ وَجُرّْ وَانْصِبْ بِهَا مَعْ \"أَلْ\" وَلَا … ذَا \"أَلْ\" وَذَا إِضَافَةٍ وَمَا خَلَا 300. وَلَا تَجُرّْ مَع \"أَلْ\" سُمًا مِنْ \"أَلْ\" خَلَا … وَمِنْ إِضَافَةٍ لِمَا لَهَا تَلَا  التَّعَجُّبُ 301. \"أَفْعِلْ\" وَ\"مَا أَفْعَلَ\" خُذْ تَعَجُّبَا … وَتِلْوَ هَذَا (2) انْصِبْ، وَذَاكَ (3) اجْرُرْ بِبَا 302. وَحَذْفَهُ (4) أَجِزْ إِنِ المَعْنَى عُلِمْ … وَلِجُمُودِ الصِّيغَتَيْنِ فَالْتُزِمْ 303. وَالصَّوْغُ مِنْ مُثَلَّثٍ، مُصَرَّفِ … قَابِلِ فَضْلٍ، ذِي تَمَامٍ، مَا (5) نُفِي 304. مَا وَصْفُهُ \"أَفْعَلَ\" (6) ، أَوْ كَـ\"يُتَّعَدْ\" … وَفَاقِدًا أَخْلِفْهُ: \"أَشْدِدْ\" أَوْ \"أَشَدّْ\" 305. مَصْدَرَهُ بَعْدَ \"أَشَدَّ\" انْصِبْ، وَجَرّْ … بًا بَعْدَ \"أَشْدِدْ\"، وَسِوَى هَذَا نَدَرْ (7) 306. وَفِعْلُ هَذَا البَابِ قَدِّمْهُ، وَصِلْ … مَعْمُولَهُ، وَالفَصْلُ بِالظَّرْفِ نُقِلْ (8)  نِعْمَ وَبِئْسَ وَمَا جَرَى مَجْرَاهُمَا 307. فِعْلَانِ: \"نِعْمَ\"، \"بِئْسَ\"، جَامِدَانِ … لِاسْمَيْنِ عُرِّفَا فَرَافِعَانِ 308. أَوْ مُضْمَرٍ فَسَّرَهُ مُمَيِّزُ … وَجَمْعُهُ مَعْ فَاعِلٌ مُجَوَّزُ",
    "foot_note": "1. لأنها فرع عن اسم الفاعل فهي ضعيفة. \n2. \"ما أَفْعَلَ\". \n3. \"أَفعِلْ\". \n4. أي حذف الباء وما بعدها، على حد قوله تعالى: \"أسمع بهم وأبصر\". \n5. \"ما\" هنا نافية. \n6. أي وصفه ليس على أفعل. \n7. كقولهم: \"ما أذرعها\". \n8. كقول العباس بن مرداس: وقال نبي المسلمين تقدموا وأحبب إلينا أن تكون المقدما انظر: شرح التسهيل 3\\ 35 واللمحة في شرح الملحة 1\\ 523 والمقاصد النحوية 3\\ 1480.",
    "book_id": "105",
    "new_page_number": 56
  },
  {
    "serial_number": "6606276",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 61,
    "volume_number": 1,
    "text": "309. وَمَا بِـ\"بِئْسَ مَا اشْتَرَوُا\" (1) مُمَيِّزُ (2) … وَسِيبَوَيْهِ (3) فَاعِلٌ وَمَيَّزُوا 310. وَبَعْدُ جَا المَخْصُوصُ لَا مَعْ مُشْعِرٍ … مُبْتَدَأً أَوْ خَبَرًا لِمُضْمَرِ 311. كَـ\"بِئْسَ\": \"سَاءَ\"، وَكَـ\"نِعْمَ\": \"فَعُلَا\" … مِنْ ذِي ثَلَاثَةٍ، وَ\"حَبَّذَا\" اجْعَلَا 312. فَاعِلَهُ \"ذَا\"، وَبِـ\"لَا\" قُلْ ذَمَّا … وَأَوْلِ \"ذَا\" مَخْصُوصَهَا أَيًّا مَا 313. وَأَبْقِ \"ذَا\" وَمَا سِوَاهَا ارْفَعْ بِـ\"حَبّْ\" … أَوْ جَرَّ بًا، وَمِنْهُ ضَمُّ الحَا غَلَبْ  أَفْعَلُ التَّفْضِيلِ 314. أَفْعَلُ لِلتَّفْضِيلِ كَالتَّعَجُّبِ (4) … فِي الصَّوْغِ وَالمَنْعِ وَوَصْلِ مَا أُبِي 315. وَإِنْ يُجَرَّدْ صِلْ بِـ\"مِنْ\" وَنَكِّرِ … وَحِّدْ كَمَا أُضِيفَ لِلمُنَكَّرِ 316. وَتِلْوُ \"أَلْ\" طِبْقٌ، وَإِنْ يُضَفْ لِذِي … عُرْفٍ وَمَعْنَى \"مِنْ\" طَرَحْتَ فَكَذِي 317. وَإِنْ قَصَدْتَ فَبِوَجْهَيْنِ قُلِ … وَإِنْ لِـ\"مِنْ\" مُسْتَفْهِمًا بِهِ وَلِي 318. قَدِّمْهُمَا، وَرَفْعُهُ الظَّاهِرَ قَلّْ (5) … وَشَاعَ إِنْ يِكُنْ مَحَلَّ الفِعْلِ حَلّْ 319. كَـ\"مَا رَأَيْتُ رَجُلًا أَحْسَنَ فِي … عَيْنَيْهِ كُحْلٌ مِنْهُ فِي عَيْنِ الصَّفِي\"  النَّعْتُ 320. يَتْبَعُ فِي الإِعْرَابِ الَاسْمَاءَ الأُوَلْ … نَعْتٌ وَتَوْكِيدٌ وَعَطْفٌ وَبَدَلْ 321. فَالنَّعْتُ تَابِعٌ مُتِمٌّ (6) مَا نَعَتْ … إِمَّا لَهُ أَوْ سَبَبِيِّهِ ثَبَتْ 322. فَلْيُجْرَ كَالمَنْعُوتِ فِي النُّكْرِ وَفِي … تَعَرُّفٍ وَهْوَ كَفِعْلٍ إِنْ قُفِي",
    "foot_note": "1. البقرة 90. \n2. انظر: التبيان للعكبري 1\\ 91 والبحر المحيط 1\\ 472 والدر المصون 1\\ 507. \n3. انظر: الكتاب 3\\ 155. \n4. أحكامهما من باب واحد. انظر: الأشباه والنظائر 4\\ 477. \n5. تسمى هذه مسألة الكحل. \n6. يجوز بالتنوين وبدون تنوين مع إضافة ما بعدها إليها.",
    "book_id": "105",
    "new_page_number": 57
  },
  {
    "serial_number": "6606277",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 62,
    "volume_number": 1,
    "text": "323. مُذَكًّرًا فَرْدًا وَفَرْعًا، وَانْعَتِ … بِالوَصْفِ وَالمُشْبِهِهِ كَـ\"ذِي\" (1) وَ\"تِي\" (2) 324. وَجُمْلَةٍ بِرَابِطٍ لَا لِلطَّلَبْ … مُنَكَّرًا، وَمَصْدَرًا وَقَدْ وَجَبْ 325. تَذْكِيرُهُ وَفَرْدُهُ، وَالمُخْتَلِفْ … مِنْ نَعْتِ غَيْرِ الفَرْدِ فَرِّقْ مُنْعَطِفْ 326. وَنَعْتُ مَعْمُولَيْ وَحِيدَيْ عَمَلِ … وَمَعْنًى اتْبِعْهُ كَأَوْصَافٍ تَلِي 327. مُفْتَقِرًا وَإِنْ بِدُونِهَا يَمِزْ … أَوْ بَعْضِهَا الإِتْبَاعَ وَالقَطْعَ أَجِزْ 328. رَفْعًا وَنَصْبًا بِالذِي الحَذْفَ لَزِمْ … وَحَذَفُوا نَعْتًا وَمَنْعُوتًا عُلِمْ (3)  التَّوْكِيدُ 329. بِـ\"النَّفْسِ\" أَكِّدَنْ سُمًا وَ\"العَيْنِ\" … مَعْ مُضْمَرٍ طَابَقَ، وَاجْمَعْ ذَيْنِ 330. بِـ\"أَفْعُلٍ\" إِنْ تَبِعَا المُثَنَّى … وَ\"كُلًّا\" اذْكُرْ إِنْ شُمُولٌ يُعْنَى 331. \"كِلْتَا\"، \"جَمِيعًا\" وَ\"كِلَا\" مَعْ مُضْمَرِ … وَ\"فَاعِلًا\" مِنْ \"عَمَّ\" بِالتَّاءِ اذْكُرِ (4) 332. وَبَعْدَ \"كُلٍّ\" جِئْ بِـ\"أَجْمَعَ\"، \"جُمَعْ\" … \"جَمْعَاءَ\"، \"أَجْمَعِينَ\" أَوْ كُلًّا فَدَعْ 333. وَهْوَ الذِي أَرَى فَقَدْ قَالَ الفَصِيحُ (5) : … \"صَلُّوا جُلُوسًا أَجْمَعُونَ\" فِي الصَّحِيحْ (6) 334. وَلَا تُؤَكِّدْ مُنْكَرًا مَا لَمْ يُفِدْ (7) … وَفِي المُثَنَّى صَوْغُ \"أَجْمَعَ\" فُقِدْ 335. وَإِنْ تُؤَكِّدْ مُضْمَرًا رَفْعًا وُصِلْ … بِـ\"النَّفْسِ\" وَ\"العَيْنِ\" فَبَعْدَ المُنْفَصِلْ 336. لَا بِسِوَى هَذَيْنِ، وَاللَّفْظِيُّ … مُكَرَّرٌ، وَذَاكَ مَعْنَوِيُّ (8)",
    "foot_note": "1. بمعنى صاحب. \n2. اسم إشارة. \n3. يكثر حذف المنعوت ويقل حذف النعت. \n4. لم يصرح بـ\"عامّة\" لأنه يؤدي إلى اجتماع ساكنين في حشو البيت، وهذا لا يجوز. \n5. يقصد به النبي صلى الله عليه وسلم. \n6. انظر: صحيح البخاري 1\\ 139 وصحيح مسلم 1\\ 309. \n7. المسألة خلافية بين المدرستين. انظر: الإنصاف 2\\ 369 وشرح التسهيل 3\\ 296 والمقاصد الشافية 5\\ 16. \n8. يشير بـ\"ذاك\" إلى ما مر من النفس والعين وكلا وكلتا وغيرها.",
    "book_id": "105",
    "new_page_number": 58
  },
  {
    "serial_number": "6606278",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 63,
    "volume_number": 1,
    "text": "337. وَإِنْ تُعِدْ مُضْمَرَ وَصْلٍ فَاللَّذَا … بِهِ وَصَلْتَ مَعْهُ، وَالحَرْفُ كَذَا 338. غَيَرَ جَوَابٍ، وَبِمُضْمَرٍ فُصِلْ … لِلرَّفْعَ أَكِّدْ كُلَّ مُضْمَرٍ وُصِلْ  عَطْفُ البَيَانِ 339. عَطْفُ البَيَانِ تَابِعٌ لِمَا يَلِي … يَجْلُو كَنَعْتٍ فِي وِفَاقِ الأَوَّلِ 340. جِئْ بِهِمَا عُرْفَيْنِ أَوْ نُكْرَيْنِ … وَبَدَلًا يُرَى سِوَى اثْنَتَيْنِ 341. كَـ\"التَّارِكِ البَكْرِيِّ بِشْرٍ\" (1) مَثَلَا … وَ\"يَا غُلَامُ يَعْمُرَا\"، وَاسْتُشْكِلَا (2)  عَطْفُ النَّسَقِ 342. اعْطِفْ بِوَاوٍ، فًا وَ\"ثُمَّ\" نَسَقَا … \"حَتَّى\"، \"أَمَ\"، \"اوْ\" وَأَتْبَعَتْ ذِي مُطْلَقَا 343. وَ\"بَلْ\" وَ\"لَكِنْ\"، \"لَا\" بِلَفْطٍ، وَاعْطِفِ … مُصَاحِبًا أَوْ سَابِقًا أَوْ مُقْتَفِي 344. بِالوَاوِ مَعْ ذِي شِرْكَةً كَـ\"اصْطَفَّا\" (3) … وَاخْصُصْ بِتَرْتِيبٍ وَسُرْعَةٍ فَا 345. وَعَطْفِ غَيْرِ صِلَةٍ عَلَى الصِّلَهْ … وَ\"ثُمَّ\" لِلتَرْتِيبِ وَالفَصْلِ (4) اجْعَلَهْ 346. بَعْضًا وَغَايَةً بِـ\"حَتَّى\" وَ\"أَمَ\" ايْ … مِنْ بَعْدِ هَمْزَةٍ تُسَوِّي أَوْ كَـ\"أَيْ\" 347. وَهْيَ كَـ\"بَلْ\" إِنْ تَخْلُ، وَاشْكُكْ وَأَبِحْ … بِـ\"أَوْ\" وَخَيِّرْ قَسِّمَ ابْهِمْ وَتَصِحّْ",
    "foot_note": "1. إشارة إلى قول المرار الأسدي من الوافر: أنا ابن التارك البكري بشر عليه الطير ترقبه وقوعًا الشاهد فيه قوله \"بشر\" فإنه عطف بيان لا بدل من \"البكري\" لأن البدل يكون على نية تكرار العامل فيكون \"التارك بشر\" وهذا لا يجوز لأنه يلزم عليه إضافة المحلى بـ\"أل\" إلى خال منها وذلك غير جائز فتعين عطف البيان. انظر: الكتاب 1\\ 182 والأصول 1\\ 135 وشرح الكافية الشافية 3\\ 1196 وشرح ابن عقيل 3\\ 222 وهمع الهوامع 3\\ 161 وخزانة الأدب 4\\ 284. \n2. الذي استشكل على ابن مالك هو ابن هشام في حاشيته على التسهيل. انظر: البهجة المرضية 404. \n3. الألف للتثنية. \n4. أي مع مهلة، وكل مهلة بحسبها.",
    "book_id": "105",
    "new_page_number": 59
  },
  {
    "serial_number": "6606279",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 64,
    "volume_number": 1,
    "text": "348. كَـ\"بَلْ\" وَكَالوَاوِ إِذَا اللَّبْسُ نُفِي … وَمِثْلَ \"أَوْ\": \"إِمَّا\" وَذِي لَمْ تَعْطِفِ 349. نِدَاءً اثْبَاتًا وَأَمْرًا لَا تَلِي … نَفْيًا وَنَهْيًا \"بَلْ\" وَ\"لَكِنْ\" وَانْقُلِ 350. بِـ\"بَلْ\" لِثَانٍ حُكْمَ أَوَّلٍ لَدَى … أَمْرٍ وَمُثْبَتٍ، وَ\"لَيْسَ\" جَوِّدَا 351. عَطْفًا بِهَا مَعْنًى فَقَطْ وَهْوَ الأَحَقّْ … فَالشَّافِعِي إِمَامُنَا بِهِ نَطَقْ (1) 352. وَاعْطِفْ عَلَى مُضْمَرِ رَفْعٍ مُتَّصِلْ … مَعْ فَاصِلٍ وَشَاعَ عَطْفُ مَا فُصِلْ 353. وَمُضْمَرُ الخَفْضِ أَعِدْ إِنْ تَعْطِفِ … عَلَيْهِ خَافِضًا، وَتَرْكُهُ اصْطُفِي 354. وَتُحْذَفُ الفَاءُ وَتَالٍ إِنْ أُمِنْ … وَالوَاوُ هَكَذَا، وَتَخْصِيصٌ (2) زُكِنْ 355. بِعَطْفِ عَامِلٍ حَذْفَتَ وَبَقِي … مَعْمُولُهُ، وَحَذْفُ مَتْبُوعِ انْتُقِي 356. إِذَا بَدَا، وَالعَطْفُ فِي الفِعْلِ اتُّخِذْ … مَا لَمْ يُخَالِفْ فِي الزَّمَانِ فَانْتُبِذْ (3) 357. وَاعْطِفْ عَلَى اسْمٍ شِبْهِ فِعْلٍ فِعْلَا … وَعَكْسُهُ، وَالعَاطِفَ احْذِفْ أَصْلَا  البَدَلُ 358. البَدَلُ التَّالِي بِلَا حَرْفٍ (4) ، قُصِدْ … بِالحُكْمِ، بَعْضًا أَوْ مُطَابِقًا يَرِدْ 359. أَوْ ذَا اشْتِمَالٍ أَوْ كَتِلْوِ \"بَلْ\" وَذَا … إِنْ يُقْصَدِ اضْرَابًا بَدَا (5) ، أَوْ فَانْبِذَا (6)",
    "foot_note": "1. قال الإمام الشافعي في كتاب الأم: \"لِأَنَّ الطُّهَارَاتِ كُلَّهَا إنَّمَا جُعِلَتْ عَلَى مَا يَظْهَرُ لَيْسَ عَلَى الْأَجْوَافِ\". انظر: الأم 1\\ 252 وهمع الهوامع 3\\ 218. \n2. يعني أنها تختص بعطف عامل محذوف بقي معموله. \n3. انظر: البهجة المرضية 419. \n4. احترازًا عما بعد بل ولكن. انظر: شرح الكافية الشافية 3\\ 1276. \n5. يسمى بدل الإضراب والبداء. انظر: البهجة المرضية 421. \n6. يعني إذا كان دون قصد يسمى بدل الخطأ أو الغلط. انظر: البهجة المرضية 422.",
    "book_id": "105",
    "new_page_number": 60
  },
  {
    "serial_number": "6606280",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 65,
    "volume_number": 1,
    "text": "360. بِهِ الخَطَا، وَظَاهِرٌ لَيْسَ بَدَلْ … مِنْ مُضْمَرِ الحَاضِرِ إِلَّا مَا اشْتَمَلْ 361. أَوْ جَا إِحَاطَةً وَبَعْضًا (1) ، وَقُلِ … يَدُلُّ مَا ضُمِّنَ هَمْزًا ذَا يَلِي 362. وَبَدَلُ الفِعْلِ مِنَ الفِعْلِ يَرِدْ … وَجُمْلَةٌ مِنْ جُمْلَةٍ وَمُنْفَرِدْ (2)  النِّدَاءُ 363. نَادِ بَعِيدًا أَوْ كَذَا بِـ\"يَا\"، \"أَيَا\" … \"هَيَا\" وَ\"أَيْ\"، \"أَ\"، \"آ\" بِهَمْزٍ دَانِيَا 364. وَ\"يَا\" وَ\"وَا\" ذَا النَّدْبِ، \"يَا\" لِلَّبْسِ دَعْ … وَالحَذْفُ مِنْ نَدْبٍ وَمُضْمَرِ امْتَنَعْ 365. كَالمُسْتَغَاثِ وَيَقِلُّ فِي سُمَا … إِشَارَةٍ وَالجِنْسِ لَا غَيْرِهِمَا 366. وَابْنِ عَلَى الرَّفْعِ الفَرِيدَ (3) المَعْرِفَهْ … وَانْوِ بِمَبْنِيٍّ كَتَجْدِيدِ الصِّفَهْ 367. وَالفَرْدَ نُكْرًا وَالمُضَافَ انْصِبْ وَعمّْ … شِبْهَ المُضَافِ أَوْ \"جَمِيلَ الوَجْهِ\" ضُمّْ 368. وَضُمَّ وَافْتَحْ مِنْ \"أَزَيْدُ بْنَ عَلِي\" … وَاضْمُمْ إِنِ \"ابْنٌ\" عَلَمَيْنِ مَا وَلِي 369. وَنَوِّنِ المَبْنِي اضْطِرَارًا فَانْصِبِ … أَوْ ضُمَّ، وَالجَمْعُ لِـ\"يَا\" وَ\"أَلْ\" أُبِي 370. إِلَّا مَعَ \"اللهِ\" وَمَحْكِيِّ الجُمَلْ … وَالأَكْثَرُ \"اللَّهُمَّ\". \"يَا اللَّهُمَّ\" (4) قَلّْ",
    "foot_note": "1. أي ما أفهم بعضًا. \n2. يعني تبدل جملة من مفرد، كقول ابن أبي ربيعة: إلى الله أشكو بالمدينة حاجة وبالشام أخرى كيف يلتقيان انظر: شرح التسهيل 3\\ 340 وشرح المرادي 2\\ 1050 ومغني اللبيب 273. \n3. يقصد به المفرد. \n4. إشارة إلى رجز أبي خراش: إني إذا ما حدث ألما أقول يا اللهم يا اللهما الشاهد فيه قوله \"يا اللهم\" حيث جمع الشاعر بين حرف النداء والميم المشددة التي تأتي عنها عوضًا إذا حُذفت وهذا ضرورة. انظر: الفوائد العجيبة 29 والمقتضب 4\\ 242 والإنصاف 1\\ 279 وشرح الكافية الشافية 3\\ 1307 واللمحة 2\\ 798.",
    "book_id": "105",
    "new_page_number": 61
  },
  {
    "serial_number": "6606281",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 66,
    "volume_number": 1,
    "text": "فَصْلٌ 371. انْصِبْ مُضَافًا دُونَ \"أَلْ\" تَابِعَ (1) ضَمّْ … وَارْفَعْ أَوِ انْصِبْ غَيْرَهُ، وَاجْعَلْ تُؤَمّْ (2) 372. كَمُسْتَقِلٍّ نَسَقًا وَبَدَلَا … وَنَسَقٌ ذُو \"أَلْ\" بِوَجْهَيْنِ اعْتَلَى 373. رَفْعٌ (3) ، وَ\"أَيُّهَا\" اخْصُصَنْ حَتْمًا بِذِي … \"أَلْ\" رَافِعًا وَبِالمُشَارِ وَ\"الذِي\" 374. وَوَصْفُ ذِي إِشَارَةٍ لَهُ افْتَقَرْ … فَارْفَعْ، وَ\"سَعْدُ سَعْدَ الَاوْسِ\" (4) النَّصْبُ قَرّْ 375. فِي الثَّانِ، وَالأَوَّلُ ضُمَّ وَانْفَتَحْ … لِتَالِيِ الثَّانِي أُضِيفَ فِي الأَصَحّْ  المُنَادَى المُضَافُ إِلَى اليَاءِ 376. مُضَافُ يَا (5) صَحَّ يُنَادَى: عَبْدِيَا … عَبْدِي وَعَبْدِ، عَبْدَ، عَبْدَا احْذِفْ لِيَا 377. وَافْتَحْ أَوِ اكْسِرْ يَا ابْنَ أُمَّ، يَا ابْنَ عَمّْ … أَبَتِ، أُمَّتِ بِذَا الوَجْهَيْنِ تَمّْ  أَسْمَاءٌ لازَمَتِ النِّدَاءَ 378. لُؤْمَانُ، نَوْمَانُ، فُلُ اخْصُصْ بِالنِّدَا … وَ\"يَا خَبَاثِ\" سَبُّ الَانْثَى اطَّرَدَا (6) 379. مِنَ الثُّلَاثِيِّ، وَشَاعَ \"فُعَلُ\" … لِذَكَرٍ، وَجُرَّ فِي الشِّعْرِ \"فُلُ\" (7)",
    "foot_note": "1. مفعول به لقوله \"انصب\". \n2. يظهر أن قوله \"تؤم\" جملة اعتراضية، والمعنى: \"واجعل كمستقل نسقًا .. \". \n3. قوله: \"اعتلى رفع\" يعني أن الرفع يُنتقى ويُنتخَب. انظر: الألفية ص 141 البيت 587. \n4. إشارة إلى قوله من الطويل: أيا سعدُ سعدَ الأوس كن أنت ناصرًا ويا سعد سعد الخزرجين الغطارف الشاهد فيه: \"يا سعد سعد الأوس\" حيث كرر المنادى مضافًا فإنه يجب نصب الثاني وفي الأول وجوه، والمقصود بالسعدَين سعد بن معاذ وسعد بن عبادة. انظر: حاشية ابن حمدون 2\\ 41 والمجالسة وجواهر العلم 4\\ 96 والمستدرك على الصحيحين 3\\ 283 وآكام المرجان 190 وهواتف الجنان 36 والتمهيد 24\\ 105. \n5. أي ياء المتكلم. \n6. في المخطوط: \"واطرادا\" وبالواو ينكسر البيت. \n7. يقصد: تضل منه إبلي بالهوجل تدافع الشيب ولم تقتل في لجة أمسك فلانًا عن فل الرجز لأبي النجم العجلي من الأرجوزة المشهورة التي مطلعها: الحمد لله العلي الأجلل الواسع الفضل الوهوب المجزل الشاهد فيما قوله \"عن فل\" فإنه استعملها في غير النداء وجرها بحرف الجر. انظر: الكتاب 2\\ 248 والمقتضب 4\\ 238 والأصول 1\\ 349 وشرح الكافية الشافية 3\\ 1331.",
    "book_id": "105",
    "new_page_number": 62
  },
  {
    "serial_number": "6606282",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 67,
    "volume_number": 1,
    "text": "الاسْتِغَاثَةُ 380. اِخْفِضْ بِلَامٍ مُسْتَغَاثًا جَاءَ ذَا … فَتْحٍ كَفِي المَعْطُوفِ مَعْ \"يَا\"، وَخُذَا 381. فِي غَيْرِ ذَا الكَسْرَ (1) ، وَعَنْهَا أَعْقِبِ … بِأَلِفٍ كَذَاكَ ذُو التَّعَجُّبِ  النُّدْبَةُ 382. كَذِي النِّدَا ذُو النَّدْبِ، وَالمُنْكَرُ لَا … يُنْدَبُ وَالمُبْهَمُ لَا مَا وُصِلَا 383. وَأَلِفًا صِلْهُ، وَإِنْ تَلَاهُ … آخِرَهْ احْذِفْهُ كَـ\"وَا مُوسَاهُ\" 384. تَنْوِينُ مَا كَمَّلَهُ كَذَا، وَإِنْ … يُوهَمْ فَمِنْهُ الأَلِفَ اقْلِبْ مَا يَهِنْ 385. وَالهَاءَ زِدْ وَقْفًا جَوَازًا، \"عَبْدِيَا\" … \"عَبْدَا\" شَدَا مَنْ فِي النِّدَا سَكَّن يَا  التَّرْخِيمُ 386. رَخِّمْ بِحَذْفِ الآخِرِ المُنَادَى … مُؤَنَّثًا بِالهَاءِ أَوْ مَا زَادَا 387. عَلَى ثَلَاثٍ عَلَمًا لَمْ يُضَفِ … وَقَلَّ إِنْ يُسْنَدْ، وَتِلْوَهُ احْذِفِ 388. إِنْ كَانَ لَيْنًا سَاكِنًا وَزَائِدَا … مُكَمِّلًا أَرْبَعَةً فَصَاعِدَا 389. كَعَجُزِ المَزْجِ، وَفِي الوَاوِ اخْتُلِفْ … وَاليَا وَلَا الفَتْحِ، وَإِنْ لِمَا حُذِفْ 390. نَوَيْتَ أَبْقِ تِلْوَهُ كَمِثْلِ مَا … قَبْلُ وَإِلَّا فَكَمَا لَوْ تُمِّمَا 391. كَـ\"يَا ثَمُو\" وَ\"يَا ثَمِي\" عَلَيْهِمَا … \"مُسْلِمَةُ\" الأَوَّلُ فِيهِ أَلْزِمَا (2) 392. وَجَوِّزِ الوَجْهَيْنِ فِي كَـ\"مَسْلَمَهْ\" … وَقَابِلُ النِّدَا اضْطِرَارًا رَخِّمَه",
    "foot_note": "1. مفعول به لقوله \"خذن\" في عجز البيت السابق. \n2. يعني أنه يجب معاملة \"مُسلمة\" عند الترخيم على لغة من ينتظر فقط، فتقول: \"يا مسلمَ\"، ولا يجوز أن تُجريه على لغة من لا ينتظر، فلا تقول: \"يا مُسلمُ\"؛ حتى لا يلتبس المذكر بالمؤنث، مُسلم بمُسلمة. انظر: شرح ابن الناظم 427 والمقاصد الشافية 5\\ 454 وشرح المكودي 255.",
    "book_id": "105",
    "new_page_number": 63
  },
  {
    "serial_number": "6606283",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 68,
    "volume_number": 1,
    "text": "الاخْتِصَاصُ 393. الِاخْتِصَاصُ كَنِدَاءٍ دُونَ \"يَا\" … لِـ\"أَيٍّ\" اوْ لِـ\"أَلْ\" يَجِيءُ تَالِيَا  التَّحْذِيرُ وَالإِغْرَاءُ 394. \"إِيَّاكَ وَالشَرَّ\" بِتَحْذِيرٍ نَصَبْ … مُسْتَتِرٌ حَتْمًا كَـ\"إِيَّاكَ الغَضَبْ\" 395. وَغَيْرُ \"إِيَّا\" ذِكْرَ فِعْلِهِ أَبِحْ … لَا ذِي تَكَرُّرٍ وَذِي عَطْفٍ يَصِحّْ 396. \"إِيَّاكَ\"، \"إِيَّاهُ\" يَشِذُّ وَكَذَا … بِغَيْرِ \"إِيَّا\" مَا بِهِ أُغْرِي خُذَا  أَسْمَاءُ الأَفْعَالِ وَالأَصْوَاتِ 397. مَا نَابَ عَنْ فِعْلٍ سُمَا الفِعْلِ كَـ\"صَهْ\" … وَمَا بِمَعْنَى \"افْعَلْ\" (1) كَثِيرٌ نَحْوُ \"مَهْ\" 398. وَقَلَّ غَيْرُهُ كَـ\"هَيْهَاتَ\" وَ\"وَيْ\" … وَمِنْ سُمَا الفِعْلِ \"رُوَيْدَ\"، \"بَلْهَ\"، أَيْ 399. إِنْ نَصَبَا، وَمَصْدَرَيْنَ خَفَضَا (2) … \"عَلَيْكَ\"، \"دُونَكَ\"، \"إِلَيْكَ\" أَعْرِضَا (3) 400. وَكَمَنُوبِهَ اعْمِلَنْ مُقَدَّمَا … وَإِنْ يُنَوَّنْ فَبِنُكْرِهِ احْكُمَا 401. وَشِبْهُهُ المَحْكِي بِهِ أَوْ خُوطِبَا … غَيْرُ الذِي يَعْقِلُ صَوْتًا كَـ\"قَبَا\" (4)  نُونَا التَّوْكِيدِ 402. أَكِّدْ بِنُونَيْنِ شَدِيدَةٍ وَذِي (5) … خِفَّةٍ، امْرًا وَالمُضَارِعَ الذِي 403. جَا طَلَبًا أَوْ شَرْطًا \"إِمَّا\" قَدْ تَلَا … أَوْ مُثْبَتًا فِي قَسَمٍ مُسْتَقْبَلَا 404. وَبَعْدَ \"مَا\" وَ\"لَمْ\" وَ\"لَا\" لَمْ يَرْجَحِ … وَغَيْرِ \"إمَّا\"، وَأَخِيرَهُ افْتَحِ",
    "foot_note": "1. يقصد به اسم فعل الأمر. \n2. يعني أنهما إن نصبا ما بعدهما فهما من أسماء الأفعال، وإن جرَّا ما بعدهما فهما مصدران، وما بعدهما مضاف إليه. \n3. يقصد أن معنى \"إليك\" أعرِض. \n4. \"قَبْ\" حكاية وقع ضربة السيف. انظر: المحكم والمحيط الأعظم 6\\ 143 وتاج العروس 3\\ 514. \n5. أي صاحبة، يقصد: \"ذات خفة\".",
    "book_id": "105",
    "new_page_number": 64
  },
  {
    "serial_number": "6606284",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 69,
    "volume_number": 1,
    "text": "405. وَاشْكُلْهُ قَبْلَ مُضْمَرٍ لَيْنِ بِمَا … جَانَسَ، وَالمُضْمَرُ حَذْفَهُ الْزَمَا 406. لَا أَلِفًا، وَآخِرَ الفِعْلِ الأَلِفْ … يَا اجْعَلْ إِنِ الأَلِفُ يَرْفَعْ، وَحُذِفْ 407. إِنْ يَرْفَعِ الوَاوُ أَوِ اليَا، وَاشْكُلِ … ذَيْنِ وَجَانِسْ، وَالخَفِيفُ لَا يَلِي 408. لِأَلِفٍ بِلْ أُخْتِهَا وَاكْسِرْ، وَمَعْ … نُونِ إِنَاثٍ أَلِفٌ قَبْلُ اجْتَمَعْ 409. وَاحْذِفْ خَفِيفَةً لِسَاكِنٍ تَلَا … وَبَعْدَ غَيْرِ الفَتْحِ فِي الوَقْفِ عَلَا 410. وَرُدَّ مَا لَهَا بِوَصْلٍ حُذِفَا … وَبَعْدَ فَتْحٍ أَلِفَ اقْلِبْ كَـ\"قِفَا\"  مَا لا يَنْصَرِفُ 411. الصَّرْفُ تَنْوِينٌ مُبِينٌ مَعْنَى (1) … فَأَلِفُ التَّأْنِيثِ كَيْفَ عَنَّا (2) 412. يَمْنَعُ مِنْ صَرْفٍ، وَزَائِدَانِ فِي … \"فَعْلَانَ\" وَصْفًا تًا بِأُنْثَاهُ نُفِي (3) 413. وَوَصْفٌ اصْلِيٌّ بِـ\"أَفْعَلَ\" امْتَنَعْ … تَأْنِيثُهُ بِالتَّاءِ، وَالعُرُوضَ (4) دَعْ 414. فِي الوَصْفِ وَالإِسْمِ كَـ\"الادْهَمَ، ارْبَعِ\" … وَجْهَانِ فِي كَـ\"أَجْدَلٍ\"، وَلْتَمْنَعِ 415. وَصْفًا بِعَدْلٍ كَـ\"ثُلَاثَ\" وَ\"أُخَرْ\" … \"مَثْنَى\" وَوَزْنِ ذَيْنِ لِلأَرْبَعِ قَرّْ 416. وَالجَمْعَ ذَا وَزْنِ \"مَفَاعِيلَ\" وَذَا … \"مَفَاعِلٍ\"، وَذَا اعْتِلَالِهِ خُذَا 417. رَفْعًا وَجَرًّا حَذْفَ يًا وَنَوِّنَهْ … وَامْنَعْ \"سَرَاوِيلَ\" لِشِبْهٍ فِي الزِّنَهْ (5) 418. وَالعَلَمَ المَمْزُوجَ أَوْ ذَا أَلِفِ … وَنُونَ \"فَعْلَانَ\" أَوِ الهَا امْنَعْ تَفِ 419. وَامْنَعْ مُؤَنَّثًا بِغَيْرِ الهَا اسْتَقَرّْ … فَوْقَ ثَلَاثٍ أَوْ كَـ\"جَوْرَ\" أَوْ \"سَقَرْ\"",
    "foot_note": "1. وهو أن الاسم متمكن في الاسمية، فلم يشبه الحرف شبهًا قويًّا فيُبني، ولا الفعل فيُمنع من الصرف. \n2. الألف في \"عنّ\" للإطلاق. \n3. لابن مالك نظم لهذه الألفاظ التي جاءت على فعلان فعلانة في كتابه نظم الفوائد. انظر: نظم الفوائد 62. \n4. يعني الوصفية والاسمية العارضة. \n5. أي في الوزن. انظر: الألفية ص 149 البيت 660.",
    "book_id": "105",
    "new_page_number": 65
  },
  {
    "serial_number": "6606285",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 70,
    "volume_number": 1,
    "text": "420. أَوْ أَصْلُهُ مُذَكَّرٌ وَإِنْ فُقِدْ … هَذَا وَعُجْمَةٌ فَمَنْعَهُ أَجِدْ 421. كَالعَجَمِيِّ الوَضْعِ وَالتَّعْرِيفِ نَصّْ … فَوْقَ ثَلَاثٍ، أَوْ بِوَزْنِ الفِعْلِ خَصّْ 422. أَوْ غَالِبٌ، وَعَلَمٌ ذُوَ أَلِفِ … إِلْحَاقٍ اوْ ذُو العْدْلِ لَمْ يَنْصَرِفِ 423. وَعَلَمُ الأُنْثَى \"فَعَالِ\" امْنَعْ كَذَا … تَمِيمُ (1) وَالبِنَاءُ كَسْرًا حَقُّ ذَا 424. وَمَا بِهِ التَّعْرِيفُ أَثَّرَ اصْرِفَا … مُنَكَّرًا، وَمِنْهُ ذُو النَّقْصِ اقْتَفَى 425. جَمْعًا مُعَلًّا، وَاضْطِرَارًا اصْرِفِ … ذَا المَنْعِ وَالمَصْرُوفُ مَنْعُهُ قُفِى  إِعْرَابُ الفِعْلِ 426. ارْفَعْ مُضَارِعًا خَلَا مِنْ عَامِلَيْ … نَصْبٍ وَجَزْمٍ، وَانْصِبَنْ بِـ\"لَنْ\" وَ\"كَيْ\" 427. وَ\"أَنْ\" سِوَى مِنْ بَعْدِ عِلْمٍ وَالتِي … مِنْ بَعْدِ ظَنٍّ، ارْفَعَنْ وَانْصِبْ بِتِي (2) 428. وَبِـ\"إِذَنْ\" مُصَدَّرًا مُسْتَقْبَلَا … مُوصَلًا اوْ بِقَسَمٍ قَدْ فُصِلَا 429. وَبَعْدَ عَطْفِ ذِي كَـ\"أَنْ\" مِنْ بَعْدِ ظَنّْ … وَبَيْنَ \"لَا\" وَلَامٍ الْزِمْ ذِكْرَ \"أَنْ\" 430. وَعِنْدَ فَقْدِ \"لَا\" اضْمِرَنْ أَوَ اظْهِرِ … وَبَعْدَ نَفْيِ \"كَانَ\" حَتْمًا أَضْمِرِ 431. كَـ\"أَوْ\" إِذَا \"حَتَّى\" أَوِ \"الَّا\" قَدْ صَلَحْ (3) … مَوْضِعَهَا وَبَعْدَ \"حَتَى\" ذَا اتَّضَحْ 432. وَتِلْوَهَا المُسْتَقْبَلَ انْصِبْ وَارْفَعِ … حَالًا وَإِنْ تُجِبْ بِوَاوٍ كَـ\"مَعٍ\" 433. وَالفَاءُ مَحْضَ طَلَبٍ أَوْ نَفْيِ … أُضْمِرَ \"أَنْ\" وَبَعْدَ غَيْرِ النَّفْيِ 434. إِنْ تَسْقُطِ الفَا اجْزِمْ وَبَعْدَ النَّهْيِ ضَعْ … \"إِنْ\" قَبْلَ \"لَا\" إِنْ تَخْتَلِفْ فَالجَزْمَ دَعْ",
    "foot_note": "1. انظر: الكتاب 3\\ 277 والمقتضب 3\\ 49. \n2. لأنها تكون حينئذ مخففة من الثقيلة واسمها ضمير الشأن والجملة بعدها خبر. \n3. يعني أن \"أَنْ\" يجب إضمارها بعد \"أو\" إذا صلح في موضعها \"حتى\" أو \"إلا\". انظر: الكتاب 3\\ 47 والمقتضب 2\\ 28 وشرح أبيات سيبويه 2\\ 71 وشرح ابن الناظم 479 وشرح المرادي 3\\ 1246 والمقاصد الشافية 6\\ 32.",
    "book_id": "105",
    "new_page_number": 66
  },
  {
    "serial_number": "6606286",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 71,
    "volume_number": 1,
    "text": "435. وَالأَمْرُ غَيْرَ \"افْعَلْ\" جَوَابَهُ اجْزِمِ … وَفِي جَوَابٍ لِلرَّجَا النَّصْبَ احْتِم 436. أَوْ أَثْبِتِ \"انْ\" وَحَذْفُ \"أَنْ\" وَالنَّصْبُ شَذّْ … فِي غَيْرِ مَا مَرَّ وَمَنْ قَاسَ انْتَبَذْ 437. وَاعْطِفْ عَلَى اسْمٍ خَالِصٍ فِعْلًا بِفَا … أَوْ وَاوٍ اوْ \"ثُمَّ\" وَإنْصِبْ وَاحْذِفَا  عَوَامِلُ الجَزْمِ 438. بِـ\"لَا\" وَلَامِ الطَّلَبِ الفِعْلَ اجْزِمَا … وَ\"لَمْ\" وَ\"لَمَّا\"، \"إِنْ\" وَ\"إِذْمَا\"، \"حَيْثُمَا\" 439. \"أَيَّانَ\"، \"أَيْنَ\"، \"مَنْ\" وَ\"أَيٌّ\"، \"مَهْمَا\" … \"أَنَّى\"، \"مَتَى\"، \"مَا\"، تِلْوُ \"إِذْمَا\" أَسْمَا (1) 440. وَ\"إِنْ\" وَتَالِيهَا لِفِعْلَيْنِ جَزَمْ … الشَّرْطَ فَالجَزَاءَ ذَا الجَوَابَ سَمّْ 441. مُضَارِعَيْنِ مَاضِيَيْنِ (2) أَوْ ذَوَيْ … تَخَالُفٍ، وَارْفَعْ جَزَاءً حُسْنًا ايْ 442. مِنْ بَعْدِ مَاضٍ وَسِوَاهُ مَا انْفَتَحْ … وَاقْرُنْ بِفًا حَتْمًا جَوَابًا مَا صَلَحْ 443. شَرْطًا، كَذَا \"إِذَا\" وَ\"مَهْمَا\" عُطِفَا … فِعْلٌ عَلَى الجَزَا بِوَاوٍ أَوْ بِفَا 444. ثَلِّثْ وَتَالِي الفَا أَوِ الوَاوِ وَسَطْ … الجُمْلَتَيْنِ انْصِبْهُ وَاجْزِمْهُ فَقَطْ 445. وَمَا مِنَ الجَزَاءِ وَالشَّرْطِ عُرِفْ … يُحْذَفْ، وَمَا أُخِّرْ جَوَابُهُ حُذِفْ 446. مِنْ قَسَمٍ وَالشَّرْطِ لَكِنْ إِنْ سَبَقْ … مُبْتَدَأٌ فَالشَّرْطُ بِالذِّكْرِ أَحَقّْ",
    "foot_note": "1. إذما، حيثما، أيان، أين، من، أي، مهما، أنى، متى، ما. \n2. في هذا نكتة لطيفة من السيوطي، حيث قدم المضارع على الماضي، بينما قدم ابن مالك الماضي على المضارع، وتقديم المضارع على الماضي أولى لأن المضارع أكثر، قال ابن جابر الهواري: \"وكان حقه أن يقدم المضارعين لأصالتهما، ولكن حكم عليه النظم\"، ولكن لو تماشينا مع مذهب ابن مالك في الضرورة فما وقع ابن مالك فيه مندوحة، وكان بإمكانه أن يتجنبه، فمذهبه في الضرورة ما لا مندوحة لك عنه، قال الغزي في شرحه على الألفية: والأكثر الثاني فلو قدّمه لكان أولى مثل أن ينظمه: مضارعين ثم ماضيين تلفيهما أو متخالفين انظر: شرح الكافية الشافية 1\\ 300 وشواهد التوضيح والتصحيح 160 وشرح ابن جابر الهواري 4\\ 145، وشرح الغزي البيت 7024 وخزانة الأدب 1\\ 33.",
    "book_id": "105",
    "new_page_number": 67
  },
  {
    "serial_number": "6606287",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 72,
    "volume_number": 1,
    "text": "\" لَوِ\" الشَّرْطِيَّةُ 447. \"لَوْ\" حَرْفُ شَرْطٍ فِي المُضِي، وَيَنْتَقِلْ … لَهُ مُضَارِعٌ تَلَاهَا، وَيَقِلّْ 448. مُسْتَقْبَلٌ مَعْنًى، وَبِالفِعْلِ تُخَصّْ … و\"أَنَّ\" مُبْتَدًا عَلَيْهِ عَمْرُو (1) نَصّْ (2) \" أَمَّا\" وَ\"لَوْلا\" وَ\"لَوْمَا \" 449. \"أَمَّا\" كَـ\"مَهْمَا يَكُ مِنْ شَيْءٍ\" وَمَا … فِعْلٌ يَلِي هَذِي لِمَعْنًى عُلِمَا 450. وَفًا لِتِلْوِهَا احْتِمْ وَيَشِذّْ … فِي النَّثْرِ حَذْفُهَا بِلَا قَوْلٍ نُبِذْ 451. \"لَوْلَا\" وَ\"لَوْمَا\" لِامْتِنَاعٍ إِذْ وُجِدْ … شَيْءٌ لِلِابْتِدَاءِ أَلْزِمْ وَاسْتَفِدْ 452. بِذَيْنِ تَحْضِيضًا وَ\"هَلَّا\"، \"أَلَّا\" … وَبِـ\"أَلَا\" عَرْضًا، وَخَصَّتْ فِعْلَا  الإِخْبَارُ بِـ\"الذِي\" وَالأَلِفِ وَاللامِ 453. بِـ\"اللَّذِ\" مَعْ فُرُوعِهِ إِنْ تُخْبِرِ … مُبْتَدَأً تَسْبِقْ وَجِئْ بِالخَبَرِ 454. وَهْوَ الذِي يُقَالُ: أَخْبِرْ عَنْهُ … وَغَيْرَ ذَيْنِ صِلَةً وَسِّطْهُ 455. وَشَرْطُ مَا أُخْبِرَ عَنْهُ أَنْ قَبِلْ … تَأَخُّرًا وَمُضْمَرًا عَنْهُ أُحِلّْ (3) 456. أَوْ أَجْنَبِيًّا وَبِـ\"أَلْ\" عَنْ بَعْضِ ذِي … فِعْلٌ مُقَدَّمٌ فَأَخْبِرْ وَاحْتَذِ 457. إِنْ صَحَّ صَوْغُ صِلَةٍ مِنْهُ لِـ\"أَلْ\" … وَرَفْعُهَا مُضْمَرَ غَيْرِهِ انْفَصَلْ",
    "foot_note": "1. يقصد به سيبويه. \n2. قال سيبويه: \"وتقول: لو أنه ذاهبٌ لكان خيراً له، فأنَّ مبنيَّة على لو كما كانت مبنيَّة على لولا، كأنك قلت: لو ذاك\". انظر: الكتاب 3\\ 121. \n3. أي جواز الاستغناء عنه بمضمر. انظر: شرح ابن الناظم 515 وشرح ابن عقيل 4\\ 63 وشرح المكودي 300.",
    "book_id": "105",
    "new_page_number": 68
  },
  {
    "serial_number": "6606288",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 73,
    "volume_number": 1,
    "text": "العَدَدُ 458. \"ثَلَاثَةٌ\" لِـ\"عَشْرَةٍ\" قُلْ لِلذَّكَرْ … وَضِدَّهُ (1) جَرِّدْ مِنَ التَّا، وَيُجَرّْ 459. تَمْيِيزُهُ، وَجَمْعَ قِلَّةٍ وَرَدْ … وَ\"مِئَةٌ\" لِـ\"الأَلْفِ\" جَرَّ مَا انْفَرَدْ 460. وَقَلَّ جَرُّ (2) الجَمْعِ، وَاذْكُرْ فِي الذَّكَرْ … مُرَكَّبًا \"أَحَدَ\" مِنْ قَبْلِ \"عَشَرْ\" 461. فِي الضِّدِّ \"إِحْدَى عَشْرَةٍ\" أَوِ اكْسِرِ … شِينًا (3) ، وَخُذْ \"ثَلَاثَةً\" لِلآخِرِ 462. كَمَا مَضَى، وَ\"العَشْرَ\" فَاقْضِ مُطْلَقَا … لَهُ كَمَا لِوَاحِدٍ قَدْ سَبَقَا (4) 463. فِي الذَّكَرِ \"اثْنَا عَشَرَ\"، الأُنْثَى \"اثْنَتَا … عَشْرَةَ\"، وَالأُولَى (5) اعْرِبَنْ، وَغَيْرَ تَا 464. يُبْنَى عَلَى الفَتْحِ سِوَى \"ثَمَانِي\" … فَجَوَّزُوا الحَذْفَ مَعَ الإِسْكَانِ 465. بِوَاحِدٍ مُيِّزَ \"عِشْرُونَ\" إِذَا … نُكِّرَ مَعْ مُرَكَّبٍ أَوِ ابْنِ ذَا 466. مُضِيفَهُ، وَصُغْ مِنِ \"اثْنَيْنِ\" إِلَى … \"عَشَرَةٍ\": \"فَاعِلَةً\" وَ\"فَاعِلَا\" 467. وَأَضِفْ انْ تُرِدْ بِهِ بَعْضَ اللَّذَا … مِنْهُ بَنَيْتَهُ كَـ\"ثَانِي اثْنَيْنِ ذَا\" 468. وَإِنْ تُرِدْ جَعْلَ الأَقَلِّ مِثْلَ مَا … فَوْقُ فَكَاسْمِ الفَاعِلَ اعْمِلْ وَالْزَمَا 469. وَإِنْ أَرَدْتَ مِثْلَ \"ثَانِي اثْنَيْنِ\" … مُرَكَّبًا فَجِئْ بِتَرْكِيبَيْنِ 470. أَوْ \"فَاعِلًا\" أَضِفْهُ لِلمُرَكَّبِ … أَوْ جِئْ بِـ\"حَادِي عَشَر\" المُسْتَعْقب 471. وَ\"فَاعِلًا\" مِنْ قَبْلِ مَا \"عِشْرِينَا\" … وَالوَاوَ خُذْ كَـ\"الحَادِ وَالتِّسْعِينَا\"",
    "foot_note": "1. أي المؤنث. \n2. في المخطوط \"يجر\" ولعل الصواب ما أثبتناه. \n3. كسر الشين لغة تميم. انظر: معاني القرآن للأخفش 1\\ 104 وشرح السيرافي 2\\ 9 وعلل النحو 499. \n4. بالتاء مع المذكر، وبدونها مع المؤنث. \n5. يقصد بالأولى \"اثنا، اثنتا\" فإنهما يعربان إعراب المثنى.",
    "book_id": "105",
    "new_page_number": 69
  },
  {
    "serial_number": "6606289",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 74,
    "volume_number": 1,
    "text": "\" كَمْ\" وَ\"كَأَيٍّ\" (1) وَ\"كَذَا \" 472. مَيِّزْ كَـ\"عِشْرِينَ\": \"كَمِ\" انْ تَسْتَفْهِمِ … وَاجْرُرْ بِـ\"مِنْ\" مُضْمَرًا انْ جُرَّتْ \"كَمِ\" 473. كَـ\"عَشْرٍ\" اوْ كَـ\"مِئَةٍ\" مُخْبِرُ ذَا … وَانْصِبْ مُمَيِّزَيْ \"كَأَيٍّ\" وَ\"كَذَا\" (2)  الحِكَايَةُ 474. مَا لِلمُنَكَّرِ بِـ\"أَيٍّ\" احْكِ إِنْ … تَسَلْ بِهَا عَنْهُ وَفِي الوَقْفِ عَنّْ (3) 475. وَالنُّونَ أَشْبِعْ وَ\"مَنَانِ\" إِنْ تُثَنّْ … \"مَنَيْنِ\"، \"مَنْتَانِ\"، \"مَنَهْ\" المُفْرَدُ (4) عَنّْ 476. \"مَنَاتُ\" مَعْ \"مَنِينَ\" إِنْ جَمْعٌ عُنِي … \"مَنُونَ\" نُونَ مَا مَضَى فَسَكِّنِ 477. وَإِنْ تَصِلْ فَلَفْظُ \"مَنْ\" لَا يَخْتَلِفْ … وَاحْكِ بِهَا الأَعْلَامَ إِنْ لَمْ تَنْعَطِفْ  التَّأْنِيثُ 478. أَلِفٌ اوْ تًا سِمَةُ التَّأْنِيثِ، فِي … أَسْمَا انْوِ تَاءً، وَبِمُضْمَرِ اعْرِفِ 479. وَالرَّدِّ فِي التَّصْغِيرِ وَالإِخْبَارِ … وَالحَالِ وَالنَّعْتِ وَبِالمُشَارِ 480. وَلَا يَلِي \"فَعُولًا\" اصْلًا \"مِفْعَلَا\" … \"مِفْعَالَ\"، \"مِفْعِيلًا\" وَشَذَّ مَا تَلَا 481. وَغَالِبًا تُمْنَعُ مِنْ \"فَعِيلِ\" … تَابِعًا المَوْصُوفَ كَـ\"القَتِيلِ\" 482. وَأَلِفٌ قَصْرٌ وَمَدُّ الاُولَى … كَـ\"مَرَطَى\" وَ\"أُرَبَى\" وَ\"الطُّولَى\" 483. وَوَزْنُ \"فَعْلَى\"، \"سُمَّهَى\"، \"حُبَارَى\" … \"ذِكْرَى\"، \"سِبَطْرَى\" المَشْيِ وَ\"الشُّقَّارَى\"",
    "foot_note": "1. كذا في المخطوط، قال في الهمع: \"وأما \"كأيِّنْ\" فكتبت بالنون قولا واحدًا\". انظر: همع الهوامع 3\\ 502. \n2. لأبي حيان كتاب خصصه لـ\"كذا\" اسمه \"الشذا في مسألة كذا\"، شرحه ابن هشام في كتاب سماه \"فوح الشذل بمسألة كذا، نقلها السيوطي في الأشباه والنظائر. انظر: الأشباه والنظائر: 4\\ 281. \n3. كذا في المخطوط ولعله غير متزن. \n4. لا يتزن.",
    "book_id": "105",
    "new_page_number": 70
  },
  {
    "serial_number": "6606290",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 75,
    "volume_number": 1,
    "text": "484. وَوَزْنُ \"فِعِّيلَى\"، \"فُعُلَّا\"، \"فَوْعَلَى\" … وَوَزْنُ \"فُعَّيْلَى\" وَوَزْنُ \"فَعْلَلَى\" 485. وَزَادَ فِي كَافِيَةٍ (1) أَشْيَا أُخَرْ … ذَاتَ اشْتِهَارٍ وَسِوَى هَذِي نَدَرْ 486. لِلمَدِّ \"فَعْلَاءُ\" وَمُطْلَقُ \"افْعِلَا\" … عَيْنًا وَ\"فَعْلَلَا\"، \"فِعَالَا\"، \"فُعْلُلَا\" 487. وَ\"فَعْلِيَاءُ\"، \"فَاعِلَا\"، \"فَاعُولَا\" … وَ\"فَعَلَا\" مُطْلَقَ فًا \"مَفْعُولَا\" 488. وَمُطْلَقَ العَيْنِ \"فَعَالَا\" وَذَكَرْ … فِي الأَصْلِ (2) أَوْزَانًا جَمِيعُهَا اشْتَهَرْ  المَقْصُورُ وَالمَمْدُودُ 489. ذُو صِحَّةٍ مِنْ قَبْلِ طَرْفِهِ انْفَتَحْ … نَظِيرُهُ المُعْتَلُّ قَصْرُهُ اتَّضَحْ 490. كَـ\"فِعَلٍ\" وَ\"فُعَلٍ\" جَمْعًا عُرِفْ … لِـ\"فِعْلَةٍ\" وَ\"فُعْلَةٍ\" وَذُو أَلِفْ 491. مِنْ قَبْلِ طَرْفِهِ نَظِيرَهُ امْدُدِ … كَمَصْدَرٍ بِهَمْزِ وَصْلٍ ابْتُدِي 492. وَالعَادِمُ النَّظِيرِ ذُو قَصْرٍ وَمَدّْ … بِالنَّقْلِ وَاقْصُرْ لِاضْطِرَارٍ المُمَدّْ  كَيْفِيَّةُ تَثْنِيَةِ المَقْصُورِ وَالمَمْدُودِ وَجَمْعِهِمَا تَصْحِيحًا 493. آخِرَ مَقْصُورٍ تُثَنِّي عُدِمَا … ثَلَاثَةً أَوْ أَصْلُهُ اليَا اقْلِبْهُ يَا 494. كَالجَامِدِ المُمَالِ وَاقْلِبِ الأَلِفْ … بِغَيْرِ ذَا وَاوًا وَ\"صَحْرَاءُ\" أُلِفْ 495. بِالوَاوِ وَاللَّذْ كَـ\"حَيَا\"، \"عِلْبَا\" خُذَا … بِوَاوٍ اوْ هَمْزٍ وَصَحِّحْ غَيْرَ ذَا 496. وَآخِرَ المَقْصُورِ فِي الجَمْعِ احْذِفِ … وَالفَتْحَ أَبْقِ وَبِتًا وَأَلِف 497. إِنْ جُمِعَا فَالهَمْزَةَ اقْلِبْ وَالأَلِفْ … كَمَا تُثَنِّيهِ وَتَا ذِي التَّا حُذِفْ 498. وَالعَيْنُ صَحَّ سَاكِنًا فِي اسْمٍ عَلَى … ثَلَاثَةٍ مُؤَنَّثٍ وَلَو خَلَا 499. يَتْبَعُ فًا فِي شَكْلِهِ وَسَاكِنِ … تَالِي سِوَى الفَتْحِ أَوِ افْتَحْ يَهِنِ 500. وَ\"ذِرْوَةً\"، \"وَ\"زُبْيَةً\" لَا تُتْبِعَا … وَغَيْرُ مَا قُدِّمَ شَذَّ فَاسْمَعَا",
    "foot_note": "1. انظر: شرح الكافية الشافية 4\\ 1745 - 1746. \n2. يقصد بالأصل الألفية.",
    "book_id": "105",
    "new_page_number": 71
  },
  {
    "serial_number": "6606291",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 76,
    "volume_number": 1,
    "text": "جَمْعُ التَّكْسِيرِ 501. لِقِلَّةٍ: \"أَفْعِلَةٌ\"، \"أَفْعُلُ\" ثُمّْ … \"فِعْلَةٌ\"، \"افْعَالٌ\" أَوِ الكَثْرَةَ أُمّْ 502. بِهَا كَعَكْسِ ذَا لـ\"فَعْلِ\" اسْمًا يَصِحّْ … عَيْنًا وَذِي أَرْبَعٍ اسْمًا إِنْ يَضِحْ 503. مِثْلَ \"العَنَاقِ\" وَ\"الذِّرَاعِ\"، \"أَفْعُلُ\" … وَذُو ثَلَاثٍ مَا لَهُ ذَا يُجْعَلُ 504. \"أَفْعَالُ\" وَالغَالِبُ \"فِعْلَانُ\" أُثِرْ … لِـ\"فُعَلٍ\" وَلِاسْمِ أَرْبَعٍ ذَكَرْ 505. \"أَفْعِلَةٌ\" إِنْ مُدَّ ثَالِثٌ وَفِي … \"فَعَالِ\" أَوْ \"فِعَالِ\" مَعْ تَضَعُّفِ 506. أَوْ عِلَّةٍ خُذْ وَلِـ\"فَعْلَا أَفْعَلِ\" … \"فُعْلٌ\" وَ\"فِعْلَةٌ\" يَجِيءُ فَانَقِلِ 507. لِاسْمٍ رُبَاعٍ صَحَّ لَامًا زِيدَ مَدّْ … ثَالِثِهِ وَلَمْ يُضَاعَفْ إِذْ وَرَدْ 508. بِأَلِفٍ \"فُعُلٌ\"، اجْعَلْ \"فُعِلَا\" … لِـ\"فُعْلًةٍ\"، \"فُعْلَى\" كَذَا اجْعَلْ \"فِعَلَا\" 509. لِـ\"فِعْلَةٍ\"، وَفِي كَـ\"رَامٍ\": \"فُعَلَهْ\" … مُطَّرِدٌ وَ\"كَامِلٍ\" وَ\"كَمَلَهْ\" 510. وَلِـ\"قَتِيلٍ\"، \"زَمِنٍ\" وَ\"مَيِّتِ\" … وَ\"هَالِكٍ\" وَ\"أَحْمَقٍ\": \"فَعْلَى\" اثْبِتِ 511. لِـ\"فُعْلٍ\" اسْمًا صَحَّ لَامًا \"فِعَلَهْ\" … وَقَلَّ فِي \"فَعْلٍ\"، وَ\"فُعَّلَ\" اجْعَلَهْ 512. لِـ\"فَاعِلٍ\" وَصْفًا وَبِالتَّاءِ اذْكُرِ … وَمِثْلَهُ \"الفُعَّالُ\" فِي المُذَكَّرِ 513. وَفِي مُعَلِّ (1) اللَّامِ قَلَّا وَاحْتِمَا … \"فَعْلٌ\" وَ\"فَعْلَةٌ\": \"فِعَالٌ\" لَهُمَا 514. وَقَلَّ فِي مَا عَيْنُهُ أَوْ فَاهُ يَا … وَ\"فَعَلٌ\" لَهُ \"فِعَالُ\" اسْتُثْنِيَا 514. مُعَلُّ لَامٍ وَمُضَعَّفٌ وَذَا … لِـ\"فُعْلٍ\" او \"فَعَلَةِ\"، \"فِعْلٍ\" خُذَا 516. وَلِـ\"فَعِيلٍ\" وَصْفَ \"فَاعِلٍ\" كَذَا … \"فَعْلَانُ\"، \"فُعْلَانُ\" وَأُنْثَى كُلِّ ذَا 517. وَلِـ\"طَوِيلٍ\" وَ\"فُعُولٍ\" لِـ\"فَعِلْ\" … وَ\"فَعْلٍ\" اسْمًا مُطْلَقَ الفَا وَ\"فَعَلْ\"",
    "foot_note": "1. في المخطوط \"فُعَل\"، ولعل الصواب ما أثبتناه. انظر: ألفية ابن مالك ص 165 البيت 807.",
    "book_id": "105",
    "new_page_number": 72
  },
  {
    "serial_number": "6606292",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 77,
    "volume_number": 1,
    "text": "518. \"فِعْلَانُ\" لِـ\"الفُعَالِ\" مَعْ \"فُعْلٍ\"، \"فَعَلْ\" … مُعْتَلَّيِ العَيْنِ وَفِي سِوَاهُ قَلّْ 519. \"فُعْلَانُ\" لِـ\"الفَعْلِ\" سُمًا \"فَعِيلِ\" … وَ\"فَعَلٍ\" صَحَّا وَلِـ\"البَخِيلِ\" 520. خُذْ \"فُعَلَا\" وَ\"أَفْعِلَاءُ\" فِي المُعَلّْ … لَامًا وَمُضْعَفٍ وَغَيْرُ ذَاكَ قَلّْ 521. \"فَوَاعْلٌ\" لِـ\"فَوْعَلٍ\" وَ\"فَاعِلِ\" … وَ\"فَاعِلَا\" (1) وَ\"حَائِضٍ\" وَ\"كَاهِلِ\" 522. \"فَاعِلَةٍ\" وَ\"صَاهِلٍ\" وَشَذَّ فِي … كَـ\"فَارِسٍ\" وَلِـ\"فَعَالَةٍ\" قُفِي 523. \"فَعَائِلٌ\" وَشِبْهِهِ وَلَوْ حُذِفْ … تًا وَ\"فَعَالِي\" مَعْ \"فَعَالَى\" قَدْ عُرِفْ 524. لِنَحْوِ \"صَحْرَاءَ\" وَعَذَرا\" وَانْتَخِبْ … لِنَحْوِ \"كُرْسِيٍّ\": \"فَعَالِيَّ\" تُصِبْ 525. وَزَائِدُ الثَّلَاثِ غَيْرُ مَا زُكِنْ … لَهُ \"فَعَالِلُ\" وَشِبْهُهِ وَمِنْ 526. ذِي خَمْسَةٍ مُجَرَّدَ الخَتْمِ احْذِفِ … أَوْ أَرْبَعٍ مُشْبِهِ ذِي الزَّيْدِ تَفِ 527. وَزَائِدًا فِيه احْذِفَنْ إِنْ مَا أَتَى … لَيْنًا عَلَى الآخِرِ وَالسِّينَ وَتَا 528. مِنْ نَحْوِ \"مُسْتَدْعٍ\" أَزِلْ وَبِالبَقَا … المَيمُ أَوْلَى أَوْ كَذَا مَا سَبَقَا 529. مِنْ هَمْزٍ اوْ يًا، وَاوَ \"حَيْزَبُونَا\" … أَزِلْ، \"سَرَنْدَى\" فِيهِ خَيَّرُونَا  التَّصْغِيرُ 530. صَغِّرْ ثُلَاثِيًّا: \"فُعَيْلًا\"، وَالذِي … فَاقَ: \"فُعَيْعِلًا\"، \"فُعَيْعِيلًا\" خُذِ 531. وَمَا بِه وَصَلْتَ لِلجَمْعِ لِذَا … صِلْ، وَقُبَيْلَ آخِرٍ زِدْ يًا إِذَا 532. يُحْذَفُ بَعْضُ الِاسْمِ فِي ذَيْنِ وَمَا … خَالَفَ مَا قُلْنَاهُ نَزْرٌ بِهِمَا 533. مِنْ قَبْلِ تَا تَأْنِيثٍ افْتَحْ تَالِي … لِليَا وَمَدُّ ذَاكَ أَوْ \"أَفْعَالِ\" 534. وَمَدُّ \"سَكْرَانَ\"، وَلَا تُحْذَفُ فِي … ذَا البَابِ تَا الُانْثَى وَمَدُّ الأَلِفِ",
    "foot_note": "1. قصر \"فاعلاء\" ضرورة.",
    "book_id": "105",
    "new_page_number": 73
  },
  {
    "serial_number": "6606293",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 78,
    "volume_number": 1,
    "text": "535. وَالوَسْمُ فِي تَثْنِيَةٍ وَ النَّسَبِ … وَالجَمْعِ وَالعَجْزُ مِنَ المُرَكَّبِ 536. وَمِنْ مُضَافٍ زَيْدُ \"فَعْلَانَ\" اللَّذَا … مِنْ بَعْدِ أَرْبَعٍ وَذَا القَصْرِ إِذَا 537. زَادَ عَلَى أَرْبَعٍ احْذِفْ إِنْ سُبِقْ … بِمَدَّةٍ فَهْوَ بِوَجْهَيْنِ يَحِقّْ 538. وَارْدُدْ لِأَصْلٍ ثَانِيًا لَيْنًا قُلِبْ … عَنْهُ وَذَا لِمُنْتَهَى الجَمْعِ يَجِبْ 539. وَشَذَّ \"أَعْيَادٌ\": \"عُيَيْدٌ\" وَجُعِلْ … الأَلِفُ الثَّانِي مَزِيدًا أَوْ جُهِلْ 540. مَا أَصْلُهُ وَاوًا وَرُدَّ الحَذْفَ فِي … كَـ\"شَفَةٍ\" وَ\"مَا\" وَبِالأَصْلِ اكْتَف 541. تَصْغِيرُ تَرْخِيمٍ وَبِالتَّاءِ خُتِمْ … مُؤَنَّثٌ عَارٍ ثُلَاثِيٌّ فُهِمْ 542. وَشَذَّ تَرْكٌ وَلَحَاقُ غَيْرِ ذِي … ثَلَاثَةٍ كَذَاكَ تَصْغِيرُ \"الذِي\" النَّسَبُ 543. فِي نَسَبٍ زِدْ يًا مُشَدَّدًا كُسِرْ … مَا قَبْلَهَا وَحَذْفُ مِثْلِهَا أُثِرْ 544. وَعَلَمَ التَّأْنِيثِ وَالمَدَّةَ فِي … \"حُبْلَى\" وَ\"مَلْهَى\"، \"أَرْطًى\" اقْلِبْ وَاحْذِفِ 545. وَأَزِلِ الخَامِسَ مِنْ يًا وَأَلِفْ … وَالرَّابِعَ اليَا اقْلِبْ وَالاولَى أَنْ حُذِفْ 546. وَالثَّالِثَ اقْلِبْ لَازِمًا فَفِي \"الفَتَى\" … قُلْ \"فَتَوِي\" وَحَيْثُ قَلْبٌ قَدْ أَتَى 547. فَتْحًا يَلِي مِنْ \"فَعِلِ\" العَيْنُ انَفْتَحْ … وَ\"فُعِلٍ\" وَ\"فِعِلٍ\" وَفِي الأَصَحّْ 548. \"مَرْمِيُّ\" فِي \"المَرْمِي\" وَقِيلَ \"مَرْمَوِي\" … وَهْوَ المَثِيلُ، وَبِـ\"حَيٍّ\": \"حَيَوِي\" 549. وَعَلَمُ التَّثْنِيَةِ الجَمْعِ (1) نُبِذْ … وَيَاءُ \"طَيِّبٍ\" وَ\"طَائِيٍّ\" يَشِذْ 550. وَ\"فَعَلِيٌّ\" فِي \"فَعِيلَةٍ\" وَفِي … \"فُعَيْلَةٍ\" قُلْ \"فُعَلِي\" وَلَوْ نُفِي 551. تًا وَأُعِلَّ اللَّامُ وَاعْطِهْ مَا تُرَدّْ … \"طَوِيلَةٌ\"، \"جَلِيلَةٌ\" وَهَمْزُ مَدّْ",
    "foot_note": "1. أي والجمع.",
    "book_id": "105",
    "new_page_number": 74
  },
  {
    "serial_number": "6606294",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 79,
    "volume_number": 1,
    "text": "552. هُنَا (1) وَفِي تَثْنِيَةٍ فِي نَهْجِ … وَانْسُبْ لِصَدْرَيْ جُمْلَةٍ وَمَزْجِ 553. وَلِلذِي لَهُ أُضِيفَ \"ابْنٌ\" وَ\"أَبْ\" … أَوْ عُرِّفَ الأَوَّلُ غَيْرُ ذَا انْتَسَبْ 554. لِأَوَّلٍ إِنْ لَمْ يُخَفْ لَبْسٌ وَفِي … ذَا نَظَرٌ أَوْدَعْتُهُ الشَّرْحَ الوَفِي (2) 555. وَرُدَّ حَتْمًا حَذْفُ لَامٍ إِنْ تُرَدّْ … فِي جَمْعٍ اوْ تَثْنِيَةٍ وَجَازَ رَدّْ 556. إِنْ لَمْ تُرَدَّ فِيهِمَا وَالتَّا احْذِفِ … مِنْ \"بِنْتٍ\"، \"اخْتٍ\" وَلِذِكْرِهَا اصْطَفِ 557. ثَانِي ثُنَائِيٍّ بِلَيْنٍ ضَعِّفِ … و\"شِيَةَ\" اجْبُرْ وَافْتَحِ العَيْنَ تَفِ 558. وَانْسُبْ لِجَمْعٍ فَبِوَاحِدِ ارْتُضِي … إِنْ لَمْ يُصَيَّرْ عَلَمًا كَـ\"الفَرَضِي\" 559. عَن يَا اغْنَ بِـ\"الفَاعِلِ\"، \"فَعَّالِ\"، \"فَعِلْ\" … فِي نَسَبٍ وَغَيْرُ سَالِفٍ نُقِلْ  الوَقْفُ 560. تَنْوِينًا اثْرَ فَتْحٍ اجْعَلْ أَلِفَا … وَقْفًا كَذَا \"إِذَنْ\" وَغَيْرَ ذَا احْذِفَا 561. كَصِلَةِ المُضْمَرِ لَا فِي الفَتْحِ ذَا … فِي يَاءِ مَنْقُوصٍ مُنَوَّنٍ إِذَا 562. لَمْ يُنْصَبَ اوْلَى عَكْسُهُ ذُو \"أَلْ\" وَفِي … نَحْوِ \"مُرِ\" اليَا رُدَّ حَتْمًا وَيَفِي 563. وَغَيْرَهَا مُحَرَّكًا سَكِّنْ وَرُمْ … تَحْرِيكَهُ أَوَ اشْمِمِ الذِي يُضَمّْ 564. أَوْ غَيْرَ هَمْزٍ وَعَلِيلٍ شَدِّدَنْ … بَعْدَ مُحَرَّكٍ وَلِلذِي سَكَنْ 565. وَجَازَ إِنْ حُرِّكَ تَحْرِيكٌ نُقِلْ … وَمِنْ سِوَى المَهْمُوزِ فَتْحٌ مَا انْتُخِلْ 566. وَامْنَعْهْ إِنْ يُعْدَمْ نَظِيرُ مَا خَلا … ذَا الهَمْزِ، تَا تَأْنِيثِ الِاسْمِ هَا اجْعَلَا 567. وَقْفًا إِذَا لَمْ يَتْلُ سَاكِنًا يَصِحّْ … فِي جَمْعِ تَصْحِيحٍ وَشِبْه مَا رُجِحْ",
    "foot_note": "1. أي في النسب. \n2. يقصد أنه -السيوطي- قد اعترض على ابن مالك، وذلك في شرح السيوطي على ألفية ابن مالك المسمى البهجة المرضية، أو النهجة المرضية. انظر: البهجة المرضية 499",
    "book_id": "105",
    "new_page_number": 75
  },
  {
    "serial_number": "6606295",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 80,
    "volume_number": 1,
    "text": "568. وَقِفْ بِهَا السَّكْتِ عَلَى فِعْلٍ حُذِفْ … آخِرُهُ فِي \"عِهْ، \"يَعِهْ\" حَتْمًا أُلِفْ 569. وَ\"مَا\" لِلِاسْتِفْهَامِ مَجْرُورٌ كَذَا … وَالْزَمْ إِذَا جُرَّتْ بِالِاسْمِ وَشَذَا (1) 570. إِيصَالُهَا بِذِي بِنَاءٍ لَزِمَا … مُحَرَّكٍ، وَالوَصْلُ كَالوَقْفِ انْتَمَى  الإِمَالَةُ 571. الأَلِفَ الآخِرَ عَنْ يَا أَوْ جُعِلْ … يَاءً بِلَا شُذُوذٍ اوْ زِيدَ أَمِلْ 572. وَأَلِفًا يَلِيهِ هَا التَّأْنِيثِ مَعْ … بَدَلِ عَيْنٍ مَا كَمَاضِي لِـ\"يُبَعْ\" 573. وَتَالِ يَاءٍ أَوْ بِحَرْفٍ فُصِلَا … أَوْ مَعَ هًا أَوْ قَبْلَ كَسْرٍ أَوْ تَلَا 574. تَالِيَ كَسْرٍ أَوْ سُكُونٍ ذَا وَلِي … أَوْ مَعَ هًا، وَالرَّاءُ وَالحَرْفُ العَلِي (2) 575. لِمُظْهَرَيْ كَسْرٍ وَيًا كَفَّا وَلِي … حَرْفٌ عَلِيٌّ وَكَذَا إِنْ يُفْصَلِ 576. بِحَرْفٍ اوْ حَرْفَيْنِ أَوْ قَبْلُ إِذَا … لَمْ يَنْكَسِرْ أَوْ لَمْ يُسَكَّنْ إِثْرَ ذَا 577. وَكَفَّ كَفًّا كَسْرُ رًا وَلَا تُمِلْ … لِسَبَب فُصِلْ وَكَفَّ مَا فُصِلْ 578. وَلِتَنَاسُبٍ أَمِلْ \"تَلَاهَا\" (3) … لا ذَا البِنَاءِ غَيْرَ \"نَا\" وَلَا \"هَا\" 579. وَالفَتْحَ قَبْلَ كَسْرِ رَا فِي طَرَفِ … أَمِلْ وَفِي كَـ\"رَحْمَةٍ\" إِنْ تَقِفِ  التَّصْرِيفُ 580. غَيْرَ حُرُوفٍ وَشَبِيهٍ صَرِّفِ … وَغَيْرَ ذِي اثْنَيْنِ إِذَا لَمْ يُحْذَفِ 581. نِهَايَةُ اسْمٍ لَمْ يَزِدْ خَمْسًا، وَعَمّْ … ذَا الزَّيْدِ سَبْعًا، وَافْتَحَنْ وَاكْسِرْ وَضُمّْ 582. غَيْرَ أَخِيرٍ ذِي ثَلَاثٍ وَسَكَنْ … ثَانٍ، وَأَهْمِلْ \"فِعُلًا\" كَذَا اعْكِسَنْ",
    "foot_note": "1. مخفف من \"شَذَّ\" ضرورة. \n2. أي الحرف المستعلي. \n3. يشير إلى قوله تعالى: \"والشمس وضحاها والقمر إذا تلاها\". الشمس 1 - 2.",
    "book_id": "105",
    "new_page_number": 76
  },
  {
    "serial_number": "6606296",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 81,
    "volume_number": 1,
    "text": "583. لِأَرْبَعٍ مُجَرَّدَ الفِعْلِ اذْكُرِ … ذُو الزَّيْدِ سِتٌّ وَافْتَحِ اضْمُمْ وَاكْسِرِ 584. ثَانِي ثُلَاثِيٍّ وَزِيدَ \"فُعِلَ\" … لِاسْمٍ مُجَرَّدٍ رُبَاعٍ \"فَعْلَلَا\" 585. وَ\"فِعْلِلاً\" وَ\"فِعْلَلًا\" وَ\"فُعْلُلَا\" … وَ\"فُعْلَلًا\"، \"فِعَلَّ\"، وَالذِي عَلَا 586. \"فُعَلَّلٌ\"، \"فَعْلَلِلٌ\"، \"فُعَلِّلُ\" … \"فِعْلَلُّ\"، مَا خَالَفَ ذَا يُؤَوَّلُ 587. وَالأَصْلُ حَرْفٌ لَازِمٌ وَالغَيْرُ لَا … فِي الوَزْنِ ضَمِّنْ \"فَعَلَ\" اصْلًا قَابِلَا 588. وَزَائِدًا بِاللَّفْظِ زِنْ وَكَرِّرِ … لَامًا إِذَا أَصْلٌ بَقِي كَـ\"جَعْفَرِ\" 589. وَزَائِدًا كَالأَصْلِ زِنْ كَمَا أُصِلْ … وَ\"سِمْسِمٌ\" وَ\"لَمْلَمَ\" الكُلُّ أُصِلْ  هَمْزُ الوَصْلِ 590. فِي البَدْءِ زِدْ لِلوَصْلِ هَمْزًا سَابِقَا … فِي المَاضِ وَالمَصْدَرِ مِنْهُ فَائِقَا 591. أَرْبَعَةً وَأَمْرِهِ وَأَمْرِ ذِي … ثَلَاثَةٍ وَفِي \"اسْمٍ\"، \"اسْتٍ\" احْتُذِي 592. وَ\"ابْنِ\"، \"ابْنُمِ\"، \"اثْنَيْنِ\" مَعَ \"امْرِئٍ\" وَفِي … تَأْنِيثِهَا وَ\"أَيْمُنُ\" النَّقْلُ قُفِي 593. وَ\"أَلْ\" وَفِي اسْتِفْهَامٍ ابْدِلْ مَدًّا اوْ … سَهِّلْ \"أَلِ\" اسْمًا \"أَيْمُ\"، \"إِمْ\"، أَمُ\" حَكَوْا  الإِبْدَالُ 594. أَحْرُفُ الِابْدَالِ \"هَدَأْتَ مُوطِيَا\" … فَأَبْدِلِ الهَمْزَةَ مِنْ وَاوٍ وَيَا 595. آخِرًا اثْرَ أَلِفٍ زِيدَ وَذَا … فِي \"فَاعِلِ\" المُعَلِّ عَيْنًا وَخُذَا 596. مَزِيدَ كَـ\"العَجَائِزِ\"، \"الصَّحَائِفِ\" … وَثَانِ لَيْنَيْنِ بِكَـ\"النَّيَايِفِ\" 597. وَهَمْزَ ذَا افْتَحْ وَارْدُدَنْ يًا فِي المُعَلّْ … لَامًا وَوَاوًا فِي \"هَرَاوَى\" (1) لِلثِّقَلْ 598. وَهَمْزًا ابْدِلْ أَوَّلَ الوَاوَيْنِ فِي … بَدْءٍ سِوَى \"وُوفِي\" وَمَدًّا اقْتُفِي",
    "foot_note": "1. في المخطوط \"هواي\" ولعل الصواب ما أثبتناه. انظر: الألفية ص 181 البيت 947.",
    "book_id": "105",
    "new_page_number": 77
  },
  {
    "serial_number": "6606297",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 82,
    "volume_number": 1,
    "text": "599. عَنْ ثَانِ هَمْزَيْنِ بِكِلْمَةٍ سَكَنْ … إِنْ يُفْتَحَ اثْرَ ضَمٍّ اوْ فَتْحٍ خُذَنْ 600. وَوَاوٌ اثْرَ الكَسْرِ يًا وَإِنْ كُسِرْ … فَاليَاءُ مُطْلَقًا وَإِنْ ضَمٌّ أَصِرْ 601. وَاوًا كَمِنْ \"أَمَّ\"، \"أَؤُمُّ\" وَاطَّرَدْ … تَثْلِيثُ فًا لَا مَا أَخِيرًا قَدْ وُرَدْ 602. فَاليَاءُ مُطْلَقًا وَصَحِّحْ أَوْ قُلِبْ … نَحْوُ \"أَؤُمْ\" وَأَلفًا يًا يَنْقَلِبْ 603. تَالِيَ كَسْرَةٍ وَيَا التَّصْغِيرِ ذَا … فِي الوَاوِ آخِرًا وَقَبْلَ تًا خُذَا 604. وَفِي \"شَجِيَّةٍ\" وَ\"غَزْيَانَ\" وَفِي … نَحْوِ \"صِيَامٍ\" وَ\"ثِيَابٍ\" ذَا قُفِي 605. وَ\"المُعْطَيَانِ يُرْضَيَانِ فِي الحِيَلْ\" … ذَا رَجَّحُوا أَوْ صَحَّحُوا فِي كَـ\"الحِوَلْ\" 606. وَ\"كِوَزَهْ\" وَالأَلِفَ اقْلِبْ بَعْدَ ضَمّْ … وَالوَاوُ ذَا لِليَا بِـ\"مُوقِنٍ\" أَعَمّْ 607. كَاليَاِءِ لَامُ فِعْلٍ اوْ مِنْ قَبْلِ تَا … أَوْ فِي كَمِثْلِ \"سَبُعَانَ\" وَاللَّتَا 608. فِي جَمْعِ \"أَبْيَضَ\" ابْق وَ\"الغُرَّ\" اكْسِرِ … فِي عَيْنِ \"فُعْلَى\" الوَصْفِ وَجْهَيْنِ اذْكُرِ 609. فِي لَامِ \"فَعْلَى\" الِاسْمِ ذَا القَلْبُ غَلَبْ … وَلَامُ \"فُعْلَى\" الوَصْفُ بِالعَكْسِ انْقَلَبْ 610. وَالسَّاكِنَ السَّابِقَ مِنْ مُتَّصِلِ … وَاوٍ وَيًا بِلَا عُرُوضٍ اقْلِبْ أَيْ 611. الوَاوَ يًا وَادْغِمْ وَأَبْدِلِ أَلِفَا … مِنْ يَاءٍ اوْ وَاوٍ لِفَتْحٍ اقْتَفَى 612. إِنْ حُرِّكَا وَحُرِّكَ الذِي تَلَا … وَصَحِّحْ انْ يَسْكُنْ سِوَى اللَّامِ فَلَا 613. مَا لَمْ يَكُنْ تَابِعُهَا يًا شُدِّدَا … أَوْ أَلِفًا وَصَحَّ مَاضِي \"أَغْيَدَا\" 614. وَأَصْلُهُ وَالوَاوُ عَيْنٌ لِـ\"افْتَعَلْ\" … مَعَنَى \"تَفَاعُلٍ\" أَبَانَ لَمْ تُعَلّْ 615. ثَانٍ أُعِلَّ إِنْ لِحَرْفَيْنِ اسْتُحِقّْ … هَذَا وَعَيْنُ مَا أَخِيرُهُ لَحِقْ 616. مَا خَصَّ الِاسْمَ صَحِّحَنْ، وَالنُونَ ذَا … سَكُونِ مِيمًا قَبْلَ يَا اقْلِبْ كَـ\"انْبِذَا\" 617. مِنْ عَيْنِ فِعْلٍ لَا تَعَجُّبٍ وَلَا … مُضَاعَفٍ وَنَحْوِ \"\"أَهْوَى\" فَانْقِلَا 618. تَحْرِيكَهُ لِسَاكِنٍ صَحَّ وَمِنْ … اِسْمٍ كَفِعْلٍ مَعَ وَسْمٍ قَدْ زُكِنْ",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 78
  },
  {
    "serial_number": "6606298",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 83,
    "volume_number": 1,
    "text": "619. وَ\"المِفْعَلَ\"، \"المِفْعَالَ\" (1) صَحِّحْ وَأَلِفْ … \"إِفْعَالِ\"، \"الِاسْتِفْعَالِ\" لِلنَّقْلِ حُذِفْ 620. كَوَاوِ \"مَفْعُولٍ\" وَقَدْ يُصَحَّحُ … ذُو اليَا وَفِي ذِي الوَاوِ ذَا لَا يَرْجَحُ 621. وَجَوَّدُوا تَصْحِيحَ مَفْعُولِ \"عَدَا\" … كَذَا \"فُعُولٌ\" لَامُهُ وَاوٌ بَدَا 622. فًا لِـ\"افْتِعَالِ\" اللَّيْنِ تًا أَبْدِلْ وَشَذّْ … فِي الهَمْزِ وَالتَّا فِي افْتِعَالِ \"تَتَّخِذْ\" 623. طًا إِثْرَ مُطْبِقٍ وَذَا لَا فِي \"ازْدَدِ\" … وَ\"ادَّكِرِ\"، \"ادَّانَ\" وَفِي \"يَعِدْ\"، \"عِدِ\" 624. وَ\"عِدَةٍ\" تُحْذَفُ فًا وَالهَمْزُ مِنْ … \"أَفْعَلَ\" وَالوَصْفَيْنِ بِالحَذْفِ قَمِنْ 625. وَفِي مُضَارِعٍ، وَ\"ظَلْتُ ظِلْتُ\" فِي … \"ظَلِلْتُ\" قُلْ وَ\"قِرْنَ\" فِي \"اقْرِرْنَ\" قُفِي  الإِدْغَامُ 626. أَوَّلَ مِثْلَيْنِ مُحَرَّكَيْنِ فِي … كِلْمَةٍ ادْغِمْ لَا \"دَدَنْ\" وَ\"صُفَفِ\" 627. وَ\"ذُلُلٍ\" وَ\"لَبَبٍ\" وَ\"كِلَلٍ\" … وَ\"جُسَّسٍ\"، \"هَيْلَلَ\" وَالفَكَّ انْقِلِ 628. وَ\"حَيِيَ\" افْكُكْ وَادَّغِمْ مَعَ \"اسْتَتَرْ\" … وَ\"تَتَجَلَّى\" وَبِتَاءٍ ذَا اسْتَقَرّْ 629. وَفُكَّ إِذْ يَسْكُنُ قَبْلَ مُضْمَرِ … رَفْعٍ وَفِي جَزْمٍ وَشِبْه خَيِّرِ 630. وَفُكَّ \"أَفْعِلِ\" التَّعَجُّبِيَّهْ … عَكْسَ \"هَلُمّْ\"، وَتَمَّتِ الوَفِيَّهْ 631. فَأَحْمَدُ اللهَ مُصَلِّيًا عَلَى … مُحَمَّدٍ وَآلِهِ وَمَنْ تَلَا 632. نَظَمْتُهَا فِي نَحْوِ ثُلْثَيْ أَصْلِهَا … وَلَنْ تَرَى مُخْتَصَرًا كَمِثْلِهَا 633. خَتَمْتُهَا بِظَهْرِ بَحْرِ القَلْزَمِ … مُسَافِرًا لِلبَلَدِ المُحَرَّمِ 634. وَفِي رَبِيعٍ لَاحَ زَهْرُ نَظْمِهَا … وَفِي جُمَادَى فَاحَ مِسْكُ خَتْمِهَا 635. مِنْ عَامِ تِسْعَةٍ وَسِتِّينَ التِي … بَعْدَ ثَمَانِمِئَةٍ لِلهِجْرَةِ",
    "foot_note": "1. في المخطوط \"والفعال\" ولعل الصواب ما أثبتناه. انظر: الألفية ص 185 البيت 979.",
    "book_id": "105",
    "new_page_number": 79
  },
  {
    "serial_number": "6606299",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 84,
    "volume_number": 1,
    "text": "وَكَتَبَ مُحَمَّدُ بْنُ عَلِيٍّ الدَّاوُدِيُّ فِي مَجْلِسَيْنِ آخِرُهُمَا يَوْمَ السَّبْتِ سَادِسَ جُمَادَى الأُولَى مِنْ سَنَةِ ثَلَاثٍ وَتِسْعِمِئَةٍ خُتِمَتْ بِخَيْرٍ.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 80
  },
  {
    "serial_number": "6606300",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 85,
    "volume_number": 1,
    "text": "المصادر والمراجع 1. أسرار العربية، عبد الرحمن بن محمد بن عبيد الله الأنصاري، أبو البركات، كمال الدين الأنباري 577 هـ، دار الأرقم بن أبي الأرقم، الطبعة الأولى 1420 هـ- 1999 م. 2. الأشباه والنظائر في النحو، عبد الرحمن بن أبي بكر، جلال الدين السيوطي 911 هـ، عبد الإله نبهان - غازي مختار طليمات - إبراهيم محمد عبد الله - أحمد مختار الشريف، مجمع اللغة العربية بدمشق، سنة النشر 1407 هـ - 1987 م. 3. الأصمعيات، الأصمعي أبو سعيد عبد الملك بن قريب بن علي بن أصمع 216 هـ، أحمد محمد شاكر - عبد السلام محمد هارون، دار المعارف - مصر، الطبعة السابعة، 1993 م. 4. الأصول في النحو، أبو بكر محمد بن السري بن سهل النحوي المعروف بابن السراج 316 هـ، عبد الحسين الفتلي، مؤسسة الرسالة، لبنان - بيروت. 5. الأضداد، أبو بكر، محمد بن القاسم بن محمد بن بشار بن الحسن بن بيان بن سماعة بن فَروة بن قَطَن بن دعامة الأنباري 328 هـ، محمد أبو الفضل إبراهيم، المكتبة العصرية، بيروت - لبنان، عام النشر 1407 هـ - 1987 م. 6. إعراب القرآن، أبو جعفر النَّحَّاس أحمد بن محمد بن إسماعيل بن يونس المرادي النحوي 338 هـ، عبد المنعم خليل إبراهيم، منشورات محمد علي بيضون، دار الكتب العلمية، بيروت، الطبعة الأولى، 1421 هـ. 7. آكام المرجان في أحكام الجان، محمد بن عبد الله الشبلي الدمشقيّ الحنفي، أبو عبد الله، بدر الدين ابن تقي الدين 769 هـ، إبراهيم محمد الجمل، مكتبة القرآن - مصر - القاهرة.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 81
  },
  {
    "serial_number": "6606301",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 86,
    "volume_number": 1,
    "text": "8. ألفية ابن مالك، محمد بن عبد الله، ابن مالك الطائي الجياني، أبو عبد الله، جمال الدين 672 هـ، عبد اللطيف الخطيب، مكتبة دار العروبة للنشر والتوزيع في الكويت. 9. الأم، الشافعي أبو عبد الله محمد بن إدريس بن العباس بن عثمان بن شافع بن عبد المطلب بن عبد مناف المطلبي القرشي المكي 204 هـ، دار المعرفة - بيروت، الطبعة بدون طبعة، سنة النشر 1410 هـ/1990 م. 10. أمالي ابن الشجري، ضياء الدين أبو السعادات هبة الله بن علي بن حمزة، المعروف بابن الشجري 542 هـ، الدكتور محمود محمد الطناحي، مكتبة الخانجي، القاهرة، الطبعة الأولى، 1413 هـ - 1991 م. 11. الانتصار لسيبويه على المبرد، أبو العباس، أحمد بن محمد بن ولاد التميمي النحوي 332 هـ، د. زهير عبد المحسن سلطان، مؤسسة الرسالة، الطبعة الأولى، 1416 هـ - 1996 م. 12. الإنصاف في مسائل الخلاف بين النحويين البصريين والكوفيين، عبد الرحمن بن محمد بن عبيد الله الأنصاري، أبو البركات، كمال الدين الأنباري 577 هـ، المكتبة العصرية، الطبعة الأولى 1424 هـ- 2003 م. 13. أوضح المسالك إلى ألفية ابن مالك، عبد الله بن يوسف بن أحمد بن عبد الله ابن يوسف، أبو محمد، جمال الدين، ابن هشام 761 هـ، يوسف الشيخ محمد البقاعي، دار الفكر للطباعة والنشر والتوزيع. 14. الإيضاح العضدي، أبو علي الفارسيّ 377 هـ، د. حسن شاذلي فرهود، الطبعة الأولى، 1389 هـ - 1969 م.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 82
  },
  {
    "serial_number": "6606302",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 87,
    "volume_number": 1,
    "text": "15. البحر المحيط في التفسير، أبو حيان محمد بن يوسف بن علي بن يوسف بن حيان أثير الدين الأندلسي 745 هـ، صدقي محمد جميل، دار الفكر - بيروت، الطبعة 1420 هـ. 16. بغية الوعاة في طبقات اللغويين والنحاة، عبد الرحمن بن أبي بكر، جلال الدين السيوطي 911 هـ، محمد أبو الفضل إبراهيم، المكتبة العصرية - لبنان / صيدا. 17. البهجة المرضية، عبد الرحمن بن أبي بكر، جلال الدين السيوطي 911 هـ، محمد صالح بن أحمد الغرسي، دار السلام، الطبعة الأولى 2000 م. 18. تاج العروس من جواهر القاموس، محمّد بن محمّد بن عبد الرزّاق الحسيني، أبو الفيض، الملقّب بمرتضى، الزَّبيدي 1205 هـ، مجموعة من المحققين، دار الهداية. 19. تاريخ ابن الوردي، عمر بن مظفر بن عمر بن محمد ابن أبي الفوارس، أبو حفص، زين الدين ابن الوردي المعري الكندي 749 هـ، دار الكتب العلمية - لبنان / بيروت، الطبعة الأولى، 1417 هـ - 1996 م. 20. تاريخ الإسلام وَوَفيات المشاهير وَالأعلام، شمس الدين أبو عبد الله محمد بن أحمد بن عثمان بن قَايْماز الذهبي 748 هـ، الدكتور بشار عوّاد معروف، دار الغرب الإسلامي، الطبعة الأولى، 2003 م. 21. التبيان في إعراب القرآن، أبو البقاء عبد الله بن الحسين بن عبد الله العكبري 616 هـ، علي محمد البجاوي، عيسى البابي الحلبي وشركاه. 22. التحدث بنعمة الله، عبد الرحمن بن أبي بكر، جلال الدين السيوطي 911 هـ، اليزابث ماري سارتين، المطبعة العربية الحديثة.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 83
  },
  {
    "serial_number": "6606303",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 88,
    "volume_number": 1,
    "text": "23. تخليص الشواهد وتلخيص الفوائد، جمال الدين أبو محمد عبد الله بن يوسف بن هشام الأنصاري 761 هـ، د. عباس مصطفى الصالحي، دار الكتاب العربي، الطبعة الأولى، 1406 هـ - 1986 م. 24. التذييل والتكميل في شرح كتاب التسهيل، أبو حيان الأندلسي 745 هـ، د. حسن هنداوي، دار القلم - دمشق ودار كنوز إشبيليا، الطبعة الأولى. 25. تسهيل الفوائد وتكميل المقاصد، محمد بن عبد الله، ابن مالك الطائي الجياني، أبو عبد الله، جمال الدين 672 هـ، محمد كامل بركات، دار الكتاب العربي للطباعة والنشر، سنة النشر 1387 هـ - 1967 م. 26. تعليق الفرائد على تسهيل الفوائد، محمد بدر الدين بن أبي بكر بن عمر الدماميني 827 هـ، الدكتور محمد بن عبد الرحمن بن محمد المفدى، الطبعة الأولى، 1403 هـ - 1983 م. 27. التعليقة على كتاب سيبويه، الحسن بن أحمد بن عبد الغفار الفارسيّ الأصل، أبو علي 377 هـ، د. عوض بن حمد القوزي، الطبعة الأولى، 1410 هـ - 1990 م. 28. التمهيد لما في الموطأ من المعاني والأسانيد، أبو عمر يوسف بن عبد الله بن محمد بن عبد البر بن عاصم النمري القرطبي 463 هـ، مصطفى بن أحمد العلوي ، محمد عبد الكبير البكري، وزارة عموم الأوقاف والشؤون الإسلامية - المغرب، عام النشر 1387 هـ. 29. توجيه اللمع، أحمد بن الحسين بن الخباز 639 هـ، أ. د. فايز زكي محمد دياب، دار السلام للطباعة والنشر والتوزيع والترجمة - جمهورية مصر العربية، الطبعة الثانية، 1428 هـ - 2007 م.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 84
  },
  {
    "serial_number": "6606304",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 89,
    "volume_number": 1,
    "text": "30. الجامع الصحيح، محمد بن إسماعيل أبو عبدالله البخاري الجعفي، د. مصطفى ديب البغا، دار ابن كثير، اليمامة - بيروت، الطبعة الثالثة، 1407 - 1987. 31. الجنى الداني في حروف المعاني، أبو محمد بدر الدين حسن بن قاسم بن عبد الله بن عليّ المرادي المصري المالكي 749 هـ، د فخر الدين قباوة - الأستاذ محمد نديم فاضل، دار الكتب العلمية، بيروت - لبنان، الطبعة الأولى، 1413 هـ - 1992 م. 32. حاشية ابن حمدون، ابن حمدون، دار إحياء الكتب العربية، 1955. 33. حاشية الخضري، محمد بن مصطفى بن حسن الخضري الشافعي 1287 هـ، تركي فرحان المصطفى، دار الكتب العلمية، الطبعة الثالثة 2009 م. 34. حروف المعاني والصفات، عبد الرحمن بن إسحاق البغدادي النهاوندي الزجاجي، أبو القاسم 337 هـ، علي توفيق الحمد، مؤسسة الرسالة - بيروت، الطبعة الأولى، 1984 م. 35. حسن المحاضرة في تاريخ مصر والقاهرة، عبد الرحمن بن أبي بكر، جلال الدين السيوطي 911 هـ، محمد أبو الفضل إبراهيم، دار إحياء الكتب العربية - عيسى البابي الحلبي وشركاه - مصر، الطبعة الأولى 1387 هـ - 1967. 36. خزانة الأدب ولب لباب لسان العرب، عبد القادر بن عمر البغدادي 1093 هـ، عبد السلام محمد هارون، مكتبة الخانجي، القاهرة، الطبعة الرابعة، 1418 هـ - 1997 م. 37. الخصائص، أبو الفتح عثمان بن جني الموصلي 392 هـ، الهيئة المصرية العامة للكتاب، الطبعة الرابعة.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 85
  },
  {
    "serial_number": "6606305",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 90,
    "volume_number": 1,
    "text": "38. الدر المصون في علوم الكتاب المكنون، أبو العباس، شهاب الدين، أحمد بن يوسف بن عبد الدائم المعروف بالسمين الحلبي 756 هـ، الدكتور أحمد محمد الخراط، دار القلم، دمشق. 39. الزاهر في معاني كلمات الناس، محمد بن القاسم بن محمد بن بشار، أبو بكر الأنباري 328 هـ، د. حاتم صالح الضامن، مؤسسة الرسالة - بيروت، الطبعة الأولى، 1412 هـ -1992. 40. سفر السعادة وسفير الإفادة، علي بن محمد بن عبد الصمد الهمداني المصري الشافعي، أبو الحسن، علم الدين السخاوي 643 هـ، د. محمد الدالي، تقديم د. شاكر الفحام، دار صادر، الطبعة الثانية، 1415 هـ - 1995 م. 41. شرح ابن الناظم على ألفية ابن مالك، بدر الدين محمد ابن الإمام جمال الدين محمد بن مالك 686 هـ، محمد باسل عيون السود، دار الكتب العلمية، الطبعة الأولى، 1420 هـ - 2000 م. 42. شرح ابن جابر الهواري، أبو عبد الله بن أحمد بن جابر الهواري الأندلسي، عبد الحميد السيد محمد عبد الحميد، المكتبة الأزهرية للتراث. 43. شرح ابن عقيل على ألفية ابن مالك، ابن عقيل، عبد الله بن عبد الرحمن العقيلي الهمداني المصري 769 هـ، محمد محيي الدين عبد الحميد، دار التراث - القاهرة، دار مصر للطباعة، سعيد جودة السحار وشركاه، الطبعة العشرون 1400 هـ - 1980 م. 44. شرح أبيات سيبويه، يوسف بن أبي سعيد الحسن بن عبد الله بن المرزبان أبو محمد السيرافي 385 هـ، الدكتور محمد علي الريح هاشم، مكتبة الكليات الأزهرية، دار الفكر للطباعة والنشر والتوزيع، القاهرة - مصر، عام النشر 1394 هـ - 1974 م.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 86
  },
  {
    "serial_number": "6606306",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 91,
    "volume_number": 1,
    "text": "45. شرح التسهيل المسمى تمهيد القواعد بشرح تسهيل الفوائد، محمد بن يوسف بن أحمد، محب الدين الحلبي ثم المصري، المعروف بناظر الجيش 778 هـ، أ. د. علي محمد فاخر وآخرون، دار السلام للطباعة والنشر والتوزيع والترجمة، القاهرة - جمهورية مصر العربية، الطبعة الأولى، 1428 هـ. 46. شرح التصريح على التوضيح أو التصريح بمضمون التوضيح في النحو، خالد بن عبد الله بن أبي بكر بن محمد الجرجاويّ الأزهري، زين الدين المصري 905 هـ، دار الكتب العلمية -بيروت-لبنان، الطبعة الأولى 1421 هـ- 2000 م. 47. شرح الرضي على الكافية لابن الحاجب، رضي الدين محمد بن الحسن الاستراباذي النحوي 686 هـ، أ. د. يوسف حسن عمر، تاريخ الطبع 1395 - 1975 م، جامعة قار يونس - ليبيا. 48. شرح الكافية الشافية، محمد بن عبد الله، ابن مالك الطائي الجياني، أبو عبد الله، جمال الدين 672 هـ، عبد المنعم أحمد هريدي، جامعة أم القرى مركز البحث العلمي وإحياء التراث الإسلامي كلية الشريعة والدراسات الإسلامية مكة المكرمة، الطبعة الأولى. 49. شرح المرادي، أبو محمد بدر الدين حسن بن قاسم بن عبد الله بن عليّ المرادي المصري المالكي 749 هـ، عبد الرحمن علي سليمان، أستاذ اللغويات في جامعة الأزهر، دار الفكر العربي، الطبعة الأولى 1428 هـ - 2008 م. 50. شرح المكودي على الألفية، أبو زيد عبد الرحمن بن علي بن صالح المكودي 807 هـ، الدكتور عبد الحميد هنداوي، المكتبة العصرية، بيروت - لبنان، عام النشر 1425 هـ - 2005.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 87
  },
  {
    "serial_number": "6606307",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 92,
    "volume_number": 1,
    "text": "51. شرح تسهيل الفوائد، محمد بن عبد الله، ابن مالك الطائي الجياني، أبو عبد الله، جمال الدين 672 هـ، د. عبد الرحمن السيد، د. محمد بدوي المختون، هجر للطباعة والنشر والتوزيع والإعلان، الطبعة الأولى (1410 هـ - 1990 م). 52. شرح عمدة الحافظ وعدة اللافظ، محمد بن عبد الله، ابن مالك الطائي الجياني، أبو عبد الله، جمال الدين 672 هـ، عدنان الدوري، مطبعة العاني، 1977 م. 53. شرح كتاب سيبويه، أبو سعيد السيرافي الحسن بن عبد الله بن المرزبان 368 هـ، أحمد حسن مهدلي، علي سيد علي، دار الكتب العلمية، بيروت - لبنان، الطبعة الأولى، 2008 م. 54. شرح مفصل الزمخشري، يعيش بن علي بن يعيش ابن أبي السرايا محمد بن علي، أبو البقاء، موفق الدين الأسدي الموصلي، المعروف بابن يعيش وبابن الصانع 643 هـ، قدم له الدكتور إميل بديع يعقوب، دار الكتب العلمية، بيروت - لبنان، الطبعة الأولى، 1422 هـ - 2001 م. 55. شَوَاهِد التَّوضيح وَالتَّصحيح لمشكلات الجامع الصَّحيح، محمد بن عبد الله، ابن مالك الطائي الجياني، أبو عبد الله، جمال الدين 672 هـ، الدكتور طَه مُحسِن، مكتبة ابن تيمية، الطبعة الأولى، 1405 هـ. 56. صحيح مسلم، أبو الحسين مسلم بن الحجاج القشيري النيسابوري 261 هـ، مجموعة من المحققين، دار الجيل - بيروت، الطبعة مصورة من الطبعة التركية المطبوعة في استانبول سنة 1334 هـ. 57. طبقات الشافعية الكبرى، تاج الدين عبد الوهاب بن تقي الدين السبكي 771 هـ، د. محمود محمد الطناحي د. عبد الفتاح محمد الحلو، هجر للطباعة والنشر والتوزيع، الطبعة الثانية، 1413 هـ.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 88
  },
  {
    "serial_number": "6606308",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 93,
    "volume_number": 1,
    "text": "58. طبقات الشافعيين، أبو الفداء إسماعيل بن عمر بن كثير القرشي البصري ثم الدمشقي 774 هـ، د أحمد عمر هاشم، د محمد زينهم محمد عزب، مكتبة الثقافة الدينية، تاريخ النشر 1413 هـ - 1993 م 59. علل النحو، محمد بن عبد الله بن العباس، أبو الحسن، ابن الوراق 381 هـ، محمود جاسم محمد الدرويش، مكتبة الرشد - الرياض / السعودية، الطبعة الأولى، 1420 هـ - 1999 م. 60. الفصول الخمسون، زين الدين أبو الحسين يحيى بن عبد المعطي المغربي 628 هـ، محمود الطناحي، عيسى البابي الحلبي وشركاه. 61. فهرس مؤلفات السيوطي. 62. الفوائد العجيبة في إعراب الكلمات الغريبة، ابن عابدين، محمد أمين بن عمر بن عبد العزيز عابدين الدمشقي الحنفي 1252 هـ، د. حاتم صالح الضامن، دار الرائد العربي - بيروت، الطبعة الأولى، 1410 هـ - 1990 م. 63. القرآن الكريم 64. الكامل في اللغة والأدب، محمد بن يزيد المبرد، أبو العباس 285 هـ، محمد أبو الفضل إبراهيم، دار الفكر العربي - القاهرة، الطبعة الطبعة الثالثة 1417 هـ - 1997 م. 65. كتاب الشعر أو شرح الأبيات المشكلة الإعراب، الحسن بن أحمد بن عبد الغفار الفارسيّ الأصل، أبو علي 377 هـ، الدكتور محمود محمد الطناحي، مكتبة الخانجي، القاهرة - مصر، الطبعة الأولى، 1408 هـ - 1988 م. 66. الكتاب، عمرو بن عثمان بن قنبر الحارثي بالولاء، أبو بشر، الملقب سيبويه 180 هـ، عبد السلام محمد هارون، مكتبة الخانجي، القاهرة، الطبعة الثالثة، 1408 هـ - 1988 م.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 89
  },
  {
    "serial_number": "6606309",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 94,
    "volume_number": 1,
    "text": "67. كشف الظنون عن أسامي الكتب والفنون، مصطفى بن عبد الله كاتب جلبي القسطنطيني المشهور باسم حاجي خليفة أو الحاج خليفة 1067 هـ، مكتبة المثنى - بغداد، تاريخ النشر 1941 م. 68. اللامات، عبد الرحمن بن إسحاق البغدادي النهاوندي الزجاجي، أبو القاسم 337 هـ، مازن المبارك، دار الفكر - دمشق، الطبعة الثانية، 1405 هـ 1985 م. 69. اللمحة في شرح الملحة، محمد بن حسن بن سِباع بن أبي بكر الجذامي، أبو عبد الله، شمس الدين، المعروف بابن الصائغ 720 هـ، إبراهيم بن سالم الصاعدي، عمادة البحث العلمي بالجامعة الإسلامية، المدينة المنورة، المملكة العربية السعودية، الطبعة الأولى، 1424 هـ/2004 م. 70. المجالسة وجواهر العلم، أبو بكر أحمد بن مروان الدينوري المالكي 333 هـ، أبو عبيدة مشهور بن حسن آل سلمان، جمعية التربية الإسلامية (البحرين - أم الحصم)، دار ابن حزم (بيروت - لبنان)، تاريخ النشر 1419 هـ. 71. المحكم والمحيط الأعظم، أبو الحسن علي بن إسماعيل بن سيده المرسي 458 هـ، عبد الحميد هنداوي، دار الكتب العلمية - بيروت، الطبعة الأولى، 1421 هـ - 2000 م. 72. المرتجل في شرح الجمل، أبو محمد عبد الله بن أحمد بن أحمد بن أحمد ابن الخشاب 567 هـ، علي حيدر، الطبعة دمشق، 1392 هـ - 1972 م. 73. المزهر في علوم اللغة وأنواعها، عبد الرحمن بن أبي بكر، جلال الدين السيوطي 911 هـ، فؤاد علي منصور، دار الكتب العلمية - بيروت، الطبعة الأولى، 1418 هـ 1998 م. 74. المسائل البصريات، أبو علي الفارسي 377 هـ، د. محمد الشاطر أحمد محمد أحمد، مطبعة المدني، الطبعة الأولى، 1405 هـ - 1985 هـ.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 90
  },
  {
    "serial_number": "6606310",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 95,
    "volume_number": 1,
    "text": "75. المسائل الحلبيات، أبو علي الفارسيّ 377 هـ، د. حسن هنداوي، دار القلم للطباعة والنشر والتوزيع، دمشق - دار المنارة للطباعة والنشر والتوزيع، بيروت، الطبعة الأولى، 1407 هـ - 1987 م. 76. المسائل العسكريات، الحسن بن أحمد بن عبد الغفار الفارسيّ الأصل، أبو علي 377 هـ، د. علي جابر المنصوري، الدار العلمية الدولية للنشر والتوزيع ودار الثقافة للنشر والتوزيع عمان - الأردن، عام النشر 2002 م. 77. المسائل الملقبات في النحو، ابن طولون، عبد الفتاح سليم، مكتبة الآداب، ط 1، 2007 م. 78. المستدرك على الصحيحين، أبو عبد الله الحاكم محمد بن عبد الله بن محمد بن حمدويه بن نُعيم بن الحكم الضبي الطهماني النيسابوري المعروف بابن البيع 405 هـ، مصطفى عبد القادر عطا، دار الكتب العلمية - بيروت، الطبعة الأولى، 1411 - 1990. 79. معاني القرآن للأخفش، أبو الحسن المجاشعي بالولاء، البلخي ثم البصري، المعروف بالأخفش الأوسط 215 هـ، الدكتورة هدى محمود قراعة، مكتبة الخانجي، القاهرة، الطبعة الأولى، 1411 هـ - 1990 م. 80. معاني القرآن وإعرابه، إبراهيم بن السري بن سهل، أبو إسحاق الزجاج 311 هـ، عبد الجليل عبده شلبي، عالم الكتب - بيروت، الطبعة الأولى 1408 هـ - 1988 م. 81. معاني القرآن، أبو زكريا يحيى بن زياد بن عبد الله بن منظور الديلمي الفراء 207 هـ، أحمد يوسف النجاتي / محمد علي النجار / عبد الفتاح إسماعيل الشلبي، دار المصرية للتأليف والترجمة - مصر، الطبعة الأولى.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 91
  },
  {
    "serial_number": "6606311",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 96,
    "volume_number": 1,
    "text": "82. مغني اللبيب عن كتب الأعاريب، عبد الله بن يوسف بن أحمد بن عبد الله ابن يوسف، أبو محمد، جمال الدين، ابن هشام 761 هـ، د. مازن المبارك / محمد علي حمد الله، دار الفكر - دمشق، الطبعة السادسة، 1985. 83. المفصل في صنعة الإعراب، أبو القاسم محمود بن عمرو بن أحمد، الزمخشري جار الله 538 هـ، د. علي بو ملحم، مكتبة الهلال - بيروت، الطبعة الأولى، 1993. 84. المقاصد الشافية في شرح الخلاصة الكافية (شرح ألفية ابن مالك)، أبو إسحق إبراهيم بن موسى الشاطبي 790 هـ، د. عبد الرحمن بن سليمان العثيمين وآخرون، معهد البحوث العلمية وإحياء التراث الإسلامي بجامعة أم القرى - مكة المكرمة، الطبعة الأولى، 1428 هـ - 2007 م. 85. المقاصد النحوية في شرح شواهد شروح الألفية المشهور بشرح الشواهد الكبرى، بدر الدين محمود بن أحمد بن موسى العيني 855 هـ، أ. د. علي محمد فاخر، أ. د. أحمد محمد توفيق السوداني، د. عبد العزيز محمد فاخر، دار السلام للطباعة والنشر والتوزيع والترجمة، القاهرة - جمهورية مصر العربية، الطبعة الأولى، 1431 هـ - 2010 م. 86. المقتضب، محمد بن يزيد بن عبد الأكبر الثمالى الأزدي، أبو العباس، المعروف بالمبرد 285 هـ، محمد عبد الخالق عظيمة.، عالم الكتب. - بيروت. 87. المقدمة الجزولية في النحو، عيسى بن عبد العزيز بن يَلَلْبَخْت الجزولي البربري المراكشي، أبو موسى 607 هـ، د. شعبان عبد الوهاب محمد، راجعه د حامد أحمد نيل - د فتحي محمد أحمد جمعة، طبع ونشر مطبعة أم القرى.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 92
  },
  {
    "serial_number": "6606312",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "الوفية باختصار الألفية (ألفيةِ ابن مالك)",
    "edition": "الأولى، 2019 م - 1440 هـ",
    "publisher": "مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية",
    "page_number": 97,
    "volume_number": 1,
    "text": "88. نتائج الفكر في النَّحو، أبو القاسم عبد الرحمن بن عبد الله بن أحمد السهيلي 581 هـ، دار الكتب العلمية - بيروت، الطبعة الأولى 1412 - 1992 م. 89. نشر فيض الانشراح، أبو عبد الله محمد بن الطيب الفاسي 1170 هـ، محمود فجال، دار البحوث الإسلامية وإحياء التراث، الطبعة الثانية 2002 م. 90. نظم الفوائد محمد بن عبد الله، ابن مالك الطائي الجياني، أبو عبد الله، جمال الدين 672 هـ، سليمان العايد، مجلة جامعة أم القرى، السنة الأولى العدد الثاني، 1409 هـ. 91. نفح الطيب من غصن الأندلس الرطيب، وذكر وزيرها لسان الدين بن الخطيب، شهاب الدين أحمد بن محمد المقري التلمساني 1041 هـ، إحسان عباس، دار صادر- بيروت - لبنان. 92. همع الهوامع في شرح جمع الجوامع، عبد الرحمن بن أبي بكر، جلال الدين السيوطي 911 هـ، عبد الحميد هنداوي، المكتبة التوفيقية - مصر. 93. هواتف الجنان، أبو بكر محمد بن جعفر بن محمد بن سهل بن شاكر الخرائطي 327 هـ، إبراهيم صالح، دار البشائر للطباعة والنشر والتوزيع، الطبعة الأولى، 1421 هـ - 2001 م. 94. الوافي بالوفيات، صلاح الدين خليل بن أيبك بن عبد الله الصفدي 764 هـ، أحمد الأرناؤوط وتركي مصطفى، دار إحياء التراث - بيروت 1420 هـ- 2000 م.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 93
  }
]