[
  {
    "serial_number": "97886",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: العقيدة الكتاب : عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن المؤلف : د . عبد المجيد بن محمد الوعلان عدد الصفحات : 52 [ الكتاب غير مطبوع ] تاريخ النشر بالشاملة : 25 صفر 1442\nالكتاب : عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن المؤلف : د . عبد المجيد بن محمد الوعلان عدد الصفحات : 52 [ الكتاب غير مطبوع ] تاريخ النشر بالشاملة : 25 صفر 1442\nالمؤلف : د . عبد المجيد بن محمد الوعلان عدد الصفحات : 52 [ الكتاب غير مطبوع ] تاريخ النشر بالشاملة : 25 صفر 1442\nعدد الصفحات : 52 [ الكتاب غير مطبوع ] تاريخ النشر بالشاملة : 25 صفر 1442\n[ الكتاب غير مطبوع ] تاريخ النشر بالشاملة : 25 صفر 1442\nتاريخ النشر بالشاملة : 25 صفر 1442",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 1
  },
  {
    "serial_number": "97887",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن د: عبد المجيد بن محمد الوعلان",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 2
  },
  {
    "serial_number": "97888",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرحيم  المقدمة إن الحمد لله، نحمده ونستعينه ونستغفره ونعوذ بالله من شرور أنفسنا وسيئات أعمالنا من يهده الله فلا مضل له ومن يضل فلا هادي له. وأشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمداً عبده ورسوله، {يَاأَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ (102)} [آل عمران: 102]، {يَاأَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالًا كَثِيرًا وَنِسَاءً وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا (1)} [النساء: 1]، {يَاأَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلًا سَدِيدًا (70) يُصْلِحْ لَكُمْ أَعْمَالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيمًا (71)} [الأحزاب: 70 - 71]. أما بعد: فإن الإيمان أمره عظيم، إذ هو الأساس الذي تبنى عليه السعادة في الدنيا والآخرة، فهو من أعظم مراتب الدين، فإن جبريل لما جاء إلى النبي صلى الله عليه وسلم في حضرة الصحابة، سأله عن الإيمان فقال: فأخبرني عن الإيمان، قال: «الإيمان أن تؤمن بالله وملائكته وكتبه ورسله وأن تؤمن بالقدر خيره وشره» … ثم قال النبي صلى الله عليه وسلم في أخر الحديث: «هذا جبريل أتاكم يعلمكم دينكم» (1) . ففسر الإيمان على أنه الإيمان بهذه الأركان الستة. وركن الشيء: جانبه الذي يقوم عليه، فركن البيت، هو جانبه الذي يقوم عليه، فالإيمان يقوم على هذه الأركان الستة، فإذا سقط منها ركن لم يكن الإنسان مؤمناً به لأنه فقد ركناً من أركان الإيمان. ولذلك كان لزاماً على كل مسلم أن يتعلم حقائق الدين ليتعرف على الطريقة الصحيحة لعبادة الله عز وجل القائل: {وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ (56)} [الذاريات: 56]. وتأتي أهمية هذا البحث لأنه دعوة للإيمان بالله تعالى وبقضائه وقدره، لأن الإيمان بقضاء الله وقدره، إيمان بالله تعالى وربوبيته، وملكه وتصرفه وخلقه، وإيمان بأن ما شاء الله كان وما لم يشاء لم يكن، وإيمان بسعة علم الله، وإحاطته بكل شيء، وتقديره للأشياء في الأزل وكتابته لها. ومن أجل توضيح عقيدة أهل السنة والجماعة في قضية الإيمان بالقضاء والقدر جاء هذا البحث المختصر؛ حتى يعبد المسلمُ اللهَ على بصيرة وعلم، وحتى يتحقق له ثمرة هذا الإيمان في الدنيا والآخرة.",
    "foot_note": "1. رواه مسلم، كتاب الإيمان، باب إثبات القدر، ص (1/ 155 - شرح النووي)، دار الكتاب العربي، بيروت، 1407 هـ.",
    "book_id": "70",
    "new_page_number": 3
  },
  {
    "serial_number": "97889",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": " خطة البحث: يشتمل هذا البحث على مقدمة، وخمسة فصول، وخاتمة. أما المقدمة فتشتمل على أهمية هذا الموضوع وخطة البحث. أما الفصل الأول فيشتمل على ثلاثة مباحث: المبحث الأول: تحدثت فيه عن تعريف القضاء والقدر لغة وشرعاً. المبحث الثاني: تحدثت فيه عن أهمية الإيمان بالقضاء والقدر ومنزلته من العقيدة. المبحث الثالث: ذكرت فيه الأدلة على الإيمان بالقضاء والقدر من الكتاب والسنة. أما الفصل الثاني: تحدثت فيه عن مراتب القدر بالتفصيل والأدلة على كل مرتبة، وذكرت فيه أقسام التقدير. أما الفصل الثالث: فيشتمل على فصلين: المبحث الأول: تحدثت فيه على الأمور التي يدور عليها الخلاف في القدر، وسبب ذلك الخلاف. المبحث الثاني: تحدثت فيه عن مذاهب الناس في القدر، فذكرت عقيدة الجهمية والمعتزلة والأشاعرة. ثم ذكرت عقيدة أهل السنة والجماعة. أما الفصل الرابع: تحدثت فيه عن ثمرات الإيمان بالقضاء والقدر على الوجه الصحيح. أما الفصل الخامس: وتحدثت فيه عن العلمانية وصلتها بالانحراف في مفهوم القدر، وذكرت فيه تعريف العلمانية. وعقيدة الصوفية في القدر وكيف استغلت العلمانية المفهوم الخاطئ عند الصوفية لعقيدة القدر في الغزو الفكري للأمة الإسلامية. الخاتمة: تحدثت فيها عن أهم النتائج التي توصلت إليها. أما عملي في البحث فهو كالتالي: 1 - عزو الآيات إلى أماكنها في القران، وذلك ببيان اسم السورة ورقم الآية ووضعها بين قوسين {}. 2 - تخريج الأحاديث والآثار وذكر مصادرها ووضعها بين معكوفين «». 3 - ترجمة للفرق الواردة في البحث. 4 - عمل قائمة بالمراجع. 5 - فهرس الموضوعات. هذا وأسال الله سبحانه وتعالى أن يجعل هذا الجهد القليل خالصاً لوجه الكريم، وأن ينفعنا به في الدنيا والآخرة، إنه ولي ذلك والقادر عليه. والله أعلم وصلى الله وسلم على نبينا محمد د: عبد المجيد بن محمد الوعلان awalaan@gmail.com",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 4
  },
  {
    "serial_number": "97890",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": " الفصل الأول  المبحث الأول: تعريف القضاء و القدر لغة وشرعاً القدر لغة: بفتح الدال وسكونها القضاء والحكم، وهو ما يقدره الله عز وجل من القضاء ويحكم به من الأمور. قال الله عز وجل: {أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ (1) وَمَا} [القدر: 1] يعني الحكم (1) . قال ابن فارس: القاف والدال والراء اصل صحيح يدل على مبلغ الشيء وكنهه ونهايته. وقدرت الشيء أقدره وأقدره -بسكون القاف وكسر الدال وضمها- من التقدير (2) . وفي القاموس القدر محركة: القضاء والحكم ومبلغ الشيء، والتقدير: التروية، والتفكير في تسوية أمر (3) .  القضاء لغة: الفصل والحكم، وأصله القطع والفصل، وقضاء الشيء إحكامه وإمضاؤه والفراغ منه، فيكون بمعنى الخلق. قال الزهري: القضاء في اللغة على وجوه مرجعها إلى انقطاع الشيء وتمامه. وكل ما أحكم عمله، أو أتم، أو ختم، أو أودي، أو أوجب، أو أعلم، أو أنفذ، أو أمضي، فقد قضي وقد جاءت هذه الوجوه كلها في الحديث (4) . والقضاء والقدر أمران متلازمان لا ينفك أحدهما عن الآخر، لأن أحدهما بمنزلة الأساس، وهو القدر، والآخر بمنزلة البناء، وهو القضاء فمن رام الفصل بينهما فقد رام هدم البناء ونقضه (5) .  معنى القضاء والقدر شرعاً: هو أن الله سبحانه وتعالى علم الأشياء كلها قبل وجودها وكتبها عنده وشاء ما وجد منها وخلق ما أراد خلقه (6) .",
    "foot_note": "1. ابن منظور، لسان العرب (6/ 3545)، تحقيق عبد الله الكبير وغيره، دار المعارف. القاموس المحيط، للفيروزآبادي، ص 414، ضبط وتوثيق يوسف الشيخ البقاعي، دار الفكر، بيروت، 1415 هـ. \n2. ابن فارس، معجم مقاييس اللغة، ص (5/ 62)، الطبعة الأولى، تحقيق عبد السلام هارون، دار الجيل، بيروت، 1411 هـ. \n3. القاموس المحيط، ص 414. \n4. لسان العرب (6/ 3665)، النهاية في غريب الحديث والأثر (4/ 69)، الطبعة الأولى، تعليق صلاح عويضة، دار الكتب العلمية، بيروت 1418 هـ. \n5. لسان العرب (6/ 3665). \n6. فتاوى اللجنة الدائمة للبحوث العلمية والإفتاء، ص (3/ 374)، رقم 4088، الطبعة الأولى، جمع أحمد الدويش، مكتبة المعارف، الرياض، 1412 هـ.",
    "book_id": "70",
    "new_page_number": 5
  },
  {
    "serial_number": "97891",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "تعريف أخر: هو التصديق الجازم بأن كل خير وشر فهو بقضاء الله وقدره وأنه الفعال لما يريد، لا يكون في ملكه شيء إلا بإرادته، ولا يخرج عن مشيئته، وليس في العالم شيء يخرج عن تقديره، ولا يصدر إلا عن تدبيره، ولا محيد لأحد عن القدر، ولا يتجاوز ما خط في اللوح المحفوظ، وأنه خالق أفعال العباد من الطاعات والمعاصي (1) . تعريف أخر: هو تقدير الله تعالى الأشياء في القدم، وعلمه سبحانه أنها ستقع في أوقات معلومة عنده، وعلى صفات مخصوصة، وكتابته سبحانه لذلك ومشيئته له، ووقوعها على حسب ما قدرها وخلقه لها (2) . وكل هذه التعاريف متقاربة وتشتمل على مراتب القدر الأربعة: العلم والكتابة والمشيئة والخلق.  الفرق بين القضاء والقدر: قال الشيخ ابن عثيمين رحمه الله: \" القدر في اللغة؛ بمعنى: التقدير؛ قال تعالى: {إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ (49)} [القمر: 49]، وقال تعالى: {فَقَدَرْنَا فَنِعْمَ الْقَادِرُونَ (23)} [المرسلات: 23]. - وأما القضاء؛ فهو في اللغة: الحكم. ولهذا نقول: إن القضاء والقدر متباينان إن اجتمعا، ومترادفان إن تفرقا؛ على حد قول العلماء: هما كلمتان: إن اجتمعتا افترقتا، وإن افترقتا اجتمعتا. فإذا قيل: هذا قدر الله؛ فهو شامل للقضاء، أما إذا ذكرا جميعًا؛ فلكل واحد منهما معنى. - فالتقدير: هو ما قدره الله تعالى في الأزل أن يكون في خلقه. - وأما القضاء؛ فهو ما قضى به الله سبحانه وتعالى في خلقه من إيجاد أو إعدام أو تغيير، وعلى هذا يكون التقدير سابقًا\" (3) .",
    "foot_note": "1. عبد العزيز السلمان، الكواشف الجلية عن معاني الواسطية، ص 84، الطبعة التاسعة عشرة. \n2. عبد الرحمن المحمود، القضاء والقدر في ضوء الكتاب والسنة ومذاهب الناس فيه، ص 39، الطبعة الثانية، دار الوطن، الرياض، 1418 هـ. \n3. شرح العقيدة الواسطية: 2/ 189. وانظر: فتح الباري: 11/ 149، 477، والقضاء والقدر للأشقر: 24، والقضاء والقدر للمحمود: 44.",
    "book_id": "70",
    "new_page_number": 6
  },
  {
    "serial_number": "97892",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": " المبحث الثاني أهمية الإيمان بالقضاء والقدر ومنزلته من العقيدة الإيمان بالقدر من أصول الإيمان التي لا يتم إيمان العبد إلا بها، وهو داخل في الإيمان بالله عز وجل وبروبيته وأسمائه وصفاته، فمن صفاته سبحانه وتعالى صفة العلم، والقدرة، والإرادة، والخلق، ومعلوم أن القدر إنما يقوم على هذه الأسس. ولاشك أن الإقرار بتوحيد الله وربوبيته لا يتم إلا بالإيمان بصفاته تعالى، فمن زعم أن هناك خالقاً غير الله تعالى فقد أشرك، والله تعالى، خالق كل شئ، ومن ذلك أفعال العباد (1) . ولم يرد في القران التنصيص على وجوب الإيمان بالقدر، وإنما وردت أدلة مجملة تدل على تقدير الله للأشياء (2) ، كقوله تعالى: {إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ (49)} [القمر: 49]، وقوله تعالى: {وَخَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهُ تَقْدِيرًا (2)} [الفرقان: 1 - 2]، وقوله تعالى: {سُنَّةَ اللَّهِ فِي الَّذِينَ خَلَوْا مِنْ قَبْلُ وَكَانَ أَمْرُ اللَّهِ قَدَرًا مَقْدُورًا (38)} [الأحزاب: 38]، وقوله تعالى: {فَجَعَلْنَاهُ فِي قَرَارٍ مَكِينٍ (21) إِلَى قَدَرٍ مَعْلُومٍ (22) فَقَدَرْنَا فَنِعْمَ الْقَادِرُونَ (23)} [المرسلات: 21 - 23]. وقد ورد التنصيص على الإيمان بالقدر في السنة، في حديث عمر بن الخطاب رضي الله عنه في سؤال جبريل عليه السلام الرسول صلى الله عليه وسلم عن الإيمان قال: «أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر، وتؤمن بالقدر خير وشره. قال: -يعني جبريل- صدقت» (3) . وعن جابر رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: «لا يؤمن عبد حتى يؤمن بالقدر خيره وشره من الله، وحتى يعلم أن ما أصابه لم يكن ليخطئه، وأن ما أخطأه لم يكن ليصيبه» (4) .",
    "foot_note": "1. شرح العقيدة الطحاوية ص (2/ 356). الطبعة الأولى، تحقيق عبد الله التركي، شعيب الأرناؤط، مؤسسة الرسالة، بيروت، 1408 هـ. \n2. انظر: القضاء والقدر، عبد الرحمن المحمود، ص 86، وشريط عقيدة أهل السنة والجماعة في القضاء والقدر، صالح آل الشيخ، تسجيلات النداء الإسلامية، الرياض. \n3. سبق تخريجه ص 1 حاشية رقم 1. \n4. رواه الترمذي: كتاب القدر، باب ما جاء في الإيمان بالقدر خيره وشره، ص (6/ 356 - شرح تحفة الأحوذي)، رقم 2231، الطبعة الثالثة، ضبط عبدالرحمن عثمان، مكتبة ابن تيمية، 1407 هـ، وقد صححه الألباني في صحيح سنن الترمذي رقم 1743، الطبعة الأولى، مكتب التربية العربي لدول الخليج، الرياض، 1408 هـ. وفي سلسلة الأحاديث الصحيحة رقم 2439، الطبعة الأولى، مكتبة المعارف، الرياض، 1412 هـ.",
    "book_id": "70",
    "new_page_number": 7
  },
  {
    "serial_number": "97893",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "وعن طاوس قال: أدركت أناساً من أصحاب رسول الله صلى الله عليه وسلم يقولون: كل شيء بقدر، قال: وسمعت عبد الله بن عمر رضي الله عنهما يقول: قال رسول الله صلى الله عليه وسلم: «كل شيء بقدر حتى العجز والكيس (1) ، أو الكيس والعجز» (2) . وعن أبي الدرداء رضي الله عنه عن النبي صلى الله عليه وسلم قال: «لا يدخل الجنة عاق، ولا مدمن خمر، ولا مكذب بالقدر» (3) . قال ابن عباس رضي الله عنهما: (القدر نظام التوحيد، فمن وحد الله وآمن بالقدر تم توحيده، ومن وحد الله وكذب بالقدر نقض تكذيبه توحيده) (4) . وقد قال ابن عمر رضي الله عنهما في الذين يزعمون أن لا قدر وأن الأمر أنف: (فإذا لقيت أولئك فأخبرهم أني بريء منهم وأنهم براء مني، والذي يحلف به عبد الله ابن عمر لو أن لأحدهم مثل أحد ذهباً فأنفقه ما قبل الله منه حتى يؤمن بالقدر) (5) . قال شيخ الإسلام ابن تيمية: (إذا ثبت هذا - يعني تحقيق شهادة أن لا اله إلا الله وأن محمداً رسول الله- فمعلوم أنه يجب الإيمان بخلق الله وأمره، وبقضائه وشرعه) (6) . وقال ابن القيم: (قال الإمام أحمد: القدر قدرة الله، واستحسن ابن عقيل هذا الكلام جدا، وقال: هذا يدل على دقة علم أحمد وتبحره في معرفة أصول الدين، وهو كما قال أبو الوفاء؛ فإن إنكار القدر: إنكار لقدرة الرب على خلق أفعال العباد وكتابتها وتقديرها) (7) .",
    "foot_note": "1. العجز: هو عدم القدرة، وقيل هو ترك ما يجب فعله والتسويف به وتأخيره عن وقته، والكيس ضد العجز، وهو النشاط والحذق بالأمور، ومعناه أن العاجز قد قدر عجزه والكيس قد قدر كيسه. ص (16/ 205 - شرح النووي). \n2. رواه مسلم: كتاب القدر - باب كل شيء بقدر (16/ 205 - شرح النووي). \n3. حديث صحيح، رواه الإمام أحمد، انظر الجامع الصحيح في القدر، تأليف مقبل الو ادعي، ص 14، مكتبة ابن تيمية، القاهرة. وهو في السلسلة الصحيحة رقم (675)، الطبعة الرابعة، المكتب الإسلامي، بيروت، 1405 هـ. \n4. شرح العقيدة الطحاوية لابن أبي العز، ص (1/ 322)، شرح أصول اعتقاد آهل السنة والجماعة للالكائي، ص (4/ 622)، الطبعة الثانية، تحقيق أحمد حمدان، دار طيبة، الرياض، 1411 هـ. \n5. رواه مسلم: كتاب القدر - باب كل شيء بقدر (16/ 205 - شرح النووي). \n6. التدمرية، شيخ الإسلام ابن تيمية، ص 130، الطبعة الثانية، مطبوعات جامعة الإمام محمد بن سعود، الرياض، 1400 هـ. \n7. ابن القيم، شفاء العليل في مسائل القضاء والقدر والحكمة والتعليل، ص 28، الطبعة الأولى، تصحيح السيد محمد بدر الدين الحلبي، مكتبة الرياض الحديثة، الرياض.",
    "book_id": "70",
    "new_page_number": 8
  },
  {
    "serial_number": "97894",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": " المبحث الثالث: الأدلة على الإيمان بالقضاء والقدر من الكتاب والسنة  أولاً: الأدلة من القرآن: قال تعالى: {إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ (49)} [القمر: 49]، وقال تعالى: {وَخَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهُ تَقْدِيرًا (2)} [الفرقان: 1 - 2]، (أي كل شيء مما سواه مخلوق مربوب وهو خالق كل شيء وربه ومليكه وإلهه، وكل شيء تحت قهره وتدبيره وتسخيره وتقديره) (1) . وقال تعالى: {وَإِذْ تَقُولُ لِلَّذِي أَنْعَمَ اللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ أَمْسِكْ عَلَيْكَ زَوْجَكَ وَاتَّقِ اللَّهَ وَتُخْفِي فِي نَفْسِكَ مَا اللَّهُ مُبْدِيهِ وَتَخْشَى النَّاسَ وَاللَّهُ أَحَقُّ أَنْ تَخْشَاهُ فَلَمَّا قَضَى زَيْدٌ مِنْهَا وَطَرًا زَوَّجْنَاكَهَا لِكَيْ لَا يَكُونَ عَلَى الْمُؤْمِنِينَ حَرَجٌ فِي أَزْوَاجِ أَدْعِيَائِهِمْ إِذَا قَضَوْا مِنْهُنَّ وَطَرًا وَكَانَ أَمْرُ اللَّهِ مَفْعُولًا (37) مَا كَانَ عَلَى النَّبِيِّ مِنْ حَرَجٍ فِيمَا فَرَضَ اللَّهُ لَهُ سُنَّةَ اللَّهِ فِي الَّذِينَ خَلَوْا مِنْ قَبْلُ وَكَانَ أَمْرُ اللَّهِ قَدَرًا مَقْدُورًا (38)} [الأحزاب: 37 - 38]، (أي وكان أمره الذي يقدره كائناً لا محالة وواقعاً لا محيد عنه ولا معدل فما شاء كان وما لم يشاء لم يكن) (2) . وقال تعالى: {مَا أَصَابَ مِنْ مُصِيبَةٍ إِلَّا بِإِذْنِ اللَّهِ وَمَنْ يُؤْمِنْ بِاللَّهِ يَهْدِ قَلْبَهُ} [التغابن: 11]، (وهذا عام لجميع المصائب، في النفس والمال، والولد، والأحباب، ونحوهم. فجميع ما أصاب العباد، بقضاء الله وقدره، قد سبق بذلك علمه، وجرى به قلمه، ونفذت مشيئته، واقتضته حكمته) (3) . وقال تعالى: {فَجَعَلَهُ غُثَاءً أَحْوَى (5) سَنُقْرِئُكَ فَلَا تَنْسَى (6) إِلَّا مَا شَاءَ اللَّهُ إِنَّهُ يَعْلَمُ الْجَهْرَ وَمَا يَخْفَى (7) وَنُيَسِّرُكَ لِلْيُسْرَى (8) فَذَكِّرْ إِنْ نَفَعَتِ الذِّكْرَى (9) سَيَذَّكَّرُ مَنْ يَخْشَى (10)} [الأعلى: 5 - 10]، قال ابن كثير: (والآيات في هذا المعنى كثيرة دالة على أن الله عز وجل يجازي من قصد الخير بالتوفيق له، ومن قصد الشر بالخذلان، وكل ذلك بقدر مقدر) (4) .",
    "foot_note": "1. ابن كثير، تفسير القران العظيم، ص (3/ 320)، الطبعة الثانية، تقديم الدكتور يوسف المرعشلي، دار المعرفة، بيروت، 1407 هـ. \n2. تفسير ابن كثير، (3/ 500). \n3. ابن سعدي، تيسير الكريم الرحمن في تفسير كلام المنان، ص (7/ 399)، مركز صالح بن صالح الثقافي، عنيزة، 1407 هـ. \n4. تفسير ابن كثير، (4/ 554).",
    "book_id": "70",
    "new_page_number": 9
  },
  {
    "serial_number": "97895",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": " ثانيا: الأدلة من السنة: عن عمر بن الخطاب رضي الله عنه في سؤال جبريل عليه السلام الرسول صلى الله عليه وسلم عن الإيمان قال: «أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر، وتؤمن بالقدر خير وشره. قال: -يعني جبريل- صدقت» (1) . (في هذا الحديث أن الإيمان بالقدر من أصول الإيمان الستة المذكورة، فمن لم يؤمن بالقدر خيره وشره، فقد ترك أصلاً من أصول الدين وجحده، فيشبه من قال الله فيهم: {أَفَتُؤْمِنُونَ بِبَعْضِ الْكِتَابِ وَتَكْفُرُونَ بِبَعْضٍ} [البقرة: 85]) (2) . وعن جابر رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: «لا يؤمن عبد حتى يؤمن بالقدر خيره وشره من الله، وحتى يعلم أن ما أصابه لم يكن ليخطئه، وأن ما أخطأه لم يكن ليصيبه» (3) . قال الشيخ ابن باز رحمه الله: (وجميع الآيات والأحاديث الواردة في هذا الباب تدعوا إلى إيمان العبد بأنه لن يصيبه إلا ما كتب الله له، وان ما أصابه لم يكن ليخطئه وما أخطاه لم يكن ليصيبه، كما تدعوه إلى أن يسارع في الخيرات، وينافس في الطاعات، ويحرص على أسباب الخير، ويبتعد عن أسباب الشر) (4) . وعن طاوس، قال: أدركت أناساً من أصحاب رسول الله صلى الله عليه وسلم يقولون: كل شيء بقدر، قال: وسمعت عبد الله بن عمر رضي الله عنهما يقول: قال رسول الله صلى الله عليه وسلم: «كل شيء بقدر حتى العجز والكيس، أو الكيس والعجز» (5) . وعن أبي الدرداء رضي الله عنه عن النبي صلى الله عليه وسلم قال: «لا يدخل الجنة عاق، ولا مدمن خمر، ولا مكذب بالقدر» (6) . وعن ابن الديلمي قال: أتيت أبي بن كعب فقلت له: وقع في نفسي شيء من القدر فحدثني بشيء لعل الله تعالى أن يذهبه من قلبي، فقال: لو أن الله تعالى عذب أهل سمواته وأهل أرضه عذبهم وهو غير ظالم لهم، ولو رحمهم كانت رحمته خيراً لهم من أعمالهم، ولو أنفقت مثل أحد ذهبا في سبيل الله تعالى ما قبله الله تعالى منك حتى تؤمن بالقدر، وتعلم أن ما أصابك لم يكن ليخطئك، وأن ما أخطأك لم يكن ليصيبك، ولو مت على غير هذا لدخلت النار. قال: ثم أتيت ابن مسعود فقال: مثل ذلك. قال: ثم أتيت حذيفة بن اليمان فقال: مثل ذلك. قال: ثم أتيت زيد بن ثابت فحدثني عن النبي صلى الله عليه وسلم مثل ذلك (7) .",
    "foot_note": "1. سبق تخريجه ص 1 حاشية رقم 1. \n2. عبد الرحمن بن حسن، فتح المجيد شرح كتاب التوحيد، ص 428، الطبعة الأولى، المكتبة التجارية، مكة، 1412 هـ. \n3. سبق تخريجه ص 6 حاشية رقم 4. \n4. مجموع الفتاوى للشيخ ابن باز، جمع عبد الله الطيار وأحمد بن باز، ص (3/ 491)، الطبعة الأولى، دار الوطن، الرياض، 1416 هـ. \n5. سبق تخريجه ص 8 حاشية رقم 2. \n6. سبق تخريجه ص 8 حاشية رقم 3. \n7. حديث حسن، رواه أبو داود، انظر الجامع الصحيح في القدر، ص 14.",
    "book_id": "70",
    "new_page_number": 10
  },
  {
    "serial_number": "97896",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": " الفصل الثاني: مراتب القدر والأدلة على كل مرتبة قال شيخ الإسلام ابن تيمية: (وتؤمن الفرقة الناجية - أهل السنة والجماعة- بالقدر خيره وشره. والإيمان بالقدر على درجتين، كل درجة تتضمن شيئين: فالدرجة الأولى: الإيمان بأن الله تعالى عليم بما الخلق عاملون بعلمه القديم، الذي هو موصوف به أزلاً وأبداً، وعلم جميع أحوالهم من الطاعات والمعاصي والأرزاق والآجال، ثم كتب الله في اللوح المحفوظ مقادير الخلق … ثم قال وأما الدرجة الثانية: فهو مشيئة الله النافذة وقدرته الشاملة، وهو الإيمان بأن ما شاء الله كان، وما لم يشاء لم يكن، وأنه ما في السموات وما في الأرض من حركة ولا سكون إلا بمشيئة الله سبحانه وتعالى، لا يكون في ملكه ما لا يريد، وأنه سبحانه على كل شيء قدير، من الموجودات والمعدومات، فما من مخلوق في الأرض ولا في السماء إلا الله خالقه سبحانه، ولا خالق غيره، ولا رب سواه) (1) . فعلى هذا مراتب القدر أربعة، هي:  المرتبة الأولى: العلم: وهو أن الله سبحانه وتعالى علم الأشياء كلها قبل وجودها بعلمه الأزلي، وعلم مقاديرها، وأزمانها، وآجال العباد، وأرزاقهم وغير ذلك، كما قال تعالى: {إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ (62)} [العنكبوت: 62]، وقال تعالى: {لِتَعْلَمُوا أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا (12)} [الطلاق: 12]، (أي لتعلموا كمال قدرته وإحاطته بالأشياء، وهو معنى {وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا (12)}، فلا يخرج عن علمه شيء منها كائنا ما كان) (2) . وقال تعالى: {(58) وَعِنْدَهُ مَفَاتِحُ الْغَيْبِ لَا يَعْلَمُهَا إِلَّا هُوَ وَيَعْلَمُ مَا فِي الْبَرِّ وَالْبَحْرِ وَمَا تَسْقُطُ مِنْ وَرَقَةٍ إِلَّا يَعْلَمُهَا وَلَا حَبَّةٍ فِي ظُلُمَاتِ الْأَرْضِ وَلَا رَطْبٍ وَلَا يَابِسٍ إِلَّا فِي كِتَابٍ} [الأنعام: 59]، ومفاتح الغيب فسرها رسول الله صلى الله عليه وسلم بأنها خمس لا يعلمها إلا الله وهي المذكورة في قوله تعالى: {اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ مَا فِي الْأَرْحَامِ وَمَا تَدْرِي نَفْسٌ مَاذَا تَكْسِبُ غَدًا وَمَا تَدْرِي نَفْسٌ بِأَيِّ أَرْضٍ تَمُوتُ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ (34)} [لقمان: 34] (3) .",
    "foot_note": "1. ابن تيمية، العقيدة الواسطية، ص (22 - 23)، شرح الشيخ محمد بن مانع، مكتبة النهضة الحديثة. \n2. فتح القدير، للشوكاني، ص (5/ 248)، طبعة دار الفكر، بيروت، 1403 هـ. \n3. الحديث رواه البخاري: كتاب التفسير-سورة الأنعام، باب {وعنده مفاتح الغيب لا يعلمها إلا هو} وفي تفسير سورة لقمان، باب {إن الله عنده علم الساعة} (8/ 291، 8/ 513 - فتح الباري)، تصحيح الشيخ عبد العزيز بن باز، دار الفكر.",
    "book_id": "70",
    "new_page_number": 11
  },
  {
    "serial_number": "97897",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "وقال تعالى: {إِنَّمَا إِلَهُكُمُ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ وَسِعَ كُلَّ شَيْءٍ عِلْمًا (98)} [طه: 98] (أي هو عالم بكل شيء، أحاط بكل شيء علماً، وأحصى كل شيء عدداً، فلا يعزب عنه مثقال ذرة، في البر والبحر وما تسقط من ورقة إلا يعلمها ولا حبة في ظلمات الأرض ولا رطب ولا يابس إلا في كتاب مبين {وَمَا مِنْ دَابَّةٍ فِي الْأَرْضِ إِلَّا عَلَى اللَّهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَا كُلٌّ فِي كِتَابٍ مُبِينٍ (6)} [هود: 6]) (1) . وعن عمران بن حصين رضي الله عنه قال: قال رجل: يا رسول الله! أعلم أهل الجنة من أهل النار؟ قال: «نعم»، قال: ففيم يعمل العاملون؟ قال: «كل ميسر لما خلق له» (2) . وقد ترجم عليه البخاري بقوله: بابٌ جفَ القلمُ على علم الله، وقوله: {وَأَضَلَّهُ اللَّهُ عَلَى عِلْمٍ} (قال عياض: معنى جف القلم أي لم يكتب بعد ذلك شيئا، وكتاب الله ولوحه وقلمه من غيبه ومن علمه الذي يلزمنا الإيمان به) (3) . وعن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: «ما من مولود إلا يولد على الفطرة، فأبواه يهودانه أو ينصرانه، كما تنتجون البهيمة هل فيها من جدعاء، حتى تكونوا أنتم تجدعونها» قالوا: يا رسول الله: أفرأيت من يموت وهو صغير؟ قال: «الله أعلم بما كانوا عاملين» (4) . والآيات والأحاديث في هذا المعنى كثيرة.  المرتبة الثانية: الكتابة: وهو أن الله كتب جميع الأشياء من خير وشر، وطاعة ومعصية، وآجال وأرزاق، وغير ذلك، قال تعالى: {أَلَمْ تَعْلَمْ أَنَّ اللَّهَ يَعْلَمُ مَا فِي السَّمَاءِ وَالْأَرْضِ إِنَّ ذَلِكَ فِي كِتَابٍ إِنَّ ذَلِكَ عَلَى اللَّهِ يَسِيرٌ (70)} [الحج: 70]، (يخبر تعالى عن كمال علمه بخلقه وأنه محيط بما في السموات والأرض فلا يعزب مثقال ذرة في الأرض ولا في السماء ولا أصغر من ذلك ولا أكبر، وأنه تعالى علم الكائنات قبل وجودها وكتب ذلك في اللوح المحفوظ) (5) .",
    "foot_note": "1. تفسير ابن كثير (3/ 172). \n2. رواه مسلم كتاب القدر: باب كيفية الخلق الآدمي في بطن أمه (16/ 198 - شرح النووي)، ورواه البخاري كتاب القدر، باب جف القلم على علم الله، (11/ 491 - فتح الباري). \n3. فتح الباري (11/ 491). \n4. رواه البخاري، كتاب القدر، باب الله أعلم بما كانوا عاملين، (11/ 493 - فتح الباري) ورواه مسلم، كتاب القدر، باب معنى كل مولود يولد على الفطرة، (16/ 210 - شرح النووي) \n5. تفسير ابن كثير (3/ 245).",
    "book_id": "70",
    "new_page_number": 12
  },
  {
    "serial_number": "97898",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "وقال تعالى: {مَا أَصَابَ مِنْ مُصِيبَةٍ فِي الْأَرْضِ وَلَا فِي أَنْفُسِكُمْ إِلَّا فِي كِتَابٍ مِنْ قَبْلِ أَنْ نَبْرَأَهَا إِنَّ ذَلِكَ عَلَى اللَّهِ يَسِيرٌ (22)} [الحديد: 22]. عن عبد الله بن عمرو بن العاص رضي الله عنهما قال: سمعت رسول الله صلى الله عليه وسلم يقول: «كتب الله مقادير الخلائق، قبل أن يخلق السموات والأرض بخمسين ألف سنة، قال: وعرشه على الماء» (1) . (قال العلماء المراد تحديد وقت الكتابة في اللوح المحفوظ أو غيره لا أصل التقدير فإن ذلك أزلي لا أول له) (2) . وفي الصحيحين من حديث علي رضي الله عنه قال: كنا جلوساً مع النبي صلى الله عليه وسلم، ومعه عود ينكت به في الأرض، فنكس وقال: «ما منكم من أحد إلا قد كتب مقعده من النار أومن الجنة» فقال رجل من القوم: ألا نتكل يا رسول الله؟ قال: «لا، اعملوا فكل ميسر ثم قرأ {فَأَمَّا مَنْ أَعْطَى وَاتَّقَى (5)} الآية [الليل: 5]» (3) (وهذا الحديث أصل لأهل السنة في أن السعادة والشقاء بتقدير الله القديم، وفيه رد على الجبرية، لأن التيسير ضد الجبر، لأن الجبر لا يكون إلا عن كره ولا يأتي الإنسان الشيء بطريق التيسير إلا وهو غير كاره له) (4) .",
    "foot_note": "1. رواه مسلم، كتاب القدر، باب حجاج آدم موسى، (16/ 203 - شرح النووي). \n2. شرح النووي على مسلم، (16/ 203). \n3. رواه البخاري: كتاب القدر، باب وكان أمر الله قدراً مقدوراً (11/ 494 - فتح الباري)، ورواه مسلم: كتاب القدر، باب كيفية خلق الآدمي في بطن أمه (16/ 195 - شرح النووي). \n4. فتح الباري، (11/ 498).",
    "book_id": "70",
    "new_page_number": 13
  },
  {
    "serial_number": "97899",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": " أقسام التقدير خمسة (1) :  الأول: التقدير العام قبل خلق السموات والأرض: وهو تقدير الرب لجميع الأشياء بمعنى علمه بها وكتابته لها ومشيئته وخلقه لما كان منها، ويدل على هذا النوع دلائل كثيرة منها قوله تعالى: {أَلَمْ تَعْلَمْ أَنَّ اللَّهَ يَعْلَمُ مَا فِي السَّمَاءِ وَالْأَرْضِ إِنَّ ذَلِكَ فِي كِتَابٍ إِنَّ ذَلِكَ عَلَى اللَّهِ يَسِيرٌ (70)} [الحج: 70]، وقوله: {لِتَعْلَمُوا أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا (12)} [الطلاق: 12]، وقوله: {يَفْعَلُ مَا يَشَاءُ (18)} [الحج: 18]، وقوله: {الله خالق كل شيء} [الزمر: 62]، وفي صحيح مسلم عن عبد الله بن عمرو بن العاص رضي الله عنهما أن النبي صلى الله عليه وسلم قال: «إن الله قدر مقادير الخلائق قبل أن يخلق السماء والأرض بخمسين ألف سنة وكان عرشه على الماء» (2) .  الثاني: كتابة الميثاق حين أخذ على بني آدم وهم على ظهر أبيهم آدم: قال الله تعالى: {وَإِذْ أَخَذَ رَبُّكَ مِنْ بَنِي آدَمَ مِنْ ظُهُورِهِمْ ذُرِّيَّتَهُمْ وَأَشْهَدَهُمْ عَلَى أَنْفُسِهِمْ أَلَسْتُ بِرَبِّكُمْ قَالُوا بَلَى شَهِدْنَا} الآية [الأعراف: 172]. وفي مسند الإمام أحمد عن أبي الدرداء رضي الله عنه عن النبي صلى الله عليه وسلم قال: «خلق الله آدم حين خلقه فضرب كتفه اليمنى فأخرج ذرية بيضاء كأنهم الذر، وضرب كتفه اليسرى فأخرج ذرية سوداء كأنهم الحمم، فقال للذي في يمينه: إلى الجنة ولا أبالي، وقال للذي في كفه اليسرى: إلى النار ولا أبالي» (3) .  الثالث: التقدير العمري: وهو تقدير كل ما يجري على العبد في حياته إلى نهاية أجله وكتابة شقاوته وسعادته، وقد دل عليه حديث ابن مسعود رضي الله عنه أن النبي صلى الله عليه وسلم قال: «إن أحدكم يجمع خلقه في بطن أمه أربعين يوماً، ثم يكون علقة مثل ذلك، ثم يكون مضغة مثل ذلك، ثم يرسل الله الملك فينفخ فيه الروح ويؤمر بأربع كلمات: بكتابة رزقه وأجله وعمله وشقي أو سعيد … » (4) الحديث.  الرابع: التقدير السنوي:",
    "foot_note": "1. التنبيهات اللطيفة على ما احتوت عليه العقيدة الواسطية من المباحث المنيفة، عبد الرحمن بن سعدي، ص 78 - 80، الطبعة الأولى، تعليق الشيخ ابن باز، ضبط علي حسن عبد الحميد، دار ابن القيم، الدمام، 1409 هـ. وانظر: شفاء العليل ص 6 - 23، معارج القبول بشرح سلم الوصول إلى علم الأصول للشيخ حافظ الحكمي (3/ 928 - 940)، الطبعة الثالثة، ضبط وتعليق عمر بن محمود، دار ابن القيم، الدمام، 1414 هـ، والقضاء والقدر للمحمود ص 66 - 69. \n2. سبق تخريجه ص 12 حاشية رقم 2. \n3. قال محقق الكتاب: رواه أحمد وابنه في الزوائد (6/ 441) وإسناده صحيح. \n4. رواه البخاري كتاب القدر (11/ 477 - فتح الباري)، ورواه مسلم في كتاب القدر، باب كيفية خلق الآدمي في بطن أمه (16/ 190 - شرح النووي).",
    "book_id": "70",
    "new_page_number": 14
  },
  {
    "serial_number": "97900",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "وذلك يكون في ليلة القدر ويدل عليه قوله تعالى: {فِيهَا يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ (4)} [الدخان: 4]، وقوله تعالى: {الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِمْ مِنْ كُلِّ أَمْرٍ (4) سَلَامٌ هِيَ حَتَّى مَطْلَعِ الْفَجْرِ (5) لَمْ} [القدر: 4 - 5]، قيل يكتب في هذه الليلة ما يحدث في السنة من موت وعز وذل وغير ذلك، روي هذا عن ابن عمر ومجاهد وأبي مالك والضحاك وغير وأحد من السلف (1) .  الخامس: التقدير اليومي: ويدل عليه قوله تعالى: {كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ} [الرحمن: 29]، عن أبي الدرداء رضي الله عنه عن النبي صلى الله عليه وسلم في تفسير {كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ} قال: «من شأنه أن يغفر ذنباً ويفرج كرباً ويرفع قوماً ويضع آخرين»، علقه البخاري عن أبي الدرداء موقوفاً (2) .  المرتبة الثالثة: المشيئة: أي أن ما شاء الله كان وما لم يشأ لم يكن، وأن ليس في السموات والأرض من حركة ولا سكون إلا بمشيئته سبحانه ولا يكون في ملكه إلا ما يريد. كما قال تعالى: {لِمَنْ شَاءَ مِنْكُمْ أَنْ يَسْتَقِيمَ (28) وَمَا تَشَاءُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ رَبُّ الْعَالَمِينَ (29)} [التكوير: 28 - 29]، قال ابن كثير: (أي ليست المشيئة موكولة لكم فمن شاء اهتدى ومن شاء ضل بل ذلك كله تابع لمشيئته تعالى رب العالمين) (3) . وقال تعالى: {فَمَنْ شَاءَ ذَكَرَهُ (55) وَمَا يَذْكُرُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ هُوَ أَهْلُ التَّقْوَى وَأَهْلُ الْمَغْفِرَةِ (56)} [المدثر: 55 - 56]، (وما يذكرون إلا أن يشاء الله - فإن مشيئة الله، نافذة عامة، لا يخرج عنها حادث قليل ولا كثير. ففيها رد على القدرية، الذين لا يدخلون أفعال العباد تحت مشيئة الله، والجبرية الذين يزعمون أنه ليس للعبد مشيئة، ولا فعل حقيقة، وإنما هو مجبور على أفعاله. فأثبت تعالى للعباد مشيئة حقيقة وفعلاً، وجعل ذلك تابعاً لمشيئته) (4) . وقال تعالى: {وَلَوْ شَاءَ اللَّهُ مَا فَعَلُوهُ فَذَرْهُمْ وَمَا يَفْتَرُونَ (137)} [الأنعام: 137]. قال ابن كثير: (أي كان هذا واقع بمشيئته تعالى وإرادته واختياره لذلك كوناً، وله الحكمة التامة في ذلك، فلا يسأل عما يفعل وهم يسألون) (5) .",
    "foot_note": "1. تفسير ابن كثير (4/ 568 - 570). \n2. رواه البخاري في كتاب التفسير، سورة الرحمن (8/ 620 - فتح الباري). \n3. تفسير ابن كثير (4/ 512). \n4. تفسير ابن سعدي (7/ 520). \n5. تفسير ابن كثير (2/ 186).",
    "book_id": "70",
    "new_page_number": 15
  },
  {
    "serial_number": "97901",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "وعن عبد الله بن عمرو بن العاص رضي الله عنهما أنه سمع رسول الله صلى الله عليه وسلم يقول: «إن قلوب بني آدم كلها بين أصبعين من أصابع الرحمن، كقلب واحد يصرفه حيث يشاء» ثم قال رسول الله صلى الله عليه وسلم: «اللهم مصرف القلوب صرف قلوبنا على طاعتك» (1) ، (معنى الحديث أنه سبحانه وتعالى متصرف في قلوب عباده وغيرها كيف شاء، لا يمتنع عليه منها شيء ولا يفوته ما أراده) (2) .  المرتبة الرابعة: الخلق والتكوين: وهو أن الله سبحانه وتعالى هو الخالق الموجد لجميع الأشياء، من ذوات وصفات وأفعال، ومن ذلك أفعال العباد. والأدلة على هذه المرتبة كثيرة منها قوله تعالى: {وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ (96)} [الصافات: 96]، (أي خلقكم وخلق أعمالكم) (3) . وقال تعالى: {خَالِقُ كُلِّ شَيْءٍ وَهُوَ الْوَاحِدُ الْقَهَّارُ (16) أَنْزَلَ مِنَ} [الرعد: 16]، (قال الزجاج: والمعنى أنه خالق كل شيء مما يصح أن يكون مخلوقاً) (4) . وقال تعالى: {اللَّهُ خَالِقُ كُلِّ شَيْءٍ وَهُوَ عَلَى كُلِّ شَيْءٍ وَكِيلٌ (62)} [الزمر: 62]، (هذه العبارة وما أشبهها، مما هو كثير في القرآن، تدل على أن جميع الأشياء - غير الله وأسمائه وصفاته- مخلوقة) (5) . عن حذيفة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: «إن الله يصنع كل صانع وصنعته» (6) ، (وتلا بعضهم عند ذلك {وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ (96)} [الصافات: 96]، فأخبر أن الصناعات وأهلها مخلوقة) (7) . (8)",
    "foot_note": "1. رواه مسلم: كتاب القدر، باب تصريف الله القلوب كيف يشاء (16/ 203 - شرح النووي). \n2. شرح النووي على مسلم (16/ 203). \n3. فتح القدير (4/ 402). \n4. فتح القدير (2/ 74). \n5. تفسير ابن سعدي (6/ 489). \n6. حديث صحيح، أخرجه البخاري، في كتاب خلق أفعال العباد ص 39، الطبعة الثانية، تحقيق د. عبد الرحمن عميرة، دار عكاظ، جدة، وابن أبي عاصم في السنة بلفظ «إن الله خالق كل صانع وصنعته»، انظر الجامع الصحيح في القدر، ص 125.وقال الألباني حديث صحيح، كتاب السنة لابن أبي عاصم ص (1/ 158)، الطبعة الثانية، تحقيق الألباني، المكتب الإسلامي، بيروت، 1405 هـ. وهو مخرج في الصحيحة رقم (1637). \n7. خلق أفعال العباد للبخاري، ص 46. \n8. انظر: مجموع فتاوى الشيخ عبد العزيز بن باز، (3/ 476 - 480)، معارج القبول (3/ 920 - 940)، شفاء العليل (29 - 39).",
    "book_id": "70",
    "new_page_number": 16
  },
  {
    "serial_number": "97902",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": " الفصل الثالث: مذاهب الناس في القدر  المبحث الأول: سبب الخلاف في القدر (الخلاف في القدر يدور حول أمرين: أحدهما: ما يتعلق بالله تعالى، وذلك في مراتب القدر الأربع: العلم، والكتابة، والمشية، والخلق التي يثبتها أهل السنة والجماعة لله تعالى. الثاني: ما يتعلق بالعبد، هل له إرادة ومشية أم لا، وهل له قدرة أم لا؟ وهل هو فاعل لفعله حقيقة أم لا؟ ) (1) . وسبب ضلال الفرق، هو عدولهم عن الصراط المستقيم، الذي أمرنا الله باتباعه، فقال تعالى {وَأَنَّ هَذَا صِرَاطِي مُسْتَقِيمًا فَاتَّبِعُوهُ وَلَا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ} [الأنعام: 153]، والخوض في فعل الرب، قال شيخ الإسلام: وأصل ضلال الخلق في كل فرقة هو الخوض في فعل الإله بعلة (2) (فالقدرية النفاة الذين نفوا القدر قالوا: إن الله لا يريد الكفر والذنوب والمعاصي ولا يحبها ولا يرضاها، فكيف نقول إنه خلق أفعال العباد، وفيها الكفر والذنوب والمعاصي. والقدرية المجبرة آمنوا بأن الله خالق كل شيء، وزعموا أن كل شيء خلقه وأوجده فقد أحبه ورضيه. وأهل السنة والجماعة أبصروا الحقيقة كلها، فآمنوا بالحق الذي عند كل واحد من الفريقين، ونفوا الباطل الذي تلبس به كل واحد منهما. فهم يقولون: إن الله وإن كان يريد المعاصي قدراً، فهو لا يحبها، ولا يرضاها، ولا يأمر بها بل يبغضها، وينهى عنها) (3) .",
    "foot_note": "1. عبد الرحمن المحمود، القضاء والقدر، ص 301. \n2. الدرة البهية شرح القصية التائية في حل المشكلة القدرية لشيخ الإسلام، تأليف عبد الرحمن بن سعدي، ص 25، مكتبة المعارف، الرياض، 1406 هـ. \n3. عمر الأشقر، القضاء والقدر، ص 103، الطبعة الثالثة، دار النفائس، الأردن، 1415 هـ.",
    "book_id": "70",
    "new_page_number": 17
  },
  {
    "serial_number": "97903",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": " المبحث الثاني: مذاهب الناس في القدر  أولاً: الجهمية (1) : (زعموا أن عموم مشيئة الله، وعموم إرادته يقتضي: أن العبد مجبور على أفعاله، مقسور مقهور على أقواله وأفعاله: لا قدرة له على شيء من الطاعات، ولا على ترك المعاصي) (2) . (فهم يقولون أن العباد مجبورون على أعمالهم، لا قدرة لهم ولا إرادة ولا اختيار، والله وحده خالق أفعال العباد، وأعمالهم إنما تنسب إليهم مجازاً) (3) .  ثانياً: المعتزلة (4) : وهم قدرية في باب القدر. والقدرية (5) ينقسمون إلى قسمين:  القدرية الأولى: وهؤلاء هم الغلاة الذين أنكروا القدر وأنكروا علم الله السابق بالأمور، (فيقولون إن الله لا يعلم أعمال العباد قبل أن يعملوها، ولا تعلقت بها مشيئة الله، فلما شنع عليهم المسلمون، وكفروهم بذلك: تحولوا عن قولهم الأول فأثبتوا العلم، وأنكروا القدر. ولهذا كان الأئمة كالإمام أحمد وغيره، يقولون: ناظروا القدرية بالعلم فإن أنكروا العلم كفروا، وإن اعترفوا به خصموا) (6) .",
    "foot_note": "1. الجهمية: أصحاب الجهم بن صفوان، وهو من الجبرية الخالصة. ظهرت بدعته بترمذ، وقتله مسلم بن أحوز بمرو في آخر ملك بني أمية، وافق المعتزلة في نفي الصفات الأزلية وزاد عليهم بأشياء. وزعم أن الجنة والنار تبيدان وتفنيان، وأن الإيمان هو المعرفة بالله فقط. انظر: الملل والنحل للشهرستاني، ص 36، الطبعة الثانية، دار مكتبة المتنبي، بيروت 1992 م. والفرق بين الفرق للبغدادي، ص 194، الطبعة الأولى، تعليق إبراهيم رمضان، دار المعرفة، بيروت، 1415 هـ. ومعجم ألفاظ العقيدة، تصنيف عامر فالح، ص 128، الطبعة الأولى، مكتبة العبيكان، الرياض، 1417 هـ. \n2. الدرة البهية شرح القصيدة التائية، ص 22. \n3. القضاء والقدر لعبد الرحمن المحمود ص 302. \n4. المعتزلة: هم أتباع واصل بن عطاء وعمرو بن عبيد، وسموا بذلك لما اعتزلوا مجلس الحسن البصري رحمه الله، وأصول اعتقادهم خمسة، العدل، والتوحيد، والوعد والوعيد، والمنزلة بين المنزلتين، والأمر بالمعروف والنهي عن المنكر. انظر: الفرق بين الفرق ص 112، الملل والنحل ص 21، ومعجم ألفاظ العقيدة ص 377. \n5. سموا بالقدرية لإنكارهم القدر، وكذلك تسمى الجبرية المحتجون بالقدر قدرية أيضاً، والتسمية على الطائفة الأولى أغلب. شرح العقيدة الطحاوية لابن أبي العز ص (1/ 79)، و (2/ 797)، معجم ألفاظ العقيدة ص 316. \n6. الدرة البهية شرح القصيدة التائية ص 20، مجموع الفتاوى (8/ 450)، جمع عبد الرحمن ابن قاسم، مكتبة ابن تيمية، القاهرة.",
    "book_id": "70",
    "new_page_number": 18
  },
  {
    "serial_number": "97904",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "(وقد تلاشت هذه الطائفة التي تكذب بعلم الله السابق أو كادت، يقول السفاريني: قال العلماء المنكرون لهذا انقرضوا، وهم الذين كفرهم عليه الإمام مالك، والشافعي، واحمد ،غيرهم من الأئمة) (1) .  القدرية الثانية: زعموا (أن أفعال العباد وطاعاتهم ومعاصيهم، لم تدخل تحت قضاء الله وقدره، فأثبتوا قدرة الله على أعيان المخلوقات، وأوصافها، ونفوا قدرته على أفعال المكلفين، وقالوا: إن الله لم يردها ولم يشأها منهم، بل: هم الذين أرادوها وشاءوها، وفعلوها، استقلالاً بدون مشيئة الله) (2) . (فهؤلاء يقولون أن أفعال العباد ليست مخلوقة لله، وإنما العباد هم الخالقون لها، وهذا هو مذهب المعتزلة ومن وافقهم، فهم ينكرون مرتبتي المشيئة والخلق، فينفونها عن الله تعالى، ويثبتونها للإنسان) (3) .  ثالثاً الأشاعرة (4) : وهؤلاء يقولون: (إن الله سبحانه وتعالى خالق أفعال العباد، فيثبتون مرتبتي المشيئة والخلق، ولكن يقولون: إن أفعال العباد الاختيارية واقعة بقدرة الله تعالى وحدها، وليس لقدرتهم تأثير فيها، بل الله سبحانه وتعالى أجرى عادته بأن يوجد في العبد قدرة واختياراً، فإذا لم يكن هناك مانع أوجد فيه فعله المقدور مقارناً لهما، فيكون الفعل مخلوقاً لله، إبداعاً وإحداثاً، ومكسوباً للعبد، والمرء بكسبه إياه: مقارنته لقدرته وإرادته من غير أن يكون هناك منه تأثير أو مدخل في وجوده سوى كونه محلاً له) (5) . وبهذا خالفوا المعتزلة القائلين بأن الله لا يخلق أفعال العباد بل هم الخالقون لها. ولكنهم قالوا هي كسب للعباد. (فأرادوا أن يوفقوا بين الجبرية والقدرية، فجاءوا بنظرية الكسب، وهي في مآلها جبرية خالصة، لأنها تنفي أي قدرة للعبد أو تأثير، أما حقيقتها النظرية الفلسفية فقد عجز الأشاعرة أنفسهم عن فهمها فضلاً عن إفهامها لغيرهم ولهذا قيل: مما يقال ولا حقيقة تحته معقولة تدنوا إلى الأفهام الكسب عند الأشعري والحال عند البهشمي وطفرة النظام) (6) .",
    "foot_note": "1. القضاء والقدر لعمر الأشقر، ص 57. \n2. الدرة البهية شرح القصيدة التائية ص 17. \n3. القضاء والقدر لعبد الرحمن المحمود ص 305. \n4. الأشاعرة: أصحاب أبي الحسن علي بن إسماعيل الأشعري، ويثبتون لله سبع صفات، ويقولون بتقديم العقل على النقل عند التعارض، ويؤولون آيات الصفات، ولا يحتجون بأحاديث الآحاد في العقيدة. معجم ألفاظ العقيدة ص 42، الملل والنحل ص 40، وانظر للفائدة: موقف ابن تيمية من الأشاعرة لعبد الرحمن المحمود، مكتبة الرشد، الرياض. \n5. القضاء والقدر لعبد الرحمن المحمود ص 311. \n6. منهج الأشاعرة في العقيدة، للشيخ سفر الحوالي، ص 43، الطبعة الأولى، الدار السلفية، الكويت، 1407 هـ. وانظر: شفاء العليل ص 121.",
    "book_id": "70",
    "new_page_number": 19
  },
  {
    "serial_number": "97905",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": " رابعاً: عقيدة أهل السنة والجماعة: قال الطحاوي رحمه الله مبيناً عقيدة أهل السنة: (خلق الخلق بعلمه، وقدر لهم أقداراً، وضرب لهم آجالاً، ولم يخف عليه شيء قبل أن يخلقهم، وعلم ما هم عاملون قبل أن يخلقهم، وأمرهم بطاعته، ونهاهم عن معصيته، وكل شيء يجري بتقديره ومشيئته، ومشيئته تنفذ، لا مشيئة للعباد إلا ما شاء لهم، فما شاء لهم كان، وما لم يشأ لم يكن، يهدي من يشاء ويعصم ويعافي فضلاً، ويضل من يشاء، ويخذل ويبتلي عدلاً، وكلهم يتقلبون في مشيئته، بين فضله وعدله، وهو متعال عن الأضداد والأنداد، لا راد لقضائه، ولا معقب لحكمه، ولا غالب لأمره، آمنا بذلك كله، وأيقنا أن كلاً من عنده) (1) . ثم قال: (والميثاق الذي أخذه الله تعالى من آدم وذريته حق. وقد علم الله فيما لم يزل عدد من يدخل الجنة، وعدد من يدخل النار جملةً واحدة، فلا يزاد في ذلك العدد، ولا ينقص منه. وكذلك أفعالهم فيما علم منهم أن يفعلوه، وكل ميسر لما خلق له، والأعمال بالخواتيم، والسعيد من سعد بقضاء الله، والشقي من شقي بقضاء الله. وأصل القدر سر الله تعالى في خلقه، لم يطلع على ذلك ملك مقرب ولا نبي مرسل، والتعمق والنظر في ذلك ذريعة الخذلان، وسلم الحرمان، ودرجة الطغيان، فالحذر كل الحذر من ذلك نظراً وفكراً ووسوسةً، فإن الله تعالى طوى علم القدر عن أنامه، ونهاهم عن مرامه، كما قال تعالى في كتابه: {لَا يُسْأَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْأَلُونَ (23)} [الأنبياء: 23]، فمن سأل: لم فعل؟ فقد رد حكم الكتاب، ومن رد حكم الكتاب كان من الكافرين) (2) . ثم قال أيضاً: (ونؤمن باللوح والقلم، وبجميع ما فيه قد رقم، فلو اجتمع الخلق كلهم على شيء كتبه الله تعالى فيه أنه كائن، ليجعلوه غير كائن لم يقدروا عليه، ولو اجتمعوا على شيء لم يكتبه الله تعالى فيه، ليجعلوه كائناً لم يقدروا عليه، جف القلم بما هو كائن إلى يوم القيامة، وما أخطأ العبد لم يكن ليصيبه، وما أصابه لم يكن ليخطئه. وعلى العبد أن يعلم أن الله قد سبق علمه في كل كائن من خلقه، فقدر ذلك تقديراً محكماً مبرماً، ليس فيه ناقض، ولا معقب، ولا مزيل، ولا مغير، ولا ناقص، ولا زائد من خلقه في سماواته وأرضه، وذلك من عقد الإيمان، وأصول المعرفة، والاعتراف بتوحيد الله تعالى وربوبيته، كما قال تعالى في كتابه: {وَخَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهُ تَقْدِيرًا (2)} [الفرقان: 2]، وقال تعالى: {وَكَانَ أَمْرُ اللَّهِ قَدَرًا مَقْدُورًا (38)} [الأحزاب: 38]، فويل لمن صار لله تعالى في القدر خصيماً، أحضر للنظر فيه قلباً سقيماً، لقد التمس بوهمه في فحص الغيب سراً كتيماً، وعاد بما قال أفاكاً أثيماً) (3) .",
    "foot_note": "1. العقيدة الطحاوية للإمام أبي جعفر أحمد بن محمد الطحاوي، ص 12 - 13، الطبعة الأولى، تعليق الشيخ عبد العزيز بن باز، مكتبة ابن تيمية، القاهرة، 1415 هـ. \n2. العقيدة الطحاوية ص 22 - 23. \n3. العقيدة الطحاوية ص 26 - 28.",
    "book_id": "70",
    "new_page_number": 20
  },
  {
    "serial_number": "97906",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "وقال شيخ الإسلام ابن تيمية رحمه الله: (مذهب أهل السنة والجماعة في هذا الباب وغيره، ما دل عليه الكتاب والسنة، وكان عليه السابقون الأولون من المهاجرين والأنصار، والذين اتبعوهم بإحسان، وهو أن الله خالق كل شيء، وربه، ومليكه، وقد دخل في ذلك جميع الأعيان القائمة بأنفسها، وصفاتها القائمة بها، من أفعال العباد، وغير أفعال العباد وأنه سبحانه ما شاء كان، وما لم يشأ لم يكن، فلا يكون في الوجود شيء إلا بمشيئته، وقدرته، لا يمتنع عليه شيء شاءه، بل هو قادر على كل شيء، ولا يشاء شيئا إلا وهو قادر عليه، وأنه - سبحانه - يعلم ما كان، وما يكون، وما لم يكن لو كان كيف يكون، وقد دخل في ذلك أفعال العباد، وغيرها، وقد قدر الله مقادير الخلائق قبل أن يخلقهم، قدر آجالهم، وأرزاقهم، وأعمالهم، وكتب ذلك، وكتب ما يصيرون إليه من سعادة، وشقاوة، فهم يؤمنون بخلقه لكل شيء، وقدرته على كل شيء، ومشيئته لكل ما كان، وعلمه بالأشياء قبل أن تكون، وتقديره لها، وكتابته إياها قبل أن تكون) (1) . إلى أن قال: (وسلف الأمة وأئمتها متفقون أيضا على أن العباد مأمورون بما أمرهم الله به، منهيون عما نهاهم عنه، ومتفقون على الإيمان بوعده، ووعيده الذي نطق به الكتاب والسنة، ومتفقون على أنه لا حجة لأحد على الله في واجب تركه، ولا محرم فعله، بل لله الحجة البالغة على عباده) (2) . وقال: (ومما اتفق عليه سلف الأمة وأئمتها مع إيمانهم بالقضاء والقدر، وأن الله خالق كل شيء، وأنه ما شاء كان، وما لم يشأ لم يكن، وأنه يضل من يشاء، ويهدي من يشاء أن العباد لهم مشيئة وقدرة، يفعلون بمشيئتهم، وقدرتهم ما أقدرهم الله عليه، مع قولهم: إن العباد لا يشاؤون إلا أن يشاء الله، كما قال الله تعالى: {كَلَّا إِنَّهُ تَذْكِرَةٌ (54) فَمَنْ شَاءَ ذَكَرَهُ (55) وَمَا يَذْكُرُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ هُوَ أَهْلُ التَّقْوَى وَأَهْلُ الْمَغْفِرَةِ (56)} [المدثر: 54 - 56]) (3) . وقال أيضا: (مذهب أهل السنة والجماعة أن الله تعالى خالق كل شيء ومليكه، لا رب غيره ولا خالق سواه، ما شاء كان وما لم يشاء لم يكن، وهو على كل شيء قدير، وبكل شيء عليم، والعبد مأمور بطاعة الله، وطاعة رسوله، ومنهي عن معصية الله، ومعصية رسوله، فمن أطاع كان ذلك نعمة ومن عصى كان مستحقاً للذم والعقاب، وكان لله عليه الحجة البالغة، ولا حجة لأحد على الله تعالى، وكل ذلك كان بقضاء الله وقدره ومشيئته وقدرته، لكن يحب الطاعة ويأمر بها، ويثيب أهلها على فعلها ويكرمهم، ويبغض المعصية وينهى عنها، ويعاقب أهلها ويهينهم.",
    "foot_note": "1. مجموع فتاوى شيخ الإسلام (8/ 449 - 450). \n2. المرجع السابق (8/ 452). \n3. المرجع السابق (8/ 459).",
    "book_id": "70",
    "new_page_number": 21
  },
  {
    "serial_number": "97907",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "وما يصيب العبد من النعم فالله أنعم بها عليه، وما يصيبه من الشر فبذنوبه ومعاصيه كما قال تعالى: {وَمَا أَصَابَكُمْ مِنْ مُصِيبَةٍ فَبِمَا كَسَبَتْ أَيْدِيكُمْ} [الشورى: 30] وقال تعالى: {مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ وَمَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ} [النساء: 79]، أي ما أصابك من خصب ونصر وهدى فالله أنعم به عليك، وما أصابك من حزن وذل وشر فبذنوبك وخطاياك، وكل الأشياء كائنة بمشيئة الله، وقدرته وخلقه، فلا بد أن يؤمن العبد بقضاء الله وقدره، وأن يوقن العبد بشرع الله وأمره. فمن نظر إلى الحقيقة القدرية وأعرض عن الأمر والنهي والوعد والوعيد كان مشابهاً للمشركين، ومن نظر إلى الأمر والنهي، وكذب بالقضاء والقدر كان مشابهاً للمجوسيين، ومن آمن بهذا وبهذا، فإذا أحسن حمد الله تعالى، وإذا أساء استغفر الله تعالى، وعلم أن ذلك بقضاء الله وقدره، فهو من المؤمنين) (1) . قال القحطاني رحمه الله في نونيته: ركن الديانة أن تصدق بالقضا لا خير في بيت بلا أركان الله قد علم السعادة والشقا وهما ومنزلتهما ضدان لا يملك العبد الضعيف لنفسه رشداً ولا يقدر على خذلان سبحان من يجري الأمور بحكمة في الخلق بالأرزاق والحرمان نفذت مشيئته بسابق علمه في خلقه عدلاً بلا عدوان والكل في أم الكتاب مسطر من غير إغفال ولا نقصان فاقصد هديت ولا تكن متغالياً إن القدور تفور بالغليان (2)",
    "foot_note": "1. المرجع السابق (8/ 63 - 64). \n2. نونية القحطاني، لأبي محمد عبد الله بن محمد الأندلسي، ص 15، الطبعة الثالثة، تصحيح وتعليق محمد بن أحمد، مكتبة السوادي، جدة، 1415 هـ.",
    "book_id": "70",
    "new_page_number": 22
  },
  {
    "serial_number": "97908",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": " الفصل الرابع: ثمرات الإيمان بالقضاء والقدر الإيمان بالقدر على الوجه الصحيح يثمر ثمرات جليلة تعود على الأفراد والمجتمعات، في الدنيا والآخرة، فمن تلك الثمرات ما يلي: 1 - أن الإيمان لا يتم إلا بالإيمان بالقدر: وهذه الثمرة هي أعظم الثمار فالعبد لا يكون مؤمن حتى يؤمن بأركان الإيمان الستة ومنها الإيمان بالقضاء والقدر، عن عمر بن الخطاب رضي الله عنه في سؤال جبريل عليه السلام الرسول صلى الله عليه وسلم عن الإيمان قال: «أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر، وتؤمن بالقدر خير وشره. قال: -يعني جبريل- صدقت» (1) . وعن جابر رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: «لا يؤمن عبد حتى يؤمن بالقدر خيره وشره من الله، وحتى يعلم أن ما أصابه لم يكن ليخطئه، وأن ما أخطأه لم يكن ليصيبه» (2) . 2 - من ثمرات الإيمان بالقدر: أن الإيمان الكامل يمنع من دخول النار والإيمان ولو قليلاً يمنع من الخلود فيها (3) : وهذا متعلق بالثمرة التي قبله، فإذا حقق الإيمان - ولا يمكن أن يحققه إلا بالإيمان بالقدر- كان ذلك مانعا له من دخول النار، أما إذا كان الإيمان ناقصا بسب ضعف إيمانه بالقدر فإنه قد يكون ذلك ذلك النقص سببا لدخوله للنار؛ ولكنه لا يخلد فيها. قال الله تعالى: {الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ أُولَئِكَ لَهُمُ الْأَمْنُ وَهُمْ مُهْتَدُونَ (82)} [الأنعام: 82]. 3 - من ثمرات الإيمان بالقدر: حصول طعم الإيمان ومغفرة الذنوب ودخول الجنة: لن يذوق أحد طعم الإيمان إلا من رضي بقدر الله عليه، ولهذا قال النبي صلى الله عليه وسلم: «ذاق طعم الإيمان من رضي بالله رباً، وبالإسلام ديناً، وبمحمد رسولاً» (4) . والرضى بذلك يقتضي الفرح بذلك، والسرور بربوبية الله وحسن تدبيره واقضيته عليه (5) .",
    "foot_note": "1. سبق تخريجه ص 1 حاشية رقم 1. \n2. سبق تخريجه ص 6 حاشية رقم 4. \n3. التوضيح لشجرة الإيمان ص 73، الطبعة الأولى، اعتنى به أشرف عبد المقصود، أضواء السلف، الرياض، 1419 هـ .. \n4. رواه مسلم، كتاب الإيمان، باب ذاق طعم الإيمان (2/ 2 - شرح النووي). \n5. ابن سعدي، التوضيح والبيان لشجرة الإيمان ص 30.",
    "book_id": "70",
    "new_page_number": 23
  },
  {
    "serial_number": "97909",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "والإيمان بربوبية الله يقتضي أيضاً الإيمان والتسليم لتدبيره لكل شيء من شؤون العبد، بل ولشؤون الكون كله. ومن وصل إلى هذه المنزلة من الرضا فإنه يستحق المغفرة، إذ يقول النبي صلى الله عليه وسلم: «من قال حين يسمع المؤذن: وأنا أشهد أن لا إله إلا الله وحده لا شريك له، وأشهد أن محمداً عبده ورسوله، رضيت بالله رباً، وبمحمد رسولاً، وبالإسلام ديناً، غفر له ذنبه» (1) . بل إن هذا يمتد أثره إلى يوم القيامة، حتى يكون حقاً على الله أن يرضيه ويدخله الجنة. يقول النبي صلى الله عليه وسلم فيما يرويه عن ربه: «ما لعبدي عندي جزاء إذا قبضت صفيه من أهل الدنيا، ثم احتسبه إلا الجنة» (2) . 4 - من ثمرات الإيمان بالقدر: تحقيق العبودية لله عز وجل: وهو الغاية التي شمر إليها السالكون، وأمها القاصدون، ولحظ إليها العاملون، فتقر عينه بربه، ويسكن إليه قلبه، وتطمئن إليه جوارحه ويستولي ذكره على لسان محبه وقلبه، وتنقاد الجوارح لطاعته (3) ، وذلك لأنه عبد لله، مربوب له يتصرف به كيف شاء، فيرض ويسلم بقضاء الله وقدره، فيعلم أن منع الله سبحانه وتعالى لعبده المؤمن المحب عطاء، وابتلاءه إياه عافية. قال سفيان الثوري: منعه عطاء، وذلك: أنه لم يمنع عن بخل ولا عدم، وإنما نظر في خير عبده المؤمن فمنعه اختياراً وحسن نظر، وهذا كما قال؛ فإنه سبحانه لا يقضى لعبده المؤمن قضاء إلا كان خيراً له، ساءه ذلك القضاء أو سره. فقضاؤه لعبده المؤمن المنع عطاء؛ وإن كان في صورة المنع. ونعمة وإن كانت في صورة محنه. وبلاؤه عافية؛ وإن كان في صورة بلية. ولكن لجهل العبد وظلمه لا يعد العطاء والنعمة والعافية إلا ما التذ به في العاجل، وكان ملائماً لطبعه، ولو رزق من المعرفة حظاً وافراً لعد المنع نعمة، والبلاء رحمة، وتلذذ بالبلاء أكثر منه لذته بالعافية، وتلذذ بالفقر أكثر من لذته بالغنى، وكان في حال القلة أعظم شكراً من حال الكثرة (4) . ويكون كالأعرابي الذي أصبح وقد مات له أباعر كثيرة فقال: لا والذي أنا عبد في عبادته لولا شماتة أعداء ذوي إحن ما سرني أن إبلي في مباركها وأن شيئاً قضاه الله لم يكن (5)",
    "foot_note": "1. رواه مسلم، كتاب الصلاة، باب استحباب القول مثل قول المؤذن (4/ 86 - شرح النووي). \n2. رواه البخاري، كتاب الرقاق، باب العمل الذي يبتغى به وجه الله (11/ 241 - فتح الباري). \n3. مدارج السالكين ص (1/ 430 - 431)، تحقيق محمد حامد الفقي، دار الرشاد الحديثة، الدار البيضاء، المغرب. \n4. المرجع السابق (2/ 215 - 216). \n5. مختصر منهج القاصدين للمقدسي، ص 338، الطبعة الثانية، تعليق عبد الله الأنصاري، دار المعرفة، بيروت، 1416 هـ.",
    "book_id": "70",
    "new_page_number": 24
  },
  {
    "serial_number": "97910",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "قال ابن القيم: (لله سبحانه على عبده أمر أمره به، وقضاء يقضيه عليه، ونعمة ينعم بها عليه، فلا ينفك من هذه الثلاثة. والقضاء نوعان: إما مصائب وإما معايب. وله عليه عبودية في هذه المراتب كلها. فأحب الخلق إليه من عرف عبوديته في هذه المراتب ووفاها حقها فهذا أقرب الخلق إليه. وأبعدهم منه من جهل عبوديته في هذه المراتب كلها. فعبوديته في الأمر: امتثاله، إخلاصاً واقتداءً برسول الله صلى الله عليه وسلم، وفي النهي: اجتنابه، خوفاً منه وإجلالاً ومحبة. وعبوديته في قضاء المصائب: الصبر عليها، ثم الرضا بها، وهو أعلى منه، ثم الشكر عليها، وهو أعلى من الرضا، وهذا إنما يتأتى منه إذا تمكن حبه من قلبه، وعلم حسن اختياره له وبره به، ولطفه به، وإحسانه إليه بالمصيبة، وإن كره المصيبة. وعبوديته في قضاء المعائب: المبادرة إلى التوبة منها، والتنصل والوقوف في مقام الاعتذار والانكسار، عالماً بأنه لا يرفعها إلا هو، ولا يقيه شرها سواه، وأنها إن استمرت أبعدته من قربه، وطردته من بابه، فيراها من الضر الذي لا يكشفه غيره، حتى إنه ليراها أعظم من ضر البدن … وأما عبودية النعم فمعرفتها والاعتراف بها أولا، ثم العياذ به أن يقع في قلبه نسبتها وإضافتها إلى سواه وإن كان سببا من الأسباب فهو مسببه ومقيمه، فالنعمة منه وحده بكل وجه واعتبار، ثم الثناء بها عليه ومحبته عليها وشكره بأن يستعملها في طاعته) (1) . وفي الإيمان بالقدر: الاعتراف بأنه مربوب مدبر مأمور منهي، إنما يتصرف بحكم العبودية، لا بحكم الاختيار لنفسه. والله سبحانه وتعالى هو المتصرف فيه، فنفسه بيد ربه وسيده، وناصيته بيده وقلبه بين أصبعين من أصابعه، وموته وحياته، وسعادته وشقاوته، وعافيته وبلاؤه كله إليه سبحانه، ليس إلى العبد منه شيء. فهو عبد لله من جميع الوجوه، صغيراً وكبيراً، حياً وميتاً، مطيعاً وعاصياً، معافى ومبتلى، بالروح والقلب واللسان والجوارح (2) .",
    "foot_note": "1. الفوائد ص 46 - 47، ترتيب وتعليق علي حسن عبد الحميد، دار ابن الجو زي، الدمام، 1417 هـ .. \n2. الفوائد ص 50 - 52.",
    "book_id": "70",
    "new_page_number": 25
  },
  {
    "serial_number": "97911",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "5 - من ثمرات الإيمان بالقدر: أن الإيمان بالقدر طريق إلى توحيد الله: (وهو أن يشهد انفراد الرب تبارك وتعالى بالخلق والحكم، وأنه ما شاء كان وما لم يشأ لم يكن، وأنه لا تتحرك ذرة إلا بإذنه. وأن الخلق مقهورون تحت قبضته، وأنه ما من قلب إلا وهو بين إصبعين من أصابعه. إن شاء أن يقيمه أقامه، وإن شاء يزيغه أزاغه. فالقلوب بيده. وهو مقلبها ومصرفها كيف شاء وكيف أراد، وأنه هو الذي آتى نفوس المؤمنين تقواها، وهو الذي هداها وزكاها وألهم نفوس الفجار وأشقاها، من يهد الله فلا مضل له، ومن يضلل فلا هادي له، يهدي من يشاء بفضله ورحمته، ويضل من يشاء بعدله وحكمته. هذا فضله وعطاؤه، وما فضل الكريم بمنون. وهذا عدله وقضاؤه {لَا يُسْأَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْأَلُونَ (23)} [الأنبياء: 23] (1) . (وبهذا يتحقق للعبد مقام {إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ (5)} علماً وحالا، فيثبت قدم العبد في توحيد الربوبية، ثم يرقى منه صاعداً إلى توحيد الإلهية. فإنه إذا تيقن أن الضر والنفع، والعطاء والمنع، والهدى والضلال، والسعادة والشقاء: كل ذلك بيد الله لا بيد غيره، وأنه الذي يقلب القلوب، ويصرفها كيف يشاء وأنه لا موفق إلا من وفقه وأعانه، ولا مخذول إلا من خذله وأهانه وتخلى عنه. وأن أصح القلوب وأسلمها وأقومها، وأرقها وأصفاها، وأشدها وألينها: من اتخذه وحده إلهاً ومعبوداً. فكان أحب إليه من كل ما سواه، وأخوف عنده من كل ما سواه، وأرجى له من كل سواه. فتتقدم محبته في قلبه جميع المحاب، فتنساق المحاب تبعاً لها كما ينساق الجيش تبعاً للسلطان. ويتقدم خوفه في قلبه جميع المخوفات، فتنساق المخاوف كلها تبعاً لخوفه. ويتقدم رجاؤه في قلبه جميع الرجاء، فينساق كل رجاء تبعاً لرجائه. فهذا علامة توحيد الإلهية في هذا القلب، والباب الذي دخل إليه منه توحيد الربوبية، أي باب توحيد الإلهية: هو توحيد الربوبية) (2) . 6 - من ثمرات الإيمان بالقدر: التعبد لله بأسمائه وصفاته: وهو معرفة تعلق الوجود خلقاً وأمراً بالأسماء الحسنى، والصفات العلا، وارتباطه بها، وإن كان العالم - بما فيه - من بعض آثارها ومقتضياتها (3) . فمن أسمائه سبحانه \" الغفار، التواب، العفوّ \" فلا بد لهذه الأسماء من متعلقات، ولابد من جناية تغفر، وتوبة تقبل، وجرائم يعفى عنها. ولا بد لاسمه \" الحكيم \" من متعلق يظهر في حكمه. إذ اقتضاء هذه الأسماء لآثارها كاقتضاء اسم \" الخالق، الرازق، المعطى، المانع \" للمخلوق والمرزوق والمعطى والممنوع. وهذه الأسماء كلها حسنى.",
    "foot_note": "1. مدارج السالكين (1/ 410). \n2. المرجع السابق (1/ 411). \n3. المرجع السابق (1/ 417).",
    "book_id": "70",
    "new_page_number": 26
  },
  {
    "serial_number": "97912",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "والرب تعالى يحب ذاته وأوصافه وأسماءه. فهو عفو يحب العفو، ويحب المغفرة. ويحب التوبة. ويفرح بتوبة عبده حين يتوب إليه أعظم فرح يخطر بالبال وكان تقدير ما يغفره ويعفو عن فاعله، ويحلم عنه، ويتوب عليه ويسامحه: من موجب أسمائه وصفاته، وحصول ما يحبه ويرضاه من ذلك. وما يحمد به نفسه ويحمده به أهل سمواته وأهل أرضه: ما هو من موجبات كماله ومقتضى حمده وهو سبحانه الحميد المجيد، وحمده ومجده يقتضيان آثارهما. ومن آثارهما: مغفرة الزلات، وإقالة العثرات، والعفو عن السيئات، والمسامحة على الجنايات، مع كمال القدرة على استيفاء الحق، والعلم منه سبحانه بالجناية ومقدار عقوبتها. فحلمه بعد علمه وعفوه بعد قدرته، ومغفرته عن كمال عزته وحكمته. كما قال المسيح صلى الله عليه وسلم: {إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ (118)} [المائدة: 118] أي فمغفرتك عن كمال قدرتك وحكمتك، لست كمن يغفر عجزاً، ويسامح جهلا بقدر الحق، بل أنت عليم بحقك. قادر على استيفائه، حكيم في الأخذ به. ومن أسمائه الحكيم، فهو يشهد حكمة الله في تقديره على عبده ما يبغضه سبحانه ويكرهه، ويلوم ويعاقب عليه، وأنه لو شاء لعصمه منه، ولحال بينه وبينه. وأنه سبحانه لا يعصى قسراً. وأنه لا يكون في العالم شيء إلا بمشيئته {لَهُ الْخَلْقُ وَالْأَمْرُ تَبَارَكَ اللَّهُ رَبُّ الْعَالَمِينَ (54) ادْعُوا} [الأعراف: 54]. وهؤلاء يشهدون أن الله سبحانه لم يخلق شيئاً عبثاً ولا سدى، وأن له الحكمة البالغة في كل ما قدره وقضاه من خير وشر، وطاعة ومعصية، وحكمة باهرة تعجز العقول عن الإحاطة بكنهها، وتكل الألسن عن التعبير عنها. فمصدر قضائه وقدره، لما يبغضه ويسخطه: اسمه \" الحكيم \" الذي بهرت حكمته الألباب، وقد قال تعالى لملائكته - لما قالوا {أَتَجْعَلُ فِيهَا مَنْ يُفْسِدُ فِيهَا وَيَسْفِكُ الدِّمَاءَ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ} فأجابهم سبحانه بقوله {إِنِّي أَعْلَمُ مَا لَا تَعْلَمُونَ (30)} [البقرة: 30]، فلله سبحانه في ظهور المعاصي والذنوب والجرائم، وترتب آثارها من الآيات والحكم. وأنواع التعرفات إلى خلقه، وتنويع آياته، ودلائل ربوبيته ووحدانيته، وإلهيته، وحكمته، وعزته، وتمام ملكه، وكمال قدرته. وإحاطة علمه -: ما يشهده أولو البصائر عياناً ببصائر قلوبهم، فيقولون {رَبَّنَا مَا خَلَقْتَ هَذَا بَاطِلًا سُبْحَانَكَ} [آل عمران: 191]، إن هي إلا حكمتك الباهرة، وآياتك الظاهرة.",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 27
  },
  {
    "serial_number": "97913",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "ولله في كل تحريكة وتسكينه أبداً شاهد وفي كل شيء له آية تدل على أنه واحد (1) فمن تأمل سريان أثار الأسماء والصفات في العالم، وفي الأمر، تبين له أن مصدر قضاء هذه الجنايات من العبيد وتقديرها: هو من كمال الأسماء والصفات والأفعال. وغاياتها أيضاً: مقتضى حمده ومجده، كما هو مقتضى ربوبيته وإلهيته، فله في كل ما قضاه وقدره الحكمة البالغة، والآيات الباهرة، والتعرفات إلى عباده بأسمائه وصفاته، واستدعاء محبتهم له، وذكرهم له، وشكرهم له، وتعبدهم له بأسمائه الحسنى (2) . 7 - من ثمرات الإيمان بالقدر: تحقق ولاية الله تعالى: قال الله تعالى: {أَلَا إِنَّ أَوْلِيَاءَ اللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ (62) الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ (63)} [يونس: 62 - 63] (3) ، ومن الأمور التي يجب الإيمان بها: الإيمان بالقدر؛ فإذا لم يؤمن بالقدر لم يكن من أولياء الله. 8 - من ثمرات الإيمان بالقدر: أن الله يدافع عن الذين آمنوا: قال تعالى: {اللَّهَ يُدَافِعُ عَنِ الَّذِينَ آمَنُوا إِنَّ} [الحج: 38]، يدافع عنهم: المكاره قبل نزوله، ويرفعها أو يخففها بعد نزولها (4) ، وهذا إنما يكون للمؤمنين، ومن جملة ما يؤمنون به الإيمان بالقدر. 9 - من ثمرات الإيمان بالقدر: رضا الله عنه، فمن رضي بالله ربا رضي الله عنه، ومن رضي عن ربه سبحانه وتعالى في جميع الحالات أثمر رضى ربه عنه: فإذا رضى عنه بالقليل من الرزق: رضى ربه عنه بالقليل من العمل. وإذا رضى عنه في جميع الحالات، واستوت عنده، وجده أسرع شيء إلى رضاه إذا ترضاه وتملقه (5) . 10 - من ثمرات الإيمان بالقدر: أنه يورث محبة الله تعالى لعبده: ولا شك أن هذه أعلى المطالب، وأعلى المنى أن يحظى العبد بمحبة الله تبارك وتعالى له، قال الله تعالى مخاطباً نبيه صلى الله عليه وسلم: {فَإِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللَّهِ إِنَّ اللَّهَ يُحِبُّ الْمُتَوَكِّلِينَ (159)} [آل عمران: 159]، وهم الراضون بقضائه والمستسلمون لحكمه فيهم، وافق ذلك منهم هوى أو خالفه (6) ، قال صلى الله عليه وسلم: «إذا احب الله قوماً ابتلاهم» (7) .",
    "foot_note": "1. المرجع السابق (1/ 406 - 407). \n2. المرجع السابق (1/ 419 - 420). \n3. التوضيح لشجرة الإيمان ص 69. \n4. المرجع السابق ص 71 - 72. \n5. مدارج السالكين (2/ 206). \n6. التوكل على الله وعلاقته بالأسباب لعبد الله الدميجي، ص 118، الطبعة الأولى، دار الوطن، الرياض، 1417 هـ. \n7. رواه الترمذي، ورواه الطبراني في الأوسط. وهو في السلسلة الصحيحة رقم 146.",
    "book_id": "70",
    "new_page_number": 28
  },
  {
    "serial_number": "97914",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "11 - من ثمرات الإيمان بالقدر: الثقة بالله تعالى: لأن المؤمن بقضاء الله وقدره يعلم أن تقدير الله له فيه الخير، قال الله تعالى لأم موسى: {فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلَا تَخَافِي وَلَا تَحْزَنِي} [القصص: 7]، فإن فعلها هذا هو عين ثقتها بالله تعالى، إذ لولا كمال ثقتها بربها لما ألقت بولدها وفلذة كبدها في تيار الماء تتلاعب به أمواجه، وجرياته إلى حيث ينتهي أو يقف (1) . 12 - من ثمرات الإيمان بالقدر: التسليم وهو نوعان: تسليم لحكمه الديني الأمري. وتسليم لحكمه الكوني القدري. فأما الأول: فهو تسليم المؤمنين العارفين، قال تعالى: {وَرَبِّكَ لَا يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لَا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجًا مِمَّا قَضَيْتَ وَيُسَلِّمُوا تَسْلِيمًا (65)} [النساء: 65]. وأما الثاني: فهو تسليم للحكم الكوني: وهي مسألة الرضى بالقضاء. فهو يحمد إذا لم يؤمر العبد بمنازعته ودفعه، ولم يقدر على ذلك، كالمصائب التي لا قدرة له على دفعها. وأما الأحكام التي أمر بدفعها: فلا يجوز له التسليم إليها، بل العبودية: مدافعتها بأحكام أخر، أحب إلى الله منها (2) . ولقد تأثر رسول الله صلى الله عليه وسلم لفقد ولده إبراهيم، ولكنه قال: «إن العين تدمع والقلب يحزن ولا نقول إلا ما يرضي ربنا، وإنا بفراقك يا إبراهيم لمحزونون» (3) . فالتسليم هو الخلاص من شبهة تعارض الخبر، أو شهوة تعارض الأمر، أو إرادة تعارض الإخلاص، أو اعتراض يعارض القدر والشرع. وصاحب هذا التخلص: هو صاحب القلب السليم الذي لا ينجو يوم القيامة إلا من أتى الله به، فإن التسليم ضد المنازعة (4) .",
    "foot_note": "1. مدارج السالكين (2/ 143). \n2. مدارج السالكين (2/ 146). \n3. رواه البخاري، كتاب الجنائز، باب قول النبي صلى الله عليه وسلم «إنا بك لمحزونون» (3/ 172 - فتح الباري). \n4. مدارج السالكين (2/ 147).",
    "book_id": "70",
    "new_page_number": 29
  },
  {
    "serial_number": "97915",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "13 - الإيمان بالقدر على وجه الحقيقي يكشف للإنسان حكمة الله عز وجل فيما يقدره من خير أو شر: فيعرف الإنسان بذلك أن وراء تفكيره، وتخيلاته من هو أعظم وأعلم، ولهذا كثيراً ما يقع الشيء فنكرهه وهو خير لنا؟ كم من الناس من يتبرم ويضيق صدره لفوات محبوب أو نزول مكروب، وما أن ينكشف الأمر ويستبين سر القدر إلا وتجده جذلاً مسروراً، لأن العاقبة كانت حميدة بالنسبة له، وصدق الله تعالى إذ يقول: {وَعَسَى أَنْ تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَكُمْ وَعَسَى أَنْ تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَكُمْ وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ (216)} [البقرة: 216]. وما أجمل قول من قال: كم نعمة لا تستقل بشكرها لله في طي المكاره كامنة وقول الآخر: تجري الأمور على حكم القضاء وفي طي الحوادث محبوب ومكروه وربما سرني ما كنت أحذره وربما ساءني ما كنت أرجوه (1) 14 - من ثمرات الإيمان بالقدر: أن الإيمان بالقدر يفتح باب حسن الخلق مع الله تعالى ومع الناس: فإن حسن الخلق من الرضى، وسوء الخلق من السخط. وحسن الخلق يبلغ بصاحبه درجة الصائم القائم، وسوء الخلق يأكل الحسنات كما تأكل النار الحطب (2) . 15 - من ثمرات الإيمان بالقدر: إحسان الظن بالله، وقوة الرجاء: فالمؤمن بالقدر حسن الظن بالله، قوي الرجاء به في كل أحواله، يصدق عليه قول القائل: ما مسني قدر بضر أو رضا إلا وجدت به إليك طريقا. (لأنه عارف بربه، حسن الظن به، لا يتهمه فيما يجريه عليه من أقضيته وأقداره، فحسن ظنه به يوجب له استواء الحالات عنده ورضاه بما يختاره له سيده سبحانه، وسوء الحال، والظن بالله خلاف ما هو أهله. والرضى يخلصه من ذلك كله ويفتح له باب جنة الدنيا قبل جنة الآخرة) (3) .",
    "foot_note": "1. انظر: جنة الرضا في التسليم لما قدر الله وقضى للغرناطي ص 3/ 52، نقلا عن القضاء والقدر للحمد ص 29. \n2. مدارج السالكين (2/ 220). \n3. المرجع السابق (2/ 206 - 207).",
    "book_id": "70",
    "new_page_number": 30
  },
  {
    "serial_number": "97916",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "16 - من ثمرات الإيمان بالقدر: التوبة والرجوع إلى الله: فإن العبد إذا وقع في الذنب خرج من قلبه الغلظة والقسوة والكيفية الغضبية التي كانت عنده لمن صدر منه ذنب حتى لو قدر عليه لأهلكه وربما دعاء الله عليه أن يهلكه ويأخذه غضباً منه لله وحرصاً على ألا يعصي فلا يجد في قلبه رحمة للمذيبين الخاطئين ولا يراهم إلا بعين الاحتقار والازدراء ولا يذكرهم إلا بلسان الطعن فيهم والعيب لهم والذم فإذا جرت عليهم المقادير وخلي ونفسه استغاث الله والتجأ إليه وتململ بين يديه تململ السليم ودعاه دعاء المضطر فتبدلت تلك الغلظة على المذنبين رقة وتلك القساوة على الخاطئين رحمه وليناً مع قيامه بحدود الله، وتبدل دعاءهم عليهم دعاء لهم، وجعل لهم وظيفة من عمره يسأل الله أن يغفر لهم فما أنفعه لهم من مشهد وما اعظم جدواه عليه والله اعلم (1) . 17 - من ثمرات الإيمان بالقدر: الخوف والحذر من الله: فالمؤمن بالقدر على حذر من الله، إذ لا يأمن مكر الله إلا القوم الخاسرون، فلا يغتر بعمله مهما كثر؟ فإن القلوب بين أصبعين من أصابع الرحمن يقلبها حيث يشاء، والخواتيم علمها عند الله عز وجل. 18 - من ثمرات الإيمان بالقدر: التوكل واليقين والاستسلام لله، والاعتماد عليه: لأن رضى العبد بتدبيره الله له يتضمن إفراده بالتوكل عليه، والاستعانة به، والثقة به، والاعتماد عليه، وأن يكون راضياً بكل ما يفعل به. قال ابن القيم: (فصل والأسماء الحسنى والصفات العلا مقتضية لآثارها من العبودية والأمر، اقتضاءها لآثارها من الخلق والتكوين، أعني من موجبات العلم بها والتحقق بمعرفتها. وهذا مطرد في جميع أنواع العبودية التي على القلب والجوارح. فعلم العبد بتفرد الرب تعالى بالضر والنفع والعطاء والمنع والخلق والرزق والإحياء والإماتة يثمر له عبودية التوكل عليه باطناً ولوازم التوكل وثمراته ظاهراً) (2) ، كما قال تعالى: {قُلْ لَنْ يُصِيبَنَا إِلَّا مَا كَتَبَ اللَّهُ لَنَا} [التوبة: 151]. (فاستراح حينئذ من الهموم والغموم والأنكاد والحسرات، وحمل كله وحوائجه ومصالحه من لا يبالي بحملها، ولا يثقله ولا يكترث بها، فتولاها دونه، وأراه لطفه وبره ورحمته وإحسانه فيها من غير تعب من العبد ولا نصب ولا اهتمام منه، لأنه قد صرف اهتمامه كله إليه، وجعله وحده همه، فصرف عنه اهتمامه بحوائجه ومصالح دنياه، وفرغ قلبه منها، فما أطيب عيشه! وما أنعم قلبه وأعظم سروره وفرحه! وإن أبى إلا تدبيره لنفسه، واختياره لها، واهتمامه بحظه - دون حق ربه - خلاه وما اختاره، وولاه ما تولى، فحضره الهم والغم والحزن والنكد والخوف والتعب وكسف البال وسوء الحال، فلا قلب يصفو، ولا عمل يزكو، ولا أمل يحصل، ولا راحة يفوز بها، ولا لذة يتهنى بها، بل قد حيل بينه وبين مسرته وفرحه وقرة عينه، فهو يكدح في الدنيا كدح الوحش، ولا يظفر منها بأمل ولا يتزود منها لمعاد) (3) .",
    "foot_note": "1. المرجع السابق (1/ 426). \n2. مفتاح دار السعادة ص (2/ 90)، طبعة رئاسة البحوث العلمية والإفتاء، الرياض. \n3. الفوائد ص 84 - 85.",
    "book_id": "70",
    "new_page_number": 31
  },
  {
    "serial_number": "97917",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "والتوكل على الله والاعتماد عليه لا ينافي الأخذ بالأسباب وقد سئل النبي صلى الله عن إسقاط الأسباب نظرا إلى القدر؟ فرد ذلك، وألزم القيام بالأسباب كما في الصحيح عنه صلى الله عليه وسلم أنه قال: «ما منكم من أحد إلا وقد علم مقعده من الجنة، ومقعده من النار. قالوا: يا رسول الله، أفلا ندع العمل ونتكل على الكتاب؟ فقال: لا، اعملوا فكل ميسر لما خلق له» (1) . والموحد المتوكل: لا يلتفت إلى الأسباب، بمعنى أنه لا يطمئن إليها، ولا يرجوها ولا يخافها، فلا يركن إليها. ولا يلتفت إليها - بمعنى أنه لا يسقطها ولا يهملها ويلغيها - بل يكون قائماً بها، ملتفتا إليها، ناظراً إلى مسببها سبحانه ومجريها، فلا يصح التوكل - شرعاً وعقلاً - إلا عليه سبحانه وحده (2) . وقد أحسن من قال: سهرت أعين ونامت عيون في شؤون تكون أو لا تكون إن رباً كفاك بالأمس ما كان سيكفيك في غدٍ ما يكون (3) 19 - من ثمرات الإيمان بالقدر: الحياة الطيبة: قال الله تعالى: {يَعْمَلُونَ (96) مَنْ عَمِلَ صَالِحًا مِنْ ذَكَرٍ أَوْ أُنْثَى وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً وَلَنَجْزِيَنَّهُمْ أَجْرَهُمْ بِأَحْسَنِ مَا كَانُوا} [النحل: 97]. فأخبر تعالى ووعد من جمع بين الإيمان والعمل الصالح، بالحياة الطيبة في هذه الدار، وبالجزاء الحسن في هذه الدار وفي دار القرار. وسبب ذلك واضح فإن المؤمنين بالله الإيمان الصحيح - يشمل الإيمان بالقضاء والقدر - المثمر للعمل الصالح المصلح للقلوب والأخلاق والدنيا والآخرة، معهم أصول وأسس يتلقون فيها جميع ما يرد عليهم من أسباب السرور والابتهاج، وأسباب القلق والهم والأحزان. يتلقون المحاب والمسار بقبول لها، وشكر عليها، واستعمال لها فيما ينفع، فإذا استعملوها على هذا الوجه. أحدث لهم من الابتهاج بها، والطمع في بقائها وبركتها، ورجاء ثواب الشاكرين، أموراً عظيمة تفوق بخيراتها وبركاتها هذه المسرات التي هذه ثمراتها.",
    "foot_note": "1. سبق تخريجه ص 12 حاشية رقم 3. \n2. مدارج السالكين (3/ 500). \n3. جدد حياتك، محمد الغزالي ص 27، ط. التاسعة، دار القلم دمشق، 1416 هـ.",
    "book_id": "70",
    "new_page_number": 32
  },
  {
    "serial_number": "97918",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "ويتلقون المكاره والمضار والهم والغم بالمقاومة لما يمكنهم مقاومته وتخفيف ما يمكنهم تخفيفه، والصبر الجميل لما ليس لهم عنه بد، وبذلك يحصل لهم من آثار المكاره من المقاومات النافعة، والتجارب والقوة، ومن الصبر واحتساب الأجر والثواب أموراً عظيمة تضمحل معها المكاره، وتحل محلها المسار والأمال الطيبة، والطمع في فضل الله وثوابه، كما عبر النبي صلى الله عليه وسلم عن هذا في الحديث الصحيح أنه قال: «عجباً لأمر المؤمن إن أمره كله خير، إن أصابته سراء شكر فكان خيراً له، وإن أصابته ضراء صبر فكان خيراً له وليس ذلك لأحد إلا المؤمن» (1) . فأخبر صلى الله عليه وسلم أن المؤمن يتضاعف غنمه وخيره وثمرات أعماله في كل ما يطرقه من السرور والمكاره (2) . 20 - من ثمرات الإيمان بالقدر: أن الإيمان بالقدر طريق الخلاص من الشرك: فالمجوس زعموا: أن النور خالق الخير، والظلمة خالقة الشر، والقدرية قالوا: إن الله لم يخلق أفعال العباد، فهم أثبتوا خالقين مع الله -جل وعلا - وهذا شرك، والإيمان بالقدر على الوجه الصحيح توحيد لله. 21 - من ثمرات الإيمان بالقدر: الإخلاص: إن جميع الأعمال والأقوال إنما تصح وتكمل بحسب ما يقوم بقلب صاحبها من الإيمان والإخلاص، ولهذا يذكر الله هذا الشرط الذي هو أساس كل عمل، قال تعالى: {فَمَنْ يَعْمَلْ مِنَ الصَّالِحَاتِ وَهُوَ مُؤْمِنٌ فَلَا كُفْرَانَ لِسَعْيِهِ} [الأنبياء: 94]، فإذا تأسست الأعمال على الإيمان، وانبنت عليه كان السعي مشكوراً مقبولاً مضاعفاً، لا يضيع منه مثقال ذرة، وأما إذا فقد العمل الإيمان فلو استغرق العامل ليله ونهاره، فإنه غير مقبول، قال تعالى: {وَقَدِمْنَا إِلَى مَا عَمِلُوا مِنْ عَمَلٍ فَجَعَلْنَاهُ هَبَاءً مَنْثُورًا (23)} [الفرقان: 23] (3) . (فالإيمان بالقدر يخلص العبد من أن يرضى الناس بسخط الله، وأن يذمهم على ما لم يؤته الله. وأن يحمدهم على ما هو عين فضل الله، فيكون ظالماً لهم في الأول: وهو رضاهم وذمهم، مشركا بهم في الثاني: وهو حمدهم، فإذا رضى بالقضاء تخلص من ذمهم وحمدهم، فخلصه الرضى من ذلك كله) (4) . فالذي يؤمن بالقدر لا يعمل لأجل الناس، لعلمه أنهم لن ينفعوه إلا بشيء قد كتبه الله له.",
    "foot_note": "1. رواه مسلم، كتاب الزهد، باب في أحاديث متفرقة (18/ 125 - شرح النووي). \n2. ابن سعدي، الوسائل المفيدة للحياة السعيدة، ص 11 - 12، الطبعة الرابعة، الرئاسة العامة لإدارات البحوث العلمية والإفتاء، 1409 هـ. \n3. التوضيح لشجرة الإيمان ص 73 - 74. \n4. مدارج السالكين (2/ 223).",
    "book_id": "70",
    "new_page_number": 33
  },
  {
    "serial_number": "97919",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "22 - من ثمرات الإيمان بالقدر: أن الإيمان ملجأ المؤمنين في كل ما يلم بهم من سرور وحزن، وخوف وأمن، وطاعة ومعصية وغير ذلك من الأمور التي لابد لكل أحد منها. فعند المحاب والسرور، يلجئون إلى الإيمان فيحمدون الله، ويثنون عليه ويستعملون النعم فيما يحب المنعم، وعند المكاره والأحزان يلجؤون إلى الإيمان من جهات عديدة: يتسلون بإيمانهم وحلاوته. ويتسلون بما يترتب على ذلك من الثواب. ويقابلون الأحزان والقلق، براحة القلب، والرجوع إلى الحياة الطيبة المقاومة للأحزان والأتراح. ويلجؤون إلى الإيمان عند الخوف فيطمئنون إليه، ويزيدهم إيماناً وثباتاً، وقوة وشجاعة، ويضمحل الخوف الذي أصابهم، قال تعالى: {الَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ قَدْ جَمَعُوا لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا وَقَالُوا حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ (173) فَانْقَلَبُوا بِنِعْمَةٍ مِنَ اللَّهِ وَفَضْلٍ لَمْ يَمْسَسْهُمْ سُوءٌ وَاتَّبَعُوا رِضْوَانَ اللَّهِ وَاللَّهُ ذُو فَضْلٍ عَظِيمٍ (174)} [آل عمران: 173 - 174] (1) . ويلجؤون إلى الإيمان إذا ابتلوا بشيء من المعاصي بالمبادرة إلى التوبة منها، وعمل ما يقدرون عليه من الحسنات لجبر نقصها، قال تعالى: {إِنَّ الَّذِينَ اتَّقَوْا إِذَا مَسَّهُمْ طَائِفٌ مِنَ الشَّيْطَانِ تَذَكَّرُوا فَإِذَا هُمْ مُبْصِرُونَ (201)} [الأعراف: 201] (2) . 23 - من ثمرات الإيمان بالقدر: أن الإيمان بالقدر من سعادة ابن آدم، وسخطه من شقاوته: عن سعد بن أبي وقاص رضى الله عنه قال: قال رسول الله صلى الله عليه وسلم: «من سعادة ابن آدم: استخارة الله عز وجل، ومن سعادة ابن آدم رضاه بما قضى الله، ومن شقاوة ابن آدم: سخطه بما قضى الله، ومن شقاوة ابن آدم ترك استخارة الله» (3) ، فالرضا بالقضاء من أسباب السعادة والتسخط على القضاء من أسباب الشقاوة (4) .",
    "foot_note": "1. التوضيح لشجرة الإيمان ص 86 - 88. \n2. أصول التربية الإسلامية ص 102 - 103. \n3. رواه الترمذي، باب ما جاء في الرضا بالقدر، وهو في ضعيف سنن الترمذي للألباني، رقم 381، الطبعة الأولى، المكتب الإسلامي، بيروت، 1411 هـ. \n4. مدارج السالكين (2/ 208).",
    "book_id": "70",
    "new_page_number": 34
  },
  {
    "serial_number": "97920",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "24 - من ثمرات الإيمان بالقدر: الثبات والرزانة في مواجهة المصائب: قال تعالى: {مَا أَصَابَ مِنْ مُصِيبَةٍ فِي الْأَرْضِ وَلَا فِي أَنْفُسِكُمْ إِلَّا فِي كِتَابٍ مِنْ قَبْلِ أَنْ نَبْرَأَهَا إِنَّ ذَلِكَ عَلَى اللَّهِ يَسِيرٌ (22) لِكَيْلَا تَأْسَوْا عَلَى مَا فَاتَكُمْ وَلَا تَفْرَحُوا بِمَا آتَاكُمْ وَاللَّهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ (23)} [الحديد: 22 - 23]. قال الشيخ عبدالرحمن السعدي: (يقول تعالى مخبرا عن عموم قضائه وقدره: {مَا أَصَابَ مِنْ مُصِيبَةٍ فِي الْأَرْضِ وَلَا فِي أَنْفُسِكُمْ} وهذا شامل لعموم المصائب التي تصيب الخلق، من خير وشر، فكلها قد كتبت في اللوح المحفوظ، صغيرها وكبيرها، وهذا أمر عظيم لا تحيط به العقول، بل تذهل عنده أفئدة أولي الألباب، ولكنه على الله يسير، وأخبر الله عباده بذلك لأجل أن تتقرر هذه القاعدة عندهم، ويبنوا عليها ما أصابهم من الخير والشر، فلا يأسوا ويحزنوا على ما فاتهم، مما طمحت له أنفسهم وتشوفوا إليه، لعلمهم أن ذلك مكتوب في اللوح المحفوظ، لا بد من نفوذه ووقوعه، فلا سبيل إلى دفعه، ولا يفرحوا بما آتاهم الله فرح بطر وأشر، لعلمهم أنهم ما أدركوه بحولهم وقوتهم، وإنما أدركوه بفضل الله ومنه، فيشتغلوا بشكر من أولى النعم ودفع النقم، ولهذا قال: {وَاللَّهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ (23)} أي: متكبر فظ غليظ، معجب بنفسه، فخور بنعم الله، ينسبها إلى نفسه، وتطغيه وتلهيه) (1) ، فعندما يتزن الإنسان في مشاعره في قبول المصائب أو الأفراح فإنه يكون مطمئناً في حياته ومستقراً بها أيضاً (2) . 25 - من ثمرات الإيمان بالقدر: التربية على التعقل وعدم تعليل الأمور حسب هواه ومصلحته، بل يجب أن يعرف أن لكل ظاهرة كونية فوائد ومضار، فيطلب فوائدها ويستبعد مضارها (3) . 26 - من ثمرات الإيمان بالقدر: الجهاد والشجاعة والإقدام: لقد أصبح المسلمون أشجع الناس، وأفرس الناس، وكانوا يقاتلون الأعداء، ويحرصون على الشهادة ويحرصون أن يكونوا في أوائل الصفوف. وكانوا لا يرهبهم أي قوة ولا يزعجهم أي كثرة، لان المسلم يعلم أن السلاح لا يقتل إلا من دنا أجله. علموا أنه لن يرفع عنهم قعودهم عن الجهاد في سبيل الله أجلهم ولن يؤخرهم ساعة من نهار (4) .",
    "foot_note": "1. تفسير السعدي: 842. \n2. عبد الله الخاطر، الحزن والاكتئاب في ضوء الكتاب والسنة، ص 35 - 37، طبعة المنتدى الإسلامي، لندن. \n3. عبد الرحمن النحلاوي، أصول التربية الإسلامية وأساليبها في البيت والمدرسة والمجتمع، ص 104، الطبعة الثانية، دار الفكر، دمشق، 1403 هـ. \n4. الشيخ عبد الرحمن الدوسري، وصالح اللحيدان، شريط أثر الإيمان بالقضاء والقدر على المؤمن، تسجيلات التقوى، رقم 3362.",
    "book_id": "70",
    "new_page_number": 35
  },
  {
    "serial_number": "97921",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "فالذي يؤمن بالقدر يعلم أنه لن يموت إلا إذا جاء أجله، ولا يناله إلا ما كتب له، فيقدم غير هياب ولا مبال بما يناله من الأذى والمصائب في سبيل الله، قال الله تعالى: {وَمَا كَانَ لِنَفْسٍ أَنْ تَمُوتَ إِلَّا بِإِذْنِ اللَّهِ كِتَابًا مُؤَجَّلًا} [آل عمران: 145]، وكما قال أمير المؤمنين علي بن أبي طالب رضي الله عنه: أي يوم الموت أفر يوم لا يقدر أو يوم قدر يوم ما قدر لا أرهبه وإذا قدر لا ينجي الحذر (1) (فإذا تربى المؤمن على الجرأة أمام الموت فقد أصبح جريئاً أمام كل شيء. أمام فقد مال أو ولد أو جاه، أو أمام مرض أو أي مصاب آخر، ما دام يؤمن بأنه مقدر من الله) (2) . 27 - من ثمرات الإيمان بالقدر: الدعوة إلى الله: لقد كان الفهم الصحيح للإيمان بالقدر عند السلف الصالح حافز لهم لنشر الدعوة إلى الله، حيث جعلهم يجتهدون في نشر الإسلام في جميع بقاع الأرض وأن يتحملوا الأذى في ذلك، ويصبروا عليه، لعلمهم أن ما أصابهم فإنما هو بقضاء الله وقدره. فنجد أن الإسلام قد امتد من المحيط غرباً إلى الهند شرقاً في فترة من الزمن لا تتجاوز نصف قرن! ! وهي سرعة لا مثيل لها في التاريخ! وانتشر مع الإسلام سلطان الدولة الإسلامية بما أرهب أعداء الله، وانتشر معه كذلك اللسان العربي بسرعة تفوق الوصف في انتشار اللغات. 28 - من ثمرات الإيمان بالقدر: التفاؤل وقطع دابر التشاؤم: وهو تعليل المصائب بعلل أو أسباب غير صحيحة، كالتشاؤم من صوت البوم، أو من المرض أو من الزمان وحوادثه أو من الريح، فالمؤمن بالقضاء والقدر يعلم أن كل شيء بتقدير الله وقضائه، وأن ما شاء الله كان وما لم يشاء لم يكن: {قَالُوا إِنَّا تَطَيَّرْنَا بِكُمْ لَئِنْ لَمْ تَنْتَهُوا لَنَرْجُمَنَّكُمْ وَلَيَمَسَّنَّكُمْ مِنَّا عَذَابٌ أَلِيمٌ (18) قَالُوا طَائِرُكُمْ مَعَكُمْ أَئِنْ ذُكِّرْتُمْ بَلْ أَنْتُمْ قَوْمٌ مُسْرِفُونَ} [يس: 18 - 19] (3) .",
    "foot_note": "1. ديوان الإمام علي ص 79 - 80 نقلا من القضاء والقدر للحمد ص 25. \n2. أصول التربية الإسلامية وأساليبها في البيت والمدرسة والمجتمع، ص 102. \n3. المرجع السابق: ص 102.",
    "book_id": "70",
    "new_page_number": 36
  },
  {
    "serial_number": "97922",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "29 - من ثمرات الإيمان بالقدر: عدم اليأس من انتصار الحق: فقد قضى الله سبحانه وتعالى بأن البقاء للحق، لأنه الأصل الذي قامت عليه السموات والأرض وأما الباطل فهو طارئ وزاهق، قال تعالى: {وَقُلْ جَاءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ إِنَّ الْبَاطِلَ كَانَ زَهُوقًا (81)} [الإسراء: 81]، وقال سبحانه: {فَيَذْهَبُ جُفَاءً وَأَمَّا مَا يَنْفَعُ النَّاسَ فَيَمْكُثُ فِي الْأَرْضِ كَذَلِكَ يَضْرِبُ اللَّهُ الْأَمْثَالَ (17) لِلَّذِينَ اسْتَجَابُوا} [الرعد: 68]، ولكن حكمة الله عز وجل البالغة اقتضت أن يوجد الباطل لاختبار أوليائه وإظهار آثار أسمائه الحسنى وصفاته العلا وليبلي المؤمنين منه بلاء حسناً، وإلا لو شاء الله عز وجل لم يكن هناك كفر ولا باطل، قال تعالى: {ذَلِكَ وَلَوْ يَشَاءُ اللَّهُ لَانْتَصَرَ مِنْهُمْ وَلَكِنْ لِيَبْلُوَ بَعْضَكُمْ بِبَعْضٍ} [محمد: 4]. فالمؤمن بالقدر يعلم علم اليقين أن العاقبة للمتقين وأن قدر الله في ذلك نافذ لا محالة، فلا يدب اليأس إلى قلبه، ولا يعرف إليه طريقا مهما اشتدت ظلمة الباطل. 30 - من ثمرات الإيمان بالقدر: علو الهمة، وعدم الرضا بالدون، وعدم الرضا بالواقع الأليم: فالمؤمن بالقدر تجده عالي الهمة لا يرضى بالدون ولا بالواقع المر الأليم، ولا يستسلم له محتجا بالقدر، إذ أن هذا ليس مجال الاحتجاج بالقدر؟ لأنه من المعائب، والاحتجاج بالقدر إنما يسوغ عند المصائب دون المعائب، بل إن إيمانه بالقدر يحتم عليه أن يسعى سعيا حثيثا لتغيير هذا الواقع حسب قدرته واستطاعته. 31 - من ثمرات الإيمان بالقدر: العزم والقضاء على التردد: ليس في المجتمعات البشرية أمضى عزيمة من المؤمن بقدر الله، فهو إذا ناقش الأمور ورجح بينها واستشار غيره، واستخار ربه، يمضي قدما فيما عزم عليه، دون توقف أو تردد أو خوف، ليقينه بأن جميع الظروف والاحتمالات التي يمكن أن تكون غير واقعة في طوقه وحسبانه، هي مما وقع في علم الله وقدره، وأن الله مؤيده، فإذا يسر له ما عزم عليه فهو الخير المقدر له، أو ليصرف الله عنه شراً كان محتملاً (1) . 32 - من ثمرات الإيمان بالقدر: الجد والحزم في الأمور، والحرص على كل خير ديني أو دنيوي: فقد ذم الرسول صلى الله عليه وسلم التواني والكسل، وعلمنا هذا الدعاء «اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من غلبة الدين وقهر الرجال» (2) .",
    "foot_note": "1. أصول التربية الإسلامية ص 101. \n2. رواه البخاري، كتاب الدعوات، باب التعوذ من غلبة الرجال، (11/ 173 - فتح الباري).",
    "book_id": "70",
    "new_page_number": 37
  },
  {
    "serial_number": "97923",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "وكما في قوله عليه الصلاة والسلام: «احرص على ما ينفعك، واستعن بالله، ولا تعجز، وإن أصابك شيء فلا تقل: لو أني فعلت كان كذا وكذا، ولكن قل: قدر الله وما شاء فعل» (1) . فلا تقل: لو أني فعلت وفعلت وفعلت، وتبقى تلوم نفسك وتعيش على ماض تتحسر عليه. المسلم لابد أن تكون عنده نفسية قوية فإذا أخطأ، أو حصلت له مشكلة فيقول: «قدر الله وما شاء فعل» ويبدأ من جديد ويعمل للمستقبل (2) . 33 - من ثمرات الإيمان بالقدر: أن الإيمان بالقدر ينفى عنه آفات الحرص والكلب على الدنيا: وذلك رأس كل خطيئة، وأصل كل بلية. وأساس كل رزية. فرضاه عن ربه في جميع الحالات، ينفى عنه مادة هذه الآفات. (3) 34 - من ثمرات الإيمان بالقدر: الكرم: فالذي يؤمن بالقدر، وأن الفقر والغنى بيد الله، وأنه لا يفتقر إلا إذا قدر الله له ذلك - فإنه ينفق ولا يبالي. لأنه يعلم أن غناه بقضاء الله وقدره، وأن فقر الفقير بقضاء الله وقدره، فيشكر الله على هذه النعمة، فيحمله ذلك على الإنفاق في سبيل الله. 35 - من ثمرات الإيمان بالقدر: الصبر والاحتساب ومواجهة الأخطار والصعاب: فالذين لا يؤمنون بالقدر ربما يؤدي الجزع ببعضهم إلى أن يكفروا بالله، وبعضهم يجن، وبعضهم يصبح موسوسا، وبعضهم يلجأ إلى المخدرات، وبعضهم يقتل نفسه، ولذلك يكثر الانتحار في البلاد التي لا يؤمن أهلها بالقدر. قال الله تعالى: {وَعَسَى أَنْ تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَكُمْ وَعَسَى أَنْ تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَكُمْ وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ (216)} [البقرة: 216]. (من أسرار هذه الآية: أنها تقتضي من العبد التفويض إلى من يعلم عواقب الأمور، والرضا بما يختاره له ويقضيه له، لما يرجو فيه من حسن العاقبة. فإذا فوض إلى ربه، ورضي بما يختاره له، أمده فيما يختاره له بالقوة عليه والعزيمة والصبر، وصرف عنه الآفات التي هي عرضة اختيار العبد لنفسه، وأراه من حسن عواقب اختياره له ما لم يكن ليصل إلى بعضه، بما يختاره هو لنفسه). (4)",
    "foot_note": "1. رواه مسلم، كتاب القدر، باب الإيمان للقدر والإذعان له (16/ 215 - شرح النووي). \n2. عبد الله الخاطر، الهزيمة النفسية عند المسلمين' ص 54 - 55، الطبعة الأولى، المنتدى الإسلامي، لندن، 1412 هـ. \n3. مدارج السالكين (2/ 209). \n4. الفوائد ص 175 - 176.",
    "book_id": "70",
    "new_page_number": 38
  },
  {
    "serial_number": "97924",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "36 - من ثمرات الإيمان بالقدر: التسلية عن المصائب والابتلاء: لان مصاحبة الإيمان واليقين أعظم مسل عنها ومهون لها، وذلك لقوة إيمانه، وقوة توكله، ولقوة رجائه بثواب ربه، وطمعه في فضله. فأول ما يخفف الابتلاء والمصائب قضية الإيمان بالقضاء والقدر، فلا يجزع ولا يندب كندب الجاهلية، ولا يغضب عند النكبات والحوادث لأنه يعلم أن ما أصابه لم يكن ليخطئه وما أخطأه لم يكن ليصيبه، فتهون عليه المصائب ويكون دائماً متذكر لقول الرسول صلى الله عليه وسلم: «قدر الله وما شاء فعل» (1) . 37 - من ثمرات الإيمان بالقدر: عدم الندم أو الحسرة على ما فات: فالمؤمن لا ينوح على الماضي بالتندم والتحسر، لأن ذلك لن يرد عليه شيئاً مما فات، ولأنه إنما حصل على ما كتب الله له، ولا اعتراض على قدر الله ما دام قد وقع، ولكن له أن يعتبر، فيتوب من الخطأ أو الذنب، ولا يلدغ من جحر مرتين (2) . 38 - من ثمرات الإيمان بالقدر: الاعتراف بفضل الله ومنته وطرد الإعجاب بالنفس عند حصول المراد: فالمؤمن لا ينسب الخير إلى نفسه، بل إلى الله تبارك وتعالى، لأن حصول ذلك نعمة من الله بما قدره من أسباب الخير والنجاح، فيشكر الله تعالى على ذلك (3) . فلا يعجب بنفسه ولا يدلي بعمله لعلمه أن الله تعالى هو الذي تفضل عليه بالتوفيق والإعانة وصرف الموانع والعوائق، وأنه لو وكل إلى نفسه لضَعُف وعجز عن العمل (4) . 39 - من ثمرات الإيمان بالقدر: عدم الاغترار بالعمل: لأن المؤمن لا يدري ما نتيجة العمل، حتى الهداية، ما يدري ما نتيجتها كما قال الرسول صلى الله عليه وسلم: «والله إني لرسول الله لأدري ما يفعل بي ربي» قالت أم العلاء رضي الله عنها: وقد زكت عثمان ابن مظعون لما مات \"أن الله قد أكرمك\"، فقال لها رسول الله: «وما يدريك أن الله قد أكرمه»؟ فقالت: سبحان الله يا رسول الله، ومن يكرم الله إذا لم يكرمه؟ فقال لها رسول الله: «والله إني لرسول الله لأدري ما يفعل بي» (5) . 40 - من ثمرات الإيمان بالقدر: الاعتراف بالذنب والخطاء: فالعبد المؤمن ينسب إلى نفسه التقصير على الأبد ولا ينسبه إلى الله عز وجل. فإذا وقع في المعصية نسبها إلى نفسه، فحمله ذلك على الاستغفار والتوبة.",
    "foot_note": "1. سبق تخريجه ص 36 حاشية رقم 2. \n2. أصول التربية الإسلامية ص 102. \n3. عقيدة أهل السنة والجماعة، ابن عثيمين، ص 47، الطبعة الثالثة، إدارة البحوث العلمية والإفتاء، الرياض، 1416 هـ. \n4. التنبيهات اللطيفة، ص 84. \n5. رواه البخاري، كتاب الجنائز، باب الدخول على الميت بعد الموت إذا أدرج في أكفانه (3/ 114 - فتح الباري).",
    "book_id": "70",
    "new_page_number": 39
  },
  {
    "serial_number": "97925",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "41 - من ثمرات الإيمان بالقدر: التأسي بالأنبياء عليهم السلام: فالمذنب إذا استغفر ربه من ذنبه، فقد تأسى بالسعداء من الأنبياء والمؤمنين كآدم عليه السلام وغيره. وإذا أصر واحتج بالقدر، فقد تأسى بالأشقياء، كإبليس ومن اتبع من الغاوين (1) . 42 - من ثمرات الإيمان بالقدر: قوة الإيمان: فالذي يؤمن بالقدر يقوى إيمانه، فلا يتخلى عنه ولا يتزعزع أو يتضعضع مهما ناله في ذلك السبيل. لقوله صلى الله عليه وسلم: «المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف وفي كل خير» (2) . 43 - من ثمرات الإيمان بالقدر: الهداية: كما في قوله تعالى: {مَا أَصَابَ مِنْ مُصِيبَةٍ إِلَّا بِإِذْنِ اللَّهِ وَمَنْ يُؤْمِنْ بِاللَّهِ يَهْدِ قَلْبَهُ} [التغابن: 11]. قال بعض السلف: هو الرجل تصيبه المصيبة فيعلم أنها من عند الله فيرضى ويسلم (3) . فالعبد إذا أصابته المصيبة فآمن أنها من عند الله، وأن الله حكيم رحيم في تقديرها، وأنه أعلم بمصالح عبده هدى الله قلبه هدايةً خاصةً للرضا والصبر والتسليم والطمأنينة (4) . 44 - من ثمرات الإيمان بالقدر: عزة النفس والقناعة والتحرر من رق المخلوقين: (إن من ملأ قلبه من الرضى بالقدر، ملأ الله صدره غنى وأمناً وقناعة. وفرغ قلبه لمحبته، والإنابة إليه، والتوكل عليه. ومن فاته حظه من الرضى، امتلأ قلبه بضد ذلك. واشتغل عما فيه سعادته وفلاحه. فالرضى يفرغ القلب لله، والسخط يفرغ القلب من الله) (5) .",
    "foot_note": "1. شيخ الإسلام ابن تيمية، الحسنة والسيئة، ص 50، الطبعة الأولى، تحقيق محمد الخشت، دار الكتاب العربي، بيروت، 1405 هـ. \n2. رواه مسلم، كتاب القدر، باب الأمر بالقوة وترك العجز، (16/ 215 - شرح النووي). \n3. تفسير ابن كثير (4/ 401). \n4. التوضيح لشجرة الإيمان ص 35. \n5. مدارج السالكين (2/ 208).",
    "book_id": "70",
    "new_page_number": 40
  },
  {
    "serial_number": "97926",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "والمؤمن بالقدر، يعلم أن رزقه مكتوب، وأنه لن يموت حتى يستوفي رزقه، ويدرك أن الله كافيه وحسبه ورازقه، وأن العباد مهما حاولوا إيصال الرزق له، أو منعه عنه فلن يستطيعوا إلا بشيء قد كتبه الله، فينبعث بذلك إلى القناعة وعزة النفس، والإجمال في الطلب، وترك التكالب على الدنيا، والتحرر من رق المخلوقين، وقطع الطمع مما في أيديهم، والتوجه بالقلب إلى رب العالمين، وهذا أس فلاحه ورأس نجاحه، ومن جميل ما يذكر في هذا المعنى ما ينسب لأمير المؤمنين علي بن أبي طالب رضي الله عنه قوله: أفادتني القناعة كل عز وهل عِزٌ أعز من القناعة فصيرها لنفسك رأس مال وصير بعدها التقوى بضاعة تحز ربحا وتغنى عن بخيل وتنعم في الجنان بصبر ساعة (1) ومن ذلك قول الشافعي رحمه الله تعالى: رأيت القناعة كنز الغنى فصرت بأذيالها متمسك فلا ذا يراني على بابه ولا ذا يراني به منهمك وصرت غنياً بلا درهم أمر على الناس شبه الملك (2) 45 - من ثمرات الإيمان بالقدر: عدم الاعتماد على الكهان، والمنجمين، والمشعوذين، والتمسح بأتربة القبور، ودعاء غير الله، وصرف شيء من أنواع العبادة لغير الله، لأنها لا تملك لنفسها نفعا ولا ضرا فضلاً عن غيرها. 46 - من ثمرات الإيمان بالقدر: تفريغ القلب من الشواغل: فإن الإيمان بالقدر على الوجه الصحيح (يريحه من الأفكار المتعبة في أنواع الاختيارات ويفرغ قلبه من التقديرات والتدبيرات التي يصعد منها في عقبة وينزل في أخرى، ومع هذا فلا خروج له عما قدر عليه، فلو رضي باختيار الله أصابه القدر وهو محمود مشكور ملطوف به فيه، وإلا جرى عليه القدر وهو مذموم غير ملطوف به فيه، لأنه مع اختياره لنفسه. ومتى صح تفويضه ورضاه، اكتنفه في المقدور العطف عليه، واللطف به، فيصير بين عطفه ولطفه، فعطفه يقيه ما يحذره، ولطفه يهون عليه ما قدره) (3) . فطريق المؤمن أن ينهض بالتكاليف الواضحة - ما استطاع - وأن يجتنب النواهي المحددة كما نهي. وأن يشتغل بمعرفة ما أمر الله به، وما نهى الله عنه، ولا يبحث في شيء وراءهما من أمر الغيب المحجوب عن إدراكه المحدود. وما كان الله سبحانه ليكلفه شيئاً يعلم أن لا طاقة له به، أو أنه ممنوع بمانع قهري عن النهوض به. وما كان الله سبحانه لينهاه عن شئ، يعلم أن لا طاقة له بالامتناع عنه، أو أنه مدفوع بدافع قهري لا يقاوم لإتيانه! قال تعالى: {لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ} [البقرة: 286]. 47 - من ثمرات الإيمان بالقدر: سكون القلب، وطمأنينة النفس، وراحة البال: هذه الأمور من ثمرات الإيمان بالقضاء والقدر، وهي مطلب ملح، وهدف منشود، فكل من على وجه البسيطة يبتغيها ويبحث عنها، ولكن كما قيل: كل من في الوجود يطلب صيدا غير أن الشباك مختلفات فلا يدرك هذه الأمور، ولا يجد حلاوتها، ولا يعلم ثمرتها إلا من آمن بالله وبقضائه وقدره. ذلك (لأنه متى علم أن ذلك بقضاء الله تعالى وأن المكروه كائن لا محالة ارتاحت النفس واطمأن القلب ورضي بقضاء الرب، فلا أحد أطيب عيشاً وأريح نفساً وأقوى طمأنينة ممن آمن بالقدر) (4) . وإنك لتجد عند خواص المسلمين من العلماء العاملين، والعباد القانتين المتبعين، من سكون القلب، وطمأنينة النفس ما لا يخطر على بال، ولا يدور حول ما يشبهه خيال، فلهم في ذلك الشأن، القدح المعلى، والنصيب الأوفى. فهذا أمير المؤمنين عمر بن عبد العزيز رحمه الله يقول: (أصبحت ومالي سرور إلا في مواضع القدر. قيل له: ما تشتهي؟ فقال: ما يقضي الله عز وجل (5) . وهذا شيخ الإسلام ابن تيمية رحمه الله تعالى يقول: (إن في الدنيا جنة من لم يدخلها لم يدخل جنة الآخرة) (6) . ويقول مقولته المشهورة التي قالها عندما اقتيد إلى السجن: (ما يصنع أعدائي بي، أنا جنتي وبستاني في صدري، أنى رحلت فهي معي لا تفارقني، أنا حبسي خلوة، وقتلي شهادة، وإخراجي من بلدي سياحة) (7) . 49 - من ثمرات الإيمان بالقدر: طرد القلق والضجر عند فوات المراد أو حصول المكروه: لأن ذلك بقضاء الله تعالى الذي له ملك السموات والأرض وهو كائن لا محالة فيصبر على ذلك ويحتسب الأجر (8) .",
    "foot_note": "1. ديوان الإمام علي ص 121 - 122، نقلا من القضاء والقدر للحمد ص 30. \n2. ديوان الإمام الشافعي ص 68. الطبعة الثالثة، مؤسسة الزعبي، بيروت، 1392 هـ. \n3. الفوائد ص 176. \n4. ابن عثيمين، عقيدة أهل السنة والجماعة، ص 46 - 47. \n5. مختصر منهج القاصدين ص 337. \n6. الشهادة الزكية في ثناء الأئمة على أبن تيمية لمرعي الكرمي الحنبلي ص 34. نقلا من القضاء والقدر للحمد ص 31. \n7. شيخ الإسلام أحمد تقي الدين أبن تيمية: جهاده، دعوته، عقيدته، للشيخ أحمد القطان ومحمد الزين ص 101، الطبعة الأولى، مكتبة السندس، الكويت، 1406 هـ. \n8. عقيدة أهل السنة والجماعة، ابن عثيمين، ص 47.",
    "book_id": "70",
    "new_page_number": 41
  },
  {
    "serial_number": "97927",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "50 - من ثمرات الإيمان بالقدر: التواضع: فالمؤمن بالقدر إذا رزقه الله بمال، أو جاه، أو علم، أو غير ذلك، تواضع لله، لعلمه أن هذا من الله، ولو شاء لانتزعه منه، إنه على كل شيء قدير. قال الله تعالى: {قُلِ اللَّهُمَّ مَالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَنْ تَشَاءُ وَتَنْزِعُ الْمُلْكَ مِمَّنْ تَشَاءُ وَتُعِزُّ مَنْ تَشَاءُ وَتُذِلُّ مَنْ تَشَاءُ بِيَدِكَ الْخَيْرُ إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (26)} [آل عمران: 26]. 51 - من ثمرات الإيمان بالقدر: الشكر: فالمؤمن بالقدر يعلم أن ما به من نعمة فمن الله وحده، وأن الله هو الدافع لكل مكروه ونقمة، فينبعث بسبب ذلك إلى شكر الله، إذ هو المنعم المتفضل الذي قدر له ذلك وهو المستحق للشكر. قال الله تعالى عن سليمان عليه السلام: {وَقَالَ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ} [النمل: 19]. 52 - من ثمرات الإيمان بالقدر: الرضا: (إن أحكم الحاكمين وأرحم الراحمين وأعلم العالمين الذي هو أرحم بعباده منهم بأنفسهم ومن آبائهم ومن أمهاتهم، إذا أنزل بهم ما يكرهون كان خيراً لهم من أن لا ينزله بهم، نظراً منهم لهم وإحساناً إليهم ولطفاً بهم، ولو مكنوا من الاختيار لأنفسهم لعجزوا عن القيام بمصالحهم علماً وإرادةً وعملاً، لكنه سبحانه تولى تدبير أمورهم بموجب علمه وحكمته ورحمته، أحبوا أم كرهوا، فعرف ذلك الموقنون بأسمائه وصفاته، فنازعوه تدبيره، وقدحوا في حكمته ولم ينقادوا لحكمه، وعارضوا حكمه بعقولهم الفاسدة وآرائهم الباطلة وسياساتهم الجائرة، فلا لربهم عرفوا ولا لمصالحهم حصلوا. ومتى ظفر العبد بهذه المعرفة، سكن في الدنيا قبل الآخرة في جنة لا يشبه نعيمها إلا نعيم الآخرة، فإنه لا يزال راضياً عن ربه، والرضا جنة الدنيا، ومستراح العارفين، فإنه طيب النفس بما يجري عليها من المقادير التي هي عين اختيار الله له، وطمأنينتها إلى أحكامه الدينية، وهذا هو الرضا بالله رباً وبالإسلام ديناً وبمحمد رسولاً، وما ذاق طعم الإيمان من لم يحصل له ذلك. وهذا الرضا هو بحسب معرفته بعدل الله وحكمته ورحمته وحسن اختياره، فكلما كان بذلك أعرف كان به أرضى، فقضاء الرب سبحانه في عبده دائر بين العدل والمصلحة والحكمة والرحمة، لا يخرج عن ذلك البتة، كما قال صلى الله عليه وسلم في الدعاء المشهور: «اللهم! إني عبدك ابن عبدك ابن أمتك، ناصيتي بيدك، ماض في حكمك، عدل في قضاؤك، أسألك بكل اسم هو لك، سميت به نفسك، أو أنزلته في كتابك، أو علمته أحداً من خلقك، أو استأثرت به في علم الغيب عندك، أن تجعل القرآن ربيع قلبي، ونور صدري، وجلاء حزني، وذهاب همي وغمي، ما قالها أحد قط إلا أذهب الله همه وغمه وأبدله مكانه فرجاً»، قالوا: أفلا نتعلمهن يا رسول الله؟ قال: «بلى! ينبغي لمن يسمعهن أن يتعلمهن» (1) .",
    "foot_note": "1. قال المحقق: حديث صحيح، رواه الإمام أحمد في المسند (1/ 391 و 452).",
    "book_id": "70",
    "new_page_number": 42
  },
  {
    "serial_number": "97928",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "والمقصود قوله: «عدل في قضاؤك»، وهذا يتناول كل قضاء يقضيه على عبده، من عقوبة أو ألم وسبب ذلك، فهو الذي قضى بالسبب وقضى بالمسبب، وهو عدل في هذا القضاء، وهذا القضاء خير للمؤمن، كما قال صلى الله عليه وسلم: «والذي نفسي بيده لا يقضي الله للمؤمن قضاءً إلا كان خيراً له وليس ذلك إلا للمؤمن» (1) (2) . فيرضى بالله ربا مدبرا مشرعا، فتمتلئ نفسه بالرضا عن ربه، فإذا رضي بالله أرضاه الله عز وجل. 53 - من ثمرات الإيمان بالقدر: الفرح: فيفرح المؤمن بالقدر بذلك الإيمان الذي حرم منه أمم كثيرة: {(57) قُلْ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ} [يونس: 158]. 54 - من ثمرات الإيمان بالقدر: المحبة وعدم الحسد بين المؤمنين: لأن الإيمان بالقدر و (الرضى يفتح له باب السلامة، فيجعل قلبه سليماً نقياً من الغش والدغل والغل. ولا ينجو من عذاب الله إلا من أتى الله بقلب سليم. وكذلك تستحيل سلامة القلب مع السخط وعدم الرضى. وكلما كان العبد أشد رضى كان قلبه أسلم. فالخبث والدغل والغش: قرين السخط. وسلامة القلب وبره ونصحه: قرين الرضى. وكذلك الحسد: هو من ثمرات السخط. وسلامة القلب من ثمرات الرضى) (3) . فالمؤمن لا يحسد الناس على ما آتاهم الله من فضله، لإيمانه بأن الله هو الذي رزقهم، وقدر لهم ذلك، فأعطى من شاء، ومنع من شاء، ابتلاءً وامتحاناً منه عز وجل وأنه حين يحسد غيره، إنما يعترض على القدر (4) . 55 - من ثمرات الإيمان بالقدر: إغاظة المبتدعة الذين يتحكمون في حكمة الله وشرعه (5) . فيقولون ينبغي على الله أن يفعل كذا وكذا، أو ينفون حكمة الله في أفعاله فالإيمان بالقدر عند أهل السنة يغيضهم لأنهم يسلمون لأوامر الكونية والشرعية. 56 - من ثمرات الإيمان بالقدر: الاستقامة على منهج سواء في السراء أو الضراء: فالعباد فيهم قصور، ونقص، وضعف، لا يستقيمون على منهج سواء إلا من آمن بالقدر، فإن النعمة لا تبطره، والمصيبة لا تقنطه.",
    "foot_note": "1. قال المحقق: هذه الرواية - والله أعلم - بالمعنى، وقد ورد الحديث بلفظ أخر عند مسلم، كتاب الزهد، باب في أحاديث متفرقة (18/ 125 - شرح النووي). \n2. الفوائد ص 171 - 173. \n3. مدارج السالكين (2/ 207). \n4. انظر: مجلة البحوث الإسلامية عدد 34 ص 25 مبحث وسطية أهل السنة في القدر، د. عواد المعتق. نقلا من القضاء والقدر للحمد ص 27. \n5. الجامع الصحيح في القدر ص 12.",
    "book_id": "70",
    "new_page_number": 43
  },
  {
    "serial_number": "97929",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": " الفصل الخامس: العلمانية (1) وصلتها بالانحراف في مفهوم القدر إن العقيدة (يوم كانت سليمة، والإيمان قوياً فياضاً، والتمسك بما أمر الله به من حيطة وحذر وإعداد للقوة والتمكن قائماً، لم يكن يمكن بأي حال من الأحوال أن يجد الغزو الفكري منفذاً ينفذ منه، وإن وجد منفذاً فلن يجد مكاناً يؤثر فيه، وإن وجد مكاناً ففي أندر الأحوال يقع ذلك، ولكن سرعان ما يقاوم ويعالج. هذا كله يحدث في حال يقظة الأمة ووعيها، وفي حال هيمنة العقيدة ونبضها، ويوم كانت الأمة كذلك لم تؤثر فيها تيارات الغزو الفكري، ولم تجد للنفوذ إليها سبيلاً. أما بعد أن غشت الانحرافات على حياة الأمة، وأصاب الضعف عقيدتها، فكان أمراً متوقعاً أن تصبح هدفاً لحملات الغزو الفكري، وأن تسقط فريسة لها من أول وهلة تصطدم بها) (2) . ومن هذه (الانحرافات الخطيرة التي ظهرت في تاريخ الأمة والتي ما تزال إلى وقتنا هذا، ما يسمى بالصوفية (3) ، هذه الطائفة التي ابتلي الإسلام والمسلمون بها، والتي صارت مع الزمن طرقاً ومذاهب كثيرة ومذاهب عديدة. والصوفية من اعظم الرزايا التي رزئ بها الإسلام على طول تاريخه، والتي ألحقت بالمسلمين ما لا يعلمه إلا الله، من الضعف والخور والخنوع والخضوع للواقع المؤلم دون محاولة لتغيره) (4) .",
    "foot_note": "1. العلمانية: لفظ العلمانية ترجمة خاطئة لكلمة (Secularism) في الإنجليزية أو (Secularite) بالفرنسية، وهي كلمة لا صلة لها بلفظ العلم ومشتقاته على الإطلاق. والترجمة الصحيحة للكلمة هي \"اللادينية\" أو \"الدنيوية\"، لا بمعنى ما يقابل الأخروية فحسب، بل بمعنى أخص هو ما لا صلة له بالدين، أو ما كانت علاقته بالدين علاقة تضاد. وهي حركة اجتماعية تهدف إلى صرف الناس وتوجيههم من الاهتمام بالآخرة إلى الاهتمام بهذه الدنيا وحدها. إذاً فالتعبير الصحيح للعلمانية هو \" إقامة الحياة على غير دين \" سواء بالنسبة للأمة أو الفرد. \n2. الانحرافات العقدية في القرنين الثالث عشر والرابع عشر الهجريين وآثارهما في حياة الأمة، ص (2/ 246 - 247)، علي الزهراني، الطبعة الثانية، دار طيبة، مكة، 1418 هـ. \n3. الصوفية: نسبة إلى لبس الصوف، ويرى بعض الباحثين أن بداية التصوف هو الزهد في الدنيا، والتمسك بالأخلاق، ثم بعد ذلك تعددت فرق الصوفية، وازدادت بعض الفرق بعداً عن الحق وغلواً حتى قال بعضهم بالحلول والاتحاد، وقالوا بترك الواجبات وعمل المحرمات تعبداً. انظر: تلبيس إبليس لابن الجوزي ص 161، ومجموع الفتاوى (11/ 6 - 18)، نشأة الفلسفة الصوفية وتطورها لعرفان عبد الحميد ص 115 - 124، المذاهب الصوفية ومدارسها لعبد الحكيم قاسم، معجم ألفاظ العقيدة ص 248. \n4. الانحرافات العقدية والعلمية ص (1/ 70).",
    "book_id": "70",
    "new_page_number": 44
  },
  {
    "serial_number": "97930",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "ولقد استغلت العلمانية الانحراف في التصورات الإسلامية لدى الصوفية - ومنها الانحراف في مفهوم القدر والتوكل - كإحدى مظاهر الغزو الفكري لتقول للناس أن الدين لا علاقة له بالحياة ولا بالسلوك العملي، وإنما هو رابطة قلبية بين العبد وربه يستحق بها النجاة والفوز في العالم الأخروي. وفي بيان انحراف الصوفية في القدر، يقول شيخ الإسلام ابن تيمية رحمه الله: (وأما \"الطائفة الثانية\" -يعني من فرق الضلال الخائضون في القدر- فهم شر منهم - يعني القدرية - وهم طوائف من آهل السلوك والإرادة والتأله والتصوف والفقر ونحوهم، يشهدون هذه الحقيقة، ورأوا أن الله خالق المخلوقات كلها، فهو خالق أفعال العباد ومريد جميع الكائنات، ولم يميزوا بعد ذلك بين إيمان وكفر، ولا عرفان ولا نكر، ولا حق ولا باطل، ولا مهتدى ولا ضال، ولا راشد ولا غوي، ولا نبي ولا متنبئ ولا ولي لله ولا عدو، ولا مرضي ولا مسخوط ولا محبوب ولا ممقوت، ولا بين العدل والظلم، ولا بين البر والعقوق ولا بين أعمال الجنة وأعمال أهل النار، ولا بين الأبرار والفجار حيث شهدوا ما تجتمع فيه الكائنات من القضاء السابق والمشيئة النافذة والقدرة الشاملة والخلق العام، فشهدوا المشترك بين المخلوقات وعموا عن الفارق بينهما، وصاروا ممن يخاطب بقوله تعالى: {(34) أَفَنَجْعَلُ الْمُسْلِمِينَ كَالْمُجْرِمِينَ (35) مَا لَكُمْ كَيْفَ تَحْكُمُونَ} [القلم: 35 - 36]) (1) . وقال أيضاً: (والفرقة الثانية: - يعني من فرق الضلال الخائضون في القدر- المشركية- الذين أقروا بالقضاء والقدر، وزعموا أن ذلك يوافق الأمر والنهي وأنكروا الأمر والنهي، قال تعالى: {سَيَقُولُ الَّذِينَ أَشْرَكُوا لَوْ شَاءَ اللَّهُ مَا أَشْرَكْنَا وَلَا آبَاؤُنَا وَلَا حَرَّمْنَا مِنْ شَيْءٍ} [الأنعام: 148]، وقال تعالى: {وَقَالَ الَّذِينَ أَشْرَكُوا لَوْ شَاءَ اللَّهُ مَا عَبَدْنَا مِنْ دُونِهِ مِنْ شَيْءٍ نَحْنُ وَلَا آبَاؤُنَا وَلَا حَرَّمْنَا مِنْ دُونِهِ مِنْ شَيْءٍ} [النحل: 35]. فهؤلاء يؤول أمرهم إلى تعطيل الشرائع والأمر والنهي، مع الاعتراف بالربوبية العامة لكل مخلوق، وانه ما من دابة إلا ربي آخذ بناصيتها، وهو الذي يبتلى به كثيراً - إما اعتقاداً، وإما حالاً - طوائف من الصوفية والفقراء، حتى يخرج من يخرج منهم إلى الإباحة للمحرمات، وإسقاط الواجبات، ورفع العقوبات) (2) .",
    "foot_note": "1. مجموع الفتاوى (8/ 59 - 60). \n2. المرجع السابق (3/ 111)، (8/ 256).",
    "book_id": "70",
    "new_page_number": 45
  },
  {
    "serial_number": "97931",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "ثم كان نتيجة لهذا الفهم الخاطئ لعقيدة القدر أن (تطرف المتصوفة في مفهوم التوكل على الله، وفهموه فهماً خاطئاً فقطعوا الأخذ بالأسباب، وتركوا التحرز والاحيتاط، وفسروا التوكل بغير معناه الشرعي، وخالفوا بذلك الكتاب والسنة. فالتوكل عند المتصوفة صار يفسر تفسيراً عجيباً، وطبق في حياة القوم تطبيقاً غريباً. وها هو أحد كبار الصوفية يشرح معنى التوكل عندهم فيكتب (قال الحسن أخو سنان: حججت أربع عشرة حجة حافياً متوكلاً، وكان يدخل في رجلي الشوك، فلا أخرجه، لئلا ينقص توكلي) (وقيل من أدعى التوكل ثم شبع فقد حمل زاداً). إن هذا النوع من التوكل كاف لهدم المجتمعات، ونشر الفقر بينها وقد يؤدي إلى هلاك أهلها، وهو مخالف لسنة رسول الله صلى الله عليه وسلم (1) . إن (التوكل ثمرة الإيمان بالقضاء والقدر ونتيجته، ولذلك فهو عقيدة تقترن بالعمل .. قال تعالى: {وَمَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ} [يونس: 49]. وقال تعالى: {فَإِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللَّهِ إِنَّ اللَّهَ يُحِبُّ الْمُتَوَكِّلِينَ (159)} [آل عمران: 159]. فمن ترك العمل إطلاقاً، فإنه لم يفهم التوكل على وجهه الصحيح وذلك من التواكل المذموم، الذي يوجد البطالة، وينتج المتسكعين في الشوارع، أو التكايا والزوايا) (2) . (إلا أن الصوفية يرون أن التوكل يتعارض مع العمل فهو درجة يلتزم بها من يستطيعها منهم، بالطريقة السلبية عندهم) (3) . لقد أفسد التواكل كثيراً من عقيدة القضاء والقدر، وحولها من عقيدة إيجابية دافعة إلى عقيدة سلبية مخذلة، وإلى الرضا السلبي بالواقع، وعدم محاولة التغيير. وقد استغل نابليون بونابرت تلك الفكرة المنحرفة عن القضاء والقدر لما احتلت جيوشه الصليبية أرض مصر، فكان يصدر منشوراته بتذكير المسلمين بأن ما وقع لهم من الاحتلال والأسر كان بقدر من الله، فمن حاول الاعتراض على ما وقع فكأنه يعترض على القضاء والقدر (4) .",
    "foot_note": "1. محمد الناصر، بدع الاعتقاد وأخطارها على المجتمعات المعاصرة، ص 302، الطبعة الأولى، مكتبة السوادي، جدة، 1416 هـ .. \n2. انظر الأحوال الدينية عند المسلمين (ص 283 - 285) على بن بخيت الزهراني. نقلاً عن بدع الاعتقاد ص 305. \n3. موقف الإمام ابن تيمية من الصوفية: د أحمد البنانى ص 125 - 126 .. نقلاً عن بدع الاعتقاد ص 304. \n4. عجائب الآثار في التراجم والأخبار: الشيخ عبدالرحمن الجبرتي: (2/ 239) دار الفارس، بيروت، نقلاً عن بدع الاعتقاد ص 306.",
    "book_id": "70",
    "new_page_number": 46
  },
  {
    "serial_number": "97932",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "وبذلك يحاول المتصوفة مخالفة واقع هذا الدين، ومصادمة نصوصه الواضحة في انحرافات كثيرة، ساهمت في تخلف هذه المجتمعات، وأن تترك قيادة ركب الحضارة لغيرها من الأمم الضالة، بعد أن كانت خيراً وبناء وإعماراً للبشرية كلها، يوم أن كانت تسير على هدي هذا الدين، وتستنير بنوره الوهاج) (1) . ولقد انصرف الصوفية إلى الصلاة أو الصيام والذكر، وقالوا: هذه هي الأعمال المطلوبة للآخرة، أما أمور الدنيا فلا حاجة لنا إلى الخوض فيها، لأنها فتنة توقع في حبائل لشيطان. (وتم عزل العبادة عن بقية الإسلام حتى كأن الإسلام منحصر فيها دون بقية الأجزاء كالجهاد مثلاً، وأحكام المعاملات أو العلاقات الدولية. ومع أن أكثر الناس إن لم نقل كلهم يعلمون أن الإسلام ليس هو العبادات المفروضة فحسب، فإنهم أهملوا الجوانب الأخرى، وغضوا النظر عنها وأنزلوا مرتبتها. ودعا فريق من المرشدين إلى الإعراض عما سوى العبادات. فالجهاد وإنكار المنكر ورد الطغيان والاستعمار ومقاومة الظلم والعمل في جميع ما ينفع المسلمين من الأمور العامة، كل ذلك في نظر هذا الفريق من الناس وما أكثرهم في عصور الانحطاط - فضول يشغل عن الله وعبادته … وبينما كانت مقاييس التقوى والصلاح في الإسلام شاملة لجميع الواجبات التي أوجبها الإسلام من عبادات خاصة، وجهاد وعلم وعدل وعمل نافع للناس، واستقامة في المعاملة وإحسان، كل ذلك مقروناً بتوحيد الله والإخلاص له أصبحت مقاييس التقوى محصورة في العبادات) (2) . وكانت النتيجة بسبب هذا الفكر السلبي إضافة إلى الفكر الإرجائي الذي شجع على التفلت من التكاليف أن وصل العالم الإسلامي إلى حالته الراهنة من الفقر والجهل والمرض (إن التربية الصوفية على الدعة في التكايا والزوايا، مع سماع الأناشيد والأشعار وفهم مغلوط - عند كثير منهم - لمفهوم القدر، وأن إرادة الله نافذة ولا مجال لدفع العدو بالجهاد .. كل ذلك أبعد المتصوفة عن الجهاد، بل جعل أكثرهم يوالي الأعداء أو ينزوي بعيداً عن أحداث الأمة ونكباتها) (3) . (وقد طغت الصوفية على العالم الإسلامي، وجعلته ينام في سبات عميق، وتخدره إلى حد لا يفيق منه، فانشغل المسلمون بالأضرحة والقبور، والشفاعة عندها، ولازموا الزوايا والتكايا ورددوا أوراد المشايخ عاطلين عن العمل وحتى العلم الشرعي، وغسل المشايخ أدمغة أتباعهم فصدقوا كل مستحيل، وآمنوا بما يقول الشيخ العتيد، فكانت تربيتهم للأتباع تربية ذليلة في الغالب، وقد يخرج المجاذيب إلى الشوارع يدعون على الكافر المارق ذي المدافع والدبابات. … .. إن هذا السبات العميق، والجهل الشديد، كان نتيجة طبيعية للآثار السلبية التي تركها المتصوفة تنخر في جسم الأمة، إضافة إلى أمراض أخرى) (4)",
    "foot_note": "1. بدع الاعتقاد ص 306. \n2. المجتمع الإسلامي المعاصر، محمد المبارك، ص 66 - 67، دار الفكر بيروت، الطبعة الأولى، 1391 هـ. نقلا عن الانحرافات العقدية والعلمية ص (1/ 99 - 100). \n3. بدع الاعتقاد ص 307. \n4. بدع الاعتقاد ص 272.",
    "book_id": "70",
    "new_page_number": 47
  },
  {
    "serial_number": "97933",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "لقد كتب أحد المستشرقين الألمان وهو يؤرخ لحال المسلمين في عصوره الأخيرة يقول: طبيعة المسلم التسليم لإرادة الله والرضا بقضائه وقدره والخضوع بكل ما يملك للواحد القهار. وكان لهذه الطاعة أثران مختلفان ففي العصر الإسلامي الأول لعبت دوراً كبيراً في الحرب إذ حققت نصراً متواصلاً لأنها دفعت في الجندي روح الفداء، وفي العصور الأخيرة كانت سبباً في الجمود الذي خيم على العالم الإسلامي فقذف به إلى الانحدار وعزله وطواه عن تيارات الأحداث العالمية، إن هذا الرجل وهو كافر أدرك هذه الحقيقة: حقيقة الفرق بين الإيمان بالقدر كما فهمه السلف وبين الإيمان الذين ابتدعه الخلف متأثرين بالمتصوفة. ولاشك أن ما أصاب المسلمين من ذل وهوان وهزائم معنوية وحسية كان بقدر الله الذي لا يقع في كونه إلا ما يريد ولا يخفى عليه شيء بل سيان في علمه ما كان وما سيكون، لكن المسلمين في العصور الأخيرة حرفوا هذا المفهوم فاتخذوا من الإيمان بالقدر مبرراً واهياً لعجزهم وانهيارهم متناسين أن أقدار الله إنما تجري عليهم وفق سننه الثابتة التي أوضحها لهم لكنهم غفلوا عنها وأهملوها، فالمسؤولية مسؤوليتهم وحدهم ولا يظلم ربك أحدا. لقد انقلب التوكل الذي كان الباعث القوي لحركة الجهاد والانطلاق في الأرض بأسباب الحياة إلى تواكل رخيص مذموم سماه المتصوفة \"يقيناً\" وسماه الآخرون \"قناعة\" واحتسبه الكل عند الله. واستسلم المسلمون لنوم طويل - محتجين بالقدر - فلم يوقظهم إلا هدير الحضارة الغربية وهي تدك معاقلهم وتقتحم حصونهم، وكانت المفاجأة المذهلة التي زعزعت إيمان الأمة بدينها، وهو الإيمان الذي كان خامدا بارداً لا حراك له، وفي لحظة الانبهار والإنذهال هذه، قال المستشرقون والمبشرون وأذنابهم: أن الدين - وعقيدة القدر خاصة - هو سبب التأخر والجمود في العالم الإسلامي، وصدقهم المغفلون الذين كانوا لا يعرفون من شعائر الدين إلا ما رسمه لهم مشايخ الطرق من صلوات وأوراد، ولا من قواعده إلا أن من الإيمان أن يرضى المرء بما كتب له - على المفهوم الخاطئ لها -، وباسم الزهد في الدنيا، والاستسلام الخانع للذل والفقر - تحت ستار الإيمان بالقدر-، وهما ما تطوعت به الطرق الصوفية وشجعته البيئة الجاهلة المنحطة- تقهقرت الحضارة الإسلامية وذبلت حتى لفظت أنفاسها على يد الغزو العسكري والحضاري القادم من الغرب. (وأصبحت الصوفية جبرية مرجئة تربّت على أكتاف النائمين، فيستولي اليأس والقنوط على الحياة .. هذه النظرة السلبية كانت خير عون للمستعمر .. الذي غذى الصوفية وأنفق على مشاهدها وزواياها الكثير من أجل قتل الحيوية ونفسية الجهاد عند المسلمين) (1) .",
    "foot_note": "1. بدع الاعتقاد ص 307.",
    "book_id": "70",
    "new_page_number": 48
  },
  {
    "serial_number": "97934",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": " الخاتمة وبعد فقد تبين لنا من خلال هذا البحث، أن الأساس الذي يقوم عليه صلاح الفرد هو العقيدة الصحيحة، والإيمان الراسخ بالله تعالى، وما يتبع ذلك من الإيمان بقضاء الله وقدره. ذلك أن الإيمان بالقضاء والقدر له أهمية في صلاح الفرد، واستقرا أحواله، فإنه لا سعادة لفرد لا يؤمن بالقضاء والقدر. وأنه ينبغي للمؤمن أن يسلم ويؤمن بكل ما جاء في الكتاب والسنة من الأمور التي تتعلق بالقضاء والقدر، وأن يفهمها الفهم الصحيح الذي عليه سلف هذه الأمة من الصحابة رضي الله عنهم، ومن سار على منهجهم من التابعين والعلماء الصالحين. وأن لا يخوض في ما ليس له به علم. وأن يتوكل على الله عز وجل في جميع الأمور صغيرها وكبيرها، وأن يجعل ذلك معيناً له على العمل وترك العجز والكسل. ربنا لا تزغ قلوبنا بعد إذ هديتنا وهب لنا من لدنك رحمة إنك أنت الوهاب وصلى الله وسلم على نبينا محمد وعلى آله وصحبه وسلم.",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 49
  },
  {
    "serial_number": "97935",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": " فهرس المراجع 1 - أصول التربية الإسلامية وأساليبها في البيت والمدرسة والمجتمع، عبد الرحمن النحلاوي، الطبعة الثانية، دار الفكر، دمشق، 1403 هـ. 2 - الانحرافات العقدية في القرنين الثالث عشر والرابع عشر الهجريين وآثارهما في حياة الأمة، علي الزهراني، الطبعة الثانية، دار طيبة، مكة، 1418 هـ. 3 - التدمرية، شيخ الإسلام ابن تيمية، الطبعة الثانية، مطبوعات جامعة الإمام محمد بن سعود، الرياض، 1400 هـ. 4 - التنبيهات اللطيفة على ما احتوت عليه العقيدة الواسطية من المباحث المنيفة، عبد الرحمن بن سعدي، الطبعة الأولى، تعليق الشيخ ابن باز، ضبط علي حسن عبد الحميد، دار ابن القيم، الدمام، 1409 هـ. 5 - التوضيح لشجرة الإيمان للشيخ عبد الرحمن ابن سعدي، الطبعة الأولى، اعتنى به أشرف عبد المقصود، أضواء السلف، الرياض، 1419 هـ. 6 - التوكل على الله وعلاقته بالأسباب لعبد الله الدميجي، الطبعة الأولى، دار الوطن، الرياض، 1417 هـ. 7 - الجامع الصحيح في القدر، تأليف مقبل الو ادعي، ص 14، مكتبة ابن تيمية، القاهرة. 8 - الحزن والاكتئاب في ضوء الكتاب والسنة، عبد الله الخاطر، طبعة المنتدى الإسلامي، لندن. 9 - الحسنة والسيئة، شيخ الإسلام ابن تيمية، الطبعة الأولى، تحقيق محمد الخشت، دار الكتاب العربي، بيروت، 1405 هـ. 10 - الدرة البهية شرح القصية التائية في حل المشكلة القدرية لشيخ الإسلام، تأليف عبد الرحمن بن سعدي، مكتبة المعارف، الرياض، 1406 هـ. 11 - السنة لابن أبي عاصم، الطبعة الثانية، تحقيق الألباني، المكتب الإسلامي، بيروت، 1405 هـ. 12 - العقيدة الطحاوية شرح ابن أبي العز، الطبعة الأولى، تحقيق عبد الله التركي، شعيب الأرناؤط، مؤسسة الرسالة، بيروت، 1408 هـ. 13 - العقيدة الطحاوية للإمام أبي جعفر أحمد بن محمد الطحاوي، الطبعة الأولى، تعليق الشيخ عبد العزيز بن باز، مكتبة ابن تيمية، القاهرة، 1415 هـ. 14 - العقيدة الواسطية، ابن تيمية، شرح الشيخ محمد بن مانع، مكتبة النهضة الحديثة. 15 - الفرق بين الفرق للبغدادي، الطبعة الأولى، تعليق إبراهيم رمضان، دار المعرفة، بيروت، 1415 هـ.",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 50
  },
  {
    "serial_number": "97936",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "16 - الفوائد لابن القيم، ترتيب وتعليق علي حسن عبد الحميد، دار ابن الجو زي، الدمام، 1417 هـ. 17 - القاموس المحيط، للفيروزآبادي، ضبط وتوثيق يوسف الشيخ البقاعي، دار الفكر، بيروت، 1415 هـ. 18 - القضاء والقدر في ضوء الكتاب والسنة ومذاهب الناس فيه، عبد الرحمن المحمود، الطبعة الثانية، دار الوطن، الرياض، 1418 هـ. 19 - القضاء والقدر لعمر الأشقر، الطبعة الثالثة، دار النفائس، الأردن، 1415 هـ. 20 - القضاء والقدر لمحمد الحمد، الطبعة الأولى، دار ابن خزيمة، الرياض 1415 هـ. 21 - الكواشف الجلية عن معاني الواسطية، عبد العزيز السلمان، الطبعة التاسعة عشرة. 22 - الملل والنحل للشهرستاني، الطبعة الثانية، دار مكتبة المتنبي، بيروت 1992 م. 23 - النهاية في غريب الحديث والأثر، الطبعة الأولى، تعليق صلاح عويضة، دار الكتب العلمية، بيروت 1418 هـ. 24 - الهزيمة النفسية عند المسلمين لعبد الله الخاطر، الطبعة الأولى، المنتدى الإسلامي، لندن، 1412 هـ. 25 - الوسائل المفيدة للحياة السعيدة، ابن سعدي، الطبعة الرابعة، الرئاسة العامة لإدارات البحوث العلمية والإفتاء، 1409 هـ. 26 - بدع الاعتقاد وأخطارها على المجتمعات المعاصرة، محمد الناصر، الطبعة الأولى، مكتبة السوادي، جدة، 1416 هـ. 27 - تحفة الأحوذي شرح سنن، الطبعة الثالثة، ضبط عبدالرحمن عثمان، مكتبة ابن تيمية، 1407 هـ 28 - تفسير القران العظيم، ابن كثير، الطبعة الثانية، تقديم الدكتور يوسف المرعشلي، دار المعرفة، بيروت، 1407 هـ. 29 - تيسير الكريم الرحمن في تفسير كلام المنان، ابن سعدي، مركز صالح بن صالح الثقافي، عنيزة، 1407 هـ. 30 - جدد حياتك، محمد الغزالي، الطبعة التاسعة، دار القلم دمشق، 1416 هـ. 31 - خلق أفعال العباد للبخاري، الطبعة الثانية، تحقيق د. عبد الرحمن عميرة، دار عكاظ، جدة. 32 - ديوان الإمام الشافعي. الطبعة الثالثة، مؤسسة الزعبي، بيروت، 1392 هـ. 33 - سلسلة الأحاديث الصحيحة للألباني، الطبعة الرابعة، المكتب الإسلامي، بيروت، 1405 هـ. 34 - سلسلة الأحاديث الصحيحة، للألباني، الطبعة الأولى، مكتبة المعارف، الرياض، 1412 هـ.",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 51
  },
  {
    "serial_number": "97937",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "35 - شرح أصول اعتقاد آهل السنة والجماعة للالكائي، الطبعة الثانية، تحقيق أحمد حمدان، دار طيبة، الرياض، 1411 هـ. 36 - شفاء العليل في مسائل القضاء والقدر والحكمة والتعليل، ابن القيم، الطبعة الأولى، تصحيح السيد محمد بدر الدين الحلبي، مكتبة الرياض الحديثة، الرياض. 37 - شيخ الإسلام أحمد تقي الدين أبن تيمية: جهاده، دعوته، عقيدته، للشيخ أحمد القطان ومحمد الزين، الطبعة الأولى، مكتبة السندس، الكويت، 1406 هـ. 38 - صحيح سنن الترمذي للألباني، الطبعة الأولى، مكتب التربية العربي لدول الخليج، الرياض، 1408 هـ. 39 - صحيح مسلم بشرح النووي دار الكتاب العربي، بيروت، 1407 هـ. 40 - ضعيف سنن الترمذي للألباني الطبعة الأولى، المكتب الإسلامي، بيروت، 1411 هـ. 41 - عقيدة أهل السنة والجماعة، ابن عثيمين، الطبعة الثالثة، إدارة البحوث العلمية والإفتاء، الرياض، 1416 هـ. 42 - فتاوى اللجنة الدائمة للبحوث العلمية والإفتاء، الطبعة الأولى، جمع أحمد الدويش، مكتبة المعارف، الرياض، 1412 هـ. 43 - فتح الباري شرح صحيح البخاري، تصحيح الشيخ عبد العزيز بن باز، دار الفكر. 44 - فتح القدير، للشوكاني، طبعة دار الفكر، بيروت، 1403 هـ. 45 - فتح المجيد شرح كتاب التوحيد، عبد الرحمن بن حسن، الطبعة الأولى، المكتبة التجارية، مكة، 1412 هـ. 46 - لسان العرب ابن منظور، تحقيق عبد الله الكبير وغيره، دار المعارف. 47 - مجموع الفتاوى لشيخ الإسلام ابن تيمية، جمع عبد الرحمن ابن قاسم، مكتبة ابن تيمية، القاهرة. 48 - مجموع الفتاوى للشيخ ابن باز، جمع عبد الله الطيار وأحمد بن باز، الطبعة الأولى، دار الوطن، الرياض، 1416 هـ. 49 - مختصر منهج القاصدين للمقدسي، الطبعة الثانية، تعليق عبد الله الأنصاري، دار المعرفة، بيروت، 1416 هـ. 50 - مدارج السالكين لابن القيم، تحقيق محمد حامد الفقي، دار الرشاد الحديثة، الدار البيضاء، المغرب. 51 - مذاهب فكرية معاصرة، محمد قطب، الطبعة الرابعة، دار الشروق، القاهرة، 1409 هـ. 52 - معارج القبول بشرح سلم الوصول إلى علم الأصول للشيخ حافظ الحكمي، الطبعة الثالثة، ضبط وتعليق عمر بن محمود، دار ابن القيم، الدمام، 1414 هـ.",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 52
  },
  {
    "serial_number": "97938",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "عقيدة الإيمان بالقضاء والقدر عند السلف وأثرها على المؤمن",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "53 - معجم ألفاظ العقيدة، تصنيف عامر فالح، الطبعة الأولى، مكتبة العبيكان، الرياض، 1417 هـ. 54 - معجم مقاييس اللغة، ابن فارس، الطبعة الأولى، تحقيق عبد السلام هارون، دار الجيل، بيروت، 1411 هـ. 55 - مفتاح دار السعادة لابن القيم، طبعة رئاسة البحوث العلمية والإفتاء، الرياض. 56 - منهج الأشاعرة في العقيدة، للشيخ سفر الحوالي، الطبعة الأولى، الدار السلفية، الكويت، 1407 هـ. 57 - نونية القحطاني، لأبي محمد عبد الله بن محمد الأندلسي، الطبعة الثالثة، تصحيح وتعليق محمد بن أحمد، مكتبة السوادي، جدة، 1415 هـ. 58 - شريط عقيدة أهل السنة والجماعة في القضاء والقدر، صالح آل الشيخ، تسجيلات النداء الإسلامية، الرياض. 59 - شريط أثر الإيمان بالقضاء والقدر على المؤمن، الشيخ عبد الرحمن الدوسري، وصالح اللحيدان، تسجيلات التقوى، رقم 3362.",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 53
  }
]