[
  {
    "text": "The Story of the Antichrist (Al-Masih ad-Dajjal) and the Descent of Jesus (Isa) peace be upon him\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Story of the Antichrist (Al-Masih ad-Dajjal) and the Descent of Jesus (Isa) peace be upon him",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 1
  },
  {
    "text": "sn: 378\nbook_title: قصة المسيح الدجال ونزول عيسى عليه الصلاة والسلام\nbook_link: https://shamela.ws/book/692\nbook_id: 692\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: المكتبة الإسلامية - عمان - الأردن\nedition: الأولى 1421هـ\npages: 149\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: العقيدة\ncategory_id: 1",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Story of the Antichrist (Al-Masih ad-Dajjal) and the Descent of Jesus (Isa) peace be upon him",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 2
  },
  {
    "serial_number": "104129",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist (Al-Masih ad-Dajjal) and the Descent of Jesus (Isa) peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "Al-Maktaba Al-Islamiyya - Amman - Jordan",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Creed (Aqidah). Book: The Story of the Antichrist (Al-Masih ad-Dajjal) and the Descent of Jesus (Isa) peace be upon him. Author: Muhammad Nasir al-Din al-Albani (Died 1420 AH). Publisher: Al-Maktaba Al-Islamiyya - Amman - Jordan. Edition: First 1421 AH. Number of Pages: 149 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 22 Muharram 1433.\nBook: The Story of the Antichrist (Al-Masih ad-Dajjal) and the Descent of Jesus (Isa) peace be upon him. Author: Muhammad Nasir al-Din al-Albani (Died 1420 AH). Publisher: Al-Maktaba Al-Islamiyya - Amman - Jordan. Edition: First 1421 AH. Number of Pages: 149 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 22 Muharram 1433.\nAuthor: Muhammad Nasir al-Din al-Albani (Died 1420 AH). Publisher: Al-Maktaba Al-Islamiyya - Amman - Jordan. Edition: First 1421 AH. Number of Pages: 149 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 22 Muharram 1433.\n[Book numbering corresponds to the printed version]. Publication Date in Shamela: 22 Muharram 1433.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 3
  },
  {
    "serial_number": "104130",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist (Al-Masih ad-Dajjal) and the Descent of Jesus (Isa) peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "Al-Maktaba Al-Islamiyya - Amman - Jordan",
    "page_number": 0,
    "volume_number": 1,
    "text": "The Story of the Antichrist (Al-Masih ad-Dajjal) and the Descent of Jesus (Isa) peace be upon him and his killing of him, based on the context of the narration of Abu Umamah (may Allah be pleased with him), with additions from what has been authentically reported from other Companions (may Allah be pleased with them). By: Muhammad Nasir Al-Albani. Publisher: Al-Maktaba Al-Islamiyya - Amman - Jordan. Edition: First 1421 AH. Number of Parts: 1 [Book numbering corresponds to the printed version]",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 3
  },
  {
    "serial_number": "104131",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist (Al-Masih ad-Dajjal) and the Descent of Jesus (Isa) peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "Al-Maktaba Al-Islamiyya - Amman - Jordan",
    "page_number": 2,
    "volume_number": 1,
    "text": "Copyrights reserved for the heirs of the virtuous Sheikh Muhammad Nasir al-Din al-Albani, may Allah have mercy on him. First Edition 1421 AH.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 4
  },
  {
    "serial_number": "104132",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist (Al-Masih ad-Dajjal) and the Descent of Jesus (Isa) peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "Al-Maktaba Al-Islamiyya - Amman - Jordan",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. Publisher's Introduction. Indeed, all praise is due to Allah, we praise Him, we seek His help and we seek His forgiveness, and we seek refuge in Allah from the evils of our souls and from the evil consequences of our deeds. Whomever Allah guides, no one can misguide him, and whomever He leaves astray, no one can guide him. I bear witness that there is no god but Allah alone, without partner, and I bear witness that Muhammad is His servant and His messenger. As for what follows: It is known from the creed of Ahlus-Sunnah wal-Jama'ah that belief in the Last Day is a pillar of the pillars of Faith, and that the Last Day has minor and major signs preceding it. Among the major signs are: The emergence of the Antichrist (Al-Masih ad-Dajjal), and the descent of Jesus son of Mary (Isa ibn Maryam), peace be upon him. Imam Muslim narrated in his \"Sahih\" (2901) from Hudhayfah bin Asid Al-Ghifari who said: The Prophet (peace be upon him) came out to us while we were discussing. He said: \"What are you discussing?\" They said: We are mentioning the Hour. He said: \"It will not be established until you see ten signs before it.\" He mentioned: \"The Smoke, the Dajjal, the Beast, the rising of the sun from its west, the descent of Jesus son of Mary (peace be upon him), Gog and Magog, and three landslides (Khasf): a landslide in the East, a landslide in the West, and a landslide in the Arabian Peninsula, and the last of that is a fire emerging from Yemen driving people to their place of gathering.\" Due to the gravity of the matter of the Dajjal and the evil of his tribulation, the Messenger of Allah (peace be upon him) said: \"There is no prophet except that he warned his nation about the Dajjal, and I warn you about him: He is blind in one eye, and Allah is not blind in one eye. He walks on the earth, and the heavens and earth belong to Allah. Verily, the right eye of the False Messiah (Al-Masih) is like a floating grape.\" Narrated by Ibn Khuzaymah (p. 32) from Umm Salamah (may Allah be pleased with her), the wife of the Prophet (peace be upon him). And the Prophet (peace be upon him) commanded seeking refuge from the evil of his tribulation in prayer; he said: \"When one of you finishes...",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 5
  },
  {
    "serial_number": "104133",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist (Al-Masih ad-Dajjal) and the Descent of Jesus (Isa) peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "Al-Maktaba Al-Islamiyya - Amman - Jordan",
    "page_number": 4,
    "volume_number": 1,
    "text": "...the last Tashahhud, let him seek refuge in Allah from four things: From the torment of Hell, from the torment of the grave, from the trials of life and death, and from the evil of the False Messiah (Al-Masih ad-Dajjal).\" Narrated by Muslim (588) from Abu Hurairah (may Allah be pleased with him). Due to the importance of this matter, and to clarify that it is from the creed of Ahlus-Sunnah wal-Jama'ah, our Sheikh, the hadith scholar, the Mark, Muhammad Nasir al-Din al-Albani (may Allah have mercy on him) authored this book: \"The Story of the Antichrist (Al-Masih ad-Dajjal), and the Descent of Jesus (peace be upon him), and His Killing of Him; based on the context of the narration of Abu Umamah (may Allah be pleased with him), with additions from what has been authentically reported from other Companions (may Allah be pleased with them).\" It is a valuable work from the precious gems of the Sunnah left behind by our Sheikh. What encouraged our Sheikh Al-Albani to write this book - as he mentioned in his introduction - were two matters: First: The doubt of many who are affiliated with knowledge regarding the creed of the descent of Jesus (peace be upon him) and his killing of the Dajjal at the end of time. Second: That people in general - except whom Allah wills - no longer talk about the emergence of the Dajjal and the descent of Jesus (peace be upon him). The heirs of the Sheikh (may Allah have mercy on him) - in cooperation with the Islamic Library in Amman - saw fit to publish this book so that Muslims across the earth may benefit from it, and so the Sheikh may be rewarded for it after his death, seeking help from some students of knowledge. May Allah reward everyone with good. Amman - The Levant, 2 Rabi' al-Thani 1421 AH. The Publisher.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 6
  },
  {
    "serial_number": "104134",
    "category_id": "1",
    "category_en": "Creed / Islamic Belief",
    "category_ar": "العقيدة",
    "book_title_en": "The Story of the False Messiah (al-Masīḥ al-Dajjāl) and the Descent of Jesus, Peace Be Upon Him",
    "book_title_ar": "قصة المسيح الدجال ونزول عيسى عليه الصلاة والسلام",
    "edition": "الأولى 1421هـ",
    "publisher": "المكتبة الإسلامية - عمان - الأردن",
    "page_number": 5,
    "volume_number": 1,
    "text_en": "In the name of Allah, the Most Merciful, the Most Compassionate. Section One: Introduction of the Author — The Reason for Writing the Book. All praise is due to Allah, we praise Him, seek His help, and ask His forgiveness. We seek refuge in Allah from the evils within ourselves and from our bad deeds. Whomever Allah guides, none can mislead; and whomever He leaves astray, none can guide. I bear witness that there is no deity worthy of worship except Allah, alone without partner, and I bear witness that Muhammad is His servant and Messenger. “O you who believe, fear Allah as He should be feared, and do not die except in a state of submission [to Him]” [Āl ‘Imrān: 102]. “O mankind, fear your Lord who created you from a single soul and created from it its mate, and dispersed from both of them many men and women. And fear Allah, through whom you ask one another, and the wombs. Indeed, Allah is ever Watchful over you” [al-Nisā’: 1]. “O you who believe, fear Allah and speak words of appropriate justice. He will rectify your deeds for you and forgive your sins. And whoever obeys Allah and His Messenger has certainly attained a great success” [al-Aḥzāb: 70–71]. To proceed: the most truthful speech is the Book of Allah, and the best guidance is the guidance of Muhammad ﷺ. The worst of matters are newly invented ones, every innovation is misguidance, and every misguidance is in the Fire. As for what follows: it never occurred to my mind that I would one day dedicate time to writing...",
    "text_ar": "بسم الله الرحمن الرحيم  القسم الأول  مقدمة المؤلف  سبب تأليف الكتاب إن الحمد لله، نحمده ونستعينه ونستغفره، ونعوذ بالله من شرور أنفسنا، وسيئات أعمالنا، من يهده الله فلا مضل له، ومن يضلل فلا هادى له، وأشهد أن لا إلا اله إلا الله وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله. (يا أيها الذين آمنوا اتقوا الله حق تقاته ولا تموتن إلا وأنتم مسلمون) [آل عمران: 102]، {يا أيها الناس اتقوا ربكم الذى خلقكم من نفس واحدة وخلق منها زوجها وبث منهما رجالاً كثيرًا ونساءً واتقوا الله الذى تساءلون به والأرحام إن الله كان عليكم رقيبا} [النساء: 1]، (يا أيها الذين آمنوا اتقوا الله وقولوا قولا سديدا. يصلح لكم أعمالكم ويغفر لكم ذنوبكم ومن يطع الله ورسوله فقد فاز فوزا عظيما) [الأحزاب: 70 و71]. أما بعد؛ فإن أصدق الحديث كتاب الله، وأحسن الهدى هدى محمد صلى الله عليه وسلم، وشر الأمور محدثاتها، وكل محدثة بدعة، وكل بدعة ضلالة، وكل ضلالة فى النار. وبعد؛ فإنه لم يكن ليخطر فى بالى أن أتوجه يوما إلى تخصيص وقت ما",
    "foot_note": "None",
    "book_id": "692",
    "text": "",
    "new_page_number": 7,
    "category": "Creed"
  },
  {
    "serial_number": "104135",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 6,
    "volume_number": 1,
    "text": "to write this treatise. However, Allah, the Blessed and Exalted, if He wills a matter, prepares its causes. That is, in the beginning of Jumada al-Ula in the year 1393 AH, my investigation of the book 'Al-Fath Al-Kabir fi Damm Al-Ziyadah ila Al-Jami' Al-Saghir' — and separating it into two books: 'Sahih Al-Jami' Al-Saghir...' and 'Da'if Al-Jami' Al-Saghir...' — led me to the hadith of Abu Umamah Al-Bahili, may Allah be pleased with him, regarding the Prophet's (peace and blessings be upon him) warning to his nation about the Dajjal (Antichrist), and his (peace and blessings be upon him) description of him with descriptions no prophet before him had used, and Jesus's (peace and blessings be upon him) killing of him in (Lod) in Palestine, and other facts related to the Messiah of Guidance [Jesus] and the Messiah of Misguidance [Dajjal]. By virtue of the investigation methodology I adopted in the two aforementioned books, it required studying the chain of transmission of the referenced hadith and examining it. I found it to be weak and impossible to rely upon on its own, especially in such matters of creed and certainty. However, upon my first glance at its text, it became clear to me that much of it is authentic and established in the 'Two Sahihs' [Bukhari and Muslim] and other books of Sunnah. Since it is self-evident that I cannot judge the entire hadith as authentic based merely on such a hasty glance, and consequently include it in the first of the two aforementioned books: 'Sahih Al-Jami'... rather, it is necessary to scrutinize all its paragraphs, indeed its very words, and trace them in the depths of the books of Sunnah and the various hadiths contained therein; those having a close or distant relationship to Jesus (peace and blessings be upon him) and the Greater One-Eyed Dajjal (may Allah curse him), and what relates to them, and to study their chains of transmission with extensive verification similar to the method we followed in our two books: 'The Series of Authentic Hadiths' (Silsilat Al-Ahadith Al-Sahihah) and 'The Series of Weak Hadiths' (Silsilat Al-Ahadith Al-Da'ifah);",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 8
  },
  {
    "serial_number": "104136",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 7,
    "volume_number": 1,
    "text": "so that we may ultimately be able to decisively judge the authenticity of all or most of it, and thereafter include it in the 'Sahih', either wholly or mostly, according to what the investigation concludes. Thus, determination was directed towards studying the mentioned hadith paragraph by paragraph, indeed word by word, and mentioning the hadiths that strengthen each paragraph whenever I found a way to do so, and referencing [Takhrij] all of them while discussing their chains of transmission—authenticating or weakening—and tracking the corroborating reports (Mutaba'at) and witnessing reports (Shawahid) for them. This helps us to salvage whatever is possible of its paragraphs from the weakness inherent in them due to the chain itself through which it was narrated from the hadith of Abu Umamah, may Allah be pleased with him. It became clear to me after this meticulous study that the hadith, in all its paragraphs—except a few—is 'Authentic due to other evidence' (Sahih li-ghayrihi). In fact, many of them fall under the category of Mutawatir (mass-transmitted), definitely established from the Messenger of Allah, peace and blessings be upon him; such as that which relates to the emergence of the One-Eyed Dajjal, the descent of Jesus peace be upon him from the sky, and his killing of him [Dajjal]. It was quite natural that I would find, in those hadiths I referenced, a great many benefits related to Jesus peace be upon him and the One-Eyed Dajjal—things that were not mentioned in the hadith of Abu Umamah at all; especially since the number of hadiths reached nearly thirty, from more than twenty Companions. Some of them have more than one chain of transmission, particularly the hadith of Abu Hurairah; I extracted ten paths for it alone, and in each path, there are sometimes benefits and additions not found in the other paths.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 9
  },
  {
    "serial_number": "104137",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 8,
    "volume_number": 1,
    "text": "Therefore, after I finished studying the hadith and its paragraphs, and extracting the witnesses for them from the indicated hadiths, and depositing it in my book 'The Series of Authentic Hadiths' under number (2457), a beautiful idea occurred to me; namely, to track those indicated benefits and append them to their appropriate places in the hadith of Abu Umamah, may Allah be pleased with him, and present them with it in a single context. This is similar to the method I followed in my book 'The Farewell Pilgrimage of the Prophet, peace and blessings be upon him, as Narrated by Jabir, may Allah be pleased with him'; with a fundamental difference between the two hadiths. [In Jabir's hadith] I tracked and placed every authentic addition in the appropriate place in the context of his hadith, may Allah be pleased with him, from the narration of Muslim via Abu Ja'far Al-Baqir from him. As for the hadith of Abu Umamah, may Allah be pleased with him, I appended to it what was authenticated from other Companions, may Allah be pleased with them, and their number exceeded twenty Companions, as previously indicated. This idea kept recurring to me, and I turned it over in my mind time and again, until it took hold of me and compelled me to bring it into existence; due to the importance I saw in it, and the necessity of presenting it to the people in this marvelous context that is easy for all people to access—regardless of their different cultures and ranks—and brings closer to them the scattered benefits dispersed in the hadiths which most of the elite scholars cannot extract, let alone the general public.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 10
  },
  {
    "serial_number": "104138",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 9,
    "volume_number": 1,
    "text": "The following matters encouraged me to do this: First: The skepticism of many who affiliate themselves with knowledge—indeed, even with the call to Islam, let alone others who have no Islamic culture among the educated youth and the general public—regarding the doctrine of the descent of Jesus, peace and blessings be upon him, and his killing of the Dajjal at the end of time. It has even settled in my mind that many students graduating from Al-Azhar University are among these skeptics—if not among the deniers of it. I realized this from discussing it with some of them verbally, and from looking at the fatwas of some, and the comments of others on certain books. Among the most famous of these scholars is Sheikh (Muhammad Abduh); for he says regarding the hadith of the descent of Jesus peace be upon him: sometimes that it is a solitary (Ahad) hadith! And this is according to his knowledge of Hadith, and he is one of the furthest contemporary scholars from it in my critique. And at other times he interprets his descent and rule on earth as the prevalence of his spirit and the secret of his message over people, which is what dominated his teachings regarding the command for mercy, love, and peace... This was recounted by Sayyid Rashid Rida in his 'Tafsir' (3/217); and although he refuted him by saying immediately after: 'But the apparent meanings of the hadiths narrated regarding that refuse this,' he [Rida] then countered this correction by saying immediately after that: 'But the proponents of this interpretation have the right to say: These hadiths have been transmitted by meaning, like most hadiths, and the transmitter of meaning conveys what he understood.' He (meaning: Muhammad Abduh) was asked about",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 11
  },
  {
    "serial_number": "104139",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 10,
    "volume_number": 1,
    "text": "the Antichrist (Dajjal) and Jesus killing him? He said: The Dajjal is a symbol for superstitions, quackery, and evils that will disappear by establishing the Sharia in its proper form...! It is strange that the claimant to prophethood (Mirza Ghulam Ahmad Al-Qadiani Al-Hindi) preceded him in this interpretation, and repeated it in his books and treatises. How similar this interpretation is to his interpretation of many Quranic verses; distorting them and using them as evidence for his prophethood; such as his interpretation of the Almighty's saying regarding Jesus: {And giving good tidings of a Messenger to come after me, whose name is Ahmad} [As-Saff: 6]; claiming that he is the one intended by His saying: {Ahmad}! He has much of this sort, which is of utmost absurdity; as Sayyid Rashid himself said in the context of refuting him in another place in his 'Tafsir' (6/58), where he said: 'He followed the method of the claimants to Mahdism from the Shi'a of Iran—like the Baha'is and the Babis—in deducing delusional proofs for his call from the Quran; to the extent that he extracted that from Surah Al-Fatiha! And he has a book interpreting it that is the utmost in absurdity, claiming it is a miracle for him!! He made it a glad tiding of his appearance, and that he is the Messiah of this nation!' Sayyid Rashid said following that: 'This strange door of interpreting the Quran and distorting its words from the meanings they were coined for, to strange meanings that do not resemble or suit them, was only opened upon this nation by those heretics from the Magians and their helpers who devised the teachings of the Batini (esoteric) sects; so it gained currency even among many of the Sufis.'",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 12
  },
  {
    "serial_number": "104140",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 11,
    "volume_number": 1,
    "text": "I say: Then what is the difference between the interpretation of these Batinis of the Quran; and the interpretation of the Qadianis, (Muhammad Abduh), and those who followed him regarding the hadiths of the Descent and the Dajjal with that obviously false interpretation?! And how did Sayyid Rashid, may Allah have mercy on him, remain silent about it; indeed, he devised a new interpretation for them that the hadiths were transmitted by meaning?! I wish I knew! Does that necessitate rejecting the meanings whose narration from the Companions is valid, let alone what is Mutawatir (mass-transmitted) from them?! For example: If it is Mutawatir from the Companions that the Prophet, peace and blessings be upon him, forbade something like the meat of domestic donkeys; this is definitely narration by meaning. Does this necessitate rejecting this meaning which they narrated regarding the prohibition through some method of interpretation; such that this prohibition is nullified and becomes as if it was never mentioned at all?! By Allah! This is indeed manifest error. We ask Allah Almighty to protect us from it. Here is another example of the interpretation that some contemporary writers from Al-Azhar have been afflicted with: Sheikh (Muhammad Fahim Abu Ubayyah) said in his commentary on 'Nihayat al-Bidaya wa al-Nihaya' (1/71): 'Is Jesus peace be upon him still alive until now? And will he descend to earth to renew the call to Allah's religion himself? Or is the intent of Jesus's descent the victory of the religion of truth and its spread anew at the hands of sincere people working to rid human society of evils and sins? Two opinions (!) each held by a group of scholars (!). And this is what is said regarding the Antichrist (Dajjal): Is he flesh and blood who spreads corruption and threatens the servants, possessing means of enticement, terror, and corruption; until",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 13
  },
  {
    "serial_number": "104141",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 12,
    "volume_number": 1,
    "text": "Allah destines Jesus peace be upon him for him so he kills him? Or is he a symbol for the spread of evil, the prevalence of sedition, and the weakness of virtuous impulses, upon which the wind of good, symbolized by Jesus peace be upon him, blows, removing it and eliminating it, and taking people by the hand to the path of good and the method of justice and religiosity?'! (1) I say: This 'Fahim' (Understanding One) Azhari is not content with this nullification of the texts of the Sunnah and interpreting them—via the method of symbolism which is the doctrine of the atheist Batinis; as previously recounted from Sayyid Rashid Rida himself—but he misleads the readers into thinking that this nullification is an opinion of some scholars opposing the first opinion! The truth is that no one of repute in knowledge among the People of Hadith and Sunnah has said this. Rather, it was said by some Kharijites and Mu'tazila among the deviant sects. Qadi Iyad said: 'In these hadiths is a proof for Ahl al-Sunnah regarding the reality of the Dajjal's existence, and that he is a specific person through whom Allah tests His servants and empowers him over things; such as reviving the dead person he kills (Paragraph 17 and 18 - Abu Umamah, 18 - Context), the appearance of fertility, rivers, Paradise and Fire, the treasures of the earth following him, his commanding the sky to rain and the earth to sprout vegetation (Paragraphs 19-21 Abu Umamah, 19-21 - Context). All of that is by Allah's will, then He renders him incapable, so he cannot kill the man or anyone else, then He nullifies his affair, and Jesus the son of Mary kills him. Some of the Kharijites, Mu'tazila, and Jahmiyyah opposed this; denying his existence and rejecting the authentic hadiths.'",
    "foot_note": "1. And he mentioned similar to this (p. 148)",
    "book_id": "692",
    "new_page_number": 14
  },
  {
    "serial_number": "104142",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 13,
    "volume_number": 1,
    "text": "I say: And this is exactly what this 'Fahim' Azhari and some of his teachers have done—following their predecessors from the Kharijites and Mu'tazila; and finally the Qadianis as previously mentioned—sometimes by casting doubt on the authenticity of the hadiths by claiming they are solitary (Ahad)—as Sheikh (Mahmoud Shaltut) did in some of his articles; following Sheikh (Muhammad Abduh) as previously mentioned—and sometimes by way of interpretation and nullification as this 'Fahim' did! And although he limited himself in his previous speech to recounting the two opinions—allegedly—without clearly defining his stance on them; he only did that to deceive and mislead the readers, and to prepare their minds to accept what he would prefer later! Listen to him as he says in his commentary on the following paragraph (12 - Abu Umamah, 14 - Context): 'Every believer, literate or illiterate, will read it': 'Scholars differed regarding the writing here: Is it literal; or is it a metonymy for the signs indicating its owner? And that reading means the believing soul is inspired by its illumination to see the truth without doubt... And perhaps this is closer and safer' (1)! Thus spoke this 'Fahim', ignoring the statement of Imam Al-Nawawi and others contrary to his preference. Al-Hafiz said in 'Al-Fath' (13/85): 'Al-Nawawi said: The correct view held by the verifiers is that the mentioned writing is literal, Allah made it a decisive sign of the Dajjal's falsehood, revealing it to the believer and hiding it from whom He intended misery.' Al-Hafiz said:",
    "foot_note": "1. And he mentioned similar to it (p. 148)",
    "book_id": "692",
    "new_page_number": 15
  },
  {
    "serial_number": "104143",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 14,
    "volume_number": 1,
    "text": "'And Iyad narrated a difference of opinion, and that some said: It is a metaphor for the mark of createdness upon him, which is a weak view.' Then that 'Fahim' was not content with preferring that invalid interpretation; rather, he asserts it after several pages; saying (p. 118): 'The difference in what was narrated of hadiths regarding the place of Dajjal's appearance... indicates that the intent of the Dajjal is the symbol of evil and its rise...'! And this is what he asserted in his preface to the book; saying: (p. 9) 'Then we proceeded with those who say that the appearance of the Mahdi and the descent of Jesus peace be upon him are symbols for the victory of good over evil, and that the Dajjal is a symbol for the spread of sedition and the dominance of misguidance for a period of time...'! I say: This 'Fahim' is the head of the Al-Azhar mission in (Lebanon); as printed under his name on the book's cover. He has greatly offended the author on one hand, and the Prophetic Hadith on the other, in his commentary on the mentioned book; which indicates his extreme ignorance of it! For he definitively weakened authentic hadiths; because his heart could not accommodate them! And no one of the people of knowledge preceded him in that—like the hadith of Al-Jassasah; see (p. 6, 69, 101), and Muslim narrated it, and the hadith of the Mahdi (p. 37)—disregarding the authentication of the author Ibn Kathir for some of them (p. 42 and 43); rather, he asserted the fabrication of another hadith narrated by Muslim in his 'Sahih' (p. 58-59)!",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 16
  },
  {
    "serial_number": "104144",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 15,
    "volume_number": 1,
    "text": "As for his offense against the book and the author; it is that he placed titles from himself within the body of the book without alerting to that, and some of them are contrary to the method of the author; considering him [the author] one of the Imams of Hadith who believe in the texts related to the signs of the Hour without interpreting them [metaphorically]; as the innovators from the Mu'tazila and others do. And this 'Fahim' has shown in his referenced comments that he followed their path exactly. For here he is, for example, placing a title from himself in the body of the book (p. 116): 'A Hadith that must be diverted from its apparent meaning'! He placed it above the hadith of Muslim regarding the Dajjal killing the believer and reviving him; (see paragraph 17 and 18 - Abu Umamah). And another title he placed on the hadiths narrated about Ibn Sayyad, some of which are in Bukhari! He said (p. 104): 'Rejected narratives; because they are not believed by reason, and it is not reasonable that they were issued by the Messenger, peace be upon him.' As if the Messenger, according to this 'Fahim', should not speak of unseen matters which reason has no choice but to submit to, and thus faith in the Unseen, which is [essence of] belief, has no existence in his soul!! And he placed a title on the hadith of the punishment of image-makers (2/50): 'The punishment of sculptors [makers of 3D images] on the Day of Resurrection'.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 17
  },
  {
    "serial_number": "104145",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 16,
    "volume_number": 1,
    "text": "In summary; these titles he placed from himself within the folds of the book; while they contradict scientific integrity; they - at the same time - indicate the extent of this 'Fahim's' knowledge, and the loss incurred by the publishers of the book materially and morally; since his mentioned comments have changed the features of the book, and made it, with these titles and comments, another book that is not the book of Al-Hafiz Ibn Kathir! Would that the transgression of this 'Fahim' upon the book stopped at this limit; he exceeded it to deleting many of its texts and hadiths that did not please his great mind! That is what he declared in his preface to the book; saying (p. 5): 'Rather, we were compelled to drop some of the narratives included by the author in his book; because they contained meaning that does not agree with reason nor align with religion'! Indeed, the reader of his comments finds the notification - in many pages of the book - that he dropped from it whatever he wished without mentioning the text of what was deleted; so that the readers would be aware of it; as integrity requires - this is if deletion were permissible! - From that is his saying (2/285): 'We dropped here passages that modesty would be shy of...'! And the strangest thing I saw from him is that he deleted four full pages leaving them blank in the second volume! They are pages (89, 99, 101, and 102)! By Allah, I have seen various types of claimants to knowledge in this time; but I have not seen the likes of this 'Fahim' in audacity, ignorance, and arrogance! Were it not that he is so; then tell me",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 18
  },
  {
    "serial_number": "104146",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 17,
    "volume_number": 1,
    "text": "by your Lord, how did he permit for himself this disgraceful behavior, violating scientific integrity in the book of Al-Hafiz Ibn Kathir; adding titles from himself, deleting pages, weakening authentic hadiths, or invalidating their meanings in the name of interpretation and reason?! I do not know - by Allah - how the publisher of the book was deceived by him?! He said in his introduction: 'As for the checking and verification; we have been successful - praise be to Allah - in that the eminent Sheikh Muhammad performed a commendable effort which purified the book from... linguistic errors and numerous distortions in the names of prominent figures mentioned in it, and correcting many of the texts contained within it'! It is strange - by Allah - that this 'Fahim' is described with these attributes, while the book has hundreds of evidences indicating that he is exactly the opposite! For he corrupted many of its texts, and fell into uncountable linguistic errors and numerous distortions within a single page! A matter which indicates that the Saudi lands think too well of the likes of this Azhari; which reminds me of the proverb: 'The small birds become eagles in our land'! Here are some examples I found in the first volume of the book: 1 - p (114): 'And (Jummah - hair) is removed' - written with Jeem and Kasra! - 'of every possessor of (Jummah)'. The correct is: 'Hummah' - with an un-dotted Ha and light Meem -: Poison! He repeated this error in page (169), and commented on it with what confirms it is a scientific error; saying:",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 19
  },
  {
    "serial_number": "104147",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 18,
    "volume_number": 1,
    "text": "'Al-Jummah: Hair gathered at the front of the head. Perhaps the meaning of removing (the Jummah of every possessor of Jummah) is: ridding society of different hairstyles that bind desiring eyes and lustful souls to girls... And it is self-evident that the word (possessor of Jummah) in the noble Hadith is functioning as an adjective for a deleted noun...' to the end of his nonsense! 2 - Three lines after the mentioned page (114): 'And the earth will be like the (Aathur) of silver'. The poor man commented on it saying: 'Al-Aathur: A perilous land...'. Whereas it is 'Ka-Fathur' with a Fa and Tha, which is: A tray. Or it is said: A basin or bowl of gold or silver. 3 - And on the following page (115): 'And Abu Dawood (Jarada - stripped) his chain'! The correct is: 'Jawwada' (made good/strong). 4 - And on p (117): 'Muhammad bin Abdullah bin (Qahran)'! It is actually (Qahzad). 5 - On the same page: 'Fa-yushajj (he is wounded in head). He says: Take him and (Shajjuhu - wound him)'!! And he commented on it: 'Al-Shajj: A wound in the face and head'!",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 20
  },
  {
    "serial_number": "104148",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 19,
    "volume_number": 1,
    "text": "The correct is: 'Fa-yushabbah... wa shabbihuhu' with a dotted Shin, then a doubled Ba, then an un-dotted Ha; meaning: stretch him out on his stomach; as Al-Nawawi said. 6 - p (133): 'With the (Maradah - rebels)'! It is actually 'Al-Qiradah' (monkeys). 7 - p (142): 'Musa bin Ubaydah (Al-Yazidi)'. The correct is: 'Al-Rabadhi'. 8 - p (144): 'The Dajjal will descend in (Hawran)'! The correct is: 'Khuz'; as in 'Al-Musnad' (2/319 and 337). 9 - p (146): 'Whoever hears (from - min) the Dajjal (Falasna minhu - we are not from him)'! This error occurred twice on the mentioned page, and he repeated it again (p. 154); which confirms it is an error from him, not the printer, and that's why he didn't correct it in the errata. The correct hadith is: 'Man sami'a bi-Dajjal fal-yan'a 'anhu'; meaning let him move away from him. It seems (The Fahim) could not read 'Fal-yan'a' correctly; so he distorted it to (Falasna), and consequently distorted 'bi-Dajjal' (of the Dajjal) to 'min Dajjal' (from the Dajjal), and ''anhu' (away from him) to 'minhu' (from him). 10 - Same page: 'And Abu Al-Dahma, and his name is (Firqah bin Bahir Al-Dawi)'! The correct is: 'Qirfah - with Kasra on Qaf and Sukun on Ra followed by Fa - Ibn Buhays - with Ba and un-dotted Ha, diminutive - Al-Adawi'!",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 21
  },
  {
    "serial_number": "104149",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 20,
    "volume_number": 1,
    "text": "11 - p (154) 'Hisham from Dastawa'i'! The correct is: 'Hisham Al-Dastawa'i'. 12 - p (180): 'Abi Ishaq'! The correct is 'Ibn Ishaq'. 13 - p (202): 'Migration does not benefit as long as the enemy fights'. The correct is: 'Migration does not cease...'. So reflect! How he inverted the meaning of the hadith and corrupted it with his extreme ignorance and arrogance?! 14 - p (214): '... Ibn Qawtb' And this has no existence among narrators. It is actually: 'Ibn Quwayd'; as in 'Al-Musnad' (2/442) and others. 15 - Among the strangest distortions I saw from him is that he brought a hadith that does not exist - not even in the fabricated collections - due to a subject getting distorted for him. In (2/58): 'In the Hadith: (Adimu - Make condiment) your food with His remembrance and prayer, and do not (Taqumuhu - sweep it) lest your hearts harden' And he commented on it saying: 'Qamm al-Khuwan: eating what is on the table leaving nothing, and Adama his bread: mixed it with what makes it palatable. The Messenger, peace be upon him, advises his followers that the remembrance of Allah Almighty should be the condiment of their food...' to the end of his eloquent speech!",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 22
  },
  {
    "serial_number": "104150",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 21,
    "volume_number": 1,
    "text": "The Hadith is actually with the wording: '(Adhibu - Melt/Dissolve) your food with the remembrance of Allah and prayer, and do not sleep upon it lest your hearts harden.' So 'Adhibu' was distorted for him to 'Adimu'! And his saying 'Do not sleep upon it' to 'La Taqumuhu' (Do not sweep it), then he built upon it what he built of delicate meaning!! Thus it was narrated by a group of Hadith scholars, and Al-Suyuti cited it in 'Al-Jami Al-Saghir'. Had he referred to it - as beginner students do, let alone a 'Head of Mission' - he would have known the origin of the hadith and not fallen into such hideous distortion! Furthermore, the hadith with this narrated wording is fabricated; as I verified in 'Al-Ahadith Al-Mawdu'ah' (115). So reflect on the extent of this (Fahim's) verification! Instead of noticing the correct wording of the hadith and noting its fabrication, he brought a hadith with no basis, then commented on it!!! In summary: The man's verification of this book - and his commenting on it with such comments - is the greatest proof that he is not qualified to verify a small treatise by a virtuous scholar of the Salaf! How then could he be qualified to verify a huge volume of the book of Al-Hafiz Ibn Kathir, may Allah have mercy on him?! And to authenticate weak hadiths, and weaken authentic ones arbitrarily without adhering to the rules of critics and knowledge of disparagement and endorsement, and to interpret them contrary to the people of knowledge?! This is ignorance to a degree that crosses no one's mind! And what would a rational person say about a man who does not understand the meaning of the Prophet's saying regarding those who enter Paradise without account:",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 23
  },
  {
    "serial_number": "104151",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 22,
    "volume_number": 1,
    "text": "'La Yastariqun' (They do not ask for Ruqyah), saying in his comment on it (2/66): 'Meaning: They do not spy with their ears on people... and this action is called Istiraq al-Sam' (eavesdropping)'?! The poor (Fahim) did not know that this verb is from 'Ruqyah', and the 'Sin' in it is for request, not from 'Sariqah' (theft) where the 'Sin' is a root letter! We return to our main topic; so we say: These interpretations adopted by these later scholars were among the strongest reasons that encouraged me to present the hadith of Abu Umamah, may Allah be pleased with him, with the additions of others from the Companions in one context. So that it becomes clear to everyone with two eyes the invalidity of those interpretations and their contradiction to the explicit authentic hadiths, and that the interpretation of those interpreters is intended only to get rid of these hadiths, and of believing in them, in a twisted way that deludes the common people that their proponents believe in them, while the reality is they disbelieve in their truths, and only believe in their wordings! By Allah; believing in texts entirely by way of symbol and interpretation is a faith not worth a penny, and avails nothing before Allah. I wish I knew! What is the difference between these scholars affiliated with the Sunnah, who nullify these Mutawatir (mass-transmitted) texts about the emergence of Dajjal, the descent of Jesus peace be upon him, and his killing of him; and the Batinis and deviant sects who believe in the texts of the Book and Sunnah;",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 24
  },
  {
    "serial_number": "104152",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 23,
    "volume_number": 1,
    "text": "while interpreting them with interpretations that ultimately lead to disbelief in their truths; like those who deny the Mutawatir texts in the Book and Sunnah regarding the believers seeing their Lord in the Hereafter; interpreting that the intended meaning is seeing the bliss of their Lord! And like the Qadianis who believe - they claimed - in His saying: {But he is the Messenger of Allah and the Seal of the Prophets} [Al-Ahzab: 40], then they say prophethood continues and many prophets come after him, peace and blessings be upon him; among them (Mirza Ghulam Ahmad Qadiani)! And if you ask them about this verse, they answer you that they believe in it - of course! - but its meaning is not as Muslims understood it before! Rather, the meaning is: But the Seal of the Prophets; meaning: their ornament; like the ring is the ornament of the finger! Does their belief in it avail them anything before Allah after they interpreted it with other than its true interpretation?! Likewise, I say: The belief of these scholars in the Mutawatir hadiths regarding the descent of Jesus peace be upon him and his killing of the Dajjal; avails them nothing with their interpreting them with that symbolic interpretation; because it is contrary to what every scholar stripped of desire cuts decisively when seeing the texts reported regarding them. And perhaps for that reason, some of them resort to getting rid of them by another method - other than the method of interpreting them symbolically - which is the method of casting doubt on their certainty of establishment by claiming they are solitary (Ahad) hadiths! Among these is Sheikh (Mahmoud Shaltut); I had read an answer of his long ago regarding the life of Jesus peace be upon him in the sky and his descent at the end of time - published by 'Al-Risalah' magazine back then - in which I saw immense wonder of ignorance regarding the reality of the hadiths reported about his descent. Among that was his claim that all their paths revolve around Wahb",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 25
  },
  {
    "serial_number": "104153",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 24,
    "volume_number": 1,
    "text": "ibn Munabbih and Ka'b al-Ahbar. I denounced that within myself; because my mind was free of such a claim, but I said to myself: Perhaps that is regarding some paths, but the Sheikh exaggerates! To verify that; I rushed to track the hadiths of his descent peace be upon him from their original sources in the books of Sunnah - which narrate hadiths with their chains; like the Six Mothers and others - until I gathered many hadiths regarding that; from Mutawatir paths from more than forty Companions. I was astonished when I did not see a mention of Wahb and Ka'b in any of those paths at all, even those with weak chains! I became certain then that the Sheikh - may Allah forgive him - wrote from his memory; without checking a single book from the referenced books of Sunnah regarding that! So I wrote a detailed treatise refuting his fatwa that day, and intended to send it to 'Al-Risalah' magazine. But one of our friends from the virtuous literati who frequent Egypt advised me not to send it, because they would not publish it; firstly due to its length; and because Sheikh Shaltut is above the level of criticism there; especially from a non-Egyptian person unknown to them! He said: If you must, then shorten the treatise as much as you can, then send it to them, perhaps they will publish it in the magazine, though I don't think they will. And so it was, I shortened it to a page and a half, then sent it, but it was not published!! Responding to the proponents of this method in detail has another place than this. It suffices regarding that the agreement of the scholars of Hadith and its memorizers on the Tawatur (mass transmission) of the hadith of Dajjal and the descent of",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 26
  },
  {
    "serial_number": "104154",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 25,
    "volume_number": 1,
    "text": "Jesus peace be upon him from the sky; such as Al-Hafiz Ibn Kathir (1) and Ibn Hajar and others; indeed Imam Al-Shawkani authored a treatise he named: 'Al-Tawdih fi Tawatur ma ja'a fi Al-Muntazar wa Al-Mahdi wa Al-Masih' (Clarification regarding the mass transmission of what came regarding the Awaited One, the Mahdi, and the Messiah). I have become certain - personally - of the Tawatur of the hadiths of Dajjal and Jesus when I wrote the treatise referred to previously. The paths that gathered with me - back then - reached more than forty paths from about forty Companions, some meeting the conditions of authenticity (Sahih), and the rest mostly having considered corroboration. Regrettably, I do not know where it is now due to moving from one house to another?! Then my certainty of that was renewed during my study of the hadith of Abu Umamah referred to in this introduction. Here are the names of the Companions who narrated the hadiths of Dajjal - whose hadiths I extracted in this study; noting that it did not exhaust everything reported on that due to irrelevance to the mentioned study -: 1 - Hisham bin Amir. 2 - Abdullah bin Mughaffal. 3 - Hudhayfah bin Al-Yaman. 4 - Jabir bin Abdullah.",
    "foot_note": "1. 'Al-Nihayah' by Ibn Kathir (1/148)",
    "book_id": "692",
    "new_page_number": 27
  },
  {
    "serial_number": "104155",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 26,
    "volume_number": 1,
    "text": "5 - Abdullah bin Umar. 6 - Anas bin Malik. 7 - Abu Hurairah. 8 - Al-Nawas bin Sam'an. 9 - Nufayr bin Malik. 10 - Aisha. 11 - Umm Salama. 12 - Some Companions of the Prophet, peace and blessings be upon him. 13 - Ubadah bin Al-Samit. 14 - Abdullah bin Abbas. 15 - Abu Bakra Al-Thaqafi. 16 - A man from the Companions of the Prophet, peace and blessings be upon him. 17 - Safinah, the freed slave of the Messenger of Allah, peace and blessings be upon him. 18 - Abu Sa'id Al-Khudri. 19 - Fatimah bint Qais. 20 - Umm Sharik.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 28
  },
  {
    "serial_number": "104156",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 27,
    "volume_number": 1,
    "text": "21 - Abdullah bin Mas'ud. 22 - Abdullah bin Amr. There are other Companions from whom hadiths about Dajjal were narrated with chains that are acceptable as corroboration; they are: 23 - Abu Umamah. 24 - Sa'd bin Abi Waqqas. 25 - Abdullah bin Mughnam. 26 - Asma bint Yazid Al-Ansariyyah. 27 - Mahjan bin Al-Adra'. 28 - Uthman bin Abi Al-Aas. 29 - Samurah bin Jundub. 30 - Mujammi' bin Jariyah. 31 - Asma bint Umais. Then here are the names of the Companions who narrated the hadith of the descent of Jesus peace be upon him: 1 - Abdullah bin Mughaffal. 2 - Abu Hurairah. 3 - Al-Nawas bin Sam'an.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 29
  },
  {
    "serial_number": "104157",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 28,
    "volume_number": 1,
    "text": "4 - Nufayr bin Malik. 5 - Aisha. 6 - Jabir bin Abdullah. 7 - Abu Hurairah. 8 - Hudhayfah bin Asid. 9 - Abdullah bin Amr. And these are the names of other Companions from whom hadiths of the descent of Jesus peace be upon him were narrated with chains acceptable as corroboration: 10 - Abu Umamah Al-Bahili. 11 - Some Companions of Muhammad, peace and blessings be upon him. 12 - Samurah. 13 - Hudhayfah bin Al-Yaman. 14 - Mujammi' bin Jariyah Al-Ansari. This quick display of the paths of the Dajjal hadith, and the hadith of Jesus peace and blessings be upon him, and their narrators from the noble truthful Companions; makes it clear to anyone with two eyes that the Hadith is Mutawatir (mass-transmitted) regarding that, and that anyone who doubts that is among the skeptics in the religion entirely, or is - at least - exposed to that most severely; because whatever was",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 30
  },
  {
    "serial_number": "104158",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 29,
    "volume_number": 1,
    "text": "Mutawatir - like the Quran and some Hadiths - is exposed with him to denial by way of interpretation; indeed nullification. And whatever of it did not reach the level of Tawatur; is exposed with him to rejection by way of doubting the certainty of its attribution to the Prophet, peace and blessings be upon him. From here it appears that all believers in the Islamic religion; they are in danger regarding their faith if they do not rely on the methodology of the People of Hadith (Ahl al-Hadith) in their receiving of the religion; for they are the most knowledgeable of people regarding what is established of it, and what is not of it in narration, and the most knowledgeable of people regarding its meanings and intents; because they received all that from the Messenger of Allah, peace and blessings be upon him, through the correct scientific methods without which there is no way to know the religion, and without which religion becomes followed desire. This is the chronic disease that has afflicted the Islamic world today, and no one is saved from it except the Victorious Group (At-Ta'ifah Al-Mansurah) which the Messenger of Allah, peace and blessings be upon him, gave glad tidings of in many Mutawatir hadiths; among them his saying peace and blessings be upon him: 'A group of my Ummah will continue fighting upon the truth, victorious over those who oppose them; until the last of them fights the Antichrist (Dajjal)' (1). I say: Perhaps what we mentioned of the way of the skeptics is the reason for Umar's strictness against those who deny the Dajjal - and other things established in the authentic Sunnah - for Yusuf bin Mahran narrated from Ibn Abbas who said: I heard Umar bin Al-Khattab, may Allah be pleased with him, on the pulpit saying:",
    "foot_note": "1. Extracted it in 'Al-Sahihah' number (1959)",
    "book_id": "692",
    "new_page_number": 31
  },
  {
    "serial_number": "104159",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 30,
    "volume_number": 1,
    "text": "'There will be among you people from this nation who deny stoning, deny the Dajjal, deny the rising of the sun from its west, deny the punishment of the grave, deny intercession, and deny a people coming out of the Fire after they have been scorched. If I catch them, I will surely kill them the killing of 'Ad and Thamud.' Extracted by Al-Dani in 'Al-Fitan' (Folio 23/2), and Ahmad (1/23) briefly, and its chain is Hasan. The Second Matter - which encouraged me to write this treatise -: That people in general - commoners and elite; except whom Allah wills - no longer talk about the emergence of Dajjal and the descent of Jesus, peace and blessings be upon them; confirming what is in 'Zawa'id Musnad Ahmad' (4/72) from Rashid bin Sa'd who said: When Istakhr was conquered, a caller called out: 'The Dajjal has emerged.' He said: So Sa'b bin Jaththamah met them. He said: He said: Were it not for what you say, I would have informed you that I heard the Messenger of Allah, peace and blessings be upon him, say: 'The Dajjal will not emerge until people become oblivious to mentioning him, and until the Imams abandon mentioning him on the pulpits' (1).",
    "foot_note": "1. Al-Haythami said in 'Majma' Al-Zawa'id' (7/335): 'Abdullah bin Ahmad narrated it from the narration of Baqiyyah from Safwan bin Amr, and it is authentic as Ibn Ma'in said, and the rest of its men are trustworthy.' And he attributed it in another place (7/351) to Ahmad himself, which is a mistake!",
    "book_id": "692",
    "new_page_number": 32
  },
  {
    "serial_number": "104160",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 31,
    "volume_number": 1,
    "text": "This report has indeed come true regarding the Imams of the mosques, for they abandoned mentioning the Dajjal on the pulpits while they are the elite of the people; so what would be the condition of their commoners?! And if Allah, the Blessed and Exalted, has made a cause for everything by His wisdom; I do not doubt that the cause of this neglect of mentioning him - despite the Prophet's (peace and blessings be upon him) extreme concern in warning against his trial; as you will see in the beginning of his story - is but the skepticism of some of the elite regarding the hadiths reported about him; sometimes in their establishment and lack of arrival via Tawatur - they claimed - and sometimes in their indication as previously explained. Thus, it was obligatory for the people of knowledge to perform their duty; to clarify to the nation what the Messenger of Allah, peace and blessings be upon him, told them about the trial of the Dajjal and Jesus peace and blessings be upon him killing him; by the same method through which the nation receives from the Prophet, peace and blessings be upon him, everything related to its religion - from beliefs, worships, transactions, ethics, and others, which is the Prophetic Hadith - thereby eliminating the indicated cause, and people return to mentioning the Dajjal and his trial, taking measures to avoid it, so they are not deceived by his misguidance and distortions, the possibility of which occurring from someone like him is only believed by the believer - who does not doubt in the slightest regarding what came of various trials, {And your Lord creates what He wills and chooses; not for them was the choice. Exalted is Allah and high above what they associate with Him} [Al-Qasas: 68]. So if the believer knows that and believes in it; he takes the measures that protect him from his trial; which are:",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 33
  },
  {
    "serial_number": "104161",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 32,
    "volume_number": 1,
    "text": "First: Seeking refuge in Allah Almighty from the evil of his trial, and doing so frequently; especially in the last Tashahhud in prayer. The Messenger of Allah, peace and blessings be upon him, said: 'When one of you finishes the last Tashahhud; let him seek refuge in Allah from four, saying: O Allah! I seek refuge in You from the punishment of Hell, from the punishment of the grave, from the trial of life and death, and from the evil of the trial of the Messiah Dajjal' (1). It is established in the 'Two Sahihs' and others from a group of Companions - among them Aisha may Allah be pleased with her: that the Prophet, peace and blessings be upon him, used to seek refuge from his trial. Indeed, he ordered seeking refuge from it as a general command; as in the hadith of Zaid bin Thabit who said: While the Prophet, peace and blessings be upon him, was in a garden of Banu An-Najjar on a mule of his - and we were with him - it shied with him and almost threw him off. Suddenly there were six or five or four graves. He said 'Who knows the occupants of these graves?' A man said: I do. He said: 'When did these die?' He said: They died in Polytheism (and in a narration: in Jahiliyyah). He said: 'Indeed this nation is tested in its graves. Were it not that you would not bury [your dead], I would have invoked Allah to make you hear the punishment of the grave which I hear.' Then he turned his face towards us and said:",
    "foot_note": "1. See 'Sifat al-Salah' (p. 199 - 7th Edition).",
    "book_id": "692",
    "new_page_number": 34
  },
  {
    "serial_number": "104162",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 33,
    "volume_number": 1,
    "text": "'Seek refuge in Allah from the punishment of the Fire.' They said: We seek refuge in Allah from the punishment of the Fire. He said: 'Seek refuge in Allah from the punishment of the grave.' They said: We seek refuge in Allah from the punishment of the grave. He said: 'Seek refuge in Allah from trials, what is apparent of them and what is hidden.' They said: We seek refuge in Allah from trials, what is apparent of them and what is hidden. He said: 'Seek refuge in Allah from the trial of the Dajjal.' They said: We seek refuge in Allah from the trial of the Dajjal. (1). Second: To memorize ten verses from the beginning of Surah (Al-Kahf). For he, peace and blessings be upon him, said: 'Whoever memorizes ten verses from the beginning of Surah (Al-Kahf); will be protected from the [trial of] Dajjal.' Narrated by Muslim and others from Abu Darda (2). Third: To stay away from him, and not expose oneself to him; unless he knows of himself that he will not harm him due to his trust in his Lord, and his knowledge of his signs which the Prophet - peace and blessings be upon him - described him with; due to his saying, peace and blessings be upon him: 'Whoever hears of the Dajjal, let him go far from him. For by Allah; a man will come to him reckoning that he is a believer, then he will follow him: due to what he sends of doubts.' Extracted by Ahmad and others, from Imran bin Husain (3).",
    "foot_note": "1. Extracted by Muslim (8/161), and Ahmad (5/190) \n2. Narrated by Muslim and others, and in a narration of his 'end of Al-Kahf' which is anomalous (Shadh); as I verified in 'Al-Sahihah' number (2651). The first narration is witnessed by the hadith of Al-Nawas coming in Paragraph (5) - Extraction of the story's paragraphs, and the hadith of Abu Umamah in Paragraph (14) \n3. It is extracted in 'Al-Mishkat' (5488), and Hanbal also narrated it in 'Al-Fitan' (Folio 46/2).",
    "book_id": "692",
    "new_page_number": 35
  },
  {
    "serial_number": "104163",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 34,
    "volume_number": 1,
    "text": "Fourth: To reside in Mecca and Medina, for they are two sanctuaries safe from him; due to his saying, peace and blessings be upon him: 'The Dajjal comes and treads the earth except Mecca and Medina. He comes to Medina; and finds at every pass of its passes rows of angels.' Extracted by the Two Sheikhs and others from Anas bin Malik, may Allah be pleased with him (1). Like them are Al-Aqsa Mosque and Al-Tur (Mount Sinai); as comes in Paragraph (24 - Context). Know that Allah only made these holy lands a protection from Dajjal for the one who inhabits them while being a believer adhering to the rights and duties owed to their Lord. Otherwise, mere residence - while being far in his life from adopting the manners of a believer therein - is not what makes him protected from him. For it will come in Paragraph (25 - Abu Umamah, 30 - Context) that the Dajjal - upon him be Allah's curses - when he comes to the Prophetic City and the angels prevent him from entering it; it will shake with its people three times, and no hypocrite man or woman will remain therein except they go out to him. These hypocrite men and women - and their hypocrisy might be practical - their residence in the Prophetic City did not protect them from the Dajjal; rather they went out to him, and became of his followers like the Jews! Conversely; those who are in it among the sincere believers in their faith; although they are protected from his trial; some of them may go out to him challenging",
    "foot_note": "1. It is extracted in 'Al-Sahihah' (2457).",
    "book_id": "692",
    "new_page_number": 36
  },
  {
    "serial_number": "104164",
    "category_id": "1",
    "category_en": "Creed / Islamic Belief",
    "category_ar": "العقيدة",
    "book_title_en": "The Story of the False Messiah (al-Masīḥ al-Dajjāl) and the Descent of Jesus, Peace Be Upon Him",
    "book_title_ar": "قصة المسيح الدجال ونزول عيسى عليه الصلاة والسلام",
    "edition": "الأولى 1421هـ",
    "publisher": "المكتبة الإسلامية - عمان - الأردن",
    "page_number": 35,
    "volume_number": 1,
    "text_en": "And it will be proclaimed to his face: “This is the Dajjāl about whom the Messenger of Allah ﷺ used to tell us…” as will come later in paragraph (31 – the context). Therefore, the true criterion is faith and righteous action; that is the greatest cause of salvation. As for living in the land of Hijrah or elsewhere, that is only a secondary cause. Whoever does not take hold of the greater cause will not benefit from clinging to the lesser cause. The Prophet ﷺ indicated this when the man asked him about migration. He said: “Woe to you! Indeed, the matter of Hijrah is severe! Do you have camels?” He replied, “Yes.” He said, “Do you give their charity?” He replied, “Yes.” The Prophet ﷺ said: “Then work from beyond the seas, for Allah will not neglect anything of your deeds.” — How excellent is what Imām Mālik narrated in al-Muwaṭṭa’ (2/235) from Yaḥyā ibn Sa‘īd: that Abū al-Dardā’ wrote to Salmān al-Fārisī saying: “Come to the Sacred Land (meaning al-Shām).” But Salmān wrote back: “The land does not sanctify anyone; it is only a person’s deeds that sanctify him.” And Allah, the Exalted, speaks the truth when He says: “And say, ‘Do [as you will], for Allah will see your deeds, and His Messenger, and the believers. And you will be returned to the Knower of the unseen and the witnessed, and He will inform you of what you used to do.’” [al-Tawbah: 105].",
    "text_ar": "وينادى فى وجهه: هذا هو الدجَّال الذى كان رسول الله صلى الله عليه وسلم يحدثنا حديثه … كما سيأتى فى الفقرة (31 - السياق). فالعبرة إذن بالإيمان والعمل الصالح، فذلك هو السبب الأكبر فى النجاة، وأما السكن فى دار الهجرة وغيرها؛ فهو سبب ثانوى، فمن لم يأخد بالسبب الأكبر؛ لم يفده تمسكه بالسبب الأصغر، وقد أشار إلى هذا النبى صلى الله عليه وسلم بقوله للذى سأله عن الهجرة: «ويحك! إن شان الهجرة لشديد! فهل لك من إبل؟». قال: «فهل تؤتى صدقتها؟» قال: نعم. قال: «فاعمل من وراء البحار، فإن الله لن يترك من عملك شيئاً» (1) . وما أحسن ما روى الإمام مالك فى «الموطأ» (2/ 235) عن يحيى بن سعيد: «أن أبا الدرداء كتب إلى سلمان الفارسى: أن هلمَّ إلى الأرض المقدسة. (يعنى: الشام). فكتب إليه سلمان: إن الأرض لا تقدس أحداً، وإنما يقدسُ الإنسانَ عملُهُ». وصدق الله العظيم إذ يقول: {وَقُلِ اعْمَلُوا فَسَيَرَى اللَّهُ عَمَلَكُمْ وَرَسُولُهُ وَالْمُؤْمِنُونَ وَسَتُرَدُّونَ إِلَى عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ} [التوبة: 105].",
    "foot_note": "1. أخرجه البخارى (7/207 - فتح)، ومسلم (6/28)، وأبو داود (1/388)، والنسائي (2/182)، وأحمد (3/64).",
    "book_id": "692",
    "text": "",
    "new_page_number": 37,
    "category": "Creed"
  },
  {
    "serial_number": "104165",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 36,
    "volume_number": 1,
    "text": "For this reason; it is not permissible for Muslims today to abandon working for Islam and establishing its state on earth; waiting for the emergence of the Mahdi and the descent of Jesus, peace and blessings be upon them; out of despair on their part; or imagining that this is not possible before them. For this is a false imagination, and a vain despair. Allah Almighty or His Messenger, peace and blessings be upon him, did not inform us that there is no return for Islam nor authority for it on earth except in their time. So it is possible for this to be realized before them if Muslims take the necessary means for it; due to His saying, the Exalted: {If you support Allah, He will support you and plant firmly your feet} [Muhammad: 7], and His saying: {And Allah will surely support those who support Him. Indeed, Allah is Powerful and Exalted in Might} [Al-Hajj: 40]. This misconception was one of the strongest reasons that prompted some guiding professors and contemporary writers to deny the hadiths of the Mahdi and Jesus, peace and blessings be upon them - despite their abundance and mass transmission (Tawatur) - when they saw that for those who held this misconception, they were a cause for relying on them and abandoning work for the glory of Islam for their sake! They erred in this a severe error from two aspects: First: They confirmed them in this misconception; considering that its source was those referenced hadiths; otherwise they would not have hastened to deny them! Second: They did not know how they should address the mentioned misconception? Which is by affirming the hadiths, and invalidating the erroneous concepts surrounding them. Their likeness in this is but like the one who denied the doctrine of belief in Decree (Qadar), its good and its evil; because some believers in it understood from it that its necessary implication is compulsion (Jabr), and that the accountable person has no acquisition nor choice. Since this understanding was obviously false, they hastened to deny it, but they denied the Decree itself with it;",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 38
  },
  {
    "serial_number": "104166",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 37,
    "volume_number": 1,
    "text": "due to their imagining - also with those who imagined - that it means compulsion. So they agreed with them in their error regarding the mentioned misconception, then added another error to it - fleeing from the first - which is denying the Decree itself! Had they not shared with them in understanding compulsion from it, they would not have denied it! This is exactly what those referenced professors and writers did; when they saw the reliance of Muslims - except a few of them - on the hadiths of the Mahdi and Jesus; they hastened to deny them to save them, they claimed, from the mentioned reliance! They achieved nothing; because they could not save them by that on one hand; nor were they guided in their denial of authentic hadiths on the other. The truth is that these deniers - who understand from these hadiths what they do not indicate of the alleged reliance, and therefore hasten to deny them to get rid of it - have combined two calamities: misguidance in understanding, and disbelief in the text! But they knew that the mentioned understanding is misguidance in itself, so they denied it by denying the text from which they understood that! The common people did the opposite; they believed in the text along with the mentioned understanding. So with each of the two groups is guidance and misguidance. The truth is taking the guidance of each, and discarding the misguidance they have; which is by believing in the text without that erroneous understanding. The likeness of these and those is but like the Mu'tazila on one hand; and the Anthropomorphists (Mushabbihah) on the other. For the former interpreted the verses and hadiths of Attributes with false interpretations that led them to denying the Divine Attributes. Nothing drove them to that except their fleeing from the anthropomorphism (Tashbih) into which the Anthropomorphists fell. Indeed, the Mu'tazila themselves shared with the Anthropomorphists in understanding anthropomorphism",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 39
  },
  {
    "serial_number": "104167",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 38,
    "volume_number": 1,
    "text": "from the verses of Attributes, but they differed from them by denying anthropomorphism through the method of interpretation which is also false; like anthropomorphism because it necessitates denying the Divine Attributes. As for the Anthropomorphists, they did not fall into this falsehood, but they persisted on anthropomorphism. The truth is combining the correctness of these and those, and rejecting the falsehood of these and those: That is by affirmation and transcendence (Tanzih), as Allah the Exalted said: {There is nothing like unto Him, and He is the Hearing, the Seeing} [Al-Shura: 11]. Likewise, I say regarding the hadiths of the descent of Jesus peace be upon him and others; the obligation regarding them is believing in them, and rejecting what the misconceivers imagined from them; of abandoning work and preparation which must be performed in every time and place. By that we would have combined the correctness of these and those, and rejected the falsehood of these and those. And Allah is the One sought for help.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 40
  },
  {
    "serial_number": "104168",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 39,
    "volume_number": 1,
    "text": "Section Two: Containing the text of the hadith of Abu Umamah divided into paragraphs reaching (49) paragraphs, then its referencing (Takhrij). Then the detailed referencing of its paragraphs one by one. And after that the names of the Companions and Successors whose hadiths of the paragraphs I extracted.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 41
  },
  {
    "serial_number": "104169",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 41,
    "volume_number": 1,
    "text": "The Hadith of Abu Umamah, may Allah be pleased with him, with its referencing: (1 - O People! There has never been a tribulation on the face of the earth since Allah created the progeny of Adam greater than the tribulation of the Dajjal. 2 - And indeed, Allah, Mighty and Majestic, has not sent a prophet except that he warned his nation of the Dajjal. 3 - And I am the last of the Prophets, and you are the last of the nations. 4 - And he is emerging among you inevitably. 5 - If he emerges while I am among you, then I am the advocate for every Muslim; and if he emerges after me, then every person is his own advocate, and Allah is my successor over every Muslim. 6 - And he emerges from a road between Sham (Syria) and Iraq. He spreads corruption to the right and left. O servants of Allah, stand firm. 7 - I will describe him to you with a description that no prophet before me has described him with: 8 - He starts by saying: 'I am a prophet,' but there is no prophet after me. 9 - Then he praises again and says: 'I am your Lord.' But you will not see your Lord until you die. 10 - And he is one-eyed, and your Lord is not one-eyed. 11 - And written between his eyes is: Kafir (Disbeliever). 12 - Every believer, literate or illiterate, will read it.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 42
  },
  {
    "serial_number": "104170",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 42,
    "volume_number": 1,
    "text": "13 - And part of his trial is that he has with him a paradise and a fire. His fire is paradise and his paradise is fire. 14 - So whoever is tested with his fire, let him seek help from Allah and read the opening verses of (Al-Kahf). 15 - So it will become cool and safe for him as the fire was for Abraham. 16 - And part of his trial is that he says to a Bedouin: 'Do you see, if I resurrected your father and mother for you, would you testify that I am your Lord?' He says: 'Yes.' So two devils impersonate his father and mother for him and say: 'O my son, follow him for he is your Lord.' 17 - And part of his trial is that he overpowers a single soul and kills him. 18 - And saws him with a saw until he is thrown as two halves. Then he says: 'Look at this servant of mine, for I will resurrect him now, then he will claim he has a Lord other than me.' So Allah resurrects him, and the malicious one says to him: 'Who is your Lord?' He says: 'My Lord is Allah, and you are the enemy of Allah, you are the Dajjal. By Allah, I was never more insightful about you than I am today.' 19 - And part of his trial is that he commands the sky to rain and it rains, and commands the earth to grow vegetation. 20 - And part of his trial is that he passes by a clan but they reject him, so no livestock remains for them except that it perishes. 21 - And part of his trial is that he passes by a clan and they believe him. So he commands the sky to rain and it rains, and the earth to grow vegetation and it grows, until their cattle return from that day of theirs fatter than they ever were, their flanks wider and their udders fuller.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 43
  },
  {
    "serial_number": "104171",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 43,
    "volume_number": 1,
    "text": "22 - And there remains nothing of the earth but he treads upon it and prevails over it except Mecca and Medina. 23 - He does not come to them from any of their passes except that angels meet him with unsheathed swords. 24 - Until he camps at the red hillock at the end of the marsh. 25 - Then Medina shakes with its inhabitants three times, and no hypocrite man or woman remains except they go out to him. 26 - It expels the impurity from it just as the bellows expels the impurity of iron. 27 - That day is called the Day of Deliverance. 28 - Umm Sharik bint Abi Al-Akar said: 'O Messenger of Allah, where are the Arabs on that day?' He said: 'They are few on that day.' 29 - And most of them are in Bayt al-Maqdis (Jerusalem). 30 - Their Imam is a righteous man. 31 - While their Imam has stepped forward to lead them in the Morning Prayer, Jesus the son of Mary descends upon them at dawn. That Imam retreats, walking backwards, so that Jesus may come forward. Jesus places his hand between his shoulders and says to him: 'Go forward and pray, for it was established for you.' So their Imam leads them in prayer.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 44
  },
  {
    "serial_number": "104172",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 44,
    "volume_number": 1,
    "text": "32 - When he finishes, Jesus says: 'Open the door.' It is opened, and behind it is the Dajjal. 33 - With him are seventy thousand Jews, all of them with adorned swords and sashes. 34 - When the Dajjal sees him, he dissolves just as salt dissolves in water. 35 - He runs away fleeing, and Jesus peace be upon him says: 'I have a blow for you that you will not escape.' 36 - He catches him at the Eastern Gate of Ludd and kills him. 37 - Allah defeats the Jews. So nothing of what Allah created remains for a Jew to hide behind except that Allah makes that thing speak - neither stone, nor tree, nor wall, nor animal - except the Gharqad tree, for it is from their trees and does not speak - except it says: 'O Muslim servant of Allah, this is a Jew, come and kill him.' 38 - His days are forty years. 39 - A year like half a year, a year like a month, and a month like a week. 40 - And the last of his days is like a spark. 41 - One of you will be at the gate of Medina and will not reach its other gate until evening comes. 42 - It was said to him: 'How do we pray in those short days?' He said: 'Estimate prayer in them as you estimate it in these long days, then pray.'",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 45
  },
  {
    "serial_number": "104173",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 45,
    "volume_number": 1,
    "text": "43 - Jesus the son of Mary, peace be upon him, will be in my Ummah as a just judge and a fair Imam. He will break the cross, kill the swine, abolish the Jizyah, and leave charity (Sadaqah), so no one will strive [to collect Zakat] on sheep or camel. Hatred and mutual animosity will be lifted. The venom of every venomous creature will be removed until a child puts his hand in a snake's mouth and it does not harm him. 44 - A young girl chases a lion and it does not harm her. The wolf is among the sheep as if it were their dog. 45 - The earth is filled with peace as a vessel is filled with water. The word becomes one, and none is worshipped but Allah. War lays down its burdens, and Quraysh is stripped of its kingdom. The earth will be like a silver platter, growing its vegetation as in the time of Adam, until a group of people gather around a bunch of grapes and it satisfies them, and a group gathers around a pomegranate and it satisfies them. The bull will be for such and such amount of money, and the horse for a few dirhams. 46 - They said: 'O Messenger of Allah, why will the horse become cheap?' He said: 'It will never be ridden for war.' 47 - It was said: 'Why will the bull become expensive?' He said: 'The whole earth will be tilled.' 48 - Before the emergence of the Dajjal, there are three severe years in which people suffer severe hunger. Allah commands the sky in the first year to withhold one-third of its rain, and commands the earth to withhold one-third of its vegetation. Then He commands the sky in the second year to withhold two-thirds of its rain, and commands the earth to withhold two-thirds of its vegetation. Then Allah commands",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 46
  },
  {
    "serial_number": "104174",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 46,
    "volume_number": 1,
    "text": "the sky in the third year to withhold all its rain, so not a drop falls, and commands the earth to withhold all its vegetation, so no green thing grows. No hoofed animal remains except that it perishes, except what Allah wills. 49 - It was said: 'What will people live on in that time?' He said: 'Tahlil (saying La ilaha illa Allah), Takbir (saying Allahu Akbar), Tasbih (saying Subhan Allah), and Tahmid (saying Alhamdulillah). That will take the place of food for them.')",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 47
  },
  {
    "serial_number": "104175",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 47,
    "volume_number": 1,
    "text": "Referencing (Takhrij) of the Hadith: It was narrated with this completeness by Ibn Majah (2/512-516) and Al-Ruyani in summary (Folio 30/8/0 and 10/1) via Ismail bin Rafi' from Abu Zur'ah Al-Saybani Yahya ibn Abi Amr [from Amr bin Abdullah Al-Hadrami] from Abu Umamah Al-Bahili who said: The Messenger of Allah, peace and blessings be upon him, addressed us, and most of his speech was a hadith he told us about the Dajjal and warning us of him. Part of his speech was that he said: ... then he mentioned it at length. I say: This is a weak chain. Amr bin Abdullah Al-Hadrami was not narrated from except by Al-Saybani, and no one declared him trustworthy except Ibn Hibban (1/185), and for that reason Al-Hafiz said: (Maqbul - Acceptable [if supported]). And Ismail bin Rafi' is weak in memory. However, he was followed up by Damrah bin Rabi'ah: Al-Saybani told us with it, except for his saying: (They said: O Messenger of Allah, why will the horse become cheap...) to the end of the hadith. It was narrated by Hanbal bin Ishaq Al-Shaybani - the cousin of Imam Ahmad - in (Al-Fitan) (Folio 52/1 - 53/2) and its completion in (Al-Fawa'id) (3/37/1 - 38/1), and Al-Ajurri in (Al-Shari'ah) (p. 375) - but he did not cite its wording, rather he referred by it to the hadith of An-Nawas coming later - and Ibn Abi Asim in (Al-Sunnah) (Number 391 - my verification), and Abdullah bin Ahmad in (Al-Sunnah) (p. 138-13), and Abu Dawood (2/213).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 48
  },
  {
    "serial_number": "104176",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 48,
    "volume_number": 1,
    "text": "And Al-Tabarani in (Al-Mu'jam Al-Kabir) (8/7645 and 25/295/48) and Ibn Asakir in (Al-Tarikh) (1/611-614/printed). I say: And Damrah bin Rabi'ah, Al-Hafiz said: (Truthful, errs a little). He was also followed up by Ata' Al-Khurasani from Yahya with it, except for his saying: (Then pray. Jesus the son of Mary will be in my Ummah as a judge...) to the end of the hadith. It was narrated by Al-Hakim (4/536-537) and he said: (Authentic according to the conditions of Muslim) and Al-Dhahabi agreed with him. I say: This is one of their illusions, for Muslim did not extract anything for Amr Al-Hadrami. And Ata' - who is Ibn Abi Muslim Al-Khurasani - even if Muslim extracted for him, he errs often and practices Tadlis (concealing defects in the chain), and he narrated it with 'an'ana [saying 'from'], so how can its chain be authentic?",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 49
  },
  {
    "serial_number": "104177",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 49,
    "volume_number": 1,
    "text": "Section Three: Referencing the paragraphs of the story. However, the hadith is mostly authentic, having come dispersed in [other] hadiths, except a little of it for which I did not find a witness or strengthener, as will be clarified. To facilitate clarifying that for the reader and referencing it myself, I made it into paragraphs with sequential numbers, so I say: 1 - This paragraph came in hadiths: First: From Hisham bin Amir attributed to the Prophet (Marfu') with the wording: (Between the creation of Adam and the establishment of the Hour, there is no creation greater than the Dajjal (and in a narration: no trial greater than the trial of the Dajjal). Narrated by Muslim (8/207), Al-Hakim (4/528), and Ahmad (4/20 and 21). The other narration is one of his two narrations, which is Al-Hakim's narration, and he added: (in the sight of Allah). And he said: (Authentic according to the condition of Al-Bukhari but they did not extract it). So he said, and perhaps he means with his indicated wording, otherwise Muslim has extracted it as I mentioned. Al-Dani also narrated it (176/2 - 177/1) and added: (He ate food and walked in the markets).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 50
  },
  {
    "serial_number": "104178",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 50,
    "volume_number": 1,
    "text": "Second: From Abdullah bin Mughaffal who said: The Messenger of Allah, peace and blessings be upon him, said: (Allah the Exalted has not sent down to earth - since He created Adam until the Hour is established - a trial greater than the trial of the Dajjal. And I have said regarding him a saying no one before me has said: He is dark, curly-haired, with his left eye wiped out, having a thick film on his eye. He cures the blind and the leper and says: 'I am your Lord.' So whoever says: 'My Lord is Allah,' there is no trial upon him. And whoever says: 'You are my lord,' has fallen into trial. He remains among you as long as Allah wills, then Jesus the son of Mary descends, confirming Muhammad, peace and blessings be upon him, on his religion, a guided Imam and a just judge, so he kills the Dajjal). Al-Hasan used to say: And we see that near the Hour. Narrated by Al-Tabarani in (Al-Kabir) and (Al-Awsat), and its narrators are trustworthy, and regarding some of them there is disagreement that does not harm, as stated in (Majma' Al-Zawa'id) (7/336). The sentence about the eye has a witness from the hadith of Anas with the wording: (The Dajjal is one-eyed in the left eye, having a thick film on it, written between his eyes: Kafir). Narrated by Ahmad (3/115 and 201) with an authentic chain. Third: From Hudhayfah who said: The Dajjal was mentioned in the presence of the Messenger of Allah, peace and blessings be upon him, so he said: (I am more fearful for you of the trial of some of you than of the trial of the Dajjal. And no one will be saved from what is",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 51
  },
  {
    "serial_number": "104179",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 51,
    "volume_number": 1,
    "text": "before it except that he was saved from it. And no tribulation has been made since the world existed - small or large - except for the tribulation of the Dajjal). Narrated by Ahmad (5/389) and Ibn Hibban (1897) (1). I say: Its chain of narration is authentic (Sahih) and its narrators are trustworthy, the narrators of the two Sheikhs (Bukhari and Muslim). Al-Haythami said (7/335): (Narrated by Ahmad and Al-Bazzar, and its narrators are the narrators of the Sahih). Fourth: From Jabir bin Abdullah, and his hadith will come (pp. 89-90). 2 - This paragraph is witnessed by hadiths: First: From Abdullah bin Umar (may Allah be pleased with them both) who said: The Messenger of Allah (peace be upon him) stood among the people, praised Allah with what He is worthy of, then mentioned the Dajjal and said: (I warn you against him, and there is no prophet except that he warned his people [Noah warned his people], but I will tell you a saying about him that no prophet said to his people: [Know] that he is one-eyed and that Allah is not one-eyed). Narrated by Abd al-Razzaq in (Al-Musannaf) (11/390 / 20820) and from him Ahmad (2/149)",
    "foot_note": "1. And its wording is: (There is no tribulation, small or large, except that it diminishes before the tribulation of the Dajjal) and he added: (Written between his eyes: Kafir). Muslim added (8/195) and Ahmad (5/386): (Every believer, literate or illiterate, will read it). This addition is in Hanbal (51/1) from another route from him.",
    "book_id": "692",
    "new_page_number": 52
  },
  {
    "serial_number": "104180",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 52,
    "volume_number": 1,
    "text": "and Al-Bukhari (13/80-81 Fath) and the context is his, and Muslim (8/193) and the two additions are his, as well as Al-Tirmidhi (2236), Abu Dawud (4757), Ibn Mandah in (Al-Iman) (96/2) via the route of Salim bin Abdullah from him, and Al-Khatib in (Al-Tarikh) (7/183-184). In a narration by Ahmad (2/135) and Ibn Mandah (97/1) via the route of Muhammad bin Zaid Abu Umar bin Muhammad, he said: Abdullah said: ... and he mentioned similar to it with the wording: (Allah has not sent any prophet except that he warned his nation about him. Noah (peace be upon him) warned his nation, and the prophets (peace be upon them) after him. If his matter is hidden from you, it should not be hidden from you that your Lord is not one-eyed. If his matter is hidden from you, it should not be hidden from you that your Lord is not one-eyed). I say: Its chain of narration is authentic according to the condition of the two Sheikhs. Ibn Hibban (1896) and Ibn Mandah in (Al-Tawhid) (82/2) narrated it via a third route from him similarly, and added: (And that between his eyes is written: Kafir; every believer, literate and illiterate, will read it), and its chain is authentic. Al-Bukhari (3440) and Muslim (1/107) narrated via the route of Nafi' from Ibn Umar in a long hadith, in which is: (The Messiah Al-Dajjal is blind in the right eye, as if his eye is a floating grape). It is referenced in (Al-Sahihah) (1857).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 53
  },
  {
    "serial_number": "104181",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 53,
    "volume_number": 1,
    "text": "Second: From Anas bin Malik (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: (No prophet was sent except that he warned his nation about the one-eyed liar. Lo! He is indeed one-eyed, and your Lord is not one-eyed. Written between his eyes: K-F-R [every Muslim will read it]). Narrated by Al-Bukhari (13/85), Muslim (8/195), Abu Dawud (2/213), Al-Tirmidhi (2246) who authenticated it, Ahmad (3/103, 173, 276, 290), Hanbal (f 51/2), Ibn Khuzaimah in (Al-Tawhid) (p. 32), and Ibn Mandah (97/1). The addition belongs to Muslim, Ahmad, and others. Regarding this topic, there is also [a narration] from Abu Sa'id Al-Khudri in (Al-Majma') (7/336-337) and Asma bint Yazid Al-Ansariyyah, which will come God willing (pp. 75-77), and from Aisha coming shortly (p. 59), and from Umm Salama as well (p. 60). 2 - This paragraph came dispersed in two or more hadiths: First: From Abu Huraira (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: (I say: And he mentioned the hadith of the virtue of praying in his mosque, peace be upon him) (For I am the last of the Prophets and my mosque is the last of the mosques). Narrated by Muslim (4/135). Its supporting evidences are very numerous, such as the famous hadith regarding Ali: (You are to me in the position that Aaron was to Moses, except that there is no prophet after me). Narrated by Ahmad, the two Sheikhs, and others from various routes, and there is no room to mention them now.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 54
  },
  {
    "serial_number": "104182",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 54,
    "volume_number": 1,
    "text": "Second: From Ibn Abbas: That the Prophet (peace be upon him) said: (We are the last of the nations and the first to be held accountable. It will be said: Where is the unlettered nation? So we are the last ones and the first ones). Narrated by Ibn Majah (2/575). I say: Its chain is authentic as Al-Busiri said in his (Zawa'id) (265/1). Third: From Mu'awiyah bin Haydah who said: I heard the Messenger of Allah (peace be upon him) saying: (You have completed seventy nations; you are the last of them and the most noble of them to Allah, Mighty and Majestic). Narrated by Al-Darimi (2/313) and Ahmad (5/3 and 5). I say: Its chain is good (Hasan) and it is in (Al-Mishkat) (6294) with a similar wording. 4 - I did not find a witness for this paragraph with its exact wording. The closest thing I saw is the hadith of Abu Huraira who said: I heard Abul-Qasim, the Truthful and Trusted one, saying: (The one-eyed Dajjal, the messiah of misguidance, will emerge from the East in a time of disagreement among people and division. He will reach whatever Allah wills him to reach of the earth in forty days - Allah knows best its duration. The believers will encounter severe hardship. Then Jesus son of Mary (peace be upon him) will descend from the sky and lead the people (1). When he raises his head from his bowing, he says: Allah hears those who praise Him. Allah will kill the Messiah Al-Dajjal and the Muslims will prevail).",
    "foot_note": "1. Meaning: In Bayt al-Maqdis (Jerusalem). As for in Damascus upon his first descent, he will be led by Al-Mahdi, peace be upon them both.",
    "book_id": "692",
    "new_page_number": 55
  },
  {
    "serial_number": "104183",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 55,
    "volume_number": 1,
    "text": "So I swear that the Messenger of Allah (peace be upon him), Abul-Qasim, the Truthful and Trusted one, said: (It is indeed true, and as for it being near, then everything that is coming is near). Al-Haythami said (7/349): (Narrated by Al-Bazzar and its narrators are the narrators of the (Sahih) except for Ali bin Al-Mundhir, and he is trustworthy). Al-Hafiz said (13/85): (Its chain is good) (1). The hadiths explicitly stating his emergence are many, some of which will come God willing, but they do not contain emphatic words like his saying: (inevitably) or: (It is indeed true). Rather, all the hadiths of the Dajjal confirm his emergence, and his hadith (peace be upon him) is all truth and honesty, whether coupled with an emphatic form or not. {Nor does he speak from [his own] inclination. It is not but a revelation revealed} [An-Najm: 3-4]. Yes, Al-Dani narrated in (Al-Fitan) (141/1) from Al-Hasan in a Mursal form regarding Jesus peace be upon him: (And he is descending inevitably, so if you see him, recognize him...). The hadith was also narrated by Ibn Hibban (1904) from Salih bin Umar: Asim bin Kulayb informed us from his father who said: I heard Abu Huraira saying... and he mentioned it without his saying: (I swear that the Messenger of Allah, peace be upon him...). And its chain is authentic.",
    "foot_note": "1. See: (Mawarid al-Zaman) (1898).",
    "book_id": "692",
    "new_page_number": 56
  },
  {
    "serial_number": "104184",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 56,
    "volume_number": 1,
    "text": "The sentence about the anger was narrated by Muslim (8/194), Ibn Hibban (6755), and Ahmad (6/284). 5 - For this paragraph, there are many witnesses, of which I will mention what is accessible: First: From Al-Nawwas bin Sam'an who said: The Messenger of Allah (peace be upon him) mentioned the Dajjal one morning. He lowered [his voice] regarding him and raised it until we thought he was in the cluster of palm trees. He said: (Something other than the Dajjal scares me more for you. If he emerges while I am among you, I am his argument [defender] on your behalf. And if he emerges and I am not among you, then each person is his own defender, and Allah is my successor over every Muslim. He is a young man with curly hair, his eye is floating [blind], as if I liken him to Abdul Uzza bin Qatan. Whoever among you encounters him, let him read the opening verses of Surah (Al-Kahf) [for it is your protection from his tribulation]. He is emerging from a road between the Levant (Sham) and Iraq, spreading corruption to the right and spreading corruption to the left. O servants of Allah, stand firm). We said: O Messenger of Allah, how long will he stay on earth? He said: (Forty days. A day like a year, a day like a month, a day like a week, and the rest of his days like your days). We said: O Messenger of Allah, so that day which is like a year, will the prayer of one day suffice us in it?",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 57
  },
  {
    "serial_number": "104185",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 57,
    "volume_number": 1,
    "text": "He said: (No, estimate for it its measure). We said: O Messenger of Allah, and what is his speed in the earth? He said: (Like the rain driven by the wind. He comes to a people and invites them, so they believe in him and respond to him. He commands the sky and it rains, and the earth and it grows vegetation. Their grazing animals return to them with humps as high as possible, udders as full as possible, and flanks as stretched as possible. Then he comes to a people and invites them, but they reject his saying, so he turns away from them. They become drought-stricken, possessing nothing of their wealth. He passes by a ruin and says to it: Extract your treasures. So its treasures follow him like queen bees. Then he calls a man brimming with youth, strikes him with a sword, and cuts him into two pieces [separated by] the distance of an archer's target. Then he calls him, and he comes forward, his face beaming and laughing. While he is like that, Allah sends the Messiah son of Mary. He descends at the white minaret east of Damascus between two yellow garments, placing his palms on the wings of two angels. If he lowers his head, it drips, and if he raises it, drops like pearls fall from it. It is not lawful for a disbeliever to smell the scent of his breath except that he dies, and his breath reaches as far as his sight ends. He seeks him [the Dajjal] until he catches him at the gate of (Ludd) and kills him. Then a people whom Allah has protected from him come to Jesus son of Mary, so he wipes their faces and tells them of their ranks in Paradise. While he is like that, Allah reveals to Jesus: I have brought forth servants of Mine whom no one has the power",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 58
  },
  {
    "serial_number": "104186",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 58,
    "volume_number": 1,
    "text": "to fight, so secure My servants to Al-Tur (the Mount). And Allah sends Gog and Magog, and they swarm down from every mound. Their first pass by Lake Tiberias and drink what is in it, and their last pass and say: There was once water here. The Prophet of Allah Jesus and his companions are besieged until the head of a bull for one of them is better than a hundred dinars for one of you today. So the Prophet of Allah Jesus and his companions beseech Allah, so Allah sends upon them worms (Naghaf) in their necks, and they die as the death of a single soul. Then the Prophet of Allah Jesus and his companions descend to the earth [lowland], but they do not find in the earth the space of a hand span except that their fat and stench has filled it. So the Prophet of Allah Jesus and his companions beseech Allah, and Allah sends birds like the necks of Bactrian camels, which carry them and throw them where Allah wills. Then Allah sends rain from which no house of clay or hair is shielded, and it washes the earth until it leaves it like a mirror. Then it is said to the earth: Grow your fruits and bring back your blessings. On that day, a group will eat from a pomegranate and seek shade under its peel, and milk will be blessed until a milch camel suffices a large group of people, and a milch cow suffices a tribe of people, and a milch sheep suffices a clan of people. While they are like that, Allah sends a pleasant wind which takes them under their armpits and takes the soul of every believer and every Muslim. The worst of people remain, copulating in it like donkeys, and upon them the Hour will be established). Narrated by Muslim (8/197-198), Abu Dawud (2/213) - with some abbreviation and the addition is his, and his chain is authentic - Al-Tirmidhi (2241), Ibn Majah (2/508-512), Al-Ajurri in (Al-Shari'ah) (p. 376), Ahmad (4/181-182), Hanbal (49/1 - 51/1), Ibn Mandah in (Al-Iman) (94/1), and Ibn Asakir (1/606-609).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 59
  },
  {
    "serial_number": "104187",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 59,
    "volume_number": 1,
    "text": "Second: From Jubayr bin Nufayr from his father raised [to the Prophet] similarly, without his saying: (We said: O Messenger of Allah, and what is his speed in the earth...). Narrated by Al-Hakim (4/530-531) who said: (Authentic chain). Al-Dhahabi agreed with him. I say: Rather, it is authentic according to the condition of Muslim; all its narrators are trustworthy narrators of his. Al-Haythami said (7/351): (Narrated by Al-Tabarani, and in it is Abdullah bin Salih who has been declared trustworthy and weak by a group, and the rest of its narrators are trustworthy). He mentioned it in another place (7/347-348) up to his saying: (And Allah is my successor over every Muslim) and said: (Narrated by Al-Bazzar, and in it is Abdullah bin Salih, the scribe of Al-Layth, who has been declared trustworthy and weak by a group, and the rest of its narrators are narrators of the (Sahih)). I say: It is in Al-Hakim from other than the route of Ibn Salih, so the Hadith is authentic, praise be to Allah. Third: From Aisha (may Allah be pleased with her) who said: The Messenger of Allah (peace be upon him) entered upon me while I was crying. He said to me: (What makes you cry?) I said: O Messenger of Allah, I remembered the Dajjal and cried. The Messenger of Allah (peace be upon him) said: (If the Dajjal emerges while I am alive, I will suffice you against him. And if the Dajjal emerges after me, then your Lord",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 60
  },
  {
    "serial_number": "104188",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 60,
    "volume_number": 1,
    "text": "is not one-eyed. He emerges in the Jewish quarter of Isfahan until he comes to Medina and camps on its outskirts. It will have at that time seven gates; over every mountain pass leading to it are two angels. The evil ones of its people will go out to him until he comes to Palestine at the gate of Ludd. Then Jesus peace be upon him descends and kills him. Then Jesus peace be upon him remains in the earth for forty years as a just leader and a fair judge). Narrated by Ibn Hibban (1905), Ahmad (6/75), his son in (Al-Sunnah) (p. 136), Ibn Mandah (97/2), and Al-Dani (142/2) via Yahya bin Abi Kathir who said: Al-Khadrami bin Lahiq told me: That Dhakwan Abu Salih informed him: That Aisha informed him: ... and he mentioned it. I say: This is an authentic chain. Al-Haythami said (7/338): (And its narrators are the narrators of the (Sahih) except Al-Khadrami bin Lahiq, and he is trustworthy). Fourth: From Umm Salama, the wife of the Prophet (peace be upon him), who said: I mentioned the Messiah Dajjal one night and sleep did not come to me. When morning came, I entered upon the Messenger of Allah (peace be upon him) and informed him. He said: (Do not do that, for if he emerges while I am alive, Allah will suffice you against him through me. And if he emerges after I die, Allah will suffice you against him through the righteous). Then he said: (There is no prophet except that he warned his nation about the Dajjal, and I warn you about him: He is one-eyed, and Allah is not one-eyed. He walks on the earth, and the earth and the sky belong to Allah. Lo! The Messiah's right eye is as if it were a floating grape). Narrated by Ibn Khuzaimah (p. 32).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 61
  },
  {
    "serial_number": "104189",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 61,
    "volume_number": 1,
    "text": "I say: Its chain is according to the condition of Muslim. Al-Haythami said (7/351): (Narrated by Al-Tabarani and its narrators are trustworthy, except that Al-Tabarani's sheikh Ahmad bin Muhammad bin Nafi' Al-Tahhan, I did not know him). I say: Ibn Khuzaimah's chain is free of him, hence Al-Hafiz Ibn Kathir said (1/138): (Al-Dhahabi said: Its chain is strong). 6 - This paragraph is established from the hadith of Al-Nawwas and Nufayr the father of Jubayr, and they have preceded in the previous paragraph. 7 - And in it are hadiths: First: From Abu Huraira (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: (Shall I not tell you a hadith about the Dajjal that no prophet told his people? He is one-eyed, and he brings with him the semblance of Paradise and Hell. The one he says is Paradise is Hell. And I warn you as Noah warned his people about him). Narrated by Al-Bukhari (6/286), Muslim (8/196), Al-Dani in (Al-Fitan) (f 127/1), and Hanbal (49/1). Al-Tayalisi narrated it (2/218 / 2779) via another route from him. Second: From Aisha raised [to the Prophet] with the wording: (As for the tribulation of the Dajjal, there was no prophet except that he warned his nation. And I will warn you about him",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 62
  },
  {
    "serial_number": "104190",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 62,
    "volume_number": 1,
    "text": "a warning that no prophet warned his nation: He is one-eyed, and Allah, Mighty and Majestic, is not one-eyed. Written between his eyes: Kafir, which every believer will read). Narrated by Ahmad (6/139-140) and Ibn Mandah (97/2 and 100/1). I say: Its chain is authentic. Third: From Ibn Umar who said: The Messenger of Allah (peace be upon him) said: (There was no prophet before me except that he described him to his nation. And I will surely describe him with a description that no one before me has described: He is one-eyed, and Allah, Blessed and Exalted, is not one-eyed. His right eye is as if it were a floating grape). Narrated by Ahmad (2/27) and his son in (Al-Sunnah) (140) via Ibn Ishaq from Nafi' from him. Juwayriyah followed him up from Nafi' with it similarly and added. The two Sheikhs and others narrated it from another route from him similarly, and it has passed (p. 51). Fourth: From Sa'd bin Abi Waqqas who said: The Messenger of Allah (peace be upon him) said: (I will surely describe the Dajjal with a description that no one before me has described: He is one-eyed, and Allah, Mighty and Majestic, is not one-eyed). Narrated by Ahmad (1/176 and 182), his son in (Al-Sunnah) (137), and Al-Dani (130/2) via Muhammad bin Ishaq from Dawud bin Amir bin Sa'd bin Malik from his father from his grandfather.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 63
  },
  {
    "serial_number": "104191",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 63,
    "volume_number": 1,
    "text": "Its narrators are trustworthy were it not that Ibn Ishaq is a Mudallis (concealer). Abu Ya'la narrated it via his route, as did Al-Bazzar as in (Al-Majma') (7/337). Fifth: From Abu Sa'id Al-Khudri: That he heard the Messenger of Allah (peace be upon him) saying: (Verily, every prophet warned his nation about the Dajjal. And indeed, today he has eaten food. And I am making a covenant [giving a description] that no prophet before me made for his nation: Lo! His right eye is erased of the pupil, protruding, not hidden, as if it were spittle on the side of a wall, and his left eye is like a bright star. With him is the likes of Paradise and the likes of Hell. His Hell is a green garden, and his Paradise is dusty and smoky...) The hadith at length, and in it is the story of the believer whom the Dajjal kills then revives, then cannot kill, which will come. Narrated by Hanbal (47/1-2), Abd bin Hamid (118/2), Abu Ya'la (f 63/1 - library photocopy), Ibn Asakir (1/610-611), and Al-Hakim (4/537-539) who said: (This is the most amazing hadith regarding the mention of Dajjal. Atiyyah bin Sa'd was alone in narrating it from Abu Sa'id Al-Khudri, and the two Sheikhs did not use Atiyyah as proof). I say: That is due to his weakness. Al-Haythami said (7/337), having attributed it to Al-Bazzar also: (And he has been declared trustworthy). I say: But Mujalid followed him up from Abu Al-Waddak who said: Abu Sa'id said to me: Do the Kharijites believe in the Dajjal? I said: No. He said: The Messenger of Allah (peace be upon him) said:",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 64
  },
  {
    "serial_number": "104192",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 64,
    "volume_number": 1,
    "text": "(I am the seal of a thousand prophets, and no prophet was sent who was followed except that he warned his nation about the Dajjal. And indeed, matters of his affair have been clarified to me that were not clarified to anyone else. He is one-eyed, and your Lord is not one-eyed. His right eye is one-eyed and protruding...) The Hadith up to his saying: (smoky). Narrated by Ahmad (3/79). I say: Mujalid is not strong, and Abu Al-Waddak is better than him, so the hadith is Hasan (good) by the sum of the two routes. And Allah knows best. Others narrated it from Abu Al-Waddak with a different wording, and it will come (p. 80). Sixth: From Jabir who said: The Prophet (peace be upon him) said: (No prophet [was sent] except that he warned his nation about the Dajjal. And I will surely tell you something about him that no one before me told). Then he placed his hand on his eyes and said: (I bear witness that Allah, Mighty and Majestic, is not one-eyed). Narrated by Al-Hakim (1/24) and Ibn Mandah in (Al-Tawhid) (82/2) who said: (This chain has famous narrators). I say: Its chain is good and its narrators are trustworthy. Ibn Mandah also narrated it in a suspended form (Mu'allaq) from the hadith of Ibn Umar similarly, and in it: (And he pointed with his hand to his eyes) (1). (1) Al-Bukhari connected it (13/332). This addition is witnessed by the hadith of Jabir coming (pp. 89-90) and the hadith of Abu Huraira regarding this verse: {Indeed, Allah commands you to render trusts to whom they are due... Indeed, Allah is ever Hearing and Seeing} [An-Nisa: 58]: (I saw the Messenger of Allah, peace be upon him, placing his thumb on his ear and the finger next to it on his eye. Abu Huraira said: I saw the Messenger of Allah, peace be upon him, doing that). Narrated by Abu Dawud (2/277-278), Ibn Khuzaimah in (Al-Tawhid) (p. 31), Al-Hakim (1/24), Al-Bayhaqi in (Al-Asma') (p. 178), and Ibn Mandah also (82/2). He said: (Narrated by Abu Ma'shar from Al-Maqburi from Abu Huraira. And narrated by Ibn Lahi'ah from Yazid bin Abi Habib from Abu Al-Khayr Marthad bin Abdullah from Uqbah bin Amir. And narrated from Al-Hasan bin Thawban from Abu Al-Khayr from Uqbah bin Amir similarly). I say: The chain of Abu Huraira's hadith is authentic on the condition of Muslim, and Al-Hakim, Al-Dhahabi, and Al-Hafiz (13/318) said the same. Al-Kawthari criticized it in his commentary on (Al-Asma') without proof, as is his habit with the hadiths of the Attributes.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 65
  },
  {
    "serial_number": "104193",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 65,
    "volume_number": 1,
    "text": "And from another route from him, he said: The Messenger of Allah (peace be upon him) said: (I am the seal of a thousand prophets...) The Hadith is like the one before it without his saying: (And his right eye...) etc. (1). Al-Haythami said (7/347): (Narrated by Al-Bazzar, and in it is Mujalid bin Sa'id; the majority weakened him, but there is authentication for him). Al-Hafiz Ibn Kathir said in (Al-Nihayah) (1/128): (Its chain is good and its wording is very strange). 8 - I did not find a significant witness for this paragraph. Sulayman bin Shihab narrated saying: Abdullah bin Mughnam stayed with me - and he was one of the companions of the Prophet (peace be upon him) - so he narrated to me from the Prophet (peace be upon him) that he said:",
    "foot_note": "1. See: (Mawarid al-Zaman) (1899).",
    "book_id": "692",
    "new_page_number": 66
  },
  {
    "serial_number": "104194",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 66,
    "volume_number": 1,
    "text": "(The Dajjal is not hidden. He comes from the East and calls to me [claims to follow me], so he is followed. He sets himself up for the people, fights them, and prevails over them. He continues like that until he reaches Kufa, where he manifests the religion of Allah and acts by it, so he is followed and loved for that. Then he says after that: I am a prophet. So every person of intellect is terrified by that and leaves him. He remains after that until he says: I am Allah. Then his eye is obliterated, his ear is cut off, and written between his eyes is: Kafir...) The Hadith. Al-Haythami said (7/340-341): (Narrated by Al-Tabarani, and in it is Sa'id bin Muhammad Al-Warraq, who is abandoned [Matruk]). I say: But Al-Hafiz said in (Al-Taqrib): (Weak). Therefore, he said in (Al-Fath) (13/77): (Its chain is weak), so he did not exaggerate in weakening him. Everyone has a direction and a predecessor. And Allah knows best. Ibn Asakir narrated it via his route (1/217-218). Then I found a strong witness for it from the hadith of Abu Huraira raised [to the Prophet] with the wording: (Before the Hour, there will be close to thirty lying Dajjals, all of them saying: I am a prophet, I am a prophet). Narrated by Ahmad (2/429) with this wording, and the two Sheikhs and others with similar wording. Ahmad's chain is authentic. The indication of the hadith and its witnessing for this paragraph is that it is apparent that the Messiah Dajjal is one of these - nay, he is the worst of them. This is supported by the hadith of Samura raised [to the Prophet]:",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 67
  },
  {
    "serial_number": "104195",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 67,
    "volume_number": 1,
    "text": "(By Allah, the Hour will not be established until thirty liars emerge, the last of them being the one-eyed Dajjal...) The Hadith, and there is weakness in its chain. 9 - This paragraph - without the duality - appeared in hadiths: First: From Umar bin Thabit Al-Ansari: That some companions of the Messenger of Allah (peace be upon him) informed him: That the Messenger of Allah (peace be upon him) said on the day he warned the people about the Dajjal: (It is written between his eyes: Kafir; the one who hates his actions reads it, or every believer reads it) and he said: (Know that none of you will see his Lord, Mighty and Majestic, until he dies). Narrated by Muslim (8/193), Abd al-Razzaq in Al-Musannaf (20820), and from him Al-Tirmidhi (2236) and he authenticated it, as well as Ahmad (5/433) and Al-Dani (129/1-2) without his saying: (or every believer reads it). Second: From Ubadah bin Al-Samit who said: The Messenger of Allah (peace be upon him) said: (I have told you about the Dajjal until I feared you would not comprehend. The Messiah Dajjal is a short man, pigeon-toed, woolly-haired, one-eyed, an eye that is not protruding nor deep-set. If he confuses you, then know that your Lord, Mighty and Majestic, is not one-eyed, and that you will not see your Lord until you die).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 68
  },
  {
    "serial_number": "104196",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 68,
    "volume_number": 1,
    "text": "Narrated by Abu Dawud (2/213), Al-Ajurri in (Al-Shari'ah) (p. 375), Abu Nu'aym in (Al-Hilyah) (5/157, 221 and 9/235), and Ibn Mandah in (Al-Tawhid) (83/1). I say: Its chain is good; all its narrators are trustworthy. Al-Haythami said (7/348): (Narrated by Al-Bazzar and in it is Baqiyyah, and he is a Mudallis). I say: He explicitly stated hearing [narrating] in Abu Nu'aym in his three references mentioned, and Ibn Mandah, and also in Abu Dawud, except that the point of witness from it did not occur in his narration, which is his saying: (And that you will not see your Lord until you die). 10 - This paragraph is Mutawatir (mass transmitted) from the Prophet (peace be upon him). It has been narrated by a group of the Companions; the referencing of most of their hadiths has preceded, so I will suffice with referring to their places: First: Abdullah bin Umar (pp. 51, 52, 62). Second: Anas bin Malik (p. 53). Third: Aisha (pp. 59, 61). Fourth: Umm Salama (p. 60). Fifth: Sa'd bin Abi Waqqas (p. 62). Sixth: Abu Sa'id Al-Khudri (p. 64). Seventh: Jabir bin Abdullah (p. 64).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 69
  },
  {
    "serial_number": "104197",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 69,
    "volume_number": 1,
    "text": "Eighth: Ubadah bin Al-Samit (p. 67). Ninth: Asma bint Yazid Al-Ansariyyah, and her hadith will come (pp. 57, 76). Tenth: A man from the companions of the Prophet (peace be upon him), and it will come as well (p. 71). Eleventh: From Ibn Abbas from the Prophet (peace be upon him) that he said: (The Dajjal: he is one-eyed, white/fair, the most resembling of people to Abdul Uzza bin Qatan. So whoever perishes, perishes [despite clear signs], for your Lord is not one-eyed). Narrated by Ibn Khuzaimah in (Al-Tawhid) (p. 31), Ibn Hibban (1900), Ahmad (1/240, 313), his son in (Al-Sunnah) (p. 137), Al-Tabarani in (Al-Kabir) (11711), Hanbal in (Al-Fitan) (45/1), and Ibn Mandah in (Al-Tawhid) (83/1). I say: Its chain is authentic on the condition of Muslim. 11 - This paragraph came from a group of the Companions: First: Anas bin Malik, and his hadith has passed (p. 53). Second: Aisha, and her hadith has passed (p. 61). Third: Some of his companions (peace be upon him), and his hadith has passed (p. 67). Fourth: Abdullah bin Umar, and his hadith has passed (p. 52). Fifth: Hudhayfah bin Al-Yaman, and his hadith has passed (p. 51 footnote). Sixth: Nufayr the father of Jubayr, and the referencing of his hadith has preceded (p. 59).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 70
  },
  {
    "serial_number": "104198",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 70,
    "volume_number": 1,
    "text": "Seventh: Abu Bakra Al-Thaqafi said: The Messenger of Allah (peace be upon him) said: (The Dajjal is blind in the left eye. Written between his eyes: Kafir, which the illiterate and the literate will read). Narrated by Ahmad (5/38). I say: Its chain is authentic. Al-Haythami said (7/337): (And its narrators are trustworthy). Eighth: From Safina, and it will come (p. 73). Ninth: From Jabir bin Abdullah, and it will come as well (pp. 71-73). Tenth: From Asma bint Yazid Al-Ansariyyah, and it will come (pp. 75-76). 12 - This paragraph is also Mutawatir from the Prophet (peace be upon him). It appeared in the hadiths of most of the Companions whose hadiths I referred to just now. 13 - And this was narrated from a group of the Companions: First: Hudhayfah bin Al-Yaman said: The Messenger of Allah (peace be upon him) said: (The Dajjal is blind in the left eye, with thick hair. With him is a paradise and a fire; his fire is paradise and his paradise is fire). He added in a narration: (So whoever enters his river, his reward is removed and his burden is established, and whoever enters his fire, his reward is established and his burden is removed). Narrated by Muslim (8/195), Ibn Majah (2/506), and Ahmad (5/397).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 71
  },
  {
    "serial_number": "104199",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 71,
    "volume_number": 1,
    "text": "And the other narration is his (5/403) and its chain is good (Hasan). Al-Hakim authenticated it (4/433) and Al-Dhahabi agreed with him. Abu Dawud narrated it (4244), and it is referenced in (Al-Mishkat) (No. 5396 / Second Verification). Second: A man from the companions of the Prophet (peace be upon him) said: I heard the Messenger of Allah (peace be upon him) saying: (I have warned you about the tribulation of the Dajjal, and there is no prophet except that he warned his people or his nation. He is swarthy, curly-haired, blind in the left eye. He brings rain but does not grow trees. He overpowers a soul and kills it then revives it, but he is not empowered over any other. With him is a paradise, a fire, a river, water, and a mountain of bread. His paradise is fire and his fire is paradise. He stays among you for forty mornings, visiting every watering place except four mosques: the Sacred Mosque [Mecca], the Mosque of Medina, Al-Tur, and Al-Aqsa Mosque. If he confuses you or appears doubtful to you, then Allah, Mighty and Majestic, is not one-eyed). Narrated by Ahmad (5/434, 435) and Hanbal (54/2 - 55/2). I say: Its chain is authentic. Ibn Mandah narrated the first part of it in (Al-Tawhid) (83/1) and added: (So know that Allah, Mighty and Majestic, is not one-eyed; Allah is not one-eyed; Allah is not one-eyed). He said: (Its chain has accepted narrators by consensus). Third: From Jabir bin Abdullah who said: The Messenger of Allah (peace be upon him) said: (The Dajjal will emerge when religion is light and knowledge is retreating. He has forty nights",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 72
  },
  {
    "serial_number": "104200",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 72,
    "volume_number": 1,
    "text": "to travel the earth. A day of them is like a year, a day of them is like a month, and a day of them is like a week, then the rest of his days are like these days of yours. He has a donkey which he rides; the width between its ears is forty cubits. He says to the people: I am your Lord. He is one-eyed, and your Lord is not one-eyed. Written between his eyes: Kafir - K F R spelled out - every believer, literate or illiterate, reads it. He visits every water and watering place except Medina and Mecca; Allah has forbidden them to him, and the angels stand at their gates. With him are mountains of bread, and the people are in hardship except for those who follow him. With him are two rivers - I know them better than he does - a river he says is Paradise and a river he says is Fire. So whoever enters the one he calls Paradise, it is Fire, and whoever enters the one he calls Fire, it is Paradise. (He said): Allah sends devils with him who speak to the people. With him is a great tribulation; he commands the sky and it rains in the eyes of the people, and he kills a soul then revives it in the eyes of the people. He is not empowered over anyone else among the people. He says: O people, does anyone do the like of this except the Lord, Mighty and Majestic? He said: So the Muslims flee to Mount Dukhan in Sham, and he comes to them and besieges them. His siege intensifies and he strains them severely. Then Jesus son of Mary descends and calls out at dawn, saying: O people,",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 73
  },
  {
    "serial_number": "104201",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 73,
    "volume_number": 1,
    "text": "what prevents you from going out to the lying, malicious one? They say: This is a jinn. So they go out, and behold, it is Jesus son of Mary (peace be upon him). The prayer is established, and it is said to him: Come forward, O Spirit of Allah. He says: Let your Imam come forward and pray with you. When he prays the Morning Prayer, they go out to him. He said: When the liar sees him, he dissolves just as salt dissolves in water. He walks to him and kills him, such that the tree and stone call out: O Spirit of Allah, this is a Jew. He does not leave anyone who followed him except that he kills him). Narrated by Ahmad (3/367-368): Muhammad bin Sabiq told us: Ibrahim bin Tahman told us from Abu Al-Zubayr from Jabir. Ibn Khuzaimah narrated it in (Al-Tawhid) (pp. 31-32) and Al-Hakim (4/530) via two other routes from Ibrahim, abbreviated. I say: This chain consists of trustworthy narrators, narrators of the (Sahih), except that Abu Al-Zubayr is a Mudallis and narrated it with 'an' (from). Despite that, Al-Hakim said: (Authentic chain) and Al-Dhahabi agreed with him. Fourth: From Safina, the freed slave of the Messenger of Allah (peace be upon him), who said: The Messenger of Allah (peace be upon him) addressed us and said: (Lo! There was no prophet before me except that he warned his nation about the Dajjal. He is one-eyed in the left eye, and in his right eye is a thick film. Written between his eyes: Kafir. Two valleys go out with him: one is Paradise and the other is Fire; his fire is paradise and his paradise is fire... Then he travels until",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 74
  },
  {
    "serial_number": "104202",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 74,
    "volume_number": 1,
    "text": "he comes to the Levant, and Allah, Mighty and Majestic, destroys him at the pass of Afiq). Narrated by Ahmad (5/221-222), Hanbal in (Al-Fitan) (49/1), and Ibn Asakir (1/617). I say: Its chain is good (Hasan) in the context of witnesses. Ibn Kathir said in (Al-Nihayah) (1/124): (Its chain is okay). Fifth: From Abu Huraira, and its wording has passed being referenced (p. 61). 14 - This paragraph appeared in two hadiths without [the mention of] seeking aid (Istighatha): First: From Al-Nawwas bin Sam'an, and it has passed (pp. 56-58). Second: From Nufayr the father of Jubayr, and it has passed (p. 59). 15 - I have not found yet what witnesses for this paragraph. If it were established, it would be explicit that the fire of the Dajjal is real fire and not a deception from him, may Allah curse him. Yes, Al-Dani narrated in (Al-Fitan) (134/2) from Al-Asbagh bin Nubatah from Ali in a hadith of his, suspended (Mawquf): (Whoever is tested by his fire, let him read the end of Surah (Al-Kahf), and the fire will become cool and safe upon him... and his followers on that day will be the people of usury - ten for twelve - and children of fornication). However, Al-Asbagh is abandoned (Matruk) and extremely weak, so he is not fit to be cited as a witness.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 75
  },
  {
    "serial_number": "104203",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 75,
    "volume_number": 1,
    "text": "16 - This paragraph is witnessed by two hadiths: First: The hadith of Asma bint Yazid Al-Ansariyyah, narrated by Shahr bin Hawshab from her, she said: The Messenger of Allah (peace be upon him) came to me among a group of his companions and mentioned the Dajjal. The Messenger of Allah (peace be upon him) said: (Before he emerges, there are three years. The sky holds back one-third of its rain in the first year, and the earth one-third of its vegetation. In the second year, the sky holds back two-thirds of its rain and the earth two-thirds of its vegetation. In the third year, the sky holds back what is in it, and the earth what is in it, until every creature with a molar or hoof perishes. One of his severest tribulations is that he says to the Bedouin: What do you think if I revive your camel for you, huge, with long udders and humps, chewing the cud, would you acknowledge that I am your Lord? He says: Yes. He said: So the devils represent themselves to him [in the form of his camel, so he follows him]. He said: And he says to the man: What do you think if I revive your father, your brother, and your mother, would you acknowledge that I am your Lord? He says: Yes. He said: So the devils represent themselves to him [in their forms, so he follows him]. He said: Then the Messenger of Allah (peace be upon him) went out for his need, and I placed water for ablution for him. The people wailed until their voices rose. The Messenger of Allah (peace be upon him) took hold of the two sides (or in a narration: jambs) of the door and said: (Mahyam?) [What is the matter?]. [And it was a word the Messenger of Allah (peace be upon him) used to say when asking about a matter: (Mahyam). Asma said:] I said: O Messenger of Allah, you have torn out",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 76
  },
  {
    "serial_number": "104204",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 76,
    "volume_number": 1,
    "text": "their hearts due to the Dajjal. The Messenger of Allah (peace be upon him) said: ([There is no harm upon you] If he emerges while I am among you, I am his argument [opponent] against him. And if I die, then Allah is my successor over every believer). [She said: I said: Will our hearts be with us on that day, O Messenger of Allah? He said: (Yes, or better. It is that the fruits of the lands will be fulfilled to him and he will feed them). She said: By Allah, my family prepares their dough, and it doesn't bake until I fear I will be tempted by hunger.] And what will suffice the believers on that day? He said: (It suffices them what suffices the people of heaven). [She said: O Prophet of Allah, we know that the angels do not eat or drink. He said: (But they glorify and sanctify [Allah], and that is the food and drink of the believers on that day] Glorification and Sanctification. [So whoever attends my gathering and hears my words, let the present convey to the absent. And know that Allah is sound, not one-eyed, and that the Dajjal is one-eyed, with an erased eye. Written between his eyes: Kafir, which every believer, literate or illiterate, will read]). Narrated by Abd al-Razzaq in (Al-Musannaf) (11/391 / 20821), Al-Tayalisi (2/217 / 2775), Ahmad (6/453, 454, 455), Hanbal bin Ishaq Al-Shaybani in (Al-Fitan) (f 45/1-2 and 46/1), Ibn Asakir in (Al-Tarikh) (1/616-617), Abdullah in (Al-Sunnah) (141), and Abu Amr Al-Dani in (Al-Fitan) (126/1) the last part of it via routes from Shahr with it.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 77
  },
  {
    "serial_number": "104205",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 77,
    "volume_number": 1,
    "text": "Ibn Kathir said (1/135): (And this chain is okay). In a narration by Ahmad (6/454), Hanbal (54/1-2), and Abd al-Razzaq also (20822) via the route of Ibn Khuthaym from Shahr with it raised [to the Prophet] with the wording: (The Dajjal stays on earth forty years; the year is like a month, the month is like a week, the week is like a day, and the day is like the burning of a palm frond in fire). Al-Haythami said (7/347): (Narrated by Al-Tabarani, and in it is Shahr bin Hawshab, and his contradiction of authentic hadiths cannot be tolerated: that he stays on earth forty days. While in this [it says] forty years. And the rest of its narrators are trustworthy). Second: The hadith of Jabir previously mentioned (pp. 71-73), and in it: (And Allah sends devils with him who speak to the people). 17 - Contains hadiths: First: From Abu Sa'id Al-Khudri who said: The Messenger of Allah (peace be upon him) told us a long hadith about the Dajjal, and said among what he told us: (The Dajjal comes, and it is forbidden for him to enter the mountain passes of Medina. So a man [brimming with youth] goes out to him on that day [from the believers], he is the best of people or among the best of them",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 78
  },
  {
    "serial_number": "104206",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 78,
    "volume_number": 1,
    "text": "and says: I testify that you are the Dajjal whom the Messenger of Allah (peace be upon him) told us about. The Dajjal says: What do you think if I kill this one and then revive him, will you doubt in the matter? They say: No. So he kills him then revives him. He says when he is revived: By Allah, I was never more insightful about you than I am now. He said: So he wants to kill him a second time, but he is not empowered over him). Narrated by Abd al-Razzaq (20824): Ma'mar informed us from Al-Zuhri who said: Ubaidullah bin Abdullah bin Utbah informed me: That Abu Sa'id Al-Khudri said: ... and he mentioned it and added: (Ma'mar said: It reached me that he places a sheet of copper on his throat. And it reached me that he is Al-Khidr whom the Dajjal kills and then revives). From the route of Abd al-Razzaq, Ibn Hibban (6763) [narrated it]. And Ahmad (3/36) also narrated it from Abd al-Razzaq without the mentioned statement of Ma'mar. Likewise, Al-Bukhari (13/86-88), Muslim (8/199), and Ibn Mandah (95/1) narrated it from other routes from Al-Zuhri with it. Muslim added: (Abu Ishaq said: It is said: This man is Al-Khidr peace be upon him). I say: This Abu Ishaq is Ibrahim bin Muhammad bin Sufyan Al-Zahid, the narrator of (Sahih Muslim) from him, as affirmed by Al-Hafiz (13/88-89) following Iyad, Al-Nawawi, and others. I say: His predecessor in that is the report of Ma'mar mentioned earlier, and there is no proof in it because it is a report (Balagh) whose speaker is unknown, and even if known, it is disconnected (Maqtu'). And Al-Khidr died before the Prophet (peace be upon him)",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 79
  },
  {
    "serial_number": "104207",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 79,
    "volume_number": 1,
    "text": "and he did not reach him according to the most correct view among the verifiers. Therefore, Ibn Al-Arabi said: (I heard someone say: The one whom the Dajjal kills is Al-Khidr. This is a claim with no proof). Second: From a man from the companions of the Prophet (peace be upon him), and it has passed (p. 71), and in it: (And he overpowers a soul and kills it then revives it, but he is not empowered over any other). Third: From Al-Nawwas bin Sam'an, and it has passed (pp. 56-58), and in it: (Then he calls a man brimming with youth, strikes him with a sword, and cuts him into two pieces [separated by] the distance of an archer's target. Then he calls him, and he comes forward, his face beaming and laughing). Fourth: From Abdullah bin Mughnam, and the first part of his hadith has passed (p. 66). Its completion is: (Then he calls for a man - as they see - and orders him to be killed, then cuts his limbs, each limb separately. He separates them until the people see him, then gathers them, then strikes with his staff, and behold he is standing. He says: I am Allah, I give life and cause death. And all of that is magic by which he bewitches the eyes of the people; he does nothing of that in reality). I say: Its chain is weak, and in this context, it is denounced (Munkar). And Allah knows best. Fifth: From Abdullah bin Amr, and it will come in the next paragraph.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 80
  },
  {
    "serial_number": "104208",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 80,
    "volume_number": 1,
    "text": "18 - Contains two hadiths: First: From Abu Sa'id Al-Khudri who said: The Messenger of Allah (peace be upon him) said: (The Dajjal emerges, and a man from the believers heads towards him. The armed guards - the guards of Dajjal - meet him and say to him: Where do you intend? He says: I intend to this one who has emerged. He said: They say to him: Do you not believe in our lord? He says: There is nothing hidden about our Lord. They say: Kill him. Then some of them say to others: Did your lord not forbid you to kill anyone without him? He said: So they take him to the Dajjal. When the believer sees him, he says: O people, this is the Dajjal whom the Messenger of Allah (peace be upon him) mentioned. He said: The Dajjal orders him to be laid out on his stomach and says: Take him and beat him. So his back and stomach are beaten severely. He said: Then he says: Do you not believe in me? He said: He says: You are the lying Messiah. He said: He orders him to be sawed with a saw from the parting of his hair until his legs are separated. He said: Then the Dajjal walks between the two pieces, then says to him: Stand up. So he stands up straight. He said: Then he says to him: Do you believe in me? He says: I have only increased in insight regarding you. He said: Then he says: O people, he will not do this to anyone after me among the people. He said: The Dajjal takes him to slaughter him, but the area between his neck and his collarbone is made into copper, so he finds no way to him. He said: So he takes him by his hands and feet and casts him. The people think he cast him into the Fire, but he was thrown into Paradise). The Messenger of Allah (peace be upon him) said: (This is the greatest of people in martyrdom with the Lord of the Worlds). Narrated by Muslim (8/200) and Ibn Mandah (95/1) via Qais bin Wahb from Abu Al-Waddak from him.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 81
  },
  {
    "serial_number": "104209",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 81,
    "volume_number": 1,
    "text": "And Al-Hakim and others who preceded (p. 63) narrated it via Atiyyah from him similarly. And the other: From Abdullah bin Amr from the Messenger of Allah (peace be upon him): That he said regarding the Dajjal: (Whatever is confused for you regarding him, then Allah is not one-eyed. He emerges and stays on earth forty mornings, visiting every watering place except the Kaaba, Bayt al-Maqdis, and Medina. The month is like a week, and the week is like a day. With him is a paradise and a fire; his fire is paradise and his paradise is fire. With him is a mountain of bread and a river of water. He calls a man, but Allah does not empower him except over him. He says: What do you say about me? He says: You are the enemy of Allah and you are the lying Dajjal. So he calls for a saw and places it at his head and splits him until he falls to the ground. Then he revives him and says: What do you say? He says: By Allah, I was never more insightful about you than I am now. You are the enemy of Allah, the Dajjal whom the Messenger of Allah (peace be upon him) told us about. He said: So he lunges at him with his sword but cannot [harm] him, so he says: Remove him from me). Al-Haythami said (7/350): (Narrated by Al-Tabarani, and in it are those whom I do not know). Therefore, Al-Dhahabi considered it strange (Gharib), as quoted by Al-Hafiz Ibn Kathir in (Al-Nihayah) (1/134). (Note): In these two hadiths, the believing man is sawed by the Dajjal with a saw, and in the hadith of Al-Nawwas previously mentioned, he (strikes him with a sword and cuts him into two pieces). Al-Hafiz said (13/87): Ibn Al-Arabi said:",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 82
  },
  {
    "serial_number": "104210",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 82,
    "volume_number": 1,
    "text": "(So it is reconciled that they are two men, he kills each of them with a killing different from the other). Al-Hafiz said: (So he said, but the principle is lack of multiplicity. The narration of the saw explains the narration of the strike with the sword. Perhaps the sword had notches so it became like a saw, and he intended exaggeration in torturing him with the mentioned killing. His saying: (so he struck him with the sword) explains his saying: that he sawed him. And his saying: (and cut him into two pieces) is an indication of the end of his matter when his sawing is finished). 19 - Witnessed by two hadiths: First: The hadith of Al-Nawwas bin Sam'an previously mentioned (pp. 56-58). The other: The hadith of Asma bint Yazid Al-Ansariyyah previously mentioned also (pp. 75-76). 20 - Also witnessed by the two hadiths referred to just now. 21 - Also witnessed by the two referred hadiths. 22 - This paragraph came in the hadiths of a group of the Companions: First: Anas bin Malik, and his hadith will come in the referencing of paragraph (24) (p. 90). Second: Fatima bint Qais in the story of Al-Jassasah and the Dajjal (1) from the narration of Tamim Al-Dari, and in it that the Dajjal said: (1) Know that this story is authentic - indeed Mutawatir - Tamim Al-Dari was not alone in narrating it as some ignorant people among the commentators on (Al-Nihayah) by Ibn Kathir (p. 96 - Riyadh edition) think. Abu Huraira, Aisha, and Jabir followed him in it as will come (pp. 83 and 87).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 83
  },
  {
    "serial_number": "104211",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 83,
    "volume_number": 1,
    "text": "(And I inform you about myself: I am the Messiah, and I am about to be permitted to emerge. So I will emerge and travel in the earth, and I will not leave a town except that I descend upon it in forty nights, except Mecca and Taybah [Medina], for they are both forbidden to me. Whenever I want to enter one - or: one - of them, an angel confronts me with an unsheathed sword in his hand, blocking me from it. And over every mountain pass of it are angels guarding it. She said: The Messenger of Allah (peace be upon him) said - striking the pulpit with his staff -: This is Taybah, this is Taybah, this is Taybah (meaning: Medina). Did I not tell you that?). The people said: Yes. He said: (Indeed, the hadith of Tamim pleased me, that it agreed with what I was telling you about him and about Medina and Mecca). Narrated by Muslim (8/205) and Ahmad (6/413 and 418). Al-Tayalisi also narrated it (2/218-219) abbreviated, Abu Dawud (2/214-215), Hanbal (44/2 - 45/1), and Ibn Mandah (98/1-2) via routes from Amir Al-Sha'bi from her. Also narrated by Al-Tirmidhi (2254), Ibn Majah (2/506-508), and Al-Ajurri (pp. 376-379) abbreviated, but they did not mention Mecca. It is a narration of Imam Ahmad (6/373-374) and Ibn Mandah (97/2). Third: Aisha (may Allah be pleased with her). Al-Sha'bi said in the last narration of Ahmad just mentioned: I met Al-Muharrar bin Abu Huraira and told him the hadith of Fatima bint Qais. He said:",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 84
  },
  {
    "serial_number": "104212",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 84,
    "volume_number": 1,
    "text": "I bear witness regarding my father that he told me just as Fatima told you, except that he said: The Messenger of Allah (peace be upon him) said: (He is towards the East). He said: Then I met Al-Qasim bin Muhammad and mentioned the hadith of Fatima to him. He said: I bear witness regarding Aisha that she told me just as Fatima told you, except that she said: (The two sanctuaries are forbidden to him: Mecca and Medina). Narrated (6/373-374 and 417-418) via the route of Mujalid from Amir. And Mujalid - who is Ibn Sa'id - is not strong, and he did not preserve the mention of Mecca in Fatima's hadith, so he differentiated between her hadith and Aisha's hadith, while they are in reality in agreement because the mention of Mecca is established in Fatima's hadith as well in Muslim and others as previously mentioned via routes from Amir from her. In a narration by Ahmad (6/241) via the route of Dawud - who is Ibn Abi Hind - from Amir from Aisha raised [to the Prophet] abbreviated with the wording: (The Dajjal will not enter Mecca nor Medina). I say: Its chain is authentic on the condition of Muslim. Ibn Mandah narrated similar to it. Fourth: From Abu Huraira (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: (Over the mountain passes of Medina are angels; plague will not enter it nor the Dajjal). Narrated by Al-Bukhari (4/76), Muslim (4/120), Ahmad (2/237, 331), and Al-Dani (128/2) via routes from him.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 85
  },
  {
    "serial_number": "104213",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 85,
    "volume_number": 1,
    "text": "And in another route by Ahmad (2/483) with the wording: (Medina and Mecca are surrounded by angels, on every mountain pass of it...). And in another by Muslim and also Abu Ya'la (292/2 - library photocopy): (The Messiah comes from the East intending Medina until he camps behind Uhud. Then the angels turn his face towards the Levant, and there he perishes). Fifth: Abu Bakra Al-Thaqafi said: People talked a lot about Musaylimah before the Messenger of Allah (peace be upon him) said anything about him. Then the Messenger of Allah (peace be upon him) stood delivering a sermon and said: (As for what follows, regarding the matter of this man about whom you have talked much - indeed he is a liar among thirty liars who will emerge before the Hour. And indeed, there is no town except that the terror of the Messiah reaches it except Medina; on every mountain pass of its passes are two angels repelling the terror of the Messiah from it). Narrated by Abd al-Razzaq (20823) and Ahmad (5/41 and 47) from him and from others from Ma'mar from Al-Zuhri from Talhah bin Abdullah bin Awf from him. I say: This chain appears authentic, for its narrators are trustworthy narrators of Al-Bukhari. However, two trustworthy narrators opposed Ma'mar, namely Aqil - who is Ibn Khalid Al-Ayli - and the nephew of Ibn Shihab - whose name is Muhammad bin Abdullah bin Muslim. They said: From Ibn Shihab from Talhah: That Iyad bin Musafi' informed him from Abu Bakra. Narrated by Ahmad (5/46).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 86
  },
  {
    "serial_number": "104214",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 86,
    "volume_number": 1,
    "text": "I say: This is more correct (1). And this Iyad is unknown (Majhul), but he has been followed up on the last part of it. Ibrahim bin Sa'd narrated from his father from his grandfather from Abu Bakra (may Allah be pleased with him) from the Prophet (peace be upon him) who said: (The terror of the Messiah Dajjal will not enter Medina. It will have at that time seven gates; on every gate are two angels). Narrated by Al-Bukhari (4/76) and Ahmad (5/43 and 47). Al-Hakim (4/542) included it [in Al-Mustadrak thinking it fits criteria but was missed], but he was mistaken [as it is in Bukhari]. It has a witness from the hadith of Abu Huraira in Al-Bukhari also number (5731) via the route of Malik, and this is in (Al-Muwatta) (3/88). Sixth: A man from the companions of the Prophet (peace be upon him), and his hadith has passed (p. 71). Seventh: Jabir bin Abdullah, and his hadith has passed also (pp. 71-73), and it will come via another route soon. Eighth: Abu Sa'id Al-Khudri, and it has passed (pp. 77-78). Ninth: Abdullah bin Amr, and it has passed also (p. 81). Tenth: From Anas like the hadith of Abu Huraira in the two Sheikhs. Narrated by Al-Bukhari (7134), Al-Tirmidhi (2243), Ibn Hibban (6766), (1) Then I saw that Al-Hakim narrated the hadith (4/541) via the route of Abd al-Razzaq and others from Ma'mar with it and said: (Ma'mar and Shu'ayb bin Abi Hamzah disconnected this chain from Al-Zuhri, for Talhah bin Abdullah bin Awf did not hear it from Abu Bakra; rather, he heard it from Iyad bin Musafi' from Abu Bakra. Thus it was narrated by Yunus bin Yazid and Aqil bin Khalid from Al-Zuhri). Then he cited his chain to them.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 87
  },
  {
    "serial_number": "104215",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 87,
    "volume_number": 1,
    "text": "and Ahmad (3/202, 206, 277). 23 - Contains hadiths: First: From Fatima bint Qais, and I mentioned its wording recently (pp. 82-83). Second: From Jabir also who said: The Messenger of Allah (peace be upon him) stood one day on the pulpit and said: (O people, I did not stand among you due to news that came to me from the sky (and he mentioned the hadith of Al-Jassasah briefly, and in it:) He said: He is the Messiah; the earth is folded for him in forty days except what was of Taybah). The Messenger of Allah (peace be upon him) said: (And Taybah is Medina. There is no gate of its gates except there is an angel upon it with his sword unsheathed preventing him. And Mecca is like that). Narrated by Abu Ya'la in his (Musnad) (p. 112/2 and 113/2) via two routes from Muhammad bin Fudayl: Al-Walid bin Jumay' told us from Abu Salamah bin Abdur-Rahman from him. I say: This chain is good and it is on the condition of Muslim. Al-Haythami said (7/346): (Narrated by Abu Ya'la with two chains, the narrators of one of them are the narrators of the (Sahih)). Third: Mihjan bin Al-Adra' said: The Messenger of Allah (peace be upon him) sent me for a need, then met me in some roads of Medina. Then he climbed Uhud and I climbed with him. He turned his face towards Medina and said something to it, then said: (Woe to its mother - or: Woe to her mother - a village whose people leave it when it is most ripe, the birds",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 88
  },
  {
    "serial_number": "104216",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 88,
    "volume_number": 1,
    "text": "and beasts will eat it. It eats its fruit and the Dajjal will not enter it, if Allah wills. Whenever he wants to enter it, he is met at every mountain pass of its passes by an angel with an unsheathed sword preventing him from it). Narrated by Al-Hakim (4/427) who said: (Authentic chain) and Al-Dhahabi agreed with him. I say: It has a disconnection as will be explained. 24 - Contains hadiths: First: From Ibn Umar (may Allah be pleased with them both) who said: The Messenger of Allah (peace be upon him) said: (The Dajjal descends in this salt flat at Marr Qanat. Most of those who go out to him will be women, until a man returns to his intimate relative, to his mother, daughter, sister, and aunt, and ties her up with a rope fearing she will go out to him. Then Allah empowers the Muslims over him, so they kill him and kill his followers, until the Jew hides under the tree or stone, and the stone or tree says to the Muslim: This is a Jew under me, so kill him). Narrated by Ahmad (2/67) and Hanbal in (Al-Fitan) (51/2 - 52/1). I say: Its chain is good were it not for the 'an'anah (narrating with 'from') of Muhammad bin Ishaq. Second: From Abu Sa'id Al-Khudri raised [to the Prophet]: (The Dajjal comes - and it is forbidden for him to enter the mountain passes of Medina - so he camps at some of the salt flats near Medina. A man goes out to him on that day...) The Hadith. Narrated by the two Sheikhs and others, and it has passed with the wording of Abd al-Razzaq (pp. 77-78).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 89
  },
  {
    "serial_number": "104217",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 89,
    "volume_number": 1,
    "text": "Third: From Mihjan bin Al-Adra': That the Messenger of Allah (peace be upon him) addressed the people and said: (The Day of Deliverance, and what is the Day of Deliverance? The Day of Deliverance, and what is the Day of Deliverance? The Day of Deliverance, and what is the Day of Deliverance?) (Three times). It was said to him: And what is the Day of Deliverance? He said: (The Dajjal comes and climbs Uhud, looks at Medina and says to his companions: Do you see this white palace? This is the mosque of Ahmad. Then he comes to Medina and finds at every mountain pass of it an angel with an unsheathed sword. So he comes to the salt flat of Al-Jurf and pitches his tent. Then Medina shakes with three tremors, and no hypocrite male or female, nor wicked male or female remains except that they go out to him. That is the Day of Deliverance). Narrated by Ahmad (4/338), Hanbal (46/2 - 47/1), and Al-Hakim (4/427 and 543) who said: (Authentic on the condition of Muslim) and Al-Dhahabi agreed with him. It is as they said if it is free from disconnection between Abdullah bin Shaqiq and Mihjan. Raja' bin Abi Raja' Al-Bahili was introduced between them in a narration by Ahmad and Hanbal (46/1), and its chain is more authentic than the chain of the first narration, but it is in any case okay in witnesses. Fourth: From Jabir bin Abdullah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) looked over a crevice of the Harra (volcanic rock field) and we were with him. He said: (What a good land is Medina. If the Dajjal emerges, on every mountain pass of its passes is an angel",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 90
  },
  {
    "serial_number": "104218",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 90,
    "volume_number": 1,
    "text": "he will not enter it. When that happens, Medina will shake with its people with three tremors. No hypocrite male or female will remain except that they go out to him. And the majority - meaning - those who go out to him are women. That is the Day of Deliverance. That is the day Medina expels filth just as the bellows expel the filth of iron. With him are seventy thousand Jews; on every man of them is a robe (Saj) and an adorned sword. His neck will be struck with this strike at the confluence of the torrents). Then the Messenger of Allah (peace be upon him) said: (There was no tribulation - nor will there be until the Hour is established - greater than the tribulation of the Dajjal. And no prophet [was sent] except that he warned his nation. And I will surely tell you something no prophet told his nation before me). Then he placed his hand on his eye then said: (I bear witness that Allah, Mighty and Majestic, is not one-eyed). Narrated by Ahmad (3/292) and his son in (Al-Sunnah) (138). I say: Its narrators are trustworthy narrators of the two Sheikhs except Zuhair - who is Ibn Muhammad Al-Khurasani - and in him is weakness. Ibn Kathir said (1/127): (Its chain is good and Al-Hakim authenticated it). It has another route abbreviated in (Al-Ihsan) (6616). Fifth: From Anas bin Malik who said: The Messenger of Allah (peace be upon him) said: (The Dajjal comes and treads the earth except Mecca and Medina. He comes to Medina and finds at every mountain pass of its passes rows of angels. He comes to the salt flat of Al-Jurf and pitches his tent.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 91
  },
  {
    "serial_number": "104219",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 91,
    "volume_number": 1,
    "text": "So Medina will shake with three tremors, and every hypocrite male and female will go out to him). Narrated by Al-Bukhari (1/466 - Europe), Muslim (8/206-207), Ahmad (3/191, 206, 238, 292), Hanbal (47/1 - 48/2), and Al-Dani in (Al-Fitan) (127/2 - 128/1). 25 - Contains three hadiths: First: From Anas. Second: From Jabir. Third: From Mihjan. All three have passed just now. Fourth from a man from the Ansar from some companions of Muhammad (peace be upon him) who said: The Messenger of Allah (peace be upon him) mentioned the Dajjal and said: (He comes to the salt flats of Medina, and it is forbidden for him to enter its mountain passes. So Medina shakes with its people once or twice - and it is the earthquake - and every hypocrite male and female goes out to him from it. Then the Dajjal turns towards the Levant until he comes to some of the mountains of the Levant and besieges them. The remainder of the Muslims on that day are fortified on the peak of a mountain of the mountains of the Levant. The Dajjal besieges them, camping at its base. When the tribulation becomes prolonged upon them, a man from the Muslims says: O assembly of Muslims, until when are you like this while the enemy of Allah is camping in your land like this? Are you [waiting for anything] but one of the two good things: either Allah grants you martyrdom or He grants you victory? So they pledge",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 92
  },
  {
    "serial_number": "104220",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 92,
    "volume_number": 1,
    "text": "upon death, a pledge that Allah knows is truthful from themselves. Then darkness seizes them such that a man cannot see his palm. He said: Then the son of Mary descends, and [the darkness] is lifted from their eyes, and among them is a man wearing armor. They say: Who are you, O servant of Allah? He says: I am the servant of Allah and His Messenger, His Spirit, and His Word, Jesus son of Mary. Choose one of three: either Allah sends a punishment from the sky upon the Dajjal and his soldiers, or the earth swallows them, or He empowers your weapons over them and restrains their weapons from you. They say: This, O Messenger of Allah, is most healing for our chests and ourselves. On that day, you will see the huge, tall, gluttonous, heavy-drinking Jew, his hand cannot hold his sword due to trembling. So they rise against them and overpower them. The Dajjal melts when he sees the son of Mary as lead melts, until Jesus comes to him or catches him and kills him). Narrated by Abd al-Razzaq (20834) from Amr bin Abi Sufyan Al-Thaqafi from him. I say: Its chain consists of trustworthy narrators of the two Sheikhs except the Ansari man, for he was not named. It is possible he is a Companion because this Al-Thaqafi is a Tabi'i who narrated from Abu Musa Al-Ash'ari and others. If that is so, the chain is authentic because the anonymity of a Companion does not harm according to Ahl al-Sunnah. 26 - Witnessed by two hadiths: First: The hadith of Jabir previously mentioned (pp. 89-90) and in it: (That is the Day of Deliverance. That is the day Medina expels filth just as the bellows expel the filth of iron).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 93
  },
  {
    "serial_number": "104221",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 93,
    "volume_number": 1,
    "text": "And the other: The hadith of Abu Huraira: That the Messenger of Allah (peace be upon him) said: (Lo! Medina is like the bellows; it expels the impure. The Hour will not be established until Medina expels its evil ones just as the bellows expel the filth of iron). Narrated by Muslim (4/120). 27 - Contains two hadiths: First: The hadith of Mihjan bin Al-Adra', and it has passed (p. 89). The other: The hadith of Jabir bin Abdullah, and it has passed also (pp. 89-90). 28 - Contains two hadiths also: First: From Umm Sharik herself who said: I heard the Messenger of Allah (peace be upon him) saying: (The people will surely flee from the Dajjal into the mountains). Umm Sharik said: O Messenger of Allah, where will the Arabs be on that day? He said: (They are few). Narrated by Muslim (8/207), Al-Tirmidhi (3926) (1), and Ahmad (6/462). The other: From Aisha: That the Messenger of Allah (peace be upon him) mentioned a severe hardship that will be before the Dajjal. I said: O Messenger of Allah, where will the Arabs be on that day? He said: (1) I say: Professor Al-Da'as missed that it is in (Muslim), so he said in his commentary on (Al-Tirmidhi): (Al-Tirmidhi was solitary in narrating it).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 94
  },
  {
    "serial_number": "104222",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 94,
    "volume_number": 1,
    "text": "(O Aisha, the Arabs on that day will be few). I said: What will suffice the believers on that day regarding food? He said: (What suffices the angels: Glorification [Tasbih], Magnification [Takbir], Praise [Tahmid], and Declaration of Oneness [Tahlil]). I said: So what wealth is best on that day? He said: (A strong young servant who gives water to his family, but as for food, there is no food). Narrated by Ahmad (6/125), Hanbal (47/2), and Abu Ya'la (3/1133) via Hammad bin Salamah from Ali bin Zaid from Al-Hasan from her. I say: This chain is weak. Al-Hasan - who is Al-Basri - is a Mudallis, and Ali bin Zaid - who is Ibn Jud'an - is weak. Al-Haythami overlooked this, saying (7/335): (Narrated by Ahmad and Abu Ya'la, and its narrators are the narrators of the (Sahih)). 29 - I did not find a witness for it. 30 - Witnessed by the hadith of Ali (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: (The Mahdi is from us, the Ahl al-Bayt; Allah will rectify him in a night). It is an established hadith referenced in (Al-Sahihah) (2371). 31 - This paragraph is witnessed by hadiths: First: From Uthman bin Abi Al-Aas who said: I heard the Messenger of Allah (peace be upon him) saying: (There will be three garrison cities/regions for the Muslims: A garrison at the meeting of the two seas, a garrison in Hira,",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 95
  },
  {
    "serial_number": "104223",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 95,
    "volume_number": 1,
    "text": "and a garrison in the Levant. People will be terrified with three frights. Then the Dajjal emerges in the anger of people. He is defeated from the East. The first garrison he comes to is the garrison at the meeting of the two seas. Its people become three groups: a group that says: 'Let us see what he is?', a group that joins the Bedouins, and a group that joins the garrison next to them. With the Dajjal are seventy thousand wearing woolen garments (Sijan). Most of his followers are Jews and women. Then he comes to the garrison next to them, and its people become three groups: a group that says: 'Let us see what he is?', a group that joins the Bedouins, and a group that joins the garrison next to them in western Sham. The Muslims retreat to the pass of Afiq. They send out their grazing animals, but their animals are stricken. That becomes severe upon them, and they are afflicted with severe famine and severe hardship, until one of them burns the string of his bow and eats it. While they are like that, a caller calls out at dawn: 'O people, the Helper (Al-Ghawth) has come' (three times). Some of them say to others: 'Indeed, this is the voice of a satiated man.' Jesus son of Mary (peace be upon him) descends at the time of the Dawn Prayer. Their leader says to him: 'O Spirit of Allah, come forward and pray.' He says: 'This nation, some of them are leaders over others.' So their leader comes forward and prays. When he finishes his prayer, Jesus takes his spear and goes towards the Dajjal. When the Dajjal sees him, he melts as lead melts. So he places his spear between his nipples and kills him. His companions are defeated, and on that day nothing will hide anyone of them, to the point that the tree will say to him: 'O believer, this is a disbeliever.' And the stone will say: 'O believer, this is a disbeliever'). Narrated by Ahmad (4/216-217) and Al-Hakim (4/478-479).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 96
  },
  {
    "serial_number": "104224",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 96,
    "volume_number": 1,
    "text": "I say: And its narrators are trustworthy narrators of Muslim except Ali bin Zaid - who is Ibn Jud'an - and he is weak. Second: From Jabir bin Abdullah, and his hadith has passed (71-73). Muslim (1/95) narrated the point of witness from it via another route from Abu Al-Zubayr: That he heard Jabir bin Abdullah raised [to the Prophet] with the wording: (A group of my nation will not cease fighting upon the truth, victorious until the Day of Resurrection. He said: Then Jesus son of Mary (peace be upon him) descends, and their leader says: Come, pray for us. He says: No, some of you are leaders over others, an honor from Allah for this nation). It is referenced in (Al-Sahihah) (1960). Al-Dani also narrated it (142/2). Third: From Abu Huraira, and his hadith has passed (p. 54) with the wording: (Then Jesus son of Mary (peace be upon him) descends from the sky and leads the people. When he raises his head from his bowing, he says: Allah hears those who praise Him. Allah will kill the Messiah Dajjal and the Muslims will prevail). Fourth: From Al-Nawwas bin Sam'an, and his hadith has passed (pp. 56-58). Fifth: From Aisha, and her hadith has passed (pp. 59-60). Sixth: Some companions of Muhammad (peace be upon him), and it has passed (91-92). Seventh: From Samura: That the Prophet (peace be upon him) used to say: (Indeed, the Dajjal is emerging, and he is blind in the left eye upon which is a thick film. And he cures",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 97
  },
  {
    "serial_number": "104225",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 97,
    "volume_number": 1,
    "text": "the blind and the leper, and revives the dead, and says to people: I am your Lord. So whoever says: You are my Lord: has been tempted. And whoever says: My Lord is Allah, until he dies, has been protected from his tribulation; there is no tribulation after it nor punishment upon him. He stays as long as Allah wills. Then Jesus son of Mary, peace be upon them both, comes from the West confirming Muhammad (peace be upon him) and upon his religion. He kills the Dajjal, then it is indeed the establishment of the Hour). Narrated by Ahmad (5/13). I say: Its chain is authentic were it not for the 'an'anah of Al-Hasan Al-Basri. However, Al-Hafiz in (Al-Fath) (6/478) affirmed that its chain is good. Eighth: From Abu Huraira also: That the Prophet (peace be upon him) said: (How will you be when the son of Mary descends [from the sky] among you and your Imam (and in a narration: and leads you) is from you?). Ibn Abi Dhi'b - one of its narrators - said: Do you know what (leads you from you) is? Leads you by the Book of your Lord, Blessed and Exalted, and the Sunnah of your Prophet (peace be upon him). Narrated by Al-Bukhari (6/384), Muslim (1/94), Abd al-Razzaq (20841), Ahmad (2/272, 336), Ibn Mandah (41/2), and Al-Bayhaqi in (Al-Asma') (p. 424), and the addition is his. And from a second route from him raised [to the Prophet] with the wording: (By the One in whose Hand is my soul, the son of Mary will surely descend among you as a just judge. He will break the cross, kill the swine, abolish war, and wealth will overflow until no one accepts it,",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 98
  },
  {
    "serial_number": "104226",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 98,
    "volume_number": 1,
    "text": "until a single prostration is better than the world and what is in it). Then Abu Huraira says: Read if you wish: {And there is none from the People of the Scripture but that he will surely believe in him before his death. And on the Day of Resurrection he will be against them a witness} [An-Nisa: 159]. Narrated by Al-Bukhari (6/382-383), Muslim (93-94), Al-Tirmidhi (2234) and he authenticated it, Al-Tayalisi (2/219 / 2782), and Ahmad (2/240, 272, 538). These three do not have the recitation of the verse. It is a narration of the two Sheikhs, Ibn Majah (2/516), Al-Ajurri (p. 381), Abd al-Razzaq (20840), Al-Dani (142/1-2), and Ibn Mandah in (Al-Iman) (41/1). And from a third route from him with the wording: (By Allah, the son of Mary will surely descend as a just judge. He will surely break the cross, kill the swine, abolish the Jizya [tax], leave the young camels so no one strives for them, and hatred, mutual hatred, and envy will surely disappear. He will surely call to wealth, but no one will accept it). Narrated by Muslim (1/94), Ahmad (2/494), Al-Ajurri (p. 380), and Ibn Mandah (41/2). And in a fourth - which is from Muhammad bin Sirin - from him raised [to the Prophet]: (Whoever lives among you is about to meet Jesus son of Mary as a guided leader and a just judge. He will break the cross, kill the swine, abolish the Jizya, and war will lay down its burdens). Narrated by Ahmad (2/411).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 99
  },
  {
    "serial_number": "104227",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 99,
    "volume_number": 1,
    "text": "I say: And its chain is authentic on the condition of the two Sheikhs. In a narration from Ibn Sirin, he said: (The son of Mary descends upon his nation and two yellow garments [Methnawi?] between the Adhan and the Iqamah. They say to him: Come forward. He says: Rather, your Imam should lead you in prayer; you are leaders over one another). Narrated by Abd al-Razzaq (20838). Its chain is authentic Maqtu' (stopped at the Tabi'i), and it has the ruling of being raised (Marfu') as Mursal. In another narration from Ma'mar, he said: (Ibn Sirin used to view that the Mahdi is the one behind whom Jesus prays). Narrated by Abd al-Razzaq (20839). In a fifth route from Abu Huraira raised [to the Prophet] with the wording: (Jesus son of Mary descends, kills the swine, obliterates the cross, the prayer is gathered for him, he gives wealth until it is not accepted, he abolishes the Kharaj [tax], and camps at Al-Rawha', performing Hajj or Umrah from there, or combining them both). He said: And Abu Huraira recited: {And there is none from the People of the Scripture but that he will surely believe in him before his death. And on the Day of Resurrection he will be against them a witness} [An-Nisa: 159]. Hanzala claimed that Abu Huraira said: (believe in him before his death): Jesus. I do not know if all of this is the hadith of the Prophet (peace be upon him) or something Abu Huraira said? Narrated by Ahmad (2/290-291). I say: Its chain is authentic on the condition of Muslim. He extracted from it his descending at (Al-Rawha')",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 100
  },
  {
    "serial_number": "104228",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, peace be upon him",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 100,
    "volume_number": 1,
    "text": "and raising the voice in Talbiyah (4/60). Likewise, Abd al-Razzaq (20842), Al-Dani (144/1), and Ibn Mandah (41/2) narrated it. In a sixth [narration] from him raised [to the Prophet]: (There is no prophet between me and him (meaning: Jesus), and he is descending. If you see him, recognize him: a man of medium height, reddish-white, between two yellowish garments, as if his head is dripping though no moisture touched it. He will fight the people for Islam, break the cross, kill the swine, and abolish the Jizya. Allah will destroy in his time all religions except Islam, and [Allah will destroy in his time] the Messiah [the Liar] Al-Dajjal. [And security will fall upon the earth until lions graze with camels, tigers with cows, and wolves with sheep, and children play with snakes without them harming them]. He will remain on earth for forty years, then he will die and the Muslims will pray over him [and bury him]). Narrated by Abu Dawud (2/214) and the context is his, Ibn Hibban (1902 and 1903), Ahmad (2/406 and 437), Ibn Jarir in (Al-Tafsir) (No. 7145), Al-Ajurri (p. 380), and Abd al-Razzaq (20845) who added: (And the call will be one for the Lord of the Worlds). It has a witness in the following route. I say: Its chain is authentic and Al-Hafiz authenticated it. It is referenced in (Silsilat Al-Ahadith Al-Sahihah) (2182). In a seventh [narration] from him raised [to the Prophet]: (The Messiah Jesus son of Mary is about to descend as a just judge and a fair leader...",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 101
  },
  {
    "serial_number": "104229",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 101,
    "volume_number": 1,
    "text": "so he will kill the swine, break the cross, and the call (to prayer/religion) will be one). It was narrated by Ahmad (2/394). I say: Its chain is Hasan (good). In an eighth narration from him, attributed to the Prophet (Marfu'), similar to it but without the last sentence, and adding: (And peace will return, and swords will be taken as sickles, and the venom of every venomous creature will go away, and the sky will send down its provision, and the earth will bring forth its blessing, until a child plays with a snake and it does not harm him, and the wolf grazes with the sheep and does not harm them, and the lion grazes with the cow and does not harm it). It was narrated by Ahmad (2/482-483) via Fulaih, from Al-Harith bin Fudayl Al-Ansari, from Ziyad bin Sa'd, from him. I say: Its chain, according to what Ibn Kathir said (1/169): (Good, strong, righteous). However, I have reservations about it from two aspects: First: That Ziyad bin Sa'd - who is the Madinan Ansari - was mentioned by Ibn Abi Hatim (1/2/532) from the narration of his son Sa'd bin Ziyad also from him, and he did not mention any disparagement or endorsement regarding him, though Ibn Hibban included him in (Al-Thiqat) (1/73). The other: That this Fulaih - who is Ibn Sulaiman Al-Khuza'i - although he is one of the narrators of the Two Sheikhs (Bukhari and Muslim), acts erroneously often, as Al-Hafiz said in (Al-Taqrib). I say: It is more appropriate to say: It is strong due to what preceded it.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 102
  },
  {
    "serial_number": "104230",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 102,
    "volume_number": 1,
    "text": "In a ninth narration from him, attributed to the Prophet (Marfu'), with the wording: (The Hour will not be established until the Romans land at Al-A'maq or Dabiq. An army consisting of the best of the people of the earth at that time will come out from Medina against them. When they arrange themselves in ranks, the Romans will say: 'Leave us and those who were taken as captives from amongst us so we may fight them.' The Muslims will say: 'No, by Allah, we will never abandon our brothers to you.' So they will fight them. Then one-third of them will be defeated, whom Allah will never forgive. One-third will be killed—they are the best of martyrs in the sight of Allah. And one-third will conquer, and they will never be afflicted by tribulation. They will conquer Constantinople (and in a narration: they will reach Constantinople and take spoils). And (in another route from him: Have you heard of a city, one side of which is on land and the other in the sea?) They said: Yes, O Messenger of Allah. He said: (The Hour will not be established until seventy thousand of the Children of Isaac invade it. When they come to it, they will dismount and will not fight with weapons nor throw arrows. They will say: 'La ilaha illa Allah wa Allahu Akbar' (There is no god but Allah and Allah is the Greatest), and one of its sides that is in the sea will fall. Then they will say a second time: 'La ilaha illa Allah wa Allahu Akbar', and its other side will fall. Then they will say a third time: 'La ilaha illa Allah wa Allahu Akbar', and it will be opened for them, and they will enter it and take spoils.) While they are dividing the spoils, having hung their swords on the olive trees, Satan will shout among them: 'The Messiah [Ad-Dajjal] has taken your place among your families.' So they will leave, but that is false [so they leave everything and return]. When they come to Sham (Syria), he will emerge. While they are preparing for battle and straightening the ranks, the prayer [the Morning Prayer] is established, and Jesus the son of Mary, peace be upon him, will descend and lead them. When the enemy of Allah sees him, he will dissolve just as",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 103
  },
  {
    "serial_number": "104231",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 103,
    "volume_number": 1,
    "text": "salt dissolves in water. If he were to leave him alone, he would dissolve until he perished, but Allah will kill him with his hand, showing them his blood on his spear). Narrated by Muslim (8/175-176), and the context is his; similarly, the other path is his (8/187-188), and the additions are from it. Also narrated by Al-Dani (113/1-2 and 121/2) from both paths, and Al-Hakim (4/482), with the other narration and addition belonging to him, saying: (Authentic according to the conditions of Muslim, though they did not extract it). He erred in his supplementation to Muslim. I say: There is corroborating evidence for part of it from the hadith of Abdullah bin Mas'ud, narrated by Yusayr bin Jabir, who said: A red wind raged in Kufa, and a man came who had nothing to say but: 'O Abdullah bin Mas'ud, the Hour has come.' He [Ibn Mas'ud] sat up - he was reclining - and said: 'The Hour will not be established until inheritance is not divided and spoils are not rejoiced over.' Then he gestured with his hand like this and moved it towards Sham (Syria) and said: 'An enemy gathering against the people of Islam, and the people of Islam gathering against them.' I said: 'Do you mean the Romans?' He said: 'Yes. And at that fighting, there will be a severe apostasy. The Muslims will organize a vanguard pledged to death, not to return unless victorious. They will fight until the night intervenes between them, and both sides will return without victory, and the vanguard will be wiped out. Then the Muslims will organize a vanguard pledged to death, not to return unless victorious. They will fight until the night intervenes between them, and both sides will return without victory, and the vanguard will be wiped out. Then",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 104
  },
  {
    "serial_number": "104232",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 104,
    "volume_number": 1,
    "text": "the Muslims will organize a vanguard pledged to death, not to return unless victorious. They will fight until evening, and both sides will return without victory, and the vanguard will be wiped out. Then on the fourth day, the rest of the people of Islam will advance against them, and Allah will decree defeat upon them [the enemy]. They will kill greatly - he either said: the likes of which has not been seen, or said: has not been seen - such that a bird will pass by their flanks and will not pass them before falling dead. The sons of a father who were one hundred will be counted, and none will be found remaining of them except one man. So with what spoils can one rejoice? Or what inheritance can be divided? While they are in that state, they will hear of an affliction greater than that. A crier will come to them saying that the Dajjal has taken their place among their offspring. So they will discard what is in their hands and advance, sending ten horsemen as a scout party. The Messenger of Allah, peace be upon him, said: (I surely know their names, the names of their fathers, and the colors of their horses. They are the best horsemen on the face of the earth on that day).' Narrated by Ahmad (1/435) and Muslim (8/177-178). In a tenth narration from him, attributed to the Prophet: (Jesus the son of Mary will descend, break the cross, kill the swine, abolish the Jizyah, and Allah, Mighty and Majestic, will destroy the Dajjal in his time, and the Word will be established for Allah, Lord of the Worlds). Narrated by Al-Dani (143/2) and Ibn Mandah (41/2), and its chain is good (Jayyid). These are ten paths for the hadith of Abu Hurairah alone, so it is Mutawatir (mass transmitted) from him in general, though not in detail.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 105
  },
  {
    "serial_number": "104233",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 105,
    "volume_number": 1,
    "text": "The Ninth Hadith: From Hudhayfah bin Al-Yaman, like the hadith of Abu Hurairah which I cited just now, but more complete. It mentions the mountain pass of Afiq. It states: (When they stand to pray, Jesus the son of Mary, blessings of Allah be upon him, will descend as their Imam and pray with them (1). When he finishes, he will say like this: 'Clear the way between me and the enemy of Allah.' (Abu Hazim said: Abu Hurairah said: He will dissolve as fat dissolves in the sun. Abdullah bin Amr said: As salt dissolves in water). And Allah will grant the Muslims power over them, so they will break the cross, kill the swine, and abolish the Jizyah). Narrated by Ibn Mandah (95/2) and Al-Hakim (4/490-491) who said: (Authentic according to the conditions of Muslim), and Al-Dhahabi agreed. I say: It contains Khalaf bin Khalifa Al-Ashja'i, who, although a truthful narrator of Muslim, became confused in his later age, so his hadith is good for corroboration. As for Al-Hafiz's statement in (6/478) after attributing it to Ibn Mandah: (Authentic chain), it is an oversight or leniency. The Tenth: From Hudhayfah bin Asid who said: (...But the Dajjal will emerge amidst people's hatred, religious lightness, and bad relations. He will visit every watering place, and the earth will be folded for him like the folding of a ram's skin until he comes to Medina. He will overcome its outskirts but will be prevented from its interior. Then [he will go to] the Mount of Ilyaa [Jerusalem] and besiege a group (1) Meaning: In Jerusalem. As for in Damascus, he prays following the Mahdi, as indicated by other preceding hadiths.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 106
  },
  {
    "serial_number": "104234",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 106,
    "volume_number": 1,
    "text": "of Muslims. Those in charge will say to them: 'What are you waiting for regarding this tyrant? Fight him until you meet Allah or He grants you victory.' So they resolve to fight him when morning comes. When they wake up, Jesus the son of Mary is with them. He kills the Dajjal and defeats his companions, such that the trees, stones, and clods of earth will say: 'O believer, this is a Jew with me, so kill him.') Narrated by Al-Hakim (4/529-530) and Abdul Razzaq (20827) in summary. Al-Hakim said: (Authentic chain), and Al-Dhahabi agreed, and it is as they said. The Eleventh: From some of the Companions of Muhammad, peace be upon him, and his hadith has passed (91-92). 32 - This is corroborated by the hadith of Hudhayfah bin Al-Yaman mentioned shortly before, which contains: (When he finished (meaning: Jesus from the prayer), he said like this: Clear the way between me and the enemy of Allah). 33 - This is corroborated by several hadiths: First: From Anas who said: (The Dajjal will be followed by seventy thousand Jews of Isfahan wearing Persian shawls [Tayalisah]). Narrated by Muslim (8/207), Ibn Hibban (6760), and Ahmad (3/224). See: (Al-Sahihah) (3080).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 107
  },
  {
    "serial_number": "104235",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 107,
    "volume_number": 1,
    "text": "Second: From Jabir, and it has passed (p. 89-90) with the wording: (With him will be seventy thousand Jews, each man among them having a sash and an adorned sword). Third: From Uthman bin Abi Al-Aas, similar to it but without mentioning the sword, and it has passed (p. 94-95). Fourth: From Abu Sa'id, attributed to the Prophet (Marfu'), similar to it also without the sword. Narrated by Abdul Razzaq (20825) via Abu Harun from him, but Abu Harun is abandoned (Matruk). Fifth: From Abu Hurairah, attributed to the Prophet (Marfu') with the wording: (The Dajjal will surely descend upon (Khuz) and (Kerman) with seventy thousand whose faces are like hammered shields). Narrated by Ahmad (2/337), and its narrators are trustworthy except for the 'an'ana [ambiguous mode of transmission] of Ibn Ishaq. 34 - This paragraph's corroborations have preceded from the narration of a group of Companions: First: Jabir (p. 71-73). Second: Some Companions of Muhammad, peace be upon him (p. 91-92). Third: Uthman bin Abi Al-Aas (p. 94-95). Fourth: Abu Hurairah (p. 102-103).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 108
  },
  {
    "serial_number": "104236",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 108,
    "volume_number": 1,
    "text": "Fifth: Hudhayfah bin Al-Yaman (p. 105). 35 - I did not find a corroborating evidence for it. 36 - Concerning it, there are hadiths: First: From Mujammi' bin Jariyah Al-Ansari who said: I heard the Messenger of Allah, peace be upon him, say: (The son of Mary will kill the Dajjal at the Gate of Ludd). Narrated by Al-Tirmidhi (2245), Ibn Hibban (1901), Al-Tayalisi (2/219), Abdul Razzaq (20835), Ahmad (3/420), and Al-Dani (143/1 & 2). Al-Tirmidhi said: (Hasan Sahih hadith). I say: Perhaps he means due to its following corroborations, otherwise, the chain includes Ubaydullah bin Abdullah bin Tha'labah Al-Ansari, who is unknown (Majhul), and there is disagreement regarding his name. Second: From An-Nawas bin Sam'an, attributed to the Prophet (Marfu'), similar to it, and his hadith has passed (p. 56-58). Third: From Aisha, may Allah be pleased with her, attributed to the Prophet (Marfu'), similar to it, and her hadith has passed (p. 59-60). And Abdul Razzaq narrated (20836) with an authentic chain: That Umar asked a man from the Jews about something? He spoke to him, and Umar believed him. Then Umar said to him: I have tested your truthfulness, so tell me about the Dajjal. He said: By the God of the Jews, the son of Mary will kill him at the courtyard of (Ludd).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 109
  },
  {
    "serial_number": "104237",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 109,
    "volume_number": 1,
    "text": "37 - Concerning it, there are hadiths: First: From Uthman bin Abi Al-Aas, which is at the end of his previously mentioned hadith (p. 94-95). Second: From Jabir, which is also at the end of his previously mentioned hadith (71-73). Third: From Hudhayfah bin Asid, and it passed also (105-106). Fourth: From Ibn Umar, and it passed (p. 88), but he has another path more authentic than that one with the wording: (The Jews will fight you, and you will be given dominion over them, until the stone says: O Muslim, this is a Jew behind me, so kill him). Narrated by Abdul Razzaq (20837), and from him Ahmad (2/149), and Al-Tirmidhi (2237) who said: (Hasan Sahih hadith). Then Ahmad (2/122 & 131), Al-Bukhari (6/78 & 478), and Muslim (8/188) narrated it via paths other than Abdul Razzaq. Also narrated by Al-Dani (65/1). Fifth: From Abu Hurairah: That the Messenger of Allah, peace be upon him, said: (The Hour will not be established until the Muslims fight the Jews, and the Muslims will kill them until the Jew hides behind the stone and the tree, and the stone or the tree says: O Muslim,",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 110
  },
  {
    "serial_number": "104238",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 110,
    "volume_number": 1,
    "text": "O servant of Allah, this is a Jew behind me, so come and kill him. Except for the Gharqad, for it is from the trees of the Jews). Narrated by the Two Sheikhs (Bukhari and Muslim), Ahmad (2/398, 417, 530), Al-Khatib (7/207), and Al-Dani (64/2 - 65/1). 38 - All hadiths agree that the days of Dajjal during which he travels the earth are forty, but they differed regarding these days: are they forty years as in this narration, or forty days and nights as in other narrations? The correct view that must be asserted is the second, because they are more authentic and numerous as will be clarified. As for this narration, along with the weakness of its chain as clarified at the beginning of this research - I have not found for it a valid corroborating evidence that can be relied upon, except perhaps the hadith of Shahr bin Hawshab previously mentioned (p. 77) from Asma bint Yazid in his narration from her with the wording: (The Dajjal will stay on earth forty years; the year like a month, the month like a week, the week like a day, and the day like the burning of a palm branch in fire). However, it is a rejected (Munkar) hadith due to the weakness of Shahr and his being solitary in narrating it, so it does not serve as a witness. Nor is it strengthened by what Suhail bin Abi Salih narrated from his father from Abu Hurairah, attributed to the Prophet: (The Hour will not be established until time contracts, so the year will be like a month, the month like a week, the week like a day, the day like an hour, and the hour like the burning of a palm branch or leaf).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 111
  },
  {
    "serial_number": "104239",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 111,
    "volume_number": 1,
    "text": "Narrated by Ahmad (2/537-538), Abu Ya'la (302/1), and Ibn Hibban (1888). I say: Its chain is authentic according to the conditions of Muslim, and so said Ibn Kathir (1/213). It has a witness from the hadith of Anas bin Malik attributed to the Prophet (Marfu') with it. Narrated by Al-Tirmidhi (2333) who considered it Ghareeb (strange). And another from the Mursal of Sa'id bin Al-Musayyib narrated by Al-Dani (14/1). I say: This does not strengthen the hadith of Shahr because it does not mention the Dajjal in it, as is apparent; it is general. And it is not permissible to restrict it - meaning: the hadith of Shahr due to its weakness - especially since the result after restriction conflicts with other narrations, and this is impermissible as is obvious to those of understanding. As for the narrations referred to, which explicitly state that the forty of Dajjal are days and not years, they are from the narration of a group of Companions, and they have all passed, so I suffice with pointing to their narrations: First: An-Nawas bin Sam'an, passed (p. 56-58). Second: Nufayr father of Jubayr, passed (p. 59). Third: A man from the Companions of the Prophet, peace be upon him, passed (p. 71). Fourth: Jabir bin Abdullah, passed (p. 71-73 & 87). Fifth: Abu Hurairah, passed (p. 54). I say: These authentic hadiths are not contradicted by the hadith of Abdullah bin Amr who said: The Messenger of Allah, peace be upon him, said:",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 112
  },
  {
    "serial_number": "104240",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 112,
    "volume_number": 1,
    "text": "(The Dajjal will emerge in my Ummah and stay among them for forty days, or forty nights, or forty months. Then Allah, Mighty and Majestic, will send Jesus the son of Mary - as if he is Urwah bin Mas'ud Al-Thaqafi - so he will seek him and destroy him. Then people will remain after him for seven years with no enmity between any two. Then Allah will send a cold wind from the direction of Sham, so no one having an atom's weight of faith in his heart will remain on the face of the earth but that it will take him...) Narrated by Ahmad (2/166) and Muslim (8/201). Al-Hakim added it as a supplement (to the Two Sahihs) (4/543-544 & 550-551) but erred, and Ibn Hibban (7309) and Ibn Mandah (98/2). I say: This does not contradict the previous hadiths because of the uncertainty in it, and it appears it is from one of its narrators. The one who is uncertain has no knowledge, while those [others] were certain about the forty days, and the one who knows is a proof over the one who does not. It is possible that the uncertainty was from the Prophet, peace be upon him, himself, occurring before the revelation came to him regarding the duration of those days, then it came to him. This is supported by the hadith of Abu Hurairah: (In forty days, Allah knows best their duration). Ibn Hibban added: (Allah knows best their duration (twice)). 39 - This context is weak and strange, contradicting the authentic hadiths that were previously indicated, for what is preserved in them is: (Forty days; a day like a year, a day like a month, a day like a week, and the rest of his days like your days).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 113
  },
  {
    "serial_number": "104241",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 113,
    "volume_number": 1,
    "text": "40 - This paragraph has no mention in those authentic hadiths. It is only established in the hadith of Abu Hurairah previously mentioned (p. 110) with the wording: (The Hour will not be established until time contracts... and the hour becomes like the burning of a palm branch). It does not mention the Dajjal as previously stated. 41 - I found no corroborating evidence for it at all. 42 - I found no basis for it with this context mentioning short days. What is preserved is what passed in the hadith of An-Nawas and Nufayr father of Jubayr: (We said: O Messenger of Allah, that day which is like a year, will the prayer of one day suffice us in it? He said: No, estimate for it its measure). 43 - This paragraph in its entirety came in the hadith of Abu Hurairah mentioned previously via numerous paths (p. 96-103). 44 - It is corroborated by the hadith of Tawus who narrates it saying: (Jesus the son of Mary will descend as a guided leader and a just ruler. When he descends, he will break the cross, kill the swine, and abolish the Jizyah. The religion will be one, and security will be placed on earth such that the lion will be with the cow thinking it is its bull, and the wolf will be with the sheep thinking it is its dog. The venom of every venomous creature will be removed until a man places his hand on the head of a snake and it does not harm him, and until the young girl chases away the lion just as the puppy of a small dog runs away. The Arabian horse will cost twenty dirhams, and the ox will cost such and such. The earth will return",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 114
  },
  {
    "serial_number": "104242",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 114,
    "volume_number": 1,
    "text": "to its state during the time of Adam. The bunch - meaning: of grapes - will be eaten by a group of people, and the pomegranate will be eaten by a group of people). Narrated by Abdul Razzaq (20843). I say: Its chain is Mursal Sahih; its narrators are trustworthy narrators of the Two Sheikhs. 45 - Evidence for this paragraph has preceded in the hadith of Tawus before it and in the paths of the hadith of Abu Hurairah referred to just now. One path remains which contains evidence for what was not previously corroborated - like the first sentence of it and others - so it was necessary to cite it. It is from the narration of Zaid bin Aslam from a man from Abu Hurairah who said: (The Hour will not be established until Jesus the son of Mary descends as a just ruler, and Quraysh are [stripped] (1) of authority, the swine is killed, the cross is broken, the Jizyah is abolished, the prostration becomes one for the Lord of the Worlds, war lays down its burdens, the earth is filled with Islam just as vessels are filled with water, the earth becomes like a silver platter (meaning: table), hatred and enmity are removed, the wolf is among the sheep as if it were their dog, and the lion is among the camels as if it were their stallion). Narrated by Abdul Razzaq (20844) via Ma'mar from him.",
    "foot_note": "1. Blank space in the original. Margin note: (The word drawn in the dotted place is (beiter)). I say: I think the correct word is what I established in brackets [stripped]. \n2. Original: (Like a bull)",
    "book_id": "692",
    "new_page_number": 115
  },
  {
    "serial_number": "104243",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 115,
    "volume_number": 1,
    "text": "I say: Its chain consists entirely of trustworthy narrators except the man who was not named, who is among the senior Successors (Tabi'in) if not a Companion, for Zaid is a Successor who narrated from a group of Companions including Abu Hurairah himself, Ibn Umar, and others. Even if it is Mawquf (stopped at the Companion), it has the ruling of Marfu' (raised to the Prophet) because it concerns unseen matters that cannot be said by mere opinion, especially since most of it has come as Marfu' as previously mentioned. The sentence about the pomegranate from this paragraph has a witness in the hadith of An-Nawas previously extracted (p. 56-58), although it was not cited in its entirety containing the witness. 46 & 47 - I found no corroborating evidence for them at all. 48 - It is corroborated by the hadith of Asma bint Yazid Al-Ansariyyah previously mentioned (p. 57-76). 49 - It is corroborated by four hadiths: First: The hadith of Asma referred to just now. Second: The hadith of Aisha previously mentioned (p. 93-94). Third: The hadith of Ibn Umar: That the Messenger of Allah, peace be upon him, was asked about the food of the believers in the time of Dajjal? He said: (The food of the angels). They said: And what is the food of the angels? He said: (Their food is their speech of Tasbih [glorifying Allah] and Taqdis [sanctifying Allah]. Whoever's speech on that day is Tasbih and Taqdis, Allah will remove hunger from him so he will not fear hunger).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 116
  },
  {
    "serial_number": "104244",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 116,
    "volume_number": 1,
    "text": "Narrated by Al-Hakim (4/511) who said: (Authentic chain according to the conditions of Muslim). Al-Dhahabi rejected it saying: (I say: Nay, for Sa'id is accused [of fabrication] and ruined). I say: Meaning Sa'id bin Sinan Al-Homsi. Fourth: From Asma bint Umais: That the Prophet, peace be upon him, entered upon her for some need then left. She complained to him about need, so he said: (How will you be when you are tested with a servant for whom the rivers of the earth and its fruits are subjugated? Whoever follows him, he feeds him and makes him a disbeliever, and whoever disobeys him, he deprives him and forbids him?). I said: O Messenger of Allah, the servant girl sits at the oven for an hour to bake her bread and I almost get tempted in my prayer [by hunger/impatience], so how will it be for us when that happens? He said: (Indeed Allah will protect the believers on that day with what He protected the angels: Tasbih. Between his eyes is 'Kafir' which every believer, literate or illiterate, will read). Al-Haythami said (7/346): (Narrated by Al-Tabarani, and it contains a narrator who was not named, but the rest of its narrators are narrators of the Sahih). In summary, the hadith of Abu Umamah, even if its chain has weakness, it has become clear from this extraction and verification - the likes of which is rare - that it is an authentic hadith in most of its paragraphs due to the corroborating evidences mentioned for each paragraph.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 117
  },
  {
    "serial_number": "104245",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 117,
    "volume_number": 1,
    "text": "Therefore, my intention has turned towards compiling a treatise from the sum of what is established in these hadiths regarding the story of the Antichrist (Al-Masih Ad-Dajjal), the descent of Jesus peace be upon him, and his killing of him, following the context of this hadith of Abu Umamah, avoiding from it what I did not find a witness for, and placing every paragraph from the other hadiths in its appropriate place within it. Here is now an index of the names of the Companions whose hadiths I have extracted here in this research, and cited some of their paragraphs in various places of it, to facilitate reference:",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 118
  },
  {
    "serial_number": "104246",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 119,
    "volume_number": 1,
    "text": "Section Four: Index of names of narrators from the Companions and Successors whose hadiths were extracted previously. The numbers following the names are page numbers: 1 - Ibn Abbas: Abdullah (p. 54, 69) (Hib 8/281). 2 - Ibn Umar: Abdullah (p. 51, 62, 64, 88, 109, 115) (Hib 8/273). 3 - Ibn Masud: Abdullah (p. 103-104). 4 - Abu Umamah (p. 41-46). 5 - Abu Bakra Al-Thaqafi (p. 70, 85, 86) (Hib 8/225, 284). 6 - Abu Sa'id (p. 63, 64, 65, 77-78, 80, 88, 107) (Hib 8/283, M 8/199-200, Kh 1882, 7132). 7 - Abu Ubaidah (Hib 8/273). 8 - Abu Hurairah (p. 53, 54, 61, 64, 65, 66, 84, 93, 96, 97-104, 107, 109-110, 113, 114) (Hib 8/280, 285, 286, 287, 287, 288). 9 - Ubay bin Ka'b (Hib 8/281). 10 - Asma bint Umais (p. 116). 11 - Asma bint Yazid Al-Ansariyyah (p. 75-76, 110).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 119
  },
  {
    "serial_number": "104247",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 120,
    "volume_number": 1,
    "text": "12 - Umm Salama (p. 60). 13 - Umm Sharik (p. 93) (Hib 8/282). 14 - Anas bin Malik (p. 50, 53, 86, 90, 106) (Hib 8/281, 282, 284). 15 - Some Companions of the Messenger of Allah, peace be upon him (p. 67). 16 - Some Companions of Muhammad, peace be upon him (p. 91-92). 17 - Jabir bin Abdullah (p. 64, 70, 71-73, 77, 86, 87, 89-90, 91, 92, 93, 96) (Hib 8/274, 289). 18 - Hudhayfah bin Asid (p. 105-106). 19 - Hudhayfah bin Al-Yaman (p. 50-51, 69, 70, 105) (Hib 8/282, 285). 20 - Al-Hasan (p. 55). 21 - A man from the Companions of the Prophet, peace be upon him (p. 69, 71, 79). 22 - Sa'd bin Abi Waqqas (p. 62). 23 - Safinah (p. 73). 24 - Samurah (p. 67, 96-97). 25 - Tawus (p. 113-114). 26 - Aisha (p. 59, 61-62, 83, 84, 93-94) (Hib 8/290). 27 - Ubadah bin Al-Samit (p. 67).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 120
  },
  {
    "serial_number": "104248",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 121,
    "volume_number": 1,
    "text": "28 - Abdullah bin Umar (See: Ibn Umar). 29 - Abdullah bin Amr (p. 79, 111-112). 30 - Abdullah bin Mughaffal (p. 50) (Hib 8/274). 31 - Abdullah bin Mughnam (p. 65-66, 79). 32 - Uthman bin Abi Al-Aas (p. 94-95). 33 - Ali bin Abi Talib (p. 74, 94). 34 - Fatima bint Qais (p. 82-83) (Hib 8/277). 35 - Mujammi' bin Jariyah Al-Ansari (p. 108). 36 - Mihjan bin Al-Adra' (p. 87-88, 89). 37 - Muawiyah bin Haydah (p. 54). 38 - Al-Mughirah (Hib 8/274, 282-283). 39 - Nafi' bin Utbah (Hib 8/285). 40 - Nufayr bin Malik father of Jubayr (p. 59). 41 - An-Nawas bin Sam'an (p. 56-58, 79, 82). 42 - Hisham bin Amir (p. 49). End.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 121
  },
  {
    "serial_number": "104249",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 123,
    "volume_number": 1,
    "text": "Section Five: Containing the context of the story with added paragraphs and their extraction symbols pointing to their extractors which were detailed in Section Three.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 122
  },
  {
    "serial_number": "104250",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 125,
    "volume_number": 1,
    "text": "Symbols: Aa: Al-Ajurri in 'Al-Shari'ah'. T: Al-Tirmidhi. Hib: Ibn Hibban in 'Al-Sahih'. Hil: Abu Nu'aym in 'Al-Hilyah'. Ham: Ahmad in 'Al-Musnad'. Han: Hanbal ibn Ishaq in 'Al-Fitan'. Kh: Al-Bukhari. Khab: Abu Nu'aym in 'Akhbar Asbahan'. Khaz: Ibn Khuzaimah in 'Al-Tawhid'. D: Abu Dawood. Sa': Ibn Sa'd in 'Al-Tabaqat'. Tab: Al-Tabarani in 'Al-Mu'jam Al-Kabir'. Tas: Al-Tabarani in 'Al-Awsat'. Tas: Al-Tabarani in 'Al-Saghir'. Tay: Al-Tayalisi in 'Al-Musnad'. 'A: Ibn Abi Asim in 'Al-Sunnah'. 'Ab: Abdul Razzaq in 'Al-Musannaf'. 'Ad: Ibn Adi in 'Al-Kamil'. 'As: His son Abdullah in 'Al-Sunnah'. 'Aq: Al-Uqayli in 'Al-Du'afa'. Q: Agreed upon (Bukhari & Muslim). K: Al-Hakim in 'Al-Mustadrak'. Kar: Ibn Asakir in 'Al-Tarikh'. M: Muslim. Ma: Malik in 'Al-Muwatta'. Mat: Ibn Mandah in 'Al-Tawhid'. Maj: Ibn Majah. Man: Ibn Mandah in 'Al-Iman'. Mi: Al-Darimi. N: Al-Nasa'i. Ni: Abu Amr Al-Dani in 'Al-Fitan'. Ha: Al-Bayhaqi in 'Al-Asma'.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 123
  },
  {
    "serial_number": "104251",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 127,
    "volume_number": 1,
    "text": "The Story of the Antichrist (Al-Masih Ad-Dajjal) and the Descent of Jesus, Peace and Blessings Be Upon Him, and his Killing of him, according to the context of the narration of Abu Umamah, may Allah be pleased with him, added to it what is authentic from others among the Companions, may Allah be pleased with them.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 124
  },
  {
    "serial_number": "104252",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 129,
    "volume_number": 1,
    "text": "1 - O People! There has never been a tribulation (fitnah) on the face of the earth since Allah created the progeny of Adam - [nor will there be until the Hour is established] - greater than the tribulation of the Dajjal. [And no one will be saved from what is before it unless he is saved from it] [And he does not harm a Muslim]. 2 - And indeed, Allah has not sent a prophet except that he warned his nation of the [One-eyed] Dajjal. [I surely warn you of him]. 3 - And I am the last of the Prophets, and you are the last of the nations. 4 - And he is emerging among you inevitably. [It is true, and as for it being near, everything that is coming is near]. [He only emerges due to an anger that he becomes angry] and [he does not emerge until inheritance is not divided and spoils are not rejoiced over].",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 125
  },
  {
    "serial_number": "104253",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 130,
    "volume_number": 1,
    "text": "5 - If he emerges while I am among you, then I am the advocate for every Muslim; and if he emerges after me, then every person is his own advocate, and Allah is my successor over every Muslim. (And in the hadith of Umm Salama: If he emerges after I die, Allah will suffice you against him through the righteous). 6 - And he emerges [from [a land] in the East] [called: (Khurasan)] [among the Jews of Isfahan] [their faces appearing like hammered shields] from a road between Sham (Syria) and Iraq. He spreads corruption to the right [and spreads corruption] to the left. O servants of Allah, stand firm. [Three times].",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 126
  },
  {
    "serial_number": "104254",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 131,
    "volume_number": 1,
    "text": "7 - I will describe him to you with a description that no prophet before me has described him with. (And in the hadith of Ubadah: I have told you about the Dajjal until I feared you would not understand). 8 - He starts by saying: 'I am a prophet,' but there is no prophet after me. 9 - Then he praises again and says: 'I am your Lord.' But you will not see your Lord until you die. 10 - And he is one-eyed [wiped] [left eye] [having a thick film on it] [green like a floating star] [his right eye looks like a floating grape] [not protruding nor sunken] [with thick hair] [Beware,",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 127
  },
  {
    "serial_number": "104255",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 132,
    "volume_number": 1,
    "text": "whatever is hidden from you regarding his state, let it not be hidden from you] that your Lord is not one-eyed [Beware, whatever is hidden from you regarding his state, let it not be hidden from you that your Lord is not one-eyed] [Three times] [and he pointed with his hand to his eyes] [and that you will never see your Lord until you die]. 11 - [He walks on earth, while the earth and sky belong to Allah]. 12 - [He is a young man with curly hair, I liken him to Abdul Uzza bin Qatan] [short, pigeon-toed, intense black eyes] [white complexion]. 13 - [And he is dark, curly-haired] [with thick hair].",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 128
  },
  {
    "serial_number": "104256",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 133,
    "volume_number": 1,
    "text": "14 - And written between his eyes is: Kafir (Disbeliever), read by [whoever hates his action, or read by] every believer, literate or illiterate. 15 - And part of his trial is that he has with him a paradise and a fire [and a river and water] [and a mountain of bread] [and there comes with him the likeness of Paradise and Hell]. His fire is paradise and his paradise is fire - [Al-Mughirah bin Shu'bah asked him about him? He said: I said: They say: He has with him mountains of bread and meat and a river of water? He said: He is too insignificant to Allah for that to be (reality)] (And in another hadith: [With him are two flowing rivers; one - to the eye - is white water, and the other - to the eye - is blazing fire] [So whoever among you encounters that and wants water, let him drink from that which he sees as fire] [and let him close [his eyes] then lower",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 129
  },
  {
    "serial_number": "104257",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 134,
    "volume_number": 1,
    "text": "[his head] for he will find it to be water [cold and sweet] [good] [so do not hesitate]. And in another: Whoever enters his river, his reward falls and his sin is established, and whoever enters his fire, his reward is established and his sin falls). 16 - So whoever is tested with his fire, let him seek help from Allah and read [over him] the opening verses of Surah (Al-Kahf) [for it is your protection from his trial]. 17 - And part of his trial is that he says to a Bedouin: 'Do you see, if I resurrected your father and mother for you, would you testify that I am your Lord?' He says: 'Yes.' So two devils impersonate his father and mother for him and say: 'O my son, follow him for he is your Lord.' 18 - And part of his trial is that he overpowers a single soul and kills him, sawing him with a saw until he is thrown as two halves. 19 - And part of his trial is that he passes by a clan [and calls them] but they reject him [so he turns away",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 130
  },
  {
    "serial_number": "104258",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 135,
    "volume_number": 1,
    "text": "from them] and no livestock remains for them except that it perishes. 20 - And part of his trial is that he passes by a clan [and calls them] and they believe him [and respond to him]. So he commands the sky to rain and it rains, and the earth to grow vegetation and it grows, until their cattle return from that day of theirs fatter than they ever were, their flanks wider and their udders fuller. 21 - And he passes by a ruin and says to it: 'Bring out your treasures,' so its treasures follow him like drone bees. 22 - [He emerges in [a time of dispute among people and division] (and) hatred among people, lightness of religion, and bad relations. He enters every watering place, and the earth is folded for him like the folding of a ram's skin]. 23 - [And he does not emerge until the Romans land at Al-A'maq or Dabiq [gathering against the people of Islam and the people of Islam gathering against them]. An army comes out to them from Medina consisting of",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 131
  },
  {
    "serial_number": "104259",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 136,
    "volume_number": 1,
    "text": "of the best people of the earth at that time. When they arrange their ranks, the Romans say: 'Leave us and those who were taken captive from us so we may fight them.' The Muslims say: 'No. By Allah, we will not abandon our brothers to you.' So they fight them. [And at that fighting there will be severe apostasy. The Muslims will organize a vanguard pledged to death, not to return unless victorious. They will fight until night intervenes between them, and both sides return without victory, and the vanguard is wiped out. Then the Muslims will organize a vanguard pledged to death, not to return unless victorious. They will fight until night intervenes between them, and both sides return without victory, and the vanguard is wiped out. Then the Muslims will organize a vanguard pledged to death, not to return unless victorious. They will fight until evening, and both sides return without victory, and the vanguard is wiped out. Then on the fourth day, the rest of the people of Islam will advance against them]. Then one-third will be defeated, whom Allah will never forgive. One-third will be killed - [they are] the best of martyrs in the sight of Allah. And one-third will conquer, and they will never be afflicted by tribulation. [Allah will decree defeat upon them (the Romans), and they will be killed in a slaughter - either he said: the likes of which has not been seen, or said: has not been seen - such that a bird will pass by their flanks and will not pass them before falling dead. The sons of a father who were one hundred will be counted, and none will be found remaining of them except one man. So with what spoils can one rejoice, or what inheritance can be divided?]. They will reach Constantinople and conquer it. (And in a narration: Have you heard of a city, one side of which is on land and the other in the sea? They said: Yes, O Messenger of Allah. He said: The Hour will not be established until seventy thousand of the Children of Isaac invade it. When they come to it, they will dismount and will not fight with weapons nor throw arrows. They will say: 'La ilaha illa Allah wa Allahu Akbar', and one of its sides that is in the sea will fall. Then they will say a second time: 'La ilaha illa Allah wa Allahu Akbar', and its other side will fall.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 132
  },
  {
    "serial_number": "104260",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 137,
    "volume_number": 1,
    "text": "Then they will say a third time: 'La ilaha illa Allah wa Allahu Akbar', and it will be opened for them, and they will enter it and take spoils). While they are dividing the spoils - having hung their swords on the olive trees - Satan shouts among them: 'The Messiah [Ad-Dajjal] has taken your place among your families.' [So they discard what is in their hands] and leave, but that is false. [They send ten horsemen as a scout party. The Messenger of Allah, peace be upon him, said: (I surely know their names, the names of their fathers, and the colors of their horses. They are the best horsemen on the face of the earth on that day)]. When they come to Sham (Syria), he emerges]. 24 - And there remains nothing of the earth but he treads upon it and prevails over it except [four mosques: the Mosque of] Mecca, the [Mosque of] Medina, [Al-Tur (Sinai), and Al-Aqsa Mosque]. 25 - And his days are forty days; a day like a year, a day like a month, a day like a week, and the rest of his days like your days. They said: That day which is like a year, will the prayer of one day suffice us in it? He said: No, estimate for it its measure. They said: How is his speed in the earth? He said: Like the rain driven by the wind].",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 133
  },
  {
    "serial_number": "104261",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 138,
    "volume_number": 1,
    "text": "26 - Before the emergence of the Dajjal, there are three severe years in which people suffer severe hunger. Allah commands the sky in the first year to withhold one-third of its rain, and commands the earth to withhold one-third of its vegetation. Then He commands the sky in the second year to withhold two-thirds of its rain, and commands the earth to withhold two-thirds of its vegetation. Then He commands the sky in the third year to withhold all its rain, so not a drop falls, and commands the earth to withhold all its vegetation, so no green thing grows. No hoofed animal remains except that it perishes, except what Allah wills. It was said: What will people live on in that time? He said: Tahlil (saying La ilaha illa Allah), Takbir (saying Allahu Akbar), Tasbih (saying Subhan Allah), and Tahmid (saying Alhamdulillah). That will take the place of food for them. 27 - He does not come to Mecca and Medina from any of their passes except that angels meet him with unsheathed swords. 28 - [There is no town that the terror of the Messiah [Ad-Dajjal] does not reach except Medina. [It has on that day seven gates] on every pass of its passes are two angels defending it from the terror of the Messiah]. 29 - Until he camps at the marsh [the marsh of Al-Jurf] [behind Uhud] [and sets up his tent].",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 134
  },
  {
    "serial_number": "104262",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 139,
    "volume_number": 1,
    "text": "30 - Then Medina will shake with its inhabitants three times, and no hypocrite man or woman will remain except they go out to him. It expels the impurity from it just as the bellows expels the impurity of iron. That day is called the Day of Deliverance. [And the majority of those who go out to him are women]. 31 - [Then a man from the believers heads towards him [filled with youth] [he is the best of people on that day or among the best]. The armed guards - the guards of Dajjal - meet him and say to him: 'Where are you heading?' He says: 'I am heading to this one who has emerged.' He said: They say to him: 'Do you not believe in our lord?' He says: 'There is nothing hidden about our Lord.' They say: 'Kill him.' Then they say to one another: 'Did your lord not forbid you to kill anyone without him?' So they take him to the Dajjal. When the believer sees him, he says: 'O people, [I bear witness that] this is the Dajjal whom the Messenger of Allah, peace be upon him, mentioned (and in a path: narrated to us) [his hadith].' He said: The Dajjal orders him to be laid out, saying: 'Take him and lay him out.' So his back and stomach are beaten severely. He said: Then he says: 'Do you not believe in me?' He said: He says: 'You are",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 135
  },
  {
    "serial_number": "104263",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 140,
    "volume_number": 1,
    "text": "the lying Messiah.' [Then the Dajjal says: 'Do you see if I kill this one then revive him, will you doubt the matter?' They say: 'No']. He said: So he orders for him, and he is sawed with a saw from the parting of his hair until his legs are separated [so he kills him]. (And in the hadith of An-Nawas: He strikes him with a sword and cuts him into two pieces, placed as far apart as a target). He said: Then the Dajjal walks between the two pieces and says to him: 'Stand up.' So he stands up straight. He said: [Then he calls him, and he comes with a beaming face, laughing]. Then he says to him: 'Do you believe in me?' He says: '[By Allah] I have only increased in insight concerning you.' He said: Then he says: 'O people, he will not do this to anyone after me among mankind.' He said: The Dajjal takes him to slaughter him, but the area between his neck and collarbone is made into copper, so he finds no way to him. He said: So he takes him by his hands and feet and casts him. People think he cast him into the Fire, but he was cast into Paradise. The Messenger of Allah, peace be upon him, said: This is the greatest of people in martyrdom with the Lord of the Worlds]. 32 - [Then the angels turn his face towards Sham] [Then the Dajjal comes to the Mount of Ilyaa (Jerusalem)",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 136
  },
  {
    "serial_number": "104264",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 141,
    "volume_number": 1,
    "text": "and besieges a group of Muslims] [The believers face severe hardship] [And people flee from the Dajjal into the mountains]. Umm Sharik bint Abi Al-Akar said: 'O Messenger of Allah, where are the Arabs on that day?' He said: 'They are few on that day.' 33 - Their Imam is a righteous man. [And he, peace be upon him, said: The Mahdi is from us, the Ahl al-Bayt [from the descendants of Fatimah]. Allah rectifies him in a night] [His name matches my name and his father's name matches my father's name] [He has a broad forehead and a prominent nose] [He fills the earth with equity and justice",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 137
  },
  {
    "serial_number": "104265",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 142,
    "volume_number": 1,
    "text": "as it was filled with oppression and tyranny] [He rules for seven years] - And he, peace be upon him, said: (Two groups of my Ummah Allah has protected from the Fire: a group that invades India and a group that will be with Jesus the son of Mary, peace be upon him - And he said: Whoever among you meets him, let him convey my greetings to him). 34 - [While their Imam has stepped forward to lead them in the Morning Prayer, Jesus the son of Mary descends upon them [from the sky] at dawn] [at the white minaret east of Damascus, between two yellow garments, placing his palms on the wings of two angels. When he lowers his head, it drips, and when he raises it, beads like pearls scatter from it. It is not lawful for a disbeliever to smell the scent of his breath except that he dies, and his breath reaches as far as his sight ends]. 35 - [There is no prophet between me and him (meaning: Jesus), and he is descending. So when you see him, recognize him: a man of medium height, reddish-white, between two yellowish garments, as if his head is dripping though no moisture touched it. He will fight the people for Islam, break the cross, kill the swine, abolish the Jizyah, and Allah will destroy all religions in his time except Islam).",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 138
  },
  {
    "serial_number": "104266",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 143,
    "volume_number": 1,
    "text": "- And he said: (How will you be when the son of Mary descends among you and your Imam (and in a narration: and he leads you) is from among you?). Ibn Abi Dhi'b said: Do you know what 'he leads you from among you' means? I said: Tell me. He said: He leads you by the Book of your Lord, Blessed and Exalted, and the Sunnah of your Prophet, peace be upon him]. 36 - That Imam retreats - walking backwards - so that Jesus may come forward [and says: Come, lead us in prayer]. Jesus places his hand between his shoulders and says to him: [No, some of you are leaders over others, an honor from Allah to this Ummah]. Go forward and pray. So their Imam leads them in prayer. 37 - [Then the Dajjal comes to the mountain of (Ilyaa) and besieges a group of Muslims] [Those in charge say to them: What are you waiting for regarding this tyrant [except] to fight him until you meet Allah or He grants you victory? So they resolve to fight him when morning comes]. 38 - [While they are preparing for battle and straightening the ranks, the prayer is established]",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 139
  },
  {
    "serial_number": "104267",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 144,
    "volume_number": 1,
    "text": "[the Morning Prayer] [They wake up and Jesus the son of Mary is with them] [He leads the people, and when he raises his head from his bowing, he says: Allah hears he who praises Him; Allah has killed the Messiah Dajjal and the Muslims have prevailed]. When he finishes, he says: Open the door. It is opened, and behind it is the Dajjal with seventy thousand Jews, all of them with adorned swords and sashes. [Jesus, peace be upon him, pursues him] 39 - [Jesus goes with his spear towards the Dajjal]. When the Dajjal sees him, he dissolves just as salt dissolves in water. [If he were to leave him alone, he would dissolve until he perished, but Allah kills him with his hand, showing them his blood on his spear]. He catches him at the Eastern Gate of Ludd and kills him. [Allah, Mighty and Majestic, destroys him at the mountain pass of Afiq]. 40 - Allah defeats the Jews [and gives the Muslims power over them] [and they kill them].",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 140
  },
  {
    "serial_number": "104268",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 145,
    "volume_number": 1,
    "text": "So nothing of what Allah created remains for a Jew to hide behind except that Allah makes that thing speak - neither stone, nor tree, nor wall, nor animal - except the Gharqad tree, for it is from their trees and does not speak - except it says: O servant of Allah, O Muslim, this is a Jew [behind me], so come and kill him. 41 - [Then people remain after him for seven years with no enmity between any two]. 42 - Jesus the son of Mary, peace be upon him, will be in my Ummah [confirming Muhammad, peace be upon him, on his religion] a just judge and a fair Imam [guided]. [He fights people for Islam, so] he breaks the cross, kills the swine, [and prayer is gathered for him],",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 141
  },
  {
    "serial_number": "104269",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 146,
    "volume_number": 1,
    "text": "and abolishes the Jizyah and leaves charity (Sadaqah) [because of abundance of wealth], so no one strives [to collect Zakat] on sheep or camel. Hatred and mutual animosity are lifted [and envy, and money will be offered but no one will accept it] [until one prostration is better than the world and what is in it] [and the call becomes one for the Lord of the Worlds]. - [By the One in Whose Hand is my soul, the son of Mary will surely enter Ihram at the valley of (Al-Rawha') as a Hajj pilgrim or performing Umrah, or combining both]. 43 - Then a people whom Allah has protected from him (Dajjal) come to Jesus the son of Mary, so he wipes their faces and tells them of their ranks in Paradise. While he is like that, Allah reveals to Jesus: 'I have brought forth servants of Mine whom no one has the power to fight, so take My servants to safety to Al-Tur (Mount Sinai).' And Allah sends Gog and Magog, and they swarm down from every height. Their first ones pass by Lake Tiberias and drink what is in it, and their last ones pass and say: 'There was once water here.' [Then they travel until they reach the Mountain of Al-Khamar - which is the Mountain of Al-Khamar - which is the mountain of Bayt al-Maqdis (Jerusalem) - and they say: 'We have killed those on earth, come let us kill those in the heaven.' So they throw",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 142
  },
  {
    "serial_number": "104270",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 147,
    "volume_number": 1,
    "text": "their arrows towards the sky, and Allah returns their arrows to them dyed with blood]. The Prophet of Allah Jesus and his companions are besieged until the head of a bull for one of them is better than a hundred dinars for one of you today. The Prophet of Allah Jesus and his companions beseech Allah, so Allah sends upon them (Gog and Magog) worms (Naghaf) in their necks, and they die as the death of a single soul. Then the Prophet of Allah Jesus and his companions descend to the earth, and they do not find in the earth the space of a span except that their fat and stench has filled it. So the Prophet of Allah Jesus and his companions beseech Allah, and He sends birds like the necks of Bactrian camels, which carry them and throw them where Allah wills. Then Allah sends rain which no house of clay or hair (tent) can keep out, and it washes the earth until it leaves it like a mirror (or smooth rock). Then it is said to the earth: 'Bring forth your fruit and return your blessing.' On that day, a group will eat from a single pomegranate and seek shade under its skin. Milk will be blessed such that a milch camel will suffice a large group of people, a milch cow will suffice a tribe of people, and a milch sheep will suffice a clan of people]. And the bull will be for such and such amount of money, and the horse for a few dirhams. - [And he, peace be upon him, said: (Blessed is the life after the Messiah, blessed is the life after the Messiah. Permission is given",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 143
  },
  {
    "serial_number": "104271",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 148,
    "volume_number": 1,
    "text": "to the sky for rain and permission is given to the earth for plants. Even if you were to sow your seed on a smooth stone, it would grow. There will be no stinginess, no envy, and no hatred)]. 44 - And the venom of every venomous creature is removed [and security falls upon the earth until lions graze with camels, tigers with cows, and wolves with sheep, and children play with snakes without them harming them] until a child puts his hand in a snake's mouth and it does not harm him. A young girl chases a lion and it does not harm her. The wolf is among the sheep as if it were their dog. The earth is filled with peace as a vessel is filled with water. The word becomes one, and none is worshipped but Allah. War lays down its burdens, and Quraysh is stripped of its kingdom. [Then it is said: The earth will be like a silver platter, growing its vegetation as in the time of Adam]. 45 - [Jesus, peace be upon him, remains on earth for forty years, then he passes away and the Muslims pray over him]. 46 - While they are like that, Allah sends a wind [cold from the direction of Sham] that takes them under their armpits and seizes the soul of every believer and every Muslim. (And in the hadith of Ibn Amr: No one remains on the face of the earth having an atom's weight of faith in his heart except",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 144
  },
  {
    "serial_number": "104272",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Story of the Antichrist and the Descent of Jesus, Peace Be Upon Him",
    "edition": "First Edition 1421 AH",
    "publisher": "The Islamic Library - Amman - Jordan",
    "page_number": 149,
    "volume_number": 1,
    "text": "that it seizes him, even if one of them were inside a mountain, it would enter upon him). The worst of people remain [in the lightness of birds and the dreams/minds of predatory beasts; they do not recognize good nor deny evil. He said: Satan impersonates himself to them and says: 'Will you not respond?' So he commands them to worship idols, and they do so. While in that state, their provision is abundant and their life is good]. They will mate publicly like donkeys; upon them the Hour will be established]. 47 - [The Trumpet is blown, and no one hears it except he tilts his neck and raises it. The first to hear it is a man repairing the trough of his camels. He will be struck unconscious, and the people will be struck unconscious. Then Allah sends - or he said: Allah sends down - rain like dew or shadow - doubt from the narrator - from which the bodies of people grow. Then it is blown a second time, and behold, they are standing, looking on [Az-Zumar: 68]. Then it is said: 'O people, come to your Lord.' And stop them; indeed, they are to be questioned [As-Saffat: 24]. Then it is said: 'Bring out the delegation of the Fire.' It is said: 'From how many?' It is said: 'From every thousand, nine hundred and ninety-nine.' That is the Day that will make the children white-haired [Al-Muzzammil: 17], and that is the Day the shin will be uncovered [Al-Qalam: 42]]. [This is the last of what his eminence Sheikh Muhammad Nasir al-Din al-Albani wrote of this valuable book. May Allah have mercy on him with vast mercy and grant him abundant reward]. Publisher.",
    "foot_note": "None",
    "book_id": "692",
    "new_page_number": 145
  }
]