[
  {
    "text": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil\nAuthor: صالح بن عبد الله الفريح\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 1
  },
  {
    "text": "sn: 8365\nbook_title: جهود أئمة الدعوة السلفية بنجد في التصدي للعنف والإرهاب من خلال الدعوة إلى فقه إنكار المنكر\nbook_link: https://shamela.ws/book/1179\nbook_id: 1179\nauthor_name: صالح بن عبد الله الفريح\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/1797\nauthor_ID: 1797\neditor: Null\npublisher: الكتاب منشور على موقع وزارة الأوقاف السعودية بدون بيانات\nedition: Null\npages: 73\nvolumes: Null\npagination: [الكتاب مرقم آليا غير موافق للمطبوع]\ncategory: كتب عامة\ncategory_id: 39",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 2
  },
  {
    "serial_number": "7506221",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Efforts of the Scholars of the Salafi Da‘wah in Najd in Confronting Violence and Terrorism Through Promoting the Jurisprudence of Forbidding Wrong",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without publication data",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: General Books\nBook: The Efforts of the Scholars of the Salafi Da‘wah in Najd in Confronting Violence and Terrorism Through Promoting the Jurisprudence of Forbidding Wrong\nAuthor: Salih ibn Abd Allah al-Furayh\nNumber of pages (printed): 43\nMachine-numbered (not matching printed edition)\nTotal pages: 73\nShamela publication date: 8 Dhul-Hijjah 1431",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 3
  },
  {
    "serial_number": "7506222",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Efforts of the Scholars of the Salafi Da‘wah in Najd in Confronting Violence and Terrorism Through Promoting the Jurisprudence of Forbidding Wrong",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without publication data",
    "page_number": 1,
    "volume_number": 1,
    "text": "The Efforts of the Scholars of the Salafi Da‘wah in Najd in Confronting Violence and Terrorism Through Promoting the Jurisprudence of Forbidding Wrong\nPrepared by: Dr. Salih ibn Abd Allah al-Furayh\nMember of the Saudi Scientific Society for Da‘wah Studies and Assistant Professor at the Department of Da‘wah and Islamic Culture, College of Da‘wah and Fundamentals of Religion, Umm al-Qura University\n\nIn the name of Allah, the Most Merciful, the Most Compassionate\n\nIntroduction:\nAll praise is due to Allah. We praise Him, seek His help, and ask for His forgiveness. We seek refuge in Allah from the evil within ourselves and from our misdeeds. Whomever Allah guides, none can mislead; and whomever He misleads, none can guide. I bear witness that there is no deity worthy of worship except Allah alone, without partner, and I bear witness that Muhammad is His servant and messenger.\n\n{O you who believe, fear Allah as He should be feared, and do not die except as Muslims} [Aal Imran: 102]\n\n{O mankind, fear your Lord who created you from a single soul, and created from it its mate, and spread from both many men and women. And fear Allah, through whom you ask one another, and the wombs. Indeed, Allah is ever watching over you} [An-Nisa: 1]",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 4
  },
  {
    "serial_number": "7506223",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 2,
    "volume_number": 1,
    "text": "{O you who have believed, fear Allah and speak words of appropriate justice. He will [then] amend for you your deeds and forgive you your sins. And whoever obeys Allah and His Messenger has certainly attained a great attainment.} [Al-Ahzab: 70-71]. Indeed, the most truthful speech is the Book of Allah Almighty, and the best guidance is the guidance of Muhammad, peace and blessings be upon him. The worst of matters are newly invented ones, and every newly invented matter is an innovation, and every innovation is misguidance, and every misguidance is in the Fire. To proceed: Allah has obligated in His Noble Book, and His Messenger (peace and blessings be upon him) in his purified Sunnah, upon every Muslim to perform the ritual of enjoining good and forbidding evil. Legal texts have combined in this regard to emphasize the importance of this ritual and its great value to Allah, the Exalted, to the extent that some scholars counted it as a pillar of Islam, counting them as six pillars instead of five (1). For this reason, scholars, past and present, have paid attention to this great ritual, clarifying its principles and explaining its foundations.",
    "foot_note": "1. (1) See: A letter by Sheikh Abd al-Latif bin Abd al-Rahman Al al-Sheikh, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 33). Compiled by: Abd al-Rahman bin Qasim Al-Qahtani Al-Najdi, 2nd ed., 1385 AH, Al-Noor Institution for Printing and Binding in Riyadh, from the publications of the Fatwa House in the Kingdom of Saudi Arabia.",
    "book_id": "1179",
    "new_page_number": 5
  },
  {
    "serial_number": "7506224",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 3,
    "volume_number": 1,
    "text": "The contemplator of our contemporary reality clearly notices some of that deviation in the true jurisprudence of how to forbid evil, where zeal for the prohibitions of Allah has overwhelmed and exceeded the legitimate limit that Allah Almighty is pleased with. Its proponents have transgressed into extremism not governed by Sharia or reason. The result of this was terrorist acts involving destruction, bombing, killing, and intimidation. This matter obligates students of knowledge, scholars, thinkers, and writers to play their role in confronting these deviant ideas and clarifying their misguidance to cut off the roots of corruption and mischief. Perhaps one of the strangest things a contemplator sees regarding these contemporary events and the reactions accompanying them is the accusation by some that the call of Sheikh Muhammad bin Abdul-Wahhab is involved in fueling such deviant thought and that it is a cause for its emergence. This shows clear ignorance of the reality of the Call and the positions of its Imams regarding such acts. Perhaps whim plays a major role in such accusations. Reasons for choosing the topic: 1- To clarify the efforts of the Imams of the Salafi Call in Najd in fighting extremism and excess and the terrorism that follows them, and that their positions regarding this are strict positions that do not accept transgression in this regard.",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 6
  },
  {
    "serial_number": "7506225",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 4,
    "volume_number": 1,
    "text": "2- The ambiguity of the stance of the Imams of the Salafi Call in Najd regarding extremism and terrorism among some who are considered intellectuals and thinkers, and the consequent extremist theses that burden the call of Sheikh Muhammad bin Abdul-Wahhab with many consequences of which it is innocent, as this research will show by the power of Allah Almighty. 3- The absence of a scientific study addressing this issue and highlighting to people the good stance stemming from the truth of Islam against these ideas. 4- Highlighting the warning of the Imams of the Salafi Call in Najd against extremism and excess and the terrorism that follows them, and presenting some important fatwas written by the Imams of the Call warning against issues we live in our contemporary reality today. 5- Explaining the deviation of those who claim that their extremist and excessive methodology and what follows it is the methodology of the Imams of the Salafi Call in Najd, and explaining their refutation of that and the reality of their methodology. The Research Problem: The research problem can be defined in clarifying the true stance of the Imams of the Salafi Call in Najd regarding excess, extremism, violence, and terrorism, and whether that Call fueled extremism and terrorism or if it is a cause for its emergence or the emergence of some of its effects that we live today of terrorism and violence. Limitations of the Study:",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 7
  },
  {
    "serial_number": "7506226",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 5,
    "volume_number": 1,
    "text": "The study will focus on extracting the methodology of the Imams of the Salafi Call in Najd regarding the issue of forbidding evil and their fight against excess, extremism, and violence within it, and against transgressing what is religiously commanded in its application. The researcher will focus on what the Imams of the Call, both scholars and rulers, wrote, analyzing their statements and deducing their scientific methodology in that regard. Research Methodology: The researcher will use the analytical deductive method in this research, collecting the texts reported from them regarding the issue of forbidding evil and what relates to it, then analyzing their statements and studying them carefully, deducing their methodology in this important issue. This will be according to the following steps: 1- Collecting available letters of the Imams of the Salafi Call in Najd and the books concerned with collecting those letters and their writings, and extracting texts related to the topic from them. 2- Conducting an analytical study of the collected texts related to the research topic and deducing their methodology from them. 3- Focusing on what the Imams of the Salafi Call in Najd wrote themselves, rather than what was reported about them, to reach their methodology without intermediaries that might divert the research from its path. 4- Being careful to quote their phrases verbatim mostly in the topic to be realistic. 5- Attributing Quranic verses to their places in the Book of Allah.",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 8
  },
  {
    "serial_number": "7506227",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 6,
    "volume_number": 1,
    "text": "6- Attributing Hadiths to those who narrated them, prioritizing the two Sahihs over others. 7- Brief biographies for the notable figures. Table of Contents:",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 9
  },
  {
    "serial_number": "7506228",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 7,
    "volume_number": 1,
    "text": "The research will consist of an introduction, a preface, and two chapters: The Introduction: Contains the research plan, reasons for choosing the topic, research problem, study limitations, research methodology, and table of contents. The Preface: Contains a brief overview of the Salafi Call in Najd. The First Chapter: The Jurisprudence of What is Required Before Denial. It contains three demands: * First Demand: The reality of the doer of evil. * Second Demand: Verification and lack of haste. * Third Demand: Knowledge. The Second Chapter: The Jurisprudence of What is Required During Denial. It contains three demands: * First Demand: The ruling if denial results in a greater corruption. * Second Demand: The style of denial. * Third Demand: Denial upon those in authority (rulers).",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 10
  },
  {
    "serial_number": "7506229",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 8,
    "volume_number": 1,
    "text": "Preface: A Brief Overview of the Salafi Call in Najd: In the middle of the twelfth century Hijri, in the village of Huraymila located in Najd, was the initial appearance of the activity of a revivalist call aimed at reviving true Islam in the minds and hearts of people. This was represented in reality by what Sheikh Muhammad bin Abdul-Wahhab (1) undertook in calling people to the principles of Islam, foremost among them the Tawhid (monotheism) of Allah and warning against associating partners with Him, as it is \"the greatest obligation brought by the Prophet, peace and blessings be upon him\" (2), in which a great deviation had occurred, such that the deviation of the early polytheists seemed small compared to the polytheism of the later ones in certain matters, as ignorance and weakness of mind were combined in them, whereas the early ones had sounder minds than them (3).",
    "foot_note": "1. (1) He is the Revivalist Sheikh Muhammad bin Abdul-Wahhab bin Sulayman bin Ali from Al-Musharraf from Banu Tamim. He was born in Al-Uyaynah in the year one thousand one hundred and fifteen Hijri. He grew up there and received knowledge from his father, then traveled to seek it. He established the Salafi Call and strove well in it until its stalk straightened. He died, may Allah have mercy on him, in the year one thousand two hundred and six Hijri. Ulama al-Da'wah, Abd al-Rahman bin Abd al-Latif Al al-Sheikh: (6), 1386 AH edition. \n2. Kashf al-Shubuhat, Muhammad bin Abdul-Wahhab: (22), Printed and published by the General Presidency for Scholarly Research Departments, Printing and Translation Agency, Riyadh, 1413 AH. \n3. Kashf al-Shubuhat, previous reference: (19, 21).",
    "book_id": "1179",
    "new_page_number": 11
  },
  {
    "serial_number": "7506230",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 9,
    "volume_number": 1,
    "text": "For this reason, Sheikh Muhammad bin Abdul-Wahhab rolled up his sleeves in earnest to fulfill the duty of calling to Allah Almighty; but things did not go as he wished. Difficulties faced him one after another; in Huraymila he was almost killed (1), then in Al-Uyaynah he was expelled because of his call (2); until he settled in the domain of Prince Muhammad bin Saud (3), who did not hesitate to support the Call and stand for it. The difficulties he faced in its path did not dissuade him from continuing on the path of supporting the Call, the most prominent of which was the hostility of everyone towards him and their targeting him as one, and the subsequent killing of his two sons Faisal and Saud (4), but he remained steadfast in supporting the Call and continued.",
    "foot_note": "1. (1) Tarikh Najd by Sheikh Hussein bin Ghannam, edited and verified by: Dr. Nasir al-Din al-Asad: (84), 2nd ed., 1405 AH / 1985 AD, Dar Al-Shorouk, Beirut. \n2. Tarikh Najd, previous reference: (86). \n3. He is Muhammad bin Saud bin Muhammad bin Muqrin, the Mujahid Prince. He undertook the support of the call of the Revivalist Sheikh Muhammad bin Abdul-Wahhab. He died, may Allah be pleased with him, in the year 1179 AH in Diriyah. Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah (Biographies), Abd al-Rahman bin Qasim: (12 / 25). \n4. Tarikh Najd, previous reference: (98).",
    "book_id": "1179",
    "new_page_number": 12
  },
  {
    "serial_number": "7506231",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 10,
    "volume_number": 1,
    "text": "Historians consider the meeting of Sheikh Muhammad bin Abdul-Wahhab and Prince Muhammad bin Saud in the year 1157 AH (1), and the blessed pledge that took place between them in Diriyah, as the practical starting point for the Saudi State in its first phase. It is also the actual launch of the Salafi Call in Najd, as from there the Call began to take on a distinct new character; appearing in its existence within an entity established upon it and for its sake, aiming to protect and spread it. From here, the Salafi Call in Najd began to take its distinctiveness. Contributing to its appearance and prominence were its Imams, represented by a group of rulers who succeeded in managing the crisis of affairs in the Saudi State, and scholars who had a prominent role in spreading the principles of the Call and its ideas which represent the principles and foundations of Islam. They also had an effective role in fulfilling the duty of intellectual protection for those great principles that represent the truth of Islam. These scholars are those who studied under Sheikh Muhammad bin Abdul-Wahhab; or under his students, and followed the same ideas and principles that the Revivalist Sheikh called to, whether they were his children and grandchildren or others.",
    "foot_note": "1. (1) Unwan al-Majd fi Tarikh Najd, Uthman bin Abdullah bin Bishr: (1 / 25), 4th ed., 1403 AH, Publications of King Abdulaziz Foundation - Riyadh, and Tarikh al-Mamlakah al-Arabiyyah al-Saudiyyah, Abdullah bin Salih Al-Uthaymeen: (86), (5th ed. - 1414 AH).",
    "book_id": "1179",
    "new_page_number": 13
  },
  {
    "serial_number": "7506232",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 11,
    "volume_number": 1,
    "text": "These Imams were active in the Salafi Call in Najd, throughout the phases the state passed through. Among the most prominent in the first phase were: The Revivalist Sheikh Muhammad bin Abdul-Wahhab, Sheikh Abdul-Aziz Al-Husayin (1), Hamad bin Nasser bin Mu'ammar (2), Sheikh Abdullah bin Muhammad bin Abdul-Wahhab (3), and others. As for the rulers, among them were Prince / Muhammad bin Saud, then his son / Abdul-Aziz (4), then his son / Saud (5), then his son / Abdullah (6), who was the last of them in the first phase. As for the second phase, among them were Sheikh Abdul-Rahman bin Hassan Al al-Sheikh (7), Sheikh Abd al-Latif bin Abd al-Rahman Al al-Sheikh (8), Sheikh Abdullah Aba Butayn (9), and Sheikh Hamad bin Ali bin Atiq (10). From their students were Sheikh Sulayman bin Sahman (11), Sheikh Abdullah bin Abdul-Aziz Al-Angari (12), Sheikh Muhammad bin Abd al-Latif Al al-Sheikh (13), Sheikh Omar bin Muhammad bin Salim (14), Sheikh Saad bin Hamad bin Atiq (15), and many others. The most prominent rulers in it were Imam Turki bin Abdullah (16), Faisal bin Turki (17), Abdullah bin Faisal, and Abdul-Rahman bin Faisal, then the Unifier and Renewer King Abdul-Aziz bin Abdul-Rahman in the third phase.",
    "foot_note": "1. (1) He is Sheikh Abdul-Aziz bin Abdullah bin Muhammad Al-Husayin. He received knowledge from a group of scholars, headed by the Revivalist of the Call, Sheikh Muhammad bin Abdul-Wahhab. He had a prominent role in Da'wah and education. He died, may Allah have mercy on him, in the year one thousand two hundred and thirty-seven Hijri. Ulama Najd Khilal Thamaniyat Qurun, Abdullah bin Abdul-Rahman Al-Bassam: (3 / 454), 2nd ed., 1419 AH, Dar Al-Asimah - Riyadh. \n2. He is Sheikh Hamad bin Nasser bin Uthman bin Mu'ammar. He was a jurist and hadith scholar. He assumed the judiciary of Diriyah and other places, then assumed the judiciary and education in Mecca, where he died, may Allah have mercy on him, in the year 1225 AH. Al-Durar Al-Saniyyah (Biographies): (12 / 47). \n3. He is Sheikh Abdullah bin Muhammad bin Abdul-Wahhab, born in 1165 AH in Diriyah. He received knowledge from a group of scholars, headed by his father, the Revivalist. He succeeded his father in carrying out the Call, becoming the scholar and Mufti of Najd. He was exiled to Egypt in 1233 AH, and died there, may Allah have mercy on him, in 1242 AH. Ulama al-Da'wah: (18). \n4. He is Abdul-Aziz bin Muhammad bin Saud. He assumed the Emirate after his father in 1179 AH. Allah combined knowledge and leadership in him. He died, may Allah have mercy on him, in 1218 AH in Diriyah. Al-Durar Al-Saniyyah (Biographies): (12 / 30). \n5. He is Saud bin Abdul-Aziz bin Muhammad bin Saud. He assumed command after his father in 1218 AH. He was a student of knowledge and has distinguished scholarly treatises. He died, may Allah have mercy on him, in 1229 AH. Al-Durar Al-Saniyyah (Biographies): (12 / 37). \n6. He is Prince Abdullah bin Saud bin Abdul-Aziz bin Muhammad bin Saud. He assumed command after his father in 1229 AH, amidst the crisis of the siege. He was captured and killed in Turkey in 1233 AH, may Allah have mercy on him. Al-Durar Al-Saniyyah (Biographies): (12 / 49). \n7. He is Sheikh Abdul-Rahman bin Hassan bin Muhammad bin Abdul-Wahhab, born in Diriyah in the year 1193 AH. He learned from his grandfather and a group of scholars. He renewed the Salafi Call with Imam Turki bin Abdullah in 1240 AH. He died, may Allah have mercy on him, in Diriyah in 1285 AH. Ulama al-Da'wah: (40), Unwan al-Majd: (2 / 41). \n8. He is Sheikh Abd al-Latif bin Abd al-Rahman bin Hassan bin the Revivalist Muhammad bin Abdul-Wahhab. Born in 1225 AH in Diriyah, he moved after 1233 AH to Egypt with his father who was exiled there. There, he received knowledge from his father and returned to Najd in 1264 AH. He was the best support for his father during his life and his successor in religious leadership after his death. He died, may Allah have mercy on him, in 1293 AH in Diriyah. Ulama al-Da'wah: (47). \n9. He is Sheikh Abdullah bin Abdul-Rahman bin Abdul-Aziz Aba Butayn, born in 1294 AH. He received knowledge from a group of scholars. He has prominent efforts in Da'wah and education, and has a number of scholarly treatises. He died, may Allah have mercy on him, in 1282 AH in Shaqra. Al-Durar Al-Saniyyah (Biographies): (12 / 75). \n10. He is Sheikh Hamad bin Ali bin Muhammad bin Atiq. He received knowledge from the senior Imams of the Call and followed their path. He did not fear the blame of a blamer for the sake of Allah. He died, may Allah have mercy on him, in 1301 AH. Al-Durar Al-Saniyyah (Biographies): (12 / 77). \n11. He is Sheikh Sulayman bin Sahman bin Amir. His father came from Asir, where he grew up and received knowledge. He accompanied Sheikh Abd al-Latif bin Abd al-Rahman Al al-Sheikh and learned from him. He had a fluent pen and has many treatises and books. He died, may Allah have mercy on him, in 1349 AH and was buried in Riyadh. Ulama al-Da'wah: (87). \n12. He is Sheikh Abdullah bin Abdul-Aziz bin Abdul-Rahman Al-Angari. Born in Tharmada where he grew up, then moved to Riyadh to seek knowledge from its scholars, accompanying and benefiting from them. He had efforts in Da'wah and reform. He died, may Allah have mercy on him, in 1373 AH in Al-Majma'ah. Ulama Najd Khilal Thamaniyat Qurun: (4 / 265). \n13. He is Sheikh Muhammad bin Abd al-Latif bin Abd al-Rahman Al al-Sheikh. Born in 1273 AH. He received knowledge from his brother Abdullah and a group of Al al-Sheikh and others. He assumed the judiciary, Da'wah, and guidance in various parts of the Kingdom. He died, may Allah have mercy on him, in 1367 AH. Ulama Najd Khilal Thamaniyat Qurun: (6 / 134). \n14. He is Sheikh Omar bin Muhammad bin Abdullah bin Salim, one of the scholars of Qassim. Born there in 1299 AH, he received knowledge there from his father Sheikh Muhammad and a group of scholars. He had a role in Da'wah and education. He died, may Allah have mercy on him, in 1362 AH. Ulama Al Salim: (1 / 98). \n15. He is Sheikh Saad bin Hamad bin Ali bin Atiq. He took knowledge from his father and traveled to India to seek it. Many people benefited from his call and teaching. He died, may Allah have mercy on him, in 1349 AH. Al-Durar Al-Saniyyah (Biographies): (12 / 93). \n16. He is Imam Turki bin Abdullah bin Muhammad bin Saud. Allah enabled him to restore the Saudi State after an interruption of seven years, assuming power in 1240 AH. He had efforts in reviving the Salafi Call. He died, may Allah have mercy on him, in 1249 AH in Riyadh. Muluk Al Saud: (1 / 19). \n17. He is Imam Faisal bin Turki bin Abdullah bin Muhammad bin Saud. He assumed power after his father's killing in late 1249 AH. His rule continued for a long time during which knowledge and security spread, and he had blessed efforts in that. He died, may Allah have mercy on him, in 1282 AH. Muluk Al Saud: (1 / 20).",
    "book_id": "1179",
    "new_page_number": 14
  },
  {
    "serial_number": "7506233",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 12,
    "volume_number": 1,
    "text": "There is no doubt that the Imams of the Salafi Call in Najd represented an integrated unit consisting of rulers and scholars, and there was an amazing harmony between them where each completed the role of the other (1); to the point that Sheikh Muhammad bin Abdul-Wahhab mentioned, in the context of emphasizing that each completes his companion and that their performance cannot reach the required level except through cooperation and mutual support, saying may Allah have mercy on him: \". . . And you see each of the people of religion and the Prince, neither of them worships Allah except with his companion. . . \" (2).",
    "foot_note": "1. (1) See: The Third Demand of the Second Chapter. \n2. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 239).",
    "book_id": "1179",
    "new_page_number": 15
  },
  {
    "serial_number": "7506234",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 13,
    "volume_number": 1,
    "text": "The First Chapter: Fiqh (Jurisprudence) of What is Before Denial. First Demand - The Reality of the Doer of Evil: The scholars of the Salafi Call in Najd realized that it is very important for the one carrying out the ritual of forbidding evil to understand the reality of the doer of evil. This is because some may be overwhelmed by looking at the evil, its ugliness, and its violation of the command of Allah Almighty, then neglect to look at the fact that the doer of evil remains a Muslim; doing the evil does not expel him from the circle of Islam. This matter obligates the Muslim to deal with his brother according to what the legal texts have brought regarding interaction among Muslims with one another, in fulfillment of the rights Allah has legislated between them. For this reason, the directives of the scholars of the Call came to confirm and entrench this meaning; in calling for a balanced view of the sinner or doer of evil; taking into account the evil within him and the good within him. Not every sinner is devoid of all good. Therefore, the sinner and doer of evil is hated for the evil and disobedience within him, and loved for the good within him. It is not appropriate for a Muslim to make his hatred for the evil with him decisive and overruling the good with him so that he does not love him (1).",
    "foot_note": "1. (1) See: A letter by Sheikh Muhammad bin Abd al-Latif Al al-Sheikh, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 41).",
    "book_id": "1179",
    "new_page_number": 16
  },
  {
    "serial_number": "7506235",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 14,
    "volume_number": 1,
    "text": "Certainly, realizing this meaning, understanding it, and having it entrenched in the one carrying out this ritual has an effect on his performance. If he knows that this doer of evil (the sinner) is his brother in Islam, united by the bond of religion, and realizes the great rights of this bond and his Muslim brother's rights upon him, this feeling drives him to be gentle with his brother and to care about choosing the optimal and best method to forbid evil and teach the sinner without infringing on his rights or harming him. One of the most dangerous problems facing the Call from some of those carrying out this ritual is the lack of true understanding of this matter. You find those who neglect this; rather, some of them go to extremes and transgress into dangerous matters that do not issue from one whom Allah has blessed with knowledge and insight; so he accuses his brother of Kufr (disbelief) and expels him from the religion for a sin that does not warrant that.",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 17
  },
  {
    "serial_number": "7506236",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 15,
    "volume_number": 1,
    "text": "Because the Imams of the Salafi Call in Najd realized the gravity of the matter, and the probability—indeed the certainty—of it occurring from some extremists, they used to warn against the occurrence of such things and stand as an impenetrable barrier against transgression in this area. Perhaps one of the most prominent examples of this is the stance of Sheikh Abd al-Latif bin Abd al-Rahman Al al-Sheikh when he was appointed judge in Al-Ahsa in the year 1264 of the Prophetic Hijrah. He found there two men who had withdrawn from the Friday prayer and the congregation and declared the Muslims in that land to be disbelievers based on flimsy arguments and false doubts. Sheikh Abd al-Latif summoned them, exposed their doubts, refuted their misguidance, and responded to their claim that this was the belief of the Revivalist Sheikh Muhammad bin Abdul-Wahhab. He clarified to them that the Revivalist Sheikh does not declare Kufr except for that which Muslims have agreed upon declaring its doer a disbeliever after the establishment of proof and its valid delivery (1).",
    "foot_note": "1. (1) See: A letter from Sheikh Abd al-Latif bin Abd al-Rahman Al al-Sheikh, within Majmoo' al-Rasa'il wal-Mas'ail al-Najdiyyah: (3 / 5). (2nd ed., 1409 AH, Dar Al-Asimah, Riyadh).",
    "book_id": "1179",
    "new_page_number": 18
  },
  {
    "serial_number": "7506237",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 16,
    "volume_number": 1,
    "text": "He, may Allah have mercy on him, was not content with just that, but used to warn those whom he felt had some deviation in this regard through correspondence and letters. In one of them, addressing those whom he felt had a deviation in understanding towards Takfir (declaring others disbelievers), he says: \"As for Takfir due to these matters which you thought were nullifiers of Islam, this is the doctrine of the Haruriyyah (Kharijites), the renegades who rebelled against Ali bin Abi Talib, the Commander of the Faithful, and those with him from the Companions. . . \" (1). And regarding the statement that Takfir for mere sins is contrary to what the Imams of Islam from Ahl al-Sunnah wal-Jama'ah are upon, he says: \". . . And daring to declare Takfir on one whose outward appearance is Islam without a legal basis or satisfactory proof contradicts what the Imams of knowledge from Ahl al-Sunnah wal-Jama'ah are upon. This method is the method of the people of innovation and misguidance. . . \" (2). And Sheikh Abdul-Rahman bin Hassan Al al-Sheikh says: \". . . Sins that are less than Shirk and Kufr, their doer is not declared a disbeliever, but he is forbidden from them. If he persists in a major sin and does not repent from it, forbidding him and standing against him is obligatory. Every evil must be forbidden, whether abandoning a duty or committing a prohibition, but no one is declared a disbeliever except one who commits a nullifier which the Book and Sunnah indicate is Kufr, and likewise what scholars have agreed upon that whoever does it or believes it has disbelieved. . . \" (3).",
    "foot_note": "1. (1) A letter from Sheikh Abd al-Latif bin Abd al-Rahman Al al-Sheikh, within Majmoo' al-Rasa'il wal-Mas'ail al-Najdiyyah: (3 / 6). \n2. A letter by him, within Majmoo' al-Rasa'il wal-Mas'ail al-Najdiyyah: (3 / 20). \n3. A letter by him, within Majmoo' al-Rasa'il wal-Mas'ail al-Najdiyyah: (4 / 408, 409).",
    "book_id": "1179",
    "new_page_number": 19
  },
  {
    "serial_number": "7506238",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 17,
    "volume_number": 1,
    "text": "Related to this chapter is a matter emphasized by the Imams of the Salafi Call, may Allah have mercy on them, which is that it is obligatory upon a Muslim to accept the public behavior of their brothers, and it is not permissible for anyone to spy on them or accuse their intentions. Rather, the duty is to entrust the inner secrets to Allah Almighty. For this reason, the Revivalist Sheikh Muhammad bin Abdul-Wahhab wrote emphasizing this matter, saying: \". . . The Prophet, peace and blessings be upon him, used to know hypocrites personally yet accepted their public behavior and entrusted their inner secrets to Allah. If something appeared from them and it was verified what necessitates fighting them, he fought them. . . \" (1). This is precious speech, as the Sheikh pointed out in it that the lesson is not only the mere appearance of what necessitates fighting them, but there must be complete verification of that. This is a confirmation of the obligation to deal with this matter with extreme sensitivity, as it is one of the most dangerous and greatest doors in corrupting and destroying society. Accusing intentions, judging purposes, and spying for that sake have dire effects and dangerous consequences on society, as it occupies its members with one another, which is the beginning of the end for it.",
    "foot_note": "1. (1) A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (3 / 26).",
    "book_id": "1179",
    "new_page_number": 20
  },
  {
    "serial_number": "7506239",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 18,
    "volume_number": 1,
    "text": "Second Demand - Verification and Lack of Haste: Verification in matters and lack of haste is a distinct Islamic methodology; it preserves the society's cohesion and harmony, and protects it from mistakes and slips followed by widespread corruption. For this reason, the Holy Quran alerted to a wisdom among the wisdoms of this great methodology, so He Almighty said: {O you who have believed, if there comes to you a disobedient one with information, investigate, lest you harm a people out of ignorance and become, over what you have done, regretful} (1). Thus the doer regrets and the harmed suffers. The Imams of the Salafi Call in Najd realized this matter and emphasized it in their letters and directives. Sheikh Muhammad Abd al-Latif bin Abd al-Rahman Al al-Sheikh says in this regard: \". . . It is appropriate for one who intends good and calling to Allah to be cautious in matters, to verify, and to avoid rashness and haste. . . \" (2). Verification according to the Imams of the Salafi Call in Najd, through induction, is divided into two parts:",
    "foot_note": "1. (1) Surah Al-Hujurat: Verse (6). \n2. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 41).",
    "book_id": "1179",
    "new_page_number": 21
  },
  {
    "serial_number": "7506240",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 19,
    "volume_number": 1,
    "text": "a) Verifying that the evil has actually occurred in reality; for it is not sufficient that it is mentioned or circulated in gatherings in malicious rumors and fabricated sayings, transmitted by some who have no morals and no knowledge. The Revivalist Sheikh Muhammad bin Abdul-Wahhab says regarding this matter: \". . . The duty upon them, if an evil is mentioned to them about someone, is lack of haste. If they verify it, they should go to its doer and advise him. . . \" (1). In his saying is an entrenchment of this matter, so there must be verification before undertaking any action based on the news that was received. If it is verified and its truthfulness is established, here comes the role of action, which is advice and denial, but before that, no.",
    "foot_note": "1. (1) A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 26).",
    "book_id": "1179",
    "new_page_number": 22
  },
  {
    "serial_number": "7506241",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 20,
    "volume_number": 1,
    "text": "b) Proving that this act is truly evil, and this is through legal (Sharia) knowledge which is only achieved through knowing the Book and the purified Sunnah. Therefore, it is an imperative and confirmed duty upon one who does not have knowledge of the Book and Sunnah, and does not possess the eligibility for that, to wait and verify and not rush until he refers to the scholars who are firmly grounded in knowledge and aware of the objectives and meanings of Sharia, so he does not bypass them. This is one of the matters emphasized by the Imams of the Salafi Call in Najd, where the Revivalist Sheikh Muhammad bin Abdul-Wahhab says in this regard: \". . . And a person is not permitted to deny except after knowledge. So the first degree of denial is your knowledge that this is contrary to the command of Allah. . . \" (1). Due to the connection of this matter to one of the most important issues that the Imams of the Salafi Call in Najd were concerned with, we will detail the discussion on it in the next demand, Allah Almighty willing.",
    "foot_note": "1. (1) A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 26).",
    "book_id": "1179",
    "new_page_number": 23
  },
  {
    "serial_number": "7506242",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 21,
    "volume_number": 1,
    "text": "Third Demand - Knowledge: There is no doubt that one of the most important foundations upon which any work intended for success is built is: Knowledge; for it is one of the most important foundations that achieves that for the work, especially in the matter of calling to Allah Almighty, and specifically in the aspect of forbidding evil due to the gravity of this matter. For this reason, the recommendations and directives of the Imams of the Salafi Call in Najd came carrying within them much about knowledge in various aspects, all pouring into reaching a more perfect performance in the aspect of calling to Allah in general, and forbidding evil in particular. Among that is the following: 1- Clarifying that one of the most important and dangerous causes of excess and extremism is ignorance, as it leads to error in understanding; and pushes towards building incorrect perceptions, upon which deviant behaviors are built that cause atrocious matters (1).",
    "foot_note": "1. (1) See: A letter by Sheikh Abdul-Rahman bin Hassan Al al-Sheikh, within Majmoo' al-Rasa'il wal-Mas'ail al-Najdiyyah: (4 / 372).",
    "book_id": "1179",
    "new_page_number": 24
  },
  {
    "serial_number": "7506243",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 22,
    "volume_number": 1,
    "text": "2- In order to eliminate excess and extremism and the terrorism that follows them, it was necessary to pay attention to knowledge and teaching people in general, and practitioners of Da'wah work in particular. It is certain that it raises the competence of the one forbidding evil if he applies the vocabulary of knowledge on the ground. This is a known matter; for one who lacks a thing cannot give it. So how can one forbid according to the principles considered legally if he has not learned them and knows nothing of them? The Revivalist Sheikh Muhammad bin Abdul-Wahhab says after a letter of his in which he included important principles in forbidding evil, clarifying the effect of ignorance of them: \". . . So by Allah, by Allah, act upon what I mentioned to you and understand it, for if you do not do so, your denial will become harmful to the religion\" (1). The Imams of the Salafi Call in Najd followed many ways to raise the cognitive ability of people and deliver knowledge to them by all means and methods. Among that:",
    "foot_note": "1. (1) A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 25).",
    "book_id": "1179",
    "new_page_number": 25
  },
  {
    "serial_number": "7506244",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 23,
    "volume_number": 1,
    "text": "a) Addressing those holding Imamate and authority regarding the obligation of caring for teaching people, and emphasizing sending those who teach them the matters of their religion. Sheikh Abdul-Rahman bin Hassan Al al-Sheikh says to Imam Faisal bin Turki: \"And it is upon the Imam - may Allah grant him success - to send workers for the religion just as he sends workers for Zakat to teach them their religion. . . \" (1). And he says in another letter: \". . . Likewise, the Imam must look into the matter of knowledge, encourage people to seek it, and assist those who undertake seeking it. . . \" (2). Sheikh Muhammad bin Abd al-Latif and a group of scholars say in clarifying the importance of spreading knowledge and the Imam's role in that: \"Indeed, among what Allah and His Messenger, peace and blessings be upon him, obligated upon those in authority is spreading knowledge and establishing religion. . . \" (3).",
    "foot_note": "1. (1) A letter by him, within Majmoo' al-Rasa'il wal-Mas'ail al-Najdiyyah: (4 / 380). \n2. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (9 / 27). \n3. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 321).",
    "book_id": "1179",
    "new_page_number": 26
  },
  {
    "serial_number": "7506245",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 24,
    "volume_number": 1,
    "text": "The Imams of the Salafi Call from among the rulers used to exert much in this matter, sending preachers to various lands to play their role in teaching and guidance. Sheikh Abd al-Latif bin Abd al-Rahman Al al-Sheikh says in a letter from him to a student of knowledge, containing his assignment to perform the duty of teaching by order of Imam Abdul-Rahman Al-Faisal (1): \". . . Opinion and consultation have agreed on obligating you to call to Allah and remind of His religion. . . And this is the handwriting of Imam Abdul-Rahman and your family, so do not answer with no or will not. . . \" (2). And he says in a letter addressed to one of the princes: \". . . And coming to you is our son Ali bin Salim (3) by arrangement of the Imam to remind the people of Islam and urge them to steadfastness and adherence to the religion of Allah. . . \" (4). Sheikh Muhammad bin Abd al-Latif Al al-Sheikh and a group with him from the scholars say in clarifying the Imam's effort in that: \". . . And the Imam - may Allah grant him success and help him - is concerned with this matter, and has sent preachers to most tribes teaching them the matter of their religion. . . \" (5).",
    "foot_note": "1. (1) He is Abdul-Rahman bin Faisal bin Turki bin Abdullah bin Muhammad bin Saud. He assumed rule after the death of his brother Saud, and his rule did not last long in his first term. Then he assumed rule after the death of his brother Abdullah. The Second Saudi State ended with his departure from Riyadh in 1309 AH. Muluk Al Saud, Saud bin Hathlol: (1 / 40). \n2. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (9 / 84, 85). \n3. He is Sheikh Ali bin Abdul-Aziz bin Salim. He received knowledge from the Imams of the Salafi Call in Najd. He assumed the judiciary in the Gulf, and many benefited from him. See: Waqi' al-Da'wah ila Allah fi al-Dawlah al-Saudiyyah al-Thaniyah, Saleh bin Abdullah Al-Furaih: (238) footnote, Ph.D. thesis, Imam University, Department of Da'wah. \n4. A letter by him, within Majmoo' al-Rasa'il wal-Mas'ail al-Najdiyyah: (4 / 272). \n5. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 321).",
    "book_id": "1179",
    "new_page_number": 27
  },
  {
    "serial_number": "7506246",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 25,
    "volume_number": 1,
    "text": "b) Making education compulsory for a group from every town, where the Imam guarantees their expenses, and they are freed to seek knowledge and receive it; to play their role in teaching their people afterwards. This is a methodology followed by Imam Saud bin Abdul-Aziz. He says, may Allah have mercy on him, in a letter of his: \". . . And you know that I have obligated every prince of a district to designate fifteen or more or less from the people of his towns; and seeking knowledge is binding upon them; because it is a necessary matter. . . And I do not excuse any prince of a district unless he has specific people, and seeking knowledge is binding upon them, and he writes their names for us in a paper and we will send them - Allah willing - what aids them in their livelihood. . . \" (1). c) Emphasizing upon students of knowledge to perform their duty in teaching people and exerting what Allah has provided them of knowledge and understanding. In this regard, Sheikh Abdul-Rahman bin Hassan Al al-Sheikh says: \"So the duty upon whom Allah has given something of knowledge is to offer it to the seekers, and to perform what Allah Almighty has obligated upon him of advice to Allah, His Messenger, His Book, and the leaders of the Muslims and their common folk. . . \" (2). And Sheikh Abd al-Latif says in emphasizing that upon some of his students: \". . . And spreading knowledge and clarifying the Sunnah is among the most obligatory of duties and the best of acts of obedience. . . \" (3).",
    "foot_note": "1. (1) A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (9 / 12). \n2. A letter by him, within Majmoo' al-Rasa'il wal-Mas'ail al-Najdiyyah: (4 / 423). \n3. A letter by him, within Majmoo' al-Rasa'il wal-Mas'ail al-Najdiyyah: (3 / 307).",
    "book_id": "1179",
    "new_page_number": 28
  },
  {
    "serial_number": "7506247",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 26,
    "volume_number": 1,
    "text": "3- Emphasizing the most important issue in the methodology of receiving knowledge, which is: How to receive it. For the intention of seeking knowledge is not to collect something of it which one does not understand or comprehend; rather, the issue is Fiqh (jurisprudence) and understanding before memorization. For this reason, the Imams of the Salafi Call used to emphasize the correct methodology in seeking knowledge and receiving it. In this regard, Sheikh Abdullah bin Abdul-Aziz Al-Angari clarifies that the duty upon students of knowledge is to take knowledge from its people, and not rely on their mere understandings or receiving from books only, and he confirms that this is not beneficial (1). Clarifying this, Sheikh Omar bin Salim says: \". . . That whoever suffices with Majmoo'at al-Tawhid (Collection of Monotheism) or imitates one who reads it while he does not know its meaning has fallen into ignorance and misguidance; rather, it is obligatory upon him to take from the scholars of the Muslims. . . \" (2). And Sheikh Saad bin Atiq says: \"And the greatest causes of safety are fleeing from the paths of the people of error and corruption, acquiring the light of guidance from its place, and seeking useful knowledge from its bearers and people, and they are the people of knowledge and religion. . . \" (3).",
    "foot_note": "1. (1) See: A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 309, 310). \n2. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 314). \n3. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 304).",
    "book_id": "1179",
    "new_page_number": 29
  },
  {
    "serial_number": "7506248",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 27,
    "volume_number": 1,
    "text": "There is no doubt that one who does not receive knowledge from scholars is in great danger, as they cling to the wordings of those books while the meanings are absent from many of them (1). What increases the calamity is that this type [of person] does not ask scholars about what is hidden from him of meanings, so the intended meaning does not appear to him neither by his understanding nor by his inquiry, so he remains in ignorance and misguidance while thinking he is upon knowledge. regarding this, Sheikh Muhammad bin Abd al-Latif Al al-Sheikh and Sheikh Abdullah Al-Angari say: \". . . As for the one who clings to the apparent meanings of wordings from the speech of investigative scholars and does not present them to scholars but relies on his understanding, and perhaps says 'Our proof is Majmoo'at al-Tawhid or the speech of such-and-such scholar' while he does not know his intent by that speech, then this is ignorance and misguidance. . . If this is known, it becomes clear that the one who claims that he can dispense with taking from the scholars of Muslims by using Majmoo'at al-Tawhid is mistaken. . . \" (2). Sheikh Omar bin Salim says describing this affliction: \". . . As for the one who turns away from asking scholars or says 'Our proof is such-and-such book or Majmoo'at al-Tawhid or the speech of such-and-such scholar' while he does not know his intent by that, then this is ignorance and misguidance. . . \" (3). Sheikh Abd al-Latif bin Abd al-Rahman Al al-Sheikh explains that the presence of books alone is not sufficient, but knowledge must be taken from a divinely-guided scholar, saying: \". . . Even if",
    "foot_note": "1. (1) A letter by Sheikh Omar bin Salim, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 314). \n2. A letter by them both, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 297, 298). \n3. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 314).",
    "book_id": "1179",
    "new_page_number": 30
  },
  {
    "serial_number": "7506249",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 28,
    "volume_number": 1,
    "text": "books exist, they do not suffice unless accompanied by success [from Allah] and meanings, definitions, and rulings are taken from a divinely-guided scholar\" (1).",
    "foot_note": "1. (1) A letter by him, within Majmoo' al-Rasa'il wal-Mas'ail al-Najdiyyah: (3 / 80).",
    "book_id": "1179",
    "new_page_number": 31
  },
  {
    "serial_number": "7506250",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 29,
    "volume_number": 1,
    "text": "4- Abstinence from taking [knowledge] from scholars is mainly caused by losing trust in them due to desires, doubts, and envy that drive [people] to defame them. For this reason, the warning of the Imams of the Salafi Call came against defaming the truthful scholars of Muslims, because that creates a gap and increases it between scholars, students of knowledge, and the common people. This reflects negatively on students of knowledge; where Satan blocks them with his plot from receiving from scholars, and beautifies defaming them, accusing them of false charges, and casting ugly descriptions upon them; so that the gap increases, depriving students of knowledge from benefiting from those scholars and the useful knowledge Allah has provided them, so they remain in their misguidance and ignorance thinking they are upon something. Sheikh Omar bin Salim says: \"And among the plots of Satan also which blocked them from learning knowledge and seeking it is accusing the scholars of Muslims, thinking ill of them, and not taking from them, and this is a cause for the deprivation of knowledge. . . \" (1). And Sheikh Muhammad bin Abd al-Latif and Sheikh Abdullah Al-Angari say in warning against that: \"And among what Satan introduced to some religious people is accusing the scholars of Muslims of compromise (Mudahanah), thinking ill of them, and not taking from them. This is a cause for the deprivation of useful knowledge. Scholars are the heirs of the prophets in every time and place, so knowledge is not received except from them. So whoever abstains from taking from them",
    "foot_note": "1. (1) A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 314).",
    "book_id": "1179",
    "new_page_number": 32
  },
  {
    "serial_number": "7506251",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 30,
    "volume_number": 1,
    "text": ", and did not accept what they transmitted, has abstained from the inheritance of the Master of Messengers. . . And scholars are the trustees of Allah's religion, so it is obligatory upon every accountable person to take religion from its people, as some of the predecessors said: Indeed this knowledge is religion, so look from whom you take your religion. . . \" (1). The danger is not only in the deprivation of knowledge but extends to matters amongst the most dangerous:",
    "foot_note": "1. (1) A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 297).",
    "book_id": "1179",
    "new_page_number": 33
  },
  {
    "serial_number": "7506252",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 31,
    "volume_number": 1,
    "text": "a) Transgressing etiquette with scholars by describing them with inappropriate major sins, which a Muslim is not permitted to fall into, for it is backbiting of the heirs of the Prophets who sign on behalf of the Lord of the Worlds. Therefore, the Imams of the Call warned against that. Sheikh Saad bin Atiq says: \". . . And among that is what occurred from the extremists of these people of accusing the people of knowledge and religion and attributing negligence to them and abandoning the performance of what is obligatory upon them of Allah's command, Glory be to Him, and concealing what they know of the truth. These people did not know that backbiting the people of knowledge and religion and jesting with the honor of believers is a deadly poison, a hidden disease, and a clear and evident sin. . . \" (1). He, may Allah have mercy on him, clarifies that falling into this is a clear indication of the ignorance of its doer and a direct cause for the death of his heart, saying: \". . . Falling into [speaking against] the people of knowledge and religion, thinking ill of them, and attributing them to abandoning what Allah obligated upon them of calling to Allah and advising the leaders of the Muslims and their common folk. . . this is from their ignorance and lack of concern for what they fall into of backbiting the people of knowledge, defaming them, disparaging them, and diminishing them. And whoever falls into [speaking against] the people of knowledge with fault-finding and defamation, Allah afflicts him with the death of the heart. . . \" (2). These people did not observe the right of scholars, nor their great worth, nor their high status, and did not preserve for them their precedence in Islam and what they exerted in seeking knowledge. In this regard, Sheikh Saad bin",
    "foot_note": "1. (1) A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 302). \n2. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 304).",
    "book_id": "1179",
    "new_page_number": 34
  },
  {
    "serial_number": "7506253",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 32,
    "volume_number": 1,
    "text": "Atiq says: \". . . and seeking useful knowledge from its bearers and people, and they are the people of knowledge and religion who dedicated themselves to seeking the truth and guiding creation, when they became witnesses for them of guidance and justice, and protected themselves from the attributes of the people of error and misguidance. . . \" (1).",
    "foot_note": "1. (1) A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 304).",
    "book_id": "1179",
    "new_page_number": 35
  },
  {
    "serial_number": "7506254",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 33,
    "volume_number": 1,
    "text": "b) Following this matter is confirmation of a dangerous issue, which is that the one defaming scholars replaces them with those who match his whim from among the ignorant who have no true knowledge of the rulings of Sharia, those who knew a thing and missed things, who dress in the garb of scholars and knowledge while scholars are innocent of them. They stumble like a blind she-camel in blindness and blind misguidance (1). These people corrupt the beliefs of people and mislead them without knowledge. Sheikh Abd al-Latif bin Abd al-Rahman Al al-Sheikh says: \". . . And did Shirk occur on earth except by the opinion of the likes of these opposers who appear to people in the garb of scholars and the clothes of the righteous while they are the furthest of creation from what the Messengers brought. . . \" (2). He also says: \". . . And I informed you that this is one of the greatest means and biggest pretexts for the appearance of Shirk and forgetting Tawhid, and that among the greatest and most obscene of that is what issues from some of those whom the common people think are people of knowledge and bearers of religion, and what issues from them of anthropomorphism (Tashbih) and expressions whose chain of transmission is not connected and whose speaker is not protected [from error], and by this and the like, the breach widened. . . \" (3).",
    "foot_note": "1. (1) See: A letter by Sheikh Muhammad bin Abd al-Latif Al al-Sheikh and Sheikh Abdullah bin Abdul-Aziz Al-Angari, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 297). \n2. A letter by him, within Majmoo' al-Rasa'il wal-Mas'ail al-Najdiyyah: (3 / 224). \n3. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 146).",
    "book_id": "1179",
    "new_page_number": 36
  },
  {
    "serial_number": "7506255",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 34,
    "volume_number": 1,
    "text": "Sheikh Muhammad bin Abd al-Latif Al al-Sheikh emphasizes warning against resorting to those who are not known for established knowledge and firm footing in it, from among those who feigned knowledge while they do not possess the understanding that qualifies them to guide people and teach them, especially in problematic issues. He says: \". . . It is appropriate for one whose intention is good and calling to Allah to be cautious in matters, verify, avoid rashness and haste, and be keen on gentleness and kindness in the Call, for in that is much good. And it is appropriate for him to know who has a truthful footing and established knowledge, so he asks him and seeks his fatwa, and he should not look at persons nor those who have no insight. . . And the least of states, if the servant does not attain that, is to restrict himself to himself. . . \" (1).",
    "foot_note": "1. (1) A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 41).",
    "book_id": "1179",
    "new_page_number": 37
  },
  {
    "serial_number": "7506256",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 35,
    "volume_number": 1,
    "text": "The basis of the affliction with these people is that they prattle about what they do not know, speak on dilemmas, and address the greatest calamities, while they possess neither the name nor the trace of knowledge. These are the ones speaking about Allah without knowledge. Therefore, the Imams of the Salafi Call used to confront with full force, and warn by every means against following this methodology. Sheikh Abd al-Latif bin Abd al-Rahman Al al-Sheikh says in warning against that: \". . . And speaking about Allah without knowledge and delving into His religion without know-how or understanding is above Shirk and taking rivals with Him. . . \" (1). Their corrupting role exceeds that; they are among the greatest causes of division, disagreement, and discord. Sheikh Omar bin Salim says warningly: \"And among the matters that Satan beautified are division and disagreement in religion, and the cause of that is the speech of people ignorant of the rulings of Sharia. If the ignorant were silent, disagreement and speaking in Allah's religion without knowledge would fall away. And the ignorant delving into issues of knowledge has been forbidden by Allah Almighty in His Book where He says: {Say, \"My Lord has only forbidden immoralities - what is apparent of them and what is concealed - and sin, and oppression without right, and that you associate with Allah that for which He has not sent down authority, and that you say about Allah that which you do not know\"} (2)\" (3). And Sheikh",
    "foot_note": "1. (1) A letter by him, within Majmoo' al-Rasa'il wal-Mas'ail al-Najdiyyah: (3 / 171). \n2. Surah Al-A'raf: Verse (33). \n3. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 314).",
    "book_id": "1179",
    "new_page_number": 38
  },
  {
    "serial_number": "7506257",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 36,
    "volume_number": 1,
    "text": "Saad bin Atiq says: \"And among the greatest causes of division, disagreement, and turning away from the path of truth and fairness is what occurred from many people of issuing fatwas in Allah's religion without knowledge and delving into issues of knowledge without know-how or understanding\" (1). Because of the danger of this matter, their phrases appeared in their letters warning against speaking about Allah without knowledge, especially upon the appearance of this affliction (2). c) Emphasizing the importance of understanding the reality of enjoining good and forbidding evil, especially for students of knowledge. The intent is not knowing its obligation only; rather, the most important is knowing the method of optimal performance of both, especially the issue of forbidding evil. In this regard, the Revivalist Muhammad bin Abdul-Wahhab says: \". . . And the people of knowledge say: The one who enjoins good and forbids evil needs three things: To know what he enjoins and what he forbids, to be gentle in what he enjoins and what he forbids, and to be patient with the harm that comes to him in that. And you are in need of keenness to understand this and act upon it, for defect enters upon the person of religion only from lack of acting upon this or lack of understanding it. . . . . . So by Allah, by Allah, act upon what I mentioned to you and understand it, for if you do not do so, your denial will become harmful to the religion. . . \" (3).",
    "foot_note": "1. (1) A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 301). \n2. From that: A letter by Sheikh Abdullah Al-Angari, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 308, 309). \n3. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 25).",
    "book_id": "1179",
    "new_page_number": 39
  },
  {
    "serial_number": "7506258",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 37,
    "volume_number": 1,
    "text": "And Sheikh Muhammad bin Abd al-Latif Al al-Sheikh says: \". . . And enjoining good and forbidding evil does not stand straight except with insight and complete knowledge. . . \" (1). If he does not have knowledge and learning, Sheikh Muhammad bin Abd al-Latif Al al-Sheikh guides him saying: \". . . He should know who has a truthful footing and established knowledge, so he asks him and seeks his fatwa, and should not look at persons nor those who have no insight\" (2). If that is not [possible], the duty upon him as the Sheikh also guides is: \"To restrict himself to himself\" (3), so that he may be safe and others safe from him.",
    "foot_note": "1. (1) A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 41). \n2. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 41). \n3. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 41).",
    "book_id": "1179",
    "new_page_number": 40
  },
  {
    "serial_number": "7506259",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 38,
    "volume_number": 1,
    "text": "The Second Chapter: Fiqh (Jurisprudence) of What is Required During Denial. Perhaps there is no doubt that the actual practice of the duty of forbidding evil requires from the one performing it an understanding of the correct method of denial. Without this understanding, the goal is not achieved. This is a matter that has its important role in the success of the preacher. Perhaps among the most important things a Muslim must understand while forbidding evil are the following: First Demand - The Ruling if Denial Results in a Greater Corruption: What is meant here is that forbidding evil might result in the occurrence of a corruption greater than the evil itself. This is a known and witnessed matter. To perceive this matter in its reality, every Muslim must understand what the objective of divine legislation is, a matter which the Imams of the Salafi Call were concerned with. Sheikh Abd al-Latif bin Abd al-Rahman Al al-Sheikh says in one of his letters alerting to it: \"The objective of legislation and commands is achieving interests and repelling corruptions as much as possible, and it may not be possible except by committing the lighter of two harms or missing the lesser of two interests. . . \" (1).",
    "foot_note": "1. (1) A letter by him, within Majmoo' al-Rasa'il wal-Mas'ail al-Najdiyyah: (3 / 188).",
    "book_id": "1179",
    "new_page_number": 41
  },
  {
    "serial_number": "7506260",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 39,
    "volume_number": 1,
    "text": "The contemplator realizes the danger of incorrect understanding in the issue of prioritizing in forbidding evil. The Imams of the Salafi Call in Najd paid utmost attention to this matter, alerting to the duty regarding it. They clarify in many of their letters that if forbidding evil results in an evil greater than it, denial is not permissible; whether the result is a general corruption or a specific harm. Therefore, they used to emphasize this meaning in their letters and ground it by explaining that it is an old opinion held by scholars. Sheikh Muhammad bin Abdul-Wahhab says: \". . . Scholars mention that denying evil, if it results in division, its denial is not permissible. . . \" (1).",
    "foot_note": "1. (1) A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 25).",
    "book_id": "1179",
    "new_page_number": 42
  },
  {
    "serial_number": "7506261",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Call in Najd in Countering Violence and Terrorism through Calling to the Jurisprudence of Denying Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 40,
    "volume_number": 1,
    "text": "Sheikh Hamad bin Nasser bin Mu'ammar clarifies further regarding this matter, saying: \". . . But if he fears the occurrence of a greater evil, denial drops [is not required], and he denies with his heart. Scholars have stated that if evil cannot be denied except by the occurrence of an evil greater than it, it should not be done, because the foundation of Sharia is upon achieving interests and minimizing corruptions. . . \" (1). Indeed, Sheikh Muhammad bin Abd al-Latif Al al-Sheikh used to call in his letters for thinking about the result before practicing the ritual, so that defect does not occur and then treatment becomes difficult, especially after the occurrence of conflict and discord. He says: \"I also advise you with insight in enjoining good and forbidding evil. If a person commands matters of good, he should look: if that command results in good in the immediate and the future and safety in religion, and commanding it is most conducive to welfare; he proceeds with it with knowledge, forbearance, and righteous intention. And if that command results in evil, tribulations, division of word in the immediate and the future, and harm in religion and worldly life, and welfare lies in leaving it; leaving it becomes obligatory and he should not command it; because repelling corruptions takes precedence over bringing interests. . . \" (2).",
    "foot_note": "1. (1) A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 31). \n2. A letter by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 41).",
    "book_id": "1179",
    "new_page_number": 43
  },
  {
    "serial_number": "7506262",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 41,
    "volume_number": 1,
    "text": "Among those who emphasized the obligation of observing this matter from the Imams of the Salafi Dawah in Najd is Sheikh Sulaiman bin Sahman. He decided that if the forbidding of any evil causes the suppression of the people of truth, prevents them from manifesting their religion, gathering upon it, and calling to it, and empowers their enemies against them—scattering and displacing them everywhere, harming them, or restricting them—or if it causes the manifestation of the people of falsehood and the raising of their word over the people of truth; then forbidding [the evil] is not permissible. Rather, in this situation, it is contrary to what Allah loves and what brings one closer to Him. Here, the legal maxim stating that 'repelling harm takes precedence over bringing benefits' must be observed. Indeed, the Sheikh clarifies another matter no less important than the former, which is: that even if the rulers were judged to be apostates, yet they do not enforce the laws of disbelief in their lands and do not prevent the manifestation of the rituals of Islam, then the land is a land of Islam due to the non-enforcement of the laws of disbelief therein. For this reason, observing the repulsion of the harm of forbidding [evil]—which leads to the suppression of the people of truth, their displacement, scattering, humiliation, and the manifestation of the falsehood of the people of falsehood and the elevation of their word over the people of truth—takes precedence over the benefit of forbidding the rulers and opposing them. Due to the importance of his words, may Allah have mercy on him, in this regard, I quote them textually here, where he says: \"Scholars have mentioned that repelling",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 44
  },
  {
    "serial_number": "7506263",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 42,
    "volume_number": 1,
    "text": "harm takes precedence over bringing benefits. Thus, repelling the harm of suppressing the people of truth, preventing the manifestation of their religion, their gathering upon it, and the call to it, and avoiding their scattering and displacement everywhere, takes precedence over bringing the benefit of forbidding the rulers, given their strength, dominance, and coercion, and the inability of the people of truth to oppose them, show enmity towards them, or migrate from their lands, merely by entering into their obedience in matters other than disobedience to Allah and His Messenger. So, if the people of religion have a domain and a gathering upon the truth, and they have no opposer regarding what they manifest of their religion, nor any preventer preventing them from that; and even if the rulers were apostates from the religion by allying with the disbelievers, yet they do not enforce the laws of disbelief in their lands and do not prevent the manifestation of Islamic rituals; then the land is a land of Islam due to the non-enforcement of the laws of disbelief, as mentioned by our Sheikh, Sheikh Abdul Latif, may Allah have mercy on him, referencing the Hanbalis and other scholars. If the situation is as we have described, then observing the repulsion of the harm of suppressing the people of truth, their displacement, scattering, and humiliation, and the manifestation of the falsehood of the people of falsehood and the elevation of their word over the people of truth, as well as observing the bringing of benefits in honoring the people of truth, respecting them, and not opposing them, takes precedence in this case over the benefit of forbidding the rulers without the ability to do so, due to the dominance and strength of the people of falsehood,",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 45
  },
  {
    "serial_number": "7506264",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 43,
    "volume_number": 1,
    "text": "and the inability of the people of truth to oppose them, and the lack of implementation of matters that Allah loves and is pleased with. Thus, repelling the harm resulting from forbidding the rulers is weightier than the benefit resulting from opposing them by manifold times. If a matter beloved to Allah necessitates a matter hated and detested by Allah, and the missing of a matter more beloved to Allah than it, then that is not what Allah loves or brings one closer to Him; due to the harms and missed benefits built upon that. Scholars have mentioned a rule upon which the rulings of Sharia are built, which is committing the lesser of two evils to avoid the greater of them, and missing the lesser of two benefits to achieve the greater of them\" (1).",
    "foot_note": "1. (1) A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 234, 235).",
    "book_id": "1179",
    "new_page_number": 46
  },
  {
    "serial_number": "7506265",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 44,
    "volume_number": 1,
    "text": "The Imams of the Salafi Dawah in Najd realized the importance of this matter; thus, through their letters and fatwas, they taught students of knowledge and the general public to balance between benefits and harms. For instance, a fatwa by Sheikh Abdul Latif bin Abdul Rahman Al-Sheikh says: \"...As for initiating the greeting of peace (Salam), a disbeliever should not be initiated with Salam; rather, it is the greeting of the people of Islam. However, if a preponderant harm is feared or a benefit is missed [by not doing so], then there is no harm in initiating it...\" He then says regarding the application of methods of forbidding [evil] and how interests and harms can be observed therein: \"...And boycotting (Hajar) was only legislated for the benefit within it and to deter the wrongdoer. So if that is negated and there becomes a preponderant harm in it, then it is not legislated\" (1). The conclusion is that the application of this ritual has an important scale by which it must be measured, which is the observance of benefits and harms. It is not correct for the performance of this ritual to be a cause for what is not praiseworthy; such as empowering the people of falsehood over the people of truth! And creating reasons for them to launch their aggression, practice their oppression, attack the people of truth, and inflict every evil and harm upon them and their principles, noting that the ways of change and reform are multiple, not just a single path.",
    "foot_note": "1. (1) A treatise by him, within Majmu'at Al-Rasa'il wa Al-Masa'il Al-Najdiyyah: (3 / 128).",
    "book_id": "1179",
    "new_page_number": 47
  },
  {
    "serial_number": "7506266",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 45,
    "volume_number": 1,
    "text": "From the foregoing, we notice the foresight of the Imams of the Salafi Dawah in Najd in addressing such phenomena and confronting them. It becomes clear, beyond any doubt, the soundness of their thought and principles regarding freedom from calling for the use of violence and terrorism in forbidding [evil] in every case, and that they possess a balanced methodology in addressing evils and dealing with them, which they exerted their effort to explain and clarify to the people in general and to students of knowledge in particular.",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 48
  },
  {
    "serial_number": "7506267",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 46,
    "volume_number": 1,
    "text": "Requirement 2 - The Method of Denial (Inkar): There is no doubt that the method of forbidding evil is very important for the addressee's acceptance of this denial, as human souls lean towards gentle speech and good treatment. Therefore, the command for goodness in general and goodness in speech in particular came in the Book of Allah Almighty: {And do good; indeed, Allah loves the doers of good} (1), {And speak to people good [words]} (2). Whoever wants to change evil with harsh words and a rough style; the probability of his success is extremely weak. It is not an acceptable excuse to use the sin as a justification for harshness, since forbidding [evil] is for reform, not for punishment. The Imams of the Salafi Dawah in Najd exerted blessed efforts in offering advice and guidance to reach the application of methods of forbidding evil according to what the Sharia brought. They also played a large and active role in confronting deviations from the divine methodology in this regard. Their efforts are highlighted through the following: 1) Correcting misconceptions that might push towards using harshness and violence in forbidding evil, most notably: a - The fact that the doer of evil committed what Allah forbade, and the correctness of the forbidder's stance. b - Some people's belief that kindness and gentleness are a form of compromising the religion of Allah. c - The belief that harshness is the default, and explaining the actual default in Dawah and encouraging it.",
    "foot_note": "1. (1) Surah Al-Baqarah: Verse (195). \n2. Surah Al-Baqarah: Verse (83).",
    "book_id": "1179",
    "new_page_number": 49
  },
  {
    "serial_number": "7506268",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 47,
    "volume_number": 1,
    "text": "The details of this are as follows: a - Some whose jealousy for Allah's prohibitions has exceeded the legally intended limit may understand that the mere fact that the doer of evil has fallen into sin and committed evil, and that what they themselves hold is correct, permits them to address this error in any form, even if by transgressing against the doer of evil with insults, abuse, or beating. This is a wrong understanding. Therefore, we find Sheikh Muhammad bin Abdul Wahhab pointing out in his treatment of such a matter, saying: \"...Some religious people forbid an evil while being correct [in principle]; but they err in intensifying the matter to a point that causes division among the brothers...\" (1). Sheikh Abdul Rahman bin Hasan Al-Sheikh says about the doer of evil: \"...He should be boycotted and disliked; this is what Muslims do with him without violence, cursing, or beating. It is sufficient in his case to show disapproval of him and disapproval of his action...\" (2). b - Among the defects addressed by the Imams of the Salafi Dawah regarding this issue is the belief of some that kindness and gentleness with the doer of evil is a form of compromising (Mudahanah) in the religion of Allah and prioritizing the satisfaction of creation over the satisfaction of the Creator, Glory be to Him. There is no doubt that this unsound understanding indicates the ignorance of its holder and pushes him to adopt harshness and violence with every sinner, eventually becoming second nature to him even with every Muslim.",
    "foot_note": "1. (1) A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 25). \n2. A treatise by him, within Majmu'at Al-Rasa'il wa Al-Masa'il Al-Najdiyyah: (4 / 409).",
    "book_id": "1179",
    "new_page_number": 50
  },
  {
    "serial_number": "7506269",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 48,
    "volume_number": 1,
    "text": "The Imams of the Salafi Dawah had their role and correspondence in correcting this wrong understanding and rectifying it. An example is the valuable speech of Sheikh Abdul Latif bin Abdul Rahman Al-Sheikh in explaining the difference between Mudara (diplomacy/gentleness) and Mudahanah (compromise), where he says: \"As for the difference between Mudara and Mudahanah: Mudahanah is abandoning what is obligatory for Allah regarding jealousy [for the religion], enjoining good, and forbidding evil, and overlooking that for a worldly purpose and personal desire... As for Mudara: It is repelling corrupting evil with gentle speech and abandoning harshness, or turning away from him if his evil is feared or if something greater than what is currently involved results from it...\" (1). With this, the flawed understanding surrounding this issue is clarified.",
    "foot_note": "1. (1) A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 35, 36).",
    "book_id": "1179",
    "new_page_number": 51
  },
  {
    "serial_number": "7506270",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 49,
    "volume_number": 1,
    "text": "c - Among the errors in understanding is the belief that harshness is the default and that it was the habit of the Prophet, peace and blessings be upon him, based on the Almighty's saying: {O Prophet, strive against the disbelievers and the hypocrites and be harsh upon them} (1). Sheikh Abdul Latif bin Abdul Rahman Al-Sheikh clarifies this meaning by saying: \"...This is resorted to if harshness becomes specific [necessary] and leniency is of no use, as is clearly evident. As it is said, 'The last remedy is cauterization.' This is also contingent upon capability and on the condition that no [greater] harm results from it... Furthermore, the verse, the verse of harshness, is Medinan, revealed after the Prophet, peace and blessings be upon him, and his companions were capable of Jihad by hand and after the persistence in disbelief by their enemies became apparent. So harshness fell into its proper place where leniency was of no avail\" (2). Describing the state of the Prophet, peace and blessings be upon him, in his call to the polytheists, he says: \"...So he remained like that, calling, reminding, preaching, and warning with the utmost kindness and leniency. Sometimes he would use kunya (nicknames) for those addressed, sometimes he would come to the club of the leaders or chiefs, and at times he would say: 'O Allah, forgive my people for they do not know.' And suffice it for you a character praised by the Quran, which praised his forbearance in Dawah and clarity...\" (3). He confirms this meaning by giving an example from the era of the Companions of a man among them who had the greatest impact on calling people and guiding them, and he was among",
    "foot_note": "1. (1) Surah At-Tawbah: Verse (73). \n2. A treatise by him, within Majmu'at Al-Rasa'il wa Al-Masa'il Al-Najdiyyah: (3 / 187). \n3. A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 187).",
    "book_id": "1179",
    "new_page_number": 52
  },
  {
    "serial_number": "7506271",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 50,
    "volume_number": 1,
    "text": "the gentlest of people in style and the softest in expression, namely Al-Siddiq (Abu Bakr), may Allah be pleased with him. In contrast, there is what some Companions encountered of rebuke from the Prophet, peace and blessings be upon him, when they were hard on people, despite their good intent and righteous intention. He says: \"...Al-Siddiq was the most perfect of people, and for that reason, many nations accepted Islam at his hand and benefited from him, unlike others, for it was said to some of them: 'Indeed, among you are those who repel people'\" (1). Sheikh Abdul Latif bin Abdul Rahman Al-Sheikh considers that Jihad by proof and clarity takes precedence over Jihad by the sword and spear (2). Whoever contemplates the purpose of Dawah and the objectives of Sharia realizes that the intent is to achieve benefits and repel harms. This requires consideration and verification to reach them by correct means. Whoever neglects this or wastes it, his crime against people and against the Law is the greatest crime (3). 2) Clarifying the deviations in the methods of forbidding evils that some people have fallen into and warning against them:",
    "foot_note": "1. (1) A treatise by him, within Majmu'at Al-Rasa'il wa Al-Masa'il Al-Najdiyyah: (3 / 188). \n2. See: A treatise by him, within Majmu'at Al-Rasa'il wa Al-Masa'il Al-Najdiyyah: (3 / 128). \n3. See: A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 32).",
    "book_id": "1179",
    "new_page_number": 53
  },
  {
    "serial_number": "7506272",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 51,
    "volume_number": 1,
    "text": "Changing evil and forbidding it must be restricted by the Sharia and must not exceed it in any case; because the one who exceeds what Allah has legislated is legislating for himself, and this is a forbidden matter. Rather, a Muslim must stop at the limits of Allah and not transgress them: {These are the limits of Allah, so do not transgress them} (1). The methods of forbidding evil came according to general rules clarified by the Imams of the Salafi Dawah in Najd, so it is not permissible to violate them in any case, otherwise the harm of the action would be great. Sheikh Abdul Latif bin Abdul Rahman Al-Sheikh says in clarifying this and warning against transgressing it: \"...The intent of legislation and commands is to achieve benefits and repel harms as much as possible. It may not be possible except by committing the lighter of two harms or missing the lesser of two benefits. Consideration of persons, times, and conditions is a great principle; whoever neglects it and wastes it, his crime against the Law and people is the greatest crime. Scholars have established these universals and particulars and detailed the legal etiquettes. So whoever wants to set himself up in the station of Dawah, let him learn first and let him jostle with the caravan of scholars before he leads, so he calls with proof and evidence and knows how to walk in that path. For ardent love is not known except by one who suffers it, and sciences are not known except by one who takes them from their people and accompanies their narrator...\" (2).",
    "foot_note": "1. (1) Surah Al-Baqarah: Verse (229). \n2. A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 188).",
    "book_id": "1179",
    "new_page_number": 54
  },
  {
    "serial_number": "7506273",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 52,
    "volume_number": 1,
    "text": "The Imams of the Salafi Dawah in Najd did not satisfy themselves with rooting this issue; rather, they followed what was happening in the field of Dawah, alerting to errors, warning against slips, and clarifying the methodology of the righteous Salaf in Dawah and denial. Perhaps among their most prominent directives in countering violence and terrorism in the methods of denial are the following: a) Their confrontation of the excessive use of the method of boycotting (Hajar): The intended meaning of Hajar is boycotting the doer of evil, not speaking to him, and not greeting him, as the Messenger of Allah, peace and blessings be upon him, did with the three who stayed behind the Battle of Tabuk (1).",
    "foot_note": "1. (1) Sahih Al-Bukhari, Muhammad bin Ismail Al-Bukhari: (3 / 151), Book of Maghazi (64), Chapter on the Hadith of Ka'b bin Malik (80), without edition, Dar Al-Fikr.",
    "book_id": "1179",
    "new_page_number": 55
  },
  {
    "serial_number": "7506274",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 53,
    "volume_number": 1,
    "text": "The Imams of the Salafi Dawah emphasized that this method is not a light matter as some believe, such that one boycotts whoever disagrees with his opinion or does not accept from him. Rather, it requires jurisprudence (Fiqh) and insight. regarding this, Sheikh Muhammad bin Abdul Latif Al-Sheikh says: \"Boycotting the people of disobedience varies according to the variation of persons and times, and enjoining good and forbidding evil cannot be upright except with insight and complete knowledge...\" (1). They clarify that boycotting was legislated for a great wisdom, which is discipline and censure. In this regard, Sheikh Muhammad bin Abdul Latif Al-Sheikh and Sheikh Abdullah Al-Anqari say: \"...Boycotting was only legislated as discipline and censure by leaving the greeting of peace upon him and not teaching him until he retreats from his disobedience...\" (2).",
    "foot_note": "1. (1) A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 41). \n2. A treatise by them, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 299).",
    "book_id": "1179",
    "new_page_number": 56
  },
  {
    "serial_number": "7506275",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 54,
    "volume_number": 1,
    "text": "Among the important matters in this chapter that the Imams of the Salafi Dawah emphasized is balancing between the benefit of boycotting and its harm. Sheikh Abdul Latif bin Abdul Rahman Al-Sheikh says: \"Boycotting was only legislated for the benefit within it and to deter the wrongdoer. So if that is negated and there becomes a preponderant harm in it, then it is not legislated...\" (1). Sheikh Muhammad bin Abdul Latif Al-Sheikh and Sheikh Abdullah Al-Anqari say: \"...It is legislated to boycott the one who openly commits sins, whether he is from the people of the desert or the city, if there is a preponderant benefit in it and no harm results from it; because repelling harms takes precedence over bringing benefits\" (2). If boycotting is applied without jurisprudence or insight, its harm might be greater and larger. Sheikh Umar bin Salim says regarding this: \"...And among the matters that Satan introduced to some people—to attain his goal of misleading them, dividing their word, and casting hatred among them, which is the shaver (destroyer), i.e., the destroyer of religion—is what he incited them to regarding mutual boycotting without a cause necessitating that; rather, merely for an opinion opposing the Book and the Sunnah. This contradicts the Islamic brotherhood that Allah established between Muslims, which necessitates connection, mercy, love, and sympathy...\" (3).",
    "foot_note": "1. (1) A treatise by him, within Majmu'at Al-Rasa'il wa Al-Masa'il Al-Najdiyyah: (3 / 128). \n2. A treatise by them, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 396). \n3. A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 316).",
    "book_id": "1179",
    "new_page_number": 57
  },
  {
    "serial_number": "7506276",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 55,
    "volume_number": 1,
    "text": "b) Public defamation of rulers in gatherings and assemblies, where the one doing it considers it a form of [praiseworthy] denial. There is no doubt that this matter needs contemplation and consideration. The Imams of the Salafi Dawah confronted this wrong method and clarified that defaming rulers in gatherings and public assemblies, and believing that this is part of the forbidding of evil that is obligatory upon the servants, is contrary to what the righteous Salaf were upon. This action is patently false due to the consequences resulting from it; it does not remove an evil, but it fuels hatred and animosity in the hearts of the common people towards their rulers, and in the hearts of the rulers towards those who do it or agree with it. They clarify the correct methodology and way for denial in contrast to this approach. In this regard, Sheikh Muhammad bin Abdul Latif Al-Sheikh says: \"...As for the sins and violations that may occur from the rulers which do not necessitate disbelief and exit from Islam, the obligation regarding them is to advise them in the legal manner with gentleness, and to follow what the righteous Salaf were upon regarding not defaming them in gatherings and public assemblies, and believing that this is part of the forbidding of evil obligatory upon the servants. This is a gross mistake and clear ignorance; its doer does not know the great corruptions in religion and worldly life that result from it, as known by one whose heart Allah has enlightened and who knows the way of",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 58
  },
  {
    "serial_number": "7506277",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 56,
    "volume_number": 1,
    "text": "the righteous Salaf and the Imams of the religion...\" (1). Sheikh Muhammad bin Abdul Wahhab explains the correct methodology in forbidding rulers in detail so as not to leave room for corrupters to enter into that, saying: \"...The comprehensive principle for all of this is that if an evil originates from a prince or anyone else, he should be advised gently and secretly so that no one overlooks it. If he agrees, [good]; otherwise, men whom he accepts should be called upon him secretly. If he does what [is advised], then public denial is possible, unless it is against a prince who was advised and did not agree, and men were called upon him and he did not agree; then the matter should be raised to us secretly. The people of every town should copy this book and keep a copy with them...\" (2). c) Among the deviant methods in this chapter is what some use regarding gathering for the sake of denial openly and without secrecy. This is contrary to what the righteous Salaf were upon. Imam Abdul Aziz bin Abdul Rahman Al-Faisal (3) says: \"...And implementing movements among the brothers and their gathering for the sake of forbidding evil openly is contrary to what Ahl al-Sunnah wal-Jama'ah from the scholars were upon, and what Sheikh of Islam Muhammad bin Abdul Wahhab was upon...\" (4). This is undoubtedly an innovated approach from which great harm occurs, potentially being the start of a blind sedition, and for that reason, the warning against it came.",
    "foot_note": "1. (1) A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 290). \n2. A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 25, 26). \n3. He is King Abdul Aziz bin Abdul Rahman bin Faisal bin Turki bin Abdullah bin Saud. He was able to reclaim the rule of his forefathers in the year 1319 AH, and with him, the Salafi Dawah regained its strength and glory. He died, may Allah have mercy on him, in the year 1373 AH. Najd wa Mulhaqatiha wa Sirat Al-Malik Abdul Aziz, Amin Rihani: (105), 4th ed., 1972 AD, Dar Al-Rihani, Beirut. \n4. A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 307).",
    "book_id": "1179",
    "new_page_number": 59
  },
  {
    "serial_number": "7506278",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 57,
    "volume_number": 1,
    "text": "d) The use of violence, whether verbal such as cursing and insults, or physical such as beating. Successive directives came from the Imams of the Salafi Dawah clarifying the correct methodology in denial and confronting this approach and warning against it, due to its corrupting effects, the most important of which is the division it causes among brothers. The Reviver Sheikh Muhammad bin Abdul Wahhab says: \"...Some religious people forbid an evil while being correct [in principle]; but they err in intensifying the matter to a point that causes division among the brothers...\" (1).",
    "foot_note": "1. (1) A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 25).",
    "book_id": "1179",
    "new_page_number": 60
  },
  {
    "serial_number": "7506279",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 58,
    "volume_number": 1,
    "text": "The principle is that denial should not be with any violence, cursing, insults, or beating; rather, showing disapproval of him is sufficient. If a sin is found, it is denied upon the one who did it or was pleased with it if seen (1). Sheikh Sa'd bin Hamad bin Atiq says in warning against what some extremists fell into: \"...And among that is what they committed themselves to and obligated others from the Bedouin Muslims to do, such as abandoning dwelling in the desert, committing to city life, constructing buildings, being strict regarding turbans, and transgressing against many people of Islam and Tawhid with severe beating, boycotting, and threatening, and other matters by which they departed from the judgment of reason, justice, and fairness, and organized themselves into the ranks of the people of ignorance, oppression, and arbitrariness. Yet, they think they are guided and claim they are reformers...\" (2). Sheikh Umar bin Salim says regarding this: \"...And among the plots of Satan is what he beautified for some people regarding overbearingness against people with beating, violent reprimand, bad speech, threatening people, shaming people and finding faults in them, and slandering them. He introduced to them that this is from the chapter of enjoining good and forbidding evil. These actions are among the greatest evils, and declaring them lawful and believing they are part of the religion is greater than doing them. These people did not understand the forbidding of evil that the Sharia brought, for",
    "foot_note": "1. (1) See: A treatise by Sheikh Abdul Rahman bin Hasan Al-Sheikh, within Majmu'at Al-Rasa'il wa Al-Masa'il Al-Najdiyyah: (4 / 409). \n2. A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 302).",
    "book_id": "1179",
    "new_page_number": 61
  },
  {
    "serial_number": "7506280",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 59,
    "volume_number": 1,
    "text": "forbidding evil is removing the evil, not beating its doer...\" (1). 3) Repeated emphasis from the Imams of the Salafi Dawah on the obligation of gentleness in forbidding evil and calling to Allah in general, and that this is the ideal and most correct approach followed by the righteous Salaf. Sheikh Muhammad bin Abdul Wahhab emphasizes that denial must be with gentleness, kindness, and in a hidden manner between the doer of evil and the one forbidding him (2). Sheikh Abdul Latif bin Abdul Rahman Al-Sheikh confirms this in a letter to some students of knowledge, advising them to call to Allah Almighty, emphasizing the use of kindness and leniency with those being called, saying: \"...What I see for you in this mixing is patience in the station of Dawah and kindness in conveying from your Prophet...\" (3). This is a general methodology in Dawah for them. Sheikh Muhammad bin Abdul Latif Al-Sheikh entrenches this in the preachers and people of his time, saying: \"...It befits one whose intention is good and calling to Allah Almighty to be cautious in matters, verify, avoid recklessness and haste, and be keen on gentleness and kindness in Dawah, for in that there is much good...\" (4).",
    "foot_note": "1. (1) A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 317). \n2. A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 25). \n3. A treatise by him, within Majmu'at Al-Rasa'il wa Al-Masa'il Al-Najdiyyah: (3 / 185). \n4. A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 41).",
    "book_id": "1179",
    "new_page_number": 62
  },
  {
    "serial_number": "7506281",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 60,
    "volume_number": 1,
    "text": "Requirement 3 - Forbidding [Evil] Upon the Rulers: The Sharia of Islam is a perfect law with no defect or slip, there is no doubt or suspicion in that, for the Legislator is the All-Knowing, the All-Wise, Exalted be He. Perhaps among the greatest things brought by the Sharia is the emphasis on considering persons, times, and conditions; this is considered one of the great principles that must be observed and considered. Speaking about the issue of forbidding the supreme Sultan, or any of the rulers and princes who hold authority and power, is a lengthy discussion. It suffices us here to point out the efforts of the Imams of the Salafi Dawah in entrenching the concepts of Ahl al-Sunnah wal-Jama'ah in calling to the jurisprudence of forbidding rulers and princes; the issue in which understandings have slipped, causing broad corruption. I point to the following:",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 63
  },
  {
    "serial_number": "7506282",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 61,
    "volume_number": 1,
    "text": "a) The Imams of the Dawah emphasize practically and theoretically the importance of good relations between scholars and princes, and that this has good effects on both parties or on the society as a whole. Regarding this, the Reviver Sheikh Muhammad bin Abdul Wahhab says: \"...For if the Prince does not make the people of religion his entourage, his entourage will become the people of evil...\" (1). Indeed, he, may Allah have mercy on him, sees that the matter of religion is not set right for the scholars nor for the rulers unless it is through solidarity, mutual support, and cooperation between them (2). Imam Saud bin Abdul Aziz, may Allah have mercy on him, says in emphasizing this meaning, directing princes, students of knowledge, preachers, and the general public: \"...And every land where a group of religious people gather and become one hand, along with their prince and their Mutawwa' (religious scholar/teacher); the prince becomes a spear for the people of religion, strengthens their upper arm, protects their leg, and unties their hands [gives them freedom to act], and the Mutawwa' supports the prince, stands with the people of religion, spreads knowledge in his group, and encourages them to study...\" (3). He, may Allah have mercy on him, warns princes against opposing that, saying: \"...And the prince who wants the emirate only for chieftainship and is not pleased that someone else commands the truth and forbids falsehood, we know that he is a sheikh seeking kingship, he is not seeking religion or truth, and we have another matter with him. As for the one whose goal is religion, he changes his path, classifies the religious group,",
    "foot_note": "1. (1) A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 239). \n2. See: A treatise by Sheikh Muhammad bin Abdul Wahhab, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 239). \n3. A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (9 / 21).",
    "book_id": "1179",
    "new_page_number": 64
  },
  {
    "serial_number": "7506283",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 62,
    "volume_number": 1,
    "text": "upholds their right, manifests their dignity, makes them his entourage and people of his council and opinion, distances the people of immorality and disobedience, and disciplines them with discipline that deters them... and the people of religion, I put them forward and give them free hand, and I prevent the princes from preventing the people of religion from speaking the truth and commanding it... News reached us that some princes are domineering over those who claim religion, with matters that appear right but are internally deceptive... No prince does this with the people of religion and I leave him in the emirate for a single day...\" (1). In a practical application of the depth of the relationship between scholars and rulers, Sheikh Abdul Rahman bin Hasan Al-Sheikh says in a letter from him to Imam Faisal bin Turki: \"From your lover who prays for you in the unseen, Abdul Rahman bin Hasan, to the son Imam Faisal bin Turki... I was, and Allah knows my truthfulness in what I said, loving you and prioritizing you in love over those who passed from your family and my family. The day I meet with you is a joyful day for me, and I have no reward for you except supplication and advice privately...\" (2).",
    "foot_note": "1. (1) A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (9 / 21). \n2. A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (9 / 30).",
    "book_id": "1179",
    "new_page_number": 65
  },
  {
    "serial_number": "7506284",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 63,
    "volume_number": 1,
    "text": "From the foregoing, the interest of the Imams of the Salafi Dawah in Najd in strengthening the bond between scholars and princes becomes clear, and that the establishment of religion in its entirety happens through that. Their methodology in emphasizing that and applying it on the ground becomes clear, which produced a Salafi call that renewed religion in hearts and minds and established a state not to be underestimated. b) Alerting to the ideal methodology in dealing with rulers and forbidding them when some sins and legal violations occur from them—which no human is free from—and explaining the danger of transgressing this methodology and the repercussions of that negativity on the Dawah and society as a whole. This becomes clear through the following points: 1- It is obligatory for preachers to know the status and rank that Allah has bestowed upon rulers. Dealing with them is not like dealing with other people. For this reason, their mistakes and slips should not be hunted for; rather, they should be overlooked. Sheikh Muhammad bin Abdul Wahhab says: \"...And the people of religion must gather the people around their prince and overlook his slip; this is a matter that must be done by the people of religion, overlooking [faults] of their prince...\" (1). The meaning of overlooking (Taghadi) is: feigning negligence (Taghaful) (2), and this is a matter that may have more effect than confrontation and clash.",
    "foot_note": "1. (1) A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 239). \n2. Al-Qamus Al-Muhit, Muhammad bin Yaqub Al-Firuzabadi: (1699), 2nd ed., 1407 AH, Mu'assasat Al-Risalah, Beirut.",
    "book_id": "1179",
    "new_page_number": 66
  },
  {
    "serial_number": "7506285",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 64,
    "volume_number": 1,
    "text": "2- Then, if there is to be forbidding [of evil], the correct methodology must be pursued with them. The Imams of the Dawah have mentioned a set of main landmarks for this, most notably: Gentleness: While harshness might be permissible in some situations against a doer of evil, this might be prohibited regarding the Imam and those in authority; because he might use his power to oppress the one who was harsh with him. For this reason, the Imams of the Salafi Dawah emphasize this landmark. The Reviver Sheikh Muhammad bin Abdul Wahhab says regarding this: \"...The comprehensive principle for all of this is that if an evil originates from a prince or anyone else, he should be advised gently...\" (1). Concealment and not announcing the advice. Regarding this, the Reviver Sheikh Muhammad bin Abdul Wahhab says: \"...The comprehensive principle for all of this is that if an evil originates from a prince or anyone else, he should be advised gently and secretly so that no one overlooks it. If he agrees, [good]; otherwise, men whom he accepts should be called upon him secretly. If he does... then the matter should be raised to us secretly...\" (2).",
    "foot_note": "1. (1) A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 25). \n2. A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 25, 26).",
    "book_id": "1179",
    "new_page_number": 67
  },
  {
    "serial_number": "7506286",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 65,
    "volume_number": 1,
    "text": "Commenting on this letter, Imam Abdul Aziz bin Abdul Rahman Al-Faisal says: \"...So it is obligatory upon a Muslim to forbid evil upon the one who committed it secretly, especially if it is against a prince, for forbidding evil upon rulers publicly is something that causes division and difference between the Imam and his subjects...\" (1). He also says: \"...And forbidding evil upon rulers publicly is part of spreading immorality (Fahisha)...\" (2). There is no doubt about the importance of observing these two matters which the legal texts came to clarify. Also, the Imams of the Salafi Dawah in Najd paid attention to other matters, but I wanted to point these two out due to their importance and the people's need to adhere to them today.",
    "foot_note": "1. (1) A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 306). \n2. A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 307).",
    "book_id": "1179",
    "new_page_number": 68
  },
  {
    "serial_number": "7506287",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 66,
    "volume_number": 1,
    "text": "c) Addressing every violation of the ideal Salafi methodology in dealing with rulers is considered burying fitnah (sedition) in its cradle, and protecting society from drowning in blind seditions that destroy everything. This is done by clarifying the truth regarding violations against rulers; such as encroaching on their authorities, thinking ill of them, or accusing them of atrocities and false charges; because that leads to praiseworthy consequences. One of the most dangerous things is encroaching on the authority of rulers and not hearing and obeying them, or acting without their permission (Iftiyat). There is no doubt that these matters have corrupting effects that destroy society as a whole and make the conflict internal. For this reason, the directives of the Imams of the Salafi Dawah in Najd came warning against this slippery slope, rebuking the one who fell into it, and advising him to return. Sheikh Muhammad bin Abdul Wahhab says: \"...And part of the perfection of unity is hearing and obeying whoever is put in command over us, even if he were an Abyssinian slave...\" (1). There is no doubt that hearing and obeying have reforming effects on society. Sheikh Muhammad bin Abdul Latif Al-Sheikh and Abdullah Al-Anqari say: \"...As for hearing and obeying the rulers of the Muslims, in it is the happiness of this world, and by it the interests of the servants in their livelihood are organized, and by it, they seek help in manifesting their religion and obeying their Lord...\" (2).",
    "foot_note": "1. (1) A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 239). \n2. A treatise by them, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 299).",
    "book_id": "1179",
    "new_page_number": 69
  },
  {
    "serial_number": "7506288",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 67,
    "volume_number": 1,
    "text": "Despite this clarification, there are those who have no understanding who resent their rulers for things in which they do not perceive the face of truth completely. So they oppose their rulers and belittle them based on their unsound understanding and destructive ignorance. Examples of this include what some resent against their rulers in matters of communication with disbelievers, dealing with them, concluding treaties, and reconciliations, thinking it to be [forbidden] alliance (Tawalli). Then they build unjust judgments and deviant behaviors upon that, which corrupt and do not reform. For this reason, the words of the Imams of the Salafi Dawah came warning against this slippery slope. Sheikh Umar bin Muhammad Ibn Salim says: \"...So it is forbidden to disobey the ruler and object to him in his guardianship, his dealing, his contracting, his treaty, and his reconciliation with disbelievers... It is not permissible to object to the ruler in any of that; because he is the deputy of the Muslims and the one looking into their interests...\" (1). Sheikh Muhammad bin Abdul Latif Al-Sheikh and Sheikh Abdullah Al-Anqari say in a letter by them in this regard: \"...So disobeying him is forbidden, as is objecting to him in his guardianship, his dealing, his contracting, and his treaty; because he is the deputy of the Muslims and the one looking into their interests, and his view for them is better than their view for themselves, because by his guardianship the system of religion becomes upright and the word of Muslims is united...\" (2).",
    "foot_note": "1. (1) A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 315). \n2. A treatise by them, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 298).",
    "book_id": "1179",
    "new_page_number": 70
  },
  {
    "serial_number": "7506289",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 68,
    "volume_number": 1,
    "text": "This unsound understanding and others like it might deviate some of them from the path, so they belittle the Imam and act in ways contrary to the purified Sharia, such as acting without the permission of the ruler (Iftiyat) regarding raiding (Ghazw) and establishing Hudud punishments (1), which is not valid except with his permission. Due to the danger of the matter, the Imams of the Salafi Dawah clarified the legal stance on such behaviors. Sheikh Muhammad bin Abdul Latif Al-Sheikh and Sheikh Abdullah Al-Anqari say: \"...It is not permissible for anyone to act without his permission (Iftiyat) or to proceed in any matters except with his permission. Whoever acts without his permission has strived to split the staff of the Muslims and separated from their group...\" (2). Sheikh Abdullah Al-Anqari says: \"...Going out against the obedience of the ruler and acting without his permission in raiding or otherwise is disobedience and opposition to Allah and His Messenger, peace and blessings be upon him, and contrary to what Ahl al-Sunnah wal-Jama'ah are upon...\" (3). Sheikh Abdullah Al-Anqari also explains the effects resulting from this matter, saying: \"...And that rebelling against the ruler and acting without his permission is among the greatest causes of corruption in the land and among the servants, and deviating from the path of guidance and righteousness...\" (4).",
    "foot_note": "1. (1) See: A treatise by Sheikh Abdul Rahman Hasan Al-Sheikh, within Majmu'at Al-Rasa'il wa Al-Masa'il Al-Najdiyyah: (4 / 409). \n2. A treatise by them, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 298). \n3. A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 326). \n4. A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 324).",
    "book_id": "1179",
    "new_page_number": 71
  },
  {
    "serial_number": "7506290",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 69,
    "volume_number": 1,
    "text": "For all of that, the Imams of the Salafi Dawah in Najd used to forbid slandering the rulers and belittling them, considering it a great stigma and a grave slip for whoever does it. Sheikh Muhammad bin Abdul Latif Al-Sheikh says: \"...And slandering the one whom Allah has placed in authority over you, finding fault with him, defaming him, and tracking his stumbling blocks to defame him publicly, and attributing compromise and silence to his scholars; this, by Allah, is a great stigma and a grave slip, may Allah protect you from its evil...\" (1). In conclusion, there is no doubt that these directives clarify the methodology followed by the Imams of the Salafi Dawah in Najd in countering the causes of violence, extremism, and terrorism which might be produced by the lack of correct jurisprudence on how to forbid evil, as they clarified what the Da'iyah must possess of jurisprudence for forbidding evil.",
    "foot_note": "1. (1) A treatise by him, within Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah: (7 / 282).",
    "book_id": "1179",
    "new_page_number": 72
  },
  {
    "serial_number": "7506291",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 70,
    "volume_number": 1,
    "text": "Conclusion: With praise to Allah and extolling Him, I conclude this research through which I was keen to clarify the distinguished methodology of the Imams of the Salafi Dawah in Najd in countering violence and extremism and the terrorism and destruction that follow them. I summarize it in the following: 1- The Imams of the Salafi Dawah in Najd followed the Salafi methodology in their call to Allah, that methodology stemming from the Book and the Sunnah. They drew from their spring, seeking help in understanding them from the words of the righteous Salaf, may Allah have mercy on them, for they are followers and imitators, not innovators or inventors. 2- The stance of the Imams of the Salafi Dawah in Najd on violence, extremism, and terrorism is summarized as: A stance that does not accept violence and extremism as a methodology nor terrorism as a path. Rather, it urges gentleness and kindness and emphasizes that it is the default in calling to Allah Almighty and forbidding evil. 3- The Imams of the Salafi Dawah in Najd emphasize that among the most important issues that must be observed in forbidding evil are: Benefits and Harms, through achieving the legal objective that repelling harms takes precedence over bringing benefits.",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 73
  },
  {
    "serial_number": "7506292",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 71,
    "volume_number": 1,
    "text": "4- The Imams of the Salafi Dawah, through their Salafi methodology, care about the issues that are indispensable for the one undertaking Hisbah (accountability/enjoining good) so that he is well-aware of the jurisprudence of forbidding evil. This is through Islamic knowledge, deliberation, slowness, lack of haste, realizing the reality of the doer of evil, and the ideal methods in forbidding evil that achieve its purpose. 5- Focusing on the category of rulers by clarifying their rights, what is due to them, the importance of harmony between scholars and princes, the best methods in forbidding [evil upon] them, and warning against deviations in that.",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 74
  },
  {
    "serial_number": "7506293",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 72,
    "volume_number": 1,
    "text": "Index of References and Sources: * Tarikh Najd (History of Najd) by Sheikh Hussein bin Ghannam, edited and verified by: Dr. Nasir al-Din al-Asad, 2nd ed., 1405 AH - 1985 AD, Dar Al-Shorouk, Beirut. * Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah (Biographies), Abdul Rahman bin Qasim Al-Qahtani Al-Najdi, 2nd ed., 1385 AH, Al-Noor Foundation for Binding and Printing - Riyadh, from the publications of Dar Al-Ifta in the Kingdom of Saudi Arabia. * Al-Durar Al-Saniyyah fi Al-Ajwibah Al-Najdiyyah, collected by: Abdul Rahman bin Qasim Al-Qahtani Al-Najdi, 2nd ed., 1385 AH, Al-Noor Foundation for Binding and Printing - Riyadh, from the publications of Dar Al-Ifta in the Kingdom of Saudi Arabia. * Ulama Al-Salim wa Talamidhatuhum wa Ulama Al-Qassim (Scholars of the Salim Family, their Students, and Scholars of Qassim), Saleh Al-Sulaiman Al-Omari, 1st ed., 1405 AH. * Ulama Al-Da'wah (Scholars of the Call), Abdul Rahman bin Abdul Latif Al-Sheikh, 1386 AH edition. * Ulama Najd Khilal Thamaniyat Qurun (Scholars of Najd During Eight Centuries), Abdullah bin Abdul Rahman Al-Bassam, 2nd ed., 1419 AH, Dar Al-Asimah, Riyadh. * Unwan Al-Majd (The Title of Glory), Uthman bin Bishr, 4th ed., 1403 AH, Publications of King Abdul Aziz Foundation - Riyadh. * Al-Qamus Al-Muhit, Muhammad bin Yaqub Al-Firuzabadi, 2nd ed., 1407 AH, Mu'assasat Al-Risalah, Beirut.",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 75
  },
  {
    "serial_number": "7506294",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Efforts of the Imams of the Salafi Dawah in Najd in Countering Violence and Terrorism through the Call to the Jurisprudence of Forbidding Evil",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 73,
    "volume_number": 1,
    "text": "* Kashf Al-Shubuhat (Removal of Doubts), Muhammad Abdul Wahhab, printed and published by the General Presidency for the Departments of Scientific Research, Printing and Translation Agency, Riyadh, 1413 AH. * Majmu'at Al-Rasa'il wa Al-Masa'il Al-Najdiyyah (Collection of Najdi Treatises and Issues), 2nd ed., year 1409 AH, Dar Al-Asimah, Riyadh. * Muluk Al-Saud (Kings of Al-Saud), Saud bin Hathlul, 2nd ed., 1402 AH. * Najd wa Mulhaqatiha wa Sirat Al-Malik Abdul Aziz (Najd and its Dependencies and the Biography of King Abdul Aziz), Amin Rihani, 4th ed., 1972 AD, Dar Al-Rihani, Beirut. * Waqi' Al-Da'wah ila Allah fi Al-Dawlah Al-Saudiyyah Al-Thaniyah (The Reality of the Call to Allah in the Second Saudi State), Saleh bin Abdullah Al-Frayh, a scientific thesis submitted to the College of Dawah and Media, Imam Muhammad bin Saud Islamic University, Riyadh (Unpublished).",
    "foot_note": "None",
    "book_id": "1179",
    "new_page_number": 76
  }
]