[
  {
    "text": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq\nAuthor: عرفة بن طنطاوي\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "new_page_number": 1
  },
  {
    "text": "sn: 1531\nbook_title: دَلَائِلُ التَّوْفِيقِ لِأَصَحِ طَرِيقٍ لِجَمْعِ الصِّدِّيِقِ\nbook_link: https://shamela.ws/book/936\nbook_id: 936\nauthor_name: عرفة بن طنطاوي\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/3169\nauthor_ID: 3169\neditor: Null\npublisher: مجلة البحوث الإسلامية العدد ٦٧، شعبان ١٤٤٢ هـ مجلة البحوث الإسلامية: مصرية محكّمة، بدأت في ١٤٣٦ هـ، تصدر شهريا، ويرأس تحريرها أ د عبد الفتاح محمود إدريس، أستاذ بقسم الفقه المقارن بكلية الشريعة والقانون جامعة الأزهر\nedition: Null\npages: 53\nvolumes: Null\npagination: [ترقيم صفحات البحث موافق للمجلة. ورقم الجزء هو رقم العدد]\ncategory: علوم القرآن وأصول التفسير\ncategory_id: 4",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "new_page_number": 2
  },
  {
    "serial_number": "1099935",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Sciences of the Quran and Principles of Exegesis. Book: Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq. Author: Arafa bin Tantawi. Research published in: Journal of Islamic Research, Issue 67, Sha'ban 1442 AH. Journal of Islamic Research: An Egyptian refereed journal, started in 1436 AH, published monthly, and its editor-in-chief is Prof. Dr. Abdel Fattah Mahmoud Idris, Professor in the Department of Comparative Jurisprudence at the Faculty of Sharia and Law, Al-Azhar University. Number of pages: 53 [The pagination of the research corresponds to the journal. The part number is the issue number]. Date of publication in Shamela: 24 Dhu al-Hijjah 1443.\nBook: Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq. Author: Arafa bin Tantawi. Research published in: Journal of Islamic Research, Issue 67, Sha'ban 1442 AH. Journal of Islamic Research: An Egyptian refereed journal, started in 1436 AH, published monthly, and its editor-in-chief is Prof. Dr. Abdel Fattah Mahmoud Idris, Professor in the Department of Comparative Jurisprudence at the Faculty of Sharia and Law, Al-Azhar University. Number of pages: 53 [The pagination of the research corresponds to the journal. The part number is the issue number]. Date of publication in Shamela: 24 Dhu al-Hijjah 1443.\nAuthor: Arafa bin Tantawi. Research published in: Journal of Islamic Research, Issue 67, Sha'ban 1442 AH. Journal of Islamic Research: An Egyptian refereed journal, started in 1436 AH, published monthly, and its editor-in-chief is Prof. Dr. Abdel Fattah Mahmoud Idris, Professor in the Department of Comparative Jurisprudence at the Faculty of Sharia and Law, Al-Azhar University. Number of pages: 53 [The pagination of the research corresponds to the journal. The part number is the issue number]. Date of publication in Shamela: 24 Dhu al-Hijjah 1443.\nResearch published in: Journal of Islamic Research, Issue 67, Sha'ban 1442 AH. Journal of Islamic Research: An Egyptian refereed journal, started in 1436 AH, published monthly, and its editor-in-chief is Prof. Dr. Abdel Fattah Mahmoud Idris, Professor in the Department of Comparative Jurisprudence at the Faculty of Sharia and Law, Al-Azhar University. Number of pages: 53 [The pagination of the research corresponds to the journal. The part number is the issue number]. Date of publication in Shamela: 24 Dhu al-Hijjah 1443.\nJournal of Islamic Research: An Egyptian refereed journal, started in 1436 AH, published monthly, and its editor-in-chief is Prof. Dr. Abdel Fattah Mahmoud Idris, Professor in the Department of Comparative Jurisprudence at the Faculty of Sharia and Law, Al-Azhar University. Number of pages: 53 [The pagination of the research corresponds to the journal. The part number is the issue number]. Date of publication in Shamela: 24 Dhu al-Hijjah 1443.\nNumber of pages: 53 [The pagination of the research corresponds to the journal. The part number is the issue number]. Date of publication in Shamela: 24 Dhu al-Hijjah 1443.\n[The pagination of the research corresponds to the journal. The part number is the issue number]. Date of publication in Shamela: 24 Dhu al-Hijjah 1443.\nDate of publication in Shamela: 24 Dhu al-Hijjah 1443.",
    "foot_note": "None",
    "book_id": "936",
    "new_page_number": 3
  },
  {
    "serial_number": "1099936",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 97,
    "volume_number": 1,
    "text": "Research Abstract: This is a research titled: \"Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq\". It refers to the second compilation of the Holy Quran, which was undertaken, executed, and overseen by the Rightly Guided Caliph Abu Bakr Al-Siddiq upon the counsel of Al-Farooq Umar bin Al-Khattab, assigning the task of heading the compilation committee to Zaid bin Thabit Al-Ansari. The compilation was also carried out with the participation of the Companions, may Allah be pleased with them all, and this took place in the year 12 AH. Al-Siddiq, may Allah be pleased with him, rose to the task and collected the Quran between the two covers of a single volume after it had been scattered during the first Prophetic compilation era. This occurred following the killing of seventy Quran reciters in the Battle of Yamama, which raised fears that the Quran might be lost with the loss of its carriers. The researcher has compiled this research and desired to present it in a concise form that combines academic grounding with verification and scrutiny, especially regarding certain issues where disagreement occurred among some scholars, and some issues and cases that have been frequently discussed and circulated without verification until they became taken for granted. The researcher also took care to ensure smooth style, ease of expression, eloquence of wording, and good presentation, to bring it closer to the view of its seekers, making it accessible and easy to handle for those interested, hoping that Allah accepts it from His weak servant with a good acceptance and causes it to grow.",
    "foot_note": "None",
    "book_id": "936",
    "new_page_number": 4
  },
  {
    "serial_number": "1099937",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 98,
    "volume_number": 1,
    "text": "Introduction: Praise be to Allah, and blessings and peace be upon the Messenger of Allah, his family, his companions, and those who follow him. To proceed: The Holy Quran is the speech of the Lord of the Worlds and His clear revelation, which Allah sent down upon the Seal of the Prophets and Messengers, our Prophet Muhammad, the best of all His creation, may Allah bless him and grant him peace. Allah has magnified it greatly and revered it immensely, describing it with the best attributes, characterizing it with the most majestic and greatest traits, and naming it with the most beautiful names. He, Glory be to Him, is the Initiator of its magnification, reverence, and exaltation. He, Glory be to Him, preserved it with Himself in a protected place approached only by the pure angels. He said in His description of it: {But this is an honored Quran. [Inscribed] in a Preserved Slate.} (Al-Buruj: 21-22). Then He combined its description and its protected place within it, the description of the angels who alone touch it, and the description of its Revealer, Glory be to Him, in His saying: {Indeed, it is a noble Quran. In a Register well-protected; None touch it except the purified. [It is] a revelation from the Lord of the worlds.} (Al-Waqi'a: 77-80). Due to the greatness of our Lord's speech, He selected the elite of His angels from the inhabitants of heaven to descend with it to the greatest and most noble spot on earth, upon the elite of His creation from the inhabitants of earth, in the mistress of nights of the master of months. He selected the most noble and purest of angels for its revelation, saying in description of the Noble Angel who descended with the Quran: {The Trustworthy Spirit has brought it down} (Al-Shu'ara: 193). Then He selected the purest of hearts to be the place of His speech's descent, so it would dwell in his heart to comprehend it, and He would preserve it for him therein, so he would fulfill its right within himself and in communicating it to his nation on behalf of his Lord to please Him. He said regarding that location upon which He sent it down and deposited it: {Upon your heart, [O Muhammad] - that you may be of the warners} (Al-Shu'ara: 194). And He said regarding that also: {For indeed, he has brought it down upon your heart by permission of Allah, confirming what came before it and as guidance and good tidings for the believers.} (Al-Baqarah: 97). This was in the greatest night, which our Lord described as a blessed night, saying: {Indeed, We sent it down during a blessed night. Indeed, We were to warn.} (Ad-Dukhan: 3). That night is the Night of Decree (Laylat al-Qadr), regarding which He said: {Indeed, We sent the Qur'an down during the Night of Decree. And what can make you know what is the Night of Decree? The Night of Decree is better than a thousand months.} (Al-Qadr: 1-3). This was in the best month, as our Lord said: {The month of Ramadhan [is that] in which was revealed the Quran, a guidance for the people and clear proofs of guidance and criterion.} (Al-Baqarah: 185). He made the beginning and end of its revelation in Makkah Al-Mukarramah near His Ancient House, about which He said: {Indeed, the first House [of worship] established for mankind was that at Bakkah - blessed and a guidance for the worlds.} (Al Imran: 96). And He made the conclusion of its revelation and the farewell of His revealed inspiration during the Farewell Pilgrimage in a sacred month,",
    "foot_note": "None",
    "book_id": "936",
    "new_page_number": 5
  },
  {
    "serial_number": "1099938",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 99,
    "volume_number": 1,
    "text": "next to His Sacred House. He said: {This day I have perfected for you your religion and completed My favor upon you and have approved for you Islam as religion.} (Al-Ma'idah: 3). Upon this reverence, glorification, and veneration for the speech of the Lord of the Worlds, the Noble Prophet raised his companions, may Allah be pleased with them. They loved the speech of Allah and stood with it in their prayer niches reciting it in groups and individually. They filled their times with it, adhered to its guidance, permitting what it permitted and forbidding what it forbade. They made it fill their hearts, hearing, and sight. They sought healing through it from physical and spiritual ailments, and referred to it for judgment in all their life affairs. The Prophet, may Allah bless him and grant him peace, passed to the Supreme Companion while the Quran was not collected in one place. When the Caliphate passed to the First Siddiq (Abu Bakr), may Allah be pleased with him, and seventy reciters were killed during his reign in the Wars of Apostasy at the Battle of Yamama, fearing the loss of the Quran with the loss of its carriers, he rose, may Allah be pleased with him, along with the multitudes of noble Companions, may Allah be pleased with them all, to perform one of the greatest deeds known in our glorious history: collecting the Quran between the two covers of a single Mushaf (volume). This research is a conveyance of a realistic, tangible scene of this great work undertaken by the first Siddiq of the Ummah, assisted by those great prominent figures from the first forerunners to Islam from the vanguard of this nation, may Allah be pleased with them all. Research Plan: The researcher has included in his research a plan consisting of four chapters, each chapter consisting of several sections, in which he clarified the following: First: The importance of the research topic. Second: The most important and prominent previous studies. Third: The reasons and motives for choosing the research topic. Fourth: The research problem and its objectives. Fifth: Research methodology. Sixth: Conclusion of the research, and a statement of the most important results reached by this concise study. Seventh: Collection of indexes. The research plan includes four chapters as follows: Chapter One: The motives for Abu Bakr's compilation, its causes, and reasons. It contains three sections: Section One: The beginning of the idea of compilation in the era of Abu Bakr Al-Siddiq - may Allah be pleased with him. Section Two: The stance of the Companions regarding Abu Bakr's compilation of the Quran. Section Three: The most important motives for Abu Bakr's compilation - may Allah be pleased with him. Chapter Two: Its characteristics and advantages. It contains four sections: Section One: The most prominent advantages of this compilation. Section Two: Explanation that the arrangement of verses within the Surahs is Tawqifi (divinely ordained). Section Three: Presentation of the opinions regarding the arrangement of the Surahs with preference between them. Section Four: The beginning of opposition and contradiction to the Mushaf order with the chronological order (order of revelation) and clarifying its source. Chapter Three: Statement of the conditions of Abu Bakr's compilation - may Allah be pleased with him - and the manner in which it was done. It contains seven sections:",
    "foot_note": "None",
    "book_id": "936",
    "new_page_number": 6
  },
  {
    "serial_number": "1099939",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 100,
    "volume_number": 1,
    "text": "Section One: Introduction to \"Zaid bin Thabit\" who was assigned the compilation. Section Two: The most prominent qualifications calling for the selection of \"Zaid\". Section Three: Reasons for choosing \"Zaid\" for this task in general. Section Four: The motives for this compilation. Section Five: Distinctive features of Abu Bakr's compilation - may Allah be pleased with him. Section Six: Abu Bakr's methodology which he set for \"Zaid\" in collecting and recording the Holy Quran. Section Seven: The fate of Abu Bakr's Suhuf (sheets) - may Allah be pleased with him. Chapter Four: The date and time of this compilation and its most prominent results. It contains two sections: Section One: The most prominent results of Abu Bakr's compilation - may Allah be pleased with him. Section Two: The first to name the Quran \"Al-Mushaf\". Research Methodology. First: Importance of the Research Topic. If the honor of knowledge comes from the honor of the known subject, then the topic of the research is related to the most honorable, greatest, and majestic book, the \"Holy Quran\" in general. Specifically, it relates to the issue of the compilation of the Quran in the era of Abu Bakr Al-Siddiq, may Allah be pleased with him. This issue troubled the elite of the first generation of Companions, who are the protectors of religion and heirs of prophetic knowledge, the best of this nation. They fulfilled the right of their Lord's Book appropriately and rose to collect it just as it was in its first era, free from addition and subtraction, free from alteration and change. Their compilation of the Quran was exactly in accordance with the first Prophetic compilation, but they collected it in one place after it had been scattered among palm stalks and thin stones, just as they collected it from what was memorized in the chests of men as well. Allah Almighty has guaranteed the preservation of the Holy Quran in all its stages of revelation. Evidences for this from the Book of Allah are many, including but not limited to: 1 - His saying regarding the general preservation: {Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian.} (Al-Hijr: 9), meaning from any addition or subtraction, and this is the saying of the generality of the Imams of Exegesis, and no opponent is known to it. 2 - Also His saying: {Falsehood cannot approach it from before it or from behind it.} (Fussilat: 42). Falsehood refers to Iblis; he cannot subtract truth from it nor add falsehood to it. (1) 3 - Also His saying: {And recite, [O Muhammad], what has been revealed to you of the Book of your Lord. There is no changer of His words, and never will you find in other than Him a refuge.} (Al-Kahf: 27). And His saying: {There is no changer of His words} means: no one to alter them, distort them, or misinterpret them. (2) The general evidences for this in the Book of Allah are too many to count. The Quran has been preserved by Allah Almighty in all stages of its revelation. Allah established and preserved it in the Preserved Tablet in Heaven before its descent, preserved it on its path of descent to the earth, and preserved it after its descent to the earth upon His Messenger, may Allah bless him and grant him peace. It will remain so until it is lifted at the end",
    "foot_note": "1. - Tafsir al-Tabari: (21/479). Jami' al-Bayan fi Ta'wil al-Quran, Author: Muhammad bin Jarir bin Yazid bin Kathir bin Ghalib al-Amili, Abu Ja'far al-Tabari (Died: 310 AH) Editor: Ahmed Muhammad Shakir Publisher: Mu'assasat al-Risalah Edition: First, 1420 AH - 2000 AD Number of Parts: 24\n2. Tafsir Ibn Kathir: (5/151). Tafsir al-Quran al-Azim, Author: Abu al-Fida Ismail bin Umar bin Kathir al-Qurashi al-Basri then al-Dimashqi (Died: 774 AH) Editor: Muhammad Hussain Shams al-Din Publisher: Dar al-Kutub al-Ilmiyyah, Muhammad Ali Baydoun Publications - Beirut Edition: First - 1419 AH",
    "book_id": "936",
    "new_page_number": 7
  },
  {
    "serial_number": "1099940",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 101,
    "volume_number": 1,
    "text": "of time. First: Preservation of the Holy Quran in Heaven: The Holy Quran, before its descent, is preserved in the Preserved Tablet in Heaven as our Lord said: {But this is an honored Quran. [Inscribed] in a Preserved Slate.} (Al-Buruj: 21, 22). It is in the Preserved Tablet, protected and concealed from eyes; none view it except the drawn-near angels, and none touch it in Heaven except the pure angels. No devil reaches it, nor is it attained by one. (1) Allah Almighty made it a magnified book within a magnified, preserved, and revered book (2). Allah Almighty swore to that in His Book, saying: {Then I swear by the setting of the stars, And indeed, it is an oath - if you could know - [most] great. Indeed, it is a noble Quran. In a Register well-protected; None touch it except the purified. [It is] a revelation from the Lord of the worlds.} (Al-Waqi'a: 75-80). Second: Preservation of the Holy Quran on its path of descent to Earth: The one who descended with it is an angel, innocent, purified, and trustworthy over Allah's revelation, as the Almighty said: {And indeed, it is the revelation of the Lord of the worlds. The Trustworthy Spirit has brought it down. Upon your heart, [O Muhammad] - that you may be of the warners - In a clear Arabic language.} (Al-Shu'ara: 193-195). No devil can approach the heaven to eavesdrop in hopes of viewing the news of heaven at the time of its descent, as our Lord said: {And as protection against every rebellious devil. They may not listen to the exalted assembly [of angels] and are pelted from every side, Repelled; and for them is a constant punishment. Except one who snatches [some tidings] by theft, but they are pursued by a burning flame, piercing [in brightness].} (As-Saffat: 7-10). When the devils attempted that, they could not, because the heaven was preserved with strict guarding by angels and burning flames. Allah Almighty described the attempt of a group of Jinn in Surah \"Al-Jinn\" in His saying: {And we have sought [to reach] the heaven but found it filled with powerful guards and burning flames. And we used to sit therein in positions for hearing, but whoever listens now will find a burning flame lying in wait for him. And we do not know [therefore] whether evil is intended for those on earth or whether their Lord intends for them a right course.} (Al-Jinn: 8-10). Third: Preservation of the Holy Quran after its descent to Earth upon the Prophet, may Allah bless him and grant him peace. Allah Almighty also preserved the Holy Quran after He sent it down to His Messenger, may Allah bless him and grant him peace, who fulfilled its right in the best manner regarding its preservation and communication from his Lord. Out of his intense eagerness to memorize and receive it, the Prophet, may Allah bless him and grant him peace, used to be keen to hasten receiving it from the mouth of Gabriel, peace be upon him. So his Lord said to him: {And do not hasten with the Qur'an before its revelation is completed to you, and say, \"My Lord, increase me in knowledge.\"} (Taha: 114). Then Allah Almighty promised him to preserve it in his chest (heart), so his Lord reassured him by fulfilling His promise, saying to him: {Move not your tongue with it, [O Muhammad], to hasten with recitation of the Qur'an. Indeed, upon Us is its collection [in your heart] and [to make possible] its recitation. So when We have recited it [through Gabriel], then follow its recitation. Then upon Us is its clarification [to you].} (Al-Qiyamah: 16-19). He, may Allah bless him and grant him peace, used to move his tongue with it, hastening and initiating taking it from Gabriel's mouth, moving his lips with it during the Angel's recitation of the Quran, fearing it might escape him. So Allah promised him to collect it for him in",
    "foot_note": "1. Al-Daw' Al-Munir, by Ibn al-Qayyim: (5: 587).\n2. Tafsir Ibn Kathir: (4/537). With slight adaptation.",
    "book_id": "936",
    "new_page_number": 8
  },
  {
    "serial_number": "1099941",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 102,
    "volume_number": 1,
    "text": "his chest and clarify it for him on his tongue, then recite it to the people without forgetting anything of it. Thus, it becomes clear to us that Allah Almighty preserved the Holy Quran while it was in Heaven, preserved it at the time of its descent from there, and preserved it after its descent to Earth. The collection of the Quran passed through three stages, and its collection in all stages was memorized in chests (hearts) and written in lines. As for the first stage: It was during the time of the Prophet, may Allah bless him and grant him peace. He was keen on preserving the Holy Quran, and Allah collected it for him in his chest. He also took care to teach it to his companions and encouraged them to memorize and master it. He adopted from the elite of their memorizers scribes of revelation who would write down everything revealed to him in his presence. The Prophet, may Allah bless him and grant him peace, passed to the Supreme Companion without the entire Quran being collected in one place during his life, neither in sheets (*Suhuf*) nor in volumes (*Masahif*). Rather, it was written scattered among patches (*Riqa'*), shoulder blades (*Aktaf*), palm stalks (*Usub*), and similar writing tools used in this blessed era. His strictness, peace be upon him, in not collecting the Quran between the two covers of a single sheet was in anticipation of renewed revelation and the successive descent of something new from it until his death. If he had arranged it as it came and collected the Quran in one place between the covers of one volume, it would have resulted in hardship and difficulty beyond imagination. This arrangement would have led to changes and alterations in the position of Surahs and verses whenever something new of revelation came down to him, peace be upon him. In this, there is obvious extreme hardship which the noble Sharia came to lift and repel. As for the second stage: It was during the era of Abu Bakr Al-Siddiq, may Allah be pleased with him. The Holy Quran remained scattered, not collected between the covers of one volume, until the Caliphate passed to Abu Bakr, and the Wars of Apostasy arose. Killing intensified among the reciters in the Battle of Yamama - in the year twelve AH - in which seventy reciters from the memorizers of the Quran were killed. This matter alarmed Umar bin Al-Khattab, and he feared that some of the Quran might be lost with the death of its memorizers and reciters. So he advised Abu Bakr to collect the Quran for fear of losing part of it due to the killing of reciters and memorizers. This was the main motive for this collection. So Al-Siddiq proceeded to collect what was written scattered in the presence of the Messenger of Allah, may Allah bless him and grant him peace, from patches, shoulder blades, palm stalks, thin white stones (*Likhaf*), ribs, saddles, and boards into one place. His compilation, may Allah be pleased with him, was the same as what was written in the era of Prophethood, with verses and Surahs arranged, but he collected it in one place after it had been scattered. As for the third stage: It was during the era of Uthman bin Affan, may Allah be pleased with him. The reasons for collection in his era differed from the reasons for collection in the era of Al-Siddiq - may Allah be pleased with them both. The Companions used to recite the Quran according to the Seven Modes (*Ahruf*) which the Messenger of Allah, may Allah bless him and grant him peace, had taught them, until differences occurred among the reciters during the conquests in the time of Uthman, may Allah be pleased with him. When the matter became grave, their disagreement in recitation alarmed Hudhayfah. So Hudhayfah said to Uthman: \"O Commander of the Faithful, save this nation before they differ in the",
    "foot_note": "None",
    "book_id": "936",
    "new_page_number": 9
  },
  {
    "serial_number": "1099942",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 103,
    "volume_number": 1,
    "text": "Book like the difference of the Jews and Christians.\" So Uthman rectified the matter before it worsened. The researcher suffices here with stating this stage briefly using what Al-Bukhari narrated from Anas bin Malik, may Allah be pleased with him: That Hudhayfah bin Al-Yaman came to Uthman while he was campaigning with the people of Sham in the conquest of Armenia and Azerbaijan with the people of Iraq. Their difference in recitation alarmed Hudhayfah, so Hudhayfah said to Uthman: \"O Commander of the Faithful, save this nation before they differ in the Book like the difference of the Jews and Christians.\" So Uthman sent a message to Hafsa: \"Send us the sheets (*Suhuf*) so we may copy them into the volumes (*Masahif*), then we will return them to you.\" So Hafsa sent them to Uthman. He ordered Zaid bin Thabit, Abdullah bin Al-Zubayr, Sa'id bin Al-Aas, and Abdul Rahman bin Al-Harith bin Hisham, so they copied them into the volumes. Uthman said to the three Qurashi men: \"If you and Zaid bin Thabit differ in anything of the Quran, write it in the dialect of Quraysh; for it was revealed in their dialect (meaning initially).\" So they did so, until when they had copied the sheets into the volumes, Uthman returned the sheets to Hafsa, and sent to every region a volume from what they had copied, and ordered that everything else of the Quran in every sheet or volume be burned. (1) Second: The most important and prominent previous studies. Within the narrow limits of his research, the researcher did not find a grounded study that addressed the compilation of Al-Siddiq, may Allah be pleased with him, as an independent scientific research. However, it was addressed within the compilation of the Quran in its three stages in a number of scientific researches, most notably: First Study: \"Compilation of the Quran in its Historical Stages from the Prophetic Era to the Modern Era\", Author: Muhammad Shar'i Abu Zaid, Master's Thesis, Faculty of Sharia, Kuwait University, Year of Publication: 1419 AH. Description of the Research: This research highlights the Muslims' care for preserving the Quran from the era of Prophethood until now, and confirms that the transmission of the Quran received the highest degrees of care from Muslims. It responds to the doubts of detractors from the enemies of Islam regarding the transmission of the Holy Quran. Due to the quality of the research, its good phrasing, quality of presentation, cohesive style, and strength of argument, many researchers have benefited from it and drawn from it. Second Study: \"The Compilation of the Quran (An Analytical Study of its Narrations)\", the book originates from a scientific thesis at the Faculty of Islamic Sciences - University of Baghdad, supervised by Dr. Omar Mahmoud Hussein Al-Samarrai, and its author is the researcher: Akram Abdul Khalifa Hamad Al-Dulaimi. Publisher: Dar Al-Kutub Al-Ilmiyyah - Beirut. Edition: First, 1427 AH - 2006 AD. Number of Parts: 1. Description of the Book: It is a scientific thesis presented by the researcher to the Faculty of Islamic Sciences, and the degree obtained by this research was not specified. The researcher divided this research into",
    "foot_note": "1. Al-Bukhari Hadith (49).",
    "book_id": "936",
    "new_page_number": 10
  },
  {
    "serial_number": "1099943",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 104,
    "volume_number": 1,
    "text": "an introduction, four chapters, and a conclusion. He addressed his research in four chapters, discussing the writing of the Quran in its three eras, each stage in a separate chapter, following many who preceded him in this. Then he discussed doubts about the Quran in the fourth chapter. In this research, you see the researcher holding onto two sciences: Sciences of the Quran and Hadith. But he is closer to Hadith and the study of chains of transmission (*Asanid*) than to Sciences of the Quran. His study of chains of transmission, judging them, and referencing them came very briefly. This is noticed by anyone tracking those narrations. The researcher - may Allah grant him success - exerted a thankful effort and broached a wonderful topic worthy of research through which enemies of religion tried to infiltrate to attack the Book of Allah and attempt to cast doubt on it. He succeeded in presenting their doubts and answering them with accessible answers that anyone who views them can comprehend. (1) Third Study: \"Compilation of the Holy Quran in the Era of the Rightly Guided Caliphs\", Abdul Qayyum bin Abdul Ghafoor Al-Sindhi, Publisher: King Fahd Complex for the Printing of the Holy Quran - Madinah, Edition: First, Year of Publication: 1421 AH, Number of Volumes: 1. Description of the Book: The researcher addressed the compilation in its second and third eras, and did not address the compilation in the Prophetic era despite its importance and status because his research came within the themes of a special symposium held by the King Fahd Complex for the Printing of the Holy Quran in Madinah titled: \"The Care of the Kingdom of Saudi Arabia for the Holy Quran and its Sciences\", and since his research was one of the symposium's themes.. His research included three sections in one volume of about 72 pages. In the first section, he discussed the compilation of Abu Bakr, may Allah be pleased with him. Then in the second section, he discussed the compilation of Uthman, may Allah be pleased with him. As for the third section, he did not name it, and he addressed it in two requirements: the first requirement discussed the distinctive differences between the two compilations, and the second requirement discussed the Seven Modes (*Ahruf*) and their observance in the two compilations. The researcher should have observed important aspects and paid attention to them, most notably: 1 - An introduction to the compilation in the Prophetic era, even if in the preface, because it is the foundation upon which all stages of compilation were built, and due to the close connection of the compilation in the following two eras to it; however, he referred to it with a quick reference in just two lines. 2 - Attention to what Abu Amr Al-Dani went to in \"Al-Urjuzah Al-Munabbihah\" that Gabriel, peace be upon him, used to review the Quran with the Prophet, may Allah bless him and grant him peace, every year with one of the Seven Letters, where he says: \"And he used to present to Gabriel ... in every year the entirety of the revelation / So he would recite to him in every presentation ... one of the Seven Letters / Until when the time was near ... he presented it to him twice\" (2). This detailing is incorrect and is a matter of consideration for investigators, and it has been stated by more than",
    "foot_note": "1. See: Report on the book (Compilation of the Quran: An Analytical Study of its Narrations) by Dr. Akram Al-Dulaimi, Ahl al-Tafsir Forum, Abdullah Al-Harbi, dated: 4/11/2008. With slight adaptation.\n2. Al-Urjuzah Al-Munabbihah by Abu Amr Al-Dani, Verse number: (70-72), (p. 87). Al-Urjuzah Al-Munabbihah on the Names of Reciters and Narrators and Principles of Readings and Articles of Faith with Tajweed and Indications, Uthman bin Sa'id Al-Dani Abu Amr Al-Andalusi (371 - 444 AH), Investigation: Muhammad bin Majqan Al-Jaza'iri, First Edition by Dar Al-Mughni - Riyadh - 1420 AH - 1999 AD, Number of Volumes: 1",
    "book_id": "936",
    "new_page_number": 11
  },
  {
    "serial_number": "1099944",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 105,
    "volume_number": 1,
    "text": "one scholar other than Al-Dani. If we reflect on the time of seeking increase in the Seven Modes (*Ahruf*), it becomes established for us that it was in Medina shortly before the death of the Prophet, may Allah bless him and grant him peace, by about a year or two. The story of Umar and Hisham bin Hakim regarding the difference in their recitation in Surah Al-Furqan is the best witness, because Hisham was among those who accepted Islam at the Conquest (of Mecca), and that was shortly before the Prophet, peace be upon him, passed to the Supreme Companion by two years at most. Likewise, what happened to Ubayy bin Ka'b with Ibn Mas'ud in Surah Al-Nahl. So how could Gabriel present it to him every year in one of the Seven Modes! While they hadn't been revealed yet! This is a backward statement from a scholar like Abu Amr Al-Dani, but glory be to Him who does not err. 3 - Attention to the abundance of quotes in the research which obscured the presence of the researcher's pen in many places of the research. There are some other non-substantial observations, and these notes and others do not diminish the scientific value of the research nor the effort of the researcher who has done well and benefited others, so may Allah reward him. Fourth Study: \"Positions of Orientalists on the Compilation, Drawing, and Arrangement of the Holy Quran: Presentation and Critique\", Dr. Abu Bakr Kafi, Publisher: King Fahd Complex for the Printing of the Holy Quran - Madinah, published PDF version. Description of the Book: In this enjoyable research, the researcher - Abu Bakr Kafi - reviews for us the famous positions of major Orientalists regarding the issue of the compilation, recording, arrangement, and stages of the Holy Quran. Many Orientalists have raised doubts and false allegations about this issue. In this book, the author presents these allegations and doubts to us, analyzes their motives and goals, and pursues them with criticism and refutation to refute them scientifically and objectively, clarifying the amount of fallacies contained therein. Fifth Study: \"The Compilation of the Holy Quran: Memorization and Writing\", Prof. Dr. Ali bin Suleiman Al-Obeid, Publisher: King Fahd Complex for the Printing of the Holy Quran - Madinah, Edition: First, Year of Publication: 1421 AH, Number of Volumes: 1. Description of the Book: The researcher addressed the compilation in its three eras very briefly in about 73 pages, following those who preceded him. His research was distinguished by ease of style and clarity of expression, so may Allah reward the researcher, but he did not add new research to his study. Sixth Study: \"Compilation of the Holy Quran in the Era of the Rightly Guided Caliphs\", Prof. Dr. Fahd bin Abdul Rahman bin Suleiman Al-Rumi, Number of Pages: 42, Source of the Book: Al-Islam website. Description of the Research: It is a very brief research, but its author has a firm footing in presenting grounded scientific material, even if concise.",
    "foot_note": "None",
    "book_id": "936",
    "new_page_number": 12
  },
  {
    "serial_number": "1099945",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 106,
    "volume_number": 1,
    "text": "Third: Reasons and Motives for Choosing the Research Topic. Bringing Sciences of the Quran closer through an accessible scientific style is one of the main reasons driving the choice of the research topic. Additionally, the compilation of the Quran in its three eras still needs approximation, verification, and scrutiny in some of its issues to clarify them to the public, shedding light on what was transmitted correctly generation after generation while pointing out unproven traditions related to the research topic. The researcher chose to address Al-Siddiq's compilation with research and study because he did not find, within the limits of his search, a study dedicated to this compilation. The researcher also desired to highlight the aspect of complete care, investigation, and precision that the compilation of the Quran met in the era of Al-Siddiq, upon which the Ummah (Muslim nation), predecessors and successors, agreed regarding its correctness, precision, and integrity. Fourth: Research Problem and Objectives. There are problems related to the research topic, most notably: 1 - Why was the Quran not collected in one place during the Prophetic era? 2 - Did Al-Siddiq's compilation differ from the compilation in the Prophetic era? 3 - Is collecting the Quran in one place considered an innovation in religion? 4 - Did Al-Siddiq's compilation, may Allah be pleased with him, include the Seven Modes (*Ahruf*)? 5 - Was the arrangement of verses in the Surahs by divine instruction (*Tawqifi*) from the Prophet, peace be upon him, or was it by the diligence (*Ijtihad*) of the Companions, may Allah be pleased with them? One of the most prominent objectives of the research was to highlight these incoming problems and solve them by shedding light on them and addressing them with research, study, verification, and scrutiny. Fifth: Research Methodology. The researcher followed more than one research methodology in addressing his research, most notably: 1 - Inductive Analytical Method 2 - Critical Method 3 - Historical Method. In the First Chapter: The researcher induced the motives for Abu Bakr's compilation, its causes and reasons, and linked the relationship between it and the first compilation in the Prophetic era. In the Second Chapter: The researcher presented the characteristics and advantages of this compilation analytically by inducing those advantages that distinguished this compilation. Then he addressed the arrangement of verses in the Surahs, presenting the opinions mentioned therein and then preferring between them. Then he induced after that the beginning of opposition and contradiction to the Mushaf order with the chronological order (order of revelation) and clarified its source, presenting all of that analytically, then critiquing and refuting it.",
    "foot_note": "None",
    "book_id": "936",
    "new_page_number": 13
  },
  {
    "serial_number": "1099946",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 107,
    "volume_number": 1,
    "text": "As for the Third Chapter: The researcher addressed the explanation of the conditions of this compilation and the manner in which it was done. Then he introduced \"Zaid\" who was assigned the compilation, then induced the qualifications calling for his selection. Then he presented the distinctive features of this compilation and the methodology that was set for collecting and recording the Holy Quran analytically. Then he clarified in its conclusion the fate of Abu Bakr's sheets - may Allah be pleased with him. As for the Fourth Chapter: He mentioned the date of this compilation and that it was during the Caliphate of Al-Siddiq, may Allah be pleased with him, and specified its duration. Then he presented analytically and deductively the most prominent results of this compilation, then concluded by stating the first to name the Quran \"Al-Mushaf\". In every stage of the research, he presents the scientific material, analyzes its parts, then presents the incoming opinions and studies them analytically and critically. Chapter One: Motives for Abu Bakr's Compilation, its Causes and Reasons. It contains three sections: After the death of the Prophet - may Allah bless him and grant him peace - and before his burial, pledge of allegiance was given to Abu Bakr Al-Siddiq - may Allah be pleased with him - for the Caliphate. The duration of his Caliphate was two years and a few months, from the year (11 AH - 13 AH), and his death was in the month of Jumada al-Akhirah in the year 13 AH. Section One: The Beginning of the Idea of Compilation in the Era of Abu Bakr Al-Siddiq - may Allah be pleased with him. - The beginning of the idea of collecting the Holy Quran in the era of Abu Bakr - may Allah be pleased with him - was in the middle of his caliphate: year 12 AH. That was \"when the Arabs apostatized and killing spread among the Muslims, especially on the Day of Yamama, and it intensified among the Quran reciters. Umar came to him and said: 'I fear that killing will intensify among the reciters in the battlefields, so much of the recitation and Quran will be lost, and I see that you should collect the Quran.' He kept urging Abu Bakr until Allah opened his chest to that; so he was the first to collect the Quran.\" (1) This happened only after allegiance was pledged to Abu Bakr Al-Siddiq - may Allah be pleased with him - and the Caliphate passed to him by that pledge. After that, tribes of Arabs apostatized and withheld Zakat. This grave matter occurred after the death of the Prophet, may Allah bless him and grant him peace, when the Arabs apostatized from Islam, it is said except for three mosques as transmitted by Ibn Ishaq, namely: the Mosque of Medina, the Mosque of Mecca, and the Mosque of Juwatha where Banu Abdul Qais pray. Qadi Iyad mentioned that the people of apostasy at that time were of three categories: First Category: A category that disbelieved after their Islam and returned to their ignorance (Jahiliyyah), and followed Musaylimah the Liar and Al-Aswad Al-Ansi and believed in them. Second Category: A category that acknowledged Islam except for Zakat, so they denied it. Third Category: A category that acknowledged its obligation but refused to pay it to Abu Bakr - may Allah be pleased with him - and said: That was specific to the Prophet, may Allah bless him and grant him peace, due to His saying Almighty: {Take, [O, Muhammad], from their wealth a charity by which you purify them and cause them increase,",
    "foot_note": "1. Al-Itqan: (1/164), Al-Itqan fi Ulum al-Quran Author: Abdul Rahman bin Abi Bakr, Jalal al-Din al-Suyuti (Died: 911 AH) Editor: Muhammad Abu al-Fadl Ibrahim, Publisher: The General Egyptian Book Organization Edition: 1394 AH / 1974 AD Number of Parts: 4, Also see: Al-Wajiz fi Fada'il al-Kitab al-Aziz: (p. 163).",
    "book_id": "936",
    "new_page_number": 14
  },
  {
    "serial_number": "1099947",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 108,
    "volume_number": 1,
    "text": "and pray for them. Indeed, your prayer is a comfort for them.} (At-Tawbah: 103). So Abu Bakr and the Companions - may Allah be pleased with them - saw fit to fight all of them; the first two categories for their disbelief and the third for their refusal. Refusal with acknowledgment differs in ruling from refusal with denial, and there is no doubt about that at all. Abu Al-Abbas Al-Qurtubi (d. 656 AH) mentioned in \"Al-Mufhim\" - may Allah have mercy on him - that the third category are those whose matter was confusing to Umar, and he debated Abu Bakr regarding them until the truth appeared. They are not considered disbelievers but rather rebels (*Bughat*). (1) This classification mentioned by Abu Al-Abbas Al-Qurtubi was adopted by a group of Imams of Islam, including Imam Al-Shafi'i (d. 240 AH) where he says - may Allah have mercy on him - similarly in \"Al-Umm\": \"The people of apostasy after the Messenger of Allah, may Allah bless him and grant him peace, are of two types: people who disbelieved after Islam, like Tulayhah, Musaylimah, Al-Ansi and their followers, and people who held on to Islam but withheld charities.\" Then he indicated that Abu Bakr and Umar - may Allah be pleased with them both - agreed that the second category were not disbelievers. He says after mentioning the dialogue between them: \"... their knowledge together that among those they fought were those holding on to faith.\" (2) Among those who decided this classification also is Al-Khattabi (d. 388 AH) where he says - may Allah have mercy on him - in \"Ma'alim al-Sunan\": \"Those to whom the name of apostasy applied from the Arabs were two categories: a category of them apostatized from the religion, rejected the creed, and returned to disbelief, and they are the ones meant by Abu Hurairah - may Allah be pleased with him - in his saying: 'And those of the Arabs who disbelieved disbelieved', and they are the companions of Musaylimah the Liar, and those who followed their path in denying the prophethood of Muhammad, may Allah bless him and grant him peace. And another category: they are those who differentiated between prayer and Zakat, and these are in reality people of rebellion (*Bughat*).\" (3) Among those who decided this classification as well is Ibn Hazm Al-Andalusi (d. 456 AH) in the midst of his speech on the categories of apostates where he says - may Allah have mercy on him - in \"Al-Muhalla\": \"... And the second section: people who embraced Islam, and did not disbelieve after their Islam, but withheld Zakat from paying it to Abu Bakr, may Allah be pleased with him, so for this they were fought.\" (4) This classification was also decided by a group of prominent scholars, including: Abu Umar Ibn Abd al-Barr, Ibn al-Mundhir, Al-Mawardi the author of the Tafsir, Qadi Iyad, Ibn al-Arabi al-Maliki, Al-Baghawi, Al-Nawawi, Ibn Hajar, and many others. (5) It is also the choice of Sheikh al-Islam Ibn Taymiyyah (d. 728 AH) - may Allah have mercy on him. He had some statements and decisions from which it appears and shows that he sees the Companions - may Allah be pleased with them - differentiating between categories of apostates, considering some of them disbelievers, like the apostates from the followers of Musaylimah the Liar, and some of them Muslim rebels having all the rulings of the people of the Qiblah as mentioned by Abu Al-Abbas Al-Qurtubi in Al-Mufhim and Al-Nawawi in his explanation of Muslim. Among those statements and decisions: He made the fighting of those withholding Zakat of the same genus as fighting the people of the Qiblah. He said - may Allah have mercy on him: \"The scholars have two paths regarding fighting those deserving of fighting from the people of the Qiblah: Some of them see Ali's fighting on the day of Harura' (Kharijites) and the day of the Camel and Siffin entirely as part of fighting the people of rebellion, and likewise he makes Abu Bakr's fighting of those withholding Zakat,",
    "foot_note": "1. See: Nawawi's Explanation of Muslim Hadith (22, 20) and See: Al-Mufhim by Al-Qurtubi Hadith (18, 17) Chapter: People are fought until they unify Allah and adhere to the laws of His religion.\n2. Al-Umm, by Al-Shafi'i: (9/204).\n3. A'lam al-Sunan, Al-Khattabi (1/741).\n4. Al-Muhalla, Ibn Hazm (11/193).\n5. See: Al-Istidhkar, Ibn Abd al-Barr (9/266), Al-Ishraf 'ala Madhahib Ahl al-Sunnah, Ibn al-Mundhir (3/254), Al-Hawi, Al-Mawardi (13/211), Sharh al-Sunnah, Al-Baghawi (5/489), Sharh al-Sunnah Author: Muhyi al-Sunnah, Abu Muhammad Al-Husayn bin Mas'ud bin Muhammad bin Al-Farra' Al-Baghawi Al-Shafi'i (Died: 516 AH) Investigation: Shu'ayb Al-Arna'ut - Muhammad Zuhair Al-Shawish Publisher: Al-Maktab Al-Islami - Damascus, Beirut Edition: Second, 1403 AH - 1983 AD Number of Parts: 15, Ikmal al-Mu'allim bi-Fawa'id Muslim, Qadi Iyad (1/243), Aridat al-Ahwadhi, Ibn al-Arabi (10/73), Sharh Sahih Muslim, Al-Nawawi (2/202), Fath al-Bari, Ibn Hajar (12/276), Ikmal Ikmal al-Mu'allim, Al-Ubbi (1/173), and many others.",
    "book_id": "936",
    "new_page_number": 15
  },
  {
    "serial_number": "1099948",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 109,
    "volume_number": 1,
    "text": "and likewise the fighting of all those fought who affiliate with the Qiblah, as mentioned by those who mentioned it from the companions of Abu Hanifa and Al-Shafi'i and those who agreed with them from the companions of Ahmad and others.\" (1) Abu Bakr's Letter - may Allah be pleased with him - to the Apostates: What can also be used as support here, and with which we conclude this important section: The letter of Abu Bakr - may Allah be pleased with him - to the apostates. He wrote them a long letter containing various matters in its content and purport. Among what appeared in his letter to them is his saying - may Allah be pleased with him: \"In the name of Allah, the Most Gracious, the Most Merciful. From Abu Bakr, Caliph of the Messenger of Allah, may Allah bless him and grant him peace, to whoever my letter reaches, general and specific, whether he remained on his Islam or turned back from it\" (2). This indicates that some of the people of apostasy remained on their Islam and did not leave it, and his speech addressed two groups, so it is taken, understood, and inferred from it that the one who apostatized from Islam is only one group of the two, not both groups. The first witness from what preceded: The First Siddiq - may Allah be pleased with him - stood the position of towering firm mountains to return the Nation to its religion, so he fought and battled the apostates with courage, steadfastness, and composure. The situation was very critical, for large crowds and many tribes of Arabs apostatized, and the closest associates initially opposed him in that. Yet despite all this, he stood firm, may Allah be pleased with him, like the firm mountains, and was able, after Allah's help and success, to return the Nation to its guidance, and to restore to Islam its power, strength, and status. So he was - may Allah be pleased with him - for Islam on the Day of Apostasy, just as Imam Ahmad was for Islam on the Day of the Inquisition (Mihna). Let us contemplate what Al-Bukhari - may Allah have mercy on him - narrated from the hadith of Abu Hurairah, may Allah be pleased with him, who said: When the Messenger of Allah, may Allah bless him and grant him peace, died and Abu Bakr was succeeded after him, and those of the Arabs who disbelieved disbelieved, Umar bin Al-Khattab said to Abu Bakr - may Allah be pleased with them both: \"How do you fight the people when the Messenger of Allah, may Allah bless him and grant him peace, said: 'I have been ordered to fight the people until they say: There is no god but Allah. So whoever says: There is no god but Allah, has protected his wealth and his self from me except by its right, and his reckoning is with Allah?'\" Abu Bakr said: \"By Allah, I will fight anyone who differentiates between prayer and Zakat, for Zakat is the right of wealth. By Allah, if they withheld from me a hobbling rope (*'Iqal*) they used to give to the Messenger of Allah, may Allah bless him and grant him peace, I would fight them for withholding it.\" Umar bin Al-Khattab - may Allah be pleased with him - said: \"By Allah, it was nothing but that I saw Allah Almighty had opened Abu Bakr's chest to fighting, so I knew it was the truth.\" (3) Al-Siddiq - may Allah be pleased with him - assigned the noble Companion Zaid bin Thabit Al-Ansari - may Allah be pleased with him - to perform this task and this great work. Let us contemplate the news of that great event for which Allah destined the two noble Rightly Guided Caliphs, companions of the best of creation and beloved of the Truth, Muhammad - may Allah bless him and grant him peace. Let us leave the floor to Imam Al-Bukhari, may Allah have mercy on him, to tell us the news on the tongue of the one assigned with this difficult important task himself, namely the noble Companion Zaid bin Thabit Al-Ansari - may Allah be pleased with him, where he says: \"Abu Bakr sent for me after the heavy killing of the people of Yamama, and Umar bin Al-Khattab was with him. Abu Bakr - may Allah be pleased with him - said: Umar came to me and said: 'The killing has intensified on the Day of Yamama among the reciters of the Quran, and I",
    "foot_note": "1. See: Majmu' al-Fatawa: (28/515). Majmu' al-Fatawa Author: Taqi al-Din Abu al-Abbas Ahmad bin Abdul Halim bin Taymiyyah al-Harrani (Died: 728 AH) Editor: Abdul Rahman bin Muhammad bin Qasim Publisher: King Fahd Complex for the Printing of the Holy Quran, Madinah, Kingdom of Saudi Arabia Year of Publication: 1416 AH/1995 AD\n2. See: Text of the letter: Kitab al-Riddah, Al-Waqidi (71), and Tarikh al-Tabari (3/250).\n3. Narrated by Al-Bukhari in \"Book of Zakat\" \"Chapter on Obligation of Zakat\" Hadith (1399), and narrated by Muslim Hadith (20), and narrated by Abu Dawood in \"Book of Zakat\" Hadith (1556 and 1557), and narrated by Al-Tirmidhi in \"Book of Faith\" \"Chapter on what came regarding I have been ordered to fight the people until they say there is no god but Allah\" Hadith (2607), and narrated by Al-Nasa'i in \"Book of Zakat\" \"Chapter on Withholder of Zakat\" Hadith (2442).",
    "book_id": "936",
    "new_page_number": 16
  },
  {
    "serial_number": "1099949",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 110,
    "volume_number": 1,
    "text": "fear that killing will intensify among the reciters in other battlefields, so much of the Quran might be lost. I see that you should order the collection of the Quran.' I said to Umar: 'How can you do something that the Messenger of Allah, may Allah bless him and grant him peace, did not do?' Umar said: 'This, by Allah, is good.' Umar kept urging me until Allah opened my chest to that, and I saw regarding that what Umar saw. Zaid said: Abu Bakr said: 'You are a young, intelligent man, we do not accuse you, and you used to write the revelation for the Messenger of Allah - may Allah bless him and grant him peace. So track down the Quran and collect it.' By Allah, if they had charged me with moving a mountain of the mountains, it would not have been heavier upon me than what he ordered me of collecting the Quran. I said: 'How can you do something the Messenger of Allah, may Allah bless him and grant him peace, did not do?' He said: 'It, by Allah, is good.' Abu Bakr kept urging me until Allah opened my chest to that which He opened the chest of Abu Bakr and Umar - may Allah be pleased with them both - for. So I tracked down the Quran, collecting it from palm stalks, thin white stones, and the chests of men, until I found the end of Surah At-Tawbah with Abu Khuzaima Al-Ansari, I did not find it with anyone else: {There has certainly come to you a Messenger from among yourselves. Grievous to him is what you suffer} [At-Tawbah: 128-129] until the conclusion of Bara'ah (Tawbah). So the sheets (*Suhuf*) were with Abu Bakr until Allah took him, then with Umar during his life, then with Hafsa bint Umar, may Allah be pleased with her.\" (1) Section Two: The stance of the Companions regarding Abu Bakr's compilation of the Quran. The Companions - may Allah be pleased with them - fully realized and were completely certain that Allah Almighty's promise never fails, and He, Glory be to Him, promised to preserve His Book from change and alteration and from addition or subtraction by His saying Glory be to Him: {Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian} (Al-Hijr: 9). They also realized that Allah's cosmic laws have causes that uphold them, and realized through those laws also that this religion does not stand by itself but must have human supporters and helpers who carry on their shoulders its support, carrying its message, and defending its domains. Therefore, they - may Allah be pleased with them - performed their duty towards it by exerting the causes to preserve the Book of their Lord from loss and disappearance. This stems from the strength of their faith in Allah and His Messenger, the breadth of their knowledge of their Lord's religion, their understanding of His law and methodology, and their realization of the greatness of the trust upon their necks, and the magnitude of the responsibility placed on their shoulders. Is Abu Bakr's compilation - may Allah be pleased with him - of the Quran considered a religious innovation (*Bid'ah*)? The concept of Innovation (*Bid'ah*) in Language: Let us know first that *Bid'ah* in language is taken from *Bad'*, which is invention without a prior example. From it is His saying Almighty: {Originator (*Badi'*) of the heavens and the earth} [Al-Baqarah: 117], meaning their Inventor without a prior example. And His saying Almighty: {Say, \"I am not something original (*Bid'an*) among the messengers} [Al-Ahqaf: 9], meaning: I was not the first to come with a message from Allah to the servants, but many messengers preceded me. It is said: So-and-so invented an innovation (*Ibtada'a Bid'ah*), meaning: he initiated a way not preceded to. Innovation is of two types: First type: Innovation in customs, like inventing modern inventions, and this is permissible; because the principle in customs is permissibility. Second type: Innovation in religion: And this is forbidden; because",
    "foot_note": "1. Al-Bukhari, Tafsir: 4311, Virtues of the Quran: 4603, Judgments: 6654, Al-Tirmidhi, Tafsir: 3028, Ahmad, Musnad al-Asharah: 72, Jamal al-Qurra': 1/86. See: Its full referencing in Kitab al-Masahif by Ibn Abi Dawood: 1/169-179, Kitab al-Masahif Author: Abu Bakr bin Abi Dawood, Abdullah bin Suleiman bin Al-Ash'ath Al-Azdi Al-Sijistani (Died: 316 AH), Editor: Muhammad bin Abdu Publisher: Al-Faruq Al-Hadithah - Egypt/Cairo Edition: First, 1423 AH - 2002 AD Number of Parts: 1, See: Al-Muqni' by Abu Al-Dani: 2-3. Al-Muqni' fi Rasm Masahif al-Amsar Author: Uthman bin Sa'id bin Uthman bin Umar Abu Amr Al-Dani (Died: 444 AH), Editor: Muhammad Al-Sadiq Qamhawi Publisher: Al-Kulliyat Al-Azhariyyah Library, Cairo Number of Parts: 1",
    "book_id": "936",
    "new_page_number": 17
  },
  {
    "serial_number": "1099950",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 111,
    "volume_number": 1,
    "text": "the principle in it is restriction (Tawqif). He, peace be upon him, said: \"Whoever introduces into this affair of ours that which is not of it, it is rejected.\" And in a narration: \"Whoever does a deed upon which is not our order, it is rejected.\" (1). (2) Innovation in the Terminological Concept: Innovation in the terminological concept, as defined by Al-Shatibi (d. 790 AH) - may Allah have mercy on him - in Al-I'tisam is: \"An invented way in religion, intended by following it what is intended by the legal way.\" (3) Sheikh al-Islam Ibn Taymiyyah (d. 728 AH) - may Allah have mercy on him - said: \"Innovation in religion is what Allah and His Messenger - may Allah bless him and grant him peace - did not legislate, which is what they did not order, neither by obligation nor recommendation.\" (4) If we know that innovation is an introduced and invented matter in religion resembling the legal one, which Allah and His Messenger - may Allah bless him and grant him peace - did not legislate, intended for worship and closeness to Allah, without a prior example, and we know as well that the Quran had previously been collected in the chests of men, and collected also in tablets with them, so two collections gathered for it: collection in chests and collection in lines. Therefore, collecting it in one place is not considered among the introduced matters in religion. Abu Bakr's compilation - may Allah be pleased with him - was never of that sort, evidenced by the consensus of the Companions - may Allah be pleased with them - on approving it, and even participating in it, and that the whole matter is merely a collection of what was written separately in the first Prophetic collection only. Al-Hafiz (d. 852 AH) said in Al-Fath: \"Some of the Rafidah (Shia) were beguiled into objecting to Abu Bakr for what he did regarding the Mushaf, saying: How is it permissible to do something the Messenger, peace be upon him, did not do? The answer: He did not do that except by way of permissible Ijtihad (reasoning) arising from sincerity from him to Allah, His Messenger, His Book, and the leaders of the Muslims and their common folk. The Prophet - may Allah bless him and grant him peace - had permitted writing the Quran, and forbade writing other things with it, so Abu Bakr did not order except writing what was already written. Then he said: If the fair person contemplates what Abu Bakr did of that, he would assert that it counts among his virtues, and praises his great merit due to the confirmation of his saying - peace be upon him - 'Whoever introduces a good practice (Sunnah Hasanah), he has its reward and the reward of those who act upon it' (5) (6). So no one is after him but that he (Abu Bakr) has the like of his reward until the Day of Resurrection.\" (7) The most prominent thing said regarding the Companions' agreement - may Allah be pleased with them - to this compilation is the saying of Ali bin Abi Talib - may Allah be pleased with him: ... \"The person with the greatest reward regarding the Mushafs is Abu Bakr; indeed Abu Bakr was the first to collect it between the two covers.\" (8) Al-Baqillani (d. 402 AH) - may Allah have mercy on him - mentioned points regarding Abu Bakr's action, five of the best are: First: That the Messenger of Allah - may Allah bless him and grant him peace - left that for a benefit, and Abu Bakr did it for a need.",
    "foot_note": "1. Narrated by Al-Bukhari (2697), and Muslim (1718).\n2. See: Mawsu'at Tawhid Rabb al-Abid, by Sheikh Al-Fawzan: (1/176). With slight adaptation.\n3. Al-I'tisam (p. 28).\n4. Majmu'at al-Fatawa: (4/107-108).\n5. Muslim Zakat (1017), Tirmidhi Ilm (2675), Nasa'i Zakat (2554), Ibn Majah Muqaddimah (203), Ahmad (4/359), Darimi Muqaddimah (514).\n6. The Hadith was narrated by Muslim in the Book of Zakat, Chapter on Encouragement of Charity even with half a date or a good word. Sahih Muslim Vol 2 - p 705.\n7. Fath al-Bari Vol 9 - p 10. Fath al-Bari Sharh Sahih al-Bukhari Author: Ahmad bin Ali bin Hajar Abu Al-Fadl Al-Asqalani Al-Shafi'i Publisher: Dar Al-Ma'rifah - Beirut, 1379 Numbering of books, chapters and hadiths: Muhammad Fuad Abdul Baqi Directed, corrected and supervised printing: Muhibb al-Din al-Khatib Comments by the Scholar: Abdul Aziz bin Abdullah bin Baz Number of Parts: 13\n8. Narrated by Abu Ubaid in Fada'il al-Quran: (p. 155), and Ibn Abi Dawood in Kitab al-Masahif (p. 5), and cited by Ibn Kathir saying about it: Its chain is authentic, Tafsir al-Quran al-Azim (Fada'il al-Quran) (1/25). See: Adwa' 'ala Salamat al-Mushaf al-Sharif min al-Naqs wa al-Tahrif: (p. 45-47), and: (p. 94).",
    "book_id": "936",
    "new_page_number": 18
  },
  {
    "serial_number": "1099951",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 112,
    "volume_number": 1,
    "text": "Second: Allah informed that it is in the former scriptures (*Suhuf*), and that it is with Muhammad, may Allah bless him and grant him peace, in similar ones by His saying: {Reciting purified pages. Within which are correct writings.} (Al-Bayyinah: 2-3); so this is following the example of Allah and His Messenger. Third: They intended by that to realize Allah's saying: {Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian.} (Al-Hijr: 9); it was preserved with Him, and He informed us that He preserves it after its descent, and part of His preservation is facilitating the Companions - may Allah be pleased with them - to collect it, and their agreement on recording and controlling it. Fourth: The Prophet - may Allah bless him and grant him peace - used to have his scribes write it by his dictation to them. Is it hidden from anyone envisioning a correct meaning in his heart that this was an alert to writing it and controlling it by recording in sheets? If what Allah guaranteed of its preservation meant no action for the Ummah in it, the Messenger of Allah - may Allah bless him and grant him peace - would not have written it after Allah informed him of the guarantee of its preservation. But it was known that its preservation is from Allah through our preservation, His facilitating that for us, and His teaching of its writing and control in sheets among us. Fifth: It is established: \"That the Prophet - may Allah bless him and grant him peace - forbade traveling with the Quran to the land of the enemy\" (1); this is an alert that it is written among the Ummah, accompanied in travels. Abu Bakr bin Al-Arabi (d. 543 AH) - may Allah have mercy on him - said in Ahkam al-Quran: This is one of the clearest faces for observers.\" (2) Al-Baqillani (d. 402 AH) - may Allah have mercy on him - also said: Umar understood that the Prophet's - may Allah bless him and grant him peace - leaving of its collection did not indicate prohibition, and Abu Bakr returned (to this view) when he saw the facet of correctness in that... (3) Al-Baqillani's speech above is precious speech containing clear evidences and decisive arguments with which all incoming doubts are refuted. Praise be to Allah, Lord of the Earth and Heavens. Al-Shatibi (d. 790 AH) - may Allah have mercy on him - said in Al-Muwafaqat: The sum of the matter is that the collection of the Mushaf was silent about in his time - peace be upon him. (4) The Companions - may Allah be pleased with them - are the best of this nation, the most honoring of Allah, His religion, and His law, and the furthest from innovation and introducing into Allah's religion what is not of it. Sheikh al-Islam Ibn Taymiyyah (d. 728 AH) - may Allah have mercy on him - said: \"... Thus were the Companions and those who followed their path of the Successors in goodness and the Imams of Muslims. Therefore, none of them opposed texts with his intellect, nor established a religion other than what the Messenger brought. If he wanted to know something of religion and speak about it, he looked into what Allah and the Messenger said; from it he learns, by it he speaks, into it he looks and thinks, and by it he is enlightened. This is the principle of Ahl al-Sunnah.\" (5) The participation of a large crowd of Companions - may Allah be pleased with them - in this compilation is considered a silent consensus because it has no opponent from them ever, and that alone is sufficient to settle the issue, because it is impossible for them - may Allah be pleased with them - to agree on error ever. Allah Almighty has protected this Nation from gathering on error, and the people of knowledge have agreed on that and that this protection remains until the Day of Resurrection. The confirmed Sunnah from the Infallible - peace be upon him - has authenticated that. It is established from the Hadith of Ka'b",
    "foot_note": "1. Narrated by Al-Bukhari: (2990), and Muslim: (1869), from the hadith of Abdullah bin Umar - may Allah be pleased with them both.\n2. See: Ahkam al-Quran: (2/612).\n3. Fath al-Bari: (8/629).\n4. Al-Muwafaqat: (3/41).\n5. Majmu' al-Fatawa: (13 - 62 - 63).",
    "book_id": "936",
    "new_page_number": 19
  },
  {
    "serial_number": "1099952",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 113,
    "volume_number": 1,
    "text": "bin Asim (d. 18 AH) may Allah be pleased with him (that) he said: I heard the Messenger of Allah, may Allah bless him and grant him peace, saying: \"Indeed Allah Almighty has protected my Ummah for me from three: that they do not starve, that they do not gather on error, and that the heartland of Muslims is not violated.\" (1) From the Hadith of Ibn Umar (d. 73 AH) may Allah be pleased with them both: He said: The Messenger of Allah - may Allah bless him and grant him peace - said: \"Indeed Allah Almighty does not gather my Ummah on error, and Allah's hand is over the congregation (*Jama'ah*).\" (2) And from Yusayr bin Amr who said: I heard Ibn Masud - may Allah be pleased with him - saying: \"Stick to the congregation, for Allah does not gather the Ummah of Muhammad - may Allah bless him and grant him peace - on error.\" (3) This undoubtedly has the ruling of being raised (to the Prophet), nay, it is completely consistent with it. The protection of this mercified Nation is a general protection preventing them from agreeing on error; meaning: they do not agree on a matter containing clear error and manifest opposition to the Sunnah leading them to destruction and blindness. Section Three: The most important motives for Abu Bakr's compilation - may Allah be pleased with him. The most important motives and reasons for this compilation were: 1 - One of the most important motives pushing the Companions - may Allah be pleased with them - to collect the Quran was the cessation of revelation from Heaven by the death of the Prophet - may Allah bless him and grant him peace - that great calamity and momentous event which caused fear for the loss of the Quran. 2 - Also prominent is the intensification of killing among the reciters of the Quran and its memorizers on the Day of Yamama. Their killing raised fears of the loss of their Lord's Book. Additionally, they were liable to disperse and spread in the regions for Jihad in the path of Allah, and for calling to Islam and spreading it in the corners of the globe, and for teaching people the matter of their religion, because they are a nation of communication, call, and Jihad, not a nation of sleep and slumber. Therefore, Umar said to Abu Bakr - may Allah be pleased with them both: \"The killing has intensified on the Day of Yamama among the reciters of the Quran, and I fear that killing will intensify among the reciters in the battlefields, so much of the Quran might be lost.\" The loss of some reciters might mean the loss of others, so by this action, the matter could be rectified from its beginning. (4) \"The Battle of Yamama was a fierce battle in which many reciter Companions and memorizers of the Quran were martyred, their number reaching seventy, and some put it at five hundred, among them Salim, client of Abu Hudhayfah.\" (5) So \"... recording the Quran and binding it by writing, collected and arranged, fearing the loss of any part of it by the death of its carriers and memorizers\" was done. (6) Chapter Two: Its characteristics and advantages. It contains four sections: Section One: The most prominent advantages of this compilation. Section Two: Explanation that the arrangement of verses in the Surahs is Tawqifi (divinely ordained). Section Three: Presentation of the opinions regarding the arrangement of the Surahs with preference between them. Section Four: The beginning of opposition and contradiction to the Mushaf order with the chronological order (order of revelation) and clarifying its source. The researcher mentions the four sections with some clarification and detail as follows: Section One: The most prominent advantages of this compilation. The compilation of the Holy Quran in the era of Abu Bakr Al-Siddiq - may Allah be pleased with him - was characterized by several characteristics and advantages, the most prominent of which were in general:",
    "foot_note": "1. Classified as Hasan by Al-Albani in Al-Sahihah (1331). Al-Albani said after listing several paths for the hadith: \"Its men are trustworthy except Muhammad bin Ismail bin Ayyash, Abu Dawood said: He was not that strong. Abu Hatim said: He did not hear from his father, they made him narrate from him so he narrated. I say (Al-Albani): The hadith with the sum of these paths is Hasan. See: 'Al-Da'ifah' (1510).\"\n2. Al-Albani said in Sahih al-Jami' al-Saghir: (Sahih) ... [T] from Ibn Umar. Mishkat 173, Sunnah 80, Tab, K, Haq in (Al-Asma'). Also narrated as Mawquf on Ibn Masud, may Allah be pleased with him.\n3. Musannaf Ibn Abi Shaybah: (37192), Al-Sunnah by Ibn Abi Asim: (85), Al-Albani said in Zilal al-Jannah: \"Its chain is Jayyid (good) Mawquf, its men are men of the two Sheikhs (Bukhari/Muslim).\" The hadith was also narrated by Al-Tabarani from two paths, one of which has trustworthy men as in \"Al-Majma'\" 5/219. Al-Mubarakpuri said in Tuhfat al-Ahwadhi: (Vol 6, p 322): \"Its chain is Sahih and the like of it is not said from opinion.\"\n4. See: Adwa' 'ala Salamat al-Mushaf al-Sharif min al-Naqs wa al-Tahrif: (p. 61), and: (p. 91). Its origin is narrated in Al-Bukhari and others from the hadith of Zaid bin Thabit Al-Ansari, may Allah be pleased with him, and its referencing preceded.\n5. Manahil al-Irfan: (1/249). Manahil al-Irfan fi Ulum al-Quran Author: Muhammad Abdul Azim Al-Zurqani (Died: 1367 AH), Publisher: Matba'at Isa al-Babi al-Halabi wa Shurakah Edition: Third Edition Number of Parts: 2\n6. Previous reference: (p. 36), Al-Wahy wa al-Quran: (p. 150).",
    "book_id": "936",
    "new_page_number": 20
  },
  {
    "serial_number": "1099953",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 114,
    "volume_number": 1,
    "text": "First: Its precision and integrity. Second: Its fulfillment of the agreed-upon compilation conditions and its conformity with the Final Review (*Ardah Akhirah*). Most prominent features and characteristics of Abu Bakr's compilation - may Allah be pleased with him - in detail: First: Its precision and integrity. Investigation, scrutiny, verification, and authentication of the Quranic nature of every collected Surah and verse, proving its Mutawatir transmission, restricting it to what its recitation was not abrogated, and stripping it of anything not Quran, was the most prominent characteristic of this compilation, by the consensus of the Companions - may Allah be pleased with them. Second: Its fulfillment of the agreed-upon compilation conditions and its conformity with the Final Review. Everything that met the agreed-upon compilation conditions was added to a single sheet in one place, which was later known as the Mushaf. Its verses and Surahs were arranged according to the Mushaf order, not the order of revelation (*Nuzuli*), in accordance with the Final Review which it was rumored that Zaid bin Thabit (1) may Allah be pleased with him had witnessed. That compilation conforms to what is established in the Preserved Tablet. It is established in Al-Bukhari and others from Aisha from Fatimah - may Allah be pleased with them both - that she said: \"The Prophet, peace be upon him, confided to me that Gabriel used to review the Quran with him every year, and that he reviewed it with me twice this year, and I do not see it but that my term has approached.\" (2) (3) Regarding that, Abu Abdul Rahman Al-Sulami (d. 74) may Allah have mercy on him says: Zaid bin Thabit recited to the Messenger of Allah, peace be upon him, twice in the year Allah took his soul. This recitation was named the recitation of Zaid bin Thabit because he wrote it for the Messenger of Allah, peace be upon him, recited it to him, witnessed the Final Review, and taught people with it until he died. Therefore, Abu Bakr and Umar relied on him in its collection, and Uthman appointed him to write the Mushafs. (4) Similarly, Abu Amr Al-Dani - may Allah have mercy on him - says in Al-Urjuzah Al-Munabbihah: (5) \"And he used to present to Gabriel ... in every year the entirety of the revelation / So he would recite to him in every presentation ... one of the Seven Letters (6) / Until when the time was near ... he presented it to him twice\" (7). Al-Qastallani (d. 923 AH) - may Allah have mercy on him - says: \"The entire Quran was written in his era - peace be upon him - but not collected in one place, nor were the Surahs arranged.\" (8) This is because the motives for collecting it in one place were lacking, and there was no urgent necessity for it at that time. Section Two: Explanation that the arrangement of verses in the Surahs is Tawqifi (divinely ordained). The arrangement of verses in the Surahs is a Tawqifi matter with no room for Ijtihad (reasoning) whatsoever. Al-Zarkashi (d. 794 AH) - may Allah have mercy on him - said: As for the verses in every Surah, and placing the Basmalah at their beginnings, their arrangement is Tawqifi without doubt, and there is no dispute in it; therefore, reversing it is not permissible. (9) Al-Suyuti (d. 911 AH) - may Allah have mercy on him - said: Consensus and synonymous texts indicate that the order of verses",
    "foot_note": "1. Establishing Zaid bin Thabit's witnessing of the Final Review is a matter of consideration for investigators due to the weakness of narrations regarding it. What is established with sound authentic chains is: Abdullah bin Masud witnessing it. As for Zaid witnessing it, it is merely famous. Despite its fame, the researcher did not find a sound authentic chain to rely on regarding his witnessing the Final Review except what was rumored in books of Quranic sciences and some books of exegesis. Therefore, Al-Baghawi said in \"Sharh al-Sunnah\" (4/525): It is said (*Yuqal*) that Zaid bin Thabit witnessed the Final Review, in which what was abrogated and what remained was clarified. He narrated it with the passive voice format \"It is said\" and did not declare his witnessing of it. What will be mentioned of Zaid witnessing the Final Review within the research is mentioned in line with what is famous and widespread, not based on what is established and settled. The Researcher.\n2. Al-Bukhari Manaqib (3426), Muslim Fada'il al-Sahaba (2450), Tirmidhi Manaqib (3872), Ibn Majah Funerals (1621), Ahmad (6/77).\n3. Al-Bukhari, Virtues of the Quran: 6/101, Virtues, number: 3353, Muslim, Virtues of the Companions number: 2450, Abu Dawood number: 5217, Musnad Ahmad, number: 25209, and see Fada'il al-Quran by Abu Al-Fadl Al-Razi, p: 51, Al-Burhan by Al-Zarkashi: 1/232, Lata'if al-Isharat by Al-Qastallani: 1/23.\n4. Narrated by Ahmad in his Musnad, Musnad Bani Hashim (1/598) H 3412, and narrated by Al-Nasa'i in Al-Sunan Al-Kubra Book of Virtues of the Quran (3/7), and Book of Virtues (4/36).\n5. Uthman bin Sa'id bin Uthman, Abu Amr Al-Dani, Al-Qurtubi, a prominent scholar of Reciters, trustworthy proof in Readings and its sciences, born in Denia, Andalusia in: 371 AH, has more than a hundred works, most famous is Al-Taysir fi al-Qira'at al-Sab' which Al-Shatibi organized in Al-Lamiyyah, died in Denia in 444 AH, Ma'rifat al-Qurra' al-Kibar: 1/406, Ghayat al-Nihayah: 1/503.\n6. This detailing is incorrect and is a matter of consideration for investigators, and it has been stated by more than one scholar other than Al-Dani. If we reflect on the time of seeking increase in the Seven Modes (*Ahruf*), it becomes established for us that it was in Medina shortly before the death of the Prophet, may Allah bless him and grant him peace, by about a year or two. So how could it be presented to him every year in one of the Seven Modes! While they hadn't been revealed yet! This is a backward statement from a scholar like Abu Amr Al-Dani, but glory be to Him who does not err.. The Researcher.\n7. Al-Urjuzah Al-Munabbihah by Abu Amr Al-Dani, Verse number: (70-72), (p. 87).\n8. See: Irshad al-Sari li Sharh Sahih al-Bukhari: (7/446).\n9. Al-Zarkashi, Al-Burhan fi Ulum al-Quran: (1/256). Al-Burhan fi Ulum al-Quran Author: Abu Abdullah Badr al-Din Muhammad bin Abdullah bin Bahadur Al-Zarkashi (Died: 794 AH) Editor: Muhammad Abu al-Fadl Ibrahim Edition: First, 1376 AH - 1957 AD Publisher: Dar Ihya' al-Kutub al-Arabiyyah Isa al-Babi al-Halabi and Partners (then photocopied by Dar Al-Ma'rifah, Beirut, Lebanon - with same pagination) Number of Parts: 4",
    "book_id": "936",
    "new_page_number": 21
  },
  {
    "serial_number": "1099954",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 115,
    "volume_number": 1,
    "text": "is Tawqifi (divinely ordained); there is no doubt about that. As for Consensus (*Ijma'*), it was reported by more than one, including Al-Zarkashi in Al-Burhan, and Abu Ja'far bin Al-Zubayr in his Munasabat; his phrase is: The arrangement of verses in their Surahs occurred by his instruction - peace be upon him - and his command, without disagreement on this among Muslims. (1) Al-Suyuti (d. 911 AH) also says - may Allah have mercy on him: \"What we hold is that all of the Quran which Allah sent down and commanded the affirmation of its script, and did not abrogate, nor lift its recitation after its revelation, is what is between the two covers, which the Mushaf of Uthman contained; nothing was decreased from it, nor increased in it, and its arrangement and organization are established upon what Allah Almighty organized, and His Messenger peace be upon him arranged regarding the verses of the Surahs; nothing of that was advanced or delayed.\" (2) Al-Zurqani (d. 1367 AH) - may Allah have mercy on him - said: \"The consensus of scholars was convened that the arrangement of verses in the Surah was by instruction (*Tawqif*) from the Prophet - may Allah bless him and grant him peace - from Allah Almighty, and there is no room for opinion and Ijtihad in it, and no opponent is known in that.\" (3) Among those who stated the Consensus narrated by Al-Suyuti and Al-Zurqani as well are: 1 - Ibn Qudamah Al-Maqdisi (d. 620 AH) where he says - may Allah have mercy on him: Arrangement of verses is obligatory; because their arrangement is by text by consensus. (4) 2 - And Abu Ja'far Al-Gharnati (d. 708 AH) where he says - may Allah have mercy on him: Know first that the arrangement of verses in their Surahs occurred by his instruction and command - peace be upon him, without disagreement on this among Muslims. (5) 3 - And Mulla Ali Al-Qari (d. 1014 AH) where he says - may Allah have mercy on him: Arrangement of verses is Tawqifi, and upon it is Consensus. (6) 4 - And Shihab al-Din Al-Nafrawi (d. 1127 AH) where he says - may Allah have mercy on him: Arrangement of verses is Tawqifi by agreement. (7) This is also indicated by many evidences from the authentic confirmed Sunnah from the Infallible, peace be upon him, which are too many to count. We mention among them, for example but not limited to: 1 - What Al-Bukhari narrated in his Sahih from Ibn Abi Mulaykah who said: Ibn Al-Zubayr said: I said to Uthman regarding this verse in Al-Baqarah {And those who are taken in death among you and leave wives} up to his saying {without expulsion} (Al-Baqarah verse: 240): The other one abrogated it, so why do you write it? He said: Leave it, O son of my brother, I do not change anything from it from its place. (8) The response of Uthman bin Affan to Ibn Al-Zubayr implies that they - may Allah be pleased with them all - knew the places of verse arrangement, so Uthman left it fixed in its place because the context indicates it, and because it is what they learned and what was practiced among them. 2 - What Muslim narrated in his Sahih from Umar who said: I did not ask the Prophet, peace be upon him, about anything more than I asked him about *Kalalah* (inheritance of one with no direct heirs) until he poked his finger in my chest and said: Does not the verse of Summer which is at the end of Surah Al-Nisa suffice you? (9) The verse of *Kalalah* is located at the end of Surah Al-Nisa and its conclusions. When Umar - may Allah be pleased with him - asked the Messenger of Allah - peace be upon him - he guided him to its place at the end of the Surah. From here, two things become clear to us: First matter: That the verses of the Surah are arranged and consecutive from its beginning to its end. Second matter: That the arrangement of verses was something the Prophet - peace be upon him - taught his noble companions - may Allah be pleased with them.",
    "foot_note": "1. Al-Suyuti, Al-Itqan fi Ulum al-Quran (1/211). See: I'jaz al-Quran by Al-Baqillani (p. 60). Asrar Tartib al-Quran: (p. 41). Manahil al-Irfan fi Ulum al-Quran (1/347). Hashiyat al-Shihab 'ala Tafsir al-Baydawi Inayat al-Qadi wa Kifayat al-Radi: (1/25). Fath al-Bayan fi Maqasid al-Quran - Abu al-Tayyib Muhammad Siddiq Khan bin Hasan bin Ali Ibn Lutfullah al-Husayni al-Bukhari al-Qinnawji (15/307).\n2. Previous reference: (p. 163).\n3. Manahil al-Irfan by Al-Zurqani: (1/346).\n4. Kashshaf al-Qina' 'an Matn al-Iqna': (1/344). See: Al-Mubdi' fi Sharh al-Muqni' (1/433). Al-Iqna' fi Fiqh al-Imam Ahmad bin Hanbal: (1/119).\n5. Al-Burhan fi Tanasub Suwar al-Quran - Hamad bin Ibrahim bin Al-Zubayr Al-Gharnati, Abu Ja'far: (p. 182). - Narrated by Al-Bukhari in Al-Sahih number (4536).\n6. Mirqat al-Mafatih Sharh Mishkat al-Masabih - Mulla Ali bin (Sultan) Muhammad, Abu al-Hasan Nur al-Din Al-Mulla Al-Harawi Al-Qari (Died: 1014 AH) Publisher: Dar Al-Fikr, Beirut - Lebanon Edition: First, 1422 AH - 2002 AD Number of Parts: 9\n7. Al-Fawakih Al-Dawani 'ala Risalat Ibn Abi Zaid Al-Qayrawani: 1/56, 66. Al-Fawakih Al-Dawani 'ala Risalat Ibn Abi Zaid Al-Qayrawani Author: Ahmad bin Ghanim (or Ghunaym) bin Salim Ibn Muhanna, Shihab al-Din Al-Nafrawi Al-Azhari Al-Maliki (Died: 1126 AH) Publisher: Dar Al-Fikr Edition: Without edition Date of publication: 1415 AH - 1995 AD Number of Parts: 2\n8. Narrated by Al-Bukhari in Al-Sahih number (4536).\n9. Narrated by Muslim number (1617).",
    "book_id": "936",
    "new_page_number": 22
  },
  {
    "serial_number": "1099955",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 116,
    "volume_number": 1,
    "text": "3 - Also what Muslim narrated in his Sahih from Abu Darda' raised (to the Prophet): \"Whoever memorizes ten verses from the beginning of Al-Kahf is protected from the Dajjal (Antichrist).\" And in a wording with him: \"Whoever recites the last ten of Surah Al-Kahf.\" (1) His saying: (from the beginning of Al-Kahf) and his saying: (the last ten) is clear evidence of the arrangement of the Surah's verses as is the case for all verses of the Quran. Likewise, \"his recitation - peace be upon him - of various Surahs in the presence of the Companions indicates that the arrangement of their verses is Tawqifi. The Companions would not arrange an order contrary to what they heard the Prophet - peace be upon him - recite, and this reached the level of Tawatur (mass transmission).\" (2) 4 - Also what is established in Al-Bukhari from the hadith of Aisha, may Allah be pleased with her, (that she) said: The Prophet, peace be upon him, heard a man reciting in the mosque, so he said: \"May Allah have mercy on him, he has reminded me of such and such verse, which I had dropped from such and such Surah.\" (3) This hadith and its likes are used as evidence for his teaching - peace be upon him - his companions - may Allah be pleased with them - the places of verses and their arrangement in Surahs, and that it is a Tawqifi matter with no deviation or escape from it. There are very many evidences establishing this issue. The Prophet's hearing of the Quran from his companions with arranged verses and his approval - peace be upon him - of their recitation, as well as his leading them in prayer throughout the revelation period of twenty-three years - repeatedly and frequently, known in the collections of Sunnah - creates sufficiency in referring to it. Whoever wants more benefit in this chapter should review the virtues of reciting specific verses of the Quran in their places in Sunnah books, like the virtue of the Opening of the Book (Al-Fatihah) which are too many to count, the virtues of the last two verses of Surah Al-Baqarah (4), and the virtue of the first ten verses of Surah Al-Kahf (5). Also what the Messenger of Allah - peace be upon him - persisted in reciting of some Surahs of the Quran without changing anything in their verses, neither advancing nor delaying, such as his recitation of Surahs Al-Baqarah, Al-Nisa, and Al Imran, and his recitation of Surah \"Qaf\" in Eid. (6) Also from the pulpit and in prayer as well, as he used to recite \"Al-Munafiqun\" in Jumu'ah (7). With his persistence in reciting these Surahs and verses, the Prophet - peace be upon him - also persisted in their arrangement, for it is not known from him - peace be upon him - that he changed anything of them at all. Undoubtedly, this action of his - peace be upon him - is among the clearest proofs that this arrangement is what agreed with its arrangement in the Preserved Tablet which he received from Gabriel - peace be upon him. Other evidences confirming that verse arrangement is Tawqifi: Confirming that verse arrangement is Tawqifi and demonstrating it is the revelation of a number of Surahs of the Quran wholly and at once. In classifying the revelation of Quranic Surahs, Al-Suyuti mentions the second type, which is the type revealed all at once. He says - may Allah have mercy on him: \"... AND FROM EXAMPLES OF THE SECOND: - what was revealed all at once - SURAH AL-FATIHAH, AL-IKHLAS, AL-KAWTHAR, TABBAT, LAM YAKUN, AL-NASR, AND THE TWO REFUGE-SEEKING SURAHS (AL-MU'AWWIDHATAN) WERE REVEALED TOGETHER. AND FROM IT IS SURAH AL-SAFF.\" (8) We cite some authentic established evidences regarding the revelation of some Surahs all at once,",
    "foot_note": "1. Narrated by Muslim number (809).\n2. See: Al-Itqan: (1/62-65).\n3. Narrated by Al-Bukhari Book of Virtues of the Quran Chapter: Whoever saw no harm in saying: Surah Al-Baqarah, and Surah such and such 6/194 H number 5042 and Muslim 33 Book of Travelers' Prayer 33 - Chapter on Command to Maintain the Quran, and Dislike of saying I forgot such verse, and permissibility of saying I was made to forget it 1/543 H number 788.\n4. See: Muslim in his Sahih number: 809, and others.\n5. See: Al-Bukhari in his Sahih number: (5008 - 5009 - 5040), and Muslim number: (807).\n6. Narrated by Muslim number: (891), and others.\n7. See: Muslim number: (877), and others from the hadith of Abu Hurairah.\n8. Al-Itqan: (1/136-137). With adaptation.",
    "book_id": "936",
    "new_page_number": 23
  },
  {
    "serial_number": "1099956",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 117,
    "volume_number": 1,
    "text": "Among those Surahs revealed all at once is Surah Bara'ah (Tawbah): Al-Bukhari narrated in his Sahih from Al-Bara' - may Allah be pleased with him - who said: \"The last Surah revealed completely (*Kamilah*) was Bara'ah.\" (1) Al-Bukhari also narrated it (2) with the wording: \"The last Surah revealed was Bara'ah...\" without the word \"completely\". Some scholars held that Surah Bara'ah was revealed in parts and not all at once, claiming the incorrectness of the word \"completely\". Badr al-Din al-Ayni - may Allah have mercy on him - said: \"His saying: (completely), Al-Dawudi said: The wording 'completely' is naught because Bara'ah was revealed bit by bit. I say: That is why the wording 'completely' was not mentioned in this hadith in (the Book of) Tafsir, and its wording there is: The last Surah revealed was Bara'ah.\" (3) However, Al-Tahir bin Ashur mentioned in \"Al-Tahrir wa Al-Tanwir\" that it was revealed all at once, attributing this view to the majority of scholars. (4) Among those Surahs revealed all at once is also Surah Al-Fath: Al-Bukhari narrated in his Sahih from Umar - may Allah be pleased with him - from the Prophet, peace be upon him, who said: (Tonight a Surah has been revealed to me which is dearer to me than that upon which the sun rises) then he recited: {Indeed, We have given you a clear conquest} (Al-Fath: 1). (5) Among those Surahs revealed all at once is also Surah Al-Bayyinah: From Ammar bin Abi Ammar, he said: I heard Abu Habbah Al-Badri say: When {Those who disbelieved among the People of the Scripture were not...} [Al-Bayyinah: 1] to its end was revealed, Gabriel - peace be upon him - said: O Messenger of Allah, indeed your Lord commands you to recite it to Ubayy. So the Prophet - peace be upon him - said to Ubayy: (Indeed Gabriel commanded me to recite this Surah to you). Ubayy said: Was I mentioned there, O Messenger of Allah? He said: (Yes). He said: So Ubayy wept. (6) Also from the Surahs revealed all at once is Surah Al-Kawthar: From Anas, he said: While the Messenger of Allah - peace be upon him - was among us one day, he dozed off, then raised his head smiling. We said: What makes you laugh, O Messenger of Allah? He said: \"A Surah was revealed to me just now.\" So he recited: {In the name of Allah, the Entirely Merciful, the Especially Merciful. Indeed, We have granted you, [O Muhammad], al-Kawthar. So pray to your Lord and sacrifice. Indeed, your enemy is the one cut off.} (Al-Kawthar complete: 1-3). (7) Also from the Surahs revealed all at once is Surah Al-Nasr: From Ubaydullah bin Abdullah bin Utbah, he said: Ibn Abbas said to me: Do you know the last Surah revealed from the Quran, revealed entirely? I said: \"Yes, {When the victory of Allah has come and the conquest}.\" He said: You have spoken the truth. (8) Also from the Surahs revealed all at once is Surah Al-Masad: It is established in the Two Sahihs from Abbas - may Allah be pleased with them both - who said: The Prophet - peace be upon him - climbed Al-Safa one day and said: (O Morning Warning!), so Quraysh gathered to him. They said: What is with you? He said: (If I told you that the enemy attacks you in the morning or evening, would you believe me?) They said: Yes. He said: (Indeed, I am a warner to you before a severe punishment). Abu Lahab said: May you perish! Is it for this you gathered us? So Allah revealed: {May the hands of Abu Lahab be ruined} (Al-Masad: 1). (9)",
    "foot_note": "1. Narrated by Al-Bukhari: (4364).\n2. Narrated by Al-Bukhari: (4605).\n3. Umdat al-Qari: (18/18).\n4. Al-Tahrir wa Al-Tanwir: (10/97).\n5. Narrated by Al-Bukhari: (4177).\n6. Narrated by Ahmad in Al-Musnad: (16001), and its editors said: (Hadith Sahih due to supporting evidence). Its origin is in Al-Bukhari: (3809), and Muslim: (799), from the hadith of Anas.\n7. Narrated by Muslim in 4 - Book of Prayer 14 - Chapter on the Proof of He Who Said: Basmalah is a verse from the beginning of every Surah except Bara'ah 1/300 H number 400.\n8. Sahih Muslim in the beginning of Book of Tafsir 4/2318 H number 3024.\n9. Narrated by Al-Bukhari: (4801), and Muslim: (208).",
    "book_id": "936",
    "new_page_number": 24
  },
  {
    "serial_number": "1099957",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 118,
    "volume_number": 1,
    "text": "Also from the Surahs revealed all at once are the two Mu'awwidhatayn (Al-Falaq and Al-Nas): From Uqbah bin Amir, he said: The Messenger of Allah, peace be upon him, said: \"Have you not seen verses revealed tonight the likes of which have never been seen? {Say, I seek refuge in the Lord of daybreak} and {Say, I seek refuge in the Lord of mankind}.\" (1) The summary of the above: The revelation of many short Surahs of the Mufassal all at once is a matter established by explicit authentic evidences, such as Al-Fatihah, Al-Qadr, Al-Ma'un, Al-Masad, Al-Kawthar, Al-Fil, Al-Nasr, Al-Kafirun, Al-Ikhlas, Al-Falaq, and Al-Nas. As well as Al-Fath. As for what some exegetes mentioned that several Surahs were revealed all at once as well, especially from the long ones, most of those statements are matters of consideration and deduction, and the disagreement in them is known because they are opinions based on reasoning not supported by clear argument from authentic explicit established evidence; therefore, the researcher mentioned only what was established to him by authentic explicit established evidence. Note: It must be known that the principle in the Holy Quran is that it was collected and arranged on the basis of its conformity with the Final Review (*Ardah Akhirah*), and the Final Review settled on what is established and conforming to what is in the Preserved Tablet as well. Section Three: Presentation of opinions regarding the arrangement of Surahs with preference between them. Al-Suyuti - may Allah have mercy on him - says in Al-Itqan regarding the disagreement on the arrangement of Surahs: As for the arrangement of Surahs as they are now in the Mushaf, scholars of this field differed on three schools of thought: First School: The view of the majority, which sees that the arrangement of Surahs is a Tawfiqi (divinely guided/success granted) matter from the Ijtihad (reasoning) of the Companions, as the Prophet, peace be upon him, delegated that to his Ummah after him. Among the most prominent who leaned towards this opinion is Imam Malik. Second School: Views that this arrangement is Tawqifi (instruction) from the Prophet, peace be upon him. A group of scholars held this view. Third School: Leans towards the view that the arrangement of most Surahs was by instruction (*Tawqif*) from the Prophet, peace be upon him, and was known in his life, and that the arrangement of some Surahs was by Ijtihad of the Companions. (2) We passed earlier what Al-Suyuti mentioned of scholars' opinions on the arrangement of Surahs in general. The disagreement on this issue is very wide and has major importance due to its relation to a great matter concerning the Book of Allah Almighty. Proponents of each view cited evidences for what they preferred. Major Imams whose opinion is relied upon spoke on this issue. The topic is not a main research in our subject, and the researcher did not cite the evidences of each group to discuss them for fear of prolongation in a side research from the main research topic, even though it is of great importance due to its status and value",
    "foot_note": "1. Narrated by Muslim 6 - Book of Travelers and Shortening It 46 - Chapter on Virtue of Reciting Al-Mu'awwidhatayn 1/558 H number 814.\n2. Al-Burhan (1/258).",
    "book_id": "936",
    "new_page_number": 25
  },
  {
    "serial_number": "1099958",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 119,
    "volume_number": 1,
    "text": "and the value of what it relates to, namely the Book of Allah Almighty. Many Imams see that the arrangement of the Holy Quran's Surahs was a Tawqifi (divinely ordained) arrangement just as the arrangement of its verses was. They cited clear evidences and compelling arguments that make the researcher pause long at them and reconsider, research, and look into them much. Among the most prominent of these opinions are: First Opinion: The saying of Al-Zarkashi (d. 794 AH) in Al-Burhan - may Allah have mercy on him: \"Some of our investigative Sheikhs said: He who said: No correlation is sought for the noble verse because they are according to scattered events has erred. The decisive speech is that it is according to events in revelation, and according to wisdom in arrangement. The Mushaf is like the Noble Sheets conforming to what is in the Hidden Book, all its Surahs and verses arranged by Tawqif (instruction)... I say: This is built on the fact that the arrangement of Surahs is Tawqifi, and this is the preponderant view.\" (1) Undoubtedly, such a statement from Al-Zarkashi has its scientific value, status, and worth, due to his discussion of each group's evidence on one hand, and his mastery of this science on the other. Second Opinion: The saying of Al-Suyuti (d. 911 AH) in Al-Itqan - may Allah have mercy on him: \"Among what indicates it is Tawqifi is that the 'Ha-Mim' Surahs (Hawamim) were arranged consecutively, and likewise the 'Ta-Sin' Surahs (Tawasin), but the 'Musabbihat' (Surahs starting with Tasbih) were not arranged consecutively; rather, separation occurred between their Surahs. And separation was made between 'Ta-Sin-Mim' of Al-Shu'ara and 'Ta-Sin-Mim' of Al-Qasas by 'Ta-Sin' (Al-Naml) even though it is shorter than them. If the arrangement were Ijtihad, the Musabbihat would have been mentioned consecutively, and 'Ta-Sin' delayed after Al-Qasas.\" (2) Third Opinion: The saying of Abu Bakr Al-Ambari (d. 328 AH) where he says - may Allah have mercy on him: \"The consistency of Surahs is like the consistency of verses and letters; all is from the Prophet, peace be upon him. So whoever advances a Surah or delays it has corrupted the organization of the Quran.\" (3) Fourth Opinion: The saying of Al-Kirmani: (d. 893 AH) - may Allah have mercy on him: \"The arrangement of Surahs thus is with Allah in the Preserved Tablet in this order.\" (4) Fifth Opinion: The saying of Sharaf al-Din Al-Tibi (d. 743 AH) also - may Allah have mercy on him: \"The Quran was revealed first as a whole from the Preserved Tablet to the Lowest Heaven, then revealed separately according to interests, then established in the Mushafs according to the composition and organization established in the Preserved Tablet.\" (5) Sixth Opinion: The saying of Muhibb al-Din Al-Nuwayri (d. 857 AH) where he says - may Allah have mercy on him: \"He (Uthman) ordered them to copy from the sheets (*Suhuf*) only so his Mushaf would rely on Abu Bakr's original which relied on the Prophet's original - peace be upon him. He appointed Zaid due to Abu Bakr and Umar's reliance on him, and joined a group to help him, and so number would join probity. These were the ones; due to their fame for precision and knowledge. They wrote it as one hundred and fourteen Surahs, the first being 'Al-Hamd' and the last 'Al-Nas' on this order.\" (6) It is clear from Al-Nuwayri's words that he sees Abu Bakr's copying was complete with arranged verses",
    "foot_note": "1. Al-Burhan fi Ulum al-Quran (1/37). And see: Al-Fawakih Al-Dawani 'ala Risalat Ibn Abi Zaid Al-Qayrawani: 1/56. And Al-Kawkab Al-Wahhaj Sharh Sahih Muslim: 10/76.\n2. Al-Itqan: Al-Suyuti Vol 1 p 63.\n3. Al-Itqan: Al-Suyuti Vol 1 p 62.\n4. Al-Burhan: Al-Zarkashi Vol 1 p 259, and Al-Itqan by Al-Suyuti Vol 1 p 62.\n5. Al-Itqan: Al-Suyuti Vol 1 p 62\n6. Sharh Tayyibat al-Nashr (1/109).",
    "book_id": "936",
    "new_page_number": 26
  },
  {
    "serial_number": "1099959",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 120,
    "volume_number": 1,
    "text": "and Surahs as well, and that it relied on what was written and preserved from the Messenger of Allah, peace be upon him; there is no difference between verses and Surahs in Tawqif (divine instruction), and that is why he (Uthman) ordered them to copy from it. Seventh Opinion: The saying of Abu Ja'far Al-Nahhas (d. 338 AH) where he says - may Allah have mercy on him: \"The composition of Surahs in this order is from the Messenger of Allah - peace be upon him.\" (1). Eighth Opinion: The saying of Abu Al-Hasan Ibn Al-Hassar (d. 620 AH) where he says - may Allah have mercy on him: \"The arrangement of Surahs and placing verses in their places was only by Revelation.\" (2) Ninth Opinion: The saying of Al-Baghawi (d. 516 AH) where he says - may Allah have mercy on him: The Companions - may Allah be pleased with them - collected between the two covers the Quran which Allah Almighty sent down to His Messenger, peace be upon him, without adding to it or decreasing anything from it... So they wrote it as they heard from the Messenger of Allah, peace be upon him, without advancing anything or delaying... Thus it is established that the effort of the Companions was in collecting it in one place, not in arranging it, for the Quran is written in the Preserved Tablet in the order that is in our Mushafs. Allah Almighty sent it down as a whole in the month of Ramadan on the Night of Decree to the Lowest Heaven, as the Almighty said: {The month of Ramadhan [is that] in which was revealed the Quran} (Al-Baqarah: 185), and the Almighty said: {Indeed, We sent it down during the Night of Decree} (Al-Qadr: 1) (3). Al-Baghawi's words are extremely precise; he sees that the Quran in our hands remains as it was in the Preserved Tablet, so it was arranged, and descended arranged to the Lowest Heaven with all its verses and Surahs. And even though it descended piecemeal after that to the Messenger of Allah, peace be upon him, it was collected by Revelation as it was in the Preserved Tablet, and the Companions - may Allah be pleased with them - wrote it according to this collection which they learned from the Messenger of Allah, peace be upon him. Tenth Opinion: The saying of Mulla Ali Al-Qari (4) where he says - may Allah have mercy on him: Yet the more correct view is that the arrangement of Surahs is also Tawqifi, even if their Mushafs differed in that before the Final Review... And among what indicates it is Tawqifi is that the 'Ha-Mim' Surahs (Hawamim) were arranged consecutively, and likewise the 'Ta-Sin' Surahs (Tawasin), but the 'Musabbihat' were not arranged consecutively; rather, separation occurred between their Surahs, and likewise the mixing of Makki and Madani Surahs (5). In the saying and evidence of \"Ali Al-Qari\", it becomes clear that the arrangement, even if a theoretical text was not narrated regarding it, was more confirmed through contemplation of the practical application, which suggests indisputably that the arrangement was Tawqifi. The gist of his speech is quoted from Al-Suyuti's saying. Based on the above, scholars did not hesitate to prefer this opinion stating Tawqif. Ahmad bin Abdul Rahman bin Muhammad Al-Banna Al-Sa'ati said: The correct view is that the arrangement of Surahs and verses is a Tawqifi matter with no room for opinion in it. (6) Among what was composed in poetry regarding that is the saying of Abu Al-Hasan Ibn Al-Hassar (d. 620 AH) in his book \"Al-Nasikh wa Al-Mansukh\":",
    "foot_note": "1. Al-Burhan: Al-Zarkashi Vol 1 p 259, and Al-Itqan by Al-Suyuti Vol 1 p 62.\n2. Al-Itqan: Al-Suyuti Vol 1 p 62.\n3. Sharh al-Sunnah by Al-Baghawi: (4/521). See: Al-Manhal Al-Adhb Al-Mawrud Sharh Sunan Abi Dawood: 5/206.\n4. Mulla Ali Al-Qari: (d. 1014 AH - 1606 AD), he is the Jurist, Muhaddith, Reciter Nur al-Din Abu al-Hasan Ali bin Sultan Muhammad, Al-Qari Al-Harawi Al-Makki known as \"Mulla Ali Al-Qari\". Titled Al-Qari for being knowledgeable in Readings; Al-Harawi: relative to the city of Herat, one of the mother cities of Khorasan, within current Afghanistan. Al-Makki: relative to Mecca Umm al-Qura; because he traveled to it, learned from its Sheikhs, and settled there until he died. Born in Herat around 930 AH, grew up there, sought knowledge, memorized the Quran, mastered it under his Sheikh the Reciter Mu'in al-Din bin Al-Hafiz Zayn al-Din Al-Harawi, and received principles of Sharia sciences from Sheikhs of his time. Then he traveled to Mecca, where he settled, adhered to scholars for long years, and continued acquiring knowledge until he became one of the famous scholars. He was, may Allah have mercy on him, Hanafi in Madhhab, as known from his works and biography, and contributed to editing many issues of the Hanafi school and supporting them with legal evidences. He was known for religiosity, piety, and chastity. He ate from the work of his hand, was ascetic regarding the world, dominated by asceticism, chastity, and contentment with subsistence. He mixed little with people, worshipped much, and was pious. He used to write a Mushaf every year with his beautiful handwriting, annotated with readings and tafsir, sell it, and it would suffice him for his year's food. He believed that closeness to rulers and accepting their grants harms sincerity and piety. He used to say: \"May Allah have mercy on my father, he used to say to me: I do not want you to become one of the scholars (ulama), lest you stand at the doors of princes.\" Ended from \"Mirqat al-Mafatih\" (1/311). For more on his biography see: - Al-A'lam by Al-Zirikli (5/12-13). - Al-Ta'liq Al-Sabih 'ala Mishkat al-Masabih by Al-Kandahlawi (p. 6). - Al-Ta'liqat Al-Saniyyah by Al-Laknawi (p. 8-9). - Mulla Ali Al-Qari: Catalog of his works and what was written about him by Muhammad Abdul Rahman Al-Shamma'.\n5. Mirqat al-Mafatih Sharh Mishkat al-Masabih - Ali bin (Sultan) Muhammad, Abu al-Hasan Nur al-Din Al-Mulla Al-Harawi Al-Qari: (4/1522).\n6. Al-Fath Al-Rabbani li Tartib Musnad Al-Imam Ahmad: Ahmad bin Abdul Rahman bin Muhammad Al-Banna Al-Sa'ati: 18/174. See: Fath al-Bayan fi Maqasid al-Quran - Muhammad Siddiq Khan: 1/31 and 15, 307. Hashiyat al-Shihab 'ala Tafsir al-Baydawi: 1/25. Tafsir Hada'iq al-Ruh wa al-Rayhan fi Rawabi Ulum al-Quran: Introduction: 96. Al-Tafsir min Sunan Sa'id bin Mansur: 1/239. Mir'at al-Masabih Sharh Mishkat al-Masabih: 7/334.",
    "book_id": "936",
    "new_page_number": 27
  },
  {
    "serial_number": "1099960",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 121,
    "volume_number": 1,
    "text": "\"O you who ask me about the Book of Allah diligently... And about the arrangement of what is recited of Surahs\nAnd how the Chosen One from Mudar brought them... May God bless the Chosen One from Mudar\" (1)\nIbn Al-Hassar indicates that the arrangement of Surahs was brought by the Prophet - peace be upon him, which is a clear indication from his speech that the arrangement of Surahs is Tawqifi from him - peace be upon him. Eleventh Opinion: A collection of statements from some contemporaries. A group of contemporaries also preferred the view of Tawqif, and they are, for example but not limited to: \"It came in Al-Tafsir Al-Wasit: The arrangement of Surahs is as it came in the Noble Mushaf by the command of Allah Almighty (2). 1 - The author of Al-Tafsir Al-Wasit said: What the soul leans towards is that the arrangement of Surahs is Tawqifi, and that every Surah has its subjects which we see prominent in a way distinguishing it from others (3). 2 - Wahbah bin Mustafa Al-Zuhayli (d. 1436 AH) said: There is no disagreement among scholars that the arrangement of verses of Surahs is Tawqifi, transmitted and established from the Prophet, peace be upon him, just as the arrangement of Surahs is also Tawqifi according to the preponderant view (4). Among those who said this as well among contemporaries are Muhammad Abdullah Draz and Ahmed Shakir. Among the most prominent evidences used by some of these for the Tawqif of the Mushaf arrangement are: 1 - The consensus of the Companions - may Allah be pleased with them - on the arrangement of Surahs in the Uthmani Mushaf. If this arrangement were Ijtihadi (based on reasoning), they would not have agreed on it, would have held onto their Mushafs, would not have offered them for burning, and would not have united on the Imam Mushaf. \"Uthman bin Affan - may Allah be pleased with him - burned the Mushafs in which disagreement occurred, and kept for them the agreed upon, as established in the Final Review.\" (5) It is established in Al-Bukhari from Anas bin Malik, may Allah be pleased with him, that Hudhayfah bin Al-Yaman, may Allah be pleased with him, came to Uthman, may Allah be pleased with him, while he was campaigning with the people of Sham in the conquest of Armenia and Azerbaijan with the people of Iraq. Their difference in recitation alarmed Hudhayfah, so Hudhayfah said to Uthman: \"O Commander of the Faithful, save this nation before they differ in the Book like the difference of the Jews and Christians.\" So Uthman sent to Hafsa: \"Send us the sheets (*Suhuf*) so we may copy them into the volumes (*Masahif*), then we will return them to you.\" So Hafsa sent them to Uthman. He ordered Zaid bin Thabit, Abdullah bin Al-Zubayr, Sa'id bin Al-Aas, and Abdul Rahman bin Al-Harith bin Hisham, so they copied them into the volumes. Uthman said to the three Qurashi men: \"If you and Zaid bin Thabit differ in anything of the Quran, write it in the dialect of Quraysh; for it was revealed in their dialect (meaning initially).\" So they did so until when they had copied the sheets into the volumes, Uthman returned the sheets to Hafsa, and sent to every region a volume from what they had copied, and ordered that everything else of the Quran in every sheet or volume be burned. (6) (7)",
    "foot_note": "1. For more, see: Al-Itqan by Al-Suyuti (1/44).\n2. Majma' al-Buhuth (10/2043).\n3. Al-Tafsir Al-Wasit by Muhammad Sayyid Tantawi (d. 1431 AH): (6/9). This Tafsir is sometimes attributed to \"Tantawi\", and other times to a group of scholars under the supervision of the Islamic Research Academy at Al-Azhar, as is the case in the edition: General Authority for Amiri Press Affairs Edition: First, (1393 AH = 1973 AD) - (1414 AH = 1993 AD) Number of Volumes: 10\n4. Al-Tafsir Al-Munir by Al-Zuhayli (1/23). See: Kuwaiti Fiqh Encyclopedia: 14/181., Kuwaiti Fiqh Encyclopedia Issued by: Ministry of Awqaf and Islamic Affairs - Kuwait Number of Parts: 45 parts Edition: (from 1404 - 1427 AH) .. Parts 1-23: Second Edition, Dar Al-Salasil - Kuwait .. Parts 24-38: First Edition, Matabi' Dar Al-Safwah - Egypt .. Parts 39-45: Second Edition, Ministry Print. See: Arrangement of Verses and Surahs of the Holy Quran - Dr. Muhammad Abu Zaid via his website. With adaptation.\n5. Al-Bidaya wa Al-Nihaya: by Ibn Kathir: (7/178). Al-Bidaya wa Al-Nihaya Author: Abu al-Fida Ismail bin Umar bin Kathir al-Qurashi al-Basri then al-Dimashqi (Died: 774 AH) Publisher: Dar Al-Fikr Year of Publication: 1407 AH - 1986 AD Number of Parts: 15\n6. Narrated by Al-Bukhari, Hadith: (4987).\n7. Umar bin Ali bin Ahmad Al-Shafi'i, known as Ibn Al-Mulaqqin: (d. 804 AH) said the meaning of (Yughazi) is raids. Arminiyah: with Kasra on the first letter, Ibn Al-Sam'ani opened it (Fatha), its Ya is lightened and tightened as Yaqut said. The authors of \"Al-Matali'\" said: Lightened only. Abu Ubaid said: A known country named for Armenians being in it, a nation like the Romans. It is said: Named after Armon bin Lamti bin Yawman bin Japheth bin Noah. Abu Al-Faraj said: Whoever puts Damma on the Hamza is wrong. He said: I read it with Kasra to Abu Mansur Al-Lughawi; he said: It is a non-Arabic name. It was established - as Al-Rashati said - in the year twenty-four in the caliphate of Uthman at the hands of Salman bin Rabi'ah Al-Bahili. He said: Its people are Banu Al-Rumi bin Iram bin Sam bin Noah. And Azerbaijan - with Fatha on the first letter with Qasr and Madd, and Fatha on Ba and Kasra, and Kasra on Hamza as well, narrated by Ibn Makki in his \"Tanqib\" - a mountainous country from the lands of Iraq adjacent to the districts of Armenia from the west. Abu Ishaq Al-Buhayri said: The eloquent is Dharbijan. Al-Jawaliqi said: The Hamza in its beginning is original, because Adhar is added to the end. See: Al-Tawdih li Sharh Al-Jami' Al-Sahih: (24/20-25).",
    "book_id": "936",
    "new_page_number": 28
  },
  {
    "serial_number": "1099961",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 122,
    "volume_number": 1,
    "text": "Ali bin Abi Talib, may Allah be pleased with him, said: \"O people, do not exaggerate regarding Uthman, and say nothing but good about him regarding the Mushafs and the burning of the Mushafs. By Allah, he did not do what he did regarding the Mushafs except with the consultation of all of us.\" (1) The saying of Ali bin Abi Talib, may Allah be pleased with him, indicates that they agreed upon it with a silent consensus - may Allah be pleased with them all. Stance of Ibn Masud - may Allah be pleased with him: Ibn Kathir - may Allah have mercy on him - said: \"It was narrated about Abdullah bin Masud that he was angry when his Mushaf was taken from him and burned, and he spoke about his precedence in Islam over Zaid bin Thabit who wrote the Mushafs. So Uthman bin Affan - may Allah be pleased with him - wrote to him inviting him to follow the Companions in what they agreed upon of interest in that, uniting the word, and lack of disagreement. So Abdullah bin Masud turned back, answered the call to follow, and left opposition - may Allah be pleased with them all.\" (2) Ibn Masud's response - may Allah be pleased with him - to follow in submitting his Mushaf for burning strengthens what we mentioned earlier of Ali bin Abi Talib's saying - may Allah be pleased with him; it strengthens, confirms, and reinforces the statement of silent consensus on one hand, and establishes actual consensus on the other hand as well. So may Allah be pleased with them all. Regarding that, Al-Zurqani (d. 1367 AH) says in his Manahil - while reviewing the evidences of proponents of Tawqif: \"The arrangement of all Surahs is Tawqifi by the instruction of the Messenger - peace be upon him - like the arrangement of verses, and no Surah was placed in its position except by his order, peace be upon him. Proponents of this view argued that the Companions agreed on the Mushaf written in the era of Uthman and none of them dissented. Their consensus is not complete unless the arrangement they agreed upon was by instruction (*Tawqif*), because if it were by Ijtihad, the owners of differing Mushafs would have held onto their difference. But they did not hold onto it; rather they turned away from it and their arrangement, abandoned their Mushafs and burned them, and returned to Uthman's Mushaf and its arrangement entirely. Then they cited narrations for their school as evidences supporting the consensus.\" (3) If we concede for the sake of argument that the arrangement of the Mushaf was initially an Ijtihadi (reasoning-based) arrangement not Tawqifi, we would say that the consensus of the Nation has settled on the Mushaf arrangement, such that all books of exegesis follow this matter; we know of no opponent among the predecessors and successors, except that three contemporaries deviated from that, and mention of them will come in the next section God willing. Therefore, it is not permissible, such being the case, to violate this work upon which the Nation agreed. The meaning here refers to books of exegesis, because the matter of Mushafs (physical copies) no one dares to oppose at all, except what some Orientalists called for as will be explained. 2 - The Companions' partitioning (*Tahzib*) of the Quran. Also among what they used as evidence that the arrangement of Surahs is Tawqifi is the partitioning of the Quran. Regarding that, Al-Hafiz Ibn Hajar (d. 852 AH) - may Allah have mercy on him - says: \"Among what indicates that the arrangement of",
    "foot_note": "1. Al-Masahif; by Ibn Abi Dawood p. 96.\n2. Al-Bidaya wa Al-Nihaya; by Ibn Kathir: (7/228). With slight adaptation.\n3. See: Manahil al-Irfan: (1/354).",
    "book_id": "936",
    "new_page_number": 29
  },
  {
    "serial_number": "1099962",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 123,
    "volume_number": 1,
    "text": "the Mushaf was Tawqifi is what Ahmad, Abu Dawood and others narrated from Aws bin Abi Aws Hudhayfah Al-Thaqafi who said: I was in the delegation of Thaqif who accepted Islam... and in it... So we asked the Companions of the Messenger of Allah, peace be upon him, saying: How do you partition the Quran? They said: We partition it into three Surahs, five Surahs, seven Surahs, nine Surahs, eleven, thirteen, and the party of Mufassal from 'Qaf' until we finish.\" Then Ibn Hajar said: \"This indicates that the arrangement of Surahs as it is in the Mushaf now was existing in the era of the Prophet - peace be upon him.\" (1) This is also clear evident proof mentioned by Al-Hafiz in Al-Fath, inferring that the arrangement of Surahs as it is in the Mushaf now was likewise in the era of its first revelation during the time of the Prophet, peace be upon him. 3 - The orderly arrangement of some Surahs similar in their opening. Regarding that, Al-Suyuti - may Allah have mercy on him - says: \"Among what indicates it is Tawqifi is that the 'Ha-Mim' Surahs (Hawamim) were arranged consecutively, and likewise the 'Ta-Sin' Surahs (Tawasin), but the 'Musabbihat' were not arranged consecutively; rather, separation occurred between their Surahs. And separation was made between 'Ta-Sin-Mim' of Al-Shu'ara and 'Ta-Sin-Mim' of Al-Qasas by 'Ta-Sin' (Al-Naml) even though it is shorter than them. If the arrangement were Ijtihad, the Musabbihat would have been mentioned consecutively, and 'Ta-Sin' delayed after Al-Qasas.\" (2) This was mentioned when presenting the opinions of those stating the arrangement of Surahs is Tawqifi. This precise arrangement mentioned by Al-Suyuti for Surahs similar in their opening and introduction, and the manner of their arrangement and sequence with that extreme precision regarding \"Al-Ha-Mim\" Surahs and \"Al-Ta-Sin-Mim\" Surahs; since the seven \"Al-Ha-Mim\" Surahs were arranged consecutively, and likewise the three \"Al-Ta-Sin-Mim\" Surahs. As for the seven Musabbihat Surahs, despite the similarity of their opening, they did not come consecutively. And his saying: (and Ta-Sin was delayed) means Al-Naml opened with (Ta-Sin) was delayed after Al-Shu'ara (?) so it came after it, and fell between Surahs Al-Shu'ara and Al-Qasas which are similar in opening with (Ta-Sin-Mim). He evidenced by that that the arrangement of Surahs is Tawqifi without doubt. This is an inference from Al-Suyuti that has its strength, validity, and authority. The Hawamim Surahs are: Surahs possessing \"Al-Ha-Mim\". The Tawasin or Tawasim Surahs are: Surahs possessing \"Al-Ta-Sin-Mim\". They were collected without analogy. As for \"Al-Ha-Mim\" Surahs: They are the seven \"Al-Ha-Mim\" Surahs opened with \"Ha-Mim\", which are Surahs: 1 - Ghafir 2 - Fussilat 3 - Al-Shura 4 - Al-Zukhruf 5 - Al-Dukhan 6 - Al-Jathiyah 7 - Al-Ahqaf. Al-Kumayt bin Yazid (3) said:\n'We found for you in the family of Ha-Mim a verse... Interpreted among us by a pious and eloquent one.' (4)\nThey are in the Mushaf order as follows: First: (Ha, Meem (1) The revelation of the Book is from Allah, the Exalted in Might, the Knowing (2)) [Ghafir]. Second: (Ha, Meem (1) [This is] a revelation from the Entirely Merciful, the Especially Merciful (2)) [Fussilat]. Third: (Ha, Meem (1) 'Ayn, Seen, Qaf (2)) [Al-Shura].",
    "foot_note": "1. Fath al-Bari: Ibn Hajar Al-Asqalani Vol 9 p 42, 43.\n2. Al-Itqan: Al-Suyuti Vol 1 p 63.\n3. Al-Kumayt bin Zaid Al-Asadi, surnamed Abu Al-Mustahill, (60 AH - 126 AH), an Arab poet from the tribe of Banu Asad and one of the most famous poets of the Umayyad era. He lived in Kufa and was famous for Shi'ism and his poems regarding that called Al-Hashimiyyat. See Free Encyclopedia - Wikipedia.\n4. The verse is by Al-Kumayt bin Zaid Al-Asadi, Majaz al-Quran by Abu Ubaidah: (218-1) and his Diwan, Encyclopedias Press in Cairo 18. Al-Ha-Mim and Dhawat Ha-Mim: Surahs beginning with \"Ha-Mim\". Al-Hariri stated in Durrat al-Ghawwas that one says: Al-Ha-Mim, Dhawat Ha-Mim, and Al-Ta-Sin-Mim, and one does not say: Hawamim or Tawasim.",
    "book_id": "936",
    "new_page_number": 30
  },
  {
    "serial_number": "1099963",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 124,
    "volume_number": 1,
    "text": "Fourth: (Ha, Meem (1) By the clear Book (2)) [Al-Zukhruf]. Fifth: (Ha, Meem (1) By the clear Book (2)) [Al-Dukhan]. Sixth: (Ha, Meem (1) The revelation of the Book is from Allah, the Exalted in Might, the Wise (2)) [Al-Jathiyah]. Seventh: (Ha, Meem (1) The revelation of the Book is from Allah, the Exalted in Might, the Wise (2)) [Al-Ahqaf]. \"Ha-Mim\" may be made a name for the Surah, taking grammatical cases but is diptote. (1) As for \"Al-Ta-Sin-Mim\" Surahs: They are the Surahs opened with (Ta-Sin-Mim) or (Ta-Sin), and they are three Surahs: 1 - Al-Shu'ara 2 - Al-Naml 3 - Al-Qasas. They are in the Mushaf order as follows: First: (Ta, Seen, Meem (1) These are the verses of the clear Book) [Al-Shu'ara]. Second: (Ta, Seen. These are the verses of the Qur'an and a clear Book (1) A guidance and good tidings for the believers (2)) [Al-Naml]. Third: (Ta, Seen, Meem (1) These are the verses of the clear Book (2)) [Al-Qasas]. Abu Ubaidah recited:\n'And by the Tawasim which were made three... And by the Hawamim which were made seven' (2)\nHe means by \"made three\" that they are three Surahs, and by \"made seven\" that they are seven Surahs. As for the Musabbihat, they are the Surahs opened with Tasbih (Glorification), and they are seven Surahs: 1 - Al-Isra. 2 - Al-Hadid. 3 - Al-Hashr. 4 - Al-Saff. 5 - Al-Jumu'ah. 6 - Al-Taghabun. 7 - Al-A'la. They are in the Mushaf order as follows: First: (Exalted is He who took His Servant by night from al-Masjid al-Haram to al-Masjid al-Aqsa, whose surroundings We have blessed) (1) [Al-Isra]. Second: (Whatever is in the heavens and earth exalts Allah, and He is the Exalted in Might, the Wise) (1) [Al-Hadid]. Third: (Whatever is in the heavens and whatever is on the earth exalts Allah, and He is the Exalted in Might, the Wise) (1) [Al-Hashr]. Fourth: (Whatever is in the heavens and whatever is on the earth exalts Allah, and He is the Exalted in Might, the Wise) (1) [Al-Saff]. Fifth: (Whatever is in the heavens and whatever is on the earth exalts Allah, the Sovereign, the Pure, the Exalted in Might, the Wise) (1) [Al-Jumu'ah]. Sixth: (Whatever is in the heavens and whatever is on the earth exalts Allah. To Him belongs dominion, and to Him belongs [all] praise, and He is over all things competent) (1) [Al-Taghabun]. Seventh: (Exalt the name of your Lord, the Most High) (1) [Al-A'la]. After clarifying the review of opinions and evidences of those saying the arrangement of Surahs is Tawqifi and judging them, the following becomes clear to us:",
    "foot_note": "1. See: Zad al-Masir: 7/204-205. Zad al-Masir fi Ilm al-Tafsir Author: Jamal al-Din Abu al-Faraj Abdul Rahman bin Ali bin Muhammad Al-Jawzi (Died: 597 AH) Editor: Abdul Razzaq Al-Mahdi Publisher: Dar Al-Kitab Al-Arabi - Beirut Edition: First - 1422 AH\n2. See: Zad al-Masir: 7/204-205, Jamal al-Qurra': 1/34-36.",
    "book_id": "936",
    "new_page_number": 31
  },
  {
    "serial_number": "1099964",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 125,
    "volume_number": 1,
    "text": "First: The strength of their evidences, their authority, validity, and preponderance. Second: That the Mushaf arrangement of Surahs upon which the Imam Mushaf settled is undoubtedly conforming to what is established in the Preserved Tablet. It is what the Companions, may Allah be pleased with them, agreed upon, and the Nation accepted with approval. It is obligatory to adhere to it, hold fast to it, act by it, and not deviate from it, whether this arrangement is Tawqifi or Ijtihadi. Along with rejecting biased calls advocating re-arranging the Mushaf chronologically or thematically, and rejecting any similar claim to those false, degraded claims like those issued by some Orientalists who will be mentioned, and those who were influenced by them, followed them, and advocated their idea among some contemporaries. Section Four: The beginning of opposition and contradiction to the Mushaf order with the chronological order (order of revelation) and clarifying its source. A group of Orientalists attacked this arrangement, and there is no surprise in that as this is their habit and custom. But when a group from our own skin and those belonging to our Qiblah attacks this arrangement, here comes the astonishment! Three individuals breached this consensus, classifying their Tafsirs (exegeses) according to the chronological order (*Nuzuli*), leaving the Mushaf order upon which the practice of the predecessors (Salaf) proceeded and upon which the Nation's consensus settled. The three Tafsirs are: 1 - Tafsir Bayan al-Ma'ani: which is \"Interpretation of the Wise Book of Allah according to Revelation\" by Abdul Qadir Mulla Huwaish (d. 1398 AH) (1). 2 - Al-Tafsir Al-Hadith: by Muhammad Izzat Darwaza (d. 1404 AH) (2). 3 - The book \"Ma'arij al-Tafakkur wa Daqa'iq al-Tadabbur\" by Abdul Rahman Habanakah Al-Maydani (d. 1425 AH) (3). As for Sheikh \"Abdul Qadir Mulla Huwaish\" and Professor \"Muhammad Izzat Darwaza\", both contemporaries, they acknowledged that the arrangement of Surahs in the Mushaf is Tawqifi and it is not permissible to oppose this arrangement, because it was by revelation from Allah to Gabriel to the Messenger of Allah - peace be upon him. (4) Yet, they opposed the Tawqifi arrangement in their Tafsirs. They argued that the method of addressing Tafsir differs from the Mushaf arrangement, and they offered excuses that do not constitute a proof nor clarify a path. The researcher did not address those flimsy arguments here to discuss and refute them due to their weakness and frailty on one hand, and their length as well, and because they did not present any convincing evidences that could stand for argumentation on the other hand. The researcher discussed them along with studying the three Tafsirs in a special research. (5) Both \"Huwaish\" and \"Darwaza\" dictated a contemporary Tafsir which each arranged chronologically, not",
    "foot_note": "1. Huwaish is: Abdul Qadir bin Mulla Huwaish Al-Sayyid Mahmoud Al-Ghazi (d. 1398 AH) Al-Ani, Al-Deirzori, Al-Furati. He is Hanafi Ash'ari. \"He was accused of being 'Sufi Naqshbandi', but his son denied that and informed that he used to go to the Sheikh of the Naqshbandi order and host him in our house.\" Just that! .. ! .. See: Al-Tafsir wa Al-Mufassirun Asasuhu wa Ittijahatuhu wa Manahijuhu fi Al-Asr Al-Hadith. Dr. Fadl Abbas Hasan: (3/250). Dar Al-Nafa'is - Amman - Jordan, 1st ed, 1437 AH.\n2. Muhammad Izzat bin Abdul Hadi Darwaza: (21/6/1887 - 26/6/1984), a thinker, writer, and Arab nationalist struggler born in Nablus and died in Damascus. In addition to his political struggle, he was a litterateur, historian, journalist, translator, and interpreter of the Quran. He is one of the founders of Arab nationalist thought. For more on his biography see: 1. Birth of Muhammad Izzat Darwaza: Islam Story website. Accessed 6/11/2009. 2. Muhammad Izzat Darwaza: The Struggling Writer, Islam Online website. Accessed 14/12/2009. 3. The Nasserist Era and the Transition from Theory to Application, Al-Watan Newspaper. Shakir Al-Nabulsi, Accessed 25/11/2009. Quoted from Wikipedia.\n3. Sheikh Abdul Rahman Habanakah Al-Maydani Al-Dimashqi was born in the year: (1345 AH - 1927 AD), in one of the oldest neighborhoods of Damascus, Al-Maydan neighborhood, to a family of knowledge, call, and Jihad; his father was the educative scholar, the Mujahid, carrier of the banner of Da'wah in Sham, Imam Hasan Habanakah Al-Maydani, member of the Constituent Council of the Muslim World League. The roots of the Sheikh's family go back to the Arabs of Banu Khalid whose dwellings extend to the Badia of Hama in the land of Sham. On the night of Wednesday 25 Jumada al-Akhirah 1425 AH, Allah decreed His true decree with the death of Sheikh Abdul Rahman Habanakah Al-Maydani, at 80 years old, following an illness. For more: See: The Scholar Thinker Abdul Rahman Habanakah Al-Maydani - Ayman bin Ahmad Dhu Al-Ghina - Article on Al-Alukah website - Dated: 19/3/1428 AH. And see \"My Husband As I Knew Him\" - Aisha Al-Jarrah - Dar Al-Qalam - Damascus (n.d).\n4. See: Bayan al-Ma'ani 1/3, and Al-Tafsir Al-Hadith 1/9. Tafasir Hasab Tartib al-Nuzul fi al-Mizan: Dr. Mustafa Muslim. Article on Ahl al-Tafsir website, dated: 15/12/1432 AH. With slight adaptation for coherence.\n5. See: Arafa bin Tantawi, Tafasir Arranged by Order of Revelation and Refutation of Them. Presentation, Study, and Discussion.",
    "book_id": "936",
    "new_page_number": 32
  },
  {
    "serial_number": "1099965",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 126,
    "volume_number": 1,
    "text": "according to the Mushaf arrangement. \"Huwaish\" is the spearhead who started this grave matter, as he is the first to undertake this work in which he opposed what the Imams of Tafsir and masters of composition and interpretation followed among predecessors and successors. Then \"Darwaza\" followed him - as well. Then Sheikh \"Abdul Rahman Habanakah Al-Maydani\" followed them both in this work - too. All of them have thereby breached the consensus of the Nation on following the Mushaf arrangement upon which the work of Imams of Tafsir from predecessors and successors was based. To the extent of the researcher's knowledge and narrow scope, no one ever preceded them in this work from this Nation, except for the call and cry of some Orientalists to re-arrange the Quran chronologically, striving thereby to spread doubts about the Quran and shake confidence in the Book of Allah, especially in the minds of future generations. Among the most prominent of these Orientalists are: 1 - The German Orientalist Gustav Leberecht Flügel: (d. 1278 AH). 2 - The German Jewish Orientalist Gustav Weil: (d. 1306 AH). 3 - The German Orientalist Friedrich Schwally: (d. 1338 AH), a student of Theodor Nöldeke. 4 - The Sheikh of Orientalists, the German Theodor Nöldeke: (d. 1349 AH). He is one of the first Orientalists to raise the issue of re-arranging the Holy Quran \"according to the order of revelation\". He spent a large part of his life relying on the book of Abu Al-Qasim Umar bin Muhammad bin Abdul Kafi, a man of the fifth century. (1) It is said that he regretted at the end of his life the great effort he expended in a science in which definitive results cannot be reached due to the difference and conflict of narrations. 5 - The English Orientalist David Samuel Margoliouth: (d. 1358 AH). 6 - The French Orientalist Régis Blachère: (d. 1393 AH). \"Blachère\" undertook (he claimed) translating the Holy Quran into French in 1371 AH-1950 AD. In truth, translation is completely impossible for many reasons there is no room to mention, and what can be translated is only the meanings of the Quran. \"Blachère\" arranged that alleged translation according to the order of revelation initially. Then, after seven years of reflection, the incorrectness and futility of his first method he used, namely arrangement by order of revelation, became established to him, so he re-arranged this translation according to the Mushaf arrangement. Some contemporaries were influenced by these disbelieving Orientalists as well, such as: 1 - Yousef Rashid (d. ?) who says: \"The arrangement of the Quran in its current situation confuses thoughts and wastes the benefit of the Quran's revelation, because it contradicts the method of gradual legislation observed in revelation. It corrupts the natural sequence system of the idea, because if the reader moves from",
    "foot_note": "1. See: Tarikh al-Quran by Abu Abdullah Al-Zanjani: (p. 71).",
    "book_id": "936",
    "new_page_number": 33
  },
  {
    "serial_number": "1099966",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 127,
    "volume_number": 1,
    "text": "a Makki Surah to a Madani Surah, he collides with a violent shock, and moves without preparation to an atmosphere strange to the atmosphere he was in. He becomes like one moving from a lesson in alphabets to a lesson in rhetoric.\" (1) He also has a treatise titled: \"Arrange the Quran as Allah revealed it.\" Allah raised against it Dr. Muhammad Abdullah Draz - may Allah have mercy on him - who responded to it with a report he submitted to the Al-Azhar administration. (2) 2 - Mirza Baqir Al-Usku'i Al-Ha'iri Al-Rafidi (d. 1301 AH). 3 - Dr. Yousef Siddiq Al-Tunisi (contemporary), born (1362 AH), philosopher and anthropologist. 4 - Aisha bint Abdul Rahman known as \"Bint Al-Shati\" (d. 1419 AH), who has Al-Tafsir Al-Bayani for the Quran, published in two parts in which she addressed the interpretation of some Surahs of the Quran. Finally, were the goals aimed for by the openers of this door achieved? First: Those goals were not achieved as passed with us, and how could they be achieved in a great momentous matter upon which the masses of scholars agreed, predecessors and successors, and they breached this consensus. Second: How could those goals be achieved when they were not accompanied by any convincing justifications, apparent landmarks, irrefutable arguments, bright proofs, or silencing answers? What was achieved of goals is only what the founders and promoters of this idea from the Orientalists first wanted. In fact, one of them retracted this work, namely the French Orientalist Régis Blachère: (d. 1393 AH). We passed earlier the news of his retraction of arranging his Quran translation by order of revelation when he saw his error, so he re-arranged that translation according to the Mushaf order, despite his bad intention and malicious inner self. Would that the three individuals who breached this breach retract their action as that Orientalist retracted the like, and return to what their righteous predecessors agreed upon, for by that they have corrupted the organization of the Quran. It was said regarding the like: \"Whoever advances a Surah or delays it has corrupted the organization of the Quran.\" (3). Since they have passed away and their terms ended, it is the right of the people of authority (*Ahl al-Hall wa al-Aqd*) from concerned entities in the Nation to conclude a wise command in that and work to repair their rift after they have gone to their Lord. It was obligatory upon them to perform what Allah obligated upon them regarding the Book of their Lord. Allah meant them by His saying: {And [mention, O Muhammad], when Allah took a covenant from those who were given the Scripture, [saying], \"You must make it clear to the people and not conceal it.\"} (Al Imran: 187). Ibn Sa'di said in his Tafsir: \"The Covenant (*Mithaq*) is the heavy confirmed pledge. This covenant Allah Almighty took from everyone whom Allah gave the Books and taught knowledge, to clarify to people what they need of what Allah taught him, and not conceal it from them, nor be stingy with it towards them, especially if they ask him, or something occurs necessitating that. Everyone having knowledge must in that case clarify it,",
    "foot_note": "1. Article: \"Technical Criticism of the Project of Arranging the Holy Quran According to its Revelation\", Abdullah Draz, Majallat Al-Azhar, Editor-in-Chief: Muhammad Farid Wajdi Bek, under the administration of Al-Azhar Administration Bureau and Religious Institutes, Cairo, Issue of Ramadan year (1370 AH / 1950 AD, Vol 22). Al-Azhar Press, p. 784.\n2. This response was published in \"Kunuz al-Quran\" magazine in the October 1951 issue. See: Al-Jam' al-Sawti lil-Quran: (p. 359) and footnote (1).\n3. Al-Itqan: Al-Suyuti Vol 1 p 62. Attributed to Ibn Al-Ambari.",
    "book_id": "936",
    "new_page_number": 34
  },
  {
    "serial_number": "1099967",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 128,
    "volume_number": 1,
    "text": "and clarify truth from falsehood.\" (1) It was incumbent upon them to perform their duty towards the Book of their Lord and return those works to what the Nation agreed upon and followed for those long centuries, just as the ambiguous (*Mutashabih*) is returned to the decisive (*Muhkam*). For among the characteristics of the people of truth is returning the ambiguous to the decisive, just as among the characteristics of the people of falsehood is following the ambiguous and rejecting the decisive. Major Calamities We Fear: We fear that a time will come upon the Nation where someone calls for re-arranging the verses of the Quran chronologically just as Orientalists called for arranging Surahs chronologically. They intend by that to attack the Quran so it loses the greatest evidences of its permanence and preservation, its credibility, the realization of its aspects of inimitability, the eloquence of its wording, the precision of its organization, the coherence of its text, and the unity of its objectivity. But as Allah Almighty said: {But Allah refuses except to perfect His light, although the disbelievers dislike it} (At-Tawbah: 32). Allah Almighty took upon Himself the preservation of His Book by His Exalted Self, saying: {Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian} (Al-Hijr: 9). We fear that those whom Allah has blinded their insights from adhering to the truth and holding onto it, from those of our skin who have no share nor luck nor portion of knowledge, piety, or godliness, will follow them in that. Allah Almighty alone is behind the intent, and He is sufficient for us and the best Disposer of affairs. And praise be to Allah, Lord of the Worlds. Statement on the Obligation to Respect the Mushaf Arrangement, Not to Interfere with it, and to Confront Whoever Interferes with it. In summary, the matter has ended that this arrangement must be respected. \"Whether the arrangement of Quranic Surahs was Ijtihadi (from the Companions) or Tawqifi (from Allah), it must be respected especially in writing Mushafs because it is by the consensus of the Companions, and consensus is a proof. And because opposing it leads to Fitnah (sedition), and warding off Fitnah and blocking means to corruption is obligatory.\" (2) After finishing explaining the matter of those three Tafsirs whose authors opposed the masses of predecessors and successors in adhering to the Mushaf arrangement, and deviating from it to the chronological arrangement, we return to the origin of the research here, which is reviewing the opinions and evidences of those saying the arrangement of Surahs is Tawqifi and judging them. Matters have become clear to us, of which we mentioned two, and we move to what remains of those matters as follows: Third: If in the arrangement of Quranic verses there is inimitability, scholars have also extracted pearls from the arrangement of Surahs in the science of correlations (*Munasabat*) between Surahs. It is no less important than the arrangement of its verses. Muhammad bin Sirin (d. 110 AH) said to Ikrimah (d. 107 AH) during the days of the first compilation of the Quran: \"Compose it as it was revealed, the first then the first. Ikrimah said: If mankind and Jinn gathered to compose it in that composition, they would not be able to.\" (3) Fourth: The priority in reciting the Quran is observing the Mushaf arrangement, whether in prayer or",
    "foot_note": "1. Tafsir Ibn Sa'di: (161/1).\n2. Al-Zurqani: Manahil al-Irfan: (1/344).\n3. Al-Suyuti, Al-Itqan: (p. 155).",
    "book_id": "936",
    "new_page_number": 35
  },
  {
    "serial_number": "1099968",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 129,
    "volume_number": 1,
    "text": "outside it, because it is the origin. If one deviates from it sometimes, it is permissible for him, but he left the better, the priority, the nicer, the more perfect, and the more complete. That is because the order of recitation is a recommended matter and not obligatory, evidenced by his action - peace be upon him - in his prayer sometimes. Attached to this is teaching children starting from short Mufassal Surahs due to hardship and difficulty in memorizing long Surahs - initially - and even its impossibility for them. The practice of many earlier people proceeded on that in teaching children. Also attached to them is teaching non-Arabs who do not master Arabic, and likewise one who converted and was recently in disbelief, as well as the elderly and those with speech impediments, and anyone facing hardship and difficulty in memorizing and learning recitation from the beginning of long Surahs. This is because they all share with children the cause and reason equally. The face of permissibility in that is the Prophet's recitation - peace be upon him - sometimes contrary to the Mushaf arrangement, which indicates lack of obligation in recitation from one side, and indicates its permissibility when needed where memorization is difficult like what we mentioned and similar cases - from a second side. And because the recitation of every individual is not established in a private Mushaf of his own; rather, each of them recites and memorizes from one Mushaf in its Mushaf arrangement upon which the Nation agreed, predecessors and successors, and acceptance was passed by consensus, and work upon it continues in the Nation through all its generations. So changing the Mushaf arrangement is safe and secure. And Allah knows best. Evidencing that is what is established in Muslim from the hadith of Hudhayfah bin Al-Yaman, may Allah be pleased with him, who said: I prayed with the Prophet, peace be upon him, one night, so he started Al-Baqarah. I said: He will bow at one hundred. Then he continued. I said: He will pray with it in one rak'ah. So he continued. I said: He will bow with it. Then he started Al-Nisa and recited it, then started Al Imran and recited it. He recited slowly (*Mutarassilan*); if he passed a verse with glorification he glorified, if he passed a request he asked, and if he passed a refuge-seeking he sought refuge, then he bowed... Hadith. (1) Similarly, Al-Nawawi - may Allah have mercy on him - says in Al-Tibyan: \"Scholars, may Allah have mercy on them, said: The choice is to read according to the Mushaf arrangement: recite Al-Fatihah, then Al-Baqarah, then Al Imran, then Al-Nisa until he concludes with (Say, I seek refuge in the Lord of mankind), whether he recites in prayer or outside it. It is also recommended if he recites a Surah to recite after it the Surah that follows it. If he recited in the first rak'ah: (Say, I seek refuge in the Lord of mankind), he recites in the second from Al-Baqarah. The proof for this: The arrangement of the Mushaf is for a wisdom, so it should be maintained except where the Sharia made an exception, like Fajr prayer on Friday, reciting in the first rak'ah: (Alif Lam Mim Tanzil) and in the second: (Has there not come upon man), and the Eid prayers (Qaf) and (The Hour has drawn near). If he opposed the arrangement and recited a Surah then recited the one before it, or opposed consecutiveness and recited before it what does not follow it, it is permissible and he was leaving the better. As for reciting a Surah from its end to its beginning, it is agreed upon as forbidden and blameworthy; for it removes some types of inimitability, and removes the wisdom of arrangement.\" (2)",
    "foot_note": "1. Narrated by Muslim: (17/1176).\n2. See: Al-Tahbir fi Ilm al-Tafsir: by Al-Suyuti: (p. 637).",
    "book_id": "936",
    "new_page_number": 36
  },
  {
    "serial_number": "1099969",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 130,
    "volume_number": 1,
    "text": "And just as he - peace be upon him - used to recite in Jumu'ah sometimes Al-Jumu'ah in the \"First\" and Al-Ghashiyah in the \"Second\". Fifth: Since the Nation has agreed upon the Mushaf arrangement, predecessors and successors, and work has proceeded upon it, no one, whoever he is, has the right to breach the consensus which is a proof in itself, and deviate from it to other types of arrangement, be it chronological, thematic, historical, or otherwise which was not practiced by those who collected the Quran in its three eras, nor practiced by anyone who followed them in goodness. Whether this Mushaf arrangement was Tawqifi or Ijtihadi. This is to safeguard and preserve the Book of Allah Almighty from alteration, change, and distortion, and due to the corruption and calamities resulting from that which have dire consequences, and because it might open the door of daring to tamper with the Book of Allah Almighty which {Falsehood cannot approach from before it or from behind it; [it is] a revelation from a [Lord who is] Wise and Praiseworthy} (Fussilat: 42). Hence, the duty to confront such work and highlight it to the servants now and then was for the victory of the Book of Allah Almighty and refuting the attacks of attackers and doubters in the Book of the Lord of the Worlds from all enemies of the religion and creed, those whose minds do not rest nor settle, and who do not stop attacking the Book of Allah Almighty, working and striving for that day and night across time and place. Returning their arrows to their throats so they turn back to their people losers, retreat defeated, return to their holes humiliated, and turn back small. Yes, they do that out of sincerity to Allah Almighty and His Book, just as the First Siddiq - may Allah be pleased with him - stood on the Day of Apostasy, and just as the Revered Imam Ahmad bin Hanbal Al-Shaybani, Imam of Ahl al-Sunnah - may Allah have mercy on him - stood for the Book of Allah on the Day of the Inquisition. Confronting these people and their likes and tails was among the most obligatory duties upon those concerned with this great affair from those stationed on the frontiers of Islam and its protectors, and those jealous for their religion and the Book of their Lord, and those who love to be included in their Lord's description of them: (and those who followed them in goodness), so His promise is realized for them in His saying Almighty: {And the first forerunners [in the faith] among the Muhajireen and the Ansar and those who followed them with good conduct - Allah is pleased with them and they are pleased with Him, and He has prepared for them gardens beneath which rivers flow, wherein they will abide forever. That is the great attainment.} (At-Tawbah: 100). All that is in striving to realize the promise of their Lord which never fails, delays, alters, or changes ever, about which He, Glory be to Him, said: {Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian} (Al-Hijr: 9). Concluding this section, we cite a nice point from Al-Albani - the Muhaddith of the era - may Allah have mercy on him. This question was directed to him: What is the purpose of collecting the Quran and placing it in the Mushaf, and is the arrangement of Surahs in the Mushaf Tawqifi or Ijtihadi? Among his answer after long speech - may Allah have mercy on him - was the following: \"... I don't know, I don't know. Here the issue is said to be a worship issue (*Ta'abbudi*) because the arrangement of the Quran is not according to history, the history of revelation you refer to. This is an issue scholars differed on: Is it",
    "foot_note": "None",
    "book_id": "936",
    "new_page_number": 37
  },
  {
    "serial_number": "1099970",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 131,
    "volume_number": 1,
    "text": "Tawqifi or Ijtihadi? Unlike when a verse is organized and placed in a Surah, this is Tawqifi with certainty. But the arrangement of Surahs, their advancing and delaying, for example 'Read in the name of your Lord' (Iqra) supposedly according to the question posed earlier should be placed in the first of what was revealed, yet it was placed in the last of what was revealed. They differed on this arrangement of Surahs, not on the arrangement of verses in the Surah. The arrangement of verses in the Surah is Tawqifi without any hesitation. As for the arrangement of Surahs as it is now in the Mushaf, they differed. Some say this is also Tawqifi from the Messenger - peace be upon him - and some say no, this is by Ijtihad from those after him. As for me personally, I do not have a decisive opinion on the subject, but I say if the preponderant view is that it is Tawqifi, then here comes the answer to the previous question: Allah knows best. And if it is by Ijtihad from those who collected the Quran after the Messenger - peace be upon him - and classified it after him in this classification, then I did not know what the wisdom is, and therefore I leave the knowledge to its Knower.\" (1) Let us contemplate how a scholar of the scholars and a master of masters says such speech: (I don't know, I don't know... I did not know what the wisdom is... and therefore I leave the knowledge to its Knower). May Allah have mercy on Al-Albani, that divine scholar. The research and wandering took us long in what passed due to the gravity of the matter. And praise be to Allah, Lord of the Worlds. (2) Chapter Three: Statement of the conditions of Abu Bakr's compilation - may Allah be pleased with him - and the manner in which it was done. It contains seven sections: They are generally as follows: Section One: Introduction to \"Zaid bin Thabit\" who was assigned the compilation. Section Two: The most prominent qualifications calling for the selection of \"Zaid\". Section Three: Reasons for choosing \"Zaid\" for this task in general. Section Four: The motives for this compilation. Section Five: Distinctive features of Abu Bakr's compilation - may Allah be pleased with him. Section Six: Abu Bakr's methodology which he set for \"Zaid\" in collecting and recording the Holy Quran. Section Seven: The fate of Abu Bakr's sheets (*Suhuf*) - may Allah be pleased with him. They are in detail as follows: Section One: Introduction to \"Zaid\" who was assigned the compilation. The one assigned the compilation is: Zaid bin Thabit bin Al-Dahhak Al-Ansari Al-Khazraji, one of the scribes of revelation for the Messenger of Allah - may Allah bless him and grant him peace. He was famous for truthfulness and honesty. He became learned in religion until he became a head in Medina in judiciary, fatwa, reading, and inheritance law during the eras of Umar, Uthman, and Ali, may Allah be pleased with them. He was considered among those firmly grounded in knowledge. He died in 45 AH. When he died, Hassan bin Thabit - may Allah be pleased with him - eulogized him, and Abu Hurairah - may Allah be pleased with him - said: \"Today the ink (scholar) of this nation died, and perhaps Allah will make Ibn Abbas a successor to him.\" (3) He was \"born in Medina, grew up in Mecca, his father was killed when he was six years old, and he emigrated with the Prophet - may Allah bless him and grant him peace - when he was eleven years old. He learned Syriac in seventeen days.\" (4) The Prophet, may Allah bless him and grant him peace, singled him out to learn the language of the Jews, to write for the Prophet - may Allah bless him and grant him peace - to them and read for him what they wrote. (5) Zaid was known and famous for perfection of religion and knowledge along with good conduct and justice. He was one of the six Fatwa-giving Companions, may Allah be pleased with them. He memorized the entire Holy Quran by heart during the life of the Messenger - may Allah bless him and grant him peace - and was one of the most prominent scribes of revelation before the Messenger of Allah - may Allah bless him and grant him peace. He was also known to be among those writing for the Prophet, may Allah bless him and grant him peace, to kings as well, and other great virtues. Imam Al-Bukhari - may Allah have mercy on him - titled a chapter in his Sahih in the Book of Virtues of Companions: Chapter \"Virtues of Zaid bin Thabit may Allah be pleased with him.\" (6)",
    "foot_note": "1. Silsilat al-Huda wa al-Nur: (257). With very slight adaptation because it was recorded, so minor word adjustments were made to straighten the meaning in writing.\n2. See: Arafa bin Tantawi, Tafasir Arranged by Order of Revelation and Refutation of Them. Presentation, Study, and Discussion.\n3. Tadhkirat al-Huffaz: 1/29, Tahdhib al-Tahdhib: 3/399, Ghayat al-Nihayah: 1/296, Al-Isabah: 1/561, Tabaqat Ibn Sa'd: 2/273, Al-A'lam: 3/57.\n4. See: Kitab al-Masahif by Ibn Abi Dawood: 1/156, Ed: Dr. Muhibb al-Din Wa'iz.\n5. Al-Kamil 2: 176 and Al-Tabari 2: 561 and discussion about it will come. Review Al-Sahih min al-Sirah 5 Manuscript, Al-Mustadrak by Al-Hakim 3: 421 and 422, Tahdhib Tarikh Ibn Asakir 5: 446, Thiqat Ibn Hibban 1: 264, Al-Ma'rifah wa Al-Tarikh 1: 484, Kanz al-Ummal 15: 8 and 9, and Al-Muntazam 3: 206.\n6. For more see: Chapter: Virtues of Zaid bin Thabit may Allah be pleased with him, Sahih Al-Bukhari: (3-47) number: (3599).",
    "book_id": "936",
    "new_page_number": 38
  },
  {
    "serial_number": "1099971",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 132,
    "volume_number": 1,
    "text": "Section Two: The most prominent qualifications calling for the selection of \"Zaid\". Zaid - may Allah be pleased with him - was adorned and beautified with self-virtues and high components of faith qualifying him to undertake this great task and bear its responsibility. These include activity, strength, and vitality accompanied by soundness of mind, piety, honesty, and godliness coupled with boldness in truth along with veneration of Allah's rituals. In addition to his bearing of responsibility and knowledge of the magnitude of the task, all this with his mastery and memorization of the Quran coupled with the availability of previous experience in performing the same task, which is writing revelation for the Prophet, may Allah bless him and grant him peace. There is no doubt that those qualities he possessed helped him in precise investigation in collecting the Holy (Book) in the required manner befitting the status of the Book of Allah Almighty, striving to realize the promise of Allah Almighty which never fails, about which He said: {Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian} (Al-Hijr: 9). Let us contemplate what is established in the Jami' Sahih in the famous Hadith narrated by Al-Bukhari with his chain from Zaid bin Thabit - may Allah be pleased with him - who said: Abu Bakr sent for me after the heavy killing of the people of Yamama, and Umar bin Al-Khattab was with him. Abu Bakr - may Allah be pleased with him - said: Umar came to me and said: 'The killing has intensified on the Day of Yamama among the reciters of the Quran, and I fear that killing will intensify among the reciters in the battlefields, so much of the Quran might be lost. I see that you should order the collection of the Quran.' I said to Umar: 'How can you do something that the Messenger of Allah - may Allah bless him and grant him peace - did not do?' Umar said: 'This, by Allah, is good.' Umar kept urging me until Allah opened my chest to that, and I saw regarding that what Umar saw. Zaid said: Abu Bakr said: 'You are a young, intelligent man, we do not accuse you, and you used to write the revelation for the Messenger of Allah - may Allah bless him and grant him peace. So track down the Quran and collect it.' By Allah, if they had charged me with moving a mountain of the mountains, it would not have been heavier upon me than what he ordered me of collecting the Quran. I said: 'How can you do something the Messenger of Allah, may Allah bless him and grant him peace, did not do?' He said: 'It, by Allah, is good.' Abu Bakr kept urging me until Allah opened my chest to that which He opened the chest of Abu Bakr and Umar - may Allah be pleased with them both - for. So I tracked down the Quran, collecting it from palm stalks (*Usub*), thin white stones (*Likhaf*), and the chests of men, until I found the end of Surah At-Tawbah with Abu Khuzaima Al-Ansari, I did not find it with anyone else: {There has certainly come to you a Messenger from among yourselves. Grievous to him is what you suffer} (At-Tawbah: 128) until the conclusion of Bara'ah. So the sheets (*Suhuf*) were with Abu Bakr until Allah took him, then with Umar during his life, then with Hafsa bint Umar - may Allah be pleased with him. (1) Zaid bin Thabit, may Allah be pleased with him, started his arduous task, relying on what was memorized in the chests of reciters and written with the scribes. He observed utmost verification; despite being a memorizer, he was not satisfied with merely finding verses written until he witnessed from whom he received them by hearing. Ibn Shamah said: Their purpose was that nothing be written except the very same that was written in the presence of the Prophet, may Allah bless him and grant him peace, not merely from memory. Therefore he said regarding the end of Surah At-Tawbah (I did not find it with anyone else) meaning I did not find it written with anyone else, because he did not suffice with memorization without",
    "foot_note": "1. Sahih Al-Bukhari, Book of Virtues of the Quran Hadith number 4986.",
    "book_id": "936",
    "new_page_number": 39
  },
  {
    "serial_number": "1099972",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 133,
    "volume_number": 1,
    "text": "writing. (1) Abu Bakr - may Allah be pleased with him - chose him for this great task and grave matter because he discerned in him honesty and soundness of mind, his closeness to the Messenger, may Allah bless him and grant him peace, and his - peace be upon him - reliance on him. Al-Zurqani (d. 1367 AH) - may Allah have mercy on him - says regarding that: \"Talents effective in collecting the Quran gathered in him which did not gather in others, as he was among the memorizers of the Quran, among the scribes of revelation for the Messenger of Allah, may Allah bless him and grant him peace, witnessed the Final Review (2) of the Quran at the conclusion of his life, peace be upon him, and was above that known for the fertility of his mind, extreme piety, great honesty, perfection of character, and rectitude of religion (3). Section Three: Reasons for choosing \"Zaid\" for this task in general. These reasons can be summarized as follows: 1 - He was among the memorizers famous for memorizing and mastering the Quran during the era of the Prophet, may Allah bless him and grant him peace. 2 - Availability of the element of strength, activity, and vitality in him. This is taken from Abu Bakr's saying - may Allah be pleased with him - to him: \"You are a young man\"? A young man has strength and activity others do not. Youth has a feature often hidden, which is that they knew what was abrogated from what remained in recitation, unlike many elders whose Islam preceded, and from whom some abrogations might be hidden, unlike the youth, and Allah knows best. 3 - Being characterized by intelligence, acumen, soundness of mind, and quick wit, which are qualifications aiding good conduct especially when matters intertwine and resemble each other. Undoubtedly, that is more conducive to the perfection, completion, and excellence of work. This is taken from Abu Bakr's description - may Allah be pleased with him - of him as: \"intelligent (*Aqil*)\". Evidencing that also is his proceeding from the opinion of Abu Bakr and Umar - may Allah be pleased with them both - and returning to it after knowing it is the truth. This is clear from his saying: \"Abu Bakr kept urging me until Allah opened my chest to that which He opened the chest of Abu Bakr and Umar - may Allah be pleased with them both - for.\" His hesitation - may Allah be pleased with him - and stopping at first was only out of soundness of mind and application of thought. 4 - The reassurance and recommendation Abu Bakr - may Allah be pleased with him - had for him regarding his freedom from detracting impediments like breaches of chivalry (*Muru'ah*) and shameful traits, so the soul does not fear him nor doubt nor suspect him. Thus, not the slightest accusation detracting from his religion attaches to him preventing the acceptance of his work and performance of his grave task. This is deduced from his saying to him: \"We do not accuse you.\" 5 - Existence of previous experience in him in the same task he would perform, namely writing revelation for the Prophet - may Allah bless him and grant him peace, along with what was - said - and rumored of his witnessing the Final Review, which is similar to what is called \"Experience Certificate\" in our current era.",
    "foot_note": "1. Mabahith fi Ulum al-Quran 127. Mabahith fi Ulum al-Quran Author: Manna' bin Khalil Al-Qattan (Died: 1420 AH) Publisher: Maktabat Al-Ma'arif for Publishing and Distribution Edition: Third Edition 1421 AH- 2000 AD Number of Parts: 1\n2. It was previously clarified that Zaid witnessing the Final Review is not established by sound authentic evidences, and some rely on fame and widespread reporting, which suffice for some in such issues.\n3. Manahil al-Irfan: 1/250, and review Al-Fath: 9/13, and Al-Muqni': 124.",
    "book_id": "936",
    "new_page_number": 40
  },
  {
    "serial_number": "1099973",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 134,
    "volume_number": 1,
    "text": "This is because Zaid - may Allah be pleased with him - it is said - witnessed the Final Review before the Prophet, may Allah bless him and grant him peace, in which he clarified to them what was abrogated of the Quran and what remained established. He - peace be upon him - ordered keeping the abrogating and leaving the abrogated. He - peace be upon him - recited the Quran in the state it settled upon to Zaid, so he - may Allah be pleased with him - used to lead people with it until his death, peace be upon him. Undoubtedly, that is a feature Zaid was distinguished with, not gathered for anyone of the Companions - may Allah be pleased with them - except Ibn Masud, may Allah be pleased with him. Al-Baghawi (d. 516 AH) narrated from Abu Abdul Rahman Abdullah bin Habib Al-Sulami (d. 74 AH) that he said: Zaid bin Thabit recited to the Messenger of Allah - may Allah bless him and grant him peace - twice in the year Allah took his soul... until he said about Zaid bin Thabit that he: \"Witnessed the Final Review, and used to teach people with it until he died. Therefore, Abu Bakr and Umar relied on him in its collection, and Uthman appointed him to write the Mushafs - may Allah be pleased with them all -.\" (1). \"This recitation was named the recitation of Zaid bin Thabit because he wrote it for the Messenger of Allah - may Allah bless him and grant him peace - read it to him, and witnessed the Final Review.\" (2) 6 - His adornment with piety and veneration of Allah's rituals. This is also taken from his saying - may Allah be pleased with him - to Abu Bakr and Umar - may Allah be pleased with them both: How can you do something the Messenger of Allah - may Allah bless him and grant him peace - did not do?! Ibn Battal - may Allah have mercy on him - said: \"Abu Bakr shied away first, then Zaid bin Thabit second, because they did not find the Messenger of Allah - may Allah bless him and grant him peace - doing it, so they disliked placing themselves in the position of one increasing precaution for religion over the precaution of the Messenger - peace be upon him.\" (3). Undoubtedly, that is evidence of fearing Allah - Almighty - and venerating His rituals. 7 - His boldness in truth. This is clear from his saying to Abu Bakr and Umar - may Allah be pleased with them both: How can you do something the Messenger of Allah - may Allah bless him and grant him peace - did not do?! Saying that to the two biggest heads in the Nation did not prevent him when he thought they were incorrect. This is among the clearest qualifications enabling him to perform this grave task without flattery or favoritism to anyone ever. 8 - His eagerness to follow and fear of innovation, and eagerness to adhere to Allah's limits. This is taken from his refusal to undertake the task at first and his hesitation in accepting it, until Allah opened his chest as He opened the chest of Abu Bakr and Umar - may Allah be pleased with them all. 9 - His bearing of responsibility and knowledge of the magnitude of the task and its great status and majestic worth. This is clear from his saying - may Allah be pleased with him: \"By Allah, if they had charged me with moving a mountain of the mountains, it would not have been heavier upon me than what he ordered me of.\" Section Four: The Motives for this Compilation. First: Statement of those motives briefly. The reason for collecting the Holy Quran in the time of Abu Bakr Al-Siddiq - may Allah be pleased with him - was the Companions' fear - may Allah be pleased with them - of losing part of it, especially after the martyrdom of many Quran memorizers. So it was better to collect it in one place; for the safety and preservation involved; fearing what might",
    "foot_note": "1. Sharh al-Sunnah: Al-Baghawi Vol 4 p: 525-526, Al-Burhan by Al-Zarkashi, Vol 1 p: 237, and Al-Itqan by Al-Suyuti Vol 1, p 59. It was previously clarified that Zaid witnessing the Final Review is not established by sound authentic evidences..., therefore it is mentioned in the passive voice format, as Al-Baghawi mentioned. The Researcher.\n2. Al-Murshid Al-Wajiz p 96. Al-Murshid Al-Wajiz ila Ulum Tata'allaq bi al-Kitab al-Aziz Author: Abu al-Qasim Shihab al-Din Abdul Rahman bin Ismail bin Ibrahim Al-Maqdisi Al-Dimashqi known as Abu Shamah (Died: 665 AH) Editor: Tayyar Altikulac, Publisher: Dar Sadir - Beirut Year of Publication: 1395 AH - 1975 AD Number of Parts: 1\n3. Fath al-Bari: (9/11).",
    "book_id": "936",
    "new_page_number": 41
  },
  {
    "serial_number": "1099974",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 135,
    "volume_number": 1,
    "text": "happen in the future. (1) The Battle of Yamama, the events of which took place in the twelfth year of Hijra, saw the martyrdom of nearly seventy Companions from the senior reciters and memorizers of the Holy Quran. (2) The Messenger of Allah, may Allah bless him and grant him peace, died and the Holy Quran was not collected in his era in volumes (*Masahif*), but was preserved in the chests of the noble Companions and some of its Surahs written on tablets and some sheets. When allegiance was pledged to Abu Bakr Al-Siddiq for the Caliphate, it became necessary to collect the entire Holy Quran in sheets (*Suhuf*) for several reasons, first being the death of the Messenger of Allah, may Allah bless him and grant him peace, and the end of revelation, and also due to the death of many Companions in the Wars of Apostasy, among whom were many memorizers of the Book of Allah. Umar bin Al-Khattab - may Allah be pleased with him - noticed that, so he suggested to Caliph Abu Bakr Al-Siddiq the matter of collecting the Holy Quran quickly, and recording it in sheets so the verses of the Wise Reminder would not be lost by the death of memorizers. Abu Bakr Al-Siddiq responded to that after hesitating at the beginning, because it was an unprecedented matter that did not happen in the era of the Messenger of Allah, may Allah bless him and grant him peace. (3) - meaning collecting it between two covers in one volume. \"The sheets in the hands of the noble Companions were numerous, and each of them was proud that he wrote it in the presence of the Messenger of Allah, may Allah bless him and grant him peace. Among them were those who accepted Islam at the beginning of the Meccan period. It is inconceivable that they wrote all of them in the era of Abu Bakr. With this, the heart is reassured that the entire Holy Quran was written in the era of the Noble Prophet, even if it was not collected in one place.\" (4) The Holy Quran remained in this state, scattered and not collected in one volume, until the caliphate of Abu Bakr. He faced grave events, the Wars of Apostasy arose, and killing intensified among the reciters in the Battle of Yamama - in the year twelve AH - in which seventy reciters from the memorizers of the Quran were martyred. This alarmed Umar bin Al-Khattab, and he feared that part of the Quran would be lost with the death of its memorizers. So he entered upon Abu Bakr and advised him to collect the Quran and write it fearing loss. Abu Bakr shied away from his speech, and it was hard for him to do what the Prophet, may Allah bless him and grant him peace, did not do. Umar kept soliciting him until Abu Bakr was reassured of this matter. Then Abu Bakr assigned Zaid bin Thabit to track down the revelation and collect it. Zaid collected it from patches, palm stalks, thin stones, and the chests of men. Zaid bin Thabit was keen on verification of what he collected, and did not suffice with memorization without writing. He was keen on matching between what was memorized and written, and that the verse be from both sources together. That was the first collection of the Quran between two covers in one volume. Abu Bakr kept the collected Mushaf until his death, then it came to be with Hafsa bint Umar. (5) Second: Statement of the main motive for Al-Siddiq's collection. Abu Bakr Al-Siddiq's collection of the Quran was due to his fear that part of the Quran would go with the passing of its carriers; because it was not collected in one place. So he collected it in sheets",
    "foot_note": "1. Ali bin Suleiman Al-Obeid, Jam' al-Quran al-Karim Hifzan wa Kitabatan, Madinah: King Fahd Complex, (p. 34-35) with adaptation.\n2. Manahil al-Irfan, by Al-Zurqani: (1/249) with adaptation.\n3. Jam' al-Quran fi Ahd Abi Bakr, Hanin Shawdab, Website: Mawdoo3, Dated: 19/5/2019 AD. With adaptation.\n4. Al-Isabah, Ibn Hajar 2/444 (2546).\n5. See: Jam' al-Quran, Free Encyclopedia (Wikipedia).",
    "book_id": "936",
    "new_page_number": 42
  },
  {
    "serial_number": "1099975",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 136,
    "volume_number": 1,
    "text": "arranging the verses of its Surahs according to what the Prophet, may Allah bless him and grant him peace, instructed them. (1) Third: The most prominent reasons and motives for this collection are summarized as follows: 1 - The cessation of revelation with the death of the Messenger of Allah, may Allah bless him and grant him peace; it became incumbent upon Muslims to preserve the Book of their Lord from loss. 2 - The killing of seventy reciters on the Day of Yamama is considered one of the main reasons and motives for writing the Quran and collecting it in the era of Al-Siddiq, may Allah be pleased with him, as the fear was of losing part of the Quran and its disappearance with the disappearance and death of its carriers and memorizers in the Wars of Apostasy. 3 - Also, the fear of recurrence of heavy killing among Quran memorizers in future battles and Jihad against polytheists was among the reasons calling for collecting it in one place as well. It was feared that some written Quran might be with a Companion and be lost with the death of its holder. Therefore, when killing intensified among reciters on the Day of Yamama and the Companions - may Allah be pleased with them - feared the loss of the Quran with the loss of its carriers killed in the war of apostates, and fearing the continuation of that killing in future battles as well; they agreed to collect the Quran in one place under the leadership of Abu Bakr - may Allah be pleased with them all. The matter of this collection relied on the memorized in chests and written in lines. Therefore, Al-Siddiq cared for those sheets with extreme care, so they remained with him until his death, then with Umar until his death, then remained with Hafsa until Uthman - may Allah be pleased with him - requested them in gathering the Nation on \"The Imam\" (Mushaf). \"The purpose of this collection was to record the entire Quran collected in one volume so nothing of it would be lost, without compelling people to it due to the lack of appearance of difference in its recitation.\" (2) Section Five: Distinctive features of Abu Bakr's compilation - may Allah be pleased with him. regarding the features of this compilation, Al-Zurqani (d. 1367 AH) - may Allah have mercy on him - summarizes them in his Manahil as follows: Advantages of Quran Compilation in the Era of Abu Bakr. The compilation of the Quran in the era of Abu Bakr - may Allah be pleased with him - had a great status among Muslims. No disagreement occurred regarding anything in it. It was distinguished by several advantages, including: First: It collected the Quran according to the most precise aspects of research and investigation, and safest principles of scientific verification. Second: Obtaining the consensus of the Nation on accepting it, and the satisfaction of all Muslims with it. Third: What was collected in this compilation reached the level of Tawatur (mass transmission), as it was attended and witnessed by more than the number of Tawatur of the Companions. Fourth: It was restricted in collecting the Quran to what its Quranic nature was established from the Seven Modes (*Ahruf*), by the proof of its presentation in the Final Review, so it was inclusive of what remained of the Seven Modes (3), and there was",
    "foot_note": "1. Al-Masahif by Ibn Abi Dawood: (11/16).\n2. Usul fi al-Tafsir, by Muhammad bin Salih al-Uthaymeen: (p. 3).\n3. The establishment of the Seven Modes in this compilation is a matter of disagreement among investigators, and likewise in Uthman's Mushaf. It requires careful study, verification, scrutiny, long contemplation, and deep looking into what the script of this Mushaf was, and whether it was drawn bearing those Seven Modes like the Uthmani Mushafs which were copied from the Imam Mushaf and sent by Uthman to the regions, sending with every Mushaf a reciter teaching according to what its script carries mostly. Some see that the widespread saying that Abu Bakr's Mushaf, may Allah be pleased with him, included the Seven Modes and scholars' acceptance of it is not sufficient for decisiveness and certainty but suffices for preponderant opinion (*Zann Rajih*), and preponderant opinion is sufficient in these issues and matters - according to some people of knowledge. And Allah knows best. The Researcher.",
    "book_id": "936",
    "new_page_number": 43
  },
  {
    "serial_number": "1099976",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 137,
    "volume_number": 1,
    "text": "nothing in it of what its recitation was abrogated. Fifth: It was arranged by verses, not by Surahs. From here it is confirmed to us: That this collection was arranged by verses in their places in the Surahs, and only one copy of the Quran was written from it. This collection enjoyed the consensus of the Companions and then the entire Nation, just as they agreed on the Tawatur of what is in it. The fact that the end of Surah Bara'ah was not found except with Abu Khuzaima does not impugn that Tawatur; for the meaning is that it was not found *written* except with him. That does not contradict that it was found memorized with a multitude of Companions reaching the level of Tawatur. The reliance at that time was on memorization and retention; writing was relied upon as one of the sources only for extra precaution and exaggeration in precision and caution. (1) Concluding this important section, it is good to alert here and emphasize the summary of the following: First: The contemplator of Al-Siddiq's compilation - may Allah be pleased with him - knows for certain that the primary motive for it was the heavy killing among the reciters on the Day of Yamama; a large number of them were killed reaching seventy, and some put it at five hundred. The highest goal of it was collecting the Quran in one place fearing its loss with the loss of its memorizers. Second: The work of Al-Siddiq - may Allah be pleased with him - was collecting the revealed Quran whose recitation is established into one volume (*Mushaf*) after it was scattered in patches, thin stones, saddles, and palm stalks. It is the Quran collected and written by the scribes of revelation and recorded in the presence of the Messenger of Allah, peace be upon him. So Abu Bakr's work - may Allah be pleased with him - was merely collecting what was scattered of the Quran into one volume. That is because the Quran collected in the era of the Prophet, peace be upon him, was not collected in one volume but was scattered. So Al-Siddiq's collection is the same as the Prophetic collection, except that the Prophetic collection was scattered, and Al-Siddiq's collection became a collection of the Quran between the covers of one volume. Third: Al-Siddiq - may Allah be pleased with him - adhered in his collection to the arrangement of Surahs and verses of the Quran according to what the Final Review settled upon. This arrangement conforms to the Quran established in the Preserved Tablet because it is Tawqifi (divinely ordained) according to the preponderant view. Therefore, Al-Siddiq's collection remains on the origin upon which the Quran was in the first Prophetic collection, arranged by Surahs and verses. This matter cannot be deviated from except by clear text; because Al-Siddiq's task was confined to collecting the Quran which was collected in the first era scattered, collecting it in one volume, following and imitating in it what the matter of the first collection completed by the Prophet - peace be upon him - ended upon. He - peace be upon him - did not join the Supreme Companion until the places of Surahs and verses were clear and settled in their Mushaf arrangement according to what the Final Review settled upon. As for the saying that he restricted his collection to establishing, recording, and writing what its recitation and Quranic nature was established in the Final Review from what its recitation was not abrogated only, and neglecting the abrogated, this statement although",
    "foot_note": "1. Manahil al-Irfan by Al-Zurqani: (1/253). With adaptation.",
    "book_id": "936",
    "new_page_number": 44
  },
  {
    "serial_number": "1099977",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 138,
    "volume_number": 1,
    "text": "it is the closest of opinions to correctness, requires more verification, authentication, induction of evidences, and confirmation, even if the soul leans towards it. One must pay attention to what will come in point \"Fourth\". The result of that collection was that one copy of the Quran was collected between the two boards in one place, not multiple copies for each Mode (*Harf*) a copy, and it remained in one volume with the Caliph of the Muslims during his life. Fourth: The collection of Al-Siddiq - may Allah be pleased with him - did not imply a type of compulsion for Muslims and forcing them to this collection and adhering to it. Therefore, some Companions who did not witness the Final Review did not know about the abrogation of some verses, so they used to read some abrogated parts of the Quran which they heard from the Messenger of Allah, peace be upon him, without knowing of the later abrogation settled in the Final Review. Fifth: It is difficult to be certain and decisive that Al-Siddiq's collection - may Allah be pleased with him - included the Seven Modes. What inevitably indicates this is that there are words where writing alone is not sufficient; there must be a combination of writing and the correct method of pronouncing them, and there is no way for that at all except by sound. Let us take for example the word \"Al-Sirat\" which is written in all Mushafs with 'Sad' (الصراط), and has been read with 'Zay' as Ishmam (mixing the sound of Sad with Zay), meaning smelling the Sad with Zay; Khalaf narrated this from Hamzah. The reliance in it is on sound in pronunciation not on the drawn script. Say likewise regarding Imala, Taqil, Idgham and similar things which cannot be controlled except by transmission and vocal control. There is no doubt that these matters were not reported or preserved to be contained in Al-Siddiq's collection. Whoever claims otherwise, let him bring a bright proof and decisive evidence. The most that can be said in that is that Al-Siddiq's collection - may Allah be pleased with him - did not neglect modes of reading according to the script (Rasm), because his collection was not via what was written in lines only, but relied also on its conformity to what is memorized in chests. That is because the principle in reading the Quran is its transmission and reception by oral transmission. It is not understood from this that his collection bore only one aspect of script (Rasm) and thus neglected applying other modes of reading that the script bears; for such is not transmitted except via reception and oral transmission, not via written script. This is because taking reading by reception and oral transmission judges the script. Therefore, the Companions when writing the sheets did not consider the difference of script but considered reading first and made it judge and ruler over the script, considering that it is the origin and the script follows it. The saying that the Seven Modes are established in the Bakri Sheets is a saying lacking clear decisive proof and authentic established evidence to rely upon. Because such a claim can never be accepted except with authentic established transmission suitable for argumentation. As this saying necessitates that the Bakri Sheets were written combining the Seven Modes in script in one Mushaf, which is an impossible matter,",
    "foot_note": "None",
    "book_id": "936",
    "new_page_number": 45
  },
  {
    "serial_number": "1099978",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 139,
    "volume_number": 1,
    "text": "since establishing them in the Bakri Sheets would require repeating the writing of words containing differences in modes of reading, similar to the writing of the Uthmani Mushafs which Uthman - may Allah be pleased with him - sent to the regions. This entails asserting that Al-Siddiq's collection - may Allah be pleased with him - did not contain the Seven Modes. Within the limits of his research, the researcher does not know of anyone from the predecessors (Salaf) who said contrary to this saying. And Allah knows best. (1) Ibn Abi Dawood - may Allah have mercy on him (d. 316 AH) said in \"Kitab al-Masahif\": \"This collection won the agreement of the Companions - may Allah be pleased with them - on its correctness and precision. They agreed on its safety from addition or subtraction and received it with the acceptance and care it deserves, until Ali bin Abi Talib - may Allah be pleased with him - said: 'The person with the greatest reward regarding the Mushafs is Abu Bakr; for he was the first to collect what is between the two boards.'\" (2) Al-Hafiz Ibn Hajar - may Allah have mercy on him - said: If the fair person contemplates what Abu Bakr did of that, he would assert that it counts among his virtues, and praises his great merit; due to the confirmation of his saying peace be upon him: 'Whoever introduces a good practice, he has its reward and the reward of those who act upon it.' (3) Then he said: No one collected the Quran after him but that he (Abu Bakr) has the like of his reward until the Day of Resurrection. (4) Abu Bakr's collection is the one from which the Imam Mushaf was copied, and nothing changed from it. Section Six: Abu Bakr's methodology which he set for \"Zaid bin Thabit\" in collecting and recording the Holy Quran. Al-Siddiq - may Allah be pleased with him - followed a tight approach and a perfected method that reached a great level of precision, tightness, and mastery in collecting the Holy Quran. Then he ordered Zaid - may Allah be pleased with him - to collect the Quran according to the plan and method he set for him, which contained precaution and placing guarantees and safety to protect the Book of Allah, and adhering to caution, precision, deliberation, and verification. He - may Allah be pleased with him - was not satisfied with what was memorized in his chest nor with what he wrote with his hand nor with what he heard with his ear. Rather, he began tracking and investigating all causes of verification, precision, mastery, and precaution, taking upon himself reliance on two main sources: First Source: What is written in lines, which is what was written in the presence of the Messenger of Allah, peace be upon him. - Second Source: What is memorized in chests, which is what was preserved in the chests of the Companions, may Allah be pleased with them. He would not accept anything written until two just witnesses testified for it that it was written in the presence of the Messenger of Allah - may Allah bless him and grant him peace. This was for precaution and caution and to ensure it was indeed written in the presence of the Messenger of Allah - may Allah bless him and grant him peace. Ibn Shabba narrated from Yahya bin Abdul Rahman bin Hatib (d. 104 AH) who said: Umar - may Allah be pleased with him - wanted to collect the Quran, so he stood among the people and said: Whoever received anything of the Quran from the Messenger of Allah - may Allah bless him and grant him peace - let him bring it to us. They had written that on sheets, tablets, and palm stalks. He would not accept anything from anyone until two witnesses testified. (5) Meaning of the Two Witnesses: Al-Hafiz Ibn Hajar (d. 852 AH) - may Allah have mercy on him - said: The meaning of two witnesses is:",
    "foot_note": "1. See: Arafa bin Tantawi, Al-Shaf'ah bayna Al-Jam' Al-Uthmani wa Al-Ahruf Al-Sab'ah: (p. 678). With slight adaptation.\n2. Al-Masahif: by Ibn Abi Dawood Al-Sijistani: (p. 11).\n3. Narrated by Muslim from Jarir bin Abdullah: Chapter of Knowledge, Chapter of Whoever introduces a good practice. Sahih Muslim with Nawawi's explanation (16/225-226).\n4. Fath al-Bari Sharh Sahih al-Bukhari (8/628). - Narrated by Muslim from Jarir bin Abdullah: Chapter of Knowledge, Chapter of Whoever introduces a good practice. Sahih Muslim with Nawawi's explanation (16/225-226). - Fath al-Bari Sharh Sahih al-Bukhari (8/628).\n5. Tarikh al-Madinah by Ibn Shabba p. 705.",
    "book_id": "936",
    "new_page_number": 46
  },
  {
    "serial_number": "1099979",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 140,
    "volume_number": 1,
    "text": "Memorization and Writing. Al-Sakhawi (d. 902 AH) - may Allah have mercy on him - clarifies the meaning of two witnesses saying: It means two just men testifying that that written material was written in the presence of the Messenger of Allah - may Allah bless him and grant him peace. Zaid did not rely on memorization alone; therefore he said in the Hadith narrated by Al-Bukhari: He did not find the end of Surah Bara'ah except with Abu Khuzaima; meaning: he did not find it written except with Abu Khuzaima Al-Ansari, even though Zaid memorized it, and many Companions memorized it. But he wanted to combine memorization and writing, for extra authentication and exaggeration in precaution. Upon this rational methodology, it was completed under the supervision of Abu Bakr and Umar and senior Companions and the consensus of the Nation on it without denial. That was an eternal virtue history still mentions with gratitude for Abu Bakr in supervision, for Umar in suggestion, for Zaid in execution, and for the Companions in assistance and approval.\" (1) What Al-Sakhawi - may Allah have mercy on him - concluded his speech with above should be written with eye-water (gold). We conclude this section by summarizing how Zaid executed the task of collecting the Quran in the following points: First: Al-Farooq (Umar) announced to people to bring what they had of the Quran written. Second: Zaid and Al-Farooq sat at the door of the mosque receiving what the Companions brought of the Quran. This is narrated with a disconnected chain as Al-Hafiz indicated in Al-Fath. It is narrated that Abu Bakr said to Zaid and Umar bin Al-Khattab: Sit at the door of the mosque, and whoever comes to you with two witnesses for something of the Book of Allah, write it. (2) Third: Everyone who brought something of the Quran was asked to bring two witnesses that this was written in the presence of the Prophet, may Allah bless him and grant him peace. (3) Fourth: Zaid performed the writing of the Quran by matching what was written of the Quran in the time of the Prophet, may Allah bless him and grant him peace, with what the Companions preserved in their chests of the Quran. Zaid said: So I tracked down the Quran collecting it from palm stalks, thin stones, and the chests of men, until I found the end of Surah At-Tawbah with Abu Khuzaima Al-Ansari, I did not find it with anyone else. (4) Meaning he did not find it written except with Abu Khuzaima, otherwise Zaid and other Companions memorized these verses, but he wanted the verses to be memorized AND written, for increased authentication and precaution. Al-Hafiz Ibn Hajar said: The benefit of tracking down was exaggeration in seeking verification and standing upon the exact thing written in the presence of the Prophet, may Allah bless him and grant him peace. (5) Fifth: The beginning of the task of collecting the Quran was after the Battle of Yamama at the end of year 11 AH, and it ended before the death of Abu Bakr in the middle of year 13 AH. Sixth: After writing the Quran and collecting it, it was handed to Abu Bakr Al-Siddiq and remained with him until his death, then remained with Umar until he was martyred at the hands of Abu Lu'lu'ah the Magian, so it remained with Mother of Believers Hafsa bint Umar, may Allah be pleased with them both. Then Uthman requested it to copy copies for the regions from it and returned it to Hafsa.",
    "foot_note": "1. Manahil al-Irfan by Al-Zurqani: (1/253:252). Attributed to Al-Sakhawi.\n2. Al-Masahif by Ibn Abi Dawood p. 12, and Jamal al-Qurra' by Al-Sakhawi 1/86, Ibn Hajar said: Its men are trustworthy despite its disconnection. Al-Fath 9/14., Its chain is disconnected because Urwah did not meet Abu Bakr.\n3. Mabahith fi Ulum al-Quran, by Manna' Al-Qattan: (p. 132).\n4. Sahih Al-Bukhari (4986).\n5. Al-Fath 9/15.",
    "book_id": "936",
    "new_page_number": 47
  },
  {
    "serial_number": "1099980",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 141,
    "volume_number": 1,
    "text": "When Hafsa died in year 41 AH, the Governor of Medina Marwan bin Al-Hakam requested these sheets from Abdullah bin Umar and destroyed them, so that the word of Muslims would unite on the Mushafs copied from Al-Siddiq's Mushaf and distributed in the lands by order of Uthman, may Allah be pleased with him. Thus, the Holy Quran became written, arranged, and collected in one place, according to the highest standards of control and documentation, and through a collective, scientific, and transparent work. All Companions, may Allah be pleased with them, agreed on its precision, correctness, and safety from addition or subtraction, by the grace of Allah and His success granted to the Companions of the Messenger of Allah, may Allah bless him and grant him peace, just one year after the death of the Prophet, peace be upon him. (1) In conclusion, it has become clear to us that this compilation was distinguished by: 1 - Extreme precision and mastery. 2 - Neglecting abrogated verses, and including what was established in the Final Review only. 3 - Winning the consensus of the Nation upon it, and the Tawatur of what is in it. 4 - There was only one copy of it kept with the Imam of Muslims Abu Bakr, may Allah be pleased with him, by agreement of scholars. (2) Section Seven: The fate of Abu Bakr's sheets - may Allah be pleased with him. Al-Sakhawi clarifies the fate of Abu Bakr's sheets - may Allah be pleased with him - saying: Those sheets collected by Zaid bin Thabit were met with the superior care they deserved; Abu Bakr kept them with him, then Umar kept them after him, then Mother of Believers Hafsa bint Umar kept them after Umar's death, until the Caliph of Muslims Uthman bin Affan - may Allah be pleased with them all - requested them from her, relying on them to copy the Quranic Mushafs, then returned them. (3) Abu Shamah Al-Maqdisi (d. 665 AH) - may Allah have mercy on him - confirms the fate of those sheets saying: After Zaid - may Allah be pleased with him - completed the Mushaf, he handed it to Abu Bakr Al-Siddiq - may Allah be pleased with him - who kept it with him until his death. Then it transferred to the Commander of the Faithful after him, Umar bin Al-Khattab - may Allah be pleased with him. After his death, the Mushaf transferred to Hafsa, Mother of Believers - may Allah be pleased with her - because Umar - may Allah be pleased with him - made the matter of Caliphate after him a consultation (*Shura*). So it remained with Hafsa until Uthman - may Allah be pleased with him - requested it from her to copy it later, then returned it to her. When Hafsa - may Allah be pleased with her - died, Marwan bin Al-Hakam sent to her brother Abdullah bin Umar - may Allah be pleased with them both - immediately upon their return from Hafsa's funeral with a firm resolve that he send it. So Ibn Umar sent it to Marwan who tore it up, fearing that there might be something in it contrary to what Uthman - may Allah be pleased with him - copied. (4) Umar bin Shabba narrated this report in \"Tarikh al-Madinah\" via Hafs bin Umar Al-Duri, saying: Ismail bin Ja'far told us, from Umarah bin Ghaziyah, from Ibn Shihab, from Kharijah bin Zaid bin Thabit - may Allah be pleased with him - who said: When Hafsa died, Marwan sent to Abdullah bin Umar - may Allah be pleased with them both - with a firm resolve, so he gave it to him, and he washed it out thoroughly. (5) Thus the Quran was collected in the era of Abu",
    "foot_note": "1. Qissat Jam' al-Quran al-Karim, Osama Shahada, Salaf website, Dated: 30/12/1439 AH. With adaptation in ordering by \"Numbering\".\n2. Al-Burhan by Al-Zarkashi 1/297, and Dirasat fi Ulum al-Quran by Fahd Al-Rumi p. 82. With slight adaptation and arrangement.\n3. Same previous reference.\n4. Al-Murshid Al-Wajiz: Abu Shamah Al-Maqdisi, p 52.\n5. Jam' al-Quran: (78-79).",
    "book_id": "936",
    "new_page_number": 48
  },
  {
    "serial_number": "1099981",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 142,
    "volume_number": 1,
    "text": "Bakr - may Allah be pleased with him - the Second Compilation - on consistent pieces equal in size, arranged by verses and Surahs, in a documental manner for which human history has known no equal in terms of control and mastery. Ali bin Abi Talib - may Allah be pleased with him - says: The person with the greatest reward regarding the Mushaf is Abu Bakr; may Allah have mercy on Abu Bakr, he was the first to collect the Book of Allah. (1) Chapter Four: The date and time of this compilation and its most prominent results. It contains two sections: Section One: The most prominent results of Abu Bakr's compilation - may Allah be pleased with him. Undoubtedly, the motive for this compilation was fear of the loss of its carriers following the killing of seventy reciters on the Day of Yamama. Its collection began after that battle, meaning approximately at the end of the eleventh year of Hijra, and the task of collection ended before the death of Abu Bakr - may Allah be pleased with him - in the middle of the thirteenth year of Hijra. The period of his caliphate - may Allah be pleased with him - was from: the twelfth of Rabi' al-Awwal year 11 AH to the twenty-second of Jumada al-Akhirah year 13 AH. It is said the compilation period took fifteen months, and other things are said. In reality, this is approximate speech and cannot be asserted with certainty due to lack of finding anything fixed and documented confirming that duration precisely. And Allah knows best. In concluding the discussion on this compilation, we discuss two important issues: First: This compilation was completed by consensus of the noble Companions - may Allah be pleased with them all. Second: With its collection, a kind of reassurance was achieved against the fear of its loss or escaping of anything from its complete documentation. Third: This compilation was done according to the most reliable methods of collection and precaution for the Book of Allah Almighty. It was collected by two methods of preservation - chest (memory) and line (writing) - then everything collected was recorded in one place based on that. Nothing was accepted for recording in it except what the Companions - may Allah be pleased with them - agreed was Quran and its narration was Mutawatir as well. Fourth: This compilation became the single trusted and recorded copy upon which all Companions - may Allah be pleased with them all - agreed regarding its correctness and the safety of everything in it from addition and subtraction. Fifth: By the consensus of the Companions - may Allah be pleased with them - and their agreement on this compilation, every suspicion was removed, especially suspicions of innovation and introducing into religion. Finally: It has become clear to us in the folds of the research: \"That Abu Bakr Al-Siddiq's collection of the Quran was due to his fear that part of the Quran would go with the passing of its carriers; because it was not collected in one place. So he collected it in sheets arranged by verses of its Surahs according to what the Prophet, may Allah bless him and grant him peace, instructed them.\" (2) With this, the difference between the compilation in its two eras: First and Second, becomes clear.",
    "foot_note": "1. See: Mabahith fi Ulum al-Quran by Manna' Al-Qattan, p 132.\n2. Al-Masahif by Ibn Abi Dawood p 11: p 16.",
    "book_id": "936",
    "new_page_number": 49
  },
  {
    "serial_number": "1099982",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 143,
    "volume_number": 1,
    "text": "Section Two: The first to name the Quran \"Al-Mushaf\". Al-Zarkashi - may Allah have mercy on him - said in Al-Burhan: \"Al-Muzaffari (d. 642 AH) mentioned in his history: When Abu Bakr collected the Quran, he said: Name it. Some said: Name it Gospel (*Injil*). They disliked it. Some said: Name it Scroll (*Sifr*). They disliked it from the Jews. Ibn Masud said: I saw a book belonging to the Abyssinians which they call the Mushaf, so name it that.\" (1) In truth, a narration like this is not relied upon because it has no chain to rely on, and it was narrated as Mursal (disconnected) without attribution or chain. It contradicts what is established from the hadith of Anas - may Allah be pleased with him - in Al-Bukhari where he mentioned the sheets (*Suhuf*) in his saying: So Uthman sent to Hafsa: Send us the sheets (*Suhuf*) so we may copy them into the volumes (*Masahif*)... until he said: So they did so until when they had copied the sheets into the volumes, Uthman returned the sheets to Hafsa, and sent to every region a volume from what they had copied, and ordered that everything else of the Quran in every sheet or volume be burned. (2). There are other traditions like what Al-Muzaffari mentioned - as well - but they do not rise to the degree of confirmation and certainty. \"Al-Mushaf\" is an Arabic word: The word *Sahifah* is a noun: plural *Sahifat*, *Saha'if*, *Sihaf*, and *Suhuf*. The plural is *Sahif*. *Sahifah* is what is written in of paper and the like, and it applies to what is written in it. Plural: *Suhuf*. (3) So the word is pure Arabic. Even assuming the correctness of what was attributed regarding the Abyssinians using it - as well - perhaps it is among the shared vocabulary between the two languages. Voweling of the word \"Mushaf\" and clarifying its meaning in language: The famous origin in voweling the word is: \"Mushaf\" with Damma on Mim, and \"Mishaf\" with Kasra is permissible, which is the dialect of Tamim. *Mushaf*: A name for every collection of written sheets joined between two covers. It came in (Al-Lisan) from Al-Azhari - may Allah have mercy on him: \"The Mushaf was named Mushaf because it was *Ushifa*, meaning made a collector of written sheets between two covers.\" (4) The implication of Al-Fayruzabadi's speech - may Allah have mercy on him - is: That *Mushaf* (with Damma): Is a passive participle from *Ashafahu* meaning he collected it. *Mashaf* (with Fatha): Place of sheets, meaning: gathering place of sheets. *Mishaf* (with Kasra): Tool collecting sheets. (5) Al-Shihab Al-Khafaji (1069 AH) said: \"Mushaf with Damma on Mim and Kasra, and Triplication (Fatha too) was narrated in it; it is the gathering of sheets from *Ashafa* meaning collected, and it is specific to the Quran.\" (6) Al-Farra' (d. 207 AH) said: \"The Arabs found Damma heavy in letters so they broke their Mim (Kasra), and their origin is Damma. From that is *Mushaf*, *Mukhda'*, *Mutraf*, *Mighzal*, and *Mujsad*; because in meaning they are taken from *Ashafa* (sheets were collected in it)...\" (7) Abu Ishaq Al-Wahrani known as Ibn Qurqul (d. 569 AH) said: \"The Mushaf is taken from the Sahifah.\" (8) Al-Mutarrizi (d. 610 AH) said: \"The Mushaf is the booklet (*Kurrasah*), and its reality is the gathering of",
    "foot_note": "1. Al-Burhan: (1/377).\n2. Narrated by Al-Bukhari, Hadith: (4987).\n3. See: Definition and meaning of Sahifah in Almaany Dictionary.\n4. See: Lisan al-Arab (7/290-291), entry: (Sahaf).\n5. See: Basa'ir Dhawi al-Tamyiz fi Lata'if al-Kitab al-Aziz (1/86).\n6. See: Nasim al-Riyad fi Sharh Shifa al-Qadi Iyad p 554.\n7. See: Islah al-Mantiq p 120, Adab al-Katib p 555, and Tahdhib al-Lugha 4/254.\n8. See: Matali' al-Anwar 4/264.",
    "book_id": "936",
    "new_page_number": 50
  },
  {
    "serial_number": "1099983",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 144,
    "volume_number": 1,
    "text": "sheets.\" (1) Al-Samin Al-Halabi (d. 756 AH) said: \"The Mushaf is the gatherer of written sheets... and it became dominant for what is written of the Quran.\" (2) Mushaf in Terminology: As for Mushaf in the terminology of scholars, may Allah have mercy on them, it is a name for what the speech of Allah Almighty is written in between the two covers. (3) Mushaf applies to what contains the entire Quran, or what is called Mushaf by custom even if little like a Hizb, as stated by Al-Qalyubi - may Allah have mercy on him - or less than that like a paper with part of a Surah, or a board, or a written shoulder blade. (4) \"The Quran was called Mushaf because it was collected from scattered sheets in the hands of Companions. And it is said: because it collected and contained - by way of summary - all that was in the books of Prophets and their sheets, (not) by way of detail.\" (5). \"Mushaf\" is a name for the written part of the Holy Quran, collected between two covers, and \"Quran\" is a name for the speech of Allah Almighty written in the Mushafs (6). Similar to the above, Al-Qastallani (d. 923 AH) - may Allah have mercy on him - says: \"The difference between *Suhuf* (sheets) and *Mushaf*: The *Suhuf* are the loose papers in which the Quran was collected in the era of Abu Bakr. They were scattered Surahs, each Surah arranged with its verses separately, but they were not arranged one after another. When they were copied and arranged one after another, they became a Mushaf.\" (7) We conclude this important section with some poetry of Abu Amr Al-Dani (d. 444 AH) - may Allah have mercy on him - in \"Al-Urjuzah Al-Munabbihah\":\nThe Saying on Mushafs and Collecting the Quran therein\nListen to my saying regarding Mushafs... And what I cite from the predecessors\nOf their status in the time of Al-Siddiq... And the Pleasing Uthman, possessor of success.\nWhen the Messenger of Allah died... May my God bless him always\nAnd Al-Siddiq took charge of the Ummah... After immense matters occurred\nThe Arabs apostatized in the lands... And announced obedience to Satan\nAnd withheld the obligation of Zakat... And its obligation is coupled with Prayer\nThe Caliph of the Chosen Prophet saw... Their Jihad as an obligation and honor\nSo he mobilized armies and soldiers... Towards them and directed the seniors\nFrom the Muhajireen and Ansar... Hoping for the victory of the Subduer\nSo the God realized what he hoped... And accepted the opinion he saw\nAnd the army he prepared was supported... So they killed and captured the apostates\nAnd some sought refuge in fortresses... And reconciled on adhering to the religion\nAnd that was after an ordeal and distress... Befell the Companions from the people of apostasy\nAnd the senior reciters were martyred... That day there and the famous ones",
    "foot_note": "1. See: Al-Mughrib fi Tartib al-Mu'rib 1/467.\n2. See: Umdat al-Huffaz 2/371.\n3. See: Al-Mawsu'ah al-Fiqhiyyah, by a group of researchers (38/5).\n4. See: Hashiyat al-Dasuqi 'ala al-Sharh al-Kabir (1/125); Hashiyat al-Qalyubi 'ala Minhaj al-Talibin (1/35). See: The Difference between Quran and Mushaf - Dr. Mahmoud bin Ahmad Al-Dosari, Article on Al-Alukah website dated: 11/7/1439 AH.\n5. See: Basa'ir Dhawi al-Tamyiz fi Lata'if al-Kitab al-Aziz (1/87).\n6. See: Bada'i' al-Sana'i' fi Tartib al-Shara'i', by Al-Kasani (3/8-9).\n7. Lata'if al-Isharat: (1/106).",
    "book_id": "936",
    "new_page_number": 51
  },
  {
    "serial_number": "1099984",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 145,
    "volume_number": 1,
    "text": "And the matter reached Al-Siddiq... So he praised Allah for success\nAnd Al-Farooq said at that time... A saying supported by success\n'I see killing has intensified... Among the carriers of Quran and continued\nAnd perhaps the like of that will circle... Upon them so they will be nonexistent by that\nSo rectify the matter and what has been... And work to collect the Quran'\nHe urged Al-Siddiq more than once... So Allah opened his chest for that\nHe said to Ibn Thabit then... 'I indeed see you for this matter\nYou used to, morning and evening... Write the revelation of Allah for the Prophet\nSo you are among us of the foreunners... So collect the Book of Allah in papers'\nSo he did what he ordered him... Relying on what he mentioned\nAnd collected the Quran in sheets... And did not distinguish the letters of difference (1)\nRather he drew (wrote) the seven languages... And all that was correct of readings\nSo the sheets were in his life... With Abu Bakr until his death\nThen with Umar Al-Farooq... When the Caliphate of Al-Siddiq ended\nThen they became afterwards with Hafsa... When he died as in the story. (2)\nWith the end of the second section, the fourth and final chapter ends. And praise be to Allah the High, the Great. Research Conclusion, and Statement of the Most Important Results Reached by this Concise Study. Praise be to Allah who bestowed upon His servant who is in need of Him, Glory be to Him, in all his states, apparent in weakness, humiliation, and submission before Him, Glory be to Him, in all his phases and in his stay and travel. To proceed: This concise and humble study reached several facts and results, perhaps the clearest, most prominent, and important of which are: 1 - Clarifying the greatness of the status of the Final Book sent down from Allah, and the extent of Allah's preservation of it, by ordaining the causes and cosmic laws He ordained and facilitated ways for its preservation, at the forefront of which is the compilation in the era of Al-Siddiq, may Allah be pleased with him. 2 - Realization of the goodness (*Khayriyyah*) of the first of this Nation - the noble, pure, righteous Companions, may Allah be pleased with them all - in knowledge, action, religiosity, honesty, ambition, high status, precedence in every good, and rushing to every virtue. This was represented in their undertaking the preservation of their Lord's Book after their Prophet, may Allah bless him and grant him peace, in the best manner - collecting it - memorizing it in chests, - and writing and recording it - preserving it in lines. 3 - That preservation of the Quran by the two methods \"Memorization in chests - and Writing in lines\" indicates and points to the two most prominent proper names for the Quran, namely:",
    "foot_note": "1. Abu Bakr's collection including the Seven Modes is a matter difficult to be certain of, as there is no definitive proof for it among investigators, and this was noted in more than one place in the folds of the research. The Researcher.\n2. Al-Urjuzah Al-Munabbihah by Abu Amr Al-Dani - (previous reference), Verses from number: (178 - 155), (p. 105 - 110).",
    "book_id": "936",
    "new_page_number": 52
  },
  {
    "serial_number": "1099985",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 146,
    "volume_number": 1,
    "text": "\"The Quran and The Kitab (Book)\". The name \"Quran\" refers to its preservation in chests because it is recited (*Maqru'*), and the name \"Kitab\" refers to its preservation in lines because it is written (*Maktub*). 4 - This compilation was done with the highest degree of precaution for the Book of Allah Almighty in verification, scrutiny, documentation, and investigation of what they collected, and selection of those who performed its collection according to the best, finest, and most precise methods of selection - fulfilling the trust, clearing the conscience, and fulfilling the covenant to bear the trust of preserving and guarding the Quran from loss after their Final Prophet - the Messenger of the Lord of the Worlds, may Allah bless him and grant him peace. 5 - Upon this rational methodology, the collection of the Quran was completed under the supervision of Abu Bakr and Umar and senior Companions and the consensus of the Nation on it without denial. That was an eternal virtue history still mentions with gratitude, for Abu Bakr in supervision, for Umar in suggestion, for Zaid in execution, and for the Companions in assistance and approval.\" (1) 6 - That this compilation is not considered an innovation in religion, because the Quran was collected in the era of Prophethood but was scattered, and this compilation did not bring anything new, other than collecting the Quran between two covers after it was scattered only. 7 - Verification that the arrangement of verses in Surahs is Tawqifi (divinely ordained). 8 - The study concluded that the saying on the arrangement of Surahs is that it is Tawqifi not Ijtihadi. 9 - That opposing the Mushaf arrangement with chronological arrangement contradicts the consensus of the Nation - predecessors and successors. 10 - With the completion of this compilation, and with this precision, reassurance was achieved regarding the preservation of the Book of Allah Almighty, and certainty and verification that what is between its two covers is the speech of Allah and His revealed inspiration whose Quranic nature is realized, transmitted by Tawatur, and that there is no verse in it of abrogated Quran. It is the Quran upon which the Final Review settled, and it is the Quran conforming to what is established in the Preserved Tablet with the Lord of Glory, Glory be to Him. And that there is no addition in it nor subtraction, nor distortion in it nor change nor alteration, because: {Falsehood cannot approach it from before it or from behind it} (Fussilat: from verse 42), and that is because: {[It is] a revelation from a [Lord who is] Wise and Praiseworthy} (Fussilat: from verse 42). It implies the realization of Allah's promise which never fails or changes, about which He, Glory be to Him, said: {Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian} (Al-Hijr: 9). There are many results realized in the folds of the research, which are clear not hidden, and the researcher did not mention them here due to their clarity and distinctness.",
    "foot_note": "1. Manahil al-Irfan by Al-Zurqani: (1/253:252), attributed to Al-Sakhawi.",
    "book_id": "936",
    "new_page_number": 53
  },
  {
    "serial_number": "1099986",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 156,
    "volume_number": 1,
    "text": "A - Index of References. 1 - Al-Itqan fi Ulum al-Quran Author: Abdul Rahman bin Abi Bakr, Jalal al-Din al-Suyuti (Died: 911 AH), Editor: Muhammad Abu al-Fadl Ibrahim Publisher: The General Egyptian Book Organization Edition: 1394 AH / 1974 AD, Number of Parts: 4. 2 - Al-Urjuzah Al-Munabbihah on the Names of Reciters and Narrators and Principles of Readings and Articles of Faith with Tajweed and Indications, Uthman bin Sa'id Al-Dani Abu Amr Al-Andalusi (Died: 444 AH), Investigation: Muhammad bin Majqan Al-Jaza'iri, First Edition by Dar Al-Mughni - Riyadh - 1420 AH - 1999 AD, Number of Volumes: 1. 3 - Al-Burhan fi Ulum al-Quran Author: Abu Abdullah Badr al-Din Muhammad bin Abdullah bin Bahadur Al-Zarkashi (Died: 794 AH) Editor: Muhammad Abu al-Fadl Ibrahim, Edition: First, 1376 AH - 1957 AD, Publisher: Dar Ihya' al-Kutub al-Arabiyyah Isa al-Babi al-Halabi and Partners (then photocopied by Dar Al-Ma'rifah, Beirut, Lebanon - with same pagination) Number of Parts: 4. 4 - Al-Bidaya wa Al-Nihaya Author: Abu al-Fida Ismail bin Umar bin Kathir al-Qurashi al-Basri then al-Dimashqi (Died: 774 AH), Publisher: Dar Al-Fikr, Year of Publication: 1407 AH - 1986 AD Number of Parts: 15. 5 - Tafsir al-Tabari: Jami' al-Bayan fi Ta'wil al-Quran Author: Muhammad bin Jarir bin Yazid bin Kathir bin Ghalib al-Amili, Abu Ja'far al-Tabari (Died: 310 AH), Editor: Ahmed Shakir, Publisher: Mu'assasat al-Risalah Edition: First, 1420 AH - 2000 AD Number of Parts: 24. 6 - Tafsir Ibn Kathir, Tafsir al-Quran al-Azim, Author: Abu al-Fida Ismail bin Umar bin Kathir al-Qurashi al-Basri then al-Dimashqi (Died: 774 AH), Editor: Muhammad Hussain Shams al-Din, Publisher: Dar",
    "foot_note": "None",
    "book_id": "936",
    "new_page_number": 54
  },
  {
    "serial_number": "1099987",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Evidences of Success for the Most Correct Method of the Compilation of Al-Siddiq",
    "edition": "None",
    "publisher": "None",
    "page_number": 157,
    "volume_number": 1,
    "text": "Al-Kutub Al-Ilmiyyah, Muhammad Ali Baydoun Publications - Beirut Edition: First - 1419 AH. 7 - Arafa bin Tantawi, Tafasir Arranged by Order of Revelation and Refutation of Them. Presentation, Study, and Discussion (n.d.). Number of Parts: 1. 8 - Arafa bin Tantawi, Al-Shaf'ah bayna Al-Jam' Al-Uthmani wa Al-Ahruf Al-Sab'ah (n.d.) Number of Parts: 2. 9 - Zad al-Masir fi Ilm al-Tafsir Author: Jamal al-Din Abu al-Faraj Abdul Rahman bin Ali bin Muhammad Al-Jawzi (Died: 597 AH), Editor: Abdul Razzaq Al-Mahdi, Publisher: Dar Al-Kitab Al-Arabi - Beirut Edition: First - 1422 AH. 10 - Sharh al-Sunnah Author: Muhyi al-Sunnah, Abu Muhammad Al-Husayn bin Mas'ud bin Muhammad bin Al-Farra' Al-Baghawi Al-Shafi'i (Died: 516 AH), Investigation: Shu'ayb Al-Arna'ut - Muhammad Zuhair Al-Shawish, Publisher: Al-Maktab Al-Islami - Damascus, Beirut Edition: Second, 1403 AH - 1983 AD Number of Parts: 15. 11 - Fath al-Bari Sharh Sahih al-Bukhari Author: Ahmad bin Ali bin Hajar Al-Asqalani Al-Shafi'i, Publisher: Dar Al-Ma'rifah - Beirut, 1379 Numbering of books, chapters and hadiths: Muhammad Fuad Abdul Baqi, Directed, corrected and supervised printing: Muhibb al-Din al-Khatib, Comments by the Scholar: Abdul Aziz bin Abdullah bin Baz Number of Parts: 13. 12 - Al-Fawakih Al-Dawani 'ala Risalat Ibn Abi Zaid Al-Qayrawani, Author: Ahmad bin Ghanim (or Ghunaym) bin Salim Ibn Muhanna, Shihab al-Din Al-Nafrawi Al-Azhari Al-Maliki (Died: 1126 AH), Publisher: Dar Al-Fikr, Edition: Without edition Date of publication: 1415 AH - 1995 AD Number of Parts: 2. 13 - Kitab al-Masahif, Author: Abu Bakr bin Abi Dawood, Abdullah bin Suleiman bin Al-Ash'ath Al-Azdi Al-Sijistani (Died: 316 AH), Editor: Muhammad bin Abdu Publisher: Al-Faruq Al-Hadithah - Egypt/Cairo Edition: First, 1423 AH - 2002 AD Number of Parts: 1. 14 - Al-Muqni' fi Rasm Masahif al-Amsar Author: Uthman bin Sa'id bin Uthman bin Umar Abu Amr Al-Dani (Died: 444 AH), Editor: Muhammad Al-Sadiq Qamhawi Publisher: Al-Kulliyat Al-Azhariyyah Library, Cairo Number of Parts: 1. 15 - Al-Mawsu'ah Al-Fiqhiyyah Al-Kuwaitiyyah Issued by: Ministry of Awqaf and Islamic Affairs - Kuwait Number of Parts: 45 parts, Edition: (from 1404 - 1427 AH) .. Parts 1-23: Second Edition, Dar Al-Salasil - Kuwait .. Parts 24-38: First Edition, Matabi' Dar Al-Safwah - Egypt .. Parts 39-45: Second Edition, Ministry Print. 16 - Mabahith fi Ulum al-Quran, Author: Manna' bin Khalil Al-Qattan (Died: 1420 AH), Publisher: Maktabat Al-Ma'arif for Publishing and Distribution Edition: Third Edition 1421 AH- 2000 AD Number of Parts: 1. 17 - Majmu' al-Fatawa Author: Taqi al-Din Abu al-Abbas Ahmad bin Abdul Halim bin Taymiyyah al-Harrani (Died: 728 AH), Editor: Abdul Rahman bin Muhammad bin Qasim, Publisher: King Fahd Complex for the Printing of the Holy Quran, Madinah, Kingdom of Saudi Arabia Year of Publication: 1416 AH/1995 AD. 18 - Mirqat al-Mafatih Sharh Mishkat al-Masabih Author: Ali bin (Sultan) Muhammad, Abu al-Hasan Nur al-Din Al-Mulla Al-Harawi Al-Qari (Died: 1014 AH), Publisher: Dar Al-Fikr, Beirut. 19 - Al-Murshid Al-Wajiz ila Ulum Tata'allaq bi al-Kitab al-Aziz Author: Abu al-Qasim Shihab al-Din Abdul Rahman bin Ismail bin Ibrahim Al-Maqdisi Al-Dimashqi known as Abu Shamah (Died: 665 AH), Editor: Tayyar Altikulac, Publisher: Dar Sadir - Beirut Year of Publication: 1395 AH - 1975 AD Number of Parts: 1.",
    "foot_note": "None",
    "book_id": "936",
    "new_page_number": 55
  },
  {
    "serial_number": "1099988",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Proofs of Success for the Most Accurate Method of al-Siddiq’s Compilation",
    "edition": "None",
    "publisher": "None",
    "page_number": 158,
    "volume_number": 1,
    "text": "20 - Manahil al-Irfan in the Sciences of the Qur'an, authored by Muhammad Abd al-Azim al-Zurqani (d. 1367 AH). Publisher: Isa al-Babi al-Halabi Press and Co., third edition, in two volumes. 21 - Al-Azhar Magazine, Editor-in-Chief: Muhammad Farid Wajdi Bey, under the administration of the Department of Administration for Al-Azhar and the religious institutes in Cairo. Issue of Ramadan, year 1370 AH / 1950 CE, Volume 22. Published by Al-Azhar Press.",
    "foot_note": "None",
    "book_id": "936",
    "new_page_number": 56
  }
]