[
  {
    "serial_number": "4979624",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Heart Softeners, Etiquettes, and Remembrances\nBook: When the Heart Retreats (Hinama Ya'takif Al-Qalb)\nAuthor: Dr. Abdul Rahman bin Abdul Aziz Al-Aql.\nPublisher: Scientific Elites Center - Qassim - Buraydah.\nEdition: First, 1435 AH - 2014 AD.\nNumber of Pages: 63\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 27 Dhu al-Hijjah 1441\n\nBook: When the Heart Retreats\nAuthor: Dr. Abdul Rahman bin Abdul Aziz Al-Aql.\nPublisher: Scientific Elites Center - Qassim - Buraydah.\nEdition: First, 1435 AH - 2014 AD.\nNumber of Pages: 63\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 27 Dhu al-Hijjah 1441\n\nAuthor: Dr. Abdul Rahman bin Abdul Aziz Al-Aql.\nPublisher: Scientific Elites Center - Qassim - Buraydah.\nEdition: First, 1435 AH - 2014 AD.\nNumber of Pages: 63\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 27 Dhu al-Hijjah 1441\n\nPublisher: Scientific Elites Center - Qassim - Buraydah.\nEdition: First, 1435 AH - 2014 AD.\nNumber of Pages: 63\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 27 Dhu al-Hijjah 1441\n\nEdition: First, 1435 AH - 2014 AD.\nNumber of Pages: 63\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 27 Dhu al-Hijjah 1441\n\nNumber of Pages: 63\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 27 Dhu al-Hijjah 1441\n\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 27 Dhu al-Hijjah 1441\n\nPublication date in Al-Shamela: 27 Dhu al-Hijjah 1441",
    "foot_note": "None",
    "book_id": "59"
  },
  {
    "serial_number": "4979625",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 5,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful.\n\nIntroduction\nPraise be to Allah who made hearts the place of His gaze, not bodies. And the most complete and perfect peace and blessings be upon our Prophet Muhammad, the master of the sons of Adnan, and upon his family and companions, the people of piety and faith.\nAs for what follows:\nMany are those to whose minds, when they hear the word (I'tikaf/Seclusion), nothing comes except the seclusion of the body in one of the houses of Allah. In their imagination, it is restricted to the concept of physical I'tikaf. This, although it is one of the conditions of I'tikaf, is not its [ultimate] purpose. For its purpose and goal is: the seclusion of the heart, which is the place of Allah's gaze: «Verily Allah does not look to your bodies nor to your wealth, but He looks to your hearts and your deeds» (1).\nHow many a servant has secluded himself with his body in the house of Allah, but has not reached",
    "foot_note": "1. Narrated by Muslim (4/1986) No. (2564) from the Hadith of Abu Huraira, may Allah be pleased with him.",
    "book_id": "59"
  },
  {
    "serial_number": "4979626",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 6,
    "volume_number": 1,
    "text": "the I'tikaf that Allah Almighty intended; therefore, Allah the Glorious suspended the good He gives His servant upon the good that is in His servant's heart. He, Glory be to Him, said: {If Allah knows any good in your hearts, He will give you something better than what has been taken from you} [Al-Anfal: 70].\nSo, the healthier the heart becomes and the more it rises above the world, the more Allah's grants and gifts come to it. The last ten days of Ramadan are the days most worthy of these grants, and the one secluded in the house of Allah (a seclusion of the heart) is deserving of that due to his sincerity and closeness to Allah.\nFor the I'tikaf to be an I'tikaf of the heart and not just the body, and for the Mu'takif (person in seclusion) to taste this worship, and for this obedience to be upright for him, and for him to feel its spirit and recall the meanings of servitude within it; he should aspire to the following traits:",
    "foot_note": "None",
    "book_id": "59"
  },
  {
    "serial_number": "4979627",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 7,
    "volume_number": 1,
    "text": "The First Trait\nCutting off Attachments from Creatures\nThe secret of I'tikaf and its goal is: Solitude with Allah, emptying the heart, and cutting off its attachments to creatures. Therefore, it is befitting for the Mu'takif to be immersed in devotion and special acts of worship, turning to his Lord by emptying the heart for Allah, insisting in seeking His pleasure, and being persistent (1) in attaining His forgiveness and pardon. As Ata', may Allah have mercy on him, said: «The likeness of the Mu'takif is like a man who has a need from a great one, so he sits at his door saying: I will not leave until my need is fulfilled. Likewise, the Mu'takif sits in the house of Allah saying: I will not leave until I am forgiven» (2).\nFor this reason, it is prescribed for the Mu'takif to be averse to people, shunning their gatherings. Imam Ahmad, may Allah have mercy on him, stated that it is appropriate",
    "foot_note": "1. Al-Ilhaf: Intensity and insistence in asking. See: Tahdhib al-Lughah (5/46), Lisan al-Arab (9/314) (Lahafa).\n2. Mentioned by Al-Sarakhsi in Al-Mabsut (3/815), see: Waza'if Ramadan p. (75).",
    "book_id": "59"
  },
  {
    "serial_number": "4979628",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 8,
    "volume_number": 1,
    "text": "for the Mu'takif not to mix with people, even if it is for teaching knowledge or teaching the Quran, and that what is most perfect for him is solitude and seclusion for conversing with his Lord, remembering Him, and supplicating to Him (1).\nWith a look of contemplation, we find that the worship of I'tikaf is coupled with the worship of Fasting; because the wisdom behind the legislation of both is one, which is: Reforming the heart through Taqwa (God-consciousness) of Allah, {O you who have believed, decreed upon you is fasting as it was decreed upon those before you that you may become righteous} [Al-Baqarah: 183]. The fasting servant reaches the peak in reforming his heart when he isolates himself from people and secludes himself with his heart and body, alone with his Lord, throwing himself down before Him. It was from the guidance of the Prophet, peace and blessings be upon him, in I'tikaf to separate from people, and he used to order a tent (Khiba') (2) to be set up for him in the mosque which he would stick to, and be alone with his Lord, as Aisha, may Allah be pleased with her, said: «The Prophet, peace and blessings be upon him, used to perform I'tikaf in the last ten days of Ramadan, so I would set up a tent for him; he would pray Fajr and then",
    "foot_note": "1. See: Madarij al-Salikin (1/263), Waza'if Ramadan p. (60).\n2. Al-Khiba': With a Kasra on the Kha and light Ba with Madd, it is a tent made of wool or hair, then applied to any house/structure. See: Al-Nihayah (2/9), Al-Lisan (14/223) (Khaba).",
    "book_id": "59"
  },
  {
    "serial_number": "4979629",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 9,
    "volume_number": 1,
    "text": "enter it» (1).\nIndeed, most acts of obedience and many acts of worship gather for the solitary Mu'takif who is alone with his Lord. The greatest and most honorable of these worships is: the worship of the heart. Since the heart is the master of the limbs, it is distinguished by the master of worships: Sincerity (Ikhlas). There is no state that increases sincerity and develops it like the state of the servant who is broken and thrown down before his Master during solitude with Allah, and seclusion in obedience to Him. For this reason, he tastes the sweetness of faith, and finds in it a taste and flavor that no other taste equals, and no other flavor approaches, {That is the bounty of Allah, which He gives to whom He wills, and Allah is the possessor of great bounty} [Al-Hadid: 21].",
    "foot_note": "1. Narrated by Al-Bukhari, (3/48) No. (2033), and Muslim (2/715), No. (1172).",
    "book_id": "59"
  },
  {
    "serial_number": "4979630",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 10,
    "volume_number": 1,
    "text": "The Second Trait\nLiving with the Quran\nThe core of worship and the life of the heart, its primary source is: The Book of Allah, which Allah made a spirit, a life, and a light, {And thus We have revealed to you an inspiration of Our command. You did not know what is the Book or [what is] faith, but We have made it a light by which We guide whom We will of Our servants} [Ash-Shura: 52].\nIt is no wonder that the believer finds the life of his heart in pondering the Quran; because he tastes, through his deliberate recitation, the sweetness of conversing with the speech of his Lord. So he lives in the horizons of the verses whose spirit flows into the innermost parts of his heart. He then finds another life for his heart, and a pleasure in his reading that his tongue cannot describe, nor his pens record. This is due to the greatness of the Divine Address and the splendor of its beauty which captivates the mind of the ponderer, so his soul softens, and tranquility and awe envelop it. Thus, meanings manifest to the heart that overflow with light and rain, bestowing majesty and beauty upon the reader.\nJust as rain is the spring of the earth, so too is the Quran the spring of the hearts of the people of",
    "foot_note": "None",
    "book_id": "59"
  },
  {
    "serial_number": "4979631",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 11,
    "volume_number": 1,
    "text": "faith, and it is the river of life for their hearts. Nothing is more beneficial to the heart than reading the Quran with contemplation and reflection, for it bequeaths love, longing, fear, hope, and all other states by which the heart attains life and perfection. If people knew what lies in reading the Quran with contemplation, they would have occupied themselves with it over everything else. If one reads it with thought and passes by a verse he needs for the healing of his heart, he repeats it even if a hundred times, even if for a whole night. For reading one verse with thought and understanding is better than reading a complete recitation (Khatma) without contemplation and understanding, and more beneficial for the heart, and more conductive to attaining faith and tasting the sweetness of the Quran; for reading the Quran with reflection is the origin of the heart's rectification (1).\nThis is not for every reader of the Quran, but for the one whose «concern when reciting the Surah when he starts it is: When will I be admonished by what I recite? And his intention is not: When will I finish the Surah? His intention is: When will I understand the address from Allah? When will I be deterred? When will I take heed? Because reciting the Quran is worship, and worship cannot be done with heedlessness» (2).\nWhenever the Mu'takif lives with the Quran in this manner, he has achieved the seclusion of the heart, which is the desire of the seekers of true I'tikaf.",
    "foot_note": "1. Miftah Dar al-Sa'ada (1/187), with adaptation.\n2. Akhlaq Hamalat al-Quran p. (18).",
    "book_id": "59"
  },
  {
    "serial_number": "4979632",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 12,
    "volume_number": 1,
    "text": "Indeed, living with the Quran and pondering it is the key to the heart's uprightness. Nothing equals living with the Quran in firming the heart and establishing its pillars. Therefore, Allah commanded «pondering His Book, thinking about its meanings, and being guided by its verses. He praised those who do so, placed them in the highest ranks, and promised them the most splendid gifts. If a servant spent the gems of his life in this art, that would not be much compared to what is the best of demands, the greatest of goals, the origin of all origins, the foundation of happiness in both abodes, and the rectification of matters of religion, the world, and the Hereafter. Through it, a flourishing life of guidance, goodness, and mercy is realized for the servant, and Allah prepares for him the best life and enduring righteous deeds» (1).\nThe first launch into living with the Quran lies in pondering it and prolonged meditation on its verses. Yes, «there is nothing more beneficial for the servant in his livelihood and his Hereafter, and closer to his salvation, than pondering the Quran, prolonging meditation upon it, and gathering thoughts on the meanings of its verses. For it informs the servant of the landmarks of good and evil in their entirety, and upon",
    "foot_note": "1. Al-Qawa'id Al-Hisan li-Tafsir Al-Quran p. (7-8).",
    "book_id": "59"
  },
  {
    "serial_number": "4979633",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 13,
    "volume_number": 1,
    "text": "their paths, causes, ends, fruits, and the destination of their people. It places (1) in his hand the keys to the treasures of happiness and beneficial sciences. It establishes the rules of faith in his heart, constructs its building and firms its pillars. It shows him the image of the world and the Hereafter, Paradise and Hell in his heart. It presents him among the nations, shows him the days of Allah among them, enlightens him on the sites of lessons, and makes him witness the justice of Allah and His favor. It introduces him to His Essence, His Names, His Attributes, and His Actions; what He loves and what He hates; His path that leads to Him, and what awaits those who walk it after arrival and coming upon Him; the highway robbers and its perils. It introduces him to the soul and its attributes, the corrupters of deeds and their correctors. It introduces him to the path of the people of Paradise and the people of Hell, their deeds, their states, and their signs; the ranks of the people of happiness and the people of misery; the divisions of creation, and their gathering in what they gather in, and their separation in what they separate in. And in contemplating the Quran, pondering it, and understanding it, there are multiples of multiples of what we mentioned of",
    "foot_note": "1. Yatullu: With a Damma on the Ta, from the verb (Talla). It is also said: Yatillu with a Kasra on the Ta: meaning he poured it and cast it. See: Al-Nihayah fi Gharib al-Hadith wa al-Athar (1/195), and Taj al-Arus (28/138).",
    "book_id": "59"
  },
  {
    "serial_number": "4979634",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 14,
    "volume_number": 1,
    "text": "wisdoms and benefits. In summary, it is the greatest of treasures; its talisman (secret) (1) is diving with thought to the depth of its meanings» (2).\nAmong the most beneficial means aiding in pondering the Quran: repeating verses. It is the path to drawing out the treasures of the Quran and its secrets. From Abu Dharr, may Allah be pleased with him, who said: «The Prophet, peace and blessings be upon him, stood with a verse until morning, repeating it. And the verse was: {If You should punish them - indeed they are Your servants; but if You forgive them - indeed it is You who is the Exalted in Might, the Wise} [Al-Ma'idah: 118]» (3).\nBishr bin Al-Sari said: «The verse is but like a date; whenever you chew it, you extract its sweetness» (4). Al-Muwaffaq Ibn Qudamah said: «If pondering is not achieved except by repeating",
    "foot_note": "1. Al-Tillasm: A name for the concealed secret. What is meant is the precise meanings that do not appear to other than the one deep in understanding, knowledge, and physiognomy. See: Taj al-Arus (33/24, 25).\n2. Madarij al-Salikin (1/450, 451).\n3. Narrated by Al-Nasa'i (2/177) No. (1010), Ibn Majah (1/429) No. (1350), Ahmad (35/309, 310) No. (21388), and Al-Hakim (1/367) No. (879), and its chain is Hasan.\n4. Al-Burhan fi 'Ulum al-Quran by Al-Zarkashi (1/471).",
    "book_id": "59"
  },
  {
    "serial_number": "4979635",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 15,
    "volume_number": 1,
    "text": "the verse, let him repeat it» (1).\nAmong the aids to pondering the Quran: Turning to it, and the reader feeling that he is the one being addressed by it, for that is among the causes of openings [of understanding] in it. Sheikh al-Islam [Ibn Taymiyyah], may Allah have mercy on him, said - feeling what Allah poured into his heart of great openings and wondrous deductions during his imprisonment and his solitude with his Lord, and his complete turning to the Quran -: «Allah has opened for me in this fortress this time, from the meanings of the Quran and from the principles of knowledge, things that many scholars would wish for, and I regretted wasting most of my time on other than the meanings of the Quran» (2).\nHis student Ibn al-Qayyim, may Allah have mercy on him, said: «If you want to benefit from the Quran, gather your heart when reciting and listening to it, lend your ear, and be present like one who is being addressed by the One who spoke it, Glory be to Him, from Him to him. For it is a speech from Him to you upon the tongue of His Messenger. Allah Almighty says: {Indeed in that is a reminder for whoever has a heart or",
    "foot_note": "1. Mukhtasar Minhaj al-Qasidin p. (53).\n2. Dhayl Tabaqat al-Hanabilah (4/519).",
    "book_id": "59"
  },
  {
    "serial_number": "4979636",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 16,
    "volume_number": 1,
    "text": "who listens while he is present [in mind]} [Qaf: 37]. Since the complete effect depends on an influencing agent, a receptive locus, a condition for the effect to occur, and the absence of a barrier preventing it; the verse included an explanation of all that in the briefest phrasing, the clearest, and the most indicative of the intended meaning. So if the Influencer is present: which is the Quran; and the Receptive Locus: which is the living heart; and the Condition is found: which is listening; and the Barrier is absent: which is the heart's preoccupation and distraction from the meaning of the address and its turning away to something else; the Effect occurs: which is benefitting and remembering» (1).\nIndeed, Allah's favor upon us is great, when He permitted weak creatures like us to converse with Him through His Great Speech. Ibn al-Salah, may Allah have mercy on him, said: «It has been reported that the angels were not given the virtue of reading the Quran, and they are eager therefore to hear it from humans. So reading the Quran is an honor Allah honored humans with. However, the believers among the Jinn, we have been informed that they read it, and Allah knows best» (2).",
    "foot_note": "1. Al-Fawa'id p. (3) summarized.\n2. Fatawa Ibn al-Salah (1/234), see: Al-Itqan fi 'Ulum al-Quran (1/291).",
    "book_id": "59"
  },
  {
    "serial_number": "4979637",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 17,
    "volume_number": 1,
    "text": "Indeed, recalling this choosing [by Allah], and recalling the greatness of the Speaker of the Quran, is the strongest means of living with the Quran. Ibn al-Jawzi, may Allah have mercy on him, said: «The reciter of the Glorious Quran should look at how Allah Almighty was kind to His creation in conveying the meanings of His speech to their understandings, and should know that what he reads is not human speech, and should recall the greatness of the Speaker, Glory be to Him and Most High, and ponder His speech» (1).\nAmong the aids to pondering the Quran and living with it: Rejoicing in it, and reading it with a spirit of glad tidings and feeling the Grace. Whoever seeks to understand the Quran, let him read it a reading of joy and glad tidings; for that is among the greatest motives for pondering. Allah Almighty said describing His believing servants: {And whenever a surah is revealed, there are among them those who say, \"Which of you has this increased in faith?\" As for those who believed, it has increased them in faith, while they are rejoicing} [At-Tawbah: 124]. And He Almighty said: {O mankind, there has to come to you instruction from your Lord and healing for what is in the breasts and guidance and mercy for the believers (57) Say, \"In the bounty of Allah and in His mercy - in that let them rejoice; it is better than what they accumulate\"} [Yunus: 57, 58].",
    "foot_note": "1. Mukhtasar Minhaj al-Qasidin p. (46).",
    "book_id": "59"
  },
  {
    "serial_number": "4979638",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 18,
    "volume_number": 1,
    "text": "Ibn Abi Hatim, may Allah have mercy on him, said in the interpretation of this verse: «It was mentioned from Baqiyyah, from Safwan - meaning Ibn al-Walid bin Amr - who said: I heard Ayfa' bin Abd al-Kala'i say: When the revenue/tax (Kharaj) of Iraq arrived to Umar, may Allah be pleased with him, Umar went out with a freedman of his. Umar began counting the camels, and they were more than that [expected]. So Umar began saying: Praise be to Allah. His freedman said: O Commander of the Faithful, this, by Allah, is from the bounty of Allah and His mercy. Umar said: You lied, this is not it. Allah says: {Say, \"In the bounty of Allah and in His mercy - in that let them rejoice; it is better than what they accumulate\"} [Yunus: 58], and this [wealth] is from what they accumulate» (1).\nAhmed bin Abi Al-Hawari said: «I read the Quran and look at a verse from it, and my mind becomes bewildered in it. I wonder at the memorizers of the Quran! How can sleep be pleasant to them, and how can they allow themselves to be occupied with anything of the world, while they speak the speech of the Most Merciful? If only they understood what they recite, knew its right, found pleasure in it, and found sweetness in conversing with it; sleep would have left them out of joy for what they were granted and guided to» (2).",
    "foot_note": "1. Tafsir Ibn Abi Hatim (6/1960).\n2. Narrated by Al-Sulami in Tabaqat al-Sufiyyah (p. 94), and Abu Nu'aym in Hilyat al-Awliya (10/22).",
    "book_id": "59"
  },
  {
    "serial_number": "4979639",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 19,
    "volume_number": 1,
    "text": "Dhul-Nun Al-Misri recited poetry:\nThe Quran prevented, with its promise and its threat ... The eyes from sleeping at night\nThey understood from the Great King His speech ... An understanding to which necks humble and submit (1)\nAbu Sulayman Al-Darani, may Allah have mercy on him, said: «The people of the night in their night are more delighted than the people of diversion in their diversion. Were it not for the night, I would not have loved remaining in the world» (2).\nSome of the predecessors said: «The poor people of the world: they left the world without tasting the best thing in it. They said: And what is the best thing in it? He said: The love of Allah, intimacy with Him, longing to meet Him, turning to Him, and turning away from everything else» (3).\nThis longing, intimacy with Allah, and turning to Him; its greatest motive is living with the Quran, pondering it, and enjoying its recitation.",
    "foot_note": "1. See: Hilyat al-Awliya (9/369).\n2. Narrated by Abu Nu'aym in Al-Hilyah (9/275), and Ibn Asakir in Tarikh Dimashq (34/146).\n3. Mentioned by Ibn al-Qayyim in Madarij al-Salikin (1/454), and Ibn Rajab in Jami' al-Ulum wa al-Hikam (p. 189).",
    "book_id": "59"
  },
  {
    "serial_number": "4979640",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 20,
    "volume_number": 1,
    "text": "The righteous predecessors understood this meaning and comprehended it; thus, it produced within them ambitious determinations to empty the mind for the Quran during the seasons of spiritual breezes. They had wonders with its reading, and a buzzing sound like bees could be heard from them due to being affected [by it].\nWe must all be certain that living with the Quran, pondering it, understanding its meanings, and acting upon it is the purpose of recitation, as our righteous predecessors realized.\nAl-Hasan Al-Basri, may Allah have mercy on him, said: «Those before you saw the Quran as letters from their Lord, so they would ponder them at night and implement them during the day» (1).\nSo release your soul - O successful one - to drink deep (2) from the basils of the Quran, empty your heart, and clear your mind for the Quran; so that you may live with it, and your heart may flutter in the peaks of happiness, achieving a great victory.",
    "foot_note": "1. Mentioned by Al-Ghazali in Ihya' Ulum al-Din (1/275), see: Al-Tibyan fi Adab Hamalat al-Quran p. (28).\n2. Al-'Abb: Drinking water violently and successively in gulps without sucking or breathing. See: Kitab al-Ayn (1/93), Jamharat al-Lughah (1/73).",
    "book_id": "59"
  },
  {
    "serial_number": "4979641",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 21,
    "volume_number": 1,
    "text": "The Third Trait\nCollectedness of the Heart and Sincerity of its Approach\nThe goal of I'tikaf and its purpose is: The uprightness of the heart. The heart does not become upright on the path of Allah except by turning completely to Allah. Whenever it turns away from Allah and swims in distractions far from Him, it has missed the purpose of I'tikaf, even if the body is secluded.\nTherefore; «When the righteousness of the heart and its uprightness on the path of its journey to Allah Almighty depended on its collectedness upon Allah, and gathering its scattered affairs by turning completely to Allah Almighty - for nothing gathers the scattered affairs of the heart except turning to Allah Almighty - and [since] excess food and drink, excess mixing with people, excess speech, and excess sleep are things that increase its scattering, disperse it in every valley, cut it off from its journey to Allah Almighty, or weaken it, hinder it, and stop it; the mercy of the Mighty, the Merciful, required for His servants that He legislate for them Fasting which removes excess food",
    "foot_note": "None",
    "book_id": "59"
  },
  {
    "serial_number": "4979642",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 22,
    "volume_number": 1,
    "text": "and drink, and empties the heart of the mixtures of desires that hinder it from its journey to Allah Almighty. He legislated it according to the measure of benefit, such that the servant benefits from it in his world and his Hereafter, and it does not harm him nor cut him off from his immediate and future interests.\nAnd He legislated for them I'tikaf, whose purpose and spirit is the heart's devotion to Allah Almighty, its collectedness upon Him, solitude with Him, cutting off preoccupation with creation, and occupying oneself with Him alone, Glory be to Him. So that remembering Him, loving Him, and turning to Him takes the place of the heart's worries and thoughts, occupying it instead of them (1). Thus, all concern becomes [focused] on Him, and all thoughts are on remembering Him, and thinking about attaining His pleasure and what brings one closer to Him. So his intimacy with Allah becomes a substitute for his intimacy with creation, thereby preparing him for his intimacy with Him on the day of loneliness in the graves when there is no companion for him, nor anything to bring joy other than Him. This is the greatest purpose of I'tikaf» (2).",
    "foot_note": "1. i.e., instead of worries and thoughts.\n2. Zad al-Ma'ad (2/82, 83).",
    "book_id": "59"
  },
  {
    "serial_number": "4979643",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 23,
    "volume_number": 1,
    "text": "The Fourth Trait\nSensing Allah's Company (Ma'iyyah) with His Servant\nAllah Almighty said: {Who sees you when you stand (218) And your turning about among those who prostrate} [Ash-Shu'ara: 218, 219]. It is a great verse from which the believing servant draws inspiration regarding Allah's observation of him in all his movements, states, and acts of worship. «Meaning He sees you in this great worship which is prayer, at the time of your standing and your turning about bowing and prostrating. He singled it out for mention due to its virtue and honor, and because whoever visualizes the nearness of his Lord in it becomes humble and submissive» (1).\nThis noble verse came at the end of Surah Ash-Shu'ara after the command to the Prophet, peace and blessings be upon him, to warn, stand firm on the truth, and rely on Allah; as if there is a hint in this that visualizing the company of Allah with His servant and His observation of him while performing",
    "foot_note": "1. Taysir al-Karim al-Rahman p. (599).",
    "book_id": "59"
  },
  {
    "serial_number": "4979644",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 24,
    "volume_number": 1,
    "text": "worship is spiritual provision that consoles the believer's heart on his path to Allah, removes his rancor, and clears away the noise, turbidity, and torments of life.\nIndeed, visualizing this company, Allah's surveillance of His servant, His knowledge of his condition, and His encompassing of his secrets and open acts, his words and deeds; is sufficient to remove the covering from the heart and wipe away the dust of worldly impurities; so that sincerity wrapped in the fence of truthfulness with Allah and seeking His reward and Hereafter bounty may take its place. For whoever is in this station of self-surveillance when performing worship, his ambition does not aspire except to the highest stations in the Hereafter; because the world and its fortunes, with the visualization of Allah's company and surveillance, become like dry chaff scattered by the winds. But if surveillance is absent or weak in the servant's heart, the urges of the self attack him like the attack of a predatory lion on its prey on a day of hunger and absence of a guard.",
    "foot_note": "None",
    "book_id": "59"
  },
  {
    "serial_number": "4979645",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 25,
    "volume_number": 1,
    "text": "The Fifth Trait\nMagnifying Allah Almighty\nThe basis of our servitude to Allah, Glory be to Him and Most High, is that it stands on revering Him, magnifying Him, and glorifying Him. Ramadan, its ten virtuous days, and I'tikaf are blessed gates for developing this reverence and magnification in our hearts. These occasions are among the greatest generators of this majestic requirement.\nIbn Abbas, may Allah be pleased with them both, said regarding the meaning of Allah's saying: {What is [the matter] with you that you do not attribute to Allah [due] grandeur} [Nuh: 13]: «What is the matter with you that you do not magnify Allah with His true magnification» (1). The right of reverence is: Magnification in the heart, and the right of magnification in the heart is: Obedience with the limbs (2).\nWhenever the believer ponders the verses of the Quran and the Hadiths of the Sunnah in which there is",
    "foot_note": "1. Narrated by Al-Tabari in Jami' al-Bayan (23/634).\n2. See: Ruh al-Siyam wa Ma'anih, by Dr. Abdul Aziz Kamil p. (89).",
    "book_id": "59"
  },
  {
    "serial_number": "4979646",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 26,
    "volume_number": 1,
    "text": "mention of Allah's Beautiful Names and His Greatness and Majesty; his heart is dislocated out of glorification for Allah and magnifying Him. He recites the saying of Allah, Glory be to Him: {They have not appraised Allah with true appraisal, while the earth entirely will be [within] His grip on the Day of Resurrection, and the heavens will be folded in His right hand} [Az-Zumar: 67], so feelings of magnifying Allah and glorifying Him flow into his heart, overflowing feelings that extract the sediments of attachment to the world and inclination towards it, so there remains no dwelling in the heart for other than the magnification of Allah.\nHe reads His saying, Glory be to Him: {And with Him are the keys of the unseen; none knows them except Him. And He knows what is on the land and in the sea. Not a leaf falls but that He knows it. And no grain is there within the darknesses of the earth and no moist or dry [thing] but that it is [written] in a clear record} [Al-An'am: 59]. He contemplates this verse and pauses at its meanings, so specters of feeling the greatness of this Speech and the greatness of the Speaker, Glory be to Him, are stirred in his heart.\nIt is «the Speech of Allah, and Allah has manifested Himself in it to His servants through His attributes. Sometimes He manifests in the cloak of Awe, Greatness, and Majesty, so necks bow, souls break, voices humble, and pride melts as salt melts in water. And sometimes He manifests in the attributes of Beauty and Perfection, which is the perfection of Names, the beauty of Attributes, and the beauty of Actions",
    "foot_note": "None",
    "book_id": "59"
  },
  {
    "serial_number": "4979647",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 27,
    "volume_number": 1,
    "text": "indicating the perfection of the Essence. So His love exhausts from the servant's heart the entire power of love through the love of what he knew of the attributes of His beauty and the descriptions of His perfection. Thus, his servant's heart becomes empty except for His love. If anyone else wants him to attach that love to them, his heart and innards refuse that with total refusal, as it was said:\nIt is desired from the heart to forget you ... But natures refuse the transporter\nSo love for Him remains natural, not forced. If He manifests with the attributes of Mercy, Birr (Goodness), Gentleness, and Ihsan (Beneficence), the power of hope is aroused from the servant, his hope expands, his longing strengthens, and he journeys to his Lord while the driver of hope leads the caravan of his journey. Whenever hope strengthens, he strives in work, just as the sower, whenever his hope for the yield (1) strengthens, he covers his land with seeds, and if his hope weakens, he falls short in sowing... And if He manifests with the attributes of Might and Pride, his tranquil soul gives what it has reached of humility to His greatness, brokenness to His might, submission to His pride, and khushu' (humble submission) of the heart and limbs to Him. So tranquility and dignity overcome him in",
    "foot_note": "1. Al-Mughall or Al-Ghallah: The income obtained from crops and fruit. See: Al-Nihayah fi Gharib al-Hadith wa al-Athar (3/381), and Lisan al-Arab (11/504).",
    "book_id": "59"
  },
  {
    "serial_number": "4979648",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 28,
    "volume_number": 1,
    "text": "his heart, tongue, limbs, and bearing, and his recklessness, longing [for wrong], and sharpness disappear. The summary of that is that He, Glory be to Him, makes Himself known to the servant through the attributes of His Divinity sometimes, and through the attributes of His Lordship sometimes. Witnessing the attributes of Divinity necessitates special Love, longing to meet Him, intimacy and joy with Him, competing to be close to Him, courting Him with obedience, constantly remembering Him, and fleeing from creation to Him, so He alone becomes his concern to the exclusion of all else. And witnessing the attributes of Lordship necessitates reliance upon Him, neediness for Him, seeking help from Him, and humility, submission, and brokenness to Him» (1).\nIn the radiant Sunnah, the believer reads the Hadith of Abdullah bin Umar, may Allah be pleased with them both, who said: The Messenger of Allah, peace and blessings be upon him, said: «Allah Almighty will fold the heavens on the Day of Resurrection, then He will take them with His Right Hand, then He will say: I am the King, where are the tyrants? Where are the arrogant? Then He will fold the earths with His Left, then He will say: I am the King, where are the tyrants? Where are the arrogant?» (2). So he turns his gaze upon the secrets of this",
    "foot_note": "1. Al-Fawa'id by Ibn al-Qayyim p. (69-70).\n2. Narrated by Al-Bukhari (9/123) No. (7412), and Muslim (4/2148) No. (2788), and the wording is his.",
    "book_id": "59"
  },
  {
    "serial_number": "4979649",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 29,
    "volume_number": 1,
    "text": "Hadith, and lets his heart roam in the shades of its meanings, so a feeling of awe and glorification for the Possessor of Majesty, may His Majesty be exalted, possesses him. These are feelings of elevation and highness, by which the heart rises to the peaks of stations; due to the power of these texts that provoke the heart, so magnifying Allah, fearing Him, and glorifying Him emanate from it.\nHow can the heart not be secluded when it is filled with the magnification of Allah, may He be exalted in His highness?! There is no doubt that if the heart is filled with that, it reaches the core of I'tikaf and its reality.",
    "foot_note": "None",
    "book_id": "59"
  },
  {
    "serial_number": "4979650",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 30,
    "volume_number": 1,
    "text": "The Sixth Trait\nThe Servant's Need for his Lord and his Feeling of Need for Him\nI'tikaf in one of the houses of Allah, an I'tikaf of the heart, is a living image of the scene of the servant's humility and neediness for his Master. Servitude is not complete except «by perfecting the station of humility and submission. The most perfect of creation in servitude are the most perfect of them in humility to Allah, submission, and obedience. The servant is humble to his True Master in every aspect of humility: he is humble to His Might, humble to His Subjugation, humble to His Lordship over him and His disposal [of his affairs], and humble to His kindness to him and His favor upon him» (1).\nWhenever the servant is broken before his Master, he is close to Allah, and to His mercy, victory, and gifts. He guides him, directs him, and mends the break of his heart. «How close is mending to this broken heart! And how near are victory, mercy, and provision to it! And how beneficial is this scene for him and how useful! An atom of this and a breath of it is more beloved to Allah",
    "foot_note": "1. Miftah Dar al-Sa'ada (1/289).",
    "book_id": "59"
  },
  {
    "serial_number": "4979651",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 31,
    "volume_number": 1,
    "text": "than acts of obedience like mountains from those who are proud (1) and impressed with their deeds, knowledge, and states. The most beloved of hearts to Allah Almighty is a heart in which this brokenness is established, and this humility has possessed it. So he bows his head before his Lord, not raising his head to Him out of shyness and shame before Allah» (2).\nIndeed, Allah Almighty loves for His servant to be broken before Him, adhering to the state of humility to Him, always in need of Him. Nay, the heart does not become upright except by neediness for Allah, which is the core of servitude and its spirit. «For the heart is not rectified, nor does it succeed, nor find pleasure, nor joy, nor goodness, nor tranquility, nor assurance except by worshipping its Lord, loving Him, and turning to Him. Even if it attained everything it enjoys of created things, it would not be reassured nor tranquil, because it has an intrinsic poverty (need) for its Lord, inasmuch as He is its Object of Worship, its Beloved, and its Goal» (3).\nWhenever the servant's feeling of his need for Allah deepens, it drives him to turning [to Him], and the submissiveness of the heart, and its devotion to the love of Allah and abundant remembrance, gratitude, praise,",
    "foot_note": "1. Al-Idlal: Mentioning one's gift/favor [boasting]. See: Tahdhib al-Lughah (14/48), Lisan al-Arab (11/248).\n2. Madarij al-Salikin (1/428).\n3. Majmu' al-Fatawa (10/194).",
    "book_id": "59"
  },
  {
    "serial_number": "4979652",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 32,
    "volume_number": 1,
    "text": "glorification, and extolment of Him. This is the trait of the believer in his life, and in all his times, while buying and selling, and with his family and friends. So how about when he is in the heart of the field of competition, and in the nights of mercies and the descent of gifts, while he is secluded with his heart and body in obedience to his Lord, when he reaches «the purity of servitude, the cultivation of the secret between him and Allah, and the sincerity of love; so he wakes up and goes to sleep with no concern other than his Lord. His concern with his Lord has cut him off from all concerns, his desires have disabled all [other] desires, and his love for Him has abrogated from his heart every love for other than Him» (1).\nWhen the believer becomes certain of his need for his Lord, and feels that it is the most important of necessities, he reaches the purity of servitude, and the pleasure of solitude with Allah. When he feels his poverty before Allah, and the dire need to humble himself before Him, and rushes to that with sincerity and collectedness of heart; he will find another world of spiritual bliss, pleasure of the soul, and comfort of the eye. A bliss of worship «that description cannot attain, nor can one who has no share of it perceive, and whoever is more upright in it",
    "foot_note": "1. Tariq al-Hijratayn p. (17).",
    "book_id": "59"
  },
  {
    "serial_number": "4979653",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 33,
    "volume_number": 1,
    "text": "his share of finding pleasure in it is greater» (1), «And if the heart tastes the flavor of worshipping Allah and sincerity to Him, nothing at all is sweeter to it, nor more pleasurable, nor better than that» (2).\nThus, the secret of I'tikaf is adhering to neediness, brokenness, and humility to Allah, and throwing oneself on the thresholds of His servitude, Glory be to Him.",
    "foot_note": "1. Tariq al-Hijratayn p. (59).\n2. Majmu' al-Fatawa (10/187).",
    "book_id": "59"
  },
  {
    "serial_number": "4979654",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 34,
    "volume_number": 1,
    "text": "The Seventh Trait\nVisualizing Allah's Favor and Grace\nAmong the wonders of Quranic upbringing in the early days of the Prophetic Call is what came at the beginning of Surah Al-Muddaththir, when Allah commanded His Prophet, peace and blessings be upon him, to warn and call [to Islam], then said to him: {And do not confer favor to acquire more} [Al-Muddaththir: 6].\nIt is the Divine commandment that strips the servant of arrogance in [his] deeds, and fills his heart with awe and reverence for Allah, and visualizing the scenes of His favors that have flooded the servant's life. There is no path except that Allah has blessings upon His servant in it, which no counter can count, and no book can enumerate.\nThe true believer is the one who perpetually visualizes the scenes of his Lord's favors upon him; because they have surrounded the believer like a collar filling the earth and sky. He is the One who poured upon him blessings, the highest of which is the blessing of guidance, the worth of which the tongue fails to fulfill, where his Lord brought him out by it from the darkness of misguidance to the light of guidance, and from the depth of",
    "foot_note": "None",
    "book_id": "59"
  },
  {
    "serial_number": "4979655",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 35,
    "volume_number": 1,
    "text": "error to the expanse of faith, «O My servants, all of you are astray except those whom I have guided, so seek guidance of Me and I shall guide you» (1). Therefore, Allah reproached those who neglected witnessing His favors, saying: {They consider it a favor to you that they have accepted Islam. Say, \"Do not consider your Islam a favor to me. Rather, Allah has conferred favor upon you that He has guided you to the faith} [Al-Hujurat: 17].\nIt is the Quranic upbringing that cleanses the heart of arrogance, wipes from it the paths (2) of boasting (3), and fills it with reverence for Allah and acknowledgment of His grace and favor. Just as the people of virtue understood this, like Umar, may Allah be pleased with him, when he was stabbed and Abdullah bin Abbas, may Allah be pleased with them both, said to him consoling him: «O Commander of the Faithful, even if that [death] happens, you accompanied the Messenger of Allah, peace and blessings be upon him, and were a good companion, then you parted from him while he was pleased with you. Then you accompanied Abu Bakr and were a good companion, then you parted from him while he was pleased with you. Then you accompanied their companions and were a good companion, and if you part from them, you will part from them while they are pleased with you. He said: «As for what you mentioned of the companionship of the Messenger of Allah, peace and blessings be upon him, and his pleasure, that is a favor from Allah Almighty He conferred upon me. And as for what you mentioned",
    "foot_note": "1. Part of a Hadith Qudsi narrated by Muslim (4/1994) No. (2577).\n2. Al-Masarib: Pastures where animals graze. See: Al-Ayn (7/249).\n3. Al-Idlal: Mentioning one's gift/favor [boasting]. See: Tahdhib al-Lughah (14/48), Lisan al-Arab (11/248).",
    "book_id": "59"
  },
  {
    "serial_number": "4979656",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 36,
    "volume_number": 1,
    "text": "of the companionship of Abu Bakr and his pleasure, that is a favor from Allah, Great is His mention, He conferred upon me. And as for what you see of my anxiety, it is for your sake and the sake of your companions. By Allah, if I had the earth full (1) of gold, I would ransom myself with it from the punishment of Allah Almighty, before I see Him» (2).\nVisualizing the scene of Allah's favor removes the roots of vanity from the heart, washes it from the filth of boasting, and purifies it from impurity so it becomes a clean vessel that is purified by faith, rises with the actions of the heart, and benefits from the actions of the limbs. But if these actions are found with the impurities of vanity and boasting about the deed, they crush their owner's heart completely, leaving no good in it. Hence, Allah said to the one who boasted of his deed, «I have forgiven so-and-so, and I have nullified your deed» (3).\nA person's vanity over his deed and his boasting about it is one of the most heinous and ugly falls. It is an incinerator of acts of obedience, and a breeding ground for vices and various diseases and afflictions.",
    "foot_note": "1. Tila' al-Ard: Its fill. See: Jamharat al-Lughah (2/915), and Al-Sahah (3/1254).\n2. Narrated by Al-Bukhari (5/12) No. (3692).\n3. Hadith Qudsi narrated by Muslim (4/2023) No. (2621), from the Hadith of Jundub, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, from his Lord.",
    "book_id": "59"
  },
  {
    "serial_number": "4979657",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 37,
    "volume_number": 1,
    "text": "The Salaf used to beware of vanity and flee from it. Mutarrif bin Abdullah bin Al-Shikhir said: «To spend the night sleeping and wake up regretful is more beloved to me than to spend the night standing [in prayer] and wake up impressed [with myself]» (1). «For you to spend the night sleeping and wake up regretful is better than spending the night standing and waking up impressed, for the deed of the impressed one does not ascend. And for you to laugh while acknowledging [your sin] is better than to cry while boasting. And the moaning of the sinners is more beloved to Allah than the noise (2) of the boasting glorifiers» (3).\nSo kindle - O Mu'takif - in your mind the spark of feeling Allah's favor and His purification of you, {And if not for the favor of Allah upon you and His mercy, not one of you would have been pure, ever, but Allah purifies whom He wills, and Allah is Hearing and Knowing} [An-Nur: 21].",
    "foot_note": "1. Narrated by Ibn Al-Mubarak in Al-Zuhd (1/151) No. (448), Ahmad in Al-Zuhd p. (195) No. (1342), and Abu Nu'aym in Al-Hilyah (2/200).\n2. It is said: I heard the Zajal of the people, meaning their voices. The meaning is the glorification of the glorifiers. See: Al-Bari' fi al-Lughah (p. 637).\n3. Madarij al-Salikin (1/195).",
    "book_id": "59"
  },
  {
    "serial_number": "4979658",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 38,
    "volume_number": 1,
    "text": "The Eighth Trait\nConfessing Sin and Shortcoming\nA fleeting glance and a quick contemplation of the supplications of the Prophets and the Righteous, their communions and invocations, reveals to you a secret enveloping them, which is their inclusion of the confession of sin and wrongdoing. Here is a record and bright pages of their confession of sin and wrongdoing:\nThis is Adam and Hawwa (Eve) praying: {Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers} [Al-A'raf: 23].\nThis is Musa (Moses), peace be upon him - who is among the Messengers of Determination (Ulu al-Azm) - praying: {My Lord, indeed I have wronged myself, so forgive me,\" and He forgave him. Indeed, He is the Forgiving, the Merciful} [Al-Qasas: 16].\nAnd this is Yunus (Jonah), peace be upon him, beseeching his Lord and communing with Him, confessing his sin, nay, his being among the wrongdoers, {And he called out within the darknesses, \"There is no deity except You;",
    "foot_note": "None",
    "book_id": "59"
  },
  {
    "serial_number": "4979659",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 39,
    "volume_number": 1,
    "text": "exalted are You. Indeed, I have been of the wrongdoers} [Al-Anbiya: 87].\nAnd when Al-Siddiq (Abu Bakr), may Allah be pleased with him, sought guidance from the Prophet, peace and blessings be upon him, and said to him: Teach me a supplication to pray with in my prayer, he said: «Say: O Allah, I have wronged myself greatly, and no one forgives sins except You, so forgive me a forgiveness from You, and have mercy on me, indeed You are the Forgiving, the Merciful» (1).\nIt is the Prophetic upbringing that curbs the servant's arrogance, and makes him perpetually needy of his Lord, perpetually broken before Him, visualizing his sins before his eyes. If this was the advice of the Prophet, peace and blessings be upon him, to Abu Bakr, may Allah be pleased with him - and he is who he is in virtue, leadership, majesty, support for his religion, and defense of his Prophet - then what about our condition when we are the negligent sinners?!\nSo adhere - O Mu'takif - to this scene, confessing your sin, turning to your Lord, certain in your heart that you are among the wrongdoers. And make these blessed invocations",
    "foot_note": "1. Narrated by Al-Bukhari (1/166) No. (834), and Muslim (4/2078) No. (2705) from the Hadith of Abu Bakr Al-Siddiq, may Allah be pleased with him.",
    "book_id": "59"
  },
  {
    "serial_number": "4979660",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 40,
    "volume_number": 1,
    "text": "on your tongue in all your states. And beware of uttering (1) them with your lips while your heart is empty of acknowledging them, for the reality of truthfulness is that the heart corresponds with what flows on the tongue.",
    "foot_note": "1. It is said: Nabasa Nabsan, meaning: He spoke and moved his lips, and spoke with the least speech. See: Al-Muhkam wa al-Muhit (8/530), Lisan al-Arab (6/225).",
    "book_id": "59"
  },
  {
    "serial_number": "4979661",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 41,
    "volume_number": 1,
    "text": "The Ninth Trait\nApproaching Allah with Constant Remembrance (Dhikr)\nIndeed, constant remembrance of Allah, asking His forgiveness, and praising Him is a scene of the heart's devotion, its health, its purity, and its attainment of high ranks of faith {Those who have believed and whose hearts are assured by the remembrance of Allah. Unquestionably, by the remembrance of Allah hearts are assured} [Ar-Ra'd: 28].\nRemembrance of Allah Almighty populates the heart and fills it with light and joy. Rather, losing it puts the heart in darkness and gloom; because «in the heart there is a void and a poverty that nothing can fill at all except the remembrance of Allah Almighty. If it becomes the slogan of the heart, such that it is the rememberer primarily and the tongue follows it, then this is the Remembrance that fills the void and eliminates the poverty. Its owner becomes rich without money, mighty without clan, awe-inspiring without authority. But if he is heedless of the remembrance of Allah Almighty, he is",
    "foot_note": "None",
    "book_id": "59"
  },
  {
    "serial_number": "4979662",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 42,
    "volume_number": 1,
    "text": "the opposite of that: poor despite great wealth, humiliated despite his authority, contemptible despite his large clan» (1).\nThe heart of the believer does not rest, nor find pleasure, nor find taste and intimacy in life except by the remembrance of Allah. Allah described the people of faith and the people of understanding as those who: {remember Allah while standing or sitting or [lying] on their sides and give thought to the creation of the heavens and the earth} [Ali Imran: 191].\nThis is their habit: Constantly mentioning Allah while standing, mentioning Him while sitting, and mentioning Him while on their beds and on their sides. Their hearts became attached to Allah so they sustained the Remembrance in all conditions.\nOh Allah, what a touching Quranic gesture!! {Or [lying] on their sides}; for out of their intense attachment to Allah, they remember Him in this state which is a place of wandering thoughts, heedlessness, or fatigue. Yet, these are people whose intense attachment to Allah Almighty reached such an extent that they do not forget Him in this state where absentmindedness usually prevails.",
    "foot_note": "1. Al-Wabil al-Sayyib p. (139-140).",
    "book_id": "59"
  },
  {
    "serial_number": "4979663",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 43,
    "volume_number": 1,
    "text": "It is a heart in which faith has become firmly established and settled, producing an effect on the tongue through constant movement in Dhikr: while standing, reclining, and sitting; while entering and exiting; while eating and drinking; while awake and at sleep; in residence and travel; in the night and the day. It is permanently in need of Allah and attached to Him, not neglecting [Him] for an hour or less than that. If it neglects or slackens, it finds heaviness in the soul and a feeling of deficiency that nothing fills except reviewing the path and the heart returning to its spring and bliss. Then, its lights shine and the features of its face beam.\nThe Prophet, peace and blessings be upon him, said: «O people, repent to Allah, for I repent to Him in a day one hundred times» (1). And in a narration: «Indeed, [my heart] becomes clouded (2), and I ask forgiveness",
    "foot_note": "1. Narrated by Muslim (4/2075) No. (2702) (42) from the Hadith of Al-Agharr Al-Muzani, may Allah be pleased with him.\n2. Al-Nawawi said in his explanation of Sahih Muslim (17/23-24): «His saying, peace and blessings be upon him: «Indeed, [my heart] becomes clouded (yughanu)» Linguists said: Al-Ghayn - with the dotted Ghayn - and Al-Ghaym (clouds) have the same meaning. The meaning here is: what covers the heart. Al-Qadi said: It was said: The meaning is intervals and lapses from Dhikr which was his habit to continue, so if he slackened from it or neglected it, he counted that as a sin and asked forgiveness for it. He said: And it was said it is his concern due to his Ummah and what he was shown of its conditions after him, so he asks forgiveness for them. And it was said: Its cause is his preoccupation with looking into the interests of his Ummah and their affairs, fighting the enemy, managing him, winning over hearts, and the like. So he becomes occupied with that from his great station, so he sees it as a sin relative to his great status...».",
    "book_id": "59"
  },
  {
    "serial_number": "4979664",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 44,
    "volume_number": 1,
    "text": "from Allah in a day one hundred times» (1).\nHe, peace and blessings be upon him, said: «By Allah, I ask forgiveness from Allah and repent to Him in a day more than seventy times» (2).\nFrom Ali bin Abi Talib, may Allah be pleased with him, that Fatima came to the Prophet, peace and blessings be upon him, asking him for a servant. He said: «Shall I not tell you of something better for you than that? Glorify Allah (Tasbih) at your sleep thirty-three times, Praise Allah (Tahmid) thirty-three times, and Magnify Allah (Takbir) thirty-four times.» Ali said: «I have not left it since I heard it from the Prophet, peace and blessings be upon him. It was said to him: Not even the night of Siffin? He said: Not even the night of Siffin» (3).\nFrom Abu Huraira, may Allah be pleased with him, who said: «I glorify Allah (Tasbih) every day twelve thousand times, according to the amount of my blood money (Diyah)» (4).\nAl-Hafiz Abdul Ghani mentioned in «Al-Kamal» in the biography of Abu Darda, may Allah be pleased with him, that he used to glorify Allah (Tasbih) one hundred thousand times a day (5).",
    "foot_note": "1. Also narrated by Muslim (4/2075) No. (2702) (41).\n2. Narrated by Al-Bukhari (8/67) No. (6307) from the Hadith of Abu Huraira, may Allah be pleased with him.\n3. Narrated by Al-Bukhari (7/65) No. (5362), and Muslim (4/2091) No. (2727).\n4. Narrated by Ibn Abi Shaybah in his Musannaf (5/345) No. (26733), and Abu Nu'aym in Ma'rifat al-Sahabah (4/1891), No. (4762).\n5. See: Al-Hawi lil-Fatawi by Al-Suyuti (2/5), and Shadharat al-Dhahab (2/118).",
    "book_id": "59"
  },
  {
    "serial_number": "4979665",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 45,
    "volume_number": 1,
    "text": "Indeed, Allah Almighty did not only command the people of faith to remember Him, but He commanded them to do so abundantly. He said: {O you who have believed, remember Allah with much remembrance (41) And exalt Him morning and afternoon} [Al-Ahzab: 41, 42]. And He, Mighty and Majestic, said: {And remember Allah much that you may succeed} [Al-Jumu'ah: 10].\nThe Prophet, peace and blessings be upon him, explained that those who remember Allah much are the foremost people to rewards. He, peace and blessings be upon him, said: «The Mufarridun have gone ahead.» They said: And who are the Mufarridun, O Messenger of Allah? He said: «The men who remember Allah often and the women who do so» (1). Mufarridun is the plural of Mufarrid, and the intended meaning is the one solitary and devoted to Allah with his heart and tongue due to his frequent remembrance.\nDue to the majesty of the status of Dhikr and its great effect, it is the spirit of deeds and the greatest of them, as He Almighty said: {And the remembrance of Allah is greater. And Allah knows that which you do} [Al-Ankabut: 45] (2).\nNothing humbles the tongue and moistens it, and polishes faith and elevates it; like the remembrance of Allah, Glory be to Him and Most High. Especially the one who maintains portions of Adhkar (remembrances) with which he populates moments and revives the heart. The righteous have concurred and agreed that",
    "foot_note": "1. Narrated by Muslim (4/2062), No. (2676) from the Hadith of Abu Huraira, may Allah be pleased with him.\n2. There is a difference among commentators regarding the meaning of the verse, but this is one of the opinions.",
    "book_id": "59"
  },
  {
    "serial_number": "4979666",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 46,
    "volume_number": 1,
    "text": "it is the weapon of the believer which pierces the veils of heedlessness, and opens the locks of the heart in every age. So how about an age in which the vicissitudes of time and the calamities of days have intertwined?!\nIn the nights of the Ten Days - through the breezes of early dawn, and the fragrance of seeking forgiveness - a precious opportunity looms for the reformation of the heart: where there is clarity, tranquility, and moments of Divine descent. Indeed, this clarity, just as it renews faith, it renews innocence from hypocrisy. For the hypocrites are the most heedless of people and the least of them in remembering Allah, {And when they stand for prayer, they stand lazily, showing [themselves to] the people and not remembering Allah except a little} [An-Nisa: 142]. The duty of the believer is to differ from the hypocrites by frequent remembrance of Allah. Abu Huraira, may Allah be pleased with him, said: «Whoever remembers Allah much; becomes innocent of hypocrisy» (1).\nSo moisten your tongue - O blessed one - with the remembrance of Allah, for nothing is more reforming for the heart than that, and nothing weighs heavier in the Balance on the Day of Resurrection like Dhikr.",
    "foot_note": "1. See: Lisan al-Mizan (1955).",
    "book_id": "59"
  },
  {
    "serial_number": "4979667",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 47,
    "volume_number": 1,
    "text": "The Tenth Trait\nApproaching Allah with Much Supplication (Dua)\nOne of the most majestic acts of worship in which the humility of the servant appears before his Lord is: Supplication. Allah Almighty said: {Call upon your Lord in humility and privately} [Al-A'raf: 55]. And He said: {Indeed, they used to hasten to good deeds and supplicate Us in hope and fear, and they were to Us humbly submissive} [Al-Anbiya: 90].\nThe worship of Dua in the last ten days of Ramadan, when the servant is secluded (Mu'takif), has a taste known to those who humble themselves and break before Allah, the weeping ones, those who make themselves weep, where they feel nearness to their Master and the promise of answer, {And when My servants ask you concerning Me, indeed I am near. I respond to the invocation of the supplicant when he calls upon Me. So let them respond to Me [by obedience] and believe in Me that they may be [rightly] guided} [Al-Baqarah: 186],",
    "foot_note": "None",
    "book_id": "59"
  },
  {
    "serial_number": "4979668",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 48,
    "volume_number": 1,
    "text": "And in the arrival of this noble verse in the context of Fasting, interwoven between it and the mention of I'tikaf, is a great gesture clarifying the status of the worship of Dua when the servant is fasting and secluded.\nIt is a worship that shines in these nights in which the servant is broken, so the heart softens, the spirit flutters, desires dry up, and the self is broken. This becomes a qualification for the servant to be responsive to Allah, { ... So let them respond to Me}, so Allah responds to him. For the answer to supplication is always coupled with the brokenness of the heart, the weakness of the self, and its liberation from the pressures of desires. This is not available in any state of the human as much as it is available in the state of Fasting and I'tikaf (1).\nThis situation is like other situations where the servant's submission and brokenness before his Lord is recommended. Al-Tabarani narrated from the Hadith of Ibn Abbas, may Allah be pleased with them both, who said: «I saw the Messenger of Allah, peace and blessings be upon him, supplicating at Arafah, with his hands to his chest like the feeding request of a poor person» (2).",
    "foot_note": "1. See: Ruh al-Siyam wa Ma'anih p. (116).\n2. Narrated by Al-Tabarani in Al-Mu'jam Al-Awsat (3/189) No. (2892), Abu Nu'aym in Hilyat al-Awliya (8/213), and Al-Bayhaqi in Al-Sunan Al-Kubra (5/190), and its chain is weak.",
    "book_id": "59"
  },
  {
    "serial_number": "4979669",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 49,
    "volume_number": 1,
    "text": "Some of the righteous used to sit at night calm, bowing their heads, extending their hands like the state of a beggar. This is one of the most perfect forms of humility, tranquility, and neediness before Allah. The neediness of the heart in supplication, its brokenness before Allah Mighty and Majestic, and its feeling of intense poverty towards Him and need for Him is a likely cause for an answer. The answer is proportional to this burning desire and poverty.\nIt came in «Jami' Al-Tirmidhi» and others from the Prophet, peace and blessings be upon him, who said: «Indeed, Allah does not answer a supplication from a heedless, distracted heart» (1).\nAmong the beautiful states of Dua is showing humility with the tongue in the request itself, along with insistence (Ilhah) in it. Al-Awza'i, may Allah have mercy on him, said: «It is said that the best Dua is insistence upon Allah and humbling oneself before Him» (2).",
    "foot_note": "1. Narrated by Al-Tirmidhi (5/394) No. (3479), Al-Tabarani in Al-Awsat (5/211) No. (5109), and Al-Hakim in Al-Mustadrak (1/670) No. (1817) from the Hadith of Abu Huraira, may Allah be pleased with him. Al-Tirmidhi said: «A Gharib (strange) Hadith».\n2. Narrated by Al-Bayhaqi in Shu'ab al-Iman (2/364), see: Al-Tamhid by Ibn Abd al-Barr (5/346).",
    "book_id": "59"
  },
  {
    "serial_number": "4979670",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 50,
    "volume_number": 1,
    "text": "And in Al-Tabarani with a chain in which there is disagreement, from Ibn Abbas, may Allah be pleased with them both, that the Prophet, peace and blessings be upon him, supplicated on the Day of Arafah saying: «O Allah, You hear my speech, see my place, and know my secret and my open [affairs]. Nothing of my affair is hidden from You. I am the miserable, the poor, the seeker of help, the seeker of protection, the fearful, the pitying, the acknowledger, the confessor of his sin. I ask You the request of the poor, and I beseech You the beseeching of the humiliated sinner, and I call upon You the call of the fearful, the afflicted; one whose neck has humbled to You, whose eyes have overflowed [with tears] for You, whose body has submitted to You, and whose nose has rubbed in dust for You. O Allah, do not make me wretched in my supplication to You, and be Kind and Merciful to me, O Best of those asked, and O Best of Givers» (1).\nTherefore, Dua is the core of devotion and pure worship; because of what it contains of complete neediness for Allah and humility before Him. It is the most beneficial of the heart's worships and the most influential upon it, especially if the supplicant's heart is present and he visualizes the meanings of what he prays for. If those invocations and beseechings are from what Allah Mighty and Majestic informed of the supplications of the elite of His creation, they are the most effective thing for the heart; because of what they contain of comprehensive supplication, sincerity of humility, and visualizing the meanings of",
    "foot_note": "1. Narrated by Al-Tabarani in Al-Kabir (11/174) No. (11405), and in Al-Dua p. (274) No. (877), and there is weakness in its chain.",
    "book_id": "59"
  },
  {
    "serial_number": "4979671",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 51,
    "volume_number": 1,
    "text": "Lordship (Rububiyyah). For this reason, the Prophets used to begin their supplications by saying: «Rabbana» (Our Lord). Most Quranic supplications also come beginning with seeking means (Tawassul) to Allah through His Lordship. When the supplicant calls upon Allah seeking means through His Lordship, it is good for him to visualize the meaning of General Nurturing/Lordship, which is: Creation and Management, and the meaning of Special Nurturing, which is: His guardianship of the best of His creation, His kindness to them, and His reformation of their religion and worldly life, due to their turning to their Lord and their humbleness before Him.\nIt is recommended for him to supplicate with the supplications of the Prophets; for they are comprehensive supplications. And it is good for the supplicant to supplicate with the supplication of those firmly grounded in knowledge; because He, Glory be to Him, when He praised them, He mentioned their supplication: {Our Lord, let not our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower} [Ali Imran: 8]. So they sought means to Allah through His Lordship to grant them uprightness of hearts and their steadfastness on what pleases Allah, and preserving them from deviation and turning back from guidance (1).",
    "foot_note": "1. See: Al-Mawahib Al-Rabbaniyyah min Al-Ayat Al-Quraniyyah by Al-Sa'di p. (56-58).",
    "book_id": "59"
  },
  {
    "serial_number": "4979672",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 52,
    "volume_number": 1,
    "text": "The Eleventh Trait\nIkhbat (Humility) and Khushu' (Submissiveness) (1)\nAllah, Glory be to Him and Most High, praised in His Book those who are humble (Mukhbitin) to Him, broken before His greatness, and submissive to His pride. He, Glory be to Him, said: {And give good tidings to the humble (34) Who, when Allah is mentioned, their hearts are fearful} [Al-Hajj: 34, 35]. And He Almighty said: {Indeed, they used to hasten to good deeds and supplicate Us in hope and fear, and they were to Us humbly submissive} [Al-Anbiya: 90]. And He Almighty said: {And the men who are humble and the women who are humble} until He said: {Allah has prepared for them forgiveness and a great reward} [Al-Ahzab: 35].\nAnd He described the believers with Khushu' (humble submission) to Him in their most noble worships which they",
    "foot_note": "1. See regarding this trait: Al-Khushu' fi Al-Salah by Ibn Rajab p. (11-28).",
    "book_id": "59"
  },
  {
    "serial_number": "4979673",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 53,
    "volume_number": 1,
    "text": "maintain. He Almighty said: {Certainly will the believers have succeeded (1) They who are during their prayer humbly submissive} [Al-Mu'minun: 1-2]. And He, Glory be to Him and Most High, praised those fearful and pitying of Allah's punishment, saying Mighty and Majestic: {Indeed, they who are apprehensive from fear of their Lord} [Al-Mu'minun: 57]. And He, Majesty is His, said: {Who fear their Lord unseen, while they are of the Hour apprehensive} [Al-Anbiya: 49].\nWhen the night darkens, they endure it ... So it unveils itself from them while they are bowing\nFear chased away their sleep and they stood ... While the people of safety in the world are asleep\n...\nTheir mattresses are but the right sides of their garments ... And their pillows are but sheets and arms\nTheir night in them is but abstaining from sin ... And their sleep is but a terrified nap\nTheir colors are yellow as if their faces ... Have bodies on them saturated with Wars (yellow plant)\nThe origin of Khushu' is: softness of the heart, its tenderness, stillness, and submission. If the heart is submissive, the submission of all limbs and organs follows it; because they are subordinate to it, as he, peace and blessings be upon him, said: «Beware! There is a piece of flesh in the body, if it becomes good, the whole",
    "foot_note": "None",
    "book_id": "59"
  },
  {
    "serial_number": "4979674",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 54,
    "volume_number": 1,
    "text": "body becomes good, and if it gets spoiled, the whole body gets spoiled, and that is the heart» (1).\nSo if the heart submits, the hearing, sight, face, and all other organs submit, and what originates from them, even speech. For this reason, the Prophet, peace and blessings be upon him, used to say in his bowing in prayer: «My hearing, my sight, my brain, my bone, and my sinew have submitted to You» (2).\nOne of the predecessors saw a man fiddling with his hand in prayer, so he said: «If this man's heart was submissive, his limbs would have been submissive» (3).\nAllah Almighty described the earth in His Noble Book with Khushu' (stillness), saying: {And of His signs is that you see the earth stilled (Khashi'ah), but when We send down upon it rain, it quivers and swells} [Fussilat: 39]. So its quivering and swelling - which is its rising - removes its Khushu'. This indicates that the Khushu' it was upon is its stillness",
    "foot_note": "1. Narrated by Al-Bukhari (1/20) No. (52), and Muslim (3/1219) No. (1599) from the Hadith of Al-Nu'man bin Bashir, may Allah be pleased with him.\n2. Narrated by Muslim (1/534) No. (771) from the Hadith of Ali bin Abi Talib, may Allah be pleased with him.\n3. Narrated by Ibn Abi Shaybah in his Musannaf (2/86) No. (6787), Ibn Al-Mubarak in Al-Zuhd (1/419) No. (1188), and Abd al-Razzaq in his Musannaf (2/266) No. (3308) from the saying of Saeed bin Al-Musayyib, may Allah have mercy on him.",
    "book_id": "59"
  },
  {
    "serial_number": "4979675",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 55,
    "volume_number": 1,
    "text": "and lowness. Likewise, the heart, when it submits, its bad thoughts and desires arising from following whims become still, so it breaks and submits to Allah Mighty and Majestic. Thus, whatever pride (Ba'w) (1), elevation, arrogance, and self-aggrandizement was in it disappears. Whenever that happens in the heart, the limbs, organs, and all movements submit, even the voice. Allah Almighty described voices with Khushu' in His saying: {And voices will be stilled for the Most Merciful, so you will not hear except a whisper} [Ta-Ha: 108]. The Khushu' of voices is their stillness and lowering after their elevation.\nKhushu' should be genuine, not forced. Whenever a person forces the appearance of Khushu' in his limbs and extremities - while his heart is empty and void of Khushu' - that is the Khushu' of hypocrisy. It is what the Salaf used to seek refuge from, as some of them said: «Seek refuge in Allah from the Khushu' of hypocrisy. They said: And what is the Khushu' of hypocrisy? He said: That you see the body",
    "foot_note": "1. Al-Ba'w: The intended meaning is pride/boasting. See: Al-Sahah (6/2278), Maqayis al-Lughah (1/328), Al-Nihayah fi Gharib al-Hadith (1/96) (Ba'w).",
    "book_id": "59"
  },
  {
    "serial_number": "4979676",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 56,
    "volume_number": 1,
    "text": "submissive while the heart is not submissive» (1).\nTrue Khushu' is what produces an effect, influence, and softness in the heart, as Allah mentioned in describing the scholars from the People of the Scripture before us. He, Glory be to Him, said: {Indeed, those who were given knowledge before it - when it is recited to them, they fall upon their faces in prostration (107) And they say, \"Exalted is our Lord! Indeed, the promise of our Lord has been fulfilled.\" (108) And they fall upon their faces weeping, and the Qur'an increases them in humble submission} [Al-Isra: 107-109].\nThese verses contained praise for those in whom hearing the verses of Allah caused affection, submission, and weeping. In contrast to that, He, Glory be to Him, threatened those with hard hearts, saying Mighty and Majestic: {Then woe to those whose hearts are hardened against the remembrance of Allah. Those are in manifest error (22) Allah has sent down the best statement: a consistent Book wherein is reiteration. The skins shiver therefrom of those who",
    "foot_note": "1. Narrated by Ibn Al-Mubarak in Al-Zuhd (1/46) No. (143), Ibn Abi Shaybah in Al-Musannaf (7/243) No. (35711), Imam Ahmad in Al-Zuhd p. (117) No. (762), and Al-Bayhaqi in Shu'ab al-Iman (9/220) No. (6567) as Mawquf on Abu Darda, may Allah be pleased with him. And Al-Bayhaqi narrated it in Al-Shu'ab (9/220) No. (6568) from the Hadith of Abu Bakr, may Allah be pleased with him, as Marfu', and its chain is weak.",
    "book_id": "59"
  },
  {
    "serial_number": "4979677",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 57,
    "volume_number": 1,
    "text": "fear their Lord; then their skins and their hearts relax at the remembrance of Allah} [Az-Zumar: 22-23]. The relaxing of hearts is the removal of their hardness due to the occurrence of Khushu' and softness in them.\nAllah reproached those whose hearts do not submit to hearing His Book, He Almighty said: {Has the time not come for those who have believed that their hearts should become humbly submissive at the remembrance of Allah and what has come down of the truth? And let them not be like those who were given the Scripture before, and a long period passed over them, so their hearts hardened; and many of them are defiantly disobedient} [Al-Hadid: 16].\nIbn Masud, may Allah be pleased with him, said: «There was not between our Islam and Allah reproaching us with this verse except four years» (1). And in a narration: «So we turned to one another: What have we done?! What have we manufactured?!» (2) meaning: some of them began reproaching others.\nAs for the greatness of the Quran and the power of its effect on the souls of the submissive believers, it is something the Salaf testified to. Abu Imran Al-Jawni, may Allah have mercy on him, said: «By Allah, our Lord has directed to us in this Quran [matters] that if He had directed to",
    "foot_note": "1. Narrated by Muslim (4/2319) No. (3027).\n2. Narrated by Abu Ya'la in his Musnad (9/167) No. (5256), and it is a weak addition.",
    "book_id": "59"
  },
  {
    "serial_number": "4979678",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 58,
    "volume_number": 1,
    "text": "the mountains, He would have obliterated and bent them» (1).\nMalik bin Dinar, may Allah have mercy on him, used to read this verse then say: «I swear to you, no servant believes in this Quran except that his heart splits» (2).\nIt was narrated from Al-Hasan, may Allah have mercy on him, that he said: «O son of Adam, if Satan whispers a sin to you, or you speak to yourself about it, remember then what Allah has burdened you with of His Book, which if the anchored mountains carried, they would have humbled and split. Have you not heard Him say: {If We had sent down this Qur'an upon a mountain, you would have seen it humbled and coming apart from fear of Allah. And these examples We present to the people that perhaps they will give thought} [Al-Hashr: 21]» (3).\nAllah, Glory be to Him, only struck examples for you so that you may reflect on them, take heed by them, and be deterred from His disobedience, Mighty and Majestic is He. You, O son of Adam, are more worthy to humble yourself to the remembrance of",
    "foot_note": "1. Narrated by Abu Nu'aym in Al-Hilyah (2/311), see: Al-Khushu' fi Al-Salah by Ibn Rajab p. (19).\n2. Narrated by Imam Ahmad in Al-Zuhd p. (258) No. (1859), and Abu Nu'aym in Hilyat al-Awliya (2/378).\n3. See: Al-Khushu' fi Al-Salah by Ibn Rajab p. (19).",
    "book_id": "59"
  },
  {
    "serial_number": "4979679",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 59,
    "volume_number": 1,
    "text": "Allah, and what He burdened you with of His Book and gave you of wisdom; because the Account is upon you and for you is Paradise or Hell.\nThe Prophet, peace and blessings be upon him, used to seek refuge in Allah from a heart that does not submit, as in the Hadith of Zaid bin Arqam, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, used to say: «O Allah, I seek refuge in You from knowledge that does not benefit, from a heart that does not submit (Yakhsha'), from a soul that is not satisfied, and from a supplication that is not answered» (1).\nTherefore, Allah Almighty legislated for His servants types of worship in which the submission of bodies appears, originating from the heart's submission, humility, and brokenness. Among the greatest worships in which the submission of bodies to Allah Almighty appears is Prayer. Allah Almighty praised the submissive ones in it by His saying Mighty and Majestic: {Certainly will the believers have succeeded (1) They who are during their prayer humbly submissive} [Al-Mu'minun: 1, 2].\nAmong the places of submission: Prostration (Sujud). It is the greatest [posture] in which the servant's humility to his Lord Mighty and Majestic appears, where the servant places the most honorable of his organs, the dearest",
    "foot_note": "1. Narrated by Muslim (4/2088) No. (2722).",
    "book_id": "59"
  },
  {
    "serial_number": "4979680",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 60,
    "volume_number": 1,
    "text": "to him, and the highest of them, in the lowest possible position, placing it in the dust, covered in dust. This is followed by the heart's brokenness, humility, and submission to Allah Mighty and Majestic.\nFor this reason, the reward of the believer if he does that is that Allah Mighty and Majestic brings him closer to Him. Allah Almighty said: {But prostrate and draw near} [Al-Alaq: 19]. And he, peace and blessings be upon him, said: «The closest a servant is to his Lord is while he is prostrating» (1).\nProstration was something the arrogant polytheists disdained to do in worship of Allah Mighty and Majestic. Some of them used to say: I hate to prostrate so that my posterior becomes higher than me. Some of them would take a handful of pebbles and raise it to their forehead, contenting themselves with that instead of prostration (2).\nIblis was only expelled by Allah when he was too arrogant to prostrate to the one whom Allah commanded him to prostrate to. For this reason, he cries when the believer prostrates and says: The son of Adam was commanded",
    "foot_note": "1. Narrated by Muslim (1/350) No. (482) from the Hadith of Abu Huraira, may Allah be pleased with him.\n2. Narrated by Al-Bukhari (2/40), No. (1067), and Muslim (1/405) No. (576) from the Hadith of Abdullah bin Masud, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, that he recited {By the Star} and prostrated in it, and those with him prostrated, except an old man who took a handful of pebbles or dirt and raised it to his forehead and said: This is sufficient for me. Abdullah said: «I saw him afterwards killed as a disbeliever».",
    "book_id": "59"
  },
  {
    "serial_number": "4979681",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 61,
    "volume_number": 1,
    "text": "to prostrate so he did and for him is Paradise, and I was commanded to prostrate so I disobeyed and for me is the Fire (1).\nFrom the perfection of the servant's submission to Allah Mighty and Majestic and his humility to Him in his bowing and prostration, is that when he humbles himself to his Lord by bowing and prostrating, he describes his Lord then with the attributes of Might, Pride, Greatness, and Highness. As if he is saying: Humility and lowliness are my description, and Highness, Greatness, and Pride are Your description. For this reason, it was legislated for the servant in his bowing to say: \"Glory be to my Lord the Great\", and in his prostration: \"Glory be to my Lord the Most High\".\nSo whenever the servant's heart is filled with submission, humility, submissiveness, and brokenness, he reaches the core of worship, achieves its purpose, and attains its goal.",
    "foot_note": "1. Narrated by Muslim (1/87) No. (81), from the Hadith of Abu Huraira, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: «If the son of Adam reads the verse of Prostration and prostrates, Satan withdraws weeping, saying: Woe to me, the son of Adam was commanded to prostrate so he prostrated and for him is Paradise, and I was commanded to prostrate so I refused and for me is the Fire».",
    "book_id": "59"
  },
  {
    "serial_number": "4979682",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "When the Heart Retreats",
    "edition": "First, 1435 AH - 2014 AD.",
    "publisher": "Scientific Elites Center - Qassim - Buraydah.",
    "page_number": 62,
    "volume_number": 1,
    "text": "Finally:\nThese are eleven traits, through which the successful one reaches the spirit of I'tikaf, its core, and its purpose. This goal is not only in I'tikaf, but in all acts of worship.\nMay Allah grant me and you perpetual truthfulness, and bestow upon me and you the adherence to needing Him, and brokenness before Him. And may He grant us success for the perpetual retreat of hearts and turning to Him. We seek refuge in Allah from humility except to Him, from brokenness except before Him, and from resorting except to Him, {And my success is not but through Allah. Upon him I have relied, and to Him I return} [Hud: 88].\n\nDr. Abdul Rahman bin Abdul Aziz Al-Aql\nBuraydah - Qassim\n5/9/1435 AH\nFor contact: Mobile: 0504883988 - 0591100113 - 0535600013\nEmail: al.agal@hotmail.com al_khaleefa@hotmail.com",
    "foot_note": "None",
    "book_id": "59"
  }
]