[
  {
    "text": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "category_id": "18",
    "category": "General Fiqh",
    "new_page_number": 1
  },
  {
    "text": "sn: 4516\nbook_title: مناسك الحج والعمرة\nbook_link: https://shamela.ws/book/12090\nbook_id: 12090\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: مكتبة المعارف\nedition: الأولى\npages: 61\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الفقه العام\ncategory_id: 18",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "category_id": "18",
    "category": "General Fiqh",
    "new_page_number": 2
  },
  {
    "serial_number": "4365828",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: General Jurisprudence. Book: Manasik Al-Hajj wa Al-Umrah. Author: Abu Abdul Rahman Muhammad Nasir al-Din, bin Al-Hajj Nuh bin Najati bin Adam, Al-Ashqudari Al-Albani (Died 1420 AH). Publisher: Maktabat Al-Ma'arif. Edition: First. Number of Pages: 61 [Book pagination matches the printed version]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nBook: Manasik Al-Hajj wa Al-Umrah. Author: Abu Abdul Rahman Muhammad Nasir al-Din, bin Al-Hajj Nuh bin Najati bin Adam, Al-Ashqudari Al-Albani (Died 1420 AH). Publisher: Maktabat Al-Ma'arif. Edition: First. Number of Pages: 61 [Book pagination matches the printed version]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Abu Abdul Rahman Muhammad Nasir al-Din, bin Al-Hajj Nuh bin Najati bin Adam, Al-Ashqudari Al-Albani (Died 1420 AH). Publisher: Maktabat Al-Ma'arif. Edition: First. Number of Pages: 61 [Book pagination matches the printed version]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\n[Book pagination matches the printed version]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.",
    "foot_note": "None",
    "book_id": "12090",
    "new_page_number": 3
  },
  {
    "serial_number": "4365829",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 5,
    "volume_number": 1,
    "text": "Introduction... In the name of Allah, the Most Gracious, the Most Merciful. Indeed, all praise is due to Allah; we praise Him, seek His help, and ask for His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whomever Allah guides, none can misguide, and whomever He leads astray, none can guide. I bear witness that there is no deity except Allah alone, without any partner, and I bear witness that Muhammad is His servant and Messenger. As for what follows: The desire to facilitate knowledge for the general public called for simplifying the rituals of Hajj by extracting them from my book 'Hajjat al-Nabi sallallahu alayhi wa sallam' (The Hajj of the Prophet, peace and blessings of Allah be upon him) as narrated by Jabir, may Allah be pleased with him. This is done in the same manner I followed in my treatise 'Talkhis Sifat Salat al-Nabi sallallahu alayhi wa sallam' (Summary of the Description of the Prophet's Prayer). However, I have added important additions to it, supplementing rituals that were not mentioned in the description of the Prophet's Hajj nor in the commentary upon it. I have paid special attention to extracting (Takhrij) the sources of these additions, as well as other benefits I included, following the method we have used in all our other books by mentioning the grade of the hadith and its source, but in a concise manner, often referring to my other books, both printed and unprinted. As for what was already in the book 'Al-Hajjah', I did not concern myself with extracting its sources, sufficing with the fact that it is available in the hands of the noble readers. So, whoever among them wishes to verify anything from it, it is easy for him to refer to it. I indicate references to it with the word \"The Original\" (Al-Asl). To complete the benefit, we have transferred from it, with some abbreviation, the appendix regarding the innovations (Bid'ah) of Hajj and visiting [the Prophet's Mosque]. And I named it 'Manasik Al-Hajj wa Al-Umrah fi Al-Kitab wa Al-Sunnah wa Athar Al-Salaf' (The Rituals of Hajj and Umrah in the Book, the Sunnah, and the Narrations of the Predecessors).",
    "foot_note": "None",
    "book_id": "12090",
    "new_page_number": 4
  },
  {
    "serial_number": "4365830",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 6,
    "volume_number": 1,
    "text": "I ask Allah, Blessed and Exalted, to make all my work righteous, to make it purely for His Face, and not to allow anyone else to have a share in it. Damascus, 21 Sha'ban, 1395 AH. Muhammad Nasir al-Din Al-Albani * * *",
    "foot_note": "None",
    "book_id": "12090",
    "new_page_number": 5
  },
  {
    "serial_number": "4365831",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 7,
    "volume_number": 1,
    "text": "Advice before Hajj: These are pieces of advice and benefits I present to our brothers, the pilgrims, before Hajj: First: The pilgrim must fear his Lord and strive to the best of his ability not to fall into what Allah has forbidden him, due to His saying: {Hajj is [during] well-known months, so whoever has made Hajj obligatory upon himself therein [by entering the state of Ihram], there is [to be for him] no sexual relations and no disobedience and no disputing during Hajj} [Al-Baqarah: 197], and his saying, peace and blessings of Allah be upon him: \"Whoever performs Hajj and does not commit sexual relations (Rafath) nor disobedience (Fusuq), returns from his sins as the day his mother gave birth to him.\" For if he does that, his Hajj will be accepted (Mabrur), and the Messenger of Allah, peace and blessings of Allah be upon him, says: \"The accepted Hajj has no reward but Paradise\" (1). Therefore, warning must be given against what some have been afflicted with due to their ignorance or misguidance: A - Associating partners with Allah the Exalted (Shirk). We have seen many of them falling into Shirk, such as seeking deliverance (Istighatha) from other than Allah, seeking help from the dead among the Prophets or the righteous, calling upon them instead of Allah, and swearing by them out of veneration for them, thereby nullifying their Hajj. Allah the Exalted said: {If you should associate [anything] with Allah, your work would surely become worthless} [Az-Zumar: 65]. B - Some of them beautifying themselves by shaving the beard, for it is a sin (Fisq) involving four violations mentioned in \"The Original\". C - Men wearing gold rings, for it is forbidden (Haram), especially the type called today the \"engagement ring\", for it also involves imitating the Christians. Second: Everyone who intends to perform Hajj and has not driven the sacrificial animal (Hady) (2), must intend",
    "foot_note": "1. 1 Narrated by the two Sheikhs (Bukhari and Muslim) and others from the hadith of Abu Huraira, may Allah be pleased with him, and it is extracted in 'Silsilat Al-Ahadith Al-Sahihah' number \"1200\" and 'Al-Irwa' \"769\". \n2. 2 As is the case with the general pilgrims today, for it is rare that one of them drives his sacrificial animal from outside the sanctuary as the Prophet, peace and blessings of Allah be upon him, did. So whoever does it, there is no objection against him. As for the one who does not drive the sacrificial animal but performs Qiran (combining Hajj and Umrah) or Ifrad (Hajj only), he has opposed his action, peace and blessings of Allah be upon him, and his command, even if people dislike it, as Ibn Abbas said. Narrated by Muslim \"4 / 58\" and Ahmad \"1 / 278 and 342\".",
    "book_id": "12090",
    "new_page_number": 6
  },
  {
    "serial_number": "4365832",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 8,
    "volume_number": 1,
    "text": "to perform Hajj of Tamattu' due to the command of the Prophet, peace and blessings of Allah be upon him, to his companions regarding it at the end, and due to his anger at his companions who did not hasten to comply with his order to annul the Hajj into an Umrah, and due to his saying: \"Umrah has entered into Hajj until the Day of Judgment.\" And when some of the Companions said to him: \"Do you see this Tamattu' of ours for this year only or forever?\" The Prophet, peace and blessings of Allah be upon him, intertwined his fingers one into another and said: \"Umrah has entered into Hajj until the Day of Judgment. No, rather for eternity of eternities. No, rather for eternity of eternities\" (1). Because of that, he, peace and blessings of Allah be upon him, ordered Lady Fatimah and his wives, may Allah be pleased with all of them, to decompose (Tahallul) after the Umrah of Hajj. Therefore, Ibn Abbas used to say: \"Whoever circumambulates the House has decomposed (become Halal); [this is] the Sunnah of your Prophet, even if you dislike it\" (2). So, everyone who has not driven the sacrificial animal must assume Ihram for Umrah during the three months of Hajj. Whoever assumed Ihram for Hajj as Mufrid (Hajj only) or Qarin (combined) and then the command of the Messenger, peace and blessings of Allah be upon him, regarding annulment (Faskh) reaches him, he should hasten to do it, even if it is after arriving in Mecca and his Sa'y between Safa and Marwa. He should decompose and then assume Ihram for Hajj on the Day of Tarwiyah, the eighth day. {O you who have believed, respond to Allah and to the Messenger when he calls you to that which gives you life} (3). Third: Beware of neglecting the overnight stay in Mina on the eve of Arafah, for it is obligatory; the Messenger of Allah, peace and blessings of Allah be upon him, did it and commanded it in his saying: \"Take your rituals from me...\".",
    "foot_note": "1. 1 See 'Sahih Abi Dawood' \"1568 and 1571\". \n2. 2 His evidence for that is his saying, peace and blessings of Allah be upon him: \"Indeed Allah has entered an Umrah into this Hajj of yours. So when you arrive, whoever circumambulates the House and between Safa and Marwa has decomposed, except for the one who has a sacrificial animal with him.\" 'Sahih Abi Dawood 1573 and 1580'. \n3. 3 This does not contradict what was narrated from Umar and others indicating that Hajj Al-Ifrad is better, as I mentioned in 'The Original'. Then I saw Sheikh Al-Islam Ibn Taymiyyah interpreting that as meaning performing Umrah in one trip and Hajj in another trip, so refer to it in Volume 26 of 'Majmu' Al-Fatawa' for it is important.",
    "book_id": "12090",
    "new_page_number": 7
  },
  {
    "serial_number": "4365833",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 9,
    "volume_number": 1,
    "text": "And you must also stay overnight in Muzdalifah until you pray Fajr. If you miss the overnight stay, do not miss performing the prayer there, for it is an obligatory part of it; rather, it is a pillar (Rukn) of the pillars of Hajj according to the most correct view among the investigators of scholars, except for women and the weak. It is permissible for them to leave after half the night, as will be mentioned. Fourth: Beware as much as you can of passing in front of anyone praying in the Sacred Mosque (Al-Masjid Al-Haram), let alone other mosques and places, due to his saying, peace and blessings of Allah be upon him: \"If the one passing in front of a praying person knew what was upon him [of sin], it would be better for him to stand for forty than to pass in front of him.\" This is a general text that includes every passer and every praying person, and the hadith excepting the passer in the Sacred Mosque is not authentic. You must pray in it, like others, towards a Sutra (barrier) due to the generality of the hadiths narrated regarding that, and there are specific narrations from some Companions regarding it mentioned in \"The Original\". Fifth: People of knowledge and virtue must teach the pilgrims, wherever they meet them, the rituals of Hajj and its rulings according to the Book and the Sunnah. This should not distract them from calling to Tawhid (Monotheism), which is the foundation of Islam, and for which Messengers were sent and Books were revealed. For most of those we met, even some who belong to [the circles of] knowledge, we found them in extreme ignorance regarding the reality of the Tawhid of Allah and His Attributes. Just as they are in complete negligence regarding the necessity of the return of Muslims, despite their differing schools of thought and numerous parties, to uniting their word and gathering their ranks on the basis of the Book and the Sunnah in beliefs, rulings, transactions, morals, politics, economics, and other affairs of life. And [they should remember] that any voice raised and any reform established on other than this upright foundation and straight path, the Muslims will reap nothing from it except division, weakness, disgrace, and humiliation. Reality is the greatest witness to that. And Allah is the One sought for help.",
    "foot_note": "None",
    "book_id": "12090",
    "new_page_number": 8
  },
  {
    "serial_number": "4365834",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 10,
    "volume_number": 1,
    "text": "There is no harm in debating in a way that is best when there is a need, for the prohibited arguing in Hajj is only the arguing with falsehood, which is forbidden outside of Hajj as well, like the disobedience (Fusuq) which is also forbidden during Hajj. It is different from the debating commanded in instances like His saying, the Exalted: {Invite to the way of your Lord with wisdom and good instruction, and argue with them in a way that is best}. Even so, the caller (Da'iyah) should note that if it becomes clear to him that there is no benefit in debating with the opponent due to his fanaticism for his school of thought or opinion, and that if he persists in the argument, it might lead to what is impermissible, then it is better for him at that point to leave the argument with him, due to his saying, peace and blessings of Allah be upon him: \"I guarantee a house in the outskirts of Paradise for one who leaves arguing even if he is right...\" the Hadith (1).\n\nNo harm, no harm. Among what the caller should adhere to is making things easy for people in general and for pilgrims in particular, because ease is one of the principles of the tolerant Sharia, as is known, as long as there is no text to the contrary. If a text exists, facilitation based on opinion is not permissible. This is the just middle position that every caller must adhere to, and no consideration should be given after that to people's sayings and objections, asking: \"Was he strict or did he make it easy?\". There are permissible matters that some pilgrims are accustomed to feeling guilty about due to fatwas issued by some that contradict the principle referred to earlier. I decided to draw attention to them:",
    "foot_note": "1. 1 It is a Hasan Hadith, and it is in its entirety in 'Sahih Al-Jami' Al-Saghir' in Part Two, number \"1477\", printed by the Islamic Office.\n\nNone",
    "book_id": "12090",
    "new_page_number": 9
  },
  {
    "serial_number": "4365836",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 11,
    "volume_number": 1,
    "text": "1 - Bathing for other than a wet dream, even if rubbing the head, due to that being proven from the Prophet, peace and blessings of Allah be upon him, in the \"Two Sahihs\" and others from the hadith of Abu Ayyub, may Allah be pleased with him (1). 2 - Scratching the head, even if some hair falls out, due to the hadith of Abu Ayyub which I referred to earlier, and this was the opinion of Sheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him. 3 - Cupping (Hijamah), even if shaving the hair at the place of cupping, due to his, peace and blessings of Allah be upon him, being cupped in the middle of his head while he was in Ihram, and that is not possible without shaving the hair. This is also the opinion of Ibn Taymiyyah. The Hanbalis said this too, but they made the ransom (Fidyah) obligatory upon him, for which they have no evidence. Rather, it is refuted by his, peace and blessings of Allah be upon him, cupping; for had he paid a ransom, the narrator would have reported it from him. So his limitation to mentioning the cupping without the ransom is evidence that no ransom occurred from him. Thus, the correct view is the saying of Ibn Taymiyyah, may Allah have mercy on him. 4 - Smelling basil/aromatic plants and removing a broken nail; there are narrations regarding this mentioned in \"The Original\". 5 - Seeking shade under a tent or a raised garment, due to that being proven from him, peace and blessings of Allah be upon him. Similar to it is seeking shade in a litter (Mahmal) in the past, and with an umbrella (\"Shamsiyyah\") and a car, even from inside it, in modern times. Making the ransom obligatory for that is strictness for which there is no evidence. Rather, sound reasoning does not differentiate between seeking shade with a tent, which is established in the Sunnah, and seeking shade with a litter and what is similar to it. This is a narration from Imam Ahmad as in 'Manar Al-Sabil' \"1/246\". So what some sects do of removing the roof of the car is hair-splitting in religion that the Lord of the Worlds did not authorize. 6 - Tying a belt or band over the Izar (lower garment), and knotting it when needed, and wearing a ring, as came in some narrations. Similar to it is wearing a wristwatch, spectacles, and a money pouch around the neck. All these matters fall under the aforementioned principle, with some of them being supported by Marfu' hadiths and Mawquf narrations. Allah, Mighty and Majestic, says: {Allah intends for you ease and does not intend for you hardship}. And praise be to Allah, Lord of the Worlds.",
    "foot_note": "1. 1 It is in 'The Original' in its entirety \"p. 28\", and I have extracted it in 'Irwa Al-Ghalil' under number \"1019\" and 'Sahih Abi Dawood' \"1613\".",
    "book_id": "12090",
    "new_page_number": 10
  },
  {
    "serial_number": "4365837",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 12,
    "volume_number": 1,
    "text": "Before Ihram: 1 - It is recommended for one who intends Hajj or single Umrah to bathe for Ihram, even if she is menstruating or bleeding following childbirth (Nifas). 2 - Then the man wears whatever he wishes of clothes that are not tailored to the shape of the limbs, which are called by the jurists \"Ghayr Makhit\" (unstitched). So he wears an Izar (lower garment) and a Rida (upper garment) and similar things, and sandals, which are whatever is worn on the feet to protect them that does not cover the ankles. 3 - He does not wear a cap (Qalansuwah), turban, or similar things that cover the head directly. This is for the man. As for the woman, she does not remove anything of her legislated clothing, except that she does not tie the Niqab (1) or the Burqa, nor the Litham (face veil) or handkerchief over her face, and she does not wear gloves (2). He, peace and blessings of Allah be upon him, said: \"The Muhrim (person in Ihram) does not wear the shirt (Qamis), nor the turban, nor the hooded cloak (Burnus), nor trousers, nor a garment touched by Wars (a yellow plant) or saffron, nor leather socks (Khuffayn) unless",
    "foot_note": "1. 1 It is the mask on the bridge of the nose. It is of types: If the woman lowers her Niqab to her eye, that is Waswasah; or the Burqa. If she lowers it to the eye socket, it is the Niqab. If it is on the tip of the nose, it is the Lifam. It is called Niqab of the woman because it covers her Nuqab, i.e., her color, with the color of the Niqab. Ends summarized from 'Lisan Al-Arab' \"2 / 265 266\". \n2. 2 Sheikh Al-Islam Ibn Taymiyyah said in his Mansak \"p. 365\": \"Gloves (Quffazat) are a covering made for the hand as done by the bearers of falcons (Buzah). Buzah is the plural of Bazi, which is a type of hawk used in hunting.\"",
    "book_id": "12090",
    "new_page_number": 11
  },
  {
    "serial_number": "4365838",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 13,
    "volume_number": 1,
    "text": "he does not find sandals [then he wears leather socks]\" (1). And he said: \"The woman in Ihram does not wear a Niqab nor does she wear gloves\" (2). It is permissible for a woman to cover her face with something like a Khimar (headscarf) or Jilbab which she drapes over her head and lets down over her face, even if it touches the face according to the correct view, but she does not tie it on herself, as Ibn Taymiyyah, may Allah have mercy on him, said. 4 - He may wear the Ihram before the Miqat (designated boundary), even in his house, as the Messenger of Allah, peace and blessings of Allah be upon him, and his companions did. In this is ease for those performing Hajj by plane who cannot wear Ihram at the Miqat; so it is permissible for them to board the plane in Ihram clothing, but they do not make the intention of Ihram until shortly before the Miqat so that they do not pass the Miqat while not in Ihram. 5 - He may oil and perfume his body with any scent he wishes that has a fragrance but no color, except for women; their perfume is what has color but no fragrance. All of this is before he intends Ihram at the Miqat; as for after it, it is forbidden. Ihram and its Intention: 6 - When he reaches his Miqat, he must assume Ihram. This does not happen merely by what is in his heart of the intention and purpose of Hajj, for the intention has been in the heart since he left his country. Rather, there must be a statement or action by which he becomes a Muhrim. So if he recites the Talbiyah intending Ihram, his Ihram is established by agreement. 7 - He does not say anything with his tongue before the Talbiyah, such as their saying:",
    "foot_note": "1. 1 Sheikh Al-Islam Ibn Taymiyyah said in his Mansak: \"He does not have to cut them below the ankles, for the Prophet, peace and blessings of Allah be upon him, commanded cutting first, then later gave a concession at Arafat to wear trousers for the one who did not find an Izar, and gave concession to wear leather socks for the one who did not find sandals. This is the more correct of the two scholarly opinions.\" \n2. 2 Agreed upon. 'Sahih Abi Dawood' \"1600\".",
    "book_id": "12090",
    "new_page_number": 12
  },
  {
    "serial_number": "4365839",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 14,
    "volume_number": 1,
    "text": "\"O Allah, I intend Hajj or Umrah, so make it easy for me and accept it from me...\" due to it not being reported from the Prophet, peace and blessings of Allah be upon him. This is like articulating the intention in purification, prayer, and fasting; all of that is from the newly invented matters. And it is known that he, peace and blessings of Allah be upon him, said: \"...for every newly invented matter is an innovation (Bid'ah), and every innovation is misguidance, and every misguidance is in the Fire.\"\n\nThe Miqats (Designated Stations): 8 - The Miqats are five: Dhul-Hulaifah, Al-Juhfah, Qarn Al-Manazil, Yalamlam, and Dhat Irq. They are for their people and for those who pass by them from other than their people who intend Hajj or Umrah. Whoever's dwelling is before them [closer to Mecca], then his place of Ihram is from his dwelling, to the extent that the people of Mecca assume Ihram from Mecca. \"Dhul-Hulaifah\" is the station for the people of Medina. It is a village six or seven miles away from it, and it is the furthest Miqat from Mecca; between them is ten stages, or less or more depending on the different routes, for there are several routes from it to Mecca, as Sheikh Al-Islam Ibn Taymiyyah said. It is called Wadi Al-Aqiq, and its mosque is called Masjid Al-Shajarah. In it is a well that the ignorant commoners call \"Bir Ali\" (Ali's Well), thinking that Ali fought the Jinn there, which is a lie. \"Al-Juhfah\" is a village with about three stages between it and Mecca. It is the Miqat for the people of Sham (Levant) and Egypt, and also the people of Medina if they pass from the other route. Ibn Taymiyyah said: It is the Miqat for those coming for Hajj from the direction of the West, like the people of Sham, Egypt, and the rest of the Maghreb. It is in ruins today, so people assume Ihram before it from the place called \"Rabigh\". \"Qarn Al-Manazil\", also called Qarn Al-Tha'alib, is facing Mecca at a distance of a day and a night. It is the Miqat for the people of Najd. \"Yalamlam\" is a place two nights away from Mecca, with thirty miles between them. It is the Miqat for the people of Yemen. \"Dhat Irq\" is a place in the desert, and it is the dividing border between Najd and Tihamah. Between it and Mecca is forty-two miles. It is the Miqat for the people of Iraq.",
    "foot_note": "None\n\nNone",
    "book_id": "12090",
    "new_page_number": 13
  },
  {
    "serial_number": "4365841",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 15,
    "volume_number": 1,
    "text": "His command, peace and blessings of Allah be upon him, regarding Tamattu': 9 - When he intends Ihram, if he is a Qarin (combining Hajj and Umrah) having driven the sacrificial animal, he says: \"Labbayk Allahumma bi-Hajjah wa Umrah\" (Here I am, O Allah, for Hajj and Umrah). If he has not driven the sacrificial animal—which is better—he recites Talbiyah for Umrah alone, and he must do so, saying: \"Labbayk Allahumma bi-Umrah\" (Here I am, O Allah, for Umrah). If he had recited Talbiyah for Hajj alone, he annuls it and makes it Umrah due to the command of the Prophet, peace and blessings of Allah be upon him, regarding that and his saying: \"Umrah has entered into Hajj until the Day of Judgment,\" and he, peace and blessings of Allah be upon him, intertwined his fingers. And his saying: \"O family of Muhammad, whoever of you performs Hajj, let him raise his voice for Umrah in a Hajj\" (1). This is Tamattu' with Umrah until Hajj.\n\nThe Stipulation (Ishtirat): 10 - If he likes, he may combine with his Talbiyah a stipulation to his Lord, the Exalted, fearing an obstacle such as illness or fear, so he says as came in the teaching of the Messenger, peace and blessings of Allah be upon him: \"Allahumma mahilli haythu habastani\" (O Allah, my place of decomposition is where You hold me back) (2). For if he does that and is held back or falls ill, it is permissible for him to decompose from his Hajj or Umrah and he owes no blood (sacrifice), and he performs Hajj the following year unless it was the Obligatory Hajj (Hajjat al-Islam), in which case it must be made up. 11 - Ihram has a prayer specific to it, but if the prayer time catches him before his Ihram, and he prays and then assumes Ihram following his prayer, he has a model in the Messenger of Allah, peace and blessings of Allah be upon him, as he assumed Ihram after the Dhuhr prayer.",
    "foot_note": "1. 1 See its Takhrij in 'Al-Ahadith Al-Sahihah' \"2469\".\n\n1. 2 Agreed upon. See 'Sahih Abi Dawood' \"1557\".",
    "book_id": "12090",
    "new_page_number": 14
  },
  {
    "serial_number": "4365843",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 16,
    "volume_number": 1,
    "text": "Prayer in Wadi Al-Aqiq: 12 - Whoever's Miqat is Dhul-Hulaifah, it is recommended for him to pray in it, not for the specificity of Ihram but for the specificity of the place and its blessing. Al-Bukhari narrated from Umar, may Allah be pleased with him, who said: I heard the Messenger of Allah, peace and blessings of Allah be upon him, in Wadi Al-Aqiq saying: \"Someone came to me tonight from my Lord and said: Pray in this blessed valley and say: 'Umrah in' - and in a narration: 'Umrah and' - 'Hajj'.\" And from Ibn Umar from the Prophet, peace and blessings of Allah be upon him: \"That he was seen - and in a narration: shown - while he was resting at night (Mu'arris) (1) at Dhul-Hulaifah in the bottom of the valley, and it was said to him: Indeed, you are in a blessed Batha (valley floor)\" (2).\n\nTalbiyah and Raising the Voice with it: 13 - He faces the Qiblah standing (3), then recites Talbiyah for Umrah or Hajj and Umrah as previously mentioned, and says: \"Allahumma hadhihi hijjatun la riya'a fiha wa la sum'ah\" (O Allah, this is a Hajj in which there is no showing off nor seeking reputation) (4). 14 - He recites the Talbiyah of the Prophet, peace and blessings of Allah be upon him: A - \"Labbayk Allahumma labbayk, labbayk la sharika laka labbayk, inna al-hamda wan-ni'mata laka wal-mulk, la sharika lak\" (Here I am, O Allah, here I am. Here I am, You have no partner, here I am. Verily all praise and blessings are Yours, and all sovereignty, You have no partner). He used not to add to it.",
    "foot_note": "1. 1 From 'Ta'ris', which is the traveler stopping at the end of the night for sleep and rest. 'Nihayah'. \n2. 2 'Sahih Abi Dawood' \"1579\". And 'Mukhtasar Sahih Al-Bukhari' by my pen \"No. 761 762\", may Allah facilitate the completion of its printing. Al-Hafiz said in 'Al-Fath' \"3 / 311\": \"In the hadith is the virtue of Al-Aqiq like the virtue of Medina and the virtue of prayer in it...\"\n\n1. 3 Al-Bukhari in suspended form and Al-Bayhaqi in connected form with a Sahih chain. \n2. 4 Narrated by Al-Diya' with a Sahih chain.",
    "book_id": "12090",
    "new_page_number": 15
  },
  {
    "serial_number": "4365845",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 17,
    "volume_number": 1,
    "text": "B - And among his Talbiyah, peace and blessings of Allah be upon him, was: \"Labbayka Ilahal-Haqq\" (Here I am, O God of Truth). 15 - Adhering to his Talbiyah, peace and blessings of Allah be upon him, is better, even though adding to it is permissible due to the Prophet, peace and blessings of Allah be upon him, approving of the people who used to add to his Talbiyah their saying: \"Labbayka dhal-Ma'arij, labbayka dhal-Fawadil\" (Here I am, Possessor of the Ways of Ascent, Here I am, Possessor of Favors). Ibn Umar used to add to it: \"Labbayka wa sa'dayk, wal-khayru biyadayk, war-raghba'u ilayka wal-amal\" (Here I am and at Your service, and good is in Your hands, and desire and deeds are directed to You) (1). 16 - The one reciting Talbiyah is commanded to raise his voice with the Talbiyah due to his saying, peace and blessings of Allah be upon him: \"Gabriel came to me and commanded me to order my companions and those with me to raise their voices with the Talbiyah\" (2). And his saying: \"The best Hajj is the 'Ajj (raising voice) and the Thajj (flowing blood of sacrifice)\" (3). For this reason, the companions of the Prophet, peace and blessings of Allah be upon him, in his Hajj used to shout it out loudly. Abu Hazim said: When they assumed Ihram, they would not reach \"Al-Rawha\" until their voices became hoarse (4). And his saying, peace and blessings of Allah be upon him: \"It is as if I am looking at Moses, peace be upon him, descending from the Thaniyah (pass), crying out loudly to Allah the Exalted with Talbiyah\" (5). 17 - Women are like men in Talbiyah due to the generality of the two previous hadiths; so they raise their voices as long as Fitna (temptation) is not feared. Also because Aisha used to raise her voice until men heard her. Abu Atiyah said: I heard Aisha saying: I surely know how",
    "foot_note": "1. 1 Agreed upon. See 'Sahih Abi Dawood' \"1590\". \n2. 2 Narrated by the authors of the Sunan and others. See 'Sahih Abi Dawood' \"1592\". \n3. 3 A Hasan Hadith. 'Sahih Al-Jami' Al-Saghir and its Addition' \"1112\". And \"Al-Ajj\": Raising the voice with Talbiyah. And \"Al-Thajj\": Flowing of the blood of Hady and sacrifices. \n4. 4 Narrated by Sa'id bin Mansur as in 'Al-Muhalla' \"7 / 94\" with a good chain, and narrated by Ibn Abi Shaybah with a Sahih chain from Al-Muttalib bin Abdullah as in 'Al-Fath' \"3 / 324\", and it is Mursal. \n5. 5 Narrated by Muslim. See 'Al-Sahihah' \"2023\".",
    "book_id": "12090",
    "new_page_number": 16
  },
  {
    "serial_number": "4365846",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 18,
    "volume_number": 1,
    "text": "the Talbiyah of the Messenger of Allah, peace and blessings of Allah be upon him, was. Then I heard her reciting Talbiyah after that: \"Labbayk Allahumma labbayk...\" etc. (1). Al-Qasim bin Muhammad said: Mu'awiyah went out on the night of Nafr (departure), and heard the voice of Talbiyah, so he said: \"Who is this?\" It was said: \"Aisha, Mother of the Believers, she performed Umrah from Al-Tan'im.\" That was mentioned to Aisha, so she said: \"Had he asked me, I would have told him\" (2). 18 - He adheres to the Talbiyah because it is \"from the symbols of Hajj\" (3), and due to his saying, peace and blessings of Allah be upon him: \"There is no one reciting Talbiyah except that what is to his right and his left of stones and trees recites Talbiyah until the earth is cut off from here and here - meaning on his right and left\" (4). Especially whenever he ascends a high ground or descends into a valley, due to the hadith mentioned shortly before: \"It is as if I am looking at Moses, peace be upon him, descending from the Thaniyah, crying out loudly to Allah the Exalted with Talbiyah.\" And in another hadith: \"It is as if I am looking at him when he descended into the valley reciting Talbiyah\" (5). 19 - He may mix it with Talbiyah and Tahlil (saying La ilaha illa Allah) due to the saying of Ibn Masud, may Allah be pleased with him:",
    "foot_note": "1. 1 Narrated by Al-Bukhari \"769 Mukhtasaruhu\", Al-Tayalisi \"1513\", and Ahmad \"6 / 32, 100, 180, and 243\". \n2. 2 Narrated by Ibn Abi Shaybah as in 'Al-Muhalla' \"7 / 94 95\" and its chain is Sahih. Sheikh Al-Islam said in his Mansak: \"The woman raises her voice such that her female companions hear her, and it is recommended to do it frequently when conditions change...\". \n3. 3 It is part of a Sahih hadith extracted in 'Al-Sahihah' \"828\" with the wording: Gabriel commanded me to raise the voice in Ihlaal (Talbiyah) for it is among the symbols of Hajj\". \n4. 4 Narrated by Ibn Khuzaimah and Al-Bayhaqi with a Sahih chain as in 'Takhrij Al-Targhib wa Al-Tarhib' \"2 / 118\". \n5. 5 Narrated by Al-Bukhari. 'Mukhtasari li-Al-Bukhari' \"60 Prophets 8 Chapter\". Al-Hafiz said: \"In the hadith is that Talbiyah in the bottoms of valleys is from the Sunnah of the Messengers, and that it is emphasized when descending just as it is emphasized when ascending.\"",
    "book_id": "12090",
    "new_page_number": 17
  },
  {
    "serial_number": "4365847",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 19,
    "volume_number": 1,
    "text": "\"I went out with the Messenger of Allah, peace and blessings of Allah be upon him, and he did not stop Talbiyah until he stoned Jamrat Al-Aqabah, except that he would mix it with Talbiyah or Tahlil\" (1). 20 - When he reaches the Meccan Sanctuary and sees the houses of Mecca, he stops the Talbiyah (2), to free himself to engage in other things that follow.\n\nBathing to enter Mecca: 21 - Whoever is able to bathe before entering should bathe, and he should enter during the day following the example of the Messenger of Allah, peace and blessings of Allah be upon him (3). 22 - He should enter from the upper side which today has Bab Al-Ma'la, for he, peace and blessings of Allah be upon him, entered it from the upper pass \"Kada'\" (4) overlooking the cemetery, and he entered the Mosque from Bab Bani Shaybah, for this is the closest route to the Black Stone. 23 - He may enter it from any path he wishes due to his saying, peace and blessings of Allah be upon him: \"All the ravines of Mecca are a path and a place of sacrifice.\" And in another hadith: \"Mecca is all a path: he enters from here and exits from here\" (5). 24 - When you enter the Mosque, do not forget to advance your right foot (6) and say: \"Allahumma salli 'ala Muhammadin wa sallim, Allahumma iftah li abwaba rahmatik\" (O Allah, send blessings upon Muhammad and peace. O Allah, open for me the doors of Your mercy) (7).",
    "foot_note": "1. 1 Narrated by Ahmad \"1 / 417\" with a good chain, and Al-Hakim and Al-Dhahabi authenticated it as in 'Al-Hajj Al-Kabir'. \n2. 2 Narrated by Al-Bukhari \"779 Mukhtasari\" and Al-Bayhaqi. See 'Al-Majma'' \"3 / 225 and 239\".\n\n1. 3 Narrated by Al-Bukhari \"779 Mukhtasari\" and 'Sahih Abi Dawood' \"1630\". \n2. 4 Narrated by Al-Bukhari \"780 Mukhtasari\" and 'Sahih Abi Dawood' \"1929\". \n3. 5 Narrated by Al-Fakihi with a Hasan chain. \n4. 6 Regarding it is a Hasan Hadith extracted in 'Al-Sahihah' \"2478\". \n5. 7 See 'Al-Kalim Al-Tayyib' by Sheikh Al-Islam Ibn Taymiyyah with my verification \"p. 51 and 52\".",
    "book_id": "12090",
    "new_page_number": 18
  },
  {
    "serial_number": "4365849",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 20,
    "volume_number": 1,
    "text": "Or: \"A'udhu billahil-Azim wa bi-wajhihil-Karim wa sultanihil-qadim minash-shaytanir-rajim\" (I seek refuge in Allah the Great, and in His Noble Face and His Primordial Authority, from the accursed Satan) (1). 25 - When he sees the Kaaba, he raises his hands if he wishes, due to it being established from Ibn Abbas (2). 26 - No specific supplication is established from the Prophet, peace and blessings of Allah be upon him, here, so he supplicates with whatever is easy for him. If he supplicates with the supplication of Umar: \"Allahumma antas-Salam wa minkas-Salam fa-hayyina Rabbana bis-Salam\" (O Allah, You are Peace and from You is peace, so greet us, our Lord, with peace), it is good due to it being established from him, may Allah be pleased with him (3).\n\nTawaf Al-Qudum (Arrival Circumambulation): 27 - Then he hastens to the Black Stone and faces it directly, saying Takbir (Allahu Akbar). Saying Basmalah (Bismillah) before it is authentic from Ibn Umar as a Mawquf narration, and whoever mentioned it as Marfu' is mistaken. 28 - Then he touches it with his hand and kisses it with his mouth, and he prostrates on it as well, for the Messenger of Allah, peace and blessings of Allah be upon him, Umar, and Ibn Abbas did so (4). 29 - If he cannot kiss it, he touches it with his hand then kisses his hand. 30 - If he cannot touch it, he points to it with his hand.",
    "foot_note": "1. 1 Narrated by Ibn Abi Shaybah with a Sahih chain from him. Others narrated it as Marfu' (to the Prophet) but its chain is weak as clarified in 'Al-Da'ifah' \"1054\". \n2. 2 Narrated by Al-Bayhaqi \"5 / 72\" with a Hasan chain from Sa'id bin Al-Musayyib who said: I heard from Umar a word that no one remaining from the people heard other than me; I heard him saying when he saw the House: so he mentioned it. And he narrated it with another chain also from Sa'id bin Al-Musayyib that he used to say that. Ibn Abi Shaybah narrated it \"4 / 97\" from both of them. \n3. 3 The statement of some virtuous people in their commentary on 'Al-Manasik wal-Ziyarat' that it has not been reported from the Prophet, peace and blessings of Allah be upon him, is a delusion from them. I have verified the statement regarding its authenticity in 'Al-Irwa' \"1112\", and Allah has facilitated its printing. To Him belongs praise and gratitude.\n\n1. 4 Narrated by Al-Shafi'i, Ahmad, and others. It is a strong hadith as I clarified in \"Al-Hajj Al-Kabir\".",
    "book_id": "12090",
    "new_page_number": 19
  },
  {
    "serial_number": "4365851",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 21,
    "volume_number": 1,
    "text": "31 - He does that in every circuit. 32 - He should not crowd over it, due to his saying, peace and blessings of Allah be upon him: \"O Umar, you are a strong man, so do not harm the weak. If you want to touch the Stone, if it is clear for you, touch it; otherwise, face it and say Takbir\" (1). 33 - Touching the Stone has great merit due to his saying, peace and blessings of Allah be upon him: \"Allah will surely raise the Stone on the Day of Resurrection having two eyes with which it sees, and a tongue with which it speaks, testifying for whoever touched it with truth.\" And he said: \"Touching the Black Stone and the Yemeni Corner removes sins completely\" (2). And he said: \"The Black Stone is from Paradise. It was whiter than snow until the sins of the people of Shirk turned it black\" (3). 34 - Then he begins the Tawaf around the Kaaba, keeping it on his left. He circumambulates from beyond the Hijr (Ismail) seven circuits. From the Stone to the Stone counts as one circuit. He performs Idtiba' (4) in all of them, and performs Raml (jogging) in the first three of them from the Stone to the Stone, and walks in the rest. 35 - He touches the Yemeni Corner with his hand in every circuit but does not kiss it. If he cannot touch it, pointing to it with his hand is not legislated.",
    "foot_note": "1. 1 Authenticated by Al-Tirmidhi, Ibn Khuzaimah, Ibn Hibban, Al-Hakim, and Al-Dhahabi. It is extracted in the previous source. \n2. 2 Classified as Hasan by Al-Tirmidhi, and authenticated by Ibn Hibban, Al-Hakim, and Al-Dhahabi. \n3. 3 Authenticated by Al-Tirmidhi and Ibn Khuzaimah. \n4. 4 Idtiba': To insert the Rida (upper garment) under his right armpit and throw its end over his left shoulder, exposing his right shoulder and covering the left. It is an innovation before this Tawaf and after it.",
    "book_id": "12090",
    "new_page_number": 20
  },
  {
    "serial_number": "4365852",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 22,
    "volume_number": 1,
    "text": "36 - And he says between them: \"Rabbana atina fid-dunya hasanatan wa fil-akhirati hasanatan wa qina adhaban-nar\" (Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire) (1). 37 - He does not touch the two Shami corners, following the example of the Prophet, peace and blessings of Allah be upon him (2).\n\nClinging to what is between the Corner and the Door: 38 - He may cling to what is between the Corner and the Door, placing his chest, face, and forearms on it (3).",
    "foot_note": "1. 1 Narrated by Abu Dawood and others, and authenticated by a group. 'Sahih Abi Dawood' \"1653\". \n2. 2 Sheikh Al-Islam Ibn Taymiyyah said: Touching (Istilam) is wiping with the hand. As for the other sides of the House, the Station of Ibrahim, and whatever else is on the earth of the Mosque and its walls, and the graves of Prophets and righteous people, like the chamber of our Prophet, peace and blessings of Allah be upon him, the cave of Ibrahim, the place of our Prophet, peace and blessings of Allah be upon him, where he used to pray, and other graves of Prophets and righteous people, and the rock of Bayt Al-Maqdis (Jerusalem), they are neither touched nor kissed by the agreement of the Imams. As for circumambulating them, it is one of the greatest forbidden innovations, and whoever takes it as a religion should be asked to repent; if he repents [good], otherwise he is killed. How excellent is what Abdul Razzaq \"8945\", Ahmad, and Al-Bayhaqi narrated from Ya'la bin Umayyah who said: I circumambulated with Umar bin Al-Khattab - and in a narration with Uthman - may Allah be pleased with him. When I was at the corner next to the door following the Stone, I took his hand to touch it, so he said: Did you not circumambulate with the Messenger of Allah? I said: Yes. He said: Did you see him touch it? I said: No. He said: Then hold back, for indeed in the Messenger of Allah, peace and blessings of Allah be upon him, you have a good example.\n\n1. 3 That was narrated from the Prophet, peace and blessings of Allah be upon him, via two paths; the hadith rises through them to the rank of Hasan, and it increases in strength by the establishment of acting upon it by a group of Companions, among them Ibn Abbas, may Allah be pleased with him. He said: This is the Multazam between the Corner and the Door. It is also authenticated from the action of Urwah bin Al-Zubayr. All of that is extracted in 'Al-Ahadith Al-Sahihah' \"2138\". Sheikh Al-Islam Ibn Taymiyyah said in his Mansak \"p. 387\": If he likes to come to the Multazam—which is between the Black Stone and the Door—and place his chest, face, forearms, and palms on it and supplicate and ask Allah the Exalted for his need, he may do that. He may do that before the Farewell Tawaf, for this clinging makes no difference whether it is at the time of farewell or other times. The Companions used to do that when they entered Mecca... If he stands at the door and supplicates there without clinging to the House, it is good. When he leaves, he does not stop, nor turn around, nor walk backwards.",
    "book_id": "12090",
    "new_page_number": 21
  },
  {
    "serial_number": "4365854",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 23,
    "volume_number": 1,
    "text": "39 - Tawaf has no specific Dhikr (remembrance). So he may read from the Quran or Dhikr whatever he wishes, due to his saying, peace and blessings of Allah be upon him: \"Tawaf around the House is prayer, but Allah has permitted speaking in it. So whoever speaks, let him not speak except good.\" And in a narration: \"So speak little in it\" (1). 40 - It is not permissible to circumambulate the House while naked or menstruating, due to his saying, peace and blessings of Allah be upon him: \"No naked person shall circumambulate the House\" (2). And his saying to Aisha when she came performing Umrah during the Farewell Hajj: \"Do as the pilgrim does, except do not circumambulate the House [and do not pray] until you become pure\" (3). 41 - When he finishes the seventh circuit, he covers his right shoulder and proceeds to the Station of Ibrahim (Maqam Ibrahim), reciting: {And take, [O believers], from the standing place of Abraham a place of prayer} [Al-Baqarah: 125]. 42 - He places the Maqam between himself and the Kaaba and prays two Rak'ahs near it. 43 - He recites in them: {Say, \"O disbelievers\"} (Surah Al-Kafirun) and {Say, \"He is Allah, [who is] One\"} (Surah Al-Ikhlas). 44 - He should not pass in front of a person praying there, nor allow anyone to pass",
    "foot_note": "1. 1 Narrated by Al-Tirmidhi and others, and the other narration is by Al-Tabarani. It is a Sahih hadith as I verified in 'Al-Irwa' \"21\". Sheikh Al-Islam said: There is no specific Dhikr mentioned in it from the Prophet, peace and blessings of Allah be upon him, neither by his command, nor his saying, nor his teaching. Rather, one supplicates in it with all legislated supplications. What many people mention of a specific supplication under the spout (Mizab) and the like has no basis. \n2. 2 Agreed upon from the hadith of Abu Huraira, and Al-Tirmidhi narrated it from the hadith of Ali and Ibn Abbas. It is extracted in 'Al-Irwa' \"1102\". \n3. 3 Agreed upon from the hadith of Aisha, and Al-Bukhari from the hadith of Jabir, and the addition is his. It is extracted in the previous source \"191\".",
    "book_id": "12090",
    "new_page_number": 22
  },
  {
    "serial_number": "4365855",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 24,
    "volume_number": 1,
    "text": "in front of him while he is praying, due to the generality of the hadiths forbidding that, and the lack of established evidence excepting the Sacred Mosque from them, let alone all of Mecca! (1). 45 - Then when he finishes the prayer, he goes to Zamzam and drinks from it and pours over his head, for he, peace and blessings of Allah be upon him, said: \"Zamzam water is for whatever it is drunk for\" (2). And he said: \"It is blessed, it is food that satisfies, [and a cure for illness]\" (3). And he said: \"The best water on the face of the earth is Zamzam water; in it is food that satisfies and cure for illness\" (4). 46 - Then he returns to the Black Stone, says Takbir, and touches it according to the detailed manner mentioned previously.\n\nSa'y between Safa and Marwa: 47 - Then he returns his steps to perform Sa'y between Safa and Marwa. When he approaches Safa, he recites His saying, the Exalted: {Indeed, as-Safa and al-Marwah are among the symbols of Allah. So whoever makes Hajj to the House or performs 'umrah - there is no blame upon him for walking between them. And whoever volunteers good - then indeed, Allah is appreciative and Knowing} [Al-Baqarah: 158]. And he says: \"Nabda'u bima bada' Allahu bihi\" (We begin with what Allah began with).",
    "foot_note": "1. 1 Refer to the Introduction and 'The Original' \"p. 21, 23 and 135\". \n2. 2 A Sahih hadith as stated by a group of Imams. I have extracted it and discussed its paths in 'Irwa Al-Ghalil' \"1123\" and one of them is in 'Al-Sahihah' \"883\". \n3. 3 A Sahih hadith narrated by Al-Tayalisi and others. It is extracted in 'Al-Sahihah' under hadith \"1056\" and others. \n4. 4 Narrated by Al-Diya' in 'Al-Mukhtarah' and others. It is extracted in the previous source \"1056\".\n\nNone",
    "book_id": "12090",
    "new_page_number": 23
  },
  {
    "serial_number": "4365857",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah (Rituals of Hajj and Umrah)",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 25,
    "volume_number": 1,
    "text": "48 - Then he begins with Safa and climbs upon it until he sees the Kaaba (1). 49 - So he faces the Kaaba, unifies Allah (makes Tawhid), and glorifies Him (makes Takbir), saying: \"Allahu Akbar, Allahu Akbar, Allahu Akbar\" (three times). \"La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd, yuhyi wa yumit, wa huwa 'ala kulli shay'in qadir. La ilaha illa Allah wahdahu la sharika lah, anjaza wa'dah, wa nasara 'abdah, wa hazamal-ahzaba wahdah\" (There is no deity except Allah alone, without any partner. To Him belongs the sovereignty and to Him belongs the praise. He gives life and causes death, and He is over all things competent. There is no deity except Allah alone, without any partner. He fulfilled His promise, supported His servant, and defeated the confederates alone) (2). He says that three times, and supplicates in between (3). 50 - Then he descends to perform Sa'y between Safa and Marwa. The Messenger of Allah, peace and blessings of Allah be upon him, said: \"Perform Sa'y, for Allah has prescribed Sa'y upon you\" (4). 51 - He walks to the flag \"placed\" on the right and left, which is known as the Green Mile, then he runs vigorously from it to the other flag after it. In his time, peace and blessings of Allah be upon him, it was a valley bed (Abtah) with small pebbles, and he, peace and blessings of Allah be upon him, said: \"The valley bed (Al-Abtah) is not crossed except by running vigorously\" (5).",
    "foot_note": "1. 1 It is not easy now to see the House except in some places from Safa, for he sees it through the columns upon which the second floor of the Mosque is built. Whoever can do that has hit the Sunnah; otherwise, let him strive and there is no harm. \n2. 2 In 'Al-Adhkar', it adds: \"La ilaha illa Allah wa la na'budu illa iyyah...\" (There is no deity except Allah and we do not worship except Him...) etc. I did not see this addition in any of the paths of the hadith in Muslim or others who narrated it, which is from the long hadith of Jabir, contrary to what the commentator on it implies: Narrated by Muslim and... \n3. 3 Meaning between the Tahlils (saying La ilaha illa Allah) with whatever he wishes of supplication containing the good of this world and the Hereafter. It is better to be what is reported from the Prophet, peace and blessings of Allah be upon him, or the righteous predecessors. \n4. 4 It is a Sahih hadith, contrary to those who were mistaken about it. It is extracted in 'Al-Irwa' \"1072\". \n5. 5 Narrated by Al-Nasa'i and others. It is extracted in \"Al-Hajj Al-Kabir\".",
    "book_id": "12090",
    "new_page_number": 24
  },
  {
    "serial_number": "4365858",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 26,
    "volume_number": 1,
    "text": "Then he walks briskly until he comes to Al-Marwah, ascends it, and does upon it what he did upon Al-Safa, regarding facing the Qiblah, Takbir, Tawhid (declaring Oneness of Allah), and supplication (1). This is one circuit.\n52- Then he returns until he ascends Al-Safa, walking in the place of his walking and running (Sa'i) in the place of his running. This is a second circuit.\n53- Then he returns to Al-Marwah, and so on until he completes seven circuits, the end of the last one being at Al-Marwah.",
    "foot_note": "1. = \"Benefit\": It is stated in Al-Mughni by Ibn Qudamah Al-Maqdisi \"3 / 394\": 'The Tawaf of women and their Sa'i is entirely walking.' Ibn Al-Mundhir said: 'The people of knowledge have agreed that there is no Raml (jogging) for women around the House nor between Al-Safa and Al-Marwah, and there is no Idtiba (exposing the right shoulder) for them. That is because the principle in these two actions is to display endurance, and that is not intended regarding women because the intent for women is concealment. In Raml and Idtiba, there is exposure to uncovering.' In Al-Majmu' by Al-Nawawi \"8 / 75\", there is an indication that the issue is disputed among the Shafi'is, for he said: 'It has two views: The first, which is the correct one and asserted by the majority: that she does not run, but walks the entire distance, night and day. The second view: that if she performs Sa'i at night while the Mas'a (running area) is empty, it is recommended for her to run in the place of running like a man.' I say: Perhaps this is closer, for the origin of the legislation of Sa'i is the running of Hagar, the mother of Ishmael, seeking help for her thirsty son, as in the Hadith of Ibn Abbas: 'She found Al-Safa to be the nearest mountain in the land next to her, so she stood on it, then faced the valley looking to see if she could see anyone, but she saw no one. So she descended from Al-Safa until she reached the valley, she lifted the edge of her garment, then ran the run of a person in distress until she crossed the valley, then came to Al-Marwah and stood upon it and looked to see if she could see anyone, but she saw no one. She did that seven times.' Ibn Abbas said: The Prophet (peace and blessings of Allah be upon him) said: 'That is the Sa'i of the people between them.' Narrated by Al-Bukhari in the Book of Prophets. 1 As for seeing the Kaaba, it is not possible now due to the obstruction of buildings between him and it as mentioned previously, so he must strive to face its direction and not act like the confused people who raise their eyes and hands to the sky!",
    "book_id": "12090",
    "new_page_number": 25
  },
  {
    "serial_number": "4365859",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 27,
    "volume_number": 1,
    "text": "54- It is permissible to traverse between them while riding, but walking was more beloved to the Prophet (peace and blessings of Allah be upon him) (1).\n55- If he supplicates during the Sa'i saying: 'My Lord, forgive and have mercy, indeed You are the Most Mighty, the Most Noble' (Rabbighfir warham innaka antal-a'azzul-akram), there is no harm, due to it being established from a group of the Salaf (2).\n56- When he finishes the seventh circuit at Al-Marwah, he cuts the hair of his head (3). With that, the Umrah concludes, and everything prohibited by Ihram becomes lawful for him. He remains in this state of being Halal (lawful) until the Day of Tarwiyah.\n57- Whoever entered Ihram without the Umrah of Hajj (i.e., not Tamattu') and did not bring the sacrificial animal (Hady) from outside the sanctuary, he must perform Tahallul (become lawful) in adherence to the command of the Prophet (peace and blessings of Allah be upon him) and to avoid his anger. As for the one who brought the Hady, he remains in his Ihram and does not perform Tahallul until after the throwing (Ramy) on the Day of Nahr (Sacrifice).\n\nRaising the Voice (Ihram) for Hajj on the Day of Tarwiyah:\n58- When it is the Day of Tarwiyah, which is the eighth day of Dhu al-Hijjah, he enters Ihram and raises his voice for Hajj. He does as he did when entering Ihram for Umrah from the Miqat: bathing, perfuming, wearing the Izar (lower garment) and Rida (upper garment), and Talbiyah. He does not stop it (Talbiyah) until after throwing Jamrat al-Aqabah.\n59- He enters Ihram from the place where he is staying; even the people of Makkah enter Ihram from Makkah.\n60- Then he sets out to Mina, prays Dhuhr there, and spends the night there until he prays the rest of the prayers shortened without combining.",
    "foot_note": "1. Narrated by Abu Nu'aym in his Mustakhraj on \"Sahih Muslim\".\n2. Narrated by Ibn Abi Shaybah \"4 / 68 and 69\" from Ibn Mas'ud and Ibn Umar (may Allah be pleased with them) with two authentic chains, and from Al-Musayyib bin Rafi' Al-Kahili and Urwah bin Al-Zubayr. Al-Tabarani narrated it as Marfu' (attributed to the Prophet) with a weak chain as in Al-Majma' \"3 / 248\".\n3. Or shaving, if there is a sufficient period between his Umrah and his Hajj for the hair to grow. \"See Al-Fath 3 / 444\".\n\nNone",
    "book_id": "12090",
    "new_page_number": 26
  },
  {
    "serial_number": "4365861",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 28,
    "volume_number": 1,
    "text": "He prays the rest of the five prayers shortened without combining.\nDeparture to Arafah:\n61- When the sun rises on the Day of Arafah, he sets out to Arafah while reciting Talbiyah or Takbir. The Companions of the Prophet (peace and blessings of Allah be upon him) did all of that while they were with him during his Hajj; the one reciting Talbiyah would recite it and no one denied him, and the one reciting Takbir would recite it and no one denied him (1).\n62- Then he stops at Namirah (2), which is a place near Arafat but not part of it, and remains there until before the sun passes its zenith (Zawal).\n63- When the sun passes its zenith, he moves to Uranah and stops there (1). It is just before Arafah. There, the Imam delivers a sermon to the people suitable for the occasion.\n64- Then he leads the people in Dhuhr and Asr prayers, shortened and combined at the time of Dhuhr.\n65- One Adhan and two Iqamahs are called for them.\n66- He does not pray anything between them (3).\n67- Whoever cannot easily pray them with the Imam should pray them in the same manner alone, or with those around him who are in the same situation (4).",
    "foot_note": "1. Narrated by the two Sheikhs (Bukhari and Muslim).\n2. This stop and the one after it are difficult to achieve today due to extreme crowding. So if he passes them to Arafah, there is no harm, God willing. Sheikh al-Islam Ibn Taymiyyah said in Al-Fatawa \"26 / 168\": \"As for what the Sunnah of the Messenger of Allah (peace and blessings of Allah be upon him) entails regarding staying at Mina on the Day of Tarwiyah and spending the night there before the Day of Arafah, then stopping at Uranah—which is between Al-Mash'ar Al-Haram and Arafah—until Zawal, going from there to Arafah, and the sermon and the two prayers on the way in the valley of Uranah; this is almost agreed upon among the jurists, even if many authors do not distinguish it and most people do not know it due to the prevalence of introduced habits.\"\n3. I say: Likewise, it has not been reported from him (peace and blessings of Allah be upon him) that he offered voluntary prayers before Dhuhr or after Asr here, nor in any of his travels, and it is not proven that he prayed any of the regular Sunnah prayers during them except the Sunnah of Fajr and Witr.\n4. Al-Bukhari from Ibn Umar in a suspended (Mu'allaq) narration. See \"Mukhtasar Al-Bukhari\" (25/89/3).",
    "book_id": "12090",
    "new_page_number": 27
  },
  {
    "serial_number": "4365862",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 29,
    "volume_number": 1,
    "text": "Standing in Arafah\n68- Then he sets out to Arafah and stands at the rocks at the bottom of the Mount of Mercy (Jabal al-Rahmah) if that is easy for him; otherwise, all of Arafah is a standing place.\n69- He stands facing the Qiblah, raising his hands, supplicating and reciting Talbiyah.\n70- He should increase the Tahlil (saying La ilaha illa Allah), for it is the best supplication on the Day of Arafah, due to his saying (peace and blessings of Allah be upon him): \"The best thing I and the Prophets have said on the evening of Arafah is: There is no deity but Allah alone, He has no partner, to Him belongs the dominion and to Him is the praise, and He is over all things competent\" (2).\n71- If he adds to the Talbiyah sometimes: \"Indeed, the [true] good is the good of the Hereafter,\" it is permissible (3).\n72- It is the Sunnah for the one standing in Arafah not to fast on this day.\n73- He continues in this manner, remembering Allah, reciting Talbiyah, supplicating as he wishes, hoping from Allah the Exalted that He makes him among His freed slaves whom He boasts about to the angels, as in the Hadith: \"There is no day on which Allah frees more slaves from the Fire than the Day of Arafah. Indeed, He draws near and boasts of them to the angels, saying: What do these want?\" (4). And in another Hadith: \"Indeed, Allah boasts to the inhabitants of heaven about the people of Arafat, saying: Look at My slaves, they have come to Me disheveled and dusty\" (5). He continues like this until the sun sets.",
    "foot_note": "2. A Hasan or Sahih Hadith, I have documented its chains in Al-Sahiha \"1503\".\n3. Due to it being proven from him (peace and blessings of Allah be upon him) as explained in the original work.\n4. Narrated by Muslim and others. See Al-Targhib \"2 / 129\".\n5. Narrated by Ahmad and others, and authenticated by a group as I clarified in \"Takhrij Al-Targhib\".",
    "book_id": "12090",
    "new_page_number": 28
  },
  {
    "serial_number": "4365863",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 30,
    "volume_number": 1,
    "text": "Departure from Arafah... Departure from Arafah:\n74- When the sun sets, he departs from Arafat to Muzdalifah with tranquility and calmness. He should not crowd people with his person, his mount, or his car. If he finds a gap, he speeds up.\n75- When he reaches it, he calls Adhan and Iqamah and prays Maghrib three [Rak'ahs], then calls Iqamah and prays Isha shortened, combining them.\n76- If he separates them for a need, it does not harm him (1).\n77- He does not pray anything between them nor immediately after either of them (2).\n78- Then he sleeps until Fajr.\n79- When dawn becomes clear to him, he prays at the beginning of its time with an Adhan and an Iqamah.\n\nFajr Prayer in Muzdalifah... Fajr Prayer in Muzdalifah\n80- Fajr prayer in Muzdalifah is mandatory for all pilgrims except for the weak and women; it is permissible for them to depart from it after midnight for fear of the crush of people.\n81- Then he comes to Al-Mash'ar Al-Haram \"which is a mountain in Muzdalifah\", climbs it, faces the Qiblah, praises Allah, magnifies Him (Takbir), declares His Oneness (Tahlil and Tawhid), and supplicates. He continues to do so until it becomes very light.",
    "foot_note": "1. Sheikh al-Islam Ibn Taymiyyah said: Due to that being proven from the Prophet (peace and blessings of Allah be upon him) and his Companions in Al-Bukhari \"25 / 94 / 801\" from Mukhtasar Al-Bukhari.\n2. Sheikh al-Islam said: When he arrives at Muzdalifah, he prays Maghrib before making the camels kneel if possible, then when they have made them kneel, they pray Isha. If he delays Isha, it does not harm him.\n\nNone",
    "book_id": "12090",
    "new_page_number": 29
  },
  {
    "serial_number": "4365865",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 31,
    "volume_number": 1,
    "text": "82- All of Muzdalifah is a standing place, so wherever he stands in it, it is permissible.\n83- Then he sets out before sunrise to Mina with calmness while reciting Talbiyah.\n84- When he comes to the bottom of Muhassir, he speeds up his pace if possible, and it is part of Mina.\n85- Then he takes the middle road which brings him out at the Great Jamrah.\n86- He picks up the pebbles with which he wants to throw at Jamrat al-Aqabah in Mina, which is the last of the Jamarat and the closest of them to Makkah.\n87- He faces the Jamrah and puts Makkah on his left and Mina on his right.\n88- He throws at it seven pebbles, like the pebbles of Khadhf (slinging), which are slightly larger than a chickpea.\n89- He says Takbir with every pebble (1).\n90- He cuts off the Talbiyah with the last pebble (2).\n91- He does not throw at it until after sunrise, even if he is among the women or the weak who were permitted to depart from Muzdalifah after midnight; this is one thing and throwing is another (3).\n92- He may throw at it after Zawal (noon) up to the night if he finds difficulty in",
    "foot_note": "1. As for the addition: \"O Allah, make it an accepted Hajj...\" which some authors mention, it is not proven from him (peace and blessings of Allah be upon him) as I clarified in Al-Da'ifah \"1107\".\n2. Narrated by Ibn Khuzaymah in his Sahih and he said: This is an authentic Hadith explaining what was ambiguous in other narrations, and that the meaning of his saying: 'until throwing Jamrat al-Aqabah' means completing its throwing. Fath al-Bari \"3 / 426\".\n3. This is something I detailed in the original work, so refer to it if you wish to be clear on the matter \"p. 80\".",
    "book_id": "12090",
    "new_page_number": 30
  },
  {
    "serial_number": "4365866",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 32,
    "volume_number": 1,
    "text": "throwing it before Zawal, as proven in the Hadith.\n93- When he finishes throwing the Jamrah, everything becomes lawful for him except women, even if he has not sacrificed or shaved; so he wears his clothes and perfumes himself.\n94- But he must perform Tawaf al-Ifadah on the same day if he wishes to continue in his aforementioned state of enjoyment (being lawful). Otherwise, if evening comes and he has not performed Tawaf, he returns to being Muhrim as he was before throwing. He must remove his clothes and put on the two garments of Ihram, due to his saying (peace and blessings of Allah be upon him): \"This is a day on which you have been granted permission, if you have thrown the Jamrah, to become lawful from everything you were prohibited from except women. But if you reach the evening before you perform Tawaf of this House, you become prohibited (Muhrim) as you were before throwing the Jamrah, until you perform Tawaf of it\" (1).",
    "foot_note": "1. It is an authentic Hadith and a group has strengthened it, including Imam Ibn al-Qayyim as I clarified in Sahih Abi Dawood \"1745\". When some virtuous people of knowledge saw this Hadith before the publication of the treatise, they found it strange, and some of them rushed to weaken it—as I had done myself in some of my books—based on the path in Abu Dawood. This path, although strengthened by Imam Ibn al-Qayyim in Al-Tahdhib and Al-Hafiz in Al-Talkhis by his silence upon it, I found other paths for it that make the one who sees them certain of the absence of weakness in it and its elevation to the rank of authenticity. But they are in a source not widely circulated among the majority, which is Sharh Ma'ani al-Athar by Imam al-Tahawi. It was hidden from them as it was hidden from me before, so they hastened to express strangeness or weakness. They were encouraged in this by finding some scholars saying about it: 'I do not know anyone of the jurists who held this view.' This is a negation, and it is not knowledge, for it is known among the people of knowledge that not knowing a thing does not necessitate knowledge of its non-existence. If the Hadith is proven from the Messenger of Allah (peace and blessings of Allah be upon him) and is explicit in indication like this one, it is obligatory to hasten to act upon it, and that does not depend on knowing the stance of the people of knowledge regarding it, as Imam Al-Shafi'i said: 'The report is accepted at the time it is proven, even if there has been no action by the Imams according to the report they accepted. The Hadith of the Messenger of Allah stands by itself; nothing else acts after it.' I say: The Hadith of the Messenger of Allah (peace and blessings of Allah be upon him) is too great to require the action of jurists as a witness for it, for it is =",
    "book_id": "12090",
    "new_page_number": 31
  },
  {
    "serial_number": "4365867",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 33,
    "volume_number": 1,
    "text": "= an independent foundation, ruling and not ruled upon. Nevertheless, a group of the people of knowledge acted upon the Hadith, including Urwah bin Al-Zubayr, the great Tabi'i. So after this, does anyone have an excuse to abandon acting upon it? {Indeed in that is a reminder for whoever has a heart or who listens while he is present [in mind]}. The detail of this summary is in the aforementioned work. Know that throwing the Jamrah for the people of the season (pilgrims) is like the Eid prayer for others. For this reason, Ahmad recommended that the prayer of the people of the cities be at the time of sacrifice in Mina. For this reason, the Prophet (peace and blessings of Allah be upon him) gave a sermon on the Day of Sacrifice after the Jamrah just as he used to give a sermon in Madinah after the Eid prayer. So the recommendation of some for Eid prayer in Mina, taking from general wordings or analogy, is a mistake and negligence of the Sunnah, for the Prophet (peace and blessings of Allah be upon him) and his Caliphs never prayed an Eid in Mina, as in Fatawa Ibn Taymiyyah \"26 / 180\".\n\nSlaughter and Sacrifice (Nahr)\n95- Then he comes to the slaughter place in Mina and sacrifices his Hady, and this is the Sunnah.\n96- But it is permissible for him to sacrifice in any other place in Mina, and likewise in Makkah, due to his saying (peace and blessings of Allah be upon him): \"I have sacrificed here, and all of Mina is a place of sacrifice, and all the mountain passes of Makkah are a path and place of sacrifice, so sacrifice in your dwellings\" (1).\n97- The Sunnah is to slaughter or sacrifice with his own hand if that is easy for him; otherwise, he deputizes someone else.\n98- He slaughters it facing the Qiblah (2), laying it on its left side",
    "foot_note": "None\n\n1. I say: In this command is an easing for the pilgrims and an elimination of the greater part of the problem of accumulated carcasses in the slaughterhouse and the necessity for the authorities there to bury them in the ground. Whoever wishes for elaboration should refer to the original \"p. 87-88\".\n2. Regarding this, there is a Marfu' Hadith from Jabir in Abu Dawood and others, documented in \"Al-Irwa\" \"1138\", and another in Al-Bayhaqi \"9 / 285\". It was narrated from Ibn Umar that he liked to face the Qiblah when slaughtering. Abdur-Razzaq narrated \"8585\" with an authentic chain from him that he disliked eating a slaughtered animal slaughtered facing other than the Qiblah.",
    "book_id": "12090",
    "new_page_number": 32
  },
  {
    "serial_number": "4365869",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 34,
    "volume_number": 1,
    "text": "and he places his right foot on its right side (1).\n99- As for camels, the Sunnah is to sacrifice them while they are standing, with the left leg tied, standing on the remaining legs (2), with its face towards the Qiblah (3).\n100- He says at the time of slaughter or sacrifice: \"In the name of Allah, and Allah is the Greatest. O Allah, this is from You and for You (4). O Allah, accept from me\" (5).\n101- The time of slaughter is the four days of Eid: the Day of Sacrifice, which is the day of the Greatest Hajj (6), and the three Days of Tashriq, due to his saying (peace and blessings of Allah be upon him): \"All the Days of Tashriq are for slaughter\" (7).\n102- He may eat from his Hady and take provisions from it to his country as the Prophet (peace and blessings of Allah be upon him) did.",
    "foot_note": "1. Al-Hafiz said \"10 / 16\": \"To be easier for the slaughterer in taking the knife with the right hand and holding its head with his left hand.\" I say: Laying it down and placing the foot on its side is from what the two Sheikhs extracted.\n2. Sahih Abi Dawood \"1550\". After it, there is a witnessing report from the Hadith of Ibn Umar similar to it, extracted by the two Sheikhs.\n3. Narrated by Malik with an authentic chain from Ibn Umar as a Mawquf narration, and Al-Bukhari suspended it with a format of certainty, number \"330\" of \"Mukhtasari li'l-Bukhari\".\n4. Extracted by Abu Dawood and others from the Hadith of Jabir, and it has a witness from the Hadith of Abu Sa'id Al-Khudri narrated by Abu Ya'la as in \"Al-Majma'\" \"4 / 22\", and it is documented in \"Al-Irwa\" \"1118\".\n5. Narrated by Muslim and others from Aisha, and it is documented in the previous source. Sheikh al-Islam added in his \"Mansak\": \"as You accepted from Abraham, Your Friend.\" I did not find it in any of the books of Sunnah available to me.\n6. Al-Bukhari suspended it, and Abu Dawood and others connected it. \"Sahih Abi Dawood\" \"1700 and 1701\".\n7. Extracted by Ahmad and authenticated by Ibn Hibban. It is strong in my view due to the sum of its paths; therefore, I documented it in \"Al-Sahiha\" \"2476\".",
    "book_id": "12090",
    "new_page_number": 33
  },
  {
    "serial_number": "4365870",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 35,
    "volume_number": 1,
    "text": "103- He must feed the poor and the needy from it, due to the saying of the Exalted: {And the camels and cattle We have appointed for you as among the symbols of Allah; for you therein is good. So mention the name of Allah upon them when lined up [for sacrifice]; and when they are [lifeless] on their sides, then eat from them and feed the needy and the beggar} (1).\n104- It is permissible for seven people to share a camel or a cow.\n105- Whoever does not find a Hady must fast three days during Hajj and seven when he returns to his family.\n106- It is permissible for him to fast during the three Days of Tashriq due to the Hadith of Aisha and Ibn Umar (may Allah be pleased with them), who said: \"No permission was given for the Days of Tashriq to be fasted except for the one who did not find the Hady\" (2).\n107- Then he shaves his entire head or cuts it, and the first is better due to his saying (peace and blessings of Allah be upon him): \"O Allah, have mercy on those who shave.\" They said: \"And those who cut, O Messenger of Allah?\" He said: \"O Allah, have mercy on those who shave.\" They said: \"And those who cut, O Messenger of Allah?\" When it was the fourth time, he said: \"And those who cut\" (3).\n108- The Sunnah is for the barber to begin with the right side of the shaved person, as in the Hadith of Anas (may Allah be pleased with him) (4).",
    "foot_note": "1. \"Al-Qani'\": The one who asks. \"Al-Mu'tarr\": The one who presents himself for the meat, circling around it, whether rich or poor.\n2. Narrated by Al-Bukhari and others, and it is documented in \"Irwa al-Ghalil\" \"964\". As for the statement of Sheikh al-Islam \"p. 388\": \"The Mutamatti' must fast some of the three days before entering Ihram for Hajj on the Day of Tarwiyah,\" I do not know its basis; rather, it is apparently contrary to the verse and the Hadith. And Allah knows best.\n3. Narrated by the two Sheikhs and others from the Hadith of Ibn Umar and others, and it is documented in the previous source \"1084\".\n4. Narrated by Muslim and others, and it is documented in \"Al-Irwa\" \"1085\" and \"Sahih Abi Dawood\" \"1730\". This issue is among those where the scholar Ibn Humam Al-Hanafi admitted that the Hanafis contradicted the Sunnah in it. So what do the blind followers say regarding the admission of this magnanimous Imam?!",
    "book_id": "12090",
    "new_page_number": 34
  },
  {
    "serial_number": "4365871",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 36,
    "volume_number": 1,
    "text": "109- Shaving is specific to men, not women. Women are only required to cut their hair, due to his saying (peace and blessings of Allah be upon him): \"There is no shaving upon women; upon women is only cutting\" (1). She gathers her hair and cuts from it the amount of a fingertip (2).\n110- It is Sunnah for the Imam to give a sermon on the Day of Sacrifice in Mina (3) between the Jamarat (4) when the forenoon is high (5), teaching the people their rituals (6).\n\nTawaf al-Ifadah\n111- Then he proceeds on his day to the House and performs Tawaf around it seven times as previously mentioned in Tawaf al-Qudum, except that he does not uncover his shoulder (Idtiba) nor jog (Raml).\n112- It is Sunnah to pray two Rak'ahs at the Station (Maqam) as Al-Zuhri said (7), and Ibn Umar did it (8) and said: For every seven [circuits] there are two Rak'ahs (9).",
    "foot_note": "1. It is an authentic Hadith documented in \"Al-Ahadith Al-Sahiha\" \"605\" and I included it in \"Sahih Abi Dawood\" \"1732\".\n2. Sheikh al-Islam said: \"If she cuts all the hair, she cuts from it the amount of a fingertip, or less or more. A woman does not cut more than that. As for the man, he may cut it as short as he wishes.\"\n3. Narrated by Al-Bukhari and Abu Dawood from a group of Companions. See \"Sahih Abi Dawood\" \"1705, 1707, 1709 and 1710\" and \"Mukhtasar Al-Bukhari\" \"847\".\n4. Narrated by Al-Bukhari in a suspended manner and Abu Dawood connected it. See \"Sahih Abi Dawood\" \"1700\" and \"Irwa al-Ghalil\" \"1064\".\n5. Narrated by Abu Dawood and others. See \"Sahih Abi Dawood\" \"1709\".\n6. Narrated by Abu Dawood and others. See \"Sahih Abi Dawood\" \"1710\".\n\n7. Al-Bukhari suspended it, and Ibn Abi Shaybah and others connected it. See \"Mukhtasar Al-Bukhari\" No. \"319, Vol 1, p 386\".\n8. Al-Bukhari suspended it, and Abdur-Razzaq connected it. See the mentioned source No. \"318\".\n9. Narrated by Abdur-Razzaq \"9012\" with an authentic chain from him.",
    "book_id": "12090",
    "new_page_number": 35
  },
  {
    "serial_number": "4365873",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 37,
    "volume_number": 1,
    "text": "113- Then he performs Tawaf and Sa'i between Al-Safa and Al-Marwah as previously mentioned as well, contrary to the Qarin and the Mufrid, for whom the first Sa'i suffices.\n114- With this Tawaf, everything that was prohibited to him by Ihram becomes lawful, even his wives.\n115- He prays Dhuhr in Makkah, and Ibn Umar said: In Mina (1).\n116- He comes to Zamzam and drinks from it.\n\nSpending the Night in Mina:\n117- Then he returns to Mina and stays there for the Days of Tashriq and their nights.\n118- He throws at the three Jamarat during them every day after Zawal (noon) with seven pebbles for each Jamrah as previously mentioned in the throwing on the Day of Sacrifice \"86, 90\".\n119- He begins with the First Jamrah, which is the closest to Masjid Al-Khayf. When he finishes throwing it, he moves forward a little to his right, stands facing the Qiblah for a long time, supplicates, and raises his hands (2).\n120- Then he comes to the Second Jamrah and throws at it likewise. Then he takes to the left, stands facing the Qiblah for a long time, supplicates, and raises his hands (2).\n121- Then he comes to the Third Jamrah, which is Jamrat al-Aqabah, throws at it likewise, placing the House on his left and Mina on his right, and he does not stand at it (2).",
    "foot_note": "1. I say: And Allah knows best which of them the Messenger of Allah (peace and blessings of Allah be upon him) did. It is possible that he prayed with them twice: once in Makkah and once in Mina; the first being obligatory and the second being voluntary, as happened to him (peace and blessings of Allah be upon him) in some of his wars.\n\n2. All of that is proven in the Hadith of Ibn Mas'ud in the two Sheikhs and others. As for what is in some \"Ritual Books\" (Manasik) that he faces the Qiblah when throwing Jamrat al-Aqabah, it is contrary to this authentic Hadith. Whatever contradicts it is Shadh (anomalous), nay, Munkar (denounced), as I clarified in \"Al-Da'ifah\" \"4864\".",
    "book_id": "12090",
    "new_page_number": 36
  },
  {
    "serial_number": "4365875",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 38,
    "volume_number": 1,
    "text": "122- Then he throws on the second day and the third day likewise.\n123- If he departs after his throwing on the second day and does not stay the night to throw on the third day, it is permissible due to the saying of the Exalted: {And remember Allah during [specific] numbered days. Then whoever hastens [his departure] in two days, there is no sin upon him; and whoever delays [until the third], there is no sin upon him - for him who fears Allah}. But delaying for the throwing is better because it is the Sunnah (1).\n124- The Sunnah is the order between the aforementioned rituals: Throwing, then Slaughtering or Sacrificing, then Shaving, then Tawaf al-Ifadah, then Sa'i for the Mutamatti'. But if he advances something of them or delays it, it is permissible due to his saying (peace and blessings of Allah be upon him): \"No harm, no harm.\"\n125- It is permissible for one with an excuse regarding throwing to do the following:\nA- Not spending the night in Mina, due to the Hadith of Ibn Umar: \"Al-Abbas asked permission of the Messenger of Allah (peace and blessings of Allah be upon him) to spend the night in Makkah during the nights of Mina because of his water-providing service, so he gave him permission\" (2).\nB- To combine the throwing of two days into one, due to the Hadith of Asim bin Adi who said:",
    "foot_note": "1. Sheikh al-Islam Ibn Taymiyyah said: \"If the sun sets while he is in Mina, he stays until he throws with the people on the third day.\" I say: This is the view of the majority of scholars, contrary to what Ibn Hazm went to in \"Al-Muhalla\" \"7 / 185\". Al-Nawawi argued for them using the implied meaning of the saying of the Exalted: {Then whoever hastens [his departure] in two days, there is no sin upon him}, saying in \"Al-Majmu'\" \"8 / 283\": \"'Day' is a name for the daytime excluding the night.\" And by what is proven from Umar and his son Abdullah, who said: \"Whoever is overtaken by the evening on the second day in Mina, let him stay until the morrow so that he may depart with the people.\" The wording of \"Al-Muwatta\" from Ibn Umar is: \"He should not depart until he throws the Jamarat the next day.\" Imam Muhammad extracted it from Malik in his \"Muwatta\" \"p. 233 Al-Ta'liq Al-Mumajjad\" and said: \"And we take this view, and it is the saying of Abu Hanifa and the general populace.\"\n2. Narrated by the two Sheikhs and others, and it is documented in \"Al-Irwa\" \"1079\". I have pointed out there that attributing it in the original to the Hadith of Ibn Abbas was a mistake.",
    "book_id": "12090",
    "new_page_number": 37
  },
  {
    "serial_number": "4365876",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 39,
    "volume_number": 1,
    "text": "\"The Messenger of Allah (peace and blessings of Allah be upon him) granted a concession to the camel herders regarding spending the night, that they throw on the Day of Sacrifice, then combine the throwing of two days after the Day of Sacrifice and throw them on one of them\" (1).\nC- To throw at night, due to his saying (peace and blessings of Allah be upon him): \"The shepherd throws at night and grazes during the day\" (2).\n126- It is prescribed for him to visit the Kaaba and perform Tawaf around it every night of the nights of Mina, because the Prophet (peace and blessings of Allah be upon him) did that (3).\n127- The pilgrim must maintain the five daily prayers in congregation during the days of Mina, and it is best to pray in Masjid Al-Khayf if possible, due to his saying (peace and blessings of Allah be upon him): \"Seventy Prophets prayed in Masjid Al-Khayf\" (4).\n128- When he finishes throwing on the second or third day of the Days of Tashriq, he has finished the rituals of Hajj. He then departs to Makkah and stays there as long as Allah has written for him. He should be keen to perform prayer in congregation, especially in the Sacred Mosque, due to his saying (peace and blessings be upon him): \"A prayer in my mosque is better than a thousand prayers in any other, except the Sacred Mosque,",
    "foot_note": "1. Extracted by the authors of the \"Sunan\" and authenticated by a group. It is documented in the previous source number \"1080\".\n2. A Hasan Hadith extracted by Al-Bazzar, Al-Bayhaqi, and others from Ibn Abbas. Al-Hafiz classified its chain as Hasan, and it has witnessing reports I documented in \"Al-Sahiha\" \"2477\".\n3. Al-Bukhari suspended it \"287 Mukhtasari li'l-Bukhari\" and a group connected it whom I mentioned in \"Al-Sahiha\" \"804\".\n4. Extracted by Al-Tabarani and Al-Diya Al-Maqdisi in \"Al-Mukhtara\". Al-Mundhiri classified its chain as Hasan, and it is as he said considering it has another path as I verified in \"Tahdhir Al-Sajid min Ittikhadh Al-Qubur Masajid\" \"p 106 107 Second Edition, Al-Maktab Al-Islami\".",
    "book_id": "12090",
    "new_page_number": 38
  },
  {
    "serial_number": "4365877",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 40,
    "volume_number": 1,
    "text": "and a prayer in the Sacred Mosque is better than one hundred thousand prayers in any other\" (1).\n129- He should perform much Tawaf and prayer at any time he wishes, night or day, due to his saying (peace and blessings of Allah be upon him) regarding the two corners, the Black Stone and the Yemeni Corner: \"Touching them erases sins. Whoever circles the House does not raise a foot or put down a foot except that Allah writes for him a good deed and erases from him a sin and raises him a degree. Whoever counts a week (seven circuits) is like freeing a slave\" (2). And his saying: \"O Banu Abd Manaf, do not prevent anyone who has circled this House and prayed at any hour he wished of night or day\" (3).\n\nFarewell Tawaf:\n130 - When he finishes attending to his needs and resolves to depart, he must bid farewell to the House with Tawaf, due to the Hadith of Ibn Abbas who said: The people used to disperse in every direction, so the Prophet (peace and blessings of Allah be upon him) said: \"No one should depart until his last rite is the Tawaf of the House\" (4).\n131- The menstruating woman used to be ordered to wait until she became pure",
    "foot_note": "1. Extracted by Ahmad and others from the Hadith of Jabir as Marfu' with an authentic chain, and a group authenticated it whom I mentioned in \"Al-Irwa\" \"1129\".\n2. Extracted by Al-Tirmidhi and others, and authenticated by Ibn Khuzaymah, Ibn Hibban, Al-Hakim, and others. It is documented in \"Al-Mishkat\" \"258\" and \"Al-Targhib\" \"2 / 120 and 122\".\n3. Narrated by the authors of the Sunan and others, and authenticated by Al-Tirmidhi, Al-Hakim, and Al-Dhahabi. It is documented in \"Al-Irwa\" \"481\".\n\n4. Narrated by Muslim and others, and Al-Bukhari with a similar wording. It is documented in \"Al-Irwa\" \"1086\" and \"Sahih Abi Dawood\" \"1747\".",
    "book_id": "12090",
    "new_page_number": 39
  },
  {
    "serial_number": "4365879",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 41,
    "volume_number": 1,
    "text": "to perform the Farewell Tawaf (1). Then she was granted a concession to depart and not wait, due to the Hadith of Ibn Abbas also: \"That the Prophet (peace and blessings of Allah be upon him) granted a concession to the menstruating woman to depart before performing Tawaf if she had already performed Tawaf al-Ifadah\" (2).\n132- He may carry with him whatever Zamzam water is easy for him, seeking blessings from it, for: \"The Messenger of Allah (peace and blessings of Allah be upon him) used to carry it with him in water skins and vessels, and he would pour it on the sick and give it to them to drink\" (3). Indeed: \"He used to send, while he was in Madinah before Makkah was conquered, to Suhayl bin Amr: 'Gift us some Zamzam water and do not refuse.' So he would send him two large skins\" (4).\n133- When he finishes Tawaf, he exits as people exit from mosques; he does not walk backward. He exits putting his left foot forward (5), saying: \"O Allah, send blessings upon Muhammad and grant him peace. O Allah, I ask You of Your bounty.\"",
    "foot_note": "1. This is proven in the Hadith of Al-Harith bin Abdullah bin Aws in Ahmad and others. It is documented in \"Sahih Abi Dawood\" \"1748\".\n2. Extracted by Ahmad with an authentic chain on the condition of the two Sheikhs, and they extracted a similar one as indicated in \"Al-Irwa\" \"1086\". It has a witnessing report from the Hadith of Aisha in their books, documented in \"Sahih Abi Dawood\" \"1748\".\n3. Extracted by Al-Bukhari in \"Al-Tarikh\" and Al-Tirmidhi, who classified it as Hasan, from the Hadith of Aisha (may Allah be pleased with her). It is documented in \"Al-Ahadith Al-Sahiha\" \"883\".\n4. Extracted by Al-Bayhaqi with a good (Jayyid) chain from Jabir (may Allah be pleased with him). It has an authentic Mursal witnessing report in \"Musannaf Abdur-Razzaq\" \"9127\". Ibn Taymiyyah mentioned that the Salaf used to carry it.\n5. See the graduation of the previous paragraph 24 - p. 18.",
    "book_id": "12090",
    "new_page_number": 40
  },
  {
    "serial_number": "4365880",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 42,
    "volume_number": 1,
    "text": "Innovations of Hajj, Umrah, and Ziyarah\nI have seen fit to append a supplement to the book in which I list the innovations of Hajj and visiting Madinah Al-Munawwarah and Bayt Al-Maqdis (Jerusalem) (1), because many people do not know them and fall into them. So I wanted to increase my advice to them by clarifying them and warning against them. That is because a deed is not accepted by Allah, Blessed and Exalted, unless two conditions are met in it:\nFirst: That it be purely for His Face, Mighty and Majestic.\nAnd the other: That it be righteous. And it is not righteous unless it is in accordance with the Sunnah, not contradicting it. It is established among the verifiers of the people of knowledge that every alleged act of worship which the Messenger of Allah (peace and blessings of Allah be upon him) did not legislate for us by his saying, nor did he draw near to Allah by doing it, contradicts his Sunnah. This is because the Sunnah is of two types: Sunnah of action and Sunnah of abandonment. Whatever he (peace and blessings of Allah be upon him) abandoned of those acts of worship, it is Sunnah to abandon them. Do you not see, for example, that the Adhan for the two Eids and for burying the dead, despite being a remembrance and glorification of Allah, Mighty and Majestic, is not permissible to use to draw near to Allah, Mighty and Majestic? That is only because it is a Sunnah that the Messenger of Allah (peace and blessings of Allah be upon him) abandoned. His Companions (peace and blessings of Allah be upon him) understood this meaning, so warnings against innovations abounded from them, general warnings as mentioned in its place. Hudhayfah bin Al-Yaman (may Allah be pleased with him) even said: \"Every act of worship that the Companions of the Messenger of Allah (peace and blessings of Allah be upon him) did not perform, do not perform it.\" And Ibn Mas'ud (may Allah be pleased with him) said: \"Follow and do not innovate, for you have been sufficed; stick to the ancient affair.\" So congratulations to him whom Allah grants success to be sincere to Him in his worship and to follow the Sunnah of His Prophet (peace and blessings of Allah be upon him), and does not mix it with innovation. Then let him rejoice in Allah, Mighty and Majestic, accepting his obedience and admitting him",
    "foot_note": "1. May Allah return it and all Muslim lands to them.",
    "book_id": "12090",
    "new_page_number": 41
  },
  {
    "serial_number": "4365881",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 43,
    "volume_number": 1,
    "text": "into His Paradise. May Allah make us among those who listen to speech and follow the best of it. Know that the reference of the innovations referred to returns to several matters:\nFirst: Weak Hadiths which are not permissible to use as proof nor attribute to the Prophet (peace and blessings of Allah be upon him). Such things are not permissible to act upon according to us, as I clarified in the introduction of \"Sifat Salat al-Nabi (Description of the Prophet's Prayer)\". This is the school of a group of the people of knowledge like Ibn Taymiyyah and others.\nSecond: Fabricated Hadiths or those with no basis, whose matter was hidden from some jurists, so they built upon them rulings that are from the core of innovations and introduced matters!\nThird: Interpretations (Ijtihad) and preferences (Istihsan) issued by some jurists, especially the later ones, which they did not support with any legal evidence; rather, they presented them as if they were accepted matters until they became Sunnahs to be followed. It is not hidden from the one with insight into his religion that this is something not permissible to follow, for there is no legislation except what Allah the Exalted legislated. It is enough for the one who considers something good (Mustahsin), if he is a Mujtahid, that it be permissible for him alone to act upon what he deemed good and that Allah not hold him accountable for it. But for people to take that as Sharia and Sunnah, then no, and again no. How is it when some of them are contrary to the practical Sunnah, as will be alerted to, God willing?\nFourth: Customs and superstitions not indicated by the Law nor attested to by reason, even if some ignorant people act upon them and take them as a law for themselves, and they did not lack those who support them, even in some of that, among those who claim to be people of knowledge and dress in their garb.\nThen let it be known that these innovations are not of one level in status; rather, they are of degrees. Some of them are Shirk and explicit Kufr as you will see, and some are less than that. But it must be known that the smallest innovation a man brings into the religion is",
    "foot_note": "None",
    "book_id": "12090",
    "new_page_number": 42
  },
  {
    "serial_number": "4365882",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 44,
    "volume_number": 1,
    "text": "forbidden after it becomes clear that it is an innovation. There is nothing in innovations, as some imagine, that is only in the rank of Makruh (disliked). How can that be when the Messenger of Allah (peace and blessings of Allah be upon him) says: \"Every innovation is misguidance, and every misguidance is in the Fire,\" meaning its doer. Imam Al-Shatibi, may Allah have mercy on him, verified this most completely in his great book \"Al-I'tisam\". Therefore, the matter of innovation is very dangerous, and most people are still heedless of it; only a group of the people of knowledge know that. Sufficient proof for you regarding the danger of innovation is his saying (peace and blessings of Allah be upon him): \"Indeed, Allah has blocked repentance from every person of innovation until he leaves his innovation.\" Narrated by Al-Tabarani and Al-Diya Al-Maqdisi in \"Al-Ahadith Al-Mukhtara\" and others with an authentic chain, and Al-Mundhiri classified it as Hasan (1).\nI conclude this word with advice I present to the readers from a great Imam of the early Muslim scholars, Sheikh Al-Hasan bin Ali Al-Barbahari, from the companions of Imam Ahmad, may Allah have mercy on him, who died in the year \"329\". He said, may Allah the Exalted have mercy on him: \"Beware of small introduced matters, for small innovations return until they become large. Likewise, every innovation introduced in this Umrah began as something small resembling the truth, so he who entered into it was deceived by that, then he could not get out of it. So it became great and became a religion that is practiced. So look, may Allah have mercy on you, at everyone whose speech you hear from the people of your time specifically; do not rush and do not enter into anything of it until you ask and look: Did anyone of the Companions of the Messenger of Allah (peace and blessings of Allah be upon him) speak about it, or anyone of the scholars? If you find a trace from them, hold onto it, do not go beyond it for anything, and do not choose anything over it, lest you fall into the Fire. Know, may Allah have mercy on you, that the Islam of a servant is not complete until he is a follower, confirming",
    "foot_note": "1. It is documented in \"Silsilat Al-Ahadith Al-Sahiha\" \"1620\".",
    "book_id": "12090",
    "new_page_number": 43
  },
  {
    "serial_number": "4365883",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 45,
    "volume_number": 1,
    "text": "and submitting. So whoever claims that there remains anything of the matter of Islam that the Companions of the Messenger of Allah (peace and blessings of Allah be upon him) did not suffice us in, he has lied against them. This is sufficient as division and impugning them; so he is an innovator, misguided, misguiding, introducing into Islam what is not in it.\"\nI say: May Allah have mercy on Imam Malik when he said: \"The latter part of this nation will not be rectified except by that which rectified its first part. What was not religion then is not religion today.\"\nMay Allah send blessings upon our Prophet who said: \"I have not left anything that brings you closer to Allah except that I have commanded you with it, and I have not left anything that distances you from Allah and brings you closer to the Fire except that I have forbidden you from it.\"\nPraise be to Allah by whose grace good deeds are completed.\n\nInnovations Before Ihram\n1- Abstaining from travel in the month of Safar and refraining from starting actions in it, such as marriage, consummation, etc.\n2- Abstaining from travel during the waning of the moon (Muhaq) and when the moon is in Scorpio.\n3- Refraining from cleaning the house and sweeping it after the traveler departs.\n4- Praying two Rak'ahs when leaving for Hajj, reciting in the first after Al-Fatihah {Say, O disbelievers} and in the second \"Al-Ikhlas\". When finished, saying: \"O Allah, with You I have spread out and to You I have turned...\" and reciting Ayat al-Kursi, Surah Al-Ikhlas, Al-Mu'awwidhatayn, and other things mentioned in some fiqh books.\n5- Praying four Rak'ahs.\n6- The one intending Hajj reading, when leaving his house, the end of Surah \"Al Imran\", Ayat al-Kursi, {Indeed, We sent it down}, and \"The Mother of the Book\" (Al-Fatihah), claiming that in them is the fulfillment of worldly and Otherworldly needs.",
    "foot_note": "None\n\nNone",
    "book_id": "12090",
    "new_page_number": 44
  },
  {
    "serial_number": "4365885",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 46,
    "volume_number": 1,
    "text": "7- Loudly reciting Dhikr and Takbir when seeing off pilgrims and upon their arrival.\n8- Calling Adhan when bidding them farewell.\n9- The Mahmal (palanquin) and the celebration of the Kaaba's covering (Kiswah) (1).\n10- Seeing off pilgrims by some states with music!\n11- Traveling alone seeking intimacy with Allah the Exalted, as some Sufis claim!\n12- Traveling without provisions to validate the claim of reliance (Tawakkul)!\n13- \"Traveling to visit the graves of Prophets and righteous people.\"\n14- \"A man contracting marriage with a married woman if she intends Hajj and has no Mahram, contracting marriage with her so he can be with her as a Mahram\" (2).\n15- A woman making a pact of brotherhood with a foreign man so he becomes, according to their claim, a Mahram for her, then treating him as she treats her Mahrams.\n16- A woman traveling with a group of trustworthy women, according to their claim, without a Mahram. Similar to this is if one of them has a Mahram, and they claim he is a Mahram for all of them!\n17- Taking Maks (3) from pilgrims intending to perform the obligatory Hajj.\n18- The traveler praying two Rak'ahs every time he makes a stop and saying: O Allah, cause me to land a blessed landing, and You are the best of those who bring to land.\n19- The traveler reading in every stop he makes Surah Al-Ikhlas eleven times, Ayat al-Kursi once, and the verse {They have not appraised Allah with true appraisal} once.",
    "foot_note": "1. This innovation has been eliminated, praise be to Allah, years ago, but in its place is still the innovation that follows it. In Al-Bajuri on Ibn Al-Qasim \"1 / 41\": \"It is forbidden to watch the known Mahmal and the covering of Maqam Ibrahim and the like.\"\n2. This and the one after it are among the most wicked innovations because of the trickery against the Sharia and exposure to falling into immorality, as is not hidden.\n3. Meaning customs tax.",
    "book_id": "12090",
    "new_page_number": 45
  },
  {
    "serial_number": "4365886",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 47,
    "volume_number": 1,
    "text": "20- Eating from Faha \"meaning onions\" of every land the traveler comes to.\n21- \"Intending a spot hoping for good by intending it, while the Sharia has not recommended that, such as places said to contain a trace of the Prophet (peace and blessings of Allah be upon him), as is said about the rock in Jerusalem and the Foot Mosque south of Damascus. Likewise, the shrines of Prophets and righteous people\" (1).\n22- \"Unsheathing weapons upon arriving at Tabuk.\"\n\nInnovations of Ihram, Talbiyah, and Others:\n23- Adopting special sandals with specific conditions known in some books.\n24- Entering Ihram before the Miqat.\n25- \"Idtiba (exposing the shoulder) at the time of Ihram.\"\n26- Verbalizing the intention (Niyyah).\n27- \"Performing Hajj silently, not speaking.\"\n28- \"Reciting Talbiyah in a group with one voice.\"\n29- \"Takbir and Tahlil instead of Talbiyah.\"\n30- Saying after Talbiyah: \"O Allah, I intend Hajj, so make it easy for me, help me perform its obligation, and accept it from me. O Allah, I have intended to perform Your obligation in Hajj, so make me among those who responded to You...\"\n31- \"Intending the mosques that are in Makkah and around it other than the Sacred Mosque, such as the mosque below Al-Safa, and what is at the foot of Abu Qubais,",
    "foot_note": "1. It is authentically reported from Umar (may Allah be pleased with him) that he saw people during his Hajj rushing to a place. He said: What is this? It was said: A mosque in which the Messenger of Allah (peace and blessings of Allah be upon him) prayed. He said: Thus those before you were destroyed; they took the traces of their prophets as churches. Whoever encounters prayer time in them, let him pray; otherwise, let him not pray.\n\nNone",
    "book_id": "12090",
    "new_page_number": 46
  },
  {
    "serial_number": "4365888",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 48,
    "volume_number": 1,
    "text": "and the Birthplace Mosque and similar mosques built on the traces of the Prophet (peace and blessings of Allah be upon him).\"\n32- \"Intending the mountains and spots around Makkah like Mount Hira and the mountain near Mina which is said to be where the ransom (of Ishmael) took place, and the like.\"\n33- Intending to pray in the Mosque of Aisha at \"Al-Tan'im.\"\n34- \"Making the sign of the cross before the House\" (1).\n\nInnovations of Tawaf\n35- \"Ghusl (bathing) for Tawaf.\"\n36- The person performing Tawaf wearing socks or the like so as not to step on pigeon droppings, and covering his hands so as not to touch a woman.\n37- The Muhrim praying Tahiyat al-Masjid (greeting the mosque) when entering the Sacred Mosque (2).\n38- \"His saying: I intend by my Tawaf this week (seven circuits) such and such.\"\n39- \"Raising the hands when touching the Black Stone just as one raises them for prayer.\"\n40- \"Making a sound when kissing the Black Stone.\"\n41- Crowding to kiss it and racing the Imam in Taslim in prayer to kiss it.\n42- \"Rolling up something like his sleeve when touching the Stone or the Yemeni Corner.\"\n43- \"Their saying when touching the Stone: O Allah, out of faith in You and believing in Your Book.\"\n44- Saying when touching the Stone: O Allah, I seek refuge in You from pride",
    "foot_note": "1. It appears to be wiping the face and chest with the hands over the face, [resembling] crucifixion (Talsib).\n\n2. Rather, its greeting is Tawaf, then prayer behind the Station as previously mentioned from his action (peace and blessings of Allah be upon him). See \"Al-Qawa'id Al-Nuraniyyah\" by Ibn Taymiyyah \"101\".",
    "book_id": "12090",
    "new_page_number": 47
  },
  {
    "serial_number": "4365890",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 49,
    "volume_number": 1,
    "text": "and poverty, and ranks of disgrace in this world and the Hereafter.\n45- \"Placing the right hand over the left during Tawaf.\"\n46- Saying opposite the door of the Kaaba: O Allah, the House is Your House, the Sanctuary is Your Sanctuary, the Security is Your Security, and this is the station of the one seeking refuge in You from the Fire, pointing to the Station of Abraham, peace be upon him.\n47- Supplication at the Iraqi Corner: O Allah, I seek refuge in You from doubt, Shirk, schism, hypocrisy, bad character, and an evil return regarding wealth, family, and children.\n48- Supplication under the Gutter (Mizab): O Allah, shade me in Your shade on the Day when there is no shade but Your shade... etc.\n49- Supplication during Raml: O Allah, make it an accepted Hajj, a forgiven sin, a thanked effort, and a trade that will not perish, O Mighty, O Forgiving.\n50- And in the remaining four circuits: My Lord, forgive and have mercy, and overlook what You know; indeed You are the Most Mighty, the Most Noble.\n51- Kissing the Yemeni Corner.\n52- \"Kissing the two Levantine Corners and the Station (Maqam) and touching them.\"\n53- \"Wiping oneself against the walls of the Kaaba and the Station.\"\n54- Seeking blessings from \"The Trusty Handhold (Al-Urwa Al-Wuthqa): which is a high place on the wall of the House opposite the door of the House; the common people claim that whoever reaches it with his hand has grasped the Trusty Handhold.\"\n55- \"A nail in the center of the House which they called the Navel of the World; one of them uncovers his navel and lies flat with it on that place so that he is placing his navel on the Navel of the World.\"",
    "foot_note": "None",
    "book_id": "12090",
    "new_page_number": 48
  },
  {
    "serial_number": "4365891",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Rituals of Hajj and Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 50,
    "volume_number": 1,
    "text": "56- Intending to perform Tawaf in the rain, claiming that whoever does that is forgiven his past sins.\n57- Seeking blessings from the rain falling from the Gutter of Mercy of the Kaaba.\n58- \"Refraining from Tawaf in dirty clothes.\"\n59- The pilgrim emptying his leftover Zamzam water into the well and saying: O Allah, I ask You for extensive provision, beneficial knowledge, and healing from every disease.\n60- Some people bathing with Zamzam.\n61- \"Their concern with soaking their beards and soaking the money and clothes they have with Zamzam so that blessing may descend upon them.\"\n62- What is mentioned in some books that one should breathe into the drinking of Zamzam water several times, raising his gaze each time and looking at the House!",
    "foot_note": "None",
    "book_id": "12090",
    "new_page_number": 49
  },
  {
    "serial_number": "4365893",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 51,
    "volume_number": 1,
    "text": "Innovations of Arafah: 72- Standing at Mount Arafah on the eighth day for an hour as a precaution fearing a mistake in the crescent moon sighting. 73- 'Lighting many candles on the eve of Arafah in Mina'. 74- Supplicating on the eve of Arafah with ten words a thousand times: Glory be to Him whose Throne is in the heavens, Glory be to Him whose foothold is on earth... etc. 75- 'Their departure on the eighth day from Mecca to Arafah in one journey'. 76- 'Departing from Mina to Arafah at night'. 77- 'Lighting fires and candles on Mount Arafat on the eve of Arafah'. 78- Bathing for the Day of Arafah. 79- His saying when approaching Arafat and seeing the Mount of Mercy: Subhan Allah, wal-Hamdulillah, wa La ilaha illa Allah, wallahu Akbar. 80- 'Intending to go to Arafat before the time of Standing begins at midday of Arafah'. 81- 'Reciting Tahlil (La ilaha illa Allah) at Arafat a hundred times, then reciting Surah Al-Ikhlas a hundred times, then sending blessings upon him (the Prophet) adding at the end: And upon us with them, a hundred times'.",
    "foot_note": "None",
    "book_id": "12090",
    "new_page_number": 50
  },
  {
    "serial_number": "4365894",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 52,
    "volume_number": 1,
    "text": "82- Remaining silent at Arafat and abandoning supplication. 83- 'Climbing the Mount of Mercy (Jabal al-Rahmah) in Arafat'. 84- 'Entering the dome that is on the Mount of Mercy, calling it: The Dome of Adam, praying inside it, and circumambulating it like their circumambulation of the House (Kaaba)'. 85- 'Believing that Allah the Exalted descends on the evening of Arafah on a camel to shake hands with the riders and embrace the pedestrians'. 86- The Imam delivering two sermons at Arafah separated by a sitting, as in Jumu'ah. 87- Praying Dhuhr and Asr before the sermon. 88- Calling Adhan for Dhuhr and Asr in Arafah before the Khatib finishes his sermon. 89- The Imam saying to the people of Mecca after finishing the prayer at Arafah: Complete your prayer, for we are travelers. 90- Offering voluntary prayers between Dhuhr and Asr at Arafah. 91- Designating a specific Dhikr or supplication for Arafah, like the supplication of Al-Khidr, peace be upon him, mentioned in 'Al-Ihya', beginning with: 'O You whom no matter occupies from another, nor hearing from another hearing...' and other supplications, some of which reach five pages of the measurement of this book of ours!. 92- Leaving (Ifadah) by some before sunset. 93- What is widespread on the tongues of the common people that the Standing of Arafah on a Friday is equivalent to seventy-two Hajjs!. 94- 'The Definition (Ta'reef) performed by some people by intending to gather on the evening of Arafah in mosques or a place outside the town, where they supplicate and remember [Allah] with loud voices, sermons, and poetry, imitating the people of Arafah'.",
    "foot_note": "None",
    "book_id": "12090",
    "new_page_number": 51
  },
  {
    "serial_number": "4365895",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 53,
    "volume_number": 1,
    "text": "Innovations of Muzdalifah: 95- I-da' (Hurrying) at the time of pushing on from Arafah to Muzdalifah. 96- Bathing for the overnight stay at Muzdalifah. 97- Deeming it recommended for the rider to dismount to enter Muzdalifah walking out of reverence for the Sanctuary. 98- Adhering to the supplication upon reaching Muzdalifah saying: O Allah, this is Muzdalifah, different tongues have gathered in it asking You for future needs... etc., as in 'Al-Ihya'. 99- Leaving the initiative to pray Maghrib immediately upon arriving in Muzdalifah and busying oneself instead with gathering pebbles. 100- Praying the Sunnah of Maghrib between the two prayers or combining it with the Sunnah of Isha and Witr after the two obligatory prayers, as Al-Ghazali says. 101- Increasing the lighting on the night of Sacrifice and at the Sacred Monument (Al-Mash'ar Al-Haram). 102- Staying awake (Ihya') this night [in worship]. 103- Stopping at Muzdalifah without spending the night. 104- Adhering to the supplication upon reaching the Sacred Monument saying: O Allah, by the right of the Sacred Monument, the Sacred House, the Corner, and the Station, convey the greeting and peace from us to the spirit of Muhammad, and enter us into the Abode of Peace, O Possessor of Majesty and Honor (1). 105- The saying of Al-Bajuri (318): It is Sunnah to take the pebbles to be thrown on the Day of Sacrifice from Muzdalifah, which are seven, and the rest for the Jamarat are taken from Wadi Muhassir.",
    "foot_note": "1. 1 This supplication, besides being an innovation, contains what opposes the Sunnah, which is Tawassul (seeking means of approach) to Allah by the right of the Sacred Monument and the House... One only seeks means to Him, the Exalted, by His Names and Attributes. The Hanafis have stated the dislike of saying: O Allah, I ask You by the right of the Sacred Monument... etc., as in 'Hashiyat Ibn Abidin' and others. See our book 'At-Tawassul: Its Types and Rulings'.",
    "book_id": "12090",
    "new_page_number": 52
  },
  {
    "serial_number": "4365896",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 54,
    "volume_number": 1,
    "text": "Innovations of Stoning: 106- Bathing for stoning the Jamarat. 107- Washing the pebbles before stoning. 108- Glorifying (Tasbih) or other Dhikr instead of Takbir. 109- Adding to the Takbir their saying: In spite of Satan and his party, O Allah make my Hajj accepted, my effort appreciated, and my sin forgiven, O Allah, [out of] faith in Your Book and following the Sunnah of Your Prophet. 110- The saying of some later scholars: It is Sunnah to say with every pebble during stoning: In the name of Allah, and Allah is the Greatest, Allah spoke the truth in His promise... up to his saying {even if the disbelievers dislike it}. 111- Adhering to specific manners for stoning, such as some saying: He places the tip of his right thumb on the middle of the index finger and places the pebble on the back of the thumb as if making the number seventy, then throws it. Another said: He curls his index finger and places it on the joint of his thumb as if making the number ten. 112- Determining the standing position of the thrower: That there should be five cubits or more between him and the target. 113- Stoning the Jamarat with sandals and other things.\n\nInnovations of Slaughter and Shaving: 114- Turning away from slaughtering the obligatory Hady (sacrificial animal) to giving its price in charity,",
    "foot_note": "None\n\nNone",
    "book_id": "12090",
    "new_page_number": 53
  },
  {
    "serial_number": "4365898",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 55,
    "volume_number": 1,
    "text": "claiming that its meat goes into the dirt due to its abundance and only a few benefit from it (1). 115- Some slaughtering the Hady of Tamattu' in Mecca before the Day of Sacrifice. 116- Starting the shaving with the left side of the shaved person's head. 117- Limiting to shaving only a quarter of the head. 118- Al-Ghazali's saying in 'Al-Ihya': 'The Sunnah is to face the Qiblah during shaving.' 119- Supplicating during shaving saying: Praise be to Allah for what He guided us to and blessed us with, O Allah, this is my forelock in Your hand, so accept from me...' etc. 120- Circumambulating the mosques near the Jamarat. 121- Deeming it recommended to pray Eid prayer in Mina on the Day of Sacrifice. 122- The Mutamatti' leaving the Sa'y after Tawaf al-Ifadah.\n\nMiscellaneous Innovations: 123- Celebrating the covering (Kiswah) of the Kaaba. 124- Covering the Station of Abraham. 125- Tying rags to the Station and the Minbar to fulfill needs. 126- Pilgrims writing their names on the pillars and walls of the Kaaba and entrusting one another [to do so]. 127- Deeming it permissible to pass in front of a praying person in the Sacred Mosque and resisting the praying person who pushes them back. 128- Calling one who has performed Hajj 'Al-Hajj'. 129- Going out of Mecca for a voluntary Umrah. 130- Exiting the Sacred Mosque after the Farewell Tawaf walking backwards. 131- Whitewashing the pilgrim's house with white lime, painting pictures on it, and writing the pilgrim's name and the date of his Hajj on it.",
    "foot_note": "1. 1 This is among the most malicious innovations because it involves nullifying the legislation stated in the Book and Sunnah based on mere opinion, while those responsible for the lack of full benefit from it are the pilgrims themselves because they do not adhere to the Wise Lawgiver's directives regarding slaughter, as explained in 'The Original' (pp. 87-88).\n\nNone",
    "book_id": "12090",
    "new_page_number": 54
  },
  {
    "serial_number": "4365900",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 56,
    "volume_number": 1,
    "text": "Innovations of Visiting in Medina Al-Munawwarah: Since it is from the Sunnah to travel to visit the Noble Prophetic Mosque and Al-Masjid Al-Aqsa—may Allah return it to the Muslims soon—due to the virtue and reward reported regarding that, and people usually visit them before Hajj or after it, and many of them commit numerous newly invented matters and innovations known to the scholars while doing so, I saw that to complete the benefit I should list what I have come across of them as a notification and warning, so I say: 132- Intending the grave of the Prophet, peace and blessings of Allah be upon him, with the travel (1). 133- Sending petitions with pilgrims and visitors to the Prophet, peace and blessings of Allah be upon him, and burdening them with conveying their peace to him.",
    "foot_note": "1. 1 The Sunnah is to intend the Mosque, due to his saying, peace and blessings of Allah be upon him: 'Do not saddle the mounts [travel] except to three mosques...' the Hadith. When he arrives there and prays the greeting prayer, he visits his grave, peace and blessings of Allah be upon him. It must be known that traveling to visit his grave, peace and blessings of Allah be upon him, and others is one thing, and visiting without traveling [specifically for the grave] is another thing, contrary to what has become common among later people, including some doctors, of confusing the two and attributing to Sheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him, specifically, and the Salafis generally, that they deny the legitimacy of visiting the grave of the Messenger, peace and blessings of Allah be upon him; this is a clear fabrication. Refer to the details if you wish in our refutation of Dr. Al-Buti, which was published successively in serialized articles in the magazine 'Al-Tamaddun Al-Islamiyah', then issued in a special booklet titled 'Defense of the Prophetic Hadith...', and it has been reprinted by offset recently, praise be to Allah.",
    "book_id": "12090",
    "new_page_number": 55
  },
  {
    "serial_number": "4365901",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 57,
    "volume_number": 1,
    "text": "134- Bathing before entering Medina Al-Munawwarah. 135- Saying when seeing the walls of Medina: O Allah, this is the sanctuary of Your Messenger, so make it a protection for me from the Fire and a security from punishment and bad reckoning. 136- Saying upon entering Medina: In the name of Allah and upon the religion of the Messenger of Allah: {And say, 'My Lord, cause me to enter a sound entrance and to exit a sound exit and grant me from Yourself a supporting authority'}. 137- Keeping the Prophetic grave inside his mosque. 138- Visiting his grave, peace and blessings of Allah be upon him, before praying in his mosque. 139- Some of them facing the grave with utmost humility, placing the right hand over the left as one does in prayer, near it or far from it upon entering the mosque or leaving it. 140- Intending to face the grave during supplication. 141- Intending the grave to supplicate at it hoping for an answer. 142- Seeking Tawassul through him, peace and blessings of Allah be upon him, to Allah in supplication. 143- Asking for intercession and other things from him. 144- The saying of Ibn Al-Hajj in 'Al-Madkhil' (1/159) that among the etiquette is: 'That he should not mention his needs and the forgiveness of his sins with his tongue when visiting his grave, peace and blessings of Allah be upon him, because he is more knowledgeable than him about his needs and interests'!! 145- His saying also (1/264): 'There is no difference between his death, peace be upon him, and his life regarding his witnessing of his Ummah and his knowledge of their states, intentions, regrets, and thoughts'!! 146- Placing their hand for blessing on the grate of his grave's chamber, peace and blessings of Allah be upon him, and swearing",
    "foot_note": "None",
    "book_id": "12090",
    "new_page_number": 56
  },
  {
    "serial_number": "4365902",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 58,
    "volume_number": 1,
    "text": "by that saying: By the right of the one on whose grate you placed your hand, and saying: Intercession, O Messenger of Allah!!. 147- 'Kissing the grave or touching it, or what neighbors the grave such as wood and the like' (1). 148- Adhering to a specific form in visiting him, peace and blessings of Allah be upon him, and visiting his two companions, and restricting oneself to a specific greeting and supplication, such as the saying of Al-Ghazali: 'He stands at his face, peace and blessings of Allah be upon him, turning his back to the Qiblah and facing the wall of the grave... and says: Peace be upon you, O Messenger of Allah...' mentioning a long greeting, then prayers and supplication similar to that in length, close to three pages (2). 149- 'Intending to pray towards his grave'. 150- 'Sitting at the grave and around it for recitation and Dhikr'. 151- Intending the Prophetic grave to greet him after every prayer (3). 152- The people of Medina intending to visit the Prophetic grave every time they enter the mosque or leave it. 153- Raising the voice after the prayer saying: Peace be upon you, O Messenger of Allah.",
    "foot_note": "1. 1 Al-Ghazali, may Allah have mercy on him, did well when he denied the mentioned kissing and said (1/244): 'It is the custom of the Christians and Jews.' Is there anyone who takes heed? \n2. 2 What is legislated is: Peace be upon you, O Messenger of Allah, and the mercy of Allah and His blessings. Peace be upon you, O Abu Bakr. Peace be upon you, O Umar. As Ibn Umar used to do. If he adds something slight that is inspired to him without adhering to it, there is no harm on him, Allah willing. \n3. 3 This, besides being an innovation and exaggeration in religion, and contrary to his saying, peace and blessings be upon him: 'Do not take my grave as a place of festivity (Eid), and send blessings upon me wherever you are, for your blessings reach me,' is a cause for neglecting many Sunnahs and abundant virtues, namely the Dhikrs and Wirds after the Salutation (Salam), for they abandon them and hasten to this innovation. May Allah have mercy on the one who said: No innovation is introduced except that a Sunnah dies.",
    "book_id": "12090",
    "new_page_number": 57
  },
  {
    "serial_number": "4365903",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 59,
    "volume_number": 1,
    "text": "154- Seeking blessings from what falls with the rain of pieces of green paint from the dome of the Prophetic grave!. 155- Seeking nearness by eating Sayhani dates in the Noble Rawdah between the Minbar and the Grave. 156- Cutting off their hair and throwing it into the large lamp near the Prophetic soil. 157- Some wiping their hands on the two brass palm trees placed in the mosque west of the Minbar (1). 158- Many adhering to praying in the old mosque and turning away from the first rows which are in the expansion of Umar and others. 159- Visitors of Medina adhering to staying there for a week so they can pray forty prayers in the Prophetic Mosque so that exemption from hypocrisy and exemption from the Fire are written for them (2). 160- Intending any of the mosques and shrines in Medina and around it after the Mosque of the Prophet, peace and blessings of Allah be upon him, except Masjid Quba. 161- Those known as 'guides' (Muzawwirin) instructing groups of pilgrims with certain Dhikrs and Wirds at the Chamber or far from it with loud voices, and these people repeating what they were instructed with even louder voices. 162- Visiting Al-Baqi' every day and praying in the Mosque of Fatimah, may Allah be pleased with her. 163- Allocating Thursday for visiting the martyrs of Uhud. 164- Tying rags to the window overlooking the ground of the martyrs. 165- Seeking blessings by bathing in the pool that used to be beside their graves. 166- Exiting the Prophetic Mosque walking backwards when saying farewell.",
    "foot_note": "1. 1 There is absolutely no benefit from these two palm trees; they were placed for decoration and to tempt people, and they have been removed recently, praise be to Allah. \n2. 2 The hadith reported regarding that is weak and cannot be used as a proof. I have explained its defect in 'Al-Silsilah Al-Da'ifah 364'. It is not permissible to act upon it because it is legislation, especially since some pilgrims might feel guilty about it, as I have known myself, thinking that what is reported in it is established and authentic, and they might miss some prayers therein and fall into hardship, while Allah has relieved them of it. Some virtuous people have leaned towards strengthening the mentioned hadith relying on Ibn Hibban's authentication of one of its unknown narrators. This authentication is not relied upon by the scholars of Jarh and Ta'dil (Criticism and Praise), including the referenced virtuous person himself, as he stated in his refutation of Sheikh Al-Ghumari in the magazine 'Al-Jami'ah Al-Salafiyyah' published in India. Refer for this to the book of Sheikh Abdul Aziz Al-Rabi'an in refutation of him, for he did well in it and benefited, and explained the weakness of the strengthening view he adopted and his contradiction in that.",
    "book_id": "12090",
    "new_page_number": 58
  },
  {
    "serial_number": "4365904",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 60,
    "volume_number": 1,
    "text": "Innovations of Bayt Al-Maqdis (Jerusalem): 167- Intending to visit Bayt Al-Maqdis along with Hajj and their saying: May Allah sanctify your Hajj. 168- Circumambulating the Dome of the Rock imitating the circumambulation of the Kaaba. 169- Venerating the Rock with any type of veneration such as wiping on it, kissing it, driving sheep to it to slaughter them there, performing Ta'reef (standing as in Arafah) by it on the evening of Arafah, building upon it, and other things. 170- His claim that there is a footprint of the Prophet, peace and blessings of Allah be upon him, on the Rock, and a trace of his turban, and some of them think it is the place of the foot of the Lord, Glory be to Him and Exalted. 171- Visiting the place they claim is the cradle of Jesus, peace be upon him. 172- Their claim that the Sirat (Bridge) and the Balance (Mizan) are there, and that the wall that will be struck between Paradise and Hell is that wall built east of the Mosque. 174- Venerating the chain or its place. 175- Praying at the grave of Abraham the Friend (Al-Khalil), peace be upon him.",
    "foot_note": "None",
    "book_id": "12090",
    "new_page_number": 59
  },
  {
    "serial_number": "4365905",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Manasik Al-Hajj wa Al-Umrah",
    "edition": "First",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 61,
    "volume_number": 1,
    "text": "176- Gathering during the Hajj season to sing and beat the Duff in Al-Masjid Al-Aqsa. * * * This is the last of what was facilitated to collect regarding the innovations of Hajj and Visitation. I ask Him, Blessed and Exalted, to make this an aid for Muslims in following the traces of the Master of Messengers and being guided by his guidance. And 'Glory be to You, O Allah, and with Your praise, I bear witness that there is no deity except You, I seek Your forgiveness and I repent to You'.",
    "foot_note": "None",
    "book_id": "12090",
    "new_page_number": 60
  }
]