[
  {
    "text": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»\nالمؤلف: محمد يوسف حافظ أبو طلحة\nسنة الوفاة: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "category_id": "10",
    "category": "علوم الحديث",
    "new_page_number": 1
  },
  {
    "text": "sn: 3696\nbook_title: الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»\nbook_link: https://shamela.ws/book/686\nbook_id: 686\nauthor_name: محمد يوسف حافظ أبو طلحة\nauthor_year: Null\nnickname: أبو طلحة\nauthor_link: https://shamela.ws/author/3145\nauthor_ID: 3145\neditor: Null\npublisher: مجلة الهند, المجلد: العاشر، العدد: الأول، يناير - مارس ٢٠٢١ م\nedition: Null\npages: 56\nvolumes: Null\npagination: [الترقيم موافق للمجلة]\ncategory: علوم الحديث\ncategory_id: 10",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "category_id": "10",
    "category": "علوم الحديث",
    "new_page_number": 2
  },
  {
    "serial_number": "3345878",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: علوم الحديث الكتاب : الحافظ زين الدين العراقي ، وكتابه « تكملة شرح الترمذي » المؤلف : محمد يوسف حافظ أبو طلحة بحث منشور في : مجلة الهند ، ( مجلة فصلية محكّمة ، بدأ صدورها في 2012 م ، مدير تحريرها د أورنك زيب الأعظمي ). المجلد : العاشر ، العدد : الأول ، يناير - مارس 2021 م عدد الصفحات : 56 [ الترقيم موافق للمجلة ] تاريخ النشر بالشاملة : 29 ربيع الأول 1443\nالكتاب : الحافظ زين الدين العراقي ، وكتابه « تكملة شرح الترمذي » المؤلف : محمد يوسف حافظ أبو طلحة بحث منشور في : مجلة الهند ، ( مجلة فصلية محكّمة ، بدأ صدورها في 2012 م ، مدير تحريرها د أورنك زيب الأعظمي ). المجلد : العاشر ، العدد : الأول ، يناير - مارس 2021 م عدد الصفحات : 56 [ الترقيم موافق للمجلة ] تاريخ النشر بالشاملة : 29 ربيع الأول 1443\nالمؤلف : محمد يوسف حافظ أبو طلحة بحث منشور في : مجلة الهند ، ( مجلة فصلية محكّمة ، بدأ صدورها في 2012 م ، مدير تحريرها د أورنك زيب الأعظمي ). المجلد : العاشر ، العدد : الأول ، يناير - مارس 2021 م عدد الصفحات : 56 [ الترقيم موافق للمجلة ] تاريخ النشر بالشاملة : 29 ربيع الأول 1443\nبحث منشور في : مجلة الهند ، ( مجلة فصلية محكّمة ، بدأ صدورها في 2012 م ، مدير تحريرها د أورنك زيب الأعظمي ). المجلد : العاشر ، العدد : الأول ، يناير - مارس 2021 م عدد الصفحات : 56 [ الترقيم موافق للمجلة ] تاريخ النشر بالشاملة : 29 ربيع الأول 1443\nالمجلد : العاشر ، العدد : الأول ، يناير - مارس 2021 م عدد الصفحات : 56 [ الترقيم موافق للمجلة ] تاريخ النشر بالشاملة : 29 ربيع الأول 1443\nعدد الصفحات : 56 [ الترقيم موافق للمجلة ] تاريخ النشر بالشاملة : 29 ربيع الأول 1443\n[ الترقيم موافق للمجلة ] تاريخ النشر بالشاملة : 29 ربيع الأول 1443\nتاريخ النشر بالشاملة : 29 ربيع الأول 1443",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 3
  },
  {
    "serial_number": "3345879",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 98,
    "volume_number": 1,
    "text": "الحافظ زين الدين العراقي، وكتابه: \"تكملة شرح الترمذي\". د. محمد يوسف حافظ أبو طلحة (1)  المستخلص هذا البحث يشتمل على مقدمة ومبحثين وخاتمة. فأما المقدمة ففيها بيان أسباب اختيار الموضوع، وخطة البحث. وأما المبحث الأول ففيه ترجمة الحافظ أبي الفضل زين الدين عبد الرحيم بن الحسين العراقي (725 - 806 هـ)، تبين من خلالها أنه كان من كبار المحدثين في القرن الثامن الهجري، وربى جيلا مباركا للمحدثين، على رأسهم الحافظ ابن حجر، وأبو زرعة العراقي، ونور الدين الهيثمي. وله مؤلفات قيمة في الحديث وغيره من العلوم تشهد بحذقه وتقدمه، من أهمها تكملة شرح الترمذي. وأما المبحث الثاني ففيه التعريف بكتابه القيم: \"تكملة شرح الترمذي\"، بدأ شرحه من حيث توقف ابن سيد الناس في: \"النفح الشذي\". فشرع في شرحه من \"باب ما جاء أن الأرض كلها مسجد إلا المقبرة والحمام\"، ووصل في شرحه إلى \"باب شفقة المسلم على المسلم\" من أبواب البر والصلة، وبقي نصف الكتاب لم يتناوله بالشرح، واخترمته المنية قبل إكماله. وهو من أحسن الشروح على جامع الترمذي، يمتاز بميزات، من أهمها: اهتمام الشارح بتخريج حديث الباب، وتحرير حكم الترمذي عليه، ومناقشته إذا ظهر له خلاف ذلك، وعنايته بتخريج ما قال عنه الترمذي: وفي الباب من الأحاديث، واستدراك ما فات الترمذي من الأحاديث المتعلقة بالباب، وتوضيحه للمسائل الفقهية المستنبطة من أحاديث جامع الترمذي، وبيانه لمذاهب العلماء في",
    "foot_note": "1. عميد كلية اللغة العربية والدراسات الإسلامية بالجامعة المحمدية، منصورة، ماليغاون، الهند. البريد الإلكتروني:  mdyusuftalha@gmail.com.",
    "book_id": "686",
    "new_page_number": 4
  },
  {
    "serial_number": "3345880",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 99,
    "volume_number": 1,
    "text": "المسألة، وتعقباته لمن سبقه من أهل العلم بأدب جم وتواضع تام. ومن أجل هذه الميزات وغيرها أشاد بشرحه هذا كبار العلم، واغترف من بحاره جل من جاء بعده من كبار الشراح. وأما الخاتمة ففيها أهم النتائج والتوصيات. الكلمات المفتاحية: الحديث الشريف، شروح الحديث، شروح جامع الترمذي، الحافظ العراقي، تكملة شرح الترمذي.  المقدمة الحمد لله وحده، والصلاة والسلام على من لا نبي بعده. أما بعد: أما بعد: فإنَّ السنةَ النبويَّة من أشرف العلوم وأجلها، فهي الشارحة لكتاب الله، والمفسِّرة له، والمبيِّنة لما أجْمِلَ من آياته، والمقَيِّدة لكثير من إطلاقاته، ومن ثم اعتنى بها علماء الإسلام منذ الصدر الأول، وتنوعوا في تصنيفها، وتفننوا في تدوينها على أنحاء كثيرة، وضروب عديدة حرصا على حفظها. وكان من جملة هؤلاء: الإمامُ الحافظ أبو عيسى الترمذي المتوفى سنة 279 هـ، فقد ألَّف في السنة كُتباً شتى، كان من أعظمها نفعاً، وأعلاها قدراً كتاب الجامع الذي طارت شهرته في المشرق والمغرب، مما جعل العلماءَ يتنافسون في شرحه، وإيضاحه، وترجمة رجاله. وممن شرحه القاضي أبو بكر ابن العربي المتوفى سنة 543 هـ في كتابه (عارضة الأحوذي)، ثم الحافظ أبو الفتح محمد بن محمد بن محمد ابن سيد الناس اليعمري المتوفى سنة 734 هـ في كتابه (النفح الذي)، ولكنه لم يتمه، فجاء الحافظ زين الدِّين العراقي (ت 806 هـ)، فبدأ بالشرح من حيث توقف ابن سيد الناس. ولما كان شرح العراقي -مع أهميته وكثرة فوائده- لا يزال مخطوطا لم يُطبع بعدُ رغبت",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 5
  },
  {
    "serial_number": "3345881",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 100,
    "volume_number": 1,
    "text": "في التعريف به مفصلا مع ترجمة موجزة لمؤلفه؛ فإني عشت مع مخطوطة هذا الكتاب أكثر من ثلاث سنين. فلله الحمد والمنة.  أسباب اختيار الموضوع: 1 - مكانة الشارح العلمية، فهو أحد كبار المحدثين في القرن الثامن الهجري وقد تربى في كنفه كبار المحدثين، منهم الحافظ ابن حجر، والحافظ الهيثمي، والحافظ البوصيري، والعلامة العيني. وجل من جاء بعده من المحدثين اغترف من منهله. 2 - أهمية الكتاب المشروح، فهو شرح لجامع الترمذي، وهو أحد الكتب الستة التي عليها مدار الإسلام. 3 - قيمة الشرح العلمية، فهو شرح حافل بالفوائد، والتحقيقات، ويمتاز بميزات، من أهمها: (أ) اهتمام الشارح بتخريج حديث الباب، وتحرير حكم الترمذي عليه، ومناقشته إذا ظهر له خلاف ذلك. (ب) عنايته بتخريج ما قال عنه الترمذي: وفي الباب من الأحاديث. (ت) استدراك ما فات الترمذي من الأحاديث المتعلقة بالباب. (ث) تفسيره لغريب الحديث من أمهات المعاجم وأصول كتب الغريب. (ج) توضيحه للمسائل الفقهية المستنبطة من أحاديث جامع الترمذي، وبيانه لمذاهب العلماء في المسألة. (ح) تعقباته لمن سبقه من شرّاح الكتاب كابن العربي، وابن سيد الناس، ولمن سبقه من المترجمين لرواة الكتاب كالمزّي، ولمن سبقه في الحكم على الحديث كالحاكم. (خ) كونه مرجعا مهما في توثيق حكم الترمذي على الحديث. ومن أجل هذه الميزات وغيرها أشاد الشوكاني بهذا الشرح النفيس في ترجمة ابن",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 6
  },
  {
    "serial_number": "3345882",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 101,
    "volume_number": 1,
    "text": "سيد الناس، فقال: \"ولما وقفت على الجزء الذي من شرح الترمذي … للزين العراقي بهرني ذلك، ورأيته فوق ما شرحه صاحب الترجمة بدرجات\". اه (1)  خطة البحث: قسمت البحث إلى مقدمة ومبحثين وخاتمة. المقدمة: بيّنت فيها وسبب اختيار الموضوع، وخطة البحث. المبحث الأول: ترجمة الشارح العراقي رحمه الله، وفيه ثمانية مطالب: المطلب الأول: اسمه ونسبه المطلب الثاني: مولده المطلب الثالث: نشأته العلمية المطلب الرابع: ثناء العلماء عليه المطلب الخامس: شيوخه المطلب السادس: تلاميذه المطلب السابع: مؤلفاته المطلب الثامن: وفاته المبحث الثاني: دراسة كتاب \"تكملة شرح الترمذي\"، وفيه ستة مطالب: المطلب الأول: تحقيق اسم الكتاب المطلب الثاني: توثيق نسبة الكتاب إلى مؤلفه المطلب الثالث: موضوع الكتاب المطلب الرابع: في شروح الترمذي، ومكانة تكملة شرح الترمذي للعراقي بينها.",
    "foot_note": "1. البدر الطالع (ص 767).",
    "book_id": "686",
    "new_page_number": 7
  },
  {
    "serial_number": "3345883",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 102,
    "volume_number": 1,
    "text": "المطلب الخامس: منهج المؤلف في شرحه المطلب السادس: بعض موارد المؤلف في شرحه. المطلب السابع: وصف النسخ الخطية الموجودة في مكتبات العالم حسبما تيسر الوقوف عليها. الخاتمة: ذكرت فيها أهم النتائج والتوصيات. وأسأل الله أن يرزقني الإخلاص في القول والعمل، وأن يُريني الحق حقا، ويرزقني اتباعه، ويريني الباطل باطلا، ويرزقني اجتنابه.  المبحث الأول: ترجمة الحافظ العراقي رحمه الله - (1)  المطلب الأول: اسمه ونسبه هو الإمام الحافظ الكبير، المحدث النحرير، أبو الفضل",
    "foot_note": "1. من مصادر ترجمته: تاريخ ابن حجي (2/ 620 - 621)، وذيل التقييد للفاسي (3/ 9 - 13)، وغاية النهاية لابن الجزري (1/ 382)، وتاريخ ابن قاضي شهبة (4/ 379 - 382)، وطبقات الشافعية له (4/ 29 - 33)، وإنباء الغمر بأبناء العمر لابن حجر (2/ 275 - 279)، والمجمع المؤسس له (2/ 176 - 230)، وذيل الدرر الكامنة له (ص 143 - 145)، ولحظ الألحاظ لابن فهد (ص 220 - 239)، والمنهل الصافي لابن تغري بردي (7/ 245 - 250)، والدليل الشافي على المنهل الصافي له (1/ 409)، والنجوم الزاهرة في ملوك مصر والقاهرة له (12/ 284)، والضوء اللامع للسخاوي (4/ 171 - 178)، وحسن المحاضرة للسيوطي (1/ 360 - 362)، وطبقات الحفاظ له (ص 543 - 544)، وذيل تذكرة الحفاظ له (ص 370 - 372)، ودرة الحجال لابن القاضي (3/ 113)، وشذرات الذهب لابن العماد (9/ 87 - 88)، والبدر الطالع للشوكاني (ص 361 - 363)، والرسالة المستطرفة للكتاني (ص 161)، وفهرس الفهارس له (2/ 814 - 818)، وهدية العارفين للبغدادي (1/ 562). وألف ابنه أبيو زرعة كتابا مفردا في ترجمة أبيه سماه: تحفة الوارد بترجمة الوالد. (انظر: لحظ الألحاظ ص 287). ومن المراجع المعاصرة: الأعلام للزركلي (3/ 344)، ومعجم المؤلفين لعمر رضا كحالة (2/ 130)، ومقدمة التحقيق لكاب ذيل ميزان الاعتدال للدكتور عبد القيوم عبد رب النبي (ص 15 - 30)، ومقدمة التحقيق لكتاب التقييد والإيضاح للدكتور أسامة الخياط (1/ 45 - 92)، ومقدمة التحقيق لكتاب فتح المغيث للدكتور عبد الكريم الخضير (1/ 15 - 66)، ومنهج الحافظ زين الدين العراقي في كتابه \"طرح التثريب\" رسالة الماجستير في جامعة الإمام محمد بن سعود الإسلامية للطالب محمد يحيى بلال منيار، والحافظ العراقي وأثره في السنة في خمسة مجلدات للدكتور أحمد معبد عبد الكريم.",
    "book_id": "686",
    "new_page_number": 8
  },
  {
    "serial_number": "3345884",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 103,
    "volume_number": 1,
    "text": "زين الدين عبد الرحيم بن الحسين بن عبد الرحمن بن أبي بكر بن إبراهيم (1) الرازياني العراقي الأصل، الكردي (2) ، المهراني (3) المصري، الشافعي. (4) قال ابنه أبو زرعة العراقي (ت 826 هـ): \"العراقي انتسابا لعراق العرب، وهو القطر الأعم (5) ، وإلا فهو كردي الأصل، أقام سلفه ببلدة من أعمال إربل (6) : يقال لها: رازيان. ولهم هناك مآثر ومناقبـ، إلى أن تحول والده إلى مصر، وهو صغيرـ مع بعض أقربائه\". (7)  المطلب الثاني: مولده ولد الحافظ العراقي في الحادي والعشرين من شهر رجب سنة خمس وعشرين وسبع مائة بمنشأة المهراني (8) بين مصر (9) ، والقاهرة على شاطئ النيل. (10)  المطلب الثالث: نشأته العلمية ولد الحافظ العراقي في بيت علم وديانة، (11) فإن والده كان",
    "foot_note": "1. إلى هنا ذكر العراقي نفسُه نسبَه في ترجمته لابنه أحمد في طرح التثريب (1/ 16)، وهكذا ساق أحمد نسبه في توقيعه في طرح التثريب، كما نقل محقق طرح التثريب في مقدمة تحقيقه (ص 9) من الأصل الخطي. \n2. بضم الكاف وسكون الراء، نسبة إلى الأكراد طائفة معروفة يسكنون شمال العراق. (اللباب في تهذيب الأنساب 3/ 92). \n3. هذه النسبة إلى منشأة المهراني مسقط رأسه، كما سيأتي. \n4. انظر: طبقات القراء (1/ 382)، وإنباء الغمر (2/ 275)، وطبقات ابن قاضي شهبة (4/ 29)، ولحظ الألحاظ (ص 220). \n5. وليست إلى العراق بالمعنى الأخص وهو أرض بابل. (انظر معجم البلدان 4/ 93 - 95). \n6. بالكسر ثم السكون، وباء موحدة مكسورة، مدينة كبيرة تقع على ثمانين كيلا جنوب شرق الموصل بالعراق. (انظر معجم البلدان (1/ 138، والحافظ العراقي وأثره في السنة 1/ 139). \n7. حكاه عنه السخاوي في الضوء اللامع (4/ 171). \n8. هذه المنشأة نسبت للأمير سيف الدين بلبان المهراني؛ لأنه أول من ابتنى بها دارا، وسكنها، ثم تتابع الناس، حتى انحسر الماء عن الجهة الشرقية فخربت. (انظر: الخطط للمقريزي 1/ 346). \n9. مصر تطلق على المدينة المجاورة للقاهرة، وتطلق على القطر الأعم، فتدخل القاهرة حينئذ في إطلاقها، وفي قول مترجمي العراقي: \"بين مصر والقاهرة\". الإطلاق الأول. (انظر معجم البلدان 5/ 137 - 143، والحافظ العراقي، وأثره في السنة 1/ 144 - 145). \n10. انظر: المجمع المؤسس (2/ 176)، ولحظ الألحاظ (ص 221)، والدليل الشافي (1/ 409)، والضوء اللامع (4/ 171). \n11. انظر عن أسرته العجالة السنية على ألفية السيرة النبوية (ص 4)، والضوء اللامع (4/ 171).",
    "book_id": "686",
    "new_page_number": 9
  },
  {
    "serial_number": "3345885",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 104,
    "volume_number": 1,
    "text": "رجلا صالحا متعبدا فاضلا، نشأ على الاشتغال بالعلم، ولازم الشيخ الشريف تقي الدين محمد بن جعفر بن محمد بن عبد الرحيم القنائي الشافعي (1) حيث كان يعمل بخدمته، (2) وحضر عند غيره من العلماء، وكتب بخطه كثيرا من التفسير والفقه والرقائق. (3) ووالدته أيضا كانت صالحة عابدة صابرة قانعة مجتهدة في أنواع القربات إلى الله. (4) واعتنى أبوه بتربيته، قال السخاوي (ت 902 هـ): \"وتكرر إحضار أبيه به إلى التقي، فكان يلاطفه، ويكرمه .... وكذا أسمعه في سنة سبع وثلاثين من الأمير سنجر الجاولي، والقاضي تقي الدين الأخنائي المالكي، وغيرهما\". (5) فنشأ العراقي في مثل هذه البيئة الصالحة، وقد من الله عليه بالذكاء المفرط، وسرعة الحافظة، فحفظ القرآن وهو ابن ثماني سنوات، وحفظ التنبيه (6) ، وأكثر الحاوي الصغير للقزويني (7) ، وكذا حفظ الإلمام لابن دقيق العيد، وربما حفظ منه في اليوم الواحد أربع مائة سطر إلى غير ذلك من المحافيظ. (8) ودرس العربية والفقه وأصوله، وغيره من العلوم، ولكن كان انهماكه في علم القراءات، وكان يجتهد فيه كثيرا، حتى نصحه القاضي عز الدين ابن جماعة (ت 767 هـ)، فقال له: \"إنه علم كثير التعب، قليل الجدوى، وأنت متوقد الذهن،",
    "foot_note": "1. حدث بالقاهرة، ودرس بالمسرورية، وولي مشيخة خانقاه رسلان، وتوفي سنة 728 هـ. (انظر الدرر الكامنة 3/ 415). \n2. انظر لحظ الألحاظ (ص 220)، والضوء اللامع (4/ 171). \n3. انظر ذيل الولي العراقي على العبر (وفيات سنة 763 هـ) (1/ 86 - 87). \n4. وصفها بذلك السخاوي في الضوء اللامع (4/ 171). \n5. الضوء اللامع (4/ 171). وسيأتي ذكر الجاولي والأخنائي في مبحث الشيوخ. \n6. التنبيه في فقه الشافعية لأبي إسحاق الشيرازي، مطبوع. \n7. الحاوي الصغير في الفروع للشيخ نجم الدين عبد الغفار بن عبد الكريم القزويني (ت 665 هـ). (انظر كشف الظنون 1/ 625 - 627). \n8. انظر: المجمع المؤسس (2/ 177)، ولحظ الألحاظ (ص 227)، والضوء اللامع (4/ 171 - 172).",
    "book_id": "686",
    "new_page_number": 10
  },
  {
    "serial_number": "3345886",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 105,
    "volume_number": 1,
    "text": "فاصرف همتك إلى الحديث\" وذلك سنة اثنتين وأربعين وسبع مائة، (1) فحبب الله له ذلك، فأكب عليه من سنة اثنتين وخمسين، حتى نال إعجاب أئمة عصره. (2) وسافر في طلب الحديث إلى مكة، والمدينة، والشام، وحلب، وحمص، ودمشق، وغزة، وبيت المقدس، والإسكندرية إلى تمام ستة وثلاثين بلدا أفردها بالتخريج باسم الأربعين البلدانية. (3) قال ابن فهد المكي (ت 871 هـ): \"لا تخلو له سنة من الرحلة إما في الحج، أو طلب الحديث\". (4) تنبيه: قال تقي الدين ابن فهد المكي: \"إن والده توفي، وهو في الثالثة من عمره\". اه. (5) وهو خطأ، فقد ذكر أبو زرعة ابن العراقي (ت 826 هـ) أن والد أبي الفضل العراقي توفي سنة سبع مائة، وثلاث وستين، (6) إذاً العراقي حين وفاة والده كان رجلا في نحو الثامنة والثلاثين من عمره، ولعل ابن فهد اشتبه عليه وفاة تقي الدين محمد بن جعفر القنائي بوفاة والد العراقي، فإن القنائي توفي سنة 728 هـ، والزين العراقي في الثالثة من عمره. (7)  المطلب الرابع: ثناء العلماء عليه جد الحافظ العراقي في الطلب واجتهد، وطاف البلدان، ولقي الأئمة الأعلام، وصحبه التوفيق الإلهي، حتى تضلع في علوم كثيرة،",
    "foot_note": "1. انظر: لحظ الألحاظ (ص 222)، والضوء اللامع (4/ 172). وسيأتي ذكر ابن جماعة في مبحث الشيوخ \n2. انظر: المجمع المؤسس (2/ 177 - 178)، والضوء اللامع (4/ 172). \n3. انظر تاريخ ابن قاضي شهبة (4/ 380)، ولحظ الألحاظ (ص 225 - 226)، والضوء اللامع (4/ 172 - 173). \n4. لحظ الألحاظ (ص 225 - 226). \n5. لحظ الألحاظ (ص 221). وجزم الشيخ أحمد معبد أن ابن فهد انفرد من بين أوائل المترجمين بهذا القول، ثم رد عليه بثلاثة أوجه (انظر الحافظ العراقي، وأثره في السنة 1/ 179 - 181). \n6. ذيل أبي زرعة العراقي على العبر (وفيات سنة 763 هـ) (1/ 86). \n7. التنبيه والإيقاظ لما في ذيول تذكرة الحفاظ (ص 99 - 100). سبق ترجمة القنائي في (ص 7).",
    "book_id": "686",
    "new_page_number": 11
  },
  {
    "serial_number": "3345887",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 106,
    "volume_number": 1,
    "text": "وبرزت شخصيته في السنة الأثيرة، ففاضت ألسنة ألأئمة بالثناء عليه. قال تلميذه الحافظ ابن حجر (ت 852 هـ): \"وتقدم في فن الحديث بحيث كان شيوخ العصر يبالغون في الثناء عليه بالمعرفة، كالسبكي، والعلائي، والعز ابن جماعة، والعماد ابن كثير، وغيرهم\". اه. (1) وفيما يلي نماذج من ثنائهم عليه: قال شيخه الإسنوي (ت 772 هـ) في ترجمة ابن سيد الناس: \"وشرح قطعة من الترمذي نحو مجلدين، وشرع في إكماله حافظ الوقت زين الدين العراقي إكمالا مناسبا لأصله\". اه. (2) وكان الإسنوي يثني على فهمه، ويستحسن كلامه في الأصول، ويصغي لمباحثه، ويقول: \"إن ذهنه صحيح، لا يقبل الخطأ\". (3) وذكره شيخه تقي الدين السبكي (ت 756 هـ) في درسه معظما له على شأنه، ونوه بذكره، ووصفه بالمعرفة، والإتقان، والفهم. (4) ومن تعظيمه له أنه لما قدم القاهرة في سنة ست وخمسين وسبع مائة أراد أهل الحديث السماع عليه، فامتنع من ذلك، وقال: لا أُسمع إلا بحضوره. وكان العراقي غائبا في الإسكندرية، فمات السبكي قبل أن يصل، ولم يحدثهم. (5) كما وصفه شيخه العلائي (ت 761 هـ) بالفهم، والمعرفة، والإتقان، والحفظ. (6)",
    "foot_note": "1. المجمع المؤسس (2/ 178 - 179). \n2. طبقات الشافعية للأسنوي (2/ 511). \n3. انظر: الضوء اللامع (4/ 172). \n4. انظر: لحظ الألحاظ (ص 223). \n5. انظر: لحظ الألحاظ (ص 224). \n6. انظر: لحظ الألحاظ (ص 225).",
    "book_id": "686",
    "new_page_number": 12
  },
  {
    "serial_number": "3345888",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 107,
    "volume_number": 1,
    "text": "وقال شيخه عز الدين ابن جماعة (ت 767 هـ): \"كل من يدعي الحديث في الديار المصرية سواه فهو مدعٍ\". (1) وقال شيخه الحافظ تقي الدين محمد بن رافع بن هجرس السلامي (ت 774 هـ) ـ وهو بمكة في سنة 763 هـ، وقد مر به العراقيـ: \"ما في القاهرة محدث إلا هذا، والقاضي عز الدين ابن جماعة\". فلما بلغه وفاة القاضي عز الدين ـ وهو بدمشق ـ قال: ما بقي الآن بالقاهرة محدث إلا الشيخ زين الدين العراقي\". (2) وقال تلميذه الحافظ ابن حجر (ت 852 هـ): \"ولم نر في هذا الفن أتقن منه، وعليه تخرج غالب أهل عصره\". اه. (3) وقال في صدر أسئلته له: \"سألت سيدنا، وقدوتنا، ومعلمنا، ومفيدنا، ومخرجنا، شيخ الإسلام، أوحد الأعلام، حسنة الأيام، حافظ الوقت\". اه. (4) ورثاه في قصيد طويلة (5) أثنى عليه فيها كثيرا، ومنها قوله: ومن ستين عاما لم يُجارَ … ولا طمع المجاري في اللحاق وقال تلميذه الهيثمي (ت 807 هـ): \"سيدي، وشيخي العلامة شيخ الحفاظ بالمشرق والمغرب، ومفيد الكبار ومن دونهم: الشيخ زين الدين أبو الفضل عبد الرحيم العراقي، رضي الله عنه وأرضاه، وجعل الجنة مثوانا ومثواه. اه. (6) وقال تلميذه العيني (ت 855 هـ): \"الشيخ الإمام العلامة مفتي الأنام، شيخ",
    "foot_note": "1. لحظ الألحاظ (ص 227)، والضوء اللامع (4/ 173). \n2. لحظ الألحاظ (ص 227). \n3. إنباء الغمر (2/ 276). \n4. الضوء اللامع (4/ 175). \n5. إنباء الغمر (2/ 279). \n6. مجمع الزوائد (1/ 7).",
    "book_id": "686",
    "new_page_number": 13
  },
  {
    "serial_number": "3345889",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 108,
    "volume_number": 1,
    "text": "الإسلام، حافظ مصر والشام\". (1) وقال تلميذه تقي الدين الفاسي المكي (ت 832 هـ): \"كان حافظا متقنا، عارفا بفنون الحديث والفقه والعربية وغير ذلك، كثير الفضائل والمحاسن\". اه. (2) وقال تلميذه ابن الجزري (ت 833 هـ): \"حافظ الديار المصرية، ومحدثها، وشيخها، وبرع في الحديث متنا وإسنادا، وتفقه على شيخنا الأسنوي وغيره، وكتب، وألف، وجمع، وخرج، وانفرد في وقته\". اه. (3) وقال شهاب الدين أبو العباس أحمد بن حجي (ت 816 هـ): \"كان محدث الديار المصرية، انتهت إليه معرفة علم الحديث\". (4) وقال ابن قاضي شهبة (ت 851 هـ): \"الحافظ الكبير، المفيد المتقن، المحرر الناقد، محدث الديار المصرية، ذو التصانيف المفيدة\". (5) وقال تقي الدين ابن فهد المكي (ت 871 هـ): \"الإمام الأوحد، العلامة الحجة، الحبر الناقد، عمدة الأنام، حافظ الإسلام، فريد دهره، ووحيد عصره، من فاق بالحفظ والإتقان في زمانه، وشهد له بالتفرد في فنه أئمة عصره وأوانه\". اه. (6) وقال السخاوي (ت 902 هـ): \"كان إماما علامة، مقرئا، فقيها شافعي المذهب، أصوليا، منقطع القرين في فنون الحديث وصناعته، ارتحل فيه إلى البلاد النائية، وشهد له بالتفرد فيه أئمة عصره، وعولوا عليه فيه، وسارت تصانيفه فيه وفي غيره،",
    "foot_note": "1. عمدة القارئ (1/ 4). \n2. ذيل التقييد (3/ 11) .. \n3. غاية النهاية في طبقات القراء (1/ 382). \n4. تاريخ ابن حجي (2/ 621). \n5. طبقات الشافعية له (2/ 359). = (4/ 29). \n6. لحظ الألحاظ (ص 220).",
    "book_id": "686",
    "new_page_number": 14
  },
  {
    "serial_number": "3345890",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 109,
    "volume_number": 1,
    "text": "ودرس، وأفتى، وحدث، وأملى … \" (1) وقال السيوطي (ت 911 هـ): \"والذي أقوله: إن المحدثين عيال الآن في الرجال وغيرها من فنون الحديث على أربعة: الحافظ المزي، والحافظ الذهبي، والحافظ العراقي، والحافظ ابن حجر\". اهـ (2) هذا غيض من فيض، وكل من ترجم له أثنى عليه، وهو في مجموعه كلمة إجماع، كما قال السخاوي. (3)  المطلب الخامس: شيوخه (4) طاف العراقي بلادا كثيرة، ولقي علمائها، وأخذ عنهم، فكان مسموعاته وشيوخه في غاية الكثرة، كما قال التقي الفاسي (5) ، أكتفي بذكر بعضهم مرتبا على حروف المعجم: • إبراهيم بن لاجين بن عبد الله الرشيدي الأغر (ت 749 هـ). (6) • وأحمد بن أبي الفرج بن البابا الشافعي (ت 749 هـ). (7) • وأحمد بن قاسم بن عبد الرحمن العمري الحرازي الشافعي، مفتي مكة (755 هـ). (8) • وأحمد بن يوسف بن محمد المقرئ النحوي، المعروف بالسمين الحلبي، مؤلف",
    "foot_note": "1. فتح المغيث (1/ 3). \n2. ذيل طبقات الحفاظ (ص 348). \n3. فتح المغيث (1/ 4). \n4. انظر: المجمع المؤسس (2/ 176 - 178)، ولحظ الألحاظ (ص 221 - 226)، وغاية النهاية (1/ 382)، والضوء اللامع (4/ 171 - 172)، والحافظ العراقي وأثره في السنة (1/ 227 - 229، و 236 - 237، و 317 - 331، و 374 - 383). \n5. انظر ذيل التقييد (3/ 11). \n6. ترجمته في طبقات القراء (1/ 28). \n7. ترجمته في لحظ الألحاظ (ص 128). \n8. ترجمته في العقد الثمين (3/ 116).",
    "book_id": "686",
    "new_page_number": 15
  },
  {
    "serial_number": "3345891",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 110,
    "volume_number": 1,
    "text": "الدر المصون (ت 756 هـ). (1) • وخليل بن كيكلدي بن عبد الله العلائي، صلاح الدين، مؤلف جامع التحصيل (ت 761 هـ). (2) • وسنجر بن عبد الله الجاولي، الأمير الكبير (ت 745 هـ). (3) • وعبد الرحمن بن أحمد بن علي بن المبارك البغدادي الشافعي (ت 781 هـ). (4) • وعبد الرحيم بن إبراهيم بن هبة الله الجهني، المعروف بابن البارزي، قاضي حماة، وابن قاضيها (764 هـ). (5) • وعبد الرحيم بن الحسن بن علي القرشي، جمال الدين الإسنوي (ت 772 هـ) (6) ، عنه أخذ علم الأصول، وعليه تفقه. (7) • وعبد الرحيم بن عبد الله بن يوسف الأنصاري، المعروف بابن شاهد الجيش (ت 746 هـ). (8) • وعبد العزيز بن محمد بن إبراهيم بن سعد الله بن جماعة الكناني، عز الدين، القاضي الشافعي (ت 767 هـ). (9) • وعبد الله بن محمد بن إبراهيم بن نصر الدمشقي، المعروف بابن قيم الضبائية. (ت 761 هـ). قال ابن حجر: أكثر عنه شيخنا العراقي. (10)",
    "foot_note": "1. ترجمته في غاية النهاية (1/ 152). \n2. ترجمته في ذيل تذكرة الحفاظ للحسيني (ص 43). \n3. ترجمته في طبقات السبكي (10/ 41)، والدرر الكامنة (2/ 170). \n4. ترجمته في طبقات القراء (1/ 364)، وإنباء الغمر (1/ 203). \n5. ترجمته في فوات الوفيات للكتبي (2/ 306 - 308). \n6. ترجمته في طبقات ابن قاضي شهبة (3/ 98 - 101). \n7. انظر: لحظ الألحاظ (ص 226). \n8. ترجمته في الدرر الكامنة (1/ 357)، وذيل التقييد (3/ 13 - 15). \n9. ترجمته في طبقات الإسنوي (1/ 388 - 390)، والدرر الكامنة (2/ 378 - 382). \n10. الدرر الكامنة (2/ 283/ ترجمة ابن قيم الضبائية).",
    "book_id": "686",
    "new_page_number": 16
  },
  {
    "serial_number": "3345892",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 111,
    "volume_number": 1,
    "text": "• وعلي بن عبد الكافي بن علي الشافعي، تقي الدين السبكي (ت 756 هـ). (1) • وعلي بن عثمان بن إبراهيم المارديني الحنفي، الشهير بابن التركماني، قاضي مصر، صاحب \"الجوهر النقي في الرد على البيهقي\" (ت 749 هـ)، (2) انتفع به كثيرا، وتخرج عليه. (3) • وعمر بن محمد بن علي بن فتوح الدمنهوري، الفقيه الشافعي، شيخ القراء (ت 752 هـ)، (4) • ومحمد بن أحمد بن عبد المؤمن بن اللبان الشافعي (ت 749 هـ). (5) • ومحمد بن أبي بكر بن عيسى بن بدران السعدي، قاضي القضاة بمصر، المعروف بتقي الدين الإخنائي المالكي (ت 750 هـ). (6) • ومحمد بن إسماعيل بن إبراهيم بن الدمشقي، المعروف بابن الخباز (ت 756 هـ). (7) • ومحمد بن عبد الله بن محمد بن عبد الحميد بن عبد الهادي (ت 769 هـ). (8) • ومحمد بن محمد بن إبراهيم بن أبي القاسم الميدومي، مسند مصر (ت 754 هـ)، قال ابن حجر: \"وهو أعلى شيخ عند شيخنا العراقي من المصريين، ولقد أكثر عنه\". (9) • ومحمد بن محمد بن محمد بن أبي الحرم، أبو الحرم بن أبي الفتح القلانسي الحنبلي",
    "foot_note": "1. ترجمته في ذيل التذكرة للحسيني (ص 39). \n2. ترجمته في لحظ الألحاظ (ص 86). \n3. انظر: لحظ الألحاظ (ص 222). \n4. ترجمته في غاية النهاية (1/ 597 - 598). \n5. ترجمته في طبقات السبكي (4/ 94 - 96). \n6. ترجمته في ذيل التقييد (1/ 186). \n7. ترجمته في الدرر الكامنة (4/ 4 - 5). (3/ 384). \n8. ترجمته في الدرر الكامنة (3/ 482 - 483). \n9. الدرر الكامنة (4/ 157 - 158/ ترجمة الميدومي).",
    "book_id": "686",
    "new_page_number": 17
  },
  {
    "serial_number": "3345893",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 112,
    "volume_number": 1,
    "text": "(ت 765 هـ). (1) وغير هؤلاء جمع غفير، من استقرأ الدرر الكامنة لابن حجر يجد منهم الكثير.  المطلب السادس: تلاميذه (2) : اشتهرت شخصية العراقي في الآفاق لتبحره في الحديث النبوي مع مشاركة في علوم أخرى، كما شهد بذلك أئمة عصره، وقام بمهمة التدريس في دار الحديث الكاملية (3) ، والمدرسة الظاهرية القديمة (4) ، والمدرسة الفاضلية (5) ، وجامع ابن طولون (6) ، وغيرها من المدارس. (7) وأحيى سنة مجالس الإملاء بعد ما اندثرت. (8) كل ذلك جعل الناس يرحلون إليه من كل حدب، وصوب. قال تقي الدين ابن فهد المكي: \"قُصد من مشارق الأرض ومغاربها، فرحل إليه للأخذ عنه والسماع الجمُّ الغفير، الكبير منهم والصغير، فلازموه، وانتفعوا به، وكتب عنه جميع الأئمة من العلماء الأعلام، والحفاظ ذوي الفضل والانتقاد … \" (9) وفيما يلي ذكر لبعض هؤلاء الأعلام الذين تتلمذوا عليه:",
    "foot_note": "1. ترجمته في الدرر الكامنة (4/ 335). \n2. انظر: الحافظ العراقي، وأثره في السنة (1/ 471 - 2/ 512)، و (2/ 574 - 602). \n3. هي المدرسة التي أنشأها السلطان الملك الكامل ناصر الدين محمد ابن الملك العادل أبي بكر بن أيوب بالقاهرة في سنة 622 هـ. (انظر الخطط للمقريزي 2/ 375، وحسن المحاضرة 2/ 262). \n4. هي المدرسة التي أنشأها الملك الظاهر ركن الدين أبو الفتوح بيبرس التركي (ت 676 هـ) بالقاهرة، شرع في عمارتها في ثاني ربيع الآخر سنة ستين وست مائة، وفرغ منها في سنة اثنين وستين. (انظر الخطط للمقريزي 2/ 378 - 379، وحسن المحاضرة 2/ 264). \n5. هي المدرسة التي بناها القاضي الفاضل أبو علي عبد الرحيم بن علي البيسائي (ت 596 هـ) بجوار داره في القاهرة سنة ثمانين وخمس مائة. (انظر الخطط للمقريزي 2/ 366 - 367). \n6. هو الجامع الذي بناه الأمير أبو العباس أحمد بن طولون (ت 270 هـ) بالقاهرة، شرع في عمارته سنة ثلاث وستين ومائتين، وفرغ منه سنة ست وستين، وبلغت النفقة في بنائه مائة ألف وعشرين ألف دينار. (خطط المقريزي 2/ 265 - 269، وحسن المحاضرة 2/ 246 - 250). \n7. انظر: الضوء اللامع (4/ 174)، وذيل التقييد (3/ 9). \n8. انظر: فتح المغيث (3/ 251)، والضوء اللامع (4/ 174). \n9. لحظ الألحاظ (ص 234).",
    "book_id": "686",
    "new_page_number": 18
  },
  {
    "serial_number": "3345894",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 113,
    "volume_number": 1,
    "text": "• الحافظ شهاب الدين أحمد بن علي بن محمد بن علي بن حجر العسقلاني، صاحب فتح الباري، وتهذيب التهذيب، ولسان الميزان. (773 - 852 هـ). (1) • وولده المحدث الفقيه ولي الدين أبو زرعة أحمد بن عبد الرحيم، المعروف بابن العراقي، صاحب تكملة طرح التثريب، وتحفة التحصيل. (762 - 826 هـ). (2) • وصهره الحافظ نور الدين أبو الحسن علي بن أبي بكر بن سليمان بن أبي بكر بن عمر الهيثمي، صاحب مجمع الزوائد، ومجمع البحرين (735 - 807 هـ). لازم العراقي في سفره، وحضره، وزوجه العراقي ابنته الكبرى خديجة. (3) هؤلاء الثلاثة كانوا أجل تلاميذه. قيل للعراقي لما حضرته الوفاة: من بقي من الحفاظ؟ فقال: ابن حجر، ثم ابني أبو زرعة، ثم الهيثمي. (4) وهناك عدد كبير جدا لتلاميذه، أذكر بعضهم على حروف المعجم. • إبراهيم بن محمد بن خليل الطرابلسي، برهان الدين الحلبي المعروف بالسبط ابن العجمي (753 - 841). (5) • وأحمد بن أبي بكر بن إسماعيل البوصيري، صاحب مصباح الزجاجة، وإتحاف الخيرة المهرة. (762 - 840). (6) • وأحمد بن علي بن عبد القادر المَقريزي، العلامة المؤرخ، صاحب خطط القاهرة (766 - 845 هـ). (7)",
    "foot_note": "1. ترجمته في لحظ الألحاظ (326 - 342)، وترجم له السخاوي في مصَنف مفرد أسماه: الجواهر والدرر في ترجمة شيخ الإسلام ابن حجر. \n2. ترجمته في رفع الإصر (ص 60 - 61)، ولحظ الألحاظ (ص 284 - 291). \n3. ترجمته في إنباء الغمر (2/ 309)، والضوء اللامع (5/ 200 - 203). \n4. انظر: إنباء الغمر (2/ 277). \n5. ترجمته في لحظ الألحاظ (ص 308)، والضوء اللامع (1/ 138). \n6. ترجمته في إنباء الغمر (4/ 53)، والضوء اللامع (1/ 251). \n7. ترجمته في الضوء اللامع (2/ 21 - 25).",
    "book_id": "686",
    "new_page_number": 19
  },
  {
    "serial_number": "3345895",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 114,
    "volume_number": 1,
    "text": "• وعبد الرحمن بن محمد بن عبد الله المصري، الحنبلي، زين الدين الزركشي (758 - 846 هـ) (1) • وعبد الرحيم بن محمد بن عبد الرحيم المصري، الحنفي، المعروف بابن الفرات، مسند الديار المصرية. (759 - 851 هـ). (2) • ومحمد بن أحمد بن علي المكي، تقي الدين الفاسي، صاحب العقد الثمين، وذيل التقييد، (775 - 832 هـ). (3) • ومحمد بن عبد الدائم البرماوي شارح صحيح البخاري (763 - 831). (4) • ومحمد بن عبد الله بن ظهيرة القرشي، حافظ مكة، وقاضيها. (751 - 817 هـ). (5) • ومحمد بن محمد بن حسن الشُمني كمال الدين (766 - 821 هـ). (6) • ومحمد بن محمد بن محمد بن علي، أبو الخير شمس الدين المعروف بابن الجزري، إمام القراء (751 - 833 هـ). (7) • ومحمود بن أحمد بن موسى العيني، صاحب عمدة القارئ. (762 - 855 هـ). (8) • وجويرية ابنة المترجم عبد الرحيم بن الحسين العراقي (788 - 863 هـ). (9) • وزينب ابنة المترجم (791 - 865 هـ). (10)",
    "foot_note": "1. ترجمته في الضوء اللامع (4/ 136 - 137)، وحسن المحاضرة (1/ 483 - 484). \n2. ترجمته في الضوء اللامع (4/ 186). \n3. ترجمته في لحظ الألحاظ (ص 291). \n4. ترجمته في الضوء اللامع (7/ 280 - 282). \n5. ترجمته في لحظ الألحاظ (ص 253)، والضوء اللامع (8/ 92 - 95). \n6. ترجمته في المجمع المؤسس (3/ 301)، والضوء اللامع (9/ 74 - 75). \n7. ترجمته في غاية النهاية (5/ 247 - 251)، والضوء اللامع (9/ 255). \n8. ترجمته في الضوء اللامع (10/ 131 - 135). \n9. ترجمتها في الضوء اللامع (12/ 18). \n10. ترجمتها في الضوء اللامع (12/ 41).",
    "book_id": "686",
    "new_page_number": 20
  },
  {
    "serial_number": "3345896",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 115,
    "volume_number": 1,
    "text": "وغيرهم جم غفير، وخلق كثير، من يستقرئ إنباء الغمر لابن حجر، والضوء اللامع للسخاوي يجد الكثير الكثير، جزى الله شيخهم على تربية هذا الجيل المبارك وتعليمهم أحسن جزاء.  المطلب السابع: مؤلفاته (1) شرع الحافظ العراقي بالتصنيف في وقت مبكر، فولع بتخريج أحاديث إحياء علوم الدين للغزالي، وله من العمر قريب من العشرين سنة. (2) والبداية في الحداثة تعين على التمكن والمران، وظهر هذا جليا في مؤلفاته كما وكيفا؛ فقد ألف المؤلفات الكثيرة النافعة في مختلف العلوم، أذكر ما وقفت على ذكره منها مرتبا على حروف المعجم فيما يلي: 1. أجوبة ابن العربي. (3) 2. الأحاديث المخرجة في الصحيحين التي تكلم فيها بضعف وانقطاع: وهذا الكتاب لم يبيضه لأنه عدم من مسودته كراسان. (4) 3. إحياء القلب الميت بدخول البيت. (5) 4. إخبار الأحياء بأخبار الأحياء: في أربع مجلدات، فرغ من تسويده سنة إحدى وخمسين وسبع مائة، ثم بيض منه نحوا من خمسة وأربعين كراسا،",
    "foot_note": "1. للدكتور أحمد معبد عبد الكريم دراسة مطولة عن مؤلفات العراقي في كتابه المطول: \"الحافظ العراقي وأثره في السنة (2/ 657 - 5/ 2239)، ولم يأت في هذه المجلدات على دراسة بعض مؤلفات العراقي، منها تكملة شرح الترمذي، وذكر في نهاية الجزء الخامس أنه يليه الجزء السادس والأخير، ولم يطبع هذا الجزء بعد مع أنه مضى على طباعة أخواتها نحو خمسة عشر عاما. ولعل الله يحدث بعد ذلك أمرا. \n2. انظر: لحظ الألحاظ (ص 228). \n3. انظر: لحظ الألحاظ (ص 231). \n4. انظر: التقييد والإيضاح (ص 29)، والنكت على ابن الصلاح (1/ 380)، ولحظ الألحاظ (ص 231)، ولم يقف عليه ابن حجر بعد طول البحث عنه، والسؤال من المؤلف. \n5. انظر: لحظ الألحاظ (ص 231).",
    "book_id": "686",
    "new_page_number": 21
  },
  {
    "serial_number": "3345897",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 116,
    "volume_number": 1,
    "text": "وصل فيها إلى أواخر الحج. (1) 5. الأربعون البلدانية: ذكر فيها أحاديث من ستة وثلاثين بلدا، ورام إكمالها أربعين، لكن لم يتيسر له ذلك. (2) 6. الأربعون البلدانية: انتخبها من صحيح ابن حبان. (3) 7. الأربعون التساعية من رواية أبي الفتح محمد بن محمد الميدومي. (4) 8. الأربعون التساعية: من رواية البياني. (5) 9. الأربعون العشارية: أملاها في الروضة، وهي أول أماليه. (6) (مطبوع). 10. أربعون حديثا من الموطأ ـ رواية يحيى بن بكير ـ (7) 11. الاستعاذة بالواحد من إقامة جمعتين في مكان واحد. (8) 12. أطراف صحيح ابن حبان: بلغ فيه إلى أول النوع الستين من القسم الثالث. (9) 13. ألفية الحديث، المسماة بالتبصرة والتذكرة، مطبوع. (10)",
    "foot_note": "1. انظر: لحظ الألحاظ (ص 229)، وإنباء الغمر (2/ 276). \n2. انظر: لحظ الألحاظ (ص 233). \n3. انظر: لحظ الألحاظ (ص 232). \n4. انظر: لحظ الألحاظ (ص 232)، وفهرس الفهارس (2/ 817). \n5. انظر: لحظ الألحاظ (ص 232)، وفهرس الفهارس (2/ 817). والبياني هذا هو الشيخ المسند أبو عبد الله محمد بن إبراهيم بن محمد بن أبي بكر بن أحمد بن يعقوب بن إلياس الأنصاري الخزرجي البياني المقدسي، كما جاء على نسخته الخطية بدار الكتب المصرية (433/ حديث/ تيمور)، كما أفاد الشيخ أحمد معبد في كتابه الحافظ العراقي وأثره في السنة (5/ 2029). وللبياني ترجمة في الدرر الكامنة (3/ 295). \n6. انظر: لحظ الألحاظ (ص 232)، وطبع بتحقيق بدر بن عبد الله البدر. \n7. انظر: معجم الشيوخ لعمر بن فهد المكي (ص 92). \n8. انظر: لحظ الألحاظ (ص 231)، والضوء اللامع (4/ 173). والبدر الطالع (1/ 355). \n9. انظر: لحظ الألحاظ (ص 232). \n10. طبعت عدة طبعات، أحسنها طبعة دار المنهاج بالرياض.",
    "book_id": "686",
    "new_page_number": 22
  },
  {
    "serial_number": "3345898",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 117,
    "volume_number": 1,
    "text": "14. الألفية في غريب القرآن. (1) 15. الأمالي على أمالي الرافعي. (2) 16. الأمالي على الأربعين النووية. (3) 17. الإنصاف في المراسيل: وهو من آخر ما صنف. (4) 18. الباعث على الخلاص من حوداث القصاص: (5) (مطبوع). 19. تتمات المهمات: وهو استدراك على المهمات لشيخه الأسنوي. (6) 20. التحرير في أصول الفقه. (7) 21. تخريج الأحاديث التي يشير إليها الترمذي في كل باب. (8) 22. تخريج الأحاديث والآثار الواقعة في منهاج البيضاوي. (9) (مطبوع). 23. ترتيب من له ذكر ـ تجريح، أو تعديل ـ في بيان الوهم والإيهام لابن القطان على حروف المعجم. (10) 24. ترجمة الأسنوي. (11)",
    "foot_note": "1. انظر: لحظ الألحاظ (ص 230)، والضوء اللامع (4/ 173). \n2. انظر: المجمع المؤسس (2/ 185)، ولحظ الألحاظ (ص 233). وجد جزء منه في ثماني ورقات ضمن مجاميع المكتبة الظاهرية بدمشق تحت رقم (3963/ عام). (انظر الحافظ العراقي وأثره في السنة 5/ 2087). \n3. انظر: المجمع المؤسس (2/ 184)، ولحظ الألحاظ (ص 233). \n4. انظر: المجمع المؤسس (2/ 181)، ولحظ الألحاظ (ص 231)، والضوء اللامع (4/ 173). \n5. طبع بتحقيق الدكتور محمد لطفي الصباغ في الرياض 1422 هـ. \n6. انظر: الضوء اللامع (4/ 173). \n7. انظر: الأعلام للزركلي (3/ 344). \n8. انظر: الرسالة المستطرفة (ص 186). \n9. انظر: لحظ الألحاظ (ص 232). طبعته دار البشائر بتحقيق محمد ناصر العجمي سنة 1409 هـ. \n10. انظر: لحظ الألحاظ (ص 232). \n11. انظر: لحظ الألحاظ (ص 231).",
    "book_id": "686",
    "new_page_number": 23
  },
  {
    "serial_number": "3345899",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 118,
    "volume_number": 1,
    "text": "25. ترجمة مغلطاي. (1) 26. تفضيل زمزم على كل ماء قليل زمزم. (2) 27. تقريب الأسانيد، وترتيب المسانيد في الأحكام (3) : وهذا الكتاب جمعه المترجم من تراجم ستة عشر قيل فيها: إنها أصح الأسانيد. وهو مطبوع. 28. التقييد والإيضاح لما أطلق وأغلق من كتاب ابن الصلاح. مطبوع. (4) 29. تكملة شرح الترمذي: وسيأتي الكلام عليه في المبحث الثاني. 30. تكملة شرح المهذب للنووي: قال السخاوي: \"بنى على كتابة شيخه السبكي، فكتب أماكن\". (5) 31. جزء في الرواة الذين خرج لهم البخاري ومسلم في صحيحهما من غير الصحابة، ولم يرو عن كل منهم إلا راو واحد. (6) 32. جزء في الكلام على الأحاديث التي تكلم فيها بالوضع، وهي في مسند أحمد، والرد على ابن الجوزي. (7) أوردها ابن حجر برمتها في بداية القول المسدد (8) . 33. جزء في الكلام على حديث «الموت كفارة لكل مسلم». (9)",
    "foot_note": "1. انظر: الجواهر والدرر (3/ 1275). \n2. انظر: لحظ الألحاظ (ص 231). \n3. انظر: لحظ الألحاظ (ص 230)، والضوء اللامع (4/ 173). طبع ببيروت سنة 1404 هـ. \n4. له عدة طبعات، أحسنها طبعة الشيخ راغب الطباخ، وطبعة الدكتور أسامة خياط. \n5. انظر: الضوء اللامع (4/ 173). \n6. انظر: التقييد والإيضاح (ص 126). \n7. انظر: التقييد والإيضاح (ص 57). \n8. (ص 3 - 11). \n9. انظر: لحظ الألحاظ (ص 231). والحديث موضوع. (انظر الضعيفة (4685).",
    "book_id": "686",
    "new_page_number": 24
  },
  {
    "serial_number": "3345900",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 119,
    "volume_number": 1,
    "text": "34. الجواب عن سوال يتضمن تاريخ تحريم الربا. (1) 35. حواشي على تحفة الأشراف للمزي. (2) 36. الدرر السنية في نظم السيرة الزكية: وهي ألفية السيرة، تتضمن ألف، واثنين وثلاثين بيتا. (3) (مطبوع). 37. ذيل على ذيل العبر للذهبي: من سنة إحدى وأربعين وسبع مائة إلى سنة ثلاث وستين وسبع مائة، وذيل عليه ابنه الحافظ ولي الدين. (4) 38. ذيل على جامع التحصيل في باب المدلسين. (5) 39. ذيل على ذيل ابن أيبك على وفيات الأعيان لابن خلكان. (6) 40. ذيل على ذيل عبد الباقي بن عبد المجيد اليماني المخزومي (ت 743 هـ) (7) على وفيات الأعيان لابن خلكان. (8)",
    "foot_note": "1. انظر: لحظ الألحاظ (ص 331). والضوء اللامع (4/ 173). \n2. انظر: النكت الظراف (1/ 5 - 6 بهامش تحفة الأشراف). \n3. انظر: لحظ الألحاظ (ص 231)، نشرته إدارة مساجد بمحافظة حولي بالكويت باعتناء منصور العتيقي. \n4. انظر: لحظ الألحاظ (ص 231)، وذكر الشيخ أحمد معبد أن ما جاء في فهرسة مكتبة كوبريلي محمد باشا: ذيل تاريخ الذهبي لعبد الرحيم بن الحسين العراقي تحت رقم (1081) فهو خطأ، بل الموجود فيه من تأليف ابنه أبي زرعة. (انظر: الحافظ العراقي، وأثره في السنة 3/ 1169 - 1173). \n5. انظر: تعريف أهل التقديس (ص 65). \n6. انظر: طبقات ابن قاضي شهبة (4/ 32)، وكشف الظنون (2/ 2018). له نسخة في مكتبة كوبريلي زادة ضمن مجموعة برقم (1626)، ذكره المفهرس باسم: كتاب في التاريخ بعنوان: الوفيات العراقية. (انظر: الحافظ العراقي وأثره في السنة 3/ 1212). وابن أيبك هو الإمام المفيد شهاب الدين أحمد بن أيبك بن عبد الله الحسامي، المعروف بالدمياطي، المتوفى سنة 749 هـ. (انظر ذيل تذكرة الحفاظ للحسيني ص 54 - 55). \n7. ترجمته في الوفيات لابن رافع (1/ 437). \n8. انظر: كشف الظنون (2/ 2018)، والمستدرك على معجم المؤلفين (ص 367).",
    "book_id": "686",
    "new_page_number": 25
  },
  {
    "serial_number": "3345901",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 120,
    "volume_number": 1,
    "text": "41. ذيل على مختصر الذهبي لأأسد الغابة في معرفة الصحابة لابن الأثير. (1) 42. ذيل على ميزان الاعتدال للذهبي: ولم يبيض. (2) (مطبوع). 43. ذيل على وفيات النقلة لابن أيبك الدمياطي. (3) 44. ذيل مشيخة القاضي أبي الحرم القلانسي. (4) 45. ذيل مشيخة محمد بن إبراهيم البياني. (5) 46. رجال سنن الدارقطني سوى من في التهذيب. (6) 47. رجال صحيح ابن حبان سوى من في التهذيب: بلغ فيه إلى أول النوع الستين من القسم الثالث. (7) 48. الرد على الصاغاني في رسالته الدر الملتقط في بيان الغلط. (8) (مطبوع). 49. شرح البخاري: لم يكمل، ولو كمل لم يكن له نظير في بابه. (9) 50. شرح التبصرة والتذكرة: وهو شرح متوسط لألفية الحديث، وكان قد شرع في شرح مطول عليها كتب منه نحو ستة كراريس، ثم تركه، وعمل هذا الشرح. (10) (مطبوع)",
    "foot_note": "1. انظر: شرح التبصرة والتذكرة للعراقي (3/ 3). \n2. انظر: لحظ الأحاظ (ص 231)، وطبع بتحقيق الدكتور عبد القيوم عبد رب النبي. \n3. انظر: شرح التبصرة والتذكرة (3/ 133)، والحافظ العراقي، وأثره في السنة (3/ 1192). \n4. انظر: لحظ الألحاظ (ص 232)، والضوء اللامع (4/ 173). \n5. انظر: الدرر الكامنة (3/ 295)، والحافظ العراقي، وأثره في السنة (3/ 1288). \n6. انظر: لحظ الألحاظ (ص 233). \n7. المرجع نفسه (232 - 233). \n8. طبع جزء منه في آخر كتاب مسند الشهاب بتحقيق حمدي عبد المجيد السلفي. \n9. انظر: العجالة السنية في شرح ألفية السيرة النبوية للمناوي (ص 4). \n10. انظر: لحظ الألحاظ (ص 230)، وإنباء الغمر (2/ 276)، وله عدة طبعات. وطبع الكتاب باسم \"فتح المغيث\"، وهذه تسمية دخيلة، وأول من صرح بهذا الاسم صاحب كشف الظنون (1235). انظر الحافظ العراقي، وأثره في السنة (2/ 840).",
    "book_id": "686",
    "new_page_number": 26
  },
  {
    "serial_number": "3345902",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 121,
    "volume_number": 1,
    "text": "51. شرح التقريب والتيسير لمعرفة سنن البشير النذير للنووي. (1) 52. الشرح الكبير على ألفية الحديث، وصل فيها إلى الضعيف. (2) 53. شرح سنن أبي داود: لم يكمل. (3) 54. طرح التثريب شرح تقريب المسانيد: لم يكمله، فأكمله ابنه أبو زرعة، (4) (مطبوع). 55. طرق حديث «من كنت مولاه فعلي مولاه». (5) 56. العدد المعتبر من الأوجه التي بين السور. (6) 57. العشرون الثمانية من رواية البياني. (7) 58. فضل حراء. (8) 59. قرة العين بوفاء الدين: وهو آخر مؤلفاته. (9) (مطبوع). 60. الكشف المبين عن تخريج إحياء علوم الدين: وهو متوسط بين التخريج المطول المسمى بإخبار الأحياء، وبين التخريج المختصر المسمى بالمغني. (10) 61. الكلام على الحديث الوارد في أقل الحيض وأكثره. (11)",
    "foot_note": "1. انظر: كشف الظنون (1/ 465). \n2. انظر: شرح التبصرة والتذكرة (1/ 3)، والحافظ العراقي، وأثره في السنة (2/ 830). \n3. انظر: العجالة السنية على ألفية السيرة النبوية (ص 4). \n4. انظر: لحظ الألحاظ (ص 230). \n5. انظر: لحظ الألحاظ (ص 231). وانظر الحديث في الصحيحة (1750). \n6. انظر: إيضاح المكنون (2/ 96). \n7. انظر: لحظ الألحاظ (ص 232). \n8. انظر: لحظ الألحاظ (ص 231). \n9. لحظ الألحاظ (ص 231)، وطبعته دار الصحابة بطنطا 1411 هـ. \n10. انظر: لحظ الألحاظ (ص 230). \n11. انظر: لحظ الألحاظ (ص 232). وهو حديث ضعيف.",
    "book_id": "686",
    "new_page_number": 27
  },
  {
    "serial_number": "3345903",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 122,
    "volume_number": 1,
    "text": "62. الكلام على حديث التوسعة يوم عاشوراء. (1) 63. الكلام على صوم ست من شوال. (2) 64. الكلام على مسألة السجود لترك القنوت. (3) 65. ما رواه الصحابة عن التابعين عن الصحابة. (4) 66. مجلس في الاستسقاء: قال ابن حجر: لما توقف النيل، ووقع الغلاء المفرط أملى مجلسا فيما يتعلق بالاستسقاء. (5) 67. مجلس في فضائل الذكر والدعاء يوم عرفة. (6) 68. محجة القرب في محبة العرب. (7) (مطبوع). 69. مختصر تقريب الأسانيد: في نحو نصف حجمه. (8) 70. مختصر كتاب المائتين من حديث أبي عثمان الصابوني (ت 449 هـ). (9) 71. مسألة الشرب قائما. (10) 72. مسألة قص الشارب. (11) (مطبوع).",
    "foot_note": "1. انظر: لحظ الألحاظ (ص 231). ولفظ الحديث «من وسع على عياله يوم عاشوراء وسع الله عليه سائر سنته». قاتل الإمام أحمد: لا يصح هذا الحديث. (انظر المنار المنيف ص 111 - 112). \n2. انظر: لحظ الألحاظ (ص 231). \n3. انظر: لحظ الألحاظ (ص 231). \n4. انظر: تدريب الراوي (2/ 920). \n5. انظر: المجمع المؤسس (2/ 186). \n6. انظر: صلة الخلف بموصول السلف (ص 395). \n7. انظر: لحظ الألحاظ (ص 231). طبعته دار العاصمة 1420 هـ بتحقيق عبد العزيز بن عبد الله. \n8. انظر: لحظ الألحاظ (ص 230). \n9. ذكره الزبيدي في إتحاف السادة المتقين (4/ 432). وانظر الحافظ العراقي، وأثره في السنة (5/ 2137). \n10. انظر: لحظ الألحاظ (ص 231). \n11. المصدر نفسه. مطبوع بتحقيق مولاي عبد الرحيم مبارك بدار البشائر 1424 هـ.",
    "book_id": "686",
    "new_page_number": 28
  },
  {
    "serial_number": "3345904",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 123,
    "volume_number": 1,
    "text": "73. المستخرج على المستدرك. (1) (مطبوع). 74. مشيخة القاضي ناصر الدين ابن النونسي، وذيلها. (2) 75. مشيخة عبد الرحمن بن القارئ. (3) 76. معجم خرجه لنفسه، وشكك في وجوده السخاوي، فقال: ومن الغريب قول البرهان الحلبي إنه خرج لنفسه معجما، وما وقف شيخنا عليه، وكذا ما وقفت عليه. (4) 77. معجم شيوخ ابن جماعة: ولم يكمل. (5) 78. المغني عن حمل الأسفار في الأسفار في تخريج ما في الإحياء من الأخبار: وهو التخريج المختصر لأحاديث إحياء علوم الدين للغزالي، وقد اشتهر هذا المختصر في حياته، وكتبت منه نسخ عديدة، سارت بها الركبان إلى الأندلس، وغيرها من البلدان، وبسببه تباطأ الشيخ عن إكمال تبييض الأصل، (6) (مطبوع). 79. معجم مشتمل على تراجم جماعة من أهل القرن الثامن: قال ابن فهد: غالبهم شيوخ شيوخه، وفيهم من شيوخه، (7) 80. من روى عن عمرو بن شعيب من التابعين. (8)",
    "foot_note": "1. انظر ترجمة عبد الحميد بن عبد الرحمن الأعرج من ذيل ميزان الاعتدال (ص 322 - 323)، وطبع جزء منه بتحقيق محمد عبد المنعم رشاد، نشرته مكتبة السنة بالقاهرة سنة 1410 هـ. \n2. انظر: ذيل العبر لأبي زرعة (وفيات (763 هـ)، (1/ 87 - 88)، ولحظ الألحاظ (ص 231). \n3. انظر: معجم الشيوخ لابن فهد (ص 302)، ولحظ الألحاظ (ص 232). وابن القارئ هو عبد الرحمن بن علي بن محمد الثعلبي، زين الدين أبو الفرج، المتوفى سنة 776 هـ. (انظر الدرر الكامنة 2/ 337). \n4. انظر: الضوء اللامع (4/ 174). \n5. انظر: ذيل العبر للولي العراقي (وفيات سنة 767 هـ)، (1/ 204). \n6. انظر: إنباء الغمر (2/ 276)، ولحظ الألحاظ (ص 230). وطبع مرارا مع إحياء علوم الدين، ثم طبع مفردا باعتناء أشرف عبد المقصود. \n7. انظر: لحظ الألحاظ (ص 232)، ومنه نسخة في المكتبة الكتانية بالمغرب. (انظر مقدمة المحقق لشرح التبصرة والتذكرة ص 18). \n8. انظر: شرح التبصرة والتذكرة (3/ 66).",
    "book_id": "686",
    "new_page_number": 29
  },
  {
    "serial_number": "3345905",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 124,
    "volume_number": 1,
    "text": "81. منظومة في الوضوء المستحب. (1) 82. المورد الهني في المولد السني. (2) 83. النجم الوهاج في نظم المنهاج في أصول الفقه للبيضاوي، في ألف وثلاث مائة وسبعة وستين بيتا. (3) 84. نظم الاقتراح لابن دقيق العيد في أربع مائة وسبع وعشرين بيتا. (4) 85. النكت على النجم الوهاج: بين فيها حكمة مخالفته لعبارة المنهاج مع التنبيه على دقائق ذلك، ولم يكمل، بلغ فيه إلى أثناء الباب الخامس من مبحث الناسخ والمنسوخ. (5) ومما نسب إليه خطأ: • المستفاد من مبهمات المتن والإسناد، نسبه عمر رضا كحالة في المستدرك على معجم المؤلفين (6) ، والصحيح أنه لولده أبي زرعة. (7) • جزء عوالي ابن الشيخة (8) : عزاه حاجي خليفة في كشف الظنون (9) للزين العراقي، وهو خطأ، والصحيح أنه لابنه أبي زرعة، كما عزاه ابن حجر في المجمع المؤسس (10) .",
    "foot_note": "1. انظر: كشف الظنون (2/ 1867). \n2. انظر: لحظ الألحاظ (ص 231). \n3. انظر: لحظ الألحاظ (ص 230)، وذيل التذكرة للسيوطي (ص 371). \n4. انظر: لحظ الألحاظ (ص 230 - 231)، ومنه نسخة في مكتبة لاله لي (1392/ أصول حديث). (انظر الحافظ العراقي وأثره في السنة (3/ 1035). \n5. انظر: لحظ الألحاظ (ص 230). \n6. (ص 367). \n7. وهو مطبوع متداول بتحقيق عبد الرحمن عبد الحميد البر. \n8. ابن الشيخة هو الإمام أبو الفرج عبد الرحمن بن أحمد بن مبارك الغزي، المتوفى سنة 799 هـ. (انظر: المجمع المؤسس 2/ 107 - 137). \n9. (2/ 1178). \n10. (2/ 108).",
    "book_id": "686",
    "new_page_number": 30
  },
  {
    "serial_number": "3345906",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 125,
    "volume_number": 1,
    "text": "المطلب الثامن: وفاته: توفي الحافظ العراقي عقب خروجه من الحمام بالقاهرة نصف ليلة الأربعاء ثامن شهر شعبان سنة ست وثمان مائة عن واحد وثمانين عاما، وثلاثة أشهر إلا أياما، وصلى عليه الشيخ شهاب الدين الذهبي (1) ، ودفن بباب البرقية. (2) ورثاه ابن حجر في قصيدة طويلة مطلعها: مُصاب لم يُنفَّس للخناق .. أصار الدمعَ جارا للمآقي (3) ومن الطرائف ما قال ابن حجر أيضا في ترجمة ابن الملقن من إنباء الغمر (4) : \"وهؤلاء الثلاثة: العراقي، والبلقيني، وابن الملقن كانوا أعجوبة هذا العصر على رأس القرن، الأول في معرفة الحديث وفنونه، والثاني في التوسع في معرفة مذهب الشافعي، والثالث في كثرة التصانيف، وقدر أن كل واحد من الثلاثة ولد قبل الآخر بسنة، ومات قبله بسنة، فأولهم ابن الملقن ولد سنة ثلاث وعشرين، ومات سنة أربع وثمان مائة، والبلقيني ولد سنة أربع وعشرين، ومات سنة خمس وثمان مائة، والعراقي ولد سنة خمس وعشرين، ومات سنة ست وثمان مائة\". اه. رحمهم الله رحمة واسعة، وأسكنهم فسيح جناته.  المبحث الثاني: دراسة الكتاب  المطلب الأول: تحقيق اسم الكتاب لم ينصّ الحافظ العراقي في مقدمة شرحه لجامع الترمذي على اسم خاص له، لكن ورد اسم \"تكملة شرح الترمذي\" على غلاف",
    "foot_note": "1. هو أحمد بن الجوبان الذهبي الدمشقي، الكاتب المجود، المتوفى سنة 816 هـ. (انظر: الضوء اللامع (1/ 268). \n2. انظر: ذيل الدرر الكامنة (ص 145)، والمجمع المؤسس (2/ 188)، وإنباء الغمر (2/ 277)، والدليل الشافي (1/ 409)، والضوء اللامع (4/ 177). \n3. انظر: إنباء الغمر (2/ 278 - 279). \n4. (2/ 318 - 319).",
    "book_id": "686",
    "new_page_number": 31
  },
  {
    "serial_number": "3345907",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 126,
    "volume_number": 1,
    "text": "النسخة الخطية للكتاب، (1) وبذلك سماه ابن حجر (2) ، وابن قاضي شهبة (3) ، وابن فهد (4) ، والسيوطي (5) . وهو اسم مطابق للواقع؛ فإن العراقي شرح جامع الترمذي من حيث توقف ابن سيد الناس في شرحه المسمى بـ\"النفح الشذي\". وسماه بعضهم على سبيل الاختصار: \"شرح الترمذي\". (6)  المطلب الثاني: توثيق نسبة الكتاب إلى مؤلفه لاشك في نسبة هذا الكتاب لمؤلفه؛ لما يلي: 1. وجود أجزاء من نسخة الكتاب بخط الشارح، ووجود اسم الشارح على غلاف جميع ما توفر من النسخ الخطية. (7) 2. أحال الشارح على كتابه هذا في مؤلفاته الأخرى، فعلى سبيل المثال أنه أحال في كتابه التقييد والإيضاح (8) حيث تكلم على حديث المغفر بإيجاز، ثم قال: \"وقد بينت ذلك في شرح الترمذي\". اه. وكلامه هذا موجود في أبواب الجهاد، باب ما جاء في المغفر. 3. نقلُ كثير من أهل العلم من هذا الكتاب، وممن نقل منه ابن حجر في فتح الباري، والعيني في عمدة القاري، والسيوطي في عقود الزبرجد، والمناوي في",
    "foot_note": "1. انظر: نسخة السليمانية برقم (512). \n2. في المجمع المؤسس (2/ 182). \n3. في طبقات الشافعية (4/ 31). \n4. في لحظ الألحاظ (ص 232). \n5. في ذيل طبقات الحفاظ (ص 371). \n6. انظر: درة الحجال (3/ 113)، وفتح الباري (2/ 330، و 411، و 3/ 27). \n7. نسخة السليمانية (رقم 511)، ونسخة فيض الله أفندي (رقم 364). وهما بخط الشارح، وقد كتب على صفحتي عنوانهما: \"بخط مؤلفه الحافظ العراقي\". وانظر أيضا السليمانية (رقم 513). \n8. (ص 87).",
    "book_id": "686",
    "new_page_number": 32
  },
  {
    "serial_number": "3345908",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 127,
    "volume_number": 1,
    "text": "فيض القدير، والشوكاني في نيل الأوطار. وقارنت بعض النصوص التي نقلها المناوي من شرح الترمذي، فوجدتها كما هي في هذا الكتاب. (1) 4. ذكرُ مترجميه على أن له كتابا في شرح الترمذي أكمل به شرح ابن سيد الناس. (2)  المطلب الثالث: موضوع الكتاب . الكتاب شرح لجامع الترمذي إلا أن العراقي شرحه من حيث توقف ابن سيد الناس في شرحه المسمى بـ: \"النفح الشذي\". قال العراقي في مقدمة شرحه: \" … لكن اخترمته المنية قبل إكماله … ، وآخر ما رأيت منه بخطه شرحه لبعض \"باب ما جاء أن الأرض كلها مسجد إلا المقبرة والحمام\" .... ، فشرعت في البناء عليه من أول هذا الباب\". (3) ومات العراقي أيضا قبل إكماله، قال ابن فهد: تكملة شرح جامع الترمذي لابن سيد الناس، وهي من \"باب ما جاء في أن الأرض كلها مسجد إلا المقبرة والحمام\" إلى قوله في أثناء كتاب البر والصلة: \"باب ما جاء في الستر على المسلمين\"، ثلاثة عشر مجلدا، خرج من ذلك إلى أثناء الصيام قريبا من ست مجلدات. (4) وظاهر قول ابن فهد أن العراقي لم يشرح باب الستر على المسلمين، بل وقف عنده،",
    "foot_note": "1. انظر: فتح الباري (2/ 330، و 411، و 3/ 27)، وعمدة القاري (6/ 131، و 175، و 208)، و (10/ 83). وعقود الزبرجد (1/ 149، و 224)، وفيض القدير (1/ 82)، و (2/ 480)، (5/ 228)، و (6/ 51)، ونيل الأوطار (2/ 80، و 148، و 152). والنصوص التي نقلها المناوي بحثتها في تكملة شرح الترمذي فوجدتها بنصها في تكملة شرح الترمذي على الترتيب في: باب ما جاء في الاستفتاح بصعاليك المسلمين، وباب ما جاء في الأجراس على الخيل، وباب ما جاء في الرهان، وباب ما جاء في المشورة. \n2. انظر مثلا: المجمع المؤسس (2/ 182)، وطبقات الشافعية لابن قاضي شهبة (4/ 31)، ولحظ الألحاظ (ص 232)، والضوء اللامع (4/ 173)، وذيل طبقات الحفاظ للسيوطي (ص 371). \n3. تكملة شرح الترمذي (ج 1/ ل 2/ أ) من نسخة الإسكوريال. \n4. لحظ الألحاظ (ص 232).",
    "book_id": "686",
    "new_page_number": 33
  },
  {
    "serial_number": "3345909",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 128,
    "volume_number": 1,
    "text": "أي بتمام شرح الباب الذي قبله، وهو باب ما جاء في شفقة المسلم على المسلم. وهذا موافق لما جاء على صفحة العنوان من النسخة المحفوظة بالمكتبة السليمانية برقم (513): \"الأخير من شرح الترمذي للحافظ العراقي من باب في الثبات عند القتال من الجهاد إلى باب ما جاء في شفقة المسلم، وهو آخر ما انتهى إليه الشارح، ولم يكمل الكتاب\". وقد وصل إلينا هذا الشرح، فلله الحمد والمنة.  المطلب الرابع: في شروح جامع الترمذي، ومكانة شرح العراقي بينها: أولا: شروح جامع الترمذي (1) : جامع الإمام الترمذي أحد دواوين السنة التي عليها مدار الإسلام، ومن ثم حظي بعناية العلماء، فشرحه غير واحد. ومن شروحه: 1. عارضة الأحوذي (2) في شرح سنن الترمذي للقاضي أبي بكر محمد بن عبد الله الإشبيلي، المالكي، المعروف بابن العربي المتوفى سنة 543 هـ. وهو شرح متوسط، اهتم مؤلفه بالأحكام المستنبطة من الأحاديث، والمسائل الفقهية مركزا على أقوال المالكية، ولم يعتن بتخريج أحاديث الترمذي، وما يشير إليه الترمذي في",
    "foot_note": "1. انظر: مقدمة تحفة الأحوذي (1/ 180 - 190)، والإمام الترمذي، ومنهجه في كتابه الجامع لعداب الحمش (1/ 39 - 45)، ومقدمة محقق النفح الشذي (1/ 70 - 85)، والأحاديث الحسان الغرائب لعبد الباري الأنصاري (69 - 74). \n2. قال ابن خلكان: \"ومعنى عارضة الأحوذي: فالعارضة القدرة على الكلام، يقال: فلان شديد العارضة إذا كان ذا قدرة على الكلام. والأحوذي الخفيف في الشيء لحذقه. وقال الأصمعي: المشمر في الأمور، القاهر لها، الذي لا يشذ عليه منها شيء. وهو بفتح الهمزة، وسكون الحاء المهملة، وفتح الواو، وكسر الذال المعجمة، وفي آخره ياء مشددة. (وفيات الأعيان 3/ 424). وعقب سعيد أعراب ابنَ خلكان، فقال: وهو تفسير مخالف ما يفيده سياق كلامه في غير ما موضع من هذا الكتاب من أنها تعني ما يعرض في الذهن من معاني الكتاب. (مع القاضي أبي بكر ابن العربي ص 137).",
    "book_id": "686",
    "new_page_number": 34
  },
  {
    "serial_number": "3345910",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 129,
    "volume_number": 1,
    "text": "الباب، ويذكر أحيانا درجة الحديث. وقد يجمع الأبواب التي في معنى واحد، فيشرحها جميعا في موضع واحد، (1) وقد يغفل بعض الأبواب (2) من الشرح. وهو أقدم ما وصل إلينا من شروحه، وطبع في ثلاثة عشر جزءا في سبع مجلدات مع جامع الترمذي. 2. النفح الشذي في شرح جامع الترمذي للحافظ أبي الفتح محمد بن محمد بن سيد الناس اليعمري المتوفى سنة 734 هـ. وهو شرح مطول ممتع، إلا أن ابن سيد الناس انتهى فيه إلى أثناء باب ما جاء أن الأرض كلها مسجد إلا المقبرة والحمام، كما ذكر العراقي في تكملته. (3) وقال الكمال جعفر بن ثعلب الأُدفُوي الشافعي (ت 748 هـ): \"شرع (يعني ابن سيد الناس) في شرح الترمذي، ولو اقتصر فيه على فن الحديث من الكلام على الأسانيد لكمل، لكنه قصد أن يتبع شيخه ابن دقيق العيد، فوقف دون ما يريد\". اه. (4) اعتنى مؤلفه بتخريج أحاديث الباب التي خرجها الترمذي، أو أشار إليها، واستدرك عليه ما فاته من الأحاديث، وتكلم على سند الحديث، وأحوال الرواة، ومواضع الضعف والإعلال، واهتم بتفسير غريب الحديث، وشرح المسائل الفقهية معتنيا ببيان الخلاف فيها. (5) وطبعت قطعة منه في مجلدين بتحقيق الدكتور أحمد معبد. (6)",
    "foot_note": "1. انظر مثلا: عارضة الأحوذي (1/ 50 - 55)، و (2/ 209 - 218)، و (5/ 227 - 281). \n2. انظر مثلا: باب ما جاء في كراهية الأذان بغير وضوء، وباب ما جاء ليس في الخيل والرقيق صدقة، وباب ما جاء في كراهية النجش في البيوع. \n3. (ج 1/ ل 2/ أ) من نسخة الإسكوريال. \n4. الدرر الكامنة (4/ 209). وانظر ترجمة الأدفوي في الدرر الكامنة (1/ 535). \n5. مقدمة محقق النفح الشذي (1/ 92 - 128). \n6. ينتهي المطبوع بالحديث العاشر، وحقق شيخنا عبد الرحمن صالح محيي الدين في رسالة الدكتوراه التي تقدم بها عام 1405 هـ من أول الكتاب إلى باب في المذي يصيب الثوب (الحديث 115)، وأما الجزء المتبقي فقد قام بتحقيقه عدد من الباحثين بتكليف من عمادة البحث العلمي بالجامعة الإسلامية بالمدينة المنورة؛ فإنها تعتزم على طبعه مع تكملة شرح الترمذي. يسر الله طبعه.",
    "book_id": "686",
    "new_page_number": 35
  },
  {
    "serial_number": "3345911",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 130,
    "volume_number": 1,
    "text": "3. تكملة شرح الترمذي للحافظ العراقي، المتوفى سنة 806 هـ. وهو موضوع هذا البحث، وسأتحدث عن منهجه في المبحث الخامس. وتوفي العراقي قبل إكماله، كما تقدم. 4. تكملة شرح الترمذي لولي الدين أبي زرعة أحمد بن عبد الرحيم العراقي (ت 826 هـ). ذكر المناوي أن أبا زرعة أكمل كتاب والده. (1) قال الدكتور أحمد معبد: \"ولم أقف على نسخة من تلك التكملة، أو نقول عنه\". (2) 5. تكملة شرح الترمذي لأبي الخير محمد بن عبد الرحمن السخاوي (ت 902 هـ). ذكر السخاوي في الضوء اللامع (3) أنه ألف تكملة شرح الترمذي للعراقي، وكتب منه أكثر من مجلدين في عدة أوراق من المتن. والظاهر أنه بدأه من حيث توقف العراقي، وهو باب ما جاء في شفقة المسلم على المسلم الباب الثامن عشر من كتاب البر والصلة، يشعر بذلك أن السخاوي لما خرج في المقاصد الحسنة (4) أحاديث في ذم الفحش ـ منها حديث «إن شر الناس منزلة يوم القيامة من تركه الناس اتقاء فحشه» ـ قال: وقد استوفيت ما في المعنى فيما كتبته من تكملة شرح الترمذي\" اه. والحديث المذكور أخرجه الترمذي في الباب التاسع والخمسين من كتاب البر والصلة. (5) وقال الدكتور أحمد معبد: \"لم أقف على نسخة منها رغم البحث الدائب\". (6) 6. شرح الترمذي للحافظ عبد الرحمن بن أحمد بن رجب الحنبلي (ت 795 هـ). قال الحافظ ابن حجر: صنف شرح الترمذي، فأجاد فيه في نحو عشرين مجلدة. (7) ولم يصل إلينا منه إلا شرح العلل التي في آخر الجامع، وقطعة يسيرة من كتاب",
    "foot_note": "1. انظر العجالة السنية على ألفية السيرة النبوية (ص 4). \n2. مقدمة تحقيق النفح الشذي (1/ 76). \n3. (8/ 16). \n4. (ص 350). \n5. (3/ 532 رقم 1996). \n6. مقدمة محقق النفح الشذي (1/ 76)، وانظر الحافظ السخاوي وجهوده في الحديث (1/ 237). \n7. إنباء الغمر (1/ 460)، وانظر الجوهر المنضد (ص 48).",
    "book_id": "686",
    "new_page_number": 36
  },
  {
    "serial_number": "3345912",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 131,
    "volume_number": 1,
    "text": "اللباس (1) ، وقد قال يوسف بن عبد الهادي: \"قد احترق غالب ما عمله من شرح الترمذي في الفتنة\". (2) ومن خلال القطعة الموجودة يمكن أن يقال: إنه يخرج أحاديث الباب معتنيا بذكر المتابعات، كما يخرج الأحاديث التي يشير إليها الترمذي بقوله: (وفي الباب)، ويضيف إليه من لم يذكرهم الترمذي من الصحابة، ويخرج أحاديثهم، ويعتني في تخريج هذه الأحاديث كلها بالكلام على مواضع الضعف والتعليل، ويختم الباب بذكر فقه الحديث معتنيا في ذلك بأقوال الفقهاء المتقدمين. (3) وهو شرح موسع، يدل على ذلك أن ابن رجب يطيل النفس في شرح صحيح البخاري في بعض الأحاديث، ثم يقول: \"وقد استوفينا الأحاديث في ذلك، والكلام عليها في شرح الترمذي\". (4) وأما شرح العلل التي بآخر الجامع فهو غاية في التحقيق، لا يستغني عنه طالب العلم. 7. إنجاز الوعد الوفي في شرح جامع الترمذي للحافظ سراج الدين عمر بن علي الشهير بابن الملقن (ت 804 هـ). توجد قطعة منه مخطوطة، (5) غالبها بخط المصنف، تنتهي عند ابتداء باب ما جاء في كيف الجلوس في التشهد من أبواب الصلاة. وهو شرح للأحاديث الزوائد في جامع الترمذي على أحاديث الصحيحين، وسنن",
    "foot_note": "1. هذه القطعة من كتاب اللباس طبعت بتحقيق سامي جاد الله عام 1439 هـ. \n2. الجوهر المنضد (ص 49). والظاهر أن المراد بالفتنة ما عمله تيمور لنك سنة 803 هـ حينما هجم على دمشق، وعقد مع أهلها صلحا، ثم غدر بهم، فأحرق البلد، وعمل بأهلها ألوانا من الفظائع. (انظر النجوم الزاهرة 12/ 190 - 194). \n3. انظر دراسة الدكتور همام سعيد في بداية شرح علل الترمذي لابن رجب (1/ 277 - 285). \n4. فتح الباري (6/ 179). \n5. في مكتبة ششتربيتي تحت رقم (5187)، ومنها صورة عند فضيلة الدكتور عبد الله عبد العزيز الفالح، عضو هيئة التدريس بكلية الحديث الشريف والدراسات الإسلامية بالجامعة الإسلامية بالمدينة المنورة.",
    "book_id": "686",
    "new_page_number": 37
  },
  {
    "serial_number": "3345913",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 132,
    "volume_number": 1,
    "text": "أبي داود. (1) وذكر ابن قاضي شهبة عددا من مصنفاته، منها هذا الكتاب، ثم قال: \"ولكن لم يوجد ذلك بعده؛ لأن كتبه احترقت قبل موته بقليل\". (2) 8. العَرف الشذي على جامع الترمذي لأبي حفص سراج الدين عمر بن رسلان، المعروف بالبلقيني (ت 805 هـ). قال ابن قاضي شهبة عند ذكر مصنفاته: \"العرف الشذي على جامع الترمذي كتب منه قطعة صالحة، والسبب في عدم إكماله لغالب مصنفاته اشتغاله بالأشغال والتدريس والتحديث والإفتاء\". اه. (3) وذكر ابن فهد أن للبلقيني شرحين على الترمذي، أحدهما صناعة، والآخر فقه. (4) وقال الدكتور أحمد معبد: \"وعلى كل حال فلم أقف على شيء مما شرحه البلقيني من جامع الترمذي\". (5) 9. شرح الترمذي لابن حجر العسقلاني (ت 852 هـ). قال السخاوي: \"شرع فيه في سنة ثمان وثمانمائة في الدروس أولَ ما ولي تدريس الحديث بالشيخونية (6) ، فكتب منه قدر مجلدة مسودة، وفتر عزمه منه، ولو كمل لجاء في خمسة عشر سفرا، أو ستة أسفار كبار، حسبما قرأته بخطه في موضعين\". (7) وذكر السيوطي، وأبو الطيب السندي، والدكتور أحمد معبد أنهم لم يقفوا عليه. (8)",
    "foot_note": "1. انظر إنباء الغمر (2/ 217). \n2. طبقات الشافعية له (4/ 45). \n3. طبقات الشافعية (4/ 42 - 43). \n4. انظر: لحظ الألحاظ (ص 216). \n5. مقدمة التحقيق على النفح الشذي للدكتور أحمد معبد (1/ 80). \n6. المدرسة الشيخونية بمصر: أنشأها شيخو، سيف الدين العمري (ت 758 هـ)، فرغ من عمارتها سنة 757 هـ .. (انظر: حسن المحاضرة 2/ 266). \n7. الجواهر والدرر (2/ 676). \n8. انظر: قوت المغتذي (1/ 15)، وشرح أبي الطيب السندي على جامع الترمذي (1/ 4)، ومقدمة محقق النفح الشذي (1/ 81).",
    "book_id": "686",
    "new_page_number": 38
  },
  {
    "serial_number": "3345914",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 133,
    "volume_number": 1,
    "text": "10. قوت المغتذي على جامع الترمذي للحافظ جلال الدين عبد الرحمن بن أبي بكر السيوطي (ت 911 هـ). وهو شرح مختصر كالحاشية، اعتنى فيه السيوطي بمعاني الألفاظ، وإعرابها، وضبط بعض الأسماء الواردة في الإسناد والمتن، كل ذلك بأوجز عبارة، وألخص إشارة. وقدم له بمقدمة نفيسة تضمنت بيان شرط الترمذي، ومنزلته عند أهل العلم، ورواته عن مؤلفه، ومصطلحاته. (1) وطبع قديما مع شرح أبي الطيب السندي في كانبور، الهند سنة 1299 هـ. 11. شرح الترمذي لمجد الدين محمد بن طاهر الصديقي الفتني (ت 986 هـ). (2) ذكر المباركفوري (3) أنه لم يقف عليه، ولا يعلم هل أتمه، أم لا؟ 12. حاشية أبي الحسن محمد بن عبد الهادي السندي (ت 1138 هـ) (4) على جامع الترمذي. انصبت فيها عناية السندي على شرح الألفاظ، وبيان المراد، وطبعت في مصر بهامش جامع الترمذي. (5) 13. حياة المهجة وإيضاح الوجهة على سنن الحافظ الحجة أبي عيسى الترمذي لأبي الطيب محمد بن عبد القادر السندي الحنفي (ت 1149 هـ) (6) . وهو أشبه بالحاشية، قال السندي في مقدمته: \"استخرت الله تعالى أن أشرح شرحا يحل جميع ألفاظه إلا ما شذ\". (7) قال الدكتور أحمد معبد: لم أجد مؤلفه التزم بشرطه هذا من شرح جميع الألفاظ، أو أغلبها، بل وجدته ترك الكثير مما شرحه",
    "foot_note": "1. انظر: مقدمة تحقيق النفح الشذي (1/ 82)، والأحاديث الحسان الغرائب (ص 73). \n2. له ترجمة في نزهة الخواطر (1/ 409)، ومقدمة تحفة الأحوذي (1/ 189). \n3. في مقدمة تحفة الأحوذي (1/ 384). \n4. ترجمته في الأعلام للزركلي (6/ 253). \n5. انظر: مقدمة تحفة الأحوذي (1/ 190). \n6. مقدمة التحقيق على النفح الشذي (1/ 82 - 83). \n7. شرح أبي الطيب السندي (1/ 5).",
    "book_id": "686",
    "new_page_number": 39
  },
  {
    "serial_number": "3345915",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 134,
    "volume_number": 1,
    "text": "السابقون … ، كما أنه يخرج ما أشار إليه الترمذي بقوله في الباب، وتارة يتركه\". (1) وطبع قديما مع قوت المغتذي في كانبور، الهند سنة 1299 هـ. 14. حاشية أحمد علي بن لطف الله السهارنفوري (ت 1297 هـ) (2) على جامع الترمذي. وهي في غاية الاختصار، تتضمن بيان غريب الحديث، وضبط ألفاظه. وطبعت بهامش السنن مع نفع قوت المغتذي، والعرف الشذي للسهارنفوري في مجلد واحد على القطع الكبير. 15. نفع قوت المغتذي لعلي بن سليمان الدمنتي المغربي (ت 1306 هـ). (3) وهو اختصار لشرح السيوطي \"قوت المغتذي\". مطبوع. 16. الكوكب الدري على جامع الترمذي لرشيد أحمد الكَنكُوهي (ت 1323 هـ) (4) . جمعه تلميذه محمد يحيى بن محمد إسماعيل الكاندهلوي (ت 1334 هـ) من إفاداته، وهو أشبه بالمذكرات منه بالشرح، غالبه يتعلق بمعاني الأحاديث، وجواب الإيرادات على المذهب الحنفي. (5) وطبع في أربعة مجلدات. 17. … العرف الشذي على جامع الترمذي لمحمد أنور شاه الكشميري (ت 1352 هـ). (6) والكتاب في الأصل تعليقات كتبها تلميذه محمد جِراغ علي من إملاء شيخه الكشميري عند شرحه للجامع، وجل اعتنائه بأدلة الأحناف، والجواب عن الإيرادات على المذهب الحنفي. وطبع في باكستان مع بعض الحواشي على جامع الترمذي.",
    "foot_note": "1. مقدمة التحقيق على النفح الشذي (1/ 83). \n2. ترجمته في جهود مخلصة (ص 89). \n3. له ترجمة في الأعلام للزركلي (5/ 121)، وهدية العارفين (1/ 776). \n4. له ترجمة في جهود مخلصة (ص 223). \n5. انظر: نظرات في الحديث النبوي (ص 169 - 170)، والأحاديث الحسان الغرائب (ص 74). \n6. له ترجمة في جهود مخلصة (ص 232 - 235).",
    "book_id": "686",
    "new_page_number": 40
  },
  {
    "serial_number": "3345916",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 135,
    "volume_number": 1,
    "text": "18. تحفة الأحوذي شرح جامع الترمذي للعلامة محمد عبد الرحمن بن عبد الرحيم المباركفوري (ت 1353 هـ). (1) وهو شرح حافل، قدم له بمقدمة على نمط هدي الساري للحافظ ابن حجر، تكلم فيها على علم الحديث، وما ألف فيه من مصنفات متنوعة، كما تحدث عن الترمذي، وجامعه مفصلا. واعتنى بالصناعة الحديثية من الترجمة المختصرة لرجال الإسناد، وتخريج أحاديث الباب، وما يشير إليه الترمذي بقوله: (وفي الباب)، ويذكر أحيانا بعض ما فات الترمذي من أحاديث، ويوضح الإشكالات الإسنادية والمتنية، كما يتناول الأحكام الفقهية المستنبطة من الحديث مع بيان أقوال أهل العلم فيها، وذكر أدلتها، ومناقشتها، ويهتم ببيان اختلاف النسخ في حكم الإمام الترمذي على الحديث إلا أنه قلما يعتني بتعليل تلك الأحكام. (2) 19. الطيب الشذي على جامع الترمذي لأشفاق الرحمن الكاندهلوي (ت 1377 هـ). (3) اعتنى مؤلفه بترجمة رجال الإسناد وشرح الألفاظ، وشرح المذهب الحنفي شرحا وافيا منتصرا له بعد ما بين المذاهب الأخرى. وفي أول الكتاب مقدمة تضم تاريخ تدوين الحديث، وترجمة الإمام الترمذي ومصطلحاته وبعض مبادئ علوم الحديث. وطبع الجزء الأول في عام 1344 هـ من المطبعة الخيرية بمصر تحت إشراف الشيخ عاشق إلهي الميروتي. 20. معارف السنن لمحمد يوسف بن محمد زكريا البنوري (ت 1397 هـ). (4) يعتني",
    "foot_note": "1. له ترجمة في آخر مقدمة تحفة الأحوذي بقلم أبي الفضل عبد السميع المباركفوري (ص 615 - 635/ الطبعة البيروتية)، وفي \"جهود مخلصة في خدمة السنة المطهرة\" للفريوائي (ص 146 - 150). \n2. انظر ما كتبه أبو الفضل عبد السميع المباركفوري (ص 627 - 628)، والأحاديث الحسان الغرائب (ص 73 - 74). \n3. انظر تاريخ التراث العربي (1/ 303)، وجهود مخلصة (ص 236)، وله فيه ترجمة. \n4. له ترجمة في جهود مخلصة (ص 237)، وفي بداية الجزء الأول من معارف السنن بقلم الدكتور عبد الرزاق إسكندر (د-ح).",
    "book_id": "686",
    "new_page_number": 41
  },
  {
    "serial_number": "3345917",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 136,
    "volume_number": 1,
    "text": "بشرح الألفاظ الغريبة، ويطيل النفس في المسائل الفقهية، يهتم بذكر المذاهب الأربعة، وينتصر للمذهب الحنفي في جميع المسائل بكل ما أوتي من قوة. وربما تعرض لبعض المسائل الاصطلاحية. أفاد فيه من أبحاث شيخه محمد أنور شاه الكشميري. ولا يتعرض للتعريف برجال الإسناد إلا إذا دعت إليه داعية، ولا للتخريج إلا نادرا. (1) ومما يلاحظ على هذا الشرح أن مؤلفه يتطاول فيه على بعض أهل العلم، منهم: العلامة ابن تيمية (2) ، وابن القيم (3) ، والمباركفوري (4) ، بل يهتم غاية الاهتمام بالرد على المباركفوري، ويبجل أمثال ابن عربي الصوفي (5) ، والكوثري (6) . طبع منه ستة مجلدات، تنتهي عند آخر أبواب الحج. ثانيا: مكانة شرح العراقي بين شروح الترمذي: بالنظر إلى شروح الترمذي يتضح أن أهمها شرح ابن العربي، وشرح ابن سيد الناس، وتكملته للعراقي، وإكماله لأبي زرعة والسخاوي، وشرح ابن رجب، وشرح المباركفوري. أما شرح ابن العربي فشرح مختصر، غابت فيه الصناعة الحديثية إلا نادرا، ولكن حاز بفضل السبق، فكم أقوال له اعتمدها من جاء بعده. وأما شرح ابن رجب فلم يصل إلينا إلا قطعة منه، وهي تنبئ عن توسعه، وغزارة مادته، فإلى الله المشتكى. وأما شرح المباركفوري فمتأخر، غالب اعتماده على من سبقه كابن حجر، والشوكاني، لكنه أوسع الشروح الكاملة لجامع الترمذي، ويمتاز مؤلفه بالتمسك بالسنة. ولم يكمل",
    "foot_note": "1. انظر معارف السنن (1/ 2). \n2. انظر المصدر نفسه (4/ 413). \n3. انظر المصدر نفسه (1/ 387)، و (4/ 412 - 413). \n4. انظر المصدر نفسه (1/ 27، و 28). \n5. المصدر نفسه (2/ 69). \n6. المصدر نفسه (1/ 17)، و (4/ 138).",
    "book_id": "686",
    "new_page_number": 42
  },
  {
    "serial_number": "3345918",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 137,
    "volume_number": 1,
    "text": "ابن سيد الناس شرحه فبنى عليه العراقي شرحه، فهما بمثابة كتاب واحد، وقد سار العراقي على منهجه، وفاقه توسعا وتحريرا. قال الشوكاني عن شرح ابن سيد الناس: \"وهو ممتع في جميع ما تكلم من فن الحديث وغيره … ثم قال: ولما وقفت على الجزء الذي من شرح الترمذي الذي يلي هذا الجزء للزين العراقي بهرني ذلك، ورأيته فوق ما شرحه صاحب الترجمة بدرجات\". (1) وقال عن شرح العراقي أيضا: \"وهو شرح حافل ممتع، فيه فوائد لا توجد في غيره، لا سيما في الكلام على أحاديث الترمذي، وجميع ما يشير إليه في الباب، وفي نقل المذاهب على نمط غريب، وأسلوب عجيب\". (2) ومما يوضح مكانته أن كل من وقف على هذا الكتاب اغترف من بحاره، كابن حجر في فتح الباري، والعيني في عمدة القارئ، والسيوطي في عقود الزبرجد، والمناوي في فيض القدير، والشوكاني في نيل الأوطار (3) . وسيأتي في المبحث التالي بيان منهجه مما ينبئ عن حسن ترتيبه، وغزارة مادته.  المطلب الخامس: منهج المؤلف في شرحه يمكن استخلاص جوانب من منهج الحافظ العراقي في شرحه في النقاط التالية: 1 - يذكر متن الباب من جامع الترمذي كاملا دون أي تغيير قبل الشروع في الشرح، مما جعله كنسخة من نسخ الجامع، يستفاد منه عند وقوع الاختلاف في نسخ الجامع، لاسيما في أحكام الترمذي على الحديث.",
    "foot_note": "1. البدر الطالع (ص 767). \n2. المصدر نفسه (ص 362). \n3. انظر: فتح الباري (2/ 330، و 411، و 3/ 27)، وعمدة القاري (6/ 131، و 175، و 208)، و (10/ 83). وعقود الزبرجد (1/ 149، و 224)، وفيض القدير (1/ 82)، و (2/ 480)، (5/ 228)، و (6/ 51)، ونيل الأوطار (2/ 80، و 148، و 152).",
    "book_id": "686",
    "new_page_number": 43
  },
  {
    "serial_number": "3345919",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 138,
    "volume_number": 1,
    "text": "2 - يعد شرح العراقي من كتب الشروح الموضوعية التي تقسم شرح الحديث إلى فقرات موضوعية، وتتكلم على كل فقرة منها على حدة، فالعراقي يبدأ شرح الباب بقوله: \"الكلام عليه من وجوه\"، ثم يفصل ذلك، وأقل ما وُجد من هذه الوجوه وجه واحد (1) ، وأحيانا يصل إلى أكثر من عشرين وجها (2) . 3 - يجعل الوجه الأول غالبا لتخريج الأحاديث التي أسندها الترمذي، ثم التي أشار إليها. 4 - يجعل الوجه الثاني غالبا لذكر الأحاديث المتعلقة بالباب مما لم يذكره الترمذي إذا وجدها الشارح، فيسرد أولا أسماء الصحابة الذين لهم أحاديث، فيقول: الثاني في الباب مما لم يذكره عن فلان، وفلان … ، ثم يخرجها حديثا حديثا، فيقول: أما حديث فلان فأخرجه فلان من رواية فلان ويذكر متنه. وهكذا. 5 - إذا كان حديث الباب مما أخرجه أصحاب الكتب الستة، أو أحدهم فيخرجه منها، ويعتني باستيعاب طرقه فيها، ويقدم ذكر من هو أتم متابعة للترمذي. وإذا كان حديث الباب ليس عند أحد من أصحاب الكتب الستة يقول: انفرد به المصنف. وغالبا ما يقتصر على هذا ما لم تكن هناك فائدة في السند أو المتن فيخرجه من غيرها. وينبغي أن يعلم أن الشارح إذا خرج حديثا من الكتب الستة فإنه يريد محل الشاهد منه، لا أصله. 6 - إذا كانت الأحاديث التي أشار إليها الترمذي، أو التي استدركها الشارح من الكتب الستة يخرجها منها، وإلا يخرجها غالبا من مسانيد أحمد، وأبي يعلى، والبزار، ومعاجم الطبراني الثلاثة.",
    "foot_note": "1. انظر شرح باب ما جاء في الخروج عند الفزع من أبواب الجهاد. \n2. انظر شرح باب ما جاء في الرهان من أبواب الجهاد، وفيه واحد وعشرون وجها.",
    "book_id": "686",
    "new_page_number": 44
  },
  {
    "serial_number": "3345920",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 139,
    "volume_number": 1,
    "text": "7 - إذا كان الحديث طويلا يكتفي بذكر الشاهد منه. 8 - يحكم على الأحاديث إما مجملا، أو مفصلا. 9 - يعلل أحكام الترمذي على الحديث أحيانا، ويعقد لذلك وجها مستقلا. 10 - يذكر أحيانا اختلاف الرواة في السند، أو في المتن. 11 - ينبه على الاختلاف الواقع بين نسخ الجامع إن لزم الأمر. 12 - إذا كان الراوي الذي أخرج الترمذي حديثه من المقلين يذكر ما له من أحاديث في جامع الترمذي، وفي سائر الكتب الستة، ويعقد لهذا وجها مستقلا. 13 - يتكلم على الرواة جرحا وتعديلا خاصة المتكلم فيهم، وكان المدار عليهم، وقد يجمل، وقد يفصل. 14 - يعتني ببيان المهمل من الرواة، والمكنى، والمبهم، والمتفق والمفترق. 15 - يعتني بتفسير الكلمات الغريبة، وكثيرا ما يذكر مصدره من كتب الغريب واللغة، مثل الصحاح للجوهري، والنهاية لابن الأثير، والمحكم لابن سيدة، ويعقد لذلك وجها مستقلا. 16 - يعتني بالكلام على الأحكام المستنبطة من الحديث، وإن كان فيها خلاف بين أهل العلم يذكره، ويهتم لذكر الأوجه في مذهب الشافعية، ويعتمد في ذلك غالبا على الأم للشافعي، والوسيط للغزالي، والعزيز للرافعي، وروضة الطالبين للنووي، ويعتني بترجيحات الرافعي، والنووي. 17 - يورد أحيانا الاعتراضات المحتملة على الحكم المستنبط من الحديث، ثم يجيب عنه. 18 - يعتني بالجمع بين الأحاديث التي ظاهرها التعارض، ويجعل لذلك وجها مستقلا. 19 - في حالة عدم مناسبة أحاديث الباب للتبويب ينبه على ذلك.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 45
  },
  {
    "serial_number": "3345921",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 140,
    "volume_number": 1,
    "text": "20 - يعتني بإبراز القواعد الحديثية في شرحه. 21 - له تعقبات على من سبقه من العلماء، كالترمذي، وابن حبان، وابن التركماني، والمزي.  المطلب السادس: بعض موارد المؤلف في شرحه اعتمد المؤلف في شرحه هذا على أمهات كتب الحديث وعلومه وكتب التفسير والشروح والتاريخ والتراجم والفقه واللغة وغيرها، والشرح كبير جدا، ولا يزال مخطوطا، فيصعب جدا حصر موارده، ولكن ما لا يترك كله لا يترك جله، فقمت بجرد شرح أبواب الجهاد عن رسول الله صلى الله عليه وسلم، حتى أتعرف على بعض موارده. فمن كتب التفسير وأسباب النزول: أسباب النزول للواحدي، وتفسير ابن جريج، وتفسير ابن جرير الطبري، وتفسير ابن مردويه، وتفسير عبد بن حميد. ومن أمهات كتب الحديث: الكتب الستة، والموطأ، وصحيح ابن خزيمة، وصحيح ابن حبان، وصحيح البرقاني، ومستدرك الحاكم، وسنن الدارقطني، والسنن لأبي بكر بن لال، والسنن الكبرى للبيهقي، ومسند أحمد، ومسند الدارمي، ومسند إسحاق بن راهويه، ومسند البزار، ومسند أبي يعلى الموصلي، ومسند الحارث بن أبي أسامة، ومسند الفردوس للديلمي، والمعاجم الثلاثة للطبراني، ومعرفة السنن والآثار للبيهقي. ومن الأجزاء الحديثية: الأدب المفرد للبخاري، والجهاد لابن أبي عاصم، والخلعيات (فوائد الخلعي)، والدعوات للبيهقي، والدعوات للمستغفري، وفوائد أبي بكر الشافعي (المعروفة بالغيلانيات)، ومعجم الشيوخ لابن مسدي، ومكارم الأخلاق للخرائطي. ومن كتب السيرة والشمائل: دلائل النبوة للبيهقي،، والشمائل للترمذي، والشمائل لابن المقرئ، ومغازي محمد بن إسحاق. ومن كتب شروح الحديث: الاستذكار لابن عبد البر، وإكمال المعلم للقاضي عياض،",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 46
  },
  {
    "serial_number": "3345922",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 141,
    "volume_number": 1,
    "text": "والتمهيد لابن عبد البر، وشرح صحيح البخاري لابن بطال، وشرح صحيح مسلم للنووي، ومعالم السنن للخطابي، والمفهم لأبي العباس القرطبي. ومن كتب التاريخ والتراجم: الاستيعاب لابن عبد البر، والألقاب للشيرازي، والتاريخ الأوسط للبخاري، وتاريخ بغداد للخطيب البغدادي، والتاريخ الكبير للبخاري، وتاريخ مرو للمعداني، وتاريخ نيسابور للحاكم، والتنبيه على أوهام الاستيعاب لابن فتحون، وتهذيب الكمال للمزي، وثقات ابن حبان، والجرح والتعديل لابن أبي حاتم، والحروف في أسماء الصحابة لأبي علي ابن السكن، والذيل على الاستيعاب لابن فتحون، وضعفاء العقيلي، وطبقات ابن سعد، والعبر للذهبي، والكامل لابن عدي، والكمال لعبد الغني المقدسي، والمعارف لابن قتيبة، ومعرفة الصحابة لابن منده، وكنى أبي أحمد الحاكم، والكنى لابن الجارود. ومن كتب الأطراف والعلل والمصطلح: أطراف ابن عساكر، وأطراف المزي (تحفة الأشراف)، والأفراد للدارقطني، والدر النقي (المعروف بالجوهر النقي) لابن التركماني، وعلل الدارقطني، والعلل المنفرد عن الجامع للترمذي، وعلوم الحديث لابن الصلاح، والكفاية للخطيب، والمتفق والمفترق له. ومن كتب الفقه: الأم للشافعي، والخلافيات للبيهقي، وروضة الطالبين للنووي، وشرح المهذب (المجموع) للنووي، والمختصر للمزني، ومنهاج الطالبين للنووي، والمهمات للأسنوي، والعزيز للرافعي، والوسيط للغزالي. ومن كتب اللغة والغريب: الذيل على الغريبين لأبي موسى المديني (المجموع المغيث)، والصحاح للجوهري، والكامل للمبرد، والمحكم لابن سيده، والمشارق للقاضي عياض، والنهاية لابن الأثير. ومن هذه الموارد ما هو في حكم المفقود الآن، كأطراف ابن عساكر، والألقاب للشيرازي، وتاريخ مرو للمعداني، وتاريخ نيسابور للحاكم، وتفسير",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 47
  },
  {
    "serial_number": "3345923",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 142,
    "volume_number": 1,
    "text": "ابن مردويه، وتفسير عبد بن حميد، والتنبيه على أوهام الاستيعاب لابن فتحون، والحروف في أسماء الصحابة لآبي علي بن السكن، والذيل على الاستيعاب لابن فتحون، والسنن لأبي بكر بن لال، وصحيح البرقاني، والدعوات للمستغفري، والشمائل لابن المقرئ، والكنى لابن الجارود، ومعجم الشيوخ لابن مسدي، وقد يكون منها ما هو مخطوط في مكتبات العالم.  المطلب السابع: ذكر النسخ الخطية الموجودة للكتاب للكتاب نسخ متعددة، بعضها بخط المصنف، وبعضها بخط تلاميذه، وبعضها متأخر، وسأذكر ما وجد من نسخه على سبيل الإجمال. 1 - النسخة المحفوظة في مكتبة الإسكوريال بأسبانيا، ورقمها (1464)، ومصورتها في مكتبة الجامعة الإسلامية برقم (1296)، تبدأ من أول تكملة العراقي، وتنتهي في أثناء باب ما جاء في التخشع في الصلاة. 2 - النسخة المحفوظة في المكتبة المحمودية بالمدينة النبوية برقم (512)، وعدد أوراقها (278)، وتبدأ من أول الكتاب إلى آخر أبواب العيدين، وهي بخط الحافظ ابن حجر. 3 - النسخة المحفوظة في المكتبة المحمودية برقم (536)، وعدد أوراقها (395)، وتحتوي على جزء كبير من شرح ابن سيد الناس، ثم على الجزء الأول من تكملة الحافظ العراقي، والتي تبدأ من ورقة (78/ أ) إلى آخر النسخة. 4 - النسخة المحفوظة في المكتبة المحمودية بالمدينة برقم (537/ 1)، وعدد أوراقها (193)، تبدأ من بداية كتاب الصوم، وتنتهي بنهاية كتاب الحج. 5 - النسخة المحفوظة في المكتبة المحمودية برقم (537/ 2)، وعدد أوراقها (196)، وتبدأ من بداية أبواب الرضاع، وتنتهي بخاتمة كتاب الفوائد والأحكام.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 48
  },
  {
    "serial_number": "3345924",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 143,
    "volume_number": 1,
    "text": "6 - النسخة المحفوظة في الخزانة العامة بالرباط، وعدد أوراقها (265)، ومصورتها في مكتبة الجامعة الإسلامية برقم (3010)، وتبدأ من بداية أبواب الجنائز، وتنتهي عند باب ما جاء في كراهية خروج النساء في الزينة من كتاب الرضاع. 7 - النسخة المحفوظة في دار الكتب المصرية برقم (2504)، وعدد أوراقها (256)، وهي بخط الحافظ العراقي، تبدأ من باب كراهية عسب الفحل من كتاب البيوع، وتشتمل على أبواب من كتاب الأحكام، والديات، والحدود، والصيد والذبائح، والأطعمة، والفوائد والأحكام، والأضاحي، وفي ترتيب أوراقها خلل كبير. 8 - النسخة المحفوظة في مكتبة فيض الله آفندي بتركيا برقم (363)، وعدد أوراقها (226)، تبدأ في أثناء شرح باب ما جاء في إمام الرعية من كتاب الأحكام، وتنتهي في أثناء شرح باب كراهية أكل ذي ناب وذي مخلب من كتاب الأطعمة. 9 - النسخة المحفوظة في مكتبة فيض الله آفندي بتركيا برقم (364). توجد منها نسخة مصورة بالميكروفيلم في مكتبة الجامعة الإسلامية تحت رقم (9758/ 3)، وهي تتمة نسخة الحافظ العراقي، وتتكون من مائتين وست وسبعين لوحة، وتشتمل على شرح أبواب من كتب الحج، والسير، وفضائل الجهاد، والجهاد، والأطعمة، والأشربة، والبر والصلة، مع خلط كبير في الأوراق. 10 - النسخة المحفوظة في المكتبة السليمانية بتركيا تحت رقم (506): توجد منها نسخة مصورة بالميكروفيلم في مكتبة الجامعة الإسلامية برقم (1999)، وتتكون من (215) لوحة، وتبدأ من باب ما جاء في الأضحية بكبشين من أبواب الأضاحي، وتنتهي بباب ما جاء فيمن يستشهد وعليه دين من أبواب الجهاد، إلا أنه سقط من وسطه عدة أبواب.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 49
  },
  {
    "serial_number": "3345925",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 144,
    "volume_number": 1,
    "text": "11 - النسخة المحفوظة في المكتبة السليمانية بتركيا برقم (507)، وعدد أوراقها (201)، ومصورتها في مكتبة الجامعة الإسلامية برقم (2156)، وتبدأ من أول تكملة العراقي إلى باب الرجل يحدث بعد التشهد من أبواب الصلاة. 12 - النسخة المحفوظة في المكتبة السليمانية بتركيا برقم (508)، وعدد أوراقها (230). تبدأ من أثناء شرح (باب ما جاء إذا أقبل الليل وأدبر النهار فقد أفطر الصائم)، من كتاب الصوم، وتنتهي في أثناء شرح (باب ما جاء في نزول الأبطح) من كتاب الحج، وفيها بياضات كثيرة في أماكن متعددة. 13 - النسخة المحفوظة في المكتبة السليمانية بتركيا برقم (509)، وعدد أوراقها (224)، وهي بخط العراقي، تبدأ من بداية كتاب الجنائز، وتنتهي بنهاية شرح باب ما جاء لا تنكح المرأة على عمتها ولا على خالتها من كتاب النكاح. 14 - النسخة المحفوظة في المكتبة السليمانية بتركيا برقم (510)، وعدد أوراقها (226)، وهي تبدأ من باب ما جاء في القنوت في الوتر، وتنتهي بشرح باب ما جاء في القائلة يوم الجمعة. وهي بخط الحافظ العراقي. 15 - النسخة المحفوظة في المكتبة السليمانية برقم (511): توجد منه نسخة مصورة بالميكروفيلم في مكتبة الجامعة الإسلامية تحت رقم (9840/ 2)، وهي بخط الحافظ العراقي، كما كتب على صفحة العنوان، وتتكون من مائتين وخمس وأربعين لوحة، ولا تخلو من خروم، وهي كثيرة الضرب، والتصحيح، كما أنها مختلة الترتيب حيث حصل التداخل بين شرح أبواب الجهاد، واللباس، والحج، والأطعمة ..... 16 - النسخة المحفوظة في المكتبة السليمانية بتركيا برقم (512)، وعدد أوراقها (251)، وهي بخط الحافظ العراقي، وتبدأ من باب ما جاء في سجدتي السهو بعد السلام، وتنتهي عند نهاية شرح باب ما جاء ما يقرأ في الوتر.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 50
  },
  {
    "serial_number": "3345926",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 145,
    "volume_number": 1,
    "text": "17 - النسخة المحفوظة في المكتبة السليمانية برقم (513): توجد منها نسخة مصورة بالميكروفيلم في مكتبة الجامعة الإسلامية تحت رقم (9840/ 1)، وتتكون من ثلاث مائة لوحة، وخطها حسن واضح، إلا أن اللوحات الست الأخيرة بخط دقيق، وتختلف عن الأول، وهي تبدأ من باب ما جاء في الثبات عند القتال من أبواب الجهاد، وتنتهي بباب ما جاء في شفقة المسلم من أبواب البر والصلة، وهو آخر ما انتهى إليه الشارح، كما كتب على صفحة العنوان، ولا تخلو من خروم، وجاء في آخر المخطوط ما لفظه: \"رأيته بخط الحافظ ابن حجر على هذا المحل من الأصل، هذا آخر ما وجد بخط شيخنا الحافظ أبي الفضل من شرح الترمذي\". والكتاب تحت الطبع في عمادة البحث العلمي بالجامعة الإسلامية بالمدينة المنورة. يسر الله طبعه.  الخاتمة الحمد لله الذي بنعمته تتم الصالحات، والصلاة والسلام على الرحمة المهداة. أما بعد: ففي ختام هذا البحث أود أن أسجل بعض النتائج والتوصيات التي ظهرت لي خلال البحث: • الحافظ أبو الفضل زين الدين العراقي (725 - 806 هـ) كان من كبار المحدثين في القرن الثامن الهجري، وقد تتلمذ على كبار علماء عصره من غير تفريق بين الشافعي والحنفي والمالكي والحنبلي، وكذلك تتلمذ عليه طلاب العلم من غير تفريق، لأنهم كان همهم أن يطلبوا العلم من منهله، فعلى أهل العلم في زماننا أن ينتهجوا هذا المنهج؛ فإنه منهج ناجح، ودواء ناجع. وقد لوحظ في الآونة الأخيرة التعصب المقيت في بعض البلدان، فإلى الله المشتكى. • قد تكون الكلمة الواحدة من الأستاذ سببا للنجاح الباهر في حياة طالب العلم إذا صدرت عن حسن نية، فقد أثرت كلمة العز ابن جماعة في حياة العراقي العلمية تأثيرا ظاهرا، وغيرت له مسار الحياة العلمية حتى صار من كبار المحدثين",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 51
  },
  {
    "serial_number": "3345927",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 146,
    "volume_number": 1,
    "text": "في القرن الثامن، وربى جيلا مباركا للمحدثين، على رأسهم الحافظ ابن حجر، وأبو زرعة العراقي، ونور الدين الهيثمي. • الحافظ العراقي واسع الاطلاع، كما أنه يحسن النقد -عند ما يقتضي الأمر- لمن سبقه من العلماء مع أدب جم وتواضع تام. وتظهر شخصيته العلمية في تعقباته وانتقاداته. • تكملة شرح الترمذي أحسن الشروح على جامع الترمذي إلا أنه لم يكمل، لكن جل من جاء بعده من الشراح الكبار اغترف منه. • بدأ العراقي شرحه من حيث توقف ابن سيد الناس في شرحه المسمى بـ: \"النفح الشذي\". فشرع في شرحه من \"باب ما جاء أن الأرض كلها مسجد إلا المقبرة والحمام\"، ولكنه وصل في شرحه إلى \"باب شفقة المسلم على المسلم\" من أبواب البر والصلة، وبقي نصف الكتاب لم يتناوله بالشرح، واخترمته المنية قبل إكماله، فأكمله ابنه أبو زرعة، وأكمله أيضا السخاوي، حسبما ذكرت كتب التراجم، لكن لم يتيسر الوقوف على إكمالهما، فعلى الباحثين البحث عنهما في مكتبات العالم، أو على المتخصصين المتقنين إكماله وفق منهج العراقي في شرحه؛ فإن مسلك إكمال مؤلفات السابقين مسلك معمول به عند أهل العلم من قديم الزمان، وشرح العراقي أنموذج رائع لهذا المسلك. • الدراسات والبحوث التي كتبت حول العراقي لم تفد من هذا الشرح في إبراز شخصية العراقي العلمية، مع أنه جهد كبير استغرق أعواما من حياته، فيستحسن إبراز شخصيته العلمية من خلال هذا الكتاب في بحوث ورسائل علمية. وأسأل الله عز وجل أن يوفقنا لما يحبه ويرضاه.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 52
  },
  {
    "serial_number": "3345928",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 147,
    "volume_number": 1,
    "text": "المصادر والمراجع 1. إتحاف السادة المتقين بشرح إحياء علوم الدين: للزبيدي، محمد بن محمد الحسيني. بيروت: مؤسسة التاريخ العربي، 1414 هـ. 2. الأحاديث الحسان الغرائب لعبد الباري بن حماد الأنصاري، رسالة دكتوراه في كلية الحديث الشريف بالجامعة الإسلامية بالمدينة المنورة. 3. الإعلام بمن في تاريخ الهند من الأعلام المسمى بـ\"نزهة الخواطر وبهجة المسامع والنواظر\": عبد الحي بن فخر الدين الحسيني. ط 1، بيروت: دار ابن حزم، 1420 هـ- 1999 م. 4. الأعلام: لخير الدين الزركلي. ط 5، بيروت: دار العلم للملايين، 1980 م. 5. الإمام الترمذي، ومنهجه في كتابه الجامع: لعداب محمود الحمش. ط 1، عمان: دار الفتح للدراسات والنشر -الأردن، 1423 هـ. 6. إنباء الغمر بأبناء العمر: لابن حجر. تحقيق: حسن حبشي، مصر: وزارة الأوقاف، 1418 هـ. 7. البدر الطالع لمحاسن من بعد القرن السابع: لمحمد بن علي الشوكاني (1250 هـ). تحقيق: حسين بن عبد الله العمري، ط 1، بيروت: دار الفكر المعاصر، 1419 هـ. 8. تاريخ ابن قاضي شهبة. تحقيق: عدنان درويش، دمشق: المعهد العلمي الفرنسي للدراسات العربية، 1997 م. 9. تاريخ التراث العربي: لفؤاد سزكين. تعريب: محمود فهمي حجازي، الرياض: جامعة الإمام محمد بن سعود الإسلامية، 1411 هـ. 10. التاريخ: لأبي العباس أحمد بن حجي الدمشقي (816 هـ). تعليق: أبي يحي عبد الله الكندري، ط 1، بيروت: دار ابن حزم، 1424 هـ.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 53
  },
  {
    "serial_number": "3345929",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 148,
    "volume_number": 1,
    "text": "11. تحفة الأحوذي بشرح جامع الترمذي: لأبي العلاء محمد عبد الرحمن بن عبد الرحيم المباركفوري (ت 1353 هـ). بيروت: دار الكتاب العربي، مصورة عن طبعة هندية. 12. تذكرة الحفاظ: للذهبي. تصحيح: عبد الرحمن بن يحيى المعلمي. بيروت: دار إحياء التراث العربي، مصورة عن طبعة دائرة المعارف، الهند. 13. تعريف أهل التقديس بمراتب الموصوفين بالتدليس: لابن حجر العسقلاني. تحقيق: الدكتور أحمد بن علي سير المباركي. ط 3، الرياض 1422 هـ. 14. التقييد والإيضاح للعراقي، (مقدمة التحقيق للدكتور أسامة الخياط). ط 4، بيروت، دار البشائر الإسلامية، 1435 هـ. 15. التقييد والإيضاح: لزين الدين أبي الفضل عبد الرحيم بن الحسين العراقي (ت 806 هـ). تحقيق: محمد راغب الطباخ، ط 2، بيروت: دار الحديث، 1405 هـ. 16. تكملة شرح الترمذي: للحافظ زين العراقي، (مخطوط)، نسخة السليمانية (رقم 511، و 512، و 513)، ونسخة فيض الله أفندي (رقم 364). 17. التنبيه والإيقاظ لما في ذيول تذكرة الحفاظ: لأحمد رافع الحسيني القاسمي. بيروت: دار إحياء التراث العربي. 18. جهود مخلصة في خدمة السنة المطهرة: للدكتور عبد الرحمن بن عبد الجبار الفريوائي. ط 2، الهند: الجامعة السلفية-بنارس، 1406 هـ. 19. حاشية أبي الطيب السندي على جامع الترمذي. كانبور: الهند، 1299 هـ. 20. الحافظ السخاوي وجهوده في الحديث وعلومه: للدكتور بدر بن محمد العماش. ط 1، السعودية: مكتبة الرشد، 1421 هـ. 21. الحافظ العراقي وأثره في السنة: للدكتور أحمد معبد عبد الكريم. ط 1، الرياض: أضواء السلف، 1425 هـ. 22. حسن المحاضرة في تاريخ مصر والقاهرة: للسيوطي. تحقيق: محمد أبي الفضل إبراهيم، ط 1، مصر: دار إحياء الكتب العربية، 1387 هـ.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 54
  },
  {
    "serial_number": "3345930",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 149,
    "volume_number": 1,
    "text": "23. درة الحجال في أسماء الرجال: لأبي العباس أحمد بن محمد المكناسي، الشهير بابن القاضي (ت 1025 هـ). تحقيق: محمد الأحمدي أبي النور، القاهرة: دار التراث، وتونس: المكتبة العتيقة، د. ت. 24. الدرر الكامنة في أعيان المائة الثامنة: لابن حجر. بيروت: دار الجيل. 25. الدليل الشافي على المنهل الصافي: لأبي المحاسن يوسف بن تغري بردي (ت 874 هـ). تحقيق: فهيم محمد شلتوت، مكة المكرمة: جامعة أم القرى. 26. ذيل التقييد لمعرفة رواة السنن والمسانيد: للتقي الفاسي محمد بن أحمد الحسيني (ت 832 هـ). تحقيق: محمد صالح بن عبد العزيز المراد، ط 1، مكة المكرمة: جامعة أم القرى، 1411 هـ. 27. ذيل الدرر الكامنة: لابن حجر العسقلاني. تحقيق: الدكتور عدنان درويش. القاهرة، معهد المخطوطات العربية، 1412 هـ. 28. ذيل تذكرة الحفاظ للذهبي: لأبي المحاسن محمد بن علي الحسيني الدمشقي (ت 765 هـ). بيروت، دار إحياء التراث العربي. 29. ذيل طبقات الحفاظ للذهبي: للسيوطي. بيروت: دار إحياء التراث العربي. 30. الذيل على العبر في خبر من عبر: لأبي زرعة أحمد بن عبد الرحيم العراقي (ت 826 هـ). تحقيق: صالح مهدي عباس، ط 1، بيروت: مؤسسة الرسالة، 1409 هـ. 31. ذيل ميزان الاعتدال: لأبي الفضل زين الدين العراقي، تحقيق: الدكتور عبد القيوم عبد رب النبي. ط 1، مكة المكرمة، جامعة أم القرى 1406 هـ. 32. الرسالة المستطرفة لبيان مشهور كتب السنة المشرفة: لمحمد بن جعفر الكتاني (ت ى 1345 هـ). اعتناء: محمد المنتصر بن محمد الزمزمي بن محمد بن جعفر الكتاني. ط 5، بيروت: دار البشائر الإسلامية، 1425 هـ. 33. رفع الإصر عن قضاة مصر: لابن حجر. تحقيق: الدكتور علي محمد عمر. ط 1، القاهرة: مكتبة",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 55
  },
  {
    "serial_number": "3345931",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 150,
    "volume_number": 1,
    "text": "الخانجي، 1418 هـ. 34. شذرات الذهب في أخبار من ذهب: لشهاب الدين أبي الفلاح عبد الحق بن أحمد بن محمد الدمشقي، الشهير بابن العماد الحنبلي (ت 1089 هـ). تحقيق: عبد القادر الأرناؤوط، ومحمود الأرناؤوط، ط 1، دمشق وبيروت: دار ابن كثير، 1413 هـ. 35. شرح علل الترمذي: لابن رجب الحنبلي. تحقيق: همام عبد الرحيم سعيد. ط 2، الرياض: مكتبة الرشد، 1421 هـ. 36. الضوء اللامع لأهل القرن التاسع: للسخاوي، بيروت: دار الجيل. 37. طبقات الشافعية الكبرى: للسبكي تاج الدين أبي نصر عبد الوهاب بن علي (ت 771 هـ) تحقيق: عبد الفتاح محمد الحلو، ومحمود محمد الطناحي. القاهرة: دار إحياء الكتب العربية. 38. طبقات الشافعية: لأبي بكر بن أحمد بن محمد، المعروف بابن قاضي شهبة (ت 851 هـ)، تحقيق: الدكتور الحافظ عبد العليم خان، ط 1، بيروت: دار عالم الكتب، 1407 هـ. 39. طبقات الشافعية: للأسنوي جمال الدين عبد الرحيم بن الحسن (ت 772 هـ). تحقيق: عبد الله الجبوري. الرياض: دار العلوم للطباعة والنشر، 1400 هـ. 40. طرح التثريب في شرح التقريب: لزين الدين أبي الفضل عبد الرحيم بن الحسين العراقي (ت 806 هـ)، ولولده أبي زرعة ولي الدين أحمد (826 هـ). بيروت: دار إحياء التراث العربي، 1413 هـ. 41. عارضة الأحوذي بشرح صحيح الترمذي: لابن العربي (543 هـ)، بيروت: دار إحياء التراث العربي. 42. العجالة السنية على ألفية العراقي في السنة النبوية: لمحمد عبد الرؤوف المناوي. 43. العقد الثمين في تاريخ البلد الأمين: للتقي الفاسي. تحقيق: فؤاد السيد، د. ط، القاهرة: مطبعة السنة المحمدية.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 56
  },
  {
    "serial_number": "3345932",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 151,
    "volume_number": 1,
    "text": "44. عقود الزبرجد في إعراب الحديث، لجلال الدين السيوطي (911 هـ)، بيروت: دار الجيل، 1414 هـ. 45. عمدة القارئ شرح صحيح البخاري: لبدر الدين أبي محمد محمود بن أحمد العيني (ت 855 هـ). بيروت: دار الفكر، 1399 هـ. 46. غاية النهاية في طبقات القراء: لشمس الدين محمد بن محمد بن الجزري (ت 833 هـ). اعتناء: ج. برجشتراسر. القاهرة: مكتبة المتنبي. 47. فتح الباري بشرح صحيح البخاري: لابن حجر العسقلاني، مصر، المكتبة السلفية. 48. فتح الباري شرح صحيح البخاري: لابن رجب الحنبلي. تحقيق: طارق بن عوض الله، ط 1، الدمام: دار ابن الجوزي، 1417 هـ. 49. فتح المغيث بشرح ألفية الحديث: لأبي عبد الله محمد بن عبد الرحمن السخاوي (ت 902 هـ). تحقيق: علي حسين علي، ط 1، بنارس: الجامعة السلفية، 1409 هـ. 50. فتح المغيث للسخاوي، (مقدمة التحقيق للدكتور عبد الكريم الخضير ومحمد الفهيد). ط 1، الرياض، دار المنهاج 1426 هـ. 51. فهرس الفهارس والأثبات، ومعجم المعاجم والمشيخات والمسلسلات: لعبد الحي بن عبد الكبير الكتاني. تحقيق: إحسان عباس، ط 2، بيروت: دار الغرب الإسلامي، 1402 هـ. 52. قوت المغتذي: لجلال الدين السيوطي، كانبور: الهند، 1299 هـ. 53. كشف الظنون عن أسامي الكتب والفنون. لمصطفى بن عبد الله القسطنطني، المعروف بحاجي خليفة (ت 1067 هـ). دار الفكر 1402 هـ. 54. اللباب في تهذيب الأنساب: لعز الدين أبي الحسن علي بن محمد المعروف بابن الأثير الجزري (ت 630 هـ)، بيروت: دار صادر، 1400 هـ. 55. لحظ الألحاظ بذيل طبقات الحفاظ: لتقي الدين أبي الفضل محمد بن محمد بن محمد",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 57
  },
  {
    "serial_number": "3345933",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 152,
    "volume_number": 1,
    "text": "بن فهد الهاشمي، المكي (ت 871 هـ)، بيروت: دار إحياء التراث العربي. 56. مجمع الزوائد، ومنبع الفوائد: لأبي بكر الهيثمي. ط 2، بيروت: دار الكتاب العربي، 1402 هـ. 57. المجمع المؤسس للمعجم المفهرس: لابن حجر. تحقيق: يوسف عبد الرحمن المرعشلي، ط 1، بيروت: دار المعرفة، 1415 هـ. 58. المستدرك على معجم المؤلفين: لعمر رضا كحالة. ط 1، بيروت: مؤسسة الرسالة، 1406 هـ. 59. معارف السنن شرح جامع الترمذي: لمحمد يوسف بن محمد زكريا البنوري، إيج، إيم سعيد كمبني، كرانشي: أدب منزل، 1413 هـ. 60. معجم البلدان: لياقوت الحموي. بيروت: دار صادر، 1397 هـ. 61. معجم الشيوخ: لعمر بن فهد المكي (ت 885 هـ). تحقيق: محمد الزاهي، الرياض: دار اليمامة للبحث والترجمة والنشر. 62. معجم المؤلفين: لعمر رضا كحالة، ط 1، بيروت، مؤسسة الرسالة 1414 هـ. 63. المقاصد الحسنة في بيان كثير من الأحاديث المشتهرة على الألسنة: للسخاوي. تعليق: عبد الرحمن محمد الصديق، ط 1، بيروت: دار الكتب العلمية، 1399 هـ. 64. منهج الحافظ زين الدين العراقي في كتابه \"طرح التثريب\" لمحمد يحيى بلال منيار، رسالة الماجستير في جامعة الإمام محمد بن سعود الإسلامية بالرياض. 65. المنهل الصافي، والمستوفي بعد الوافي: لابن تغري بردي. تحقيق: الدكتور محمد أمين، مصر: الهيئة المصرية العامة للكتاب، 1984 م. 66. المواعظ والاعتبار بذكر الخطط والآثار، المعروف بالخطط المقريزية: لأبي العباس أحمد بن علي المقريزي (ت 845 هـ)، بيروت: دار صادر. 67. النجوم الزاهرة في ملوك مصر والقاهرة: لأبي المحاسن يوسف بن تغري بردي (ت 874 هـ). تعليق: محمد حسين شمس الدين، ط 1، بيروت: دار الكتب العلمية، 1413 هـ.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 58
  },
  {
    "serial_number": "3345934",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 153,
    "volume_number": 1,
    "text": "68. نظرات في الحديث وفي الصحاح الستة ونبذة عن تاريخ تدوين الحديث: لأبي الحسن الندوي، ط 1، بيروت ودمشق، دار ابن كثير، 1420 هـ. 69. النفح الشذي في شرح جامع الترمذي: لأبي الفتح محمد بن محمد بن محمد بن سيد الناس اليعمري (ت 734 هـ)، تحقيق: الدكتور أحمد معبد عبد الكريم، دار العاصمة، الطبعة الأولى 1409 هـ. 70. النكت على كتاب ابن الصلاح: لابن حجر العسقلاني. تحقيق: د/ ربيع بن هادي المدخلي، ط 4، الرياض: دار الراية للنشر والتوزيع، 1417 هـ. 71. نيل الأوطار شرح منتقى الأخبار: لمحمد بن علي الشوكاني (ت 1250 هـ). تحقيق: عصام الدين الصبابطي. ط 4، القاهرة: دار الحديث، 1417 هـ. 72. هدية العارفين، أسماء المؤلفين، وآثار المصنفين من كشف الظنون: لإسماعيل باشا البغدادي، بيروت: دار الفكر، 1402 هـ. 73. وفيات الأعيان، وأنباء أبناء الزمان: لأبي العباس شمس الدين أحمد بن محمد بن أبي بكر بن خلكان (ت 681 هـ). تحقيق: إحسان عباس، بيروت: دار صادر. 74. الوفيات: لأبي المعالي محمد بن رافع السلامي (ت 774 هـ)، تحقيق: صالح مهدي عباس، ط 11، بيروت: مؤسسة الرسالة، 1402 هـ.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 59
  }
]