[
  {
    "text": "Adhkar of Prayers and What Comes Before and After Them\nAuthor: أبو الحمزة أحمد بن محمد بن حسين بن علي الحجاجي\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 1
  },
  {
    "text": "sn: 5650\nbook_title: أذكار الصلوات وما قبلها وما بعدها\nbook_link: https://shamela.ws/book/1033\nbook_id: 1033\nauthor_name: أبو الحمزة أحمد بن محمد بن حسين بن علي الحجاجي\nauthor_year: Null\nnickname: أبو الحمزة\nauthor_link: https://shamela.ws/author/1344\nauthor_ID: 1344\neditor: Null\npublisher: بدون\nedition: الثانية، 1442 هـ - 2022 م\npages: 77\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الرقائق والآداب والأذكار\ncategory_id: 23",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 2
  },
  {
    "serial_number": "4931747",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Heart Softeners, Etiquette, and Adhkar\nBook: Adhkar of Prayers and What Comes Before and After Them\nAuthor: Abu Al-Hamza Ahmed bin Muhammad bin Hussein bin Ali Al-Hajjaji\n\n[Repetitive metadata omitted for brevity as it repeats the above information regarding Author, Publisher, Edition, and Date].",
    "foot_note": "None",
    "book_id": "1033",
    "new_page_number": 3
  },
  {
    "serial_number": "4931748",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "Introduction\nPraise be to Allah, Lord of the worlds, and peace and blessings be upon the one whom Allah sent as a mercy to the worlds, Muhammad, the Truthful and Trustworthy, and upon his family, his companions, the followers, and those who follow their path until the Day of Judgment.\nAs for what follows:\nThe heart of a Muslim is constantly attached to Allah Almighty in all his sayings, actions, movements, and times of rest. This attachment is coupled with abundant, continuous remembrance (Dhikr), through which this heart attains tranquility and distance from heedlessness and the death of hearts that accompanies it. There is no doubt that every day in the life of a Muslim contains various types of acts of worship and obedience performed in daily life. Among the greatest of those acts of worship that are repeated for the Muslim is the Prayer (Salah), which is the pillar of this great religion and its upright support. Due to its high status and great honor, this Prayer has many Adhkar (remembrances) and supplications: some are before it, some are within it, and some are after it.",
    "foot_note": "None",
    "book_id": "1033",
    "new_page_number": 4
  },
  {
    "serial_number": "4931749",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "The more the believer is keen on following and emulating the Prophet (peace and blessings of Allah be upon him) in his prayer, the greater the hope for its acceptance by Allah compared to others, and the greater the reward and recompense attained from the Lord, Glory be to Him. For this reason, and as a benefit and reminder for myself and my Muslim brothers, I have collected what Allah has facilitated for me to collect of the Adhkar reported regarding the prayers, and what is before and after them. I named it \"Adhkar of Prayers and What Comes Before and After Them,\" abbreviating and limiting it to what has been authenticated or classified as Hasan (good) by the scholars, so that it may be easy and accessible for the noble reader. If I have done well, it is from Allah Almighty alone, and if I have erred, it is from myself and Satan, and Allah and His Messenger are innocent of that. I ask Allah to benefit all Muslims with this work, to bring about much good through it, and to make it purely for His Noble Face; indeed, He is the Guardian of that and Capable of it. Praise be to Allah, Lord of the Worlds.\nWritten by: Abu Al-Hamza Ahmed bin Muhammad bin Hussein bin Ali Al-Hajjaji\n20 Dhu al-Qi'dah 1441 AH",
    "foot_note": "None",
    "book_id": "1033",
    "new_page_number": 5
  },
  {
    "serial_number": "4931750",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "Topic Titles\nTopic One: Adhkar reported before the Prayer. This includes Adhkar from the moment of waking from sleep until the completion of the Adhan.\nTopic Two: Adhkar reported within the Five Daily Prayers. This includes Adhkar reported from the opening Takbir (Takbirat al-Ihram) until the Tasleem.\nTopic Three: Adhkar reported after the Five Daily Prayers. This includes Adhkar reported from after the Tasleem until putting away one's clothes at home.\nTopic Four: Adhkar reported in prayers other than the Five Daily Prayers. This includes Adhkar of the Night Prayer, Funeral Prayer, Eid Prayer, Istikhara Prayer, Rain Prayer (Istisqa), and Eclipse Prayer.",
    "foot_note": "None",
    "book_id": "1033",
    "new_page_number": 6
  },
  {
    "serial_number": "4931751",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "• Topic One: Adhkar Reported Before the Prayer\nThis includes Adhkar from the moment of waking from sleep until the completion of the Adhan.\n\nAdhkar of Waking from Sleep:\nFirst: \"Praise be to Allah Who gave us life after He caused us to die, and unto Him is the resurrection.\" (1)\nSecond: \"Praise be to Allah Who healed me in my body, returned my soul to me, and permitted me to remember Him.\" (2)\n\nDhikr upon Entering the Toilet:\n\"In the name of Allah\" (3), \"O Allah, I seek refuge with You from male and female devils (Al-Khubuth wa Al-Khaba'ith).\" (4)",
    "foot_note": "1. Narrated by Al-Bukhari via Hudhayfah, number (6324).\n2. Narrated by At-Tirmidhi via Abu Hurairah (5/473) number (3401). Al-Albani said: A (Hasan) Hadith, Sahih Al-Jami' As-Saghir (1/184) number (716).\n3. Narrated by At-Tirmidhi via Ali bin Abi Talib (2/504) number (606). Al-Albani said: A (Sahih) Hadith, Sahih Al-Jami' As-Saghir (1/675) number (3611), Al-Mishkat (358), Al-Irwa (50). The wording of the Hadith is: \"The screen between the eyes of the Jinn and the private parts of the sons of Adam when one of them enters the privy is to say: Bismillah.\"\n4. Agreed upon: Al-Bukhari via Anas bin Malik (8/71) number (6322), Muslim (1/283) number (375).",
    "book_id": "1033",
    "new_page_number": 7
  },
  {
    "serial_number": "4931752",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "Dhikr after Exiting the Toilet (1):\n\"I ask Your forgiveness (Ghufranaka).\" (2)\n\nDhikr at the Beginning of Wudu (Ablution):\n\"In the name of Allah (Bismillah).\" (3)",
    "foot_note": "1. (Al-Khala'): The privy, the toilet, and the lavatory are all places for relieving oneself. (Al-Khubuth wa Al-Khaba'ith): Al-Khubuth is the plural of wicked (male), and Al-Khaba'ith is the plural of wicked (female), meaning male and female devils. [Explanation by Muhammad Fuad Abdul-Baqi] on Muslim.\n2. Narrated by Abu Dawood via Aisha (1/8) number (30), Ibn Hibban (4/291) number (1444). Al-Albani said: A (Hasan) Hadith, Sahih Al-Jami' As-Saghir number (4707), Al-Mishkat number (359), Sahih Abu Dawood number (22), Al-Irwa number (52).\n3. Narrated by At-Tirmidhi (1/38) number (25), Ibn Majah via Abu Sa'id (1/139) number (397). Al-Albani said: A (Sahih) Hadith, Al-Jami' As-Saghir (2/1256) number (7573), Al-Mishkat number (404).",
    "book_id": "1033",
    "new_page_number": 8
  },
  {
    "serial_number": "4931753",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "Dhikr after Completing Wudu:\n\"I bear witness that there is no god but Allah alone, having no partner, and I bear witness that Muhammad is His servant and messenger. [O Allah, make me of the repentant, and make me of the purified].\"\nThe Messenger of Allah (peace and blessings of Allah be upon him) said regarding the virtue of this Dhikr that whoever says it: \"The eight gates of Paradise will be opened for him, to enter from whichever he wishes.\" (1)",
    "foot_note": "1. Narrated by Muslim via Uqbah bin Amir Al-Juhani (1/210) number (234), At-Tirmidhi via Umar bin Al-Khattab (1/78) number (55). The portion in brackets is from At-Tirmidhi. Al-Albani said: A (Sahih) Hadith, Al-Jami' As-Saghir (2/1061) number (6167), Sahih At-Targhib (219), Al-Irwa number (96). Some scholars stated that the addition (O Allah, make me of the repentant and make me of the purified) is Shadh (anomalous): Ja'far bin Muhammad bin Imran was unique in reporting it.",
    "book_id": "1033",
    "new_page_number": 9
  },
  {
    "serial_number": "4931754",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "Dhikr upon Dressing:\nFirst: \"Praise be to Allah Who clothed me with this garment and provided it to me without any power or might from me.\" The Messenger of Allah (peace and blessings of Allah be upon him) said to the one who says this Dhikr: \"His past sins will be forgiven.\" (1)\nSecond: \"O Allah, You have clothed me with this, so to You be praise. I ask You for its good and the good for which it was made, and I seek refuge with You from its evil and the evil for which it was made.\" (2)\n\nDhikr upon Leaving the House:\n\"In the name of Allah, I trust in Allah, there is no might nor power except with Allah.\" The Messenger of Allah (peace and blessings of Allah be upon him) said regarding one who says this Dhikr: \"It will be said to him: You have been guided, sufficed, and protected, and Satan will step away from him.\" (3) If he wishes to add to that:",
    "foot_note": "1. Narrated by Abu Dawood via Anas (4/42) number (4023), Al-Hakim (4/213) number (7409). Al-Albani said: A (Hasan) Hadith, Al-Jami' As-Saghir (2/1050) number (6086) via Mu'adh bin Anas: Al-Kalim At-Tayyib (187), Al-Irwa (1989).\n2. Narrated by Ibn Hibban via Abu Sa'id Al-Khudri (12/241) number (5421), Ibn As-Sunni (p. 239). Al-Albani said: (Hasan) At-Ta'liqat Al-Hisan 'ala Sahih Ibn Hibban (8/64) number (5397).\n3. Narrated by At-Tirmidhi via Anas bin Malik (5/490) number (3426). Al-Albani said: (Sahih) Mishkat Al-Masabih (2/754) number (2442), Sahih Al-Jami' As-Saghir (2/859) number (4708) and number (4709).",
    "book_id": "1033",
    "new_page_number": 10
  },
  {
    "serial_number": "4931755",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "He says: \"O Allah, I seek refuge with You lest I stray or be led astray, or slip or be made to slip, or wrong or be wronged, or act ignorantly or have ignorance acted against me.\" (1)\n\nDhikr upon Going to the Mosque:\n\"O Allah, place light in my heart, and light in my tongue, and place light in my hearing, and place light in my sight, and place light behind me, and light in front of me, and place light above me, and light beneath me. O Allah, grant me light.\" (2)",
    "foot_note": "1. Narrated by Abu Dawood via Umm Salamah (4/325) number (5094). Al-Albani said: (Sahih) Sahih Al-Jami' As-Saghir wa Ziyadatuhu (2/859) number (4709).\n2. Narrated by Muslim via Abdullah bin Abbas (1/530) number (763).",
    "book_id": "1033",
    "new_page_number": 11
  },
  {
    "serial_number": "4931756",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "Dhikr upon Seeing the Crescent Moon:\n\"O Allah, bring it upon us with security, faith, safety, and Islam. My Lord and your Lord is Allah.\" (1)\n\nDhikr upon Entering the Mosque:\nFirst: \"O Allah, open for me the doors of Your mercy.\" (2). Outside of the two Sahihs, it is reported with the wording: \"[In the name of Allah], and peace be upon the Messenger of Allah, [O Allah, forgive me my sins], and open for me the doors of Your mercy.\" (3)\nSecond: \"In the name of Allah, O Allah, send peace and blessings upon Muhammad.\" (4)",
    "foot_note": "1. Narrated by At-Tirmidhi via Talha bin Ubaidullah (5/504) number (3451), Ahmad (3/17) number (1397). Al-Albani said: A (Sahih) Hadith, Sahih Al-Jami' As-Saghir (2/861) number (4726), As-Sahihah number (1816).\n2. Narrated by Muslim via Abu Humaid, or via Abu Usaid (1/494) number (713).\n3. Narrated by Ibn Majah via Abu Hurairah and via Fatimah (1/253) number (773), Ahmad via Fatimah daughter of the Messenger of Allah (peace be upon him) (44/15) number (26417). The investigator of Musnad Imam Ahmad said: (Sahih li-ghayrihi / Authentic due to corroborating evidence), without the phrase: \"O Allah, forgive me my sins\" which is (Hasan). See Al-Albani's comments: Al-Thamar Al-Mustatab (2/608).\n4. Narrated by Ibn As-Sunni in 'Amal Al-Yawm wa Al-Laylah, via Anas bin Malik (p. 80) number (88). Al-Albani said: (Hasan) Al-Kalim At-Tayyib (p. 91) number (64), Al-Thamar Al-Mustatab (2/604).",
    "book_id": "1033",
    "new_page_number": 12
  },
  {
    "serial_number": "4931757",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "Third: \"I seek refuge in Allah the Great, and in His Noble Face, and His Pre-eternal Authority, from the accursed Satan.\" The Prophet (peace and blessings of Allah be upon him) said regarding the virtue of this Dhikr: \"If he says that, Satan says: He is protected from me for the rest of the day.\" (1)\n\nDhikr upon Hearing the Adhan:\nHe says: \"Like what the Muadhin says, except at (Hayya 'ala as-salah * Hayya 'ala al-falah), he says: 'There is no might nor power except with Allah.' The Prophet (peace and blessings of Allah be upon him) said: Whoever says that from his heart enters Paradise.\" (2)",
    "foot_note": "1. Narrated by Abu Dawood via Abdullah bin Amr (1/127) number (466). Al-Albani said: (Sahih) Sahih Abu Dawood (2/364) number (485), Sahih Al-Jami' As-Saghir (2/860) number (4715), and the Hadith is in As-Sahih Al-Musnad by the scholar Muqbil bin Hadi Al-Wadi'i number (805).\n2. Narrated by Muslim via Umar bin Al-Khattab (1/288) number (385).",
    "book_id": "1033",
    "new_page_number": 13
  },
  {
    "serial_number": "4931758",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "Dhikr upon the Muadhin's Testimony:\nWhen the Muadhin says: \"I bear witness that there is no god but Allah * I bear witness that Muhammad is the Messenger of Allah,\" the listener says: \"And I bear witness, and I bear witness.\" (1)\n\nDhikr after the Two Testimonies following the Muadhin's Testimony:\n\"I bear witness that there is no god but Allah alone, having no partner, and that Muhammad is His servant and messenger. I am pleased with Allah as a Lord, with Muhammad as a Messenger, and with Islam as a religion.\" (2). The Messenger of Allah (peace and blessings of Allah be upon him) said: Whoever says this supplication, \"his sin will be forgiven.\"\n\nDhikr immediately after completing the Adhan:\nHe sends blessings upon the Prophet (peace and blessings of Allah be upon him) by saying: \"O Allah, send prayers upon Muhammad and upon the family of Muhammad, as You sent prayers upon Ibrahim and upon the family of Ibrahim; You are indeed Worthy of Praise, Full of Glory. O Allah, send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon Ibrahim and upon the family of Ibrahim,",
    "foot_note": "1. Narrated by Muslim (1/290) number (386), Abu Dawood via Aisha (1/145) number (526).\n2. Narrated by Muslim via Sa'd bin Abi Waqqas (1/290) number (386).",
    "book_id": "1033",
    "new_page_number": 14
  },
  {
    "serial_number": "4931759",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "You are indeed Worthy of Praise, Full of Glory.\" (1). Or he may mention any of the forms of prayer upon the Prophet (peace and blessings of Allah be upon him) which we will mention under the Tashahhud section.\n\nDhikr after Praying upon the Prophet (peace and blessings of Allah be upon him):\n\"O Allah, Lord of this perfect call and the established prayer, grant Muhammad the Wasila (a station in Paradise) and the Virtue, and resurrect him to the Praiseworthy Station which You have promised him.\" Whoever says this supplication, the intercession of the Messenger of Allah (peace and blessings of Allah be upon him) becomes due to him on the Day of Resurrection. (2)\n\nBenefit: After finishing the reported Adhkar following the Adhan, it is desirable for a person to supplicate for whatever he wishes of the good of this world and the Hereafter, for the Messenger of Allah (peace and blessings of Allah be upon him) said: \"Supplication is not rejected between the Adhan and the Iqamah.\" (3)",
    "foot_note": "1. Agreed upon: Narrated by Al-Bukhari via Ka'b bin Ujrah (4/146) number (3370), Muslim (1/305) number (406).\n2. Narrated by Al-Bukhari via Jabir bin Abdullah (1/126) number (614).\n3. Narrated by At-Tirmidhi via Anas bin Malik (1/416) number (212). Al-Albani said: A (Sahih) Hadith, Sahih Al-Jami' As-Saghir (1/641) number (3405).",
    "book_id": "1033",
    "new_page_number": 15
  },
  {
    "serial_number": "4931760",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "• Topic Two: Adhkar Reported Within the Five Daily Prayers\nThis includes Adhkar reported from the opening Takbir (Takbirat al-Ihram) until the Tasleem.\n\nDhikr after Facing the Qiblah and Commencing the Prayer:\n\"Allah is the Greatest (Allahu Akbar).\" (1)\n\nAdhkar Reported after the Opening Takbir (The Opening Supplications - Istiftah):\nFirst Dhikr: \"O Allah, distance me from my sins as You have distanced the East from the West. O Allah, cleanse me from my sins as a white garment is cleansed from dirt. O Allah, wash me from my sins with snow, water, and hail.\" (2). Al-Albani said: \"This is said in the obligatory prayers, and it is the most authentic of the opening supplications in terms of chain of transmission.\" (3)",
    "foot_note": "1. Agreed upon: Al-Bukhari via Abu Hurairah (1/158) number (793), Muslim (1/298) number (397).\n2. Agreed upon: Al-Bukhari via Abu Hurairah (1/149) number (744), Muslim (1/419) number (598).\n3. Asl Sifat Salat an-Nabi (Original Description of the Prophet's Prayer) (1/240).",
    "book_id": "1033",
    "new_page_number": 16
  },
  {
    "serial_number": "4931761",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "Second Dhikr: \"I have turned my face toward Him Who created the heavens and the earth, inclining toward truth, [submitting], and I am not of the polytheists. Indeed, my prayer, my rites of sacrifice, my living and my dying are for Allah, Lord of the worlds. No partner has He. And this I have been commanded, and I am of the Muslims. O Allah, You are the King, there is no god but You. You are my Lord, and I am Your servant. I have wronged myself and acknowledged my sin, so forgive me all my sins. Indeed, none forgives sins but You. And guide me to the best of morals; none guides to the best of them but You. And turn away from me the evil of them; none turns away from me the evil of them but You. Here I am and at Your service; all good is in Your hands, and evil is not attributed to You. [The guided one is he whom You guide]. I exist by You and return to You. Blessed and Exalted are You. I seek Your forgiveness and repent to You.\" (1)",
    "foot_note": "1. Narrated by Muslim via Ali bin Abi Talib (1/534) number (771). The portion in brackets is from Ibn Hibban (5/69), and Al-Albani authenticated it: Sifat Salat an-Nabi (p. 92).",
    "book_id": "1033",
    "new_page_number": 17
  },
  {
    "serial_number": "4931762",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "Third Dhikr: \"Glory be to You, O Allah, and with Your praise, and blessed is Your Name, and exalted is Your Majesty, and there is no god other than You.\" [Then he says: \"There is no god but Allah\" three times, then says: \"Allah is the Greatest, very great\" three times, \"I seek refuge in Allah, the All-Hearing, the All-Knowing, from the accursed Satan, from his madness, his blowing (arrogance), and his poetry (spitting).\" (1) Regarding the bracketed text, Al-Albani said: \"This is said in the Night Prayer\" (2). For this reason, the Prophet (peace and blessings of Allah be upon him) said: \"Indeed, the most beloved speech to Allah is that the servant says: Glory be to You, O Allah...\" (3).\nFourth Dhikr: \"Allah is the Greatest, very great. Praise be to Allah, in abundance. And glory be to Allah, morning and evening.\" A man from the Companions opened with this, so the Messenger of Allah (peace and blessings of Allah be upon him) said: \"I marveled",
    "foot_note": "1. Narrated by Abu Dawood via Abu Sa'id (1/206) number (775), At-Tirmidhi (2/9) number (242). Narrated by Al-Hakim who authenticated it, and Al-Dhahabi agreed, via Aisha without the phrase: \"Then he says: 'There is no god but Allah' three times... and his poetry\" (1/360) number (859). Al-Albani said: (Sahih) Sahih Abu Dawood (3/361) number (748), Sifat Salat an-Nabi (p. 93).\n2. Asl Sifat Salat an-Nabi (1/259).\n3. Narrated by An-Nasa'i in 'Amal Al-Yawm wa Al-Laylah (p. 488) number (849). Al-Albani said: A (Sahih) Hadith, As-Silsilah As-Sahihah (6/1055) number (2939).",
    "book_id": "1033",
    "new_page_number": 18
  },
  {
    "serial_number": "4931763",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "at it; the gates of heaven were opened for it.\" Ibn Umar said: \"I have not abandoned them since I heard the Messenger of Allah (peace and blessings of Allah be upon him) say that.\" (1)\nFifth Dhikr: \"Praise be to Allah, many, good, blessed praises.\" A man from the Companions opened with this, so the Prophet (peace and blessings of Allah be upon him) said: \"I saw twelve angels racing for it, which of them would raise it up.\" (2)\n\nBenefit: The multiplicity of Adhkar for prayer is a form of diversity in worship. A person may say this one at times and that one at times, and by doing so, he will have acted upon all these supplications and Adhkar.\n\nDhikr after the Opening Supplication:\nSeeking refuge in Allah from the accursed Satan (Isti'adhah), and it has three forms:\nFirst: \"I seek refuge in Allah from the accursed Satan.\" (3)",
    "foot_note": "1. Narrated by Muslim via Ibn Umar (1/420) number (601), Abu Awanah (1/431) number (1604).\n2. Narrated by Muslim via Anas bin Malik (1/419) number (600).\n3. Acting upon the Almighty's saying: {So when you recite the Qur'an, [first] seek refuge in Allah from Satan, the expelled [from His mercy].} [An-Nahl: 98].",
    "book_id": "1033",
    "new_page_number": 19
  },
  {
    "serial_number": "4931764",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "Second: \"I seek refuge in Allah from the accursed Satan, from his blowing (arrogance), his madness, and his poetry (spitting).\" (1)\nThird: \"I seek refuge in Allah, the All-Hearing, the All-Knowing, from the accursed Satan, from his madness, his blowing, and his poetry.\" (2)\n\nDhikr after the Opening Supplication and Seeking Refuge:\nHe reads Surah Al-Fatiha. This is done in every Rak'ah and in every prayer, whether he is an Imam, a follower, or praying alone; based on the saying of the Prophet (peace and blessings of Allah be upon him): \"There is no prayer for the one who does not read the Opening of the Book (Al-Fatiha).\" (3)",
    "foot_note": "1. Narrated by Ibn Hibban (5/80) number (1780), and Ahmad (36/514) number (22179). Al-Albani said: A (Sahih) Hadith, At-Ta'liqat Al-Hisan (3/292) number (1777), Sifat Salat an-Nabi (p. 95). Amr said: Nafkhuhu: Arrogance; Hamzuhu: Madness/Possession; Nafthuhu: Poetry.\n2. Narrated by At-Tirmidhi via Abu Sa'id (2/9) number (242), Al-Daraqutni (2/59) number (1140). Al-Albani said: A (Sahih) Hadith, Sahih Abu Dawood (3/361) number (748).\n3. Agreed upon: Narrated by Al-Bukhari via Ubadah bin As-Samit (1/151) number (756), Muslim (1/295) number (394).",
    "book_id": "1033",
    "new_page_number": 20
  },
  {
    "serial_number": "4931765",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "Dhikr after Reading Al-Fatiha:\n\"Ameen,\" whether he is an Imam, a follower, or praying alone. The Messenger of Allah (peace and blessings of Allah be upon him) said regarding the virtue of Ameen: \"Whoever's saying of Ameen coincides with the Ameen of the angels, his past sins will be forgiven.\" (1) He also said: \"So say: Ameen, and Allah will answer you.\" (2)\n\nDhikr after saying \"Ameen\":\nHe reads whatever is easy from the Quran (3), in the first two Rak'ahs of all five prayers (4), except for the follower (Ma'mum) in audible prayers, who limits himself to Al-Fatiha.\n\nDhikr for one who experiences whispering (distraction) in Prayer:\n\"He spits (dryly) (5) to his left three times and seeks refuge in Allah from Satan\" (6), meaning he says: \"I seek refuge in Allah from the accursed Satan.\"",
    "foot_note": "1. Agreed upon: Al-Bukhari via Abu Hurairah (1/156) number (782), Muslim (1/307) number (410).\n2. Narrated by Muslim via Abu Musa (1/303) number (404).\n3. Agreed upon: Al-Bukhari via Abu Hurairah (1/158) number (793), Muslim (1/298) number (397).\n4. Agreed upon: Al-Bukhari via Abu Qatadah (1/155) number (776), Muslim (1/333) number (451).\n5. At-Tafl: It is blowing accompanied by a tiny amount of saliva, because 'Nafth' is similar to blowing but is less than 'Tafl', as 'Tafl' only occurs with some saliva. (An-Nihayah: 5/88).\n6. Narrated by Muslim via Uthman bin Abi Al-As (4/1728) number (2203) with the wording: \"O Messenger of Allah, Satan has intervened between me and my prayer and my recitation, confusing it for me.\" The Messenger of Allah (peace be upon him) said: \"That is a devil called Khinzab. If you feel him, seek refuge in Allah from him and spit on your left three times.\" He said: \"I did that and Allah removed him from me.\"",
    "book_id": "1033",
    "new_page_number": 21
  },
  {
    "serial_number": "4931766",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "Dhikr when moving from one pillar to another in Prayer:\nSuch as moving from standing to bowing (Ruku), or to prostration (Sujud), or sitting between the two prostrations, or moving from prostration to standing. In all these cases, he says: \"Allah is the Greatest (Allahu Akbar)\" (1) [Except for rising from bowing, which has a specific Dhikr we will mention in its place]. Since this is a known matter, I did not repeat its mention at Ruku, Sujud, or otherwise.",
    "foot_note": "1. Narrated by Muslim via Abu Musa (1/303) number (404).",
    "book_id": "1033",
    "new_page_number": 22
  },
  {
    "serial_number": "4931767",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "Adhkar Reported in Ruku (Bowing):\nFirst Dhikr: \"Glory be to my Lord, the Magnificent (Subhana Rabbiya Al-Adheem)\" (1) three times (2). This is the obligatory Dhikr in Ruku.\nSecond Dhikr: \"Glorified, Holy, Lord of the angels and the Spirit (Subbuhun Quddus, Rabbu Al-Mala'ikati wa Ar-Ruh)\" (3).\nThird Dhikr: \"Glory be to You, O Allah, our Lord, and with Your praise. O Allah, forgive me.\" (4).\nFourth Dhikr: \"Glory be to You and with Your praise, there is no god but You.\" (5).\nFifth Dhikr: \"O Allah, to You I have bowed, in You I have believed, and to You I have submitted. My hearing, my sight, my brain, my bones, and my nerves have humbled themselves to You.\" (6).",
    "foot_note": "1. Narrated by Muslim via Hudhayfah (1/536) number (772).\n2. Narrated by Ibn Majah via Hudhayfah bin Al-Yaman (1/287) number (888). Al-Albani said: (Sahih) Sahih Al-Jami' As-Saghir (2/862) number (4734).\n3. Narrated by Muslim via Aisha, may Allah be pleased with her (1/353) number (487).\n4. Agreed upon: Al-Bukhari (1/163) number (817), Muslim via Aisha (1/350) number (484).\n5. Narrated by Muslim via Aisha (1/350) number (485).\n6. Narrated by Muslim via Ali bin Abi Talib (1/535) number (771).",
    "book_id": "1033",
    "new_page_number": 23
  },
  {
    "serial_number": "4931768",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "And outside the two Sahihs with the wording: \"O Allah, to You I have bowed, in You I have believed, to You I have submitted, and upon You I have relied. You are my Lord. My hearing, my sight, my flesh, my blood, my brain, [my bones], my nerves, [and whatever my feet carry] have humbled themselves to Allah, Lord of the Worlds.\" (1).\nSixth Dhikr: \"Glory be to the Possessor of Power, Kingdom, Greatness, and Majesty.\" (2).",
    "foot_note": "1. Narrated by An-Nasa'i (2/192) number (1051), Ibn Hibban (5/228) number (1901). The bracketed text is from Ibn Hibban. Al-Albani said: A (Sahih) Hadith, At-Ta'liqat Al-Hisan 'ala Sahih Ibn Hibban (3/364) number (1898), Sahih Abu Dawood: number (738).\n2. Narrated by Abu Dawood via Awf bin Malik Al-Ashja'i (1/231) number (873), and An-Nasa'i (2/191) number (1049). Al-Albani said: (Sahih) Sahih Abu Dawood (4/27) number (817), and authenticated by the scholar Al-Wadi'i in As-Sahih Al-Musnad number (1031).",
    "book_id": "1033",
    "new_page_number": 24
  },
  {
    "serial_number": "4931769",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "Adhkar upon Rising from Ruku:\nThese are of two types:\nFirst: Pertains to the Imam and the one praying alone, which is the 'Tasmee', meaning saying: \"Allah hears whoever praises Him (Sami'a Allahu liman hamidah)\" (1). Then they both add the 'Tahmid' (Praise) after the Tasmee, as this is established from the Prophet (peace and blessings of Allah be upon him) (2).\nSecond: What pertains to the Follower (Ma'mum), which is the 'Tahmid' (3).\nFor the Tahmid, there are four wordings:\nFirst: \"Our Lord, to You is praise (Rabbana laka al-hamd).\" (4)\nSecond: \"Our Lord, and to You is praise (Rabbana wa laka al-hamd).\" (5)",
    "foot_note": "1. Narrated by Al-Bukhari via Abu Hurairah (1/158) number (795).\n2. Agreed upon: Al-Bukhari via Abu Hurairah (1/158) number (795), Muslim (1/293) number (392) \"When the Prophet (peace be upon him) said: 'Sami'a Allahu liman hamidah', he would say: 'Allahumma rabbana wa lakal hamd'...\" The Hadith, and Muslim's wording is: \"He said: Rabbana wa lakal hamd.\"\n3. I did not find this detailed distinction in any works classified in the field of Adhkar.\n4. Narrated by Al-Bukhari via Abu Hurairah (1/157) number (789).\n5. Agreed upon: Al-Bukhari via Anas bin Malik (1/140) number (689), Muslim (1/308) number (411).",
    "book_id": "1033",
    "new_page_number": 25
  },
  {
    "serial_number": "4931770",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "Third: \"O Allah, our Lord, to You is praise (Allahumma rabbana laka al-hamd).\" (1)\nFourth: \"O Allah, our Lord, and to You is praise (Allahumma rabbana wa laka al-hamd).\" (2)\nThe Messenger of Allah (peace and blessings of Allah be upon him) said, explaining the virtue of Tahmid: \"For whoever's saying coincides with the saying of the angels, his past sins will be forgiven.\" He also said: \"When he [i.e., the Imam] says: 'Allah hears whoever praises Him', say: 'O Allah, our Lord, to You is praise', Allah will hear you, for Allah, Blessed and Exalted, said through the tongue of His Prophet (peace and blessings of Allah be upon him): Allah hears whoever praises Him.\" (3)\n\nDhikr after Tahmid:\nFirst Dhikr: \"O Allah, our Lord, to You is praise, filling the heavens and filling the earth, [and what is between them], and filling whatever You wish of things afterwards. O Worthy of Praise and Glory, the most truthful thing a servant has said, and we are all servants to You. O Allah, there is no preventer of what",
    "foot_note": "1. Agreed upon: Al-Bukhari via Abu Hurairah (1/158) number (796), Muslim (1/303) number (404).\n2. Narrated by Al-Bukhari via Abu Hurairah (1/158) number (795).\n3. Narrated by Muslim via Abu Musa (1/303) number (404).",
    "book_id": "1033",
    "new_page_number": 26
  },
  {
    "serial_number": "4931771",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "You have given, and no giver of what You have prevented, and no possessor of wealth (Al-Jadd) (1) will benefit from his wealth against You.\" (2). This formula combines the various narrations reported after the Tahmid. Their breakdown - repeating the mention of Tahmid - is as follows:\n\"Our Lord, to You is praise, filling the heavens and the earth, and filling whatever You wish of things afterwards. O Worthy of Praise and Glory, the most truthful thing a servant has said, and we are all servants to You: O Allah, there is no preventer of what You have given, and no giver of what You have prevented, and no possessor of wealth will benefit from his wealth against You.\" (3)\n\"O Allah, our Lord, to You is praise, filling the heavens, and filling the earth, and filling whatever You wish of things afterwards.\" (4)",
    "foot_note": "1. 'La yanfa'u dhal-jaddi minkal-jadd': Means the richness of the wealthy does not benefit him with You; only his righteous deeds benefit him. [Commentary by Mustafa Al-Bugha] on Al-Bukhari (1/168).\n2. Narrated by Muslim via Abu Sa'id Al-Khudri and via Ibn Abbas (1/347) number (477), number (478).\n3. Narrated by Muslim via Abu Sa'id Al-Khudri (1/347) number (477).\n4. Narrated by Muslim via Abdullah bin Abi Awfa (1/346) number (476).",
    "book_id": "1033",
    "new_page_number": 27
  },
  {
    "serial_number": "4931772",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "\"O Allah, our Lord, to You is praise, filling the heavens and filling the earth, and what is between them, and filling whatever You wish of things afterwards. O Worthy of Praise and Glory. There is no preventer of what You have given, and no giver of what You have prevented, and no possessor of wealth will benefit from his wealth against You.\" (1).\nSecond Dhikr: \"Our Lord, and to You is praise, many, good, blessed praises, [blessed upon it, as our Lord loves and is pleased with].\" The Messenger of Allah (peace and blessings of Allah be upon him) said to the one who said this supplication: \"I saw thirty-some angels racing for it (2), which of them would write it first.\" (3).\nThird Dhikr: \"O Allah, to You is praise, filling the sky, and filling the earth, and filling whatever You wish of things afterwards. O Allah, cleanse me with snow, hail, and cold water. O Allah, cleanse me from sins and errors as a white garment is cleansed",
    "foot_note": "1. Narrated by Muslim via Ibn Abbas (1/347) number (478).\n2. Yabtadirunaha: They hasten towards it. [Commentary by Mustafa Al-Bugha] in Sahih Al-Bukhari (1/159).\n3. Narrated by Al-Bukhari via Rifa'ah bin Rafi' (1/159) number (799), Abu Dawood (1/205) number (773), and the bracketed text is from Abu Dawood.",
    "book_id": "1033",
    "new_page_number": 28
  },
  {
    "serial_number": "4931773",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "from dirt.\" And in a narration: \"As a white garment is cleansed from filth (Ad-Daran).\" And in a narration: \"From impurity (Ad-Danas).\" (1)\n\nAdhkar Reported in Sujud (Prostration):\nFirst: \"Glory be to my Lord, the Most High (Subhana Rabbiya Al-A'la)\" (2) three times. This is the obligatory Dhikr in Sujud.\nSecond: \"Glorified, Holy, Lord of the angels and the Spirit.\" (3).\nThird: \"Glory be to the Possessor of Power, Kingdom, Greatness, and Majesty.\" (4).\nFourth: \"Glory be to Allah and with His praise, I seek Allah's forgiveness and repent to Him.\" (5).\nFifth: \"Glory be to You, my Lord, and with Your praise. O Allah, forgive me.\" (6).",
    "foot_note": "1. Narrated by Muslim via Abdullah bin Abi Awfa (1/346) number (476).\n2. Narrated by Muslim via Hudhayfah (1/536) number (772).\n3. Narrated by Muslim via Aisha (1/353) number (487).\n4. Previously referenced.\n5. Narrated by Muslim via Aisha (1/351) number (484).\n6. Narrated by Muslim via Aisha (1/351) number (484).",
    "book_id": "1033",
    "new_page_number": 29
  },
  {
    "serial_number": "4931774",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "Sixth: \"Glory be to You, O Allah, our Lord, and with Your praise. O Allah, forgive me.\" (1).\nSeventh: \"O Allah, to You I have prostrated, in You I have believed, and to You I have submitted. My face has prostrated to the One Who created it, shaped it, and opened its hearing and sight. Blessed is Allah, the Best of Creators.\" (2).\nEighth: \"O Allah, I seek refuge in Your pleasure from Your anger, and in Your forgiveness from Your punishment. I seek refuge in You from You. I cannot count the praises due to You; You are as You have praised Yourself.\" (3).\nNinth: \"O Allah, forgive me all my sins, the small and the great, the first and the last, the open and the secret.\" (4).",
    "foot_note": "1. Narrated by Muslim via Aisha (1/350) number (484).\n2. Narrated by Muslim via Ali (1/535) number (771).\n3. Narrated by Muslim via Aisha (1/352) number (486).\n4. Narrated by Muslim via Abu Hurairah (1/350) number (483).",
    "book_id": "1033",
    "new_page_number": 30
  },
  {
    "serial_number": "4931775",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "Note: It is desirable for a person to increase supplications for the good of this world and the Hereafter during prostration (Sujud). As for bowing (Ruku), it involves glorifying the Lord, the Mighty and Sublime. For this reason, the Prophet (peace and blessings of Allah be upon him) said: \"Behold, I have been forbidden from reciting the Quran while bowing or prostrating. As for the bowing, glorify the Lord, the Mighty and Sublime, in it. As for the prostration, strive in supplication, for it is worthy (Qamin) (1) of being answered for you.\" (2) He also said (peace be upon him): \"The closest a servant comes to his Lord is when he is prostrating, so increase supplication.\" (3)\n\nDhikr upon Sitting between the Two Prostrations:\n\"My Lord, forgive me. My Lord, forgive me.\" (4).\nAnd if he wishes, he may add: \"My Lord, forgive me, have mercy on me, console me (restore me), raise me (in status), provide for me, and guide me.\" (5).",
    "foot_note": "1. Qamin: Worthy and deserving that it be answered for you in prostration. [Explanation by Muhammad Abdul-Baqi] on Muslim (1/348).\n2. Narrated by Muslim via Ibn Abbas (1/348) number (479).\n3. Narrated by Muslim via Abu Hurairah (1/350) number (482).\n4. Narrated by Abu Dawood via Hudhayfah (1/231) number (874). Al-Albani said: (Sahih) Irwa al-Ghalil (2/41) number (335), Asl Sifat Salat an-Nabi by Al-Albani (3/811).\n5. Narrated by Ahmad via Ibn Abbas. The investigator of Al-Musnad said: A (Hasan) Hadith (5/460) number (3514), Al-Bayhaqi in As-Sunan As-Saghir (1/164) number (421). Al-Albani said: (Its chain is good). See: Asl Sifat Salat an-Nabi by Al-Albani (3/809) and Sifat Salat an-Nabi. Some said it is a Munkar (denounced) Hadith, solely reported by Kamil Abu Al-Ala.",
    "book_id": "1033",
    "new_page_number": 31
  },
  {
    "serial_number": "4931776",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adhkar of Prayers and What Comes Before and After Them",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "Adhkar of Sitting for the First Tashahhud:\nSeveral forms have been reported regarding this, among which we mention the following:\nFirst Form: \"Salutations to Allah, and prayers, and good things. Peace be upon you, O Prophet, and the mercy of Allah and His blessings. Peace be upon us and upon the righteous servants of Allah. I bear witness that there is no god but Allah, and I bear witness that Muhammad is His servant and messenger.\" (1).\nSecond Form: \"Blessed salutations, good prayers are for Allah. Peace be upon you, O Prophet, and the mercy of Allah and His blessings. Peace be upon us and upon the righteous servants of Allah. I bear witness that there is no god but Allah, and I bear witness that Muhammad is the Messenger of Allah.\" (2).",
    "foot_note": "1. Agreed upon: Al-Bukhari via Abdullah bin Mas'ud (1/166) number (835), Muslim (1/301) number (402).\n2. Narrated by Muslim via Ibn Abbas, who said: The Messenger of Allah (peace be upon him) used to teach us the Tashahhud just as he would teach us a Surah from the Quran, then he mentioned it (1/302) number (403).",
    "book_id": "1033",
    "new_page_number": 32
  },
  {
    "serial_number": "4931777",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "Third Formula: \"Greetings, good things, and prayers are for Allah. Peace be upon you, O Prophet, and the mercy of Allah and His blessings. Peace be upon us and upon the righteous slaves of Allah. I bear witness that there is no god but Allah, and I bear witness that Muhammad is His slave and Messenger\" (1). [He may send blessings upon the Prophet, peace and blessings be upon him, in the first Tashahhud] (2). Adhkar for Sitting in the Final Tashahhud: He recites one of the formulas mentioned in the first Tashahhud, then adds to it the prayer upon the Prophet, peace and blessings be upon him, and his family. It has several formulas, of which we mention the following: First Formula: \"O Allah, send prayers upon Muhammad and upon the family of Muhammad, as You sent prayers upon Ibrahim and upon the family of Ibrahim; You are indeed Worthy of Praise, Full of Glory. O Allah, bless Muhammad and the family of Muhammad, as You blessed Ibrahim and the family of Ibrahim; You are indeed",
    "foot_note": "1. Narrated by Muslim from Abu Musa Al-Ash'ari (1/303) No. (404).\n2. Mentioned by the scholar Al-Albani. See: Asl Sifat Salat al-Nabi (3/904), and Jala' al-Afham by Ibn al-Qayyim (p. 358).",
    "book_id": "1033",
    "new_page_number": 33
  },
  {
    "serial_number": "4931778",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "Worthy of Praise, Full of Glory\" (1). Second Formula: \"O Allah, send prayers upon Muhammad and upon the family of Muhammad, as You sent prayers upon the family of Ibrahim. And bless Muhammad and the family of Muhammad as You blessed the family of Ibrahim among the worlds; You are indeed Worthy of Praise, Full of Glory\" (2). Third Formula: \"O Allah, send prayers upon Muhammad and upon the family of Muhammad, as You sent prayers upon Ibrahim; You are indeed Worthy of Praise, Full of Glory. O Allah, bless Muhammad and the family of Muhammad, as You blessed Ibrahim; You are indeed Worthy of Praise, Full of Glory\" (3).",
    "foot_note": "1. Agreed upon: Al-Bukhari, and the wording is his, from Ka'b bin Ujrah (4/146) No. (3370), Muslim (1/305) No. (406).\n2. Narrated by Muslim from Abu Mas'ud Al-Ansari (1/305) No. (405).\n3. Narrated by Ahmad from Ka'b bin Ujrah (30/30) No. (18104), Al-Tirmidhi (2/352) No. (483). Al-Albani said: (Authentic) Sahih Abi Dawud (4/131) No. (896).",
    "book_id": "1033",
    "new_page_number": 34
  },
  {
    "serial_number": "4931779",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "Fourth Formula: \"O Allah, send prayers upon Muhammad and upon his wives and his offspring, as You sent prayers upon the family of Ibrahim. And bless Muhammad and his wives and his offspring, as You blessed the family of Ibrahim; You are indeed Worthy of Praise, Full of Glory\" (1). Fifth Formula: \"O Allah, send prayers upon Muhammad, the Unlettered Prophet, and upon the family of Muhammad, as You sent prayers upon Ibrahim and upon the family of Ibrahim. And bless Muhammad, the Unlettered Prophet, and the family of Muhammad, as You blessed Ibrahim and the family of Ibrahim; You are indeed Worthy of Praise, Full of Glory\" (2). Remembrance immediately after the Final Tashahhud: \"O Allah, I seek refuge in You from the punishment of Hell, from the punishment of the grave, from the trials of life and death, and from the evil of the trial of the False Messiah (Al-Masih Ad-Dajjal)\" (3). In another Hadith, there is an addition: \"O Allah, I seek refuge in You from sin and heavy debt\" (4).",
    "foot_note": "1. Agreed upon: Al-Bukhari (4/146) No. (3369), Muslim, and the wording is his: from Abu Humaid Al-Sa'idi (1/306) No. (407).\n2. Narrated by Ibn Hibban from Abu Mas'ud (5/289) No. (1959), Al-Bayhaqi in Al-Sunan Al-Saghir (1/174) No. (454). Al-Albani said: (Authentic) Sahih Al-Jami' Al-Saghir (2/813) No. (4414).\n3. Agreed upon: Al-Bukhari (2/99) No. (1377), Muslim from Abu Hurairah (1/412) No. (588), and the wording is his.\n4. Narrated by Muslim from Aisha (1/412) No. (589).",
    "book_id": "1033",
    "new_page_number": 35
  },
  {
    "serial_number": "4931780",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "Adhkar before the Tasleem (Salutation): First Remembrance: \"O Allah, I have wronged my soul with abundant wrong, and no one forgives sins except You. So forgive me with a forgiveness from You, and have mercy on me; indeed, You are the Forgiving, the Merciful\" (1). Second Remembrance: \"O Allah, I ask You by Allah, the One, the Eternal Refuge, who begets not nor was He begotten, and there is none co-equal or comparable unto Him, that You forgive me my sins; indeed, You are the Forgiving, the Merciful.\" The Prophet, peace and blessings be upon him, said to the one who supplicated with this prayer: \"He has been forgiven,\" three times (2).",
    "foot_note": "1. Narrated by Al-Bukhari from Abdullah bin Amr (8/72) No. (6326).\n2. Narrated by Ibn Khuzaymah from Mihjan bin Al-Adra' (1/358) No. (724), Al-Hakim (1/400) No. (985), Ahmad (31/310) No. (18974). Al-Albani said: (Authentic) Sahih Abi Dawud (4/140) No. (905), Sifat Salat al-Nabi (p. 186).",
    "book_id": "1033",
    "new_page_number": 36
  },
  {
    "serial_number": "4931781",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "Third Remembrance: \"O Allah, I ask You for Paradise and I seek refuge in You from the Fire\" (1). The Messenger of Allah, peace and blessings be upon him, said: \"Whoever asks for Paradise three times, Paradise says: 'O Allah, admit him into Paradise.' And whoever seeks protection from the Fire three times, the Fire says: 'O Allah, protect him from the Fire'\" (2). Fourth Remembrance: \"O Allah, by Your knowledge of the unseen and Your power over creation, keep me alive as long as You know that life is good for me, and cause me to die when You know that death is good for me. O Allah, I ask You for fear of You in the unseen and the seen; I ask You for the word of truth in contentment and in anger; I ask You for moderation in poverty and in wealth; I ask You for bliss that does not cease; I ask You for delight of the eye that does not end; I ask You for contentment after the decree; I ask You for the coolness of life after death; I ask You for the pleasure of looking at Your Face,",
    "foot_note": "1. Narrated by Ibn Hibban from Abu Hurairah (3/149) No. (868), Ibn Majah (1/295) No. (910) and No. (446). Al-Albani said: (Authentic) Al-Ta'liqat Al-Hisan (2/232) No. (865), and Al-Wadi'i authenticated it in Al-Sahih Al-Musnad No. (1461).\n2. Narrated by Ibn Majah from Anas bin Malik (2/1453) No. (4340), Al-Nasa'i in Al-Sunan Al-Kubra (7/235) No. (7907). Al-Albani said: (Authentic) Sahih Al-Jami' Al-Saghir (2/1076) No. (6275) and Al-Mishkat (2478), Al-Ta'liqat Al-Hisan (2/335) No. (1031).",
    "book_id": "1033",
    "new_page_number": 37
  },
  {
    "serial_number": "4931782",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "and the longing to meet You, without any harmful adversity or misleading trial. O Allah, adorn us with the adornment of faith and make us guides who are guided\" (1). Fifth Remembrance: \"O Allah, I ask You by virtue of the fact that all praise is due to You; there is no god but You, [You alone, having no partner], the Bestower, the Originator of the heavens and the earth, O Possessor of Majesty and Honor, O Ever-Living, O Sustainer of existence, [I ask You for Paradise, and I seek refuge in You from the Fire].\" The Prophet, peace and blessings be upon him, said to the one who supplicated with this prayer: \"He has supplicated to Allah by His Greatest Name, which if He is called by it, He answers, and if He is asked by it, He gives\" (2).",
    "foot_note": "1. Narrated by Al-Nasa'i from Ammar bin Yasir (3/54) No. (1305) and the wording is his, Ahmad (30/265) No. (18325). Al-Albani said: (Authentic) Al-Ta'liqat Al-Hisan 'ala Sahih Ibn Hibban (3/401) No. (1968), Sifat Salat al-Nabi by Al-Albani (p. 184).\n2. Narrated by Abu Dawud from Anas (2/80) No. (1495), Ibn Majah (2/1268) No. (3858). Al-Albani said: (Authentic) Sahih Abi Dawud - Al-Umm (5/233) No. (1342), and Al-Wadi'i authenticated it in Al-Sahih Al-Musnad No. (101).",
    "book_id": "1033",
    "new_page_number": 38
  },
  {
    "serial_number": "4931783",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "Sixth Remembrance: \"O Allah, forgive me what I have sent forward and what I have left behind, what I have concealed and what I have declared, what I have exceeded in, and what You know better than I. You are the Advancer and You are the Delayer; there is no god but You\" (1). Remembrance upon finishing the Prayer and exiting it: \"Peace be upon you and the mercy of Allah\" (*As-salamu 'alaykum wa rahmatullah*), once to his right and once to his left (2).",
    "foot_note": "1. Narrated by Muslim from Ali bin Abi Talib (1/535) No. (771).\n2. Narrated by Muslim from Sa'd (1/409) No. (582) [in meaning], and narrated by Abu Dawud from Abdullah bin Mas'ud (1/261) No. (996), Al-Tirmidhi (2/89) No. (295), and Al-Tirmidhi said the Hadith of Ibn Mas'ud is Hasan Sahih. Al-Albani said: (Authentic) Sahih Abi Dawud (4/150) No. (914). Hadith scholars differed regarding the addition of \"wa barakatuhu\" (and His blessings) on the right side; some affirmed it and some weakened it. See: Asl Sifat Salat al-Nabi (3/1024).",
    "book_id": "1033",
    "new_page_number": 39
  },
  {
    "serial_number": "4931784",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "Note: What is recited of Adhkar in the five daily prayers is recited in all prayers, except for what other prayers specifically specialize in regarding Adhkar, such as the Funeral Prayer and the two Eid prayers, which will be discussed in the fourth section. •••",
    "foot_note": "None",
    "book_id": "1033",
    "new_page_number": 40
  },
  {
    "serial_number": "4931785",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "• Section Three: Adhkar Reported After the Five Daily Prayers. This includes Adhkar reported from after the Tasleem until putting away clothes at home. Adhkar reported after Tasleem from prayer: First Remembrance: \"I seek forgiveness from Allah, I seek forgiveness from Allah, I seek forgiveness from Allah\" (*Astaghfirullah*). Then he says: \"O Allah, You are Peace and from You is peace; blessed are You, O Possessor of Majesty and Honor\" (1). Second Remembrance: \"Allah is the Greatest, Allah is the Greatest, Allah is the Greatest\" (2) (3). Third Remembrance: \"O Allah, help me to remember You, to thank You, and to worship You in the best manner\" (4).",
    "foot_note": "1. Narrated by Muslim from Thawban (1/414) No. (591).\n2. Narrated by Muslim from Ibn Abbas (1/410) No. (583), who said: \"We used to know the end of the prayer of the Messenger of Allah, peace and blessings be upon him, by the Takbir.\"\n3. Ihkam al-Ahkam by Ibn Daqiq al-Eid (1/320), Qurrat al-'Ayn bi-Fatawa 'Ulama al-Haramayn (p. 44).\n4. Narrated by Abu Dawud from Mu'adh bin Jabal (2/86) No. (1522), Ibn Hibban (5/364) No. (2020). Al-Albani said: (Authentic) Sahih Abi Dawud No. (1362).",
    "book_id": "1033",
    "new_page_number": 41
  },
  {
    "serial_number": "4931786",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "Fourth Remembrance: He reads Ayat al-Kursi, which is His saying: {Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great} (1). For this reason, the Messenger of Allah, peace and blessings be upon him, said: \"Whoever recites Ayat al-Kursi at the end of every written prayer, nothing prevents him from entering Paradise except death\" (2).",
    "foot_note": "1. Surah: [Al-Baqarah: Verse 255]\n2. Narrated by Al-Nasa'i from Abu Umamah (9/44) No. (9848). Al-Albani said: (Authentic) Sahih Al-Jami' Al-Saghir and its addition (2/1103) No. (6464), Al-Silsilah Al-Sahihah (972), and Al-Wadi'i authenticated it in Al-Sahih Al-Musnad No. (478).",
    "book_id": "1033",
    "new_page_number": 42
  },
  {
    "serial_number": "4931787",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "Fifth Remembrance: He recites the Mu'awwidhat (1), which are (2): Surah Al-Ikhlas: {Say, \"He is Allah, [who is] One...\"}. Surah Al-Falaq: {Say, \"I seek refuge in the Lord of daybreak...\"}. Surah An-Nas: {Say, \"I seek refuge in the Lord of mankind...\"}. The Prophet, peace and blessings be upon him, said regarding the virtue of the two Mu'awwidhatan: \"No seeker of refuge has sought refuge with anything like them\" (3). Sixth Remembrance: \"There is no god but Allah alone, having no partner. To Him belongs the dominion and to Him belongs the praise, and He is over all things competent. O Allah, there is no preventer of what You have given, and no giver of what You have prevented, and the greatness of the possessor of greatness is of no avail against You\" (4).",
    "foot_note": "1. Narrated by Abu Dawud from Uqbah bin Amir (2/86) No. (1523), Al-Nasa'i (3/68) No. (1336). The wording of the Hadith is: \"The Messenger of Allah, peace and blessings be upon him, commanded me to recite the Mu'awwidhat at the end of every prayer.\"\n2. Al-Mu'awwidhat: Meaning the three Surahs. Surah Al-Ikhlas is mentioned with them predominately because it contains the description of the Lord, even if the word of seeking refuge is not explicitly stated in it. (Fath al-Bari by Ibn Hajar) (9/62), (Tarh al-Tathrib) (8/194).\n3. Narrated by Abu Dawud from Uqbah bin Amir (2/73) No. (1463). Al-Albani said: (Authentic) Sahih Abi Dawud (5/204) No. (1316).\n4. Agreed upon: Al-Bukhari from Al-Mughirah bin Shu'bah (8/73) No. (6330), Muslim (1/414) No. (593).",
    "book_id": "1033",
    "new_page_number": 43
  },
  {
    "serial_number": "4931788",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "Seventh Remembrance: \"There is no god but Allah alone, having no partner. To Him belongs the dominion and to Him belongs the praise, and He is over all things competent. There is no power and no strength except by Allah. There is no god but Allah, and we worship none but Him. To Him belongs the grace, to Him belongs the favor, and to Him belongs good praise. There is no god but Allah, sincere to Him in religion, although the disbelievers dislike it\" (1). Eighth Remembrance (Tasbih): It has three formulas (2): First Formula: \"Glory be to Allah (*Subhan Allah*) thirty-three times, Praise be to Allah (*Alhamdulillah*) thirty-three times, and Allah is the Greatest (*Allahu Akbar*) thirty-three times; that is ninety-nine. Then he says to complete the hundred: There is no god but Allah alone, having no partner. To Him belongs the dominion and to Him belongs the praise, and He is over all things competent.\" The Messenger, peace and blessings be upon him, said to the one who says this remembrance: \"His sins will be forgiven even if they were",
    "foot_note": "1. Narrated by Muslim from Ibn Al-Zubayr (1/415) No. (594).\n2. Majmu' Fatawa wa Rasa'il Al-Uthaymin (13/253).",
    "book_id": "1033",
    "new_page_number": 44
  },
  {
    "serial_number": "4931789",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "like the foam of the sea (1)\" (2). And the Prophet, peace and blessings be upon him, said regarding the merit of this remembrance when he guided the Companions to it: \"Shall I not teach you something by which you will catch up with those who preceded you and surpass those who come after you, and no one will be better than you except one who does the like of what you did...?\" (3) So he mentioned it to them. He also said: \"Successive [words], the sayer—or doer—of which will not be disappointed after every written prayer\" (4). Second Formula: \"Glory be to Allah (*Subhan Allah*) twenty-five times, Praise be to Allah (*Alhamdulillah*) twenty-five times, Allah is the Greatest (*Allahu Akbar*) twenty-five times, and There is no god but Allah (*La ilaha illa Allah*) twenty-five times\" (5).",
    "foot_note": "1. (Even if they were like the foam of the sea): Meaning in abundance and magnitude like the foam of the sea: which is what rises upon its surface when it is agitated and wavy. [Commentary by Muhammad Abd al-Baqi] on Muslim (1/418).\n2. Narrated by Muslim from Abu Hurairah (1/418) No. (597), No. (596), (595).\n3. Narrated by Muslim from Abu Hurairah (1/416) No. (595).\n4. Narrated by Muslim from Ka'b bin Ujrah (1/418) No. (596).\n5. Narrated by Al-Nasa'i from Zaid bin Thabit (3/76) No. (1350). Al-Albani said: (Authentic) Mishkat al-Masabih (1/307) No. (973).",
    "book_id": "1033",
    "new_page_number": 45
  },
  {
    "serial_number": "4931790",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "Third Formula: \"Glorify Allah (*Tasbih*) ten times, Praise Allah (*Tahmid*) ten times, and declare His Greatness (*Takbir*) ten times\" (1). The Messenger, peace and blessings be upon him, said regarding the virtue of this remembrance: \"Two qualities, or two characteristics, no Muslim servant maintains them but he will enter Paradise. They are easy, but those who act upon them are few: He glorifies Allah at the end of every prayer ten times, praises Him ten times, and declares His greatness ten times. That is one hundred and fifty on the tongue, and one thousand five hundred in the Scale...\" (2). Note: The Prophet, peace and blessings be upon him, used to count the Tasbih with his right hand (3).",
    "foot_note": "1. Narrated by Abu Dawud from Abdullah bin Amr (4/316) No. (5065). Al-Albani said: (Authentic) Mishkat al-Masabih: (2/743) No. (2406). The rest of the Hadith: \"And he declares Allah's greatness thirty-four times when he takes his bed, praises Him thirty-three times, and glorifies Him thirty-three times. That is one hundred on the tongue, and one thousand in the Scale.\" I saw the Messenger of Allah, peace and blessings be upon him, counting them with his hand. They said: \"O Messenger of Allah, how are they easy and those who act upon them are few?\" He said: \"Someone comes to one of you—meaning Satan—in his sleep and puts him to sleep before he says it, and comes to him in his prayer and reminds him of a need before he says it.\"\n2. Previous reference.\n3. Narrated by Abu Dawud (2/81) No. (1502), Al-Bayhaqi in Al-Sunan Al-Kubra (2/267) No. (3027) from Abdullah bin Amr, who said: \"I saw the Messenger of Allah, peace and blessings be upon him, counting the Tasbih.\" Ibn Qudamah said: \"With his right hand.\" And in Al-Nasa'i: \"I saw the Messenger of Allah, peace and blessings be upon him, counting the Tasbih with his right hand.\" Al-Albani said: (Authentic) Sahih Abi Dawud (5/237) No. (1346).",
    "book_id": "1033",
    "new_page_number": 46
  },
  {
    "serial_number": "4931791",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "Tenth Remembrance: \"O Allah, I seek refuge in You from cowardice, and I seek refuge in You from being returned to the most decrepit old age, and I seek refuge in You from the trial of the world, and I seek refuge in You from the punishment of the grave\" (1). Eleventh Remembrance: \"My Lord, protect me from Your punishment on the Day You resurrect - or gather - Your servants\" (2). Twelfth Remembrance: \"Glory be to You, O Allah, and with Your praise; there is no god but You. I seek forgiveness from Allah and repent to Him\" (3). The Messenger, peace and blessings be upon him, explained the virtue of this remembrance by saying:",
    "foot_note": "1. Narrated by Al-Bukhari from Sa'd bin Abi Waqqas (4/23) No. (2822).\n2. Narrated by Muslim from Al-Bara' (1/492) No. (709).\n3. Narrated by Ahmad from Aisha (41/34) No. (24486), Al-Nasa'i (3/71) No. (1344), containing: \"That the Messenger of Allah, peace and blessings be upon him, if he sat in a gathering or prayed, he would speak certain words. Aisha asked him about the words... so he mentioned it.\" Al-Albani said: (Authentic) Al-Silsilah Al-Sahihah (7/493) No. (3164), and Al-Wadi'i authenticated it in Al-Sahih Al-Musnad No. (1598).",
    "book_id": "1033",
    "new_page_number": 47
  },
  {
    "serial_number": "4931792",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "\"If he speaks good, it will be a seal (1) upon them until the Day of Resurrection, and if he speaks other than that, it will be an expiation [for him].\" Therefore, it is the last thing to be said. Note: After the written prayers are among the times when supplication is answered (2). Adhkar for Sitting in the Mosque After Prayer: One remembers Allah Almighty with all types of remembrance. However, if he stays in the mosque after the Fajr prayer, it is recommended that he says the Morning Adhkar (known as the Adhkar of the Morning and Evening) and continues remembering Allah Almighty until the sun rises, then prays two Rak'ahs. The Messenger, peace and blessings be upon him, said regarding the virtue of the reward of one who sits in the mosque after the Fajr and Asr prayers and remembers Allah Almighty: \"Whoever prays",
    "foot_note": "1. (A seal): Meaning, Ibn Hajar said: A stamp upon it until the Day of Resurrection, (Fath Al-Bari) (13/546). Al-Sindi said: A seal that preserves it from loss (Hashiyah Musnad Ahmad, Al-Risala Edition) (41/35).\n2. Narrated by Al-Tirmidhi from Abu Umamah (5/526) No. (3499). He said: It was said, O Messenger of Allah: Which supplication is most heard? He said: \"In the last part of the night, and at the end of the written prayers.\" Al-Tirmidhi said: This Hadith is Hasan. Al-Albani said: (Hasan) Mishkat al-Masabih (1/305) No. (968).",
    "book_id": "1033",
    "new_page_number": 48
  },
  {
    "serial_number": "4931793",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "Fajr in congregation, then sits remembering Allah until the sun rises, then prays two Rak'ahs, it will be for him like the reward of a Hajj and an Umrah... complete, complete, complete\" (1). He also said: \"That I sit with people remembering Allah Almighty from the Morning Prayer until the sun rises is more beloved to me than freeing four of the children of Isma'il. And that I sit with people remembering Allah from the Asr prayer until the sun sets is more beloved to me than freeing four\" (2). And he, peace and blessings be upon him, said regarding one who sits in the mosque remembering Allah Almighty: \"No people sit remembering Allah Almighty except that the angels surround them, mercy covers them, tranquility descends upon them, and Allah mentions them to those who are with Him.\" In another narration: \"And no people gather in one of the houses of Allah, reciting the Book of Allah and studying it among themselves, except that",
    "foot_note": "1. Narrated by Al-Tirmidhi from Anas (2/481) No. (586). Al-Albani said: (Authentic) Sahih Al-Jami' Al-Saghir (2/1086) No. (6346), and Sahih Al-Targhib No. (464).\n2. Narrated by Abu Dawud (3/324) No. (3667). Al-Albani said: (Hasan) Sahih Al-Jami' Al-Saghir (2/899) No. (5036), Silsilat Al-Ahadith Al-Sahihah (6/994) No. (2916).",
    "book_id": "1033",
    "new_page_number": 49
  },
  {
    "serial_number": "4931794",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "tranquility descends upon them, mercy covers them, the angels surround them, and Allah mentions them to those who are with Him\" (1). He also said: \"When he enters the mosque, he is in prayer as long as the prayer is what detains him, and the angels pray for one of you as long as he is in his sitting place in which he prayed, saying: 'O Allah, have mercy on him; O Allah, forgive him; O Allah, accept his repentance,' as long as he does not harm anyone therein, and as long as he does not break his wudu therein\" (2). Remembrance upon Sneezing: If someone sneezes, let him say: \"Praise be to Allah\" (*Alhamdulillah*). It is said to him: \"May Allah have mercy on you\" (*Yarhamukallah*). And he must reply by saying: \"May Allah guide you and set your condition right\" (*Yahdikumullah wa yuslihu balakum*) (3). Remembrance upon Leaving the Mosque: First: \"O Allah, I ask You from Your bounty\" (4).",
    "foot_note": "1. Narrated by Muslim from Abu Hurairah and Abu Sa'id Al-Khudri (4/2074) No. (2700).\n2. Agreed upon: Al-Bukhari (1/132) No. (659), Muslim from Abu Hurairah (1/459) No. (649).\n3. Agreed upon: Al-Bukhari from Abu Hurairah (8/49) No. (6224), Muslim (4/2292) No. (2993).\n4. Previously cited, under the mention of entering the mosque.",
    "book_id": "1033",
    "new_page_number": 50
  },
  {
    "serial_number": "4931795",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "It came outside the Two Sahihs with the wording: \"In the name of Allah, and peace be upon the Messenger of Allah. O Allah, forgive me my sins and open for me the doors of Your bounty. O Allah, protect me—and in a narration (guard me)—from the accursed Satan\" (1). Second: \"In the name of Allah; O Allah, send prayers upon Muhammad\" (2). Remembrance upon seeing an afflicted person: \"Praise be to Allah who has spared me from what He has afflicted you with, and favored me over many of those He has created with a distinct favor.\" The Prophet, peace and blessings be upon him, said whoever says this supplication: \"That affliction will not strike him\" (3).",
    "foot_note": "1. Narrated by Ibn Majah from Abu Hurairah (1/254) No. (773), Ibn Hibban (5/399) No. (2050), Ahmad (44/13) No. (26416), and Al-Hakim (1/325), with the addition of the word (and prayer) before peace in Al-Hakim and Ahmad, and Al-Hakim authenticated it. It is also said upon entering, and seeking refuge from Satan No. (747). Narrated by Al-Tirmidhi (2/128) No. (314), Al-Tabarani (p. 151) No. (427). Al-Hakim said: (Authentic according to the conditions of the Two Sheikhs), and Al-Dhahabi agreed. See: Al-Thamar Al-Mustatab in Fiqh Al-Sunnah wa Al-Kitab by Al-Albani (2/606).\n2. Narrated by Ibn Al-Sunni in 'Amal Al-Yawm wa Al-Laylah, from Anas bin Malik (p. 80) No. (88). Al-Albani said: (Hasan) Takhrij Al-Kalim Al-Tayyib (p. 91) No. (64), Al-Thamar Al-Mustatab (2/604).\n3. Narrated by Al-Tirmidhi from Abu Hurairah (5/494) No. (3432). Al-Albani said: (Hasan) Sahih Al-Jami' Al-Saghir (2/1072) No. (6248), Al-Kalim Al-Tayyib No. (229), Al-Silsilah Al-Sahihah No. (602).",
    "book_id": "1033",
    "new_page_number": 51
  },
  {
    "serial_number": "4931796",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "Remembrance when passing through the Market: \"There is no god but Allah alone, having no partner. To Him belongs the dominion and to Him belongs the praise. He brings to life and causes death, and He is Living and does not die. In His Hand is the good, and He is over all things competent.\" Regarding the reward of one who says this remembrance, it is stated: \"Allah writes for him a million good deeds, wipes away from him a million bad deeds, raises him a million degrees, and builds for him a house in Paradise\" (1). Remembrance upon entering the Home: One mentions Allah Almighty when entering his home, such as saying: \"In the name of Allah\" (*Bismillah*), or saying: \"There is no god but Allah,\" or other phrases termed as remembrance of Allah. Then he greets his family, meaning he says: \"Peace be upon you, and the mercy of Allah and His blessings\" (*As-salamu 'alaykum wa rahmatullah wa barakatuhu*).",
    "foot_note": "1. Narrated by Al-Tirmidhi from Umar bin Al-Khattab (5/491) No. (3429), Al-Hakim (1/721) No. (1974). Hadith scholars differed regarding this Hadith; some classified it as Hasan, and some weakened it. Whoever agrees with the classification of Hasan may say it. Al-Albani said: (Hasan) Sahih Al-Jami' Al-Saghir and its addition (2/1070) No. (6231), Al-Kalim Al-Tayyib (230), Al-Targhib (3/5).",
    "book_id": "1033",
    "new_page_number": 52
  },
  {
    "serial_number": "4931797",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "Therefore, it is reported in the Hadith of Jabir, may Allah be pleased with him, that he heard the Prophet, peace and blessings be upon him, say: \"When a man enters his house and mentions Allah upon his entry and upon his food, Satan says: 'You have no place to spend the night and no dinner.' But if he enters and does not mention Allah upon his entry, Satan says: 'You have found a place to spend the night.' And if he does not mention Allah upon his food, he says: 'You have found a place to spend the night and dinner'\" (1). As for the greeting of peace (Salam), its legitimacy is well-known. Remembrance before eating food or drinking: \"In the name of Allah\" (*Bismillah*). If he forgets at the beginning, let him say: \"In the name of Allah at its beginning and its end\" (2). Adhkar after finishing food or drink: First Remembrance: \"Praise be to Allah, [a praise] abundant, good, and blessed, insufficient [for His right], not leaving Him (i.e., not a farewell), and indispensable (3), our Lord\" (4).",
    "foot_note": "1. Narrated by Muslim from Jabir bin Abdullah (3/1598) No. (2018).\n2. Narrated by Al-Tirmidhi from Aisha (4/288) No. (1858) and the wording is his, Abu Dawud (3/347) No. (3767). Al-Albani said: (Authentic) Sahih Al-Jami' Al-Saghir (1/282) No. (1323), Al-Kalim Al-Tayyib No. (183), Al-Irwa No. (1965).\n3. (Ghayra makfiy): Meaning what we ate is not sufficient to replace what comes after it; rather, Your blessings are continuous upon us, uninterrupted throughout our lives. (Wa la muwadda'): From bidding farewell, meaning this is not our last food. [Commentary by Mustafa Al-Bugha] in Al-Bukhari.\n4. Narrated by Al-Bukhari from Abu Umamah (7/82) No. (5458). The text between brackets is in Abu Dawud (3/366) No. (3849).",
    "book_id": "1033",
    "new_page_number": 53
  },
  {
    "serial_number": "4931798",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "Second Remembrance: \"Praise be to Allah who sufficed us and quenched our thirst, neither being insufficient nor denied (1)\" (2). Third Remembrance: \"Praise be to Allah who fed, gave drink, made it easy to swallow, and made a way out for it\" (3). Fourth Remembrance: \"Praise be to Allah who fed me this food and provided it to me without any power or strength from me\" (4). The Prophet, peace and blessings be upon him, said regarding the reward of one who says this remembrance: \"His past sins will be forgiven.\"",
    "foot_note": "1. (Wa la makfur): His bounty is not denied nor is His blessing rejected. [Commentary by Mustafa Al-Bugha] in Al-Bukhari.\n2. Narrated by Al-Bukhari from Abu Umamah (7/82) No. (5459).\n3. Narrated by Abu Dawud from Abu Ayyub Al-Ansari (3/366) No. (3851). Al-Albani said: (Authentic) Sahih Al-Jami' Al-Saghir (2/856) No. (4681), Al-Silsilah Al-Sahihah No. (2061), and it is in Al-Sahih Al-Musnad by Al-Wadi'i No. (318).\n4. Narrated by Abu Dawud from Sahl bin Mu'adh bin Anas (4/42) No. (4023). Al-Albani said: (Hasan) Sahih Al-Jami' Al-Saghir: (2/1050) No. (6086), Al-Kalim Al-Tayyib No. (188), Al-Irwa No. (1989).",
    "book_id": "1033",
    "new_page_number": 54
  },
  {
    "serial_number": "4931799",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "The Messenger, peace and blessings be upon him, explained the virtue of the one who praises Allah Almighty for food and drink by saying: \"Indeed, Allah is pleased with the servant who eats a meal and praises Him for it, or drinks a drink and praises Him for it\" (1). Remembrance upon putting aside (i.e., taking off) clothes: \"In the name of Allah\" (*Bismillah*) (2).",
    "foot_note": "1. Narrated by Muslim from Anas bin Malik (4/2095) No. (2734).\n2. Narrated by Al-Tabarani from Anas (3/67) No. (2504). Al-Albani said: (Authentic) Sahih Al-Jami' Al-Saghir and its addition (1/675) No. (3610) with the wording: \"The screen between the eyes of the Jinn and the private parts of the children of Adam when one of them puts aside his garment is to say: Bismillah.\"",
    "book_id": "1033",
    "new_page_number": 55
  },
  {
    "serial_number": "4931800",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "• Section Four: Adhkar Reported in Prayers Other Than the Five Daily Prayers. This includes Adhkar of the Night Prayer, Funeral Prayer, Eid Prayer, Istikhara Prayer, Istisqa Prayer, and Eclipse Prayer. First: Adhkar Reported in the Night Prayer: Adhkar after the Opening Takbir (Takbirat al-Ihram) if he starts the Night Prayer: First Remembrance: \"O Allah, to You belongs the praise. You are the Sustainer (1) of the heavens and the earth and whoever is in them. And to You belongs the praise. To You belongs the dominion of the heavens and the earth and whoever is in them. And to You belongs the praise. You are the Light of the heavens and the earth and whoever is in them. And to You belongs the praise. You are the King of the heavens and the earth. And to You belongs the praise. You are the Truth, Your promise is",
    "foot_note": "1. (Qayyim): The One who constantly manages the creation, giving them what sustains their affairs. (And for You I have disputed): For Your sake, I have disputed with the stubborn and the disbeliever and suppressed him with what You have given me of power with the sword and proof. (To You I have submitted for judgment): I have made Your law the judge between me and whoever denies the truth or with whom a dispute arises. [Commentary by Al-Bugha] on Al-Bukhari (2/49).",
    "book_id": "1033",
    "new_page_number": 56
  },
  {
    "serial_number": "4931801",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "the truth, the meeting with You is true, Your word is true, Paradise is true, the Fire is true, the Prophets are true, Muhammad, peace and blessings be upon him, is true, and the Hour is true. O Allah, to You I have submitted, in You I have believed, upon You I have relied, to You I have turned, for You I have disputed, and to You I have submitted for judgment. So forgive me what I have sent forward and what I have left behind, what I have concealed and what I have declared. You are the Advancer and You are the Delayer. There is no god but You, and there is no power and no strength except by Allah\" (1). Second Remembrance: \"O Allah, Lord of Jibril, Mika'il, and Israfil, Originator of the heavens and the earth, Knower of the unseen and the seen, You judge between Your servants concerning that in which they used to differ. Guide me to what has been differed over of the truth by Your permission; indeed, You guide whom You will to a straight path\" (2).",
    "foot_note": "1. Agreed upon: Al-Bukhari from Ibn Abbas (2/48) No. (1120), Muslim (1/532) No. (769).\n2. Narrated by Muslim from Aisha (1/534) No. (770).",
    "book_id": "1033",
    "new_page_number": 57
  },
  {
    "serial_number": "4931802",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "Third Remembrance: \"He says 'Allahu Akbar' ten times, 'Subhan Allah' ten times, 'La ilaha illa Allah' ten times, and seeks forgiveness ten times. He says: 'O Allah, forgive me, guide me, provide for me, [and heal me]' ten times. And he says: 'O Allah, I seek refuge in You from the distress of the Day of Account' ten times\" (1). Fourth Remembrance: \"Allah is the Greatest [three times], Possessor of Sovereignty, Power, Grandeur, and Greatness\" (2). Fifth Remembrance: See the third remembrance of the previously mentioned Opening Adhkar. Remembrance upon reciting the Quran after Al-Fatihah in the Night Prayer: \"If he passes by a verse containing glorification, he glorifies; if he passes by a question (request), he asks; and if he passes by seeking refuge, he seeks refuge\" (3). This is prescribed for the Imam and the one praying alone, but not for the follower (behind an Imam) because it has not been proven in his case.",
    "foot_note": "1. Narrated by Ahmad from Aisha (42/37, 38) No. (25102), Al-Nasa'i (8/284) No. (5535). The text between brackets is in Al-Nasa'i. Al-Albani said: (Authentic) Sahih Abi Dawud (3/352) No. (742), Sifat Salat al-Nabi (p. 94).\n2. Narrated by Abu Dawud from Hudhayfah (1/231) No. (874), and Ahmad (38/392) No. (23375). Al-Albani said: (Authentic) Sahih Abi Dawud (4/27) No. (818), Sifat Salat al-Nabi (p. 94). The text between brackets is in Abu Dawud.\n3. Narrated by Muslim from Hudhayfah (1/536) No. (772), Ahmad (38/387) No. (23367).",
    "book_id": "1033",
    "new_page_number": 58
  },
  {
    "serial_number": "4931803",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "Remembrance at the Prostration of Recitation (Sujood Tilawah): He says what he says in the Adhkar of prostration in the written prayers. Remembrance upon rising from bowing (Ruku') in the Night Prayer: He says what we mentioned previously of the Adhkar of rising from Ruku', and he may say: \"To my Lord belongs the praise, to my Lord belongs the praise\" (1). Remembrance in the Qunut of Witr: \"O Allah, guide me among those You have guided, heal me among those You have healed, befriend me among those You have befriended, bless me in what You have given, and protect me from the evil of what You have decreed. For indeed You decree and none decrees against You; and indeed he is not humiliated whom You have befriended, nor is he honored whom You have opposed. Blessed are You, our Lord, and Exalted\" (2).",
    "foot_note": "1. Narrated by Al-Nasa'i from Hudhayfah (2/199) No. (1069), Ahmad (38/392) No. (23375). Al-Albani said: (Authentic) Al-Irwa: (335), Sifat Salat al-Nabi: p. (137).\n2. Narrated by Abu Dawud from Al-Hasan bin Ali (2/63) No. (1425). Al-Albani said: (Authentic) Sahih Abi Dawud (5/168) No. (1281), Al-Ta'liqat Al-Hisan (2/280) No. (941), and it is in Al-Sahih Al-Musnad by Al-Wadi'i No. (308).",
    "book_id": "1033",
    "new_page_number": 59
  },
  {
    "serial_number": "4931804",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "And if he wishes, he adds this remembrance: \"O Allah, I seek refuge in Your pleasure from Your anger, in Your forgiveness from Your punishment, and I seek refuge in You from You. I cannot enumerate praise upon You; You are as You have praised Yourself\" (1). Remembrance after the Tasleem of the Witr Prayer: \"Glory be to the King, the Holy\" (*Subhan al-Malik al-Quddus*) (2) three times, raising his voice on the third time. Benefit: Some of what the Messenger, peace and blessings be upon him, used to recite of the Quran in certain prayers: Witr Prayer: The Messenger, peace and blessings be upon him, used to recite in the first Rak'ah Surah Al-A'la: {Glorify the Name of your Lord, the Most High...}, and in the second Rak'ah Surah Al-Kafirun: {Say, O you",
    "foot_note": "1. Narrated by Abu Dawud from Ali bin Abi Talib (2/64) No. (1427). Al-Albani said: (Authentic) Sahih Abi Dawud (5/169) No. (1282), Sahih Al-Jami' Al-Saghir (1/275) No. (1280).\n2. Narrated by Abu Dawud from Ubayy bin Ka'b (2/65) No. (1430), Al-Nasa'i (3/244) No. (1732). Al-Albani said: (Authentic) Sahih Abi Dawud (5/173) No. (1284), Al-Ta'liqat Al-Hisan (4/194) No. (2441).",
    "book_id": "1033",
    "new_page_number": 60
  },
  {
    "serial_number": "4931805",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "disbelievers...}, and in the third Rak'ah Surah Al-Ikhlas: {Say, He is Allah, One...} (1). Sunnah of Fajr: He used to recite in the first Rak'ah Surah Al-Kafirun, and in the second Rak'ah Surah Al-Ikhlas (2). Sometimes he would recite in the first Rak'ah: {Say, \"We have believed in Allah and what has been revealed to us and what has been revealed to Abraham and Ishmael and Isaac and Jacob and the Descendants and what was given to Moses and Jesus and what was given to the prophets from their Lord. We make no distinction between any of them, and we are Muslims [in submission] to Him.\"} [Al-Baqarah: (136)].",
    "foot_note": "1. Narrated by Al-Hakim and he authenticated it, and Al-Dhahabi agreed, from Aisha (2/566) No. (3920), Sahih Ibn Hibban (6/188) No. (2432), Al-Nasa'i (3/235) No. (1701), Ahmad (43/79) No. (25906). The Hadith includes the addition of reading the two Mu'awwidhat in the third Rak'ah. The investigator of Musnad Imam Ahmad, Al-Risala edition, said: Hadith (Authentic due to supporting evidence) without the recitation of the Mu'awwidhat, but Al-Albani authenticated it with the recitation of the Mu'awwidhat. See: Al-Ta'liqat Al-Hisan (4/193) No. (2439), Asl Sifat Salat al-Nabi (2/541).\n2. Narrated by Muslim from Abu Hurairah (1/502) No. (726).",
    "book_id": "1033",
    "new_page_number": 61
  },
  {
    "serial_number": "4931806",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "And in the second: {But when Jesus felt [persistence in] disbelief from them, he said, \"Who are my supporters for [the cause of] Allah?\" The disciples said, \"We are supporters for Allah. We have believed in Allah and testify that we are Muslims.\"} [Ali 'Imran: (52)] Or he would recite instead: {Say, \"O People of the Scripture, come to a word that is equitable between us and you - that we will not worship except Allah and not associate anything with Him and not take one another as lords instead of Allah.\" But if they turn away, then say, \"Bear witness that we are Muslims.\"} [Ali 'Imran: (64)] (1). Friday and Eid Prayers: He used to recite in the first Rak'ah Surah Al-A'la, and in the second Rak'ah Surah Al-Ghashiyah (2) {: Has there come to you the report of the Overwhelming Event?}. Sometimes in Friday prayer, he would recite in the first Rak'ah Surah Al-Jumu'ah: {Whatever is in the heavens and whatever is on the earth is exalting Allah, the Sovereign, the Pure, the Exalted in Might, the Wise}, and Surah Al-Munafiqun: {When the hypocrites come to you, they say, \"We testify that you are the Messenger of Allah\"} in the second Rak'ah (3).",
    "foot_note": "1. Narrated by Muslim from Ibn Abbas (1/502) No. (727).\n2. Narrated by Muslim from An-Nu'man bin Bashir (2/598) No. (878).\n3. Narrated by Muslim from Abu Hurairah (2/597) No. (877).",
    "book_id": "1033",
    "new_page_number": 62
  },
  {
    "serial_number": "4931807",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "Second: Adhkar Reported in the Funeral Prayer (Janazah): As for the Funeral Prayer, it is known that there is no bowing or prostration in it; rather, it consists of four Takbirs (1). After each Takbir, there is a specific remembrance, as follows: Remembrance after the First Takbir: He reads the Opening of the Book (Al-Fatihah) (2), which is: {Praise be to Allah, Lord of the worlds...}. Remembrance after the Second Takbir: He sends prayers upon Muhammad, peace and blessings be upon him (3). It has formulas previously mentioned in the Adhkar of the final Tashahhud. We mention one here: \"O Allah, send prayers upon Muhammad and upon the family of Muhammad, as You sent prayers upon Ibrahim and upon the family of Ibrahim; You are indeed Worthy of Praise, Full of Glory. O Allah, bless",
    "foot_note": "1. Agreed upon: Al-Bukhari (2/89) No. (1333), Muslim (2/657) No. (952) from Jabir bin Abdullah, \"That the Messenger of Allah, peace and blessings be upon him, prayed over Ashamah the Negus, so he said four Takbirs over him.\"\n2. Narrated by Abu Dawud from Talhah (3/210) No. (3198), Al-Tirmidhi (3/337) No. (1027). Al-Albani said: (Authentic) Al-Ta'liqat Al-Hisan (5/71) No. (3060).\n3. Narrated by Al-Hakim from Abu Umamah bin Sahl bin Hunaif (1/512) No. (1331), Al-Shafi'i (1/210) No. (581), Al-Bayhaqi in Al-Sunan Al-Kubra (4/64) No. (6959). Al-Albani said: (Authentic) Ahkam Al-Jana'iz (1/121).",
    "book_id": "1033",
    "new_page_number": 63
  },
  {
    "serial_number": "4931808",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "Muhammad and upon the family of Muhammad, as You blessed Ibrahim and upon the family of Ibrahim; You are indeed Worthy of Praise, Full of Glory\" (1). Remembrance after the Third Takbir: First Supplication: \"O Allah, forgive him, have mercy on him, heal him, pardon him, honor his reception, widen his entrance, wash him with water, snow, and hail, and purify him from sins as You purified the white garment from stains. Exchange for him a home better than his home, a family better than his family, and a spouse better than his spouse. Admit him into Paradise and protect him from the punishment of the grave or from the punishment of the Fire\" (2). Second Supplication: \"O Allah, forgive our living and our dead, our young and our old, our male and our female, our present and our absent. O Allah, whoever You keep alive among us, keep him alive on Faith,",
    "foot_note": "1. Agreed upon: Al-Bukhari from Ka'b bin Ujrah, and the wording is his (4/146) No. (3370), Muslim (1/305) No. (406).\n2. Narrated by Muslim from Awf bin Malik (2/662) No. (963).",
    "book_id": "1033",
    "new_page_number": 64
  },
  {
    "serial_number": "4931809",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "and whoever You cause to die among us, cause him to die on Islam. O Allah, do not deprive us of his reward, and do not lead us astray after him\" (1). Third Supplication: \"O Allah, indeed so-and-so son of so-and-so is in Your protection... and the rope of Your neighborliness, so save him from the trial of the grave and the punishment of the Fire. You are the Possessor of faithfulness and praise. O Allah, forgive him and have mercy on him; indeed, You are the Forgiving, the Merciful\" (2). Fourth Supplication: \"O Allah, Your slave, and the son of Your bondswoman, was in need of Your mercy, and You are free of need of his punishment. If he was a doer of good, then increase his good deeds, and if he was a wrongdoer, then overlook his bad deeds\" (3).",
    "foot_note": "1. Narrated by Abu Dawud from Abu Hurairah (3/211) No. (3201). Al-Albani said: (Authentic) Mishkat al-Masabih (1/527) No. (1675), Ahkam Al-Jana'iz (1/124).\n2. Narrated by Abu Dawud from Wathilah bin Al-Asqa' (3/211) (3202). Al-Albani said: (Authentic) Al-Ta'liqat Al-Hisan (5/72) No. (3063), Ahkam Al-Jana'iz (1/125), and Al-Wadi'i authenticated it in Al-Sahih Al-Musnad No. (1195).\n3. Narrated by Al-Hakim from Yazid bin Abdullah bin Rukana bin Al-Muttalib (1/511) No. (1328) and said: \"Its chain is authentic, and Yazid bin Rukana and Abu Rukana are Companions,\" and Al-Dhahabi agreed. Narrated by Al-Tabarani in \"Al-Kabir\" with the addition as in \"Al-Majma'\" (4/33/34) and Ibn Qani' as in \"Al-Isabah\", and Al-Albani mentioned it in Ahkam Al-Jana'iz (1/125).",
    "book_id": "1033",
    "new_page_number": 65
  },
  {
    "serial_number": "4931810",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "Remembrance after the Fourth Takbir: \"Peace be upon you and the mercy of Allah,\" to his right and to his left (1). If he greets once to his right, that is permissible for him (2). Note: If someone prays the Funeral Prayer after an Imam and says five Takbirs, he may recite after the fourth Takbir one of the supplications we mentioned after the third Takbir, for it is part of the prescribed supplication in the Funeral Prayer. Benefit: If the deceased is a child, he says in the prayer for him: \"O Allah, make him for us a forerunner (3), a predecessor, and a reward\" (4).",
    "foot_note": "1. Narrated by Al-Bayhaqi in Al-Sunan Al-Kubra from Abdullah bin Mas'ud (4/71) No. (6989). Al-Albani said in Ahkam Al-Jana'iz (1/127) (Chain is Hasan, and Al-Nawawi said (5/239): \"A good chain,\" and in \"Majma' Al-Zawa'id\" (3/34): \"Narrated by Al-Tabarani in 'Al-Kabir' and its men are trustworthy\").\n2. Narrated by Al-Daraqutni from Abu Hurairah (2/432) No. (1817). The wording of the Hadith is: That the Messenger of Allah, peace and blessings be upon him, \"prayed over a funeral, said four Takbirs over it, and made one Tasleem.\" Al-Albani said: (Its chain is Hasan) Ahkam Al-Jana'iz (1/129).\n3. (Faratan): One who precedes those coming to water to prepare the place for them. (Salafan): Preceding us to Paradise for our sake. (Ajran): A cause for reward due to our patience in our calamity. [Commentary by Al-Bugha] on Al-Bukhari.\n4. Narrated by Al-Bukhari from Al-Hasan (2/89).",
    "book_id": "1033",
    "new_page_number": 66
  },
  {
    "serial_number": "4931811",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "Benefit: Scholars have mentioned that the Opening Supplication (Istiftaah) is not recommended in the Funeral Prayer, but seeking refuge in Allah from the accursed Satan is said before reciting Al-Fatihah (1). Third: Adhkar Reported in the Two Eid Prayers: Remembrance before reciting Al-Fatihah in the Eid Prayers: He says seven Takbirs in the first Rak'ah, after the Opening Supplication and before reading Al-Fatihah (2), and five Takbirs in the second Rak'ah (3) after standing up from prostration and before the recitation, saying: \"Allahu Akbar.\"",
    "foot_note": "1. Ahkam Al-Jana'iz by Al-Albani (1/119), and Majmu' Fatawa wa Rasa'il Al-Uthaymin (17/119).\n2. Narrated by Abu Dawud from Amr bin Shu'ayb (1/299) No. (1151). Al-Albani said: (Hasan) Irwa al-Ghalil from Aisha (3/106) No. (639).\n3. Narrated by Ibn Majah from Aisha (1/407) No. (1280) and No. (1277), Al-Hakim (3/703) No. (6554), Al-Tirmidhi (2/416) No. (536) from Aisha, that the Messenger of Allah, peace and blessings be upon him, \"said seven and five Takbirs in Al-Fitr and Al-Adha, excluding the two Takbirs of bowing.\" Ahmad (40/422) No. (24362) contains: \"That the Messenger of Allah, peace and blessings be upon him, used to say seven and five Takbirs in the two Eids before the recitation.\"",
    "book_id": "1033",
    "new_page_number": 67
  },
  {
    "serial_number": "4931812",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "Benefit: The Eid prayers do not differ from the written prayers or the confirmed Sunnah prayers in their Adhkar except for the mention of the Takbirs and what is reported regarding recitation after Al-Fatihah. And Allah knows best. Note: No remembrance has been reported from the Prophet, peace and blessings be upon him, between the Takbirs in the Eid prayer; rather, he would pause briefly and then say the next Takbir. Fourth: Remembrance Reported in the Istikhara Prayer: \"O Allah, I ask You for the good by Your knowledge, and I ask You for strength by Your power, and I ask You from Your great bounty. For indeed You are capable and I am not, You know and I do not know, and You are the Knower of the unseen. O Allah, if You know that this matter is good for me in my religion, my livelihood, and the outcome of my affair - or he said: in my immediate and future affair - then decree it for me. And if You know that this matter is bad for me in my religion, my livelihood, and the outcome of",
    "foot_note": "None",
    "book_id": "1033",
    "new_page_number": 68
  },
  {
    "serial_number": "4931813",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "my affair - or he said: in my immediate and future affair - then turn it away from me and turn me away from it, and decree for me the good wherever it is, then make me content with it, and he names his need\" (1). Benefit: The Istikhara supplication is done after the Tasleem of the Istikhara prayer (2). Fifth: Adhkar in the Prayer for Rain (Istisqa): First: \"O Allah, relieve us; O Allah, relieve us; O Allah, relieve us\" (3). Second: \"O Allah, give us rain; O Allah, give us rain; O Allah, give us rain\" (4). Third: \"O Allah, give rain to Your servants and Your animals, spread Your mercy, and revive Your dead land\" (5).",
    "foot_note": "1. Narrated by Al-Bukhari from Jabir (8/81) No. (6382).\n2. Nayl al-Awtar (3/89), Fatawa of the Standing Committee (8/162) No. (10666), Majmu' Fatawa Ibn Baz (11/421), Fatawa Yas'alunaka (1/63). Some scholars said the supplication is said before the Tasleem.\n3. Agreed upon: Al-Bukhari from Anas bin Malik (2/28) No. (1014), Muslim (2/612) No. (897).\n4. Narrated by Al-Bukhari from Anas bin Malik (2/28) No. (1013).\n5. Narrated by Abu Dawud from Amr bin Shu'ayb (1/305) No. (1176). Al-Albani said: (Hasan) Sahih Abi Dawud (4/340) No. (1067), Sahih Al-Jami' Al-Saghir (2/853) No. (4666).",
    "book_id": "1033",
    "new_page_number": 69
  },
  {
    "serial_number": "4931814",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "Fourth: \"O Allah, give us rain that is relieving, wholesome, fertile (1), beneficial not harmful, sooner not later\" (2). Fifth: \"O Allah, give us rain that is wholesome, fertile, encompassing, immediate without delay (3), beneficial not harmful\" (4). Sixth: \"Praise be to Allah, Lord of the worlds, the Most Gracious, the Most Merciful, Master of the Day of Judgment. There is no god but Allah; He does what He intends. O Allah, You are Allah, there is no god but You. You are the Rich (Free of need) and we are the poor. Send down rain upon us, and make what You send down for us strength and sufficiency",
    "foot_note": "1. Mughithan: From Ighathah, which is aid. His saying: \"Mari'an\" means palatable and good, like food that digests well (*Yamru'*). Its meaning: Free from anything that spoils it like destruction or drowning, etc. His saying: \"Mari'an\" means fertile and beneficial, from the valley becoming fertile (*Mari'a*). It is said: A fertile place (*Mari'*). (Sharh Al-Ayni for Abu Dawud (5/16)).\n2. Narrated by Abu Dawud from Jabir bin Abdullah (1/303) No. (1169). Al-Albani said: (Authentic) Mishkat al-Masabih (1/476) No. (1507).\n3. (Ghayra Ra'ith): Meaning not slow or delayed. [Commentary by Muhammad Abd al-Baqi] on Sunan Ibn Majah (1/404).\n4. Narrated by Ibn Majah from Ka'b bin Murrah (1/404) No. (1269). Al-Albani said: (Authentic) Irwa al-Ghalil (2/145).",
    "book_id": "1033",
    "new_page_number": 70
  },
  {
    "serial_number": "4931815",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "for a time\" (1). These remembrances were reported in the sermon for seeking rain. Sixth: Adhkar upon the Eclipse Prayer (Kusuf): Its description is: Two Rak'ahs, with two bowing in each Rak'ah (2). The Muslim must hasten to the remembrance of Allah Almighty: \"So he glorifies, praises, declares oneness, and declares greatness,\" and he likewise hastens to supplication, seeking forgiveness, giving charity, and seeking refuge from the punishment of the grave (3). All of this was reported from the action of the Prophet, peace and blessings be upon him, and his saying to the Companions.",
    "foot_note": "1. Narrated by Abu Dawud from Aisha (1/304) No. (1173), Al-Hakim (1/476) No. (1225). Al-Hakim said: This Hadith is authentic according to the conditions of the Two Sheikhs, though they did not record it. Al-Albani said: (Hasan) Sahih Abi Dawud (4/336) No. (1064), and Sahih Al-Jami' (1/458) No. (2310).\n2. Agreed upon: Al-Bukhari from Aisha (2/40) No. (1065), Muslim (2/620) No. (901).\n3. Agreed upon: Al-Bukhari (2/38) No. (1056), No. (1058), and No. (1059), Muslim (2/628) No. (912) and No. (913) from Abu Musa, who said: The sun eclipsed, so the Prophet, peace and blessings be upon him, stood up in fright, fearing it was the Hour. He came to the mosque and prayed with the longest standing, bowing, and prostration I had ever seen him do. He said: \"These signs that Allah sends are not for the death of anyone nor for his life, but Allah frightens His servants with them. So if you see anything of that, hasten to His remembrance, supplication, and forgiveness.\" And in Muslim from the Hadith of Abd al-Rahman bin Samura: I said: By Allah, I will watch what happened to the Messenger of Allah, peace and blessings be upon him, in the solar eclipse. He said: \"I came to him while he was standing in prayer raising his hands, glorifying, praising, declaring oneness, declaring greatness, and supplicating until it cleared.\" He said: \"When it cleared, he recited two Surahs and prayed two Rak'ahs.\"",
    "book_id": "1033",
    "new_page_number": 71
  },
  {
    "serial_number": "4931816",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "Benefit: It is recommended for the servant, before supplicating, to start by glorifying his Lord Almighty and praising Him, then sending prayers upon the Prophet, peace and blessings be upon him, then supplicating afterwards with whatever he wills (1). Closing Benefit: The scholar Ibn Uthaymeen mentioned that if acts of worship are reported in varied forms, including the supplications and remembrances of prayers, there are five benefits in that: First Benefit: Performing the Sunnah in all its facets. Second Benefit: Preserving the Sunnah, because if one of the forms is neglected, it might be forgotten and not preserved.",
    "foot_note": "1. Narrated by Abu Dawud (2/77) No. (1481), Ibn Khuzaymah (1/351) No. (710). Al-Albani said: (Authentic), Sahih Abi Dawud (5/221) No. (1331). Its wording: From Fadalah bin Ubayd who said: The Messenger of Allah, peace and blessings be upon him, heard a man supplicating in his prayer without glorifying Allah Almighty and without praying upon the Prophet, peace and blessings be upon him. The Messenger of Allah, peace and blessings be upon him, said: \"This one was hasty.\" Then he called him and said to him - or to someone else - \"When one of you prays, let him start by glorifying his Lord Almighty and praising Him, then pray upon the Prophet, peace and blessings be upon him, then supplicate afterwards with whatever he wills.\"",
    "book_id": "1033",
    "new_page_number": 72
  },
  {
    "serial_number": "4931817",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "Third Benefit: Presence of mind regarding what one says of remembrance; for if a person persists on a single remembrance, he begins to say it without his heart being present. But if he deliberately intends to vary them, he achieves presence of heart. Fourth Benefit: A person might choose the easier and simpler one for some reason, thus facilitating matters for himself. Fifth Benefit: Each type contains what isn't in the other, so there is increased praise of Allah Almighty in that (1). Alert: I did not mention the Adhkar of the Tasbih Prayer because most scholars hold the view that what was reported concerning it is not authentic.",
    "foot_note": "1. Majmu' Fatawa wa Rasa'il Al-Uthaymin (13/376), (13/286, 287).",
    "book_id": "1033",
    "new_page_number": 73
  },
  {
    "serial_number": "4931818",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Remembrances of Prayers: Before and After",
    "edition": "Second, 1442 AH - 2022 AD",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "Completed by the praise of Allah and His success,,, Glory be to You and with Your praise, there is no god but You, I seek forgiveness from Allah and I repent to Him * * *",
    "foot_note": "None",
    "book_id": "1033",
    "new_page_number": 74
  }
]