[
  {
    "serial_number": "1304209",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Sunnah Books. Book: At-Tajreed lil-Ahadith al-Umdah fi al-Fiqh (Abstraction of the Hadiths of 'Umdah in Jurisprudence) by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH). Takhrij (Referencing): Abd al-Salam bin Muhammad al-Shuway'ir. Publisher: Rakaez for Publishing and Distribution. Edition: First, 1439 AH - 2018 AD. Number of pages: 86. Gifted to Shamela by: Rakaez for Publishing and Distribution; may Allah reward them with goodness. [Book numbering matches the printed version]. Date of publication in Shamela: 7 Jumada al-Awwal 1443.",
    "foot_note": "None",
    "book_id": "21"
  },
  {
    "serial_number": "1304210",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 3,
    "volume_number": 1,
    "text": "«At-Tajreed» «For the Hadiths of al-Umdah in Fiqh» «By Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah» Takhrij / Abd al-Salam bin Muhammad al-Shuway'ir",
    "foot_note": "None",
    "book_id": "21"
  },
  {
    "serial_number": "1304211",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 5,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. Praise be to Allah, abundant, good, and blessed praise as our Lord loves and is pleased with. I bear witness that there is no god but Allah, and I bear witness that Muhammad is His servant and Messenger, peace and blessings be upon him... To proceed: This is a book in which I have isolated the Hadiths cited by the scholar Sheikh Abu Muhammad Abdullah bin Ahmad Ibn Qudamah in his book «Al-Umdah fi al-Fiqh». In every chapter, he cited its principles and what is relied upon within it, intending to make it accessible for learners and easy for students to memorize. He said in his introduction: (I deposited in it authentic Hadiths, seeking blessings through them and relying upon them, and I ensured they are from the Sahih [authentic collections] so I may dispense with attributing them). So, I stripped the Hadiths of the book, clarified their narrators and sources, and for what was not in the Two Sahihs (Bukhari and Muslim), I pointed out the comments of the Companions and scholars of the art regarding it. I did not change the wording of the Hadiths narrated by the author except for a very small amount where it was necessary, knowing that jurists are lenient in narrating by meaning. I presented the Hadiths in the author's order without change, maintaining his chapter headings as they are, so that whoever reads the original may benefit from this abstraction.",
    "foot_note": "None",
    "book_id": "21"
  },
  {
    "serial_number": "1304212",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 6,
    "volume_number": 1,
    "text": "The Hadiths in his book are of two types: those he explicitly attributed to the Prophet, peace be upon him, and those where he cited the text of the Hadith without referring to the Prophet, peace be upon him, within it; I mention these preceded by the symbol (*). I ask Allah to benefit its writer and reader, and may Allah send peace and blessings upon our Prophet Muhammad.",
    "foot_note": "None",
    "book_id": "21"
  },
  {
    "serial_number": "1304213",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 7,
    "volume_number": 1,
    "text": "Book of Purification\n1 - * On the authority of Abdullah bin Umar, may Allah be pleased with them both, who said: I heard the Messenger of Allah, peace be upon him, say: «If the water reaches two Qullahs (a large measure), it does not carry impurity.» Narrated by Imam Ahmad and Ibn Majah (1), and Ahmad used it as proof (2).\n2 - On the authority of Abu Hurairah, may Allah be pleased with him, that the Prophet, peace be upon him, said: «Pour over the urine of the Bedouin a bucket of water.» Narrated by Imam Ahmad and Al-Bukhari (3).\n\nChapter on Utensils\n3 - On the authority of Hudhayfah bin Al-Yaman, may Allah be pleased with him, that the Prophet, peace be upon him, said: «Do not drink from gold and silver vessels, and do not eat from their plates, for they are for them [disbelievers] in this world and for you in the Hereafter.» Narrated by Imam Ahmad and the Two Sheikhs [Bukhari and Muslim] (4).",
    "foot_note": "1. Narrated by Imam Ahmad (4803), Ibn Majah (517) and the wording is his.\n2. Abu Dawood said in his (Masa'il 2): I heard Ahmad bin Hanbal say: (The Messenger of Allah, peace be upon him, said: 'If the water reaches two Qullahs, it does not carry impurity.' Ahmad said: If its taste or smell changes, it is drawn out until it becomes good).\n3. Narrated by Imam Ahmad (7799), and Al-Bukhari (220).\n4. Narrated by Imam Ahmad (23364), Al-Bukhari (5426), and Muslim (5521).",
    "book_id": "21"
  },
  {
    "serial_number": "1304214",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 8,
    "volume_number": 1,
    "text": "4 - On the authority of Jabir, may Allah be pleased with him, that the Prophet, peace be upon him, said—regarding the sea—: «Its water is purifying, and its dead [animals] are lawful.» Narrated by Imam Ahmad and Ibn Majah (1).\n\nChapter on Relieving Oneself\n5 - On the authority of Abu Ayyub Al-Ansari, may Allah be pleased with him, that the Prophet, peace be upon him, said: «Do not face the Qiblah while defecating or urinating, nor turn your back towards it.» Narrated by Imam Ahmad, the Two Sheikhs, and At-Tirmidhi, and the wording is his (2).\n\nChapter on Wudu (Ablution)\n6 - On the authority of Umar bin Al-Khattab, may Allah be pleased with him, that the Prophet, peace be upon him, said: «Actions are but by intentions, and every person will have only what he intended.» Narrated by Imam Ahmad and the Two Sheikhs (3).",
    "foot_note": "1. Narrated by Imam Ahmad (15012) and Ibn Majah (388). Imam Ahmad used Jabir's hadith as proof. Ibn al-Sakan said: (The hadith of Jabir is the most authentic narration in this chapter). It was also narrated from Abu Hurairah by: Imam Ahmad (8735), Abu Dawood (83), At-Tirmidhi (69), An-Nasa'i (59), and Ibn Majah (386).\n2. Imam Ahmad (23579), Al-Bukhari (394), Muslim (632), and At-Tirmidhi (8).\n3. Narrated by Imam Ahmad (168), Al-Bukhari (1) and the wording is his, and Muslim (5036).",
    "book_id": "21"
  },
  {
    "serial_number": "1304215",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 9,
    "volume_number": 1,
    "text": "7 - On the authority of Abu Hurairah, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «Were it not that I would overburden my nation, I would have ordered them to use the Siwak (toothstick) at [the time of] every prayer.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n\nChapter on Wiping Over the Khuffs (Leather Socks)\n8 - On the authority of Ali bin Abi Talib, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «The traveler wipes for three days and their nights, and the resident for one day and one night.» Narrated by Imam Ahmad and Muslim (2).\n\nChapter on Nullifiers of Wudu\n9 - On the authority of Jabir bin Samurah, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, was asked: Should we perform Wudu due to [eating] camel meat? He said: «Yes, perform Wudu from it.» It was said: Should we perform Wudu due to sheep meat? He said: «If you wish, perform Wudu, and if you wish, do not.» Narrated by Imam Ahmad and Muslim (3).",
    "foot_note": "1. Narrated by Imam Ahmad (607) and the wording is his, Al-Bukhari (847), and Muslim (612).\n2. Narrated by Imam Ahmad (748) and Muslim (661).\n3. Narrated by Imam Ahmad (20955) and Muslim (828).",
    "book_id": "21"
  },
  {
    "serial_number": "1304216",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 10,
    "volume_number": 1,
    "text": "Chapter on Ghusl (Ritual Bath) from Janabah (Sexual Impurity)\n10 - On the authority of Maimunah bint Al-Harith, may Allah be pleased with her, who said: «I screened the Prophet, peace be upon him, and he performed Ghusl from Janabah. He started by washing his hands, then poured water with his right hand over his left and washed his private parts and what was affected. Then he struck his hand on the wall and the earth, then he performed Wudu as he does for prayer, then he poured water over his body, then he moved aside and washed his feet.» Narrated by Imam Ahmad and Al-Bukhari (1).\n\nChapter on Tayammum (Dry Ablution)\n11 - On the authority of Ammar bin Yasir, may Allah be pleased with them both, that the Messenger of Allah, peace be upon him, said to him: «It would have been sufficient for you to do this,» and he struck his hands on the earth and wiped his face and palms with them. Narrated by Imam Ahmad and An-Nasa'i (2), and authenticated by Imam Ahmad (3).",
    "foot_note": "1. Narrated by Imam Ahmad (26856), and Al-Bukhari (281) with a similar wording.\n2. Narrated by Imam Ahmad (18887), and An-Nasa'i (317). At the end of it: (once).\n3. Fath al-Bari by Ibn Rajab 2/61.",
    "book_id": "21"
  },
  {
    "serial_number": "1304217",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 11,
    "volume_number": 1,
    "text": "Chapter on Menstruation\n12 - On the authority of Anas bin Malik, may Allah be pleased with him, that the Prophet, peace be upon him, said: «Do everything except intercourse.» Narrated by Imam Ahmad, Abu Dawood, and Muslim (1).",
    "foot_note": "1. Narrated by Imam Ahmad (12354), Muslim (720), and Abu Dawood (258) and the wording is his.",
    "book_id": "21"
  },
  {
    "serial_number": "1304218",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 13,
    "volume_number": 1,
    "text": "Book of Prayer\n13 - On the authority of Ubadah bin As-Samit, may Allah be pleased with him, who said: I heard the Messenger of Allah, peace be upon him, say: «Five prayers that Allah has prescribed upon the servants. Whoever performs them and does not waste anything of them making light of their right, he has a covenant with Allah that He will admit him into Paradise. And whoever does not bring them, he has no covenant with Allah; if He wills, He punishes him, and if He wills, He forgives him.» Narrated by Imam Ahmad, Abu Dawood, and An-Nasa'i (1).\n\nChapter on Adhan and Iqamah\n14 - On the authority of Ibn Umar, may Allah be pleased with them both, that the Prophet, peace be upon him, said: «Bilal calls the Adhan at night, so eat and drink until Ibn Umm Maktum calls the Adhan.» Narrated by Imam Ahmad and the Two Sheikhs (2).",
    "foot_note": "1. Narrated by Imam Ahmad (22693) and the wording is his, Abu Dawood (1422), and An-Nasa'i (461). The author cited it with different wordings, and the closest to his context is the narration of Imam Ahmad which I established. It appeared in the author's text as: (Whoever preserves them has a covenant with Allah to admit him to Paradise). Abu Nu'aym narrated it in (Al-Hilyah 5/131), then said: (Strange from the hadith of Al-Sunabihy from Ubadah, and its famous narration is Ibn Muhayriz from Al-Makhdaji from Ubadah), meaning the mentioned narration.\n2. Narrated by Imam Ahmad (4551), Al-Bukhari (622), and Muslim (2590).",
    "book_id": "21"
  },
  {
    "serial_number": "1304219",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 14,
    "volume_number": 1,
    "text": "15 - On the authority of Abu Sa'id Al-Khudri, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «When you hear the call [to prayer], say the like of what he says.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n\nChapter on Conditions of Prayer\n16 - On the authority of Abu Hurairah, may Allah be pleased with him, that the Prophet, peace be upon him, said: «Allah does not accept the prayer of one who nullifies his ablution until he performs Wudu.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n17 - On the authority of Abu Sa'id Al-Khudri, may Allah be pleased with him, that the Prophet, peace be upon him, said: «Silk and gold are forbidden for the males of my nation, and lawful for their females.» Narrated by Imam Ahmad, At-Tirmidhi, and An-Nasa'i (3), and Imam Ahmad used it as proof and mentioned that it is the most established narration on the subject (4).",
    "foot_note": "1. Narrated by Imam Ahmad (11742) and the wording is his, Al-Bukhari (611), and Muslim (874).\n2. Narrated by Imam Ahmad (8222), Al-Bukhari (135) and the wording is his, and Muslim (559).\n3. Narrated by Imam Ahmad (19515), At-Tirmidhi (1720), and An-Nasa'i (8/190).\n4. Al-Athram said: I said to Abu Abdullah: 'Gold for women, what do you say about it?' He said: 'As for women, it is permissible if she does not display it except to her husband.' I said to him: 'Which hadith on this is most established?' He said: 'Is it not in the hadith of Sa'id bin Abi Hind?' I said: 'That is Mursal.' He said: 'Even so.' [Ahkam al-Nisa by Al-Khallal 86]. Meaning that Sa'id bin Abi Hind did not meet Abu Sa'id Al-Khudri.",
    "book_id": "21"
  },
  {
    "serial_number": "1304220",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 15,
    "volume_number": 1,
    "text": "Chapter on Etiquette of Walking to Prayer\n18 - On the authority of Abu Hurairah, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «If the prayer is established, do not come to it running, but come to it walking, and you must have tranquility. Whatever you catch [of the prayer], pray it, and whatever you missed, complete it.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n\nChapter on Description of Prayer\n19 - Anas, may Allah be pleased with him, said: «I prayed behind the Prophet, peace be upon him, Abu Bakr, Umar, and Uthman, and I did not hear any of them recite 'Bismillah Ar-Rahman Ar-Rahim' aloud.» Narrated by Imam Ahmad and Muslim (2).\n20 - On the authority of Abdullah bin Masud, may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, said to us: «When one of you sits in the prayer, let him say: Attahiyyat (Salutations) are for Allah, and prayers and good things. Peace be upon you, O Prophet, and the mercy of Allah and His blessings. Peace be",
    "foot_note": "1. Narrated by Imam Ahmad (9835), Al-Bukhari (866), and Muslim (1389).\n2. Narrated by Imam Ahmad (12845), and Muslim (918). This wording is in An-Nasa'i (907).",
    "book_id": "21"
  },
  {
    "serial_number": "1304221",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 16,
    "volume_number": 1,
    "text": "be upon us and upon the righteous servants of Allah. I bear witness that there is no god but Allah, and I bear witness that Muhammad is His servant and Messenger.» Narrated by Imam Ahmad and the Two Sheikhs (1). Abu Muhammad Ibn Qudamah said: (This is the most authentic narration reported from the Prophet, peace be upon him, regarding the Tashahhud).\n\nChapter on the Two Prostrations of Forgetfulness\n21 - On the authority of Abu Qatadah, may Allah be pleased with him: «That the Messenger of Allah, peace be upon him, used to pray while carrying Umamah bint Zainab bint Rasool Allah, peace be upon him. When he stood up, he carried her, and when he prostrated, he put her down.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n22 - On the authority of Aisha, may Allah be pleased with her, who said: «I asked for the door to be opened while the Messenger of Allah, peace be upon him, was praying. He walked until he opened it for me, then returned to his place where he was.» Narrated by Imam Ahmad, Abu Dawood, At-Tirmidhi, and An-Nasa'i (3), and Imam Ahmad used it as proof (4).",
    "foot_note": "1. Narrated by Imam Ahmad (3562), Al-Bukhari (6946), and Muslim (924).\n2. Narrated by Imam Ahmad (22519), Al-Bukhari (494), and Muslim (1240).\n3. Narrated by Imam Ahmad (25503), Abu Dawood (923), At-Tirmidhi (601) and he graded it Hasan, and An-Nasa'i (1206).\n4. Imam Ahmad used it as proof as in (Masa'il Abdullah 362). However, Abdullah reported in (Al-Ilal 467): (He said: I asked my father about a hadith narrated by Burd bin Sinan, from Az-Zuhri, from Urwah, from Aisha: from the Prophet, peace be upon him: 'That he was praying and I asked for the door to be opened, so the Prophet, peace be upon him, came and opened the door and continued his prayer.' I said to my father: What is the status of this hadith? My father said: 'No one narrated this hadith from the Prophet, peace be upon him, other than Burd, and it is a Munkar [denounced] hadith; Az-Zuhri does not bear such a hadith').",
    "book_id": "21"
  },
  {
    "serial_number": "1304222",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 17,
    "volume_number": 1,
    "text": "Chapter on Voluntary Prayer\n23 - Ibn Umar, may Allah be pleased with them both, said: «I preserved ten rak'ahs from the Messenger of Allah, peace be upon him; two rak'ahs before Dhuhr, two rak'ahs after it, two rak'ahs after Maghrib in his house, two rak'ahs after Isha in his house, and two rak'ahs before the Fajr prayer.» Hafsa narrated to me: «That the Messenger of Allah, peace be upon him, used to pray two rak'ahs when dawn broke and the Mu'adhin called the Adhan.» Narrated by Imam Ahmad and Al-Bukhari (1).\n24 - * On the authority of Ibn Umar, may Allah be pleased with them both, that the Prophet, peace be upon him, said: «Night prayer is two by two.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n25 - * On the authority of Abdullah bin Amr, may Allah be pleased with them both, that the Prophet, peace be upon him, said: «The prayer of the sitting person is half the prayer of the standing person.» Narrated by Imam Ahmad and Muslim (3).",
    "foot_note": "1. Narrated by Imam Ahmad (5417), and Al-Bukhari (1180) and the wording is his.\n2. Narrated by Imam Ahmad (4848), Al-Bukhari (948), and Muslim (1785).\n3. Narrated by Imam Ahmad (6512), Muslim (735), and this is Ahmad's wording.",
    "book_id": "21"
  },
  {
    "serial_number": "1304223",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 18,
    "volume_number": 1,
    "text": "Chapter on Imamate (Leading Prayer)\n26 - On the authority of Abu Mas'ud Al-Badri, may Allah be pleased with him, that the Prophet, peace be upon him, said: «The one who is most versed in the Book of Allah leads the people. If they are equal in recitation, then the most knowledgeable of the Sunnah. If they are equal in the Sunnah, then the earliest in migration (Hijrah). If they are equal in migration, then the oldest in age. A man should not lead another man in his domain (authority), nor should he sit in his house on his place of honor except with his permission.» Narrated by Imam Ahmad and Muslim (1).\n27 - On the authority of Malik bin Al-Huwayrith, may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, said: «When prayer time arrives, let one of you call the Adhan, and let the oldest of you lead you.» Narrated by Imam Ahmad and the Two Sheikhs (2).",
    "foot_note": "1. Narrated by Imam Ahmad (17097), Muslim (1564) and the wording is his except for (let the oldest in age lead them) which is in Ahmad, while Muslim's wording is: (earliest in Islam/submission) which carries the meaning.\n2. Narrated by Imam Ahmad (15598), Al-Bukhari (6819), and Muslim (1567). The author cited it in the dual form (let one of you two... the older of you two): this is found in Ibn Hibban (2130) and Abu Nu'aym in (Al-Mustakhraj 1509).",
    "book_id": "21"
  },
  {
    "serial_number": "1304224",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 19,
    "volume_number": 1,
    "text": "Chapter on the Prayer of the Sick\n28 - On the authority of Imran bin Husain, may Allah be pleased with him, that the Prophet, peace be upon him, said to him: «Pray standing; if you cannot, then sitting; and if you cannot, then on your side.» Narrated by Imam Ahmad and Al-Bukhari (1).",
    "foot_note": "1. Narrated by Imam Ahmad (19819), and Al-Bukhari (1117).",
    "book_id": "21"
  },
  {
    "serial_number": "1304225",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 21,
    "volume_number": 1,
    "text": "Book of Funerals\n29 - On the authority of Sa'd bin Abi Waqqas, may Allah be pleased with him, who said: «Make a niche (Lahd) for me in the grave, and set up bricks over me as was done for the Messenger of Allah, peace be upon him.» Narrated by Imam Ahmad and Muslim (1).",
    "foot_note": "1. Narrated by Imam Ahmad (1450), and Muslim (2284).",
    "book_id": "21"
  },
  {
    "serial_number": "1304226",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 23,
    "volume_number": 1,
    "text": "Book of Zakat\n30 - On the authority of Abu Sa'id Al-Khudri, may Allah be pleased with him, who said: The Prophet, peace be upon him, said: «There is no charity (Zakat) on grains or dates until they reach five Awsaq (loads). And there is no charity on fewer than five camels. And there is no charity on less than five Awqiyah (of silver).» Narrated by Imam Ahmad and the Two Sheikhs (1).\n\nChapter on Who May Receive Zakat\n31 - On the authority of Salamah bin Sakhr Al-Ansari, may Allah be pleased with him: «That the Prophet, peace be upon him, ordered Banu Zuraiq to pay their charity to him.» Narrated by Imam Ahmad, Abu Dawood, At-Tirmidhi, and Ibn Majah (2).\n32 - On the authority of Qabisah bin Mukhariq Al-Hilali, may Allah be pleased with him, that the Prophet, peace be upon him, said to him: «Stay, O Qabisah, until the charity comes to us so we may order it for you.» Narrated by Imam Ahmad and Muslim (3).",
    "foot_note": "1. Narrated by Imam Ahmad (11697) and the wording is his, Al-Bukhari (1405), and Muslim (2314). The author restricted himself to the first sentence, and I mentioned the complete hadith.\n2. Narrated by Imam Ahmad (16421), Abu Dawood (2215), At-Tirmidhi (3299), Ibn Majah (2062), and At-Tirmidhi said: (This hadith is Hasan).\n3. Narrated by Imam Ahmad (20601), and Muslim (2451). This is the wording of Abu Dawood (1642) and An-Nasa'i (2580).",
    "book_id": "21"
  },
  {
    "serial_number": "1304227",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 25,
    "volume_number": 1,
    "text": "Book of Fasting\n33 - * On the authority of Abdullah bin Amr, may Allah be pleased with them both, that the Prophet, peace be upon him, said: «The best fasting is the fasting of David, peace be upon him; he used to fast one day and break fast one day.» Narrated by Imam Ahmad, the Two Sheikhs, and An-Nasa'i (1).\n34 - * On the authority of Abu Hurairah, may Allah be pleased with him, that the Prophet, peace be upon him, said: «The best fasting after the month of Ramadan is the fasting of Allah's month, Muharram.» Narrated by Imam Ahmad and Muslim (2).\n35 - * On the authority of Ibn Abbas, may Allah be pleased with them both, that the Prophet, peace be upon him, said: «There are no days wherein righteous deeds are more beloved to Allah than these ten of Dhu al-Hijjah.» Narrated by Imam Ahmad and Al-Bukhari (3).\n36 - * On the authority of Abu Ayyub Al-Ansari, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «Whoever fasts Ramadan and follows it with six [days] from Shawwal, it is as if he fasted for the whole year.» Narrated by Imam Ahmad and Muslim (4).",
    "foot_note": "1. Narrated by Imam Ahmad (6491), Al-Bukhari (3420), Muslim (2796), and An-Nasa'i (2388) and the wording is his. In Ahmad and the Two Sheikhs it is (Most beloved fasting).\n2. Narrated by Imam Ahmad (8507) and the wording is his, and Muslim (2813).\n3. Narrated by Imam Ahmad (1968) and the wording is his, and Al-Bukhari (969).\n4. Narrated by Imam Ahmad (23533) and the wording is his, and Muslim (2815).",
    "book_id": "21"
  },
  {
    "serial_number": "1304228",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 26,
    "volume_number": 1,
    "text": "37 - * On the authority of Abu Qatadah, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «Fasting the day of Arafah expiates two years: a past year and a coming year. And fasting the day of Ashura expiates a year.» Narrated by Imam Ahmad and Muslim (1).\n38 - * On the authority of Umm Hani, may Allah be pleased with her, that the Messenger of Allah, peace be upon him, said: «The voluntary faster is the commander of himself; if he wishes he fasts, and if he wishes he breaks the fast.» Narrated by Imam Ahmad and At-Tirmidhi (2).\n39 - On the authority of Abu Sa'id Al-Khudri, may Allah be pleased with him: «That the Messenger of Allah, peace be upon him, forbade fasting on two days: the Day of Fitr (Eid al-Fitr) and the Day of Nahr (Eid al-Adha).» Narrated by Imam Ahmad and Al-Bukhari (3).\n40 - On the authority of Yunus bin Shaddad, may Allah be pleased with him: «That the Messenger of Allah, peace be upon him, forbade fasting on the days of Tashreeq.» Narrated by Imam Ahmad (4).\n41 - * On the authority of Aisha, may Allah be pleased with her, that the Messenger of Allah, peace be upon him, said: «Seek Laylat al-Qadr in the odd nights of the last ten of Ramadan.» Narrated by Al-Bukhari (5).",
    "foot_note": "1. Narrated by Imam Ahmad (22588) and the wording is his, and Muslim (2803).\n2. Narrated by Imam Ahmad (26893) and the wording is his, and At-Tirmidhi (732).\n3. Narrated by Imam Ahmad (11409) and the wording is his, and Al-Bukhari (1765).\n4. Narrated by Imam Ahmad (16706) with this wording, and there is support for it in the Sahih from the hadith of Nubaishah Al-Hudhali and Ka'b bin Malik, may Allah be pleased with them.\n5. Narrated by Imam Ahmad (24445), Al-Bukhari (1913) and the wording is his, and Muslim (2833).",
    "book_id": "21"
  },
  {
    "serial_number": "1304229",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 27,
    "volume_number": 1,
    "text": "Book of Hajj\n42 - * On the authority of Ibn Abbas, may Allah be pleased with them both, who said: The Messenger of Allah, peace be upon him, designated Dhul-Hulaifah for the people of Medina, Al-Juhfah for the people of Sham (Levant), Qarn al-Manazil for the people of Najd, and Yalamlam for the people of Yemen. He said: «They are for them and for those who come upon them from other than their people who intend Hajj and Umrah. Whoever is closer [to Mecca] than them, then [he starts] from his family (location), and so on until the people of Mecca assume Ihram from it.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n43 - On the authority of Ata' who said: «The Prophet, peace be upon him, entered from the gate of Banu Shaybah.» Al-Bayhaqi said: (This is Mursal Jayyid, and it was narrated from Ibn Umar in Marfu' form but its chain is not preserved) (2).\n44 - * On the authority of Jabir, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «I stood here, and all of Arafah is a standing place.» Narrated by Imam Ahmad and Muslim (3).",
    "foot_note": "1. Narrated by Imam Ahmad (2240), Al-Bukhari (1526), and Muslim (2860).\n2. As-Sunan Al-Kubra by Al-Bayhaqi 5/72. The hadith of Ibn Umar was narrated by At-Tabarani in (Al-Awsat 491) and (Al-Kabir 11/158). Perhaps the reason the author cited this hadith even though it is not from the Sahihs is that he mentioned in (Al-Mughni) that Muslim narrated it, and the commentator followed him [9/75], as did Ibn al-Munja [2/166] and others.\n3. Narrated by Imam Ahmad (14440), and Muslim (3011).",
    "book_id": "21"
  },
  {
    "serial_number": "1304230",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 28,
    "volume_number": 1,
    "text": "45 - * And on the authority of Jabir, may Allah be pleased with him: «That the Messenger of Allah, peace be upon him, came to the standing place (Mawqif) and placed the belly of his she-camel Al-Qaswa towards the rocks, and put the path of the pedestrians in front of him, and faced the Qiblah. He remained standing until the sun set and the yellowness disappeared a little.» Narrated by Muslim (1).\n\nChapter on Hady (Sacrificial Animal) and Udhiyah (Sacrifice)\n46 - * On the authority of Al-Bara' bin Azib, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, was asked: What should be avoided in sacrificial animals? He said: «Four are not sufficient: The lame one whose lameness is obvious, the one-eyed whose defect is obvious, the sick whose sickness is obvious, and the emaciated one that has no marrow.» Narrated by Imam Ahmad and the People of Sunan (2).\n47 - On the authority of Abdullah bin Abbas, may Allah be pleased with them both, who said: «The Messenger of Allah, peace be upon him, sacrificed one hundred camels during Hajj, and he ordered a piece from every camel to be put in a pot, so he ate from it and drank from its broth.» Narrated by Imam Ahmad and Ibn Majah (3).",
    "foot_note": "1. Narrated by Muslim (3009).\n2. Narrated by Imam Ahmad (18675), Abu Dawood (2802), At-Tirmidhi (1497), An-Nasa'i (4371), and Ibn Majah (3144). The wording is Ahmad's.\n3. Narrated by Imam Ahmad (2880), and Ibn Majah (3158). The wording is Ahmad's except his saying: (he ordered a piece from every camel) which is from Ibn Majah to agree with what Al-Muwaffaq mentioned.",
    "book_id": "21"
  },
  {
    "serial_number": "1304231",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 29,
    "volume_number": 1,
    "text": "48 - On the authority of Umm Salamah, may Allah be pleased with her: That the Prophet, peace be upon him, said: «Whoever intends to sacrifice and the ten [days of Dhul-Hijjah] enter, let him not take anything from his hair or his skin until he sacrifices.» Narrated by Imam Ahmad and Muslim (1).\n\nChapter on Aqiqah\n49 - * On the authority of Umm Kurz Al-Ka'biyyah, may Allah be pleased with her, that the Prophet, peace be upon him, said: «For a boy, two equal sheep, and for a girl, one sheep.» Narrated by Imam Ahmad and An-Nasa'i (2).",
    "foot_note": "1. Narrated by Imam Ahmad (26654), and Muslim (5232).\n2. Narrated by Imam Ahmad (27142), and An-Nasa'i (4216). Ahmad said: (Mukafa'atan: equal or similar) [Masa'il Abu Dawood 1633].",
    "book_id": "21"
  },
  {
    "serial_number": "1304232",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 31,
    "volume_number": 1,
    "text": "Book of Sales\n50 - On the authority of Abu Mas'ud Al-Ansari, may Allah be pleased with him: «That the Messenger of Allah, peace be upon him, forbade the price of a dog.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n51 - On the authority of Abdullah bin Umar, may Allah be pleased with them both, who said: The Messenger of Allah, peace be upon him, said: «Whoever keeps a dog, except a dog for hunting or livestock, two Qirats will be deducted from his deeds every day.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n52 - On the authority of Abu Hurairah, may Allah be pleased with him: «That the Messenger of Allah, peace be upon him, forbade Mulamasah (touching sale) and Munabadhah (tossing sale).» Narrated by Imam Ahmad and the Two Sheikhs (3).\n53 - On the authority of Abu Hurairah, may Allah be pleased with him, who said: «The Messenger of Allah, peace be upon him, forbade the sale of the pebble (Hasah) and the sale of uncertainty (Gharar).» Narrated by Imam Ahmad and Muslim (4).\n54 - On the authority of Abu Hurairah, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «A man should not sell over the sale of his brother.» Narrated by Imam Ahmad and the Two Sheikhs (5).",
    "foot_note": "1. Narrated by Imam Ahmad (17070), Al-Bukhari (2162), and Muslim (4092).\n2. Narrated by Imam Ahmad (5254) and the wording is his, Al-Bukhari (5165), and Muslim (4110).\n3. Narrated by Imam Ahmad (8935), Al-Bukhari (2039), and Muslim (3874).\n4. Narrated by Imam Ahmad (7411), and Muslim (3881).\n5. Narrated by Imam Ahmad (9310), Al-Bukhari (2140), and Muslim (3890).",
    "book_id": "21"
  },
  {
    "serial_number": "1304233",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 32,
    "volume_number": 1,
    "text": "55 - On the authority of Abdullah bin Abbas, may Allah be pleased with them both, who said: «The Messenger of Allah, peace be upon him, forbade meeting the riders [to buy goods before they reach the market], and that a city dweller sell for a desert dweller.» It was said to Ibn Abbas: What is his saying «a city dweller for a desert dweller?» He said: (He should not be a broker for him). Narrated by Imam Ahmad and the Two Sheikhs (1).\n56 - On the authority of Abdullah bin Umar, may Allah be pleased with them both: «That the Messenger of Allah, peace be upon him, forbade Najsh (bidding up price without intent to buy).» Narrated by Imam Ahmad and the Two Sheikhs (2).\n57 - On the authority of Abu Hurairah, may Allah be pleased with him, who said: «The Messenger of Allah, peace be upon him, forbade two sales in one sale.» Narrated by Imam Ahmad, At-Tirmidhi, and An-Nasa'i (3).\n58 - On the authority of Abdullah bin Umar, may Allah be pleased with them both, that the Messenger of Allah, peace be upon him, said: «Do not meet the goods until they are brought down to the markets.» Narrated by Imam Ahmad, the Two Sheikhs, and Abu Dawood (4).\n59 - On the authority of Abdullah bin Umar, may Allah be pleased with them both, that the Messenger of Allah, peace be upon him, said: «Whoever",
    "foot_note": "1. Narrated by Imam Ahmad (3482), Al-Bukhari (2158), and Muslim (3900).\n2. Narrated by Imam Ahmad (4531), Al-Bukhari (6562), and Muslim (3893).\n3. Narrated by Imam Ahmad (9584), At-Tirmidhi (1231), and An-Nasa'i (4632).\n4. Narrated by Imam Ahmad (5304), Al-Bukhari (2165), Muslim (3894), and Abu Dawood (3438) and the wording is his.",
    "book_id": "21"
  },
  {
    "serial_number": "1304234",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 33,
    "volume_number": 1,
    "text": "buys food, let him not sell it until he receives it in full.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n\nChapter on Riba (Usury)\n60 - On the authority of Ubadah bin As-Samit, may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, said: «Gold for gold, silver for silver, wheat for wheat, barley for barley, dates for dates, and salt for salt, like for like, equal for equal, hand to hand. If these types differ, then sell as you wish if it is hand to hand. Whoever increases or asks for increase has committed Riba.» Narrated by Imam Ahmad and Muslim (2).\n61 - On the authority of Abu Sa'id Al-Khudri, may Allah be pleased with him: «That the Prophet, peace be upon him, forbade Muzabanah.» And Muzabanah is: buying [fresh] dates on the palm trees with [dry] dates. Narrated by Imam Ahmad and the Two Sheikhs (3).\n62 - On the authority of Abu Hurairah, may Allah be pleased with him: «That the Prophet, peace be upon him, granted a concession for the sale of",
    "foot_note": "1. Narrated by Imam Ahmad (4736), Al-Bukhari (2029), and Muslim (3919). The wording is Ahmad's and Muslim's.\n2. Narrated by Imam Ahmad (22683), and Muslim (4147). The wording is Muslim's, except for the last sentence: (Whoever increases or asks for increase has committed Riba) which is not in the Sahih from the hadith of Ubadah, but is in (Al-Musnad) and in An-Nasa'i (4563).\n3. Narrated by Imam Ahmad (11052) and the wording is his, Al-Bukhari (2074), and Muslim (4016).",
    "book_id": "21"
  },
  {
    "serial_number": "1304235",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 34,
    "volume_number": 1,
    "text": "Araya [dates on tree for fresh dates] in what is less than five Awsuq or in five.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n\nChapter on Sale of Assets and Fruits\n63 - On the authority of Abdullah bin Umar, may Allah be pleased with them both, who said: I heard the Messenger of Allah, peace be upon him, say: «Whoever buys palm trees after they have been pollinated, its fruit belongs to the seller, unless the buyer stipulates it.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n64 - On the authority of Ibn Umar, may Allah be pleased with them both, who said: «The Messenger of Allah, peace be upon him, forbade the sale of fruits until their suitability appears [they ripen].» Narrated by Imam Ahmad and the Two Sheikhs (3).\n65 - On the authority of Jabir bin Abdullah, may Allah be pleased with them both, that the Messenger of Allah, peace be upon him, said: «If you sold fruits to your brother and they were struck by a calamity, it is not lawful for you to take anything from him; why would you take your brother's wealth unjustly?» Narrated by Imam Ahmad and Muslim (4).",
    "foot_note": "1. Narrated by Imam Ahmad (7236), Al-Bukhari (2190), and Muslim (3973). The wording is from the Two Sahihs.\n2. Narrated by Imam Ahmad (4552), Al-Bukhari (2379), and Muslim (3986). The wording is Al-Bukhari's.\n3. Narrated by Imam Ahmad (4525), Al-Bukhari (1486), and Muslim (3941).\n4. Narrated by Imam Ahmad (14320), and Muslim (4058) and the wording is his.",
    "book_id": "21"
  },
  {
    "serial_number": "1304236",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 35,
    "volume_number": 1,
    "text": "Chapter on Option (Khiyar)\n66 - * On the authority of Hakim bin Hizam and Ibn Umar, may Allah be pleased with them, that the Prophet, peace be upon him, said: «The two parties to a sale have the option [to cancel] as long as they have not separated.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n67 - * And on the authority of Ibn Umar, may Allah be pleased with them both, that the Prophet, peace be upon him, said: «If they separate after they have made the deal and neither one of them cancelled the sale, then the sale becomes binding.» Narrated by Muslim (2).\n68 - On the authority of Abu Hurairah, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «Do not withhold milk in camels and sheep [to make them look fuller]. Whoever buys them after that has the better of the two views after he milks them: if he is pleased with it, he keeps it, and if he is displeased with it, he returns it along with a Sa' of dates.» Narrated by Imam Ahmad and the Two Sheikhs (3).",
    "foot_note": "1. Narrated by Imam Ahmad (15314), Al-Bukhari (2008), Muslim (3937): from the hadith of Hakim bin Hizam. And narrated by Imam Ahmad (4566), Al-Bukhari (2003), Muslim (3930): from the hadith of Ibn Umar.\n2. Narrated by Muslim (3934).\n3. Narrated by Imam Ahmad (10004), Al-Bukhari (2041), and Muslim (3890). The wording is Ahmad's and Muslim's.",
    "book_id": "21"
  },
  {
    "serial_number": "1304237",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 36,
    "volume_number": 1,
    "text": "Chapter on Salam (Advance Payment Sale)\n69 - On the authority of Abdullah bin Abbas, may Allah be pleased with them both, who said: The Messenger of Allah, peace be upon him, came to Medina while they were paying in advance for fruits for a year or two years. He said: «Whoever pays in advance for fruit (1), let him pay in advance for a known measure and a known weight to a known term.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n\nChapter on Loan\n70 - On the authority of Abu Rafi', may Allah be pleased with him, that the Messenger of Allah, peace be upon him, borrowed a young camel from a man. Then camels from the charity camels came to him, so he ordered Abu Rafi' to pay the man back his camel. Abu Rafi' returned to him and said: (I did not find among them except a choice four-year-old camel). He said: «Give it to him, for the best of people are the best of them in repayment.» Narrated by Imam Ahmad and Muslim (3).",
    "foot_note": "1. His saying in the hadith: (for fruit 'thamar'), this is how Al-Muwaffaq and other jurists cited it. An-Nawawi mentioned in (Sharh Muslim 11/41) that most original manuscripts have 'tamr' (dates) with two dots, and some have 'thamar' (fruits) with three dots.\n2. Narrated by Imam Ahmad (2548), Al-Bukhari (2125), and Muslim (4202), and the wording is his.\n3. Narrated by Imam Ahmad (27181), and Muslim (4192). The context is his, but the wording of the hadith is from Imam Ahmad; what is in Muslim is the word: (Give him).",
    "book_id": "21"
  },
  {
    "serial_number": "1304238",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 37,
    "volume_number": 1,
    "text": "Chapter on Rulings of Debt\n71 - On the authority of Abu Hurairah, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «Whoever finds his property itself with a person who has become bankrupt, he is more entitled to it than others.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n\nChapter on Hawalah (Transfer of Debt)\n72 - On the authority of Abu Hurairah, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «If one of you is transferred to a wealthy person [to settle a debt], let him accept the transfer.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n\nChapter on Partnership\n73 - It was narrated from Abdullah bin Masud, may Allah be pleased with him, who said: (I, Sa'd, and Ammar shared in what we would gain on the day of Badr. Sa'd came with two prisoners, while I and Ammar did not come with anything). Narrated by Abu Dawood, An-Nasa'i, and Ibn Majah (3).",
    "foot_note": "1. Narrated by Imam Ahmad (7507), Al-Bukhari (2272), and Muslim (4070).\n2. Narrated by Imam Ahmad (7336), Al-Bukhari (2166), and Muslim (4085).\n3. Narrated by Abu Dawood (3390), An-Nasa'i (3937), and Ibn Majah (2288). Ahmad used it as proof in the narration of Ibn Hani (1262), and Ahmad mentioned that it has the ruling of being attributed to the Prophet [Al-Mughni 7/111].",
    "book_id": "21"
  },
  {
    "serial_number": "1304239",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 38,
    "volume_number": 1,
    "text": "Chapter on Musaqah (Sharecropping) and Muzara'ah (Sharecropping of Crops)\n74 - On the authority of Ibn Umar, may Allah be pleased with them both, who said: «The Messenger of Allah, peace be upon him, dealt with the people of Khaybar for half of what comes out of it of fruit or crops.» Narrated by Imam Ahmad and the Two Sheikhs (1). And in a wording: «On the condition that they work on it using their own wealth.» Narrated by Muslim (2).\n\nChapter on Reviving Dead Land\n75 - On the authority of Jabir, may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, said: «Whoever revives a dead land, it belongs to him.» Narrated by Imam Ahmad and At-Tirmidhi (3).\n\nChapter on Ji'alah (Reward)\n76 - On the authority of Abu Sa'id Al-Khudri, may Allah be pleased with him: That a group of people, one of whom was stung [by a scorpion], came to the Companions of the Messenger of Allah, peace be upon him, and said: (Is there a Raqi [healer] among you?),",
    "foot_note": "1. Narrated by Imam Ahmad (4663), Al-Bukhari (2204), and Muslim (4044).\n2. Narrated by Muslim (4048).\n3. Narrated by Imam Ahmad (14636), At-Tirmidhi (1379) and he said: (This hadith is Hasan Sahih). It was also narrated by Abu Dawood (3075) and At-Tirmidhi (1378) from the hadith of Sa'id bin Zaid.",
    "book_id": "21"
  },
  {
    "serial_number": "1304240",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 39,
    "volume_number": 1,
    "text": "They said: (No, unless you set a reward for us). So they set a flock of sheep as a reward for them. One of the men began reciting the Opening of the Book (Al-Fatiha) and spitting [lightly], until he was cured. So they took the sheep and asked the Prophet, peace be upon him, about that. He said: «How did you know it was a Ruqyah? Take it, and assign a share for me with you.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n\nChapter on Luqatah (Found Property)\n77 - On the authority of Jabir bin Abdullah, may Allah be pleased with them both, who said: «The Messenger of Allah, peace be upon him, granted a concession regarding a stick, a whip, a rope, and similar things a man picks up to benefit from.» Narrated by Abu Dawood (2).\n78 - On the authority of Zaid bin Khalid Al-Juhani, may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, was asked about found gold or silver? He said: «Know its bag and its tie, then announce it for a year. If you do not find [the owner], then spend it and let it be a trust with you. If its seeker comes one day in time, pay it to him.» And he asked him about lost camels? He said: «What do you have to do with them? Leave them, for they have their shoes and their water reservoir; they reach water and eat trees until their Lord finds them.» And he asked him about",
    "foot_note": "1. Narrated by Imam Ahmad (11070), Al-Bukhari (5736, 5749), and Muslim (5865). The wording mentioned by the Sheikh is from the combination of Al-Bukhari's narrations. As for the wording of the attributed hadith, it is Imam Ahmad's wording in (Al-Musnad).\n2. Narrated by Abu Dawood (1719).",
    "book_id": "21"
  },
  {
    "serial_number": "1304241",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 40,
    "volume_number": 1,
    "text": "the sheep? He said: «Take it, for it is either for you, for your brother, or for the wolf.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n\nChapter on Competitions\n79 - On the authority of Abu Hurairah, may Allah be pleased with him, that the Prophet, peace be upon him, said: «There is no prize (Sabq) except in archery, camel racing, or horse racing.» Narrated by Imam Ahmad and the People of Sunan (2).\n80 - On the authority of Abu Hurairah, may Allah be pleased with him, that the Prophet, peace be upon him, said: «Whoever enters a horse between two horses while not being sure that he will be outstripped, it is not gambling; and whoever enters a horse between two horses while being sure he will be outstripped, then it is gambling.» Narrated by Imam Ahmad, Abu Dawood, and Ibn Majah (3).\n\nChapter on Shuf'ah (Preemption)\n81 - On the authority of Jabir bin Abdullah, may Allah be pleased with them both, who said: «The Prophet, peace be upon him, ruled for preemption in everything that has not been divided. But when the boundaries are set and the roads are laid out,",
    "foot_note": "1. Narrated by Imam Ahmad (17060), Al-Bukhari (91), and Muslim (4599). The wording is Muslim's.\n2. Narrated by Imam Ahmad (10138), Abu Dawood (2576), At-Tirmidhi (1700), An-Nasa'i (3585), and Ibn Majah (2878). The wording is for At-Tirmidhi and An-Nasa'i. Al-Jamal Al-Mardawi classed it Hasan in (Al-Kifayah), as did Al-Burhan Ibn Muflih in (Al-Mubdi'), and Al-Bahuti followed them.\n3. Narrated by Imam Ahmad (10557), Abu Dawood (2581), and Ibn Majah (2876). The wording is Abu Dawood's. Sheikh Taqi ad-Din and Ibn al-Qayyim weakened it. Al-Jamal Al-Mardawi said in (Al-Kifayah): (More than one scholar weakened this hadith). Ibn Muflih said in (Al-Furu'): (A group weakened the report of Abu Hurairah regarding the Muhallil because it is from the narration of Sufyan bin Husain and Sa'id bin Bashir from Az-Zuhri, and both are weak, and the Imams narrated it from Ibn al-Musayyib as his own saying).",
    "book_id": "21"
  },
  {
    "serial_number": "1304242",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 41,
    "volume_number": 1,
    "text": "then there is no preemption.» Narrated by Imam Ahmad and Al-Bukhari (1).",
    "foot_note": "1. Narrated by Imam Ahmad (15289), and Al-Bukhari (2364).",
    "book_id": "21"
  },
  {
    "serial_number": "1304243",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 43,
    "volume_number": 1,
    "text": "Book of Endowment (Waqf)\n82 - On the authority of Abdullah bin Umar, may Allah be pleased with them both: That Umar said: (O Messenger of Allah, I have acquired land in Khaybar; I have never acquired wealth more precious to me than it. What do you command me regarding it?) He said: «If you wish, you can retain its origin and give it [its produce] in charity.» He said: (So Umar gave it in charity [stipulating] that its origin cannot be sold, bought, inherited, or gifted). He said: (So Umar gave it in charity to the poor, relatives, slaves [to free them], in the cause of Allah, the wayfarer, and the guest. There is no sin on the one who administers it if he eats from it reasonably or feeds a friend without enriching himself from it). Narrated by Imam Ahmad and the Two Sheikhs (1).\n\nChapter on Gift (Hibah)\n83 - On the authority of Abdullah bin Umar, may Allah be pleased with them both, that the Prophet, peace be upon him, said: «It is not lawful for anyone to give a gift and then take it back, except a father regarding what he gives his child.» Narrated by Imam Ahmad and the People of Sunan (2).",
    "foot_note": "1. Narrated by Imam Ahmad (4608), Al-Bukhari (2620), and Muslim (4311).\n2. Narrated by Imam Ahmad (5493), Abu Dawood (3541), At-Tirmidhi (1299) and the wording is his, An-Nasa'i (3690), and Ibn Majah (2377).",
    "book_id": "21"
  },
  {
    "serial_number": "1304244",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 44,
    "volume_number": 1,
    "text": "84 - On the authority of An-Nu'man bin Bashir, may Allah be pleased with them both, that the Prophet, peace be upon him, said: «Fear Allah and be just between your children.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n\nChapter on Gift of the Sick\n85 - On the authority of Imran bin Husain, may Allah be pleased with him: «That a man freed six slaves of his at his death, and he had no wealth other than them. The Messenger of Allah, peace be upon him, called for them, divided them into three groups, then cast lots between them. He freed two and kept four as slaves.» Narrated by Imam Ahmad and Muslim (2).",
    "foot_note": "1. Narrated by Imam Ahmad (18378), Al-Bukhari (2447) and the wording is his, and Muslim (4267).\n2. Narrated by Imam Ahmad (19826), and Muslim (4425).",
    "book_id": "21"
  },
  {
    "serial_number": "1304245",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 45,
    "volume_number": 1,
    "text": "Book of Wills\n86 - On the authority of Sa'd bin Abi Waqqas, may Allah be pleased with him, who said: I said: O Messenger of Allah, the pain has reached me as you see, and I am a wealthy man and no one inherits from me except a daughter of mine. Should I give two-thirds of my wealth in charity? He said: «No.» I said: Half? He said: «No.» I said: One-third? He said: «One-third, and one-third is much. That you leave your heirs rich is better than leaving them poor, begging from people.» Narrated by Imam Ahmad and the Two Sheikhs (1).",
    "foot_note": "1. Narrated by Imam Ahmad (1482), Al-Bukhari (5668) and the wording is his, and Muslim (4296).",
    "book_id": "21"
  },
  {
    "serial_number": "1304246",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 47,
    "volume_number": 1,
    "text": "Book of Inheritance (Al-Fara'id)\n87 - Abdullah bin Mas'ud, may Allah be pleased with him, said regarding a daughter, a son's daughter, and a sister: «I judge in this matter with the judgment of the Messenger of Allah, peace be upon him: For the daughter is half, for the son's daughter is one-sixth to complete the two-thirds, and whatever remains is for the sister.» Narrated by Imam Ahmad and Al-Bukhari (1).\n88 - On the authority of Abdullah bin Abbas, may Allah be pleased with them both, that the Messenger of Allah, peace be upon him, said: «Give the prescribed shares (Fara'id) to those who are entitled to them, and whatever remains is for the nearest male relative.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n\nChapter on Impediments to Inheritance\n89 - On the authority of Usamah bin Zaid, may Allah be pleased with him, that the Prophet, peace be upon him, said: «A Muslim does not inherit from a disbeliever, nor does a disbeliever inherit from a Muslim.» Narrated by Imam Ahmad and the Two Sheikhs (3).",
    "foot_note": "1. Narrated by Imam Ahmad (3691), and Al-Bukhari (6736).\n2. Narrated by Imam Ahmad (2993), Al-Bukhari (6356), and Muslim (4226).\n3. Narrated by Imam Ahmad (21747), Al-Bukhari (6383), and Muslim (4225). The wording is Ahmad's and Al-Bukhari's.",
    "book_id": "21"
  },
  {
    "serial_number": "1304247",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 48,
    "volume_number": 1,
    "text": "90 - On the authority of Amr bin Shu'aib, from his father, from his grandfather Abdullah bin Amr, may Allah be pleased with them both, that the Messenger of Allah, peace be upon him, said: «People of two different religions do not inherit from each other.» Narrated by Imam Ahmad and Abu Dawood (1).\n\nChapter on Al-Wala' (Clientage)\n91 - On the authority of Aisha, may Allah be pleased with her, who said: The Messenger of Allah, peace be upon him, said: «Wala' belongs only to the one who manumits (frees the slave).» Narrated by Imam Ahmad and the Two Sheikhs (2).\n\nChapter on Manumission (Al-Itq)\n92 - On the authority of Abdullah bin Umar, may Allah be pleased with them both, that the Messenger of Allah, peace be upon him, said: «Whoever frees his share in a slave, and he has wealth reaching the price of the slave, the slave is evaluated against him at a fair value, his partners are given their shares, and the slave is freed against him. Otherwise, he has freed whatever he has freed of him.» Narrated by Imam Ahmad and the Two Sheikhs (3).",
    "foot_note": "1. Narrated by Imam Ahmad (6664), and Abu Dawood (2913). Ibn Abdul-Hadi said in (At-Tanqih): (Its chain is Jayyid [good] up to Amr). Al-Maimuni reported that Ahmad used the hadith as proof. See: Ahkam Ahl al-Milal by Al-Khallal p. 457.\n2. Narrated by Imam Ahmad (24053), Al-Bukhari (2060), and Muslim (3849).\n3. Narrated by Imam Ahmad (397), Al-Bukhari (2386) and the wording is his, and Muslim (3843).",
    "book_id": "21"
  },
  {
    "serial_number": "1304248",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 49,
    "volume_number": 1,
    "text": "93 - On the authority of Aisha, may Allah be pleased with her: (That she bought Barirah while she was a Mukatabah [a slave with a contract of manumission] by the command of the Messenger of Allah, peace be upon him). Narrated by Imam Ahmad and the Two Sheikhs (1).",
    "foot_note": "1. Narrated by Imam Ahmad (24053), Al-Bukhari (2060), and Muslim (3849).",
    "book_id": "21"
  },
  {
    "serial_number": "1304249",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 51,
    "volume_number": 1,
    "text": "Book of Marriage (Nikah)\n94 - On the authority of Sa'd bin Abi Waqqas, may Allah be pleased with him, who said: «The Messenger of Allah, peace be upon him, rejected Uthman bin Maz'un's request for celibacy.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n95 - On the authority of Abdullah bin Mas'ud, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «O gathering of youth, whoever among you is able to marry, let him marry, for it is more lowering of the gaze and more guarding of the chastity. And whoever is not able, let him fast, for it is a shield (Wija') for him.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n96 - On the authority of Abdullah bin Mas'ud, may Allah be pleased with him, who said: «The Messenger of Allah, peace be upon him, taught us the Tashahhud (testimony) of need: 'Verily all praise is due to Allah, we praise Him, we seek His help, and we ask for His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whomsoever Allah guides, none can misguide, and whomsoever He misguides, none can guide. I bear witness that there is no god but Allah, and I bear witness that Muhammad is His servant and Messenger.' And he recites three verses: {O you who have believed, fear Allah as He should be feared and do not die except as Muslims},",
    "foot_note": "1. Narrated by Imam Ahmad (1588), Al-Bukhari (4786), and Muslim (3470).\n2. Narrated by Imam Ahmad (3592), Al-Bukhari (4778), and Muslim (3466). The wording is Ahmad's and Muslim's.",
    "book_id": "21"
  },
  {
    "serial_number": "1304250",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 52,
    "volume_number": 1,
    "text": "{O you who have believed, fear Allah, through whom you ask one another, and the wombs. Indeed Allah is ever, over you, an Observer}, {O you who have believed, fear Allah and speak words of appropriate justice}.» Narrated by Imam Ahmad and the People of Sunan (1).\n\nChapter on Guardianship in Marriage\n97 - * On the authority of Abu Musa Al-Ash'ari, may Allah be pleased with him, that the Prophet, peace be upon him, said: «There is no marriage except with a guardian (Wali).» Narrated by Imam Ahmad and the People of Sunan (2), and authenticated by Imam Ahmad (3) and Ibn al-Madini (4) and others.",
    "foot_note": "1. Narrated by Imam Ahmad (4115), Abu Dawood (1099), At-Tirmidhi (1105), An-Nasa'i (3277), Ibn Majah (1892), and the wording is At-Tirmidhi's. What Al-Muwaffaq cited contains the addition (we praise Him 'Nahmaduhu') which appears in the Hadith of Ibn Abbas in Sahih Muslim (2045) and others. Also, in some copies of the book it says: (We seek His guidance 'Wa nastahdih'), which is not in the Sunan or the Musnad; Ash-Shafi'i narrated it [as in Al-Umm 1/232], but I did not establish it because some copies lack it, nor did the Sheikh mention it in his other books, alongside the lack of authenticity of its chain.\n2. Narrated by Imam Ahmad (19518), Abu Dawood (2087), At-Tirmidhi (1101), and Ibn Majah (1881).\n3. Al-Marwadhi said: I asked Ahmad and Yahya about the hadith: «No marriage except with a guardian». They said: (Authentic) [Ash-Sharh Al-Kabir 20/156]. Imam Ahmad said: (The hadith 'No marriage except with a guardian' strengthens one another, and I hold this view).\n4. Tanqih al-Tahqiq 4/292.",
    "book_id": "21"
  },
  {
    "serial_number": "1304251",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 53,
    "volume_number": 1,
    "text": "98 - On the authority of Abdullah bin Abbas, may Allah be pleased with them both, that the Prophet, peace be upon him, said: «The previously married woman (Al-Ayyim) has more right to herself than her guardian, and the virgin is asked for permission regarding herself, and her permission is her silence.» Narrated by Imam Ahmad and Muslim (1).\n99 - On the authority of Anas bin Malik, may Allah be pleased with him: «That the Messenger of Allah, peace be upon him, freed Safiyyah and made her manumission her dowry.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n\nChapter on Prohibited Marriages\n100 - On the authority of Abu Hurairah, may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, said: «One should not combine [in marriage] a woman and her paternal aunt, nor a woman and her maternal aunt.» Narrated by Imam Ahmad and the Two Sheikhs (3).\n\nChapter on Breastfeeding (Rada')\n101 - On the authority of Aisha, may Allah be pleased with her, who said: The Messenger of Allah, peace be upon him, said: «Breastfeeding prohibits what lineage prohibits.» Narrated by Imam Ahmad and the Two Sheikhs (4).",
    "foot_note": "1. Narrated by Imam Ahmad (2163), and Muslim (3541).\n2. Narrated by Imam Ahmad (12687), Al-Bukhari (4874), and Muslim (3569).\n3. Narrated by Imam Ahmad (10690), Al-Bukhari (4820), and Muslim (3502).\n4. Narrated by Imam Ahmad (24054), Al-Bukhari (4812), and Muslim (3652).",
    "book_id": "21"
  },
  {
    "serial_number": "1304252",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 54,
    "volume_number": 1,
    "text": "102 - On the authority of Umm Salamah, may Allah be pleased with her, who said: The Messenger of Allah, peace be upon him, said: «Breastfeeding does not prohibit unless it opens up the intestines [fills the gut], and it was before weaning.» Narrated by At-Tirmidhi (1).\n103 - On the authority of Aisha, may Allah be pleased with her, who said: «It was revealed in the Quran that ten known sucklings prohibit [marriage], then that was abrogated by five known sucklings that prohibit. The Messenger of Allah, peace be upon him, passed away and the matter stood as such.» Narrated by Muslim (2).\n\nChapter on Conditions in Marriage\n104 - On the authority of Uqbah bin Amir Al-Juhani, may Allah be pleased with him, who said: I heard the Messenger of Allah, peace be upon him, say: «Indeed, the conditions most worthy of you fulfilling are those by which you have made private parts lawful [intimacy].» Narrated by Imam Ahmad and the Two Sheikhs (3).\n105 - On the authority of Ali bin Abi Talib, Sabrah bin Ma'bad, and others, may Allah be pleased with them:",
    "foot_note": "1. Narrated by At-Tirmidhi (1152), and his wording is (opens the intestines in the breast...), and he said: (Hasan Sahih Hadith). Al-Jamal Al-Mardawi said in (Al-Kifayah 2/184): (Its narrators are trustworthy).\n2. Narrated by Muslim (3670). This is At-Tirmidhi's wording (1150). The word (Prohibit 'Yahrumna') in both places is from Muslim.\n3. Narrated by Imam Ahmad (17362) and the wording is his, Al-Bukhari (4856), and Muslim (3537).",
    "book_id": "21"
  },
  {
    "serial_number": "1304253",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 55,
    "volume_number": 1,
    "text": "«That the Prophet, peace be upon him, forbade Mut'ah (temporary marriage).» Narrated by Imam Ahmad and the Two Sheikhs (1).\n106 - On the authority of Abdullah bin Umar, may Allah be pleased with them both: «That the Prophet, peace be upon him, forbade Shighar (exchange marriage without dowry).» Narrated by Imam Ahmad and the Two Sheikhs (2).\n107 - On the authority of Ali bin Abi Talib, may Allah be pleased with him, who said: «The Messenger of Allah, peace be upon him, cursed the one who makes a divorced woman lawful for her former husband (Al-Muhallil) and the one for whom she is made lawful (Al-Muhallal lahu).» Narrated by Imam Ahmad and the People of Sunan, and authenticated by Sheikh Taqi ad-Din, and Imam Ahmad used it as proof (3).",
    "foot_note": "1. Ali's Hadith: Narrated by Imam Ahmad (812), Al-Bukhari (5523), and Muslim (3497). Hadith of Sabrah bin Ma'bad Al-Juhani: Narrated by Imam Ahmad (15337), and Muslim (3494).\n2. Narrated by Imam Ahmad (4692), Al-Bukhari (6559), and Muslim (3532).\n3. Narrated by Imam Ahmad (671), Abu Dawood (2078), At-Tirmidhi (1119), An-Nasa'i (5104), and Ibn Majah (1935).",
    "book_id": "21"
  },
  {
    "serial_number": "1304254",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 57,
    "volume_number": 1,
    "text": "Book of Dowry (Sadaq)\n108 - On the authority of Sahl bin Sa'd, may Allah be pleased with him, who said: A woman came to the Messenger of Allah, peace be upon him, and said: I have gifted myself [to you]. She stood for a long time, then a man said: Marry her to me if you have no need for her. He said: «Look for something [to give as dowry], even if it is a ring of iron.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n109 - On the authority of a man from Ashja', may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, judged regarding Barwa' bint Washiq, when her husband died before consuming the marriage and without assigning a dowry for her: «That she gets the dowry of women similar to her, without decrease or increase, and she receives inheritance, and she must observe the waiting period (Iddah).» Narrated by Imam Ahmad and the People of Sunan (2), and Ahmad used it as proof (3).",
    "foot_note": "1. Narrated by Imam Ahmad (22850), Al-Bukhari (5135) and the wording is theirs, and Muslim (3553).\n2. Narrated by Imam Ahmad (18461) and the wording is his, Abu Dawood (2118), At-Tirmidhi (1145) who said: (Hasan Sahih), An-Nasa'i (3354), and Ibn Majah (1891).\n3. Ishaq bin Mansur said (2174): (Ahmad argued with the hadith of Barwa' bint Washiq).",
    "book_id": "21"
  },
  {
    "serial_number": "1304255",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 58,
    "volume_number": 1,
    "text": "Chapter on Consort with Women\n110 - On the authority of Aisha, may Allah be pleased with her, that the Prophet, peace be upon him, said to Hind when she said to him: Abu Sufyan is a stingy man and does not give me enough maintenance for me and my child unless I take from him while he does not know? He said: «Take what suffices you and your child reasonably.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n\nChapter on Apportionment (Al-Qasm) and Nashuz (Marital Discord)\n111 - On the authority of Aisha, may Allah be pleased with her, who said: «When the Messenger of Allah, peace be upon him, intended a journey, he would draw lots between his wives, and whichever of them her arrow came out, he would go out with her.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n112 - On the authority of Aisha, may Allah be pleased with her: (That Sawdah bint Zam'ah, may Allah be pleased with her, gifted her day to Aisha, so the Messenger of Allah, peace be upon him, used to allot to Aisha her day and the day of Sawdah). Narrated by Imam Ahmad and the Two Sheikhs (3).",
    "foot_note": "1. Narrated by Imam Ahmad (24231), Al-Bukhari (5049) and the wording is theirs, and Muslim (4574).\n2. Narrated by Imam Ahmad (24859), Al-Bukhari (2453) and the wording is theirs, and Muslim (6451).\n3. Narrated by Imam Ahmad (24395), Al-Bukhari (4914) and the wording is his, and Muslim (3702).",
    "book_id": "21"
  },
  {
    "serial_number": "1304256",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 59,
    "volume_number": 1,
    "text": "113 - Anas, may Allah be pleased with him, said: «It is from the Sunnah that if one marries a virgin over a previously married woman (Thayib), he stays with her for seven days; and if he marries a previously married woman over a virgin, he stays with her for three days.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n114 - On the authority of Umm Salamah, may Allah be pleased with her: That when the Messenger of Allah, peace be upon him, married Umm Salamah, he stayed with her for three days, and said: «There is no lack of honor for you with your husband. If you wish, I will stay seven days with you, and if I stay seven days with you, I will stay seven days with [all] my wives.» Narrated by Imam Ahmad and Muslim (2).\n115 - On the authority of Ibn Abbas, may Allah be pleased with them both, who said: The Messenger of Allah, peace be upon him, said: «If one of you, when he comes to his wife, says: 'In the name of Allah, O Allah, keep Satan away from us and keep Satan away from what You bless us with,' and then a child is decreed between them, Satan will never harm him.» Narrated by Imam Ahmad and the Two Sheikhs (3).",
    "foot_note": "1. Narrated by Imam Ahmad (11952), Al-Bukhari (4915), and Muslim (3699) and the wording is his.\n2. Narrated by Imam Ahmad (26504), and Muslim (3694).\n3. Narrated by Imam Ahmad (1867), Al-Bukhari (141, 3271), and Muslim (3606).",
    "book_id": "21"
  },
  {
    "serial_number": "1304257",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 61,
    "volume_number": 1,
    "text": "Book of Divorce (Talaq)\n116 - On the authority of Aisha, may Allah be pleased with her: That the Messenger of Allah, peace be upon him, said to the wife of Rifa'ah: «Perhaps you want to return to Rifa'ah? No, not until you taste his little honey [consummate marriage] and he tastes your little honey.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n117 - On the authority of Abdullah bin Umar, may Allah be pleased with them both: That he divorced his wife while she was menstruating. Umar mentioned that to the Prophet, peace be upon him, and the Messenger of Allah, peace be upon him, became angry and then said: «Command him to take her back, then keep her until she becomes pure, then menstruates, then becomes pure. Then if he sees fit to divorce her, let him divorce her before he touches her [has intercourse].» Narrated by Imam Ahmad and the Two Sheikhs (2).\n118 - Aisha, may Allah be pleased with her, said: (The Messenger of Allah, peace be upon him, gave us the choice [to stay or leave], so was it a divorce?) Narrated by Imam Ahmad and the Two Sheikhs (3).",
    "foot_note": "1. Narrated by Imam Ahmad (25892), Al-Bukhari (6084) and the wording is his, and Muslim (3600).\n2. Narrated by Imam Ahmad (5299), Al-Bukhari (7160), and Muslim (3730). The author's wording is composed from the preceding Hadiths.\n3. Narrated by Imam Ahmad (24653), Al-Bukhari (4963), and Muslim (3758).",
    "book_id": "21"
  },
  {
    "serial_number": "1304258",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 62,
    "volume_number": 1,
    "text": "Chapter on Mourning (Ihdad)\n119 - On the authority of Umm Atiyyah, may Allah be pleased with her, that the Messenger of Allah, peace be upon him, said: «A woman should not mourn for a dead person for more than three days, except for a husband [which is] four months and ten days. She should not wear a dyed garment except a garment of 'Asb [a specific Yemeni cloth], nor use kohl, nor touch perfume; except when she becomes pure [from menstruation], she may use a small amount of costus or sweet hoof [types of incense].» Narrated by Imam Ahmad and the Two Sheikhs (1).\n\nChapter on Li'an (Mutual Imprecation)\n120 - On the authority of Abdullah bin Umar, may Allah be pleased with them both: «That a man engaged in Li'an with his wife and denied her child, so the Prophet, peace be upon him, separated them and attached the child to the mother.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n121 - On the authority of Aisha, may Allah be pleased with her, that the Messenger of Allah, peace be upon him, said: «The child belongs to the bed [husband], and for the adulterer is the stone [deprivation].» Narrated by Imam Ahmad and the Two Sheikhs (3).",
    "foot_note": "1. Narrated by Imam Ahmad (27304), Al-Bukhari (5342), and Muslim (3813) and the wording is his.\n2. Narrated by Imam Ahmad (4527), Al-Bukhari (5009), and Muslim (3825). This wording is in At-Tirmidhi (1203).\n3. Narrated by Imam Ahmad (24975), Al-Bukhari (6760), and Muslim (3686).",
    "book_id": "21"
  },
  {
    "serial_number": "1304259",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 63,
    "volume_number": 1,
    "text": "Chapter on Walimah (Wedding Feast)\n122 - On the authority of Anas bin Malik, may Allah be pleased with him, that Abdur-Rahman bin Awf came to the Messenger of Allah, peace be upon him, and informed him that he had married a woman from the Ansar. The Messenger of Allah, peace be upon him, said: «Offer a feast (Walimah), even if with one sheep.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n123 - On the authority of Abu Hurairah, may Allah be pleased with him, who said: «And whoever does not accept [the invitation] has disobeyed Allah and His Messenger.» Narrated by Imam Ahmad and Muslim (2).",
    "foot_note": "1. Narrated by Imam Ahmad (12685), Al-Bukhari (4858) and the wording is his, and Muslim (3556).\n2. Narrated by Imam Ahmad (10412), and Muslim (3598). The wording is Imam Ahmad's.",
    "book_id": "21"
  },
  {
    "serial_number": "1304260",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 65,
    "volume_number": 1,
    "text": "Book of Foods\n124 - On the authority of Aisha, may Allah be pleased with her, who said: I heard the Messenger of Allah, peace be upon him, say: «Every intoxicant is forbidden, and whatever intoxicates in a Faraq [large measure], then a handful of it is forbidden.» Narrated by Imam Ahmad, Abu Dawood, and At-Tirmidhi (1), and Ahmad used it as proof (2).\n125 - On the authority of Ibn Abbas, may Allah be pleased with them both, who said: «The lizard (Dabb) was eaten at the table of the Prophet, peace be upon him.» Narrated by Imam Ahmad and the Two Sheikhs (3).\n126 - And on the authority of Khalid bin Al-Walid, may Allah be pleased with him: That it was said to the Prophet, peace be upon him: Is it Haram, O Messenger of Allah? He said: «No.» Narrated by Imam Ahmad and the Two Sheikhs (4).\n127 - On the authority of Jabir bin Abdullah, may Allah be pleased with them both, who said: «That the Prophet, peace be upon him, permitted horse meat.» Narrated by Imam Ahmad and the Two Sheikhs (5).",
    "foot_note": "1. Narrated by Imam Ahmad (24423), Abu Dawood (3689) and the wording is his, and At-Tirmidhi (1866) who graded it Hasan.\n2. Ibn Rajab said [Jami' al-Ulum wal-Hikam]: (Ahmad used it as proof and held this view. He was asked about those who say it is not authentic? He said: This is an extremist man, meaning he exaggerated in his saying).\n3. Narrated by Imam Ahmad (2299), Al-Bukhari (5074), and Muslim (5151).\n4. Narrated by Imam Ahmad (16813), Al-Bukhari (5217), and Muslim (5146).\n5. Narrated by Imam Ahmad (15135), Al-Bukhari (5204), and Muslim (5134).",
    "book_id": "21"
  },
  {
    "serial_number": "1304261",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 66,
    "volume_number": 1,
    "text": "128 - On the authority of Jabir bin Abdullah, may Allah be pleased with them both: «That the Prophet, peace be upon him, named the hyena as game (Sayd).» Narrated by Imam Ahmad and the People of Sunan (1), and authenticated by Al-Bukhari and Ibn Muflih (2), and Ahmad used it as proof (3).\n\nChapter on Slaughtering (Dhakah)\n129 - On the authority of Jabir and Abu Hurairah, may Allah be pleased with them both, that the Prophet, peace be upon him, said - regarding the sea -: «Its water is purifying, and its dead [animals] are lawful,» as previously mentioned.\n130 - On the authority of Rafi' bin Khadij, may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, said: «Whatever causes blood to flow and the name of Allah is mentioned over it, eat it; except for the tooth and the nail.» Narrated by Imam Ahmad and the Two Sheikhs (4).\n131 - On the authority of Ka'b bin Malik, may Allah be pleased with him, who said: (We had sheep grazing at Sal', and a servant girl of ours saw a sheep from our flock dying. So she broke a stone",
    "foot_note": "1. Narrated by Imam Ahmad (14425), Abu Dawood (3803), At-Tirmidhi (851), An-Nasa'i (2836), and Ibn Majah (3085).\n2. See: Al-Ilal Al-Kabir p. 297, At-Tanqih by Ibn Abdul-Hadi 4/653, Al-Furu' 5/491.\n3. Az-Zarkashi said this in (Sharh Al-Khiraqi 6/693).\n4. Narrated by Imam Ahmad (17261), Al-Bukhari (5179), and Muslim (5204).",
    "book_id": "21"
  },
  {
    "serial_number": "1304262",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 67,
    "volume_number": 1,
    "text": "and slaughtered it with it. The Messenger of Allah, peace be upon him, was asked about that: And he ordered it to be eaten.) Narrated by Imam Ahmad and Al-Bukhari (1).\n132 - On the authority of Rafi' bin Khadij, may Allah be pleased with him, who said: A camel ran away, so they chased it but it exhausted them. A man among them shot it with an arrow and detained it. The Messenger of Allah, peace be upon him, said: «Indeed, these animals have wildness like the wildness of wild beasts; so whatever overcomes you from them, do this to it.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n\nChapter on Hunting\n133 - On the authority of Adi bin Hatim, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «If you send your trained dog and mention the name of Allah over it, then eat» (3), «If it catches [game] for you and you reach it alive, then slaughter it; and if you reach it dead and it has not eaten from it, then eat it» (4), «For the catching of the dog is [its] slaughter» (5), «If it ate [from it], then do not eat, for I fear that it caught it only for itself. And if other dogs mixed with it",
    "foot_note": "1. Narrated by Imam Ahmad (15765), and Al-Bukhari (2181) and the wording is his.\n2. Narrated by Imam Ahmad (15806), Al-Bukhari (2356) and the wording is his, and Muslim (5204).\n3. Narrated by Imam Ahmad (19372), and Muslim (5081).\n4. Narrated by Muslim (5090).\n5. Narrated by Al-Bukhari (5475).",
    "book_id": "21"
  },
  {
    "serial_number": "1304263",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 68,
    "volume_number": 1,
    "text": "other than it, do not eat» (1), «For you named [Allah] only over your dog and did not name over another» (2). «And if you shot your arrow, mention the name of Allah. If it disappears from you for a day (or two days) and you find in it nothing but the mark of your arrow, then eat if you wish. But if you find it drowned in water, do not eat» (3), «For you do not know if the water killed it or your arrow» (4). Narrated by Imam Ahmad and the Two Sheikhs (5).\n\nChapter on Vows (Nadhr)\n134 - On the authority of Aisha, may Allah be pleased with her, who said: The Messenger of Allah, peace be upon him, said: «Whoever vows to obey Allah, let him obey Him; and whoever vows to disobey Allah, let him not disobey Him.» Narrated by Imam Ahmad and Al-Bukhari (6).\n135 - On the authority of Ibn Abbas, may Allah be pleased with them both, that the Messenger of Allah, peace be upon him, said: «Whoever makes a vow that he cannot fulfill, its expiation is the expiation of an oath.» Narrated by Abu Dawood (7).",
    "foot_note": "1. Narrated by Imam Ahmad (18270), and Muslim (5082).\n2. Narrated by Imam Ahmad (18255), Al-Bukhari (2054), and Muslim (5088).\n3. Narrated by Muslim (5090), and the addition (or two days) is in Al-Bukhari (5484) not with this context but with its meaning.\n4. Narrated by Muslim (5091).\n5. The author did not cite a single context but combined multiple wordings due to the jurisprudence in each.\n6. Narrated by Imam Ahmad (24075), and Al-Bukhari (6696).\n7. Narrated by Abu Dawood (3324) and the wording is his, then he said: (Waki' and others narrated this Hadith from Abdullah bin Sa'id bin Abi al-Hind stopping it at Ibn Abbas). Ibn Majah narrated it with the wording: (Whoever makes a vow he cannot fulfill, its expiation is an oath). Al-Burhan Ibn Muflih said in [Al-Mubdi' 8/134]: (Narrated by Ibn Majah and Ad-Daraqutni, and its chain is trustworthy, and Abu Dawood narrated it and mentioned that it was narrated as Mawquf [stopped] at Ibn Abbas).",
    "book_id": "21"
  },
  {
    "serial_number": "1304264",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 69,
    "volume_number": 1,
    "text": "136 - On the authority of Imran bin Husain, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «There is no vow in disobedience to Allah, nor in what the servant does not possess.» Narrated by Imam Ahmad and Muslim (1).\n137 - On the authority of Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah, peace be upon him, said: «There is no vow except in what is sought for the face of Allah Almighty.» Narrated by Imam Ahmad and Abu Dawood (2).\n138 - On the authority of Abdullah bin Abbas, may Allah be pleased with them both, who said: The Messenger of Allah, peace be upon him, saw a man standing in the sun. He asked about him, and they said: Abu Israel vowed to stand and not sit, not to seek shade, not to speak, and to fast. He said: «Command him to speak, seek shade, sit, and complete his fast.» Narrated by Imam Ahmad and Al-Bukhari (3).",
    "foot_note": "1. Narrated by Imam Ahmad (19894), and Muslim (4333). This wording is in Muslim.\n2. Narrated by Imam Ahmad (6732), and Abu Dawood (3275).\n3. Narrated by Imam Ahmad (17532), and Al-Bukhari (6704) and the wording is his. Abu Dawood (3302) narrated it from Al-Bukhari's Sheikh (Musa bin Ismail), and added (the sun), and Abu Dawood narrated it with the wording: (Command him 'Muruhu' plural form) as Al-Muwaffaq established in the original.",
    "book_id": "21"
  },
  {
    "serial_number": "1304265",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 71,
    "volume_number": 1,
    "text": "Book of Oaths (Al-Ayman)\n139 - On the authority of Abu Hurairah, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «Your oath is according to what your companion believes you in.» Narrated by Imam Ahmad and Muslim (1).\n140 - On the authority of Abu Hurairah, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «Whoever swears an oath and then sees something else better than it, let him make expiation for his oath and do that which is better.» Narrated by Imam Ahmad and Muslim (2).\n141 - And it was narrated: «Let him do that which is better and make expiation for his oath.» Narrated by Muslim (3).",
    "foot_note": "1. Narrated by Imam Ahmad (7119) and the wording is his, and Muslim (1653).\n2. Narrated by Imam Ahmad (8734), and Muslim (4361). The wording cited by the author is in An-Nasa'i (3781) from the Hadith of Amr bin Shu'aib from his father from his grandfather.\n3. Narrated by Muslim (4362).",
    "book_id": "21"
  },
  {
    "serial_number": "1304266",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 73,
    "volume_number": 1,
    "text": "Book of Crimes (Jinayat)\n142 - On the authority of Abu Hurairah, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «Whoever has a relative killed, he has the choice of the best of two views: either to accept blood money or to kill [in retaliation] (1).» Narrated by Imam Ahmad and the Two Sheikhs (2).\n\nChapter on Conditions for Obligation and Execution of Retaliation (Qisas)\n143 - On the authority of Ali bin Abi Talib, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «A believer is not killed for [killing] a disbeliever.» Narrated by Imam Ahmad, Abu Dawood, At-Tirmidhi, and An-Nasa'i (3).",
    "foot_note": "1. Judge Iyad said in (Al-Mashariq 2/171): (Vocalizing it with a Fatha on the 'Ya' [An yaqtala] is clearer, and most are on the passive form for brevity).\n2. Narrated by Imam Ahmad (7242), Al-Bukhari (2302), and Muslim (3371).\n3. Narrated by Imam Ahmad (959), Abu Dawood (4532), At-Tirmidhi (1412) who said: The Hadith of Ali is Hasan Sahih, and An-Nasa'i (4734). Ibn Abdul-Hadi graded it Hasan in (At-Tanqih 4/460). Its origin is in Al-Bukhari (111) with the wording: (A Muslim is not killed for a disbeliever).",
    "book_id": "21"
  },
  {
    "serial_number": "1304267",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 75,
    "volume_number": 1,
    "text": "Book of Blood Money (Diyat)\n144 - On the authority of Sahl bin Abi Hathmah and Rafi' bin Khadij, may Allah be pleased with them both: (That Muhayyisah bin Mas'ud and Abdullah bin Sahl set out towards Khaybar, and Abdullah bin Sahl was killed. They accused the Jews of it. The Messenger of Allah, peace be upon him, said: «Fifty of you swear oaths against a man among them, and he is handed over with his rope [entirely].» They said: It is a matter we did not witness, how can we swear? He said: «Then the Jews exonerate themselves with the oaths of fifty of them.» They said: O Messenger of Allah, they are disbelieving people. He said: So the Messenger of Allah, peace be upon him, paid his blood money from himself.) Narrated by Imam Ahmad and the Two Sheikhs (1).",
    "foot_note": "1. Narrated by Imam Ahmad (16091), Al-Bukhari (5791), and Muslim (4435). The wording is Muslim's.",
    "book_id": "21"
  },
  {
    "serial_number": "1304268",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 77,
    "volume_number": 1,
    "text": "Book of Prescribed Punishments (Hudud)\n145 - On the authority of Abu Hurairah, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «If the slave girl of one of you commits Zina (illegal sexual intercourse), let him flog her.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n146 - On the authority of Ali bin Abi Talib, may Allah be pleased with him: That a slave girl belonging to the Messenger of Allah, peace be upon him, committed Zina, so he ordered me to flog her. But she had just come out of postpartum bleeding (Nifas), so I feared that if I flogged her I might kill her. I mentioned that to the Prophet, peace be upon him, and he said: «You did well.» Narrated by Imam Ahmad and Muslim (2).\n\nChapter on Punishment for Zina\n147 - On the authority of Ubadah bin As-Samit, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «Take from me, take from me. Allah has made a way for them. The virgin with the virgin: one hundred lashes and exile for a year. The previously married with the previously married: one hundred lashes and stoning.» Narrated by Imam Ahmad and Muslim (3).",
    "foot_note": "1. Narrated by Imam Ahmad (8886) and the wording is his, Al-Bukhari (2119), and Muslim (4542).\n2. Narrated by Imam Ahmad (1341), and Muslim (4547) and the wording is his.\n3. Narrated by Imam Ahmad (22666), Muslim (4509).",
    "book_id": "21"
  },
  {
    "serial_number": "1304269",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 78,
    "volume_number": 1,
    "text": "Chapter on Punishment for Intoxicants\n148 - On the authority of Ali, may Allah be pleased with him, that he flogged Al-Walid bin Uqbah forty times for drinking wine, and said: «The Prophet, peace be upon him, flogged forty, Abu Bakr flogged forty, and Umar eighty. All are Sunnah, and this [forty] is more beloved to me.» Narrated by Imam Ahmad and Muslim (1).\n149 - On the authority of Abu Burdah, may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, said: «No one is flogged more than ten lashes except in a punishment from the punishments (Hudud) of Allah.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n\nChapter on Ruling of the Apostate\n150 - On the authority of Abdullah bin Abbas, may Allah be pleased with them both, that the Messenger of Allah, peace be upon him, said: «Whoever changes his religion, kill him.» Narrated by Imam Ahmad and Al-Bukhari (3).",
    "foot_note": "1. Narrated by Imam Ahmad (624), Muslim (4554) and the wording is his.\n2. Narrated by Imam Ahmad (15832), Al-Bukhari (6456), and Muslim (4557).\n3. Narrated by Imam Ahmad (2552), and Al-Bukhari (6524).",
    "book_id": "21"
  },
  {
    "serial_number": "1304270",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 79,
    "volume_number": 1,
    "text": "Book of Jihad\n151 - On the authority of Abu Hurairah, may Allah be pleased with him, who said: The Prophet, peace be upon him, was asked: Which deed is best? He said: «Faith in Allah.» He was asked: Then what? He said: «Then Jihad in the cause of Allah.» It was asked: Then what? He said: «Then an accepted Hajj.» Narrated by Imam Ahmad and the Two Sheikhs (1).\n152 - On the authority of Abu Sa'id Al-Khudri, may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, was asked: Which people are best? He said: «A man who strives in the cause of Allah with his wealth and himself.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n153 - On the authority of Uthman bin Affan, may Allah be pleased with him, that the Prophet, peace be upon him, said: «Guarding the frontier (Ribat) for a day in the cause of Allah is better than a thousand days in other than it.» Narrated by Imam Ahmad, At-Tirmidhi, and An-Nasa'i (3).",
    "foot_note": "1. Narrated by Imam Ahmad (7590), Al-Bukhari (26), and Muslim (258) and the wording is his.\n2. Narrated by Imam Ahmad (11125), Al-Bukhari (6494), and Muslim (4994) and the wording is his.\n3. Narrated by Imam Ahmad (470), At-Tirmidhi (1667), and An-Nasa'i (3169). Ibn Qudamah authenticated it in (Al-Kafi 5/462), and Ibn Abi Umar in (Ash-Sharh Al-Kabir 10/31).",
    "book_id": "21"
  },
  {
    "serial_number": "1304271",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 80,
    "volume_number": 1,
    "text": "154 - On the authority of Salman, may Allah be pleased with him, who said: I heard the Messenger of Allah, peace be upon him, say: «Guarding the frontier for a day and a night is better than fasting a month and praying [at night] during it. And if he dies, his deeds that he used to do continue for him, his provision is continued for him, and he is safe from the Tempter [of the grave].» Narrated by Imam Ahmad and Muslim (1).\n155 - On the authority of Abdullah bin Umar, may Allah be pleased with them both: «That the Prophet, peace be upon him, raided Banu Al-Mustaliq while they were heedless and their cattle were being watered at the water place, so he killed their fighters and took their progeny captive.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n156 - On the authority of Abu Qatadah, may Allah be pleased with him, that the Prophet, peace be upon him, said: «Whoever kills a person [in battle] and has proof of it, he gets his spoils (Salab).» Narrated by Imam Ahmad and the Two Sheikhs (3).\n157 - On the authority of Salamah bin Al-Akwa', may Allah be pleased with him, who said - on the Day of Dhu Qarad -: «The Messenger of Allah, peace be upon him, gave me two shares: the share of the horseman and the share of the foot soldier, combining them both for me.» Narrated by Muslim (4).\n158 - And on the authority of Salamah bin Al-Akwa', may Allah be pleased with him: That he went on a campaign with Abu Bakr. He said: (I killed seven people [from the enemy households] with my hand, so Abu Bakr gave me a woman as extra spoils [Nafl].) Narrated by",
    "foot_note": "1. Narrated by Imam Ahmad (23728), and Muslim (5047) and the wording is his.\n2. Narrated by Imam Ahmad (4857), Al-Bukhari (2403), and Muslim (4616).\n3. Narrated by Imam Ahmad (22518), Al-Bukhari (4066), and Muslim (4667). The wording is from the Two Sahihs.\n4. Narrated by Muslim (4779).",
    "book_id": "21"
  },
  {
    "serial_number": "1304272",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 81,
    "volume_number": 1,
    "text": "Imam Ahmad, Abu Dawood, and An-Nasa'i (1).\n159 - On the authority of Ibn Umar, may Allah be pleased with them both: «That the Messenger of Allah, peace be upon him, assigned two shares for the horse and one share for its owner.» Narrated by Imam Ahmad and the Two Sheikhs (2).\n160 - On the authority of Ali bin Abi Talib, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: «The blood of believers is equal [in retribution], and the protection offered by the lowest of them is binding on them.» Narrated by Imam Ahmad, Abu Dawood, and An-Nasa'i (3).",
    "foot_note": "1. Narrated by Imam Ahmad (16502), Abu Dawood (2699), and An-Nasa'i in (Al-Kubra 8665) and the wording is his. Its origin is in Muslim (1755) with a similar meaning.\n2. Narrated by Imam Ahmad (5518), Al-Bukhari (2863) and the wording is his, and Muslim (4685).\n3. Narrated by Imam Ahmad (959) and the wording is his, Abu Dawood (4519), and An-Nasa'i (4746). Authenticated by Ibn Abdul-Hadi, and graded Hasan by Ibn Muflih. See: At-Tanqih by Ibn Abdul-Hadi 4/460, Al-Adab Ash-Shar'iyyah 1/377, Sharh Az-Zarkashi 6/63.",
    "book_id": "21"
  },
  {
    "serial_number": "1304273",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 83,
    "volume_number": 1,
    "text": "Book of Judiciary (Al-Qada')\n161 - On the authority of Abdullah bin Abbas, may Allah be pleased with them both, that the Messenger of Allah, peace be upon him, said: «If people were given according to their claims, men would claim the blood and wealth of [other] men. However, the oath is upon the defendant.» Narrated by Imam Ahmad and the Two Sheikhs (1).",
    "foot_note": "1. Narrated by Imam Ahmad (3188), Al-Bukhari (4552), and Muslim (4567). The wording is Muslim's.",
    "book_id": "21"
  },
  {
    "serial_number": "1304274",
    "category_id": "6",
    "category": "Sunnah Books",
    "book_title": "Abstraction of the Hadiths of 'Umdah in Jurisprudence by Sheikh Abu Muhammad Al-Muwaffaq Ibn Qudamah (died 620 AH)",
    "edition": "First, 1439 AH - 2018 AD",
    "publisher": "Rakaez Publishing and Distribution",
    "page_number": 85,
    "volume_number": 1,
    "text": "Book of Testimonies (Shahadat)\n162 - On the authority of Uqbah bin Al-Harith, may Allah be pleased with him, who said: I married Umm Yahya, the daughter of Abu Ihab. A black slave woman came and said: I have breastfed both of you. I mentioned that to the Messenger of Allah, peace be upon him, and he said: «How [can you keep her] when she has claimed that?» So he forbade him from her. Narrated by Imam Ahmad and Al-Bukhari (1).\n163 - On the authority of Abdullah bin Abbas, may Allah be pleased with them both: «That the Messenger of Allah, peace be upon him, judged based on a witness and an oath.» Narrated by Imam Ahmad and Muslim (2).",
    "foot_note": "1. Narrated by Imam Ahmad (16153), and Al-Bukhari (2516).\n2. Narrated by Imam Ahmad (2224) and the wording is his, and Muslim (4569).",
    "book_id": "21"
  }
]