[
  {
    "text": "كيف تنصر نبيك صلى الله عليه وسلم\nالمؤلف: نوال بنت عبد العزيز العيد\nسنة الوفاة: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "category_id": "24",
    "category": "السيرة النبوية",
    "new_page_number": 1
  },
  {
    "text": "sn: 5982\nbook_title: كيف تنصر نبيك صلى الله عليه وسلم\nbook_link: https://shamela.ws/book/1067\nbook_id: 1067\nauthor_name: نوال بنت عبد العزيز العيد\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/195\nauthor_ID: 195\neditor: Null\npublisher: دار الحضارة للنشر والتوزيع\nedition: الأولى، 1434 هـ - 2013 م\npages: 95\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: السيرة النبوية\ncategory_id: 24",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "category_id": "24",
    "category": "السيرة النبوية",
    "new_page_number": 2
  },
  {
    "serial_number": "5140396",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: السيرة النبوية الكتاب : كيف تنصر نبيك صلى الله عليه وسلم المؤلف : نوال بنت عبد العزيز العيد الناشر : دار الحضارة للنشر والتوزيع الطبعة : الأولى ، 1434 هـ - 2013 م عدد الصفحات : 95 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 27 ربيع الأول 1444\nالكتاب : كيف تنصر نبيك صلى الله عليه وسلم المؤلف : نوال بنت عبد العزيز العيد الناشر : دار الحضارة للنشر والتوزيع الطبعة : الأولى ، 1434 هـ - 2013 م عدد الصفحات : 95 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 27 ربيع الأول 1444\nالمؤلف : نوال بنت عبد العزيز العيد الناشر : دار الحضارة للنشر والتوزيع الطبعة : الأولى ، 1434 هـ - 2013 م عدد الصفحات : 95 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 27 ربيع الأول 1444\nالناشر : دار الحضارة للنشر والتوزيع الطبعة : الأولى ، 1434 هـ - 2013 م عدد الصفحات : 95 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 27 ربيع الأول 1444\nالطبعة : الأولى ، 1434 هـ - 2013 م عدد الصفحات : 95 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 27 ربيع الأول 1444\nعدد الصفحات : 95 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 27 ربيع الأول 1444\n[ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 27 ربيع الأول 1444\nتاريخ النشر بالشاملة : 27 ربيع الأول 1444",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 3
  },
  {
    "serial_number": "5140397",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 5,
    "volume_number": 1,
    "text": "المقدمة الحمد لله ذي القدرة والجلال، والنعم السابغة والإفضال، الذي منّ علينا بمعرفته، وهدانا إلى الإقرار بألوهيته، وجعلنا من أمة خاتم النبيين، السامي بفضله على سائر العالمين، الطاهر الأعراق، الشريف الأخلاق، الذي قال الله الكريم مخاطبة له في الذكر الحكيم: {وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ} وقال عن نصرته لدينه: {هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَى وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ} صلى الله عليه وسلم، وأزلف منزلته لديه، وعلى إخوانه وأقربيه، وصحابته الأخيار، وتابعيه، وسلم عليه وعليهم أجمعين إلى يوم الدين .. أما بعد،، فإن الله هدانا بنبيّه محمد صلى الله عليه وسلم، وأخرجنا به من الظلمات إلى النور، وآتانا ببركة رسالته، ويُمن سفارته خيري الدنيا والآخرة، وكان من ربه بالمنزلة العليا، وفي كتاب الله العزيز آيات كثيرة مفصحة بجميل ذكره صلى الله عليه وسلم، وعدِّ محاسنه، وتعظيم أمره وتنويه قدره، فمن ذلك ما قاله سبحانه: {يَاأَيُّهَا النَّبِيُّ إِنَّا أَرْسَلْنَاكَ شَاهِدًا وَمُبَشِّرًا وَنَذِيرًا (45) وَدَاعِيًا إِلَى اللَّهِ بِإِذْنِهِ وَسِرَاجًا مُنِيرًا} وقد جمع له سبحانه في هذه الآية ضروبًا من رُتب الأثرة، وجملة أوصاف",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 4
  },
  {
    "serial_number": "5140398",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 6,
    "volume_number": 1,
    "text": "من المِدْحة، فجعله شاهدًا على أمّته بإبلاغهم الرسالة، فتحملها في الدنيا، ويؤديها في الآخرة، يقول تعالى: {لِتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا} ومبشّرًا لأهل طاعته، ونذيرا لأهل معصيته، وداعيًا إلى توحيده وعبادته، وسراجًا منيرًا يستضاء به في ظلمات الجهل والغواية، ويهتدي بأنواره إلى مناهج الرشد والهداية، وقد وصفه ربه بهذه الآية في التوراة وزيادة، «حرز للأميّين (1) ، أنت عبدي ورسولي سميّتك المتوكّل، ليس بفظّ، ولا غليظ، ولا سخاب (2) في الأسواق، ولا يدفع بالسيئة السيئة، ولكن يعفو، ويغفر، ولن يقبضه الله حتى يقيم به الملّة العوجاء بأن يقولوا «لا إله إلا الله» ويفتح به أعينًا عميًا، وآذانًا صمًا، وقلوبنا غلفًا». بل من فضيلته عند الله أن جعل طاعته طاعة لله، فقال {مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ} وأقسم ربه بحياة رسوله صلى الله عليه وسلم، وله سبحانه أن يقسم بما شاء من خلقه، وليس ذلك لأحد منهم، يقول ابن عبّاس: «ما خلق الله، وما ذرأ، وما برأ نفسًا أكرم عليه من محمد صلى الله عليه وسلم، وما سمعت الله أقسم بحياة أحد غيره، قال تعالى: {لَعَمْرُكَ إِنَّهُمْ لَفِي",
    "foot_note": "1. أي: حفظًا للعرب؛ لأن الكتابة عندهم قليل. \n2. من السخب، وهي لغة ربيعة في الصخب وهو رفع الصوت.",
    "book_id": "1067",
    "new_page_number": 5
  },
  {
    "serial_number": "5140399",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 7,
    "volume_number": 1,
    "text": "سَكْرَتِهِمْ يَعْمَهُونَ}» وقد تضمنت سورة الضحى من كرامة الله تعالى لمحمد صلى الله عليه وسلم، وتنويهه به، وتعظيمه إياه خمسة وجوه: الأول: القسم له عمّا أخبره به من حاله بقوله: {وَالضُّحَى (1) وَاللَّيْلِ إِذَا سَجَى} أي: وربّ الضحى، وهذا من أعظم درجات المبرّة .. الثاني: بيان مكانته عنده، وحظوته لديه بقوله: {مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَى} أي: ما تركك وأبغضك بعد أن اصطفاك وأحبّك .. الثالث: {وَلَلْآخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَى} أي: كل حالة متأخرة من أحوالك فإن لها الفضل على الحالة السابقة، فلم يزل صلى الله عليه وسلم يصعد في درجات المعالي، ويُمكّن له من دينه، ويُنصر على أعداءه، ويسدد في أحواله حتى مات، وقد وصل إلى حال ما وصل إليها الأولون والآخرون من الفضائل والنعم، وقرة العين، وسرور القلب ثم بعد هذا لا تسأل عن حاله في الآخرة من تفاصيل الإكرام، وأنواع الإنعام ولقد من ربه عليه بالكوثر … الرابع: {وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَى} وهذه آية جامعة لوجوه الكرامة، وأنواع السعادة، وثبات الإنعام في الدارين وزيادة ..",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 6
  },
  {
    "serial_number": "5140400",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 8,
    "volume_number": 1,
    "text": "الخامس: تعداده سبحانه لوجوه امتنانه عليه صلى الله عليه وسلم بقوله: {أَلَمْ يَجِدْكَ يَتِيمًا فَآوَى (6) وَوَجَدَكَ ضَالًّا فَهَدَى (7) وَوَجَدَكَ عَائِلًا فَأَغْنَى} وقد زكّاه سبحانه في خلقه فقال: {وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ} وزكّى بصره فقال: {مَا زَاغَ الْبَصَرُ وَمَا طَغَى} وزكّى منطقه فقال: {وَمَا يَنْطِقُ عَنِ الْهَوَى (3) إِنْ هُوَ إِلَّا وَحْيٌ يُوحَى} ورفع ذكره فلا يذكر إلا ويذكر معه كما في الأذان، والتشهد، والخطب، والمجامع والأعياد، وذاك قوله تعالى {وَرَفَعْنَا لَكَ ذِكْرَكَ} صاحب الوسيلة (1) ، والفضيلة (2) ، والمقام المحمود (3) ، والحوض المورود، ولواء الحمد الذي تحته كل حماد، أكرم خلق الله عليه، وسيد ولد آدم وهذا كله، إنما هو غيض من فيض، وقليل من كثير فضله صلى الله عليه وسلم، ولما أوجب الله علينا من تعزيره، ونصره بكل طريق {لِتُؤْمِنُوا بِاللَّهِ وَرَسُولِهِ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُ}، وإيثاره بالنفس والمال في كل موطن، وحفظه وحمايته من كل مؤذ، وإن كان الله قد أغنى رسوله عن نصرة",
    "foot_note": "1. منزلة في الجنة لا تنبغي إلا لعبد من عباد الله. \n2. المرتبة الزائدة على سائر الخلق. \n3. الشفاعة العظمى",
    "book_id": "1067",
    "new_page_number": 7
  },
  {
    "serial_number": "5140401",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 9,
    "volume_number": 1,
    "text": "الخلق {إِلَّا تَنْصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ}، ولكن ليبلوا بعضكم ببعض، وليعلم الله من ينصره ورسوله بالغيب؛ ليحق الجزاء على الأعمال كما سبق في أم الكتاب، أحببت أن أضرب بسهمي في بيان نزر قليل من تفاصيل وجوب محبته، ولزوم نصرته، وإخلاص نصيحته، وحقه على أمته عليه أفضل الصلاة والتسليم .. واعلم. نور الله قلبك وقلبي، وضاعف في هذا النبي الكريم حبي وحبك. أن لرسول الله عليك صلى الله عليه وسلم حقوقًا عظيمة منها:  1 - {فَآمِنُوا بِاللَّهِ وَرَسُولِهِ}. فإن على كل مؤمن وجوب الإيمان به صلى الله عليه وسلم وتصديقه فيما أتى به، وهذا معنى شهادة أن محمدا رسول الله: طاعته فيما أمر، وتصديقه فيما أخبر واجتناب ما نهى عنه وزجر، وأن لا يعبد الله إلا بما شرع .. يقول شيخ الإسلام في مجموع الفتاوى: - «ويجب على الخلق الإقرار بما جاء به النبي صلى الله عليه وسلم، فما جاء به القرآن العزيز أو السنة المعلمة وجب على الخلق الإقرار به جملة وتفصيلا عند العلم بالتفصيل، فلا يكون الرجل مؤمنا حتى يقر بما جاء به النبي صلى الله عليه وسلم، وهو تحقيق شهادة أن لا إله إلا الله، وأن محمدا رسول الله، فمن شهد أنه رسول الله، شهد",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 8
  },
  {
    "serial_number": "5140402",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 10,
    "volume_number": 1,
    "text": "أنه صادق فيما يخبر به عن الله، فإن هذا حقيقة الشهادة بالرسالة» ويقول ابن القيم في مدارج السالكين: «فرأس الأدب مع الرسول صلى الله عليه وسلم: كمال التسليم له والانقياد لأمره، وتلقي خبره بالقبول والتصديق، دون أن يحمله معارضة بخيال باطل يسميه معقولا، أو يحمله شبهة أوشكّا، أو يقدّم عليه آراء الرجال وزبالات أذهانهم، فيوحده بالتحكيم والتسليم، والانقياد والإذعان، كما وحد المرسل سبحانه وتعالى بالعبادة والخضوع والذل والإنابة والتوكل» وقد تكرر الأمر بالإيمان برسول الله صلى الله عليه وسلم بل وقرنه بالإيمان بالله، يقول تعالى: {آمِنُوا بِاللَّهِ وَرَسُولِهِ وَأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ فَالَّذِينَ آمَنُوا مِنْكُمْ وَأَنْفَقُوا لَهُمْ أَجْرٌ كَبِيرٌ (7) وَمَا لَكُمْ لَا تُؤْمِنُونَ بِاللَّهِ وَالرَّسُولُ يَدْعُوكُمْ لِتُؤْمِنُوا بِرَبِّكُمْ وَقَدْ أَخَذَ مِيثَاقَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ} فجعل الرب شرط الإيمان به الإيمان برسوله صلى الله عليه وسلم وبما يدعو إليه، كيف وقد أيده بالآيات الظاهرات الدالة على صدق ما جاء به، ولذا جاء عقب هذا الآية: {هُوَ الَّذِي يُنَزِّلُ عَلَى عَبْدِهِ آيَاتٍ بَيِّنَاتٍ} وقال سبحانه: {إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ آمَنُوا بِاللَّهِ وَرَسُولِهِ ثُمَّ لَمْ يَرْتَابُوا وَجَاهَدُوا بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ فِي سَبِيلِ اللَّهِ أُولَئِكَ هُمُ",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 9
  },
  {
    "serial_number": "5140403",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 11,
    "volume_number": 1,
    "text": "الصَّادِقُونَ} وتأمل حصر الإيمان بأداة الحصر {إِنَّمَا} في من آمن بالله ورسوله، ثم لم يشك أو يتزلزل بل ثبت على حال واحده وهي التصديق المحض، ثم جاء بذل المال والنفس في سبيل الله، فكان الجزاء أن أشار إليهم: {أُولَئِكَ} لما فيه من معنى بعدهم في الفضل والأجر، وعقبه التزكية {هُمُ الصَّادِقُونَ} أي الذين صدق فعلهم قولهم .. بل حكم الله بكفر من لم يؤمن برسوله وحذره من سعيره فقال سبحانه: {وَمَنْ لَمْ يُؤْمِنْ بِاللَّهِ وَرَسُولِهِ فَإِنَّا أَعْتَدْنَا لِلْكَافِرِينَ سَعِيرًا} وأخرج مسلم (1) من حديث أبي هريرة أن النبي صلى الله عليه وسلم قال: «والذي نفس محمد بيده لا يسمع بي أحد من هذه الأمة يهودي ولا نصراني ثم يموت ولم يؤمن بالذي أرسلت به إلا كان من أصحاب النار» .. وأخرج أيضا (2) أن رسول الله صلى الله عليه وسلم قال: «أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله ويؤمنوا بما جئت به، فإذا فعلوا ذلك عصموا مني دمائهم أموالهم إلا بحقها وحسابهم على الله»",
    "foot_note": "1. (1/ 51). \n2. (3/ 65) 4407.",
    "book_id": "1067",
    "new_page_number": 10
  },
  {
    "serial_number": "5140404",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 12,
    "volume_number": 1,
    "text": "وانظر إلى المنزلة الرفيعة والمكانة العظيمة التي بلغها صديق هذه الأمة، حين صدق رسول الله حق تصديقه، وآمن به حق الإيمان، فعن عائشة رضي الله عنها قالت: «لما أسري بالنبي إلى المسجد الأقصى، أصبح يتحدث الناس بذلك فارتد ناس ممن كانوا آمنوا به وصدقوه، وسعوا بذلك إلى أبي بكر، فقال: هل لك إلى صاحبك، يزعم أنه أسري به الليلة إلى بيت المقدس؟ قال: أو قال ذلك؟. قال: نعم! قال: لئن كان قال ذلك لقد صدق، قالوا: أو تصدق أنه ذهب الليلة إلى بيت المقدس وجاء قبل أن يصبح؟! قال: نعم إني لأصدق فيما هو أبعد من ذلك، أصدقه بخبر السماء في غدوه أو روحة «فلذلك سمي الصديق .. أخرجه الحاكم (1) ، وصححه الألباني (2) . ومن لطائف هذا الباب التي تدل على منزلة الشيخين الجليلة، أن رسول الله صلى الله عليه وسلم قال لأصحابه: «بينما راع في غنمه عدا عليه الذئب فأخذ منها شاة فطلبها حتى استنقذها، فالتفت إليه الذئب، فقال له: من لها يوم السبع، ليس لها راع غيري؟! وبينما رجل يسوق بقرة وقد حمل عليها، فالتفتت إليه، فكلمته فقالت: إني لم أخلق لهذا، ولكني",
    "foot_note": "1. الصحيحة (1/ 615) 306. \n2. (3/ 1280) 3284.",
    "book_id": "1067",
    "new_page_number": 11
  },
  {
    "serial_number": "5140405",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 13,
    "volume_number": 1,
    "text": "خلقت للحرث، فقال الناس: سبحان الله! قال النبي صلى الله عليه وسلم «فإني أؤمن بذلك وأبو بكر وعمر بن الخطاب» أخرجه البخاري (1) .. وانظر. رحمك الله. إلى مبلغ الإيمان برسول الله صلى الله عليه وسلم عند الصحابة ومدى التصديق، فيما أخرجه مسلم (2) من حديثه النواس بن سمعان في قصة المسيح الدجال وفيه: «إنه خارج من خلة بين الشام والعراق، فعاث يمينا وعاث شمالا يا عباد الله فاثبتوا، قلنا: يا رسول الله وما لبثه في الأرض؟ قال: أربعون يوما، يوم كسنة، ويوم كشهر، ويوم كجمعة وسائر أيامه كأيامكم، قلنا يا رسول الله فذلك اليوم الذي كسنة أتكفينا فيه صلاة يوم؟ قال: لا؛ اقدروا له قدره» فها هو يخبرهم صلى الله عليه وسلم بطول يوم في عصر الدجال حتى يغدو كسنة، فلا يسأل أصحابه إلا عن الصلاة وما ذاك إلا لسرعة استجابتهم، ورسوخ فضلهم، ولا غروفهم من زكاهم ربهم … وفي يوم الأحزاب حين تمايزت الصفوف عن أصناف ثلاثة لا رابع لها إما مؤمن خالص، أو كافر جاهر بكفره، أو منافق كشف خبث سريرته يوم أصاب المسلمين ما أصابهم من جوع، وخوف، وتكالب",
    "foot_note": "1. (4/ 2252). \n2. صحيح سنن النسائي (6/ 43) 3176.",
    "book_id": "1067",
    "new_page_number": 12
  },
  {
    "serial_number": "5140406",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 14,
    "volume_number": 1,
    "text": "أعداؤهم عليهم، واعترض أثناء حفر الخندق للمسلمين صخرة بيضاء صلدة شق عليهم كسرها، فذهب سلمان رضي الله عنه. ليخبر رسول الله لا فقام صلى الله عليه وسلم بأبي هو أمي. وهو لها، فأخذ المعول من سلمان، فضرب الصخرة ضربة صدغها، وبرقت منها برقة أضاءت ما بين لابتيّ المدينة كأنها مصباح في ليل مظلم، فكبر رسول الله صلى الله عليه وسلم وكبّر صحابته، فضربها الثانية فكذلك، ثم الثالثة .. فسألوا رسول الله صلى الله عليه وسلم، فقال: «إني حين ضربت الأولى رفعت لي مدائن كسرى وما حولها ومدائن كثيرة حتى رأيتها بعيني، قال له من حضره من أصحابه: يا رسول الله ادع الله أن يفتحها علينا، ويغنمنا ديارهم، ويخرب بأيدينا بلادهم، فدعا رسول الله صلى الله عليه وسلم صلى الله عليه وسلم بذلك، ثم ضربت الثانية فرفعت لي مدائن قيصر وما حولها حتى رأيتها بعيني، فقالوا: يا رسول الله ادع الله أن يفتحها علينا، ويغنمنا ديارهم، ويخرب بأيدينا بلادهم، فدعا رسول الله صلى الله عليه وسلم بذلك، ثم ضربت الثالثة فرفعت لي مدائن الحبشة وما حولها من القرى حتى رأيتها بعيني. قال رسول الله صلى الله عليه وسلم عند ذلك: دعوا الحبشة ما ودعوكم». أخرجه النسائي وحسنه الألباني (1) ..",
    "foot_note": "1. التفسير (1/ 358).",
    "book_id": "1067",
    "new_page_number": 13
  },
  {
    "serial_number": "5140407",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 15,
    "volume_number": 1,
    "text": "وارع سمعك وبصرك لما تقرأ ترى ما بثه رسول الله صلى الله عليه وسلم من روح الأمل والبشارة في زمن جوع شكي فيه الصحابة إلى رسول الله الجوع، فرفعوا عن بطوهم عن حجر، فرفع رسول الله عن حجرين، وفي خوف شديد، ومع ذلك يؤمن صحابة رسول الله صلى الله عليه وسلم ما أخبرهم به في هذا الزمن الحرج ولا ريب فحكمه عدل، وخبره صدق، ولذلك كان أبو هريرة رضي الله عنه. يقول حين فتحت هذه الأمصار: افتتحوا ما بدا لكم فوالذي نفس أبي هريرة بيده ما افتتحتم من مدينة، ولا تفتحوها إلى يوم القيامة، إلا وقد أعطى الله محمد صلى الله عليه وسلم مفاتيحها قبل ذلك .. ومما مضى عليك بالمسارعة في الإيمان برسول الله صلى الله عليه وسلم، واحذر أن تورد الشبهة على الأحاديث النبوية، ولا تجعل قلبك كالإسفنجة تتلقى ما يرد عليها، واجتنب إثارة الشبهة وإيرادها على نفسك أو غيرك، فالشبهة خطّافة، والقلوب ضعيفة، وأكثر من يلقيها حمّالة الحطب. المبتدعة وأذنابهم. فتوقّهم، ولك في سلفك الصالح قدوة، فبهداهم اقتده ..",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 14
  },
  {
    "serial_number": "5140408",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 16,
    "volume_number": 1,
    "text": "2 - حتى يحبك الله .. ادعى قوم على عهد رسول الله أنهم يحبون الله، فنزلت آية المحنة {قُلْ إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَاللَّهُ غَفُورٌ رَحِيمٌ (31) قُلْ أَطِيعُوا اللَّهَ وَالرَّسُولَ فَإِنْ تَوَلَّوْا فَإِنَّ اللَّهَ لَا يُحِبُّ الْكَافِرِينَ} يقول ابن كثير: «هذه الآية حاكمة على كل من ادعى محبة الله، وليس هو على الطريقة المحمدية، فإنه كاذب في دعواه في نفس الأمر حتى يتبع الشرع المحمدي والدين المحمدي في جميع أقواله وأفعاله» (1) وقال ابن القيم: «يحبكم الله، إشارة إلى دليل المحبة وثمرتها وفائدتها محبة المرسل لكم، فما لم تحصل المتابعة فليست محبتكم له حاصلة، ومحبّته لكم منتفية» (2) ، فمحبة الله تكون ثابتة بمتابعة رسول الله صلى الله عليه وسلم في أعماله وأقواله وأخلاقه .. وتأمل. وفقك الله. ثمرة متابعة رسول الله: محبة الله، ومغفرة الذنوب واحذر من ترك طاعته {فَإِنْ تَوَلَّوْا فَإِنَّ اللَّهَ لَا يُحِبُّ الْكَافِرِينَ}",
    "foot_note": "1. مدارج السالكين (3/ 22). \n2. الصارم المسلول لشيخ الإسلام (56).",
    "book_id": "1067",
    "new_page_number": 15
  },
  {
    "serial_number": "5140409",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 17,
    "volume_number": 1,
    "text": "تعصي الإله وأنت تزعم حبه … هذا لعمري في القياس بديع لو كان حبك صادقا لأطعته … إن المحب لمن يحب مطيع يقول الإمام أحمد - رحمة الله -: «نظرت في المصحف فوجدت طاعة الرسول صلى الله عليه وسلم في ثلاثة وثلاثين موضعا» (1) ويقول شيخ الإسلام: «وقد أمر الله بطاعة رسوله صلى الله عليه وسلم في أكثر من ثلاثين موضعا من القرآن، وقرن طاعته بطاعته، وقرن بين مخالفته ومخالفته، كما قرن بين اسمه واسمه، فلا يذكر الله إلا وذكر معه» فطاعة الله ورسوله صلى الله عليه وسلم رحمة {وَأَطِيعُوا اللَّهَ وَالرَّسُولَ لَعَلَّكُمْ تُرْحَمُونَ} .. وطاعة الله ورسوله صلى الله عليه وسلم فوز {وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ وَيَخْشَ اللَّهَ وَيَتَّقْهِ فَأُولَئِكَ هُمُ الْفَائِزُونَ}، {وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيمًا} ..",
    "foot_note": "1. الفتاوى (19/ 103).",
    "book_id": "1067",
    "new_page_number": 16
  },
  {
    "serial_number": "5140410",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 18,
    "volume_number": 1,
    "text": "وطاعة الله ورسوله صلى الله عليه وسلم سبب دخول الجنة {وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا وَذَلِكَ الْفَوْزُ الْعَظِيمُ} .. بل إن طاعة الله ورسوله سبب عظيم في اللحاق بأولي الدرجات العلى {وَمَنْ يُطِعِ اللَّهَ وَالرَّسُولَ فَأُولَئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ وَحَسُنَ أُولَئِكَ رَفِيقًا} .. واحذر - هداك الله - مخالفة الله ورسوله فإن المخالفة سبب الشقاء في الدنيا والآخرة يقول تعالى: {وَيَوْمَ يَعَضُّ الظَّالِمُ عَلَى يَدَيْهِ يَقُولُ يَالَيْتَنِي اتَّخَذْتُ مَعَ الرَّسُولِ سَبِيلًا (27) يَاوَيْلَتَا لَيْتَنِي لَمْ أَتَّخِذْ فُلَانًا خَلِيلًا} وفي هذه الآية بيان حال مخالف الرسول صلى الله عليه وسلم حين يقوم الناس لرب العالمين فيعض الظالم على يديه أسفا وحسرة لمخالفة الرسول صلى الله عليه وسلم لكن أنى له الذكرى .. ؟! ويقول سبحانه: {يَوْمَ تُقَلَّبُ وُجُوهُهُمْ فِي النَّارِ يَقُولُونَ يَالَيْتَنَا أَطَعْنَا اللَّهَ وَأَطَعْنَا الرَّسُولَا (66) وَقَالُوا رَبَّنَا إِنَّا أَطَعْنَا سَادَتَنَا وَكُبَرَاءَنَا فَأَضَلُّونَا السَّبِيلَا (67) رَبَّنَا آتِهِمْ ضِعْفَيْنِ مِنَ الْعَذَابِ وَالْعَنْهُمْ لَعْنًا كَبِيرًا}",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 17
  },
  {
    "serial_number": "5140411",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 19,
    "volume_number": 1,
    "text": "وقارن بين حال المتبع والمخالف أو المبتدع، فالمتبعون في جنات فائزون مهتدون مرحومون، والمخالفون قد بلغ منهم الأسى مبلغه وعضوا الأنامل حسرات، وشروا في جهنم جماعات يلعن بعضهم بعضا، ويدعو بعضهم على بعض. ومن أدل الآيات الموجبة للتسليم لحكمه صلى الله عليه وسلم، والانقياد له قوله تعالى: {فَلَا وَرَبِّكَ لَا يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لَا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجًا مِمَّا قَضَيْتَ وَيُسَلِّمُوا تَسْلِيمًا} وفي هذه الآية أقسم سبحانه بأجل مقسم به - وهو نفسه عز وجل على أنه لا يثبت لهم إيمان، ولا يكونون من أهله، حتى يحكموا رسول الله في جميع موارد النزاع وفي جميع أبواب الدين فإن لفظه (ما) من صيغ العموم، ولم يقتصر الأمر على مجرد التحاكم، بل ضم إليه انشراح صدورهم بحكمه حيث لا يجدون في أنفسهم حرجا. ضيقا. من حكمه، بل يقبلوا حكمه بالانشراح، ويقابلوه بالتسليم لا أنهم يأخذونه على إغماض، ويشربونه على قذى، فإن هذا مناف للإيمان، ثم لم يقتصر سبحانه على ذلك حتى ضم إليه قوله تعالى: {وَيُسَلِّمُوا تَسْلِيمًا} فذكر الفعل مؤكدة بمصدره القائم على ذكره مرتين، وهو التسليم والخضوع والانقياد طوعًا ورضًا، وتسليمًا لا قهرًا ومصابرة، كما يسلم المقهور لمن قهره كرهًا، بل تسليم عبد مطيع لمولاه وسيده",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 18
  },
  {
    "serial_number": "5140412",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 20,
    "volume_number": 1,
    "text": "الذي هو أحب شيء إليه، يعلم أن سعادته وخلاصه في تسليمه إليه، وليعلم بأنه أولى به من نفسه، وأبر به منها، وأقدر على تخليصها، كما قال تعالى: {النَّبِيُّ أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ} ومتى أراد العبد أن يعلم قبوله لحكم رسول الله صلى الله عليه وسلم، وتسليمه له، فلينظر في حاله، ويطالع قلبه عند ورود حكمه على خلاف هواه وغرضه، أو على خلاف ما قلد فيه أسلافه من المسائل الكبار والصغار {بَلِ الْإِنْسَانُ عَلَى نَفْسِهِ بَصِيرَةٌ} فسبحان الله كم من حزازة في نفوس كثير من الناس من كثير النصوص بودهم أن لولم ترد!! وكم من حرارة في أكبادهم منها!! وكم من شجي في حلوقهم منها ومن موردها!! ستبدولهم تلك السرائر بالذي يسود ويخزي يوم تبلى السرائر {وَمَا كَانَ لِمُؤْمِنٍ وَلَا مُؤْمِنَةٍ إِذَا قَضَى اللَّهُ وَرَسُولُهُ أَمْرًا أَنْ يَكُونَ لَهُمُ الْخِيَرَةُ مِنْ أَمْرِهِمْ وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ فَقَدْ ضَلَّ ضَلَالًا مُبِينًا} وأخرج البخاري (1) من حديث أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: «كل أمتي يدخلون الجنة إلا من أبى، قالوا: يا رسول الله ومن يأبى؟ قال: من أطاعني دخل الجنة ومن عصاني فقد",
    "foot_note": "1. (6/ 2655).",
    "book_id": "1067",
    "new_page_number": 19
  },
  {
    "serial_number": "5140413",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 21,
    "volume_number": 1,
    "text": "أبى»، وأخرج - أيضا من حديث جابر قال: «جاءت الملائكة إلى النبي صلى الله عليه وسلم وهو نائم. فقال بعضهم إنه نائم. وقال بعضهم: إن العين نائمة، وإن القلب يقظان. فقالوا: إن لصاحبكم هذا مثلًا، فقالوا: مثله كمثل رجل بنى دارًا، وجعل فيها مأدبة، وبعث داعيا، فمن أجاب الداعي دخل الدار، وأكل من المأدبة، ومن لم يجب الداعي لم يدخل الدار، ولم يأكل من المأدبة. فقالوا: أولوها له يفقهها. فقال بعضهم: الدار الجنة، والداعي محمد صلى الله عليه وسلم، فمن أطاع محمد عليه الصلاة والسلام فقد أطاع الله، ومن عصى محمدًا فقد عصى الله، ومحمد فرق بين الناس» وفي حديث العرباض بن ساريه. رضي الله عنه. قال: «وعظنا رسول الله صلى الله عليه وسلم موعظة وجلت منها القلوب، وذرفت منها العيون، فقلنا يا رسول الله كأنها موعظة مودع، فأوصنا. قال: أوصيكم بتقوى الله، والسمع والطاعة، وإن تأمر عليكم عبد، وإنه من يعش منكم فسيرى اختلافا كثيرا، فعليكم بسنتي وسنة الخلفاء الراشدين المهديين عضوا",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 20
  },
  {
    "serial_number": "5140414",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 22,
    "volume_number": 1,
    "text": "عليها بالنواجد، وإياكم ومحدثات الأمور فإن كل بدعة ضلالة» أخرجه أبو داوود، وصححه الألباني (1) .. يقول الإمام الخطابي: - إنما أراد بذلك الجد في لزوم السنة، فعل من أمسك بشيء بين أضراسه، وعض عليه مانعا له أن ينتزع، وذلك أشد ما يكون التمسك بالشيء، إذ كان ما يمسكه بمقاديم فمه أقرب تناولا وأسهل نزعا» وقد حوى الحديث ركيزتين أساسيتين: 1/ الإتباع .. 2/ وذم الابتداع .. وكل ما تركه الرسول صلى الله عليه وسلم من جنس العبادات، ولم يفعله مع وجود المقتضي لفعله على عهده صلى الله عليه وسلم ففعله بدعه، وتركه سنه، كالاحتفال بالمولد، وإحياء ليلة الإسراء والمعراج، وإحياء ليلة الهجرة، ورأس السنة وغيرها، لقول رسول الله صلى الله عليه وسلم: «من عمل عملا ليس عليه أمرنا فهو رد». وقال ابن مسعود: «اتبعوا ولا تبتدعوا فقد كفيتم» (2) .",
    "foot_note": "1. (4/ 200) 4607. \n2. أخرجه الدارمي (1/ 69)، واللاكائي (1/ 89)، وقال الهيثمي: «رجاله رجال الصحيح» مجمع الزوائد (1/ 81) ..",
    "book_id": "1067",
    "new_page_number": 21
  },
  {
    "serial_number": "5140415",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 23,
    "volume_number": 1,
    "text": "يقول الإمام مالك: «فما لم يكن يومئذ دينا، فلا يكون اليوم دينا» (1) ، ويقول شيخ الإسلام: «والترك الراتب سنة، كما أن الفعل الراتب سنّة» (2) وتعال لنقف على حال السلف الصالح في اتباعهم، وسرعة اقتدائهم بحبيبهم صلى الله عليه وسلم .. أخرج البخاري (3) عن البراء رضي الله عنه قال: «لما قدم رسول الله صلى الله عليه وسلم المدينة صلّى نحو بيت المقدس ستّة عشر أو سبعة عشر شهرًا، وكان يحبّ أن يُوَجّه إلى الكعبة فأنزل الله تعالى {قَدْ نَرَى تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ فَلَنُوَلِّيَنَّكَ قِبْلَةً تَرْضَاهَا} فتوجه نحو الكعبة، وصلّى معه رجل العصر ثم خرج فمرّ على قوم من الأنصار فقال: «هو يشهد أنه صلى مع النبي صلى الله عليه وسلم، وأنه قد وجه إلى الكعبة»، فانحرفوا وهم ركوع في صلاة العصر .. فما أسرع تأسيهم فلم يترددوا في التمسك بما جاء به، بل لم ينتظروا رفع رؤوسهم من الركوع، وبادروا بالتوجه إلى حيث توجه",
    "foot_note": "1. الاعتصام للشاطبي (1/ 149). \n2. الفتاوى (26/ 172). \n3. (4/ 1634) 4222.",
    "book_id": "1067",
    "new_page_number": 22
  },
  {
    "serial_number": "5140416",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 24,
    "volume_number": 1,
    "text": "الحبيب صلى الله عليه وسلم إلى الكعبة المشرفة وهم ركوع .. وأخرج أبوداود وصحح الألباني (1) من حديث أبي ثعلبة الخشني قال: «كان الناس إذا نزلوا منزلا تفرقوا في الشعاب والأودية فقال رسول الله صلى الله عليه وسلم إن تفرقكم في هذه الشعاب والأودية إنما ذلكم من الشيطان فلم ينزلوا بعد ذلك منزلا إلا انضم بعضهم إلى بعض» حتى يقال: «لو بسط عليهم ثوب لعمهم» فبمجرد أن طرق الأمر أسماعهم، كان فعلهم يترجم قوله {سَمِعْنَا وَأَطَعْنَا} ويأتي الراوي ليصف حالهم بعد الأمر «لو بسط عليهم ثوب لوسعهم» … وقد يخفى على المسلمة الحكم الشرعي في أمر من أمور حياتها، ومسألة في دينها، ويعزّ عليها الإجتهاد والتماس النصوص الشرعية، فالمتعين هنا التورع عن العمل بلا علم وسؤال الراسخين في العلم؛ لمعرفة الحق المبين، أخرج مسلم (2) من حديث أسماء قالت: جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت: يا رسول الله إن لي ابنة عريسا،",
    "foot_note": "1. (2/ 498) 2288 - وتأمل إنكار رسول الله صلى الله عليه وسلم تفرق المسلمين أثناء النزول في السفر، وعزوه إلى الشيطان، {وَلَا يَزَالُونَ مُخْتَلِفِينَ (118) إِلَّا مَنْ رَحِمَ رَبُّكَ} فما بالهم تفرقوا اليوم في كل شيء إلا من رحم الله، وإلى الله المشتكى .. \n2. (3/ 1676) 2122.",
    "book_id": "1067",
    "new_page_number": 23
  },
  {
    "serial_number": "5140417",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 25,
    "volume_number": 1,
    "text": "أصابتها حصبة، فتمزق شعرها، أفأصله؟ قال: «لعن الله الواصلة والمستوصلة» .. وتأمل. أعانك الله على طاعته. لهجة الأم الحنون التي تفيء بظلال العاطفة والمحبة الوارفة، وهي تستأذن رسول الله صلى الله عليه وسلم في وصل شعر ابنتها الناقهة من المرض، حديثة العهد بالعرس، إن المشاعر الجياشة التي تضطرب في فؤاد تلك الوالدة، والرغبة الجامحة لتزيين بنيتها، وتحقيق فرحتها، لم تسوغ لها ارتكاب المنكر .. فلم تطب نفسا بالوصل بحجّة الجهل بالحكم، أو احتياج العروس إليه، بل أتت تستفتي رسول الله، راضية بحكمه، مسلمة لأمره .. وما أحوجنا في هذا العصر الذي شاع فيه حب الملذات، وإرضاء الشهوات بالمحرمات، أن نطوع أنفسنا لما يرضي ربنا عز وجل وبجعل هوانا تبعا لسنة نبينا صلى الله عليه وسلم حتى نحب ما يحبه وندع ما يبغضه مقتدين في ذلك بسلفنا الصالح … ولا يظنن أحد أن الامتثال كان سمة أفراد من هذا العصر المشرق فحسب بل كان صبغة جميع أفراده، أخرج أبو داوود وصحح",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 24
  },
  {
    "serial_number": "5140418",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 26,
    "volume_number": 1,
    "text": "الألباني (1) من حديث أبي أسيد الأنصاري رضي الله عنه أنه سمع رسول الله صلى الله عليه وسلم وهو خارج من المسجد، فاختلط الرجال مع النساء في الطريق، فقال: \" استأخرن فإنه ليس لكن أن تحققن الطريق، عليكن بحافات الطريق» فكانت المرأة تلتصق بالجدار حتى إن ثوبها يتعلق بالجدار من التصاقها به .. وقال إبراهيم بن مجمع: «كنا نستعين على حفظ الحديث بالعمل به» وقال أحمد بن حنبل: «ما كتبت حديثا إلا وقد عملت به، حتى مرّ بي أن النبي صلى الله عليه وسلم «احتجم وأعطى أبا شيبة دينارًا، فاحتجمت وأعطيت الحجام دينارًا» (2) فابذل وسعك في حفظ العلم حفظ رعاية بالعلم والإتباع لا على فعل الواجبات وترك المحرمات فحسب، بل في الحرص على فعل المسنونات، وترك المكروهات، وتميز في عامة أمرك باستعمال آثار",
    "foot_note": "1. (3/ 989) 4392. \n2. ينظر: فتح المغيث للسخاوي (2/ 360).",
    "book_id": "1067",
    "new_page_number": 25
  },
  {
    "serial_number": "5140419",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 27,
    "volume_number": 1,
    "text": "رسول الله ما أمكنك ووظف السنن على نفسك، فإن الله تعالى يقول: {لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ} فاشتر نفسك اليوم فإن السوق قائمة، والثمن موجود، والبضائع رخيصة، وسيأتي على تلك السوق والبضائع يوما لا تصل فيه إلى قليل ولا كثير، ذلك يوم التغابن، يوم يعض الظالم على يديه ..  3 - حتى من نفسك .. اعلم. وفقك الله. أن حبّ رسول الله صلى الله عليه وسلم من الإيمان، بل إنه مقدم على حب النفس، كما روى البخاري (1) من حديث عبد الله بن هشام. رضي الله عنه قال: كنا مع النبي صلى الله عليه وسلم وهو آخذ بيد عمر. رضي الله عنه. فقال له عمر: يا رسول الله لأنت أحب إلي من كل شيء إلا من نفسي، فقال النبي صلى الله عليه وسلم: «لا والذي نفسي بيده حتى أكون أحبّ إليك من نفسك» فقال له عمر: «فإنه الآن والله!! لأنت أحب إليّ من نفسي» قال: «الآن يا عمر» ومما يلاحظ في قوله «والذي نفسي بيده» أنه لا أقسم وهو الصادق المصدوق، فالقسم للتأكيد، وقوله «الآن يا عمر» يعني: كمل",
    "foot_note": "1. (1/ 14) 14.",
    "book_id": "1067",
    "new_page_number": 26
  },
  {
    "serial_number": "5140420",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 28,
    "volume_number": 1,
    "text": "إيمانك (1) .. مصداق هذا الحديث قوله تعالى: {النَّبِيُّ أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ}، ومقدم على حب الوالد والولد كما أخرج البخاري (2) من حديث أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: «فوالّذي نفسي بيده لا يؤمن أحدكم حتى أكون أحبّ إليه من والده وولده». بل لا بدّ أن تكون محبته مقدّمة على الأهل والمال والناس أجمع، أخرج مسلم (3) من حديث أنس رضي الله عنه. قال: قال رسول الله صلى الله عليه وسلم «لا يؤمن أحدكم حتى أكون أحب إليه من أهله وماله، والناس أجمعين» فالمتأمل فيما تقدم من الأحاديث يجد أنواع المحبّة؛ فالمحبة إما محبة إجلال وتعظيم كمحبة الوالد، وإما محبة تحنن وود كمحبة الولد، وإما محبة لأجل الإحسان وصفات الكمال كمحبة الناس بعضهم بعضا، وإما محبة غنا كمحبة المال، وإما محبة بقاء كمحبة النفس، ولا يؤمن العبد حتى يكون حب الرسول صلى الله عليه وسلم عنده أشد من هذا المحابّ كلها،",
    "foot_note": "1. عمدة القارئ (23/ 169) \n2. (1/ 14) 15. \n3. (1/ 67) 44.",
    "book_id": "1067",
    "new_page_number": 27
  },
  {
    "serial_number": "5140421",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 29,
    "volume_number": 1,
    "text": "ولقد هدد الله سبحانه وتعالى من كان شيء من الخلق أحب إليه من الله ورسوله فقال {قُلْ إِنْ كَانَ آبَاؤُكُمْ وَأَبْنَاؤُكُمْ وَإِخْوَانُكُمْ وَأَزْوَاجُكُمْ وَعَشِيرَتُكُمْ وَأَمْوَالٌ اقْتَرَفْتُمُوهَا وَتِجَارَةٌ تَخْشَوْنَ كَسَادَهَا وَمَسَاكِنُ تَرْضَوْنَهَا أَحَبَّ إِلَيْكُمْ مِنَ اللَّهِ وَرَسُولِهِ وَجِهَادٍ فِي سَبِيلِهِ فَتَرَبَّصُوا حَتَّى يَأْتِيَ اللَّهُ بِأَمْرِهِ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ} يقول مجاهد والحسن (1) - رحمهما الله - في تفسير قوله تعالى {حَتَّى يَأْتِيَ اللَّهُ بِأَمْرِهِ} «بعقوبة آجلة أو عاجلة، ثم فسقهم الله بتمام الآية، وأعلمهم أفهم ممن ضل ولم يهده الله». يقول الزمخشري (2) : - «وهذه آية شديدة لا ترى أشد منها» ويقول القرطبي (3) : - «وفي الآية دليل على وجوب حب الله ورسوله ولا خلاف في ذلك، وأن ذلك مقدم على كل محبوب» ولن تجد حلاوة الإيمان التي تعني استلذاذ الطاعات، وتحمل المشاق في الدين، وإيثار ذلك على عرض الدنيا، الذي يعني سلامة",
    "foot_note": "1. تفسير القرطبي (8/ 95). \n2. الكشاف (2/ 81). \n3. تفسير القرطبي (8/ 95).",
    "book_id": "1067",
    "new_page_number": 28
  },
  {
    "serial_number": "5140422",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 30,
    "volume_number": 1,
    "text": "قلبك وصحتك حتى تكمل محبة الله ورسوله لا تكتفي منها بأصل الحب، بل لابد أن يكون الله ورسوله أحب إليك من مما سواهما، وبفرع المحبة بأن لا يحب المرء إلا لله، ولا بد أن يدفع المرء ضدها بأن يكره أن يعود إلى الكفر أو الفسق بعد أن هداه الله، أخرج الشيخان (1) من حديث أنس مرفوعا: «ثلاث من كن فيه وجد حلاوة الإيمان: أن يكون الله ورسوله أحب إليه مما سواهما، وأن يحب المرء لا يحبه إلا الله، وأن يكره أن يعود في الكفر كما يكره أن يقذف في النار» وأبشر أيها المحب بمرافقتك من أحببت، فقد روى مسلم (2) من حديث أنس بن مالك رضي الله عنه. قال: «جاء رجل إلى رسول الله صلى الله عليه وسلم فقال: يا رسول الله متى الساعة؟ قال: «وما أعددت للساعة؟» قال: حب الله ورسوله، قال: «فإنك مع من أحببت» قال أنس رضي الله عنه.: فما فرحنا بعد الإسلام فرحا أشد من قول النبي صلى الله عليه وسلم «فإنك مع من أحببت» قال أنس: «فانا أحب الله ورسوله وأبا بكر وعمر رضي الله عنهما فأرجو الله أن أكون معهم، وأن أعمل بأعمالهم»",
    "foot_note": "1. البخاري (1/ 60) 16، مسلم (1/ 66) 43. \n2. (4/ 2032) 2639.",
    "book_id": "1067",
    "new_page_number": 29
  },
  {
    "serial_number": "5140423",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 31,
    "volume_number": 1,
    "text": "ومحبة الله ورسوله على درجتين: محبة واجبة، وهي درجة المقتصدين وتقتضي أن يكون الله ورسوله أحب إليه مما سواهما، بحيث لا يبغض شيئا يبغضه وإنما يحب جميع ما أوجبه الله ورسوله، ويبغض ما حرمه الله ورسوله، يقول الله تعالى: {ذَلِكَ بِأَنَّهُمُ اتَّبَعُوا مَا أَسْخَطَ اللَّهَ وَكَرِهُوا رِضْوَانَهُ فَأَحْبَطَ أَعْمَالَهُمْ} وأما المستحبة وهي درجة السابقين وتكون بمحبة ما أحبه الله من النوافل والفضائل محبة تامة، وهذا حال المقربين الذين قربهم الله إليه، جعلني الله وإياك منهم (1) .. وانقسم الناس في محبة رسول الله صلى الله عليه وسلم إلى أقسام ثلاثة: - أهل إفراط، وأهل تفريط، ووسط بينهما وكذلك جعل الله أمة محمد أمة وسطا .. أما الأوائل منهم فهم الذين ابتدعوا أمورا لم يشرعها الله ورسوله، ظنا منهم أن فعل هذه الأمور هو علامة المحبة وبرهانها، ونسوا قوله تعالى: {فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ} فاحتفلوا بمولده ولو كان",
    "foot_note": "1. قاعدة في المحبّة لشيخ الإسلام (91).",
    "book_id": "1067",
    "new_page_number": 30
  },
  {
    "serial_number": "5140424",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 32,
    "volume_number": 1,
    "text": "خيرًا ما سبقوه إليه، وبالغوا في مدحه، ووقعوا في الغلو الذي نهاهم عنه، فوا عجبي لمحبتهم المزعومة، وفي ذلك يقول قائلهم: يا أكرم الخلق مالي من ألوذ به … سواك عند حلو الحادث العمم إن لم تكن في معادي آخذا بيدي … فضلا وإلا فقل يا زلة القدم (1) واشتغلوا بحفظ المدائح النبوية عن حفظ سنته، فسار القوم ووقفوا، ووصل القوم وانقطعوا، حتى بلغ الحال ببعضهم أن صار يدعو رسول الله من دون الله، ويحلف به، ويتمسح بالحجرة التي فيها قبره إلى غير ذلك من الشركيّات التي تفعل بدعوى محبة رسول الله صلى الله عليه وسلم وهي منافية لها بعيدة عنها .. أما المفرط فهو الذي لم يرع حق رسول الله صلى الله عليه وسلم في وجوب تقديم محبته على محبة النفس والأهل والمال .. ولم يعزره، ويجله، ويطيع أمره، ويتبع سنته، وما ذاك إلا بسبب ذنبه، وإغراقه في شهوات نفسه، وتقديم هواه على ما جاء في شرع ربه، ثم أنه اعتقد جاهل",
    "foot_note": "1. ديوان البويصري (238).",
    "book_id": "1067",
    "new_page_number": 31
  },
  {
    "serial_number": "5140425",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 33,
    "volume_number": 1,
    "text": "قومه أن مجرد التصديق يكفي في تحقيق الإيمان، حاله كحال أهل الإرجاء الذين يؤخرون العمل عن مسمى الإيمان، ويقولون إن الإيمان هو التصديق بالقلب فقط، أو تصديق القلب وإقرار اللسان، وما أكثر هؤلاء. لا كثرهم الله. في هذا الزمان .. وأما القسم الثالث وهم من وفق الله فالذين توسطوا بين الطرفين وأصحاب هذا القسم هم السلف من الصحابة والتابعين ومن سار على نهجهم إلى يوم الدين، فأحبوا النبي صلى الله عليه وسلم فوق محبة النفس والولد والأهل وجميع الخلق، وتابعوه، وعزروه، ونصروه، وحفظوا سنته رعاية ورواية، واعتقدوا أنه ليس من المحبة في شيء الغلوفي حقه، وقدره، ووصفه بأمور قد اختص الله بها وحده، بل علموا أن هذا مخالفة ومضادة لتلك المحبة {فَلْيَحْذَرِ الَّذِينَ يُخَالِفُونَ عَنْ أَمْرِهِ أَنْ تُصِيبَهُمْ فِتْنَةٌ أَوْ يُصِيبَهُمْ عَذَابٌ أَلِيمٌ} .. ومن علامات هذه المحبة: الحرص على رؤيته، والإكثار من ذكره بالصلاة والسلام عليه، ولزوم طاعته، وحفظ ونصر سنته و، والذب عن عرضه، ومحبة من أحب، وبغض من أبغض. وقد مضى بعضها، وسيأتي البعض الآخر بشيء من الذكر. إن شاء الله …",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 32
  },
  {
    "serial_number": "5140426",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 34,
    "volume_number": 1,
    "text": "وللسلف الصالح في محبة رسول الله صلى الله عليه وسلم أعطر الذكر، وإليك بعضا من سير القوم في صدق المحبة، وعظيم العاطفة: سئل علي بن أبي طالب رضي الله عنه كيف كان حبكم لرسول الله صلى الله عليه وسلم؟ قال: كان والله أحب إلينا من أموالنا وأولادنا وآبائنا وأمهاتنا، ومن الماء البارد على الظمأ (1) .. وقد سأل أبو سفيان بن حرب. وهو على الشرك يومئذ. زيد بن الدثنة رضي الله عنه حينما أخرجه أهل مكة من الحرم ليقتلوه، أنشدك الله يا زيد أتحب أن محمدا الآن مكانك نضرب عنقه، وأنك في أهلك؟ قال: والله ما أحب أن محمدا في مكانه الذي هو فيه تصيبه شوكة تؤذيه، وأني جالس في أهلي .. قال أبو سفيان: ما رأيت من الناس أحدا يحب أحدة كحب أصحاب محمد محمدا (2) … وجاء رجل من الأنصار إلى رسول الله صلى الله عليه وسلم، فقال: لأنت أحب إلي من نفسي وولدي وأهلي ومالي ولولا أني آتيك فأراك لظننت",
    "foot_note": "1. الشفا (2/ 568). \n2. البداية والنهاية (4/ 65) وأخرجه البيهقي يفي الدلائل عن حبيب (3/ 326).",
    "book_id": "1067",
    "new_page_number": 33
  },
  {
    "serial_number": "5140427",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 35,
    "volume_number": 1,
    "text": "أني سأموت، وبكى الأنصاري. فقال له رسول الله صلى الله عليه وسلم: - «ما أبكاك» قال: ذكرت أنك ستموت، ونموت فترفع مع النبيين، ونحن إن دخلنا الجنة كنا دونك. فلم يخبره النبي صلى الله عليه وسلم بشيء فأنزل الله عز وجل على رسوله: (ومن يطع الله والرسول فأولئك مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين وحسن أولئك رفيقا) فقال له الرسول صلى الله عليه وسلم: «أبشر» (1) وروى الطبراني عن سعد بن أبي وقاص قال: «مر رسول الله صلى الله عليه وسلم بامرأة من بني دينار، وقد أصيب زوجها، وأخوها، وأبوها مع رسول الله صلى الله عليه وسلم بأحد، فلما نعوا لها قالت: ما فعل رسول الله صلى الله عليه وسلم؟ قالوا: خيرا يا أم فلان هو بحمد الله كما تحبين، قالت: أرونيه حتى أنظر إليه. قال: فأشير إليه حتى رأته. قالت: كل مصيبة بعدك جلل (2) .. وما هذا الإيثار الذي تضمنته هذه الكلمات إلا تعبيرا عما تكنه نفوسهم من المحبة له صلى الله عليه وسلم",
    "foot_note": "1. أخرجه البيهقي في الشعب (13) وله طرق يقوي بعضها بعضا. \n2. جلل: أي: هيّنة ويسيرة، والكلمة من الأضداد، تكون للحقير والعظيم، النهاية (1/ 289)، والحديث قال الهيثمي عنه في المجمع: رواه الطبراني في الأوسط عن شيخه محمد بن شعيب، ولم أعرفه وبقيّة رجاله ثقات.",
    "book_id": "1067",
    "new_page_number": 34
  },
  {
    "serial_number": "5140428",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 36,
    "volume_number": 1,
    "text": "واسمع إلى قول قيس بن صرمة الأنصاري إذ يقول حين قدم النبي صلى الله عليه وسلم المدينة: ثوى في قريش بضع عشر حجة … يذكر لو يلقى حبيبا مؤاتيا ويعرض في أهل المواسم نفسه … فلم ير من يؤوي ولم ير داعيا فلما أتانا واستقرت به النوى … وأصبح مسرورا بطيبة راضيا بذلنا له الأموال من حل مالنا … وأنفسنا عند الوغى والتأسيا نفادي الذي عادي من الناس كلهم … جميعا وإن كان الحبيب المصافيا ونعلم أن الله لا رب غيره … وأن رسول الله أصبح هاديا فهل رأيت حبا أعظم من حب أصحاب محمد صلى الله عليه وسلم له، وبعد ما تقدم؛ تذكر كم مرة قدمت محبة نفسك ووالدك وولدك وزوجك على محبة رسول الله صلى الله عليه وسلم، وكم مرة أطعتهم وعصيته، وحكمتهم",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 35
  },
  {
    "serial_number": "5140429",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 37,
    "volume_number": 1,
    "text": "في مالك، وسلمتهم نفسك، فما أعجب حالك، كيف تستبدل الذي هو أدني بالذي هو خير، وتقرأ {وَيَوْمَ يَعَضُّ الظَّالِمُ عَلَى يَدَيْهِ يَقُولُ يَالَيْتَنِي اتَّخَذْتُ مَعَ الرَّسُولِ سَبِيلًا} واعلم أنك متى أرضيت الله أرضى عنك الناس كلهم ولو سخطوا، وإن ابتغيت رضاهم بغضب الله غضب الله عليك وأغضب عليك الناس ولو رضوا، فأحكم معيارك، واجعله رضا ربك، تفز بإذن مولاك، بوركت، وبورك عملك.  4 - هل اشتقت له؟! وتمنيت صحبته؟! لا ريب أن غاية المحب أن يرى محبوبه، وأن يحظى بصحبته، وأن يكحل عينه برؤيته حتى ولو كانت هذه الرؤيا مقابل بذل المال والأهل، ولقد نص على هذه العلامة رسولنا صلى الله عليه وسلم فيما أخرجه مسلم (1) من حديث أبي هريرة رضي الله عنه. أن رسول الله صلى الله عليه وسلم قال: «من أشد أمتي لي حبا ناس يكونون بعدي يود أحدهم لو رآني بأهله وماله» .. وقد وصف رسول صلى الله عليه وسلم أهل هذه العلامة من الأمة بأنهم من أشد الناس محبة الرسول الله، ولا يقدر حق هذه الأمنية إلا",
    "foot_note": "1. (8/ 145).",
    "book_id": "1067",
    "new_page_number": 36
  },
  {
    "serial_number": "5140430",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 38,
    "volume_number": 1,
    "text": "صاحب الإيمان الذين ترسخ في قلبه حب رسول الله صلى الله عليه وسلم، وضربت شجرة المحبة بعروقها في قلبه، فأينعت ثمارها، وطاب أكلها، ولا يبالي أحدهم أن يبذل أهله وماله للحظوة برؤيته صلى الله عليه وسلم، ولسان حال أحدهم يقول: ما أعظم الأمنية، وما أرخص الثمن .. فحريّ بهذه النفوس أن تنال شهادة النبي صلى الله عليه وسلم لها بأنها أشد القلوب محبة له، ولا تعجب لمن اشتاق لرؤية من اصطفاه الله، وهداه الله به، من حاز على خصال الكمال التي هي في جبلة الحلقة، وأحاط بشتات محاسنها دون خلاف بين نقله الأخبار لذلك، فلم يكن بالطويل البائن ولا بالقصير، ولا بالأبيض الأمهق (1) ولا بالآدم، ولا بالجعد القطط ولا بالسبط (2) ، مربوعًا بعيد مابين المنكبين، ششن (3) الكتفين والقدمين، ضخم الرأس، ضخم الكراديس (4) ، وطويل المسربة (5) ، أزهر اللون، واسع الجبين، أزج (6) الحواجب سوابغ في",
    "foot_note": "1. أي: شديد السمر. \n2. القطط: الشعر الذي فيه إلتواء، والبسط: بالكسر أي المسترسل. \n3. بفتح الشين، وسكون الثاء أي غليظ الأصابع والراحة. \n4. رؤوس العظام. \n5. الشعر الدقيق الذي يبدأ من الصدر، وينتهي بالسرة. \n6. مقوس الحاجبين.",
    "book_id": "1067",
    "new_page_number": 37
  },
  {
    "serial_number": "5140431",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 39,
    "volume_number": 1,
    "text": "غير قرن (1) ، بينهما عرق يكره الغضب، أقنى العرنين (2) ، أهدب الأشفار (3) ، أدعج العينين (4) ، له نور يعلوه، كث اللحية، سهل الخدين، ضليع الفم (5) ، مفلج الأسنان (6) ، أحسن الناس عنقا كأن عنقه جيد دمية في صفاء فضة (7) ، خافض الطرف الطرف نظرة إلى الأرض أطول من نظره إلى السماء، جل نظره الملاحظة، إذا ضحك ضحك عن مثل سنا البرق، وعن مثل حب الغمام، وإذا تكلم رؤي كالنور يخرج من ثناياه .. قال أبو هريرة: ما رأيت شيئا أحسن من رسول الله كأن الشمس تحري في وجهه، وإذا ضحك يتلألأ في الحدر .. وقالت أم معبد: أجمل الناس من بعيد، وأحلاه وأحسنه من قريب ..",
    "foot_note": "1. أي كاملات غير مقترنات. \n2. العرنين، بكسر ال عين: الأنف .. أي طويل الأنف مع دقة أرنبته. \n3. طويل شعر الرمش كثيرة. \n4. شديد سواد العين. \n5. واسعة، والعرب تمدح ذلك؛ لأن سعته دليل على الفصاحة. \n6. الفلج: انفراج ما بين الأسنان. \n7. الجيد: العنق، والدمية الصورة المتَّخذة من عاج أو غيره، والمراد أنه في اعتدال وحسن هيئته وكمال وإشراق.",
    "book_id": "1067",
    "new_page_number": 38
  },
  {
    "serial_number": "5140432",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 40,
    "volume_number": 1,
    "text": "وقال علي: من رآه بديهة هابه، ومن خالطه معرفة أحبه، يقول ناعته: لم أر قبله ولا بعده مثله صلى الله عليه وسلم (1) .. هذا في خَلْقِه، أما خُلُقه فقد كان القرآن، وزكاه ربه فقال سبحانه: {وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ}، فهل بعد هذا الكمال الخَلقي والخُلُقي لا تشتاق إليه بل تبذل دون رؤيته الأهل والمال .. وقد كان لسلفنا الصالح - رضوان الله عليهم - عظيم الشوق للقياه، والحرص على صحبته. وإليك مواقف خلّدها التاريخ، وحفظتها السير: أخرج البخاري (2) عن عائشة رضي الله عنها قالت: «بينما نحن جلوس في بيت أبي بكر في نحر الظهيرة، قال قائل لأبي بكر: هذا رسول الله صلى الله عليه وسلم متقنعًا» (3) - في ساعة لم يكن يأتينا فيها - فقال أبوبكر: فداء له أبي وأمي، والله ما جاء به في هذه الساعة إلا أمر، قالت: فجاء فاستأذن، فأذن له، فدخل، فقال النبي صلى الله عليه وسلم لأبي بكر: أخرج من عندك، فقال أبوبكر: إنما هم أهلك بأبي أنت يا رسول",
    "foot_note": "1. الشفا (46). \n2. (3/ 1418) 3691. \n3. مغطيا رأسه.",
    "book_id": "1067",
    "new_page_number": 39
  },
  {
    "serial_number": "5140433",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 41,
    "volume_number": 1,
    "text": "الله قال: فإني قد أذن لي في الخروج، فقال أبوبكر: الصحبة بأبي أنت يا رسول الله، قال رسول الله: نعم «لم يفكر أبوبكر رضي الله عنه في مخاوف السفر ومخاطره، وإنما كان مولعًا بشرف صحبته وإن ترك أهله وماله، فجاءته البشارة فانحدرت دمعته على لحيته الشريفة فرحا بالظفر، وجذلا بالفوز، يقول الحافظ: زاد إسحاق في روايته: «قالت عائشة رضي الله عنها: فرأيت أبا بكر يبكي، وما كنت أحسب أن أحدا يبكي من الفرح» (1) وقد انتظر الأنصار مقدم رسول الله صلى الله عليه وسلم إلى المدينة بعد خروجه من مكة، أخرج البخاري (2) من حديث عروة قال: «وسمع المسلمون بالمدينة مخرج رسول الله صلى الله عليه وسلم من مكة فكانوا يقعدون كل غداة إلى الحرة فينتظرونه حتى يردّهم حر الظهيرة» وفي رواية ابن سعد (3) : «فإذا أحرقتهم الشمس رجعوا إلى منازلهم»",
    "foot_note": "1. الفتح (7/ 235). \n2. (3/ 1425) 3702. \n3. الطبقات (1/ 233).",
    "book_id": "1067",
    "new_page_number": 40
  },
  {
    "serial_number": "5140434",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 42,
    "volume_number": 1,
    "text": "ويحدّثنا الإمام أحمد (1) في حديث أنس أن عدد من استقبل رسول الله صلى الله عليه وسلم كان زهاء خمسمائة من الأنصار انتهوا إلى رسول الله وأبي بكر، فقالوا: «انطلقنا آمنين مطيعين» وأمّا أهل المدينة فاسمع الصدّيق يحدثك عن استقبالهم لخير ضيف نزل عليهم: \" ومضى رسول الله صلى الله عليه وسلم وأنا معه حتّى قدمنا المدينة، فتلقاه الناس، فخرجوا في الطريق وعلى الأجاجير (2) ، فاشتدّ الخدم والصبيان في الطريق يقولون: الله أكبر؛ جاء رسول الله، جاء محمد صلى الله عليه وسلم، قال: وتنازع القوم أيهم ينزل عليه .. يقول أنس: «فما رأيت يوما قط أنور ولا أحسن من يوم دخل رسول الله صلى الله عليه وسلم وأبو بكر المدينة» (3) .. ويقول البراء: «فما رأيت أهل المدينة فرحوا بشيء فرحهم برسول الله صلى الله عليه وسلم» (4) .. وإليك أن تتخيل انتظارهم من أحبّوه في حرّ الهجيرة يترقبون",
    "foot_note": "1. (3/ 222). \n2. جمع إجار، وهي السطوح. \n3. مسند أحمد (3/ 122). \n4. البخاري (7/ 260). \n8 -. (1/ 353) 489.",
    "book_id": "1067",
    "new_page_number": 41
  },
  {
    "serial_number": "5140435",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 43,
    "volume_number": 1,
    "text": "مرآه الجميل، وحديثه العذب النمير حتى تحرقهم الشمس فيرجعون إلى بيوتهم على أمل لقياه في الغد، فإذا أنارت المدينة بقدومه خرج خمسمائة من الرجال يستقبلونه، وامتلأت سكك المدينة وسطوحها بالنساء والخدم والصبيان يكبرون لمقدمه، ويهنئون أنفسهم أن اصطفاهم الله لشرف إقامته بينهم، يا له من موقف يغبط أهل المدينة عليه!!!. بل كان هم الواحد منهم أن ينال شرف الصحبة في الدنيا والآخرة ولا يتردد في طلب رسول الله صلى الله عليه وسلم أن يدعو له أن يرافقه، فتأتي الإجابة التي تحث أصحابها على العمل والمتابعة، والاستمرار على النوافل، أخرج مسلم (1) من حديث ربيعة بن كعب الأسلمي، قال: «كنت أبيت مع رسول الله صلى الله عليه وسلم فأتيته بوضوئه وحاجته، فقال لي: سل، فقلت: أسألك مرافقتك في الجنة، قال: أو غير ذلك؟ قال: هو ذاك، قال: فأعني على نفسك بكثرة السجود» بل كان الواحد منهم حريصًا على اللحاق به، شوقًا للقياه، أخرج أحمد في المسند (2) من حديث عائشة قالت: «إن أبا بكر لما",
    "foot_note": "1. (1/ 158) 10 وصحح إسناده الشيخ أحمد شاكر. \n2. الشفا (2/ 569).",
    "book_id": "1067",
    "new_page_number": 42
  },
  {
    "serial_number": "5140436",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 44,
    "volume_number": 1,
    "text": "حضرته الوفاة قال: أي يوم هذا؟ قالوا: يوم الاثنين، قال: فإن متّ من ليلتي فلا تنتظروا في الغد، فإن أحب الأيام والليالي إلى أقربها من رسول الله صلى الله عليه وسلم» ولما حضرت بلال رضي الله عنه. الوفاة، نادت امرأته: واحزناه، فقال: واطرباه، غدا ألقى الأحبة؛ محمد وحزبه .. وجاء مثل هذا عن حذيفة بن اليمان وعمّار بن ياسر. رضوان الله عليهم .. وبعد هذا، هل أنت مشتاق إلى رؤياه، حريص على شرف صحبته، والأنس بالقرب منه، فما بالي أراك عن هديه معرض، قدمت غيره عليه، تلهث لرضاه، وتحاول كسب مبتغاه، ثم تزعم محبة نبيك وشوقك له، إن الحب والشوق ليست شعارات تُرددّ، ولا دعاوى تخلو من الحقائق، بل هما واقع يترجم صدق صاحبه، ولهف اللحاق به، مطيع لأمره حافظ لحديثه، متابع لهديه، مداوم على طاعته، مشتغل بنشر سننه، وليبشر؛ فقد اشتاق الحبيب صلى الله عليه وسلم لرؤية من كان هذا حاله، وسمّاه أخاه، وودّ لقاءه، أخرج مسلم (1) من حديث أبي",
    "foot_note": "1. (1/ 218) 249.",
    "book_id": "1067",
    "new_page_number": 43
  },
  {
    "serial_number": "5140437",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 45,
    "volume_number": 1,
    "text": "هريرة أن رسول الله صلى الله عليه وسلم قال: «وددت أن قد رأينا إخواننا، قالوا: أولسنا إخوانك يا رسول الله؟ قال أنتم أصحابي، وإخواننا الّذين لم يأتوا بعد، فقالوا: كيف تعرف من لم يأت بعد من أمّتك يا رسول الله؟ فقال: أرأيت لو أنّ رجلًا له خيل دهم بهم ألا يعرف خيله؟ قالوا: بلا، قال: فإنهم يأتون غرًّا محجلين من الوضوء ..  5 - أكثر من الصلاة عليه .. لقد أمرك ربك بالصلاة والسلام على رسول الله صلى الله عليه وسلم بأمر بدأ فيه بنفسه ثم ثنّى بملائكته، فامتثِل أمره، يقول تعالى: {إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ يَاأَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا} بل ضاعف الله أجر من صلّى على رسوله، وأجزل مثوبته، أخرج الطبراني في الكبير (1) من حديث أبي بردة بن دينار قال: قال رسول الله صلى الله عليه وسلم «ما صلّى عليّ عبد من أمتي صلاة صادقًا بها في قلب نفسه إلا صلّى الله عليه بها عشر صلوات، وكتب له بها عشر حسنات، ورفع له بها عشر درجات، ومحى عنه بها عشر سيئات» وقال عنه الألباني:",
    "foot_note": "1. (22/ 195) 513.",
    "book_id": "1067",
    "new_page_number": 44
  },
  {
    "serial_number": "5140438",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 46,
    "volume_number": 1,
    "text": "حسن صحيح (1) .. وأخرج أحمد في المسند (2) من حديث أبي طلحة الأنصاري قال: جاء رسول الله صلى الله عليه وسلم ذات يوم والبشر يرى في وجهه، فقلنا: إنا لنرى البشر في وجهك؟ فقال: «إنه أتاني ملك، فقال يا محمد إن ربك يقول: أما يرضيك أن يصلي عليك أحد من أمتك إلا صليت عليه عشرا، ولا يسلم عليك إلا سلمت عليه عشرا؟ قال: بلى» وصححه الألباني (3) .. والله ملائكة سياحة خلقها الله لتبلغ رسول الله صلى الله عليه وسلم سلام أمته، أخرج النسائي وصحح الألباني (4) من حديث ابن مسعود مرفوعة قال: «إن لله ملائكة سياحين، يبلغوني عن أمتي السلام» واعلم أنها سبب عرض اسم المصلي عليه صلى الله عليه وسلم وذكره عنده، روى أبو الشيخ بن حيّان وحسّن الألباني (5) قوله صلى الله عليه وسلم «إن لله تبارك",
    "foot_note": "1. صحيح الترغيب والترهيب (2/ 290) 1659. \n2. (4/ 29). \n3. صحيح الترغيب (2/ 291) 1661. \n4. صحيح سنن ال نسائي (3/ 43) 1282. \n5. صحيح الترغيب والترهيب (2/ 293) 1667.",
    "book_id": "1067",
    "new_page_number": 45
  },
  {
    "serial_number": "5140439",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 47,
    "volume_number": 1,
    "text": "وتعالى ملكًا أعطاه الله أسماء الخلائق، فهو قائم على قبري إذا متّ فليس أحد يصلي عليّ إلا قال: يا محمد! صلى عليك فلان ابن فلان، قال: فيصلي الرب تبارك وتعالى على ذلك الرجل بكل واحدة عشرا» - والصلاة عليه من أسباب شفاعته صلى الله عليه وسلم، أخرج مسلم (1) من حديث عبد الله بن عمرو بن العاص رضي الله عنه أنه سمع النبي صلى الله عليه وسلم يقول: «إذا سمعتم المؤذن فقولوا مثل ما يقول، ثم صلوا علي فإنه من صلى علي صلاة صلى الله عليه بها عشرا، ثم سلوا لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله، وأرجو أن أكون أنا هو». وأولى الناس به أكثرهم صلاة عليه، أخرج الترمذي (2) من حديث ابن مسعود قال: قال رسول الله صلى الله عليه وسلم: «إن أولى الناس بي يوم القيامة أكثرهم علي صلاة»، وقال الألباني: حسن لغيره (3) .. - والدعاء موقوف بين السماء والأرض ما لم يصلّ على رسول الله صلى الله عليه وسلم، أخرج الترمذي وحسن الألباني (4) عن عمر بن الخطّاب",
    "foot_note": "1. (1/ 288) 384. \n2. (2/ 354) 484. \n3. صحيح الترغيب والترهيب (2/ 294) 1668. \n4. (2/ 356) 486.",
    "book_id": "1067",
    "new_page_number": 46
  },
  {
    "serial_number": "5140440",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 48,
    "volume_number": 1,
    "text": "رضي الله عنه. موقوفًا قال: «إن الدعاء موقوف بين السماء والأرض، لا يصعد منه شيء حتى تصلّي على نبيك». ومداومة الصلاة عليه سبب تفريج الهموم، وغفران الذنوب، أخرج الترمذي من حديث أبي ابن كعب قال: «كان رسول الله صلى الله عليه وسلم إذا ذهب ثلثا الليل قام، فقال: يا أيها الناس اذكروا الله، جاءت الراجفة، تتبعها الرادفة، جاء الموت بما فيه، جاء الموت بما فيه، قال أبيّ: قلت: يا رسول الله إني أكثر الصلاة عليك، فكم أجعل لك من صلاتي؟ قال: ما شئت، قال: قلت: الربع؟ قال: ما شئت، فإن زدت فهو خير لك، قلت: النصف؟ قال: ما شئت، فإن زدت فهو خير لك، قال: قلت: فالثلثين؟ قال: ما شئت، فإن زدت فهو خير لك، قلت: أجعل لك صلاتي كلها، قال: إذا تكفى همك، ويغفر لك ذنبك» قال الترمذي حسن صحيح، وحسنه الألباني (1) .. قال ابن القيم: «سئل شيخنا أبو العباس بن تيمية عن تفسير هذا الحديث، فقال: كان لأبي بن كعب دعاء يدعو به لنفسه، فسأل النبي صلى الله عليه وسلم هل يجعل له من ربعه صلاة عليه؟ قال: إن زدت فهو خير",
    "foot_note": "1. صحيح سنن الترمذي (4/ 636) 2457.",
    "book_id": "1067",
    "new_page_number": 47
  },
  {
    "serial_number": "5140441",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 49,
    "volume_number": 1,
    "text": "لك، فقال له: النصف؟ فقال: إن زدت فهو خير لك، إلى أن قال: أجعل لك صلاتي كلها، أيّ: أجعل دعائي كله صلاة عليك، قال: «إذا تكفى همك ويغفر ذنبك» لأنه من صلّى على النبيّ صلى الله عليه وسلم صلاة صلى الله عليه بها عشرا، ومن صلّى الله عليه كفاه همّه، وغفر له ذنبه، هذا معنى كلامه» (1) . - ومجلس لا يصلّى على رسول الله صلى الله عليه وسلم فيه؛ حسرة على صاحبه يوم القيامة، أخرج الترمذي وصحّح الألباني» (2) من حديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: «ما جلس قوم مجلسًا لم يذكروا الله فيه، ولم يصلّوا على نبيهم، إلّا كان عليهم ترة يوم القيامة، فإن شاء عذّبهم، وإن شاء غفر لهم» - بل أبخل الناس من سمع ذكره الشريف، ولم يصلّ عليه صلى الله عليه وسلم، أخرج ابن أبي عاصم وصحّح الألباني (3) من حديث أبي ذرّ رضي الله عنه. قال: خرجت ذات يوم، فأتيت رسول الله صلى الله عليه وسلم قال: ألا أخبركم بأبخل النّاس؟ قالوا: بلى يا رسول الله، قال: «من ذكرت عنده ولم",
    "foot_note": "1. جلاء الأفهام (33). \n2. (5/ 461) 3380. \n3. صحيح الترغيب والترهيب (2/ 294) 1684.",
    "book_id": "1067",
    "new_page_number": 48
  },
  {
    "serial_number": "5140442",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 50,
    "volume_number": 1,
    "text": "يصل علي فذلك أبخل الناس» ودعى رسول الله صلى الله عليه وسلم بالذل على من ذكر عنده صلى الله عليه وسلم ولم يصلّ عليه، وقيل: بل هو إخبار منه، وسواء كان دعاء منه فدعاؤه مجاب، أو إخبار فخبره صدق، أخرج الترمذي من حديث أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: «رَغِم (1) أنف رجل ذُكرت عنده فلم يصلّ عليّ، ورغم أنف رجل دخل عليه رمضان ثمّ انسلخ قبل أن يغفر له، ورغم أنف رجل أدرك عنده أبواه الكبر فلم يدخلاه الجنّة». ومن لم يصلّ على رسول الله صلى الله عليه وسلم عند ذكره فقد أخطأ طريق الجنّة، أخرج الطبراني وصحّح الألباني (2) من حديث حسين بن عليّ مرفوعًا: «من ذُكِرت عنده فخطئ الصلاة عليّ خُطِّئ طريق الجنّة» وأحيلك على «جلاء الأفهام في فضل الصلاة والسلام على محمد خير الأنام» لابن قيم الجوزية. رحمه الله. فقد ذكر في صلاته ثمرات الصلاة على رسوله صلى الله عليه وسلم، ومواطن الصلاة عليه، وصفتها في كتاب يمتع",
    "foot_note": "1. رَغِم: لصف بالرغام والتراب ذلا وهوانا، وقيل معنى رغم: ذل وإن كره. النهاية (2/ 239). \n2. صحيح الترغيب والترهيب (2/ 300) 1681.",
    "book_id": "1067",
    "new_page_number": 49
  },
  {
    "serial_number": "5140443",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 51,
    "volume_number": 1,
    "text": "قُرّاءه بمطالعته، وقد وضع المؤلف أصابعه الرشيقة على التفصيلات كلها، فأبصر الموضوع من جميع زواياه، وما يهبه للروح من سعادة واطمئنان وأحلتك على مليء ومن أحيل على مليء فليحتل، وأختم هذه الفقرة بفائدة قيّمة من كتاب ابن القيم (1) رحمه الله. يقول فيها: «الصلاة عليه صلى الله عليه وسلم من العبد دعاء ودعاء العبد وسؤاله من ربّه نوعان: أحدهما: سؤاله حوائجه، ومهماته، وما ينوب فيه الليل والنهار، فهذا دعاء وسؤال، وإيثار المحبوب العبد ومطلوبه .. والثاني: سؤاله أن يثني على خليله وحبيبه، ويزيد في تشريفه وتكريمه، ولا ريب أنّ الله تعالى يحبّ ذلك، و رسوله يحبّه، فالمصلّي عليه، قد صرف سؤاله، ورغبته، وطلبه إلى محابّ الله ورسوله، وآثر ذلك على طلبه حوائجه ومحابّه، وآثر ما يحبه الله ورسوله على ما يحبه هو، والجزاء من جنس العمل، فمن آثر الله على غيره، آثره الله على غيره»",
    "foot_note": "1. جلاء الأفهام (391).",
    "book_id": "1067",
    "new_page_number": 50
  },
  {
    "serial_number": "5140444",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 52,
    "volume_number": 1,
    "text": "6 - تشرف بخدمة سنّته .. ولعلي هنا أشحذ همّتك لتحرص على تتبع آثار رسول الله صلى الله عليه وسلم، وتجتهد في طلبها وتحرص على سماعها، وقتم بجمعها وتنتسب إليها وتتعرف على آداب هذا الفن قبل الولوج ببابه، ولا شكّ أنّ على طالب العلم بعد الإنتهاء من حفظ كتاب الله أن يحرص على حفظ سنّة رسول الله، إذ أنّها أسّ الشريعة وقاعدتها، يقول الله تعالى: {وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا} ويقول: {وَمَا يَنْطِقُ عَنِ الْهَوَى} يقول البخاري. رحمه الله «أفضل المسلمين رجل أحيا سنة من سنن رسول الله صلى الله عليه وسلم قد أميتت، فاصبروا يا أهل السنن رحمكم الله؛ فإنكم أقلت الناس» قال البغدادي: «قول البخاري: إن أصحاب السنن أقل الناس، عنى به الحفّاظ للحديث، العالمين بطرقه، المميزين لصحيحه من سقيمه، وقد صدق رحمه الله. لأنك إذا اعتبرت لم تحد بلدة من بلدان الإسلام يخلو من فقيه أو متفقه يرجع أهل مصره إليه ويعولون في فتاواهم عليه، وتجد الأمصار الكثيرة خالية من صاحب حديث",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 51
  },
  {
    "serial_number": "5140445",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 53,
    "volume_number": 1,
    "text": "عارف به، مجتهد فيه، وما ذاك إلا لصعوبة علمه وعزّته، وقلة من ينجب فيه من سامعيه وكتبته، وقد كان العلم في وقت البخاري غضًّا طريًّا، والإرتسام به محبوبًا شهيًا، والدواعي إليه أكبر، والرغبة فيه أكثر، فكيف نقول في هذا الزمن؟! مع عدم الطالب، وقلة الراغب .. وقد كنّا نعدهم قليلًا فقد صاروا أقلّ من القليل (1) وأقول،، فكيف لو رأى البخاري، والبغدادي أهل زماننا، ولا حول ولا قوّة إلا بالله .. فاحرص على الانضمام. حفظك الله. إلى أهل السنن، واحفظ ستة حبيبك حفظ رعاية ورواية، وقم بنشرها، وتبليغها؛ فإنه حق من حقوق رسولك عليك .. أخرج البخاري (2) من حديث عبد الله بن عمرو قال: قال رسول الله صلى الله عليه وسلم «بلغوا عنّي ولو آية، وحدّثوا عن بني اسرائيل ولا حرج، ومن كذب علي متعمدا فليتبوأ مقعده من النار» يقول الحافظ: قال في",
    "foot_note": "1. الجامع لأخلاق الراوي وآداب السامع (102) باختصار. \n2. (3/ 1275) 3274.",
    "book_id": "1067",
    "new_page_number": 52
  },
  {
    "serial_number": "5140446",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 54,
    "volume_number": 1,
    "text": "الحديث «ولو آية» أيّ: واحدة، ليسارع كل سامع إلى تبليغ ما يقع عليه من الآي ولو قلّ، ليتّصل بذلك نقل جميع ما جاء به صلى الله عليه وسلم (1) فكم من حديث قرأت؟؟! بل حفظت؟؟! بل بلغت؟؟!!!! - بل أمر صحابته. رضي الله عنهم. أن يبلغوا سننه في حجة الوداع، فقال يوم النحر فيما أخرج البخاري (2) من حديث أبي بكرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: «ليبلغ الشاهد الغائب، فإن الشاهد عسى أن يبلغ من هو أوعى له منه\"، وعليه بوب البخاري \" ليبلغ العلم الشاهد الغائب»، يقول الحافظ: «ليبلّغ الشاهد، أيّ: الحاضر في المجلس الغائب عنه، والمراد: إما تبليغ القول المذكور. خطبة يوم النحر في حجة الوداع - أو تبليغ جميع أحكامه» (3) فاحذر. وفقك الله. أن تكون حاضرًا كغائب، أو عالمًا كجاهل … وقد دعى رسول الله لا بالنضرة لطلّاب الحديث، أخرج ابن ماجة وصحّح الألباني (4) من حديث أنس قال: قال رسول الله صلى الله عليه وسلم",
    "foot_note": "1. الفتح (6/ 498). \n2. (1/ 37) 67. \n3. الفتح (1/ 211). \n4. (1/ 86) 236.",
    "book_id": "1067",
    "new_page_number": 53
  },
  {
    "serial_number": "5140447",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 55,
    "volume_number": 1,
    "text": "«نضّر الله عبدًا سمع مقالتي، فوعاها ثم بلغها عنّي، فربّ حامل فقه ليس بفقيه، وربّ حامل فقه إلى من هو أفقه منه» وزاد أبو داوود (1) بسند صحيح «فحفظه» فحوى الحديث مراتب العلم الأربع: 1/ السماع .. 2/ الفهم .. 3/ الحفظ .. 4/ الأداء .. أهل الحديث طويلة أعمارهم … ووجوههم بدعا النبيّ منضّرة يقول سفيان بن عيينة: «لا تجد أحدا من أهل الحديث إلا في وجهه نضرة، لدعوة النبي صلى الله عليه وسلم» (2) . أهل الحديث هم وصيّة رسول الله صلى الله عليه وسلم، أخرج ابن ماجة، وحسّن الألباني (3) من حديث أبي سعيد الخدري أنّ رسول الله صلى الله عليه وسلم",
    "foot_note": "1. (3/ 322) 3660. \n2. السر، (10/ 60). \n3. (1/ 90) 247.",
    "book_id": "1067",
    "new_page_number": 54
  },
  {
    "serial_number": "5140448",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 56,
    "volume_number": 1,
    "text": "قال: «سيأتيكم أقوام يطلبون العلم، فإذا رأيتموهم فقولوا لهم: مرحبا بوصيّة رسول الله صلى الله عليه وسلم وأقنوهم» قلت للحكم. أحد رواة الحديث: ما أقنوهم؟ قال: «علموهم» .. وقد كان أبو سعيد. رضي الله عنه. يقول لمن جاءه من طلبة العلم: «مرحبا بوصية رسول الله صلى الله عليه وسلم» - أهل الحديث حماة الذين يبون عن السنن، ويبيّنون صحيحها من سقيمها، يقول سفيان الثوري: «الملائكة حرّاس السماء، وأصحاب الحديث حرّاس الأرض»، ويقول يزيد بن زريع: «لكلّ دين فرسان، وفرسان هذا الذين أصحاب الأسانيد». - أهل الحديث ورثة الرسول صلى الله عليه وسلم فيما ترك من السنّة، وبينما ابن مسعود؟ رضي الله عنه. يومًا معه نفر من أصحابه إذ مرّ أعرابي، فقال: على ما اجتمع هؤلاء؟ قال ابن مسعود: على ميراث محمد يقسمونه (1) .. فإذا اشتغل النّاس بقسمة الدرهم والدينار فاشتغل بقسمة قال",
    "foot_note": "1. ينظر فيما تقدّم «شرف أصحاب الحديث» للبغدادي .. (44 - 46).",
    "book_id": "1067",
    "new_page_number": 55
  },
  {
    "serial_number": "5140449",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 57,
    "volume_number": 1,
    "text": "الله تعالى وقال رسول الله صلى الله عليه وسلم .. العلم ميراث النبي كما أتي … في النص والعلماء هم وراثه ما خلّف المختار غير حديثه … فينا فذاك متاعه وأثاثه أهل الحديث الطائفة المنصورة إلى قيام الساعة، أخرج البخاري (1) من حديث المغيرة بن شعبة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: «لا تزال طائفة من أمّتي ظاهرين حتّى يأتيهم أمر الله وهم ظاهرون» يقول ابن المبارك: «هم عندي أصحاب الحديث» وقال الإمام أحمد: «إن لم يكونوا أصحاب الحديث فلا أدري من هم»، وكذا قال ابن المديني (2) .. وتأمّل كيف حاز السلف الصالح. رضوان الله عليهم. في هذا الباب أعلى الكتب، فقد كان عمر رضي الله عنه. يتناوب مع جاره",
    "foot_note": "1. (6/ 2667) 6881. \n2. شرف أصحاب الحديث (1/ 27).",
    "book_id": "1067",
    "new_page_number": 56
  },
  {
    "serial_number": "5140450",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 58,
    "volume_number": 1,
    "text": "الأنصاري لحضور مجلس رسول الله صلى الله عليه وسلم، فيذهب أحدهم لطلب الرزق لكفاية أهله، ويبقى الآخر لطلب العلم لنجاة نفسه وأهله، فيخبر كل منهما صاحبه بما لم يحضره، وعليه بوّب البخاري: «باب التناوب في العلم» (1) . وفاق ابن عبّاس قرناءه، وصار حبر الأمّة لما جدّ واجتهد في حفظ السنن، يقول رضي الله عنه: «كنت ألزم الأكابر من أصحاب رسول الله صلى الله عليه وسلم من المهاجرين والأنصار، فأسألهم عن المغازي، وما نزل من القرآن في ذلك وكنت لا آتي أحدًا إلا سرّ بإتياني لقربي من رسول الله صلى الله عليه وسلم». ورحل جابر بن عبد الله رضي الله عنه. مسيرة شهر إلى عبد الله بن أنيس رضي الله عنه. في حديث واحد، أخرج المقدسي في المختارة (2) أنّ جابر بن عبد الله بلغه حديث عن رجل من أصحاب رسول الله صلى الله عليه وسلم سمعه من رسول الله صلى الله عليه وسلم لم يسمعه منه، فابتاع بعيرا فشد عليه رحله، فسار إليه شهرا حتى أتى الشّام، فإذا هو بعبد الله",
    "foot_note": "1. (1/ 46). \n2. (9/ 25).",
    "book_id": "1067",
    "new_page_number": 57
  },
  {
    "serial_number": "5140451",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 59,
    "volume_number": 1,
    "text": "بن أنيس الأنصاري، فأرسل إليه أنّ جابر على الباب، قال: فرجع إليه الرسول فقال: جابر بن عبد الله؟ قال: نعم، فجاء إليه فاعتنقه، وقال له جابر: حديثة بلغني أنك سمعته من رسول الله في المظالم لم أسمعه، فخشيت أن أموت أو تموت قبل أن أسمعه، فقال: سمعت رسول الله يقول: «يحشر الله العباد عراة غر بهما ...... ». ورحل أبو أيّوب الأنصاري رضي الله عنه. من المدينة إلى عقبة بن عامر رضي الله عنهما. وهو في مصر ليروي عنه حديثا لم يبق أحد سمعه من رسول الله إلا هو، وهو قوله عليه الصلاة والسلام: «من ستر على مسلم ستره الله يوم القيامة» (1) . وقال سعيد بن المسيب: «كنت أرحل الأيام والليالي في طلب الحديث الواحد» أيها الكريم انظر إلى علو همّتهم في الطلب، كيف رحلوا الليالي والأيام لطلب حديث واحد، وقارن بينهم وبين همّتك، الكتب عن يمينك وشمالك، وتأتيك دروس الحديث إلى بيتك، فإلى متى ترغب عن الطلب وتتشاغل عن حفظ السنن؟!!",
    "foot_note": "1. أخرجه أحمد في المسند (4/ 153).",
    "book_id": "1067",
    "new_page_number": 58
  },
  {
    "serial_number": "5140452",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 60,
    "volume_number": 1,
    "text": "أترضى أن يسبقك القوم، وأنت في مؤخرة الركب وينالوا قرب المجلس من الرسول صلى الله عليه وسلم؟؟! ولم يؤخّرك إلا عملك، فالبدار البدار .. وإن سألت عن حفظهم الأحاديث النبويّة، فقد قال أبو زرعة: «كان أحمد بن حنبل يحفظ ألف ألف حديث. أي: مليونًا. فقيل له: وما يدريك؟ قال: ذاكرته وأخذت عليه الأبواب». وقال سليمان بن شعبة: «كتبوا عن أبي داوود أربعين ألف حديث وليس معه كتاب» وقال الشافعي: «حفظت القرآن وأنا ابن سبع سنين، وحفظت الموطّأ وأنا ابن عشر سنين» وإن سألت عن قراء قم في كتب الحديث، فقد جاء في ترجمة الفيروزبادي صاحب القاموس أنه قرأ صحيح مسلم في ثلاثة أيّام بدمشق وأنشد: قرأت بحمد الله جامع مسلم … بجوف دمشق جوف الإسلام وتمّ بتوفيق الإله وفضله … قراءة ضبط في ثلاثة أيام",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 59
  },
  {
    "serial_number": "5140453",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 61,
    "volume_number": 1,
    "text": "وقرأ الحافظ ابن حجر في رحلته الشامية «معجم الطبراني الصغير» في مجلس واحد بين صلاتي الظهر والعصر، ويشتمل هذا الكتاب على نحو ألف وخمسمائة حديث .. فارسم. أعانك الله. لك منهجًا في طلب الحديث وعلومه، فإنك إن أتقنت هذا الفنّ ستجد نفعه في دنياك وآخرتك متى أخلصت الطلب، وستفوق قرناءك، وفي إمام أهل السنة والجماعة، وإمام المحدثين مؤلف الكتاب الذي هو أصحّ الكتب بعد كتاب الله، البخاري لك سلف، فهل ستكون خير خلف؟؟! فابدأ بالأربعين للنووي، ثم عمدة الأحكام للمقدسي، ثم بلوغ المرام لابن حجر، والمنتقى للمجد ابن تيمية،. رحمهم الله تعالى. ثم ادخل في قراءة الأمهات الست وغيرها، مع العناية بشروح كل كتاب .. وإن رُمت أبواب الأدب فاقرأ «الأدب المفرد» للبخاري، وإن طلبت السير ومعرفة المغازي فمختصر السيرة النبوية للشيخ محمد بن عبد الوهاب، أو الرحيق المختوم للمباركفوري فقد أجاد صاحبه فيه وأفاد .. وإن أردت معرفة أحاديث الترغيب والترهيب وفضائل الأعمال",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 60
  },
  {
    "serial_number": "5140454",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 62,
    "volume_number": 1,
    "text": "فكتاب المنذري «الترغيب والترهيب» وقد عمل الألباني رحمه الله على أحاديثه في كتابه صحيح الترغيب والترهيب وضعيفه .. وفي أدب طلب الحديث اقرأ «الجامع لآداب الراوي وأخلاق السامع» للبغدادي .. وفي حقوق المصطفى صلى الله عليه وسلم عليك بقراءة «الشفا» للقاضي عياض … وتأمّل حنين الجذع لحديثه صلى الله عليه وسلم، فوا حسرتاه لقلبك إن حنّ الجذع إليه، ولم تحدث نفسك يوما بسماع حديثه!!! أخرج ابن خزيمة (1) من حديث أنس رضي الله عنه أنّ رسول الله صلى الله عليه وسلم كان يقوم يوم الجمعة فيسند ظهره إلى جذع منصوب في المسجد، فيخطب، فجاء رومي، فقال: ألا نصنع لك شيئا تقعد، وكأنّك قائم؟ فصنع له منبرًا له درجتان ويقعد على الثالثة، فلما قعد النبي صلى الله عليه وسلم على المنبر خار الجذع خوار الثور حتى ارتجّ المسجد بخواره حزنًا على رسول الله صلى الله عليه وسلم، فنزل رسول الله صلى الله عليه وسلم من المنبر فالتزمه وهو يخور، فلما التزمه سكت، ثم قال: «والذي نفسي بيده لولم ألتزمه ما زال هكذا حتى تقوم الساعة» حزنا على رسول الله صلى الله عليه وسلم، فأمر به",
    "foot_note": "1. (2/ 140) 1777.",
    "book_id": "1067",
    "new_page_number": 61
  },
  {
    "serial_number": "5140455",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 63,
    "volume_number": 1,
    "text": "فدُفِن، وفي خبر جابر قال النبي صلى الله عليه وسلم: «إن هذا بكي لما فقد من الذكر» صححه الألباني (1) .. يقول الحسن البصري: «يا معشر المسلمين،، الخشبة تحنّ إلى رسول الله صلى الله عليه وسلم شوقا للقائه، فأنتم أحقّ أن تشتاقوا إليه» (2)  7 - (وتوقروه) يقول تعالى: {لِتُؤْمِنُوا بِاللَّهِ وَرَسُولِهِ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُ} وقد حوت الآية حقوقا ثلاثة لرسول الله صلى الله عليه وسلم: الإيمان به وقد مضى، وتعزيره سيأتي، وإليك معني توقيره، يقول شيخ الإسلام ابن تيمية: «التوقير: اسم جامع لكل ما فيه سكينة وطمأنينة من الإجلال والإكرام، وأن يعامل من التشريف والتكريم والتعظيم بما يصونه عن كلّ ما يخرجه عن حد الوقار» (3) فالتوقير معناه التعظيم، والإجلال والتفخيم (4) .. ومعلوم أنّ حقوق رسول الله صلى الله عليه وسلم، أَجَلُّ، وأعظم، وأكرم، وألزم",
    "foot_note": "1. الصحيحة (5/ 206) 2174. \n2. صحيح ابن حبّان (4/ 237). \n3. الصارم المسلول (422). \n4. تفسر الطبري (29/ 75).",
    "book_id": "1067",
    "new_page_number": 62
  },
  {
    "serial_number": "5140456",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 64,
    "volume_number": 1,
    "text": "علينا من حقوق السادات على مماليكهم، والآباء على أولادهم، فحقّ علينا أن نحبه ونجله أكثر من إجلال كل عبد سيّده، وكلّ ولد والده، وبمثل هذا نطق القرآن الكريم .. يقول تعالى {لَا تَجْعَلُوا دُعَاءَ الرَّسُولِ بَيْنَكُمْ كَدُعَاءِ بَعْضِكُمْ بَعْضًا}، يقول شيخ الإسلام: «خصّ الله نبيّه في هذه الآية بالمخاطبة بما يليق به، فنهى أن يقولوا: يا محمد، أو يا أحمد … ولكن يقولوا: يا رسول الله، وكيف يخاطبونه بذلك، والله سبحانه أكرمه في مخاطبته إياه بما لم يكرم به أحدًا من الأنبياء، فلم يدعه باسمه في القرآن قطّ بل يقول: {يَاأَيُّهَا النَّبِيُّ قُلْ لِأَزْوَاجِكَ .... } {يَاأَيُّهَا النَّبِيُّ اتَّقِ اللَّهَ ...... } مع أنه سبحانه قال: {وَقُلْنَا يَاآدَمُ اسْكُنْ أَنْتَ وَزَوْجُكَ الْجَنَّةَ .... } وقال: {يَانُوحُ إِنَّهُ لَيْسَ مِنْ أَهْلِكَ .... } وقال: {يَاعِيسَى ابْنَ مَرْيَمَ اذْكُرْ نِعْمَتِي عَلَيْكَ ..... } أما إذا كنا في مقام الإخبار عنه، قلنا: «أشهد أن لا إله إلا الله، وأشهد أن محمدا رسول الله» فنخبر عنه باسمه كما أخير الله سبحانه عنه فقال: {مَا كَانَ مُحَمَّدٌ أَبَا أَحَدٍ مِنْ رِجَالِكُمْ} وقال: {مُحَمَّدٌ رَسُولُ اللَّهِ وَالَّذِينَ مَعَهُ}",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 63
  },
  {
    "serial_number": "5140457",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 65,
    "volume_number": 1,
    "text": "فالفرق بين مقام المخاطبة والإخبار فرق ثابت بالشرع والعقل (1) .. واقرأ سورة الحجرات ترى وجوب مراعاة الآداب النبوية مع رسول الله صلى الله عليه وسلم يقول تعالى: {يَاأَيُّهَا الَّذِينَ آمَنُوا لَا تُقَدِّمُوا بَيْنَ يَدَيِ اللَّهِ وَرَسُولِهِ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ (1) يَاأَيُّهَا الَّذِينَ آمَنُوا لَا تَرْفَعُوا أَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَلَا تَجْهَرُوا لَهُ بِالْقَوْلِ كَجَهْرِ بَعْضِكُمْ لِبَعْضٍ أَنْ تَحْبَطَ أَعْمَالُكُمْ وَأَنْتُمْ لَا تَشْعُرُونَ (2) إِنَّ الَّذِينَ يَغُضُّونَ أَصْوَاتَهُمْ عِنْدَ رَسُولِ اللَّهِ أُولَئِكَ الَّذِينَ امْتَحَنَ اللَّهُ قُلُوبَهُمْ لِلتَّقْوَى لَهُمْ مَغْفِرَةٌ وَأَجْرٌ عَظِيمٌ (3) إِنَّ الَّذِينَ يُنَادُونَكَ مِنْ وَرَاءِ الْحُجُرَاتِ أَكْثَرُهُمْ لَا يَعْقِلُونَ (4) وَلَوْ أَنَّهُمْ صَبَرُوا حَتَّى تَخْرُجَ إِلَيْهِمْ لَكَانَ خَيْرًا لَهُمْ وَاللَّهُ غَفُورٌ رَحِيمٌ}. فأول أدب: تحريم التقدّم بين يديه بكلام حتّى يأذن، ولهذا كان رسول الله صلى الله عليه وسلم يسأل الصحابة عن اليوم الّذي هم فيه، والمكان الّذي هم فيه، وهم يعلمونه حقّ العلم، فيتحرجون أن يجيبوا إلا بقولهم: الله ورسوله أعلم، خشية أن يكون في قولهم تقدّم بين يدي الله ورسوله، وحديث خطبة النحر في حجّة الوداع أكبر شاهد على هذا .. الثاني: حرّم رفع الصوت فوق صوت النبيّ، وأن يجهر له بالقول",
    "foot_note": "1. درء تعارض العقل والنقل (1/ 297) باختصار.",
    "book_id": "1067",
    "new_page_number": 64
  },
  {
    "serial_number": "5140458",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 66,
    "volume_number": 1,
    "text": "كما يجهر الرجل المخاطبة من عداه، وهذا في حياته وبعد مماته صلى الله عليه وسلم» (1) وسمع عمر بن الخطّاب رضي الله عنه. صوت رجلين في مسجد النبي صلى الله عليه وسلم قد ارتفعت أصواتهما فجاء فقال: أتدريان أين أنتما؟ ثم قال: من أين أنتما؟ قالا: من أهل الطائف، فقال: لوكنتما من أهل المدينة لأوجعتكما ضربًا (2) .. قال العلماء: يكره رفع الصوت عند قبره كما كان يكره في حياته عليه الصلاة والسلام؛ لأنه محترم حيًّا وميّتًا وحذرهم إن هم فعلوا ذلك {أَنْ تَحْبَطَ أَعْمَالُكُمْ وَأَنْتُمْ لَا تَشْعُرُونَ} .. وكان عبد الرحمن ابن مهدي إذا قرأ حديث النبي صلى الله عليه وسلم أمرهم بالسكوت وقال: لا ترفعوا أصواتكم فوق صوت النبي، ويتأوّل أنه يجب له من الإنصات عند قراءة حديثه ما يجب له عند سماع قوله (3) .. فاحذر أن ترفع صوتك عند نقل حديثه، أوفي مسجده، أو تذكره كذكر آحاد الناس، وقد جاءت سورة الحجرات بأسلوبها المعجز لتفخيم شأن النبي صلى الله عليه وسلم وإظهار رفعة قدره المنيف وسموّ منزلته صلى الله عليه وسلم",
    "foot_note": "1. ينظر: تفسير ابن كثير (4/ 208). \n2. البخاري (1/ 179) 458. \n3. الشفا (2/ 28).",
    "book_id": "1067",
    "new_page_number": 65
  },
  {
    "serial_number": "5140459",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 67,
    "volume_number": 1,
    "text": "فوق كلّ منزلة أحد من الخلق ليستشعر المؤمن بقلبه وروحه وكافة إحساساته ومشاعره ما أوجبه الله تعالى من توقيره صلى الله عليه وسلم وتوقيرًا يجلّي رفيع قدره، وعظيم مقامه … ومن عظيم شأن رسول الله صلى الله عليه وسلم أن حذّر الله من إيذائه أشدّ التحذير فقال: {إِنَّ الَّذِينَ يُؤْذُونَ اللَّهَ وَرَسُولَهُ لَعَنَهُمُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ وَأَعَدَّ لَهُمْ عَذَابًا مُهِينًا (57) وَالَّذِينَ يُؤْذُونَ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ بِغَيْرِ مَا اكْتَسَبُوا فَقَدِ احْتَمَلُوا بُهْتَانًا وَإِثْمًا مُبِينًا} .. فانظر كيف قرن الله أذى رسوله بأذاه فمن آذاه فقد آذى الله، ومن آذى الله كفر، وتأمّل تفريقه سبحانه بين أذى الله ورسوله وأذى المؤمنين فجعل على هذا البهتان والإثم المبين، وجعل على ذلك اللعنة في الدنيا والآخرة والعذاب المهين ومعلوم أنّ أذى المؤمنين من كبائر الإثم وليس فوق ذلك إلا الكفر، ثمّ إن سبّ الرسول صلى الله عليه وسلم تتعلق به حقوق عدّة: 1/ حق الله سبحانه، لأن الطعن في الرسول طعن في المرسل، ولأن مبارزة رسول الله صلى الله عليه وسلم مبارزة لأفضل أولياء الله .. 2/ حق المؤمنين من هذه الأمة، لأنّ جميع أمور المؤمنين في دينهم",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 66
  },
  {
    "serial_number": "5140460",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 68,
    "volume_number": 1,
    "text": "ودنياهم وآخرهم قامت بواسطته وسفارته، فالسبت له أعظم عندهم من سب أنفسهم وآبائهم وأبنائهم … 3/ حقّ رسول الله صلى الله عليه وسلم من حيث خصوص نفسه، فإن الإنسان تؤذيه الوقيعة في عرضه أكثر ممّا يؤذيه أخذ ماله (1) .. إلى كلّ من لم يوقره صلى الله عليه وسلم حقّ توقيره، أو آذاه بردّ سنته، أو الوقوع في عرضه وشرعته، ويل أمّه كيف تعلّقت ثلاثة حقوق في رقبته؟؟!!!! وقد فطن السلف الصالح لهذا الأمر، فالتزموه قولا وعملا في حياته وبعد مماته، وما أبلغ ما قاله عروة ابن مسعود رضي الله عنه. في وصف أصحابه حين وجهته قريش إلى رسول الله صلى الله عليه وسلم يوم الحديبية، فلمّا رجع إلى قريش قال: «أي قوم، والله لقد وفدت على الملوك، ووفدت على قيصر وكسرى والنجاشي، والله إن رأيت مليكًا قط يعظمه أصحابه ما يعظّم أصحاب محمّد محمّدا، والله إن انتخم نخامة إلا وقعت في كفّ رجل منهم، فدلك بها وجهه وجلده، وإذا أمرهم ابتدروا أمره، وإذا توضأ كادوا يقتتلون على وضوءه، وإذا",
    "foot_note": "1. الصارم المسلول (392 - 394) باختصار.",
    "book_id": "1067",
    "new_page_number": 67
  },
  {
    "serial_number": "5140461",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 69,
    "volume_number": 1,
    "text": "تكلّموا خفضوا أصواتهم عنده، وما يحدّون إليه النظر تعظيمًا (1) .. ويطالعك دائمًا في وصف صحابته. رضوان الله عليهم. في مجلسه «كأنّ على رؤوسهم الطير» توقيرًا له .. وأخرج البيهقي (2) عن بريدة بن الحصيب. رضي الله عنه. قال: «كنّا إذا قعدنا عند رسول الله صلى الله عليه وسلم لم نرفع رؤوسنا إليه إعظامًا له» .. وأخرج البخاري وصحّح الألباني (3) عن أنس «أن أبواب التي كانت تقرع بالأظافير». ولما بعثت قريش أبا سفيان إلى رسول الله صلى الله عليه وسلم ليشدّ في عقد صلح الحديبية ويزيد في المدّة، فلمّا قدم المدينة ودخل على ابنته أمّ حبيبة، فلمّا ذهب ليجلس على فراش رسول الله صلى الله عليه وسلم طوته، فقال: يا بنيّة ما أدري أرغبت بي عن هذا الفراش أو رغبت به عتي؟؟ فقالت: هو فراش رسول الله وأنت مشرك نجس، فلم أحب أن تجلس على فراشه، ولما رجع أبو سفيان لأهل مكّة قال لهم: وقد تتبّعت أصحاب",
    "foot_note": "1. البخاري (2/ 976). \n2. المدخل إلى السنن (381). \n3. صحيح الأدب المفرد (1080).",
    "book_id": "1067",
    "new_page_number": 68
  },
  {
    "serial_number": "5140462",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 70,
    "volume_number": 1,
    "text": "محمّد فما رأيت قومًا لملك عليهم أطوع منهم له .. ولا تعجب لحال أصحاب محمد صلى الله عليه وسلم فإنه كان أرحم الخلق وأرأفهم بهم، وأنفعهم لهم، أفصح خلق الله، وأحسنهم تعبيرا عن المعاني الكثيرة بالألفاظ الوجيزة، وأصيرهم في مواطن الصبر، وأصدقهم في مواطن اللقاء، وأوفاهم بالعهد والذمة، وأعظمهم مكافأة على الجميل بأضعافه وأشدهم تواضعا، وأعظمهم إيثارًا على نفسه وأشد الخلق ذبا عن أصحابه، وحماية لهم، ودفاعا عنهم، وأقوم الخلق بما يأمر به، وأتركهم لما ينهى عنه، أوصل الخلق رحمة، وأجودهم صدرة، وأصدقهم لهجة، وألينهم عريكة وأكرمهم عشرة، من رآه بديهة هابه، ومن خالطه معرفة أحبّه .. وقد خصه الله بصفتين خص بهما أهل الصدق والإخلاص وهما: الإجلال والمحبة، فكان كل من يراه يهابه ويحله، ويملأ قلبه تعظيمًا وإجلالا وإن كان عدوا له، فإذا خالطه وعاشره كان أحب إليه من كل مخلوق، فهو المحل المعظم، المحبوب المكرم، وهذا غاية كمال المحبة أن تقترن بالتعظيم والهيبة (1) ..",
    "foot_note": "1. ينظر: جلاء الأفهام (89).",
    "book_id": "1067",
    "new_page_number": 69
  },
  {
    "serial_number": "5140463",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 71,
    "volume_number": 1,
    "text": "واستمرّت محبته صلى الله عليه وسلم عند أصحابه ومن تبعهم بإحسان بعد مماته فكان أحدهم يغضب على أقرب الناس إليه إن خالف قوله صلى الله عليه وسلم، فهاهو ابن عمر، رضي الله عنه. يحدّث عن حبّه فيقول: سمعت رسول الله صلى الله عليه وسلم يقول: «لا تمنعوا نسائكم المساجد إذا استئذنكم إليها» فيعترض أحد أبنائه بلال على أنّ الزمن تغيّر، ونساءه اختلفن فيقول: والله لنمنعهنّ، وفي رواية: لا ندعهنّ يخرجن، فيتخذنه دغلًا،، فما موقف أبيه؟! يقول الراوي: فسبّه عبد الله سبّا سيّئًا ما سمعته سبّه مثله قط، وقال: أخبرك عن رسول الله صلى الله عليه وسلم وتقول: والله لنمنعنّ؟؟!! وفي رواية: فضرب في صدره (1) .. وعند أحمد (2) : فما كلّمه عبد الله حتّى مات .. وكيف لا يكون هذا موقف ابن الفاروق؟؟! والله تعالى يقول: {فَلْيَحْذَرِ الَّذِينَ يُخَالِفُونَ عَنْ أَمْرِهِ أَنْ تُصِيبَهُمْ فِتْنَةٌ أَوْ يُصِيبَهُمْ عَذَابٌ أَلِيمٌ} وأخرج ابن ماجة وصحّح الألباني (3) أن قريبًا لعبد الله بن",
    "foot_note": "1. مسلم (1/ 328) 442. \n2. (2/ 36) 4933. \n3. (2/ 1075) 3226.",
    "book_id": "1067",
    "new_page_number": 70
  },
  {
    "serial_number": "5140464",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 72,
    "volume_number": 1,
    "text": "معقل رضي الله عنه. خذف فنهاه وقال: «إن النبي صلى الله عليه وسلم نهى عن الخذف (1) وقال إنها لا تصيد صيدا، ولا تنكأ عدوا، ولكنها تكسر السن، وتفقأ العين» وعاد قريبه للخذف أخرى فقال له عبد الله: «أحدثك عن رسول الله ثم تعود، لا أكلمك أبدا» وجاء عن عدد من الأئمّة أنّهم كانوا لا يحدّثون عن رسول الله صلى الله عليه وسلم إلا على وضوء، منهم: قتادة، وجعفر بن محمّد، ومالك ابن أنس، والأعمش، بل صار ذلك مستحبّا عندهم وكرهوا خلافه، يقول ضرار ابن مرّة: «كانوا يكرهون أن يحدثوا عن رسول الله وهم على غير وضوء» (2) . وقال أبو سلمة الخزاعي: «كان مالك ابن أنس إذا أراد أن يخرج يحدث توضأ وضوئه للصلاة، ولبس أحسن ثيابه، ولبس قلنسوة، ومشط لحيته، فقيل له في ذلك، فقال: أعظم به حديث رسول الله صلى الله عليه وسلم»، وقال ابن أبي الزناد: «كان سعيد بن المسيّب وهو مريض يقول: أقعدوني، فإني أعظم أن أحدث حديث رسول الله صلى الله عليه وسلم وأنا مضطجع»",
    "foot_note": "1. الخذف: الرمي بالحصى الصغار، النهاية (2/ 16). \n2. جامع بيان العلم وفضله لابن عبدالبرّ (2/ 1217).",
    "book_id": "1067",
    "new_page_number": 71
  },
  {
    "serial_number": "5140465",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 73,
    "volume_number": 1,
    "text": "وكان محمّد ابن سيرين يتحدّث فيضحك فإذا جاء الحديث خشع (1) .. وسُئل مالك عن أيوب السختياني فقال: ما حدثتكم عن أحد إلا وأيّوب أوثق منه، قال مالك: وحجّ حجّتين، فكنت أرمقه ولا أسمع منه غير أنّه كان إذا ذكر النبي صلى الله عليه وسلم بكى حتى أرحمه فلمّا رأيت منه ما رأيت وإجلاله للنبيّ كتبت عنه … وقال مصعب بن عبد الله: كان مالك إذا ذكر النبي صلى الله عليه وسلم تغيّر لونه، وينحني حتّى يصعب ذلك على جلسائه، فقيل له يوما في ذلك فقال: لو رأيتم ما رأيت لما أنكرتم عليّ ما ترون (2) .. وكان عبد الرحمن ابن القاسم يذكر النبيّ صلى الله عليه وسلم فينظر إلى لونه كأنّه نزف منه الدّم، وقد جفّ لسانه في فمه، هيبة لرسول الله صلى الله عليه وسلم، وكان يأتي عامر بن عبد الله بن الزبير فإذا ذُكر عنده النبي صلى الله عليه وسلم بكى حتّى لا يبقى في عينيه دمعة .. نزف البكاء دموع عينك فاستعر … عينًا لغيرك دمعها مدرار",
    "foot_note": "1. الجامع للخطيب (2/ 53). \n2. السير (1716).",
    "book_id": "1067",
    "new_page_number": 72
  },
  {
    "serial_number": "5140466",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 74,
    "volume_number": 1,
    "text": "وكان الزهري من أهنأ النّاس فإذا ذُكر عنده الرسول صلى الله عليه وسلم فكأنه ما عرفك ولا عرفته (1) .. ولم يك التوقير مقتصرًا على الإنسان فحسب بل كان للحيوان أدب جم معه صلى الله عليه وسلم فعن عائشة. رضي الله عنها. قالت: «كان لآل رسول الله صلى الله عليه وسلم وحش، فإذا خرج رسول الله صلى الله عليه وسلم لعب واشتدّ، وأقبل وأدبر، فإذا أحسّ برسول الله صلى الله عليه وسلم دخل ربض فلم يترمرم ما دام رسول الله صلى الله عليه وسلم في البيت كراهية أن يؤذيه» أخرجه أحمد (2) وصحح إسناده ابن كثير (3) .. وعن سفينة مولى رسول الله صلى الله عليه وسلم قال: «ركبت البحر، فانكسرت سفينتي التي كنت فيها، فركبت لوحًا من ألواحها، فطرحني اللوح في أجمة فيها الأسد، فأقبل إليّ يريدني، فقلت: يا أبا الحارث، أنا مولى رسول الله صلى الله عليه وسلم كان من أمري كيت وكيت، فأقبل الأسد وطأطأ رأسه ودفعني بمنكبه حتّى أخرجني من الأجمة، ووقفني على الطريق، ثم همهم، فظننت أنه يودعني» رواه الحاكم وصحّحه على شرط مسلم،",
    "foot_note": "1. الشفا (598). \n2. المسند (6/ 112) 150. \n3. شمائل رسول الله صلى الله عليه وسلم (283).",
    "book_id": "1067",
    "new_page_number": 73
  },
  {
    "serial_number": "5140467",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 75,
    "volume_number": 1,
    "text": "ووافقه الذهبي (1) .. يقول ابن سيد الناس: والليث أذوى في سفينة مفردا … بالروم في فيفاء قفر بلقع ما زال يكلؤه إلا أن دلّه … عند الأمان على سواء المشرع وحقّ لي أن أتسائل بعد هذا كلّه: أين نحن من سيرة القوم؟! وأين حالنا من حالهم؟! لقد قام في قلوبهم ما قصرت هممنا على أن تقوم بأقلّه، وأحيوا في شعورهم ما ماتت مشاعرنا دونه، وتعلّقت أبصارهم فيما وراء الطرف في حين لم تتجاوز أبصارنا أطرافنا، ألا رجل أو امرأة لم تقعد بهم همتهم، ولم يتأخر بهم عملهم؟؟ ألا صادق يترحم المحبّة قولًا وعملًا وغيرة؟؟! وإلا .... فكلٌّ يدّعي وصلًا بليلى … وليلي لا تقر لهم بذاكا",
    "foot_note": "1. المستدرك (3/ 606).",
    "book_id": "1067",
    "new_page_number": 74
  },
  {
    "serial_number": "5140468",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 76,
    "volume_number": 1,
    "text": "أين توقير رسول الله صلى الله عليه وسلم في قلوب الحلق باستشعار هيبته صلى الله عليه وسلم وجلالة قدره وعظيم شأنه واستحضار محاسنه والمعاني الجالبة لحبه وإجلاله، وكلّ ما من شأنه أن يجعل القلب ذاكرة لحقه من التوقير والتعزير، ومعترفًا به ومطيعًا له فالقلب ملك الأعضاء وهي له جند وتبع فمتى ما كان تعظيم النبي صلى الله عليه وسلم مستقر في القلب مسطورًا فيه على تعاقب الأحوال، فإنّ آثتر ذلك ستظهر على الجوارح حتمًا لا محالة، وحينئذ ستجد اللسان يجري بمدحه والثناء عليه بما هو أهله مما أثني به عليه ربّه، وأثني على نفسه من غير غلوّ ولا تقصير، ومن أعظم الثناء عليه الصلاة والسلام عليه، فالصلاة منّا عليه تتضمن ثناء المصلّي عليه والإشارة بذكر شرفه وفضله، وإرادة من الله تعالى أن يعلي ذكره (1) .. ومن تعظيم اللسان أن نتأدب بذكره بألسنتنا، وذلك بأن نقرن ذكر اسمه بلفظ النبوة أو الرسالة مع الصلاة والسلام عليه، ومن تعظيم اللسان حفظ ستته وتبليغها والدعوة إليها، وأما تعظيم الجوارح فالعمل بشريعته والتأسّي بسنته، والأخذ بأوامره ظاهرًا وباطنًا وتحكيم ما جاء به في الأمور كلّها، والرضا بحكمه والتسليم له، والموالاة والمعاداة لأجله، وجهاد من خالفه ..",
    "foot_note": "1. جلاء الأفهام (79) ..",
    "book_id": "1067",
    "new_page_number": 75
  },
  {
    "serial_number": "5140469",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 77,
    "volume_number": 1,
    "text": "فأين توقير الرسول صلى الله عليه وسلم عند من ابتدع في دين الله ما ليس منه زاعما أنه محب مشتاق، وغفل عن قول رسول الله صلى الله عليه وسلم: «من رغب عن سنتي فليس مني» وقوله «من عمل عملا ليس عليه أمرنا فهو رد» فإلى من أحيا ليلة المولد، ومن اجتمع في الحفلات ضاربا الدف على المدائح النبويّة (1) ، علام تفعل ما لم تؤمر به؟؟! وتخلف أمر رسول الله صلى الله عليه وسلم حيث أمرك بالإتباع، وترك الإبتداع، وأنت تزعم حبه، وهل لوكان خيرا لسبقت إليه القوم؟! فتأمل حالك، والزم هدي نبيك فإن بالتمسك به النجاة، وبتركهـ الهلاك، هداك الله ووفقك وأعانك وسددك .. وأين رسول الله صلى الله عليه وسلم في مجالسنا حين يذكر، وأين الصلاة والسلام عليه عند مرور اسمه الشريف، وكيف تقدم آراء الرجال على قوله مع أن الله في أن نقدم بين يدي الله ورسوله فقال: {لَا تُقَدِّمُوا بَيْنَ يَدَيِ اللَّهِ وَرَسُولِهِ} فتقول قال فلان وقال فلان، وكان ابن عباس ينكر على من يعارض ما بلغه من السنة بقوله: قال أبوبكر وعمر قائلا له: «يوشك أن تنزل عليكم حجارة من السماء،",
    "foot_note": "1. أشيد بكتاب «حقوق النبي صلى الله عليه وسلم بين الإحلال والإدخال» تقديم فضيلة الشيخ د. صالح الفوزان - حفظه الله - والذي صدر من المنتدى الإسلامي فقد حوى كتابين هامين: مظاهر الغلو في قصائد المديح النبوي، وظاهرة الاحتفال بالمولد النبوي .. فطالعه فإن فيه فوائد لا يستغني عنها طالب علم.",
    "book_id": "1067",
    "new_page_number": 76
  },
  {
    "serial_number": "5140470",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 78,
    "volume_number": 1,
    "text": "أقول قال رسول الله صلى الله عليه وسلم، وتقولون قال أبوبكر وعمر (1) ؟؟!» فرحم الله ابن عباس رضي الله عنه فوالله لوشاهد خلفنا اليوم هؤلاء الذين إذا قيل لهم قال رسول الله قالوا: قال فلان وفلانة لمن لا يداني الصحابة، ولا قريبا من قريب. وقد قال الشافعي: «إذا صح الحديث عن رسول الله صلى الله عليه وسلم فخذوا به، واضربوا بقولي عرض الحائط» (2) . أين توقير رسول الله والواحد منا يحفظ آلاف الأبيات ولا يحفظ أربعين حديثا من أحاديثه؟!! أن توقير رسول الله صلى الله عليه وسلم حين يشكك في قوله أو ينزل على عصره وكأنه لم يبعث رحمة للعالمين وكافة للناس .. أين توقير رسول الله صلى الله عليه وسلم حين يروي الضعيف من الحديث ويترك الصحيح، وتتبع شواذ الأحاديث وموضوعاتها وتنشر مع أن في الأحاديث الصحيحة غنية، أخرج ابن ماجة، وصحح الألباني (3) من حديث علي رضي الله عنه عن النبي صلى الله عليه وسلم قال: «من حدث عني حديثا وهو يرى أنه كذب فهو أحد الكاذبين»",
    "foot_note": "1. أعلام الموقعين (2/ 238). \n2. الطرق الحكمية (6/ 27). \n3. (1/ 14) 38.",
    "book_id": "1067",
    "new_page_number": 77
  },
  {
    "serial_number": "5140471",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 79,
    "volume_number": 1,
    "text": "أين توقير رسول الله صلى الله عليه وسلم حين يتلاعب بمعاني الأحاديث النبوية بحجة قراءة النص أكثر من قراءة، وتوسيع مفاهيم النصوص من جاهل لا يمتلك أدوات الاجتهاد فضلا عن شروطه .. ؟!!! يقول ابن القيم - رحمة الله -: «ومن الأدب معه ألا يتشكل قوله، بل تستشكل الآراء لقوله، ولا يعارض نصه بقياس، بل قدر الأقيسة، وتلقى لنصوصه، ولا يحرف كلامه عن حقيقته لخيال يسميه أصحابه معقولا، نعم! هو مجهول، وعن الصواب معزول، ولا يوقف قبول ما جاء به على موافقة أحد فكل هذا من قلة الأدب مع صلى الله عليه وسلم، بل هو عين الجرأة (1) .. دعوا كل قول عند قول محمد … فما آمن في دينه كمخاطر أين توقير رسول الله صلى الله عليه وسلم وأنت ترى في مسجده، وعن حجرته رفع الصوت، واللغط، والاشتغال بقيل وقال، كأن الحرم ليس حرمه، وكأن عمر بن الخطاب لم يهم بضرب الطائفين على رفعهما لصوتهما، ولن يضربهما إلا عن مخالفة، فتنبه إن كنت في مسجده، وأحسن جواره، واحذر أن يحبط عملك وأنت لا تشعر، وحذر من رأيته غلا في شخصه فدعاه من دون",
    "foot_note": "1. مدارج السالكين (2/ 406).",
    "book_id": "1067",
    "new_page_number": 78
  },
  {
    "serial_number": "5140472",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 80,
    "volume_number": 1,
    "text": "الله عند قبره، أو تمسح بجدار الغرفة؛ لأنه أمرنا بالأمر بالمعروف والنهي عن المنكر، وما تراه هو عين المحادة لأمره. أيها المحبون لقد تباعد بنا الزمن، واستنسرت الفتن، واشتغل الأكثرون بالحطام من المهن، وغاب عنا الحب وإن ادعيناه، ونسينا الواجبات فكانت من أحاديث الذكريات، نتحدث عن الهدي النبوي ولكمن أين هو الحاد في الاتباع، الصادق في الاقتفاء؟!!!!  8 - نحري دون نحرك يا رسول الله صلى الله عليه وسلم -: يقول الله تعالى آمرًا المؤمنين في حق رسول الله صلى الله عليه وسلم: {لِتُؤْمِنُوا بِاللَّهِ وَرَسُولِهِ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُ} يقول شيخ الإسلام: «فالتعزير اسم جامع لنصره، وتأييده، ومنعه من كل يؤذيه (1) » وقد حكم الرب بفلاح من نصره وعزره بعد أن وصفه بالإيمان فقال: {فَالَّذِينَ آمَنُوا بِهِ وَعَزَّرُوهُ وَنَصَرُوهُ وَاتَّبَعُوا النُّورَ الَّذِي أُنْزِلَ مَعَهُ أُولَئِكَ هُمُ الْمُفْلِحُونَ} ومن أعظم دلائل المحبة والإجلال نصرة رسول الله صلى الله عليه وسلم، يقول تعالى: {لِلْفُقَرَاءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِنْ دِيَارِهِمْ وَأَمْوَالِهِمْ يَبْتَغُونَ فَضْلًا مِنَ اللَّهِ وَرِضْوَانًا وَيَنْصُرُونَ اللَّهَ وَرَسُولَهُ أُولَئِكَ هُمُ الصَّادِقُونَ} فالصادق في دعوى محبته من برهن عليها ببذل ماله وأهله ونفسه",
    "foot_note": "1. الصارم المسلول (422).",
    "book_id": "1067",
    "new_page_number": 79
  },
  {
    "serial_number": "5140473",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 81,
    "volume_number": 1,
    "text": "ولنصرة الله ورسوله .. ولقد سطر الصحابة رضوان الله عيهم أروع الأمثلة وأصدق الأعمال في الذبِّ عن رسول الله صلى الله عليه وسلم، وفدائه بالمال والولد والنفس، في المنشط والمكره والعسر واليسر، وكتب السير عامرة بذكر أخبارهم وحسبي من القلادة ما أحاط بالعنق، ومن السوار ما أحاط بالمعصم، وإليك بعض روائع سيرهم .. - أبوبكر يبكي يوم الهجرة حين لحق سراقة بن مالك برسول الله صلى الله عليه وسلم وأبي بكر، فيسأله رسول الله صلى الله عليه وسلم: «لم تبكي؟» يقول: «أما والله ما على نفسي أبكي ولكن أبكي عيك» فدعا رسول الله على سراقة فقال: «اللهم اكفناه بما شئت» فساخت قوائم فرسه إلى بطنها في أرض صلدا (1) ، بل كان أبوبكر ينتقل عن يمين وشمال وخلف وأمام رسول الله صلى الله عليه وسلم فتعجب رسول الله صلى الله عليه وسلم من فعله، فسأله عنه، فقال رضي الله عنه: يا رسول الله أذكر الطلب فأمشي خلفك، وأذكر الرصد فأكون أمامك، ومرة عن يمينك، ومرة عن شمالك، لا آمن عليك، فقال له النبي صلى الله عليه وسلم: «يا أبا بكر لوكان شي لأحببت أن يكون بك دوني؟» قال: نعم والذي بعثك بالحق (2) ..",
    "foot_note": "1. أخرجه أحمد في المسند (1/ 155) 3، وصحّح إسناده الشيخ أحمد شاكر. \n2. البداية والنهاية (3/ 180).",
    "book_id": "1067",
    "new_page_number": 80
  },
  {
    "serial_number": "5140474",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 82,
    "volume_number": 1,
    "text": "ولما وصل رسول الله صلى الله عليه وسلم إلى الغار، وأراد أن ينزل فيه قال له الصديق: مكانك حتى أتبرئ لك، فإن كان به أذى نزل بي قبلك، فنزل فتحسس من الغار فلم يجد به شيئا، فنزل رسول الله وقد بلغ منه الإعياء والتعب مبلغه فما أن دخلا حتى توسد رسول الله صلى الله عليه وسلم قدم أبي بكر ونام، وكان الصديق يأخذ من ثوبه ويسد أي جحر مخافة أن يكون فيه شيء من الهوام فتؤذي رسول الله صلى الله عليه وسلم فتبقى منها حجر فألقمه عقبه، وكانت به حية فلدغته، فمنعه مكان رسول الله صلى الله عليه وسلم أن يتململ، ولكن الألم اشتد به، وتحدرت دموعه، فسقطت على وجه رسول الله فاستيقظ، فقال «مالك يا أبا بكر؟» قال: لدغت. فنفث عليها رسول فبرئت بإذن الله (1) … وقاتل طلحة بن عبيد الله قتال أحد عشر رجلا كانوا حول رسول الله صلى الله عليه وسلم وقتلوا في سبيل الله حتى ضربت يده فقطعت أصابعه فقال «حس» (2) فقال رسول الله صلى الله عليه وسلم: «لو قلت بسم الله لرفعتك الملائكة والناس ينظرون» (3) أي قوم أولئك القوم أحد عشر رجلا كلهم يفدي حبيبه صلى الله عليه وسلم",
    "foot_note": "1. شرح المواهب اللدنية (1/ 404). \n2. حس: بكسر السين والتشديد، كلمة يقولها الإنسان عند التوجّع الألم، النهاية (1/ 385). \n3. أخرجه النسائيّ، وحسنه الألباني، صحيح سنن النسائي (2/ 661) 2951.",
    "book_id": "1067",
    "new_page_number": 81
  },
  {
    "serial_number": "5140475",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 83,
    "volume_number": 1,
    "text": "بنفسه، ويبقى الثاني عشر طلحة بن عبيد الله يقاتل قتال الأحد عشر وتشل يده لكثرة ما وقى بها رسول الله صلى الله عليه وسلم، أخرج البخاري (1) عن قيس قال: «رأيت يد طلحة شلاء، وقي بها النبي صلى الله عليه وسلم يوم أحد». بل وأصيب رضي الله عنه ذاك اليوم ببضع وسبعين طعنة ورمية وضربة، ولذا قال عنه أبوبكر «ذلك كله يوم طلحة» (2) .. وها هو أبو طلحة يقي رسول الله بنفسه يوم أحد، يقول أنس: «لما كان يوم أحد انهزم ناس من الناس عن النبي وأبو طلحة بين يدي النبي صلى الله عليه وسلم مجوب عليه (3) بجحفة» وكان الرجل يمر معه الجعبة من النبل فيقول رسول الله صلى الله عليه وسلم له: «انشرها لأبي طلحة» ويشرف رسول الله صلى الله عليه وسلم ينظر إلى القوم، فيقول أبو طلحة: يا نبي الله بأبي أنت وأمي لا تشرف، يصيبك سهم من سهام القوم نحري دون نحرك» (4) . و «نحري دون نحرك» إما خبر عنه رضي الله عنه أي: أقف أمامك بحيث إن السهم إذا جاء يصيب نحري ولا يصيب نحرك. أو أنه قصد الدعاء، أي: جعل الله نحري أقرب إلى السهام من تحرك،",
    "foot_note": "1. (7/ 359) 4063. \n2. منحة المعبود (2/ 99) 4410. \n3. مجوب: أي مترس عنه ليقيه سلاح الكفار، شرح النووي (12/ 189). \n4. البخاري (7/ 361) ...... ، مسلم (3/ 1443) 1811.",
    "book_id": "1067",
    "new_page_number": 82
  },
  {
    "serial_number": "5140476",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 84,
    "volume_number": 1,
    "text": "لأصاب دونك (1) … وما أجمل ما قاله أنس بن النضر يوم أحد لما انكشف المسلمون: «اللهم إني أعتذر إليك مما صنع هؤلاء - يعني أصحابه - وأبرأ إليك مما صنع هؤلاء - يعني المشركين -، ثم تقدم فاستقبله سعد فقال: يا سعد بن معاذ، الجنة ورب النضر إني أجد ريحها من دون أحد، قال سعد: فما استطعت يا رسول الله ما صنع، قال أنس بن مالك: فوجدنا به بضعا وثمانين ضربة بالسيف، أو طعنة برمح، أو رمية بسهم ووجدناه قد قتل، وقد مثل به المشركون فما عرفه أحد إلا أخته ببنانه (2) .... وكان لأم عمرة نسيبة بنت كعب موقف مشهود يوم أحد حتى قال رسول الله عنها \" التفت يمينا وشمالا إلا وأراها تقاتل دويني \" ووقفت في وجه ابن قمئه لما جاء باحثا عن رسول الله قائلا: \"لا نحوت إن نجا \" حتى ضربها ضربة في عاتقها، أصابت جرحا أجوف له غور، ليبقي هذا الجرح للأمة دور المرأة في نصرة رسول الله والذب عنه .. وها هو شيخ الإسلام يؤلف كتابا على اسمه الصارم المسلول للتصدي",
    "foot_note": "1. ينظر: عمدة القارئ (16/ 274)، هامش صحيح مسلم لمحمّد فؤاد (3/ 1443). \n2. البخاري (3/ 305).",
    "book_id": "1067",
    "new_page_number": 83
  },
  {
    "serial_number": "5140477",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 85,
    "volume_number": 1,
    "text": "لشتائم الرسول ولنصرة رسول الله صلى الله عليه وسلم والذب عن شريعته .. ولا تحسب أن النصرة مقصورة على الإنسان بل كان للحيوان دور عظيم في الدفاع عنه صلى الله عليه وسلم، فقد أخبرته الذراع التي قدمتها اليهودية ضيافة له صلى الله عليه وسلم، فلما أكل رسول الله وأكل القوم قال لهم: «ارفعوا أيديكم، فإنها أخبرتني أنها مسمومة» (1) بل ضنت شاة ذبحت بغير إذن أهلها برسول الله أن يأكل من لحم مشبوه، أخرج أبو داوود عن رجل من الأنصار أن امرأة دعت رسول الله صلى الله عليه وسلم فجاء، وجيء بالطعام، فوضع يده، ثم وضع القوم فأكلوا، فنظر آباؤنا رسول الله صلى الله عليه وسلم يلوك لقمة في فمه. ثم قال «أجد لحم شاة أخذت بغير إذن أهلها» فأرسلت المرأة، قالت: يا رسول الله، إني أرسلت إلى البقيع ليشتري لي شاة فلم أجد، فأرسلت إلى جار لي قد اشترى شاة: إن أرسل لي بثمنها، فلم يجد، فأرسلت إلى امرأته، فأرسلت إلي بها، فقال رسول الله: «أطعميه الأسارى» (2) . وفي خبر الشاة عبرة للمعتبر؟!!!",
    "foot_note": "1. أخرجه أبو داوود، وقال الألباني: حسن صحيح، صحيح سنن أبي داوود (4/ 174) 4512 وأصله في الصحيحين. \n2. أخرجه أبو داوود، وصحّحه الألباني، صحيح سنن أبي داوود (3/ 244) 3333.",
    "book_id": "1067",
    "new_page_number": 84
  },
  {
    "serial_number": "5140478",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 86,
    "volume_number": 1,
    "text": "بقي رسالة لابد - حفظك الله - أن تصلك، وهي أن الله ناصر نبيه لا محالة، لأن قوله تعالى صدق يقول: (إلا تنصروه فقد نصره الله) ويقول (إنا كفيناك المستهزئين) فما كاد رسول الله أحد إلا عوقب شر عقاب، والسير طافحة بخير كفاية الله لرسوله؛ لكن اختبار من الله ليعلم من ينصره ورسله بالغيب، والواقع يبرهن لك انقسام الناس حيال هذا الاختبار إل صادق في حبه أو خلاف ذلك .. وإليك نماذج أذكرها لك لتطيب نفسك، ويطمئن خاطرك بقرب نصر الله لنبيه وإجزال الثواب لك في صدق نيتك وعظيم غيرتك، أخرج البخاري (1) من حديث أنس قال: كان رجل نصرانيا فأسلم وقرأ البقرة وآل عمران فكان يكتب للنبي صلى الله عليه وسلم فعاد نصرانيًّا. عند مسلم. «فانطلق هاربًا حتى لحق بأهل الكتاب، فرفعوه» فكان يقول: ما يدري محمد إلا ما كتبت له،. وعند مسلم. «قالوا: كان هذا يكتب لمحمد فأعجبوا به»، فأماته الله فدفنوه فأصبح وقد لفظته الأرض، فقالوا: هذا من فعل محمد وأصحابه لما هرب منهم نبشوا عن صاحبنا فألقوه، فحفروا له فأعمقوا، فأصبح وقد لفظته الأرض، فقالوا: هذا من فعل محمد وأصحابه لما هرب منهم نبشوا عن صاحبنا فألقوه، فحفروا له وأعمقوا له في الأرض ما استطاعوا، فأصبح قد لفظته الأرض فعلموا أنه ليس من الناس فألقوه» .. يقول شيخ الإسلام: «فهذا الملعون الّذي افترى على النّبيّ أنه",
    "foot_note": "1. (3/ 1325) 3421.",
    "book_id": "1067",
    "new_page_number": 85
  },
  {
    "serial_number": "5140479",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 87,
    "volume_number": 1,
    "text": "ما كان يدري إلا ما كُتب له قصمه الله وفضحه بأن أخرجه من قبره بعد أن دفن مرارا وهذا أمر خارج عن العادة، يدلُ على أنّ هذا عقوبة لما قاله وأنه كان كاذبا، إذ عامة الموتى لا يصيبهم مثل هذا وأن هذا الجرم أعظم من الإرتداد، إذ كان عامة المرتدين يموتون ولا يصيبهم مثل هذا وأن الله منتقم لرسوله من طعن فيه وسبه، ولكذب الكاذب إذا لم يمكن للناس أن يقيموا عليه الحد» (1) وذكر القاضي عياض (2) قصة عجيبة لساخر بالنبيّ، وذلك أن فقهاء القيروان وأصحاب سحنون أفتوا بقتل ابراهيم الفزاري، وكان شاعرًا متفنّنًا في كثير من العلوم وكان يستهزأ بالله وأنبيائه ونبينا محمد صلى الله عليه وسلم فأمر القاضي يحيى بن عمر بقتله وصلبه، فطُعن بالسكين وطلب منكّسًا ثم أنزل، وحكا بعض المؤرخين أنه لما رفعت خشبته وزالت عنها الأيادي، استدارت وحولته عن القبلة، فكان آية للجميع، وكبر الناس، وجاء كلب فولغ في دمه» … بل إن الله لينصر أوليائه على أعدائه إذا نال الأعادي من حبيبنا، يقول شيخ الإسلام في «الصارم المسلول» (3) بعد أن ذكر تجارب بخصوص ما لحق من سب رسول الله: «ونظير هذا ما",
    "foot_note": "1. الصارم المسلول (233). \n2. الشفا (2/ 218). \n3. (2/ 233).",
    "book_id": "1067",
    "new_page_number": 86
  },
  {
    "serial_number": "5140480",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 88,
    "volume_number": 1,
    "text": "حدثناه أعداد من المسلمين العدول أهل الفقه والخبرة عما جربوه مترات متعددة في حصر الحصون والمدائن التي بالسواحل الشّامية لما حصر فيها بني الأصفر في زماننا، قالوا: كنّا نحصر الحصن أو المدينة الشهر أو أكثر من الشهر وهو ممتنع علينا، حتى نكاد نياس منه حتى إذا تعرض أهله لسبّ رسول الله صلى الله عليه وسلم والوقيعة في عرضه تعلنا فتحه وتيسّر، ولم يكد يتأخر إلا يومًا أو يومين أو نحو ذلك، ثم يفتح المكان عنوة، ويكون فيهم ملحمة عظيمة، قالوا: حتّى إنّا كنّا لنتباشر بتعجيل الفتح إذا سمعناهم يقعون فيهم مع امتلاء القلوب غيظًا بما قالوه فيه» .. وبعدما تقدّم أذكّرك وجوب النصرة لنبيّه وإلا تنصره فإن الله ناصره، ونصرتك لرسول الله صلى الله عليه وسلم إما دفع أو رفع، والأولى منهما تكون بتعليم الناس سنته وتعريفهم به، ودعوهم إلى الإيمان برسالته، والثاني منهما يكون بالدفاع عن شخصه الكريم صلى الله عليه وسلم وعن أقواله بتمييز صحيحها من سقيمها ورد شبهات المبطلين حولها، كما يفعله بعض جهلة المسلمين من الإستهزاء بما جاء به رسول الله صلى الله عليه وسلم عن ربه من مسلمات كالحجاب واللحية ورفع الإزار فوق الكعبين، والأمر بموالاة من ولي الله ورسوله، ومعاداة من عادي الله ورسوله ..",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 87
  },
  {
    "serial_number": "5140481",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 89,
    "volume_number": 1,
    "text": "والإستهزاء بالسنة الصحيحة الثابتة كفر يخرج من الملة (1) ، قال تعالى: الآلات {وَلَئِنْ سَأَلْتَهُمْ لَيَقُولُنَّ إِنَّمَا كُنَّا نَخُوضُ وَنَلْعَبُ قُلْ أَبِاللَّهِ وَآيَاتِهِ وَرَسُولِهِ كُنْتُمْ تَسْتَهْزِئُونَ (65) لَا تَعْتَذِرُوا قَدْ كَفَرْتُمْ بَعْدَ إِيمَانِكُمْ إِنْ نَعْفُ عَنْ طَائِفَةٍ مِنْكُمْ نُعَذِّبْ طَائِفَةً بِأَنَّهُمْ كَانُوا مُجْرِمِينَ} واعلم. وفقك الله. أن التهاون في الذب عن رسول الله وشريعته من الخذلان الذي يدل عليه ضعف الإيمان، أو زواله بالكلية فمن ادعى الحب ولم تظهر عليه آثار الغيرة على حرمته وعرضه وستته فهو كاذب في دعواه، إذ لوكان صادقا لانتصر، قال محمد ابن المرتضى: إن المحامي عن الستة الذات عن حماها، كالمجاهد في سبيل الله، يعد للجهاد ما استطاع من والعدة والقوة، كما قال سبحانه {وَأَعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ}، وقد ثبت في الصحيح أن جبريل كان مع حسان بن ثابت يؤيده ما نافح عن رسول الله في أشعاره، فكذلك من ذب عن دينه وستته من بعده إيمانا به وحبا ونصحا له (2) ..",
    "foot_note": "1. انظر تفاصيل المسألة في ال صارم المسلول على شاتم الرسول. \n2. إيثار الحق على الخلق (20).",
    "book_id": "1067",
    "new_page_number": 88
  },
  {
    "serial_number": "5140482",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 90,
    "volume_number": 1,
    "text": "وفي نهاية المطاف سأوصيك بوصايا تجعلك بإذن الله فاعلا في خدمة دين الله وسنة رسول الله، ناصرة لمن أمرك ربّك بنصره: 1 - قراءة تفسير سورة الحجرات، وأواخر سورة النور فقد حوت آدابًا عظيمة في التعامل مع الرسول صلى الله عليه وسلم وسنّته .. 2 - العزم على قراءة كتاب في الحديث النبوي وآخر في السيرة النبوية لمعرفة رسول الله صلى الله عليه وسلم حق معرفته، وما يتعلق بأحواله وأيامه وسننه وهديه، وقد ذكرت لك فيما تقدم بعض الكتب النافعة في بابها. 3 - توزيع الأدوار على أفراد أسرتك وطلابك في مدرستك بحيث يكتب كل واحد منهم حديثا صحيحا عن رسول الله صلى الله عليه وسلم كل يوم في مكان بارز يخصص فيه سبورة وأقلام لتدوين السنة النبوية، وفي القاعة يدون الحديث على طرف السبورة، وقد عايشت مع زميلاتي هذه التجربة، وجدنا بركة تطبيقها، ولا غرو فإن خدمة السنة شرف. 4 - أن يحرص كل منا على إعداد درس في الحديث النبوي أو أخلاق رسول الله أو السيرة يلقيه على أفراد أسرته، أو طلاب فصله، أو جماعة مسجده، على أن يعتمد في التحضير والإعداد على الكتب التي عنيت بصحيح السنة، ويملأ أوقات الناس بأقوال الله ورسول الله",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 89
  },
  {
    "serial_number": "5140483",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 91,
    "volume_number": 1,
    "text": "-صلى الله عليه وسلم إذا اشتغل غيرهم بأقوال البشر وأحوال دنياهم. 5 - احرص على كتابة الأحاديث النبوية الصحيحة لاسيما غير المشتهرة وانشرها عن طريق رسائل الجوال، أو البريد الإلكتروني .. 6 - لا تستعجل في نشر رسالة أتتك تحوي حديثا عن رسول الله صلى الله عليه وسلم ما لم تتأكد من صحة الحديث .. 7 - اعقد مسابقة في حفظ السنة النبوية، أوضع أسئلة حول كتاب في السيرة، واضرب لصاحب الفوز جوائز قيمة .. 8 - اثن ركبك في حلق العلم لاسيما الحلق التي عنت بشرح الأحاديث أو الدورات المقامة في مصطلح الحديث أو تخريجه .. 9 - لا يفتر لسانك دائما من الصلاة والسلام عليه، بل كن مفتاح خير وذكر من حولك دائما بفضل الصلاة عليه ولا تنس أن تقتني كتاب «جلاء الأفهام في الصلاة والسلام على خير الأنام» لابن قيم الجوزية لتقراه، وتُقْرِاه. 10 - احرص على إصدار دورية، فإن رامت نفسك الزيادة فمجلة تختص بالأحاديث عن رسول الله صلى الله عليه وسلم وأحواله وهديه وأقواله تنشر فيها ما صح، فإن لم تستطع إلى ذلك سبيلا فانشر في المجلات والصحف والمواقع عن ما خطّه قلمك، وما تشرف به حبرك من الضرب بالسهم في خدمة سنته وتذكر «بلغوا عني ولو آية».",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 90
  },
  {
    "serial_number": "5140484",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 92,
    "volume_number": 1,
    "text": "11 - ترجم ما تقرأه وتنشره إلى واقع تعيشه وتطبقه، وانشر أخلاقه وأقوال رسول الله بفعلك قبل قولك؛ فإن التربية بالقدوة مطلب أي مطلب. 12 - إن كنت من طلبة الدراسات العليا في إحدى الجامعات، أو من طلبة الحديث فلتتق نفسك لجمع هدي رسول الله في كل مسلك، كهدية مع أصحابة، وهديه مع أعدائه، وهديه في حواره، وهديه في صلاته، وتشتغل بجمع الأحاديث الصحيحة واستخراج فوائدها واستنباطاها، ثم تنشر ما كتبته، لتعم فائدته .. 13 - لنفكر سويا في إنشاء قناة عالمية تترجم لعدة لغات للتعريف برسول الإسلام صلى الله عليه وسلم يشترك فيها العالم والتقني الخدمة دين الله وسنة رسول الله. 14 - إنشاء موقع إلكتروني على الشبكة الالكترونية للتعريف برسول الله وعرض سيرته المشرقة دون تدليس أو تشويه .. 15 - تتبع شبهات المستشرقين ولوثات العقلانيين للرد عليها وكثف عوارها لاسيما في وقت كفأ الجناة فيه المكتل مملوءا بالرذائل بكل قوة وجراءه واندفاع وإنك لتعجب حين ترى من آثارها يحمل اسما إسلاميا وإذا نظرت إلى المضمون وجدته يقطر فكرا لا يحمله إلا مستغرب مسير اشرب قلبه الهوى والتفرنج.، وأما الصياغة فقوي",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 91
  },
  {
    "serial_number": "5140485",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 93,
    "volume_number": 1,
    "text": "قلبك على قرع الألفاظ المولدة والتراكيب الكيكة واللحن الفاحش وتصيد عبارات صحفية تقمش من هنا وهناك على جادة  القص واللزق طريقة العجزة الذي قعدت بهم قدراتهم عن أن يكتبوا كتابا وآذوا من له علم الشرع أو لسان العرب أو الذوق البياني .. 16 - القيام بحملات مباركة لخدمة السنة النبوية تصاحبها ندوات ومحاضرات ويوزع على أثرها كتب ومسموعات، وقد كان لطالبات كلية التربية الأقسام الأدبية بالرياض حملات مذكورة مشهورة كان لها أصداء طيبة وآثار مباركة. 17 - نصرة رسول الله صلى الله عليه وسلم عند تطاول بعض الناس على سنته أو الإنتقاص منها ومجادلتهم بالتي هي أحسن، ولا يكن أهل الباطل في باطلهم أجرأ منك في بيان حقك، واحذر السلبية المذمومة وخذ على يد من أراد أن يغرق السفينة. 18 - ارجع إلى كتاب الله وسنة رسول الله في كل أمرك، وارض بشرعته وسلم لحكمه ولا تجد في نفسك جرحا مما قضى صلى الله عليه وسلم. 19 - لتبدأ بالكتاب والسنة لإصلاح نفسك وبيتك ومن حولك. لتبدأ بالكتاب والسنة لرسم طريق سعيد مليء بما يحبه الله وبرضاه،",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 92
  },
  {
    "serial_number": "5140486",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 94,
    "volume_number": 1,
    "text": "لتبدأ بالكتاب والسنة لتصحيح مسار معوج أرادك الشيطان أن تسلكه، وأبت نفسك إلى الرجوع لما يحبه ربك وختمه لك بالجنة، لتبدأ بالكتاب والسنة لحل مشكلات أرقتك مع زوجتك أو ابنك أو صديقك أو عدوك، لتبدأ بالكتاب والسنة لتعرف ماضيك وما يجب عليك في حاضرك وما سيواجهه العالم في المستقبل، عش أجمل ساعاتك مع كتاب الله وسنة رسول الله، واجلس مع الصحابة والتابعين وانظر في كتبهم وآثارهم. لنا جلساء ما نمل حديثهم … ألباء مأمونون غيبا ومشهدا يفيدوننا من علمهم علم ما مضى … وحلما وتأديبا ورأيا مسندا وتمثل دوما في حبك بقول الأول: ومن عجب أني احن إليهم … وأسأل شوقا من لقيت وهم معي وتطلبهم عيني وهم في سوادها … ويشكو النوى قلبي وهم بين أضلعي",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 93
  },
  {
    "serial_number": "5140487",
    "category_id": "24",
    "category": "السيرة النبوية",
    "book_title": "كيف تنصر نبيك صلى الله عليه وسلم",
    "edition": "الأولى، 1434 هـ - 2013 م",
    "publisher": "دار الحضارة للنشر والتوزيع",
    "page_number": 95,
    "volume_number": 1,
    "text": "والزم - رعاك الله - الحق وإن كنت وحدك، فلا بد من أنس وإن طال الطريق وكثر قطاعه. وأسأل الله أن يتقبل مني ومنك، ويحمي أعراضنا من ناره الموقدة لحمايتنا كريم عرضه، ويجعله سببا يوصلنا بأسبابه، وذخيرة نجدها يوم تحد كل نفس ما عملت من خير محضرا، نحوز بها رضاه وجزيل ثوابه، ويخصنا بخصيصي زمرة نبينا وجماعته، ويحشرنا في الرعيل الأول وأهل الباب الأيمن من أهل شفاعته، ويصطفينا لخدمة كتابة وسنة نبيه، ويجعلنا حماة للدين ذابين عنه؛ إنه ولي ذلك والقادر عليه، حسبنا الله ونعم الوكيل، وصلاته وسلامه على سيدنا خاتم النبيين وعلى آله وصحبه .. * * * *",
    "foot_note": "None",
    "book_id": "1067",
    "new_page_number": 94
  }
]