[
  {
    "text": "فضائل مصر المحروسة\nالمؤلف: ابن الكندي عمر بن محمد بن يوسف من علماء النصف الثاني من القرن الرابع الهجري\nسنة الوفاة: Null\n\nالقسم: البلدان والرحلات الكتاب : فضائل مصر المحروسة المؤلف : ابن الكندي ، عمر بن محمد بن يوسف ، من علماء النصف الثاني من القرن الرابع الهجري المحقق : د علي عمر ، قسم التاريخ والحضارة الإسلامية بجامعتي المنيا والإمام محمد بن سعود بالرياض الناشر : مكتبة الخانجي - القاهرة الطبعة : الأولى ، 1417 هـ - 1997 م ( وقد نشره المحقق أول مرة في مطبعة الاستقلال ، القاهرة 1391 هـ - 1971 م ) عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nالكتاب : فضائل مصر المحروسة المؤلف : ابن الكندي ، عمر بن محمد بن يوسف ، من علماء النصف الثاني من القرن الرابع الهجري المحقق : د علي عمر ، قسم التاريخ والحضارة الإسلامية بجامعتي المنيا والإمام محمد بن سعود بالرياض الناشر : مكتبة الخانجي - القاهرة الطبعة : الأولى ، 1417 هـ - 1997 م ( وقد نشره المحقق أول مرة في مطبعة الاستقلال ، القاهرة 1391 هـ - 1971 م ) عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nالمؤلف : ابن الكندي ، عمر بن محمد بن يوسف ، من علماء النصف الثاني من القرن الرابع الهجري المحقق : د علي عمر ، قسم التاريخ والحضارة الإسلامية بجامعتي المنيا والإمام محمد بن سعود بالرياض الناشر : مكتبة الخانجي - القاهرة الطبعة : الأولى ، 1417 هـ - 1997 م ( وقد نشره المحقق أول مرة في مطبعة الاستقلال ، القاهرة 1391 هـ - 1971 م ) عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nالمحقق : د علي عمر ، قسم التاريخ والحضارة الإسلامية بجامعتي المنيا والإمام محمد بن سعود بالرياض الناشر : مكتبة الخانجي - القاهرة الطبعة : الأولى ، 1417 هـ - 1997 م ( وقد نشره المحقق أول مرة في مطبعة الاستقلال ، القاهرة 1391 هـ - 1971 م ) عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nالناشر : مكتبة الخانجي - القاهرة الطبعة : الأولى ، 1417 هـ - 1997 م ( وقد نشره المحقق أول مرة في مطبعة الاستقلال ، القاهرة 1391 هـ - 1971 م ) عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nالطبعة : الأولى ، 1417 هـ - 1997 م ( وقد نشره المحقق أول مرة في مطبعة الاستقلال ، القاهرة 1391 هـ - 1971 م ) عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\n( وقد نشره المحقق أول مرة في مطبعة الاستقلال ، القاهرة 1391 هـ - 1971 م ) عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nعدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\n[ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nتاريخ النشر بالشاملة : 8 ذو الحجة 1431",
    "foot_note": "None",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "فضائل مصر المحروسة",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "new_page_number": 1
  },
  {
    "text": "sn: 6873\nbook_title: فضائل مصر المحروسة\nbook_link: https://shamela.ws/book/405\nbook_id: 405\nauthor_name: ابن الكندي عمر بن محمد بن يوسف من علماء النصف الثاني من القرن الرابع الهجري\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/751\nauthor_ID: 751\neditor: د علي عمر، قسم التاريخ والحضارة الإسلامية بجامعتي المنيا والإمام محمد بن سعود بالرياض\npublisher: مكتبة الخانجي- القاهرة\nedition: الأولى، 1417 هـ - 1997 م (وقد نشره المحقق أول مرة في مطبعة الاستقلال، القاهرة 1391 هـ - 1971 م)\npages: 52\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: البلدان والرحلات\ncategory_id: 28",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "فضائل مصر المحروسة",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "new_page_number": 2
  },
  {
    "serial_number": "6303851",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 7,
    "volume_number": 0,
    "text": "بسم الله الرحمن الرحيم مقدمة موضوع الكتاب يتجلى في قول ابن الكندى: \"هذا الكتاب أمر بجمعه وحض على تأليفه الأستاذ أبو المسك كافور، نذكر فيه أخبار مصر وما خصها الله تعالى به من الفضل والبركات والخيرات على أكثر البلدان … \". وقد استهل ابن الكندى عرضه لأخبار مصر وفضائلها بآيات من القرآن الكريم جاء فيها ذكر مصر من مثل قوله تعالى: {وَأَوْحَيْنَا إِلَى مُوسَى وَأَخِيهِ أَنْ تَبَوَّآ لِقَوْمِكُمَا بِمِصْرَ بُيُوتًا وَاجْعَلُوا بُيُوتَكُمْ قِبْلَةً} [يونس: 87]. وقوله تعالى حكاية عن فرعون وافتخاره بمصر: {أَلَيْسَ لِي مُلْكُ مِصْرَ وَهَذِهِ الْأَنْهَارُ تَجْرِي مِنْ تَحْتِي} [الزخرف: 51]. وهكذا ساق ابن الكندى عددا من الآيات الكريمة التي ذكر فيها اسم مصر، ليصل في النهاية إلى التنويه بمجد وطنه، ولذا نراه يتساءل بعدها: فهل يعلم أن بلدًا من البلدان في جميع أقطار الأرض أثنى عليه الكتاب بمثل هذا الثناء، أو وصفه بمثل هذا الوصف، أو شهد له بالكرم غير مصر؟. وسار ابن الكندى على النهج نفسه في روايته لأحاديث الرسول الكريم التي ورد فيها ذكر مصر، ونقتبس منها حديثا روى عن الرسول الكريم صلى الله عليه وسلم يوصى فيه صحابته بأهل مصر، وهو مما رواه مسلم في صحيحه، وهو: \"ستفتح عليكم بعدى مصر فاستوصوا بقبطها خيرا فإن لكم منهم صهرا وذمة\". كما أشاد ابن الكندى بمصر وبأهلها في الجانب المرتبط بالرسل والأنبياء فيما ذكره عن الرسول الكريم حين كتب إلى جماعة من الملوك منهم هرقل الروم، فما أجابه أحد منهم، وكتب إلى المقوقس صاحب مصر، فأجابه عن كتابه جوابا جميلا، وأهدى إلى الرسول الكريم عددا من الهدايا فقبلها، ومن هذا المنظور",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 3
  },
  {
    "serial_number": "6303852",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 8,
    "volume_number": 0,
    "text": "جميلا، وأهدى إلى الرسول الكريم عددا من الهدايا فقبلها، ومن هذا المنظور التاريخى عالج ابن الكندى أيضا موقف وزراء مصر في القديم؛ وبين أن الله سبحانه أثنى عليهم في كتابه الكريم لأنهم قدموا النصح لفرعون، قال تعالى حكاية عن فرعون: {قَالَ لِلْمَلَإِ حَوْلَهُ إِنَّ هَذَا لَسَاحِرٌ عَلِيمٌ (34) يُرِيدُ أَنْ يُخْرِجَكُمْ مِنْ أَرْضِكُمْ بِسِحْرِهِ فَمَاذَا تَأْمُرُونَ (35) قَالُوا أَرْجِهْ وَأَخَاهُ وَابْعَثْ فِي الْمَدَائِنِ حَاشِرِينَ (36) يَأْتُوكَ بِكُلِّ سَحَّارٍ عَلِيمٍ (37)} [الشعراء: 34 - 37]. وهنا يتساءل ابن الكندى أيضا: فهل في الدنيا جلساء ملك أرجح عقلا وأحسن محضرا منهم؟. وذلك على العكس من وزراء نمرود الذين حرضوه على البغى والقتل حين شاورهم في أمر إبراهيم عليه السلام. قال تعالى حكاية عنهم: {قَالُوا حَرِّقُوهُ وَانْصُرُوا آلِهَتَكُمْ إِنْ كُنْتُمْ فَاعِلِينَ (68)} [الأنبياء: 68]. وعالج ابن الكندى في ضوء هذا المنهج من أنجبته مصر من الحكماء، فذكر منهم: نيروز أبو بختنصر وكان رجلا من أهل العلم، والاسكندر ذو القرنين ونسب إليه بناء عدة مدن كسمرقند والإسكندرية ببلاد الخزر وغيرهما. ثم أعقب ذلك يذكر عدد من فلاسفة الإغريق وعلمائهم ممن كانوا بمصر ووضعوا مؤلفات في الفلك والهندسة والطبيعة والطب وغيرها. وأشاد ابن الكندى ببلده مصر حين ذكر أن هؤلاء الفلاسفة والعلماء سكنوا مصر في العصور السالفة فما غيرت أذهانهم ولا أضرت بعقولهم. ويمضى ابن الكندى في كتابه ليصل إلى العصر الإسلامي فيذكر عددا من الصحابة الذين وفدوا إلى مصر مع عمرو بن العاص أثناء الفتح كما يذكر عددا منهم بلغوا الثمانين رجلا ممن وقف على إقامة المسجد الجامع. كما أشاد بعد ذلك بمن أنجبته مصر من الفقهاء والعلماء، فجعل يزيد بن أبى حبيب في قمة فقهاء وعلماء مصر وقتئذ، كما جعل الليث بن سعد ثانى اثنين من فقهاء مصر وعلمائها في عصره، أما ابن لهيعة فقد وصفه بعلو منزلته في الفقه والحديث والأخبار. ثم ذكر بعدهم طائفة أخرى من علماء مصر من أمثال",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 4
  },
  {
    "serial_number": "6303853",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 9,
    "volume_number": 0,
    "text": "أشهب بن عبد العزيز، وأسد بن موسى، والمزنى صاحب الشافعي، ثم قال: وكل واحد قد برع في مذهبه، ونجم على أهل عصره، ولكل واحد منهم من الكتب المصنفة ما يعجز عن نظيرها سائر أهل الدنيا. أما سعيد بن عفير، ويحيى بن عثمان؛ وابن قديد، وأبو عمر الكندى فقد جعلهم ابن الكندى من أعلام المؤرخين البارزين في القرن الثالث الهجرى حيث أشاد بكل واحد منهم ووصفه بأنه قد فاق أهل عصره وبرز عليهم في المعرفة بالأخبار وأيام الناس، والاقتنان في سائر العلوم. وممن نبغ من المؤرخين المصريين في العصر الإخشيدى ابن يونس والكندى؛ ويضعهما ابن الكندى في قمة مؤرخى مصر الإسلامية وقتئذ. كذلك يذكر ابن الكندى مما أشاد به من فضائل مصر من كان بها من الزهاد من أمثال حيوة بن شريح، وسليم بن عِتْر، وغيرهما. كما أوضح اعتزازه واعتزاز مواطنيه ببلدهم مصر في التنويه بشأنها بذكر من وفد إليها من العلماء والخلفاء والشعراء. وكان مركز الحركة العلمية الدينية في مصر وقلبها الناهض في ذلك العهد، جامع عمرو بن العاص، فكان ملتقى العلماء وإليه يفد الطلاب لتلقى العلم، كما كثر الوافدون إلى مصر من شتى الأمصار الإسلامية بغية الرواية عن علماء مصر. وانتقل ابن الكندى من الإشادة بعلماء مصر إلى الإشاده بمصر وما تميزت به عن غيرها من الأمصار، فذكر ما قاله بعض الصحابة في شأنها من أنها خزانة الأرض كلهاء ثم أشار إلى ما تميزت به مصر من طيب هوائها ونقاء جوها وما يتمتع به أهلها من سلامة وأمن يكاد ينعدم في الأمصار الأخرى. كما أشاد بمصر حين نوه بما قاله أهل المعرفة بشأنها من أن أهل الدنيا مضطرون إلى مصر يسافرون إليها طلبا للرزق وغيره وأهلها ليسوا كذلك. وبلغت رؤية ابن الكندى لفضائل مصر وروعتها وهو يتحدث عن النظام الإدارى في مصر، حيث كان بها ثمانون كورة (مركز) فقد أشاد بما في كل",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 5
  },
  {
    "serial_number": "6303854",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 10,
    "volume_number": 0,
    "text": "كورة من الطرائف والعجائب من أصناف الشراب والطعام والفاكهة وكذلك بما في كل مدينة من الآثار العجيبة والبرابى وغير ذلك. أما النيل فقد أظهر ابن الكندى اعتزازه واعتزاز مواطنيه به فيما قام به من جمع الروايات التي تشيد بهذا النهر وتوضح أهميته لحياة مصر وأهلها. وعن فضائل مصر الاقتصادية فقد أوضح ابن الكندى فضل مصر على غيرها في أثناء ذكره لمواردها. فأشاد بخيراتها الوفيرة الناتجة من الزراعة، حيث كان يزرع فيها الكتان والقمح والقرط وسائر أصناف الغلات. وحين أشاد بمنتجات مصر وصناعاتها ذكر ما اشتهرت به من صناعة القصب التنيسى والثوب الديبقى. مما ليس بغيرها، وكذلك ما اشتهرت به من صناعة المنسوجات الصوفية والأكسية المرعز التي لم يكن لها مثيل. وقد تجلى اعتزازه واعتزاز مواطنيه بصناعة مصر المتميزة في هذا الشأن بما حكاه أهل العلم والخبرة بمميزات هذه الصناعة من أن معاوية بن أبى سفيان لما كبرت سنه كان لا يدفأ، فاتفقوا أنه لا يدفئه إلا الأكسية التي تعمل بمصر من صوفها المرعز؛ فعمل له منها عدد، فما احتاج منها إلا إلى واحد فقط. كذلك أشاد ابن الكندى بفضل مصر على غيرها بما اشتهرت به من صناعة الورق وصناعة المعادن. واختتم ابن الكندى رؤيته لفضائل مصر بالإشادة بموقعها الممتاز الذي تتمتع به وبما كان له من أثر في نشاط مصر التجارى (1) . ***",
    "foot_note": "1. ذكر المؤلف مصادره إلى اعتمد عليها في مقدمة كتابه هذا.",
    "book_id": "405",
    "new_page_number": 6
  },
  {
    "serial_number": "6303855",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 11,
    "volume_number": 0,
    "text": "المؤلف ونسبة الكتاب إليه لم تذكر المصادر التي بين أيدينا شيئا عن حياة عمر بن أبى عمر الكندى؛ والتزمت جميعها الصمت نحو حياته، وكل ما يمكن معرفته عنه، أنه كان على قيد الحياة في النصف الثاني من القرن الرابع الهجرى، وأنه ألف كتاب فضائل مصر المحروسة للأمير أبى المسك كافور بناء على رغبة هذا الأمير الذي استقل بملك مصر سنة 355 هـ. يضاف إلى ذلك أنه أخذ عن أبيه أبى عمر (ت 350 هـ) كما أخذ عنه المؤرخ المصرى ابن زولاق (ت 387 هـ) (1) . هذا وقد ظل كثير من المؤرخين حتى اليوم ينسبون كتاب فضائل مصر إلى أبى عمر الكندى مؤلف الولاة والقضاة، فالسيوطى يقول في مقدمة كتابه حسن المحاضرة: وقد طالعت على هذا الكتاب كتبا شتى منها فضائل مصر لأبى عمر الكندى (2) . وقد سار على نهج السيوطى أغلب المؤرخين المُحْدَثين فنسب البغدادى كتاب الفضائل إلى أبى عمر الكندى (3) ، كما نسبه كذلك الزركلى (4) ، وكذلك فعل رضا كحالة (5) . ويعتبر المقريزى المؤرخ الوحيد الذي يذكر صراحة نسبة كتاب الفضائل إلى عمر بن أبى عمر الكندى، وفقد نقل كثيرًا عن كتاب الفضائل وأودعها خططه ونسبها إلى عمر هذا (6) .",
    "foot_note": "1. ابن زولاق: مختصر تاريخ مصر، ورقة 25. \n2. السيوطى: حسن المحاضرة ج 1 ص 3. \n3. إيضاح المكنون ج 7 ص 197، وهدية العارفين ج 2 ص 46. \n4. الأعلام ج 8 ص 21. \n5. معجم المؤلفين ج 3 ص 791. \n6. المقريزى: المواعظ والاعتبار ج 1 ص 124، 158، 176، 204، 211، 212، 249.",
    "book_id": "405",
    "new_page_number": 7
  },
  {
    "serial_number": "6303856",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 12,
    "volume_number": 0,
    "text": "يضاف إلى ذلك أن كتاب فضائل مصر لم يذكر بين مؤلفات أبى عمر الكندى في ترجمته بكتاب المقفى للمقريزى، حيث ساق المقريزى مؤلفاته دون إشارة إلى كتاب الفضائل (1) . ومهما يكن من أمر فإن عمر أشار في مقدمة كتابه الفضائل هذا إلى والده أبى عمر بين علماء مصر الذين جمع من كتبهم ما أمره به كافور الإخشيدى، كما ذكره مرة أخرى بين علماء مصر الذين فاقوا أهل عصرهم وبرزوا عليهم في العلم والأخبار وأيام الناس. كما تحدث عمر عن نفسه أثناء الكلام عن الأهرام والصابئة في كتابه هذا فقال: وأنا رأيت من الصابئة من حجهما. ***",
    "foot_note": "1. المقريزى: المقفى ج 7 ص 489.",
    "book_id": "405",
    "new_page_number": 8
  },
  {
    "serial_number": "6303857",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 13,
    "volume_number": 0,
    "text": "مكانة ابن الكندى بين المؤرخين ظل ابن الكندى لفترات طويلة تجاوزت عصره - من أبرز وجوه مصر الفكرية لدى مؤرخى مصر. وقد تجلى ذلك حين اعتمدت المؤلفات المتأخرة على كتاب ابن الكندى إلى حد بعيد. فقد نقل عنه ابن سعيد الأندلسى (ت 685 هـ) في كتاب المغرب في حلى المغرب نقلا حرفيا في عدة مواضع. وذلك بمناسبة ما رآه بمصر موسى الهاشمي والى مصر من قبل الرشيد من بعض المناظر التي شدت انتباهه وبين إعجابه بها من أمثال النخيل والبساتين والنيل ومراتع الخيل وصائدى الأسماك وملاحى السفن وغير ذلك (1) . وكذلك نقل ابن سعيد نصا كاملا عن ابن الكندى في فضل مقبرة مصر (2) . كما نقل ابن سعيد أيضًا عن كتاب فضائل مصر بمناسبة الحديث عن الإسكندرية وما بها من عجائب (3) . ويلاحظ أن جميع النقول لدى ابن سعيد مأخوذة بالحرف عن ابن الكندى. أما النويرى (ت 732 هـ) فقد انتفع كذلك بكتاب فضائل مصر في كتابه \"نهاية الأرب\" (4) وذلك في الفصل الذي عقده بعنوان \"مصر وما يختص",
    "foot_note": "1. انظر ابن سعيد الأندلسي: المغرب في حلى المغرب ص 3. \n2. المصدر السابق ص 11، 12. \n3. انظر المصدر السابق ص 16. \n4. انظر جـ 1 ص 344.",
    "book_id": "405",
    "new_page_number": 9
  },
  {
    "serial_number": "6303858",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 14,
    "volume_number": 0,
    "text": "بها من الفضائل\" فقد نقل معظم مادته نقلًا حرفيا عما جاء بكتاب ابن الكندى. كما كان كتاب فضائل مصر لابن الكندى من المصادر الرئيسية لدى القلقشندى (1) (ت 871 هـ) في الفصل الذي خصصه للحديث عن مصر وفضائلها. أما المقريزى (ت 845 هـ) فقد نقل في كتابه المواعظ والاعتبار معظم المادة الموجودة في كتاب الفضائل، واستعان بها في أماكن متعددة من كتابه، فاقتبس من الفضائل بمناسبة الحديث الذي دار بين عمرو بن العاص والمقوقس بشأن جبل المقطم (2) . كما اقتبس من الفضائل بمناسبة الحديث عن منارة الإسكندرية (3) . وكذلك في حديثه عن مدينة أتريب (4) . كما استعان المقريزى بابن الكندى في وصفه لمدينة الفرما وما كان بها من آثار (5) وكذاك في وصفه لمدينة الفيوم (6) . كذلك اعتمد ابن تغرى بردى (7) (ت 874 هـ) على ابن الكندى وذلك بمناسبة الحديث عن فضائل مصر من جبلها المقدس ونيلها المبارك وما بها من آثار. وتعتبر معظم النقول الخاصة بفضائل مصر لدى السيوطى (ت 910 هـ) مأخوذة بالحرف عن كتاب فضائل مصر لابن الكندى، وذلك على الرغم من أنه نسب كتاب الفضائل خطأ لأبى عمر الكندى (8) .",
    "foot_note": "1. انظر صبح الأعشى ج 3 ص 287. \n2. انظر المقريزى: المواعظ والاعتبار ج 1 ص 124. \n3. انظر المصدر السابق ج 1 ص 158. \n4. انظر المصدر السابق ج 1 ص 176. \n5. انظر المصدر السابق ج 1 ص 211. \n6. انظر المصدر السابق ج 1 ص 249. \n7. انظر النجوم الزاهرة ج 1 ص 37. \n8. انظر السيوطى: حسن المحاضرة ج 1 ص 3، 553.",
    "book_id": "405",
    "new_page_number": 10
  },
  {
    "serial_number": "6303859",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 15,
    "volume_number": 0,
    "text": "فقد أشار السيوطى إلى كتاب الفضائل بمناسبة ذكر من دخل مصر من الأنبياء (1) . وكذلك بمناسبة السحرة الذين آمنوا بموسى عليه السلام (2) وما ذكره أيضا من كان بمصر من الحكماء في الدهر الأول (3) . وفى الفصل الذي عقده السيوطى عن المقطم اعتمد فيه كذلك إلى حد بعيد على كتاب الفضائل، فنقل معظم أقواله منه بنصها (4) . وكذلك الفصل الذي عقده السيوطى بعنوان لطائف مصر، فقد نقل معظم مادته أيضا من كتاب الفضائل بنصها (5) . ويعد كتاب الفضائل أيضا مصدرا رئيسيا لدى ابن ظهيرة في كتابه الفضائل الباهرة في محاسن مصر والقاهرة، حيث نقل هذا المؤرخ معظم ما كتبه ابن الكندى عن فضائل مصر في كثير من فصول كتابه (6) . وهكذا ظلت مدرسة مصر تعتمد على كتاب ابن الكندى في كل مراحلها حين يزمع مؤرخوها الحديث عن فضائل مصر. ***",
    "foot_note": "1. انظر السيوطى: حسن المحاضرة ج 1 ص 52. \n2. انظر المصدر السابق ج 1 ص 59. \n3. انظر المصدر السابق ج 1 ص 60. \n4. انظر المصدر السابق ج 1 ص 137 - 139. \n5. انظر المصدر السابق ج 1 ص 324. \n6. انظر ابن ظهيرة: الفضائل الباهرة ص 62، 110، 150، 158، 159، 162، 186.",
    "book_id": "405",
    "new_page_number": 11
  },
  {
    "serial_number": "6303860",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 16,
    "volume_number": 0,
    "text": "النسخ الخطية للكتاب هذا وقد استندت في تحقيق نص ابن الكندى إلى المخطوطات الآتى ذكرها، مع مقارنتها بأهم المصادر المتعلقة بموضوع النص. 1 - نسخة كتبت بخط نسخى، بدون تاريخ، وعليها هذه العبارة منقولة عن نسخة الأصل المكتبة لكافور الإخشيدى برسم قاسم أفندى الشعرانى قاضى العسكر بمصر، وتقع في 21 ورقة. ومسطرتها 15 سطرًا، وهى محفوظة بدار الكتب المصرية، برقم 422 تاريخ، وقد رمزنا لهذه النسخة بالحرف أ. 1 - نسخة كتبت بخط نسخى، بدون تاريخ، وناقصة من آخرها ورقة، وتقع في 19 ورقة، ومسطرتها 19 سطرًا، وهى محفوظة بدار الكتب المصرية، برقم 753 تاريخ، وقد رمزنا لهذه النسخة بالحرف ب. 3 - قطعة من نسخة ميكروفيلم محفوظة بمعهد المخطوطات، وتقع في 8 ورقات، ومسطرتها 25 سطرًا، تحت رقم 874 تاريخ. عن أصلها المحفوظ بمتحف الآثار الفلسطينى بالقدس، مصورة عن نسخة بجامع أحمد باشا الجزار بعكا، وهى بقلم معتاد قديم من خطوط القرن الخامس الهجرى، كما ذكر في فهرس معهد المخطوطات بجامعة الدول العربية، وقد رمزنا لهذه النسخة بالحرف ج. وقد اخترت الاعتماد على نسخة (ج) إلى أن ينتهى ما فيها عند كلمة (القناطر) ص 41 س 6؛ لأنها أقدم النسخ. حيث نسخت في القرن الخامس الهجرى. وخاصة حين تتفق معها نسخة أخرى. ولم أكن أفارق قراءة (ج) إلا إذا اتفقت فيها النسخ الأخرى دونها.",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 12
  },
  {
    "serial_number": "6303861",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 17,
    "volume_number": 0,
    "text": "كما وضعت عناوين داخلية في متن الكتاب بين حاصرتين للتوضيح.",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 13
  },
  {
    "serial_number": "6303862",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 18,
    "volume_number": 0,
    "text": "صفحة العنوان من النسخة \"أ\" المحفوظة بدار الكتب رقم 422 تاريخ.",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 14
  },
  {
    "serial_number": "6303863",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 19,
    "volume_number": 0,
    "text": "الصفحة الأولى من النسخة \"أ\" المحفوظة بدار الكتب برقم 422 تاريخ",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 15
  },
  {
    "serial_number": "6303864",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 20,
    "volume_number": 0,
    "text": "الصفحة الأخيرة من النسخة \"أ\" المحفوظة بدار الكتب برقم 422 تاريخ",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 16
  },
  {
    "serial_number": "6303865",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 21,
    "volume_number": 0,
    "text": "الصفحة الأولى من النسخة \"ب\" المحفوظة بدار الكتب برقم 753 تاريخ",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 17
  },
  {
    "serial_number": "6303866",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 22,
    "volume_number": 0,
    "text": "آخر الموجود من النسخة \"ب\" المحفوظة بدار الكتب برقم 753 تاريخ",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 18
  },
  {
    "serial_number": "6303867",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 23,
    "volume_number": 0,
    "text": "اللوحة الأولى من النسخة \"ج\" المحفوظة بمعهد المخطوطات برقم 874 تاريخ",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 19
  },
  {
    "serial_number": "6303868",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 24,
    "volume_number": 0,
    "text": "آخر الموجود من النسخة \"ج\" المحفوظة بمعهد المخطوطات برقم 874 تاريخ",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 20
  },
  {
    "serial_number": "6303869",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: البلدان والرحلات الكتاب : فضائل مصر المحروسة المؤلف : ابن الكندي ، عمر بن محمد بن يوسف ، من علماء النصف الثاني من القرن الرابع الهجري المحقق : د علي عمر ، قسم التاريخ والحضارة الإسلامية بجامعتي المنيا والإمام محمد بن سعود بالرياض الناشر : مكتبة الخانجي - القاهرة الطبعة : الأولى ، 1417 هـ - 1997 م ( وقد نشره المحقق أول مرة في مطبعة الاستقلال ، القاهرة 1391 هـ - 1971 م ) عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nالكتاب : فضائل مصر المحروسة المؤلف : ابن الكندي ، عمر بن محمد بن يوسف ، من علماء النصف الثاني من القرن الرابع الهجري المحقق : د علي عمر ، قسم التاريخ والحضارة الإسلامية بجامعتي المنيا والإمام محمد بن سعود بالرياض الناشر : مكتبة الخانجي - القاهرة الطبعة : الأولى ، 1417 هـ - 1997 م ( وقد نشره المحقق أول مرة في مطبعة الاستقلال ، القاهرة 1391 هـ - 1971 م ) عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nالمؤلف : ابن الكندي ، عمر بن محمد بن يوسف ، من علماء النصف الثاني من القرن الرابع الهجري المحقق : د علي عمر ، قسم التاريخ والحضارة الإسلامية بجامعتي المنيا والإمام محمد بن سعود بالرياض الناشر : مكتبة الخانجي - القاهرة الطبعة : الأولى ، 1417 هـ - 1997 م ( وقد نشره المحقق أول مرة في مطبعة الاستقلال ، القاهرة 1391 هـ - 1971 م ) عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nالمحقق : د علي عمر ، قسم التاريخ والحضارة الإسلامية بجامعتي المنيا والإمام محمد بن سعود بالرياض الناشر : مكتبة الخانجي - القاهرة الطبعة : الأولى ، 1417 هـ - 1997 م ( وقد نشره المحقق أول مرة في مطبعة الاستقلال ، القاهرة 1391 هـ - 1971 م ) عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nالناشر : مكتبة الخانجي - القاهرة الطبعة : الأولى ، 1417 هـ - 1997 م ( وقد نشره المحقق أول مرة في مطبعة الاستقلال ، القاهرة 1391 هـ - 1971 م ) عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nالطبعة : الأولى ، 1417 هـ - 1997 م ( وقد نشره المحقق أول مرة في مطبعة الاستقلال ، القاهرة 1391 هـ - 1971 م ) عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\n( وقد نشره المحقق أول مرة في مطبعة الاستقلال ، القاهرة 1391 هـ - 1971 م ) عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nعدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\n[ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nتاريخ النشر بالشاملة : 8 ذو الحجة 1431",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 21
  },
  {
    "serial_number": "6303870",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 1,
    "volume_number": 1,
    "text": "فضائل مصر المحروسة لابن الكندي، عمر بن محمد بن يوسف من علماء النصف الثاني من القرن الرابع الهجري",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 22
  },
  {
    "serial_number": "6303871",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 2,
    "volume_number": 1,
    "text": "كتاب فضائل مصر المحروسة نقل من نسخة الأصل المكتتبة لكافور الإخشيدي رحمه الله، برسم سيدنا ومولانا فخر قضاة الإسلام كمال ولاة الأنام معدن الفضل والفضائل والإكرام. مولانا قاسم أفندي الشعراني القاضي العسكري بمصر حالا، دامت سعادته بمحمد وآله.",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 23
  },
  {
    "serial_number": "6303872",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 3,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرحيم وبالله التوفيق والإعانة أخبرنا أبو محمد عبد الرحمن بن عمر بن محمد المعدل المعروف بابن النحاس (1) أخبرنا عمر بن أبي عمر محمد بن يوسف بن يعقوب الكندي المصري رحمه الله، قال: هذا كتاب أمر بجمعه وحضَّ على تأليفه أبو المسك كافور (2) ، يذكر فيه مصر وما خصها الله به من الفضل والبركات والخيرات، على سائر البلدان، فزاد الله الأستاذ رغبة في العلم، ولأهله محبة، وعليه مثابرة وشهوة، فمثله رغب في مثله، وحث على جمعه. إذ كان أردشير زمانه في السياسة والعمارة، وواحد دهره في عدله ورأفته، ورفقه برعيته، فلا أزال الله عنا ظله، وأمتعنا ببقائه، ودوام أيامه، وجعل ما خصه به من الفضل في دنياه، موصولا بأخراه. فجمعت ما أمر به من كتب شيوخ المصريين وغيرهم من أهل العلم والخبرة، والبحث والذكاء والفطنة، والتفتيش والرحلة والطلب.",
    "foot_note": "1. ولد سنة 323 هـ. وسمع بمصر أبا الطاهر أحمد بن محمد بن عمرو المدينى، والحافظ أبا سعيد بن يونس الصدفى وغيرهما. حدث عنه القاضي محمد بن سلامة القضاعى وغيره. توفى سنة 416 هـ. (الذهبي: سير أعلام النبلاء، 7/ 313). \n2. ذكره الذهبي في تاريخه في وفيات سنة 357 هـ بقوله: كافور الخادم الأسود الحبشى الأستاذ أبو المسك الإخشيدى السلطان اشتراه الإخشيدى من بعض رؤساء المصريين، ثم إنه تقدم عند الإخشيد صاحب مصر لعقله ورأيه إلى أن كان من كبار قواده، ثم استقل بأمر مصر سنة 355 هـ، وكان كافور يُدْني الشعراء ويُجيزهم، وكان يُقرأ عنده كل ليلة السِّيَر وأخبار الدولة الأموية والعباسية، توفى سنة 357 هـ. (الذهبي: تاريخ الإسلام وفيات سنة 357 هـ).",
    "book_id": "405",
    "new_page_number": 24
  },
  {
    "serial_number": "6303873",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 4,
    "volume_number": 1,
    "text": "فمن مشهوريهم: يَزيد بن أبي حَبِيب (1) ، وعبيد الله بن أبي جعفر (2) . وبعدهما: الليث بن سعد (3) ، وعبد الله بن لَهِيعة (4) . وبعدهما: سعيد بن كثير بن عفير (5) ، وعثمان بن صالح السهمي (6) .",
    "foot_note": "1. يزيد بن أبي حبيب (ت 128 هـ) أول من أظهر بمصر علم المسائل في الحلال والحرام وكانوا قبل ذلك يتحدثون في الترغيب والملاحم والفتن، ويعد ابن أبي حبيب من أقدم من ألف في تاريخ مصر الإسلامية، وقد وضعه ابن زولاق - من مؤرخى القرن الرابع الهجرى - في قمة مؤرخى مصر الإسلامية. (المزى: تهذيب الكمال 2/ 105، وابن زولاق: مختصر تاريخ مصر، ورقة 10). \n2. عبيد الله بن أبي جعفر (ت 135 هـ) أحد المؤرخين الأوئل في مصر الإسلامية، ويعد مثل معاصره يزيد بن أبي حبيب في هذا الشأن. ويعتبر كتابه في تاريخ مصر أحد مصادر ابن عبد الحكم وأبي عمر الكندى (ابن عبد الحكم: فتوح مصر ص 55، 86، أبو عمر الكندى: الولاة والقضاة ص 6، 312، 317، 333). \n3. الليث بن سعد (ت 175 هـ) ويعتبر كتابه في تاريخ مصر أهم ما قدمه لمدرسة مصر الإسلامية، وقد أشار إليه ابن النديم، كما ذكر أبو عمر الكندى كتاب الليث في التاريخ في كتابيه الولاة والقضاة وأفاد منه (ابن النديم: الفهرست 252، والكندى: الولاة والقضاة ص 11،10،8). \n4. عبد الله بن لهيعة (ت 174 هـ) أحد مشاهير علماء مصر في القرن الثاني الهجرى. أسند إليه مؤرخو مصر حتى السيوطى كثيرًا من الأخبار عن تاريخ مصر الإسلامية في عهدها المبكر (ابن زولاق: مختصر تاريخ مصر ورقة 10، الكندى الولاة والقضاة 6، 213، 333، ابن تغرى بردى: النجوم الزاهرة 1/ 19 - 20). \n5. سعيد بن عفير (ت 226 هـ) ظل لفترات طويلة تجاوزت عصره من أبرز وجوه مصر الفكرية لدى مؤرخى مصر، فقد قال عنه المؤرخ المصرى ابن يونس المتوفى سنة 347 هـ \"كان أعلم الناس بالأنساب والأخبار الماضية وأيام العرب والتواريخ\" أما السيوطى فقد وضعه في قمة مؤرخى مصر الإسلامية، على أن أهم ما قدمه ابن عفير لمدرسة مصر أنه كتب كتابا في تاريخ مصر، كان فيما بعد أحد مصادر ابن عبد الحكم في كتابه فتوح مصر (ابن عبد الحكم: فتوح مصر ص 19، 20، 58، 66 وغيرها، الذهبي: سير أعلام النبلاء 10/ 584، والسيوطى: حسن المحاضرة 1/ 553). \n6. عثمان بن صالح (ت 219 هـ) كان مولعا بمعرفة الأخبار التاريخية وروايتها، كما أن اسمه يظهر كمصدر للمعلومات عن تاريخ مصر القديم، وكذلك فيما يتعلق بأحداث الفتح الإسلامي لها، كما ساهم في تزويد مدرسة مصر بالمعلومات الإفريقية (ابن عبد الحكم: فتوح مصر ص 9، 18،12، 19، 55، 185).",
    "book_id": "405",
    "new_page_number": 25
  },
  {
    "serial_number": "6303874",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 5,
    "volume_number": 1,
    "text": "وبعدهما: خلف بن ربيعة (1) ، وعبد الرحمن بن مَيْسَرة (2) ، وأحمد بن يحيى بن الوزير (3) ، وأبو خيثمة علي بن عمرو بن خالد (4) . وبعد هذه الطبقة: يحيى بن عثمان بن صالح (5) ، وعبيد الله بن سعيد بن كثير بن عفير (6) . وبعدهما: علي بن الحسن بن خلف بن قديد (7) ، ومحمد بن الربيع",
    "foot_note": "1. خلف بن ربيعة (ت 262 هـ) كان عالما بأخبار مصر، ويضعه ابن زولاق في مشاهير مؤرخى مصر الإسلامية في القرن الثالت الهجرى (ابن زولاق: مختصر تاريخ مصر، ورقة 11، وابن الجوزى: المنتظم 12/ 175). \n2. عبد الرحمن بن ميسرة (ت 188 هـ) من كبار علماء المصريين في القرن الثالث الهجرى، تتلمذ عليه من مؤرخى مصر وعلمائها سعيد بن عفير. ويحيى بن بكير وغيرهما (المزى: تهذيب الكمال 17/ 451، الذهبي: تاريخ الإسلام وفيات سنة 188 هـ). \n3. أحمد بن يحيى (ت 250 هـ) كان عالما بالأخبار وأيام الناس، ويضعه ابن زولاق في مؤرخى مصر المرموقين (ابن زولاق: مختصر تاريخ مصر ورقة 11، المزى: تهذيب الكمال 1/ 6519). \n4. أبو خيثمة على بن عمرو (ت 229 هـ) أفاد الكندى من كتابه في تاريخ مصر في كتاباته عن الولاة الذين حكموا مصر منذ الفتح الإسلامي حتى عصره، وكذلك قضاة مصر في هذه الفترة (الكندى: الولاة والقضاة ص 50، 336، 445، 451). \n5. يحيى بن عثمان (ت 282 هـ) كان عالما بأخبار مصر وبموت العلماء، وجعله ابن زولاق من الشيوخ البارزين بمدرسة التاريخ في مصر. ويعتبر كتابه في تاريخ مصر أحد مصادر ابن قديد الذي أفاد من نسخة منه بخط المؤلف. (الكندى: الولاة والقضاة ص 439، وابن زولاق: مختصر تاريخ مصر، ورقة 11، الذهبي: سير أعلام النبلاء 13/ 355). \n6. عبيد الله بن سعيد (ت 273 هـ) من أبناء البيوتات العلمية بمصر، وقد أثنى على علمهم القاضي عياض حين تناول ترجمة أبيه بقوله: \"وبقى العلم في بيته زمنا طويلا\" وتجلى ذلك في الأخبار التي حفل بها كتاب الولاة والقضاة للكندى نقلًا عن عبيد الله بن سعيد. (الكندى: الولاة والقضاة ص 412، 417، 324، عياض: ترتيب المدارك 1/ 454). \n7. ابن قديد (ت 312 هـ) وضع كتابا عن مصر أفاد منه الكندى في كتابيه الولاة والقضاة، كما اقتبس منه ياقوت في معجم البلدان، والذهبى في تذكرة الحفاظ، وابن حجر في رفع الإصر. (الكندى: الولاة والقضاة ص 7، 19، 12، 13، ياقوت مادة الفرما) الذهبي: تذكرة الحفاظ ص 458، ابن حجر: رفع الإصر ص 305).",
    "book_id": "405",
    "new_page_number": 26
  },
  {
    "serial_number": "6303875",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 6,
    "volume_number": 1,
    "text": "ابن سليمان الجيزي (1) . وبعدهما: أبو عمر محمد بن يوسف بن يعقوب الكندي (2) ، وأبو سعيد عبد الرحمن بن أحمد بن يونس بن عبد الأعلى (3) فأعلمت نفسي فيما تأدى إلى من الأخبار لمن ذكرتهم ورواياتهم، وألفته واختصرت المتون، وأسقطت الأسانيد؛ لتتسق أخباره، ويسهل استماعه، وتقرب فائدته، على اسم الله وعونه والصلاة على نبينا محمد وعلى آله.  [فضل مصر على غيرها] فأقول: فضل الله مصر على سائر البلدان، كما فضل بعض الناس على بعض والأيام والليالي بعضها على بعض. والفضل على ضربين: في دين أو دنيا، أو فيهما جميعا، وقد فضل الله مصر وشهد لها في كتابه بالكرم وعظم المنزلة وذكرها باسمها وخصها دون غيرها، وكرر ذكرها، وأبان فضلها في آيات من القرآن العظيم، تنبئ عن مصر وأحوالها، وأحوال الأنبياء بها، والأمم الخالية والملوك الماضية، والآيات البينات، يشهد لها بذلك القرآن، وكفى به شهيدًا، ومع ذلك روى عن النبي صلى الله عليه وسلم في مصر وفي عجمها (4) خاصة وذكره لقرابته (ورحمهم) (5) ومباركته عليهم وعلى بلدهم (6) وحثه على برهم",
    "foot_note": "1. محمد بن الربيع (ت 324 هـ) أفاد من كتبه في تاريخ مصر الكندى في كتابه القضاة، وابن حجر في رفع الإصر والسيوطى في حسن المحاضرة (الكندى ص 313، 428، وابن حجر: رفع الإصر 135، والسيوطى، حسن المحاضرة 1/ 166). \n2. محمد بن يوسف أبو عمر الكندى والد المصنف (ت 350 هـ) كان من أعلم الناس بالبلد وأهله وأعماله وثغوره، وله مصنفات فيه وفى غيره من صنوف الأخبار والأنساب وكان من جلة أهل العلم بالحديث والنسب (المقريزى: المقفى 7/ 489). \n3. أبو سعيد بن يونس (ت 347 هـ) أحد المؤرخين المصريين القدامى، اشتهر بأنه كان خبيرا بأيام الناس وتواريخهم. وقد كتب ابن يونس مؤلفين تاريخيين حول مصر: الأول خصصه لشخصيات أثرت في تاريخ بلده - مصر. والثانى وهو أقل حجما ويدور حول الغرباء الذين لم يولدوا بمصر ولكن أقاموا فيها ردحًا من الزمن (ابن خلكان: وفيات الأعيان 3/ 173). \n4. في: أ \"عجائبها\"، والمثبت من: ب، ج. \n5. ما بين القوسين ساقط من: أ، وهو في: ب، ج. \n6. أ \"ومباركته عليهم وعلى بلدتهم\"، ب \"ومباركته لهم ولبلدهم\" والمثبت من: ج.",
    "book_id": "405",
    "new_page_number": 27
  },
  {
    "serial_number": "6303876",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 7,
    "volume_number": 1,
    "text": "ما لم يرو عنه في قوم من العجم غيرهم، وسنذكر ذلك إن شاء الله في موضعه مع ما خصها الله به من الخصب والفضل وما أنزل فيها من البركات وأخرج منها من الأنبياء والعلماء والحكماء والخواص والملوك والعجائب بما لم يخصص الله به بلدًا غيرها، ولا أرضا سواها، فإن ثرب (1) علينا مثرب بذكر الحرمين، أو شنع مشنع، فللحرمين فضلهما الذي لا يدفع، وما خصهما الله به مما لا ينكر من موضع بيته الحرام، وقبر نبيه عليه الصلاة والسلام، وليس ما فضلهما الله به بباخس فضل مصر ولا بناقص منزلتها، وإن منافعها في الحرمين لبينة لأنها تميرهما (2) بطعامها وخصبها وكسوتها وسائر مرافقها، فلها بذلك فضل كبير، ومع ذلك فإنها تطعم أهل الدنيا ممن يرد إليها من الحاج طول مقامهم يأكلون ويتزودون من طعامها من أقصى جنوب الأرض وشمالها ممن كان من (المسلمين) (3) في بلاد الهند والأندلس وما بينهما، لا ينكر هذا منكر، ولا يدفعه دافع، وكفى بذلك فضلا وبركة في دين ودنيا.  [ذكر ما ورد في فضل مصر] فأما ما ذكره الله عز وجل في كتابه مما اختصرناه (4) من ذكر مصر. فقول الله تعالى: {وَأَوْحَيْنَا إِلَى مُوسَى وَأَخِيهِ أَنْ تَبَوَّآ لِقَوْمِكُمَا بِمِصْرَ بُيُوتًا وَاجْعَلُوا بُيُوتَكُمْ قِبْلَةً} [يونس: 87] وما ذكره الله عز وجل حكاية عن قول يوسف: {ادْخُلُوا مِصْرَ إِنْ شَاءَ اللَّهُ آمِنِينَ} [يوسف: 99] وقال عز وجل: {اهْبِطُوا مِصْرًا فَإِنَّ لَكُمْ مَا سَأَلْتُمْ} [البقرة: 61]",
    "foot_note": "1. ثرب عليه: لامه، والمثرب بتشديد الراء: المخلط المفسد، القاموس: ثرب. \n2. ج \"تميرها\" والميرة: جلب الطعام. \n3. ساقط من: ب، وهو في: أ، ج. \n4. في: أ \"مما اخترناه\". والمثبت في: ب، ج.",
    "book_id": "405",
    "new_page_number": 28
  },
  {
    "serial_number": "6303877",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 8,
    "volume_number": 1,
    "text": "وقال تعالى: {وَجَعَلْنَا ابْنَ مَرْيَمَ وَأُمَّهُ آيَةً وَآوَيْنَاهُمَا إِلَى رَبْوَةٍ ذَاتِ قَرَارٍ وَمَعِينٍ} (1) [المؤمنون: 50] قال بعض المفسرين: هي مصر. وقال بعض علماء مصر: هي البهنسا. وقبط مصر مجمعون على أن المسيح عيسى بن مريم وأمه عليهما السلام كانا بالبهنسا وانتقلا عنها إلى القدس. وقال بعض المفسرين: الربوة دمشق، والله أعلم. وقال تعالى: {وَقَالَ الَّذِي اشْتَرَاهُ مِنْ مِصْرَ لِامْرَأَتِهِ أَكْرِمِي مَثْوَاهُ} [يوسف: 21]. وقال تعالى: {وَقَالَ نِسْوَةٌ فِي الْمَدِينَةِ امْرَأَتُ الْعَزِيزِ تُرَاوِدُ فَتَاهَا عَنْ نَفْسِهِ} [يوسف: 30] والمدينة: منف، والعزيز ملك مصر حينئذ. وقال تعالى: {وَدَخَلَ الْمَدِينَةَ عَلَى حِينِ غَفْلَةٍ مِنْ أَهْلِهَا} [القصص: 15] هي منف، مدينة فرعون. وقال تعالى: {وَجَاءَ رَجُلٌ مِنْ أَقْصَى الْمَدِينَةِ يَسْعَى} [القصص: 20] هي منف أيضًا. وقال تعالى حكاية عن إخوة يوسف: {يَا أَيُّهَا الْعَزِيزُ} [يوسف: 78] وقال تعالى حكاية عن يوسف عليه السلام: {وَقَدْ أَحْسَنَ بِي إِذْ أَخْرَجَنِي مِنَ السِّجْنِ وَجَاءَ بِكُمْ مِنَ الْبَدْوِ} [يوسف: 100] فجعل الشام بدوا، وقال تعالى حكاية عن فرعون وافتخاره بمصر: {أَلَيْسَ لِي مُلْكُ مِصْرَ وَهَذِهِ الْأَنْهَارُ تَجْرِي مِنْ تَحْتِي} [الزخرف: 51]",
    "foot_note": "1. الربوة ما ارتفع من الأرض.",
    "book_id": "405",
    "new_page_number": 29
  },
  {
    "serial_number": "6303878",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 9,
    "volume_number": 1,
    "text": "وقال تعالى حين وصف مصر وما كان فيه آل فرعون من النعمة والملك بما لم يصف به مشرقا ولا مغربا، ولا سهلا ولا جبلا، (ولا برا ولا بحرا (1) ): {كَمْ تَرَكُوا مِنْ جَنَّاتٍ وَعُيُونٍ (25) وَزُرُوعٍ وَمَقَامٍ كَرِيمٍ (26) وَنَعْمَةٍ كَانُوا فِيهَا فَاكِهِينَ (27)} [الدخان: 25 - 27] فهل يعلم أن بلداً من البلدان في جميع أقطار الأرض أثنى عليه الكتاب بمثل هذا الثناء، أو وصفه بمثل هذا الوصف، أو شهد له بالكرم غير مصر؟ وروى عن النبي صلى الله عليه وسلم أنه قال: \"ستفتح عليكم بعدي مصر فاستوصوا بقبطها خيرًا، فإن لكم منهم صهرًا وذمة\" (2) . وروى أبو ذر عن النبي صلى الله عليه وسلم أنه قال: \"ستفتحون أرضا يذكر فيها القيراط فاستوصوا بأهلها خيرا، فإن لهم ذمة ورحما\" (3) . فأما الرحم، فإن هاجر أم إسماعيل بن إبراهيم الخليل عليهما السلام من القبط من قرية نحو الفَرَما يقال لها: أم العرب (4) .",
    "foot_note": "1. ساقط من: أ، ج، وهو في ب. \n2. رواه مسلم في صحيحه مع زيادة في اللفظ، كتاب فضائل الصحابة، باب وصية النبي صلى الله عليه وسلم بأهل مصر (صحيح مسلم 4/ 1970). \n3. اندثرت هذه المدينة، وتعرف اليوم آثارها بتل الفرما، على بعد ثلاثة كيلومترات من ساحل البحر الأبيض المتوسط (القاموس الجغرافي، ق 1 ص 9). \n4. صيغت هذه العبارة في المصادر الأخرى بصيغ مختلفة فقد ذكرت في طبقات ابن سعد 1/ 23 \"هاجر أم إسماعيل من القبط من قرية نحو الفرما يقال لها أم العرب، وفى فتوح مصر ص 4. طبعة تورى \"أن أم إسماعيل هاجر من أم العرب قرية كانت أمام الفرما من مصر\" وبهامشها أن رواية نسخة ب \"أنّ أم إسماعيل هاجر أم العرب من قرية أمام الفرما من مصر\" وفى نسخة الحرم المكى من فتوح مصر \"أن أم إسماعيل هاجر من أم العرب قرية كانت أمام الفرما من مصر\" مع ضبط كلمة \"قرية\" ضبط قلم بكسرتين تحت التاء المربوطة. وفى ياقوت \"أم إسماعيل هاجر من أم العرب: قرية كانت أمام الفرما من أرض مصر\" وفى التبيين في أنساب القرشيين ص 86 \"هاجر أم إسماعيل أم العرب من قرية كانت أمام الفرما\". وفى خطط المقريزى 1/ 25 \"أن أم إسماعيل هاجر من أم العرب قرية كانت أمام الفرما من مصر، وفى حسن المحاضرة طبعة أبو الفضل 1/ 13 \"أن أم إسماعيل هاجر أم العرب من قرية كانت من أمام الفرما من مصر، وفي ورقة 3 من مخطوطة حسن المحاضرة عن مكتبة الزاوية الحمزاوية \"أن أم إسماعيل هاجر من أم العرب قرية كانت أمام الفرما من مصر\".",
    "book_id": "405",
    "new_page_number": 30
  },
  {
    "serial_number": "6303879",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 10,
    "volume_number": 1,
    "text": "وأما الذمة: فإن النبي صلى الله عليه وسلم، تسرى من القبط مارية أم إبراهيم ابن رسول الله صلى الله عليه وسلم، وهي من قرية نحو الصعيد، يقال لها \"حَفْن\" (1) من كورة (2) \"أنصنا\" (3) . فالعرب والمسلمون كافة لهم نسب بمصر من جهة أمهم مارية أم إبراهيم ابن رسول الله صلى الله عليه وسلم؛ لأن أزواج النبي صلى الله عليه وسلم أمهات المؤمنين، والقبط أخوالهم. وصارت العرب كافة من مصر، بأمهم هاجر؛ لأنها أم إسماعيل صلى الله عليه وسلم، وهو أبو العرب. وروى عن النبي صلى الله عليه وسلم أنه قال: \"ستكونون أجنادًا، وخير أجنادكم الجند الغربي، فاتقوا الله في القبط: لا تأكلوهم أكل الخُضَر\" (4) .",
    "foot_note": "1. حفن: قرية من كورة أنصنا بصعيد مصر (ياقوت) وفى القاموس الجغرافى القسم الأول ص 229 \"أن هذه القرية قد اندثرت ولا يزال توجد آثارها بحوض الكوم الأخضر رقم 19، بأراضى ناحية المطاهرة البحرية بمركز المنيا\". \n2. الكورة تشمل عددا من القرى، ويقابلها المركز: في النظام الإدارى المصرى الحاضر. \n3. أنصنا: مدينة أزلية من نواحى الصعيد شرقى النيل، وفى أوائل القرن الثالث عشر للهجرة قيد زمامها باسم الشيخ عبادة، ومكانها اليوم الأطلال الواقعة شرقي النيل بمركز ملوى، بمحافظة المنيا (ياقوت)، (القاموس الجغرافى القسم الأول ص 132). \n4. لم أهتد إلى تخريجه فيما بين يدى من مصادر، وقد أورده ابن عبد الحكم في فتوح مصر ص 3. والمقريزى في الخطط جـ 1 ص 25. والسيوطى في حسن المحاضرة جـ 1 ص 12، مع اختلاف في اللفظ. والمراد بالجند الغربي: جند مصر. والخضر: النبات الغضّ. هذا وقد اختلفت المصادر بخصوص لفظة \"الخضر\" حيث وردت في فتوح مصر لابن عبد الحكم ص 3 طبعة تورى مضبوطة بالشكل بفتح الحاء المهملة وكسر الضاد المعجمة. وكذا في حسن المحاضرة جـ 1 ص 12 بتحقيق الأستاذ أبو الفضل. وضبطها بالشكل هكذا أيضا. وكذا ضبطها نفس الضبط الأستاذ عبد المنعم عامر في طبعته لفتوح مصر. وفسرها كل منهما في الهامش بقولها \"الحضر: هو الذي يتحين طعام الناس حتى يحضره\". وقد علق الدكتور حسين نصار في مجلة المجلة عدد 80 ص 101 على ما ذهب إليه الأستاذ عبد المنعم عامر بقوله \"كذلك وقع تصحيف في المتن في مواضع متعددة منها: جاء في ص 4 س 5 في الوصية بالقبط: لا تأكلوهم أكل الحضر - وفسر المحقق الحضر بأنه الذي يتحين طعام الناس حتى يحضره. ثم قال الدكتور نصار: وأرجح أن الصواب: لا تأكلوهم أكل الخُضَر - أي \"النبات =",
    "book_id": "405",
    "new_page_number": 31
  },
  {
    "serial_number": "6303880",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 11,
    "volume_number": 1,
    "text": "وروى عن عمر عن النبي صلى الله عليه وسلم أنه قال: \"إذا فتح الله عليكم مصر فاتخذوا فيها جندا كثيفًا؛ فذلك الجند خير أجناد الأرض\". قال أبو بكر رضي الله عنه: ولم ذلك يا رسول؟ قال: \" لأنهم في رباط إلى يوم القيامة \" (1) .  [دعاء الأنبياء لمصر وأهلها] وكتب رسول الله صلى الله عليه وسلم إلى جماعة من الملوك (منهم (2) ) هرقل، فما أجابه أحد منهم، وكتب إلى المقوقس صاحب مصر فأجابه عن كتابه جوابًا جميلًا، وأهدى إليه ثيابًا وكراعًا (3) وجارتين من القبط؛ مارية وأختها (وأهدى إليه عسلا فقبل هديته، وتسرى مارية، فأولدها ابنة إبراهيم، وأهدى أختها لحسان ابن ثابت فأولدها عبد الرحمن بن حسان) (4) . وسأل عليه الصلاة والسلام عن العسل (الذي) (5) أهدى إليه، فقال من أين هذا (6) ؟ فقيل (له) (7) من قرية بمصر يقال لها \"بنها\"، فقال: \"اللهم بارك في بنها وفي عسلها\" (8) فعسلها إلى يومنا هذا خير عسل مصر.",
    "foot_note": "1. = الغض، وهو كما قال، حيث توجد هذه الرواية \"الخُضَر\" في إحدى النسخ التي اعتمدت عليها طبعة تورى. كذلك توجد هذه اللفظة \"الخُضَر\" مضبوطة ضبط قلم هكذا في مخطوطة الحرم المكى من فتوح مصر لابن عبد الحكم ورقة 3. وبنفس الضبط \"ضم الخاء المعجمة وفتح الضاد المعجمة\" ص 4 من مخطوطة حسن المحاضرة عن مكتبة الزاوية الحمزاوية كذلك وردت لفظه \"الخضر\" أيضا بمعجمتين في الخطط جـ 1 ص 25. \n1. أورده صاحب الكنز برقم 38262 من رواية عمر بن الخطاب. \n2. ساقط من: ب، وهو في: أ، ج. \n3. الكراع: اسم يجمع الخيل. والكراع السلاح، وقيل: هو اسم يجمع الخيل والسلاح (اللسان: كرع). \n4. ما بين القوسين ساقط من: ب، وهو في أ، ج. \n5. ساقط من: ب، وهو في: أ، ج. \n6. ساقط من: ب، وهو في: أ. \n7. ساقط من: ب، ج. وهو في أ. \n8. لم أهتد إلى تخريجه فيما بين يدى من مصادر الحديث، وأشار إليه السيوطى في حسن المحاضرة 1/ 14 بقوله: \"مرسل حسن الإسناد\".",
    "book_id": "405",
    "new_page_number": 32
  },
  {
    "serial_number": "6303881",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 12,
    "volume_number": 1,
    "text": "وروى عن عبد الله بن عباس أنه قال: دعا نوح عليه السلام ربه، لولده وولد ولده: مصر بن بيصر بن حام بن نوح، وبه سميت مصر، وهو أبو القيط فقال: اللهم بارك فيه وفي ذريته وأسكنه الأرض المباركة التي هي أُمُّ البلاد وغوث العباد، ونهرها أفضل أنهار الدنيا واجعل فيها أفضل البركات، وسخر له ولولده الروض، وذللها لهم، وقوهم عليها (1) . والكعبة: البيت الحرام، وهو بيت هاجر وابنها إسماعيل عليهما السلام اللذين كانا يسكنانه، وروى أن البيت هدم في الجاهلية فولت قريش بناءه رجلا من القبط يقال له: بقوم، فأدركه الإسلام وهو على ذلك البناء.  [من صاهر القبط من الأنبياء] وصاهر القبط من الأنبياء إبراهيم الخليل عليه السلام، بتسريه هاجر أم إسماعيل عليهما السلام. ويوسف بتزوجه بنت صاحب عين شمس التي ذكرها الله في كتابه، فقال تعالى: {وَغَلَّقَتِ الْأَبْوَابَ وَقَالَتْ هَيْتَ لَكَ} [يوسف: 23] ومحمد صلى الله عليه وسلم بتسريه مارية.  [من ذكرهم الله تعالى في كتابه من أهل مصر] وممن ذكرهم الله تعالى في كتابه من أهل مصر، رجل مؤمن من آل فرعون يكتم إيمانه. قال تعالى: {وَقَالَ رَجُلٌ مُؤْمِنٌ مِنْ آلِ فِرْعَوْنَ يَكْتُمُ إِيمَانَهُ أَتَقْتُلُونَ رَجُلًا أَنْ يَقُولَ رَبِّيَ اللَّهُ وَقَدْ جَاءَكُمْ بِالْبَيِّنَاتِ مِنْ رَبِّكُمْ} [غافر: 28]. ومنهم قارون، وكان ابن عم موسى: قال الله تعالى: {وَآتَيْنَاهُ مِنَ الْكُنُوزِ مَا إِنَّ مَفَاتِحَهُ لَتَنُوءُ بِالْعُصْبَةِ أُولِي الْقُوَّةِ} [القصص: 76]. وقال عز وجل: {فَخَرَجَ عَلَى قَوْمِهِ فِي زِينَتِهِ} [القصص: 79].",
    "foot_note": "1. ذكر ذلك المقريزى في: الخطط 1/ 27، وابن ظهيرة في محاسن مصر والقاهرة 78، والقلقشندى في صبح الأعشى 3/ 313، والنويرى في نهاية الأرب 1/ 347.",
    "book_id": "405",
    "new_page_number": 33
  },
  {
    "serial_number": "6303882",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 13,
    "volume_number": 1,
    "text": "وكان قارون أيسر أهل الدنيا. ومنهم: هامان، قال تعالى: {وَقَالَ فِرْعَوْنُ يَا أَيُّهَا الْمَلَأُ مَا عَلِمْتُ لَكُمْ مِنْ إِلَهٍ غَيْرِي فَأَوْقِدْ لِي يَا هَامَانُ عَلَى الطِّينِ فَاجْعَلْ لِي صَرْحًا} [القصص: 38]. ومنهم فيما يقال: الخضر عليه السلام، وروى بعض أهل العلم أنه ابن فرعون موسى لصلبه، وكان آمن بموسى، وجاز البحر معه، وكان مقدما عنده، وكان نبيًا. ومنهم: وزراء فرعون وجلساؤه، ذكر الله تعالى عنهم في كتابه حسن المحضر ورجاحة العقل، قال تعالى حكاية عن فرعون: {قَالَ لِلْمَلَإِ حَوْلَهُ إِنَّ هَذَا لَسَاحِرٌ عَلِيمٌ (34) يُرِيدُ أَنْ يُخْرِجَكُمْ مِنْ أَرْضِكُمْ بِسِحْرِهِ فَمَاذَا تَأْمُرُونَ (35) قَالُوا أَرْجِهْ وَأَخَاهُ وَابْعَثْ فِي الْمَدَائِنِ حَاشِرِينَ (36) يَأْتُوكَ بِكُلِّ سَحَّارٍ عَلِيمٍ} [الشعراء: 34 - 37]. فهل في الدنيا (جلساء) (1) ملك أرجح عقلا واحسن (محضرا) (2) منهم؟ حيث أنصفوا، وأمروا أن يمتحن بمثل ما وقع لهم أنه يشبه ما جاء به، ولم يكونوا في المنزلة وقبح المحضر كوزراء نمرود، حين شاورهم في إبراهيم عليه السلام. قال تعالى حكاية عنهم: {قَالُوا حَرِّقُوهُ وَانْصُرُوا آلِهَتَكُمْ إِنْ كُنْتُمْ فَاعِلِينَ} [الأنبياء: 68]. ذكر الله عز وجل ذلك عنهم في كتابه العزيز. ومنهم: السحرة الذين تجمعوا لموسى حين رأوا آيات موسى لم يصروا على الكفر، ولم يلبثوا أن آمنوا وسجدوا لله عز وجل.",
    "foot_note": "1. ساقط من: ب، وهو في: أ، ج. \n2. في: أ \"منظرا\" والمثبت في: ب، ج.",
    "book_id": "405",
    "new_page_number": 34
  },
  {
    "serial_number": "6303883",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 14,
    "volume_number": 1,
    "text": "قال تعالى في كتابه: {فَأُلْقِيَ السَّحَرَةُ سَاجِدِينَ (46) قَالُوا آمَنَّا بِرَبِّ الْعَالَمِينَ (47) رَبِّ مُوسَى وَهَارُونَ} [الشعراء: 46 - 48] وفي آيات كثيرة كرر ذكرهم وأثنى عليهم. {فَاقْضِ مَا أَنْتَ قَاضٍ إِنَّمَا تَقْضِي هَذِهِ الْحَيَاةَ الدُّنْيَا} [طه: 72]. وروى ابن لهيعة عن عبد الله بن هُبيرة السَّبَئِي، وبكر بن عمر والخولاني، ويزيد بن أبي حبيب، قالوا: كان عدد السحرة اثنى عشر ساحرًا تحت يدي كل ساحر منهم عشرون عريفًا. تحت يدي كل عريف منهم ألف من السحرة فكان جميع السحرة مائتي ألف وأربعين ألفا ومائتين واثنين وخمسين إنسانا بالرؤساء والعرفاء (1) . وأجمعت الرواة على أنه لا يعلم جماعة أسلمت في ساعة واحدة أكثر من جماعة القبط، وروى أنه لم يفتتن رجل واحد منهم كما افتتن بنو إسرائيل بعبادة العجل. وروى أن عبد الله بن عمر وقال: القبط أكرم الأعاجم محتدًا، وأسمحهم يدًا، وأفضلهم عنصرًا، وأقربهم رحمًا بالعرب كافة، وبقريش خاصة. وروى أبو هريرة أن رسول الله صلى الله عليه وسلم قال: \"مصر أطيب الأرضين ترابًا، وعجمها أكرم العجم أنسابًا\" (2) . وقال (بعض) (3) أهل العلم: لم يبق من العجم أمة إلا وقد اختلطت بغيرها إلا قبط مصر. وروى عن النبي صلى الله عليه وسلم أنه قال حين مات ابنه إبراهيم: \" لو عاش كان صديقا نبيًا، وإن له لمرضعتين في الجنة، ولو عاش لعتقت القبط وما استرق أحد منهم أبدا \" (4) .",
    "foot_note": "1. المراد بالعدد الكثرة. \n2. الحديث موضوع، وانظر: تذكرة الموضوعات 119. \n3. ساقط من: ب، وهو في: أ، ج. \n4. الحديث متروك وأخرجه ابن ماجة برقم 1510 و 1511 وذكر أن في إسناده إبراهيم بن عثمان أبو شيبة، قال عنه أحمد: منكر الحديث، وقال النسائي: متروك الحديث. وأورده السيوطى في الجامع الصغير 2/ 130 ورمز له بالضعف.",
    "book_id": "405",
    "new_page_number": 35
  },
  {
    "serial_number": "6303884",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 15,
    "volume_number": 1,
    "text": "[ذكر من أظهرته مصر من الحكماء] منهم: (نيروز) (1) أبو بختنصر من أهل قرية يقال لها: سيسرو من كورة \"أرمنت\" (2) وكان رجلا من أهل العلم فنظر في علمه فإذا به يخرج من صلبه رجل يخرب مصر فأعطى الله عز وجل موثقا (3) أنه لا ينكح امرأة أبدًا. وخرج إلى الشام ثم إلى العراق، فأقام بفارس بقرية يقال لها نفر (4) وكان لملك تلك القرية (5) ابنة بها لمم (6) ، فوصف المصري لها دواء لعلاجها. (فلما رآها شاهد حسنا بارعا وخطبها من أبيها) (7) فدخل عليها فجرت بينهما أسباب حتى حملت منه، فوضعت بختنصر فجرى خراب الدنيا على يديه. ومنهم: الإِسكندر ذو القرنين (8) ، من أهل قرية نحو الإِسكندرية",
    "foot_note": "1. في أ \"تدنيس\" وفى ب \"بديس\" والمثبت في: ج، وخطط المقريزى 1: 287. \n2. أرمنت: كورة بصعيد مصر، وهى من أقدم المدن المصرية، وتقع على الضفة الغربية للنيل (معجم البلدان 1: 218) القاموس الجغرافى قسم 2 جـ 4 ص 160). \n3. موثقا: عهدا. \n4. نفر: اسم قرية قديمة من قرى فارس. (معجم البلدان 4: 798). \n5. ب \"وكان للملك بتلك القرية\" والمثبت من أ، ج. \n6. اللمم: الجنون. \n7. ما بين القوسين ساقط من: ب، ج. وهو في: أ. \n8. قال المقريزى: الحقيقة أن ذا القرنين - الذي ذكره الله تعالى في كتابه العزيز - عربى، واسمه: الصعب بن ذى مراثد بن الحارث .. بن وائل بن حمير بن سبأ \n…. بن قحطان، وهو ملك من ملوك حمير. وقد غلط عن ظن أن الاسكندر بن فليبس، مجدد بناء الإسكندرية، هو ذو القرنين، فإن لفظة (ذو) عربية، وذو القرنين من ألقاب العرب ملوك اليمن، وذاك رومى يونانى. ومما يعترض به على من قال: إن الاسكندر هو ذو القرنين، أن معلم الاسكندر كان أرسطاليس، بأمره يأتمر، وبنهيه ينتهى، واعتقاد أرسطاطاليس مشهور، وذو القرنين نبي، فكيف يقتدي نبي بأمر كافر؟. (المقريزى، الخطط 1/ 153).",
    "book_id": "405",
    "new_page_number": 36
  },
  {
    "serial_number": "6303885",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 16,
    "volume_number": 1,
    "text": "يقال لها لوبية، ملك الأرض بأسرها، وذكره الله في كتابه العزيز باسمه، فقال تعالى: {وَيَسْأَلُونَكَ عَنْ ذِي الْقَرْنَيْنِ قُلْ سَأَتْلُو عَلَيْكُمْ مِنْهُ ذِكْرًا (83) إِنَّا مَكَّنَّا لَهُ فِي الْأَرْضِ وَآتَيْنَاهُ مِنْ كُلِّ شَيْءٍ سَبَبًا (84) فَأَتْبَعَ سَبَبًا (85) حَتَّى إِذَا بَلَغَ مَغْرِبَ الشَّمْسِ وَجَدَهَا تَغْرُبُ فِي عَيْنٍ حَمِئَةٍ وَوَجَدَ عِنْدَهَا قَوْمًا قُلْنَا يَا ذَا الْقَرْنَيْنِ إِمَّا أَنْ تُعَذِّبَ وَإِمَّا أَنْ تَتَّخِذَ فِيهِمْ حُسْنًا} [الكهف: 84 - 86]. وبنى سد يأجوج ومأجوج، قال الله تبارك وتعالى: {قَالُوا يَا ذَا الْقَرْنَيْنِ إِنَّ يَأْجُوجَ وَمَأْجُوجَ مُفْسِدُونَ فِي الْأَرْضِ فَهَلْ نَجْعَلُ لَكَ خَرْجًا عَلَى أَنْ تَجْعَلَ بَيْنَنَا وَبَيْنَهُمْ سَدًّا (94) قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيْرٌ فَأَعِينُونِي بِقُوَّةٍ أَجْعَلْ بَيْنَكُمْ وَبَيْنَهُمْ رَدْمًا (95) آتُونِي زُبَرَ الْحَدِيدِ} [الكهف: 94 - 96] وبنى الإسكندرية ويروى أنها: {إِرَمَ ذَاتِ الْعِمَادِ (7) الَّتِي لَمْ يُخْلَقْ مِثْلُهَا فِي الْبِلَادِ} [الفجر: 7، 8]. وبنى الإسكندرية ببلاد الخزر (1) وبنى مدينة سمرقند (2) وبنى الأبراج والمناظر ببلد البسكس (3) على بحيرة طابس (4) في آخر العمارة التي بالشمال، وفعل بالعراق الأفاعيل العجيبة، غضبًا لما فعل بختنصر بمصر، فقتل دارا بن دارا، وخرب العراق. وكتب إلى معلمه بمصر أرسطاطاليس يشاوره في قتل من بقي منهم. فكتب إليه: لا تفعل، ولكن ول كل رئيس منهم ناحية من بلده، فإنهم يتنافسون في الرياسة، ولا يجمعهم ملك أبدًا، ففعل فلبثوا على ذلك زمانًا",
    "foot_note": "1. خزر بالتحريك آخره راء، بلاد الترك خلف باب الأبواب، المعروفة بالدربند قريب من سد ذى القرنين (ياقوت). \n2. سمرقند: بلد معروف مشهور، قيل: إنه من أبنية ذى القرنين بما وراء النهر (ياقوت). \n3. كذا في \"ج\" وفى \"أ\" ما صورته \"السكبس\" وفي ب \"التسكين\" ولم أهتد إليه فيما بين يدى من مصادر. \n4. كذا في ب، ج. وفى أ \"طاس\" ولم أهتد إليه فيما بين يدى من مصادر.",
    "book_id": "405",
    "new_page_number": 37
  },
  {
    "serial_number": "6303886",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 17,
    "volume_number": 1,
    "text": "طويلًا، فلما قام أردشير واجتمعوا عليه، بعد تعب عظيم وحروب ومشقة قال: إن كلمة فرقتنا أربعمائة سنة لكلمة مشئومة (1) . ومنهم: هرمس، المثلث بالنعمة: نبي، وملك، وحكيم، وهو الذي صير الرصاص ذهبًا بصاصا (2) . ومنهم أغاثيمون (3) ، وفيثاغورس (4) ، تلميذا هرمس من أصحاب الصابئة، ولهما من العلوم صنعة الكيمياء والنجوم والسحر وعلم الروحانيات والطلسمات والبرابي وأسرار الطبيعة (وقد أودعت البرابي ذلك) (5) . ومنهم أوسيلا وسيزوارس وبندقليس (6) أصحاب الكهانة والزجر. ومنهم سقراط (7) صاحب الكلام على البارئ عز وجل، والحكمة والبلاغة. ومنهم أفلاطون صاحب السياسة والنواميس والكلام على المدن والملوك (8) .",
    "foot_note": "1. ذكر ذلك ابن ظهيرة، في: محاسن مصر والقاهرة ص 85. \n2. هرمس المصرى، هو هرمس الثالث، وهو الذي يسمى المثلث بالحكمة، لأنه جاء ثالث الهرامسة الحكماء (القفطى: أخبار الحكماء ص 227). \n3. هو معلم إدريس قبل النبوة، ومعنى هذا الاسم السعيد الجد (القفطى: أخبار الحكماء ص 3،2). \n4. أخذ الحكمة عن أصحاب سليمان بن داود النبي بمصر حين دخلوا إليها من بلاد الشام، وكان قد أخذ الهندسة قبلهم عن المصريين (القفطى 170). \n5. ساقط من: ب، ج. وهو في: أ. والبرابى: بيوت العبادة لملوك مصر الأقدمين. \n6. لم يذكرهم القفطى. وأوردهم ابن زولاق ورقة 7 والنويرى 1/ 351 والسيوطى في حسن المحاضرة 1/ 60 تحت عنوان من كان بمصر من الحكماء. \n7. كان سقراط يعرف بسقراط الحُبّ. والحُبّ هو الدِّن أو الخابية - فارسى معرب (أخبار الحكماء للقفطى 135 وطبقات الأطباء لابن جلجل ص 32 هامش 3). \n8. شارك أفلاطون سقراط في الأخذ عن فيثاغورس، ومن هنا جاءت صلته بمصر بطريق غير مباشر (القفطى: أخبار الحكماء 16).",
    "book_id": "405",
    "new_page_number": 38
  },
  {
    "serial_number": "6303887",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 18,
    "volume_number": 1,
    "text": "ومنهم أرسطاطاليس (1) صاحب النطق والآثار العلوية، والحس والمحسوس والكون والفساد، والسماء والعالم، وسمع الكيان (2) والسماع الطبيعي، ورسالة نَبْت الذهب، ورسالة الغراء فيما بعد الطبيعة. حتى إن يعقوب بن إسحاق الكندي فيلسوف العرب له أكثر من ألف كتاب في كل معنى، كلها فصول من كتب أرسطاطاليس. ومنهم بَطْلَمْيُوس القلوذى صاحب الرصد والحساب، وهو صاحب كتاب المجسطى في تركيب الأفلاك وحركة الشمس والقمر والكواكب المتحركة والثابتة وصورة فلك البروج، وكتاب جغرافيا في مساحة الأرض وأقاليمها، والجبال والبحار وألوانها، والأنهار والعيون وابتدائها وانتهائها، وصفة الأمم الذين يعمرون الأرض، وكتاب الثمرة في أحكام النجوم، وكتاب تسطيح الكرة (3) . ومنهم أراطس صاحب البيضة ذات الثمانية والأربعين صورة في تشكيل صورة الفلك. والألف كوكب، واثنين وعشرين كوكبًا من الكواكب الثابتة، والزيج العلوي (4) . ومنهم إبرخس صاحب الرصد والالة المعروفة بذات الحلق (5) . ومنهم ثاون صاحب الزيج المنسوب إليه (6) .",
    "foot_note": "1. أرسططاليس: تتلمذ أبوه على فيثاغورس، ومن هنا جاءت صلته بمصر (القفطى: أخبار الحكماء 211، 220، 221). \n2. آلة موسيقية. \n3. انظر: ابن النديم الفهرست ص 327، وابن جلجل في طبقات الأطباء والحكماء ص 35، والقفطى في أخبار الحكماء ص 67. \n4. ابن جلجل: الطبقات ص 36 و 38 هامش 13. \n5. انظر القفطى: تاريخ الحكماء ص 50. \n6. انظر ابن النديم الفهرست ص 328.",
    "book_id": "405",
    "new_page_number": 39
  },
  {
    "serial_number": "6303888",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 19,
    "volume_number": 1,
    "text": "ومنهم دامانيوس، وواليس، وأصطفن أصحاب كتب أحكام النجوم. ومنهم إيرن (1) ، وله الهندسة والمقادير، وكتاب جر الأثقال، والحيل الروحانية وعمل البنكامات والآلات لقياس الساعات. ومنهم فيلون البُزَنْطِي، وله عمل الدواليب والأرحية والحركات بالحيل اللطيفة (2) . ومنهم أرشميدس (3) ، صاحب الحيل والهندسة، والمرايا، والمرايا المحرقة، وعمل المجانيق ورمي الحصون، والحيل على الجيوش والعساكر برًا وبحرًا. ومنهم مارية وقلبطرة، ولهم الطِّلَّسْمَات، والخواص للطبائع (4) . ومنهم أبلونيوس، وله كتاب المخروطات، وكتاب قطع الخطوط (5) . ومنهم تابوشيش، وله كتاب الأكر، ومنهم ذيوفنطس (6) ، وله كتاب الحساب. ومنهم أوطوقيوس (7) ، وله كتاب الكرة والأسطوانة. ودخلها جالينوس (8) ، وديسقوريدس (9) صاحب الحشائش (10) ، ودُيوجانس، وأركاغانس، وأوريباسيوس (11) ، وفريقونوس،",
    "foot_note": "1. انظر ابن النديم: الفهرست ص 328. \n2. أورده النويرى في نهاية الأرب 1/ 352. \n3. وهو الذي أسس الجسور التي يتوصل بها في مصر من قرية إلى قرية في زمن النيل (القفطى: تاريخ الحكماء ص 48). \n4. أورده النويرى في نهاية الأرب 1/ 353. \n5. انظر ابن النديم: الفهرست ص 326. \n6. انظر ابن النديم: الفهرست ص 329. \n7. انظر ابن النديم - الفهرست ص 327. والقفطى: تاريخ الحكماء ص 52. \n8. انظر ابن المديم: الفهرست ص 348. \n9. انظر ابن النديم: الفهرست ص 351. \n10. ومن كتاب الحشائش لديسقوريدس نسخة بدار الكتب برقم 1529 طب. وانظر النديم ص 351. \n11. انظر ابن النديم: الفهرست ص 350. القفطى تاريخ الحكماء ص 53.",
    "book_id": "405",
    "new_page_number": 40
  },
  {
    "serial_number": "6303889",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 20,
    "volume_number": 1,
    "text": "وروفس (1) ولهم الطب اليوناني. فكل هؤلاء سكنوا مصر في الدهور الخالية والأيام السالفة، فما غيرت ذهن واحد منهم ولا أضرت بعقله.  [من كان بمصر من الأنبياء] وأما من كان بها من الأنبياء عليهم السلام، فإبراهيم الخليل، وإسماعيل ويعقوب، ويوسف. واثنا عشر نبيًا من ولد يعقوب وهم الأسباط وموسى وهارون ويوشع بن نون، وعيسى بن مريم، ودانيال، عليهم الصلاة والسلام. فهذا ما ذكر: من كان بها قبل الإِسلام.  [من كان بمصر في الإِسلام من الصحابة] وأما من كان بها في الإسلام من الصحابة والفقهاء والعلماء والأحبار والزهاد ومن دخلها من الملوك والخلفاء وأهل العلم والشعر والنحو والخطابة، وكل من برع على أهل زمانه، أو نجم على أهل عصره، فيتسع ذلك علينا، ولكن نختصر من ذلك على المشهورين. ذكر أهل العلم والمعرفة والرواية أنه دخل مصر في فتحها ممن صحب رسول الله صلى الله عليه وسلم مائة رجل ونيف. وقال يزيد بن أبي حبيب (2) : وقف على إقامة قبلة المسجد الجامع ثمانون رجلا من أصحاب رسول الله صلى الله عليه وسلم. منهم الزبير بن العوام، والمِقْداد بن الأسود (3) ، وعُبادة بن",
    "foot_note": "1. يلاحظ أن ابن النديم وابن الكندى وابن زولاق والقفطى والسيوطى وابن ظهيرة تختلف أسماء هؤلاء العلماء في كتبهم، وبعضهم يزيد على بعض. \n2. سبقت ترجمته. \n3. المقداد بن الأسود: وليس الأسود أباه، وإنما تبناه الأسود بن عبد يغوث وهو صغير، فعرف به؛ واسم أبيه عمرو بن ثعلبة الكندى. شهد فتح مصر، ومات سنة 33 هـ. في خلافة عثمان (الإصابة 6/ 202).",
    "book_id": "405",
    "new_page_number": 41
  },
  {
    "serial_number": "6303890",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 21,
    "volume_number": 1,
    "text": "الصامت (1) ، وأبو الدرداء (2) ، وفَضَالة بن عبيد (3) ، وعقبة بن عامر وأبو ذر (4) (ومَحْمِيَّة بن جَزْء (5) ، ونُبيه بن صُؤاب (6) )، ورافع بن مالك، وربيعة بن شُرَحْبِيل بن حَسَنَة (7) ، وسعد بن أبي وقاص (8) وعمرو ابن علقمة، (وعبد الله بن عمرو بن العاص (9) )، (وعبد الله بن عمر بن الخطاب (10) ) وخارجة بن حُذَافَة (11) ، وعبد الله بن سعد بن",
    "foot_note": "1. عبادة بن الصامت بن قيس الخزرجى أبو الوليد: شهد بدرا والمشاهد كلها بعد بدر، كما شهد فتح مصر، ومات بفلسطين سنة 34 هـ. (الإصابة 3/ 624). \n2. أبو الدرداء: هو عويمر بن عامر - ويقال: ابن مالك: الأنصارى الخزرجى. أسلم يوم بدر، وشهد فتح مصر. مات سنة 32 هـ. (الإصابة 4/ 747)، (حسن المحاضرة 1/ 244. \n3. فضالة بن عبيد بن قيس الأنصارى أبو محمد: ولي قضاء دمشق لمعاوية وشهد فتح مصر مات سنة 53 هـ (الإصابة 5/ 371). \n4. أبو ذر الغفارى جندب بن جنادة. شهد فتح مصر، واختط بها، وقد سكن مصر مدة مات سنة 32 هـ (الإصابة 7/ 125 وحسن المحاضرة 1/ 245). \n5. محمية بن جزء الزبيدى: كان قديم الإسلام، وعامل رسول الله صلى الله عليه وسلم على الأخماس، وقيل إنه شهد بدرا، وقيل شهد فتح مصر (الإِصابة 6/ 44). \n6. ما بين القوسين ساقط من: أ، وهو في: ب، ج. ونبيه، هو نبيه بن صؤاب - بضم المهملة بعدها همزة - الجُهَنيّ، شهد فتح مصر، وكان أحد الأربعة الذين أقاموا قبلة الجامع (الإصابة 6/ 423). \n7. ربيعة بن شرحبيل بن حسنة: شهد فتح مصر. ويقال: إن عمرو بن العاص كان يستعمله على بعض العمل (الإصابة 2/ 504). \n8. سعد بن أبي وقاص: أحد العشرة، فارس الإِسلام، شهد فتح مصر، ووردها رسولا من قبل عثمان. مات سنة 55 هـ (الإِصابة 3/ 73)، (حسن المحاضرة 1/ 205). \n9. ساقط من: أ، وهو في: ب، ج. \n10. ساقط عن: ب، وهو في: أ، ج. \n11. خارجة بن حذافة بن غانم بن عامر. أحد الفرسان، قيل: كان يعد بألف فارس، وهو من مُسلِمة الفتح، شهد مع عمرو بن العاص فتح مصر، واختط بها. قتله الخارجي الذي انتدب لقتل عَمرو، وهو يظنه عَمرا، وقال: أردت عَمْرًا وأراد الله خارجة. (الإِصابة 2/ 222).",
    "book_id": "405",
    "new_page_number": 42
  },
  {
    "serial_number": "6303891",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 22,
    "volume_number": 1,
    "text": "أَبِي سَرْح (1) ، وأبو رافع مولى رسول الله صلى الله عليه وسلم (2) ، (ومحمد بن مَسْلَمة (3) )، ومَسْلَمة بن مُخَلَّد (4) ، وأبو أيوب (5) ورويفع بن ثابت (6) ، وهُبَيْب بن مُغْفِل (7) ، وكعب بن ضِنّة (8) ، ومعاوية بن حُدَيج (9) ، وعمار بن ياسر، وعمرو بن العاص، وأبو هريرة وغيرهم.  [من كان بمصر من الفقهاء والعلماء] وأما من كان بها من الفقهاء والعلماء، فمنهم: يزيد بن أبي حبيب، والليث بن سعد، وله مذهب انفرد به. وهو الذي أخرج الرشيد من يمينه",
    "foot_note": "1. عبد الله بن سعد، أسلم قديما، وكتب لرسول الله صلى الله عليه وسلم الوحى. شهد فتح مصر واختط بها، وولاه عثمان بن عفان مصر بعد عمرو بن العاص، مات سنة 36 هـ. (الإصابة 4/ 109). \n2. أبو رافع، اسمه أسلم، وقيل: إبراهيم، وقيل: صالح، شهد فتح مصر، واختط بها. (الإصابة 7/ 134)، (حسن المحاضرة 1/ 245). \n3. ساقط من: ب، وهو في: أ، ج. وذكر ابن حجر محمد بن مسلمة فيمن دخل مصر من الصحابة فقال: قدم مصر رسولا من عمر إلى عمرو بن العاص يقاسمه ماله. توفي سنة 43 هـ (الإصابة 6/ 33). \n4. شهد فتح مصر واختط بها. وولي إمرة مصر، وهو أول من جمعت له مصر والمغرب وذلك في خلافة معاوية، مات بمصر سنة 62 هـ (الإصابة 6/ 117) (حسن المحاضرة 1/ 235). \n5. أبو أيوب الأنصاري: خالد بن زيد بن كليب، حضر العقبة وبدرا والمشاهد كلها. شهد فتح مصر، وغزاها بحرا، مات بالقسططنية غازيا مع يزيد بن معاوية سنة 52 هـ (الإصابة 2/ 234) (حسن المحاضرة 1/ 243). \n6. رويفع بن ثابت بن السكن الأنصارى. نزل مصر، وولاه معاوية على طرابلس سنة 46 هـ، فغزا إفريقية. توفى سنة 56 هـ (الإصابة 2/ 501). \n7. شهد فتح مصر، واختط بها، وإليه ينسب وادي هبيب؛ لأنه كان اعتزل في فتنة عثمان هناك، وتوفى به (الإصابة 6/ 529)، (حسن المحاضرة 1/ 240). \n8. شهد فتح مصر واختط بها، ويقال إنه ولي القضاء بها (الإصابة 5/ 613). \n9. هو معاوية بن حديج - بمهملة ثم جيم مصغرا - شهد فتح مصر، وهو الوافد على عمر بفتح الإسكندرية، مات سنة 52 هـ. (الإصابة 6/ 147).",
    "book_id": "405",
    "new_page_number": 43
  },
  {
    "serial_number": "6303892",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 23,
    "volume_number": 1,
    "text": "التي عجز عنها فقهاء الدنيا، ومنهم (عبد الله بن وهب (1) ) يفوق بتصنيفه جماعة من الفقهاء المصنفين، وله من تصنيفه نحو مائة جزء، ومنهم عبد الله بن لهيعة، له منزلة في الفقه والحديث والأخبار، ومنهم أشهب (2) ، وابن القاسم (3) وعبد الله بن عبد الحكم (4) ، وأسد بن موسى (5) ، ومحمد بن عبد الحكم (6) ، والمُزَنِى (7) ، والربيع المُؤَذِّن (8) ، وأحمد بن سلامة",
    "foot_note": "1. ساقط من: ب، وهو في: أ، ح. وعبد الله بن وهب، جمع بين الفقه والرواية والعبادة، لم يكتب مالك لأحد بالفقيه إلا إلى ابن وهب، فكان يكتب إليه: إلى عبد الله بن وهب فقيه مصر، وإلى أبي محمد المفتى. (حسن المحاضرة 1/ 302). \n2. هو: أشهب بن عبد العزيز، أبو عمرو العامرى صاحب مالك، قال الشافعي: ما أخرجت مصر أفقه من أشهب لولا طيش فيه. توفى سنة 204 هـ. (نفس المصدر 1/ 345). \n3. هو: عبد الرحمن بن القاسم بن خالد العتقى المصرى، أبو عبد الله الفقيه، راوية المسائل عن مالك، وكان زاهدا صبورا مجانبا للسلطان. مات سنة 191 هـ. (حسن المحاضرة 1/ 303). \n4. ساقط من: ب، وهو في: أ، ج. وهو عبد الله بن عبد الحكم بن أعين بن ليث المصرى أبو محمد كان من جلة أصحاب مالك. ألقيت إليه الرياسة بمصر بعد أشهب. وله مصنفات في الفقه وغيره - وهو صاحب كتاب فضائل عمر بن عبد العزيز وغيره. مات سنة 215 هـ (حسن المحاضرة جـ 1 ص 305). \n5. هو: أسد بن موسى الأموى نزيل مصر، ويقال له أسد السنة. رحل في طلب الحديث، وصنف التصانيف. (العبر 1/ 361). \n6. هو محمد بن عبد الله بن عبد الحكم الفقيه، أبو عبد الله المصرى، كان من العلماء الفقهاء، مبرزا من أهل النظر والمناظرة والحجة. وإليه كانت الرحلة عن الغرب والأندلس في العلم والفقه. مات سنة 268 هـ. (حسن المحاضرة جـ 1/ 309). \n7. المزنى، هو: الفقيه أبو إبراهيم إسماعيل بن يحيى بن إسماعيل المصرى صاحب الشافعي، قال الشافعي: المزنى ناصر مذهبى، وصنف الجامع الكبير، والجامع الصغير، مات سنة 264 هـ (العبر 2/ 28). \n8. هو: الربيع بن سليمان بن عبد الجبار بن كامل المرادى مولاهم. أبو محمد المصرى، صاحب الإمام الشافعي، وراوى كتبه، والمؤذن بجامع الفسطاط. أملى الحديث بجامع طولون؛ وهو أول من أملى به. مات سنة 207 هـ (حسن المحاضرة 1/ 348).",
    "book_id": "405",
    "new_page_number": 44
  },
  {
    "serial_number": "6303893",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 24,
    "volume_number": 1,
    "text": "الطَّحَاوي (1) ، وكل واحد منهم قد برع في مذهبه، ونجم على (2) أهل عصره، ولكل واحد منهم من الكتب المصنفة ما يعجز عن نظيرها سائر أهل الدنيا. ومنهم سعيد بن عُفير، ويحيى بن عثمان، وابن قُدَيْد، ومحمد بن يوسف الكندي (3) ، والمَيْسَرىّ (4) ، وابن أبي خيثمة، وكل (5) واحد منهم قد فاق أهل عصره وبرز عليهم في الفقه والعلم والأخبار وأيام الناس والافتنان في سائر العلوم.  [من كان بمصر من الزهاد] وكان بها من الزهاد، حَيوة بن شُرَيح (6) ، وسُلَيم بنِ عِتْر (7) ، وسليمان بن القاسم (8) ، وأبو الربيع الزُّبْدِي (9) ، وسعيد الأدَم (10) ، وإدريس",
    "foot_note": "1. نسبة إلى طحا، كورة بمصر في شمالى الصعيد (اللباب). وهو الإمام العلامة صاحب التصانيف البديعة أبو جعفر أحمد بن محمد بن سلامة، كان فقيها لم يخلف بعده مثله، انتهت إليه رياسة الحنفية بمصر، مات سنة 321 هـ (حسن المحاضرة 1/ 350). \n2. ج \"في\". \n3. يذكر أبو عمر الكندى هنا، ضمن فقهاء مصر وعلمائها، وهذا واحد من الأدلة التي سبق أن ذكرناها من أن الكتاب ليس لأبى عمر محمد. \n4. الميسرى هو عبد العزيز بن أبي ميسرة الحضرمى، كان عالما بأخبار مصر، وهو من علماء القرن الثالث الهجرى، ويظهر اسمه كمصدر للمعلومات عن ولاة مصر لدى الكندى. (الولاة ص 58، 90، 97، 144، 128، 132، 139). \n5. ج \"كل\". \n6. حيوة بن شريح التجيبى المصرى، الفقيه الزاهد العابد، أحد الزهاد والعلماء السادة، عرض عليه قضاء مصر فأبى مات سنة 158 هـ (حسن المحاضرة 1/ 300). \n7. سليم بن عتر التجيبى المصرى، قاضى مصر وناسكها، كان يسمى الناسك لكثرة فضله وشدة عبادته. مات سنة 75 هـ (حسن المحاضرة 1/ 295). \n8. انظر عن سليمان بن القاسم الزاهد المصرى (مرشد الزوار، ص 431، 432، 436). \n9. هو الشيخ أبو الربيع سليمان الزُّبْدِى، ذكره القضاعى في تاريخه، وله حكايات مشهورة مع الوزير أبي بكر الماذرائى. وسمى الزبدى لأن الناس كانوا يشمون منه رائحة الزبد. انظر (تحفة الأحباب ص 371، والكواكب السيارة ص 240). \n10. سعيد بن زكريا الأَدَم - بهمزة مقصورة ومهملة مفتوحتين - أبو عثمان المصرى، صدوق عابد. مات بإخميم سنة 207 هـ (التقريب ت 2307، وحسن المحاضرة 1/ 285).",
    "book_id": "405",
    "new_page_number": 45
  },
  {
    "serial_number": "6303894",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 25,
    "volume_number": 1,
    "text": "الخَوْلَانِيّ (1) ، (وذو النون المصري (2) )، وغير من ذكرناهم. ونشأ بينهم هانئ ابن المنذر. وشاعرهم: حبيب بن أوس الطائي. وفارسهم: مالك بن ناعمة (3) ، فارس الشقر. ومتكلمهم: غيلان أبو مروان (4) ، رئيس الغيلانية.  [من ولد بمصر من الخلفاء] وولد بها من الخلفاء، عمر بن عبد العزيز، وجعفر المتوكل على الله.  [من دخل مصر من الفقهاء وغيرهم] وأما من دخلها من الفقهاء وغيرهم، فالشَّعْبِيّ (5) (وأبو سلمة بن عبد الرحمن (6) ) وعِكْرمة ومحمد بن إسماعيل بن عُلَيَّة، والشافعي، وحفص الفرد (7) وإبراهيم بن أدهم، ومنصور بن عمار المتكلم.  [من دخل مصر من الخلفاء] ودخلها من الخلفاء معاوية (8) ، ومروان بن الحكم، وعبد الله بن الزبير، وعبد الملك بن مروان، ومروان بن محمد، والسفاح، والمنصور، والمأمون، والمعتصم، والواثق.",
    "foot_note": "1. هو إدريس بن يحيى الخولاني أبو عمرو، كان أفضل أهل زمانه وأعظمهم قدرا وعلما. توفى سنة 211 هـ (مرشد الزوار، ص 359، 360). \n2. ذو النون المصرى الإخميمى أبو الفيض، أحد رجال الحقيقة وأحد العلماء الورعين في وقته. توفى سنة 245 هـ (طبقات الأولياء 218). \n3. أبو ناعمة: مالك بن ناعمة الصدفى، صاحب الفرس الأشقر، الذي يقال له أشقر صدف، وكان لا يجارى سرعة (فتوح مصر 73). \n4. هو: غيلان بن مسلم الدمشقى، أبو مروان: كاتب من البلغاء توفى بعد سنة 105 هـ (البخارى: التاريخ الكبير 7/ 102، وطبقات المعتزلة 25، وميزان الاعتدال 3/ 338). \n5. الشعبى، هو: أبو عمرو عامر بن شراحيل الشعبى الكوفى، توفى سنة 104 هـ. (العبر 1/ 127). \n6. ساقط من: ب، وهو في: أ، ج. \n7. حفص الفرد، من المجبرة، من أكابرهم، يكنى أبا عمرو. وكان من أهل مصر (الفهرست 229). \n8. قال ابن الربيع: دخل مصر وبلغ إلى سلمنت من كور عين شمس، توفى سنة 66 هـ. (حسن المحاضرة 1/ 237).",
    "book_id": "405",
    "new_page_number": 46
  },
  {
    "serial_number": "6303895",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 26,
    "volume_number": 1,
    "text": "[من دخل مصر من الشعراء] ودخلها من الشعراء، نُصَيْب (1) ، وجَمِيل بثينة (2) ، وكُثَيِّر عزة (3) ، وعبيد الله بن قيس الرقيات (4) ، والأحوص (5) وعبد الله بن الزبير، وأبو ذُؤَيْب (6) ، ومُعَلَّى الطائي (7) ، وأبو نواس، ودِعْبل بن علي الخزاعي، والغيداق، وزبدة (8) ، وأبو صعصعة، وأبو حجلة (وأبو نجاد (9) )، وابن حذار (10) ، والحسين الجمل (11) ، وغير من ذكرناهم.",
    "foot_note": "1. نصيب بن رباح الشاعر، أبو محجن، مولى عبد العزيز بن مروان، كان بمصر أيام مولاه (حسن المحاضرة 1/ 558). \n2. جميل بن عبد الله بن معمر العذرى، صاحب بثينة، أحد عشاق العرب، شاعر إسلامى، قدم مصر على عبد العزيز بن مروان فأكرمه (حسن المحاضرة 1/ 558) (الشعر والشعراء 100). \n3. كثير بن عبد الرحمن الخزاعى، أبو صخر، شاعر مشهور من أهل المدينة، أكثر إقامته بمصر، وصاحبته عزة، وبها يعرف، توفى سنة 105 هـ (حسن المحاضرة 1/ 558). (الشعر والشعراء 121). \n4. وإنما لقب عبيد الله بن قيس الرقيات لأنه شبب بثلاث نسوة سمين جميعا رقية (الأغانى، طبعة دار الكتب 5/ 73). \n5. هو: عبد الله بن محمد بن عبد الله بن عاصم، لقب الأحوص لحوص كان في عينيه - والحوص: ضيق في مؤخر العينين أو في إحداهما. (الأغانى 4/ 224). \n6. هو خويلد بن خالد أبو ذؤيب الهذلى، كان فصيحا كثير الغريب متمكنا في الشعر، مات بمصر (الشعر والشعراء 2/ 653، والإصابة 7/ 131). \n7. له شعر على الحوادث في كتاب ولاة مصر للكندى حتى سنة 214 هـ. ومعنى ذلك أنه كان يعيش في القرنين الثاني والثالث، فهو من شعراء عصر في المائتين الثانية والثالثة (الكندى: ولاة مصر ص 181، 190، 194، 195، 199 - 201، 203، 212). \n8. في: أ، ج \"يزيد\"، وفى: ب \"بزية\" تحريف، صوابه في: المغرب في حلى المغرب. وزبدة، هو: العلوى الحسينى الزينبى المعروف بزيدة، قال ابن سعيد: وجدت في دفتر أعارنيه النجم الريحانى المشهور بجمع دفاتر الأدب منسوبا لزيادة العلوى الحسينى الزينبى، وقدليم على طول إقامته بالفسطاط: أنا بالفسطاط ثاوٍ \n…. ودع اللائمَ يَلْحَى (المغرب في حلى المغرب 250). \n9. ساقط من: أ، وهو في: ب، ج. \n10. هو: جعفر بن محمد بن أحمد بن حذار، كان حيا سنة 267 هـ. كاتب شاعر، وزير العباس بن أحمد بن طولون، قتله أحمد بن طولون - (إرشاد الأريب 2/ 415). \n11. هو الحسين بن عبد السلام، من شعراء الفسطاط في الدولة الطولونية، مدح =",
    "book_id": "405",
    "new_page_number": 47
  },
  {
    "serial_number": "6303896",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 27,
    "volume_number": 1,
    "text": "[ذكر مصر وفضلها على غيرها من الأمصار] وأما ذكر مصر وفضلها على غيرها من الأمصار وما خصت به وأوثرت به على غيرها، فروى أبو بَصْرَة الغِفَاريّ (1) قال: مصر خزانة الأرض كلها، وسلطانها سلطان الأرض كلها، قال الله تعالى على لسان يوسف عليه السلام: {قَالَ اجْعَلْنِي عَلَى خَزَائِنِ الْأَرْضِ إِنِّي حَفِيظٌ عَلِيمٌ} [يوسف: 55]. ولم تكن تلك الخزائن بغير مصر، فأغاث (2) الله بمصر وخزائنها كل حاضر وباد من جميع الأرض. وجعلها الله تعالى متوسطة الدنيا، وهي في الإِقليم الثالث والرابع (3) ، فسلمت من حر الإقليم الأول والثاني، ومن برد الإقليم الخامس والسادس والسابع، فطاب هواؤها، ونقي جوها وضعف حرها، وخف بردها، وسلم أهلها من مشاتي الجبال، ومصائف عمان، وصواعق تهامة، ودماميل (4) الجزيرة، وجرب (5) اليمن، وطواعين الشام، وغِيَلان (6) العراق، وعقارب عسكر مُكْرَم (7) ، وطلب البحرين، وحمى خيبر، وأمنوا من غارات الترك، وجيوش الروم وطوائف العرب، ومكائد الديلم (8) ، وسرايا القرامطة،",
    "foot_note": "1. = أحمد بن طولون، كما مدح أحمد بن المدبر صاحب خراج مصر، توفى سنة 258 هـ (المغرب في حلى المغرب - الجزء الخاص بمصر ص 270). \n1. صحابى، شهد فتح مصر واختط بها، ومات بها، ودفن في مقبرتها (الإصابة 7/ 43). \n2. في: أ \"فأعان\". \n3. انظر ياقوت 5/ 137. \n4. الدُّمَّل: التهاب محدود في الجلد والنُّسُج التي تحته مصحوب بتقيح ويجمع على دَمَاميل (المعجم الوسيط: دمل). \n5. في نهاية الأرب للنويرى 1/ 371 وهو يسرد خصائص البلاد في الأمراض \"وعَرَق اليمن\". \n6. الغُول: كل ما أخذَ الإنسانَ من حيث لا يدرى فأهلكه - والجمع أغوَال وغِيلان - ومفرد الغيلان، تزعم العرب أنه نوع من الشياطين يَظهر للناس في الفلاة، فيتلون لهم في صور شتى ويَغُولهم، أي يُضللهم ويُهلكهم (المعجم الوسيط: غول). \n7. بلد بخوزستان. \n8. بلاد الديلم تقع في الجنوب الغربي لبحر قزوين، وهى جبال منيعة يتحصنون بها، ولذا فإن الحصانة الطبيعية لهذه البلاد ضمنت لها عدم خضوعها خضوعا مباشرا للفرس. وجيل الديلم مشهورون بالقسوة وغلظ الطبع. وقد اتسم تاريخ الديلم بالعداء للدولة الإسلامية منذ عهودها المبكرة، وقد ظلت هذه الصفة هي الطابع العام لسياستهم تجاه الدولة الإسلامية =",
    "book_id": "405",
    "new_page_number": 48
  },
  {
    "serial_number": "6303897",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 28,
    "volume_number": 1,
    "text": "وبُثُوق (1) الأنهار، وقحط الأمطار، وقد اكتنفها معادن رزقها؛ وقرب تصرفها، فكثر خصبها، ورغد عيشها، ورخص سعرها (2) . وقال سعيد بن أبي هلال (3) : مصر أم البلاد، وغوث العباد. وذكر أن مصر مصورة في كتب الأوائل، وسائر المدن مادة أيديها إليها تستطعمها (4) . وقال عمرو بن العاص: ولاية مصر جامعة، تعدل الخلافة (5) . وأجمع أهل المعرفة: أن أهل الدنيا مضطرون إلى مصر يسافرون إليها، ويطلبون الرزق بها، وأهلها لا يطلبون الرزق في غيرها، ولا يسافرون إلى بلد سواها، حتى لو ضرب بينها وبين [بلاد (6) ] الدنيا لغني أهلها بما فيها عن سائر [بلاد (7) ] الدنيا. ورى عن حَيْوة بن شُريح، عن عُقبة بن مُسلم (8) ، حديث، يرفعه إلى الله عز وجل يقول يوم القيامة لساكني مصر فيما يعدد عليهم من نعمته \"ألم أسكنكم مصر، فكنتم تشبعون من خبزها وتروَوْن من مائها، أمسكوا على أفواهكم\" (9) . وقال يحيى بن سعيد: جلت البلاد فما رأيت الورع ببلد من البلدان أعرفه إلا بالمدينة وبمصر.",
    "foot_note": "1. = طوال الفترة التي سبقت اعتناقهم للدين الإسلامي، أي إلى ما قبل نهاية القرن الثالث الهجرى بقليل (الرافعى: التدوين في أخبار قزوين 1/ 31، 37، 38). \n1. بَثَق الماء بُثُوقا: اندفع فجأة. وبثق النهر ونحوه: كسر شطه (المعجم الوسيط: بثق). \n2. ذكر ذلك السيوطى في: حسن المحاضرة 2/ 329. ونسب هذا النص إِلى الكندى. \n3. سعيد بن أبي هلال الليثى أبو العلاء المصرى. روى عن نافع، وعنه الليث مات سنة 149 هـ (حسن المحاضرة 1/ 274). \n4. حسن المحاضرة 1/ 21. \n5. نهاية الأرب 1/ 348. \n6. تكملة عن: حسن المحاضرة 2/ 330، ونهاية الأرب 1/ 355. \n7. حسن المحاضرة 1/ 22. \n8. عقبة بن مسلم التجيبى أبو محمد المصرى القاصّ، إمام مسجد الجامع العتيق بمصر. توفى قريبا من سنة 120 هـ (المزى: تهذيب الكمال 20/ 222). \n9. أورده السيوطى في حسن المحاضرة 1/ 22 بسنده ونصه. ولم أهتد إلى تخريجه فيما بين يدى من كتب الحديث.",
    "book_id": "405",
    "new_page_number": 49
  },
  {
    "serial_number": "6303898",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 29,
    "volume_number": 1,
    "text": "وقال خالد بن يزيد (1) : كان كعب الأحبار يقول: لولا رغبتي في الشام لسكنت مصر؛ فقيل: ولم ذلك يا أبا إسحاق؟ قال: إني لأحب مصر وأهلها؛ لأنها بلدة معافاة من الفتن، وأهلها أهل عافية، فهم بذلك يعافون، ومن أرادها بسوء كبه الله على وجهه، وهو بلد مبارك لأهله فيه (2) . وروى عن شُفَيّ (3) بن عُبيد الأصبحي، أنه قال: مصر بلدة معافاة من الفتن لا يريدهم أحد بسوء إلا صرعه الله، ولا يريد أحد هُلْكهم إلا أهلكه الله. وذكر أهل العلم أنه مكتوب في التوراة: بلد مصر خزانة الله، فمن أرادها بسوء قصمه الله. وقال أبو الربيع السائح: نعم البلد مصر، يحج منها بدينارين، ويغزى منها بدرهمين. يريد الحج في بحر القُلْزُم (4) ، والغزو إلى الإسكندرية وسائر سواحل مصر (5) . وذكر يحيى بن عثمان، عن أحمد بن عبد الكريم، قال: جلت الدنيا، ورأيت أهلها، ورأيت آثار الأنبياء والملوك والحكماء، ورأيت بناء كسرى وقيصر وغيرهما من ملوك الأرض، ورأيت آثار سليمان بن داود عليهما السلام ببيت المقدس وتدمر، والأردن، وما بنته الشياطين بتدبير النبوة، فلم أر مثل برابي مصر على حكمتها، ولا مثل الآثار التي بها، والأبنية التي لملوكها وحكمائها.  [كور مصر] وبمصر ثمانون كورة، ليس منها كورة إلا وفيها طرائف وعجائب",
    "foot_note": "1. هو: خالد بن يزيد الجمحى أبو عبد الرحمن المصرى. روى عن عطاء، وعنه الليث. مات سنة 139 هـ (حسن المحاضرة 1/ 300). \n2. ذكر ذلك ابن تغرى بردى في: النجوم الزاهرة 1/ 31، والسيوطى في: حسن المحاضرة 1/ 21 والمقريزى في: الخطط 1/ 27، والنويرى في: نهاية الأرب 1/ 348. \n3. في: أ \"سعد\" تحريف، والصواب في: ب، ج وحسن المحاضرة 1/ 22. \n4. القلزم: مدينة على ساحل بحر اليمن من جهة مصر ينسب إليها البحر المُسَمَّى اليوم البحر الأحمر (فتوح البلدان ص 766، وياقوت 4/ 378). \n5. حسن المحاضرة جـ 1 ص 22.",
    "book_id": "405",
    "new_page_number": 50
  },
  {
    "serial_number": "6303899",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 30,
    "volume_number": 1,
    "text": "من أصناف البر والأبنية والنتاج والشراب والطعام والفاكهة وجميع ما ينتفع به الناس، ويدخره الملوك، يعرف كل صنف من كورته، وينسب كل لون إلى كورته، وصعيدها أرض حجازية، حرها كحر الحجاز، تنبت النخل والأراك (1) والقرط (2) والدَّوْم (3) والعشر (4) ، وأسفل أرضها شامي تمطر مطر الشام، وتنبت نبات الشام من الكرم والتين والموز والجوز وسائر الفاكهة، والبقول والرياحين، ويقع به الثلج (5) . ومنها كورة لوبية ومراقية (6) برابى وجبال وغياض، وزيتون وكروم برية بحرية جبلية، بلاد إبل وماشية، ونتاج وعسل ولبن وفي كل كورة من مصر مدينة، قال تعالى: {وَابْعَثْ فِي الْمَدَائِنِ حَاشِرِينَ} [الشعراء: 36]. وفي كل مدينة منها آثار عجيبة من الأبنية والصخور والرخام والبرابي، وتلك المدن كلها تأتي من السفن (تحمل الطعام والمتاع والآلات إلى الفسطاط (7) ) تحمل السفينة الواحدة ما يحمله خمسمائة بعير.",
    "foot_note": "1. الأراك: نبات شُجيرى من الفصيلة الأراكية كثير الفروع متقابل الأوراق له ثمار حمر دكناء تؤكل. ينبت في البلاد الحارة، ويوجد في صحراء مصر الجنوبية الشرقية. ابن البيطار: الجامع لمفردات الأدوية والأغذية 1/ 20. والمعجم الوسيط 1/ 15. \n2. القُرط: نبات عشبى حولى كلثى مشهور من الفصيلة القرنية وهو يماثل البرسيم. ابن البيطار جـ 4 ص 15. والمعجم الوسيط جـ 2 ص 755 والقِرط: نوع من الكراث، يعرف بكراث المائدة. ابن البيطار 4/ 15 والمعجم الوسيط 2/ 755. \n3. الدُّوْم: شجر عظام من الفصيلة النخيلية، يكثر في صعيد مصر وفى بلاد العرب، وثمرته في غلظ التفاحة ذات شجر صلب أحمر، وله نواة ضخمة ذات لب إسفنجى. ابن البيطار جـ 2 ص 118، والمعجم الوسيط 1/ 315. \n4. العشر: من العضاه عراض الورق، وله سكر يخرج في فصوص شعبه ومواضع زهره، وفى سكره شئ من المرارة. وكان يوجد بديار مصر بظاهر القاهرة بمقربة من المطرية. ابن البيطار 3/ 23، 123. \n5. قارن حسن المحاضرة 2/ 324، وخطط المقريزى 1/ 26. \n6. قال ياقوت: \"مراقية: بالفتح والقاف والياء مخففة - إذا قصد القاصد من الإسكندرية إلى إفريقية، فأول بلد يلقاه مراقية، ثم لوبية\". \n7. ساقط من: ب، ج، وهو في: أ.",
    "book_id": "405",
    "new_page_number": 51
  },
  {
    "serial_number": "6303900",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 31,
    "volume_number": 1,
    "text": "ومنها: الإِسكندرية في أبنيتها وعجائبها وآثارها، وأجمع الناس أنه ليس في الدنيا مدينة على ثلاث طبقات غيرها، ولما دخلها عبد العزيز بن مروان وهو إذ ذاك أمير مصر، قال لعاملها (1) حين رأى آثارها وعجائبها: أخبرني كم كان عدد أهلها في أيام الروم؟ قال: والله أيها الأمير ما أدرك علم هذا أحد من الملوك قط، ولكن أخبرك كم كان فيها من اليهود، فإن ملك الروم أمر بإحصائهم فكانوا ستمائة ألف. قال: فما هذا الخراب الذي في أطرافها؟ قال: بلغني عن بعض ملوك فارس حين ملكوا مصر، أنه أمر بفرض دينار على كل محتلم لعمران الإسكندرية، فأتاه كبراء أهلها وعلماؤهم، وقالوا: أيها الملك لا تتعب، فإن ذا القرنين الإسكندر أقام على بنائها ثلاثمائة سنة. ولقد أقام أهلها سبعين سنة لا يمشون فيها نهارًا إلا بخرق سود في أيديهم، خوفًا على أبصارهم من شدة بياضها (2) . ومن فضائلها ما قاله المفسرون من أهل العلم: إنها المدينة التي وصفها الله تعالى في كتابه الكريم، فقال: {إِرَمَ ذَاتِ الْعِمَادِ (7) الَّتِي لَمْ يُخْلَقْ مِثْلُهَا فِي الْبِلَادِ} [الفجر: 7، 8]. وقال أحمد بن صالح (3) : قال لي سفيان بن عُيَيْنَة: يا مصري، أين تسكن؟ قلت: أسكن الفسطاط، قال: أتأتي الإِسكندرية؟ قلت: نعم، قال لي: تلك كنانة الله يحمل فيها خير سهامه (4) .",
    "foot_note": "1. في خطط المقريزى 1/ 162 \"سأل رجلا من علماء الروم عنها وعن عدد أهلها\". \n2. الخطط 1/ 162. \n3. هو: أحمد بن صالح المصرى أبو جعفر، أحد الحفاظ المبرزين، كان إماما فقيها. سمع من ابن وهب وغيره، روى عنه البخارى وأبو داود. توفى سنة 248 هـ (حسن المحاضرة 1/ 306). \n4. حسن المحاضرة 1/ 164.",
    "book_id": "405",
    "new_page_number": 52
  },
  {
    "serial_number": "6303901",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 32,
    "volume_number": 1,
    "text": "وقال عبد الله بن مرزوق (1) الصدفي: لما نعى إلي ابن عمي خالد بن يزيد (2) وكان توفي بالإسكندرية لقيني موسى بن عُلَيّ (3) بن رباح، وعبد الله بن لَهِيعة والليث بن سعد متفرقين، كلهم يقولون: أليس مات بالإِسكندرية! فأقول: بلى فيقولون: هو حي عند الله يرزق، ويجري عليه أجر رباطه ما قامت الدنيا، وله أجر شهيد حتى يحشر على ذلك (4) . ومن عجائبها المنارة، وطولها مائتان وثمانون ذراعًا، وكان لها مرآة ترى فيها من يمر بالقسطنطينية. وفيها الملعب الذي كانوا يجتمعون فيه، لا يرى أحدهم شيئًا دون صاحبه ولا يتظالمون (5) ، ينظر وجه كل واحد منهم تلقاء وجه صاحبه، إن عمل أحدهم شيئًا أو تكلم أو قرأ كتابًا أو لعب لونًا من الألوان سمعه الباقون، ونظر إليه القريب والبعيد سواء. وفيه كانوا يترامون بالكرة، فمن دخلت كمه ولي مصر، وكان عمرو بن العاص قد دخل تاجرًا في الجاهلية بالأدم والقطن (6) ، فشهد هذا الملعب فيمن ينظر، فدخلت الكرة كمه، فأنكروا ذلك، وقالوا: ما كذبتنا هذه الكرة قط! أنى لهذا الأعرابي بولاية مصر! فأعادوها، فعادت الكرة إلى كمه مرات فتعجبوا من ذلك، إلى أن جاء الله بالإِسلام، وكان من أمره ما كان (7) .",
    "foot_note": "1. في: أ \"ابن مروان\" تحريف، والصواب في: ب، ج وحسن المحاضرة. \n2. في: أ \"زيد\" تحريف، والصواب في: ب، ج، وحسن المحاضرة، وخطط المقريزى. \n3. عُلَى: بضم العين وفتح اللام (تقريب التهذيب ت 4732). \n4. حسن المحاضرة 1/ 164، الخطط 1/ 162. \n5. عبارة المقريزى في: الخطط 1/ 158 \"لا يتظالمون فيه بأكثر من مراتب العلية والسفلية\". \n6. ب \"العطر\" والمثبت في: أ، ج، وابن سعيد في: المغرب ص 16. \n7. ذكر ذلك، المقريزى في: الخطط 1/ 159، والسيوطى في: حسن المحاضرة 1/ 95، وابن سعيد في المغرب 16.",
    "book_id": "405",
    "new_page_number": 53
  },
  {
    "serial_number": "6303902",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 33,
    "volume_number": 1,
    "text": "وبها السواري والمسلتان، وعجائبهما وآثارهما أكثر من أن تحصى، حتى إن خليجها مبلط بالرخام من أوله إلى آخره يوجد كذلك إلى اليوم. وقال الذين ينظرون في الأعمار والأهوية والبلدان بمريوط من كورة الإسكندرية، ووادي فرغانة (1) . وذكر أهل العلم (2) أن المنارة كانت في وسط الإسكندرية حتى غلب عليه البحر، فصارت في جوفه، ترى الأبنية والأساسات في البحر عيانًا إلى يوم القيامة (3) . ومنها كورة الفيوم (4) : وهي ثلاثمائة وستون قرية، دبرت على عدد أيام السنة لا تقصر عن الري، فإن قصر النيل سنة من السنين مارت كل قرية منها مصر يومًا واحدًا. وليس في الدنيا بلد بني بالوحى (5) غير هذه الكورة، ولا بالدنيا بلد أنفس منه ولا أخصب ولا أكثر خيرًا ولا أغزر أنهارًا. ولو قايسنا بأنهار الفيوم أنهار البصرة ودمشق، لكان لنا بذلك الفضل. ولقد عد جماعة من أهل العقل والمعرفة مرافقها وخيرها فإذا هي لا تحصى،",
    "foot_note": "1. المقريزى، الخطط 1/ 162. \n2. ينسب المقريزى هذا النص، إلى عمر بن أبي عمر الكندى في: \"فضائل مصر\" وانظر الخطط 1/ 158. \n3. عبارة المقريزى في الخطط: \"ألا ترى الأبنية والأساسات في البحر إلى الآن عيانا؟ \". \n4. من هنا حتى قوله: سبعين صنفا، ينسبه المقريزى إلى ابن الكندى في: \"فضائل مصر\"، وانظر الخطط 1/ 249. \n5. هكذا في الأصول، وهو يوافق ما في: حسن المحاضرة 661. وفى الخطط: \"الرحى\". وعبارة السيوطى: وهى مدينة دبرها يوسف عليه السلام بالوحى، وليس في الدنيا بلد بنى بالوحى غيرها.",
    "book_id": "405",
    "new_page_number": 54
  },
  {
    "serial_number": "6303903",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 34,
    "volume_number": 1,
    "text": "فتركوا ذلك وعدوا ما فيها من المباح مما ليس عليه ملك لأحد من مسلم ولا معاهد يستعين به القوي والضعيف فإذا هو فوق السبعين صنفًا. ومنها مدينة منف (1) ، وأبنيتها وعجائبها وأصنامها ودفائنها وكنوزها أكثر من أن تحصى، لا يدفع ذلك دافع، ولا ينكره منكر، من آثار الملوك والحكماء والأنبياء. قال إبراهيم بن منقذ الخولاني: خرجنا إلى منف، فإذا بعثمان (2) بن صالح جالس على باب الكنيسة فسلمنا عليه، فقال أتدرون ما مكتوب على باب الكنيسة؟ قلنا: ما هو؟ قال: مكتوب عليه، أنا فلان بن فلان، لا تلموني على صغر هذه الكنيسة، فإني اشتريت كل ذراع منها بمائة دينار، فقلنا: إن لهذه قصة، فقال: ها هنا وكز (3) موسى عليه السلام الرجل فقتله. ومنها مدينة عين شمس، وهي هيكل الشمس، وبها العمودان اللذان لم ير أعجب منهما ولا من شأنهما، فإنهما محمولان على وجه الأرض ليس لهما أساس، وطولهما في السماء نحو خمسين ذراعًا، فيهما صورة إنسان على دابة، وعلى رأسهما شبه الصومعتين، من نحاس، فإذا جرى النيل قطر من رأسهما ماء، وتستبينه وتراه منهما واضحًا ينبع. ومنها. الفرما (4) ، وهي أكثر عجائب وأقدم آثارًا، ويذكر أهل مصر أنه كان منها طريق إلى جزيرة قبرس في البر، فغلب عليها البحر.",
    "foot_note": "1. منف: اسم مدينة فرعون مصر، وأصلها باللغة القبطية مافه أي مدينة الثلاثين، فعربت، فقيل: منف. وكانت عاصمة مصر بعد الطوفان، كما كانت من أعمال الجيزية غربى النيل، على مسافة اثنى عشر ميلا من الفسطاط (خطط المقريزى 1/ 134) (معجم البلدان 4/ 667). \n2. سبقت ترجمته. \n3. وكزه: دفعه وضربه. \n4. من هنا إلى قوله: \"وفيه ما يكون طول البسرة منه قريبا من فتر\"، ذكره المقريزى في الخطط في / 211، 212، ونسبه إلى ابن الكندى.",
    "book_id": "405",
    "new_page_number": 55
  },
  {
    "serial_number": "6303904",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 35,
    "volume_number": 1,
    "text": "ويقولون: غلب البحر على مقطع الرخام الأبلق، [وأن مقطع (1) ] الأبيض بلوبية. قال يحيى (2) بن عثمان: كنت أرابط بالفرما، وكان بينها وبين البحر قريب من يوم، يخرج الناس والمرابطون في أخصاص على الساحل، ثم علا البحر على ذلك كله. وقال ابن قديد: توجه ابن المدبر (3) (وكان بِتِنِّيس (4) ) إلى الفرما في هدم أبواب من حجارة شرقي الحصن احتاج أن يعمل منها جيرا. فلما قلع منها حجرًا أو حجرين خرج إليه أهل الفرما بالسلاح فمنعوه من قلعها، وقالوا هذه الأبواب التي قال الله عز وجل فيها على لسان يعقوب: {وَقَالَ يَا بَنِيَّ لَا تَدْخُلُوا مِنْ بَابٍ وَاحِدٍ وَادْخُلُوا مِنْ أَبْوَابٍ مُتَفَرِّقَةٍ} [يوسف: 67]. وبالفرما نخلها العجيب الذي يثمر حين ينقطع البسر (5) والرطب من ثائر الدنيا، فيبتدئ هذا الرطب من حين يلد النخل في الكوانين، فلا ينقطع أربعة أشهر حتى يجيء البلح في الربيع. ولا يوجد ذلك في بلد من البلدان، لا بالبصرة",
    "foot_note": "1. تكملة عن: الخطط. \n2. سبق التعريف به. \n3. هو: أحمد بن محمد بن المدبر، ولى خراج مصر بعد سنة 250 هـ. كان من دهاة الناس، ابتدع في مصر بدعا صارت مستمرة من بعده لا تنقض، فقرر على الكلأ الذي ترعاه البهائم مالا سماه: المراعى، وقرر على ما يطعم الله من البحر مالا وسماه: المصائد .. إلى غير ذلك، وكانت هذه الأموال تعرف في زمنه وبعده، بالمرافق والمعاون (خطط المقريزى 1/ 103). \n4. ساقط من: أ، وهو في: ب، ج. وتنيس: جزيرة في بحر مصر قريبة من البر بين الفرما ودمياط، والفرما في شرقيها، ولا تزال هذه الجزيرة موجودة إلى اليوم ببحيرة المنزلة، في الجنوب الغربي لمدينة بورسعيد وعلى بعد تسعة كيلو مترات منها (معجم البلدان 1/ 882) (القاموس الجغرافى 1/ 198). \n5. البسر: ثمر النخل قبل أن يرطب.",
    "book_id": "405",
    "new_page_number": 56
  },
  {
    "serial_number": "6303905",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 36,
    "volume_number": 1,
    "text": "ولا بالحجاز ولا باليمن، ولا بغيرها من البلدان. ويكون هذا في البسر ما وزن البسرة منه عشرون درهمًا وأكثر. وفيه ما يكون طول البسرة منه قريبًا من فتر (1) . وقال ابن التختكان (2) : أربع كور بمصر ليس على وجه الأرض أفضل منها ولا تحت السماء لها نظير، كورة الفيوم، وكورة أتريب (3) ، وكورة سمنود، وكورة صا (4) .  [خراج مصر] وأما خراجها فجباها عمرو بن العاص أول سنة فتحها عشرة آلاف ألف دينار، وكتب إليه عمر بن الخطاب يعجز رأيه ويقول: جبيت للروم عشرين ألف ألف دينار، فلما كان في العام المقبل جباها اثني عشر ألف ألف دينار، فلما عزل عثمان عمرًا منها، وولي عبد الله (5) بن أبي سرح، زاد على القبط في الخراج والمؤن، فبلغت أربعة عشر ألف ألف دينار، فقال عثمان لعمرو. درت اللقحة (6) ، فقال عمرو: وأضررتم بالفصيل، فأدبرت منه يومئذ، ولم تزل تنقص إلى اليوم. فما جبيت في أيام بني أمية وبني العباس إلا دون الثلاثة الآلاف",
    "foot_note": "1. راجع ياقوت مادة (الفرما). والمقريزى في الخطط 1/ 212 وهو ينقل عن ابن الكندى. \n2. والى مصر من قبل الرشيد سنة 193 هـ. الكندى: الولاة ص 146. \n3. كانت من كور أسفل الأرض، وهى مائة وثمانى قرى (الخطط 1/ 175) وقد اندثرت، ومكانها اليوم: أحواض أتريب الشرقى والبحرى والغربى بأراضى مدينة بنها (القاموس الجغرافى ق 2 جـ 1/ 18). \n4. صا: بالقصر، كورة بمصر، وعدها القضاعى، في كورة الحوف الغربي (معجم البلدان 3/ 359). \n5. سبق التعريف به. \n6. اللقحة: الناقة الحلوب.",
    "book_id": "405",
    "new_page_number": 57
  },
  {
    "serial_number": "6303906",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 37,
    "volume_number": 1,
    "text": "ألف دينار غير ولاية أمير المؤمنين هشام، فإنها جباها ابن الحبحاب أربعة آلاف ألف، وولاية بني طولون بالغوا في عمارتها فجباها أبو الجيش (1) أربعة آلاف ألف دينار. وولي خراجها ابن الحَبْحَاب (2) لأمير المؤمنين هشام، فخرج بنفسه فمسح أرض مصر كلها عامرها وغامرها مما يركبه النيل فوجد فيها ثلاثين ألف ألف فدان (3) . وقال الليث بن سعد: ولي الخراج الوليد بن رفاعة لأمير المؤمنين هشام، فخرج لإحصاء الجماجم والقرى، فأقام ستة أشهر بالصعيد، وبأسفل الأرض ثلاثة أشهر، فأحصى فوق عشرة آلاف قرية، أصغر قرية فيها خمسمائة جمجمة من القبط، تكون جملة ذلك خمسة آلاف ألف (4) . وولي الخراج أسامة بن يزيد لأمير المؤمنين سليمان، فكتب إليه أن احلب الدر حتى ينقطع، واحلب الدم حتى ينصرم. فذلك أول شدة أصابت أهل مصر، فقال سليمان يومًا وقد أعجبه ما فعل أسامة: [أسامة (5) ] ([لا يرتشي دينارًا ولا درهمًا، فقال له عمر بن عبد العزيز: أنا أدلك على من هو شر من أسامة]) (6) ولا يرتشي دينارًا ولا درهمًا؛ قال: من هو؟ قال: عدو الله إبليس، فغضب",
    "foot_note": "1. هو: خمارويه بن أحمد بن طولون، الملك أبو الجيش، متولى مصر والشام، فتك به غلمان له في ذى القعدة سنة 282 هـ بدمشق. وعاش 32 سنة، وكان شهما صارما كأبيه (العبر 2/ 68). \n2. هو عبيد الله بن الحبحاب ولى خراج مصر زمنا من قبل هشام بن عبد الملك، ونقله هشام إلى إفريقية سنة 116 هـ، فسار إلى هناك وضبط أمورها، وسيّر الغزاة إلى السوس وأرض السودان، وتوفي ابن الحبحاب بعد سنة 123 هـ (فتوح مصر لابن عبد الحكم ص 217، 218، وولاة مصر للكندى ص 98). \n3. ذكر ذلك، المقريزى في الخطط 1/ 99، ويقصد بالعدد المبالغة. \n4. انظر حسن المحاضرة 1/ 146. \n5. تكملة من ابن سعيد في المغرب ص 71 وهو ينقل عن ابن الكندى. \n6. ساقط من: أ، ب، وهو في: ج. وابن سعيد في المغرب ص 71 وهو ينقل عن ابن الكندى.",
    "book_id": "405",
    "new_page_number": 58
  },
  {
    "serial_number": "6303907",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 38,
    "volume_number": 1,
    "text": "سليمان وقام من مجلسه، فلما توفي أمير المؤمنين سليمان بن عبد الملك وولي عمر بن عبد العزيز وجه في عزل أسامة قبل دفن سليمان وولي حيان بن شريح، وأمره أن يحبس أسامة في كل جند ستّة أشهر، وأسامة بنى المقياس القديم (1) . وكتب المنصور إلى محمد بن سعيد: وكان يلي خراج مصر يستحثه بالخراج، فكتب إليه يشكو اختلالها، وأنها تحتاج إلى إنفاق فإنها ترد أضعاف ما ينفق فوافق ذلك خروج بن الحسن (2) (فكتب إليه) (3) : لا تَكْسَع الشَّوْلَ بأَغْبَارِهَا … إِنك لا تدري من النَّاتِجُ (4) فزاد ذلك في انكسارها واختلالها. وذكر أن عمرو بن العاص رضي الله عنه قال للمقوقس: ويحك إنك قد وليت هذا المصر ثلاثين سنة، فبم تكون عمارتها؟ قال: بخصال؛ منها أن تحفر خلجها وتسد جسورها وترعها، ولا يؤخذ خراجها إلا من غلتها، ولا يقبل مطل أهلها، ويوفى لهم بالشروط، وتدر الأرزاق على العمال، لئلا يكون (تأخيرها (5) ) سببًا للارتشاء، ويرفع عن أهلها المعاون والهدايا، ليكون [ذلك لهم (6) ] قوة، فبذلك تعمر ويرجى خراجها.",
    "foot_note": "1. قارن عن هذا الخبر ابن سعيد في المغرب ص 71. \n2. ظهرت بمصر دعوة بني الحسن بن علي بن أبي طالب وتكلم بها الناس وبايع كثير منهم لبنى الحسن في الباطن، وماجت الناس بمصر، وكاد أمر بنى الحسن أن يتم، وبينما الناس في ذلك قدم البريد برأس إبراهيم بن عبد الله بن حسن بن الحسن بن علي بن أبي طالب في ذى الحجة سنة 145 هـ وقد منع أهل مصر من الحج بسبب خروج هؤلاء العلويين، فلما قتل إبراهيم، أذن لهم بالحج (الكندى: الولاة ص 111 - 112 والنجوم الزاهرة 2/ 1). \n3. ساقط من أ، وهو في: ب، ج. \n4. البيت في اللسان (كسع) وينسب للحارث بن حلزة، والمعنى: لا تغزر إبلك تطلب بذلك قوة نسلها، واحلبها لأضيافك، فلعل عدوا يغير عليها، فيكون نتاجها له دونك. \n5. ساقط من: أ، ب. وهو في: ج. \n6. تكملة عن: الفضائل الباهرة في محاسن مصر والقاهرة.",
    "book_id": "405",
    "new_page_number": 59
  },
  {
    "serial_number": "6303908",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 39,
    "volume_number": 1,
    "text": "[مناظر مصر وجمالها] وأما ما يعجب من رونق منظرها، فذكر عن كعب الأحبار أنه قال: من أراد أن ينظر إلى شبه الجنة، فلينظر إلى مصر إذا أخرفت وغذا أزهرت، وإذا اطردت أنهارها، وتدلت ثمارها، وفاض خيرها، وغنت طيرها. وعن عبد الله بن عمرو قال: من أراد أن ينظر إلى الفردوس فلينظر إلى أرض مصر حين تخضر زروعها، ويزهر ربيعها، وتكسى بالنوار أشجارها (وتغنى أطيارها (1) ). وقال المأمون لإبراهيم بن تميم: صف لي مصر حين تخضر زروعها، ويزهر ربيعها، وتكسى بالنوار أشجارها، وأوجز. قال جحفلة (2) : الفرس في الربيع، وعجزه في الرمل. يريد أنها برية بحرية يرتع الفرس في الربيع، ويبرد في بروده. وذكر أهل مصر أن موسى بن عيسى الهاشمي (3) وكان أمير مصر، قال (4) لهم يومًا وهو بالميدان الذي في طرف المقابر: أتتأملون ما أرى؟ قالوا: وما يرى الأمير؟ قال: أرى ميدان رهان، وجنان نخل، وبستان شجر ومنازل سكنى، وذروة جبل، وجبان أموات، ونهرًا عجاجًا، وأرض زرع، ومرعى ماشية،",
    "foot_note": "1. ساقط من: أ، ج، وهو في: ب. \n2. جحفلة الفرس: بمنزلة الشفة للإِنسان. \n3. هو والى مصر في أيام الرشيد سنة 175 هـ. \n4. جاء سهوا في حواشى \"المغرب\" ص 3 أن هذه الفقرة غير موجودة في كتاب \"فضائل مصر\" كما جاء سهوا في حواشى النجوم الزاهرة 2/ 67 ما يلى: \"بحثنا عن عبارة موسى بن عيسى هذه في البداية والنهاية والمقريزى وحسن المحاضرة للسيوطى ونهاية الأرب للنويرى وغيرها من كتب التاريخ التي تحت أيدينا فلم نعثر عليها، وقد وردت عبارة موسى بن عيسى هذه، في السيوطى في حسن المحاضرة 2/ 331 والمقريزي في الخطط 2/ 513 والنويرى في نهاية الأرب 1/ 357.",
    "book_id": "405",
    "new_page_number": 60
  },
  {
    "serial_number": "6303909",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 40,
    "volume_number": 1,
    "text": "ومرتع خيل، وصائد بحر، وقانص وحش وملاح سفينة، وحادي إبل، ومفازة رمل وسهلا وجبلا في أقل من ميل في ميل (1) . وذكر أنه صورت للرشيد صورة الدنيا فما استحسن منها غير بلد أسيوط، وذلك أن مساحته ثلاثون ألف فدان في دست واحد، لو قطرت قطرة فاضت على جميع جوانبه، ويزرع فيه الكتان والقمح والقرط (2) وسائر أصناف الغلات فلا يكون على وجه الأرض بساط أعجب منه، ويسايره من جانبه الغربي جبل أبيض على صورة الطيلسان (3) ، كأنه قرنان، ويحف به من جانبه الشرقي النيل، كأنه جدول فضة، لا يسمع فيه الكلام من شدة أصوات الطير. وأجمع الناس أنه ليس على وجه الدنيا بساط قرط فيه خيل موقوفة وخيام مضروبة، ونتاج، ومهارى، وسائمة، وقهارمة، إلا بمصر.  [ذكر ما ورد في نيل مصر] وأما نيلها، فروى ابن لَهِيعة: أن معاوية بن أبي سفيان قال لكعب: أسألك بالله العظيم يا كعب، هل تجد لنيل مصر في كتاب الله خيرًا؟ قال: إي والذي فلق البحر لموسى عليه السلام! إني لأجد في كتاب الله عز وجل أن الله يوحى إليه عند جريه: إن الله يأمرك أن تجري كذا وكذا، فاجر على اسم الله، ثم يوحى إليه عند انتهائه: إن الله يأمرك أن ترجع، فارجع راشدًا (4) . وروى عن النبي صلى الله عليه وسلم أنه قال: \"أربعة أنهار من الجنة سيحان وجيحان والنيل والفرات\" (5) .",
    "foot_note": "1. ابن سعيد: المغرب، ص 3 - 4 وهو ينقل عن ابن الكندى. \n2. القرط: علف الماشية. \n3. الطيلسان: ضرب من الأوشحة يحيط بالبدن، خال من التفصيل والحياكة. \n4. ذكر ذلك: المقريزى في الخطط 1/ 50، وابن ظهيرة في: محاسن مصر والقاهرة 158، والسيوطى في: حسن المحاضرة 1/ 20، وابن تغرى بردى في: النجوم الزاهرة 1/ 33. \n5. أخرجه صاحب الكنز برقم 35335.",
    "book_id": "405",
    "new_page_number": 61
  },
  {
    "serial_number": "6303910",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 41,
    "volume_number": 1,
    "text": "ورى أن الله تعالى خلق نيل مصر معادلا لأنهار الدنيا ومياهها، فحين يبتدئ في الزيادة تنقص كلها لمادته، وحين ينقصى تمتلئ كلها. وذكر أبو قبيل (1) ، أن نيل مصر في زيادته يفور كله من أوله إلى آخره. وقال ابن لهيعة: كان لنيل مصر قطيعة (2) على كور مصر، مائة ألف وعشرين ألف رجل، معهم المساحى (3) ، والآلات سبعون ألفًا للصعيد، وخمسون ألفًا لأسفل الأرض لحفر الخلج وإقامة الجسور والقناطر (4) وسد الترع، وقطع القضب (5) والحلفاء، وكل نبت مضر بالأرض. وقال محفوظ (6) بن سليمان: إذا تم الماء ست عشرة (7) ذراعًا فقد وفى خراج مصر، فإذا زاد بعد ذلك ذراعًا واحدة زاد في الخراج مائة ألف دينار لما يروى من الأعالي (8) ، فإن زاد بعد ذلك ذراعًا أخرى نقص مائة ألف من",
    "foot_note": "1. هو حُيَيّ بن هانئ بن ناضر - بالضاد المعجمة - أبو قبيل المعافرى: قدم مصر زمن معاوية وكان له علم بالملاحم والفتن. توفى بالبرلس سنة 178 هـ (المزى: تهذيب الكمال 7/ 490). \n2. القطيعة بمعنى الفريضة، أي عدد العمال الذين يفرض على الكور أعدادهم. \n3. المساحى: جمع مسحاة؛ وهى أداة تجرف بها الأرض. \n4. إلى هنا انتهى الموجود من نسخة \"ج\". \n5. القضب: كل شجرة طالت وبسطت أغصانها. \n6. محفوظ بن سليمان، عامل خراج مصر في عهد هارون الرشيد ولاه سنة 187 هـ ثم عزله؛ وأعيد في عهد الخليقة الواثق، واستمر في ولايته بمصر حتى مات سنة 254 هـ (الكندى: ولاة مصر 166، 167 وابن إياس 1/ 158، 159). \n7. في أ \"إذا تم النيل عشرون ذراعا\" والمثبت في ب ومثله لدى ابن ظهيرة ص 160 من قول محفوظ بن سليمان كذلك. وانظر المقريزى في الخطط 1/ 60. \n8. في أ \"من الأعمال\" والمثبت في ب.",
    "book_id": "405",
    "new_page_number": 62
  },
  {
    "serial_number": "6303911",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 42,
    "volume_number": 1,
    "text": "الخراج، لما يستجر (1) من البطون (2) . وذكر ابن عُفَير، أن عمر بن الخطاب كتب إلى عمرو بن العاص: بسم الله الرحمن الرحيم من عبد الله عمر أمير المؤمنين إلى عمرو بن العاص. سلام عليك؛ فإني أحمد إليك الله الذي لا إله إلا هو، أما بعد، فإني فكرت في بلدك فإذا أرضك أرض واسعة عريضة رفيعة، قد أعطى الله أهلها عددًا وجلدًا وقوة في بر وبحر، قد عالجتها الفراعنة، وعملوا فيها عملا محكمًا، مع شدة عتوهم، فعجبت من ذلك، فأحب أن تكتب إلى بصفة مصر كأني أنظر إليها (3) . فكتب إليه عمرو بن العاص: بسم الله الرحمن الرحيم. لعبد الله الذي لا إله إلا هو، أما بعد، فقد بلغني كتابك وقرأته وفهمته، وأما ما ذكرت فيه من صفة مصر، فإن كتابي سيكشف عنك عمى (4) الخبر، ويرمى على بالك بنافذ البصر، إن مصر وما أحببت أن تعلمه من صفتها، تربة سوداء، وشجرة خضراء بين جبل أغبر ورمل أعفر، قد اكتنفها معدن (5) رفقها، ومحط رزقها، ما بين أسوان، إلى منشأ البحر، في سح (6) النهر، مسيرة الراكب شهرًا، كأن ما بين جبلها ورملها بطن أقب (7) ، وظهر أجب، يخط فيه نهر مبارك الغدوات، ميمون البركات، يسيل بالذهب، ويجري بالزيادة والنقصان كمجاري الشمس والقمر، له أيام تسيل إليه عيون الأرض وينابيعها مأمورة بذلك، حتى إذا ربا وطما (8) ،",
    "foot_note": "1. المستبحر: كل أرض وطيئة نفذ إليها الماء ولم يجد مصرفا حتى فات أوان الزرع والماء باق على الأرض (الخطط 1/ 101). \n2. المقريزى: الخطط 1/ 60. \n3. حسن المحاضرة 1/ 147. \n4. في: أ \"غطاء\"، والمثبت في: ب. \n5. معدن رفقها: موضع عملها. \n6. سح النهر: تدفقه. ولدى ابن زولاق \"تيح النهر\" أي تمايله. \n7. بطن أقب: ضامر. وأجب: مقطوع. \n8. ربا وطما: زاد وارتفع.",
    "book_id": "405",
    "new_page_number": 63
  },
  {
    "serial_number": "6303912",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 43,
    "volume_number": 1,
    "text": "واصلخم (1) لججه، واغلولب (2) عبابه، كانت القرى بما أحاط بها كالربا لا يوصل (3) من بعضها إلى بعض إلا في السفائن والمراكب، ولا يلبث إلا قليلا حتى يكون كأول ما بدأ من جريه وأول ما طما من شربه، وحتى تستبين فنونها ومتونها (4) ، ثم تنتشر فيه أمة محقورة (5) ، قد رزقوا على أرضهم جلدًا وقوة، لغيرهم ما سعوا (6) به من كدهم بلا حمد ينالهم من ذلك، يسقون سهل الأرض وخرابها وروابيها، ثم يلقون فيها من صنوف الحب ما يرجون به التمام من الرب، وما يلبث إلا قليلا حتى يشتد، ثم تسيل قنواته وتصفر، يسقيه من تحته الثرى ومن فوقه الندى، أو سحاب منهمر بالأرائك مستدر، ثم في هذا الزمان من زمانها يغنى ذبابها (7) ، ويبدأ في صرامها، فبينما هي مدرة سوداء إذا هي لجة زرقاء، ثم غوطة خضراء، ثم ديباجة رقشاء (8) ، ثم فضة بيضاء، فتبارك الله أحسن الخالقين، الفعال لما يشاء. وإن خير ما اعتمدت عليه في ذلك شكر الله عز وجل يا أمير المؤمنين، على (9) ما أنعم عليك منها، فأدام الله لك النعمة والكرامة في أمورك كلها والسلام. وأجمع أهل العلم أنه ليس في الدنيا نهر أطول مدى من النيل، يسير",
    "foot_note": "1. اصلخم: اشتد. \n2. اغلولب: التف. \n3. في: أ \"لا يرحل\"، والمثبت في: ب ومثله لدى ابن ظهيرة في فضائل مصر ص 114. \n4. فنونها ومتونها: أي طرقها وظهورها. \n5. محقورة: ذليلة؛ لأن الرومان كانوا يحتقرونهم وبهذا المعنى أيضا قوله: لغيرهم ما سعوا به من كدهم (ابن ظهيرة: الفضائل الباهرة ص 115 هامش 3). \n6. في: أ \"ما شقوا به\"، والمثبت في: ب. \n7. أي يعظم محصولها. \n8. الرقشاء: المنقطة ببياض وسواد. \n9. ذكر ذلك، ابن ظهيرة في: محاسن مصر والقاهرة 114، وابن تغرى بردى في: النجوم الزاهرة 1/ 37.",
    "book_id": "405",
    "new_page_number": 64
  },
  {
    "serial_number": "6303913",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 44,
    "volume_number": 1,
    "text": "مسيرة شهر في بلاد الإِسلام وشهرين في بلاد النوبة وأربعة أشهر في الخراب حيث لا عمارة، إلى أن يخرج من جبل القمر خلف خط الاستواء (1) . وليس في الدنيا نهر يصب من الجنوب إلى الشمال إلا هو وليس نهر يصيب في بحر الروم والصين غير نيل مصر. وليس في الدنيا نهر يزيد ويمد في أشد ما يكون من الحر حين تنقص أنهار الدنيا وعيونها غير نيل مصر، وكلما زاد الحر كان أقوى لزيادته، وليس في الدنيا نهر يزيد بترتيب غير نيل مصر (2) . وليس في الدنيا نهر يزرع عليه ما يزرع على نيل مصر، ولا يجبي من خراج نهر من أنهار الدنيا ما يجبي من خراج النيل (3) .  [فضل مقبرة مصر] وأما فضل (4) مقبرتها فذكر أهل العلم أن الطور من المقطم وأنه داخل فيما وقع عليه القدس في قوله تعالى: {وَنَادَيْنَاهُ مِنْ جَانِبِ الطُّورِ الْأَيْمَنِ وَقَرَّبْنَاهُ نَجِيًّا} [مريم: 52]. وقال تعالى: {إِنَّكَ بِالْوَادِ الْمُقَدَّسِ طُوًى} (5) [طه: 12]. قال كعب: كلم الله تعالى موسى من الطور إلى أطراف المقطم من القدس، وقال تبيع (6) : منازل الفسطاس في القدس. وروى أن موسى عليه السلام سجد، فسجدت معه كل شجرة من المقطم إلى طوى. ويروى أنه مكتوب في التوراة: وادي (7) فتح مقدس جديد - يعني - وادي",
    "foot_note": "1. أورده ابن ظهيرة، ص 159 نقلا عن ابن الكندى. \n2. أورده ابن ظهيرة من ص 159 نقلا عن ابن الكندى. \n3. أورده ابن ظهيرة ص 159 نقلا عن ابن الكندى. \n4. النصوص الآتية في فضل مقبرة مصر، روى كثيرا منها نقلا عن ابن الكندى: المقريزى في الخطط 1/ 124، والسيوطى في: حسن المحاضرة 1/ 138، وابن سعيد في: المغرب 11، والقلقشندى في: صبح الأعشى 3/ 306، وابن ظهيرة في: محاسن مصر والقاهرة 108. \n5. طوى: اسم الوادى. \n6. هو تبيع بن عامر الكلاعى، (الخطط 1/ 24). \n7. أ \"وإذا فتح\" وفى ب \"فإذا فتح\" والمثبت لدى ابن سعيد في المغرب ص 11 وهو ينقل عن ابن الكندى.",
    "book_id": "405",
    "new_page_number": 65
  },
  {
    "serial_number": "6303914",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 45,
    "volume_number": 1,
    "text": "[مسجد] (1) موسى عليه السلام بالمقطم عند مقطع الحجارة، وأن موسى عليه السلام كان يناجي ربه بذاك الوادي. وروى أسد بن موسى قال: شهدت جنازة مع ابن لَهِيعة، فجلسنا حوله، فرفع رأسه، فنظر إلى الجبل، فقال: إن عيسى بن مريم عليه السلام مر بسفح هذا الجبل، وعليه جبة صوف، وقد شد وسطه بشريط، وأمه إلى جانبه، فالتفت إليها وقال: يا أماه هذه مقبرة أمة محمد صلى الله عليه وسلم. وبينما عمرو بن العاص يسير في سفح المقطم ومعه المقوقس، فقال له عمرو: ما بال (2) جبلكم هذا أقرع ليس عليه نبات كجبال الشام، فلو شققنا في أسفله نهرًا من النيل وغرسناه نخلا؟ فقال المقوقس: وجدنا في الكتب أنه كان أكثر الجبال أشجارًا ونباتًا وفاكهة، وكان ينزله المقطم بن مصر بن بيصر بن حام بن نوح عليه السلام، فلما كانت الليلة التي كلم الله تعالى فيها موسى عليه السلام، أوحى إلى الجبال؛ إني مكلم نبيًا من أنبيائي على جبل منكم، فسمعت الجبال كلها وتشامخت، إلا جبل بيت المقدس، فإنه هبط وتصاغر، فأوحى الله تعالى إليه لم فعلت ذلك؟ وهو به أخبر، فقال: إعظامًا وإجلال لك يا رب! قال: فأمر الله الجبال أن يحيوه، كل جبل مما عليه من النبت، وجاد (3) له المقطم بكل ما عليه من النبت حتى بقى (4) كما ترى، فأوحى الله تعالى إليه إني معوضك على فعلك بشجر الجنة أو غراسها، فكتب بذلك عمرو بن العاص إلى عمر بن الخطاب رضي الله عنهما (فكتب إليه (5) ): إني لا أعلم شجر (6) الجنة أو غراسها",
    "foot_note": "1. تكملة عن ابن سعيد في المغرب، ص 11 وهو ينقل عن ابن الكندي. \n2. أ \"وسأل عمرو بن العاص عن سفح المقطم ومعه المقوقس فقال \n…. \" والمثبت رواية ب وهى تتفق مع رواية ابن عساكر التي أخرجها في تاريخه عن سفيان بن وهب الخولانى (حسن المحاضرة 1/ 38). \n3. في الأصل \"وجاء\" والمثبت لدى ابن سعيد في المغرب والسيوطى في حسن المحاضرة وهما ينقلان عن ابن الكندى. \n4. في: أ \"حتى صار كما ترى\"، والمثبت في: ب. ومثله في المغرب وحسن المحاضرة نقلا عن ابن الكندى. \n5. ساقط من: أ، وهو في: ب. والسيوطى في حسن المحاضرة. \n6. في الأصل \"شجرة\" والمثبت لدى ابن سعيد في المغرب ص 12 والسيوطى في =",
    "book_id": "405",
    "new_page_number": 66
  },
  {
    "serial_number": "6303915",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 46,
    "volume_number": 1,
    "text": "لغير المسلمين، فاجعله لهم مقبرة، ففعل، فغضب المقوقس من ذلك، وقال لعمرو: ما على هذا صالحتني! فقطع له عمر قطيعًا نحو بركة الحبش يدفن فيه النصارى (1) . وروى عبد الله بن لهيعة عن عَيَّاش (2) بن عباس أن كعب الأحبار سأل رجلا يريد [السفر (3) ] إلى مصر، فقال له: أهد لي تربة من سفح مقطمها، فأتاه منه بجراب، فلما حضرت كعبًا الوفاة أمر به ففرش في لحده تحت جنبه (4) . والإجماع [على (5) ] أنه ليس في الدنيا مقبرة أعجب منها ولا أبهى ولا أعظم ولا أنظف (6) من أبنيتها وقبابها وحجرها، ولا أعجب تربة منها، كأنها الكافور (والزعفران (7) ) مقدسة في جميع الكتب، وحين تشرف عليها تراها كأنها مدينة بيضاء، والمقطم عال عليها كأنه حائط من ورائها (8) .  [الخواص والعجائب التي بمصر] وأما الخواص التي بها والعجائب والبركات والحكم، فجبلها المقدس، ونيلها المبارك، وبها الطور حيث كلم الله تعالى موسى، وبها الوادي المقدس، وبها ألقى موسى عصاه (9) ، وبها فلق البحر لموسى، وبها ولد موسى وهارون",
    "foot_note": "1. = حسن المحاضرة 1/ 139، وكلاهما ينقل عن ابن الكندى. \n1. أورده السيوطى بنصه في حسن المحاضرة 1/ 138 عن ابن الكندى وما بين الحاصرتين منه وانظر: أيضا ابن سعيد في المغرب، ص 11 - 12 وهو ينقل عن ابن الكندى. \n2. هو: عياش بن عباس القتبانى أبو عبد الرحيم المصرى؛ عن بكير بن الأشج، وعنه حيوة بن شريح\" والليث (حسن المحاضرة 1/ 277). \n3. تكملة عن: حسن المحاضرة. \n4. في: أ \"تحت جثته\" والمثبت في: ب، وحسن المحاضرة 1/ 139. \n5. تكملة عن الخطط. \n6. في: أ \"ولا أنظف ولا أعلى\" والمثبت في: ب\" والخطط. \n7. ساقط من: ب\" وهو في: أ. \n8. الخطط 2/ 244. \n9. في: ب \"الذي ألقى موسى به عصاه\"، والمثبت في أ، والنجوم الزاهرة.",
    "book_id": "405",
    "new_page_number": 67
  },
  {
    "serial_number": "6303916",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 47,
    "volume_number": 1,
    "text": "وعيسى (1) عليهم السلام. وبها كان ملك يوسف وبها النخلة التي ولدت مريم عيسى تحتها (بسِدْمَنْت (2) ) من كورة أَهْنَاس (3) ، وبها اللبخة التي أرضعت عندها مريم عيسى بأشمون، فخرج من هذه اللبخة الزيت، وبها مسجد إبراهيم، ومسجد مارية أم إبراهيم (سرية (4) ) رسول الله صلى الله عليه وسلم بحفن (5) ، أوصت أن يبني بها مسجد فبنى. وبها من الأبنية وآثار الحكمة: البرابي والهرمان (6) ، وليس على وجه الأرض بناء باليد حجرًا فوق حجر أطول منهما وجاءت الأخبار أنهما قبرا هرمس وأغاثيمون، والصابئة (7) تحجهما من حران (8) .",
    "foot_note": "1. هذا القول وهم؛ فالذى أجمعت عليه كتب الدين والتاريخ أن عيسى ولد بقرية بيت لحم ببلاد فلسطين وليس بمصر. (الخطط 1/ 27). \n2. ساقط من: أ، وهو في: ب. وسدمنت: من القرى القديمة، وضعت أحيانا في الفيوم، وأحيانا حول بحيرة مريوط، وأحيانا من أعمال البهنساوية، وسميت في العهد العثمانى بسدمنت الجبل لمجاورتها للجبل الغربى (رمزى: القاموس الجغرافى ق 2 ج 3 ص 161). \n3. أهناس: على غربى النيل ليست ببعيدة عن القسطاط، وذكر أن المسيح ولد في أهناس، وأن النخلة المذكورة في القرآن موجودة هناك، وأن مريم أقامت بها إلى أن نشأ المسيح (ياقوت 1/ 284) ولدى السيوطى في حسن المحاضرة 2/ 334 نقلا عن الكندى \"وبها النخلة التي ولدت مريم عيسى تحتها بريف من كورة أهناس\". \n4. ساقط من: ب\" وهو في: أ. \n5. سبق التعريف بها. \n6. في: أ \"الأهرام\"، والمثبت في: ب\" والنجوم الزاهرة ج 1 ص 38 وورد في أبعد كلمة الأهرام: ما لا نظير له في الدنيا\" وقد أورد ابن تغرى بردى هذا النص في النجوم الزاهرة 1/ 38 بدون هذه العبارة، متفقا مع رواية ب. \n7. الصابئة: قوم يعبدون الكواكب، ويزعمون أنهم على ملة نوح (الشهرستانى: الملل والنحل 1/ 230 وما بعدها). \n8. حران: مدينة قديمة كانت قصبة ديار مُضَر، وهى اليوم بتركيا، وكانت منازل الصابئة وهم الحرانيون. ويقال إنها كانت أول مدينة بنيت في الأرض بعد الطوفان. البلاذرى: فتوح البلدان ص 712 ياقوت ج 2 ص 235 (طبعة بيروت). لسترنج: بلدان الخلافة الشرقية ص 134. ويضيف السيوطى في حسن المحاضرة 1/ 76 أن الصابئة كانوا \"يذبحون عندها الديكة والعجول السود ويتبخرون بدخن\".",
    "book_id": "405",
    "new_page_number": 68
  },
  {
    "serial_number": "6303917",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 48,
    "volume_number": 1,
    "text": "قال عمر بن أبي عمر: أنا لقيت من الصابئة من حجمها (1) . وبها منارة الإِسكندرية، وبها عمود عين شمس. [وبها (2) ] صدع أبي قير الذي تفر إليه طير [البواقيرات في يوم من السنة كان معروفًا فكلما أدخل بوقير منها منقاره في الصدع مضى لسبيله فلا يزال يفعل ذلك حتى يلتقي الصدع على بوقير منها فيجسه (3) ] ولا يزال معلقًا حتى تذروه الرياح. وبها حائط العجوز من العريش إلى أسوان؛ يحيط بأرض مصر كلها. وبالنيل السمكة التي تسمى الرَّعادة، إذا وضع الرجل الجلد يده عليها لم يتمالك أن يضطرب جسمه كله اضطرابًا شديدًا. وبها مجمع البحرين، وهو البرزخ الذي ذكره الله تعالى فقال: {مَرَجَ الْبَحْرَيْنِ يَلْتَقِيَانِ (19) بَيْنَهُمَا بَرْزَخٌ لَا يَبْغِيَانِ} [الرحمن: 19، 20]. وقال تعالى: {وَجَعَلَ بَيْنَ الْبَحْرَيْنِ حَاجِزًا} [النمل: 61]، وهما بحر الصين وبحر الروم، والحاجز بينهما مسيرة ليلة ما بين القلزم والفرما. وليس يتقاربان في بلد من البلدان تقاربهما بهذا الموضع، وبينهما في السفر مسيرة شهور. وليس بالدنيا بلد من البلدان يأكل أهله صيد البحر طريًا غير أهل مصر. وبها من الطرز والقصب التنيسي والثوب الدَّبِيقِيَ (3) ما ليس بغيرها، وليس في الدنيا طراز يبلغ الثوب الساذج منه الذي ليس فيه ذهب مائة دينار غير ثوب تنيس ودمياط. ويقال: إنه ليس في الدنيا منزل إلا وفيه من ثوب تنيس ولو خرقة. وبها الثياب الصوف والأكسية المرعز (4) ، وليس هي في الدنيا إلا بمصر.",
    "foot_note": "1. هذا القول من أقوى الأدلة على أن كتاب الفضائل لابن الكندى عمر وليس لأبيه. \n2. النص فيه تحريف وسقط في الأصل، وقد اعتمدنا في تكملة النص وتصويبه على ما جاء بالخطط 1/ 31. \n3. نسبة إلى دبيق، قرية من قرى مصر. \n4. المرعز كالصوف، يخلص من بين شعر العنز.",
    "book_id": "405",
    "new_page_number": 69
  },
  {
    "serial_number": "6303918",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 49,
    "volume_number": 1,
    "text": "وذكر بعض أهل مصر (1) أن معاوية لما كبر كان لا يدفأ، فأجمعوا أنه لا يدفئه إلا أكسية تعمل في مصر، من صوفها المرعز العسلي غير مصبوغ، فعمل له منها عدد، فما احتاج منها إلا إلى واحد. ولهم طراز (البهنسا (2) ) من الستور والمضارب ما يفرقون به طراز أهل الدنيا (3) . ولهم النتاح العجيب من الخيل والبغال والحمير ما يفوق نتاج أهل الدنيا، وليس في الدنيا فرس في نهاية الصورة (4) في العنق غير الفرس المصري، وليس (5) في الدنيا فرس لا يردف غير المصري، وسبب ذلك قصر ساقية وبلاغة صدره وقصر ظهره، وذكر أن الوليد عزم على أن يجري الخيل ويمتحن خيل البلدان، فكتب إلى سائر الأمصار أن يتخير له خيل كل بلد، ويتوجه به إليه، فلما اجتمعت عرضت عليه، فمرت به المصرية، فلما رآها دقيقة العصب، لينة المفاصل والأعطاف، قال: هذه خيل ما عندها طائل (6) ، فقال له عمر بن عبد العزيز وهو جالس معه: وأين الخير كله إلا لهذه وعندها! فقال له: ما تترك تعصبك يا أبا حفص لمصر على كل حال، فلما أجريت الخيل جاءت المصرية كلها سابقة ما خالطها غيرها. ولهم معدن الذهب، يفوق (معدنهم (7) ) كل معدن. ولهم معدن الزمرد، وليس في الدنيا زمرد إلا معدن بمصر، ومنها يحمل إلى سائر الدنيا. ولهم القراطيس، وليس هي في الدنيا إلا بمصر (ولهم القمح اليوسفي، وليس هو في الدنيا إلا بمصر (8) ). ولهم زيت الفجل ودهن البلسان",
    "foot_note": "1. في: أ \"العلم\"، والمثبت في: ب. \n2. ساقط من: ب، وهو في: أ. \n3. قارن المقريزى: الخطط ج 1 ص 204. \n4. في: ب \"في نهاية صورة العتيق\"، والمثبت في: أ، وحسن المحاضرة. \n5. النصوص الآتية ذكرها السيوطى في حسن المحاضرة 2/ 328 ونسبها إلى الكندى. \n6. القدرة والفائدة. راجع ابن ظهيرة ص 132. \n7. ساقط من: ب، وهو في: أ. \n8. ساقط من: ب، وهو في: أ.",
    "book_id": "405",
    "new_page_number": 70
  },
  {
    "serial_number": "6303919",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 50,
    "volume_number": 1,
    "text": "والأفيون والأبرميس (1) وشراب العسل والبسر البرني (2) الأحمر واللبخ والخس والكبريت، والريش والشمع والعسل وخل الخمر والترمس والجُلْبَان (3) والذرة والنيدة (4) والأُتْرُجّ (5) الأبلق والفراريج السرمكية (6) ، وذكر أن مريم عليه السلام شكت إلى ربها قلة لبنها فألهمها أن عملت النيدة فأطعمتها عيسى عليه السلام. وذكر أهل العلم أنه لا يكاد يرى مترهبو الشام إلا عمشًا من أكلهم العدس ورهبان مصر سالمون من ذلك لأكلهم الجلبان، ولهم البقر الخَيْسِيَّة (7) المؤبدة للحلب فقط، وهي أحسن البقر صورة، وبقر مصر ليس في الدنيا بقر أعظم منها، حتى أن العفو (8) منها يساوي أكثر من عفو ثور من غيرها. ولهم حطب السنط والأبنوس والقرط الذي تعلفه الدواب. وذكر بعض أهل العلم أنه يوقد بحطب السنط (9) عشرين سنة في الكانون أو التنور فلا يوجد له رماد طول هذه المدة. وقال بعض أهل العلم: ليس في الدنيا شجرة إلا وهي بمصر، عرفها من عرفها، وجهلها من جهلها.",
    "foot_note": "1. نوع من السمك كان يعيش في بحيرة تنيس. \n2. تمر أصفر مدور، وهو أجود التمر. \n3. الجلبان: نبات عشبى من الفصيلة القرنية، بعضها تؤكل بذوره، وبعضها يزرع لأزهاره. وهو من أغذية الأكرة والفلاحين. ابن البيطار ج 1 ص 164. المعجم الوسيط ج 1 ص 133. \n4. النيدة أو النيدا: نوع من الفطائر كان يصنع بمنفلوط وغيرها من القمح بعد تركه أياما في الماء، ثم تجفيفه وطحنه، ثم وضعه تدريجيا في إناء به ماء ساخن لينضج (قاموس دوزى 1/ 741). \n5. الأتْرُجُّ: شجر يعلو، ناعم الأغصان والورق والثمر، وثمره كالليمون الكبار، وهو ذهب اللون، ذكى الرائحة، حامض الماء. وهو كثير بأرض العرب؛ وتبقى ثمرته عليه جميع السنة. ابن البيطار ج 1 ص 10. المعجم الوسيط ج 1 ص 4. \n6. لدى السيوطى في حسن المحاضرة 2/ 328، وهو ينقل عن الكندى \"الزبلية\". \n7. إلى هنا انتهى الموجود من نسخة (ب). والخيسية: نسبة إلى بلدة خيس من كور الحوف الغربى بمصر التي اشتهرت فيما يبدو بنوع خاص من البقر (راجع ياقوت، مادة: خيس). \n8. العفا والعفو ولد الحمار ويطلق على ولد البقر. \n9. السنط قرظ ينبت في الصعيد وهو حطبهم وهو أجود حطب استوقد به الناس.",
    "book_id": "405",
    "new_page_number": 71
  },
  {
    "serial_number": "6303920",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 51,
    "volume_number": 1,
    "text": "وبوجد بمصر في كل وقت من الزمان من المأكور والمأدوم والمشروب والمشموم وسائر البقول والخضر، جميع ذلك في الصيف والشتاء، لا ينقطع منه شيء لبرد ولا لحر، يوجد ذلك كله في الصيف ويوجد بعينه في الشتاء غير مفقود منه شيء واحد. وذكر أن بختنصر قال لابنه بلسطان: ما أردت سكنى مصر إلا لهذه الخصال وبلسطان هو الذي بنى قصر الشمع (1) . وقال بعض من سكن مصر: لولا ماء طوبة، وخروف أمشير، ولبن برمهات، وورد برمودة، ونبق بشنس، وتين بئونة، وعسل أبيب، وعنب مسرى، ورطب توت، وسمك كيهك، ما سكنت مصر. ومصر مع ذلك فرضة (2) مكة والمدينة وساحلهما، وفرضة صنعاء وعدن وعُمَانُ (3) والشِّحر (4) والسند والهند والصين وجزائر الصين وسَرَنْدِيب (5) وغيرها، يجلب العطر والجواهر والطرائف والآلات في البحر حتى توافى المراكب بالقلزم. وهي فرضة بحر الروم من الشام كلها، وبلد الروم من أَنْطَاكِيَة إلى ما وراءها من قُسْطَنْطِينَة ورومية وبلد الإِفرنجة وأنطابلس (6) وطرابلس والقيروان",
    "foot_note": "1. قصر الشمع: أحدث داخل الفسطاط بعد خراب مصر على يد بختنصر، وكان يوقد عليه الشمع في رأس كل شهر ليعلم الناس أن الشمس قد انتقلت من البرج الذي كانت فيه، وقيل إنه بنى للفرس بمثابة بيت نار هيكل القبة المعروفة بقبة الدخان (خطط المقريزى 1/ 287). \n2. هي من البحر محط السفن. \n3. عُمَان: بضم أوله وتخفيف ثانيه وآخره نون: اسم كورة عربية على بحر اليمن والهند (ياقوت). \n4. الشحر: صقع على ساحل بحر الهند (المحيط الهندي) من ناحية اليمن. قال الأصمعى: هو بين عدن وعمان (ياقوت). \n5. سرنديب: جزيرة عظيمة بأقصى بلاد الهند (ياقوت). \n6. أنطابلس: مدينة بين الإسكندرية وبرقة. (معجم البلدان 1/ 381).",
    "book_id": "405",
    "new_page_number": 72
  },
  {
    "serial_number": "6303921",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "فضائل مصر المحروسة",
    "edition": "الأولى، 1417 هـ - 1997 م",
    "publisher": "مكتبة الخانجي- القاهرة",
    "page_number": 52,
    "volume_number": 1,
    "text": "وتاهرت (1) . وسِجِلْمَاسَة (2) والسوس (3) وطنجة (4) والأندلس وجزائر البحر صِقِلِّيَّة (5) وأَقْرِيطِش (6) ، وقبرس، ورودس. يحمل إليها رقيق هذه البلدان كلها من الجواري والغلمان والديباج والحرير والمصطكي والمَيْعَة (7) والمرجان والعنبر والزعفران وسائر أصناف التجارات، ويحمل من مصر إليها مثل ذلك، ولا يقصدون بلداً سواها، ولا يؤمون غيرها، فلأهلها خيار ذلك كله، ولسائر الناس حثالته، فبارك الله، لأبي المسك فيما ولاه وهناه بما أعطاه، وأوزعه على ذلك شكره، وألهمه خشيته، وأصلح له جنده ورعيته. تم الكتاب بحمد الله وعونه وحسن توفيقه، وصلى الله على سيدنا محمد وآله وصحبه أجمعين.",
    "foot_note": "1. تاهرت: اسم لمدينتين متقابلتين بأقصى المغرب يقال لإحداهما: تاهرت القديمة وللأخرى تاهرت المحدثة، وهى بين تلمسان وقلعة بنى حماد (نفس المصدر 1/ 813). \n2. سجلماسة: مدينة في جنوبى المغرب في طرف بلاد السودان، أهلها من أغنى الناس وأكثرهم مالا؛ لأنها على طريق من يريد غانة التي هي معدن الذهب، ولنسائهم يد صناع في غزل الصوف فهن يعملن منه كل حسن عجيب بديع من الأزر تفوق القصب الذي بمصر (ياقوت 3/ 192). \n3. السوس: بلد بالمغرب كانت الروم تسميها قمونية، وقيل: السوس بالمغرب، كورة مدينتها طنجة (ياقوت 7/ 280). \n4. طنجة: بلد على ساحل بحر المغرب مقابل الجزيرة الخضراء وهى من المدن القديمة. وهى آخر حدود إفريقية (ياقوت 4/ 43). \n5. من جزائر بحر المغرب مقابلة إفريقية، وهى جزيرة خصيبة كثيرة البلدان والقرى والأمصار (ياقوت 3/ 416). \n6. اسم جزيرة في بحر الروم، يقابلها من بر إفريقية لوبية، وهى جزيرة كبيرة فيها مدن وقرى، ثم فتحها في أيام المأمون سنة 201 هـ (ياقوت 1/ 236). \n7. المَيْعَة: عطر طيب الرائحة وصمغ يسيل من بعض الشجر (المعجم الوسيط).",
    "book_id": "405",
    "new_page_number": 73
  }
]