[
  {
    "text": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)\nAuthor: محمد بن صالح بن هادي الهمامي\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 1
  },
  {
    "text": "sn: 799\nbook_title: التوجيهات الصحيحة للنوازل العقدية المتعلقة بوباء كورونا - كوفيد ١٩ (COVID-١٩)\nbook_link: https://shamela.ws/book/648\nbook_id: 648\nauthor_name: محمد بن صالح بن هادي الهمامي\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/3148\nauthor_ID: 3148\neditor: Null\npublisher: Null\nedition: عام النشر: 1443 هـ - 2021 م\npages: 100\nvolumes: Null\npagination: [ترقيم الكتاب موافق للأصل الإلكتروني]\ncategory: العقيدة\ncategory_id: 1",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 2
  },
  {
    "serial_number": "34374",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Doctrine Book: Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19) Prepared by: Dr. Muhammad bin Saleh bin Hadi Al-Hamami Year of Publication: 1443 AH - 2021 AD Number of Pages: 100 [The book's numbering matches the electronic original] Date of publication on Al-Shamela: 7 Rabi' Al-Thani 1443\nBook: Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19) Prepared by: Dr. Muhammad bin Saleh bin Hadi Al-Hamami Year of Publication: 1443 AH - 2021 AD Number of Pages: 100 [The book's numbering matches the electronic original] Date of publication on Al-Shamela: 7 Rabi' Al-Thani 1443\nPrepared by: Dr. Muhammad bin Saleh bin Hadi Al-Hamami Year of Publication: 1443 AH - 2021 AD Number of Pages: 100 [The book's numbering matches the electronic original] Date of publication on Al-Shamela: 7 Rabi' Al-Thani 1443\nYear of Publication: 1443 AH - 2021 AD Number of Pages: 100 [The book's numbering matches the electronic original] Date of publication on Al-Shamela: 7 Rabi' Al-Thani 1443\n[The book's numbering matches the electronic original] Date of publication on Al-Shamela: 7 Rabi' Al-Thani 1443\nDate of publication on Al-Shamela: 7 Rabi' Al-Thani 1443",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 3
  },
  {
    "serial_number": "34375",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19) Prepared by: Dr. Muhammad bin Saleh bin Hadi Al-Hamami",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 4
  },
  {
    "serial_number": "34376",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "Copyrights reserved for the author. 1443 AH - 2021 AD. Media Release Number: 58325620210921",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 5
  },
  {
    "serial_number": "34377",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Introduction: Indeed, all praise is due to Allah, we praise Him, seek His help, and ask for His forgiveness. We seek refuge in Allah from the evils of our own selves and from our bad deeds. Whomever Allah guides, there is none to mislead him, and whomever He misleads, there is none to guide him. I bear witness that there is no deity but Allah alone, who has no partner, and I bear witness that Muhammad is His servant and Messenger, may Allah’s peace and blessings be upon him, his family, his companions, and those who follow them in righteousness until the Day of Judgment. As for what follows. The occurrence of an epidemic is a divine way decreed by the wisdom of the Almighty, and He willed it by His decree and destiny. Nothing happens in this universe except what Allah wills and desires, and He, Glory be to Him, does not lift harm and affliction from the servants and lands unless He wills, when He wills, and how He wills. The epidemic is among the trials with which Allah tests His servants; whoever is patient will have a good reward in this world and a great reward in the Hereafter, and whoever panics has failed in his work in this world and lost his reward in the Hereafter. When an epidemic strikes, servants must turn to Allah alone, seek help and hope from Him alone, and pray to Him alone to lift the affliction; for no one is capable of this affliction nor can anyone repel this epidemic except Allah, and anything else is merely a cause that He, Glory be to Him, approved of occurring and permitted its benefit. It is also incumbent upon them, when an epidemic strikes, to have knowledge and insight into Islamic law regarding the acts of worship or beliefs they perform, and they must beware of innovation or doing what contradicts the fundamentals of religion when performing these acts of worship or beliefs; for through knowledge, doubts that veil the truth are removed, and violations that cause deviation from the religion and distance from the Sunnah are recognized. Epidemics have occurred in Muslim lands in many times and various places, and the first epidemic that occurred in the history of Muslims was the Plague of Amwas (1), which happened during the reign of Caliph Umar, may Allah be pleased with him.",
    "foot_note": "1. A town in Palestine near Jerusalem, from which the plague began in the days of Umar ibn al-Khattab, may Allah be pleased with him, then it spread in the land of Sham, and a countless number of Companions, may Allah be pleased with them, and others died in it, in the year (18 AH). See: Mu'jam al-Buldan, al-Hamawi, (4/ 157 - 158).",
    "book_id": "648",
    "new_page_number": 6
  },
  {
    "serial_number": "34378",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "The Companions, may Allah be pleased with them, dealt with this plague in the most ideal and best way; it was the custom of the Companions, may Allah be pleased with them, that if a calamity befell them, they would gather with their leader and consult about it, research and discuss it, then come out with an opinion in which they agreed with their leader and did not object to him. When Umar, may Allah be pleased with him, went out to Sham, the commanders of the armies, Abu Ubaidah bin Al-Jarrah and his companions, met him and informed him that the epidemic had broken out in the land of Sham. Umar said: Call the early Muhajireen (Emigrants) for me. So he called them and consulted them, informing them that the epidemic had broken out in Sham. They differed; some said: You have come out for a matter, and we do not think you should turn back from it. Others said: You have the rest of the people and the Companions of the Messenger of Allah, peace and blessings be upon him, and we do not think you should expose them to this epidemic. He said: Leave me. Then he said: Call the Ansar (Helpers) for me. So I called them and he consulted them, and they followed the way of the Muhajireen and differed just as they differed. He said: Leave me. Then he said: Call for me whoever is here of the elders of Quraysh from the Emigrants of the Conquest. So I called them, and not two of them differed on him. They said: We think you should return with the people and not expose them to this epidemic. So Umar announced among the people: I am setting out in the morning on a mount, so set out in the morning. Abu Ubaidah bin Al-Jarrah said: Is it fleeing from the decree of Allah? Umar said: If only someone other than you had said it, O Abu Ubaidah? Yes, we flee from the decree of Allah to the decree of Allah. Do you not see that if you had camels that descended into a valley with two sides, one fertile and the other barren, is it not that if you grazed them on the fertile side, you grazed them by the decree of Allah, and if you grazed them on the barren side, you grazed them by the decree of Allah? He said: Then Abdurrahman bin Awf came - and he had been absent for some need - and said: I have knowledge regarding this. I heard the Messenger of Allah, peace and blessings be upon him, say: \"If you hear about it in a land, do not enter it; and if it breaks out in a land while you are there, do not leave it fleeing from it.\" He said: So Umar praised Allah and then departed (1). Many Companions, may Allah be pleased with them, died in this plague, including: Abu Ubaidah bin Al-Jarrah, Mu'adh bin Jabal, Yazid bin Abi Sufyan, Al-Harith bin Hisham, Suhail bin Amr, and Utbah bin Suhail, may Allah be pleased with him (2). Some historians estimated that about twenty-five thousand Muslims died in this epidemic (3).",
    "foot_note": "1. Narrated by Al-Bukhari, in the Book of Medicine, Chapter: What is mentioned about the plague No. (5729), (7/ 130), and Muslim, in the Book of Peace, Chapter: Plague, Omens, Divination, and the like, No. (2219), (4/ 1740). \n2. See: Tarikh al-Tabari, (4/ 60). \n3. See: Al-Bidaya wa'l-Nihaya, Ibn Kathir, (7/ 107).",
    "book_id": "648",
    "new_page_number": 7
  },
  {
    "serial_number": "34379",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "This plague is considered the first doctrinal new occurrence (Nawazil) related to epidemics in the lives of the Companions, may Allah be pleased with them, after the death of the Prophet, peace and blessings be upon him. Their dealing with this epidemic, may Allah be pleased with them, was the ideal dealing based on consultation and unity, and on following (Sunnah) and not innovating. No doctrinal violation or invented innovation occurred from them that contradicted the Sunnah of the Prophet, peace and blessings be upon him. This dealing should be a role model for the Ummah when epidemics strike, and an example to be followed when cosmic events occur and times change. By seeking help from Allah and then reading what was possible to read of the Nawazil, the most important of these occurrences that took place have been identified and limited, and the most important of these incidents that happened with the onset of the Coronavirus epidemic have been tracked. Doctrinal issues related to the Coronavirus epidemic require precision in knowing whether they are a Nazilah (new occurrence) or not, and correct determination of whether they are new in their occurrence or renewed in their content. Definitions of terms, the difference between an epidemic and a plague, an explanation of these Nawazil, a discussion of the deviations that occurred in these Nawazil, and the correct doctrinal direction and the rooted scientific response to these Nawazil will be presented, God willing. This is a statement of the most important doctrinal Nawazil related to the Coronavirus epidemic, which are as follows: * The First Nazilah: Doctrinal violations in graves and places; for treatment from the Coronavirus epidemic. * The Second Nazilah: Uttering violative supplications and remembrances; for treatment from the Coronavirus epidemic. * The Third Nazilah: Tawassul (seeking intercession) through other than Allah; to lift the affliction of the Coronavirus epidemic. * The Fourth Nazilah: Wrong application of legal evidences when the Coronavirus epidemic strikes. * The Fifth Nazilah: Abandoning legal evidences and relying on rational evidences. * The Sixth Nazilah: Calling for reliance on medical treatments only, and abandoning everything related to religion. * The Seventh Nazilah: The belief that the Coronavirus epidemic is mentioned in the Quran. * The Eighth Nazilah: Alleging that the Coronavirus epidemic is man-made. * The Ninth Nazilah: Astrology and claiming knowledge of the unseen regarding the Coronavirus epidemic. * The Tenth Nazilah: Issues related to hearing and obeying the ruler.",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 8
  },
  {
    "serial_number": "34380",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Preface, containing two sections: * First: Definition of doctrinal Nawazil related to the Coronavirus epidemic. * Second: The difference between the Coronavirus epidemic and the plague.",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 9
  },
  {
    "serial_number": "34381",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "First: Definition of doctrinal Nawazil related to the Coronavirus epidemic. Definition of Nawazil: Linguistically: The Nun, Zaa, and Lam form a valid word indicating the descent of something and its falling (1), and 'Nazala bihi al-amr' means: the matter befell him (2). A Nazilah is a severe hardship that descends upon them with a great matter (3), and it is said to be: Calamity and distress from the hardships of time that befall people (4), as the poet said: And many a calamity narrows the youth's ... capability, while with Allah is the way out from it (5). Terminologically: Some scholars used the term Nazilah in its linguistic meaning mentioned above, so it was said to be: The incident that requires a legal ruling (6), or new occurrences for which there is no previous text or ijtihad (7). And it was said to be: The event and incident that befalls a person, whether in the field of acts of worship, transactions, or behavior and morals; where this person resorts to someone to give him a fatwa on the legal ruling for his calamity (8). And it was said: They are the new matters and issues that arise with the development of times and the difference of eras and places (9). For a Nazilah, three things are required: its occurrence and not being hypothetical, its novelty and non-repetition, and the intensity of its urgency in seeking a legal ruling for it; and based on that, its definition is: It is what called for a legal ruling from new occurrences (10).",
    "foot_note": "1. See: Maqayis al-Lugha, Ibn Faris, (5/ 417). \n2. See: Al-Muhkam wa al-Muhit al-A'zam, Ibn Sidah, (9/ 47). \n3. See: Tahdhib al-Lugha, Al-Azhari, (1/ 157). \n4. See: Lisan al-Arab, Ibn Manzur (11/ 659), and Al-Misbah al-Munir, Al-Fayumi, (2/ 600). \n5. The speaker is Ibrahim bin Al-Abbas Al-Suli as mentioned by Al-Tanukhi in the book Al-Faraj ba'd Ash-Shiddah, (5/ 15). \n6. See: Mu'jam Lughat al-Fuqaha, Qal'aji and Qunaybi, p. (471). \n7. See: Manhaj Istinbat Ahkam al-Nawazil al-Fiqhiyyah al-Mu'asirah, Misfer Al-Qahtani, p. (89). \n8. See: Fiqh al-Nawazil wa Qimatuhu at-Tashri'iyyah wa al-Fikriyyah, Hassan Al-Filali, p. (230). \n9. See: Al-Fiqh al-Aqadi li al-Nawazil, Abdul Rahim Samayil Al-Sulami, p. (3). \n10. See: Fiqh al-Nawazil Dirasah Ta'siliyyah Tatbiqiyyah, Muhammad bin Hussein Al-Jizani, (1/ 22 - 24).",
    "book_id": "648",
    "new_page_number": 10
  },
  {
    "serial_number": "34382",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "However, the concept of Nawazil in contemporary issues and questions rarely applies completely to the description of a Nazilah as purely novel, meaning something that has not happened before; mostly what scholars mention in contemporary issues as Nawazil may be described as relative novelty, meaning they are things that have happened before but are renewed. Some of them happened before but have evolved, or the reality surrounding them has changed, or their causes have changed, or people needed them due to necessity or interest; so they became in dire need of being researched again. Accordingly, any doctrinal issue can be termed a Nazilah if one of the following reasons is realized in it: First: Variance in the origin of the doctrinal issue in some aspects; such as a change in its causes, its development, and a change in the reality surrounding it. Second: The occurrence of renewal in the conditions of some doctrinal issues, so that they became like a new Nazilah. Third: Some new doctrinal issues may be Nawazil in the convention of some scholars; according to their own view of the issue. Fourth: When there is an urgent need to seek a sufficient solution for the subject or content of the doctrinal issue. Definition of Doctrine (Aqidah): Linguistically: Derived from 'Al-Aqd': which is tying and tightening strongly, or covenant, or adhering, or confirmation (1), and 'Aqada qalbah' upon something: he did not withdraw from it (2), and 'I'taqadtu kadha': meaning I tied my heart and conscience upon it, until it was said: Doctrine is what a person professes religiously (3). Terminologically: It is the firm belief in Allah, and what is due to Him in His divinity, lordship, names and attributes, and belief in His angels, books, messengers, the Last Day, and destiny, its good and its evil, and in everything brought by the authentic texts from the fundamentals of religion and matters of the unseen and its news, and what the righteous predecessors agreed upon, and submission to Allah Almighty in judgment, command, decree, and legislation, and to His Messenger, peace and blessings be upon him, in obedience and following (4).",
    "foot_note": "1. See: Tahdhib al-Lugha, Ibn Faris, (1/ 134), and Al-Qamus al-Muhit, Al-Fairuzabadi, p. (300), and Lisan al-Arab, (3/ 296). \n2. See: Al-Ain, Al-Farahidi, (1/ 140). \n3. See: Al-Misbah al-Munir, (2/ 421). \n4. See: Mabahith fi Aqidah Ahl al-Sunnah wa al-Jama'ah, Nasser Al-Aql, p. (8).",
    "book_id": "648",
    "new_page_number": 11
  },
  {
    "serial_number": "34383",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "Definition of Epidemics: Linguistically: The source of 'wabu'a', 'wabi'a' and 'waba'a', and 'ard wabi'ah' means: having much epidemic, and 'istawba'a al-ard': he found it unwholesome and became ill in it (1). Terminologically: It is the speed and abundance of death among people (2). And it was said: Every highly contagious disease, spreading rapidly from place to place, affecting humans, animals, and plants (3). An epidemic in medical definition: Is an unusual disease, spreading rapidly, affecting a group of people in a specific area or specific geographical areas at a specific time (4). According to epidemiology specialists, a disease is not called an epidemic unless several matters combine in it, which are as follows: 1 - That it be rapidly spreading. 2 - That it affects a group of people. 3 - That it be in a specific area or areas. 4 - That it be at a specific time. 5 - That it be unusual. 6 - That it leads to death in most cases (5). Definition of Corona: It is a group of viruses that can cause diseases such as the common cold, Severe Acute Respiratory Syndrome (SARS), and Middle East Respiratory Syndrome (MERS). A new type of coronavirus was discovered after it was identified as the cause of the spread of one of the",
    "foot_note": "1. See: Al-Muhkam wa al-Muhit al-A'zam, (10/ 566). \n2. See: Taj al-Arus, (1/ 478). \n3. See: Mu'jam al-Lugha al-Arabiyyah al-Mu'asirah, (3/ 2392). \n4. See: Mu'jam al-Mustalahat al-Tibbiyyah, (2/ 145). \n5. See: A Dictionary of Epidemiology, John M. Last, p. (87).",
    "book_id": "648",
    "new_page_number": 12
  },
  {
    "serial_number": "34384",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "diseases that began in Wuhan (WHAN) (1) in China in 2019 AD, and the virus is now known as: Severe Acute Respiratory Syndrome Coronavirus 2, and the disease resulting from it is called Coronavirus Disease (Covid-19) (2). Signs indicating Corona disease include the following: shortness of breath, loss of appetite, confusion or disorientation, persistent pain or feeling of pressure on the chest, high temperature of more than 38 degrees Celsius (3).",
    "foot_note": "1. Wuhan is the capital of Hubei Province and is located in central eastern China on the Yangtze River. Its population is more than: (eleven million people), and it is considered the seventh most populous Chinese city. See: Wikiwand website https:// www.wikiwand.com/ ar \n2. See: Mayo Clinic https:// www.mayoclinic.org/ ar/ diseases-conditions/ coronavirus/ symptoms-causes/ syc-20479963 \n3. See: WHO website https:// www.who.int/ ar/ emergencies/ diseases/ novel-coronavirus-2019/ question-and-answers-hub/ q-a-detail/ coronavirus-disease-covid-1",
    "book_id": "648",
    "new_page_number": 13
  },
  {
    "serial_number": "34385",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "Second: The difference between the Coronavirus epidemic and the plague: Scholars differed in the past on the issue of differentiating between an epidemic and a plague on two opinions, and this differentiation includes epidemics in general and applies to the Coronavirus epidemic; because it is classified among epidemics. The scholars' opinions regarding the difference between plague and epidemic are as follows: The First Opinion: That plague is the epidemic: This opinion is held by some scholars of language and early Arab physicians. Al-Khalil, may Allah have mercy on him, said: The epidemic: The plague, and it was said: It is every general disease (1). Ibn Sidah, may Allah have mercy on him, said: The epidemic is the plague, and it was said: It is every general disease (2). Ibn Al-Athir, may Allah have mercy on him, said: The general disease and the epidemic for which the air corrupts, so humors and bodies corrupt due to it (3). Ibn Manzur, may Allah have mercy on him, said: The Waba': The plague with short, long, and hamza endings. And it was said it is every general disease (4). Al-Fayumi, may Allah have mercy on him, said: And the plague is death from the epidemic, and the plural is Tawa'in, and 'Tu'ina al-insan' in passive form means he was struck by the plague, so he is 'Mat'un' (plagued) (5). Ibn Hajar, may Allah have mercy on him, said: A group of physicians said, among them Abu Ali bin Sina: Plague is a toxic substance that causes a deadly swelling occurring in the soft places and armpits of the body, and mostly it is under the armpit or behind the ear or at the nose tip. He said: And its cause is bad blood leaning towards putrefaction and corruption turning into a toxic essence that corrupts the organ and changes what is next to it, and leads to the heart a bad quality causing vomiting, nausea, fainting, and palpitations, and due to its badness it does not accept from the organs except what was weakest by nature, and the worst of it is what falls in the main organs. The black one, few survive from it, and the safest is the red then the yellow. Plagues abound during an epidemic in epidemic-stricken lands, and hence plague was called epidemic and vice versa (6).",
    "foot_note": "1. Al-Ain, (8/ 418). \n2. Al-Muhkam wa al-Muhit al-A'zam, (10/ 566). \n3. Al-Nihaya fi Gharib al-Hadith wa al-Athar, (3/ 127). \n4. Lisan al-Arab, (1/ 189). \n5. Al-Misbah al-Munir, (2/ 373). \n6. Fath al-Bari, (10/ 180), and this is what Ibn Sina mentioned in his book Al-Qanun, (3/ 164 - 165).",
    "book_id": "648",
    "new_page_number": 14
  },
  {
    "serial_number": "34386",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "Also, some Maliki and Hanafi scholars held this opinion. Al-Qadi Al-Baji, may Allah have mercy on him, says: The epidemic is the plague, it is a disease that pervades many people in one direction of directions without others, contrary to the usual condition of people and their diseases, and their illness is mostly one illness, unlike other times for people's illnesses are different (1). Ibn Juzayy, may Allah have mercy on him, said: The plague is the epidemic, and if it breaks out in a land, whoever is in it should not leave it fleeing from it, nor should anyone come to it (2). Ibn Abidin, may Allah have mercy on him, said: Epidemic is a name for every general disease, so every plague in that sense is an epidemic (3). The Second Opinion: That the plague is other than the epidemic: This is the opinion held by some verifying scholars of Sharia from the people of Hadith and Fiqh. Al-Qadi Iyad, may Allah have mercy on him, said: The origin of the plague is the ulcers emerging on the body, and the epidemic: The generality of diseases, so they were called plague; due to their resemblance in destruction to that, otherwise every plague is an epidemic, and not every epidemic is a plague (4). An-Nawawi, may Allah have mercy on him, said: The correct view which the verifiers said is that it is an illness of many people in one direction of the earth without other directions, and it is contrary to the usual illnesses in abundance and other things, and their illness is of one type unlike other times for their illnesses in them are different. They said: And every plague is an epidemic and not every epidemic is a plague (5). Ibn al-Qayyim, may Allah have mercy on him, said: The investigation is that between the epidemic and the plague is generality and specificity, so every plague is an epidemic, and not every epidemic is a plague. Likewise, general diseases are more general than the plague, for it is one of them. Plagues are abscesses, ulcers, and bad tumors occurring in places (6).",
    "foot_note": "1. Al-Muntaqa Sharh Al-Muwatta, (7/ 198). \n2. Al-Qawanin Al-Fiqhiyyah, p. (295). \n3. Radd Al-Muhtar ala Al-Durr Al-Mukhtar, (2/ 181). \n4. Ikmal Al-Mu'lim bi Fawa'id Muslim, (7/ 132). \n5. Al-Minhaj Sharh Sahih Muslim, (14/ 204). \n6. At-Tibb An-Nabawi, p. (32).",
    "book_id": "648",
    "new_page_number": 15
  },
  {
    "serial_number": "34387",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "Ibn Hajar, may Allah have mercy on him, said: As for the epidemic, it is the corruption of the essence of the air which is the material of the spirit and its support. I say: This is what has reached us from the words of linguists, jurists, and physicians regarding its definition. The conclusion is that its reality is a tumor arising from the agitation of blood, or the pouring of blood to an organ causing it to corrupt. Other than that of general diseases arising from air corruption are called plague by way of metaphor; due to their sharing in the generality of the disease, or the abundance of death (1). Al-Suyuti, may Allah have mercy on him, said: The epidemic is other than the plague..., and the plague is distinguished by being martyrdom, mercy, and the supplication of the Prophet, peace and blessings be upon him, unlike the epidemic (2). Al-Haytami, may Allah have mercy on him, said: By this, it is known that the plague is more specific than the epidemic absolutely, so every plague is an epidemic, and not the reverse, ... and some inferred that it is authentically reported that the plague does not enter Medina, and it is authentically reported from Aisha, may Allah be pleased with her, that Medina is the most epidemic-prone land of Allah, and from Bilal, may Allah be pleased with him, that Medina is the land of the epidemic; so it implies that the plague is other than the epidemic (3). What is preferred in this issue, and Allah knows best, is the second opinion, i.e., the opinion of the Sharia scholars from the people of Hadith and Fiqh who argued for differentiating between the plague and the epidemic, and that every plague is an epidemic, and not every epidemic is a plague, and that the epidemic includes the plague and other diseases, and between them is generality and specificity. Among the evidences supporting this opinion are the following: First: Plague does not enter Medina: It is established in Hadiths that the plague does not enter Medina, while the epidemic enters Medina, and it was reported that it entered Medina during the era of the Prophet, peace and blessings be upon him, as in the following Hadiths: On the authority of Abu 'Assib, may Allah be pleased with him, the freed slave of the Messenger of Allah, peace and blessings be upon him, said: The Messenger of Allah, peace and blessings be upon him, said: \"Gabriel came to me with the fever and the plague, so I kept the fever in Medina, and sent the plague to Sham. So the plague is a martyrdom for my nation, and a mercy, and a filth upon the disbeliever\" (4).",
    "foot_note": "1. Fath al-Bari, (10/ 180 - 181). \n2. Ma Rawahu Al-Wa'un fi Akhbar Al-Ta'un, p. (168). \n3. Al-Fatawa Al-Fiqhiyyah Al-Kubra, (4/ 21). \n4. Narrated by Ahmad in his Musnad, No. (20767), (34/ 366), and Ibn Abi Asim in Al-Ahad wa Al-Mathani, No. (466), (1/ 342), and Al-Dawlabi in Al-Kuna wa Al-Asma', No. (268), (1/ 131), and Al-Tabarani in Al-Kabir, No. (974), (22/ 391), and Al-Albani said in Sahih Al-Jami', (1/ 73): Authentic, and Al-Arna'ut said in the margin of Al-Musnad, (34/ 366): Its chain is authentic.",
    "book_id": "648",
    "new_page_number": 16
  },
  {
    "serial_number": "34388",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "And on the authority of Abu Huraira, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: \"Neither the plague nor the Dajjal will enter Medina\" (1). In another narration: \"Medina and Mecca are surrounded by angels; on every gap of it is an angel, neither the Dajjal nor the plague enters it\" (2). A Hadith was reported from Anas bin Malik, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, that the entry of the plague was not with certainty but suspended on will: \"The Dajjal comes to Medina and finds the angels guarding it, so the Dajjal does not approach it,\" he said: \"Nor the plague, if Allah wills\" (3). There was disagreement regarding the exception \"if Allah Almighty wills\", it was said: It is for blessing so it includes both, and it was said: It is for suspension, and that it is specific to the plague, and that its implication is the permissibility of the plague entering Medina (4). And it was said: The non-entry of the Dajjal into Medina is certain, but the plague has not yet entered it, and that is what is hoped for in the future (5). A group of scholars mentioned that the general plague entered Mecca, but as for Medina, it was not mentioned that it entered it, and this is one of his miracles; because physicians were unable to repel the plague from a city, or even a village, and the plague has been prevented from Medina for long ages (6). While the epidemic was reported to have entered Medina during the era of the Prophet, peace and blessings be upon him. On the authority of Aisha, may Allah be pleased with her, she said: When the Messenger of Allah, peace and blessings be upon him, arrived in Medina, Abu Bakr and Bilal fell ill..., so Bilal used to say: O Allah, curse Shaybah bin Rabi'ah, and Utbah bin Rabi'ah, and Umayyah bin Khalaf as they drove us out from our land to the land of the epidemic. Then the Messenger of Allah, peace and blessings be upon him, said: \"O Allah, make Medina beloved to us as our love for Mecca or stronger. O Allah, bless us in our Sa' and in our Mudd, and make it healthy for us, and transfer its fever to Al-Juhfah\" (7).",
    "foot_note": "1. Narrated by Al-Bukhari, No. (1880), (3/ 22), and Muslim, No. (1379), (2/ 1005). \n2. Narrated by Ahmad in Al-Musnad, No. (10265), (16/ 184), and Al-Haythami said in Al-Majma', (3/ 309): Narrated by Ahmad, and its men are trustworthy, and Al-Suyuti said in Ma Rawahu Al-Wa'un fi Akhbar Al-Ta'un, p. (160): Its chain is good. \n3. Narrated by Al-Bukhari, in the Book of Tribulations, Chapter: The Dajjal does not enter Medina, No. (7134), (9/ 61). \n4. See: Fath al-Bari, (10/ 181, 191). \n5. See: Fayd al-Bari ala Sahih al-Bukhari, Al-Kashmiri, (6/ 57). \n6. See: Fayd al-Qadir Al-Munawi, (4/ 321). \n7. Narrated by Al-Bukhari, in the Book of Virtues of Medina, Chapter: The Prophet's dislike that Medina be stripped [of people], No. (1889), (3/ 23).",
    "book_id": "648",
    "new_page_number": 17
  },
  {
    "serial_number": "34389",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "In a narration, she, may Allah be pleased with her, said: We arrived in Medina and it was epidemic-ridden, so Abu Bakr complained [of illness], and Bilal complained. When the Messenger of Allah, peace and blessings be upon him, saw the complaint of his companions, he said: \"O Allah, make Medina beloved to us as You made Mecca beloved or stronger, and make it healthy, and bless us in its Sa' and its Mudd, and shift its fever to Al-Juhfah\" (1). And on the authority of Abdullah bin Amr, may Allah be pleased with them both, that he said: When we arrived in Medina, a severe epidemic from its fever befell us. So the Messenger of Allah, peace and blessings be upon him, went out to the people, and they were praying their voluntary prayers sitting. The Messenger of Allah, peace and blessings be upon him, said: \"The prayer of the sitter is like half the prayer of the standing one\" (2). In a narration: The pain spread during the time of the Messenger of Allah, peace and blessings be upon him, so those praying while sitting increased, so the Messenger of Allah, peace and blessings be upon him, said: \"The prayer of the sitter is half of the prayer of the standing one\" (3). And on the authority of Anas bin Malik, may Allah be pleased with him, said: The Prophet, peace and blessings be upon him, arrived in Medina and it was feverish (4), so the people got fever. The Prophet, peace and blessings be upon him, entered the mosque, and the people were sitting praying. The Prophet, peace and blessings be upon him, said: \"The prayer of the sitter is half the prayer of the standing one,\" so the people burdened themselves to pray standing (5). In our time, the Coronavirus epidemic has spread in most countries of the world, and this epidemic entered Medina like other cities, and many cases and deaths were monitored in Medina after contracting this epidemic, while some scholars mentioned as previously stated that the plague did not enter Medina. Second: That the plague is from the prick of the Jinn: This came in the authentic Hadith on the authority of Abu Musa, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: \"The annihilation of my nation is by stabbing (6) and the plague.\" It was said: O Messenger of Allah, we know this stabbing, so what is the plague? He said: \"A prick (7) of your enemies from the Jinn, and in each is martyrdom\" (8).",
    "foot_note": "1. Narrated by Muslim, in the Book of Pilgrimage, Chapter: Encouragement to reside in Medina and patience upon its hardships, No. (1376), (2/ 1002). \n2. Narrated by Malik in Al-Muwatta, No. (451), (2/ 188). \n3. Narrated by Al-Tabarani in Al-Kabir, No. (14261), (12/ 420). \n4. Muhammah: i.e., possessing fever, it is said: The land became feverish: i.e., became possessed of fever. See: Al-Nihaya in Gharib al-Hadith, (1/ 446). \n5. Narrated by Ahmad in his Musnad, No. (12395), (19/ 387), and Al-Bazzar in his Musnad, No. (6353), (13/ 40), and Abu Ya'la in his Musnad, No. (3583), (6/ 275), and Al-Arna'ut said in the margin of Al-Musnad, (19/ 387): Authentic Hadith. \n6. At-Ta'n: It is pricking into something with what penetrates it, from that is stabbing with a spear. See: Maqayis al-Lugha, (3/ 413). \n7. Al-Wakhz: A stab that is not penetrating. See: Al-Nihaya in Gharib al-Hadith, (5/ 163). \n8. Narrated by Ahmad in Al-Musnad, No. (19528), (32/ 293), and Al-Bazzar in his Musnad, No. (2986), (8/ 16), and Abu Ya'la in his Musnad, No. (7226), (13/ 194), and Al-Tabarani in Al-Awsat, No. (3422), (3/ 367), and Al-Hakim in Al-Mustadrak, No. (158), (1/ 114), and Al-Hakim said authentic Hadith upon the condition of Muslim, and Al-Dhahabi agreed with him, and Al-Albani authenticated it in Al-Sahihah, (4/ 561).",
    "book_id": "648",
    "new_page_number": 18
  },
  {
    "serial_number": "34390",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "And on the authority of Aisha, may Allah be pleased with her, she said: \"The plague was mentioned, so I mentioned that the Prophet, peace and blessings be upon him, said: A prick that afflicts my nation from their enemies among the Jinn: a gland like the gland of a camel. Whoever stays in it is a Murabit (guardian), and whoever is afflicted by it is a martyr, and whoever flees from it is like one fleeing from the march [of battle]\" (1). Ibn Hajar, may Allah have mercy on him, said: The stabbing of the Jinn was described as a prick; because it occurs from the inside to the outside, affecting the inside first, then affecting the outside and may not penetrate, and this is unlike the stabbing of humans for it occurs from the outside to the inside, affecting the outside first, then affecting the inside and may not penetrate (2). Al-Zabidi, may Allah have mercy on him, said: What the verifiers among jurists and muhaddithin are upon is that they are distinct, so the epidemic: An unhealthy state changing the air so diseases multiply among people due to it, and the plague is the strike that afflicts humans from the Jinn, and they supported it with what is in the Hadith that it is a prick of your enemies from the Jinn (3). Some researchers tried to interpret the prick with a medical interpretation and mentioned that what is meant by it is the stabbing of fleas and not the stabbing of Jinn. He said: The non-penetrating stab is the stab of hidden fleas (4), and their pricking is intended by the word Jinn: And the reality is that these fleas that stab the skin of a human or animal with their sharp jaws stab a penetrating stab, and a little blood flows that one does not notice, and the flea feeds on it, and during that it vomits what is in its stomach blocked by plague microbes which flow from its mouth to the place of the prick, then move through the lymphatic vessels to the lymph nodes in the flank, armpit or neck depending on the place of the prick..., and there is no doubt that these fleas that cause the plague, which are unnoticed by humans but hide from them and disappear among clothes and are hardly seen except after hard searching, can be called by the term Jinn; because Jinn is everything hidden and concealed, and the conclusion is that the word Jinn mentioned in the plague and expressed by the term prick of Jinn, should refer to these small hidden creatures which can hardly be seen except by searching for them, which are fleas. For they are what pricks, and they are what cause the plague and transmit it... and there is no relationship",
    "foot_note": "1. Narrated by Abu Ya'la in his Musnad, No. (4664), (8/ 125), and Al-Albani said in Sahih Al-Jami', (2/ 731): Good (Hasan). \n2. Fath al-Bari, (10/ 182). \n3. Taj al-Arus, (1/ 478). \n4. The flea: A type of insect, from small vermin of the flea family, biting, jumping strongly, sucking human and animal blood and transmitting malignant diseases to them. See: Mu'jam al-Lugha al-Arabiyyah al-Mu'asirah, (1/ 191).",
    "book_id": "648",
    "new_page_number": 19
  },
  {
    "serial_number": "34391",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "to the Jinn, - the fiery creatures - with the subject of the plague at all, and this is what should be adopted, otherwise science contradicts the statement that the cause of the plague is fiery creatures called Jinn; for science, medicine, and language all support what we went to that the word Jinn in the Hadiths of plague linked to pricking refers to it, which is the hidden concealed fleas that prick the skin a prick, and transmit plague microbes in their secretions and vomit (1). Scholars past and present have responded to such claims and refuted them. Al-Ayni, may Allah have mercy on him, said: If you say the Legislator informed that the plague is from the prick of the Jinn, so there is an apparent contradiction between it and what was mentioned of opinions in interpreting the plague, I say: The truth is what the Legislator said, and doctors spoke in that according to what their rules necessitated, and the stabbing of Jinn is a matter not perceived by reason so they did not mention it, although it is possible that these things occur in the one stabbed upon the prick of the Jinn. What supports that the plague is from the prick of Jinn is its occurrence mostly in the most moderate seasons and in the healthiest lands in air and best in water, and if it were from the corruption of air it would encompass the people in whom the plague occurs and animals would also be stabbed (2). Ibn al-Qayyim, may Allah have mercy on him, said: Messengers inform about unseen matters, and these effects which they realized about the matter of the plague, they have nothing to negate that it is by the mediation of spirits, for the influence of spirits in nature and its diseases and destruction is a matter denied only by the most ignorant of people about spirits and their effects, and the reaction of bodies and their natures to them. Allah Glory be to Him may give these spirits control over human bodies upon the occurrence of an epidemic, and corruption of air, just as He gives them control upon some bad substances that cause a bad state for souls, especially upon agitation of blood, and black bile, and upon agitation of semen, for satanic spirits are able to act upon the possessor of these symptoms what they cannot with others, unless a stronger repellent than these causes repels them from remembrance, supplication, invocation and pleading, charity, and reciting the Quran, for by that angelic spirits are brought down which conquer these malignant spirits, nullify their evil and repel their influence (3).",
    "foot_note": "1. See: Introduction by Dr. Muhammad Ali Al-Bar to the book Ma Rawahu Al-Wa'un fi Akhbar Al-Ta'un by Al-Suyuti, p. (46 - 47). \n2. Umdat al-Qari Sharh Sahih al-Bukhari, (21/ 257). \n3. At-Tibb An-Nabawi, p. (32).",
    "book_id": "648",
    "new_page_number": 20
  },
  {
    "serial_number": "34392",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "Ibn Hajar, may Allah have mercy on him, said: Its being from the stabbing of the Jinn does not contradict what physicians said that the plague arises from the agitation of blood or its pouring; because it is possible that this happens from the internal stab, so the toxic substance occurs from it and the blood agitates because of it or pours out. Physicians did not address its being from the stabbing of Jinn only because it is a matter not perceived by reason but known from the Legislator, so they spoke in that according to what their rules necessitated (1). Third: Among the aspects of difference between plague and epidemic is what scholars and modern medicine mentioned that there is a difference between the origin and formation of plague and the origin and formation of epidemics, including the Coronavirus epidemic; for the origin of plague is bacteria (2), while epidemics may originate from bacteria or viruses (3). Modern medicine has defined plague as a disease affecting humans and mammals caused by bacteria called Yersinia pestis, and usually humans are infected with plague after being bitten by a rodent flea carrying plague bacteria, or by handling an animal infected with plague (4). Some individuals may be infected with pneumonic plague by inhaling air contaminated with the plague microbe (5). As for the Coronavirus epidemic, it is a virus from the new coronavirus family; where most cases of infection appeared in the city of Wuhan (WHAN) in China at the end of December (2019 AD) in the form of severe pneumonia, and it is believed that the new Coronavirus is linked to animals; where most initial cases were linked to a seafood and animal market in Wuhan (WHAN),",
    "foot_note": "1. Fath al-Bari, (10/ 181). \n2. Bacteria: Microscopic single-celled organisms, rectangular like a rod or spherical or spiral, living in all environmental atmospheres of water, soil, air, and living and non-living organic matter, reproducing by splitting into two: germ, and microbe. Some are useful, and others are harmful. See: Mu'jam al-Lugha al-Arabiyyah al-Mu'asirah, (1/ 234). \n3. Virus: Infectious particles and not cells, consisting of genetic material surrounded by a protective coat of proteins and do not possess cellular systems; to generate energy and produce proteins or to reproduce, and they are not living organisms, and cannot be eliminated by antibiotics. See: DW Medical website https:// www.dw.com/ ar \n4. See: CDC Medical website https:// www.cdc.gov/ plague \n5. See: Introduction by Dr. Muhammad Ali Al-Bar to the book Ma Rawahu Al-Wa'un fi Akhbar Al-Ta'un by Al-Suyuti, p. (32 - 35).",
    "book_id": "648",
    "new_page_number": 21
  },
  {
    "serial_number": "34393",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "and the virus is transmitted between humans from an infected person to another person through close contact without protection (1). Thus, it becomes clear from the foregoing that there is a difference between plague and epidemic, and the evidence for that is from the aspect of its entry into Medina, from the aspect of its cause, and from the aspect of the difference between its origin and formation.",
    "foot_note": "1. See: Saudi Ministry of Health website https:// www.moh.gov.sa/ HealthAwareness/ EducationalContent/ PublicHealth/ Pages/ corona.aspx",
    "book_id": "648",
    "new_page_number": 22
  },
  {
    "serial_number": "34394",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "The First Nazilah: Doctrinal violations in graves and places; for treatment from the Coronavirus epidemic. Among the polytheistic beliefs and doctrinal violations that occurred with the onset of the Coronavirus epidemic: is the belief that visiting the graves of saints and righteous people prevents infection with the epidemic, and that wiping on shrines and mausoleums is a cause for healing from diseases and epidemics, and that they repel affliction. With the Coronavirus epidemic, some violators hastened to insert this epidemic into their religious chanting. In Sohag Governorate in Egypt, one of them improvised while present at the birthday celebration (Mawlid) of the Companion Ammar bin Yasir, may Allah be pleased with him, and among what he said about the virtue of Ahl al-Bayt: They are healing..., they are the doctors for any Corona..., we came to your space, O Sheikh of men, in the square of Girga we saddled the journey. He concluded with a message to his followers and disciples, saying: O disciple, do not fear any Corona (1). In Iraq, one of the Shiite references, Qasim Al-Tai, issued a fatwa calling for continuing to visit religious places and establishing congregational and Friday prayers, and in response to an inquiry sent to him by one of his followers regarding closing some shrines; in anticipation of the spread of the Coronavirus. He said: The virus does not infect believers (2). Also, the Shiite cleric Ali Al-Kourani expressed his anger at the authorities closing the shrine of the Commander of the Faithful Ali bin Abi Talib, may Allah be pleased with him, for sterilization as a precautionary measure; for prevention from the Coronavirus. This came in a video recording of him circulated on social media, and Al-Kourani said angrily: One of the things that my amazement never ends about is that the shrine of the Commander of the Faithful, may Allah be pleased with him, they closed a part of it to sterilize it from the Corona microbe, and added: Whoever is infected with Corona comes and wipes on the shrine and will get well (3).",
    "foot_note": "1. See: Al-Wafd Portal https:// rosaelyoussef.com utm_campaign=nabdapp.com&utm_medium=referral&utm_source=nabdapp.com&ocid=Nabd_App \n2. See: Al-Hurra Channel News website https:// www.alhurra.com/ iraq/ \n3. See: Orient News website https:// orient-news.net/ ar/ news_show",
    "book_id": "648",
    "new_page_number": 23
  },
  {
    "serial_number": "34395",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "The correct doctrinal direction for this Nazilah is as follows: First: Verses came indicating the prohibition of invoking the dead or seeking help from them at their graves; to seek intercession, or seek healing from illness, or to lift affliction, or for other needs. The verses stated the prohibition of this act; because these matters are worship, and worship is entirely for Allah alone, as the Almighty said: {And they were not commanded except to worship Allah, being sincere to Him in religion, inclining to truth} [Al-Bayyinah: 5], and the Almighty said: {And I did not create the jinn and mankind except to worship Me (56)} [Ad-Dhariyat: 56], and the Almighty said: {And [He revealed] that the masjids are for Allah, so do not invoke with Allah anyone (18)} [Al-Jinn: 18], and the Mighty and Majestic said: {So invoke Allah, being sincere to Him in religion, although the disbelievers dislike it (14)} [Ghafir: 14], and the Almighty said: {Say, \"Indeed, my prayer, my rites of sacrifice, my living and my dying are for Allah, Lord of the worlds (162) No partner has He. And this I have been commanded, and I am the first [among you] of the Muslims (163)} [Al-An'am: 162 - 163], and verses in this meaning are many. Sheikh Abdul Rahman bin Hasan, may Allah have mercy on him, says: And in this are arguments and proofs showing the invalidity of what grave worshippers believe regarding saints and righteous people. Rather, regarding Taghuts, that they benefit those who call upon them, and protect those who seek refuge in their sanctuary. So glory be to Him who stood between them and understanding the Book; and that is His justice, Glory be to Him, and He is the one who intervenes between a man and his heart, and with Him is power and strength (1). Second: That Allah warned against directing any act of worship to creatures; because they do not possess harm or benefit for themselves. If they possessed anything for themselves, they would not have died, nor become ill. So if they do not possess that for themselves, how can they possess it for others!! Among the verses indicating that is the Almighty's saying: {Indeed, those you call upon besides Allah are servants like you. So call upon them and let them respond to you, if you should be truthful (194)} [Al-A'raf: 194], and the Almighty said: {And those you call upon besides Him are unable to help you, nor can they help themselves (197)} [Al-A'raf: 197], and the Almighty said: {Say, \"Invoke those you have claimed [as gods] besides Him, for they do not possess the [ability for] removal of adversity from you or [for its] transfer (56)} [Al-Isra: 56], and the Mighty and Majestic said: {Say, \"Invoke those you claim [as gods] besides Allah.\" They do not",
    "foot_note": "1. Fath al-Majid, p. (188).",
    "book_id": "648",
    "new_page_number": 24
  },
  {
    "serial_number": "34396",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "possess an atom's weight [of ability] in the heavens or on the earth, and they do not have therein any partnership [with Him], nor is there for Him from among them any assistant (22)} [Saba: 22], and the Almighty said: {That is Allah, your Lord; to Him belongs the dominion. And those whom you invoke other than Him do not possess [as much as] the membrane of a date seed (13) If you invoke them, they do not hear your supplication; and if they heard, they would not respond to you. And on the Day of Resurrection they will deny your association. And none can inform you like [one] Acquainted [with all matters] (14)} [Fatir: 13-14]. Third: That the Prophet, peace and blessings be upon him, warned against taking graves as a means to polytheism and directing worship to other than Allah. On the authority of Mu'adh, may Allah be pleased with him, said: I was riding behind the Prophet, peace and blessings be upon him, on a donkey called Ufayr, so he said: \"O Mu'adh, do you know what is the right of Allah upon His servants, and what is the right of the servants upon Allah?\" I said: Allah and His Messenger know best. He said: \"Indeed the right of Allah upon the servants is that they worship Him and do not associate anything with Him, and the right of the servants upon Allah is that He does not punish whoever does not associate anything with Him (1)\". And on the authority of Aisha, may Allah be pleased with her, she said: The Messenger of Allah, peace and blessings be upon him, said in his illness from which he did not recover: \"May Allah curse the Jews and the Christians, they took the graves of their prophets as mosques.\" She said: \"Had it not been for that, his grave would have been made prominent; but he feared that it might be taken as a mosque (2)\". And on the authority of Umar, may Allah be pleased with him, said: I heard the Prophet, peace and blessings be upon him, saying: \"Do not exaggerate in praising me (3), as the Christians exaggerated in praising the son of Mary, for I am only His servant, so say, Servant of Allah, and His Messenger (4)\". Ibn Taymiyyah, may Allah have mercy on him, says: The Prophet, peace and blessings be upon him, forbade that their graves be taken as mosques with the intention of praying in them as mosques are intended, even if the one intending that only intends to worship Allah alone; because that is a means (to Shirk), unless",
    "foot_note": "1. Narrated by Al-Bukhari in the Book of Jihad and Siyar, Chapter: The Name of the Horse and Donkey, No. (2856), (4/ 29), and Muslim in the Book of Faith, Chapter: Whoever meets Allah with faith and does not doubt in it enters Paradise and is forbidden from Hell, No. (30), (1/ 58). \n2. Narrated by Al-Bukhari in the Book of Funerals, Chapter: What is disliked of taking mosques over graves, No. (1330), (2/ 88), and Muslim in the Book of Mosques and Places of Prayer, Chapter: Prohibition of building mosques over graves and placing images in them and the prohibition of taking graves as mosques, No. (529), (1/ 376). \n3. Itra' (Exaggeration in praise): Exceeding the limit in praise, and lying in it. It is said: So-and-so praised so-and-so excessively if he praised him with what is not in him; that is because they praised him with what is not in him, so they said: He is the third of three and that he is the son of God and similar things from their polytheism and disbelief. See: Al-Nihaya fi Gharib al-Hadith wa al-Athar, Ibn Al-Athir, (3/ 123), and Tahdhib al-Lugha, Al-Azhari, (14/ 8). \n4. Narrated by Al-Bukhari in the Book of Prophets, Chapter: The saying of Allah {And mention in the Book, Mary, when she withdrew from her family} [Maryam: 16], No. (3445), (4/ 167).",
    "book_id": "648",
    "new_page_number": 25
  },
  {
    "serial_number": "34397",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "they intend the mosque for the sake of the grave's occupant and invoking him, invoking by him, and invoking at his side. So the Messenger of Allah, peace and blessings be upon him, forbade taking this place for worshipping Allah alone; lest it be taken as a means to associating partners with Allah (1). Ibn Abdul Hadi, may Allah have mercy on him, says: So every addition that implies doing what is forbidden and leaving what is commanded, like that which implies panic and speaking obscenity, and leaving patience, or implies Shirk or invocation and leaving sincerity of religion to Allah, is forbidden (2). Sheikh Ibn Baz, may Allah have mercy on him, says: It is not permissible for a Muslim to draw near to graves and grave occupants by slaughtering or vowing, vowing sacrifices or vowing charities, or the like, or to seek help from the people of the graves, or ask them to fulfill a need, or heal a patient, or victory over enemies or obtaining a child, or the like. All this is not permissible, all of it is worship of other than Allah, and Allah Glory be to Him denied that, and commanded His servants to worship Him, Glory be to Him said: {And your Lord has decreed that you not worship except Him} [Al-Isra: 23], and said: {And [He revealed] that the masjids are for Allah, so do not invoke with Allah anyone (18)} [Al-Jinn: 19], and said: {It is You we worship and You we ask for help (5)} [Al-Fatiha: 5] (3). Fourth: That the guidance of the Prophet, peace and blessings be upon him, in visiting graves is the most complete and best guidance, and it was not reported from him, peace and blessings be upon him, that he invoked the occupant of the grave or sought intercession by him or sought help from him besides Allah in: removing harm, or bringing benefit. Ibn al-Qayyim, may Allah have mercy on him, says: He, peace and blessings be upon him, used to visit the graves of his companions to pray for them, ask for mercy for them, and seek forgiveness for them. This is the visit that he enacted for his nation, and legislated for them, and commanded them to say when they visit them: \"Peace be upon you, O people of the dwellings, believers and Muslims, and we, if Allah wills, will join you. We ask Allah for us and for you well-being (4)\". And his guidance, peace and blessings be upon him, was to say and do upon visiting them, of the same kind as what he says when praying over the deceased, of supplication, asking for mercy and forgiveness. But the polytheists refused except invoking the dead and associating partners with him, and swearing by him upon Allah, and asking him for needs, and seeking help from him, and turning to him, contrary to his guidance, peace and blessings be upon him, for it is guidance of monotheism and kindness",
    "foot_note": "1. Majmu' al-Fatawa, (1/ 164). \n2. Al-Sarim al-Munki fi ar-Radd ala as-Subki, p. (325). \n3. Fatawa Nur ala ad-Darb, (2/ 20). \n4. Narrated by Muslim in the Book of Funerals, Chapter: What is said upon entering graveyards and praying for their people, No. (975), (2/ 671).",
    "book_id": "648",
    "new_page_number": 26
  },
  {
    "serial_number": "34398",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "to the deceased, while the guidance of these people is Shirk and abuse to themselves, and to the deceased. They are three categories: Either they invoke the deceased, or invoke by him, or at his side, and they see supplication at his side as more obligatory and better than supplication in mosques. Whoever contemplates the guidance of the Messenger of Allah, peace and blessings be upon him, and his companions, the difference between the two matters will become clear to him (1).",
    "foot_note": "1. Zad al-Ma'ad fi Hadyi Khayr al-Ibad, (1/ 507 - 508).",
    "book_id": "648",
    "new_page_number": 27
  },
  {
    "serial_number": "34399",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "The Second Nazilah: Uttering violative supplications and remembrances; for treatment from the Coronavirus epidemic. Among the doctrinal Nawazil that occurred with the onset of the Coronavirus epidemic are: Innovated supplications and remembrances, which some claim prevent infection with epidemics, and some claimed that persevering in them is a cause for lifting affliction, and an aid in healing from diseases and epidemics. Among these supplications and remembrances: What happened in Morocco; where a number of personalities and activists went out in marches roaming the streets of a number of cities raising the slogan \"Allahu Akbar\" and \"La ilaha illa Allah\", claiming that those marches could protect the Moroccan people from the Coronavirus (1). In Amman, the capital of Jordan, there were religious invocations and supplications on the loudspeakers of the capital's mosques; to lift the Coronavirus epidemic. The mosques of the Jordanian capital Amman broadcast supplications and invocations after the Maghrib and Isha prayers, pleading to Allah Almighty; to overcome the epidemic of the emerging Coronavirus (2). Calls also spread on social media sites to establish a collective prayer in many countries of the world; to lift the affliction of the emerging Corona, in which Muslims all over the globe participate to pray to Allah; to get rid of the Coronavirus. The prayer would be collective, two Rak'ahs at a unified time globally, in which the Glory be to Him is supplicated to lift the Coronavirus epidemic from the earth and pled with to have mercy on the world with His mercy (3). Some websites also published supplications for the night of Isra and Mi'raj to lift the affliction and epidemic of the Coronavirus. Among these supplications: O Allah, in that blessed night of Isra and Mi'raj, send down healing upon every patient who suffers and has not found medicine, and divert the Coronavirus from us, O Most Generous of the generous. O Allah, O Gentle with servants, doctors and scientists have failed to find the cure, but in Your hand is the dominion of the heavens and the earth, heal our sick and the sick of the Muslims (4).",
    "foot_note": "1. See: Youm7 Newspaper website https:// www.youm 7.com/ story/ 2020/ 3/ 23/ %D 8%A 5%D 8%B 3%D 9 \n2. See: Al-Nashra Al-Dawlia News website https:// alnashraaldawlia.com/ \n3. See: Al-Wakala News Newspaper website https:// elwekalanews.net/ 402392 \n4. See: Dalil Al-Watan website https:// elwatan 140.com/",
    "book_id": "648",
    "new_page_number": 28
  },
  {
    "serial_number": "34400",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "Some websites published supplications whose sayers claim they immunize against the Coronavirus epidemic, including the following supplication: O Allah, calm the great prestige of the steward of might (Qahraman Al-Jabarut) with the descending subtlety coming from the flood of the kingdom (Malakut); so that we cling to the tails of Your kindness and generosity and seek protection in You from the descent of Your wrath, O Possessor of complete strength and comprehensive power, O Allah, O Allah, O Allah, mighty is Your neighbor and glorious is Your praise and there is no god but You. O Allah, I seek refuge in You from stabbing and plague, and epidemic and affliction and all diseases and sudden death, and evil turn of fate in self, family, wealth and child (1).",
    "foot_note": "1. See: Ahl Al-Muntada website https:// saydatar.ahlamontada.com/ t 23 - topic",
    "book_id": "648",
    "new_page_number": 29
  },
  {
    "serial_number": "34401",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "The correct doctrinal direction for this Nazilah is as follows: First: That the method of performing these supplications and remembrances is innovated in religion and has no evidence to prove or support it. Allah Glory be to Him has clarified that He has perfected the religion and completed the favor upon the believers as He Glory be to Him said: {This day I have perfected for you your religion and completed My favor upon you and have approved for you Islam as religion} [Al-Ma'idah: 3], meaning: I have completed for you, O believers, My obligations upon you and My limits, and My command to you and My prohibition, and My lawful and My unlawful, and My revelation of what I revealed of that in My Book, and My clarification of what I clarified to you of it by My revelation on the tongue of My Messenger, and the evidences I set up for you regarding all your religious needs, so I completed all that for you, so there is no addition to it after this day (1). Evidences have come indicating the obligation of adhering to the remembrances mentioned in the Book and the Sunnah, such as His saying Glory be to Him: {Say, \"Call upon Allah or call upon the Most Merciful. Whichever [name] you call - to Him belong the best names.\"} [Al-Isra: 110], and the Almighty's saying: {And to Allah belong the best names, so invoke Him by them} [Al-A'raf: 180], meaning call upon Allah by His names which He named Himself with, or His Messenger named Him with. In it is evidence that the names of Allah Almighty are based on revelation (Tawqifiyyah) not convention. What indicates the correctness of this statement and confirms it: That it is permissible to say 'Ya Jawad' (O Generous), and it is not permissible to say 'Ya Sakhiy' (O Generous - synonym not used in text), and it is permissible to say 'Ya 'Alim' (O All-Knowing), and it is not permissible to say 'Ya 'Aqil' (O Rational) (2). Al-Qadi Iyad, may Allah have mercy on him, said: Allah permitted supplicating to Him and taught supplication in His Book to His creation, and the Prophet, peace and blessings be upon him, taught supplication to his nation. Three things combined in it: Knowledge of Monotheism, knowledge of language, and advice to the nation. So no one should deviate from his supplication, peace and blessings be upon him. Satan has tricked people from this standpoint; so he assigned to them evil people who invent supplications for them that distract them from following the Prophet, peace and blessings be upon him (3). Al-Qurtubi, may Allah have mercy on him, said: So a person must use what is in the Book of Allah and the authentic Sunnah of supplication and leave what is other than that, and not say I choose such and such, for Allah Almighty has chosen for His Prophet and His allies and taught them how to supplicate (4).",
    "foot_note": "1. See: Tafsir al-Tabari, (9/ 518). \n2. See: Lubab at-Ta'wil fi Ma'ani at-Tanzil, Al-Khazin, (2/ 276). \n3. Al-Futuhat ar-Rabbaniyyah 'ala al-Adhkar an-Nawawiyyah, Ibn Allan, (1/ 17). \n4. Al-Jami' li Ahkam al-Qur'an, (4/ 231).",
    "book_id": "648",
    "new_page_number": 30
  },
  {
    "serial_number": "34402",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "Ibn Taymiyyah, may Allah have mercy on him, says: No one has the right to legislate for the people a type of remembrances and supplications that are not Sunnah, and make it a regular worship that people persist in as they persist in the five daily prayers; rather this is innovating a religion that Allah did not permit. Unlike what a person supplicates with occasionally without making it a Sunnah for the people, this - if it is not known to contain a forbidden meaning - is not judged as forbidden; but it may contain that and the person does not feel it. This is like when a person in necessity supplicates with supplications that open up to him at that time, this and its likes are close. As for taking a non-legal Wir'd (litany) and enacting a non-legal remembrance: this is what is forbidden. With this, in legal supplications and legal remembrances are the utmost correct demands, and the ultimate high objectives, and no one deviates from them to other innovated invented remembrances except an ignorant or negligent or transgressor (1). ... Sheikh Muhammad bin Ibrahim, may Allah have mercy on him, was asked about some remembrances and supplications said out of their place, so he said, may Allah have mercy on him: These remembrances, although they are legal in their origin, the Almighty said: {And your Lord said, \"Call upon Me; I will respond to you.\"} [Ghafir: 60], and Glory be to Him said: {Say, \"Call upon Allah or call upon the Most Merciful. Whichever [name] you call - to Him belong the best names.\"} [Al-Isra: 110], and he, peace and blessings be upon him, said: \"Supplication is the marrow of worship\" (2), except that by specifying them and their manner, the legislated remembrance was taken out to non-legislated, so the consideration of the original legislation was lifted, and these remembrances became types of innovations, and he, peace and blessings be upon him, said: \"Every innovation is misguidance\" (3), so they are additional innovations (4). Second: That Allah has commanded obedience to the Prophet, peace and blessings be upon him, and any violation of the Prophet's command, peace and blessings be upon him, is a violation of Allah's command. The manner of these supplications and remembrances is among the innovations that were not reported from the Prophet, peace and blessings be upon him, and they contradict the Sunnah of the Prophet, peace and blessings be upon him. Allah Almighty says: {O you who have believed, obey Allah and obey the Messenger and those in authority among you. And if you disagree over anything, refer it to Allah and the Messenger, if you should believe in Allah and the Last Day. That is the best",
    "foot_note": "1. Majmu' al-Fatawa (22/ 511). \n2. Narrated by At-Tirmidhi, No. (3371), (5/ 316), and Al-Tabarani in Al-Awsat, No. (3196), (3/ 292), and Al-Arna'ut said in the margin of Al-Musnad, (30/ 299): Good due to its supporting evidences. \n3. Narrated by Ahmad in Al-Musnad, No. (17144), (28/ 373), and Abu Dawood, (4607), (7/ 16), and At-Tirmidhi, (2676), (4/ 341), and At-Tirmidhi said: This is a Hasan Sahih Hadith. \n4. Fatawa wa Rasa'il Samahat ash-Sheikh Muhammad bin Ibrahim bin Abd al-Latif Al al-Sheikh, (9/ 42).",
    "book_id": "648",
    "new_page_number": 31
  },
  {
    "serial_number": "34403",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "and best in interpretation (59)} [An-Nisa: 59]. Obedience to the Messenger in his life: complying with his command and avoiding his prohibition, and after his death: following his Sunnah (1). And the Almighty said: {O you who have believed, obey Allah and His Messenger and do not turn from him while you hear (20)} [Al-Anfal: 20], meaning: Do not violate his command while you hear his saying and claim that you are of him (2). And on the authority of Abu Huraira, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: \"Whoever obeys me has obeyed Allah, and whoever disobeys me has disobeyed Allah\" (3). It is known that our Prophet, peace and blessings be upon him, is the best of prophets, their seal, the most perfect in conveying, and advising Allah's servants. If the method in performing these supplications and remembrances were from the religion, he, peace and blessings be upon him, would have explained it to his nation, or done it in his life. An epidemic occurred in his time, peace and blessings be upon him, and it was not reported from him or his companions that they performed such a method in supplications. He, peace and blessings be upon him, said: \"There was no prophet before me but it was a duty upon him to guide his nation to the best of what he knows for them, and warn them of the evil of what he knows for them\" (4). Also, many of the previous supplications are contrary to the Sunnah reported from the Messenger of Allah, peace and blessings be upon him, in choosing comprehensive supplications, and some of them were dominated by affectation in rhyming prose (Saj'); which might lead the supplicant to come up with invented supplications. The Salaf disliked rhyming prose in supplication and forbade it. Ibn Abbas, may Allah be pleased with them both, said to his freed slave Ikrimah, may Allah have mercy on him: \"Look out for rhyming prose in supplication and avoid it, for I knew the Messenger of Allah, peace and blessings be upon him, and his companions not doing anything but avoiding that\" (5). Al-Qurtubi, may Allah have mercy on him, said: And among them is that he supplicates with what is not in the Book and the Sunnah, choosing desolate words and rhymed phrases he found in pamphlets that have no basis and no reliance; making them his slogan and leaving what",
    "foot_note": "1. See: Zad al-Masir, Ibn al-Jawzi, (1/ 423). \n2. See: Tafsir al-Tabari, (13/ 457). \n3. Narrated by Al-Bukhari in the Book of Judgments, Chapter: The saying of the Almighty: {Obey Allah and obey the Messenger and those in authority among you} [An-Nisa: 59], No. (7137), (9/ 61), and Muslim in the Book of Leadership, Chapter: The obligation of obeying rulers in other than disobedience, No. (1835), (3/ 1466). \n4. Narrated by Muslim in the Book of Leadership, Chapter: Command to fulfill the pledge of allegiance to Caliphs, the first then the first, No. (1844), (3/ 1844). \n5. Narrated by Al-Bukhari in the Book of Supplications, Chapter: What is disliked of rhyming prose in supplication No. (6337), (8/ 74).",
    "book_id": "648",
    "new_page_number": 32
  },
  {
    "serial_number": "34404",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "supplicated with by the Messenger of Allah, peace and blessings be upon him; and all of this prevents the response to the supplication (1). Ibn Hajar, may Allah have mercy on him, said: Transgression in supplication occurs by raising the voice more than necessary, or by asking for what is impossible to occur according to Sharia, or by asking for a sin, or by supplicating with what has not been transmitted, especially that which has been disliked such as affected rhymed prose and leaving what is commanded (2). Third: That supplication is an act of worship; therefore, the supplicant must observe the etiquette of servitude to Allah in his supplication. Among these etiquettes is: not to worship Him with what He has not legislated, and not to praise Him with what He has not praised Himself with nor permitted. It was narrated from Abu Na’amah, from a son of Sa’d, that he said: My father heard me while I was saying: 'O Allah, I ask You for Paradise, its bliss, its splendor, and such and such, and I seek refuge in You from the Fire, its chains, its shackles, and such and such.' So he said: 'O my son, indeed I heard the Messenger of Allah, peace and blessings be upon him, say: \"There will be a people who transgress in supplication, so beware of being among them. Indeed, if you are given Paradise, you are given it and what is in it of good, and if you are protected from the Fire, you are protected from it and what is in it of evil\" (3).' Ibn al-Qayyim, may Allah have mercy on him, said: It is part of transgression to worship Him with what He has not legislated and to praise Him with what He has not praised Himself with nor permitted; for this is transgression in the supplication of praise and worship, and it is analogous to transgression in the supplication of request and demand (4). Fourth: Among the innovated violations in supplication: Collective supplication or collective prayer followed by supplication with one voice, agreed upon and in a collective manner. This is an innovated supplication; it is not proven that the Prophet, peace and blessings be upon him, did this with his companions, nor that he used to mention his Lord while his companions repeated after him, may Allah be pleased with them. Sheikh Saleh Al-Fawzan, may Allah preserve him, said: The innovations that have been introduced in the field of acts of worship in this time are many; because the basic principle in acts of worship is that they are restricted to text (Tawqifi), so nothing of them is legislated except with evidence. And whatever no evidence indicates is an innovation..., then he mentioned some innovations. And he said: And among them is collective Dhikr (remembrance) after prayer; because",
    "foot_note": "1. Al-Jami' fi Ahkam al-Qur'an, (7/226).\n2. Fath al-Bari, (8/298).\n3. Reported by Ahmad in his Musnad, Hadith (1584), (3/146), Abu Dawood in Al-Sunan, Hadith (1480), (2/77), and Al-Tabarani in Al-Du'a, (56), p. (37), and Al-Albani said in Al-Sahihah, (7/352): Authentic (Sahih).\n4. Bada'i' al-Fawa'id, (2/14).",
    "book_id": "648",
    "new_page_number": 33
  },
  {
    "serial_number": "34405",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "what is legislated is that each person says the reported Dhikr individually (1). Sheikh Bakr Abu Zayd, may Allah have mercy on him, said: Collective Dhikr with one voice, secretly or openly, to repeat a specific Dhikr, whether reported or not reported, whether from everyone or received from one of them, with raising hands or without raising them; all of this is a description that requires a legal basis indicating it from the Book and the Sunnah; because it falls under worship, and acts of worship are based on restriction [to text] and following, not on innovation and invention. Therefore, we looked into the evidences in the Book and the Sunnah: we did not find evidence indicating this added form. Thus, it is verified that it has no basis in the purified Sharia, and whatever has no basis in the Sharia is an innovation (Bid'ah). Therefore, collective Dhikr and supplication are an innovation that every Muslim following the Messenger of Allah, peace and blessings be upon him, must abandon and beware of, and must adhere to what is legislated (2).",
    "foot_note": "1. Al-Irshad ila Sahih al-I'tiqad wa al-Radd 'ala Ahl al-Shirk wa al-Ilhad, p. (336).\n2. Tashih al-Du'a, p. (134).",
    "book_id": "648",
    "new_page_number": 34
  },
  {
    "serial_number": "34406",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "The Third Calamity: Seeking Means (Tawassul) through other than Allah to lift the affliction of the Corona epidemic. Among the doctrinal calamities that occurred with the onset of the Corona epidemic is: Seeking means through other than Allah, and among that is seeking means through some innovated actions such as reading books of Prophetic Hadith, which some claim that doing so lifts the Corona epidemic and is a cause for healing from diseases and other epidemics. A member of the Egyptian Dar al-Ifta said via live broadcast on the Dar al-Ifta's official Facebook page: That Sahih al-Bukhari is the most correct book after the Book of Allah and is a sign of precise narration and sound documentation. He mentioned the saying of Abdullah bin Abi Jamrah (1): No one read this book in distress except that Allah relieved it, and no one read it in a vessel except that it was saved from drowning. He explained that these are merely successful experiments attributed to the fact that Sahih al-Bukhari contains many Hadiths, and with every reading of a Hadith from it, it is accompanied by sending blessings upon the Prophet, peace and blessings be upon him, which is a cause for repelling every affliction and epidemic and for victory. He added that many Imams have believed this since ancient times, such as Imam Taqi al-Din al-Subki, Ibn al-Hafiz, Zayn al-Din al-Iraqi, and Imams of Muslims throughout the centuries without objection from them; for narrating Hadith from the Messenger of Allah, peace and blessings be upon him, has great merit among the common people and their scholars. He pointed out that Imam al-Bukhari's supplications were answered; Al-Hafiz Ibn Abi Ali al-Ghassani recounts that when Samarqand was hit by a severe drought, people went to the shrine of Imam al-Bukhari and prayed the rain prayer (Istisqa) there, humbling themselves to Allah in supplication until the rain fell pouring for long days. He stated that Sahih al-Bukhari is among the things recommended to seek assistance with in repelling affliction, in addition to the prayer of need (Salat al-Hajah) and other righteous deeds (2). A researcher published an article on a website titled: \"Bestowing the Nobles with the Ruling on Reading Hadith Books to Lift Affliction,\" and among what came in his article:",
    "foot_note": "1. Abdullah bin Abi Jamrah Al-Maliki Abu Muhammad, the preacher of Granada. He narrated from Abu Al-Rabi’ bin Salim by Ijazah (license). He resided for a while in Ceuta and took over the preaching in Granada towards the end of his life. He delivered the sermon on Friday and fell from the pulpit dead, in the year: (710 AH). See: Al-Wafi bi al-Wafiyat, Al-Safadi, (17/62).\n2. See: Sada El-Balad website https://www.elbalad.news/4244051",
    "book_id": "648",
    "new_page_number": 35
  },
  {
    "serial_number": "34407",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "It was the practice of scholars in the past, from the people of Hadith, theoretical knowledge, and Sufism, to seek blessings and bring down mercies, to repel distresses and relieve hardships and calamities, by reading the blessed books of Hadith. They used to gather during adversities to seek blessings by reading the honored books of Sunnah; with the intention of repelling harm, lifting affliction, and bringing about victory (1).",
    "foot_note": "1. See: Website of the Association of Syrian Scholars https://islamsyria.com/site/show_articles/13696",
    "book_id": "648",
    "new_page_number": 36
  },
  {
    "serial_number": "34408",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "The doctrinal direction regarding this calamity is as follows: First: Allah guided His servants in their necessities and needs to sincerely supplicate to Him alone, Glory be to Him, excluding others, as He said: {And when My servants ask you concerning Me, indeed I am near. I respond to the invocation of the supplicant when he calls upon Me. So let them respond to Me [by obedience] and believe in Me that they may be [rightly] guided (186)} [Al-Baqarah: 186]. And He said: {And your Lord says, \"Call upon Me; I will respond to you.\" Indeed, those who disdain My worship will enter Hell [rendered] contemptible (60)} [Ghafir: 60]. And the Almighty said: {Is He [not best] who responds to the desperate one when he calls upon Him and removes evil and makes you inheritors of the earth? Is there a deity with Allah? Little do you remember (62)} [An-Naml: 62]. Ibn al-Qayyim, may Allah have mercy on him, says: The Lord, Glory be to Him, loves for His servant to ask Him and desire Him; because the arrival of His kindness and benevolence to him depends on his asking. Rather, He is the One who bestows it initially without a cause from the servant, nor the mediation of his asking and request. Rather, He decreed that favor for him without a cause from the servant, then He commanded him to ask Him and request from Him; to manifest the status of servitude, poverty, and need, and to acknowledge the might of Lordship and the perfection of the Lord's richness, and His uniqueness in favor and benevolence, and that the servant has no independence from His favor for the blink of an eye. So he comes with the request and asking in the manner of one who knows that he does not deserve anything by his request and asking; but his Lord, the Exalted, loves to be asked, desired, and requested from (1). Second: The Prophet, peace and blessings be upon him, did not command the recitation of the Qur'an or reading any Hadith to repel harm, bring benefit, or resist an enemy. Rather, he commanded supplication, and he guided to supplication by his action and speech. He, peace and blessings be upon him, said when seeking victory: \"O Allah, Revealer of the Book, Mover of the clouds, Defeater of the clans, defeat them and grant us victory over them (2).\" And he, peace and blessings be upon him, said in the prayer for rain: \"O Allah, relieve us, O Allah, relieve us, O Allah, relieve us (3).\" Third: That was not the guidance of the Companions, and they were the people who most honored the Sunnah of the Prophet, peace and blessings be upon him; they did not worship by reciting Hadith except for memorization and transmission. Indeed, they did not command people to recite the Qur'an if a necessity befell them",
    "foot_note": "1. Madarij al-Salikin bayna Manazil Iyyaka Na'budu wa Iyyaka Nasta'in, (3/101-102).\n2. Reported by Al-Bukhari in the Book of Jihad and Siyar, Chapter: Do not wish to meet the enemy, Hadith (3024), (4/63), and Muslim in the Book of Jihad and Siyar, Chapter: Dislike of wishing to meet the enemy, and the command to be patient upon meeting, Hadith (1742), (3/1362).\n3. Reported by Al-Bukhari in the Chapters of Istisqa (Prayer for Rain), Chapter: Seeking rain in the Friday sermon without facing the Qibla, Hadith (1014), (2/28), and Muslim in the Book of Prayer for Rain, Chapter: Supplication in the Prayer for Rain, Hadith (897), (2/612).",
    "book_id": "648",
    "new_page_number": 37
  },
  {
    "serial_number": "34409",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "or they feared an enemy. Severe hardships befell them such as: drought, disease, plague, and enemy invasion, yet they did not resort to anything but Allah in such situations. Similarly, the righteous predecessors from the favored generations; it is not reported from any of them that they worshipped by reciting Hadith or other books. Fourth: Tawassul (seeking means) in its origin is divided into two parts: Legitimate Tawassul: This section includes types such as: Seeking means to Allah Almighty by His Names and Attributes, as He said: {And to Allah belong the best names, so invoke Him by them} [Al-A'raf: 180]. And seeking means to Allah Almighty by mentioning His promise, Glorified and Exalted is He, as in His saying: {Our Lord, and grant us what You promised us through Your messengers} [Al-Imran: 194]. From this is that the supplicant says: 'O Allah, You have promised those who call upon You with a response, so answer my supplication.' Likewise, seeking means to Allah Almighty by His actions, Glorified and Exalted is He, such as saying: 'O Allah, O One who granted victory to Muhammad, peace and blessings be upon him, on the day of Badr, grant us victory over the disbelieving people.' Or that the servant seeks means to Allah Almighty by his acts of worship, whether of the heart, action, or speech, or others, as in the story of the three companions of the cave. One of them sought means to Allah Almighty by his kindness to his parents, the second sought means to Allah Almighty by giving the hired worker his full wages after investing them for him, and the third sought means to Allah Almighty by his abstention from immorality. Each one of them said at the end of his supplication: \"O Allah, if I did that seeking Your Face, then relieve us from what we are in\" (1). Or seeking means to Allah Almighty by mentioning one's state, and that he is in need of Allah's mercy and help, as in the supplication of Moses, peace be upon him: {My Lord, indeed I am, for whatever good You would send down to me, in need (24)} [Al-Qasas: 24]. Or seeking means through the supplication of the righteous, hoping that Allah will answer their supplication. This is by asking a living, present Muslim to pray for him, as Omar, may Allah be pleased with him, and the Companions, may Allah be pleased with them, asked Al-Abbas, may Allah be pleased with him, to \"pray for rain for them\" (2), meaning to ask Allah to relieve them by sending down rain. All these types of Tawassul are correct; because evidence has been established in the texts indicating their legitimacy, and the people of knowledge have agreed upon that. (3)",
    "foot_note": "1. Reported by Al-Bukhari, Book of Sales, Chapter: If one buys something for another without his permission and he approves, Hadith (2215), (2/97), and Muslim in the Book of Riqaq (Heart-softeners), Chapter: The Story of the Three Companions of the Cave and Tawassul through Righteous Deeds, Hadith (2743), (4/2099).\n2. Reported by Al-Bukhari in the Chapters of Istisqa, Chapter: The people asking the Imam for rain if they suffer drought, Hadith (1010), (2/27).\n3. See: Majmoo' al-Fatawa, (27/131-133), Iqtida' al-Sirat al-Mustaqim, (2/318), Majmoo' Fatawa Bin Baz, (4/319-320), and Majmoo' Fatawa Bin Uthaymeen, (5/280-288).",
    "book_id": "648",
    "new_page_number": 38
  },
  {
    "serial_number": "34410",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "As for the prohibited types of Tawassul, they are: Seeking means to Allah Almighty by the essence (Dhat) of a prophet or a righteous servant, or the Kaaba, or other virtuous things; or seeking means by the right (Haqq) of a prophet or a righteous servant or the Kaaba or others; or seeking means by the status (Jah) of a prophet or a righteous servant, or his blessing, or his sanctity, or by the right of his grave, and similar things. It is not permissible for a Muslim to call upon Allah Almighty with any of these types of Tawassul. It has not been reported from any of the Companions, the Successors, or the predecessors of the nation that they used to supplicate with such supplications... And none of the scholars mentioned that it is legislated to seek means and ask for rain through the Prophet or the righteous person after his death or in his absence, nor did they recommend that in the prayer for rain, nor in seeking victory, nor in other supplications. Supplication is the essence of worship. And worship is built upon the Sunnah and following, not upon desires and innovation. Allah is only worshipped by what He legislated, He is not worshipped by desires and innovations (1).",
    "foot_note": "1. See: Majmoo' al-Fatawa, (27/83-87).",
    "book_id": "648",
    "new_page_number": 39
  },
  {
    "serial_number": "34411",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "The Fourth Calamity: Incorrect Application of Legal Evidences upon the Occurrence of the Corona Epidemic. Among the doctrinal calamities that occurred with the onset of the Corona epidemic is: The incorrect application of legal evidences to infer about occurrences or events without relying on authentic evidence from the Book and the Sunnah. Indeed, it may contradict the implied and explicit meaning of the evidences of the Book and the Sunnah. An example of this is: Inferring that the Corona virus is one of the soldiers of Allah. A party leader in Morocco says: The reason for the spread of Corona viruses goes back to man abandoning his function, so they become angry for Allah and take revenge for Allah; they are soldiers from the soldiers of Allah that Allah Almighty harnesses to discipline man so that he returns to his Master (1). A member of the Supreme Council for Islamic Affairs in Egypt says: The Corona virus is one of Allah's invisible soldiers; to break the arrogance of the world. Pointing out that what is happening regarding the spread of the disease is a type of warning and not annihilation, and there is no need for panic (2). A preacher in Morocco said: The virus is an affliction and a message from Allah to the servants. Adding: That Allah Almighty wanted by this disease to humiliate the tyrants and Pharaohs with a small virus, which is considered a soldier from the soldiers of Allah that no one knows but Him, according to his expression (3). A researcher said on a website: These viruses of various types - including the novel Corona virus - are counted among the soldiers of Allah Almighty, even if they are not living organisms; because they are all from the creations of Allah Almighty. He unleashes them upon whom He wills, when He wills, however He wills, and He lifts them or repels them or prevents them from whom He wills according to His profound wisdom and effective will. Nothing happens in the universe except by Allah's permission and will (4).",
    "foot_note": "1. See: Assabah website https://assabah.ma/453838.html\n2. See: Al-Shorouk newspaper https://www.shorouknews.com/news/view.aspx?cdate=01042020&id=f63bc3cc-c607-4caf-8734-8da01ffd2690\n3. See: Hiba Press website https://ar.hibapress.com/details-214871.html\n4. See: Howiyya Press website http://howiyapress.com/",
    "book_id": "648",
    "new_page_number": 40
  },
  {
    "serial_number": "34412",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "The correct doctrinal direction for this calamity is as follows: First: It is incorrect to describe the Corona epidemic as being a soldier from the soldiers of Allah; because the verse: {And none knows the soldiers of your Lord except Him} [Al-Muddathir: 31], came in the context of describing the angels with this description, and there is no evidence or legal justification indicating contrary to this description. This opinion is what scholars of interpretation and others mentioned, that the verse only comes in describing the angels and inferring by them. Among the evidences that clarify this matter is what was reported in the Hadith of Abu Sa'id al-Khudri, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, told them about the night he was taken on the Night Journey, he said: \"I ascended, I and Gabriel, to the lowest heaven, and there was an angel called Ismail, who is the keeper of the lowest heaven, and before him were seventy thousand angels, with each angel his army of one hundred thousand,\" and he recited this verse: {And none knows the soldiers of your Lord except Him} [Al-Muddathir: 31] (1). Ata', may Allah have mercy on him, said: {And none knows the soldiers of your Lord except Him} means the angels whom He created to punish the people of the Fire, and no one knows their number except Allah (2). Al-Qurtubi, may Allah have mercy on him, said: They are the angels, strengthening the believers by what they cast into their hearts of thoughts and steadfastness, and weakening the disbelievers by causing cowardice in them from where they do not see them and without fighting (3). Ibn Atiyyah, may Allah have mercy on him, said: {And none knows the soldiers of your Lord except Him}: Informing that the matter is beyond what is imagined and that the news is only about some of the power, not all of it. The sky is entirely populated with types of angels, all of them in continuous worship, permanent humility, and obedience, with no pause in any of that, not even for a single minute (4). Ibn Taymiyyah, may Allah have mercy on him, said in the interpretation of the verse: What is in the Book and the Sunnah regarding the mention of angels and their large number is a matter that cannot be enumerated (5).",
    "foot_note": "1. Reported by Al-Tabari in Al-Tafsir, (17/354), Al-Tabarani in Al-Awsat, Hadith (7097), (7/138), and Al-Ajurri in Al-Shari'ah, Hadith (1027), (3/1529).\n2. See: Ma'alim al-Tanzil, Al-Baghawi, (5/178), and Zad al-Masir, Ibn al-Jawzi, (4/364).\n3. Al-Jami' li-Ahkam al-Qur'an, (8/101).\n4. Al-Muharrar al-Wajiz fi Tafsir al-Kitab al-Aziz, (5/397).\n5. Majmoo' al-Fatawa, (4/120).",
    "book_id": "648",
    "new_page_number": 41
  },
  {
    "serial_number": "34413",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "He [Ibn Taymiyyah], may Allah have mercy on him, also said: They are the angels who are the servants of the Most Merciful through whom He manages the affairs of the heavens and the earth. And those, no one knows their number except Allah, and no one knows their description other than Him, and no one knows how He commands them to act except Him. The Almighty said: {And none knows the soldiers of your Lord except Him} (1). Ibn Kathir, may Allah have mercy on him, said: {And none knows the soldiers of your Lord except Him}, meaning: No one knows their number and their multitude except Him, the Exalted; lest anyone imagine that they are only nineteen, as has been said by a group of the people of deviation and ignorance and the Greek philosophers. And those who followed them from the two sects who heard this verse, so they wanted to apply it to the Ten Intellects and the Nine Souls, the claim of which they invented and were unable to establish evidence for its requirement. So they understood the beginning of this verse while having disbelieved in its end (2). Second: The attribution of the soldiers to Allah is an attribution of the genus of honorific addition (Idafa Tashrifiyya). Allah has singled out the angels with this honorable addition in the Holy Qur'an, so they had a distinction and honor over others of the soldiers, even though they are all Allah's creation; but because Allah attributed them to Himself, they were honored by this addition. Ibn al-Qayyim, may Allah have mercy on him, said: This is the addition of a creature to its Creator, and a made thing to its Maker; but it implies a specification or honor by which the addressee is distinguished from others..., and this is an addition to His Divinity which implies His love for it and His honoring and ennobling of it (3). Ibn Uthaymeen, may Allah have mercy on him, said: What is added (attributed) to Allah is divided into three categories: Either it is descriptions (attributes); or distinct entities (objects); or what relates to created entities. If the thing added to Allah is a description, it is one of His attributes and not created, such as the Speech of Allah and the Knowledge of Allah. If the thing added to Allah is a distinct entity existing by itself, it is created and not one of His attributes, such as the Mosques of Allah, the She-Camel of Allah, and the House of Allah; these are entities existing by themselves, their addition to Allah is of the type of adding the creature to its Creator by way of honor. And nothing of the creatures is added to Allah Almighty except for a special reason pertaining to it; and were it not for this reason, it would not have been singled out by the addition. And if the thing added to Allah is what relates to created entities, it is also created; this is like His saying: {So when I have proportioned him and breathed into him of My [created] soul, then fall down to him in prostration (29)} [Al-Hijr: 29]; for the soul here is created because it relates to a created entity",
    "foot_note": "1. Previous reference, (5/234).\n2. Tafsir al-Qur'an al-Azim, (8/270).\n3. See: Al-Ruh, Ibn al-Qayyim, p. (154), with modification.",
    "book_id": "648",
    "new_page_number": 42
  },
  {
    "serial_number": "34414",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "(1). Third: Authentic texts from the Sunnah describe epidemics as 'Rijz' (punishment/plague) and did not describe them as soldiers of Allah. It has been reported that the Prophet, peace and blessings be upon him, described the plague as a punishment with which Allah tests some of His servants. From Usama, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: \"This pain or sickness is a Rijz (2) with which some nations before you were punished, then it remained afterwards on the earth. It goes one time and comes another. So whoever hears of it in a land, let him not advance upon it, and whoever is in a land where it occurs, let him not flee from it (3).\" Nevertheless, the one who dies from it expecting reward from Allah has the reward of a martyr, as in the Hadith from Aisha, may Allah be pleased with her, who said: I asked the Prophet, peace and blessings be upon him, about the plague, so he informed me \"that it is a torment sent by Allah on whom He wills, and that Allah made it a mercy for the believers. There is no one who resides in his town during a plague, patient and expecting reward, knowing that nothing will befall him except what Allah has written for him, but that he will have the like of the reward of a martyr\" (4). Fourth: Describing angels as the soldiers of Allah appeared in several texts from the Book and the Sunnah, and explained that their mission is: supporting and aiding the pious believers, and taking revenge on the wrongdoers, corrupters, and stubborn opposers. Among that is Allah reinforcing the believers with angels in the Battle of Badr as the Almighty said: {[Remember] when you asked help of your Lord, and He answered you, \"Indeed, I will reinforce you with a thousand from the angels, following one another\" (9)} [Al-Anfal: 9]. And He said: {And Allah had already given you victory at Badr while you were few in number. Then fear Allah; perhaps you will be grateful. (123) [Remember] when you said to the believers, \"Is it not sufficient for you that your Lord should reinforce you with three thousand angels sent down? (124) Yes, if you remain patient and conscious of Allah and the enemy come upon you [attacking] in rage, your Lord will reinforce you with five thousand angels having marks (of distinction) (125)} [Al-Imran: 123-125].",
    "foot_note": "1. Tafsir al-Qur'an al-Karim, (2/9).\n2. Rijz: It is torment, and it is also from Rijs (filth/abomination). It is said: The shaking torment; due to its severity and it has a severe, continuous shaking. See: Mujmal al-Lughah, Ibn Faris, (1/420), Al-Gharibayn fi al-Qur'an wa al-Hadith, Al-Harawi, (3/717), and Taj al-Arus, (15/149).\n3. Reported by Muslim in the Book of Peace, Chapter: Plague, Omens, Soothsaying, and the like, Hadith (2218), (4/1738).\n4. Reported by Al-Bukhari in the Book of Stories of the Prophets, Chapter: The Hadith of the Cave, Hadith (3474), (4/175).",
    "book_id": "648",
    "new_page_number": 43
  },
  {
    "serial_number": "34415",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "And from Ibn Abbas, may Allah be pleased with them both, that the Messenger, peace and blessings be upon him, said on the day of Badr: \"This is Gabriel holding the head of his horse, equipped with tools of war (1).\" Allah has explained the wisdom and purpose of this reinforcement, which is strengthening the believers, fighting alongside them, fighting the enemies, and killing them by striking their necks and hands: {[Remember] when your Lord inspired to the angels, \"I am with you, so strengthen those who have believed. I will cast terror into the hearts of those who disbelieved, so strike [them] upon the necks and strike from them every fingertip\" (12)} [Al-Anfal: 12]. And He said: {And Allah made it not except as [a sign of] good tidings for you and to reassure your hearts thereby. And victory is not except from Allah, the Exalted in Might, the Wise (126) That He might cut down a section of the disbelievers or suppress them so that they turn back disappointed} [Al-Imran: 126-127]. One of the Muslim fighters heard the sound of an angel's blow striking one of the disbelievers, and his voice urging his horse... so he told the Messenger of Allah, peace and blessings be upon him, about that, and he said: \"You spoke the truth, that was from the reinforcement of the third heaven (2).\" The angels fought in other locations; in the Battle of the Trench, Allah sent His angels: {O you who have believed, remember the favor of Allah upon you when armies came to [attack] you and We sent upon them a wind and armies [of angels] you did not see. And ever is Allah, of what you do, Seeing (9)} [Al-Ahzab: 9]. The intent by the armies they did not see is the angels, just as it is proven that Gabriel came to the Messenger, peace and blessings be upon him - after his return from the Trench, having put down his weapon and bathed - Gabriel came to him shaking dust from his head and said to the Messenger, peace and blessings be upon him: \"Have you put down your weapon? By Allah, we have not put it down. Go out to them.\" The Messenger of Allah, peace and blessings be upon him, said: \"Where?\" So he pointed to Banu Qurayzah (3). Fifth: This epidemic can be defeated and eliminated by medicines or vaccines or other things, so it is incorrect to describe it as one of the soldiers of Allah; because the soldiers of Allah are not defeated, as the Almighty said: {And indeed, Our soldiers will be those who overcome",
    "foot_note": "1. Reported by Al-Bukhari in the Book of Maghazi (Expeditions), Chapter: The Battle of Uhud, Hadith (4041), (5/94).\n2. Reported by Muslim in the Book of Jihad and Siyar, Chapter: Reinforcement with Angels in the Battle of Badr and the Permissibility of Spoils, Hadith (1763), (3/1383).\n3. Reported by Al-Bukhari in the Book of Maghazi, Chapter: The Return of the Prophet (PBUH) from the Confederates and his Exit to Banu Qurayzah and besieging them, Hadith (4122), (5/112), and Muslim in the Book of Jihad and Siyar, Chapter: Permissibility of fighting those who break the covenant, and permissibility of bringing down the people of a fortress to the judgment of a just ruler fit for judgment, Hadith (1769), (3/1389).",
    "book_id": "648",
    "new_page_number": 44
  },
  {
    "serial_number": "34416",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "(173)} [As-Saffat: 173]. So the soldiers of Allah have victory and support in the end; because they are saved from the punishment of this world and the Hereafter (1). It was also said: Meaning the promise of victory for them by argument and overcoming preceded (2). Al-Alusi, may Allah have mercy on him, said: The apparent context implies that this is in this world and that it is by way of conquest, dominance, and defeating the enemies, either by killing them, displacing them, expelling them from their homelands, capturing them, or similar things. The two sentences indicate stability and continuity, so it must be said: That this continuity is customary. It was said: It is literal, and the continuity of victory for the soldiers is conditional on what the attribution implies [being truly of Allah's party]. So the followers of the messengers are not defeated in war except due to their deficiency in what [the attribution] implies, by some inclination towards the world, or weakness of reliance on Him, the Exalted, or similar things. And it suffices in supporting the Messengers to elevate their word, render creation incapable of opposing them, and protect them from killing in wars and from fleeing in them, even if distresses are great there. And the reason for expressing 'victorious' (Mansurun) with the Messengers and 'overcoming' (Ghalibun) with the Soldiers is not hidden (3). Al-Sa'di, may Allah have mercy on him, said: This is a great glad tiding for whoever carries out Allah's command and becomes of His party and His soldiers, that he will have the victory, even if the enemy prevails over him at some times; for a wisdom Allah Almighty desires, the end of his affair is overcoming and victory. And who is more truthful than Allah in statement (4). Al-Shanqiti, may Allah have mercy on him, said: This noble verse indicates that the Messengers, may Allah's prayers and peace be upon them, and their followers are always victorious over enemies by argument and proof, and whoever among them is commanded with Jihad is also victorious by the sword and spear. The verses indicating this are many; like His saying: {Allah has written, \"I will surely overcome, I and My messengers.\" Indeed, Allah is Powerful and Exalted in Might (21)} [Al-Mujadila: 21], and His saying: {Indeed, We will support Our messengers and those who believe during the life of this world and on the Day when the witnesses will stand (51)} [Ghafir: 51], and His saying: {And it was a right upon Us to support the believers (47)} [Ar-Rum: 47] (5).",
    "foot_note": "1. See: Al-Tafsir al-Wasit, Al-Wahidi, (3/535).\n2. See: Al-Jami' li-Ahkam al-Qur'an, (15/139).\n3. Ruh al-Ma'ani fi Tafsir al-Qur'an al-Azim wa al-Sab' al-Mathani, (12/149).\n4. Tafsir al-Karim al-Rahman, p. (236).\n5. Adwa' al-Bayan fi Idah al-Qur'an bi-al-Qur'an, (6/321).",
    "book_id": "648",
    "new_page_number": 45
  },
  {
    "serial_number": "34417",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "Sixth: The term 'Soldiers' (Junud) in the Qur'an is a legal term and has come in two categories: The First Category: Those attributed to Allah, and they are of two types: The First Type: They are the angels as mentioned in His saying: {And none knows the soldiers of your Lord except Him} [Al-Muddathir: 31]. Allah mentioned them in another verse as He said: {Then Allah sent down His tranquility upon His Messenger and upon the believers and sent down soldiers angels whom you did not see and punished those who disbelieved. And that is the recompense of the disbelievers (26)} [At-Tawbah: 26]. Ibn Abbas, may Allah be pleased with them both, said: Meaning the angels (1). And His saying: {O you who have believed, remember the favor of Allah upon you when armies came to [attack] you and We sent upon them a wind and armies [of angels] you did not see. And ever is Allah, of what you do, Seeing (9)} [Al-Ahzab: 9]. Al-Tabari, may Allah have mercy on him, said: It is the angels that I mentioned in the reports that have passed (2). This is also what Ibn Abi Hatim, may Allah have mercy on him, mentioned in his Tafsir (3), and Ibn Zamanin, may Allah have mercy on him, in his Tafsir (4), and Al-Tha'labi, may Allah have mercy on him, in his Tafsir (5), and Al-Wahidi, may Allah have mercy on him, in his Tafsir (6), and Al-Sam'ani in his Tafsir (7), and many people of knowledge and interpretation mentioned the like of that. It has been mentioned previously that the soldiers in His saying: {And none knows the soldiers of your Lord except Him} [Al-Muddathir: 31], are the angels. The Second Type: The believing humans as in His saying: {And indeed, Our soldiers will be those who overcome (173)} [As-Saffat: 173]. The Second Category: Those attributed to other than Allah, and they are of four types: The First Type: The people of Pharaoh as in His saying: {And he called upon his Lord that these are a criminal people (22) [Allah said], \"Then set out with My servants by night. Indeed, you will be followed (23) And leave the sea in stillness. Indeed, they are an army to be drowned (24)} [Ad-Dukhan: 23].",
    "foot_note": "1. See: Tafsir al-Wasit, Al-Wahidi, (2/488), and Zad al-Masir, (2/247).\n2. Tafsir al-Tabari, (14/189).\n3. Tafsir al-Qur'an al-Azim, (6/1774).\n4. Tafsir al-Qur'an al-Aziz, (2/200).\n5. Al-Kashf wa al-Bayan 'an Tafsir al-Qur'an, (5/26).\n6. Al-Wajiz fi Tafsir al-Kitab al-Aziz, (1/459).\n7. Tafsir al-Qur'an, (2/299).",
    "book_id": "648",
    "new_page_number": 46
  },
  {
    "serial_number": "34418",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "The Second Type: They are the soldiers of Solomon, peace be upon him, from the Jinn as mentioned in His saying: {And gathered for Solomon were his soldiers of the jinn and men and birds, and they were [marching] in rows (17)} [An-Naml: 17]. The Third Type: They are the soldiers of Solomon, peace be upon him, from the birds as mentioned in His saying: {And gathered for Solomon were his soldiers of the jinn and men and birds, and they were [marching] in rows (17)} [An-Naml: 17]. The Fourth Type: They are the soldiers of Iblis as mentioned in His saying: {So they will be overturned into it [Hellfire], they and the deviators (94) And the soldiers of Iblis, all together (95)} [Ash-Shu'ara: 94-95]. So the term 'Soldiers' is a legal term mentioned for these four categories, and applying the description of soldiers to the virus contradicts the verses and opposes the legal terms. It is not permissible to oppose the verses of Allah or deviate from them or expand to include a term that did not appear in the Book of Allah, and then infer that it is a soldier from the soldiers of Allah. Seventh: Among the established rules mentioned in the Sharia related to rulings and general etiquette is that if specifying the creation of a thing implies deficiency, then specification is not permissible. Likewise, if specification implies an ugly meaning or lowly creatures, then specification is also not permissible; so that there is no lack of esteem or bad manners with Allah Almighty. An example of this is like the sayer saying: 'Allah is the Creator of everything,' so it is not said: 'Allah is the Creator of dogs,' for this description is not correct even though Allah is the Creator of everything including dogs; because such implies an ugly meaning. And the general ruling, if its specification implies an ugly meaning, then it is not permissible for a person to bring it. Analogous to that are diseases, so it is not said: 'O Creator of diseases,' or 'O Creator of epidemics or plagues.' Ibn Taymiyyah, may Allah have mercy on him, said: Allah is the Creator of everything and the Willer of every event, yet a person is prevented from specifying what is considered filthy of creatures, and what the Sharia considers ugly of events by saying in isolation: 'O Creator of dogs,' and 'O Willer of adultery' and the like, contrary to if he said: 'O Creator of everything' and 'O One by whose will everything happens' (1). Ibn Adel, may Allah have mercy on him, said: So holding on to the verses that everything is from Allah, [does not mean] that it is attributed to Him; due to the bad manners in it, just as it is said: O",
    "foot_note": "1. Majmoo' al-Fatawa, (6/504).",
    "book_id": "648",
    "new_page_number": 47
  },
  {
    "serial_number": "34419",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "Creator of the heavens, the Throne, and the Footstool, and it is not said: O Creator of dogs and pigs. And the Almighty said: {A spring from which the servants of Allah drink, making it gush forth abundantly (6)} [Al-Insan: 6], so He specialized the name 'servants' for the pious, even though the disbelievers are also servants (1). Eighth: Some found it problematic that a Hadith mentions locusts as being from the soldiers of Allah, as in the Hadith of Salman, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, was asked about locusts? He said: \"The most numerous of Allah's soldiers, I do not eat it, nor do I forbid it\" (2). The answer to this problem is as follows: 1 - That the scholars weakened this Hadith; so inferring by it is invalid. 2 - It was mentioned in the authentic Hadith that the Prophet, peace and blessings be upon him, ate locusts. Abdullah bin Abi Awfa, may Allah be pleased with him, said: \"We fought with the Messenger of Allah, peace and blessings be upon him, seven battles eating locusts (3).\" 3 - Muslims have agreed on the permissibility of eating locusts (4), and the majority considers it lawful (5). 4 - It is proven in many texts that the angels are the most numerous of Allah's creation.",
    "foot_note": "1. Al-Lubab fi 'Ulum al-Kitab, (1/293).\n2. Reported by Abu Dawood Hadith (3814), (3/358), Ibn Majah, Hadith (3219), (2/1037), Al-Bazzar in his Musnad, Hadith (2509), (6/477), Al-Tabarani in Al-Kabir, Hadith (6149), (6/256), Al-Bayhaqi in Al-Kubra, (18994), (9/431). Al-Baghawi said in Masabih al-Sunnah, (3/140): Weak. Al-Albani said in Silsilat al-Ahadith al-Da'ifah, (4/43): Weak.\n3. Reported by Al-Bukhari in the Book of Slaughtering and Hunting, Chapter: Eating Locusts, Hadith (5495), (7/90), and Muslim in the Book of Hunting and Slaughtering and What is Eaten of Animals, Chapter: Permissibility of Locusts, Hadith (1952), (3/1546).\n4. See: Sharh Sahih Muslim, Al-Nawawi, (13/103).\n5. See: Zad al-Ma'ad, (4/352).",
    "book_id": "648",
    "new_page_number": 48
  },
  {
    "serial_number": "34420",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "The Fifth Calamity: Abandoning Legal Evidences and Relying on Rational Evidences. Among the doctrinal calamities that occurred with the onset of the Corona epidemic is: The call to rely on reason without the Sharia in dealing with epidemics, claiming that religion has no jurisdiction in such matters, and that religion must be set aside and reliance placed on others in dealing with epidemics. A researcher in social psychology in Morocco says: Fear grips humans when it comes to a disaster due to their clinging to life, which is human nature, but the reaction varies according to mentalities and personalities, such that there is the normal human and the abnormal one who suffers from psychological or mental disorders, as well as the believer in superstition and conspiracy. He added: Using religion as an excuse to explain this issue is completely unjustified; because the Islamic faith itself obliges man to know the causes of those natural phenomena through using the faculty of reason. Man projects his fears onto a specific phenomenon because he is unable to explain it. He clarified that the global epidemic was interpreted in a superstitious manner, not Islamic, and said: In a previous stage, we used to link floods to the wrath of nature, while now we have started talking about God's punishment (1). A professor of psychiatry in Egypt said: What is said that the Corona virus is a soldier of Allah is a delusional pathological thought, and a wrong understanding of the Quranic text, as many may understand the Quranic text from its apparent meaning. He clarified that it is necessary to use reason in understanding the Quranic text and this is called enlightening religion (2). A writer on a website said: No one denies that the appearance of the Corona epidemic and its spread left a lot of intellectual debate, and produced a diversity of positions regarding its source, nature, and methods of prevention and treatment. It is a healthy and natural debate in which all societies engaged today. However, the observer will find that this",
    "foot_note": "1. See: Hespress electronic newspaper website https://www.hespress.com/orbites/462503.html\n2. See: Youm7 website https://www.youm7.com/story/2020/3/20/%D9%87-%D9%85%D9%86/4679276",
    "book_id": "648",
    "new_page_number": 49
  },
  {
    "serial_number": "34421",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "debate took two directions: First: A magical metaphysical (1) direction in its explanation of the source of the epidemic and its nature. Second: An empirical scientific direction attempting to research natural causes for its appearance and ways of prevention. He added: Like the rest of the countries of the world, our Arab and Islamic societies engaged in this debate, and epidemic literature appeared about the Corona virus which also adopted in its dealing with the epidemic the same contrast between a magical metaphysical direction and an empirical scientific direction. The metaphysical and magical direction spread among wide segments in these societies; which made them underestimate its danger and see no point in prevention. The reason for this goes back to the spread of superficial religious culture based on rigid traditional jurisprudential discourse, and the marginalization of the enlightened rational discourse of many scholars in our ancient and modern history (2).",
    "foot_note": "1. Metaphysics is a philosophical term meaning the science of what is beyond nature, or the science that contemplates imperceptible and transcendental existences. See: Mu'jam al-Mustalahat wa al-Shawahid al-Falsafiyyah, Jalal al-Din Sa'id, p. (460).\n2. See: Middle East Online website https://middle-east-online.com/",
    "book_id": "648",
    "new_page_number": 50
  },
  {
    "serial_number": "34422",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "The correct doctrinal direction for this calamity is as follows: First: It is absolutely not permissible for us to judge the texts of the Book and Sunnah with our minds, rejecting this and accepting that. Whatever is proven from Allah and His Messenger must be adopted. We must submit that nothing happens in this universe except what Allah willed. There is no disease, pest, or epidemic except what Allah wills and decrees. Whatever is in this universe of creatures and existing things: entities, essences, attributes, actions, diseases, and pests, Allah willed their existence; because nothing happens in His kingdom except what He wills. He is the Owner, the Arranger, the Controller, and His wisdom in their existence is known only to Him. Also, it is absolutely not permissible to use reason to contradict the text; because Allah said: {It is not for a believing man or a believing woman, when Allah and His Messenger have decided a matter, that they should [thereafter] have any choice about their affair. And whoever disobeys Allah and His Messenger has certainly strayed into clear error (36)} [Al-Ahzab: 36]. Ibn al-Qayyim, may Allah have mercy on him, said: So the servant's choice of contrary to that contradicts his faith and submission, and his satisfaction with Allah as Lord, Islam as religion, and Muhammad as Messenger (1). Among the indicative verses is also His saying: {But no, by your Lord, they will not [truly] believe until they make you, [O Muhammad], judge concerning that over which they dispute among themselves and then find within themselves no discomfort from what you have judged and submit in [full, willing] submission (65)} [An-Nisa: 65]. Meaning: We do not oppose it with reason, opinion, desire, or anything else. The Lord, Glory be to Him, swore by Himself to negate faith from those who prioritize reason over what the Messenger brought, and they themselves testified against themselves that they are not believers in its meaning even if they believed in its wording (2). Second: The human mind and knowledge cannot grasp the wisdom of Allah in creating creatures and bringing existences into being, including diseases and pests. Al-Shatibi, may Allah have mercy on him, says: Allah set a limit for minds in their perception which they end at and do not exceed, and He did not make a way for them to perceive every objective. If it were so, they would be equal to the Creator Almighty in perceiving everything that was, is, and will not be. For if it were, how would it be? For Allah's information is infinite, and the servant's information is finite, and the finite does not equal the infinite. Included in this totality are the essences",
    "foot_note": "1. Madarij al-Salikin, (2/185).\n2. See: Al-Sawa'iq al-Mursalah fi al-Radd 'ala al-Jahmiyyah wa al-Mu'attilah, Ibn al-Qayyim, (3/828).",
    "book_id": "648",
    "new_page_number": 51
  },
  {
    "serial_number": "34423",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "of things in whole and in detail, their attributes, conditions, actions, and rulings in whole and in detail. So a single thing among the totality of things is known to the Creator Almighty completely and perfectly; such that not an atom's weight escapes His knowledge regarding its essence, attributes, conditions, or rulings. Unlike the servant, whose knowledge of that thing is deficient and incomplete whether in conceptualizing its essence, attributes, conditions, or rulings. This is an observed, tangible matter in humans that no rational person doubts, proven by experience if a human considers it in himself (1). Sheikh Ibn Baz, may Allah have mercy on him, says: Sound, explicit minds do not contradict authentic transmission nor oppose it; because the Messengers, peace and blessings be upon them, do not bring what sound minds deem impossible, but they may bring what minds are perplexed by; due to their deficiency and weak perception. So they [minds] must submit to the Truthful, the Wise, the All-Knowing of everything, regarding His news and judgment, and submit to that and believe in it. The story of Moses' staff and the story of the People of the Cave are not things that minds deem impossible; because the power of Allah, Glory be to Him, is great and comprehensive, and nothing incapacitates Him in the earth nor in the heaven (2). Third: The claim that reason or science alone can understand or perceive the reality of epidemics and viruses is a wrong claim; because Allah's knowledge encompasses everything, nothing is hidden from Him. He knows what was, what will be, and what has not happened, if it were to happen, how it would be. And all creatures know nothing except what Allah has taught them of His knowledge. No one knows anything except what the All-Knowing, the All-Aware has taught him. He, Glory be to Him, said about Himself: {And with Him are the keys of the unseen; none knows them except Him. And He knows what is on the land and in the sea. Not a leaf falls but that He knows it. And no grain is there within the darknesses of the earth and no moist or dry [thing] but that it is [written] in a clear record (59)} [Al-An'am: 59]. Al-Khattabi, may Allah have mercy on him, says: Humans - even if they are described with knowledge - this applies to them regarding one type of information, excluding another. This may exist in them in one state and not another. Calamities may befall them, so ignorance replaces their knowledge, and forgetfulness follows their remembrance. We may find one of them knowledgeable in Fiqh but not knowledgeable in Grammar, and knowledgeable in both but not knowledgeable in arithmetic and medicine and similar matters. But the knowledge of Allah - Glory be to Him - is knowledge of reality and perfection as the Almighty said: {That you may know that Allah has power over all things and that Allah has encompassed all things",
    "foot_note": "1. Al-I'tisam, (3/283).\n2. Majmoo' Fatawa al-Allamah Abdul Aziz bin Baz, may Allah have mercy on him, (1/107).",
    "book_id": "648",
    "new_page_number": 52
  },
  {
    "serial_number": "34424",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "in knowledge (12)} [At-Talaq: 12], {And has encompassed whatever is with them and has enumerated all things in number (28)} [Al-Jinn: 28] (1). Ibn al-Qayyim, may Allah have mercy on him, says: There is no doubt that sight is subject to error and seeing some things contrary to what they are, and imagining what has no existence in reality. So if reason judges it, its error becomes clear (2). Fourth: These diseases and epidemics are among the signs of Allah that Allah sends to His servants as He said: {We will show them Our signs in the horizons and within themselves until it becomes clear to them that it is the truth} [Fussilat: 53]. Allah sends these signs to His servants so that He may show them the extent of their incapacity before His power, and their weakness before the smallest of Allah's creatures, which come by His command and are lifted by His command excluding others. ... These signs may be for warning and intimidation as the Almighty said: {And We send not the signs except as a warning (59)} [Al-Isra: 59]. Al-Mawardi, may Allah have mercy on him, says: There are three aspects to it: First: That the signs are the miracles of the Messengers which Allah Almighty made as indications of warning to intimidate the deniers. Second: That they are signs of retribution to intimidate from sins. Third: That they are the changing of conditions from childhood to youth then to middle age then to old age; so that you may learn from the changing of your conditions and fear the outcome of your affair (3).",
    "foot_note": "1. Sha'n al-Du'a, p. (57).\n2. Bada'i' al-Fawa'id, (3/200).\n3. Al-Nukat wa al-'Uyun, (3/252).",
    "book_id": "648",
    "new_page_number": 53
  },
  {
    "serial_number": "34425",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "The Sixth Calamity: The Call to Rely on Medical Treatments Only, and Abandon Everything Related to Religion. Among the doctrinal calamities that occurred with the onset of the Corona epidemic is: The claim that treatment with medical drugs is the only cause for curing this epidemic and other diseases, and that legal [religious] treatment does not benefit nor lift the affliction, so everything related to religion must be abandoned; because that is merely myths and legends. A researcher in social psychology in Morocco called: to seek help from specialists; to understand the various aspects and merits of the subject. He also pointed out, according to his claim, the exploitation of the situation by some; to pass wrong religious discourses based on intimidation stemming from ignorance and belief in myth, stressing that the danger of those interpretations lies in encouraging the discourse of surrender, as well as instilling terror in people's souls, calling for clinging to the medical truth which states that the animal virus has become transmissible among humans (1). A writer said: I read strange interpretations and suggested treatments by clerics when infected with the Corona virus..., and the irony is that these clerics allow themselves to intervene in medicine and other modern sciences, and give opinions contrary to the experts in them, but they do not allow the doctor or others from the people of knowledge to understand religion, or give an opinion in understanding its texts; under the pretext that he is not a specialist in religion as they say. Another writer said: Science has triumphed, it is what heals, and people, including clerics, must listen to science. Neither religious incantations benefit, nor religious invocations benefit. Clerics take their instructions about daily behavior from scientists of modern science and technology, not from other clerics. There is no benefit for the general public in a holy book or a collection of prophetic hadiths or religious opinion or analogy or consensus. They must listen to scientists whom they only heard occasionally in normal circumstances. Now scientists and nurses steer the ship (2).",
    "foot_note": "1. See: Hespress electronic newspaper website https://www.hespress.com/orbites/462503.html\n2. See: Electronic Shorouk https://www.shorouknews.com/columns/view.aspx?cdate=17032020&id=c565dad2-ac6c-46e3-af1d-a1691ad094e9",
    "book_id": "648",
    "new_page_number": 54
  },
  {
    "serial_number": "34426",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "The correct doctrinal direction for this calamity is as follows: First: Believing that these diseases and epidemics are effective without the decree and will of Allah Almighty is a belief that impugns Tawhid (Monotheism); because there is nothing that is independent in effect without the will of Allah Almighty, and causes, however great, have no effect except by the permission of Allah Almighty. Allah Almighty said regarding the sorcerers: {But they do not harm anyone through it except by permission of Allah} [Al-Baqarah: 102], meaning by the decree of Allah (1), for nothing happens except by His will and volition, Glory be to Him (2). Allah Almighty legislated for us to take means, and commanded us to do so in many places, and seeking treatment with cures and medicines is part of taking means. The believer realizes Tawhid, so he knows that the entire matter belongs to Allah, and he complies with the Sharia so he takes means and uses everything that has benefit for his body and health. Ibn Taymiyyah, may Allah have mercy on him, says: The Ahl al-Sunnah do not deny the existence of causes created by Allah nor do they make them independent in effects. Rather, they know that there is no created cause except that its ruling depends on another cause, and it has impediments that prevent its ruling. Just as the sun is a cause for rays, and that depends on the presence of a body capable of receiving it, and it has an impediment like clouds and a roof. And Allah is the Creator of all causes, and the Repeller of impediments (3). As for the servant relying on causes completely with the belief that they benefit independently of Allah, this is major Shirk. And if he relied on the cause while believing that Allah is the One who benefits and harms, then he has fallen into minor Shirk. So the believer is commanded to perform the cause while relying on the Causer of causes, Glorified and Exalted is He. And if he leaves the causes and believes that the Sharia commanded leaving them and that they have no benefit, then he falls into opposition to what Allah commanded. He [Ibn Taymiyyah] says, may Allah have mercy on him: Therefore, a group of scholars said: Turning to causes [excessively] is Shirk in Tawhid, and erasing causes from being causes is a deficiency in reason, and turning away from causes completely is a defamation of the Sharia. Reliance (Tawakkul) that is commanded is what combines the requirements of Tawhid, reason, and Sharia (4).",
    "foot_note": "1. See: Tafsir al-Tabari, (2/450).\n2. See: Al-Lubab fi 'Ulum al-Kitab, Ibn Adel, (5/576).\n3. Dar' Ta'arud al-Aql wa al-Naql, (9/29).\n4. Majmoo' al-Fatawa (10/35).",
    "book_id": "648",
    "new_page_number": 55
  },
  {
    "serial_number": "34427",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "Ibn Sa'di, may Allah have mercy on him, said: The servant must know three things regarding causes: First: Not to make something a cause unless it is proven to be a cause legislatively or by destiny [empirically]. Second: The servant should not rely on them, but rely on their Causer and Decreer, while performing what is legislated of them, and being keen on what is beneficial of them. Third: Causes, however great and strong, are linked to Allah's decree and destiny, having no escape from it, and Allah Almighty disposes of them how He wills. (1) Second: Allah informed in His Book that a Muslim afflicted with a contagious disease or a disease for which no cure is hoped should be patient and seek reward from Allah Almighty, and not despair of healing; because healing is in the Hand of Allah Almighty alone. He must supplicate and resort to Him alone and humble himself before Him, for Allah is near and does not turn away a seeker. Neither the doctor nor the medicine are anything but means for the occurrence of Allah's decree and destiny. As He informed about the story of Job (Ayyub), peace be upon him, with illness and affliction, the Almighty said: {And [mention] Job, when he called to his Lord, \"Indeed, adversity has touched me, and You are the Most Merciful of the merciful.\" (83) So We responded to him and removed what afflicted him of adversity. And We gave him [back] his family and the like thereof with them as mercy from Us and a reminder for the worshippers (84)} [Al-Anbiya: 83-84]. And He said in another verse: {And remember Our servant Job, when he called to his Lord, \"Indeed, Satan has touched me with hardship and torment.\" (41) [So he was told], \"Strike [the ground] with your foot; this is a [spring for] a cool bath and drink.\" (42)} [Sad: 41-42] Meaning: Remember Our servant and messenger, Job - praising and honoring him, elevating his status - when He tested him with a severe affliction and found him patient, satisfied with Him. So he sought means to Allah by informing about his own condition, and that harm had reached its limit with him. So Allah answered him, so he struck with his foot and a spring of cold water came out from his strike, so he bathed in it and drank, and Allah removed the harm from him..., {And a reminder for the worshippers} meaning: We made him a lesson for the worshippers, who benefit from lessons. So if they saw the affliction that befell him, then what Allah rewarded him with after its removal, and they looked at the cause, they found it to be patience. Therefore Allah praised him for it in His saying: {Indeed, We found him patient, an excellent servant. Indeed, he was one repeatedly turning back [to Allah] (44)} so they made him a model and example when harm befalls them (2).",
    "foot_note": "1. Al-Qawl al-Sadid Sharh Kitab al-Tawhid, p. (46).\n2. See: Taysir al-Karim al-Rahman, p. (528).",
    "book_id": "648",
    "new_page_number": 56
  },
  {
    "serial_number": "34428",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "Third: Seeking treatment with medicines is from the Sunnah of Islam, and from the guidance of the Prophet, peace and blessings be upon him, with the Muslim's belief that Allah alone is the Healer. From Abu Hurayrah, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, who said: \"Allah has not sent down a disease except He sent down for it a cure\" (1). And in a narration: From Jabir, may Allah be pleased with him, from the Messenger of Allah, peace and blessings be upon him, that he said: \"For every disease there is a cure. So if the cure for the disease hits, it is cured by the permission of Allah Almighty (2).\" So there is nothing between the patient and the cure except knowing which medicines are suitable for his illness. If he knows it and takes it and seeks treatment with it, the cure occurs by the permission of Allah Almighty and His mercy. This is clarified by the Hadith of Ibn Mas'ud, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: \"Allah has not sent down a disease except He sent down with it a cure; known by who knows it, and ignored by who ignores it (3).\" Some Bedouins came asking him, peace and blessings be upon him: Is there sin upon us in such? Is there sin upon us in such? So he said to them: \"Servants of Allah, Allah has removed sin, except for one who borrowed [attacked] something from the honor of his brother, for that is the one who has sinned.\" They said: O Messenger of Allah, is there any blame on us if we do not seek treatment? He said: \"Seek treatment, O servants of Allah, for Allah, Glory be to Him, did not place a disease except He placed with it a cure, except for old age (4).\" When a sick person or patients came to the Prophet, peace and blessings be upon him, complaining of illness, he would guide them to what they could treat themselves with and seek healing with. From Abu Sa'id, may Allah be pleased with him: That a man came to the Prophet, peace and blessings be upon him, and said: My brother complains of his stomach [diarrhea]. He said: \"Give him honey to drink.\" Then he came a second time, and he said: \"Give him honey to drink.\" Then he came a third time and he said: \"Give him honey to drink.\" Then he came and said: I have done so? He said: \"Allah spoke the truth, and your brother's stomach lied. Give him honey to drink.\" So he gave him drink and he was cured (5). Sheikh Ibn Baz, may Allah have mercy on him, says: There is no harm in seeking treatment if the occurrence of the disease is feared; due to the presence of an epidemic or other causes by which the occurrence of disease is feared. So there is no harm in taking medicine to repel the affliction that is feared, due to the saying of the Prophet, peace and blessings be upon him, in the authentic Hadith: \"Whoever takes seven dates of Al-Madinah in the morning will not be harmed by magic nor",
    "foot_note": "1. Reported by Al-Bukhari in the Book of Medicine, Chapter: Allah has not sent down a disease except He sent down for it a cure, Hadith (5678), (7/122).\n2. Reported by Muslim in the Book of Peace, Chapter: For every disease there is a cure and recommendation of treatment, Hadith (2204), (4/1729).\n3. Reported by Ibn Hibban in his Sahih, Hadith (6062), (13/427), and authenticated by Al-Albani in Al-Silsilah Al-Sahihah, (1/814).\n4. Reported by Ibn Majah, Hadith (3436), (3/1137), and Ahmad in Al-Musnad without the wording of the first part of the hadith, Hadith (18455), (20/398), and Al-Hakim in Al-Mustadrak, Hadith (8206), (4/441). Al-Hakim said: This hadith has a Sahih chain, and Al-Dhahabi agreed with him in Al-Talkhis. Al-Arna'ut said in the footnotes of Al-Musnad, (20/398): A Sahih Hadith.\n5. Reported by Al-Bukhari in the Book of Medicine, Chapter: Treatment with Honey, Hadith (5684), (7/123), and Muslim in the Book of Peace, Chapter: Treatment by drinking honey, Hadith (2217), (4/1736).",
    "book_id": "648",
    "new_page_number": 57
  },
  {
    "serial_number": "34429",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "poison (1).\" This falls under repelling the affliction before it occurs. Thus, if a disease is feared and vaccination is taken against the epidemic occurring in the country or anywhere, there is no harm in that as a means of defense. Just as the descending disease is treated, the disease that is feared is treated with medicine. However, it is not permissible to hang amulets and charms against disease or Jinn or the evil eye; because the Prophet, peace and blessings be upon him, forbade that. And he, peace and blessings be upon him, clarified that this is minor Shirk, so one must beware of that (2). Fourth: It was his Sunnah, peace and blessings be upon him, to seek treatment through supplication. He used to call upon Allah Almighty with supplications during illness; seeking healing from Him, Glory be to Him. He did not neglect medical treatment or lack keenness for it, but rather he wanted the Muslim's attachment to be to Allah in his health and illness, and to humble himself to Him, Glory be to Him, to lift his harm; because no one is capable of that except Allah. From Uthman bin Abi al-As al-Thaqafi, may Allah be pleased with him, that he complained to the Messenger of Allah, peace and blessings be upon him, of a pain he felt in his body since he became Muslim. The Messenger of Allah, peace and blessings be upon him, said to him: \"Put your hand on the part of your body that hurts, and say 'Bismillah' (In the name of Allah) three times, and say seven times: 'I seek refuge in Allah and His power from the evil of what I find and what I fear'\" (3). Ibn al-Qayyim, may Allah have mercy on him, said: Supplication is one of the strongest causes for repelling the disliked and achieving the desired. But its effect may lag behind it, either due to weakness in itself by being a supplication that Allah does not love; because it contains aggression, or due to weakness of the heart and its lack of turning to Allah and focusing on Him at the time of supplication; so it is like a very loose bow, for the arrow comes out of it weakly. Or due to the presence of an obstacle to the answer: such as eating Haram (unlawful), oppression, the staining of sins on the hearts, and the domination of heedlessness, desire, and amusement over them (4). From Ata' bin Abi Rabah, may Allah have mercy on him, said: Ibn Abbas, may Allah be pleased with them both, said to me: Shall I show you a woman from the people of Paradise? I said: Yes. He said: This black woman came to the Prophet, peace and blessings be upon him, and said: I suffer from epilepsy, and I become uncovered, so pray",
    "foot_note": "1. Reported by Al-Bukhari in the Book of Medicine, Chapter: Drinking Poison and Treating with it and what is feared from it and the Malicious, Hadith (5779), (7/140), and Muslim in the Book of Drinks, Chapter: Merit of dates of Medina, Hadith (2047), (3/1618).\n2. Majmoo' Fatawa Ibn Baz, (6/21).\n3. Reported by Muslim, in the Book of Peace, Chapter: Recommendation of placing one's hand on the place of pain with supplication, Hadith (2202), (4/1728).\n4. Al-Jawab al-Kafi liman sa'ala 'an al-Dawa' al-Shafi, p. (9).",
    "book_id": "648",
    "new_page_number": 58
  },
  {
    "serial_number": "34430",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "to Allah for me. He said: \"If you wish, be patient and you will have Paradise. And if you wish, I will invoke Allah to heal you.\" She said: I will be patient. She said: I become uncovered, so invoke Allah for me that I do not become uncovered. So he prayed for her\" (1). Ibn Hajar, may Allah have mercy on him, said: In this is evidence for the permissibility of abandoning medical treatment. And in it is that the treatment of all diseases by supplication and resorting to Allah is more successful and beneficial than treatment with drugs, and that the effect of that and the body's reaction to it is greater than the effect of physical medicines. But it is only successful with two things: one from the side of the ailing person, which is sincerity of intention, and the other from the side of the healer, which is the strength of his orientation and the strength of his heart through piety and reliance (2). Ibn Baz, may Allah have mercy on him, said: Allah, Glorified and Exalted, has made in what He sent down to His Prophet, peace and blessings be upon him, of the Book and the Sunnah, the cure for all what people complain of regarding physical and spiritual diseases. Allah has benefited the servants thereby, and through it, goodness has been obtained which none can count except Allah Almighty (3).",
    "foot_note": "1. Reported by Al-Bukhari, in the Book of Patients, Chapter: Merit of one who suffers epilepsy from the wind, Hadith (5652), (7/116), and Muslim, in the Book of Virtue, Connection, and Manners, Chapter: Reward of the Believer in what befalls him of illness, or sadness, or the like even the thorn that pricks him, Hadith (2576), (4/1994).\n2. Fath al-Bari, (10/115).\n3. Majmoo' Fatawa Bin Baz, (9/411).",
    "book_id": "648",
    "new_page_number": 59
  },
  {
    "serial_number": "34431",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "The Seventh Calamity: The Belief that the Corona Epidemic is Mentioned in the Qur'an. Among the doctrinal calamities that occurred with the onset of the Corona epidemic is: What spread on social media, a post whose writer claims that the Corona epidemic is mentioned in the Holy Qur'an, specifically in Surah Al-Muddathir, and linked some words of the Surah to it. This post stated the following: This crown virus called Corona, is mentioned in the Holy Qur'an fourteen centuries ago. The time of its appearance was mentioned, the place of its appearance was mentioned, the reason for its appearance was mentioned, the method of dealing with it and preventing it upon its appearance was mentioned, and the wisdom of its appearance was mentioned. Indeed, its correct name was mentioned. All of that is mentioned in the same Surah, which is Surah Al-Muddathir. This virus that baffled humans, and was a cause for taking many lives, leaving nothing and sparing nothing, scientists named it (covid 19). It was named so because it appeared at the end of the year two thousand and nineteen. This was mentioned in Verse [30] of Surah Al-Muddathir: {It leaves nothing remaining and spares nothing (28) Scorching to the humans (29) Over it are nineteen (30)}. This virus appeared in a country that is currently the second economic power in the world, and the first country globally in terms of population density. Reference to that came in Verses [12] and [13] of Surah Al-Muddathir: {Leave Me with the one I created alone (11) And to whom I granted extensive wealth (12) And children present [with him] (13)}. As for how to deal with this virus, the whole world is still thinking, estimating, and looking in search of a cure. While it is mentioned in the beginning of Surah Al-Muddathir summarized in six stages: Awareness, Takbir (Magnifying Allah), Purification, Sanitary Isolation, Non-accumulation, and Patience. So awareness and warning people of the danger of this virus is mentioned in Verse [2]: {Arise and warn (2)}. Takbir and increasing supplication and remembrance of Allah is mentioned in Verse [3]: {And your Lord glorify (3)}. Purification, sterilization, and washing hands and clothes is mentioned in Verse [4]: {And your clothing purify (4)}. And quarantine, by not mixing with people, to avoid infection with this 'Rijz' (plague), is mentioned in Verse [5]: {And uncleanliness avoid (5)}.",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 60
  },
  {
    "serial_number": "34432",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "And not accumulating or rushing to stockpile food at the time of crisis is mentioned in Verse [6]: {And do not confer favor to acquire more (6)}. And patience over this affliction, especially in cases of death, is mentioned in Verse [7]: {But for your Lord be patient (7)}. Viruses are among the smallest living organisms; therefore, they are among the most numerous, for no one knows their number except Allah Almighty. And they are among the soldiers of Allah that we do not see, and we did not know of their existence. The purpose of their appearance is to be an admonition and a reminder to humans and a test for them, so the believers increase in faith in Allah and the Qur'an, while it increases the disbelievers only in disbelief and error. All of that was explained in Verse [31] of Surah Al-Muddathir: {And We have not made their number except as a trial for those who disbelieve - that those who were given the Scripture will be convinced and those who have believed will increase in faith...} to His saying: {Thus does Allah leave astray whom He wills and guides whom He wills. And none knows the soldiers of your Lord except Him. And it is not but a reminder to humanity (31)}. As for the name of the virus, it is worth noting that it belongs to the family of Crown Viruses, and it was named so because above the virus are horns resembling a crown (couronne); therefore its scientific name became (Co-ro-na Virus). As for its correct legitimate name, it is: Al-Naqur (Na-co-ro Virus), and it is mentioned in Verse [8] of Surah Al-Muddathir: {That when the Trumpet (Al-Naqur) is blown (8) That Day will be a difficult day (9) For the disbelievers, not easy (10)}. Rather, it is not permissible to name it (Corona), because it is derived from the Qur'an (Coran), and refuge is sought with Allah, and perhaps this is from the plot of the disbelievers against Muslims (1). Another post stated: That the verse: {It leaves nothing remaining and spares nothing (28) Scorching to the humans (29) Over it are nineteen (30)}, refers to the name of the virus Covid 19.",
    "foot_note": "1. See: Rqiim electronic website https://www.rqiim.com/rania10682",
    "book_id": "648",
    "new_page_number": 61
  },
  {
    "serial_number": "34433",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "As for the legitimate and real name of the virus, it is: Al-Naqur, as mentioned in the eighth verse of Surah Al-Muddathir: {That when the Trumpet (Al-Naqur) is blown (8) That Day will be a difficult day (9) For the disbelievers, not easy (10)}. As for naming it Corona, it is not permissible, because it is derived from the Qur'an (Coran) (1). This virus that baffled humans and was a cause for taking many lives and scientists named it (covid 19); because it appeared at the end of the year two thousand and nineteen, the evidence for mentioning the year of appearance came in Verse [30] of Surah Al-Muddathir: {It leaves nothing remaining and spares nothing (28) Scorching to the humans (29) Over it are nineteen (30)} (2), and that it will accompany earthquakes, volcanoes and other things (3).",
    "foot_note": "1. See: Sawtak electronic website https://www.irfaasawtak.com/extremism/2020/03/30/\n2. See: Al-Wakala News website https://elwekalanews.net/411656/\n3. See: Al-Bawaba electronic magazine website https://www.albawabhnews.com/3950628",
    "book_id": "648",
    "new_page_number": 62
  },
  {
    "serial_number": "34434",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directions for Doctrinal Calamities Related to the Corona Epidemic - Covid 19",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "The correct doctrinal direction for this calamity is as follows: First: Any fabrication and daring against Allah by burdening His verses with what they do not bear of corrupt indications and wrong interpretations is religiously prohibited. Allah has threatened those who do that with loss in this world and punishment in the Hereafter. The Almighty said: {Say, \"Indeed, those who invent falsehood about Allah will not succeed.\" (69) [It is but] a brief enjoyment in this world; then to Us is their return; then We will make them taste the severe punishment because they used to disbelieve (70)} [Yunus: 69-70]. Meaning: They will not attain their objective, nor will their intent be achieved. They only enjoy their disbelief and lying in the world a little, then they move to Allah and return to Him, so He makes them taste the severe punishment because they used to disbelieve (1). Rather, Allah named speaking about Him [without knowledge] as lying, and made it among the greatest indecencies in His saying: {Say, \"My Lord has only forbidden immoralities - what is apparent of them and what is concealed - and sin, and oppression without right, and that you associate with Allah that for which He has not sent down authority, and that you say about Allah that which you do not know\" (33)} [Al-A'raf: 33]. This is general in the prohibition of speaking in religion without certainty (2). The Prophet, peace and blessings be upon him, warned against interpreting the Qur'an without knowledge or merely by opinion. From Ibn Abbas, may Allah be pleased with them both, from the Prophet, peace and blessings be upon him, who said: \"Whoever speaks about the Qur'an by his opinion, or by what he does not know, let him take his seat in the Fire\" (3). Al-Tirmidhi, may Allah have mercy on him, said: It has been reported from some people of knowledge among the Companions of the Prophet, peace and blessings be upon him, and others, that they were strict regarding this, in interpreting the Qur'an without knowledge. As for what was reported from Mujahid, Qatadah, and others of the people of knowledge that they interpreted the Qur'an, the assumption about them is not that they spoke about the Qur'an or interpreted it without knowledge or from themselves. It has been reported from them what indicates what we said, that they did not speak from themselves without knowledge (4). Ibn al-Qayyim, may Allah have mercy on him, said: Allah arranged the prohibitions into four ranks, and began with the easiest of them which is immoralities (Fawahish), then followed with what is more strictly prohibited than it which is sin and oppression, then tripled with what is greater in prohibition than them which is Shirk with Him.",
    "foot_note": "1. See: Tafsir al-Qur'an al-Karim, p. (369).\n2. See: Zad al-Masir fi Ilm al-Tafsir, Ibn al-Jawzi, (2/116).\n3. Reported by Al-Tirmidhi, Hadith (2950), (5/199), Al-Nasa'i in Al-Kubra, Hadith (8031), (7/286), and Al-Baghawi in Sharh al-Sunnah, (118), (1/258). Al-Tirmidhi said: Hasan Hadith.\n4. Sunan Al-Tirmidhi, (5/200).",
    "book_id": "648",
    "new_page_number": 63
  },
  {
    "serial_number": "34435",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "Glory be to Him, then he added a fourth [prohibition] which is more severely prohibited than all of that, which is speaking about Him without knowledge. This encompasses speaking about Him, Glory be to Him, without knowledge regarding His names, attributes, actions, religion, and legislation (1). He, may Allah have mercy on him, clarified in another place the danger of speaking about Allah without knowledge, saying: 'This is the greatest of prohibitions with Allah and the most severe in sin; for it involves lying against Allah, attributing to Him what does not befit Him, altering and changing His religion, denying what He affirmed and affirming what He denied, realizing what He invalidated and invalidating what He realized, enmity towards those He allied with and allegiance to those He opposed, loving what He hated and hating what He loved, and describing Him with what does not befit Him in His essence, attributes, sayings, and actions. So there is no type of prohibition greater with Allah than it, nor more severe in sin. It is the origin of Shirk (polytheism) and Kufr (disbelief), and upon it innovations and misguidances are founded. So every misleading innovation in religion has its basis in speaking about Allah without knowledge' (2). Scholars have been strict against those who dare to interpret the Quran based on their opinion or without knowledge. Malik bin Anas, may Allah have mercy on him, said: 'No man who is not knowledgeable in the languages of the Arabs shall be brought to me interpreting it [the Quran] except that I will make an example of him [punish him severely]' (3). Al-Wahidi, may Allah have mercy on him, said: 'How is it possible for one ignorant of the language of the Arabs to know the interpretation of a Book made a miracle in the eloquence of its words and the depth of its purposes, revealed to the Seal of Prophets and Master of Messengers, peace and blessings be upon him, in a time when his people were adorned with eloquence and challenged with excellent speech and honorable expression? The likeness of one who seeks that is like one who witnesses war without a weapon, and attempts to ascend to the sky without a wing. Then, even if his contemplation of the works of commentators is prolonged, and he follows the sayings of the people of interpretation from the early and later generations, standing upon the meanings they deposited in their books, and knowing their words by which they expressed the meanings of the Quran, he would only be an imitator of them in what they narrated, and knowing the meanings of the sayings of Mujahid, Muqatil, Qatada, Al-Suddi, and others' (4). Ibn Taymiyyah, may Allah have mercy on him, said: 'As for interpreting the Quran by mere opinion, it is forbidden' (5).",
    "foot_note": "1. I'lam al-Muwaqqi'in 'an Rabb al-'Alamin, (1/ 31). \n2. Madarij al-Salikin bayna Manazil Iyyaka Na'budu wa Iyyaka Nasta'in, (1/ 378). \n3. Narrated by Al-Bayhaqi in Shu'ab al-Iman, No. (2090), (3/ 543). \n4. Al-Tafsir al-Basit, (1/ 411). \n5. Majmu' al-Fatawa, (13/ 370).",
    "book_id": "648",
    "new_page_number": 64
  },
  {
    "serial_number": "34436",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "Similarly, Ibn Kathir, may Allah have mercy on him, said: 'As for interpreting the Quran by mere opinion, it is forbidden' (1). The Salaf (righteous predecessors), may Allah have mercy on them, used to be cautious about speaking regarding the Quran without knowledge. Abu Bakr Al-Anbari, may Allah have mercy on him, said: 'The Imams of the past Salaf used to refrain from interpreting the problematic parts of the Quran. Some would estimate that what they interpret might not align with the intent of Allah Almighty, so they would refrain from speaking' (2). Ibn Atiyyah, may Allah have mercy on him, said: 'A group of the prominent Salaf, such as Sa'id bin Al-Musayyib, Amir Al-Sha'bi, and others, used to revere the interpretation of the Quran and refrain from it; out of piety and caution for themselves, despite their perception and precedence' (3). Second: That the verses used as evidence that they speak about the Corona virus in Surah Al-Muddathir is a wrong inference; because the context of the verses speaks about the following matters: His saying, the Almighty: {Arise and warn (2)} was interpreted by Qatada, may Allah have mercy on him, saying: Meaning warn of Allah's punishment and His events among nations, and the severity of His vengeance (4). Al-Baghawi, may Allah have mercy on him, said: Meaning warn the disbelievers of Mecca (5). As for His saying, the Almighty {And your Lord glorify (3)}, Al-Tabari, may Allah have mercy on him, said: Meaning, and your Lord, O Muhammad, magnify by worshipping Him, and desiring Him for your needs exclusively without other gods and peers (6). Ibn Adil, may Allah have mercy on him, said: It is to say: Allahu Akbar (Allah is the Greatest). It was said: The intended meaning is the Takbir in prayer. And it was said: Magnify Him above idle talk and obscenity (7).",
    "foot_note": "1. Tafsir al-Quran al-Azim, (1/ 10). \n2. Tafsir al-Qurtubi, (1/ 34). \n3. Al-Muharrar al-Wajiz, (1/ 41). \n4. Tafsir al-Tabari, (23/ 9). \n5. Tafsir al-Baghawi, (5/ 173). \n6. See: Tafsir al-Tabari, (23/ 9). \n7. Al-Lubab fi Tafsir al-Kitab, (19/ 494).",
    "book_id": "648",
    "new_page_number": 65
  },
  {
    "serial_number": "34437",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "As for His saying, the Almighty: {And your clothing purify (4)}, meaning: Do not wear them in disobedience or treachery, for the treacherous and immoral person is called 'dirty of clothes' (1). Arabs say: So-and-so is 'clean of clothes' if his deeds are righteous, and so-and-so is 'dirty of clothes' if his deeds are wicked (2). On the authority of Ibn Abbas, may Allah be pleased with them both, regarding {And your clothing purify (4)}, he said: From sin, and in the speech of the Arabs it is 'clean of clothes' (3). As for His saying, the Almighty: {And uncleanliness avoid (5)}, Mujahid and Ikrimah said: Idols (4). 'Ar-Rujz' in language: means punishment. It has two dialects: breaking the Ra (Rijz) and joining it (Rujz). Polytheism and idol worship were called 'Rujz' because they are the cause of the punishment leading to it (5). As for His saying, the Almighty: {And do not confer favor to acquire more (6)}, Ibn Abbas, may Allah be pleased with them both, said: Do not give a gift seeking a better one in return (6). Mujahid said: You give money as a bribe hoping for better than it in reward in this world (7). Al-Wahidi, may Allah have mercy on him, said: Do not give something to take more than it. This is specific to the Prophet, peace and blessings be upon him; because he is commanded with the most majestic morals and noblest manners (8). As for His saying, the Almighty: {But for your Lord be patient (7)}, Mujahid, may Allah have mercy on him, said: Regarding what you were harmed with. It was said: For the truth and delivering the message (9).",
    "foot_note": "1. Al-Tafsir al-Wajiz, (1/ 1148). \n2. Tafsir al-Sam'ani, (6/ 89). \n3. Narrated by Ibn Abi Hatim in his Tafsir, (10/ 3382). \n4. See: Tafsir al-Tabari, (23/ 13). \n5. Al-Tafsir al-Wasit, (4/ 381). \n6. Narrated by Ibn Abi Hatim in his Tafsir, (10/ 3382). \n7. See: Tafsir al-Tabari, (23/ 15). \n8. Al-Tafsir al-Wajiz, (1/ 1149). \n9. Tafsir al-Sam'ani, (6/ 90).",
    "book_id": "648",
    "new_page_number": 66
  },
  {
    "serial_number": "34438",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "Ibn Zaid, may Allah have mercy on him, said: Its meaning is that you have borne a great matter involving fighting Arabs and non-Arabs, so be patient regarding it for Allah Almighty. It was said: So be patient under the resources of destiny for the sake of Allah (1). As for His saying, the Almighty: {Leave Me with whom I created alone (11) And granted him extensive wealth (12) And children present [with him] (13)}, Mujahid, may Allah have mercy on him, said: It was revealed regarding Al-Walid bin Al-Mughira, and likewise all creation. Qatada, may Allah have mercy on him, said: It is Al-Walid bin Al-Mughira, Allah brought him out of his mother's womb alone, having no wealth or child, then Allah granted him wealth, children, riches, and growth. (2) As for His saying, the Almighty: {I will drive him into Saqar (26) And what can make you know what is Saqar? (27) It lets nothing remain and leaves nothing [unburned] (28) Blackening the skins (29) Over it are nineteen [angels] (30)}, His saying: {Over it are nineteen (30)}, speaks about angels as established in the Hadiths, and the saying of most scholars of interpretation. On the authority of Al-Bara' bin Azib, may Allah be pleased with him, that a group of Jews asked a man from the companions of the Prophet, peace and blessings be upon him, about the keepers of Hell. He said: 'Allah and His Messenger know best.' So the man came and informed the Prophet, peace and blessings be upon him, so it was revealed to him: {Over it are nineteen (30)}' (3). On the authority of Jabir bin Abdullah, may Allah be pleased with him, said: Some Jews said to some companions of the Prophet, peace and blessings be upon him: Does your Prophet know how many are the keepers of Hell? They said: We do not know until we ask him. So a man came to the Prophet, peace and blessings be upon him, and said: O Muhammad, your companions were defeated today. He said: 'And by what were they defeated?' He said: Jews asked them: Does your Prophet know how many are the keepers of Hell? He said: 'So what did they say?' He said: They said: We do not know until we ask our Prophet. He said: 'Are a people defeated who were asked about what they do not know? So they said: We do not know until we ask our Prophet. But they asked their Prophet, saying: Show us Allah explicitly. Bring me the enemies of Allah; I will ask them about the soil of Paradise, which is Darmak (fine flour) (4). So when they came, they said: O Abu Al-Qasim, how many are the keepers of Hell? He said: 'Like this and like this, once ten, and once nine.' They said:",
    "foot_note": "1. Tafsir al-Baghawi, (5/ 174). \n2. See: Tafsir al-Tabari, (23/ 19). \n3. Narrated by Ibn Abi Hatim in his Tafsir, No. (19039), (10/ 3383), and Al-Bayhaqi in Al-Ba'th wa Al-Nushur, No. (1040), p. (665). \n4. Al-Darmak: Pure flour, and it was said it is what is ground finely until it becomes minute from everything like flour and kohl. See: Tahdhib al-Lugha, Al-Azhari, (10/ 233), and Gharib al-Hadith, Ibn al-Jawzi, (1/ 334).",
    "book_id": "648",
    "new_page_number": 67
  },
  {
    "serial_number": "34439",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "Yes. The Prophet, peace and blessings be upon him, said to them: 'What is the soil of Paradise?' He said: So they were silent for a while, then said: Bread, O Abu Al-Qasim. The Messenger of Allah, peace and blessings be upon him, said: 'Bread is from Darmak' (1). And from him, may Allah be pleased with him, that they asked his companions and they said: Until we ask our Prophet, peace and blessings be upon him. So they asked him, and he, peace and blessings be upon him, said: 'They are nineteen' (2). Al-Bayhaqi, may Allah have mercy on him, said: Most scholars of interpretation hold that they are nineteen angels along with Malik, the keeper of the Fire (3). Al-Qurtubi, may Allah have mercy on him, said: Meaning over Saqar are nineteen angels throwing its inhabitants into it... and the nineteen angels are its keepers, Malik and eighteen angels. It is possible that the nineteen are chiefs, and it is possible that they are nineteen angels specifically, and most commentators are on this view (4). Third: That the claim that the legal and real name for the Corona virus is {Al-Naqur}, and that the word {Al-Naqur} is synonymous with the novel virus is an incorrect claim; because the word Naqur in language means: The Trumpet (Sur) in which the Angel blows: meaning blows (5). Likewise, the scholars of interpretation said that the Naqur is: The Trumpet (6), and it is the one blown into for the Gathering (7). Mujahid, may Allah have mercy on him, said: It is like the shape of a horn (8), and Naqur: is a noun of instrument, on the pattern of Fa'ul, like: Satur (cleaver) (9).",
    "foot_note": "1. Narrated by Al-Tirmidhi, No. (3327), (5/ 429), and Ahmad in Al-Musnad, No. (14883), (23/ 164), and Shu'aib Al-Arna'ut said in the footnote of Al-Musnad, (23/ 164): Hasan due to others. \n2. Narrated by Al-Bayhaqi in Al-Ba'th wa Al-Nushur, No. (1040), p. (665). \n3. Al-Ba'th wa Al-Nushur, p. (665). \n4. Tafsir al-Qurtubi, (19/ 79). \n5. See: Al-Muhkam wa al-Muhit al-A'zam, Ibn Sidah, (6/ 372). \n6. See: Tafsir al-Quran al-Azim, (8/ 264). \n7. See: Tahdhib al-Lugha, (9/ 91). \n8. See: Tafsir al-Quran al-Azim, (8/ 264). \n9. See: Al-Nahw al-Wafi, Abbas Hasan, (3/ 337).",
    "book_id": "648",
    "new_page_number": 68
  },
  {
    "serial_number": "34440",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "And this is how the Prophet, peace and blessings be upon him, interpreted it. On the authority of Abu Sa'id Al-Khudri, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: 'How can I be comfortable while the owner of the Horn (Trumpet) has put the Horn in his mouth, lowered his forehead, and inclined his ear; waiting to be ordered to blow so he blows?' The Muslims said: So what should we say, O Messenger of Allah? He said: 'Say: Allah is sufficient for us and He is the best Disposer of affairs, we rely upon Allah our Lord' (1). Fourth: That the word Corona is not the name of the Quran or derived from it; because the name of the Quran is written in English: (Qur'an). As for (Coran): it means the Quran in French, but the origin of the virus's name is not French, and even if we assumed it was in French, there is a difference between (Corona) and (Coran). The scientific term Corona virus is foreign and Arabized, its origin is from the Latin language: (corona), meaning wreath (2) or crown (3). In Latin, corona means crown, and the same meaning remained even in modern languages like Spanish. In English, the anatomical term corona is used; for body parts that resemble a crown (4). The name is taken from the distinctive appearance that reminds us of a crown or wreath when viewed under a transmission electron microscope..., which contains a margin of large bulbous projections creating an image resembling a crown or wreath (5).",
    "foot_note": "1. Narrated by Ahmad in Al-Musnad, No. (11039), (17/ 89), and Al-Tirmidhi, No. (3243), (5/ 226), and Abu Nu'aym in Al-Hilyah, (7/ 312), and Al-Tirmidhi said: Hasan Hadith, and Al-Albani authenticated it in Al-Silsilah Al-Sahihah, (3/ 68). \n2. See: Takmilat Ma'ajim al-Lugha al-Arabiyyah, (9/ 121). \n3. See: Al-Maany Online Dictionary https:// www.almaany.com/ ar/ dict/ ar-en/ corona \n4. See: Al-Hurra Channel website https:// www.alhurra.com/ health/ 2020/ 01/ 31/ \n5. See: Al-Marefa Electronic website https:// www.marefa.org/",
    "book_id": "648",
    "new_page_number": 69
  },
  {
    "serial_number": "34441",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "The Eighth Occurrence: The Claim that the Corona Epidemic is Man-Made. Among the doctrinal occurrences (Nawazil) that happened with the onset of the Corona epidemic is: What some media outlets mentioned that the Corona virus is man-made. Among that is the post that appeared in a newspaper, which stated: Scientific circles circulate from time to time scenarios about the Corona virus where some believe it is purely a human production, while others, who are the majority, see that the virus is a natural product resulting from some wildlife such as bats and anteaters. (1) Another newspaper mentioned the following news: Since the early stages of the virus outbreak, conspiracy theories about the origin and scope of the disease have spread on internet platforms. Among the allegations was that the virus is part of a 'secret Chinese biological weapons program', and that a spy team sent the Corona virus to Wuhan (WHAN) (2). Another newspaper reported the following news: While Chinese officials stated that the virus might have originated from a US military laboratory, in a clear attempt by Beijing to ward off the attack against it; especially after a team from the World Health Organization recently arrived in Wuhan (WHAN) to investigate the origin of the virus. (3)",
    "foot_note": "1. See: Article in Al-Bilad Newspaper https:// albiladdaily.com/ 2020/ 05/ 01/ \n2. See: Article in Al-Madina Newspaper https:// www.al-madina.com/ article/ 687372/ \n3. See: Article in Asharq Al-Awsat Newspaper https:// aawsat.com/ home/ article/ 2763911",
    "book_id": "648",
    "new_page_number": 70
  },
  {
    "serial_number": "34442",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "The doctrinal directive for this occurrence is as follows: That saying the virus is man-made is among the expressions upon which judgment should not be passed generally, but rather detailing is required as follows: First: If the intention is that they created the virus from nothing, this is forbidden; because it implies proving that there is a creator other than Allah. The correct belief is that the virus is from Allah's creation as the Almighty said: {Or have they attributed to Allah partners who created like His creation so that the creation seemed alike to them? Say, \"Allah is the Creator of all things, and He is the One, the Prevailing\" (16)} [Ar-Ra'd: 16]. This is a question of denial, meaning: The matter is not like this such that it becomes confused. Rather, if they thought with their minds, they would find Allah is unique in creation, and all partners do not create a creation similar to Allah's creation (1). And the Almighty said: {O mankind, remember the favor of Allah upon you. Is there any creator other than Allah who provides for you from the heaven and earth? There is no deity except Him, so how are you deluded? (3)} [Fatir: 3]. This is a question by way of affirmation, as if He said there is no creator other than Allah (2). And the Almighty said: {O people, an example is presented, so listen to it. Indeed, those you invoke besides Allah will never create [as much as] a fly, even if they gathered together for it. And if the fly should steal away from them a [tiny] thing, they could not recover it from him. Weak are the pursuer and pursued (73) They have not appraised Allah with true appraisal. Indeed, Allah is Powerful and Exalted in Might (74)} [Al-Hajj: 74]. For all that you worship besides Allah of gods and idols, if they were gathered, they would not create a fly despite its smallness and insignificance, because they are not capable of that nor can they bear it, even if they all gathered to create it (3). On the authority of Abu Huraira, may Allah be pleased with him, said: I heard the Messenger of Allah, peace and blessings be upon him, say: Allah the Almighty said: 'And who is more unjust than one who goes to create a creation like My creation? Let them create an atom, or let them create a grain, or let them create a barley grain' (4). Its meaning is let them create an atom in which there is a soul acting by itself like this atom which is Allah's creation. Likewise, let them create a grain of wheat or barley, meaning: Let them create a grain that has taste to be eaten, sown, and sprout, and found",
    "foot_note": "1. See: Al-Wasit fi Tafsir al-Quran al-Majid, Al-Wahidi, (3/ 12). \n2. See: Ma'alim al-Tanzil fi Tafsir al-Quran, Al-Baghawi, (3/ 688). \n3. See: Tafsir al-Tabari, (18/ 658). \n4. Narrated by Al-Bukhari, No. (7559), (9/ 161), and Muslim, No. (2111), (3/ 1671).",
    "book_id": "648",
    "new_page_number": 71
  },
  {
    "serial_number": "34443",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "in it what is found in the grain of wheat and barley and the like of grains that Allah Almighty creates. This is a command of incapacitation. (1) Second: If the meaning of saying this virus is made in laboratories, and the making here is hybridization (2) or mixing it with another virus; with the intention of strengthening the virus or modifying some of its characteristics, this is possible, and happens often in research centers and scientific laboratories, but it is not called manufacturing but rather hybridization or mixing. Third: Many scientific laboratories and international health organizations have proven that the virus is not man-made. The laboratory of the National Center for Disease Prevention and Control (Weqaya) mentioned in revealing the complete genetic sequence of the new Corona virus (SARS-CoV-2) from positive cases of Covid (19). The Executive Director of the Center, Dr. Abdullah Al-Qwaizani said: 'Genetic analysis of the new Corona virus (hCoV-19) is important to understand the development of the new virus and know its spread.' He added: 'The new Corona virus is considered one of the emerging viruses, so it is important to determine the source of its entry into the Kingdom and the path of its spread and mutation and to monitor the global development of the virus' (3). The World Health Organization had stated that the emerging Corona virus is of animal origin, meaning it is transmitted to humans from contact with infected animals. Despite this, some believe that the virus was developed in laboratories. To test this hypothesis, a team of scientists in the US state of California studied the genetic material of the new virus. According to research published in the journal (Nature Medicine), scientists analyzed the emerging Corona virus in addition to four other viruses from the Corona family, including SARS (SARS) Severe Acute Respiratory Syndrome, and MERS (MERS) Middle East Respiratory Syndrome.",
    "foot_note": "1. See: Sharh Sahih Muslim, Al-Nawawi, (14/ 91). \n2. Hybridization is human intervention in the production of animals or plants; to ensure obtaining the desired traits in future generations, i.e., mixing breeds. See: Mu'jam al-Lugha al-Arabiyyah al-Mu'asirah, (2/ 2328). \n3. See: Saudi Press Agency SPA https:// www.spa.gov.sa/ viewstory.php? lang=ru&newsid=2049484",
    "book_id": "648",
    "new_page_number": 72
  },
  {
    "serial_number": "34444",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "Scientists discovered two main differences between the emerging Corona virus and its predecessors. The first is the difference in the protein ratio that binds it to the host cell, and the second is the difference in the amino acids covering the envelope of this virus from other viruses. These differences make the emerging Corona virus bind more easily to human cells. But at the same time, these differences showed scientists some errors not expected to exist in a virus developed in scientific laboratories. Scientists also indicated that the basic structure of the emerging Corona virus matches viruses discovered in bats and anteaters only, which indicates the virus was not manufactured in laboratories but transmitted through animals (1).",
    "foot_note": "1. See: DW News website https:// www.dw.com/ ar/",
    "book_id": "648",
    "new_page_number": 73
  },
  {
    "serial_number": "34445",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "The Ninth Occurrence: Astrology and Claiming Knowledge of the Unseen regarding the Corona Epidemic. With the onset of the Corona epidemic, doctrinal occurrences related to astrology and claiming knowledge of the unseen abounded; this is due to the love of looking forward to what will happen in the future, and to the outcome of life in light of the fear humans live in, and the anticipation they await for the results of this epidemic. Among that is what social media witnessed of circulating a book called 'Akhbar Az-Zaman' (News of Time) attributed to the author Ibrahim bin Saluqiyyah, which predicts the end of the world during March (2020); due to the spread of the Corona virus, accompanied by earthquakes and volcanoes. This caused a state of panic and great anxiety among social media users, and they circulated one of its alleged pages numbered (365), the beginning of its poem being: Until if the two numbers equal (20 - 20), and the disease of the time spreads. Site pioneers linked these words to the successive events the world is going through since the beginning of 2020 AD, especially with the outbreak of the Corona virus as a global pandemic, the spread of locusts in some African countries, and the decision to stop Umrah and evacuate the Grand Mosque in Mecca for sterilization (1). Also, many social media messages were circulated talking about another book: 'Aza'im Ad-Duhur' (Great Calamities of Ages) by the author Abu Ali Al-Dubayzi who died in the year (565 AH), and it is believed he predicted the spread of the Corona virus about a thousand years ago, the beginning of its poem being: When the twenty comes... centuries and centuries and centuries. (2)",
    "foot_note": "1. See: Sada El-Balad Newspaper website https:// www.elbalad.news/ 4239940 \n2. See: Akhbar El-Yom Newspaper website https:// www.elbalad.news/ 4239940, and Al-Wafd Newspaper website https:// alwafd.news/.",
    "book_id": "648",
    "new_page_number": 74
  },
  {
    "serial_number": "34446",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "The correct doctrinal direction for this occurrence is as follows: First: The unseen is of two types: The first type is absolute unseen: Exclusive to Him, Glory be to Him, which He kept to Himself in His knowledge, so no one of His creation saw it, neither a sent prophet nor a close angel. Whoever claims knowledge of the unseen among people has claimed for himself what is exclusive to Allah, Glory be to Him. That is the meaning of His saying Almighty: {And with Him are the keys of the unseen; none knows them except Him. And He knows what is on the land and in the sea. Not a leaf falls but that He knows it. And no grain is there within the darknesses of the earth and no moist or dry [thing] but that it is [written] in a clear record (59)} [Al-An'am: 59], and His saying Almighty: {Indeed, Allah [alone] has knowledge of the Hour and sends down the rain and knows what is in the wombs. And no soul perceives what it will earn tomorrow, and no soul perceives in what land it will die. Indeed, Allah is Knowing and Acquainted (34)} [Luqman: 34]. Ibn Abbas, may Allah be pleased with them both, said: 'These five are known only to Allah Almighty, and neither a close angel nor a sent prophet knows them' (1). On the authority of Ibn Umar, may Allah be pleased with them both, said: The Messenger of Allah, peace and blessings be upon him, said: 'The keys of the unseen are five, none knows them except Allah: None knows what the wombs diminish except Allah, none knows what is in tomorrow except Allah, none knows when rain comes except Allah, no soul knows in what land it will die except Allah, and none knows when the Hour will be established except Allah' (2). On the authority of Aisha, may Allah be pleased with her, said: 'Whoever tells you he knows what is in tomorrow has lied, then she recited: {And no soul perceives what it will earn tomorrow} [Luqman: 34]' (3). In another narration: 'Whoever claims that he informs of what will be tomorrow has fabricated a great lie against Allah' (4).",
    "foot_note": "1. Narrated by Al-Wahidi in his Tafsir Al-Basit, (18/ 128). \n2. Narrated by Al-Bukhari, in the Book of Tawhid, Chapter: The saying of Allah Almighty: {Knower of the unseen, and He does not disclose His [knowledge of the] unseen to anyone (26)} [Al-Jinn: 26], No. (7379), (9/ 116). \n3. Narrated by Al-Bukhari, in the Book of Tafsir of Quran, Chapter: His saying: {So be patient over what they say and exalt [Allah] with praise of your Lord before the rising of the sun and before its setting} [Qaf: 39], No. (4855), (6/ 140). \n4. Narrated by Muslim, in the Book of Faith, Chapter: Meaning of the saying of Allah Almighty: {And he certainly saw him in another descent (13)} [An-Najm: 13], and did the Prophet peace be upon him see his Lord on the night of Isra, No. (177), (1/ 159).",
    "book_id": "648",
    "new_page_number": 75
  },
  {
    "serial_number": "34447",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "Ibn Taymiyyah, may Allah have mercy on him, said: None of them knows the unseen except Allah. This is the absolute unseen from all creatures about which He said: {[He is] Knower of the unseen, and He does not disclose His [knowledge of the] unseen to anyone (26)} (1). The second type: Restricted unseen: Restricted unseen can be known in two ways: The first way is legitimate and permissible: From that is what Allah's prophets and messengers know through revelation, the Almighty said: {[He is] Knower of the unseen, and He does not disclose His [knowledge of the] unseen to anyone (26) Except whom He has approved of messengers, and indeed, He sends before each messenger and behind him observers (27)} [Al-Jinn: 27], and in His saying Almighty: {And Allah would not let you be informed of the unseen, but Allah chooses of His messengers whom He wills} [Al-Imran: 179]. From that is what Allah informed His Prophet, peace and blessings be upon him, so it was a miracle for him and a sign from Allah's signs that Allah distinguished His Messenger with, as in His saying Almighty: {That is from the news of the unseen which We reveal to you} [Al-Imran: 44], and Almighty said: {That is from the news of the unseen which We reveal to you, [O Muhammad]. You knew it not, neither you nor your people, before this. So be patient; indeed, the [best] outcome is for the righteous (49)} [Hud: 49]. The second way is forbidden and prohibited: From that is what the Jinn do of stealing hearing so they cast it to their allies among humans, so they mix one word with a hundred lies, telling of some unseen or guiding to lost items and knowing their places and the like. On the authority of Aisha, may Allah be pleased with her, said: People asked the Messenger of Allah, peace and blessings be upon him, about soothsayers. The Messenger of Allah, peace and blessings be upon him, said to them: 'They are nothing.' They said: O Messenger of Allah, but they sometimes tell of a thing that turns out to be true? The Messenger of Allah, peace and blessings be upon him, said: 'That is the word of truth which the Jinni snatches, then he clucks it into the ear of his ally like the clucking of a chicken, so they mix with it more than a hundred lies' (2). And from her, may Allah be pleased with her, she said she heard the Messenger of Allah, peace and blessings be upon him, say: 'The angels descend in the clouds (Al-'Anan), mentioning the matter decreed in heaven, so the devils steal the hearing and hear it, then inspire it to the soothsayers, so they lie with it a hundred lies from themselves' (3).",
    "foot_note": "1. Majmu' al-Fatawa, (16/ 110). \n2. Narrated by Al-Bukhari, in the Book of Manners, Chapter: A man saying about a thing: 'It is nothing', intending it is not true, No. (6213), (8/ 47), and Muslim, in the Book of Peace, Chapter: Prohibition of Soothsaying and going to Soothsayers, No. (2228), (4/ 1750). \n3. Narrated by Al-Bukhari, in the Book of Beginning of Creation, Chapter: Description of Iblis and his soldiers, No. (3288), (4/ 125).",
    "book_id": "648",
    "new_page_number": 76
  },
  {
    "serial_number": "34448",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "On the authority of Abu Huraira, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, said: 'When Allah decrees a matter in heaven, the angels beat their wings in submission to His saying, like a chain on a smooth rock..., so when fear is banished from their hearts, they say: What has your Lord said? They say to him who said: The Truth, and He is the Most High, the Grand. So the stealthy listeners hear it, and the stealthy listeners are like this, one above another..., so perhaps the meteor catches the listener before he throws it to his companion and burns him, and perhaps it does not catch him until he throws it to the one following him, to the one below him, until they cast it to the earth..., so it is cast on the mouth of the magician, so he lies with it a hundred lies, and he is believed, so they say: Did he not tell us on such and such day, such and such will happen, and we found it true? Because of the word heard from heaven' (1). Second: Guidance regarding the book 'Akhbar Az-Zaman': All the claims mentioned in it are answered as follows: 1 - The book 'Akhbar Az-Zaman' is not by a writer named Ibrahim, but by the historian writer Abu Al-Hasan Ali bin Al-Hussein bin Ali Al-Masudi, a historian who died in the year: (346 AH). The name of his book is: 'Kitab Akhbar Az-Zaman wa Man Abadahul-Hadathan, wa 'Aja'ib Al-Buldan wa Al-Ghamir bi-l-Ma' wa Al-'Umran'. The book is only (278) pages long. Its author did not address any prophecy about the end of the world, nor is there such a narration in its pages. Rather, all its topics were limited to observing ancient history in various countries in the ancient era, and the extent of progress made by the Pharaohs in Egypt and Alexandria, and he also touched upon many wonders of time and countries. 2 - Using Gregorian months was not customary for earlier writers and authors in their writings. Their writings used official usage, i.e., Hijri months: Muharram, Safar, etc., and some used them with their old Arabic names like Adhar and Nisan, etc. 3 - Names ending in Arabic with the suffix: 'wayh' are Persian names in origin, like Sibawayh and Niftawayh. The likely meaning of the suffix 'wayh' in Persian names is 'owner/possessor'. This is a known rule in Persian names structured in this form. It is not correct to name 'Saluqiyyah' in the language with this structure; for",
    "foot_note": "1. Narrated by Al-Bukhari, in the Book of Tafsir of Quran, Chapter: His saying: {Except one who steals a hearing and is pursued by a clear burning flame (18)} [Al-Hijr: 18], No. (4701), (6/ 80).",
    "book_id": "648",
    "new_page_number": 77
  },
  {
    "serial_number": "34449",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "it must be 'Salqawayh' to be correctly structured. The method of linguists in pronouncing it is with Fatha on what is before 'wayh', then opening the Waw and breaking the Ha. The method of Hadith scholars is with Damma on what is before 'wayh', then silencing the Waw and opening the Ya. Al-Nawawi says in the biography of Abu Ubaid bin Harbawayh: And Harbawayh: with an un-dotted Ha opened, then a silent Ra, then a unified Ba then Waw both opened, then a silent Ya, then Ha. It is said: with Damma on the Ba with silencing the Waw and opening the Ya. These two modes apply to all its analogues like Sibawayh, Rahawayh, Niftawayh, and Amruwayh. The first is the school of linguists and littérateurs, and the second is the school of Muhaddithin (1). 4 - After searching in more than one way, it turned out that there is no man in history named Ibrahim bin Saluqiyyah; as this name was not mentioned in any book, website, or place, and no biography or date of death etc. was found for him. The man's name was not even mentioned in any scientific reference or literary work, whether in an era comparative to his era or close to his era; which means this man does not exist in any era. Mohamed El-Borsigi, a researcher at the Manuscript Center at the Library of Alexandria, mentioned the non-existence of this author among the manuscripts of Arab thought figures, and said: We know nothing about Ibn Saluqiyyah, nor his sheikhs from whom he took knowledge, and stressed that there is no trace of the name Ibrahim bin Saluqiyyah in the archives of manuscript centers known regionally and globally (2). Third: Guidance regarding the book 'Aza'im Ad-Duhur'. All claims mentioned in it are answered as follows: 1 - The text is poor and its author fell into spelling and grammatical errors. Among the grammatical errors he fell into is his saying: 'min fi'l al-bashar al-dallun' (from the action of the misled humans - nominative), and the correct is: 'al-dallin' (genitive). Among the spelling errors he fell into is his saying: 'walat al-umur' (rulers - wrong spelling), and the correct is: 'wulat al-umur'.",
    "foot_note": "1. See: Tahdhib al-Asma' wa al-Lughat, (2/ 258). \n2. See: Al-Ain News Channel website https:// al-ain.com/ article/ heritage-book-histroy",
    "book_id": "648",
    "new_page_number": 78
  },
  {
    "serial_number": "34450",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "2 - The poem is unbalanced and its rhymes are full of defects, and it contains much poorness and weakness. Its author relied on rhyme (Saj') to delusion people that it is measured poetry, while in its words and style it does not rise to the level of poems and poetry in that era. Linguists defined poetry as: measured rhymed speech indicating a meaning (1). Linguists in the earlier times stipulated for accepting poetry: the condition of meter in it, so speech is not poetry unless it has a special meter. Also, measured poetry has a rhythm that delights the understanding for its correctness, and what comes upon it of good composition and moderation of parts. So if correctness of poetry meter combines with correctness of meaning weight and sweetness of expression, and purity of what is heard and understood from turbidity; it is accepted and embraced. If a part of its completing parts is missing, namely moderation of meter, correctness of meaning, and goodness of words; the understanding's rejection of it corresponds to the deficiency of its parts (2). 3 - Despite the writer's death nearly a thousand years ago, the words that came in the book recount the events accompanying the Corona epidemic clearly and in detail and in the language of our era in which we live, as if history was reduced to this era and nothing passed through it except this epidemic!! This contradicts logic and is rejected by reason; for the Islamic world and other nations have passed through many epidemics and plagues, some more deadly than this epidemic we live in. 4 - After researching and investigating Abu Ali Al-Dubayzi and the book 'Aza'im Ad-Duhur', it became clear that there is no writer by this name and its author is not a real figure but obscure and ambiguous, and there is no book bearing the name 'Aza'im Ad-Duhur'. Some specialists in history and Islamic heritage mentioned that neither the book 'Aza'im Ad-Duhur' nor a historian and writer named Abu Ali Al-Dubayzi has been heard of, and the language used in this excerpt does not date back to the fifth and sixth Hijri centuries (3).",
    "foot_note": "1. See: Naqd ash-Shi'r, Qudamah bin Ja'far, p. (3). \n2. See: 'Iyar ash-Shi'r, Ibn Tabataba, p. (21). \n3. See: Youm7 Electronic Newspaper website https:// www.youm 7.com/ story/ 2020/ 4703920, and Arageek Electronic website https:// www.arageek.com.",
    "book_id": "648",
    "new_page_number": 79
  },
  {
    "serial_number": "34451",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "The Tenth Occurrence: Issues Related to Hearing and Obeying the Ruler. Among the doctrinal occurrences and issues that arose with the onset of the Corona epidemic are issues related to hearing and obeying instructions and adhering to procedures imposed by government agencies assigned by the ruler; so that the epidemic is contained and its non-spread is achieved, God willing. The Kingdom was among the first countries to adopt precautionary health measures and preventive actions in dealing with the Corona epidemic; it added innovative concepts in crisis management, and presented a model to the world in its dealing with the repercussions of the situation health-wise, socially, and economically, unique in its humanitarian values, differentiating not between citizen and expatriate on its soil. Crisis management in the Kingdom was characterized by an integrated approach of the governmental, civil, and voluntary work system, its primary goal being preserving public health according to approved standards. It was distinguished by investigation and scrutiny of health threats, assessing the degree of risks, and preparedness with firm preventive measures in their implementation. Therefore, the results of the Ministry of Health's Command and Control Center monitoring the infection level of the (covid-19) virus in Wuhan (WHAN), China, drove the Kingdom's early response to confront the virus's repercussions. The Royal Order was issued on: Jan 26, 2020 AD, to form a supreme committee concerned with taking all precautionary measures and necessary actions to prevent the spread of the pandemic, including in its membership (24) government agencies. Among the most important decisions taken: suspending Umrah, education, and all international and domestic flights, starting extensive field survey operations, expanding laboratory capacity, also partial then total curfew on various regions of the Kingdom, the decision to treat all citizens, residents, and irregulars for free without any consequences, and holding Hajj last year (1441 AH) with very limited numbers for those wishing to perform Hajj rituals from various nationalities present within the Kingdom (1). Health authorities warned against complacency in applying precautionary measures, emphasizing the importance of continuing to adhere to them until society reaches - God willing - safety (2).",
    "foot_note": "1. See: Saudi Press Agency SPA https:// www.spa.gov.sa/ 2211274 \n2. See: Saudi Ministry of Health website https:// www.moh.gov.sa/ Ministry/ MediaCenter/ News/ Pages/ News-2021 - 03 - 31 - 006.aspx",
    "book_id": "648",
    "new_page_number": 80
  },
  {
    "serial_number": "34452",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "Health authorities also confirmed that gatherings and non-compliance with precautionary measures are the cause of increasing numbers of Corona virus infections, stressing the importance of adhering to preventive measures such as: wearing a mask, social distancing, hand sanitizing, and not shaking hands; to limit the spread of Corona virus; to preserve everyone's health and safety (1). The rulings and penalties prescribed against violators of precautionary measures and preventive actions taken to confront the Corona pandemic stipulated punishing anyone violating isolation or quarantine instructions with a fine up to (200) thousand Riyals, or imprisonment for a period not exceeding two years, or both together. In case of repeated violation, the penalty imposed the previous time is doubled. If the mentioned violation was committed by a non-Saudi individual, he is punished by deportation from the Kingdom, and his entry is permanently banned after executing the penalty taken against him (2).",
    "foot_note": "1. See: Saudi Ministry of Health website https:// www.moh.gov.sa/ Ministry/ MediaCenter/ News/ Pages/ News-2021 - 03 - 27 - 001.aspx \n2. See: Saudi Press Agency SPA https:// www.spa.gov.sa/ viewstory.php? lang=ar&newsid=2241363",
    "book_id": "648",
    "new_page_number": 81
  },
  {
    "serial_number": "34453",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "The doctrinal directive for this occurrence is as follows: First: Adhering to procedures and adhering to instructions imposed by the Kingdom and implemented by various ministries and government agencies is part of hearing and obeying the ruler. Texts from the Quran and Mutawattir Sunnah have come indicating the obligation of obeying the ruler. The Almighty said: {O you who have believed, obey Allah and obey the Messenger and those in authority among you} [An-Nisa: 59]. Ibn Sa'di, may Allah have mercy on him, said in interpreting this verse: Allah commanded obedience to Him and obedience to His Messenger by complying with their command, mandatory and recommended, and avoiding their prohibition. And He commanded obedience to those in authority, who are: The rulers over people, from princes, judges, and muftis, for people's religious and worldly affairs cannot be upright except by obeying them and submitting to them, in obedience to Allah and desire for what is with Him, but on condition that they do not command disobedience to Allah, for if they command that, there is no obedience to a creature in disobedience to the Creator. Perhaps this is the secret in omitting the verb when commanding obedience to them and mentioning it with obedience to the Messenger, for the Messenger does not command except obedience to Allah, and whoever obeys him has obeyed Allah. As for those in authority, the condition for obedience to them is that it not be disobedience (1). As for texts from the Sunnah indicating the obligation of obeying the ruler, they are numerous and Mutawattir. Among them: On the authority of Abu Huraira, may Allah be pleased with him: That the Messenger of Allah, peace and blessings be upon him, said: 'Whoever obeys me has obeyed Allah, and whoever disobeys me has disobeyed Allah, and whoever obeys my emir has obeyed me, and whoever disobeys my emir has disobeyed me' (2). And on the authority of Ubadah bin As-Samit, may Allah be pleased with him, said: 'We pledged allegiance to the Messenger of Allah, peace and blessings be upon him, to hear and obey in hardship and ease, in enthusiasm and reluctance, and [even] over preference over us, and not to dispute the command with its people, and to speak the truth wherever we are, fearing not in Allah the blame of a blamer' (3). In another narration: 'And not to dispute the command with its people, unless you see clear",
    "foot_note": "1. Taysir al-Karim al-Rahman, p. (183). \n2. Previously referenced. \n3. Narrated by Al-Bukhari in the Book of Judgments, Chapter: How People Pledge Allegiance to the Imam, No. (7199), (9/ 77), and Muslim in the Book of Leadership, Chapter: Obligation of Obeying Rulers in Non-Disobedience, and Prohibition in Disobedience, No. (1709), (3/ 1470).",
    "book_id": "648",
    "new_page_number": 82
  },
  {
    "serial_number": "34454",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "disbelief (Kufr Bawwah), for which you have proof from Allah' (1). And on the authority of Hudhayfah, may Allah be pleased with him, said: I said: O Messenger of Allah, we were in evil, then Allah brought good, and we are in it, so is there evil after this good? He said: 'Yes', I said: Is there good after that evil? He said: 'Yes', I said: Is there evil after that good? He said: 'Yes', I said: How? He said: 'There will be after me leaders who do not guide by my guidance, and do not follow my Sunnah, and there will arise among them men whose hearts are hearts of devils in the bodies of humans.' He said: I said: How should I act, O Messenger of Allah, if I reach that? He said: 'You hear and obey the emir, even if your back is beaten and your wealth is taken, hear and obey' (2). And on the authority of Ibn Umar, may Allah be pleased with him, said: When we pledged allegiance to the Messenger of Allah, peace and blessings be upon him, to hear and obey, he would say to us: 'In what you are able' (3). And on the authority of Abu Dharr, may Allah be pleased with him, said: 'My close friend advised me to hear and obey, even if [the leader] is an Abyssinian slave with mutilated limbs' (4). Ibn Mas'ud, may Allah be pleased with him, said in his sermon: 'O people, stick to obedience and the Jama'ah (community); for it is the rope of [Allah] which He commanded, and what you dislike in the Jama'ah is better than what you love in division' (5). Abu Amr Al-Dani, may Allah have mercy on him, said: And submission to Imams is obligatory, and hearing and obeying them in hardship, ease,",
    "foot_note": "1. Narrated by Al-Bukhari in the Book of Tribulations, Chapter: The Prophet saying: 'You will see after me matters you deny', No. (7056), (9/ 47), and Muslim in the Book of Leadership, Chapter: Obligation of Obeying Rulers in Non-Disobedience, and Prohibition in Disobedience, No. (1709), (3/ 1470). \n2. Narrated by Muslim in the Book of Leadership, Chapter: Command to Stick to the Community upon Appearance of Tribulations, No. (1847), (3/ 1476). \n3. Narrated by Al-Bukhari in the Book of Judgments, Chapter: How People Pledge Allegiance to the Imam, No. (7202), (9/ 77), and Muslim in the Book of Leadership, Chapter: Pledge to Hear and Obey in What One Can, No. (1867), (3/ 1490). \n4. Narrated by Muslim in the Book of Leadership, Chapter: Obligation of Obeying Rulers in Non-Disobedience, and Prohibition in Disobedience, No. (1837), (3/ 1467). \n5. Narrated by Ibn Abi Shaybah in his Musannaf, No. (37337), (7/ 474), Al-Ajurri in Ash-Shari'ah, No. (17), (1/ 298), Al-Tabarani in Al-Kabir, No. (8971), (9/ 198), Al-Hakim in Al-Mustadrak, No. (8663), (4/ 598), and Al-Lalaka'i in Sharh Usul I'tiqad Ahl as-Sunnah, No. (159), (1/ 121). Al-Hakim said in Al-Mustadrak: This Hadith is authentic according to the conditions of the two Sheikhs, and they did not narrate it, and Al-Dhahabi agreed.",
    "book_id": "648",
    "new_page_number": 83
  },
  {
    "serial_number": "34455",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 82,
    "volume_number": 1,
    "text": "enthusiasm, and reluctance, and magnifying them, and respecting them, and likewise obeying their deputies, and those acting on their behalf from emirs, judges, rulers, workers, collectors, tax collectors, and financial officers, and all whom they appointed over anything they oversee. It is not obligatory to revolt against them, or oppose them, and this is agreed upon regarding the just upright Imam (1). An-Nawawi, may Allah have mercy on him, said: It is obligatory to obey the Imam in his command and prohibition, as long as it does not contradict a ruling of Sharia, whether he is just or unjust\" (2). Ibn Taymiyyah, may Allah have mercy on him, said: So obedience to Allah and His Messenger is obligatory on everyone, and obedience to those in authority is obligatory because Allah commanded obeying them. Whoever obeys Allah and His Messenger by obeying those in authority for the sake of Allah, his reward is upon Allah. And whoever obeys them only for what he gets of authority, if they give him he obeys them, and if they withhold he disobeys them, he has no share in the Hereafter (3). Third: There are precautionary measures and preventive actions approved by the ruler and taken to confront the Corona epidemic and limit the speed of its spread and outbreak in society. Among these precautionary measures and preventive actions, for example but not limited to: The issue of preventing prayers in mosques during curfew and praying at home. It is said regarding this issue: Among the considered legal maxims is the maxim: Warding off harm takes precedence over bringing benefit. Commitment to following instructions and adhering to procedures imposed by responsible authorities assigned by the ruler achieves this legal maxim. Establishing prayers in mosques entails achieving a benefit complementary to the necessary; prayer was legislated for the interest of a necessary objective, which is preservation of religion. With the existence of an excuse, the benefit of performing it in mosques can be made up for by completing necessary worship in homes, even if its complement is missed. As for the gathering of worshipers, it entails the harm of exacerbating the epidemic beyond control, and exposing the public",
    "foot_note": "1. Ar-Risalah Al-Wafiyah li Madhhab Ahl as-Sunnah fi Al-I'tiqadat wa Usul Ad-Diyanat, p. (241). \n2. Rawdat at-Talibin wa Umdat al-Muftin, (10/ 47). \n3. Qa'idah Mukhtasarah fi Wujub Ta'at Allah wa Rasulihi wa Wulat al-Umur, p. (48).",
    "book_id": "648",
    "new_page_number": 84
  },
  {
    "serial_number": "34456",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 83,
    "volume_number": 1,
    "text": "to harm, and the possibility of loss of lives; thus missing the benefit of preserving necessary lives. A Muslim is excused for leaving Friday and congregational prayers for fear of illness. Al-Mardawi, may Allah have mercy on him, says: The sick person is excused for leaving Friday and congregation without dispute, and is also excused for leaving them for fear of the occurrence of illness. (1) As for worshipers not adhering to preventive measures, it entails a harm which is the spread of the epidemic beyond control, exposing people to harm, and the possibility of loss of lives, thus missing the benefit of preserving necessary lives. Therefore, it is licensed to prevent establishing prayers in mosques temporarily until the harm is lifted, combining both matters; to ward off the preponderant harm. A fatwa was issued by the Council of Senior Scholars regarding what was presented to it concerning the license not to attend Friday and congregational prayers in case of epidemic spread or fear of its spread. By inducting texts of Islamic Sharia, its objectives, maxims, and scholars' words on this issue, the Council of Senior Scholars clarifies the following: 1 - It is forbidden for the infected person to attend Friday and congregation due to his saying, peace be upon him: 'No sick one should be put with a healthy one' (2), and his saying, peace be upon him: 'If you hear of the plague in a land, do not enter it, and if it breaks out in a land while you are there, do not leave it' (3). 2 - Whoever the competent authority has decided isolation procedures for, it is obligatory upon him to adhere to that, and leave attending congregational and Friday prayers and pray prayers in his home or place of isolation; due to what Ash-Sharid bin Suwayd Ath-Thaqafi, may Allah be pleased with him, narrated: There was a leper in the delegation of Thaqif, so the Prophet, peace and blessings be upon him, sent to him: 'We have accepted your allegiance, so return' (4).",
    "foot_note": "1. Al-Insaf fi Ma'rifat ar-Rajih min al-Khilaf, (2/ 300). \n2. Narrated by Al-Bukhari in the Book of Medicine, Chapter: No infection (Hama), No. (5771), (7/ 138), and Muslim in the Book of Peace, Chapter: No infection, no evil omen, no owl, no Safar, no star, no ghoul, and no sick one should be put with a healthy one, No. (2221), (4/ 1743). \n3. Narrated by Al-Bukhari in the Book of Medicine, Chapter: What is mentioned about the plague, No. (5728), (7/ 130), and Muslim in the Book of Peace, Chapter: Plague, Omens, Divination, and the like, No. (2218), (4/ 1737). \n4. Narrated by Muslim in the Book of Peace, Chapter: Avoidance of the Leper and the like, No. (2231), (4/ 1752).",
    "book_id": "648",
    "new_page_number": 85
  },
  {
    "serial_number": "34457",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 84,
    "volume_number": 1,
    "text": "3 - Whoever fears harming himself or harming others is licensed not to attend Friday and congregation due to his saying, peace be upon him: 'No harm and no reciprocating harm' (1). In all mentioned, if he does not attend Friday prayer, he prays it as Dhuhr four rak'ahs. Furthermore, the Council of Senior Scholars recommends everyone to adhere to instructions, directives, and regulations issued by the competent authority, as well as recommending everyone to fear Allah Almighty and resort to Him, Glory be to Him, with supplication and pleading before Him to lift this affliction. Allah Almighty said: {And if Allah touches you with adversity, there is no remover of it except Him. And if He touches you with good - then He is over all things competent (17) And if Allah touches you with adversity, there is no remover of it except Him. And if He touches you with good - then He is over all things competent (17) And He is the Subjugator over His servants. And He is the Wise, the Acquainted (18)} [Al-An'am: 17-18, note: verse 17 repeated in source text], and Glory be to Him said: {And your Lord said, \"Call upon Me; I will respond to you.\"} [Ghafir: 60]. May Allah bless and grant peace to our Prophet Muhammad and his family and all his companions. (2) Also, the General Secretariat of the Council of Senior Scholars emphasized the extreme importance of adhering to instructions and regulations issued by competent authorities to confront the Corona pandemic and limit its effects. It said in a statement issued by it: Adhering to these instructions is a religious duty, and the person responsible sins by violating them due to the saying of Allah Almighty: {O you who have believed, obey Allah and obey the Messenger and those in authority among you} [An-Nisa: 59]. Adhering to these instructions is part of obeying the ruler. By adhering to instructions, public and private interests are achieved, and public and private harms are warded off, indicating that the more they are adhered to, the more preserving of souls from perishing, and protecting of wealth from waste. The Sharia is built on achieving interests and completing them, and disabling evils and reducing them. It added: The sin of violating these instructions is magnified because the violator does not only harm himself, but the effect of his violation extends to others. Scholars have decided based on Sharia texts: 'That the transgression extending to others is more severe than the limited one', asking Allah Almighty to be kind to His servants, and to lift this epidemic from them while they are in health, wellness, and good condition, and He, Glory be to Him, is the Kind, the Acquainted (3).",
    "foot_note": "1. Narrated by Ibn Majah, No. (2340), (2/ 784), and Ibn Al-Mulaqqin said in Al-Mu'in 'ala Tafahhum Al-Arba'in, p. (376): Ibn As-Salah said: It is supported by paths, and their sum strengthens the Hadith and makes it Hasan, and the majority of scholars have transmitted it and used it as evidence. \n2. See: Saudi Press Agency SPA https:// www.spa.gov.sa/ 2047028 \n3. See: Saudi Press Agency SPA https:// www.spa.gov.sa/ viewstory.php? lang=ru&newsid=2049992",
    "book_id": "648",
    "new_page_number": 86
  },
  {
    "serial_number": "34458",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 85,
    "volume_number": 1,
    "text": "Third: Among the considered legal maxims also is the maxim: Hardship brings ease, as the Almighty said: {And [He] has not placed upon you in the religion any difficulty} [Al-Hajj: 78]. Regarding this maxim, the same is said as in the previous maxim concerning the issue of preventing establishment of prayers in mosques during curfew and praying at home. The Prophet, peace and blessings be upon him, ordered people to pray in their dwellings; fearing harm and hardship. On the authority of Nafi', may Allah have mercy on him, from Ibn Umar, may Allah be pleased with him, that he called for prayer on a cold, windy, and rainy night, then said at the end of his call: 'Lo, pray in your dwellings, lo, pray in the dwellings.' Then he said: Indeed the Messenger of Allah, peace and blessings be upon him, used to order the Mu'adhin, if it was a cold or rainy night in travel, to say: 'Lo, pray in your dwellings' (1). Al-Suyuti, may Allah have mercy on him, said: Scholars said: All Sharia licenses and mitigations are derived from this maxim (2). If praying in homes is permissible for slight harm like mud and heavy rain; then it is more appropriate for certain harm in epidemics and infectious diseases that result in destruction, even if presumed. Fourth: Among the objectives of Sharia that Islam brought is the preservation of the five necessities, including preservation of life. Adhering to procedures imposed by government agencies assigned by the ruler achieves this legal objective. Al-Shatibi, may Allah have mercy on him, said about the five necessities: They are indispensable for establishing the interests of religion and world, such that if lost, worldly interests would not run straight, but result in corruption, chaos, and loss of life, and in the Hereafter loss of salvation and bliss, and returning with clear loss (3). His Eminence the Grand Mufti of the Kingdom, Chairman of the Council of Senior Scholars, Sheikh Abdulaziz bin Abdullah Al Sheikh, may Allah preserve him, emphasized this matter, saying: Indeed, among the objectives of Sharia that Islam brought is the preservation of the five necessities, which are preservation of religion, preservation of life, preservation of intellect, preservation of honor,",
    "foot_note": "1. Narrated by Al-Bukhari in the Book of Adhan, Chapter: Adhan for the Traveler, if they are a group, and Iqama, and likewise at Arafat and Muzdalifah, and the Mu'adhin saying: Prayer in the dwellings, on a cold or rainy night, No. (632), (1/ 129), and Muslim in the Book of Prayer of Travelers and its Shortening, Chapter: Prayer in dwellings in rain, No. (697), (1/ 484), and the wording is Muslim's. \n2. Al-Ashbah wa an-Naza'ir, p. (77). \n3. Al-Muwafaqat, (2/ 17 - 18).",
    "book_id": "648",
    "new_page_number": 87
  },
  {
    "serial_number": "34459",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 86,
    "volume_number": 1,
    "text": "and preservation of wealth. Preservation of life is among the necessities that the Lawgiver, Glory be to Him, commanded to preserve and not expose to destruction. Allah Almighty said: {And do not kill yourselves [or one another]. Indeed, Allah is to you ever Merciful} [An-Nisa: 29]. In implementation of the directives of the Custodian of the Two Holy Mosques, may Allah preserve him, to ban movement during the curfew period and adhere to the directives of security and health authorities, because in that is preservation of lives and protecting them from exposure to the Corona virus epidemic until Allah Almighty lifts the distress from us and repels this affliction, it is obligatory on all citizens and residents to hear and obey the directives of the rulers and not violate them, due to His saying Almighty: {O you who have believed, obey Allah and obey the Messenger and those in authority among you} [An-Nisa: 59], and his saying, peace be upon him: 'Whoever obeys me has obeyed Allah, and whoever disobeys me has disobeyed Allah, and whoever obeys my emir has obeyed me, and whoever disobeys my emir has disobeyed me' (1).. He added, may Allah preserve him: That every person who violated regulations approved by the ruler and did not commit to implementing them such as moving during curfew, or caused the transmission of the epidemic to others intentionally, or used social media to mock and belittle the efforts of security and health authorities or incite violating regulations is sinful. Allah Almighty said: {And cooperate in righteousness and piety, but do not cooperate in sin and aggression. And fear Allah; indeed, Allah is severe in penalty} [Al-Ma'idah: 2] (2). Sheikh Abdullah Al-Tayyar, may Allah preserve him, said: Indeed, those measures taken by the Kingdom were testified to be correct by numerous legal texts, and a universal objective of Sharia objectives is achieved by them, which is preservation of life, as it is permissible for the ruler to take necessary precautionary measures; to prevent causes of general affliction, especially upon the outbreak of epidemic diseases. We are all required to stand as one rank behind our wise leadership in confronting this epidemic by adhering to decisions ordered by the ruler regarding this Nazilah that affected the whole world; until this stage passes safely. We must all bear our societal responsibility in preserving our safety and the safety of the homeland (3).",
    "foot_note": "1. Previously referenced. \n2. See: Saudi Press Agency SPA https:// www.spa.gov.sa/ 2053576 \n3. See: Article by the Sheikh on Al-Jazirah Newspaper website https:// www.al-jazirah.com/ 2020/ 20200430/ rj 2.htm",
    "book_id": "648",
    "new_page_number": 88
  },
  {
    "serial_number": "34460",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 87,
    "volume_number": 1,
    "text": "Sources and References 1 - Al-Ahad wa Al-Mathani, Abu Bakr bin Abi Asim who is Ahmad bin Amr bin Al-Dahhak bin Makhlad Al-Shaybani, Investigator: Dr. Basem Faisal Ahmed Al-Jawabra, Publisher: Dar Al-Rayah - Riyadh, Edition: First, 1411 - 1991. 2 - Al-Irshad ila Sahih Al-I'tiqad wa Al-Radd 'ala Ahl Al-Shirk wa Al-Ilhad, Saleh bin Fawzan bin Abdullah Al-Fawzan, Publisher: Dar Ibn Al-Jawzi, Edition: Fourth 1420 AH - 1999 AD. 3 - Asas Al-Balaghah, Abu Al-Qasim Mahmoud bin Amr bin Ahmed, Al-Zamakhshari Jar Allah, Investigation: Muhammad Basil Uyoun Al-Sud, Publisher: Dar Al-Kutub Al-Ilmiyah: Beirut, Edition: First, 1419 AH - 1998 AD. 4 - Adwa' Al-Bayan fi Idah Al-Qur'an bi Al-Qur'an, Muhammad Al-Amin bin Muhammad Al-Mukhtar bin Abdul Qadir Al-Jakni Al-Shanqiti, Publisher: Dar Al-Fikr for Printing, Publishing and Distribution Beirut, Year of Publication: 1415 AH - 1995 AD. 5 - Al-I'tisam, Ibrahim bin Musa bin Muhammad Al-Lakhmi Al-Gharnati famous as Al-Shatibi, Investigation and Study: Part One: Dr. Muhammad bin Abdul Rahman Al-Shuqair, Part Two: Dr. Saad bin Abdullah Al-Humayyid, Part Three: Dr. Hisham bin Ismail Al-Sini, Publisher: Dar Ibn Al-Jawzi for Publishing and Distribution: Dammam, Edition: First, 1429 AH - 2008 AD. 6 - I'lam Al-Muwaqqi'in 'an Rabb Al-Alamin, Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams Al-Din Ibn Qayyim Al-Jawziyya, Investigation: Muhammad Abdul Salam Ibrahim, Publisher: Dar Al-Kutub Al-Ilmiyah: Beirut, Edition: First, 1411 AH - 1991 AD. 7 - Iqtida' Al-Sirat Al-Mustaqim li Mukhalafat Ashab Al-Jahim, Taqi Al-Din Abu Al-Abbas Ahmed bin Abdul Halim bin Abdul Salam bin Abdullah bin Abi Al-Qasim bin Muhammad bin Taymiyyah Al-Harrani Al-Hanbali Al-Dimashqi, Investigator: Nasser Abdul Karim Al-Aql, Publisher: Dar Alam Al-Kutub: Beirut. 8 - Ikmal Al-Mu'lim bi Fawa'id Muslim, Abu Al-Fadl Iyad bin Musa bin Iyad Al-Yahsubi, Investigation: Dr. Yahya Ismail, Publisher: Dar Al-Wafa' for Printing, Publishing and Distribution, Egypt, Edition: First, 1419 AH - 1998 AD. 9 - Al-Insaf fi Ma'rifat Al-Rajih min Al-Khilaf, Ala' Al-Din Abu Al-Hasan Ali bin Sulaiman Al-Mardawi Al-Dimashqi Al-Salhi Al-Hanbali, Publisher: Dar Ihya' Al-Turath Al-Arabi. 10 - Al-Bidaya wa Al-Nihaya, Abu Al-Fida' Ismail bin Umar bin Kathir Al-Qurashi Al-Basri then Al-Dimashqi, Investigator: Ali Shiri, Publisher: Dar Ihya' Al-Turath Al-Arabi, Edition: First, 1408 AH - 1988 AD. 11 - Bada'i' Al-Fawa'id, Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams Al-Din Ibn Qayyim Al-Jawziyya, Publisher: Dar Al-Kitab Al-Arabi: Beirut.",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 89
  },
  {
    "serial_number": "34461",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 88,
    "volume_number": 1,
    "text": "12 - Taj Al-Arus min Jawahir Al-Qamus, Muhammad bin Muhammad bin Abdul Razzaq Al-Husayni Abu Al-Fayd nicknamed Murtada, Al-Zabidi, Investigator: A group of investigators Publisher: Dar Al-Hidaya. 13 - Tarikh Al-Tabari Tarikh Al-Rusul wa Al-Muluk, Muhammad bin Jarir bin Yazid bin Kathir bin Ghalib Al-Amili, Abu Ja'far Al-Tabari, Publisher: Dar Al-Turath: Beirut, Edition: Second, 1387 AH, and with it Silat Tarikh Al-Tabari by Arib bin Sa'd Al-Qurtubi. 14 - Tashih Al-Du'a, Bakr bin Abdullah Abu Zaid, Publisher: Dar Al-Asimah for Publishing and Distribution: Riyadh, Edition First, 1419 AH - 1999 AD. 15 - Al-Tafsir Al-Basit, Abu Al-Hasan Ali bin Ahmed bin Muhammad bin Ali Al-Wahidi, Al-Naysaburi, Al-Shafi'i, Investigator: Original investigation in (15) doctoral theses at Imam Muhammad bin Saud University, then a scientific committee from the university refined and coordinated it, Publisher: Scientific Research Deanship - Imam Muhammad bin Saud Islamic University, Edition: First, 1430 AH. 16 - Tafsir Al-Quran Al-Aziz, Abu Abdullah Muhammad bin Abdullah bin Isa bin Muhammad Al-Murri, Al-Ilbiri known as Ibn Abi Zamanin Al-Maliki, Investigator: Abu Abdullah Hussein bin Okasha - Muhammad bin Mustafa Al-Kanz, Publisher: Al-Faruq Al-Hadithah: Cairo, Edition: First, 1423 AH - 2002 AD. 17 - Tafsir Al-Quran Al-Azim, Abu Al-Fida' Ismail bin Umar bin Kathir Al-Qurashi Al-Basri then Al-Dimashqi, Investigator: Sami bin Muhammad Salamah, Publisher: Dar Taybah for Publishing and Distribution, Edition: Second, 1420 AH - 1999 AD. 18 - Tafsir Al-Quran Al-Azim, Abu Muhammad Abdul Rahman bin Muhammad bin Idris bin Al-Mundhir Al-Tamimi, Al-Hanzali, Al-Razi Ibn Abi Hatim, Investigator: As'ad Muhammad Al-Tayyib, Publisher: Maktabat Nizar Mustafa Al-Baz, Edition: Third - 1419 AH. 19 - Tafsir Al-Quran Al-Karim, Muhammad bin Saleh Al-Uthaymeen, printed under supervision of Sheikh Muhammad bin Saleh Al-Uthaymeen Charitable Foundation, Dar Ibn Al-Jawzi: Dammam, Ed: 1. 20 - Tafsir Al-Quran, Abu Al-Muzaffar, Mansour bin Muhammad bin Abdul Jabbar Ibn Ahmed Al-Marwazi Al-Sam'ani Al-Tamimi Al-Hanafi then Al-Shafi'i, Investigator: Yasser bin Ibrahim and Ghonaim bin Abbas bin Ghonaim, Publisher: Dar Al-Watan, Riyadh, Edition: First, 1418 AH - 1997 AD. 21 - Takmilat Ma'ajim Al-Lugha Al-Arabiyyah, Reinhart Pieter Anne Dozy, Translated to Arabic and commented on: Vol 1-8: Muhammad Salim Al-Nuaimi, Vol 9, 10: Jamal Al-Khayyat, Publisher: Ministry of Culture and Information, Iraqi Republic, Edition: First, from 1979 - 2000 AD. 22 - Tahdhib Al-Asma' wa Al-Lughat, Abu Zakariya Muhyiddin Yahya bin Sharaf Al-Nawawi, Edited, corrected, commented on and origin compared by: The Scholars Company with the help of Al-Muniriyyah Printing Management, Requested from: Dar Al-Kutub Al-Ilmiyah, Beirut.",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 90
  },
  {
    "serial_number": "34462",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 89,
    "volume_number": 1,
    "text": "23 - Tahdhib Al-Lugha, Muhammad bin Ahmed bin Al-Azhari Al-Harawi, Abu Mansour, Investigator: Muhammad Awad Mur'ib, Publisher: Dar Ihya' Al-Turath Al-Arabi: Beirut, Edition: First, 2001 AD. 24 - Taysir Al-Karim Al-Rahman fi Tafsir Kalam Al-Mannan, known as Tafsir Al-Sa'di, Abdul Rahman bin Nasser bin Abdullah Al-Sa'di, Investigator: Abdul Rahman bin Mu'alla Al-Luwayhiq, Publisher: Mu'assasat Al-Risalah, Edition: First, 1420 AH - 2000 AD. 25 - Jami' Al-Bayan fi Ta'wil Al-Quran, Muhammad bin Jarir bin Yazid bin Kathir bin Ghalib Al-Amili, Abu Ja'far Al-Tabari, Investigator: Ahmed Muhammad Shakir, Publisher: Mu'assasat Al-Risalah, Edition: First, 1420 AH - 2000 AD. 26 - Al-Jami' Al-Kabir - Sunan Al-Tirmidhi, Muhammad bin Isa bin Sawra bin Musa bin Al-Dahhak, Al-Tirmidhi, Abu Isa, Investigator: Bashar Awad Ma'rouf, Publisher: Dar Al-Gharb Al-Islami: Beirut, Year of Publication: 1998 AD. 27 - Al-Jami' Al-Musnad Al-Sahih Al-Mukhtasar min Umur Rasul Allah salla Allahu alayhi wa sallam wa Sunanihi wa Ayyamihi named Sahih Al-Bukhari, Muhammad bin Ismail Abu Abdullah Al-Bukhari Al-Ju'fi Investigator: Muhammad Zuhair bin Nasser Al-Nasser Publisher: Dar Tuq Al-Najat, photocopy of Al-Sultaniyah with addition of numbering: Muhammad Fuad Abdul Baqi, Edition: First, 1422 AH. 28 - Al-Jami' li Ahkam Al-Quran, known as Tafsir Al-Qurtubi, Abu Abdullah Muhammad bin Ahmed Al-Ansari Al-Khazraji Shams Al-Din Al-Qurtubi, Investigation: Ahmed Al-Barduni - and Ibrahim Atfish, Publisher: Dar Al-Kutub Al-Misriyyah: Cairo, Ed: N/A, Date: N/A. 29 - Dar' Ta'arud Al-Aql wa Al-Naql, Taqi Al-Din Abu Al-Abbas Ahmed bin Abdul Halim bin Abdul Salam bin Abdullah bin Abi Al-Qasim bin Muhammad Ibn Taymiyyah Al-Harrani Al-Hanbali Al-Dimashqi, Investigation: Dr. Muhammad Rashad Salim, Publisher: Imam Muhammad bin Saud Islamic University, Kingdom of Saudi Arabia, Edition: Second, 1411 AH - 1991 AD. 30 - Al-Du'a by Al-Tabarani, Suleiman bin Ahmed bin Ayyub bin Mutair Al-Lakhmi Al-Shami, Abu Al-Qasim Al-Tabarani, Investigator: Mustafa Abdul Qadir Ata, Publisher: Dar Al-Kutub Al-Ilmiyah: Beirut, Edition: First, 1413 AH. 31 - Al-Risalah Al-Wafiyah li Madhhab Ahl Al-Sunnah fi Al-I'tiqadat wa Usul Al-Diyanat, Uthman bin Sa'id bin Uthman bin Umar Abu Amr Al-Dani, Investigator: Daghash bin Shabib Al-Ajmi, Publisher: Dar Al-Imam Ahmad: Kuwait 32 - Ruh Al-Ma'ani fi Tafsir Al-Quran Al-Azim wa Al-Sab' Al-Mathani, Shihab Al-Din Mahmoud bin Abdullah Al-Husayni Al-Alusi, Investigator: Ali Abdul Bari Atiyah, Publisher: Dar Al-Kutub Al-Ilmiyah: Beirut, Edition: First, 1415 AH. 33 - Al-Ruh fi Al-Kalam 'ala Arwah Al-Amwat wa Al-Ahya' bi Al-Dala'il min Al-Kitab wa Al-Sunnah, Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams Al-Din Ibn Qayyim Al-Jawziyya, Publisher: Dar Al-Kutub Al-Ilmiyah: Beirut. 34 - Rawdat Al-Talibin wa Umdat Al-Muftin, Abu Zakariya Muhyiddin Yahya bin Sharaf Al-Nawawi, Investigation: Zuhair Al-Shawish, Publisher: Al-Maktab Al-Islami, Beirut, Edition: Third, 1412 AH - 1991 AD.",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 91
  },
  {
    "serial_number": "34463",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 90,
    "volume_number": 1,
    "text": "35 - Zad Al-Masir, Ibn Al-Jawzi, Zad Al-Masir fi Ilm Al-Tafsir, Jamal Al-Din Abu Al-Faraj Abdul Rahman bin Ali bin Muhammad Al-Jawzi, Investigator: Abdul Razzaq Al-Mahdi, Publisher: Dar Al-Kitab Al-Arabi: Beirut, Edition: First, 1422 AH. 36 - Zad Al-Ma'ad fi Hadyi Khayr Al-Ibad, Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams Al-Din Ibn Qayyim Al-Jawziyya, Publisher: Mu'assasat Al-Risalah: Beirut - Maktabat Al-Manar Al-Islamiyah: Kuwait, Edition: Twenty-seventh, 1415 AH / 1994 AD. 37 - Silsilat Al-Ahadith Al-Sahihah wa Shay' min Fiqhiha wa Fawa'idiha, Abu Abdul Rahman Muhammad Nasser Al-Din bin Al-Hajj Nuh bin Najati bin Adam Al-Ashqudri Al-Albani, Publisher: Maktabat Al-Ma'arif for Publishing and Distribution: Riyadh, Edition: First, Year of Publication: Vol 1-4: 1415 AH - 1995 AD, Vol 6: 1416 AH - 1996 AD, Vol 7: 1422 AH - 2002 AD. 38 - Silsilat Al-Ahadith Al-Da'ifah wa Al-Mawdu'ah wa Atharuha Al-Sayyi' fi Al-Ummah, Abu Abdul Rahman Muhammad Nasser Al-Din bin Al-Hajj Nuh bin Najati bin Adam, Al-Ashqudri Al-Albani, Publisher: Dar Al-Ma'arif, Riyadh, Ed: 1, 1412 AH - 1992 AD. 39 - Sunan Ibn Majah, Abu Abdullah Muhammad bin Yazid Al-Qazwini, Investigator: Shu'aib Al-Arna'ut - Adel Murshid - Muhammad Kamil Qarah Balli - Abdul Latif Harz Allah, Publisher: Dar Al-Risalah Al-Alamiyah, Edition: First, 1430 AH - 2009 AD. 40 - Sunan Abi Dawood, Abu Dawood Suleiman bin Al-Ash'ath bin Ishaq bin Bashir bin Shaddad bin Amr Al-Azdi Al-Sijistani, Investigator: Shu'aib Al-Arna'ut - Muhammad Kamil Qarah Balli, Publisher: Dar Al-Risalah Al-Alamiyah, Edition: First, 1430 AH - 2009 AD. 41 - Al-Sunan Al-Kubra, Ahmed bin Al-Hussein bin Ali bin Musa Al-Khusrawjirdi Al-Khurasani Abu Bakr Al-Bayhaqi, Investigator: Muhammad Abdul Qadir Ata, Publisher: Dar Al-Kutub Al-Ilmiyah: Beirut, Edition: Third, 1424 AH - 2003 AD. 42 - Sha'n Al-Du'a, Author: Abu Suleiman Hamad bin Muhammad bin Ibrahim bin Al-Khattab Al-Busti known as Al-Khattabi, Investigator: Ahmed Yusuf Al-Daqqaq, Publisher: Dar Al-Thaqafah Al-Arabiyah, Edition: First, 1404 AH - 1984 AD, Third, 1412 AH - 1992 AD. 43 - Sharh Usul I'tiqad Ahl Al-Sunnah wa Al-Jama'ah, Abu Al-Qasim Hibatullah bin Al-Hasan bin Mansour Al-Tabari Al-Razi Al-Lalaka'i, Investigation: Ahmed bin Saad bin Hamdan Al-Ghamdi, Publisher: Dar Taybah: Saudi Arabia, Edition: Eighth, 1423 AH - 2003 AD. 44 - Sharh Al-Sunnah, Abu Muhammad Al-Hussein bin Masoud bin Muhammad bin Al-Farra' Al-Baghawi Al-Shafi'i, Investigation: Shu'aib Al-Arna'ut - Muhammad Zuhair Al-Shawish, Publisher: Al-Maktab Al-Islami - Damascus, Beirut, Edition: Second, 1403 AH - 1983 AD.",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 92
  },
  {
    "serial_number": "34464",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 91,
    "volume_number": 1,
    "text": "45 - Sharh Mushkil Al-Athar, Abu Ja'far Ahmed bin Muhammad bin Salamah bin Abdul Malik bin Salamah Al-Azdi Al-Hajari Al-Masri known as Al-Tahawi, Investigation: Shu'aib Al-Arna'ut, Publisher: Mu'assasat Al-Risalah 46 - Al-Shari'ah, Abu Bakr Muhammad bin Al-Hussein bin Abdullah Al-Ajurri Al-Baghdadi, Investigator: Dr. Abdullah bin Umar bin Suleiman Al-Dumaiji, Dar Al-Watan: Riyadh, Edition: Second, 1420 AH - 1999 AD. 47 - Shu'ab Al-Iman, Ahmed bin Al-Hussein bin Ali bin Musa Al-Khusrawjirdi Al-Khurasani, Abu Bakr Al-Bayhaqi, Investigated, text reviewed and hadiths extracted by: Dr. Abdul Ali Abdul Hamid Hamid, Supervised investigation and hadith extraction: Mukhtar Ahmed Al-Nadwi, owner of Al-Dar Al-Salafiyyah in Bombay - India, Publisher: Maktabat Al-Rushd for Publishing and Distribution in Riyadh in cooperation with Al-Dar Al-Salafiyyah in Bombay India, Edition: First, 1423 AH - 2003 AD. 48 - Al-Sarim Al-Munki fi Al-Radd 'ala Al-Subki, Shams Al-Din Muhammad bin Ahmed bin Abdul Hadi Al-Hanbali, Investigation: Aqil bin Muhammad bin Zaid Al-Maqtari Al-Yamani, Introduction by: His Eminence Sheikh Muqbil bin Hadi Al-Wadi'i, Publisher: Mu'assasat Al-Rayyan: Beirut, Edition: First, 1424 AH - 2003 AD. 49 - Sahih Ibn Hibban bi Tartib Ibn Balban, Muhammad bin Hibban bin Ahmed bin Hibban Al-Tamimi Abu Hatim Al-Darimi Al-Busti, Investigator: Shu'aib Al-Arna'ut, Publisher: Mu'assasat Al-Risalah: Beirut, Edition: Second, 1414 AH - 1993 AD. 50 - Sahih Al-Jami', Muhammad Nasser Al-Din bin Al-Hajj Nuh bin Najati bin Adam Al-Ashqudri Al-Albani, Publisher: Al-Maktab Al-Islami. 51 - ... Al-Sawa'iq Al-Mursalah fi Al-Radd 'ala Al-Jahmiyyah wa Al-Mu'attilah, Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams Al-Din Ibn Qayyim Al-Jawziyya, Investigator: Ali bin Muhammad Al-Dakhil Allah, Publisher: Dar Al-Asimah, Riyadh, Edition: First, 1408 AH. 52 - Al-Tibb Al-Nabawi Al-Tibb, Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams Al-Din Ibn Qayyim Al-Jawziyya, Publisher: Dar Al-Hilal: Beirut, Edition: First, 1421 AH - 2000 AD. 53 - Umdat Al-Qari Sharh Sahih Al-Bukhari, Abu Muhammad Mahmoud bin Ahmed bin Musa bin Ahmed bin Hussein Al-Ghaytabi Al-Hanafi Badr Al-Din Al-Ayni, Publisher: Dar Ihya' Al-Turath Al-Arabi: Beirut. 54 - 'Iyar Al-Shi'r, Muhammad bin Ahmed bin Muhammad bin Ahmed bin Ibrahim Tabataba, Al-Hasani Al-Alawi, Abu Al-Hasan, Investigator: Abdul Aziz bin Nasser Al-Mani', Publisher: Maktabat Al-Khanji: Cairo. 55 - Al-Ain, Abu Abdul Rahman Al-Khalil bin Ahmed bin Amr bin Tamim Al-Farahidi Al-Basri, Investigator: Dr. Mahdi Al-Makhzumi, Dr. Ibrahim Al-Samarrai, Publisher: Dar wa Maktabat Al-Hilal. 56 - Gharib Al-Hadith, Jamal Al-Din Abu Al-Faraj Abdul Rahman bin Ali bin Muhammad Al-Jawzi, Investigator: Dr. Abdul Mu'ti Amin Al-Qal'aji, Publisher: Dar Al-Kutub Al-Ilmiyah: Beirut, Edition: First, 1405 AH - 1985 AD.",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 93
  },
  {
    "serial_number": "34465",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 92,
    "volume_number": 1,
    "text": "57 - Al-Gharibain fi Al-Quran wa Al-Hadith, Abu Ubaid Ahmed bin Muhammad Al-Harawi, Investigation and Study: Ahmed Farid Al-Mazidi, Introduction and Revision: Prof. Dr. Fathi Hijazi, Publisher: Maktabat Nizar Mustafa Al-Baz - Kingdom of Saudi Arabia, Edition: First, 1419 AH - 1999 AD. 58 - Al-Fatawa Al-Fiqhiyyah Al-Kubra, Ahmed bin Muhammad bin Ali bin Hajar Al-Haytami Al-Sa'di Al-Ansari, Compiled by: Sheikh Abdul Qadir bin Ahmed bin Ali Al-Fakihi Al-Makki, Publisher: Al-Maktabah Al-Islamiyah. 59 - Fatawa Nur 'ala Al-Darb, Abdul Aziz bin Abdullah bin Baz, Compiled by: Dr. Muhammad bin Saad Al-Shuwai'ir. 60 - Fatawa wa Rasa'il Samahat Al-Sheikh Muhammad bin Ibrahim bin Abdul Latif Al Al-Sheikh, Collection, Arrangement and Investigation: Muhammad bin Abdul Rahman bin Qasim, Publisher: Government Press in Makkah Al-Mukarramah, Edition: First, 1399 AH. 61 - Fath Al-Bari Sharh Sahih Al-Bukhari, Ahmed bin Ali bin Hajar Abu Al-Fadl Al-Asqalani Al-Shafi'i, Publisher: Dar Al-Ma'rifah - Beirut, 1379 AH, Numbered books, chapters and hadiths: Muhammad Fuad Abdul Baqi, Directed, corrected and supervised printing: Muhibb Al-Din Al-Khatib, With comments by the scholar: Abdul Aziz bin Abdullah bin Baz. 62 - Fath Al-Majid Sharh Kitab Al-Tawhid, Abdul Rahman bin Hasan bin Muhammad bin Abdul Wahhab bin Suleiman Al-Tamimi, Investigator: Muhammad Hamid Al-Fiqi, Publisher: Matba'at Al-Sunnah Al-Muhammadiyah, Cairo, Edition: Seventh, 1377 AH / 1957 AD. 63 - Al-Futuhat Al-Rabbaniyyah 'ala Al-Adhkar Al-Nawawiyyah, Muhammad bin Allan Al-Siddiqi Al-Shafi'i Al-Ash'ari Al-Makki, Publisher: Jam'iyat Al-Nashr wa Al-Ta'lif Al-Azhariyyah. 64 - Al-Fiqh Al-Aqadi li Al-Nawazil, Abdul Rahim Samayil Al-Sulami, Prepared by Al-Maktaba Al-Shamela team. 65 - Fiqh Al-Nawazil Dirasah Ta'siliyyah Tatbiqiyyah, Muhammad bin Hussein Al-Jizani, Dar Ibn Al-Jawzi: Dammam, Edition: Second, 1427 AH - 2006 AD. 66 - Fiqh Al-Nawazil wa Qimatuhu Al-Tashri'iyyah wa Al-Fikriyyah, Dr. Hassan Al-Filali, Research presented to Islamic Studies Division at Faculty of Arts and Humanities, Sidi Mohamed Ben Abdellah University, Fez, 1404 AH. 67 - Fayd Al-Bari 'ala Sahih Al-Bukhari, Muhammad Anwar Shah bin Mu'azzam Shah Al-Kashmiri Al-Hindi then Al-Deobandi, Investigator: Muhammad Badr Alam Al-Mirthi, Professor of Hadith at Islamic University in Dabhel (Collected dictations, edited them and placed Al-Badr Al-Sari footnote to Fayd Al-Bari), Publisher: Dar Al-Kutub Al-Ilmiyah Beirut, Edition: First, 1426 AH - 2005 AD. 68 - Fayd Al-Qadir Sharh Al-Jami' Al-Saghir, Zain Al-Din Muhammad called Abdul Raouf bin Taj Al-Arifin bin Ali bin Zain Al-Abidin Al-Haddadi then Al-Munawi Al-Qahiri, Publisher: Al-Maktabah Al-Tijariyah Al-Kubra - Egypt, Edition: First, 1356 AH. 69 - Qa'idah Mukhtasarah fi Wujub Ta'at Allah wa Rasulihi wa Wulat Al-Umur, Taqi Al-Din Abu Al-Abbas Ahmed bin Abdul Halim",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 94
  },
  {
    "serial_number": "34466",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 93,
    "volume_number": 1,
    "text": "bin Abdul Salam bin Abdullah bin Abi Al-Qasim bin Muhammad Ibn Taymiyyah Al-Harrani, Investigator: Abdul Razzaq bin Abdul Mohsen Al-Badr, Publisher: Guidance and Orientation Agency in National Guard, Kingdom of Saudi Arabia, Edition: Second, 1417 AH. 70 - Al-Qamus Al-Muhit, Majd Al-Din Abu Tahir Muhammad bin Yaqub Al-Fairuzabadi, Investigation: Heritage Investigation Office in Mu'assasat Al-Risalah under supervision of: Muhammad Naim Al-Arqsousi, Publisher: Mu'assasat Al-Risalah for Printing, Publishing and Distribution: Beirut, Edition: Eighth, 1426 AH - 2005 AD. 71 - Al-Qanun fi Al-Tibb, Abu Ali Al-Hussein bin Abdullah bin Sina, Investigator: Footnotes placed by Muhammad Amin Al-Dannawi. 72 - Qurrat Ayn Al-Akhyar li Takmilat Radd Al-Muhtar 'ala Al-Durr Al-Mukhtar Sharh Tanwir Al-Absar (printed at the end of Radd Al-Muhtar), Ala' Al-Din Muhammad bin Umar bin Abdul Aziz Abidin Al-Husayni Al-Dimashqi, Publisher: Dar Al-Fikr for Printing, Publishing and Distribution, Beirut. 73 - Al-Qawanin Al-Fiqhiyyah, Abu Al-Qasim Muhammad bin Ahmed bin Muhammad bin Abdullah Ibn Juzayy Al-Kalbi Al-Gharnati. 74 - Al-Qawl Al-Sadid Sharh Kitab Al-Tawhid, Abu Abdullah, Abdul Rahman bin Nasser bin Abdullah bin Nasser bin Hamad Al-Sa'di, Publisher: Ministry of Islamic Affairs, Endowments, Da'wah and Guidance - Kingdom of Saudi Arabia, Edition: Second: 1421 AH. 75 - Al-Kashf Al-Mubdi li Tamwih Abi Al-Hasan Al-Subki, Takmilat Al-Sarim Al-Munki, Muhammad bin Hussein bin Suleiman bin Ibrahim Al-Faqih, Study and Investigation: Dr. Saleh bin Ali Al-Muhsin, Dr. Abu Bakr bin Salim Shahal, Publisher: Dar Al-Fadilah: Riyadh, Edition: First 1422 AH - 2002 AD. 76 - Al-Kashf wa Al-Bayan 'an Tafsir Al-Quran, Ahmed bin Muhammad bin Ibrahim Al-Tha'labi, Abu Ishaq, Investigation: Abu Muhammad bin Ashour, Review and Audit: Professor Nazir Al-Sa'idi, Publisher: Dar Ihya' Al-Turath Al-Arabi, Beirut, Edition: First 1422 AH - 2002 AD. 77 - Al-Kuna wa Al-Asma', Abu Bishr Muhammad bin Ahmed bin Hammad bin Sa'id bin Muslim Al-Ansari Al-Dawlabi Al-Razi, Investigator: Abu Qutaiba Nazar Muhammad Al-Faryabi, Publisher: Dar Ibn Hazm - Beirut, Edition: First, 1421 AH - 2000 AD. 78 - Lubab Al-Ta'wil fi Ma'ani Al-Tanzil, or what is known as Tafsir Al-Khazin, Ala' Al-Din Ali bin Muhammad bin Umar Al-Shihi Abu Al-Hasan known as Al-Khazin, Correction: Muhammad Ali Shahin, Publisher: Dar Al-Kutub Al-Ilmiyah: Beirut, Edition: First, 1415 AH. 79 - Al-Lubab fi Ulum Al-Kitab, Abu Hafs Siraj Al-Din Umar bin Ali bin Adil Al-Hanbali Al-Dimashqi Al-Nu'mani, Investigator: Sheikh Adel Ahmed Abdul Mawjud and Sheikh Ali Muhammad Mu'awwad, Publisher: Dar Al-Kutub Al-Ilmiyah: Beirut, Edition: First, 1419 AH - 1998 AD",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 95
  },
  {
    "serial_number": "34467",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 94,
    "volume_number": 1,
    "text": "80 - Lisan Al-Arab, Abu Al-Fadl Jamal Al-Din Muhammad bin Mukarram bin Ali bin Manzur Al-Ansari Al-Ruwaifi'i Al-Ifriqi, Publisher: Dar Sader: Beirut, Edition: Third, 1414 AH. 81 - Ma Rawahu Al-Wa'un fi Akhbar Al-Ta'un, Jalal Al-Din Al-Suyuti, Explanation, Investigation and Study: Dr. Muhammad Ali Al-Bar, Dar Al-Qalam: Damascus. 82 - Majma' Al-Zawa'id wa Manba' Al-Fawa'id, Abu Al-Hasan Nur Al-Din Ali bin Abi Bakr bin Suleiman Al-Haythami, Investigator: Hossam Al-Din Al-Qudsi, Publisher: Maktabat Al-Qudsi, Cairo, Year of Publication: 1414 AH - 1994 AD. 83 - Mujmal Al-Lugha, Ahmed bin Faris bin Zakariya Al-Qazwini Al-Razi, Abu Al-Hussein, Study and Investigation: Zuhair Abdul Mohsen Sultan, Publisher: Mu'assasat Al-Risalah: Beirut, Edition Second: 1406 AH - 1986 AD. 84 - Majmu' Al-Fatawa, Taqi Al-Din Abu Al-Abbas Ahmed bin Abdul Halim bin Taymiyyah Al-Harrani, Investigator: Abdul Rahman bin Muhammad bin Qasim, Publisher: King Fahd Complex for Printing the Holy Quran, Madinah, Kingdom of Saudi Arabia, Year of Publication: 1416 AH - 1995 AD. 85 - Majmu' Fatawa Al-Allamah Abdul Aziz bin Baz, Supervised collection and printing: Muhammad bin Saad Al-Shuwai'ir. 86 - Majmu' Fatawa wa Rasa'il Al-Sheikh Ibn Uthaymeen (Fatwas of Doctrine), Collection and Arrangement: Fahd Nasser Al-Suleiman, Dar Al-Watan: Riyadh, Edition: First, 1413 AH. 87 - Al-Muhkam wa Al-Muhit Al-A'zam, Abu Al-Hasan Ali bin Ismail bin Sidah Al-Mursi, Investigator: Abdul Hamid Hindawi, Publisher: Dar Al-Kutub Al-Ilmiyah - Beirut, Edition: First, 1421 AH - 2000 AD. 88 - Madarij Al-Salikin bayna Manazil Iyyaka Na'budu wa Iyyaka Nasta'in, Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams Al-Din Ibn Qayyim Al-Jawziyya, Investigator: Muhammad Al-Mu'tasim Billah Al-Baghdadi, Publisher: Dar Al-Kitab Al-Arabi - Beirut, Edition: Third, 1416 AH - 1996 AD. 89 - Al-Mustadrak 'ala Al-Sahihayn, Abu Abdullah Al-Hakim Muhammad bin Abdullah bin Muhammad bin Hamdawayh Al-Dabbi Al-Tahmani Al-Naysaburi known as Ibn Al-Bayyi', Investigation: Mustafa Abdul Qadir Ata, Publisher: Dar Al-Kutub Al-Ilmiyah: Beirut, Edition: First, 1411 AH - 1990 AD. 90 - Musnad Abi Ya'la, Abu Ya'la Ahmed bin Ali bin Al-Muthanna bin Yahya bin Isa bin Hilal Al-Tamimi, Al-Mawsili, Investigator: Hussein Salim Assad, Publisher: Dar Al-Ma'mun for Heritage: Damascus, Edition: First, 1404 AH - 1984 AD. 91 - Musnad Al-Imam Ahmed bin Hanbal, Abu Abdullah Ahmed bin Muhammad bin Hanbal bin Hilal bin Asad Al-Shaybani, Investigator: Shu'aib Al-Arna'ut - Adel Murshid, and others, Supervision: Dr. Abdullah bin Abdul Mohsen Al-Turki, Publisher: Mu'assasat Al-Risalah, Edition: First, 1421 AH - 2001 AD.",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 96
  },
  {
    "serial_number": "34468",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 95,
    "volume_number": 1,
    "text": "92 - Musnad Al-Bazzar published as Al-Bahr Al-Zakhkhar, Abu Bakr Ahmed bin Amr bin Abdul Khaliq bin Khallad bin Ubaid Allah Al-Ataki known as Al-Bazzar, Investigation: Mahfouz Al-Rahman Zain Allah - Adel bin Saad - Sabri Abdul Khaliq Al-Shafi'i, Publisher: Maktabat Al-Ulum wa Al-Hikam: Madinah, Edition: First, Started: 1988 AD, Ended: 2009 AD. 93 - Al-Musnad Al-Sahih Al-Mukhtasar bi Naql Al-Adl 'an Al-Adl ila Rasul Allah salla Allahu alayhi wa sallam named Sahih Muslim, Muslim bin Al-Hajjaj Abu Al-Hasan Al-Qushayri Al-Naysaburi, Investigator: Muhammad Fuad Abdul Baqi, Publisher: Dar Ihya' Al-Turath Al-Arabi - Beirut. 94 - Masabih Al-Sunnah, Abu Muhammad Al-Hussein bin Masoud bin Muhammad bin Al-Farra' Al-Baghawi Al-Shafi'i, Investigation: Dr. Yusuf Abdul Rahman Al-Mar'ashli, Muhammad Salim Ibrahim Samara, Jamal Hamdi Al-Dhahabi. 95 - Al-Misbah Al-Munir fi Gharib Al-Sharh Al-Kabir, Ahmed bin Muhammad bin Ali Al-Fayumi then Al-Hamawi, Publisher: Al-Maktabah Al-Ilmiyah: Beirut. Kitab Al-Faraj ba'd Al-Shiddah, Abu Ali Al-Muhassin bin Ali bin Muhammad bin Abi Al-Fahm Dawud Al-Tanukhi Al-Basri, Investigation: Abboud Al-Shalji, Publisher: Dar Sader, Beirut, Year of Publication: 1398 AH - 1978 AD. 96 - Al-Musannaf fi Al-Ahadith wa Al-Athar, Abu Bakr bin Abi Shaybah Abdullah bin Muhammad bin Ibrahim bin Uthman bin Khawasti Al-Absi, Investigator: Kamal Yusuf Al-Hout, Publisher: Maktabat Al-Rushd: Riyadh, Edition: First, 1409 AH. 97 - Ma'alim Al-Tanzil fi Tafsir Al-Quran, known as Tafsir Al-Baghawi, Abu Muhammad Al-Hussein bin Masoud bin Muhammad bin Al-Farra' Al-Baghawi Al-Shafi'i, Investigator: Abdul Razzaq Al-Mahdi, Publisher: Dar Ihya' Al-Turath Al-Arabi: Beirut, Edition: First, 1420 AH. 98 - Al-Mu'jam Al-Awsat, Suleiman bin Ahmed bin Ayyub bin Mutair Al-Lakhmi Al-Shami Abu Al-Qasim Al-Tabarani, Investigator: Tariq bin Awad Allah bin Muhammad, Abdul Mohsen bin Ibrahim Al-Husayni, Publisher: Dar Al-Haramain - Cairo. 99 - Mu'jam Al-Buldan, Shihab Al-Din Abu Abdullah Yaqut bin Abdullah Al-Rumi Al-Hamawi, Publisher: Dar Sader, Beirut, Edition: Second, 1995 AD. 100 - Al-Mu'jam Al-Kabir, Suleiman bin Ahmed bin Ayyub bin Mutair Al-Lakhmi Al-Shami Abu Al-Qasim Al-Tabarani, Investigator: Hamdi bin Abdul Majid Al-Salafi, Maktabat Ibn Taymiyyah: Cairo, Edition: Second, and includes the part published later from Vol 13 by: Dar Al-Sumai'i: Riyadh, Edition: First, 1415 AH - 1994 AD. 101 - Mu'jam Al-Lugha Al-Arabiyyah Al-Mu'asirah, Dr. Ahmed Mukhtar Abdul Hamid Omar, with assistance of a work team, Publisher: Alam Al-Kutub, Edition: First, 1429 AH - 2008 AD. 102 - Mu'jam Al-Mustalahat Al-Tibbiyyah, Prepared by: Dr. Abu Shadi Al-Roubi - Dr. Muhammad Imad Fadli and others, Academy of the Arabic Language in Egypt. 103 - Mu'jam Al-Mustalahat wa Al-Shawahid Al-Falsafiyyah, Jalal Al-Din Sa'id, Dar Al-Janoub for Publishing: Tunisia, 2004 AD.",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 97
  },
  {
    "serial_number": "34469",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 96,
    "volume_number": 1,
    "text": "104 - Mu'jam Al-Mu'allifin, Omar Rida Kahhala, Publisher: Maktabat Al-Muthanna: Beirut - Dar Ihya' Al-Turath Al-Arabi: Beirut. 105 - A Dictionary of Epidemiology, John M. Last, Publisher: World Health Organization: Eastern Mediterranean Regional Office, Third Edition, Year: 2000 AD. 106 - Al-Mu'jam Al-Wasit, Academy of the Arabic Language in Cairo, Ibrahim Mustafa - Ahmed Al-Zayat - Hamid Abdul Qadir - Muhammad Al-Najjar, Publisher: Dar Al-Da'wah. 107 - Mu'jam Lughat Al-Fuqaha, Muhammad Rawas Qal'aji - Hamid Sadiq Qunaybi, Publisher: Dar Al-Nafa'is for Printing, Publishing and Distribution, Edition: Second, 1408 AH - 1988 AD. 108 - Al-Mu'in 'ala Tafahhum Al-Arba'in, Ibn Al-Mulaqqin Siraj Al-Din Abu Hafs Umar bin Ali bin Ahmed Al-Shafi'i Al-Masri, Study and Investigation: Dr. Daghash bin Shabib Al-Ajmi, Publisher: Maktabat Ahl Al-Athar for Publishing and Distribution, Hawalli - Kuwait, Edition: First, 1433 AH - 2012 AD. 109 - Maqayis Al-Lugha, Ahmed bin Faris bin Zakariya Al-Qazwini Al-Razi, Investigator: Abdul Salam Muhammad Harun, Publisher: Dar Al-Fikr, Year of Publication: 1399 AH - 1979 AD. 110 - Al-Muntaqa Sharh Al-Muwatta, Abu Al-Walid Suleiman bin Khalaf bin Sa'd Al-Tujibi Al-Qurtubi Al-Baji Al-Andalusi, Publisher: Matba'at Al-Sa'adah: Cairo, Edition: First, 1332 AH. 111 - Al-Minhaj Sharh Sahih Muslim bin Al-Hajjaj, Abu Zakariya Muhyiddin Yahya bin Sharaf Al-Nawawi, Publisher: Dar Ihya' Al-Turath Al-Arabi: Beirut, Edition: Second, 1392 AH. 112 - Manhaj Istinbat Ahkam Al-Nawazil Al-Fiqhiyyah Al-Mu'asirah, Dr. Misfer bin Ali Al-Qahtani, Dar Al-Andalus Al-Khadra': Jeddah, Ed: 1, 1424 AH - 2003 AD. 113 - Mawsu'at Kashshaf Istilahat Al-Funun wa Al-Ulum, Muhammad bin Ali Ibn Al-Qadi Muhammad Hamid bin Muhammad Sabir Al-Faruqi Al-Hanafi Al-Thanawi, Presentation, Supervision and Review: Dr. Rafiq Al-Ajam, Investigation: Dr. Ali Dahrouj, Transfer of Persian text to Arabic: Dr. Abdullah Al-Khalidi, Foreign translation: Dr. George Zinani, Publisher: Maktabat Lubnan Publishers - Beirut, Edition: First - 1996 AD. 114 - Al-Muwatta, Malik bin Anas bin Malik bin Amir Al-Asbahi Al-Madani, Investigator: Muhammad Mustafa Al-A'zami, Publisher: Zayed bin Sultan Al Nahyan Charitable and Humanitarian Foundation - Abu Dhabi, Edition: First, 1425 AH - 2004 AD. 115 - Al-Nahw Al-Wafi, Abbas Hasan, Publisher: Dar Al-Ma'arif, Fifteenth Edition. 116 - Naqd Al-Shi'r, Qudamah bin Ja'far bin Qudamah bin Ziyad Al-Baghdadi, Abu Al-Faraj, Publisher: Matba'at Al-Jawa'ib - Constantinople, Edition: First, 1302 AH.",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 98
  },
  {
    "serial_number": "34470",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 97,
    "volume_number": 1,
    "text": "117 - Al-Nukat wa Al-Uyun, or known as Tafsir Al-Mawardi, Abu Al-Hasan Ali bin Muhammad bin Muhammad bin Habib Al-Basri Al-Baghdadi famous as Al-Mawardi, Investigator: Al-Sayyid bin Abdul Maqsud bin Abdul Rahim, Publisher: Dar Al-Kutub Al-Ilmiyah: Beirut, Ed: N/A, Date: N/A. 118 - Al-Nihaya fi Gharib Al-Hadith wa Al-Athar, Majd Al-Din Abu Al-Sa'adat Al-Mubarak bin Muhammad bin Abdul Karim Al-Shaybani Al-Jazari Ibn Al-Athir, Investigation: Tahir Ahmed Al-Zawi - Mahmoud Muhammad Al-Tanahi, Publisher: Al-Maktabah Al-Ilmiyah - Beirut, 1399 AH - 1979 AD. 119 - Al-Wajiz fi Tafsir Al-Kitab Al-Aziz, Abu Al-Hasan Ali bin Ahmed bin Muhammad bin Ali Al-Wahidi, Al-Naysaburi, Al-Shafi'i, Investigation: Safwan Adnan Daoudi, Publisher: Dar Al-Qalam, Al-Dar Al-Shamiyah - Damascus, Beirut, Edition: First, 1415 AH. 120 - Al-Wasit fi Tafsir Al-Quran Al-Majid, Abu Al-Hasan Ali bin Ahmed bin Muhammad bin Ali Al-Wahidi, Al-Naysaburi, Al-Shafi'i, Investigation and Commentary: Sheikh Adel Ahmed Abdul Mawjud, Sheikh Ali Muhammad Mu'awwad, Dr. Ahmed Muhammad Seira, Dr. Ahmed Abdul Ghani Al-Jamal, Dr. Abdul Rahman Owais, Presented and Reviewed by: Professor Dr. Abdul Hayy Al-Farmawi, Publisher: Dar Al-Kutub Al-Ilmiyah, Beirut, Edition: First, 1415 AH - 1994 AD. Electronic Websites: 1 - Bawabat Al-Wafd website https:// rosaelyoussef.com utm_campaign=nabdapp.com&utm_medium=referral&utm_source=nabdapp.com&ocid=Nabd_App 2 - Article in Asharq Al-Awsat Newspaper https:// aawsat.com/ home/ article/ 2763911 3 - Article in Al-Madina Newspaper https:// www.al-madina.com/ article/ 687372/ 4 - Arageek Electronic website https:// www.arageek.com. 5 - Al-Shorouk Electronic website https:// www.shorouknews.com 6 - Assabah website https:// assabah.ma 7 - WHO website https:// www.who.int/ ar/ emergencies/ diseases/ novel-coronavirus-2019/ question-and-answers-hub/ q-a-detail/ coronavirus-disease-covid-19 8 - Al-Marefa Electronic website https:// www.marefa.org/ 9 - Al-Wakala News website https:// elwekalanews.net/ 411656/ 10 - Youm7 website https:// www.youm 7.com 11 - Ahl Al-Muntada website https:// saydatar.ahlamontada.com/ t 23 - topic",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 99
  },
  {
    "serial_number": "34471",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 98,
    "volume_number": 1,
    "text": "12 - Orient News website https:// orient-news.net/ ar/ news_show/ 178623/ 0 13 - Dalil Al-Watan website https:// elwatan 140.com/ 14 - DW News website https:// www.dw.com/ ar/ 15 - DW Medical website https:// www.dw.com/ ar 16 - Rqiim Electronic website https:// www.rqiim.com/ rania 10682 17 - CDC Medical website https:// www.cdc.gov/ plague 18 - Akhbar El-Yom Newspaper website https:// akhbarelyom.com/ news/ newdetails/ 3026169/ 1/ 19 - Al-Wafd Electronic Newspaper website https:// alwafd.news/. 20 - Al-Wakala News Newspaper website https:// elwekalanews.net 21 - Sada El-Balad Electronic Newspaper website https:// www.elbalad.news/ 4239940 22 - Hespress Electronic Newspaper website https:// www.hespress.com 23 - Sada El-Balad website https:// www.elbalad.news 24 - Irfaasawtak Electronic website https:// www.irfaasawtak.com/ extremism/ 25 - Ala Al-Tareeq website https:// talalsalman.com/ 26 - Al-Maany Electronic Dictionary website https:// www.almaany.com/ ar/ dict/ ar-en/ corona 27 - Al-Ain News Channel website https:// al-ain.com/ article/ heritage-book-histroy 28 - Mayo Clinic website https:// www.mayoclinic.org/ ar/ diseases-conditions/ coronavirus/ symptoms-causes/ syc-20479963 29 - Al-Bawaba Electronic Magazine website https:// www.albawabhnews.com/ 3950628 30 - Middle East Online website https:// middle-east-online.com 31 - Hiba Press website: https:// ar.hibapress.com 32 - Howiyapress website http:// howiyapress.com/ 33 - Saudi Ministry of Health website https:// www.moh.gov.sa/ HealthAwareness/ EducationalContent/ PublicHealth/ Pages/ corona.aspx 34 - Saudi Press Agency SPA website https:// www.spa.gov.sa/ viewstory.php? lang=ru&newsid=2049484 35 - Al-Jazirah Newspaper website https:// www.al-jazirah.com/ 2020/ 20200430/ rj 2.htm 36 - Al-Nashra Al-Dawlia News website https:// alnashraaldawlia.com/ 23/ 03/ 2020/",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 100
  },
  {
    "serial_number": "34472",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Correct Directives for Doctrinal New Occurrences Related to the Coronavirus Epidemic - Covid 19 (COVID-19)",
    "edition": "None",
    "publisher": "None",
    "page_number": 99,
    "volume_number": 1,
    "text": "37 - Al-Hurra News Channel website https:// www.alhurra.com/ iraq/ 2020/ 03/ 10 38 - Article in Al-Bilad Newspaper https:// albiladdaily.com/ 2020/ 05/ 01/",
    "foot_note": "None",
    "book_id": "648",
    "new_page_number": 101
  }
]