[
  {
    "text": "What the Pillars [of Knowledge] Narrated about Not Coming to the Sultans (Ma Rawahu al-Asatin fi 'Adam al-Maji' ila al-Salatin)\nAuthor: عبد الرحمن بن أبي بكر جلال الدين السيوطي\nYear: 911",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "What the Pillars [of Knowledge] Narrated about Not Coming to the Sultans (Ma Rawahu al-Asatin fi 'Adam al-Maji' ila al-Salatin)",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 1
  },
  {
    "text": "sn: 5432\nbook_title: ما رواه الأساطين في عدم المجيء إلى السلاطين\nbook_link: https://shamela.ws/book/191\nbook_id: 191\nauthor_name: عبد الرحمن بن أبي بكر جلال الدين السيوطي\nauthor_year: 911\nnickname: Null\nauthor_link: https://shamela.ws/author/7\nauthor_ID: 7\neditor: تحقيق ودراسة: مجدي فتحي السيد\npublisher: دار الصحابة للتراث، مصر\nedition: الأولى، 1411 هـ - 1991 م\npages: 70\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الرقائق والآداب والأذكار\ncategory_id: 23",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "What the Pillars [of Knowledge] Narrated about Not Coming to the Sultans (Ma Rawahu al-Asatin fi 'Adam al-Maji' ila al-Salatin)",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 2
  },
  {
    "serial_number": "5003154",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars [of Knowledge] Narrated about Not Coming to the Sultans (Ma Rawahu al-Asatin fi 'Adam al-Maji' ila al-Salatin)",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Softening of Hearts, Etiquette, and Remembrances\nBook: What the Pillars [of Knowledge] Narrated about Not Coming to the Sultans\nAuthor: Abd al-Rahman bin Abi Bakr, Jalal al-Din al-Suyuti (d. 911 AH)\nInvestigation and Study: Magdy Fathi Al-Sayed\n(Some typographical errors and omissions in the printed version have been corrected)\nDate of publication in Shamela: 9 Dhu al-Qi'dah 1432\n\n[Repeated title information omitted for brevity]",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 3
  },
  {
    "serial_number": "5003155",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 1,
    "volume_number": 1,
    "text": "From the masterpieces of Al-Hafiz Jalal al-Din al-Suyuti\nWhat the Pillars Narrated about Not Coming to the Sultans\nCondemnation of the Judiciary and Assuming Judgments\nCondemnation of Unjust Taxes (Al-Maks)\nInvestigation and Study by Magdy Fathi Al-Sayed",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 4
  },
  {
    "serial_number": "5003156",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 2,
    "volume_number": 1,
    "text": "A book that has contained pearls ... Observed with the eye of beauty\nFor this I said as a notice ... Copyrights reserved\nFor Dar Al-Sahaba for Heritage in Tanta\nFor Publishing - and Investigation - and Distribution\nCorrespondence: Tanta, Al-Mudiriya St. - In front of Al-Ta'awun Gas Station\nTel: 331587 P.O. Box: 477\nFirst Edition 1411 AH - 1991 AD",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 5
  },
  {
    "serial_number": "5003157",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 3,
    "volume_number": 1,
    "text": "Introduction\n1 - Presentation.\n2 - Before the Book.\n3 - Biography of the Author.\n4 - Description of the Book's Manuscripts.\n5 - My Work in the Book.",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 6
  },
  {
    "serial_number": "5003158",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Masters Narrated About Not Going to the Rulers",
    "edition": "First Edition, 1411 AH - 1991 CE",
    "publisher": "Dar al-Sahabah for Heritage, Egypt",
    "page_number": 5,
    "volume_number": 1,
    "text": "Introduction\nIn the name of Allah, the Most Merciful, the Most Compassionate.\nAll praise is due to Allah; we praise Him, seek His help, and ask His forgiveness. We seek refuge in Allah from the evils of our souls and from the consequences of our deeds. Whoever Allah guides, none can misguide; and whoever He misguides, none can guide. I bear witness that there is no deity worthy of worship except Allah alone with no partner, and I bear witness that Muhammad is His servant and His messenger.\n\n{O you who believe, fear Allah as He should be feared, and do not die except as Muslims}.\n\n{O mankind, fear your Lord who created you from a single soul, and created from it its mate, and spread from both many men and women. And fear Allah, through whom you ask one another, and the wombs. Indeed, Allah is ever watching over you}.\n\n{O you who believe, fear Allah and speak words of appropriate justice. He will correct your deeds and forgive your sins. And whoever obeys Allah and His Messenger has certainly attained a great success}.\n\nTo proceed: These are pages from our precious heritage—pages we are in dire need of amidst today’s imported ideologies and foreign concepts that are far removed from our religion and entirely alien to the morals of the people of our lands.",
    "foot_note": "1. ( ) Surah Aal ‘Imran: 102. (**) Surah An-Nisa: 1. (… ) Surah Al-Ahzab: 70–71.",
    "book_id": "191",
    "new_page_number": 7
  },
  {
    "serial_number": "5003159",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 6,
    "volume_number": 1,
    "text": "So praise be to Allah who granted me success to bring them out to the world of light, after they remained confined in the world of manuscripts for long centuries. And on hope and wish for another renewed meeting with the masterpieces of Al-Jalal Al-Suyuti, I entrust you to Allah, and peace be upon you, and the mercy of Allah and His blessings. Magdy Fathi Al-Sayed Ibrahim",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 8
  },
  {
    "serial_number": "5003160",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 7,
    "volume_number": 1,
    "text": "Before the Book\nThis book contains three hadith treatises from the rare treatises of Al-Suyuti in their field.\nAs for the first treatise, it revolves around what came from the trustworthy scholars, or in Al-Suyuti's own words: What the pillars narrated regarding the condemnation of coming to the princes and sultans.\nAmong the matters condemned by the Prophetic hadiths and Salafist traditions is entering the palaces of princes and sultans, because of what it leads a person to, of belittling Allah's blessing upon him, remaining silent about their reprehensible acts out of awe for them, and striving to please them at the expense of the texts of the Sharia.\nThe scholar Al-Munawi, may Allah have mercy on him, clarified this matter perfectly with his saying: This is so because whoever adheres to them - meaning the doors of princes - is not safe from hypocrisy, and does not obtain anything from their world except that they take from his religion something more valuable than it. This is a great trial for scholars, and a difficult pretext for Satan against them, especially one who has an acceptable dialect, sweet speech, eloquence, and grandiloquence, as Satan continues to suggest to him: that in your entering upon them and admonishing them is a deterrence for them from injustice and establishment of the Sharia. Then when he enters, he does not delay in flattering, praising, and being hypocritical, so he perishes and causes perishing (1).\nTherefore, it became famous among the righteous predecessors that the scholars of the sultan are in great danger and in severe calamity.\nMahmoud Al-Warraq did well with his saying:\nThey rode the mounts and went early ... in groups to the door of the Caliph\nThey connected the early morning to the evening ... to reach the honorable ranks\nUntil when they attained what ... they sought of the pleasant condition",
    "foot_note": "1. (1) Fayd al-Qadir (3/121).",
    "book_id": "191",
    "new_page_number": 9
  },
  {
    "serial_number": "5003161",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 8,
    "volume_number": 1,
    "text": "And the loyalists among them became ... happy with what the page contained\nAnd they oppressed those below them ... with injustice and violent conduct\nThey sold trust for betrayal ... and bought the carcass with safety\nHe did not benefit from knowledge when ... his passionate world enamored him\nHe forgot the Deity and sought refuge in the ... world with weak causes (1).\nTherefore, the scholar Al-Suyuti stands in this book advising the people of knowledge to preserve their knowledge from the doors of sultans, and not to buy the worldly life with the Hereafter, and sell guidance for misguidance.\nAs for the second treatise, it is about warning against assuming the judiciary; and judgments among the servants. Perhaps this warning appears clearly in the Prophetic hadith narrated by Abu Hurairah, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: \"Whoever is appointed as a judge has been slaughtered without a knife\" (2).\nThe meaning of this hadith is warning against seeking the judiciary, and in this is a clarification that the judiciary is an ordeal and not a gift, and a test, not a choice.\nThe righteous predecessors knew the danger of the judiciary, so they used to flee from assuming it out of fear of falling into what angers Allah the Almighty.\nHere is Umar bin Abd al-Aziz, may Allah have mercy on him, after Suleiman bin Abd al-Malik appointed him before his death, Umar stands preaching to the people, saying: \"O people, I have been afflicted with this matter without an opinion from me, nor a request for it, nor consultation from the Muslims, and I have removed what is on your necks of my pledge of allegiance, so choose for yourselves.\"",
    "foot_note": "1. (1) Jami' Bayan al-'Ilm wa Fadlihi (p/259) by Ibn Abd al-Barr. \n2. Authentic Hadith. Its extraction will come.",
    "book_id": "191",
    "new_page_number": 10
  },
  {
    "serial_number": "5003162",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 9,
    "volume_number": 1,
    "text": "Al-Suyuti in this treatise advises Muslims to know the danger of the judiciary and the greatness of its affair, for through it money may be lost, blood shed, and honor desecrated, and through it justice is established among people, giving the oppressed his right, and lifting injustice from the one who was wronged.\nThe judiciary is a great matter, so warning against it is precious advice for those who think it is a gain for reputation and prestige, and an elevator of status. It is a warning to those who thought it is a treasure they have stumbled upon, so let them seize it, and take from it whatever way they can.\nAs for the last treatise, it talks about the condemnation of unjust taxes (Al-Maks). It is advice to those who impose on people money they have no right to, so they consume people's money falsely and slanderously. Al-Maks: is the levy, and Al-Makis: is the tithe collector. Therefore, Ibn Sirin said to Anas, may Allah be pleased with him: You employ me over the tithes of people so I decrease them (umakisuhum) and they decrease me? Its meaning: You employ me over what decreases my religion, because of what is feared of increase and decrease in taking and leaving.\nI have seen that the three treatises are organized in a single string of pearls, so I collected them together for complete benefit. For the condemnation of coming to the doors of sultans is followed by distancing oneself from assuming the judiciary, which is generally through entering the doors of princes. And if a person distances himself from the judiciary, he has become far from people's money and blood.\nI ask Allah the Great to place these pages in the balance of my deeds, on a Day when neither wealth nor sons will benefit except him who comes to Allah with a sound heart.\nAnd our last prayer is that praise be to Allah, Lord of the Worlds.\nMagdy Fathi Al-Sayed Ibrahim",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 11
  },
  {
    "serial_number": "5003163",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 10,
    "volume_number": 1,
    "text": "Biography of the Author\n(1) His Lineage and Scientific Upbringing:\nHe is Abd al-Rahman bin Abi Bakr bin Muhammad bin Sabiq al-Din bin al-Fakhr Uthman bin Nazir al-Din Muhammad bin Sayf al-Din Khader bin Najm al-Din Abi al-Salah Ayyub bin Nasir al-Din Muhammad bin Sheikh Hammam al-Din al-Khudari al-Asyuti.\nHe was born after Maghrib on the night of Sunday, the beginning of the month of Rajab in the year eight hundred and forty-nine (849 AH).\nHe memorized the Quran young, not exceeding eight years, and sat teaching knowledge while he was seventeen years old, and issued fatwas while he was twenty-seven years old. This shows us the extent of his eagerness for knowledge. He grew up an orphan, but this did not prevent him from persisting in lessons of knowledge, so he memorized \"Al-Umdah\", \"Minhaj al-Fiqh wa al-Usul\", and \"Alfiyyah Ibn Malik\".\nHe took inheritance law (Farai'd) from the scholar, the inheritance expert of his time, Shihab al-Din al-Sharmasahi, about whom it was said: He reached a very old age, and exceeded a hundred by much.\nHe adhered in Fiqh to Alam al-Din al-Bulqini until he died. He adhered to Sheikh al-Islam Sharaf al-Din al-Munawi in Tafsir, and in Hadith and Arabic he adhered to Taqi al-Din al-Shibli al-Hanafi.\n(2) His Knowledge:\nThe scholar Al-Suyuti delved deep into various sciences, for he had a great share in every science, and he said about himself:",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 12
  },
  {
    "serial_number": "5003164",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 11,
    "volume_number": 1,
    "text": "\"I was granted depth in seven sciences: Tafsir, Hadith, Fiqh, Grammar (Nahw), Meanings (Ma'ani), Rhetoric (Bayan), and Bad'i\" (1). He said: When I performed Hajj, I drank from Zamzam water for matters, among them that I reach in Fiqh the rank of Siraj al-Din al-Bulqini, and in Hadith the rank of Al-Hafiz Ibn Hajar.\n(3) His Works:\nHe has many works, which found in every age acceptance from people, because of the great benefits they contained. Al-Suyuti wrote a treatise for himself (2), in which he thoroughly listed what he authored, which is considered an index of his works, which reached in this index 538 works, classified as follows:\n73 works in Tafsir.\n205 works in Hadith.\n32 works in Hadith Terminology.\n20 works in Fiqh.\n21 works in Ethics and Principles of Fiqh and Religion.\n20 works in Language, Grammar, and Morphology.\n66 works in Meanings, Rhetoric, and Bad'i.\nThese are some of the works he authored in various fields of knowledge.\nFrom his works in the Quran and its sciences:\n1 - Al-Durr al-Manthur fi al-Tafsir bi al-Ma'thur.",
    "foot_note": "1. (1) Husn al-Muhadarah (1/215). \n2. Published by Sheikh Abd al-Aziz al-Sirwan in the introduction to Mu'jam Tabaqat al-Huffaz.",
    "book_id": "191",
    "new_page_number": 13
  },
  {
    "serial_number": "5003165",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 12,
    "volume_number": 1,
    "text": "2 - Al-Itqan fi Ulum al-Quran.\n3 - Lubab al-Nuqul fi Asbab al-Nuzul.\n4 - Al-Nasikh wa al-Mansukh fi al-Quran.\n5 - Tanasuq al-Durar fi Tanasub al-Suwar.\n6 - Al-Azhar al-Fa'iha 'ala al-Fatiha.\n7 - Al-Qawl al-Fasih fi Ta'yin al-Dhabih.\nFrom his Hadith works:\n1 - Mirqat al-Su'ud ila Sunan Abi Dawud.\n2 - Qut al-Mughtadhi 'ala Jami' al-Tirmidhi.\n3 - Zahr al-Ruba 'ala al-Mujtaba li al-Nasa'i.\n4 - Misbah al-Zujajah 'ala Sunan Ibn Majah.\n5 - Tanwir al-Hawalik 'ala Muwatta' Malik.\n6 - Jam' al-Jawami', which is large, starting with: Glory be to the One who originated the shining stars... etc.\n7 - Al-Jami' al-Saghir min Hadith al-Bashir al-Nadhir... Printed several times, and Sheikh Al-Albani - may Allah preserve him - investigated it in two large sections, under the title Sahih al-Jami' in 6 volumes, and Da'if al-Jami' likewise.\nAnd from his works in Creed (Aqidah):\n1 - Sharh al-Kawkab al-Waqqad fi al-I'tiqad.\n2 - Tanzih al-I'tiqad 'an al-Hulul wa al-Ittihad.\nAnd from his works in Language, Grammar, and Morphology:\n1 - Al-Mizhar fi Ulum al-Lughah.\n2 - Sharh Shawahid Mughni al-Labib.\n3 - Al-Nukat 'ala al-Alfiyyah wa al-Kafiyah wa al-Shafiyah.",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 14
  },
  {
    "serial_number": "5003166",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 13,
    "volume_number": 1,
    "text": "4 - Al-Ifsah fi Lughat al-Nikah.\n5 - Al-Wafiyah bi-Ikhtisar al-Alfiyyah.\nAnd from his works in Hadith Terminology:\n1 - Tadrib al-Rawi fi Sharh Taqrib al-Nawawi.\n2 - Sharh Alfiyyah al-Iraqi.\n3 - Al-Luma' fi Asbab al-Hadith.\n4 - Al-Tadhnib fi al-Zawa'id 'ala al-Taqrib.\n5 - Kashf al-Tadlis 'an Qalb Ahl al-Tadlis.\nAnd from his Fiqh works:\n1 - Mukhtasar al-Ahkam al-Sultaniyyah.\n2 - Al-Fawa'id al-Mumtaza fi Salat al-Janazah.\n3 - Al-Lum'ah fi Tahqiq al-Rak'ah li-Idrak al-Jumu'ah.\nAnd from his Rhetorical works:\n1 - Al-Nukat 'ala Talkhis al-Miftah.\n2 - An Alfiyyah called Uqud al-Juman fi al-Ma'ani wa al-Bayan.\n(4) Scholars' Criticisms of Him:\n1 - He authored some treatises that contradicted the creed of the righteous predecessors, such as the treatise Al-Manjali fi Tatawwur al-Wali, the treatise Natijat al-Fikr fi al-Jahr bi al-Dhikr, the treatise \"Ithaf al-Firqah bi-Rafw al-Khirqah\", Masalik al-Hunafa fi Waliday al-Mustafa, the treatise Al-Khabar al-Dall 'ala Wujud al-Qutb wa al-Awtad wa al-Nujaba wa al-Abdal, and the treatise Tanwir al-Halak fi Imkan Ru'yat al-Nabi wa al-Malak.\n2 - He summarized many of the books of his predecessors, and did not refer to the original.\nAnd in any case, everyone can have their words taken or rejected except the Infallible One, peace and blessings be upon him.",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 15
  },
  {
    "serial_number": "5003167",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 14,
    "volume_number": 1,
    "text": "His Death:\nImam Al-Suyuti, may Allah have mercy on him, died in the pre-dawn of Friday night, the nineteenth of Jumada al-Ula of the year 910 AH. His death was in his home, after an illness that lasted for seven days. The day of his death was a witnessed day; the Muslims prayed the funeral prayer over him.\nSo may Allah have extensive mercy on him, and reward him with all good on behalf of the Muslims, and may Allah place what he exerted of effort in spreading knowledge in the balance of his good deeds on the Day of Resurrection.\nFor more details, refer to the following sources and references:\n1 - Husn al-Muhadarah: (1/225, 229), (2/296).\n2 - Al-Kawakib al-Sa'irah: (1/226).\n3 - Shadharat al-Dhahab: (8/51).\n4 - Al-Daw' al-Lami': (1/5, 6) (2/9), (4/65).\n5 - Fahras al-Faharis: (/351 - 353).\n6 - Hadiyat al-Arifin: (1/534 - 344).\n7 - Al-Wafi bi al-Wafayat: (17/226 - 231).\n8 - Kashf al-Zunun: (1/8).\n9 - Al-A'lam by Al-Zirikli: (3/301 - 302).\n10 - Khulasat al-Athar: (1/2 - 4 - 33), (3/433).\nAnd praise be to Allah first and last.",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 16
  },
  {
    "serial_number": "5003168",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 15,
    "volume_number": 1,
    "text": "Description of the Book's Manuscripts and Documentation of Attribution to the Author\nAll manuscripts of this book are from the collections of the Egyptian National Library (Dar al-Kutub al-Misriyyah), rich with the treasures of our precious heritage.\nAs for the first manuscript, its title is: \"Book of What the Pillars Narrated about Not Coming to the Sultans\". The manuscript falls under the art of Hadith, number (1423), and there is a microfilm copy of it. It consists of (24) pages, each page has (21) lines, and each line has approximately (15) words.\nAl-Suyuti himself mentioned it within the sequence of his works under number (249) within his works in Hadith and its related subjects. Haji Khalifa attributed it to him in Kashf al-Zunun (1/828), (2/1574).\nAs for the second manuscript, it is titled: \"Treatise on the Condemnation of the Judiciary and Assuming Judgments\" and falls in 9 pages under the code \"Majami' Taymur\" number (201). There is a microfilm copy of it number (14153). Each of its pages has about (23) lines, and in each line an average of (9) words.\nAl-Suyuti himself mentioned it among his works as in the index of his works under number (81) under the list of Hadith and its related subjects. Haji Khalifa attributed it to him in Kashf al-Zunun (1/828).\nAs for the last manuscript, it is titled \"Condemnation of Unjust Taxes (Dhamm al-Maks)\".",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 17
  },
  {
    "serial_number": "5003169",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 16,
    "volume_number": 1,
    "text": "This manuscript falls in (5) pages, under the code \"Hadith\" number (1416), and there is a photocopied version of it number (22644). Each of its pages has (21) lines, and in each line approximately (7) words.\nAl-Suyuti attributed it to himself among his Hadith works under number (101). The handwriting of all manuscripts is readable and clear. Haji Khalifa attributed it to him (1/828) in Kashf al-Zunun.",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 18
  },
  {
    "serial_number": "5003170",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 20,
    "volume_number": 1,
    "text": "My Work in the Book\nI have tried to bring this book to be in a splendid suit and a bright image, and this is with my modest effort, and in this work I followed the following:\n1 - I numbered the texts of the book to facilitate reading them and referring to them when needed without trouble.\n2 - I attributed the Quranic verses to their Surahs, then extracted the Prophetic hadiths and Salafist traditions in the book, mentioning the degree of the hadith or tradition whenever possible.\n3 - I commented on some traditions, and mentioned the scientific or linguistic benefits they contained.\n4 - I introduced the book with an introduction about the book and its author, and the manuscript and its description.\n5 - I prepared scientific indexes serving the book such as the index of verses, hadiths, traditions, and notable figures.\n6 - I placed internal headings since the author did not place them.\nFinally, with pages of our precious heritage I leave you, asking my Lord for more success, and praise be to Allah, Lord of the Worlds.\nMagdy Fathi Al-Sayed Ibrahim\nTanta - Egypt",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 19
  },
  {
    "serial_number": "5003171",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 21,
    "volume_number": 1,
    "text": "The First Treatise\nWhat the Pillars Narrated about Not Coming to the Sultans\nBy Al-Jalal Al-Suyuti, may Allah Almighty have mercy on him",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 20
  },
  {
    "serial_number": "5003172",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 22,
    "volume_number": 1,
    "text": "1 - Prohibition of coming to the Sultans in the Prophetic Sunnah.\n2 - The most hated of creation to Allah Almighty.\n3 - Does the one entering upon the Sultan arrive at the Basin (Hawd)?\n4 - The jurists are the trustees of the Messengers.\n5 - The scholar with the Sultan in punishment.\n6 - Among the characteristics of the scholars of the end of times.\n7 - Sultans of Fitnah (Tribulation).\n8 - They study religion for the sake of the world.",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 21
  },
  {
    "serial_number": "5003173",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 23,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\nPraise be to Allah, and sufficient is He, and peace be upon His servants whom He has chosen. This is what the pillars narrated, regarding not coming to the Sultans:\nProhibition of Coming to the Sultans in the Prophetic Sunnah\n1 - Abu Dawud, Al-Tirmidhi who classified it as Hasan, Al-Nasa'i, and Al-Bayhaqi in (Shu'ab al-Iman) narrated from Ibn Abbas, may Allah be pleased with them both, from the Prophet, peace and blessings be upon him, who said: (Whoever dwells in the desert becomes rough (1), whoever follows game becomes heedless (2), and whoever comes to the doors of the Sultans (3) falls into Fitnah) (4).",
    "foot_note": "1. (1) Meaning his heart becomes hard and cruel, so he does not soften for kindness or maintaining ties of kinship due to his distance from scholars and lack of mixing with virtuous people. \n2. Because of his eagerness which distracts from mercy and tenderness, or because if he concerns himself with it he neglects his interests, or because of his resemblance to predators and his attraction away from tenderness. Al-Hafiz Ibn Hajar said: It is disliked to persist in hunting and doing it excessively because it might distract from some obligations and many recommended acts, and its evidence is this hadith. Ibn al-Munir said: Engaging in hunting for one whose livelihood depends on it is legislated, and for one for whom it occurs while his livelihood is from something else, it is permissible, but as for hunting merely for amusement, it is the subject of prohibition. \n3. Because even if he agrees with him in his desire, he has risked his religion, and if he opposes him, he has risked his soul, and because he sees the vastness of the world so he belittles Allah's blessing upon him, and perhaps he employs him so he is not safe from sin in this world and punishment in the Hereafter. Said by Al-Munawi in Fayd al-Qadir (6/153). \n4. Authentic. And its chain is weak. Narrated by Ahmad (1/357), Abu Dawud (2859), Al-Tirmidhi (2256), Al-Nasa'i (7/195 - 196), Al-Bukhari (9/70) in his Tarikh al-Kabir, Abu Nu'aym (4/72) in Al-Hilyah, and Al-Tabarani (11030) in Al-Kabir. In the chain of all of them is Abu Musa, one of the unknown narrators, as in Al-Taqrib (2/479) =",
    "book_id": "191",
    "new_page_number": 22
  },
  {
    "serial_number": "5003174",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 24,
    "volume_number": 1,
    "text": "2 - Abu Dawud and Al-Bayhaqi narrated from Abu Hurairah, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, who said: (Whoever dwells in the desert has become rough, whoever follows game becomes heedless, whoever comes to the doors of the Sultans falls into Fitnah, and a servant does not increase in closeness to the Sultan except that he increases in distance from Allah) (5).\n3 - Ahmad narrated in his Musnad, and Al-Bayhaqi with an authentic chain, from Abu Hurairah, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: (Whoever dwells in the desert becomes rough, whoever follows game becomes heedless, whoever comes to the doors of the Sultan falls into Fitnah, and no one increases in closeness to the Sultan except that he increases in distance from Allah) (6).\nThe Most Hated of Creation to Allah Almighty\n4 - Ibn Adi narrated from Abu Hurairah, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: (Indeed, in Hell there is a valley from which Hell seeks refuge seventy times every day; Allah has prepared it for the reciters who show off in their deeds, and indeed the most hated of creation to Allah is the scholar of the Sultan) (7).",
    "foot_note": "1. = * It has a witness from the hadith of Abu Hurairah, narrated by Ahmad (2/371, 440), and Ibn Adi (1/312) in Al-Kamil, and Sheikh Al-Albani classified it as Hasan as in Al-Sahihah (1272). It has a witness from the hadith of Al-Bara', narrated by Ahmad (4/297) and Al-Haythami said in Majma' al-Zawa'id (5/254): Narrated by Abu Ya'la and its men are trustworthy. \n5. Authentic Hadith. Narrated by Al-Bayhaqi (10/101) in his Sunan, and see the previous. \n6. Authentic Hadith. See the previous. \n7. Very Weak. Narrated by Ibn Adi (2/468) in Al-Kamil, and Ibn al-Jawzi (1/133) in Al-Ilal al-Mutanahiyah from the path of Abu al-Hasan al-Hanzali from Bukayr bin Shihab bin Sirin from Abu Hurairah. Ibn Adi said: Bukayr is Munkar al-Hadith (denounced in hadith), and Al-Dhahabi said: Abu al-Hasan is unknown, see: Al-Mizan (1/350). =",
    "book_id": "191",
    "new_page_number": 23
  },
  {
    "serial_number": "5003175",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 25,
    "volume_number": 1,
    "text": "5 - Ibn Bilal and Al-Hafiz Abu al-Fatyan al-Dahistani in the book (Warning against Evil Scholars), and Al-Rafi'i in (Tarikh Qazwin) narrated from Abu Hurairah, who said: The Messenger of Allah, peace and blessings be upon him, said: (Indeed, the most hated of creation to Allah Almighty is the scholar who visits the rulers) (8).\n6 - And the wording of Abu al-Fatyan: (Indeed, the most despised of creation to Allah is: The scholar who visits the rulers) (9).\n7 - Ibn Majah narrated from Abu Hurairah, who said: The Messenger of Allah, peace and blessings be upon him, said: (Indeed, the most hated of reciters to Allah Almighty are those who visit the princes) (10).\n8 - Al-Daylami narrated in (Musnad al-Firdaws) from Abu Hurairah, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: (If you see a scholar mixing with the Sultan a lot, then know that he is a thief) (11).",
    "foot_note": "1. = * Narrated with similar meaning briefly by Al-Tabarani (12803) in Al-Kabir from the hadith of Ibn Abbas, and Al-Haythami said: Narrated by Al-Tabarani from his sheikh Yahya bin Abdullah bin Abdawaih from his father, and I did not know them, and the rest of its men are the men of the Sahih. I say: It contains Al-Hasan, and he is a mudallis (one who conceals defects in the chain), and he narrated it with 'an'anuh (saying 'from'). \n8. Fabricated Hadith. See: Ithaf al-Sadah (1/389), (6/127), Da'if al-Jami' (1357). Al-Munawi said in Fayd al-Qadir (2/407): It contains Muhammad bin Ibrahim al-Sayyah, the sheikh of Ibn Majah. Al-Dhahabi said: Al-Barqani said: I asked Al-Daraqutni about him, and he said: A liar. And Isam Ibn Rawwad al-Asqalani, he said in Al-Mizan: Al-Hakim softened him. And Bukayr al-Damghani is Munkar al-Hadith. \n9. See the previous. \n10. Weak Hadith. Narrated by Al-Tirmidhi (2383), Ibn Majah (256), and Ibn Adi (5/1727) in Al-Kamil. In its chain is Ammar bin Sayf, one of the weak narrators as in Al-Taqrib (2/47), and see: Majma' al-Zawa'id (10/388), Al-La'ali al-Masnu'ah (2/245), Tanzih al-Shari'ah (2/385), Da'if al-Jami' (2459). \n11. Weak Hadith. See: Al-Firdaws (1077), and Da'if al-Jami' (599). * His saying: (then know that he is a thief) i.e., a stealer, meaning a fraudster to snatch the world, and attract it to himself from forbidden sources and others, just as a thief tries to take goods out of custody. So mixing with him is harmful because of his looking at the utility of the perishable, base world, and preferring it over the enduring Hereafter. Said by Al-Munawi in Fayd al-Qadir (1/354).",
    "book_id": "191",
    "new_page_number": 24
  },
  {
    "serial_number": "5003176",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 26,
    "volume_number": 1,
    "text": "And Ibn Majah narrated with a chain whose narrators are trustworthy, from Ibn Abbas, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, who said: (Indeed, people from my nation will study the religion deeply and recite the Quran, and they will say: We come to the princes to obtain some of their worldly benefits, and we withdraw from them with our religion. And that will not be. Just as nothing is gathered from the Astragalus (12) except thorns, likewise nothing is gathered from nearness to them except sins) (13).\n10 - Al-Tabarani narrated in (Al-Awsat) with a chain whose narrators are trustworthy, from Thawban, may Allah be pleased with him, the freed slave of the Messenger of Allah, peace and blessings be upon him, who said: O Messenger of Allah, am I from the People of the House (Ahl al-Bayt)? He remained silent, then said in the third time: (Yes, as long as you do not stand at the door of a Saddah (gate/authority), or come to a prince and ask him) (14). Al-Hafiz Al-Mundhiri said in (Al-Targhib wa Al-Tarhib): The intended meaning of Saddah here is the door of the Sultan and the like.",
    "foot_note": "1. (12) Al-Qatad: A thorny tree, having no fruit except thorns. \n13. Weak Hadith. Narrated by Ibn Majah (255) from the path of Al-Walid bin Muslim from Yahya bin Abd al-Rahman al-Kindi from Ubayd Allah bin Abi Burdah from Ibn Abbas with it. * In its chain is Al-Walid bin Muslim narrating with 'an'anuh, and he is one of the mudallisin (concealers). And it contains Ibn Abi Burdah, and he is one of the acceptable narrators (Maqbulin) as in Al-Taqrib (1/539). ** Narrated by Ibn Asakir in his history as in Kanz al-Ummal (28988) starting with: \"There will be a people after me from my nation who recite the Quran ....\". \n14. Weak Hadith. Narrated by Abu Nu'aym in Al-Hilyah (1/180 - 181) from the path of Khalid bin al-Harith narrated to us Tarif bin Isa al-Ambari narrated to me Yusuf bin Abd al-Hamid who said: I met Thawban. So he mentioned it. * In its chain are Tarif bin Isa and Yusuf bin Abd al-Hamid, both of whom are unknown as in Al-Jarh wa Al-Ta'dil (4/494), (9/226). ** Al-Haythami cited it in Majma' al-Zawa'id (9/173) and said: Narrated by Al-Tabarani in Al-Awsat, and its men are trustworthy.",
    "book_id": "191",
    "new_page_number": 25
  },
  {
    "serial_number": "5003177",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 27,
    "volume_number": 1,
    "text": "Does the One Entering Upon the Sultan Arrive at the Basin?\n11 - Al-Tirmidhi narrated and authenticated, and Al-Nasa'i, and Al-Hakim and authenticated, that the Messenger of Allah, peace and blessings be upon him, said: (There will be princes after me, so whoever enters upon them and believes them in their lies, and helps them in their injustice, he is not of me, and I am not of him, and he will not arrive at me at the Basin. And whoever does not enter upon them, and does not help them in their injustice, and does not believe them in their lies, he is of me, and I am of him, and he will arrive at me at the Basin) (15).\n[[And Ahmad, Abu Ya'la, and Ibn Hibban in his Sahih narrated from Abu Sa'id al-Khudri, may Allah be pleased with him, from the Prophet, peace and blessings be upon him: (There will be princes covered by covers (Ghawash) and retinues (Hawash) from the people).]] (*)\n12 - Ahmad, Abu Nu'aym, and Ibn Hibban in his Sahih narrated from Abu Sa'id al-Khudri, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, who said: \"There will be princes covered by covers and retinues from the people who lie and oppress. So whoever enters upon them, and believes them",
    "foot_note": "1. (15) Authentic Hadith: Narrated by Ahmad (3/321), Al-Tirmidhi (609), (2360), Al-Nasa'i (7/161), Ibn Hibban (1/248, 250, 251), and Al-Hakim (1/79) all from the hadith of Ka'b, may Allah be pleased with him, and likewise Ibn Abi Asim (758) in Al-Sunnah, and Al-Tabarani (19/134, 135) in Al-Kabir. * It has a witness from the hadith of Abu Sa'id al-Khudri, narrated by Ahmad (3/24), and Ibn Hibban (1/252). ** It has a witness from the hadith of Khabbab, narrated by Ahmad (5/111), (6/395), Ibn Hibban (1/251), Al-Hakim (1/78), and Al-Tabarani (3627) in Al-Kabir, and likewise Ibn Abi Asim (757) in Al-Sunnah. \n…. It has a witness from the hadith of Hudhayfah, narrated by Ahmad (5/384), and Ibn Abi Asim (759) in Al-Sunnah. **** It has a witness from the hadith of Al-Nu'man, narrated by Ahmad (4/267, 268). * It has a witness from the hadith of Ibn Umar, narrated by Ahmad (2/95), and Lu'lu' (14) in his Juz'. (*) The preparer of the book for Al-Shamela said: What is between the brackets is not in the printed version",
    "book_id": "191",
    "new_page_number": 26
  },
  {
    "serial_number": "5003178",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 28,
    "volume_number": 1,
    "text": "in their lies, and helps them in their injustice, then I am innocent of him and he is innocent of me. And whoever does not enter upon them, and does not believe them in their lies, and does not help them in their injustice, then he is of me and I am of him\" (16).\n13 - Ahmad, Al-Bazzar, and Ibn Hibban in his Sahih narrated from Jabir bin Abdullah, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: (There will be princes, whoever enters upon them and helps them in their injustice, and believes them in their lies, he is not of me and I am not of him, and he will never arrive at me at the Basin. And whoever does not enter upon them, and does not help them in their injustice, and does not believe them in their lies, he is of me and I am of him and will arrive at me at the Basin) (17).\n14 - Al-Shirazi narrated in (Al-Alqab) from Ibn Umar, may Allah be pleased with them both, who said: The Messenger of Allah, peace and blessings be upon him, said: (Indeed, there will be princes, so whoever believes them in their lies, and helps them in their injustice, and frequents their doors, he is not of me and I am not of him, and he will not arrive at me at the Basin. And whoever does not believe them in their lies, and does not help them in their injustice, and does not frequent their doors, he is of me and will arrive at me at the Basin) (18).\nThe Jurists are the Trustees of the Messengers\n15 - Al-Hasan bin Sufyan in his Musnad, Al-Hakim in his History, Abu Nu'aym, Al-Uqayli, Al-Daylami, and Al-Rafi'i in his History narrated from Anas bin Malik, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said:",
    "foot_note": "1. (16) See the previous. \n17. See the previous. \n18. See the previous.",
    "book_id": "191",
    "new_page_number": 27
  },
  {
    "serial_number": "5003179",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 29,
    "volume_number": 1,
    "text": "(The scholars are the trustees of the Messengers over the servants of Allah as long as they do not mix with the Sultan. If they mix with the Sultan, they have betrayed the Messengers, so beware of them, and avoid them) (19).",
    "foot_note": "1. (19) Weak Hadith. Narrated by Ibn Abd al-Barr (1/185) in Jami' Bayan al-'Ilm wa Fadlihi, and Ibn al-Jawzi (1/263) in Al-Mawdu'at. Abu Hatim (2/137) said in Al-Ilal: This is a Munkar hadith, it seems there is a man in the chain who was not named, and that man was dropped. * Al-Sakhawi said in Takhrij Ahadith al-Adilin (p/99-100) the following: And from Al-Hakim via Muhammad bin Hajjaj bin Isa narrated to us Ibrahim bin Rustam narrated to us Hafs al-Abdi from Ismail bin Sami' al-Hanafi from Anas. So he mentioned it. And Al-Hasan bin Sufyan narrated it, and through his path Abu Nu'aym, and through his path Al-Daylami said: Narrated to us Makhlad Ibn Malik narrated to us Ibrahim bin Rustam with it. And Al-Uqayli narrated it in Al-Du'afa' saying: Informed us Abdullah bin Muhammad bin Sa'dawayh al-Marwazi informed us Ali bin al-Hasan al-Marwazi informed us Ibrahim bin Rustam narrated to us Hafs al-Ayri from Ismail bin Sami' with it. And he said following it: Indeed, this Hafs is Kufan, and his hadith is not preserved (Ghayr Mahfuz). And Al-Daylami also narrated it via Muhammad bin Yazid bin Sabiq narrated to us Nuh bin Abi Maryam from Ismail bin Sami' with it. And Muhammad bin Mu'awiyah al-Naysaburi narrated it from Muhammad bin Yazid from Ismail bin Sami' with it, and it is a hadith that is not authentic. As for Hafs al-Abdi, whose name was mistaken in Al-Uqayli's narration by some narrators, Ahmad said: We abandoned his hadith and tore it up. Ali bin al-Madini said: Not trustworthy. Al-Nasa'i said: Matruk (abandoned). As for Nuh, he is very weak, rather accused of fabrication. As for Muhammad bin Mu'awiyah, Ibn Ma'in said: He is a liar. Al-Athram said on the authority of Ahmad: I saw his hadiths as fabricated. I say: For complete research, refer to the following sources: Al-La'ali al-Masnu'ah (1/114), Tanzih al-Shari'ah (2/84, 267), Tadhkirat al-Mawdu'at (24), Kashf al-Khafa (132), Al-Ihya (1/68), Ithaf al-Sadah (1/388). =",
    "book_id": "191",
    "new_page_number": 28
  },
  {
    "serial_number": "5003180",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 30,
    "volume_number": 1,
    "text": "16 - Al-Askari narrated from Ali bin Abi Talib, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: (The jurists are the trustees of the Messengers, as long as they do not enter into the world and follow the Sultan. If they do that, then beware of them) (20).\nThe Scholar with the Sultan in Punishment\n17 - Al-Hakim in his History and Al-Daylami narrated from Mu'adh bin Jabal, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: (No scholar comes to a ruler willingly, except that he is his partner in every type of punishment he is punished with in the Fire of Hell) (21).\n18 - Abu al-Sheikh narrated in (Al-Thawab) from Mu'adh bin Jabal, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: (If a man recites the Quran and studies the religion deeply, then",
    "foot_note": "1. = ** His saying: \"Trustees of the Messengers\" for they entrusted them with the laws they brought, which are the sciences and deeds. So they are trustees over ablution, prayer, fasting, zakat, Hajj, and all beliefs, and everything they are required to believe in, and knowledge and action. So whoever's knowledge matches his action, and his secret matches his public, is proceeding on the Sunnah of the Prophets, so he is the Trustworthy (Amin). And whoever is opposite to that is the Traitor, and between that are degrees, therefore he said: (as long as they do not mix with the Sultan). Said by Al-Munawi in Fayd al-Qadir (4/383). \n20. Weak Hadith. Al-Sakhawi said: Al-Hakim narrated it in some of his works, and through his path Al-Daylami in his Musnad. I say: See: Tadhkirat al-Mawdu'at (25), Kashf al-Khafa (2/132), Da'if al-Jami' (4036). * Abu Nu'aym (3/194) narrated it in Al-Hilyah as a saying of Ja'far bin Muhammad, may Allah have mercy on him. \n21. Weak Hadith. Al-Hakim narrated it in his History. See: Tadhkirat al-Mawdu'at (25), Kashf al-Khafa (2/271), Da'if al-Jami' (5196), Al-Maqasid al-Hasanah (983), and Tamyiz al-Tayyib (1216) and he said: Al-Daylami narrated it from Mu'adh bin Jabal with it as Marfu', and it is not authentic.",
    "book_id": "191",
    "new_page_number": 29
  },
  {
    "serial_number": "5003181",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 31,
    "volume_number": 1,
    "text": "comes to the door of the Sultan, flattering him, and greedy for what is in his hand, he wades into the Fire of Hell according to the measure of his steps) (22).\nAmong the Characteristics of the Scholars of the End of Times\n19 - Al-Daylami narrated from Ibn Abbas, may Allah be pleased with them both, who said: The Messenger of Allah, peace and blessings be upon him, said: (There will be in the end of times scholars who encourage people towards the Hereafter but do not desire it themselves, and make people renounce the world but do not renounce it themselves, and forbid visiting the princes but do not desist themselves) (23).\n20 - Al-Daylami narrated from Umar bin al-Khattab, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: (Indeed, Allah loves the princes if they mix with the scholars, and hates the scholars if they mix with the princes; because if scholars mix with princes they desire the world, and if princes mix with scholars they desire the Hereafter) (24).\n21 - Abu Amr al-Dani narrated in the book (Al-Fitan) from Al-Hasan, who said: The Messenger of Allah, peace and blessings be upon him, said: (This nation will continue to be under Allah's hand and protection, as long as its reciters do not hypocritically flatter its princes) (25).",
    "foot_note": "1. (22) Weak Hadith. Al-Daylami (1134) narrated it in Al-Firdaws. See: Ithaf al-Sadah (1/390), (6/126), and Da'if al-Jami' (728). \n23. Weak Hadith. Al-Daylami narrated it as in Al-Firdaws (3422). See: Ithaf al-Sadah (6/126). \n24. Weak Hadith. Al-Daylami narrated it as in Al-Firdaws (566). See: Kashf al-Khafa (2/244), and Ithaf al-Sadah (6/125). \n25. Weak Hadith. Its chain is Mursal. Al-Daylami (7595) narrated it as in Al-Firdaws, and Al-Iraqi weakened it as in Al-Ihya (2/149).",
    "book_id": "191",
    "new_page_number": 30
  },
  {
    "serial_number": "5003182",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 32,
    "volume_number": 1,
    "text": "22 - Al-Hakim narrated and authenticated from Abdullah bin al-Shikhkhir, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: (Minimize entering upon the rich; for it is more appropriate that you do not belittle Allah's blessing) (26).\n23 - Al-Hakim Al-Tirmidhi narrated in (Nawadir al-Usul) from Umar bin al-Khattab, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, came to me and I recognized sadness in his face. He held his beard and said: (We belong to Allah and to Him we shall return. Gabriel came to me just now and said to me: Indeed, your nation will be put to trial after you in a short time, not long. I said: And from where is that!? He said: From their reciters and their princes. The princes withhold people's rights and do not give them, and the reciters follow the whims of the princes. I said: O Gabriel! So by what will those among them who remain safe be safe? He said: By restraint and patience. If they are given what is theirs, they take it, and if they are denied it, they leave it) (27).",
    "foot_note": "1. (26) Very Weak Hadith. Narrated by Al-Hakim (4/312), Ibn Adi (5/1731) in Al-Kamil, and Al-Uqayli (3/327) in Al-Du'afa'. See: Al-Mizan (5987), Al-Lisan (4/762), Kashf al-Khafa (1/185), Al-Ihya (2/143), and Ithaf al-Sadah (6/134). \n27. Very Weak Hadith. Narrated by Ibn Abi Asim (303) in Al-Sunnah, and Ibn al-Jawzi (2/368) in Al-Ilal al-Mutanahiyah, from the path of Muhammad bin Humayr from Maslamah bin Ali from Umar bin Dharr from Abu Qilabah, from Abu Muslim al-Khawlani from Abu Ubaidah bin al-Jarrah from Umar with it. Al-Albani said: Its chain is very weak, its defect is Maslamah from Ali, who is Al-Khushani, abandoned (Matruk) as in Al-Taqrib. * Al-Hakim Al-Tirmidhi cited it in his Nawadir (p/210).",
    "book_id": "191",
    "new_page_number": 31
  },
  {
    "serial_number": "5003183",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 33,
    "volume_number": 1,
    "text": "Sultans of Fitnah (Tribulation)\n24 - Al-Hakim narrated from Abdullah bin al-Harith, may Allah be pleased with him: That he heard the Prophet, peace and blessings be upon him, saying: (There will be sultans after me, tribulations at their doors are like the resting places of camels. They do not give anyone anything, except that they take from his religion the like of it) (28).\n25 - Al-Daylami narrated from Abu al-A'war al-Sulami, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: (Beware of the doors of the Sultan).\nAnd Al-Hasan bin Sufyan in his Musnad and Al-Daylami narrated from Ibn Umar, may Allah be pleased with them both, who said: The Messenger of Allah, peace and blessings be upon him, said: (Fear the doors of the Sultan and their retinues; for the closest of people to them are the farthest of them from Allah. And whoever prefers a sultan over Allah, [Allah] places fitnah in his heart outwardly and inwardly, takes away piety from him, and leaves him bewildered) (29).",
    "foot_note": "1. (28) Very Weak Hadith. Narrated by Al-Hakim (3/633) from the path of Hassan bin Ghalib from Ibn Lahi'ah from Abu Zur'ah Amr bin Jarir from Abdullah bin al-Harith with it. Al-Haythami said (5/246) in Majma' al-Zawa'id: (Narrated by Al-Tabarani, and it contains Hassan Ibn Ghalib, and he is abandoned). I say: And in its chain is Ibn Lahi'ah, and he is among the weak. \n29. Weak Hadith. Narrated by Al-Daylami and Al-Hasan bin Sufyan as in Kanz al-Ummal (6/70). And from the path of Al-Hasan bin Sufyan, Abu Nu'aym (2/42) narrated it in Dhikr Akhbar Isbahan from the path of Ibrahim bin al-Hawrali from Al-Walid bin Muslim narrated to me Anbasah bin Abd al-Rahman al-Qurashi from Abdullah bin Abi al-Aswad al-Isbahani from Ibn Umar as Marfu' with it. In its chain is Anbasah al-Qurashi, who is one of the abandoned narrators, and Abu Hatim accused him of fabrication. See: Al-Mizan (3/301). * And Al-Khatib (1/341) narrated it in Talkhis al-Mutashabih from another path from Ahmad bin Sakin from his father from Nafi' from Ibn Umar with it. Al-Khatib said: Ibn Sakin is a sheikh among the unknown narrators.",
    "book_id": "191",
    "new_page_number": 32
  },
  {
    "serial_number": "5003184",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 34,
    "volume_number": 1,
    "text": "People Who Study Religion for the World\n26 - Ibn Asakir narrated from Ibn Abbas, may Allah be pleased with them both, who said: The Messenger of Allah, peace and blessings be upon him, said: (There will be a people after me from my nation who recite the Quran and study the religion deeply. Satan comes to them and says: If you came to the Sultan, he would improve your worldly life, and you would withdraw from them with your religion! And that will not be. Just as nothing is gathered from the Astragalus except thorns, likewise nothing is gathered from nearness to them except sins) (30).",
    "foot_note": "1. = ** It has a witness from the hadith of Ali as Mawquf (halted at companion), narrated by Al-Bukhari (1/2/268, 273) in Al-Tarikh al-Kabir, and from the saying of Hudhayfah, narrated by Ibn Abd al-Barr (1/167) in Jami' Bayan al-'Ilm wa Fadlihi, and from the saying of Ibn Mas'ud, narrated by Ibn Abd al-Barr (1/167). \n30. Weak Hadith. Weakened by Al-Albani (3313) in Da'if al-Jami', and Al-Suyuti in Al-Jami' al-Saghir (4778). Al-Qatad is a tree that has thorns. The wording \"Grapes are not gathered from thorns\" is authentic, narrated by Al-Bukhari (5/195).",
    "book_id": "191",
    "new_page_number": 33
  },
  {
    "serial_number": "5003185",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 35,
    "volume_number": 1,
    "text": "1 - Ruling on one who comes to the Sultan flattering.\n2 - Warning against sitting with the Sultan.\n3 - Blameworthy characteristics in students of knowledge.\n4 - Beware of the positions of Fitnah.\n5 - Wahb bin Munabbih's advice to 'Ata'.\n6 - Do not sit with an innovator.\n7 - Beware of whims and dispute.\n8 - Conditions of the Righteous Predecessors with the Princes.",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 34
  },
  {
    "serial_number": "5003186",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 37,
    "volume_number": 1,
    "text": "Ruling on One Who Comes to the Sultan Flattering\n27 - Hannad bin al-Sari narrated in (Al-Zuhd) from Ubayd bin Umayr, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: (No man increases in closeness to the Sultan except that he increases in distance from Allah) (1).\n28 - Al-Daylami narrated from Anas, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: (Whoever draws near to a possessor of authority by a cubit, Allah distances Himself from him by a fathom) (2).\n29 - Al-Daylami narrated from Abu al-Darda', who said: The Messenger of Allah, peace and blessings be upon him, said: (Whoever walks to an unjust sultan willingly, of his own accord, flattering him by meeting him and greeting him, wades into the Fire of Hell according to the measure of his steps, until he returns from him to his home. If he inclines to his desire, or strengthens his support, no curse from Allah befalls him [the Sultan] except that the like of it is upon him, and he is not punished in the Fire with a type of punishment except he is punished with the like of it) (3).\n30 - Abu al-Sheikh narrated from Ibn Umar, may Allah be pleased with them both, who said: The Messenger of Allah, peace and blessings be upon him, said:",
    "foot_note": "1. (1) Hasan Hadith. Its chain is Mursal. It is one of the categories of weak. Narrated by Hannad (597) in Al-Zuhd, and Abu Nu'aym (3/274) in Al-Hilyah via Hannad. Waki' (171) narrated it in Al-Zuhd via Sufyan from Layth from a man from Ubayd bin Umayr, and its chain is weak too. Al-Samarqandi (p/413) narrated it in Tanbih al-Ghafilin, also Mursal from Ubayd. * It has a witness from the hadith of Abu Hurairah, narrated by Ahmad (2/371, 440) and its chain is Hasan. See Al-Silsilah Al-Sahihah (3/267), and Al-Zuhd by Waki' (171). \n2. Weak Hadith. See: Ithaf (6/128, 139) by Al-Zabidi. \n3. Weak Hadith. See: Ithaf (6/126), Kanz al-Ummal (14954).",
    "book_id": "191",
    "new_page_number": 35
  },
  {
    "serial_number": "5003187",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 38,
    "volume_number": 1,
    "text": "(Whoever reads the Quran and studies the religion deeply, then comes to a ruler greedy for what is in his hands, Allah seals his heart, and he is tortured every day with two types of torture he was not tortured with before that) (4).\n31 - Al-Hakim narrated in his History from Mu'adh, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: (Whoever reads the Quran and studies the religion deeply, then comes to a ruler greedy for what is in his hands, wades into the Fire of Hell according to the measure of his steps) (5).\n32 - Al-Bayhaqi narrated from a man from Banu Sulaym, who said: The Messenger of Allah, peace and blessings be upon him, said: (Beware of the doors of the Sultan) (6).\nWarning Against Sitting with the Sultan\n33 - Al-Daylami narrated from Ali, who said: The Messenger of Allah, peace and blessings be upon him, said: (Beware of sitting with the Sultan; for it is the loss of religion. And beware of helping him, for you will not praise his affair) (7).\n34 - Ibn Abi Shaybah and Al-Tabarani narrated from Ibn Abbas, may Allah be pleased with them both, who said: The Messenger of Allah, peace and blessings be upon him, said: (Indeed, there will be princes whom you will recognize [some deeds of] and deny [others]. So whoever opposes them is saved, whoever withdraws from them is safe, or almost, and whoever mixes with them perishes) (8).",
    "foot_note": "1. (4) Weak Hadith. See: Ithaf (6/126), and Kanz (29068). \n5. Weak Hadith. See the previous. \n6. Authentic Hadith. Narrated by Al-Tabarani, and its men are the men of the Sahih, said Al-Haythami in Majma' al-Zawa'id (5/246). Al-Daylami (1/2/345) narrated it via Al-Tabarani, and Ibn Mandah in (Al-Ma'rifah) (2/62/2), and Ibn Asakir (13/132/1) from the hadith of Abu al-A'war al-Sulami as mentioned by Al-Albani (1253) in Al-Sahihah. See Ithaf al-Sadah (6/126). \n7. Weak Hadith. Abu Shuja' Al-Daylami (1536) cited it in Al-Firdaws. Its extraction as Mawquf has preceded, and that is what is correct, God willing. \n8. Its chain is weak. Authentic in meaning. Narrated by Al-Tabarani (10973) in Al-Kabir from the path of Al-Hayyaj bin Bistam from Layth from Tawus from Ibn Abbas as Marfu' with it. Al-Haythami said (5/228) in Majma' al-Zawa'id: It contains Hayyaj bin Bistam, and he is weak.",
    "book_id": "191",
    "new_page_number": 36
  },
  {
    "serial_number": "5003188",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 39,
    "volume_number": 1,
    "text": "35 - Al-Bayhaqi narrated from Ali bin Abi Talib, may Allah be pleased with him, who said: (Fear the doors of the Sultan). And in (Al-Firdaws) from the hadith of Ali, may Allah be pleased with him, as Marfu': (The best of the followers from my nation are those who do not approach the doors of sultans).\nAnd Al-Bayhaqi narrated from Ibn Mas'ud, may Allah be pleased with him, who said: (Indeed, at the doors of the Sultan are tribulations like the resting places of camels. You do not obtain anything from their world except that they take the like of it from your religion) (9).\n36 - Al-Darimi narrated in his Musnad from Ibn Mas'ud, may Allah be pleased with him, who said: (Whoever wants to honor his religion, let him not enter upon the Sultan, nor be alone with women, nor dispute with the people of desires) (10).\nThe One Entering Upon the Sultan is a Loser of His Religion\n37 - Al-Bukhari in his History and Ibn Sa'd in (Al-Tabaqat) narrated from Ibn Mas'ud, may Allah be pleased with him, who said: (A man enters upon the Sultan with his religion, and exits with nothing of it) (11).\n38 - Ibn Sa'd narrated in (Al-Tabaqat) from Salamah bin Nubayt who said: (I said to my father - and he had witnessed the Prophet, peace and blessings be upon him, seen him, and heard from him - O father, if you came to this Sultan and obtained from them, and your people obtained [benefit] through your side (influence)? He said: O my son, I fear to sit with them a sitting that would enter me into the Fire) (12).",
    "foot_note": "1. = I say: Muslim (1854) and Ahmad (6/295, 302) narrated it with similar meaning from the hadith of Umm Salamah, may Allah be pleased with her. \n9. Narrated by Ibn Abd al-Barr (p/260) in Jami' Bayan al-'Ilm wa Fadlihi, from the path of Ma'mar from Qatadah from Ibn Mas'ud as his saying, and it contains the 'an'anah of Qatadah, and he is a mudallis. \n10. Narrated by Al-Darimi (1/90) in his Sunan from the path of Sa'id bin al-Mughirah from Al-Walid bin Muslim from Muhammad bin Mutawwif and Abd al-Aziz bin Ismail from Ubayd Allah bin Abi al-Muhajir with it. It contains the 'an'anah of Al-Walid, and he is a mudallis. \n11. Narrated by Al-Bukhari (1/1/443) in Al-Tarikh al-Kabir, and Al-Samarqandi (p/413) cited it in Tanbih al-Ghafilin, and he has the addition: It was said: How is that? He said: He pleases him with what angers Allah. \n12. Narrated by Ibn Sa'd (6/30) from the path of Mu'ammal bin Ismail from Sufyan from Salamah Ibn Nubayt with it. And its chain is Hasan.",
    "book_id": "191",
    "new_page_number": 37
  },
  {
    "serial_number": "5003189",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 40,
    "volume_number": 1,
    "text": "Blameworthy Characteristics in Students of Knowledge\n39 - Al-Darimi narrated from Ibn Mas'ud, may Allah be pleased with him, who said: (Whoever seeks knowledge for four reasons enters the Fire: to boast with it before scholars, to argue with it against fools, or to turn people's faces towards him, or to take with it from the princes) (13).\n40 - Ibn Majah and Al-Bayhaqi narrated from Ibn Mas'ud, who said: If the people of knowledge preserved knowledge and placed it with its people, they would have led the people of their time with it. But they offered it to the people of the world to obtain from their world with it, so they became insignificant to them. I heard your Prophet, peace and blessings be upon him, say: (Whoever makes his concerns one concern, the concern of his Hereafter, Allah suffices him his concern of his worldly matters. And whoever lets his concerns branch out in the states of the world, Allah does not care in which of its valleys he perishes) (14).\n41 - Ibn Abi Shaybah narrated from Hudhayfah bin al-Yaman, may Allah be pleased with him, who said: (Beware! Let no man among you walk a span to a possessor of authority) (15).",
    "foot_note": "1. (13) Authentic Hadith. Narrated by Al-Darimi (1/103) from the path of Al-Qasim bin Salam from Abu Ismail al-Mu'addib from Asim al-Ahwal from whoever told him from Abu Wa'il with it. And there is a disruption (inqita') in it. Al-Darimi narrated it similarly (1/80) from the path of Ya'la from Muhammad bin Awn from Ibrahim bin Isa. \n14. Hasan Hadith. Narrated by Ibn Majah (257), (4106), Al-Hakim (2/443), (4/310), and Ibn Adi (6/2522) in Al-Kamil from the hadith of Ibn Mas'ud, Ibn Umar, and Ibn al-Munkadir as Mursal. With the sum of its paths, it is Hasan. \n15. Narrated by Ibn Abi Shaybah (19579) from the path of Al-Fadl bin Dukayn from Fitr from Abu Ishaq from Umarah bin Abd, and it contains the 'an'anah of Abu Ishaq. Also narrated by Abu Nu'aym (1/277) from the path of Ma'mar from Abu Ishaq.",
    "book_id": "191",
    "new_page_number": 38
  },
  {
    "serial_number": "5003190",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 41,
    "volume_number": 1,
    "text": "Beware of the Positions of Fitnah\n42 - Ibn Abi Shaybah and Abu Nu'aym in (Al-Hilyah) narrated from Hudhayfah, may Allah be pleased with him, who said: (Beware of the positions of Fitnah! It was said: And what are the positions of Fitnah? He said: The doors of the prince; a man enters upon the prince, believes him in lies, and says what is not in him [of praise]) (16).\n43 - Ibn Hisham (17) narrated from Abu Umamah al-Bahili, who said: The Prophet, peace and blessings be upon him, said: (The furthest of creation from Allah is a man who sits with princes, and whatever injustice they say, he believes them in it) (18).",
    "foot_note": "1. (16) Narrated by Abu Nu'aym (1/277) in Al-Hilyah, and Ibn Abd al-Barr (1/260) in Jami' Bayan al-'Ilm, from the path of Abd al-Razzaq from Ma'mar from Abu Ishaq from Umarah bin Abdullah from Hudhayfah with it. It contains the 'an'anah of Abu Ishaq, and he used to commit tadlis. * Al-Samarqandi (p/413) cited it in Tanbih al-Ghafilin, and Al-Sakhawi (p/97) in Takhrij Ahadith al-Adilin. \n17. Thus in the original, and in the references it is Ibn Asakir, and Allah knows best. \n18. Weak Hadith. Narrated by Ibn Asakir as in Kanz al-Ummal (43761), and Ithaf al-Sadah (6/127). See (Introduction to Al-Jami' al-Saghir by the author). * Abu Shuja' Al-Daylami cited it in Al-Firdaws (1456) from the hadith of Anas, may Allah be pleased with him.",
    "book_id": "191",
    "new_page_number": 39
  },
  {
    "serial_number": "5003191",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 42,
    "volume_number": 1,
    "text": "Wahb bin Munabbih's Advice to 'Ata'\n44 - Al-Bayhaqi narrated from Wahb bin Munabbih, that he said to 'Ata': (Beware of the doors of the Sultan! For at the doors of the Sultan are tribulations like the resting places of camels. You do not obtain anything from their world except that they take the like of it from your religion).\n45 - Ibn Abi Shaybah and Al-Bayhaqi narrated from Salamah bin Qays, who said: I met Abu Dharr, and he said: (O Salamah bin Qays, three things, memorize them: Do not combine between co-wives, for you will never be just even if you strive; do not work on charity (Zakat collection), for the owner of charity gives more or less; and do not frequent a possessor of authority, for you do not obtain anything from their world except that they take from your religion better than it) (20).\n46 - Al-Bayhaqi narrated from Ayyub al-Sakhtiyani who said: Abu Qilabah said: (Memorize from me three traits: Beware of the doors of the Sultan, beware of sitting with the people of desires, and stick to your market for wealth comes from well-being) (21).",
    "foot_note": "1. (19) Its chain is weak. Narrated by Abu Nu'aym (4/39) from the path of Amr bin Ayyub from Al-Hasan bin Hammad narrated to us Abu Usama from Isa bin Sinan who said: I heard Wahb... so he mentioned it. In its chain is Isa bin Sinan, who is soft in hadith, and the 'an'anah of Abu Usama. \n20. Narrated by Ibn Abi Shaybah (19578) from Ya'la bin Ubayd from Musa al-Juhani from Qays bin Yazid who said: My freedwoman Sidra told me that my grandfather Salamah bin Qays told me. So he mentioned it, and it contains someone I did not find. \n21. Authentic Hadith. Narrated by Ibn Abd al-Barr (p/257) in Jami' Bayan al-'Ilm, from the path of Abdullah bin Muhammad bin Hani' from Al-Hakam bin Sinan from Ayyub with it. * And Abu Nu'aym narrated it briefly (2/286) in Al-Hilyah from the path of Al-Harith bin Abi Usama from Sa'id bin Amir from Salih bin Rustam who said: Abu Qilabah said. So he mentioned it. ** And Abu Nu'aym narrated it (2/287) in Al-Hilyah briefly, from the path of Bishr bin Musa who said: Narrated to us Sulayman bin Harb from Hammad bin Yazid from Ayyub: who said: Abu Qilabah said with it. From this path Al-Darimi narrated it (1/108) in his Sunan briefly.",
    "book_id": "191",
    "new_page_number": 40
  },
  {
    "serial_number": "5003192",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Pillars Narrated about Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 43,
    "volume_number": 1,
    "text": "Do Not Sit with an Innovator\n47 - Al-Bayhaqi narrated via Hammad bin Salamah from Yunus bin Ubayd who said: (Do not sit with a person of innovation, nor a person of authority (Sultan), nor be alone with a woman) (22).\n48 - Al-Bayhaqi narrated from Al-Fadl bin Abbas - may Allah be pleased with him - who said: We used to learn to avoid the Sultan just as we learned a Surah from the Quran.\n49 - Al-Bayhaqi narrated from Yusuf bin Asbat who said: Sufyan al-Thawri said to me: (If you see a reciter seeking refuge with the Sultan, know that he is a thief. And if you see him seeking refuge with the rich, know that he is a show-off. And beware lest you be deceived and told: You will return a grievance or defend an oppressed person; for this is the deception of Iblis which he has taken as a ladder for the reciters) (23).\n50 - Al-Bayhaqi narrated from Abu Shihab who said: I heard Sufyan al-Thawri saying to a man: (If they invite you to recite 'Say, He is Allah, [who is] One' to them, do not go to them) (24). It was said to Abu Shihab: Who do you mean? He said: The Sultan (25).",
    "foot_note": "1. (22) Authentic Hadith. Narrated by Abu Nu'aym (3/21) from the path of Abdullah bin Ahmad from Ibrahim bin al-Hasan al-Bahili from Hammad bin Zayd with it. Al-Dhahabi cited it (6/293) in Al-Siyar, and Ibn al-Jawzi (3/307) in Sifat al-Safwah. \n23. Narrated by Abu Nu'aym (6/387) in Al-Hilyah, from the path of Al-Karabisi from Abu Salih from Yusuf bin Asbat with it. \n24. Narrated by Abu Nu'aym (6/387) from the path of Salamah from Ahmad bin Yunus from Abu Shihab Abd Rabbih. \n25. Narrated at length by Abu Nu'aym (6/376) in Al-Hilyah.",
    "book_id": "191",
    "new_page_number": 41
  },
  {
    "serial_number": "5003193",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 44,
    "volume_number": 1,
    "text": "51 - And it was narrated from Anas - may Allah be pleased with him - that he said: I met ten-some men from the Tabi'in who were saying: (Do not come to them, and do not command them, meaning the Sultan).\n\nBeware of Desires and Disputes\n52 - Al-Bayhaqi narrated from Ahmad bin Ubaid Allah who said: I heard a man asking Al-Shura: Advise me? He said: (Beware of desires, and beware of the Sultan) (26).\n53 - Al-Bayhaqi narrated from Bakr bin Muhammad Al-Abid: I heard Sufyan Al-Thawri [say]: (There is a valley in Hell from which Hell seeks refuge seventy times every day; Allah prepared it for the [Quran] readers who visit the Sultan) (27).\n54 - Abu Nu'aym narrated in Al-Hilyah via Hisham bin Abbad who said: I heard Ja'far bin Muhammad say: (The jurists are the trustees of the Messengers, so if you see the jurists leaning towards the Sultan, then accuse them) (28).",
    "foot_note": "1. (26) Narrated by Abu Nu'aym (7/28).\n27. Narrated by Ibn Abd al-Barr (p. 257) via Ali bin Abi Salim from Bakr bin Muhammad with it.\n28. Narrated by Abu Nu'aym (3/194) in Al-Hilyah via Ahmad bin Badil from Umar Al-Yami from Hisham bin Abbad with it. * Al-Sakhawi said in Takhrij Ahadith Al-Adilin (p. 99): A raised (Marfu') hadith has been narrated regarding this, narrated by Al-Hakim in some of his works, and via him Al-Dailami in his Musnad. ** And Ibn Abi Hatim said (2/137-138) in Al-Ilal: A Munkar (denounced) hadith.",
    "book_id": "191",
    "new_page_number": 42
  },
  {
    "serial_number": "5003194",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 45,
    "volume_number": 1,
    "text": "55 - Ibn Al-Najjar narrated in his History via Ibn Duraid from Jabir bin Hayyan that it was said to him: Why do you not go to the Sultan? He said: I am sufficed by that which I left for them (29).\n56 - Al-Khatib Al-Baghdadi narrated in his History via Ibn Duraid from Abu Hatim from Al-Qa'nabi from his father who said: Isa bin Musa - who was then the Governor of Kufa - said to Ibn Shubruma: Why do you not come to us? He said: May Allah reform you, if I come to you and you bring me close, you tempt me; and if you push me away, you harm me. I have nothing to fear for, and you have nothing I hope for. So he [the Governor] did not reply to him at all (30).\n57 - Al-Rafi'i narrated in the History of Qazvin from Abdullah bin Al-Suddi who said: Abu Bakr bin Ayyash wrote to Abdullah bin Al-Mubarak: If Al-Fadl bin Musa Al-Shaibani does not mix with the Sultan, then convey my greetings to him.\n58 - (Section) The majority of scholars from the Salaf and the righteous of the Khalaf held that these hadiths and traditions apply generally, whether they [the rulers] invited them to come or not, and whether they invited them for a religious interest or otherwise (31).",
    "foot_note": "1. (29) It contains Ibn Duraid, and Al-Daraqutni said: He has been criticized. See: Lisan Al-Mizan (5/132-133).\n30. Mentioned by Al-Samarqandi (p. 416) in Tanbih Al-Ghafilin.\n31. Ibn Abd al-Barr says: The meaning of this entire chapter concerns the unjust, corrupt Sultan. As for the just and virtuous among them, mixing with them, seeing them, and helping them towards righteousness is among the best acts of piety. Do you not see that Umar bin Abd al-Aziz was accompanied by great scholars like Urwa bin Al-Zubayr and his peer group, and Ibn Shihab and his peer group? If a scholar attends the Sultan's presence, speaks good, and speaks with knowledge, it is good, and in that is the pleasure of Allah until the day he meets Him. However, gatherings of fitnah (temptation/trial) are usually dominant therein, and safety lies in leaving what is therein. See: Jami' Bayan Al-Ilm (p. 262-263).",
    "book_id": "191",
    "new_page_number": 43
  },
  {
    "serial_number": "5003195",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 46,
    "volume_number": 1,
    "text": "59 - Sufyan Al-Thawri said: (If they invite you to recite to them: 'Say, He is Allah, [who is] One', do not go to them) (32). Narrated by Al-Bayhaqi, as previously mentioned.\n\nConditions of the Righteous Salaf with the Princes\n60 - Abu Nu'aym narrated in Al-Hilyah from Maymun bin Mihran: That Abdullah bin Abd al-Malik bin Marwan arrived in Medina, so he sent his chamberlain to Saeed bin al-Musayyib and said to him: Answer the Commander of the Faithful! He said: What is his need? He said: To talk with him. He said: I am not one of his storytellers. The chamberlain returned to him and informed him. He [the Prince] said: Leave him (33).\n61 - Al-Bukhari said in his History: (I heard Adam bin Abi Iyas say: I witnessed Hammad bin Salamah when the Sultan invited him. He said: Go to those people? No, by Allah, I will not do it) (34).\n62 - Al-Khatib said, regarding Hammad bin Salamah: That one of the Caliphs sent a messenger to him saying: An issue has arisen, so come to us so we may ask you. He said to the messenger: Say to him: (We met people who did not go to anyone because of the Hadith that reached them. If you have a question, write it on a piece of paper and we will write the answer for you).",
    "foot_note": "1. (32) Its referencing preceded.\n33. Authentic Hadith. Narrated by Ibn Sa'd (5/130) in Al-Tabaqat Al-Kubra, Abu Nu'aym (2/169) in Al-Hilyah, and mentioned by Al-Dhahabi (34/226) in Al-Siyar, all of them via Kathir bin Hisham from Ja'far bin Burqan from Maymun with it. Ibn Sa'd said: And Abdullah bin Ja'far informed us, Abu Al-Malih told us from Maymun with it.\n34. Authentic Hadith. Narrated by Abu Nu'aym (6/251) in Al-Hilyah via Al-Bukhari from Adam bin Abi Iyas with it.",
    "book_id": "191",
    "new_page_number": 44
  },
  {
    "serial_number": "5003196",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 47,
    "volume_number": 1,
    "text": "63 - Abu Al-Hasan bin Fahr narrated in the book (Virtues of Malik), from Abdullah bin Rafi' and others who said: Harun Al-Rashid came to Medina, so he directed Al-Barmaki to Malik, and said to him: Bring me the book you have authored so that I may hear it from you. He [Malik] said to Al-Barmaki: (Convey my greetings to him and tell him: Knowledge is visited and does not visit). Al-Barmaki returned to Harun Al-Rashid and said to him: O Commander of the Faithful! Will it reach the people of Iraq that you sent for Malik regarding a matter and he opposed you! Be firm with him so that he comes to you. So he sent for him. He [Malik] said: Tell him, O Commander of the Faithful, do not be the first to demean knowledge, lest Allah causes you to be lost.\n64 - Ammar said in his History from Ibn Munir: That the Sultan of Bukhara sent for Muhammad bin Ismail Al-Bukhari saying: Bring me the book (Al-Jami') and (Al-Tarikh) so I may hear from you. Al-Bukhari said to his messenger: (Tell him I do not humiliate knowledge, nor do I come to the doors of Sultans. If you have a need for something from it, then attend to me in my mosque or in my house) (35).\n65 - Na'im bin Al-Haitham said in his famous Juz': (Khalaf bin Tamim informed us from Abu Hammam Al-Kala'i, from Al-Hasan that he passed by some [Quran] readers at some doors of the Sultans, and he said: You have ulcerated your foreheads, and flattened your sandals, and you came with knowledge carrying it on your necks to their doors?! By Allah! Had you sat in your homes, it would have been better for you. Disperse, may Allah separate your limbs) (36).",
    "foot_note": "1. (35) Narrated by Al-Khatib (2/33) in his History, Al-Mizzi in Tahdhib Al-Kamal (338), mentioned by Al-Subki (2/232-233) in his Tabaqat, Al-Dhahabi (12/464) in Al-Siyar, and see: Introduction to Fath Al-Bari (p. 494).\n36. Narrated by Abu Nu'aym (2/150-151) in Al-Hilyah via Ahmad bin Ziyada from 'Ismah bin Sulaiman Al-Harrani from Fudayl bin Ja'far from Al-Hasan with it. * Mentioned by Ibn Al-Jawzi (3/236) in Sifat Al-Safwa. In the margin of the copy: Hama'imukum: Place of prostration (foreheads), and Fartahtum: Widened/Flattened.",
    "book_id": "191",
    "new_page_number": 45
  },
  {
    "serial_number": "5003197",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 48,
    "volume_number": 1,
    "text": "66 - Al-Zajjaj said in his Amali: (Abu Bakr Muhammad bin Al-Hasan informed us, Abdul Rahman the nephew of Al-Asma'i informed me, from his uncle who said: Al-Hasan Al-Basri passed by the door of Umar bin Hubayra and the [Quran] readers were there, so he greeted them, then said: (Why are you sitting? You have trimmed your mustaches, shaved your heads, shortened your sleeves, and flattened your sandals! By Allah! Had you abstained from what they have, they would have desired what you have, but you desired what they have, so they abstained from what you have. You have disgraced the readers, may Allah disgrace you).\n67 - Ibn Al-Najjar narrated from Al-Hasan that he said: (If it pleases you that you remain safe and your religion remains safe for you, then restrain your hands from the blood of Muslims, restrain your stomachs from their wealth, restrain your tongues from their honor, do not sit with the people of innovation, and do not go to kings lest they confuse your religion for you).\n\nThe Scholars are Three\n68 - Abu Nu'aym narrated in Al-Hilyah from Wuhaib bin Al-Ward who said: (It has reached us that scholars are three: A scholar who learns it for the Sultans, a scholar who learns it to traffic it with the merchants, and a scholar who learns it for himself, desiring nothing by it except that he fears acting without knowledge; so those who corrupt are more than those who rectify) (37).\n69 - Abu Nu'aym narrated from Abu Salih Al-Antaki, who said: I heard Ibn Al-Mubarak say: (Whoever is stingy with knowledge is afflicted with three things: Either death so his knowledge goes away, or he forgets, or he sticks to the Sultan and his knowledge goes away).",
    "foot_note": "1. (37) Narrated by Abu Nu'aym (8/156) in Al-Hilyah, via Ahmad Al-Dawraqi from Muhammad bin Yazid bin Khunais from Wuhaib with it.",
    "book_id": "191",
    "new_page_number": 46
  },
  {
    "serial_number": "5003198",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 49,
    "volume_number": 1,
    "text": "70 - Al-Khatib Al-Baghdadi said in a book narrated by Malik: (Judge Abu Al-Qasim Al-Hasan bin Muhammad bin Al-Anbari wrote to me from Egypt, Muhammad bin Ahmad bin Al-Musawwar informed us, Al-Miqdam bin Dawud Al-Ru'ayni told us, Ali bin Ma'bad told us, Ishaq bin Yahya told us, from Malik bin Anas, may Allah have mercy on him, who said: (I met ten-some men from the Tabi'in saying: Do not come to them, and do not command them, meaning the Sultan).\n71 - Ibn Bakuwayh Al-Shirazi said in (News of the Sufis): (Salamah bin Ahmad Al-Takrini told us, Ya'qub bin Ishaq informed us, Ubaid Allah bin Muhammad Al-Qurashi told us, saying: We were with Sufyan Al-Thawri in Mecca, and a letter came to him from his family in Kufa: Need has reached us such that we fry date pits and eat them. Sufyan wept. Some of his companions said to him: O Abu Abdullah! If you went to the Sultan, you would attain what you want! Sufyan said: (By Allah, I do not ask for the world from He who owns it, so how can I ask for it from he who does not own it).\n72 - Abdul Wahid told us, Ahmad bin Muhammad bin Hamdun told us, Abu Isa Al-Anbari told us, Fath bin Shakhraf told us, Abdullah bin Hussein told us, from Sufyan Al-Thawri: That he used to say: (Be mighty against the sons of the world by refraining from greeting them).\n73 - Abdullah bin Muhammad bin Ja'far told us, Ibn Hassan told us, Ahmad bin Abi Al-Hawari told us, saying: I said to Abu Sulayman: Do you contradict the scholars? He became angry and said: (Have you seen a scholar come to the Sultan's door and take their dirhams?).\n74 - I heard Abdul Wahid bin Bakr say: I heard Muhammad bin Dawud Al-Dinawari say: I heard Ahmad bin Al-Salt say: (A man came to Bishr bin Al-Harith and said to him: O my master! The Sultan is seeking the righteous, do you think I should hide? Bishr said to him: (Pass from in front of me; a donkey does not pass through thorns without throwing you upon us).",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 47
  },
  {
    "serial_number": "5003199",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 50,
    "volume_number": 1,
    "text": "75 - Abu Al-Ala informed us, I heard Ahmad bin Muhammad Al-Tustari, I heard Ziyad bin Ali Al-Dimashqi say: I heard Salih bin Khalifa Al-Kufi say: I heard Sufyan Al-Thawri say: (The wicked among the readers [of Quran] took a ladder to the world saying: We enter upon the princes to relieve the distressed and speak regarding the imprisoned).",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 48
  },
  {
    "serial_number": "5003200",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 51,
    "volume_number": 1,
    "text": "1 - The virtue of the people of knowledge undertaking its preservation.\n2 - Abu Hazim the Ascetic and the princes of Banu Umayya.\n3 - Hammad bin Salamah and the Emir of Iraq.\n4 - The conditions of mixing with Sultans.\n5 - Sufyan Al-Thawri admonishing Abu Ja'far Al-Mansur.\n6 - What a scholar should adorn himself with.\n7 - The rarest things at the end of time.\n8 - The words of poets regarding coming to Sultans.",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 49
  },
  {
    "serial_number": "5003201",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 53,
    "volume_number": 1,
    "text": "The Virtue of the People of Knowledge Undertaking its Preservation\n76 - Abu Ali Al-Amidi said in his commentary: (Abu Muhammad Ja'far bin Mus'ab Ibn Al-Zubayr told me, from his grandfather Al-Zubayr bin Bakkar, who said: Abu Al-Mukarram Uqbah bin Mukarram bin Uqbah Al-Dabbi told me, from Buraid bin Kumait, from Ammar bin Saif, that he heard Sufyan Al-Thawri say: (Looking at the Sultan is a sin) (1).\n77 - Ibn Bakuwayh narrated from Al-Fudayl bin Iyad, who said: (If the people of knowledge honored themselves, were protective of their religion, dignified knowledge and preserved it, and placed it where Allah placed it, the necks of tyrants would have submitted to them, people would have followed them, and they would have busied themselves with what concerns them, and Islam and its people would be mighty. But they humiliated themselves and did not care about what diminished from their religion as long as their worldly life was safe for them, and they spent their knowledge for the sons of the world to obtain what is in their hands, so they became humiliated and insignificant to the people) (2).\n78 - Al-Amidi said: Abu Al-Abbas told me, saying: I heard: Tahir bin Abdullah bin Tahir came from Khurasan during his father's life intending Hajj. He stayed in the house of Ishaq bin Ibrahim. Ishaq sent for the scholars, summoning them so Tahir could see them and read to them. The scholars of Hadith and Fiqh attended, and Ibn Al-A'rabi and Abu Nasr the companion of Al-Asma'i were brought. He sent for Abu Ubaid Al-Qasim bin Salam to attend, but he refused to attend and said: Knowledge is sought [it does not seek]. Ishaq became angry at his words and message. Abdullah bin Tahir had allocated him two thousand dirhams a month, so Ishaq did not send it to him and cut off the stipend. He wrote to Abdullah informing him. He [Abdullah] wrote back to him: Abu Ubaid spoke the truth in his statement, and I have doubled the stipend for him because of his action, so give it to him, come to him, and restore to him what he deserves thereafter (3).",
    "foot_note": "1. (1) Narrated by Abu Nu'aym (7/46) in Al-Hilyah.\n2. Narrated by Abu Nu'aym (8/92) with his chain from Al-Fudayl saying: If our scholars had patience, they would not have gone to the doors of these people, meaning the kings, which has the same meaning as the former.\n3. Mentioned textually by Yaqut Al-Hamawi (6/260-261) in Mu'jam Al-Udaba.",
    "book_id": "191",
    "new_page_number": 50
  },
  {
    "serial_number": "5003202",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 54,
    "volume_number": 1,
    "text": "Abu Hazim the Ascetic and the Princes of Banu Umayya\n79 - Ibn Asakir narrated via Ibn Wahb, from Abd al-Rahman bin Yazid, who said: Abu Hazim told us that Sulayman bin Hisham bin Abd al-Malik came to Medina and sent for Abu Hazim. He entered upon him and said: So I greeted him while leaning on my staff. It was said: Will you not speak!? I said: And what should I speak about!? I have no need to speak about, I only came for your need for which you sent to me. Not everyone who sends for me do I come to, and were it not for fear of your evil, I would not have come to you. I lived in a time when the people of the world followed the people of knowledge wherever they were; the people of knowledge fulfilled the worldly and spiritual needs of the people of the world, and the people of the world could not do without the people of knowledge for their share of knowledge. Then the times changed, and the people of knowledge became followers of the people of the world wherever they were, so calamity entered upon both parties. The people of the world abandoned the share of knowledge they used to hold onto when they saw the people of knowledge coming to them, and the people of knowledge wasted the great portion allotted to them by following the people of the world) (4).\n80 - Ibn Abi Al-Dunya, Al-Khara'iti, and Ibn Asakir narrated from Zam'ah bin Salih, who said: One of the Banu Umayya wrote to Abu Hazim to submit his needs to him. He wrote back to him: (To proceed, your letter came to me with the resolve that I raise my needs to you. Far from it! I raised my needs to my Master; what He gave me of them, I accepted, and what He withheld from me, I was satisfied with) (5).\n81 - Ibn Asakir narrated from Abdul Jabbar bin Abdul Aziz Abu Hazim from his father, from his grandfather:",
    "foot_note": "1. (4) Narrated at length by Abu Nu'aym (3/234-235) in Al-Hilyah, and mentioned by Ibn Al-Jawzi (2/158-159) in Safwat Al-Safwa, and Al-Ghazali (2/145) in Al-Ihya.\n5. Authentic Hadith. Narrated by Abu Nu'aym (3/237) via Ahmad bin Hanbal from Yahya bin Abd al-Rahman from Zam'ah, and via Ahmad bin Muhammad bin Saeed from Ahmad bin Ubaidah from Sufyan bin Uyaynah with it.",
    "book_id": "191",
    "new_page_number": 51
  },
  {
    "serial_number": "5003203",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 55,
    "volume_number": 1,
    "text": "That Sulayman bin Abd al-Malik entered Medina and stayed there for three days. He said: Is there a man here who met the companions of Muhammad, peace be upon him, who can narrate to us? It was said to him: Yes, there is a man here called Abu Hazim. So he sent for him, and he came. Sulayman said to him: O Abu Hazim! What is this aversion? The notables of Medina all came to me, but you did not come to me!? Abu Hazim said: When people were on the right path, the princes needed the scholars, and the scholars fled with their religion from the princes. When a group of lowly people saw that, they learned knowledge and brought it to the princes, so they [the princes] dispensed with the scholars [using these people]. The people united on disobedience, so they fell, or perished, or became ascetic. If these scholars of ours had preserved their knowledge, the princes would have continued to fear them) (6).\n82 - Al-Bayhaqi and Ibn Asakir narrated from Zam'ah bin Salih who said: Al-Zuhri said to Sulayman or Hisham: Will you not ask Abu Hazim what he said about the scholars? He said: O Abu Hazim, what did you say about the scholars? He said: (And what can I say about the scholars except good? I met scholars who were satisfied with their work [independent] of the people of the world, and the people of the world were not independent with their worldly goods from their knowledge. When this one and his companions saw that, they learned knowledge but were not satisfied with it [alone], while the people of the world were satisfied with their worldly goods without their knowledge. When they saw that, they cast their knowledge to the people of the world, but the people of the world did not give them anything of their world. This one and his companions are not scholars; they are merely narrators) (7).\n83 - Abu Nu'aym and Ibn Asakir narrated from Yusuf bin Asbat who said: Najm informed us: That some princes sent for Abu Hazim, so he came to him, and Al-Ifriqi, Al-Zuhri and others were present. He said to him: Speak, O Abu Hazim. Abu Hazim said: (The best of princes are those who love scholars, and the worst of scholars are those who love princes. In the past, if princes sent for scholars, they would not come to them, and if they asked them, they would not grant them concessions. The princes used to come to the scholars in their houses and ask them, and in that was righteousness for the princes and righteousness for the scholars. When some people saw that, they said: Why do we not seek knowledge so we can be like these? So they sought knowledge and came to the princes and narrated to them and granted them concessions, so the scholars ruined it for the princes, and the princes ruined it for the scholars (8).",
    "foot_note": "1. (6) Its referencing preceded.\n7. Narrated by Abu Nu'aym (3/233) via Yahya bin Abd al-Malik from Zam'ah bin Salih from Al-Zuhri, and Zam'ah bin Salih is weak.\n8. Narrated by Abu Nu'aym (3/245) via Sahl bin Shabib from Sahl bin Asim from Faraj bin Saeed Al-Sufi from Ibn Asbat with it. =",
    "book_id": "191",
    "new_page_number": 52
  },
  {
    "serial_number": "5003204",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 56,
    "volume_number": 1,
    "text": "84 - Al-Bayhaqi narrated in (Al-Zuhd), and Ibn Asakir, from Sufyan: He said: Some princes said to Abu Hazim: Raise your needs to me. He said: Far from it! Far from it! I raised them to One who does not store needs away from Him. What He gave me of them, I was content with, and what He withheld from me, I was satisfied with. Scholars in the past used to be sought by the Sultan while they fled from him, but the scholars today sought knowledge until they gathered it completely, then brought it to the doors of the Sultans, while the Sultans flee from them, and they [the scholars] seek them) (9).\n85 - Ibn Asakir narrated from Muhammad bin Ajlan Al-Madani, who said: Sulayman bin Hisham sent to Abu Hazim, and said to him: Speak! He said: (I have no need to speak about, and were it not for guarding against your evil, I would not have come to you. A time passed upon us when princes sought scholars to take from what they had and benefit from it, so in that was righteousness for both parties. Today, scholars sought princes and leaned towards them and desired what was in their hands, so the princes said these people did not seek what is in our hands unless what is in our hands is better than what is in their hands, so in that was corruption for both parties). Sulayman bin Hisham said: You spoke the truth (10).\n86 - Ibn Asakir narrated via Abu Qilabah Abd al-Malik bin Muhammad Al-Raqashi who said: Abu Saeed Al-Asma'i told us, from Abu Al-Zinad, from his father, who said: (All the jurists in Medina used to come to Umar bin Abd al-Aziz, except Saeed bin al-Musayyib; for Umar was content that there be a messenger between them, and I was the messenger between them (11).",
    "foot_note": "1. = And in its chain is Sahl bin Asim, Abu Hatim said: A Sheikh [meaning unknown/not strong]. See: Al-Jarh wa Al-Ta'dil (4/202).\n9. Narrated by Abu Nu'aym (3/237) in Al-Hilyah abbreviated.\n10. Its referencing preceded with similar meaning.\n11. Narrated by Ibn Sa'd (5/122) in his Tabaqat, and mentioned by Al-Dhahabi (4/225) in Al-Siyar.",
    "book_id": "191",
    "new_page_number": 53
  },
  {
    "serial_number": "5003205",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 57,
    "volume_number": 1,
    "text": "87 - Ibn Asakir narrated from Al-Awza'i, who said: Ata Al-Khurasani came to Hisham bin Abd al-Malik and stayed with Makhul. Ata said to Makhul: Is there anyone here to move us? - meaning to admonish us. He said: (Yes, Yazid bin Maisarah). So they came to him. Ata said to him: Move us, may Allah have mercy on you. He said: Yes, scholars used to be such that when they knew, they acted; when they acted, they became occupied; when they became occupied, they were missed; when they were missed, they were sought; when they were sought, they fled. He said: Repeat it to me. So he repeated it to him. He returned and did not meet Hisham (12).\n\nHammad bin Salamah and the Emir of Iraq\n88 - Al-Khatib and Ibn Asakir narrated from Muqatil bin Salih Al-Khurasani who said: I entered upon Hammad bin Salamah. While I was sitting with him, someone knocked on the door. He said: (O young girl, go out and see who this is!). She said: This is the messenger of Muhammad bin Sulayman Al-Hashimi - who was the Emir of Basra and Kufa. He said: Tell him to enter alone. He entered and greeted him and handed him his letter. He said: Read it. In it was: (In the name of Allah, the Most Gracious, the Most Merciful. From Sulayman to Hammad bin Salamah. To proceed: May Allah grant you a morning like that of His allies and the people of His obedience. An issue has arisen, so we came to ask you about it). He said: (O young girl, bring the inkwell!). Then he said to me: (Turn over the letter and write: To proceed, may Allah grant you a morning like that of His allies and the people of His obedience. We met scholars who did not go to anyone; if an issue arises, come to us and ask us about whatever appears to you! If you come to me, do not come except alone, and do not come with your cavalry and infantry, for I do not advise you nor advise myself [otherwise], peace). While I was with him, someone knocked on the door. He said: (O young girl, go out and see who this is!). She said: (This is Muhammad bin Sulayman). He said: (Tell him to enter alone). He entered, greeted him, then sat before him, then began saying: Why is it that when I look at you I am filled with terror!? Hammad said: (I heard Thabit Al-Bunani say: I heard Anas bin Malik say: I heard the Messenger of Allah, peace be upon him, say:",
    "foot_note": "1. (12) Narrated by Abu Nu'aym (5/234) in Al-Hilyah, containing the 'an'ana of Al-Walid bin Muslim, who is a mudallis (obfuscator).",
    "book_id": "191",
    "new_page_number": 54
  },
  {
    "serial_number": "5003206",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 58,
    "volume_number": 1,
    "text": "(If a scholar seeks the Face of Allah with his knowledge, everything fears him; and if he seeks to amass treasures with it, he fears everything) (13). And he mentioned the rest of the story.\n89 - [[Ibn Al-Najjar narrated in his History from Muflih bin Al-Aswad, who said: Al-Ma'mun said to Yahya bin Aktham: I desire to see Bishr bin Al-Harith. He said: If you desire, O Commander of the Faithful, then tonight, and let no human be with us. So they rode, and Yahya knocked on the door. Bishr said: Who is this? He said: He whom you are obliged to obey. He said: And what do you want? He said: I love to meet you. Bishr said: Willingly or forced? He said: Al-Ma'mun understood, so he said to Yahya: Ride. They passed by a man establishing prayer, the Isha prayer, so they entered to pray. The Imam had a beautiful recitation. When morning came, Al-Ma'mun sent for him, brought him, and began debating with him in Fiqh. The man disagreed with him, saying: The saying in this issue is contrary to this. Al-Ma'mun became angry. When his disagreement increased, he said: (My knowledge of you is as if you go to your companions and say: I proved the Commander of the Faithful wrong. He said: By Allah, O Commander of the Faithful, I am shy that my companions know I came to you! Al-Ma'mun said: Praise be to Allah who placed in my subjects one who is shy to come to me, then he prostrated to Allah in thanks. The man was Ibrahim bin Ishaq Al-Harbi. (Ibn Al-Najjar narrated in his History from Sufyan Al-Thawri who said: (Knowledge remained mighty until it was carried to the doors of kings who took a wage for it, so Allah removed the sweetness from their hearts and prevented them from [benefiting from] knowledge of it). Al-Bayhaqi narrated in (Shu'ab Al-Iman) from Bishr Al-Hafi who said: (How ugly it is for a scholar to be sought, and it is said: He is at the Emir's door). He also narrated from Al-Fudayl bin Iyad, who said: The bane of readers is vanity. Beware the doors of kings for they remove blessings. It was said: How? He said: A man has a blessing from Allah and has no need of creation, but when he enters upon these people and sees what is spread for them of houses and servants, he belittles the good he is in, then the blessing is removed).]] (*)\n\nConditions of Mixing with Sultans\n90 - Al-Ghazali dedicated a chapter in (Al-Ihya) to mixing with Sultans, and the ruling of frequenting their gatherings and entering upon them. He said therein: (Know that you have three conditions with unjust princes and officials: The first condition: And it is the worst of them, that you enter upon them. The second: It is below that, that they enter upon you. The third: - And it is the safest -: That you isolate yourself from them, neither seeing them nor them seeing you. As for the first condition: Entering upon them, it is extremely condemned in the Sharia, and there are severe warnings and strictures about it in reports and traditions. We convey them so you know the Sharia's condemnation of it. Then we address what is forbidden, permitted, and disliked, according to what the fatwa requires in apparent knowledge). Then he listed many of the hadiths and traditions previously mentioned (14). And among what he cited which was not mentioned before:\n91 - (Sufyan said: In Hell there is a valley inhabited only by readers who visit kings).\n92 - Al-Awza'i said: (There is nothing more hateful to Allah than a scholar who visits an official). Ishaq said: (How ugly for a scholar to be sought at his gathering and not found, and when asked about, it is said: He is with the Emir. I used to hear it said: If you see a scholar visiting the Sultan, accuse him regarding your religion. I never entered upon this one except that I held myself accountable after leaving, blaming it for the consequence despite the harshness and opposition to their desires I confronted them with). Saeed bin al-Musayyib used to trade in oil and say: (In this is independence from these Sultans).",
    "foot_note": "1. (13) Weak Hadith. Narrated by Ibn Al-Najjar as in Al-Kanz (46131). Al-Iraqi said: This is Mu'dal (problematic/disconnected). Abu Al-Sheikh Ibn Hayyan narrated in Kitab Al-Thawab from the hadith of Wathila bin Al-Asqa': \"Whoever fears Allah, Allah makes everything fear him, and whoever does not fear Allah, Allah makes him fear everything.\" Al-Uqayli has similar in Al-Du'afa from the hadith of Abu Huraira, and both are Munkar. See discussion on the hadith in: Ithaf Al-Sadah (6/136), Tadhkirat Al-Mawdu'at (20), and Al-Fawa'id Al-Majmu'ah (286).\n14. Al-Ihya (2/140-141). (*) The preparer of the book for Shamela said: What is between brackets appeared in the printed version like this: [Ibn Al-Najjar narrated in his History from Muflih bin Al-Aswad, who said: Al-Ma'mun said: Knowledge remained mighty until it was carried to the doors of kings who took a wage for it, so Allah removed the sweetness from their hearts and prevented them from knowledge of it], End quote. This is a mix-up and omission as appears from the full text above.",
    "book_id": "191",
    "new_page_number": 55
  },
  {
    "serial_number": "5003207",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 59,
    "volume_number": 1,
    "text": "93 - Wahb said: (Those who enter upon kings are more harmful to the Ummah than gamblers). Muhammad Ibn Maslamah said: (A fly on excrement is better than a reader at the door of these people).\n94 - When Al-Zuhri mixed with the Sultan, a brother in religion wrote to him: (May Allah heal us and you, O Abu Bakr, from trials. You have become in a state where he who knows you should pray for you and have mercy on you. You have become an old man, and Allah's blessings have burdened you since He gave you understanding of His Book and taught you the Sunnah of His Prophet, peace be upon him. Not like this did Allah take the covenant from scholars. Know that the easiest of what you committed, and the lightest of what you bore, is that you comforted the loneliness of the oppressor, and facilitated the path of transgression by your closeness to one who did not fulfill a right nor leave a falsehood when he brought you near. He made you a pole upon which the millstone of their oppression turns, a bridge over which they cross to their calamity, and a ladder they climb to their misguidance. Through you they cast doubt upon scholars and assassinate the hearts of the ignorant. How little is what they built for you compared to what they destroyed for you, and how much they took from you in what they corrupted of your religion. What makes you secure that you are not among those about whom Allah said: (But there came after them successors who neglected prayer and pursued desires) (15). You are dealing with One who is not ignorant, and One who preserves against you is not heedless. So treat your religion for sickness has entered it, and prepare your provision for a long journey has come. Nothing is hidden from Allah in the earth or in the heaven. Peace). He said: (These news and traditions indicate what is in mixing with Sultans of trials and types of corruption, but we detail that with a juristic breakdown, distinguishing the prohibited from the disliked and the permissible. We say: The one entering upon the Sultan is exposed to disobeying Allah either by his action, his silence, his speech, or his belief, and is not free from one of these matters. As for Action: Entering upon them in most cases is to a usurped house, and trespassing and entering it without the owner's permission is forbidden.",
    "foot_note": "1. (15) Surah Maryam: 59.",
    "book_id": "191",
    "new_page_number": 56
  },
  {
    "serial_number": "5003208",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 60,
    "volume_number": 1,
    "text": "Humility to the oppressor is not permitted except by mere greeting. As for kissing the hand and bowing in service, it is a sin. Some of the Salaf went to extremes, even refusing to return their greeting. Turning away from them out of contempt for them is among the best acts of worship. Sitting on their carpet; if most of their wealth is forbidden, is not permissible. As for Silence, he sees in their gathering silk furnishings, silver and silk vessels, and what is worn by them and their servants which is forbidden. Anyone who sees an evil and remains silent about it is a partner in that evil. Indeed, he hears from their speech what is obscenity, lies, insults, and harm, and silence regarding all that is forbidden. If you say: He fears for himself, and is excused in silence, this is true, but he is able to avoid exposing himself to committing what is not permitted except with an excuse; for if he did not enter and did not witness, the command of Hisbah (enjoining good) would not be directed at him, until it drops from him by excuse. Whoever knows of corruption in a place, and knows he cannot remove it, it is not permissible for him to attend so that it happens before him while he watches and is silent; rather he should avoid witnessing it. As for Speech: He prays for the oppressor, or praises him, or confirms him in the falsehood he speaks by explicit words, or by nodding his head, or by smiling in his face, or shows him love and loyalty, and longing to meet him, and eagerness for his long life and survival. Usually, he does not limit himself to greeting, but speaks, and his speech does not go beyond this pattern. As for praying for him, it is not lawful for him except to say: (May Allah reform you, or grant you success for good deeds, or prolong your life in His obedience) or what runs in this course. As for praying for him for protection, long life, and bestowed blessings, along with addressing him as 'Master' (Mawla) and similar meanings, it is not permissible. The Prophet, peace be upon him, said: (Whoever prays for an oppressor to remain, has loved that Allah be disobeyed in His earth) (16). If he exceeds supplication to praise, mentioning what is not in him, he becomes a liar, a hypocrite, or honoring",
    "foot_note": "1. (16) Not authentic as Marfu' (from the Prophet), rather it is a saying of Al-Hasan Al-Basri. Narrated by Ibn Abi Al-Dunya (600) in Al-Samt. See: Al-Fawa'id Al-Majmu'ah (211), Al-Asrar Al-Marfu'ah (344), Kashf Al-Khafa (2/343), Ithaf Al-Sadah (6/133).",
    "book_id": "191",
    "new_page_number": 57
  },
  {
    "serial_number": "5003209",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 61,
    "volume_number": 1,
    "text": "an oppressor. These are three sins. The Prophet, peace be upon him, said: (Indeed Allah gets angry if a corrupt person (Fasiq) is praised) (17). And in another report: (Whoever honors a corrupt person has helped in the destruction of Islam) (18). If he exceeds that to confirming what he says, and validating what he does, he is a sinner by confirmation and by assistance. For validation and praise are help in disobedience and stirring desire for it, just as denial, condemnation, and declaring ugly are a deterrent from it and weakening of its motives. Helping in disobedience is disobedience, even by half a word. Sufyan was asked about an oppressor on the verge of death in a wilderness: Should he be given a drink of water? He said: (No. Let him die, for that is help to him). Also, he is not safe from corruption entering his heart, for he looks at his expansive luxury and belittles Allah's blessing upon himself, and becomes one who intrudes upon the prohibition of the Messenger of Allah, peace be upon him, where he said: (O assembly of Muhajirin, do not enter upon the people of the world, for it is a cause of displeasure regarding provision) (19). This is along with what it entails of others following his example in entering, and increasing the number of the oppressors by himself and making them bear [sins] if he is someone they emulate. All of this is either disliked or",
    "foot_note": "1. (17) Weak Hadith. Narrated by Ibn Abi Al-Dunya (228, 229) in Al-Samt from the hadith of Anas, and Ibn Adi (5/1917) in Al-Kamil from the hadith of Buraydah. See discussion on its narrators in Al-Silsilah Al-Da'ifah (1399).\n18. Weak Hadith. Al-Iraqi said (2/88) in Al-Kashf: Strange with this wording, the known is \"Whoever honors an innovator...\" The hadith was narrated by Ibn Adi from the hadith of Aisha, and Al-Tabarani in Al-Awsat, and Abu Nu'aym in Al-Hilyah from the hadith of Abdullah bin Busr with weak chains, and Ibn Al-Jawzi said: All are fabricated. See Al-Kamil (2/498, 2/736) by Ibn Adi, and Al-Hilyah (5/218) by Abu Nu'aym. I say: See discussion on it in: Tadhkirat Al-Mawdu'at (16), Al-Mawdu'at (1/270) by Ibn Al-Jawzi, Tanzih Al-Shari'ah (1/314), Al-La'ali Al-Masnu'ah (1/130).\n19. Very Weak Hadith. Narrated by Al-Hakim (4/312) with a missing chain, Al-Uqayli (3/327) in Al-Du'afa, Ibn Adi (5/1731) in Al-Kamil. See discussion on its narrators in: Al-Mizan (5987), Al-Lisan (4/762), Kashf Al-Khafa (1/185).",
    "book_id": "191",
    "new_page_number": 58
  },
  {
    "serial_number": "5003210",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 62,
    "volume_number": 1,
    "text": "prohibited. Thus, it is not permissible to enter upon them except with two excuses. First: That there be a command of obligation from them, not honoring, and he knows that if he refuses, he will be harmed. Second: That he enters upon them to repel oppression from a Muslim, so that is a concession provided he does not lie, and does not leave advice he expects to be accepted). Then he said: (If you say: But the scholars of the Salaf used to enter upon Sultans, I say: Yes, learn entry from them, then enter upon them! It was narrated: That Hisham bin Abd al-Malik came as a pilgrim to Mecca. When he entered it, he said: Bring me a man from the Companions). It was said: O Commander of the Faithful! They have passed away. He said: From the Tabi'in. So Tawus Al-Yamani was brought. When he entered upon him, he took off his sandals at the edge of the carpet, and did not greet him by the title Commander of the Faithful, but said: (Peace be upon you, O Hisham!) and did not use his Kunya, and sat facing him and said: (How are you, O Hisham!). Hisham became extremely angry until he considered killing him and said to him: (What drove you to do what you did?!). He said: (And what did I do?!). He increased in anger and rage, saying: (You took off your sandal at the edge of my carpet, did not kiss my hand, did not greet me as Commander of the Faithful, did not use my Kunya, sat facing me without permission, and said: (How are you, O Hisham?). He said: As for your saying: (You took off your sandal at the edge of your carpet, I take them off before the Lord of the Worlds five times every day and He does not punish me nor get angry with me. As for your saying: (You did not kiss my hand, I heard Ali bin Abi Talib say: (It is not lawful for a man to kiss the hand of anyone, except his wife out of desire or his child out of mercy). As for your saying: You did not greet me as Commander of the Faithful, not all people are satisfied with your leadership, so I hated to lie. As for your saying: You did not use my Kunya, Allah Almighty named His allies and said: O David, O Yahya, O Jesus, and used Kunya for His enemies saying: (May the hands of Abu Lahab be ruined) (20). As for your saying: You sat facing me, I heard Ali bin Abi Talib say: (If you want to look at a man from the people of Hell, look at a man sitting while people are standing around him).",
    "foot_note": "1. (20) Surah Al-Masad: 1.",
    "book_id": "191",
    "new_page_number": 59
  },
  {
    "serial_number": "5003211",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 63,
    "volume_number": 1,
    "text": "Hisham said: Admonish me. He said: (I heard Ali bin Abi Talib say: (In Hell there are snakes like buckets and scorpions like mules that sting every Emir who is not just among his subjects). Then he stood up and left (21).\n95 - And from Sufyan Al-Thawri who said: (I entered upon Abu Ja'far at Mina, and he said to me: Raise your need? So I said to him: (Fear Allah! For you have filled the earth with tyranny and oppression). He said: He lowered his head, then raised it and said: Raise your need to us? I said: (This position was only sent down by the swords of the Muhajirin and Ansar, while their children are dying of hunger; so fear Allah and deliver their rights to them). He said: He lowered his head then raised it and said: Raise your need to us? I said: (Umar bin Al-Khattab, may Allah be pleased with him, performed Hajj and said to his treasurer: How much did you spend? He said: Ten-some dirhams. And I see here matters that mountains cannot bear) (22). Thus were they entering upon Sultans if coerced, fleeing with their souls to Allah, meaning the scholars of the Hereafter. As for the scholars of the world, they enter to ingratiate themselves to their hearts, guiding them to concessions, and deducing via subtle tricks latitude in what suits their purposes) End of Al-Ghazali's summarized words.\n96 - In (Amali) of Sheikh Izz al-Din bin Abd al-Salam which his student Sheikh Shihab al-Din Al-Qarafi, one of the Maliki Imams, recorded from him, is the text: (And among his words - meaning Sheikh Izz al-Din, may Allah be pleased with him, when some state officials wrote to him urging him to meet the king of their time, and frequent him so that it would establish his status and suppress his enemy. He said, may Allah be pleased with him: (I read knowledge to be an ambassador between Allah and His creation, and I should frequent the doors of these people!) Al-Qarafi said: (So he pointed out, may Allah be pleased with him, that whoever carries knowledge has become a conveyor from Allah to His servants, so he is in the station of messengership, and whoever has this honor, such [behavior] is not becoming of him).",
    "foot_note": "1. (21) Al-Ihya (2/144-145).\n22. Previous source.",
    "book_id": "191",
    "new_page_number": 60
  },
  {
    "serial_number": "5003212",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 64,
    "volume_number": 1,
    "text": "What a Scholar Should Adorn Himself With\n97 - Ibn Al-Hajj said in (Al-Madkhal): (It is appropriate for a scholar, nay it is incumbent upon him, not to frequent anyone from the sons of the world; because the scholar is the one whose door people should be at, not the reverse where he is at their door. He has no argument in being afraid of an enemy or envier or the like who he fears might disturb him, or hoping for one of them to repel something he fears, or hoping that this would be something to fulfill the needs of Muslims by bringing benefit to them or repelling harm from them. There is no excuse for him in this that benefits him. As for the first: If he takes that with self-aspiration/humiliation, it will not be blessed. And if he was afraid of what was mentioned, that is greater than self-aspiration, and the one he frequents for interest might be imposed upon him as an expedited punishment. As for the second: He commits a definite prohibited act for the sake of a presumed danger expected in the future. It may happen, and it may not, while he is required in the moment not to commit that religiously blameworthy act. Rather, help in fulfilling his needs and the needs of Muslims is by cutting off from the doors of these people, relying on Allah Almighty, and returning to Him, for He, Glory be to Him, is the Fulfiller of needs, the Repeller of fears, the Subjugator of creation's hearts, turning them as He wills, how He wills. The Almighty said addressing the Master of Creation: (If you had spent all that is in the earth, you could not have brought their hearts together; but Allah brought them together) (23). So He mentioned this in the context of bestowing favor upon His Prophet, peace be upon him. And the scholar, if he follows him, upon him be the best prayers and peace, especially in reliance on his Lord Almighty and finding tranquility in Him rather than His creatures, He Almighty will treat him with this gentle treatment with which He treated His Prophet, peace be upon him. And due to the blessing of following him, peace be upon him, he will be safe from frequenting the doors of these people like some people do, which is a deadly poison. If only they limited themselves to what was mentioned and no more. But they add to that what is more severe and heinous, which is saying that their frequenting their doors is out of humility, or for guiding them to good, and other things that occur to them, which is much and the affliction has become widespread.",
    "foot_note": "1. (23) Surah Al-Anfal: 63.",
    "book_id": "191",
    "new_page_number": 61
  },
  {
    "serial_number": "5003213",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 65,
    "volume_number": 1,
    "text": "If they believe that, hope for their repentance and return has lessened. Some of our scholars narrated that if a just witness frequents the door of the Judge, that is a defect against him and his testimony is rejected. If this is regarding frequenting the door of the Judge, who is a scholar of the Muslims, whose gathering is safe from what happens in the gatherings of those others, then how about frequenting other than the Judge? It is a fortiori more obligatory to prevent that). He said in another place: (It is appropriate for a scholar that if the school's stipend is cut off from him, he should not leave his diligence nor become annoyed or vexed, because the stipend might have been cut off from him as a test from Allah Almighty to see his sincerity in his knowledge and work; for his provision is guaranteed for him not restricted to one direction over another. He, peace be upon him, said: (Whoever seeks knowledge, Allah guarantees his provision) (24).\n99 - Its meaning is He facilitates it for him without fatigue or hardship. Although Allah Almighty guaranteed provision for all creation, the wisdom of specifying the scholar is that it is facilitated for him without fatigue or hardship, so his share of fatigue and hardship is made in teaching, studying, understanding issues and delivering them. That is from Allah Almighty by way of kindness to him and benevolence. This is among the miracles (Karamat) of scholars, meaning understanding issues and delivering them well, and knowledge of managing people in learning them, just as the miracles of the saints (Awliya) contain other things that take long",
    "foot_note": "1. (24) Fabricated Hadith. Narrated by Al-Khatib (3/180) via Muhammad bin Al-Qasim Ibn Hashim from his father from Yunus bin Ata from Al-Thawri from his father from his grandfather from Ziyad bin Al-Harith with it. * Al-Suyuti attributed it to Al-Marhabi in the book \"Fadl Al-Ilm\" as in Al-Durr Al-Manthur (4/313). ** Its chain contains Yunus bin Ata; Ibn Hibban said: He narrates wonders, it is not permissible to use his report as proof. Al-Hakim and Abu Saeed Al-Naqqash said: He narrated fabricated reports from Hamid Al-Tawil. See: Al-Mizan (4/482), and Al-Lisan (6/333). \n.... And in its chain is Al-Thawri's grandfather; Al-Dhahabi said: I do not know of a mention for Al-Thawri's grandfather except in this report. See: Al-Mizan (4/482).",
    "book_id": "191",
    "new_page_number": 62
  },
  {
    "serial_number": "5003214",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 66,
    "volume_number": 1,
    "text": "to enumerate, such as walking on water and flying in the air. He should protect this noble position from frequenting those expected to help release the stipend, or speaking about it, or creating a substitute stipend. One whom I trust told me that he saw a scholar who was teaching in a school, and the stipend was cut off from him and his students. They said to the teacher: Perhaps you could walk to so-and-so! He was one of the sons of the world, to meet him so he might order the release of the stipend. He said: (By Allah, I am shy before my Lord Almighty that this grey hair should lie in His presence). They said to him: How is that!? He said: (I wake up every day saying: O Allah, there is no preventer of what You give, and no giver of what You prevent). So I say this and stand before a creature asking him for that; by Allah I will not do it). The scholar is the most worthy to trust in his Lord Almighty regarding prevention and giving. He has no excuse in asking for the sake of family, because if he leaves that out of piety for this noble position, the Generous Allah will not waste his intent and will bring it to him or open for him from His unseen what is better for him than that, and help him and fill his need as He wills, how He wills. His provision is not specific to a specific direction. Allah's eternal habit is that He, Glory be to Him, provides for the one whose state is this from a door he does not intend or hope for; because Allah's intent from scholars is their devotion to Him, and their reliance in all their affairs upon Him. They do not look at causes, but at the Causer of causes, their Manager, and the One capable over them. How can a scholar not be like that when he is the guide for creation and the clarifier of the straight path to reach Him, Glory be to Him. Whoever leaves something for Allah, Allah compensates him with better than it from where he does not expect) End.\n100 - In (Tabaqat Al-Hanafiyyah) in the biography of Ali bin Al-Hasan Al-Sandali: (That the Sultan, Malik Shah, said to him: (Why do you not come to me? He said: I wanted you to be among the best of kings, by you visiting scholars, and for me not to be among the worst of scholars by visiting kings).\n101 - Ibn Adi said in (Al-Kamil): (I heard Abu Al-Hussein Muhammad bin Al-Muzaffar say: I heard our Sheikhs in Egypt acknowledging Abu Abd al-Rahman Al-Nasa'i's precedence and leadership, describing his diligence in worship at night, his perseverance in jihad, and that he went out to battle with the Governor of Egypt, and was described for his gallantry, establishing the narrated Sunan, and avoiding",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 63
  },
  {
    "serial_number": "5003215",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 67,
    "volume_number": 1,
    "text": "sitting with the Sultan with whom he went out. That remained his habit until he was martyred, may Allah be pleased with him. In (Tahdhib Al-Kamal) by Al-Mizzi in the biography of Abu Yahya Ahmad bin Abd al-Malik Al-Harrani, Sheikh of Al-Bukhari, is the text: (Abu Al-Hasan Al-Maimuni said: I asked Ahmad bin Hanbal about him, and he said: (He was with us and I saw him to be clever, and saw no harm in him. I saw him preserving his hadith, and saw nothing but good. I said: I saw a group speaking ill of him. He said: He frequents the Sultan because of a property of his) (25).\n\nThe Rarest Things at the End of Time\n103 - In (Tahdhib Al-Kamal) also with his chain from Rishdin bin Sa'd who said: I heard Ibrahim bin Adham say: I heard (The rarest things at the end of time are three: A brother in Allah to be emulated, earning a dirham from Halal, and a word of truth before a Sultan) (26).\n\nThe Words of Poets Regarding Coming to Sultans\n104 - From Khalaf bin Tamim who said: I heard Ibrahim bin Adham reciting:\nI see people satisfied with the least of religion ... And I do not see them satisfied with a lowly life (27)\nSo be self-sufficient with Allah from the world of kings ... Just as kings are self-sufficient with their world from religion\n105 - Al-Shasi said in his Amali: (Abu Bakr Ibn Al-Anbari told us, my father told me saying: Sulayman Al-Muhallabi sent one hundred thousand dirhams to Al-Khalil bin Ahmad,",
    "foot_note": "1. (25) Mentioned by Hafiz Al-Mizzi (1/30) in Tahdhib Al-Kamal.\n26. Narrated by Al-Mizzi (1/49) in Tahdhib Al-Kamal.\n27. Previous source. And narrated by Abu Nu'aym (6/376) in the biography of Sufyan Al-Thawri.",
    "book_id": "191",
    "new_page_number": 64
  },
  {
    "serial_number": "5003216",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 68,
    "volume_number": 1,
    "text": "and asked him for his companionship. He returned the one hundred thousand and wrote verses to him:\nConvey to Sulayman that I am in ease from him ... And in wealth though I am not possessor of money\nGenerous with my soul, I do not see anyone ... Dying of emaciation nor remaining in one state\nProvision is by decree, helplessness does not decrease it ... Nor does the trickery (28) of a trickster increase you in it\nPoverty is in the soul, not in money do you know it ... And likewise wealth is in the soul, not money (29)\n106 - Abu Nu'aym narrated in (Al-Hilyah) from Muhammad bin Wuhaib bin Hisham who said: Some of my companions recited to me by Ibn Al-Mubarak, may Allah Almighty have mercy on him:\nEat crushed grain (30) and rice ... With barley bread\nAnd make that [your] food ... You will be saved from the heat of the Blaze\nAnd stay away as much as you can, may Allah guide you ... From the door of the Emir (31)\n107 - Abu Nu'aym narrated in (Al-Hilyah) from Ahmad bin Jamil Al-Marwazi who said: It was said to Abdullah bin Al-Mubarak, may Allah be pleased with him and please him, that Ismail bin Ulayya had taken charge of the Sadaqat (Charity Office). So Ibn Al-Mubarak wrote to him:\nO you who makes knowledge a falcon for him ... Hunting the wealth of the poor\nYou tricked the world and its pleasures ... With a trick that takes away religion\nYou became mad for it after ... You were a cure for the mad\nWhere is your narration in listing it ... To leave the doors of Sultans\nWhere is your narration in the past ... From Ibn Awn and Ibn Sirin\nIf you say I was coerced, this is false ... The builder of knowledge slipped in the mud\nHe said: When he read the letter, he wept and asked to be relieved [of the post] (32).",
    "foot_note": "1. (28) Meaning the scheming of a schemer.\n29. Mentioned by: Yaqut Al-Hamawi (11/75-76) in Mu'jam Al-Udaba, Al-Zubaidi (p. 47) in Tabaqat Al-Nahwiyyin, and Al-Qifti (1/244) in Inbah Al-Ruwat.\n30. Al-Jarish: Thick coarse bread.\n31. Mentioned by Al-Dhahabi (8/414-415) in Al-Siyar, and in his chain to Ibn Al-Mubarak is Al-Kadimi, who is weak.\n32. Narrated by Ibn Abd al-Barr (p. 257-258) in Jami' Bayan Al-Ilm, and mentioned by Al-Dhahabi (8/411-412) in Al-Siyar, and Ibn Al-Jawzi (4/140) in Safwat Al-Safwa.",
    "book_id": "191",
    "new_page_number": 65
  },
  {
    "serial_number": "5003217",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 69,
    "volume_number": 1,
    "text": "108 - Similar to this is what Ibn Asakir narrated in his History via Al-Bayhaqi, from Al-Hakim who said: Abu Al-Fadl bin Abi Nasr informed me, Ali bin Al-Hasan bin Habib Al-Dimashqi told us, said: I heard Al-Naqusi, and he was of the people of Quran and Knowledge, said: I heard Muhammad bin Abdullah bin Al-Hakam say: I heard Al-Shafi'i say: (I had a friend called Husayn, and he used to treat me kindly and connect with me. The Commander of the Faithful appointed him over Al-Sayb. He said, so I wrote to him:\nTake it to yourself, for your love is divorced ... From me, and it is not a divorce of separation [minor]\nIf you desist, it is one divorce ... And your love remains on two\nAnd if you turn away, I will follow it with its like ... And it will be two divorces in two menses\nIf the three come to you from me willingly ... The governorship of the two seas will not enrich you\nI was not content to abandon Husayn alone ... Until the face of every fortified one turned black\n109 - Abu Nu'aym narrated from Muhammad bin Wahb, who said: Some of our companions recited to me by Ibn Al-Mubarak:\nWill you not emulate Sufyan and your Mis'ar ... And Ibn Maghul as piety gathers them\nAnd the Pious one, the brother of Tayy, for he is the fourth of them ... The adornment of all lands, elite and branch\nLike chicks you see them in their night prayer ... Sleepless eyes, no closing nor slumber\nSitters of houses, crouching in their homes ... Except for calamities or Friday prayers disturb them\nEmpty stomachs with hungry livers ... They do not covet the forbidden for fear of terror\nPeople have worries, and the worry of these people is their souls ... At harvest time, people [reap] what they sowed\nAnd some of them said:\nFar from it! Be proud with the Sultan if you come to him ... He who enters the doors of Sultans has gone astray\nImam Abu Al-Qasim Al-Shatibi, author of the famous poem, said:\nThey blame me when I did not find a compatible one ... And what is my blame when I sought the noble ones\nThey said learn the hypocrisy of sciences ... With the magic of hypocrisy that deserves determination\nAnd turn its harvest around with what ... Brings the noses of high mountains low in humility\nAnd there must be wealth by which knowledge is elevated ... And status in the world to repel injustices\nAnd were it not for the lamps of Sultans you would not find ... Anyone standing for truth on the darknesses of the path\nSo mix with them and be patient with the humiliation of their doorkeepers ... You will attain glory through them that names you a scholar\nAl-Jamal Al-Lughawi said in the book (Al-Mu'jib) and from his handwriting I copied: Some virtuous people told me: That Emir Izz al-Din Harasak sent to Sheikh Al-Shatibi inviting him to attend his presence. The Sheikh ordered some of his companions to write these verses to him, which are his saying:\nSay to the Emir a statement ... From a smart, intelligent advisor\nIndeed, the Faqih, if he comes to ... Your doors, there is no good in him\nIn (Al-Tadhyil) by Al-Badr Al-Nabulusi: Saeed bin Ibrahim bin Abd Rabbih said, having withdrawn from kings at the end of his life:\nIs it after my diving into the sciences of realities ... And the length of my expansion in the ways of a Creator\nAnd at the time of my overlooking His Kingdom ... I see one seeking provision from other than my Provider\nMy soul has permitted the delegation of its friend ... And my predecessor hastened in driving me to death\nAway from you! O one who sees advice as humiliation ... The stones of gloaters have widened in you\nWhen their boys played with you and sought ... Their sheikhs in you the opening calamities\nSo I said answering, nothing makes me happy except ... The salvation of the heart while tears pour blocking [sight]\nTo Allah I complain of my loneliness in my calamities ... And this is the time of patience if I were resolute\nHow many sighs under the ribs agitated by ... A wise man selling knowledge for injustice as a ruler\nAs if the side of knowledge elevates its people ... To the best breaths of life as marks\nThey return the flower of the world you circulated with to ... The grazing of the Hereafter so he roams hovering\n110 - Al-Hafiz Abu Nasr bin Makula said:\nThe doors of kings gathered for me to come ... I knew what the two heavy ones (Jinn and Mankind) did not know\nI saw Canopus not deviating from its path ... From the sun except from a station of disgrace",
    "foot_note": "None",
    "book_id": "191",
    "new_page_number": 66
  },
  {
    "serial_number": "5003218",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "What the Great Scholars Narrated Regarding Not Coming to the Sultans",
    "edition": "First, 1411 AH - 1991 AD",
    "publisher": "Dar Al-Sahaba for Heritage, Egypt",
    "page_number": 70,
    "volume_number": 1,
    "text": "111 - And some of them said singly:\nFar from it! His deputy seeks might through the Sultan ... Indeed, he who enters the doors of Sultans has gone astray\n[[Ibn Asakir narrated in his History from Zaid bin Aslam who said: I was with Abu Hazim when Abd al-Rahman bin Khalid the Emir sent to him saying: Come to us so we may ask you and you may narrate to us. Abu Hazim said: (God forbid! I met the people of knowledge not carrying knowledge to the people of the world, so I will not be the first to do that. If you have a need, convey it to us). So Abd al-Rahman sent to him: You have increased in honor with us by this. End. Allah is sufficient for us and the best Disposer of affairs, and there is no power nor strength except in Allah, the Most High, the Great.]] ()",
    "foot_note": "1. () The preparer of the book for Shamela said: What is between brackets is not in the printed version.",
    "book_id": "191",
    "new_page_number": 67
  }
]