[
  {
    "text": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar (The Choice of Thought on the Terminology of the People of Tradition)\nAuthor: أبو الفضل أحمد بن علي بن محمد بن أحمد بن حجر العسقلاني\nYear: 852",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar (The Choice of Thought on the Terminology of the People of Tradition)",
    "category_id": "10",
    "category": "Hadith Sciences",
    "new_page_number": 1
  },
  {
    "text": "sn: 3452\nbook_title: نخبة الفكر في مصطلح أَهل الأثر\nbook_link: https://shamela.ws/book/616\nbook_id: 616\nauthor_name: أبو الفضل أحمد بن علي بن محمد بن أحمد بن حجر العسقلاني\nauthor_year: 852\nnickname: أبو الفضل\nauthor_link: https://shamela.ws/author/202\nauthor_ID: 202\neditor: د عبد المحسن بن محمد القاسم\npublisher: Null\nedition: الثانية، 1441 هـ - 2020 م\npages: 81\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: علوم الحديث\ncategory_id: 10",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar (The Choice of Thought on the Terminology of the People of Tradition)",
    "category_id": "10",
    "category": "Hadith Sciences",
    "new_page_number": 2
  },
  {
    "serial_number": "3382294",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar (The Choice of Thought on the Terminology of the People of Tradition)",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Hadith Sciences. Book: Nukhbat al-Fikar fi Mustalah Ahl al-Athar (The Choice of Thought on the Terminology of the People of Tradition). Author: Ahmad bin Ali Ibn Hajar al-Asqalani (Died 852 AH). Investigator: Dr. Abdul Muhsin bin Muhammad al-Qasim. Investigated based on copies read to the author and bearing his handwriting and license (Ijaza). Edition: Second, 1441 AH - 2020 AD. Number of pages: 81 [Book numbering matches the printed version]. Publication date on Shamela: 17 Jumada al-Akhirah 1443.\nBook: Nukhbat al-Fikar fi Mustalah Ahl al-Athar. Author: Ahmad bin Ali Ibn Hajar al-Asqalani (Died 852 AH). Investigator: Dr. Abdul Muhsin bin Muhammad al-Qasim. Investigated based on copies read to the author and bearing his handwriting and license. Edition: Second, 1441 AH - 2020 AD. Number of pages: 81 [Book numbering matches the printed version]. Publication date on Shamela: 17 Jumada al-Akhirah 1443.\nAuthor: Ahmad bin Ali Ibn Hajar al-Asqalani (Died 852 AH). Investigator: Dr. Abdul Muhsin bin Muhammad al-Qasim. Investigated based on copies read to the author and bearing his handwriting and license. Edition: Second, 1441 AH - 2020 AD. Number of pages: 81 [Book numbering matches the printed version]. Publication date on Shamela: 17 Jumada al-Akhirah 1443.\nInvestigator: Dr. Abdul Muhsin bin Muhammad al-Qasim. Investigated based on copies read to the author and bearing his handwriting and license. Edition: Second, 1441 AH - 2020 AD. Number of pages: 81 [Book numbering matches the printed version]. Publication date on Shamela: 17 Jumada al-Akhirah 1443.\nInvestigated based on copies read to the author and bearing his handwriting and license. Edition: Second, 1441 AH - 2020 AD. Number of pages: 81 [Book numbering matches the printed version]. Publication date on Shamela: 17 Jumada al-Akhirah 1443.\nNumber of pages: 81 [Book numbering matches the printed version]. Publication date on Shamela: 17 Jumada al-Akhirah 1443.\n[Book numbering matches the printed version]. Publication date on Shamela: 17 Jumada al-Akhirah 1443.\nPublication date on Shamela: 17 Jumada al-Akhirah 1443",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 3
  },
  {
    "serial_number": "3382295",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Student of Knowledge Texts Investigated based on (230) Manuscripts. Additional Texts (1). Nukhbat al-Fikar fi Mustalah Ahl al-Athar. Investigated based on copies read to the author and bearing his handwriting and license. By Al-Hafiz Ahmad bin Ali Ibn Hajar al-Asqalani, may Allah have mercy on him (Died 852 AH). Investigation by Dr. Abdul Muhsin bin Muhammad al-Qasim, Imam and Khatib of the Prophet's Mosque.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 4
  },
  {
    "serial_number": "3382296",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "Copyright Abdul Muhsin bin Muhammad al-Qasim 1440 AH. Cataloging of King Fahd National Library during publication. Al-Shafi'i, Ahmad bin Ali Ibn Hajar. Nukhbat al-Fikar fi Mustalah Ahl al-Athar. / Ahmad bin Ali Ibn Hajar Al-Shafi'i; - 2nd Ed. - Riyadh 1440 AH. 80 pages, 17 x 24 cm. ISBN: 978-603-03-1003-6. 1 - Hadith - Terminology. A. Al-Qasim, Abdul Muhsin bin Muhammad (Investigator). B - Title. Dewey 231 ... 9752/ 1440. Deposit Number: 9752/ 1440. ISBN: 978-603-03-1003-6. All Rights Reserved. Second Edition 1441 AH - 2020 AD.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 5
  },
  {
    "serial_number": "3382297",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "Student of Knowledge Texts Investigated based on (230) Manuscripts. Additional Texts (1). Nukhbat al-Fikar fi Mustalah Ahl al-Athar. Investigated based on copies read to the author and bearing his handwriting and license. By Al-Hafiz Ahmad bin Ali Ibn Hajar al-Asqalani, may Allah have mercy on him (Died 852 AH). Investigation by Dr. Abdul Muhsin bin Muhammad al-Qasim, Imam and Khatib of the Prophet's Mosque.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 6
  },
  {
    "serial_number": "3382298",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Due to the importance of texts (Mutun) for the student of knowledge, a department was established in the Prophet's Mosque for memorizing these texts. It includes many young and adult students throughout the year. One can join it in remote learning circles via the link: www.mottoon.com. To download the Student of Knowledge Texts as an electronic copy, and listen to their explanation directly or download them via the link: www.a-alqasim.com.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 7
  },
  {
    "serial_number": "3382299",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. Introduction. Praise be to Allah, Lord of the Worlds, and peace and blessings be upon our Prophet Muhammad, and upon all his family and companions. To proceed: The honor of every science is by the honor of its subject matter, and its rank rises according to the need for it, and the effects of its benefit on creation show its virtue over others. Among the most majestic sciences in worth and greatest in benefit is: \"The Science of Hadith\", for by it Allah preserved the Sunnah of His Prophet Muhammad, peace be upon him. Among the means of His, the Exalted, preservation of it is: harnessing firmly grounded scholars to classify in the sciences of Hadith, ranging from lengthy to brief. Among those is: Al-Hafiz Ahmad bin Ali Ibn Hajar, may Allah have mercy on him. He gathered in his book: \"Nukhbat al-Fikar fi Mustalah Ahl al-Athar\" what was scattered, summarized in it the sciences of those who preceded, and added to it unique points and benefits, with precision in induction, probing, and division. So his compilation came as a concise, comprehensive selection received by the people of knowledge with acceptance. Therefore, I worked on investigating it within the series of investigating additional texts from \"Student of Knowledge Texts\", relying in that on precious manuscripts, so it appears in the most beautiful attire as the author put it. I have established in the footnotes of this copy the differences between the manuscript copies and other things, and I have singled out another copy stripped of that.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 8
  },
  {
    "serial_number": "3382300",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "I placed before the book: My methodology in investigation, description of the copies relied upon in investigating the text, verification of the book's name, biography of the author, and samples of the manuscripts. I ask Allah to make it beneficial, and to make our work in it purely for His Noble Face. And may Allah bless and grant peace to our Prophet Muhammad, and upon his family and all his companions. Dr. Abdul Muhsin bin Muhammad al-Qasim, Imam and Khatib of the Prophet's Mosque.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 9
  },
  {
    "serial_number": "3382301",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "My Methodology in Investigation. 1 - I symbolized the copies with alphabetical letters according to their date; oldest to newest. 2 - I established in the text what most copies agreed upon, and perhaps I established what appeared in some of them or one of them if consideration required that, and I explain the reason mostly. 3 - I established in the footnotes the important differences between the copies. 4 - I sought help by reviewing Nuzhat al-Nazar and its explanations in weighing between some differences contained in the text copies. 5 - I mostly neglected mentioning what the scribes inadvertently erred in, which is of the nature of pure mistakes, especially what was of the nature of error in diacritics (dabt); unless this error has a possible face, then I establish it. 6 - The author, may Allah have mercy on him, merged in \"Nuzhat al-Nazar\" the words of Al-Nukhba with the words of the explanation to be more fitting - as he stated -. This necessitated that the diacritics of some of its words differ between the text and its explanation; due to the change of context, and the consequent difference in parsing. Mulla Ali al-Qari alerted to this by saying - in Sharh Sharh Nukhbat al-Fikar (p. 151) -: \"It became frequent in this book...",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 10
  },
  {
    "serial_number": "3382302",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "...considering its mixing: that he made a term parsed with one parsing in the text, and another parsing in the explanation, and the likes of that.\" Therefore, I neglected the differences of this kind, and restricted myself to considering the diacritics contained in the text copies; unless the context of the text did not change in the explanation. 7 - I established the text according to what became famous of contemporary spelling rules, and did not point out the difference of copies in that; such as the method of writing Hamzas, drawing Ta' as open or tied (Marbuta), and the like. 8 - If the difference is by advancing a word over a word; I mention the difference only in the footnote, and say after it: \"with advancement and delay\". 9 - If the copies differed in the diacritics of a word; I establish in the text the most correct and famous face, and indicate in the footnote the rest of the faces, with an explanation of the weighing from the scholars' words mostly. 10 - If a word was written in one of the copies with two faces in one letter - like: Ta' and Ya', or Nun and Ya' and the like -; I write in the footnote what agrees with the text, then I clarify that it is with both letters together. 11 - The symbols contained in the margins of the copies, I did not establish them as they are with their symbol, but wrote them with the intended word - for example the letter: \"Kh, Kh-\" intended by it: reference to another copy -; I wrote it like this: \"in a copy on the margin so-and-so\".",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 11
  },
  {
    "serial_number": "3382303",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "12 - If a word was diacritized in some copies and neglected in the rest, with no difference between the diacritized copies, I establish the existing diacritics without pointing to the neglected copies. If the copies differed in diacritics, I indicate what is in the diacritized copies, and neglect mentioning the non-diacritized copies. 13 - I observed in describing the difference in word diacritics: distinguishing the sign of construction (Bina') and what goes back to the morphological structure of the word; from the signs of parsing (I'rab). 14 - I made two copies for the book: A - The first copy: It is the copy containing the investigation footnotes; from differences between copies, weighing between them, and commenting on what needs comment, and it is this copy. B - The second copy: A copy stripped of all referred footnotes, which is more suitable for memorization.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 12
  },
  {
    "serial_number": "3382304",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "Description of the Copies Relied Upon in Investigating the Text. I relied in investigating the text of \"Nukhbat al-Fikar\" on eight manuscripts, whose copying is early. I also compared the text with eight ancient copies of its explanation \"Nuzhat al-Nazar\", and I did not establish the differences between the copies of Al-Nuzhah, except in some important places where need called for it. These copies according to the date of their copying are as follows: First: Copies of \"Nukhbat al-Fikar\". The First Copy, symbolized by (A): It is a manuscript preserved in the National Library in Paris - France -, under number (760/1). Number of its plates: (3) plates. Date of its copying: (13) Dhu al-Hijjah, year (821 AH). Its scribe: Not mentioned. Its script: Beautiful Naskhi. Its characteristics: 1 - A precise copy, diacritized, but a lacuna occurred in it that took away more than two-thirds of it; from his saying: \"Muhammad whom He sent to the people...\", to his saying: \"Al-Jarh, and the worst of it: Description with Af'al (superlative form)\".",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 13
  },
  {
    "serial_number": "3382305",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "2 - Written during the author's life, more than thirty years before his death. 3 - On its beginning is a waqf (endowment) of this copy from its owner: Muhammad bin Ahmad al-Muzaffari (1), who is a student of Al-Sakhawi. The Second Copy, symbolized by (B): It is a manuscript preserved in the Egyptian National Library (Dar al-Kutub) within the Tal'at collections - Egypt -, under number (880/5). Number of its plates: (5) plates. Date of its copying: Thursday (16) Muharram, year (834 AH). Its scribe: Muhammad bin Musa bin Imran al-Muqri (2). Its script: Usual Naskhi. Its characteristics: 1 - A complete copy. 2 - Written in the handwriting of the author's student. 3 - Written during the author's life, (18) years before his death. 4 - A corrected copy - as is apparent from its margins.",
    "foot_note": "1. He is Muhammad bin Ahmad al-Muzaffari, known as Ibn al-Fakhuri. He read to Al-Sakhawi, Al-Dayli, and others. Al-Sakhawi said: \"He had ambition and desire for occupation (with knowledge).\" Al-Daw' al-Lami' li-Ahl al-Qarn al-Tasi' (7/76). \n2. He is Muhammad bin Musa bin Imran, Shams al-Din al-Ghazzi, then al-Maqdisi, al-Hanafi, the reciter. He read to Al-Hafiz Ibn Hajar (Nughbat al-Zaman li-Abi Hayyan), and others in the year (844 AH). He led recitation in Jerusalem and Cairo, and people benefited from him due to his righteousness. He died in the year (873 AH). Al-Daw' al-Lami' (10/58).",
    "book_id": "616",
    "new_page_number": 14
  },
  {
    "serial_number": "3382306",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "The Third Copy, symbolized by (C): It is a manuscript in the Hagia Sophia Library, within the Suleymaniye Library in Istanbul - Turkey -, under number (440/2). Number of its plates: (5) plates. Date of its copying: The sixth of Jumada al-Akhirah, year (834 AH). Its scribe: Abu al-Fath Muhammad bin Muhammad Ibn al-Jazari al-Nabulsi. Its script: Clear Naskhi. Its characteristics: 1 - A complete, precise, and compared copy. 2 - On its margins are corrections in several places. 3 - Written during the life of the author, may Allah have mercy on him. 4 - The scribe distinguished the headings of issues with red. The Fourth Copy, symbolized by (D): It is a manuscript preserved in the Egyptian National Library within the Tal'at collections - Egypt -, under number (880/2). Number of its plates: (6) plates. Date of its copying: Tuesday (8) Muharram, year (850 AH). Its scribe: Muhammad bin Musa bin Imran al-Muqri - previously mentioned -. Its script: Usual Naskhi.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 15
  },
  {
    "serial_number": "3382307",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "Its characteristics: 1 - A complete copy, diacritized with marks. 2 - Written in the handwriting of the author's student. 3 - Written during the author's life, two years before his death. The Fifth Copy, symbolized by (E): It is a manuscript preserved in the Escorial Museum Library - Spain -, under number (1509). Number of its plates: (4) plates. Date of its copying: End of Rabi' al-Awwal, year (869 AH). Its scribe: Ahmad bin Ali bin Ali bin Abdullah al-Maghrawi. Its script: Clear Andalusian. Its characteristics: 1 - A complete, good copy. 2 - Most of its words are diacritized. 3 - The scribe distinguished some headings of issues with a dark color. 4 - The scribe left blank spaces for some important words to write them with a different ink - seemingly -, but he did not get active to complete them, so he left some of them blank. They are twenty-seven places. I did not alert to them in the footnotes; sufficing with alerting to them here.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 16
  },
  {
    "serial_number": "3382308",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "The Sixth Copy, symbolized by (F): It is a manuscript preserved in the Taymuriyya Library, at the Egyptian National Library - Egypt -, under number (76). Number of its plates: (5) plates. Date of its copying: The date of its copying was not mentioned, but on it is a license (Ijaza) from Sheikh Uthman al-Dimi (1) - the author's student - to the scribe, in Shawwal year (876 AH). Its scribe: Siraj al-Din Abu Hafs, Umar bin Abi Bakr bin Ali, famous as Ibn al-Mubayyid al-Saydawi al-Shafi'i (2). Its script: Clear Naskhi in utmost beauty. Its characteristics: 1 - A complete and precise copy. 2 - On its margins are corrections indicating care for it.",
    "foot_note": "1. He is Uthman bin Muhammad bin Uthman bin Nasir, Al-Fakhr, Abu Umar, Al-Dimi Al-Qahiri, Al-Azhari, Al-Shafi'i. Known first as Al-Buhuti - because his mother was from there - then as Al-Dimi. He is one of the nine whom Al-Hafiz Ibn Hajar recommended, describing them as being people of Hadith. Born in Muharram year (820 AH), and died in year (908 AH). Al-Daw' al-Lami' (5/140), Al-Nur al-Safir 'an Akhbar al-Qarn al-Ashir (p. 46). \n2. He is Umar bin Abi Bakr al-Saydawi al-Dimashqi al-Shafi'i, known as Ibn al-Mubayyid. Al-Sakhawi, may Allah have mercy on him, said: \"A virtuous, religious, calm young man. He stayed in Cairo a little, worked with some of the group, and read Sahih Muslim to me.\" Al-Daw' al-Lami' (6/77).",
    "book_id": "616",
    "new_page_number": 17
  },
  {
    "serial_number": "3382309",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "3 - Read to Sheikh Uthman al-Dimi - student of the author, may Allah have mercy on him, and bearing his handwriting and license. The Seventh Copy, symbolized by (G): It is a manuscript preserved in the Raghib Pasha Library, within the Suleymaniye Library in Istanbul - Turkey -, within a collection, under number (1470/2). Number of its plates: Two plates. Date of its copying: Not mentioned, but it was copied in the ninth century; for its scribe was born in the year (815 AH). Its scribe: Muhammad bin Ahmad bin Abi Bakr al-Busiri (1). Its script: Usual Naskhi. Its characteristics: 1 - A complete copy. 2 - Its scribe is one of the students of the author, may Allah have mercy on him. 3 - Its scribe distinguished the separators between the sentences of the text and some words with red.",
    "foot_note": "1. He is Muhammad bin Ahmad bin Abi Bakr al-Busiri, son of Al-Hafiz Al-Busiri. Also known as Al-Busiri, and nicknamed Abu al-Fath. Born on the fifteenth of Rajab year eight hundred and fifteen (815 AH) in Cairo, and grew up there. He memorized the Quran and Taqrib al-Asanid by Al-Iraqi, Al-Nukhba by Ibn Hajar, and others. He is a student of Ibn Hajar; Al-Sakhawi, may Allah have mercy on him, said - after mentioning some of what he read to him -: \"And he read to him all of Al-Nukhba of his authorship as well, and other things by presentation.\" Al-Jawahir wa al-Durar in the biography of Sheikh al-Islam Ibn Hajar (3/1127), and Al-Daw' al-Lami' (6/296).",
    "book_id": "616",
    "new_page_number": 18
  },
  {
    "serial_number": "3382310",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "The Eighth Copy, symbolized by (H): It is a manuscript preserved in the Atif Efendi Library in Istanbul - Turkey -, under number (379). Number of its plates: (8) plates. Date of its copying: Tuesday (15) Sha'ban, year (1125 AH), but it is copied from an old copy. Its scribe: Not mentioned. Its script: Usual and clear Naskhi. Its characteristics: 1 - A complete copy, its scribe cares about diacritizing the problematic parts. 2 - Copied from a copy in the handwriting of a student of the author, and he read it to him, and he wrote a license for him on it in his handwriting. 3 - Comments transferred from the author's explanation were established on the margins of the copy.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 19
  },
  {
    "serial_number": "3382311",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "Second: Copies of \"Nuzhat al-Nazar\". The First Copy, symbolized by (T): It is a manuscript preserved in the Pertev Pasha Library, within the Suleymaniye Library in Istanbul - Turkey -, under number (56). Date of its copying: Year (843 AH). It is read to the author, and bears his handwriting. The Second Copy, symbolized by (Y): It is a manuscript preserved in the Egyptian National Library within the Tal'at collections - Egypt -, under number (880/6). Date of its copying: Year (844 AH) during the author's life. It is in the handwriting of his student: Muhammad bin Musa bin Imran al-Muqri. The Third Copy, symbolized by (K): It is a manuscript preserved in the Hamzawiyya Library in the Errachidia Province in Morocco, under number (204). It is read to the author, a reading of research and scrutiny, and bears his handwriting. At its end is a license from the author to the owner of the copy Nur al-Din Ali bin Dawood al-Jawhari al-Hanafi (1) - student of the author -; on the tenth of Jumada al-Akhirah, year (850 AH).",
    "foot_note": "1. He is Ali bin Dawood bin Ibrahim, Nur al-Din, Al-Qahiri, Al-Jawhari, Al-Hanafi. Known as Ibn Dawood and Ibn al-Sayrafi. Born on the fourteenth of Jumada al-Akhirah, year eight hundred and nineteen in Cairo, and grew up there. He read Sharh al-Nukhba and others to its author Al-Hafiz Ibn Hajar al-Asqalani, and attended his gathering for dictation and others. Al-Daw' al-Lami' (5/218), Al-Jawahir wa al-Durar (3/1114).",
    "book_id": "616",
    "new_page_number": 20
  },
  {
    "serial_number": "3382312",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "The Fourth Copy, symbolized by (L): It is a manuscript preserved in Princeton Library (Garrett Collection) - USA -, under number (3949). Date of its copying: Third of Rajab, year (850 AH). Its scribe is the author's student: Muhammad bin Muhammad bin Muhammad Ibn al-Mughayzil - and Ibn Hammad - al-Abdari al-Hamawi al-Shafi'i (1). It is read to the author, and bears his handwriting and license. The Fifth Copy, symbolized by (M): It is a manuscript preserved in the Zahiriyya National Library in Damascus - Syria -, under number (4895). Date of its copying: Ramadan, year (851 AH) - about one year before the author's death -. Its scribe: Ahmad bin Muhammad Ibn al-Akhsasi al-Shafi'i (2) - student of the author -. It is read to the author, a reading of research, and bears his handwriting. The Sixth Copy, symbolized by (N): It is a manuscript preserved in the Hakim Oglu Library; within the Suleymaniye Library in Istanbul - Turkey -, under number (155). Date of its copying: Shawwal,",
    "foot_note": "1. He is Muhammad bin Muhammad bin Muhammad, Al-Zain, Abu al-Barakat, Ibn Nasir al-Din Ibn al-Mughayzil al-Hamawi. Al-Sakhawi said: \"He read Sharh al-Nukhba to our Sheikh except for a little, so he heard it by the reading of another.\" He died in the year (867 AH). Al-Jawahir wa al-Durar (3/1164), Al-Daw' al-Lami' (9/248). \n2. He is Ahmad bin Muhammad bin Muhammad, Al-Shihab Ibn al-Akhsasi al-Dimashqi. Born in the year eight hundred and eighteen in Damascus, and grew up there memorizing the Quran and reading Fiqh. He is a student of Ibn Hajar. Al-Sakhawi, may Allah have mercy on him, said: \"He traveled and read Sharh al-Nukhba to our Sheikh by research, and he licensed him.\" He died in the year (889 AH). Al-Jawahir wa al-Durar (3/1083), Al-Daw' al-Lami' (2/194).",
    "book_id": "616",
    "new_page_number": 21
  },
  {
    "serial_number": "3382313",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "Year (852 AH) - about two months before the author's death -. Its scribe is the author's student: Mahmoud Ibn Ismail al-Ayni (1). The Seventh Copy, symbolized by (S): It is a manuscript preserved in the Hagia Sophia Library; within the Suleymaniye Library in Istanbul - Turkey -, under number (440/1). Date of its copying: Year (857 AH). Its scribe: Yahya bin Abdul Ghani al-Imam. It is read to Sheikh Uthman al-Dimi - student of the author - a reading of research and verification, and bears his handwriting and license. The Eighth Copy, symbolized by (A): It is a manuscript preserved in the Esad Efendi Library; within the Suleymaniye Library in Istanbul - Turkey -, under number (3951). Date of its copying: Safar, year (869 AH). Its scribe: Ahmad bin Sha'ban bin Ali bin Sha'ban bin Muhammad al-Ansari (2). It is copied from a copy read to the author, a reading of research and bearing his handwriting. It is also read to Sheikh Uthman al-Dimi - student of the author - a reading of research and scrutiny, and bears his handwriting and license.",
    "foot_note": "1. He is Muzaffar al-Din, Mahmoud bin Ahmad bin Hasan bin Ismail al-Ayni al-Qahiri al-Hanafi, known as Ibn al-Amshati. Born around the year (812 AH). He worked with Fiqh, and excelled in Medicine and authored in it. He heard from a group like Al-Hafiz Ibn Hajar and others. He died in the year (902 AH). Al-Daw' al-Lami' (10/128), Al-Badr al-Tali' (2/293). \n2. Ahmad bin Sha'ban bin Ali, Al-Shihab al-Ansari, al-Ghazzi al-Shafi'i, known as Ibn Sha'ban al-Kasani. He grew up in Gaza, memorizing the Quran, Al-Minhaj al-Far'i, Jam' al-Jawami', the two Alfiyyas of Hadith and Grammar, and others. He excelled and mastered arts, composed poetry and benefitted (others), and engaged in teaching and Fatwa, so a group benefited from him, with protection, goodness, and uprightness. He came to Cairo and took from Al-Sakhawi, the student of Ibn Hajar. Al-Daw' al-Lami' (1/312).",
    "book_id": "616",
    "new_page_number": 22
  },
  {
    "serial_number": "3382314",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "Name of the Book. The author, may Allah have mercy on him, stated the name of his book with a clear text, which is the name agreed upon by most manuscripts, and appearing in most licenses, seals, explanations, biographical books, catalogs, and the like of places to know the book's name. Therefore, I adopted it, which is: \"Nukhbat al-Fikar fi Mustalah Ahl al-Athar\". He, may Allah have mercy on him, stated the book's name in the introduction of his book: \"Nuzhat al-Nazar fi Tawdih Nukhbat al-Fikar\"; saying: \"Some brothers asked me to summarize for them the important (aspects) of that; so I summarized it in nice papers, I named it: Nukhbat al-Fikar fi Mustalah Ahl al-Athar.\" (1).",
    "foot_note": "1. See: Al-Majma' al-Mu'assis lil-Mu'jam al-Mufahras (3/302, 342, 366).",
    "book_id": "616",
    "new_page_number": 23
  },
  {
    "serial_number": "3382315",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "Biography of Al-Hafiz Ibn Hajar al-Asqalani, may Allah have mercy on him (1). His Name and Lineage: Abu al-Fadl Shihab al-Din, Ahmad bin Ali bin Muhammad bin Muhammad bin Ali bin Mahmoud Ibn Hajar al-Asqalani, al-Masri, al-Shafi'i. His Birth: He was born in Sha'ban, year seven hundred and seventy-three (773 AH) in Egypt. He grew up there as an orphan, memorizing the Quran, Al-Umdah, Alfiyyat al-Iraqi, Al-Hawi Al-Saghir, Mukhtasar Ibn al-Hajib, and others, while he was nine years old. His Travels and Most Famous Sheikhs: He, may Allah have mercy on him, traveled much seeking knowledge, spending his time and money for it. He traveled within Egypt, taking from its senior Sheikhs, and also traveled to the lands of Hijaz, Yemen, Sham, Aleppo, and others.",
    "foot_note": "1. See his biography in: Dhayl al-Taqyid fi Ruwat al-Sunan wa al-Masanid by Al-Fasi (1/352), Lahz al-Alhaz by Ibn Fahd (p. 211), Al-Manhal al-Safi wa al-Mustawfa ba'd al-Wafi by Yusuf bin Taghri Bardi (2/17), Al-Daw' al-Lami' (2/36), Tadhkirat al-Huffaz wa Tabsirat al-Ayqaz by Ibn al-Mibrad al-Hanbali (p. 37) (printed within Majmu' Rasa'il Ibn Abd al-Hadi), Tabaqat al-Huffaz (552), and its Dhayl (251), and Nazm al-Iqyan fi A'yan al-A'yan; all three by Al-Suyuti (1/45), Shadharat al-Dhahab fi Akhbar man Dhahab by Ibn al-Imad (1/74), Al-Badr al-Tali' (1/87), and the most extensive: the book of his student Al-Sakhawi: Al-Jawahir wa al-Durar fi Tarjamat Shaykh al-Islam Ibn Hajar.",
    "book_id": "616",
    "new_page_number": 24
  },
  {
    "serial_number": "3382316",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "Among his most prominent Sheikhs: - Ibrahim al-Tanukhi (800 AH). - Burhan al-Din al-Abnasi (802 AH). - Ibn al-Mulaqqin (804 AH). - Siraj al-Din al-Bulqini (805 AH). - Abd al-Rahim al-Iraqi (806 AH). - Nur al-Din al-Haythami (807 AH). - Muhammad bin Ya'qub al-Fayruzabadi (817 AH). - Izz al-Din Ibn Jama'ah (819 AH). And many others. His Most Famous Students: - Muhibb al-Din Ibn al-Shihnah (815 AH). - Al-Kamal bin al-Humam (861 AH). - Ibn Taghri Bardi (874 AH). - Qasim bin Qutlubugha (879 AH). - Burhan al-Din al-Biqa'i (885 AH). - Shams al-Din al-Sakhawi (902 AH). - Zakariyya al-Ansari (926 AH). And many others.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 25
  },
  {
    "serial_number": "3382317",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "Scholars' Praise of Him: - Al-Hafiz Al-Iraqi, may Allah have mercy on him, said: \"The scholar Sheikh, the perfect virtuous one, the Imam Muhaddith, the beneficial glorifier, the precise Hafiz, the controller, the trustworthy, the safe.\" (1). - Muhammad Al-Fasi, may Allah have mercy on him, said: \"He is the most memorizing of the people of the age for hadiths and traditions (Athar), and names of narrators; the earlier and later among them, and the high and low of that, with strong knowledge of hadith defects, and good excellence in Fiqh and other things.\" (2). - Ibn Nasir al-Din, may Allah have mercy on him, said: \"A Muhaddith Hafiz.\" (3). - Ibn Fahd, may Allah have mercy on him, said: \"The Allama Imam, Hafiz, unique of the time, pride of the age, remnant of Huffaz, banner of the prominent Imams, support of investigators, seal of the distinguished Huffaz, and famous judges.\" (4). - Yusuf bin Taghri Bardi, may Allah have mercy on him, said: \"Sheikh al-Islam, Hafiz of the age, journey of the seekers, Mufti of sects, Commander of the Faithful in Hadith.\" (5). - Al-Sakhawi, may Allah have mercy on him, said: \"Sheikh al-Islam, and the unique of the prominent Imams, Hafiz of the age, and seal of the Mujtahids... bearer of the banner of sciences and tradition.\" (6).",
    "foot_note": "1. Al-Jawahir wa al-Durar (1/270). \n2. Dhayl al-Taqyid (1/355). \n3. Tawdih al-Mushtabah (3/128). \n4. Lahz al-Alhaz (211). \n5. Al-Manhal al-Safi (2/17). \n6. Al-Jawahir wa al-Durar (1/53).",
    "book_id": "616",
    "new_page_number": 26
  },
  {
    "serial_number": "3382318",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "- He also said: \"The ancients testified to his memorization, trustworthiness, integrity, complete knowledge, burning mind, excessive intelligence, and breadth of knowledge in various arts. His Sheikh Al-Iraqi testified that he was the most knowledgeable of his companions in Hadith.\" (1). - Al-Hafiz Al-Suyuti, may Allah have mercy on him, said: \"Unique of his time, and bearer of the banner of Sunnah in his era, the gold of this age and its pure gold, and its jewel whose pride stood firm over many ages, Imam of this art for followers, and commander of the armies of Muhaddithin, and support of existence in weakening and authenticating, and the greatest of witnesses and judges in the chapters of praise and criticism.\" (2). - Imam Al-Shawkani, may Allah have mercy on him, said: \"He undertook spreading Hadith, and restricted himself to it in reading, teaching, and authoring, and was unique in that. The near and far, the enemy and friend testified to his memorization and precision; until applying the title 'Al-Hafiz' to him became a word of consensus.\" (3). His Works: They are very many; among them: - \"Fath al-Bari Sharh Sahih al-Bukhari\". - \"Huda al-Sari Muqaddimat Fath al-Bari\".",
    "foot_note": "1. Al-Daw' al-Lami' (2/39). \n2. Nazm al-Iqyan (1/45). \n3. Al-Badr al-Tali' (1/88).",
    "book_id": "616",
    "new_page_number": 27
  },
  {
    "serial_number": "3382319",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "- \"Al-Tamyiz fi Talkhis Takhrij Ahadith Sharh al-Wajiz; famous as (Al-Talkhis al-Habir)\". - \"Tahdhib al-Tahdhib\". - \"Taqrib al-Tahdhib\". - \"Tabsir al-Muntabih bi-Tahrir al-Mushtabah\". - \"Nukhbat al-Fikar fi Mustalah Ahl al-Athar\" which is this book of ours. - \"Nuzhat al-Nazar fi Tawdih Nukhbat al-Fikar fi Mustalah Ahl al-Athar\". - \"Al-Durar al-Kaminah fi A'yan al-Mi'ah al-Thaminah\". - \"Al-Nukat 'ala Kitab Ibn al-Salah\". - \"Bulugh al-Maram min Adillat al-Ahkam\". - \"Al-Isabah fi Tamyiz al-Sahabah\". - \"Lisan al-Mizan\". - \"Inba' al-Ghumr bi-Abna' al-Umr\". - \"Ithaf al-Maharah bi-l-Fawa'id al-Mubtakarah min Atraf al-Asharah\". His Death: He, may Allah have mercy on him, died after being ill for more than a month, on Saturday night, in the end of Dhu al-Hijjah, year eight hundred and fifty-two (852 AH).",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 28
  },
  {
    "serial_number": "3382320",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "Samples of Manuscripts",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 29
  },
  {
    "serial_number": "3382321",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "Image of the first plate of the National Library copy in Paris (A)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 30
  },
  {
    "serial_number": "3382322",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "Image of the second plate of the National Library copy in Paris (A)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 31
  },
  {
    "serial_number": "3382323",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "Image of the last plate of the National Library copy in Paris (A)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 32
  },
  {
    "serial_number": "3382324",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "Image of the first plate of the Egyptian National Library (Dar al-Kutub) copy within Tal'at collections (B)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 33
  },
  {
    "serial_number": "3382325",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "Image of the last plate of the Egyptian National Library (Dar al-Kutub) copy within Tal'at collections (B)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 34
  },
  {
    "serial_number": "3382326",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "Image of the first plate of the Hagia Sophia Library copy within the Suleymaniye Library (C)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 35
  },
  {
    "serial_number": "3382327",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "Image of the last plate of the Hagia Sophia Library copy within the Suleymaniye Library (C)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 36
  },
  {
    "serial_number": "3382328",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "Image of the first plate of the Egyptian National Library (Dar al-Kutub) copy within Tal'at collections (D)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 37
  },
  {
    "serial_number": "3382329",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "Image of the second plate of the Egyptian National Library (Dar al-Kutub) copy within Tal'at collections (D)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 38
  },
  {
    "serial_number": "3382330",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "Image of the last plate of the Egyptian National Library (Dar al-Kutub) copy within Tal'at collections (D)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 39
  },
  {
    "serial_number": "3382331",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "Image of the first plate of the Escorial Library copy (E)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 40
  },
  {
    "serial_number": "3382332",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "Image of the last plate of the Escorial Library copy (E)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 41
  },
  {
    "serial_number": "3382333",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikar fi Mustalah Ahl al-Athar",
    "edition": "Second, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "Image of the first plate of the Taymuriyya Library copy at the Egyptian National Library (F)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 42
  },
  {
    "serial_number": "3382334",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "Image of the last folio of the Taimuriyya Library manuscript at the Egyptian National Library (Waw).",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 43
  },
  {
    "serial_number": "3382335",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "Image of the first folio of the Raghib Pasha Library manuscript within the Süleymaniye Library (Zay).",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 44
  },
  {
    "serial_number": "3382336",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "Image of the last folio of the Raghib Pasha Library manuscript within the Süleymaniye Library (Zay).",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 45
  },
  {
    "serial_number": "3382337",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "Image of the first folio of the Atif Efendi Library manuscript within the Süleymaniye Library (Ha).",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 46
  },
  {
    "serial_number": "3382338",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "Image of the last folio of the Atif Efendi Library manuscript within the Süleymaniye Library (Ha).",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 47
  },
  {
    "serial_number": "3382339",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar (The Choice Thought on the Terminology of the People of Tradition) by Al-Hafiz Ahmad bin Ali Ibn Hajar Al-Asqalani, may Allah have mercy on him (d. 852 AH).",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 48
  },
  {
    "serial_number": "3382340",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful (1). Praise be to Allah, Who has never ceased to be All-Knowing, All-Powerful. May Allah send blessings upon our Master Muhammad, whom He sent (2) to (3) mankind (4) as a bringer of glad tidings and a warner, and upon his family (5)",
    "foot_note": "1. In A: \"He said - Our master and mawla, the Chief Judge, Sheikh al-Islam, Abu al-Fadl - Ahmad bin our master, the poor servant of Allah Almighty, Sheikh Nur al-Din Abu al-Hasan Ali Ibn Hajar al-Asqalani al-Shafi'i.\" In B: \"My Lord, make easy and help, O Generous One. He said - The Sheikh, the Imam, the Allamah, the Rihla (one traveled to for knowledge), the unique of the age and the peerless of the time, Shihab al-Din - Ahmad bin Ali Ibn Hajar al-Asqalani, may Allah extend his term and dwell him in the midst of His Paradise.\" In C, an addition: \"My Lord, make easy.\" In D: \"My Lord, make easy, O Generous One.\" In E, an addition: \"May Allah bless our master Muhammad and grant him abundant peace.\" In W, an addition: \"My Lord, make easy and help. He said - The sea of benefits, our master, the Sheikh, the Imam, the Scholar, the Practitioner, the Allamah, Shihab al-Din, Abu al-Fadl - Ahmad bin Ali bin Muhammad al-Asqalani, famous as Ibn Hajar al-Shafi'i, may Allah be pleased with him and please him, and make Paradise his abode, by [the right/status of] Muhammad and his family\" (a). (a) Supplicating with this formula is not legislated; Sheikh Abdul Aziz Ibn Baz, may Allah have mercy on him, said in Fatawa Nur 'ala al-Darb (2/128): \"Seeking intercession (Tawassul) by the status (Jah) of the Prophet, or by the right of the Prophet, or by the status of the prophets, or by the right of the prophets, or by the status of the believers; all of this is not legislated; rather, it is an innovation (Bid'ah).\" In Z, an addition: \"The Book Nukhbat al-Fikr fi Mustalah Ahl al-Athar. He said - Our master and our sheikh, Sheikh al-Islam, Chief Judge, Hafiz of the Age, Shihab al-Din - Ahmad al-Asqalani al-Kinani al-Shafi'i, famous by attribution as Ibn Hajar, Allah's mercy be upon him.\"\n2. In Z: \"arsala\" (He sent [without pronoun]).\n3. In A: From here the lacuna begins, up to his saying: \"and the ranks of disparagement (Jarh).\"\n4. In E: \"with the truth\" instead of \"to mankind.\"\n5. In B, C, D, H: \"and upon the family of Muhammad,\" and in E: \"and may Allah bless the family of Muhammad\" instead of \"and upon his family.\"",
    "book_id": "616",
    "new_page_number": 49
  },
  {
    "serial_number": "3382341",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "and his companions (1) and grant them abundant peace. As for what follows: Indeed, the compilations on the terminology (2) of the people of Hadith have become numerous, expanded, and abridged. So some of the brethren (3) asked me to summarize for him (4) the important [aspects] of that. So I answered him to his request, hoping to be included in those paths [of the scholars].",
    "foot_note": "1. \"And his companions\" is missing from B.\n2. In W: \"Mustalah\" (terminology - synonym).\n3. In W: \"My brethren.\"\n4. In B, D: \"for them\"; but the context implies the singular due to the sentences following it.",
    "book_id": "616",
    "new_page_number": 50
  },
  {
    "serial_number": "3382342",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "So I say: * The Report (Al-Khabar): Either it has paths (1) without (2) a specific number, or with a restriction (3) to more than two, or to two, or to one. So the first: is the Mutawatir (Mass Transmitted), which imparts certain knowledge with its conditions. And the second: is the Mashhur (Famous), which is the Mustafid (Diffused) (4) - according to one opinion. And the third (5): is the Aziz (Rare/Strong), and it is not a condition for the Sahih (Authentic) - contrary to who claimed it. And the fourth: is the Gharib (Strange). And all of them - except the first - are Ahad (Solitary). And among them are the Accepted (Maqbul) and the Rejected (Mardud) (6); because reasoning with them (7) depends on investigating the conditions of their narrators - unlike the first (8). And there may occur within them what imparts theoretical knowledge through contextual indicators - according to the chosen view.",
    "foot_note": "1. In C: \"Taraf\" (extremities); which is a distortion. In E: \"comes from paths\" instead of \"has paths.\"\n2. In B, W, an addition: \"Hasr\" (restriction).\n3. \"Restriction\" is missing from W.\n4. In B: \"and the Mustafid,\" and in C: \"Al-Mustafiz\" with the letter Za'. Al-Razi, may Allah have mercy on him, said in Mukhtar al-Sihah under root: F-Y-D (p. 245) -: \"Mustafid; meaning: spread among people.\"\n5. In E: \"The third.\"\n6. In W: \"And within them is the rejected.\"\n7. In C: \"Bihima\" (with both), and what is established agrees with the author's commentary.\n8. \"Unlike the first\" is missing from B.",
    "book_id": "616",
    "new_page_number": 51
  },
  {
    "serial_number": "3382343",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "Then the Strangeness (Gharabah): Either it is (1) in the origin (2) of the chain (Sanad), or not. So the first: is the Absolute Fard (3) (Absolute Solitary). And the second: is the Relative Fard (4) (Relative Solitary), and applying the term \"Fardiyyah\" (Singularity) to it is rare.",
    "foot_note": "1. In E: \"The Gharib: Either it is\" instead of \"The Strangeness: Either it is.\"\n2. \"Origin\" is missing from C.\n3. In Z: \"Al-Mufrad\" (The Single).\n4. In Z: \"Al-Mufrad,\" and \"Al-Fard\" is missing from E.",
    "book_id": "616",
    "new_page_number": 52
  },
  {
    "serial_number": "3382344",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "* And the Solitary Report (Khabar al-Ahad) transmitted by an upright (Adl) person, with complete precision (Dabt), with a connected (1) chain, neither (2) defective (Mu'allal) nor anomalous (Shadh): is the Sahih (Authentic) in itself (Li-Dhatihi). Its ranks vary (3) according to the variation of these descriptions. Hence, Sahih Al-Bukhari is prioritized, then Muslim (4), then what meets their conditions (5). But if the precision is light (6): then it is the Hasan (Good) in itself (Li-Dhatihi), and with a multitude of paths, it becomes Sahih. If they [Sahih and Hasan] are combined, then it is due to hesitation (8) regarding the transmitter where there is singularity (9), otherwise (10) it is considering two chains.",
    "foot_note": "1. In W: \"Muttasil\" with Kasrah on Lam and Dammah, not vocalized in the rest of copies, and vocalized with Nasb (Fatha) in one of the Nuzhah copies. Al-Qari, may Allah have mercy on him, said in Sharh Sharh al-Nukhbah (p. 243) -: \"With Nasb as a Hal (circumstantial accusative) from (the transmission), for it is an object in meaning as we indicated, or from the subject - which is (the Solitary Report) - according to the view permitting it as is Sibawayh's opinion, and it is said: an adjective; if estimating the connected definite noun is allowed, but most prevented it.\" See: Qada' al-Watar in Nuzhat al-Nazar (2/664).\n2. In W: \"Ghayri\" with Kasrah on Ra', and what is established is from D.\n3. In H: \"Yatafawatu\" with Ya'.\n4. In D: \"Muslimun\" with Raf' (Nominative), and what is established is from C, W. Al-Qari, may Allah have mercy on him, said in Sharh Sharh Nukhbat al-Fikr (p. 282) -: \"With Jarr (Genitive); conjoined to (Al-Bukhari), by omitting the annexed noun - in the text -, and he explicitly mentioned this omitted part in the explanation.\"\n5. In D: \"Shurutuhuma\" (their conditions - plural). \"Then Muslim, then their condition\" is missing from E.\n6. In E: \"If the precision is not complete\" instead of \"If the precision is light.\" The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"If the precision is light; meaning: less.\"\n7. In B: \"Then it is the Hasan.\"\n8. In C: \"Fa-li-taraddudin\" (so for a hesitation), and in E: \"Fa-la taradduda\" (then no hesitation).\n9. In C: \"Al-Tafarrudi\" with Jarr, and what is established is from D, W, H.\n10. \"Otherwise\" is missing from Z. The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"Otherwise, if hesitation does not occur.\"",
    "book_id": "616",
    "new_page_number": 53
  },
  {
    "serial_number": "3382345",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "And the addition of their narrator (1) is accepted as long as it does not contradict one who is more trustworthy. But if he is opposed by one more preponderant: then the preponderant is the Mahfuz (Preserved); and its opposite is the Shadh (Anomalous). And with weakness (2): the preponderant (3) is the Ma'ruf (Known); and its opposite is the Munkar (Denounced).",
    "foot_note": "1. In E: \"Rawatihima\" (their narrators), and in Z: \"Rawatiha\" (its narrators).\n2. In B, D: \"Al-Da'if\" (The weak one).\n3. In Z: \"Fal-rajih\" (So the preponderant) with an added Fa', which is among what the author added in Al-Nuzhah.",
    "book_id": "616",
    "new_page_number": 54
  },
  {
    "serial_number": "3382346",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "And the Relative Fard (1) (Solitary): If another agrees with him: then it (2) is the Mutabi' (3) (Follow-up). And if a text is found resembling it (4): then it is the Shahid (Witness). And tracking the paths (5) for that: is the I'tibar (Consideration).",
    "foot_note": "1. In E: \"And the Mufrad.\"\n2. In B: \"Huwa\" without Fa'.\n3. In Z: \"Al-Tabi'\" (The Follower); which is an error, and in E: \"Al-Mutaba'\" with Fatha on Ba', and the established vocalization is from B, D, which agrees with the author's saying in Nuzhat al-Nazar-: \"With Kasrah on the unified letter (Ba').\"\n4. In Z: \"Bi-shibhihi\" (with its likeness), and in H: \"Yushabihuhu\" (resembles it).\n5. In H: \"Al-Turuqu\" with Raf'; which is an error.",
    "book_id": "616",
    "new_page_number": 55
  },
  {
    "serial_number": "3382347",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "Then the Accepted (Maqbul): If it is free from contradiction: then it is the Muhkam (Decisive). And if it is opposed by its like: then if reconciliation is possible: it is Mukhtalif (1) al-Hadith (Divergent Hadith). Or if the later one is established (2): then it is the Nasikh (Abrogating), and the other is the Mansukh (Abrogated). Otherwise, preference (Tarjih) (3), then suspension (Tawaqquf).",
    "foot_note": "1. In B, D, H: \"Mukhtalaf\" with Fatha on Lam, and the established is from E. Al-Qari, may Allah have mercy on him, said in Sharh Sharh Nukhbat al-Fikr (p. 363) -: \"(Mukhtalif): With Kasrah on Lam; meaning: The indication of its hadith differs, and what matches it corresponds: (then it is the Nasikh). Some vocalized it: with Fatha on Lam; a mim-masdar, and what suits it is his saying later: (then Preference).\"\n2. In E: \"Yathbutu\" (is established - verb), and in H: \"wa in thabata\" (and if it is established). The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"If the later one is known and established by it...\"\n3. In W: \"Fa-yurajjahu\" (then it is preferred), and in B: \"wa illa fa-la\" (otherwise no) instead of \"Otherwise, preference.\" The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"Then preference if it is determined.\"",
    "book_id": "616",
    "new_page_number": 56
  },
  {
    "serial_number": "3382348",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "* Then the Rejected (Mardud): Either it is due to an omission (Saqt) (1) or a criticism (Ta'n). So the omission (2): is either (3) from (4) the beginning of the chain from a compiler (5), or from its end after the Tabi'i (Successor), or (6) other than that. So the first: is the Mu'allaq (Hanging). And the second: is the Mursal (Hurried). And the third: if it is by two or more consecutively: then it is the Mu'dal (Problematic), otherwise it is the Munqati' (Broken). Then it may be clear or hidden: So the first: is perceived by the lack of meeting, hence the need for history. And the second: is the Mudallas (Obfuscated), and it comes with a formula implying (7) meeting (8): like \"An\" (From) and \"Qala\" (He said). And likewise the Mursal Khafi (Hidden Mursal) from a contemporary who did not meet (9).",
    "foot_note": "1. In B, D: \"Li-Saqatin\" with Fatha on Qaf, and the correct is Sukun on Qaf, see: Sharh Sharh al-Nukhbah (p. 388) by Al-Qari. In H: \"Li-Siqtin\" with Kasrah on Sin, and the established is from W.\n2. In B, D: \"Fal-Saqatu\" with Fatha on Qaf.\n3. \"Imma\" (Either) is missing from Z.\n4. In W: From his saying: \"Fal-Saqt\" to here did not appear due to restoration.\n5. In Z: \"Munsif\" (Just/Half); which is a distortion.\n6. In B, addition: \"Min\" (From).\n7. In B: \"Tahtamilu, Yahtamilu\" (she implies, he implies) with Ta' and Ya' together. The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"And the Mudallas comes with a formula of performance formulas implying the occurrence of meeting.\"\n8. In E: \"Al-Liqa'\" (Meeting).\n9. In D: \"Yulqa\" with Damma on Ya', and \"from a contemporary who did not meet\" is missing from H, and the established is from B.",
    "book_id": "616",
    "new_page_number": 57
  },
  {
    "serial_number": "3382349",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "Then the Criticism (Ta'n): Either (1) it is due to the narrator's lying, or his accusation of that, or excessive error, or negligence, or immorality (Fisq), or delusion (Wahm) (2), or opposition, or ignorance (3), or innovation, or poor memory. So the first: is the Mawdu' (Fabricated). And the second: is the Matruk (Abandoned) (4). And the third: is the Munkar (Denounced) - according to one opinion. And likewise the fourth and the fifth. Then the delusion: if it is discovered through contextual indicators and gathering paths: then it is the Mu'allal (Defective) (5).",
    "foot_note": "1. \"An\" (that) is missing from Z.\n2. Note: Al-Laqqani said - in Qada' al-Watar (3/1019) -: \"It appears that (Al-Wahm) here: means the mind going to what is intended as something else; not meaning error, nor meaning omission. Otherwise, it would have been necessary to express it as Iham (creating illusion), or repetition would be necessary with the mention of error. Upon contemplating the commentator's saying: 'That he narrates... etc.', intending any of these meanings is not applicable at all; so let it be contemplated seriously.\"\n3. In E, H: \"Ignorance of his state,\" and the established agrees with the author's explanation.\n4. In Z: \"Al-Matrak\"; which is a distortion.\n5. In D: \"Al-Mu'allali\" with Kasrah; which is a mistake.",
    "book_id": "616",
    "new_page_number": 58
  },
  {
    "serial_number": "3382350",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "Then the Opposition (Mukhalafah): If it is (1) by changing (2) the context: then it is Mudraj (Interpolated) (3) of the chain. Or by merging (4) a suspended (Mawquf) (5) with a raised (Marfu') one: then it is Mudraj of the text. Or by advancing and delaying (6): then it is the Maqlub (Inverted). Or by adding a narrator: then it is Mazid fi Muttasil al-Asanid (Addition in Connected Chains) (7). Or by replacing him with no preponderator: then it is the Mudtarib (Disordered), and (8) replacement may occur deliberately for testing. Or by changing (9) letters while the script remains: then it is the Musahhaf (Misread) and the Muharraf (Distorted) (10). And it is not permissible to deliberately change (11) the text by reduction or synonym, except for a knowledgeable person (12) regarding what alters (13) meanings. If the meaning is hidden: there is a need for explaining the Strange (Gharib) and clarifying the Problematic (Mushkil) (14).",
    "foot_note": "1. \"If it is\" is missing from W.\n2. In Z: \"Bi-Taghayyur\" (by change). The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"The one in which that change occurs is: Mudraj of the chain.\"\n3. In Z: \"Wa Mudraj\" (And Mudraj).\n4. In H: \"Bi-Damjin\" with genitive tanween; which is a mistake.\n5. In E: \"Mawqufan\"; which is an error.\n6. In W, D: \"Or delaying.\"\n7. In E: \"Al-Masanid\" (The Musnads), and in Z: \"Al-Isnad\" (The Chain).\n8. \"And may\" is missing from Z.\n9. In W: \"Taghyiru\" without Ba', and in Z: \"Bi-Taghayyur.\" The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"Or if the opposition is by changing a letter or letters.\"\n10. In Z: \"Fal-Muhraf.\"\n11. In Z: \"The change by reduction\" instead of \"changing the text by reduction,\" and \"changing\" is missing from W, and written in its margin: \"Perhaps: deliberate changing.\"\n12. In W: \"Li-l-Alim\" (For the scholar).\n13. In H: \"Yahilu\" with Fatha on Ya'; which is a mistake.\n14. In Z, an addition: \"Minha\" (Of it), and in E: a blank space in its place, and it is from within Nuzhat al-Nazar.",
    "book_id": "616",
    "new_page_number": 59
  },
  {
    "serial_number": "3382351",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "Then Ignorance (Jahalah): And its cause is: That the narrator may have many descriptions, so he is mentioned by other than what became famous (1) about him for a purpose, and they compiled the Mudih (Clarifier) regarding it (2). And he (3) may be scarce [in narration] so taking from him is not frequent (4), and they compiled the Wuhdan (Singulars) regarding it (5) (6). Or he is not named (7) for abbreviation, and in it are the Mubhamat (Obscure Ones), and the obscure one is not accepted even if obscured with a word of endorsement (Ta'dil) (8) - according to the most correct view. If he is named (9) and one person (10) is solitary in narrating from him: then he is Majhul al-Ayn (11) (Unknown in Person). Or two (12) or more, and he is not (13) authenticated: then he is Majhul al-Hal (Unknown in Condition), which is the Mastur (Veiled) (14).",
    "foot_note": "1. In B, D, E: \"Ma Ishtahara\" with Fatha on Ta' and Ha', not vocalized in other copies.\n2. From his saying: \"His descriptions may be many so he is mentioned...\" to here is missing from C.\n3. In C: \"Qad\" without Waw.\n4. In W: \"Fa-la yukthiru\" with Damma on Ya' and Kasra on Tha', and the established is from D.\n5. In C, D, E: \"Wa fihi\" instead of \"Wa sannafu fihi.\" The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"And they compiled the Wuhdan regarding it.\"\n6. In Z: \"Al-Wahidan.\"\n7. In E: \"Or not and is named.\" The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"Or the narrator is not named - for abbreviation - by the one narrating from him.\"\n8. In W: \"Ta'dil\" (Endorsement).\n9. In Z, an addition: \"Rawin\" (a narrator); which is from within Nuzhat al-Nazar with the wording: \"Al-Rawi.\"\n10. In C: \"Wa Akhadha\" (And took); which is a distortion, and in B: \"Rawin\" (a narrator) instead of \"Wahidun\" (one), and in a copy in its margin: \"Wahid,\" and the established vocalization is from D, E, W. The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"And one narrator is solitary in narrating.\"\n11. \"Al-Ayn\" is missing from B.\n12. In E: \"Wa Ithnan\" (And two). The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"Or if two or more narrate from him.\"\n13. In H: \"Aw lam\" (Or not).\n14. \"Wa huwa al-Mastur\" is missing from B.",
    "book_id": "616",
    "new_page_number": 60
  },
  {
    "serial_number": "3382352",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "Then Innovation (Bid'ah): Either (1) causing disbelief (2), or causing immorality (3). So the first: The majority (5) do not accept its holder (4). And the second: One who is not a caller is accepted (6) - in the most correct view -, unless he narrates (7) what strengthens his innovation, then he is rejected - according to the chosen view -, and Al-Juzajani (8) - the Sheikh of Al-Nasa'i - stated this explicitly.",
    "foot_note": "1. In B, an addition: \"An takuna\" (To be).\n2. In E, Z: \"Bi-Kufrin\" (With disbelief).\n3. In E: \"Aw Bi-Fisqin\" (Or with immorality).\n4. In B: \"La yaqbaluhu\" (Does not accept him) instead of \"La yaqbalu sahibaha.\"\n5. In Z: \"Al-Majhul\" (The unknown); which is a distortion, and in B an addition: \"Wa qila: yuqbal\" (And it is said: he is accepted).\n6. In H: \"Ma\" (What).\n7. In B, W: \"Yarwi\" (He narrates).\n8. In D: \"Al-Jawzajani\" with Fatha on Jim, and the established is from H. Ibn Raslan, may Allah have mercy on him, said in Sharh Sunan Abi Dawud (12/372) -: \"(Al-Juzajani) with Damma on the first Jim, and Fatha on Zay and the lightened Jim, and after the Alif is Nun; ascribed to a city in Khurasan next to Balkh; called: Juzajan.\" See: Sharh Sharh al-Nukhbah by Al-Qari (p. 531).",
    "book_id": "616",
    "new_page_number": 61
  },
  {
    "serial_number": "3382353",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "Then Poor Memory: If it is inherent, then it is the Shadh (Anomalous) - according to one opinion -, or emerging, then it is the Mukhtalit (Mixed up) (1). And whenever (2) the Poor of Memory is followed up by a considerable [narration] (4) - and likewise the Mastur (Veiled) (5), the Mursal, and the Mudallas -: their hadith becomes Hasan (Good); not in itself, but by the aggregate.",
    "foot_note": "1. In E: \"Al-Mukhtalif\" (The Different); which is a distortion, and in B, D: \"Al-Mukhtalat\" with Fatha on Lam, and the established vocalization is from W. The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"So this is the Mukhtalit.\"\n2. In E: \"Wa idha\" (And if).\n3. In D: \"Sayyi'\" (Bad).\n4. In E: \"Fa-Mu'tabar\" (Then considerable). The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"And whenever the Poor of Memory is followed up by a considerable - such as being above him or like him, not below him... -.\"\n5. In E: \"Al-Mashhur\" (The Famous), and in B: \"And likewise the Mukhtalit and the Mastur\" instead of \"And likewise the Mastur.\"",
    "book_id": "616",
    "new_page_number": 62
  },
  {
    "serial_number": "3382354",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "* Then the Chain of Transmission (Isnad): Either it ends to the Prophet, peace and blessings be upon him, explicitly, or by ruling (1): from his saying (2), or his action, or his approval. Or to the Companion likewise, and he is: whoever met the Prophet, peace and blessings be upon him (3), believing in him and died on Islam - even if apostasy intervened in (4) the most correct view (5). Or to the Tabi'i (Successor), and he is: whoever met the Companion likewise. So the first (6): is the Marfu' (Raised). And the second: is the Mawquf (Suspended) (8). And the third: is the Maqtu' (Cut) - and whoever (9) is below the Tabi'i (10) in it: is like him. And the last two are called: The Athar (Trace) (11).",
    "foot_note": "1. In E: \"Kinayah\" (Metonymy). The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"And an example of the Marfu' from speech by ruling, not explicitly.\"\n2. In A, Z, an addition: \"Peace and blessings be upon him,\" and \"from his saying\" is missing from E.\n3. \"The Prophet, peace and blessings be upon him\" is missing from Z.\n4. In W, H: \"Ala\" (Upon/In).\n5. \"In the most correct view\" is missing from E.\n6. In B: \"And the first,\" and \"So the first\" is missing from Z.\n7. In E: \"Marfu'.\"\n8. In E: \"Mawquf.\"\n9. In H: \"Min\" with Kasrah on Mim; which is a mistake.\n10. In C: \"The Companion.\" The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"And whoever is below the Tabi'i - from the followers of the Tabi'in and those after them -.\"\n11. \"And the last two are called: The Athar\" is missing from Z.",
    "book_id": "616",
    "new_page_number": 63
  },
  {
    "serial_number": "3382355",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "* And the Musnad (Connected): is the Marfu' of a Companion with a chain whose appearance is continuity. If its number [of narrators] is few: then either it ends (1) to the Prophet, peace and blessings be upon him, or to an Imam with a lofty characteristic like \"Shu'bah\". So the first: is the Absolute Elevation (Uluww Mutlaq). And the second: is the Relative Elevation (2) (Uluww Nisbi). In it is Muwafaqah (Agreement); which is (3): Reaching the Sheikh of one of the compilers from other than his path. And Badal (Substitute) (4); which is: Reaching the Sheikh of his Sheikh likewise (5). And Musawah (Equality) (6); which is: The equality of the number (7) of the chain (8) from the narrator to its end, with the chain of one of the compilers. And Musafahah (Handshaking) (9); which is: Equality with the student of that compiler. And Elevation with its types (10) corresponds to: Descent (Nuzul).",
    "foot_note": "1. In E, H: \"Yakunu\" (Is), and in the author's explanation: \"Yantahi\" (Ends).\n2. \"Elevation\" is missing from B, Z.\n3. In E: \"Wa huwa\" (And it is).\n4. In B, Z, H: \"Wa fihi al-Badal\" (And in it is Badal), which is from within Nuzhat al-Nazar, and likewise the next two places.\n5. \"Likewise\" is missing from W.\n6. In B, Z: \"Wa fihi al-Musawah.\"\n7. In C: \"Adadu\" with Damma on Dal; which is an error; because it is genitive construct.\n8. In C: \"Al-Isnadayn\" (The two chains), in W: \"Al-Asanid\" (The chains), and in Nuzhat al-Nazar: \"Al-Isnad.\"\n9. In B, Z: \"Wa fihi al-Musafahah.\"\n10. In Z: \"Bi-Aqsam\" (With types). The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"And Elevation with its mentioned types corresponds to.\"",
    "book_id": "616",
    "new_page_number": 64
  },
  {
    "serial_number": "3382356",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "If the narrator and the one he narrates from share in age and meeting (1), it is: Al-Aqran (2) (Peers). If each of them narrates from the other: it is Al-Mudabbaj (3) (Mutual). And if he narrates (4) from one (5) below him: then it is Seniors from Juniors (Al-Akabir 'an Al-Asaghir), and of it (6): Fathers from Sons; and in its reverse is abundance (7), and of it (8): Who narrates from his father from his grandfather (9). And if (10) two share in a Sheikh, and the death of one of them precedes; then it is: The Former and the Later (Al-Sabiq wa Al-Lahiq). And if he narrates from two agreeing in name, and they are not distinguished (11): then by his specifying (12) one of them, the Neglected (13) (Muhmal) becomes clear.",
    "foot_note": "1. In C: \"Aw Al-Luqi\" (Or meeting), in D, W, H: \"Aw fi Al-Luqi\" (Or in meeting), and in E: \"Aw fi Al-Liqa'\" (Or in meeting). The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"And Al-Luqi: It is taking from Sheikhs.\"\n2. In E: \"Al-Iqrar\" (Confession); which is a distortion. The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"So it is the type called: Narration of Peers; because then he narrates from his peer.\"\n3. In W: \"Fa-huwa Al-Mudabbaj\" (Then it is Al-Mudabbaj).\n4. \"Narrates\" is missing from Z.\n5. In W, an addition: \"Huwa\" (He).\n6. In B: \"Wa fihi\" (And in it).\n7. In H: \"Kathirah\" (Many); which is an error.\n8. In E: \"Wa minhum\" (And of them); which is an error.\n9. \"And of it: Who narrates from his father from his grandfather\" is missing from Z.\n10. In E: \"Fa-in\" (So if).\n11. In W: \"Yumayyaza\" (Are distinguished), and \"and they are not distinguished\" is missing from B.\n12. In Z: \"Fa-bi-inkhifadihi\" (Then by his lowering); which is an error.\n13. In Z: \"Bi-tabayyun\" (By clarification); which is a distortion.",
    "book_id": "616",
    "new_page_number": 65
  },
  {
    "serial_number": "3382357",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "And if the Sheikh denies what he narrated decisively: it is rejected, or possibly (1): it is accepted - in the most correct view -, and in it: is one who narrated and forgot. And if the narrators agree (2) in the formulas of performance, or other than that of states (3); then it is Al-Musalsal (Patterned/Chained).",
    "foot_note": "1. In D: \"Wah-timalan\" (And possibly).\n2. In B: \"Ittafaqat\" (Agreed - feminine).\n3. In H: \"Al-Ahwal\" (Conditions).",
    "book_id": "616",
    "new_page_number": 66
  },
  {
    "serial_number": "3382358",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "* And the Formulas of Performance (1): \"Sami'tu\" (I heard) and \"Haddathani\" (He narrated to me), then \"Akhbarani\" (He informed me), and \"Qara'tu 'alayhi\" (I read to him), then \"Quri'a 'alayhi wa ana asma'u\" (It was read to him while I was listening), then \"Anba'ani\" (He informed me), then \"Nawalani\" (He handed to me), then \"Shafahani\" (He told me verbally), then \"Kataba ilayya\" (He wrote to me), then \"An\" (From) and its like. So the first two: are for one who heard alone from the wording of the Sheikh, and if gathered then with others (2). And the first of them: is the most explicit (3) and highest in dictation. And the third and fourth: are for one who read himself. And if gathered: then it is like the fifth (4). And Al-Inba' (5): is in the meaning of Al-Ikhbar (6), except in the convention of the later scholars; so it (7) is for Ijazah (License) (8) like \"An\". And the 'an'anah (saying \"from\") of a contemporary is carried (9) upon hearing except from a Mudallis (10), and it is said: proof of their meeting (11) is conditional even if once (12) - and it is the chosen view -.",
    "foot_note": "1. In D: \"Al-Ada'\" with Madd.\n2. In E: \"Jama'ah\" (Group) instead of \"others.\" The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"(If gathered) The narrator, meaning: ... then it is proof that he heard from him with others, and the Nun may be for grandeur but rarely.\"\n3. In E: \"Asrah\" (More explicit).\n4. In W: \"Al-Khamis\" (The fifth).\n5. In E: \"Al-Inba'\" with Raf' and Jarr; and Jarr is an error, and the established is from D.\n6. In D: \"And Al-Inba' is like Al-Ikhbar\" instead of \"And Al-Inba': is in the meaning of Al-Ikhbar.\"\n7. In Z: \"Fa-innahu\" (Then it is).\n8. In E, W: \"Al-Ijazah.\"\n9. In C: \"Mahmul\" (Carried - masculine).\n10. In W: \"Mudallis,\" and in E: \"Al-Mudallas\" with Fatha on Lam, and the established vocalization is from B, D, W.\n11. In Z: \"Liqa'iha\" (Her meeting). The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"Their meeting; meaning: The Sheikh, and the narrator from him.\"\n12. In W: \"Marratun\" with Raf', and the established is from C, D.",
    "book_id": "616",
    "new_page_number": 67
  },
  {
    "serial_number": "3382359",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "And they applied Al-Mushafahah (Verbal communication) (1) to the verbally uttered Ijazah, and Al-Mukatabah (Correspondence) to the written Ijazah (2). And they stipulated for the validity of Al-Munawalah (Handing over): its coupling with permission to narrate - and it is the highest type of Ijazah. And likewise they stipulated: permission (3) in Wijadah (Finding), Wasiyyah (Bequest) of the book (4), and I'lam (Notification) (5), otherwise there is no consideration for that - like the General Ijazah, and for the Unknown (6) and the Non-existent (7) - according to the most correct view in all of that.",
    "foot_note": "1. In E: \"Al-Mushafihah\" with Kasra on Fa'; which is a mistake.\n2. In W: \"Wal-Ijazah\" instead of \"Fi Al-Ijazah\"; which is an error.\n3. \"Permission\" is missing from W.\n4. In E: \"Bil-Kutub\" (Of books).\n5. In H: \"Wa fi Al-I'lam\" (And in notification).\n6. In D, E, W, Z: \"Wal-Majhul.\" The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"And likewise Ijazah for the unknown.\"\n7. In B, H: \"Wa lil-Ma'dum,\" and the addition of the preposition Lam is from within Nuzhat al-Nazar.",
    "book_id": "616",
    "new_page_number": 68
  },
  {
    "serial_number": "3382360",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "* Then the Narrators, if their names agree, and the names of their fathers upwards (1), and their persons differ: then it is Al-Muttafiq wa Al-Muftariq (Agreed and Separated). And if (2) the names agree in writing, and differ in pronunciation: then it is Al-Mu'talif wa Al-Mukhtalif (Consonant and Different). And if the names agree and the fathers differ (3), or vice versa: then it is Al-Mutashabih (Similiar) (4), and likewise if that (5) agreement occurs in the name and the father's name (6), and difference in the affiliation (Nisbah) (7). And types are composed (8) from it and from what is before it; among them: that agreement or similarity (9) happens, except in a letter or two letters, or by advancing and delaying (10), and the like (11) of that.",
    "foot_note": "1. \"Upwards\" is missing from E, H.\n2. In B: \"Fa-in\" (So if).\n3. In Z: \"Ikhtalafa\" (Differed - singular).\n4. In C: \"Al-Mushabih\"; which is a distortion.\n5. \"That\" is missing from H.\n6. In C, D: \"Ismin wa ismi abin\" instead of \"Fi al-ismi wa ismi al-abi.\"\n7. \"And likewise if that agreement occurs in the name and the father's name, and difference in the affiliation\" is missing from B, Z.\n8. In C, D, Z: \"Wa yurakkabu\" (And composed). The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"And composed from it.\"\n9. In E: \"Wal-Ishtibah.\"\n10. In B, E, W: \"Aw al-Ta'khir\" (Or delaying).\n11. In W, Z: \"Aw Nahwu\" (Or like).",
    "book_id": "616",
    "new_page_number": 69
  },
  {
    "serial_number": "3382361",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "Conclusion (1) * And of the important matters: Knowing the classes (Tabaqat) of narrators, their birth dates, their death dates (2), their lands, and their conditions - in terms of endorsement (Ta'dil), disparagement (Tajrih), and ignorance (Jahalah). And the Ranks of Disparagement (3): And the worst of them: Description with the elative form (Af'al) (4); like \"Akdhab al-Nas\" (The most lying of people) (5), then \"Dajjal\" (Imposter), or \"Wadda'\" (Fabricator), or \"Kadhdhab\" (Liar) (6). And the easiest of them: \"Layyin\" (Soft/Lenient), or \"Sayyi' al-Hifz\" (Poor of memory), or \"Fihi adna (7) Maqal\" (8) (In him is the slightest speech). And the Ranks (9) of Endorsement: And the highest of them: Description with the elative form; like \"Awthaq (10) al-Nas\" (The most trustworthy of people) (11).",
    "foot_note": "1. \"Conclusion\" is missing from H, and in its place is a blank space.\n2. In E: \"Wa wafatihim,\" and in B: \"Knowing the layers of Muhaddithin and their clients and tribes\" instead of \"Knowing the classes of narrators, their birth dates, and their death dates.\"\n3. Up to here ends the lacuna in A.\n4. In E: \"What implies exaggeration\" instead of \"Description with the elative form.\" The author, may Allah have mercy on him, said in Nuzhat al-Nazar -: \"And the worst of them: Description with what indicates exaggeration.\"\n5. In E: \"Kadhib al-Nas,\" and in D: \"Ka-Akdhaba al-Nasi\" with Nasb; which is an error.\n6. In E: \"Then what is emphasized like Kadhdhab Dajjal then this without emphasis\" instead of \"then Dajjal, or Wadda', or Kadhdhab,\" and the author did not mention it in Nuzhat al-Nazar.\n7. In W: \"Aw wa adna\" instead of \"Aw fihi adna,\" and in Z: \"Wa fihi adna,\" and \"Adna\" is missing from H.\n8. In E: \"Maqalun\" with Raf' Tanween, and the established vocalization is from A, C, D, W.\n9. In W: \"Wa Maratibu\" with Raf', and the established is from A, D.\n10. In D: \"Awthaqa\" with Jarr and Nasb, and the established is from A, W.\n11. In E: \"And the highest of them is what implies exaggeration: like Adyan al-Nas (The most religious of people)\" instead of \"And the highest of them: Description with the elative form: like Awthaq al-Nas,\" and the author did not mention it in Nuzhat al-Nazar.",
    "book_id": "616",
    "new_page_number": 70
  },
  {
    "serial_number": "3382362",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "Then what is emphasized (1) with an attribute (2) or two attributes (3) like \"Thiqah Thiqah\" (Trustworthy Trustworthy), or \"Thiqah Hafiz\" (Trustworthy Memorizer) (4). And the lowest of them: What indicates proximity to the easiest disparagement; like \"Sheikh\" (A Sheikh). And Tazkiyah (Vouching) is accepted from one knowledgeable of its causes, even from one person - in (5) the most correct view -. And Disparagement takes precedence over Endorsement if it is issued explained (6) from one knowledgeable of its causes. If it is devoid of endorsement, it is accepted (7) summarily - according to the chosen view -.",
    "foot_note": "1. In E: \"Wa ma ta'akkada,\" and in W: \"Thumma ta'akkudun\" instead of \"Thumma ma ta'akkada,\" and the established agrees with Nuzhat al-Nazar.\n2. In C: \"Bi-sifati\" with one Kasra; which is a mistake, and the established is from D, W.\n3. \"With an attribute or two attributes\" is missing from E.\n4. In E: \"Like Thiqah Hafiz, or Thiqah Thiqah\" with advancing and delaying.\n5. \"Ala\" (In) is missing from B, and in its place is a blank space.\n6. In H: \"Mubayyinan\" with Kasrah on Ya', and \"Mubayyanan\" is missing from E, Z, and the established is from B, W.\n7. \"Qubila\" (Accepted) is missing from Z.",
    "book_id": "616",
    "new_page_number": 71
  },
  {
    "serial_number": "3382363",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "* And knowing the Kunyas of those named (1), and the names of those known by Kunyas (2). And whose name is his Kunya. And whose Kunyas or descriptions are many. And whose Kunya agrees with his father's name, or vice versa (3), or his Kunya (4) is his wife's Kunya. And who is attributed to other than his father (5), or (6) to (7) other than what races to (8) the understanding (9). And whose name and his father's and grandfather's name agree (10) (11), or and the name (12) of his Sheikh and his Sheikh's Sheikh upwards. And whose Sheikh's name and the narrator from him agree.",
    "foot_note": "1. In C: \"Al-Musammiyin\" with two Yas, and in E, Z: \"Al-Muslimin\"; which is a distortion, and in D: \"Al-Musammin\" with Kasrah on the second Mim, and the established is from A, W.\n2. In C, E: \"Al-Mukanniyin\" with two Yas, and in B: \"Al-Maknin\" with Fatha on Mim, Sukun on Kaf, and Kasrah on Nun, and the established is from A, D, W.\n3. In C, E: \"Al-Aks.\"\n4. \"Kunyathu\" is missing from A.\n5. In B, Z, an addition: \"Like Al-Miqdad Ibn Al-Aswad,\" which is from within Nuzhat al-Nazar.\n6. In A, an addition: \"Nusiba.\"\n7. \"Ila\" is missing from D.\n8. \"Ila\" is missing from A.\n9. In B, an addition: \"Like Al-Hadhdha',\" and in C, D, E, W: \"Lil-fahm.\"\n10. In Z: \"Wafaqa,\" and the established agrees with what is in Nuzhat al-Nazar.\n11. \"Wa jaddihi\" is missing from B.\n12. In B, W: \"Ism.\"",
    "book_id": "616",
    "new_page_number": 72
  },
  {
    "serial_number": "3382364",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "* And knowing the Abstract and Singular Names (1), and likewise the Kunyas, Titles (Alqab), and Affiliations (Ansab) (2). And they occur (3) to tribes, and homelands - lands (4), or estates (5) and alleys (6), and neighborhood (7) -. And to crafts and trades. And Agreement and Similarity (9) occur in them (8) like names. And they may occur (10) as Titles. And knowing the reasons for that.",
    "foot_note": "1. In H: \"Al-Mufarradah\" with Tashdid on Ra'; which is an error.\n2. In Z: \"Wal-Intisab.\"\n3. In W, H: \"Wa yaqa'u\" with Ya'.\n4. \"Biladan\" is missing from B.\n5. In A, C, E: \"Wa diya'an\" with Waw of conjunction, and in W: \"Diya'an.\"\n6. In Z, H: \"Aw sikakan,\" and the addition of Hamza is from within Nuzhat al-Nazar.\n7. In Z, H: \"Aw mujawaratan,\" and the addition of Hamza is from within Nuzhat al-Nazar.\n8. In H: \"Fihi,\" and in D: \"Minha.\"\n9. In A, C, D, E, W: \"Al-Ishtibah wa Al-Ittifaq\" with advancing and delaying, and the established agrees with what is in Nuzhat al-Nazar.\n10. In W, Z, H: \"Yaqa'u\" with Ya', and in B, Z, an addition: \"Al-Ansab.\"",
    "book_id": "616",
    "new_page_number": 73
  },
  {
    "serial_number": "3382365",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "* And knowing the Mawali (1) from above, and from below (2), by slavery, or by alliance (3). * And knowing the Brothers and Sisters.",
    "foot_note": "1. In E: \"Al-Mawla.\"\n2. In Z, H: \"Wa asfala\" without \"Min,\" which is among what the author deleted from Nuzhat al-Nazar.\n3. In B, D: \"Aw bil-Halifi\" with Fatha on Ha' and Kasra on Lam, and in H: \"Bil-Khalf\"; which is a distortion, and in B an addition: \"Or by Islam,\" and the established is from A, E, W.",
    "book_id": "616",
    "new_page_number": 74
  },
  {
    "serial_number": "3382366",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "* And knowing the Etiquettes (1) of the Sheikh and the Student. And the age (2) of bearing (Tahammul) (3) and performance (Ada') (4). And the manner (5) of writing Hadith (6), its presentation, its hearing, and its recitation, and traveling (7) for it (8). And its compilation according to Musnads (9), or Chapters (10), or Defects (Ilal), or Peripheral Chains (Atraf) (11).",
    "foot_note": "1. In A, C, E, H: \"Adab.\"\n2. In A, C, D, E: \"Wa waqta sinni\" instead of \"Wa sinni,\" and in Z: \"Wa sunan\"; which is a distortion.\n3. In B: \"Wal-Tahammul\" instead of \"Wa sinni al-tahammul.\"\n4. In A, C, D, an addition: \"Wa sifatu al-dabti bil-hifzi wal-kitab,\" and in E, an addition: \"Wa sifatu al-dabti bil-hifzi wal-katbi,\" and it is missing from Nuzhat al-Nazar.\n5. In E: \"Wa sifatu\" with Raf', and the established is from A, D, W.\n6. In C: \"Kitab.\"\n7. In E: \"Wal-Rihlatu\" with Raf', and the established is from C, D, W.\n8. In H: \"Ilayhi.\"\n9. In C: \"Ala Al-Asanid,\" and \"Ala Al-Masanid\" is missing from Z, and the established agrees with what is in Nuzhat al-Nazar.\n10. In E: \"Wal-Abwab,\" and the established agrees with what is in Nuzhat al-Nazar, and in A, C, D, an addition: \"Aw Al-Shuyukh,\" and in E, an addition: \"Wal-Shuyukh,\" and it is missing from Nuzhat al-Nazar.\n11. In B: \"Aw Al-Ilal wal-Atraf\" instead of \"Aw Al-Ilal, Aw Al-Atraf,\" and in E: \"Wal-Ilal wal-Atraf,\" and the established agrees with what is in Nuzhat al-Nazar.",
    "book_id": "616",
    "new_page_number": 75
  },
  {
    "serial_number": "3382367",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "* And knowing the Cause of Hadith, and some of the Sheikhs (1) of Judge (2) Abu Ya'la Ibn al-Farra' (3) have compiled on it. And they have compiled on most of these (4) types. And they are pure transmission, apparent in definition, dispensable (5) of examples (6); so let their extended works be consulted (7) for them (8). And Allah (9) is the Granter of Success and the Guide (10), there is no god but He (11) (12). * * * Completed with the praise of Allah",
    "foot_note": "1. In C: \"Mashayikh,\" and in Z: \"Al-Shuyukh.\"\n2. \"Al-Qadi\" is missing from Z.\n3. In C, an addition: \"Al-Hanbali,\" which is from within Nuzhat al-Nazar.\n4. In Z: \"Hadha.\"\n5. In A: \"Mustaghniyatan\" with Nasb Tanween, and in E: \"Ghaniya,\" and the established is from W.\n6. In A, C, D, an addition: \"Wa hasruha muta'assir,\" and in E, an addition: \"Wa hasruha mu'tabar,\" and both phrases are within the copies of Nuzhat al-Nazar.\n7. In B, C, W, H: \"Fa-l-yuraja',\" and in D: \"Fa-l-turaja', fa-l-yuraja'\" with Ta' and Ya' together.\n8. \"Laha\" is missing from H.\n9. In W, an addition: \"A'lam.\"\n10. In W, H: \"Al-Hadi\" without Waw of conjunction.\n11. \"La ilaha illa huwa\" is missing from H, and in W, an addition: \"Wa hasbuna Allah wa ni'ma al-wakil,\" and in Z, an addition: \"Alayhi tawakkaltu wa ilayhi unib, wa hasbuna Allah wa ni'ma al-wakil.\"\n12. The Conclusion: In A: \"End of the book, and praise be to Allah alone, and may Allah bless Muhammad and his family and companions and grant peace, on the date of the thirteenth of Dhu Hijjah al-Haram, year eight hundred and twenty-one.\" =",
    "book_id": "616",
    "new_page_number": 76
  },
  {
    "serial_number": "3382368",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "foot_note": "1. = And in B: \"And this is the end of Nukhbat al-Fikr fi Mustalah Ahl al-Athar, authored by Shihab al-Din Ibn Ali Ibn Hajar, and praise be to Allah Lord of the Worlds, and may Allah bless our master Muhammad and his family and companions all. The completion of copying it was: late afternoon Thursday, sixteenth of Muharram al-Haram, opening of the year eight hundred and thirty-four, by the hand of - the weakest of Allah's servants and most in need of His mercy and forgiveness -: Muhammad bin Musa bin Imran, may Allah forgive him and his parents and his sheikhs and whoever prayed for him for repentance and forgiveness and for all Muslims.\" And in C: \"End of the book, and Allah knows best the truth. Completed - with the praise of Allah, His help, and good success - on the morning of Sunday, sixth of the month of Jumada al-Akhira, year (834) of the Prophetic Hijra, may Allah make its outcome good, by the hand of - the servant poor unto Allah Almighty -: Abu al-Fath Muhammad bin Muhammad Ibn al-Jazari al-Nabulusi, in the mosque of Sheikh Shihab al-Din Ibn Arslan - may Allah return upon us and the Muslims of his blessings, Amen -,\" and in its margin: \"Reached collation with its original according to capacity.\" And in D: \"End of the book, and Allah knows best the truth. Completed - with the praise of Allah and His help - on Tuesday, eighth of Muharram al-Haram, year eight hundred and fifty, by the hand of - the weakest of Allah's servants and most in need of His mercy and forgiveness -: Muhammad bin Musa bin Imran, may Allah forgive him and his parents and his sheikhs and all Muslims all together; Amen, and may Allah bless our master Muhammad and his family and companions and grant peace.\" And in E: \"The introduction is completed, and praise be to Allah as He deserves to be praised, and blessings upon Muhammad His Prophet and servant, late in the blessed month of Rabi' al-Awwal, of the year (869).\" And in W: \"The book Nukhbat al-Fikr fi Mustalah Ahl al-Athar is completed, and praise be to Allah alone, and may Allah bless Muhammad and his family and companions and grant peace.\" And at its end is an Ijazah (License) for the copyist from Al-Hafiz Uthman al-Dimi, and its text is: \"Praise be to Allah the Beneficent forever, and blessings upon the best of His creation Muhammad the Chosen and peace. As for what follows: The owner and copyist of this 'Nukhbah', the Sheikh, the occupied [with knowledge], the achiever, the blessed, the ascetic - Siraj al-Din Abu Hafs, Umar bin Abu Bakr bin Ali famous as Ibn al-Mubayyid al-Saydawi al-Shafi'i - may Allah benefit him with knowledge, adorn him with forbearance, and make him among the learned working scholars - has read all of it to me. And I have authorized him to narrate it from me via my narration of it from its author - our Sheikh, Sheikh al-Islam, Hafiz of the Age - Abu al-Fadl Ahmad bin Ali bin Muhammad Ibn Hajar al-Asqalani, may Allah Almighty have mercy on him. Said and wrote it - the one in need of his Lord's mercy, rich by Him from other than Him -: Uthman bin Muhammad bin Uthman bin Nasir al-Dimi, on the sixth of Shawwal, year eight hundred and seventy-six, praising, praying, saluting, saying Hasbunallah and Hawqala.\" And in its margin is another layer of hearing (Sama') not clear, and from it appeared: \"Praise be to Allah, then the mentioned Sheikh read to me the entire book titled...\"",
    "book_id": "616",
    "new_page_number": 77
  },
  {
    "serial_number": "3382369",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "foot_note": "1. = And in Z: \"The blessed Nukhbah is completed - with the praise of Allah Mighty and Majestic and His help, and good success -, and may Allah bless our master Muhammad and his family and grant peace. Suspended by: Muhammad bin Ahmad bin Abu Bakr al-Busiri.\" And in H: \"The completion of writing it occurred with the help of Allah the King the Bestower in the magnified month of Sha'ban, on Tuesday, the twenty-fifth of that month, year one thousand one hundred and twenty-five. So rely - O my brother - that I have written this treatise from a copy written by the student of the author, and he read it - that copy - to the author, and the author authorized him at the end of that copy in his handwriting, so I edited it without decrease or increase.\"",
    "book_id": "616",
    "new_page_number": 78
  },
  {
    "serial_number": "3382370",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Nukhbat al-Fikr fi Mustalah Ahl al-Athar",
    "edition": "Second Edition, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "Index of Main References of the Investigation\n1 - Al-Badr al-Tali' bi-Mahasin Man Ba'd al-Qarn al-Sabi', by Muhammad bin Ali al-Shawkani al-Yamani, Publisher: Dar al-Ma'rifah, Beirut.\n2 - Tadhkirat al-Huffaz wa Tabsirat al-Aiqaz, by Jamal al-Din Yusuf bin Hasan bin Ahmad bin Hasan Ibn Abd al-Hadi al-Salhi known as Ibn al-Mibrad al-Hanbali, Inv: Nur al-Din Talib, Publisher: Dar al-Nawadir, Syria, Ed: First, 1432 AH - 2011 AD.\n3 - Tawdih al-Mushtabih fi Dabt Asma' al-Ruwat wa Ansabihim wa Alqabihim wa Kunahum, by Muhammad bin Abdullah al-Qaysi al-Dimashqi al-Shafi'i, Shams al-Din, famous as Ibn Nasir al-Din, Inv: Muhammad Na'im al-Arqasusi, Publisher: Mu'assasat al-Risalah, Beirut - Lebanon, Ed: First, 1993 AD.\n4 - Al-Jawahir wa al-Durar fi Tarjamat Sheikh al-Islam Ibn Hajar, by Shams al-Din Muhammad bin Abd al-Rahman al-Sakhawi, Inv: Ibrahim Bajis Abdul Majid, Publisher: Dar Ibn Hazm, Beirut - Lebanon, Ed: First, 1419 AH.\n5 - Dhayl al-Taqyid fi Ruwat al-Sunan wa al-Asanid, by Abu al-Tayyib Muhammad bin Ahmad bin Ali al-Makki al-Hasani al-Fasi, Inv: Kamal Yusuf al-Hut, Publisher: Dar al-Kutub al-Ilmiyyah, Beirut - Lebanon, Ed: First, 1410 AH.\n6 - Dhayl Tabaqat al-Huffaz, by Abd al-Rahman bin Abu Bakr al-Suyuti, Inv: Zakariya Umayrat, Publisher: Dar al-Kutub al-Ilmiyyah.\n7 - Shadharat al-Dhahab fi Akhbar Man Dhahab, by Abu al-Falah Abd al-Hayy bin Ahmad bin Muhammad Ibn al-Imad al-Akari al-Hanbali, Inv: Mahmoud al-Arna'ut, Hadith verification: Abd al-Qadir al-Arna'ut, Publisher: Dar Ibn Kathir, Damascus - Syria, Ed: First, 1406 AH.\n8 - Sharh Sunan Abi Dawud, by Shihab al-Din Ahmad bin Husayn bin Ali bin Raslan al-Maqdisi al-Ramli al-Shafi'i, Inv: A number of researchers at Dar al-Falah under supervision of Khalid al-Rabat, Publisher: Dar al-Falah for Scientific Research and Heritage Verification, Faiyum - Arab Republic of Egypt, Ed: First, 1437 AH.\n9 - Sharh Nukhbat al-Fikr fi Mustalahat Ahl al-Athar, by Ali bin Sultan Muhammad, Abu al-Hasan Nur al-Din al-Mulla al-Harawi al-Qari, Inv: Muhammad Nizar Tamim and Haitham Nizar Tamim, Publisher: Dar al-Arqam - Beirut.\n10 - Al-Daw' al-Lami' li-Ahl al-Qarn al-Tasi', by Shams al-Din Muhammad bin Abd al-Rahman al-Sakhawi, Publisher: Dar Maktabat al-Hayat - Beirut.\n11 - Tabaqat al-Huffaz, by Abd al-Rahman bin Abu Bakr al-Suyuti, Publisher: Dar al-Kutub al-Ilmiyyah - Beirut, Ed: First, 1403 AH.\n12 - Fatawa Nur 'ala al-Darb, by Abdul Aziz bin Abdullah bin Baz, Publisher: General Presidency for Scholarly Research and Ifta, Riyadh - Kingdom of Saudi Arabia, Ed: First, 1428 AH - 2007 AD.\n13 - Qada' al-Watar fi Nuzhat al-Nazar fi Tawdih Nukhbat al-Fikr fi Mustalah Ahl al-Athar, by Burhan al-Din Ibrahim bin Ibrahim al-Laqqani, Inv: Shadi bin Muhammad bin Salim Al-Nu'man, Publisher: Al-Dar al-Athariyyah, Amman - Jordan, Ed: First, 1431 AH - 2010 AD.\n14 - Lahz al-Alhaz bi-Dhayl Tabaqat al-Huffaz, by Muhammad bin Muhammad bin Muhammad, Abu al-Fadl Taqi al-Din Ibn Fahd al-Hashimi al-Makki al-Shafi'i, Publisher: Dar al-Kutub al-Ilmiyyah, Ed: First, 1419 AH - 1998 AD.\n15 - Al-Majma' al-Mu'assis lil-Mu'jam al-Mufahras, by Shihab al-Din Ahmad bin Ali bin Muhammad Ibn Hajar al-Asqalani, Inv: Yusuf Abd al-Rahman al-Mar'ashli, Publisher: Dar al-Ma'rifah - Beirut, Ed: First, 1413 AH - 1415 AH.\n16 - Mukhtar al-Sihah, by Abu Abdullah Muhammad bin Abu Bakr bin Abd al-Qadir al-Hanafi al-Razi, Inv: Yusuf al-Sheikh Muhammad, Publisher: Al-Maktabah al-Asriyyah - Al-Dar al-Namudhajiyyah, Beirut - Sidon, Ed: Fifth, 1420 AH.\n17 - Al-Manhal al-Safi wa al-Mustawfa ba'd al-Wafi, by Jamal al-Din Abu al-Mahasin Yusuf bin Taghribirdi bin Abdullah al-Zahiri al-Hanafi, Inv: Muhammad Muhammad Amin, Publisher: The General Egyptian Book Organization, 1984 AD.\n18 - Nuzhat al-Nazar fi Sharh Nukhbat al-Fikr fi Mustalahat Ahl al-Athar, by Shihab al-Din Ahmad bin Ali bin Muhammad Ibn Hajar al-Asqalani, Inv: Abdul Muhsin bin Muhammad al-Qasim.\n19 - Nazm al-Iqyan fi A'yan al-A'yan, by Abd al-Rahman bin Abu Bakr al-Suyuti, Inv: Philip Hitti, Publisher: Al-Maktabah al-Ilmiyyah, Beirut.\n20 - Al-Nur al-Safir 'an Akhbar al-Qarn al-Ashir, by Muhyi al-Din Abd al-Qadir bin Sheikh bin Abdullah al-Aydarus, Publisher: Dar al-Kutub al-Ilmiyyah - Beirut, Ed: First, 1405 AH.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 79
  }
]