[
  {
    "text": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))\nAuthor: الحسن بن أحمد بن محمد الأعرابي أبو محمد الأسود الغندجاني\nYear: 430",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "category_id": "32",
    "category": "Literature",
    "new_page_number": 1
  },
  {
    "text": "sn: 7524\nbook_title: فرحة الأديب في الرد على ابن السيرافي شرح أبيات سيبويه (يتعقب المؤلف على ابن السيرافي (ت ٣٦٨ هـ) , في شرحه لبعض أبيات كتاب سيبويه (ت ١٨٠ هـ))\nbook_link: https://shamela.ws/book/640\nbook_id: 640\nauthor_name: الحسن بن أحمد بن محمد الأعرابي أبو محمد الأسود الغندجاني\nauthor_year: 430\nnickname: أبو محمد\nauthor_link: https://shamela.ws/author/841\nauthor_ID: 841\neditor: Null\npublisher: Null\nedition: Null\npages: 52\nvolumes: Null\npagination: [الكتاب مرقم آليا غير موافق للمطبوع]\ncategory: الأدب\ncategory_id: 32",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "category_id": "32",
    "category": "Literature",
    "new_page_number": 2
  },
  {
    "serial_number": "6834850",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Literature\nBook: The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))\nAuthor: Abu Muhammad al-Hasan ibn Ahmad al-A'rabi, nicknamed al-Aswad al-Ghandajani (d. approx. 430 AH)\n[The book is automatically numbered and does not correspond to the printed version]\nNumber of pages: 52\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nBook: The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))\nAuthor: Abu Muhammad al-Hasan ibn Ahmad al-A'rabi, nicknamed al-Aswad al-Ghandajani (d. approx. 430 AH)\n[The book is automatically numbered and does not correspond to the printed version]\nNumber of pages: 52\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nAuthor: Abu Muhammad al-Hasan ibn Ahmad al-A'rabi, nicknamed al-Aswad al-Ghandajani (d. approx. 430 AH)\n[The book is automatically numbered and does not correspond to the printed version]\nNumber of pages: 52\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n[The book is automatically numbered and does not correspond to the printed version]\nNumber of pages: 52\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\nNumber of pages: 52\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 3
  },
  {
    "serial_number": "6834851",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful, and in Him we seek help.\n\nAbu Muhammad al-A'rabi said: I contemplated what Abu Muhammad Yusuf ibn al-Hasan ibn Abdullah al-Sirafi explained regarding the verses of Sibawayh's book, and I found him regarding them to be like what Jaz' ibn Dirar, the brother of al-Shammakh, said:\n\n*I settled matters, then left behind me ... calamities in their sleeves that had not yet split open.*\n\nThis is because he explained only a drop from the ocean of the verses of that book, and even the little he explained contains much defect and clear corruption. It was as Bishr ibn Hakim, the brother of Banu Rabi'ah ibn Malik, said:\n\n*Adi did not multiply among us so as to be feared ... nor was it good when I said: Adi's number is few.*\n\nFor there is a verse where he made a misspelling, and poetry he attributed to other than its speaker, and meaning he diverted from the path of correctness, and wording he shifted from its structures. So I have clarified the places of error in all of that, and established the correct version beneath each verse. I have dedicated this to the assembly of the Chief Abu Sa'id Bundar ibn Jahshtiyar, for he is the mine of literature and concerned with the knowledge of the Arabs. And success is through Allah, and He is my Sufficiency and the best Disposer of affairs.\n\nIbn al-Sirafi said: Muzahim al-Uqayli said:\n*And whoever sees a gift like what I have seen ... hardships will split him and exhaust him towards it.*\n*And my passion for her is the passion of one who lost his camel ... at Nakhlah, upon whom the compassionate ones did not turn.*\n\nS [The Author] said: This is the place of the proverb:\n*They remained gathering [wood] at night upon a broken tree ... its driver is the slave and its water-provider is the bondmaid.*\n\nWhoever explains this strange poetry without having thoroughly examined the obscure poetry of the Arabs, and without having mastered it with knowledge, is like one who gathers firewood in the hamd (saltwort) plant [blindly]. Ibn al-Sirafi advanced here what should have been delayed, and delayed what should have been advanced. Between the two verses are verses without which their organization cannot be put in order. The order of the verses is:\n*And my passion for her is the passion of one who lost his camel ... at Bakka [Mecca], upon whom the compassionate ones did not turn.*\n*He saw roughness from his two companions, and missed him ... at its sandy ground, the hasty, turning camels.*\n*So they said: Do you know the stopping places of Mina? ... Not everyone who comes to Mina do I know.*\n*And I did not forget from her the night of the valley-bend when she walked ... towards me, while my companions were dismounting and standing.*\n*She extended fingertips to shake hands as if ... they were the daughters of the sand-dune [plants] which the winding sands leaned upon.*\n*She reminds me of a gift, despite distance and enemies ... throughout the nights, and the cooing pigeons.*\n*And two lovers frightened by separation, so of them ... is one striving, and one restricted, upon whom the chain rattles.*\n*And whoever sees a gift like what I have seen ... hardships will split him and exhaust him towards it.*\n*For the early riser going with the people there is a driver ... violent, and for the follower with the chain there is a stopper.*\n*Like a spear of Marran wood, beneath its shadow ran ... a canal fed by the overflowing seas.*\n\nS said: It is long, but sufficient for you from the necklace is what surrounds the neck.\n\nChapter of Masdars (Verbal Nouns)\n\nIbn al-Sirafi said: Sibawayh said in the Chapter of Masdars, Al-Marrar said:\n*The family of al-Mughira knew that I ... attacked and did not recoil from striking, making [them] hear.*\n\nIbn al-Sirafi said: \"I found in this chapter the verse attributed to Al-Marrar, but I saw it in the poetry of Malik ibn Zaghbah al-Bahili. Banu Dubay'ah had raided Bahila, so Bahila caught up with them and defeated them.\"\n\nS said: This is the place of the proverb:\n*Will singing and riding heal the soul ... of a sickness within it when you have departed?*\n\nWhat Ibn al-Sirafi mentioned hardly heals the one seeking benefit, especially since the little he mentioned is defective. The verse belongs to Malik ibn Zaghbah al-Bahili, referring to Misma' ibn Shayban, one of the Banu Qays ibn Tha'labah. He [Misma'] and Ibn Kadra' al-Dhuhli had gone out seeking blood revenge for those killed by Bahila from Bakr ibn Wa'il on the day Abu al-A'sha ibn Jandal was killed. This reached Bahila, so they met them and fought fiercely. Banu Qays and those with them from Banu Dhuhl were defeated, and Misma' ibn Shayban was struck and escaped wounded. The verse is the first of verses, the order of which is:\n*The family of al-Mughira knew that I ... caught up and did not recoil from striking, making [them] hear.*\n*And if my sword had not betrayed me [by breaking] its edge ... I would have left birds and hyenas to visit him.*\n*And Ibn Kadra' al-Sadusi fled after ... I took a strip [of flesh/equipment] from him in the attack.*\n*Did you come so that you might violate our sanctuary? ... So you encountered striking and mutilating stabbing.*\n*So you returned disgraced, small, humiliated ... with spears interlaced together in your shoulders.*\n\nIbn al-Sirafi said: Al-Akhwas al-Yarbu'i said:\n*What you have caused regarding your brother will come to you ... companies from the horizons, diverse are their places of return.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 4
  },
  {
    "serial_number": "6834852",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "*Ill-omened ones, not reformers of a clan ... nor cawing, except for separation, is their crow.*\n\nIbn al-Sirafi said: Al-Na'b is the sound of the crow, and al-Na'ib is the crow. Al-Akhwas said this concerning a war that occurred between the clans of Banu Yarbu', in which Abu Badr al-Ghudani was killed. [He said this] in speech resembling this, which has no benefit.\n\nS said: This is the place of the proverb:\n*Oh, would that my share of you was the one with the veil: That you do not harm me and do not benefit me.*\n\nIf Ibn al-Sirafi had remained silent about explaining this poetry, the story and order of which he did not know, it would have been more useful for his beneficiary. This is because he said: \"This poetry was said concerning a war between the clans of Banu Yarbu'.\" However, the fighting was between Banu Yarbu' and Banu Darim. By saying \"Ill-omened ones\" (masha'im), the poet meant Banu Darim ibn Malik, not Banu Yarbu'.\n\nThe story of this poetry is that people from Banu Yarbu' and Banu Darim gathered at al-Qar'aa. A man from Banu Ghudanah, kunya Abu Badr, was killed among them. Banu Yarbu' said: \"By Allah, we will not leave until we exact our revenge.\" Banu Darim said: \"We do not know his killer, so establish a collective oath (qasamah) and we will give you your right.\" Banu Ghudanah said: \"We will do so.\" They brought out fifty men. All of them swore except one man, that the one who killed Abu Badr was Ubayd ibn Zur'ah. The remaining one of the fifty said: \"Will you not hand Ubayd over to us if I complete the fifty?\" They said: \"No, but we will pay his blood money because we do not know who killed him.\" The remaining one—who was Abu Bayd al-Ghudani—then said: \"By Allah, I will never complete them, and Ubayd shall not part from us until we kill him.\"\nThen Dirar ibn al-Qa'qa' ibn Ma'bad ibn Zur'ah and Shayban ibn Hanzalah ibn Bishr ibn Amr stood up and guaranteed Ubayd. Banu Ghudanah handed him over to them. When night covered them, Dirar and Shayban said to Ubayd: \"Go wherever you wish.\"\nIn the morning, Banu Ghudanah went to Banu Darim and said to them: \"Your companion has fled, but accept this blood money from your brothers, and do not seek other than that, lest you become like the one who cut off his own nose. If we knew the location of your companion, we would have gone to him.\"\nWhen Al-Akhwas heard them mentioning the blood money, he said: \"Let me speak.\" They said: \"Speak, O Abu Khawlah.\" Al-Akhwas said:\n*Yarbu' has no poverty regarding blood money (aql) ... nor is there filth from which their clothes would be blackened.*\n*So how are the Sons of Malik [Banu Darim], if you forgive ... them this? Or how [will it be] after its abuse?*\n*Ill-omened ones, not reformers of a clan ... nor cawing, except for bad omens, is their crow.*\n*If you do not kill for your brother ... then be prostitutes, [carrying] their bags in their palms.*\n*News of what you caused regarding your brother will tell ... companies from the horizons, diverse are their places of return.*\n\nThese are verses from which I mentioned what is indispensable regarding the meaning of the verse in the Book [Sibawayh].\n\nIbn al-Sirafi said: Al-Ja'di said:\n*And how can you communicate with one whose ... friendship has become like Abu Marhab?*\n\nHe said: Abu Marhab is one of his cousins, and I think he is from Banu Qushayr. He means that Abu Marhab cut him off and shunned him for a reason in which he needed him.\n\nS said: This is the place of the proverb:\n*You claimed the description of horses; you did not lead them ... nor did your ancestors lead them in times past.*\n\nIf Ibn al-Sirafi had limited himself to mentioning syntax and language, and had not exposed himself to mentioning men and genealogies, he would not have made himself a target for the tongues of critics. But the wretched one is slapped by every palm.\nAbu Marhab here is the one who says to you when he meets you: \"Ahlan wa Marhaban\" (Welcome), and nothing else. Al-Ja'di's verse is similar in meaning to al-Kumayt's verse:\n*He sees me in passing as a friend to him ... while the desert gazelle is frightened by the hunter.*\nAnd like the saying of another:\n*A friend who, as long as his eye is visible to you [he is a friend] ... but if he is absent, then beware of Da'laj.*\nAnd like the saying of another:\n*A friend of presence and a friend of the eye ... but for the one who is absent, he is not a friend.*\n\nIbn al-Sirafi said: Abu al-Aswad al-Du'ali, may Allah be pleased with him, said:\n*If you come to a doorkeeper of his, he says: Marhaban (Welcome) ... Is not a welcoming, unconstricted valley your valley?*\nHe addresses the doorkeeper: Is not your valley, O doorkeeper, welcoming and unconstricted?\n\nS said: This is the place of the proverb:\n*And how can one travel who has no camels?*\n\nOften those who do not practice the science of genealogy stumble in a name like this, which is his saying: Abu al-Aswad al-Du'ali. The earlier grammarians used to say this, but it is not from their science. Abu al-Nada informed us, saying: He is Abu al-Aswad al-Dili. He said: His name is Zalim ibn Amr ibn Sufyan ibn Ya'mar ibn Hils ibn Nufathah ibn Adi ibn al-Dil ibn Bakr ibn Abd Manat ibn Kinanah.",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 5
  },
  {
    "serial_number": "6834853",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "He said: And in Rabi'ah: al-Dawl ibn Hanifah ibn Lujaym. In Azd: al-Dil ibn Haddad ibn Zayd Manat ibn al-Hajar. In Anazah: al-Dawl ibn Sabah ibn Atik ibn Aslam ibn Yadhkur ibn Anazah. In Taghlib: al-Dil ibn Zayd ibn Amr ibn Ghanm ibn Taghlib. In Dabbah: al-Dawl ibn Tha'labah ibn Sa'd ibn Dabbah. In al-Rabab: al-Dawl ibn Jala ibn Adi ibn Abd Manat. In Abd al-Qays: al-Dil ibn Amr ibn Wadi'ah ibn Lukayz ibn Afsa. In al-Hun: al-Du'il - with Hamza, on the pattern of al-Du'al - ibn Muhallim ibn Ghalib ibn A'idhah ibn Yathi' ibn Malih ibn al-Hun ibn Khuzaimah. In Iyad: al-Dil ibn Umayyah ibn Hudhafah ibn Zuhayr ibn Iyad. In Azd: al-Dawl ibn Sa'd Manat ibn Ghamid. In Qays: al-Dil ibn Himar ibn Naj ibn Abi Malik ibn Ikrimah.\n\nIbn al-Sirafi said: Al-Marrar said:\n*You cut off [relations] but were not cut off, and you are cutting ... and how can one who is called forbearing play the youth?*\n*And you turned away, and prolonged the turning away, and rarely ... does union last with prolonged turning away.*\n\nHe said: He says you cut off this woman before she cut you off, addressing himself. Then he said: And how can one who has grown old and forbearing act like a youth? And this woman turned away, and you prolonged the turning away, and with prolonged turning away, nothing of affection and love remains. This is how I saw it explained.\n\nS said: This is the place of the proverb:\n*O people of virtue, let her pass ... for you are but Nabateans and donkeys.*\n\nThis is among the most disgraceful things Ibn al-Sirafi came up with, for this poetry is not of the obscure kind that confuses anyone. The correct reading is: *Sadadti* (You [feminine] turned away) and you prolonged the turning away. The organization of the verses is:\n*You cut off but were not cut off, and you are cutting ... and how can one who is called forbearing play the youth?*\nHe says: You cut off but were not cut off with a permanent cutting, but rather a cutting of coquetry.\n*You turned away and prolonged the turning away, and I do not see ... a union that lasts with prolonged turning away.*\nIt is as if he is addressing himself and blaming her [the woman] for the prolonged turning away. Meaning, the union of beautiful women does not last except for one who sticks to them and submits to them. This is explained by the two verses after them, which are:\n*Beautiful women are not for roughness, nor for him who ... has concerns that distract him from demanding their debt.*\n*But rather, the promise is fulfilled for a follower ... of their desires, one who swears to them, a sinner.*\n\nIbn al-Sirafi said: Al-Marrar said:\n*I am the son of the one who left the Bakri, Bishr ... the birds upon him, watching for him to fall.*\nThe position of \"watching him\" is accusative as a state (Hal), meaning watching his death to eat him.\n*He struck him with a blow that sent by night ... his wailing women, and made the 'budu' (flesh/women) cheap.*\n\nHe said: He meant Bishr ibn Amr ibn Marthad, and a man from Banu Asad killed him, so al-Marrar boasted of his killing. Bishr refers to [the tribe of] Bakr ibn Wa'il. \"And made the 'budu' cheap\": meaning the blow made the flesh cheap for the birds. Some narrators claimed that by 'budu' he means the sexual organs (budu') of his women, i.e., their marriage. He says: When they killed him, they captured his women and married them without a dowry. And 'budu' means marriage. The first explanation is more pleasing to me.\n\nS said: This is the place of the proverb:\n*I became, from the memory of a purple [cloth], like ... one who sends water and holds back the foam.*\n\nHow often Ibn al-Sirafi favors the bad over the good, and the counterfeit over the permissible. This is because he inclined to the saying that 'budu' here means flesh. By my life, if they were the flesh of goats and camels, it would be permissible for cheapness and expensiveness to apply to them; this is complete stupidity. The correct meaning is that when they killed him, they exposed his women to captivity, because there remained no one for them to protect them and defend them. Furthermore, he did not mention the killer of Bishr, from which of the tribes of Banu Asad he was. If the truth of this is not known, it is not known why al-Marrar boasted about it.\nHis killer was Sab' ibn al-Has-has al-Faq'asi, and the leader of the army, the army of Banu Asad that day, was Khalid ibn Nadlah al-Faq'asi, who is the grandfather of al-Marrar ibn Sa'id ibn Habib ibn Khalid ibn Nadlah.\nThe story of this day—the Day of Qilab—is that a clan from Banu al-Harith ibn Tha'labah ibn Dudan raided, led by Khalid ibn Nadlah ibn al-Ashtar ibn Jahwan ibn Faq'as. They said to a soothsayer of theirs: \"Look, does your companion [jinn] inform you about water?\" He covered himself with his garment, and his devil came to him and said: \"Ride a high [horse] and a galloping [horse], and measure the earth in miles, for you will see tall hills, and between them is water/moisture.\" So they put a man of theirs on one of the two horses, and he galloped it, and found hills with a pond of rainwater between them. So the people drank and watered [their animals] and ate dates from their provisions. Bishr ibn Amr came across their tracks and said: \"These are the tracks of Banu Asad.\" When they reached the water, he said: \"Look at what they do with the date stones. If it is Banu Asad, they throw the stones behind them, and if it is Tamim, they throw the stones in front of them.\"",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 6
  },
  {
    "serial_number": "6834854",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "When they found the place where their date stones were thrown, he said: \"These are Banu al-Harith ibn Tha'labah. One of them captures the woman's hair braids and demands a hundred [camels] as ransom. Charge the people!\" His son said to him: \"Among Banu al-Harith ibn Tha'labah are Banu Faq'as, and if you meet them, you meet [real] fighting.\" He said: \"Be silent, for your face resembles your mother's face at the time of entry [wedding].\" So the people proceeded.\nWhen they met, Bishr's army was defeated. The cavalry pursued him—and he was a man of fine horses—until three horsemen followed in his tracks, closely spaced. The first was Sab' ibn al-Has-has al-Faq'asi, the middle one was Amilah ibn al-Muqtabis al-Walibi, and the last was Khalid ibn Nadlah. The arrow of al-Walibi, the middle one, reached Bishr ibn Amr's horse; he shot it and hamstrung it. Sab' caught up to him and grappled him. Khalid came and said: \"O Sab', do not kill him, for we do not seek blood revenge from him, and he has much wealth, and he is a master of his people.\" So they sat him between them, and al-Walibi withdrew. The cavalry came to them; whenever a man passed by him, he ordered them to kill him, until some of the people began to threaten him, so Khalid drove them away. Then a man intended to direct his spear at him, so Khalid rose on his knees and said: \"Keep away from my prisoner!\" Sab' became angry that Khalid claimed him, so Sab' thrust [his sword] into Bishr's throat, and he fell on his back. He grabbed his leg and followed the sword through the opening of the armor until he pierced his liver. Bishr said: \"Protect my trousers, for I did not shave [my pubes].\" Then he released him, went to his horse, and led it away. He said when he killed him, while angry: \"[He is] your prisoner and your father's prisoner!\"\nAl-Khirniq said, mocking Abd Amr ibn Bishr when he incited against Tarafa and al-Mutalammis:\n*Why did you not kill Ibn Has-has and Khalid ... there? You did not kill there and you did not signal.*\n*They stabbed your father in the opening of his armor ... and you turned away, not looking back, fleeing into a hole.*\n\nIbn al-Sirafi said: Miskin al-Darimi said:\n*And the cousin of a man, know, is his wings ... and does the falcon rise without wings?*\n*Your brother, your brother! For he who has no brother ... is like one rushing to battle without a weapon.*\n\nS said: This is the place of the proverb:\n*He zig-zags me with deceit ... He sees me, I do not think [he sees me].*\nIbn al-Sirafi advanced from the two verses what should have been delayed, and delayed what should have been advanced. The correct order is:\n*Your brother, your brother! For he who has no brother ... is like one rushing to battle without a weapon.*\n*And the cousin of a man, know, is his wings ... and does the falcon rise without wings?*\n\nIbn al-Sirafi said: Al-A'sha said:\n*I see a man among them, sorrowful/angry, as if ... he presses to his flanks a dyed hand.*\n*And he has no ancient glory, nor does he have ... any advantage from the wind, neither the South wind nor the East wind.*\n\nHe said: It is as if, from the intensity of his anger, his hand has been cut off, so he presses his hand to his sides while it is cut off. He says: This man looks at me with the look of an angry person as if I have cut off his hand. \"And he has no ancient glory\"—meaning he has no old nobility—\"nor does he have any advantage from the wind\"—meaning he has no power in any direction. This is how I saw it explained. He satirizes thereby Amr ibn al-Mundhir and his people, who are cousins of Al-A'sha.\n\nS said: This is the place of the proverb:\n*And he who Hudhaym tends his sheep ... is confessing to the wolf and the forced war.*\n\nWhoever relies on this amount mentioned by Ibn al-Sirafi has not benefited much, because he did not mention the story that caused this admonition and satire. The cause of that was that a man from Qays Aylan was a neighbor to Amr ibn al-Mundhir ibn Abdan ibn Hudhaqah ibn Habib ibn Tha'labah ibn Qays ibn Tha'labah. A riding camel of his was stolen, and some of its meat was found in the house of Haddaj, Al-A'sha's leader. He was beaten while Al-A'sha was sitting. So he said, admonishing them in the poem from which these verses are taken.\n\nIbn al-Sirafi said: And Al-A'sha said:\n*We are the horsemen on the day of al-Hinu, appearing ... on the two sides of Futaymah, neither inclining nor unarmed.*\n\nHe said: Futaymah here is Futaymah bint Sharahil ibn Awsajah from Banu Qays ibn Tha'labah, the people of Al-A'sha. She had two sons from a man not of her people called Asram. Asram wanted to take her two sons and pledge them to Yazid ibn Mushir al-Shaybani. She sought help from her people, so they gathered and defeated Banu Shayban, and Al-A'sha boasted of that. Al-Hinu is the bend of the valley.\n\nS said: This is the place of the proverb:\n*I said when they emerged from a peak ... The donkey lied, even if he passed form the left [bad omen].*\nMeaning the horse and the camel. This is impossible, because Futaymah is the daughter of Habib ibn Tha'labah ibn Sa'd ibn Qays ibn Tha'labah. And al-Hinu here is a specific place, which is Hinu Qaraqir, mentioned by Al-A'sha in his saying:\n*Ransom for Banu Dhuhl ibn Shayban is my she-camel ... and her rider on the day of meeting, and I said [it].*\n*They struck at al-Hinu, the Hinu of Qaraqir ... the front of the Hamarz until it turned away.*\nAnd Qaraqir is one of the waters of Bakr ibn Wa'il.",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 7
  },
  {
    "serial_number": "6834855",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "Ibn al-Sirafi said: Humayd al-Arqat said—and he used to satirize the guest when he stayed with him:\n*And destitute ones upon the saddles, their clothing ... is ragged garments and cloaks in which there is variety.*\n*They spent the night while our baskets of Shahriz [dates] were between them ... as if their fingernails were knives in them.*\n*So they reached morning with the date stones topping their stopping place ... and not all the date stones do the poor throw away.*\n\nHe said: His saying \"not all the date stones do the poor throw away\" means that whoever is intensely hungry and in need of food, and has nothing to spend, should eat the date with the stone to become satisfied sooner, and not eat many dates. Humayd meant that his guests ate the dates with their stones and did not throw any of them away.\n\nS said: This is the place of the proverb:\n*And does anyone know the diseases except their doctor?*\n\nIbn al-Sirafi did not know the counterparts of these verses, nor did he explain the verse he interpreted regarding the stones and the poor well. Such poetry is not known except by one who has matured in investigating poetry and cared for it. The order of the verses is:\n*And destitute ones upon the saddles, their clothing ... is bags and cloaks in which there is variety.*\n*Presenting noses in their bands ... hooked; may those noses be cut off.*\n*They were given veiling in a group when they rushed ... and every good upon them afterwards is stored away.*\n*No welcome to the faces of the people when they departed ... as if they were, when they came to me, the jars of devils.*\n*They write news for us when they dismount ... and everything they wrote is an enablement for swallowing [food].*\n*And if you protected yourself where the gazelle takes refuge ... or where the wild cow licks its young.*\n*I thought their hospitality would not end from us ... until we are, while our starting place is the gardens.*\n*A land in which eagles hover, growing ... from where the date stalks grow in the summer.*\n*They spent the night while our baskets of Shahriz [dates] were between them ... as if their fingernails were knives in them.*\n*So they reached morning with the date stones topping their stopping place ... and not all the date stones do the poor throw away.*\n\nThe meaning of this last verse is that they ate most of the dates with their stones out of greed and gluttony, and despite that, they piled up their stopping place with the stones they threw. By \"the poor\" (al-masakin), he means these guests, as if they piled up: meaning they made a pile for themselves. He pointed to them and said: \"And not all the date stones do the poor throw away.\" This pointing is like the saying of another:\n*The lightning rose from the direction of Hejaz and thrilled me ... and for every Hejazi, the lightning is thrilling.*\nMeaning *this* lightning specifically.\n\nAbu al-Nada informed us, saying: A messenger from al-Hajjaj stayed with Humayd al-Arqat, so he hosted him and honored him. When he brought the food, a Bedouin approached, greeted, and sat down, and began asking about al-Hajjaj and his condition. Humayd al-Arqat said to him: \"Eat and let the man feed, for you are asking about what is not your concern.\"\nAnd Humayd said:\n*When we hosted the one coming from the city among them ... a yellow-bowl returning [guest] came to my fire.*\n*My fire appeared to him at the canopies of the sanctuary ... while Wadi al-Salib was between us and al-Afakil.*\n\nHe said: And he informed us, may Allah have mercy on him, saying: The misers of Mudar are: Al-Hutay'ah, Al-La'in al-Minqari, Humayd al-Arqat, and Abu al-Aswad al-Dili.\n\nIbn al-Sirafi said: And Tufayl al-Ghanawi said:\n*And Huraym was a successor from Sinan ... and Hisn, and from Asma' when they disappeared.*\n*And from Qays, the one staying at Rumman is his house ... and on the day of Huqayl, another pleasing one died.*\n*And at al-Sahb, one of auspicious nature, his saying ... to the seeker of favor is 'Family and Welcome' [Ahlan wa Marhaban].*\n\nHe said: These are a group of Tufayl's people who perished, so he eulogized them. Rumman is a specific place, and he meant by his house his grave. Huqayl is a known place. Fada means died. Al-Sahb is the open space of the land. [He said this] amidst nonsense resembling this.\n\nS said: This is the place of the proverb:\n*Little sufficiency from old women of hunger ... papers in their bellies are lines.*\n\nWhat Ibn al-Sirafi mentioned does not avail a wick's worth. It is known that these are men not camels, and these are places not saddle-pads. But if the story of these men and their days, and the names of these places specifically and what happened in them are not known, the meaning is not complete. In the first verse there is a mistake, and in the third a misspelling. The correct version is:\n*And Sinan was a successor of Huraym*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 8
  },
  {
    "serial_number": "6834856",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "By placing Sinan before Huraym, because Huraym is the dead one, and Sinan is Sinan ibn Amr ibn Yarbu' ibn Tarif ibn Kharshabah ibn Ubayd ibn Sa'd ibn Ka'b ibn Hallan ibn Ghanm ibn Ghani. He was a noble horseman, had led and commanded, and he is the companion of Ibn Hadm al-Absi, the king's fugitive. The king asked him: \"How did you kill him?\" He said: \"I charged at him in the *Kubba* (main body of the army), and stabbed him in the *Subba* (anus/buttocks), until the spear came out of the *Labbah* (throat pit).\" Huraym is Sinan's uncle, and he had led and commanded.\nAsma' ibn Waqid is from Banu Riyah ibn Yarbu' ibn Tha'labah ibn Sa'd ibn Awf ibn Ka'b ibn Hallan ibn Ghanm ibn Ghani, and he is one of the stars [famous figures].\nHisn is Ibn Yarbu' ibn Tarif, and his mother is Jayda' bint Amr ibn al-A'raj ibn Malik ibn Sa'd ibn Awf.\nQays is the son of Yarbu' ibn Tarif. This Qays came to some kings, and the king said: \"I will surely place my crown on the noblest of the Arabs,\" so he placed it on Qays's head, and gave him what he wished, then let him go to his country. Tayy met him at Rumman while he was returning to his family and killed him. Then they recognized him later, and remembered favors he had done for them, so they regretted it. They buried him and built a house [tent/structure] over him. He is Qays ibn Jayda', she being his mother. His brothers are Huraym, Amr, Hisn, and Al-A'raj; their mother is Jayda' bint Amr, and their father is Yarbu' ibn Tarif.\nHuqayl is in the land of Banu Asad; in it, Banu Asad killed Al-Harith ibn Muwaylik al-Ghanawi. In the land of Ukl there is also a Huqayl, which is other than this place, and it is the one mentioned by Al-Ra'i: *From Dhu al-Abariq when they grazed Huqayl.*\nHis saying \"wa bi al-Sahb\" (and at al-Sahb) is a misspelling. The correct reading is: *Wa bi al-Shahd* (And at al-Shahd), meaning Budayl ibn Waqid. Asma' and Budayl, the sons of Waqid, were men of battles against Tayy. They killed ten men, each of whom carried the banner of his people, called Banu Hamal. A sister of theirs said eulogizing them:\n*O eye, weep for Banu Hamal ... hero horsemen in the intensity of fright.*\n*By my life, and my life is not easy to me ... Ghani has indeed taken from us ibn Waqid quietly.*\n*If the days lead Ghanm ibn Waqid ... Asma' is straightened by spears again and again.*\nThen Tayy met Ghani and captured Budayl, who was a master and chief. He feared that Tayy would mutilate him because of the losses he inflicted on them. Mirdas ibn Muwaylik was striving in his matter to ransom him, but they refused. So he killed himself, and they killed Asma'. Mirdas ibn Muwaylik said eulogizing Budayl:\n*My female friend complains to me of fatigue and weariness ... and you forget what the prisoner of chains suffers.*\n\nIbn al-Sirafi said: Shaqiq ibn Jaz' al-Bahili said, replying to Jahl ibn Nadlah al-Bahili:\n*Do you threaten me with your people, O Ibn Jahl ... mixed groups who are thought to be slaves (al-Ibad)?*\n*With what you gathered of Hadan and Amr ... and what are Hadan and Amr and the Ji'ad (horses)?*\n*If Banu Sa'd strutted behind me ... and defended me with spears, a [true] defense.*\n\nHe said: *Yukhaluna* (they are thought) means they are thought to be slaves. Hadan, Amr, and al-Ji'ad are tribes.\n\nS said: This is the place of the proverb:\n*Turn back to your family, O old woman ... for the selling of the night does not pass.*\n\nThis is the most disgraceful thing Ibn al-Sirafi came up with. He stated that al-Ji'ad is a tribe, and this indicates complete stupidity and obvious ignorance. Al-Ji'ad (steeds) here are noble horses. He says: What do these have to do with noble horses? Meaning they are not horsemen of noble horses. His saying: \"He meant by al-Ibad here slaves\" is also an error. By al-Ibad, he meant people who used to gather at the gate of al-Nu'man, servants from every tribe. He likened these people to those, meaning they are mixed breeds.\nThe first verse also contains confusion, which is his saying: \"Do you threaten me with your people, O Ibn Jahl,\" while the address is to Jahl himself, not his son, so how can he say O Ibn Jahl? The correct reading is: *Do you threaten me with your clan, O Juhayl (little Jahl)?*\nIn the verses he cited, there is advancing and delaying and much defect. They will come to you in their order with the help of Allah.\nJahl ibn Nadlah said answering Shaqiq ibn Jaz' al-Bahili:\n*Your soul made you wish, O Ibn Jaz' ... foolish things that will become difficult upon execution.*\n*You wanted to scatter the affair of a people ... and you attempted severance and corruption.*\n*So gently, O Shaqiq, for my war ... is corruption for the one who ignites it.*\n*And how many a group have fought us ... I prepared for them a determined, loud-voiced [battalion].*\n*It was nothing but that they saw its flash ... so its clarity was horses returning.*\n*Upon them from Banu Amr are mature men ... and youths shaking the spears.*\n*So they remained stitching them with brown [spears] ... as locusts are strung in baskets.*\n*So they returned with the men bent over ... driving the newly gained wealth and the old.*\n*And your help is far from me, slow ... as if you have a steed [rushing] to abandon me.*\n\nSo Shaqiq ibn Jaz' answered him and said:",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 9
  },
  {
    "serial_number": "6834857",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "*My steeds roamed freely over your lands ... and brought back from you sturdy, strong camels.*\n*Because you did not thank the favor I did ... and if you wish, we will return again.*\n*Do you hope to equal the tribe of A'ya ... and Sahb? What you hope has failed and increased [in failure].*\n*With what you gathered of Hadan and Amr ... mixed groups who are thought to be slaves (al-Ibad).*\n*If Banu Sa'd strutted behind me ... and defended me with spears, a [true] defense.*\n*You saw death before me, so you desisted ... and its strong pillars did not rise.*\n*Do you threaten me with your clan, O Juhayl ... and what are Amr ibn Hisn and the steeds?*\n\nIbn al-Sirafi said: Sibawayh said: Durna bint 'Ab'abah from Banu Qays ibn Tha'labah said. But what I found is: Durna bint Sayyar ibn Sabrah ibn Hattan ibn Sayyar ibn Amr ibn Rabi'ah said:\n*And they claimed that I panicked over them both ... and is it panic if I said: O father of them both!*\n*They are the two brothers in war for one who has no brother ... if he fears a calamity one day and calls them.*\n\nS said: This is the place of the proverb:\n*Between the obedient and the turning rebel.*\n\nThis explanation confuses a person, so he does not know right from wrong, and does not know to which one it relates: to Durna bint 'Ab'abah, or to Durna bint Sayyar? This indicates that he could not conceptualize the lean from the fat regarding them. The correct one is: Durna bint Sayyar according to the second lineage. She said [this] eulogizing her two brothers. They are pleasing verses, the order of which—as Ibn al-Sirafi recited them—has entered into defect. Their order and completion is:\n*People refused except to say: It is them, it is them ... and if we were able, they would be other than them.*\n*They are the two brothers in war for one who has no brother ... if he fears a calamity one day and calls them.*\n*If they became poor, they did not beg for fear of death ... and a client did not fear a loss from them.*\n*If they became rich, love of everyone was towards them ... and the surplus of their wealth was generous to the closest ones.*\n*They wear glory in the best clothing ... stingy with what they are able to [protect of honor], both of them.*\n*And they claimed that I panicked over them both ... and is it panic if I said: O father of them both!*\n*And my family is a ransom for the two protectors, both of them ... and may I not live if the heart hated them.*\n*If they descended into a land where death is feared ... their blade-edges calm their anxiety.*\n*And the two thrones do not delay to be pulled from them ... the bones of the anchors [mountains/leaders] if their covering tilts.*\n\nIbn al-Sirafi said: Jarir said:\n*Leave the road for the one who builds the lighthouse on it ... and go out with Barza where fate compels you.*\n\nHe said: Barza is the mother of Umar ibn Laja'.\n\nS said: This is the place of the proverb:\n*Wardan farted in a bare land.*\n\nThis is false. Abu al-Nada, may Allah have mercy on him, informed us saying: Barza is one of the grandmothers of Umar ibn Laja', [one of] the singing women.\n\nIbn al-Sirafi said: The Rajiz said:\n*Are you, O Basita, the one whom I feared ... would be my companion in the midday nap?*\n*You certainly knew which time was my obstacle.*\n*She is the one who said at the midday heat ... when the stars in the sky turned away.*\n\nHe said: Al-Basita is the flat, extended land.\n\nS said: This is the place of the proverb:\n*He is not called for help except her brother.*\n\nIbn al-Sirafi erred here previously, because he did not know the stopping places of the Arabs and their locales. Whoever interprets such poetry without mastering three types of knowledge—Genealogy, Days of the Arabs (History), and their Locales and Stopping Places—his mistakes multiply. Basita here is a specific land, which is between Kufa and al-Hazn, the rugged ground of Banu Yarbu' ibn Amr. Regarding it, Adi ibn Amr al-Ta'i says:\n*Were it not for the burning of what their stepping scatters ... on Basita, the eyes would not have caught up with them.*\n\nIbn al-Sirafi said: Tharwan ibn Fazarah ibn Abd Yaghuth said:\n*For you will not mind after a year ... whether a gazelle was your mother or a donkey.*\n*The lowest have caught up with the highest ... and baseness surged and the lineage mixed.*\n\nHe said: What is in the Book [Sibawayh] is: *Whether a gazelle was your mother or a donkey*. But what is in his poetry is: *Whether a gazelle was your maternal uncle or a donkey*.\n\nS said: This is the place of the proverb:\n*He was a donkey, then he became a she-donkey.*\n\nHow can a donkey and a gazelle be mothers when they are the most masculine of animals? Even the proverb is struck with the donkey, as it is said: *Who copulates with the wild ass copulates with a great copulator.* The correct version is what Abu al-Nada, may Allah have mercy on him, recited:\n*Whether a gazelle copulated with your mother or a donkey.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 10
  },
  {
    "serial_number": "6834858",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "The phrase was inverted only out of embarrassment/piety (taharruj), in my opinion, and then the grammarians cited it according to its apparent [sanitized] form. This is a curious piece, which Abu al-Nada dictated to us, mentioning it is by Tharwan ibn Fazarah ibn Abd Yaghuth ibn Zuhayr ibn Rabi'ah ibn Amr ibn Amir. It is:\n*And how many people of a dwelling have I seen ... a leader called them, so they marched.*\n*So their era became like the clipping-place of a horn ... no eye perceives [them] nor a trace.*\n*Maqass* (Clipping place): A place where the land is tracked/clipped. Meaning no trace is found for them or their era, just as no trace is found of one walking on a rock or a horn of a mountain.\n*You have exchanged people after people ... so there is no wonder in that and no mockery.*\n*For it will not harm you after a year ... whether a gazelle copulated with your mother or a donkey.*\n*The lowest have caught up with the highest ... and the people surged and the lineage mixed.*\n*And the Find (mountain/fool) returned like Abu Qubays ... and the ten-month pregnant camels were driven with the mongrel [female].*\nMetonymy for the low man. Abu Qubays: The noble man. Al-Mu'lahajah: The one of corrupt lineage. Meaning this mongrel female married and was given the dowry of a noble woman. This is how Abu al-Nada recited it to us: *And the Find returned*. The people's recitation is *The Slave*, and Abu al-Nada mentioned that is a misspelling.\n\nIbn al-Sirafi said: Al-Zarafa al-Bahili said:\n*Is it in the judgment that if you became wealthy ... and secure, then I am the distant stranger?*\n*And if there is a hateful event, I am called for it ... and if the Hays (date/butter dish) is stirred, Jundub is called.*\n*This, by your life, is humiliation itself ... no mother for me if that is so, and no father.*\n*Wonder at that judgment! And my staying ... among you upon that judgment is more wonderful.*\n\nS said: This is the place of the proverb:\n*And where is the face/life from the land of the Muslim?*\nWhat is between the correct [view] and what Ibn al-Sirafi mentioned in these verses is [like]:\n*Further than Rahwah from Nisah*\nAnd Nisah is without nunation (tanwin). Rahwah is in Najd, and Nisah is in Yamama.\nThis is because he claimed that these verses belong to Al-Zarafa al-Bahili, but Allah did not create anyone in Bahila named Zarafa. Yes, in Banu Asad there is a poet called Zarafa, and he is the one who said:\n*And whoever does not attain until he blocks his gap ... finds the desires of the soul not few.*\nAbu Ubaydah mentioned in the *Book of the Disobedient and Obedient* that these verses belong to Hani ibn Ahmar al-Kinani. Abu al-Nada denied that and said: They belong to Amr ibn al-Ghawth ibn Tayy. I had mentioned to you that whoever does not master the science of genealogy and days and stopping places of the Arabs, then proceeds to interpret such ancient poetry, will be disgraced.\nAbu al-Nada, may Allah have mercy on him, dictated to us saying: While Tayy was sitting one day with his son in the Two Mountains (Aja and Salma), a man from the remnants of Jadis approached, extended in build, of ancient nature, almost blocking the horizon in height and exceeding them in reach. It was al-Aswad ibn 'Affar ibn al-Sabur al-Jadisi, who escaped from Hassan Tubba' on the day of Yamama. He caught up to the Two Mountains and said to Tayy: \"Who brought you into my lands and my inheritance from my fathers? Leave them, or else I will do such and such.\" Tayy said: \"The lands are ours and our possession is in our hands; I only claimed them when I found them empty.\" Al-Aswad said: \"Set a time between us and you to fight. Whichever of us wins deserves the land.\" So they agreed on a time.\nTayy said to Jundub ibn Kharijah ibn Sa'd ibn Fitrah ibn Tayy—and his mother was Jadilah bint Subay' from Himyar, and they are known by her; they are Jadilah Tayy, and Tayy favored her—he said to this Jundub: \"Fight for your honor.\" His mother said: \"By Allah, you will leave your [other] sons alone, and expose my son to killing. He shall not do it.\" Tayy said: \"Woe to you, I only singled him out for that.\" But she refused.\nThen Tayy said to Amr ibn al-Ghawth ibn Tayy: \"Then you, O Amr, take the man and fight him.\" Amr said: \"I will not do it.\" And he began to recite saying regarding that—and he was the first to speak poetry in Tayy after Tayy—:\n*O Tayy, inform me, for you are not a liar ... and your brother is your truthful one who does not lie.*\n*Is it from the judgment that if you became wealthy ... and secure, then I am the distant stranger?*\n*And if hardships, with hardships, once ... force you into holes, then I am the nearest beloved?*\n*Wonder at that judgment! And my staying ... among you upon that judgment is more wonderful.*\n*And for you together are the good waters and their pasture ... and for me the shallow water holes and their barren pasture.*\n*This, by your life, is humiliation itself ... no mother for me if that is so, and no father.*\n*And if there is a hateful event, I am called for it ... and if the Hays is stirred, Jundub is called.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 11
  },
  {
    "serial_number": "6834859",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "The last verse became a proverb. He means Jundub ibn Kharijah ibn Sa'd ibn Fitrah ibn Tayy. Then Tayy said: \"O my son, it is the noblest abode among the Arabs.\" Amr said: \"I will not do it except on a condition: that the sons of Jadilah have no share in the Two Mountains.\" Tayy said to Amr ibn al-Ghawth: \"You have your condition.\" The sons of Jadilah are Jundub and Hor, sons of Jadilah bint Subay' of Himyar; she is their mother, and their father is Kharijah ibn Sa'd ibn Fitrah ibn Tayy. As for Hor, he perished with no offspring, and the number of Banu Jadilah refers back to the two sons of Jundub; they are Jadilah Tayy.\nAl-Aswad ibn 'Affar al-Jadisi came to the appointment carrying a bow of iron and arrows of iron. He said: \"O Amr, if you wish I will wrestle you, and if you wish I will shoot with you, otherwise I will race you.\" Amr said: \"Wrestling is more pleasing to me. Break your bow so I may break mine too and we wrestle.\" Amr ibn al-Ghawth ibn Tayy had with him a bow connected with rings (zarafin); if he wished, he could tighten it. Amr motioned with it towards the mountain and the rings opened. Al-Aswad struck the mountain with his bow and arrows and broke it. When Amr saw that, he took his bow, assembled it, strung it, and called out to him: \"O Aswad, seek help from your bow, for shooting is dearer to me.\" Al-Aswad said: \"You deceived me?\" Amr said: \"War is deception.\" It became a proverb. Amr shot him and split his heart.\n\nIbn al-Sirafi said: Mundhir ibn Dirham al-Kalbi said:\n*And the newest covenant from Aminah was a glance ... at the side of the highland when I was standing.*\n*She says: Mercy! What brought you here? ... Are you a possessor of lineage [here] or do you know the tribe?*\n\nHe said: The estimation is \"What thing brought you here?\" \"A possessor of lineage\" means: Are you a relative in the tribe, or do you know them so you intend [to visit] them?\n\nS said: This is the place of the proverb:\n*I say to Layla: My leg is for me, and my lock of hair ... is the remainder of what Husayn ibn Murajjiḥ left.*\nHere is a remaining meaning that is not complete except by knowing the third verse, which is:\n*So I said: I am a possessor of need and a submitter ... so the constricted predicament closed upon us.*\nThese are curious verses, recited by Abu al-Nada for Mundhir ibn Dirham al-Kalbi. The beginning is:\n*Is it from the love of Umm al-Ashyamayn and her memory ... your heart is lovesick for her or committing [sin]?*\n*I wished for her until I wished that I be seen ... from passion, a dog familiar with the two Wakis.*\n*May a cloud traveling from the end of the night, following ... water the garden of al-Muthri and its people from us.*\n*I say, while I have no need in my frequenting ... other than her, to the people of the garden: Are you turning [favorably]?*\n*And the newest covenant from Aminah was a glance ... at the side of the highland when I was standing.*\n*She says: Mercy! What brought you here? ... Are you a possessor of lineage [here] or do you know the tribe?*\n*So I said: I am a possessor of need and a submitter ... so the constricted predicament closed upon us.*\n\nIbn al-Sirafi said: Qays ibn Dharih said:\n*You weep for Lubna while you left her ... and you were more capable over her at al-Mala.*\n*If the world turned over with Lubna ... then for Time and the World are bellies and backs.*\n\nHe said: His saying \"Then for Time and the World are bellies and backs\" means that in the world, a human only sees its exteriors, and does not know what is in its consequences.\n\nS said: This is the place of the proverb:\n*And you practiced matters without prudence ... so you do not know whether it is lean or fat.*\nIbn al-Sirafi did not know the third of the two verses, which is the answer to his saying: \"If the world...\" The correct reading in his saying \"fa-lil-dahr\" is \"wa-lil-dahr\" (And for Time) with a Waw. He thought that was the answer/apodosis, but it is the completion of the hemistich, a parenthetical statement between \"If\" (In) and its answer. The verses are:\n*You weep for Lubna while you left her ... and you were more capable over her at al-Mala.*\nMeaning of \"you were more capable over her\": he was deceived regarding her until he divorced her, so he regretted divorcing her.\n*If the world turned over with Lubna ... and for Time and the World are bellies and backs.*\nMeaning of \"bellies and backs\": hardship and ease.\n*[Then] there was in her a place for trust ... and a seeking-place for the hand and a view for the eye.*\n*And for the hovering thirsty one, a quenching that nourishes him ... and for the trailing joyful one, wine and intoxicant.*\n*As if I am in a swing between ropes ... whenever a memory of her strikes the ground.*\n\nIbn al-Sirafi said: Amir ibn al-Tufayl said:\n*They said to her: We chased his horses ... Qulah al-Kilab, and you were not chased.*\n*So I will seek you at Qana and Awarid ... and I will advance the horses to the lava field of Dharghad.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 12
  },
  {
    "serial_number": "6834860",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "He said: His saying \"They said to her\" refers to a woman he loved from Banu Fazarah called Asma'. He means that Banu Fazarah told her that they defeated him and chased him away. There was a battle between Banu Fazarah and Banu Amir that went against Banu Amir, in which a group was killed. Dharghad is a known place.\n\nS said: This is the place of the proverb:\n*You will not catch the horses while you walk fast ... except with a passing like the passing of the falcon.*\n\nThe meaning of this poetry is not known except by knowing the Days (battles) related to it. Furthermore, if Dharghad, Qana, and Awarid are not known specifically—in which place of Allah's lands they are—the addressee of his speech is not known. Amir said this on the Day of al-Raqam, the day Banu Murrah defeated them. Amir fled, and his brother al-Hakam ibn al-Tufayl strangled himself. On that day, Uqbah ibn Anis ibn Khulays al-Ashja'i killed one hundred and fifty men from Banu Amir; he drove them into the ravine of al-Raqam and slaughtered them, so Uqbah was named that day \"The Slaughterer\" (Mudhabbih). Qana and Awarid are two mountains in the land of Banu Fazarah. About them al-Shammakh ibn Dirar says:\n*As if she, when Awarid appeared ... was an Adbiyyu (white antelope) obscure in the mirage.*\n*And the night is crouching between the two Qanas ... at the side of the valley are sandgrouse rising.*\nThe addressees of Amir's poetry are Banu Murrah and Fazarah. Asma' is Asma' al-Sukayniyyah from Banu Fazarah; Amir loved her and wrote love poetry (ghazal) about her, and he had committed adultery with her. About her he says:\n*Are you dismounting, Asma', or not dismounting? ... Clarify to us, O Asm, what you are doing.*\nKharashah al-Absi says about her on the Day of al-Raqam:\n*So who will convey from me to my friend Amir ... Have you been consoled regarding Asma' or are you remembering?*\n*For behind the valley bend are gazelles of a thicket ... their ears and helmet-liners perfumed.*\nDharghad is one of the waters of Banu Murrah.\n\nIbn al-Sirafi said: Khufaf ibn Nudbah said, and it is said Abbas ibn Mirdas:\n*So he spoke to me the speech of one of opinion and ability ... experienced, wise, pure from suspicion.*\n*I commanded you the good, so do what I commanded ... for I have left you possessing wealth and property.*\n\nS said: This is the place of the proverb:\n*A bay horse and a reddish-yellow one; indeed that is from the error.*\nThe verse belongs to neither of the two men. Rather, it belongs to A'sha Banu Tarud, who are from Banu Fahm ibn Amr, and their count is among Banu Sulaym, in a beautiful poem starting with:\n*O abode of Asma' between the plain and the wide space.*\nIbn al-Sirafi did not mention who it was that said to him: \"I commanded you the good.\" The poet is actually recounting this from his father and boasting of it, and mention of him will come in the poetry.\nA'sha Banu Tarud said:\n*O abode of Asma' between the foot of the mountain and the wide space ... It became desolate and the passing of eras effaced it.*\n*Nothing remains of it except stones arranged ... and three anchored ones around an erect one.*\n*And a courtyard of the house where winds blow ... moaning in it like the moaning of the bereaved woman.*\n*A house of Asma' when my heart was fond of her ... and when the nearest of it was not approachable.*\n*Indeed, the beloved whom I have come to abandon ... not out of hatred from me nor anger.*\n*I turn away from him in watchfulness lest I visit him ... and whoever fears the speech of slanderers watches.*\n*I have acquired a noble deed over the people ... of old, and my father warned me of what they fear.*\n*And he said to me the speech of one of knowledge and experience ... regarding the past matters of time and eras:*\n*I commanded you the good, so do what I commanded ... for I have left you possessing wealth and property.*\n\nIbn al-Sirafi said: Talid al-Abshami said:\n*I healed the thirst [for revenge] from Sumayr and Ja'un ... and the Lord of al-Salasil, Amir, escaped us.*\n*And he became certain that if the horses engaged him ... there would be for the palm shoots after him a pollinator.*\n\nHe said: The cause of this poetry is that groups from Abd al-Qays raided the Abna' (Sons) from Banu Sa'd. The Abna' defeated them and killed Sumayr and Ja'unah among them. He said in the poetry \"Ja'un,\" truncating it (tarkhim) outside of the vocative case. \"Lord of al-Salasil\": it is possible he meant by it that he is possessor of weapons and horses, and salsalah is the sound of iron. This is how I found it with this wording and spelling. And Allah knows best the truth.\n\nS said: This is the place of the proverb:\n*If you intercepted like the interception of the she-cat ... you are about to fall into a calamity.*\nIf Ibn al-Sirafi had remained silent about explaining such poetry of the tribes, in which skilled scholars and genealogists become exhausted—he would not have made himself a target for every archer. It was narrated from Abu Uthman al-Mazini that he said: \"We carried the selections of al-Mufaddal and read them to al-Asma'i. Regarding everything in them from the poetry of famous poets, he answered. But when we came to the poetry of the tribes, Abu Sa'id [al-Asma'i] was exhausted/stumped by it.\"",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 13
  },
  {
    "serial_number": "6834861",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "This is a difficult chapter, and I had said: Whoever does not master the science of genealogy and the locations of the Arabs, and wades into explaining such poetry, his foot slips. The correct version is what Abu al-Nada, may Allah have mercy on him, recited to us:\n*We healed the thirst from Sumayr and Ja'un ... and the Lord of al-Sulasil, Amir, escaped us.*\nWith Damma on the Sad of al-Sulasil. He mentioned that it is a water source belonging to this Amir, in a valley called al-Jawf, containing many palms and abundant farms. They hardly say: \"Fulan Rabb Kadha\" (So-and-so is the Lord of such-and-such) unless he is a great one among their greats, and a master among their masters, as they said: Lord of Marwan, Lord of Ma'add, Lord of Khasaf, and as they said: Lord of al-Khawarnaq and al-Sadir and the like.\nS said: It was mentioned that a group from Abd al-Qays came to Umar ibn al-Khattab, may Allah be pleased with him, and sought his judgment regarding this water source, meaning al-Sulasil. Some of the people recited this saying of Talid al-Abshami to him, so he judged the water to the descendants of this Amir. These are noble verses recited to us by Abu al-Nada, may Allah have mercy on him. The story is what Ibn al-Sirafi mentioned, except he did not mention their names and titles, and I will mention that after presenting the verses. They are:\n*Banu Qays came to us with a huge gathering ... and Shann and the Abna' (Sons) of the great Amur.*\n*They spent the night in the stopping place of a guest until ... the sparrows chirped with the dawn in the illuminating garden.*\n*We rose against them and drew our weapons ... Yemeni [swords] and honed ones from India, cutting.*\n*And arrows from the valley in the hands of our archers ... and short-haired horses like the ropes of well-buckets, strong.*\n*We healed the thirst from Sumayr and Ja'un ... and the Lord of al-Sulasil, Amir, escaped us.*\n*And he became certain that if the horses attached to him ... there would be for the shoots of al-Jawf after him a pollinator.*\n*Calling in the desert of al-Faruq while appeared ... the peaks of Dab': That open the door, O Jabir.*\nThe Abna' (Sons) are the 'Uqad (Knots): Awf, 'Awafah, Malik, and Jusham, sons of Sa'd, who allied together. The Amur from Abd al-Qays are: Al-Dil, Ijl, and Muharib, sons of Amr ibn Wadi'ah ibn Lukayz ibn Afsa ibn Abd al-Qays.\n\nIbn al-Sirafi said: Abu Sidra al-Asadi said:\n*Hawwas thought and became certain that I ... would ransom myself with it from one whom I do not fight.*\n*So I said to him: Dust in your mouth! For it is ... the young she-camel of a man who is treating you with hospitality, not what you fear.*\n\nHe said: In the Book [Sibawayh]: Abu Sidra al-Asadi. Some claimed he is Hujaymi from Banu al-Hujaym.\n\nS said: This is the place of the proverb:\n*You were endowed with stupidity, so stick to what you were endowed with ... What does the fool endowed with provisions do with intelligence?*\nIf Ibn al-Sirafi were provided for according to the measure of his correctness, he would have eaten leather strips out of hunger. Anyone who does not know whether Abu Sidra is Hujaymi or Asadi should not expose himself to speaking on such poetry. Abu Sidra is Suhaym ibn al-A'raf, from Banu al-Hujaym ibn Amr ibn Tamim. He has beautiful short pieces in the Book of Banu al-Hujaym ibn Amr ibn Tamim. Among them is his saying:\n*To Hassan from the sides of Najd ... we saddled the white camels blowing in their nose-rings.*\n*We count kinship and we count in-law relationships ... and happy by kinship is he who respects it.*\n*And whatever you do, my soul ... counts the righteousness of your soul as part of its richness.*\n\nIbn al-Sirafi said: The Rajiz said:\n*I describe a donkey from the donkeys of Khanzarah.*\n*In every donkey are two hundred glans (penises).*\nHe said: Khanzarah is a place in my opinion. The Rajaz attributed to Al-A'war ibn Bara' al-Kilabi, satirizing Umm Zajir, both from Banu Kilab:\n*I describe donkeys that came to Ahmara.*\n*And every donkey is lined with ten.*\n*In every donkey are forty glans.*\n*They met Umm Zajir at al-Muzdarah.*\n\nS said: This is the place of the proverb:\n*Oh thirst! And the water is near me ... and the Barni dates are in my lap.*\nIbn al-Sirafi did not know from this poetry what would quench the thirst of the thirsty. If poetry's completion and story are not known, it has no sweetness in the palate of the beneficiary. The story of this Rajaz, as Abu al-Nada dictated to us—may Allah have mercy on him—is that a woman and a man from Banu Abdullah ibn Kilab satirized each other. As for the man, he is Al-A'war ibn Bara', and as for the woman, she is Umm Zajir, and they were both slaves. Al-A'war ibn Bara' said:\n*I describe donkeys that came to Ahmara.*\n*And every donkey is lined with ten.*\n*In every donkey are forty glans.*\n*They met Umm Zajir at al-Muzdarah.*\n*So they screwed her coming and going.*\n*Until the light of Venus appeared.*\n*They came with a flood like the notch of the chest-callus [of a camel].*\nAnd Umm Zajir said:\n*O son of the one who harms the milch camels.*\n*Then covers them until the morning.*\n*Then she is screwed in a swollen vulva.*\n*The scoundrel or the farmer piles her.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 14
  },
  {
    "serial_number": "6834862",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "He said: So Umm Zajir and Al-A'war met at the place of a man from Quraysh who was sent as a tax collector over Banu Kilab. While the Qurashi had people gathered around him collecting charity, he heard Umm Zajir rising while saying: \"Hush struck one, hush struck one, your father's penis is bright red, swallowing frogs, and the head and trotters, and every deceitful lizard.\" He said: And between them were ugly exchanges.\n\nIbn al-Sirafi said: The poet said:\n*By my life, if I have become, O Umm Jahdar ... distant, I have worn out an excuse in seeking.*\n*May my people lose each other as they sell my soul ... for a girl—woe to them after her, woe.*\nAnd he said following this: The poet said:\n*Do not lower the curtain, O Umm Jahdar ... Suffice the peaks of the mountains as a curtain between us.*\n*If only I knew, is there to Umm Jahdar ... a way? For as for patience from her, there is no patience.*\n\nS said: This is the place of the proverb:\n*And if you undertook a matter or were concerned with it ... let there be no falling short nor cheating.*\nSuch poetry, if its speaker is not known, and the cause that pulled it is not mentioned, becomes as was said:\n*And some speech has no utility ... like churning water has no butter.*\nThe cause of this poetry is that Ibn Mayyadah used to compose love poetry about Umm Jahdar bint Hassan al-Murriyyah. Her father swore he would marry her to a man not from his clan and would not marry her in Najd. A man from Syria came to him, so he married her to him. He took her and went out with her to Syria. Ibn Mayyadah followed her until his family caught up with him and brought him back silenced, not speaking out of passion. I have affirmed for you all the verses because they are from the necklaces of poetry:\n*Greeting a quarter at Dhu al-Ush that is effaced ... and a quarter at al-Mamdur, silent, desolate.*\n*Violent winds struck it until its era was disguised ... sweeping the dust in it, a sweeping.*\n*So Dhu al-Ush, may you be watered by the clouds, and may ... the wild herds not cease grazing in you, thick, flourishing.*\n*My two friends from Ghayz ibn Murrah, convey ... messages from us that do not increase [burden] like a load.*\n*And pass by Tayma, asking its Jews ... for regarding Tayma, from its rider, is a mention.*\n*And by al-Ghamr she passed, and her mounts veered ... so the morning clouds watered the valley of Niyan then al-Ghamr.*\n*And when she saw that they approached Abayir ... traversing a plain, leaving in it gaps.*\n*The distance of the abodes stirred [sorrow] for her, and she mumbled ... matters and needs with which her chest was tight.*\n*If she passes Busra, her connection is cut ... and two doorkeepers lock a palace without her.*\n*So there is no connection unless ... young camels bring us close, crossing the desert with us like a bridge.*\n*Ghurayri in lineage or Matili ... disputing the hands of the people, twisting, brown.*\n*When the sun circled from an orbit and put down ... its carpets, and the squinting eyes became soft.*\n*If only I knew, is there to Umm Jahdar ... a way? For as for patience from her, there is no patience.*\n*And if a vow brought Umm Jahdar near ... to me, I would have made a vow incumbent upon my neck.*\n*Do not lower the curtain, O Umm Jahdar ... Suffice the peaks of the mountains as a curtain between us.*\n*By my life, if I have become, O Umm Jahdar ... distant, I have worn out an excuse from seeking.*\n*If only I knew, will our family settle ... and your family in meadows at the belly of al-Liwa, green.*\n*And will the wind knock, blowing at midnight ... with your scent, mounting with it the dusty highlands.*\n\nIbn al-Sirafi said: Al-Khansa said:\n*She weeps for a sadness; she is the tearful one and she wept ... and without him from the surface of the earth are veils.*\n*The yearning of a 'walih' (distraught female) who lost her familiar one ... she has two yearnings: a soft one and a loud one.*\n*She grazes as she grazed, until when she remembered ... it is nothing but coming and going.*\n\nHe said: The *walihah* could be a wild cow, or a gazelle, or a she-camel.\n\nS said: This is the place of the proverb:\n*Either Khuza'ah or Muzaynah or ... Either Fazarah or Banu Abs.*\nIbn al-Sirafi's statement: \"The *walihah* could be such or such or such\" increases the beneficiary's confusion, leaving him in ambiguity, not knowing which to take. This statement also indicates Ibn al-Sirafi's stupidity, for the Arabs do not strike proverbs regarding intensity of yearning and distraction (*walah*) using gazelles and cows, nor do they say: \"More yearning than a cow\" nor \"More yearning than a gazelle.\" They have said: \"More yearning than an old she-camel (*sharif*).\" Mutammim ibn Nuwayrah said:\n*And not the passion of three nursing [camels] loving [their young] ... who found a drag-mark of a foal and a death-place.*\n*They remind the sad one with grief of his grief ... when the first one yearns, they coo for it together.*\n*[Are they] more passionate than me the day I left Malik ... and the hearing announcer stood with him and announced.*\nAnd another said—recited to us by Abu al-Nada, may Allah have mercy on him:\n*And they separated after uniting for an intent ... neighbors must surely separate.*\n*The sturdy camels do not have patience when they separate ... until they yearn, but the human has patience.*\nAnd a Bedouin from Banu Kilab said:\n*Whoever has not yearned, then I and my she-camel ... at Hijr for the people of the Hima are yearning.*\n*She yearns and shows what she has of ardor ... and I hide that which, were it not for sorrow, would have killed me.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 15
  },
  {
    "serial_number": "6834863",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "Ibn al-Sirafi said: Hibr ibn Abd al-Rahman said:\n*She spent the spring in Liwa to her Ruha' ... until when it flew from her long hair.*\n*And became like sheets upon her back ... she follows the sound of the braying from her folds.*\n*She pulled upon it the ink (dark color) from her cloak ... she remembered Tuqtad by the coldness of its water.*\n*And the urine dried upon her thighs.*\n\nS said: This is the place of the proverb:\n*By Allah, sleeping at the sandy hill of al-Hafar ... is easier than binding skins at the early dawn.*\n\nIf Ibn al-Sirafi had busied himself with syntax and a little lexicography, and not presented such Rajaz poetry whose author and order of verses he did not know—it would have been easier for him, and less likely to attract criticism upon him. The sequence of the verses as I have established for you here is what Abu al-Nada, may Allah have mercy on him, dictated to us, and he mentioned they are by Abu Wajzah al-Sa'di.\n*She remained at that Qahr from her equal ... between Uqaybayn to her Ranqa'.*\n*In what cooled the eye of her pastures ... from the grass of the earth and its fruit.*\n*Until when was completed of her thirsts ... and the urine dried upon her thighs.*\n*And the weakest of her shepherds gathered her ... the gathering of the young girl of the fold of her cloak.*\n*She remembered Tuqtad by the coldness of its water ... and the ancient reeds of its wells.*\n*So she outstripped the incapable of her shepherds ... and came in the morning more disheveled than her camels.*\n*The pulling [at the well] blesses her thirst ... [she came to] a Talh tree spending the night in its shelter.*\n*As if she, when she attended to her water ... was a battalion that returned to its banner.*\n*The enemies shook her from meeting her ... she almost in the crowd and in her aggression.*\n*Drips the muscle from her folds ... when the summer [camel] howls from her nourishment.*\n*He insisted like thunder from her singing.*\nAbu al-Nada said: Tuqtad is a village in Hijaz, between it and Qulha is a mountain called Adimah. At the top of this valley are meadows called al-Falaj (with a dotted Jim), gathering people in the days of spring. It has many holding places for rainwater, which suffice them for their summer and spring if they get rain.\n\nIbn al-Sirafi said: Jarir said:\n*Is it Tha'labah the Horsemen or Riyah ... you equated Tuhayyah and the Khushab with them?*\n\nHe said: Tha'labah and Riyah are two tribes from Banu Yarbu', who are Jarir's people. Tuhayyah is from Banu Malik ibn Hanzalah ibn Malik, and they are closer to Al-Farazdaq than to Jarir. He addresses Al-Farazdaq with this, and denies that he equates Tuhayyah and al-Khushab with Banu Tha'labah and Banu Riyah.\n\nS said: This is the place of the proverb:\n*Two shares of my heart: A share obeyed me ... and a share departed with the union of the beautiful women.*\n\nIbn al-Sirafi mentioned some of what is in the verse incorrectly, which is the lineage of Tuhayyah from Banu Malik ibn Hanzalah. Rather, she is: Umm Awn and Abu Sud, the two children of Malik ibn Hanzalah, and Tuhayyah is the daughter of Abd Shams ibn Sa'd ibn Zayd Manat ibn Tamim. And al-Khushab—which is what he did not know—are Rabi'ah and Rizam, the two sons of Malik ibn Hanzalah; they are called al-Akhshaban, and in plural they say al-Khushab. His saying: \"Tha'labah and Riyah are two tribes from Banu Yarbu'\" is from the blindness of his heart regarding lineage, because it is said \"So-and-so and So-and-so are two tribes from Banu So-and-so\" if there are grandfathers and fathers between them and the great tribe. But if they are from his loins, it is only said: They are his two sons. Tha'labah and Riyah are the two sons of Yarbu' ibn Hanzalah.\n\nIbn al-Sirafi said: Amr ibn Ma'di Yakrib said:\n*I want his gift and he wants my killing ... your excuse regarding your friend from Murad.*\n*If you met me, you would have met a peer ... and the fat of your heart would have cleared from blackness.*\n\nHe said: The cause of this poetry is that Amr ibn Ma'di Yakrib raided with a man from Murad called Ubayy. When they wanted to divide the spoils, he asked Amr to give him the like of what he took. Amr refused to do that, so Ubayy threatened him. It reached Amr that he threatened him, so he said this poetry.\n\nS said: This is the place of the proverb:\n*Indeed, in this lowland, the lowland of Tihama ... is the desire of the soul, not in the rugged terrain of the plateau of Najd.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 16
  },
  {
    "serial_number": "6834864",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "The poet's intent with this verse is not Ubayy whom Ibn al-Sirafi mentioned. How could that be, when Ubayy is Ubayy ibn Mu'awiyah ibn Subh, from Banu Musliyah ibn Amir ibn Amr ibn Illah ibn Jald ibn Malik ibn Udad, and he is not from Murad? So how could he say: \"From your friend from Murad\"? Rather, the intent of this verse is: Qays ibn Hubayrah ibn Abd Yaghuth al-Muradi, who is the nephew (sister's son) of Amr ibn Ma'di Yakrib, and Hubayrah is al-Makshuh. As for Ubayy—who is from Banu Musliyah—he is the one about whom Amr says in another poem of his:\n*Ubayy wished to meet me ... an ostrich of a desert seeking the hatching place.*\nAnd about him he also says:\n*And Ibn Subh heedlessly threatening me.*\nThe cause of this poetry is that Qays ibn al-Makshuh said addressing Amr in a long poem of his:\n*O convey to Abu Thawr a message ... there is no love between me and you.*\n*You wished that fates would meet you ... Abu Thawr, so do you have a desire for combat?*\n*If today you want a peer ... then bring close your person to my person.*\n*With horses that meet from us and from you ... otherwise, individuals to individuals.*\nSo Amr answered him in a long poem of his:\n*I want his gift and he wants my killing ... your excuse regarding your friend from Murad.*\n*And whoever drinks from the water of al-Jawf excuses ... what was of the foolishness of the heart.*\n\nIbn al-Sirafi said: Shaqiq ibn Jaz' ibn Riyah al-Bahili said:\n*And it returned to him that the horses were ... streaks between fleshy and thin.*\n*As if their excuse at the south of Sula ... was ostriches waking up in a barren land.*\nHe said: Sula is a specific place. Banu Dabbah had raided Bahila, led by Hakim ibn Qabisah ibn Dirar al-Dabbi. Bahila defeated them, wounded Hakim, and killed Ubaydah al-Dabbi.\n\nS said: This is the place of the proverb:\n*The noble returned with captives as spoils ... and Banu Nahd returned with two penises in a basket.*\nIbn al-Sirafi brought two scandalous mistakes in explaining this poetry, because he mentioned that Banu Dabbah raided Banu Bahila, and Bahila defeated them. This is due to his ignorance of Sula, whether it is in the land of Bahila or the land of Dabbah. He also presented the verses separated, not consecutive, and there is also advancing and delaying in them. The correct version is what Abu al-Nada, may Allah have mercy on him, dictated to us. He said: Shaqiq ibn Jaz' al-Bahili raided Banu Dabbah at Sula and Sajir, which are two meadows belonging to Ukl. Suwayd ibn Kura' meant them by his saying:\n*My heart is dispersed from his love at Sajir ... and another is at Kufah, a distant love.*\nDabbah, Ukl, Adi, and Taym are allies neighboring each other. Regarding them Laqit ibn Zurarah says:\n*Has anyone seen the two slaves when mentioned to him ... Adi and Taym seeking someone to ally with?*\n*So ally, for by Allah you will not descend a valley ... of the earth except you are knowledgeable of humiliation.*\n*And Dabbah is a third slave with no brother ... just as the changer pushes the spurious coin with the palm.*\nReturning to the story - so he defeated them. Awf ibn Dirar escaped that day, and Hakim ibn Qabisah ibn Dirar after being wounded, and they killed Ubaydah ibn Qadib al-Dabbi. Shaqiq ibn Jaz' said regarding the escape of Awf ibn Dirar:\n*Awf escaped us at the spear points ... at al-Warha' stabbing at the bridle.*\n*He was the healing [of revenge], but saved him ... the excellence of the back [of the horse] and the high girth.*\n*Like an ash-colored pigeon thrown ... by the two sides [of the valley] from the ash-colored pigeons.*\n*He disdained food for it [the horse] so he did not lose it ... the morning of fright when Azam [hardship] bit.*\nAnd Shaqiq said regarding the Day of Sula:\n*My eye was cooled regarding them at Sula ... and the meadow of Sajir possessing the Arar plant.*\n*I repaid the Mulhabbins with what I slid ... of misery, the spears of Banu Dirar.*\n*We break the upper parts [of spears] in their backs ... and the Samhari spear goes through in breaking.*\n*And Hakim escaped from our spearheads ... choking [with saliva/distress] like the escape of the wild ass.*\n*And it returned to him that the horses were ... streaks between fleshy and thin.*\n*As if their excuse at the south of Sula ... was ostriches waking up in a barren land.*\n*And when I saw Abu Hudayr ... thrown down by the people, my caution became true.*\n*I was not envious of anything upon him ... and nothing benefited me except my taking an omen.*\n*I left the birds circling over them ... as women circle an idol.*\n*And were it not for the night, it would have returned to them with misfortune ... with the most ill-omened bird, ascending and deviating.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 17
  },
  {
    "serial_number": "6834865",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "*So if you kill Abu Hudayr ... then I, my victory has healed my soul.*\n*They left Ubaydah al-Dabbi falling ... on the hands, his lower garment soiled with sand.*\n\nIbn al-Sirafi said: Al-Ajir al-Saluli said:\n*So the worries of the chest spent the night, diverse, returning to him ... as a corpse in the open, killed, is visited [by beasts].*\n*While he was buying his saddle, a sayer said ... whose is a camel, loose of the side, tall?*\n*Adorned with noble collars, as if they are ... remnants of silver whose sound is a jingle.*\n\nS said: This is the place of the proverb:\n*You have nothing of Buthaynah except what you see: Longing that concerns you and the alienations of distance.*\n\nThe beneficiary has nothing from what Ibn al-Sirafi presented in these verses except trifles, confusions, and mix-ups, from which a person gains no benefit. This poetry is not by Al-Ajir al-Saluli, nor are the verses orderly. Rather, the correct view is that they belong to Al-Mukhallab al-Hilali as Abu al-Nada, may Allah have mercy on him, recited to us. He said to us: There is no Bedouin on earth but he memorizes this poem:\n*I felt regarding her the passion of one whose lean camel was lost ... in Mecca one day while the companions were dismounting.*\n*He sought what he sought until the night came without them ... and a wind raising the dust, sweeping.*\n*He came to his two companions after his quest was lost ... where Amir and Salul met.*\n*He said: Carry my saddle and your saddles together ... They said to him: You speak all foolishness.*\n*He said: Carry me and leave the saddle, for it is ... in a place, and outcomes change.*\n*They said: Allah forbid! So their two beasts galloped ... and their saddles were Mahri camels and swift.*\n*He complained of roughness from his two companions, and his cash ... when he stood to bargain for riding camels was little.*\n*While he was buying his saddle, a sayer said ... whose is a camel, loose of the side, submissive?*\n*Adorned with noble collars, which sprinkle him ... crescents of Jinn, between which are separators.*\n*So he hailed [God] for a time, then went with his lean camel ... and the sun of the day had time to set.*\n*The horn of the sun did not complete [setting] until he made it kneel ... at Qarn, and for the hasty ones there is slipping.*\n*When he folded [passed] the two figures and turned away from them ... and settled him at al-Naqra while he was submissive.*\n*They stood dragging their clothes, both of them ... because of what they had kept secret from the friend shortly before.*\n*He said: Lift your saddles and depart ... for the water of the water-skins in the desert is little.*\n\nHe said: Al-Mukhallab has curious short pieces. Among them is his saying:\n*The dark beautiful women surprised us at al-Saram after ... new means [of contact] occurred between us.*\n*The heart refused all but his love, unhurried ... possessors of front teeth and leaning hair branches.*\n*Wide of buttocks, languid of eyes ... beautiful when the folds of the braids appear.*\n*As if polish from silver pitchers ... when they stand, appears from the gaps of the shifts.*\n*Those capture the naive youth himself ... and bind the one who disputes with them in the ropes.*\n\nAnd he is the one who also said:\n*Nay, by the majesty of Allah, if a union were sold ... we would bid high then for your union.*\n*And if proximity of distance were sold, I would buy it ... at a high price or by the judgment of your men.*\n*And if one from the estrangement of the abode were ransomed ... by something, I would raise the ransom for your separation.*\n*And if they slaughtered with the sword the most passionate one ... for you, my soul would be certain that I am that one.*\n*So reap the young she-camel of al-Maliki despite the pain ... to a land beloved in the curve of your sandals.*\n*So by Allah, if I made my saddle reach her family ... at the plateau of al-Safa, that you be released from your ropes.*\n*And that you not traverse desert after desert ... and that you not spend a night in your shackle.*\n*And that you descend Dhat al-Sulaym and hear ... in it the sound of the rumbling of the intense camels of your beauty.*\n\nIbn al-Sirafi said: Amir ibn Juwayn al-Ta'i said:\n*Have you not seen how many at the bend of Malakat ... and how many at the highland of white camels kept for breeding?*\n*And I have not seen like her, the spoil of one ... and I restrained myself after I almost did it.*\n\nHe said: The Jaz' is the bend of the valley. Malakat is the plural of Malikah (Queen). Al-Sa'id is the face of the earth.\n\nS said: This is the place of the proverb:\n*Gently, let them come to Siwaj ... There the news of the barbarians appears.*\n*And the blacksmith and the shopkeeper and the weaver.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 18
  },
  {
    "serial_number": "6834866",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "This is the most foolish thing Ibn al-Sirafi came up with. If he had shame, he would not have approved for himself to enter into such a heinous misspelling. But there is no cure for one who has no shame. The correct reading is: *Ma bi al-Jaz' min Malakan* (What is at the bend of Malakan). Malakan is a mountain in the land of Banu Tayy. It used to be called: Malakan of the Romans, because the Romans used to inhabit it once in the Jahiliyyah. Abu al-Nada, may Allah have mercy on him, recited:\n*Malakan of the Romans refused to be grateful to us ... and a day at the slope of al-Qur did not pass.*\nHe said: The parallel of Malakan in meter is Warqan, which al-Khudari—from Banu Khidr ibn Muharib ibn Khasafah—mentioned:\n*If the peaks of Warqan vanished ... I would find my affection for you not vanishing.*\n*So say to the pigeon of al-Kharja': Rain ... for your shadow where the noon nap overtakes you.*\nIts parallel is also Badlan, which Imru' al-Qays mentioned:\n*Our nights at the slope of Badlan.*\nParallels to that are many. Amir ibn Juwayn al-Ta'i recited these verses about Hind, the sister of Imru' al-Qays ibn Hujr, when he fled from al-Nu'man ibn al-Mundhir and stayed with him. Amir wanted to betray him, so he moved away from him. They are:\n*Are the litters of Hind those departing ... to grieve me, or is my female friend coquetting?*\n*No egg which the male ostrich spent the night surrounding ... and spreading soft feathers for it, velvety.*\n*And placing it between the wing and his side ... against a dry chest at the soft ground of Hawmal.*\n*Is more beautiful than her the day she said: Do you not see ... taking a replacement friend? For I am changing.*\n*Have you not seen what is at the bend of Malakan ... and what is at the highland of white camels kept for breeding?*\n*And I have not seen like her, the spoil of one ... and I restrained myself after I almost did it.*\n\nIbn al-Sirafi said: Al-Shammakh said:\n*And she promised me what I do not seek its benefit ... the promises of Urqub to his brother at Yatrab.*\nYatrab: A place on the pattern of Yarm'a, and it is other than Yathrib.\n\nS said: This is the place of the proverb:\n*He revives the eggs and kills the chicks.*\nOften Ibn al-Sirafi is fond of heinous misspelling and leaves the pure explicit aside. Yatrab here on the weight of Yarm'a as Ibn al-Sirafi mentioned is a heinous misspelling. The correct reading in this verse is Yathrib, which is the city of the Prophet, peace and blessings be upon him; it was called Yathrib in the Jahiliyyah, and there the story of Urqub occurred. As for Yatrab and Bilad, they are two lands near Hajar al-Yamama, whose arrows (gambling shares/crops) are good. The verse is from verses by Al-Shammakh, which are:\n*She promised me what I do not seek its benefit ... the promises of Urqub to his brother at Yathrib.*\n*And she promised me a running mare between its wall ... and its side, half a far limit.*\n*She sways as maidens swayed over their sisters ... virgins in a tent with ropes.*\nAbu al-Nada, may Allah have mercy on him, recited to us regarding the promises of Urqub—and it is a proverbial verse—:\n*As if the promises of the Quda'i to his neighbor ... were the promises of Urqub to his brother at Yathrib.*\n\nIbn al-Sirafi said: Layla al-Akhyaliyyah said:\n*Indeed al-Khali' and his group from Amir ... are like the heart, clothed in a chest and a windpipe.*\n*Do not approach ever the family of Mutarrif ... whether they are oppressor or oppressed.*\n\nHe said: She praises thereby Hammam ibn Mutarrif, and he is from the offspring of al-Khali'.\n\nS said: This is the place of the proverb:\n*Indeed, the defenders of glory are few.*\nKnowledge of such poetry and the genealogy in it is rare. The verse is not by Layla al-Akhyaliyyah, but rather it is by Humayd ibn Thawr al-Hilali in his poem that begins:\n*When the loads appeared, I thought them ... Dwm trees at Ayla, fresh, covered.*\nIt consists of [several] verses. Ibn al-Sirafi did not mention al-Khali', who he is among people. He is from Banu Uqayl. The Khula'a (Ousted ones) are: Amr, Amir, and Uwaymir from Banu Rabi'ah ibn Uqayl. Al-Khatim the Thief meant them by his saying:\n*If I were from the clan of al-Asamm ibn Malik ... or the Khula'a or Zuhayr of Banu Abs.*\n*Then Qays would have defended behind me with stones ... and the criminal would not have been surrendered for what he committed yesterday.*\n\nIbn al-Sirafi said: Humayd ibn Thawr said:\n*And she is nothing but in a loincloth and a shift ... the raid of Ibn Hammam on the tribe of Khath'am.*\n\nHe said: He is Amr ibn Hammam ibn Mutarrif from the Khula'a. Khath'am had killed his father Hammam ibn Mutarrif, so he came to Najdah ibn Amir al-Haruri [the Kharijite] and pretended to be of his opinion, asking him to send some of his companions with him. So Najdah sent horses with him. He raided Khath'am and struck them, taking revenge for his father, and became a head among the Kharijites. When he fulfilled his need, he returned to his people and settled among them, then put the sword to the Najdiyah [Kharijites].\n\nS said: This is the place of the proverb:",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 19
  },
  {
    "serial_number": "6834867",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "*Your two garments deceived me regarding [the size of] my testicles ... Would that my testicles were on my neck.*\n\nHumayd's Mim-rhymed poem, which begins:\n*Ask the quarter where Umm Salim headed ... and is it a habit for the quarter to speak?*\ndeceived Ibn al-Sirafi, so he imagined that this verse was from it. Al-Kamar (testicles/glans) resemble Al-Kamar. The verse belongs to Al-Tammah ibn Amir ibn al-A'lam ibn Khuwaylid al-Uqayli. He is an excellent poet and has beautiful short pieces. He is the one who says in a poem of his boasting:\n*And they traveled from the two salty lands, the salty land of Sa'ayid ... and Tathlith, a journey riding the vertebrae of old camels.*\n*They did not fall short in the journey until they reached ... Banu Asad in Darahim and Banu Ijl.*\n*Leading short-haired horses from the daughters of Mukhalis ... and A'waj, followed by the camels and the herd.*\nAl-Tammah al-Uqayli said:\n*I knew for Salma a trace of a dwelling you would think ... playgrounds of Jinn or a written book.*\n*My covenant with Salma and youth is as if it is ... a palm branch growing in a wet place, so it straightened.*\n*And she is nothing but possessor of a soft drape and a shift ... the raid of Ibn Hammam on the tribe of Khath'am.*\n*A young girl, she did not exceed the wrapping cloth ... nor did her breast exceed dreaming [swelling].*\n*I loved her amidst the girls, naive ... and she was adorned with nothing but arranged pearls.*\n*Until she called for the chemise before her peers ... and returned appearing more beautiful and grand than them.*\n*And her two bracelets choked [her wrists], so they did not fail her ... when they reached the hands, to become straight.*\n*And she returned like a sand-dune from a compacted dune ... and she filled the two anklets until they cracked.*\n\nIbn al-Sirafi said: Harith ibn Jabalah al-Udhri said:\n*Until it was as if there was nothing but remembering him ... and Time, whichever state, brings calamities.*\n\nS said: This is the place of the proverb:\n*The night mixed with the colors of the pebbles.*\nIbn al-Sirafi confused this name; it is Jabalah ibn al-Huwayrith al-Udhri. Ibn al-Sirafi cited the completion of the verses.\n\nIbn al-Sirafi said: Amr ibn Qami'ah said:\n*The daughter of Amr asked me about the ... lands when she did not recognize their signs.*\n*When she saw Satidama she wept ... To Allah belongs the milk of the day of the one who blamed her.*\n*She remembered a land wherein are her family ... her maternal uncles in it and her paternal uncles.*\n\nHe said: Satidama is a mountain, and 'ista'barat' means she wept.\n\nS said: This is the place of the proverb:\n*Whoever does not fatten a steed he used to ride ... in fertility, will stand with it in drought, lean.*\n\nI mentioned to you that whoever does not practice the science of stopping places will not succeed with such poetry. Because if the beneficiary does not know Satidama is in which of Allah's lands, he will not conceptualize the meaning of this verse, nor the cause of her weeping, nor the meaning that when she left the land of her people and fell into the land of the Romans, she wept and regretted that. Amr meant by these verses himself, not his daughter, but he used her as a metonym for himself. Satidama is a mountain between Mayyafariqin and Si'irt. Thus Abu al-Nada informed us. Amr recited this poetry when he went out with Imru' al-Qays to the Romans, and their story is well known.\n\nIbn al-Sirafi said: Dabi' ibn al-Harith al-Burjumi said:\n*Whoever's saddle is in Medina in the evening ... then I and Qayyar are strangers in it.*\n*And hasty birds do not bring near to the youth ... success, nor does he fail due to their slowness.*\n\nHe said: Qayyar is the name of his camel.\n\nS said: This is the place of the proverb:\n*A substitute for the falcon is a pied crow.*\nIbn al-Sirafi placed a heavy camel in the place of a swift horse. Qayyar is the name of his horse, not the name of his camel. It is the horse that Dabi' made trample some boys of the people of Medina until Uthman took him and imprisoned him.\n\nIbn al-Sirafi said: A poet from Hamdan said:\n*They pass by al-Dahna, light imply their bags ... and they exit from Darin dragging the bags.*\n*At a time when the bulk of their affairs distracted the people ... So snatch, O Zurayq al-Mal, the snatching of foxes.*\n\nHe said: Zurayq is a vocative, and it is a tribe. As if he said: Snatch, O Zurayq al-Mal. Al-Dahna is a place, and Darin is a place too. His saying: \"At a time when the bulk of their affairs distracted the people\": he means when people were occupied with sedition and wars. It is said: He describes merchant people carrying goods from Darin and selling them, passing by al-Dahna after selling their goods. And it is said: He describes thieves coming to Darin, stealing and filling their bags, then emptying them and returning to Darin.\n\nS said: This is the place of the proverb:\n*He gives him drink from every hand with a cup ... so the heart is between hope and despair.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 20
  },
  {
    "serial_number": "6834868",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "Ibn al-Sirafi spoke with all the speech he had regarding this poetry, but he did not succeed or prosper. This is because of what I told you: whoever has not trained himself in the science of genealogies and days (history), then objects to such poetry with his speech, targets himself for the tongues of critics. If the polite scholar does not know the speaker of this poetry, nor whom it was said about, nor the tribe addressed by it—who they are and from whom they are—he will not realize the meanings of these verses.\nThe story is that Al-Nu'man ibn al-Ajlan ibn al-Nu'man ibn Amir al-Zurqi—and Zurayq is Ibn Amir ibn Zurayq ibn Abd Harithah ibn Malik ibn Ghadb ibn Jusham ibn al-Khazraj—Ali, peace be upon him, appointed him over Bahrain. So a man from the Ansar said:\n*I see a sedition that has distracted the people from you ... So snatch, O Zurayq al-Mal, the snatching of foxes.*\n*For Ibn Ajlan, whom you have known ... squanders the wealth of Allah like the act of plunderers.*\n*They pass by al-Dahna, light their bags ... and they exit from Darin dragging the bags.*\nWhen you know the story and the order of the verses, the meaning appears to you in its truth, and it calls out for itself.\n\nIbn al-Sirafi said: The poet said:\n*And you, your place from Wa'il ... is the place of the tick from the butt of the camel.*\nMeaning he is the vilest of the tribes of Bakr ibn Wa'il and the lowest of them, for in the vileness of his rank and his falling, he is not paid attention to, like the tick attaching to the butt of the camel.\n\nS said: This is the place of the proverb:\n*If one sufficed, I would have sufficed him ... but with feathers the bird flies.*\nHow can this satirized person be the vilest of Bakr ibn Wa'il when he is a man from Banu Taghlib? This is also due to Ibn al-Sirafi's ignorance of genealogy, which is indispensable in knowing such poetry. The poet of the verse is Utbah ibn al-Waghul al-Taghlibi, satirizing Ka'b ibn Ju'ayl al-Taghlibi. So he is then the vilest of Banu Taghlib, not the vilest of Banu Bakr ibn Wa'il. It is a beautiful poem, beginning:\n*Perhaps the distance will bring Salma back ... and my Lord will gather the scattered hope.*\n*She captivated me with cool, scattered [teeth] ... sweet of the kiss, pure, distinct.*\nIn it he also says:\n*You named Ka'b [Heel] with the evil of bones ... and your father used to be called Al-Ju'al [Beetle].*\n*And you, your place from Wa'il ... is the place of the tick from the butt of the camel.*\nMeaning like the place of the tick, i.e., you are in the rear of the people.\n\nIbn al-Sirafi said: The Rajiz said:\n*When I ate fish and Farad (dates).*\n*I went length and I went width.*\nHe said: It is as if he said: I went long in a direction, and I went wide in a direction. He meant that his eating the fish and this type of dates made him tall, wide, and fat.\n\nS said: This is the place of the proverb:\n*The matter turned back until there remained sitting ... Abu Hubayrah giving Fatwas and Ibn Shaddad.*\nWhat indicates Ibn al-Sirafi's ignorance of this Rajaz, and his undertaking what he did not know, and his setting himself up to seek leadership without competence—is that he brought these two verses separated, not consecutive. Then his explanation of it: that this type of fish and dates made him tall, wide, and fat. How excellent is what the sayer said:\n*For every disease there is a doctor to treat it ... Except stupidity; its healer tires.*\nThe order of the verses, as Abu al-Nada dictated to us—and he claimed they are from the playful banter of the Bedouins—is:\n*If I drank sour milk and fresh milk.*\n*Then ate Raby (dates) and Farad (dates).*\n*And the butter tops some of that over some.*\n*Then I drank after it water/milk (Marad).*\n*I towered in length and went in width.*\n*As if I am eating wealth that is a loan.*\nAbu al-Nada said: This is like their saying:\n*If I had lunch and my soul felt good.*\n*Then there is no boy in the tribe like me.*\n*Except a boy who had lunch before me.*\nAnd his saying: \"I towered in length and went in width,\" he means from pride.\n\nIbn al-Sirafi said: A man from Khath'am said:\n*I resolved to stay until the morning ... for a matter; he who prevails prevails.*\nHe said: He means I resolved to stay until the time of morning, because I saw that opinion and prudence necessitate that.\n\nS said: This is the place of the proverb:\n*Every favor from Abu Ka'b is a catch.*\nThe amount Ibn al-Sirafi mentioned in explaining this verse is a lot from him [considering his usual], because he did not know the speaker of the verse, nor the reason that necessitated his saying: \"I resolved to stay until the morning.\" This verse belongs to Anas ibn Mudrik al-Khath'ami. He and another chief from his people raided some Arab tribes, supporting each other. When they approached the people, evening came, so they spent the night until night covered them. His companion stood up and left, taking no booty. Anas stayed until morning, then launched the horses against them, so he struck and took booty, and his companions took booty. This is the meaning of his saying: \"I resolved to stay until the morning,\" and it is the last of the verses.",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 21
  },
  {
    "serial_number": "6834869",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "Abu al-Nada said: Anas was a neighbor to Banu al-Harith ibn Ka'b. His companions found roughness from them, so they wanted to leave them. He said to them: \"Stay until the morning.\" When Banu al-Harith defeated Banu Amir on the Day of Fayf al-Rih, he said then what he said. The beginning of the verses is:\n*I called Banu Quhafah and they answered ... So I said: Arrive [at the water], for the arrival is good.*\n*I called for combat and they answered me ... with a arrival that increase does not restrain.*\n*As if a cloud flashed upon them ... from the summer clouds, thunders shaking it.*\n*I resolved to stay until the morning ... for a matter; he who prevails prevails.*\n\nIbn al-Sirafi said: Jarir said:\n*With Rajaz poems, O son of baseness, do you threaten me ... while in Rajaz poems, I thought, were baseness and weakness.*\n\nHe said: He meant by this speech Umar ibn Laja'. He says: Do you threaten me with Rajaz poems, while in Rajaz poems I thought were the baseness of poets and their weakness.\n\nS said: This is the place of the proverb:\n*No udders flow for the two sons of Qari'ah after it ... in a starting visitor nor a follow-up.*\n\nIbn al-Sirafi did not succeed in correctness in this verse. He erred in it from two aspects: First, he attributed the verse to Jarir, but it is by Al-La'in al-Minqari. Second, he changed the rhyme from \"al-fashal\" (failure) to \"al-khawar\" (weakness). He erred from a third aspect as well, which is that he made this verse a satire of Umar ibn Laja' al-Taymi, while it is a satire of Ru'ba ibn al-Ajjaj. The verses are by Al-La'in al-Minqari satirizing Ru'ba, and they are:\n*I am the son of clarity [well-known] if you know me ... O Rub [Ru'ba], and the deaf snake in the mountain.*\n*With Rajaz poems, O son of the hollow, do you threaten me ... while in Rajaz poems is the house of baseness and failure.*\n*There is no intelligence in the spurs on my leg ... at the betting, nor am I cauterized for scrotal hernia (afal).*\nUmm Malik bint Sa'd was from Kalb, and her co-wives used to call her Afil [one with hernia/defect]. Ru'ba is from Banu Malik ibn Sa'd, and these Banu Malik ibn Sa'd are called Banu al-Afil.\n\nIbn al-Sirafi said: The poet said:\n*Be, you and the sons of your father ... the place of the two kidneys from the spleen.*\nHe said: He says: Be close to the sons of your father and support them, and let your place from them be like the place of the two kidneys from the spleen.\n\nS said: I do not know this verse with this recitation. I know \"the place of the two kidneys from the spleen\" in verses by Shu'bah ibn Qumayr al-Mazini. Perhaps this is that, but changed. Shu'bah's verses are:\n*So convey to Malik a message from me ... and wealth does not substitute the messenger for you.*\n*You deceive us regarding ourselves and promise us slowly ... like the habit of the wolf creeping towards the gazelle.*\n*So do not do it, for your brother is sturdy ... in consolation regarding it, possessing resourcefulness.*\n*And we will make our two clients ... the place of the two kidneys from the spleen.*\n*And we will suffice in accidents for our brother ... as the right hand suffices for the left.*\n\nIbn al-Sirafi said: Al-Shammakh said:\n*Lean-bellied, as if his nostril when ... he sounds at their rear is a bellows.*\n*He has a sound like the voice of a singer ... when he seeks the stolen herd, or a flute player.*\n\nS said: This is the place of the proverb:\n*The piebald mare farted, she roamed in the halter.*\nThis is false. The verse is not by Al-Shammakh; it is by Rabi' ibn Qa'nab al-Fazari.\n\nIbn al-Sirafi said: Mudarris al-Asadi said:\n*Kilabi, Wabar-dwelling, Habtari ... she distanced herself from you and betrayed the promises and covenants.*\nHe said: In the Book [Sibawayh] it is *Habtariyah* with Ba and Ta dotted with two dots. And in his poetry it is *Hanthariyah* with Nun and Tha dotted with three dots. *Na'atka* means she distanced herself from you.\n\nS said: This is the place of the proverb:\n*I belittled him until my back sweated ... I let him go and he is safe, departing.*\nIbn al-Sirafi hovered around the correct [view] but did not land. This is because he mentioned that in the Book it is *Habtariyah* with Ba and Ta dotted with two dots, then said: And in his poetry it is *Hanthariyah* with Nun and Tha dotted with three dots. Then he remained silent and did not weigh the correct against the incorrect, so the beneficiary does not know which to take and which to leave. This is complete foolishness. The correct word in the verse of the Book is *Hanthariyah* with Nun and Tha dotted three times from above. He is Hanthar ibn Wahb ibn Wabar ibn al-Adbat ibn Kilab. In Tamim also—and this is not its place—is Hanthar ibn Ghawi ibn Salamah ibn Ghawi ibn Jarwah ibn Usayd. In Asad also is Hanthar ibn Kahil ibn Asad. As for *Habtar* with Ba and Ta dotted twice from above, he is Habtar ibn Adi ibn Salul from Khuza'ah. Similar to Mudarris's saying in arrangement is the saying of Sinja' ibn Rakkad al-Sulami, recited to us by Abu al-Nada:",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 22
  },
  {
    "serial_number": "6834870",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "*The heart refused all but loving her, an Amiri woman ... her abode is far from me and I do not attain her.*\n*Dibabi, fortified, Artawi ... often dwelling in the sides of the Arak trees.*\n*And she is nothing but [such that] a raid befits her ... you see the horses in it settled, their small groups.*\n\nIbn al-Sirafi said: Ru'ba said:\n*O abode of Afra and abode of the Bakhdan ... in you the murmuring one having a foal and the young gazelle.*\nHe said: *Al-Bakhdan* is narrated in two ways: *Bakhdan* on the weight of Ja'far, and *Bikhdin* on the weight of Zibrij.\n\nS said: This is the place of the proverb:\n*The humiliated one is eaten by the ostrich, and eaten by the vulture and the owl.*\nThe fool is he who is deceived by this saying of Ibn al-Sirafi. How can *Bakhdan* and *Bikhdin* be permitted when it is a proper noun? Names do not shift from their rules. Just as it is not permitted to say *Kiltham* with a kasra on the Kaf and Tha instead of *Kaltham*, so too *Bikhdin* with a kasra on the Ba and Dal is not permitted.\n\nIbn al-Sirafi said: Imru' al-Qays said:\n*Excellent is the youth whom you seek the light of his fire ... Tarif ibn Mal, the night of hunger and cold.*\nHe said: The witness in it is the truncation (tarkhim) of Malik outside of the vocative case.\n\nS said: This is the place of the proverb:\n*Leave raiding unless you sell and rub.*\nIbn al-Sirafi was not among the men of genealogy, so he erred regarding the saying of Tarif ibn Mal an error whose two ends do not meet. How can Mal be a truncation of Malik as he claimed, when the man's name is Mal (Mall)? He is Tarif ibn Mal ibn Umayrah ibn Taym ibn Awf ibn Malik ibn Tha'labah from Tayy.\n\nIbn al-Sirafi said: Al-Farazdaq said:\n*I inherited from my father his morals: hastening hospitality ... and striking the hocks of the following camels with its 'Shabub'.*\nHe said: *Al-Shabub*: The sword.\n\nS said: This is the place of the proverb:\n*Rejoice in his joy ... there is no rest from you.*\nWhen will Ibn al-Sirafi bring something with good in it? When was the sword called *Shabub*? It is but a misspelling. The correct word is *Sabubaha* with an undotted Sin. He means that he hamstrings (cuts the hocks of) the camels. *Al-Sab*: Cutting. From it is the saying of Dhu al-Kharq:\n*So what was the sin of Banu Malik ... that a boy of theirs insulted so he was cut (Subba)?*\n*With a white [sword] having ridges, sharp ... cutting off the bones and peeling the nerves.*\nHe means by *Sabubiha* the soul of the praised one.\n\nIbn al-Sirafi said: Labid said:\n*We, the sons of the mother of the four sons ... and we are the best of Amir ibn Sa'sa'ah.*\nHe said: Umm al-Banin is the wife of Malik ibn Ja'far ibn Kilab. She bore him five sons: Mu'awiyah ibn Malik, called Mu'awwid al-Hukama (Trainer of the Wise); Amir ibn Malik, Mula'ib al-Asinnah (Player with Spears); Salma ibn Malik, Nazzal al-Madiq (Dismounter in Straits); Rabi'ah ibn Malik, Rabi' al-Muqtarin (Spring of the Destitute), who is the father of Labid; and al-Tufayl ibn Malik, Faris Qurzul. So Labid needed to say \"Mother of the Four Sons\" for the sake of poetry, though they were five.\n\nS said: This is the place of the proverb:\n*A bucket (hawwabah), multicolored, quenching a returning drinker.*\n*Al-Hawwabah*: The bucket. Such genealogy exhausts Ibn al-Sirafi and his likes who have not worked in the science of genealogy, nor exerted themselves in it. Ibn al-Sirafi erred in his saying: that Salma ibn Malik is from the children of Umm al-Banin. For the children of Umm al-Banin are five: Ubaydah, Tufayl, Mu'awiyah Mu'awwid al-Hukama, Amir Mula'ib al-Asinnah, and Rabi'ah the father of Labid the poet—sons of Malik ibn Ja'far. Their mother is Umm al-Banin bint Amr ibn Amir ibn Sa'sa'ah. As for Salma and Utbah, the sons of Malik, their mother is Hind, a woman from Banu Sulaym. Ubaydah ibn Malik was not like his brothers in fame and renown, but he was truthful and pious. Labid only mentioned the four notables.\n\nIbn al-Sirafi said: Qays ibn Dharih said:\n*The slanderers surrounded me and disturbed me ... So oh people, for the obeyed slanderer!*\nHis saying: \"So oh people, for the obeyed slanderer\"—he meant that she obeys them when they incite her to abandon him and distance herself from him.\n\nS said: This is the place of the proverb:\n*Turn over, O turner.*\nIbn al-Sirafi turned the meaning of this verse from correct to incorrect. The one obeying the slanderer here is Qays, not Lubna. This is because his father and a group of his people gathered against him until he divorced Lubna, so he regretted it. He began to say in a long poem of his:\n*O my sorrow! And my illness has returned to me ... and parting from Lubna was like deception.*\n*The slanderers surrounded me and disturbed me ... So oh people, for the obeyed slanderer!*\n*So I became this morning blaming myself ... for a thing that is not possible.*\n*Like one cheated, biting his hands ... his loss becoming clear after the sale.*\n\nIbn al-Sirafi said: Al-Ajir al-Saluli said:\n*Do not make my guest a guest brought near ... and another isolated from the house, put aside.*\n*And do not assign me a servant I do not love ... lest a fever and headache seize me from that.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 23
  },
  {
    "serial_number": "6834871",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "He said: He means do not rank my guests, honoring some and humiliating some, but honor all of them and do not despise any one of them. He said: And his saying \"And do not assign me a servant I do not love to serve me, lest I get a fever from hating his service.\"\n\nS said: This is the place of the proverb:\n*If you came to Anbasa ibn Yahya ... you returned garlanded with the boots of Hunayn [empty-handed].*\nWhat benefit is there for the beneficiary in what Ibn al-Sirafi mentioned here of saying: Do not rank my guests, honoring some and humiliating some, without mentioning what the cause of that is, and why the speaker of this poetry hated honoring some and humiliating others? This, by Allah, is obvious foolishness, and the foolishness of men is plentiful. Al-Ajir only meant by this statement that if she honored some guests over others, it was because of her desire for him [the guest]; and likewise if she employed a servant Al-Ajir hated, that was also for a suspicious matter. Whoever does not know the story of these verses and the verses of the whole poem—for every verse indicates what I told you—does not know the meaning of this poetry. That is because Al-Ajir's wife was recalcitrant towards him, so her matter made him suspicious. She said: I must go to Hajj. Her son said: My mother must go to Hajj, so let her saddle one of these camels of hers. He did not see her except leading one of them which she had brought and bridled. So he said—and she is Athmah bint Ma'bad ibn Abd al-Rahman—:\n*O Lord, do not forgive Athmah her sin ... and if Al-Ajir does not punish her, then [You] punish.*\n*I did not see her except leading her camel ... She said: Give me rest [tell me], which rider-group shall I accompany?*\n*I said to her: Youths have gone before you ... on Qatari camels, light of bags.*\n*I fear for you that Allah will place piety ... other than you, and you will meet some of those Slavs.*\n*I fear when ropes heave and change ... and the trotting of noble camels hides the people from you.*\n*And a madman tucks up [his clothes] on a mischievous she-camel ... seeing the wife of the Sheikh while the Sheikh is absent.*\n*When his hand reached for the young camel so you could ride ... his hand fell to commit one of the wonders [adultery].*\n*So she inclined a turn, not fleeing, and I wish ... I could see you, and for the decreed matter there are bringers.*\n*While a tangled-fang [stallion], his danger has risen ... guards the isolated ones, angry among the plundered ones.*\n*Faster than me in jealousy, so beware of me ... on the head, or a blow behind the knuckles.*\n*And the falcon of Al-Hajjaj ibn Yusuf, gripping ... is not faster than me in the glance of an eye with an eyebrow.*\n*Forbidden upon you is the Hajj, do not approach it ... when the time of Hajj for repenting Muslim women comes.*\n*And do not make my guest a guest brought near ... and another isolated from the house, put aside.*\n*And do not assign me a servant I do not love ... lest a fever and headache seize me from that.*\n*And gather the saddles of the people or expose them ... and do not do what the likes of me do not approach.*\n*Her eye gazed, while the white camels blew into the nose-rings ... towards a rider, excluding whom are a thousand riders.*\n\nIbn al-Sirafi said: Al-Khansa said:\n*And a girl from the daughters of the kings ... rattled her anklets against the horses.*\n*Like the *Kirfi'ah* (cloud) of rain possessing the *Sabir* (cloud formation) ... she comes to the clouds and *ta'taluha*.*\n*So no rain cloud poured its rain ... nor did a land grow its vegetation.*\n\nHe said: *Ta'ti al-sahab*: She intends towards the main body of the clouds, moving towards the clouds with gentleness and slowness. *Ta'talu*: She repairs the clouds by joining them. *Ta'talu* is the *tafta'ilu* form from: *Ala al-shay' ya'uluhu* if he repaired it.\n\nS said: This is the place of the proverb:\n*For the night of a maiden between her combers ... and midwives and her mothers.*\n*Is easier than the night of her suffering.*\nIf Ibn al-Sirafi had left alone such poetry, which he did not know, nor its author, and brought it separated not consecutive, and did not explain his saying *ta'taluha* as repairing the clouds, and busied himself with syntax and a bit of [grammar]—he would have been more guided. These verses are not by Al-Khansa. Also, a verse has fallen from them which is the best of them. His saying: *Ta'taluha* means repairing the clouds is a scandal, because if it were so, it would necessitate raising the Lam (nominative), because there is no accusative particle here for the verb. The verses are by Amir ibn Juwayn al-Ta'i, and their order is:\n*And a girl from the daughters of the kings ... rattled her anklets against the spear.*\n*Like the *Kirfi'ah* of rain possessing the *Sabir* ... she throws the clouds and it is thrown for her.*\n*The speckle-faced [cloud] promised her after the passing of the stars ... increasing its pouring.*\n*So no rain cloud poured its rain ... nor did a land grow its vegetation.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 24
  },
  {
    "serial_number": "6834872",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "Ibn al-Sirafi attributed this poetry to Al-Khansa only because he was deceived by her poem which begins: *Ala ma li-'aynika am ma laha* (What is wrong with your eye or what is wrong with it?). \"And not every black thing is a date.\" Two verses from these verses, namely \"Wa jariyah\" and \"Ka-kirfi'ah,\" were inserted into this poem of Al-Khansa, and the address in them was made to Sakhr. This is not hidden from the insightful critic. His saying: \"Tarmi al-sahab wa yurma laha\" (She throws the clouds and it is thrown for her): The Arabs say: A cloud originated, so the clouds began to be thrown to it (*yurma laha*), meaning joined to it. Jami' ibn Amr ibn Markhiyah al-Kilabi said:\n*A green night-cloud covering them watered ... dwellings of Dahma' that had been effaced by the sand.*\n*Green, reviving the decayed earth that had worn out ... its night-traveler follows the morning cloud with darkness.*\n*From the sea, it originated, the clouds being thrown to it ... until its Najdi and Tihami parts poured rain.*\n\nIbn al-Sirafi said: Hassan ibn Thabit said:\n*The children of Jafnah around the grave of their father ... the grave of Ibn Mariyah, the generous, the preferred.*\n*They are visited until their dogs do not growl ... they do not ask about the approaching person [blackness].*\n\nHe said: He praises thereby the family of Jafnah the Ghassanid, and their land is in Syria. Mariyah of the Two Earrings is the mother of Jafnah ibn Amr Muzayqiya. *Yughshawn*: Seekers and beggars visit them and multiply at their place. In speech resembling this.\n\nS said: This is the place of the proverb:\n*Ma'add took away the height, and Nahshal ... from between a reciter of his poetry and a rogue.*\nThe scholars took away the knowledge of the pleasing meaning in this verse, a meaning from which Ibn al-Sirafi is isolated, as well as the genealogy in it. As for Mariyah, she is the daughter of Al-Arqam ibn Tha'labah ibn Amr ibn Jafnah. She is the one of the Two Earrings, the two pearls like ostrich or pigeon eggs that she had. She is the mother of Al-Harith ibn Tha'labah ibn Jafnah ibn Amr Muzayqiya ibn Amir Ma' al-Sama'. His saying: \"Around the grave of their father\"—which is the meaning Ibn al-Sirafi did not know—means that they are kings who do not leave their country and where their father's grave is; they are not nomadic Bedouins moving from land to land. As Imru' al-Qays said mentioning a Bedouin woman moving from water to water:\n*Is it because of a Bedouin woman whose family settled ... south of Al-Mala that your eyes are rushing [with tears]?*\n*So their tears are pouring, spilling, continuous rain ... sprinkling, dripping, and streaming.*\n\nIbn al-Sirafi said: Zayd al-Khayl said:\n*Mazyad wished for Zayd, so he met ... a brother of trust when the spearheads clashed.*\n*Like the wish of Jabir when he said: Would that I ... encounter him and lose some of my wealth.*\n\nHe said: Mazyad is a man from Banu Asad. He used to wish to meet Zayd al-Khayl. Zayd al-Khayl met him and stabbed him, so he fled from him. Zayd said regarding that poetry, the beginning of which is what I recited.\n\nS said: This is the place of the proverb:\n*If the neighbor of the house is between Muharib ... and Abs, then do not give him glad tidings of honor or victory.*\n*Their defense of him when they gather ... they found [like] the defense of the two labia of the clitoris.*\nThis amount mentioned by Ibn al-Sirafi regarding the story of this verse does not avail the beneficiary anything. He also did not mention Jabir, who he was among people. He is a man from Ghatafan. He wished for Zayd, who is from Bahila [correction: Zayd is Tayyi, context implies a mistake or specific alliance context here? Zayd al-Khayl is well known as Tayyi. Perhaps the text implies Jabir wished for Zayd?]. Zayd came upon him in the morning. His wife said to him: \"You used to wish for Zayd, so here he is with you.\" They met and exchanged two stabs while both were armored. Jabir's spear broke and availed nothing. Zayd stabbed him with a spear of his called 'Ilaj—and on every joint was a band of iron—and knocked him out so he flipped over, back to belly, and his back was broken but he did not kill him. His wife said when she came to him—lifting him with a broken back—: \"You wished for Zayd so you met a brother of trust.\"\n\nIbn al-Sirafi said: Abu al-Khatharim al-Bajali said—in the boasting contest (*munafarah*) of Bajila and Kalb, when they sought judgment from Al-Aqra' ibn Habis, and Bajila said 'We are brothers of Nizar' and they have stories—so Abu al-Khatharim said regarding that:\n*O Aqra' ibn Habis, O Aqra' ... Indeed I am your brother so look at what you do.*\n*Indeed, if you throw down your brother, you will be thrown down ... Indeed I am the caller of Nizar, so listen.*\nHe said: He made *tusra'u* (you [pl.] will be thrown down) for the plural, meaning Al-Aqra' and his people, and there is no witness in it for this aspect. This Rajaz is narrated with genitive rhyme (majrur), and he recited:\n*O Aqra' ibn Habis, O Aqra' ... Indeed I am the caller of Nizar, so listen.*\n*In a lofty [place] of honor and a refuge.*\n*And standing, then say in the assembly ... to the man Arta'ah: I am the son of Al-Aqra'.*\n*Behold, this is a day of height and gathering ... and a sight for him who saw and a place of hearing.*\n\nS said: This is the place of the proverb:\n*My two friends, does the appearance of the peaks of the mountains ... heal the hearts of passion? No, rather it increases it.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 25
  },
  {
    "serial_number": "6834873",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "The amount that Ibn al-Sirafi knew about this Rajaz and mentioned yields no benefit to the beneficiary; rather, it increases his ignorance and blindness. Furthermore, he erred in the amount he mentioned from several aspects. Among them is that he attributed this Rajaz to Abu al-Khatharim al-Bajali, but he is Ibn al-Khatharim, who is Amr ibn al-Khatharim al-Bajali. Among them is that he mentioned the boasting contest was between Bajila and Kalb, whereas it was between two men, not two tribes: Jarir ibn Abdullah al-Bajali and Khalid ibn Arta'ah ibn Khushayn ibn Shabath al-Kalbi. Among them is his saying: Bajila said we are brothers of Nizar, and he did not clarify the brotherhood from which side it is. Among them is his saying: This Rajaz is narrated with genitive rhyme, whereas they are two separate Rajaz poems, so he mixed the pasture with the neglected camels; one of the Rajaz poems is nominative (marfu'), and the other is genitive (majrur). The explanation of that will come to you, Allah willing.\n\nAbu al-Nada dictated to us saying: The cause of the boasting contest between Jarir ibn Abdullah al-Bajali and Khalid ibn Arta'ah ibn Khushayn ibn Shabath al-Kalbi was that Kalb had captured a man from Bajila in the Jahiliyyah called Malik ibn Utbah from Banu Adiyah ibn Amir ibn Qadad. They brought him to Ukaz. The Adi man passed by a cousin of his called Al-Qasim ibn Aqil ibn Abi Amr ibn Ka'b ibn Arij ibn al-Huwayrith ibn Abdullah ibn Malik ibn Hilal ibn Adiyah ibn Amir ibn Qadad, who was eating dates. He took some of those dates to seek protection/hospitality thereby. The Kalbi pulled him away. Al-Qasim said to him: \"He is a man of my clan.\" He said to him: \"If he had a clan, they would have defended him.\"\nSo Al-Qasim went to his cousins, Banu Zayd ibn al-Ghawth, and asked them to follow him. They said: \"We are cut off among the Arabs, and we have no group to be strong with.\" So he went to Ahmas and asked them to follow him. They said: \"Whenever a hair from Banu Zayd flies into the hands of the Arabs, do we want to follow it?\" So he went then to Jarir ibn Abdullah and spoke to him. Al-Qasim used to say: \"The first day I was shown dyed clothes and red domes was the day I came to Jarir in Qasr.\" He [Jarir] was the master of Banu Malik ibn Sa'd ibn Zayd ibn Qasr, and they were his father's sons. He called them to reclaim the Adi man from Kalb, and they followed him. He went out walking with them until he attacked the dwellings of Kalb at Ukaz, and snatched Malik ibn Utbah al-Adi from them. Kalb stood against him. Jarir said: \"You claimed that his people would not defend him?\" Kalb said: \"Our group is absent.\" Jarir said: \"Even if they were here, they would not have defended anything from you.\" They said: \"It is as if you are arrogant over Quda'ah... If you wish, we will compare glory with you.\" The leader of Quda'ah that day was Khalid ibn Arta'ah ibn Khushayn ibn Shabath. He said: \"Our appointment is next year at the market of Ukaz.\"\nSo Kalb gathered and Qasr gathered, and they came to Ukaz the next year. The one in charge of Kalb's affair who brought them the next year was Khalid ibn Arta'ah. They made Al-Aqra' ibn Habis ibn Iqal ibn Muhammad ibn Sufyan ibn Mujashi' the judge; both tribes accepted his judgment. They placed the bets in the hands of Utbah ibn Rabi'ah ibn Abd Shams among nobles of Quraysh. Among the stakes from Qasr was Al-Asram ibn Awf ibn Uwayf ibn Malik ibn Dhubyan ibn Tha'labah ibn Amr ibn Yashkur ibn Ali ibn Malik ibn Sa'd ibn Nadhir ibn Qasr. From Ahmas, Hazim ibn Abi Hazim and Sakhr ibn al-Ulbah. From Banu Zayd ibn al-Ghawth ibn Anmar, a man.\nThen Khalid ibn Arta'ah stood and said to Jarir: \"What shall we wager?\" He said: \"The risk is in your hand.\" He said: \"A thousand red she-camels for a thousand red she-camels.\" Jarir said: \"A thousand virgin slave-girls for a thousand virgin slave-girls. Or if you wish, a thousand yellow ounces [gold] for a thousand yellow ounces.\" He said: \"Who guarantees fulfillment for me?\" He said: \"Your guarantor is Al-Lat, Al-Uzza, Isaf, Na'ilah, Shams, Ya'uq, Dhu al-Khalasa, and Nasr. So who guarantees fulfillment for you?\" He said: \"Wadd, Manat, Fals, and Rida.\" Jarir said: \"You have for fulfillment seventy boys, having uncles on father's and mother's side, placed in the hands of competent men from the people of Allah [Quraysh].\" So they placed the pledge from Bajila and Kalb in the hands of those we named from Quraysh, and appointed Al-Aqra' ibn Habis judge, who was the scholar of the Arabs in his time.\nAl-Aqra' said: \"What do you have, O Khalid?\" He said: \"We descend the open land, and we stab with spears, and we are the youths of the morning.\" Al-Aqra' said: \"What do you have, O Jarir?\" He said: \"We are the people of yellow gold, and the red dyed [clothes], we frighten and are not frightened, we feed and do not ask for food, and we are a tribe unpolluted/free, we feed as long as the winds blow, we feed the month and guarantee the era, and we are the kings of Qasr.\"\nAl-Aqra' said: \"By Al-Lat and Al-Uzza, if you competed with Caesar king of the Romans, and Chosroes the great of Persians, and Al-Nu'man king of the Arabs, I would have judged you superior to them.\"\nNu'aym ibn Hajbah al-Namari approached—and Qasr had gifted a horse to Jarir, so he rode it from its off-side (wahshi). It was said: \"He does not know how to ride a horse.\" Jarir said: \"Horses are auspicious (mayamin), and we only ride them from their right sides (wujuh/right).\"\nAmr ibn al-Khatharim, one of Banu Jusham ibn Amir ibn Qadad, had called out saying:\n*Let no youth overcome today your two clients*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 26
  },
  {
    "serial_number": "6834874",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "*O sons of Nizar, help your brother ... I found my father to be your father.*\n*And I found no lineage for me other than you ... Abundant rain, extending is your dew.*\n*Until the people settle in your pasture ... You are the joy of the eye of him who sees you.*\n*It was filled so it sees none but you ... He has won, the day of boasting, who called you.*\n*And no one counts your pebbles [numbers] ... And if they built, they did not reach your building.*\n*A glory your father built for you two ... That, and he who helps the likes of you.*\n*A day when your fire is kindled.*\n\nAnd he also said:\n*O family of Nizar, he has risen in the rugged mountain ... The call of a caller, the call of the seeker of help.*\n*O family of Nizar, then strive and ride ... O family of Nizar, there is no way away from you.*\n*Indeed your father is my grandfather and my father ... The client is not helped if you do not get angry.*\n*O family of Nizar, I did not lie ... I encompassed your lineages and my lineage.*\n*And whoever you are his glory is not overcome ... He rises to a pure, noble glory.*\n*As if he is in the tower at the star.*\n\nAnd he also said:\n*O family of Nizar, a call of the morning ... The matter has exposed us, a disgrace.*\n\nAnd he also said:\n*O Aqra' ibn Habis, O Aqra' ... Indeed I am your brother so look at what you do.*\n*Indeed, if your brother is thrown down, you are thrown down ... Indeed I am the caller of Nizar, so listen.*\n*I have a lofty [place] of his glory and a refuge ... by it the capable harms and benefits.*\n*And I repel injustice tomorrow and benefit ... A glory, fierce, high, not suppressed.*\n*People follow it and it does not seek followers ... Is he anything but a tail and shins?*\n*And lower legs, mixed, gathered ... And a lineage and shackles and a cut nose?*\n\nAnd he also said:\n*O Aqra' ibn Habis, O Aqra' ... Indeed if you throw down your brother you are thrown down.*\n*Indeed I am the caller of Nizar so listen ... In a lofty [place] of his glory and a refuge.*\n*Stand standing then say in the assembly ... to the man Arta'ah: O son of the club-footed.*\n*Behold, this is a day of height and gathering ... and a sight for him who saw and a place of hearing.*\nSo Al-Aqra' judged him superior by virtue of Mudar and Rabi'ah, and were it not for them, the Kalbi would have won.\n\nS said: The kinship between Bajila and the children of Nizar was that Irash ibn Amr ibn al-Ghawth ibn Nabt ibn Malik ibn Zayd ibn Kahlan ibn Saba' ibn Yashjub ibn Ya'rub ibn Qahtan went out for Hajj. He married Salamah bint Anmar ibn Nizar, and they resided together in the abode in the lowland of Tihama. She bore him Anmar ibn Irash and men. When Irash died, a dispute occurred between Anmar ibn Irash and his brothers regarding the division. So he withdrew from his brothers, and his brothers stayed in the abode with their maternal uncles. Anmar ibn Irash married Hind bint Malik ibn Ghafiq ibn al-Shahid, and she bore Aqil, who is Khath'am, then she died. Then he married Bajila bint Sa'b ibn Sa'd al-Ashirah, and she bore him Abqar—she named him after her grandfather Sa'd, and he was nicknamed Abqar because he was born on a mountain called Abqar—and she also bore Al-Ghawth, Wadi'ah, Suhaybah, Khuzaimah, Ashhal, Shahla', Saniyah, Tarif, Fahm, Jad'ah, and Al-Harith.\n\nIbn al-Sirafi said: Dirar ibn al-Azwar said:\n*And if you asked Janub about us, she would inform ... an evening Aqraba flowed with blood.*\n*An evening when spears did not avail their place ... nor arrows, except the determined Mashrafi [sword].*\n\nHe said: Aqraba is a specific place, and Janub is a woman. He meant that they fought a fierce battle at Aqraba until blood flowed in it.\n\nS said: This is the place of the proverb:\n*Indeed its two sides, if they separate ... crush the clumsy villager.*\nIbn al-Sirafi was not of the men of this poetry, by making the first verse have *iqwa* (rhyme defect), whereas it has no *iqwa* according to those who know it. He stated that Aqraba is a specific place. What benefit is under this speech if Aqraba is not known in which land it is, and what the reason for Dirar mentioning it was? If you understood the story of this poetry, you would know that Ibn al-Sirafi fell short of knowing it.\nAbu al-Nada dictated to us saying: Dirar ibn al-Azwar is the Knight of Al-Muhabbar in the Ridda (Apostasy) wars for Banu Asad ibn Khuzaimah. Khalid ibn al-Walid had sent him with cavalry to Al-Ba'udah—a land of Banu Tamim—so he killed Malik ibn Nuwayrah, the knight of Banu Yarbu', there (and Banu Tamim claims he granted him safety). Dirar ibn al-Azwar fought fiercely that day. He said regarding that—and news of his people Banu Asad's apostasy had reached him:\n*O Banu Asad, what you have done has grieved me ... And there is no sanctuary for a people who fought Allah.*\n*And I know truly that you have erred ... Banu Asad, so retreat or advance.*\n*I forbade you from plundering your alms [Zakat] ... and I said to you: O family of Tha'labah, know.*\n*You disobeyed the possessors of wisdom among you and obeyed ... Dajim, and the command of the son of the foundling woman is more ill-omened.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 27
  },
  {
    "serial_number": "6834875",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "*And they have sent a delegation to the people of Dumah ... So ugly is the delegation and he who intends [it].*\n*And if you asked Janub about us, she would inform ... an evening Aqraba flowed with blood.*\n*An evening when spears did not avail their place ... nor arrows, except the determined Mashrafi [sword].*\n*If the disbelievers seek Janub ... unrepentant, then I am a follower of the religion, so know.*\n*I fight since fighting is booty ... and Allah knows best the striving servant.*\nDajim is Talhah ibn Khuwaylid [the false prophet], and his mother was a Himyari captive. The son of the foundling woman is Uyaynah ibn Hisn. His saying: \"O family of Tha'labah\": he meant Tha'labah al-Hillaf ibn Dudan ibn Asad. Abu al-Nada said to us: Aqraba with a Ba is a land in Yamama. He said: And Aqrama with a Mim is in Yemen. He recited for a man from Ju'fi regarding the killing of Malik ibn Mazin, one of Banu Rabi'ah ibn al-Harith:\n*You mutilated our noses with a viper at al-Dhahab ... so we turned on your noses, so they became cut off.*\n*So whoever is grieved by the killing of Malik ... indeed we left him thrown down at Aqrama.*\n\nIbn al-Sirafi said: Qays ibn al-Khatim said:\n*If our swords fell short, their reach was ... our steps towards our enemies, so we strike.*\n*And I strike them on the day of the garden, bare-headed ... as if my hand with the sword is the kerchief of a player.*\n\nS said: This is the place of the proverb:\n*And I am the most wretched of people if I were indebted ... my camels wandering between al-Liwa and Aban.*\nI do not cease from fatigue in returning what Ibn al-Sirafi errs in to the state of correctness; it is as if I am the mother of a camel [caring for it]. That is because he attributed a verse by Ruqaym al-Muharibi to Qays ibn al-Khatim, and corrupted the verse to make it a witness in grammar. The verses belong to Ruqaym al-Muharibi, and they have nominative rhymes, not genitive.\n*And we are the children of the fierce war, we kindle it ... and by war we were named, so we are Muharib (Warrior).*\n*If our swords fell short, their reach was ... our steps towards our enemies, so we strike.*\n*So that annihilated us and left tribes ... who protected themselves by us when the battalions struck us.*\n\nIbn al-Sirafi said: Hassan said:\n*Perhaps forbearance wasted by lack of wealth ... and ignorance covered over by bliss.*\n*I do not care if a goat bleats at al-Hazn ... or a mean person blames me in absence.*\n\nS said: This is the place of the proverb:\n*Where are you today, and where is a rider from you ... who dismounted at midnight at al-Nabk.*\nMeaning how can he reach you and approach you. How can this second verse be following the first, when the first is by Hassan, and the second is by Abd al-Rahman his son, in verses with which he satirized Miskin ibn Amir al-Darimi? They are three verses, which I present:\n*O reviler of me for the lineage of my like ... You are only wandering in error.*\n*Do not insult me, for I am not a captive ... Indeed the captive among men is the generous one.*\n*I do not care if a goat bleats at al-Hazn ... or a mean person blames me in absence.*\n\nIbn al-Sirafi said: Al-Ajir al-Saluli said:\n*And a 'Mustalham' (one sought in war/overwhelmed) whom the adversary struck a blow ... of few clients, obtained what was defended.*\n*I returned to him what he exceeded in speech in the forenoon ... and yesterday, until I tracked him while he was humble.*\n*And that was not because he was my cousin or my brother ... but whenever I own the harm, I benefit.*\nHe said: Perhaps a *mustalham* whom his adversary struck with an argument.\n\nS said: This is the place of the proverb:\n*You have begun to rise in your error, bewildered ... Indeed error is the son of Al-Alal, so desist.*\nIbn al-Sirafi went astray here because he did not know the verse preceding this verse, and that it is conjoined to it. The verse before it is:\n*Nay, adversaries will weep for me, and an assembly ... and disheveled ones who were insulted in the presence of the house, hungry.*\nThe beginning of the verses is:\n*If I die, the people will be halves: a gloater ... and another praising what I used to do.*\n*Nay, adversaries will weep for me, and an assembly ... and disheveled ones who were insulted in the presence of the house, hungry.*\n*And an oppressed one (*Mudtahad*) whom the adversary struck a blow ... of lowly clients, obtained what was defended.*\nSo the wording of the verse is *Mudtahad* not *Mustalham* as Ibn al-Sirafi claimed.\n*I returned to him what the people advanced in the forenoon ... and yesterday, until he attained it while he was strong.*\n*And I am not his client nor his cousin ... but whenever I own the harm, I benefit.*\n\nIbn al-Sirafi said: Al-Kulhabah—and his name is Hubayrah ibn Abdullah from Banu Urayn ibn Tha'labah ibn Yarbu'—said:\n*I commanded them my command at the bend of al-Liwa ... and there is no command for the disobeyed except wasted.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 28
  },
  {
    "serial_number": "6834876",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "S said: This is the place of the proverb:\n*And every love except for Su'da is pure ... [departing] to its people from us with peace.*\nThis wisdom should be returned to Ibn al-Sirafi with blame, for the man is *Ibn* al-Kulhabah, not Al-Kulhabah as he mentioned. Al-Kulhabah is his mother, a woman from Jurm ibn Rabban. His name is Hubayrah ibn Abd Manaf ibn Urayn ibn Tha'labah ibn Yarbu', and he is the uncle of Waqid ibn Abdullah ibn Abd Manaf.\n\nIbn al-Sirafi said: Ru'ba said:\n*My daughter says: It has neared, your time.*\n*So seek determination from Allah and leave your 'perhaps' [hope].*\n*O my father, perhaps or maybe.*\n\nS said: This is the place of the proverb:\n*Hub hub (call to camels), it is a day of trampling and mixing.*\nIbn al-Sirafi confused here because the date stones are similar [things look alike], and he misread a word in the verse also, which is his saying: \"Ya Abata\" (O my father), whereas it is \"Ta'anniyan\" (Acting slowly/deliberately). The explanation will come to you in its place, Allah willing. That is because his saying: \"So seek determination from Allah and leave your 'perhaps'\" is from one Urjuzah (poem), and his saying: \"Slowly, perhaps or maybe\" is from another Urjuzah. The one containing \"So seek determination from Allah\" is his saying praising Al-Harith ibn Sulaym al-Hujaymi:\n*My daughter says: It has neared, your time.*\n*So seek determination from Allah and leave your 'perhaps'.*\n*And he attains the need, your planner.*\n*He had been folding the earth, your ascender.*\n*You are feared and hoped for, and your brilliance is seen.*\n*So I said: I am seeking your aid, with you.*\n*Rain, and I do not seek the Arak tree.*\n*So convey to Banu Umayyah the kings.*\n*In Syria, and the Caliph the owner.*\n*And in Khurasan, so where is that.*\n*From me, and I have no power for that.*\n*Or travel to Kerman, you will find your brother.*\n*Indeed in it is Al-Harith, if he meets you.*\n*He gave a gift that was not weak.*\nThese are verses from which I mentioned the amount needed here.\nThe other Urjuzah he praised Ibrahim ibn Arabi with, which is:\n*When you put down the saddle and the rear pad.*\n*From the loin of a traveler that emaciated you.*\n*More captive than her evening, your strap.*\n*Yellow from the attack of the midday heat, sticking.*\n*The yellowing of the hands of the bride, the aromatics.*\n*Slowly! Perhaps or maybe.*\n*Ibrahim asks: What distracted you.*\n*From two years that came successively.*\n*Stripping the Talh tree and the Arak.*\n*They did not leave a sandal nor a strap.*\n\nIbn al-Sirafi said: 'Itr ibn Dajajah said, and perhaps it appeared in copies as Anz ibn Dajajah ibn al-'Itr, and the first narration is more famous, and he attributed him in his poetry as Dajajah ibn al-'Itr. And it is narrated for Mu'awiyah ibn Kasir al-Mazini:\n*O my night, what is my night at al-Baldah ... it became confused over its stars so it returned.*\nIt consists of verses.\n\nS said: This is the place of the proverb:\n*Indeed the Tufawi, the brother of the Ya'sub (male bee/leader) ... in every tribe there is a share for them.*\nIbn al-Sirafi left no name without assigning a share to it, due to his ignorance of names and genealogies. The correct view is what Abu al-Nada informed us, that he is Dajajah ibn 'Itr, with Kasra on the Dal in Dajajah, and the 'Ayn of 'Itr, and the Ta dotted with two dots from above, and the Ra undotted. He said: The man's name is Dajajah with Kasra, and the bird is Dajajah with Fatha on the Dal. The second short piece belongs to this Dajajah, not to Mu'awiyah ibn Kasir.\n\nIbn al-Sirafi said: Sa'd ibn al-Mutanahhir, who is Jahili (Pre-Islamic), said:\n*O Bajji, O Bajji, perform my brother.*\n*Indeed my brother is among you, not an adopted one.*\n*And a free woman bore him, not a fornicator.*\n*From the children of Imran ibn Amr ibn Adi.*\nIbn al-Sirafi said: He meant O Bajilah, so he truncated (tarkhim) after truncation. This poetry clarifies what Sibawayh went for.\n\nS said: This is the place of the proverb:\n*There is no water in the reservoir if you do not rise ... attacking with the head of the camel turned sideways.*\nI had mentioned to you in more than one place in this book that whoever embarks on explaining such poetry, regarding genealogy or story, without having mastered these two sciences—is exposed to disgrace. Even if Sibawayh's Book and Al-Farra's Definitions were coupled with this poetry, its meaning would not be known except by knowing its story. The last verse also has a defect, and its correction is: *From the children of Amr ibn Imran ibn Adi*.\nThe story of this poetry is that the mother of Walan ibn Amr ibn Imran ibn Adi ibn Harithah ibn Amr ibn Muzayqiya ibn Amir ibn Ma' al-Sama' ibn Harithah ibn Imru' al-Qays ibn Tha'labah ibn Mazin ibn al-Azd—she was Azzah bint Malik from Bajila. Walan is Shukr, and it is Shukr Qarni, a nickname. She took him to Bajila, so Bajila used to say: He is one of us. So Sa'd ibn al-Mutanahhir al-Bariqi, a Jahili poet, said:\n*O Bajji, O Bajji, perform my brother.*\n*Indeed my brother is among you, not an adopted one.*\n*And a free woman bore him, not a fornicator.*\n*And indeed, the wife of my father was from the children of Amr ibn Imran ibn Adi.*\n\nChapter of Inna",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 29
  },
  {
    "serial_number": "6834877",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "Ibn al-Sirafi said: Dajajah ibn Abd al-Qays said in the Chapter of Inna:\n*An oath came to me from people: We will surely ride ... against me, while before me are the hills of Ghul, advancing (Muqadim).*\n*Absolve yourself and treat your own soul and look ... O Abu Ja'l, perhaps you are dreaming.*\nHe said: Al-Hadb: Plural of Hadbah, which is the mountain. Muqadim: Advancing (feminine plural), and the singular of Muqadim is Muqadimah. Ghul: A specific place. And Hadb is nominative by inchoative (Mubtada'). It is permitted to narrate *layarkabunna* (they will surely ride) in the passive voice, so *al-Muqadim* would be its subject, and it would be the plural of Miqdam, and *duni* (before me) would be the predicate of Hadb.\n\nS said: This is the place of the proverb:\n*What a twisting Mayyah twists ... while she has no large apron.*\nIbn al-Sirafi strove and raved in this poetry after misspelling it, but he did not succeed. This is among the most disgraceful things he came up with, which is his saying \"Hadb Ghul Muqadim,\" due to his ignorance of the stopping places. The correct reading is: *Hadb Ghul fa-Qadim* (The hills of Ghul then Qadim). They are two valleys belonging to Al-Dabab, and rarely does Ghul appear in poetry separate from Qadim. Al-Harith ibn Amr ibn Kharjah al-Fazari recited to us:\n*You remembered the daughter of Al-Sa'di a remembrance, while before her ... was the mill of Jabir, and my family occupied Al-Adahim.*\n*Then the rugged ground of Qutayyat when the mind was good ... then Kabshat Ma'ruf, then Ghul, then Qadim.*\nThe verse in the Book belongs to Dajajah ibn Abd al-Qays, not Dujanah ibn Abd al-Qays as Ibn al-Sirafi mentioned.\n\nIbn al-Sirafi said: Hatim ibn Abdullah al-Ta'i said:\n*Their slaughterer brought a lean, dry she-camel ... in the head of it and in the loins there is salting (fat/goodness).*\n*When the milch-camels went early to pasture, I bound them ... and no noble of the children is given the morning drink.*\n\nS said: This is the place of the proverb:\n*As for the camel, it is a thing I will not give ... and your love of the sheep is the love of the parent for the child.*\nNeither in poetry does Ibn al-Sirafi succeed, nor in genealogy, nor in the names of stopping places and water sources, as was said:\n*You exhausted me at the end of the sky, and the end of building, and the end of sleep, and the end of drowsiness.*\nThis verse belongs to a man from the Ansar from al-Nabit. He has a long known story with Hatim and Mawiyah bint 'Afzar, and for that reason, I omitted mentioning it. The verses are:\n*Why did you not ask the Nabitis what is my reckoning ... in the winter when the wind blows?*\n*Their slaughterer brought a lean, dry she-camel ... in the head of it and in the loins there is salting.*\n*And their scout said: Their wealth is equal ... two likes: A like for one who grazes and pasturing.*\n*When the milch-camels went early to pasture, I bound them ... and no noble of the children is given the morning drink.*\nSo look how much confusion occurred in what Ibn al-Sirafi presented of this poetry.\n\nIbn al-Sirafi said: A man from Banu Sulaym, who is Anas ibn al-Abbas, said:\n*No lineage today and no friendship ... the hole has widened on the patcher.*\nAnd in some copies: *The tear has widened on the stitcher.*\nHe said: Some narrators claimed that Al-Nu'man ibn al-Mundhir sent an army to Banu Sulaym for something he held against them. Over the army was a man known as Kafir ibn Fartana or Amr ibn Fartana. He passed with the army by Ghatafan, so they sought their help against Banu Sulaym. Banu Sulaym defeated the army, and Amr ibn Fartana was stabbed and captured. Ghatafan pleaded to Sulaym by the kinship between them. So Abu Amir, the grandfather of Al-Abbas ibn Mirdas, recited a poem in which [he said]: What was between us and Ghatafan has been cut off by what they did. Its beginning is:\n*Indeed Baghid is a rebellious lineage ... neither trusted nor trusting.*\n*No lineage today and no friendship ... the hole has widened on the stitcher.*\n*No peace between me, know it, nor ... between you, as long as my shoulder bears.*\n*My sword; and we were not in Najd when ... the pigeon of the valley cooed at the peak.*\nHe said: His saying \"pigeon of the valley\": he means the pigeons whose nests are in the trees of the valley, flying onto the mountains and cooing.\n\nS said: This is the place of the proverb:\n*They came to the lizard-hunting of the Dabab as if ... they came to the fat she-camels of Amarah ibn Ziyad.*\nIbn al-Sirafi prolonged the speech in explaining this poetry and broadened it, then followed this arrogance with what yields no benefit. That is because he brought a story that falls under the ruling of night-tales, which is his saying: \"Al-Nu'man sent an army...\" to the end of the story. In the verses he cited, there is disturbance and deficiency, and he did not know the meaning of the last verse, which is the intended one. The story of this poetry—as I read it to Abu al-Nada in the Book of Banu Sulaym—he said: Abu Amir ibn Harithah al-Sulami neighbored his maternal uncles Banu Murrah. They drove away his camels. So he went out, along with Murrah ibn Jariyah, Sunnah ibn Jariyah, and Sinan ibn Jariyah, until they attacked Banu Murrah between Abanayn, killing people from them and driving away great camels of theirs. Murrah ibn Jariyah returned reciting Rajaz:",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 30
  },
  {
    "serial_number": "6834878",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "*O Murr, indeed I am your pure friend ... and you are my uncle and I am the namesake.*\n*And the distant lineage might be humiliated.*\nAnd Abu Amir recited Rajaz and said regarding that:\n*The people ask me: Where is my wealth? ... Do not ask me, but ask my maternal uncles.*\n*O Lord of water belonging to you at Al-Ajdal ... at Ghaybagh, drawn with the rope.*\n*Into which falls the fruit of the palm/mistletoe.*\nAbu Amir said regarding that:\n*I know my maternal uncles and call them ... as if my mother there was from Bariq.*\n*No lineage today and no friendship ... the hole has widened on the stitcher.*\n*Indeed Baghid is a canceled lineage ... neither trusted nor trusting.*\n*Our swords take the first of them ... the snatching of the stick of the gathering water-provider.*\n*No peace between me, know it, nor ... between you, as long as my shoulder bears.*\n*My sword; and we were not in Najd when ... the pigeon of the valley cooed at the peak.*\nThe meaning of his saying: \"And the pigeon of the valley cooed at the peak\" means that a torrent comes which the meadows cannot accommodate, so it resorts to the trees and peaks. Then the pasture and fertility abound, and war is stirred up between them.\n\nIbn al-Sirafi said: Ibn al-Ruqayyat said:\n*May Allah not bless the beautiful women; do ... they arise except having a demand?*\nHe said: The witness in it is that he moved the Ya of *Al-Ghawani* with Kasra for necessity.\n\nS said: This is the place of the proverb:\n*Hunger drives her to the bitter tree.*\nThe verse is only evidence in case of necessity if there isn't another narration in the place of the witness that is better than the first, and it is not possible to narrate it in another way. As for this verse which he cited, another version has been narrated by Al-Asma'i, which is:\n*May Allah not bless the beautiful women; and do ... they arise except having a demand?*\nThe reliance of the arguer on this verse indicates that he was not abundant in narrating poetry. If he had argued with the saying of the sayer:\n*The clients have almost taken away the world and its pleasure ... like the rams of the 'Aws (sheep), fat.*\n*There is not one among them but at his waist ... for his door, from the craft of the smith, is a key.*\nIt would have been stronger and more upright for the argument.\n\nIbn al-Sirafi said: Al-Akhdar ibn Hubayrah al-Dabbi said:\n*I am not, on the day of the two Raqams, recoiling ... nor is the sword, if I drew it, blunt.*\n*And I was not a Dhaffat (one rushing to food), but a seeker ... who stayed a little upon the back of a path.*\n\nHe said: Al-Akhdar ibn Hubayrah al-Dabbi said this poetry regarding a son of his whom Tuhayyah killed in a war between them.\n\nS said: This is the place of the proverb:\n*A day on Dhat al-Shuquq, sunny ... followed by a drought in the bellies of al-Rah.*\nSuch poetry exhausts its interpreter—if he is not deeply versed in knowing the Days (battles), and not abundant in narrating poetry. Ibn al-Sirafi erred here from [several] perspectives: One is that he attributed this poetry to Al-Akhdar ibn Hubayrah, and it is not his. Then he brought two verses distorted from the path of correctness. And such poetry—if its story is not fully known—its meaning is not known at all.\nThe story is that Al-Harith ibn Hatib al-Jumahi was over the charities of Amr ibn Hanzalah, and Marwan ibn al-Hakam had appointed him. Banu Tuhayyah made food for him, and Awf ibn al-Qa'qa' made food for him. The food of Banu Tuhayyah was ready before the food of Awf, so Al-Harith ate their food. Zuhayr ibn Shaddad al-Mithawi gifted a bowl of Hays to Awf ibn al-Qa'qa'. He rejected it and said: \"He thinks we eat Hays in which the testicles of Zuhayr spent the night dripping.\" Evil occurred between them, and they threw stones at each other. A man from them threw Qays ibn Awf ibn al-Qa'qa' with a stone on the center of his liver, and he died. The Rajiz of Banu Tuhayyah said:\n*We killed Qays in the brawl ... then we ate the Hays after that.*\nSo they sought the help of Al-Harith ibn Hatib, and claimed the throwing against Zuhayr ibn Shaddad. They established proof against him. He called Al-Harith ibn Tuhayyah, and the witnesses were impugned. Al-Akhdar ibn Hubayrah ibn al-Mundhir ibn Dirar al-Dabbi stood up and said to the witness who testified against Zuhayr: \"I do not know that I have seen an obscenity except that I have seen this one riding it, except that I have not seen him screwing his mother.\" So they nullified this man's testimony against him.\nThen Al-Akhdar ibn Hubayrah said:\n*I defended Zuhayr after he thought that he was ... mixing seriousness; there is no falsehood in seriousness.*\n*I defended and threw the heavy weight before him ... a connection; a joiner will not lack good.*\n*At an hour whose address no one ... of the people is capable of unless a speaker is granted success.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 31
  },
  {
    "serial_number": "6834879",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "Qays ibn Awf left two sons: Murriq ibn Qays and Shihab ibn Qays. Murriq's name was Utybah; he was named Murriq because there was a war between Banu al-Qa'qa' ibn Ma'bad and Banu Ubayd ibn Khuzaimah ibn Zurarah. His grandfather Awf ibn al-Qa'qa' saw him while his horse was passing through the dust with him. He said: \"Who is the owner of this passing (Muriq) horse?\" It was said: \"Utybah, your son.\" So he was named Murriq. Death approached Shihab, so he said to his brother Murriq: \"O my brother, I died a mean death, so die a noble death.\" A man from Banu Tuhayyah named Hakim ibn Barq exited performing Hajj. Murriq ibn Qays intercepted him—having hidden two men with him. Murriq said: \"O uncle, we are riders who stopped at the flow of this valley, and we disputed, and there is no person of reason among us to reconcile us. If you would turn and reconcile a group of Muslims.\" So he went with him. When he descended into the valley, the two men jumped on him and made him kneel, holding him. Murriq struck him and killed him, and began to say:\n*I am not, on the day of the two Raqams, incapable ... nor is the sword, when I executed it, blunt.*\n*So do not grieve, O clan of my mother, for I ... spent the night a killer of you with a killed one.*\n*And I was not a Dhaffat, but an avenger ... who made [his camel] kneel a little upon the back of a path.*\n*If the echoes [of the dead] tell anything, they would tell ... Shihab that I have healed my burning thirst.*\n\nIbn al-Sirafi said: Imam ibn Aqram al-Numayri said—and I doubt regarding Aqram: is it with Ra or with Zay—:\n*And when I emerged to my weapons ... and Bushra, I said: I am not the poor one.*\n*The freedman of Allah; no favor upon him by ... Abu Dawud and Ibn Abi Kathir.*\n*Nor Jaz', nor Ibn Abi Sharif ... nor the client of the Emir, nor the Emir.*\n*Nor Al-Hajjaj; my eye is the daughter of water ... turning her gaze in fear of the falcons.*\n\nS said: This is the place of the proverb:\n*Lead the chests of the white camels, O Ibn Bishr ... to the right of the setting place of the Vulture star.*\n*Beware of doubt and weakness of the matter.*\nIf the explainer is doubting, how will the condition of the one explained to be? Anyone whose extent of knowledge of poetry is this amount should not address explaining such poetry and mentioning its speakers. The correct name is Aqram with an undotted Ra. Ibn al-Sirafi did not explain Bushra either, and it is the strangest thing in this poetry; it is the mare of Imam ibn Aqram al-Numayri.\n\nIbn al-Sirafi said: Nabih ibn al-Hajjaj al-Sahmi said:\n*They [dual fem.] asked me for divorce when they saw me ... my wealth was little; you two have brought a terrible thing.*\n*Woe! Whoever has property is loved ... and whoever becomes poor lives a life of harm.*\n*And perhaps wealth will increase with me ... and my back will be stripped of debts.*\n*And slaves will be seen for us, and maids ... and servants from workers, ten.*\n\nS said: This is the place of the proverb:\n*He left the joints of bones to their owners ... and turned to pick the marrow of the hamstring.*\nIbn al-Sirafi was ignorant of the speaker of this poetry, who is from the best of Quraysh, and attributed the poetry to Nabih ibn al-Hajjaj, who is from their worst. This poetry belongs to Zayd ibn Nufayl, and its beginning in order is:\n*Indeed my two wives speak to me blame ... deliberately, a speech of falsehood and desertion.*\n*They asked me for divorce when they saw me ... my wealth was little; you two have brought a terrible thing.*\n*Lower [your voices], I have nothing but the command ... and the pauper must have patience.*\n*For perhaps wealth will increase with me ... and my back will be empty of debts.*\n*And slaves will be seen for us, and maids ... and servants from newborn girls, ten.*\n*So we will drag the trails in the bliss of a man ... You two say: Put down your staff for an eternity.*\n*Woe! Whoever has property is loved ... and whoever becomes poor lives a life of harm.*\n*And he is avoided [in] the secret of matters, but ... the possessors of wealth are the attenders of every secret.*\n\nIbn al-Sirafi said: Abdullah ibn Rawahah said:\n*That you spend the night sleeping, pillowed ... struggling with the blanket or twisting the hand.*\n*Is easier than your driving until you reach Najd.*\n\nIbn al-Sirafi was not one who mastered the science of Rajaz and investigated it, for he did not bring these verses consecutively despite their fewness. The correct version is:\n*O Zayd, Zayd of the working camels, the lean ones.*\n*And Zayd of the desert of the wasteland, the unknown place.*\n*The night has grown long, you have been guided, so descend.*\n*So Zayd swooped down like the swooping of the falcon.*\nIt is Zayd ibn al-Arqam al-Ansari; he said it on the dispatch of the Muslim army to Mu'tah.\n\nIbn al-Sirafi said: Hassan said:\n*Do not forbid a behavior and do the like of it ... It is a disgrace upon you, if you do, great.*\n\nS said: This is the place of the proverb:\n*There is no cure for one who has no shame.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 32
  },
  {
    "serial_number": "6834880",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "Whoever has this merchandise of poetry, it is right for him not to expose himself to explaining poetry and mentioning its speakers given his ignorance of them. This verse is not by Hassan; rather it is by another, Al-Mutawakkil al-Laythi admonishing his son, and it is well-known poetry \"not hidden from the hyena.\"\n\nIbn al-Sirafi said: Amr ibn Ma'di Yakrib said:\n*Salma and her female neighbors knew ... no one threw down the horseman except me.*\n*I pierced his chest/belt area with the spear ... while the horses run in groups between us.*\n\nHe said: *Qatara al-Faris*: He threw him on one of his *qutrayn*, meaning his two sides. In speech resembling this.\n\nS said: This is the place of the proverb:\n*The day was long for one who has no drink ... and no comforter except the prison of Dawwar.*\nThis amount mentioned by Ibn al-Sirafi in explaining this poetry is of little avail to the beneficiary, because the true meaning is hardly known except by knowing the story related to it. That is because Amr ibn Ma'di Yakrib charged on the day of al-Qadisiyah against a Marzban (Persian commander)—thinking he was Rustam—and killed him. So he said regarding that:\n*Visit Salma before she departs ... Indeed for Salma with us there is a habit.*\n*Salma and her female neighbors knew ... no one threw down the horseman except me.*\n*I pierced his chest/belt area with the spear ... while the horses run in groups between us.*\n\nIbn al-Sirafi said: Miskin al-Darimi said:\n*And Nabigha al-Ja'di, in the sand is his house ... upon it is a slab of marble, placed.*\n*Ibn Ju'ayl's day came in Al-Jazirah ... and he parted the world and what he used to gather.*\n\nHe said: He meant that the grave of Al-Nabigha is in the sand. He mentioned the state of the earlier poets, and that they perished and went and no one remained of them. He belittles the matter of the world and scorns it.\n\nS said: This is the place of the proverb:\n*Look with your eyes; and does looking heal?*\nWhat Ibn al-Sirafi mentioned in explaining this poetry avails not a wick's worth. That is because he did not bring the two verses consecutively, but left a verse between them. Then he did poorly in his saying: \"The grave of Al-Nabigha is in the sand.\" Were it not that the poet intended by this a meaning hidden from Ibn al-Sirafi—and did not intend *a* sand from the sands here indefinitely—he would have been correct in what he said. But he meant here the sands of Banu Ja'dah, which are sands beyond Al-Falaj. He only specified these sands as having the grave of Al-Nabigha al-Ja'di because it is his land. In this poem, he mentioned poets, attributing the grave of each one to his country and birthplace. The verses indicate what I told you, and they belong to Miskin ibn Amir al-Darimi:\n*And I am not more alive than men I saw ... for every man one day is a death and a falling place.*\n*The caller of deaths called Dabi', so he came to him ... and when they called by the name of Ibn Darah, they made [him] hear.*\n*And Hisn, in the desert of Al-Thawiyyah is his house ... Indeed, the world is but an enjoyment to be enjoyed.*\n*And Aws ibn Maghra' al-Quray'i has settled ... for him above the tents of Al-Riyahi a lying place.*\n*And Nabigha al-Ja'di, in the sand is his house ... upon it is a slab of marble, placed.*\n*And a group from Himyar did not return ... to Ibn Wathil his soul when it was being pulled out.*\n*I see Ibn Ju'ayl, in Al-Jazirah is his house ... and he left the world and what he used to gather.*\n*In Najran the limbs of Al-Najashi have become ... birds seek refuge in him, circling and landing.*\nDo you not see that he placed the house of Ibn Ju'ayl in Al-Jazirah because it is the land of Banu Taghlib, and placed the grave of Al-Najashi in Najran because he is from Yemen, the land of Banu al-Harith ibn Ka'b.\n*And Shammakh has died, and Muzarrid has died ... and which mighty one, you have no father, is protected?*\n*Those are people who have passed to their path ... just as Luqman ibn Ad and Tubba' died.*\n\nIbn al-Sirafi said: Al-Akhtal said:\n*If Sadus is stingy with her two dirhams ... then the wind is good, blowing from the east (Qabul).*\nHe said: His saying: \"Then the wind is good, blowing from the east\"—it was said in its explanation: The earth is wide, man aims from it wherever he wishes, and in whatever directions of the wind he wishes to travel, he travels.\n\nS said: This is the place of the proverb:\n*I want his union and he wants my abandonment ... and how far is the affection-refuser from the affectionate mother.*\nAl-Akhtal intended by this verse a meaning other than what Ibn al-Sirafi went to. The meaning of his saying: \"If Sadus is stingy with her two dirhams... the verse\" is: We are wealthy in our condition; their withholding from us did not harm us and we did not become weak. Similar in meaning is the saying of Nasr ibn Sayyar to Banu Tamim:\n*If you help us, we are not honored by your help ... and if you forsake us, then the sky is sky [high].*\n\nIbn al-Sirafi said: Adi ibn Rabi'ah al-Taghlibi—brother of Kulayb and Muhalhil sons of Rabi'ah—eulogizing Muhalhil, and mentioning those who perished of his people:",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 33
  },
  {
    "serial_number": "6834881",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "*A gazelle from the gazelles of Wajrah reaching ... with her hands to the fresh leaves.*\n*She struck her chest towards me and said ... O Adi, for your yearning heart.*\n*What do we hope for in life after drinking companions ... whom you see having been given the cup of shaving [death] to drink.*\n\nHe said: He means he is yearning for those who perished of his people.\n\nS said: Ibn al-Sirafi erred in the second hemistich of the second verse. The correct version is:\n*O Adi, the protectors have indeed protected you.*\n\nIbn al-Sirafi said: Zuhayr said:\n*If you settled at Jaww among Banu Asad ... under the religion/obedience of Amr, and Fadak came between us.*\nHe said: Al-Jaww is the valley, Al-Din is obedience, and Amr is Amr ibn Hind the King.\n\nS said: This is the place of the proverb:\n*I hinted with speech I thought her above ... understanding, but Sulayma came with the obscure stories.*\nOften Ibn al-Sirafi misspells in obvious things that schoolboys would not misspell. That is his saying: \"If you settled at *Jaww* among Banu Asad\" with Jim dotted once below, then explaining it as the valley, and he erred in this too. The correct reading is: \"If you settled at *Khaww*\" with Kha dotted from above. Khaww is a valley belonging to Banu Asad, and there Utybah ibn al-Harith ibn Shihab was killed. Abu al-Nada recited to us for Ramah bint Husayn al-Asadiyyah—and she was Jahili (Pre-Islamic) as he claimed, and she mentioned Khaww and other lands of Banu Asad—:\n*I am blamed regarding Najd, and whoever has a love ... in Najd, various desires stir his longing.*\n*The south wind stirs him when it comes early with its scent ... Yemenite, and the lightning if its flasher flashes.*\n*And whoever blames me for the love of Najd and its people ... then let him be blamed for the like, and let his mutilator make it thorough.*\n*By your life, regarding the flood-channels, the channel of Muqallad ... then Dhu Nujub, its thickets and pushers.*\n*And Khaww, when its showers watered Khaww ... and its Tyn and its Rabai' became fertile.*\n*And the voice of a whistler [bird] answered at midnight ... whoever stays awake for it hears it.*\n*Is dearer to us than the chickens of a village ... clucking, and a settlement where its frogs croak.*\nHe said: Al-Rabai' are sides of the land of Banu Asad. He recited to us:\n*And between the two Khawws is a wide alley ... an alley between Al-Tin and Al-Rabai'.*\nAl-Tin is a mountain belonging to Banu Asad. Another recited:\n*A flashing lightning kept me awake tonight ... before it are the two Tins and Al-Rabai'.*\n*Then Waridat, then Qana, then Al-Na'i' ... and from the peak of Laman is a lofty hill.*\nAl-Awam ibn Abd al-Rahman said mentioning Al-Tin, so he dualized it too:\n*Is it true, O peak of the two Tins, that I am not seeing ... your summits except my eye is pouring [tears]?*\nFadak is thirteen days from Mecca in the land of Banu Sulaym.\n\nIbn al-Sirafi said: Al-Farazdaq said:\n*I did not cease opening doors and closing them ... until I came to Abu Amr ibn Ammar.*\n*Until I came to a youth, pure, his nature is ... bitter of determination, free and son of free men.*\nHe said: He praises Abu Amr ibn al-A'la, and Ammar is a grandfather of his ancestors.\n\nS said: This is the place of the proverb:\n*O would that Murrah were a man ... who could bear weapons and suffice a group.*\nIf Ibn al-Sirafi knew this obvious amount of genealogy, I would have been spared speaking on it. Ammar is his nearest grandfather, not \"a grandfather of his ancestors\" as he claimed. He is: Abu Amr Zabban ibn al-A'la ibn Ammar al-Mazini, from Banu Mazin ibn Malik ibn Amr ibn Tamim. Qurad ibn al-Ayyar al-Mazini meant him by his saying:\n*If the man does not have angry for him when he gets angry ... horsemen who if told 'Ride death' they ride.*\n*And a mighty people did not grant him victory ...*\nThese are well-known verses.\n\nIbn al-Sirafi said: The daughter of Abu al-Husayn from Madhhij said:\n*We and Bahila ibn Ya'sur, between us ... is the disease of co-wives, hatred and mutual abuse.*\n*Whoever of us is caught is not returning ... ever, and the killing of Banu Qutaybah is healing.*\nHe said: She said these verses in a war between them and Bahila.\n\nS said: This is the place of the proverb:\n*Far be it! You seek a thing you will not attain ... Who will provide the deaf with the sound of the bass and treble [strings]?*\nFar be it that the beneficiary benefits from anything Ibn al-Sirafi mentioned in this poetry. This poetry is not by the daughter of Abu al-Husayn ibn Madhhij; rather, it is by the daughter of Murrah ibn 'Ahan. She said it when Bahila killed her father at Armam. It is:\n*We and Bahila ibn Ya'sur, between us ... is the disease of co-wives, hatred and mutual abuse.*\n*Whoever of us is caught is not escaping ... ever, and the killing of Banu Qutaybah is healing.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 34
  },
  {
    "serial_number": "6834882",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "*Qutaybah went in the encounter with a knight ... not reckless, trembling, nor hesitant.*\n\nIbn al-Sirafi said: Al-Akhzam ibn Qarib al-Ta'i, and it is said Al-Muq'ad ibn Amr, said:\n*And their sayer says while glancing behind him ... O length of this day! Will it not end?*\n*Hallaq (Death) caught up with them on their rear parts ... striking of necks, and the booty is not important.*\nHe said: *Hallaq* is death (al-maniyah), and it is a dominant adjective like *Jada'*: which is the year of drought.\n\nS said: This is the place of the proverb:\n*So I do not see Amr returning after this ... nor did a day come to us where Amr benefited us.*\nIbn al-Sirafi did not bring any benefit here, for he made the beneficiary doubt this poetry, saying once: It is for Al-Akhzam, and once for Al-Muq'ad. Then he confused in his saying: \"Hallaq caught up with them.\" The correct reading here is: *Lihyaq caught up with them*, and *Lihyaq* is from the wording of the verb [Lahiqa], as he said:\n*When he said 'Awfa' (fulfill), a Drukah (overtaking) overtook him.*\nThe verses belong to Al-Akhzam al-Sanbasi; he said them on the Day of Qarat Huwq between Jadilah and Al-Ghawth. They are:\n*When the two raiding parties met, the raiders of Tayy ... each says: Our tribe will not be defeated.*\n*So the two gatherings collided, then overcame them ... hardship and a sword for death, sharp.*\n*Short-haired horses pacing with the heroes to the battle ... their groups follow in succession when bridled.*\n*Wide-chested, the shouting has frightened its heart ... quick in its legs, and short-haired, huge.*\n*Jadilah calls, while the spears overturn them ... until a dark road became clear with them.*\n*And their sayer says while glancing behind him ... O length of this day! Will it not end?*\n*Lihyaq (Overtaking) caught up with them on their napes ... cutting of necks, and the booty is not important.*\n*Except for killing their nobles, since they exceeded ... they have advanced from their doom what they advanced.*\n*Bujayr inspires while the spearhead is in his throat ... and says: We are more undutiful to you and more unjust.*\n*They claimed that we do not wheel our steeds ... and they are the horsemen, and the horsemen know best.*\n\nIbn al-Sirafi said: Yazid ibn Sinan ibn Abi Harithah al-Murri said:\n*So I was not cowardly and I did not recoil, but ... I aimed with it at Abu Sakhr ibn Amr.*\n*So if he recovers, I did not blow [magic] on him ... and if he perishes, then that was my destiny.*\nHe said: Yazid ibn Sinan had killed Abu Amr ibn Sakhr al-Qayni, and he was the master of Banu al-Qayn. What is in the Book [Sibawayh] is: *Abu Sakhr ibn Amr*, and what I found in the poetry is: *Abu Amr ibn Sakhr*.\n\nS said: This is the place of the proverb:\n*I think thoughts of her and I do not know ... Did Su'da kindle them or Ramim?*\nIbn al-Sirafi became confused here: he said once Yazid ibn Sinan killed Abu Sakhr ibn Amr, and said another time: And what I found in the poetry: Abu Amr ibn Sakhr. He did not exit the darkness of doubt, nor did he know the story of this poetry correctly. Then he brought the last verse of this poetry and placed it at its beginning, so he deserved that the proverb be applied to him:\n*A vulgar woman, my family married me to her ... A reckless one who thinks my head is my foot.*\nAnd he did not know the story of the verses either. The cause of this poetry is that Banu al-Qayn killed Qays ibn Zuhal al-Murri. Yazid ibn Sinan ibn Abi Harithah met them and killed Abu Amr ibn Sakhr al-Qayni, so he said:\n*When I saw the sons of Huyayy ... I remembered my hatred among them and my vengeance.*\n*I shot them with a Wajzah (arrow/spear) when they connected ... so they could shoot its throat from near and my throat.*\n*When I pierced them, it returned against them ... as if its foal was among them and my young camel.*\n*At Dhat al-Ramth when they lowered the upper spears ... as if their blades were scattered coals.*\n*So I was not cowardly and I did not recoil, but ... I aimed with it at Abu Amr ibn Sakhr.*\n*I pierced the meeting places of the backbones of him ... with a penetrating [blow/arrow] amidst shock and panic.*\n*I left the spear swaying in his loins ... as if its head was the beak of a vulture.*\n*So if he recovers, I did not blow on him ... and if he perishes, then that was my destiny.*\n\nIbn al-Sirafi said: Al-Hutam al-Qaysi said:\n*The night wrapped her with a driver who crushes.*\nHe said: Thus I found it in the Book. This verse differs regarding its speaker. I found it attributed to Abu Zaghbah al-Ansari in poetry he said on the Day of Uhud:\n*I am Abu Zaghbah, running with the old camel.*\n*Disgrace is not prevented except by pain.*\n*A Khazraji from Jusham protects the sanctuary.*\n*The night wrapped her with a driver who crushes.*\n\nS said: This is the place of the proverb:\n*Do not pass on to a youth you seek his favor ... when you meet Al-Musawir ibn Rabab.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 35
  },
  {
    "serial_number": "6834883",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "He should not have skipped what he found in the Book, as he said: It belongs to Al-Hutam al-Qaysi, which is explicit and correct. Al-Hutam is Shurayh ibn Dubay'ah ibn Sharhabil ibn Amr ibn Marthad. He was named Al-Hutam only because when he returned from his raid from Hadramawt, he said while driving [camels] with his companions:\n*The night wrapped her with a driver who crushes (Hutam).*\n*Not a shepherd of camels or sheep.*\n*Nor a butcher on the back of a chopping block.*\nThese are well-known verses.\n\nIbn al-Sirafi said: Nusayb al-Aswad said—and this Nusayb is not Nusayb al-Aswad al-Marwani—:\n*I remained at Dhu Dawran seeking my young she-camel ... and I have no young she-camel upon it nor a young he-camel.*\nAnd he mentioned four other verses.\n\nS said: This is the place of the proverb:\n*A collapsing cliff, and a clearing cloud.*\nIbn al-Sirafi's turning away from verifying the author of this poetry after this arrogance announces his ignorance of him. That is because he mentioned that its author is Nusayb al-Aswad and not Nusayb al-Marwani. So if it is neither this one nor that one, is it Nusayb the semen? The poetry belongs to Nusayb ibn Rabah al-Aswad al-Habaki, the client of Banu al-Hubayk ibn Abd Manat ibn Kinanah. Its beginning is:\n*O eagle of the nest, the nest of Dariyah ... May you be watered by the morning clouds, O eagle on a nest.*\n*Clarify to us, may your feathers not cease to be soft ... and may you not cease to be a bird with dyed claws.*\n*I saw you among birds, surpassing above them ... at the bend of the valley, the crooked one with Sidr trees.*\n*The nights pass as they passed, and I do not see ... the passing of nights making me forget the daughter of Al-Nadr.*\n*She says: Connect with me and abandon me, and you may see ... if you abandoned, that there is no connection with abandonment.*\n*So I was not pleased with what she said and did not show anger ... and my chest became tight with what I mumbled of her love.*\n*So am I anything but like the animal driven by enemies ... if it advances, slaughter; and if it retreats, hamstringing.*\n*I remained at Dhu Dawran seeking my she-camel ... and I have no young she-camel upon it nor a young he-camel.*\n*And I do not ask the shepherds except for a diversion ... with the one of bright teeth, of good scent.*\n*So the shepherds said to me: She did not mix with us ... So I said: Yes, indeed I was remembering her.*\n*And a familiar one was mentioned to me at the dune ... young camels of Sulaym or young camels of Banu Wabr.*\n*So a group said: No. And their group said: Yes. And a group said: Woe to you, we do not know.*\n*Nay, by the One whom the Talbiyah-chanter performed Hajj to His House ... and honored the signs of sacrifices and slaughter.*\n*Indeed, nights Layla spent at Al-Jafr ... increased my love for Al-Jafr and its people.*\n*So does Allah count it a sin against me that I mentioned her ... and diverted my companions with her on the night of departure?*\n*And I flew, while there was no boredom in me nor slumber ... and no fatigue or slackness in the riding camels.*\n\nIbn al-Sirafi said: Awf ibn Atiyah said:\n*Why did you not attack your mother's son, Ma'bad ... while the Amiri was leading him with a bond?*\n*And remember a drink from the milk of Al-Muhallaq ... while the horses were running in the highland, scattered.*\n\nS said: Ibn al-Sirafi erred in narrating this verse, which is his saying: \"Why did you not attack your mother's son, Ma'bad.\" The correct reading is: *Why did you not turn to your brother Ma'bad*, because he addressed Laqit with this poetry, and Ma'bad is his brother from his father and mother.\n\nIbn al-Sirafi said: Al-Aghlab al-Ijli said:\n*A girl from Qays ibn Tha'labah.*\n*Slender-waisted, possessing a concave navel.*\n*Firm of the upper part, heavy of the hips (buttocks).*\n*As if she is the ornament of a gilded sword.*\nHe said: His saying \"As if she is the ornament of a sword\" means in her glitter and beauty.\n\nS said: This is the place of the proverb:\n*The desire of my she-camel is behind me, and my desire is ahead ... and she and I are different.*\nThe poet's intent in these verses is other than what Ibn al-Sirafi went to. That is because he imagined they were ghazal verses intended for a beautiful matter, and did not know what follows it, for it leads to obscene satire, and this description is a digression to it. These verses are by Al-Aghlab satirizing Kalbah, and Kalbah used to satirize him. She is the one who says to Al-Aghlab:\n*The father of Kalbah screwed the mother of Al-Aghlab.*\n*So she jumps upon his penis.*\n*The jumping of the dog to lick the hare.*\nAnd Al-Aghlab's verses are:\n*A girl from Qays ibn Tha'labah.*\n*Slender-waisted, possessing a concave navel.*\n*Firm of the upper part, heavy of the hips.*\n*As if she is the scabbard of a gilded sword.*\n*An old man, strong of nerve, fell for her.*\n*Firm of flesh, his penis like wood.*\n*So she struck with love upon the tip of the nose.*\n*Then she bent back with it above the neck.*\n*So she announced with her voice: O father!*\n*Every girl is impressed with her father.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 36
  },
  {
    "serial_number": "6834884",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "*So he said regarding the kindnesses at the organ (need).*\n*It suffices the blame of the dyed woman hating her husband.*\n*Hard, like the leg of the pruned young palm tree.*\n*In its head is like the knotted leather bag.*\n*He hastens before what is in her with gurgling.*\nAl-Aghlab also said regarding her:\n*Will a poet overcome me, wet of vulva.*\n*Mixed, his black and his red.*\n*His weapon on the day of excitement is a censer.*\n*Soft, when he fights a peer, he overwhelms him.*\n*Kohl-eyed, sweet of appearance.*\n*More perfect than him is his color and his eye-socket.*\n*And the body is complete, and his appearance is complete.*\n*Wearing a necklace and bracelet.*\n*Slender of waist, adorned by his rear.*\n*Like a sand dune, his waist wrapper stuffed.*\n*Dyed of extremities, free of skin.*\n*His coquetry and look please the bed-partner.*\n*While she calls out under him and urges him.*\n*And he is intense in his erection and his masculinity.*\n*Until his probe disappears in the scabbard.*\n*She said to him in some of what she shares.*\n*Who buys my sword while this is its trace.*\nThis is a proverb saying: Who wants this when this is its effect? As if she is promoting her goods, saying: This is it.\n\nIbn al-Sirafi said: Layla al-Akhyaliyyah said:\n*You assault Suwar for glory and highness ... and it is in my dhimma (guarantee), if you did, he would do.*\nHe said: Suwar is Suwar al-Qushayri. He used to exchange satire with Al-Nabigha al-Ja'di. Al-Nabigha said something to Suwar that angered Layla, so she satirized Al-Nabigha.\n\nS said: This is the place of the proverb:\n*Do not recite poetry.*\nIbn al-Sirafi explained this poetry without reflection. Layla did not get angry for what Ibn al-Sirafi said, but rather she got angry because of Al-Nabigha's saying about her in a poem of his:\n*Leave aside the satire of men and turn ... to an Adhla'i (large penis) that fills your anus and flows.*\nAl-Nabigha only satirized her because of her saying:\n*Qushayr, and if I praise Qushayr, for they are ... the builders of the endeavors of Amir and its masters.*\nWhen Al-Nabigha satirized her, Layla said in a poem answering him: \"You assault Suwar... the verse\".\n\nIbn al-Sirafi said: The poet said:\n*The tribes of Ma'add and others knew ... that the generous one is Muhammad ibn Utarid.*\nHe said: He is Muhammad ibn Utarid ibn Hajib ibn Zurarah al-Darimi.\n\nS said: This lineage was hidden from Ibn al-Sirafi, and the poetry deceived him, for poetry is a place of necessity. He is Muhammad ibn Umayr ibn Utarid ibn Hajib ibn Zurarah.\n\nIbn al-Sirafi said: Al-Shammakh said:\n*O distract me before the raid of Sinjal ... and before early deaths and appointed times.*\n*And before the separation of the people, between a plunderer ... and another plundered, falling between heroes.*\nHe said: Sinjal is a place in the region of Azerbaijan, or a man's name. Al-Shammakh eulogized with this poem a man from Banu Layth ibn Abd Manat ibn Kinanah.\n\nS said: This is the place of the proverb:\n*Al-Ja'di does not know the core of the Ghayl ... nor the Ancient Falaj except by guessing.*\nIbn al-Sirafi's guessing does not yield certainty, and this indicates a deficiency he had, which is his saying: Sinjal is a man's name or a place name. Sinjal is a village of the villages of Azerbaijan. The one eulogized in the poetry is Bukayr ibn Shaddad ibn Khalid ibn Amir ibn al-Mulawwah ibn al-Shaddakh ibn Ya'mar ibn Awf ibn Ka'b ibn Amir ibn Layth ibn Bakr ibn Abd Manat ibn Kinanah.\n\nIbn al-Sirafi said: Sibawayh said in the Broken Plural, Hakim ibn Ma'yah al-Rab'i from Banu Tamim said:\n*In it are 'Ayayil (thickets), lions, and leopards.*\nHe said: What is in his poetry is *Ghayayil*. And *Ayyal*: The strutting one, and its plural is *Ayayil*. He described before the verse a spear that grew in a place surrounded by mountains and trees, so he said:\n*Surrounded by mountains, peaks, and acacia trees.*\n*In the thick of the forests, wrapped in the enclosure.*\n*In it are 'Ayayil, lions, and leopards.*\nHe said: And what is in his poetry is *Usudin* (lions) in the genitive, by adding *Ayayil* to it.\n\nS said: This is the place of the proverb:\n*Fresh news has come to you from me ... true if Al-Waddakh did not lie.*\nIbn al-Sirafi misspelled in his saying *Ayayil* that it is with an undotted Ayn, so he lied. The correct word is *Ghayayil* with a dotted Ghayn, plural of *Ghayl* (thicket/forest) on a non-standard measure. His saying: \"He described a spear\" confuses the person, so he imagines he meant by the spear here a weapon he stabbed with. Rather, he meant by the spear here stubborn might and sturdy honor. What precedes it of verses indicates that to you. It is:\n*I protect a solid spear/honor that does not break.*\n*Hard, completed in a lofty, high place.*\n*Surrounded by mountains, peaks, and acacia trees.*\n*In the thick of the forests, wrapped in the enclosure.*\n*In it are Ghayayil, lions, and leopards.*\n*Quivering, making the noses of the unwilling bleed.*\n*When the straightener bites it, it does not bend.*\n\nIbn al-Sirafi said: Zabban ibn Sayyar al-Fazari said:\n*I traveled to you from Janfa' until ... I made [camels] kneel at the courtyard of your house at Al-Matali.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 37
  },
  {
    "serial_number": "6834885",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "*For young camels that wandered a month ... in error/loss, did not travel to an error.*\n\nHe said: Zabban ibn Sayyar had bestowed favor upon Hanzalah ibn al-Tufayl ibn Malik, then Zabban traveled to him seeking reward. Al-Matali is the plural of Matla', which is soft ground. He says: Camels that wandered a month in error, meaning that after their journey and arrival, they did not obtain anything of what they wanted, so their journey was an error (loss). He says: Young camels that traveled a month in error did not travel to an error regarding the one they traveled to, because he rewarded and compensated him, so his camels did not travel in error like the camels of another man who traveled a month to a place he wanted and obtained nothing from it.\n\nS said: This is the place of the proverb:\n*She gathered firewood from dry and wet ... to her tent my firewood ends.*\n\nIbn al-Sirafi emptied his quiver here, bringing much nonsense of which not a year [tooth/truth] is sound. I had mentioned to you that whoever undertakes explaining this poetry without mastering the science of genealogy, days of the Arabs, and knowing the stopping places and water sources, his mistakes will be many. What benefit is there in his saying: \"Zabban ibn Sayyar had bestowed favor upon Hanzalah ibn al-Tufayl ibn Malik, then Zabban traveled to him seeking reward\"—without mentioning whether he rewarded him or not? He left the speech truncated due to his ignorance of this story. If he knew the stopping places and water sources, he would know that his saying: \"Al-Matla': The soft ground\" is obscene. The correct reading is Al-Matla with Fatha on the Mim and shortening (Qasr). It is a valley in the land of Banu Kilab belonging to Banu Abi Bakr. The sayer meant it when he says—recited to us by Abu al-Nada—:\n*The pigeon sang on the branches of a thicket ... of the lote trees of Bisha, wrapped in its upper parts.*\n*Singing not Arabic songs, with tongues ... of Persians, and the most pleasant gesture is their gesturing.*\n*So I said, while the white camels were sunken-eyed in their reins ... twisting the clothes of my companions vying with them:*\n*My young she-camel grazes the Arak trees, then I water her ... at the water of Al-Harirah and Al-Matla, so I give her drink.*\n*O two palm trees of the belly of Matlub, I became familiar with you ... for the soul does not end its wishes regarding you.*\n*And towards you is a filth in the people, no womb ... brings it close to us, nor a favor it repays.*\n*Surrounded by the shadow of death, you two overlooked ... at the head of a hill, difficult are its ascents.*\n*Whoever Allah gives your shade in the world ... He writes for him degrees highly in it.*\n*Your shade is moist while the sun is rising ... until its driver hides it in the lowland.*\n*Both of you, the Basil branches are your sprout ... so its morning side was turbaned with the tall, succulent [plant].*\nMatlub: A water source of Banu Abi Bakr. Zabban pluralized Al-Matla with what is around it, making it Al-Matali. Sometimes they dualized Al-Matali and said Matlayan. A Bedouin said:\n*I watered Jarir on the day passion threw him ... and Busra, and the winds led your spare horses.*\n*May Allah water Najd in spring and summer ... and single out its highlands and sides.*\n*To Ajla, then the two Matlas, then Farahis ... There is passion if only a thing approached.*\nIbn al-Sirafi did not know Janfa' either, that it is in the land of Banu Fazarah, and that Zabban said: I only traveled to you from Janfa', i.e., from the land of my people. Regarding Janfa', the Rajiz says—and shortening it is a necessity, and it is a proverbial verse—:\n*If you reach Janfa, then sleep ... and increase then in dreams.*\nHis saying \"at Al-Matali\" meant the land of Hanzalah ibn al-Tufayl ibn Malik. If he knew the story of the poetry as it is, he would not have said regarding the meaning of \"error, they did not travel to an error\" that it is praise; this is complete stupidity. The story of this poetry is that Zabban ibn Sayyar captured Hanzalah ibn al-Tufayl ibn Malik, and bestowed favor upon him. Then he came to him seeking reward, but he [Hanzalah] did not approve his reward. It is said he imprisoned him and sent his brother with his ransom. So he said:\n*The beautiful woman asks about me when ... months passed without her visitor.*\n*Why does she say he imprisons me while I have ... a swift camel and straps and a saddle?*\n*Seeking thanks did not cease until ... I sat as a hostage while my brother is a warner.*\n*A prisoner in the land of Banu Tufayl ... and how does the prisoner sleep in the leather bonds?*\nAnd Zabban also said:\n*Is there anyone to convey from me to Tufayl ... and Hanzalah who overcame my request.*\n*That young camels cast a month ... in error/loss, they did not travel to an error.*\n*We saddled them from Janfa' until ... they knelt in the courtyard of your house at Al-Matali.*\n*For sheep have profited with you ... and I will not fill my gaps with them.*\n*For if you ask your father about me ... and your mother on the day of the pebble-ground of Dhu Talal.*\n*For they, upon captivity, sought help ... from a town of haters, reddish of mustaches.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 38
  },
  {
    "serial_number": "6834886",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "*Do I feel safe after Hanzalah son of a female ... with a thing to which my foot did not guide my shoelace?*\n*That month was absent from you until ... it came to you for a night after the crescent.*\n*And your father said: If my Lord brought ... him a need, then do not give him my wealth.*\n*So if you thank, I have bestowed favor among you ... and if you deny/disbelieve, I do not care.*\n*And were it not for Amir and the man Amr ... I would have shot at you two the shot of the one shooting high.*\n*And were it not for Utbah the praised, I would have brought ... the riders near to you with a brand not worn out.*\n\nIbn al-Sirafi said: Al-Sulayk said:\n*As if the hooves of Al-Nahham, when ... my company went in the evening, were oyster shells.*\n*Upon Qarama', its legs are high ... as if the whiteness of its blaze is a veil.*\nHe said: Al-Nahham is the name of his horse, and Al-Nahham had died. He said: And I saw some of those who explain poetry mention other than this, and explain the poetry as if the horse is alive. And he said: His saying \"its legs are high\": He meant that it is complete, having no shortness.\n\nS said: This is the place of the proverb:\n*If the Sidi (wolf/man) is given a choice between error ... and guidance, the Sidi comes to what is erroneous.*\nOften Ibn al-Sirafi clings to the bad and leaves the good aside, due to his ignorance of poetry and its meanings. Rather, it is an elegy for Al-Nahham, not praise of it. He also did not know Qarama', in which land it is. Qarama' is a village of Banu Numayr, and there Al-Nahham died.\n\nIbn al-Sirafi said: The Rajiz said:\n*She says: O my Lord, O Lord, will ... if you are saving my ropes from this one.*\n*Either by divorce or by 'Ride/Depart'.*\n*As if his testicles, from dangling ... were the container of an old woman containing two colocynths.*\n\nS said: This is the place of the proverb:\n*If you work, work with seriousness ... and do not be like the processor of skin.*\nIbn al-Sirafi did not know this Rajaz nor its author, and was negligent in extracting its verses correctly. The three verses he cited before his saying \"As if his testicles\" are all defective. He did not know the author of the Urjuzah either. Its author is Khitam al-Rih al-Mujashi'i, and the order of the verses is as I have established for you here. They are:\n*O Lord of a white woman on the soft sands of Al-Armal ... whose eye resembles the eyes of a gazelle.*\n*In her is glancing away from a husband, an old man ... and she treats that with endurance.*\n*She has become enamored with a youth, huge ... shaking the sides, moist, combed.*\n*Thinking himself swaggering though he doesn't swagger ... He sent to her with a summarized messenger.*\n*Asking: How is the union with you, or how for me? ... So she did not cease with her husband, the poor one.*\n*Send, so be among those going or eat ... And eat what you ate in a lawful place.*\n*And burden, O guided one, my camel ... until when satisfaction crept into the joint.*\n*And there was in the heart the malice of the cougher ... Then the Sheikh went to her with a bag.*\n*Of satisfaction, [like] stones of a pile ... As if his testicles, from dangling.*\n*Were the container of an old woman containing two colocynths ... When he went, she began to invoke, not falling short.*\n*Saying: Lord, O Lord, hasten against him ... with a stone-bruise that kills him or a boil.*\n*Or a snake biting above the connection.*\n\nIbn al-Sirafi said: Amr ibn al-As said on the Day of Siffin:\n*If I squinted, and there is no squint in me ... then broke the eye without blindness.*\n*You would find me twisty, far of bitterness ... possessor of an assault in the great calamities.*\nHe said: This Rajaz is narrated for Al-Najashi al-Harithi, and I think it is narrated for others besides them too.\n\nS said: This is the place of the proverb:\n*No, not except that you think a thought ... even if the owl sang or trilled.*\nIf the interpreter interprets poetry with \"I think\" and \"perhaps\" and \"it is permitted\" and \"it is narrated\"—know that he is a jade (slow horse) in it. This poetry belongs to Al-Musawir ibn Hind, and its beginning is:\n*I am, for one who denied my affair, the moon ... I circumcise whom I wish and whom I wish I leave.*\n*If I looked with one eye, and there is no blindness in me ... then squinted the eye without squint.*\n*You would find me twisty, far of bitterness ... possessor of an appetite in the great calamities.*\n*Foul-mouthed if called from a male dog ... Knotted, urinating, nourished in the trees.*\n*Carrier of what I carried of good and evil ... Snake of a valley between a rocky ground and a stone.*\n*I have almost known the signs of old age ... Sleep at dinner and coughing at dawn.*\n*And sharpness of the glance and erratic look.*\n\nIbn al-Sirafi said: Muzahim al-Uqayli said:\n*And they said: You know the stopping places of Mina? ... Not everyone who comes to Mina do I know.*\nHe said: *Ta'rifuha* is like *A'rifuha* (I know it/them). *And not everyone who comes to Mina do I know*: his place where he is staying.\n\nS said: Ibn al-Sirafi erred in his saying \"And they said\" (wa qalu). Rather it is \"And they [dual] said\" (wa qala). Before the verse is:\n*And my passion for her is the passion of one who lost his camel ... at Mecca, upon whom the compassionate ones did not turn.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 39
  },
  {
    "serial_number": "6834887",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "*He saw roughness from his two companions, and missed him ... at its sandy ground, the hasty, turning camels.*\n*So they [dual] said: Do you know the stopping places of Mina? ... Not everyone who comes to Mina do I know.*\nAnd \"ta'rifuha\" means \"do you search/call for it [the lost camel].\" Ibn al-Sirafi's explanation of the verse leads a person astray, making him imagine that the phrase \"Ana Arif\" (I know) is Muzahim expressing about himself. Rather, he mentioned that as a quotation from the one who lost his camel, and mention of him passed in the first verse of these three verses, so know it.\n\nIbn al-Sirafi said: Al-Ja'di said:\n*What did you see Al-Saylahin and Bariq ... avail Hujr ibn Umm Qatal?*\n*King of Al-Khawarnaq and Al-Sadir and he subdued ... what is between Himyar—its people—and Awal.*\nHe said: The meaning is that this kingdom did not avail Hujr, nor did what he possessed and gathered push death away from him. In speech resembling this.\n\nS said: This is the place of the proverb:\n*He brought the testicles of Dukan.*\nIbn al-Sirafi brought nothing good here, for he changed the wording of the verse and corrupted it. The correct reading is: *Availed Amr and Umm Qatal*. He means Amr ibn Hind the King, and Umm Qatal is his wife.\n\nIbn al-Sirafi said: Jarir said:\n*A slave! He settled in Shu'ba as a stranger ... Is it baseness, may you have no father, and alienation?*\nJarir satirizes with this poetry Al-Abbas ibn Yazid al-Kindi. Shu'ba is a valley or a place.\n\nS said: This is the place of the proverb:\n*Only the Arab [pure-blooded horse] witnesses the race.*\nAnyone who does not know the names of the stopping places accurately—as I mentioned to you before—will slip in such a slippery place. That is because Ibn al-Sirafi did not mention the reason for Jarir's saying to Al-Abbas ibn Yazid: \"A slave! He settled in Shu'ba as a stranger.\" Why did he make it a satire, and what is the fault in his settling in Shu'ba? He only shamed him for being an ally (*Halif*) to Banu Fazarah, and Shu'ba is from their lands, while he is a Kindite, a stranger in abode to them. Being a *Halif* (client/ally) is a disgrace among the Arabs. From this is the saying of Laqit ibn Zurarah:\n*Has anyone seen the two slaves when mentioned to him ... Adi and Taym seeking someone to ally with?*\n\nIbn al-Sirafi said: Al-Marrar al-Faq'asi said:\n*Ask worries with every [camel] giving its head ... swift, mixing reddish-white color with *Muta'ayis*.*\nHe said: *Al-Muta'ayis*: That which leans towards whiteness.\n\nS said: The correct reading is: *Mixing reddish-white color (Suhba) and whiteness (Ta'is)* (*Mukhalit Suhbatun wa Ta'is*). Meaning he mixed the Suhba with the Ta'is; so he conjoined the verbal noun to the verbal noun.\n\nIbn al-Sirafi said: Husayn ibn Yazid al-Harithi said:\n*Every year cattle you gather ... a people impregnate it and you deliver [the offspring].*\n\nS said: The author of this verse is a man from Banu Dabbah, who said it on the Second Day of Kulab.\n\nIbn al-Sirafi said: Dhu al-Rumma said:\n*So lift the saddle upon a sturdy, strong she-camel ... of Mahri breed, produced by her planter, Al-Id.*\n*Looking [far] when the sun rises over its rider ... casting with the eyes of a white bull in which is sharpness.*\nHe said: Al-Id is a tribe from Mahra.\n\nS said: *Al-Id* came in the poetry out of necessity [of meter], so Ibn al-Sirafi thought it was a verification, due to his stupidity in the science of genealogy. Rather, it is: *Al-Idiyy* ibn al-Nadghi ibn Mahra ibn Haydan. Al-Ra'i said:\n*From [the breed of] Al-Idiyy, carrying me and my saddle.*\n\nIbn al-Sirafi said: Tufayl al-Ghanawi said:\n*Her combs remain absent in the middle of it ... when she lets it loose, or like that, not let loose.*\n*If she does not clean her teeth with a stick of Arak ... she selects, then she cleans them with a stick of Is-hil.*\n\nS said: This is the place of the proverb:\n*Far it is! Between baseness and generosity is a distance ... further than what is between Busra and the Sanctuary [Mecca].*\nBetween the two verses are many verses which Ibn al-Sirafi did not mention so their order could be arranged. The first of the two verses has disturbance in its beginning. Its correct form and the order of the verses is:\n*The combs get lost in her upper braids ... when sent loose or like that, not sent loose.*\n*As if the earrings and the ornaments jingled ... upon the two nose-rings of a gazelle whose horn is spun.*\n*She spent the months of summer between staying ... in a valley submissive to her, and a soft sand dune.*\n*In a wide valley, you find her above her mattress ... heavy in the forenoon, she did not gird herself with a sash.*\n*The pigeon sings above her every morning ... the singing of the drunkards in a shaded arbor.*\n*When she comes to water, her shepherds water from a sipping-well ... of short rope, its bottom not roped.*\n*Adorning the roaming-place of the eye between her pocket opening ... and her upper chest are the middles of onyx, separated.*\n*Like the ember of Ghadha wood, the wind blew on it while it was glowing ... with a fan, the north wind did not veil it.*\n*And a lush [plant] visited by the rains, as if it is ... extended, the flood fed it from the plant of the squill.*\n*If she does not clean her teeth with a stick of Arak ... she selects, then she cleans them with a stick of Is-hil.*\nSo look now how much is between the two verses—based on what Ibn al-Sirafi presented.",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 40
  },
  {
    "serial_number": "6834888",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "Ibn al-Sirafi said: Al-Najashi said:\n*I said to him: O Wolf, do you want a brother ... who consoles without reproach upon you nor miserliness?*\n*He said: May Allah guide you to the right path; you have only ... called to that which no beast before me has done.*\n\nS said: This is the place of the proverb:\n*He does not know the 'Hay'' (come here) from the 'Jay'' (go away).*\n\nIbn al-Sirafi said: Shurayh ibn Imran from Banu Qurayzah, and it is said the poetry belongs to Malik ibn al-Ajlan al-Khazraji:\n*Between Banu Jahjaba and Banu ... Zayd; so where is destruction for my neighbor?*\n*The guardians of the nakedness [weakness] of the clan, no ... leak comes to them from behind them.*\nHe said: *Al-Hafizu* (The guardians) is nominative because it is praise, as if he said: They are the guardians of the nakedness. In speech resembling this which does not benefit its hearer.\n\nS said: This is the place of the proverb:\n*Indeed Banu al-Ahmar from Fazarah ... do not fear disgrace nor a raid.*\nIf Ibn al-Sirafi feared shame and avoided disgrace, he would not have satisfied himself with interpreting poetry by saying \"it is said\" and \"I think\" and \"it is narrated\" and the like. The second verse is by Amr ibn Imru' al-Qays in a poem of his forbidding Malik ibn al-Ajlan from war. The first verse is from another poem, and has no connection to the second verse, so he brought them and their author haphazardly. The verses of Amr ibn Imru' al-Qays are:\n*O Mal[ik], and the turbaned master might ... be made reckless by some of his opinion, the excess.*\n*The slave is not raised above his Sunnah [status] ... and the truth is fulfilled and acknowledged.*\n*Indeed Bujayr is a slave to others ... O Mal[ik], and the truth is with him, so stop.*\n*For fulfillment will come acknowledging ... the truth in it to you, so do not refrain.*\n*We, with what we have, and you with what ... you have, are content, and the opinion differs.*\n*We are the patient ones, praised for ... patience, and we are the drawn swords, the disdainful.*\n*The guardians of the nakedness of the clan, no ... leak comes to them from behind them.*\n*By Allah, our clan is not scorned ... lions of a thicket whose resting place is the reed-beds.*\n*If we walk in the Persian [carpets/formation] as ... difficult [unbroken] camels walk, bending.*\n*We walk to death due to our protectiveness ... a swift walk, and our judgment is just.*\n*Indeed Sumayr, his clan refused ... to pay more than the truth they stipulated.*\n*Or to turn back the horses while they are full ... under their ears are skulls, dried.*\n*Or swallow the rage as it appears to you ... so practice war where you turn away.*\n*Indeed, I belong, when I belong, to ... a high glory, and our people are nobles.*\n*White, light, as if their eyes ... are lined with Kohl by the darkness in the epic battles.*\n\nIbn al-Sirafi said: Durayd ibn al-Simma said:\n*Does it please you that Time is a face [variable] ... upon you, coming and going with its gifts?*\n*And that you do not suffer the loss of family and wealth ... whose destruction harms you, and my life is prolonged?*\n*So your soul has lied to you, so belie it ... for it is either anxiety or beautiful patience.*\nHe said: He is addressing his wife, saying to her: If you think or your soul tells you this which I told you about. In speech resembling this.\n\nS said: This is the place of the proverb:\n*You memorized something, and things were absent from you.*\nDurayd's purpose in striking this proverb and addressing his wife with it was only a meaning for which he made this digression, which is that he eulogizes with this poetry Mu'awiyah ibn Amr ibn al-Harith ibn al-Sharid, the brother of Al-Khansa, whom Banu Murrah killed. The verses are:\n*Is it not that she came early blaming without measure ... and she was harsh with me and entered my veil?*\n*If you do not leave my blame foolishly ... your soul will blame you for me in any age.*\n*Does it please you that Time is neglected [variable] ... upon me, coming and going with its evil?*\n*And that you do not suffer the loss of a soul and wealth ... whose destruction harms you, and my life is prolonged?*\n*So your soul has lied to you, so belie it ... for it is either anxiety or beautiful patience.*\n*For the calamity, the day I stood calling ... and Mu'awiyah ibn Amr did not hear.*\n*I saw his place so I turned askance ... and what a resting place of crookedness, O Ibn Bakr.*\n*To stones and rocks and a grave ... and branches of the Salam trees, brown.*\n*And the building of graves, there passed over them ... the length of time, of a year and a month.*\n*And if you had made him hear, he would have come hastily ... striving quickly or he would have come to you running.*\n*With the equipment of a determined one, there is no fault in him ... when the heroes wear the skins of leopards.*\n*So if you spend the evening in a grave, staying ... in a place swept by the winds, desolate.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 41
  },
  {
    "serial_number": "6834889",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "*Then hard upon me is your death, O Ibn Amr ... and I have no determination or patience regarding you.*\n\nIbn al-Sirafi said: Ibn Muqbil said:\n*O eye, weep for Hanif, the head of their tribe ... the breakers of spears in the nakedness of the rear/turn [of battle].*\nHe said: Hanif is a clan in Banu al-Ajlan.\n\nS said: This benefit from Ibn al-Sirafi increases the beneficiary's ignorance of this lineage. It is only said: \"So-and-so is from Banu So-and-so\" if there are fathers and grandfathers between him and the Great Grandfather. But if he is from his loins, it is said: He is his son. Hanif is the *son* of Al-Ajlan, and the name of Al-Ajlan is Abdullah ibn Ka'b ibn Rabi'ah ibn Amir ibn Sa'sa'ah.\n\nIbn al-Sirafi said: Ibn Muqbil said:\n*A Yemeni girl circled his old properties ... calling the leaders from Amr and what they gathered.*\nHe said: Amr is a tribe, and it is Amr ibn Kilab in my opinion. And it is possible he meant Banu Amr ibn Tamim. It is narrated: \"The leaders from Bakr,\" and it is possible he meant by Bakr Banu Abi Bakr ibn Kilab. His saying \"Yemeni\" does not agree with this explanation, because the tribes I mentioned are all from Nizar [Northern Arabs].\n\nS said: This is the place of the proverb:\n*You stirred up from the disease what had been obliterated ... as the wind obliterates the trench of the dust.*\nIf Ibn al-Sirafi had not spoken on this verse, the nakedness of his tongue would not have appeared—may his eye be hot [may he weep]. [He erred from] two aspects: One is that he said: It is possible he meant Banu Amr ibn Tamim. Where are Banu al-Ajlan from Tamim? It is only Amr ibn Kilab. The other is that he said: His saying \"Yemeni\" does not agree with this explanation, because the tribes I mentioned are all from Nizar. He did not know that Banu Amir are attributed to Yemen because they used to inhabit Najd adjacent to Yemen, and that Ghatafan are called Shamiyah (Levantine) because they inhabit Najd adjacent to Syria/Levant. Therefore, Al-Nabigha al-Dhubyani said in his satire of Zur'ah ibn Amr ibn Khuwaylid ibn al-Sa'q from Banu Nufayl ibn Amr ibn Kilab:\n*And you would have been his trustee if you hadn't betrayed him ... but there is no trust for the Yemeni.*\nSo Zur'ah ibn Amr answered him:\n*And which people is more treacherous than a Shami (Levantine/Northern) ... who has two cold places [conditions], loose of tongue.*\n\nIbn al-Sirafi said regarding the saying of Al-Nabigha al-Ja'di:\n*So a day remained for the women of Al-Nu'man from us ... at Safwan, a hard/grieving (Arwanani) day.*\nHe said: The verse is recited in the poem as *Arwananin* (genitive), attributed (Nisba). He lightened the Ya of attribution from it; he intended *Arwananiyyun* so he lightened it. Similar to it is:\n*Indeed, for he who denies me, I am Ibn al-Yathrubi ... I killed Ilba' and Hind al-Jamali.*\nHe said: He intended *Al-Yathrubiyy* and *Al-Jamaliyy*. It should be written with a Ya because it is attributed, and the doubt is removed from it.\n\nS said: This is the place of the proverb:\n*This has a root, so what is the root of this? ... And I am not far from investigating it.*\n*Al-Jamali* is attributed as he mentioned. As for *Al-Yathrubi*, it is a verified name, not attributed, just as they said: Makki ibn Sawadah, and Fadaki ibn Amr, and Idiyy ibn al-Nadghi, and likes of that are many in the speech of the Arabs. Ibn al-Sirafi did not know the speaker of this poetry, nor whom it was said about. It belongs to Abdullah ibn Yathrubi al-Dabbi. Hind al-Jamali is Hind ibn Amr ibn Jandalah ibn Ka'b ibn Rabi'ah ibn Jamal ibn Kinanah ibn Najiyah ibn Yahabir, and he is Murad. He was killed, may Allah have mercy on him, with Ali ibn Abi Talib, peace be upon him, on the Day of the Camel; Abdullah ibn Yathrubi al-Dabbi killed him. He said:\n*If you deny me, then I am Ibn Yathrubi ... Killer of Ilba' and Hind al-Jamali.*\n*Then Ibn Sawhan upon the religion of Ali.*\n\nIbn al-Sirafi said: Jandal al-Tahawi said:\n*Did it deceive you that I became few/poor (Taqarabtu), O Abu 'Uray ... and that you saw Time possessing circles [calamities]?*\n*It bent my bones and I show it my gaps [missing teeth] ... and applying Kohl to my eye with motes.*\nHis saying: *Taqarabtu* O Abu 'Uray: He means that he left traveling and journeying to kings, so his camels are gathered, not separating from each other.\n\nS said: Ibn al-Sirafi erred here. The meaning of *Taqarabtu* is \"I became few\" (Qallaltu), meaning from its fewness, some of it became close to some.\n\nIbn al-Sirafi said: Maqas al-A'idhi, and his name is Al-Nu'man, said:\n*Ransom for Banu Dhuhl ibn Shayban is my she-camel ... when there is a day possessing stars, gray.*\n*Kalb treated us with hardship, and Taghlib directed ... against our delegates in Al-Jazirah.*\nHe said: Kalb complained to Yazid ibn Mu'awiyah that a man from Banu Shayban was settled at some waters, and if traveling people passed by him, he prevented them from water. So he wrote to Ziyad, and wars occurred between some of Banu Shayban and others caused by this matter.\n\nS said: This is the place of the proverb:\n*At Dhat Ghisl is what is at Dhat Ghisl ... and Tharmada' is a branch of my mind.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 42
  },
  {
    "serial_number": "6834890",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "Ibn al-Sirafi's mind wandered here, and he brought nonsense speech that does not resemble itself nor fit, due to his ignorance of the conditions of the Arabs of the Jahiliyyah and Islam and what is between them. When did Maqas al-A'idhi meet Yazid ibn Mu'awiyah when he was in the deepest Jahiliyyah? He eulogized Sharik ibn Amr Abu al-Hawfazan, and Al-Hawfazan did not reach Islam. He is the one who says regarding Sharik ibn Amr:\n*O eye, weep for the youth of wars, Ibn Amr ... and mourn him, for you have been bereft of a great one.*\n*O drinking companion of kings, he is given the cup of quenching to drink ... neither spoiled nor bored.*\nRather, the verses of Maqas are verses of boasting about Banu Shayban; he boasted of them while he was from 'A'idhah of Quraysh, except that his count is among Banu Shayban. The verses are:\n*Ransom for Banu Dhuhl ibn Shayban is my she-camel ... when there is a day possessing stars, gray.*\n*When the flank becomes shivering as if ... it is completed by thousands of horses, brought near.*\n*Kalb treated us with hardship and Taghlib directed ... against our delegates in Al-Jazirah.*\n*It flew the sandgrouse of peace from every side ... so the caller almost overcame the people.*\n*You see the horses galloping, limping as if ... upon them are thickets of blackness, reeded.*\n*Defended by them are women, without obscenity ... and the insults of a sheikh who was not reviled.*\n*And whoever does not find a building-place for his forehead ... with a master of ours, prominent of horn, gray-haired.*\n*And whoever's house his people of glory do not establish ... our house establishes a glory, mighty, strong.*\n*And whoever of them is distant from his origin ... then my origin is fixed among them.*\n*I pour praise upon them as if I am ... when night covers, a yearning singer.*\n*And indeed my life is attached to their life ... and among their dead my bird falls.*\n\nIbn al-Sirafi said: Ru'ba said:\n*Were it not for my ascending upon the heights, there would have fed me [to death] ... in the desolate desert.*\n*In the like of the fall of the Pit of Al-Wassaf.*\n*Your saying sayings with swearing.*\n*In it is swallowing/slighting, what a swallowing.*\n*And Allah is between the heart and the intestines.*\nHe said: *Al-Huwwah*: The pit/hollow. *Al-Mahwa*: The space between the top of a thing and its bottom. *Al-Wassaf*: A man from the people of the desert; he attributed the pit to him.\n\nS said: This is the place of the proverb:\n*The worst of helpers if you seek his help ... is an old man who if you wake him, scratches his ass.*\nIbn al-Sirafi's saying: \"Al-Wassaf here is a man from the people of the desert\" indicates that he was weak in the science of genealogy. And his saying \"Al-Huwwah: The pit\" indicates also his weakness—it was—in knowing the stopping places and water sources of the Arabs. What benefit is there in his saying: \"Al-Wassaf is a man from the people of the desert\"—whether he is Bedouin or settled—if his name and cause are not known? The Pit of Al-Wassaf (*Huwwat al-Wassaf*) in Ru'ba's poetry is a hole/cavity (Dahl) in Al-Hazn belonging to Banu al-Wassaf from Banu Ijl. Al-Wassaf is Malik ibn Amir ibn Ka'b ibn Sa'd ibn Dubay'ah ibn Ijl ibn Lujaym. The Pit of Al-Wassaf is a proverb among the Arabs, they use it in invoking curses upon a person. It was recited for Al-Haddar ibn Hakim invoking against a person of mixed lineage:\n*Whoever cheats or mixes lineage some mixing ... may Allah single him out with a shivering fever.*\n*And with a hot water burning the intestines ... and the bitter cold after that, the freezing wind.*\n*And may He throw him into the Pit of Ibn al-Wassaf ... so that his grave is far from the graves.*\n*You have from me neither muddy nor pure [water] ... except the supplication of Allah, not unjust.*\n*He is the One who creates what is in the interiors ... and taught writing with Mim or Kaf.*\n\nIbn al-Sirafi said: Abu Tharwan said, and it is narrated for Al-Ma'lut ibn Badal:\n*Indeed the gazelle whose inadvertence you hope for ... is a gathering [army] by which Al-Atakan or Atad become narrow.*\n*Carrying the rings of the Maziy (armor), urged by ... the Mashrafi [swords] and a forest [of spears] above it, reaped/dense.*\nAl-Atakan: Dual of a place name. Atad is conjoined to it. Al-Maziy: The armor. In speech resembling this raving.\n\nS said: This is the place of the proverb:\n*The man is not in anything, and the jerboa is not in anything.*\nNeither Abu Tharwan is anything in this poetry, nor Al-Ma'lut. Rather, it belongs to Al-Zibriqan ibn Badr. Ibn al-Sirafi also did not mention in his explanation anything indicating useful benefit, because he did not know its story. Such poetry, if its story is not known, its meaning is not known at all.\nThe story of this poetry is that the Prophet, peace and blessings of Allah be upon him and his family, sent Al-Zibriqan ibn Badr over the Sadaqat (alms) of Awf ibn Ka'b, and Abd Shams ibn Sa'd, and Imru' al-Qays ibn Zayd Manat. The Prophet, peace be upon him and his family, passed away while many camels from the Sadaqah had gathered in his [Al-Zibriqan's] hand. Tribes apostatized, and some collectors of the Prophet, peace and blessings of Allah be upon him and his family, apostatized and went away with what was in their hands.",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 43
  },
  {
    "serial_number": "6834891",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "Among those who apostatized was Qays ibn Asim al-Minqari; he distributed the Sadaqah of the Prophet, peace be upon him, among his people. When Banu Awf and some of Al-Zibriqan's companions saw that, they said: \"Do with us as Qays did.\" He kept delaying them with promises. The Abna' (Sons)—the sons of Sa'd—wanted to demand it. He promised them: \"Meet me tomorrow.\" Then he gathered it and shouted at it [drove it] to Abu Bakr, he and his sons. He said: \"O my sons, this is the salvation of the Hereafter and the glory of the World.\" He and his six sons drove it: Hazn, Taghlib, Ayyash, Al-Hurr, Ziyad, and Bajalah—sons of Al-Zibriqan. Ayyash had no offspring. He said regarding the Abna' when they tried to trick him out of it, in a poem of his:\n*O wonder! The 'Uqad (Knots) of the Abna' try to trick me ... and Allah knows best what the 'Uqad try to trick.*\n*They marched to us at midnight to carry [it] away ... and there is no hostage except a master, a leader.*\n*You have seen settling clans not far ... from you, near, watered on alternate days, before them are lions.*\n*March slowly, for we will not miss you ... even if what is between us is easy for you, level ground.*\n*Indeed the gazelle whose inadvertence you hope for ... is a gathering [army] by which Al-Atakan or Atad become narrow.*\n*Carrying the rings of the Maziy, urged by ... a striking, severe, and stabbing between it, reaping.*\nAl-Atakan and Atad are valleys belonging to Banu Bahdalah.\n\nIbn al-Sirafi said: Al-Ajjaj said:\n*A striking like Hadhadhik, and stabbing and piercing.*\n*It penetrates to the stubborn vein, the flesh.*\n*Until they shattered like beads scattered.*\nHe said: *Darban* (Striking) is accusative by implication of: We strike them a striking like Hadhadhik, i.e., it cuts the meat a cutting after cutting. In speech resembling this that does not heal burning thirst. That is because he did not mention the one praised in this poetry, so the imaginer imagines they are verses of boasting. Rather, they are verses of praise; he praised Al-Hajjaj ibn Yusuf with them. It is:\n*So they found Al-Hajjaj refusing oppression.*\n*Neither senile nor recently young/tender.*\n*And from the pure nobles, pure.*\n*He repays them with stabbing, a loan for a loan.*\n*And sometimes they advance an obligation.*\n*A striking like Hadhadhik, and stabbing and piercing.*\n*It penetrates to the stubborn vein, the flesh.*\n*Until they shattered like beads scattered.*\nThese are verses. So his saying \"Striking and Stabbing\" is actually a substitute (Badal) for his saying \"Obligation\" (Fardan), and what Ibn al-Sirafi said is not correct.\n\nIbn al-Sirafi said: Al-Mulabbid ibn Harmalah from Banu Abi Rabi'ah ibn Dhuhl ibn Shayban said:\n*My camel complains to me of the length of the night journey ... Beautiful patience, for both of us are tested.*\nAnd in his poetry: *My horse complains to me of the fall of spears.*\n\nS said: Agreement of Al-Mulabbid's poetry and the verses of the Book [Sibawayh]. The verse of the Book is not by Al-Mulabbid ibn Harmalah al-Shaybani. Rather, Abu Ubaydah was asked about its author, and he said: It is by some camel drivers. He recited:\n*My camel complains to me of the length of the night journey ... O my camel, the complaint is not to me.*\n*Beautiful patience, for both of us are tested ... The two Dirhams have burdened me with what you see.*\nS said: My memorization is: \"Sabran Jamili\" (My patience is beautiful). As for Al-Mulabbid's verses, there is no \"beautiful patience\" in them. They are:\n*My horse complains to me of the fall of spears ... Patience, Jamil, for both of us are tested.*\n\nIbn al-Sirafi said: Ibn al-Zubayr al-Asadi said:\n*Convey to Yazid son of the Caliph that I ... met from injustice the one with a blaze and white legs [conspicuous injustice].*\n*If it were you, if the like of it bit you ... you would have dragged upon whatever you wished a chest and a breast.*\n*And I was your brother of truth in every scene ... of pain, even if they boiled my flesh in a cauldron.*\nIbn al-Sirafi mentioned in the explanation of these verses something of syntax and language that does not benefit its reader much. I had mentioned to you that such poetry, if its story is not known, its meaning is not known at all. Ibn al-Zubayr satirized with this poetry Abd al-Rahman ibn Abdullah ibn Rabi'ah ibn Habib al-Thaqafi, and his mother was Umm al-Hakam bint Sakhr ibn Harb ibn Umayyah, and he was over Kufa. The cause of his satire of him was: That people from Banu Alqamah ibn Qays ibn al-A'sha ibn Najrah killed a cousin of Ibn al-Zubayr from the descendants of Al-Ashyam ibn al-A'sha. Abd al-Rahman guaranteed to Ibn al-Zubayr two blood-monies against the people, but refused to grant him retaliation (Qisas). Abdullah [Ibn al-Zubayr] got angry and refused to accept. He went out to Yazid ibn Mu'awiyah—and Yazid hated Abd al-Rahman—so Abd al-Rahman sent in pursuit of him, and he was returned to him. He fled from him, so he took his women and imprisoned them and demolished his house. So Ibn al-Zubayr said:\n*Convey to Yazid son of the Caliph that I ... met from injustice the one with a blaze and white legs.*\n*I met by analogy of the matter a hardship ... and a day at Jaww that was most arduous and longest.*\n*And I was your brother of truth in every situation ... of pain, even if they boiled my flesh in a cauldron.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 44
  },
  {
    "serial_number": "6834892",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "*And if it were you, if the like of it bit you ... you would have dragged upon whatever you wished a chest and a breast.*\n*And I was a right hand to your left wherever ... your hands pointed with it, until it separated.*\n*And indeed, the son of a stick belonging to Al-Bazikh made me kneel ... at Jaww, indeed he gave me a misleading resting place.*\nIt was said to Umm al-Hakam while she was with Abdullah [al-Thaqafi]: You married this Thaqafi while you are who you are and he is who he is? She said: A husband from a stick ('Ud) is better than sitting (Qu'ud) [spinsterhood].\n\nIbn al-Sirafi said: Al-Aghlab said:\n*The length of nights hastened my undoing.*\n*They took some of me and left some of me.*\n*They bent my length and bent my width.*\n*They made me sit after the length of my rising.*\n\nS said: This Rajaz is not by Al-Aghlab; it is like others of the stray Rajaz. Its beginning and completion is:\n*I have become such that some of me does not carry some of me.*\n*Exhausted, I go like the emaciated camel.*\n*The passing of nights hastened my undoing.*\n*They folded my length and folded my width.*\n*Then they stripped the flesh from my bones.*\n*They made me sit after the length of my rising.*\n\nIbn al-Sirafi said: The poet said:\n*And you are a man from the people of Najd, and our family ... is Tihami, so what [connection] is the Najdi and the Tihami [dweller]?*\nThat is: You are a man different from us in the place you inhabit of the earth. You are from the people of Najd, and we are from the people of Tihama, and the two places are different, so we do not agree, and what is between us is far like the distance of our land from your land.\n\nS said: This is the place of the proverb:\n*I want small things from Hunayn so they twist ... against me; and from where are small things for Hunayn?*\nThe meaning of the verse and the poet's intent is not what Ibn al-Sirafi went to. Between the correct [view] and what he said is what is between Jabalqa and Jabarsa. The meaning of the verse—which is by Jamil—is that my family will be suspicious of you if they find you with them, because you are a stranger, far of abode from them, so they will deny your presence among them. So you must avoid and turn away. She warns him of her male cousins. He recounts that from Buthaynah. The verses clarify this meaning for you, Allah willing. They are from a poem of his:\n*And the last covenant I had with her was the day she bid farewell ... and a cheek, pure, and an eye-socket appeared to us.*\n*An evening she said: Do not waste our secret ... when you are absent from us, and guard it when you are present.*\n*And do not let the tribe know if you come visiting ... for you are seeking us, not when you turn back.*\n*And your glance, if you come to us, guard it ... for the deviation of passion is apparent to one who looks.*\n*And turn away if you meet an eye you fear ... and show some [indifference], for that is more concealing.*\n*For if you expose me in speech ... a slanderer, increasing in what you said, will increase.*\n*And spread a saying among the friend and others ... whose spreading is hard upon us when it is spread.*\n*And I did not cease working your glance towards us ... with your eyes until your secret almost appeared.*\n*To my family, until every advisor blamed me ... compassionate, having kinship with me and a bond.*\n*And the friend cut me off regarding you in blame ... and indeed I disobey their prohibition when I am rebuked.*\n*And I did not say this, know well, to cut ... the rope, nor is this shortening [of love] for an hour.*\n*But rather I, my family be your ransom, fear ... the eyes of the haters against you and I am cautious.*\n*And I fear my cousins against you, and sometimes ... the thinker fears and his honor is kept pure.*\n*And you are a man from the people of Najd, and our family ... is Tihami, so what is the Najdi and the Tihami?*\n*A stranger, when you come seeking a need ... and enemies are around me, and you are conspicuous.*\n*So I said to her: You have advised, O Buthn, sufficiently ... and every man whom Allah does not guard is exposed.*\n\nIbn al-Sirafi said in explaining his saying: *And she wiped the crushed antimony (ithmid) on the gums*.\nIthmid was not among the things found in the land of the Arabs, so they do not know its reality. Similar to that is the saying of Abu Nakhilah:\n*A girl of the wilderness, she did not eat the flatbread.*\n*And did not taste from the legumes (baqul) the pistachio.*\n\nS said: Ibn al-Sirafi misspelled in the verse he cited, making *Al-Nuqul* (dried fruits/nuts) which is with Nun, *Al-Baqul* (legumes) with Ba, because of what he and others say: that Abu Nakhilah imagined pistachio is a legume. Abu Nakhilah was not one who didn't know pistachio; someone older than him knew it, namely Abu al-Qamqam ibn Mus'ab al-Asadi. Rather, the meaning of Abu Nakhilah's saying is: that this Bedouin woman does not eat thin bread, and does not snack on pistachios, the goods of city women; she is only fed on the pure and sour milk of milch camels, as Bishr said:\n*Sour milk flowing over her fed her ... and pure milk where the pregnant camels are engaged.*\nAbu al-Qamqam's verses are:\n*Prepare two sandals for the foot of a Hadlaq (big-lipped one).*\n*If you do not give him shoes, he will split.*\n*A mountain path of sheep, they lived by hanging on [grazing].*\n*And say good to him even if you do not validate.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 45
  },
  {
    "serial_number": "6834893",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "*And thunder and do not rain anything, and flash.*\n*You ask me about the good things of pistachio.*\n*While I only lived on the grains of the 'Ashraq plant.*\n*And on soup of burnt barley.*\n\nIbn al-Sirafi said: Al-Farazdaq said:\n*We found Nahshal preferred Fuqaym ... like the preference of the son of the pregnant camel over the weaned foal.*\n*If they settle at Lasaf they build upon it ... houses of baseness and long humiliation.*\nHe said: Nahshal and Fuqaym are the two sons of Darim.\n\nS said: Ibn al-Sirafi's saying that Nahshal and Fuqaym are the two sons of Darim indicates that he was poor in insight into the genealogies of the Arabs. Rather, Fuqaym is the nephew (brother's son) of Nahshal; he is Fuqaym ibn Jarir ibn Darim. He left a verse between the two verses without which the meaning of the first verse is not correct. The order of the verses—and they are three—is:\n*We found Nahshal preferred Fuqaym ... like the preference of the son of the pregnant camel over the weaned foal.*\n*Both young camels [sons] helped what was next to him ... but the difference between them is small.*\n*If they settle at Lasaf they build upon it ... houses of baseness and long humiliation.*\n\nIbn al-Sirafi said: Malik ibn al-Rayb said:\n*Upon me is the blood of the sacrificial camels if you do not part from ... Abu Hardab one day and the companions of Hardab.*\nHe said: Abu Hardabah was one of the thieves. He used to cut the road (rob), he and Malik ibn al-Rayb and a group with them. The Rajiz says about him:\n*Allah saved you from Al-Qasim.*\n*From the belly of Falj and Banu Tamim.*\n*And from Ghuwayth, opener of baskets.*\n*And from Abu Hardabah the sinner.*\n*And Malik and his ominous sword.*\nHe said: He meant by his saying \"if you do not part\" his riding camel; he meant that it parts from his companions. It is possible he meant camels they had taken, so Malik wanted to take them from them.\n\nS said: This is the place of the proverb:\n*They fought; if only they were blowing into charcoal.*\nIbn al-Sirafi spoke much in explaining this verse without hitting the joint or applying the articulation. He mentioned everything except the meaning of his saying \"if you do not part from Abu Hardab,\" which is the pillar of the verse's meaning, and it is not known except after knowing the story. The story of that was: A man from the Ansar from the people of Medina was appointed over them. He advanced and took Malik and Abu Hardabah. He sent Abu Hardabah away and stayed behind with the group containing Malik. He ordered a servant of his, so he began driving Malik. Malik caught the Ansar's servant unawares—he was wearing the sword—so he snatched it from him then struck him with it until he killed him. Then he attacked the Ansari and killed him. Then he fled until he reached Bahrain, then went to Fars fleeing from that event. He remained residing there until Sa'id ibn Uthman came to him and took him as a companion, so he went out with him. Regarding this story and his parting from Abu Hardabah, Malik says:\n*I traveled in the darkness of a night, so the deserts of Humran al-Sharif became before it [the camel], setting.*\n*Looking out from Wadi al-Kilab as if she is ... when she ascended from it, a lone gazelle of a herd.*\n*Upon me is the blood of the sacrificial camels if you do not part from ... Abu Hardab at night and the companions of Hardab.*\n\nIbn al-Sirafi said: Abu Mihjan said:\n*O Lord, a naive woman like you among women ... white, I have given her enjoyment by divorce.*\nIbn al-Sirafi erred in attributing this verse to Abu Mihjan. He was deceived by the fact that the author of this verse is a Thaqafi, but he is not Abu Mihjan; rather he is Ghaylan ibn Salamah al-Thaqafi. They are two verses, the second being:\n*She did not know what was under the ribs, and deceived her ... from me, the beauty of my companionship and my character.*\n\nIbn al-Sirafi said: Salim ibn Darah said:\n*I am Ibn Darah, my lineage is known by her ... And is there, O people, any disgrace in Darah?*\n*From the stock of Qays, and my maternal uncles are Banu Asad ... the noblest of people, my fire stick ignites among them.*\nHe said: Darah: Salim's grandfather.\n\nS said: Ibn al-Sirafi erred in that. Darah is the mother of Salim and Abd al-Rahman sons of Darah, a woman from Banu Asad likened for her beauty to the halo (Darah) of the moon.\n\nIbn al-Sirafi said: Al-Ashhab ibn Rumaylah said:\n*And how many a brave hero I missed ... and a gambler in winter, generous, digestible [easy-going].*\n*So did the day cease so it became night ... and did the stars leave their rising places?*\nHe said: He says, did the day cease because of his loss and death, and did the stars sink because of the calamity of him? He means: The world; the habit in it is that people perish, and it does not change for the loss of one lost from it, even if he was noble.\n\nS said: This is the place of the proverb:\n*If the masters of Al-Hujaym and Mazin are ... few, then their fools are not few.*\nIf Ibn al-Sirafi's correctness is little; his confusions are many. Al-Sirafi advanced a verse that should be delayed, and delayed a verse that should be advanced.",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 46
  },
  {
    "serial_number": "6834894",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "The verse that should be advanced is his saying: \"So did the day cease,\" which is in the description of a long night. The other verse is an elegy for a killed man, and neither of the two verses relates to the other in meaning. Such poetry, if its story and completion are not known; its meaning does not become clear at all. I will present the verses that clarify the meaning of the two verses for you, then I will mention their story afterwards, Allah willing. The verses are:\n*You stayed awake and worries did not sleep from you ... and the old yearning returned to your heart.*\n*You struggle with the middle of a dark [night] possessing shadows ... as the sick man struggles with the night.*\n*As if its stars are herds of cattle ... appearing in the sky and not moving.*\n*So did the day cease so it became night ... and did the stars leave their rising places?*\nUp to here is the completion of the description of the length of the night. Then he began to eulogize whom he lost of his people, and mention their loss. As Amr ibn Ma'di Yakrib said:\n*How many a righteous brother of mine ... I settled him with my hand in a niche-grave.*\n*I did not get anxious nor panic ... and my weeping does not return a fire-stick.*\nReturning to the verses of Al-Ashhab:\n*And how many a brave hero I missed ... and a gambler in winter, generous, digestible.*\n*And refusing [injustice], when he is offered humiliation ... fierce when adversaries oppose.*\n*They passed to their way and I sat alone ... fate turning away with me and going straight.*\n*As if the accidents of days come ... upon a smooth rock having no scratch.*\nUp to here is the complete meaning of the two verses. Then we mention the rest of the verses after mentioning the story, Allah willing.\nThe story of this poetry—which is the hadith of Rabab ibn Rumaylah—is that Rumaylah was a slave girl of Khalid ibn Malik ibn Rab'i ibn Salma ibn Jandal ibn Nahshal ibn Darim, born among Arabs, they claim she was from the captives of the Arabs. Thawr ibn Harithah ibn Abd al-Mundhir ibn Jandal ibn Nahshal ibn Darim bought her, and he was with her among his camels. He married her, and she bore him: Rabab, Hajn, Al-Ashhab, and Suwayt. They were among the strongest of brothers among the Arabs in tongues and hands, and the most protective of their side. Their wealth increased in Islam. Thawr had bought Rumaylah in the Jahiliyyah. When people went out to the desert from their waters, Rabab used to take a red velvet cloak of his. When people got rain, he would occupy the pools of Al-Samman, take its fringe and place it on the trees of it—meaning I have preceded to this—so no one would approach it, and he would take what he needed and what he didn't need. They got rain, so he did that in the pools of Al-Samman. People from Banu Qatan ibn Nahshal occupied the pools with him. Banu Qatan, Banu Zayd ibn Nahshal, and Banu Manaf ibn Darim were allies. Al-Ahjar were allies over them, and Mukharribah also were with them. A man from Banu Manaf ibn Darim called Samurah ibn Awdah, kunya Abu Karsha'—he is the one Al-Farazdaq says about:\n*And Abu Karsha' is not a thief ... but whenever the people steal, he eats.*\nThe Manafi man came to some of Rabab's troughs and watered his camel. Rabab slapped his camel. He went away angry to those who were there from Banu Qatan, who were Banu Arbad ibn Damrah ibn Jabir ibn Qatan ibn Nahshal. He informed them and they got angry. Evil occurred and the people fought. Rabab ibn Thawr struck Bishr ibn Subayh ibn Arbad ibn Damrah—he is Ibn al-Absiyyah, his mother being the daughter of Ubayy ibn Humam ibn Qurad ibn Makhzum, and Bishr is Abu Badhal—with the pole of his tent. The hair flew from his skull and what was under the skin of his head was crushed, but no blood flowed, and he did not die on the spot; he remained alive. Rabab said:\n*I said to him: Patience, Abu Badhal ... Indeed I, by the House of Allah, do not care.*\n*That the last of the nights returns.*\nThen the two clans separated, and each gathered for his opponent. Banu Qatan said: \"O Banu Jandal and O Banu Sakhr and Jarwal, your companion has struck our companion this blow, and we do not know if he will die from it or live. So be fair to us: hand over your companion to us and take our companion and treat him. If he recovers, ask us and we will gift [compensation] to you. If it is the other [death], then he is our killer. If we pardon, we pardon our right, and if we take retaliation or blood money, we take our right.\" The people refused. So they fought that day of theirs until the night. But Ubayy ibn Ashyam, the brother of Banu Jarwal—and he was their master—went out for a need. Some of Banu Qatan met him, took him, and brought him to their companions. Nahshal ibn Huray said: \"O Banu Nahshal, obey me today and disobey me forever.\" They said: \"Yes, we obey you.\" He said: \"This man is not your killer, and he is innocent; his blood is not lawful for you. And his people are the fiercest of those fighting you, so let him go.\" They said: \"Consider your opinion.\"",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 47
  },
  {
    "serial_number": "6834895",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "Nahshal said: \"O Abu Asma', we do not care who stands between us and our killer before us. You and your people have fought us denying our right, and Allah has enabled us over you. By Allah, your blood satisfies us more than Banu Rumaylah. By Allah, I will kill you or you will give me what I ask you.\" He said: \"Ask me.\" He said: \"You swear to me by Allah that you will turn Banu Jarwal away from me entirely. If they do not obey you, you will turn away from me with Banu Ashyam. If they do not obey you, you will come to us.\" He said: \"Yes.\" So he released him under the cover of night. He came to them while they were within sight of each other and said: \"Banu Jarwal, turn back. Do you not fear Allah, exposing yourselves against a people seeking their right?\" More than seventy men turned back with him. When Banu Sakhr and Banu Jandal saw that, they said: \"By Allah, we are wronging our kinsmen, we will not fight them.\" So the people deserted each other. When Al-Ashhab ibn Rumaylah saw that, he said: \"Woe to you! Will you shed your blood for a blow of a stick? By Allah, there is no harm in him [the injured man], so give your people their right.\" Abu Thawr said: \"Far be it! The lock has closed and the key is lost. They have taken a man from your gathering whom they are satisfied with—meaning Abu Asma', not knowing they had released him.\" They said: \"They have released him.\" Hajn and Rabab said: \"By Allah, we will leave, and we will join others besides you and will not give in with our hands.\" Al-Ashhab ibn Rumaylah kept saying: \"Woe to you, will you leave the abode of your people for a blow of a stick that amounted to nothing?\" He did not cease until they brought Rabab. They handed him to Qatan and took Abu Badhal from them. He [Abu Badhal] died that night while in their hands, but they hid it. They sent to Abbad ibn Mas'ud ibn Khalid ibn Malik ibn Rab'i, and to Awf and Ma'bad sons of Al-Qa'qa' ibn Ma'bad, offering the blood money. They said: \"What is the meaning of blood money when our companion is alive?\" They said: \"Your companion is not alive.\" Banu Qatan marched until morning came, traveled a little, then said to Rabab: \"Make your will.\" He said: \"By Allah, I had a need from my Lord, but what prevented me from praying more than I prayed was only the fear that they would see that my excess [in prayer] was fear of death. Let a man from you with a strong arm strike me.\" So they pushed him to a man with a strong arm, they pushed him to Hazimah ibn Bashir Abu Badhal, and he struck his neck. Then they buried him among them. That was during the Fitna before the killing of Uthman. When the people settled under Mu'awiyah, a man said to Ibn Rumaylah: \"Your brother only killed their companion by mistake, and they killed your brother intentionally. So seek legal redress against them.\" So he sought redress against them later before Marwan ibn al-Hakam, and Nashbah ibn Malik ibn Qatad ibn Salma ibn Jandal, and Saqr ibn Malik, brother of Nashbah. Marwan gathered them in Medina. Banu Qatan said: \"We killed their companion and there was no authority to seek redress from.\" So Ibn Rumaylah was given fifty camels to follow [as blood money]. Al-Ashhab ibn Rumaylah said:\n*The driving of the white camels did not cease until I drove them ... fifty followed by Abu Badhal.*\nAl-Farazdaq said replying to him:\n*Be gentle with your people, O liberator of Khalid ... and remember the leading of your brother on the first day.*\n*The mongrel was fierce against the clients of his mother ... so they castrated him from the back of the neck with the blade.*\n*Marwan knows, when he enacts your blood monies ... at fifty, that your blood monies were not complete.*\nAl-Farazdaq also said:\n*Rabab called the call of the pregnant woman when he saw ... Banu Qatan shaking the spears so he trembled.*\nAl-Ashhab ibn Rumaylah replied to him:\n*O my two eyes, pour tears; who is for your brother ... that you stay awake the full night and panic?*\n*And a weeping woman weeping for Rabab, and a sayer ... May Allah reward with good the most chaste and protective.*\n*Striking in the distress when the battle heats up ... and feeding when the nursing mothers become hungry.*\n*When we intercepted their brother for our brother ... we quenched [our thirst] and did not heal the burning thirst so we would be satisfied.*\n*We combined blood while the guest was awaiting hospitality ... and the call of a caller who called us so he made us hear.*\n*We extended—and it was a slip of our dreams—... a hand to the children of Damrah, severed.*\n*And my people blamed me, and my soul blames me ... for what a viewer said regarding Rabab: He was lost.*\n*If my heart were of iron it would have weakened ... and if it were of solid rock it would have cracked.*\n*We killed the master of the people, no honor was before him ... and there was no prevention by Al-Ahjar so he would be protected.*\n*Did the son of a blacksmith gloat that a calamity befell ... a noble one, while Time did not leave a place of hearing for you?*\n*For the killing of a man who heated his weapon against you ... while you were humiliated, growing [grazing] in the saltwort, all of you.*\nAnd he said:\n*I see the eye, from the memory of Rabab, as if ... it has ophthalmia, its mote does not accept Kohl.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 48
  },
  {
    "serial_number": "6834896",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "*May Allah reward my people for an intercessor and seeker ... with the reward of an evildoer when his secrets are tested.*\n*They gouged my eye; neither was the 'Uriyy (lion/leader) commanding ... good, nor the sinner forgiving when he was [able].*\n*If the clan of Mirdas ibn Hayyan had acted ... the bone would have healed and its splints closed over it.*\n*So I was not, in what befell me, the first man ... who committed an event or whom his clans surrendered.*\n*He called, when a people called against his brother ... Tumadir, when Tumadir surrendered him.*\n*Verily, long have I hoped in you and praised you ... So this is the time of insults, its bird is most ill-omened.*\n*My Lord did not make me wretched, nor did my brother disgrace me ... when a star from Tihama set, its setter.*\n*You extended [your hand] and left no advance for yourself ... except a loan of misery, that the holder of the loan remembers.*\nAl-Ashhab also said regarding that:\n*You stayed awake and worries did not sleep from you ... and the old yearning returned to your heart.*\n*You struggle with the middle of a dark [night] possessing shadows ... as the sick man struggles with the night.*\n*As if its stars are herds of cattle ... appearing in the sky and not moving.*\n*So did the day cease so it became night ... and did the stars leave their rising places?*\n*And how many a brave hero I missed ... and a gambler in winter, generous, digestible.*\n*And refusing [injustice], when he is offered humiliation ... fierce when adversaries oppose.*\n*They passed to their way and I sat alone ... fate turning away with me and going straight.*\n*As if the accidents of days come ... upon a smooth rock having no scratch.*\n*So convey to Banu Salma a message ... for we did not have a blameworthy one from them.*\n*They got angry for us and felt compassion for us ... as the loving mother [camel] feels compassion for the stuffed skin (baww).*\n*If Nahshal held back, then we ... we have the noble deeds and the root.*\n*Let a knower know what was in us ... we have the misery and the noble removal [of clothes/spoils].*\n*Is what Banu Subayh say true? ... So Quda'ah or Tamim may know it.*\n*Do not their dreams forbid them from wronging us? ... And they have no dreams [minds].*\n*I swore by the immigrants of Al-Ghusl, disheveled ... and what the holy sites and Al-Hatim gathered.*\n*If calamities gathered between my people ... and the injustice of the root, its pasture is unhealthy.*\n*We will surely seek for ourselves women ... who become clear in marriages or become widowed.*\n*And dead bodies, the heroes were aborted from them ... thirsty, on their faces is gloom.*\nS said: We have prolonged speech in this story, and that is only so the burning thirst of the beneficiary may be healed, so no heat remains in his heart.\n\nIbn al-Sirafi said: Umayyah ibn Abi al-Salt said:\n*Perhaps what souls hate of the matter ... has an opening like the undoing of the shackle.*\nHe said: The pronoun in his saying \"lahu furjatun\" (it has an opening) refers to \"ma\" (what). Meaning: For this hated thing there is an opening, i.e., relief. The meaning is clear.\n\nS said: This is a proverbial verse he struck for verses preceding it; the knowledge of its meaning is not complete without them. They are:\n*With Ibrahim who fulfilled the vow ... and Isaac, carrier of the wood.*\n*His son would not have been patient regarding him ... if he saw him in a group of enemies.*\n*He said: O my son, I have vowed you to Allah ... slaughtered, so be patient, may my maternal uncle be your ransom.*\n*So the boy answered having said regarding it ... Everything is for Allah without plagiarism.*\n*O father, I have rewarded you by Allah ... being pious to Him in every state.*\n*So fulfill what you vowed to Allah and hold back ... from my blood that my trousers touch it.*\n*And tighten the bonds lest I swerve from the knife ... the swerving of the captive in chains.*\n*Indeed I feel pain at the incision, and I ... do not touch the chins possessing beards.*\n*And he has a knife imagining in the meat ... cutting, clear like the crescent moon.*\n*While he was taking off the shirts from him ... his Lord ransomed him with a great ram.*\n*He said: Take it and send your son, indeed I am ... not hating of what you two did.*\n*A father fearing [Allah] and another born ... so they flew from Him with a high reputation.*\n*Perhaps what souls hate of the matter ... has an opening like the undoing of the shackle.*\n\nIbn al-Sirafi said: Al-Aswad ibn Ya'fur said:\n*Is it true, O sons of the sons of Salma ibn Jandal ... is your threatening of me in the middle of the assemblies?*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 49
  },
  {
    "serial_number": "6834897",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "He said: He meant \"O sons of the sons of Salma ibn Jandal.\" The meaning is clear. They were threatening him because of a horse his son, Al-Jarrah ibn al-Aswad, took belonging to a man from Taym Allah ibn Tha'labah, called the Knight of Al-Asma'. His story with them is long.\n\nS said: This is the place of the proverb:\n*Little sufficiency from dependents and children ... going early to the Dini [land/task] then returning.*\nWhat Ibn al-Sirafi mentioned and the news related to it does not avail a wick's worth nor benefit. His saying: \"The meaning is clear\" might deceive the beneficiary, so he restricts himself to his raving, and does not pursue investigating its meaning and knowing the truth of its story. I will mention what clarifies the meaning, Allah willing.\nThe story of this poetry was: When Abu Ju'al, the brother of Banu Amr ibn Hanzalah al-Burjumi, and his companions were defeated, and Bakr ibn Wa'il captured them, a man from Banu Taym Allah ibn Tha'labah from Banu al-Jadh'ah—who was the Knight of Al-Asma'—caught up with people from Banu Nahshal, among them Al-Jarrah ibn al-Aswad, Harir ibn Shammar ibn Hadhan ibn Zuhayr ibn Jandal, Rafi' ibn Suhayb ibn Harithah ibn Jandal, Amr ibn Hudayr, and Al-Harith ibn Harir ibn Salma ibn Jandal. He said to them: \"Come to me, you are free. Your fighting today pleased me, and I am better for you than thirst.\" So they answered him. He dismounted to bind them, and Al-Jarrah noticed quality in his horse, so he jumped on its back and escaped on it. The Taymi said to Rafi' and Harir and their companions: \"Do you know this man?\" They said: \"Yes, and we are guards (guarantors) for your horse.\" When Al-Jarrah came to his father with it, he ordered him to take it to Banu Sa'd, so he hid it in three bellies [clans/valleys]. When Rafi' and Harir and their companions returned to Banu Nahshal, they said: \"We are the guards of the Knight of Al-Asma',\" and they threatened Al-Jarrah. Banu Jarwal were allies of Banu Salma ibn Jandal against Banu Harithah ibn Jandal. Tayhan ibn Balj returned Rafi' and Harir against Al-Jarrah, until they returned the horse to the Taymi. So Al-Aswad ibn Ya'fur said regarding that:\n*There came to me, and I did not fear what they sent ... as a guard, Banu Salma, Harir and Rafi'.*\n*They both deprived me every day of a booty ... so I destroyed them, if that were useful.*\n*So I followed their rear on the road of Alah ... as it is said a star has fallen, falling successively.*\n*And the best of what I give you, and it is its evil ... is a terrifying thing in which are shining swords.*\n*I am not giving you an injustice against me ... nor am I withholding a right known to belong to you.*\n*If he is guided to me, then I am ... a brother of war, neither a decree-man nor panicking.*\n*And I am sharp when my sharpness is sought ... and difficult of leadership, the Qanadi' (calamities) did not please me.*\n*And I host the guest as my father advised ... and the neighbor of Abu Tayhan is hungry, starving.*\n*So say to Tayhan ibn 'Aqirat Istiha (Son of the one whose rear is wounded) ... Are you persisting, so meeting error, or are you desisting?*\n*But Tayhan ibn 'Aqirat Istiha ... has a sin in his affair and consequences.*\n*If Tayhan ibn 'Aqirat Istiha wished ... I would have guided him, and for matters there are rising places.*\n*And I guard the secret until I return it ... to its people, and evil is ugly, spreading.*\n*If you gave Ibn Aswad his right ... a mutilator stood with a razor over your nose.*\n*Omani, or possessing two teats, Arabic ... trained, the locations have sharpened her.*\nThey swore they were the guards of the Taymi, so Al-Aswad gave them the horse itself, and kept her foal. The guards returned to him and threatened him, so he began to say:\n*It came to me from the Abna' that Mujashi' ... and the family of Fuqaym and the Karadis agreed.*\n*And the clan of Jurays; I said: Jurays suffices you ... a spearhead like the lamp of the night-worshipper, opened.*\nMu'awiyah and Qays, the two sons of Malik ibn Zayd Manat ibn Tamim, are called the two Kardus, so he said Al-Karadis. Jurays is a man from Al-Barajim.\n*Al-Asa (the mare) raised him until he rose as if he was ... a meteor in the hands of a horseman burning.*\n*In the hands of a boy whose maternal uncle is not a sitter ... Noble, his father is Jandal or Mutlaq.*\nAnd he also said:\n*Is it true, O sons of the sons of Salma ibn Jandal ... is your threatening of me in the middle of the assemblies?*\n*Why did you not make a pride of your threat ... against the clan of Qa'qa' and the clan of Ibn Habis?*\n*For they prevented you from the inheritance of your father ... so the inheritance went to the clever nobles.*\n*And they brought you to the bank of the sea, overflowing ... and they left you between shamed and bowing.*\n\nIbn al-Sirafi said: Hadrami ibn Amir ibn Mujamma' said:\n*And every companion paired with another ... even if she was stingy with him, they will separate.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 50
  },
  {
    "serial_number": "6834898",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "*And every brother, his brother is parting from him ... by your father's life, except the two Farqad stars.*\nHe said: He means that every two where one loves the other will be cut off from him, even if he is stingy with him, strictly holding to his brotherhood. In speech resembling this.\n\nS said: What Ibn al-Sirafi mentioned in these two verses hardly heals, unless what is before them is known, for they are a proverb he struck for consolation regarding those of his brothers and clans he was bereaved of. Before them is:\n*And a possessor of grief, the soul turned away from him ... beware of the gloaters, and he has grieved me.*\n*A brother of trust, when the night becomes dark ... to the twisting of my rope, he sufficed me.*\n*I cut my bond from him so his richness sufficed ... so I will not see him and he will not see me.*\n*And every companion paired with another ... even if she was stingy with him, they will separate.*\n*And every brother, his brother is parting from him ... by your father's life, except the two Farqad stars.*\n\nIbn al-Sirafi said: Al-Akhtal said:\n*Did your eye lie to you, or did you see at Wasit ... in the darkness of the gloom, from Al-Rabab, a silhouette?*\nIbn al-Sirafi said: Wasit is a place in the regions of Syria (Sham).\n\nS said: Ibn al-Sirafi erred in this. There is no place called Wasit in the regions of Syria. Wasit here is: Wasit of Al-Jazirah. Abu al-Nada informed me saying: The Arabs have seven Wasits: Wasit of Najd, which Khadash ibn Zuhayr mentioned:\n*Wasit's pastures and waters have become effaced ... to where its flood ends and its returning flows.*\nAnd Wasit of Hijaz, which Kuthayyir mentioned:\n*They strove; as for the family of Azzah in the morning ... they departed, but Wasit is remaining.*\nAnd Wasit of Al-Jazirah, which Al-Akhtal mentioned in the verse that passed just now, and in his other verse:\n*Wasit of the family of Radwa is effaced, then Nabtal ... then the meeting place of Al-Hurrayn, so patience is more beautiful.*\nAnd Wasit of Yamama, which Al-A'sha mentioned in a poem. And Wasit of Iraq. And I have forgotten two.\n\nIbn al-Sirafi said: Farwa ibn Musayk said:\n*If we are defeated, we have been defeaters of old ... and if we are conquered, we are not ones to be conquered always.*\n*And cowardice is not our nature, but ... it is our deaths and the turn of others.*\nHe said: His saying \"If we are defeated, we have been defeaters of old\" says: If we are defeated in this battle, we have defeated people before it many times. With speech resembling this which does not indicate the meaning of the verse.\n\nS said: This is the place of the proverb:\n*Far it is! That you see the settled land ... the decreed fate came before it.*\nIt is far for the beneficiary to know the meaning of his saying \"If we are defeated\" and why he admitted defeat despite the shame in it—if the story is not known. I had mentioned to you that if poetry is related to a story, the people of meanings cannot extract its meaning except by it.\nThe story of this poetry was: The idol of Murad was in A'la and An'am, which are two clans of Murad. Nobles of Murad said: \"Why are our gods not in our noses (chiefs)?\" So they wanted to snatch the gods from them. They went out from them and came to Banu al-Harith and sought protection with them. Murad sent to Banu al-Harith: \"Expel our brothers from your abode, and send us two men from you so we may kill them for our companion\"—for Murad was seeking a blood revenge from Banu al-Harith. When Al-Husayn ibn Yazid ibn Qanan saw that Murad insisted on demanding their companions, he feared them and knew he had no power against them. Murad, if a man of theirs was killed, would kill two men for him, and they would not accept blood money except doubled.\nSo Al-Husayn ibn Yazid, who was the leader of Banu al-Harith, marched to Umayr Dhu Marran. He asked him to ride with him to Arhab to make peace between him and them, and ask them for an alliance against Murad. Al-Husayn said: \"O assembly of Arhab, I am not happier about the destruction of Murad than you.\" Arhab used to raid Murad before that. So Arhab allied with him, and they set out.\nAl-Husayn ibn Yazid ibn al-Harith marched, and the Bedouins of Hamdan marched, led by Yazid ibn Thumamah al-Arhabi al-Asamm. And Murad approached as if they were a black lava field, crawling a crawl, led by Al-Harith ibn Zabyan al-Muthallam, whose kunya was Abu Qays al-An'ami. They fought at a place called Al-Razm next to Aya', a fierce battle. Banu al-Harith were shaken. Al-Husayn turned to them and said: \"O Banu al-Harith, by Allah, if you do not strike the faces of Murad with swords until they clear the courtyard for you, I will leave you to be spoil among the Arabs.\" Then he turned to the Bedouins of Hamdan and said: \"O assembly of Hamdan, patience, patience! Let not Murad say we sought refuge in the numbers of Hamdan and their might but they did not avail us.\"",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 51
  },
  {
    "serial_number": "6834899",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "The people fought a fierce battle. Al-Husayn was killed. Both sides were patient. Banu al-Harith prepared to flee, and Arhab was shaken—they had brought the women with them and placed them behind their backs. When Arhab saw the women's anklets showing for flight, they returned to fight and said: \"We will not flee until Yaghuth flees.\" They were patient against the people, and Banu al-Harith were patient against them. Murad was defeated, and killing spread among them. They captured women from their women, so Islam arrived while they were in the houses of Hamdan. On that day Al-Muthallam, the leader of Murad, was killed, and Aziz, Qays, and Nimran. It was named the Muradi [Day]. Al-Husayn ibn Yazid al-Harithi was killed on that day. Yazid ibn Thumamah al-Arhabi said regarding that:\n*The tribe attacked in the morning knew that I ... at the side of Aya' was not a recoiling coward.*\n*I left Aziz with birds hopping around him ... and I covered Qays with the edge of a sharp white [sword].*\n*And Nimran, I settled a grudge from him ... upon rage on the day of the intertwining of tribes.*\n*Ukkab, I healed the soul from him, and Harith ... with a penetrating [spear] in his chest possessing barbs.*\n*And I destroyed Sumayy in the attack with our spears ... and he encountered a quick death, not delayed.*\nS said: If the meaning of the story is not known, the meaning of the verse is not known:\n*If we are defeated, we have been defeaters of old ... and if we are conquered, we are not ones to be conquered always.*\n\nIbn al-Sirafi said: Al-Nabigha al-Ja'di said:\n*Except like Mu'arrid, the one stripping his two Bakrs ... he insults me wrongfully.*\nHe said: It means, but Mu'arrid circulates among the tribes insulting me. Mu'arrid is not Suwar, nor is he the exception; so it is an exception meaning 'but'. His saying \"the one stripping his two Bakrs\": dual of Bakr, and the Bakr among camels is like the youth among people.\n\nS said: This is the place of the proverb:\n*He strikes him sometimes, and sometimes throws him down ... as if he honors him or binds him.*\nIbn al-Sirafi spoke on this verse in a way that suggests he hit the mark in it, and brought the intent of the beneficiary. But his arrow missed, for he did not mention Mu'arrid from which tribe he is, leaving him unknown. And he mentioned that the two Bakrs here are the dual of Bakr, and that it is the youth of camels. Mu'arrid here is a man from Banu al-Harish; he ordered two men from Banu al-Harish to insult Al-Nabigha, and they were his two Bakrs. This is the meaning of his saying: \"Except like Mu'arrid, the one stripping his two Bakrs.\"\n\nIbn al-Sirafi said: Al-A'sha said:\n*And the people of Jaww, it came upon them ... so it corrupted their life so they perished (baru).*\n*And a time passed over Wabar ... so Wabar perished (hamadat) openly.*\nHe said: Wabar, they claimed, was a city the Jinn inhabited. And it is said: Wabar is a place in Al-Dahna. Some claimed it is a land where there were wild camels and many palm trees with no one to remove their stumps or harvest their fruit; and that a man fell into it, rode a stallion from those camels, and went towards the land of his people, and the camels followed him.\n\nS said: This is the place of the proverb:\n*You have brought, O Bahshar, the calamity ... where the sand-heaps of the well are full.*\nIbn al-Sirafi spoke on this verse and increased, so he became confused in it and confused [others], then brought a hadith of two slave girls with lies and falsehood. The correct view is that Wabar is on the side of Al-Shihr, the end of the sands of Banu Sa'd ibn Zayd Manat ibn Tamim. That is because Wabar ibn Amim ibn Lawidh ibn Sam ibn Nuh settled it, so it was named after him.\n\nIbn al-Sirafi said: Mu'awiyah ibn Malik ibn Ja'far said:\n*I repaired the rift of Ka'b, and they were ... from hatred, they had become ankles (Ka'ab).*\n\nS said: Ibn al-Sirafi struck two verses into a verse, making them one verse. The correct version is:\n*I repaired the rift of Ka'b which had perished ... and the rift was not counted as repairable.*\n*So their heel (Ka'b) became a heel (high), and they were ... from hatred, called ankles (low).*\n\nIbn al-Sirafi said: Ru'ba said:\n*Indeed I feared that I would see drought.*\n*In this year of ours after it had been fertile.*\n*When the locusts (Daba) crawled over the high grounds.*\n*And the wind blew with it a blowing.*\n*Leaving what the locusts left a wasteland.*\n*And the straw and the Halfa grass, so it inflamed.*\n*Like the torrent when it flows wide.*\n\nS said: Ibn al-Sirafi imagined that all Rajaz poems belong to Ru'ba because Ru'ba was a Rajiz; this is a generalization in him. The verses are not by Ru'ba; rather, they are from the stray Rajaz whose author is unknown. The verses he brought are mostly defective. The correct version is:\n*Indeed I hope to see drought.*\n*In this year of yours after it had been fertile.*\n*When the locusts crawled over the high grounds.*\n*And the wind blew with dust that blew.*\n*Leaving what the locusts left a wasteland.*\n*And the straw and the Halfa grass, so it inflamed.*\n*Like the torrent when it flows wide.*\nAnd the completion of the verses, and the meaning of the verse is not complete without them, is:\n*When you see the old camel with much hair*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 52
  },
  {
    "serial_number": "6834900",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "*And the sixth [year camel], the lusty, the loving.*\n*From lack of pasture, it has fallen down.*\n\nIbn al-Sirafi said: Khadash ibn Zuhayr said:\n*No bowls and no horsemen raiding ... except your burping at the ovens.*\n*You are unknown, unlawful is your dweller ... and in wars you are slingshots, blind.*\nHe said: Khadash satirized with this poetry a group from Banu Sahm, because of a race that was between him and them.\n\nS said: This is the place of the proverb:\n*The tribe at Al-Khabur is not defended when they are frightened ... except by horsemen like Ibn Humran.*\nI had mentioned to you in several places: that whoever is not precise about the genealogies of the Arabs and their days (history), and flows into explaining such poetry—targets himself for the tongue of the critic. Ibn al-Sirafi erred here from several aspects: One is that he mentioned Khadash addressed this poetry to a group from Banu Sahm, whereas he addressed it to a group from Banu Taym al-Adram. Another is that he mentioned the race was between Khadash and them, whereas the race was between Banu al-Irqah from Taym al-Adram and Kuraz ibn Rabi'ah ibn Amr ibn Amir, who is from Khadash's clan. Furthermore, he did not know the story so the meaning would become clear and the beneficiary healed.\nThe story of this poetry was: The first thing that stirred between Quraysh and Banu Amir ibn Sa'sa'ah was that Kuraz ibn Rabi'ah ibn Amr ibn Amir ibn Rabi'ah ibn Amir ibn Sa'sa'ah bet Usayd, Amr, and Abdullah sons of Al-Irqah, from Banu Taym ibn Ghalib—who is Taym al-Adram—on a horse of theirs called Al-Barq. The stake (Al-Siq) was thirty like it with it, none of them possessing shoes, nor *Hira'* (?), nor refusing, nor club-footed, nor having a defect. They made the limit and the track up to Kuraz. He made the limit between Al-Sajsaj to Dhat al-Falj from the middle of Kusht, and made the end of the track the whiteness of Rukbah. His people blamed him, so he said: \"By Allah, I do not fear anything for you from him: He was never suckled by a pregnant camel, nor climbed in any guarded place ever, and he enters the morning with his full hair. However, he had a bruise he got when he was a foal, then it did not cease to be in oil (treatment), and today he is a four-year-old. If it opens up before he runs a mile, he will come first, and if it stays as it is, then I do not know.\"\nSo they sent the two horses. Al-Mujalid ibn Zuhayr ibn Rabi'ah ibn Amr ibn Amir mounted Kuraz's horse. He did not run a mile until the bruise opened up, so he came first. Al-Barq died at Rukbah. So he took the stake (Al-Siq). They pleaded to him by the womb of Majd bint Taym ibn Ghalib, who is the mother of Banu Rabi'ah ibn Amir ibn Sa'sa'ah, but he refused to return the Siq. They stayed for nearly two years. Then Banu al-Irqah rode out and met Usayd ibn Malik, Amr ibn Malik, and Uthman ibn Usayd from Banu Amir ibn Rabi'ah at the bottom of Al-Aqiq with camels of theirs, among which was a young she-camel, boiling (fast), called Al-Inab, ten months pregnant. They drove the camels. Uthman ibn Usayd met it, scaring it with his garment, and sent the slave girl towards his father and uncle seeking help. His father rode an old mare, and his uncle rode its daughter, a difficult mare. When he caught up with the people, Amr ibn Malik said: \"Inform us who you are?\" They said: \"Quraysh.\" They said: \"Which of them?\" They said: \"Banu al-Irqah.\" They said: \"Was there any event?\" They said: \"No, except the Day of Al-Barq.\" He said to them: \"Hold Al-Inab, hold the milch-camel, the milch-camel of one who does not betray.\" Amr said to them: \"No, by Allah, you will not suckle from it a front teat nor a back one.\" He said: \"We do not suckle camels, but we milk them.\" He charged at him and killed him. Usayd ibn Malik charged at Usayd ibn al-Irqah and killed him. He said regarding that:\n*Indeed, like that I strike the armed man ... and the namesake will not be miserable by me.*\nThat was the Day of Al-Inab. Khadash ibn Zuhayr said regarding that:\n*We turn the armed men onto their chins ... when it is a day with a long tail.*\n*Such is Time and its changing ... and those are the horsemen of the Day of Al-Inab.*\nThen raiding and fighting occurred between them after that. So Khadash ibn Zuhayr said regarding that:\n*Convey to Abu Kanaf if you pass by him ... and Al-Abjaran and Wahb and Ibn Manzur.*\n*No bowls and no horsemen raiding ... except your burping at the ovens.*\n*Then attend to us when our eyes turn red ... in every day that removes the skulls, famous.*\n*You will meet horsemen, neither inclining nor unarmed ... nor bulky ones, defecating in the houses.*\n*You will meet Usayd and Amr and their cousin ... Warqa' in the disheveled raiding group.*\n*From the family of Kuraz, the morning of fright, they were known ... at the fighting, [belonging] to a corner and a joy.*\n*They drive their peers in every battlefield ... stabbing and striking like splitting with saws.*\n*So ask horsemen of yours on the day of Dhu Saraf ... about you, and your horsemen on the day of Al-Ya'amir.*",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 53
  },
  {
    "serial_number": "6834901",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "*There runs with us every [horse] wrapped in its lower parts ... and every disheveled [mare], running fast in the soft ground.*\n*Nay, by the Lord of the young camels dancing with us ... the evening of the departure, like boats.*\n*You shall not be left while we have not tested your bravery ... and we have not raided you the strike of the raiders.*\n*Until we make you taste a strike with a pure ... Indian [sword] and fighting that is not false.*\n*The insulters, while without me are the peaks of Hadan ... and the deed is snatching and the saying is transmitted.*\n*You are unknown, unlawful is your dweller ... and in wars you are slingshots, blind.*\n*You do not cease being at the doors of meanness ... helping each other in it as long as the gazelle wags its tail.*\n*As if you are Nabatean women at a farm ... peeling noses, toothless, thick-clothed.*\n*You see their chests brown, narrowed ... and in their lower parts spreading and tucking up.*\n*When they are scattered at the heights, throwing them down are ... blue spearheads and white cutting swords.*\n*Their last call their first in panic ... and the horses are reluctant and death is cautioned.*\n*And the excluded ones when hardship circles us ... and the honored ones when ease circles.*\n*And the ones carrying them in every battlefield ... in which are captivity and killing and dusting [in dirt].*\n\nIbn al-Sirafi said: Ziyad ibn Wasil said:\n*So when our voices became clear ... they wept and ransomed us with fathers.*\nHe said: He means that when they recognized their voices, they wept to them so they might rescue them, and they ransomed them with their fathers.\n\nS said: This is the place of the proverb:\n*O blower of the evil of hadith, the lie ... Suffices you of making [camels] kneel, the bending of the knees.*\nIbn al-Sirafi lied in explaining this verse and did not know little or much of it. How could they ride to them to rescue them when they were captives as he claimed? The meaning of the verse is: Ziyad boasted in these verses of the fathers of his people and their mothers from Banu Amir, and that they had tested well in their wars and their assistance. When they returned to their encampments and were with their women, and they [the women] recognized their voices, they ransomed them [said: May my father be your ransom], because they had tested well in the wars. The verses indicate the correctness of this meaning. The first of them—and they are by Ziyad ibn Wasil al-Sulami—is:\n*The women of Banu Amir strengthened us ... so we branded the men with a humiliating disgrace.*\n*And we are their sons on the day of the slapping ... when we face the people, rough and rugged.*\n*With a striking like the lapping of male wolves ... you hear for the skulls in it a ringing.*\n*And shooting upon every buzzing [bow] ... it returns the left and gives the right.*\n*And we were with the horses until they matured ... the youth of men, and delighted the eyes.*\n*And when our voices became clear ... they loved [us] and ransomed us with fathers.*\n\nThis is the end of *The Delight of the Man of Letters*. I have deposited in it the mention of what Ibn al-Sirafi stumbled in regarding his explanation of the verses of Sibawayh's Book. I clarified it and corrected it, and guided the beneficiary to its correctness and directed him. Even if its size is small, its knowledge is abundant. Whoever wakes up and looks with the eye of fairness will acknowledge the superiority of many of the successors over the predecessors. But most people stumble in the tails of confusion and falling, and lack of acquisition and clarity, and abundance of mixing and raving. As for the people of verification:\n*We used to count them as few ... and they have become fewer than few.*\nI will follow it, from the best of what I create, with what increases benefit, and the hearing shakes for its narration, in fulfillment of the conditions of service, and performance of the right of the favor. And Allah is the Helper upon what is in the intention and ambition; He is Vast in Mercy.\n*May Allah keep for us our master, and may ... our days never cease to be new in his shadow.*\n*Indeed the Chief, for the favors he bestows ... makes lawful the hunting of knowledge in my sanctuary.*\n*Nothing is more beautiful than a favor of his that abounded ... my thanks for it is the thanks of the meadow of Al-Hazn for the drizzle.*\n\nEnd of the original manuscript, which I symbolized with 'A'.\nThe book is completed, and praise be to Allah as He deserves, and blessings upon His Prophet Muhammad and his family. That was on Sunday, the twenty-ninth of Sha'ban, the year five hundred and ninety-two. And praise be to Allah alone, and His blessings upon our master Muhammad His Prophet and his pure family and His peace. And Allah is sufficient for us, and the best Disposer of affairs. The collation was completed with the praise of Allah and His help.\n\nAnd the end of the Baghdadi manuscript, which I symbolized with 'B'.",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 54
  },
  {
    "serial_number": "6834902",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Delight of the Man of Letters in Refuting Ibn al-Sirafi's Explanation of the Verses of Sibawayh (The author critiques Ibn al-Sirafi (d. 368 AH) in his explanation of some verses of Sibawayh's Book (d. 180 AH))",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "This book was completed with the help of Allah Almighty, at the hand of the one in need of the mercy of his Forgiving Lord: Abd al-Qadir ibn Umar ibn Bayazid ibn al-Hajj Ahmad al-Baghdadi. He wrote it for himself, and for whom Allah wills after him. The writing began on Sunday, and ended in the forenoon of Monday, the twenty-ninth of the blessed month of Shawwal, of the months of the year one thousand and seventy-eight of the Hijra. The date of the original from which I wrote it was Sunday, the twenty-ninth of Sha'ban, the year five hundred and ninety-two. Thus I saw it dated. And Allah is sufficient for us, and the best Disposer of affairs.\nIn the margin: So the duration of writing was nine days, with occupations hindering it. And praise be to Allah for it.",
    "foot_note": "None",
    "book_id": "640",
    "new_page_number": 55
  }
]