[
  {
    "text": "Fitnat al-Takfir (The Tribulation of Excommunication)\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 1
  },
  {
    "text": "sn: 377\nbook_title: فتنة التكفير\nbook_link: https://shamela.ws/book/707\nbook_id: 707\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: Null\nedition: Null\npages: 17\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: العقيدة\ncategory_id: 1",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 2
  },
  {
    "serial_number": "102213",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Creed (Aqidah)\nBook: Fitnat al-Takfir (The Tribulation of Excommunication)\nAuthor: Muhammad Nasir al-Din al-Albani (Died 1420 AH)\n\nBook: Fitnat al-Takfir\nAuthor: Muhammad Nasir al-Din al-Albani (Died 1420 AH)\n\nAuthor: Muhammad Nasir al-Din al-Albani (Died 1420 AH)\n\n\n[Book numbering corresponds to the printed version]",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 3
  },
  {
    "serial_number": "102214",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Fitnat al-Takfir (The Tribulation of Excommunication)\nBy the Scholar of Hadith: Muhammad Nasir al-Din al-Albani, may Allah have mercy on him.\n\nReview and Praise by His Eminence, the Scholar: Abd al-Aziz bin Baz, may Allah have mercy on him.\n\nCommentary by the Scholar: Muhammad bin Salih al-Uthaymeen - may Allah have mercy on him.",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 4
  },
  {
    "serial_number": "102215",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "The Speech of the Scholar Al-Albani, may Allah have mercy on him, regarding the Issue of Takfir (Excommunication):\n\nIndeed, all praise is due to Allah; we praise Him, seek His help, and ask for His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whomever Allah guides, no one can misguide, and whomever He misguides, no one can guide. I bear witness that there is no deity but Allah alone, having no partner, and I bear witness that Muhammad is His servant and His Messenger.\n\nAs for what follows:\nThe issue of Takfir in general—not only of rulers but also of the ruled—is a great and ancient tribulation adopted by one of the old Islamic sects known as the Khawarij. With great regret, some preachers or enthusiasts may fall into exiting the path of the Book and the Sunnah, but in the name of the Book and the Sunnah. The reason for this goes back to two matters:\n\nOne is: Shallowness of knowledge.\nThe other matter—and it is very important—is: They have not gained understanding of the Sharia rules which are the foundation of the correct Islamic call. Anyone who deviates from these rules is considered among those sects that deviated from the Jama'ah (Group) which the Messenger of Allah (peace and blessings be upon him) praised in more than one hadith. Indeed, our Lord, the Mighty and Majestic, mentioned it and clarified that whoever deviates from it has opposed Allah and His Messenger, in His saying: {And whoever opposes the Messenger after guidance has become clear to him and follows other than the way of the believers - We will give him what he has taken and drive him into Hell, and evil it is as a destination.} (An-Nisa: 115).\n\nFor a reason clear to the people of knowledge, Allah did not limit His saying to: {And whoever opposes the Messenger after guidance has become clear to him... We will give him what he has taken...}, but He added to the opposition of the Messenger the following of other than the way of the believers, saying: {and follows other than the way of the believers - We will give him what he has taken and drive him into Hell, and evil it is as a destination.} (An-Nisa: 115).\n\nThus, following the way of the believers or not following their way is a very important matter, both positively and negatively. Whoever follows the way of the believers is the saved one with the Lord of the Worlds, and whoever contradicts the way of the believers, Hell is sufficient for him, and evil is the destination. From here, very many groups went astray—in the past and present—because they were not satisfied with merely not adhering to the way of the believers, but they rode their own intellects and followed their desires in interpreting the Book and the Sunnah. Then, they built upon that very dangerous conclusions by which they exited from what our righteous predecessors (Salaf), may Allah be pleased with them all, were upon.\n\nThis clause from the noble verse: {and follows other than the way of the believers} was emphasized by him (peace and blessings be upon him) with great emphasis in more than one authentic Prophetic hadith. These hadiths—some of which I will cite—are not unknown to the general Muslims, let alone the elite among them. However, what is unknown about them is that they indicate the necessity of adhering to the way of the believers in understanding the Book and the Sunnah, and the obligation and confirmation of that.",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 5
  },
  {
    "serial_number": "102216",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "This point is overlooked—and its necessity and requirement are neglected—by many of the elite, let alone those known as 'Jama'at al-Takfir' (The Group of Excommunication) or some types of groups that attribute themselves to Jihad while they are, in reality, remnants of Takfir. These people—and those—may be righteous and sincere within themselves, but this alone is not enough for its owner to be among the saved and successful with Allah, the Mighty and Majestic. For a Muslim must combine two matters: Truthfulness of sincerity in intention to Allah, the Mighty and Majestic, and good following of what the Prophet (peace and blessings be upon him) was upon.\n\nTherefore, it is not enough for a Muslim to be sincere and serious in what he is engaged in regarding acting upon the Book and the Sunnah and calling to them. Rather, in addition to that, his methodology must be a sound, safe, correct, and straight methodology. This is not accomplished properly except by following what the righteous predecessors (Salaf) of the Ummah, may Allah be pleased with them all, were upon.\n\nAmong the well-known established hadiths that ground what I have mentioned—and I alluded to them earlier—is the hadith of the seventy-three sects, which is his (peace and blessings be upon him) saying: [The Jews split into seventy-one sects, and the Christians split into seventy-two sects, and my Ummah will split into seventy-three sects, all of them in the Fire except one.] They said: Who is it, O Messenger of Allah? He said: [The Jama'ah (The Group).] And in another narration: [That which I and my companions are upon.]\n\nThus, we find that the answer of the Prophet (peace and blessings be upon him) aligns perfectly with the previous verse: {and follows other than the way of the believers.} So, the first to enter into the generality of this verse are the Companions of the Messenger (peace and blessings be upon him).",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 6
  },
  {
    "serial_number": "102217",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "For the Messenger (peace and blessings be upon him) did not suffice in this hadith with saying: [That which I am upon...] — although that might be sufficient in reality for the Muslim who truly understands the Book and the Sunnah — but he (peace and blessings be upon him) practically applied the saying of Allah, the Glorified and Exalted, regarding him (peace and blessings be upon him) that he is: {to the believers is kind and merciful} (At-Tawbah: 128). From the perfection of his kindness and the completeness of his mercy towards his companions and followers is that he clarified to them, may peace and blessings be upon him, that the sign of the Saved Sect is: that its children and companions are upon what the Messenger (peace and blessings be upon him) was upon and what his companions were upon after him.\n\nAccordingly, it is not permissible for Muslims in general, and preachers in particular, to limit themselves in understanding the Book and the Sunnah to the known means of understanding, such as knowing the Arabic language, the abrogating and the abrogated, etc. Rather, before all of that, one must return to what the Companions of the Prophet (peace and blessings be upon him) were upon because they—as is evident from their traditions (Athar) and biography—were more sincere to Allah, the Mighty and Majestic, in worship, and more knowledgeable than us in the Book and the Sunnah, in addition to other praiseworthy traits they possessed and manners they adopted.\n\nResembling this hadith exactly—in terms of its fruit and benefit—is the hadith of the Rightly Guided Caliphs narrated in the Sunan from the hadith of Al-Irbad bin Sariyah (may Allah be pleased with him), who said: The Messenger of Allah (peace and blessings be upon him) gave us a sermon by which hearts were filled with fear and eyes shed tears. We said: It is as if it is a farewell sermon, so advise us, O Messenger of Allah. He said: [I advise you to fear Allah and to hear and obey, even if an Abyssinian slave is appointed over you. For whoever among you lives will see much difference. So upon you is my Sunnah and the Sunnah of the Rightly Guided Caliphs after me; bite onto it with your molar teeth...] and he mentioned the hadith.\n\nThe witness from this hadith is the meaning of his answer to the previous question, as he (peace and blessings be upon him) urged his Ummah, in the persons of his companions, to hold fast to his Sunnah, then he did not restrict it to that but said: [and the Sunnah of the Rightly Guided Caliphs after me].",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 7
  },
  {
    "serial_number": "102218",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "Therefore, we must—given the situation—always and forever focus on this authentic foundation if we want to understand our creed, our worship, our morals, and our behavior. There is no escape from returning to the methodology of our righteous predecessors (Salaf) to understand all these necessary issues for the Muslim so that he may truly realize in himself that he is from the Saved Sect.\nFrom here, ancient and modern groups went astray when they did not pay attention to the implication of the previous verse and the significance of the hadith of the Rightly Guided Caliphs, as well as the hadith of the splitting of the Ummah. It was a very natural matter for them to deviate, as those before them deviated, from the Book of Allah, the Sunnah of His Messenger (peace and blessings be upon him), and the methodology of the righteous predecessors.\nAmong these deviants are the Khawarij, ancient and modern. The root of the tribulation of Takfir in this era—indeed for eras—is a verse they always harp on, which is the saying of the Exalted: {And whoever does not judge by what Allah has revealed - then it is those who are the disbelievers.} (Al-Ma'idah: 44). They take it without deep understanding and cite it without precise knowledge.\nWe know that this noble verse was repeated, and its ending came with three wordings: {then it is those who are the disbelievers}, {then it is those who are the wrongdoers (Al-Zalimun)} [Al-Ma'idah: 45], {then it is those who are the defiantly disobedient (Al-Fasiqun)} [Al-Ma'idah: 47].\nIt is from the complete ignorance of those who argue using only the first wording of this verse: {then it is those who are the disbelievers}: that they have not gathered at least some of the Sharia texts—whether Quran or Sunnah—in which the word (Kufr - disbelief) is mentioned. They took it—without consideration—to mean exiting the religion, and that there is no difference between the one who fell into this Kufr and those polytheists from the Jews, Christians, and people of other religions outside the fold of Islam.\nHowever, the word 'Kufr' in the language of the Book and the Sunnah does not always mean what they harp on and project this erroneous understanding upon. The case of the word {the disbelievers}—in terms of not indicating a single meaning—is exactly the same as the case of the other two words: {the wrongdoers} and {the defiantly disobedient}. Just as one described as a wrongdoer or defiantly disobedient does not necessarily imply his apostasy from his religion, likewise is the one described as a disbeliever, exactly the same. This variety in the meaning of a single word is indicated by the language, and then the Sharia which came in the language of the Arabs—the language of the Noble Quran.\nFor this reason, it is obligatory upon anyone who undertakes issuing rulings on Muslims—whether rulers or ruled—to be of vast knowledge of the Book and the Sunnah, and in the light of the methodology of the righteous predecessors.",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 8
  },
  {
    "serial_number": "102219",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "The Book and the Sunnah cannot be understood—nor what is derived from them—except through precise knowledge of the Arabic language and its literature. If a student of knowledge has a deficiency in knowing the Arabic language, then what helps him rectify that deficiency is returning to the understanding of the Imams and scholars before him, especially the people of the three centuries testified to for goodness.\nLet us return to the verse: {And whoever does not judge by what Allah has revealed - then it is those who are the disbelievers.} What is meant by Kufr (disbelief) here? Is it exiting the religion (Millah)? Or is it other than that?\nI say: Precision is required in understanding this verse, for it may mean practical Kufr, which is deviating in actions from some of the rulings of Islam. Helping us in this understanding is the Scholar of the Ummah and the Interpreter of the Quran, Abdullah bin Abbas (may Allah be pleased with them both), whom all Muslims unanimously agree—except those from those deviant sects—is a unique Imam in Tafsir (interpretation). It is as if he heard back then exactly what we hear today, that there are people who understand this verse superficially without detail. So he (may Allah be pleased with him) said: \"It is not the Kufr that you go to [in your minds]; indeed, it is not a Kufr that transfers one out of the religion (Millah); it is Kufr duna Kufr (disbelief lesser than [major] disbelief).\" Perhaps he meant by that the Khawarij who revolted against the Commander of the Faithful Ali (may Allah be pleased with him), and the consequence of that was that they shed the blood of the believers and did to them what they did not do to the polytheists. He said: The matter is not as they said or thought, but rather it is Kufr duna Kufr.\nThis brief, clear answer from the Interpreter of the Quran in explaining this verse is the ruling that no other meaning can be understood from the texts I referred to earlier. Furthermore, the word (Kufr) is mentioned in many Quranic and Hadith texts, and it cannot be carried—in all of them—to equate to exiting the religion (Millah). For example, the well-known hadith in the Two Sahihs from Abdullah bin Masud (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings be upon him) said: [Abusing a Muslim is Fusuq (wickedness/disobedience) and fighting him is Kufr (disbelief).] So Kufr here is the sin which is exiting from obedience. However, the Messenger (peace and blessings be upon him)—who is the most eloquent of people—exaggerated in deterring by saying: [...and fighting him is Kufr].\nFrom another angle, can we interpret the first clause of this hadith—[Abusing a Muslim is Fusuq]—upon the meaning of Fusuq mentioned in the third wording within the previous verse: {And whoever does not judge by what Allah has revealed - then it is those who are the Fasiqun (defiantly disobedient)}?",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 9
  },
  {
    "serial_number": "102220",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "The answer: This may be Fusuq synonymous with Kufr which means exiting the religion (Millah), and it may be Fusuq synonymous with Kufr that does not mean exiting the religion, but rather means what the Interpreter of the Quran said: that it is Kufr duna Kufr (disbelief lesser than disbelief). This hadith confirms that Kufr can be of this meaning, because Allah, the Mighty and Majestic, said: {And if two factions among the believers fight, then make settlement between the two. But if one of them oppresses the other, then fight against the one that oppresses until it returns to the ordinance of Allah.} Here, our Lord, the Mighty and Majestic, mentioned the oppressive faction that fights the righteous believing faction, yet He did not judge the oppressive one with Kufr [exiting Islam], even though the hadith says: [...and fighting him is Kufr]. Therefore, fighting him is Kufr duna Kufr, exactly as Ibn Abbas said in the interpretation of the previous verse. Fighting a Muslim by a Muslim is oppression, aggression, Fusuq, and Kufr, but this means that Kufr can be practical Kufr (Amali) and can be doctrinal Kufr (I'tiqadi).\nFrom here came this precise detailing which was undertaken by the Imam—truly—Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, and after him, his dutiful student Ibn al-Qayyim al-Jawziyyah. They have the credit for alerting to and emphasizing the division of Kufr into that division which the Interpreter of the Quran raised the banner of with that comprehensive, concise statement. Ibn Taymiyyah, may Allah have mercy on him, and his student and companion Ibn al-Qayyim al-Jawziyyah, always emphasize the necessity of distinguishing between doctrinal Kufr and practical Kufr. Otherwise, the Muslim will fall, without realizing, into the tribulation of revolting against the community of Muslims, which the Khawarij fell into in the past and some of their followers in modern times.\nThe summary of the speech: His saying (peace and blessings be upon him) [...and fighting him is Kufr] does not mean—at all—exiting the religion. The hadiths regarding this are very many, and they are—all of them—irrefutable proof against those who stop at their deficient understanding of the previous verse and adhere to interpreting it as doctrinal Kufr. This hadith suffices us now because it is conclusive evidence that a Muslim fighting his Muslim brother is Kufr in the sense of practical Kufr, not doctrinal Kufr.\nIf we return to the (Jama'at al-Takfir)—or those branched from them—and their labeling of rulers—and by priority those who live under their banner and are organized under their command and employment—with Kufr and apostasy, this is built upon their corrupt viewpoint based on the idea that these people committed sins and thus became disbelievers.",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 10
  },
  {
    "serial_number": "102221",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "Among the matters worth mentioning and narrating: I met with some of those who were from (Jama'at al-Takfir) and then Allah, the Mighty and Majestic, guided them. I said to them: \"Here you are declaring some rulers to be disbelievers, so why do you declare the Imams of the mosques, the Khateebs of the mosques, the Mu'adhins of the mosques, and the servants of the mosques to be disbelievers? And why do you declare the teachers of Islamic knowledge in schools and elsewhere to be disbelievers?\" They said: \"Because these people were pleased with the rule of these rulers who judge by other than what Allah revealed.\"\nI say: If this pleasure is a heartfelt pleasure (Rida Qalbiy) with judgment by other than what Allah revealed, then practical Kufr turns into doctrinal Kufr. So any ruler who judges by other than what Allah revealed while seeing and believing that this is the appropriate judgment to adopt in this era and that it is not appropriate for him to adopt the legal Islamic judgment stated in the Book and the Sunnah, there is no doubt that the Kufr of this ruler is doctrinal Kufr and not just practical Kufr. And whoever is pleased with his satisfaction and belief: he joins him [in ruling].\nThen I said to them: \"So you—firstly—cannot judge every ruler who rules by Western disbelieving laws—or many of them—that if he were asked about judging by other than what Allah revealed? He would answer: That ruling by these laws is the truth and suitable in this era and that it is not permissible to rule by Islam. Because if they said that, they would become disbelievers—truly—without doubt or hesitation.\nIf we move to the ruled—and among them are scholars, righteous people, and others—how do you judge them with Kufr merely because they live under a rule that encompasses them just as it encompasses you exactly? But you declare that these are apostate disbelievers and ruling by what Allah revealed is obligatory, then you say, excusing yourselves: 'Violating the legal ruling by mere action does not necessitate judging this doer as an apostate from his religion.' This is exactly what others say, except that you add upon them—unjustly—the judgment of Takfir and apostasy.\"",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 11
  },
  {
    "serial_number": "102222",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "Among the issues that clarify their error and misguidance is saying to them: When is a Muslim who testifies that there is no god but Allah and that Muhammad is the Messenger of Allah—and may be praying—judged to have apostatized from his religion? Is once enough? Or must he announce that he is an apostate from the religion? They will not know an answer and will not find the right path.\nSo we are forced to give them the following example, saying: A judge who judges by Sharia, this is his habit and system, but in one case he slipped and judged contrary to Sharia, meaning: he gave the right to the oppressor and denied it to the oppressed. This—decisively—is ruling by other than what Allah revealed? Do you say that he: Disbelieved with the Kufr of apostasy?\nThey will say: No, because this occurred from him once.\nWe say: If the same judgment is issued a second time, or another judgment contrary to Sharia is issued, does he become a disbeliever? Then we repeat to them: Three times, four times, when do you say: He has disbelieved? They will not be able to set a limit by counting his judgments in which he opposed the Sharia and then declaring him a disbeliever based on it. While they can do exactly the opposite if it is known from him that in the first judgment he deemed ruling by other than what Allah revealed as good—making it lawful (Mustahillan)—and deemed the Sharia ruling as bad; then at that moment, the judgment of apostasy upon him is correct, even from the first time.\nConversely: If we saw from him dozens of judgments in various cases where he opposed the Sharia, and if we asked him: Why did you judge by other than what Allah the Mighty and Majestic revealed? He replied saying: I was afraid and feared for myself, or I was bribed, for example. This is much worse than the first case, yet we cannot say he is a disbeliever until he expresses what is in his heart that he does not see [the obligation of] judging by what Allah the Mighty and Majestic revealed. Only then can we say: He is a disbeliever with the Kufr of apostasy.\nThe summary of the speech: It must be known that Kufr—like Fisq (immorality) and Zulm (oppression)—is divided into two types: Kufr, Fisq, and Zulm that expel one from the religion (Millah), and all of that returns to Heartfelt Istihlal (deeming lawful in the heart).",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 12
  },
  {
    "serial_number": "102223",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "And the other type does not expel one from the religion, returning to Practical Istihlal (deeming lawful by action). All sins—especially what has spread in this time of practical acceptance of usury, adultery, drinking alcohol, and others—are practical Kufr. It is not permissible for us to declare the sinners who engage in some sins as disbelievers merely for committing them and practically deeming them lawful, unless it becomes apparent—with certainty—to us from them that reveals what is in the depths of their souls that they do not doctrinally forbid what Allah and His Messenger have forbidden. If we know that they have fallen into this heartfelt opposition, we then judge that they have disbelieved with the Kufr of apostasy.\nBut if we do not know that, there is no way for us to judge them as disbelievers because we fear falling under the threat of his saying (peace and blessings be upon him): [If a man says to his brother: O Disbeliever, then it has returned upon one of them.]\nThe hadiths mentioned with this meaning are very many. I mention one hadith with great significance, which is the story of that Companion who fought one of the polytheists. When this polytheist saw that he was under the strike of the Muslim Companion's sword, he said: 'I bear witness that there is no god but Allah.' The Companion did not pay attention to it and killed him. When the news reached the Prophet (peace and blessings be upon him), he denounced it severely. The Companion apologized saying that the polytheist only said it out of fear of being killed. His answer (peace and blessings be upon him) was: [Did you tear open his heart?] Narrated by Al-Bukhari and Muslim from the hadith of Usama bin Zaid (may Allah be pleased with him).\nTherefore, doctrinal Kufr does not have a fundamental connection with mere action; rather, its major connection is with the heart. We cannot know what is in the heart of the Fasiq (immoral), the Fajir (wicked), the thief, the adulterer, the usurer... and those like them unless he expresses what is in his heart with his tongue. As for his action, it informs that he has opposed the Sharia with a practical opposition.",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 13
  },
  {
    "serial_number": "102224",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "So we say: You have opposed, you have acted immorally, and you have acted wickedly. But we do not say: You have disbelieved and apostatized from your religion, until something appears from him that constitutes an excuse for us before Allah, the Mighty and Majestic, in judging his apostasy. Then comes the known ruling in Islam regarding him, which is his saying (peace and blessings be upon him): [Whoever changes his religion, kill him.]\nThen I said—and I still say—to those who harp on declaring Muslim rulers to be disbelievers: Suppose that these rulers are disbelievers with the Kufr of apostasy, and suppose—also—that there is a supreme ruler over them. The duty—in this case—is for this supreme ruler to apply the Hadd (punishment) on them. But now: What do you benefit from a practical standpoint if we concede—for the sake of argument—that these rulers are disbelievers with the Kufr of apostasy? What can you make and do?\nIf they say: Loyalty and Disavowal (Wala' and Bara'). We say: Loyalty and Disavowal are connected to love and enmity—heartfelt and practical—and according to capability. It is not a condition for their existence to declare Takfir and announce apostasy; rather, Loyalty and Disavowal can exist regarding an innovator, a sinner, or an oppressor.\nThen I say to them: Here are these disbelievers who have occupied several positions in Islamic lands, and we, unfortunately, have been afflicted with the Jews' occupation of Palestine. What can we and you do with them? Until you stand—alone—against those rulers whom you think are disbelievers? Why don't you leave this aspect aside and start establishing the foundation upon which the structure of the Islamic government stands? That is by following the Sunnah of the Messenger of Allah (peace and blessings be upon him) upon which he raised his companions and nurtured them on its system and foundation.\nWe mention this repeatedly and emphasize it reiteratively: It is necessary for every Muslim group to work truly to restore the rule of Islam not only on Islamic land but on the entire earth, fulfilling the saying of the Blessed and Exalted: {It is He who sent His Messenger with guidance and the religion of truth to manifest it over all religion, although those who associate others with Allah dislike it} (As-Saff: 9). And it came in some glad tidings of the Prophetic hadiths that this verse will be realized later.\nSo, for Muslims to be able to realize this Quranic text and Divine promise, there must be a clear path and an evident way. Is that path by declaring a revolution against these rulers whom these people think their disbelief is the Kufr of apostasy? Then, with this thought of theirs—which is an erroneous, wrong thought—they cannot do anything. So what is the methodology? And what is the path?",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 14
  },
  {
    "serial_number": "102225",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "There is no doubt that the correct path is what the Messenger of Allah (peace and blessings be upon him) used to focus on and remind his companions of in every sermon: [And the best guidance is the guidance of Muhammad, peace and blessings be upon him.] So it is upon all Muslims—especially those concerned with restoring Islamic rule—to begin where the Messenger of Allah (peace and blessings be upon him) began. This is what we summarize in two light words: (Tasfiyah and Tarbiyah - Purification and Education/Cultivation).\nThat is because we know firm and established facts that those extremists overlook—or pretend to overlook—who have nothing but declaring the Takfir of rulers and then nothing else. They will continue declaring the Takfir of rulers, and then nothing issues from them—or about them—except tribulations (Fitnan) and ordeals (Mihan). The reality in these recent years at the hands of these people, starting from the Fitnah of the Meccan Haram to the Fitnah of Egypt and the killing of Sadat, and finally in Syria, and then now in Egypt and Algeria—is visible to everyone—: Wasting the blood of innocent Muslims because of these tribulations and calamities, and the occurrence of many ordeals and disasters. All of this is due to their opposition to many texts of the Book and the Sunnah, the most important of which is the saying of the Exalted: {There has certainly been for you in the Messenger of Allah an excellent pattern for anyone whose hope is in Allah and the Last Day and [who] remembers Allah often} (Al-Ahzab: 21).\nIf we want to establish the rule of Allah on earth—truly, not just as a claim—do we begin by declaring the rulers disbelievers while we cannot confront them, let alone fight them? Or do we begin—obligatorily—with what the Messenger (peace and blessings be upon him) began with? No doubt the answer is: {There has certainly been for you in the Messenger of Allah an excellent pattern...}\nBut with what did the Messenger of Allah (peace and blessings be upon him) begin?\nIt is certain to anyone who has smelled the fragrance of knowledge that he (peace and blessings be upon him) began with the call (Dawah) among individuals whom he thought were ready to accept the truth. Then whoever responded from the individual Companions responded—as is known in the Prophetic biography. Then after that came the torture and hardship that afflicted the Muslims in Mecca. Then came the command for the first and second migration until Allah, the Mighty and Majestic, established Islam in Medina. There, skirmishes and confrontations began, and fighting started between Muslims and the disbelievers on one side, and then the Jews on another side...\nThus, we must begin by teaching people true Islam as the Messenger (peace and blessings be upon him) began. But it is not permissible for us now to limit ourselves to mere teaching only, for things have entered Islam that are not from it and have no connection to it, from innovations (Bid'ah) and newly invented matters, which caused the collapse of the towering Islamic edifice.",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 15
  },
  {
    "serial_number": "102226",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "Therefore, it was obligatory upon the preachers to begin by purifying (Tasfiyah) this Islam from what has entered into it. This is the first principle: (Purification).\nAs for the second principle: It is that this purification be accompanied by the education/cultivation (Tarbiyah) of the emerging Muslim youth upon this purified Islam.\nIf we study the reality of existing Islamic groups for nearly a century, and their ideas and practices, we would find that many of them have not benefited—or provided—anything worth mentioning despite their shouting and clamor that they want it to be an Islamic government. This caused the shedding of the blood of many innocents under this flimsy pretext without achieving anything from that. We still hear from them beliefs contrary to the Book and the Sunnah and actions contrary to the Book and the Sunnah, let alone their repetition of those failed attempts contrary to the Sharia.\nIn conclusion, I say: There is a statement by one of the preachers—I wished his followers would adhere to it and realize it—which is: (Establish the state of Islam in your hearts, it will be established for you on your land). Because if a Muslim corrects his creed based on the Book and the Sunnah, there is no doubt that by doing so his worship will be corrected, his morals will be corrected, and his behavior will be corrected... etc. But this good word—unfortunately—these people did not act upon it, so they continued shouting, demanding the establishment of the Muslim state... but to no avail.\nIndeed, the saying of the poet applies to them—by Allah:\nYou hope for salvation but do not tread its paths *** Indeed, the ship does not sail on dry land.\nPerhaps in what I have mentioned is enough to convince every fair person and a deterrent for every obstinate person. And Allah is the Helper.\n\n**Review and Praise by His Eminence, the Scholar Sheikh Abd al-Aziz bin Baz, may Allah have mercy on him:**\n\nPraise be to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who are guided by his guidance. As for what follows:\n[This is a commentary by His Eminence Sheikh Allamah Abd al-Aziz bin Abdullah bin Baz on the previous speech of Allamah Muhammad Nasir al-Din al-Albani, may Allah have mercy on them both.]\nI have reviewed the beneficial answer kindly provided by His Eminence Sheikh Muhammad Nasir al-Din al-Albani, may Allah grant him success, published in the newspaper 'Al-Muslimun', in which his Eminence answered one who asked him about: \"Takfir of one who judges by other than what Allah revealed without detail.\"\nI found it to be a valuable word in which he hit the truth and followed the path of the believers. He clarified, may Allah grant him success, that it is not permissible for anyone to declare someone a disbeliever for judging by other than what Allah revealed merely by the act, without knowing that he deemed that lawful (Istihlal) in his heart. He used as evidence what came regarding that from Ibn Abbas (may Allah be pleased with them both) and others from the predecessors (Salaf) of the Ummah.",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 16
  },
  {
    "serial_number": "102227",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "There is no doubt that what he mentioned in his answer regarding the interpretation of the saying of the Exalted: {And whoever does not judge by what Allah has revealed - then it is those who are the disbelievers}, {And whoever does not judge by what Allah has revealed - then it is those who are the wrongdoers}, and: {And whoever does not judge by what Allah has revealed - then it is those who are the defiantly disobedient} is the correct view. He clarified that Kufr is of two types: Major and Minor, just as Zulm (wrongdoing) is two types, and likewise Fisq (disobedience) is two types: Major and Minor.\nSo whoever deems lawful (Istihalla) ruling by other than what Allah revealed, or adultery, or usury, or other prohibitions agreed upon as forbidden, has disbelieved with Major Kufr, committed Major Zulm, and Major Fisq. And whoever does them without deeming them lawful, his Kufr is Minor Kufr, his Zulm is Minor Zulm, and likewise his Fisq.\nThis is due to the saying of the Prophet (peace and blessings be upon him) in the hadith of Ibn Masud (may Allah be pleased with him): [Abusing a Muslim is Fusuq and fighting him is Kufr]. He (peace and blessings be upon him) intended by this Minor Fisq and Minor Kufr, and used the expression to deter from this abominable act.\nSimilarly, his saying (peace and blessings be upon him): [Two things in people are Kufr for them: Defaming lineage and wailing over the dead.] Narrated by Muslim in his Sahih. And his saying (peace and blessings be upon him): [Do not return after me as disbelievers, striking the necks of one another.] Narrated by Al-Bukhari and Muslim from the hadith of Jarir (may Allah be pleased with him). The hadiths with this meaning are numerous.\nTherefore, it is obligatory upon every Muslim, especially the people of knowledge, to verify matters and judge them in the light of the Book and the Sunnah and the path of the Salaf of the Ummah, and to beware of the dire path that many people have taken of issuing general judgments without detail.\nThe people of knowledge must care for calling to Allah (Glorified be He) with detail, clarifying Islam to the people with its proofs from the Book and the Sunnah, encouraging them to be steadfast upon it, advising and counseling in that, along with warning against everything that contradicts the rulings of Islam. By doing so, they would have followed the path of the Prophet (peace and blessings be upon him), the path of his Rightly Guided Caliphs, and his pleased Companions in clarifying the path of truth, guiding to it, and warning against what opposes it, acting upon the saying of Allah (Glorified be He): {And who is better in speech than one who invites to Allah and does righteousness and says, \"Indeed, I am of the Muslims.\"}\nAnd His saying (Mighty and Majestic): {Say, \"This is my way; I invite to Allah with insight, I and those who follow me. And exalted is Allah; and I am not of those who associate others with Him.\"}\nAnd His saying (Glorified be He): {Invite to the way of your Lord with wisdom and good instruction, and argue with them in a way that is best.}",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 17
  },
  {
    "serial_number": "102228",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "And the saying of the Prophet (peace and blessings be upon him): [Whoever guides to something good has a reward similar to that of its doer.] And his saying (peace and blessings be upon him): [Whoever calls to guidance will have a reward like the rewards of those who follow him, without that diminishing anything from their rewards. And whoever calls to misguidance will bear a burden of sin like the burdens of those who follow him, without that diminishing anything from their burdens.]\nAnd the saying of the Prophet (peace and blessings be upon him) to Ali (may Allah be pleased with him) when he sent him to the Jews in Khaybar: [Invite them to Islam and inform them of what is obligatory upon them from the right of Allah in it. By Allah, if Allah guides one man through you, it is better for you than red camels.] Agreed upon as authentic.\nThe Prophet (peace and blessings be upon him) stayed in Mecca for thirteen years calling people to the Oneness of Allah (Tawhid) and entering Islam with advice, wisdom, patience, and good style until Allah guided through his hands and the hands of his companions those for whom happiness was preordained. Then he (peace and blessings be upon him) migrated to Medina and continued his call to Allah (Glorified be He), he and his companions (may Allah be pleased with them), with wisdom, good instruction, patience, and arguing in the best way, until Allah prescribed for him Jihad by the sword against the disbelievers. So he (peace and blessings be upon him) undertook that, he and his companions (may Allah be pleased with them), in the most perfect manner, so Allah supported them, granted them victory, and gave them the praiseworthy outcome.\nThus is victory and the good outcome for whoever follows them in goodness and walks upon their methodology until the Day of Resurrection. Allah is the One asked to make us and all our brothers in Allah among their followers in goodness, and to grant us and all our brothers who call to Allah penetrating insight, righteous deeds, and patience upon the truth until we meet Him (Glorified be He). Indeed, He is the Guardian of that and Capable of it. May Allah send peace and blessings upon our Prophet Muhammad, his family, and his companions, and those who follow them in goodness until the Day of Judgment.\n\n**Commentary of the Scholar Sheikh Muhammad Al-Uthaymeen, may Allah have mercy on him, on the words of Al-Albani and Bin Baz**",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 18
  },
  {
    "serial_number": "102229",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "What is understood from the speech of the two Sheikhs [After Al-Albani's previous speech regarding the issue of Takfir and ruling by other than what Allah revealed was read to Sheikh Ibn Uthaymeen, and then the commentary of the Mark Ibn Baz on the speech of the Mark Al-Albani was read to him, he (may Allah preserve him) commented with a brief, beneficial commentary summarizing what preceded. We ask Allah to make it beneficial]:\nThat Kufr is for the one who deems that lawful (Istihlal). As for the one who rules by it while acknowledging it is a sin and opposition: this one is not a disbeliever because he did not deem it lawful, but it might be due to fear, inability, or something similar.\nBased on this, the three verses, meaning His saying: {And whoever does not judge by what Allah has revealed - then it is those who are the disbelievers}, and His saying: {And whoever does not judge by what Allah has revealed - then it is those who are the wrongdoers}, and His saying: {And whoever does not judge by what Allah has revealed - then it is those who are the defiantly disobedient} [Surah Al-Ma'idah, Verses: 47, 45, 44] act upon three situations:\n\n- 1 - Whoever judges by other than what Allah revealed as a replacement for the religion of Allah, this is Major Kufr that expels one from the religion (Millah), because he made himself a legislator alongside Allah, the Mighty and Majestic, and because he hates His Sharia.\n\n- 2 - Whoever judges by it due to a desire in himself (Hawa), or fear for himself, or something similar, this one does not disbelieve [Major Kufr], but he transitions to Fisq (disobedience).",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 19
  },
  {
    "serial_number": "102230",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Fitnat al-Takfir (The Tribulation of Excommunication)",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "- 3 - Whoever judges by it out of aggression and injustice—and this does not happen in general laws but happens in a specific judgment, such as ruling against a person by other than what Allah revealed to take revenge on him—this one is said to be: A wrongdoer (Zalim).\nSo the descriptions apply according to the situations.\nSome scholars said: They are descriptions for a single described entity, and that every disbeliever is a wrongdoer and every disbeliever is a defiantly disobedient one. They used as evidence His saying: {And the disbelievers - they are the wrongdoers} and His saying: {But as for those who defiantly disobeyed, their refuge is the Fire.} This is the Major Fisq.\nWhatever the case may be, as Sheikh Al-Albani (may Allah have mercy on him) indicated: A person looks at what the result will be? The issue is not theoretical, but the important thing is the practical application. What is the result?\nMay Allah send peace and blessings upon our Prophet Muhammad, his family, his companions, and those who follow them in goodness until the Day of Judgment.",
    "foot_note": "None",
    "book_id": "707",
    "new_page_number": 20
  }
]