[
  {
    "text": "Happiness and Success in Understanding the Purposes of Marriage\nAuthor: أمين بن عبد الله الشقاوي\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 1
  },
  {
    "text": "sn: 8448\nbook_title: السعادة والفلاح في فهم مقاصد النكاح\nbook_link: https://shamela.ws/book/196\nbook_id: 196\nauthor_name: أمين بن عبد الله الشقاوي\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/2747\nauthor_ID: 2747\neditor: Null\npublisher: Null\nedition: الأولى، 1442 هـ - 2021 م\npages: 58\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: كتب عامة\ncategory_id: 39",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 2
  },
  {
    "serial_number": "7493521",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: General Books\nBook: Happiness and Success in Understanding the Purposes of Marriage (As-Sa'adah wa Al-Falah fi Fahm Maqasid An-Nikah)\nAuthor: Abdul Rahim bin Hussein Al-Maliki - Amin bin Abdullah Ash-Shaqawi\n\n[Repeated Title Information Omitted]",
    "foot_note": "None",
    "book_id": "196",
    "new_page_number": 3
  },
  {
    "serial_number": "7493522",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Objectives of Marriage",
    "edition": "First Edition, 1442 AH - 2021 CE",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "Introduction\nIn the name of Allah, the Most Merciful, the Most Compassionate.\nAll praise is due to Allah; we praise Him, seek His help, and ask His forgiveness. We seek refuge in Allah from the evils of our souls and from the consequences of our deeds. Whoever Allah guides, none can misguide; and whoever He misguides, none can guide. I bear witness that there is no deity worthy of worship except Allah alone with no partner, and I bear witness that Muhammad is His servant and His Messenger.\n\n{O you who believe, fear Allah as He should be feared, and do not die except as Muslims} (Aal 'Imran, 102).\n\n{O mankind, fear your Lord who created you from a single soul, and created from it its mate, and spread from both many men and women. And fear Allah, through whom you ask one another, and the wombs. Indeed, Allah is ever watching over you} (An-Nisa, 1).\n\n{O you who believe, fear Allah and speak words of appropriate justice. He will correct your deeds for you and forgive your sins. And whoever obeys Allah and His Messenger has certainly attained a great success} (Al-Ahzab, 70–71).\n\nTo proceed: The best of speech is the Book of Allah, and the best guidance is the guidance of Muhammad (peace be upon him). The worst of affairs are newly invented matters, and every innovation is misguidance, and every misguidance leads to the Fire.",
    "foot_note": "None",
    "book_id": "196",
    "new_page_number": 4
  },
  {
    "serial_number": "7493523",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "Then afterwards: Building a Muslim society cannot be achieved except by building the family, and the foundation for building a righteous Muslim family is the couple; they are the two building blocks upon which families are founded. It saddens the Muslim, especially in this time, to witness the disintegration of families and the destruction of many homes, to the point that it has become a phenomenon widely complained about and a widespread affliction. It has become incumbent upon reformers to treat it and mitigate its corruptions, but how? We hope to succeed in this treatise in contributing to the treatment of this phenomenon by explaining the purposes of marriage that the couple must understand, as well as parents and indeed the entire society. So we say, and we seek Allah's help: \"The Purposes of Marriage\": The purposes of marriage that most humans desire are three: Offspring, Service, and Pleasure. Before we begin explaining these purposes, we answer this question that some raise briefly, saying: \"You encourage marriage and mention its virtues and good fruits, but when we got married, we found hardships, rights, duties, and responsibilities in which those pleasures dissolve!\" We say: This is a valid question, and the answer is: This goes back to the difference in determination (Himmah) among men and women. Just as there is disparity among men, there is also disparity among women. Some see their happiness in abandoning responsibilities and neglecting",
    "foot_note": "None",
    "book_id": "196",
    "new_page_number": 5
  },
  {
    "serial_number": "7493524",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "undertaking duties. As the poet said: Leave noble traits, do not travel to seek them ... And sit, for you are the fed and clothed one. And some see happiness in fulfilling these rights, bearing these responsibilities, and rising to these burdens, finding in that their happiness and pleasure due to their high determination and elevated soul. The poet said: Were it not for hardship, all people would have prevailed ... Generosity impoverishes and boldness kills. To the explanation of these purposes, may Allah grant us and you success to understand and act upon them. First Purpose (Offspring): Allah Almighty said: {And We have already sent messengers before you and assigned to them wives and descendants} [Surah Ar-Ra'd: 38]. Abu Dawud narrated in his Sunan from the hadith of Ma'qil bin Yasar (may Allah be pleased with him) that the Prophet (peace and blessings be upon him) said: \"Marry the loving and fertile, for I will boast of your numbers before the nations.\" (1) Offspring is a valid demand and has worldly and hereafter benefits. Allah Almighty said: {Wealth and children are the adornment of the worldly life} [Surah Al-Kahf: 46]. And He said: {And We gave to David Solomon - an excellent servant, indeed he was one repeatedly turning back [to Allah]} [Surah Sad: 30]. And He said: {So We gave him good tidings of a forbearing boy} [Surah As-Saffat: 101]. Muslim narrated in his Sahih from the hadith of Abu Hurairah (may Allah be pleased with him) that the Prophet (peace and blessings be upon him) said: \"When a person dies,",
    "foot_note": "1. Sunan Abi Dawud number (2050), and Sheikh Al-Albani (may Allah have mercy on him) said in Sahih Sunan Abi Dawud (2/386) number (1804): Hasan Sahih.",
    "book_id": "196",
    "new_page_number": 6
  },
  {
    "serial_number": "7493525",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "his deeds come to an end except for three: a recurring charity, or knowledge [by which people] benefit, or a righteous child who prays for him.\" (1) This purpose is shared between the spouses equally, and its benefits return to both spouses. Therefore, the spouses must know that each one of them has a favor over the other in bringing about offspring, and it is not permissible for either of them to see a favor for themselves in that which is not for the other. By understanding this reality, cooperation occurs between them to bear this responsibility, and thus carrying this heavy burden becomes lighter due to the couple's cooperation. This is contrary to if one of them abandons it, the other will carry their burden and the burden of another, so it becomes heavy on them and perhaps they become incapable of it, causing harm and corruption whose effects we see increasing day by day. This reality is what the noble female companion Khawlah bint Tha'labah (may Allah be pleased with her) understood when her husband declared Zihar upon her and she came complaining to the Prophet (peace and blessings be upon him), saying: \"O Messenger of Allah! I have children from him; if I keep them with me they will go hungry, and if I leave them to him they will be lost...\" (2) So she understood (may Allah be pleased with her) that raising children and caring for them is not accomplished except by the cooperation of the spouses, and that without that - due to separation or discord - harm befalls the children through hunger and loss. If this was in the first righteous era, then what about us",
    "foot_note": "1. Sahih Muslim number (1631). \n2. This narration was mentioned by Al-Baghawi in his Tafsir Al-Waset (8/47), and the origin of the hadith is established, narrated by Ahmad in his Musnad (40/228) number (24195), and its investigators said: Its chain is authentic according to the conditions of Muslim.",
    "book_id": "196",
    "new_page_number": 7
  },
  {
    "serial_number": "7493526",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "today?! Allah Almighty revealed concerning Khawlah and her complaint a Quran to be recited. Allah Almighty said: {Allah has heard the statement of her who disputes with you concerning her husband and complains to Allah. And Allah hears your dialogue; indeed, Allah is Hearing and Seeing} [Surah Al-Mujadila: 1]. Second Purpose: (Service): One of the man's purposes in marriage is to marry a woman who serves him - and the discussion is about the general case, and special cases have their own rulings - whether inside the house or outside it; such as cooking food, organizing the house, washing clothes, gathering firewood, fetching water, caring for livestock, and other things in which one society differs from another. In the Two Sahihs from the hadith of Aisha (may Allah be pleased with her) when the Messenger of Allah (peace and blessings be upon him) asked Barirah, a freed slave of Aisha, saying: \"O Barirah, did you see anything that arouses your suspicion?\" Barirah said: \"No, by the One who sent you with the truth, if I saw anything upon her I would fault (1) her for, it is no more than that she is a young girl who sleeps leaving her family's dough, so the domestic animal (2) comes and eats it.\" (3) And Muslim narrated in his Sahih from the hadith of Anas (may Allah be pleased with him) who said: When Zaynab's waiting period ended, the Messenger of Allah (peace and blessings be upon him) said to Zaid: \"Mention her to me.\" He said: So Zaid went until he came to her while she was fermenting her dough. He said: When I saw her, she became great in my chest (4).",
    "foot_note": "1. Meaning I criticize her for. An-Nihayah (3/347). \n2. Ad-Dajin: It is the sheep that is accustomed to the house and does not go out to pasture, and it is said: It is everything that is accustomed to houses absolutely, whether sheep or bird. \n3. Sahih Al-Bukhari number (4750), and Sahih Muslim number (2770). \n4. Number (1428).",
    "book_id": "196",
    "new_page_number": 8
  },
  {
    "serial_number": "7493527",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "And Muslim narrated in his Sahih from the hadith of Asma' bint Abi Bakr (may Allah be pleased with her) who said: Az-Zubayr married me, and he had no wealth or slave or anything on earth except his horse. She said: I used to feed his horse, suffice him his provision, groom it, pound date stones for his water-camel, feed it, fetch water, stitch his leather bucket, and knead dough, but I was not good at baking bread, so female neighbors from the Ansar used to bake for me, and they were truthful women. She said: I used to carry the date stones from Az-Zubayr's land that the Messenger of Allah (peace and blessings be upon him) had granted him on my head, and it was two-thirds of a farsakh away. She said: So I came one day with the date stones on my head, and I met the Messenger of Allah (peace and blessings be upon him) with a group of his companions. He called me, then said: \"Ikh Ikh\" (to make his camel kneel) to carry me behind him. She said: I felt shy and knew your jealousy, so he said: \"By Allah, your carrying the date stones on your head is harder than riding with him.\" She said: Until Abu Bakr sent me a servant after that who sufficed me the grooming of the horse, so it was as if he had freed me (1). And in Sahih Al-Bukhari from the hadith of Ali (may Allah be pleased with him): That Fatimah complained about what she suffered from the hand mill due to grinding. She heard that the Messenger of Allah (peace and blessings be upon him) had received captives, so she came to him asking for a servant but did not find him, so she mentioned it to Aisha. The Prophet (peace and blessings be upon him) came and Aisha mentioned that to him. He came to us while we had entered our beds, so we moved to stand up, but he said: \"Stay in your places,\" until I felt the coolness of his feet on my chest. He said: \"Shall I not guide you to something better than what you asked for? When you take to your beds, say 'Allahu Akbar' thirty-four times, 'Alhamdulillah' thirty-three times, and 'Subhan Allah' thirty-three times, for that is better for you than what you asked for.\" (2) If it is said: Then what corresponds to that from the husband? The answer is: The husband is responsible for spending (nafaqah).",
    "foot_note": "1. Number (2182). \n2. Number (3113).",
    "book_id": "196",
    "new_page_number": 9
  },
  {
    "serial_number": "7493528",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "For he toils and labors to acquire it. Allah Almighty said: {Let a man of wealth spend from his wealth, and he whose provision is restricted - let him spend from what Allah has given him. Allah does not charge a soul except [according to] what He has given it} [Surah At-Talaq: 7]. And He said: {Lodge them [in a section] of where you dwell out of your means} [Surah At-Talaq: 6]. And he (peace and blessings be upon him) said: \"It is enough sin for a man to neglect those he provides for.\" (1) And Abu Dawud narrated in his Sunan from the hadith of Mu'awiyah bin Haydah who said: I said: \"O Messenger of Allah, what is the right of the wife of one of us upon him?\" He (peace and blessings be upon him) said: \"That you feed her when you eat, and clothe her when you clothe yourself...\" the Hadith (2). And Al-Bukhari and Muslim narrated from the hadith of Sa'd (may Allah be pleased with him) that the Prophet (peace and blessings be upon him) said to him: \"...and you do not spend a spending seeking thereby the Face of Allah except that you are rewarded for it, even the morsel you place in your wife's mouth.\" (3) Attached to this is providing security for the wife in all its forms; domestic security, living security, psychological security, and so on. It is his responsibility alone because he is a man. So each of them is a servant to the other, except that the wife's position is more cherished and honorable than the husband's position in many cases, for the husband may serve someone who does not love or honor him, but rather insults and humiliates him, unlike the woman; she finds someone who thanks her and praises her",
    "foot_note": "1. Musnad Imam Ahmad (11/432) number (6495), and its investigators said: Authentic hadith from the hadith of Abdullah bin Amr (may Allah be pleased with them both). \n2. Musnad Imam Ahmad (33/226) number (20022), and its investigators said: Its chain is Hasan, and Sunan Abi Dawud number (2142). \n3. Sahih Al-Bukhari number (56), and Sahih Muslim number (1628), and the wording is his.",
    "book_id": "196",
    "new_page_number": 10
  },
  {
    "serial_number": "7493529",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "and prays for her, so her service becomes a source of joy, happiness, pride, and glory. So women should realize this and appreciate it duly. Knowing this truth and acting upon it out of conviction and satisfaction drives each of them to do what they must without complaint or feeling of injustice or oppression, because each knows that just as they have a duty they must perform, the other also has a duty like theirs, even if the types differ. What is obligatory on one is a right for the other, and consequently, the arrogance and reminding of favors which causes the scattering and separation of families ceases. Allah Almighty said: {And due to the wives is similar to what is expected of them, according to what is reasonable} [Surah Al-Baqarah: 228]. Third Purpose: (Pleasure) It is the broadest of these purposes and the most beneficial if performed well, and the most harmful if neglected. Pleasure does not only mean the bed, but it is broader than that, as it includes all aspects of life. It is required from both spouses, with some difference in what is obligatory on each of them, according to what the nature of each requires. When the couple lives as one soul, one rejoicing in the other's joy, grieving for their grief, caring for their concern, and each striving for the other's pleasure, then a happy and blissful life is guaranteed for them. But let it be known that this will not be upright for them except by resolving to maintain this close bond between them until they meet in the Gardens of Bliss (1).",
    "foot_note": "1. Some details for this summary will follow.",
    "book_id": "196",
    "new_page_number": 11
  },
  {
    "serial_number": "7493530",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "It was mentioned previously that the third purpose of marriage in its broader sense is the most extensive of these purposes, the most beneficial if performed well, and the most harmful if neglected. Among its effects is that it serves other purposes positively and negatively. It is required from both spouses, although the wife is more deserving of it and more capable of it due to the attractive feminine composition and sweet, beautiful signals Allah created her with. There is nothing in the world more delightful, better, or more pleasurable than a righteous woman. All pleasures of life reverse during fluctuations, but a righteous woman remains so; indeed, happiness with her increases with the intensification of conditions and hardships of life. Through this, we understand his saying (peace and blessings be upon him) in what Muslim narrated in his Sahih from the hadith of Abdullah bin Amr (may Allah be pleased with them both) that the Prophet (peace and blessings be upon him) said: \"The world is enjoyment, and the best enjoyment of the world is a righteous woman.\" (1) We will cite below some Quranic verses and noble Prophetic hadiths that include the application of this purpose to help understand it. Let it be known that in this chapter we do not intend to explain rights and duties, but rather to clarify the areas of pleasure each spouse gives to the other concerning beautiful morals and high manners, and that it encompasses all aspects of life. 1 - Allah Almighty said: {They are clothing for you and you are clothing for them} [Surah Al-Baqarah: 187]. Among the means of making each other happy is to be",
    "foot_note": "1. Sahih Al-Bukhari number (3237), and Sahih Muslim number (1436).",
    "book_id": "196",
    "new_page_number": 12
  },
  {
    "serial_number": "7493531",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "clothing for him, covering him, protecting him, and beautifying him, and more details on this will come. 2 - Allah Almighty said: {And of His signs is that He created for you from yourselves mates that you may find tranquility in them} [Surah Ar-Rum: 21]. So among the greatest pleasures a husband obtains is that his wife serves as a dwelling where he finds tranquility and comfort, and more details on this will come. 3 - Allah Almighty said: {So the righteous women are devoutly obedient, guarding in [the husband's] absence what Allah would have them guard} [Surah An-Nisa: 34]. Imam Ahmad narrated in his Musnad from the hadith of Sa'd (may Allah be pleased with him) that the Prophet (peace and blessings be upon him) when asked about the righteous woman said: \"The one who pleases him when he looks, obeys him when he commands, and does not oppose him in herself or his wealth with what he dislikes.\" (1) The anxiety and worry that afflict the husband due to doubts and whispers during his absence from his wife, wealth, and children disappear with a righteous, chaste, honorable woman, and are replaced by reassurance and comfort. 4 - Allah Almighty said, relating about the Prophet of Allah Moses when he addressed his family: {And when Moses had completed the term and was traveling with his family, he perceived from the direction of the mount a fire. He said to his family, \"Stay here; indeed, I have perceived a fire. Perhaps I will bring you from there [some] information or burning wood from the fire that you may warm yourselves.\"} [Surah Al-Qasas: 29]. One of the things that show the wife's status with her husband is that he makes her participate in some of his general affairs, for by that she feels appreciation and respect and that she is not neglected. So here is Moses (peace be upon him) saying to his wife:",
    "foot_note": "1. Musnad Imam Ahmad (12/383 - 384) number (7421), and its investigators said: Its chain is strong.",
    "book_id": "196",
    "new_page_number": 13
  },
  {
    "serial_number": "7493532",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "\"I will bring you news from it,\" and he did not say: \"These matters concern men, she has nothing to do with it.\" So let husbands pay attention to that. 5 - One of the greatest pleasures a wife attains is finding gratitude, praise, and acknowledgment of favor from her husband for what she does of good companionship and kind treatment. These wives of the Messenger of Allah (peace and blessings be upon him) and may Allah be pleased with them, when they were given the choice between the world and the Hereafter and chose Allah and His Messenger, their reward was what the Almighty informed of by His saying: {Not lawful to you, [O Muhammad], are [any additional] women after [this], nor [is it] for you to exchange them for [other] wives, even if their beauty were to please you, except what your right hand possesses} [Surah Al-Ahzab: 52]. 6 - One of the best and finest things a husband enjoys is that his wife guards her gaze, for if she is like that, she is more guarding of what is beyond that. Allah Almighty said: {And tell the believing women to reduce [some] of their vision} [Surah An-Nur: 31]. Allah described the women of Paradise saying: {In them are women limiting [their] glances} [Surah Ar-Rahman: 56]. Similarly, the wife finds happiness and comfort when she sees her husband guarding his gaze in compliance with His Almighty saying: {Tell the believing men to reduce [some] of their vision} [Surah An-Nur: 30], knowing that if he guards his gaze, he is more guarding of what is beyond that. 7 - Among the greatest things the couple enjoys is that each sees in the other this beautiful trait which is a branch of faith, the trait of modesty (Haya'). For if modesty exists, no blameworthy morals or sick attributes can rise with it. Therefore, he (peace and blessings be upon him) said: \"Modesty is all good.\" (1) In the blessed Revelation, our Lord Almighty narrates to us the story of the two righteous daughters, mentioning the greatest thing they were adorned with, which is modesty that",
    "foot_note": "1. Sahih Muslim number (37), and Al-Bukhari narrated it under number (6117) with its meaning.",
    "book_id": "196",
    "new_page_number": 14
  },
  {
    "serial_number": "7493533",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "prevented them from mixing with men despite the dire need to water their sheep. Allah Almighty said: {And when he came to the water of Madyan, he found there a crowd of people watering [their flocks], and he found aside from them two women driving back [their flocks]. He said, \"What is your circumstance?\" They said, \"We do not water until the shepherds dispatch [their flocks]; and our father is an old man.\" So he watered [their flocks] for them; then he went back to the shade and said, \"My Lord, indeed I am, for whatever good You would send down to me, in need.\"} [Surah Al-Qasas: 23-24]. 8 - Indeed, what beautifies a woman and raises her status in people's eyes - especially the husband - is that modesty governs all her actions, movements, and stillness, even in her walking. Allah mentioned this about the righteous woman, daughter of the righteous man, by way of praise and commendation, saying: {Then one of the two women came to him walking with shyness} [Surah Al-Qasas: 25]. 9 - One of the greatest blessings upon a man is that Allah grants him a wise, intelligent wife who is keenly observant of what is good, knowledgeable of virtues and good qualities. Allah Almighty said about the righteous woman, daughter of the righteous man: {One of the women said, \"O my father, hire him. Indeed, the best one you can hire is the strong and the trustworthy.\"} [Surah Al-Qasas: 26]. 10 - Allah Almighty said: {O wives of the Prophet, you are not like anyone among women. If you fear Allah, then do not be soft in speech [to men], lest he in whose heart is disease should covet, but speak with appropriate speech} [Surah Al-Ahzab: 32]. Among the matters that raise a woman's status and elevate her rank with her husband, and indeed with all people, is that her actions cut off the greed of those with desire and immorality. If she is compelled to speak with men, her speech should not be soft or gentle, and",
    "foot_note": "None",
    "book_id": "196",
    "new_page_number": 15
  },
  {
    "serial_number": "7493534",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "she should avoid words and phrases that are only appropriate with husbands. {But speak with appropriate speech} [Surah Al-Ahzab: 32]. 11 - Bringing joy to souls is something everyone seeks, and it is part of the bliss of the people of Paradise. Therefore, the spouses should bring joy to each other, and this is a quality of the righteous woman. Imam Ahmad narrated in his Musnad from the hadith of Abu Hurairah (may Allah be pleased with him) that the Prophet (peace and blessings be upon him) was asked: \"Which women are best?\" He said: \"The one who pleases him when he looks, obeys him when he commands, and does not oppose him in herself or his wealth with what he dislikes.\" (1) 12 - Imam Ahmad narrated in his Musnad from the hadith of Aisha (may Allah be pleased with her): That she was with the Prophet (peace and blessings be upon him) on a journey while she was a young girl. He said to his companions: \"Go ahead,\" so they went ahead. Then he said: \"Come, let me race you.\" So I raced him and won. We stayed until I gained weight (meat covered me), he raced me and won. He said: \"This is for that.\" (2) 13 - Imam Ahmad narrated in his Musnad from the hadith of Aisha (may Allah be pleased with her) who said: I used to eat meat from a bone while I was menstruating, then the Messenger of Allah (peace and blessings be upon him) would take it and place his mouth where my mouth was. And I would drink from a vessel, then the Messenger of Allah (peace and blessings be upon him) would take it and place his mouth where my mouth was, while I was menstruating. (3) 14 - Al-Bukhari and Muslim narrated in their Sahihs from the hadith of Aisha (may Allah be pleased with her) who said: The Messenger of Allah (peace and blessings be upon him) entered upon me while I had two girls singing the songs of Bu'ath.",
    "foot_note": "1. (12/383) number (7421), and its investigators said: Its chain is strong. \n2. (40/145) number (24119), and its investigators said: Its chain is authentic according to the conditions of the two Sheikhs. \n3. (41/427) number (24954), and its investigators said: Its chain is authentic according to the conditions of Muslim.",
    "book_id": "196",
    "new_page_number": 16
  },
  {
    "serial_number": "7493535",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "He lay down on the bed and turned his face away. Then Abu Bakr entered and scolded me, saying: \"Musical instrument of Satan in the presence of the Prophet (peace and blessings be upon him)?\" The Messenger of Allah (peace be upon him) turned to him and said: \"Leave them.\" When he got distracted, I signaled to them and they left. It was the day of Eid, and the Abyssinians were playing with shields and spears. Either I asked the Prophet (peace and blessings be upon him) or he said: \"Do you wish to watch?\" I said: \"Yes.\" So he set me up behind him, my cheek against his cheek, while he was saying: \"Carry on, O Bani Arfidah,\" until when I got bored, he said: \"Is that enough for you?\" I said: \"Yes.\" He said: \"Then go.\" (1) 15 - Khadijah (may Allah be pleased with her) set the most wonderful examples before Islam and after it. We mention some of her stances and the stances of the Messenger of Allah (peace and blessings be upon him) with her, to be an example to follow for every couple who wants their life together to be a happy and good life. Al-Bukhari narrated in his Sahih from the hadith of Aisha (may Allah be pleased with her) that she said: The first thing with which the revelation started to the Messenger of Allah (peace and blessings be upon him) was the righteous dream in sleep. He never saw a dream but that it came like the breaking of dawn. It came in the end of the hadith: Then the Messenger of Allah (peace and blessings be upon him) returned with it, his heart trembling. He entered upon Khadijah bint Khuwaylid and said: \"Cover me, cover me.\" So they covered him until the fear left him. Then he said to Khadijah: \"O Khadijah, what is wrong with me?\" and he informed her of the news. He said: \"I fear for myself.\" Khadijah said: \"Nay! By Allah, Allah will never disgrace you. You keep good relations with your kith and kin, help the poor and the destitute, serve your guests generously, and assist the deserving calamity-afflicted ones.\" Then Khadijah took him until she brought him to Waraqah bin Nawfal bin Asad bin Abd al-Uzza, Khadijah's cousin, who was",
    "foot_note": "1. Sahih Al-Bukhari number (949), and Sahih Muslim number (892) and the wording is his.",
    "book_id": "196",
    "new_page_number": 17
  },
  {
    "serial_number": "7493536",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "a man who had become a Christian in the Pre-Islamic Period. He used to write the Hebrew script, so he would write from the Gospel in Hebrew as much as Allah wished him to write. He was an old man who had become blind. Khadijah said to him: \"O son of my uncle, listen to the son of your brother.\" Waraqah said to him: \"O son of my brother, what do you see?\" So the Messenger of Allah (peace and blessings be upon him) informed him of the news of what he had seen. Waraqah said to him: \"This is the Namus (Angel Gabriel) whom Allah sent down to Moses. I wish I were young in it (during your prophethood). I wish I could be alive when your people expel you.\" The Messenger of Allah (peace and blessings be upon him) said: \"Will they expel me?\" Waraqah said: \"Yes. No man ever brought what you brought except that he was treated as an enemy. If your day reaches me, I will support you with a strong support.\" Then Waraqah did not live long until he died, and the revelation paused (1). Her standing with the Prophet (peace and blessings be upon him), reassuring him, and giving him glad tidings is among the greatest stances of a woman with her husband, noting and knowing that all this happened before her Islam. The Messenger of Allah (peace and blessings be upon him) rewarded her by highlighting these noble stances. He used to repeat: \"She was, and she was, and I had children from her.\" (2) And: \"I was granted her love.\" (3) And: \"Allah Almighty did not replace me with anyone better than her. She believed in me when people disbelieved in me, she believed me when people called me a liar, and she comforted me with her wealth when people deprived me.\" (4) He (peace and blessings be upon him) used to mention these great virtues for her after her death (may Allah be pleased with her) until",
    "foot_note": "1. Sahih Al-Bukhari number (3), and Sahih Muslim number (160). \n2. Sahih Al-Bukhari number (3818), and Sahih Muslim number (2434) from the hadith of Aisha (may Allah be pleased with her). \n3. Sahih Muslim number (2435) from the hadith of Aisha (may Allah be pleased with her). \n4. Musnad Imam Ahmad (41/356) number (24864), and its investigators said: Authentic hadith from the hadith of Aisha (may Allah be pleased with her).",
    "book_id": "196",
    "new_page_number": 18
  },
  {
    "serial_number": "7493537",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "Aisha (may Allah be pleased with her) said: \"As if there was no woman in the world except Khadijah.\" (1) She (may Allah be pleased with her) attained through her good companionship what no one else attained. Al-Bukhari and Muslim narrated in their Sahihs from the hadith of Abu Hurairah (may Allah be pleased with him) who said: \"Gabriel came to the Prophet (peace and blessings be upon him) and said: O Messenger of Allah! This is Khadijah who has come to you with a vessel containing condiment, or food, or drink. When she comes to you, convey to her the greeting of peace from her Lord and from me, and give her the glad tidings of a house in Paradise made of Qasab (hollow pearl), wherein there will be no noise (sakhab) and no toil (nasab).\" (2) Qasab is hollow pearl, spacious like a lofty palace. Sakhab is the mixing of voices. Nasab is fatigue. Al-Suhayli said: He gave her glad tidings of a house in Paradise made of Qasab - meaning pearl Qasab - because she won the Qasab (prize) of precedence to faith; wherein there is no noise and no toil, because she never raised her voice over the Prophet (peace and blessings be upon him) and never wearied him a single day of time, so she never shouted at him a day nor hurt him ever (3). These are some of her stances (may Allah be pleased with her and please her), with which we concluded this chapter, and musk is the best conclusion. * * *",
    "foot_note": "1. Sahih Al-Bukhari number (3818) from the hadith of Aisha (may Allah be pleased with her). \n2. Sahih Al-Bukhari number (3820), and Sahih Muslim number (2432). \n3. Al-Bidaya wa'l-Nihaya by Ibn Kathir (may Allah have mercy on him) (4/317).",
    "book_id": "196",
    "new_page_number": 19
  },
  {
    "serial_number": "7493538",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "A Section from it: 16 - Al-Bukhari and Muslim narrated in their Sahihs from the hadith of Abu Hurairah (may Allah be pleased with him): That a man came to the Prophet (peace and blessings be upon him) and said: O Messenger of Allah? Exhaustion has afflicted me. So he sent to his wives, and they said: We have nothing but water. So the Messenger of Allah (peace and blessings be upon him) said: \"Who will host or entertain this man [tonight, may Allah have mercy on him]?\" A man from the Ansar said: I will [O Messenger of Allah!]. So he went with him to his wife and said: \"Honor the guest of the Messenger of Allah (peace and blessings be upon him) [do not save anything].\" She said: \"[By Allah] We have nothing but my children's sustenance.\" He said: \"Prepare your food, light your lamp, and put your children to sleep if they want dinner. [And come, extinguish the lamp, and we will fold our stomachs (go hungry) tonight].\" So she prepared her food, lit her lamp, and put her children to sleep. Then she got up as if she was fixing her lamp and extinguished it. They made him think they were eating, and they spent the night hungry. When morning came, he went to the Messenger of Allah (peace and blessings be upon him) who said: \"Allah laughed - or wondered - last night at your action.\" So Allah revealed: {And they give preference over themselves, even though they are in privation. And whoever is protected from the stinginess of his soul - it is those who will be the successful} [Surah Al-Hashr: 9] (1). Islam has magnified the status of women and praised their noble stances, and revealed concerning them a Quran recited until the Day of Resurrection. So woe, then woe to those who seek to show Islam as other than that.",
    "foot_note": "1. Mukhtasar Sahih Al-Bukhari by Sheikh Al-Albani (may Allah have mercy on him) number 1614, and Muslim narrated it under number 2054 with a different wording.",
    "book_id": "196",
    "new_page_number": 20
  },
  {
    "serial_number": "7493539",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "To explain the reason for citing this story, contemplate the following points: (a) This guest is not like any other guest, but a special guest, for he is the guest of the Messenger of Allah (peace and blessings be upon him). (b) This noble Companion (may Allah be pleased with him) took this guest with him to his house to host him, seeking thereby the pleasure of Allah Almighty and the pleasure of the Messenger of Allah (peace and blessings be upon him), hoping that the Prophet's supplication would reach him, and to bring joy to himself as he is from a people who love honoring guests. (c) He informed his wife that this guest is a special guest so she could share in the reward, virtue, and praise (1), and he did not say to her: This does not concern you, do what I order you. (d) The Ansari (may Allah be pleased with him) did not find any food in his house except what was enough for his children. In this situation where embarrassment reached its peak, he found himself in need of someone to help him and stand with him to attain these virtues, and he found her. Who could it be? (e) It is his righteous, generous, wise, intelligent, patient, loyal wife. (f) If she had said to her husband: Two rights have combined upon you: the right of the guest and the right of the family, and you must prioritize the more worthy of them, which is here the right of the family, his chest would have tightened, and his embarrassment would have become great. But she (may Allah be pleased with her) did not say that due to the generosity of her soul and the goodness of her companionship. (g) Out of the generosity of her soul and good companionship, she intended and resolved to prefer others over herself, spending the night with an empty stomach so that her husband could attain those virtues and great honor, and to beautify him before the Messenger of Allah (peace and blessings be upon him) and his guest.",
    "foot_note": "1. Hamd: is commendation and praise.",
    "book_id": "196",
    "new_page_number": 21
  },
  {
    "serial_number": "7493540",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "She did not say: I have nothing but what suffices me, but rather ignored herself and said: I have nothing but the children's dinner. (h) Out of her intelligence and fear that her action might not be correct in prioritizing the guest's right over the children's right, she said that to her husband so they could share in the decision and bear its consequences with him. She could have evaded and said to her husband: This is what is available, feed whomever you wish, and absolved herself of responsibility. But she (may Allah be pleased with her) did not do that due to the generosity of her soul and good companionship. What an excellent righteous role model. (i) One of the greatest things a person faces is the jurisprudence of priorities and prioritizing duties and rights over one another when they conflict. In this story is an example to follow, and the successful one is whom Allah grants success. Whoever Allah wants good for, He gives him understanding of the religion. (j) In this story, the theoretical idea was shared between the spouses, but the one who executed it, bore its burdens, and raised its banner was the blessed wife. Thus, she deserved the immortalization of her mention and that her Lord wondered at her deed and her husband's deed. (k) They (may Allah be pleased with them both) did not limit themselves in honoring the guest of the Messenger of Allah (peace and blessings be upon him) to just preparing his dinner, but added to that bringing joy to him. That was by showing that honoring him did not cause them hardship and that what they presented to him was surplus to their need, so they extinguished the lamp and made him think they were eating. This is what was facilitated to explain regarding our topic, and the story has other benefits, the most prominent of which we mention briefly:",
    "foot_note": "None",
    "book_id": "196",
    "new_page_number": 22
  },
  {
    "serial_number": "7493541",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "1 - In this story is a clarification of his status (peace and blessings be upon him) and his great rank with his Lord. For when these two Companions hosted his guest and fulfilled the right due upon him, Allah immortalized their good mention in verses recited until the Day of Resurrection. So imagine how great the status of one who undertakes his call, spreads his Sunnah, and defends his religion would be?! 2 - In it: What he (peace and blessings be upon him) was upon of straitened living and lack of means by his own choice, for if he wished it would have been otherwise, but he (peace and blessings be upon him) preferred the Enduring over the Perishing and the Hereafter over the First, and chose to be a Servant Messenger. 3 - In it: The virtue of the wives of the Messenger (peace and blessings be upon him), and their great patience and their choice of Allah and His Messenger over the worldly life and its adornment. 4 - In it: That among the duties and obligations are those of communal obligation (Fard Kifayah), for the right of this guest fell from the Prophet (peace and blessings be upon him) by the performance of these two Companions. 5 - In it: That a man asking one of his Muslim brothers to undertake a right obligatory upon him that he cannot fulfill is not blameworthy asking. 6 - In it: That honoring a guest is not only by feeding food, but includes other things like welcoming him, entertaining him with conversation, and others in which people differ from one society to another. The poet said: The fire if lit is the text of generosity ... And the other text is what is available of food. 7 - In it: That the host should show his guest what reassures the guest that it did not cause him hardship, even if the matter is contrary to that. 8 - In it: That altruism (Ithar) is among the best morals and virtues of deeds, and it is,",
    "foot_note": "None",
    "book_id": "196",
    "new_page_number": 23
  },
  {
    "serial_number": "7493542",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "with poverty, greater and more majestic. 9 - In it: That a person's soul may aspire to acquire virtues, but he may need a helper in some of them. If he finds one, let him hold on to them and not neglect them, for their existence is rare. 10 - In it: That a person showing actions contrary to reality is not considered blameworthy lying if it is for an interest requiring it. 11 - In it: The virtue of patience and its great reward. Their patience with hunger despite their ability to be full, their patience with the pain squeezing their hearts when seeing their children spending the night hungry, indeed they are the ones putting them to sleep, and the wife's patience with her husband who brought her all these burdens. All this while they did not know that this deed of theirs would be a reason for immortalizing their mention in the best of Books and on the tongue of the best of Messengers. And what is with Allah is better and more enduring. 12 - In it: Affirmation of two attributes of Allah Almighty: Wonder and Laughter. * * *",
    "foot_note": "None",
    "book_id": "196",
    "new_page_number": 24
  },
  {
    "serial_number": "7493543",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "A Section from it: 17 - Among the beauties of marital life is that the couple exchanges beneficial conversations and useful stories. Al-Bukhari and Muslim narrated in their Sahihs from Aisha (may Allah be pleased with her) who said: \"The Prophet (peace and blessings be upon him), when he prayed the two Rak'ahs of Fajr, if I was awake he would talk to me, otherwise he would lie down.\" (1) 18 - And here is the Mother of Believers Aisha (may Allah be pleased with her) narrating to the Messenger of Allah (peace and blessings be upon him) a strange news about women's evaluation of their husbands, and the Messenger (peace and blessings be upon him) listens to her and comments on her speech. Al-Bukhari and Muslim narrated in their Sahihs from the hadith of Aisha (may Allah be pleased with her) who said: Eleven women sat and promised and covenanted that they would not conceal anything of the news of their husbands. The first said: My husband is flesh of a lean (2) camel on top of a mountain; it is not easy so it can be climbed, nor fat so it can be moved (3).",
    "foot_note": "1. Sahih Al-Bukhari number (1161), and Sahih Muslim number (743) and the wording is his. \n2. i.e., like camel meat in badness, not like sheep meat. It is intended to exaggerate the lack of benefit, disinterest in it, and aversion of nature to it. \n3. It is intended to exaggerate his arrogance and bad character, so he cannot be reached except with extreme difficulty, and he does not benefit his wife in companionship or otherwise despite being disliked and bad. The meaning of 'nor moved' is that people do not move it to their homes to eat it after enduring the fatigue and hardship of reaching it, but rather turn away from it due to its badness. In summary, she described him as miserly, bad, arrogant towards his family, and ill-tempered.",
    "book_id": "196",
    "new_page_number": 25
  },
  {
    "serial_number": "7493544",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "The second said: My husband, I do not spread (1) his news, I fear I will not leave him (2). If I mention him, I mention his Ujar and Bujar (3). The third said: My husband is the 'Ashannaq (4). If I speak, I get divorced (5). If I stay silent, I get suspended (6). The fourth said: My husband is like the night of Tihama (7). Neither heat nor cold (8). Neither fear nor boredom. The fifth said: My husband, if he enters, becomes a leopard (9). If he goes out, he becomes a lion (10). And he does not ask",
    "foot_note": "1. i.e., I do not reveal and broadcast it. \n2. i.e., she fears if she mentions him he will divorce her. I say: Rather the correct view is that the pronoun refers to the news, meaning if I start the news I fear I won't finish it due to its abundance. Comment of Sheikh Nasir al-Din al-Albani (may Allah have mercy on him). \n3. With Damma on the first and Fatha on the second, meaning all his faults, visible and hidden. Ujar: plural of 'ujrah, which is a swelling in the neck veins. Bujar: plural of bujrah: the navel. She means: I do not delve into mentioning his news, for I fear from mentioning it discord, separation, and loss of children and family. \n4. With Fatha on 'Ayn and Shin, and Nun open and stressed. It is the tall one whose height is disliked, slender, and ill-tempered. \n5. i.e., if I speak of his faults in detail, he divorces me for his bad temper, and I do not like divorce for the sake of my children from him, or for my need of him. \n6. i.e., and if I stay silent about his faults, he makes me suspended, which is the woman who is neither married to a benefiting husband nor divorced expecting to marry. \n7. In perfect moderation, lack of harm, and ease of his affair. Tihama: Mecca and its surroundings. \n8. A metaphor for lack of harm due to his noble character and the establishment of all kinds of pleasure in his company. \n9. i.e., if he enters upon her, he leaps like a leopard for intercourse. Or 'Fahida' man: slept a lot like a leopard. \n10. And if he goes out from her or mixes with people, he acts like a lion.",
    "book_id": "196",
    "new_page_number": 26
  },
  {
    "serial_number": "7493545",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "about what he promised (1). The sixth said: My husband, if he eats, he eats excessively (2). If he drinks, he drinks up everything (3). If he lies down, he wraps himself up (4). And he does not insert his palm to know the grief (5). The seventh said: My husband is Ghayaya' (6) or 'Ayaya' Tabaqa'. Every disease is his disease (7). He injures you or breaks you or combines both for you. The eighth said: My husband, the scent is the scent of Zarnab (8). And the touch is the touch of a rabbit (9). The ninth said: My husband is of high pillar, long sword-belt, great ashes, close of",
    "foot_note": "1. i.e., he does not ask about what he knew in his house of food and drink etc. out of generosity. So she described him as generous in nature, good in companionship, gentle in his house, strong and brave among his enemies, not checking what went of his wealth and belongings, and not asking about it due to the honor of his soul and generosity of his heart. \n2. i.e., ate a lot, and mixed types of food. \n3. i.e., drank the 'shufafah' which is the rest of the water at the bottom, i.e., he leaves nothing in the vessel. \n4. i.e., if he lies on his side, he wraps himself in his clothes and covers himself with a quilt alone in a corner by himself and does not touch her, so there is no benefit in him for his wife. \n5. i.e., he does not put his hand under her clothes to know her grief and sadness, so he has no compassion for her. \n6. i.e., incapable of managing his affairs due to 'Ay' (inability), or it is said he is impotent. Ghayaya': possessor of Ghayy which is error or disappointment. Tabaqa': stupid, or one whose affairs are closed upon him, or incapable of intercourse or speech. \n7. i.e., all people's faults gathered in him. (Injures you ...) i.e., either breaks his wives' heads, or breaks a limb of their limbs, or combines both for them. \n8. i.e., my husband's touch is like the touch of a rabbit in softness and smoothness. \n9. With Fatha on Zay, a type of plant with a good scent. Meaning she describes him with good character, noble companionship, and gentleness like the softness of a rabbit's touch, and compared the scent of his body or clothes to the scent of perfume. It may mean the goodness of praise for him spreading among people.",
    "book_id": "196",
    "new_page_number": 27
  },
  {
    "serial_number": "7493546",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "house to the club (Nad) (1). The tenth said: My husband is Malik (2). And what is Malik? Malik is better than that. He has camels of many kneeling places (3), few pastures (4). If they hear the sound of the Mizhar (lute), they become certain they are perishing (5). The eleventh said: My husband is Abu Zar' (6). And what is Abu Zar'? He made my ears swing (7) with jewelry (8). And filled my upper arms with fat (9). And pleased me so I became pleased with myself (10).",
    "foot_note": "1. 'Imad (Pillar) originally means pillars upon which houses stand; she used it metaphorically for his high status and noble lineage. Nijad with Kasra on Nun: sword suspenders. She used it metaphorically for tall stature, indicating he is a sword owner, thus pointing to his bravery. Ashes is a metaphor for abundant generosity necessitating frequent hospitality, necessitating much ash and continuous fire burning. Nad is originally Nadi, the Ya was dropped for rhyming. Nadi: The place where the notables of the people gather for consultation and conversation. This is the way of the generous; they place their houses near the club to expose themselves to those who would be their guests. \n2. i.e., his name is Malik. Better than that: i.e., better than what I will say about him, hinting he is above description in generosity and magnanimity. \n3. Plural of Mabrak, place of camels kneeling. \n4. i.e., his camels are many when kneeling, so if they go to pasture they are few because many of them are in their kneeling places for guests, or he leaves them beside the house so if guests descend upon him they are present. \n5. i.e., if the camels hear the sound of the Oud being played, they become certain they will be slaughtered for guests due to his generosity. \n6. She nicknamed him that for his abundant crops (Zar'), and it is possible she nicknamed him that out of optimism for many children, Zar' meaning child. \n7. Weight of 'Aqama', from Naws which is movement while hanging. \n8. Meaning he moved her ears due to what he adorned them with. \n9. Made me fat. \n10. Meaning: He made me happy so my soul rejoiced.",
    "book_id": "196",
    "new_page_number": 28
  },
  {
    "serial_number": "7493547",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "He found me among people of few sheep in Shiqq (1). So he placed me among people of neighing, groaning, threshing, and purifying (2). With him I speak and am not criticized (3). I sleep and wake up in the morning (4). I drink and quench my thirst (5). Mother of Abu Zar', what is the mother of Abu Zar'? (6): Her sacks are heavy (7). And her house is spacious (8). Son of Abu Zar', what is the son of Abu Zar'? (9): His sleeping place is like a drawn palm-stick (10). And satiates him",
    "foot_note": "1. Diminutive for fewness, i.e., people of few sheep. Shiqq with Fatha and Kasra, possibly a place name or meaning hardship, as in His saying: {Bi-shiqqi al-anfus} [Surah An-Nahl: 7]. Meaning: He found me among people of few sheep, so they were in effort, hardship, and [difficult] living. \n2. i.e., he carried me to people of horses with neighing, camels with groaning. Neighing: sound of horses. Groaning: sound of camels. And cows threshing the crop in its threshing floor to extract grain from the ear. Munaqqin with Damma on Mim, Fatha on Nun, and stressed Qaf: one who purifies the grain and cleans it from straw etc. after threshing with a sieve etc. So they are owners of crops and clean grain. The meaning of all this: She was among people of scarcity and hardship, so he moved her to people of wealth and abundance, being owners of horses, camels, etc. \n3. i.e., I speak with him with any speech and he does not attribute ugliness to me due to my honor with him and my good speech to him. \n4. i.e., I sleep and enter the morning, and he is gentle with me and does not wake me for his service or work, because I am beloved to him and sufficed by servants who serve him and me. \n5. i.e., I quench my thirst and leave water due to its abundance with him, despite its scarcity with others. Meaning: She did not suffer from him, neither regarding sleeping nor drinking. I say: In Al-Nihayah: \"She meant she drinks until she is quenched and raises her head. It is said: Qamaha the camel Yaqmahu if it raises its head from water after quenching thirst. It is also narrated with Nun.\" \n6. She wanted to praise her husband's mother after praising her husband. \n7. i.e., her sacks and food containers are huge, heavy, numerous. 'Ukum plural of 'Ikm which is the sack if it contains goods. Radah: with Fatha on Ra': huge, heavy, numerous. \n8. With Fatha on Fa', i.e., wide. The spaciousness of the house indicates the abundance of wealth. \n9. She moved to praising the son of Abu Zar'. \n10. i.e., his sleeping place is like Masall: with Fatha on first and second, meaning drawn. Shatbah: with Fatha on Shin and Sukun on Ta', which is what is stripped or split from palm branches, i.e., the frond. Meaning the place of his lying, which is the side, is like a strip drawn from the branch in thinness; he is light in flesh, slender in waist like the strip drawn from its peel.",
    "book_id": "196",
    "new_page_number": 29
  },
  {
    "serial_number": "7493548",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "the leg of a young goat (1). Daughter of Abu Zar', what is the daughter of Abu Zar'? Obedient to her father and obedient to her mother (2). Filling her clothes (3). And rage of her neighbor (4). Maid of Abu Zar', what is the maid (5) of Abu Zar'? She does not spread our talk spreading (6). Nor does she waste our provision wasting (7). Nor does she fill our house with nests (8). She said: Abu Zar' went out (9) while the milk skins were being churned (10). He met a woman with two children",
    "foot_note": "1. With Damma on Ta because it is from satisfaction. Al-Jafrah with Fatha on Jim and Sukun on Fa is the female kid goat. The meaning is that he is slender, slim, with little flesh consistently, which is the way of the noble. \n2. i.e., she is obedient to her father and mother with utmost obedience. \n3. i.e., filling her clothes due to her hugeness and fatness, which is praiseworthy in women. \n4. Meaning her co-wife; she enrages her co-wife due to her jealousy of her because of her excessive beauty. \n5. i.e., his servant. \n6. Meaning she does not spread our words we speak among ourselves, due to her religiousness. \n7. i.e., she does not transport our food transporting due to her trustworthiness and maintenance. Tunaqqith with Fatha on Ta, Damma on Qaf, and Nun is silent [Note: text says Damma on Qaf but usually Tashdid]. Meaning: does not transport. Mirah: with Kasra on Mim: Food. \n8. i.e., she does not make our house full of garbage and sweepings until it becomes like a bird's nest, but fixes and cleans it due to her cleverness. \n9. Went out for a journey one day. \n10. i.e., while the Awtab (milk skins, plural of Watb) were being churned (Tumkhad, passive voice) to extract butter from milk. Meaning he went out during the time of abundant milk, which is the time Arabs go out for trade.",
    "book_id": "196",
    "new_page_number": 30
  },
  {
    "serial_number": "7493549",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "like two leopards (1), playing under her waist with two pomegranates (2). So he divorced me and married her. I married after him a noble man (3). He rode a tireless horse (4). And took a linear spear (5). And brought back (*) to me many livestock (6). And gave me a pair of every scenting animal (7). He said: Eat, Umm Zar', and provide for your family (8). But if I gathered everything he gave me, it would not reach the smallest vessel of Abu Zar'. Aisha (may Allah be pleased with her) said: The Messenger of Allah (peace and blessings be upon him) said to me: \"I was to you like Abu Zar' to Umm Zar'.\" (9) (10). Ibn Hajar (may Allah have mercy on him) said: \"It is as if he (peace and blessings be upon him) said that to comfort her and reassure her heart and to dispel the illusion of generalizing the similarity to all of Abu Zar's conditions, since there was nothing in him that women dislike except that (divorce), and this was explicitly stated. She answered him with an answer",
    "foot_note": "1. i.e., like them in leaping, playing, and speed of movement. \n2. i.e., having two small breasts like pomegranates, so her two children play with her breasts resembling pomegranates. \n3. i.e., from the nobles and elites. \n4. i.e., a horse that persists in its run without fatigue. \n5. Which is the spear attributed to Al-Khatt, a village on the coast of the sea of Oman where spears are made. (*) I say: The original is Rah (went/rested), which is a mistake contrary to what is in the Two Sahihs and Al-Nihayah [Correct word is 'Araha' meaning brought back livestock in the evening]. \n6. i.e., he made enter upon me at the time of Rawah (afternoon), or put into the pen (Murah). An-Na'am: Camels, sheep, cows. Thariyya: from Tharwa meaning abundant wealth. \n7. Gave her from every animal going to his house at the time of Rawah a pair, two by two. \n8. i.e., the husband who married her after Abu Zar' said: Eat whatever you wish and give to your relatives. \n9. Sahih Al-Bukhari number (5189), and Sahih Muslim number (2448) and the wording is his. \n10. The hadith in full with meanings of words is quoted from Mukhtasar Al-Shama'il Al-Muhammadiyyah edited by Sheikh Muhammad Nasir al-Din al-Albani (may Allah have mercy on him), pp. (134-142).",
    "book_id": "196",
    "new_page_number": 31
  },
  {
    "serial_number": "7493550",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "like hers in virtue and knowledge\" (1). In Al-Tabarani's narration he said: \"O Aisha, I was to you like Abu Zar' to Umm Zar', except that Abu Zar' divorced, and I do not divorce.\" (2) In another narration: I said: \"O Messenger of Allah, you are better to me than Abu Zar' to Umm Zar'.\" (3) 19 - It is often said: Behind every great man is a woman. Is this saying correct? And how so? Answer: Look at this story. The Wisest of Arab Women: Al-Harith bin Awf said one day to Kharijah bin Sinan Al-Murri: Do you think I would propose to anyone and he would reject me? He said to him: Yes! He said: Who is that? He said: Aws bin Harithah bin Lam Al-Ta'i. So Al-Harith said to his servant: Let us travel. So he did, and they rode until they came to Aws bin Harithah bin Lam Al-Ta'i and found him in the courtyard of his house. When he saw Al-Harith bin Awf, he said: Welcome, O Harith. He said: And you. He said: What brought you? He said: I came to you as a suitor. He said: You are not there (i.e., not acceptable). So he turned away and did not speak to him. Aws entered upon his wife angry, and she was from 'Abs. She said: Who is the man standing by you who did not stay long, and whom you did not speak to? He said: That is the master of the Arabs, Al-Harith bin Awf. She said: So why didn't you ask him to dismount? He said: He acted foolishly! She said:",
    "foot_note": "1. Fath Al-Bari (9/275). \n2. Al-Mu'jam Al-Kabir by Al-Tabarani (23/173) number (270), and authenticated by Sheikh Al-Albani (may Allah have mercy on him) as in Sahih Al-Jami' Al-Saghir number 141. \n3. Sunan Al-Nasa'i Al-Kubra (9138).",
    "book_id": "196",
    "new_page_number": 32
  },
  {
    "serial_number": "7493551",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "How? He said: He came to me proposing! She said: Do you want to marry off your daughters? He said: Yes. She said: If you don't marry off to the master of the Arabs, then to whom? He said: It has happened. She said: Then rectify what came from you. He said: By what? She said: Catch up to him and bring him back. He said: How, when it has already escaped me? She said: Say to him: You met me while I was angry about a matter in which you did not present a word beforehand, so I had no answer for it except what you heard. Return, and you shall have from me whatever you like. For he will do so. So he rode after them. Kharijah bin Sinan said: By Allah, I was traveling with Al-Harith when I turned and saw Aws. So I turned to Al-Harith - who was not speaking to me out of grief - and said: Aws bin Harithah is following us. He said: What should we do with him? Continue. When he saw we were not stopping for him, he shouted: Harith, wait for me a moment. So I spoke to him with those words, and he returned happy. Aws entered his home and said to his wife: Call so-and-so for me - meaning his eldest daughter. She came to him. He said: O daughter, this is Al-Harith bin Awf, a master of the masters of the Arabs. He came to me proposing and I wanted to marry you to him, what do you say? She said: Do not do it. For I am a woman with ugliness in my face, and some sharpness - fault - in my character. I am not his cousin so he would respect my kinship, and he is not your neighbor in the land so he would be shy of you. I am not safe if he sees from me what he dislikes that he will divorce me. He said the same to the middle one and she answered like the eldest... So he called the youngest and presented the matter to her. She said: It is up to you. He said: I presented that to your two sisters and they refused. She said - and he did not mention their words to her -: But I, by Allah, am beautiful of face, skilled of hand, noble of character, of noble father. If he divorces me, Allah will not replace him with good. He said: May Allah bless you. Then he went out to Al-Harith and said: I marry you, O Harith, to my daughter Buhaysah bint Aws. He said: I accept. He ordered her mother to prepare her and fix her affairs, then ordered a tent to be set up for them. Then he sent her to him... The narrator Kharijah bin Sinan said: When Buhaysah was brought in to him, he stayed a little while then came out. I said: Are you done with your affair? He said: No, by Allah. Kharijah bin Sinan said: How? He said: When I entered upon her she said: Stop, in the presence of my father",
    "foot_note": "None",
    "book_id": "196",
    "new_page_number": 33
  },
  {
    "serial_number": "7493552",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "and brothers? This, by Allah, cannot be... So he ordered the mounts and they departed... When they traveled what Allah willed, Al-Harith said to Kharijah: Go ahead. Kharijah said: So I went ahead, then Al-Harith turned with his wife off the road... And soon he caught up with me. I said: Are you done? He said: No, by Allah. I said: Why? He said: She said to me: Is it as done with the captured slave girl or the taken captive? No, by Allah! Until camels are slaughtered and sheep are sacrificed, and the Arabs are invited, and what is done for the likes of me is done. I said: By Allah, I see determination and intellect, and I hope she will be fertile/productive. Al-Harith fell silent. Kharijah said: So we traveled until we reached our homes. He brought camels and sheep, then entered upon her. And soon he came out to me. I said: Are you done? He said: No. I said: Why? He said: I entered upon her and she said: By Allah, honor was mentioned to me that I do not see in you? I said: How? She said: Do you devote yourself to women while Arabs are killing each other!! (Meaning: The war was in its beginning between 'Abs and Dhubyan). I said: So what should be? She said: Go out to the people and make peace between them, then return to your family, for what you want will not escape you. Al-Harith said: Let's go out, O Kharijah. So we went out until we came to the people and walked between them for peace. They agreed to count the dead, blood money for every man. So we bore three thousand camels in three years, and returned with the most beautiful mention. Zuhair bin Abi Sulma praised Al-Harith with the famous poem: \"Is there from Umm Awfa a trace that did not speak ... In Hawmanat Al-Darraj then Al-Mutathallam\" (1) Shurayh and the Tamimi Woman: Judge Al-Mu'afi bin Zakariya narrated with his chain to Al-Sha'bi who said: Shurayh said to me: O Sha'bi! Stick to the women of Banu Tamim, for they are the Women! I said: How is that? He said:",
    "foot_note": "1. Al-Tadhkira Al-Hamduniyyah (2/38).",
    "book_id": "196",
    "new_page_number": 34
  },
  {
    "serial_number": "7493553",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "I returned one day from a funeral purified, and passed by a tent. There was an old woman with a young girl (Ra'ud) (1). I asked for water. She said: Which is more pleasing to you, milk or water? I said: Milk is more pleasing to me. She said: O daughter, give him milk to drink for I think he is a stranger. She gave me drink. When I drank I said: Who is this girl? She said: This is Zaynab bint Hudayr, one of the women of Banu Tamim, then from Banu Hanzalah, then from Banu Tuhayya. I said: Will you marry her to me? She said: Yes, if you are compatible. So I returned to my house, refrained from the midday nap. When I prayed Zuhr, I sent for my trustworthy brothers Masruq bin Al-Ajda' and Al-Aswad bin Yazid. I prayed Asr then went to her uncle who was in his mosque. When he saw me he moved aside for me from his seat. I said: You are more deserving of your seat and we are seekers of a need. He said: Welcome O Abu Umayyah, what is your need? I said: I mentioned Zaynab, your brother's daughter. He said: By Allah, she has no dislike for you, and you are not falling short of her. He said: And I spoke and he married me. Then I left. I didn't reach my house until I regretted and said to myself: What have I done? I thought to send her divorce. Then I said: I will not combine two foolishnesses, but I will join her to me. If I see what I like I praise Allah, and if it is the other I divorce her. So I sent her dowry and honor. When she was brought to me and the women stood away from her, I said: O you, it is from the Sunnah that if a woman is brought to her husband, they pray two Rak'ahs behind him and ask Allah Almighty for blessing. So I stood praying and she was behind me. When I finished I returned to my place and extended my hand. She said: Gently. I said: One of them, by the Lord of the Kaaba. She said: Praise be to Allah and blessings of Allah upon our master Muhammad and his family. Afterwards, I am a stranger woman, and by Allah I have not ridden a mount more difficult for me than this. You are a man whose character I do not know, so tell me what you like and what you dislike so I avoid it. I say this saying of mine and ask Allah forgiveness for me and you. He said: So I said: Praise be to Allah and blessings of Allah upon Muhammad and his family. Afterwards, you have come",
    "foot_note": "1. In the prime of her youth.",
    "book_id": "196",
    "new_page_number": 35
  },
  {
    "serial_number": "7493554",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "to the family of your husband's house as master of their men, and you, God willing, are mistress of their women, whether they like this or hate it. She said: Tell me about your in-laws, do you like them to visit you? I said: I am a judge, so I hate that they bore me and I hate that they cut me off. He said: So I stayed with her for a year, and every day I was more pleased with her than the day that passed. I returned one day from the session of judgment and found an old woman ordering and forbidding in my house. I said: Who is this, O Zaynab? She said: This is your mother-in-law, this is my mother. I said: How are you, O you? She said: How are you O Abu Umayyah, and how do you find your wife? I said: All good. She said: A woman is never worse in character than in two situations: if she gives birth to a boy, and if she gains favor with her husband. So if you doubt your wife, then the whip. I said: I bear witness that she is your daughter; you have sufficed me the training and perfected the discipline. She used to come to me once every year and advise me with this advice then leave. I stayed with her for twenty years; I never got angry with her a single day or night except one day, and I was unjust to her. That is, I prayed the two Rak'ahs of Fajr and saw a scorpion. I hurried to kill it but covered it with a vessel and said: O Zaynab, beware the vessel. I went out to prayer. She hurried to the vessel and moved it, so the scorpion stung her. If you saw me, O Sha'bi, sucking her finger and reciting Al-Mu'awwidhatayn over her. I had a neighbor called Qais bin Jarir, who used to beat his wife constantly. So upon that I used to say: I saw men beating their women ... May my right hand be paralyzed when I beat Zaynab. Zaynab is a sun and women are stars ... When she rises she leaves none of them a star. And I am the one who says: If Zaynab's family visited her ... I gathered and honored her visitors. And if she visited them I visited her ... Even if I had no desire for her house (1).",
    "foot_note": "1. Tahdhib Tarikh Ibn Asakir (6/315 - 316).",
    "book_id": "196",
    "new_page_number": 36
  },
  {
    "serial_number": "7493555",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "Section: On Explaining Some Landmarks That Aid in Understanding the Purposes of Marriage and Ways to Achieve Them. Allah Almighty said: {It is He who created you from one soul and created from it its mate that he might dwell in security with her} [Surah Al-A'raf: 189]. And He said: {And of His signs is that He created for you from yourselves mates that you may find tranquility in them; and He placed between you affection and mercy} [Surah Ar-Rum: 21]. Let us contemplate His saying: {that he might dwell in security with her}, and His saying: {that you may find tranquility in them}. What is this dwelling (Sakan)? How is the tranquility? What are its effects on the life of the couple? And what is the duty to do? It is said in Al-Qamus: Sakan is everything one dwells in and finds tranquility in, of family and others (1). In these two noble verses, Allah Almighty specified the wife with that, making her the dwelling for her husband. Tranquility is reassurance and comfort. This great word has included wide meanings encompassing almost all aspects of life. Look at the state of normal people when they are outside their dwellings and what constraint is required of them in controlling speech, dress, movement, and stillness. Then look at them",
    "foot_note": "1. (35/199) Taj Al-Arus min Jawahir Al-Qamus.",
    "book_id": "196",
    "new_page_number": 37
  },
  {
    "serial_number": "7493556",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "when they return to their dwellings, how that constraint disappears from them in their eating, drinking, sleeping, and other things due to the reassurance and relaxation they obtain. Likewise, the wife is the dwelling for her husband. When she is like that, she is acting according to the wisdom of the Creator - Exalted be He - and He has created her prepared for that. So let her praise Allah and increase in thanking Him. Allah Almighty said: {It has been made lawful for you the night preceding fasting to go to your wives [for sexual relations]. They are clothing for you and you are clothing for them} [Surah Al-Baqarah: 187]. In His saying: {They are clothing for you and you are clothing for them} is a great meaning the couple must pay attention to and act according to, and it is a mutual right between them. The explanation of that is that clothing has three great purposes: First: Covering what one is shy to reveal. Second: Protection from heat, cold, and the like. Third: Beautification. Allah Almighty said: {O children of Adam, We have bestowed upon you clothing to conceal your private parts and as adornment. But the clothing of righteousness - that is best. That is from the signs of Allah that perhaps they will remember} [Surah Al-A'raf: 26]. And 'Riyash' (adornment/feathers) is what one beautifies oneself with in addition to covering private parts and protection from harms. If we understand this, let us know that each of the spouses needs these three from the other. The greatest of them: 1 - Covering: The spouses must cover each other and not reveal",
    "foot_note": "None",
    "book_id": "196",
    "new_page_number": 38
  },
  {
    "serial_number": "7493557",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "about him what harms him to be revealed, nor spread a secret of his. 2 - To protect him with themselves from harms that hurt him, like clothing protects from heat and cold. 3 - Then to ascend after that so that each of them is like adornment for the other, beautifying him and showing his virtues. And Allah Almighty said: {But the men have a degree over them} [Surah Al-Baqarah: 228]. Under this noble sentence fall great meanings and majestic wisdoms, except that benefiting from them is based on believing in them, submitting to them, and correct understanding of what they indicate. Here is the explanation: 1 - It must be known that the Creator of creation - Exalted be He - has profound wisdom in His creation and command. He composed men with a constitution fitting what they were tasked with, and composed women with a constitution fitting what they were created for. So whoever is guided to what they were created for succeeds in both abodes and attains both happinesses. And whoever is not guided, it is evidence of the reversion of their nature and consequently corruption of thought and action. 2 - Allah explained in another verse what was summarized in this verse, saying: {Men are in charge of women by [right of] what Allah has given one over the other and what they spend from their wealth} [Surah An-Nisa: 34]. In this verse, Allah mentioned the reason for placing qawamah (guardianship/authority) in the man - and qawamah is the 'degree' in the previous verse - and that is for two reasons: First: Returning to the origin of creation upon which Allah created humans. In the Blessed Revelation is His saying: {And the male is not like the female} [Surah Ali 'Imran:",
    "foot_note": "None",
    "book_id": "196",
    "new_page_number": 39
  },
  {
    "serial_number": "7493558",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "36]. It is certain that if man and woman were of one creation and one nature, harmony would not occur between them, and repulsion would occur. Evidence of that is apparent in those whose natures are reversed and concepts corrupted. Second: Spending: which is paying the dowry. Allah created creation with an innate disposition for that, and the Sharia came confirming that the man is the one who pays the dowry to the woman even if she is the richest of people. It is not permissible for a woman to gift herself to anyone without a dowry except the Messenger of Allah (peace and blessings be upon him), and that is one of his specific characteristics. 3 - It is known that spending on the wife is upon her husband even if she is rich. The man is more capable of that, and nothing is lost due to his undertaking the earning of sustenance. As for the woman, if she went to earn sustenance, great harm and corruption would occur from her neglect of her function, which is household affairs, raising children, and caring for the husband. The man is capable of things the woman is not capable of, and the woman is capable of things the man is not capable of. By each performing their function, complementarity is achieved and life becomes upright. Unless it is said that the woman performs the man's function and the man performs the woman's function, or one of them performs both functions, which all rational people know is corrupt and causes great harm. 4 - It should be known that the woman's function - which is undertaking household affairs, raising generations, caring for the husband's affairs, and preparing herself for what he needs - is a noble function not less in degree than the man's function, rather it may exceed it, and it suits her creation and nature.",
    "foot_note": "None",
    "book_id": "196",
    "new_page_number": 40
  },
  {
    "serial_number": "7493559",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "As for the man, he cannot do it because it does not suit the constitution Allah created him with. The poet said well: The mother is a school; if you prepare her ... you prepare a people of good lineage. And they said: Behind every great man is a woman. In any case, our speech is with those whose nature is sound and concepts are correct. As for others, they have other methods of treatment not in this place. * * *",
    "foot_note": "None",
    "book_id": "196",
    "new_page_number": 41
  },
  {
    "serial_number": "7493560",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "Section: Pillars of Marital Coexistence Pillars of marital coexistence. Allah Almighty said: {And live with them in kindness} [Surah An-Nisa: 19]. Marital coexistence rests on three matters: Affection, Mercy, and Upholding the Limits of Allah. Allah Almighty said: {And of His signs is that He created for you from yourselves mates that you may find tranquility in them; and He placed between you affection and mercy} [Surah Ar-Rum: 21]. And He said: {And if he has divorced her [for the third time], then she is not lawful to him afterward until [after] she marries a husband other than him. And if the latter husband divorces her [or dies], there is no blame upon the woman and her former husband for returning to each other if they think that they can keep [within] the limits of Allah. These are the limits of Allah, which He makes clear to a people who know} [Surah Al-Baqarah: 230]. And He said: {And it is not lawful for you to take anything of what you have given them unless both fear that they will not be able to keep [within] the limits of Allah. But if you fear that they will not keep [within] the limits of Allah, then there is no blame upon either of them concerning that by which she ransoms herself. These are the limits of Allah, so do not transgress them. And whoever transgresses the limits of Allah - it is those who are the wrongdoers} [Surah Al-Baqarah: 229]. If these three combine for the couple, they attain worldly happiness, and happiness in the Hereafter is hoped for them. The marriage contract is one of the greatest contracts that must be fulfilled. Allah Almighty said: {O you who have believed, fulfill [all] contracts} [Surah Al-Ma'idah: 1]. And Allah called it a solemn covenant, saying: {And they have taken from you a solemn covenant} [Surah An-Nisa: 21]. Al-Bukhari and Muslim narrated in their Sahihs from the hadith of Uqbah bin Amir",
    "foot_note": "None",
    "book_id": "196",
    "new_page_number": 42
  },
  {
    "serial_number": "7493561",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "- may Allah be pleased with him - that the Prophet (peace and blessings be upon him) said: \"The conditions most worthy to be fulfilled are those by which you have made sexual relations lawful.\" (1) The marriage contract in Islam is a contract of choice, not compulsion. Al-Bukhari narrated in his Sahih from the hadith of Abu Hurairah (may Allah be pleased with him), he said (peace and blessings be upon him): \"A previously married woman should not be married until she is consulted, and a virgin should not be married until her permission is sought.\" They said: \"O Messenger of Allah, and how is her permission?\" He said: \"That she remains silent.\" (2) Therefore, Allah facilitated the matter of separation between spouses when marital life becomes impossible. If the husband does it [it is divorce], otherwise it is permissible for the woman to ransom herself and there is no blame on her for that. Allah Almighty said: {But if you fear that they will not keep [within] the limits of Allah, then there is no blame upon either of them concerning that by which she ransoms herself} [Surah Al-Baqarah: 229]. Or the Shar'i judge rules for separation between them. But it must be known that this solemn contract cannot be dissolved except by the absence of these three matters which are the pillars of marital coexistence. If affection is absent between them, the bond of mercy and upholding the limits of Allah remains. If mercy is also absent, the bond that each obeys Allah regarding the other remains. It is narrated that a man said to his wife during the time of Umar (may Allah be pleased with him): \"I adjure you by Allah, do you love me?\" She said: \"As for since you adjured me by Allah, then no.\" He went out until he came to Umar. He sent for her and said: \"Are you the one who says to her husband: I do not love you?\" She said: \"O Commander of the Faithful, he adjured me by Allah, should I lie?\" He said: \"Yes, lie to him. Not all houses are built on love, but people live together by Islam and lineages (Ahsab).\" (3)",
    "foot_note": "1. Sahih Al-Bukhari number (5151), and Sahih Muslim number (1418). \n2. Sahih Al-Bukhari number (5136), and Sahih Muslim number (1419). \n3. Sharh As-Sunnah by Al-Baghawi (13/120).",
    "book_id": "196",
    "new_page_number": 43
  },
  {
    "serial_number": "7493562",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "Perhaps when each obeys Allah regarding the other, Allah will reconcile their hearts and affection and mercy will return. For one of the most beloved deeds to Satan is separating spouses due to the corruption and harms resulting from it. Enemies of Islam, when they want to corrupt a country and destroy a nation, plant in it the causes that result in the separation of spouses and consequently the scattering of families and destruction of homes. Muslim narrated in his Sahih from the hadith of Jabir (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings be upon him) said: \"Iblis places his throne upon the water, then sends his detachments. The closest of them to him in rank is the greatest of them in fitnah (causing trial/corruption). One of them comes and says: 'I did such and such.' He says: 'You have done nothing.' He said: Then one of them comes and says: 'I did not leave him until I separated him and his wife.' He said: So he brings him close to him and says: 'Yes, you [are the one]'.\" Al-A'mash said: I think he said: \"And he embraces him.\" (1) And Imam Ahmad narrated in his Musnad from the hadith of Ibn Umar (may Allah be pleased with them both) that the Prophet (peace and blessings be upon him) said: \"By the One in Whose Hand is the soul of Muhammad, two people do not love each other then get separated except due to a sin one of them commits.\" (2) So if these pillars are absent, then in this case no bond remains to unite them, and separation becomes specific. Allah Almighty said: {But if they separate [by divorce], Allah will enrich each [of them] from His abundance. And ever is Allah Encompassing and Wise} [Surah An-Nisa: 130]. It must be noted that many cases of separation occur based on one spouse evaluating the other with an unjust evaluation in which the person does not adhere to justice and fairness. Therefore, when the cloud of passion clears, he regrets when regret is of no use.",
    "foot_note": "1. Number (2813). \n2. Fragment of a hadith in Musnad Imam Ahmad (9/259) number (5357), and its investigators said: Authentic hadith.",
    "book_id": "196",
    "new_page_number": 44
  },
  {
    "serial_number": "7493563",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "The Balance and Justice in Evaluating the Wife: It was previously mentioned in the purposes of marriage the definition of mutual rights and duties between spouses, and that keeping this in mind when evaluating one spouse by the other makes a person just in his judgment and fair to himself. We add clarification here by mentioning some matters that make a man's evaluation of his wife just and correct. Allah Almighty said: {And live with them in kindness. For if you dislike them - perhaps you dislike a thing and Allah makes therein much good} [Surah An-Nisa: 19]. Al-Bukhari and Muslim narrated in their Sahihs from the hadith of Abu Hurairah (may Allah be pleased with him) that the Prophet (peace and blessings be upon him) said: \"Treat women well, for they were created from a rib, and the most crooked part of a rib is its upper part. If you go to straighten it, you will break it, and if you leave it, it will remain crooked. So treat women well.\" (1) And Muslim narrated in his Sahih from the hadith of Abu Hurairah (may Allah be pleased with him) that the Prophet (peace and blessings be upon him) said: \"A believing man should not hate a believing woman. If he dislikes a characteristic in her, he is pleased with another.\" Or he said: \"other than it.\" (2) From these verses, hadiths, and others, it becomes clear that justice must be observed in evaluating the wife. This is known to every Muslim, but what might be hidden is its application. If a man marries a woman wanting from her all the previously mentioned purposes of marriage: Offspring, Service, and Pleasure, then when wanting to evaluate her, he must look at these three collectively, not each one separately. If he looks at them collectively and",
    "foot_note": "1. Sahih Al-Bukhari number (5186), and Sahih Muslim number (1466). \n2. Number (1467).",
    "book_id": "196",
    "new_page_number": 45
  },
  {
    "serial_number": "7493564",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "the wife deserves one-third (33%) at least for each one, the total results in a full score. Whereas if he looks at each one separately, he despises that evaluation and judges her as a failure definitely, and the reason is that wrong view. If he kept in mind what the previous verses and hadiths indicated, he would not fall into that error. This is further clarified by the fact that if a man wants only two out of three from the woman, for example, then one-third of the score is not enough to raise the wife's level. Likewise if he wants only one of those purposes. Thus, the difference becomes clear between the woman performing these three purposes and her being asked to perform only some of them. Therefore, when the Prophet (peace and blessings be upon him) proposed to Umm Salamah, she initially excused herself saying she had children. She meant by offering this excuse - and Allah knows best - that she would be busy with them from fully performing the right of the Messenger of Allah (peace and blessings be upon him). And that indeed happened. Muslim narrated in his Sahih from the hadith of Umm Salamah (may Allah be pleased with her) who said: The Messenger of Allah (peace and blessings be upon him) sent Hatib bin Abi Balta'ah (may Allah be pleased with him) to propose to me for him. I said: I have a daughter and I am jealous. He said: \"As for her daughter, we pray to Allah to suffice her regarding her, and I pray to Allah to remove the jealousy.\" It is attested by what Imam Ahmad narrated (1) in his Musnad from the hadith of Umm Salamah (may Allah be pleased with her): That when the Prophet (peace and blessings be upon him) made the contract with her, he used to come to her. If he came, she would take Zaynab and put her in her lap to breastfeed her. The Messenger of Allah (peace and blessings be upon him) was shy and generous, so he would feel shy and return. He did that repeatedly. Ammar bin Yasir realized what she was doing, so he came one day - and Ammar was her brother from her mother - he entered upon her and snatched her from her lap and said: Leave this ugly, hateful one with whom you hurt the Messenger of",
    "foot_note": "1. Number (918).",
    "book_id": "196",
    "new_page_number": 46
  },
  {
    "serial_number": "7493565",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "Allah (peace and blessings be upon him). He said: The Messenger of Allah (peace and blessings be upon him) came and entered, turning his sight in the house saying: \"Where is Zunab (little Zaynab)? What happened to Zunab?\" She said: Ammar came and took her. He said: So he consummated the marriage with his wife, then said: \"If you wish, I will stay seven days with you, and stay seven days with (each of) the (other) women.\" (1) It is from Allah's mercy and wisdom that He lightened the legal obligations in acts of worship for women. Imam Ahmad narrated in his Musnad from the hadith of Abdur-Rahman bin Awf, he (peace and blessings be upon him) said: \"If a woman prays her five (prayers), fasts her month, guards her chastity, and obeys her husband, it will be said to her: Enter Paradise from whichever of the gates of Paradise you wish.\" (2) This is only to free her to perform these three purposes in the most perfect ways. For if a woman does that and finds a man who appreciates what she does, that would be a motivation for him to do what Allah obligated upon him, not only towards his family but towards his religion, society, and all people. Therefore they said: Behind every great man is a woman. Note: If a man wants these three purposes to be complete for him at their highest degrees, can he achieve that? Answer: Yes, because Allah Almighty, the Wise in His law, the Knower of His creation, legislated polygyny for men. He said: {Then marry those that please you of women, two or three or four} [Surah An-Nisa: 3]. If the man is qualified for that, what he desires will be completed for him from the sum of them. * * *",
    "foot_note": "1. Musnad Imam Ahmad (44/268) number (26669). \n2. Musnad Imam Ahmad (32/145) number (19403), and its investigators said: Good (Jayyid) hadith.",
    "book_id": "196",
    "new_page_number": 47
  },
  {
    "serial_number": "7493566",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "Section: Issues of Marital Coexistence One of the issues of marital coexistence where marital life becomes upright by good handling and worsens when not given the required attention is (Maintenance/Nafaqah). We chose it as an example because it occurred in the House of Prophecy and because of what is seen in reality of its effects on the union or separation of spouses, and to be an example to follow in all conditions of marital coexistence. The summary of what happened in the Prophet's house (peace and blessings be upon him) is that his wives increased their demands on him for maintenance until the situation reached the point where they asked him what he did not have. His chest tightened despite his spaciousness, so Allah revealed to him the verse of Choice (Takhyir) and his Lord commanded him to give his wives the choice between being patient with him in straitened living and hardship, or separating from them. This is evidence of the importance of this subject and that it must be given utmost care, as Allah revealed concerning it a Quran recited until the Day of Resurrection. Here are the verses, so ponder: Allah Almighty said: {O Prophet, say to your wives, \"If you should desire the worldly life and its adornment, then come, I will provide for you and give you a gracious release. But if you should desire Allah and His Messenger and the home of the Hereafter, then indeed, Allah has prepared for the doers of good among you a great reward.\"} [Surah Al-Ahzab: 28, 29]. The Messenger of Allah (peace and blessings be upon him) did what Allah commanded him and gave them the choice one by one. They (may Allah be pleased with them) were of higher status and elevated rank, so they chose Allah, His Messenger, and the Home of the Hereafter.",
    "foot_note": "None",
    "book_id": "196",
    "new_page_number": 48
  },
  {
    "serial_number": "7493567",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "Al-Bukhari and Muslim narrated in their Sahihs from the hadith of Aisha (may Allah be pleased with her) who said: When the Messenger of Allah (peace and blessings be upon him) was ordered to give his wives the choice, he started with me and said: \"I am mentioning a matter to you, so you do not have to hurry until you consult your parents.\" She said: And he knew that my parents would not order me to separate from him. She said: Then he said: \"Indeed Allah, Majestic is His Praise, said: {O Prophet, say to your wives, \"If you should desire the worldly life and its adornment, then come, I will provide for you and give you a gracious release. But if you should desire Allah and His Messenger and the home of the Hereafter, then indeed, Allah has prepared for the doers of good among you a great reward.\"}\" She said: So I said: \"Is it about this that I consult my parents? Indeed, I desire Allah, His Messenger, and the Home of the Hereafter.\" (1) She said: Then the wives of the Prophet (peace and blessings be upon him) did the same as I did. In another narration: \"No woman among them asks me except I inform her. Indeed, Allah did not send me to be obstinate nor to cause difficulty, but He sent me as a teacher and facilitator.\" (2) The Role of Fathers and Mothers in Rectifying Wives and Directing Them to Consider Their Husbands' Conditions: Muslim narrated from the hadith of Jabir bin Abdullah (may Allah be pleased with them both) who said: Abu Bakr entered asking permission to see the Messenger of Allah (peace and blessings be upon him), and found people sitting at his door, none of whom had been given permission. He said: So Abu Bakr was given permission and he entered. Then Umar came and asked permission and was given permission. He found the Prophet (peace and blessings be upon him) sitting with his wives around him, silent and gloomy. He said: So he said: I will say something to make the Prophet (peace and blessings be upon him) laugh. He said: O Messenger of Allah, if you had seen the daughter of Kharijah asking me for maintenance, I stood up to her and poked her neck. The Messenger of Allah (peace and blessings be upon him) laughed and said: \"They are",
    "foot_note": "1. Sahih Al-Bukhari number (4786), and Sahih Muslim number (1475). \n2. Sahih Muslim number (1478).",
    "book_id": "196",
    "new_page_number": 49
  },
  {
    "serial_number": "7493568",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "around me as you see, asking me for maintenance.\" So Abu Bakr stood up to Aisha poking her neck, and Umar stood up to Hafsah poking her neck, both of them saying: \"You ask the Messenger of Allah (peace and blessings be upon him) what he does not have?\" They said: \"By Allah, we will never ask the Messenger of Allah (peace and blessings be upon him) for anything he does not have.\" Then he stayed away from them for a month... the Hadith (1). The Amount of Maintenance a Woman Deserves: It is known in Sharia and custom that the husband must spend on his wife regarding housing, clothing, food, and drink. But the wife must know what is due to her from that and what is extra to the obligatory; so she does not ask him what is not obligatory on him as if it is obligatory, such that if he falls short in it she accuses him of negligence and miserliness, and if he does not fall short she does not meet him with the thanks and gratitude he deserves, thinking he only performed his duty. This issue needs elaboration which is not for this place, and we refer to it briefly (2). Allah Almighty said: {Lodge them [in a section] of where you dwell out of your means and do not harm them in order to oppress them. And if they should be pregnant, then spend on them until they give birth. Then if they breastfeed for you, give them their payment and confer among yourselves in the acceptable way; but if you are in discord, then there may breastfeed for the father another woman.} [Surah At-Talaq: 6]. And He said: {Let a man of wealth spend from his wealth, and he whose provision is restricted - let him spend from what Allah has given him. Allah does not charge a soul except [according to] what He has given it. Allah will bring about, after hardship, ease.} [Surah At-Talaq: 7]. Al-Bukhari and Muslim narrated in their Sahihs from the hadith of Aisha (may Allah be pleased with her) that the Prophet (peace and blessings be upon him)",
    "foot_note": "1. Sahih Muslim number (1478). \n2. For expansion on this issue, refer to books of Fiqh, Chapter of Maintenance.",
    "book_id": "196",
    "new_page_number": 50
  },
  {
    "serial_number": "7493569",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "said to Hind: \"Take from his wealth what is sufficient for you and your children according to what is reasonable.\" (1) Imam Ahmad narrated in his Musnad that the Prophet (peace and blessings be upon him) when asked by Mu'awiyah bin Haydah (may Allah be pleased with him): What is the right of the wife of one of us upon him? He said: \"That you feed her when you eat, clothe her when you clothe yourself, do not hit the face, do not revile, and do not forsake except in the house.\" (2) From these Sharia texts and others not mentioned, the following becomes clear to us: 1 - The amount of maintenance depends on the husband's condition of ease and difficulty, wealth and poverty. 2 - What is obligatory in maintenance is sufficiency, and whatever exceeds that is beneficence and favor that must be mentioned and not denied, and thanked and not ungratefully rejected (3). 3 - The husband must be just between himself and his wife, feeding her from what he eats and clothing her from what he wears. 4 - It is known in Sharia judiciary that if the husband cannot provide sufficient maintenance, the wife has the right to ask for separation. However, the righteous, wise woman who desires Allah and the Home of the Hereafter is the one who emulates her mothers, the Mothers of Believers, wives of the Messenger of Allah (peace and blessings be upon him) and may Allah be pleased with them. She does not burden the husband's back with what he cannot bear, nor task him with what he is unable to do, and is patient with him through hardship and tight circumstances if he is worthy of that, by",
    "foot_note": "1. Sahih Al-Bukhari number (2221), and Sahih Muslim number (1714) and the wording is his. \n2. Musnad Imam Ahmad (33/226) number (20022), and its investigators said: Its chain is Hasan. \n3. And in the Hadith: \"And I saw that most of its (Hell's) inhabitants were women.\" They said: \"Why, O Messenger of Allah?\" He said: \"Because of their ungratefulness (Kufr).\" It was said: \"Do they disbelieve in Allah?\" He said: \"They are ungrateful to the husband (Al-'Ashir), and ungrateful for kindness. If you were to be good to one of them for a lifetime, then she saw something from you, she would say: I have never seen any good from you.\" Sahih Al-Bukhari number (1052) from the hadith of Abdullah bin Abbas (may Allah be pleased with them both).",
    "book_id": "196",
    "new_page_number": 51
  },
  {
    "serial_number": "7493570",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "being generous of soul, good in companionship, giving her from his morals what compensates for the lack in worldly matters. 5 - Wives in their dealings with their husbands are of ranks: First: The lowest rank and worst companionship, who denies the favor and is ungrateful to the husband; if you were good to one of them for a lifetime she would say: I have never seen any good from you. Second: Who makes what is not obligatory obligatory; if he does not do it she accuses him of negligence and charges him with miserliness. Third: Who demands her full right and does not overlook anything of it even if small. Fourth: The highest rank, most elevated degree, and happiest with the good of this world and the Hereafter, who meets negligence with patience, and kindness with thanks, indeed adds to that by giving from herself and her wealth what is not obligatory on her to give. So whoever Allah blesses with one of these characteristics, let him hold on to her for she is of happiness. Ibn Hibban narrated in his Sahih from the hadith of Sa'd (may Allah be pleased with him) that the Prophet (peace and blessings be upon him) said: \"Four are of happiness: The righteous woman, the spacious dwelling, the righteous neighbor, and the comfortable mount.\" (1) And Muslim narrated in his Sahih from the hadith of Abdullah bin Amr (may Allah be pleased with them both) that the Prophet (peace and blessings be upon him) said: \"The world is enjoyment, and the best enjoyment of the world is a righteous woman.\" (2) This righteous woman was described in another hadith",
    "foot_note": "1. Sahih Ibn Hibban number (4021). \n2. Sahih Muslim number (1467).",
    "book_id": "196",
    "new_page_number": 52
  },
  {
    "serial_number": "7493571",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "narrated by Ahmad in his Musnad from the hadith of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings be upon him) was asked: Which women are best? He said: \"The one who pleases him when he looks, obeys him when he commands, and does not oppose him in herself or his wealth with what he dislikes.\" (1) Among the examples of the foregoing is what Al-Bukhari narrated in his Sahih from the hadith of Zaynab, the wife of Abdullah (may Allah be pleased with her), who said: I was in the mosque and saw the Prophet (peace and blessings be upon him) say: \"Give charity, even if from your jewelry.\" Zaynab used to spend on Abdullah and orphans in her care. She said: So she said to Abdullah: Ask the Messenger of Allah (peace and blessings be upon him) if it suffices for me to spend on you and orphans in my care from charity (Zakat)? He said: You ask the Messenger of Allah (peace and blessings be upon him). So I went to the Prophet (peace and blessings be upon him) and found a woman from the Ansar at the door, whose need was like mine. Bilal passed by us so we said: Ask the Prophet (peace and blessings be upon him): Does it suffice for me to spend on my husband and orphans in my care? And we said: Do not inform him about us. So he entered and asked him. He said: \"Who are they?\" He said: Zaynab. He said: \"Which Zaynab is she?\" He said: The wife of Abdullah. He said: \"Yes, they have two rewards: The reward of kinship and the reward of charity.\" (2) Etiquette of a Woman Asking Her Husband for Maintenance: A woman should be chaste in her request when asking for maintenance, polite in her demand, considerate of her husband's condition, and choose the appropriate time and situation. The Prophet (peace and blessings be upon him) said: \"Whoever seeks a right, let him seek it with chastity, whether fulfilled",
    "foot_note": "1. Musnad Imam Ahmad (12/383 - 384) number (7421), and its investigators said: Its chain is strong. As-Sindi said: The correct wording is what is in An-Nasa'i: \"The one who pleases him\", and correcting what is in the Musnad that the intent is the wife of the one who... etc. is far-fetched. Al-Musnad (12/383). \n2. Sahih Al-Bukhari number (1466), and Sahih Muslim number (1000).",
    "book_id": "196",
    "new_page_number": 53
  },
  {
    "serial_number": "7493572",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "or not fulfilled.\" (1) Al-Bukhari narrated in his Sahih from the hadith of Ibn Abbas (may Allah be pleased with her [them]): That the Prophet (peace and blessings be upon him) when he mentioned the story of Abraham the Friend building the Kaaba, it came in it: \"...Then Abraham came after Ismail had married to check on his dependents, but he did not find Ismail. So he asked his wife about him. She said: 'He went out seeking for us.' Then he asked her about their living and condition. She said: 'We are in evil, we are in tightness and hardship,' and she complained to him. He said: 'When your husband comes, convey peace to him and tell him to change the threshold of his door.' When Ismail came, he sensed something and said: 'Did anyone come to you?' She said: 'Yes, an old man of such and such appearance came to us and asked about you, so I informed him. And he asked me how our living was, so I informed him that we are in hardship and tightness.' He said: 'Did he advise you anything?' She said: 'Yes, he ordered me to convey peace to you and says change the threshold of your door.' He said: 'That was my father, and he has ordered me to separate from you. Join your family.' So he divorced her and married another from them. Then Abraham stayed away from them as long as Allah willed, then came to them later but did not find him. He entered upon his wife and asked her about him. She said: 'He went out seeking for us.' He said: 'How are you?' And asked her about their living and condition. She said: 'We are in goodness and abundance,' and praised Allah. He said: 'What is your food?' She said: 'Meat.' He said: 'What is your drink?' She said: 'Water.' He said: 'O Allah, bless them in meat and water.' The Prophet (peace and blessings be upon him) said: 'They did not have grain at that time, and if they had, he would have prayed for them in it.' He said: 'No one persists on them (meat and water) outside Mecca except they disagree with him.' He said: 'When your husband comes, convey peace to him and order him to keep the threshold of his door.' When Ismail came, he said: 'Did anyone come to you?' She said: 'Yes, an old man of good appearance came to us,' and she praised him, 'and he asked me about you so I informed him, and asked me how our living was so I informed him we are in goodness.' He said: 'Did he advise you",
    "foot_note": "1. Sunan Ibn Majah from the hadith of Ibn Umar and Aisha (may Allah be pleased with them) number 2421, and authenticated by Sheikh Al-Albani in Sahih Sunan Ibn Majah (2/54) number (1965).",
    "book_id": "196",
    "new_page_number": 54
  },
  {
    "serial_number": "7493573",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "anything?' She said: 'Yes, he conveys peace to you and orders you to keep the threshold of your door.' He said: 'That was my father and you are the threshold; he ordered me to keep you'.\" (1) By this, blessings descend and souls become good. We conclude with these ten commandments from a wise woman to her daughter, so that whoever Allah wills of women may benefit from them. Let it be known that what we mention is not impossible; rather, it is abundant in reality, biographies, and histories are overflowing with it, increasing and decreasing, lessening and multiplying according to people's conditions in time and place. Among the famous commandments is what a mother advised her daughter on her wedding night, saying to her while bidding her farewell: \"O daughter, you have left your house from which you emerged, and your nest in which you grew up, to a nest you are not familiar with and a companion you do not know. So be a bondmaid to him, he will be a slave to you. Preserve for him ten qualities, they will be a treasure for you: As for the first and second: Accompanying with contentment, and associating with good hearing and obedience. As for the third and fourth: Attending to the site of his eyes, and checking the place of his nose. Let his eyes not fall upon anything ugly from you, and let him smell nothing from you but the best scent. Kohl is the best of described beauty, and water and soap are the best of known perfumes. As for the fifth and sixth: Checking the time of his food, and quietness during his sleep. For the heat of hunger is burning, and the disturbance of sleep is distressing. As for the seventh and eighth: Caring for his house and wealth, and observing himself and his children. As for the ninth and tenth: Do not disobey his command nor spread his secret. For if you",
    "foot_note": "1. Sahih Al-Bukhari number (3364).",
    "book_id": "196",
    "new_page_number": 55
  },
  {
    "serial_number": "7493574",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Happiness and Success in Understanding the Purposes of Marriage",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "disobey his command, you inflame his chest, and if you spread his secret, you are not safe from his betrayal. Then after that, beware of joy when he is depressed, and depression when he is joyful. For the first is negligence and the second is annoyance. The more you honor him, the more he will honor you. You will not reach this until you prefer his pleasure over your pleasure, and his desire over your desire in what you love or hate. And Allah ordains good for you (*). (1) Praise be to Allah by whose grace good deeds are completed, and may Allah bless and grant peace to our Prophet Muhammad and his family and companions all together. * * *",
    "foot_note": "1. (*) And God willing, the second part of this book will be released soon, in which we will complete the remaining issues related to this subject.",
    "book_id": "196",
    "new_page_number": 56
  }
]