[
  {
    "serial_number": "97886",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Doctrine\nBook: The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer\nAuthor: Dr. Abdul Majeed bin Muhammad Al-Wa'lan\nNumber of Pages: 52\n[The book is not printed]\nPublication date in Al-Shamela: 25 Safar 1442\n\nBook: The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer\nAuthor: Dr. Abdul Majeed bin Muhammad Al-Wa'lan\nNumber of Pages: 52\n[The book is not printed]\nPublication date in Al-Shamela: 25 Safar 1442\n\nAuthor: Dr. Abdul Majeed bin Muhammad Al-Wa'lan\nNumber of Pages: 52\n[The book is not printed]\nPublication date in Al-Shamela: 25 Safar 1442\n\nNumber of Pages: 52\n[The book is not printed]\nPublication date in Al-Shamela: 25 Safar 1442\n\n[The book is not printed]\nPublication date in Al-Shamela: 25 Safar 1442\n\nPublication date in Al-Shamela: 25 Safar 1442",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 1
  },
  {
    "serial_number": "97887",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer\nDr. Abdul Majeed bin Muhammad Al-Wa'lan",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 2
  },
  {
    "serial_number": "97889",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "Research Plan:\nThis research includes an introduction, five chapters, and a conclusion.\nAs for the introduction, it includes the importance of this topic and the research plan.\nAs for the First Chapter, it includes three sections:\nSection One: I discussed the definition of Qada (Decree) and Qadar (Destiny) linguistically and religiously.\nSection Two: I discussed the importance of belief in Destiny and Decree and its status in the creed.\nSection Three: I mentioned the evidences for belief in Destiny and Decree from the Book and the Sunnah.\nAs for the Second Chapter: I discussed the levels of Destiny in detail and the evidences for each level, and I mentioned the divisions of predestination.\nAs for the Third Chapter: It includes two sections:\nSection One: I discussed the matters upon which the disagreement in Destiny revolves, and the cause of that disagreement.\nSection Two: I discussed the schools of thought of people regarding Destiny, mentioning the creed of the Jahmiyyah, the Mu'tazila, and the Ash'aris. Then I mentioned the creed of Ahl al-Sunnah wal-Jama'ah.\nAs for the Fourth Chapter: I discussed the fruits of belief in Destiny and Decree in the correct manner.\nAs for the Fifth Chapter: I discussed secularism and its connection to the deviation in the concept of Destiny, and I mentioned the definition of secularism, and the Sufi creed regarding Destiny, and how secularism exploited the erroneous Sufi concept of the creed of Destiny in the intellectual invasion of the Islamic nation.\nThe Conclusion: I discussed the most important results I reached.\nAs for my work in the research, it is as follows:\n1 - Attributing the verses to their places in the Quran, by stating the Surah name and verse number and placing them between brackets {}.\n2 - Extracting the Hadiths and Athar (narrations), mentioning their sources, and placing them between brackets «».\n3 - Providing biographies for the sects mentioned in the research.\n4 - Creating a list of references.\n5 - Subject index.\nI ask Allah Almighty to make this small effort purely for His Noble Face, and to benefit us with it in this world and the Hereafter, indeed He is the Guardian of that and Capable of it.\nAnd Allah knows best, and may Allah bless and grant peace to our Prophet Muhammad.\nDr. Abdul Majeed bin Muhammad Al-Wa'lan\nawalaan@gmail.com",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 3
  },
  {
    "serial_number": "97890",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "Chapter One\nSection One: Definition of Qada and Qadar Linguistically and Religiously\n\nQadar (Destiny) Linguistically: With a Fatha on the Qaf and open or sukoon on the Dal, it means judgment and ruling. It is what Allah Almighty destines of judgment and rules regarding matters. Allah Almighty said: {Indeed, We sent it down during the Night of Decree (1) And what} [Al-Qadr: 1], meaning judgment (1). Ibn Faris said: Qaf, Dal, and Ra form a sound root indicating the limit of a thing, its essence, and its end. And 'Qadartu ash-shay' aqdiruhu wa aqduruhu' - with sukoon on the Qaf and kasra or damma on the Dal - comes from Tadir (estimation) (2). In Al-Qamus, Al-Qadar (with movement): Judgment, ruling, and the measure of a thing. And Al-Taqdir: Reflection and thinking in settling a matter (3).\n\nAl-Qada (Decree) Linguistically: Separation and judgment. Its origin is cutting and separation. Qada' of a thing means perfecting it, executing it, and finishing it, so it comes with the meaning of creation. Al-Zuhri said: Al-Qada in language has meanings that return to the completion and perfection of a thing. Everything whose work is perfected, completed, sealed, fulfilled, obligated, made known, executed, or passed, has been 'Qudiya' (Decreed). All these meanings have appeared in the Hadith (4).\nQada and Qadar are two inseparable matters; one does not detach from the other, because one of them is like the foundation, which is Qadar, and the other is like the building, which is Qada. So whoever seeks to separate them seeks to demolish the building and tear it down (5).\n\nMeaning of Qada and Qadar Religiously: It is that Allah Almighty knew all things before their existence, wrote them with Him, willed what existed of them, and created what He intended to create (6).",
    "foot_note": "1. Ibn Manzur, Lisan al-Arab (6/ 3545), investigation by Abdullah Al-Kabir and others, Dar Al-Ma'arif. Al-Qamus Al-Muhit, by Al-Firuzabadi, p. 414, adjustment and documentation by Yusuf Al-Sheikh Al-Baqai, Dar Al-Fikr, Beirut, 1415 AH.\n2. Ibn Faris, Mu'jam Maqayis al-Lugha, p. (5/ 62), First Edition, investigation by Abdul Salam Haroun, Dar Al-Jeel, Beirut, 1411 AH.\n3. Al-Qamus Al-Muhit, p. 414.\n4. Lisan al-Arab (6/ 3665), Al-Nihayah fi Gharib al-Hadith wa al-Athar (4/ 69), First Edition, commentary by Salah Oweida, Dar Al-Kutub Al-Ilmiyyah, Beirut 1418 AH.\n5. Lisan al-Arab (6/ 3665).\n6. Fatawa of the Permanent Committee for Scholarly Research and Ifta, p. (3/ 374), Number 4088, First Edition, collected by Ahmad Al-Duwaish, Maktabat Al-Ma'arif, Riyadh, 1412 AH.",
    "book_id": "70",
    "new_page_number": 4
  },
  {
    "serial_number": "97891",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Another definition: It is the decisive belief that every good and evil is by Allah's decree and destiny, and that He does what He wills. Nothing happens in His dominion except by His will, and nothing exits His volition. There is nothing in the world that exits His estimation, nor issues except from His management. There is no escape for anyone from destiny, nor can anyone exceed what was written in the Preserved Tablet. And [it is the belief] that He is the Creator of the servants' actions, both obediences and sins (1).\nAnother definition: It is Allah's estimation of things in eternity, His knowledge Almighty that they will occur at times known to Him and with specific attributes, His writing Almighty of that, His willing of it, and their occurrence according to how He estimated them and His creation of them (2).\nAll these definitions are close and include the four levels of Qadar: Knowledge, Writing, Will, and Creation.\n\nThe Difference between Qada and Qadar:\nSheikh Ibn Uthaymeen, may Allah have mercy on him, said: \"Al-Qadar in language means: Estimation (Taqdir); Allah Almighty said: {Indeed, all things We created with predestination (49)} [Al-Qamar: 49], and He said: {So We determined, and excellent are the determiners (23)} [Al-Mursalat: 23].\n- As for Al-Qada; in language it is: Judgment. Therefore, we say: Qada and Qadar are distinct if mentioned together, and synonymous if mentioned separately; according to the scholars' saying: They are two words: if they gather they separate (in meaning), and if they separate they gather (in meaning). So if it is said: This is Allah's Qadar; it includes Qada. But if they are mentioned together; each has a meaning.\n- So Taqdir (Estimation): Is what Allah Almighty estimated in eternity to exist in His creation.\n- As for Qada: It is what Allah Almighty decreed in His creation of bringing into existence, annihilation, or change. Based on this, Estimation (Taqdir) is preceding\" (3).",
    "foot_note": "1. Abdul Aziz Al-Salman, Al-Kawashef Al-Jaliyya 'an Ma'ani Al-Wasitiyyah, p. 84, Nineteenth Edition.\n2. Abdul Rahman Al-Mahmoud, Al-Qada wa Al-Qadar fi Daw' Al-Kitab wa Al-Sunnah wa Madhahib Al-Nas Fih, p. 39, Second Edition, Dar Al-Watan, Riyadh, 1418 AH.\n3. Sharh Al-Aqidah Al-Wasitiyyah: 2/ 189. See: Fath Al-Bari: 11/ 149, 477, Al-Qada wa Al-Qadar by Al-Ashqar: 24, and Al-Qada wa Al-Qadar by Al-Mahmoud: 44.",
    "book_id": "70",
    "new_page_number": 5
  },
  {
    "serial_number": "97892",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "Section Two\nThe Importance of Belief in Destiny and Decree and Its Status in the Creed\nBelief in Qadar is one of the fundamentals of faith without which a servant's faith is not complete. It is included in the belief in Allah Almighty, His Lordship, His Names, and His Attributes. For among His attributes, Almighty, are the attributes of Knowledge, Power, Will, and Creation, and it is known that Qadar relies on these foundations. There is no doubt that acknowledging the Oneness of Allah and His Lordship is not complete except by believing in His attributes Almighty. So whoever claims that there is a creator other than Allah Almighty has committed Shirk (polytheism), and Allah Almighty is the Creator of everything, and that includes the actions of the servants (1).\nExplicit textual mention of the obligation of believing in Qadar did not appear in the Quran [as a pillar by name in a single list like the Hadith], but rather general evidences indicating Allah's estimation of things appeared (2), such as His saying Almighty: {Indeed, all things We created with predestination (49)} [Al-Qamar: 49], and His saying: {and created each thing and determined it with [precise] determination (2)} [Al-Furqan: 1-2], and His saying: {And the command of Allah is a decree determined (38)} [Al-Ahzab: 38], and His saying: {We placed it in a safe lodging (21) For a known term (22) So We determined, and excellent are the determiners (23)} [Al-Mursalat: 21-23].\nExplicit mention of belief in Qadar came in the Sunnah, in the Hadith of Umar bin Al-Khattab, may Allah be pleased with him, regarding Gabriel, peace be upon him, asking the Messenger, peace and blessings be upon him, about Faith. He said: «To believe in Allah, His angels, His books, His messengers, the Last Day, and to believe in Destiny (Al-Qadar), its good and its bad. He [Gabriel] said: You have spoken the truth» (3).\nAnd on the authority of Jabir, may Allah be pleased with them both, he said: The Messenger of Allah, peace and blessings be upon him, said: «A servant does not believe until he believes in Destiny, its good and its bad from Allah, and until he knows that what hit him was not going to miss him, and what missed him was not going to hit him» (4).",
    "foot_note": "1. Sharh Al-Aqidah Al-Tahawiyyah p. (2/ 356). First Edition, investigation by Abdullah Al-Turki, Shu'aib Al-Arna'ut, Mu'assasat Al-Risalah, Beirut, 1408 AH.\n2. See: Al-Qada wa Al-Qadar, Abdul Rahman Al-Mahmoud, p. 86, and the tape 'Aqidah Ahl al-Sunnah wal-Jama'ah in Qada and Qadar, Saleh Al-Sheikh, Nida Al-Islam Recordings, Riyadh.\n3. Previously referenced p. 1 footnote number 1.\n4. Narrated by Al-Tirmidhi: Book of Qadar, Chapter: What came regarding belief in Destiny, its good and bad, p. (6/ 356 - Sharh Tuhfat Al-Ahwadhi), Number 2231, Third Edition, adjustment by Abdul Rahman Uthman, Maktabat Ibn Taymiyyah, 1407 AH. Authenticated by Al-Albani in Sahih Sunan Al-Tirmidhi Number 1743, First Edition, Arab Bureau of Education for the Gulf States, Riyadh, 1408 AH. And in Silsilat Al-Ahadith Al-Sahihah Number 2439, First Edition, Maktabat Al-Ma'arif, Riyadh, 1412 AH.",
    "book_id": "70",
    "new_page_number": 6
  },
  {
    "serial_number": "97893",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "And on the authority of Tawus, he said: I met people from the Companions of the Messenger of Allah, peace and blessings be upon him, saying: Everything is by Destiny (Qadar). He said: And I heard Abdullah bin Umar, may Allah be pleased with them both, saying: The Messenger of Allah, peace and blessings be upon him, said: «Everything is by Destiny, even incapacity and shrewdness (1), or shrewdness and incapacity» (2).\nAnd on the authority of Abu Darda, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, who said: «No undutiful child [to parents], nor persistent drinker of alcohol, nor denier of Destiny enters Paradise» (3).\nIbn Abbas, may Allah be pleased with them both, said: (Destiny is the system of Tawhid (Monotheism). So whoever unifies Allah and believes in Destiny, his Tawhid is complete. And whoever unifies Allah and denies Destiny, his denial unravels his Tawhid) (4).\nIbn Umar, may Allah be pleased with them both, said regarding those who claim there is no Destiny and that the matter is unprecipitated (new): (If you meet those people, inform them that I am innocent of them and they are innocent of me. By the One by Whom Abdullah bin Umar swears, if one of them had gold like Uhud and spent it, Allah would not accept it from him until he believes in Destiny) (5).\nSheikh Al-Islam Ibn Taymiyyah said: (If this is established - meaning the realization of the testimony that there is no god but Allah and that Muhammad is the Messenger of Allah - it is known that one must believe in Allah's creation and command, and in His decree and legislation) (6).\nIbn al-Qayyim said: (Imam Ahmad said: Destiny is the Power of Allah. Ibn Aqil appreciated this statement greatly and said: This indicates the precision of Ahmad's knowledge and his deep understanding of the fundamentals of religion. It is as Abu al-Wafa said; for denying Destiny is: denying the Lord's Power to create the actions of servants, write them, and estimate them) (7).",
    "foot_note": "1. Al-Ajz (Incapacity): is the lack of ability, and it is said it is abandoning what must be done, procrastinating it, and delaying it from its time. Al-Kays (Shrewdness/Ability): is the opposite of Incapacity, and it is activity and skill in matters. The meaning is that the incapable one's incapacity has been destined, and the capable one's capability has been destined. p. (16/ 205 - Sharh Al-Nawawi).\n2. Narrated by Muslim: Book of Qadar - Chapter: Everything is by Destiny (16/ 205 - Sharh Al-Nawawi).\n3. Authentic Hadith, narrated by Imam Ahmad, see Al-Jami Al-Sahih fi Al-Qadar, by Muqbil Al-Wadi'i, p. 14, Maktabat Ibn Taymiyyah, Cairo. It is in Al-Silsilah Al-Sahihah Number (675), Fourth Edition, Al-Maktab Al-Islami, Beirut, 1405 AH.\n4. Sharh Al-Aqidah Al-Tahawiyyah by Ibn Abi Al-Izz, p. (1/ 322), Sharh Usul I'tiqad Ahl Al-Sunnah wal-Jama'ah by Al-Lalaka'i, p. (4/ 622), Second Edition, investigation by Ahmad Hamdan, Dar Taybah, Riyadh, 1411 AH.\n5. Narrated by Muslim: Book of Qadar - Chapter: Everything is by Destiny (16/ 205 - Sharh Al-Nawawi).\n6. Al-Tadmuriyyah, Sheikh Al-Islam Ibn Taymiyyah, p. 130, Second Edition, Imam Muhammad bin Saud University Publications, Riyadh, 1400 AH.\n7. Ibn al-Qayyim, Shifa al-Alil fi Masa'il al-Qada wa al-Qadar wa al-Hikmah wa al-Ta'lil, p. 28, First Edition, correction by Sayyid Muhammad Badr al-Din al-Halabi, Maktabat al-Riyadh al-Hadithah, Riyadh.",
    "book_id": "70",
    "new_page_number": 7
  },
  {
    "serial_number": "97894",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Section Three: Evidences for Belief in Destiny and Decree from the Book and the Sunnah\n\nFirst: Evidences from the Quran:\nAllah Almighty said: {Indeed, all things We created with predestination (49)} [Al-Qamar: 49]. And He Almighty said: {and created each thing and determined it with [precise] determination (2)} [Al-Furqan: 1-2], (Meaning everything other than Him is created and nurtured, and He is the Creator of everything, its Lord, its King, and its God. Everything is under His subjugation, management, control, and determination) (1).\nAnd He Almighty said: {And [remember, O Muhammad], when you said to the one on whom Allah bestowed favor and you bestowed favor, \"Keep your wife and fear Allah,\" while you concealed within yourself that which Allah is to disclose. And you feared the people, while Allah has more right that you fear Him. So when Zayd had no longer any need for her, We married her to you in order that there not be upon the believers any discomfort concerning the wives of their adopted sons when they no longer have need of them. And ever is the command of Allah accomplished. (37) There is not to be upon the Prophet any discomfort concerning that which Allah has imposed upon him. [This is] the established way of Allah with those [prophets] who have passed on before. And ever is the command of Allah a decree determined (38)} [Al-Ahzab: 37-38], (Meaning His command which He decrees is inevitable and will occur, there is no way to avoid or divert it; whatever He wills happens, and whatever He does not will does not happen) (2).\nAnd He Almighty said: {No disaster strikes except by permission of Allah. And whoever believes in Allah - He will guide his heart} [At-Taghabun: 11], (This is general for all calamities, in self, wealth, children, loved ones, and the like. So all that befalls the servants is by the Decree and Destiny of Allah; His knowledge has preceded it, His Pen has run with it, His Will has executed it, and His Wisdom has required it) (3).\nAnd He Almighty said: {And We will make it black stubble. (5) We will make you recite, [O Muhammad], and you will not forget, (6) Except what Allah should will. Indeed, He knows what is declared and what is hidden. (7) And We will ease you toward ease. (8) So remind, if the reminder should benefit; (9) He who fears [Allah] will be reminded. (10)} [Al-A'la: 5-10]. Ibn Kathir said: (The verses in this meaning are many, indicating that Allah Almighty rewards the one who intends good with success in it, and the one who intends evil with abandonment, and all of that is by a destined decree) (4).",
    "foot_note": "1. Ibn Kathir, Tafsir al-Quran al-Azim, p. (3/ 320), Second Edition, introduction by Dr. Yusuf Al-Mar'ashli, Dar Al-Ma'rifah, Beirut, 1407 AH.\n2. Tafsir Ibn Kathir, (3/ 500).\n3. Ibn Sa'di, Taysir Al-Karim Al-Rahman fi Tafsir Kalam Al-Mannan, p. (7/ 399), Saleh bin Saleh Cultural Center, Unayzah, 1407 AH.\n4. Tafsir Ibn Kathir, (4/ 554).",
    "book_id": "70",
    "new_page_number": 8
  },
  {
    "serial_number": "97895",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "Second: Evidences from the Sunnah:\nOn the authority of Umar bin Al-Khattab, may Allah be pleased with him, regarding Gabriel, peace be upon him, asking the Messenger, peace and blessings be upon him, about Faith. He said: «To believe in Allah, His angels, His books, His messengers, the Last Day, and to believe in Destiny (Al-Qadar), its good and its bad. He [Gabriel] said: You have spoken the truth» (1). (In this Hadith is that belief in Destiny is one of the six pillars of Faith mentioned. So whoever does not believe in Destiny, its good and its bad, has abandoned a fundamental of the religion and denied it, resembling those about whom Allah said: {So do you believe in part of the Scripture and disbelieve in part?} [Al-Baqarah: 85]) (2).\nAnd on the authority of Jabir, may Allah be pleased with them both, he said: The Messenger of Allah, peace and blessings be upon him, said: «A servant does not believe until he believes in Destiny, its good and its bad from Allah, and until he knows that what hit him was not going to miss him, and what missed him was not going to hit him» (3).\nSheikh Ibn Baz, may Allah have mercy on him, said: (All the verses and hadiths mentioned in this chapter call the servant to believe that nothing will befall him except what Allah has written for him, and that what hit him was not going to miss him and what missed him was not going to hit him. They also call him to hasten to good deeds, compete in acts of obedience, be eager for causes of good, and stay away from causes of evil) (4).\nAnd on the authority of Tawus, he said: I met people from the Companions of the Messenger of Allah, peace and blessings be upon him, saying: Everything is by Destiny. He said: And I heard Abdullah bin Umar, may Allah be pleased with them both, saying: The Messenger of Allah, peace and blessings be upon him, said: «Everything is by Destiny, even incapacity and shrewdness, or shrewdness and incapacity» (5).\nAnd on the authority of Abu Darda, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, who said: «No undutiful child, nor persistent drinker of alcohol, nor denier of Destiny enters Paradise» (6).\nAnd on the authority of Ibn Al-Daylami, he said: I came to Ubayy bin Ka'b and said to him: Something regarding Destiny has occurred in my soul, so tell me something so that perhaps Allah Almighty removes it from my heart. He said: If Allah Almighty punished the inhabitants of His heavens and the inhabitants of His earth, He would punish them while He is not unjust to them. And if He had mercy on them, His mercy would be better for them than their deeds. And if you spent gold like Uhud in the path of Allah Almighty, Allah Almighty would not accept it from you until you believe in Destiny, and know that what hit you was not going to miss you, and what missed you was not going to hit you. And if you died on other than this, you would enter the Fire. He said: Then I came to Ibn Masud and he said the like of that. He said: Then I came to Hudhayfah bin Al-Yaman and he said the like of that. He said: Then I came to Zaid bin Thabit and he narrated to me from the Prophet, peace and blessings be upon him, the like of that (7).",
    "foot_note": "1. Previously referenced p. 1 footnote number 1.\n2. Abdul Rahman bin Hasan, Fath Al-Majid Sharh Kitab Al-Tawhid, p. 428, First Edition, Al-Maktabah Al-Tijariyyah, Mecca, 1412 AH.\n3. Previously referenced p. 6 footnote number 4.\n4. Majmoo' Fatawa of Sheikh Ibn Baz, collected by Abdullah Al-Tayyar and Ahmad bin Baz, p. (3/ 491), First Edition, Dar Al-Watan, Riyadh, 1416 AH.\n5. Previously referenced p. 8 footnote number 2.\n6. Previously referenced p. 8 footnote number 3.\n7. Hasan Hadith, narrated by Abu Dawood, see Al-Jami Al-Sahih fi Al-Qadar, p. 14.",
    "book_id": "70",
    "new_page_number": 9
  },
  {
    "serial_number": "97896",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "Chapter Two: Levels of Destiny and Evidences for Each Level\nSheikh Al-Islam Ibn Taymiyyah said: (The Saved Sect - Ahl al-Sunnah wal-Jama'ah - believes in Destiny, its good and its bad. Belief in Destiny is on two degrees, each degree includes two things:\nThe First Degree: Belief that Allah Almighty is All-Knowing of what creation will do, by His eternal Knowledge, with which He is described forever and ever. He knew all their states of obedience and disobedience, provisions and life spans. Then Allah wrote in the Preserved Tablet the destinies of creation...\nThen he said: As for the Second Degree: It is the executable Will of Allah and His comprehensive Power. It is the belief that whatever Allah wills happens, and whatever He does not will does not happen. And that there is no movement or stillness in the heavens or on earth except by the Will of Allah Almighty. Nothing happens in His dominion which He does not want. And that He Almighty is capable of all things, existent and nonexistent. There is no creature on earth or in heaven except that Allah is its Creator, Glory be to Him, there is no creator other than Him, and no Lord besides Him) (1).\nBased on this, the levels of Destiny are four, which are:\n\nThe First Level: Knowledge (Al-Ilm):\nIt is that Allah Almighty knew all things before their existence by His eternal Knowledge, and knew their measures, times, the life spans of servants, their provisions, and other than that. As He Almighty said: {Indeed, Allah is Knowing of all things (62)} [Al-Ankabut: 62]. And He Almighty said: {that you may know that Allah is over all things competent and that Allah has encompassed all things in knowledge (12)} [At-Talaq: 12], (Meaning to know the perfection of His Power and His encompassing of things, which is the meaning of {and that Allah has encompassed all things in knowledge}, so nothing of them exits His knowledge whatever it may be) (2).\nAnd He Almighty said: {And with Him are the keys of the unseen; none knows them except Him. And He knows what is on the land and in the sea. Not a leaf falls but that He knows it. And no grain is there within the darknesses of the earth and no moist or dry [thing] but that it is [written] in a clear record} [Al-An'am: 59]. The keys of the unseen were interpreted by the Messenger of Allah, peace and blessings be upon him, as five things which no one knows except Allah, which are mentioned in His Almighty saying: {Indeed, Allah [alone] has knowledge of the Hour and sends down the rain and knows what is in the wombs. And no soul perceives what it will earn tomorrow, and no soul perceives in what land it will die. Indeed, Allah is Knowing and Acquainted (34)} [Luqman: 34] (3).",
    "foot_note": "1. Ibn Taymiyyah, Al-Aqidah Al-Wasitiyyah, p. (22 - 23), Explanation by Sheikh Muhammad bin Mani', Maktabat Al-Nahdah Al-Hadithah.\n2. Fath Al-Qadir, by Al-Shawkani, p. (5/ 248), Dar Al-Fikr edition, Beirut, 1403 AH.\n3. Hadith narrated by Al-Bukhari: Book of Interpretation - Surah Al-An'am, Chapter {And with Him are the keys of the unseen...} and in Interpretation of Surah Luqman, Chapter {Indeed, Allah [alone] has knowledge of the Hour} (8/ 291, 8/ 513 - Fath Al-Bari), corrected by Sheikh Abdul Aziz bin Baz, Dar Al-Fikr.",
    "book_id": "70",
    "new_page_number": 10
  },
  {
    "serial_number": "97897",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "And He Almighty said: {Your god is only Allah, except for whom there is no deity. He has encompassed all things in knowledge (98)} [Ta-Ha: 98] (Meaning He is Knowing of everything, He encompassed everything in knowledge, and counted everything in number. Not an atom's weight escapes Him in land or sea, nor does a leaf fall but that He knows it, nor a grain in the darknesses of the earth, nor anything moist or dry but that it is in a clear record {And there is no creature on earth but that upon Allah is its provision, and He knows its place of dwelling and place of storage. All is in a clear register (6)} [Hud: 6]) (1).\nAnd on the authority of Imran bin Husain, may Allah be pleased with him, he said: A man said: O Messenger of Allah! Are the people of Paradise known from the people of the Fire? He said: «Yes», He said: So for what do the workers work? He said: «Everyone is facilitated for what he was created for» (2). Al-Bukhari titled a chapter on this saying: Chapter: The Pen has dried upon the Knowledge of Allah. And His saying: {And Allah left him astray based on knowledge}. (Iyad said: The meaning of 'the Pen dried' is that nothing is written after that, and the Book of Allah, His Tablet, and His Pen are from His Unseen and His Knowledge which we are obliged to believe in) (3).\nAnd on the authority of Abu Huraira, may Allah be pleased with him, he said: The Messenger of Allah, peace and blessings be upon him, said: «No child is born but upon Fitrah (natural disposition). It is his parents who make him a Jew or a Christian, just as you help animals give birth, do you find among them a mutilated one until you mutilate them?» They said: O Messenger of Allah: What do you see about those who die while young? He said: «Allah knows best what they would have done» (4). The verses and hadiths in this meaning are many.\n\nThe Second Level: Writing (Al-Kitabah):\nIt is that Allah wrote all things of good and evil, obedience and disobedience, life spans and provisions, and other things. As He Almighty said: {Do you not know that Allah knows what is in the heaven and earth? Indeed, that is in a Record. Indeed that, for Allah, is easy (70)} [Al-Hajj: 70], (He Almighty informs about the perfection of His knowledge of His creation and that He encompasses what is in the heavens and earth, so not an atom's weight escapes Him in the earth or in the sky, nor smaller than that nor larger, and that He Almighty knew the beings before their existence and wrote that in the Preserved Tablet) (5).",
    "foot_note": "1. Tafsir Ibn Kathir (3/ 172).\n2. Narrated by Muslim, Book of Qadar: Chapter on the manner of creation of the human in his mother's womb (16/ 198 - Sharh Al-Nawawi), and narrated by Al-Bukhari, Book of Qadar, Chapter: The Pen has dried upon the Knowledge of Allah, (11/ 491 - Fath Al-Bari).\n3. Fath Al-Bari (11/ 491).\n4. Narrated by Al-Bukhari, Book of Qadar, Chapter: Allah knows best what they would have done, (11/ 493 - Fath Al-Bari) and narrated by Muslim, Book of Qadar, Chapter: Meaning of every child is born upon Fitrah, (16/ 210 - Sharh Al-Nawawi)\n5. Tafsir Ibn Kathir (3/ 245).",
    "book_id": "70",
    "new_page_number": 11
  },
  {
    "serial_number": "97898",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "And He Almighty said: {No disaster strikes upon the earth or among yourselves except that it is in a register before We bring it into being - indeed that, for Allah, is easy (22)} [Al-Hadid: 22].\nOn the authority of Abdullah bin Amr bin Al-Aas, may Allah be pleased with them both, he said: I heard the Messenger of Allah, peace and blessings be upon him, say: «Allah wrote the destinies of creations fifty thousand years before He created the heavens and the earth. He said: And His Throne was upon the water» (1). (Scholars said: The intention is defining the time of writing in the Preserved Tablet or elsewhere, not the origin of estimation (Taqdir), for that is eternal with no beginning) (2).\nIn the two Sahihs from the Hadith of Ali, may Allah be pleased with him, he said: We were sitting with the Prophet, peace and blessings be upon him, and he had a stick with which he was scratching the ground. He lowered his head and said: «There is not one of you except that his seat from the Fire or from Paradise has been written.» A man from the people said: Should we not rely [on it], O Messenger of Allah? He said: «No, work, for everyone is facilitated. Then he recited {As for he who gives and fears Allah (5)} the verse [Al-Layl: 5]» (3). (This Hadith is a principle for Ahl al-Sunnah that happiness and misery are by the eternal decree of Allah. It contains a refutation of the Jabriyyah, because facilitation (Taysir) is the opposite of compulsion (Jabr), because compulsion only happens with dislike, and a human does not come to a thing by way of facilitation unless he is not disliking it) (4).",
    "foot_note": "1. Narrated by Muslim, Book of Qadar, Chapter: Adam arguing with Moses, (16/ 203 - Sharh Al-Nawawi).\n2. Sharh Al-Nawawi on Muslim, (16/ 203).\n3. Narrated by Al-Bukhari: Book of Qadar, Chapter: And the command of Allah is a decree determined (11/ 494 - Fath Al-Bari), and narrated by Muslim: Book of Qadar, Chapter: Manner of creation of the human in his mother's womb (16/ 195 - Sharh Al-Nawawi).\n4. Fath Al-Bari, (11/ 498).",
    "book_id": "70",
    "new_page_number": 12
  },
  {
    "serial_number": "97899",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "Types of Estimation (Taqdir) are five (1):\n\nFirst: The General Estimation before the creation of the heavens and the earth: It is the Lord's estimation of all things, meaning His knowledge of them, writing of them, willing them, and creating whatever existed of them. Many evidences point to this type, including His saying Almighty: {Do you not know that Allah knows what is in the heaven and earth? Indeed, that is in a Record. Indeed that, for Allah, is easy (70)} [Al-Hajj: 70], and His saying: {that you may know that Allah is over all things competent and that Allah has encompassed all things in knowledge (12)} [At-Talaq: 12], and His saying: {He does what He wills (18)} [Al-Hajj: 18], and His saying: {Allah is the Creator of all things} [Az-Zumar: 62]. And in Sahih Muslim from Abdullah bin Amr bin Al-Aas, may Allah be pleased with them both, that the Prophet, peace and blessings be upon him, said: «Allah estimated the destinies of creations fifty thousand years before He created the heaven and the earth, and His Throne was upon the water» (2).\n\nSecond: Writing of the Covenant (Mithaq) when He took from the Children of Adam while they were on the back of their father Adam: Allah Almighty said: {And [mention] when your Lord took from the children of Adam - from their loins - their descendants and made them testify of themselves, [saying to them], \"Am I not your Lord?\" They said, \"Yes, we have testified.\"} [Al-A'raf: 172]. In Musnad Imam Ahmad from Abu Darda, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, who said: «Allah created Adam when He created him, then He struck his right shoulder and brought out offspring white like ants, and He struck his left shoulder and brought out offspring black like coal. He said to the ones in his right: To Paradise and I do not care, and He said to the ones in his left hand: To the Fire and I do not care» (3).\n\nThird: The Lifetime Estimation (Al-Taqdir Al-Umri): It is the estimation of everything that happens to the servant in his life until the end of his term and writing his misery or happiness. The Hadith of Ibn Masud, may Allah be pleased with him, indicated this, that the Prophet, peace and blessings be upon him, said: «Indeed, the creation of one of you is gathered in his mother's womb for forty days, then he is a clot like that, then he is a morsel like that, then Allah sends the angel and breathes the spirit into him and he is commanded with four words: to write his provision, his term, his deed, and whether he is miserable or happy...» (4) The Hadith.\n\nFourth: The Annual Estimation:",
    "foot_note": "1. Al-Tanbihat Al-Latifah 'ala ma Ihtawat 'alayhi Al-Aqidah Al-Wasitiyyah min Al-Mabahith Al-Munifah, Abdul Rahman bin Sa'di, p. 78-80, First Edition, comments by Sheikh Ibn Baz, adjusted by Ali Hasan Abdul Hamid, Dar Ibn Al-Qayyim, Dammam, 1409 AH. See: Shifa al-Alil p. 6-23, Ma'arij al-Qabul bi Sharh Sullam al-Wusul ila 'Ilm al-Usul by Sheikh Hafiz al-Hakami (3/ 928-940), Third Edition, adjustment and commentary by Umar bin Mahmoud, Dar Ibn Al-Qayyim, Dammam, 1414 AH, and Al-Qada wa Al-Qadar by Al-Mahmoud p. 66-69.\n2. Previously referenced p. 12 footnote number 2.\n3. The book investigator said: Narrated by Ahmad and his son in Al-Zawa'id (6/ 441) and its chain is authentic.\n4. Narrated by Al-Bukhari Book of Qadar (11/ 477 - Fath Al-Bari), and narrated by Muslim in Book of Qadar, Chapter: Manner of creation of the human in his mother's womb (16/ 190 - Sharh Al-Nawawi).",
    "book_id": "70",
    "new_page_number": 13
  },
  {
    "serial_number": "97900",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "This happens in Laylat al-Qadr (Night of Decree). His saying Almighty indicates it: {On that night is made distinct every precise matter (4)} [Ad-Dukhan: 4], and His saying Almighty: {The angels and the Spirit descend therein by permission of their Lord for every matter (4) Peace it is until the emergence of dawn (5)} [Al-Qadr: 4-5]. It is said: In this night, what happens in the year of death, honor, humiliation, and other things is written. This was narrated from Ibn Umar, Mujahid, Abu Malik, Al-Dahhak, and others among the Predecessors (1).\n\nFifth: The Daily Estimation: His saying Almighty indicates it: {Every day He is in a matter} [Ar-Rahman: 29]. On the authority of Abu Darda, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, regarding the interpretation of {Every day He is in a matter}, he said: «From His matter is that He forgives a sin, relieves a distress, raises a people, and lowers others». Al-Bukhari recorded it as Mu'allaq (suspended) from Abu Darda as Mawquf (stopped) (2).\n\nThe Third Level: The Will (Al-Mashia):\nMeaning that whatever Allah wills happens, and whatever He does not will does not happen. And that there is no movement or stillness in the heavens and earth except by His Will Almighty, and nothing happens in His dominion except what He wants. As He Almighty said: {To whoever wills among you to take a right course (28) And you do not will except that Allah wills - Lord of the worlds (29)} [At-Takwir: 28-29]. Ibn Kathir said: (Meaning the will is not entrusted to you, so whoever wishes is guided and whoever wishes goes astray, rather all that is subordinate to His Will Almighty, Lord of the Worlds) (3).\nAnd He Almighty said: {Then whoever wills will remember it (55) And they will not remember except that Allah wills. He is worthy of fear and worthy to forgive (56)} [Al-Muddaththir: 55-56]. ({And they will not remember except that Allah wills} - For Allah's Will is executively general; neither little nor much event exits it. In it is a refutation of the Qadariyyah who do not include the actions of servants under Allah's Will, and the Jabriyyah who claim that the servant has no will nor action in reality, but is forced in his actions. So He Almighty affirmed for the servants a will in reality and action, and made that subordinate to His Will) (4).\nAnd He Almighty said: {And if Allah had willed, they would not have done it, so leave them and that which they invent (137)} [Al-An'am: 137]. Ibn Kathir said: (Meaning this happened by His Will Almighty, His Want, and His Choice for that to be, and He has the perfect wisdom in that, He is not questioned about what He does, but they will be questioned) (5).",
    "foot_note": "1. Tafsir Ibn Kathir (4/ 568 - 570).\n2. Narrated by Al-Bukhari in Book of Interpretation, Surah Al-Rahman (8/ 620 - Fath Al-Bari).\n3. Tafsir Ibn Kathir (4/ 512).\n4. Tafsir Ibn Sa'di (7/ 520).\n5. Tafsir Ibn Kathir (2/ 186).",
    "book_id": "70",
    "new_page_number": 14
  },
  {
    "serial_number": "97901",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "And on the authority of Abdullah bin Amr bin Al-Aas, may Allah be pleased with them both, that he heard the Messenger of Allah, peace and blessings be upon him, say: «Indeed, the hearts of the children of Adam are all between two fingers of the fingers of the Most Merciful as one heart, He turns it how He wills.» Then the Messenger of Allah, peace and blessings be upon him, said: «O Allah, Turner of the hearts, turn our hearts to Your obedience» (1). (The meaning of the Hadith is that He, Glory be to Him and Most High, disposes the hearts of His servants and others how He wills; nothing of them is impossible for Him, nor does what He wanted escape Him) (2).\n\nThe Fourth Level: Creation and Formation (Al-Khalq wa Al-Takwin):\nIt is that Allah Almighty is the Creator and Originator of all things, of essences, attributes, and actions, and that includes the actions of servants.\nThe evidences for this level are many, including His saying Almighty: {While Allah created you and that which you do (96)} [As-Saffat: 96], (Meaning He created you and created your actions) (3).\nAnd He Almighty said: {Say, \"Allah is the Creator of all things, and He is the One, the Prevailing\" (16)} [Ar-Ra'd: 16], (Al-Zajjaj said: And the meaning is that He is the Creator of everything that is valid to be created) (4).\nAnd He Almighty said: {Allah is the Creator of all things, and He is, over all things, Disposer of affairs (62)} [Az-Zumar: 62], (This phrase and similar ones, which are many in the Quran, indicate that all things - other than Allah and His Names and Attributes - are created) (5).\nOn the authority of Hudhayfah, may Allah be pleased with him, he said: The Messenger of Allah, peace and blessings be upon him, said: «Verily, Allah makes every maker and his making» (6). (Some of them recited at that {While Allah created you and that which you do (96)} [As-Saffat: 96], so He informed that industries and their people are created) (7). (8)",
    "foot_note": "1. Narrated by Muslim: Book of Qadar, Chapter: Allah turning hearts how He wills (16/ 203 - Sharh Al-Nawawi).\n2. Sharh Al-Nawawi on Muslim (16/ 203).\n3. Fath Al-Qadir (4/ 402).\n4. Fath Al-Qadir (2/ 74).\n5. Tafsir Ibn Sa'di (6/ 489).\n6. Authentic Hadith, narrated by Al-Bukhari, in Kitab Khalq Af'al al-Ibad p. 39, Second Edition, investigation by Dr. Abdul Rahman Amira, Dar Ukaz, Jeddah, and Ibn Abi Asim in Al-Sunnah with the wording «Verily Allah is the Creator of every maker and his making», see Al-Jami Al-Sahih fi Al-Qadar, p. 125. Al-Albani said: Authentic Hadith, Kitab Al-Sunnah by Ibn Abi Asim p. (1/ 158), Second Edition, investigation by Al-Albani, Al-Maktab Al-Islami, Beirut, 1405 AH. And it is extracted in Al-Sahihah Number (1637).\n7. Khalq Af'al al-Ibad by Al-Bukhari, p. 46.\n8. See: Majmoo' Fatawa of Sheikh Abdul Aziz bin Baz, (3/ 476 - 480), Ma'arij Al-Qabul (3/ 920 - 940), Shifa al-Alil (29 - 39).",
    "book_id": "70",
    "new_page_number": 15
  },
  {
    "serial_number": "97902",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "Chapter Three: Schools of Thought of People in Destiny\n\nSection One: The Cause of Disagreement in Destiny\n(The disagreement in Destiny revolves around two matters: One: What relates to Allah Almighty, concerning the four levels of Destiny: Knowledge, Writing, Will, and Creation, which Ahl al-Sunnah wal-Jama'ah affirm for Allah Almighty. Second: What relates to the servant, does he have will and volition or not? Does he have power or not? Is he a doer of his action in reality or not?) (1).\nThe cause of the deviation of sects is their turning away from the Straight Path which Allah commanded us to follow, saying: {And, [moreover], this is My path, which is straight, so follow it; and do not follow [other] ways, for you will be separated from His way} [Al-An'am: 153], and delving into the Action of the Lord with a cause (reason/why).\nSheikh Al-Islam said: And the root of the error of creation in every sect is delving into the act of the God with a cause (2). (For the Qadariyyah [Nufah - Negators] who denied Destiny said: Allah does not want disbelief, sins, and disobedience, nor does He love or approve of them, so how can we say He created the actions of servants which contain disbelief, sins, and disobedience? And the Qadariyyah Mujbirah [Compulsionists] believed that Allah is the Creator of everything, and claimed that everything He created and brought into existence, He loved and approved of. And Ahl al-Sunnah wal-Jama'ah saw the whole truth, so they believed in the truth that each of the two groups had, and negated the falsehood that each of them was clothed with. So they say: Allah, even if He wills disobedience by Destiny (Qadar), He does not love it, nor approve of it, nor command it; rather He hates it and forbids it) (3).",
    "foot_note": "1. Abdul Rahman Al-Mahmoud, Al-Qada wa Al-Qadar, p. 301.\n2. Al-Durra Al-Bahiyyah Sharh Al-Qasidah Al-Ta'iyyah fi Hall Al-Mushkilah Al-Qadariyyah by Sheikh Al-Islam, authored by Abdul Rahman bin Sa'di, p. 25, Maktabat Al-Ma'arif, Riyadh, 1406 AH.\n3. Umar Al-Ashqar, Al-Qada wa Al-Qadar, p. 103, Third Edition, Dar Al-Nafais, Jordan, 1415 AH.",
    "book_id": "70",
    "new_page_number": 16
  },
  {
    "serial_number": "97903",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "Section Two: Schools of Thought of People in Destiny\n\nFirst: The Jahmiyyah (1):\n(They claimed that the generality of Allah's Will and the generality of His Volition imply: That the servant is forced in his actions, compelled and coerced in his sayings and deeds: he has no power over anything of obedience, nor over leaving disobedience) (2). (They say that servants are forced in their actions, having no power, will, or choice. And Allah alone is the Creator of servants' actions, and their deeds are attributed to them metaphorically) (3).\n\nSecond: The Mu'tazila (4):\nThey are Qadariyyah in the chapter of Destiny. The Qadariyyah (5) are divided into two sections:\nFirst Qadariyyah: These are the extremists who denied Destiny and denied Allah's prior Knowledge of matters. (They say that Allah does not know the actions of servants before they do them, nor did Allah's Will attach to them. When the Muslims denounced them and declared them disbelievers for that: they shifted from their first saying and affirmed Knowledge but denied Destiny. Therefore, Imams like Imam Ahmad and others used to say: Debate the Qadariyyah with Knowledge; if they deny Knowledge, they have disbelieved, and if they admit it, they are defeated) (6).",
    "foot_note": "1. Jahmiyyah: Followers of Jahm bin Safwan, who is from the pure Jabriyyah. His innovation appeared in Tirmidh, and Muslim bin Ahwaz killed him in Marw at the end of the Umayyad reign. He agreed with the Mu'tazila in negating eternal attributes and exceeded them in things. He claimed that Paradise and Hell will perish and vanish, and that Faith is knowledge of Allah only. See: Al-Milal wa Al-Nihal by Al-Shahrastani, p. 36, Second Edition, Dar Maktabat Al-Mutanabbi, Beirut 1992 AD. And Al-Farq bayn Al-Firaq by Al-Baghdadi, p. 194, First Edition, commentary by Ibrahim Ramadan, Dar Al-Ma'rifah, Beirut, 1415 AH. And Mu'jam Alfaz Al-Aqidah, classified by Amer Falih, p. 128, First Edition, Maktabat Al-Obeikan, Riyadh, 1417 AH.\n2. Al-Durra Al-Bahiyyah Sharh Al-Qasidah Al-Ta'iyyah, p. 22.\n3. Al-Qada wa Al-Qadar by Abdul Rahman Al-Mahmoud p. 302.\n4. Mu'tazila: Followers of Wasil bin Ata and Amr bin Ubayd. Named so because they withdrew (I'tazalu) from the gathering of Hasan Al-Basri, may Allah have mercy on him. Their creed principles are five: Justice, Monotheism, Promise and Threat, the Station between two Stations, and Enjoining Good and Forbidding Evil. See: Al-Farq bayn Al-Firaq p. 112, Al-Milal wa Al-Nihal p. 21, and Mu'jam Alfaz Al-Aqidah p. 377.\n5. Named Qadariyyah for their denial of Destiny (Qadar). Also, the Jabriyyah who argue using Destiny are called Qadariyyah, but the name is more prevalent for the first sect. Sharh Al-Aqidah Al-Tahawiyyah by Ibn Abi Al-Izz p. (1/ 79), and (2/ 797), Mu'jam Alfaz Al-Aqidah p. 316.\n6. Al-Durra Al-Bahiyyah Sharh Al-Qasidah Al-Ta'iyyah p. 20, Majmoo' Al-Fatawa (8/ 450), collected by Abdul Rahman Ibn Qasim, Maktabat Ibn Taymiyyah, Cairo.",
    "book_id": "70",
    "new_page_number": 17
  },
  {
    "serial_number": "97904",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "(This sect which denies Allah's prior Knowledge has vanished or nearly so. Al-Saffarini says: Scholars said the deniers of this have become extinct, and they are the ones whom Imam Malik, Al-Shafi'i, Ahmad, and other Imams declared disbelievers because of it) (1).\n\nSecond Qadariyyah: They claimed (that the actions of servants, their obediences and disobediences, did not enter under Allah's Decree and Destiny. So they affirmed Allah's power over the essences of creatures and their descriptions, and denied His power over the actions of the accountable ones. They said: Allah did not want them nor will them from them, rather: they are the ones who wanted them, willed them, and did them, independently without Allah's Will) (2). (These say that the actions of servants are not created by Allah, but rather the servants are the creators of them. This is the school of the Mu'tazila and those who agreed with them. They deny the two levels of Will and Creation, negating them from Allah Almighty and affirming them for the human) (3).\n\nThird: The Ash'aris (4):\nThese say: (Allah Almighty is the Creator of servants' actions, so they affirm the two levels of Will and Creation, but they say: The voluntary actions of servants occur by Allah Almighty's Power alone, and their [servants'] power has no effect on them. Rather, Allah Almighty made it His custom to create in the servant power and choice, so if there is no impediment, He creates His decreed action in him concurrently with them. So the action is created by Allah, originating and inventing, and acquired (Kasb) by the servant. The meaning of him acquiring it is: its concurrence with his power and will without there being any effect or entry from him in its existence other than being a locus for it) (5). Thus, they opposed the Mu'tazila who say that Allah does not create the actions of servants but rather they are the creators of them. But they said it is an Acquisition (Kasb) for the servants. (They wanted to reconcile between the Jabriyyah and the Qadariyyah, so they came with the theory of Kasb. In its outcome, it is pure Compulsion (Jabr), because it negates any power or influence for the servant. As for its theoretical philosophical reality, the Ash'aris themselves were unable to understand it, let alone explain it to others. For this reason, it was said: Among what is said but has no reasonable reality under it approaching understanding... is Kasb according to Al-Ash'ari, the State (Hal) according to Al-Bahshami, and the Leap (Tafra) of Al-Nazzam) (6).",
    "foot_note": "1. Al-Qada wa Al-Qadar by Umar Al-Ashqar, p. 57.\n2. Al-Durra Al-Bahiyyah Sharh Al-Qasidah Al-Ta'iyyah p. 17.\n3. Al-Qada wa Al-Qadar by Abdul Rahman Al-Mahmoud p. 305.\n4. Ash'aris: Companions of Abu Al-Hasan Ali bin Ismail Al-Ash'ari. They affirm seven attributes for Allah, say reason takes precedence over revelation in conflict, interpret the verses of attributes, and do not use solitary Hadiths as proof in creed. Mu'jam Alfaz Al-Aqidah p. 42, Al-Milal wa Al-Nihal p. 40. See for benefit: Mawqif Ibn Taymiyyah min Al-Asha'irah by Abdul Rahman Al-Mahmoud, Maktabat Al-Rushd, Riyadh.\n5. Al-Qada wa Al-Qadar by Abdul Rahman Al-Mahmoud p. 311.\n6. Manhaj Al-Asha'irah fi Al-Aqidah, by Sheikh Safar Al-Hawali, p. 43, First Edition, Al-Dar Al-Salafiyyah, Kuwait, 1407 AH. See: Shifa al-Alil p. 121.",
    "book_id": "70",
    "new_page_number": 18
  },
  {
    "serial_number": "97905",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "Fourth: Creed of Ahl al-Sunnah wal-Jama'ah:\nAl-Tahawi, may Allah have mercy on him, explaining the creed of Ahl al-Sunnah said: (He created creation with His knowledge, determined for them destinies, set for them life spans. Nothing was hidden from Him before He created them, and He knew what they would do before He created them. He commanded them to obey Him and forbade them from disobeying Him. Everything runs according to His estimation and Will, and His Will is executed. Servants have no will except what He willed for them; so what He willed for them happened, and what He did not will did not happen. He guides whom He wills, protects and grants well-being out of grace; and He misguides whom He wills, forsakes and tests out of justice. All of them fluctuate in His Will between His grace and His justice. He is exalted above opposites and peers. There is no repeller of His decree, no adjuster of His judgment, and no one to overcome His command. We have believed in all of that, and are certain that all is from Him) (1).\nThen he said: (And the Covenant which Allah Almighty took from Adam and his offspring is true. And Allah knew in pre-eternity the number of those who enter Paradise and the number of those who enter the Fire as a single total; that number is not increased nor decreased. Likewise their actions, [He knew] what He knew of them that they would do. Everyone is facilitated for what he was created for. Deeds are by their endings. The happy one is he who is happy by Allah's decree, and the miserable one is he who is miserable by Allah's decree. The principle of Destiny is Allah's secret in His creation; no drawn-near angel nor sent prophet has reviewed that. Delving deeply and looking into that is a means of forsakenness, a ladder to deprivation, and a degree of transgression. So beware, all beware of that in looking, thinking, and whispering. For Allah Almighty folded the knowledge of Destiny from His creatures, and forbade them from seeking it, as He Almighty said in His Book: {He is not questioned about what He does, but they will be questioned (23)} [Al-Anbiya: 23]. So whoever asks: Why did He do? has rejected the judgment of the Book, and whoever rejects the judgment of the Book is among the disbelievers) (2).\nThen he also said: (And we believe in the Tablet and the Pen, and in all that was inscribed in it. If all creation gathered on something Allah Almighty wrote in it that it would exist, to make it non-existent, they would not be able to. And if they gathered on something Allah Almighty did not write in it, to make it exist, they would not be able to. The Pen has dried with what will exist until the Day of Resurrection. What missed the servant was not going to hit him, and what hit him was not going to miss him. The servant must know that Allah's knowledge preceded in every being of His creation, so He estimated that with a firm, precise estimation. There is no nullifier for it, no adjuster, no remover, no changer, no diminisher, and no increaser from His creation in His heavens and earth. That is from the knot of Faith, the principles of Knowledge, and the acknowledgment of Allah Almighty's Oneness and Lordship, as He Almighty said in His Book: {and created each thing and determined it with [precise] determination (2)} [Al-Furqan: 2], and He Almighty said: {And ever is the command of Allah a decree determined (38)} [Al-Ahzab: 38]. So woe to whoever becomes an adversary to Allah Almighty in Destiny, bringing to look into it a sick heart. He has sought with his illusion in investigating the Unseen a concealed secret, and returned with what he said as a sinful liar) (3).",
    "foot_note": "1. Al-Aqidah Al-Tahawiyyah by Imam Abu Ja'far Ahmad bin Muhammad Al-Tahawi, p. 12-13, First Edition, commentary by Sheikh Abdul Aziz bin Baz, Maktabat Ibn Taymiyyah, Cairo, 1415 AH.\n2. Al-Aqidah Al-Tahawiyyah p. 22-23.\n3. Al-Aqidah Al-Tahawiyyah p. 26-28.",
    "book_id": "70",
    "new_page_number": 19
  },
  {
    "serial_number": "97906",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "Sheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him, said: (The school of Ahl al-Sunnah wal-Jama'ah in this chapter and others is what the Book and Sunnah indicated, and what the First Predecessors of the Muhajireen and Ansar and those who followed them in goodness were upon. It is that Allah is the Creator of everything, its Lord and King. Included in that are all entities existing by themselves and their attributes existing in them, of servants' actions and other than servants' actions. And that He, Glory be to Him, whatever He willed happened, and whatever He did not will did not happen. Nothing exists in existence except by His Will and Power. Nothing He willed is impossible for Him; rather He is capable of all things, and He does not will a thing unless He is capable of it. And that He - Glory be to Him - knows what was, what is, and what did not happen, if it were to happen, how it would be. Included in that are the actions of servants and others. Allah estimated the destinies of creatures before creating them; He estimated their life spans, provisions, and deeds, and wrote that, and wrote what they will end up to of happiness and misery. So they believe in His creation of everything, His power over everything, His will for everything that happened, His knowledge of things before they are, His estimating of them, and His writing of them before they are) (1).\nUntil he said: (The predecessors of the Nation and its Imams are also agreed that servants are commanded with what Allah commanded them, forbidden from what He forbade them. And agreed on believing in His promise and threat which the Book and Sunnah spoke of. And agreed that no one has an argument against Allah in a duty left or a prohibition committed; rather Allah has the conclusive argument against His servants) (2).\nHe said: (Among what the predecessors of the Nation and its Imams agreed upon along with their belief in Destiny and Decree, and that Allah is the Creator of everything, and that whatever He willed happened and whatever He did not will did not happen, and that He misguides whom He wills and guides whom He wills, is that servants have will and power, doing by their will and power what Allah empowered them to do, along with their saying: Servants do not will except that Allah wills, as Allah Almighty said: {No! Indeed, the Qur'an is a reminder (54) Then whoever wills will remember it (55) And they will not remember except that Allah wills. He is worthy of fear and worthy to forgive (56)} [Al-Muddaththir: 54-56]) (3).\nHe also said: (The school of Ahl al-Sunnah wal-Jama'ah is that Allah Almighty is the Creator of everything and its King, there is no Lord other than Him and no Creator besides Him. Whatever He willed happened and whatever He did not will did not happen. He is over all things competent, and of all things Knowing. The servant is commanded to obey Allah and obey His Messenger, and forbidden from disobeying Allah and disobeying His Messenger. So whoever obeys, that is a blessing, and whoever disobeys is deserving of blame and punishment. Allah has the conclusive argument against him, and no one has an argument against Allah Almighty. All of that was by Allah's Decree, Destiny, Will, and Power. However, He loves obedience and commands it, rewards its people for doing it and honors them. And He hates disobedience and forbids it, and punishes its people and humiliates them.",
    "foot_note": "1. Majmoo' Fatawa Sheikh Al-Islam (8/ 449 - 450).\n2. Previous Reference (8/ 452).\n3. Previous Reference (8/ 459).",
    "book_id": "70",
    "new_page_number": 20
  },
  {
    "serial_number": "97907",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "Whatever befalls the servant of blessings, Allah bestowed them upon him. And whatever befalls him of evil is by his sins and disobedience as He Almighty said: {And whatever strikes you of disaster - it is for what your hands have earned} [Ash-Shura: 30] and He Almighty said: {What comes to you of good is from Allah, but what comes to you of evil, [O man], is from yourself} [An-Nisa: 79], meaning whatever comes to you of fertility, victory, and guidance, Allah bestowed it upon you, and whatever comes to you of sadness, humiliation, and evil is by your sins and errors. All things exist by Allah's Will, Power, and Creation. So the servant must believe in Allah's Decree and Destiny, and the servant must be certain of Allah's Law and Command. Whoever looks at the Truth of Destiny and turns away from Command, Prohibition, Promise, and Threat resembles the polytheists. And whoever looks at Command and Prohibition and denies Destiny and Decree resembles the Magians. And whoever believes in this and that, so if he does good he praises Allah Almighty, and if he does evil he asks forgiveness of Allah Almighty, and knows that is by Allah's Decree and Destiny, he is among the believers) (1).\nAl-Qahtani, may Allah have mercy on him, said in his Nuniyyah:\nThe pillar of religion is to believe in Decree ... There is no good in a house without pillars\nAllah knew happiness and misery ... And they and their status are opposites\nThe weak servant possesses no guidance for himself ... Nor is he capable of forsakenness\nGlory be to Him who runs matters with wisdom ... In creation with provisions and deprivation\nHis Will was executed with His preceding knowledge ... In His creation, justly without aggression\nAnd all is in the Mother of the Book inscribed ... Without negligence or decrease\nSo be moderate, you are guided, and do not be extremist ... Indeed pots overflow with boiling (2)",
    "foot_note": "1. Previous Reference (8/ 63 - 64).\n2. Nuniyyah Al-Qahtani, by Abu Muhammad Abdullah bin Muhammad Al-Andalusi, p. 15, Third Edition, correction and commentary by Muhammad bin Ahmad, Maktabat Al-Sawadi, Jeddah, 1415 AH.",
    "book_id": "70",
    "new_page_number": 21
  },
  {
    "serial_number": "97908",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "Chapter Four: Fruits of Belief in Destiny and Decree\nBelief in Destiny in the correct manner yields majestic fruits that return to individuals and societies, in this world and the Hereafter. Among those fruits are the following:\n1 - That Faith is not complete except by believing in Destiny: This fruit is the greatest of fruits, for the servant is not a believer until he believes in the six pillars of Faith, including belief in Destiny and Decree. On the authority of Umar bin Al-Khattab, may Allah be pleased with him, regarding Gabriel, peace be upon him, asking the Messenger, peace and blessings be upon him, about Faith. He said: «To believe in Allah, His angels, His books, His messengers, the Last Day, and to believe in Destiny (Al-Qadar), its good and its bad. He [Gabriel] said: You have spoken the truth» (1).\nAnd on the authority of Jabir, may Allah be pleased with them both, he said: The Messenger of Allah, peace and blessings be upon him, said: «A servant does not believe until he believes in Destiny, its good and its bad from Allah, and until he knows that what hit him was not going to miss him, and what missed him was not going to hit him» (2).\n2 - Among the fruits of belief in Destiny: Complete faith prevents entering the Fire, and faith even if little prevents eternity in it (3): This is related to the fruit before it. If he realizes faith - and he cannot realize it except by believing in Destiny - that prevents him from entering the Fire. But if faith is deficient due to the weakness of his belief in Destiny, that deficiency might be a cause for his entering the Fire; but he will not stay eternally in it. Allah Almighty said: {They who believe and do not mix their belief with injustice - those will have security, and they are [rightly] guided (82)} [Al-An'am: 82].\n3 - Among the fruits of belief in Destiny: Obtaining the taste of Faith, forgiveness of sins, and entering Paradise: No one will taste the flavor of Faith except the one who is pleased with Allah's destiny upon him. Therefore, the Prophet, peace and blessings be upon him, said: «He has tasted the flavor of Faith who is pleased with Allah as a Lord, Islam as a religion, and Muhammad as a Messenger» (4). Being pleased with that implies rejoicing in it, and happiness with Allah's Lordship and the goodness of His management and decrees upon him (5).",
    "foot_note": "1. Previously referenced p. 1 footnote number 1.\n2. Previously referenced p. 6 footnote number 4.\n3. Al-Tawdih li Shajarat al-Iman p. 73, First Edition, cared for by Ashraf Abdul Maqsoud, Adwa' Al-Salaf, Riyadh, 1419 AH.\n4. Narrated by Muslim, Book of Faith, Chapter: He has tasted the flavor of Faith (2/ 2 - Sharh Al-Nawawi).\n5. Ibn Sa'di, Al-Tawdih wa Al-Bayan li Shajarat al-Iman p. 30.",
    "book_id": "70",
    "new_page_number": 22
  },
  {
    "serial_number": "97909",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "Belief in Allah's Lordship also implies faith and submission to His management of every affair of the servant, and indeed the affairs of the entire universe. Whoever reaches this station of contentment deserves forgiveness, for the Prophet, peace and blessings be upon him, says: «Whoever says when he hears the Muazzin: 'And I testify that there is no god but Allah alone, with no partner, and I testify that Muhammad is His servant and Messenger, I am pleased with Allah as a Lord, with Muhammad as a Messenger, and with Islam as a religion,' his sin is forgiven» (1). Indeed, the effect of this extends to the Day of Resurrection, until it becomes a right upon Allah to please him and admit him to Paradise. The Prophet, peace and blessings be upon him, says in what he narrates from his Lord: «My servant has no reward with Me when I take his beloved from the people of the world, then he seeks reward [for patience], except Paradise» (2).\n4 - Among the fruits of belief in Destiny: Realizing Servitude (Ubudiyyah) to Allah Almighty: It is the goal for which the wayfarers strived, the intenders aimed, and the workers looked. So his eye finds comfort in his Lord, his heart dwells in Him, his limbs are reassured by Him, His remembrance takes over the tongue of His lover and his heart, and the limbs submit to His obedience (3). That is because he is a servant of Allah, nurtured by Him, He disposes of him however He wills. So he is pleased and submits to Allah's Decree and Destiny. He knows that Allah Almighty's withholding from His believing loving servant is giving, and His testing him is wellness. Sufyan Al-Thawri said: His withholding is giving, that is: He did not withhold out of miserliness or lack, but He looked at the good of His believing servant so He withheld from him by choice and good consideration. This is as he said; for Glory be to Him, He does not decree for His believing servant a decree except that it is good for him, whether that decree saddened him or pleased him. So His decree for His believing servant of withholding is giving; even if it is in the form of withholding. And a blessing even if it is in the form of an ordeal. And His trial is wellness; even if it is in the form of tribulation. But due to the servant's ignorance and injustice, he does not count giving, blessing, and wellness except what he finds pleasure in immediately, and was suitable for his nature. If he were granted a plentiful share of knowledge, he would count withholding as a blessing, and tribulation as mercy, and would enjoy tribulation more than his enjoyment of wellness, and enjoy poverty more than his enjoyment of wealth, and would be in the state of scarcity more grateful than in the state of abundance (4). And he would be like the Bedouin who woke up having lost many camels, so he said:\nNo, by the One whom I am a servant in His worship ... Were it not for the gloating of enemies with grudges\nI would not have been pleased that my camels were in their resting places ... And that something Allah decreed had not happened (5)",
    "foot_note": "1. Narrated by Muslim, Book of Prayer, Chapter: Desirability of saying like the saying of the Muazzin (4/ 86 - Sharh Al-Nawawi).\n2. Narrated by Al-Bukhari, Book of Al-Riqaq, Chapter: The deed by which Allah's Face is sought (11/ 241 - Fath Al-Bari).\n3. Madarij Al-Salikin p. (1/ 430 - 431), investigation by Muhammad Hamid Al-Fiqi, Dar Al-Rashad Al-Hadithah, Casablanca, Morocco.\n4. Previous Reference (2/ 215 - 216).\n5. Mukhtasar Minhaj Al-Qasidin by Al-Maqdisi, p. 338, Second Edition, commentary by Abdullah Al-Ansari, Dar Al-Ma'rifah, Beirut, 1416 AH.",
    "book_id": "70",
    "new_page_number": 23
  },
  {
    "serial_number": "97910",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "Ibn al-Qayyim said: (To Allah, Glory be to Him, upon His servant is a command He commanded him with, a decree He decrees upon him, and a blessing He bestows upon him. He is never separated from these three. The decree is of two types: either calamities or defects/sins. And He has upon him servitude in all these levels. The most beloved of creation to Him is he who knows his servitude in these levels and fulfills its right; this one is the closest of creation to Him. And the furthest of them from Him is he who is ignorant of his servitude in all these levels. So his servitude in the Command is: his compliance, sincerely and following the Messenger of Allah, peace and blessings be upon him. And in the Prohibition: avoiding it, out of fear of Him, reverence, and love. And his servitude in the decree of Calamities is: Patience over them, then Contentment (Rida) with them, which is higher than it, then Gratitude for them, which is higher than Contentment. This is only possible if His love is established in his heart, and he knows His good choice for him, His kindness to him, His gentleness with him, and His benevolence to him through the calamity, even if he hates the calamity. And his servitude in the decree of Defects/Sins is: Hastening to repent from them, clearing oneself, and standing in the station of apology and brokenness, knowing that no one lifts them but Him, and no one protects from their evil but Him. And that if they continue, they distance him from His proximity, and expel him from His door. So he sees them as the harm that no one uncovers but Him, until he sees them as greater than the harm of the body... As for the servitude of Blessings, it is knowing them and acknowledging them first, then seeking refuge in Him lest his heart attributes and ascribes them to other than Him; even if it is a cause among causes, He is its Causer and Establisher. So the blessing is from Him alone in every aspect and consideration, then praising Him for it, loving Him for it, and thanking Him by using it in His obedience) (1).\nIn belief in Destiny is: Acknowledging that he is nurtured, managed, commanded, forbidden; he only acts by the ruling of Servitude, not by the ruling of choice for himself. Allah Almighty is the One disposing of him; his soul is in the hand of his Lord and Master, his forelock is in His hand, his heart is between two fingers of His fingers. His death, life, happiness, misery, wellness, and trial are all to Him, Glory be to Him; the servant has nothing of it. He is a servant of Allah in all aspects, small and big, alive and dead, obedient and disobedient, healthy and afflicted, with spirit, heart, tongue, and limbs (2).",
    "foot_note": "1. Al-Fawaid p. 46 - 47, arrangement and commentary by Ali Hasan Abdul Hamid, Dar Ibn Al-Jawzi, Dammam, 1417 AH.\n2. Al-Fawaid p. 50 - 52.",
    "book_id": "70",
    "new_page_number": 24
  },
  {
    "serial_number": "97911",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "5 - Among the fruits of belief in Destiny: That belief in Destiny is a path to the Tawhid (Monotheism) of Allah: (It is to witness the singling out of the Lord Blessed and Exalted in Creation and Judgment, and that whatever He willed happened and whatever He did not will did not happen, and that no atom moves except by His permission. And that creatures are subjugated under His grip, and that there is no heart except that it is between two fingers of His fingers. If He wills to set it right He sets it right, and if He wills to deviate it He deviates it. Hearts are in His hand. He is their Turner and Disposer how He wills and how He wants. And that He is the One who gave the souls of believers their piety, and He is the One who guided and purified them, and inspired the souls of the wicked and made them miserable. Whom Allah guides there is no misleader for him, and whom He misguides there is no guide for him. He guides whom He wills by His bounty and mercy, and misguides whom He wills by His justice and wisdom. This is His bounty and giving, and the bounty of the Generous is not with obligation [from recipient]. And this is His justice and decree {He is not questioned about what He does, but they will be questioned (23)} [Al-Anbiya: 23]) (1).\n(By this, the servant realizes the station of {It is You we worship and You we ask for help (5)} in knowledge and state. The servant's foot becomes firm in Tawhid of Lordship, then he ascends from it to Tawhid of Divinity. For if he becomes certain that harm and benefit, giving and withholding, guidance and misguidance, happiness and misery: all that is in the hand of Allah not in the hand of anyone else, and that He is the One who turns hearts and disposes them how He wills, and that there is no successful one except whom He granted success and helped, and no forsaken one except whom He forsook, humiliated and abandoned. And that the healthiest of hearts, the soundest, most upright, thinnest, purest, strongest and softest of them: is the one who took Him alone as God and Object of Worship. So He was more beloved to him than anything else, more feared by him than anything else, and more hoped for by him than anything else. So His love advances in his heart over all loves, so loves follow it just as the army follows the Sultan. And fear of Him advances in his heart over all fears, so all fears follow His fear. And hope in Him advances in his heart over all hopes, so every hope follows His hope. This is the sign of Tawhid of Divinity in this heart, and the door from which he entered to it is Tawhid of Lordship. Meaning the door of Tawhid of Divinity: is Tawhid of Lordship) (2).\n6 - Among the fruits of belief in Destiny: Worshipping Allah through His Names and Attributes: It is knowing the connection of existence, in creation and command, to the Beautiful Names and Lofty Attributes, and its link to them, and that the world - with what is in it - is from some of their traces and requirements (3). For among His names, Glory be to Him, are \"The Perpetual Forgiver (Al-Ghaffar), The Accepter of Repentance (Al-Tawwab), The Pardoner (Al-Afuw)\". These names must have attachments. There must be a crime to be forgiven, a repentance to be accepted, and offenses to be pardoned. And there must be for His name \"The Wise (Al-Hakim)\" an attachment that appears in His judgment. Since the requirement of these names for their traces is like the requirement of the name \"The Creator, The Provider, The Giver, The Withholder\" for the created, the provided, the given, and the withheld. And these names are all beautiful.",
    "foot_note": "1. Madarij Al-Salikin (1/ 410).\n2. Previous Reference (1/ 411).\n3. Previous Reference (1/ 417).",
    "book_id": "70",
    "new_page_number": 25
  },
  {
    "serial_number": "97912",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "The Doctrine of Belief in Destiny and Decree According to the Predecessors and Its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "The Lord Almighty loves His Essence, His Attributes, and His Names. He is Pardoning who loves pardoning, loves forgiveness, and loves repentance. He rejoices over the repentance of His servant when he repents to Him with the greatest joy imaginable. The decreeing of what He forgives and pardons its doer for, and is forbearing towards, and accepts repentance for and tolerates: is from the requirement of His names and attributes, and the achievement of what He loves and is pleased with from that. And what He praises Himself with and the inhabitants of His heavens and earth praise Him with: is from the requirements of His perfection and the implication of His praise. He, Glory be to Him, is the Praiseworthy, the Glorious; and His Praise and Glory require their traces. From their traces: forgiving slips, cancelling stumbles, pardoning bad deeds, and tolerating crimes, along with complete power to exact the right, and knowledge from Him, Glory be to Him, of the crime and the amount of its punishment. So His forbearance is after His knowledge, His pardon is after His power, and His forgiveness is from the perfection of His might and wisdom. As the Messiah, peace be upon him, said: {If You should punish them - indeed they are Your servants; but if You forgive them - indeed it is You who is the Exalted in Might, the Wise (118)} [Al-Ma'idah: 118]. Meaning: Your forgiveness is out of the perfection of Your power and wisdom. You are not like one who forgives out of incapacity, and tolerates out of ignorance of the extent of the right. Rather, You are knowing of Your right, capable of exacting it, wise in taking it.\nFrom His names is The Wise (Al-Hakim). So he witnesses Allah's wisdom in His decreeing upon His servant what He hates and dislikes, Glory be to Him, and blames and punishes for. And that if He willed, He would have protected him from it, and intervened between him and it. And that He, Glory be to Him, is not disobeyed by force. And that nothing exists in the world except by His Will {Unquestionably, His is the creation and the command; blessed is Allah, Lord of the worlds (54) Call upon} [Al-A'raf: 54]. These witness that Allah, Glory be to Him, did not create anything in vain or pointlessly, and that He has profound wisdom in everything He estimated and decreed of good and evil, obedience and disobedience. A dazzling wisdom that minds are unable to encompass its essence, and tongues are weary of expressing. So the source of His decree and destiny, for what He hates and is displeased with: is His name \"The Wise\" whose wisdom dazzled the intellects. Allah Almighty said to His angels - when they said {Will You place upon it one who causes corruption therein and sheds blood, while we declare Your praise and sanctify You?} He answered them Glory be to Him saying {Indeed, I know that which you do not know (30)} [Al-Baqarah: 30]. For Allah, Glory be to Him, in the appearance of disobedience, sins, and crimes, and the resulting traces of signs and wisdoms, and types of introductions to His creation, diversifying His signs, and evidences of His Lordship, Oneness, Divinity, Wisdom, Might, completeness of His Dominion, perfection of His Power, and encompassing of His Knowledge -: has what people of insight witness clearly with the insight of their hearts, saying {Our Lord, You did not create this aimlessly; exalted are You} [Ali Imran: 191], it is but Your dazzling wisdom and Your apparent signs.",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 26
  },
  {
    "serial_number": "97913",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "And in every movement and stillness, He has a witness forever ... And in everything, He has a sign indicating that He is One (1). So whoever contemplates the flow of the effects of the Names and Attributes in the world and in the command, it becomes clear to him that the source of the decree of these crimes from the servants and their predestination is from the perfection of the Names, Attributes, and Actions. And their ends also: are the requirement of His praise and glory, just as it is the requirement of His Lordship and Divinity. For Him in everything He decreed and predestined is profound wisdom, dazzling signs, making Himself known to His servants through His Names and Attributes, inviting their love for Him, their remembrance of Him, their gratitude to Him, and their worship of Him through His beautiful Names (2).\n7 - Among the fruits of belief in Predestination: The realization of the Wala' (friendship/alliance) of Allah Almighty. Allah Almighty says: {Unquestionably, [for] the allies of Allah there will be no fear concerning them, nor will they grieve (62) Those who believed and were fearing Allah (63)} [Yunus: 62-63] (3). And among the matters that must be believed in is belief in Predestination; so if one does not believe in Predestination, he is not among the allies of Allah.\n8 - Among the fruits of belief in Predestination: That Allah defends those who believe. Allah Almighty says: {Indeed, Allah defends those who have believed} [Al-Hajj: 38]. He defends them against dislikes before they descend, and lifts them or lightens them after they descend (4). This is only for the believers, and among what they believe in is belief in Predestination.\n9 - Among the fruits of belief in Predestination: Allah's pleasure with him. For whoever is pleased with Allah as Lord, Allah is pleased with him. And whoever is pleased with his Lord, Glory be to Him, in all conditions, it bears fruit in his Lord's pleasure with him: If he is pleased with Him regarding little provision: his Lord is pleased with him regarding little deed. And if he is pleased with Him in all conditions, and they are equal to him, he finds Him the quickest thing to His pleasure if he seeks to please Him and courts Him (5).\n10 - Among the fruits of belief in Predestination: That it bequeaths the love of Allah Almighty for His servant. And there is no doubt that this is the highest of demands and the highest wish, that the servant attains the love of Allah, Blessed and Exalted is He, for him. Allah Almighty says addressing His Prophet, peace be upon him: {And when you have decided, then rely upon Allah. Indeed, Allah loves those who rely [upon Him] (159)} [Ali 'Imran: 159]. They are those pleased with His decree and submissive to His judgment regarding them, whether that agrees with their desire or opposes it (6). He, peace be upon him, said: \"If Allah loves a people, He tests them\" (7).",
    "foot_note": "1. Previous reference (1/406-407).\n2. Previous reference (1/419-420).\n3. Al-Tawdih li Shajarat Al-Iman p. 69.\n4. Previous reference p. 71-72.\n5. Madarij Al-Salikin (2/206).\n6. Al-Tawakkul 'ala Allah wa 'Alaqatuhu bil-Asbab by Abdullah Al-Dumaiji, p. 118, 1st Edition, Dar Al-Watan, Riyadh, 1417 AH.\n7. Narrated by Al-Tirmidhi, and narrated by Al-Tabarani in Al-Awsat. It is in Al-Silsilah Al-Sahihah No. 146.",
    "book_id": "70",
    "new_page_number": 27
  },
  {
    "serial_number": "97914",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "11 - Among the fruits of belief in Predestination: Trust in Allah Almighty. Because the believer in Allah's decree and predestination knows that Allah's decree for him contains good. Allah Almighty said to the mother of Moses: {And when you fear for him, cast him into the river and do not fear and do not grieve} [Al-Qasas: 7]. Her doing this is the essence of her trust in Allah Almighty, for had it not been for her complete trust in her Lord, she would not have cast her child and the piece of her liver into the current of water, with its waves and currents playing with him to wherever it ends or stops (1).\n12 - Among the fruits of belief in Predestination: Submission (Taslim), and it is of two types: submission to His religious command ruling, and submission to His cosmic predestined ruling. As for the first: it is the submission of the knowing believers. Allah Almighty says: {But no, by your Lord, they will not [truly] believe until they make you, [O Muhammad], judge concerning that over which they dispute among themselves and then find within themselves no discomfort from what you have judged and submit in [full, willing] submission (65)} [Al-Nisa: 65]. As for the second: it is submission to the cosmic ruling, which is the issue of being pleased with the decree. It is praiseworthy if the servant is not commanded to dispute and repel it, and is unable to do so, like calamities which he has no power to repel. As for the rulings which he is commanded to repel: it is not permissible for him to submit to them; rather, servitude is: repelling them with other rulings more beloved to Allah than them (2). The Messenger of Allah, peace be upon him, was affected by the loss of his son Ibrahim, but he said: \"The eye tears and the heart grieves, and we do not say except what pleases our Lord, and indeed we are grieved by your separation, O Ibrahim\" (3). So submission is freedom from the doubt of contradicting the report, or the desire of contradicting the command, or the will of contradicting sincerity, or an objection contradicting Predestination and Sharia. And the owner of this freedom: is the owner of the sound heart, whom none will be saved on the Day of Resurrection except the one who comes to Allah with it, for submission is the opposite of disputing (4).",
    "foot_note": "1. Madarij Al-Salikin (2/143).\n2. Madarij Al-Salikin (2/146).\n3. Narrated by Al-Bukhari, Book of Funerals, Chapter: The saying of the Prophet peace be upon him \"Indeed we are grieved by you\" (3/172 - Fath Al-Bari).\n4. Madarij Al-Salikin (2/147).",
    "book_id": "70",
    "new_page_number": 28
  },
  {
    "serial_number": "97915",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "13 - Belief in Predestination in the true sense reveals to a person the wisdom of Allah Almighty in what He decrees of good or evil. Thus, a person knows by that that behind his thinking and imaginations is One who is Greater and More Knowledgeable. Therefore, how often does a thing happen and we dislike it while it is good for us? How many people become annoyed and their chests tighten due to missing a beloved thing or the occurrence of a distress, and as soon as the matter unfolds and the secret of Predestination becomes clear, you find him joyful and happy, because the outcome was praiseworthy for him. And Allah Almighty spoke the truth when He says: {But perhaps you hate a thing and it is good for you; and perhaps you love a thing and it is bad for you. And Allah Knows, while you know not (216)} [Al-Baqarah: 216]. How beautiful is the saying of the one who said: How many a blessing whose thanks cannot be borne ... for Allah is hidden within the folds of dislikes. And the saying of the other: Matters run according to the judgment of Decree ... And within the folds of events are beloved and disliked things. Perhaps what I was warning against pleased me ... And perhaps what I was hoping for saddened me (1).\n14 - Among the fruits of belief in Predestination: That belief in Predestination opens the door of good character with Allah Almighty and with people. For good character comes from satisfaction, and bad character comes from discontent. Good character raises its owner to the degree of the one who fasts and stands in prayer, and bad character consumes good deeds just as fire consumes wood (2).\n15 - Among the fruits of belief in Predestination: Thinking well of Allah, and strength of hope: The believer in Predestination thinks well of Allah and has strong hope in Him in all his states. The saying of the poet applies to him: No decree touched me with harm or pleasure ... Except that I found a path to You through it. (Because he is knowledgeable of his Lord, thinking well of Him, not accusing Him regarding what He brings upon him of His judgments and decrees. So his good thought of Him necessitates the equality of states for him and his satisfaction with what his Master, Glory be to Him, chooses for him. And bad state and thinking [ill] of Allah is contrary to what He deserves. Satisfaction saves him from all that and opens for him the door of the paradise of this world before the paradise of the Hereafter) (3).",
    "foot_note": "1. See: Jannat Al-Rida fi Al-Taslim Lima Qaddara Allah wa Qada by Al-Gharnati p. 3/52, quoted from Al-Qada' wa Al-Qadar by Al-Hamad p. 29.\n2. Madarij Al-Salikin (2/220).\n3. Previous reference (2/206-207).",
    "book_id": "70",
    "new_page_number": 29
  },
  {
    "serial_number": "97916",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "16 - Among the fruits of belief in Predestination: Repentance and returning to Allah. For when a servant falls into sin, the harshness, hardness, and angry quality that he had towards anyone from whom a sin issued leaves his heart - such that if he had power over him he would destroy him, and perhaps he would pray to Allah to destroy him and take him out of anger for the sake of Allah and keenness that He not be disobeyed. So he finds no mercy in his heart for the sinful wrongdoers and sees them only with the eye of contempt and disdain, and mentions them only with the tongue of defamation, fault-finding, and dispraise. But when the decrees run upon him and he is left alone with himself, he seeks help from Allah, takes refuge in Him, and writhes before Him like a snake-bitten person, and calls upon Him with the call of the desperate. So that harshness towards sinners changes into tenderness, and that hardness towards wrongdoers into mercy and softness while upholding the limits of Allah. And his supplication against them changes into supplication for them, and he makes it a duty of his life to ask Allah to forgive them. How beneficial is this scene for them, and how great is its benefit for him, and Allah knows best (1).\n17 - Among the fruits of belief in Predestination: Fear and caution of Allah. The believer in Predestination is cautious of Allah, for no one feels secure from the plan of Allah except the losing people. So he is not deluded by his deeds no matter how many they are. For the hearts are between two fingers of the fingers of the Most Merciful, He turns them however He wills, and the endings are known to Allah Almighty.\n18 - Among the fruits of belief in Predestination: Reliance (Tawakkul), certainty, submission to Allah, and dependence on Him. Because the servant's satisfaction with Allah's management of him implies singling Him out for reliance, seeking help, trust, and dependence, and being satisfied with everything He does to him. Ibn al-Qayyim said: (Section: And the Beautiful Names and Lofty Attributes necessitate their effects of servitude and command, just as they necessitate their effects of creation and formation - I mean from the requirements of knowing them and realizing them. This is consistent in all types of servitude that are upon the heart and limbs. So the servant's knowledge of the Lord Almighty's uniqueness in harm, benefit, giving, withholding, creation, provision, giving life, and causing death produces for him the servitude of reliance on Him inwardly, and the requirements of reliance and its fruits outwardly) (2). As Allah Almighty said: {Say, \"Never will we be struck except by what Allah has decreed for us\"} [At-Tawbah: 51]. (So he rests then from worries, distresses, miseries, and regrets. And he burdens his whole being, his needs, and his interests upon One who does not mind carrying them, nor does it burden Him, nor does He care about it [due to His power]. So He takes charge of them without him, and shows him His kindness, righteousness, mercy, and benevolence in them without fatigue from the servant, nor exhaustion, nor concern from him, because he has directed his concern entirely to Him, and made Him alone his concern. So He diverted from him his concern for his needs and worldly interests, and emptied his heart of them. How good is his life! And how blissful is his heart and great is his joy and happiness! But if he refuses anything but his own management for himself, and his choice for it, and his concern for his share - without the right of his Lord - He leaves him to what he chose, and entrusts him to what he took charge of. So worry, distress, sadness, misery, fear, fatigue, bad state of mind, and bad condition attend him. So no heart is pure, no deed is pure, no hope is achieved, no rest is won, and no pleasure is enjoyed. Rather, a barrier has been placed between him and his joy, happiness, and delight. He toils in the world like the toil of a wild beast, and does not achieve hope from it, nor does he provision himself from it for a return [to the Hereafter]) (3).",
    "foot_note": "1. Previous reference (1/426).\n2. Miftah Dar Al-Sa'adah p. (2/90), edition of the Presidency of Scientific Research and Ifta, Riyadh.\n3. Al-Fawa'id p. 84-85.",
    "book_id": "70",
    "new_page_number": 30
  },
  {
    "serial_number": "97917",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "Reliance on Allah and dependence on Him does not contradict taking means. The Prophet, peace be upon him, was asked about dropping means in view of Predestination? He rejected that and obligated taking means, as in the Sahih from him, peace be upon him, that he said: \"There is none of you but his seat in Paradise and his seat in the Fire has been known. They said: O Messenger of Allah, shall we not leave acting and rely on the Book? He said: No, act, for everyone is facilitated for what he was created for\" (1). The monotheist who relies [on Allah]: does not turn to causes, meaning he does not feel secure with them, nor hope in them nor fear them, so he does not lean on them. And he does not turn [away] from them - meaning he does not drop them nor neglect them nor cancel them - rather he is establishing them, paying attention to them, looking at their Causer, Glory be to Him, and their Conductor. So reliance is not valid - religiously and rationally - except upon Him, Glory be to Him, alone (2). How well said by the one who said: Eyes stayed awake and eyes slept ... In affairs that will be or will not be. Indeed, a Lord who sufficed you yesterday regarding what was ... Will suffice you tomorrow regarding what will be (3).\n19 - Among the fruits of belief in Predestination: The good life. Allah Almighty says: {Whoever does righteousness, whether male or female, while he is a believer - We will surely cause him to live a good life, and We will surely reward them their due according to the best of what they used to do} [An-Nahl: 97]. So Allah Almighty informed and promised whoever combines faith and righteous deed with a good life in this abode, and with the good reward in this abode and in the Abode of Decision. The reason for that is clear, for the believers in Allah with correct faith - which includes belief in Predestination - which bears the fruit of righteous deed that reforms hearts, morals, this world and the Hereafter, have with them principles and foundations with which they receive all that comes upon them of causes of pleasure and joy, and causes of anxiety, worry and sorrows. They receive beloved things and joys with acceptance of them, gratitude for them, and using them in what is beneficial. If they use them in this manner, it creates for them joy in them, hope for their continuity and blessing, and hope for the reward of the thankful, great matters that surpass in their goodness and blessings these joys which are their fruits.",
    "foot_note": "1. Previously referenced p. 12 footnote No. 3.\n2. Madarij Al-Salikin (3/500).\n3. Jaddid Hayatak, Muhammad Al-Ghazali p. 27, 9th Edition, Dar Al-Qalam Damascus, 1416 AH.",
    "book_id": "70",
    "new_page_number": 31
  },
  {
    "serial_number": "97918",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "And they receive dislikes, harms, worry, and distress by resisting what they can resist, lightening what they can lighten, and beautiful patience for what they have no way to avoid. By that, they obtain from the effects of dislikes beneficial resistances, experiences, and strength, and from patience and seeking reward, great matters with which dislikes fade away, and joys and good hopes take their place, along with greed for Allah's favor and His reward. As the Prophet, peace be upon him, expressed this in the authentic hadith where he said: \"How wonderful is the affair of the believer, for his affair is all good. If something good happens to him, he gives thanks, and that is good for him. If something bad happens to him, he endures it patiently, and that is good for him. And this is for no one but the believer\" (1). So he, peace be upon him, informed that the believer's gain, good, and fruits of deeds multiply in everything that befalls him of joy and dislikes (2).\n20 - Among the fruits of belief in Predestination: That belief in Predestination is a way of salvation from Shirk (polytheism). The Majus (Zoroastrians) claimed: That Light is the creator of good, and Darkness is the creator of evil. And the Qadariyyah said: That Allah did not create the actions of servants. So they affirmed creators alongside Allah - Mighty and Majestic - and this is Shirk. Belief in Predestination in the correct manner is Tawhid (monotheism) of Allah.\n21 - Among the fruits of belief in Predestination: Sincerity. Indeed, all actions and sayings are only valid and complete according to what is established in the heart of their doer of faith and sincerity. Therefore, Allah mentions this condition which is the basis of every deed. Allah Almighty says: {So whoever does righteous deeds while he is a believer - no denial will there be for his effort} [Al-Anbiya: 94]. So if deeds are founded upon faith, and built upon it, the effort is thanked, accepted, multiplied, not an atom's weight of it is lost. But if the deed lacks faith, even if the worker spends his night and day [in it], it is not accepted. Allah Almighty says: {And We will regard what they have done of deeds and make them as scattered dust (23)} [Al-Furqan: 23] (3). (Belief in Predestination saves the servant from pleasing people with the wrath of Allah, and from blaming them for what Allah did not give him, and from praising them for what is the very favor of Allah. So he would be unjust to them in the first: which is pleasing and blaming them, and associating partners with them in the second: which is praising them. So if he is satisfied with the decree, he is saved from blaming and praising them. So satisfaction saves him from all that) (4). So the one who believes in Predestination does not work for the sake of people, knowing that they will not benefit him except with something Allah has written for him.",
    "foot_note": "1. Narrated by Muslim, Book of Zuhd, Chapter: Miscellaneous Hadiths (18/125 - Sharh Al-Nawawi).\n2. Ibn Sa'di, Al-Wasa'il Al-Mufidah lil-Hayat Al-Sa'idah, p. 11-12, 4th Edition, General Presidency for Scientific Research and Ifta Departments, 1409 AH.\n3. Al-Tawdih li Shajarat Al-Iman p. 73-74.\n4. Madarij Al-Salikin (2/223).",
    "book_id": "70",
    "new_page_number": 32
  },
  {
    "serial_number": "97919",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "22 - Among the fruits of belief in Predestination: That faith is the refuge of believers in everything that befalls them of joy and sadness, fear and security, obedience and disobedience, and other matters that are inevitable for everyone. So at times of beloved things and joy, they turn to faith, praising Allah, extolling Him, and using the blessings in what the Bestower loves. And at times of dislikes and sorrows, they turn to faith from several aspects: They console themselves with their faith and its sweetness. They console themselves with the consequent reward. And they meet sorrows and anxiety with peace of heart, and returning to the good life that resists sorrows and grieves. They turn to faith at times of fear, finding reassurance in it, and it increases them in faith, steadfastness, strength, and courage, and the fear that befell them fades away. Allah Almighty says: {Those to whom hypocrites said, \"Indeed, the people have gathered against you, so fear them.\" But it [only] increased them in faith, while they said, \"Sufficient for us is Allah, and [He is] the best Disposer of affairs.\" (173) So they returned with favor from Allah and bounty, no harm having touched them. And they pursued the pleasure of Allah, and Allah is the possessor of great bounty (174)} [Ali 'Imran: 173-174] (1). And they turn to faith if they are tested with some disobedience by initiating repentance from it, and doing what they can of good deeds to mend its deficiency. Allah Almighty says: {Indeed, those who fear Allah - when an impulse touches them from Satan, they remember [Him] and at once they have insight (201)} [Al-A'raf: 201] (2).\n23 - Among the fruits of belief in Predestination: That belief in Predestination is part of the happiness of the son of Adam, and his discontent is part of his misery. On the authority of Sa'd bin Abi Waqqas, may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said: \"From the happiness of the son of Adam: Seeking Allah's choice (Istikhara), and from the happiness of the son of Adam: His satisfaction with what Allah decreed. And from the misery of the son of Adam: His discontent with what Allah decreed, and from the misery of the son of Adam: Abandoning seeking Allah's choice\" (3). So satisfaction with the decree is one of the causes of happiness, and discontent with the decree is one of the causes of misery (4).",
    "foot_note": "1. Al-Tawdih li Shajarat Al-Iman p. 86-88.\n2. Usul Al-Tarbiyah Al-Islamiyyah p. 102-103.\n3. Narrated by Al-Tirmidhi, Chapter: What came regarding satisfaction with Predestination, and it is in Da'if Sunan Al-Tirmidhi by Al-Albani, No. 381, 1st Edition, Al-Maktab Al-Islami, Beirut, 1411 AH.\n4. Madarij Al-Salikin (2/208).",
    "book_id": "70",
    "new_page_number": 33
  },
  {
    "serial_number": "97920",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "24 - Among the fruits of belief in Predestination: Steadfastness and composure in facing calamities. Allah Almighty says: {No disaster strikes upon the earth or among yourselves except that it is in a register before We bring it into being - indeed that, for Allah, is easy - (22) In order that you not despair over what has eluded you and not exult [in pride] over what He has given you. And Allah does not like everyone self-deluded and boastful (23)} [Al-Hadid: 22-23]. Sheikh Abdur-Rahman Al-Sa'di said: (The Almighty says, informing about the generality of His decree and predestination: {No disaster strikes upon the earth or among yourselves}, and this includes the generality of calamities that strike creation, of good and evil. All of them have been written in the Preserved Tablet, small and large. This is a great matter that minds cannot encompass, rather the hearts of those of understanding are bewildered by it, but for Allah it is easy. Allah informed His servants of this so that this rule becomes established with them, and they base upon it what befalls them of good and evil. So they do not despair and grieve over what they missed, of what their souls aspired to and looked forward to, knowing that it is written in the Preserved Tablet, it must be executed and occur, there is no way to repel it. And they do not rejoice with what Allah gave them a joy of arrogance and insolence, knowing that they did not attain it by their power and strength, but rather attained it by Allah's favor and bounty. So they occupy themselves with thanking the Bestower of blessings and repelling punishments. Therefore He said: {And Allah does not like everyone self-deluded and boastful (23)}, meaning: arrogant, rude, coarse, self-admiring, boastful of Allah's blessings, attributing them to himself, and they make him transgress and distract him) (1). So when a person is balanced in his feelings in accepting calamities or joys, he becomes reassured in his life and stable in it as well (2).\n25 - Among the fruits of belief in Predestination: Upbringing on rationality and not explaining matters according to one's whim and interest. Rather, one must know that every cosmic phenomenon has benefits and harms, so he seeks its benefits and avoids its harms (3).\n26 - Among the fruits of belief in Predestination: Jihad, courage, and daring. Muslims became the bravest people and the most skilled horsemen. They used to fight enemies, keen on martyrdom, and keen to be in the front lines. No force terrified them and no multitude disturbed them, because the Muslim knows that weapons do not kill except the one whose term has approached. They knew that their refraining from Jihad in the way of Allah would not lift their term from them nor delay them an hour of the day (4).",
    "foot_note": "1. Tafsir Al-Sa'di: 842.\n2. Abdullah Al-Khater, Al-Huzn wa Al-Ikti'ab fi Daw' Al-Kitab wa Al-Sunnah, p. 35-37, Al-Muntada Al-Islami Edition, London.\n3. Abdur-Rahman Al-Nahlawi, Usul Al-Tarbiyah Al-Islamiyyah wa Asalibuha fi Al-Bayt wa Al-Madrasah wa Al-Mujtama', p. 104, 2nd Edition, Dar Al-Fikr, Damascus, 1403 AH.\n4. Sheikh Abdur-Rahman Al-Dawsari, and Saleh Al-Luhaidan, Tape: Athar Al-Iman bil-Qada' wa Al-Qadar 'ala Al-Mu'min, Tasjilat Al-Taqwa, No. 3362.",
    "book_id": "70",
    "new_page_number": 34
  },
  {
    "serial_number": "97921",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "For the one who believes in Predestination knows that he will not die until his term comes, and nothing will touch him except what is written for him. So he advances unafraid and indifferent to the harm and calamities that befall him in the way of Allah. Allah Almighty said: {And it is not [possible] for one to die except by permission of Allah at a decree determined} [Ali 'Imran: 145]. And as the Commander of the Faithful Ali bin Abi Talib, may Allah be pleased with him, said:\nOn which day of death shall I flee?\nThe day it is not decreed or the day it is decreed?\nThe day it is not decreed, I do not fear it.\nAnd if it is decreed, caution will not save (1).\n(If the believer is raised on daring before death, he becomes daring before everything. Before loss of wealth, child, or status, or before illness or any other calamity, as long as he believes that it is destined by Allah) (2).\n27 - Among the fruits of belief in Predestination: Calling to Allah (Da'wah). The correct understanding of belief in Predestination among the righteous Salaf was an incentive for them to spread the call to Allah. It made them strive to spread Islam in all parts of the earth, bear the harm in that, and be patient with it, knowing that what befell them was only by Allah's decree and predestination. We find that Islam extended from the ocean in the west to India in the east in a period of time not exceeding half a century! Which is a speed unmatched in history! With Islam spread the authority of the Islamic state in a way that terrified the enemies of Allah, and with it spread the Arabic tongue with a speed beyond description in the spread of languages.\n28 - Among the fruits of belief in Predestination: Optimism and cutting off the root of pessimism. Pessimism is explaining calamities by incorrect causes or reasons, such as pessimism from the sound of an owl, or from disease, or from time and its events, or from the wind. The believer in Divine Decree and Predestination knows that everything is by Allah's estimation and decree, and that what Allah wills happens and what He does not will does not happen: {They said, \"Indeed, we consider you a bad omen. If you do not desist, we will surely stone you, and there will surely touch you, from us, a painful punishment.\" (18) They said, \"Your omen is with yourselves. Is it because you were reminded? Rather, you are a transgressing people.\"} [Ya-Sin: 18-19] (3).",
    "foot_note": "1. Diwan Al-Imam Ali p. 79-80 quoted from Al-Qada' wa Al-Qadar by Al-Hamad p. 25.\n2. Usul Al-Tarbiyah Al-Islamiyyah wa Asalibuha fi Al-Bayt wa Al-Madrasah wa Al-Mujtama', p. 102.\n3. Previous reference: p. 102.",
    "book_id": "70",
    "new_page_number": 35
  },
  {
    "serial_number": "97922",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "29 - Among the fruits of belief in Predestination: Not despairing of the victory of truth. For Allah Almighty has decreed that permanence is for the truth, because it is the origin upon which the heavens and earth were established, while falsehood is transient and vanishing. Allah Almighty says: {And say, \"Truth has come, and falsehood has departed. Indeed is falsehood, [by nature], ever bound to depart.\" (81)} [Al-Isra: 81]. And Glory be to Him says: {So it goes as scum. But as for that which benefits the people, it remains on the earth. Thus does Allah set forth examples. (17) For those who responded...} [Ar-Ra'd: 17]. However, the profound wisdom of Allah Almighty required that falsehood exists to test His allies and to manifest the effects of His Beautiful Names and Lofty Attributes, and to test the believers with a goodly test. Otherwise, if Allah Almighty willed, there would be no disbelief or falsehood. Allah Almighty says: {That [is the command]. And if Allah had willed, He could have taken vengeance upon them [Himself], but [He ordered armed struggle] to test some of you by means of others} [Muhammad: 4]. So the believer in Predestination knows with certainty that the outcome is for the righteous and that Allah's decree in that is effective inevitably, so despair does not creep into his heart, nor does it know a way to him no matter how intense the darkness of falsehood becomes.\n30 - Among the fruits of belief in Predestination: High aspiration, not being satisfied with inferiority, and not being satisfied with painful reality. The believer in Predestination, you find him of high aspiration, not satisfied with inferiority nor with the bitter painful reality, and does not surrender to it using Predestination as an excuse, since this is not the place for using Predestination as an excuse because it is among the defects (Ma'ayib), and using Predestination as an excuse is only permissible in calamities not in defects. Rather, his belief in Predestination necessitates that he strives diligently to change this reality according to his ability and capacity.\n31 - Among the fruits of belief in Predestination: Determination and eliminating hesitation. There is no one in human societies more resolute than the believer in Allah's decree. If he discusses matters, weighs them, consults others, and seeks guidance from his Lord (Istikhara), he proceeds with what he has decided upon, without stopping, hesitation, or fear, due to his certainty that all circumstances and probabilities that might be outside his power and calculation are part of what occurred in Allah's knowledge and decree, and that Allah supports him. So if what he decided is facilitated for him, it is the good decreed for him, or for Allah to divert from him an evil that was probable (1).\n32 - Among the fruits of belief in Predestination: Seriousness and firmness in matters, and keenness for every religious or worldly good. The Messenger, peace be upon him, condemned sluggishness and laziness, and taught us this supplication: \"O Allah, I seek refuge in You from worry and grief, and I seek refuge in You from incapacity and laziness, and I seek refuge in You from being overcome by debt and the oppression of men\" (2).",
    "foot_note": "1. Usul Al-Tarbiyah Al-Islamiyyah p. 101.\n2. Narrated by Al-Bukhari, Book of Supplications, Chapter: Seeking refuge from the oppression of men, (11/173 - Fath Al-Bari).",
    "book_id": "70",
    "new_page_number": 36
  },
  {
    "serial_number": "97923",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "And as in his saying, peace be upon him: \"Be keen on what benefits you, seek help from Allah, and do not be incapable. And if something befalls you, do not say: If only I had done such and such, it would have been such and such. But say: Allah decreed and what He willed He did\" (1). So do not say: If only I had done and done and done, and remain blaming yourself and living on a past you regret. The Muslim must have a strong psyche, so if he errs, or a problem happens to him, he says: \"Allah decreed and what He willed He did\" and starts anew and works for the future (2).\n33 - Among the fruits of belief in Predestination: That belief in Predestination negates from him the afflictions of greed and voracity for the world. That is the head of every sin, the origin of every tribulation, and the basis of every calamity. So his satisfaction with his Lord in all states negates from him the substance of these afflictions. (3)\n34 - Among the fruits of belief in Predestination: Generosity. For the one who believes in Predestination, and that poverty and wealth are in the hand of Allah, and that he will not become poor unless Allah decrees that for him - he spends and does not care. Because he knows that his wealth is by Allah's decree and predestination, and that the poverty of the poor is by Allah's decree and predestination, so he thanks Allah for this blessing, which drives him to spend in the way of Allah.\n35 - Among the fruits of belief in Predestination: Patience, seeking reward, and facing dangers and difficulties. For those who do not believe in Predestination, panic might lead some of them to disbelieve in Allah, some go mad, some become obsessive, some resort to drugs, and some kill themselves. That is why suicide is frequent in countries whose people do not believe in Predestination. Allah Almighty says: {But perhaps you hate a thing and it is good for you; and perhaps you love a thing and it is bad for you. And Allah Knows, while you know not (216)} [Al-Baqarah: 216]. (One of the secrets of this verse: is that it requires the servant to delegate to the One who knows the consequences of matters, and to be satisfied with what He chooses for him and decrees for him, hoping for a good outcome in it. So if he delegates to his Lord, and is satisfied with what He chooses for him, He supplies him in what He chooses for him with strength, determination, and patience, and diverts from him the afflictions that the servant's choice for himself is exposed to, and shows him of the good consequences of His choice for him what he would not have reached part of, by what he chooses for himself). (4)",
    "foot_note": "1. Narrated by Muslim, Book of Predestination, Chapter: Belief in Predestination and Submission to It (16/215 - Sharh Al-Nawawi).\n2. Abdullah Al-Khater, Al-Hazimah Al-Nafsiyyah 'Inda Al-Muslimin, p. 54-55, 1st Edition, Al-Muntada Al-Islami, London, 1412 AH.\n3. Madarij Al-Salikin (2/209).\n4. Al-Fawa'id p. 175-176.",
    "book_id": "70",
    "new_page_number": 37
  },
  {
    "serial_number": "97924",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "36 - Among the fruits of belief in Predestination: Consolation for calamities and tribulation. Because the companionship of faith and certainty is the greatest consoler for them and alleviator of them, due to the strength of his faith, the strength of his reliance, the strength of his hope for his Lord's reward, and his greed for His bounty. So the first thing that alleviates tribulation and calamities is the issue of belief in Divine Decree and Predestination. So he does not panic, nor wail like the wailing of Jahiliyyah, nor get angry at disasters and accidents because he knows that what befell him was not to miss him and what missed him was not to befall him. So calamities become easy for him and he is always remembering the saying of the Messenger, peace be upon him: \"Allah decreed and what He willed He did\" (1).\n37 - Among the fruits of belief in Predestination: Lack of regret or sorrow over what has passed. The believer does not wail over the past with regret and sorrow, because that will not return anything of what passed, and because it only happened according to what Allah wrote for him. There is no objection to Allah's decree as long as it has occurred, but he can take a lesson, so he repents from the mistake or sin, and does not get bitten from the same hole twice (2).\n38 - Among the fruits of belief in Predestination: Acknowledging Allah's favor and bounty and expelling self-admiration when attaining the desired. The believer does not attribute good to himself, but to Allah Blessed and Exalted, because obtaining that is a blessing from Allah through the means of good and success He decreed, so he thanks Allah Almighty for that (3). So he does not admire himself nor boast of his work, knowing that Allah Almighty is the One who favored him with success and assistance and diverting obstacles and impediments, and that if he were left to himself, he would be weak and incapable of action (4).\n39 - Among the fruits of belief in Predestination: Not being deluded by deeds. Because the believer does not know what the result of the deed is, even guidance, he does not know what its result is, as the Messenger, peace be upon him, said: \"By Allah, I am the Messenger of Allah, yet I do not know what will be done with me.\" Umm Al-Ala, may Allah be pleased with her, said - having praised Uthman bin Maz'un when he died: \"Allah has honored you.\" The Messenger of Allah said to her: \"And how do you know that Allah has honored him?\" She said: Glory be to Allah, O Messenger of Allah, and whom does Allah honor if He does not honor him? The Messenger of Allah said to her: \"By Allah, I am the Messenger of Allah, yet I do not know what will be done with me\" (5).\n40 - Among the fruits of belief in Predestination: Acknowledging sin and error. The believing servant attributes shortcoming to himself forever and does not attribute it to Allah Almighty. If he falls into disobedience, he attributes it to himself, so that drives him to seeking forgiveness and repentance.",
    "foot_note": "1. Previously referenced p. 36 footnote No. 2.\n2. Usul Al-Tarbiyah Al-Islamiyyah p. 102.\n3. Aqidah Ahl Al-Sunnah wa Al-Jama'ah, Ibn Uthaymeen, p. 47, 3rd Edition, Department of Scientific Research and Ifta, Riyadh, 1416 AH.\n4. Al-Tanbihat Al-Latifah, p. 84.\n5. Narrated by Al-Bukhari, Book of Funerals, Chapter: Entering upon the deceased after death when wrapped in his shrouds (3/114 - Fath Al-Bari).",
    "book_id": "70",
    "new_page_number": 38
  },
  {
    "serial_number": "97925",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "41 - Among the fruits of belief in Predestination: Emulating the Prophets, peace be upon them. For the sinner, if he seeks forgiveness from his Lord for his sin, has emulated the happy ones among the Prophets and believers like Adam, peace be upon him, and others. But if he persists and uses Predestination as an excuse, he has emulated the wretched ones, like Iblis and those who followed him among the misguided (1).\n42 - Among the fruits of belief in Predestination: Strength of faith. For he who believes in Predestination, his faith strengthens, so he does not abandon it nor waver or weaken no matter what befalls him in that path. Due to his saying, peace be upon him: \"The strong believer is better and more beloved to Allah than the weak believer, and there is good in both\" (2).\n43 - Among the fruits of belief in Predestination: Guidance. As in the saying of the Almighty: {No disaster strikes except by permission of Allah. And whoever believes in Allah - He will guide his heart} [At-Taghabun: 11]. Some of the Salaf said: He is the man whom a calamity strikes, so he knows it is from Allah, so he is pleased and submits (3). So if the servant is struck by a calamity and believes it is from Allah, and that Allah is Wise and Merciful in decreeing it, and that He knows best the interests of His servant, Allah guides his heart a special guidance to satisfaction, patience, submission, and reassurance (4).\n44 - Among the fruits of belief in Predestination: Self-esteem, contentment, and freedom from the slavery of creatures. (Whoever fills his heart with satisfaction with Predestination, Allah fills his chest with richness, security, and contentment. And He empties his heart for His love, turning to Him, and relying on Him. And whoever misses his share of satisfaction, his heart fills with the opposite of that. And he becomes occupied away from what contains his happiness and success. So satisfaction empties the heart for Allah, and discontent empties the heart of Allah) (5).",
    "foot_note": "1. Sheikh Al-Islam Ibn Taymiyyah, Al-Hasanah wa Al-Sayyi'ah, p. 50, 1st Edition, investigated by Muhammad Al-Khasht, Dar Al-Kitab Al-Arabi, Beirut, 1405 AH.\n2. Narrated by Muslim, Book of Predestination, Chapter: The command of strength and leaving incapacity, (16/215 - Sharh Al-Nawawi).\n3. Tafsir Ibn Kathir (4/401).\n4. Al-Tawdih li Shajarat Al-Iman p. 35.\n5. Madarij Al-Salikin (2/208).",
    "book_id": "70",
    "new_page_number": 39
  },
  {
    "serial_number": "97926",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "The believer in Predestination knows that his provision is written, and that he will not die until he completes his provision. He realizes that Allah suffices him, is his reckoner and provider, and that servants, no matter how much they try to deliver provision to him or prevent it from him, will not be able to except with something Allah has written. So he is moved by that to contentment, self-esteem, moderation in seeking, abandoning greed for the world, freedom from the slavery of creatures, cutting off hope from what is in their hands, and directing the heart to the Lord of the worlds. This is the foundation of his success and the head of his achievement. Among the beautiful things mentioned in this meaning is what is attributed to the Commander of the Faithful Ali bin Abi Talib, may Allah be pleased with him, saying:\nContentment granted me every honor ... And is there an honor more honored than contentment?\nSo make it for yourself a capital ... And make piety after it a merchandise.\nYou will gain profit and be free from a miser ... And enjoy in Gardens by patience of an hour (1).\nAnd from that is the saying of Al-Shafi'i, may Allah have mercy on him:\nI saw contentment as the treasure of richness ... So I became holding fast to its tails.\nSo neither this one sees me at his door ... Nor that one sees me engrossed with him.\nAnd I became rich without a dirham ... I pass by people like a king (2).\n45 - Among the fruits of belief in Predestination: Not relying on soothsayers, astrologers, sorcerers, wiping on the dust of graves, supplicating to other than Allah, and directing any type of worship to other than Allah, because they do not possess for themselves benefit or harm, let alone for others.\n46 - Among the fruits of belief in Predestination: Emptying the heart of distractions. For belief in Predestination in the correct manner (relieves him from the exhausting thoughts in types of choices, and empties his heart from estimations and arrangements from which he ascends a steep path and descends another. And with this, there is no escape for him from what was destined for him. So if he is pleased with Allah's choice, the decree befalls him while he is praised, thanked, and treated kindly in it. Otherwise, the decree runs upon him while he is blamed, not treated kindly in it, because it is with his choice for himself. And when his delegation and satisfaction are sound, kindness towards him and gentleness with him encompass him in the decreed matter. So he becomes between His kindness and gentleness; His kindness protects him from what he fears, and His gentleness eases for him what He decreed) (3). So the way of the believer is to rise to the clear duties - as much as he can - and to avoid the specific prohibitions as forbidden. And to occupy himself with knowing what Allah commanded and what Allah forbade, and not to search into anything beyond them from the matter of the Unseen which is veiled from his limited perception. And Allah Glory be to Him would not burden him with something He knows he has no power to do, or that he is prevented by a compelling barrier from rising to. And Allah Glory be to Him would not forbid him from something He knows he has no power to refrain from, or that he is driven by a compelling irresistible motive to commit! Allah Almighty says: {Allah does not charge a soul except [with that within] its capacity. It will have [the consequence of] what [good] it has gained, and it will bear [the consequence of] what [evil] it has earned} [Al-Baqarah: 286].\n47 - Among the fruits of belief in Predestination: Tranquility of the heart, peace of mind, and comfort of thought. These matters are fruits of belief in Divine Decree and Predestination, and they are an urgent demand and a desired goal. Everyone on the face of the earth seeks them and searches for them, but as it was said: Everyone in existence seeks a prey, but the nets are different. So no one realizes these matters, nor finds their sweetness, nor knows their fruit except he who believes in Allah and His Decree and Predestination. That is (because when he knows that it is by the decree of Allah Almighty and that the disliked thing is inevitable, the soul relaxes, the heart is reassured, and is pleased with the Lord's decree. So no one has a better life, more restful soul, and stronger reassurance than the one who believes in Predestination) (4). And indeed you find among the elite Muslims of working scholars and obedient following worshippers, a tranquility of heart and peace of mind that does not cross a mind, nor does an imagination revolve around its likeness. They have in that matter the highest arrow (greatest share) and the fullest portion. This is the Commander of the Faithful Umar bin Abdul Aziz, may Allah have mercy on him, saying: (I have become having no joy except in the places of Predestination. It was said to him: What do you desire? He said: What Allah Mighty and Majestic decrees) (5). And this is Sheikh Al-Islam Ibn Taymiyyah, may Allah Almighty have mercy on him, saying: (Indeed, there is a paradise in this world, whoever does not enter it will not enter the Paradise of the Hereafter) (6). And he says his famous statement which he said when he was led to prison: (What can my enemies do to me? My paradise and my garden are in my chest; wherever I travel, they are with me, never leaving me. My imprisonment is seclusion, my killing is martyrdom, and my expulsion from my land is tourism) (7).\n49 - Among the fruits of belief in Predestination: Expelling anxiety and boredom when missing what is desired or occurrence of the disliked. Because that is by the decree of Allah Almighty who owns the kingdom of the heavens and earth and it is inevitable, so he endures that patiently and seeks the reward (8).",
    "foot_note": "1. Diwan Al-Imam Ali p. 121-122, quoted from Al-Qada' wa Al-Qadar by Al-Hamad p. 30.\n2. Diwan Al-Imam Al-Shafi'i p. 68. 3rd Edition, Al-Zoabi Establishment, Beirut, 1392 AH.\n3. Al-Fawa'id p. 176.\n4. Ibn Uthaymeen, Aqidah Ahl Al-Sunnah wa Al-Jama'ah, p. 46-47.\n5. Mukhtasar Minhaj Al-Qasidin p. 337.\n6. Al-Shahadah Al-Zakiyyah fi Thana' Al-A'immah 'ala Ibn Taymiyyah by Mar'i Al-Karmi Al-Hanbali p. 34. Quoted from Al-Qada' wa Al-Qadar by Al-Hamad p. 31.\n7. Sheikh Al-Islam Ahmad Taqi Al-Din Ibn Taymiyyah: Jihaduhu, Da'watuhu, Aqidatuhu, by Sheikh Ahmad Al-Qattan and Muhammad Al-Zain p. 101, 1st Edition, Maktabat Al-Sundus, Kuwait, 1406 AH.\n8. Aqidah Ahl Al-Sunnah wa Al-Jama'ah, Ibn Uthaymeen, p. 47.",
    "book_id": "70",
    "new_page_number": 40
  },
  {
    "serial_number": "97927",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "50 - Among the fruits of belief in Predestination: Humility. For the believer in Predestination, if Allah provides him with wealth, status, knowledge, or other than that, he humbles himself to Allah, knowing that this is from Allah, and if He willed, He would take it away from him. He is over all things competent. Allah Almighty says: {Say, \"O Allah, Owner of Sovereignty, You give sovereignty to whom You will and You take sovereignty away from whom You will. You honor whom You will and You humble whom You will. In Your hand is [all] good. Indeed, You are over all things competent (26)} [Ali 'Imran: 26].\n51 - Among the fruits of belief in Predestination: Gratitude. For the believer in Predestination knows that whatever blessing he has is from Allah alone, and that Allah is the Repeller of every dislike and vengeance. So he is moved by that to thank Allah, as He is the Gracious Bestower who destined that for him, and He is the One deserving of thanks. Allah Almighty says about Solomon, peace be upon him: {And he said, \"My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents} [An-Naml: 19].\n52 - Among the fruits of belief in Predestination: Satisfaction (Rida). (Indeed, the Wisest of judges, the Most Merciful of the merciful, and the Most Knowing of knowers, who is more merciful to His servants than they are to themselves and than their fathers and mothers, if He sends down upon them what they dislike, it is better for them than not sending it down upon them, out of care from Him for them, benevolence to them, and kindness to them. If they were enabled to choose for themselves, they would be unable to undertake their interests in knowledge, will, and action. But He, Glory be to Him, took charge of managing their affairs according to His knowledge, wisdom, and mercy, whether they liked it or disliked it. Those certain of His Names and Attributes knew that, so they did not dispute His management, nor impugn His wisdom, nor disobey His judgment. They did not oppose His judgment with their corrupt minds, false opinions, and unjust policies. Thus, they neither knew their Lord nor obtained their interests. And when the servant succeeds in this knowledge, he dwells in this world before the Hereafter in a paradise whose bliss resembles only the bliss of the Hereafter. For he remains satisfied with his Lord, and satisfaction is the paradise of the world, and the resting place of the knowers. For it is the goodness of the soul with what runs upon it of the decrees which are the very choice of Allah for it, and its reassurance to His religious rulings. This is satisfaction with Allah as Lord, Islam as religion, and Muhammad as Messenger. And he has not tasted the taste of faith who has not obtained that. This satisfaction is according to his knowledge of Allah's justice, wisdom, mercy, and good choice. So the more he knows that, the more satisfied he is with Him. For the Lord's decree, Glory be to Him, regarding His servant revolves between justice, interest, wisdom, and mercy; it never departs from that at all. As he, peace be upon him, said in the famous supplication: \"O Allah! I am Your servant, son of Your servant, son of Your maidservant, my forelock is in Your Hand, Your command over me is forever executed and Your decree over me is just. I ask You by every Name belonging to You which You named Yourself with, or revealed in Your Book, or You taught to any of Your creation, or You have preserved in the knowledge of the unseen with You, that You make the Quran the spring of my heart and the light of my chest, and a departure for my sorrow and a release for my anxiety and distress. No one ever said it except that Allah removed his anxiety and distress and replaced it with relief.\" They said: Should we not learn them, O Messenger of Allah? He said: \"Yes! It befits the one who hears them to learn them\" (1).",
    "foot_note": "1. The investigator said: An authentic hadith, narrated by Imam Ahmad in Al-Musnad (1/391 and 452).",
    "book_id": "70",
    "new_page_number": 41
  },
  {
    "serial_number": "97928",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "The intended meaning is his saying: \"Your decree over me is just.\" This covers every decree He decrees upon His servant, of punishment or pain and the cause of that. For He is the One who decreed the cause and decreed the effect, and He is just in this decree. This decree is good for the believer, as he, peace be upon him, said: \"By the One in Whose hand is my soul, Allah does not decree a decree for the believer except that it is good for him, and that is for no one except the believer\" (1) (2). So he is pleased with Allah as a Lord, Manager, and Legislator, so his soul fills with satisfaction with his Lord, and if he is pleased with Allah, Allah Almighty pleases him.\n53 - Among the fruits of belief in Predestination: Joy. So the believer in Predestination rejoices in that faith which many nations were deprived of: {(57) Say, \"In the bounty of Allah and in His mercy - in that let them rejoice; it is better than what they accumulate.\"} [Yunus: 58].\n54 - Among the fruits of belief in Predestination: Love and lack of envy among believers. Because belief in Predestination and (Satisfaction opens for him the door of safety, making his heart sound and pure from deceit, treachery, and rancor. And none is saved from Allah's punishment except one who comes to Allah with a sound heart. Likewise, the soundness of the heart is impossible with discontent and lack of satisfaction. For malice, treachery, and deceit: are the companion of discontent. And the soundness of the heart, its righteousness, and its advice: are the companion of satisfaction. Likewise, envy: is one of the fruits of discontent. And the soundness of the heart is from the fruits of satisfaction) (3). So the believer does not envy people for what Allah has given them of His bounty, due to his belief that Allah is the One who provided for them, and decreed that for them. He gives to whom He wills, and withholds from whom He wills, as a test and trial from Him, Mighty and Majestic, and that when he envies another, he is actually objecting to Predestination (4).\n55 - Among the fruits of belief in Predestination: Enraging the innovators who control Allah's wisdom and law (5). They say Allah should do such and such, or they negate Allah's wisdom in His actions. Belief in Predestination according to Ahlus-Sunnah enrages them because they submit to the cosmic and legal commands.\n56 - Among the fruits of belief in Predestination: Steadfastness on a straight path in prosperity and adversity. For servants have shortcomings, deficiencies, and weakness; they do not remain steadfast on a straight path except the one who believes in Predestination. For the blessing does not make him insolent, and the calamity does not make him despair.",
    "foot_note": "1. The investigator said: This narration - and Allah knows best - is by meaning (bil-ma'na). The hadith was reported with another wording by Muslim, Book of Zuhd, Chapter: Miscellaneous Hadiths (18/125 - Sharh Al-Nawawi).\n2. Al-Fawa'id p. 171-173.\n3. Madarij Al-Salikin (2/207).\n4. See: Majallat Al-Buhuth Al-Islamiyyah Issue 34 p. 25, study: Wasatiyyat Ahl Al-Sunnah fi Al-Qadar, Dr. Awad Al-Mu'taq. Quoted from Al-Qada' wa Al-Qadar by Al-Hamad p. 27.\n5. Al-Jami' Al-Sahih fi Al-Qadar p. 12.",
    "book_id": "70",
    "new_page_number": 42
  },
  {
    "serial_number": "97929",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "Chapter Five: Secularism (1) and its Connection to Deviation in the Concept of Predestination\nIndeed, the creed (when it was sound, and faith was strong and overflowing, and adherence to what Allah commanded of precaution, caution, and preparation of strength and capability was established, it was not possible in any way for intellectual invasion to find an outlet to penetrate. And if it found an outlet, it would not find a place to influence. And if it found a place, in the rarest of cases that might happen, but it would quickly be resisted and treated. All this happens in the state of the Ummah's wakefulness and awareness, and in the state of the dominance of the creed and its pulse. In the days when the Ummah was like that, the currents of intellectual invasion did not affect it, and found no way to penetrate it. But after deviations covered the life of the Ummah, and weakness afflicted its creed, it became an expected matter that it would become a target for campaigns of intellectual invasion, and fall prey to them from the first moment it collided with them) (2).\nAmong these (dangerous deviations that appeared in the history of the Ummah and which still exist to our time, is what is called Sufism (3). This sect with which Islam and Muslims were afflicted, and which over time became many paths and numerous sects. Sufism is one of the greatest calamities that Islam has been afflicted with throughout its history, and which inflicted upon Muslims what only Allah knows of weakness, frailty, subservience, and submission to the painful reality without attempting to change it) (4).",
    "foot_note": "1. Secularism (Al-'Ilmaniyyah): The term 'Ilmaniyyah' is an incorrect translation of the word (Secularism) in English or (Secularite) in French. It is a word that has no connection to the word 'Ilm' (science/knowledge) and its derivatives at all. The correct translation of the word is \"Irreligion\" (Al-La Diniyyah) or \"Worldliness\" (Al-Dunyawiyyah), not just in the sense of opposing the Hereafter, but in a more specific sense which is what has no connection to religion, or whose relationship with religion is one of opposition. It is a social movement aiming to divert people and direct them from concern for the Hereafter to concern for this world alone. So the correct expression for Secularism is \"establishing life on other than religion\" whether for the nation or the individual.\n2. Al-Inhirafat Al-Aqadiyyah fi Al-Qarnayn Al-Thalith Ashar wa Al-Rabi' Ashar Al-Hijriyyayn wa Atharuha fi Hayat Al-Ummah, p. (2/246-247), Ali Al-Zahrani, 2nd Edition, Dar Taiba, Makkah, 1418 AH.\n3. Sufism (Al-Sufiyyah): Attributed to wearing wool (Suf). Some researchers believe that the beginning of Sufism was asceticism in the world and adherence to morals, then after that Sufi sects multiplied, and some sects increased in distance from the truth and extremism until some of them spoke of incarnation (Hulul) and union (Ittihad), and advocated abandoning duties and committing prohibitions as acts of worship. See: Talbis Iblis by Ibn Al-Jawzi p. 161, and Majmu' Al-Fatawa (11/6-18), Nash'at Al-Falsafah Al-Sufiyyah wa Tatawwuruha by Irfan Abdul Hamid p. 115-124, Al-Madhahib Al-Sufiyyah wa Madarisuha by Abdul Hakim Qasim, Mu'jam Alfaz Al-Aqidah p. 248.\n4. Al-Inhirafat Al-Aqadiyyah wa Al-Ilmiyyah p. (1/70).",
    "book_id": "70",
    "new_page_number": 43
  },
  {
    "serial_number": "97930",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "Secularism exploited the deviation in Islamic concepts among the Sufis - including the deviation in the concept of Predestination and Reliance (Tawakkul) - as one of the manifestations of intellectual invasion to tell people that religion has no relation to life or practical behavior, but rather it is a spiritual bond between the servant and his Lord by which he deserves salvation and success in the other world.\nIn explaining the deviation of Sufis regarding Predestination, Sheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him, says: (As for the \"Second Sect\" - meaning among the misguided sects engaging in Predestination - they are worse than them - meaning the Qadariyyah. They are groups from the people of path (Suluk), will (Iradah), godliness (Ta'alluh), Sufism, and poverty (Faqr) and the like. They witness this truth, and saw that Allah is the Creator of all creatures, so He is the Creator of the servants' actions and the Willer of all beings. But they did not distinguish after that between faith and disbelief, nor knowledge and denial, nor truth and falsehood, nor guided and astray, nor rashid and ghawi, nor prophet and false prophet, nor ally of Allah and enemy, nor pleasing and displeasing, nor beloved and hated, nor between justice and injustice, nor between righteousness and disobedience, nor between the deeds of Paradise and the deeds of the people of Fire, nor between the righteous and the wicked. As they witnessed what creatures share of the Pre-ordained Decree, the Executed Will, the Comprehensive Power, and the General Creation. So they witnessed the commonality between creatures and were blind to the distinction between them. And they became of those addressed by His saying Almighty: {(34) Then will We treat the Muslims like the criminals? (35) What is [the matter] with you? How do you judge?} [Al-Qalam: 35-36]) (1).\nHe also said: (And the second sect: - meaning among the misguided sects engaging in Predestination - the Mushrikun (Polytheists) - who acknowledged Divine Decree and Predestination, and claimed that it agrees with the Command and Prohibition, and they denied the Command and Prohibition. Allah Almighty says: {Those who associated with Allah will say, \"If Allah had willed, we would not have associated [anything] and neither would our fathers, nor would we have prohibited anything.\"} [Al-An'am: 148]. And He says: {And those who associated others with Allah said, \"If Allah had willed, we would not have worshipped anything other than Him, neither we nor our fathers, nor would we have prohibited anything without His permission.\"} [An-Nahl: 35]. So the affair of these leads to the suspension of Shari'a laws, the Command, and Prohibition, while acknowledging the general Lordship over every creature, and that there is no creature but my Lord holds its forelock. This is what many are afflicted with - either in belief or in state - groups of Sufis and Fuqara (poor ones), until some of them exit to the permissibility of prohibitions, the dropping of obligations, and the lifting of punishments) (2).",
    "foot_note": "1. Majmu' Al-Fatawa (8/59-60).\n2. Previous reference (3/111), (8/256).",
    "book_id": "70",
    "new_page_number": 44
  },
  {
    "serial_number": "97931",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "Then, as a result of this wrong understanding of the doctrine of Predestination, (the Sufis went to extremes in the concept of reliance on Allah (Tawakkul), and understood it wrongly. So they cut off taking means, abandoned caution and precaution, and interpreted Tawakkul with other than its legal meaning, thereby contradicting the Book and the Sunnah. Tawakkul among the Sufis became interpreted in a strange way, and applied in the life of the people in a strange application. Here is one of the major Sufis explaining the meaning of Tawakkul according to them, writing: (Al-Hasan, brother of Sinan, said: I performed Hajj fourteen times barefoot, relying [on Allah], and thorns would enter my foot, and I would not remove them, lest my reliance decreases). (And it was said: Whoever claims reliance and then becomes full has carried provisions). This type of reliance is enough to destroy societies and spread poverty among them, and may lead to the destruction of their people, and it is contrary to the Sunnah of the Messenger of Allah, peace be upon him (1). Indeed, (Tawakkul is the fruit of belief in Divine Decree and Predestination and its result, and therefore it is a creed associated with action.. Allah Almighty says: {And whoever relies upon Allah - then He is sufficient for him} [Yunus: 49]. And He says: {And when you have decided, then rely upon Allah. Indeed, Allah loves those who rely [upon Him] (159)} [Ali 'Imran: 159]. So whoever abandons action completely, he has not understood Tawakkul in its correct way, and that is blameworthy Tawakul (feigned reliance), which creates unemployment and produces loafers in the streets, or in Takayas and Zawiyas) (2). (However, Sufis see that Tawakkul conflicts with action, so it is a degree adhered to by those capable among them, in their negative way) (3). The Tawakul has corrupted much of the doctrine of Divine Decree and Predestination, turning it from a positive, motivating doctrine into a negative, discouraging doctrine, and into negative satisfaction with reality, and not attempting change. Napoleon Bonaparte exploited that deviant idea of Divine Decree and Predestination when his Crusader armies occupied the land of Egypt. He used to issue his proclamations reminding Muslims that what happened to them of occupation and captivity was by a decree from Allah, so whoever tries to object to what happened is as if he is objecting to Divine Decree and Predestination (4).",
    "foot_note": "1. Muhammad Al-Nasir, Bida' Al-I'tiqad wa Akhtaruha 'ala Al-Mujtama'at Al-Mu'asirah, p. 302, 1st Edition, Maktabat Al-Sawadi, Jeddah, 1416 AH.\n2. See Al-Ahwal Al-Diniyyah 'inda Al-Muslimin (p. 283-285) Ali bin Bakhit Al-Zahrani. Quoted from Bida' Al-I'tiqad p. 305.\n3. Mawqif Al-Imam Ibn Taymiyyah min Al-Sufiyyah: Dr. Ahmad Al-Banani p. 125-126.. Quoted from Bida' Al-I'tiqad p. 304.\n4. 'Aja'ib Al-Athar fi Al-Tarajim wa Al-Akhbar: Sheikh Abdur-Rahman Al-Jabarti: (2/239) Dar Al-Faris, Beirut, quoted from Bida' Al-I'tiqad p. 306.",
    "book_id": "70",
    "new_page_number": 45
  },
  {
    "serial_number": "97932",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "By this, the Sufis attempt to oppose the reality of this religion and clash with its clear texts in many deviations, which contributed to the backwardness of these societies, and letting the leadership of the caravan of civilization be taken by other misguided nations, after they were goodness, building, and reconstruction for all of humanity, the day they were walking on the guidance of this religion, and enlightened by its glowing light) (1). The Sufis turned to prayer or fasting and remembrance (Dhikr), and said: These are the actions required for the Hereafter, but as for worldly matters, we have no need to delve into them, because they are a temptation that lands one in the snares of Satan. (And worship was isolated from the rest of Islam as if Islam is confined to it without the rest of the parts like Jihad, for example, and the rulings of transactions or international relations. Although most people, if not all, know that Islam is not just the obligatory acts of worship, they neglected the other aspects, turned a blind eye to them, and lowered their rank. A group of guides called for turning away from everything other than acts of worship. So Jihad, forbidding evil, repelling tyranny and colonialism, resisting injustice, and working in all that benefits Muslims in public matters, all of that in the view of this group of people - and how many they are in the eras of decline - is superfluity that distracts from Allah and His worship... While the standards of piety and righteousness in Islam were comprehensive of all duties obligated by Islam including special acts of worship, Jihad, knowledge, justice, beneficial work for people, integrity in dealing, and benevolence, all coupled with the Tawhid of Allah and sincerity to Him, the standards of piety became confined to acts of worship) (2). The result, due to this negative thought in addition to the Irja'i thought which encouraged escaping from duties, was that the Islamic world reached its current state of poverty, ignorance, and disease (The Sufi upbringing on ease in Takayas and Zawiyas, with listening to chants and poems and a wrong understanding - among many of them - of the concept of Predestination, and that Allah's will is executed and there is no room to repel the enemy by Jihad.. all that distanced the Sufis from Jihad, rather made most of them ally with enemies or withdraw away from the Ummah's events and calamities) (3). (Sufism overwhelmed the Islamic world, making it sleep a deep sleep, and numbing it to the extent that it does not wake up. Muslims became busy with shrines and graves, and intercession at them, and stuck to Zawiyas and Takayas and repeated the litanies of the Sheikhs, idle from work and even Sharia knowledge. The Sheikhs brainwashed their followers so they believed every impossible thing, and believed what the stubborn Sheikh says. Their upbringing of followers was mostly a humiliating upbringing. The Majadhib (attracted ones/fools) might go out into the streets praying against the rogue disbeliever possessing cannons and tanks... This deep slumber, and severe ignorance, was a natural result of the negative effects left by the Sufis gnawing at the body of the Ummah, in addition to other diseases) (4)",
    "foot_note": "1. Bida' Al-I'tiqad p. 306.\n2. Al-Mujtama' Al-Islami Al-Mu'asir, Muhammad Al-Mubarak, p. 66-67, Dar Al-Fikr Beirut, 1st Edition, 1391 AH. Quoted from Al-Inhirafat Al-Aqadiyyah wa Al-Ilmiyyah p. (1/99-100).\n3. Bida' Al-I'tiqad p. 307.\n4. Bida' Al-I'tiqad p. 272.",
    "book_id": "70",
    "new_page_number": 46
  },
  {
    "serial_number": "97933",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "One of the German orientalists wrote, chronicling the state of Muslims in their later eras, saying: The nature of the Muslim is submission to the will of Allah, satisfaction with His decree and predestination, and submission with all he owns to the One, the Subjugator. This obedience had two different effects. In the first Islamic era, it played a major role in war as it achieved continuous victory because it instilled the spirit of sacrifice in the soldier. In the later eras, it was a cause for the stagnation that overshadowed the Islamic world, throwing it into decline, isolating it, and folding it away from the currents of world events. This man, being a disbeliever, realized this truth: the truth of the difference between belief in Predestination as understood by the Salaf and the belief innovated by the Khalaf (successors) influenced by the Sufis. There is no doubt that what befell Muslims of humiliation, disgrace, and moral and sensory defeats was by the decree of Allah, in Whose dominion nothing occurs except what He wills, and nothing is hidden from Him, rather what was and what will be are equal in His knowledge. But Muslims in later eras distorted this concept and took belief in Predestination as a flimsy justification for their incapacity and collapse, forgetting that Allah's decrees run upon them according to His fixed laws which He clarified to them, but they overlooked them and neglected them. So the responsibility is theirs alone, and your Lord does not wrong anyone. Reliance (Tawakkul), which was the strong motive for the movement of Jihad and launching into the earth with the means of life, turned into cheap, blameworthy Tawakul (feigned reliance) which the Sufis called \"certainty\" (Yaqin) and others called \"contentment\" (Qana'ah) and everyone sought reward for it from Allah. Muslims surrendered to a long sleep - using Predestination as an excuse - and nothing woke them except the roar of Western civilization pounding their strongholds and storming their forts. It was the astounding surprise that shook the Ummah's faith in its religion, which was a dormant, cold faith with no movement. In this moment of dazzle and astonishment, the orientalists and missionaries and their tails said: That religion - and the doctrine of Predestination especially - is the cause of backwardness and stagnation in the Islamic world. The gullible ones believed them, those who knew nothing of the rituals of religion except what the Sheikhs of the paths drew for them of prayers and litanies, nor of its rules except that part of faith is for a person to be satisfied with what is written for him - according to the wrong understanding of it. In the name of asceticism in the world, and submissive surrender to humiliation and poverty - under the cover of belief in Predestination -, both of which were volunteered by the Sufi paths and encouraged by the ignorant, decadent environment - Islamic civilization retreated and withered until it breathed its last at the hands of the military and cultural invasion coming from the West. (Sufism became a Murji'i Jibriyyah patting the shoulders of the sleepers, so despair and hopelessness take over life... This negative view was the best help to the colonizer... who fed Sufism and spent a lot on its shrines and corners to kill the vitality and psychology of Jihad among Muslims) (1).",
    "foot_note": "1. Bida' Al-I'tiqad p. 307.",
    "book_id": "70",
    "new_page_number": 47
  },
  {
    "serial_number": "97934",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "Conclusion\nAfterwards, it has become clear to us through this research that the foundation upon which the righteousness of the individual is built is the correct creed, firm belief in Allah Almighty, and what follows that of belief in Allah's decree and predestination. That is because belief in Divine Decree and Predestination has importance in the righteousness of the individual and the stability of his conditions, for there is no happiness for an individual who does not believe in Divine Decree and Predestination.\nAnd that the believer should submit and believe in everything that came in the Book and the Sunnah regarding matters related to Divine Decree and Predestination, and understand them with the correct understanding upon which the predecessors of this Ummah from the Companions, may Allah be pleased with them, were, and those who followed their methodology from the Tabi'in and righteous scholars.\nAnd that he should not delve into what he has no knowledge of. And that he should rely on Allah Almighty in all matters, small and large, and make that an aid to him for work and abandoning incapacity and laziness.\nOur Lord, let not our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower. And may Allah send blessings and peace upon our Prophet Muhammad and upon his family and companions.",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 48
  },
  {
    "serial_number": "97935",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "Index of References\n1 - Usul Al-Tarbiyah Al-Islamiyyah wa Asalibuha fi Al-Bayt wa Al-Madrasah wa Al-Mujtama', Abdur-Rahman Al-Nahlawi, 2nd Edition, Dar Al-Fikr, Damascus, 1403 AH.\n2 - Al-Inhirafat Al-Aqadiyyah fi Al-Qarnayn Al-Thalith Ashar wa Al-Rabi' Ashar Al-Hijriyyayn wa Atharuha fi Hayat Al-Ummah, Ali Al-Zahrani, 2nd Edition, Dar Taiba, Makkah, 1418 AH.\n3 - Al-Tadmuriyyah, Sheikh Al-Islam Ibn Taymiyyah, 2nd Edition, Imam Muhammad bin Saud University Publications, Riyadh, 1400 AH.\n4 - Al-Tanbihat Al-Latifah 'ala ma Ihtawat 'alayhi Al-Aqidah Al-Wasitiyyah min Al-Mabahith Al-Munifah, Abdur-Rahman bin Sa'di, 1st Edition, Commentary by Sheikh Ibn Baz, Adjusted by Ali Hasan Abdul Hamid, Dar Ibn Al-Qayyim, Dammam, 1409 AH.\n5 - Al-Tawdih li Shajarat Al-Iman by Sheikh Abdur-Rahman Ibn Sa'di, 1st Edition, Cared for by Ashraf Abdul Maqsoud, Adwaa Al-Salaf, Riyadh, 1419 AH.\n6 - Al-Tawakkul 'ala Allah wa 'Alaqatuhu bil-Asbab by Abdullah Al-Dumaiji, 1st Edition, Dar Al-Watan, Riyadh, 1417 AH.\n7 - Al-Jami' Al-Sahih fi Al-Qadar, by Muqbil Al-Wadi'i, p. 14, Maktabat Ibn Taymiyyah, Cairo.\n8 - Al-Huzn wa Al-Ikti'ab fi Daw' Al-Kitab wa Al-Sunnah, Abdullah Al-Khater, Al-Muntada Al-Islami Edition, London.\n9 - Al-Hasanah wa Al-Sayyi'ah, Sheikh Al-Islam Ibn Taymiyyah, 1st Edition, Investigated by Muhammad Al-Khasht, Dar Al-Kitab Al-Arabi, Beirut, 1405 AH.\n10 - Al-Durrah Al-Bahiyyah Sharh Al-Qasidah Al-Ta'iyyah fi Hall Al-Mushkilah Al-Qadariyyah by Sheikh Al-Islam, by Abdur-Rahman bin Sa'di, Maktabat Al-Ma'arif, Riyadh, 1406 AH.\n11 - Al-Sunnah by Ibn Abi Asim, 2nd Edition, Investigated by Al-Albani, Al-Maktab Al-Islami, Beirut, 1405 AH.\n12 - Al-Aqidah Al-Tahawiyyah Sharh Ibn Abi Al-Izz, 1st Edition, Investigated by Abdullah Al-Turki, Shu'aib Al-Arna'ut, Mu'assasat Al-Risalah, Beirut, 1408 AH.\n13 - Al-Aqidah Al-Tahawiyyah by Imam Abu Ja'far Ahmad bin Muhammad Al-Tahawi, 1st Edition, Commentary by Sheikh Abdul Aziz bin Baz, Maktabat Ibn Taymiyyah, Cairo, 1415 AH.\n14 - Al-Aqidah Al-Wasitiyyah, Ibn Taymiyyah, Explanation by Sheikh Muhammad bin Mani', Maktabat Al-Nahdah Al-Hadithah.\n15 - Al-Farq bayna Al-Firaq by Al-Baghdadi, 1st Edition, Commentary by Ibrahim Ramadan, Dar Al-Ma'rifah, Beirut, 1415 AH.",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 49
  },
  {
    "serial_number": "97936",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "16 - Al-Fawa'id by Ibn Al-Qayyim, Arrangement and Commentary by Ali Hasan Abdul Hamid, Dar Ibn Al-Jawzi, Dammam, 1417 AH.\n17 - Al-Qamus Al-Muhit, by Al-Fairuzabadi, Adjusted and Documented by Yusuf Al-Sheikh Al-Baqai, Dar Al-Fikr, Beirut, 1415 AH.\n18 - Al-Qada' wa Al-Qadar fi Daw' Al-Kitab wa Al-Sunnah wa Madhahib Al-Nas Fihi, Abdur-Rahman Al-Mahmoud, 2nd Edition, Dar Al-Watan, Riyadh, 1418 AH.\n19 - Al-Qada' wa Al-Qadar by Umar Al-Ashqar, 3rd Edition, Dar Al-Nafais, Jordan, 1415 AH.\n20 - Al-Qada' wa Al-Qadar by Muhammad Al-Hamad, 1st Edition, Dar Ibn Khuzaimah, Riyadh 1415 AH.\n21 - Al-Kawashif Al-Jaliyyah 'an Ma'ani Al-Wasitiyyah, Abdul Aziz Al-Salman, 19th Edition.\n22 - Al-Milal wa Al-Nihal by Al-Shahrastani, 2nd Edition, Dar Maktabat Al-Mutanabbi, Beirut 1992 AD.\n23 - Al-Nihaya fi Gharib Al-Hadith wa Al-Athar, 1st Edition, Commentary by Salah Uwaydah, Dar Al-Kutub Al-Ilmiyyah, Beirut 1418 AH.\n24 - Al-Hazimah Al-Nafsiyyah 'Inda Al-Muslimin by Abdullah Al-Khater, 1st Edition, Al-Muntada Al-Islami, London, 1412 AH.\n25 - Al-Wasa'il Al-Mufidah lil-Hayat Al-Sa'idah, Ibn Sa'di, 4th Edition, General Presidency for Scientific Research and Ifta Departments, 1409 AH.\n26 - Bida' Al-I'tiqad wa Akhtaruha 'ala Al-Mujtama'at Al-Mu'asirah, Muhammad Al-Nasir, 1st Edition, Maktabat Al-Sawadi, Jeddah, 1416 AH.\n27 - Tuhfat Al-Ahwadhi Sharh Sunan [Al-Tirmidhi], 3rd Edition, Adjusted by Abdur-Rahman Uthman, Maktabat Ibn Taymiyyah, 1407 AH.\n28 - Tafsir Al-Quran Al-Azim, Ibn Kathir, 2nd Edition, Presentation by Dr. Yusuf Al-Mar'ashli, Dar Al-Ma'rifah, Beirut, 1407 AH.\n29 - Tayseer Al-Karim Al-Rahman fi Tafsir Kalam Al-Mannan, Ibn Sa'di, Saleh bin Saleh Cultural Center, Unaizah, 1407 AH.\n30 - Jaddid Hayatak, Muhammad Al-Ghazali, 9th Edition, Dar Al-Qalam Damascus, 1416 AH.\n31 - Khalq Af'al Al-Ibad by Al-Bukhari, 2nd Edition, Investigated by Dr. Abdur-Rahman Amira, Dar Okaz, Jeddah.\n32 - Diwan Al-Imam Al-Shafi'i. 3rd Edition, Al-Zoabi Establishment, Beirut, 1392 AH.\n33 - Silsilat Al-Ahadith Al-Sahihah by Al-Albani, 4th Edition, Al-Maktab Al-Islami, Beirut, 1405 AH.\n34 - Silsilat Al-Ahadith Al-Sahihah, by Al-Albani, 1st Edition, Maktabat Al-Ma'arif, Riyadh, 1412 AH.",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 50
  },
  {
    "serial_number": "97937",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "35 - Sharh Usul I'tiqad Ahl Al-Sunnah wa Al-Jama'ah by Al-Lalaka'i, 2nd Edition, Investigated by Ahmad Hamdan, Dar Taiba, Riyadh, 1411 AH.\n36 - Shifa' Al-Alil fi Masa'il Al-Qada' wa Al-Qadar wa Al-Hikmah wa Al-Ta'lil, Ibn Al-Qayyim, 1st Edition, Correction by Sayyid Muhammad Badr Al-Din Al-Halabi, Maktabat Al-Riyadh Al-Hadithah, Riyadh.\n37 - Sheikh Al-Islam Ahmad Taqi Al-Din Ibn Taymiyyah: Jihaduhu, Da'watuhu, Aqidatuhu, by Sheikh Ahmad Al-Qattan and Muhammad Al-Zain, 1st Edition, Maktabat Al-Sundus, Kuwait, 1406 AH.\n38 - Sahih Sunan Al-Tirmidhi by Al-Albani, 1st Edition, Arab Bureau of Education for the Gulf States, Riyadh, 1408 AH.\n39 - Sahih Muslim with Explanation of Al-Nawawi, Dar Al-Kitab Al-Arabi, Beirut, 1407 AH.\n40 - Da'if Sunan Al-Tirmidhi by Al-Albani, 1st Edition, Al-Maktab Al-Islami, Beirut, 1411 AH.\n41 - Aqidah Ahl Al-Sunnah wa Al-Jama'ah, Ibn Uthaymeen, 3rd Edition, Department of Scientific Research and Ifta, Riyadh, 1416 AH.\n42 - Fatawa of the Permanent Committee for Scientific Research and Ifta, 1st Edition, Collected by Ahmad Al-Duwaish, Maktabat Al-Ma'arif, Riyadh, 1412 AH.\n43 - Fath Al-Bari Sharh Sahih Al-Bukhari, Correction by Sheikh Abdul Aziz bin Baz, Dar Al-Fikr.\n44 - Fath Al-Qadir, by Al-Shawkani, Dar Al-Fikr Edition, Beirut, 1403 AH.\n45 - Fath Al-Majid Sharh Kitab Al-Tawhid, Abdur-Rahman bin Hasan, 1st Edition, Al-Maktabah Al-Tijariyah, Makkah, 1412 AH.\n46 - Lisan Al-Arab Ibn Manzur, Investigated by Abdullah Al-Kabir and others, Dar Al-Ma'arif.\n47 - Majmu' Al-Fatawa for Sheikh Al-Islam Ibn Taymiyyah, Collected by Abdur-Rahman Ibn Qasim, Maktabat Ibn Taymiyyah, Cairo.\n48 - Majmu' Al-Fatawa for Sheikh Ibn Baz, Collected by Abdullah Al-Tayyar and Ahmad bin Baz, 1st Edition, Dar Al-Watan, Riyadh, 1416 AH.\n49 - Mukhtasar Minhaj Al-Qasidin by Al-Maqdisi, 2nd Edition, Commentary by Abdullah Al-Ansari, Dar Al-Ma'rifah, Beirut, 1416 AH.\n50 - Madarij Al-Salikin by Ibn Al-Qayyim, Investigated by Muhammad Hamid Al-Fiqi, Dar Al-Rashad Al-Hadithah, Casablanca, Morocco.\n51 - Madhahib Fikriyyah Mu'asirah, Muhammad Qutb, 4th Edition, Dar Al-Shuruq, Cairo, 1409 AH.\n52 - Ma'arij Al-Qabul bi Sharh Sullam Al-Wusul ila Ilm Al-Usul by Sheikh Hafiz Al-Hakami, 3rd Edition, Adjusted and Commented by Umar bin Mahmoud, Dar Ibn Al-Qayyim, Dammam, 1414 AH.",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 51
  },
  {
    "serial_number": "97938",
    "category_id": "1",
    "category": "Doctrine (Aqeedah)",
    "book_title": "The Doctrine of Belief in Divine Decree and Predestination according to the Salaf and its Effect on the Believer",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "53 - Mu'jam Alfaz Al-Aqidah, Classified by Amer Falih, 1st Edition, Maktabat Al-Obeikan, Riyadh, 1417 AH.\n54 - Mu'jam Maqayis Al-Lughah, Ibn Faris, 1st Edition, Investigated by Abdus-Salam Harun, Dar Al-Jil, Beirut, 1411 AH.\n55 - Miftah Dar Al-Sa'adah by Ibn Al-Qayyim, Edition of the Presidency of Scientific Research and Ifta, Riyadh.\n56 - Manhaj Al-Asha'irah fi Al-Aqidah, by Sheikh Safar Al-Hawali, 1st Edition, Al-Dar Al-Salafiyyah, Kuwait, 1407 AH.\n57 - Nuniyyah Al-Qahtani, by Abu Muhammad Abdullah bin Muhammad Al-Andalusi, 3rd Edition, Correction and Commentary by Muhammad bin Ahmad, Maktabat Al-Sawadi, Jeddah, 1415 AH.\n58 - Tape: Aqidah Ahl Al-Sunnah wa Al-Jama'ah fi Al-Qada' wa Al-Qadar, Saleh Al-Sheikh, Tasjilat Al-Nida' Al-Islamiyyah, Riyadh.\n59 - Tape: Athar Al-Iman bil-Qada' wa Al-Qadar 'ala Al-Mu'min, Sheikh Abdur-Rahman Al-Dawsari, and Saleh Al-Luhaidan, Tasjilat Al-Taqwa, No. 3362.",
    "foot_note": "None",
    "book_id": "70",
    "new_page_number": 52
  }
]