[
  {
    "text": "Tarawih Prayer\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Tarawih Prayer",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 1
  },
  {
    "text": "sn: 4762\nbook_title: صلاة التراويح\nbook_link: https://shamela.ws/book/680\nbook_id: 680\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: مكتبة المعارف للنشر والتوزيع - الرياض\nedition: الأولى - 1421\npages: 125\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: مسائل فقهية\ncategory_id: 19",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Tarawih Prayer",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 2
  },
  {
    "serial_number": "4629773",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Jurisprudential Issues. Book: Tarawih Prayer (Salat al-Tarawih). Author: Muhammad Nasir al-Din al-Albani (Died 1420 AH). Publisher: Al-Ma'arif Library for Publishing and Distribution - Riyadh. Edition: First - 1421. Number of Pages: 125 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nBook: Tarawih Prayer. Author: Muhammad Nasir al-Din al-Albani (Died 1420 AH). Publisher: Al-Ma'arif Library for Publishing and Distribution - Riyadh. Edition: First - 1421. Number of Pages: 125 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Muhammad Nasir al-Din al-Albani (Died 1420 AH). Publisher: Al-Ma'arif Library for Publishing and Distribution - Riyadh. Edition: First - 1421. Number of Pages: 125 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\n[Book numbering corresponds to the printed version]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 3
  },
  {
    "serial_number": "4629774",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 1,
    "volume_number": 1,
    "text": "Salat al-Tarawih (Tarawih Prayer). \"Pray as you have seen me praying\" (Al-Bukhari). By the Mark, the Scholar of Hadith, Muhammad Nasir al-Din al-Albani, may Allah the Exalted have mercy on him. Al-Ma'arif Library for Publishing and Distribution - Riyadh. 1st Edition, 1421 AH.",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 4
  },
  {
    "serial_number": "4629775",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 10,
    "volume_number": 1,
    "text": "- 1 - Preamble regarding the desirability of congregation in Tarawih. No one with general knowledge of the Sunnah doubts the legitimacy of performing the night prayer in congregation during Ramadan, this prayer known as Tarawih Prayer, for three reasons: A - His (PBUH) approval of the congregation for it. B - His performance of it. C - His clarification of its virtue. - As for the approval, it is based on the Hadith of Tha'labah bin Abi Malik Al-Qurazi who said: - 1 (Hasan) The Messenger of Allah (PBUH) went out one night in Ramadan and saw people praying in a corner of the mosque. He said: \"What are these people doing?\" Someone said: \"O Messenger of Allah, these are people who do not have the Quran [memorized], and Ubayy bin Ka'b is reciting and they are praying with his prayer.\" He said: \"They have done well\" or \"They have done right,\" and he did not dislike that from them. Narrated by Al-Bayhaqi (2 / 495) and he said: This is Mursal Hasan. I say: It has been narrated with a connected chain from another path via Abu Hurairah with a chain that is acceptable for corroboration and support, narrated by Ibn Nasr in Qiyam al-Layl (p. 20), Abu Dawood (1 / 217), and Al-Bayhaqi] [10]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 5
  },
  {
    "serial_number": "4629776",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 10,
    "volume_number": 1,
    "text": "B - As for his (PBUH) performance of it, there are several Hadiths: First - 2 (Sahih) From Al-Nu'man bin Bashir who said: We stood (prayed) with the Messenger of Allah (PBUH) on the night of the twenty-third of the month of Ramadan until the first third of the night. Then we stood with him on the night of the twenty-fifth until half the night. Then he stood with us on the night of the twenty-seventh until we thought we would not catch \"Al-Falah.\" He said: We used to call the Suhur \"Al-Falah.\" Narrated by Ibn Abi Shaybah in Al-Musannaf (2 / 90 / 2), Ibn Nasr (89), Al-Nasa'i (1 / 238), Ahmad (4 / 272), and Al-Firyani. Its chain is authentic (Sahih) and Al-Hakim authenticated it (1 / 440) and said: In it is clear evidence that Tarawih prayer in the mosques of Muslims is a prescribed Sunnah. Ali bin Abi Talib used to urge Umar, may Allah be pleased with them both, to establish this Sunnah until he established it. Second: - 3 (Sahih) From Anas who said: The Messenger of Allah (PBUH) was praying during Ramadan. I came and stood by his side, then another came, then another, until we were a group (Raht) (1). When the Messenger of Allah (PBUH) sensed that I was behind him, he shortened (2) the prayer, then entered his house. When he entered his house, he prayed a prayer that he did not pray when he was with us. When morning came, we said: \"O Messenger of Allah, did you notice us last night?\" He said: \"Yes, and that is what induced me to do what I did.\" Narrated by Ahmad and Ibn Nasr with two authentic chains, and Al-Tabarani in Al-Awsat similarly]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 5
  },
  {
    "serial_number": "4629777",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 11,
    "volume_number": 1,
    "text": "(1) Al-Raht is a group of less than ten. (2) Meaning: He lightened it. [11]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 6
  },
  {
    "serial_number": "4629778",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 11,
    "volume_number": 1,
    "text": "Third: - 4 (Sahih) From Aisha who said: The people used to pray in the mosque of the Messenger of Allah (PBUH) during Ramadan at night in scattered groups (1). A man would have some of the Quran [memorized], so a group of five or six or less or more would be with him, praying with his prayer. The Messenger of Allah (PBUH) commanded me one night to set up (2) a mat for him at the door of my room, so I did. The Messenger of Allah (PBUH) went out to it after he had prayed the last Isha prayer. She said: Those in the mosque gathered around him, so the Messenger of Allah (PBUH) prayed with them for a long time at night. Then the Messenger of Allah (PBUH) left and entered, leaving the mat as it was. When morning came, people talked about the prayer of the Messenger of Allah (PBUH) with those who were with him in the mosque that night. (So more gathered) than them, and the mosque became buzzing with people (3). (The Messenger of Allah (PBUH) went out on the second night and they prayed with his prayer. In the morning people mentioned that, so the people of the mosque increased (until it was packed with its people) on the third night. He went out and they prayed with his prayer. When it was the fourth night, the mosque was unable to hold its people). He prayed the last Isha prayer with them, then entered his house, and the people remained. She said: The Messenger of Allah (PBUH) said to me: \"What is the matter with the people, O Aisha?\" She said: I said to him: \"O Messenger of Allah, the people heard about your prayer last night with those who were in the mosque, so they gathered for that so you would lead them in prayer.\" She said: He said: \"Fold up your mat away from us, O Aisha.\" She said: So I did. The Messenger of Allah (PBUH) spent the night aware [of them], and the people remained in their places (some men among them began saying: \"The Prayer\"). Until the Messenger of Allah (PBUH) came out for the Morning Prayer (Subh). (When he finished the Dawn prayer, he turned to the people and testified [recited Tashahhud] (4) and said: \"As to what follows\"): O People, by Allah, I did not spend this night of mine unaware [of you], and praise be to Allah, nor was your place hidden from me. But I feared that it would be made obligatory upon you (and in a narration: But I feared that the night prayer would be made obligatory upon you) and you would be unable to perform it. So take upon yourselves only those deeds which you are capable of, for Allah does not get weary until you get weary. Added in another narration: Al-Zuhri said: The Messenger of Allah (PBUH) passed away and the matter remained like that. Then the matter remained like that during the caliphate of Abu Bakr and the beginning of the caliphate of Umar (5).",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 6
  },
  {
    "serial_number": "4629779",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 12,
    "volume_number": 1,
    "text": "(1) Meaning: Separate/Dispersed. (2) Meaning: I place. In \"Al-Lisan\": \"Nasb is placing a thing and raising it.\" Perhaps the first is appropriate here, meaning he (PBUH) ordered her to place a mat in front of the door. This is supported by the hadith of Zaid bin Thabit: \"The Prophet (PBUH) took a room in the mosque made of a mat, so the Messenger of Allah (PBUH) prayed in it for some nights until people gathered to him...\" The Hadith was narrated by Muslim (2 / 188) and others. (3) Meaning it had a buzz/clamor from the large number of people. (Nihayah). (4) Meaning he pronounced the Shahada. In my view, it is probable that she meant the Sermon of Necessity (Khutbat al-Hajah) wherein the Shahada is mentioned, and we have mentioned its text in the sermon of the first treatise and then printed it separately. (5) Narrated by Al-Bukhari, Muslim, Abu Dawood, Al-Nasa'i, Al-Firyani in Al-Siyam, Ibn Nasr, and Ahmad. The wording is theirs. [12]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 7
  },
  {
    "serial_number": "4629780",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 12,
    "volume_number": 1,
    "text": "I say: These Hadiths are clear evidence for the legitimacy of Tarawih prayer in congregation due to his (PBUH) persistence in those nights. His (PBUH) leaving it on the fourth night in this Hadith does not contradict this, because he (PBUH) justified it by saying \"I feared that it would be made obligatory upon you.\" There is no doubt that this fear ceased with his (PBUH) death after Allah completed the Sharia. Thus, the effect (leaving the congregation) ceases, and the previous ruling returns, which is the legitimacy of the congregation. For this reason, Umar bin Al-Khattab (may Allah be pleased with him) revived it as previously mentioned and as will come, and this is the view of the majority of scholars. Fourth: - 5 (Sahih) From Hudhayfah bin Al-Yaman who said: The Messenger of Allah (PBUH) stood one night in Ramadan in a room made of palm stalks. He poured a bucket of water over himself, then said (Allahu Akbar) Allahu Akbar (three times), Possessor of Sovereignty, Might, Pride, and Greatness. (Then he recited Al-Baqarah. He said: Then he bowed, and his bowing was similar [in length] to his standing. He began saying in his bowing: 'Subhana Rabbi al-Azim, Subhana Rabbi al-Azim' (similar to his standing). Then he raised his head from bowing and stood similar to his bowing, saying: 'Li Rabbi al-Hamd.' Then he prostrated, and his prostration was similar to his standing (1). And he was saying in his prostration 'Subhana Rabbi al-A'la.' Then he raised his head from prostration (then sat) and was saying between the two prostrations: 'Rabbi Ighfir li, Rabbi Ighfir li' (My Lord forgive me). And he sat for the duration of his prostration. (Then he prostrated and said: 'Subhana Rabbi al-A'la' similar to his standing). So he prayed four Rak'ahs in which he recited Al-Baqarah, Al-Imran, An-Nisa, Al-Ma'idah, and Al-An'am, until Bilal came and informed him of the prayer (2).",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 7
  },
  {
    "serial_number": "4629781",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 15,
    "volume_number": 1,
    "text": "(1) Meaning: The standing after bowing. (2) \"Meaning the Fajr prayer.\" The Hadith was narrated by Ibn Abi Shaybah, Ibn Nasr, Al-Nasa'i, Ahmad, Muslim, and others, taking note of the additions in other narrations which are between parentheses]. Al-Hakim narrated the saying between the two prostrations and authenticated it, and Al-Dhahabi agreed, and its narrators are trustworthy. [15]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 8
  },
  {
    "serial_number": "4629782",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 15,
    "volume_number": 1,
    "text": "C - As for his (PBUH) clarification of its virtue, it is what was narrated by - 6 (Sahih) Abu Dharr (may Allah be pleased with him) who said: We fasted, and he (PBUH) did not pray with us until seven [nights] remained of the month. He then stood with us until a third of the night had passed. Then he did not stand with us on the sixth [remaining night]. Then he stood with us on the fifth [remaining night] until half the night had passed. We said: \"O Messenger of Allah, if only you would lead us in voluntary prayer for the rest of this night of ours.\" He said: \"Indeed, whoever stands with the Imam until he leaves, it is written for him as the standing of a [whole] night.\" Then he did not pray with us until three [nights] remained of the month. He then prayed with us on the third [remaining night] and called his family and his women. He stood with us until we feared [missing] \"Al-Falah.\" I asked: \"What is Al-Falah?\" He said: \"The Suhur.\" Narrated by Ibn Abi Shaybah, Abu Dawood, Al-Tirmidhi (who authenticated it), Al-Nasa'i, Ibn Majah, Al-Tahawi in Sharh Ma'ani al-Athar, Ibn Nasr, Al-Firyani, and Al-Bayhaqi, and their chain is authentic]. The witness from the Hadith is his saying: \"Whoever stands with the Imam...\" for it is clear evidence of the virtue of praying the night of Ramadan with the Imam. This is supported by what Abu Dawood mentioned in Al-Masa'il (p. 62). He said: I heard Ahmad being asked: \"Do you like a man to pray with the people in Ramadan or alone?\" He said: \"He prays with the people.\" I also heard him say: \"I like that he prays with the Imam and performs Witr with him. The Prophet (PBUH) said: 'Indeed, if a man stands with the Imam until he leaves, Allah writes for him the rest of his night.'\" Ibn Nasr mentioned similar to this (p. 91) from Ahmad. Then Abu Dawood said: \"It was said to Ahmad while I was listening: 'Should he delay the Qiyam - meaning Tarawih - to the end of the night?' He said: 'No, the Sunnah of the Muslims is more beloved to me.' (1)",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 8
  },
  {
    "serial_number": "4629783",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 15,
    "volume_number": 1,
    "text": "2 - He (PBUH) did not pray Tarawih more than (11) Rak'ahs. After we have established the legitimacy of the congregation in Tarawih prayer through his (PBUH) approval, action, and encouragement, let us clarify how many Rak'ahs he (PBUH) prayed in those nights he revived with the people. Know that we have two Hadiths on this issue: First: - 7 (Sahih) From Abu Salamah bin Abd al-Rahman, that he asked Aisha (may Allah be pleased with her): \"How was the prayer of the Messenger of Allah (PBUH) in Ramadan?\" She said: \"The Messenger of Allah (PBUH) did not increase beyond eleven Rak'ahs in Ramadan or other than it (2). He would pray four, do not ask about their beauty and length. Then he would pray four, do not ask about their beauty and length. Then he would pray three.\" Narrated by Al-Bukhari, Muslim, Abu Awanah, Abu Dawood, Al-Tirmidhi, Al-Nasa'i, Malik, and from him Al-Bayhaqi and Ahmad. In a narration by Ibn Abi Shaybah, Muslim, and others: \"His prayer in the month of Ramadan and others was thirteen Rak'ahs at night, including the two Rak'ahs of Fajr.\" However, it came in another narration by Malik, and from him Al-Bukhari and others, from her, saying: \"He used to pray thirteen Rak'ahs at night, then pray two light Rak'ahs when he heard the call for the Morning Prayer.\" (Al-Hafiz said: It is possible that this is adding the Sunnah of Isha to the night prayer because he used to pray it in his house, or what he used to open the night prayer with, for it is proven in Muslim from her that he used to open it with two light Rak'ahs].",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 8
  },
  {
    "serial_number": "4629784",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 18,
    "volume_number": 1,
    "text": "(1) Meaning: Gathering for Tarawih prayer and doing it early is better in his view than doing it alone and delaying it to the end of the night, even if delaying has a special virtue. The congregation is better because the Prophet (PBUH) performed it during those nights he revived with the people in the mosque, as mentioned in Aisha's Hadith and others. This is what Muslims have practiced from the time of Umar until now. [18]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 9
  },
  {
    "serial_number": "4629785",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 19,
    "volume_number": 1,
    "text": "- 8 (Sahih) From Zaid bin Khalid Al-Juhani who said: \"I will surely watch the prayer of the Messenger of Allah (PBUH) tonight. He prayed two light Rak'ahs, then he prayed two long, long, long Rak'ahs. Then he prayed two Rak'ahs that were less than the two before them. Then he prayed two Rak'ahs that were less than the two before them. Then he prayed two Rak'ahs that were less than the two before them. Then he prayed two Rak'ahs that were less than the two before them. Then he performed Witr. So that is thirteen Rak'ahs.\" Narrated by Malik, and from him Muslim, Abu Awanah, Abu Dawood, and Ibn Nasr]. [19]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 10
  },
  {
    "serial_number": "4629786",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 21,
    "volume_number": 1,
    "text": "Second: - 9 (Hasan) From Jabir bin Abdullah (may Allah be pleased with him) who said: The Messenger of Allah (PBUH) prayed with us in the month of Ramadan eight Rak'ahs and performed Witr. When it was the next night, we gathered in the mosque and hoped he would come out. We remained there until morning. Then we entered and said: \"O Messenger of Allah, we gathered yesterday in the mosque and hoped you would pray with us.\" He said: \"Indeed, I feared that it would be prescribed upon you.\" Narrated by Ibn Nasr and Al-Tabarani, and its chain is Hasan (good) due to what preceded it. Al-Hafiz indicated its strengthening in Al-Fath and Al-Talkhis and attributed it to Ibn Khuzaymah and Ibn Hibban in their Sahihs]. [21]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 11
  },
  {
    "serial_number": "4629787",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 22,
    "volume_number": 1,
    "text": "The Hadith of Twenty [Rak'ahs] is very weak and it is not permissible to act upon it. Then he said in Al-Fath (4 / 205 - 206) under the explanation of the first Hadith: - 10 (Very Weak) As for what Ibn Shaybah narrated from the Hadith of Ibn Abbas: \"The Messenger of Allah (PBUH) used to pray twenty Rak'ahs and the Witr in Ramadan,\" its chain is weak. It is opposed by this Hadith of Aisha which is in the two Sahihs, along with her being more knowledgeable about the state of the Prophet (PBUH) at night than others. Al-Hafiz Al-Zayla'i preceded him to this meaning in Nasb al-Rayah. I say: This Hadith of Ibn Abbas is very weak, as Al-Suyuti said in \"Al-Hawi lil-Fatawi\" 2 / 73. Its defect is that it contains Abu Shaybah Ibrahim bin Uthman. Al-Hafiz said in Al-Taqrib: \"Matruk al-Hadith\" (Abandoned in Hadith). [22]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 12
  },
  {
    "serial_number": "4629788",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 29,
    "volume_number": 1,
    "text": "And that he narrates fabricated traditions, like the Hadith \"No nation perished except in Adhar (March)\" and \"The Hour will not be established except in Adhar,\" and that his Hadith regarding Tarawih is among his rejected narrations (Manakir). Al-Subki explicitly stated that the condition for acting upon a weak Hadith is that its weakness is not severe. Al-Dhahabi said: \"Whoever is called a liar by the likes of Shu'bah, his Hadith is not paid attention to.\"] I say: In what he quoted from Al-Subki is a subtle indication from Al-Haytami that he does not view acting upon the twenty [Rak'ahs], so contemplate. Then Al-Suyuti said after mentioning the Hadith of Jabir from the narration of Ibn Hibban: \"The conclusion is that the twenty Rak'ahs were not proven from his act (PBUH), and what is in Sahih Ibn Hibban is the utmost support for what we went to regarding our adherence to what is in Al-Bukhari from Aisha: 'He used not to increase in Ramadan or other than it beyond eleven.' Also indicating this is that when he (PBUH) did an action, he persisted in it, as he persisted in the two Rak'ahs he made up after Asr despite prayer at that time being forbidden. If he had done the twenty even once, he would not have left it forever, and if it had occurred, it would not have been hidden from Aisha when she said what preceded.\" [23] I say: In his words is a strong indication of his choice of eleven Rak'ahs and his rejection of the twenty mentioned in the Hadith of Ibn Abbas due to its severe weakness, so ponder. [24] 3 - His (PBUH) restriction to eleven Rak'ahs is evidence for the impermissibility of adding to it. It has become clear to us from what preceded that the number of Rak'ahs for the Night Prayer is only eleven Rak'ahs by the authentic text from the action of the Messenger of Allah (PBUH). If we reflect upon it, it becomes clear to us that he (PBUH) persisted on this number throughout his life, not adding to it, whether in Ramadan or other than it. If we recall in our minds that the regular Sunan prayers (Rawatib) and others like the rain prayer (Istisqa) and eclipse prayer (Kusuf), the Prophet (PBUH) also committed to a specific number of Rak'ahs in all of them, and this commitment was accepted evidence among scholars that it is not permissible to add to them; then likewise Tarawih prayer, it is not permissible to add to the prescribed number because it shares with the mentioned prayers the fact that he (PBUH) committed to a specific number in them [26] and did not exceed it. Whoever claims a difference, the burden of proof is upon him, and doing so is like stripping thorns [impossible]. Tarawih prayer is not of the absolute voluntary prayers (Nafl Mutlaq) such that the worshipper has the choice to pray it with any number he wishes. Rather, it is a confirmed Sunnah (Sunnah Mu'akkadah) resembling the obligatory prayers in that it is prescribed with a congregation, as the Shafi'is said. Thus, from this perspective, it is more deserving not to be added upon than the Sunan Rawatib. For this reason, they forbade combining four Rak'ahs of Tarawih with one Taslim (salutation), thinking that it was not narrated. They argued that \"Tarawih resembled the obligatory prayer by the request for congregation, so it should not be changed from what was narrated regarding it.\" Contemplate how they forbade connecting two Rak'ahs with two Rak'ahs—each of which is narrated—because connecting them, in their view, is a change to what was narrated regarding separation. [27] Do we not have the right then to forbid, using this very same argument, the addition of ten Rak'ahs that have absolutely no basis in the authentic Sunnah? Indeed, yes! Rather, this is more deserving and worthy of prevention. Is there anyone who will remember? Furthermore, even if we considered Tarawih prayer as absolute voluntary prayer not limited by the Lawgiver to a specific number, it would not be permissible for us to commit ourselves to a number we do not exceed, based on what is established in the principles (Usul): That it is not permissible to commit to a description not narrated from him (PBUH) in an act of worship. Sheikh Mulla Ahmad Rumi Al-Hanafi, author of \"Majalis al-Abrar,\" said in summary: \"Because the non-occurrence of the action in the first generation was either due to lack of need for it, or the existence of a hindrance, or lack of awareness, or laziness, or dislike, or lack of legitimacy. The first two are negated in purely physical acts of worship because the need to draw close to Allah Almighty does not cease, and after the appearance of Islam, there was no hindrance. And it is not thought of the Prophet (PBUH) to have lack of awareness or laziness, for that is the worst suspicion leading to disbelief. Thus, nothing remains except it being bad and illegitimate. Likewise, it is said to one who introduces a description in purely physical acts of worship that did not exist in the time of the Companions: If the description of worship in the innovated action implied it being a [28] good innovation (Bid'ah Hasanah), there would be no disliked innovation (Bid'ah Makruhah) in acts of worship, and the jurists would not have classified Salat al-Raghaib, congregation in it, types of melodies in sermons and Adhan, reading Quran in Ruku' (bowing), loud Dhikr in front of the funeral, and similar things as reprehensible innovations. Whoever says they are good is told: What is proven to be good by Sharia evidence is either not an innovation—so the general implication of the Hadith 'Every innovation is misguidance' and the Hadith 'Every deed not upon our affair is rejected' remains as is—or it is specific, and a specific generality is a proof in what is not specified from it. Whoever claims specification in what he invented also needs evidence suitable for specification from the Book, Sunnah, or Consensus restricted to the people of Ijtihad, with no consideration for the commoners or the custom of most lands regarding it. So whoever introduces something to draw close to Allah Almighty in word or deed has legislated in the religion what Allah did not permit. Thus it is known that every innovation in purely physical acts of worship can only be bad.\" Doubts and their Answers: If we know the implication of this text is that it is not permissible to add to it, then for complete benefit, we should present some doubts that some may raise regarding [29]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 13
  },
  {
    "serial_number": "4629789",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 30,
    "volume_number": 1,
    "text": "this issue, along with the answer to them, so the reader may be upon clear evidence in his matter. I say: First Doubt: (Difference of opinion among scholars is evidence of the lack of a confirmed text specifying the number). It is known that scholars differed regarding the number of Rak'ahs of Tarawih into many opinions as will be explained. A speaker might say: 'This difference indicates the non-existence of a text regarding the number, for if it were proven, difference would not have occurred regarding its number. If that were proven from the action of the Prophet (PBUH), they would not have differed in it like the number of Witr and Rawatib.' The Answer: We admit that some differences are caused by the lack of a text. However, it is strange for Al-Suyuti to establish this statement, for it [30]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 14
  },
  {
    "serial_number": "4629790",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 31,
    "volume_number": 1,
    "text": "is understood from it that difference has only one cause, which is the lack of a proven text. Yet, it is known that there are many differences whose cause was not the lack of a text, but rather it not reaching the Imam who voiced the contrary opinion, or it reached him but through a path that does not constitute a proof, or it reached him authentic but he understood it in a way other than how another Imam understood it, and other causes for difference mentioned by scholars. So, difference does not have a single cause. Rather, it has—as you see—many causes. Do you not see that there are many issues in which they differed even though there are proven texts regarding them from him (PBUH), as is known to scholars of Fiqh and Hadith? Let us give a clear example of that: (Raising the hands in prayer when bowing and rising from it). All scholars from various schools agreed on its legitimacy except the Hanafis, even though about twenty authentic Hadiths were narrated regarding it. In some of them, Abu Hamid Al-Sa'idi (may Allah be pleased with him) described the prayer of the Prophet (PBUH) in the presence of [31]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 15
  },
  {
    "serial_number": "4629791",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 32,
    "volume_number": 1,
    "text": "ten of the Companions, and he mentioned raising [hands] in it. When he finished describing it, they said to him: \"You have spoken the truth, such was the prayer of the Messenger of Allah (PBUH).\" Narrated by Al-Bukhari. Imam Abu Hanifa (may Allah be pleased with him) answered when asked about not adopting the raising [of hands] by saying: \"Because no Hadith from the Messenger of Allah (PBUH) was established regarding it,\" in a well-known story that occurred between him and one of the Hadith scholars mentioned by the Hanafis in their books. This statement from Imam Abu Hanifa (may Allah have mercy on him) could not have been said had he stood upon these paths we referred to. This is the greatest evidence that the disagreement in this issue was not caused by the lack of existence or proof of the text, but the cause was it not reaching the Imam through an authentic path, as Imam Abu Hanifa himself (may Allah Almighty have mercy on him) expressed. [32]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 16
  },
  {
    "serial_number": "4629792",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 33,
    "volume_number": 1,
    "text": "This is one example among many known to those occupied with the Sunnah. I say: So just as the difference in this issue and similar ones does not indicate the lack of a proven text regarding it, likewise the difference in the number of Tarawih Rak'ahs does not indicate the lack of a proven text regarding it. Because the reality is that the text is narrated and proven regarding it. So it is not permissible to reject the text because of the difference. Rather, it is obligatory to resolve the difference by referring to the text, acting upon the saying of Allah the Blessed and Exalted: {But no, by your Lord, they will not [truly] believe until they make you, [O Muhammad], judge concerning that over which they dispute among themselves and then find within themselves no discomfort from what you have judged and submit in [full, willing] submission.} [33]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 17
  },
  {
    "serial_number": "4629793",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 34,
    "volume_number": 1,
    "text": "And His saying: {And if you disagree over anything, refer it to Allah and the Messenger, if you should believe in Allah and the Last Day. That is the best [way] and best in result.} Second Doubt: (There is no impediment to adding to the text as long as he did not forbid it). Another speaker might say: 'We admit that the text is proven that the Prophet (PBUH) prayed Tarawih only eleven Rak'ahs, and that the report stating he prayed twenty is proven weak. However, we see no impediment to adding to it because the Messenger of Allah (PBUH) did not forbid it.' I say: The principle in acts of worship is that they are not established except by evidence (Tawqif) from the Messenger of Allah (PBUH). This principle is agreed upon among scholars, and we do not imagine a knowledgeable Muslim disagreeing with it. Were it not for this principle, it would be permissible for any Muslim to increase the number of Rak'ahs of the Sunan, and even the Obligatory prayers whose number is fixed by his (PBUH) action and his persistence upon it, claiming that he (PBUH) did not forbid adding to them. This is clearly invalid, so there is no need to prolong speech on it, especially since we have previously explained in detail (p. 22-24) that adding to Tarawih prayer is more deserving of prohibition than adding to the Sunan and Rawatib, so remember that. [34]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 18
  },
  {
    "serial_number": "4629794",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 36,
    "volume_number": 1,
    "text": "Third Doubt: (Clinging to Absolute and General Texts). Some of them clung to absolute and general texts encouraging the abundance of prayer without specifying a specific number, like his (PBUH) saying to Rabi'ah bin Ka'b when he asked him for his companionship in Paradise: - 11 (Sahih) \"So help me against yourself with frequent prostration.\" Narrated by Muslim in his Sahih and Abu Awanah]. And like the Hadith of Abu Hurairah (may Allah be pleased with him): \"He used to encourage standing [in prayer] in Ramadan...\" and similar Hadiths that indicate by their absolute nature and generality the legitimacy of praying any number the worshipper wishes. [36]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 19
  },
  {
    "serial_number": "4629795",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 37,
    "volume_number": 1,
    "text": "The Answer: This is a very flimsy hold; rather, it is a doubt not worth mentioning, like the one before it. For acting upon absolute texts (Mutlaqat) in their absolute sense is only permissible regarding absolute texts that the Lawgiver has not restricted. However, if the Lawgiver restricts an absolute ruling with a condition, then it is obligatory to adhere to it and not suffice with the absolute. Since our issue (Tarawih Prayer) is not of the absolute voluntary prayers because it is a prayer restricted by a text from the Messenger of Allah (PBUH) as previously explained at the beginning of this chapter, it is not permissible to nullify this restriction by clinging to absolute texts. The likeness of one who does that is only like one who prays a prayer contradicting the prayer of the Prophet (PBUH) transmitted from him with authentic chains, contradicting it in quantity and quality, forgetting his (PBUH) saying: (Pray as you have seen me praying), arguing with such absolute texts. Like one who prays Dhuhr five [Rak'ahs] and the Sunnah of Fajr four, and like one who prays with two bowings [in one Rak'ah] or [extra] prostrations. The invalidity of this is not hidden from a rational person. For this reason, the Mark Sheikh Ali Mahfouz said in \"Al-Ibda'\" (p. 25) after quoting texts from scholars of the four schools stating that what the Prophet (PBUH) left while the motive for doing it existed, his leaving of it is the Sunnah and doing it is a blameworthy innovation. He said: [37]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 20
  },
  {
    "serial_number": "4629796",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 39,
    "volume_number": 1,
    "text": "\"And you have known that clinging to generalities while neglecting the explanation of the Messenger and his abandonment [of an act] is following the ambiguous (Mutashabih) which Allah forbade. If we relied on generalities and turned a blind eye to the clarification, a great door of innovation would be opened that could not be closed, and invention in religion would not stop at a limit. Here are examples of that based on the foregoing: First: It came in the Hadith of Al-Tabarani 'Prayer is the best subject matter.' If we held to the generality of this, how could Salat al-Raghaib be a blameworthy innovation? And how could the prayer of [mid] Sha'ban be a blameworthy innovation while they fall under the generality of the Hadith? Yet scholars have stated that they are ugly, blameworthy innovations as will come. Second: The Almighty said: {And who is better in speech than one who invites to Allah and does righteousness?} And the Mighty and Majestic said: {Remember Allah with much remembrance.} If someone recommended Adhan for the two Eids, the Eclipses, and Tarawih, and we said: 'How? When the Prophet (PBUH) did not do it, nor order it, and left it throughout his life?' He would say to us: 'The Mu'adhin is a caller to Allah, and the Mu'adhin is a rememberer of Allah.' How can the argument be established against him and how can his innovation be invalidated? Third: The Almighty said: {Indeed, Allah and His angels send blessings upon the Prophet.} If taking generalities were valid, it would be valid to draw close to Allah Almighty by sending blessings and peace [upon him PBUH] in the standing of prayer, its bowing, its straightening, and its prostration, and other places where the Messenger (PBUH) did not place it. Who permits drawing close to Allah Almighty with the like of that, and that prayer in this description be considered valid worship? How is this [compatible] with the Hadith 'Pray as you have seen me praying' narrated by Al-Bukhari? Fourth: It was reported in the authentic Hadith 'In what is watered by the sky, springs, and rain-watered land is the tithe (tenth), and in what is watered by irrigation is half the tithe.' If the generality of this were taken, Zakat would be obligatory in [vegetables/all produce], and they have no basis for the non-obligation of Zakat except this principle: that what he left while the motive existed for doing it, leaving it is the Sunnah and doing it is the innovation.\" [39]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 21
  },
  {
    "serial_number": "4629797",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Tarawih Prayer",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 40,
    "volume_number": 1,
    "text": "The Real Reason for Scholars' Difference regarding the Number of Tarawih Rak'ahs. If it is said: We admit the invalidity of all these doubts and the soundness of the text from any opponent, so what is the reason that caused scholars to differ in the number of Rak'ahs of Tarawih? We say: What appears to us regarding that are two matters, with no third: First: Which is the stronger and more common [reason]: Lack of awareness of this text reported regarding the number. Whoever it did not reach is excused for not acting upon it, due to the saying of the Almighty on the tongue of the Messenger of Allah (PBUH) regarding the Quran: {that I may warn you thereby and whomever it reaches}. Rather, he is rewarded due to his (PBUH) saying: - 12 (Sahih) \"If a judge judges and exercises Ijtihad and is correct, he has two rewards. And if he judges and exercises Ijtihad and errs, he has one reward.\" Narrated by Al-Bukhari and others]. Second: That they understood the text in a way that does not oblige them to stop at it and not exceed it, due to a mode of interpretation (Ta'wil) that may occur to some scholars, regardless of whether it is wrong or right. Like the saying of the Shafi'is: \"As for the saying of Aisha: 'He (PBUH) did not increase in Ramadan or other than it beyond eleven Rak'ahs,' it is interpreted as referring to Witr.\" And similar interpretations which do not oblige others to adopt them due to their proven weakness to them. So look, for example, at [40]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 22
  },
  {
    "serial_number": "4629798",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 41,
    "volume_number": 1,
    "text": "This aspect which I quoted from the Shafi'is is clearly weak if you remember that Aisha's statement was essentially an answer to someone who asked her: \"How was the prayer of the Messenger of Allah (peace be upon him) in Ramadan?\" As previously mentioned, the prayer inquired about includes all night prayers. So how can it be valid to interpret it as referring only to the Witr prayer excluding the rest of the night prayer? Furthermore, this interpretation implies that he (peace be upon him) had two prayers: one being the night prayer—and I do not know how many rak'ahs that would be—and the other being the Witr prayer with its maximum number of rak'ahs: eleven rak'ahs. This is something no one knowledgeable in the Sunnah would say, for the Hadiths mutually support that his prayer (peace be upon him) at night did not exceed eleven rak'ahs, as per the detailed explanation provided earlier. This is one of the results of interpreting texts to support a Madhhab (school of thought). Our stance towards those who disagree with us on this issue and others: If you know this, let no one imagine that when we chose to restrict the number of Tarawih rak'ahs to the Sunnah and the impermissibility of adding to it, that we are declaring astray or innovators those scholars of the past and present who do not hold this view, as some people have surmised and used as an argument to attack us, under the illusion that it necessitates from our saying: \"that such and such matter is not permissible\" or that \"it is an innovation\" that [41]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 23
  },
  {
    "serial_number": "4629799",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 42,
    "volume_number": 1,
    "text": "everyone who says it is permissible or recommended is a misguided innovator. No, indeed it is a false illusion and extreme ignorance. For the innovation (Bid'ah) whose perpetrator is blameworthy and to whom the Hadiths warning against innovation apply is essentially \"an invented way in religion that mimics the Sharia, intended by following it to exaggerate in worshiping Allah the Almighty.\" So whoever invents an innovation intending exaggeration in worship while knowing it is not from the Sharia, he is the one to whom those Hadiths apply. As for the one who falls into it without knowing about it and did not intend exaggeration in worship by it, those Hadiths do not include him at all, nor do they concern him in the slightest. Rather, they concern those innovators who stand in the way of the spread of the Sunnah and deem every innovation good without knowledge, guidance, or an enlightening book, nor even by imitating the people of knowledge and remembrance, but rather by following desire and pleasing the common folk. Far be it that any of the scholars known for their knowledge, truthfulness, righteousness, and sincerity be among these, especially the four Mujtahid Imams (may Allah be pleased with them all). We hold them far above deeming an innovation good out of exaggeration in worship on their part; how could they, when they have forbidden that? As we will mention their texts regarding this in the treatise dedicated to Innovation (Bid'ah), God willing. Yes, one of them may fall into what is legally an error, but he is not held accountable for that; rather, he is forgiven for it and rewarded for it, as previously mentioned repeatedly. And it may [42]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 24
  },
  {
    "serial_number": "4629800",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 43,
    "volume_number": 1,
    "text": "become clear to the researcher that this error is of the type of innovation, so the ruling does not differ in that he is forgiven and rewarded for it because it occurred due to Ijtihad (juridical reasoning) on his part. No scholar doubts that there is no difference, in terms of it being an error, between a scholar falling into an innovation thinking it is a Sunnah and his falling into a prohibition thinking it is permissible; all of this is error and is forgiven, as you have learned. That is why we see scholars, despite their severe disagreement on some issues, do not declare each other astray nor declare each other innovators. Let us give one example of that: They have differed since the time of the Companions regarding completing the obligatory prayer during travel; some permitted it and some forbade it and saw it as an innovation contrary to the Sunnah. Yet, they did not declare their opponents innovators. Here is Ibn Umar (may Allah be pleased with him) saying: - 13 (Authentic report) \"The prayer of the traveler is two rak'ahs; whoever opposes the Sunnah has disbelieved.\" [Narrated by Al-Sarraj in his Musnad with two authentic chains from him]. Despite this, he did not declare as a disbeliever or astray those who opposed this Sunnah out of Ijtihad. Rather, when he prayed behind someone who viewed completing [the prayer] as correct, he completed it with him. - 14 (Authentic) Al-Sarraj narrated with an authentic chain from him that the Prophet (peace be upon him) prayed two rak'ahs in Mina, and Abu Bakr, Umar, and Uthman in the beginning of his caliphate prayed two rak'ahs. Then Uthman prayed four in Mina. So when Ibn Umar prayed with them, he prayed four, and when he prayed alone, he prayed two. Al-Bukhari narrated similarly from Ibn Mas'ud, and in it is that when news reached him of Uthman completing [the prayer], he said 'Inna lillahi wa inna ilayhi raji'un' (Truly to Allah we belong and to Him we return).] [43]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 25
  },
  {
    "serial_number": "4629801",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 44,
    "volume_number": 1,
    "text": "Reflect on how Ibn Umar's belief that opposing the established Sunnah of completing [prayer] in travel is an error did not lead him to declare him astray or an innovator. Rather, he prayed behind him because he knew that Uthman (may Allah be pleased with him) did not complete it following desire—God forbid—but rather it resulted from Ijtihad on his part. This is the middle path that we see as obligatory for Muslims to adopt as a way to resolve the disputes existing among them: that each of them proclaims what he sees as the correct view agreeing with the Book and the Sunnah, provided that he does not declare astray or an innovator those who do not see that due to a misconception (Shubhah) that occurred to them. Because this is the only way by which the unity of Muslims is realized and their word is united, and the truth remains apparent and clear within it, its features unobscured. For this reason, we also see that the separation of Muslims in their prayers behind multiple Imams—this one Hanafi and this one Shafi'i...—contradicts what our righteous predecessors were upon regarding gathering for prayer behind one Imam and not separating behind multiple Imams. This is our stance on the disputed issues among Muslims: proclaiming the truth in the best manner and not declaring astray those who oppose us due to a misconception, not out of desire. [44]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 26
  },
  {
    "serial_number": "4629802",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 45,
    "volume_number": 1,
    "text": "This is what we have followed since Allah guided us to follow the Sunnah, and that has been for about twenty years. We wish for a similar stance from those who are hasty in declaring Muslims astray, whose school of thought is the saying: \"If asked about our Madhhab? We say: Correct with the possibility of error. And if asked about the Madhhab of others? We say error with the possibility of correctness.\" And [from those] whose Madhhab is the view that praying behind an opponent in Madhhab is disliked (Makruh) or invalid. Therefore, they separated in a single mosque as previously mentioned, especially in the Witr congregation in Ramadan, because some of them think that Witr is not valid if the Imam separates between his Shaf' (even rak'ahs) and his Witr (odd rak'ah), even though it is the most excellent way proven from the Messenger of Allah (peace be upon him), as will come in Chapter Seven. That is our position, and I do not think a rational person would dispute us on it. So whoever attributes to us other than that has transgressed, exceeded bounds, and committed injustice, and Allah is his reckoner. Our purpose in spreading the Sunnah regarding this issue and others is clear and apparent, which is conveying it to the people due to his saying (peace be upon him): \"Convey from me even if it is one verse...\" The Hadith was narrated by Al-Bukhari and Muslim. Perhaps if it reaches them, they will be convinced of its correctness and adhere to it, and in that lies their success and happiness in both abodes, and in it is the multiplication of reward for us, God willing, due to his saying (peace be upon him): \"Whoever introduces a good practice (Sunnah) in Islam, he will have its reward and the reward of those who act upon it until the Day of Resurrection.\" So whoever is not convinced by it due to a misconception [45]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 27
  },
  {
    "serial_number": "4629803",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 46,
    "volume_number": 1,
    "text": "not out of desire nor following fathers and grandfathers, then no one has a way against him, especially if some senior scholars did not adhere to it, as in this issue. And success is from Allah, the Almighty. The most cautious is to follow the Sunnah: Furthermore, whatever is said regarding the permissibility of the increase or lack thereof, I do not think that a Muslim would hesitate—after what has been explained previously—to say that the number reported from him (peace be upon him) is better than adding to it, due to the explicit saying of his (peace be upon him): (Authentic) \"And the best guidance is the guidance of Muhammad (peace be upon him).\" Narrated by Muslim. So what prevents Muslims today from taking this Muhammadan guidance and leaving what is in excess of it? So what prevents Muslims today from taking this Muhammadan guidance and leaving what is in excess of it, even if only from the principle of \"Leave that which makes you doubt for that which does not make you doubt,\" especially since many of them perform the Tarawih prayer of twenty rak'ahs badly due to the excessive speed with which they perform it, to the point that it could be said that it is absolutely invalid due to their violation of tranquility (Tuma'ninah), which is a pillar of the pillars of prayer without which prayer is not valid, as will be explained in Chapter Eight. [46]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 28
  },
  {
    "serial_number": "4629804",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 47,
    "volume_number": 1,
    "text": "If they prayed the number reported in the Sunnah in the same duration they pray the twenty, their prayer would be valid and accepted by the consensus of scholars. This is supported by the hadith of Jabir who said: The Prophet (peace be upon him) was asked, \"Which prayer is best?\" He said: \"Long standing.\" So adhere, O Muslims, to his Sunnah (peace be upon him); hold on to it and bite onto it with your molars, for indeed \"the best guidance is the guidance of Muhammad\" (peace be upon him). [47]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 29
  },
  {
    "serial_number": "4629805",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 49,
    "volume_number": 1,
    "text": "4 - Umar reviving the Sunnah of congregation in Tarawih and his command for (11) Rak'ahs: We previously mentioned that after his death (peace be upon him), people continued performing Tarawih in the mosque in scattered groups behind multiple Imams during the caliphate of Abu Bakr and the beginning of the caliphate of Umar (may Allah be pleased with them). Then Umar (may Allah be pleased with him) gathered them behind one Imam. Abdur-Rahman bin Abdul Qari said: - 15 (Authentic report) \"I went out with Umar bin Al-Khattab one night in Ramadan to the mosque, and behold, the people were scattered groups; a man praying for himself, and a man praying with a group (Raht: a number from three to ten) praying with his prayer. He said: [By Allah] I think if I gathered these people behind one reader, it would be better. Then he resolved and gathered them behind Ubayy bin Ka'b. [He said]: Then I went out with him another night, and the people were praying with the prayer of their reader. Umar said: 'What an excellent innovation (Bid'ah) this is; and the one they sleep through is better than the one they stand for'—meaning the end of the night, and people used to stand in the beginning of it.\" [Narrated by Malik in Al-Muwatta, and from him Al-Bukhari and Al-Faryabi. Ibn Abi Shaybah narrated similarly without the phrase 'What an excellent innovation this is'. And Ibn Sa'd and Al-Faryabi have another route with the wording: \"If this is it, then what an excellent innovation.\" Its narrators are trustworthy except Nawfal bin Iyas, about whom Al-Hafiz said in 'Al-Taqrib': \"Acceptable\" when corroborated, otherwise soft in Hadith.] [49]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 30
  },
  {
    "serial_number": "4629806",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 50,
    "volume_number": 1,
    "text": "Know that it has become common among later scholars to use Umar's saying \"What an excellent innovation this is\" as evidence for two things: First: That gathering for Tarawih prayer is an innovation that did not exist in the time of the Prophet (peace be upon him). This is a gross error; we will not prolong discussion on it due to its obviousness. Sufficient proof for its invalidity are the previously mentioned Hadiths regarding him (peace be upon him) gathering people for three nights in Ramadan, and that leaving the congregation was only out of fear of it becoming obligatory. Second: That there is praiseworthy innovation, and they used this to specify the generality of his saying (peace be upon him) \"Every innovation is a misguidance\" and similar other Hadiths. This is also false, for the Hadith remains on its generality, as will be explained in the treatise dedicated to Innovation (Bid'ah), God willing. And Umar's saying: \"What an excellent innovation this is\" did not intend innovation in its Shariah meaning, which is introducing something into the religion without a preceding example, because you know that he (may Allah be pleased with him) did not introduce anything; rather, he revived more than one noble Prophetic Sunnah. Rather, he intended innovation in one of its linguistic meanings, which is a new, modern matter that was not known immediately prior to its creation. There is no doubt that Tarawih prayer in congregation behind one Imam was not customary or practiced during the caliphate of Abu Bakr and a part of Umar's caliphate—as mentioned previously—so in this regard, it is new. However, considering that it agrees with what he (peace be upon him) did, it is a Sunnah and not an innovation. He only described it as good ('excellent') for that reason. [50]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 31
  },
  {
    "serial_number": "4629807",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 52,
    "volume_number": 1,
    "text": "According to this meaning, the verifying scholars proceeded in interpreting this statement of Umar. Al-Subki - Abdul Wahhab - said in \"Ishraq Al-Masabih fi Salat Al-Tarawih\" (1/168) from \"Al-Fatawa\": Ibn Abd al-Barr said: Umar did not institute anything in that except what the Messenger of Allah (peace be upon him) instituted, loved, and was pleased with. He was only prevented from persisting in it out of fear that it would be made obligatory upon his nation, and he was kind and merciful to the believers (peace be upon him). So when Umar knew that from the Messenger of Allah (peace be upon him) and knew that obligatory duties are not increased nor decreased after his death (peace be upon him), he established it for the people, revived it, and commanded it. This was in the year fourteen of the Hijra. That is something Allah stored for him and favored him with, and He did not inspire Abu Bakr to it, even though he was better and more severely ahead in every good in general. Yet each of them had virtues specific to him not possessed by his companion. Al-Subki said: If it were not required, it would have been a blameworthy innovation like the \"Ragha'ib\" [prayers] of the night of mid-Sha'ban and the first Friday of Rajab, so it would have been obligatory to deny it. Its invalidity (meaning the invalidity of denying the Tarawih congregation) is known from the religion by necessity.\" And the scholar Ibn Hajar Al-Haytami said in his Fatwa, the text of which is: Expelling the Jews and Christians from the Arabian Peninsula and fighting the Turks, since it was done by his command (peace be upon him), was not an innovation, even if it was not done in his time. [51] And the saying of Umar (may Allah be pleased with him) regarding Tarawih prayer: 'What an excellent innovation it is,' he intended the linguistic innovation, which is what is done without a prior example, as the Almighty said: {I am not a new one (Bid'an) among the messengers}. It is not a Shariah innovation, for Shariah innovation is misguidance as he (peace be upon him) said. Whoever among the scholars divided it into good and not good only divided the linguistic innovation. And whoever said 'every innovation is misguidance,' his meaning is Shariah innovation. Do you not see that the Companions (may Allah be pleased with them) and those who followed them in goodness denied the Adhan for other than the five prayers, like the two Eids, even though there is no prohibition regarding it? And they disliked touching the two Syrian corners [of the Kaaba] and praying after the Sa'y between Safa and Marwa by analogy to Tawaf. Similarly, what he (peace be upon him) left despite the existence of a motivating factor, doing it is a blameworthy innovation. Excluded by our saying 'despite the existence of a motivating factor during his lifetime' is the expulsion of the Jews, the compilation of the Quran, and what he left due to the presence of a preventative factor, like the gathering for Tarawih, for the complete motivating factor includes the absence of the preventative factor.\" [52]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 32
  },
  {
    "serial_number": "4629808",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 53,
    "volume_number": 1,
    "text": "Umar's command for (11) Rak'ahs: As for Umar's command (may Allah be pleased with him) for eleven rak'ahs, it is what Malik narrated in \"Al-Muwatta\" (1/137) (and number 248) from Muhammad bin Yusuf from Al-Sa'ib bin Yazid that he said: \"Umar bin Al-Khattab (may Allah be pleased with him) commanded Ubayy bin Ka'b and Tamim Al-Dari to lead the people in eleven rak'ahs. He said: The reader used to read the hundreds [of verses] until we would lean on staffs due to the length of standing, and we would not leave except at the break of dawn.\" [Its chain is extremely authentic]. And Ibn Ishaq [53]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 33
  },
  {
    "serial_number": "4629809",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 54,
    "volume_number": 1,
    "text": "said: \"Thirteen Rak'ahs.\" And this is how Ibn Nasr narrated it in \"Qiyam Al-Layl\" (91) and added: Ibn Ishaq said: And the most established thing I have heard regarding that (meaning the number of prayers in Ramadan) and the most likely is the Hadith of Al-Sa'ib, because the Messenger of Allah (peace be upon him) had thirteen rak'ahs at night. I say: This number: \"Thirteen\" which Ibn Ishaq singled out is consistent with the other narration from the Hadith of Aisha regarding his standing (peace be upon him) in Ramadan. It was clarified in a narration that it includes the two rak'ahs of Fajr. So Ibn Ishaq's narration can be interpreted in that way so that it agrees with the narration of the group. From the above, you know that the saying of Ibn Abd al-Barr: \"And I do not know of anyone who said eleven in it except Malik\" is a clear error. Al-Mubarakpuri said in \"Tuhfat Al-Ahwadhi\": \"A false illusion.\" For this reason, Al-Zarqani rejected it in \"Sharh Al-Muwatta\" saying: It is not as he said, for Sa'id bin Mansur narrated it from another route via Muhammad bin Yusuf and said: Eleven rak'ahs, just as Malik said. [54]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 34
  },
  {
    "serial_number": "4629810",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 57,
    "volume_number": 1,
    "text": "I say: Its chain is extremely authentic as Al-Suyuti said in \"Al-Masabih\". This alone is sufficient to refute Ibn Abd al-Barr's statement, so how about when those other corroborations that I have not seen anyone precede me in collecting are added to it? Praise be to Allah for His guidance. It is not proven that Umar prayed it as twenty: Investigation of the reports narrated regarding that and explanation of their weakness. It is not permissible to oppose this authentic narration with what Abd al-Razzaq narrated from another route via Muhammad bin Yusuf with the wording \"twenty-one\", due to the obvious error of this wording from two aspects: First: Its contradiction to the narration of the trustworthy narrator mentioned earlier with the wording \"eleven\". Second: That Abd al-Razzaq was solitary in narrating this wording. Even if he is safe regarding those between him and Muhammad bin Yusuf, the defect is from him, i.e., Abd al-Razzaq, because although he was a trustworthy Hafiz and a famous author, he became blind at the end of his life and changed, as Al-Hafiz said in \"Al-Taqrib\". For this reason, Al-Hafiz Abu Umar Ibn Al-Salah listed him among \"Those who became confused at the end of their lives\". He said in \"Introduction to the Science of Hadith\": Ahmad bin Hanbal mentioned that he became blind at the end of his life, so he would be prompted and he would accept the prompting. So the hearing of anyone who heard from him after he became blind is nothing. Al-Nasa'i said: There is an issue with those who wrote from him at the end. He said in the introduction of the mentioned chapter (p. 391): The ruling regarding them (meaning those who became confused) is that the hadith of those who took from them before the confusion is accepted, and the hadith of those who took from them after [56] the confusion is not accepted, or if his matter is ambiguous so it is not known whether he took from him before the confusion or after. I say: And this report is from the third category, meaning it is not known if he narrated it before the confusion or after, so it is not accepted. This is if it were free from anomaly (Shudhudh) and contradiction, so how can it be accepted with them? If it is said: Al-Faryabi narrated in \"Al-Siyam\" (76/1) and Al-Bayhaqi in \"Al-Sunan\" (2/496) via Yazid bin Khasifah from Al-Sa'ib bin Yazid who said: \"They used to stand during the time of Umar bin Al-Khattab (may Allah be pleased with him) in the month of Ramadan with twenty rak'ahs. He said: And they used to read with the hundreds, and they used to lean on their staffs in the time of Uthman (may Allah be pleased with him) from the intensity of the standing.\" I say: This route with the wording of twenty is the mainstay of those who hold the view of the legitimacy of twenty in Tarawih prayer. Its chain appears authentic, and thus some authenticated it. However, it has a defect, nay defects, that prevent declaring it authentic and make it weak and denounced (Munkar). The explanation of that is from several aspects: First: Ibn Khasifah, although trustworthy, Imam Ahmad said about him in a narration: \"Munkar al-Hadith\" (Denounced in Hadith). That is why Al-Dhahabi listed him in \"Al-Mizan\". In this saying of Ahmad, there is an indication that Ibn Khasifah may be solitary in narrating what [57]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 35
  },
  {
    "serial_number": "4629811",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 58,
    "volume_number": 1,
    "text": "not narrated by trustworthy narrators, so the likes of him, his hadith is rejected if he opposes someone who has better memory than him; it becomes anomalous (Shadh) as established in \"Mustalah al-Hadith\" (Science of Hadith Terminology). This report is of this type, for it revolves around Al-Sa'ib bin Yazid as you saw. Muhammad bin Yusuf and Ibn Khasifah narrated it from him, and they differed regarding the number. The first said from him: (11), and the other said: (20). The preferred view is the saying of the first because he is more trustworthy than him, for Al-Hafiz Ibn Hajar described him as \"Trustworthy, Firm (Thiqah Thabt)\" and restricted himself regarding the second to saying: \"Trustworthy (Thiqah)\". This disparity is one of the preponderating factors in cases of contradiction, as is not hidden from the expert in this noble science. Second: That Ibn Khasifah was confused (Idtaraba) in his narration of the number. Isma'il bin Umayyah said that Muhammad bin Yusuf, the nephew of Al-Sa'ib bin Yazid, informed him (I say: he mentioned the like of Malik's narration from Ibn Yusuf, then Ibn Umayyah said): I said: Or twenty-one? He (meaning Muhammad bin Yusuf) said: He surely heard that from Al-Sa'ib bin Yazid - Ibn Khasifah? So I asked (the questioner is Isma'il bin Umayyah) Yazid bin Khasifah? He said: I reckoned that Al-Sa'ib said: Twenty-one. I say: Its chain is authentic. [58]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 36
  },
  {
    "serial_number": "4629812",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 59,
    "volume_number": 1,
    "text": "So his saying in this narration \"twenty-one\" is contrary to the previous narration: \"twenty\". And his saying in this one \"I reckoned\" meaning \"I thought\" is evidence of Ibn Khasifah's confusion in narrating this number and that he was narrating it based on conjecture, not certainty, because he had not memorized it well. This alone is sufficient to drop the argumentation by this number, so how about when it is coupled with his contradiction of someone who has better memory than him as in the first aspect? This is supported by the following aspect: Third: That Muhammad bin Yusuf is the nephew of Al-Sa'ib bin Yazid - as mentioned just now - so due to his kinship to Al-Sa'ib, he is more knowledgeable of his narration than others and has better memory. So what he narrated regarding the number is prioritized over what his opponent Ibn Khasifah narrated. It is supported by the fact that it agrees with what Aisha narrated in her aforementioned Hadith that the Prophet (peace be upon him) did not exceed eleven rak'ahs. Interpreting the action of Umar (may Allah be pleased with him) as agreeing with his Sunnah (peace be upon him) is better and more appropriate than interpreting it as contradicting it. This is clear and not hidden, God willing. [59]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 37
  },
  {
    "serial_number": "4629813",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 60,
    "volume_number": 1,
    "text": "And similar to this narration in weakness is what Ibn Abd al-Barr mentioned. He said: Al-Harith bin Abdur-Rahman Ibn Abi Dhubab narrated from Al-Sa'ib bin Yazid saying: The standing (prayer) in the time of Umar was twenty-three rak'ahs. I say: This chain is weak because Ibn Abi Dhubab has weakness due to his memory. Ibn Abi Hatim said in \"Al-Jarh wat-Ta'dil\" (1/2/80): \"My father said: Al-Darawardi narrates denounced (Munkar) hadiths from him, and he is not that strong that his hadith is written. And Abu Zur'ah said: There is no harm in him.\" I say: For this reason, Malik did not rely on him as in \"Al-Tahdhib\" by Al-Hafiz Ibn Hajar. And he said in \"Al-Taqrib\": \"Truthful but hallucinates (Yahim).\" I say: So the likes of him, his narration is not used as proof due to the fear of his hallucination, especially when contradicting the Firm Trustworthy one, namely Muhammad bin Yusuf the nephew of Al-Sa'ib, for he said: \"Eleven rak'ahs\" as previously mentioned. Furthermore, we do not know if the chain to him regarding that is authentic, for Ibn Abd al-Barr's book is not within our reach to refer to it and look into the rest of his chain if he cited it. [60]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 38
  },
  {
    "serial_number": "4629814",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 61,
    "volume_number": 1,
    "text": "And similar to this narration in weakness is the narration of Yazid bin Ruman who said: The people used to stand in the time of Umar bin Al-Khattab in Ramadan with twenty-three rak'ahs. Narrated by Malik, and from him Al-Faryabi, and likewise Al-Bayhaqi in Al-Sunan. And in it, he weakened it by his saying: Yazid bin Ruman did not meet Umar. [61]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 39
  },
  {
    "serial_number": "4629815",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 63,
    "volume_number": 1,
    "text": "Al-Nawawi also weakened it in \"Al-Majmu'\" saying (4/33): Narrated by Al-Bayhaqi but it is Mursal (hurried/disconnected) for Yazid bin Ruman did not meet Umar. Al-Ayni also weakened it by his saying in \"Umdat Al-Qari Sharh Sahih Al-Bukhari\" (5/357): \"Its chain is disconnected.\" So this narration is weak due to the disconnection between Ibn Ruman and Umar, so there is no proof in it, especially since it contradicts the authentic narration from Umar regarding his command for eleven rak'ahs. And this is also disconnected. The scholar Al-Mubarakpuri said in \"Al-Tuhfah\" (2/85): Al-Nimawi said in \"Athar Al-Sunan\": \"Its narrators are trustworthy but Yahya bin Sa'id Al-Ansari did not meet Umar.\" End quote. I say: The matter is as Al-Nimawi said. So this report is disconnected and not suitable for argumentation. Along with this, it contradicts what is proven with an authentic chain from Umar (may Allah be pleased with him) that he commanded Ubayy bin Ka'b and Tamim Al-Dari to lead the people in eleven rak'ahs. Malik extracted it in \"Al-Muwatta\" and it has preceded. It also contradicts what is proven from the Messenger of Allah (peace be upon him) in the authentic Hadith. [63]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 40
  },
  {
    "serial_number": "4629816",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 65,
    "volume_number": 1,
    "text": "Imam Shafi'i and Tirmidhi weakening the number twenty from Umar. This: Al-Tirmidhi indicated in his Sunan (2/74) the lack of proof for the number twenty from Umar and others among the Companions, saying: It was narrated (Ruwiya) from Ali, Umar and others among the companions of the Prophet (peace be upon him). Likewise, Al-Shafi'i said regarding the twenty from Umar, as his companion Al-Muzani quoted from him in his Mukhtasar (1/107). Their saying: \"It was narrated\" (Ruwiya) is a weakening from them of what is narrated, as is known among the Hadith scholars. For it is assumed that Imam Shafi'i and Tirmidhi are among those verifying scholars whom Al-Nawawi (may Allah have mercy on him) meant by his saying in \"Al-Majmu'\" (1/63): The verifying scholars from the people of Hadith and others said if the Hadith is weak, one does not say regarding it: 'The Messenger of Allah (peace be upon him) said or did or commanded or forbade or judged' and similar absolute forms. And likewise, one does not say regarding it: 'Abu Huraira narrated or said or mentioned or informed or narrated or conveyed or gave fatwa' and similar. And likewise, this is not said regarding the Tabi'in and those after them regarding what is weak. So nothing of that is said in the definitive form. Rather, it is said in all of this [64]: 'It was narrated from him' or 'it was transmitted from him' or 'it was told about him' or 'it reached us from him' or 'it is said' or 'it is mentioned' or 'it is told' or 'it is narrated' or 'it is raised' or 'it is attributed' and similar forms of uncertainty (Tamridh), not forms of certainty (Jazm). They said: For the form of certainty is designated for the Authentic (Sahih) or Good (Hasan), and forms of uncertainty for what is other than them. That is because the form of certainty implies its authenticity from the one it is attributed to, so it should not be used except in what is authentic, otherwise the person would be in the sense of lying against him. This etiquette was violated by the author and the majority of jurists from our companions and others, indeed the majority of scholars of sciences absolutely, except the skilled Hadith scholars. That is shameful leniency, for they often say regarding the Authentic: 'It was narrated from him' and regarding the weak 'He said' and 'So-and-so narrated', and this is deviating from the correct way.\" These narrations do not strengthen each other: Some might say: We accepted the weakness of the individual narrations, but doesn't their multiplicity strengthen one another? I say: No, and that is for two reasons: First: That this multiplicity is likely formal and not real, for we only have the defective narration of Al-Sa'ib bin Yazid and the disconnected narration of Yazid bin Ruman and Yahya bin Sa'id Al-Ansari. It is possible that the pivot of this narration is upon some of those who narrated the first narration, and other possibilities exist as will come. With probability, deduction falls. [65]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 41
  },
  {
    "serial_number": "4629817",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 66,
    "volume_number": 1,
    "text": "The second: That we established previously that Malik's narration from Muhammad bin Yusuf, the Firm Trustworthy one, from Al-Sa'ib regarding eleven rak'ahs is the correct one, and that whoever opposed Malik has erred. Likewise, whoever opposed Muhammad bin Yusuf, namely Ibn Khasifah and Ibn Abi Dhubab, their narration is anomalous (Shadh). It is established in the science of terminology that the Anomalous is Denounced (Munkar) and Rejected (Mardud) because it is an error, and an error is not strengthened by it. Ibn Al-Salah said in \"Al-Muqaddimah\" (p. 86): If a narrator is solitary in something, it is looked into. If what he is solitary in contradicts what is narrated by someone who is more worthy than him in memory for that and more precise, then what he is solitary in is Anomalous and Rejected. And if there is no contradiction in it to what others narrated, but it is a matter he narrated and others did not... if he is just, a hafiz, trusted for his precision and exactness, what he is solitary in is accepted. There is no doubt that this narration is of the first type because its narrator contradicts what is narrated by someone more worthy than him in memory for that and more precise, so it is rejected. It is clear that the reason scholars reject the Anomalous is the appearance of its error due to the mentioned contradiction. And what is proven to be an error, it is inconceivable that it strengthens another narration with its meaning. So it is proven that the Anomalous and the Denounced are not relied upon nor cited as witness; rather, their existence and non-existence are equal. [66]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 42
  },
  {
    "serial_number": "4629818",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 67,
    "volume_number": 1,
    "text": "Then the narration of Yazid bin Ruman and Yahya bin Sa'id Al-Ansari, which are disconnected, it cannot be said that one of them strengthens the other because the condition for that is that the Sheikhs of each of those who sent it (Mursal) are different from the Sheikhs of the other. This is not proven here because both narrators, Yazid and Ibn Sa'id, are Medinan. So what is most likely in this case is that they shared the narration from some Sheikhs. Based on this, it is possible that their Sheikh from whom they received this narration is a single Sheikh, and this [Sheikh] might be unknown or weak and not used as proof. It is also possible that they received it from two different Sheikhs but they are weak and not considered. It is also possible that these two Sheikhs are Ibn Khasifah and Ibn Abi Dhubab, for they are also Medinan and have erred in this narration as previously mentioned. Based on this, the narration of Yazid and Ibn Sa'id would also be an error. All of this is possible and probable, and with probability, deduction falls. Sheikh al-Islam Ibn Taymiyyah (may Allah have mercy on him) said: [67]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 43
  },
  {
    "serial_number": "4629819",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 68,
    "volume_number": 1,
    "text": "\"And Mursal reports, people have disputed regarding their acceptance and rejection. The most correct of sayings is that some are accepted, some are rejected, and some are suspended... And whatever of Mursal reports contradicts what trustworthy narrators narrated is rejected. If the Mursal comes from two routes where each of the narrators took knowledge from different Sheikhs than the other, this is something that indicates its truthfulness, for the like of that, identical error is not inconceivable in custom...\" Negligence of this condition led some senior scholars to authenticate some stories that are obviously false, such as the famous story of the Cranes (Gharaniq), as I explained in my previous book \"Nasb Al-Majaniq Li-Nasf Qissat Al-Gharaniq\". So let this be noted for it is very important. What I mentioned here regarding these narrations from Umar can be said similarly regarding the narrations coming from Ali and others in Chapter Five. Added to it is that some of them are very weak, like the second route from Ali, so it is not fit to strengthen the first route. Remember this, for it will benefit you, God willing. [68]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 44
  },
  {
    "serial_number": "4629820",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 69,
    "volume_number": 1,
    "text": "The correct reconciliation between the two narrations from Umar: If it becomes clear to the reader the weakness of this narration from Umar, then there is no necessity to reconcile between it and the authentic narration from him as some have done—saying: \"They used to stand in the beginning with eleven rak'ahs then they used to stand with twenty and pray Witr with three.\" For we say that reconciliation is a branch of authentication, and these narrations are not authentic, so there is no need for the mentioned reconciliation. Furthermore, this reconciliation can be opposed. Al-Mubarakpuri (may Allah have mercy on him) said (2/76) following the mentioned reconciliation: I say: regarding it is that one could say: They used to stand firstly with twenty rak'ahs then they used to stand with eleven rak'ahs. This is what is apparent because this was in agreement with what is established from the Messenger of Allah (peace be upon him) and that was contrary to it. So reflect. The twenty—if authentic—was only for a reason which has ceased. Furthermore, even if we assume that someone was not convinced by the previous explanation regarding the weakness of the number twenty from Umar—we say that it does not necessitate adhering to practicing this number such that practicing what is established in the Sunnah from him (peace be upon him) is abandoned [69]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 45
  },
  {
    "serial_number": "4629821",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 70,
    "volume_number": 1,
    "text": "from the eleven rak'ahs, let alone that the one acting upon this Sunnah is considered to be outside the consensus. That is because adherence is something additional to the action in a case like ours. For Umar's action of twenty only indicates its permissibility, and does not imply more than that, because it is contrasted with the action of the Prophet (peace be upon him) which contradicts it in terms of number. It is not permissible in this case to disregard his action (peace be upon him) and turn away from it by adhering to what Umar (may Allah be pleased with him) did only. Rather, the most that can be derived from it is the permissibility of following him in that, with the certainty and decisiveness that following his action (peace be upon him) is better. This is something no rational person should doubt. This is all said if we assume that Umar increased the prescribed number based on the argument that increase is unrestricted—as some claim and was previously refuted. But since Umar did not come with it from this angle, but rather due to the reason of lightening for the people from the long standing which he (peace be upon him) used to perform with the people in Tarawih prayer, as the noble reader has seen in the Hadiths we cited in Chapter One—for more than one scholar mentioned that doubling the number was compensation for the long standing. I say: This doubling along with lightening the recitation in standing—had Umar (may Allah be pleased with him) done it—would have had what [70]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 46
  },
  {
    "serial_number": "4629822",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 71,
    "volume_number": 1,
    "text": "might justify it in that era because with that, they would not finish the Tarawih prayer in Umar's time except at Fajr as previously mentioned. And with this alleged lightening, their Imam used to read between twenty and thirty verses in a single rak'ah. Added to that, they used to equalize between the pillars of standing, bowing, and prostrating and what is between them, lengthening them until they were close to each other, and increasing in them Tasbih, Tahmid, Dua, and Dhikr as is the Sunnah in all of that. But as for today, there is nothing of this long recitation to be lightened and compensated for by increasing rak'ahs. For most Imams of mosques lighten the recitation in this prayer—as is observed—to a degree that if they were told 'lighten the recitation', they would find no way to do so except to abandon recitation entirely after Al-Fatiha or restrict themselves—in the best cases—to the likes of the verse {Mudhammatan} [Dark green (gardens)]. I have heard that some of them have done that. And this Al-Fatiha which they read, they have removed its beauty and sweetness due to the intense speed with which they read it, to the point that many of them finish it [71]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 47
  },
  {
    "serial_number": "4629823",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 72,
    "volume_number": 1,
    "text": "in one breath contrary to the Sunnah which states that he (peace be upon him) used to read it verse by verse. Even if there are found among those Imams some who lengthen the recitation somewhat, they have all agreed on turning away from equalizing the pillars and making them approximate, even though the Sunnah of that is established in many Hadiths, including the Hadith of Hudhayfah bin Al-Yaman previously mentioned. I say: This reality which most Muslims are upon today—as far as I know—makes the cause for which the Tarawih rak'ahs were increased disappear. And with its disappearance, the effect, which is the number twenty, disappears. Therefore, it is obligatory—from this perspective as well—to return to the number reported in the authentic Sunnah and adhere to it and not add to it, while encouraging people to lengthen the recitation and the remembrances of the pillars in it as much as possible, following the example of the Prophet (peace be upon him) and the righteous predecessors (may Allah be pleased with them). I believe that this reality will compel whomever Allah wills among the reformist thinkers to adopt the opinion of the necessity of returning in Tarawih prayer to [72]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 48
  },
  {
    "serial_number": "4629824",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 73,
    "volume_number": 1,
    "text": "his Sunnah (peace be upon him) in quantity and quality. They have done the like in another issue which is more important than this in terms of its results and impact on society and in the obviousness of its contradiction to Umar (may Allah be pleased with him), namely considering the divorce issued by a man with the word 'three' as one divorce. Until recently, they used to consider it three (she is not lawful to him afterwards until she marries another husband). Their support in that was the consensus of the books of the four Madhhabs on it following the opinion of Umar (may Allah be pleased with him) on it, despite his knowledge that the Prophet (peace be upon him) used to make it one divorce. So behold them today abandoning this opinion of Umar despite it being proven from him, when they saw that this opinion has returned upon people in this era contrary to what Umar (may Allah be pleased with him) intended of reform. So they returned to the Sunnah because it became clear to them—after effort—that the desired reform is not achieved except by it. Among the wonders is that many of them used to, until recently, be extremely hostile to Ibn Taymiyyah (may Allah have mercy on him) and attack him severely for issuing fatwa with this Sunnah and abandoning the opinion of Umar and his Ijtihad which contradicted it, and attributing him [73]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 49
  },
  {
    "serial_number": "4629825",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 74,
    "volume_number": 1,
    "text": "due to that to leaving the consensus (Jama'ah). So behold them today judging with what they used to declare disbelief for yesterday. That is because they do not know returning to the Sunnah and acting upon it because it is legally obligatory; rather, they return to it under the influence of events and experiences and consideration of interests. Perhaps they will adopt returning to his Sunnah (peace be upon him) in Tarawih prayer due to the Quranic text, for Allah Blessed and Exalted says regarding His Prophet (peace be upon him) and his Sunnahs: {But no, by your Lord, they will not [truly] believe until they make you, [O Muhammad], judge concerning that over which they dispute among themselves and then find within themselves no discomfort from what you have judged and submit in [full, willing] submission} and He says: {There has come to you from Allah a light and a clear Book. By which Allah guides those who pursue His pleasure to the ways of peace and brings them out from darknesses into the light, by His permission, and guides them to a straight path.} [74]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 50
  },
  {
    "serial_number": "4629826",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 76,
    "volume_number": 1,
    "text": "5 - It is not proven that any of the Companions prayed it as twenty: Verification of the traditions reported from them regarding that and explanation of their weakness. There are other narrations from other than Umar among the Companions (may Allah be pleased with him) stating that they used to pray twenty. Since all of them do not stand up to correct scientific criticism and many have been deceived by them, it was necessary to explain their weakness so that the believer is clear about their matter. I say: - 1 - From Ali (may Allah be pleased with him), and there are two routes from him: First: From Abu Al-Hasna that Ali commanded a man to lead them in prayer in Ramadan with twenty rak'ahs. Narrated by Ibn Abi Shaybah and Al-Bayhaqi, who said: \"And in this chain is weakness.\" I say: Its defect is this Abu Al-Hasna. Al-Dhahabi said: \"He is not known.\" And Al-Hafiz said: \"Unknown (Majhul).\" I say: I fear that there is another defect in it, which is the missing links (I'dal) between Abu Al-Hasna and Ali. For Al-Hafiz said in his biography in \"Al-Tahdhib\": He narrated from Al-Hakam bin Utaybah from Hanash from Ali regarding the sacrifice. I say: So between him and Ali are two people. And Allah knows best. [76]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 51
  },
  {
    "serial_number": "4629827",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 77,
    "volume_number": 1,
    "text": "The second: From Hammad bin Shu'ayb from Ata bin Al-Sa'ib from Abu Abdur-Rahman Al-Sulami from Ali (may Allah be pleased with him) who said: He (meaning Ali, may Allah be pleased with him) called the readers in Ramadan and commanded one of them to lead the people in twenty rak'ahs. He said: And Ali (may Allah be pleased with him) used to lead them in Witr. Narrated by Al-Bayhaqi (2/496). Its chain is weak containing two defects: First: Ata bin Al-Sa'ib, for he had become confused. Second: Hammad bin Shu'ayb, for he is very weak as Al-Bukhari indicated by his saying: \"There is an issue with him (Fihi Nazar)\" and he said once: \"Munkar al-Hadith\" (Denounced in Hadith), for he only says this about someone from whom narration is not permissible, as scholars have noted. So he is not cited as witness nor is he fit for consideration. I say: Muhammad bin Fudayl opposed him, narrating it in Ibn Abi Shaybah from him from Ata bin Al-Sa'ib with it in abbreviated form with the wording \"From Ali that he stood with them in Ramadan [77]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 52
  },
  {
    "serial_number": "4629828",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 78,
    "volume_number": 1,
    "text": "there is no number in it absolutely. This indicates the weakness of Ibn Shu'ayb here because Muhammad bin Fudayl is trustworthy and did not narrate what Ibn Shu'ayb narrated, so his narration is denounced (Munkar) according to the rules of the science of Hadith. - 2 - From Ubayy bin Ka'b, and there are two routes from him as well: First: [Ubayy bin Ka'b used to lead the people in Ramadan in Medina with twenty rak'ahs and pray Witr with three. Narrated by Ibn Abi Shaybah in Al-Musannaf with an authentic chain to Abdul Aziz bin Rufay', but it is disconnected (Munqati') between this Abdul Aziz and Ubayy, for between their deaths is about a hundred years or more. That is why the scholar Al-Nimawi Al-Hindi said: Abdul Aziz bin Rufay' did not meet Ubayy bin Ka'b. Al-Mubarakpuri quoted it and then commented on it saying (2/75): The matter is as Al-Nimawi said. So this report of Ubayy bin Ka'b is disconnected. Along with this, it contradicts what is proven from Umar (may Allah be pleased with him) that he commanded Ubayy bin Ka'b and Tamim Al-Dari to lead the people in eleven rak'ahs. It also contradicts what is proven from Ubayy bin Ka'b that he prayed in Ramadan with women in his house eight rak'ahs and prayed Witr, as previously mentioned in full. [78]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 53
  },
  {
    "serial_number": "4629829",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 79,
    "volume_number": 1,
    "text": "I say: He refers to what he mentioned a page ago, which is: And indicating this is the last saying chosen by Malik, meaning eleven rak'ahs, is what Abu Ya'la narrated from the Hadith of Jabir bin Abdullah who said: Ubayy bin Ka'b came to the Messenger of Allah (peace be upon him) and said: O Messenger of Allah, something happened from me tonight - meaning in Ramadan. He said: And what is that, O Ubayy? He said: Women in my house said: We do not read the Quran, so we pray with your prayer? He said: So I prayed with them eight rak'ahs and prayed Witr. So it was the Sunnah of approval (Ridha) and he did not say anything. Al-Haythami said in 'Majma' Al-Zawa'id': \"Its chain is good (Hasan).\" The Second Route: Narrated by Al-Diya' Al-Maqdisi in \"Al-Mukhtarah\" (1/384) from Abu Ja'far Al-Razi from Al-Rabi' bin Anas from Abu Al-Aliyah from Ubayy bin Ka'b that Umar commanded Ubayy to lead the people in prayer in Ramadan. He said: Indeed people fast the day and do not do well in reading, so if you read the Quran to them at night. He said: O Commander of the Faithful, this is something that has not happened. He said: I know, but it is better. So he prayed with them twenty rak'ahs. I say: This chain is weak. This Abu Ja'far, whose name is Isa bin Abi Isa bin Mahan, Al-Dhahabi listed him in \"Al-Du'afa\" (The Weak Narrators) and said: [79]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 54
  },
  {
    "serial_number": "4629830",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 80,
    "volume_number": 1,
    "text": "\"Abu Zur'ah said: He makes many mistakes. And Ahmad said: He is not strong. And he said once: Salih al-Hadith (acceptable in Hadith). And Al-Fallas said: Bad memory. And another said: Trustworthy.\" Then Al-Dhahabi repeated him in \"Al-Kuna\" and said: They all disparaged him. Al-Hafiz decided in \"Al-Taqrib\" that he is \"Bad memory.\" Ibn Al-Qayyim said in \"Zad Al-Ma'ad\" (1/99): \"O owner of denounced reports (Manakir), what any of the people of Hadith are solitary in narrating is not used as proof at all.\" I say: This is not doubted by the researcher tracking his hadiths, for he frequently contradicts the narrations of the trustworthy. Among that is this Hadith, for it has preceded with the authentic chain from Umar that he commanded Ubayy to lead the people in eleven rak'ahs. It is inconceivable that Ubayy would disobey the command of the Commander of the Faithful, especially when it agrees with the Sunnah of the Master of Messengers (peace be upon him) in action and approval for Ubayy, as previously explained. [80]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 55
  },
  {
    "serial_number": "4629831",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 81,
    "volume_number": 1,
    "text": "And in it is another contradiction, which is his saying: \"This is something that has not happened.\" It is far-fetched that Ubayy would say it and Umar (may Allah be pleased with them both) would agree with him, when this gathering had occurred in his time (peace be upon him) as previously explained by authentic Hadiths in Chapter One. It is assumed that they witnessed or at least knew that, being who they are in knowledge. In summary, this narration from Ubayy is denounced (Munkar) and no proof is established by it. - 3 - From Abdullah bin Mas'ud: Ibn Nasr narrated in Qiyam Al-Layl from Zaid bin Wahb: Abdullah bin Mas'ud (may Allah be pleased with him) used to lead us in prayer in the month of Ramadan and would leave with some night remaining. Al-A'mash said: He used to pray twenty rak'ahs and pray Witr with three. Al-Mubarakpuri said in \"Al-Tuhfah\": This is also disconnected, for Al-A'mash did not meet Ibn Mas'ud. [81]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 56
  },
  {
    "serial_number": "4629832",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 82,
    "volume_number": 1,
    "text": "I say: It is as he said, rather it may be problematic (Mu'dal) [missing two or more consecutive reporters], for Al-A'mash usually narrates from Ibn Mas'ud through two men, as is not hidden from the one tracking the Musnad of Ibn Mas'ud. Furthermore, we do not know if the chain to Al-A'mash is authentic regarding that, because the abbreviator of the book, Sheikh Al-Maqrizi, deleted the chain. Would that he had not done so, for by that he caused us to lose knowledge of the grade of many of the book's hadiths. The assumption is that it is not authentic to Al-A'mash, for Al-Tabarani narrated this report from the route of Zaid bin Wahb mentioned, as in \"Al-Majma'\" (3/172), and did not mention this saying of Al-A'mash. Perhaps in the path to him is a weak narrator due to bad memory or otherwise. And Allah knows best. This is all we found of the reports narrated from the Companions (may Allah be pleased with them) regarding the increase over what is proven in the Sunnah in the number of Tarawih rak'ahs, and they are all weak; nothing of them is proven. Al-Tirmidhi indicated their weakening as previously mentioned. I think the noble reader will not see them collected in a book with this tracking of routes and precise scientific verification. So praise be to Allah by whose grace good deeds are completed. [82]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 57
  },
  {
    "serial_number": "4629833",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 84,
    "volume_number": 1,
    "text": "No consensus on the twenty: It has become clear to us from the previous verification that everything narrated from the Companions that they prayed Tarawih as twenty rak'ahs, nothing of it is proven. So what some claimed: \"That the Companions agreed by consensus that Tarawih is twenty rak'ahs\" is something not to be relied upon because it is built upon weak [evidence], and what is built upon weak is weak. Therefore, the scholar Al-Mubarakpuri asserted in \"Al-Tuhfah\" that \"It is a false claim.\" This is supported by the fact that if it were authentic, it would not be permissible for those after them to oppose them, yet they differed on less than this number and more than it, as will come shortly. Claiming such a consensus prompts verifiers not to hasten in accepting every consensus mentioned in some books, for it has been proven by tracking that much of what is mentioned in them is not correct. Among the examples also is the consensus reported by some that Witr is three rak'ahs, although it is proven from more than one of the Companions offering Witr with one rak'ah only, as will come before Chapter Seven. That is why the verifier Siddiq Hasan Khan said in the introduction of his book \"Al-Siraj Al-Wahhaj min Kashf Matalib Sahih Muslim bin Al-Hajjaj\" (1/3): [84]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 58
  },
  {
    "serial_number": "4629834",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 84,
    "volume_number": 1,
    "text": "\"And extreme leniency has occurred in transmitting consensuses, and it has become that whoever has no share [reading 'nasib' instead of 'yajib'] of the schools of the people of knowledge thinks that what the people of his Madhhab or the people of his region agreed upon is a consensus. This is a great corruption. This transmitter comes with a mere claim regarding what is widely afflictive, oblivious to the necessity of the great danger upon the servants of Allah Almighty from this transmission which was not by way of verification and piety. As for the people of the four Madhhabs, they have come to count what they agreed upon among themselves as agreed upon by consensus (Ijma'), especially the later ones among them in era, like Al-Nawawi in his explanation of Muslim, and whoever did as he did. This is not the consensus whose authority scholars spoke of. For the best generations are [the first century], then those who follow them, then those who follow them. They were before the appearance of the Madhhabs. Then in the era of every one of the four Imams there were among the great people of knowledge capable of Ijtihad those who cannot be counted. And so it continued after their era to this end. This is known by every fair knower, but fairness is a difficult obstacle not crossed except by one for whom Allah Almighty has opened the doors of truth and made entering them easy for him. The scholar Al-Shawkani said in \"Wabl Al-Ghamam Hashiyat Shifa' Al-Awam\": The consensuses they recount in books are only based on the fact that the narrator did not know of the occurrence of disagreement in the issue. Lack of knowledge of occurrence does not necessitate non-existence. The most that is there is that he obtained a supposition of consensus, and the mere supposition of an individual is not suitable to be a support [84]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 58
  },
  {
    "serial_number": "4629835",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 85,
    "volume_number": 1,
    "text": "for consensus, nor a way among its ways. And whoever says consensus is a proof does not say [this type] is a proof; it is merely the supposition of an individual of the nation, and Allah did not burden any of His creation with the like of that. For if the informed one said: 'I do not know in this issue a proof from the Sunnah or a proof from the Quran,' no rational person, let alone a scholar, would say that this statement is a proof. If this is established, the matter becomes easy for you when hearing the recounting of consensus, because it is not the consensus regarding which the nation differed whether it is a proof or not. Furthermore, the majority of the people of Usul (Principles of Jurisprudence) held that isolated reports (Akhbar al-Ahad) are not accepted in consensus, as stated by Al-Qadi in \"Al-Taqrib\" and Al-Ghazali in his books, to the end of what he said. I have cited the arguments of this issue in my book \"Husul Al-Ma'mul min 'Ilm Al-Usul\" and the two righteous sons cited them in \"Al-Iqlid\" and \"Al-Tariqah Al-Muthla\". So whoever desires the relief of his mind should refer to them and to \"Dalil Al-Talib\" and others of our works. [85]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 59
  },
  {
    "serial_number": "4629836",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 86,
    "volume_number": 1,
    "text": "I say: And likewise Imam Abu Muhammad Ibn Hazm verified the saying on this issue in his valuable book \"Al-Ihkam fi Usul Al-Ahkam\", which is printed in Egypt in eight parts. So let whoever wishes to verify the consensuses which some people speak of refer to it, for it is one of the best books of Usul supported by evidence from the Book and Sunnah, unlike others which are built on mere claim. - 6 - The obligation of adhering to eleven rak'ahs and the evidence for that: It has become clear to every rational person that praying Tarawih as twenty rak'ahs is not authentic from any of the Companions, and that the command to pray it as eleven rak'ahs is proven from Umar (may Allah be pleased with him), just as it is clarified that he (peace be upon him) did not pray it except as eleven rak'ahs. All of this paves the way for us to say the obligation of adhering to this number and not adding to it, following his saying (peace be upon him): \"...For whoever among you lives after me will see much difference. So adhere to my Sunnah and the Sunnah of the Rightly-Guided Caliphs. Cling to it and bite onto it with your molars. And beware of newly invented matters, for every newly invented matter is an innovation, and every innovation is misguidance.\" He added in another Hadith: \"And every misguidance is in the Fire.\" [86]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 60
  },
  {
    "serial_number": "4629837",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 87,
    "volume_number": 1,
    "text": "Narrated by Ahmad, Abu Dawud, Al-Tirmidhi and others. It is known that scholars differed on many jurisprudential issues, including what we are discussing regarding the number of Tarawih rak'ahs. Their difference in it reached eight opinions: First (41). Second (36). Third (34). Fourth (28). Fifth (24). Sixth (20). Seventh (16). Eighth (11). [87]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 61
  },
  {
    "serial_number": "4629838",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 88,
    "volume_number": 1,
    "text": "And since the mentioned Hadith has clarified for us the exit from every disagreement the nation might fall into, and this issue is among what they differed in, it became obligatory upon us to return to the exit, which is adhering to his Sunnah (peace be upon him). And it is nothing here but eleven rak'ahs. So it is obligatory to take it and leave what opposes it, especially since the Sunnah of the Rightly-Guided Caliphs agreed with it. We see that adding to it contradicts it, because the matter in acts of worship is based on restriction (tawqif) and following, not on rational approbation and innovation, as previously explained in the first treatise, and the elaboration of that will come in the treatise dedicated to Innovation (Bid'ah), God willing. It is strange that the common people have become aware of this, for you often hear them saying on this occasion and others: \"The one who adds is the brother of the one who subtracts.\" So what about the elite? I am pleased on this occasion with what Ibn Abi Shaybah narrated in Al-Musannaf from Mujahid who said: A man came to Ibn Abbas and said: I and a companion of mine were on a journey, so I completed [the prayer] and my companion shortened it. Ibn Abbas said to him: \"Rather, you are the one who shortened [the reward/Sunnah], and your companion is the one who completed.\" [88]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 62
  },
  {
    "serial_number": "4629839",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 89,
    "volume_number": 1,
    "text": "This is from the understanding (Fiqh) of Ibn Abbas, may Allah be pleased with him, as he placed completeness and perfection in following the Sunnah of the Prophet, peace and blessings be upon him, and placed deficiency and defect in opposing it, even if the number was greater. How could he not, when the Messenger of Allah, peace and blessings be upon him, prayed for him saying: \"O Allah, grant him understanding in the religion and teach him interpretation\"? The truth is that whoever is truly a Faqih (jurist) cannot surpass this saying of Ibn Abbas; rather, he makes it a fundamental principle in everything the perfect Sharia brought, because the opposite implies attributing deficiency or forgetfulness to the Wise Lawgiver. {And your Lord was never forgetful}. There is another place to detail this, Allah willing. I also admire the saying of Sheikh al-Islam Ibn Taymiyyah in his refutation of Ibn al-Mutahhar al-Shi'i: \"He claimed that Ali used to pray one thousand Rak'ahs in a day and night, but this is not authentic. Our Prophet, peace and blessings be upon him, did not exceed thirteen Rak'ahs at night, and praying the entire night is not recommended, rather it is disliked. The Prophet, peace and blessings be upon him, said to Abdullah bin Amr [bin al-Aas]: 'Verily, your body has a right over you.' The Prophet, peace be upon him, used to pray about forty Rak'ahs in a day and night. Ali was more knowledgeable of his Sunnah and more following of his guidance than to oppose him with such opposition, were that even possible. How so, when praying one thousand Rak'ahs while performing all other duties is not possible, as he has rights owed to himself regarding his interests, sleep, food, drink, needs, ablution, intimacy with his wives and concubines, and looking after his children, family, and subjects, which [89]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 63
  },
  {
    "serial_number": "4629840",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 90,
    "volume_number": 1,
    "text": "takes up almost half the time. So, a single hour cannot accommodate eighty Rak'ahs unless it is with Al-Fatiha only and without tranquility (Tuma'ninah). Ali, may Allah honor his face, is too noble to pray the prayer of the hypocrites, which is pecking, and remembering Allah only a little, as mentioned in the two Sahihs.\" From \"Al-Muntaqa min Minhaj al-I'tidal\" (p. 169-170). So reflect on how he exonerated Ali, may Allah be pleased with him, from exceeding the Sunnahs of the Prophet, peace and blessings be upon him, by saying: \"Ali was more knowledgeable of his Sunnah and more following of his guidance than to oppose him with such opposition.\" Mention of the Scholars Who Denied the Increase: Therefore, we say: If an increase over eleven Rak'ahs in the night prayer (Qiyam) were proven from any of the Righteous Caliphs or other jurists among the Companions, we would have no choice but to accept its permissibility, due to our knowledge of their virtue, understanding, distance from innovation in religion, and their eagerness to forbid people from it. However, since that is not proven from them as previously explained, we did not deem it permissible to advocate for the increase. Our predecessors in this are prominent Imams, foremost among them Imam Malik in one of the two opinions narrated from him. Al-Suyuti said in \"Al-Masabih fi Salat al-Tarawih\" (2/77 of his Fatawa): [90]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 64
  },
  {
    "serial_number": "4629841",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 91,
    "volume_number": 1,
    "text": "\"Al-Juri - one of our associates - said regarding Malik that he said: 'What Umar bin Al-Khattab gathered the people upon is more beloved to me, which is eleven Rak'ahs, and that is the prayer of the Messenger of Allah, peace and blessings be upon him.' He was asked: 'Eleven Rak'ahs including Witr?' He said: 'Yes, and thirteen is close.' He said: 'And I do not know from where this excessive bowing was introduced?'\" [91]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 65
  },
  {
    "serial_number": "4629842",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 92,
    "volume_number": 1,
    "text": "Imam Ibn al-Arabi said in \"Sharh al-Tirmidhi,\" after pointing out the conflicting narrations from Umar and the view that there is no limited limit to the number of Rak'ahs in Tarawih: \"The correct view: is to pray eleven Rak'ahs: the prayer of the Prophet, peace be upon him, and his Qiyam. As for other numbers, they have no basis and no limit. If a limit is necessary, then it is what the Prophet, peace be upon him, used to pray. The Prophet, peace be upon him, did not increase beyond eleven Rak'ahs in Ramadan or in other than it. This prayer is the Night Prayer (Qiyam al-Layl), so it is obligatory to follow the Prophet, peace be upon him, in it.\" For this reason, Imam Muhammad bin Ismail al-San'ani explicitly stated in \"Subul al-Salam\" that the number of twenty in Tarawih is an innovation (Bid'ah). He said: \"There is nothing praiseworthy in innovation; rather, every innovation is misguidance.\" [92]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 66
  },
  {
    "serial_number": "4629843",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 93,
    "volume_number": 1,
    "text": "I say: The explanation of this point will come in the specific treatise on Bid'ah, Allah willing. It suffices us now to remind the readers of the saying of the great Companion Abdullah bin Umar bin Al-Khattab, may Allah be pleased with them both: \"Every innovation is misguidance, even if people see it as good,\" so that they may be aware of the matter of those who claim to support the Companions while they are, in reality, at the forefront of those who oppose them in what they forbade. Then, they are not content with that until they accuse the callers to the practice of the Sunnah of opposing them [the Companions], while they [the callers] are in fact the most adherent to them when the chain of narration from them is authentic, as became clear to the noble reader from the first treatise and from this treatise. Repelling Doubts and Accusations: Furthermore, when we insist strongly on prioritizing this number reported in the Sunnah and turning away from what exceeds it, absolutely nothing of what was attributed to us - which we alluded to in the commentary regarding attacking those who adopted the increase - binds us. This is because we believe that they did not adopt it, nor other opinions, out of following desires, as previously explained in [93]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 67
  },
  {
    "serial_number": "4629844",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 94,
    "volume_number": 1,
    "text": "Page (9 - 11 - 12) of the first treatise. Therefore, we find it strange that it would cross a Muslim's mind that any Muslim would accuse them of innovating in religion - far be it from them! Rather, they are rewarded in every case, as we have clarified repeatedly. How could it be otherwise, when they are the ones who have the credit for guiding us to what is indicated by the Book and the Sunnah, prioritizing them over any opinion that contradicts them? Here is Imam Al-Shafi'i, may Allah be pleased with him, saying: \"Muslims have agreed that whoever a Sunnah of the Messenger of Allah, peace and blessings be upon him, becomes clear to, it is not lawful for him to leave it for the saying of anyone.\" Similarly, what some might imagine - that disagreeing with some Imams means the dissenter claims superiority over them in knowledge and understanding - does not bind us. No! This is a false delusion. We know by necessity that the four Imams are more knowledgeable than their students and those below them. Yet, they [the students] disagreed with them in many of their opinions, and the matter continues as such: the later scholar disagrees with the earlier one as long as verified scholars remain among Muslims. Despite this, their disagreement with them did not suggest they claimed superiority over them. So how could that be imagined from the mere disagreement of those who are stages below them? The truth is that our situation with the Imams is as narrated about [94]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 68
  },
  {
    "serial_number": "4629845",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 95,
    "volume_number": 1,
    "text": "Asim bin Yusuf, that it was said to him: \"You frequently disagree with Abu Hanifa?\" He replied: \"Abu Hanifa was given what we were not given, so he reached with his understanding what we did not reach. We were not given of understanding except what we were given, and it is not permissible for us to issue Fatwas based on his saying unless we understand from where he spoke.\" I say this while acknowledging that Allah's mercy is too vast to restrict virtue and knowledge to only the four Imams, and that Allah is capable of creating after them those who are more knowledgeable than them, while also remembering that the lesser may possess what the superior does not. This is a matter known and accepted among scholars. The Prophet, peace and blessings be upon him, said: \"My Ummah is like the rain; it is not known whether the beginning is better or the end.\" Narrated by Al-Tirmidhi who classified it as Hasan, and Al-Uqayli and others. [95]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 69
  },
  {
    "serial_number": "4629846",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 96,
    "volume_number": 1,
    "text": "Permissibility of Praying Less than (11): If someone says: \"If you forbid increasing the number of Rak'ahs reported from the Messenger of Allah, peace and blessings be upon him, in the Night Prayer (Qiyam al-Layl), which includes Tarawih prayer, then forbid performing it with less than that as well, because there is no difference between increasing and decreasing in that both alter the text.\" The Answer: There is no doubt that this would be the case, were it not that permissibility for less than this number came from him, peace and blessings be upon him, through his action and his words. As for the action, Abdullah bin Abi Qays said: I said to Aisha, may Allah be pleased with her: \"With how many did the Messenger of Allah, peace and blessings be upon him, perform Witr?\" She said: \"He used to perform Witr with four and three, six and three, ten and three. He did not perform Witr with less than seven nor with more [96]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 70
  },
  {
    "serial_number": "4629847",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 97,
    "volume_number": 1,
    "text": "than thirteen.\" Narrated by Abu Dawood, Al-Tahawi, and Ahmad with a good chain. As for his saying, peace and blessings be upon him, it is: \"Witr is a right (Haqq), so whoever wishes, let him perform Witr with five; whoever wishes, let him perform Witr with three; and whoever wishes, let him perform Witr with one.\" Narrated by Al-Tahawi, Al-Daraqutni, Al-Hakim, and Al-Bayhaqi. Al-Hakim said: \"Authentic (Sahih) according to the conditions of the two Sheikhs (Bukhari and Muslim),\" and Al-Dhahabi agreed with him, as did Al-Nawawi in Al-Majmu'. This is an explicit text regarding the permissibility of restricting [97]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 71
  },
  {
    "serial_number": "4629848",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 98,
    "volume_number": 1,
    "text": "to one Rak'ah in the Witr prayer, and this was the practice of the Predecessors (Salaf), may Allah be pleased with them. Al-Hafiz said in \"Sharh al-Bukhari\": \"It is authentically reported from a group of the Companions that they performed Witr with one Rak'ah without preceding it with voluntary prayer. In the book of Muhammad bin Nasr and others, with an authentic chain from Al-Sa'ib bin Yazid, that Uthman recited the Quran in a single Rak'ah one night and did not pray other than this. It will come in 'Al-Maghazi' the Hadith of Abdullah bin Tha'labah that Sa'd performed Witr with one Rak'ah. And it will come in 'Al-Manaqib' regarding Muawiyah that he performed Witr with one Rak'ah and that Ibn Abbas approved of it.\" [98]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 72
  },
  {
    "serial_number": "4629849",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 98,
    "volume_number": 1,
    "text": "7 - The Methods by Which the Prophet, Peace and Blessings Be Upon Him, Prayed the Night Prayer and Witr: Know, O Muslim, that the Prophet's night prayer (Qiyam) and Witr were upon many types and methods. Since this is not recorded in most books of Fiqh, whether concise or detailed, and since it is obligatory to explain his Sunnah, peace and blessings be upon him, to the people so that we may pave the way for those among them who love to follow it to act upon it - so that our reward may be written, Allah willing - and so that those ignorant of it may refrain from denying any part of it. May Allah, Blessed and Exalted, grant us success in following him, peace and blessings be upon him, with true following, and avoiding what He warned us against of innovation. Thus, describing that is obligatory, so I say: - 1 - He prays 13 Rak'ahs, opening them with two light Rak'ahs. There are Hadiths regarding this: First: The Hadith of Zaid bin Khalid al-Juhani that he said: [98]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 72
  },
  {
    "serial_number": "4629850",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 99,
    "volume_number": 1,
    "text": "28 - (Sahih) \"Witr is a right, so whoever wishes, let him perform Witr with five; and whoever wishes, let him perform Witr with three; and whoever wishes, let him perform Witr with one.\" Narrated by Al-Tahawi, Al-Daraqutni, Al-Hakim, and Al-Bayhaqi from the Hadith of Abu Ayyub Al-Ansari as Marfu'. Al-Hakim said it is Sahih according to the conditions of the two Sheikhs, and Al-Dhahabi and Al-Nawawi agreed, and Ibn Hibban authenticated it, and it is as they said.] [99]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 73
  },
  {
    "serial_number": "4629851",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 99,
    "volume_number": 1,
    "text": "29 - (Munkar/Rejected) \"Do not perform Witr with three resembling Maghrib, but perform Witr with five, or seven, or nine, or eleven, or more than that.\" From Abu Hurairah as Marfu'. With this addition \"or more than that,\" it is Munkar, and Al-Hakim did not authenticate it despite his leniency, so he was correct.] - 7 The Methods by Which the Prophet, Peace and Blessings Be Upon Him, Prayed the Night Prayer and Witr: Know, O Muslim, that the Prophet's night prayer and Witr were upon many types and methods. Since this is not recorded in most books of Fiqh, whether concise or detailed, and it was obligatory to explain his Sunnah, peace and blessings be upon him, to the people so that we may pave the way for those among them who love to follow it to act upon it - so that our reward may be written, Allah willing - and so that those ignorant of it may refrain from denying any part of it. May Allah, Blessed and Exalted, grant us success in following him, peace and blessings be upon him, with true following, and avoiding what He warned us against of innovation. Thus, describing that has become obligatory, so I say: - 1 - He prays 13 Rak'ahs, opening them with two light Rak'ahs. There are Hadiths regarding this: First: The Hadith of Zaid bin Khalid al-Juhani that he said: \"I will surely watch the prayer of the Messenger of Allah, peace and blessings be upon him, tonight. So he prayed two light Rak'ahs, then he prayed two long, long, long Rak'ahs, then he prayed two Rak'ahs shorter than the previous two, then he prayed two Rak'ahs shorter than the previous two, then he prayed two Rak'ahs shorter than the previous two, then he prayed two Rak'ahs shorter than the previous two, then he performed Witr. That is thirteen Rak'ahs.\" Narrated by Muslim and Abu Awanah in their Sahihs and others. [99]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 73
  },
  {
    "serial_number": "4629852",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 102,
    "volume_number": 1,
    "text": "Second: The Hadith of Ibn Abbas who said: \"I spent the night at the Messenger of Allah's, peace and blessings be upon him, while he was with Maimuna. He slept until a third of the night or half of it had passed, then he woke up. He went to a water skin, performed ablution, and I performed ablution with him. Then he stood up, and I stood at his side on his left. He placed me on his right, then put his hand on my head as if touching my ear, as if waking me. He prayed two light Rak'ahs reciting the Mother of the Book (Al-Fatiha) in each Rak'ah, then gave Tasleem. Then he prayed until he had prayed eleven Rak'ahs including Witr. Then he slept. Bilal came to him and said: 'The prayer, O Messenger of Allah.' So he stood up, prayed two Rak'ahs, then led the people in prayer.\" Narrated by Abu Dawood, and from him Abu Awanah in his Sahih, and its origin is in the \"Two Sahihs.\" Third: The Hadith of Aisha who said: \"When the Messenger of Allah stood at night, he would open his prayer with two light Rak'ahs, then pray eight Rak'ahs, then perform Witr.\" And in a wording: \"He used to pray Isha, then perform two brief Rak'ahs, having prepared his Miswak and purification water. Allah would awaken him whenever He wished to awaken him. He would use the Miswak and perform ablution, then pray two Rak'ahs. Then he would stand and pray eight Rak'ahs, making them equal in recitation. Then [100] he would perform Witr with the ninth. When the Messenger of Allah, peace and blessings be upon him, aged and gained flesh, he made those eight into six, then performed Witr with the seventh, then prayed two Rak'ahs while sitting, reciting in them 'Say, O Disbelievers' (Surah Al-Kafirun) and 'When the Earth is Shaken' (Surah Az-Zalzalah).\" Narrated by Al-Tahawi with both wordings, and their chain is authentic. The first part of the first wording was narrated by Muslim and Abu Awanah... etc.] Note in the second wording that Aisha, may Allah be pleased with her, mentioned the two light Rak'ahs after his prayer of Isha. This supports what I preferred at the beginning of the treatise that these two light Rak'ahs are the Sunnah of Isha, and Allah knows best. [101] 2 - He prays 13 Rak'ahs, eight of them giving Tasleem between every two Rak'ahs, then performs Witr with five, not sitting or giving Tasleem except in the fifth. Regarding this is the Hadith of Aisha, may Allah be pleased with her, who said: \"He, peace and blessings be upon him, used to sleep. When he woke up, he used the Miswak, then performed ablution, then prayed eight Rak'ahs sitting in every two Rak'ahs and giving Tasleem. Then he performed Witr with five Rak'ahs, not sitting except in the fifth and not giving Tasleem except in the fifth. [When the Mu'adhin called Adhan, he stood and prayed two light Rak'ahs].\" Narrated by Ahmad, and its chain is authentic according to the conditions of the two Sheikhs. It was also narrated by Muslim, Abu Awanah, Abu Dawood, Al-Tirmidhi (who authenticated it), Al-Darimi, Ibn Nasr, Al-Bayhaqi, and Ibn Hazm. All of them narrated it briefly without mentioning Tasleem every two Rak'ahs. Al-Shafi'i, Al-Tayalisi, and Al-Hakim narrated from it only the Witr with five. The Hadith has a witness from the Hadith of Ibn Abbas narrated by Abu Dawood (1/214) and Al-Bayhaqi (3/29), and its chain is authentic. This narration of Ahmad is explicit that the total Rak'ahs are thirteen excluding the two Rak'ahs of Fajr. Thus, explicitly contradicting the Hadith of Aisha [102]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 74
  },
  {
    "serial_number": "4629853",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 103,
    "volume_number": 1,
    "text": "mentioned earlier (p. 16-17) with the wording: \"The Messenger of Allah, peace and blessings be upon him, did not increase in Ramadan or in other than it beyond eleven Rak'ahs.\" The reconciliation between them was previously discussed there, the summary of which is that she intended by this wording to exclude the two light Rak'ahs with which he, peace and blessings be upon him, used to open the night prayer. I have found what serves as a text for this reconciliation, which is her other Hadith where she mentioned these two Rak'ahs, then eight Rak'ahs, then Witr, and this has passed in the type preceding this one. - 3 - He prays 11 Rak'ahs, giving Tasleem between every two Rak'ahs, then performs Witr with one. Based on the Hadith of Aisha, may Allah be pleased with her, who said: \"He, peace and blessings be upon him, used to pray between the time he finished Isha prayer - which is what the people call Al-Atamah - until Fajr, eleven Rak'ahs, giving Tasleem between every two Rak'ahs and performing Witr with one. [And he would remain in his prostration for the duration it takes one of you to read fifty verses before raising his head]. When the Mu'adhin fell silent from the Fajr prayer and the dawn became clear to him and the Mu'adhin came, he stood and prayed two light Rak'ahs, then lay down on his right side until the Mu'adhin came to him for the Iqamah.\" [103]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 75
  },
  {
    "serial_number": "4629854",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 104,
    "volume_number": 1,
    "text": "Narrated by Muslim, Abu Awanah, Abu Dawood, Al-Tahawi, and Ahmad. The first two also narrated it from the Hadith of Ibn Umar, and Abu Awanah from the Hadith of Ibn Abbas. This type is supported by the Hadith of Ibn Umar as well, that a man asked the Messenger of Allah, peace and blessings be upon him, about the night prayer? He said: \"The night prayer is two by two (Mathna Mathna), so if one of you fears the morning, pray one Rak'ah to make odd what you have prayed.\" Narrated by Malik, Al-Bukhari, Muslim, and Abu Awanah. They added: \"It was said to Ibn Umar: What is 'two by two'? He said: That you give Tasleem in every two Rak'ahs.\" In the narration of Malik and Al-Bukhari: \"Abdullah bin Umar used to give Tasleem between the Rak'ah and the two Rak'ahs in Witr such that he would order some of his needs.\" The mentioned interpretation of Ibn Umar was narrated by Ahmad as Marfu' (attributed to the Prophet) inserted into the body of the Hadith, but its chain contains Abdul Aziz bin Abi Rawad, who is truthful but sometimes hallucinates/errs as in \"Al-Taqrib,\" so I fear he might have erred in raising it (attributing it to the Prophet), and Allah knows best. [104]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 76
  },
  {
    "serial_number": "4629855",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 105,
    "volume_number": 1,
    "text": "11 - Rak'ahs, four with one Tasleem, then four like them, then three. Narrated by the two Sheikhs and others from the Hadith of Aisha, and its wording has passed. The apparent meaning of the Hadith is that he used to sit between every two Rak'ahs of the four and the three but would not give Tasleem. This is how Al-Nawawi interpreted it as previously mentioned. This has been explicitly narrated in some Hadiths from Aisha that he, peace and blessings be upon him, used not to give Tasleem between the two Rak'ahs and the Witr, but they are all defective (Ma'lula) as mentioned by Al-Hafiz Ibn Nasr, then Al-Bayhaqi and Al-Nawawi, and I clarified it in (Al-Ta'liqat al-Jiyad 'ala Zad al-Ma'ad). So the reliance for the legitimacy of separating with sitting without Tasleem is the apparent meaning of this Hadith, but what contradicts this apparent meaning will come at the end of the chapter, and Allah knows best. - 5 - He prays 11 Rak'ahs, eight of which he does not sit in except in the eighth, recites Tashahhud and sends blessings on the Prophet, peace and blessings be upon him, then stands up and does not give Tasleem. Then he performs Witr with one Rak'ah, then gives Tasleem, then prays two Rak'ahs while sitting. Based on the Hadith of Aisha, may Allah be pleased with her, narrated by Sa'd bin Hisham bin Amir, that he came to Ibn Abbas and asked him about the Witr of the Messenger of Allah, peace and blessings be upon him. Ibn Abbas said: \"Shall I not guide you to the most knowledgeable person on earth regarding the Witr of the Messenger of Allah, peace and blessings be upon him?\" He said: \"Who?\" He said: \"Aisha. Go to her and ask her.\" So I went to her... I said: \"O Mother of the Believers, inform me about the Witr of [105]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 77
  },
  {
    "serial_number": "4629856",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 106,
    "volume_number": 1,
    "text": "the Messenger of Allah, peace and blessings be upon him?\" She said: \"We used to prepare his Miswak and purification water. Allah would awaken him whenever He wished to awaken him at night. He would use the Miswak, perform ablution, and pray nine Rak'ahs, not sitting in them except in the eighth. He would mention Allah, praise Him, [and send blessings upon His Prophet, peace and blessings be upon him], and supplicate. Then he would rise and not give Tasleem. Then he would stand and pray the ninth, then sit and mention Allah, praise Him, [and send blessings upon His Prophet, peace and blessings be upon him], and supplicate. Then he would give a Tasleem that we could hear. Then he would pray two Rak'ahs after giving Tasleem while sitting. That is eleven Rak'ahs, O my son. When the Prophet of Allah, peace and blessings be upon him, aged and gained flesh, he performed Witr with seven, and did in the two Rak'ahs like his first action. That is nine, O my son.\" [106]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 78
  },
  {
    "serial_number": "4629857",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 107,
    "volume_number": 1,
    "text": "Narrated by Muslim, Abu Awanah, Abu Dawood, Al-Nasa'i, Ibn Nasr, Al-Bayhaqi, and Ahmad. - 6 - He prays 9 Rak'ahs, six of which he does not sit in except in the sixth. He recites Tashahhud and sends blessings on the Prophet, peace and blessings be upon him, then stands and does not give Tasleem. Then he performs Witr with one Rak'ah, then gives Tasleem, then prays two Rak'ahs while sitting. Based on the Hadith of Aisha which I mentioned just now. These are the methods by which the Messenger of Allah, peace and blessings be upon him, used to pray the night prayer and Witr. Other types can be added to them, by decreasing from each type of the mentioned methods whatever Rak'ahs one wishes, and it is even permissible for him to restrict himself to one Rak'ah only, due to his saying, peace and blessings be upon him: \"So whoever wishes, let him perform Witr with five; whoever wishes, let him perform Witr with three; and whoever wishes, let him perform Witr with one,\" which has passed. This Hadith is a text regarding the permissibility of performing Witr with these three mentioned types, even if practicing them was not authentically reported from the Messenger of Allah, peace and blessings be upon him; rather, what was authentic from the Hadith of Aisha is that he, peace and blessings be upon him, did not use to perform Witr with less than seven, as preceded there. [107]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 79
  },
  {
    "serial_number": "4629858",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 110,
    "volume_number": 1,
    "text": "So these five and three, if he wishes, he can pray them with one sitting and one Tasleem as in the second type. And if he wishes, he can pray them with a sitting between every two Rak'ahs without Tasleem as in the fourth type. And if he wishes, he can give Tasleem between every two Rak'ahs, and that is better, as in the third type and others. Al-Hafiz Muhammad Ibn Nasr al-Marwazi, may Allah have mercy on him, said in \"Qiyam al-Layl\": \"What we choose for one who prays at night in Ramadan and other times is to give Tasleem between every two Rak'ahs. Until if he wants to pray three Rak'ahs, he recites in the first Rak'ah 'Glorify the Name of your Lord, the Most High' (Al-A'la) and in the second 'Say, O Disbelievers' (Al-Kafirun), recites Tashahhud in the second and gives Tasleem. Then he stands and prays a Rak'ah reciting in it the Opening of the Book (Al-Fatiha) and 'Say, He is Allah, [who is] One' (Al-Ikhlas) and the two Mu'awwidhatayn.\" (Then he mentioned some of the previous types). Then he said: \"And all of that is permissible to act upon, following his example, peace and blessings be upon him. However, the choice is what we mentioned, because the Prophet, peace and blessings be upon him, when asked about the night prayer, answered: 'The night prayer is two by two.' So we chose what he chose for his Ummah, and permitted the action of one who followed him and did like his action if no prohibition was narrated from him regarding that.\" Then he said: \"Acting upon all these narrations is permissible according to us. They only differed because the prayer at night is voluntary: Witr and other than Witr. So he, peace and blessings be upon him, used to vary his prayer at night and his Witr as we mentioned: praying sometimes like this and sometimes like that. All of that is permissible and good. As for Witr with three Rak'ahs, we did not find [108] from the Prophet, peace and blessings be upon him, an authentic, explicit report that he performed Witr with three without giving Tasleem except at their end, as we found regarding the five, seven, and nine. However, we found reports from him that he performed Witr with three without mention of Tasleem in them.\" Then he cited with his authentic chain from Ibn Abbas \"that the Messenger of Allah, peace and blessings be upon him, used to perform Witr with three, reciting 'Glorify the Name of your Lord, the Most High', 'Say, O Disbelievers', and 'Say, He is Allah, [who is] One'.\" Then he said: \"And in the chapter are [reports] from Imran bin Husain, Aisha, Abdur Rahman bin Abza, and Anas bin Malik.\" He said: \"These are ambiguous reports. It is possible that the Prophet, peace and blessings be upon him, gave Tasleem in the two Rak'ahs of these three that were narrated he performed Witr with, because it is permissible to say of one who prayed ten Rak'ahs giving Tasleem between every two Rak'ahs: 'So-and-so prayed ten Rak'ahs.' And explicit reports that do not bear except one meaning [109] are more worthy to be followed and used as proof. However, we narrated from the Prophet, peace and blessings be upon him, that he gave the one performing Witr the choice between performing Witr with five, or with three, or with one. And we narrated from some of the Companions of the Prophet, peace and blessings be upon him, that they performed Witr with three not giving Tasleem except at their end. So acting upon that is permissible, and the choice is what we clarified.\" Then he said: \"The matter according to us is that Witr with one, three, five, seven, and nine is all permissible and good, based on what we narrated of reports from the Prophet, peace and blessings be upon him, and his Companions after him. And what we choose is what we described before. If a man prays Isha and then wants to perform Witr after it with one Rak'ah without praying anything before it, what we choose for him and recommend is that he precedes it with two Rak'ahs or more, then performs Witr with one. If he does not do so and performs Witr with one, it is permissible. We have narrated from more than one of the elite Companions of Muhammad, peace and blessings be upon him, that they did that. Malik and others disliked that, but the Companions of the Prophet, peace and blessings be upon him, are more worthy of being followed.\" Then he said: [110]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 80
  },
  {
    "serial_number": "4629859",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 112,
    "volume_number": 1,
    "text": "\"And reports regarding the dislike of Witr with three have been narrated, some from the Prophet, peace and blessings be upon him, and some from the Companions of the Prophet, peace and blessings be upon him, and the Successors. Among them is\" then he mentioned his saying, peace and blessings be upon him: \"Do not perform Witr with three resembling the Maghrib prayer, but perform Witr with five...\" Its chain is weak, but Al-Tahawi and others narrated it from another path with an authentic chain. It apparently contradicts the Hadith of Abu Ayyub extracted there with the wording \"...and whoever wishes, let him perform Witr with three.\" The reconciliation between them is by interpreting the prohibition as applying to praying the three with two Tashahhuds, because in this form it resembles the Maghrib prayer. But if he does not sit except at its end, there is no resemblance. Al-Hafiz Ibn Hajar mentioned this meaning in \"Al-Fath,\" and Al-San'ani deemed it good in \"Subul al-Salam.\" The furthest from resembling Maghrib in Witr is separating with Tasleem between the Shafi' (even) and the Witr (odd), as is obvious. For this reason, Ibn al-Qayyim said in \"Al-Zad\" after mentioning the Hadith: \"He did not use to give Tasleem in the two Rak'ahs of Witr\": \"This description is questionable. For Abu Hatim Ibn Hibban narrated in his Sahih from Abu Hurairah from the Prophet, peace and blessings be upon him: 'Do not perform Witr with three; perform Witr with five or seven, and do not resemble the Maghrib prayer.' Al-Daraqutni said: 'Its narrators are all trustworthy.' Mahna said: I asked Abu Abdullah (meaning Imam Ahmad): 'Which view do you hold regarding Witr? Do you give Tasleem in the two Rak'ahs?' He said: 'Yes.' I said: 'Why?' He said: 'Because the Hadiths regarding it are stronger and more numerous from the Prophet, peace and blessings be upon him and his family.' And Harith said: Ahmad was asked about Witr? He said: 'He gives Tasleem in the two Rak'ahs. And if he does not give Tasleem, I hope it does not harm him, except that Tasleem is more established from the Prophet, peace and blessings be upon him and his family.'\" It is summarized from all the above that performing Witr with any of these preceding types is permissible and good, and that performing Witr with three with two Tashahhuds like the Maghrib prayer has no authentic explicit Hadith supporting it; rather, it is not free from dislike. Therefore, we choose not to sit between the Shafi' and the Witr, and if one sits, he should give Tasleem. This is better due to what preceded. And Allah is the Grantor of success; there is no Lord but He. [112]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 81
  },
  {
    "serial_number": "4629860",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 113,
    "volume_number": 1,
    "text": "8 - Encouragement to Perfect the Prayer and Warning Against Performing it Badly: O noble reader, you are now in the month of fasting and night prayer, the blessed month of Ramadan. So you must be the example of a righteous believer - obedient to his Lord and following the Sunnah of his Prophet in everything he brought from his Lord, especially regarding the establishment of this great worship (Tarawih prayer). For he, peace and blessings be upon him, said regarding it: \"Whoever stands (in prayer) in Ramadan out of faith and expecting reward, his previous sins will be forgiven.\" Narrated by the two Sheikhs and others. You have learned from what preceded in this treatise something good regarding the description of his prayer, peace and blessings be upon him, in the night prayer of Ramadan in terms of perfecting the prayer and prolonging it, such as the saying of Aisha, may Allah be pleased with her: \"...He prays four, so do not ask about their beauty and length. Then he prays four, so do not ask about their beauty and length.\" And her saying: \"He remains in his prostration for the duration it takes one of you to read fifty verses.\" And the saying of Hudhayfah: \"...Then he recited Al-Baqarah (meaning in the first Rak'ah), then he bowed, and his bowing was like his standing,\" then he mentioned the standing after bowing and the prostration similarly. You also learned that the Predecessors (Salaf) in the time of Umar, may Allah be pleased with him, used to prolong the recitation in Tarawih prayer, reciting about three hundred verses in it, so that [113]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 82
  },
  {
    "serial_number": "4629861",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 114,
    "volume_number": 1,
    "text": "they used to lean on staffs due to the length of standing, and they would not leave the prayer except with the break of dawn. This should be a motivator for all of us to approach in our Tarawih prayer their prayer to the extent of our ability. So let us reduce the recitation in it and increase the Tasbeeh and remembrance in bowing and prostration and what is between them until we feel even a little bit of Khushu' (humility/focus), which is the soul and core of prayer. This Khushu' has been lost by many of those praying this prayer due to their eagerness to perform it with the alleged number of twenty without care for tranquility in it. Rather, they peck it like the pecking of roosters, as if they are wheels and machines going up and down automatically. This does not enable them to ponder over what they hear of the words of Allah, Blessed and Exalted; rather, it is difficult for a person to follow them except with great difficulty. [114]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 83
  },
  {
    "serial_number": "4629862",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 115,
    "volume_number": 1,
    "text": "I say this knowing that not a few Imams of mosques have realized recently the poor performance Tarawih prayer has reached, so they returned to praying it as eleven Rak'ahs with some tranquility and Khushu'. May Allah increase their success in practicing the Sunnah and reviving it, and increase the likes of them in Damascus and elsewhere. [115]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 84
  },
  {
    "serial_number": "4629863",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 116,
    "volume_number": 1,
    "text": "Hadiths regarding the encouragement to perfect the performance of prayer and warning against performing it badly: To encourage these people to continue perfecting the prayer and increase in it, and to warn those who perform Tarawih and other prayers badly, I cite some authentic Hadiths narrated regarding the encouragement to perfect it and warning against performing it badly. I say: (Sahih) - 1 - From Abu Hurairah, may Allah be pleased with him, that a man entered the mosque to pray while the Messenger of Allah, peace and blessings be upon him, was in a corner of the mosque. He came and greeted him. He said to him: \"[And upon you be peace.] Go back and pray, for you have not prayed.\" So he went back and prayed, then greeted him. He said: \"And upon you [be peace]. Go back and pray, for you have not prayed.\" He said in the third time: \"Teach me.\" He said: \"When you stand for prayer, perfect the ablution, then face the Qiblah and say Takbeer, and recite what is easy for you of the Quran. Then bow until you are tranquil bowing, then raise your head until you are straight standing, then prostrate until you are tranquil prostrating, then rise until you sit straight and tranquil, then prostrate until you are tranquil prostrating, then rise until you are straight standing. Then do that in all your prayer.\" Narrated by Al-Bukhari, Muslim, and others. [116]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 85
  },
  {
    "serial_number": "4629864",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 117,
    "volume_number": 1,
    "text": "(Sahih) - 2 - From Abu Mas'ud Al-Badri who said: The Messenger of Allah, peace and blessings be upon him, said: \"The prayer of a man does not suffice until he straightens his back in bowing and prostration.\" Narrated by Abu Dawood, Al-Nasa'i, Al-Tirmidhi, Ibn Majah, Al-Darimi, Al-Tahawi, Al-Tayalisi, Ahmad, and Al-Daraqutni, and he said: \"Its chain is established authentic (Sahih).\" And it is as he said, and Al-A'mash explicitly stated hearing it in the narration of Al-Tayalisi. (Sahih) - 3 - From Abu Hurairah that the Messenger of Allah, peace and blessings be upon him, said: \"The worst of people in theft is the one who steals from his prayer.\" They said: \"O Messenger of Allah, how does he steal from his prayer?\" He said: \"He does not complete its bowing and prostration.\" Narrated by Al-Hakim who authenticated it, and Al-Dhahabi agreed. It has a witness with him from the Hadith of Abu Qatadah, another with Malik from Al-Nu'man bin Murrah (authentic Mursal chain), and a third with Al-Tayalisi from Abu Sa'id, authenticated by Al-Suyuti in \"Tanwir al-Hawalik.\" [117]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 86
  },
  {
    "serial_number": "4629865",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 118,
    "volume_number": 1,
    "text": "(Hasan) - 4 - From the commanders of the armies: Amr bin Al-Aas, Khalid bin Al-Walid, Shurahbil bin Hasanah, and Yazid bin Abi Sufyan, they said: The Messenger of Allah, peace and blessings be upon him, saw a man not completing his bowing and pecking in his prostration while praying. He said: \"If this one died in this state, he would die on other than the religion (Millah) of Muhammad. [He pecks his prayer as a crow pecks blood]. The example of the one who does not complete his bowing and pecks in his prostration is like the hungry man who eats one or two dates; they do not avail him anything.\" Narrated by Al-Ajurri in Al-Arba'in and Al-Bayhaqi with a Hasan chain. Al-Mundhiri said: Narrated by Al-Tabarani in Al-Kabir and Abu Ya'la with a Hasan chain, and Ibn Khuzaymah in his Sahih. (Sahih) - 5 - From Talq bin Ali, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: \"Allah does not look at the prayer of a servant who does not straighten his spine between its bowing and its prostration.\" Narrated by Ahmad, Al-Tabarani in \"Al-Kabir,\" and Al-Diya' Al-Maqdisi in \"Al-Mukhtara.\" Its chain is Sahih, and it has a witness in the Musnad, and its narrators are trustworthy. Al-Hafiz Al-Iraqi authenticated it in \"Takhrij Al-Ihya,\" and Al-Mundhiri said: \"Its chain is good.\" [118]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 87
  },
  {
    "serial_number": "4629866",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 119,
    "volume_number": 1,
    "text": "(Sahih) - 6 - From Ammar bin Yasir, may Allah be pleased with him, who said: I heard the Messenger of Allah, peace and blessings be upon him, say: \"A servant may pray a prayer and nothing is written for him of it except a tenth, a ninth, an eighth, a seventh, a sixth, a fifth, a quarter, a third, a half.\" Narrated by Abu Dawood, Al-Bayhaqi, and Ahmad via two paths from him; Al-Hafiz Al-Iraqi authenticated one of them. Ibn Hibban also narrated it in his Sahih as in \"Al-Targhib\" (1/184). (Sahih) - 7 - From Abdullah bin Al-Shikhir who said: I came to the Prophet, peace and blessings be upon him, while he was praying, and his chest made a sound like the boiling of a pot, meaning he was weeping. Narrated by Abu Dawood, Al-Nasa'i, Al-Bayhaqi, and Ahmad with a Sahih chain according to the conditions of Muslim. Also narrated by Ibn Khuzaymah and Ibn Hibban in their Sahihs as in \"Sahih Al-Targhib wa Al-Tarhib\" (No. 545). [119]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 88
  },
  {
    "serial_number": "4629867",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 121,
    "volume_number": 1,
    "text": "These noble Hadiths include by their generality and absoluteness all prayers, whether obligatory or voluntary, night or day. Scholars have pointed this out regarding Tarawih prayer. Al-Nawawi said in Al-Adhkar (4/297 with explanation by Ibn Allan) in the chapter on Adhkar of Tarawih prayer: \"The description of the prayer itself is like the description of other prayers as previously explained. It includes all the aforementioned Adhkar, such as the opening supplication, completing the remaining Adhkar, completing the Tashahhud and the supplication after it, and other things mentioned previously. Although this is apparent and well-known, I drew attention to it due to the negligence of most people regarding it and their omission of most Adhkar, whereas the correct way is what preceded.\" Al-Amiri said in \"Bahjat al-Mahafil wa Bughyat al-Amathil fi Talkhis al-Siyar wal-Mu'jizat wal-Shama'il\" at the end of the book: \"Among what must be attended to and warned against is what many Imams leading Tarawih are accustomed to: rushing through recitation, lightening the pillars (Rukn), and omitting Adhkar. Scholars have said: Its description is like the description of other prayers in conditions and other etiquettes and all Adhkar like the opening supplication, Adhkar of pillars, and supplication after Tashahhud, etc. Included in this is their seeking verses of mercy so they only bow upon them. Perhaps their seeking of that leads them to [120] missing two important matters from the etiquettes of prayer and recitation: lengthening the second Rak'ah over the first, and pausing at speech that is connected to each other. The cause of all this is neglecting Sunnahs and their fading due to lack of use, until the one practicing them becomes ignored by many people because of his opposition to what the great majority is upon, due to the corruption of time. The Prophet, peace and blessings be upon him, said: 'The Hour will not be established until good becomes evil (Munkar) and evil becomes good (Ma'ruf).' So adhere to the Sunnah; demand it of yourself and command it to those who obey you, you will be saved and safe and blessed. The great master Abu Ali Al-Fudayl bin Iyad, may Allah have mercy on him and be pleased with him and benefit [us] by him, said: 'Do not feel lonely on the paths of guidance due to the fewness of its people, and do not be deceived by the abundance of those perishing.'\" [121]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 89
  },
  {
    "serial_number": "4629868",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 122,
    "volume_number": 1,
    "text": "Summary of the Treatise: The discussions of this treatise have extended beyond what we thought, but it was unavoidable because it is what the scientific method of investigation requires. Finally, we decided to present to the noble readers a summary of it so that it may be present in their minds, making it easy for them to comprehend and act upon, Allah willing. So I say: It is summarized as follows: That congregation in Tarawih prayer is a Sunnah and not an innovation (Bid'ah), because the Prophet, peace and blessings be upon him, prayed it for several nights. His leaving it afterwards was only out of fear that anyone from his Ummah might think it obligatory if he persisted in it. This fear disappeared with the completion of the Sharia upon his death, peace and blessings be upon him. And that he, peace and blessings be upon him, prayed it as eleven Rak'ahs. And that the Hadith saying he prayed it as twenty is very weak. And that it is not permissible to increase beyond eleven Rak'ahs because increasing it implies canceling his action, peace and blessings be upon him, and disabling his saying, peace and blessings be upon him: \"Pray as you have seen me pray.\" Therefore, it is not permissible to increase upon the Sunnah of Fajr and others [122]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 90
  },
  {
    "serial_number": "4629869",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 123,
    "volume_number": 1,
    "text": "And we do not accuse of innovation (Tabdi') nor declare astray those who pray it with more than this number if the Sunnah was not clear to them and they did not follow desires. And that if it were said that increasing upon it is permissible, there is no doubt that stopping at it is better due to his saying, peace and blessings be upon him: \"The best guidance is the guidance of Muhammad.\" And that Umar, may Allah be pleased with him, did not innovate anything in Tarawih prayer; rather, he revived the Sunnah of congregation in it and maintained the Sunnah number in it. And that what was narrated about him increasing it until he made it twenty Rak'ahs - none of its chains are authentic, and these chains are of the type that do not strengthen each other. Al-Shafi'i and Al-Tirmidhi pointed to weakening it, and Al-Nawawi, Al-Zayla'i, and others weakened some of them. And that the mentioned increase, even if proven, implies no obligation to act upon it today because it was for a cause that has ceased. Insisting on it has led its practitioners mostly to rushing the prayer and removing its Khushu' (focus) and even its validity at times. That our not adopting the increase is like the Sharia court judges not adopting Umar's opinion on enacting the triple divorce as three, and there is no difference; rather, our position is worthier than theirs even in the view of the blind followers (Muqallidin). [123]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 91
  },
  {
    "serial_number": "4629870",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 124,
    "volume_number": 1,
    "text": "And that it was not proven from any of the Companions that they prayed it as twenty Rak'ahs; rather, Al-Tirmidhi indicated the weakness of that regarding Ali. And that there is no consensus (Ijma') on this number. And that adhering to the Sunnah number is obligatory because it is what is established from him, peace and blessings be upon him, and from Umar. And we have been commanded to follow his Sunnah, peace and blessings be upon him, and the Sunnah of the Righteous Caliphs. And that the increase upon it was denied by Malik, Ibn al-Arabi, and other scholars. And that denying this increase does not necessitate denying the Mujtahid Imams who adopted it, just as disagreeing with them does not necessitate attacking their knowledge or preferring the dissenter over them in knowledge and understanding. And that although increasing upon eleven Rak'ahs is not permissible, less than it is permissible, even restricting to one Rak'ah from it, due to that being proven in the Sunnah and the Predecessors did it. And that the methods by which the Messenger of Allah, peace and blessings be upon him, prayed Witr are all permissible, and the best of them is the most numerous, and giving Tasleem between every two Rak'ahs. [124]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 92
  },
  {
    "serial_number": "4629871",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 125,
    "volume_number": 1,
    "text": "This is the last of what Allah, Blessed and Exalted, facilitated for me to collect regarding Tarawih prayer. If I have been successful in it towards the truth, the favor belongs to Allah, Blessed and Exalted, and to Him belongs the grace and bounty. And if it was otherwise, I hope that everyone who finds an error in it will guide us to it, and Allah, Blessed and Exalted, will take charge of his reward. Glory be to You, O Allah, and with Your praise, I bear witness that there is no god but You, I seek Your forgiveness and repent to You. And may Allah send blessings upon Muhammad, the Unlettered Prophet, and upon his family and companions and grant them peace. And our final call is that praise be to Allah, Lord of the Worlds. [125]",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 93
  },
  {
    "serial_number": "4629872",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Salat al-Tarawih (Tarawih Prayer)",
    "edition": "First - 1421",
    "publisher": "Al-Ma'arif Library for Publishing and Distribution - Riyadh",
    "page_number": 125,
    "volume_number": 1,
    "text": "End of the Book",
    "foot_note": "None",
    "book_id": "680",
    "new_page_number": 93
  }
]