[
  {
    "text": "الزبد في مصطلح الحديث\nالمؤلف: فضل الرحمن عبد العليم صافي\nسنة الوفاة: 1442",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "الزبد في مصطلح الحديث",
    "category_id": "10",
    "category": "علوم الحديث",
    "new_page_number": 1
  },
  {
    "text": "sn: 3541\nbook_title: الزبد في مصطلح الحديث (شرح منظومة الشيخ عبد الرحمن أبي بكر الملا، المسماة «إلهام المغيث في أقسام الحديث»)\nbook_link: https://shamela.ws/book/797\nbook_id: 797\nauthor_name: فضل الرحمن عبد العليم صافي\nauthor_year: 1442\nnickname: Null\nauthor_link: https://shamela.ws/author/177\nauthor_ID: 177\neditor: Null\npublisher: دار عمار للنشر والتوزيع - عمان - الأردن\nedition: الأولى، 1428 هـ - 2007 م\npages: 60\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: علوم الحديث\ncategory_id: 10",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "الزبد في مصطلح الحديث",
    "category_id": "10",
    "category": "علوم الحديث",
    "new_page_number": 2
  },
  {
    "serial_number": "3349054",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: علوم الحديث الكتاب : الزبد في مصطلح الحديث ( شرح منظومة الشيخ عبد الرحمن أبي بكر الملا ، المسماة « إلهام المغيث في أقسام الحديث » المؤلف : فضل الرحمن عبد العليم صافي ( ت 1442 هـ ) الناشر : دار عمار للنشر والتوزيع - عمان - الأردن طُبع على نفقة : ابن الناظم الأستاذ أبو بكر بن الشيخ عبد الرحمن أبو بكر الملا الطبعة : الأولى ، 1428 هـ - 2007 م عدد الصفحات : 60 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 2 رمضان 1443\nالكتاب : الزبد في مصطلح الحديث ( شرح منظومة الشيخ عبد الرحمن أبي بكر الملا ، المسماة « إلهام المغيث في أقسام الحديث » المؤلف : فضل الرحمن عبد العليم صافي ( ت 1442 هـ ) الناشر : دار عمار للنشر والتوزيع - عمان - الأردن طُبع على نفقة : ابن الناظم الأستاذ أبو بكر بن الشيخ عبد الرحمن أبو بكر الملا الطبعة : الأولى ، 1428 هـ - 2007 م عدد الصفحات : 60 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 2 رمضان 1443\n( شرح منظومة الشيخ عبد الرحمن أبي بكر الملا ، المسماة « إلهام المغيث في أقسام الحديث » المؤلف : فضل الرحمن عبد العليم صافي ( ت 1442 هـ ) الناشر : دار عمار للنشر والتوزيع - عمان - الأردن طُبع على نفقة : ابن الناظم الأستاذ أبو بكر بن الشيخ عبد الرحمن أبو بكر الملا الطبعة : الأولى ، 1428 هـ - 2007 م عدد الصفحات : 60 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 2 رمضان 1443\nالمؤلف : فضل الرحمن عبد العليم صافي ( ت 1442 هـ ) الناشر : دار عمار للنشر والتوزيع - عمان - الأردن طُبع على نفقة : ابن الناظم الأستاذ أبو بكر بن الشيخ عبد الرحمن أبو بكر الملا الطبعة : الأولى ، 1428 هـ - 2007 م عدد الصفحات : 60 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 2 رمضان 1443\nالناشر : دار عمار للنشر والتوزيع - عمان - الأردن طُبع على نفقة : ابن الناظم الأستاذ أبو بكر بن الشيخ عبد الرحمن أبو بكر الملا الطبعة : الأولى ، 1428 هـ - 2007 م عدد الصفحات : 60 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 2 رمضان 1443\nطُبع على نفقة : ابن الناظم الأستاذ أبو بكر بن الشيخ عبد الرحمن أبو بكر الملا الطبعة : الأولى ، 1428 هـ - 2007 م عدد الصفحات : 60 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 2 رمضان 1443\nالطبعة : الأولى ، 1428 هـ - 2007 م عدد الصفحات : 60 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 2 رمضان 1443\nعدد الصفحات : 60 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 2 رمضان 1443\n[ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 2 رمضان 1443\nتاريخ النشر بالشاملة : 2 رمضان 1443",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 3
  },
  {
    "serial_number": "3349055",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 1,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرحيم الحمد لله رب العالمين القائل في محكم التنزيل {وأنزلنا إليك الذكر لتبين للناس ما نزل إليهم ولعلهم يتفكرون}. (1) والصلاة والسلام على رسوله الأمين سيدنا محمد القائل: \"ألا إني أوتيت القرآن ومثله معه\"، (2) وعلى آله وصحبه أجمعين، وبعد: فلما كانت السنة النبوية الشريفة هي المصدر الثاني في التشريع، لذا فقد اعتنى علماؤنا الأوائل خلفاً عن سلف بتصحيحها وتدقيقها وضبطها رواية ودراية، متناً وسنداً، وذلك خشية الوقوع فيما هو غير ثابت عن الشارع الحكيم، وأُلفت في ذلك المؤلفات المسماة بعلم المصطلح، وهذه المؤلفات فيها المطولات كتدريب الراوي للسيوطي، والألفية له، ومقدمة ابن الصلاح، وغيرها كثير، ومنها المختصرات وهي كثيرة أيضاً، منها على سبيل المثال: البيقونية وشروحها، ونخبة الفكر مع شرحها للحافظ ابن حجر",
    "foot_note": "1. سورة النحل، آية 44. \n2. رواه أبو داود، كتاب السنة، باب في لزوم السنة (4604) عن المقدام معدي يكرب في رسول الله صلى الله عليه وسلم أنه قال: \"ألا إني أوتيت القرآن ومثله معه\".",
    "book_id": "797",
    "new_page_number": 4
  },
  {
    "serial_number": "3349056",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 2,
    "volume_number": 1,
    "text": "العسقلاني، وتيسير مصطلح الحديث لمحمود الطحان، وقد راعى المتأخرون رحمهم الله في هذه المختصرات التسهيل للطلاب، وخاصة طلاب المعاهد والجامعات، وهذه المنظومة التي بين أيدينا للشيخ عبد الرحمن بن الشيخ أبي بكر الملا مع شرحها للشيخ فضل الرحمن صافي، ويجد القارئ في هذه المنظومة جانباً من الاختصار غير المخل مع جزالة الألفاظ وسلامة الأسلوب، ويهذا من صفات العالم الرباني الذي يعلم تلاميذه مسائل العلم، صغيرها قبل كبيرها تدرجاً مع إدراك الطالب. فنجد أن مشايخنا الأحسائيين رحمهم الله كانت لهم عناية كبيرة بهذا العلم المنيف، وكان لهم حظ وافر في علم الرواية والدراية إلى أيامنا هذه ولله الحمد والمنة، وقد تركوا لنا تراثاً حديثياً ليكون أمانة في أعناقنا لنخرجه إلى النور فنستفيد ونفيد، ومما ترك لنا أولئك السادة الأسلاف في هذا العلم الشيء الكثير، ومنه على سبيل المثال: مختصر الإمام البخاري للعلامة الشيخ محمد بن عمر بن عبد الرحمن الملا. وأما الشيخ أبو بكر بن الشيخ محمد الملا فله مؤلفات كثيرة في هذا العلم، ومنها على سبيل المثال: شرح صحيح الإمام البخاري، وشرح شمائل الإمام الترمذي، والرد الفصيح على منكر العمل بالنص الصريح.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 5
  },
  {
    "serial_number": "3349057",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 3,
    "volume_number": 1,
    "text": "وأما الشيخ محمد بن سعيد العمير فله دعاء لختم صحيح الإمام البخاري. وأما الشيخ عبد الرحمن بن الشيخ أبي بكر الملا فله منظومته المسماة \"إلهام المغيث في أقسام الحديث\"، والذي بين يديك شرح لها. وقد طلب مني الأخ مراد بن عبد الله الملا أن أقدم لهذا الكتاب، ولما لم يسعني مخالفته كتبت هذه الأسطر المختصرة نظراً لضيق المقام، راجياً من الله التوفيق وأن ينفع به طلاب العلم، ويجعل عملناً خالصاً لوجهه الكريم، إنه سميع مجيب. وأخيراً، نسأل الله تعالى أن يوفقنا للتعلم والتعليم، وخدمة التراث الإسلامي بما يليق بهذا الدين العظيم، ورحم الله شيخنا الناظم وأجزل له المثوبة والأجر، وجزى الله تعالى شارحها كل خير، وغفر لوالديه ونفع بعلومه. وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم. كتبه أحمد بن الشيخ عبد الله بن الشيخ أبي بكر الملا غرة ربيع ثاني 1426 هـ - الأحساء",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 6
  },
  {
    "serial_number": "3349058",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 4,
    "volume_number": 1,
    "text": "ترجمة الناظم رحمه الله تعالى  اسمه ونسبه: هو العلامة المحدث الفقيه الأديب الشيخ عبد الرحمن بن الشيخ أبي بكر بن الشيخ عبد الله الملا. تنسب أسرة الملا إلى بيت الواعظ، الذي يرجع نسبه إلى الصحابي الجليل سيدنا عبد الرحمن بن أبي بكر الصديق رضي الله عنه، كما أشار إلى ذلك العم الشيخ عبد الرحمن في مرثيته لوالده الجد الشيخ أبو بكر رحمهم الله بقوله: من قريش آباؤك الغر جاءوا … هم حماة العرين كهف النزيل لأبي بكر ينتمون ومن تيم … فروع تسلسلت من أصول  نشأته: نشأ شيخنا الناظم رحمه الله في بيت عرف بالتقوى والورع والصلاح، فقام والده بتربيته على مكارم الأخلاق، واجتهد عليه وعلى إخوته بتلقينهم القرآن الكريم، والقراءة والكتابة، والفقه، والأوراد النبوية، والعلوم الشرعية. وكان بيت الشيخ أبي بكر آنذاك مهبط الضيوف من علماء وفقراء وعابري سبيل، كما عرف عن والده إكرامهم والعناية بهم وتلبية حاجاتهم،",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 7
  },
  {
    "serial_number": "3349059",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 5,
    "volume_number": 1,
    "text": "وتوفير المسكن والمطعم المناسب لهم، فكان لهذا الأمر وقع وأثر في تكوين شخصية الناظم رحمه الله تعالى.  شيوخه: تتلمذ الناظم رحمه الله على والده الشيخ أبي بكر فأخذ عنه القرآن الكريم، والقراءة والكتابة، والفقه وغيره، كما أخذ عن تلميذ والده العلامة الفقيه الشيخ محمد بن عبد اللطيف الملا، وأخذ النحو عن الشيخ عبد اللطيف الجعفري، والشيخ أحمد العلي العرفج، كما قرأ على العلامة الورع الشيخ عبد العزيز العلجي، وأخذ الفقه عن الشيخ محمد الحلبي الحنفي وهو من العلماء الذين وفدوا الأحساء زمن والده. ثم أرسله والده إلى مكة المكرمة ليكمل دراسته هناك فالتحق بالمدرسة الصولتية وتخرج منها، ولازم علماء الحرم المكي الذي كان عبارة عن جامعة مفتوحة يقصده أكابر علماء الأمة لينشروا علومهم، فأخذ عن العلماء الذين أدركهم في ذلك الوقت ثم رحل للمدينة المنورة فلازم فيها عدداً من مشاهير العلماء آنذاك، وفي هذا الوقت كان رحمه الله لا يسمع بشيخ متفنن إلا لازمه وأخذ عنه، ومن أبرز شيوخه الذين تلقى عنهم خارج بلده الأحساء: العلامة المحدث الشيخ عمر حمدان المحرسي في الكتب الستة، والعلامة المحدث المجاهد السيد محمد عبد الحي الكتاني",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 8
  },
  {
    "serial_number": "3349060",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 6,
    "volume_number": 1,
    "text": "في الحديث الشريف، والعلامة الفيه الشيخ حسين عبد الغني الحنفي، والعلامة الفقيه الأصولي الشيخ محمد يحيى أمان، كما قرأ على الشيخ الفقيه الصالح بهاء الدين الأفغاني، والعلامة المحدث الشيخ عبد الرؤوف المصري، وأخذ السيرة النبوية والتاريخ الإسلامي عن العلامة السيد محمد العربي التباني، وقرأ على العلامة الشيخ محمد بن علي بن حسين المالكي في النحو، وأخذ عن السيد الشيخ عباس المالكي، وأخذ عن الشيخ أسعد المالكي.  تلاميذه: لما كان لشيخنا الناظم رحمه الله تعالى إلماماً بالعلوم الشرعية والعربية ومتعلقاتهما جعل طلاب العلم يؤمونه للأخذ عنه والنيل من علومه والاتصال بأسانيده الحديثية التي تعتبر من أعلى الأسانيد وأرفعها وذلك بعد وفاة شيوخه وأقرانه، فالتف حوله جمع من طلبة العلم الشريف حينما كان مقيماً في مكة المكرمة، وعندما استقر في مسقط رأسه بلده الأحساء أصبح بيته مقصداً لطلاب العلم والعلماء ابتداء من الأحساء ونجد والحجاز حتى بقية الدول المجاورة، وكما ذكرنا أن إلمام الشيخ وتفننه في علوم شتى أضف إلى ذلك عنايته بالأدب وقرضه للشعر كل ذلك وغيره جعل للشيخ قبولاً ومكانة عند طلابه وزائريه، فكان",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 9
  },
  {
    "serial_number": "3349061",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 7,
    "volume_number": 1,
    "text": "رحمه الله في تقريره للدرس كثير الشواهد بالشعر والنكت والطرائف المناسبة، لذلك كان مجلسه لا يمل وسامعه يصغي إليه ويستمتع بحديثه.  مؤلفاته: ترك لنا الشيخ رحمه الله عدة رسائل وفتاوى متنوعة في فنون عديدة، كما خلف لنا ديوان شعر، ومقطوعات نثرية ومقامات أدبية، وهي في طريقها للنور قريباً إن شاء الله بعناية سبطيه الشيخ مراد والشيخ رائد ابني عبد الله الملا.  وفاته: توفي شيخنا الناظم رحمه الله تعالى مساء يوم السادس والعشرين من شهر شوال عام 1429 هـ عن عمر يناهز ثماني وتسعين عاماً قضاها رحمه الله في التعلم والتعليم ومنفعة المسلمين عن طريق الرقية الشرعية ومناصرة المظلومين ورد حقوقهم ومساعدة الفقراء والمحتاجين، رحمه الله رحمة واسعة وأسكنه فسيح جناته وبارك له في ذريته وأهل بيته وتلاميذه وعموم المسلمين كل خير وعمل صالح. بقلم تلميذه وابن أخيه أحمد بن الشيخ عبد الله بن الشيخ أبي بكر الملا",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 10
  },
  {
    "serial_number": "3349062",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 8,
    "volume_number": 1,
    "text": "مَتْنُ الأُرجوزَة \"إلهام المغيث في أقسام الحديث \" قال الناظم -رحمه الله تعالى: يَا سَائِلي عَنِ الحَدِيثِ مُرْتَقِبْ … أَقْسَامَهُ خُذْها بِنَظْمٍ مُقْتَرِبْ إنَّ الصَّحيحَ مَا سَنَدُهُ اتَّصَلْ … بِلَا شُذُوذٍ وَ بضَابِطَيْنَ دَلّْ وَالحَسَنُ المَعْرُوفُ دُونَ الأَوَّلِ … رجالُه لَا كَالصَّحِيحِ المُعْتَلِي أمَّا الضَّعيفُ فَهْوَ دُونَ الحَسَنِ … لِفَقْدِهِ شُرُوطَهُ فَاسْتَبِنِ وَمَا عُزِيْ (1) إِلَى النَّبِيِّ أَو نُسِبْ … فَذَا هُوَ المَرْفُوعُ فَاحْفَظْهُ تُصِبْ وَمَا عَلَى قَولِ الصَّحابيِّ قُصِرْ … فَذَا هُوَ المَوقُوفُ يَا ذَا المُبْتَصِرْ وَمَا بِإسْنَادٍ لَهُ قَدِ اتَّصَلْ … فَذَا هُوَ المَوصُولُ حَيْثُما حَصَلْ وَمُرْسَلٌ مَا التَّابِعِيُّ قَدْ رَفَعْ … كَقَوْلِهِ عَنِ النَّبِيِّ المُتَّبَعْ وَمَا أَتَى عَنْ تَابِعِ مَوْقُوفَا … فَذَاكَ مَقْطُوعٌ أَتَى مَعْرُوفَا وَمَا لِآحَادِ رُوَاتِهِ سَقَطْ … مُنْقَطِعٌ عَنِ الصَّحِيحِ قَدْ هَبَطْ",
    "foot_note": "1. تسكين الياء هنا ضرورة شعرية.",
    "book_id": "797",
    "new_page_number": 11
  },
  {
    "serial_number": "3349063",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 9,
    "volume_number": 1,
    "text": "المُعْضَلُ السَّاقِطُ مِنْهُ اثْنَانِ … عَلَى التَّوَالي فَاتَّبِعْ بَيَاني وَمَا مِنَ الإِسْنَادِ أَوَّلاً حُذِفْ … مُعَلَّقٌ لَا وَسَطٌ بِذَا عُرِفْ وَمَنْ يَكُنْ لِشَيْخِهِ قَدْ أسْقَطَا … ذاَكَ مُدَلَّسٌ كَمَا قَدْ ضُبِطَا أمَّا الغَرِيبُ فَهْوَ مَا رَوَاهُ … فَرْدٌ مِنَ الرُّوَاةِ لَا سِوَاهُ وَمَنْ يَكُنْ قَدْ خَالَفَ الثَّقاتِ … حَديْثُهُ شَذَّ لَدَى الرُّوَاةِ وَالمُنْكَرُ الَّذِي لِمَتْنِهِ جُهِلْ … مِنْ غَيْرِ رَاوِيْهِ وَلَمْ يَكُنْ قُبِلْ وَمَا رُوِيْ (1) مِنْ أَوْجُهٍ مُخْتَلِفَهْ … عَنْ وَاحِدٍ مُضْطَرِبٌ فَلْتَعْرِفَهْ وَآخِرُ الأقسَامِ مَا كَانَ وُضِعْ … وَعَزْوُهُ إِلَى النَّبِيِّ قَدْ مُنِعْ وَنَاظِمُ الأَقْسَامِ لِلْبَيَانِ … هُوَ الفَقِيْرُ عَابِدُ الرَّحْمَنِ نَجْلُ أبي بِكْرِ الشَّهِيرِ ذِي الحَسَبْ مَنِ ارْتَقَى بِعِلْمِهِ أَعْلَى الرُّتَبْ عَلَيْهِ رَحْمَةُ الإلَهِ الخَالِقِ … الوَاسِعِ الرَّحْمَةِ لِلْخَلَائِقِ ثُمَّ صَلَاةُ اللهِ وَ السَّلَامُ … عَلَى الَّذِي ظلَّلَهُ الغَمَامُ مُحَمَّدٍ وَآلِهِ الأَطْهَارِ … وَصَحْبِهِ مَشَارِقِ الأَنْوَارِ مَا نَزلَ الوَدْقُ مِنَ السَّحَابِ … وَمَا بَدَى البَدْرُ مِنَ الغِيَابِ",
    "foot_note": "1. تسكين الياء هنا ضرورة شعرية.",
    "book_id": "797",
    "new_page_number": 12
  },
  {
    "serial_number": "3349064",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 10,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرحيم  مقدمة الناظم رحمه الله. (1) يَا سَائِلي عَنِ الحَدِيثِ مُرْتَقِبْ … أَقْسَامَهُ خُذْها بِنَظْمٍ مُقْتَرِبْ (1) في هذا البيت ينادي الناظم رحمه الله الشخص الذي سأله عن أنواع الحديث، ولعل هذا الشخص أحد طلابه ومريديه في تحصيل العلم، وأحد الملتزمين له، نفهم ذلك من أسلوب الخطاب. ومعنى البيت باختصار: أيها السائل الذي سألتني عن تعريف الحديث، وأنت تنتظر مني بيان أنواع الحديث، إذا اعرف وخذ بيان أنواع الحديث في نظم قريبٍ سهلٍ لا تجد في فهمه صعوبة. في هذا البيت جاء ذكر الحديث، وأود أن أذكر بإيجاز تعريف الحديث والسنة، ليتبين للقارئ الفرق بينهما، فبعون الله أقول: الحديث لغة: الجديد ضد القديم، كما يقال: فلان حديث عهد بالإسلام، وقد يطلق على الكلام، كما يقال: سمعتُ حديثك أي: كلامك، ويقال تحدث فلان، أي: تكلم. والحديث في مصطلح أهل الأثر: ما أضيف إلى رسول الله صلى الله عليه وسلم من قول أو فعل أو تقرير، أو صفة خَلقية، أو خُلقية، ويطلق كثيراً على ما أضيف",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 13
  },
  {
    "serial_number": "3349065",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 11,
    "volume_number": 1,
    "text": "إلى رسول الله صلى الله عليه وسلم من قول. السنة في اللغة: الطريقة المسلوكة، ولها إطلاقات كثيرة، تارة تُطلق على ما عليه دليل من الكتاب أو السنة، أي: على الحكم الشرعي المأخوذ من الكتاب أو السنة، وتارة تطلق على ما يقابل البدعة. والسنة عند الفقهاء: ما ليس بواجب، وتطلق السنة على ما استقر عليه عمل الصحابة. والسنة في اصطلاح أهل الأثر: مرادف للحديث، أي: ما أضيف إلى رسول الله صلى الله عليه وسلم من قول أو فعل أو تقرير أو صفة، إلا أن السنة كثيراً ما تطلق على ما أضيف إلى رسول الله صلى الله عليه وسلم من أفعال، وبذلك ظهر الفرق بين الحديث والسنة من حيث المعنى اللغوي والاصطلاحي حيث أن الحديث كثيراً ما يطلق على أقوال النبي صلى الله عليه وسلم، والسنة كثيراً ما تطلق على أعمال النبي صلى الله عليه وسلم.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 14
  },
  {
    "serial_number": "3349066",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 12,
    "volume_number": 1,
    "text": "النوع الأول: الصحيح (2) إنَّ الصَّحيحَ مَا سَنَدُهُ اتَّصَلْ … بِلَا شُذُوذٍ وَ بضَابِطَيْنَ دَلّْ (2) بهذا البيت بدأ الشيخ الناظم رحمه الله بيان أنواع الحديث، وجدير بالذكر أن الحديث بحسب مصطلحات أهل الحديث يتنوع إلى أنواع كثيرة، ولكل نوع مصطلح أو اسم خاص أطلق عليه علماء الحديث، ولا ينقسم الحديث في نفسه أو في حد ذاته إلا إلى ثلاثة أقسام: الصحيح، الحسن، الضعيف. ولا يُعدُ سائر الأنواع مثل: المرفوع، الموصول، الموقوف، المنقطع أقساماً للحديث، لأن كل قسم لا يجتمع مع قسيمه، فمثلاً الضعيف لا يجتمع مع الصحيح، فلا يصح أن نقول هذا الحديث صحيح وضعيف. وأما النوع فيجتمع مع نوعه الآخر، فيصح أن نقول: هذا الحديث مرفوع موصول، صحيح، إذاً ما يأتي ذكره في نظم الشيخ رحمه الله وجعل الجنة مثواه- ذكر لنا في البيت الثاني من منظومته تعريف الحديث الصحيح، فقال: الصحيح، أي الحديث الصحيح: ما سنده اتصل، أي هو الحديث الذي اتصل سنده بلا شذوذ،",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 15
  },
  {
    "serial_number": "3349067",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 13,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . أي: لا يكون متنه شاذاً وبضابطين دلَّ، أي: روي برواية ونقلِ رواةٍ عدول ضابطين، فقوله في آخر البيت: وبضابِطِينْ هو بصيغة الجمع المذكر السالم المجرور بالياء، فلا يُظن أنه مثنى. فتعريف الحديث الصحيح بالاختصار هو: \"الحديث الذي اتصل سنَدُه بنقل العدل الضابط عن مثله إلى منتهاه من غير ولا علةٍ\"، فبالنظر إلى تعريف الحديث الصحيح يتبين لنا أنه لا بد من وجود الشروط الخمسة التالية في حديث ما ليُسَمى حديثاً صحيحاً وهي: 1 - اتصال السند، ومعناه: أن كل راوٍ من رواته قد أخذه مباشرة عمّن فوقه، من أول السند إلى منتهاه. 2 - عدالة الرواة، أي أن كل راوٍ من رواته اتصف بكونه مسلماً بالغاً عاقلاً، غير فاسق، وغير مخروم المروءة. 3 - ضبط الرواة، أي: أن كل راوٍ من رواته يكون تام الضبط، إما ضبط الصدر أو ضبط الكتاب. 4 - عدم الشذوذ، أي: بعد وجود الشروط الثلاثة المذكورة لا يكون متن الحديث شاذاً، والشذوذ: مخالفة الثقة لمن هو أوثق منه.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 16
  },
  {
    "serial_number": "3349068",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 14,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . 5 - عدم العلة: أي: لا يكون الحديث معلولاً والمراد من العلة في هذا الشرط هو: السبب الخفي الغامض الذي يقدح في وجوده في صحة الحديث، ولا يُدرِكُه إلا الجهابذة والحذاق من المحدثين، ويبدو ظاهر السند والحديث سالماً من هذه العلة، فإذا اختل شرط واحد من هذه الشروط الخمسة (التي) لا يُسمَّى الحديث حينئذ حديثاً صحيحاً.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 17
  },
  {
    "serial_number": "3349069",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 15,
    "volume_number": 1,
    "text": "النوع الثاني: الحسن (3) والحسن المعروف دون الأول … رجاله لا كالصحيح المعتلي (3) ذكر الناظم رحمه الله في هذا البيت تعريف القسم الثاني من أقسام الحديث، ألا وهو: الحديث الحسن، فقال رحمه الله: الحديث الحسن هو: الحديث الذي يكون معروفاً عند المحدثين، لكنه لم يصل إلى درجة الصحيح، ورجال إسناده لا تكون لهم درجة عالية كما هي لرجال درجة الصحيح، هذا هو معنى البيت في تعريف الحديث الحسن، ويمكننا أن نذكر تعريف الحديث الحسن بالاختصار: الحديث الحسن هو: الحديث الصحيح، إذا خف ضبط راويه، أي: قلَّ ضبطه، يعني: الحديث الحسن الذي يوجد فيه شروط الحديث الصحيح من اتصال السند، وعدالة الرواة، مع ضبطهم وخلوه من الشذوذ والعلة، ولكن رواته لا تبلغ في الضبط درجة رواة الصحيح.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 18
  },
  {
    "serial_number": "3349070",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 16,
    "volume_number": 1,
    "text": "النوع الثالث: الضعيف (4) أما الضعيف، فهو دون الحسنِ … لفقده شروطه فاستَبِنِ (4) ذكر الناظم رحمه الله في هذا البيت تعريف القسم الثالث من أقسام الحديث، ألا وهو الحديث الضعيف، وقال رحمه الله: الحديث الضعيف هو الحديث: الذي يكون أدنى مرتبة من الحديث الصحيح، لعدم وجود شروط الحديث الحسن فيه، ونتذكر نحن أن شروط الحديث الصحيح والحسن خمسة: 1 - اتصال السند. 2 - عدالة الرواة. 3 - ضبط الرواة. 4 - خلو الحديث من الشذوذ. 5 - خُلُّوه من العلة الخفية. 6 - وإذا فُقِدت هذه الشروط، أو واحد منها في حديثٍ ما ينزل درجة الحديث الضعيف، ثم للضعف مراتب، أدناها: أن يكون راويه سيُئ الحفظ، يعني: يوجد فيه الشروط الخمسة المذكورة سابقاً، لكن رواته أو واحد من رواته يكون سيئَ الحفظ، لا يستطيع أن يحفظ إلا بمحاولات وصعوبات كثيرة، وإذا حفظ ينساه سريعاً، وأعلى درجات الحديث الضعيف أن يكون راويه كذاباً وضَّاعاً، وهذا النوع من الراوي لا يُنظر إلى روايته ولا يُقبلُ كلامه البتَّة.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 19
  },
  {
    "serial_number": "3349071",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 17,
    "volume_number": 1,
    "text": "النوع الرابع: المرفوع (5) وَمَا عُزِيْ إِلَى النَّبِيِّ أَو نُسِبْ … فَذَا هُوَ المَرْفُوعُ فَاحْفَظْهُ تُصِبْ (5) ذكر الناظم -رحمة الله عليه- في هذا البيت نوعاً من أنواع الحديث، وهذا النوع عند المحدّثين يُسمَى: المرفوع، وتعريف المرفوع -كما ذكره الناظم رحمه الله: هو الحديث الذي عُزِيَ، أي: نُسِبَ إلى النبي صلى الله عليه وسلم، وفي آخر البيت طَلَبَ منَّا الناظم -رحمة الله عليه- بقوله: فاحفظه: أي احفظ تعريف الحديث المعروف كما ذكرتُ لك، وقوله: تُصِبْ: جواب الأمر، أي: إذا حفظت تعريف الحديث المرفوع وعرفتَه، تكون مصيباً في رأيك وقولك. اعلم أيها القارئ الكريم: أن الحديث المرفوع يصحّ أن يكون حديثاً صحيحاً، أو حديثاً حسناً، أو حديثاً ضعيفاً، يحتمل أن يكون ضعفه بسبب الإرسال- أي: حذف الصحابي - أو بسبب الانقطاع- أي: بإسقاط أحد الرواة من السند-، أو بسبب الإعضال، -أي: إسقاط الراويين المتتاليين من الإسناد-، أو بسبب الاضطراب، - أي: الاختلاف في الرواية عن الراوي الواحد في المتن أو السند-، دون وجود وجه الترجيح.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 20
  },
  {
    "serial_number": "3349072",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 18,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . وسنذكر - إن شاء الله - فيما بعد في آخر المنظومة مثالاً تطبيقياً لأنواع الحديث المذكورة في هذه المنظومة، فلتراجعه لترسيخ المعلومات لديك، ولكني أود أن أذكر في هذا المقام أنواع الحديث المرفوع مع الأمثلة، فأقول: الحديث المرفوع أربعة أنواع: الأول: المرفوع القولي، مثاله: أن يقول الصحابي أو غيره: قال الرسول صلى الله عليه وسلم: كذا … الثاني: المرفوع الفعلي، مثاله: أن يقول الصحابي أو غيره: (فعل رسول الله صلى الله عليه وسلم كذا … الثالث: المرفوع التقريري، مثاله: أن يقول الصحابي أو غيره: (فُعل بحضرة النبي صلى الله عليه وسلم كذا، ولا يروي إنكاره لذلك الفعل). الرابع: المرفوع الوصفي، مثاله: أن يقول الصحابي أو غيره: (كان رسول الله صلى الله عليه وسلم أحسن الناس خلقاً).",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 21
  },
  {
    "serial_number": "3349073",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 19,
    "volume_number": 1,
    "text": "النوع الخامس: الموقوف (6) وما على قول الصحابي قصر … فذا هو الموقوف يا ذا المبتصر (6) الناظم رحمه الله ذكر في هذا البيت تعريف الحديث الموقوف، فقال: الحديث الذي يكون مقصوراً على قول الصحابي، فهو يسمى موقوفاً. وقول الناظم رحمه الله في آخر البيت: يا ذا المبتصر، معناه: يا صاحب البصيرة انتبه واحفظ ما ذكرته لك من تعريف الحديث الموقوف. فبالاختصار نقول في تعريف الموقوف: هو ما نُسِب أو أُسند إلى صحابي أو جَمْعٍ من الصحابة، سواء كان ها المنسوب إليهم قولاً، أو فعلاً، أو تقريراً، وسواء كان السند إليهم متصلاً أو منقطعاً. مثال الموقوف القولي: قول الراوي: قال علي بن أبي طالب رضي الله عنه\"حدثوا الناس بما يعرفون، أتريدون أن يكذب الله ورسوله\". مثال الموقوف الفعلي: قول الإمام البخاري: \"أَمَّ ابنُ عباس وهو متيمّم\". ومثال الموقوف التقريري: قول بعض التابعين-مثلاً-: \"فعلت كذا أمام الصحابة، ولم يُنكر عليَّ\".",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 22
  },
  {
    "serial_number": "3349074",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 20,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . وجدير بالذكر أن بعض المحدثين -وبالأخصّ الخراسانيين*- يسمون الحديث الموقوف أثراً، والحديث المرفوع خبراً.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 23
  },
  {
    "serial_number": "3349075",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 21,
    "volume_number": 1,
    "text": "النوع السادس: الموصول (7) وما بإسناد له قد اتصل … فذا هو الموصول حيثما حصل (7) الناظم رحمه الله يبين لنا في هذا البيت أنَّ الحديث الذي يكون له إسناد متّصل من الراوي إلى النبي صلى الله عليه وسلم، أو إلى الصحابي- يعني: لا يكون في إسناده انقطاع وإرسال، يسمَّى حديثاً موصولاً. إذاً يمكننا أن نقول: الحديث الموصول هو: الحديث الذي يكون إسناده متصلاً من أوله إلى آخره، أي: من أول الإسناد إلى آخر الإسناد، وهو النبي صلى الله عليه وسلم أو الصحابي، مثلاً قال الإمام البخاري في صحيحه عندما روى أول حديث في كتابه: \"حدثنا الحُمَيدي، قال: حدثنا سفيان، قال: حدثنا يحيى بن سعيد الأنصاري، قال: أخبرني محمد بن إبراهيم التيمي: أنه سمع علقمة بن وقاص الليثي يقول: سمعت عمر بن الخطاب رضي الله عنه على المنبر قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى دنيا يصيبها أو إلى امرأة ينكحها، فهجرته إلى ما هاجر إليه\"، فهذا الحديث يسمّى موصولاً؛ لاتصال إسناده من الإمام البخاري إلى النبي صلى الله عليه وسلم \"، بمعنى:",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 24
  },
  {
    "serial_number": "3349076",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 22,
    "volume_number": 1,
    "text": "أن كل واحد من الرواة في السند سمع الحديث عن شيخه، وذلك من أول الإسناد إلى آخره، ثم بعد ذلك يجوز لنا أن نقول: إن الحديث الموصول يصح أن يكون حديثاً مرفوعاً، صحيحاً، أو حسناً لعدم التباين أو التناقض بين هذه الأنواع. والله أعلم بالصواب.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 25
  },
  {
    "serial_number": "3349077",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 23,
    "volume_number": 1,
    "text": "النوع السابع: المرسل (8) ومرسل ما التابعي قد رفع … كقوله: عن النبي المُتَّبَع (8) في هذا البيت من المنظومة نجد تعريف الحديث المرسل، فالمرسل في اللغة: اسم مفعول من أرسل يرسل إرسالاً، ومعنى أرسله، أي: أطلقه، وتركه. والمرسل في اصطلاح المحدثين كما ذكره الناظم رحمه الله هو: الحديث الذي رفعه- أي: نسبه التابعي إلى النبي صلى الله عليه وسلم مثلاً لو قال: سعيد بن المسيب، أو قتادة بن دعامة، أو محمد بن سيرين، أو الحسن البصري، وأمثالهم: قال النبي صلى الله عليه وسلم، أو عن النبي صلى الله عليه وسلم أنه قال كذا، أو فعل كذا، أو أقرَّ كذا، فهذا الحديث يسمى مرسلاً، لأن التابعي ترك في الإسناد ذكر الصحابي، كأنه أطلق الإسناد من الاتصال. والحديث المرسل: حديث ضعيف عند المحدثين، لا يجوز الاحتجاج به، وأجاز الاحتجاج به بعض الفقهاء كالإمام أبي حنيفة، ومالك، وأحمد رحمهم الله بشرط أن يكون مرسل التابعي، والإمام الشافعي رحمه الله يجيز الاحتجاج بمرسل كبار التابعين بشروط، وليس هذا مقام بسطها، لكن مرسل الصحابي حجة باتفاق جمهور المحدثين والفقهاء. ومرسل الصحابي هو: أن يسمع واحداً من صغار الصحابة، كابن عباس، وابن عمر، وابن الزبير رضي الله عنهم مثلاً حديثاً عن أحد",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 26
  },
  {
    "serial_number": "3349078",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 24,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . كبار الصحابة، ثم في أثناء الرواية ينسبه أو يرويه مباشرة عن النبي صلى الله عليه وسلم، فهذا النوع من الرواية يسمى مرسل الصحابي. والله الموفق.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 27
  },
  {
    "serial_number": "3349079",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 25,
    "volume_number": 1,
    "text": "النوع الثامن: المقطوع (9) وما أتى عن تابع موقوفاً … فذاك مقطوعٌ أتى معروفاً (9) وقد اصطلح المحدثون في فنون الحديث أن يسمّون قول التابعي أو فعله: حديثاً مقطوعاً، وقد ذكر الناظم رحمه الله في هذا البيت تعريف الحديث المقطوع، فقال: ما أتى، أي: رُوي عن التابعي موقوفاً، أي: من قوله أو فعله، فهذا يسمّى مقطوعاً، هكذا اشتهر وعُرف في مصطلح المحدثين. والمقطوع من أنواع الحديث الضعيف، لا يجوز الاحتجاج به عند أهل العلم. والله الموفق.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 28
  },
  {
    "serial_number": "3349080",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 26,
    "volume_number": 1,
    "text": "النوع التاسع: الحديث المنقطع (10) وما لآحاد رواته سقط … منقطع عن الصحيح قد هبط (10) في هذا البيت من المنظومة ورد تعريف المنقطع، وهذا المصطلح عند المحدثين مورده إسناد الحديث، فالانقطاع: وصف الإسناد، لا المتن، لكن متن الحديث قد يوصف بالمنقطع أيضاً، وذلك باعتبار إسناده. الحديث المنقطع --ما ذكره الناظم رحمه الله هو: الحديث الذي سقط من إسناده راوٍ واحد، سواء كان في موضع أو في موضعين متفرقين، لأنه لو وقع الانقطاع في موضعين متتاليين يسمَّى معضلاً. وقول الناظم --ليه الرحمة-: عن الصحيح قط هبط، يعني: أن الحديث المنقطع قد هبط -أي: نزل- عن مرتبة الحديث الصحيح، إذاً الحديث المنقطع حديث ضعيف، لا يجوز الاجتجاج به، والله الموفق للصواب.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 29
  },
  {
    "serial_number": "3349081",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 27,
    "volume_number": 1,
    "text": "النوع العاشر: الحديث المعضل (11) والمعضل: الساقط منه اثنان … على التوالي فاتّبع بياني (11) الناظم رحمه الله ذكر في هذا البيت تعريف نوع من أنواع الحديث الضعيف، ألا وهو: الحديث المعضل، فقال: الحديث المعضل هو: الحديث الضعيف، ألا وهو: الحديث المعضل، فقال: \"الحديث المعضل هو: الحديث الذي سقط من إسناده راويان على التوالي، أي: متواليين\"، ثم طلب من القارئ لهذه المنظومة أن يتّبع بيانه، أي: يقبل قوله في تعريف المعضل؛ لأنه لا تعريف له غير ما ذكر. نريد أن نوضح معنى المعضل بذكر مثال: \"القعنبي عن مالك: أنه بلغه أن أبا هريرة قال: قال رسول الله صلى الله عليه وسلم: للمملوك طعامه وكسوته بالمعروف، ولا يُكلف من العمل إلا ما يطيق\"، هذا الحديث إسناده معضل، لأنه سقط من إسناده اثنان متواليان بين الإمام مالك رحمه الله وأبي هريرة رضي الله عنه .. الحديث إلى آخره. قيل لهذا النوع من الإسناد: معضل؛ لأن معضل اسم مفعول من أعضل، أي: أعياه وأتعبه، كأن الراوي إذا أسقط من الإسناد راويين أعياه، يعني: صار متعباً وضعيفاً، لا يتحمّل إسناد الحديث واتكائه عليه.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 30
  },
  {
    "serial_number": "3349082",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 28,
    "volume_number": 1,
    "text": "النوع الحادي عشر: المعلق (12) وما من الإسناد أولاً حذف … معلق لا وسط بذا عُرف (12) معنى البيت: الحديث الذي حُذف من أول إسناده رواةٌ يسمّى معلقاً، وأما إذا حذف من وسطه فلا يسمّى معلقاً، هذا هو المعروف بين المحدثين. أهـ. أقول: معلّقات الإمام البخاري معروفة، وهي ما ذكرها بدون إسناد ترجمة الباب، أو في ترجمة الباب قبل البدء برواية الحديث مسنداً، فمثلاً في صحيح البخاري رحمه الله في كتاب المساقاة، باب رقم (17) أي: \"باب الرجل يكون له ممرٌ أو شربٌ في حائط أو نخلِ\"، هذه الجملة تسمّى ترجمة الباب، وبعد هذه الجملة قال الإمام البخاري: \"قال النبي صلى الله عليه وسلم: من باع نخلاً بعد أن تؤبر، فثمرتها للبائع … إلخ\"، فقول الإمام البخاري: \"قال النبي صلى الله عليه وسلم … إلخ\" يسمّى معلقاً، لأنه حذف إسناد الحديث من أوّله. الإمام البخاري بعد ذكر هذا المعلّق روى حديثاً مسنداً، وفي آخر الحديث قال: \"وعن مالك، عن نافع، عن ابن عمر، عن عُمر في العبد\"، هذه الرواية أيضاً من المعلقات، لأن الإمام البخاري حذف سنده إلى الإمام مالك رحمه الله.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 31
  },
  {
    "serial_number": "3349083",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 29,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . والمعلقات في غير صحيح البخاري من نوع الحديث الضعيف، وقد تتبع المحدّثون المعلقات في صحيح البخاري فوجدوا غالبيتها مسندةَ من قبيل الصحاح والحسان. والله الموفق.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 32
  },
  {
    "serial_number": "3349084",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 30,
    "volume_number": 1,
    "text": "النوع الثاني عشر: المدلس (13) ومن يكن لشيخه قد أسقطا … ذلك مدلس كما قد ضُبِطا (13) معنى البيت: إذا أسقط الراوي اسم شيخه الذي سمع منه الحديث عند رواية الحديث، يعني: لم يذكره، بل يذكر مَن فوقه، فهو يسمّى: المدلّس-بكسر اللام، اسم الفاعل- وحديثه الذي رواه بغير ذكر اسم شيخه يسمَّى: المدلَّس -بفتح اللام، اسم مفعول- وعمله هذا يسمَّى: التدليس. التدليس لغة: كتمان عين السلعة عن المشتري، وأصل التدليس مشتق من الدلس، وهو الظلمة، أو اختلاط الظلام، فكأ، المدّلس -بكسر اللام- أظلم وأخفى أمر الحديث على من يسمعه، فصار الحديث: مدلَّساً -بفتح اللام-. والتدليس في الاصطلاح: إخفاء عيب في الإسناد، وتحسين لظاهره. ثم التدليس نوعان:  النوع الأول: تدليس الإسناد ، وهو: الذي ذكر تعريفه الناظم رحمه الله في هذا البيت، وبيّنا معناه سابقاً، ونزيد هنا ممثلين صورة هذا النوع من التدليس، فنقول: فَرضاً راوٍ اسمه عليّ، عاش مع شيخ باسم: محمد في عصر واحدٍ، ولقيه وسمع منه أحاديث، ثم سمع شخصاً آخر اسمه: سليمان، يروي عن شيخه: محمد، فكتب عنه حديثاً، فإن روى عليُّ الحديث المذكور عن سليمان، عن محمد، يكون إسناده موصولاً، وأما إذا",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 33
  },
  {
    "serial_number": "3349085",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 31,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . كان رواه عن محمد مباشرة بلفظ: قال، أو: عن، موهماً أنه سمعه منه، وحذف شيخه، سليمان، فقد دلَّس بهذا العمل تدليس الإسناد، لأنه حذف شيخه الذي سمع منه الحديث وكتب عنه، ونسبه لشيخٍ فوقه بلفظ يحتمل سماع الحديث المذكور عنه، ويحتمل عدم السماع.  النوع الثاني: تدليس الشيوخ ، وهو: إخفاء الراوي أمر شيخه عن السامع، بأن يذكره عند الرواية باسم وكنية له غير معروفين، مثلاً: الإمام البخاري رحمه الله معروف لدى الجميع باسم: أبي عبد الله محمد بن إسماعيل البخاري، وقد جاء في سلسلة نسبه: ابن بردزبه الجعفي -يسمَّى هذا الراوي مدلِّساً، لأنه ذكر شيخه باسم غير معروف، فكأنه أراد أن يستره، ويخفيه عن الناس، لئلا يعرفوه. حكم التدليس والمدِّلس: التدليس مكروه عند المحدثين وتشتد كراهيته إذا كان الغرض منه إخفاء حال الراوي الضعيف. ومن المحدثين من قال: التدليس أخو الكذب، المَّدلس ضعيف إذا كان غرضه سيئاً، والرواية التي فيها التدليس غير مقبولة، ولكن المدلس",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 34
  },
  {
    "serial_number": "3349086",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 32,
    "volume_number": 1,
    "text": "إذا روى حديثاً آخر بدون التدليس، وصرَّح السماع به تقبل روايته.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 35
  },
  {
    "serial_number": "3349087",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 33,
    "volume_number": 1,
    "text": "النوع الثالث عشر: الغريب (14) أما الغريب فهو ما رواه … فردٌ من الرواة لا سواه (14) أراد الناظم رحمه الله أن يُبين لنا في هذا البيت من منظومته تعريف الحديث الغريب، فقال: أمَّا الغريب -يعني الحديث الذي يوصف بالغريب- هو: الحديث الذي رواه راوٍ واحد فقط. يعني: لا يكون له إلا راوٍ واحدٍ، وإن كان مشهوراً في ألسِنَة الناس، فمثلاً: حديث \"إنما الأعمال بالنيات\" يسمّى حديثاً غريباً؛ لأنه لم يَرْوِه من الصحابة: إلا عمر رضي الله عنه، ولم يَرْوِه عن عمر رضي الله عنه إلا علقمة بن وقاص الليثي، ولم يروع عن علقمة إلا محمد بن إبراهيم التيمي، ولم يروه عن محمد بن إبراهيم التيمي إلا يحيى بن سعيد الأنصاري، ثم رواه عن يحيى بن سعيد بمئات من الناس، والحديث غريب له راوٍ واحدٍ في طبقة الصحابة، والتابعين، وتبعهم، ولهذا لا يجوز أن يكون الحديث غريباً صحيحاً، أو حسناً موصولاً، مرفوعاً أو موقوفاً. والله أعلم بالصواب.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 36
  },
  {
    "serial_number": "3349088",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 34,
    "volume_number": 1,
    "text": "النوع الرابع عشر: الحديث الشاذ (15) ومن يكن قد خالف الثقات … حديثه شُذَّ لدى الرواة (15) أراد الناظم -رحمة الله عليه- في هذا البيت تعريف الحديث الشاذ، فقال: إذا خالف راوي الحديث الثقات فحديثه يسمّى شاذاً عند المحدثين، يعني: عدد من الرواة ثقات -مثلاً- رووا حديثاً عن أبي هريرة رضي الله عنه وقام راوٍ واحد، وهو ثقة، رواه عن ابن عمر رضي الله عنه فروايته هذه تسمّى رواية شاذّة، وكذا إن اتفق عدد من ثقات الرواة في لفظ الحديث، وقام راوِ آخر وهو ثقة خالفهم في اللفظ، فحديثه يسمّى شاذّاً.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 37
  },
  {
    "serial_number": "3349089",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 35,
    "volume_number": 1,
    "text": "النوع الخامس عشر: الحديث المنكر (16) والمنكر الذي لِمتنه جُهِل … من غير راويه ولم يكن قُبِل (16) ذكر الناظم رحمه الله في هذا البيت تعريف الحديث المنكر. والمنكر: اسم مفعول من باب الإنكار، ونحن نعلم أن الإنكار مبدَؤُه الجَهْلُ، إذا لا يجهل شخصٌ شيئاً إلا ينكره، فلأجل ذلك قال الناظم رحمه الله في تعريف الحديث المنكر: هو الحديث الذي يكون متنه مجهولاً عند الرواة، لا يعرفه غير الذي رواه، وهناك وصف آخر للراوي الذي تكون روايته من المنكرات؛ ذكر في كتب المصطلح، ألا وهو: الضعف، الضعف الذي جعل تفرّده بالرواية غير مقبولة، فإذا كان الراوي ضعيفاً وتفرّد برواية حديثٍ مّا، خالف فيه الثقات، يقال لحديثه: منكر، وسبق أن ذكرنا في تعريف الحديث الشاذّ أن الراوي إذا كان ثقة وخالف الثقات يسمّى حديثه شاذّاً، وهذا هو الفرق بين الشاذّ والمنكر، ويلاحظ: أن الحديث الذي يكون مقابل الشاذ أو المنكر يسمّى مرفوعاً ومحفوظاً. والله أعلم.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 38
  },
  {
    "serial_number": "3349090",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 36,
    "volume_number": 1,
    "text": "النوع السادس عشر: المضطرب (17) وما روي من أوجه مختلفة عن واحد مضطرب فلتعرفه (17) هذا هو تعريف الحديث المضطرب، الحديث المضطرب -كما عرفه الناظم- رحمة الله عليه - هو: الحديث الذي يرويه عدد من الرواة عن شيخ واحد، ولكن يختلفون في روايتهم إما في إسناد الحديث، أو في متن الحديث، ولا يمكن الترجيح بين وجوه الاختلاف. وقول الناظم رحمه الله: فلتعرفه، فعل مضارع للمخاطب مبدوءٌ بفاء التعقيب ولام الأمر، يأمرنا الناظم -عليه سحائب الرحمة- بأن نعرف ونحفظ تعريف الحديث المضطرب كما ذكره. وأنا أضرب لذلك مثالاً؛ للإيضاح: ثلاث من الرواة رووا عن سعيد بن المسيب عن أبي هريرة رضي الله عنه حديثاً رواه واحد منهم، متصلاً مرفوعاً حيث قال: عن سعيد بن المسيب عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم، ورواه الثاني موقوفاً، حيث قال: عن سعيد بن المسيب عن أبي هريرة رضي الله عنه، ورواه الثالث مرسلاً، حيث قال: عن سعيد بن المسيب، عن النبي صلى الله عليه وسلم، ولا نستطيع أن نرجح رواية واحد منهم على الآخَرِين، لأنهم من حيث القوة والعدالة في درجة واحدة. فنسمي اختلافهم هذا على سعيد بن المسيب: اضطراباً في الإسناد، ولو اختلفوا في لفظ الحديث نسمّيه: اضطراباً في المتن، والله أعلم.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 39
  },
  {
    "serial_number": "3349091",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 37,
    "volume_number": 1,
    "text": "النوع السابع عشر: الموضوع (18) وآخر الأقسام ما كان وُضع وعزوه إلى النبي قد مُنِع (18) يعني: آخر أنواع الحديث هو الحديث الذي كان موضوعاً. والحديث الموضوع هو: الكلام الذي نسبه أحد الرواة إلى النبي صلى الله عليه وسلم كذباً وافتراءً، ثم بين الناظم رحمه الله في الشطر الثاني من البيت حكم الحديث الموضوع بقوله: (وعزوه إلى النبي قد مُنِع)، يعني: نسبة الحديث الموضوع إلى النبي صلى الله عليه وسلم ممنوع ومحرم عند علماء المسلمين. قول الناظم - رحمة الله عليه -: (وآخر الأقسام) لا شك أنه يريد آخر الأقسام المذكورة في هذه المنظومة، والمراد بالأقسام الأنواع، فلعله رحمه الله ذكر في هذه المنظومة أنواع الحديث وعلومه. الأنواع التي رآها مهمة لطالب علم الحديث المبتدئ، وترك الباقي لأنها لا تدور على ألسنة طلاب الحديث كثيراً، فذكر الناظم - رحمة الله عليه - في هذه المنظومة (17) سبعة عشر نوعاً من أنواع الحديث وعلومه؛ ولا شك في أنّ ما ذكره هي الأنواع المهمة، ويحتاج الطالب لمعرفتها عند دراسته لكتب الحديث. وها أنا أذكر عناوين الأنواع الباقية مع بيان معانيها بالإيجاز إتماماً للفائدة، فأقول:",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 40
  },
  {
    "serial_number": "3349092",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 38,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . .  [النوع] الثامن عشر من أنوع الحديث وعلومه: معرفة المسند: المسند من الحديث هو: الحديث الذي رُويَ بالإسناد، مثلاً: إذا قلنا: قال النبي صلى الله عليه وسلم: \"خيركم من تعلم القرآن وعلمه\" هذا يسمّى حديثاً، ولكنه ليس مسنداً، أما إذا قلنا: عن عثمان بن عفان رضي الله عنه قال: قال النبي صلى الله عليه وسلم؛ فحينئذٍ يسمّى مسنداً.  النوع التاسع عشر من أنواع الحديث وعلومه: المُدْرَجُ المدرج اسم مفعول من الإدراج، ومعناه: الإدخال، فإذا أدرج الراوي من عنده كلاماً في إسناد الحديث أو متنه يسمّى الحديث مدرَجاً -بفتح الراء- فمثلاً: إذا كان سند الحديث: عن قتادة عن أنس قال: قال النبي صلى الله عليه وسلم … فجاء الراوي وزاد من عنده: (عن قتادة بن دعامة، عن أنس)، يعني: ذكر اسم والد قتادة، فعمله هذا يسمى: إدراجاً، والسند: مدرجاً. جاء في الحديث رواه الإمام البخاري: «كان النبي صلى الله عليه وسلم يتحنث في غار حراء\". ذكر الراوي من عنده تفسير التحنث، وقال: هو تعبد الليالي ذوات العدد، فهذا يسمَى: المدرج في المتن.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 41
  },
  {
    "serial_number": "3349093",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 39,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . .  النوع العشرون: المقلوب المقلوب من الحديث إما أن يكون متناً، أو إسناداً، فإن رؤى أحد من الرواة حديثاً، وجعل آخر المتن أوله، وأوله آخره، فهذا يسمى: مقلوباً في المتن، أما إن جعل إسناد حديث لحديث آخر وإسناد الحديث الثاني للأول فيسمى: مقلوب الإسناد -إن كان قصد الراوي في قلب الأحاديث التعمية والتجهيل للسامعين، فهو عمل قبيح- محرم يقدح في روايته، وإن كان قصده الاختبار ثم بَّين الصحيح وأرجع الحديث إلى أصل لفظه وسنده، فهذا لا بأس به.  النوع الحادي والعشرون: المفرد المفرد في معرفة الأفراد، والمقصود منه تفرد الراوي برواية حديث عن شيخ، ولم يروه الآخرون عنه، وإذا تفرد أهل مدينة من المدن برواية حديث يسمّى أيضاً: من الأفراد، فيقال مثلاً: تفرد به أهل مكة، أو أهل المدينة، أو أهل الكوفة وهكذا. والفرق بين الفرد والغريب: أن الغريب ما لم يكن له إلا راوٍ واحد، والفرد يحتمل أن يكون له أكثر من راوٍ، فكل غريب فردٌ، وليس كل فرد غريباً.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 42
  },
  {
    "serial_number": "3349094",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 40,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . .  النوع الثاني والعشرون: زيادة الثقة يعني: روى عدد من الرواة الثقات حديثاً وعند واحد منهم زيادة، إما في المتن أو في الإسناد لا توجد عند أصحابه، فهل تقبل منه هذه الزيادة أم لا؟ اختلف المحدثون في ذلك، منهم من قبلها على الإطلاق ومنهم من ردها على الإطلاق، ومنهم من ذكر فيها التفصيل، والبسط في هذه المسألة في كتب المصطلح.  النوع الثالث والعشرون: الحديث المعلل وهو الحديث الذي توجد فيه علة خفية لا يكشفها إلا الجهابذة والنقاد من المحدثين، فإذا انكشفت العلة يسمَّى بعد ذلك باسم العلة، إما مرسل، أو منقطع، أو معضل، وهكذا.  النوع الرابع والعشرون: في معرفة من تقبل روايته، ومن لا تقبل؟ وبيان الجرح والتعديل وفي هذا النوع مسائل كثيرة بسطها وتفصيلها في كتب المصطلح، ونحن نقول هنا بالاختصار: المقبول روايته هو: الراوي الثقة الضابط لما يرويه ولو قيل: متى يكون الراوي ثقة، وضابطاً لما يرويه؟ نقول في جوابه:",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 43
  },
  {
    "serial_number": "3349095",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 41,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . إذا اجتمع أو إذا وجد فيه الأوصاف الآتية: 1 - أن يكون مسلاً. 2 - أن يكون عاقلاً. 3 - أن يكون بالغاً. 4 - أن يكون سالماً من أسباب الفسق وخوارم المروءة. 5 - أن يكون متيقظاً غير مغفل، حافظاً إن حدث من حفظه، فاهماً إن حدث على المعنى. فإذا فقد، أو اختل شرط من هذه الشروط الخمسة، ردت روايته، ولا تقبل.  النوع الخامس والعشرون: في كيفية سماع الحديث وتحمله يعني: راوي الحديث كيف يأخذ الحديث من شيخه؟ بيَّن علماء الحديث ثمانية طرق لأخذ الحديث وتحمله من الشيوخ: 1 - السماع من لفظ الشيخ. 2 - القراءة على الشيخ. 3 - أخذ الإجازة من الشيخ. 4 - المناولة أي: إعطاء الشيخ إلى الطالب كتاباً في الحديث من مسموعاته؛ ليرويه عنه.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 44
  },
  {
    "serial_number": "3349096",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 42,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 5 - المكاتبة: يكتب شيخ شيئاً من حديثه لشخص آخر؛ ليرويه عنه. 6 - إعلام الشيخ، يعني إمام من أئمة الحديث يخبر شخصاً معيناً بخبر أن الكتاب الفلاني من مسموعاته من الشيخ الفلاني، ورخص الرواية بمجرد ذلك طوائف من المحدثين والفقهاء، أما إذا قرن الشيخ بإعلامه إجازة الرواية، فهذا يسمى الإجازة، يجوز الرواية بها عند الجمهور. 7 - الوصية، وصورتها أن يوصي شخص بكتاب كان يرويه، لشخص آخر، بأن يعطي له بعد مماته، أجاز الرواية بهذا النوع من التحمل بعض المحدثين قياساً على المناولة والإعلام، واستبعد ذلك الإمام أبو عمرو بن الصلاح صاحب المقدمة في علوم الحديث، ومعنى ذلك أن جمهور المحدثين لا يجيزون الرواية بالوصية. 8 - الوجادة، وصورتها أن نجد في كتاب شخص بخطه، أو بخط غيره حديثاً، فهل يجوز لنا روايته عنه أم لا؟ جمهور العلماء قالوا: يجوز ذلك بشرط أن يقول: وجدت في كتاب فلان بخطه، كما كان يفعله عبدالله ابن الإمام أحمد في كتب أبيه، وكذلك يجوز بلفظ: قال فلان، أو ذكر فلان، ولا يجوز بألفاظ توهم ساع الراوي عن صاحب الكتاب، والله أعلم.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 45
  },
  {
    "serial_number": "3349097",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 43,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . .  النوع السادس والعشرون: كتابة الحديث وضبطه في هذا النوع تكلم العلماء عن طرق كتابة الحديث وكيفيتها وضبط ألفاظ الحديث وأسماء الرواة مع تقيدها في الهامش.  النوع السابع والعشرون: صفة رواية الحديث معناه إذا أخذ وتحمل الراوي الحديث عن شيخه، فكيف يرويه بعد ذلك وفي أي سن يرويه وما هي ألفاظ الرواية، هل يجوز له اختصار الحديث؟ هل يجوز له الرواية بالمعنى؟ نجد تفصيل هذه المسائل في هذا النوع في كتب المصطلح.  النوع الثامن والعشرون: في آداب المحدث من أن يكون جميل الأخلاق حسن الطريقة، صحيح النية، لا يحدث بحضور من هو أولى منه وأعلا درجة في الحديث، وإذا بدأ بالتحديث يعقد مجلس التحديث ويفتتح مجلسه بتلاوة من القرآن الكريم.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 46
  },
  {
    "serial_number": "3349098",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 44,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . .  النوع التاسع والعشرون: في آداب طالب الحديث من الإخلاص في النية وعليه أن يبادر أولاً إلى سماع السند العالي في بلده، ثم يرتحل إلى بلاد أخرى، ويعمل بفضائل الأعمال، ولا يطول على الشيخ في السماع حتى يضجره. ولا يستنكف أن يكتب عمن هو دونه في الرواية والدراية، إلى غير ذلك من الآداب المطلوبة من طالب الحديث.  النوع الثلاثون: معرفة الإسناد العالي والنازل إذا كان رجال إسناد الحديث قليلين يسمى عالياً، وإذا كانوا كثيرين يسمى نازلاً، الإسناد العالي مرغوب فيه؛ لخلوه من العلل، وقل ما يكون الإسناد النازل خالياً من العلة. أما إذا كان رجال الحديث النازل ثقات أقوياء، ورجال الإسناد العالي دونهم فالنازل أولى وأقدم وأرغب فيه. والله أعلم.  النوع الحادي والثلاثون: في معرفة الحديث المشهور الشهرة في الحديث أمر نسبي قد يكون الحديث مشهور في قطر أو بلد، ولا يكون مشهور في غيره. وقد يكون مشهوراً عند الفقهاء ولا يكون مشهوراً عند المحدثين وقد يكون بالعكس. وقد يكون متن الحديث مشهوراً على ألسنة الناس، ويكون سنده غريباً، أو لا يكون له أصل ولا سند، وقد يكون الحديث مشهوراً باعتبار سنده، يعني:",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 47
  },
  {
    "serial_number": "3349099",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 45,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . يزيد عدد رواته في كل طبقة الإسناد على ثلاثة، وهذا النوع من المشهور يسمى مستفيضاً أيضاً. وهذا ما يسمى بالمشهور الاصطلاحي عند المحدثين. والحديث المشهور باعتبار إسناده نوعان: إذا بلغ عدد رواته في كل طبقة الرواية حد التواتر، يعني: يزيد عددهم إلى حد يستحيل العقل تواطؤهم - أي: توافقهم - على الكذب، فحينئذ هذا الحديث متواتراً، هذا هو النوع الأول. وإذا لم يبلغ حد التواتر، يعني: زادت رواته على الثلاثة، ولكن لم يصل إلى حد التواتر، فحينئذ يسمى الحديث مشهوراً في اصطلاح المحدثين.  النوع الثاني والثلاثين: معرفة الغريب والعزيز الغريب من الحديث: ما يكون له راو واحد، وقد تقدم تعريفه في النظم برقم (14)، أما العزيز من الحديث ما رواه اثنان أو ثلاثة بعد الصحابي، وإذا زادت رواته على الثلاثة يسمى مشهوراً كما تقدم.  النوع الثالث والثلاثون: معرفة غريب ألفاظ الحديث هذا النوع يتكلم عن الكليات الغريبة في المتن، أي الكليات التي لا يفهم معانيها بسهولة، تحتاج إلى مراجعة الكتب المؤلفة في هذا النوع، وأشهر كتاب في ذلك: النهاية في غريب الحديث للإمام مجد الدين أبي السعادات: المبارك ابن محمد، المعروف بابن الأثير الجزري (606 هـ).",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 48
  },
  {
    "serial_number": "3349100",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 46,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . .  النوع الرابع والثلاثون: معرفة المسلسل يقال للحديث مسلسل، إذا تتابع وتسلسل صفة من الصفات أو فعل من الأفعال في رواة سنده؛ كأن يقول كل راو من رواته عند الرواية سمعته، أو يقول: حدثنا، أو يقول أخبرنا، أو يقول كل من رواته حدثني فلان وهو يأكل -مثلاً- أو يذهب لصلاة العيد، وإذا كان في إسناد الحديث أربعة رواة مثلاً، وقال كل واحد منهم عند الرواية حدثني فلان وهو يذهب لصلاة العيد، يسمى الحديث: مسلسل العيد، وفائدة التسلسل: التأكد من خلق الإسناد عن الانقطاع والإرسال.  النوع الخامس والثلاثون: معرفة ناسخ الحديث ومنسوخه كما أنا نجد في القرآن الكريم آيات منسوخة وناسخة، كذلك يوجد في الأحاديث ناسخ ومنسوخ، وهذا النوع يتكلم.  النوع السادس والثلاثون: معرفة ضبط ألفاظ الحديث متناً وإسناداً، والاحتراز من التصحيف فيها في هذا النوع ينبه طالب الحديث ألا يقع في الأخطاء والأغلاط؛ فيصحف أو يحرف الكلمات في المتن أو الأسماء في الإسناد، كما وقع ذلك لبعض المحدثين في حديث: «يا أبا عمير ما فعل النُّغير»، فصحفه فقال:",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 49
  },
  {
    "serial_number": "3349101",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 47,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . \"  يا أبا عمير ما فعل البعير\"، وكذلك حرفوا حديث \"صلاة في إثر صلاة كتاب في عليين\"، حرفوه إلى: \"كنار في غلس\". فعلى طالب الحديث أن يكون متيقظاً ومتنبهاً، وعندما يسمع أو يكتب الحديث عن شيخ يضبط ويفيد كلماته بالنقط والشكل والحركات.  النوع السابع والثلاثون: معرفة مختلف الحديث هذا النوع يتكلم عن الكتب المؤلفة في الأحاديث التي يفهم من ظاهرها التعارض فيها بينها ومؤلفو هذه الكتب قاموا بالتفسير والتوجيه بإزالة التعارض والجمع بين الأحاديث. والكتب المشهورة في هذا النوع: مختلف الحديث للإمام الشافعي، وتأويل مختلف الحديث لابن قتيبة، وكتاب مشكل الآثار للإمام أبي جعفر أحمد بن محمد ابن سلامة الطحاوي الحنفي (ت 321 هـ).  النوع الثامن والثلاثون: معرفة المزيد في متصل الأسانيد هو أن يزيد راو في الإسناد رجلا لم يذكره غيره. مثلاً: روى عدد من الرواة حديثاً عن عبدالله بن المبارك، عن عبدالله بن يزيد بن جابر، قال: حدثني بسر بن عبيد الله، فجاء راوٍ آخر، وقال: عن عبدالله بن المبارك، عن سفيان، عن عبدالله بن يزيد -يعني: زاد بين ابن المبارك وابن يزيد",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 50
  },
  {
    "serial_number": "3349102",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 48,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . راوياً آخر وهو سفيان- فهذا النوع من الزيادة يسمى: المزيد في متصل الأسانيد. فإذا كان الراوي الذي زاد ثقة تقبل زيادته، وإلا فلا.  النوع التاسع والثلاثون: معرفة الخفي من المراسيل يعني: إذا كان في إسناد الحديث علة الانقطاع أو الإعضال أو الإرسال، لكنها خفية، لا تفهم من ظاهر الإسناد، لا يفهمها إلا الجهابذة والنقاد من المحدثين، يقال لهذا النوع من الإسناد: الخفي من المراسيل.  النوع الأربعون: معرفة الصحابة هذا النوع يتكلم عن تعريف الصحابي -وهو الذي رأى النبي صلى الله عليه وسلم وآمن به، ومات على الإسلام- وعن عدد الصحابة، ودرجاتهم في الأفضلية والمكثرين منهم في الرواية.  النوع الحادي والأربعون: في معرفة التابعين التابعي هو الذي رأى الصحابي ولازمه، وروى عنه حديثاً أو حديثين.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 51
  },
  {
    "serial_number": "3349103",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 49,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . .  النوع الثاني والأربعون: في معرفة رواية الأكابر عن الأصاغر قد يروي الكبير القدر أو السن أو هما، عمن هو دونه في كل منها أو فيها، وأشهر مثال لهذا النوع: رواية الرسول صلى الله عليه وسلم عن تميم الداري، أنه أخبره عن رؤيته الدجال في تلك الجزيرة التي في البحر. الحديث في صحيح مسلم برقم (2942).  النوع الثالث والأربعون: معرفة المدبج أي: رواية الأقران سَويّي السن والمعاصرين بعضهم عن بعض.  النوع الرابع والأربعون: معرفة الإخوة والأخوات يعني: معرفة أن فلان الراوي للأحاديث، له إخوة وأخوات؛ وهم أيضاً رواة للأحاديث. ولذلك أمثلة كثيرة، مثل: النعمان بن المقرن الصحابي، وإخوته الخمسة كلهم صحابة، ورواة للأحاديث. ومن التابعين: محمد بن سيرين وإخوته الخمسة.  النوع الخامس والأربعون: معرفة رواية الآباء عن الأبناء وهذا كثير، مثاله: رواية أبي داود السجستاني صاحب السنن عن ابنه أبي بكر - عبدالله بن أبي داود-.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 52
  },
  {
    "serial_number": "3349104",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 50,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . .  النوع السادس والأربعون: في رواية الأبناء عن الآباء وهذا أيضاً كثير، كعمرو بن شعيب عن أبيه عن جده: بهز بن حكيم، عن أبيه عن جده: معاوية، وهكذا.  النوع السابع والأربعون: في معرفة رواية السابق واللاحق معناه: اشتراك راويان في الرواية عن شيخ واحد، واحد منها أكبر سناً من الشيخ وتوفي قبل وفاة الشيخ بسنوات، والثاني أصغر سناً من الشيخ وتوفي بعد وفاة الشيخ بسنوات، فيقال للأول السابق، وللثاني اللاحق -مثلاً- الإمام البخاري، وأبو الحسن أحمد بن محمد الخفاف النيسابوري، كلاهما رويا عن: محمد بن إسحاق السراج، لكن الإمام البخاري رحمه الله توفي سابقاً سنة (256 هـ ق)، والخفاف توفي لاحقاً سنة (395 هـ ق) خمس وتسعين وثلاثمائة، فبين وفاتيها مائة وتسع وثلاثون (139).  النوع الثامن والأربعون: معرفة من لم يرو عنه إلا يرو عنه إلا راو واحد من صحابي وتابعي وغيرهم مثال في الصحابة: عروة بن مضرس، صحابي لم يرو عنه إلا عامر بن شراحيل الشعبي، ومثال في التابعين: أبو العشراء الدارمي عن أبيه لم يرو عنه إلا حماد بن سلمة.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 53
  },
  {
    "serial_number": "3349105",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 51,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . .  النوع التاسع والأربعون: معرفة الراوي الذي له أسماء متعددة كمحمد بن سائب الكلبي، فإنه اشتهر بأكثر من أربعة أساء.  النوع الخمسون: معرفة الأسماء المفردة والكني التي لا يكون منها في كل حرف سواه، مثلاً في حرف الألف باسم (أوسط) لا يوجد إلا راوٍ واحد، وهو أوسط بن عمرو البجلي تابعي، وفي حرف التاء باسم (تدوم) لا يوجد إلا واحد، وهو: تدوم بن صبح الكلاعي، وفي حرف الجيم باسم (جيلان) واحد وهو: جيلان بن أبي فروة، تابعي، وهكذا. فقد جمع المحدثون تراجم مثل هؤلاء الرواة وبحثوا عن أحوالهم.  النوع الحادي والخمسون: معرفة الأسماء والكني يعني: معرفة أسماء الرواة وكناهم، منهم من لا يكون له كنية، ومنهم يعرف بالكنية ولا يكون له اسم أصلاً، ومنهم من يكون مشهوراً باسمه وكنيته، ومنهم من له اسم وكنية لكنه مشهور باسمه، لا بكنيته، ومنهم عكس ذلك، وهكذا.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 54
  },
  {
    "serial_number": "3349106",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 52,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . .  النوع الثاني والخمسون: في معرفة ألقاب المحدثين اشتهر الرواة بألقاب متنوعة، مثل غُندر، وغنجار، وصاعقة، وشباب وبندار، وسُنيد، ورسته، وغير ذلك، فلا بد من معرفتها ومعرفة أصحابها، ومعرفة معاني هذه الألقاب؛ لئلا يختلط لقب راوٍ براوٍ آخر، وبالتالي يميز الراوي أحسن تمييز.  النوع الثالث والخمسون: معرفة المؤتلف والمختلف في الأسماء والكني هذا يتعلق بضبط أسماء الرواة وكناهم والتلفظ بها تلفظاً سليماً صحيحاً، ومعنى المؤتلف والمختلف: ما تتفق في الخط صورته، وتفترق في اللفظ صيغته، مثل: -سلام وسلّام- الأول بتخفيف اللام والثاني بتشديدها -وعُمارة وعِمارة-، الأول بضم العين المهملة والثاني بكسرها، ومثل: -حِزام وحَرام- الأول بكسر الحاء المهملة بعدها زاي، والثاني بفتح المهملة بعدها راء. هكذا إذا تركب الاسم من حروف متفقة في الرسم والنطق واختلفت الحركات، أو تركب من حروف متفقة في الرسم واختلف النطق يسمى ذلك مؤتلف ومختلف، يعني: تركيبه واحد ومتفق، ومختلف حركاته ونطقه.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 55
  },
  {
    "serial_number": "3349107",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 53,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . .  النوع الرابع والخمسون: معرفة المتفق والمفترق من الأسماء والأنساب ومعناه: عدد من الرواة أسماؤهم وأسماء آبائهم متفقة ولكن المسميات مفترقة، مثلاً: الخليل بن أحمد، اشتهر في الرواة ستة أشخاص بهذا الاسم، ولاشك أنهم مفترقون، فإذا جمعنا أسماء هذا النوع من الرواة نسميهم: المتفقين في الأسماء والمفترقين في المسميات، وللخطيب البغدادي كتاب قيم في هذا النوع.  النوع الخامس والخمسون: نوع يتركب من المؤتلف والمختلف، والمتفق والمفترق وهو في اصطلاح المحدثين يسمّى بالمتشابه، يعني: إذا كان اسم الرواة متفقاً مع اسم راوٍ آخر، واسم أبيه يكون مؤتلفاً مع اسم أبي الآخر، يسمى هذا النوع بالمتشابه، مثلاً: موسى بن عَلي، وموسى بن عُلي فالاسم موسى وموسى متفقان، ولكن اسم الأب مؤتلفان؛ لأن الأول بفتح العين المهملة، والثاني بضمها، وكذلك إذا كان بالعكس؛ يعني حزام بن أحمد، وحرام بن أحمد فها متفقان ومفترقان في اسم الأب، ومؤتلفان ومختلفان في اسمها.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 56
  },
  {
    "serial_number": "3349108",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 54,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . .  النوع السادس والخمسون: في المتشابهين في الاسم واسم الأب، أو النسبة مع المفارقة في المقارنة هذا متقدم وهذا متأخر، مثاله: يزيد بن الأسود ثلاث من الرواة، والأسود بن يزيد اسم أربع من الرواة مثلاً، وهذا يسمى بالمتشابه بالتقديم والتأخير.  النوع السابع والخمسون: في معرفة الرواة المنسوبين إلى غير أبائهم كمعاذ، ومعوذ ابني عفراء، وكلاهما صحابيان، وعفراء أمها. وبلال بن حمامة المؤذن، أبوه اسمه: رباح. ومثل محمد بن الحنفية، وهو محمد بن علي بن أبي طالب. الحنفية لقب أمه اسمها: خولة، ومثل يعلى بن مُونيّه، ومونيه اسم جدته من أبيه. ومثل ابن تيمية، وهو أحمد بن عبد الحليم ابن عبدالسلام. وتيمية اسم أم أحد أجداده الأبعدين. الإمام أحمد بن حنبل منسوب إلى جده، وهو أحمد بن محمد بن حنبل، أبو بكر بن شيبة منسوب إلى جده، وهو عبد الله ابن محمد بن أبي شيبة، وهكذا.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 57
  },
  {
    "serial_number": "3349109",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 55,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . .  النوع الثامن والخمسون: في النسب التي على خلاف ظاهرها كما يقال لعقبة بن عمر: بدري، لأنه شهد غزوة بدر، بل لأنه سكن بدراً فنسب إليها. خالد الحذّاء، قيل له الحذّاء لأنه كان يجلس عند الحذّائين، ولم يكن منهم، يزيد الفقير، قيل له: فقير لأنه كان يألم من فقار ظهره، ولم يكن فقيراً في المال.  النوع التاسع والخمسون: في معرفة المبهمات من أسماء الرجال والنساء سواء كان في الإسناد، كأن يقول الراوي عن رجل عن أبي هريرة رضي الله عنه قال: أو يكون في المتن، مثل: جاء رجل إلى النبي صلى الله عليه وسلم، أو سألت امرأة النبي صلى الله عليه وسلم، والمحدثون بالبحث عن طرق الحديث والروايات المختلفة، استطاعوا أن يزيلوا كثيراً من الإبهام، سواء كان في المتن أو الإسناد. وللخطيب البغدادي كتاب قيم ومشهور في هذا النوع.  النوع الستون: معرفة وفيات الرواة ومواليدهم، ومقدار أعمارهم اعتنى المحدثون أشد العناية بمعرفة وفيات الرواة، ومقدار أعمارهم؛ لأنهم بذلك يعرفون أن الراوي فعلا لقي شيخه الذي روى عنه أو لا،",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 58
  },
  {
    "serial_number": "3349110",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 56,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . مثلاً - إذا قال الراوي: عن فلان، أو أخبرني فلان، فإذا عرفنا تاريخ وفاة شيخه، وتاريخ ميلاد الراوي؛ نستطيع أن نقول: إنه فعلا سمع منه أو لم يسمع.  النوع الحادي والستون: معرفة الثقات والضعفاء من الرواة وغيرهم هذا الفن من أهم العلوم، وأعلاها، وأنفعها، إذ به تعرف صحة الحديث من ضعفه، وقد صنف المحدثون في ذلك قديماً وحديثاً. من أشهر ذلك كتاب الجرح والتعديل لابن أبي حاتم، وكتاب الثقات لابن حبان، وكتاب تاريخ بغداد للخطيب البغدادي.  النوع الثاني والستون: في معرفة من اختلط في آخر عمره من عناية المحدثين في شأن الرواة أنهم اجتهدوا كل الجهد؛ ليتعرفوا على الرواة اللذين اختلط عليهم محفوظاتهم إما لخوفهم، أو ضرر أصابهم، أو مرض، أو عرض من الأعراض كعبد الله بن لَهيعة، لما ذهب، يعني: ضاع أو فقدت كتبه، اختلط في عقله فمن سمع من هؤلاء قبل اختلاطهم، قبلت روايتهم، ومن سمع بعد ذلك أو شك في ذلك لم تقبل.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 59
  },
  {
    "serial_number": "3349111",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 57,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . .  النوع الثالث والستون: في معرفة الطبقات أي طبقات الرواة من الصحابة وغيرهم. فمثلاً: الصحابة رضي الله عنهم منهم السابقون الأولون من أهل بدر، ومنهم أهل بيعة الرضوان، ومنهم المهاجرون، ومنهم الأنصار، ومنهم النقباء، ومنهم الفقهاء، ومنهم الماهرين في الجهاد والغزو، ومنهم الماهرين في معرفة الأنساب وهكذا الطبقات في التابعين ومن بعدهم.  النوع الرابع والستون: في معرفة الموالي من الرواة والعلماء وقد كان جماعة من سادات العلماء في زمن السلف من الموالي، يعني: عبيداً، ثم عُتِقوا، وصاروا علاء سادات بين الناس.  النوع الخامس والستون: معرفة أوطان الرواة وبلدانهم لم يترك المحدثون ناحية من نواحي حياة رواة الحديث إلا وقد فتشوا عنها، وتعرفوا بها، حتى إنهم حاولوا كل المحاولة ليعرفوا أوطان الرواة وبلدانهم، وبالتالي يصل الحديث عن طريق هؤلاء الرواة بإسناد نقي، وخال من كل أنواع العلل، وإلا حكموا عليه بما يناسب به من الحكم.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 60
  },
  {
    "serial_number": "3349112",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 58,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . أيها القارئ الكريم: انتهى ما كنت أريد من البيان الملخص عن أنواع علوم الحديث، التي لم يتناولها الناظم -رحمة الله عليه- في منظومته كثيراً، وكما قلت سابقاً: لعله تركها لعدم أهميتها عند الطالب المبتدئ، ولكن أنا ذكرت ملخصها إتماماً للفائدة، سائلاً من الله -جل وعلا- الأجر والثواب بما قصدت، وأسأل الله العلي القدير أن ينفع بالمنظومة وشرحها أولاً، وبتتمتها ثانياً، جميع طلاب العلم وأهله، إنه سميع قريب مجيب الدعوات. وها أنا ذا أبدأ بشرح الأبيات الأخيرة من المنظومة، فبعون الله أقول:",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 61
  },
  {
    "serial_number": "3349113",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 59,
    "volume_number": 1,
    "text": "خاتمة الناظم رحمه الله (19) وناظم الأقام للبيان … هو الفقير عابد الرحمن (20) نجل أبي بكر الشهير ذي الحسب من ارتقى بعلمه أعلى الرتب (21) عليه رحمة الإله الخالق … الواسع الرحمة للخلائق (22) ثم صلاة الله والسلام … على الذي ظلَّله الغمام (23) محمد وآله الأطهار … وصحبه مشارق الأنوار (24) ما نزل الودق من السحاب … وما بدا البدر من الغياب الناظم رحمه الله في البيت التاسع عشر، والعشرين من المنظومة، ذكر اسمه ونسبه الشريف، فذكر أنه الفقير إلى الله: عبدالرحمن بن أبي بكر الملا، وأثنى على والده المرحوم بقوله: الذي هو ذا نسب مشهور، والذي ارتقى ووصل بعلمه أعلى المراتب، ثم دعا له بقوله: عليه رحمة الإله الخالق لهذا الكون، الله الذي رحمته واسعة لجميع الخلائق، وذلك في البيت الحادي والعشرين، وفي الأبيات الثلاثة الأخيرة أفاض الناظم رحمه الله الصلاة والسلام على سيدنا ومولانا وحبيبنا محمد بن عبد الله المصطفى الذي كان يظلله السحاب؛ ليحفظه من حر الشمس، وهذا كان معجزة لسيد الأبرار، وكذلك صلى على أهل بيته الطاهرين، وصحابته الذين كانوا ولا يزالون موضع شروق الأنوار، ومنبعها، ما دام ينزل",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 62
  },
  {
    "serial_number": "3349114",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "الزبد في مصطلح الحديث",
    "edition": "الأولى، 1428 هـ - 2007 م",
    "publisher": "دار عمار للنشر والتوزيع - عمان - الأردن",
    "page_number": 60,
    "volume_number": 1,
    "text": "لمطر من السحاب، ويظهر القمر البدر من الغياب، يعني عليهم الصلاة والسلام ما دام الكون موجوداً والدنيا باقية. هذا آخر ما سنحت لي نفسي بشرح هذه المنظومة المباركة القيمة النافعة، في بيان أنواع الحديث وعلومه. والله أسأل أن يجعل عملي هذا خالصاً لوجهه الكريم، ونافعاً مفيداً لطلاب العلم، وأن يجزل لي ولوالديّ الخير والمثوبة، وآخر دعوانا أن الحمد لله رب العالمين، وصلى الله على سيدنا محمد رسول الله، وعلى آله وصحابته أجمعين. آمين. وكان الفراغ من مسودته يوم الاثنين ليلة الثلاثاء الساعة الثانية عشر إلا الربع بتاريخ: ثانية من شهر ذي القعدة لعام أربع مئة وخمس وعشرين بعد الألف من الهجرة النبوية المباركة على صاحبها أفضل الصلاة وأتم التسليم. كتبه د./ فضل الرحمن عبد العليم صافي. المدرس بالمدرسة الصولتية. بمكة المكرمة 8/ 11/ 1425 هـ.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 63
  }
]