[
  {
    "text": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People\nAuthor: عبد العزيز بن مرزوق الطريفي\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "new_page_number": 1
  },
  {
    "text": "sn: 3130\nbook_title: قطعة من شرح الشيخ عبد العزيز الطريفي لبلوغ المرام\nbook_link: https://shamela.ws/book/147\nbook_id: 147\nauthor_name: عبد العزيز بن مرزوق الطريفي\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/494\nauthor_ID: 494\neditor: Null\npublisher: Null\nedition: Null\npages: 84\nvolumes: Null\npagination: [الكتاب مرقم آليا]\ncategory: شروح الحديث\ncategory_id: 7",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "new_page_number": 2
  },
  {
    "serial_number": "2429098",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Hadith Explanations. Book: A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People. Author: Abdul Aziz bin Marzouq Al-Tarefe. Number of Pages: 84 [The book is automatically numbered]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nBook: A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People. Author: Abdul Aziz bin Marzouq Al-Tarefe. Number of Pages: 84 [The book is automatically numbered]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Abdul Aziz bin Marzouq Al-Tarefe. Number of Pages: 84 [The book is automatically numbered]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\n[The book is automatically numbered]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 3
  },
  {
    "serial_number": "2429099",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Explanation of Bulugh al-Maram. Transcription and production supervised by Hamoud Al-Mutairi, may Allah grant him success and help those who aided him. In the name of Allah, the Entirely Merciful, the Especially Merciful. Introduction. Praise be to Allah, the Lord of the worlds. We praise Him, seek His help, ask for His forgiveness, seek His guidance, and repent to Him. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whomever Allah guides, no one can lead him astray, and whomever He leads astray, no one can guide him. I bear witness that there is no deity worthy of worship except Allah, and I bear witness that Muhammad is His servant and Messenger. O Allah, send prayers, peace, and blessings upon Your servant and Prophet Muhammad, and upon his family and all his companions. To proceed:",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 4
  },
  {
    "serial_number": "2429100",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "The study of the Sunnah is among the most important, best, and most honorable of sciences in the sight of Allah, the Glorified and Exalted. One of the greatest means by which seekers draw near to Allah, the Glorified and Exalted, and for which they strive, is seeking the hadiths of the Prophet (peace and blessings of Allah be upon him), as well as caring for [distinguishing] the authentic from the weak among them. For the Sunnah of the Prophet (peace and blessings of Allah be upon him) is revelation (Wahy) from Allah, the Glorified and Exalted, which He revealed to His Prophet (peace and blessings of Allah be upon him) through Gabriel, and it is the peer of the Quran in terms of being authoritative proof. Therefore, Ahlus-Sunnah have agreed that the Sunnah of the Prophet (peace and blessings of Allah be upon him) is revelation from Allah, the Glorified and Exalted. Allah, the Mighty and Majestic, said in His Great Book: {Nor does he speak from [his own] inclination. It is not but a revelation revealed} [An-Najm: 3-4]. This is a declaration from Allah, the Glorified and Exalted, that the Sunnah of the Prophet (peace and blessings of Allah be upon him) is revelation from Allah, the Mighty and Majestic. Based on this, the scholars and their methodology in their compilations have indicated this. Imam Al-Bukhari, may Allah have mercy on him, dedicated the first book in his Sahih as: (The Book of the Beginning of Revelation), signaling that what follows in this book is revelation from Allah the Exalted to His Prophet (peace and blessings of Allah be upon him). Hence, pointing to this, he said in the Book of Monotheism (Tawheed) in his Sahih: (Chapter: The Mention of the Prophet, peace and blessings of Allah be upon him, and His Narration from His Lord). This is a point of agreement among scholars as well. Al-Darimi in his Sunan, Abu Dawud in Kitab al-Marasil, Al-Khatib in Al-Kifayah and Al-Faqih wal-Mutafaqqih, Ibn Abd al-Barr in his book Al-Jami', and Al-Marwazi in Kitab al-Sunnah narrated from Al-Awza'i from Hassan who said: 'Gabriel used to descend upon the Prophet (peace and blessings of Allah be upon him) with the Sunnah just as he descended upon him with the Quran.'",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 5
  },
  {
    "serial_number": "2429101",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "Al-Khatib narrated in his book Al-Kifayah from Ahmad bin Zaid bin Harun, who said: 'It is merely Salih [narrating] from Salih, Salih from a Tabi'i (Successor), a Tabi'i from a Sahib (Companion), a Sahib from the Messenger of Allah (peace and blessings of Allah be upon him), the Messenger of Allah from Gabriel, and Gabriel from Allah, the Mighty and Majestic.' Meaning, this Sharia of Allah, the Glorified and Exalted, comprising the Book and the Sunnah, is narrated until it reaches us: Salih from Salih, Salih from a Tabi'i, a Tabi'i from a Sahib, a Sahib from the Messenger of Allah (peace and blessings of Allah be upon him), and the Messenger of Allah (peace and blessings of Allah be upon him) from Gabriel, and Gabriel from Allah, the Mighty and Majestic. None of the revelation of Allah, the Glorified and Exalted, stops at anyone among these besides Allah, the Glorified and Exalted. Whatever the Prophet (peace and blessings of Allah be upon him) says or does is entirely revelation from Allah, the Mighty and Majestic. So, if the Prophet (peace and blessings of Allah be upon him) was asked about something regarding the legislation of Allah, the Glorified and Exalted, and he had prior revelation from Allah the Exalted, he would report it. But if he did not have revelation from Allah, the Mighty and Majestic, he would then wait for the news from the heavens and would not speak on his own apart from Allah, the Glorified and Exalted.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 6
  },
  {
    "serial_number": "2429102",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "There are reports from the Prophet (peace and blessings of Allah be upon him) regarding this that clarify the Prophet's (peace and blessings of Allah be upon him) pausing and not speaking of his own accord. Among them is what the two Sheikhs (Bukhari and Muslim) narrated from the hadith of Isma'il from Ibn Jurayj from 'Ata from Safwan bin Umayyah from his father, that he used to say to Umar bin Al-Khattab (may Allah be pleased with him): 'I wish I could see the Prophet of Allah (peace and blessings of Allah be upon him) when revelation descends upon him.' He said: So when the Prophet (peace and blessings of Allah be upon him) was at Al-Ji'ranah, and there was a garment shading the Prophet (peace and blessings of Allah be upon him) while he was with some of his companions, including Umar, a man came to him wearing a woolen cloak (jubbah) soaked in perfume. He said: 'O Messenger of Allah! What is your view regarding a man who enters Ihram for Umrah in a cloak after soaking himself in perfume?' He said: The Prophet (peace and blessings of Allah be upon him) looked at him for a while and then remained silent. Then the revelation came to him, and at that moment the Prophet (peace and blessings of Allah be upon him) did not have knowledge from Allah, the Mighty and Majestic, or prior revelation [on this specific matter]. So Umar signaled with his hands to Ya'la bin Umayyah to come. Ya'la came and put his head in [under the covering], and behold, the Prophet (peace and blessings of Allah be upon him) was red-faced, wheezing for a while, then he was relieved of it. He said: «Where is the one who asked me about Umrah?» The man was sought and brought. The Prophet (peace and blessings of Allah be upon him) said: «As for the perfume that is on you, wash it three times, and as for the cloak, take it off, then do in your Umrah as you do in your Hajj.» This shows the Prophet (peace and blessings of Allah be upon him), when that man who had entered Ihram for Umrah came to him—he came while the Prophet did not have knowledge about what he was wearing, for he had worn a sewn garment, which is the cloak, and soaked himself in perfume, both of which are prohibitions of Ihram. He asked the Prophet (peace and blessings of Allah be upon him) about that, and the Prophet (peace and blessings of Allah be upon him) did not have prior revelation from Allah, the Mighty and Majestic, so he waited for the revelation brought to him by Gabriel, peace be upon him. The Prophet (peace and blessings of Allah be upon him) informed that his reports, statements, and rulings that he utters and performs, whether commands, prohibitions, actions, or abstentions and the like, are indeed revelation from Allah, the Glorified and Exalted, and indeed they are from the Book of Allah, the Mighty and Majestic. For Allah, the Glorified and Exalted, has linked obedience to His Prophet",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 7
  },
  {
    "serial_number": "2429103",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "- peace and blessings of Allah be upon him - to obedience to Him in several places in His Book, the Glorified and Exalted. Indeed, He informed that whoever disobeys the Messenger of Allah (peace and blessings of Allah be upon him) has indeed disobeyed Allah, the Mighty and Majestic. The two Sheikhs (Bukhari and Muslim) narrated, saying: Qutaibah bin Sa'id told us, Laith told us, from Al-Zuhri from Ubaidullah bin Abdullah from Abu Hurairah and Zaid bin Khalid Al-Juhani, who said: A Bedouin came to the Messenger of Allah (peace and blessings of Allah be upon him) and said: 'O Messenger of Allah, judge between us with the Book of Allah.' He said: His opponent, the other Bedouin, stood up and said: 'He spoke the truth, O Messenger of Allah, judge between us with the Book of Allah.' That Bedouin said: 'My son was a hired laborer for this man - meaning an employee shepherding his sheep - and he committed adultery with his wife. They told me that my son faces stoning. He said: So I ransomed my son from him with one hundred sheep and a maidservant. Then I asked the people of knowledge, and they said that my son faces one hundred lashes and banishment for a year.' The Prophet (peace and blessings of Allah be upon him) said: «I will surely judge between you with the Book of Allah. As for the maidservant and the sheep, they are returned to you. And upon your son is one hundred lashes and banishment for a year. And as for you, O Unays, go to this man's wife in the morning, and if she confesses, stone her.» So Unays went to her, and she confessed, so he stoned her.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 8
  },
  {
    "serial_number": "2429104",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "Whoever contemplates the rulings of the Prophet (peace and blessings of Allah be upon him) for this Bedouin and his opponent will find that the Prophet (peace and blessings of Allah be upon him) issued rulings that are not in the Holy Quran textually, but rather they are from the Prophet (peace and blessings of Allah be upon him) from the revelation of Allah, the Mighty and Majestic, which counts as the Sunnah of the Prophet (peace and blessings of Allah be upon him) that is the peer of the Holy Quran in terms of legal authority. The Prophet (peace and blessings of Allah be upon him) ruled regarding him that the sheep and the maidservant be returned to him because they were not the judgment of Allah, the Glorified and Exalted. He also ruled regarding his son one hundred lashes, and lashing is established in the Book of Allah, the Glorified and Exalted, in Surah An-Nur in His saying, the Mighty and Majestic: {So lash each one of them with a hundred lashes}. Furthermore, he ruled regarding his son that he be lashed one hundred times and banished for a year, and banishment for a year is also not something explicitly stated in the Book of Allah, the Glorified and Exalted, but rather it is from the Sunnah of the Prophet (peace and blessings of Allah be upon him), even though the Prophet (peace and blessings of Allah be upon him) said: «I will surely judge between you», and this is an oath from him (peace and blessings of Allah be upon him): «I will surely judge between you with the Book of Allah», yet he ruled that he be lashed one hundred times and banished for a year. This indicates that the rulings of the Prophet (peace and blessings of Allah be upon him) are the peer of the Book of Allah, the Glorified and Exalted, which is the Holy Quran, in terms of legal authority.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 9
  },
  {
    "serial_number": "2429105",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "The Prophet (peace and blessings of Allah be upon him) has informed in several places that his Sunnah and what comes from him (peace and blessings of Allah be upon him) of speech or action are the peer of the Book of Allah, the Glorified and Exalted; it is forbidden to reject them or turn away from them based on the saying of any person. Indeed, Allah, the Glorified and Exalted, informed in His Great Book that lack of reverence for the sayings of the Prophet (peace and blessings of Allah be upon him) is a warning of the nullification of deeds. Allah, the Mighty and Majestic, said in Surah Al-Hujurat: {O you who have believed, do not raise your voices above the voice of the Prophet or be loud to him in speech like the loudness of some of you to others, lest your deeds become worthless while you perceive not}. The nullification of deeds here does not arise from disbelief (Kufr) causing it, for it is known that disbelief in Allah, the Glorified and Exalted, nullifies deeds. However, here, those who raise their voices in the presence of the Prophet (peace and blessings of Allah be upon him) may be people of faith who committed this sin, which perhaps indicates a lack of reverence for the sayings of the Prophet (peace and blessings of Allah be upon him). Raising one's voice at the sayings of the Prophet (peace and blessings of Allah be upon him), whether during his life or after his death when hearing them from someone narrating them, carries the same ruling; it is a likely cause for the nullification of deeds, and refuge is sought with Allah, even if it is not disbelief. So what then is to be thought of one who prioritizes over the saying of the Messenger of Allah (peace and blessings of Allah be upon him), his methodology, and his guidance, the saying of another, their methodology, and their guidance? Has this person's deeds not become worthless without him realizing it..!! The two Sheikhs (Bukhari and Muslim) narrated via Salih from Ibn Shihab who said, Urwah bin Al-Zubayr informed me from Aisha from her father, Al-Siddiq (Abu Bakr), that he said: 'I am not leaving anything that the Messenger of Allah (peace and blessings of Allah be upon him) used to do except that I do it. Indeed, I fear that if I leave anything of his command, I will deviate.' This is Al-Siddiq fearing that if he left the Sunnah he would deviate, so what would be the case of a time and era whose people mock their Prophet and his commands and prohibitions, and compete in opposing him, and even ridicule his methodology.. Muslims have unanimously agreed that if a matter of the Sunnah becomes clear to someone, it is not lawful for him to leave it for the saying of anyone.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 10
  },
  {
    "serial_number": "2429106",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "If this is known, then the greatness of worshipping through caring for the Revelation and caring for what comes from the Prophet (peace and blessings of Allah be upon him) and worshipping based on it is known. And if it is known that the Sunnah of the Prophet (peace and blessings of Allah be upon him) is revelation from Allah, the Mighty and Majestic, then the honor of that knowledge and its virtue with Allah, the Glorified and Exalted, is known. The righteous predecessors (Salaf), may Allah have mercy on them, often cared for knowing the rulings of the Prophet (peace and blessings of Allah be upon him) and his states. Furthermore, the gatherings of Dhikr (remembrance) are actually gatherings of Halal and Haram; they are not gatherings of storytellers and the like. They are gatherings of Halal and Haram, knowing Fiqh (jurisprudence), knowing the rulings of the Quran and its interpretation, and so on. Abu Nu'aym narrated in his book Al-Hilyah from the hadith of Abu Abd al-Malik who said: Yazid bin Samra Abu Hazzan told us, saying: I heard 'Ata al-Khurasani say: 'Gatherings of Dhikr are gatherings of Halal and Haram.' Abu Nu'aym also narrated from the hadith of Yahya bin Kathir who said: 'Learning Fiqh is prayer, and studying the Quran is prayer.' Therefore, if it is known that the Sunnah of the Prophet (peace and blessings of Allah be upon him) is revelation from Allah, the Glorified and Exalted, the honor of that knowledge and the greatness of the reward from Allah, the Glorified and Exalted, is known for the one who tracks the Sunnah of the Prophet (peace and blessings of Allah be upon him), gains understanding of it, strives to memorize it and to distinguish its authentic from its weak, and defends it. This is among the highest ranks with Allah for the one granted sincerity and righteous intention. Yahya bin Yahya Al-Naysaburi said: 'Defending the Sunnah is better than Jihad in the path of Allah.' It was said to him: 'A man spends his wealth, tires himself, and strives (in Jihad), yet this is better than him?' He said: 'Yes, by far..' Abu Ubaid Al-Qasim bin Salam said: 'The follower of the Sunnah is like one holding onto burning coal, and he is, in my view today, better than striking with swords in the path of Allah.' This indicates the virtue of Jihad as much as it indicates the virtue of the Sunnah, as a preference was made between them due to their high status in Islam.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 11
  },
  {
    "serial_number": "2429107",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "We, in this lesson and the sessions that follow, are explaining a book that is among the greatest and most beneficial books in the chapter of Rulings (Ahkam), which is the book: (Bulugh al-Maram by Al-Hafiz Ahmad bin Ali bin Hajar Al-Asqalani, may Allah have mercy on him). His book Bulugh al-Maram is one of the most beneficial books of Rulings. He, may Allah have mercy on him, collected a group of hadiths of the Prophet (peace and blessings of Allah be upon him) from many books of Sunnah, some authentic and some less so; because he, may Allah have mercy on him, intended to gather what the followers of the schools of thought (Madhhabs) use as evidence for their opinions in the chapters of Fiqh. So he collected the hadiths and arranged them according to chapters, making it rare in its field; indeed, it is among the most precious books of Rulings authored by scholars among the later Imams, may Allah have mercy on them. The saying of Al-Hafiz Ibn Hajar in his introduction: (In the name of Allah, the Entirely Merciful, the Especially Merciful....etc). The author, may Allah have mercy on him, in his book Bulugh al-Maram, began the introduction with the Basmalah. The phrase \"Bismillah...\" is called Basmalah for short, and one who says \"Bismillah\" is called Basmal or Mubasmit. Umar bin Abi Rabi'ah said: 'Layla said the Basmalah the morning I met her *** So how lovely is that beloved who says the Basmalah.' Al-Hafiz starting with the Basmalah is in emulation of the Mighty Book (Quran), and what was reported from the Prophet (peace and blessings of Allah be upon him) regarding mentioning the name of Allah (Tasmiyah) from his actions (peace and blessings of Allah be upon him) in many of his affairs such as correspondence and others. The command to say the Basmalah has been reported from him (peace and blessings of Allah be upon him), but it is not established (authentic). Al-Khatib narrated in his Jami' from the hadith of Mubashir bin Isma'il from Al-Awza'i from Al-Zuhri from Abu Salamah from Abu Huraira raised (Marfu') [to the Prophet]: (Every matter of importance that does not begin with In the name of Allah, the Entirely Merciful, the Especially Merciful, is cut off).",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 12
  },
  {
    "serial_number": "2429108",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "It is a munkar (denounced) report, essentially fabricated (mawdu'). It was deemed defective by Huffaz (Hadith Masters) like Imam Ahmad and Al-Daraqutni. The correct view regarding it is that it is Mursal (hurried/disconnected) and uses wording other than the Basmalah, and it is also Munkar. Mubashir bin Isma'il erred in it, narrating it with the wording of the Basmalah. A group such as Al-Walid bin Muslim, Baqiyyah, Kharijah bin Mus'ab, Shu'ayb bin Ishaq, Muhammad bin Kathir, Al-Mu'afa bin Imran, Abdul Quddus, and others narrated it from Al-Awza'i with the wording: (Every matter of importance that does not begin with 'Alhamdulillah' (Praise be to Allah)...), and the correct view regarding this wording is also Irsaal (disconnection). Those who attributed it with the Basmalah wording to the Sunan, like Al-Zayla'i, Al-Iraqi, Al-Suyuti, and others, were mistaken. Some late scholars were lenient and classified it as Hasan (Good), such as Al-Suyuti, who is very lenient in strengthening weak and flimsy reports, and he is imitated in this regard a lot. Therefore, the command for Basmalah in the previous report is not established. However, it is established from the Prophet (peace and blessings of Allah be upon him) through his action in correspondence. The two Sheikhs, Al-Bukhari and Muslim, narrated from the hadith of Al-Zuhri from Ubaidullah bin Abdullah bin Utbah from Abdullah bin Abbas from Abu Sufyan, may Allah be pleased with them, that he said: The Prophet (peace and blessings of Allah be upon him) wrote to Heraclius: «In the name of Allah, the Entirely Merciful, the Especially Merciful. From Muhammad, the Messenger of Allah, to Heraclius, the Great of the Romans». This is established from him (peace and blessings of Allah be upon him) through his action. Beginning with the Basmalah has been reported from the Prophet (peace and blessings of Allah be upon him) in several places, urging its commencement. Several situations have been reported from him regarding the encouragement of Tasmiyah (mentioning Allah's name) at the start of matters, whether starting actions, starting writing, or starting some acts of worship. Among them: Starting with the complete Basmalah (In the name of Allah, the Entirely Merciful, the Especially Merciful). This has been reported from the Prophet (peace and blessings of Allah be upon him) in several places: Among them is starting the recitation before Al-Fatihah after the opening Takbir with the Basmalah, as narrated by Al-Nasa'i, Ibn Khuzaymah, and Ibn Hibban from Sa'id bin Abi Al-Hilal from Nu'aym Al-Mujmir: I prayed behind Abu Huraira and he recited: (In the name of Allah, the Entirely Merciful, the Especially Merciful...) the report, and in it Abu Huraira said: By Allah, I am the one among you whose prayer most resembles the Messenger of Allah (peace and blessings of Allah be upon him).",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 13
  },
  {
    "serial_number": "2429109",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "Similarly, beginning with it when reading [Quran] generally and when beginning writing, and there are authentic hadiths and narrations regarding that. * Also among the situations is starting one's action with the Basmalah by saying (Bismillah) without adding (Ar-Rahman Ar-Rahim). This has been reported from the Prophet (peace and blessings of Allah be upon him) in situations, including what Imam Muslim narrated from the hadith of Al-Walid bin Kathir from Wahb bin Kaysan from Umar bin Abi Salamah that he ate with the Prophet (peace and blessings of Allah be upon him), and the Prophet (peace and blessings of Allah be upon him) said to him: «Say Bismillah, and eat with your right hand.» Other texts mentioning the complete Tasmiyah have come regarding Tasmiyah at food. * Likewise, a third situation has been reported from him (peace and blessings of Allah be upon him), which is the Tasmiyah without adding the phrase (Ar-Rahman Ar-Rahim) but with the addition of something else. Among this is what was reported from the Prophet (peace and blessings of Allah be upon him) regarding placing the deceased in the grave, saying: «Bismillah wa 'ala millati Rasoolillah» (In the name of Allah and upon the religion of the Messenger of Allah), as narrated by Imam Ahmad, Abu Dawud, and others from the hadith of Shu'bah from Qatadah from Abu Al-Siddiq from Abdullah bin Umar. Also, what came in the Sahihayn (Bukhari and Muslim) from the hadith of Mansur from Salim bin Abi Al-Ja'd from Kurayb from Abdullah bin Abbas, may Allah be pleased with him, that the Prophet (peace and blessings of Allah be upon him) said: «If one of you, when he comes to his wife [for intercourse], says: 'Bismillah, Allahumma jannibna al-shaytan wa jannib al-shaytan ma razaqtana' (In the name of Allah, O Allah, keep the devil away from us and keep the devil away from what You provide us)...» the report, as came from him (peace and blessings of Allah be upon him). And a fourth situation is the wording of the report from the Prophet (peace and blessings of Allah be upon him) coming with the phrase: (Dhikr of Allah / Mention of Allah) without specifying.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 14
  },
  {
    "serial_number": "2429110",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "The Sunnah in this matter is to adhere to what the authentic hadiths have brought without adding to them. In situations where the report from him (peace and blessings be upon him) is established to say 'Bismillah Ar-Rahman Ar-Rahim' completely, action and compliance with the Sunnah are not achieved except by mentioning it completely; if one limits oneself in those situations to 'Bismillah' only, compliance with the Sunnah is not achieved. In situations where limiting it to the phrase 'Bismillah' is established, compliance in those situations is adhering to saying 'Bismillah' only. Sheikh Al-Islam Ibn Taymiyyah said: One says 'Bismillah Ar-Rahman Ar-Rahim' completely when eating, for it is more complete, unlike slaughtering. Regarding situations where the text establishes mentioning 'Bismillah' with an additional phrase other than 'Ar-Rahman Ar-Rahim', compliance lies in saying 'Bismillah' with that addition. Whoever wants to add 'Ar-Rahman Ar-Rahim' after 'Bismillah' and then mention the other addition established by text has not been compliant, because these are invocations and supplications where it is best to stop at what has been transmitted. As for situations where mentioning the name of Allah is established without specifying 'Bismillah Ar-Rahman Ar-Rahim' or just 'Bismillah', one has the choice to mention the Basmalah completely, which is preferable, or to limit it to saying 'Bismillah'.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 15
  },
  {
    "serial_number": "2429111",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "The scholars have agreed on the legitimacy of the Tasmiyah (saying Bismillah) as reported from the Prophet (peace and blessings of Allah be upon him). However, scholars differed regarding starting poetry with the Basmalah. It has been narrated from some of the Salaf (predecessors) among the Tabi'in and others that Tasmiyah is disliked at the beginning of poetry and the like. Among this is what Al-Khatib Al-Baghdadi narrated in Kitab Al-Jami' from the hadith of Junadah bin Salam, who is from the descendants of Jabir bin Samura, from Mujalid bin Sa'id from Al-Sha'bi, who said: 'They agreed not to write (In the name of Allah, the Entirely Merciful, the Especially Merciful) in front of poetry.' Al-Khatib Al-Baghdadi also narrated it from another path from the hadith of Hafs bin Ghiyath from Mujalid from Al-Sha'bi, who said: 'They used to dislike writing (In the name of Allah, the Entirely Merciful, the Especially Merciful) in front of poems.' This opinion was also held by others besides Amir bin Sharahil Al-Sha'bi; it was also narrated from Al-Zuhri, may Allah have mercy on him, as Al-Khatib Al-Baghdadi also narrated in his book Al-Jami' from the hadith of Abdul Aziz bin Imran Al-Zuhri from the son of Ibn Shihab's brother from his uncle who said: 'The Sunnah passed that (In the name of Allah, the Entirely Merciful, the Especially Merciful) is not written in poetry.' However, this opinion is not established from Amir bin Sharahil Al-Sha'bi because its chain contains Mujalid bin Sa'id, who is weak. The view held by the verifying scholars, and adopted by the generality of later scholars, is that beginning poetry—whether in a compilation or spoken—with the Basmalah is the Sunnah, and nothing excludes it from that unless established from the Messenger (peace and blessings of Allah be upon him). This has been narrated from Sa'id bin Jubayr and others among the Tabi'in, as Al-Khatib Al-Baghdadi narrated from the hadith of Muhammad bin Mus'ab from Jabalah bin Abi Sulayman who said: I heard Sa'id bin Jubayr say: 'No writing is proper unless its beginning is (In the name of Allah, the Entirely Merciful, the Especially Merciful), even if it is poetry.' This indicates the legitimacy of beginning with Tasmiyah in all actions and that this is the Sunnah, with nothing excepted from it, for the Prophet (peace and blessings of Allah be upon him) did not except anything from that. Scholars have authored works on the Basmalah and its rulings, including Al-Hafiz Ibn Abd al-Barr who has a section on it, and Ibn Al-Sabban who is among the later scholars.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 16
  },
  {
    "serial_number": "2429112",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "The author, Al-Hafiz Ibn Hajar, may Allah have mercy on him, used certain terminologies in his book Bulugh al-Maram, which he stipulated in his introduction. He mentioned that if he says 'narrated by the Seven' (Al-Sab'ah), he means by that: the authors of the six books and Imam Ahmad, may Allah have mercy on them. If he says 'narrated by the Four' (Al-Arba'ah), they are: the authors of the Sunan. And 'the Six' (Al-Sittah) are: Al-Bukhari, Muslim, and the authors of the four Sunan. Then he mentioned the rest of the terminologies he established, some of which are considered specific to him, may Allah have mercy on him. The terminologies of Al-Hafiz Ibn Hajar in the book Bulugh al-Maram are terminologies a student of knowledge should know before beginning Bulugh al-Maram. Indeed, a student of knowledge should know the terminologies of scholars in their compilations so as not to fall into attributing error to scholars or faulting them without evidence. For every scholar has certain terminologies in his book, either mentioned in his introduction or learned by examination and observation of that book he authored, from which terminologies are extracted. For example, Al-Hafiz Ibn Hajar, may Allah have mercy on him, when saying: (Agreed upon / Muttafaq Alayh) here, means it was narrated by Al-Bukhari and Muslim, although there exist similar terminologies with some scholars meaning something other than just Al-Bukhari and Muslim as intended by Al-Hafiz Ibn Hajar. For instance, the author of Al-Muntaqa, Al-Majd Ibn Taymiyyah, may Allah have mercy on him, if he says: (Agreed upon), he means it was narrated by Al-Bukhari, Muslim, and Imam Ahmad.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 17
  },
  {
    "serial_number": "2429113",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "Similarly, Abu Nu'aym Al-Asbahani, may Allah have mercy on him, in his book Hilyat al-Awliya, has some terminologies regarding this. If he uses the term (Agreed upon / Muttafaq Alayh), he does not mean in many cases that it was narrated by Al-Bukhari and Muslim, but rather he means that the conditions of authenticity were met in it. He used this phrase (Agreed upon) in his book Hilyat al-Awliya for hadiths that are not rare or few, yet I found they are not in Al-Bukhari or Muslim, may Allah have mercy on them, or are found in one of the Sahihs and not the other. This indicates he has a terminology different from what some scholars agreed upon and what the generality of later scholars adopted from them. For example, Al-Hafiz Abu Nu'aym, may Allah have mercy on him, cites some hadiths and says (Agreed upon) while they are not in Al-Bukhari and Muslim originally. Among them is what Abu Nu'aym narrated in his book Al-Hilyah from the hadith of Sufyan from Al-A'mash from Abu Salih from Abu Huraira, may Allah be pleased with him, that the Prophet (peace and blessings of Allah be upon him) said: «The Imam is a guarantor, and the Muezzin is entrusted. O Allah, guide the Imams and forgive the Muezzins.» Abu Nu'aym, may Allah have mercy on him, said after narrating this report: Authentic, Agreed upon. This report is not in the two Sahihs nor in one of them. The author, may Allah have mercy on him, meant by this that the conditions of authenticity stipulated by scholars were met in it, and his intent is that this is the highest degree of authenticity according to him, may Allah have mercy on him. He said this phrase for more than one report, including what was also narrated via Abu Dawud Al-Tayalisi from Sufyan from Abu Ishaq from Al-Bara', who said: The Prophet (peace and blessings of Allah be upon him), when returning from a journey, used to say: «Returning, repenting, to our Lord praising.» This is not in the two Sahihs nor in one of them. Rather, the author's intent, may Allah have mercy on him, in such places is that these hadiths have met the conditions of authenticity stipulated by scholars, intending that this is the highest degree of authenticity according to him, may Allah have mercy on him.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 18
  },
  {
    "serial_number": "2429114",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "Therefore, a student of knowledge should know the terminologies of scholars in their works to be clear about their judgments and not to fall into error in understanding the intent of the Huffaz (Hadith Masters), may Allah have mercy on them. 1- On the authority of Abu Huraira, may Allah be pleased with him, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said regarding the sea: «Its water is purifying (Tahur), its dead are lawful (Halal).» Narrated by the Four, and Ibn Abi Shaybah, and the wording is his; authenticated by Ibn Khuzaymah and Al-Tirmidhi. The first hadith cited by the author, may Allah have mercy on him, is the hadith of Abu Huraira, may Allah be pleased with him, which scholars call the Hadith of the Sea. His saying, may Allah have mercy on him: (The Book of Purification / Kitab Al-Taharah): 'Kitab' (Book) comes from the root 'Kataba', meaning 'gathering'. It is said \"The sons of so-and-so 'takattaba'\" if they gathered together; a battalion (Katiba) is called so because of the gathering of its individuals with one another. Similarly, a book is called a book due to the gathering of its papers and their attachment to one another. Likewise, a written document (Maktub) is called so due to the gathering of letters in that document. Even if it is a single paper, it is called a Kitab (writing/letter) if something is written on it. The meaning of 'Kitab' here is gathering, as the poet said: Do not trust a Fazari (man from Fazarah) you are alone with... with your young she-camel, but tie it (uktub-ha) with straps. His saying, may Allah have mercy on him: (Purification / Al-Taharah): Purification in the Arabic language refers to: Cleanliness and integrity. 'The garment became Tahur from filth', meaning: it became clean and free from it. In the terminology of the Lawgiver, it applies to two meanings: First: Spiritual, which is the purification of the heart from Polytheism (Shirk) in the worship of Allah, and hatred for the believing servants of Allah. This is more important than bodily purification and more worthy of care, observation, and rectification. Second: Physical/Sensory, which is the lifting of ritual impurity (Hadath) and what is similar to it, and the removal of filth (Khabaath). His saying, may Allah have mercy on him: (Chapter on Waters / Bab Al-Miyah):",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 19
  },
  {
    "serial_number": "2429115",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "The meaning of 'Bab' (Chapter/Door) here is: that from which one exits and enters, and this is known in the Arabic language. Scholars have agreed upon these nomenclatures: (Kitab/Book and Bab/Chapter). For the most part, scholars consider (Kitab) to be: that which gathers chapters of issues of knowledge or hadiths of the Prophet (peace and blessings of Allah be upon him). Among them is the author's saying, may Allah have mercy on him, (The Book of Purification); he intended by 'Book' here: The Collection, meaning a collector of hadiths of purification and reports that came from the Prophet (peace and blessings of Allah be upon him) or his companions, may Allah be pleased with them. By citing this report—the report of Abu Huraira, which is the first hadith in this chapter—the author, may Allah have mercy on him, intended to clarify the purifying nature of sea water, and that if sea water is pure/purifying, then other water is even more so. Scholars have made this report one of the fundamentals of purification in the Sharia. This report was narrated, as mentioned by the author, by Imam Ahmad and the authors of the Sunan. It was also narrated by Malik, Ibn Khuzaymah, Ibn Hibban, Al-Hakim in Al-Mustadrak, and Al-Bayhaqi in Al-Sunan. It was also narrated by a group of scholars, all of them narrating it from the hadith of Safwan bin Sulaym from Sa'id bin Salamah from Al-Mughirah bin Abi Burdah that he heard Abu Huraira, may Allah be pleased with him, say: A man came to the Prophet (peace and blessings of Allah be upon him) and said: O Messenger of Allah, we ride the sea and carry with us little water. If we perform ablution (Wudu) with it, we will become thirsty! Should we perform ablution with it [sea water]? The Prophet (peace and blessings of Allah be upon him) said: «Its water is purifying (Tahur), its dead are lawful (Halal).»",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 20
  },
  {
    "serial_number": "2429116",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "This report has been accepted by the Ummah (Muslim community) with acceptance, and a group of scholars have authenticated it, such as Imam Al-Bukhari as in Al-Tirmidhi's Al-Ilal Al-Mufrad, Al-Tirmidhi, Ibn Khuzaymah, Al-Daraqutni who declared its chain good (Jayyid) as in his Ilal, as well as Al-Bayhaqi, Ibn Abd al-Barr, Al-Hakim, Ibn Hibban, and other scholars. A group of scholars exceeding thirty Imams have authenticated it. I have not seen anyone among the scholars weaken this report except Ibn Daqiq al-Eid and Ibn al-Qattan al-Fasi, for they found fault with it due to Sa'id bin Salamah and claimed his anonymity (Jahalah). Regarding Sa'id bin Salamah, Al-Nasa'i, may Allah have mercy on him, said: Reliable (Thiqah), and Ibn Hibban mentioned him in his book Al-Thiqat. However, the hadith of unknown narrators (Majahil) or those whose condition is hidden (Mastur) is not rejected absolutely by scholars; rather, consideration is given to their hadiths in some situations, and their hadiths are strengthened by certain indicators (Qara'in). Scholars accepted the hadith of Sa'id bin Salamah in this report because scholars received his report with acceptance, and it became widespread among them, so this served as an indicator for accepting the report. Scholars sometimes rely on the fame of the report instead of arguing via the chain of transmission, though this is in rare cases. Also, Huffaz (Hadith Masters) sometimes strengthen the hadiths of one who has no known criticism (Jarh) or commendation (Ta'dil) in some of what he narrates if indicators surround his truthfulness such that he does not bring something denounced (Munkar) nor brings eccentric wordings (Gharib). Al-Bukhari, Muslim, Al-Tirmidhi, Al-Nasa'i, Ibn Hibban, Ibn Khuzaymah, and Al-Daraqutni have authenticated [narrations] for a group in whom no criticism or commendation was found, and that was after probing their hadith and finding it upright. This is not considered leniency from them, because their ignorance of the narrator's condition does not imply a defect that would make one fear strengthening him. Knowing the truthfulness, precision, and integrity of a narrator comes from probing and tracking his hadith, just as it comes from close association and testing. Leniency is only in strengthening the hadiths of the weak and authenticating the report of unknown narrators despite the eccentricity and denouncability of their hadith and their uniqueness in reporting it. Although the conditions of unknown narrators vary from one person to another, from one generation (Tabaqa) to another, and from one land to another, and also depending on those narrating from them. The unknown narrators among the early Tabi'in are not like those after them. One from whom Al-Sha'bi and Ibn Sirin narrated is not like one from whom",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 21
  },
  {
    "serial_number": "2429117",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "those with less memorization and verification narrated, even if their number is large, along with many indicators that the Huffaz employ in accepting the hadith of some unknown narrators. Therefore, you do not find the Imams and Huffaz having a single methodology they employ in accepting and rejecting the narrations of unknown narrators, as is not hidden. You find them authenticating the hadith and verifying the trustworthiness of someone known for only one hadith who is counted among the unknown due to the scarcity of his narration, while you find them rejecting someone who has more than two, three, four, or five hadiths. This is due to the varying indicators surrounding each one of them. For Aswad bin Sa'id, I know of no hadith for him other than (The transgressing party will kill Ammar), yet Yahya bin Ma'in and Ibn Hibban declared him reliable. Similarly, Harun bin Ri'ab, who has very few narrations; Sufyan bin Uyainah said: (He had four hadiths), yet Ahmad bin Hanbal, Yahya bin Ma'in, and Al-Nasa'i declared him reliable. Indeed, the two Sheikhs (Bukhari and Muslim) narrated from those who are among the 'hidden' (Masturin) and are not known by criticism or commendation, like Ibrahim bin Abdur-Rahman bin Abi Rabi'ah, for Al-Bukhari narrated from him and I do not know who declared him reliable. Muslim narrated from the hadith of Abu Awanah from Uthman bin Abdullah bin Mawhab from Ja'far bin Abi Thawr from Jabir bin Samura, who said that a man asked the Messenger of Allah (peace and blessings of Allah be upon him): Should I perform ablution from eating mutton? He said: If you wish perform ablution, and if you wish do not perform ablution. He said: Should I perform ablution from eating camel meat? He said: Yes, perform ablution from camel meat. And Ja'far bin Abi Thawr, I know of no one who declared him reliable except Ibn Hibban, yet Muslim narrated from him in his Sahih, and the Imams and Huffaz received his hadith with acceptance, to the point that Al-Hafiz Ibn Khuzaymah said in his Sahih: We have not seen disagreement among the scholars of the people of Hadith that this report is authentic from the perspective of transmission. In the two Sahihs, there is a not insignificant number of narrators who are counted among the 'hidden' (Masturin).",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 22
  },
  {
    "serial_number": "2429118",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "Based on this, it is known that the matter of the unknown narrator (Majhul) varies according to what we mentioned. A narrator might be unknown to the Imams and Huffaz despite more than one person narrating from him, and he might be known to them—indeed, reliable and authentic in hadith—despite only one narrator reporting from him. Thus, the issue of the unknown narrator and lifting the state of anonymity is not dependent on the number of people narrating from him, as mentioned by many scholars of terminology and principles. The criticism by Ibn Al-Qattan Al-Fasi and Ibn Daqiq of the Sea Water hadith due to the anonymity of its narrator is questionable. Ibn Al-Qattan Al-Fasi is among those who are very strict in this chapter and applies taking the apparent state of the chains, and he rarely utilizes indicators (Qara'in), similar to the state of a group of scholars like Ibn Hazm, Al-Khatib, and many of the later scholars. The purity of sea water is something on which there is no disagreement among scholars, except for a minor opinion narrated from some Companions of the Prophet (peace and blessings of Allah be upon him). His saying here at the beginning of the report: (We ride the sea) contains evidence for the permissibility of riding the sea, and that the default rule regarding it is permissibility. This is what the Book of Allah, the Glorified and Exalted, indicates, for Allah the Exalted mentioned riding the ark and riding the sea in several places in His Book, the Glorified and Exalted. Allah the Exalted said: {It is He who enables you to travel on land and sea}. Travel is: riding a beast on land, as well as walking on feet, and travel in the sea means: riding arks and ships. Also His saying, the Glorified and Exalted: {And the ships which sail through the sea with that which benefits people}.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 23
  },
  {
    "serial_number": "2429119",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "As for the case where there is a prevalent belief of destruction, such as waves and the like, then it becomes forbidden. Therefore, some reports have been narrated from the Prophet (peace and blessings of Allah be upon him) which are weak. Among them is what Sa'id narrated, and from Sa'id Abu Dawud and Al-Bayhaqi, from the hadith of Mutarrif bin Tarif from Bishr Abu Abdullah from Bashir bin Muslim from Abdullah bin Amr, may Allah be pleased with him, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: «Let no man ride the sea except a fighter (Ghazian), or a pilgrim performing Umrah or Hajj, for indeed under the sea is fire and under the fire is a sea.» This report has been weakened by some scholars; it is disturbed (Mudtarib) and weak in chain, denounced in text. Imam Al-Bukhari, may Allah have mercy on him, weakened it as in his Tarikh, and Ibn Abd al-Barr said: Its chain is dark. What was narrated regarding prohibition from some of the Salaf regarding riding the sea is interpreted to apply to the case of believing destruction is likely due to intensifying waves and intensifying wind and the like; then it is prohibited and becomes unlawful. For this reason, Al-Shafi'i hesitated in obligating Hajj on those beyond the sea; he said, may Allah have mercy on him: It is not clear to me that I should obligate Hajj on those beyond the sea, nor do I know how their capability stands. This has been narrated from Umar bin Al-Khattab, may Allah be pleased with him, as Abdul-Razzaq narrated in his Musannaf from the hadith of Ma'mar from Al-Zuhri from Sa'id bin Al-Musayyib who said: (Umar used to dislike transporting Muslims as fighters by sea). This is authentic from Umar, even if Ibn Al-Musayyib did not hear from Umar, it is taken as connected. The generality of early Huffaz authenticated his hadith from Umar, and I know of no opponent in that except Al-Tirmidhi who authenticates it in some places and faults it in others. Among those who explicitly authenticated it are Imam Ahmad, Abu Hatim, Ibn Al-Madini, and others. This narration applies to the state of severe waves and severe wind and prevalence of thought of destruction, then it becomes disliked, indeed forbidden. Umar permitted it in other than that state, as Al-Bayhaqi narrated from Nafi' from Ibn Umar that Tamim Al-Dari asked Umar bin Al-Khattab, may Allah be pleased with him, about riding the sea—and he was a great merchant in the sea—so he ordered him to shorten the prayer. Among that also is what was narrated from Abdullah bin Umar as Abdul-Razzaq narrated from the hadith of Laith from",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 24
  },
  {
    "serial_number": "2429120",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "Mujahid from Abdullah bin Umar, may Allah be pleased with him (that he used to dislike riding the sea except for three: a fighter, a pilgrim performing Hajj, or Umrah). This report is not established from Abdullah bin Umar; its chain contains Laith bin Abi Sulaym who is weak by agreement of the Huffaz, may Allah have mercy on them. His hadiths from Mujahid are considered weak except for his hadith from Mujahid from Abdullah bin Abbas in Tafsir (Exegesis), for that may pass because it is from a book, as mentioned by Ibn Hibban, may Allah have mercy on him, for he narrates it from the hadith of Laith bin Abi Sulaym, and Laith narrates it from Al-Qasim bin Abi Bazzah from Mujahid bin Jabr from Abdullah bin Abbas, may Allah be pleased with him. The rest of Laith bin Abi Sulaym's hadiths from Mujahid bin Jabr and others are considered weak by scholars. However, Imam Malik, may Allah have mercy on him, in the issue of riding the sea, distinguished between men and women. It was narrated from him that he disliked a woman riding in the sea absolutely; interpreting that as a woman, if she rides a ship, would then need to uncover her Awrah (intimate parts) for relieving herself and the like, so she would be exposed. This is overlooked for a man but not forgiven for a woman. Also, in riding a ship, she might see the Awrah of men, and see the bodies of men on ships because riding ships requires hardship and toil which necessitates exposing the chest, belly, and back, as well as needing to uncover the Awrah out of necessity. This is what Imam Malik, may Allah have mercy on him, used as evidence to prevent women and dislike riding the sea for them. However, this is mostly negated, especially in our time, so the woman remains on the original ruling of the permissibility of riding the sea for her. His saying (peace and blessings of Allah be upon him): «Its water is purifying (Tahur)»:",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 25
  },
  {
    "serial_number": "2429121",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "(Tahur): If it comes with a Fatha (Ta-hur), the meaning is the water itself, which purifies the one purifying himself with it. If it comes with a Damma (Tu-hur), the meaning is the act of purifying. Similarly: Wudu (ablution) and Ghusl (bathing); if it comes with a Damma, the meaning is the state/act of bathing and the act of ablution and the state of purification. If it comes with a Fatha, the meaning is that with which one bathes, purifies, and performs ablution. Al-Nawawi narrated this from the majority. His saying (peace and blessings of Allah be upon him): «Its water is purifying (Tahur)»: This, as we mentioned, is a point of consensus among scholars, except for a slight disagreement narrated from some Companions of the Prophet (peace and blessings of Allah be upon him). However, it is not considered against what came from the Prophet (peace and blessings of Allah be upon him). The purifying nature of sea water has been narrated from a group of Companions, may Allah be pleased with them, and they stated it explicitly. Among them is Abu Bakr Al-Siddiq, may Allah be pleased with him, as Abu Bakr Ibn Abi Shaybah narrated in his Musannaf from the hadith of Ubaidullah bin Umar from Amr bin Dinar from Abu Al-Tufayl who said: Abu Bakr Al-Siddiq was asked: Can one perform ablution with sea water? He said: (Its water is purifying, its dead are lawful). This was also narrated from Umar bin Al-Khattab, Ibn Abbas, Ibn Sirin, Al-Hasan, Ikrimah, Tawus, and Ata. Some scholars held that sea water is pure, but they deemed fresh water better than it, and that one should not resort to purifying oneself with sea water except when fresh water is lacking. This is narrated from Sa'id bin Al-Musayyib, and also from Al-Nakha'i, as Ibn Abi Shaybah narrated from the hadith of Shu'bah from Qatadah from Sa'id bin Al-Musayyib who said: (If you are forced to it, there is no harm), meaning if you are forced to purify with sea water, there is no harm, implying he sees purification with water that is not salty but fresh [as preferable]. Similarly, it was narrated from Ibrahim Al-Nakha'i as Ibn Abi Shaybah and Abdul-Razzaq narrated in their Musannafs from Sufyan from Al-Zubayr bin Adi from Ibrahim Al-Nakha'i who said: (Sea water suffices, but fresh water is more beloved to me than it). However, what came from the Prophet (peace and blessings of Allah be upon him) indicates equality between fresh water and sea water.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 26
  },
  {
    "serial_number": "2429122",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "The saying of Sa'id bin Al-Musayyib and Ibrahim Al-Nakha'i does not stand against what came from the Prophet (peace and blessings of Allah be upon him). As mentioned, some scholars from the Companions of the Prophet (peace and blessings of Allah be upon him), who are few, held the view of the non-purity of sea water and the lack of legitimacy in performing ablution with it. Among them: Abdullah bin Umar and Abdullah bin Amr bin Al-Aas, may Allah be pleased with them. Ibn Abi Shaybah narrated from the hadith of Shu'bah from Qatadah from Uqbah, who said: I heard Abdullah bin Umar say: (Tayammum [dry ablution] is more beloved to me than ablution from sea water). So Abdullah bin Umar turned to Tayammum, which is a substitute, and that only happens when water is missing.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 27
  },
  {
    "serial_number": "2429123",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "It is known that whoever performs Tayammum while water exists and he is capable and able to use it, his purification is considered invalid and his prayer is considered invalid by consensus, except for an excuse that compels him to Tayammum such as illness, cold, and the like. But if he is not excused, then his Tayammum is considered invalid and his purification invalid, and he must perform ablution with water. So when Abdullah bin Umar turned to Tayammum and left purifying with sea water, it was understood that he did not view sea water as purifying. However, this does not stand against what came from the Prophet (peace and blessings of Allah be upon him). Likewise is what was narrated from Abdullah bin Amr bin Al-Aas, may Allah be pleased with him, as Ibn Abi Shaybah and Al-Bayhaqi narrated from the hadith of Hisham from Qatadah from Abu Ayyub from Abdullah bin Amr who said: (Sea water does not suffice for ablution nor Janabah [major ritual impurity]; indeed under the sea is fire, then water, then fire). This statement from Abdullah bin Amr, like that from Abdullah bin Umar, may Allah be pleased with them, shows they do not see sufficiency in sea water. This does not stand against what came from the Prophet (peace and blessings of Allah be upon him). This was also narrated from Abu Huraira in the Musannaf of Ibn Abi Shaybah but it is not authentic. And from Abu Al-Aliyah Al-Riyahi, who is Rufai' bin Mihran, as Ibn Abi Shaybah narrated from the hadith of Abu Ja'far from Al-Rabi' bin Anas from Abu Al-Aliyah that he rode the sea and his water ran out, so he performed ablution with Nabidh (date-water) and disliked performing ablution with sea water. He is among the major Tabi'in, may Allah have mercy on him. This is not established due to the condition of its chain. Therefore, sea water is purifying, and the disagreement regarding it is not considered. The consensus of scholars on the purifying nature of sea water has been recounted by a group of scholars, including Al-Hafiz Ibn Abd al-Barr, may Allah have mercy on him, and others. His saying (peace and blessings of Allah be upon him): «Its dead are lawful (Halal)»:",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 28
  },
  {
    "serial_number": "2429124",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "Meaning 'Halal' (lawful), as came in some narrations by Al-Daraqutni, may Allah have mercy on him, and other scholars, though there is debate on the soundness of the wording. The dead animals of the sea are Halal by consensus of scholars, except that scholars differed in excepting some dead animals of the sea. Abu Hanifa, may Allah have mercy on him, said: The dead animals of the sea are Halal except what is in the form of an animal like a dog or the form of a human and the like. Imam Ahmad, and this is the well-known position from him, may Allah have mercy on him, held: That the dead animals of the sea are Halal except the snake, the frog, and the crocodile. He said that the snake and the frog are among the foul things (Khaba'ith) and that the crocodile is considered among those about whom the Prophet (peace and blessings of Allah be upon him) said: It possesses a fang, and he forbade it. What the majority of scholars hold is that the dead animals of the sea are all considered permissible and Halal by the text of the Prophet's saying (peace and blessings of Allah be upon him). As for what Abu Hanifa, may Allah have mercy on him, excepted regarding what was in the form of an animal and the like, there is no evidence for it, and it does not stand against what came from the Prophet (peace and blessings of Allah be upon him), for the Prophet (peace and blessings of Allah be upon him) generalized permissibility regarding sea dead. As for what came from Imam Ahmad regarding excepting the frog and the crocodile, the frog is not considered a dead animal of the sea as it does not stay in the sea always, nor does it stay in the land, for it is between them; so it is not considered a sea dead animal, nor is it considered a land animal. Similar is the crocodile, for it lives between land and sea. The generalization of the Prophet (peace and blessings of Allah be upon him) intended the dead of the sea, meaning if the animal is taken out of the sea, it dies. Thus, the Prophet (peace and blessings of Allah be upon him) generalized permissibility for sea dead absolutely without exception. Whatever is known to be harmful among sea dead is then forbidden due to its harm, for there is no harm or reciprocating harm in Islam. Nothing is excepted from sea dead except what is proven harmful. As for what is between land and sea among animals, it is not considered a sea animal and remains on the original principle of permissibility. If it is among the foul things, it is considered foul. Whatever is likewise among harmful animals, it is then forbidden due to its harm, so there is no",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 29
  },
  {
    "serial_number": "2429125",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "harm or reciprocating harm in Islam. Allah, the Glorified and Exalted, has forbidden in His Great Book eating foul things. Allah, the Glorified and Exalted, said: {And makes lawful for them the good things and prohibits for them the evil}. *************************************** 2- On the authority of Abu Sa'id Al-Khudri, may Allah be pleased with him, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: «Indeed, water is purifying (Tahur), nothing makes it impure.» Narrated by the Three, and authenticated by Ahmad. The hadith of Abu Sa'id Al-Khudri, may Allah be pleased with him, was cited by the author, may Allah have mercy on him, stating that the Three narrated it. This is a terminology specific to him, may Allah have mercy on him. As for 'the Three' here, meant by them are: Abu Dawud, Al-Tirmidhi, and Al-Nasa'i; they are the people of the Sunan excluding Ibn Majah, may Allah have mercy on them all. This is among the terminologies considered specific to Al-Hafiz Ibn Hajar in his book Bulugh al-Maram. Therefore, we said that a student of knowledge should pay attention to the terminologies of scholars in their compilations to be clear about their judgments. This hadith was narrated by Abu Dawud, Al-Tirmidhi, and Al-Nasa'i. It was also narrated by Ahmad, Ibn Hibban, Al-Hakim, and Ibn Khuzaymah, all of them from the path of Hammad bin Usamah (Abu Usamah) from Al-Walid bin Kathir from Muhammad bin Ka'b from Ubaidullah bin Abdullah from Abu Sa'id Al-Khudri, may Allah be pleased with him.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 30
  },
  {
    "serial_number": "2429126",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "This hadith was authenticated by Imam Ahmad as mentioned by Al-Hafiz Ibn Hajar, may Allah have mercy on him. It was also authenticated by Ibn Ma'in, Ibn Hibban, Al-Hakim, Ibn Khuzaymah, and Sheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him. Imam Al-Tirmidhi, may Allah have mercy on him, classified it as Hasan (Good). He said after narrating it in his Sunan: This is a Hasan hadith, and Abu Usamah has presented this hadith excellently. When Imam Al-Tirmidhi uses the term (Hasan) on a hadith solely without addition, he usually implies weakness, but here he added [praise] and did not isolate it; and this is mostly the case, for he has called a few hadiths narrated in the Sahihayn just (Hasan). Ibn Al-Jawzi, may Allah have mercy on him, quoted in his book Al-Tahqiq from Imam Al-Daraqutni saying: That this hadith is not established. But Al-Daraqutni's speech, may Allah have mercy on him, regarding this report does not refer to this hadith from this path. Ibn Al-Jawzi's transmission, may Allah have mercy on him, from Imam Al-Daraqutni applying this speech to this path contains some laxity and leniency and is closer to illusion than intent; otherwise, Al-Daraqutni's speech, may Allah have mercy on him, regarding this hadith does not intend this path, may Allah have mercy on him. This hadith was deemed defective due to the anonymity of Ubaidullah bin Abdullah—and it was said Ubaidullah bin Abdur-Rahman. Ibn Al-Qattan Al-Fasi, may Allah have mercy on him, faulted it due to his anonymity, weakening the report by the anonymity of Ubaidullah bin Abdullah or Ibn Abdur-Rahman. He said, may Allah have mercy on him—i.e., Ibn Al-Qattan—in his book (Al-Wahm wal-Iham): Whatever the case, he is one whose condition and identity are unknown. Ibn Mandah, may Allah have mercy on him, said about him that he is unknown (Majhul). Al-Bukhari, may Allah have mercy on him, said: regarding the one who named his father Abdur-Rahman, he said: that is an error (Wahm). The meaning of this hadith is narrated from a group of Companions, may Allah be pleased with them. It was narrated from Umar bin Al-Khattab, Abu Huraira, Hudhayfah bin Al-Yaman, and Ibn Abbas. It is also narrated from a group of Tabi'in such as Sa'id bin Al-Musayyib, Mujahid bin Jabr, and Ikrimah the freedman of Abdullah bin Abbas. His saying (peace and blessings of Allah be upon him): «Indeed, water is purifying (Tahur)»:",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 31
  },
  {
    "serial_number": "2429127",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "(Tahur): Here, if it has a Fatha, the meaning is the water with which purification is performed. Similar is Wudu and Ghusl. But if it comes with a Damma, the meaning is the action; so if he says: Tuhur, Ghusl, or Wudu [with Damma], the meaning is the action, the action of the one performing ablution, bathing, or purifying. This is according to the majority of scholars, as transmitted by Imam Al-Nawawi, may Allah have mercy on him, and a group. His saying (peace and blessings of Allah be upon him): «Indeed, water is purifying (Tahur), nothing makes it impure». This is the basic principle regarding water: that it remains on its purity. Allah, the Glorified and Exalted, sent it down pure, so it does not transfer from its original state except with clear evidence, or a text from the Prophet (peace and blessings of Allah be upon him). If this water's attributes are changed by impurity, it is impure (Najis). Or by experience and testing if it is known that such water is impure; then in that case, it has transferred from its original state to impurity. So the origin in water is purity, and this is general as the Prophet (peace and blessings of Allah be upon him) said here: «Indeed, water is purifying, nothing makes it impure». His saying (peace and blessings of Allah be upon him): «Nothing makes it impure»: It is absolute but restricted by other reports, that if some impurity mixes with it and changes one of its three attributes, it has become impure by consensus. The explanation of this will come, by the permission of Allah the Exalted, in the hadith of Abu Umamah, may Allah be pleased with him, which follows. *************************************** 3- On the authority of Abu Umamah Al-Bahili, may Allah be pleased with him, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: «Indeed, water is not made impure by anything, except what overcomes its smell, its taste, and its color.» Narrated by Ibn Majah, and weakened by Abu Hatim. This hadith was narrated by Ibn Majah, and it was also weakened by Abu Hatim. Ibn Majah, may Allah have mercy on him, narrated it from the hadith of Rishdin bin Sa'd from Mu'awiyah bin Salih from Rashid bin Sa'd from Abu Umamah Al-Bahili, may Allah be pleased with him.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 32
  },
  {
    "serial_number": "2429128",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "The Muhaddithun (Hadith scholars) have agreed on the weakness of this hadith and impugning it. Its chain contains Rishdin bin Sa'd, whom a group of scholars have weakened. Imam Ahmad, Abu Zur'ah, and Al-Nasa'i weakened him. Abu Dawud and Yahya bin Ma'in said: He is nothing. Imam Ahmad also said: There is no harm in him regarding Al-Raqa'iq (heart-softening narrations). Abu Hatim said: His hadith is Munkar (denounced). The correct view regarding this report is that it is Mursal (hurried/disconnected) from the Prophet (peace and blessings of Allah be upon him) and is not authentic as connected (Mawsul) to him, as narrated by Abdul-Razzaq and Al-Daraqutni from the hadith of Al-Ahwas bin Hakim from Rashid bin Sa'd as Mursal from the Prophet (peace and blessings of Allah be upon him). This is the correct view preferred by a group of Huffaz like Abu Hatim Al-Razi and Imam Al-Daraqutni, may Allah have mercy on them. Al-Daraqutni said: No one raised it (connected it to the Prophet) other than Rishdin from Mu'awiyah, and he is not strong. Thawr bin Yazid followed Rishdin [in narrating], as narrated by Al-Bayhaqi from the hadith of Atiyyah bin Baqiyyah from his father from Thawr with it, and it is flimsy (Wahin). There is much disagreement in it; sometimes it is made from the Musnad of Abu Umamah and sometimes from Thawban. Scholars have agreed on the weakness of this hadith, and the consensus was recounted by a group like Imam Al-Nawawi, may Allah have mercy on him. However, its meaning is correct, and scholars have acted upon it. Indeed, a group of scholars recounted consensus on the correctness of its meaning, as recounted by Imam Ibn Hibban, may Allah have mercy on him, in his Sahih. Thus, the principle is that water is pure and purifying; it does not transfer from its original state except by an impurity that occurs in it changing one of its attributes. His saying (peace and blessings of Allah be upon him): «Except what overcomes its smell, its taste, and its color»: Scholars have agreed that there is no difference between the change of water by any of these three attributes—whether smell, taste, or color—and that this is a sign of the water's impurity if it has been changed by impurity. The only exception is a strange (Shadh) opinion narrated from Ibn Majashun, may Allah have mercy on him, excepting smell, but this has no weight against the consensus of scholars. The consensus was recounted by Al-Shafi'i, Ibn Al-Mundhir, Ibn Hibban in his Sahih, Al-Bayhaqi, Ibn Abd al-Barr, Ibn Qudamah, and Ibn Taymiyyah.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 33
  },
  {
    "serial_number": "2429129",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "The majority of scholars divide water into three categories. This is the view of the Hanbalis, Shafi'is, Malikis, and Hanafis: that water is divided into three categories: Tahur (Purifying), Tahir (Pure but not purifying), and Najis (Impure). They used as evidence the Hadith of the Sea, arguing that the questioner knew sea water was not Najis, but wanted to know if it was Tahir or Tahur. They also used hadiths forbidding bathing in stagnant water and washing the hand after sleep before dipping it. The explanation of these reports and their meanings will come. Some scholars held—which is a narration from Imam Ahmad, may Allah have mercy on him, reported from Abu Hanifa, and held by a group of verifying scholars like Sheikh Al-Islam Ibn Taymiyyah—that water is of two categories: Tahir (Pure/Purifying) and Najis (Impure). They used the hadith of Bi'r Buda'ah (Well of Buda'ah) and others as evidence. The verified view upon gathering evidences becomes clear: Water is divided into two categories: Tahir (Pure/Purifying) and Najis (Impure), and what scholars named 'Tahur' falls under the category of 'Tahir'. If water is changed by impurity that mixed with it and one of its attributes changed, then in that case it is considered Najis. This is the school of the four Imams; indeed, consensus has been recounted on this. And if water is changed in one of its attributes by the proximity (Mujawarah) of impurity to it, not by mixing; then it is considered Najis as well, and consensus has been recounted on this. So if one of the attributes of water changes by mixing or proximity, then that water is considered Najis. Consensus on this has been recounted by a group of scholars like Imam Al-Nawawi, may Allah have mercy on him. If water is changed by something pure (Tahir), like Nabidh (date-water/juice) and the like, is it considered Tahir (pure/purifying) or not? Scholars differed on this: - Imam Abu Hanifa, may Allah have mercy on him, held that one may perform ablution with it in one case: if he finds nothing else, then he performs ablution with it. Some Hanafis held—a view of Muhammad bin Hasan, may Allah have mercy on him—that it is Tahir Mutahhir (Pure and Purifying), but one performs Tayammum along with it as a precaution. This view contains some contradiction [to Sunnah], for it has not been reported from the Prophet (peace and blessings of Allah be upon him) in any situation that a man combines Wudu and Tayammum, and this implies some hardship.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 34
  },
  {
    "serial_number": "2429130",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "- The Malikis, Shafi'is, and Hanbalis—which is the view of the majority of scholars—held that one performs Tayammum and does not perform ablution with it. This is narrated from a group, just as it is narrated from Imam Abu Hanifa, may Allah have mercy on him, and also from Imam Ibn Hazm. They said this liquid is not called water except with an addendum (e.g., rose water, date water). They said consensus has formed that lifting ritual impurity (Hadath) is only by pure water. They said: Imam Ibn Al-Mundhir, may Allah have mercy on him, recounted that Hadath is not lifted by any liquid except water, and this [Nabidh] has been mixed with something else changing its color while remaining pure, but it does not lift Hadath. - Those who permitted ablution with Nabidh relied on what Imam Ahmad, may Allah have mercy on him, narrated: Yahya bin Zakariya told us from Isra'il from Abu Fazarah from Abu Zaid, freedman of Amr bin Hurayth, from Ibn Masud who said: I was with the Prophet (peace and blessings of Allah be upon him) the night he met the Jinn. He said: «Do you have water?» I said: No. He said: «What is in this vessel?» I said: Nabidh. He said: «Show it to me.» The Prophet (peace and blessings of Allah be upon him) said: «A good date and purifying water.» So he performed ablution from it and then prayed. However, this hadith is weak and not authentic. Its chain contains Abu Zaid, who is counted among the unknown narrators (Majahil). Imam Al-Tirmidhi, may Allah have mercy on him, said about him: Abu Zaid is a man unknown to the scholars of Hadith; he is not known to have any narration other than this hadith. Similarly, Al-Bukhari, Al-Hakim, and Ibn Adi declared his anonymity. He is the narrator from Abdullah bin Masud in this report. Thus, it is not valid to use it as evidence. For this reason, Al-Hafiz Ibn Adi, may Allah have mercy on him, faulted it saying: This hadith revolves around Abu Fazarah from Abu Zaid, freedman of Amr bin Hurayth, from Ibn Masud. Abu Fazarah is well-known, his name is Rashid bin Kaysan. Abu Zaid, freedman of Amr bin Hurayth, is unknown. This hadith is not authentic from the Prophet (peace and blessings of Allah be upon him), and it contradicts the Quran.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 35
  },
  {
    "serial_number": "2429131",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "It contains a contradiction [to the principle] that if water's attributes change: if by impurity, it becomes impure; and if by a pure substance, it remains pure [in itself], but it does not lift ritual impurity (Hadath). If it touches a person's body or clothes, it is not counted as impure; rather, it is among pure substances, but it does not lift Hadath for worship. *************************************** 4- And for Al-Bayhaqi: «Water is pure (Tahir) unless its smell, taste, or color changes; by an impurity that occurs in it.» This was narrated by Al-Bayhaqi, may Allah have mercy on him, from the path of Atiyyah bin Baqiyyah bin Al-Walid from his father from Thawr from Rashid bin Sa'd from Abu Umamah. Atiyyah bin Baqiyyah is considered truthful (Saduq), as narrated by Ibn Abi Hatim from his father in Al-Jarh wal-Ta'dil. However, his father Baqiyyah bin Al-Walid is among the Mudallisin (those who hide defects in the chain), and the coming of this report from this path contains some denouncability (Nakara) and strangeness (Gharabah). Thus, this path is not authentic from the Prophet (peace and blessings of Allah be upon him), and discussion on it has preceded. His saying (peace and blessings of Allah be upon him): «By an impurity that occurs in it»: This was used as evidence by those who said water does not become impure by proximity (Mujawarah). We mentioned that this opinion is strange (Shadh), attributed to Ibn Majashun. Rather, if one of the water's attributes changes by mixing or proximity, it is considered impure and it is not permissible to purify with it, for it lifts neither ritual impurity (Hadath) nor physical impurity (Najas). *************************************** 5- On the authority of Abdullah bin Umar, may Allah be pleased with them both, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: «If water reaches two Qullahs (jars), it does not carry filth.» And in a wording: «It does not become impure.» Narrated by the Four, and authenticated by Ibn Khuzaymah and Ibn Hibban. This hadith is what scholars call the Hadith of the Two Qullahs. It is narrated from the hadith of Hammad bin Usamah from Al-Walid bin Kathir from Muhammad bin Abbad bin Ja'far from Ubaidullah bin Abdullah from his father Abdullah bin Umar bin Al-Khattab, may Allah be pleased with him.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 36
  },
  {
    "serial_number": "2429132",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "This report has been faulted by some scholars, and authenticated by a group who are the majority. It was faulted due to disturbance (Idtirab) in its chain. It was narrated from Al-Walid bin Kathir from Muhammad bin Ja'far bin Al-Zubayr instead of Muhammad bin Abbad bin Ja'far. In some paths, it was narrated as Abdullah bin Abdullah instead of Ubaidullah bin Abdullah bin Umar bin Al-Khattab, may Allah be pleased with them. Scholars differed in preferring these aspects. Abu Dawud Al-Sijistani in his Sunan preferred the narration of Muhammad bin Abbad bin Ja'far. A group of Huffaz like Ibn Mandah, Ibn Hibban, and Abu Hatim disagreed with him, preferring the narration of Muhammad bin Ja'far bin Al-Zubayr. A group of Huffaz like Imam Al-Bayhaqi, Al-Daraqutni, and also Al-Zayla'i preferred both aspects [as valid]. Some scholars weakened it. Ibn Al-Qayyim and Ibn Daqiq al-Eid weakened it. Abu Bakr Ibn Al-Arabi weakened it while critiquing Al-Shafi'i, may Allah have mercy on him, in his book (Ahkam Al-Quran), as well as in his explanation of Sunan Al-Tirmidhi, may Allah have mercy on him. But he was odd when he faulted it due to Al-Walid bin Kathir. For Al-Walid bin Kathir is a reliable Hafiz (Thiqah Hafiz); the Group (authors of the six books) narrated from him, and no scholar impugned him except Ibn Sa'd, may Allah have mercy on him, who said: \"He is not that [strong].\" But Al-Walid bin Kathir is among the well-known reliable narrators from whom the Group narrated, and Ibn Sa'd's criticism of him, may Allah have mercy on him, is not accepted against the words of the Huffaz, may Allah have mercy on them. This report was also authenticated by a group of scholars: Ibn Khuzaymah, Ibn Hibban, Al-Hakim. Its authentication is also narrated from Al-Daraqutni, Al-Bayhaqi, and among the later scholars Ibn Taymiyyah and others, may Allah have mercy on them.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 37
  },
  {
    "serial_number": "2429133",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "A group of scholars have authored works discussing it and its paths. Al-Ala'i, may Allah have mercy on him, authored a section collecting the paths of this report. Muhammad bin Abdul Wahid Al-Maqdisi also authored a section collecting its paths, refuting Al-Hafiz Ibn Abd al-Barr, may Allah have mercy on him, regarding his weakening of this report, for Ibn Abd al-Barr, may Allah have mercy on him, weakened this report and was severe in weakening it; so Al-Maqdisi, may Allah have mercy on him, critiqued him in a section of his. It was also faulted due to disturbance in its text, as doubt was narrated in some paths: it appeared in some paths as 'two Qullahs or three' and did not say 'two Qullahs' only. This is narrated from the hadith of Hammad bin Usamah from Asim bin Al-Mundhir from Ubaidullah bin Abdullah from Abdullah bin Umar. Hammad bin Usamah changed at the end [of his life], and he opposed the reliable narrators in his narration here, falling into doubt. His saying here is outweighed due to his opposition to the reliable narrators, and this doubt counts as Shadh (an anomaly). Al-Hafiz Al-Bayhaqi, may Allah have mercy on him, clarified this and showed that this narration is outweighed. Also, among what occurred in it is that in some narrations it came that these Qullahs are 'Qullahs of Hajar', as Ibn Adi narrated in his Kamil from the hadith of Al-Mughirah bin Saqlab from Muhammad bin Ishaq from Nafi' from Abdullah bin Umar. Al-Mughirah bin Saqlab is 'Munkar al-Hadith' (his hadith is denounced). Al-Daraqutni, may Allah have mercy on him, clarified that this path is an error (Wahm) as he clarified in his Ilal, and he showed that the correct version is from Muhammad bin Ishaq from Muhammad bin Ja'far bin Al-Zubayr from Ubaidullah bin Abdullah from Abdullah bin Umar bin Al-Khattab, may Allah be pleased with them.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 38
  },
  {
    "serial_number": "2429134",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "Regardless of the discussion on its paths, a group has authenticated this report and others have weakened it. Some said that faulting it due to disturbance (Idtirab), whether in text or chain, does not weaken it; rather, the textual disturbance indicates the weakness of those specific aspects, while the origin of the hadith is established from the Prophet (peace and blessings of Allah be upon him). As for the chain disturbance, some scholars have answered it with answers, and some preferred both aspects, saying it was narrated from the Prophet (peace and blessings of Allah be upon him) in these two ways, as is the saying of Imam Al-Daraqutni, Al-Bayhaqi, and Al-Zayla'i, may Allah have mercy on them. Ibn Al-Qayyim expanded greatly in weakening this report and refuting those who strengthened it with valuable, solid, and strong speech. (Al-Qullah) is: with a Damma on the Qaf, taken from height/elevation. It is said: 'Qullat al-Jabal' meaning its peak. Scholars differed regarding the volume of the Qullah in the report of the Prophet (peace and blessings of Allah be upon him) and the measure by which the Qullah is known, according to several opinions: - It was narrated that the meaning of Qullah is two skins (Qirbah). This appeared in Kitab Al-Umm by Al-Shafi'i. He, may Allah have mercy on him, narrated in his book Al-Umm and also in his Musnad, saying: Muslim bin Khalid told us from Ibn Jurayj who said: The Qullahs of Hajar are two skins or two skins and a bit. - There is another opinion, the second opinion on the volume of the Qullah, narrated from Imam Al-Shafi'i, Imam Ahmad, and Abu Thawr, may Allah have mercy on them. They said: The Qullah holds two and a half skins. They used as evidence what was narrated from Ibn Jurayj previously, saying that Ibn Jurayj's saying 'The Qullah holds two skins or two skins and a bit', his saying (a bit / shay'an) here: the term 'shay'' is most often applied to a portion or a half. They said: So it is said as a precaution that the Qullah holds two and a half skins. This, as mentioned, is narrated from Imam Al-Shafi'i, Ahmad, and Abu Thawr. - There is a third opinion: They said the Qullah holds six skins. This is narrated from Ishaq bin Rahwayh, may Allah have mercy on him.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 39
  },
  {
    "serial_number": "2429135",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "- There is a fourth opinion on the volume of the Qullah: That it holds two Faraq (a specific measure). This is narrated from Yahya bin Aqil as Al-Daraqutni narrated in his Sunan, may Allah have mercy on him, from the hadith of Ibn Jurayj from Muhammad bin Yahya from Yahya bin Aqil who said: I saw the Qullahs of Hajar, and I saw the Qullah holds two Faraq. - A fifth opinion was also narrated regarding this: They said that the Qullah does not have a specific known volume from the Prophet (peace and blessings of Allah be upon him). This is narrated from Abdur-Rahman bin Mahdi, and also narrated from Waki', Yahya bin Adam, and a group of scholars. It is also narrated from Abu Ubaid, may Allah have mercy on them. The true opinion regarding this, by the permission of Allah the Exalted, is that the Two Qullahs do not have a specific volume according to scholars; but the meaning of Qullah is the Qullahs of Hajar, as recounted by some scholars. The Qullahs of Hajar were known among the Arabs, and their fame reached Medina. Indeed, they appeared on the tongue of the Prophet (peace and blessings of Allah be upon him) in an authentic report, as in the story of Isra' and Mi'raj from him (peace and blessings of Allah be upon him), as came in the Sahih from the hadith of Qatadah from Anas from Malik bin Sa'sa'ah, may Allah be pleased with him, in a long report. The Prophet (peace and blessings of Allah be upon him) said: «Then I was raised to the Lote Tree of the Utmost Boundary (Sidrat al-Muntaha), and I saw its fruits (Nabq) like the Qullahs of Hajar.» This indicates that the Qullahs of Hajar were known among the Arabs and known on the tongue of the Prophet (peace and blessings of Allah be upon him), and they are the closest to what the Prophet (peace and blessings of Allah be upon him) intended. The Qullah, as we mentioned, upon verification for one who contemplates the reports of the Prophet (peace and blessings of Allah be upon him), refers to the Qullahs of Hajar. If it is also known that the Qullahs of Hajar do not have a specific volume, it is known that the intent of the Prophet (peace and blessings of Allah be upon him) in this report is prevalence of thought (Ghalabat al-Zann), not certainty. His saying (peace and blessings of Allah be upon him): «If water reaches two Qullahs, it does not carry filth»: The saying of the Prophet (peace and blessings of Allah be upon him), if authentic: «If water reaches two Qullahs, it does not carry filth», has an explicit meaning (Mantuq) and an implied meaning (Mafhum).",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 40
  },
  {
    "serial_number": "2429136",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "* Its explicit meaning: If water is two Qullahs—despite the difference in the volume of the two Qullahs—it does not carry filth, unless its taste, smell, or color changes due to impurity occurring in it. This is a point of consensus among scholars. * The implied meaning of this report: Whatever is less than two Qullahs, the prevailing thought is that impurity affects it. However, scholars differed on the implied meaning here: Does what is less than two Qullahs become impure upon meeting impurity, even if its smell, taste, or color does not change? There is disagreement among scholars. - The Hanafis, Shafi'is, and an opinion among the Hanbalis (a narration from Imam Ahmad, may Allah have mercy on him) held: That if impurity meets small water, it becomes impure, even if its smell, taste, or color does not change. But those who held this view—which is the majority view—differed regarding 'small water': - The Hanafis said: Small water is that which if one side is moved, the other side moves. - The Hanbalis and Shafi'is held that small water is: Whatever is less than two Qullahs as estimated by the Prophet (peace and blessings of Allah be upon him). - A group of scholars held the second view, which is the saying of Ibn Al-Musayyib, Al-Hasan, Al-Thawri, Imam Malik may Allah have mercy on him, Ibn Mahdi, a narration from Ahmad, and it is the view of the verifying scholars like Sheikh Al-Islam Ibn Taymiyyah: That if impurity meets water and it is small, even if less than two Qullahs, it does not become impure unless its smell, color, or taste changes from that impurity. This is the true opinion. For the implied meaning of this report, if authentic from the Prophet (peace and blessings of Allah be upon him), is contradicted by the explicit meaning from him (peace and blessings of Allah be upon him) in the previous reports: «Indeed, water is purifying, nothing makes it impure». This is general speech from which nothing, small or large, is excepted.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 41
  },
  {
    "serial_number": "2429137",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "So the report of the Two Qullahs here is taken to mean that if water is abundant—two Qullahs or more—the probability of impurity occurring in it decreases, and if it is less than two Qullahs, then the prevailing thought is the occurrence and dominance of impurity over it, necessitating that criterion: that its smell, color, or taste changes from that impurity occurring in it. *************************************** 6- On the authority of Abu Huraira, may Allah be pleased with him, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: «None of you should bathe in stagnant water while he is Junub (sexually impure).» Narrated by Muslim. And for Al-Bukhari: «None of you should urinate in stagnant water that does not flow, then bathe in it.» And for Muslim: «from it» (Minhu). And for Abu Dawud: «And nor bathe in it from Janabah.» This hadith was narrated by Imam Muslim, may Allah have mercy on him, saying: Harun told us, Ibn Wahb told us, Amr bin Al-Harith informed me from Bukayr bin Al-Ashaj from Abu Al-Sa'ib, freedman of Hisham bin Zuhrah, from Abu Huraira, may Allah be pleased with him. His saying (peace and blessings of Allah be upon him): «None of you should bathe»: The 'Lam' (La) here is the Lam of prohibition (Nahiyah). Scholars differed on the implication of that prohibition: Is it for Haram (unlawfulness) or not? - The Malikis went and said that the saying of the Prophet (peace and blessings of Allah be upon him): «None of you should bathe in stagnant water that does not flow, then bathe in it»—despite the difference in narrations in Bukhari, Muslim, and Abu Dawud, may Allah have mercy on them—they said: This is interpreted as Makruh (disliked), specifically Karahat al-Tanzih (dislike of purity/propriety). They reasoned saying: The water remains on its purity and is not impure. So, this indicates that the prohibition here is a prohibition of dislike, not unlawfulness, for the Prophet (peace and blessings of Allah be upon him) does not prohibit something when the end result is the purity of the water even if the servant does it.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 42
  },
  {
    "serial_number": "2429138",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "- The Hanbalis and the opinion of the Zahiris went to the view that the prohibition of the Prophet (peace and blessings of Allah be upon him) here is for Haram (unlawfulness). They reasoned with many causes; they said: The default in the prohibition of the Prophet (peace and blessings of Allah be upon him) is unlawfulness, and this is not diverted except for an obvious cause or an obvious indicator from the Prophet (peace and blessings of Allah be upon him) or from the action of the Prophet's companions (peace and blessings of Allah be upon him). (Stagnant Water / Al-Ma' Al-Da'im): is the remaining, staying, still water that does not flow, moving only by the action of an actor, be it human or animal and the like. The rationale for this; the prohibition of bathing in stagnant water whether for Ghusl of Janabah or otherwise, they said is that stagnant water is predominantly prone to impurity remaining in it, while flowing water purifies itself by its flow and by the abundance of water in it. That is why the poet said: I have seen that the standing of water spoils it.........If it flows it becomes good, and if it does not flow, it does not become good. This is known; if water is still, whenever impurity comes to it and occurs in it, it generally becomes impure if it is small. As for that which flows, it meets other [water] and likewise impurity is removed from it by its flow in the earth. Scholars differed regarding if a Junub (person in state of major impurity) bathes in stagnant water, what is the ruling of that water? Depending on their disagreement regarding the amount by which water is considered small so it does not repel impurity. This disagreement is regarding small water; as for large water, they agree it does not become 'used' (Musta'mal), like a river, sea, large pond, and the like which exceed the limit of smallness by their consensus. But they differed on the limit of 'small', and upon it is built their disagreement regarding the impurity of used water. Scholars differed on three opinions; and they are narrations from Imam Ahmad, may Allah have mercy on him, although one of the narrations is considered strange (Gharib). First Opinion: They said it remains pure (Tahir) but is not purifying (Mutahhir). They said it can be drunk and cooked with, but ritual impurity (Hadath) cannot be removed by it, such as Wudu and Ghusl of Janabah. This is the well-known view from Ahmad and the view of the Shafi'is.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 43
  },
  {
    "serial_number": "2429139",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "Second Opinion: They said it is impure (Najis). If a Junub bathes in stagnant water, that indicates its impurity. So it cannot be drunk, cooked with, bathed with, nor performed ablution with, a fortiori. This is the view of Abu Hanifa and, as mentioned, a narration from Imam Ahmad. Some followers [of the Hanbali school] like Abu Ya'la Al-Hanbali, Ibn Aqil, and others interpreted it, but it is a narration far from him [Ahmad], may Allah have mercy on him. Perhaps some followers understood Ahmad's saying incorrectly and recounted that water becomes impure if a Junub bathes in it; otherwise, the Fiqh of Imam Ahmad, may Allah have mercy on him, is far from that. Third Opinion: They said that water in which a Junub bathes remains on its purifying nature (Tahuriyyah), and that it is Pure and Purifying (Tahir Mutahhir). This is the view of the majority of scholars. It is narrated from Sufyan Al-Thawri, as well as Malik bin Anas, Al-Shafi'i, and Ahmad. It is the view of the verifying scholars like Sheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him. They said: Water in which a Junub bathes remains on its original state, and it does not transfer from its original state except with evidence from the Prophet (peace and blessings of Allah be upon him). The prohibition of the Prophet (peace and blessings of Allah be upon him) against the Junub bathing in stagnant water is not related to the purity or impurity of the water after bathing in it. Rather, it is for a cause: either discipline from the Prophet (peace and blessings of Allah be upon him), or preventing bathing in stagnant [water] so that a person does not become careless about bathing in it in any condition, thus spoiling the water by changing its attributes, or other reasons whose wisdom is hidden. It is not said that the water is impure or transferred from its original state except with evidence or an obvious cause explicitly stated by the Prophet (peace and blessings of Allah be upon him). His saying: And for Al-Bukhari: «None of you should urinate in stagnant water that does not flow, then bathe in it.» This narration which Al-Bukhari, may Allah have mercy on him, narrated saying: Abu Al-Yaman told us, saying Shu'ayb informed us from Abu Al-Zinad from Al-A'raj from Abu Huraira, may Allah be pleased with him. And in it is his saying: «then bathe in it»:",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 44
  },
  {
    "serial_number": "2429140",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Fragment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh al-Maram, Transcribed by Some Interested People",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "This narration brought a ruling that some scholars derived from it, saying: The prohibition of the Prophet (peace and blessings of Allah be upon him) is linked to the combination [of actions], meaning a man should not urinate in stagnant water and then bathe in it. But if he bathes in it without urinating, there is no harm. Those who held this view held fast to this narration. His saying: And for Muslim: «from it» (Minhu): The narration of Imam Muslim, may Allah have mercy on him, with his saying: «from it» was narrated by him, may Allah have mercy on him, saying: Muhammad bin Rafi' told us, Abdul-Razzaq told us from Ma'mar bin Rashid from Hammam bin Munabbih from Abu Huraira, may Allah be pleased with him. In it is evidence for the opinion of some scholars that the prohibition of the Prophet (peace and blessings of Allah be upon him) is not specific to the Junub immersing himself in the water, but his prohibition (peace and blessings of Allah be upon him) also includes bathing from that water even if he scoops from it. This narration appears, and Allah knows best, to have been narrated by meaning (Bi-al-Ma'na); otherwise, the prohibition of the Prophet (peace and blessings of Allah be upon him) is apparent from the explanation of Abu Huraira, may Allah be pleased with him, when Abu Al-Sa'ib asked him, may Allah have mercy on him: How should he do, O Abu Huraira? He said: He should take it by scooping (Yatnawaluhu Tanawulan). This contradicts Abu Huraira's, may Allah be pleased with him, explanation of this [specific wording of the] narration. His saying: And for Abu Dawud: «And nor bathe in it from Janabah»:",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 45
  },
  {
    "serial_number": "2429141",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "This narration was narrated by Abu Dawud, may Allah have mercy on him, saying: Musaddad told us, Yahya bin Saeed Al-Ansari told us, from Muhammad bin Ajlan, from his father, from Abu Hurairah, may Allah be pleased with him. Imam Ahmad also narrated it from Yahya, from Ibn Ajlan with the same chain. By the apparent look of the chain, Muhammad bin Ajlan and his father are trustworthy (Thiqat), and their hadiths are upright. However, Ibn Ajlan's contradiction in this narration necessitates consideration and pause regarding it. No one narrated the combination of [the prohibition of] bathing in stagnant water and the prohibition of a Junub person bathing in stagnant water except Muhammad bin Ajlan. His solitary narration necessitates doubt regarding the establishment of this wording. Rather, what is apparent is its anomaly (Shudhudh), as the report is singular and he contradicted trustworthy narrators in it, alongside the fact that Ibn Ajlan has some lightness in his precision (Dabt) and is not among the trustworthy Hafiz (memorisers). The hadith is well-known from Abu Hurairah, narrated by a group of his companions such as Al-A'raj, Ibn Sirin, Hammam, Hamid bin Abdur-Rahman, and others, and Ibn Ajlan was solitary in narrating from his father with this wording. What must be known is the necessity of care and alertness to such differences in hadiths of rulings (Ahkam). Jurists often overlook this, so you see opinions varying based on the variation of the multiple wordings of the hadith, as in this report. If the wordings were collected, that would become clear. This occurs very frequently in books of Fiqh; hadiths are often narrated from one path and one source, yet their wordings vary because they were narrated by meaning or narrated without precision. Despite this, the opinions of jurists multiply with the multiplicity of these narrations. This is what one should be alert to in many issues of Fiqh and its evidences. If these multiple wordings for a single hadith were edited and the authentic one among them known, the opinions relying on [the weak wordings] would be weakened.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 46
  },
  {
    "serial_number": "2429142",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "What must also be known is that hadiths in many chapters agree on a specific ruling that the hadith came to establish, which is the reason for the hadith's occurrence and the narrators' transmission of it. The narrators focus on transmitting the report and preserving the wording that carries the ruling of the hadith, but they do not take care to preserve what came incidentally in the hadith, such as mentioning a story or another wording that does not stipulate the ruling. Thus, the wordings vary and differ. This occurs very frequently, so these [jurists] hold onto those wordings to interpret the ruling, while the ruling is singular if stripped of those wordings that came incidentally in the context of the hadith, which narrators often do not prioritize. Despite the source of the hadith being one, and it being certain that the Prophet (peace and blessings of Allah be upon him) said it in one instance, opinions divide in interpreting the ruling based on the difference of those incidental wordings that are not fundamental to the report. For example, you find difference in the report of Al-Miqdad: 'Perform ablution (Wudu) and sprinkle water on your private part' or 'Wash your penis and perform ablution.' The text came, and for its sake the report was transmitted, regarding the lack of [necessity for] Ghusl (full bath) from Madhi (pre-seminal fluid) and that washing the penis and Wudu suffice. However, some held onto [specific wordings] and opinions divided according to the context of the report: Is Wudu valid before cleaning the private parts or not? Is Wudu valid before washing the penis or not? This issue occurs frequently, so one must be alert to it. *************************************** 7- From a man who accompanied the Prophet (peace and blessings of Allah be upon him), he said: The Messenger of Allah (peace and blessings of Allah be upon him) forbade 'that a woman bathes with the leftover water of a man, or a man with the leftover water of a woman, but let them scoop [water] together.' Narrated by Abu Dawud and Al-Nasa'i, and its chain is authentic (Sahih). This hadith was narrated by Ahmad, Abu Dawud, and Al-Nasa'i from the hadith of Abu Awanah, from Dawud bin Abdullah Al-Awdi, from Hamid bin Abdur-Rahman Al-Himyari, who said: I heard a man who accompanied the Prophet (peace and blessings of Allah be upon him) just as Abu Hurairah accompanied him for four years.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 47
  },
  {
    "serial_number": "2429143",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "This hadith has an authentic chain. Some scholars have criticized it with reasons that do not impair it. Ibn Hazm, may Allah have mercy on him, criticized it, and Al-Bayhaqi, may Allah have mercy on him, indicated that it has the ruling of Mursal (disconnected). However, the anonymity (Jahalah) of the Companion here does not harm, and this is the view of the generality of scholars. No one disagreed with this except Ibn Hazm and Abu Ishaq Al-Isfarayini, as they said that the anonymity of the Companion causes harm, justifying this with an unacceptable reasoning. The scholars hold that the anonymity of the Companion does not harm because Allah, Glorified and Exalted be He, has declared their integrity in His Great Book and was pleased with them, Glorified and Exalted be He. This is stated in the Book of Allah, the Majestic and Exalted, and is a matter of consensus among the righteous predecessors (Salaf), may Allah have mercy on them. Among those who stated this are Imam Ahmad and Al-Humaydi, while Al-Bayhaqi was inconsistent on this, may Allah have mercy on them all. Imam Ahmad said: If a man from the Tabi'in says 'A man from the Companions told me' and does not name him, the hadith is authentic. Al-Humaydi said: If the chain is authentic from trustworthy narrators to a man from the Companions, it is a proof even if he does not name him. Ibn Hazm, may Allah have mercy on him, his statement does not stand against the statements of the Imams of this field; he is not one to be contrasted with Ahmad, Al-Bukhari, Ibn Al-Madini, Al-Daraqutni, Ibn Ma'in, Al-Nasa'i, Al-Tirmidhi, and their likes. He is one of those who apply the apparent meaning in criticism and overlooks indications (Qara'in), like many of the later scholars such as Ibn Al-Qattan Al-Fasi and the like. Indeed, Ibn Hazm has delusions in identifying narrators and their names that are not usually found among the great Imams. He was deluded regarding the name of Hammad, making him Ibn Zaid while the correct one is Ibn Salamah, for the narrator from him is Musa bin Ismail. Also his lack of knowledge regarding Dawud, the narrator of this hadith, as will come, and other instances which I have not seen among the critical Hafiz scholars, and if found among them, it is very rare.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 48
  },
  {
    "serial_number": "2429144",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "Dawud bin Abdullah Al-Awdi was declared trustworthy by Imam Ahmad as well as by Ibn Ma'in, may Allah have mercy on them. Ibn Ma'in, may Allah have mercy on him, was quoted regarding Dawud bin Yazid Al-Awdi as saying: 'He is nothing' (i.e., weak). Hafiz Al-Mizzi, may Allah have mercy on him, imagined that this ruling was regarding Dawud bin Abdullah Al-Awdi, the narrator of this report, so he mentioned this criticism and wounding in the entry of Dawud bin Abdullah Al-Awdi in his book *Al-Tahdhib*. This is a delusion that should be noted, for Ibn Ma'in's statement regarding Dawud Al-Awdi: 'He is nothing,' did not refer to Dawud bin Abdullah, but rather Dawud bin Yazid. Dawud bin Yazid Al-Awdi is known to be weak. Ibn Hazm, may Allah have mercy on him, criticized this report based on Dawud Al-Awdi due to his ignorance of his status. He said, may Allah have mercy on him: 'If this Dawud is the uncle of Ibn Idris, then he is weak, otherwise he is unknown (Majhul).' A group of scholars, such as Ibn Al-Qattan Al-Fasi, critiqued him, mentioning that Al-Humaydi declared this report authentic. He wrote a treatise to Ibn Hazm, may Allah have mercy on him, explaining the authenticity of this report and clarifying the status of Dawud bin Abdullah Al-Awdi, stating that he is a known trustworthy narrator, neither unknown nor weak. He said, may Allah have mercy on him: 'I do not know if Ibn Hazm, may Allah have mercy on him, retracted his statement or not.' The witness in this is that the chain of this report is authentic. It was authenticated by some scholars such as Al-Humaydi, Ibn Al-Qattan Al-Fasi, the author Ibn Hajar here, and others. Al-Maymuni reported from Imam Ahmad his criticism of the reports narrated regarding the prohibition of purifying oneself with the leftover water of a woman and regarding its permissibility, considering them inconsistent (Mudtarib).",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 49
  },
  {
    "serial_number": "2429145",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "This indicates that Imam Ahmad, may Allah have mercy on him, did not stipulate authenticity in his *Musnad*, but rather stipulated fame (Shuhrah). The meaning of fame is what is known among the Hafiz scholars and became famous, even if it is not famous or known among those below them; it does not mean fame among the terminologists. Imam Ahmad said to his son Abdullah when he asked him about a weak hadith he included in the *Musnad*: 'I only intended the famous in the *Musnad*, and I left people under the cover of Allah. If I wanted to include only what is authentic according to me, I would not have narrated this *Musnad* except a little bit.' This was recounted by more than one Imam and a group of Hanbalis like Abu Ya'la, Ibn Taymiyyah, Ibn Al-Qayyim, and others. Therefore, you find that Imam Ahmad narrated hadiths in his *Musnad* yet criticized them, indeed some he denounced. Examples of this are very many, including this hadith, and also what Imam Ahmad narrated in his *Musnad* via Abu Al-Umays Utbah from Al-Ala' bin Abdur-Rahman bin Yaqub from his father from Abu Hurairah, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'When it is the middle of Sha'ban, hold off from fasting until it is Ramadan.' Harb reported from Ahmad his saying regarding this hadith: 'This is a rejected (Munkar) hadith; Al-Ala' did not narrate a hadith more rejected than this, and Abdur-Rahman bin Mahdi would not narrate it.' Among them is also what he narrated in his *Musnad* from the hadith of Abu Hurairah, Abu Saeed, and others: 'There is no ablution for one who does not mention the name of Allah upon it.' He said: 'Nothing is established regarding this from the Prophet (peace and blessings of Allah be upon him).' Among them is what he narrated in his *Musnad* from the hadith of Ismail from Qais from Jarir bin Abdullah Al-Bajali who said: 'We used to consider gathering at the family of the deceased and making food after his burial as wailing.' Abu Dawud reported from Imam Ahmad his saying regarding it: 'It has no basis.' And among them is what he narrated in his *Musnad* from the hadith of Baqiyyah from Uthman bin Zafar from Hashim from Ibn Umar who said: 'Whoever buys a garment for ten dirhams containing one dirham of haram (unlawful money), Allah will not accept a prayer from him as long as he wears it.' He said: Then he put his fingers in his ears and said: 'Deafness [be upon them] if I did not hear the Prophet (peace and blessings of Allah be upon him) say it.' Ahmad said: 'It has no chain (Isnad).' By this phrase, he means it has no chain that can be relied upon.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 50
  },
  {
    "serial_number": "2429146",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "It is akin to hadiths that are narrated but have no chain at all. Likewise, among the examples is this hadith which is with us, as we mentioned regarding the prohibition of bathing with the leftover water of a man and a woman. This report regarding his prohibition (peace and blessings of Allah be upon him) that a woman bathes with the leftover water of a man and a man with the leftover water of a woman, scholars have differed regarding the prohibition of the Prophet (peace and blessings of Allah be upon him) therein: - The literalists (Ahl al-Zahir) went to the view, and it is narrated from Imam Ahmad and is the view of the Hanbalis, may Allah have mercy on them, that the prohibition here is for unlawfulness (Tahrim); because the default regarding the prohibition of the Prophet (peace and blessings of Allah be upon him) is that it is interpreted as unlawfulness.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 51
  },
  {
    "serial_number": "2429147",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "- A group of scholars, and it is a view of the Malikis, went to the view that the prohibition of the Prophet (peace and blessings of Allah be upon him) is for propriety (Tanzih) and is interpreted as dislike (Karahah). This is due to the arrival of several reports from him (peace and blessings of Allah be upon him), as well as from the Companions of the Prophet (peace and blessings of Allah be upon him), that a man may bathe with the leftover water of a woman. Al-Bukhari and others narrated from Malik from Nafi' from Abdullah bin Umar who said: 'Men and women used to perform ablution together during the time of the Prophet (peace and blessings of Allah be upon him).' Also, what the authors of the Sunan (Abu Dawud, Al-Tirmidhi, Al-Nasa'i, Ibn Majah) narrated, and also Imam Ahmad, Ibn Khuzaymah, Ibn Hibban, and others narrated from the hadith of Simak bin Harb from Ikrimah from Abdullah bin Abbas: Some of the wives of the Prophet (peace and blessings of Allah be upon him) bathed in a large bowl. The Prophet (peace and blessings of Allah be upon him) came to bathe from it, so his wife said: 'I was Junub (in a state of major impurity).' The Prophet (peace and blessings of Allah be upon him) said: 'Water does not become Junub.' This report was criticized by some scholars and authenticated by others. It was authenticated by Ibn Khuzaymah, Ibn Hibban, Al-Hakim, and Ibn Hajar as in his book here. Some scholars criticized it, and Imam Ahmad hesitated regarding it due to the status of Simak bin Harb. Simak bin Harb was declared trustworthy by Ibn Ma'in, and Al-Nasa'i said of him: 'There is no harm in him.' Ibn Al-Madini and Yaqub bin Shaybah said: 'He is inconsistent (Mudtarib) in narrating from Ikrimah.' Al-Daraqutni said: 'If Sufyan, Shu'bah, and Abu Al-Ahwas narrate from him, then his hadiths are sound.' In this report, Sufyan narrated from him as in Imam Ahmad and Al-Nasa'i, and Abu Al-Ahwas narrated from him as in Abu Dawud, Al-Tirmidhi, Ibn Hibban, Al-Tabarani, and others. Also, Shu'bah bin Al-Hajjaj narrated it from him. The wordings differed; Shu'bah, Sufyan, and Abu Al-Ahwas narrated it with the wording: 'Water is not made impure by anything,' which is the correct one, and it is not authentic with the wording 'Water does not become Junub.' Mostly, if Shu'bah, Sufyan, and Abu Al-Ahwas narrate from him, it is...",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 52
  },
  {
    "serial_number": "2429148",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "...indicative of his precision in this report, and that this report is upright. The reliance is to look, along with that, at the uprightness of the hadith, lack of strangeness or inconsistency, and that he is not solitary in reporting what trustworthy Hafiz scholars have not brought. Al-Bukhari narrated from Ikrimah, the freed slave of Abdullah bin Abbas, in his Sahih. Here is an issue that should be noted: When narrations like this exist where a narrator whom Al-Bukhari included narrates from a narrator whom Imam Muslim included, it is not said regarding such a report that it is 'according to the condition of Al-Bukhari' nor 'according to the condition of Muslim.' Nor is it said 'according to the condition of the Sahih' without referencing Bukhari or Muslim. Rather, it is said 'its narrators are the narrators of the Sahih' or 'its narrators were included in the Sahih.' We have mentioned that such phrases do not indicate the authentication of the hadith, for Simak bin Harb's narration from Ikrimah contains inconsistency as mentioned by Ibn Al-Madini as well as Yaqub bin Shaybah, even though Imam Muslim included Simak bin Harb in his narrations from other than Ikrimah, and Al-Bukhari included Ikrimah, the freed slave of Abdullah bin Abbas, without Simak bin Harb's narration from him. So it cannot be said that it is according to the condition of one of them, let alone the condition of both. The saying of some: 'Its narrators are the narrators of the Sahih' does not avail in authenticating this report or other reports. Claiming 'according to the condition of the Sahih' for hadiths is something many have been lenient about, looking at the apparent chains and judging so. This is incorrect, for there are things other than the sequence of narrators that must be looked into, which are strangeness, singularity, lack of contradiction, and the soundness of the text (Matn). Hadiths have been found which were claimed to be according to the condition of Bukhari or Muslim or both, yet their texts contain objectionability (Nakarah) and strangeness. This is incorrect, as the Two Sheikhs (Bukhari and Muslim) look at the texts just as they look at the chains and the men. This has been overlooked by many who attribute themselves to knowledge in the current era. Based on this, the hadith of Simak bin Harb from Ikrimah is of three types:",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 53
  },
  {
    "serial_number": "2429149",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "First: What he narrated from Ikrimah from Ibn Abbas and was solitary in it, without being corroborated; objectionability (Nakarah) dominates it, so it is rejected. An example is what Abu Dawud, Al-Tirmidhi, Al-Nasa'i, and Ibn Majah narrated from the hadith of Simak from Ikrimah from Ibn Abbas who said: A Bedouin came to the Prophet (peace and blessings of Allah be upon him) and said: 'I saw the crescent moon.' He said: 'Do you testify that there is no god but Allah? Do you testify that Muhammad is the Messenger of Allah?' He said: 'Yes.' He said: 'O Bilal, announce to the people to fast tomorrow.' The correct view regarding it is that it is Mursal (disconnected). A group such as Sufyan Al-Thawri and others narrated it from Simak from Ikrimah as Mursal, and Hafiz scholars like Al-Tirmidhi and Al-Nasa'i considered that correct. Hafiz scholars like Ibn Al-Madini, Ahmad Al-Ajli, Al-Daraqutni, and others rejected Simak's solitary narrations from Ikrimah. Second: What he narrated from Ikrimah from Ibn Abbas, and his early companions like Shu'bah, Sufyan, and Abu Al-Ahwas narrated it from him. This type is examined for the uprightness of its text and lack of strangeness and objectionability; if it is so, it is accepted. Third: What he narrated from Ikrimah from other than Ibn Abbas, like Aisha and others, and was not among those whose text is denounced and did not stand alone with a fundamental principle; it is carried as upright and authentic as long as it is not contradicted. As Al-Nasa'i, Al-Tayalisi, and Al-Bayhaqi narrated from Simak from Ikrimah from Aisha (may Allah be pleased with her) who said: The Messenger of Allah (peace and blessings of Allah be upon him) entered upon me one day and said: 'Do you have anything?' I said: 'No.' He said: 'Then I am fasting.' This is authentic, authenticated by Hafiz scholars like Al-Daraqutni, Al-Bayhaqi, and others. Regarding the issue of bathing with leftover water, the Prophet (peace and blessings of Allah be upon him) bathed with the leftover water of Maimunah, may Allah be pleased with her, as in Sahih Muslim from the hadith of Abdullah bin Abbas. Thus, a man washing with a woman's leftover water is permissible and sufficient, and that is not interpreted as unlawful, combining the reports that came from the Prophet (peace and blessings of Allah be upon him) as well as from the Companions of the Prophet, may Allah be pleased with them. *************************************** 8- And from Ibn Abbas (may Allah be pleased with them both); that the Prophet (peace and blessings of Allah be upon him) used to bathe with the leftover water of Maimunah (may Allah be pleased with her). Narrated by Muslim.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 54
  },
  {
    "serial_number": "2429150",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "This hadith was narrated by Imam Muslim from the hadith of Muhammad bin Bakr from Ibn Jurayj from Amr bin Dinar who said: 'The most I know, and what crosses my mind, is that Abu Al-Sha'tha told me from Abdullah bin Abbas that the Prophet (peace and blessings of Allah be upon him) bathed with the leftover water of Maimunah, may Allah be pleased with her.' This report diverts what came from the Prophet (peace and blessings of Allah be upon him) prohibiting a man from bathing with a woman's leftover water or a woman with a man's leftover water from unlawfulness; it diverted it from unlawfulness to dislike of propriety (Karahat Al-Tanzih), otherwise the Prophet (peace and blessings of Allah be upon him) would not have done something he had forbidden. It also contains evidence that water remains upon its purity and purifying nature, staying on its original state not diverting to anything else. Since the Prophet (peace and blessings of Allah be upon him) did that and his Companions, may Allah be pleased with them, did it, this indicates the continuity of water in its original state. And that the Prophet (peace and blessings of Allah be upon him), when he forbade a man bathing with a woman's leftover water or a woman with a man's leftover water, it was a prohibition of dislike, and that it is preferable for a man to bathe after a woman without her leftover water, and a woman to bathe after a man without his leftover water, or they scoop from one vessel together. That is what the Prophet (peace and blessings of Allah be upon him) drew attention to by forbidding it, a prohibition of dislike and not a prohibition of unlawfulness.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 55
  },
  {
    "serial_number": "2429151",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "In the chain of this report, there are issues mentioned by the scholars of Hadith, may Allah have mercy on them, regarding the saying of Amr bin Dinar: 'The most I know, and what crosses my mind, is that Abu Al-Sha'tha told me...'. He fell into doubt, may Allah have mercy on him. Despite that, Imam Muslim, may Allah have mercy on him, included this report in his Sahih, even though Amr bin Dinar had some doubt regarding Abu Al-Sha'tha narrating to him from Abdullah bin Abbas, may Allah be pleased with them. The answer to this is that the doubt of trustworthy Hafiz scholars like Amr bin Dinar is like the certainty of others, especially if their conjecture leans towards something. Therefore, Shu'bah bin Al-Hajjaj said: 'Mis'ar's doubt is dearer to me than the certainty of others.' He also said this regarding Ibn Awn. It was narrated that Shu'bah asked Ayyub about a hadith and he said, 'I doubt it,' so he said to him, 'Your doubt is dearer to me than the certainty of others.' For if a trustworthy narrator doubts a matter and leans towards one side, as in Amr bin Dinar's narration here, it indicates his extreme caution and precision, unlike one with light precision or a truthful narrator (Saduq) or trustworthy narrators who are not known for memorization or precision, for if they doubt, one pauses regarding it. Indeed, the scholars, may Allah have mercy on them, have said: If a Hafiz narrates a hadith from his Sheikh and his Sheikh denies having told him that report, his hadith is authentic. If the Sheikh denies having told him that report, it is either because forgetfulness occurred to the Sheikh or some heedlessness and the like. Narrations have come from the Prophet (peace and blessings of Allah be upon him) with chains containing such instances; some Sheikhs denied having told students, even though the students were Hafiz scholars, and the Hafiz scholars accepted their narrations. Al-Bukhari and Muslim included such instances in their Sahihs, just as Imam Muslim included such doubt here in the hadith of Amr bin Dinar from Abu Al-Sha'tha from Abdullah bin Abbas, may Allah be pleased with them. ***************************************",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 56
  },
  {
    "serial_number": "2429152",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "9- And for the authors of the Sunan: Some of the wives of the Prophet (peace and blessings of Allah be upon him) bathed in a large bowl. He came to bathe from it, so she said to him: 'I was Junub.' He said: 'Water does not become Junub.' Authenticated by Al-Tirmidhi and Ibn Khuzaymah. This hadith is the hadith of Abdullah bin Abbas. We alluded to it previously in the hadith before last, that it is the hadith of Abdullah bin Abbas, narrated from him by Ikrimah, narrated from Ikrimah by Simak bin Harb, narrated from Simak bin Harb by Sufyan Al-Thawri, and with Sufyan, Shu'bah bin Al-Hajjaj and Abu Al-Ahwas narrated it. These are trustworthy Hafiz scholars; if they narrate a hadith from Simak bin Harb, even if from Ikrimah from Ibn Abbas, it is mostly upright. It might have something objectionable and be rejected; but these [narrators] select hadiths from their Sheikhs. Al-Daraqutni, may Allah have mercy on him, said about Simak bin Harb: 'If Sufyan, Shu'bah, and Abu Al-Ahwas narrate from him, his hadiths are sound.' Simak bin Harb's narration from Ikrimah contains some inconsistency (Idtirab), as recounted by Ibn Al-Madini and Yaqub bin Shaybah, and also Ahmad bin Abdullah Al-Ajli, may Allah have mercy on him. Otherwise, Simak bin Harb himself is among the trustworthy narrators; Ibn Ma'in declared him trustworthy, and Al-Nasa'i said of him: 'There is no harm in him, but there is something in his hadith.' Imam Ahmad, may Allah have mercy on him, hesitated regarding him due to his extreme caution regarding Simak bin Harb's status, for no one other than Simak bin Harb narrates it; it was not narrated except through Simak bin Harb. The hadith with this wording mentioned by the author is not authentic. The correct [wording] is what the trustworthy companions of Simak, like Shu'bah, Sufyan, and Abu Al-Ahwas, agreed upon: 'Water does not become impure' or 'Nothing makes it impure.' We have previously discussed it and Simak bin Harb's narration from Ikrimah, the freed slave of Ibn Abbas, in detail.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 57
  },
  {
    "serial_number": "2429153",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "In this report, there is also evidence, as we mentioned previously, that it diverts the prohibition of the Prophet (peace and blessings of Allah be upon him) regarding a man bathing with the leftover water of a woman, or a woman with the leftover water of a man—and that they should scoop together—and that the prohibition implies dislike, specifically dislike of propriety, not a dislike of unlawfulness. Otherwise, the Prophet (peace and blessings of Allah be upon him) would not have said to his wife, may Allah be pleased with her: 'Water does not become impure,' and bathed from it (peace and blessings of Allah be upon him). 10- And from Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'The purification of the vessel of one of you, if a dog licks in it, is to wash it seven times, the first of them with soil.' Narrated by Muslim. This hadith was narrated by Imam Muslim, may Allah have mercy on him, saying: Zuhayr bin Harb told us, Ismail bin Ibrahim told us, from Hisham bin Hassan, from Muhammad bin Sirin, from Abu Hurairah, may Allah be pleased with him. His saying (peace and blessings of Allah be upon him): 'If the dog licks': 'Wulugh' (licking/lapping) here is: Drinking with the tongue. This is specific to the dog and similar predatory animals. Licking does not occur except with a liquid like water and the like. From this, it is taken—as scholars have taken—that if a dog places its tongue on something solid and the like, this does not have the ruling of liquid, and it is not washed seven times. Rather, the part where the dog placed its tongue is taken and washed like other impurities or removed and thrown away. It is not said that that spot is washed seven times, because the Prophet (peace and blessings of Allah be upon him) restricted that to licking ('Wulugh'), and licking only happens in drinking. This wording which came from the Prophet (peace and blessings of Allah be upon him) here in his saying: 'If it licks', we mentioned that it is specific to the dog and what is in its ruling among predators. However, the Prophet (peace and blessings of Allah be upon him) specified this ruling to the dog and did not generalize it to all other predators by his saying: 'If the dog licks in the vessel of one of you.' This is specific to the dog and does not encompass all other predators.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 58
  },
  {
    "serial_number": "2429154",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "It has come from the Prophet (peace and blessings of Allah be upon him), his saying: 'If it drinks.' It is known that a dog does not 'drink' (shariba) but rather 'licks' (yaligh), and this is known among the Arabs. This came in the Two Sahihs: from the hadith of Malik from Abu Al-Zinad from Al-A'raj from Abu Hurairah that the Prophet (peace and blessings of Allah be upon him) said: 'If the dog drinks.' Hafiz Ibn Abd al-Barr, may Allah have mercy on him, said that Imam Malik was solitary in this wording, i.e., 'If it drinks.' The truth is that Imam Malik, may Allah have mercy on him, was not solitary in this wording 'If it drinks.' What appears, and Allah knows best, is that it is from someone above him or someone below him, or that this report was narrated by meaning from the Prophet (peace and blessings of Allah be upon him). This wording came from other than Imam Malik, may Allah have mercy on him. Indeed, more than one narrator reported this news from Imam Malik without mentioning the wording 'If it drinks,' but rather said: 'If it licks.' This came in Abu Ubaid's book (*Al-Tahur*) from the hadith of Ismail bin Umar from Malik from Abu Al-Zinad from Al-A'raj from Abu Hurairah from the Prophet (peace and blessings of Allah be upon him) that he said: 'If it licks.' Also, Ibn Majah narrated it from the hadith of Ruh bin Ubadah from Malik from Abu Al-Zinad from Al-A'raj from Abu Hurairah from the Prophet (peace and blessings of Allah be upon him) who said: 'If it licks,' and did not mention 'if it drinks.' This indicates that Imam Malik, may Allah have mercy on him, brought the hadith in its proper form, and that this [variation] is either from Abu Al-Zinad or from those who narrated from Imam Malik. Also supporting the view that this report came from the Prophet (peace and blessings of Allah be upon him) by meaning and came with the wording 'If it drinks'...",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 59
  },
  {
    "serial_number": "2429155",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "...and that what is authentic from the Prophet (peace and blessings of Allah be upon him) is 'If it licks,' is that it came from the Prophet (peace and blessings of Allah be upon him) via paths other than Imam Malik. Ibn Al-Mundhir narrated from the hadith of Abdur-Rahman bin Abi Al-Zinad from his father from Al-A'raj from Abu Hurairah from the Prophet (peace and blessings of Allah be upon him) that he said: 'If it drinks.' Abdur-Rahman bin Abi Al-Zinad followed Imam Malik here. Shu'ayb bin Abi Hamzah also narrated it from Abu Al-Zinad from Al-A'raj from Abu Hurairah from the Prophet (peace and blessings of Allah be upon him) saying: 'If it drinks.' This indicates that Imam Malik was not solitary in his path with this wording. It was also narrated from other than the path of Abu Al-Zinad from Al-A'raj from Abu Hurairah; it came in Ibn Khuzaymah and Ibn Al-Mundhir via two paths from Hisham bin Hassan from Ibn Sirin from Abu Hurairah from the Prophet (peace and blessings of Allah be upon him) that he said: 'If the dog drinks in the vessel of one of you,' coming with the word 'drinks'. What appears, and Allah knows best, is that his saying at the beginning of this report 'If it drinks' came from the Prophet (peace and blessings of Allah be upon him) by meaning, and that it came metaphorically so the listener would understand, and so it would come to mind that the intent is drinking and not just the dog's tongue touching the spot. However, the Prophet (peace and blessings of Allah be upon him) intended by that report, as we mentioned, licking ('Wulugh'). Licking does not happen except with liquid, and if a dog's tongue touches something solid and the like, it is not washed seven times nor with soil. Rather, that spot is removed if it is solid, like solid ghee and the like; what the dog touched with his tongue is removed, and it is not said that it is washed seven times etc., then that thing which the dog's tongue touched is used. His saying (peace and blessings of Allah be upon him): 'If the dog licks': The dog here is a known beast among predators. This ruling is specific to dogs and does not include other predators according to the generality of scholars.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 60
  },
  {
    "serial_number": "2429156",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "However, they differed regarding the pig: Is it washed seven times and its ruling is like the ruling of the dog as came from the Prophet (peace and blessings of Allah be upon him)? - The majority of scholars hold that the pig does not have the same ruling as the dog, and that the Prophet (peace and blessings of Allah be upon him) specified that for the dog and did not generalize it. Otherwise, if it were general, the Prophet (peace and blessings of Allah be upon him) would have said: 'If it is licked in the vessel of one of you,' without mentioning the dog specifically. - Some scholars went to the view that the pig is washed seven times, one of them with soil, justifying their reasoning by saying that the pig is more impure than the dog, so that analogy (Qiyas) would be *a fortiori* (more deserving). However, this is not conceded; because the Prophet's specific mention of the dog has a wisdom, and his specification of its saliva has a known wisdom. It is known that there are things which are filthy, yet the Prophet (peace and blessings of Allah be upon him) did not stipulate that number, nor did he stipulate soil except for the dog, which indicates that the dog has a distinct characteristic known in the knowledge of Allah, Exalted be He, regarding impurity, the removal of which the Prophet (peace and blessings of Allah be upon him) specified by washing seven times, the first with soil, as came from the Prophet (peace and blessings of Allah be upon him).",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 61
  },
  {
    "serial_number": "2429157",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "The 'dog' here includes all types of dogs, even those the Prophet (peace and blessings of Allah be upon him) permitted keeping, such as hunting dogs, livestock dogs, guard dogs, and the like. Some scholars said that what the Prophet (peace and blessings of Allah be upon him) permitted, like guard dogs and hunting dogs, are excluded from this. They said that this is more fitting with the tolerance of Islam; since the Wise Lawgiver permitted keeping the dog—while the default is that whoever keeps one has earned a sin and it is among the things that reduce deeds—then the impurity is overlooked. Just as Allah forgave the sin, the impurity is forgiven because it is a matter of widespread hardship (Umum al-Balwa), for guard dogs and hunting dogs mix with people causing hardship, so forgiving their impurity is from the Wise Lawgiver indicating the tolerance of Islam. However, this view is not conceded, for the Prophet (peace and blessings of Allah be upon him) stated this generally and did not restrict it (peace and blessings of Allah be upon him) to hunting dogs nor livestock dogs nor others which the Prophet excluded. If the Prophet (peace and blessings of Allah be upon him) wanted to specify something, he would have specified it just as he specified hunting dogs and others from the exception to the prohibition he made. This is the correct view supported by evidences: that the impurity of the dog is general, and the command to wash is general for all types of dogs. Is the impurity of the dog in its mouth and saliva or in its whole body? The majority of scholars from the Shafi'is, Hanafis, and Hanbalis hold that the impurity of the dog is complete in all its body, except that washing seven times applies only to what the dog licked, while the rest of the dog's body is considered impure. They justified this by saying: If the dog's saliva is impure, and saliva comes from the inside of the dog, from its intestines and the like, which is what the animal's body grows from, this indicates that it grows from impurity.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 62
  },
  {
    "serial_number": "2429158",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "Imam Malik and Dawud Al-Zahiri, and it is a view of the Zahiris in general, held that the dog's impurity is in its mouth and saliva. They reasoned saying: The Prophet (peace and blessings of Allah be upon him) ordered washing the dog's impurity only if it licks, even though dogs mixing with people, like guard dogs and what the Prophet permitted, is more frequent than their licking in vessels, yet the Prophet did not order anything regarding precaution to remove the impurity of the dog from its body and the like. This view is rejected, for the Prophet's omission of mentioning the impurity of the dog's body, which is a matter of widespread hardship, does not mean the dog's body is not impure. Rather, the utmost it indicates is that the dog's body and hair do not fall under the ruling of the dog's licking, so it is not washed seven times nor with soil. This is the utmost understood from the Prophet's text, meaning that the ruling on the impurity of the dog's saliva and spittle is more severe than the impurity of its body; this is the utmost the text from the Prophet indicates. Washing seven times is obligatory according to the generality of scholars, and washing the dog's saliva or the vessel in which the dog licks is not sufficient with less than that. Whoever washes less than that, it does not suffice for him according to the generality of jurists, may Allah have mercy on them. However, they differed regarding washing with soil: Is it obligatory or not? The Hanafis and Malikis held that the obligation is washing seven times, and that washing with soil is not obligatory. They reasoned by saying: The washing with soil has different narrations regarding it and its placement from the Prophet (peace and blessings of Allah be upon him), which indicates the Lawgiver's lack of emphasis on it, otherwise the narrators would have preserved it accurately.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 63
  },
  {
    "serial_number": "2429159",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "The majority of scholars, and it is a view of Al-Shafi'i and Imam Ahmad, may Allah have mercy on them, held that washing with soil is obligatory, and that whoever washes the vessel from a dog's licking seven times but does not wash it with soil, it does not suffice for him. They used as evidence the apparent meaning of what came from the Prophet (peace and blessings of Allah be upon him) in this report, the hadith of Abu Hurairah, may Allah be pleased with him, and that it is established from the Prophet and there is no dust on it. They argued that the variation among narrators in mentioning the place of the soil washing or doubting it does not mean it is not established from the Prophet (peace and blessings of Allah be upon him). Just as some narrators doubted it and were inconsistent regarding it, there are narrators who preserved it accurately from the Prophet and established its place. This is known to those who contemplate the reports of the Prophet (peace and blessings of Allah be upon him) and contemplate the paths of Abu Hurairah's hadith and other reports that came regarding washing the vessel from the dog's licking. This is the correct view supported by the apparent evidences from the Prophet (peace and blessings of Allah be upon him)—that the seven washings and the washing with soil are obligatory, and that whoever washes the vessel less than that or does not wash it with soil, it does not suffice. This has been known by experience and is also known among medical experts that soil has a merit over other cleaning agents, and the Prophet (peace and blessings of Allah be upon him) did not specify it except due to knowledge of the Unseen that Allah informed him of. {Nor does he speak from [his own] inclination. It is not but a revelation revealed.} His saying (peace and blessings of Allah be upon him): 'If the dog licks in the vessel of one of you': The Prophet (peace and blessings of Allah be upon him) mentioned the vessel here and restricted the licking to it. We mentioned that the majority of scholars hold that washing applies only to the dog licking in liquid, and that if the dog's tongue touches something solid, it is not washed [seven times]. However, scholars differed regarding the rest of the dog's body if it is dipped into the vessel and the like.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 64
  },
  {
    "serial_number": "2429160",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "The majority of scholars hold that if the dog's body, like its paw, leg, or hair, is dipped into a vessel of water or other drink like milk, juice, etc., it is not washed seven times. Rather, if the water is plentiful and none of its characteristics change, it remains pure. If any of its characteristics change, then it becomes impure. Al-Shafi'i, may Allah have mercy on him, held that the dog—its ear, mouth, saliva, and leg—if dipped into liquid, is washed seven times, one of them with soil, generalizing that ruling. However, this is not supported by evidence. What came from the Prophet (peace and blessings of Allah be upon him) is 'licking in the vessel', and this only occurs in liquid and only from the tongue of the dog and other predators. This is specific to the dog due to the Prophet's specification by saying 'If the dog licks'. There are consecutive restrictions from the Prophet (peace and blessings of Allah be upon him) in this report: First: by saying 'If it licks', he specified licking, which is general. Then he said 'the dog', specifying it from other predators, which indicates the ruling is specific to the dog and does not extend to other predators. Then he said (peace and blessings of Allah be upon him) 'in the vessel of one of you', which indicates its restriction to drink/liquid, and that this does not apply to the rest of the dog's body like its ear, or dipping its mouth without licking, or dipping its foot; for that does not necessitate washing seven times nor the washing with soil, due to the apparent text from the Prophet (peace and blessings of Allah be upon him). His saying (peace and blessings of Allah be upon him) in this report: 'The first of them with soil': This is what is correct from the Prophet (peace and blessings of Allah be upon him). As for what came as 'the first or the last', it is due to doubt, not choice; a doubt by some narrators. The correct version is 'the first of them'. The author, may Allah have mercy on him, said: And in a wording by him: 'Let him spill it out':",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 65
  },
  {
    "serial_number": "2429161",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "This wording was narrated by Imam Muslim, may Allah have mercy on him, from the hadith of Ali bin Hajar from Ali bin Mushir from Al-A'mash from Abu Salih and Abu Razin from Abu Hurairah, may Allah be pleased with him. This wording is anomalous (*Shadh*). Ali bin Mushir contradicted all the companions of Al-A'mash who narrated this report from him. Ali bin Mushir is trustworthy (*Thiqah*) and is known and famous for narration, and the Group [of hadith scholars] narrated from him. Although he is a known trustworthy narrator, he contradicted the trustworthy Hafiz scholars from the companions of Al-A'mash, may Allah have mercy on him, for they did not mention this addition. A group narrated it from Al-A'mash, including Shu'bah bin Al-Hajjaj, as well as Abu Mu'awiyah as in Imam Ahmad, Ismail bin Zakaria in Imam Muslim, and Hammad bin Usama in Ibn Abi Shaybah. Others also narrated it. Shu'bah and Abu Mu'awiyah are among the most trustworthy and firm people regarding the hadith of Al-A'mash. Also, a group narrated it from Al-A'mash from Abu Salih from Abu Hurairah without mentioning the wording 'Let him spill it out.' This addition is an anomalous addition; the Hafiz scholars have stated its anomaly. Imam Al-Nasa'i stated its anomaly in his Sunan and said: 'I do not know anyone of the narrators who agreed with Ali bin Mushir on this wording, meaning: Let him spill it out.' Ibn Abd al-Barr also stated this, saying: 'This wording was not brought by the trustworthy Hafiz companions of Al-A'mash like Shu'bah and others.' Hamza Al-Kinani, who is one of the critical Hafiz scholars, also stated its anomaly, saying it is not preserved (*Mahfuzah*). Thus, it is an anomalous addition that is not established from the Prophet (peace and blessings of Allah be upon him) in terms of narration.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 66
  },
  {
    "serial_number": "2429162",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "Those who say that the dog's licking in the vessel indicates the impurity of the water, whether much or little, used this [addition] as evidence. This view is incorrect in terms of deriving it from this narration, although it has a valid aspect in terms of the conclusion. For the Prophet (peace and blessings of Allah be upon him) when he said: 'If the dog licks in the vessel of one of you, let him wash it seven times,' his saying 'let him wash it seven times' indicates the impurity of the vessel. From what did the vessel become impure? It became impure from that water which is in it. It is known that the dog licked the water and perhaps did not touch the vessel with its tongue, so the water transferred the impurity to the vessel, making it impure, and the Lawgiver obligated washing it seven times. However, this addition implies two meanings from the Prophet (peace and blessings of Allah be upon him): First meaning: The impurity of this water absolutely, whether little or much. This is not conceded unless the water is so little that it does not repel impurity. But if it is plentiful, like in large vessels and the like where it is difficult for the dog's saliva to spread, then it does not become impure because the Prophet (peace and blessings of Allah be upon him) generalized the purity of water unless its taste, color, or smell changes, as passed previously. However, if it is little, like small vessels, it becomes impure even if none of its [qualities] change, by the text of the Prophet and his command to wash the vessel seven times. This addition implies a second matter: The Prophet's command to spill the water and not use it for anything. This is not conceded because this addition is not authentic from the Prophet. Rather, it is legislated to use the water and not waste it by adding it to other water so it increases and the impurity is removed by the abundance of water. If we said this addition was authentic, it would be obligatory not to use this water and obligatory to spill the water in which the dog licked. But this addition is not authentic, so acting upon this command is not correct. The author, may Allah have mercy on him, said: And for Al-Tirmidhi: 'The first or the last with soil':",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 67
  },
  {
    "serial_number": "2429163",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "This narration was narrated by Imam Al-Tirmidhi, may Allah have mercy on him, saying: Sawwar told us, from Al-Mu'tamir bin Sulayman, from Ayyub, from Ibn Sirin, from Abu Hurairah, may Allah be pleased with him. This narration is with doubt, not choice. His saying 'the first or the last' is a doubt [from the narrator], not a choice. Evidence for this is that the companions of Ibn Sirin narrated this report from him without doubt; among them are Hisham bin Hassan, Qatadah bin Di'amah, Habib bin Al-Shahid, Al-Awza'i, and other Hafiz scholars narrated this report from Ibn Sirin from Abu Hurairah without doubting in it. The correct version in this narration from the Prophet (peace and blessings of Allah be upon him) is 'the first of them' as came in Imam Muslim. 11- From Abu Qatadah, may Allah be pleased with him, that the Messenger of Allah (peace and blessings of Allah be upon him) said regarding the cat: 'It is not impure (Najas); it is only one of those who go around among you (Tawwafeen).' Narrated by the Four, and authenticated by Al-Tirmidhi and Ibn Khuzaymah. This hadith was narrated by Imam Ahmad, Abu Dawud, Al-Tirmidhi, Al-Nasa'i, Ibn Majah, Ibn Khuzaymah, Ibn Hibban, Al-Bayhaqi, and others. All of them narrated it from the hadith of Imam Malik bin Anas from Ishaq bin Abdullah bin Abi Talha from his wife Humaydah bint Ubayd bin Rifa'ah from Kabshah from Abu Qatadah from the Prophet (peace and blessings of Allah be upon him). This hadith has been criticized by some scholars for ignorance (*Jahalah*) in its chain. Hafiz Ibn Mandah criticized it, saying: 'It is not authentic by any means.' Ibn Abd al-Barr and Al-Bazzar in his *Musnad* also criticized it, saying: 'It is not authentic in terms of transmission.' Others like Ibn Daqiq al-Eid and Ibn al-Turkumani also criticized it.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 68
  },
  {
    "serial_number": "2429164",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "However, their criticism based on ignorance in its chain is rejected. This hadith, although it has some ignorance in its chain—their criticism based on Humaydah bint Ubayd and Kabshah—Humaydah bint Ubayd is with a Damma on the un-dotted Ha' (Humaydah). This is how all companions of Imam Malik narrated it. Yahya bin Yahya Al-Andalusi narrated it from Imam Malik from Ishaq bin Abdullah bin Abi Talha from his wife 'Hamidah' with a Fatha on the Ha'. Hamidah or Humaydah, according to the most famous view, although she is not famous for narration, Ishaq bin Abi Talha narrated from her, and he is trustworthy. Her son also narrated from her, and Ibn Ma'in declared him trustworthy. Ibn Hibban mentioned her in his book *Al-Thiqat*. This report was authenticated by a group of scholars. Imam Al-Daraqutni said: 'Its narrators are known trustworthy people.' Al-Nawawi reported authentication of this report from Al-Bayhaqi. Also, Imam Al-Tirmidhi said: 'I asked Muhammad bin Ismail Al-Bukhari about this hadith, and he said: Malik did well in this hadith, and his narration is more correct than the narration of others.'",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 69
  },
  {
    "serial_number": "2429165",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "This hadith was also authenticated by other later scholars like Imam Al-Nawawi and others. Criticizing it due to Humaydah's ignorance is not conceded, for weakening hadiths purely for ignorance [of a narrator] is not the methodology of the Hafiz scholars. Imam Ahmad, Ibn Al-Madini, Al-Bukhari, Muslim, and Al-Daraqutni authenticate some hadiths even if there are unknown narrators in the chain if indications (Qara'in) surround it pointing to the precision of the narration. Humaydah, or Hamidah as Yahya bin Yahya Al-Andalusi said, narrated this hadith from Kabshah. Kabshah is the wife of Abu Qatadah. Ibn Hibban affirmed her companionship and mentioned her among the Companions (*Sahabah*) in his book *Al-Thiqat*, and he also mentioned her among the *Tabi'in*. Perhaps he retracted, which is the best interpretation and better than claiming he was inconsistent. Some said he retracted her status as a Companion and said she was a Tabi'i. In any case, she is in an early layer, and criticizing the report due to her ignorance is not conceded. Therefore, the Hafiz scholars leaned towards strengthening this report, like Imam Al-Daraqutni and Al-Bukhari with his statement: 'Malik did well in this hadith, and his narration is more correct than others,' indicating the uprightness of the text of this hadith. Also, it came in the context of a story from the Prophet (peace and blessings of Allah be upon him), and this is one of the indications where the hadith of narrators is accepted, whether they are unknown or have light precision, for their narration is accepted if indications surround it.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 70
  },
  {
    "serial_number": "2429166",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "Furthermore, the Hafiz scholars are lenient regarding the narration of women if they are from an early layer. Thus, Imam Al-Dhahabi says: 'No woman is known to be accused [of lying] or abandoned (*Matrukah*),' meaning in terms of narration. Rather, most women who appear in narrations are among the unknown (*Majahil*) or the covered (*Masturin*), and no woman is known to be among the liars or the abandoned. This is one of the indications where the report is accepted. It is not an absolute rule to accept women's narration, but if indications surround the hadiths of unknown narrators, including women, the Hafiz scholars accept them. This hadith is one of them; it is an upright hadith surrounded by indications. Among them is that its narrators are covered women (*Masturat*) who narrated from an early layer, and it came within a story indicating the precision of the conveyor. It is also supported by the authentication of the Hafiz scholars and their declaring its narrators trustworthy, as Imam Al-Daraqutni said: 'Its narrators are known trustworthy people,' knowing that Humaydah and Kabshah from Abu Qatadah are in its chain. This report was narrated by Ibn Khuzaymah and Ibn Hibban, who only include what is authentic according to them in their Sahihs. His saying (peace and blessings of Allah be upon him): 'It is not Najas': Najas here is from impurity (*Najasah*), opposite to purity (*Taharah*), indicating that the cat and what is in its ruling are among the pure things. The cat (*Hirrah*) is a small animal of the feline family, and what is prevalent (*Umum al-Balwa*) of similar size falls under its ruling. Scholars differed: Is the Prophet's intent here regarding the cat's lack of impurity due to its creation/size, or because it is a widespread hardship (*Umum al-Balwa*) as it is 'of those who go around'? The majority of scholars hold that it is because of the widespread hardship and that it is of 'those who go around' (*Tawwafeen*); therefore, the Prophet (peace and blessings of Allah be upon him) explicitly stated that by saying 'It is only one of those who go around among you.'",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 71
  },
  {
    "serial_number": "2429167",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "The Hanbalis and some scholars went to the view that the Prophet (peace and blessings of Allah be upon him) intended both matters, and that the Prophet's concession applies to the cat and what is in its ruling regarding its creation which is not impure by the text of the Prophet, or whose impurity is established and is a matter of widespread hardship. According to the majority view, the Prophet's permission and easing regarding the cat is due to the widespread hardship and that it is 'of those who go around', so what is larger than it enters into this ruling due to the shared cause (*Illah*), such as the donkey and the mule, because they are matters of widespread hardship and mix with people. The Cause (*Illah*) mentioned by scholars of Usul in their works is divided into two types: Textual Cause (*Mansusah*) and Deduced Cause (*Mustanbatah*). The Textual Cause is what the Prophet (peace and blessings of Allah be upon him) explicitly states when mentioning a ruling. The Deduced Cause is what the scholar strives to identify and draws analogy upon. If the cause is textual from the Prophet, there is no disagreement in Analogy (*Qiyas*) except among those who deny it from the Zahiris like Ibn Hazm and others. But if the cause is deduced, analogy is not made upon it except with a clear indication supporting this deduction. The cause here regarding the concession for the cat and its purification by the Prophet's judgment that 'it is not impure'—is it a deduced cause or a textual cause? It is a textual cause from the Prophet (peace and blessings of Allah be upon him), and the cause here is his saying 'It is only one of those who go around among you.' This is the cause for which the Prophet made the cat not impure.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 72
  },
  {
    "serial_number": "2429168",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "One should not expand in the area of Deduced Cause, because the Wise Lawgiver often mentions rulings, and scholars and jurists deduce from the Prophet's text and draw analogies, thereby falling into contradiction with the Sharia due to the passage of eras and the diversity of people's needs. Whoever contemplates many of the rulings where the people of opinion (*Ahl al-Ra'y*) draw analogies based on Deduced Cause upon other things will see that they expand in it and fall into contradicting the Prophet (peace and blessings of Allah be upon him). For example, the prohibition of gold and silver: the prohibition came from the Wise Lawgiver with an explicit text regarding men. What is the cause (*Illah*) for that? No textual cause came from the Prophet, but the cause was deduced and differed according to the understanding of the scholars. Some said the cause for prohibiting gold and silver is people's need for the two currencies (gold and silver); if men used gold ornaments in their dress and used it in their eating and drinking, people would lack the two currencies. Some scholars said this. If this cause were conceded, it cannot be said in our time that this is the cause for which the Prophet prohibited it, for in our time people do not need the two currencies (gold/silver) for transactions (buying and selling). The ruling revolves with the cause in existence and non-existence; so would it be said here that wearing gold and eating/drinking from it is permissible for men? Undoubtedly, this cannot be said. Thus, the corruption of the Deduced Cause purported by those who said the Prophet prohibited gold/silver vessels due to the need for currency becomes known. This is known by the passage of time or changing of eras, and it also differs from Imam to Imam.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 73
  },
  {
    "serial_number": "2429169",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "What should be known here is that regarding texts coming from the Prophet (peace and blessings of Allah be upon him), one must submit to what the Prophet said. If scholars deduce a cause from his sayings of permission or prohibition, they deduce it to explain the wisdom that came from the Prophet for peace of mind, and that he does not legislate except what contains benefit for people and does not forbid except what contains harm, so people know the wisdom of the Wise Lawgiver. However, analogy is not made upon it, nor is it asserted that this cause is definitely what the Prophet intended unless the cause is textual or clearly apparent due to an indication. The Wise Lawgiver may issue many commands and prohibitions where the cause is hidden. If it is textual, no one has a say. The cause is textual from the Prophet regarding the cat: 'of those who go around.' But if it is deduced, no one has the right to draw analogy upon it for other things. Many of the people of opinion became corrupt only due to their analogies in this chapter of types of causes. Regarding the cat and what is in its ruling, the Prophet stated the cause explicitly: 'It is only one of those who go around (*Tawwafeen*) among you.' *Tawwaf* (one who goes around) is one who frequently enters and exits, goes and comes, morning and evening; such is called 'of the Tawwafeen' and 'Tawaf'. Tawaf is called Tawaf due to the frequency of going and coming in it.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 74
  },
  {
    "serial_number": "2429170",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "Also, linguistically, the Sa'i (striving) between Safa and Marwa is called 'Tawaf'. It came in some wordings of the Prophet (peace and blessings of Allah be upon him) and the Salaf that Sa'i between Safa and Marwa is called Tawaf because there is going and coming in it. Similarly, the Prophet's application of this cause and his textual statement of it allows analogy for this cause to what is in the ruling of the cat among animals 'who go around', like donkeys, mules, and other animals like horses and the like which are a matter of widespread hardship. Since the Prophet stated this cause textually, there is no harm in analogy in such a case. 12- From Anas bin Malik, may Allah be pleased with him, who said: A Bedouin came and urinated in a corner of the mosque. The people shouted at him, but the Prophet (peace and blessings of Allah be upon him) forbade them. When he finished his urination, the Prophet (peace and blessings of Allah be upon him) ordered a bucket of water and it was poured over it. Agreed upon. This hadith was narrated by Al-Bukhari and Muslim from multiple paths, including from Hammad from Thabit from Anas bin Malik. This hadith is one of the important ones in the chapter of Purification. Anas' saying: 'A Bedouin (*A'rabi*) came': An A'rabi is one who dwells in the desert (*Badia*), whether Arab or non-Arab. Even a desert dweller who is non-Arab is called A'rabi. The word A'rabi has no singular form from its own root; rather scholars distinguish between plural and singular by adding the relativity *Ya* at the end, so *A'rab* is said for plural and *A'rabi* with the *Ya* for singular. His saying: 'A Bedouin came and urinated in a corner of the mosque': Urine is one of the excretions from the two passages and is impure by consensus of scholars; there is no disagreement in that. Urinating in the mosque is forbidden by consensus. However, scholars differed regarding urinating in the mosque in a vessel: if a person has a vessel while in the mosque, is he permitted to urinate in it?",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 75
  },
  {
    "serial_number": "2429171",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "The majority of scholars held that it is forbidden. This is a view of the Hanbalis, and the school of the Hanafis, Malikis, and a view of the Shafi'is. Some Shafi'is went to the permissibility of urinating in a vessel in the mosque, saying that the prohibition from the Prophet (peace and blessings of Allah be upon him) came regarding urinating on the ground of the mosque, but urinating in a vessel is fine. They drew analogy to many things, such as the Prophet's cupping in the mosque—though the report of the Prophet cupping in the mosque is not authentic—and they also used as evidence Sa'd bin Mu'adh staying overnight, as the Prophet set up a tent for him in the mosque. This contains no proof because there is no text stating that Sa'd bin Mu'adh urinated in a vessel in the mosque. The mosque remains upon its sanctity, so it is forbidden to urinate in it. Muslim narrated in this report from Ikrimah bin Ammar from Ishaq from Anas that the Prophet called the Bedouin after his urination and said to him: 'These mosques are not suitable for any of this urine or filth; rather, they are for the remembrance of Allah.' This indicates the purification of mosques from urine absolutely, whether on its ground or in a vessel on its ground. Furthermore, the Lawgiver forbade approaching the mosque with the smell of onions and garlic, so how about the smell of urine? Scholars also differed regarding things other than urine in the mosque, such as passing wind: is it permissible to pass wind in the mosque voluntarily or not? The majority of scholars went to the view that it is not permissible, and whoever needs to pass wind should go outside the mosque. Some scholars permitted it because no evidence prohibiting it came from the Prophet, and the default is permissibility. Those who forbade it said: The ruling of the mosque's space and air is like the ruling of its ground; hence the Prophet forbade entering the mosque for one who ate garlic or onions and similar offensive smells, and this is an analogy to that, so it is *a fortiori*. His saying here: '(The Mosque)':",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 76
  },
  {
    "serial_number": "2429172",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "The Mosque here: is what is built and its land endowed (Waqf) to Allah Almighty for prayer. As for what is not endowed for prayer, like a building and the like that is not permanent, it is not called a Masjid but rather a Musalla (prayer place) and does not have the rulings of a Masjid like Tahiyyat al-Masjid etc. Regarding urination, it is forbidden to urinate whether in a Musalla or a Masjid because it is a place for prayer. His saying here: '(The people shouted at him)': *Zajr* is scolding and driving away. The Prophet did not forbid their forbidding him, but forbade their *scolding* (shouting/driving away). This is from wisdom in Dawah and the good character the Prophet was granted, for which Allah praised His Prophet saying: {And indeed, you are of a great moral character}. This is one of the instances of wisdom in calling to Allah. The Prophet prioritized a lesser harm over a greater harm. This Bedouin came to the Prophet, perhaps new to Islam; scolding him might drive him away from Islam. Also, the Bedouin had urinated and the urine was flowing; if he were made to move, the urine would spread. The Prophet forbade them and they left him until he finished his need so the urine wouldn't spread. This is the Prophet's wisdom and his consideration of both ends and means. ... A man's urine, whether in the mosque or elsewhere, is purified by water by pouring abundant water over it, as in this report. Some scholars held that the place of urine should be dug up and thrown away, then a bucket of water added. They used as evidence a weak hadith narrated from the Prophet, which Abu Dawud narrated from Jarir bin Hazim from Abd al-Malik bin Umayr from Abdullah bin Ma'qil from the Prophet. It is a report that is not authentic; Imam Ahmad said of it: 'This is a rejected (Munkar) hadith.' Also, Ibn Ma'qil did not meet the Prophet, as Abu Dawud said. Al-Daraqutni narrated this report in his Sunan from another path.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 77
  },
  {
    "serial_number": "2429173",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "Removing the soil upon which the Bedouin urinated is not authentic from the Prophet. Rather, the correct view is pouring water over the urine without removing the soil the man urinated on. This indicates that water purifies impurity by abundance; hence the Prophet ordered a *Dhanub* (bucket) of water to be poured over it. *Dhanub*: is a large bucket, called Dhanub due to its large size. The amount of water poured should be proportionate to the urine; if it is little, a little water more than the urine is poured, and the impurity of the urine is removed. 13- From Ibn Umar, may Allah be pleased with them both, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'Two dead things and two bloods have been made lawful for us. As for the two dead things: they are locusts and fish. As for the two bloods: they are the spleen and the liver.' Narrated by Ahmad and Ibn Majah, and it contains weakness. This hadith was narrated by Imam Ahmad, Ibn Majah, and others from the hadith of Abdur-Rahman bin Zayd bin Aslam from his father Zayd bin Aslam from Abdullah bin Umar. It is defective due to Abdur-Rahman bin Zayd bin Aslam, who is weak according to the generality of scholars. Imam Ahmad, Al-Tirmidhi, Al-Nasa'i, Ali bin Al-Madini, Yahya bin Ma'in, and others declared him weak. Abu Hatim asked Imam Ahmad about the sons of Zayd bin Aslam, 'Which is dearest to you?' He said: 'Usamah.' Then who? He said: 'Abdullah.' Then he mentioned Abdur-Rahman and lay down [indicating weakness] regarding Abdur-Rahman. Abdur-Rahman bin Zayd bin Aslam, the narrator of this report in Imam Ahmad and Ibn Majah, is weak according to the generality of scholars. Ibn Ma'in said of him: 'He is nothing.' Abu Dawud said: 'The sons of Zayd bin Aslam are all weak.' The sons of Zayd bin Aslam are Abdur-Rahman, Abdullah, and Usamah, sons of Zayd bin Aslam, freed slave of Umar bin Al-Khattab. Abdur-Rahman bin Zayd bin Aslam and his brothers were solitary in narrating this report as *Marfu'* (attributed to the Prophet), i.e., with a chain to him.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 78
  },
  {
    "serial_number": "2429174",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "Al-Daraqutni, Ibn Adi, and Al-Bayhaqi narrated it from Ismail bin Abi Owais from Abdur-Rahman, Abdullah, and Usamah from Zayd bin Aslam from Abdullah bin Umar from the Prophet as *Musnad* (connected chain). This is the path of Al-Bayhaqi and Ibn Adi. Al-Daraqutni mentioned only Abdullah and Abdur-Rahman. The sons of Zayd bin Aslam were solitary in this report, and they are weak, and it contradicts trustworthy narrators. It came as *Mawquf* (halted at the Companion) from Abdullah bin Umar from the hadith of Abdullah bin Wahb from Sulayman bin Bilal from Zayd bin Aslam from Abdullah bin Umar as his own statement. This is the correct view preferred by the Hafiz scholars; Abu Hatim, Al-Daraqutni, Abu Zur'ah, Al-Bayhaqi, Al-Hakim, and among later scholars Hafiz Ibn Al-Qayyim preferred the *Waqf* (attribution to Companion). However, it has the ruling of *Raf'* (attribution to Prophet). Al-Bayhaqi stated that it has the ruling of *Musnad* from the Prophet, because if a Companion says 'It was made lawful for us' or 'We were commanded' or 'We were forbidden' regarding matters specific to the Wise Lawgiver, then it has the ruling of *Raf'*. If it concerns matters not exclusive to the Lawgiver, there is difference of opinion mentioned by scholars of Usul. However, the correct view is that if a Companion says 'We were commanded' or 'We were forbidden', it is raised to the Prophet unless there is an indication implying otherwise, such as a late Companion, or the command being indicated by other narrations to be from one of the Caliphs, or the command not having a textual basis from the Lawgiver, etc.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 79
  },
  {
    "serial_number": "2429175",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "This report has the ruling of *Raf'* (attributed to the Prophet) in terms of ruling, but in terms of narration, it is not authentic as *Musnad* from the Prophet. Although it appeared in Hafiz Ibn Adi's work from Yahya bin Hassan from Sulayman bin Bilal from Zayd bin Aslam from Abdullah bin Umar from the Prophet, and Yahya bin Hassan followed the sons of Zayd bin Aslam as a partial corroboration, yet he contradicted Hafiz Abdullah bin Wahb, who is one of Imam Malik's companions and a great Hafiz and trustworthy narrator. Abdullah bin Wahb's narration is undoubtedly firmer and more correct due to his majesty and memory, and such weak narrators cannot stand against him. His saying 'Have been made lawful for us': 'Ahillat' is taken from Halal, meaning permissibility. Making lawful and unlawful is the exclusive right of the Wise Lawgiver. No one has the right to permit or forbid except the Wise Lawgiver. His saying 'Two dead things': The singular is 'Maytah'. There are two dialects: *Mayt* with a sukun on the Ya, and *Mayyit* with a shaddah. For what has certainly died, both are permissible. For what has not yet died, the Ya is stressed (*Mayyit*). Some said the two words are equal. Someone recited: 'O asker about the explanation of Mayt and Mayyit / Here I explain what you ask about / Whatever has a soul is Mayyit / And Mayt is only what is carried to the grave.' The default for dead animals (*Maytah*) is prohibition if it is a land animal. As for sea animals, the default is permissibility. The Prophet pointed to this in this report by saying 'Have been made lawful for us' if authentic as *Marfu'*, or from Abdullah bin Umar's statement as *Mawquf*. His saying 'Two dead things and two bloods have been made lawful for us':",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 80
  },
  {
    "serial_number": "2429176",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "This indicates that the default is prohibition regarding carrion. The carrion prohibited by Allah is land carrion absolutely, while He permitted sea carrion absolutely. The two types exempted by Allah from carrion are sea carrion—we discussed this in the hadith of Abu Hurairah, the first hadith in Bulugh Al-Maram: 'Its water is purifying and its dead are lawful.' We discussed the scholars' difference in detail and established that sea carrion is lawful according to the majority. Exceptions have no evidence and remain on the default: either it is sea carrion, so it is lawful, or land carrion, so it is unlawful. What is between them (amphibious) remains on its default of permissibility; if it is repulsive it is forbidden for repulsiveness, if it has fangs it is forbidden because it is a fanged beast prohibited by the Prophet. The Second Type of Carrion: (Locusts). This is by consensus of scholars. No dissenter is known except Al-Layth bin Sa'd and Ibn Al-Arabi (a later scholar). Al-Layth held it to be forbidden, a very strange view; I know of no one who agreed with him, and such an odd view does not befit his standing in knowledge. Hafiz Ibn Hajar said in a book on Al-Layth's biography called *Al-Rahmah Al-Ghaythiyyah bi Al-Tarjamah Al-Laythiyyah*: 'I have tracked books of difference much and did not find a single issue where Al-Layth was solitary against the Imams of the Sahabah and Tabi'in except this issue.' Ibn Al-Arabi said: 'Locusts of Hijaz are lawful and locusts of Andalusia are unlawful,' which is very strange. This view contradicts the consensus; locusts are one, and their permissibility is absolute from the Lawgiver. His saying 'And two bloods were made lawful': 'Daman' (two bloods), singular 'Dam'. The intent here is: An animal with flowing blood, not the blood flowing in veins.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 81
  },
  {
    "serial_number": "2429177",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "It is known that beasts either have flowing blood, like livestock, or do not have flowing blood, like insects etc. His saying 'Two bloods were made lawful for us' mentions the first type: (The Liver), which is lawful by consensus without disagreement. (And the Spleen), likewise, scholars have agreed on its permissibility without known disagreement. ******************************* 14- From Abu Hurairah, may Allah be pleased with him, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: 'If a fly falls into the vessel of one of you, let him dip it all in, then throw it away, for in one of its wings is a disease and in the other is a cure.' Narrated by Al-Bukhari and Abu Dawud, who added: 'And it protects itself with the wing containing the disease.' This hadith was narrated by Al-Bukhari, saying: Qutaybah bin Saeed told us, Ismail bin Ja'far told us, from Utbah bin Muslim, from Ubayd bin Hunayn, from Abu Hurairah, may Allah be pleased with him, from the Prophet (peace and blessings of Allah be upon him). His saying in this hadith 'If a fly (*Dhubab*) falls': *Dhubab* is singular, plural *Dhibban*. Common people say *Dhubab* for plural and *Dhubabah* for singular; this is contrary [to standard], though ancient. Abu Hatim Al-Sijistani narrated this variance. The correct view is that *Dhubab* is singular and *Dhibban* is plural; some said the opposite. *Dhubabah* is not eloquent. Ibn Battal and others said it is called *Dhubab* because it wavers (*yadhubb*) over food then returns to it; it wavers due to its filthiness. The fly is not impure (*Najas*). Scholars have agreed that whatever does not have flowing blood does not make liquid or food impure if it falls into it. No one disagreed except a narration reported by Al-Rabi' bin Sulayman Al-Muradi from Al-Shafi'i that if an insect without flowing blood falls into drink or food, it makes it impure. But consensus was narrated contrary to that: that whatever has no flowing blood does not make what it falls into impure, and the default is its purity.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 82
  },
  {
    "serial_number": "2429178",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "From creatures without flowing blood, the Lawgiver specified the fly here with a ruling: If it falls into the drink of one of you—and in a narration 'vessel', and in another outside the Sahih 'food'—'drink' does not just mean liquid but encompasses food and all drinks and edibles. This is because the reasoning in the hadith includes both, as the Prophet said 'for in one of its wings is a disease and in the other is a cure' (or remedy). This covers falling into liquid or food. His saying 'If a fly falls into the drink of one of you, let him dip it': Dipping here is obligatory. This is the apparent meaning of the text: one must dip the fly. The Prophet reasoned with a textual cause: 'for in one of its wings is a disease and in the other is a remedy.' This is knowledge of the Unseen revealed by Allah to His Prophet. When a fly falls into a vessel, it falls first on the wing with the disease to preserve the wing with the remedy for the rest of its life. If not dipped, [the disease remains]. If dipped, it usually dies, so its wing with the remedy is dipped, treating this with that, and no disease deposited by the fly remains. Scholars divided animals into two types: First: What has flowing blood. Meaning blood that runs in veins. Its dead body is impure by consensus; details will come in the chapter of Foods.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 83
  },
  {
    "serial_number": "2429179",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "Second: What does not have flowing blood: meaning no blood in its veins, like insects (flies, bees, locusts, etc.). If it dies, its dead body is pure. For what has no flowing blood does not putrefy nor emit an impure, foul smell upon death, unlike what has flowing blood, which putrefies and has a foul, rotten smell. Hence the Lawgiver forbade eating the latter and clarified it is impure because it becomes impure and putrid due to the trapped blood not being shed. Thus, the wisdom derived by the Prophet is known: If a fly falls into a vessel, dip it then throw it away. If it were entirely impure, the Prophet would not have ordered dipping it but would have ordered removing it. Some scholars said: If a fly falls into a vessel not containing liquid, it is dipped and the food around it removed. There is no evidence for this, and it contradicts the apparent text. It is similar to the hadith of the Bedouin urinating in the mosque; despite the urine, the Prophet ordered pouring water over it and did not order removing the soil. This report is similar; one must stop at the text. Since the Prophet informed that the fly has disease in one wing and cure in the other and ordered dipping it completely, this command must be obeyed. Some ignorant people who turned away from Allah's religion, like modern Mu'tazilah and others, attacked this report and attacked Abu Hurairah's hadith. This is due to their ignorance, for Abu Hurairah was not solitary in this. It came from Abu Saeed Al-Khudri as narrated by Al-Nasa'i and others from Ibn Abi Dhi'b from Saeed bin Khalid from Abu Salamah from Abu Saeed Al-Khudri from the Prophet, and some scholars authenticated it.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 84
  },
  {
    "serial_number": "2429180",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 82,
    "volume_number": 1,
    "text": "It was also narrated from Anas bin Malik. There is no room to attack any Companion regarding this hadith if he was solitary, so how about when a group narrated it? Abu Rayyah attacked this in his book *Lights on the Sunnah*, and the scholar Abdur-Rahman bin Yahya Al-Mu'allimi refuted him in his book *Al-Anwar Al-Kashifah*. He refuted him with scientific principles from the Sharia, stating that the Prophet's Companions are all trustworthy and just by Allah's accreditation, and that this is revelation from Allah to His Prophet. There is no room for the intellect to choose what it wants from Allah's revelation and reject what it wants. The author, may Allah have mercy on him, said: Abu Dawud added: 'And it protects itself with the wing containing the disease.' This addition was narrated by Imam Ahmad and via him Abu Dawud. Abu Dawud said: Ahmad bin Hanbal told us, from Bishr bin Al-Mufaddal, from Muhammad bin Ajlan, from Saeed Al-Maqburi, from Abu Hurairah. Ibn Hibban narrated it via his sheikh Ibn Khuzaymah from Bishr with it. Saeed Al-Maqburi is a famous narrator. This path is good (*Hasan*) due to the status of Muhammad bin Ajlan, for his hadiths are upright and considered Hasan. Saeed Al-Maqburi was named Al-Maqburi because he lived in a graveyard, it is said. They said Arabs used to live near graves. It was said: In the home of every man or family, there was a grave for their dead in their courtyard. The poet says: 'Every people has a grave in their courtyard / They decrease while graves increase.' Hence he was named Al-Maqburi. He narrates from Abu Hurairah, and the Group narrated from him. His saying here 'It protects itself with the wing containing the disease':",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 85
  },
  {
    "serial_number": "2429181",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 83,
    "volume_number": 1,
    "text": "This is from the knowledge of Allah revealed to His Prophet. The Prophet could not say this on his own accord; human intellect and nature cannot perceive this, especially in the Prophet's era. The Prophet's words, actions, and approvals are legislation and religion, unless evidence indicates he said/did it as a custom of his time or context indicates so without textual stipulation. *********************** 15- From Abu Waqid Al-Laythi, may Allah be pleased with him, who said: The Prophet (peace and blessings of Allah be upon him) said: 'Whatever is cut from a beast while it is alive is dead (carrion).' Narrated by Abu Dawud and Al-Tirmidhi who classified it as Hasan, and the wording is his. This hadith was narrated by Abu Dawud, Al-Tirmidhi, Al-Bayhaqi, Ibn Al-Jarud in *Al-Muntaqa*, and others from the hadith of Abdur-Rahman bin Abdullah bin Dinar from Zayd bin Aslam from Ata' bin Yasar from Abu Waqid Al-Laythi from the Prophet. The reason for this report is that when the Prophet came to Medina, he found its people cutting the humps of camels and the fat tails of sheep while they were alive to use the fat. Camel humps and sheep tails grow back if not cut from the root. They were benefiting from that, so the Prophet forbade it and informed that what is severed from the living is dead (carrion). This is compassion and kindness to animals from the Prophet first, and also saving humans from eating carrion. The Prophet's saying here 'What is severed from the beast': The beast (*Bahimah*) here refers to four-legged animals, due to the prevalence of Arab practice at the time. The Prophet specified 'beast' because it usually refers to livestock (camels, cows, sheep), though linguistically *Bahimah* includes all four-legged animals. It is called *Bahimah* because of its unintelligibility (*Ibham*) and lack of speech. ... His saying 'What is severed':",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 86
  },
  {
    "serial_number": "2429182",
    "category_id": "7",
    "category": "Hadith Commentaries",
    "book_title": "A Segment of Sheikh Abdul Aziz Al-Tarefe's Explanation of Bulugh Al-Maram, Transcribed by Some Interested Parties",
    "edition": "None",
    "publisher": "None",
    "page_number": 84,
    "volume_number": 1,
    "text": "Meaning whatever is cut from the beast while it is alive is dead (carrion). This is by consensus of scholars; no one disagreed. However, scholars excepted two cases: First case: Musk of the gazelle. If separated from the gazelle while alive, it is pure and permissible to use by consensus; more than one scholar recounted consensus on this. Second case: What runs away from animals and is hard to restrain. If a camel or she-camel becomes wild and hard to restrain, and they strike it, cutting off its hump or a piece of its leg, etc., then what is cut is considered permissible to eat, provided that if that she-camel or camel is caught, it is slaughtered and not left alive, because what was cut is linked to its origin (the animal). This is also agreed upon by scholars. This is specific to beasts. As for what the Prophet permitted eating its dead body originally, whatever is cut from it is considered pure and not forbidden carrion, like fish. Whatever is cut from a fish while alive and not caught/hunted is considered permissible and pure to eat. Likewise locusts; if something is cut from it while alive and not caught, it is permissible to eat because its dead body is originally permissible, not forbidden. Scholars excepted these cases, and no disagreement is known in this issue. And Allah knows best. The rest of the explanation follows, God willing.",
    "foot_note": "None",
    "book_id": "147",
    "new_page_number": 87
  }
]