[
  {
    "text": "Al-Risalah Al-Muwadidhah (The Clarifying Treatise)\nAuthor: محمد بن الحسن بن المظفر الحاتمي أبو علي\nYear: 388",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al-Risalah Al-Muwadidhah (The Clarifying Treatise)",
    "category_id": "32",
    "category": "Literature",
    "new_page_number": 1
  },
  {
    "text": "sn: 7477\nbook_title: الرسالة الموضحة في ذكر سرقات المتنبي و ساقط شعره\nbook_link: https://shamela.ws/book/777\nbook_id: 777\nauthor_name: محمد بن الحسن بن المظفر الحاتمي أبو علي\nauthor_year: 388\nnickname: أبو علي\nauthor_link: https://shamela.ws/author/876\nauthor_ID: 876\neditor: Null\npublisher: Null\nedition: Null\npages: 54\nvolumes: Null\npagination: [الكتاب مرقم آليا غير موافق للمطبوع]\ncategory: الأدب\ncategory_id: 32",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al-Risalah Al-Muwadidhah (The Clarifying Treatise)",
    "category_id": "32",
    "category": "Literature",
    "new_page_number": 2
  },
  {
    "serial_number": "6720969",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah (The Clarifying Treatise)",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Literature\nBook: Al-Risalah Al-Muwadidhah fi Dhikr Sariqat Al-Mutanabbi wa Saqit Shi'rihi (The Clarifying Treatise on the Plagiarisms of Al-Mutanabbi and His Weak Poetry)\nAuthor: Muhammad bin Al-Hasan bin Al-Muzaffar Al-Hatimi, Abu Ali (Died 388 AH)\n[The book is numbered automatically and does not correspond to the printed version]\nNumber of pages: 54\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nBook: Al-Risalah Al-Muwadidhah fi Dhikr Sariqat Al-Mutanabbi wa Saqit Shi'rihi\nAuthor: Muhammad bin Al-Hasan bin Al-Muzaffar Al-Hatimi, Abu Ali (Died 388 AH)\n[The book is numbered automatically and does not correspond to the printed version]\nNumber of pages: 54\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nAuthor: Muhammad bin Al-Hasan bin Al-Muzaffar Al-Hatimi, Abu Ali (Died 388 AH)\n[The book is numbered automatically and does not correspond to the printed version]\nNumber of pages: 54\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\n[The book is numbered automatically and does not correspond to the printed version]\nNumber of pages: 54\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nNumber of pages: 54\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\nPublication date in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 3
  },
  {
    "serial_number": "6720970",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Text of the Book\n\nIn the name of God, the Most Gracious, the Most Merciful.\nThe King, the Truth, the Manifest.\nPraise be to God, and may God bless Muhammad, the Chosen Prophet, and his pure family, and grant them peace.",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 4
  },
  {
    "serial_number": "6720971",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "Abu Ali Muhammad bin Al-Hussein Al-Hatimi, the philologist scribe, said:\nEven if the meanings of literature are like devoid ruins, with altered states, effaced courtyards, and erased landmarks and signs of dwellings, spoken of only by the tongues of calamities, they are today, through the Chief Abu al-Faraj Muhammad bin al-Abbas, adorned with horses, true in exploration, their quarters marked by the spring rains. They flourish with freshness and bliss, and their scent is complete with fragrance and breeze. May the knots of virtue remain organized by him, its neglected parts marked by his glory, and its obscure parts made known by his merits, as long as the tubes of spears scatter, a flower smiles at the selection of rain, and a tear remains confused in an eye.\n\nI find the Chief strongly attached to my discussing with him the dispute that occurred between me and Abu al-Tayyib Ahmad bin al-Hussein al-Mutanabbi, in the gathering where I recounted his traces, and news of which traveled to the edges of the lands. He is fond of repeating chapters of it related to my memory of it, disputing its scattered collection, pointing to the day that dispute broke out—a specific indication of the month, year, and time—and to what that dispute yielded for me in terms of fame, spreading reputation, and precedence in overtaking him, while I was in a state of inexperience and tender youth, reaching a goal in whose track only the seasoned men of virtue run. This is in addition to the elegance of the place, the brilliance of the Sultan, and the support of helpers and aides. And the spreading of my merit which was folded in those days, and my virtues which were obscured by the attacks of the envious and the age of youth.\n\nHe wanted me—may God prolong his power—to compose a treatise that encompasses its scattered parts and organizes the dispersed chapters and verses. I find myself not as enthusiastic for that as I used to be, nor do I rush to speak about it with the eagerness I once had. This is for reasons, the most specific of which is my rising above mentioning him now, with the blossoming of my branch, its fruiting, the smiling of its flowers, and the spreading of its lights. And to protect myself from the biting words of boys who have no minds, who descend into his faction and join his line. Then, because I extended the rein of speech with the man to a length that perhaps he who narrates it or reports it might be accused [of exaggeration], even though the situation is more famous in news and more lasting in trace than for its morning to be abrogated or its lamp extinguished.\n\nNotables of the people attended the gathering, whose importance is pointed to and whose news is trusted, including a judge whose word is final, a sheikh of literature whose testimony is accepted, and a youth from the sons of scribes whose water of modesty flows in the lines of his face. The Vizier Abu Muhammad al-Hasan bin Muhammad al-Muhallabi, may God have mercy on him, had there a vanguard of his vanguards, a scout of his scouts, and an eye of his eyes, sharp and kindled. For he—may God brighten his face—when Abu al-Tayyib became heavy in his service, and did poorly in descending to accept his favors, and was not successful in soliciting rain from his palm—which was dripping with fingers, pouring with silver and gold—he tasked me with tearing his sanctity and ripping his skin. He entrusted me with tracking his defects, examining his poems, and forcing him to leave Iraq and compelling him out of hatred for his stay, after he had gone to extremes in drawing him near and honoring him.\n\nIt suffices me that the Chief knows the truth of the situation, the truth of the speech, the excellence of the deed, and my rising in the prime of youth with what the determination of men fell short of. I came to him in the forenoon, when the sun cast its spears upon the earth, so I combined in his house the noon and afternoon prayers. I departed from him when the sun had shaken off its dye, and approached the darkness with its child (sunset). I had retrieved in the moment what I could retrieve of that dispute and rectified what fate aided me in gathering of it. The support of the present group in organizing and gathering it, observing what issued from me and him, and alerting to what was hidden from my memory, is what roused my mind, even if it was wandering, and struck the flint of my thought, even if it was flying sparks.\n\nSo I bound it in a treatise that branded the forehead of literature, and the mouths of narrators carried it in every direction. Since the Chief preferred that I name it after him and present it for his examination and criticism, I attach the wing of this introduction to it, refine what I see needs refining of its wording, and absolve myself to him from responsibility regarding the length of my breath in it, for my hand and tongue run in the arena of eloquence like the running of racehorses on the morning of the bet. I hope that success aids it through his beautiful opinion, and that it falls in the position I intended for it by complying with his decree. I will follow this with disputes I had with Abu al-Tayyib regarding his poetry in several gatherings other than this one, and with places I reviewed of his borrowings, thefts, and lapses he dropped in his poetry, in which no review or dispute occurred, so that it may be more enjoyable for its reader and more comprehensive of what I intended in it. I weave some into others without distinguishing last from first, or past from future, and I pair the speech with what increases the truth in clarity, from a witness...",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 5
  },
  {
    "serial_number": "6720972",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "related to it, or a verse that suits a verse, or a verse whose beginning was mentioned so I completed its end, or its end so I attached its beginning, or a meaning to which I joined its likeness. Indeed, speech is \"possessor of pregnancy\" (fruitful/generative), and the proverb goes: \"Speech has branches/shun\". Their saying \"Dhu Laqah\" (possessor of pregnancy/milk) comes from the pregnant she-camel, and 'Laqah' is the pregnancy. The meaning is speech that joins to speech just as the fetus joins the mother when it is in her womb. It is also said: \"Hayy al-Laqah\" (A tribe of Laqah) if they are mighty, not joining anyone, not submitting to a king, and cannot be overcome, like the she-camel when pregnant, the stallion cannot approach her.\n\nAs for their saying \"Dhu Shujun\" (possessor of branches), it is from the branches of the valley, its paths, and its bends. A person may be in a conversation, then exit from it to another, then return to his first conversation; likened to one walking in a valley where a path appears to him, so he takes it, and that leads him to the main road. Let not the Chief find the paths of speech too long, even if I lengthen them, for I have given the pen the reins of thought, and I have been fair with all fairness in refining what I recounted about the man. I deleted superfluous words and clothed his arguments in expressions which, perhaps if he had relied upon them, his material would have fallen short in expressing them.\n\nI name this treatise \"Al-Muwadidhah\" (The Clarifying/Exposing One), likening it to the *Muwadidhah* head wound, which is the one that exposes the whiteness of the bone, as Tarfa said:\n'And a clarifying wound exposing the bone repels from you the arrogance of the broad man / With the edge of your sword or your tongue... the original words like the desire of words.'\nThis is taken from the saying of Imru' al-Qais:\n'And the wound of the tongue is like the wound of the hand.'\nHassan said:\n'My tongue and my sword are both sharp / And my tongue reaches what my sword does not reach.'\nJarir said:\n'My tongue and my sword are both sharp / But the sword has a less severe impact than my tongue.'\nFrom God Almighty, I seek aid and success.\n\nWhen Ahmad bin al-Hasan al-Mutanabbi—whom the youths of the Levant and the coasts nickname \"Al-Mutami'\" (The Greed-Inducer) because of his saying: 'He makes the birds greedy for them due to the length of eating them / Until they almost land on their living ones'—arrived...",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 6
  },
  {
    "serial_number": "6720973",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "in the City of Peace (Baghdad), returning from Egypt and exposing himself to the Vizier Abu Muhammad al-Muhallabi to camp with him and stay by his side: He wrapped himself in the cloak of pride, dragged the tails of arrogance, turned his cheek (in disdain) to the Iraqis, sharpened his edge for dispute, distanced his side in haughtiness, and bent his side in tyranny and turning away. He would not meet anyone without turning away from him in arrogance, and embellishing speech to him in a deception that made him imagine—out of vanity—that literature was restricted to him, and that poetry was a sea whose fresh water no one else reached, and a garden whose flowers no one else saw. So he harvests its fruits and picks its clusters without anyone contending with him; and every runner in an empty space rejoices, and for every news, there is a settling place.\n\nHe remained running on this path for a little while, in which I let him drag the halter of transgression, prancing in its folds, until he imagined he was the forerunner who could not be raced in a track, nor could his cheek-strap be equaled by another cheek-strap (in a race). And that he was the lord of speech, the deflowerer of virgin words, the owner of the bondage of eloquence in prose and verse, and the unique one of his age who could not be rivaled in merit and knowledge. His tread became heavy on many who branded themselves with the brand of literature and drew from its water source. So they lowered some of their heads, lowered some of their wings, and settled their gazes on submitting to him.\n\nIt displeased Mu'izz al-Dawla—when his situation was depicted—that a man should arrive at his court, which is the abode of the Caliphate, the seat of might, and the egg of the kingdom, coming from the court of Sayf al-Dawla who was a distinct enemy, and find no one in his kingdom to equal him in his craft. And he (Mu'izz al-Dawla) is the possessor of the proud soul, the Kisra-like determination, and the ambition that if it intended the world (Time), the vicissitudes of Time would not act upon the free, nor would its circles turn against them.\n\nAbu Muhammad al-Muhallabi imagined, guessing at the unseen, that no one could compete with him, nor see himself as his equal, nor be capable of distressing him, let alone latching onto any of his meanings. Chiefs have ways of aggrandizing those they aggrandize, honoring those they honor, and respecting those they observe and dignify. Perhaps the state changes with them, and they are about to move from this characteristic; and that was the image of the Vizier Abu Muhammad in his returning from this opinion of him. There was no merit by which Abu al-Tayyib (Al-Mutanabbi) was distinguished from the hybrid novice among the sons of literature—let alone the purebred veteran—except poetry. For by my life, his branches in it were fresh and his fruits sweet.",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 7
  },
  {
    "serial_number": "6720974",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "I rose to face him, tracking his flaws, clipping his nails (curbing his power), broadcasting his secrets, spreading his folds, criticizing his verses regarding what they allowed, and intending that a house pointed to as possessing mastery should gather us. So I and he would run in a track where the forerunner is known from the overtaken, and the catcher from the one falling short of catching up. I was at that time possessing of a pouring cloud, a kindled flint in every virtue, and a nature resembling the clarity of wine when embroidered by bubbles and embroidered by cups. This, while the pool of youth was clear, its garment ample, the brocade of life fresh, its winds moist, its clouds pouring, youth having sharpness, and the approach of Time having a brightness. Horses on the day of the bet are by the luck of their owners, not by their veins and lineage. Every man has a share of the favorability of his time, in whose shade a need is fulfilled, a demand is reached, and a desire and doctrine are expanded.\n\nUntil, when obstacles of days prevented our meeting, I headed to his residence. Beneath me was a swift mule looking with the eyes of a marked hawk, and peering with the likes of eagle's primaries. She protects you from her front with the half of her rear (due to speed/agility). Topped by a magnificent saddle like a glowing star, beneath it a cloud led by the rein of the south wind. Before me were several handsome servants, Mamluks and freeborn, falling like unique pearls from their strings. I did not mention this to boast or multiply it, but I mentioned it because Abu al-Tayyib witnessed all of it in the moment, yet its magnificence did not awe him, nor did its glitter attract him, nor did what he witnessed of that beautiful group which filled his gaze and heart increase him in anything but vanity in himself, dragging the cloak of his arrogance, and turning his face away from me.\n\nHe was staying there with some youngsters whom scholars would not accept, nor had the mill of examination ground them, nor had they worn out thoughts in studying literature, nor distinguished between sweet speech and bitter, easy and rugged. The utmost limit of one of them was studying the poetry of Abu Tammam and dealing with speech on scraps of his meanings, and on what narrators attach of what is permissible in it. Who is there for the Chief to undertake this, even if occupying oneself with others—observing the poetry of the stallions who spoke naturally by their instincts, ran on their habits, did not affect it artificially nor force it arbitrarily—and researching their purposes which they aimed for, is more worthy?\n\nSo I found there youths taking something (of knowledge). When my presence was announced, and permission was sought for me to enter, he rose from his seat quickly and hid his person from me, concealing himself. I hurried him while dismounting the mule, and he saw me as I reached where his gaze took him. I entered, and the group magnified my status and seated me in his seat. Suddenly, beneath him were worn-out mats of worship upon which accidents had insisted, so they were fading traces and scattered wires. There was such bad manners at the meeting that I fold the rein of speech regarding it. It was only the time it took for me to sit until he came out to me. I stood up and fulfilled the right of greeting without disputing with him regarding standing, because he only intended by his rising from the place not to stand up for me, while the purpose in meeting him was other than that. So I rubbed what happened against my side (ignored it) and folded my flank over it. When I met him, I exemplified with the poet's saying:\n'And in walking to you is shame upon me / But passion prevented settling.'\nSo he exemplified with the saying of another:\n'People are miserable and others are miserable because of them / And God makes peoples happy through peoples.\nThe livelihood of a youth is not from the virtue of his trick / But lucks, livelihoods, and shares.\nLike the game, the skilled shooter is denied it, and / One who is not a shooter shoots and attains it.'\nSuddenly he was wearing seven tunics (aqbiya), each tunic a different color. We were in the heat of midsummer and the ember of summer, on a day when the deposits of skulls almost melted. Worthy of the saying of Mudris bin Rab'i:\n'And a day wherein the sun seemed resident / On the desert, knowing no doctrine but the desert.'\nAnd the saying of another:\n'And a day wherein salt seemed scattered in its middle / You see its wild animals riding the forelocks in it.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 8
  },
  {
    "serial_number": "6720975",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "I sat poised (ready to jump/leave), and he sat prepared (digging in). He turned away from me playfully, and I turned away from him absentmindedly. I reprimanded myself for visiting him and ridiculed my opinion for undertaking the burden of meeting him. He remained for a little while turning his shoulder, not lending me his gaze, turning towards that rabble in front of him. Everyone was gesturing to him, signaling with their eyes, pointing to my place with their hands, waking him from the slumber of his ignorance, but he refused except turning away, aversion, arrogance, and haughtiness. Then he saw fit to turn his side to me and accept me with some acceptance.\n\nI swore by loyalty—for it is among the beauties of oaths—that he did not add more than saying: \"What is your news?\" I said: \"In news am I, were it not for what I brought upon myself by visiting you, and the brand of humiliation I marked my status with by visiting you, and the burden my opinion bore of striving to the likes of you, among those whom experience has not refined nor insight disciplined.\" Then I descended upon him like a torrent to the bottom of a valley and said: \"Explain to me, from where comes your haughtiness, your vanity, and your arrogance? What necessitates what you are upon of being full of yourself, and throwing your importance to where your reach falls short and your arm does not extend? Is there here a lineage you attribute to glory by, or an honor you cling to its tails, or a sultan you dominate by his might, or knowledge by which you are pointed out? If you estimated yourself by your worth, or weighed yourself with your balance, and vanity did not take you away, you would not exceed being a poet earning a living.\"\n\nHis color changed, his spit dried up, and he began to soften in apology, desiring pardon and forgiveness, repeating oaths that he did not recognize me nor intended to slight me. I said: \"O you, if your visitor is noble in his lineage, you ignored his lineage; or great in his literature, you belittled his literature; or advanced with his sultan, you lowered his rank. Is glory an inheritance for you excluding others? No, by God, but you extended pride as a curtain over your deficiency, and struck it as a tent blocking your discussion.\" He repeated the apology, so I said: \"I have no excuse for you with persistence.\"\n\nThe group began urging me to be easy with him and accept his excuse, and to use the patience that prudent men use when angry. I remained on one path of reprimanding him, rebuking him, and criticizing his character, while he emphasized the oath that he did not know me with a knowledge that would seize the opportunity to fulfill my right. I said: \"Was permission not sought from you by my name and lineage? Was there no one in this group who knew me if you were ignorant of me? And suppose that is so, did you not see my appearance? Did you not smell the scent of my perfume? Did I not distinguish myself in your soul from others?\"\n\nWhile I filled his hearing with blame and refutation, he was saying: \"Ease up on yourself, restrain your sharpness, hold back your assault, be patient, for patience is among the traits of the likes of you.\" Then I softened my side to him, my nature became gentle in his hand, and I was ashamed to exceed the limit I had reached in punishing him. That was after I broke him in as one breaks in a young camel or a colt weaned from its mother. He turned to me glorifying, and expanded in praising me, magnifying. He swore that he had been yearning to meet me since arriving in Iraq, promising himself a meeting with me, and longing to attach to the causes of my friendship.\n\nWhen he exhausted this meaning, permission was sought for a young man from the Kufan Talibids (descendants of Abu Talib), so he permitted him. Suddenly, a youth with slender flanks, swayed by the intoxication of youth, his water smiling in the lines of his face. He spoke and expressed himself; behold, a melodious utterance, a sweet tongue, humorous morals, and a ready answer, with the patience of the mature and the dignity of the sheikhs. I admired what I witnessed of his traits, and what I discerned of his virtue possessed me.\n\nHe recited verses to him (Al-Mutanabbi), among which was the saying of Adi bin Zaid:\n'Like statues of ivory in the niches, or / Like eggs in the garden, a flower shining.'\nAbu al-Tayyib said: \"He likened women to ivory images. Niches are the fronts of councils. He mentioned eggs in the garden for their beauty and smoothness.\"\nThe Talibi turned to me and said: \"What do you say? The meaning is what he mentioned.\" He said: \"Then what is his saying 'a flower shining'?\" He (Al-Mutanabbi) said: \"To be more beautiful for it.\" This did not satisfy him. So I said to him: \"He likened the colors of the clothes upon them to the colors of the blossoms of gardens, and its flower is its redness and yellowness.\" He liked that. So he asked him about his saying in this poem:\n'Then after success, kingship, and nation (immah) / The graves hid them there, then they became\nAs if they were dry leaves which the East Wind (Saba) and West Wind (Dabur) played with.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 9
  },
  {
    "serial_number": "6720976",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Abu al-Tayyib said: \"[The meaning is] survival, and 'Immah' is grace/blessing.\"\nHe (the Talibi) said: \"How did he combine the East Wind and the West Wind, when one is soft and the other is severe?\"\nHe said: \"To correct the meter and rhyme.\"\nThe Talibi turned to me, so I said: \"He only chose the East Wind with the West Wind, bringing the softest wind with the strongest wind, because people, some die by severity and some by ease. Some are snatched by death this way, and some that way; in any case, it comes and takes.\"\nAbu al-Tayyib said: \"We have not heard of this.\"\nI said: \"Nor of anything else.\" Then I said: \"It is fair not to transgress from your poetry to another's, for in examining its beauties and harvesting its branches is distraction enough from others. There are things struggling in my chest regarding it, about which I would like to review speech with you.\"\nHe said: \"And what are they?\"\n[I said]: \"Tell me about your saying:\n'Fear God and cover that beauty with a veil / For if you appear, the chaste young women menstruate in their cheeks.'\nIs this how one flirts with lovers?\"\nHe said: \"Is it not thus in your Book?\" He disbelieved, may God curse him.\nI said: \"Where?\"\nHe said: \"The Almighty said: 'When they saw him, they magnified him (akbarnahu)' meaning they menstruated out of desire for him and admiration of his image.\"\nI said: \"No one from the verifiers among the people of knowledge said this, nor did a trustworthy person testify to it. Only an odd verse, not attributed to anyone, was narrated:\n'We come to women during their purity and do not / Come to women when they magnify (akbarna) a magnifying (menstruate).'\nHe said: \"Then what is the meaning of 'akbarnahu'?\"\nI said: \"They deemed him great. It cannot mean 'they menstruated', because the estimation of the speech necessitates that, if 'Ikbar' meant menstruation. I said: And the proof that its meaning is 'they deemed him great' is their saying: 'This is not a human; this is but a noble angel.'\"\n\nHe said: \"Then forgive this saying for my saying in this poem:\n'And a dark night, as if we / A Mahyal (mirror/illusion) was polished for us in it, so the smooth deserts guided us.'\n'It would not have ceased, were it not for the light of your face, its darkness / Nor would the camels have traversed it were it not for the she-camels.'\n'They sang of Ibn Ishaq, Al-Hussein, so / Their camel-humps shook hands with their saddles and pads.'\n'A youth like the dark cloud, feared and hoped for / Rain is hoped from him and thunderbolts are feared.'\n'If the Indian swords are slack with heads and necks / Then they are their combs and they are the necklaces.'\n'As if you, in giving, are a hater of wealth / And in every war, a lover of death.'\n'Fates do not provide to him whom you deprive / Nor do they deprive security to him whom you provide.'\n'Yours is the good, other than you is wealth / And other than me is joining other than Latakia.'\n'It is the furthest goal and seeing you is the wish / Your home is the world and you are the creatures.'\"\n\nI said to him: \"As for your saying 'And a dark night, as if we...', it is from the saying of Muhammad bin Munadhir:\n'When we saw, the Mt. Al-Malamal became for us / A day by the mention of Harun.'\n'If we travel by night and you are in front of us / The light of your face suffices as a guide for the mounts.'\n'Does it not increase the white camels in lightness of arm / Even if they are weary, that you are in front of me?'\n\nMarwan the Elder took this and said to Al-Mahdi:\n'To the Chosen One, the Mahdi, our camels waded / The darkness of the night, trampling the leather strap...'\n'The light of Imam Muhammad is for them / A guide by which they travel at night if the night darkens.'\n\nIdris bin Abi Hafsa took this meaning and said:\n'When she came to you, and she was struggling / Satisfaction approached between her hands with my leading ropes.'\n'She has before you a light by which she seeks illumination / And from your hope, in her heels, is a driver.'\n\nAshja' said:\n'If the dawn is absent, we wade by his face / The darkness of night until the dawn becomes clear to us.'\n\nAl-Abbas bin Al-Ahnaf transferred the meaning and said:\n'If there were no moon when I visit you / Guiding to the path of the clear road.'\n'The illuminating longing for your memory would have kindled / Until the earth lit up between my ribs.'\n\nAl-Qasafi said, and did well:\n'I remembered you one day, so the light of your mention / Lit the darkness of night until its darknesses cleared from me.'\n'By God, I do not know, is it a light poured out / Because of your memory, or does the heater heat the night?'\n\nSome natural Syrian poets said, and upon him I relied (referring to Al-Mutanabbi's likely source):\n'And a night whose two ends we connected by night travel / While an eager longing for your connection was serious.'\n'Darknesses from its gloom persisted upon us / Returning the rugged road as the path of ways.'\n'So I called out \"O Asma\" by your name, and it cleared / And every pitch-black darkness shone from it.'\n'By you (we are ransomed), you are a guide by whose mention we were saved / When the palms of perils had clutched us.'\n'I granted you my sincerity and purified my love for you / Even if you did not let me cross your mind.'\n\nAs for your saying 'The Indian swords became...', it is from the saying of Abu al-Hawl al-Himyari:",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 10
  },
  {
    "serial_number": "6720977",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "'A sword which the spirit fed until it seemed / A messenger from God for seizing souls.'\nAs for your saying:\n'As if you, in giving, are a hater of wealth / And in every war, a lover of death.'\nIt is from the saying of Al-Buhturi:\n'He hastened until he who witnessed the war said / Is it a meeting of enemies or a meeting of loved ones?'\nAs for your saying 'A youth like the dark cloud, feared and hoped for', it is from the saying of Bashar:\n'People hope for and fear your two states / As if you are Paradise and Hellfire.'\nAnd your saying: 'And your home is the world', is from the saying of Ali bin Jabala:\n'Let me roam the earth seeking wealth / For Karkh is not the world, nor is the person Qasim.'\nAnd your saying: 'And you are the creatures', is from the saying of Abu Nuwas:\n'It is not denounced for God / To gather the world (universe) in one person.'\nAnd Abu Nuwas took it from the saying of Jarir:\n'If Banu Tamim are angry with you / You think all people are angry.'\nSo Abu Nuwas transferred it from the tribe to a man. So you have no meaning in this rhyme scheme except as a follower, nor excellence you pointed to except as one seeking east (imitation) and copying. And upon that, you are regarding what you stole as some moderns said:\n'A youth who says poetry, except that he / In what we know, steals the stolen.'\n\nHe (Al-Mutanabbi) said in some of his formulation: \"So where are you regarding his saying in the other poem:\n'I remembered what is between Al-Udhayb and Bariq / The dragging place of our spear-shafts and the running place of the racing horses.'\n'And the companionship of a people who slaughter their hunted game / With the remnants of what they broke in the partings (of hair/heads).' (Using broken swords/combs).\n'And a night we pillowed Al-Thuwayya under it / As if its soil was ambergris in the elbows.'\n\nI said: The last verse is taken from the saying of Abu Uyayna:\n'In a planting like maidens and a soil / As if its earth is rose water on musk.'\nOr from the saying of Abdul Samad bin Al-Mu'adhdhal:\n'Its dew erases in it a curly dusty land / As if its earth is rose water and ambergris.'\nIbn Al-Mu'tazz took it from both of them and said:\n'As if censers of ambergris diffused / Or a musk pod was crumbled over your soil.'\n'And as if the pebbles of your land are jewels / And as if rose water is the drops of your dew.'\nThen I said to him: \"Where is [anything] from your love poetry that matches this?\"\n\nTwo of those present set themselves apart to record what arises from Abu al-Tayyib's answers to what I present, and two to record what I mention and enumerate. When the scope of speech expanded, its sea surged, its waves threw (foam), and it overwhelmed them with what they could not independently draw in a book, they limited themselves to recording it quickly (shorthand/notes), and on the words at the beginnings of the verses, and glimpses they discarded as glimpses of the arguments in their notebooks. Their determinations were alerted to be gentle in gathering that because of what I expected of their attributing it to him, and nothing happened without my knowledge encompassing it.\n\nI said: \"Tell me about your saying:\n'If some people are a sword for a state / Then among people are bugles for it and drums.'\nIs this pure praise or hybrid?\"\nHe said: \"Rather, from its hybrid.\"\nI said: \"What forced you to it?\"\n[He said]: \"It is a slip of the slips of the mind, from which rises my saying:\n'Indeed, he who was named against us is fair / And indeed, he who named him a sword is unjust to him.'\n'Not every sword cuts the heads with its edge / And cuts, for the changes of time, its noble deeds.'\nAnd my saying in this meaning:\n'The mind is bewildered in a sword whose origin is Rabi'a / And the Merciful is its maker (printer) and Glory is the polisher.'\nAnd in this I say, pointing to this meaning, and mentioning the state of a messenger who had come to him from the King of the Romans:\n'And how was this messenger guided in his land / While the dust clouds have not settled since I marched in it?'\n'And from which water was he quenching his horses / While the watering places have not cleared from the mixture of blood?'\"\n\nI said: \"You took your saying 'And Glory is the polisher' from the saying of Abu Tammam:\n'Pouring, by which they polished their honors / Indeed generosity is the polisher of lineages.'\nAnd you took your saying 'While the watering places have not cleared from the mixture of blood' from the saying of Abu Sa'd al-Makhzumi:\n'He does not drink water except from a well of blood / Nor does a neighbor spend the night with him in fear.'\nAnd Abu Sa'd took it from Bashar:\n'A youth who does not spend the night on grudge / Nor drinks water except with blood.'\n\nHe said: \"And my saying:\n'Is there not for the Caliphate a compassionate one / For the sword of its state, the sharp cutter?'\n'It cuts its neck without a striker / And travels to them without a carrier.'\nAnd my saying in this meaning:\n'The shoulder of the glorious King is its sword-belt / And in the hand of the Giant of Heavens is its hilt.'\n\nI said: \"You took this from the saying of Abu Tammam:\n'Indeed he has failed whose heart's core / Is the grave of a spearhead whose worker (wielder) is in the hand of God.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 11
  },
  {
    "serial_number": "6720978",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "He said: \"And my saying also in this meaning:\n'Do you think the white swords of India are its origin / And that you are from them? Evil is what you imagine.'\n'If they heard the name of the Prince, you would think them / Out of pride, smiling in their scabbards.'\n\nI said: \"The second is from the saying of my father, moving from one direction to another:\n'The sun and the illuminating moon act proud / If we say: They are like the Prince.'\n\nI said: \"Tell me about your saying in the elegy of Sayf al-Dawla's mother:\n'Nor are there among those in her funeral merchants / Whose farewell is the shaking of sandals.'\nIs this how the likes of her is eulogized, when she was the Balqis of her age, a great destiny, and a huge kingdom, recently and of old?\"\n\nHe said: \"Am I not in this poem [saying]:\n'The princes walked around her barefoot / As if the pebbles were of the down of ostriches.'\n'And the cheeks appeared humble / Placing the soul in the most expensive places.'\n'Calamity came to them while they were heedless / So the tear of sadness is in the tear of coquetry.'\"\nAnd he recited verses from the beauties of this poem.\n\n[I said]: \"The first verse of these verses is from the saying of Al-Sanawbari:\n'A sleeper of the forenoon, hedgehogs are more gone (more awake/active) than him / When sleep overcomes him, the awakening of foxes.'\nOr from the saying of Ibn al-Rumi:\n'If she lay on the thorns of the caltrop / Under the heavy tread, she would find it like fennec fur.'\nAnd the last verse of these verses looks at the saying of Al-Abbas bin Al-Ahnaf a hidden look. It is from his meanings which he invented:\n'She wept, not comforting with weeping / You see the tear in her eyes as a stranger.'\nUpon that, it is obligatory not to deny an excellence your poetry organized, nor a rare meaning your thought cast about in the lands. But you are in the verse of the poem and the verses an excellence that critics of speech and masters of eloquence are not ignorant of, concise in its expression, creative in its composition, correct in its meaning, and sound in its wording. Then you pair that with verses silly in wording and meaning, and with verses whose meanings and some words you raid like the raid of wolves on the flock of sheep, so the poem comes with poetry without resemblance.\n\nOne of the most obscene defects is that the word does not fall accompanying its sister, nor pairing with what neighbors it. Marwan bin Saeed bin Abbad bin Habib bin Al-Muhallab bin Abi Sufra said, addressing Abdullah bin Muhammad Abi Uyayna:\n'What is wrong with your poetry, mixed and different / A verse worthy of praise and a verse falling, senile?'\nUmar bin Laja' said to a cousin of his: 'I am more poetic than you.' He said: 'How?' He said: 'Because I say the verse and its brother, and you say the verse and its cousin.'\nDo you not see the saying of the poet:\n'And poetry like the dung of the ram, differentiated between it / Is the tongue of a claimant, an intruder in poetry.'\nHe says: It is different in meanings, contrasting in structures, running on no suitability nor similarity nor closeness, because the dung of the ram falls scattered, separated, contrasting.\nAl-Kumait said:\n'We saw in it white women, soft / White, in whom coquetry and coolness of teeth were complete.'\nNusayb criticized this on him and said: 'Why didn't you say as Dhu al-Rumma said:\n'Dark-lipped, in her lips is a dark red color / And in the gums and in her canine teeth is coolness.'\nThis, by my life, is an obscene defect because the speech did not run on a system, nor arrived on conjunction and mixture, nor was consistent in coupling. One of the things speech needs is to be organized on the pattern of similarity and placed on the drawing of resemblance.\n\nAmong what you went in this way is your saying:\n'How far is defect and decrease from my traits / I am the Pleiades and these two are gray hair and old age.'\nThis is also speech running on no suitability; because the Pleiades is not of the genus of gray hair and old age, nor are they of its genus. The face of speech was to say: I am the Pleiades in unveiling and height, and these two are Suha (star) in hiding and fading. Or to say: I am youth and these two are gray hair and old age.\n\nPerhaps you presented the verse comprising, depositing of the impossible meaning, what agitates the poem entirely, even if it was of the core of wording and the hilt of eloquence, like your saying in the poem whose beginning is:\n'A flock whose beauties are denied to their possessors.'\nAs if this verse is from the speech of Shibli or Samnun the Sufi. Then you flirted and said:\n'I, despite my fondness for what is in her veil / Am chaste regarding what is in her trousers.'\nHow different is this from the saying of the first one:\n'No, by Him to whom foreheads prostrate / I have no news of what is under her tail.'\nAbu al-Tayyib said: \"Is that so? And upon this, what I said is not more obscene than the saying of Imru' al-Qais:\n'Many a pregnant one like you I visited at night and a nursing one / So I distracted her from an amulet-possessing one-year-old child.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 12
  },
  {
    "serial_number": "6720979",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "'When he cried behind her, she turned to him / With a half, and beneath me her half did not shift.'\nI said: Imru' al-Qais was hated (by women), and the pregnant one is the one desiring men. So he says: If I distract her, I am more loved than others. And you took this verse from a safer verse, more noble in wording:\n'No, by Him to whom foreheads prostrate / I have no news of what is under her dress.\nNor of her mouth, nor did I intend her / It was nothing but conversation and looking.'\nAnd your other saying in this manner is higher and more noble, which is:\n'He repels a hand from her dress while he is capable / And disobeys passion in her phantom while he is sleeping.'\n\nHe said: \"Did I not say in the second poem:\n'I kissed them, the blazes of the horses, as if / The hands of Banu... were on their foreheads.'\nAnd in it I say:\n'And troops with troops, I left them / Food for wild beasts from their foods.'\n\nI said: \"As for the first verse, it is from Abu Nuwas describing hunting dogs:\n'White-faced (blazed) and white-footed / As if our hands were on their chests.'\nAnd the second verse is from his saying in this Urjuza:\n'With dogs prancing in their straps / Counting the eye of the wild beast among their foods.'\nAnd Abu Nuwas took it from the saying of Abu al-Najm:\n'Counting the herds of the curved sands among her wealth.'\n\nPerhaps you brought the hollow verse and the defective one. He said: \"What is the defective and the hollow?\" I said: \"Yunus bin Habib narrated that the hollow is the corrupt of filling (padding), and the defective is what its two ends are defective. The limits of poetry are four: Wording, Meaning, Meter, and Rhyme. Its words must be sweet, accompanying; its meanings and metaphors appropriate; and its similes sound. And it should be easy of prosody, graceful of weight, chosen of rhyme, splendid of beginning. Perhaps you left empty, broke promise, excused (fell short), and wove thinly, and I do not see you looking at the necessity of these words.\"\n\nHe said: \"And what necessity is there for them! You only cite them out of permissiveness, passion for lengthening, and dragging yourself with false claims.\"\nI said: \"Do not lengthen the rein of speech in what goes out of the schools of the people of virtue, lest you hear of speech what your patience narrows from. For Imru' al-Qais said:\n'If a man does not store his tongue regarding it / He is not a storer of anything else.'\nRather, it is said of the poet if he comes with verses comprising original meanings and chosen words, then cites in their midst a verse empty of this description: He has left empty. And it is said of him if he comes with a meaning he did not fulfill: He has excused. And if he differs between the rhyme of the second hemistich and the rhyme of the first hemistich in the opening of the poem: He has broken promise. As Dhu al-Rumma said:\n'O stay safe, O house of Mayy on the decay / And may the rain cease not pouring on your sandy hill.'\nSo as if when he said 'Ala al-Bila' (on the decay), he promised to compose a poem on [that] rhyme, and as if when he said 'Al-Qatru' (The Rain), he broke that promise by making it an R-rhyme.\"\n\nThen I said: \"And among your love poetry in which you diverged from the schools of the natural and refined poets is your saying:\n'Thick (Rabhlah), dark her kissing place (lips) / Tall (Sabhlah), white her stripped place (body).'\nRabhlah: The large, good-bodied. Sabhlah: The tall, large. And a man is Sabhal Rabhal. Therefore, these two words are detested in the words of the moderns, because they are from the rough words of the Arabs. You took them as a copy from the saying of some Arab dandling a little daughter of his:\n'Sabhlah Rabhlah / Growing the growth of the palm tree.'\n\nI said: \"Tell me about your saying describing a horse:\n'He has exceeded in the leg the ostriches (Naqaniq) / And exceeded in the ear the leverets (Haraniq).'\n'And exceeded in caution the magpies (Aqaqiq).'\nHe said: \"What is in that?\"\nI said: \"Your daring to organize this fallen speech and your boldness in striking the hearing with the likes of it, not shy nor observant. What do you intend by your saying 'Exceeded'? Did he exceed in the strength of the leg or in its length? And in the creation of the ear of the leveret or in the delicacy of its hearing? How silly is this in wording and how little its share of clarity. You only went in your saying:\n'He exceeded in the leg the ostriches'\nto the saying of Abu Duwad:\n'He has the two legs of a male ostrich, dyed / Surprised by terror.'\nAnd in your saying:\n'And exceeded in caution the magpies'\nthe saying of some Arab:\n'I was afflicted with a woman like the stick / More thieving and more malicious than a Kundush (magpie).'\nAnd their saying: 'He is more cautious than a Kundush', which is the magpie. And you have heard the saying of Imru' al-Qais:\n'He has the two flanks of a gazelle and the two legs of an ostrich / And the jog of a wolf and the gallop of a fox.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 13
  },
  {
    "serial_number": "6720980",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "Let these words that led you into the wilderness distract you from the whisperings of your thought, and look at his combining of these divergent words and separate parts. For he likened in this verse four things, since the output of this expression is in simile, so that the intended meaning falls into clarity: that he has two flanks like the flanks of a gazelle, two legs like the leg of an ostrich, a jog like the jog of a wolf, and a gallop like the gallop of a fox. You strayed in these verses of yours from the path of excellence and extinguished with these anxious words the lamp of clarity.\n\nHe said: \"So in it I say:\n'He shows you clumsiness while he is the eye of the skilled.'\"\nThat saying of his angered me and I said: \"I see you count against us, yes!\"\nHe said: \"God forbid.\"\nI said: \"As for this, it is stripped, the stripping of the hide, from the Rajaz poet describing a she-camel:\n'Clumsy except that she is skilled.'\nOr from the saying of Hamid bin Thaur:\n'So he said: Sleepy, and he was not sleeping / To the skilled of the foot, clumsy of the hand.'\nThese two verses are among the most concise of what the Arabs said. And what runs with them in brevity, good conciseness, and nearness of source is the saying of the other describing an arrow:\n'He left a disease and went on healthy.'\nAnd like it is the saying of the other describing a wild beast and an arrow:\n'Until it escaped from his hollow and did not escape.'\nAbu Nuwas said:\n'The making of the gentle one and the snatching of the clumsy one.'\nAs if it is from the saying of Hamid bin Thaur:\n'The clumsy one built his house, while she is gentle / For him, with stairs between two safe woods.'\n\nAnd in this (poem) he says describing the horse:\n'He outstripped the old horses (Madhaki) while he was in the Aqaiq (foal hair/womb).'\nHe only took it from the saying of the Rajaz poet:\n'The ulcerated one has won while he is crouching / So how will he not win when he races?'\nHe means that his mother won while he was in her belly.\n\nThen I said: \"You were cold (dull) in this Urjuza according to your habit when you said:\n'The snow resided in it like elbows / Knotting above the tooth the spit of the spitter.'\nI call God to witness that this is of lean speech and fallen poetry.\" One of his followers said: \"Is it said to the speech of the likes of him 'lean'?\" [I said]: \"Yes, is he not the one who says:\n'The slave, his morals do not exceed / His private parts, the teeth, or his molar.'\nAnd among his coldness is his saying:\n'And you only trick in untying it / As if you are the sailor with his rope.'\nAnd like this is his saying:\n'For a Sari (traveler/noble) his clothing is rough cotton / And the Marwi cloth of Marw is the clothing of monkeys.'\nAnd his saying:\n'I was among people in a gathering / So here I am in a gathering of monkeys.'\n'So do not listen to the liars / And do not care for the plot of the Jews.'\n\nAnd of ugly simile is your saying describing a battalion:\n'And a gathered, sword-bearing, spring-time (Rab'iyya) one / The pebbles shout in it the shouting of the stork.'\nYou took it from the saying of Ibn al-Mu'tazz:\n'And a town of shouting rocks.'\nBetter than this is the saying of Al-Nami in a word he praised Sayf al-Dawla with, the first of which is 'Stop, and upon him is the tear, for he is a dune'. He said in it:\n'They stutter the words of the pebbles with hooves / If you speak to them, their non-Arabic speech expresses love.'\nHe said: \"Do not the sounds of pebbles under the hooves of horses resemble the sounds of storks?\"\nI said: \"Suppose it resembles it, is it among the beautiful similes? Do you not see that they condemned the saying of Labid:\n'... and leaving like onions'\nwhile it is a valid simile, and blamed the saying of the other:\n'And the horses raid from through the dust / Like dates scattered from behind the cutter.'\nAnd the good is the saying of the poet:\n[Missing Verse Context] He says: They came out equal like the equality of the fingers of the one warming himself at the fire.\n\nAnd of his rough wording is his saying:\n'Where is the dirt (Turab) before his weaning / And he eats it before reaching the eating (age).'\nThe word 'Turab' (dirt), despite the soundness of its source, is very rough. He relied in this verse on the most delicate verse in its meaning and most touching in wording, which is the saying of Muhammad bin Yazid al-Umawi al-Sulami:\n'Death weaned you before weaning / And decrease contained you before completion.'\n\nAnd of the trivial speech, its fallen, and its obscure is his saying:\n'You belittled every great one and rose above / Until it was as if you reached the age of a boy.'\nThis is of the closed, anxious copying, and it is, with its anxiety, taken from the sweetest and soundest wording. Some of the early poets in the Umayyad state said:\n'You reached, for ten that passed of your years / What the gray-haired master reaches.\nYour concern in them is great matters / And the concern of your peers is to play.'\nAnd better than his saying 'You belittled every great one' is the saying of the first:\n'He has ambitions that have no end to their greatness / And his smallest ambition is greater than Time.'\nAnd of his coldness is his saying:",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 14
  },
  {
    "serial_number": "6720981",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "'A noble one, you shook the people when you reached him / As if they were what dried of the provisions of a traveler.'\nFie on this simile, and error to this representation, and oh mercy for the one praised by it and the one faced with its corruption.\n\nAnd his saying also:\n'He bites the ember and the iron, the enemies / Before him, the biting of the sugar of Ahwaz.'\nAnd in this poem he says describing a sword:\n'The sword-belts of Time carried it until / It is in need of a stitcher.'\nAlthough he took it from the saying of Al-Buhturi describing a sword:\n'Its old sword-belts carried a legume / From the era of Ad, fresh, not withered.'\nBy my life, he surpassed the stallion poets in his description of this sword, and ran with them in the race of excellence, but they fell short of the goal of his precedence. Al-Mutanabbi's saying describing his sword: 'It is in need of a stitcher' distracted us from the saying of Tarfa describing his sword:\n'A brother of trust, not turning away from a strike / If it is said \"Gently\", his separator (the blow) says \"Enough\".\nA sharp sword, if you rise victorious with it / The return (second strike) suffices you from the start (first strike), not weak.'\nAnd from the saying of Al-Nabigha:\n'A copy cuts the double Saluqi armor / And kindles the fire of the firefly with the blades.'\nHis saying: \"If it is said gently\" means if he says gently, the separator between me and the struck one says: It has completed what was intended of cutting.\nAnd the saying of Abu al-Najm:\n'It scatters, with the trembling of the right hand of the one exerting himself / The thick part of the forearm, the breaking of the cutter.'\n\nI said: He is the one saying:\n'Who is for me regarding Fahm, a people of an age who claim / That the Indian (sword) counts Baqil among them.'\nIf Baqil were the sayer of this poetry, he would be mourned for a period. How great is his admiration for the diminutive, yet no sweet diminutive happens for him in it. Perhaps he wanted to match the saying of Al-Qutami:\n'Experience and calmness may make him last, indeed I / See the heedlessness of life before experiences.'\nOr the saying of Al-Najashi:\n'A little tribe that does not betray a covenant / Nor wrongs people a grain of mustard.'\nBut there came to us from his diminutive what went out of this door, so he strayed in it from the path of correctness, and he is the one saying:\n'A little tribe, you are you, and you are of them / And your grandfather is Bishr the King, the Ham (Head/Owl).'\nThis, even if it is cheating as the Chief sees, is indicative of the stutter of its sayer. And how is it not attributed to coldness (dullness) when he comes with this and its likes!\n\nAnd of the hybrid speech and base meaning is his saying:\nBy my life, this is of the results of his mind, the inventions of his thought, and the daughters of his chest. Likewise his saying also:\n'So in every day this Domesticus is advancing / His back of the neck blames his face for advancing.'\nThis is of the lean antithesis, and sufficient is the saying of Abdul Samad bin Al-Mu'adhdhal:\n'The beauty of your back of the neck revealed the beauty of faces.'\nAnd sharing in this meaning is the saying of the other:\n'His back of the neck is a face, then the face of whom / His back of the neck is a face resembles the soul.'\nAnd what was criticized of Dhu al-Rumma is his saying:\n'And Mayya is the best of the two worlds (humans and jinn) in neck / And throat, and the best of them in the back of the head.'\n\nAnd of what you do not see doubt in its coldness nor in the stutter of its sayer:\n'So pattern the water of his leg and sprinkle it in / The cities, you will be safe with the confident from the earthquake.'\nAnd of the stutter and weak wording and severe need is his saying:\n'The pouring cloud, son of the pouring cloud / Son of the pouring cloud, son of the pouring cloud.'\nI wish Abu al-Tayyib conversed with the stars of darkness a whole night until its morning greeted him with its face when this verse was organized for him, and it will come later.\n\nAnd of the most hybrid oaths and weakest knots of speech is his saying:\n'If the like of you was or is to be / Then I am innocent at that time from Islam.'\nHe only imitated the saying of some judge in the days of Al-Ma'mun:\n'I am innocent from Islam if this which / The slanderers told you about me is as they said.\nBut when they saw you fond / Of my connection, they advised each other with gossip and plotted.'\nAs if he did not hear the oath of Al-Nabigha in his saying addressing Al-Nu'man:\n'I did not call for a thing you hate / If so, then may my whip not be raised to my hand.\nIf so, then may my Lord punish me a punishment / By which the eye of who comes to you with envy is cooled.'\nLooking at this meaning is his saying in the other poem:\n'If the palm of the right hand repelled you in fear / I would single out the right hand from the left.'\nTo the saying of Amr bin Qami'a:\n'So I did not say what they spoke falsely / Nor did I hate that it be said.\nIf it was true as they reported / Then a right hand did not connect for me to a left.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 15
  },
  {
    "serial_number": "6720982",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "And from here Al-Nabigha took his saying:\n'If so, may my whip not be raised to my hand.'\nSuppose he did not intend this, did he not narrate the saying of Abu Sa'd al-Makhzumi:\n'No, by Him who created the reddish wine from gold / And water from silver, he who is stingy does not rule.'\nNor did he narrate the saying of Ali bin Muhammad Al-Alawi Al-Basri:\n'He meets spears with his throat and chest / And sets up his skull in place of the helmet.\nAnd says to the side (body/horse): Be patient for the edge of the spears / For you would destroy the pillar of glory if you were not covered (forgiven/protected).\nWhen he contemplates the figure of an approaching guest / Wearing the garment of a dusty night.\nHe signaled to the large camel: This is a night visitor / The enemies will slaughter me if you are not slaughtered.'\n\nLean speech and objectionable is his saying:\n'A youth, a thousand parts is his opinion in his time / The least small part, some of it is the whole opinion.'\nAnd his saying:\n'So all of you came the coming of his father / And every deed of all of you is wonderful.'\nThis is disturbed wording and collapsing order. And his saying:\n'O you in whose shade we seek refuge from Time / Forever, and drive away Iblis with his name.'\n'Best on the palaces, and the worst of them / Takes refuge in ruins and inhabits the tombs.'\nIn this poem he says 'The best of birds are on palaces', while among the birds that inhabit built palaces are storks and owls, and they are not the best of birds.\n\nAnd of the trivial speech is his saying:\n'Until the people say: What is a sane one / And the treasury says: What is a Muslim.'\nOnly the saying of Ubayd bin Ayyub Al-Anbari, one of the thieves, harmed him:\n'He would not give the likes of it in the likes of him / Except one of noble nature or a madman.'\nAbu Nuwas went to this in his saying, where his mind strayed from the path of correctness in it:\n'He gave money generously until it was said: Is this one sane?'\nAbu Tammam said:\n'He ceased not raving about noble deeds and dew / Until we thought he was feverish.'\nAl-Buhturi said, and improved his expression:\n'If a group protected generosity, it became difficult / With him, a mad determination in spending it.'\nAll these intended the saying of the first:\n'In the love of him whose gifts are hoped for / They sought rain from Quraysh, every deceived one.\nYou think regarding him, when you deceive him... / About his money, while he is raising religion and piety.'\nSo he fell into the wilderness, and Abu al-Tayyib rolled in their traces on the top of his head. Abu Tammam had touched upon this meaning, so he stepped over the defect in it:\n'Heights distracted him, so he does not count / Misery as misery nor bliss as bliss.'\n\nAnd his saying:\n'As if I rolled out the earth from my experience of it / And Alexander built the Dam from my determination.'\nThis is a reprehensible wording and a simile not approved. He only intended by it the saying of Abu Tammam, although there is no good in it either:\n'So I smashed a dam, the dam of Gog, before him / Out of worry, no drop emptied on its anvil.'\n\nAnd of what has no benefit is your saying:\n'Near, far, answering, hating, joyous / Mightiest, sweet, bitter, soft, fierce.'\n'Generous, refusing, jealous, fulfilling, brother of trust / Curly, noble, prohibitor, scarred, satisfied, intelligent.'\nHe took his saying 'Sweet, bitter' from the saying of Al-Shanfara, rather from the saying of Al-Hudhali:\n'Sweet and bitter like the curve of the arrow shaft, its bitterness / In every vessel the night decreed, he wears.'\nAnd of what has no benefit also is your saying:\n'The pouring cloud, son of the pouring / Son of the pouring cloud, son of the pouring cloud.'\nAnd like this is your saying also:\n'I stab her with the spear, I strike her / With the sword, her chief, her burier.'\n'Her most knightly knight and her longest / In reach, and her raider and her master.'\n'Sun of her forenoon, moon of her night / Pearl of her necklaces, her chrysolite.'\nIt is, with that, composed a composition on the saying of Abu Bakr Duraid in a poem the first of which is 'I have no concern with length...':\n'I mourn her... / Youth of Ya'rub and her defender.\nHer drawn sword and her warrior / Her chief, her fortress, her lion.\nI stab her with the spear and strike her / For her worries... her advancer.\nHer lion, her star, her thick-necked one.'\nSeveral verses ran in this manner. We have not heard of anyone likening a man to chrysolite before him, and this is of his virgin meanings and his free words.\n\nAnd of hybrid speech is his saying also:\n'He is not like the sea of water, its bottom is drained / To where the water ends, a whale and a frog.'\nAnd of the leanness in which there is no doubt is his saying:\n'The leanness of my life is that my dignity be lean / And it is not lean that food be lean.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 16
  },
  {
    "serial_number": "6720983",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "And more hybrid than this in wording and less in share of clarity is his saying:\n'A writer, for knowledge in the land of his chest anchored / Mountains; the mountains of the earth beside them are a hill.'\n'Generous, his palm rose in good and evil / A rising, so time wished its name was a palm (Kaff - also means stop).'\n'So there is no inferior below whom rain is hoped for / Nor does the generosity end behind whom there is a successor.'\nAnd his saying:\n'And a forgiveness, if other than anger were from it / Their heads would have been made soles for sandals.'\nAnd his saying describing rain:\n'For its scraper on the graves is a heavy rain / Like the legs of horses seeing the nosebags.'\nHe was only deceived by the saying of Zuhair:\n'... it scrapes the hills...' he did not mention the verse.\nAs for a rain-seeker asking for rain for graves that scrapes their soil and unearths their dirt, no one has said this. Rain is only sought for the dwellings of loved ones and for the graves of the noble so that land may be protected and those lands become grassy so they can be grazed. Then its people remember, and mercy is asked for who the soil hid in it. And everyone who is far from it yearns. Then they guard in the watering against effacing its dwellings and traces, as Tarfa said:\n'So may there water your dwellings, without spoiling them / The pouring of spring and a continuous rain pouring.'\nAnother said:\n'May God water a watering of mercy the people of a town.'\nHe guarded by his saying 'watering of mercy' a subtle guarding. As for seeking rain for it that effaces the trace, its impact like the impact of horses' legs striking the ground until it demolishes and digs it, then no.\n\nAnd his saying:\n'And I think he thought the spearheads sweet / Or thought them Barni dates and Azad dates.'\nKuthayyir was criticized for his saying, which is less than this:\n'And they are sweeter, if you tasted one day / On the palates, than the dates of Ibn Tab.'\nIt was changed against him, so he made it: 'Than the honey of saliva', and there is no good in either. Then he said:\n'So he became a prisoner, his clothes wet / With blood, and he wet the thighs with his urine.'\nLikewise his saying: 'Al-Azada'. This is an anxious rhyme, attracted, imported, defective, unacceptable. The path of the poet is to care for refining the rhyme, for it is the center of the verse, whether that poetry is praise or blame, erotic or genealogical, description or simile. And to contemplate the purpose his thought aims for, so he waits in which meters it is better continuing, and with which rhymes it is more steady. So he clothes it in its most honorable exhibitions, highlights it in its safest expressions, and relies on establishing meanings in their seats and placing them in their locations. It was narrated about Al-Hutay'ah that he said: 'Refine the rhymes, for they are the hooves of poetry.'\n\nSo what a difference between your saying 'Al-Afkhadha' (The Thighs) and the saying of Al-Hutay'ah:\n'They are the people who, when / A darkness of days befalls, they illuminate.'\nFor his saying 'they illuminate' has a subtle position; that is because it is a word that cannot be exchanged for another, nor changed with what fills its place.\nLikewise the saying of Al-Nabigha:\n'Like the chamomile on the morning after its rain / Its upper parts dried and its bottom is wet.'\nFor his saying 'And its bottom is wet' has a wondrous position in this place; that is because the blossoms... He disliked likening the mouth to it in this state, so the mouth would be like riding one part over another. So he likened it to chamomile when the sun hits it; he said: 'Its upper parts dried', he meant spread out and its wrinkling went away. Then he said: 'And its bottom is wet', so he guarded against it being withered and dry.\n\nAnd your saying: 'He wet his clothes... and wet the thighs with his urine' looks at the saying of the first:\n'I swore I would not bury your dead / So smoke the man and his shirt.'\nHe says: That if he stabs him, he defecates in his saddle. He alluded to that with this eloquent, innovative allusion, and expressed with this sturdy phrase. Among the saying in the revealing structures is the saying of Imru' al-Qais:\n'For indeed he will not boast over you like a boaster / Weak, nor will the like of a defeated one defeat you.'\nAnd the saying of Zuhair:\n'I know what is in today and yesterday before it / But I am blind to the knowledge of what is in tomorrow.'\n\nAnd of his anxious words and obscure meanings is his saying:\n'The clouds did not imitate your gift, but / It became feverish with it, so its pouring is the sweat of fever (Ruhada').'\nHe only looked at the saying of Abu Nuwas:\n'Indeed the clouds are shy when they look / At your dew, so they measured it by what is in them.\nUntil they intend to stop, but prevents them / Fear of punishment for disobeying their Creator.'\nAnd of this path is his saying:\n'He almost, from the health of determination / Does what is almost not done (passive/affected).'\nAnd of his affected, arbitrary exit which differed from the schools of the moderns is his saying:\n'I love you, or they say an ant dragged / Thabir (mountain) and the son of Ibrahim was terrified (Ri'an).'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 17
  },
  {
    "serial_number": "6720984",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "Ri'an is from Raw' (terror). How far is this speech from excellence, and how intense its difference from clarity, and how indicative it is of the narrow capacity of its sayer, and of the corruption of his imagination. I do not think he heard the saying of Mansur Al-Namari:\n'Are you serious? Do you know that many a night / As if its darkness spreads from your locks of hair.\nI was patient for it until it revealed a blaze / Like the blaze of Yahya when Ja'far is mentioned.'\nNor did he review the saying of Muhammad bin Wahib:\n'His lips ceased not kissing me / And the pitcher and the cup gave me a second drink.\nUntil the night claimed back its robe / And a brightness appeared through its blackness.\nAnd the morning appeared as if its rising / Was the face of the Caliph when he is praised.'\nNor the saying of Al-Buhturi describing a house:\n'If I were given wishes in them / I would have watered them with the palm of Ibrahim.'\nYou took this and said:\n'May a morning cloud among the clouds water your resting place / A match to the gift of your palm in giving.'\nNor his saying:\n'They endured a night before Qasan which almost did not / Its ends catch up after its two sides.\nWhere gifts are flashing, unveiled / To every poor person, and promises are distinct.'\nNor his saying:\n'Anemones carrying dew as if it is / Tears of youthful passion on the cheeks of the virgins.\nAs if the hand of Al-Fath bin Khaqan approached / Following them with those flashing thunders.'\nYes, you have read this, for you took the meaning in it and said:\n'Return the connection, may a cloud water your remnants / If your connection were like it, it would not have cleared.\nThundering, showing you the sky as fire and the desert / As the sea, and the hills as a fertile garden.\nLike the fingertips of Abdul Wahid who / Quenched and secured whom he wills and frightened.'\n\nOf the best exits is the saying of Abu Tammam:\n'Offense of accidents, derive a tunnel / For the kindness of Ibn Hassan has overshadowed you.'\nAnd his saying:\n'His two eyes did to the lover what / The gifts of your two hands do to hopes.'\nAnd his saying:\n'Do not deny the void of the noble from wealth / For the flood is war to the high place.\nAnd look at the trotting of the mounts urged by / The reviver of poetry to the destroyer of wealth.\nHe spread hope for us despite calamities / With which the deaths of hopes increased.\nThe most expensive virgins of poetry are that their dowries / Are expensive with the noble when they become cheap.'\n\nAnd of his closed generosity and rough erotic introduction is his saying:\n'If they blamed regarding her, I answered that he / Is the two beloveds of my heart, my heart is Juml.'\nAnd of the closed locked (meaning) is his saying:\n'A land in which is the honor of others like it / If the like of you were found in others.'\nHe says: This land has an honor by your settling in it, and if the like of you were cast in another land other than it, it would be like this one.\nHis saying:\n'Who is in the creation among the noble? And do not say / Who is in you, O Sham, other than Shuja' is intended?'\nHe wants: Do not say who is in you, O Sham, but who in all creation is intended.\nAnd of the closed in it is his saying:\n'How can Adam be the father of creation / While your father is Muhammad and you are the two heavy ones (Thaqalan - Jinn and Mankind)?'\nThe estimation of the speech: How can Adam be the father of creation while your father is Muhammad and you are the Thaqalan? Perhaps he means you are mankind and Jinn, and Adam is one of mankind, and your father is Muhammad, so how can Adam be the father of creation? He separated the subject which is 'Your father' and the predicate which is 'Muhammad' by the sentence which is his saying 'And the Thaqalan are you'. This is severe arbitrariness, and a path far from eloquence.\n\nAnd of the obscure ambiguous is his saying:\n'And how many and how many a need you permitted / Its appointment is closer than me to myself.'\nThis is of the reprehensible speech, and hateful composition. He only went to the shortness of his appointment's time, and the nearness of his promise in fulfilling it, but he expressed this meaning badly, every badness.\nAnd of this genus is his saying:\n'And the distance of our distance is the distance of nearness / And the nearness of our nearness is the nearness of distance.'\nHe says: The furthest of what was between us of distance, so he made it like the distance of nearness which was between us, and the nearest of our nearness he made like the nearness of distance that was between us. He went to the idea that his nearness to him was according to what was between him and him of distance.\n\nAnd of the worst expression is his saying describing a horse:\n'A swimmer (horse), she has from her, upon her, witnesses.'\nAnd his saying:\n'I chose the dark one of the two, O rain / And he who has in favors the news.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 18
  },
  {
    "serial_number": "6720985",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "He wants: I chose the dark one from these two mares, O man who runs in his generosity the course of rain. This is speech whose affectation and hatred witness its distance from the path of clarity.\n\nAnd of his hybrid speech is his saying in satirizing Ibn Kayghalagh:\n'And if he points while speaking, it is as if he is / An ape laughing or an old woman slapping.'\nAbu al-Tayyib said: \"Did you not review in this poem my saying:\n'Ibn Kayghalagh protects the road while his wife / Between her legs is the main road.'\"\nI said: \"This is from the saying of Al-Farazdaq:\n'And you left your wife, O Jarir, as if she is / For the people, kneeling, a paved road.'\"\nJarir said replying to him in it:\n'And the perineum of Ji'thin is like the paved road.'\nIn this poem he says:\n'He looks at you with chastity while he has / That the Magians are correct in what they judge.'\nThis is from the saying of Abu Tammam:\n'My father is ransom for one whom if her father saw her / Approaching, he would say: I wish I were a Magian.'\nHe said: \"There is no sin on me in a verse that deviates from the path of excellence, and wording that escapes the trap of clarity.\"\n\nI said: \"Tell me about your saying:\n'I wore out, the wearing out of ruins, if I did not stand at them / The standing of a miser whose ring was lost in the dirt.'\nHow did you say it, 'Shahih' (miser) or 'Shajij' (wounded)?\"\nHe said: \"I said it with Ha (miser) only. This is a meaning I invented.\"\n[I said]: \"You only attracted it from the saying of Himyan bin Quhafa:\n'So they are bewildered like the misplacers of the ring.'\nSo between the two words is a far distance. You have been desolate in your saying:\n'I wore out, the wearing out of ruins, if I did not stand at them.'\nAnd you did badly in the expression of what you took, so you completed the verse with it. Look at the saying of Abu Nuwas in the meaning of Himyan's verse, how wonderful it is, how good his method, how eloquent and clear when he says:\n'My weeping has been long at the trace of the dwellings / And my repetition in them and my suffering have been long.\nAs if I am seeking in the dwellings a game / I see it in front of me once and behind me.'\"\n\nI said: \"You have repeated the meaning of your saying 'I wore out, the wearing out of ruins', so you said, except that it did not come concise like your conciseness previously:\n'Every thunderous rain ceased not to dissolve them / And sickness dissolves me until they resembled my body.'\nYou intended in this verse the best verse and most noble expression, so you returned it in his expression in an attracted expression, and words not sweet. Muhammad bin Wahib said:\n'Two ruins, eternity has been long upon them / They were effaced, so there is no sign nor goal.\nThey wore wear-and-tear, as if they found / After the loved ones the like of what I find.'\nIf there were nothing in these two verses of the beauties of wording except his saying 'They wore wear-and-tear', it is a fitting, sweet metaphor. If a sayer wished to say it is in this place better situated than with it in the saying of Al-Ja'di:\n'I wore people so I annihilated them / And I annihilated after people, people.'\nOr from the saying of the other:\n'The bedfellow did not turn her to him / She collapsed on him so she was a clothing.'\nAlthough some Arabs have said, and fulfilled every speech:\n'Do you not see that the wind between Muwaysil / And Jawa, if it blows on you, becomes sweet?'\nAnd the other did well, all wellness, by his saying:\n'To whom belongs a ruin I stood at, hindering / Asking its worn-out, distant quarter?\nTo Salma, no change to the quarter of Salma / And she clothed the thunderers and the lightnings.'\nAnd the saying of Muhammad bin Wahib:\n'They wore wear-and-tear as if they found'\nis taken from the saying of Mu'alla Al-Tai:\n'They wore wear-and-tear until as if their traces / Tasted passion or tasted the abandonment of loved ones.'\nFrom this Al-Buhturi took his saying:\n'Between Al-Shaqiqa and Al-Liwa and Al-Ajra' / Traces held back against the winds of the four (directions).\nAs if their dwellings contained what / The entrails of the pained lover contained.'\n\nAnd like your badness in taking these two verses in your saying:\n'And how many a youth, critically ill, belongs to passion / And how many a killed martyr belongs to distance.'\nFor you stole the second hemistich of this verse with the most obscene theft from Jamil, and from the beauties of his saying:\n'For every conversation among them is cheerfulness / And every killed one among them is a martyr.'\nI did not think a possessor of thought would permit violating the sanctity of this verse, and come to these moist, sweet words and transform them into that trivial wording and crumbling composition.\n\nAnd of his exchanging the good deed with the bad is his saying:\n'He cheered up before my greeting to him / And threw his money before the pillow.'\nWere it not for his permissiveness in taking these meanings in which their owners preceded, and were first to invent, his tongue would have been flawed as the tongue of the fondled weaned camel is flawed. What does he do with his saying:\n'He cheered up before my greeting to him'\nwith the saying of Zuhair:",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 19
  },
  {
    "serial_number": "6720986",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "'You see him when you come to him cheering up / As if you are giving him what you are asking him.'\nA poet took his saying 'As if you are giving him what you are asking him' and said regarding Al-Sari bin Abdullah:\n'As if he who comes to Al-Sari with a need / Made his camel kneel to him with what he came to ask.'\nAl-Kumait took it and said:\n'As if I came to him giving him glad tidings / And did not come desiring and attracting.'\nAnd with the saying of some Arabs:\n'When the askers come to him, there kindle / Upon him the lamps of cheerfulness and joy.\nHe has for those with needs a favor as if it is / The falling places of cloud water in the barren land.'\n\nAnd of what he stole and did not increase upon but repeating its wording in a different meter from the stolen verse is his saying:\n'For the wound bleeds after a while / If the building is upon corruption.'\nFor you took it in wording and meaning from the saying of Al-Buhturi:\n'If the wound is mended upon corruption / The negligence of the doctor appears in it.'\n\nAnd of this type is your saying:\n'So she went, and modesty had dyed her whiteness / My color, just as gold dyes silver.'\nSo what do you do with this alongside the saying of Dhu al-Rumma:\n'Wide-eyed in whiteness, yellow in whiteness / As if she is silver touched by gold.'\nFrom this ember Bashar borrowed his saying:\n'He insisted on me in play / A possessor of rest from fatigue.\nA body of silver that has / Imbibed gold.'\nFrom here Abu al-Shis transferred his saying describing wine:\n'As if its cups are silver / That has been lined with red gold.'\n\nAnd of your falling short in taking is your saying:\n'Not by my people was I honored, but they were honored by me / And by myself I boasted, not by my ancestors.'\nFor you took it from the saying of the first:\n'The soul of Isam ennobled Isam / And taught him attacking and advancing.\nAnd made him a hero king.'\nWhat do you do with your saying and the saying of others in this meaning alongside the saying of Amir bin Al-Tufayl:\n'Amir did not make me a master by inheritance / God refused that I rise by mother or father.\nBut I protect its sanctuary and prevent / Its harm, and throw who threw it with a troop.'\n\nAnd of your falling short in what you stole is your saying:\n'They departed with a tender girl having a buttock / That almost, at standing, makes her sit.'\nFor you took it with the saying of the moderns:\n'She walks and her buttocks make her sit / So as if she is walking backwards.'\nThis is the excuse (falling short). Do you not see that you did not fulfill the meaning because you only took the first half of this verse and left his saying: 'So as if she is walking backwards.'\n\nAnd of the severe falling short is your saying:\n'Are the watchers safe from your visiting in the darkness / Since where you were, from the darkness is light?'\nThis is of severe affectation, far from sound wording. Then you said:\n'Anxiety of the beautiful woman, while she is musk, is her tearing (exposing) / And her marching at night, while she is the sun.'\nIn your saying 'hatkuha' (her tearing) is tearing of the sanctity of her love. You stole the first verse from the saying of the poet:\n'She smiled so the darkness cleared and she did not / Hide, and she was before hiding it.'\nAnd from the saying of the other:\n'A moon, his beauty told on him / How can the night hide a rising full moon?'\nYou took the second verse from the saying of Bashar:\n'My hope, do not come in moonlight / For a hadith, confident of the armor.\nAnd beware perfume this night of yours / It is a slanderer (informant) if it spreads.'\nBashar took the first verse from the saying of Omar bin Abi Rabi'a:\n'She said: You spoke truth, but in moonlight / Did you not see until you came the armor?'\n\nThen I said to him: \"And another from your saying:\n'He sought the emirate in the frontiers while his upbringing / Was between Karkhaya and Kalwadha.'\nFrom where did you get this dialect in 'Kalwadha'? I do not think you took it except from the sailors.\"\nHe said: \"How?\"\nI said: \"You erred in it an error in which you stumbled, straying from the face of correctness.\"\nHe said: \"Why?\"\nI said: \"Because the correct form is 'Kalwadh' with a Kasra on the Kaf and sukun and dropping the Ya.\"\nHe said: \"What is Al-Kalwadh?\"\nI said: \"The Ark of the Torah, the city was named after it.\"\nHe said: \"What is the proof of this?\"\nI said: \"The Rajaz poet:\n'As if the sounds of the saddle... / The writing of scrolls on Kalwadh.'\nAl-Kalwadh: The Ark of the Torah of Moses. It was narrated in some accounts that he was buried in this place, so because of it, it was named Kalwadh.\"\nHe lowered his head, not returning an answer, then said: \"Knowledge of this did not reach me before, and your saying is accepted and the benefit is not denied.\"\n\nI said: \"And you erred in your saying:",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 20
  },
  {
    "serial_number": "6720987",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "'A hand reached you, equal with it are / The grey hawk (Al-Baziy) and the piebald crow.'\nFor you emphasized (shaddada) the Ya in 'Al-Bazi', which has no basis, and you connected the cutting Hamza in 'Al-Ashhab'. I do not know anyone of the eloquent who emphasized the Ya in 'Al-Bazi' except Al-Buhturi, and upon him you relied, and on the wording of his verse you leaned in his saying:\n'And the whiteness of the hawk (Al-Baziy) is better in color / If you contemplate, than the blackness of the crow.'\nThis has been refuted against Al-Buhturi and he was faulted for his emphasizing the Ya. What is heard in that are two dialects: One is Baz and Buzah, just as you say Qadin and Qudah, and Ramin and Rumah. Imru' al-Qais said:\n'On a hawk (Bazin) in the sky, soaring.'\nThe second dialect is 'Baz' with Hamza and 'Ab'uz', just as you say Kalb and Aklub, and it collects as Bi'zan; that came in eloquent poetry.\n\nHe said: \"I did not say it like that, but I said 'Al-Bazi l-Ashhab' (The hawk, the grey) with a sukun.\"\nI said: \"You cut the connecting Hamza in 'Al-Bazi l-Ashhab' (making it Al-Bazi Al-Ashhab) and connected a cutting Hamza, so you combined two necessities in one verse.\"\nHe said: \"The like of that has come in poetry.\"\n[I said]: \"It only came as an oddity and is not permissible for a modern.\"\nHe said: \"Al-Tirimmah said:\n'O long night, will you not clear (ala asbih)' so he connected.\"\nI said: \"Al-Tirimmah is a villager, and the correct narration is:\n'O night which was long, become morning / With smiling, and the morning in you is not more comfortable.'\n\nI said: \"You also erred in your saying:\n'And that you were yesterday dreaming / The Sheikh of Ma'add while you are its beardless one.'\nFor you treated the hidden pronoun in your saying 'Annk' (That you) the same way as with the apparent, and there is severe ugliness in it. 'Annk' meaning 'Annaka' is only good with the apparent, like the saying of the poet:\n'And a day she comes to us with a divided face / As if [she is] a doe reaching for the leafy Salam tree.'\nAnd the saying of the other:\n'And a chest shining of throat / As if its breasts are two boxes.'\nHe said: \"The other said:\n'So know that you (Annk) in the day of ease asked me / For your separation; I did not clear while you were a friend.'\nI said to him: \"This is permissible upon necessity, and the face of its permissibility is very weak. Analogy does not carry oddities and necessities. Although you looked at the saying of Abu Tammam:\n'And that you, if you dressed him in might, bestowing / And clothed him in that majesty, favoring.'\n\nThen I said: \"You also erred in your saying:\n'His noble deeds defeated all noble deeds / Until it was as if noble deeds were tribes.'\n'And they killed Dafr and Al-Duhaym, so you do not see / The Mother of Al-Duhaym and the Mother of Dafr bereaving.'\nHe said: \"What is the face of the error?\"\nI said: \"What did you intend by your saying 'And they killed Dafr and Al-Duhaym'?\"\nHe said: \"They are names of the Calamity, and the World may be called Dafr.\"\nI said: \"This is an error regarding Al-Dafr; no one said it, nor did a narrator narrate it, nor did a claimant claim it of the Arabs. As for Al-Dafr, it is the stench; and the report about Umar, God have mercy on him, is 'Wa Dafrah' (Oh stench). The Arabs nickname the World 'Umm Dafr' (Mother of Stench) because of the dunghills in it. And it is said: I pushed him a push (Dafartuhu dafran) if I pushed his chest. And they said to the slave girl 'Ya Dafar' due to her stench. And it is said: 'Dafran Dafran' to what so-and-so brings, if he made the matter ugly or stinking. The author of Kitab al-Ain said: Al-Dafr is the falling of worms into food and meat, and the World is Dafrah, i.e., stinking. Similar to this Ibn Duraid mentioned in Al-Jamhara. This is the saying of the people of knowledge and the repository of language books, and no one is known to have claimed that the Calamity is called Dafr, nor that the World is called Dafr.\n\nAs for Al-Duhaym, it is one of the names of the Calamity; the origin of that is that a she-camel belonging to some kings was called Al-Duhaym. He killed a people and sent their heads on her in a sack. When she came, they said: She has ostrich eggs on her. The messenger said: Look at what the eggs hatch. When he looked at the heads of his children, he said:\n'And at Al-Duhaym, if her rope were untied / And she ascended, she would not lack a driver from the Jinn.'\nHe means that the Jinn help in doing the hateful deed. Then their pessimism with this name increased until they made the Calamity 'Duhaym'.\"\n\nHe said: \"If the World is nicknamed Umm Dafr, it is also named Dafr because of their nicknaming of these things.\"\nI said: \"The matter is contrary to what you imagined. If the matter were so, the World would be named Shamlah, because they nicknamed it Umm Shamlah. Muhammad bin al-Hasan bin Miqsam recited to us, saying: Ahmad bin Yahya recited to us, [from] Ibn al-A'rabi:\n'From Umm Shamlah, her calamities shoot us / Deceptive, from which terrors are seen.'\nAnd wine would be named Khall (Vinegar), because they nicknamed it Umm al-Khall as the poet said:\n'I threw Umm al-Khall (Wine) with the love of his heart / So he did not recover from it for three nights.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 21
  },
  {
    "serial_number": "6720988",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "And no one of the scholars, by whose light one is illuminated and whose fresh water is approached, claimed that. And this world would be named Hubayn, because of their nicknaming it Umm Hubayn. And the fever would be named Mildam [because they nicknamed] it Umm Mildam. So your saying: 'Umm al-Duhaym and Umm Dafr are bereaving' has no consistency in its meaning. The outcome of the meaning in your verse is that the Mother of Stench and the Mother of Calamity are bereaving (lost a child). This is of the detested meanings that disgrace their speaker, degrade his worth, and brand his poetry with the brand of deficiency, because it combined corruption of meaning and error in language.\n\nIn this poem you say:\n'If the birth of every living thing were good like him / Women would give birth while having no midwives.'\nI do not see you intended anything but that they expand until the woman does not feel, at her labor, the exit of the fetus from her. Otherwise, what is the face of dropping her need for the midwife at her birth? Did you not hear the saying of the first:\n'A mother carried him, blessing him / As if she did not know of the pregnancy.\nA bright, masculine one carried him / Radiant, daughter of the bright noble women.'\nSo you brought what a possessor of sound strength and sharp mind does not bring. How beautiful is what Al-Karous bin Zaid al-Tai said:\n'If Ma'qil rejoiced at me in my hardship / The midwives surely rejoiced at me at their hands.\nHe raised his voice with him when he raised his voice / Beautiful faces, soft of fingertips.\nWhen he was clothed in sword-belts and leaned / Attacking with the tips of withered spears.\nThe enemies realized that his spearhead / Prolongs the whining, the whining of bereaving mothers.'\nThis saying enraged him and changed his color, and he sought rest in the saying of a fool, deficient in mind, who was in his presence: \"Glory be to God, how wonderful is the beginning of this poem:\n'You have, O dwellings, dwellings in the hearts / You became desolate while they are populated with you.'\nHe did not complete the verse before I said to him: More wonderful than it—may God wake your slumber—is that he stole this from it, which is the saying of Abu Tammam:\n'I stood while my entrails were a dwelling for grief / In it, while it is a desert whose dwellings are effaced.'\nAbu Tammam followed in this saying Dhi'b al-Khuza'i:\n'Is there anyone for an eye that ceases not to be sleepless / And O who is for a heart that ceases not to be hunted?\nPassion shot him until when it pierced his heart / It repeated in his entrails and scattered.\nMy heart built for me a dwelling in his heart / And the eye gave you a seat from its pupil.'\nQais bin Mu'adh pointed to this by his saying:\n'She traveled in the black of the heart until when / The journey ended with her and she sought the sanctuary of the heart, she settled.\nSo the eye has pouring if the heart gets bored of her / And the heart has whispers if the eye gets bored.\nBy God, there is nothing in the heart of love / For another besides her, whether she did much or little.'\nAnd here is Abu Uthman al-Najim saying, despite the lateness of his time:\n'If the distance of his dwellings saddened me regarding him / And my paths narrowed against me in his love.\nI turned to a person of his, not distant / His dwellings are between the entrails and the chest bones.'\n\nI said: \"And you erred in your saying:\n'A king whose days boasted (zahat) of his place / Until they boasted of him over the days.'\nIt was correct to say: 'Zuhiyat' (Passive: were made proud) by his place. Do you think that with your virtue and extensive literature, you did not study the book 'Al-Fasih' and what it contains of his saying: 'You have been proud (Zuhiyat) against us, O man, and you are proud (Mazhu). Likewise it is said: The man was proud (Zuhiya) and the woman was proud (Zuhiyat), just as it is said the man bragged (Nukhiya) and the woman bragged from Nakhwa (pride), so they are Mankhuwan. Aisha, may God be pleased with her, said: \"Jewelry is borrowed for brides, and so-and-so is too proud (Tuzha) to wear it.\" And 'Zaha' is not said except for plants when they yellow and their color (Zahw) appears, i.e., their yellowness. The Messenger of God, peace and blessings be upon him and his family, forbade selling dates until they color (Yazhu). Some of our companions say until they color (Yuzhi) from Azha. And it was mentioned that 'Yazhu' is an error. And Al-Zahw is the unripe date when it colors. It is said: The unripe date colored (Azha), and Izha', they claimed, in the unripe date is that it yellows and reddens. Al-Asma'i says until the unripe date colors (Yuzha), with a Fatha on the Ha, and refuses anything else. The yellow unripe date. And Al-Zahw is lying; he recited:\n'With Ibn Imran is a lie (Zahw) without wet dates / And with him are wet dates on the palm tree, forbidden.'\nHe says with him is a lie, not unripe dates. And the other said:\n'And do not speak a lie (Zahwan) regarding what you tell us / Gray hair has not left for me a lie (Zahwan) nor blindness.'\nAl-Zahw is also: The beautiful appearance; and Al-Zahw is pride. The poet said:\n'Whenever I wish, other than the pride of kings / I make you a group at a water pond.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 22
  },
  {
    "serial_number": "6720989",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "Al-Zahw is also that the camels drink then extend in seeking pasture and do not graze around the water. It is said: The camels extended (Zahat al-ibil zahwan). And the wind shakes (Tazhi) the plant if it moves it. And the mirage lifts (Yazhi) the company as if raising it, and waves lift (Tazhi) the ship.\n\nI said: \"And you also erred in your saying:\n'And the earth narrowed until their escapee became / If he saw other than a thing, he thought it a man.'\nDo you know a visible object that sight perceives to which the name 'thing' does not apply? I think you looked in it to the saying of Jarir:\n'You ceased not to think every thing after them / Horses attacking you and men.'\nSo you shifted the meaning from its direction, and expressed it with other than its expression. Jarir's saying is of the pleasant imagery. Al-Akhtal claimed he took it from the saying of God Almighty: 'They think every shout is against them', and it is fitting that he took it from the saying of Al-Awwam bin Shawdhab Al-Shaybani:\n'If it were a sparrow, you would have thought it / A marked (horse) calling Ubayd and Aznam.'\nAnd of the pleasant imagery is the saying of the other regarding the imagination of the drunkard:\n'I ceased not drinking wine until I thought myself / A prince over whom I wished to be prince.\nUntil I thought the night and the approaching morning / Two horses strutting, a black and a blond.'\nAnd of what is appreciated in this meaning is the saying of Thabit Qutna:\n'I became intoxicated until I imagined my mount / Had seven ears that grew on it after me.\nUntil I thought the land a sea and imagined myself / Hanging the bright stars at the edges of my cloak.'\nMy father recited to me, saying: Abu Umar bin Sa'd al-Qutrubulli the scribe recited to me, saying: Tha'lab recited to me for Tuhaym al-Asadi, and this is attributed to Ibn al-A'rabi:\n'And one extending over the reddish wine, he came early to it / Among youths skilled in the morning drink.\nEvery creature he saw, he thought it a cup / And every person he saw, he imagined him the cupbearer.\nUntil he sipped it, he did not linger and it did not cease / To leave him prostrate, having no charmer (healer).'\n\nThen I said: \"And you erred in your saying addressing Kafur al-Ikhshidi:\n'He exposes the sun whenever the sun rises / With an illuminating black sun.'\nHow is the sun, whose dye is whiteness and light, described with blackness? And what is the face of borrowing the sun for the black, if you went in that to metaphor?\"\nHe said: \"I only went to the saying of Al-Nabigha:\n'For you are a sun and the kings are stars / If it rises, no star appears from them.'\"\nI said to him: \"He only went in this to the fact that he, in his glory and sovereignty and by adding kings to him, is like the sun covering the stars at its rising. You only intended that this praised one, in his descriptions, exposes the rising sun, and he is with that a black sun, and the sun is not black except in the state of its eclipse. You only went in this to the blackness of his skin, and you blamed him in the apparent speech by your saying 'black' a blame; with it, the praise returned as satire. There is no difference in my view between your saying this in his praise, and your saying in the other word in his blame:\n'Indeed a man whom a pregnant woman manages / Is oppressed, hot of eye, stricken in heart.'\n\nI said: \"And you erred in his saying opening a poem you praised this man with; for you said:\n'Enough as a disease for you that you see death as a cure / And sufficient for deaths that they be wishes.'\nFor you opened his praise with what elegies are opened with, and you reckoned him to be the food of deaths shortly by confronting him with them. It is the way of the poet to investigate for his poem the best beginning, just as he investigates for it the best ending upon reaching his need, and to make the opening of his speech the best he can in wording and meaning. And to begin his poem with what suits the meaning he intended. For Abu Nuwas, if he were blaming with his saying:\n'O Quarter of Decay, indeed humbleness is apparent / Upon you, and indeed I did not deny you my affection.'\nOr finding slow, his beginning would not have been disapproved. But Al-Barmaki flew into a rage from him upon his reciting this poetry to him, for he took it as an evil omen. When he reached his saying:\n'Peace be upon the world if you are lost / O sons of Barmak, from goers and comers.'\nHis evil omen was confirmed, and days did not pass until Al-Rashid fell upon the Barmakids.\nLikewise Al-Buhturi, if he were satirizing with his saying:\n'Woe to you from a night whose end was long / And the nearing of the departure of a tribe whose camels are bridled.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 23
  },
  {
    "serial_number": "6720990",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "He would have been doing well; because every class of speech decrees a type of beginning and a form of opening not suitable for another. Abu Sa'id said when he recited to him: \"Woe to you from a night\", rather woe and war to you. So the praising seeker of favor should open his poetry with what is indicative of his purpose and pointing to his desire. And not to mix it with what is taken as a bad omen and is deemed rough in his speech: like the obituary of youth, the separation of loved ones, the blaming of time, the cutting off of peers, and the mention of desolate ruins and effaced, decaying traces. It has been said that Al-Aswad bin Al-Mundhir, when Al-A'sha recited to him:\n'What is the crying of the old man at the ruins / And my asking, so what does my asking return?'\nHe blamed this opening and hated it. It reached us about the Caliphs of Banu Marwan that one asked Dhu al-Rumma to recite something, so he recited:\n'What is the matter with your eye, the water pours from it?'\nSo he rejected him and silenced him. Al-Ja'di recited to some kings his poem in which he says:\n'I wore people so I annihilated them / And I annihilated after people, people.'\nHe said: That is due to the excess of your bad luck. Abu Dulaf bin Isa asked Rashid bin Ishaq the Scribe to recite some of what he lamented his goods with, so he recited:\n'Alas, the penis you used to know has gone.'\nSo Abu Dulaf lowered his eyes and said: Rather your mother used to know it. When Al-Akhtal recited to Abdul Malik:\n'The residents lightened (left), so they departed from you or went early.'\nHe said: Rather from you, taking it as a bad omen. This was the case of Jarir with him when he recited:\n'Are you waking up? But your heart is not waking.'\nFor he replied to him and said: Rather your heart.\n\nThen I said: \"And you erred in your saying:\n'Is it not strange that your description is miraculous / And that my thoughts limp (Tazla') in your high qualities?'\nSo you borrowed 'limping' for your thoughts, and it is an ugly metaphor, and you wondered at what is not to be wondered at, because he whose description is miraculous, the falling short of thoughts and their confusion in his high qualities is not denied. You only transferred it from the saying of Abu Tammam and corrupted it:\n'His wishes ascended a mountain of might; if the wind / Ascended with it a span, it would return limping.'\nMakhlad said describing a desert:\n'Heavenly, the wind asks its generosity to descend / And the wind limps in it in the clear paths.'\nHe said: \"I only ran on the custom of the Arabs in metaphor.\"\nI said: \"Yes, except that it is a reprehensible, anxious metaphor that settled in other than its place, and fell in other than its location. Metaphor, if its position in clarity is not above the position of reality (literal meaning), is not a subtle metaphor. The reality of metaphor is that it is the transfer of a word from a thing it was made for, to a thing it was not made for. It is of three types, do you know them?\"\nHe said: \"What do I have to do with this?\"\nI said: \"Then I mention them by necessity, to show that you are isolated from excellence in your saying:\n'For my thoughts limp in your high qualities.'\nThe first of them: The Approved Metaphor, which is that whose position in clarity is above the position of reality, like the saying of God Almighty 'Indeed, when the water tyranized (Tagha - rose high)'. The reality of Tagha is 'Ala' (rose). When He, the Almighty, said Tagha, He made it an excessive rise, so this metaphor had a share in clarity that reality did not have. And of the approved metaphors is the saying of Al-A'sha:\n'And I robbed the buxom girl / The beautiful, the beauty of her youth.'\nHe means I enjoyed her until I exhausted her youth. Aws bin Hajar said:\n'You see the earth from us in the space sick / Burdened from us by a huge army.'\nHis borrowing sickness for the earth is an exaggeration in describing the large number of their count and the impact of their horses' hooves. As if the earth carried a weight from them it could not rise with, so that earned it a sickness. The reality of sickness is decrease, so as if the capacity of the earth failed, and its powers fell short and decreased from independence with what they burdened it. The poet said:\n'And a night that was sick from every side / Neither sun nor moon lights up in it.'\nHe means by his saying 'sick' the decrease of its light. And of the subtle metaphors is the saying of the other:\n'They arrived for a midday rest while the pebbles were ignited / And the saliva of the sun melted over the skulls.'\nHe borrowed 'ignition' for the pebbles, informing of the burning of the heat. And he borrowed 'saliva' for the sun informing of the intensity of the heat. And from here you took your saying:\n'And for the sun upon the working camels is saliva.'\nAnd the saying of the other:\n'I saw the virtue of the Qurashi when / I saw the horses saddled with spears.'\nHe borrowed 'saddled' (Tusraj - implies lit/saddled) for spears, i.e., kindled, informing of their spreading and interlacing, and the intensity of stabbing and its heat, as if they are flaming due to their collision and interlacing as Imru' al-Qais said:\n'If they ride horses and put on armor / They burn (with zeal/heat), while the day is cold.'\n\nThe Second Type: And it is the Reprehensible Metaphor; and it was only named reprehensible because they borrowed for what reasons, names and words of what does not reason, like the saying of Al-Hutay'ah:",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 24
  },
  {
    "serial_number": "6720991",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "'The children did not cease until I saw him / On the young camel with a leg and a hoof.'\nThis poet only described a man who was hosted and honored, so he said: The maids and children did not cease to honor him until I saw him having ridden his mount and departed thankful from them. The meaning is in the utmost beauty, except that he said at the end of the verse 'He passes it with a leg and a hoof', so it became ugly when he borrowed for the man the place of his foot 'a hoof'. From this is the saying of Al-Hutay'ah also:\n'They hosted your neighbor, the craving one, when you shunned him / And his lips (Mashafir - camel lips) shrank from the cold of the drink.'\nSo he made a 'Mashfar' (camel lip) for him in place of the lip. From it is the saying of the other:\n'I will prevent her or I will place her affair / To a king whose hooves (Azlaf - cloven hooves) have not split.'\nSo he made a 'Zilf' (cloven hoof) for the king in place of the nail, and it did not satisfy him until he said: 'Have not split'.\n\nThe Third Type: Of metaphor is better than the second because they borrowed for what does not reason a name for what reasons, like the saying of Hamid bin Thaur Al-Hilali:\n'I wondered at her, how is her singing / Eloquent while she did not open a mouth with her logic.'\nThis poet described a pigeon and wanted to say 'did not open a beak', so he said 'did not open a mouth', so it was good. If a human said 'did not open a beak', it would be ugly and bad in wording. Although Al-Asma'i mentioned that 'Fam' (mouth) is used for all animals. The Rajaz poet said describing a horse:\n'And a pouring runner... / How the surface of the ground kissed his foot.'\nSo he made a 'foot' for him in place of his hoof, so it was better than the saying of the other in place of the man's foot 'his hoof'.\n\nI said: \"And the metaphor you used contradicts these three divisions, because suspicion (Dhann) does not have a real action for which you borrowed limping (Dhal') in its place. It is only said: Distant suspicion, false suspicion, Alma'i (brilliant) suspicion, and correct suspicion. These are all appropriate metaphors. It was not heard from an eloquent poet nor a pure Arab: Limping suspicion. Borrowing limping for the wind, even if distant, is more appropriate and closer, because it is said: Weary (Hasra) wind, and sick wind, meaning its fatigue and the decrease of its blowing. So it was permissible to place limping in place of fatigue, because it is of the genus of the shortcoming of blowing. Likewise, limping in the wind is placed other than its place, and it is only said in this meaning 'Weary wind'; and weary is not in reality, it is only cited as a metaphor. And the position of 'weary' in clarity is better than the position of 'limping'. So you exchanged an appropriate, subtle metaphor from their saying: Distant suspicion, false suspicion, brilliant and correct suspicion, with a hidden, distant metaphor from your saying: 'In your high qualities limp'. And the case of the foot, hoof, mouth, and beak benefits the case, because they are borrowed names placed in the places of real names.\"\n\nAnd of the distant metaphor is your saying:\n'Lion of lions, the thick-necked, his dye / Is death; the shoulder muscles (Farisa) of death tremble from him.'\nYou made 'Fara'is' (shoulder muscles) for death, and it is the plural of 'Farisa', and the face is to pluralize 'Farisa' as 'Fara'is'. The 'Farisa' is a piece of flesh under the shoulder said to be a killing spot. It is a very distant metaphor.\n\nHe strayed from the answer, and the key to this door was obscure to him, and he heard what his happiness did not run with hearing the like of, because the valley he walks in his poetry is different from it. When he affects this track, and deals with craft in his poetry, and does not perfect his excellence in it, he runs in it on his first shape. Do you not see his saying:\n'And many a sleeve (Kumm) the Lord kissed before him / And every brave one (Kami) standing, shrinking.'\nSo he made a pun with 'Qabl' and 'Qublah' and 'Kumm' and 'Kami', so his wording was not pure, nor did his nature aid him in excellence, and his material was cut off before correctness.\n\nThen I said to him: \"And you erred in your saying:\n'Armor (La'mah) overflowing (Fada), wide (Ada), smooth / The two hands of David perfected its weaving.'\nBecause it is not said 'Fada' armor, it is only said: 'Mufada', and its plural is 'Mufad'. Armor is also called 'Fadfada' and 'Fadafida' if it is wide. Imru' al-Qais said, and some of our companions narrate it for Abu Duwad:\n'And I prepared for war a wide one (Fadfada) / Shrinking in folding like the file.'\nIf you derived 'Fada' from the saying of Imru' al-Qais:\n'Her sleeves overflow (Tafidu) on the person / Like the overflow of the flood on the cricket.'\nThe face is to say 'Fa'ida' not 'Fada'. This word did not come in pure Arabic poetry, nor in eloquent generated speech. We have not heard of 'Fada' except from this verse of yours, and from the verse of Abu al-Shis:\n'And dwellings for the peer he thinks overflowing (Fada) / The blood hung on his wide (Fadfad) dress.'\nAbu al-Shis is using of this word what has no origin, and is not permissible in language. He only intended the pun so he dropped this dropping.\n\nThen I said: \"And you also erred in your saying:\n'If I attain what I hoped from you, then perhaps / I drank of water whose watering place makes birds incapable.'\"",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 25
  },
  {
    "serial_number": "6720992",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "He said: \"And what is the face of the error?\" I said: \"You made him a miser from whom nothing is reached. And you likened yourself in your reaching what you reached from him to your drinking from water whose watering place makes birds incapable, due to the distance of its drinking place and the vastness of its demand.\"\n\n\"And you erred in your saying, misleading:\n'So they passed every saffron-dyed one / And given to drink the milk of the Sha'il.'\nThe 'Sha'il': It is the one whose milk has risen (Shaala) from the she-camels, rose. And the plural of Sha'il is 'Shul', and they are the she-camels with little milk. It is said 'Shawwalat': If her milk became little. So how did you single her out with the milk of the Sha'il despite its scarcity and height? It was more appropriate that you make her abundant, not possessing little milk, as Mutayr bin Al-Ashyam said, and he was a describer of horses:\n'I reserved for her four distinct (camels) / And made her hoof write that it would seek.\nAnd I said to their caretaker: Quench her / Loudly and do not do badly by increasing.'\nHe was not pleased to limit her to one until he mentioned four for her feeding. And you, when you limited her to one, you made her a Sha'il.\"\nHe said: \"I only intended that she be preferred with milk, despite its scarcity and height, over the dependents due to her nobility and generosity.\"\nI said: \"And you, if you intended that and went to it, you inform of the hardship, severity, and interruption of milk. This is falling short regarding the mare despite preferring her, and invalidating her feeding and disturbing her strength. Mutayr is more praiseworthy than him and more indicative of good feeding. It is said a she-camel 'Sha'ila' and 'Sha'il' also, and its plural is 'Shul', and 'Sha'ila' for the one who raised her tail, to be known that she is pregnant, and its plural is 'Shul'. Abu al-Najm said:\n'As if in the tails of the Shul / From the dung of summer are the horns of the mountain goat.'\"\n\nThen I said: \"And you erred in the poem which begins:\n'Every claimant of sound mind claims you.'\nBy saying:\n'The passing thoughts twist between us / And mention the approach of the Prince, so it becomes sweet to me (Tahlu li).'\nFor you brought a verse with a Ridf (letter of prolongation before the rhyme letter) in a poem without Ridf, and this is odd (Shadh).\"\nHe said: \"This, even if it is odd as you mentioned, is sweet on the tongue, not anxious in recitation. The like of it has come for the Arabs:\n'And by roaming, the youth attained the best of what he attained / And man is nothing but by turning and roaming (Tawf).'\nThen he said:\n'Separation of a beloved and ending of passion / So do not blame me, what I hide has appeared to you.'\"\n\nI said: \"By my life, a people with no knowledge see this as odd, and do not see the Waw preceded by Fatha nor the Ya as odd Ridf. They claim they are not letters of prolongation (Madd), because the sound does not extend with them like its extension with Ya and Waw preceded by Kasra and Damma. That is a mistake from its sayer, since the Fatha before them opened them from their genus, since their exit in both cases is from one place in the mouth. So their form in pronunciation is one, but the Fatha moves them slightly, so the sound does not extend with it the full extension, but it extends an extension by which they deserve to be called letters of prolongation. So if a verse comes for the Arabs containing Ridf with what has no Ridf together, and it is counted as odd—just as they have Iqwa, Ikfa, and Ita (defects of rhyme)—then it is not for a modern poet to commit the like of that, nor permit in his rhymes any defects, even if they exist in their poems by way of oddities. Do you not see the saying of Ibn Bayd addressing Khalid al-Qasri who had imprisoned him:\n'Pale, inner like the chest of a Yemeni (sword) / Sharp of impact, wrapped in other than a scabbard.\nAnd when complete, it returned as a sharp nerves / And the edge of the whetstone polished its two blades.\nIt was not a crime that caught me / From my left nor did my right commit it.\nBut a noble brother and friend committed it / And upon its people Baraqish (a dog) committed a crime (Tajni).'\nIs it permissible for a modern to come with the like of this and use it or its like as proof? No.\"\n\nHe said: \"You have spoken much about what I do not count any of. I only run on my nature, and say what my tongue permits.\"\n\nAnd of what is held against him in rhyming is his saying:\n'I am, with the slanderers if I mentioned you, more resembling / Dew comes and is spread about you, so you hate it.'\n'And if I saw you without an army, intervening / I was certain that God seeks victory.'\nWhat is the rhyme letter (Rawi) in these two verses?\nHe said: \"The Ha.\"\nI said to him: \"If you made the Ha the rhyme letter, that is not permissible. Because the Ha of the pronoun cannot be a Rawi, except if what is before it is silent (Sukun), like the saying of Tarfa:\n'O gazelle whose two earrings flash.\nWere it not for the sitting king / His mouth would have kissed me.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 26
  },
  {
    "serial_number": "6720993",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "If you made the Ra the rhyme letter and the Ha a connection (Sillah), which is the [correct] face, then what do you do with your saying: 'If I mentioned you, I resemble (Ashbahu)'? Unless you go to the idea that he did not rhyme the hemistichs (Tasri').\"\n\nHe turned to me and said: \"Be fair, for fairness is of your traits. And look closely, the looking of your like, whose foot has advanced in knowledge and to whose position is pointed. Do not give authority to passion over opinion. Who is he whose beginnings were consistent and whose ends and fronts of poetry were similar? And who is he who is innocent of defect? And evil is he who follows a composer or a prose writer, whether of poetry or another. I am not an innovation among them. If you were fair to yourself, and threw the cloak of zeal off your shoulder, you would find yourself, in all that you listed of my lapses and announced of my verses, refuted. Because he who does well in much, his badness in the little easy is forgiven.\n\nThis is Imru' al-Qais, and he is the Imam of poets, and the one surpassing them with the sleeves of meanings, and the owner of the rod and precedence to every refined word, invented meaning, and innovative simile. He has done well in places, was mediocre in places, and did badly in a state just as he did well in a state. Is he not the one saying in his B-rhyme poem:\n'Do you not see that whenever I came as a night visitor / I found in her a scent even if she did not perfume herself?'\nMeasure this against his saying describing this woman:\n'The chief of peers to her, not blameworthy / Nor possessor of a creation (body) if you contemplated, side.'\nHe is the one saying in it describing a horse:\n'When we rode, the children of our family said / Come, until the game comes, let us gather firewood.'\nThis is the utmost description in confidence of the horse's precedence and his catching what he seeks. Measure this against his saying describing this horse:\n'For scolding is a blaze, and for the leg is a flow of milk / And for the whip from him is the fall of a polished variegated (skin).'\nHe is the one who says in the L-rhyme poem describing an eagle:\n'It hunts the rabbits of Al-An'am in the forenoon / And foxes or Ural (goats/sheep) have gathered from it.'\nThen he said following it:\n'As if the hearts of birds, wet and dry / At her nest, are jujube and worn-out dates.'\nHow far is the difference between the two verses, and how intense the contradiction between the two speeches. And he is the one saying:\n'From the mention of Layla, and where is Layla / And the best of what you sought is what is attained.'\nThis is of the best speech, easiest, most sturdy, most wandering as a proverb, and sweetest as a drink. And he said in the other in its manner:\n'Is it from the mention of Layla when she distanced from you, you shy away / And shorten a step from her and evade.\nYou evade, and how many a desert is before her / And of barren land before her and thieves.'\nSo contemplate the disparity between the two speeches, and the distance of their station in eloquence.\"\n\nI said to him: \"So what defect is in this?\"\nHe said: \"By my life, there is no defect in it, but it is not like the first nor close to it.\"\nI said to him: \"Upon that, he did not mistake as you mistook, nor err as you erred.\"\nHe said: \"So be it. And this is Al-Nabigha Al-Dhubyani, and a group counted him more poetic than Imru' al-Qais, and others counted him following him, and to this I went. He says in his Ayin-rhyme poem which traveled the path of the sun:\n'For you are like the night that catches me / Even if I thought that the distance from you is wide.'\nThis is an eye of the seeing eyes of poetry, and a blaze of its high blazes. Then he said following it, so he fell below it a fall witnessed by:\n'Hooks, crooked, in sturdy ropes / Hands extend with them to you, pulling.'\nI said: \"What is in this verse? He only went in this to the fact that he, in his power over him, is like one in whose hand are crooked hooks with which he pulls what he wishes to pull from a well or otherwise. From here the first took his saying describing a horse:\n'I came to him in the morning before his birds were cancelled / My companion hiding and other than him hiding.\nThe wild animals do not despair of him chasing them / As if he is hung from them by a hook.'\"\n\nHe said: \"And among what Al-Nabigha preceded in and people followed him in is his saying:\n'Except that her two anklets, even if you said they are wide / Are silent from fullness and lack of speech (sound).'\nThen he said and did badly and went far:\n'If she trembled, the coward feared for her earrings / And whoever hangs where it hung fears.'\nBecause this is proof of excessive length of the neck.\"\n\nI said to him: \"And what proof is in the verse of its excess and its exit from the limit of moderation approved in the likes of it? He only went to the fact that she is tall-necked, for she combined with the goodness of the neck the length of stature, so the dropping place of her earring was far because of the perfection of her creation and the length of her neck. And she trembled with an earring, so the coward among her family and whoever manages her affair of father and mother and nurse fears the loss of her earrings. So he deleted, since there remained in the speech proof of what was deleted from it.\" The group appreciated that.\n\nThen he said: \"This is Zuhair, and his place in skill and purification of poetry and refining of wording is the known place. He says:",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 27
  },
  {
    "serial_number": "6720994",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "'Upon their wealthy ones is a right for who comes to them / And with the poor ones is generosity and giving.\nA people sought after them to overtake them / But they did not do, nor were they blamed, nor did they fall short.\nWhatever good they came with, indeed / Fathers of their fathers inherited it before.\nDoes the spear grow anything but its bamboo / And is the palm tree planted except in its growing places?'\nHe said: \"This is of the secret of speech and its essence. Then he said in this poem:\n'So I swore earnestly by the pebbled place of Mina / And where the front parts (of heads) and lice were shaven.'\nThis is of the lowest and vilest wording.\"\nI said: \"There is nothing in it that is considered rough except his saying 'Al-Qaml' (Lice), and as for the rest of the meaning of that, he only ran in it on the custom of the Arabs in their oaths. And Zuhair is the sayer:\n'It is equal to him any time you came to him / Is it an hour of bad luck feared or with happiness?\nIf praise immortalized a man, he would not die / But the praise of a man is not immortalizing.'\"\nHe said: \"And this is a noble wording that organized two wandering proverbs that traveled east and west. Then he said in it:\n'Pious, pure, he did not increase spoil / By the marriage of a relative nor by a Haqlad.'\nHe said: \"And this wording with its roughness and anxiety did not unite with what preceded of that sturdy wording in one chest.\"\nI said: \"The man only ran in his saying 'Bi Haqlad'—which is the narrow-minded, ill-natured one—according to his language and tongue. Because it is a strange word, it had to be pointed out against him to his equals. The meaning in this verse is subtle; and that is that he intended that he does not oppress a relative or a lonely one, nor does he violate his right from a spoil he witnesses with him, deeming him weak and dominating him and seizing his share to increase it for his benefactor and to save his quarter-share. So he denied from him what others stoop to.\"\n\nHe said: \"And of his famous verses which he was not preceded to nor disputed in:\n'Indeed the right, its cutting points are three / Oath, or judgment (Nifar), or proof (Jala').'\nHe means that rights are only established by one of these three: either an oath, or a trial, or an argument.\"\nHe said: \"And in it he says:\n'He chews a morsel in which there is raw meat (Anid) / It stank, so it is a disease under the flank.'\nTalajlaj: You move it and do not swallow it. Anid: Did not ripen. Asallat: Smelled bad. The difference between this and what preceded is not hidden from one who attached himself to knowledge and attributed himself to its people.\"\n\nI said: \"I do not know a criticism on the verse more than his use of words from the language that are not wild nor abandoned. And the meaning with that is not impossible nor hybrid, so what face is there to comment on it from what has no comment in it?\"\n\nHe said: \"And this is Al-A'sha, the most erotic of them, the most satirical, and the most praising, and he is the sayer:\n'Both your parents were a branch, a pillar / But they increased and you became decreasing.\nYou spend the night in the winter full, your bellies / And your female neighbors are hungry, spending the night empty.'\nThis is of the most satirical verse said without obscenity. And he is the sayer:\n'A youth whom if the sun called, it would cast its veil / Or the traveling moon, it would cast the keys.'\"\n\nSome of those present said: \"What is the meaning of 'Yunadi'?\"\nI said: \"Sits with her in one club (Nadin), which is the council.\"\nHe said: \"Then what is the meaning of 'Qina'aha' (her veil)?\"\nI said: \"He meant her light.\"\nHe said: \"Then what is his saying 'La-alqa al-Maqalida' (would cast the keys)?\"\nI said: \"He means it would surrender beauty to him and delegate it, just as it is said: I cast my keys to so-and-so, meaning I delegated my affair to him.\"\n\nAbu al-Tayyib said: \"As if the words and his saying did not gather in one mind nor did a thought cast them both, for he said praising Alqama:\n'Does the sun deny, the sun of the day / And the dazzling moon, the leper?'\nIf the word 'Al-Abras' (The Leper) were in the Book of God Almighty, it would have muddied the drink of its eloquence. And when God Almighty mentioned what He intended, He alluded to it with the best metonymy from His saying, His Name be exalted: 'White without evil (Soo').' And he also said:\n'So I shot a heedless one before it from his sheep / And hit the grain of her heart and her spleen.'\"\nI said: \"He only specified the spleen because it is a killing spot.\"\nHe said: \"Suppose that is so, is not the word 'spleen' far from the words of lovers?\"\n\nThen he said: \"So these prominent ones in the arenas of poetry, the forerunners to the sweet of speech and its bitter, and those on whose precedence in its types and opening of what was closed of its doors consensus has fallen, there is none of them but one has buzzed around his poetry (criticized), and who has breached excellence despite the support of his excellence. Speech does not all run on one norm, nor does it come equitable nor equal. There must be a lapse by which a mind errs, and a stumble by which a tongue slips. Who is this whose speech was consistent, or whose poetry was safe from tracking? I am not an innovation among them, and if you were fair to yourself, you would find it refuted.\"",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 28
  },
  {
    "serial_number": "6720995",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "I said to him: \"As for what you imagined that you tracked against these four who are the knights of poetry and princes of speech, doubt has cast its shadow over all of it, and I have clarified that they are on the path of correctness in it. I argued in every verse with what, if you lent it your ear and turned your contemplation to it, you would have turned away from the sleeping place of the road and the trifles of speech and the decorations of suspicions, and known that there is no similarity between what you brought arguing with and what I attached to you. But you run the run of the unruly horse out of vanity in yourself, and throwing your ambition to where there is no ascent for it. You place it where it does not deserve to be placed and weigh it with the unjust balance to aggrandize it.\n\nAnd I said: \"And you have also erred in your saying:\n'Go far! You went far a whiteness that has no whiteness / Indeed you are blacker in my eye than darkness (Dhulam).'\nIt is, despite what is in it, taken from the saying of Abu Tammam:\n'He has a view in the eye, white, pure / But he is in the heart black, dark.'\nSo you intended these sound, noble words, and brought them in a corrupt, unsound expression. And your saying 'La-anta aswadu' (Indeed you are blacker) is an error, even if they recited:\n[Missing verse fragment]\"\nI said: \"This is a generated modern verse, not a proof. But they have recited:\n'A girl in the past Ramadan / Whiter (Abyada) than the sister of Bani Ibad / Cutting the talk with oaths.'\nAnd they mentioned the saying of Tarfa:\n'As for the kings, I am today dirtier (Awsakha) than them / In honor, and whiter (Abyada) than them in the shirt of the cook.'\nThese are oddities that are not permitted for a modern. People with no knowledge of the essence of speech interpreted the verse of Al-Mutanabbi with a distant interpretation and said: He meant 'Indeed you, O Black one, are in my eye from the darkness.' This is a distant interpretation. How do you say 'O Black one' while he is white? The face of speech, if he intended this, was to say: 'And you, with your whiteness, are black as if you are from the blackness of darkness.' If he had gone to that and expressed it with an acceptable phrase by which understanding occurs and ambiguity vanishes, the purpose would have been correct. But he made it vague and secretive.\n\nI said to him: \"And among what you also erred in its description and fabricated from two places is your saying:\n'A guest visited my head, not shy (Muhtashim) / The sword is better in action than it on the hair (Limam).'\nAs for the fabrication, your saying 'A guest visited my head', this is from the saying of Di'bil. Though you have left some of the meaning and did not fulfill it, because he said:\n'I love gray hair since it was called a guest.'\nSo he named it a guest. Then he mentioned his love for it, then followed that by mentioning the cause of his love, saying:\n'Like my love for the guests descending.'\nDi'bil took it from the saying of the first:\n'He threw down his staff and loosened his turban / And said: A guest. So I said: Gray hair? He said: Yes.'\nIn his saying 'and loosened his turban' is a subtle meaning, which is that he meant he is in a matter of peace not war, as the other said:\n'I am the son of Jala and the climber of peaks / When I put down the turban you will know me.'\nHe mentioned that because he did not put down the turban in peace. And it was said he meant by his saying 'When I put down the turban', i.e., when I get angry.\n\nAnd you took your saying:\n'And the sword is better in action than it on the hair'\nfrom the saying of Al-Buhturi:\n'I wish the whiteness of the sword on the day I met my fate / Instead of the whiteness of gray hair, was on my parting.'\n\nAs for the error, your saying: 'Not shy (Muhtashim)', you mean 'not withdrawn/reserved'. This is contrary to what the verifiers of the people of knowledge hold; since 'Hishma' in the speech of the Arabs is anger. And the 'Hasham' of a man were named Hasham because they get angry for him.\"\n\nHe said: \"Did not the poet say:\n'I fear repeating my saying \"Eat\" so I shame him (Uhshimuhu) / And silence descends him from me on stinginess.'\"\nI said: \"This is a generated modern verse, not a proof. But they have recited:\n'By your life, indeed the hospitality of Abu Khubaib / Is slow of cooking, shaming (Mahshum) the eater.'\nIt was said: Its meaning is angering the eater because it does not satisfy him; and it was said: The eater is withdrawn from his eating. The first is the relied upon. And 'Hishma' is among what the common people placed in other than its place.\n\nAnd of what you also dropped in and did badly in taking:\n'The polite, the refined, the proud, the sharp / The intelligent, the curly (Ja'd), the Chief, the Hero.'\nFor you copied from the saying of Al-Buhturi:\n'The days made peace with me when I became inviolable / By the shade of the Chief, possessor of favor.\nWith the polite, the refined, the virtuous, the moon / The proud, the scarred, the loyal, the hero.'\nI did not think anyone would dare on this as you dared on it, for the young literature students who engage in composing poetry rise above its like.\n\nI do not find for 'Ja'd' (curly) a way in praise either, since 'Ja'd' is the short one. He said:\n'O many a curly one (Ja'd) of them, if you knew / Strikes the strike of the lank-haired, the advancing ones.\nWhite curly ones, as if their eyes / Are kohled in the battles with darkness.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 29
  },
  {
    "serial_number": "6720996",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "He means 'Al-Ji'ad' the short ones. Al-Bahili mentioned that he described them with cowardice, because the coward's eye turns black in distress. And it is said: So-and-so is 'Ja'd al-Raha' (Curly of palm) if he is stingy, and he recited:\n'Lank of fingertips with what is in the saddle of his companion / Curly of fingertips with what is in his own saddle, short.'\nIt is said: So-and-so is 'Ja'd al-Raha' if stingy, and 'Ja'd al-Khulq' if tight-natured, and 'Ja'd al-Yad' if short-fingered. The wolf is nicknamed 'Abu Ja'da' because of his curled nature. 'Sha'r Ja'd' (Curly hair) is from this. And he recited: 'Lank of fingertips...' and mentioned the verse.\n\nAnd of what you took and cut off its meaning and corrupted is your saying:\n'Veiling their horses with white swords, taking / The heads of warriors on their spears as tassels.'\nBecause heads are not likened to tassels when on spears, except if they have hair and braids, otherwise they are likened to crowns. Do you not see the saying of Abu Tammam, from whom you stole the meaning and twisted it:\n'From every possessor of hair whose braids covered / The chest of the spear, so it was almost seen as a flag.'\nSo the hair with the tassel is a valid simile, and the head is likened to the crown so the representation is correct. Muslim bin Al-Walid said in likening them to crowns:\n'He clothes the swords with the souls of the oath-breakers / And makes the heads crowns of the withered spears.'\nMuslim took it from the saying of the first:\n'As if the heads of the people atop our spears / When pointed, are the crowns of Khosrau and Caesar.'\nNot every head has hair, and if it does not have hair or a braid, it has no share in being likened to a flag.\n\nI said: \"And you also erred in your saying, along with the weakness of your wording and the silliness of your expression:\n'Possessor of high deeds, let him who ascends ascend / Thus, thus, or else no, no.'\n'An honor that butts the stars with its two horns / And a might that shakes the mountains.'\nFor you raided in the first verse Bakr bin Al-Nattah in his saying:\n'He meets the dew with a face... / And the chests of spears with a bold face.\nThus, thus are the high deeds / The paths of glory are not the paths of joking.'\nYour saying 'Fala la' (Or else no, no) is very weak, and you are fond of repeating this word.\"\nHe said: \"How?\"\nI said: \"Are you not the sayer:\n'The answer to my questioner: Does he have an equal? / And do you have in your question No, No, No?'\n\nAnd you took the second verse from the saying of Abu Tammam and corrupted it:\n'An ambition that butts the stars, and a grandfather (luck) / Familiar with the low ground, so he is low.'\nHe said: \"And with what did I corrupt it?\"\nI said: \"Because you made for the honor of the man two horns.\"\nHe said: \"And what do you know?\"\nI said: \"You say 'Butts the stars with its two horns (Rawqayhi)', and the Rawqan are the two horns?\"\nHe said: \"Yes, it is a metaphor.\"\nBy my life, even if it is a metaphor, it is a malicious metaphor running in the 'Mu'azala' (intercourse/obscenity) which Umar bin Al-Khattab, may God be pleased with him, denied for Zuhair, and mentioned his avoidance of it. He said: 'He did not couple (Yu'adhil) between two words', i.e., interlace the word, if one of them was not of the genus of the other, nor suitable for it nor derived from it. It is said: 'Ta'adhalat al-Jaradatan' (The two locusts coupled) if one mounted the other and interlaced in it.\n\nAnd of the pleasant verses of meaning:\n'They took their bows with their right hands / Coupling the coupling of ants.'\nHe says: The arrows ran out and the darts perished, so they took the bows with their right hands striking each other with them and fighting, and they interlaced one another like the mounting of ants and their interlacing, because shooting is only with the left. The blamed Mu'azala is the worst metaphor, as Aws bin Hajar said:\n'And possessor of worn clothes, naked are her veins / She pours water on a truncated foal (Tawlab).' \nHe made for the woman a 'Tawlab', and the Tawlab is the foal of a donkey, just as you made for honor two horns. This is of the furthest metaphors and most divergent from the schools of skilled poets. The speech on types of metaphor has preceded. If you lent what I say a fair ear, you would know that confronting a king of kings like Sayf al-Dawla—with the greatness of his affair, the nobility of his authority, and his encompassing the traits of generosity excluding many kings of his time—with the like of what you confronted him with of that metaphor, is of the great matters which he who has been broken in by experience and whose speech has been educated by deliberation does not undertake. Every metaphor is subtle, and necessitates eloquence of statement by reality not acting in its place, because reality, if it stood in its place, would be more worthy of it than the metaphor. Do you not see the saying of Imru' al-Qais:\n'And I have gone early while the birds are in their nests / With a stripped (short-haired horse), the shackle of the wild beasts, huge.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 30
  },
  {
    "serial_number": "6720997",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "This type of metaphor is called 'Irdaf' (Consequence/Implication); which is that the poet wants to indicate a meaning of meanings, so he does not use the word that indicates that meaning, but a word that indicates a meaning that is a consequence of it and follower to it. If the follower indicates, it indicates the followed. Such is 'Qayd al-Awabid' (Shackle of the wild beasts). That is because he wanted to describe the horse with speed and that he is excellent; if you sent him on the game, he is like the shackle for them and they were like shackled to him; that is because the nearing of his overtaking and the togetherness of his running implies that the wild beasts be like shackled to him. The reality of 'Qayd al-Awabid' is preventer of wild beasts and their confiner. 'Qayd al-Awabid' is more eloquent and better. And 'Al-Manin' was said for the captive, and it was said in describing the horse 'Qayd al-Rihan' (Shackle of bets), and it was said: The eyes are the shackle of thoughts and shackle of eyes; all of that is built on the wording of the horse.\n\nAnd of metaphors is the saying of Al-A'sha:\n'Indeed noble horses will visit you / Praise hung on their rumps.\nWith him saddle blankets are shaken off in every dwelling / And ends of ropes are tied and untied.'\nTa'abbata Sharran said:\n'So he mixed with the plain of the earth; the rock did not scratch / Him a scratch, and death stood looking in shame.'\nAnd of the innovative metaphor is the saying of Al-Hudhali:\n'If I had entrusted him to the sun, there would have ascended / To him the deaths, its eye and its messenger.'\nAnd the saying of Ibn Harma, and Ibn Harma did well, all wellness:\n'So I said: Either you see me having been betrayed / By a disjointed time, with these people, overturned.\nGray hair has returned its strange camel to my head / So it has no estrangement from the scalp of the head.\nMy heart has dragged the surplus of its leading rope / And the white, buxom women fear my tear.'\nIbn Al-Riqa' said:\n'And a painted woman, the eyes of the people borrow her / Until she returns the gaze to the possessor of fastidiousness.'\n\nAbu al-Tayyib said: \"This is all hyperbole and exaggeration and distance from reality. I see you fond of this school of poetry, excluding what its words are sound and its meanings correct upon contemplation. If something of its genus comes to you, even if false, you advance it and cancel others.\"\n\nI said to him: \"This is the saying of one who does not distinguish between metaphor and reality, nor between exaggeration (Ghulu) and emphasis (Mubalagha).\"\nHe said: \"Is there a difference between exaggeration and emphasis?\"\nI said: \"All the difference. Antara said describing his horse:\n'So he turned away from the fall of spears on his chest / And complained to me with a tear and a neigh.'\nHe made the complaining of the horse to him, since it was of the animals that speak by neighing and tearing, without speech and expression. So he did not take it out of what belongs to it. Then he revealed the meaning in the last verse and said:\n'If he knew what conversation was, he would have complained / And he would have been, if he knew speech, my speaker.'\nBashar bin Burd took this meaning and did well with his saying:\n'When the heat turned away and the soil squeezed / The blaze of summer from a star whose flame kindled.\nAnd the sparrows of the anemones flew and [the earth] clothed itself / From the mirage the likes of the galaxy, its canes.\nA herd began complaining with its eyes of thirst / To the wild bull, except that it does not speak.'\nThis is emphasis in description without deviating from reality. Similar to it is the saying of Ibn Harma describing a dog:\n'He almost, when he sees the guest approaching / Speaks to him out of his love, while he is mute.'\nSo he paired this emphasis with 'Yakadu' (almost). So he took it out of the exaggeration that distances from reality.\nLook at the saying of Al-Muthaqqib Al-Abdi in this meaning, narrating from his she-camel what is far, all distance, from reality:\n'She says when I tightened her saddle girth on her / Is this his religion forever and my religion?\nIs all of time settling and departing / Does he not keep me [safe] nor protect me?'\nThis is the exaggeration distant from reality. He only went to the idea that the she-camel, if she spoke, would have expressed her complaint with the like of this saying. Some of our companions run this and its likes in the chapter of Majaz (figurative language).\"",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 31
  },
  {
    "serial_number": "6720998",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "The group present was using their pens to record the beginnings of the verses in which the dispute occurred, observing the locations of my arguments and his arguments, and proving it by symbol and suggestion. All of it was before my eyes, and like a mirror from my memory. When I rose from the gathering—and I did not rise except after I returned beautifully in addressing him, and elaborated in praising him, and in erasing the trace of his punishment, and in softening my side to him—the people followed me, desiring me to organize what happened and gather its dispersed parts, and refer to what was established in their notes of its sum, and seek help from my mind in mentioning it, and compose a treatise in whose folds I alert to his matter.\n\nThe day had spent its youth, and its hours turned gray with age, and the sun approached setting and humbled for decline. The rein of the dispute extended, and the matter of the negotiation exacerbated, so the ability did not expand in the moment to organize the treatise. I took what was proven in their pages, and returned to my house. I made the night a mount for three nights in which I did not taste sleep, until the last stars set, the flocks of darkness turned away, and the morning smiled, until the treatise was organized. I led three [nights]... keeping sleep away from my eyes until the dawn tore the shirt of darkness, and its mouth smiled in the gap of the forenoon.\n\nThe news spread and the situation became famous, and it was called out in every club. The Vizier Abu Muhammad and the Chief Abu al-Faraj Muhammad bin al-Abbas—and to him I addressed this treatise and his obeyed command in organizing it I complied with—ordered, and they are the two stars of the Kingdom and the two eyes of the State, its explanation, so I explained it. They conveyed the image to Mu'izz al-Dawla, so he was pleased in his happiness, and emphasized the recommendation of caring for me and honoring me severely.\n\nThen the Vizier Abu Muhammad saw fit to gather us in a council, and that his review of speech and his debating him be in his presence. I am presenting that council by council in its form. For Abu Muhammad al-Muhallabi ordered two of his special scribes to record it, and emphasized the instruction to them to guard against a single thing of it escaping; so they collected that a severe collection. Among those who witnessed the situation and showed his face in supporting and alerting to the locations of my excellence in that negotiation and debate was Hibatullah bin Al-Munajjim, who is of literature such that his scene is not exited, and Ali bin Muhammad the poet known as Ibn al-Baqqal, and he has his place in virtue.\n\nI will mention, God willing, what broke out between us, and pair it with what I attached to his work of theft and absurdity, and of hybrid wording and corrupt meaning. I will mention also the beauties of his poetry, and the eyes of his eulogies—for praise was his food and the straying (famous) of his verses—running in all of it with the truth which cannot be transgressed, fair and seeking justice from him, not decreasing his right, nor attributing to him what is not his. I will single out a book for that and exhaust it, and reach the limit that ability reaches in it, by the power of God and His strength, favor, and compassion. The treatise is completed, and praise be to God, and the favor is to God alone, and His blessings be upon our master Muhammad the Prophet and upon his family and companions and peace be upon them completely. The completion of copying it was agreed upon by the hand of the poorest of God's servants and most in need of His pardon and forgiveness, Muhammad bin Abdul Malik bin Asakir Al-Shafi'i Al-Ba'labakki, may God forgive him, on Friday the ninth of Shawwal, the year seven hundred and seventeen, praising and praying.\n\n[The text returns to the narrative of the debate]\nAbu al-Tayyib was summoned along with a group of people of knowledge. I attended the council of the Vizier Abu Muhammad al-Muhallabi and planned his discussion. He showed denial, grimness, refusal, and resistance. I softened my side to him, then I hastened him to speak and asked him about his saying:\n'Is it single (Uhad) or sixfold (Sudas) in the single / Night of ours, hung on the mutual calling (Tanadi)?'\nI said: \"What did you intend?\"\nHe said: \"I intended: Is it one night or six nights in one night, finding it long and considering its extent far.\"\nI said: \"Yes, and I see you looked in it to the saying of the first:\n'This night has become long until as if it / Is two connected nights that do not budge.'\nAnd to the saying of the other:\n'And a night that refused for the morning to shine, and the darkness / Repeated in it between an end and a beginning.\nAs if the pitch-black of the night is a shackled blind man / Bewildered in a wilderness of the unknown earth.\nAs if the darkness when it lowered its curtains / In Najd, is upon a confused, connected night.'\nAdi bin Al-Riqa' said in this meaning:\n'And as if my night when its sun sets / Is connected to the blackness of another like it.'\nAl-Farazdaq went to this school by his saying:\n'And a night of a day whose darkness outweighed / Equal to us are its length and its worries.\nAs if the days and the night in it are a connection / And a black darkness, pitch-black is its beast.'\nBashar did well, all wellness:\n'My two friends, what is with the darkness not budging / And what is with the light of morning not becoming clear?\nDid the illuminating day lose its way / Or is time all night that does not leave?'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 32
  },
  {
    "serial_number": "6720999",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "I said: \"So all of these ran on one path in lengthening the night, whether exaggerating in it or economizing, except that he did not couple to the beginning of his verse what contradicts its end and negates it, and differs from it all difference and does not imply it, like your deed. For you connected your verse with an end that spoiled it, and was far, all distance, from it; that is that you said 'Is it one night or six nights in a night'. Then you diminished (using diminutive form) according to the schools of the Arabs in diminishing the magnificent in their saying 'Duwayhiya' (Little calamity) and 'Udhayquha al-Murajjab' (Its propped little date-bunch) and 'Judhayluha al-Muhakkak' (Its rubbed little post), and as the first said:\n'Above a little mountain (Jubayl), high of head, it was not / To be reached until one tires and works.'\nAnd as the other said:\n'O Mayy, may the flashing little lightning (Burayq) water you / And the pouring flowing rains.'\"\nHe said: \"To this I went.\"\nI said: \"Then you said: 'Al-Manuta bi-Tanadi' (Hung on the mutual calling), so you made it absurd.\"\nHe said: \"How is that?\"\nI said: \"How is what you imagine to be one night or six in one hung on mutual calling? You only looked in your saying 'Al-Manuta bi-Tanadi' to the saying of the poet:\n'I said to my guest when I woke him / In a rainy night:\nWhat is with me, I see the night as a last / As if it was hung (Nita) on the Hereafter (Akhirah).'\nSo this one made it, in its length, hung on the Hereafter, so he did not couple that with what spoiled it and distorted its meaning, nor made it absurd like your absurding of your verse until you asked the question of a doubter whether it is one night or six in a night. Then you contradicted by informing that it is hung on mutual calling. So what a difference between this questioning of yours and the saying of the other, despite the lateness of his time:\n'I do not know, did my night lengthen or not / How would he know that, who is frying (in pain)?\nIf I were free to measure the length of my night / And to tend the stars, I would be empty (carefree).'\nAs if you did not hear the saying of Suwayd bin Abi Kahil:\n'And when I said my night has passed / The first of it turned and returned.'\nKhalid bin Yazid imitated this meaning and said:\n'The morning distanced until I do not hope for it / And worry increased so its departure is not hoped for.\nAnd the night is a stop upon us, not leaving us / As if every time of it is a beginning.'\nThis is better than the saying of the other, even if his time preceded:\n'There is no end to the night / From which a lover recovers.\nThe end of the night is a beginning / No rising sun is seen in it.'\nBecause he made its end a beginning, and Khalid made every time of its times a beginning. Similar to these two verses is the saying of Al-Hasan bin Ziyad Al-Rusafi:\n'O night that lengthened upon a lover / Waiting in the morning for an appointment.\nIt almost became the Resurrection in its length / When its beginning passed, it returned.'\nThis is the utmost in its meaning and it has an addition by his saying 'waiting in the morning for an appointment'. Although the saying:\n'You slept and did not pity the sleepless / And the night of the lover has no end'\nis very innovative, preceding much of what was said about the length of the night. As if this is from the saying of Al-Yaqtini:\n'I say to it when its darknesses anchored / I lost you as a night, you have no end.'\n\nIt was reported to me afterwards that he changed the verse or some of his faction changed it, so he made it 'Al-Manuta bi-Tanadi' and said its meaning is the people called each other for departure. This is a very weak saying, and a meaning with no benefit.\n\nAnd you said in this poem of yours:\n'As if the Daughters of Na'sh (Ursa Major) in its darkness / Are virgins (Khara'id) unveiled in mourning clothes (Hidad).'\nThere is no relation for the 'Khara'id' (virgins) among women excluding others with this simile; since the Kharida is the shy one and Kharad is shyness. The stars in the darkness are not more appropriate in resemblance to virgins in black, than to those with shyness among women. You only said 'Khara'id' so the place would be confused and the taking hidden, because Ibn Al-Mu'tazz said:\n'As if the stars of the horizon in the coal of darkness / Are the faces of virgins (Adhara) in black sheets.'\nHe said: \"What is the reason for specifying 'Adhara' (virgins) instead of 'Awan' (middle-aged)?\"\nI said: \"Because the virgin is distinguished from the middle-aged by the abundance of the water of the face, its freshness, and the delicacy of its skin; therefore they said 'virgin pearl', not pierced, and 'virgin garden', not sown, and 'virgin wine', not broached. Therefore they named wine 'virgin', if it was not deflowered by mixture or not broached from a jar, as Al-Akhtal said:\n'Virgin, the suitors did not unveil its joy / Nor did a Christian unveil it for a Dinar.'\nIbn Al-Mu'tazz said:\n'And the two bright stars (Farqadan) gazed at me as if / A blue-eyed woman looking from a black veil.'\nHe also said:\n'And I see the Pleiades in the sky as if / A foot appeared in clothes of mourning.'\nSo he managed the meaning well and emphasized it, and you did badly in taking it.\n\nAnd in this rhyme you say:\n'May God reward the march to him with good / Even if it left the mounts like water-skins (Mazad).'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 33
  },
  {
    "serial_number": "6721000",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "He only meant that the march wore out their bodies and betrayed their fatness. You went to liken them to old, dried water-skins, but you could not fulfill the simile, and the material fell short with you, so you limited yourself to mentioning 'Al-Mazad' (water-skins), and not every water-skin is worn out or dried. You only looked to the saying of the Rajaz poet:\n'As if she, and the trap is like the dried skins (Shanan) / Sways in a purple suit.'\n'Al-Shanan' are the dry water-skins, and this is a correct simile, and your verse which you stole from it is corrupt and sick. If you had brought the description, it would have indicated the described. But to bring the noun which contrasting descriptions take turns on, it does not indicate by mere mention what you intended of its description. Do you not see the saying of Abu al-Najm describing camels:\n'Walking from the return the walk of the filled (clouds) / The walk of the water-carrying camels with the heavy water-skins.'\nHe did not limit himself to mentioning the water-skins until he described with a description of condition that took the simile out of the ugliness of separation.\n\nThen I said: And in these words you say:\n'He cheered up before my greeting to him / And threw [money] before the pillow.'\nI think the first one followed your trace in this meaning and said:\n'Times I approached him, he did not but / Smile laughing and fold the pillow.'\n\nAnd of your virgin meanings in it is your saying:\n'So my thoughts are I praised them of old / And you, by what I praised them, are my intent.'\nAs if Abu Nuwas heard this and said:\n'Even if the words ran with a praise / To other than you, [you are] the human we mean.'\nAlthough Kuthayyir bin Abdul Rahman had said:\n'Whenever I say in the end of time a praise / It is only for the son of Layla the Honored.'\n\nThen I said: In this word you say, and lengthen and boast and attack and imagine that the meaning is unsaid:\n'As if the heads in the battle are eyes / And your swords were printed from sleep.'\n'And you formulated the spearheads from worries / So they do not cross except in a heart.'\nGlory be to Him who humiliated the necks of speech for you, and smoothed its shoulders and gathered its dispersed parts, and led meanings to you by their reins, until you invented from them what the thoughts of those who preceded you of the knights of poetry and princes of verse and prose fell short of. These two verses are from the saying of some Syrians:\n'He imagined the heads as pupils, his sharp swords / Between their eyelids were crafted from slumber.\nThey top working (spears) that were aimed out of fear / They travel by stabbing from him the path of the clever.'\nSome of those present said, and I think it was Abu Ali Al-Hussein bin Muhammad Al-Anbari, and his inclination was with him: \"These two verses are fabricated, artificial, their sayer is not known.\"\nI said: \"Then you make the likes of them and let them be.\" He took the first verse of his two verses from the saying of Mansur Al-Namari:\n'The bloods reminded with its luster, as if / It tops the men with bright clusters (of dates).\nAnd as if the numbness of the sharp sword in his head / Is the numbness of death or the drowsiness of the sleeper.'\nAs for his saying: 'And you formulated the spearheads' to the end, it is from the saying of Al-Buhturi describing a wolf, and it is of the best that was said:\n'And a dust-colored one filling the eye, dividing his chest / And his ribs from his two sides is a high roasting (hunger).\nHunger folded him until his rope became bitter / There is nothing in him but bone, spirit, and skin.\nHe rose to me, and in me from the intensity of hunger is what is in him / In a desert where no comfortable life is felt.\nSo I fed him a clumsy (arrow/spear) considering its feathers / On a shooting star and the night is black.\nAnd I followed it with another, so I delivered its blade / Where the core (heart) and terror and hatred are.'\nAl-Buhturi took this from the saying of Abu Tammam:\n'From every blue (spear), looking without a look / To the killing spots, there is no crookedness in its wood.\nAs if it was the dust (peer) of love for a time / So no heart nor liver incapacitates it.'\nHe took it from the saying of Amr bin Ma'adi Karib:\n'And the strikers with every white sharp sword / And the stabbers of the gathering places of grudges (hearts).'\n\nAbu al-Tayyib said: \"Who are Abu Tammam and Al-Buhturi? I do not know that I heard their mention except from this presence.\"\nI said: \"Abu Tammam and Al-Buhturi whose words you snatched, and whose meanings you annexed, and you fell short of them the falling of the arrow falling short of its target.\"\n\nThen I said: \"And you erred in your saying:\n'She got angry for him when I saw his descriptions / Without a describer, and poetry, its non-Arabs (Tamatim) rave.'\nBecause raving (Hadhayan) is the speech of the senile and the sick, and one possessed by a specter of madness. The raver and the rave are of the blamed descriptions as the first said:\n'Raver, rave, much raving / Prone to slip, possessor of a scattered mind.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 34
  },
  {
    "serial_number": "6721001",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "And 'Al-Tamtama' is the speech of the foreigner which is not understood. It is said: A Tumtum foreigner and Tumtumani, if his speech is not understood. Antara said:\n'The young camels of Al-Nu'man shelter to him as sheltered / Groups of Yemeni (camels) to a stammering foreigner.'\nSo you made your poetry and its struggling in your chest and its creeping on your tongue and what its instinct granted you, in the status of the speech of the raver and the stammering foreigner whose speech is not understood. There is no good in what is of this way. The face of speech was that you say: And poetry, its current heaves, its deep water boils, its sea rages, and its rhymes envy each other in his praise. This speech is as Abu Tammam said:\n'Poetry envied each other regarding him when I stayed up for him / Until I thought his rhymes would fight.'\nBut the rhyme forced you to what disgraced the speech and corrupted its meaning and turned it from correctness.\n\nHe turned to me and said: \"Be fair, for the fair one is he who distinguishes. And look closely, the looking of one whose foot has advanced in knowledge, and to whose virtue pointing has occurred. And do not let passion rule over opinion.\"\nI said: \"Speak.\"\nHe said: \"I only run on the path of the prominent poets in excellence and invention of meanings. So if the paths of creativity are obscure, I run on the manner of those who preceded me in tracking the trace and observation and looking. I do not absolve my mind, even if correctness acts by it on its path, from a slip that passes me and a stumble I intend.\"\n\nI said to him: \"Is it from your inventions, your saying describing your sandal:\n'Neither does my she-camel carry the pillion rider nor / With the whip on the day of the bet do I exhaust her.\nHer strap is her saddle and her lip (Mashfar - camel lip) / Is her rein and the thong is her leading rope.'\nHe said: \"Is this not invented?\"\nI said: \"Yes, and it is invented for Abu Nuwas in his saying:\n'To you, O Abu al-Abbas, whoever walked / Upon them, we rode the tongued Hadrami (sandals).\nYoung camels that did not carry a yearning pillion / Nor did they know the knocking of the stallion nor the tar.'\nYour saying 'Naqati' (My she-camel) is from the saying of Abu Nuwas 'Qala'is' (Young she-camels). You increased the meaning and saturated it in the second verse and left from the saying of Abu Nuwas:\n'Young camels that did not carry a yearning pillion / Nor did they know the knocking of the stallion nor the tar.'\nAnd you added that you do not exhaust it with the whip, and that her strap is her saddle, and her rein is her lip, and the thong is her leading rope.\n\nAnd from your invented meanings is your saying:\n'Sharp of heart, prudence shows him tomorrow / With his heart what his eyes see after tomorrow.'\nThis is from the saying of Duraid bin Al-Simma, meaning and wording:\n'He sees the consequences of opinion and the matter is approaching / As if he has in today an eye on tomorrow.'\nThe other said:\n'He becomes with the consequences of matters as if / The consequences of every matter speak to him.'\nAl-Mutanabbi repeated this meaning in another place and did not express it well, saying:\n'Deriving from his knowledge what is in tomorrow / And as if what will be in it is recorded.'\nAnd the first of this meaning is the saying of Aws bin Hajar:\n'The brilliant one who thinks the thought of you / As if he has seen and has heard.'\n\nAnd in the word Al-Mutanabbi says:\n'When you returned from the coasts towards us / Loneliness returned to them from us.'\nHe only took it from the saying of Al-Buhturi:\n'Prince Muhammad departed, so departed / From us the juice of this bliss.'\n\nAnd similar to this, your inventions, is your saying:\n'Whenever I increased after the limit / My decrease fell (occurred) as an increase.'\nThis is transferred from the saying of Mahmud:\n'Fast in the decrease of a man is his completion / His days turn back in his advancing.'\nIbn Al-Rumi expressed this meaning well and said:\n'Times snatch him while they are his growth / And foods assassinate him while they are a bait for him.\nIf you see a thing whose age wears it out / And corrupts that it remains, then in its disease is sterility.'\nThis meaning looks a look at the saying of Hamid bin Thaur Al-Hilali:\n'I see my sight has disturbed me after health / And it is enough of a disease for you that you are healthy and safe.'\nAnd Hamid in it has a look at the saying of Al-Namir:\n'The youth desires length of safety striving / So how do you see the length of safety doing?'\n\nIf you wished, you would have refrained from exposing yourself to what is this way, especially since you are a target for every accidental arrow, an opportunity for every opportunist. What do you do with your saying:\n'I saw the horn of the sun in the moon of darkness / Swaying, a branch in him sways.'\nWith the saying of Muslim:\n'Slender-waisted, in her hair is a night, over a moon / On a rod, on a dune of the sandy hill, reddish.\nAs if my heart is her two sashes when she strutted / And her heart is her heart in silence and dumbness.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 35
  },
  {
    "serial_number": "6721002",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "'Her love runs in the heart of her lover / The running of safety (health) in the limbs of a relapsing one.'\n\nI said: \"And among what you stole and corrupted is your saying:\n'Ha! So look or think of me, you will see burnings / Whoever did not taste a tip of them has surely failed.'\n'Perhaps the Prince sees my humiliation so he intercedes for me / To her who left me in passion a proverb.'\nThat is because you exposed the Praised One to pimping, by your hoping for him to be an intercessor for you to the one you love. This is of the ugliest exit and silliest meaning a poet undertook in addressing a praised one. You only imitated in it the saying of Abu Nuwas:\n'If my Lord willed, He would afflict them with what He afflicted us with / So they would be neither against us nor for us.\nI will complain to Al-Fadl bin Yahya bin Khalid / Your love, perhaps Al-Fadl will unite us.'\nAbu Nuwas only went in directing this to seeking the giving of the Praised One and his aid, or marrying her if she was free. His saying in the last verse indicated that:\n'A prince, I saw wealth in his moods / Humiliated, insulted of soul by oppression, submissive.\nIf the Lord of Wealth is stingy, his generosity calls / Come to the wealth of the Prince, and makes the call to prayer.'\nThis is further clarified by his saying in this word, mentioning a man he pointed to regarding the debt as a loan and the buying of this slave girl:\n'He sees Al-Fadl has sworn to plunder his money / And the idiot asks me to be a scout.\nO Fadl, perceive my youthful love with its dust / For there is no good in my love if it commits adultery.'\nThis is a clear proof.\"\n\nAbu al-Tayyib said: \"So I imitated a meaning and two meanings and three of Abu Nuwas, and he is the Imam of the moderns, so what of it?\"\nI said: \"And of your leaning on him and falling short of him is his saying:\n'Indeed kings saw your father with eyes / Kohled for them with the kohl-sticks of aggrandizement.'\nSo you said:\n'You know in his eye his truths / As if he is kohled with intelligence.'\nAnd from this is the saying of Abu Nuwas:\n'He understood the suggestion and the whistling / And the revealing, whether you gesture or signal.'\nSo you transferred it and said:\n'And her discipline is the length of the chase, so his glance / Signals to her from afar and she understands.'\nAnd Abu Nuwas said:\n'To a youth whose mother's walker forever / Strives with a pocket torn among people.'\nSo you said and did well:\n'A king, if his treasuries become full one day / He makes them taste the taste of the mother's bereavement of the child.'\nAnd Abu Nuwas said:\n'And if the mounts reach Muhammad with us / Their backs are forbidden to men.'\nSo you said, and did not observe the looting of meaning and wording:\n'And the excuse of the free men, her back became / Except to you, upon me a forbidden vulva.'\nHe said: The first who realized this meaning was Al-Farazdaq by his saying:\n'I say to my she-camel when she reached me / You have become to me by oath\nForbidden to the nose-reins and the saddle-pads / And the straps of the saddle and the girth.'\n\nAnd Abu Nuwas said:\n'He weeps and sheds tears from his eye / And slaps the rose with jujube.'\nSo you took it and said:\n'She looks at you with the eye of a gazelle, ready to cry / And wipes the dew over the rose with the Anam (fingertips/red tree).' \nThe first who looked at this meaning was Al-Muraqqish, for he said:\n'The scent is musk and the faces are Dinars / And the tips of the palms are Anam.'\nOmar bin Abi Rabi'a said, and did well:\n'Coming from the bottom of the winding valley with Yemeni / Sheets, lifting the tail of the clouds.\nWith palms as if they are pieces of snow / Their tips are of jujube.'\nSome moderns said:\n'From the palm of a girl as if her fingertips / Are of silver tipped with jujube.\nAs if her right hand, when she clicks with it / Casts a calculation upon her left hand.'\nAbu Tammam said:\n'They said \"Departure\", so she stuck her nails / In her cheek while they had caught dye.\nSo it turned green under her fingertips, so as if she / Planted jujube in a land of violet.'\nAl-Mu'alla Al-Tai did well, all wellness, by his saying:\n'She gifted a peace to my heart, stealing / From the eye of the watcher with soft fingertips like Anam.\nAs if she orally told me in her signal / To me: A jujube topped a pen.'\nThe poet from Jabal al-Summaq said:\n'They said: Departure is tomorrow forenoon or after it / So they slapped with jujube and pens.'\nAl-Buhturi said, and changed the expression:\n'She revealed her fingertips so she showed us / Gold of her dye in silver.'\nAl-Nashi' the Mutakallim said, and did well, all wellness:",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 36
  },
  {
    "serial_number": "6721003",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "'Embracing, concealing their passion / Blame slept between them so it became good.\nExchanging the glance from their eyelids / As if they are studying a book.\nWhen the eye of the watcher was inadvertent, their palms / Snatched the snatch of peace, robbing.\nWith fingertips from him appearing like oil-pots / And fingertips from her clothed in dye.\nAs if she picks for him from his palm / Grapes, and he picks for her jujube.\nShe feared the eyes of the slanderers so she turned away / Biting the jujube with hail (teeth) out of anger.'\n\nAnd Abu Nuwas said:\n'They said: You have done well. So I said: I / Found speech enabled me, so it was good.'\nSo you said:\n'I am not alone who said this whole poetry / But my poetry has poetry from itself.'\n\nAnd Abu Nuwas said:\n'You see its light from the outside of the cup appearing / Upon you even if you covered it with a cover.'\nSo you took it a curious taking and transferred it to praise, so you said:\n'When he appeared, his awe veiled your eye / And nothing veils him if he veils himself.'\n\nAnd Abu Nuwas said:\n'So reveal the name of whom you love and leave me nicknames / There is no good in pleasures which have a curtain before them.'\nSo you said:\n'Love is what prevented speech the tongues / And the sweetest complaint of a lover is what he declared.'\n\nAnd Abu Nuwas said:\n'Indeed I am a rebuker of the glance of the eye with the eye / For almost no conscience is hidden from me.'\nSo you said:\n'More seeing than Zarqa (of Yamama) is the atmosphere of my familiarity / When my eyes look, my knowledge willed both.'\n\nAnd Abu Nuwas said:\n'If the Lord of Wealth is stingy, the dress of his generosity / Calls: Come to the money of the Prince, and makes the call to prayer.'\nSo you said:\n'And Dew called to the sleepers away from Dew / So he made them hear: Stinginess has perished.'\n\nAnd Abu Nuwas said:\n'So it left me no flesh and left me no blood.'\nSo you said:\n'And a phantom of a body, passion did not leave for it / Flesh so sickness dissolves it, nor blood.'\n\nThen I said to him: \"Does this satisfy you from Abu Nuwas and in him, or shall I increase you?\"\nHe said: \"Increase if you wish or decrease. Does not your Abu Nuwas, whom you announce my theft from, have an example in others? He is the one saying:\n'And her love enters every heart / Entrances that wine does not penetrate.'\nHe only took it from the saying of Dhu al-Rumma:\n'Two eyes, God said: Be, so they were / Doing in the minds what wine does.'\nAnd he is the one who says:\n'And a tent of a guard on a high peak / The hands of whoever sought it intended slipping.\nAs if we are at it between the sides of an ostrich / Its chest shunned a dwelling and a resting place.'\nHe only imitated the saying of Jarir:\n'We shaded in the garden of Arak as if / At a horse facing the wind, fasting.\nWhiter (blazed) than the piebald horses, hurt by / The harm of mosquitos except what he protected with the legs.'\n\nI said to him: \"Jarir only intended that the fluttering of the wind in the hem resembles a horse kicking with his leg when the mosquito bites him, and he mentioned a tent made of clothes of different colors, therefore he likened it to the piebald horse. The verse of Abu Nuwas is not of this nor resembling it.\"\n\nHe said: \"And Al-A'sha said:\n'With a brave one, taking judgment over time / So from whatever time brings he is fearful (cautious).'\nAbu Nuwas took this:\n'It circulated among youths to whom time submitted / So nothing befalls them except what they willed.'\"\nI said to him: \"If he took it from Al-A'sha, he surely did well in it. If fairness occurs, you know that the verse of Abu Nuwas is more noble in wording, sweeter in expression, more revealing in meaning, and has an addition by his saying: 'Time submitted to them'.\"\n\nHe said: \"Al-A'sha has said:\n'And you think them dead when / The spirit, the wine, walks in them.'\nAbu Nuwas took it and said:\n'If the Pole (star) does not drag them, we died / And in their rotations is resurrection for us.'\nHe said: In the verse of Abu Nuwas is an addition, which is his saying: 'And in their rotations is resurrection for us'. This is more appropriate to the saying of Al-Akhtal, which is:\n'We stayed in it being given the extract of coffee / Our joints die from it then resurrect.'\"\n\nHe said: \"He is the sayer:\n'Ask the two coming from Hakaman / How they left Abu Uthman.\nThey say to me: Jinan, as pleased you / In her state; so ask about Jinan.'\nThis is taken from the saying of the first:\n'And asking about the riders, all of them / So Hassan bin Zaid hears her question.'\"\n\nThen he said: \"Likewise his saying:",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 37
  },
  {
    "serial_number": "6721004",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "'The rose reminded me of the scent of a human / Whom I remember at every basil.\nIf it diffuses, I do not control weeping, and when / It appears, the drinking companion almost announces my death.'\nThis is taken from the saying of Malik bin Asma:\n'Indeed I have at every breath of a garden / Of roses or of jasmine.\nA look and a turning, I hope / That you have settled in what follows us.'\"\n\nThen he said: \"Shall I increase you or is it enough?\"\nAbu Muhammad, may God have mercy on him, said: \"Rather, it is enough. In some of what you negotiated there is sufficiency from others. And your place, O Abu al-Tayyib, is not unknown.\"\n\nHe rose from his seat and Abu al-Tayyib rose to leave. We tarried at the Vizier's house, so he called for drink and we were called, and he prevented the presence of music. He began reviewing what happened, repeating his glance on it, and reviewing me about it. Among his care in the moment for me, and his honoring of me, was his gift, as his generous habit never ceased to run.\n\nThe Chief has known the condition of Abu Ali Al-Hussein bin Muhammad Al-Anbari in his deputizing for Al-Muhallabi in the ministry, his relation by marriage to him through his daughter, and the kindness of his position with him, what I have no need to elaborate on mentioning, because it is news that traveled further and remained as a landmark and trace. Al-Muhallabi, with that, showed him without his mirror (showed him falsely) an aggrandizement of his worth, and a magnifying of his affair, and an estimation that there is literature and virtue by which he is distinguished from others of his peers. He was not researching his plagiarism, but they are verses he presents, and words he deceives with, preserving them harvested from scrolls and picked from the backs of books. I did not let him swallow his spit (did not give him respite), rejecting much of what he presented, and deviating from the face he sought and intended. That angered him, and affected his soul an effect his left hand ceased not to speak of.\n\nWhen the meeting with Abu al-Tayyib occurred after his departure, he chose verses from his poetry whose meanings he was unique in and was the first to invent. He (Al-Anbari) conspired with him to aid against me, and promised him to schedule a meeting with me and surprise me with those verses, forcing me to submit to them and admit his precedence to them, a promise he saved for an appointed day. He suggested to Abu Muhammad the summoning of Abu al-Tayyib, so he summoned him. I was accompanying the presence of Abu Muhammad in the assemblies of his gathering and his privacy, and specialized with him every specialization.\n\nAbu Sa'id al-Sirafi, Ali bin Isa al-Rummani, Abu al-Fath, Abu al-Hasan al-Ansari the theologian, and others of the notables of the people of knowledge and those pointed to in literature were corresponded with. So a group attended, among whom was Ali bin Harun, turning to Abu al-Tayyib saying:\n\"Are you not the sayer:\n'I prepared for the treacherous ones swords / That cut (Tajda'u) from them necks (Tulan) and noses (Anafa).'\nWho are these 'treacherous ones' for whom you prepared these swords? And what is the meaning of your saying: 'That cut (Tajda'u) from them necks and noses'? Necks are for swords, and noses are cut (Ijtida') with razors.\" He began repeating this saying while Abu al-Tayyib turned away from him.\n\nAl-Muhallabi turned to Abu Sa'id and said: \"What do you say about that? Is it permissible, palatable, eloquent from the speech of the Arabs? Our companions have recited verses like it.\"\nHe turned to Ali bin Isa al-Rummani, who said: \"The matter is as he said, and the estimation is: Cut noses and sever necks.\"\nHe turned to me, so I said: \"Like the saying of the first:\n'You see him as if God cuts his nose / And his two eyes if his master returns to him abundance.'\nHe meant cuts his nose and gouges his eyes. And like it:\n'I fed her straw and gave her cold water to drink.'\nSimilar to it is the saying of Tarfa:\n'And she smiled revealing a dark-lipped mouth as if camomiles / Interspersed the heat of the sand, a dune with dew.\nAnd a face as if the sun cast its veil / Upon it, pure of color, not hardened.'\nHe meant: She reveals a face. Except that Abu al-Tayyib [mentioned] the cutting (Jad') for necks then followed it with noses. Had he put noses first then followed it with necks, it would have been carried on the like of what we mentioned.\"\n\nAl-Muhallabi turned to Abu al-Tayyib as if seeking his speech. Abu al-Tayyib said, and did not add a witness to this:\n\"This is like the saying of the other:\n'Drinker of milk and ghee and dried curd.'\"\nI said: \"This is as we mentioned just now: drinker of milk and eater of ghee and dried curd; and the objection stands as is, unless you carry the cutting (Jad') for necks on metaphor for it.\"\n\nAbu Sa'id said: \"Carrying speech on advancement and delay is common as God Almighty said: 'O Mary, be devout to your Lord and prostrate and bow with those who bow.' He means, and God knows best, bow and prostrate, so He began with prostration by advancement and delay.\"\n\nThen Ali bin Harun turned to him and said: \"Tell me, are you a Muslim when you say:\n'The best signs of the Tihami (Prophet) is that / He is your father, and one of what he has of virtues.'\nAnd when you say:\n'And all that God has created / And what He has not created.\nIs despised in my ambition / Like a hair of my parting.'\nAnd when you say:",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 38
  },
  {
    "serial_number": "6721005",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "'They sip from my mouth sips / Which are sweeter in it than Tawhid (Monotheism).'\nThen he whispered to me and said: \"Inform me, by God, tell me that the gums of his teeth are rotten and his breath smells bad,\" making me laugh. Abu al-Tayyib did not mention an answer to this, so I wanted to calm his apprehension and said: \"How beautiful is what Al-Majnun said:\n'And I, when I pray, turn towards her / With my face, even if the prayer-place is behind me.'\nThen he corrected this saying:\n'I have no polytheism, but her love / Is like the bone of choking, wearying the treating doctor.\nI pray, so I do not know when I remembered her / Did I pray two for Duha or eight?'\"\nAbu al-Tayyib said: \"In this is a subtle meaning.\" I said: \"He used not to count what he prayed due to preoccupation with her love, so he counted the Rak'ahs; if he counted two, his two fingers extended, so he imagined them eight.\" Al-Muhallabi found this answer witty and the attendees appreciated it, and Abu al-Tayyib smiled at me.\n\nAbu Ali Al-Anbari called for a scroll from his inkwell holder and said: \"Speak on these meanings, and contemplate the excellence of this man in them and his precedence to them.\" He turned to me, the scroll in his hand, and said: \"You are the one pointed to in memory, so mention what you have, and let the group mention what occurs to it, or let us surrender the goal of precedence to Abu al-Tayyib.\"\nI said: \"I speak on the condition that no one else interrupts my speech, for the crowding of speech is a misleader of understanding. Or let someone else speak on the condition of surrendering to me the prime of speech and its heels.\"\n\nThe group sought rest in me, and Abu Ali Al-Anbari began saying: \"What do you have regarding his saying:\n'And a waist the sights fix in / As if upon it is a belt of pupils.'\"\nThe group began to appreciate it. He turned to me and said: \"Speak.\" I said: \"Good.\" He said: \"Is it not a virgin (original)?\" I said: \"No! How can it be virgin when Bashar bin [Burd] says:\n'Crowned with eyes / They knocked on us and left whispering.\nSo they hit from the novelty of conversation / A pleasure and returned smooth.\nHouris who shine when they adorn / And when unadorned, they fear an evil eye (Nafsan).'\nHis saying: 'Crowned with eyes' is the verse, and that is the meaning. He says: If they appear, onlookers turn their eyes to them for their beauty, so as if they are crowned with eyes. 'And returned smooth', meaning they did not commit a suspicious act. And his saying: 'If they adorn', i.e., wear jewelry, they do not wear it for their beauty, but wear it as a charm, because they are dispensed of decoration by their beauty. Likewise his saying: 'And if they are unadorned, they fear an evil eye', he says: They fear the eye, so they repel the eye with jewelry. Ibn al-Rumi stole this meaning:\n'She wears jewelry made for her as a charm / Not decoration, but in her is sufficiency from that.'\nAbu Ja'far... Al-Masri said in the first meaning mentioning eyes insisting on looking at a person:\n'Nailed upon him, not uprooting.'\"\n\nIbn Al-Anbari said: \"What do you say about his saying:\n'Favors resided in necks for him / They are the collars and the people are the pigeons.'\nIs this not invented?\" I said: \"No, rather it is from the saying of Ibn al-Rumi:\n'If they are praised, they are not attributed the virtue of others / And are collars attributed to the ash-colored pigeons?'\nIbn al-Rumi imitated in it the saying of Muhammad bin Hazim Al-Bahili:\n'It refused for me to prolong poetry, my sufficiency / To the meaning and my knowledge of correctness.\nSo I send them four and six / In refined, sweet words.\nAnd they, if I brand a people with them / Are like the collars of pigeons on necks.\nAnd they, even if I stay, are traveling / Narrators exchange them with the riders.'\nIbn Hazim imitated in it the saying of Al-Farazdaq:\n'Whoever is fearful of the harm of my poetry / Banu Haram have been safe from satire.\nThey led their fool and feared / Necklaces like the collars of pigeons.'\nThe origin in this is the saying of Hassan bin Thabit, and a man quarreled with him, so he said: Go away, otherwise I will collar you with the collar of the pigeon.\"\n\nAbu Muhammad said: \"What do you say about his saying:\n'Suffice it for my body as emaciation that I am a man / Were it not for my addressing you, you would not see me.'\nIs it invented?\" I said: \"No, this is from two verses Muhammad [bin] Yahya recited to us:\n'When I wore out from passion / I feared eyes lest they see me.\nWere it not for my speech, the eye of the sitter / Would not have been guided to my place.'\nThis meaning looks to Abu Nuwas:\n'Poetry of a living one came to you from the utterance of a dead one / He became a pause between life and death.\nThe accidents of time pared him until / He almost hid from the eyes of accidents.\nIf you contemplated me to verify my face / You would not clarify a letter from the book of my face.\nAnd you would have returned the glance of your eye in a body / Which repulsion pared until it was effaced.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 39
  },
  {
    "serial_number": "6721006",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "Al-Muhallabi said: \"I do not think anything better than this was said about emaciation.\" I said: \"Yes, Al-Majnun:\n'If what you left of me were hung / On a stick of Thumam, its stick would not bend.'\nAnd Kuthayyir did not do badly in his saying:\n'I carried on her what, if a pigeon / Carried it, she would fly with it in the winds.\nStraps and thongs and the bones of an emaciated one / Whom the length of passion and autumns harmed.'\nI said: \"And the saying of Omar bin Abi Rabi'a preceded people:\n'Little on the back of the mount is his shade / Except what the embroidered cloak denied from him.'\nAnd the saying of Ibn al-Dumayna is appreciated:\n'Bones which longing pared until as if they are / Curved sticks of Nab' tree having no bowstring.\nThey are not dead, nor do they rise with me / Nor does a bird fill itself from what is on them.'\nBashar said:\n'Between my clothes is an emaciated body / If the wind blew it, it would fall.'\nHe also said:\n'Indeed in my two garments is an emaciated body / If you leaned on it, it would collapse.'\nThis pleased Abu Muhammad a severe pleasing, and he said: \"I did not think anyone preceded Abu al-Tayyib to a meaning evidenced by the advanced. What do you do with his verse, driven as I informed the Vizier of it, and each one of these has in this a meaning in which no one shared with him.\"\n\nAl-Anbari said: \"If he was preceded to meanings in what we mentioned, he was not preceded to his saying:\n'And a visitor (fever), as if she has modesty / She does not visit except in sleep.\nI offered her the velvet and mattresses / She loathed them and spent the night in my bones.\nWhen she separates from me, she washes me (sweat) / As if we are secluded on a forbidden thing (sin).'\n\nI said to him: \"His state in this is worse than in what preceded, for he relied on the saying of Ibn al-Qa'qa':\n'And a visitor without appointment came to me / And intervened between my body and the heart.\nA spearhead for deaths, if she appeared / My soul and deaths are in a chase.\nAs if my limbs, when she separated from me / Are springs drawing from the morning clouds.'\nI said: \"And you made an absurdity in your saying:\n'When she separated from me, she washed me / As if we are secluded on a forbidden thing.'\nWhile the Halal (lawful) is more worthy of washing and more specific than the Haram (unlawful). So how did you specify the Haram with a description in which others share, and it has a specificity above its specificity?\"\nAbu al-Tayyib said: \"I brought one of them, so it indicated the other even if I did not mention it. In the Quran: 'Garments protecting you from the heat', and they protect from the cold. The poet said:\n'So do not count lying promises / The winds of summer blew with them without me.'\nHe means and the winds of winter.\"\n\nWhen he cracked with the argument, the morning cracked the cloak of darkness. I feared he might delude the Vizier Abu Muhammad that I had no knowledge of what he mentioned. I said: \"Yes, but your saying is somewhat far from this, even if you follow its path. Because the Halal is more strictly specific to washing than the Haram, and garments are not more specific in protecting from heat than in protecting from cold, nor are the winds of winter more specific in their blowing without promises than the winds of summer. Although some of our companions mentioned that he specified the winds of summer because they are more effacing.\" Al-Muhallabi liked this objection.\n\nI said: And like the verse is the saying of the other:\n'I do not know, when I intended a direction / Wanting good, which of them follows me.'\nHe said: \"Which of them\", he only mentioned one, because he indicated the second, then followed that by saying:\n'Is it the good which I seek / Or the evil which seeks me?'\nPeople of meanings (rhetoric) discussed the saying of Aws bin Hajar:\n'And changed her from our connection, gray hair, indeed it / Is an intercessor to the white beautiful women, tested.'\nAbu al-Abbas Ahmad bin Yahya Tha'lab said: The Ha in 'Innahu' refers to youth, and that is permissible even if he did not mention it, because gray hair indicates it. This is the saying of Ibn al-A'rabi. Al-Asma'i said: He means that he grew old so she became familiar with him.\n\nAbu al-Tayyib said: \"To God belongs your goodness, for the best speech is what your tongue uttered.\"\nAl-Anbari said: \"He has said:\n'I see that nearness became turning away / And the long greeting became brevity.\nYou left me today in confusion / I die times and live times.\nIf people were from their time / They would be the darkness and I the day.'\nAnd he said:\n'I march to his cutting (iqta') in his clothes / At the edge of it from his house with his sword.'\nAnd he said:\n'Until when the greed of the blamer / And there is no opinion in love for the wise.\nIt is wanted from the heart to forget you / And nature refuses against the mover.'\nHe recited verses among which was:",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 40
  },
  {
    "serial_number": "6721007",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "'If what passed pleases you / Then a return to Homs in the coming (year).\nFor the polished sword with which / You killed is in the hand of the killer.'\n\nAbu al-Tayyib said: \"Is my excellence in these verses out of badness, if there was any, in others?\"\nI said: \"I do not know excellence for you, nor do I admit invention for you, if these verses which you imagine you are the forerunner to their meanings and the lord of excellence in them are stolen, pasted. In what preceded of their composition and what their authors initiated of their meanings is a distraction from repeating them and changing their words. It has been said:\n'But she wept before me, so weeping excited / For me her weeping, so I said the merit is to the precedent.'\n\nAs for your saying:\n'I see that nearness became turning away'\nIt is from the saying of some moderns:\n'She approached then turned away for a sin / My father is ransom for one whose nearness returned as distance.'\n\nAs for your saying:\n'I die times and live times'\nIt is from the saying of Al-Abbas bin Al-Ahnaf:\n'By my life, the slanderers have made / Between me and you a kindling fire.\nAnd my soul, hung on hope / Dies times and lives times.'\n\nAnd your saying:\n'They would be the darkness and I the day'\nIt is from the saying of the other:\n'White, in her cheek is redness / Her neighbors, the short ones, fault her.\nThey are the nights and she is the day.'\n\nAnd your saying:\n'I march to his cutting (iqta') in his clothes...'\nIs from the saying of Ahmad bin Abi Tahir:\n'If I were of the children of Yahya I would not / Have increased, even if his father were my father.\nFrom his wealth is my wealth, and from his status / Is my status, and from his mount is my mount.'\nAnd Ahmad bin Abi Tahir took it from an old poet:\n'My flesh and what was mixed with flesh of my blood / And my status and value are from your wealth and money.\nIf my utterance did not undertake thanks / My right hand would inform of what you gave me and my left.\nAnd my skin and bone and joints told of it / And my slave and my palfrey and the freshness of my state.'\nYou also took his saying 'And my skin told of it' so you said:\n'My skin admitted them against me, so I / Cannot, until death, deny them.'\nThe origin in that meaning is the saying of Al-Nabigha Al-Dhubyani:\n'Indeed my old property, if I look, and my weapons / And my colt and what the fingers close on.\nAre your gift, and the white camels as if / The white oryx, the saddles rush upon them.'\n\nAnd your saying:\n'If he does not seek refuge for his glory with defects'\nIs from the saying of Kushajim:\n'People stared at your beauty, so seek refuge / From the evil of their eyes with one defect.'\n\nAnd your saying:\n'With splitting of hearts not splitting of pockets (clothes)'\nIs from the saying of a Bedouin:\n'And short of what I meet of the pain of passion / Hearts are split, nay pockets are split.\nWhen we looked at the watcher and his glance / And the lucky one over the glance of the watcher is a watcher.'\n\nAnd your saying:\n'And there is no opinion in love for the wise'\nIs from the saying of the first:\n'There is no youth among people whose affair is praised / Found but that he is in love a fool.'\n\nAnd your saying:\n'And nature refuses against the mover'\nIs from the saying of the first:\n'And how can I leave, O son of the mother of natures.'\nAnd the other said:\n'Affectation falls short of nature.'\n\nAnd your saying:\n'For the polished sword with which / You killed is in the hand of the killer.'\nIs from the saying of Amr bin Al-Ahtam:\n'For the Rudayni (spear) solid of knots / If you return in the darkness of the friend, returns.'\n\nWhat I cited dazzled him and restricted his speech. Al-Muhallabi admired that all admiration. Al-Anbari said: \"To God belongs Abu al-Tayyib in his saying:\n'Thus the days decreed among their people / Calamities of a people are benefits to a people.'\nI said: \"Rather to God belongs the goodness of Abu al-Atahiya in his saying:\n'The death of some people in the earth / Is upon others victories (openings).'\nExcept that Abu al-Tayyib is more noble in wording. The first who uttered this meaning was Amr bin Hilliza, brother of Al-Harith, in his poem the first of which is:\n'It was only what was to be / And the calamities of people in time are types.'\nThen he said following this:\n'Perhaps eyes were cooled by a grief / Painful, from which eyes became hot.'\nThis is his saying: 'Calamities of a people are benefits to a people.'\n\nAl-Anbari said: \"And among his virgin meanings is his saying:\n'And of the misery of the world on the free man is that he sees / An enemy for him whose friendship is unavoidable.'\nI said: \"The wonder is the saying of Al-Nazzam the Miserable:\n'And of the misery of the world on the free man is that he sees / An enemy whom he loves to be called a friend.'\nTo this meaning Ibn Al-Mubarak went by his saying:\n'Who is my guide to the path of my rectitude / Who is my helper, who seeks a path for me?\nThe calamities of time ceased not with me until / They left me to him whom I oppose, a friend.'\nAlthough Al-Qasim bin Yahya Al-Maryami, and it is likely you relied on him, has said in a poem beginning 'If your opinion in your affairs is piercing / Then be patient and do not be an overcomer of fate':\n'My soul is your ransom, harming or benefiting / Or ascetic in his slave or desiring.\nI would have struck what suppressed the enemy and was for me / A joy, and was upon the enemy calamities.'\n\nAnd Ibn al-Rumi has said:\n'Your enemy is gained from your friend / So do not increase in companions.\nFor the disease, most of what you see / Is from food or drink.'\nYou took the last verse of these two entirely, so you said:\n'The doctor says to me: You ate something / And your disease is in your drink and food.'\nThis meaning looks to the saying of Abu Nuwas, and its beginning was:\n'If a wise man tested the world, it revealed / To him an enemy in the clothes of a friend.'\nAbu Nuwas imitated in this saying Jarir:\n'They called passion until our hearts were shot / With arrows of enemies while they are a friend.'\n\nAl-Anbari said: \"Do you know for anyone this meaning:\n'Banu Ka'b, no hand made an impact in them / That the bracelet did not bloody.'\nI said to him: \"Not every meaning he stole is present with me, but I know for him in this poem:\n'They passed racing in limbs in it / For their heads by their legs is a stumbling.'\n'If he travels Al-Samawa without a guide / Their slain are for his eyes a lighthouse.'\nAs for his saying: 'For their heads by their legs is a stumbling', it is from the saying of Ibn al-Mu'tazz:\n'They made their skulls / In the dust legs.'\nAnd as for his saying: 'Their slain are for his eyes a lighthouse', it is from the saying of Dhu al-Rumma:\n'And a wasteland, empty, the sandgrouse is confused in it / The guides of its riders are the daughters of the she-camels.\nThe sturdy one who is decisive protects with it / With the strike of his palms the desert, riding.\nI cut it with ravines like arrowheads, so they became / With the family, happy in the backs of the deserts.'\n\nThen I said: \"This piece is of the verses of meanings.\" I turned to Abu al-Tayyib and said: \"Do you have anything to say about it?\" He turned away from my answer, and Al-Muhallabi looked up at him. So I said: \"He meant by his saying 'The sandgrouse is confused in it' due to its vastness and ambiguity, and he specified the sandgrouse, the most guided of birds. His saying: 'The guides of its riders are the daughters of the she-camels' is the saying of Abu al-Tayyib: 'Their slain are for his eyes a lighthouse'. The daughters of the she-camels are their foals they drop on the road from the fatigue of walking, they guide themselves by them. His saying 'Yuhayi' is from 'Hayat' (life), i.e., he keeps alive with it. His saying 'By the strike of his palms the desert' means he performs Tayammum with dirt and seeks water to give his companion to drink and does not perform ablution with it. 'Al-Nisal': Arrowheads, he likened the riders to them in their leanness and pallor. His saying 'So they became with the family' means they slumbered and slept, so they dreamed of their family in their sleep.\"\n\nAbu Sa'id al-Sirafi said: \"This is like the saying of the other:\n'Our youths impregnated the saddles / They did not leave of them a barren curve.'\nHe means they had wet dreams on the saddles.\"\nAli bin Isa al-Rummani said: \"This is like the saying of Di'bil:\n'I have not seen a knocked upon (host) settling with his guest / Nor a knocker (guest) giving wishes and graying.'\"\nAl-Muhallabi appreciated that. I said: \"And like it is the saying of Al-Ra'i:\n'The knowledge of drowsiness sufficed me, and I sufficed him / Watching the stars while slumber embraced him.\nSo he spent the night showing him his wife and daughters / And I spent the night showing the star where its setting places are.'\"\n\nI said: \"Like the saying of Dhu al-Rumma: 'The guides of its riders are the daughters of the she-camels' is the saying of the other:\n'A trackless desert, its guide smells the dirt / And there is nothing in it but the Yemeni, failing.\nI crossed it alone and did not fear death / My guide a star or a left-behind young camel.'\nHe says: The camels aborted from the intensity of marching in it, so they cast their fetuses, so they became like a lighthouse for its inhabitant to guide and lead by.\"\n\nAl-Muhallabi turned to Abu Sa'id and Abu al-Hasan al-Rummani asking them to explain and seeking more from them. They said: \"The matter is as he said, and thus Al-Asma'i mentioned.\" It pleased him.\n\nThen I said: \"And I know from that poem the saying of Abu al-Tayyib:",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 41
  },
  {
    "serial_number": "6721008",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Clarifying Treatise on Mentioning the Plagiarisms of Al-Mutanabbi and His Substandard Poetry",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "And among the misery of the world upon a free man is that he sees... an enemy whom he desires... whom he desires to be called a friend. Ibn al-Mubarak went towards this specific wish in his saying: 'Who is my guide to the path of my righteousness... who is my helper? Who will seek a path for me? / The calamities of time did not cease with me until... they left me as a friend to the one I treat as an enemy.' However, Al-Qasim bin Yahya al-Maryami is worthy and likely to be the one you relied upon, for he said in a poem beginning with: 'If your opinion in your affairs is piercing... then be patient and do not be one who tries to defeat destiny.' He said within it: 'My soul is your ransom, whether harming or benefiting... or abstaining from his slave or desiring him / You have achieved what repressed the enemy, and it was for me... a joy, while it was a calamity upon the enemy.' And Ibn al-Rumi has said: 'Your enemy is gained from your friend... so do not acquire too many companions / For the disease, the most you see of it... comes from food or drink.' You [Al-Mutanabbi] took the last verse of these two entirely and said: (The doctor says to me, 'You ate something'... and your disease is in your drink and the food). Looking at this meaning is the saying of Abu Nuwas, the beginning of which was: 'If the world tests a wise man, it reveals to him... an enemy in the clothes of a friend.' And Abu Nuwas imitated Jarir in this saying: 'They invited passion until our hearts were struck... by the arrows of enemies while they were friends.' Al-Anbari said: 'Do you know this meaning for anyone: (The Banu Ka'b, and nothing left a mark on them... a hand not muddied except by bracelets)?' I said to him: 'Not every meaning he plagiarized is present in my mind, but I know regarding this word of his: (They passed, their limbs racing within it... their heads stumbling over their legs) [and] (If one travels the Samawah without a guide... their dead bodies are landmarks for his eyes).' As for his saying: (Their heads stumbling over their legs), it is from the saying of Ibn al-Mu'tazz: 'They turned their heads... in the dust into legs [feet].' And as for his saying: (Their dead bodies are landmarks for his eyes), it is from the saying of Dhu al-Rummah: 'And a desolate desert where the sandgrouse is confused... the guides for its riders are the daughters of the she-camels / The enduring man who is prudent vies with it... with the strike of his palms upon the open land, a rider / I crossed it with mountain paths like arrowheads, so they became... with family, joyful in the backs of the deserts.' Then I said: 'This piece belongs to the verses of deep meanings.' I turned to Abu al-Tayyib [Al-Mutanabbi] and said: 'Do you have a remark regarding this?' He turned away from my reply, and Al-Muhallabi looked towards him expectantly. So I said: '[Dhu al-Rummah] intended by his saying \"the sandgrouse is confused in it\" to indicate its vastness and similarity [of terrain], and he singled out the sandgrouse as it is the most guided of birds. His saying: \"the guides for its riders are the daughters of the she-camels\" is the [source of] Abu al-Tayyib's saying: (Their dead bodies are landmarks for his eyes). For the \"daughters of the she-camels\" are their offspring that they drop on the road due to the exhaustion of the journey, so they use them as guides. His saying \"yuhayi\" is from life, meaning he keeps himself alive with it (or shies away/vies). And his saying \"with the strike of his palms upon the open land\" means that he performs dry ablution (Tayammum) with dust and saves the water for his companion to drink, not using it for ablution. \"Al-Nisal\" are the arrowheads; he likened the riders to them in their leanness and pallor. And his saying: \"so they became with family\" means they rested and slept, so they were carried to their families in their sleep.' Abu Said al-Sirafi said: 'This is like the saying of the other: (I have impregnated our young men with the saddlebags... they did not leave a curved rib of them barren).' He means they dreamt while on the saddles. Ali bin Isa al-Rummani said this is like the saying of Di'bil: 'I have not seen a visited one settling with his guest... nor a night-visitor giving desires and graying.' Al-Muhallabi admired that. I said: 'And similar to it is the saying of Al-Ra'i: (The knowledge of drowsiness sufficed me, and I sufficed it... guarding the stars while slumber embraced him / So it [slumber] began showing him his wife and daughters... and I began showing the star where its setting place was).' And I said: 'Similar to Dhu al-Rummah's saying: \"the guides for its riders are the daughters of the she-camels\" is the saying of the other: (A trackless desert, its guide sniffs the dust... and there is nothing in it but the Yemeni camel failing / I crossed it alone and did not fear death... my guide was a star or a left-behind camel foal).' He says: The camels aborted due to the intensity of the travel in it, casting their fetuses, so they became like landmarks for its inhabitants to use as guides.' Al-Muhallabi turned to Abu Said and Abu al-Hasan al-Rummani asking them for understanding and more details. They said: 'The matter is as he said, and strictly so did Al-Asma'i mention.' He was pleased by that. Then I said: 'And I know from that poem the saying of Abu al-Tayyib...'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 42
  },
  {
    "serial_number": "6721009",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "'So you were the sword, its hilt to them / And in the enemies are your edge and the blade.'\nThis is from the saying of the first:\n'Our swords divide us a division / Among us are their sheaths (coverings) and among them are their chests (blades).'\nAli bin Isa said: \"This is as the other said, recited to us by Muhammad bin al-Hasan Ibn Duraid:\n'Abd Amr disputes my cloak with me / Slowly, O brother of Sa'd bin Bakr.\nMine is the half which my right hand possessed / So take and wrap yourself with a half.'\"\n\nI said: \"And I know in it:\n'As if the ray of the sun's eye is in him / So in our eyes from him is a refraction.'\nThis is the saying of the other:\n'If she sees me, she turns away from me / As if the sun turns from my direction.'\nAnd I know from it his saying:\n'The cold of the white swords replaced them from them / And their heads belong to him, with them borrowed.'\nThis is as if it is from the speech of the Sufis.\"\n\nAl-Anbari said: \"Do you know for anyone the like of his saying:\n'I hoped the night they traveled would reveal her wrist / So the tribe would stay without marching, bewildered.'\"\nI said: \"Yes, the saying of Mahmud Al-Warraq, and from him he took the meaning:\n'I said: Lift the curtain, let us enjoy our gathering / For the sun has not set from your face, the tired one.'\"\nAl-Anbari said: \"Where is this from that?\" I said: \"It is it, if you look closely.\"\n\nAbu al-Tayyib said: \"And in this word I say:\n'As for clothes, they become naked; and of her beauties / When she strips them, beauty is clothed naked.'\"\nI hastened him by saying: \"This is what you adhered to in his saying:\n'The adornment of clothes, even if her clothes were stripped / On the mattress from her, the stripping adorned her.'\"\n\nHe said: \"And in it I say:\n'As if they arrive at death out of thirst / Or smell from the spear a basil.'\"\nI said: \"You stole it from Al-Buhturi:\n'They crowd for fighting at the battle / Like the crowding of thirsty camels for a watering place.'\"\n\nHe said: \"And in it I say:\n'I do not ask for more upon what is in you of generosity / I am the youth who slept, if alerted, awake.'\"\nI said: \"This is stolen from the saying of Abu Tammam:\n'The blessing of God in you, I do not ask God / Other than it as a blessing, except that it lasts.\nIf I did, I would be like one who / Asks him, while he is standing, to stand.'\nJarir has said:\n'Indeed I and your love, if you wanted an increase / In love with me, you would not find an increase.'\"\n\nAbu al-Tayyib said: \"And in it I say:\n'Upon you from yourself, if you are alone, is a watcher / You did not do in secret what you did not do openly.'\nI said: \"This is stolen from the saying of the other:\n'For whom do I not see, I turned away from everyone I see / And became upon my heart a watcher for its killer.'\nAl-Abbas has said:\n'I lower my eyes if I look at other than you / As if you have a watcher over my heart.'\"\nThat angered him, and Al-Muhallabi ordered patience with him, and signaled to me.\n\nAbu Al-Ala Sa'id bin Thabit, who was at the time replacing Al-Muhallabi, said: \"I appreciate the saying of Abu al-Tayyib about Sayf al-Dawla:\n'The noble walk on the traces of others / And you create what you come to and innovate.'\n'Whoever's position is above the place of the sun / Nothing raises him nor lowers him.'\"\nAl-Muhallabi said: \"This is a virgin (original), no one said it.\" Then he turned to the group and said: \"Do you know this for anyone?\"\nAbu al-Hasan al-Ansari, who was clinging to the tails of literature, said: \"Refer to Tawwab who extracts the theft,\" meaning me. He said: \"What do you have?\"\nI said: \"The first is stolen from the saying of Al-Sanawbari:\n'Was it not enough for you that you were found following / In generosity, until you were found inventing?'\nAs for the second, it is stolen from the saying of Bani Dulamah, and some of our companions narrate it for Mani:\n'If a people were to sit above the sun out of generosity / It would be said: Sit, O family of Abbas.\nThen ascend in the ray of the sun, all of you / To the sky, for you are the masters of people.'\nThe first who spoke this meaning was Zuhair in his saying:\n'If a people were to sit above the sun out of generosity / By their firsts or their glory, they would have sat.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 43
  },
  {
    "serial_number": "6721010",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "When the wave of this speech covered Abu al-Tayyib, he said: \"Slowly! As for what you criticized me of theft, what makes you know that I intended it? The speech of the Arabs takes some by the necks of some, and takes from some. Meanings struggle in the chests, so they occur to the predecessor at times and to the later one at other times, and words are shared, permissible. This is Amr ibn al-Ala who was asked about two poets agreeing in wording and meaning despite the difference between them and the distance between their lands, so he said: Those are minds of men that coincided on their tongues. Furthermore, who is this who is stripped of following, and singled out with invention and innovation? I do not know a Pre-Islamic nor Islamic poet except he has imitated and followed, and attracted and imported.\n\nThis is Imru' al-Qais saying:\n'A chest gathered, as if its construction / Is raised on the head of a trimmed palm trunk.'\nHe only relied in it on Abu Duwad:\n'And a neck advanced, no defect in it / Like the trunk cleared of the leaf bases.'\nHe also said:\n'As if the whistling birds of the valley in the morning / Were given a drink of spiced pure wine.'\nHe only relied in it on Abu Duwad al-Iyadi:\n'You think its whistling birds in the forenoon / Amidst the deserts are drunken drinkers.'\nImru' al-Qais said describing a horse:\n'As if my boy when he topped the condition of his back / Was on the back of a hawk in the sky, soaring.'\nWhich is from the saying of Abu Duwad:\n'If his rider wishes, he embraces him / As a hawk embraces the wing to itself.'\nImru' al-Qais said:\n'Attacking, fleeing, advancing, retreating together / Like a boulder of rock the torrent brought down from above.'\nHe only relied in it on Abu Duwad in his saying:\n'Puffing, throwing, helping, artful / Mixing, separating, recalcitrant, exiting.'\nImru' al-Qais said describing lightning:\n'And its brightness calms at times, and at times / It rises as the broken-winged bird rises.'\nHe relied in it on Abu Duwad also in his saying:\n'And it expanded rising the rise of the broken / The water pushed it until it flowed.'\nAdi bin Zaid took it from both of them saying:\n'And my love after the calm, winds drive it / As the broken is driven.'\nThis is the Prince of Poets. And after him Al-Nabigha, and a group has prioritized him over him, said:\n'And you think her in the house when you surprised her / A lit lamp that was hidden.'\nHe only relied in it on the saying of Imru' al-Qais:\n'She lights up the darkness in the evening as if she is / The lamp of the night of a devoted monk.'\nZuhair said:\n'He stabs them, they did not shoot, until if they stabbed / He struck, until if they struck, he embraced.'\nHe only relied in it on the saying of Muhalhil:\n'They pulled the strings of the bows and flashed / As stallions threaten stallions.'\nAl-A'sha said describing the phantom:\n'My debt twists me in the morning and I demand / And my debt if drowsiness struck the sleepers.'\nHe only took it from the saying of Amr bin Qami'a:\n'Umama distanced except for a question / And except for a phantom meeting a phantom.\nIt meets with the night, her appointment / And refuses with the morning except departure.'\n\nI said to him: \"From here Qais bin Al-Khatim took:\n'How did you travel un-traveling / And dreams bring near a non-near one?\nYou did not prevent my wakefulness, so you may give it / In sleep, not restricted nor calculated.'\nAl-Buhturi took this and said:\n'My soul is ransom for one who distances, and her remembrance nears / And her phantom gives and she refuses.'\"\n\nHe said: \"And Al-A'sha took his saying:\n'You spend the night in the winter full, your bellies / And your female neighbors are hungry, spending the night empty.'\nFrom the saying of Al-Ash'ar:\n'It is not right for neighbors to neighbor / This one a brother of satiety and that folding the intestines.'\nThis is Ubayd bin Al-Abras who took his saying:\n'And people blame the misguided if they / Missed correctness, and the guided is not blamed.'\nFrom the saying of Al-Muraqqish the Elder:\n'Whoever meets good, people praise his affair / And whoever is seduced fails to find a blamer for error.'\nAl-Akhtal said:\n'As for the back, it is of a white brocade / And on the legs like tattooing with tar.'\nHe only took it from the saying of Al-Musayyab bin Alas in his saying:\n'As if on the back is brocade / And the black of legs think it tar.'\nThis is Jarir who took his saying:\n'I am chaste in poverty, sharing in richness / Swift to move if I am not pleased with my house.'\nFrom Al-Munakhkhal Al-Sa'di in his saying:\n'Indeed calamities afflict me in richness / And I am chaste at the scarcity of poverty.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 44
  },
  {
    "serial_number": "6721011",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "And for Jarir in satirizing Al-Farazdaq:\n'The branches of disgraces flow upon them / And they were for its evils a settling place.'\nAnd for Al-Farazdaq in satirizing Jarir:\n'You are the settling place of every mine of evil / And for every flowing thing that flows, a settling place.'\nThey both took it from A'sha Bahila in satirizing Al-Raqqad bin Amr Al-Ja'di:\n'Banu Hisn are the settling place of all meanness / Likewise for every flowing thing a settling place.'\nAnd Al-Farazdaq took his saying:\n'Short-haired, led, and in the chase as if they are / Eagles of a cloudy day and light rain.'\nAnd took his saying:\n'And possessor of a husband, our spears married her / Lawful to who builds (consummates) with her, she was not divorced.'\nFrom Sulayk bin Al-Sulaka in his saying:\n'And how many a widow our spears married / And another over an uncle and maternal uncle grieving.'\n\nThen he said: \"This is a small portion of a lot that gathering and exhaustion cannot cover, let alone what the instinct helps with and memory dictates for discussion.\"\n\nThe Vizier looked up at his speech, and the group listened to his saying, and showed appreciation which what he brought did not deserve.\nI said to him: \"As for your saying that the meaning struggles in the chest so it occurs to the predecessor at times and to the later one at others, and that words are shared, the matter is not as you imagined, nor is all speech shared, nor is the first not more entitled to it than the last. If it were so, the virtue of the forerunner would fall, and the precedence of the advanced would be void, and the Pre-Islamic poets would not have been prioritized over the Islamic poets, nor the first generation of Islamists over the first generation of moderns. They were only judged with preference, and precedence surrendered to them because of what they innovated of meanings, preceded to of metaphors, invented of valid similes and wandering proverbs, and smoothed of the rugged paths of poetry; and because they did not envy each other by theft, importing, transfer, and attraction.\n\nDo you not see the saying of Qurad bin Hanash Al-Murri satirizing Banu Auf:\n'When they gather in their clubs, they squat / The sitting of the tribe's maids around the slaughterhouses.\nIf they speak, they say what was said before them / And if they arrive [at water], they circle through the returning ones.'\nJarir taunted Al-Farazdaq for his importing, so he said:\n'You will know who his father is a blacksmith / And whose poems are known as importation.'\nWhen Ka'b said:\n'So who is for the rhymes, checking them, who weaves them / If Ka'b passes and the success of Jarwal?'\nMuzarrid bin Dirar, brother of Al-Shammakh, objected to him and said:\n'I passed by Ka'b and imagined my wild beasts (verses) / Wild beasts rising above Ka'b and Jarwal.\nDid you wade a sea people fell short of / Of poetry, or did you say what was not said?'\nIbn Harma said mentioning people who stole his poetry and borrowed his meanings:\n'I feed an inheritance of poems, I fix them / The fixing of the decisive one for needs and order.\nI prepare poems for the narrators, remaining / As if they are among them embroidered suits.\nEither erotic poetry, or praise of possessor of pride / Remaining, or storing from those of error.\nUntil when their ears were filled with wonder / And they stopped in the hearts of people like honey.\nThey dropped to them to dive in their pastures / They did not knock the mothers of the Shul (camels) for pregnancy.\nThey explored a mind they do not reason with / And placed the sitting of the gathered among the neglected.\nI do not share with them the paths of their stallion / Nor in a plain do I graze with them nor a mountain.\nI cease not to see my brand and recognize it / In another herd branded on a front.\nI did not brand young camels while they were grazing / Until they came despite the fetters and shackles.'\n\nWhat is your saying: Who is this who is stripped of following and imitation, and walking the path to which others preceded him of poets? By my life, the matter is as you mentioned, except that speech is not praised if it is forest-like (dense/confused), nor meanings if repeated. So the poet should not permit the bulk of his poetry, upon examination, to be stolen pasted, and collected fabricated, nor to increase reliance in his poetry, and theft to support his speech. The path of the imitator is to take the meaning without the wording, then to fold it if it is exposed, and reveal it if it is hidden, and improve the expression of it, and choose the sweet meter for it, so that it becomes fragrant to the ears and attached to hearts. Do you not see the saying of Al-A'sha:\n'Leave us and a people if they intended for us / Abu Thabit, and sit for you are fed.'\nAl-Hutay'ah took it, improved the expression of it, and fulfilled the meaning in it, so he became more entitled to it than its inventor by his saying:",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 45
  },
  {
    "serial_number": "6721012",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "'Leave noble deeds, do not travel to seek them / And sit, for you are the fed, the clothed.'\nAnd just as Imru' al-Qais said:\n'And no like of a day in Qudharan I shaded it / As if I and my companions were on the horn of a gazelle.'\nAl-Murrar took it and revealed it and said:\n'As if the hearts of their guides / Are hung on the horns of gazelles.'\nAnd just as Al-Muraqqish said about two lion cubs:\n'No day passed but they have / The meat of men or they lap blood.'\nImru' al-Qais looked a look and said:\n'As if the hearts of birds, wet and dry / At her nest are jujube and worn-out dates.'\nThat is because Imru' al-Qais went to the idea that the eagle is provided for and that the game is with her; to this Al-Muraqqish went in describing the lioness, that she is provided for and that prey is abundant with her.\n\nIf you contemplate the verses you argued with, you will find much of the taken in them surpassing the taken from, advancing in the field of clarity, judged in it for the taker with excellence, or equal to him all equality.\nOf equality is the saying of Imru' al-Qais:\n'If it were a soul dying together (at once) / But it is a soul falling as souls (pieces).'\nAbd bin al-Tayyib took it, revealed it, sharpened it, and equaled in it who preceded him, saying:\n'The perishing of Qais was not the perishing of one / But it is the building of a people that collapsed.'\nSimilar to this is the saying of Al-Nabigha Al-Dhubyani:\n'The headscarf fell and she did not intend its falling / So she picked it up and guarded herself from us with the hand.'\nAbu Hayya Al-Numayri took the meaning and did well, all wellness, for a subtle addition he added in his saying:\n'So she cast a veil, other than it is the sun (like the sun), and guarded herself / With the best two connected things: a palm and a wrist.'\nEquality became obligatory for him by this addition, but preference was not given over Al-Nabigha because of Al-Nabigha's precedence in inventing this meaning. The addition is his saying: \"Other than it is the sun\", meaning like the sun, and his saying: \"With the best two connected things\".\n\nBut for the poet to import a meaning and fall short of fulfilling it as you fell short, and do badly in expressing it as you did, and fall forever below the first, then there is no bearing with him, nor permissiveness in it, nor judgment of excellence in any of it. Do you not see the saying of Tarfa:\n'By your life, indeed death, what mistakes the youth / Is like the loosened long rope whose two ends are in the hand.'\nAl-Ra'i took it and fell short, all shortness, in it by his saying:\n'And I know that death, O Umm Amir / Is a companion whose rope surrounds me from behind me.'\nLook at the disparity between the two speeches despite the precedence of the advanced one to the meaning.\nAnd Tarfa said:\n'So if I am to be eaten, be you my eater / For some deaths of people are more honorable than others.'\nAbdullah bin Al-Hajjaj Al-Tha'labi took it and said:\n'So if I am to be eaten, be you my eater / And if I am to be slaughtered, be you the slaughterer.'\nHe did badly, all badness, and exchanged for us that proverb and eloquent wording with what demonstrated the dullness of his edge and the stinginess of his flint.\nAl-Murrar said mentioning the male ostrich:\n'Possessor of a cloak that was empty on his chest / Black, rough from spinning.\nAnd a white piece (shaqiqa), not long / From his knees, little of surplus.'\nHis saying: \"Rough from spinning\" is because of the variegation of his feathers. He likened the blackness of his upper parts and chest to a black cloak that was empty on him. And he likened the whiteness of his lower parts to his knees to a white piece (shaqiqa), which is what is split in two, because if it reaches his knees it is cut off. Al-Tirimmah took this, shortened his wording, and improved the expression of it by his saying:\n'Wearing a cloak of striped cloth for his back / As a loincloth, and what is other than it, the striped cloth surrendered.'\nHe says: His back is striped.\n\nAl-Nabigha said describing a wild bull, and it is of his meanings which he was not preceded to:\n'From the wild beasts of Wajra, his legs are marked / Folding the intestines (lean) like the sword of the polisher, the solitary.'\nAl-Tirimmah took it and added the best addition, and became because of it more entitled to the meaning by his saying:\n'He appears and the lands hide him as if he is / A sword on a height being drawn and sheathed.'\nHe likened him in the two states of his appearance and hiding to the sword in the two states of its drawing and sheathing.\n\nSome Arabs said:\n'She was proud against me that her beauties were complete / A tender girl in whose sides temptations speak.\nShe intended coming to us until when she looked / In the mirror, her beautiful face forbade her.'\nAbu Nuwas pointed to this meaning a hidden pointing and added a subtle addition, saying:\n'She looks in the mirror and says: Here now / I am the sun about which there is no doubt.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 46
  },
  {
    "serial_number": "6721013",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "'I, by God, am fit for sins / If the people of sins commit them.'\nLook at his subtlety in taking, and his good approach to following and imitating.\"\n\nThen I said: \"I have not found them praising the poet's increasing of following, and his increasing of taking and stealing, for that from him indicates the narrowness of scope, poverty and imbalance, and the shortness of mind, dullness of thought, and cowardice of instinct.\"\n\nAl-Muhallabi admired what I brought, and emphasized the instruction to whomever he had appointed of his scribes to record what happened, control it, collect it, and fulfill it. He said: \"We only come to you once in a while, so if we come to you, improve the hospitality.\" He rose angrily, so Al-Muhallabi ordered him to be returned, so he was returned compelled, but he did not prolong the sitting and rose. When he departed, Al-Muhallabi turned to me and said: \"I want you to negotiate speech with him regarding the poetry of Abu Tammam and Al-Buhturi, and test what he has regarding them.\"\n\nA week passed and he did not summon him, nor did he attend initiating, then he attended and apologized for his delay. Abu Ali Al-Anbari had dragged the ropes of greed for him, and promised him from Al-Muhallabi what was far from reaching him, due to Al-Muhallabi's bad opinion of him. He signaled to me to run with him what I had marked for you of running.\n\nI asked him to recite his word whose beginning is:\n'O burning of his heart for one whose heart is cold / And who has, regarding my state and body, a sickness.'\nHe hesitated a little, then began and recited it until he reached his saying:\n'And the horses, and the night, and the desert know me / And the war, and the strike, and the paper, and the pen.'\nThe group appreciated this verse an appreciation in which they exceeded.\nI said: \"He only took it from his two Imams.\"\nHe said: \"And who are my two Imams whose poetry you annexed, whose sanctity you tore, whom you attacked, and whose knowledge you denied?\"\nI said: \"Abu Tammam and Al-Buhturi. As for Al-Buhturi, he said:\n'O my two friends at Al-Sawajir from Udn / Bin Ma'n and Buhtur bin Atud.\nSeek a third other than me, for I am / The fourth of the white camels, the darkness, and the deserts.'\nAs for Abu Tammam, he said, and upon him Al-Buhturi relied:\n'The white camels, and worry, and the complete night together / Are three forever joined in a horn (rope).'\nAbu Tammam imitated in it the saying of Al-Shanfara:\n'And I have besides you a family: A wolf, swift / And a leopard, smooth, and a hyena with mane.\nThree companions, a brave heart / And a drawn white sword and a long yellow bow.'\nTo these two verses Dhu al-Rumma looked in his saying:\n'And a night like the cloak of the bride, I wore it / With four, while the person in the eye is one.\nA deaf Hilafi sword, and a sharp white one / And a reddish-white Mahri camel, and a noble terrified one.'\"\nOne of those present, and I think it was Al-Anbari, said: \"What does the night resemble of the bride's cloak?\" So I held back.\nAl-Muhallabi said: \"What do you say?\"\nI said to him: \"The night does not resemble anything of the bride's cloak except its length and ampleness.\"\nAl-Muhallabi said: \"Then what does he intend by his saying:\n'With four, while the person in the eye is one'?\"\nI said: \"He intends that he looked at this group gathered in the darkness of the night, so he imagined them as one person.\"\n\nHis hearing was struck by my speech with what awakened his zeal, shook his determination for riot, and moved his outburst. He exemplified with the saying of the poet:\n'And things may be remembered by the thing after them / And the distinct enemy returns to affection.'\nAnd he said: \"As for your Abu Tammam who says:\n'He gulps sorrow, the singular swallowing has become empty / And leave the sip (Hisy) of an eye whose water ecstasy milks.'\nHe made the ugliest absurdity, and borrowed the furthest metaphor, by his making the eye a Hisy (water hole in sand), while Ahsa (plural of Hisy) are described by little water, and it is the nature of tears to be described by abundance by those of ecstasy and passion.\" The group was as if it listened to this saying.\n\nI said: \"The matter is not as you imagine, because Al-Hisy is the sand under which is a solid rock that returns the water, so the sand drinks the water until it reaches that rock. If they need water, they dig and extract thing after thing. This is the saying of the author of 'Al-Ain' and a group of people of knowledge. Abu Tammam borrowed 'Hisy' for the eye, because tears come out thing after thing, and this is a real metaphor not a metaphor of exaggeration.\"\n\nHe held back for a little while then said: \"Abu Tammam the sayer in this rhyme:\n'Thin of the edges of forbearance; if his forbearance / Were in your palms, you would not doubt that it is a Burdah (garment).'\nDid anyone before him praise anyone for thinness of forbearance? Describing it with gravity and thickness is more appropriate. Do you not see the saying of Adi bin Al-Riqa':\n'You have good situations / And forbearances (dreams) for you that weigh the mountains.'\"",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 47
  },
  {
    "serial_number": "6721014",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "He said: \"Then he likened forbearance in its thinness to the Burdah, and the thinness of the Burdah is indicative of the looseness of its weaving, and that is not of its descriptions nor praiseworthy qualities.\"\nHe said: \"And in this poem he says:\n'Do not think Hind has treachery alone / It is the nature of a soul; every beautiful woman is Hind.'\nHe only took it from the saying of Al-Adbat bin Qurai' Al-Sa'di. He was their master, then he saw envy from them, so he departed from them and settled among others, but saw them in the same condition, so he said: 'Wherever I go I meet Sa'd', i.e., people are like my people in their envy of their masters.\"\nI said to him: \"There is no clearer proof of Abu Tammam's virtue than his taking this speech and organizing it in that easy, sturdy, far, near expression.\"\n\nHe said: \"And Abu Tammam the sayer:\n'I say to a Qurhan (un-ulcerated/inexperienced) of separation who did not host / The creeping of passion between the entrails and the chest bones.'\nWhat is 'Qurhan al-Bayn' (un-ulcerated of separation), may God silence his tongue?\"\nI said to him: \"He means a man whom his loved ones did not cut off, nor did his mates separate from him, nor did passion visit him, nor did ecstasy enslave his patience. The origin in this word is that the Qurhan is the one who did not have smallpox. Jarir said:\n'And I was, regarding the sighs of love, a Qurhan (free/inexperienced).'\n\nIn this word Abu Tammam says:\n'And riders driving the mounts, a glass / Of marching (Sira) which the palm of a gatherer did not intend.\nThey ate the humps from them by night travel / So their figures became like the humps.'\"\nAbu al-Tayyib said: \"As for the first verse, it is from the saying of Abu Nuwas, until you contemplate the second verse:\n'A people who passed around on the saddles among them / The cup of night travel, so the given drink and the cupbearer became intoxicated.\nAs if their heads, while drunkenness lowers them / On the shoulders, were not inserted in necks.'\nAbu Nuwas took it from the saying of Abu Dahbal:\n'I say while the riders, their turbans have tilted / And sleeplessness has given the people the cup of drowsiness to drink.'\"\n\nI said: \"And in this poem Abu Tammam says:\n'He sees the ugliest of things is the return of a hoper / Whom the hand of the hoped-for clothed in the suit of a loser.\nAnd better than a blossom which dew opens / Is the whiteness of gifts in the blackness of demands.'\"\nHe said: \"As for the first verse, it is taken as a raid from the saying of Al-Akhtal:\n'They saw whiteness in blackness as if it is / The whiteness of gifts in the demands.'\"\nI said to him: \"This verse is from the fabrications of Ahmad bin Abi Tahir out of prejudice against Abu Tammam. Otherwise, who is this who narrates poetry, and in which poem is it, and in which copy of Al-Akhtal's Diwan is it found?\"\nHe said: \"And what motivated Ahmad bin Abi Tahir to this, and what cause necessitated it from him?\"\nI said: \"Is he not the sayer:\n'Al-Buhturi, if you searched his lineage / In Buhtur, in Banu Thu'al.\nBoth of them suspect regarding his lineage / And his heart from his suspicion is in fear.'\"\n\nThen I said: \"And in this poem Abu Tammam says:\n'And Al-Afshin knew, and he is the one by whom / The cloak of the kingdom is protected from every puller.\nThat you, when the matter rubbed you and clothed itself / In hides blown in the faces of calamities.'\"\nI said: \"This is the lacking, the miraculous, the greed-inducing, the impossible, the near, the far, the easiest rugged.\" And I recited to him from it:\n'If poetry were to perish, it would have been perished by what settled / Your basins of it in the passing ages.\nBut it is the downpour of minds; when / Clouds of it clear, they are followed by clouds.'\"\nAbu al-Tayyib said: \"As for the second verse, it is from the saying of Aws bin Hajar:\n'I speak by what my cloud poured upon them / And my effort in the rope of the clan is a wood-gatherer.'\"\nI said: \"By God, if he took as you claim, he surely folded the taking, and added to the inventor in meaning a subtle addition by his saying: 'But it is the overflow of minds'.\"\n\nAbu al-Tayyib said: \"How can Abu Tammam be doing well in taking while he is the sayer:\n'Leading their forelocks is a Judhayl (rubbing post) of easts / When a worry returns to him, he is an Udhayq (date bunch) of wests.'\nHe took it from the sturdiest wording and clearest of some of the ancients:\n'And riders who, with the eyes of the stars, saw / The straying of the Mahara camels, so they were guided by the stars.\nThey are the sunrise of the easts once / And another time, when they disappear, the sunset of the wests.'\"\n\nThen he said: \"He is the one who says:\n'By my life, I would have freed the day I met him / If only fate alone did not chill.'\"\nI said to him: \"He is the beginner of this poem with his saying:\n'She began seeking refuge for the tear from fear of tomorrow's distance / And every sleeping place became tragacanth (thorns) to her.\nAnd what saved her from the flood of death was that it is / A repulsion of separation, not a repulsion of intentional hate.\nSo pity made flow for her a rosy tear / Of blood running over a rosy cheek.\nShe is the full moon, the affection of her face brings her near / To everyone she met, even if she did not show affection.'\nAnd in it he says:\n'But I did not contain gathered wealth / And won it except with a scattered reunion.\nNor did days give me a tranquil sleep / I enjoy, except with a displaced sleep.\nThe length of a man's stay in the tribe wears out / His two brocades, so go abroad, you will be renewed.\nFor I saw the sun increased in love / Because it is not permanent over them.'\"",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 48
  },
  {
    "serial_number": "6721015",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "Abu al-Tayyib said: \"As for his saying 'So go abroad, you will be renewed', it is from the saying of Laqit bin Zurara:\n'And whoever is addicted to the roast meat in the tribe wears out.'\nHe said: His saying 'For I saw the sun' is from the saying of Kuthayyir:\n'And if the sun of the day did not set, it would be boring.'\"\nI said to him: \"And who is there for you who utters the like of this and is capable of it, or takes a meaning and clothes it in an elegant exhibition, and casts it so its drinking place is sweet, and its intent is obscure to minds?\"\n\nI said: \"And in it he says:\n'And the spears had seen his heart / So the curtain of extended fate gave them ophthalmia.\nAnd I hope that He necklaces his neck / With the necklace of a polished, Indian sharp sword.\nStrung with death, its wearer attains its ornament / Its wearer among people without the necklace.'\"\n\nAbu al-Tayyib said: \"He is the sayer:\n'So you struck the winter in its two jugular veins / A strike that left it an old riding camel.'\"\nI said to him: \"He is the sayer beginning this word:\n'It is of the characters of height (length/tallness) not to answer / So it is correct for an eye to pour.'\nThis is of the best beginning. And in its erotic introduction he says:\n'Most of the earth visiting and visited / And ascending from passion and descending.\nAnd a buxom girl, as if / The heedlessness of youth clothed her in a new garment.\nThe separation showed her loss; rarely does she know / The loss of the sun until it sets.'\nAnd in its praise he says:\n'He preceded time with the old property and did not wait / For the calamities until they befall.\nAnd whenever the circumstances exempted him, his / Palms were accidents and circumstances.'\"\n\nHe said: \"Is he not the sayer:\n'Submissive to God, ruler of a nation / To those of arrogance (Tajahhum) in it, he has submission.'\nIf he had vomited his liver it would have been better than his saying 'Tajahhumha'.\"\nI said to him: \"The narration in this verse is 'Li dhawi takabburiha' (To those of arrogance in it). And 'Tajahhum' is taking the thing by oppression; therefore the lion was named Jahdam. In this poem he says:\n'Did the tears of your eye descend because / A pigeon cooed when the darkness cleared?\nDo not sob for her, for her weeping / Is laughter, and your weeping is infatuation.\nThey are the pigeons (Hamam); if you break in augury / From their Ha, then they are death (Himam).'\nThis is by everything a modern said (equal to all). And in it he says:\n'With the large-mouthed, noble (camels) as if / Their figures between the hills are hills.\nYou kindled the flint of determinations under the darkness / They lit your thought while the lands were dark.\nSo you rose dragging the tail of an army drove by / The goodness of certainty and led by advancing.\nClamorous, noisy, you see its vanguard / And they have in the pierced space a crowding.\nIt filled the desert in groups and almost seemed / To have no rear in it and no front.\nWith sweating, lean-flanked, slender ones / Their hanging is the saddling and the bridling.\nUnleashed towards deaths as if / Between deaths and them are wombs (kinship).\nLions of a thicket, hidden, they have no / Thickets except the sharp swords and spears.\nAnd the strike ties the chief of a battalion / Fierce of nature, while deaths are standing.\nSo you broke the handle of their gathering in it, and / The heads began to separate from their handles.'\nThen he said in it:\n'Treading on your heels in seeking heights / And the goal, then the feet become equal.'\nAl-Buhturi took this and said:\n'You possessed the goal by precedence, and he prayed second / Then the feet became equal after him.'\nAnd from here you took, O Abu al-Tayyib, your saying:\n'I saw Ali and his son, his people / And they are the best people, and the free and the slave became equal.'\nAnd you said in another place:\n'The served and the servants resemble each other.'\"\n\nAbu al-Tayyib said: \"He erred in his saying 'Kada bi-an yura' (Almost seemed) because what is heard from the speech of the Arabs is: 'Kada yaf'alu' (Almost did - without 'an').\"\nI said: \"It has come for some poets in describing a road:\n'It almost, from the length of wear, is erased (An yamsaha).'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 49
  },
  {
    "serial_number": "6721016",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "If you make 'Kada' mean 'Arada' (wanted), the entry of 'An' becomes good, as he said:\n'She almost (Kadat) and I almost (Kidtu), and that is the best will / If what passed of the connection of the beloved returned.'\nHe said: \"He took his saying: 'Their hanging is the saddling and the bridling' from the saying of the first:\n'She is wanted at the dirt of the watering places; if she refuses / Then the pasture is a journey, so riding.'\"\nI said to him: \"This, even if it is taking as you mentioned, is better than the taken from and more revealing of the meaning.\"\nHe said: \"But Al-A'sha has said:\n'And a desert as if it is the back of a shield / There is nothing but the return (cud/excrement) in it as a hanging.'\"\nI said to him: \"This is also not revealed all revelation, and saddling and bridling is more eloquent and clearer.\"\n\nHe said: \"Abu Tammam who says:\n'He turned away and did not oppress; and does a man oppress / Who urged the escape while behind him is the dragon?'\nHave you seen a human likened to a dragon? He only intended the saying of Kuthayyir:\n'He turns the two eyes of a snake in a shell.'\nOr the saying of Al-Akhtal:\n'Frogs in the darkness of a night responded to each other / So their sound indicated the sea snake.'\nThis is a school in praise which the Kings of Banu Umayya ceased not to be attached to in their poets, and announcing it in their praisers.\"\n\nI said to him: \"He is permitted that for his saying:\n'Poured upon it from the skulls of its people / Rains whose signs are necks and tear ducts.\nA sea of war, blowing; it has no / Ships except the skulls and the ribs.\nA king, the noble deeds light up if appears / For the kingdom from him a blaze and a forehead.\nHis shaking softened so he became mighty; and only / The back of the spear hardens when it softens.\nSo you left Arshaq, and she is called by her name / Deaf rocks, so springs soften from it.\nBabak met you roaring so he praised / And his roaring returned while it was a whine.\nAnd he hoped for the lands of the Romans, so became difficult with him / A term, deaf to safety, stubborn.'\"\n\nHe said: \"He is the one who says:\n'They were the cloak of their time, so they cracked / So as if Time wore wool.'\"\nI said: \"He is the one who says in this poem:\n'O dwelling that gave accidents their rule / No delay in a promise and no procrastination.\nDew anchored in your club, and winds breathed / A breath in your courtyard, weak.\nThe cloud was fond of your courtyards, and perhaps / Your hills quenched the wandering fond one.'\nIn it he says:\n'Days when no calamity attacks your people / Except it retreats turned away.\nAnd if accidents shot you with a glance / Your blades returned its glance blinded.'\nIn it he says:\n'If the water of the cloud sinks, you overflowed... / The liver of time, you were kind to me.'\"\n\nAbu al-Tayyib said: \"He is the one who says:\n'Ninety thousand like the lions of Shara, their skins / Ripened before the ripening of figs and grapes.'\"\nI said to him: \"For this verse is a news that necessitated its saying; if you investigated it, you would not permit attacking its sayer. If a sayer wished to say: No poem was opened with more concise nor shorter than his saying:\n'The sword is more truthful in news than books / In its edge is the limit between seriousness and play.'\nHe would not be blamed.\"\nHe said: \"Is this not from the saying of the first:\n'So do not increase the clamor regarding him, for / The sword erased what Ibn Dara said, all of it.'\"\nI said: \"The matter is as you mentioned. And you have imitated this meaning from Abu Tammam, so you said:\n'And do letters avail against an enemy / If the sword is not a calligrapher?'\"\n\nI said: \"In this poem Abu Tammam says:\n'A virgin (city), the hand of an accident did not deflower it / Nor did the ambition of calamities ascend to it.\nGod threw its two towers with you so He destroyed it / And if other than God threw with you, he would not have hit.'\"\nHe said: \"Is this in your Book?\" He disbelieved, may God curse him. \"'And you did not throw when you threw, but God threw.'\"\nI said: \"In it he says:\n'A victory the gates of the sky open for / And the earth appears in its new clothes.\nHe did not raid a day nor rise to a land / Except an army of terror preceded him.\nWhen he saw love with the eye's view, he became bankrupt / And war is derived in meaning from plunder (Harb/Harab).'\"\nHe said: \"Is this not from the saying of Al-Nabigha Al-Ja'di:\n'And we plunder the dark horses, their owner was / Stingy with them, and war is plundering in it.'\"\n\nI said: \"In it he says:\n'You saw the great rest, so you did not see it / Attained except on a bridge of fatigue.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 50
  },
  {
    "serial_number": "6721017",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "And you took this verse according to your custom, so you said:\n'And if souls are great / Bodies get tired in their desire.'\"\n\nHe said: \"And Abu [Tammam] is the sayer initiating:\n'What is with the dune of the sanctuary to a knot.'\"\nI said: \"Yes, this is the poem from which you took:\n'Like the branch in figure, and the gazelle in / Splendor, and the fawn of the gazelle in softness.'\nThen he corrected this and said:\n'And he did not resemble it, and he has no softness / In his neck, rather he resembled it in a long neck.'\nSo I said taking the first verse:\n'She appeared as a moon and swayed as a Ban branch / And smelled as ambergris and gazed as a gazelle.'\nSo what did you deny of this beginning and criticize him for? Did you not criticize his saying:\n'The announcer deafened you even if he made hear.'\nAnd no more wandering nor more concise than this was said in the beginning of an elegy after the saying of Aws bin Hajar. For the scholars of poetry entirely point to the saying of Aws:\n'O soul, be beautiful in anxiety.'\nAnd the saying of Abu Tammam, if you do not deny, is more fulfilling than it.\"\nHe said: \"It is taken from the first:\n'He announced Abu Al-Miqdam to me, so my view blackened / From the earth, and the hearing was blocked against me.'\"\nI said: \"It is from it, but what a difference between them in nearness, subtlety, and brevity. If there were nothing but the virtue of brevity, I would judge with excellence and give him precedence.\nAnd his saying:\n'The strangeness of distance was happy with Su'ad.'\nAnd his saying:\n'O Rama, you were the familiar place of every white antelope.'\"\nHe said: \"This is from the saying of Zuhair.\"\nAnd his saying in the beginning of another:\n'It has become easy for us to say and to do.'\nAnd the beginning of another:\n'Yes, O quarter whose people... / Distance has attained in you what it seeks.'\nAnd his saying:\n'We did not know the weeping of the yearning one like this.'\nAnd his saying:\n'O lightning, spend the night at the top of Al-Buraq / And go early in it with a pouring rain.\nAnd know that there is no / Share for your stars if they do not quench it.\nTraces upon which the tears of the cloud met / For long, and the tears of lovers.'\nThis is of the best beginning. Likewise his saying:\n'Take the tears of your eye from my determination / And preserve what the veil humiliated.\nO familiar with weeping, how many a separation / Cast a shadow, so it was a caller to a meeting.\nAnd the joy of returns is only / For one stopped at the grief of farewell.'\n\nThen I said: \"He is the one who says in the D-rhyme poem which you chanted in its beginning describing a flag:\n'Yes, the flag of the army, you returned with it / On a Thursday, high of forenoon, ransom him.\nI imagined a white eagle in the sides / Of the King flew with him and in his aim.\nPassing, its two braids flutter on / A brown back on the day of battle, his body.\nIts folds flap over a King / Who sees the chase of heroes as part of his expulsion.'\"\n\nAbu al-Tayyib said: \"Turn away from this. As for Abu Tammam the sayer:\n'And glory is not pleased that he be pleased that / He who hopes for you be pleased except with satisfaction.'\nThis, by God, is the raving that occupies the bellies of scrolls and extinguishes the fire of minds.\"\nHe said: \"And I see he heard the verse of Muslim, so he wanted to ride the speech and interlace it like the composition of Muslim and his interlacing in his saying:\n'She drew and drew, then her offspring was drawn / So the offspring of her offspring became drawn (maslul - also tubercular/wasted).'\nThis imagination of his made me laugh, and I said: \"Muslim, even if he repeated the word, his verse has a subtle meaning I will present. Al-Bahili presented it in the book 'Al-Ma'ani', and claimed that he means this redness was drawn from the vine by picking it, then drawn from the grapes by pressing it, then the juice was drawn from the jar by broaching it. And his saying:\n'So the offspring of her offspring became drawn'\nHe means the urine of its drinker. And he said after this verse:\n'The mixture was kind to her so it adorned her cup / With a necklace made for her as a crown.'\nHe means the mixture raised her so it made the necklace, and it is in the eye a crown. Abu Nuwas disputed this meaning with him and expressed it well by his saying:\n'The wine circulates upon us in a golden (cup) / A Persian endowed it with types of pictures.\nIts bottom is Kisra and in its sides / Are wild cows the knights hunt with bows.\nSo for the wine is what its pockets were buttoned on / And for the water is what the caps turned on.'\nAs for the saying of Abu Tammam: 'And glory is not pleased that he be pleased', the likes of you criticize it while you are the sayer:\n'So you shook with the worry that shook the entrails / Shakes of an eye, all of them are shakes.'\nAnd the sayer:\n'And from one ignorant of me while he is ignorant of his ignorance / And is ignorant of my knowledge that he is ignorant of me.'\nAnd you are the sayer:",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 51
  },
  {
    "serial_number": "6721018",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "'Two standers in two stands of thanks and giving / So his gift is a stand (Waqf) and their thanks is a stand.'\nAnd you are the sayer also:\n'And not one in this creation but a group / And not the some of all but you are the double.'\n'And not the double until the double reaches its double / And not the double of the double of the double but a thousand like it.'\n'O our judge, is this what you are worthy of? / I erred, neither the two-thirds is this nor the half.'\n\nI turned to him and said: \"Do you think you forgive Abu Tammam in the midst of this raving of yours or do you not forgive him? In the Dad-rhyme poem Abu Tammam says:\n'I have from days what, if it were / Facing the mustache of a sleeper, he would not have slept.\nDo not seek provision after its shying away / To seek it a lion if it sank.\nO Ahmad bin Abi Duwad, a call / I was humiliated by your thanks to me and it was untamed.\nWhen I drew you for calamities, I was sufficed them / And the sword does not suffice you until it is drawn.\nBe how you wish, in you are traits / To which hope has become delegated.'\"\n\nHe said: \"Is not Abu Tammam the sayer describing wine:\n'If it crept in the youth, he imagined his body / When it crept in it, a village of the villages of ants.'\"\nI said to him: \"As for the eloquent meaning, no criticism was found against it. Al-Akhtal has said:\n'It creeps a creeping in the bones as if it is / The creeping of ants in a sand dune pouring down.'\nThe first has said:\n'It creeps a creeping in the bones as if it is / The creeping of the daughters of the ants while they are spreading.'\nHassan bin Thabit said, and turned to another simile:\n'It creeps in the body a creeping as / The Dubba (insect) crept in the middle of a soft sand.'\nBecause of its creeping it was named 'Dabbabah'. Dhu al-Rumma said describing a gazelle that leaned in its sleep:\n'As if in the tribe, a creeper throws the dust with it / In the bones of the head, a trunk (nose).'\nHe said: \"As for me, 'village of ants' is far from my imagination and escapes my hearing. What is other than that has a face.\"\n\nI said to him: \"Count these trifles. Of the clearest proof that you have studied the poetry of this man, and disciplined yourself with his meanings, and followed his sect, and tracked his paths in it, is your tracking of these places against him and your specifying them, and your pointing to them and your criticism in them. Did your tracking and the tracking of your likes against him what you track brand Abu Tammam with the brand of deficiency, while he is the sayer:\n'People did not see a sun before her / Which set and she did not follow them with darkness.\nIf they could, they would have walked on their cheeks / And their foreheads, let alone on feet.'\nHe is the sayer:\n'Gray hair rose marking in my side-hair a plan / The path of destruction in it to death is a clear road.\nHe is the visitor shunned and the companion disliked / And the possessor of familiarity hated and the new patched.\nHe has a view in the eye, white, pure / But he is in the heart black, dark.'\nHe is the sayer:\n'If you shoot from a life whose extent has prolonged / It betrayed you until you did not find a drawing place (for the bow) in it.'\nHe said: \"This is taken from the saying of Al-Ba'ith:\n'And we give the Mashrafiyya (swords) their right / So they cut in our right hands and are cut.'\nAnd from his saying also:\n'Time fulfilled with it from its events an honor / And the sword passes times then breaks.'\nAnd Abu Tammam the sayer:\n'For the family of Wahb are palms, whenever they were begged / They did in the drought what the rains do not do.\nA people, you see them jealous over their glory / Until as if wealth without them is forbidden.'\nHe is the sayer:\n'My companions say in Qumas, and the night travel / And the steps of the led Mahri camels have taken from us.\nIs it the rising of the sun you seek to lead us to? / I said: No, but the rising of generosity.'\nFrom the second verse you took your saying:\n'And they ran a run in its orbits / So they cut its setting place and possessed the rising place.'\nHe is the one who says:\n'The delegations of the earth departed from his grave / Empty-handed, full of hearts.\nThey knew what they lost; indeed / The loss of the sun is known at sunset.'\nHe is the one who says:\n'I have not seen heights unless poetry is among them / Like the earth, unmarked, having no landmarks.\nOne sees as wisdom what is in it while it is humor / And he judges with what he judges with while he is unjust.\nWere it not for traits enacted by poetry, seekers of dew / Would not know from where noble deeds are approached.'\nHe is the one who says:\n'Stripped, a sword of opinion from his determination / For time, its polisher is silence and thought.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 52
  },
  {
    "serial_number": "6721019",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "'Sharp, if he shook it in the face of a calamity / The changes of Time came to him apologizing.'\nFrom the first verse you took:\n'The mind is bewildered in a sword whose origin is Rabi'a / And the Merciful is its maker and Glory is the polisher.'\nHe is the sayer also:\n'Let not the enemies think your isolation is a spoil / For to the source (return) is what the goal of the watering is.\nYou were nothing but the sword drawn for battle / So it was praised in it, then returned to the scabbard.'\nHe is the sayer also:\n'O King distant in his vision / And his generosity to the hoper of his generosity is near.\nThe veil is not distancing a hope for me from you / Indeed the sky is hoped for when it is veiled.'\nHe is the sayer also:\n'You increased my white marks (clarity) in extension and I was not / Dark, nor an unknown earth.\nBut favors, their huge bodies encountered me / White-faced, so they made me white-faced, white-footed.'\nHe said: \"It is taken from the saying of Abu Muhallim:\n'Aslam, so be safe, O son of every Caliph / And O ruler of the world and O mountain of the earth.\nI thanked you, for thanks is a nature of mine / And not everyone you bestowed a blessing on repays.\nYou revived my mention for me, and I was not obscure / But some mention is more notable than others.'\"\n\nI said: \"And he is the sayer:\n'And riders like the tips of spears, who stopped at night / On the like of them, and the night folds its darknesses.\nFor a matter upon them is that its beginnings complete / And not upon them is that its consequences complete.\nTo you we crossed the setting of the sun, whenever / We cut a desert, its deserts prayed for you.\nTo a taker of the egg of his kingdom from the tyrant / And his hoper comes early to him so he is his taker.\nTo a king who did not throw the bulk of his might / On a king except he humbled his side.\nFor in every highland in the lands and lowland / Are gifts not from him, yet they are his gifts.\nHe gave until he found no one to give / And fought until he found no one to fight.\nO night traveler, capture without watching / The heart of darkness or death you fear.\nFor Abdullah has spread the fear of his vengeance / On the night until its scorpions do not creep.'\"\n\nHe said: \"As for his saying: 'And riders like the tips of spears', it is from the saying of Kuthayyir:\n'She circumambulated disheveled ones like spears, asleep / With humble lights, dusty their courtyards.'\nAs for his saying: 'For a matter upon them is that its beginnings complete', it is from the saying of the first:\n'A youth of battle who rushed into it so he wore out / So the treacherous time betrayed his trial.\nIt was upon the youth to advance in it / And not upon him is what death committed.'\nAs for his saying: 'Its deserts prayed for you', it is from the saying of Bashar:\n'Whenever we lent a master from a tribe / The peak of a pulpit, he prayed for us and greeted.'\nBashar took it from Jarir:\n'Pulpits of a kingdom, all of them Mudari / Pray for us whoever we lent a pulpit.'\"\n\nI said to him: \"If Tammam was looking at these places, he surely took worn-out clothes and returned them with their embroidery fluttering, as the cheeks of gardens flutter after the rain. This was his doctrine in all the meanings he observed and pointed to. Do you not see the saying of the first:\n'Swords, by my life, O Saday bin Malik / Sharp, but where is the striker with the sword?'\nAbu Tammam imitated this:\n'The sword named death may be blunt / And the victorious man may return failing.'\nThis verse is invented by him. Then he said imitating the preceding verse and explaining this verse of his:\n'The bane of this is not to encounter a cutting place / And the bane of that is not to encounter a striker.'\nAl-Farazdaq said, mentioning a wife of his who died in childbirth, she who dies with her child in her womb:\n'And a sheath of a weapon I was stricken with, but I did not wail / Over it, nor did I send weepers over it.\nAnd within it is one of Darim, possessor of protection / If only the nights missed him, my nights.'\nAbu Tammam said regarding two small ones belonging to Abdullah bin Tahir, who died on one day, and he pointed to Al-Farazdaq's two verses a wondrous pointing, and increased subtle additions from a poem:\n'Two stars God willed not to rise / Except the return of the glance until they set.\nIndeed the bereavement of gardens while fresh / Is greater than of them gardens while withered.\nIf they were attributed, this one would be a withers / For noble deeds, and this one a shoulder.\nMy sorrow for those witnesses from them / If they were given respite until they became traits.\nIndeed the crescent, if you saw its light / You became certain that it will be a full moon.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 53
  },
  {
    "serial_number": "6721020",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "This is what he imitated and generated and expanded and increased in, and expressed well. From the chapter is the saying of the other:\n'I saw wealth earned by men / Deficient, if tested they are scoundrels.\nNeither does the possessor of wealth earn it by intellect / Nor by wealth are intellects earned.\nJust as the swamps of the earth are clothed in irrigation / And floods are turned away from its noble parts (highlands).'\nAbu Tammam took this meaning and shortened it in one verse, saying, and doing well all wellness:\n'Do not deny the void of the noble from wealth / For the flood is war to the high place.'\nOmar bin Abi Rabi'a said:\n'And when I came to her to complain to her / Some of what healed me (made me sick) and what befell me.\nMy mind strayed from her due to the intensity of ecstasy / And my tongue stuttered with the essence of my soul.\nAnd I forgot what I had gathered of speech / To say to her, and my clarity was absent from me.'\nAbu Hafs Al-Shatranji said following this path:\n'Love was built on injustice, so if / The lover was fair in it, he would be ugly.\nIt is not considered good in the description of passion / A lover who is good at composing arguments.'\nAbu Tammam said summarizing this meaning:\n'Why do you deny when I loved my stupidity / And the skill of the yearning one is to be stupid.'\nContemplate what is between the two speeches, you will find a far difference.\nAbu Tammam heard the saying of Ibn Al-Zubair at the killing of his brother Mus'ab: \"Consolation and solace are for the prudent men, and panic and anxiety are for the mistresses of the curtained chambers.\" He organized this and did well all wellness in his copying and composition by his saying:\n'We were created men for endurance and sorrow / And those beautiful women for weeping and funerals.'\nHe heard the saying of the sayer \"Things loved are coupled with things hated\", so he said, and surpassed the surpassing of the forerunner racer when the knights ask him to run in a race where horses stumble in seeking him:\n'He strove and brought down hope by force / Were it not for striving, there would be no endeavor.'\nLook at the saying of Aban Al-Lahiqi:\n'The soul will not know bliss and its might / If it is ignorant of the state of humiliation and harm.'\nAbu Tammam took this meaning and improved its molding and casting, saying:\n'And accidents, even if their misery hits you / It is what informed you how their bliss is.'\nUbaydullah bin Abdullah bin Tahir tried to take this meaning, but fell short of it by his saying:\n'Let not a state whose height elevated you make you forget / What is in its consequences, and remember its change.\nFor the youth is ignorant of blessings if they are continuous / Until he is stung by trial, then he knows them.'\n\nAnd of Abu Tammam's excellence in taking is his saying:\n'If they raided and contained the wealth of a group / Favors raided them and contained them.'\nThis expression delights and pleases, and deceives and enchants. He only imitated in this verse of his the saying of Urwa bin Al-Ward in two verses:\n'A noble who saw poverty as shame, so he ceased not / Roaming the lands of God until he became wealthy.\nWhen he gained wealth, he returned with spending it / On who came to him seeking his dew, hoping.'\nContemplate Abu Tammam's abbreviation of this meaning and his good expression of it. Ibn al-Rumi undertook taking it, but could not fulfill it except in four verses, necessitating each other, which are:\n'There is no one on earth more generous than Shuja' / Even if he gives the little of gifts.\nThat is because he gives you from what / The tips of the spears return to him.\nAnd sufficient for you is the generosity of one who gave you wealth / He contained it by chase and combat.\nHe bought his blood to contain it, so when / He contained it, the praise of men fell with it.'\n\nAl-Suli informed me, saying: I heard Abu Malik say: Whoever can take the meaning and do with it the deed of Abu Tammam, [let him do so], otherwise let him not expose himself to it. He said: So I said: Like this? He said: Like the saying of Abu Nuwas:\n'Give them glad tidings before the following gift / Like the lightning appearing before a pouring rain.\nAnd the rain, its fall is hidden to the glancer / As long as he does not find it by the indication of the lightning.'\nAbu Tammam looked at this and said:\n'He brings down the distant hope with his cheerfulness / The glad tidings of the cloud with the pouring spring.\nAnd so clouds rarely call to / Their kindness the scouts as long as they do not flash.'\nThen he abbreviated the meaning in one verse saying:\n'Cheerfulness is only a garden, so if / It is followed by giving, then a garden and a pool.'\nAl-Buhturi imitated this meaning and said, and brought it in several places where he fell short, until he said:\n'Cheering, open, if he promised wealth / With cheerfulness, he followed his cheerfulness with the gift.\nLike the cloud, if the flashes of its lightning laughed / They cleared with it for a continuous rain or a downpour.'",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 54
  },
  {
    "serial_number": "6721021",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "Abu al-Tayyib said: \"We refrain from this. Do you find for this Abu Tammam of yours or your Buhturi a meaning they invented?\"\nI said: \"Can their inventions be exhausted by discussion, or can research and debate cover a single part of them?\"\nHe said: \"Bring one meaning and you have the yield (victory).\"\nI said to him: \"Of Abu Tammam's inventions on which the consensus of narrators fell is his saying:\n'It refuses against restriction (Tasrid) anything but a gift / If it is not pure, unmixed, it is mixed.\nIntentionally, as you forced the wandering breath / From the musk pod that was not opened.'\"\n\nHe said: \"This is from the saying of the Bedouin:\n'When we disputed the dropped conversation / Hastily, and the affection from her softened so she gave hope.\nWith the event of abandonment and an hour of negligence / From the tribe, fearing eyes that might look.\nShe sprinkled with a speech that almost healed from passion / Our livers almost cut for it.\nJust as the thirsty forced the falls of a cloud / Piled up, its cloud turned away when it quenched.'\"\n\nI said to him: \"How far is the distance between the two meanings. I do not find you attracting that except because of the saying of this one 'As he forced' and the saying of Abu Tammam 'Intentionally as you forced'. Words are permissible, except a subtle metaphor or a pun or an antithesis, for these are specific to their owners. If another comes with them after a first, he is judged with theft, although it is within the metaphor that a last and a first arrive at some of that.\"\nAl-Muhallabi said: \"O Abu al-Tayyib, you wronged Abu Tammam in this claim against him a wrong in which there is no doubt.\" He turned to me and said: \"Complete your speech.\"\n\nI said: \"And of his inventions is his saying:\n'If God wants to publish a virtue / That was folded, He makes available for it the tongue of an envious one.\nWere it not for the burning of fire in what it neighbored / The good scent of the oud would not be known.'\"\n\nAbu al-Tayyib said: \"As for the first verse, the meaning is common.\"\nAl-Muhallabi said: \"Like what?\"\nHe said: \"The saying of Zuhair:\n'Envied for what was of generosity / God does not strip from them what they were envied for.'\nAnd the saying of the other:\n'And blessings and envy do not separate.'\nAnd the saying of the other:\n'Envied, and the worst of people in station / Is he who did not spend a day while he is envied.'\"\n\nAl-Muhallabi said: \"This is also prejudice. The two meanings do not correspond, even if they are both about envy. Do you not see that his saying:\n'If God wants to publish a virtue / That was folded, He makes available for it the tongue of an envious one'\nIs not from the saying of Zuhair: 'Envied, God does not strip from them what they were envied for', nor from the saying of the other: 'The worst of people is he who is not envied', nor from the saying of the other: 'And blessings and envy do not separate', even if all of that is in one meaning and one way?\"\nI said to him: \"This is a chapter of expansion in meaning which resembles the taken but is not taken, and this is a station only the rough-footed climbs.\"\nAbu al-Tayyib said: \"He took his saying: 'Were it not for the burning of fire' from the saying of Bashar:\n'Like the holder of musk, a puff indicated him.'\"\nAli bin Isa the Grammarian said: \"If he did that, then by God he did well, all wellness.\"\n\nAl-Muhallabi said, turning to me: \"Bring what is present with you of his inventions.\"\nI said: \"And of his inventions is his saying:\n'The seeker went astray with you from where he is guided / And the days harmed with you from where they benefit.'\nAnd of his marvels:\n'It pleases you to meet him in the front of a council / And in the throat of enemies and in the heart of a procession.\nHe has a character, if it were in water it would not decrease / And in the rain, no man would see a lightning of deception.'\nAnd his saying:\n'My two friends, after sorrow and burning, stop / And do not stop the overflow of pouring tears.\nIf the sword of death is black, rusty / The edge of a white sharp sword has been notched from it.\nIt struck a man whose precious wealth was / Upon him, when asked, not precious.\nAnd no calamity missed a great thing with him / But it is of the mothers of great things.'\nAnd of his inventions is his saying describing spears:\n'Educated (straightened), they robbed the Romans of their blueness / And the Arabs of their brownness and the lover of leanness.'\nAnd his saying:\n'The sword, as long as no polisher is found in it / From itself, does not benefit from polishing.'\"\n\nHe said: \"This is from the saying of Imru' al-Qais:\n'He is called polished while he has no / Covenant with polishing nor polisher.'\"\n\nAnd his saying:\n'And accidents, even if their misery hits you / It is what informed you how their bliss is.'\nAnd his saying:",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 55
  },
  {
    "serial_number": "6721022",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "'And the sword is nothing but a piece of iron; if you left it / On the first creation, it would not cut.'\nAnd his saying:\n'The sweetest of men to women in locations / Is he who is most similar to them in cheeks.'\"\nHe said: \"This is from the saying of Al-A'sha:\n'And I see beautiful women do not connect with a man / Who lost youth, and they may connect with the beardless.'\"\nAbu Sa'id the Grammarian said: \"Abu Tammam's verse, if you were fair to him, is more poetic, even if Al-A'sha's verse is more traveling (famous).\"\n\nAnd of his inventions is his saying:\n'My denial of whiteness (gray hair) has been long, and if I lived / A thing (time), I would deny the color of blackness.'\nAnd his saying:\n'Whoever returned returned, he did not win his need / And a seeker of success did not fail who did not fail.'\nAnd his saying:\n'They said: Do you weep over a trace? I said to them / He whom the eye missed, the trace guided his longing.'\nAnd his saying:\n'And whoever does not submit to calamities, his / Traits all become calamities upon him.'\nAnd his saying:\n'Traces upon which the tears of the cloud met / For long, and the tears of lovers.'\nAnd of his marvels is his saying in the descriptions of camels:\n'The pleasing you whatever you compelled their noses / And the guiding you while they are the fleeing straying ones.\nIf I complained of a land I became in / It was the might, except that they are humble.'\nAnd his saying:\n'Whenever the decree comes to you, you will not be found perishing / But a time that assassinated your like is perishing.'\"\n\nAl-Muhallabi said: \"In some of this is sufficiency. Does any of Al-Buhturi's inventions occur to you?\"\nI said: \"His saying:\n'If she strutted, her sides diffused fragrance / As the acceptance (east wind) strutted on the garden.\nHer coquetry is beautiful, and death is in it / And the polished sword may be deemed beautiful.'\"\nAbu al-Tayyib said: \"The first verse is from the saying of Abu Nuwas describing wine:\n'As if we are with it between the sides of a garden / If we robbed it of its scent from the night.'\"\nAbu Sa'id al-Sirafi said: \"How far is this meaning.\"\nHe said: \"Say what is closer to it and more similar.\"\nHe said: \"It is more similar to the saying of Al-Shanfara Al-Azdi:\n'So we spent the night as if the house was perfumed around us / With a basil that was watered in the evening and bedewed.'\nAnd the saying of the other:\n'Indeed I have at every breath of a garden / Of roses or of jasmine.\nA look and a turning, I hope / That you have settled in what follows us.'\nSimilar to it is the saying of Salm Al-Khasir:\n'As if she is a blossoming garden / The early morning breathed in it.'\nSalm took it from Bashar:\n'As if she is a blossoming garden / Gathering goodness and a beautiful view.\nShe appeared to my heart yellow (pale), scented / She poured upon us from her love a temptation.'\nHabib bin Isa the Scribe did well in his saying:\n'Your scent reminds me of a sick wind / That ran with the breeze of the garden in the darkness of dawn.'\"\n\nThen he said: \"And so is his saying:\n'And the polished sword may be deemed beautiful.'\nIt is from the saying of Abu al-Shis:\n'And like the sword, if it is not forbidden, its blade softens / And its two edges, if you roughened it, are rough.'\"\nI said: \"How far is this valley from that mountain path. If it be, it is a look and observation. But look at the moist, sweet words of Al-Buhturi, and at his sect in what he imitates and points to. For he did not summon from speech a repulsive one, nor sought the sympathy of one turning away, nor recited a stray one, nor felt at ease with a wild one. His words were above his meanings, and his ends were not separated from his beginnings. But Abu al-Shis took his saying from the saying of the other:\n'He is the sword; if he desists, his edge softens / And between his two edges are the looming deaths.'\"\n\nThen I said: \"And of Al-Buhturi's inventions also is his saying:\n'When we met and Al-Naqa was an appointment for us / The viewer of pearls wondered at goodness and its picker.\nFrom pearls she reveals at her smiling / And from pearls at conversation, its falling.'\"\nAbu al-Tayyib said: \"This is taken from the saying of the other:\n'She is pearls scattered when she speaks / And like pearls strung when she does not speak.'\"\nAl-Muhallabi said: \"And who is there for you who does well the wellness of Al-Buhturi in this taking of his, if he took it from him? Is he in that except like one who picked the bitterness of a fruit, or took a dung and returned it a jewel?\"\n\nI said: \"And of Al-Buhturi's inventions is his saying describing the phantom:\n'Are you serious? A phantom does not cease traveling to Zainab / If the darkness returns, it returns.\nIt traveled from the highlands of Sham, slumber brings it / The blowing of the breeze of the wind, the East wind brings it.'\nAnd of his invention is his saying:\n'Accustomed to wearing armor, you think them / In the cold silk, and in the midday heats mist.'\nAnd his saying:",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 56
  },
  {
    "serial_number": "6721023",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Al-Risalah Al-Muwadidhah",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "'Anemones carrying dew as if it is / Tears of youthful passion on the cheeks of the virgins.'\nAnd his saying describing [a pool]:\n'As if its streams in the low ground / Play with backgammon from its bubbles.'\n\nAbu al-Tayyib was dazzled by what I presented, and his obstruction (speechlessness) was reckoned, and his tongue was tied from answering, and he almost [spoke] were it not that the awe of the Vizier Abu Muhammad filled his heart. He was before dodging the debater the dodging of the debtor from tracking. When he reached in speech to this place, he rose angrily, and it was the last covenant with him in that house. He went out passing on his face, straying like the ostrich, and he did not stay except the time he prepared for travel. So he departed from Iraq heading to Kufa.\n\nThe young students of literature had belittled him, coveting him, until his skin was torn, and his honor was fabricated the fabrication of terrorism. A fool of the fools of the Baghdadis, a small one of their smallest scholars known as Ibn al-Hajjaj, became fond of satirizing him; he has no share in virtue nor foot in literature. It suffices him that he forced him, despite the baseness of his value and silliness of his ambition, to flee, and the goal was thrown, and the mounts were anxious in every direction. I had led him with the rein of belittlement the leading of the led horse. So he could not stay in the City of Peace, so he went out from it to Kufa, and from there to Fars, seeking Adud al-Dawla, and visiting Ibn al-Amid, and hoping to stay in their shelter, and shade himself with their shade or the shade of one of them. He did well in some of what he praised them with and did badly in some, and his material was restricted and his breath cut off before the goal. For he had exhausted his excellence in Sayf al-Dawla, and drowned his reach in his praise. So he was forced to depart and return to Iraq, but he was snatched away before that, and that was the last covenant with him.\n\nI append to this treatise what I tracked of his flaws, and stood upon of his theft, and of the lapse of his wording and silliness of his meanings. I mention also of the beauties of his poetry, and of the eyes of his eulogies—for praise was his food and the straying of his verses—what I run in all of it with the truth which cannot be transgressed, fair and seeking justice from him, not decreasing his right, nor attributing to him what is not his. I single out a book for that and exhaust it, and reach the limit that ability reaches in it, by the power of God and His strength, favor, and compassion. The treatise is completed, and praise be to God, and the favor is to God alone, and His blessings be upon our master Muhammad the Prophet and upon his family and companions and peace be upon them completely. The completion of copying it was agreed upon by the hand of the poorest of God's servants and most in need of His pardon and forgiveness, Muhammad bin Abdul Malik bin Asakir Al-Shafi'i Al-Ba'labakki, may God forgive him, on Friday the ninth of Shawwal, the year seven hundred and seventeen, praising and praying.",
    "foot_note": "None",
    "book_id": "777",
    "new_page_number": 57
  }
]