[
  {
    "text": "Wiping over Socks and Sandals\nAuthor: محمد جمال الدين بن محمد سعيد بن قاسم الحلاق القاسمي\nYear: 1332",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Wiping over Socks and Sandals",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 1
  },
  {
    "text": "sn: 4705\nbook_title: المسح على الجوربين والنعلين\nbook_link: https://shamela.ws/book/343\nbook_id: 343\nauthor_name: محمد جمال الدين بن محمد سعيد بن قاسم الحلاق القاسمي\nauthor_year: 1332\nnickname: Null\nauthor_link: https://shamela.ws/author/478\nauthor_ID: 478\neditor: قدم له العلامة أحمد محمد شاكر; حققه: المحدث ناصر الدين الألباني\npublisher: المكتب الإسلامي - بيروت\nedition: Null\npages: 99\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: مسائل فقهية\ncategory_id: 19",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Wiping over Socks and Sandals",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 2
  },
  {
    "serial_number": "4613238",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Fiqh Issues\nBook: Wiping over Socks and Sandals\nAuthor: Muhammad Jamal al-Din al-Qasimi (d. 1332 AH)\nIntroduction by: The Scholar Ahmad Muhammad Shakir\nVerified by: The Muhaddith Nasir al-Din al-Albani\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nBook: Wiping over Socks and Sandals\nAuthor: Muhammad Jamal al-Din al-Qasimi (d. 1332 AH)\nIntroduction by: The Scholar Ahmad Muhammad Shakir\nVerified by: The Muhaddith Nasir al-Din al-Albani\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nAuthor: Muhammad Jamal al-Din al-Qasimi (d. 1332 AH)\nIntroduction by: The Scholar Ahmad Muhammad Shakir\nVerified by: The Muhaddith Nasir al-Din al-Albani\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nIntroduction by: The Scholar Ahmad Muhammad Shakir\nVerified by: The Muhaddith Nasir al-Din al-Albani\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nIntroduction by: The Scholar Ahmad Muhammad Shakir\nVerified by: The Muhaddith Nasir al-Din al-Albani\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nVerified by: The Muhaddith Nasir al-Din al-Albani\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\n[Book pagination matches the printed version]\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nShamela Publication Date: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 3
  },
  {
    "serial_number": "4613239",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 1,
    "volume_number": 1,
    "text": "Wiping over Socks and Sandals\nAuthored by the Scholar of the Levant, Muhammad Jamal al-Din al-Qasimi\nIntroduction by the Scholar Ahmad Muhammad Shakir\nVerified by the Muhaddith Nasir al-Din al-Albani\nAl-Maktab Al-Islami",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 4
  },
  {
    "serial_number": "4613240",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 25,
    "volume_number": 1,
    "text": "Statement that the Reference for Legal Rulings is the Noble Book Because it is the Origin of Origins\n\nKnow that the origin of every legal ruling is the Noble Book because it is the origin of origins, the source of sources, and the universal of universals. It is not possible for any legal ruling to exist without reverting to it and issuing from it. Even the Prophetic Sunnah has its origin in the Book of Allah Almighty, because it is a detailing of its generalities, a clarification of its ambiguities, and a method among the methods of deduction from it. Thus, any Sunnah, if a knowledgeable researcher searches for its origin, he will find it indicated in the Book of Allah Almighty, either from the text of a verse, its apparent meaning, its implication, its indication, its generality, or other modes of deduction known to the Mujtahid, some of which are mentioned in the art of Usul (Principles of Jurisprudence).\n\nIf you know this, then our issue here—the issue of wiping over socks—has its origin in the Noble Book, either from the generality of 'wiping' in the verse of Ablution (Wudu) or from other generalities.\nAs for the (First Generality), its support is the recitation of the genitive case (al-Jarr) in His statement: [25]\n\n{wam-sahu bi-ru'usikum wa-arjulikum} (wipe your heads and your feet). The apparent meaning is that the obligation regarding the feet is wiping, as narrated from Ibn Abbas, Anas, Ikrimah, Al-Sha'bi, Qatada, Ja'far Al-Sadiq, and the scholars of his lineage, may Allah be pleased with them all. According to the school of these Imams, the meaning of the verse is the obligation of wiping the feet directly, or whatever is upon them such as Khuff (leather socks), Jawrab (socks), or Tasakhin (foot-warmers) (1). Thus, it appears that the verse is a source for the Sunnah according to this recitation.\n\nAs for the opinion of the majority: That the obligation for the feet is washing, and diverting the recitation of the genitive case to the recitation of the accusative case (al-Nasb)—using the known justifications in their places—then the source for wiping the socks from the Mighty Book comes from (Other Generalities) in its verses, such as the verse {And whatever the Messenger has given you - take; and what he has forbidden you - refrain from}, and the verse {There has certainly been for you in the Messenger of Allah an excellent pattern}, and the verse {Say, \"If you should love Allah, then follow me\"}, and the verse {And obey Allah and obey the Messenger}, and their likes which are countless. The modes of deduction may be numerous, and some may be weightier due to the strength of branching and connection, and the facets of weighing evidence are not hidden from those well-grounded in knowledge. And Allah is the Granter of success and the Helper.",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 5
  },
  {
    "serial_number": "4613242",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 26,
    "volume_number": 1,
    "text": "(1) The Shi'a disagreed on this, so they did not allow wiping over leather socks, socks, or foot-warmers. [26]\n\nStatement of the Hadiths Attributed to the Prophet (peace be upon him) regarding Wiping over Socks and Foot-warmers (Tasamkhin)\n\nKnow that among the Hadiths of this chapter are those from which the permissibility of wiping over socks is derived from their generality, and those from which it is derived from their specificity.\n\nFrom the (First Type), which implies the permissibility of wiping over socks due to its generality and unconditionality, is the Hadith of Thawban, may Allah be pleased with him.\nImam Ahmad, may Allah have mercy on him, said in his Musnad (1): In the Musnad of Thawban, may Allah be pleased with him: Yahya bin Sa'id told us, from Thawr, from Rashid bin Sa'd, from Thawban, who said: (The Messenger of Allah, peace be upon him, sent out a military expedition, and they were affected by the cold. When they returned to the Prophet, peace be upon him, they complained to him about the cold they experienced, so he commanded them to wipe over the Turbans ('Asa'ib) and the Foot-warmers (Tasakhin)). Narrated by Abu Dawood in his (Sunan).\nThe scholar Ibn al-Athir said in (Al-Nihaya): ('Asa'ib) are turbans because the head is wrapped (yu'sab) with them. And (Tasakhin) is everything used to warm the foot, such as leather socks, socks, and the like; and it has no singular form from its own root wording.\nI say: The men of this Hadith are trustworthy and acceptable, as known by checking their names in the books of Rijal (narrators).\n\nAnd from the (Second Type), which mentions socks specifically in the text,",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 6
  },
  {
    "serial_number": "4613244",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 27,
    "volume_number": 1,
    "text": "(1) See Al-Musnad 5 / 275. Al-Maktab Al-Islami has printed it in an elegant edition in six volumes. [27]\n\nare the Hadiths of Al-Mughira and Abu Musa.\n\n(As for the Hadith of Al-Mughira), Imam Ahmad narrated it in his (Musnad) - within the Musnad of the Kufans - in the Hadith of Al-Mughira bin Shu'ba. He said: Waki' told us, Sufyan told us, from Abu Qays, from Huzail (1) bin Shurahbil, from Al-Mughira bin Shu'ba (that the Messenger of Allah, peace be upon him, performed ablution and wiped over the socks and the sandals). Abu Dawood narrated it in his (Sunan) in the (Chapter on Wiping Over Socks). Al-Tirmidhi and Ibn Majah also extracted it, both in the (Chapter on Wiping Over Socks and Sandals).\n\nAs for the (Hadith of Abu Musa), Ibn Majah narrated it in his (Sunan). He said: Muhammad bin Yahya told us, Mu'alla bin Mansur and Bishr bin Adam told us, Isa bin Yunus told us, from Isa bin Sinan, from Al-Dahhak bin Abd al-Rahman bin 'Arzab (2), from Abu Musa Al-Ash'ari (that the Messenger of Allah, peace be upon him, performed ablution and wiped over the socks and the sandals).\n\nMention of the Doubts Raised Against These Three Hadiths and the Answers to Them\n\nThe First Doubt: They said: In the chain of Thawban's Hadith (the first one), Rashid bin Sa'd appears",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 7
  },
  {
    "serial_number": "4613246",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 28,
    "volume_number": 1,
    "text": "(1) With a Zay like Zubayr; a Tabi'i who lived during the Jahiliyyah (Qamus). (2) With a Ra then a Zay like Ja'far; a Tabi'i (Qamus). [28]\n\nnarrating from Thawban. Al-Khallal said in his 'Ilal: Ahmad bin Hanbal said: It is not proper that Rashid bin Sa'd heard from Thawban because he [Thawban] died long ago. End quote. Meaning, it is defective due to disconnection because a narrator is missing between Rashid and Thawban.\n\n(The Answer) is that this objection only applies according to the school of thought that stipulates proof of hearing for connection. Imam Muslim strongly denied this in the introduction to his Sahih, considering it an invented opinion, and stating that what is agreed upon is that the possibility of meeting and hearing is sufficient for connection (1). Based on this, the disconnection in the Hadith is not certain, and the matter reverts to the men of its chain. If its men are trustworthy, it is Sahih (Authentic) or Hasan Jayyid (Good/Strong), suitable for use as proof. For this reason, Imam Ahmad included it in his (Musnad), relying on it as proof and conveying it as a Sunnah to be acted upon. Abu Dawood also extracted it and remained silent about it, and whatever he remains silent about is",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 8
  },
  {
    "serial_number": "4613248",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 29,
    "volume_number": 1,
    "text": "(1) I say: This possibility is realized, for Al-Bukhari mentioned that Rashid bin Sa'd witnessed Siffin with Mu'awiyah. It is known that the Battle of Siffin was in the year (36), and Thawban's death was in the year (54). So he was his contemporary for (18) years. If we recall that scholars considered him trustworthy - without significant disagreement - and that he was not accused of Tadlis (concealing defects in the chain), the result is that the chain is connected. Declaring it defective due to disconnection is rejected because it is based on the doctrine of those who stipulate proof of hearing for connection, which is the weaker view as indicated by the author, may Allah have mercy on him. What strengthens what we mentioned is that Al-Bukhari affirmed Rashid's hearing from Thawban, as mentioned in the words of Ahmad Shakir, may Allah have mercy on him. That is definitive proof of his meeting him, because Al-Bukhari, may Allah have mercy on him, is among those who stipulate proof of hearing for connection and that contemporaneity is insufficient. So reflect. [29]\n\nsuitable for deduction. Since there is no criticism of its narrators nor any apparent defect in it, it fulfilled the conditions of Hasan. And the Hasan is like the Sahih regarding using it as proof and acting upon what it contains. In summary, the utmost status of this Hadith is that it is Hasan and Salih (suitable), and that suffices. Moreover, mere disconnection is not a defect, for there are over ten disconnected Hadiths in Muslim, although their connection was established from another path, because the broken chain of a trustworthy narrator is not like that of others. Therefore, the Mursal narrations of trustworthy narrators were accepted, as established in its place (1). Our naming it Hasan follows the saying of some - as in Al-Tadrib - that the Hasan is that which has a slight, tolerable weakness. And according to the saying of Al-Baghawi: That what is in the Sunan are Hasan. These two opinions are valid in our view, even if the explanation of Hasan is famous otherwise. Imam Al-Nawawi said in (Al-Taqrib): It has been reported from Abu Dawood that he mentions in his (Sunan) the Sahih, what resembles it, what approaches it, and what",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 9
  },
  {
    "serial_number": "4613250",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 30,
    "volume_number": 1,
    "text": "(1) I say: After you have known the authenticity of the Hadith's chain and its connection, I do not see it useful to expand into creating remote possibilities for the sake of defending it. For what is established in the science of Mustalah (Hadith Terminology) is that the Munqati' (disconnected) Hadith is one of the types of Da'if (weak) Hadith due to the anonymity of the missing narrator. I do not know of anyone among the authors in Mustalah who stated the acceptance of Mursal narrations of trustworthy narrators absolutely like this; rather, there is a famous disagreement mentioned in its place. What he mentioned about disconnected Hadiths in (Muslim) does not negate the mentioned defect, as long as their connection was clarified from another path; otherwise, were it not for that, the defect would stand. So reflect. [30]\n\ncontained severe weakness he explained it, and what he did not mention anything about is Salih (suitable). (Al-Nawawi said): Based on this, whatever we find in his book unqualified, and no one else declared it Sahih or Da'if, then it is Hasan according to Abu Dawood, because what is suitable for argumentation does not fall outside of these two. In fact, Ibn Rashid said: Whatever (Abu Dawood) remained silent about may be Sahih according to him, even if it is not so according to others (1) (See Al-Tadrib). After all, the men of Thawban's Hadith are all trustworthy and acceptable, as known from checking their names in the classes of men (Tabaqat al-Rijal). You have known the answer to the doubt of disconnection in it, so it is strong, Hasan, and suitable for argumentation. And praise be to Allah.\n\nThe Second Doubt:",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 10
  },
  {
    "serial_number": "4613252",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 31,
    "volume_number": 1,
    "text": "(1) I say: There is no doubt among those knowledgeable in this noble science that there are Sahih chains in (Abu Dawood). However, one should consider what became famous among the later scholars that whatever Abu Dawood remained silent about is suitable for deduction, as mentioned by the author. Know that Abu Dawood's saying (.... then it is Salih) as quoted by (Al-Tadrib) bears the possibility that he means it is suitable for argumentation: and this is what Al-Nawawi followed. And it bears the possibility that he means it is suitable for citation (Isti'shad) because it is not severely weak, and this is what the Commander of the Faithful in Hadith, Al-Hafiz Al-Asqalani, chose. This is the correct view that I see for many reasons there is no room to mention now. But attention must be drawn to Abu Dawood's saying: (And whatever contained severe weakness, I explained it). The implication is that whatever contained non-severe weakness, he does not explain it, i.e., he remains silent about it. The result is that this is the intended meaning of his subsequent statement: (And whatever I did not mention anything about, it is Salih). So reflect and seek the truth, and do not be deceived by what is famous among people. [31]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 11
  },
  {
    "serial_number": "4613253",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 32,
    "volume_number": 1,
    "text": "Some discussed that the evidence from this Hadith is more specific than the claim, because the Hadith indicates the permissibility of wiping over Tasakhin (foot-warmers) in the case of cold specifically, because it was an answer to the questioner in that condition.\n\n(The Answer) is that it is established in the science of Usul that (A general wording derived from a specific cause acts upon its generality and is not restricted to the cause for which it was revealed). Imam Abu Ishaq Al-Shirazi said: The proof for this is (that the argument lies in the saying of the Messenger of Allah, peace be upon him, not the cause, so its generality must be considered).\nThe summary of the rule in this is that (The phrase that stands alone, its ruling is considered; if it is specific, it is taken as specific, and if it is general, it is taken as general, and is not restricted by the cause for which it was revealed).\nWhat is said about the General (Al-'Amm) is said about the Absolute (Al-Mutlaq) due to their sharing in rulings, as established in Usul. It is also established that (Leaving out details in describing a situation takes the status of generality in speech).\nIt is not said: That an affirmative action has no generality as stated by Usul scholars, because it is said: Their absolute statement is restricted to other than commands or prohibitions, because this is not a narration of his action so that it could be said: It only occurred in one specific manner. Rather, it is a narration of the issuance of a command for something or a prohibition against it, general in its categories absolutely, as chosen by Ibn al-Hajib and detailed in the extended books.\nFurthermore, what was narrated of his wiping, peace be upon him, over socks - which are Tasakhin - is not restricted by a condition [32]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 12
  },
  {
    "serial_number": "4613254",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 33,
    "volume_number": 1,
    "text": "neither by a command from him nor by an action. Similarly, what is authentic of his wiping, peace be upon him, during ablution over his turban - which is of the 'Asa'ib - is not restricted to one condition over another. More on this discussion will come, God willing.\n\nThe Third Doubt: In the Hadith of Al-Mughira (the Second One). They said: There is Shudhudh (anomaly) in it. The explanation is that Al-Marwazi said: Imam Ahmad mentioned Abu Qays - one of its narrators - and said: There is no harm in him, they rejected two Hadiths from him: The Hadith of Al-Mughira regarding wiping. As for Ibn Mahdi, he refused to narrate it, and as for Waki', he narrated it. Abu Dawood said in his Sunan: Abd al-Rahman bin Mahdi would not narrate this Hadith because the known narration from Al-Mughira is that the Prophet, peace be upon him, wiped over the Khuffayn (leather socks). End quote.\nAl-Sindi said: So he considered it weak and Shadh (anomalous). And (Al-Shadh) is: What an acceptable narrator narrates contradicting what is more reliable than it.\n\n(The Answer) is from several perspectives:\n(First): Weakening it based on what was mentioned is contradicted by Al-Tirmidhi validating it as Sahih. He said after extracting it in his Sunan: This is a Hasan Sahih Hadith, and it is the saying of more than one of the people of knowledge. Al-Tirmidhi's validation takes precedence over the weakening of others because Al-Tirmidhi is from the generation that came after that [of the critics] and examined everything said about it and saw that the truth lies in validating it. Similarly, [33]\n\nIbn Hibban corrected it (1), and he is also among those who investigated and scrutinized (2).",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 13
  },
  {
    "serial_number": "4613256",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 34,
    "volume_number": 1,
    "text": "(1) From Al-Jawhar Al-Naqi by Al-Mardini, page 74.\n(2) I say: This perspective of the answer is only valid if Al-Tirmidhi and Ibn Hibban were among the Imams who are meticulous in authentication like Imam Ahmad, Muslim, and others who weakened the Hadith. In that case, the opposition would be valid and the answer free from objection due to Al-Tirmidhi coming after them and being aware of what they criticized it for and [deciding] that it is not detrimental. However, since Al-Tirmidhi and similarly Ibn Hibban are known for leniency in authentication—to the extent that Al-Dhahabi said in the biography of Kathir bin Abdullah bin Amr bin Awf, after mentioning that Al-Tirmidhi authenticated a hadith of his despite him being accused [of lying] by Al-Shafi'i and others: Al-Dhahabi said: (Therefore, scholars do not rely on Al-Tirmidhi's authentication). I say: If the situation is as we described, the answer is weak. However, the Hadith has a Sahih chain, and what they criticized it with is rejected, as the author explained in the second answer. Even better than it is the explanation of Sheikh Ahmad previously on page 5/10; he excelled greatly in refuting those who criticized it for Shudhudh (anomaly) and Nakara (denouncement), may Allah reward him. The summary is that Huzail bin Shurahbil, the trustworthy narrator who narrated from Al-Mughira the wiping over socks, cannot be said to have contradicted the trustworthy narrators who narrated from him wiping over leather socks unless the incident was one and the same. Only then would Huzail's hadith be rejected due to contradiction and anomaly because it is impossible to accept both narrations. In the group's hadith from him: That he, peace be upon him, wiped during travel, and this is not in Huzail's hadith. This indicates they are two different incidents, and that the group narrated what Huzail did not narrate, and he narrated what the group did not narrate, so there is no path to Shudhudh. May Allah have mercy on Al-Shafi'i when he said: The Shadh Hadith is not that a trustworthy narrator narrates what other trustworthy narrators did not narrate, but rather that he narrates what contradicts trustworthy narrators. See (Ikhtisar Ulum al-Hadith) by Hafiz Ibn Kathir. Strangely, Imam Muslim, who criticized the Hadith for Shudhudh and contradiction, himself, when he extracted the hadith of wiping over leather socks in travel from the path of the group via Al-Mughira, also extracted it from another path via him adding the wiping over the turban. According to his method of criticizing Huzail's hadith for contradicting trustworthy narrators, he should have criticized the turban hadith as well. Rather, it is more deserving of criticism according to him because it is an addition in the same hadith of the group, i.e., in travel, and that is not the case with Huzail's hadith. [34]\n\n(Second) The investigating scholar Ala' al-Din al-Mardini (1) said regarding the refutation of Al-Bayhaqi's statement ('Abu Qays Al-Awdi and Huzail cannot be borne along with their contradiction of the eminent ones who narrated this report from Al-Mughira saying: He wiped over leather socks'), the purport of which is: This report was extracted by Abu Dawood who remained silent about it, Ibn Hibban corrected it, and Al-Tirmidhi said Hasan Sahih. Abu Qays Abd al-Rahman bin Tharwan was declared trustworthy by Ibn Ma'in, and Al-Ijli said he is Thiqah Thabt (Trustworthy, Firm). Huzail was declared trustworthy by Al-Ijli. Al-Bukhari extracted for both of them in his Sahih. Furthermore, they did not contradict the people with a conflicting opposition; rather, they narrated an additional matter to what they narrated via an independent path not contradicting it. So it is interpreted as two [separate] Hadiths, and for this reason, the Hadith was authenticated as mentioned. End quote.\nSimilar to this, Sheikh al-Islam Mansur Al-Hanbali said in Sharh Al-Iqna': Some spoke regarding the Hadith - meaning Al-Mughira's Hadith - because the known narration from Al-Mughira is (the leather socks). He said in Al-Mubdi': This does not serve as a preventer for the permissibility of narrating both wordings, so wiping is valid based on what was mentioned (i.e., socks).\nSimilarly, the scholar Mulla Ali Al-Qari said in Sharh Al-Mishkat:",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 14
  },
  {
    "serial_number": "4613258",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 35,
    "volume_number": 1,
    "text": "(1) In Al-Jawhar Al-Naqi, Hyderabad Deccan edition, page 74. [35]\n\nIt was said that the known narration from Al-Mughira is wiping over leather socks. It was answered that there is nothing preventing Al-Mughira from narrating both wordings, and the action of the Companions supported it. End quote. Their names and their number reaching sixteen Companions will be mentioned later.\n\n(Third) And this is our answer regarding the claim of its Shudhudh (anomaly), noting that Shudhudh has differences in its meaning and that it is not an absolute defect nor an agreed-upon one. The clarification is that Al-Suyuti said in Al-Tadrib (1) explaining Al-Nawawi's statement in the definition of Sahih: (It is what its chain connects with upright, precise narrators without Shudhudh or defect 'Illah') the purport of which is: It was said he did not clarify his intent by Shudhudh here, while three opinions regarding its type have been mentioned: (One): Contradiction of a trustworthy narrator to one more reliable. (Second): The uniqueness of a trustworthy narrator absolutely. (Third): The uniqueness of a narrator absolutely. He said the last two are rejected, so it appears he meant the first one here.\nSheikh al-Islam said: This is problematic because if the chain is connected and all its narrators are upright and precise, then apparent defects are negated from it. Then if its being defective is negated, what prevents judging it as Sahih? Therefore, merely one of its narrators contradicting someone more trustworthy or greater in number does not necessitate weakness; rather, it would be a case of Sahih and More Sahih. He said: I have not seen with that any of the Imams of Hadith stipulating the negation of Shudhudh expressed as contradiction. Rather, what exists in their practices",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 15
  },
  {
    "serial_number": "4613260",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 36,
    "volume_number": 1,
    "text": "(1) Page 14 - 15 of (Tadrib al-Rawi) [36]\n\nis prioritizing some over others in correctness. Imam Al-Nawawi said in the discussion of Shadh: (If the narrator does not contradict others by his uniqueness, but rather narrates a matter others did not narrate: if he is upright, a hafiz (memorizer), trusted in his precision, his uniqueness is Sahih. If he is not trusted in his memory but is not far from the rank of the precise narrator, what he is unique in is Hasan. If he is far [from that rank], it is Shadh, Munkar, and rejected). End quote.\nFrom this, it is known that Shudhudh is not a defect that impugns the correctness of the narration absolutely, but rather it is according to this detail, and that whoever is upright, a hafiz, trusted in precision, his uniqueness is Sahih.\nAmong those who objected to making Shudhudh an impugning factor in the correctness of Hadith is Imam Ibn Daqiq al-Eid. Al-Iraqi said: As for safety from Shudhudh and defect ('Illah), Ibn Daqiq al-Eid said in (Al-Iqtirah): (The scholars of Hadith added that to the definition of Sahih - he said - and there is a view on that according to the perspective of the Jurists (Fuqaha), for many of the defects used by Muhaddithun do not apply to the principles of the Jurists) (1). And",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 16
  },
  {
    "serial_number": "4613262",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 37,
    "volume_number": 1,
    "text": "(1) I say: The people of Mecca know its paths best. Reliance is only upon the Muhaddithun because it is their science in which they specialized, so they know it better than others. Every science is referred to its specialists and experts. The Muhaddithun agreed on stipulating safety from Shudhudh in the Sahih Hadith as is known from their books. The tracker of paths in the collections of Sunnah finds not a few Hadiths where trustworthy narrators differed in wording the texts, a difference where it is impossible to accept all aspects of difference. Rather, some must be preferred over others. The preferred is the Mahfuz (Preserved) and the outweighed is the Shadh (Anomalous), which is a type of weak Hadith. The Hadith of wiping over socks is Sahih, safe from Shudhudh as previously explained. Therefore, there is no room to accept the skepticism of one who erred and accused the Hadith of Shudhudh. It is a Sahih, Mahfuz Hadith, and the Muhaddithun agreed on its soundness. [37]\n\nIbn al-Salah said: (They may differ on the correctness of some Hadiths due to their difference regarding the presence of these descriptions in it (1) or their difference in stipulating some of them). End quote. Thus he stated that stipulating safety from Shudhudh is not agreed upon but disputed. Therefore, Imam Al-Khattabi defined Sahih as: What its chain is connected and its transmitters are upright. Al-Iraqi said: (He did not stipulate the precision of the narrator nor safety from Shudhudh and defect).\nIt is narrated that such conditions revert to the Ijtihad of the Mujtahids in investigating the narration. Therefore, their Musnads and Mukharrajat varied according to the variation of their conditions, as we detailed in the introduction to the book (Hayat al-Bukhari).\nEverything discussed regarding its correctness based on the Sanad (chain) and rules of terminology is from the aspect of observing its correctness as a chain. As for its correctness based on a matter foreign to it - which is called Sahih due to others (Sahih li-ghayrihi) - that is another type as will be explained.\n\nThe Fourth Doubt: The saying of Imam Al-Nawawi in Sharh Al-Muhadhdhab: Our companions argued (2)",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 17
  },
  {
    "serial_number": "4613264",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 38,
    "volume_number": 1,
    "text": "(1) Namely justice ('Adala), precision (Dabt), and safety from Shudhudh and defect.\n(2) In refutation of those who permitted wiping over thin socks (Previously mentioned in his expression). [38]\n\nthat it is not possible to walk continuously on them, so it is not permissible like [wiping on] a rag. He said: The answer to the Hadith of Al-Mughira is from several perspectives:\n(One): It is weak, weakened by the Huffaz. Al-Bayhaqi weakened it and reported its weakening from Sufyan Al-Thawri, Abd al-Rahman bin Mahdi, Ahmad bin Hanbal, Ali bin al-Madini, Yahya bin Ma'in, and Muslim bin Al-Hajjaj. These are the luminaries among the Imams of Hadith. Even if Al-Tirmidhi said: (Hasan Sahih Hadith), these are prioritized over him. In fact, every single one of these, if alone, is prioritized over Al-Tirmidhi by the agreement of the people of knowledge.\n(Two): Even if it were authentic, it is interpreted as applying to that upon which continuous walking is possible, to combine the evidences, and there is no generality in the wording related to it.\n(Three): Al-Bayhaqi, may Allah have mercy on him, narrated from the Master Abu Al-Walid Al-Naysaburi that he interpreted it as wiping over socks that had sandals on them, not that it was a sock alone and a sandal alone. As if he said: He wiped over his sandaled socks. End quote.\n\n(The Answer to that):\nAs for Imam Al-Nawawi's saying: (Our companions argued that it is not possible to walk continuously on them), a blind follower might see this as proof. But for the Muhaddith and Usuli, the proof is the Book and the Sunnah and what refers back to them from the rest of evidences. The law of debate dictates that the strong be repelled by the stronger, and the Hadith by its like or by a verse, not by opinion or analogy. Otherwise, it would be going towards what the people of opinion (Ahl al-Ra'y) were accused of (1).",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 18
  },
  {
    "serial_number": "4613266",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 39,
    "volume_number": 1,
    "text": "(1) Meaning the Hanafis who interpret some Hadiths according to their opinions to support the sayings of their Imams. You find some examples of this in my book (Ahkam al-Jana'iz wa Bida'uha) in the discussion of Prayer over the deceased and others. And I do not absolve others of the same, as you see in the interpretation of Al-Nawawi's companions of this Sahih Hadith. The author, may Allah have mercy on him, excelled in refuting them, may Allah reward them. [39]\n\nThere is no verse in the chapter rejecting this Hadith nor a Hadith rejecting it. Rather, there is what supports it from the Book and Sunnah as passed, and this is the proof known in Usul.\nAs for his saying: (It is weak, weakened by the Huffaz) then quoting its weakening from those mentioned, its answer is what we presented before - in the third aspect - of repelling the third doubt by opposing that with the authentication of those who authenticated it. Moreover, the basis of its weakening is the claim of its Shudhudh (anomaly), and we have clarified that Shudhudh is not a weakening defect absolutely. Rather, whoever is upright and precise, his uniqueness is correct, especially when supported by what was narrated in its meaning from the Hadith of Tasakhin mentioned previously and what strengthened it from the practice of the Companions as will come. Therefore, Imam Al-Tirmidhi authenticated it. It is not hidden that the weakeners, no matter how many, their argument for weakening is its Shudhudh, and you have known what is in that. So the context is not a context of preference by quantity and fewness, but a context of evidence, argumentation, and conformity to observed rules. Otherwise, numbers are not among the known proofs and arguments. Therefore, Usul scholars said (1) in the discussion of solitary reports (Khabar al-Ahad): That the practice of the majority contrary to it - i.e., contrary to the solitary report - does not prevent the obligation of acting upon",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 19
  },
  {
    "serial_number": "4613268",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 40,
    "volume_number": 1,
    "text": "(1) Jam' al-Jawami' in the discussion of Khabar al-Ahad. [40]\n\nit, because the practice of the majority is not a proof. They justified it saying that the proof is Consensus, and the practice of the majority is not Consensus because Consensus is the agreement of the Mujtahids of the Ummah, unlike the solitary report for it is a proof in itself.\nFurthermore, if we wanted to outnumber those who weakened it, we would outnumber them by multiples of what he has. For wiping over socks is reported from the Companions, among them Umar bin Al-Khattab (1), Ali, Abu Masud, Al-Bara', Anas, Abu Umama, Sahl, Amr bin Hurayth, Ibn Abbas, Ibn Umar, Ibn Abi Waqqas, Ammar, Bilal, Ibn Abi Awfa, Al-Mughira, and Abu Musa, may Allah be pleased with them. And from the Successors: Qatada, Ibn Al-Musayyib, Ibn Jurayj, Ata', Al-Nakha'i, Al-Hasan, Khilas, Ibn Jubayr, and Nafi', may Allah have mercy on them. The attribution to them will follow.\nThe fact that these chosen ones, may Allah be pleased with them, went to practice it supports the correctness of Al-Mughira's Hadith and strengthens and authenticates it without doubt, because if it wasn't their source, then something else with its meaning was. No one with the slightest grasp [of knowledge] hesitates in this. Moreover, the Hadith of socks was received with acceptance by Abu Hanifa, the Shafi'is, Ahmad bin Hanbal, Ishaq, Dawood Al-Zahiri, and Ibn Hazm. All of these are Imams of Fiqh and Ijtihad, and all of them used it as proof in the Fiqh recorded from them.\nIt is known in the art of Hadith terminology (2) that a Hadith is judged",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 20
  },
  {
    "serial_number": "4613270",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 42,
    "volume_number": 1,
    "text": "(1) It was in the two originals (From the Companions from Umar), and perhaps the correct is what we mentioned. (Z)\n(2) Tadrib page 15 [42]\n\nas Sahih if people receive it with acceptance (1), even if it does not have a Sahih chain (2). Abu Al-Hasan Ibn Al-Hassar said in Taqrib Al-Madarik 'ala Muwatta' Malik: A Faqih might know the correctness of a Hadith - if there is no liar in its chain - by its agreement with a verse from the Book of Allah or some principles of Sharia, so that compels him to accept it and act upon it. End quote.\nThis is called (Sahih due to others). And Sahih due to others is the counterpart of Sahih due to itself in argumentation and acting upon its implications and taking its generalities, specificities, absolutes, and restrictions. For knowing the correctness of a Hadith from a perspective other than the chain, there are paths and perceptions\n\n(1) Know that (Al) in his saying (Al-Nas / The People) is for specific designation, not inclusion, so it does not include non-scholars of Hadith. For how many Hadiths have Jurists or others received with acceptance while they are Munkar (denounced) and rejected by Hadith scholars, like the Hadith of Mu'adh that the Prophet, peace be upon him, said to him: By what will you judge? He said: By the Book of Allah. He said: If you do not find? He said: By the Sunnah of the Messenger of Allah, peace be upon him. The Hadith. It is Munkar as stated by the Imam of Imams Al-Bukhari, may Allah have mercy on him, and it is documented by me in (Silsilat al-Ahadith al-Da'ifah). Furthermore, the previous restriction which is (Scholars of Hadith) is not enough; rather, another restriction must be added to it, which is their agreement upon it, as indicated by what Al-Suyuti quoted in (Al-Tadrib) (1/67) from Al-Isfarayini that he said: (The correctness of a Hadith is known if it becomes famous among the Imams of Hadith without denial from them).\n(2) I say: Its implication is that it must have some chain, but it is not permissible for it to be very weak, as indicated by the words of Abu Al-Hasan bin Al-Hassar coming in the book. So the Hadith received with acceptance is not Sahih unless it has a chain suitable for consideration. It is that which is strengthened by reception. So memorize this for it is very important. [42]\n\nknown to the striving Jurist (Faqih Mujtahid) as established by Ibn Al-Hassar. By this, we answer about what we say is Sahih which Imam Al-Bukhari did not extract. That is because Al-Bukhari only extracted what was Sahih by way of the chain and did not extract what is Sahih absolutely. Therefore, Al-Bukhari said: I did not include in the Book of Al-Jami' except what is Sahih, and I left out Sahih narrations for fear of length. Similarly, Muslim said: Not everything I hold to be Sahih have I placed here; I only placed what they agreed upon. Hence, Al-Nawawi said in Al-Taqrib: They did not encompass the Sahih nor commit to it (1).\nMoreover, the apparent meaning of their words is that they left out what was Sahih from the perspective of the chain as well, which is the perspective of the Muhaddith, fearing length. So it is more likely they left out what is Sahih due to other than the chain, which is Sahih due to others. That is because Sahih due to others has no consistent rule, but is a matter known by one firmly grounded in Usul and Furu', eager to study the Prophetic guidance, knowing the secret of legislation, and grasping the reality of understanding in religion. Some verifiers used to call this method the method of (Acceptance of Reports by Inference) to parallel what Usul scholars discussed in the issue of (Rejection of Reports by Inference) as you see detailed in Al-Musawwada and other extended books of Usul. The phrase of Al-Musawwada is: Among what tips the scale for a report and gives it precedence is to be supported by the generality of the Book, Sunnah, Analogy, or rational meaning.",
    "foot_note": "None\n\nNone\n\nNone\n\nNone",
    "book_id": "343",
    "new_page_number": 21
  },
  {
    "serial_number": "4613274",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 43,
    "volume_number": 1,
    "text": "(1) Page 28 Taqrib and its explanation Al-Tadrib [43]\n\nMany Imams of Usul held that the Hadith received with acceptance yields knowledge, as does the Hadith supported by the practice of the Companions, and likewise what they differed on between accepting and interpreting, and what agrees with a verse from the Book of Allah Almighty or a rule and principle from the principles of religion and knowledge, or agrees with a prescribed matter an agreement that validates similarity between them (as you see in Jam' al-Jawami' and others and extended books of Hadith terminology).\nIf this is established, then the Hadith of socks is among what was received with acceptance (1), supported by the practice of the Companions, may Allah be pleased with them, agreed with the verse {wipe your heads and your feet} according to the recitation of genitive and accusative if returned to it, falls under the rule of removing hardship, and agrees with wiping over leather socks. All of these validate the narrated text greatly.\nIn summary, the two correctnesses combined in the Hadith of socks: Its correctness in terms of chain as stated by Al-Tirmidhi and Ibn Hibban and as we verified by repelling the alleged anomaly in it, and its correctness from other than the chain, which are the matters listed now. When a Hadith is authentic, there is nothing but hearing and obeying.",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 22
  },
  {
    "serial_number": "4613276",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 44,
    "volume_number": 1,
    "text": "(1) I say: You have known from what preceded that the Hadith received with acceptance is not Sahih except with two conditions, one of which is that it becomes famous among the Imams of Hadith without denial from them. This Hadith, although its chain is Sahih according to us, was denied by those you knew from the words of the author and Sheikh Ahmad Shakir. Therefore, I do not see it fitting to say: It is among what was received with acceptance. Rather, some accepted it and some rejected it. The truth is with the former definitively. The proof is its established chain. Yes, the practice of the Companions supports it and increases its strength as will come. [44]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 23
  },
  {
    "serial_number": "4613277",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 45,
    "volume_number": 1,
    "text": "As for Al-Nawawi's statement: If it were authentic, it would be interpreted as applying to that upon which continuous walking is possible to combine the evidences. The requirement is clarification regarding the sock: where is the evidence for stipulating that continuous walking on it be possible? It is known that a sock is other than a leather sock, and each has its ruling. If 'evidence' is stated absolutely in Usul, it does not refer [only] to the Book and Sunnah and what reverts to them. There is no contradiction except between two equivalent evidences, and there combination is sought; otherwise, the reliance is on the stronger. The stronger by agreement - and there is nothing in the chapter except the absolute mention of socks and the generality of Tasakhin in their Hadith.\nAs for his statement: And there is no generality in the wording related to it. It is said: This refers to what is mentioned in Usul that an affirmative action has no generality, so recounting it does not imply generality regarding types, modes of occurrence, or times. However, this is according to the school of those who do not hold generality of the shared term nor generality of modes of occurrence. As for those who hold generality in them, they hold generality in it as well. Verifiers restricted the claim of lack of generality in it to cases where evidence of generality, words of inclusion (like Socks and Tasakhin), is not found in the apparent wording. Otherwise, it conveys generality. Their proof is that what is narrated about him, peace be upon him, occurred in a specific manner, so it takes the meaning of the shared term. If some aspects are preferred, then so be it, and if equality is established [45]\n\nthen some by his action and the rest by analogy to it. It was objected that his action, peace be upon him, only occurred in a specific condition. It was answered by non-admission of restriction due to the possibility of multiple modes of the action's occurrence, as clarified by the scholar Al-Fanari in (Fusul Al-Bada'i').\n\nAs for his statement: That Al-Bayhaqi narrated from Al-Naysaburi that he interpreted it as wiping over socks that had sandals on them, not that it was a sock alone and a sandal alone, as if he said he wiped over his sandaled socks. He means by that what Al-Bayhaqi said in his Sunan. He narrated that and then said after it: I found an Athar for Anas indicating that, so he attributed to him that he wiped over socks whose bottoms were leather and tops were wool. End quote (1).\nThe scholar Ala' al-Din al-Mardini critiqued this in (Al-Jawhar Al-Naqi) saying: The Hadith - i.e., Al-Mughira's Hadith - came with the conjunction of sandals to socks, which implies distinction. So its wording contradicts this interpretation. The fact that Anas wiped over sandaled socks does not necessitate that the Prophet, peace be upon him, did likewise. So Anas's action does not indicate interpreting the Hadith with what its wording does not bear. End quote.\nIbn al-Humam said in Fath al-Qadir refuting this interpretation: Restricting permissibility to the presence of the sandal then is restricting the evidence - meaning the Hadith - and indication from its implication without cause. End quote. Meaning without",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 24
  },
  {
    "serial_number": "4613279",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 46,
    "volume_number": 1,
    "text": "(1) I say: Its chain from Al-Bayhaqi (1 / 285) is good, and the upcoming critique from Al-Mardini is very strong. [46]\n\nwhat calls for it, neither from its wording nor its implication. For its explicit meaning is that he, peace be upon him, wiped over the socks and over the sandals, each independently. This is supported regarding sandals by many Hadiths extracted in the collections of Sunnah:\n\n1 - Imam Abu Dawood narrated in his Sunan from Aws bin Abi Aws Al-Thaqafi that the Messenger of Allah, peace be upon him, performed ablution and wiped over his sandals and feet.\n\n2 - Imam Ahmad extracted in his Sunan from Aws bin Abi Aws who said: I saw my father performing ablution one day and he wiped over the sandals. I said to him: Do you wipe over them? He said: This is how I saw the Messenger of Allah, peace be upon him, doing.\n\n3 - Imam Ahmad also extracted from Aws who said: I saw the Messenger of Allah, peace be upon him, perform ablution and wipe over his sandals, then stand for prayer.\n\n4 - Imam Ibn Jarir al-Tabari extracted in his Tafsir from Aws also who said: I saw the Messenger of Allah, peace be upon him, come to a people's dump site, perform ablution, and wipe over his feet (meaning over his sandals on them to agree with his previous narration) (1).",
    "foot_note": "None\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "343",
    "new_page_number": 25
  },
  {
    "serial_number": "4613285",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 47,
    "volume_number": 1,
    "text": "(1) I say: It is more appropriate than this interpretation to say: over his sandals and feet. For it matches the first narration literally. Then know that these three Hadiths are in reality one Hadith where narrators differed in wording, but the meaning is one, which is the permissibility of wiping over sandals even if there are no socks with them. It is a Sahih Hadith extracted by those mentioned by the author and others like Al-Tayalisi in his (Musnad) (1113), Ibn Abi Shaybah in (Al-Musannaf) (1/190), and Al-Bayhaqi (1/286-287). I have discussed its chain in Sahih Abi Dawood. [47]\n\n5 - Al-Tabarani extracted from Abbad bin Tamim from his father who said: I saw the Messenger of Allah, peace be upon him, performing ablution and wiping over his feet (1).\n\n6 - Imam Ibn Jarir al-Tabari narrated in his Tafsir from Hudhayfah who said: The Messenger of Allah, peace be upon him, came to a people's dump site, urinated on it, then called for water, performed ablution, and wiped over his sandals (2).\n\n7 - Al-Bazzar narrated with a Sahih chain from Ibn Umar that he used to perform ablution while his sandals were on his feet and wipe over them, saying: Thus the Messenger of Allah, peace be upon him, used to do. (Hafiz Ibn Hajar cited it in Takhrij Ahadith Al-Hidayah). Al-Suyuti said in Al-Tadrib (3): Abu Al-Hasan Ali bin Muhammad bin Abd al-Malik bin Al-Qattan, author of (Al-Wahm wa Al-Iham), authenticated the Hadith of Ibn Umar extracted in Musnad Al-Bazzar.",
    "foot_note": "None\n\nNone\n\nNone\n\nNone",
    "book_id": "343",
    "new_page_number": 26
  },
  {
    "serial_number": "4613289",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 48,
    "volume_number": 1,
    "text": "(1) I say: Ibn Khuzaima also extracted it in his (Sahih) (1/101/202) and its men are trustworthy except Ibn Khuzaima's Sheikh Abu Zuhayr Abd al-Majid bin Ibrahim Al-Masri, for I did not find a biography for him as I said in my commentary on it. I say now: Perhaps Al-Tabarani narrated it from other than his path? I will not prolong checking his (Mu'jam) now to review its chain there. The interpretation of the Hadith is like the one before it: meaning he wiped over his sandals and feet.\n(2) I say: Its men are trustworthy but it is Shadh (anomalous), for the trustworthy Huffaz from the companions of Al-A'mash narrated it with the wording (his leather socks) instead of (his sandals) as Ibn Jarir al-Tabari himself said (10/78). This is the Mahfuz (preserved) version extracted in (The Two Sahihs) and others. What preceded and follows suffices.\n(3) Page 46. [48]\n\n8 - Al-Bayhaqi (1) narrated with a good chain from Ibn Umar who said: I saw the Messenger of Allah, peace be upon him, wearing them (meaning the Sibtiyyah sandals), performing ablution in them, and wiping over them. Hafiz Ibn Hajar cited it in Takhrij Ahadith Al-Hidayah.\n\n9 - The two Sheikhs, Al-Bukhari and Muslim, narrated from Ubaid bin Jurayj from Abdullah bin Umar that he said: I saw the Messenger of Allah, peace be upon him, wearing the Sibtiyyah sandals which have no hair, and performing ablution in them, so I love to wear them. The meaning of his saying: 'performing ablution in them' is that he wipes over them as clarified by the narration of Al-Bazzar and Al-Bayhaqi previously, and narrations explain each other. As for Al-Bukhari's saying: 'It means washing the feet in the sandals,' Hafiz Al-Isma'ili rejected it as quoted by Al-Ayni, due to its contradiction to what was narrated from Ibn Umar himself.\n\n10 - Al-Darimi narrated in his Musnad from Abd Khayr who said:",
    "foot_note": "None\n\nNone\n\nNone\n\nNone",
    "book_id": "343",
    "new_page_number": 27
  },
  {
    "serial_number": "4613293",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 49,
    "volume_number": 1,
    "text": "(1) I say: He extracted it in his (Al-Sunan Al-Kubra) (1 / 287) from the path of Ibn Khuzaima, and this [Ibn Khuzaima] extracted it in his (Sahih) (No. 199) and its chain is Sahih as I said in the commentary on it. I add here saying: It has another path from Ibn Umar like the narration of Al-Bazzar. Al-Tahawi extracted it in (Sharh Al-Ma'ani) (1 / 97) and its men are known trustworthy ones except Ahmad bin Al-Husayn Al-Lahbi. It has a witness from the Hadith of Ibn Abbas that the Messenger of Allah, peace be upon him, performed ablution once once and wiped over his sandals. Abd al-Razzaq extracted it in (Al-Musannaf) (No. 783) and Al-Bayhaqi (1 / 286) from two paths via Zaid bin Aslam via Ata' bin Yasar from him. This is an extremely Sahih chain meeting the conditions of the two Sheikhs. [49]\n\nI saw Ali perform ablution and wipe over his sandals then he stepped up. Then he said: Were it not that I saw the Messenger of Allah, peace be upon him, doing as you saw me do, I would have thought that the bottom of the feet is more deserving of wiping than their top (1).\n\n11 - Ibn Khuzaima narrated from the path of Abd Khayr from Ali, may Allah be pleased with him, that he called for a jug of water, then performed a light ablution and wiped over his sandals (1) then said: This is the ablution of the Prophet, peace be upon him, for the pure one as long as he has not invalidated his wudu (3). Ibn Hibban followed him in that and said regarding the previously mentioned Hadith of Aws: This was in voluntary [worship] (4).",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "343",
    "new_page_number": 28
  },
  {
    "serial_number": "4613296",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 50,
    "volume_number": 1,
    "text": "(1) I say: In its chain at Al-Darimi (1 / 181) is Abu Ishaq who is Al-Sabi'i and he is a Mudallis with his confusion [at old age]. He narrated it from Abd Khayr with 'an'an (using \"from\"). Khalid bin Alqama Al-Hamdani - who is trustworthy - opposed him and narrated from Abd Khayr with the wording: He washed his right foot three times and his left foot three times. Abu Dawood and others extracted it. Its chain is Sahih and Ibn Hibban authenticated it (No. 150 - Mawarid). I have extracted it in (Sahih Abi Dawood).\n(2) Original: (his feet). Correction from (Sahih Ibn Khuzaima).\n(3) I say: In its chain from Ibn Khuzaima (200) is a Matruk (abandoned) narrator, but he has been corroborated as I clarified in the commentary on it. Ibn Khuzaima extracted it in his (Sahih) (202), and likewise Al-Nasa'i and Ibn Hibban from another path from Ali but he said: (his feet) instead of (his sandals). You have known its beginning (152) and its chain is Sahih on the condition of Al-Bukhari. He extracted it in his (Sahih) - Al-Ashribah - but he did not explicitly mention wiping.\n(4) I say: Meaning that this ablution was voluntary, not obligatory, because it was not from Hadath (impurity). This is indicated by Ibn Khuzaima's chapter heading for the Hadith saying: (Chapter mentioning the proof that the Prophet's wiping over sandals was in a voluntary ablution, not in an obligatory ablution from impurity necessitating ablution).\nI say: The chapter heading for the Hadith is clear with no dust on it. However, it has been authentically reported from Ali, may Allah be pleased with him, that he wiped over his sandals in obligatory ablution after impurity as will come. Therefore, this Hadith must be understood that it is for the pure person, not because he wiped over the sandals, but because he performed a light ablution. This is supported by the other path (that he wiped his face and arms). This wiping is definitely not permissible in the obligatory [ablution]. So that is what he meant by saying: This is the ablution of the Messenger of Allah, peace be upon him, for the pure one... How can it be interpreted as referring to wiping over sandals when it has been established from the Prophet, peace be upon him, from numerous aspects without distinguishing between voluntary and obligatory? Rather, that is established from the narrator of the Hadith himself in the obligatory [prayer] textually, which is what Al-Tahawi extracted in (Sharh Al-Ma'ani) (1 / 97) with a Sahih chain from Abu Zabyan that he saw Ali, may Allah be pleased with him, urinate standing, then call for water, perform ablution and wipe over his sandals, then enter the mosque, take off his sandals, then pray. Abd al-Razzaq extracted it in (Al-Musannaf) (783-784) and Ibn Abi Shaybah also (1 / 190) and Al-Bayhaqi (1 / 288) from paths from Abu Zabyan, who is Al-Janbi as in a narration of Abd al-Razzaq, his name is Husayn bin Jundub Al-Kufi, a trustworthy narrator from the men of the Two Sheikhs. More than one followed him from Ali briefly in the (Two Musannafs). [50]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 29
  },
  {
    "serial_number": "4613297",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 51,
    "volume_number": 1,
    "text": "All these traditions indicate that wiping over sandals was on them alone without anything else with them like a sock. And all of them interpret Al-Mughira's Hadith as we mentioned before. For this reason, they agreed on not stipulating sandals for socks and permitted them being thick even if not sandaled, as will come. Thus, what Al-Naysaburi and others said falls.\n\nThe Fifth Doubt: What was raised against the Hadith of Abu Musa Al-Ash'ari. Abu Dawood said in his Sunan: It was narrated from Abu Musa Al-Ash'ari from the Prophet, peace be upon him, [51]\n\nthat he wiped over the socks, and it is neither connected nor strong. Al-Sindi said in his footnotes on Abu Dawood: His saying: (neither connected) means because it is from the narration of Al-Dahhak ibn Abd al-Rahman from Abu Musa and his hearing from him is not proven. And his saying (nor strong) means because it is from the narration of Isa bin Sinan from Al-Dahhak, and Ahmad, Ibn Ma'in, Abu Zur'a, Al-Nasa'i, and others weakened him. End quote. Hafiz Ibn Hajar said: The Hadith of Abu Musa which Abu Dawood pointed to was extracted by Ibn Majah, and in its chain is weakness and disconnection as Abu Dawood said. End quote.\n(The Answer) is what the scholar investigator Ala' al-Din al-Mardini said in (Al-Jawhar Al-Naqi fi Al-Radd 'ala Al-Bayhaqi) that weakening based on the lack of proof of Isa bin Sinan's hearing from Abu Musa is according to the school of those who stipulate proof of hearing for connection. He said: Then it is contradicted by what Abd al-Ghani mentioned, for he said in Al-Kamal: Al-Dahhak heard from Abu Musa. He said: And Ibn Sinan was declared trustworthy by Ibn Ma'in and weakened by others. Al-Tirmidhi extracted a Hadith in Funerals with this Isa bin Sinan in its chain and declared it Hasan. End quote. Al-Dhahabi said in Al-Mizan: He - meaning Ibn Sinan - is among those whose Hadith is written. He said: Some strengthened him, and Al-Ijli said: There is no harm in him. End quote. In summary, even if there are those who weakened him, there are those who declared him trustworthy, and among the Imams are those who do not leave the Hadith of the weakened narrator unless they agree on leaving it (1). It is not said that the majority hold that Jarh (wounding/criticism) takes precedence over",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 30
  },
  {
    "serial_number": "4613299",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 52,
    "volume_number": 1,
    "text": "(1) (Tadrib) page 113 [52]\n\nmodification (Ta'dil), because it [criticism] is restricted to being explained (Mufassar), not vague, and based on a matter of certainty, not on ijtihad, as stated by Imam Ibn Daqiq al-Eid and quoted from him by Al-Suyuti in Al-Tadrib (1). Thus, the issue requires precision, for it is not absolute as he imagined.\nNevertheless, a Hadith may be supported and strengthened by being narrated from another path with its wording or meaning. This narration of Abu Musa has been found with its wording in the Hadith of Al-Mughira, and with its meaning in the Hadith of Thawban regarding Tasakhin. Thus, it becomes Hasan li-ghayrihi (Hasan due to others), which is like Hasan li-dhatihi (Hasan in itself), and both are acted upon and used as proof. (See the extended books of Terminology).\nIn summary, no matter how much these Hadiths are criticized for disconnection or anomaly, it has become clear through our proofs that among them are those Sahih li-dhatihi according to Al-Tirmidhi as mentioned, and those Sahih li-ghayrihi. It has been noted in Usul that a defective Hadith - if supported by a weak Hadith, or a Companion's saying or action, or the saying of the majority of scholars, or analogy, or its spread without denial, or the practice of the people of the era in accordance with it - the totality becomes proof, because strength yielding assumption (Zann) is obtained from the combination of two weaknesses. See Jam' al-Jawami' and its explanation in the discussion of Mursal.\nAnd Allah says the truth and He guides to the path.",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 31
  },
  {
    "serial_number": "4613301",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 53,
    "volume_number": 1,
    "text": "(1) (Tadrib) p. 113 [53]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 32
  },
  {
    "serial_number": "4613302",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 54,
    "volume_number": 1,
    "text": "Statement that 'Al-Jawrab' (Sock) is Known in Language and Sharia, and There is No Way to Divert it to Other Than What is Known\nIn (Al-Misbah): Al-Jawrab is on the scale of Faw'al, it is Arabized, and the plural is Jawariibah with a Ha', and sometimes it [the Ha'] is omitted. End quote. He did not define it because it is self-evident and known to everyone, and there is no definition for self-evident things.\nIn (Al-Qamus and its explanation): Al-Jawrab is the wrapping of the foot. In (Lisan al-Arab) is the like.\nAbu Bakr ibn al-Arabi said: Al-Jawrab is a covering for the foot made of wool, used for warmth. End quote.\nIn (Al-Tawdih) by Al-Hattab Al-Maliki: Al-Jawrab is what takes the shape of the Khuff (leather sock) made of linen, cotton, or other materials.\nIn (Al-Rawd Al-Murbi') by Al-Bahuti Al-Hanbali: Al-Jawrab is what is worn on the foot in the shape of the Khuff made from other than leather. End quote.\n(Al-Ayni) said: Al-Jawrab is what the people of the Levant wear in severe cold; it is made of spun wool yarn, worn on the foot up to above the ankle. End quote.\n(Al-Halabi) said in Sharh Al-Munyah: Al-Jawrab is what is worn on the foot to ward off cold and the like, which is not called Khuff or Jarmuq. End quote.\nAs for (Al-Jarmuq), the Jurists said it is (Al-Muq). It is, as in Al-Qamus: A thick Khuff worn over the Khuff.\n(Ibn Sidah) said: Al-Muq is a type of Khuff.\n(Al-Jawhari) said: Al-Muq is a short Khuff worn over the Khuff, and it is Persian Arabized. [54]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 33
  },
  {
    "serial_number": "4613303",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 55,
    "volume_number": 1,
    "text": "A word like Al-Jawrab does not need its linguistic and legal meaning—which is known to everyone—to be supported by quoting scholars regarding its meaning, because this falls under explaining what is already clear. However, what called us to this is what we saw in some books claiming that the Jawrab is a Khuff worn over the Khuff up to the ankle for cold and to protect the lower Khuff from dirt and washing water, and another restriction that it must be made of leather. This is an error in language, custom, and Fiqh as well, because this claimed item is the Jarmuq, not the Jawrab.\nIt is strange that Al-Jazuli, one of the Maliki jurists, said: There is a difference of opinion regarding the Jawrab and the Jarmuq, are they two names for one thing? It seems the source of the difference is what was quoted in Al-Tawdih that Imam Malik, may Allah be pleased with him, interpreted the Jarmuq as a sock covered with leather (Mujallad) from beneath and above. It was imagined from this that the Jawrab can only be like that, whereas if a sock is covered in leather in this manner and called Jarmuq, it does not follow that every sock is a Jarmuq, because Jawrab includes the leather-covered and others. If it were not inclusive, there would be no need to restrict it when a specific type is intended.\nIn summary, language and custom hold that Al-Jawrab is absolutely whatever is worn on the foot made of other than leather, whether it is soled (Mun'al) or not. It is established that every name mentioned textually in the Book or Sunnah and to which a legal ruling is attached, it is obligatory not to [55]\n\napply that ruling except to what that name necessitates, and not to transgress the legal designation in it. And with Allah is success.\n\nMention of Those from Whom Wiping Over Socks was Narrated Among the Companions, May Allah be Pleased with Them\nImam Abu Dawood said in his Sunan in the (Chapter on Wiping over Socks): Ali bin Abi Talib, Abu Masud, Al-Bara' bin Azib, Anas bin Malik, Abu Umama, Sahl bin Sa'd, and Amr bin Hurayth wiped over the socks. And that was narrated from Umar bin Al-Khattab and Ibn Abbas. End quote.\nIbn Sayyid al-Nas added in Sharh Al-Tirmidhi: Abdullah bin Umar and Sa'd bin Abi Waqqas.\nIn Sharh Al-Iqna' he added: Ammar, Bilal (1), and Ibn Abi Awfa, may Allah be pleased with them.\nThe total is fourteen Companions. Adding Al-Mughira and Abu Musa due to their two aforementioned narrations, the total becomes sixteen Companions.",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 34
  },
  {
    "serial_number": "4613305",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 56,
    "volume_number": 1,
    "text": "(1) Hafiz Ibn Hajar said in Takhrij Ahadith Al-Muhadhdhab: Regarding this chapter, from Bilal, Al-Tabarani extracted it with two chains, one of which contains trustworthy narrators. [56]\n\nIbn Hazm in Al-Muhalla (1) attributed the act of wiping over socks to some of those we named. His words are: Wiping over everything worn on the feet - of what is permissible to wear reaching above the ankles (2) - is a Sunnah, whether they are Khuffs (leather socks) or Jawrabs (socks). If worn upon ablution, wiping over them is permissible for the resident for one day and night, and for the traveler for three days and their nights, then wiping is not lawful for him.\nAfter extracting the Hadiths of wiping over socks, he said: Among those who held the view of wiping over socks is a group of the Salaf.\nThen he narrated from Ka'b bin Abdullah who said: I saw Ali bin Abi Talib, may Allah honor his face, wipe over his sandals and socks.\nAnd from Abu Al-Jallas (3) from Ibn Umar that he used to wipe over his socks and sandals.\nAnd from Ismail from his father who said: I saw Al-Bara' bin Azib wiping over his socks and sandals.\nAnd from Ibrahim bin Hammam bin Al-Harith from",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 35
  },
  {
    "serial_number": "4613307",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 57,
    "volume_number": 1,
    "text": "(1) I say: This restriction (reaching above the ankles) I know of no evidence for. Moreover, it contradicts Ibn Hazm's own statement in another place in (Al-Muhalla) (2 / 103), and I will mention his text in the appendix at the end of the treatise.\n(2) See footnote (1).\n(3) With Damma on Jim and light Lam. [57]\n\nAbu Masud Al-Badri that he used to wipe over his socks and sandals.\nAnd from Asim Al-Ahwal who said: I saw Anas bin Malik wipe over his socks.\nAnd from Ibn Umar who said: Umar bin Al-Khattab urinated on a Friday, then performed ablution and wiped over the socks and sandals and led the people in Jumu'ah prayer.\nAnd from Abu Wa'il from Abu Masud that he wiped over socks of his made of hair (Sha'r).\nAnd from Yahya Al-Bakka' who said: I heard Ibn Umar say: Wiping over socks is like wiping over leather socks. (1)",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 36
  },
  {
    "serial_number": "4613309",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 58,
    "volume_number": 1,
    "text": "(1) I say: These Athar (reports) were extracted by Abd al-Razzaq in (Al-Musannaf) (Nos. 745, 773, 779, 781, 782) and Ibn Abi Shaybah also in (Al-Musannaf) (1 / 188) and Al-Bayhaqi (1 / 285). Many of their chains are authentic from them. Some of them have more than one path. Among that is the path of Qatada from Anas that he used to wipe over socks like leather socks, and its chain is Sahih. Narrated by Abd al-Razzaq (779) and it is in Ibn Abi Shaybah (1 / 188) briefly. They both have from the path of Yahya Al-Bakka' who said: I heard Ibn Umar say: Wiping over socks is like wiping over leather socks. Nafi' received that from him and said: They are of the status of leather socks. Extracted by Ibn Abi Shaybah with a Hasan chain from him. Ibrahim Al-Nakha'i said the same. Extracted with a Sahih chain from him. I say: So after wiping over socks is established from the Companions, may Allah be pleased with them: Is it not permissible for us to say regarding one who turns away from it what Ibrahim said regarding their wiping over leather socks: (Whoever abandons that turning away from it, he is indeed from Satan). Narrated by Ibn Abi Shaybah (1 / 180) with a Sahih chain from him. [58]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 37
  },
  {
    "serial_number": "4613310",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 59,
    "volume_number": 1,
    "text": "What was Narrated from the Notable Companions, May Allah be Pleased with Them, and Those After Them Regarding the Permissibility of Wiping over Socks Even if Thin\nImam Al-Nawawi said in Sharh Al-Muhadhdhab: Our companions (the Shafi'is) narrated from Umar and Ali, may Allah be pleased with them, the permissibility of wiping over the sock even if it is thin. They also narrated it from Abu Yusuf, Muhammad, Ishaq, and Dawood.\nThen Al-Nawawi said: Those who permitted it - even if thin - argued with the Hadith of Al-Mughira that the Prophet, peace be upon him, wiped over his socks and sandals. And from Abu Musa similarly raised (Marfu'). End of his words.\nIt contains an addition to what preceded it: the explicit statement of permissibility from them even if it is thin, although that could be understood from the absolute nature of the reports mentioned before, because the default for an absolute term is to interpret it according to its absoluteness until something comes to restrict it, just as the general has its ruling until evidence specifies it. Clarification of this will come from what Imam Ibn Hazm said, may mercy and pleasure be upon him.\n\nStatement that the Sayings and Fatwas of the Companions are More Deserving of Being Adopted than Others, and Refutation of Those Who Claimed Lack of Trust in What is Narrated from Them\nThis is a great discussion to which every person who has acquired a portion of knowledge must [59]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 38
  },
  {
    "serial_number": "4613311",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 60,
    "volume_number": 1,
    "text": "lend his ear. That is because many people, if the Madhhab (school of thought) of a Companion is mentioned to them in an issue, you see them not raising their head to it, relying on the fact that he is not among those whose practice they were taught. Perhaps he might arrogantly say: He is not among those whose Madhhab was codified. Since this is something not to be taken lightly in religion, as such a saying is denounced by those well-grounded in knowledge, it became necessary to remove the ambiguity in it as guidance for the pious.\nThat is because the Companions, may Allah be pleased with them, are in the highest station and supreme position in every knowledge, deed, virtue, and nobility.\nImam Ibn al-Qayyim, may Allah have mercy on him, said in (I'lam al-Muwaqqi'in): Just as the Companions are the masters of the Ummah and its Imams and leaders, they are the masters of the Muftis and Scholars. Mujahid said: The scholars are the Companions of Muhammad, peace be upon him.\nHe (Ibn al-Qayyim) quoted from Al-Shafi'i that he said regarding the Companions: They are above us in every knowledge, ijtihad, piety, intellect, and matter by which knowledge is attained. Their opinions are more praiseworthy for us and worthier for us than our own opinion... etc.\nIf you know this, it becomes clear to you that what appeared in (Jam' al-Jawami') by Al-Subki stating that regarding imitating a Companion there are two opinions, one being prohibition due to the lack of trust in his Madhhab since it wasn't codified, and his commentator attributing that to Imam al-Haramayn Al-Juwayni and the verifiers (meaning the imitators of Al-Juwayni and his followers), is a summarized statement whose apparent meaning should not deceive. Its rejection is taken from the words of more than one of the Imams. In fact, Al-Subki himself rejected that and said - as Al-Zarkashi quoted from him and you can see it in his footnotes: If [60]\n\nthe establishment of his Madhhab (i.e., the Companion) is verified, it is permissible to imitate him by agreement.\nAl-Izz bin Abd al-Salam was asked (1) about someone for whom the Madhhab of Abu Bakr or other scholar Companions is authenticated in something: Is it permissible to turn to another or not? He answered that if a Madhhab regarding a legal ruling is authentically established from one of the Companions, it is not permissible to deviate from it except with evidence clearer than his evidence. He said: It is not obligatory for Mujtahids to imitate Companions in issues of dispute; rather, that is not lawful when their evidences are clearer than the evidences of the Companions. End quote.\nIbn Taymiyyah said in some of his fatwas: As for the sayings of the Companions, if they spread and were not denied in their time, they are a proof (Hujjah) according to the majority of scholars. If they disputed, what they disputed in is referred to Allah and the Messenger, and the saying of some of them is not proof if others oppose it, by agreement of scholars. If some said a saying and others did not say the opposite, and it did not spread, then there is a dispute regarding this, and the majority of scholars use it as proof, like Abu Hanifa, Malik, Ahmad in the famous view from him, and Al-Shafi'i in one of his views. End quote.\nTexts regarding caring for the sayings of the Companions are too numerous to count. We say this as a preparation for the sayings narrated regarding wiping over socks in the Sunan book of Abu Dawood and others, for they are proof",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 39
  },
  {
    "serial_number": "4613313",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 61,
    "volume_number": 1,
    "text": "(1) Sharh Khalil by Al-Hattab Part (1) p. 31 [61]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 40
  },
  {
    "serial_number": "4613314",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 62,
    "volume_number": 1,
    "text": "in this chapter against everyone who opposes, whatever their condition. Because they are - according to what Ibn Taymiyyah detailed and Usul scholars established - either widespread and undenied, and what is such is proof by agreement; or some of them said it and opposition did not spread, and the majority use that as proof. It is known that there is no opponent there, so his saying spreads, since nothing was narrated from them regarding it except raising it to the Prophet, peace be upon him, or their acting upon it as you knew from multiple narrations.\nIt is clear in the chapter of rulings that a ruling whose narrators, proponents, and practitioners reached sixteen, if they were from a class other than Companions, one would not hesitate to accept it. So how about when they are all from the class of Companions, upon whom be Allah's mercy and pleasure? This is all assuming that nothing was narrated in the chapter - i.e., the chapter of wiping over socks - except their saying only. Otherwise, we have presented what was narrated in it of Hadiths which are the proof in this chapter and the reference in case of dispute (And when the river of Allah comes, the river of Ma'qil becomes invalid).\nThis sentence should be noted by those who refuse anything but Taqlid (imitation), so they know that whoever prefers Taqlid, it is more appropriate for him to imitate the Companions because they are the most knowledgeable, and Usul scholars agreed that - in the chapter of Taqlid - the most knowledgeable takes precedence.\nIbn al-Qayyim said in I'lam al-Muwaqqi'in: One does not know what excuse the imitator has in preferring the sayings of non-Companions over their sayings. So how about if taking the saying of the Companions is prevented? [62]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 41
  },
  {
    "serial_number": "4613315",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 63,
    "volume_number": 1,
    "text": "How about if the one who acts upon it is accused of innovation? No doubt he adopted the famous proverb: She accused me of her ailment and slipped away. End quote.\nAs for the doubt of lack of trust in what is narrated as a Madhhab for Companions because their Madhhab was not codified, it is weaker than a spider's web. Because our discussion is about what was narrated from them in trusted books circulated in hands, from books of Sunnah and Fiqh, especially the Two Sahihs and the Sunan books. They have been preserved from addition and decrease by the strength of care for them in explanation and precision, and the abundance of manuscripts marked with the hearings (Sama'at) of Huffaz in most libraries, the likes of which is not found in the books of Fiqh Imams whose schools are famous. There is no doubt that this is one of the miracles of the Messenger, peace be upon him, as Allah ordained for His Sunnah those who preserve it as He did for His Noble Revelation, and to Him belongs praise and favor.\nMoreover, reliance since authorship and classification spread is upon transferring from the existing [text] which the soul trusts - whether it was entirely compared to its original or not - as long as its correctness is predominant in assumption and the heart is reassured by it. This is called 'Wijadah'. Therefore, Imam Al-Muqbili in (Al-Ilm Al-Shamikh) objected to their statement of not relying on Wijadah, saying that this contradicts it, since it - i.e., their mentioned statement - is nothing but Wijadah. He said: As for trust, it is a condition in every path. End quote.\nRather, judges, muftis, [63]\n\nand those deriving rulings rely on the mentioned Wijadah, since it is impossible to attribute every book to its author and verify it from him by hearing and reading in every generation. Furthermore, books of Hadith have received precision, reception, explanation, and enumeration of their corrected copies, boasting of reading them, and being honored by hearing, receiving, and obtaining licenses for them, what is not found in a tenth of a tenth for the works of the four Imams or others.\nIf one wanted to copy a book from the works of the Imams or print it, obstacles would prevent finding complete copies of it (1), and usually, after searching, only scattered parts or a defective copy is seen. Yet, it is the right of the imitators of their Imams to copy thousands from them in every century and serve them by reading, teaching, publishing, and explaining.\nI was once eager to find a manuscript copy of Imam Al-Shafi'i's Risalah or an explanation of it to compare with the printed one and copy the explanation, but I found no trace of it in any library in the Levantine region. Where is this compared to the manuscript copies of the Two Sahihs and Sunan which filled the libraries of the world, and finding good ones does not weary any seeker? Is not trust, then, in the books of Sunnah and what they contain of Marfu' and Mawquf (which are sayings and fatwas of Companions) stronger in the soul than others? Yes, indeed.",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 42
  },
  {
    "serial_number": "4613317",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 64,
    "volume_number": 1,
    "text": "(1) This is what happened when printing the book (Al-Umm) by Al-Shafi'i; they needed to collect its parts from different countries. Compare similar works of Imams to the book Al-Umm. [64]\n\nWhat supports what we presented regarding Wijadah is what is in Tadrib al-Rawi by Al-Suyuti, explanation of Taqrib al-Nawawi, at the end of the discussion on Sahih. His text is (1): From Imam Ibn Burhan in Al-Awsat: The jurists entirely held that acting upon a Hadith does not depend on hearing it; rather, if the copy is authentic to him, he may act upon it even if he did not hear it. The master Abu Ishaq Al-Isfarayini narrated consensus on the permissibility of transferring from reliable books and that a connected chain to their authors is not stipulated.\nIlkiya Al-Tabari said in his commentary: Whoever finds a Hadith in a sound book, he may narrate it and use it as proof.\nSheikh Izz al-Din bin Abd al-Salam said in answer to a question: As for relying on sound, trusted books of Fiqh, scholars in this era have agreed on the permissibility of relying on them and basing arguments upon them, because trust has been obtained by them just as it is obtained by narration. Therefore, people relied on famous books in Grammar, Language, Medicine, and other sciences due to the trust obtained by them and the remoteness of deception. End quote.\nSo reflect on the convergence of Imams' sayings on relying on what is in books of",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 43
  },
  {
    "serial_number": "4613319",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 65,
    "volume_number": 1,
    "text": "(1) p. 49 [65]\n\nFiqh and others. You know that if a transmission from a Companion or a narration of his Madhhab is found therein, it is trusted and acted upon without doubt, and it is worthier than others in the chapter of imitation for whoever wishes it. So understand and do not be a prisoner of imitation.\n\nWho Narrated Wiping Over Socks Among the Successors (Tabi'in)\nIt is not hidden that if no Marfu' or Mawquf narration is found in an issue, but a saying or fatwa of the Successors is found regarding it, that would be considered or influential, especially in the chapter of imitating the most knowledgeable and best among those imitated.\nMuhammad bin Sa'd (1) narrated that Abu Salamah bin Abd al-Rahman said to Al-Hasan: Do you see what you give fatwa to people, is it something you heard or your opinion? Al-Hasan said: No, by Allah, not everything we give fatwa on did we hear, but our opinion for them is better than their opinion for themselves. End quote (2).\nSeveral traditions regarding wiping over socks have been narrated from the Successors:\nImam Ibn Hazm, may Allah be pleased with him, extracted in the book Al-Muhalla from Qatada from Sa'id bin Al-Musayyib who said: Socks are of the status of leather socks in wiping.\nAnd from Ibn Jurayj: I said to Ata': Does one wipe over socks? He said: Yes, wipe over them like",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 44
  },
  {
    "serial_number": "4613321",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 66,
    "volume_number": 1,
    "text": "(1) Meaning the author of (Al-Tabaqat Al-Kubra).\n(2) I'lam al-Muwaqqi'in Part 1 Page 75. [66]\n\nleather socks.\nFrom Ibrahim Al-Nakha'i that he saw no harm in wiping over socks.\nFrom Al-Fadl bin Dukayn, he said: I heard Al-A'mash - when asked about socks: Does one who slept in them wipe over them? He said: Yes.\nFrom Qatada from Al-Hasan and Khilas bin Amr that they used to view socks in wiping as having the status of leather socks.\nThen he counted among the Successors Sa'id bin Jubayr and Nafi' (1).\n(Then Ibn Hazm said): It is the saying of Sufyan Al-Thawri, Al-Hasan ibn Hayy, Abu Yusuf, Muhammad bin Al-Hasan, Abu Thawr, Ahmad bin Hanbal, Ishaq bin Rahwayh, Dawood bin Ali (Al-Zahiri), and others. End quote.\n\nStatement of the Sayings of Famous Jurists Regarding Wiping Over Socks\n(The Maliki School on Wiping Over Socks)\nImam Ibn Al-Qasim said in Al-Mudawwanah: Malik used to say regarding socks that are on the foot, with stitched leather on their bottom",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 45
  },
  {
    "serial_number": "4613323",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 67,
    "volume_number": 1,
    "text": "(1) I say: Ibn Abi Shaybah (1 / 189) extracted it from Sa'id bin Al-Musayyib, Sa'id bin Jubayr, Nafi', and Ibrahim, and their wording preceded shortly. And from Ata', he said: (Wiping over socks is of the status of wiping over leather socks). Its chain is Sahih. [67]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 46
  },
  {
    "serial_number": "4613324",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 68,
    "volume_number": 1,
    "text": "and stitched leather on their top: That one wipes over them. Then he retracted and said: One does not wipe over them. Ibn Al-Qasim said: His first saying is more beloved to me if they have leather on them as I described to you. End quote.\nIbn Yunus said: It - i.e., Malik's first saying - is the correct one because if it has stitched leather reaching the ankles, then this is like the leather sock (quoted by Al-Mawwaq in Al-Taj wa Al-Iklil).\nIn Ibn Al-Qasim choosing the saying from which his Imam Malik retracted and declaring it more beloved to him, and Ibn Yunus saying it is the correct one, there is the greatest lesson that the companions of the Imams used to shun pure blind imitation and relied only on evidence, and that becomes a Madhhab for them in reality. Such was the case of the two companions of Abu Hanifa with him. And such were the companions of Al-Shafi'i, for Al-Muzani often holds a unique view differing from his teacher Al-Shafi'i. Al-Nawawi quoted at the end of the explanation of the introduction of Al-Muhadhdhab from Imam al-Haramayn that if Al-Muzani holds a unique view, he is the owner of a Madhhab. Many companions of Al-Shafi'i chose some of his issues from which he retracted and gave fatwa according to them after him.\nImam al-Haramayn said: The retracted view is not a Madhhab for the one who retracted. If the old state is known and we find our companions giving fatwa on these issues according to the old view, we interpret that as their Ijtihad leading them to the old view due to the clarity of its evidence, and they are Mujtahids so they gave fatwa according to it. End quote. So reflect on his saying: (and they are Mujtahids), you will know the error of what [68]\n\nsome prattle about, that they are Mujtahids within the Madhhab not absolutely. For they are Mujtahids absolutely. Not every Mujtahid has followers and a codified Madhhab. Furthermore, if he extracted rulings based on the Imam's rules, it would not be a Madhhab for him [the Imam]. Imam Al-Nawawi said: Their difference regarding whether the extracted ruling is attributed to Al-Shafi'i has preceded, and the more correct view is that it is not attributed. End quote.",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 47
  },
  {
    "serial_number": "4613326",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 69,
    "volume_number": 1,
    "text": "1 - What was Narrated from Imam Al-Shafi'i and His Companions Regarding Wiping Over Socks\nImam Al-Tirmidhi said in his Sunan (in the Chapter on Wiping Over Socks and Sandals) the purport of which is: And it (i.e., wiping over socks) is the saying of more than one of the people of knowledge. Sufyan Al-Thawri, Ibn Al-Mubarak, Al-Shafi'i, Ahmad, and Ishaq say it. They said: One wipes over socks even if they are not soled, if they are thick. End quote.\nIt is known that Imam Al-Tirmidhi narrated from the companions of Imam Al-Shafi'i. Therefore, he said at the end of his book (Al-Sunan): What is in it of Al-Shafi'i's saying, most of it is what Al-Hasan bin Muhammad Al-Za'farani informed me from Al-Shafi'i. And what was regarding Wudu and Prayer, Abu Al-Walid Al-Makki told us from Al-Shafi'i. Among it is what Abu Ismail told us, he said: told us [69]\n\nYusuf bin Yahya Al-Qurashi Al-Buwayti from Al-Shafi'i. He mentioned in it things from Al-Rabi' from Al-Shafi'i, and Al-Rabi' gave us license for that and wrote to us about it. End quote.\nImam Al-Shirazi said in Al-Muhadhdhab: If he wears a sock, it is permissible to wipe over it with two conditions: one is that it be thick (safiq) not sheer, and the second is that it be soled.\nIts explainer Al-Nawawi said: A group decisively held this view, among them Sheikh Abu Hamid, Al-Mahamili, Ibn Al-Sabbagh, and others. Al-Muzani reported that one does not wipe over socks unless they are leather-covered (Mujallad) over the feet. Then Al-Nawawi said: The correct, nay the truth, is what Judge Abu Al-Tayyib, Al-Qaffal, and groups of verifiers mentioned, that if continuous walking is possible, it is permissible however it is; otherwise, no. End quote.\n\n2 - The Hanafi School on Socks\nImam Al-Kasani said in Bada'i' al-Sana'i': As for wiping over socks, if they are leather-covered (Mujallad) or soled (Mun'al) (1), it suffices without disagreement among our companions. If they are not leather-covered nor soled, if they are thin showing (2) water, wiping over them is not permissible",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "343",
    "new_page_number": 48
  },
  {
    "serial_number": "4613329",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 70,
    "volume_number": 1,
    "text": "(1) Mujallad is when leather is placed on its top and bottom, and Mun'al is when leather is placed on its bottom like a sandal for the foot. End quote.\n(2) i.e., what is beneath them - of the foot's skin - is seen through them. [70]\n\nby consensus (1). If they are thick (2), it is not permissible according to Abu Hanifa, but according to Abu Yusuf and Muhammad, it is permissible. It was narrated from Abu Hanifa that he retracted to their view at the end of his life; that is because he wiped over his socks during his illness, then said to his visitors: I did what I used to forbid people from. So they used it as evidence for his retraction. Then he said: Abu Yusuf and Muhammad argued with the Hadith of Al-Mughira bin Shu'ba that the Prophet, peace be upon him, performed ablution and wiped over the socks, and because the permission regarding leather socks is to remove hardship due to the difficulty of removing them, and this meaning exists in the sock. End quote.\n\n3 - The Hanbali School on Socks\nIn Al-Iqna' and its explanation: Wiping is valid over a thick (safiq) sock made of wool or other material, even if not leather-covered or soled or\n\n(1) If he meant the consensus of the Imams of the Salaf and Khalaf, it is false. For Imam Al-Nawawi narrated in Sharh Al-Madhhab the permissibility of wiping over socks even if thin from the Commanders of the Faithful Umar and Ali, may Allah be pleased with them, and Ishaq and Dawood. In fact, he also narrated its attribution to Abu Yusuf and Muhammad as you saw earlier. Furthermore, it is the Madhhab of Imam Ibn Hazm as will come, so how can the claim of consensus be valid? If he meant the consensus of the Hanafis, it might be conceded, but Al-Nawawi's narration from the Two Companions (Abu Yusuf and Muhammad) refutes it also. So it has become clear that there is no consensus in the chapter, so keep this in mind.",
    "foot_note": "None\n\nNone\n\nNone\n\nNone",
    "book_id": "343",
    "new_page_number": 49
  },
  {
    "serial_number": "4613333",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 71,
    "volume_number": 1,
    "text": "2 - The definition of thickness is that it stays tied on the leg without being held up by anything. End quote Haddadi. [71]\n\neven if made of rags, provided continuous walking on it is possible. Then he said: The Hadith of Al-Mughira (He, peace be upon him, wiped over the socks and the sandals) indicates that they were not soled, because if they were so, he would not have mentioned the sandals, because it is not said: He wiped over the Khuff and its sole (1). End quote.\n\n4 - What Imam Ibn Rushd Al-Maliki, may Allah have mercy on him, said regarding Wiping over Socks\nHe said, may Allah have mercy on him, in his book (Bidayat al-Mujtahid): They differed regarding wiping over socks. The cause of their difference is their disagreement on the authenticity of the traditions narrated from him, peace and blessings be upon him, that he wiped over socks and sandals, and their disagreement also on whether other things can be analogized to the leather sock or if it is an act of worship not subject to analogy and not extending beyond its locus. So whoever did not consider the Hadith authentic or it did not reach him and did not see analogy on the leather sock, restricted wiping to it. And whoever considered the tradition authentic and allowed analogy on the leather sock permitted wiping over socks. End quote.\nIbn Rushd's custom in the mentioned book is clarifying the perceptions of the Mujtahids, but every issue where perceptions multiplied and sayings branched out,",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "343",
    "new_page_number": 50
  },
  {
    "serial_number": "4613336",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 72,
    "volume_number": 1,
    "text": "(1) Our professor Sheikh Jamil Al-Shatti, who was the last to assume the position of Ifta (issuing fatwas) for the Hanbalis in the Levant, issued a fatwa permitting wiping over the socks used nowadays. He published it in magazines and newspapers. (Zuhayr) [72]\n\nthe truth is definitively in one of them, which is what its proof is correct and its perception strong. The proof here regarding wiping over socks is correct and its perception strong due to what we quoted before and quote after. Therefore, Imam Al-Nawawi said regarding the Hadith of fasting six days of Shawwal in Muslim, refuting Imam Malik in his dislike of it, the purport of which is: If the Sunnah is established, it is not abandoned because some people, or most of them, or all of them abandoned it. End quote.\nThus it is said regarding wiping over socks: It is not abandoned after its establishment due to the opposition of whoever opposed or the analogy of whoever analogized, because there is no Ijtihad in the face of a text, and we absolve ourselves to Allah from repelling texts with analogies and opinions.\nImam Ibn al-Qayyim (1) said: Whoever does not stand with the texts, sometimes he adds to the text what is not of it and says: This is analogy. Sometimes he decreases from it some of what it implies and removes it from its ruling and says: This is specification. Sometimes he abandons the text entirely and says: The practice is not upon it, or says: This contradicts analogy or contradicts principles. Then he said: We see that whenever a man becomes deeply immersed in analogy, his opposition to the Sunan intensifies. We do not see opposition to Sunan and Athar except with the people of opinion and analogy. By Allah, how many an authentic explicit Sunnah has been nullified by it, and how many a tradition has its ruling erased because of it. So Sunan and Athar with the opinionists and analogists are empty",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 51
  },
  {
    "serial_number": "4613338",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 73,
    "volume_number": 1,
    "text": "(1) I'lam al-Muwaqqi'in Part 1 Page 299 [73]\n\non their thrones, their rulings suspended, removed from their authority and mandate; they have the name but others have the ruling. Otherwise, why was the Hadith of wiping over socks abandoned? (to the end of what he said and enumerated. See it). Meaning, despite it being established in the Sunnah, rather analogy also required it as you will see in the words of Ibn Taymiyyah, may Allah have mercy on him.\n\nThe Zahiri School on Wiping Over Socks\nImam Ibn Hazm, may Allah illuminate his grave, said in his book (Al-Muhalla): Stipulating leather covering has no meaning because neither Quran, nor Sunnah, nor Qiyas, nor saying of a Companion brought it. Preventing wiping over socks is an error because it contradicts the established Sunnah from the Messenger of Allah, peace be upon him, and contradicts the Athar. He, peace be upon him, did not specify leather socks to the exclusion of others in the news we mentioned. End quote (1).\nThis is supported by the fact that all narrations regarding wiping over socks raised to the Prophet, peace be upon him, have no restriction or condition, and that is not understood either from its explicit wording, nor from its concept, nor from its indication. It is clear that texts are taken on their generality until a specifier comes, and on their absoluteness until what restricts them comes. No specifier or restrictor came here, neither in Hadith nor Athar. This is (First).\n(Second) We presented that Imam Abu Dawood narrated in his Sunan from several Companions wiping over socks absolutely, unrestricted, as we presented. Similarly, everyone who narrated from the Companions",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 52
  },
  {
    "serial_number": "4613340",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 74,
    "volume_number": 1,
    "text": "(1) Thus in Al-Muhalla (2 / 87) [74]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 53
  },
  {
    "serial_number": "4613341",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 75,
    "volume_number": 1,
    "text": "and Successors, may Allah be pleased with them all, regarding wiping over socks did not narrate it with a restriction or condition, which indicates that restricting it was not known in their eras, which are the best of centuries.\n(Third) The sock is clear in itself in language and custom as we quoted its meaning from the Imams of language and Fiqh. No one stipulated in its concept and name a sole or thickness. If its subject in Fiqh and language is absolute, it applies to the thin sock, the thick one, the soled one, and others. And Allah knows best.\n\nWhat Sheikh al-Islam Ibn Taymiyyah Said Regarding Wiping Over Socks\nHe, may Allah have mercy on him, said in his Fatawa: It is permissible to wipe over socks if one walks in them, whether they are leather-covered or not, according to the more correct of the two scholarly opinions. In the Sunan, the Prophet, peace be upon him, wiped over his socks and sandals. If this Hadith is not established, then Analogy requires it. For the difference between socks and leather socks is only that this is from wool and this is from skins. It is known that such a difference is not effective in Sharia. There is no difference between being skins, cotton, linen, or wool, just as no difference was made between black clothing in Ihram and white. At most, leather is more durable than wool, but this has no effect, just as there is no effect for leather being strong. Rather, wiping is permissible [75]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 54
  },
  {
    "serial_number": "4613342",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 76,
    "volume_number": 1,
    "text": "over what lasts and what does not last. Also, it is known that the need to wipe over this is like the need to wipe over that, equally. With the equality in wisdom and need, differentiating between them is differentiating between similars, and this is contrary to justice and correct consideration which the Book and Sunnah came with, and with which Allah revealed His Books and sent His Messengers. Whoever differentiates by this being permeable to water and this not being permeable has mentioned a superficial difference with no effect. If someone said water reaches wool more than leather so wiping over it is more appropriate because purity adheres to it more, this description would be more worthy of consideration than that description and closer to effective descriptions, while that is closer to superficial descriptions, and both are invalid. Holes from tearing do not prevent the permissibility of wiping. Even if socks do not cover except by tying, wiping over them is permissible. Likewise, the tall Zarbul (boot) which does not stay up by itself and does not cover except by tying. End quote.\nHe, may Allah have mercy on him, said in another Fatwa: It is permissible to wipe over the Zarbul which covers the ankles if it stays up by itself without a strap. Even if it does not stay up except by buttons or straps, wiping over it is permissible also, for it covers the obligatory area by itself. Similarly, the sock which does not stay up except with strings. Even if it stays up by something separate from it [76]\n\nlike the sock that does not stay up except with the sandal, it is permissible to wipe over it whether it is of felt, wool, cotton, linen, or skins. There is no need to consider conditions that have no basis in Sharia and which result in invalidating the purpose of the concession). End quote.\nHe, may Allah illuminate his tomb, also said in another Fatwa: It is permissible to wipe over Lafa'if (foot wraps) (1), which is wrapping wraps on the foot due to cold or fear of barefootedness or due to wounds on it and the like. It is more deserving of wiping than the leather sock and the sock, for those wraps are used for need customarily, and in removing them there is harm either by exposure to cold, or harm by barefootedness, or harm to the wound. So if wiping over leather socks and socks is permissible, then [it is permissible] over wraps by way of priority (a fortiori). End quote.\nHe, may Allah benefit the Ummah with his knowledge, said during a Fatwa of his: It is known that cold lands require those who wipe over Tasakhin and 'Asa'ib - which are turbans - what is not needed in the land of Hijaz. So the people of Sham, Rum, and similar lands are more deserving of the concession in this and that than the people of Hijaz. Then he said: If they prevent wiping",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 55
  },
  {
    "serial_number": "4613344",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 77,
    "volume_number": 1,
    "text": "(1) I say: Wraps are included in the generality of Thawban's aforementioned Hadith that he, peace be upon him, commanded them to wipe over Tasakhin. We have previously mentioned that Tasakhin linguistically is everything with which the foot is warmed. So remember. - Jamal al-Din [77]\n\nover it, they constrict in a manner whose contradiction to Sharia is apparent, with absolutely no proof with them. End quote. His words, upon him be Allah's mercy and pleasure.\n\nConclusion\nIt is not hidden that the concessions narrated from the Prophet, peace be upon him, are a great blessing in every case and in any condition. However, the completeness of the blessing of their legislation appears in some conditions like the concession of wiping over socks in cold days, times of travel, cases of illness, foot cracking, callousness of feet, or their swelling which occurs. Just as the Prophet, peace be upon him, commanded the expedition who complained to him about what cold befell them to wipe over turbans and Tasakhin as we presented.\nThe one who accompanied Ikrimah, may Allah be pleased with him, to Wasit (1) said: I never saw him wash his feet; he only wiped over them until he left it. Narrated by Ibn Jarir in his Tafsir.\nIt was previously mentioned from Bada'i' by Al-Kasani that Abu Hanifa, may Allah be pleased with him, retracted to the opinion of Abu Yusuf and Muhammad regarding wiping over socks at the end of his life. That is because he wiped over his socks during his illness,",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 56
  },
  {
    "serial_number": "4613346",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 78,
    "volume_number": 1,
    "text": "(1) i.e., in his travel to it. So reflect on his taking this concession in his travel. And travel is the place of concessions. And marvel at his Fiqh and knowledge, may Allah be pleased with him. [78]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 57
  },
  {
    "serial_number": "4613347",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 79,
    "volume_number": 1,
    "text": "then said to his visitors: (I did what I used to forbid people from). So they used it as evidence for his retraction. End quote.\nThe retraction of Abu Hanifa, may Allah be pleased with him, is from his virtue and fairness. Mujtahids changing Ijtihad and returning to what contains strength and correctness is known about all of them and counted among their virtues. Among the greatest lessons - in this story, the story of Imam Abu Hanifa's retraction - is that an Imam retracts and declares his retraction, while the stubborn opponent refuses to return to the truth even if proofs are recited to him that would soften iron and crack rocks. No wonder, for the Mujtahid Imams have such kindness, perfection, good character, fairness, and admission of truth that riders traveled with [their news]. Consider also Imam Al-Shafi'i when he traveled from Iraq to Egypt and re-examined his old Madhhab, how he retracted many of his issues, and that was counted among his highest virtues. The reason for that is piety and preferring the Hereafter, for it restrains the pious from preferring desire and the world.\nThus did Imam Abu Hanifa in his retraction to the opinion of wiping over socks. Some people might think that strictness in resolutions (Azai'm) and shunning concessions is piety. God forbid! How, when the Prophet, peace be upon him, said: (Do not be hard on yourselves, lest Allah be hard on you. For a people were hard on themselves, so Allah was hard on them. Those are their remnants in [79]\n\nmonasteries and cells: {monasticism, which they invented; We did not prescribe it for them}) (1).\nThe Messenger of Allah, peace be upon him, said: (Sahih) (Indeed, Allah Almighty loves that His concessions be taken just as He loves that His resolutions be taken) (2).\nAnd from him, peace be upon him: (Weak Chain) (Indeed, Allah Almighty loves that His concessions be accepted just as the servant loves his Lord's forgiveness) (3).\nAnd he, peace be upon him, said: (Weak) (Indeed, Allah loves that His concessions be taken just as He hates that His disobedience be committed) (4).\nAnd he, peace be upon him, said: (The extremists perished) (5).\nYes, there are among the best worshipers possessing seriousness and diligence those who only take the resolutions, not out of asceticism regarding the narrated text nor turning away from the righteous concession, but to discipline the soul on the best and take it to the ideal and most perfect. This is what jurists call precaution (Ihtiyat) and exiting disagreement to prefer what has consensus and harmony. Its origin is what is authentic in the Sunnah that the Prophet, peace be upon him, used to stand in prayer at night until his feet swelled. It was said to him: Do you burden yourself with this",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 58
  },
  {
    "serial_number": "4613349",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 80,
    "volume_number": 1,
    "text": "(1) Narrated by Abu Dawood from Anas, may Allah be pleased with him. - Jamal al-Din\n(2) Narrated by Imam Ahmad from Ibn Umar and Al-Tabarani from Ibn Abbas and Ibn Masud. - Jamal al-Din. I say: It is a Sahih Hadith extracted in (Irwa' al-Ghalil) (557).\n(3) Narrated by Al-Tabarani from Abu Darda', Wathila, Abu Umama, and Anas. - Jamal al-Din. I say: Its chain is weak as clarified in the previous source and in (Al-Ahadith Al-Da'ifah) as well (508).\n(4) Narrated by Imam Ahmad, Ibn Hibban, and Al-Bayhaqi from Ibn Umar. - Jamal al-Din. I say: It is extracted in the previous source and in (Takhrij Al-Tahawiyyah) (218).\n(5) Narrated by Imam Muslim from Ibn Masud. - Jamal al-Din. [80]\n\nwhen Allah has forgiven you your past and future sins? He would say: (Should I not be a grateful servant?). May Allah make us among His grateful servants, grant us understanding in religion, and gather us with those whom He has blessed among the Prophets, the Truthful, the Martyrs, and the Righteous. And praise be to Allah, Lord of the Worlds.\nIts author (Muhammad Jamal al-Din al-Qasimi) said: I reviewed its draft then revised it to what you see, and that was in sessions the last of which was in Rabi' al-Akhir year 1332 at our home in Damascus, Syria (1). And praise be to Allah, Possessor of Majesty and Honor.",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 59
  },
  {
    "serial_number": "4613351",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 81,
    "volume_number": 1,
    "text": "(1) His home was in Qasr Hajjaj near Jami' Hassan on the Midan road between Bab al-Jabiya and al-Suwayqa. [81]\n\nCompleting the Advice regarding Rules of Wiping\nIn the name of Allah, the Most Gracious, the Most Merciful\nTo proceed, when I finished commenting on this blessed beneficial treatise, I saw that to complete the benefit from it, I should follow the path of its author, may Allah Almighty have mercy on him, in verifying the statement regarding issues that are frequently encountered and asked about, and have a strong connection to its subject, namely:\n\n1 - Wiping over Sandals\n\n2 - Wiping over torn Khuff (leather socks) or Socks\n\n3 - Does removing the wiped article break Wudu?\n\n4 - When does the duration of wiping begin?",
    "foot_note": "None\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "343",
    "new_page_number": 60
  },
  {
    "serial_number": "4613357",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 85,
    "volume_number": 1,
    "text": "5 - Does the expiration of the wiping duration break Wudu?\nSo I say, seeking help from Allah alone, relying upon Him: [85]\n\n1 - Wiping over Sandals\nAs for wiping over sandals, it became famous among the late scholars that it is not permissible to wipe over them. We do not know any evidence for them on that except what Al-Bayhaqi said in his (Sunan) (1 / 288): (The origin is the obligation of washing the feet unless specified by an established Sunnah or a consensus in which there is no disagreement, and there is neither of these regarding wiping over sandals nor over socks. And Allah knows best).\nThus he said. It is not hidden what this contains - unfortunately - of ignoring the Hadiths presented in the treatise proving wiping over socks and sandals, the chains of some of which are authentic as previously explained. Therefore, Al-Turkmani Al-Hanafi critiqued him in (Al-Jawhar Al-Naqi) saying (1 / 288): (I say: This is prohibited, for it has been presented that Al-Tirmidhi authenticated wiping over socks and sandals and declared it Hasan from the Hadith of Huzail from Al-Mughira, and also declared it Hasan from the Hadith of Al-Dahhak from Abu Musa. Ibn Hibban authenticated wiping over sandals from the Hadith of Aws, and Ibn Khuzaima authenticated (1) the Hadith of Ibn Umar regarding wiping over the Sibtiyyah sandals.",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 61
  },
  {
    "serial_number": "4613359",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 86,
    "volume_number": 1,
    "text": "(1) (Sahih Ibn Khuzaima) p. 100 Al-Maktab Al-Islami printing. [86]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 62
  },
  {
    "serial_number": "4613360",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 87,
    "volume_number": 1,
    "text": "And what Al-Bayhaqi mentioned from the Hadith of Zaid bin Al-Hubbab from Al-Thawri (meaning with his chain from Ibn Abbas and it has passed) regarding wiping over sandals is a good (Jayyid) Hadith, and Ibn Al-Qattan authenticated it from Ibn Umar).\nI say: If you know this, it is not permissible to hesitate in accepting this concession after the establishment of the Hadith regarding it, because as the author said previously: (When the Hadith is authentic, there is nothing but hearing and obeying). Especially after the practice of the Companions, foremost among them the Righteous Caliph Ali bin Abi Talib, may Allah be pleased with him, as presented. It is what some Imams of the Righteous Salaf, may Allah be pleased with them all, held.\nIbn Hazm, may Allah Almighty have mercy on him, said in (Al-Muhalla) (2 / 103): (Issue: If the leather socks are cut below the ankles, wiping over them is permissible. This is the saying of Al-Awza'i. It was narrated from him that he said: The Muhrim wipes over leather socks cut below the ankles... Others said: He does not wipe over them unless they are above the ankles). [87]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 63
  },
  {
    "serial_number": "4613361",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 88,
    "volume_number": 1,
    "text": "2 - Wiping over torn Khuff (leather socks) or Socks\nAs for wiping over torn Khuff or socks, they differed greatly on it. Most of them prevent it with a long disagreement among them visible in extended Fiqh books and (Al-Muhalla). Others went to permissibility, which is what we choose. Our argument for that is that the origin is permissibility. So whoever prevents and stipulates freedom from holes or sets a limit for it, it is rejected due to his saying, peace be upon him: (Sahih) (Every condition not in the Book of Allah is invalid) Agreed upon.\nAlso, it is authentic from Al-Thawri that he said: (Wipe over them as long as your foot clings to them. Were the leather socks of the Muhajirin and Ansar anything but riddled with holes, slit, and patched?) Extracted by Abd al-Razzaq in (Al-Musannaf) (753) and from his path Al-Bayhaqi (1 / 283).\nIbn Hazm said (2 / 100): (If there is a hole in the leather socks or what is worn on the feet, small or large, lengthwise or crosswise, such that part of the foot appears from it, less of the foot or most of it or both, all of that is equal, and wiping [88]\n\nover all that is permissible as long as something of them clings to the feet. This is the saying of Sufyan Al-Thawri, Dawood, Abu Thawr, Ishaq bin Rahwayh, and Yazid bin Harun). Then he narrated the sayings of the scholars preventing it despite their differences and contradiction, then refuted them and showed that they have no evidence other than opinion. He concluded by saying: (But the truth in that is what the Sunnah clarifying the Quran brought: that the ruling of the feet which have nothing worn on them to wipe over is to be washed, and their ruling if there is something worn on them is to wipe over that thing. With this came the Sunnah {and your Lord was not forgetful} (1). The Messenger of Allah, peace be upon him, knew when he commanded wiping over leather socks and what is worn on the feet and wiped over socks - that among leather socks and socks and other things worn on the feet are those torn with large holes or not large, and the non-torn, and the red, black, white, new, and old. He, peace be upon him, did not specify some of that over others. Had the ruling of that differed in religion, Allah Almighty would not have neglected to reveal it, nor would the Messenger of Allah, peace be upon him, upon whom clarification is obligatory, have neglected it; far be it from him.",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 64
  },
  {
    "serial_number": "4613363",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 89,
    "volume_number": 1,
    "text": "(1) Maryam / 64 [89]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 65
  },
  {
    "serial_number": "4613364",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 90,
    "volume_number": 1,
    "text": "So it is correct that the ruling of that is wiping in every case, and wiping does not require encompassing [the whole area] in the language with which we were addressed).\nSheikh al-Islam Ibn Taymiyyah said in his (Ikhtiyarat) (p. 13): (It is permissible to wipe over wraps in one of the two views narrated by Ibn Tamim and others, and over torn leather socks as long as the name remains and walking in them is possible. This is the old saying of Al-Shafi'i's two sayings and the choice of Abu Al-Barakat and other scholars).\nI say: Al-Rafi'i attributed it in (Sharh Al-Wajiz) (2 / 370) to the majority, and argued for it that saying wiping is prevented narrows the door of concession, so wiping must be [allowed]. He was correct, may Allah have mercy on him. [90]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 66
  },
  {
    "serial_number": "4613365",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 91,
    "volume_number": 1,
    "text": "3 - Does removing the wiped article break Wudu?\nScholars also differed regarding one who removes the leather sock or similar after performing ablution and wiping over it, on three opinions:\nFirst: His ablution is valid and nothing is required of him.\nSecond: He is required to wash his feet only.\nThird: He is required to repeat ablution.\nEach of these opinions was held by a group of the Salaf. Abd al-Razzaq extracted traditions from them regarding that in (Al-Musannaf) (1 / 210 / 809-813), and Ibn Abi Shaybah (1 / 187-188), and Al-Bayhaqi (1 / 289-290).\nThere is no doubt that the first opinion is the most preponderant because it is appropriate for wiping being a concession and facilitation from Allah, and saying otherwise contradicts that as Al-Rafi'i said in the previous issue as mentioned.\nIt is preferred over the other two opinions by another preponderant factor, nay two factors:\nFirst: It agrees with the action of the Righteous Caliph Ali bin Abi [91]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 67
  },
  {
    "serial_number": "4613366",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 92,
    "volume_number": 1,
    "text": "Talib, for we presented with a Sahih chain from him, may Allah be pleased with him, that he broke his wudu, then performed ablution and wiped over his sandals, then took them off, then prayed.\nThe other: Its agreement with correct reasoning, for if he wiped over his head then shaved, he would not be required to repeat wiping, let alone ablution. This is what Sheikh al-Islam Ibn Taymiyyah chose, saying in his (Ikhtiyarat) (p. 15): (The ablution of one who wipes over leather socks and turbans is not invalidated by removing them nor by the expiration of the period, and he is not required to wipe his head nor wash his feet. This is the Madhhab of Al-Hasan Al-Basri. Like removing wiped hair according to the correct view of Ahmad's Madhhab and the saying of the majority). It is also the Madhhab of Ibn Hazm, so refer to his speech on that and his discussion with those who opposed. For it is precious. (Al-Muhalla) (2 / 105-109).\nAs for what Ibn Abi Shaybah (1 / 187) and Al-Bayhaqi (1 / 289) narrated from a man from the Companions of the Prophet, peace be upon him, regarding a man who wipes over his leather socks then decides to remove his socks, he said: He washes his feet. In it is Yazid bin Abd al-Rahman Al-Dalani. Al-Hafiz said: Truthful but errs often and used to practice Tadlis. Al-Bayhaqi narrated something similar from Abu Bakrah [92]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 68
  },
  {
    "serial_number": "4613367",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 93,
    "volume_number": 1,
    "text": "and its men are trustworthy except Ali bin Muhammad Al-Qurashi whom I did not know.\nThen he narrated from Al-Mughira bin Shu'ba raised (Marfu'): (Wiping over leather socks is three days and their nights for the traveler and a day and a night for the resident as long as he does not remove [them]). He said: (Umar bin Rudayh was unique in it and he is not strong).\nI say: This addition (as long as he does not remove) is Munkar due to the uniqueness of this weak narrator and lack of a supporting witness for it. [93]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 69
  },
  {
    "serial_number": "4613368",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 94,
    "volume_number": 1,
    "text": "4 - When does the duration of wiping begin?\nScholars have two known opinions on this issue:\nFirst: That it begins from the Hadath (impurity) after wearing.\nThe other: From the wiping after Hadath.\nAbu Hanifa, Al-Shafi'i, Ahmad, and their companions went to the first view, and we do not know any evidence for them worth mentioning except mere opinion. Therefore, some of their companions opposed them as will come. Nor did I know a predecessor for them among the Companions, unlike the second saying, for their leader is the authentic Hadiths and the Fatwa of Umar bin Al-Khattab, may Allah be pleased with him.\nAs for the Sunnah, the authentic Hadiths narrated by a group of Companions in Sahih Muslim, the four Sunan, Musnads, and others, contain that the Prophet, peace be upon him, commanded wiping, and in some: permitted wiping, and in others: made wiping for the resident a day and night and for the traveler three days and their nights. It is very clear that the Hadith is like a text stating that the beginning of the wiping duration is from the direct act of wiping. It is also like a text rejecting the first saying because its implication, as they stated in Furu' (branches), [94]\n\nis that whoever prayed Fajr just before sunrise then had impurity at Fajr of the second day, then performed ablution and wiped for the first time for Fajr prayer, he has no right to wipe after that. Can it be truly said of such a person that he wiped for a day and a night?\nAs for the second preponderant opinion, he can wipe until just before Fajr of the third day.\nIn fact, they said stranger things than what we mentioned: If he had impurity and did not wipe until a day and night passed after the impurity, or three days if he was a traveler, the duration expired and wiping is not permissible after that until he renews wearing upon purity (1). So they deprived him of benefiting from this concession based on this opinion contradicting the Sunnah.\nTherefore, Imam Al-Nawawi had no choice but to oppose his Madhhab - while he is eager not to oppose it whenever he finds a way - due to the strength of evidence. He said, may Allah Almighty have mercy on him, after mentioning the first opinion and those who held it (1 / 487): (Al-Awza'i and Abu Thawr said: The duration begins from when he wipes after impurity. It is a narration from Ahmad and Dawood, and it is the chosen view preponderant in evidence. Ibn al-Mundhir chose it, and narrated something similar from Umar bin Al-Khattab, may Allah be pleased with him. Al-Mawardi and Al-Shashi narrated from Al-Hasan Al-Basri that its beginning is from wearing. Those who say from the time of wiping argued with his saying, peace be upon him: (The traveler wipes for three days))",
    "foot_note": "None\n\nNone",
    "book_id": "343",
    "new_page_number": 70
  },
  {
    "serial_number": "4613370",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 95,
    "volume_number": 1,
    "text": "(1) Al-Nawawi mentioned it in Al-Majmu' (1 / 486) [95]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 71
  },
  {
    "serial_number": "4613371",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 96,
    "volume_number": 1,
    "text": "These are Sahih Hadiths as previously mentioned. This is an explicit statement that he wipes for three, and that cannot be unless the duration is from wiping. Also because Al-Shafi'i, may Allah be pleased with him, said: If he has impurity while resident and wipes while traveling. So he attached the ruling to wiping.\nOur companions argued with a narration narrated by Hafiz Al-Qasim bin Zakariya Al-Mutarrizi in the Hadith of Safwan: (From impurity to impurity). It is a strange (Gharib) addition that is not established. And [they argued] by analogy...). End quote.\nI say: The analogy referred to, even if its correctness were conceded in itself, the condition for accepting and arguing with it is only if it does not contradict the Sunnah. But since it contradicts it as you saw, it is not permissible to pay attention to it. Therefore it was said: When the tradition (Athar) arrives, speculation (Nazar) becomes invalid. And when the river of Allah comes, the river of Ma'qil becomes invalid. How much more so when it also contradicts the saying of the Righteous Caliph Umar bin Al-Khattab. My experience with imitators is that they claim to take the authentic Sunnah when it contradicts his saying, may Allah be pleased with him, as they did in Triple Divorce, so why do they not take it when it agrees with the Sunnah?\nAbd al-Razzaq narrated in (Al-Musannaf) (1 / 209 / 807) from Abu Uthman Al-Nahdi who said: (Sahih Chain) (I attended Sa'd and Ibn Umar disputing before Umar regarding wiping over leather socks. Umar said: One wipes over them for the like of his hour from his day and night).\nI say: Its chain is Sahih on the condition of the Two Sheikhs. It is [96]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 72
  },
  {
    "serial_number": "4613372",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 97,
    "volume_number": 1,
    "text": "explicit that wiping begins from the hour of performing it on the Khuff until the like of it from the day and night. This is the apparent meaning of all Athar narrated from the Companions regarding the duration of wiping as far as we know from what Abd al-Razzaq and Ibn Abi Shaybah extracted in (Al-Musannaf). For example, I mention what Ibn Abi Shaybah narrated (1 / 180) from Amr bin Al-Harith who said: (I went out with Abdullah to Al-Mada'in, so he wiped over leather socks for three [days] not removing them). Its chain is Sahih on the condition of the Two Sheikhs. Thus, the Salafi Athar agreed with the Muhammadan Sunnah on what we mentioned, so hold fast to it, you will be, by Allah's permission, guided. [97]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 73
  },
  {
    "serial_number": "4613373",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 98,
    "volume_number": 1,
    "text": "5 - Does the expiration of the wiping duration break Wudu?\nScholars have opinions on that, the most famous being two opinions in the Shafi'i school:\nFirst: Renewing ablution is obligatory.\nSecond: Washing feet suffices.\nAnd Third: Nothing is required of him, rather his purity is valid and he prays with it as long as he does not have impurity (Hadath).\nAl-Nawawi, may Allah have mercy on him, said. I say: This third opinion is the strongest, and it is the one Al-Nawawi chose contrary to his Madhhab as well. He said, may Allah have mercy on him (1 / 527): (This Madhhab was narrated by Ibn al-Mundhir from Al-Hasan Al-Basri, Qatada, and Sulayman bin Harb. Ibn al-Mundhir chose it, and it is the chosen stronger view. Our companions narrated it from Dawood).\nI say: Al-Sha'rani narrated it in (Al-Mizan) (1 / 150) from Imam Malik, and Al-Nawawi narrated other than it from him, so let it be verified. It is what Sheikh al-Islam Ibn Taymiyyah went to as you see in his previous words in the third issue (p. 92) following Ibn Hazm. He mentioned among those who held it Ibrahim Al-Nakha'i and Ibn Abi Layla, then said (Vol 2 / p 94): [98]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 74
  },
  {
    "serial_number": "4613374",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Wiping over Socks and Sandals",
    "edition": "None",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 99,
    "volume_number": 1,
    "text": "(And this is the opinion other than which is not permissible, because there is nothing in the reports stating that purity is invalidated from the ablution limbs or some of them by the expiration of the wiping time. Rather, he, peace be upon him, only forbade anyone to wipe more than three for the traveler or a day and night for the resident. So whoever says other than this has inserted into the report what is not in it, and attributed to the Messenger of Allah, peace be upon him, what he did not say. Whoever does that mistakenly, there is nothing upon him, and whoever does that deliberately after proof is established against him has committed a major sin. Purity is not invalidated except by Hadath, and this person's purity was valid and he did not have Hadath, so he is pure. The pure person prays as long as he does not have Hadath or unless an explicit text comes that his purity is invalidated even if he did not have Hadath. This person whose wiping time expired did not have Hadath, nor did a text come that his purity was invalidated neither from some of his limbs nor from all of them. So he is pure and prays until he has Hadath. At that time, he removes his leather socks and what is on his feet, performs ablution, then starts wiping again for another duration, and so on forever. And with Allah Almighty is success).\nBeirut 8 / 12 / 1370\nMuhammad Nasir al-Din al-Albani [99]",
    "foot_note": "None",
    "book_id": "343",
    "new_page_number": 75
  }
]