[
  {
    "serial_number":"4093082",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":0,
    "volume_number":1,
    "text":"القسم: الفقه الحنبلي الكتاب : مجموعٌ فيه أربع رسائل للحجاوي 1 - قاعدة في معرفة الأرطال العراقيَّة بالأوزان الدِّمشقية وغيرها من البلدان الآفاقية 2 - فُتيا في مسألة في الربا ( بيع التمر المعجون ) والفصل بين الشويكي وابن عطوة فيها 3 - جواب عن الكتاب المعتمد في المذهب 4 - نظم أحكام الوضوء والصلاة المؤلف : موسى بن أحمد الحجاوي الحنبلي ( ت 968 هـ ) المحقق : عبد السلام بن محمد الشويعر الناشر : ركائز للنشر والتوزيع الطبعة : الأولى ، 1439 هـ - 2018 م عدد الصفحات : 67 أهداه للشاملة : ركائز للنشر والتوزيع ؛ جزاهم الله خيرا [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 7 جُمادَى الأولى 1443\nالكتاب : مجموعٌ فيه أربع رسائل للحجاوي 1 - قاعدة في معرفة الأرطال العراقيَّة بالأوزان الدِّمشقية وغيرها من البلدان الآفاقية 2 - فُتيا في مسألة في الربا ( بيع التمر المعجون ) والفصل بين الشويكي وابن عطوة فيها 3 - جواب عن الكتاب المعتمد في المذهب 4 - نظم أحكام الوضوء والصلاة المؤلف : موسى بن أحمد الحجاوي الحنبلي ( ت 968 هـ ) المحقق : عبد السلام بن محمد الشويعر الناشر : ركائز للنشر والتوزيع الطبعة : الأولى ، 1439 هـ - 2018 م عدد الصفحات : 67 أهداه للشاملة : ركائز للنشر والتوزيع ؛ جزاهم الله خيرا [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 7 جُمادَى الأولى 1443\n1 - قاعدة في معرفة الأرطال العراقيَّة بالأوزان الدِّمشقية وغيرها من البلدان الآفاقية 2 - فُتيا في مسألة في الربا ( بيع التمر المعجون ) والفصل بين الشويكي وابن عطوة فيها 3 - جواب عن الكتاب المعتمد في المذهب 4 - نظم أحكام الوضوء والصلاة المؤلف : موسى بن أحمد الحجاوي الحنبلي ( ت 968 هـ ) المحقق : عبد السلام بن محمد الشويعر الناشر : ركائز للنشر والتوزيع الطبعة : الأولى ، 1439 هـ - 2018 م عدد الصفحات : 67 أهداه للشاملة : ركائز للنشر والتوزيع ؛ جزاهم الله خيرا [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 7 جُمادَى الأولى 1443\n2 - فُتيا في مسألة في الربا ( بيع التمر المعجون ) والفصل بين الشويكي وابن عطوة فيها 3 - جواب عن الكتاب المعتمد في المذهب 4 - نظم أحكام الوضوء والصلاة المؤلف : موسى بن أحمد الحجاوي الحنبلي ( ت 968 هـ ) المحقق : عبد السلام بن محمد الشويعر الناشر : ركائز للنشر والتوزيع الطبعة : الأولى ، 1439 هـ - 2018 م عدد الصفحات : 67 أهداه للشاملة : ركائز للنشر والتوزيع ؛ جزاهم الله خيرا [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 7 جُمادَى الأولى 1443\n3 - جواب عن الكتاب المعتمد في المذهب 4 - نظم أحكام الوضوء والصلاة المؤلف : موسى بن أحمد الحجاوي الحنبلي ( ت 968 هـ ) المحقق : عبد السلام بن محمد الشويعر الناشر : ركائز للنشر والتوزيع الطبعة : الأولى ، 1439 هـ - 2018 م عدد الصفحات : 67 أهداه للشاملة : ركائز للنشر والتوزيع ؛ جزاهم الله خيرا [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 7 جُمادَى الأولى 1443\n4 - نظم أحكام الوضوء والصلاة المؤلف : موسى بن أحمد الحجاوي الحنبلي ( ت 968 هـ ) المحقق : عبد السلام بن محمد الشويعر الناشر : ركائز للنشر والتوزيع الطبعة : الأولى ، 1439 هـ - 2018 م عدد الصفحات : 67 أهداه للشاملة : ركائز للنشر والتوزيع ؛ جزاهم الله خيرا [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 7 جُمادَى الأولى 1443\nالمؤلف : موسى بن أحمد الحجاوي الحنبلي ( ت 968 هـ ) المحقق : عبد السلام بن محمد الشويعر الناشر : ركائز للنشر والتوزيع الطبعة : الأولى ، 1439 هـ - 2018 م عدد الصفحات : 67 أهداه للشاملة : ركائز للنشر والتوزيع ؛ جزاهم الله خيرا [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 7 جُمادَى الأولى 1443\nالمحقق : عبد السلام بن محمد الشويعر الناشر : ركائز للنشر والتوزيع الطبعة : الأولى ، 1439 هـ - 2018 م عدد الصفحات : 67 أهداه للشاملة : ركائز للنشر والتوزيع ؛ جزاهم الله خيرا [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 7 جُمادَى الأولى 1443\nالناشر : ركائز للنشر والتوزيع الطبعة : الأولى ، 1439 هـ - 2018 م عدد الصفحات : 67 أهداه للشاملة : ركائز للنشر والتوزيع ؛ جزاهم الله خيرا [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 7 جُمادَى الأولى 1443\nالطبعة : الأولى ، 1439 هـ - 2018 م عدد الصفحات : 67 أهداه للشاملة : ركائز للنشر والتوزيع ؛ جزاهم الله خيرا [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 7 جُمادَى الأولى 1443\nعدد الصفحات : 67 أهداه للشاملة : ركائز للنشر والتوزيع ؛ جزاهم الله خيرا [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 7 جُمادَى الأولى 1443\nأهداه للشاملة : ركائز للنشر والتوزيع ؛ جزاهم الله خيرا [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 7 جُمادَى الأولى 1443\n[ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 7 جُمادَى الأولى 1443\nتاريخ النشر بالشاملة : 7 جُمادَى الأولى 1443",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093083",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":3,
    "volume_number":1,
    "text":"مؤلفات الحجاوي مجموعٌ فيه أربع رسائل: 1\/ قاعدة في معرفة الأرطال العراقيَّة بالأوزان الدِّمشقية وغيرها من البلدان الآفاقية 2\/ فُتيا في مسألة في الربا (بيع التمر المعجون) والفصل بين الشويكي وابن عطوة فيها 3\/ جواب عن الكتاب المعتمد في المذهب 4\/ نظم أحكام الوضوء والصلاة للشيخ موسى بن أحمد الحجَّاوِي الحَنبلي (ت 968 هـ) اعتنى بها وحققها: أ. د. عبدالسَّلام بن محمد الشُّويعر",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093084",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":5,
    "volume_number":1,
    "text":"الحمد لله، وأشهد أن لا إله إلا الله، واشهد أنّ محمداً عبده ورسوله صلى الله عليه وآله وسلم. أمّا بعد. فهذا مجموعٌ فيه أربع رسائل من مؤلفات الشيخ موسى الحجاوي (ت 968 هـ)، سَعيتُ في إخراجه بعد أن وفّق الله تعالى في إخراج كتابه الأول (شرح منظومة الآداب) في عام 1425 هـ. وهما ثلاث رسائل مَنَّ الله تعالى عليَّ بالسعي في إخراجها بعد أن ظلَّت رَهينَةَ المَحبَسَين (الذِّكْرِ، وخزانة الكتب)، فلم تُذكر في فهارسِ المخطوطات، ولم يعدّها المؤرخون ضمن مؤلفات الشيخ العلامة موسى بن أحمد الحجاوي مع ما لهما من أهمية لا تُنكر. والرسائل هي: 1\/ قاعدة في معرفة الأرطال العِرَاقيَّة بالأوزَانِ الدِّمشقِيَّة، وَغيرها من البلدان الآفاقية. 2\/ فُتيا في مسألة في الربا. 3\/ جواب للشيخ مُوسَى الحجَّاوي عن الكتاب المعتمد في المذهب. 4\/ ورابع هذه الرسائل: نظم أحكام الوضوء والصلاة.",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093085",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":6,
    "volume_number":1,
    "text":"أمّا  الرسالة الأولى: فإنّها تتحدث عن مقاييس الأرطال، واختلافها، وتعديلها بالدَّراهم. وقد قارن فيها المؤلِّفُ بين الأرطَال العراقية وغيرها من أرطال البلدان الآفاقية؛ كالدمشقي، والمصري، والليثي، والاسكندري، والبعلبكي، والطبراني، والقدسي، والنابلسي، والحمصي، والحلبي، والبيروتي، والحَمَوي، والبَصْري، والمكي، والمدني، وغيرِها. فحَفِظَت لنا هذه الرسالةُ -على صغرها- مَعلُومَاتٍ هامةً في الفرق بين هذه الأرطال في الوزن، والتي قلَّما نجدها في الكُتب المطبوعة والمتداولة بين أيدينا. إضافةً لتعديل هذه الأرطال وحساب كيفية تحويل المقاييس إليها؛ بالمقاييس الأخرى الشرعية؛ كالصَّاع، والقلتين ونحو ذلك. كما أنها تبين لنا طريقةَ علماء القرن العاشر في بعض المسائل الحسابية، والجبرية ذات المجهولين. والرَّطل يُستخدم كوحدةِ كَيْلٍ في الغالب، وقد يُستخدَمُ كوحدةِ وَزْنٍ في أحايين مُعيّنة (1) .",
    "foot_note":"1. قال أبو العباس العزفي السبتي (633 هـ) في كتابه [إثبات ما ليس منه بُد ص 142]: (الرّطل اسم مذكر يقال بالفتح في الراء والكسر، وهو اسم لمقدار من الموزونات تقديره بالعرف لا بالوضع، وهو أيضا اسم لما يعايره به الموزونات من حديد أو نحاس أو رصاص أو حجر، وقد يكون اسماً لما يكال به مثل المد والصاع). وقال الأزهري في [المزهر]: (ويكون كيلاً ووزناً).",
    "book_id":"18"
  },
  {
    "serial_number":"4093086",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":7,
    "volume_number":1,
    "text":"ولكنه في إطلاقات الفقهاء المتأخرين، واستخدامات عامة الناس يعدُّ أحد أنواع المكاييل المعروفة في العصور السابقة (1) والتي يُكَالُ به السوائل وغيرها (2) . ويختلف قدر (الرطل) وحجمه بحسب اصطلاح أهل الأقاليم؛ كما ذكر ذلك الجرجاني في (التعريفات) (3) ، قال الشيخ أبو الحسن الماوردي (ت 450 هـ): (وقد اصطلح أهل كل أقليم على أرطال تتفاضلُ في الزيادة والنقصان .. وفي المحلات أرطال مختلفة والتعامل بها في الأسواق، ولم أسمع أن بلدةً وافق رطلُها الأخرى إلا نادراً) (4) . وقال الشيرازي: (وقد اصطلح أهل كل إقليم وبلد في المعاملة على أرطال تتفاضل في الزيادة والنقصان سيما أهل الشام خاصة) (5) .",
    "foot_note":"1. ذكر ابن مفلح في [الفروع 4\/ 77] أن المكاييل نُقل تقديرها إلى الوزن ليُحفظ ويُنقل. \n2. يذكر د. سامح فهمي في كتابه (المكاييل في صدر الإسلام ص 46) أن الرطل مكيال للسوائل فحسب؛ استدلالاً بقول الشاعر: لها رطل تكيل الزيت فيه \n…. وفلاح يسوق بها حمارا لكن هذا الاستدلال لا يرقى لتخصيص هذا المكيال بالسوائل فقط، فقد جاء الكثير من النصوص التراثية بقياس اللحم والخبز وغيرها بالرّطل، فدلَّ على أن الرطل مكيال ليس خاصاً بالسوائل فقط. \n3. التعريفات للجرجاني ص 240. \n4. الرتبة في طلب الحسبة، للماوردي ص 168، 173. \n5. نهاية الرتبة ص 15.",
    "book_id":"18"
  },
  {
    "serial_number":"4093087",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":8,
    "volume_number":1,
    "text":"وقال ابن الإخوة (ت 729 هـ): (الرطل فيه اختلاف كثير في الأمصار والبلدان … ولم أسمع أن بلداً وافق رطلها لبلدة أخرى إلا نادراً، أو قرية لقرية لا يؤبه لها) (1) . وقال ابن الهُمام (ت 861 هـ): (الرطل والأوقية مختلف فيها عرف الأمصار ويختلف في المصر الواحد أمر المبيعات) (2) . بل إنه ذُكرَ أنَّ أهلَ البلد الواحد يتعاملون بأكثر من رطل؛ فللَّحمِ، وللخُبز رطلٌ غيره، وتختلف عن رطل باقي الحوائج وهكذا (3) . حتى قال ابن دريد اللغوي المعروف (ت 321 هـ): (الرطل كَيلٌ لا أقفُ على مقداره) (4) . وهذا الاختلاف في المكاييل (ومثله الاختلاف في الموازين المتداولة) يُوقِع في الكثيرِ من الاستشكال والحَرَج؛ لذا همَّ عمر بن عبد العزيز (ت 101 هـ) أن يُوحِّد المكاييل والأوزان فجاء عنه أنه كتب إلى عُمَّاله: (نرى أنَّ تمام مكيال الأرض وميزانها أن يكون واحداً في جميع الأرض كُلِّها) (5) .",
    "foot_note":"1. معالم القربة، لابن الإخوة ص 82. \n2. فتح القدير 7\/ 17. \n3. المصدر السابق. \n4. إثبات ما ليس منه بد ص 135. \n5. رواه ابن عبد الحكم في (سيرة عمر بن عبد العزيز على ما رواه مالكٌ وأصحابه ص 87).",
    "book_id":"18"
  },
  {
    "serial_number":"4093088",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":9,
    "volume_number":1,
    "text":"وهذا الأمر وإن لم يتم في ذلك الزمان سياسةً (وتمَّ بعد ذلك بقرون)، إلا أن علماء المسلمين لم يغفلوا هذا الجانب حقَّه مِن البحث والنظر، ولم يقتصر ذلك على مَن كتب في الحساب والجبر فقط، بل وتعداهم إلى فقهاء الشريعة وعلمائها فعُنوا بالفروق بين الأرطال ومقاييسها؛ فنرى العديدَ منهم يتحدث عن هذا الموضوع في الكتب الفقهية، أو كتب السياسة الشرعية، أو في كتب الكُتَّاب وأصحاب الخراج، بل وفي الرحلات أيضاً؛ فيذكر الأستاذ أحمد فارس الشدياق عندما زار بريطانيا سنة 1848 م مقدار الرطل الإنجليزي وأنه يعادل نحو 150 درهماً (1) ، وهذا منه استناناً بالأوائل فكتاب المقدسي حفظ لنا الكثير من هذه المقاييس حتى عُدَّ مرجعاً مهماً لكثيرٍ ممن كتب في هذا الموضوع.",
    "foot_note":"1. كشف المخبا عن تمدن أوربا، أحمد فارس الشدياق ص 91.",
    "book_id":"18"
  },
  {
    "serial_number":"4093089",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":10,
    "volume_number":1,
    "text":"وقد عُني الفقهاء المسلمين بتحديد مقادير وحدات الكيل والأوزان تحديداً بيناً واضحاً خشية من الوقوع في الإثم والتطفيف، وأُوكل ذلك إلى المحتسبين؛ وجعل من وظائفهم. وأمّا عنايتهم بتقدير حجم الرطل بالخصوص؛ فلأن الفقهاء اعتمدوه، وجعلوه معياراً للكيل، قال أبو محمد ابن القطان (ت بعد 647 هـ): (إنما نظرنا في معنى الرطل من حيث الأخذ في تفهم المد المذكور، لا لأنه واقع في لفظ النبي × في هذا الباب ولا في غيره) (1) . وما هذه الرسالة إلا واحدةٌ من جهود العلماء في هذا الباب.",
    "foot_note":"1. نقله عنه: الخزاعي في (تخريج الدلالات السمعية ص 615).",
    "book_id":"18"
  },
  {
    "serial_number":"4093090",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":11,
    "volume_number":1,
    "text":" الرسالة الثانية التي ألفها الشيخ موسى الحجاوي: فُتيا سُئل عنها الشيخ عن التمر إذا عُجن وصار معجوناً فهل يعتبر موزوناً لأم مكيلاً؟ ومِن ثمَّ هل يصحّ بيع هذا التمر المعجون باللحم الموزون؟ أم لا؟ وهذه المسألة كثر فيها كلام فقهاء الحنابلة في ذلك الوقت؛ كالمشايخ الشويكي الدمشقي، وأحمد بن عطوة، وعبد الله بن رَحمة النجدِيَين، وغيرهم ممّن قبلهم وبعدهم ممن عاصر هذه المسألة، وقد جمعتُ أسماءهم وكلامهم في هامش هذه الرسالة. فكتب فيها الشيخ موسى هذه الرسالة المختصرة للفصل فيها بين شيخيه الشويكي وأحمد بن يحيى بن عطوة. ولعلّ هذه الفتيا تكون مكملةً لبحث هذه المسألة من أعلام فقهاء مذهب الإمام أحمد في ذلك الوقت، ونهاية العِقد فيها -فيما أحسب-، فلم أقف على إثارتها بعدَه. و الرسالة الثالثة: جوابٌ عن سؤال سُئله الشيخ موسى الحجاوي، فيما إذا تعارض ما كتبه في «الإقناع»، وفي «حاشية التنقيح»، مع ما في «التنقيح» للمرداوي؟ فأيها المقدّم. ثم تعليق للشيخ العلامة محمد ابن ذهلان على هذه الفتوى.",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093091",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":12,
    "volume_number":1,
    "text":"وقد أيّد ابن منقور جواب الحجاوي، وقال عنه: (ولقد صدق وأنصف). وهو جواب مختصر على السؤال، لكن له من الأهمية الكبيرة ما هو بيّن. و الرسالة الرابعة: نظمٌ لشروط الوضوء وفروضه، وشروط الغسل، وشروط التيمم، وشروط الصلاة، وأركان الصلاة، وشروط الإمامة. وعدد أبياتها مجموعةً 31 بيتاً. وقد سعيتُ لإخراج هذه الرسائل لما أرجوه من النفع بها، أسأل الله تعالى الإخلاص في القول والعمل، وأن يرزقنا الفقه في دينه، وصلى الله وسلم على نبينا محمد وعلى آله وصحبه أجمعين.",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093092",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":13,
    "volume_number":1,
    "text":" التعريف بالمؤلف (1) : *  اسمه وَنسبُه: هو الشَّيخ العَلامة شَرف الدِّين أبو النَّجَا مُوسَى بن أحمَد بن مُوسَى بن سَالم بن عيسَى بن سَالم الحَجَّاوِيُّ، المَقْدِسِي، ثم الصَالِحِي، الدِّمَشْقِي، الحنبلي. مفتي الحنابلة في (دمشق)، وَعمدة المتأخرين من الحنابلة. *  مولده: ولد الشيخ موسَى في سنة (895 هـ) في «حَجَّة» -بفتح الحاء، وَتشديد الجيم المفتوحة-؛ إحدى نواحي نَابلس. *  شيوخه: قرأ الشَّيخ مُوسَى عَلى جَمعٍ من المشايخ، وَعلماء عصره؛ قال ابنُ حميد: \" ارتحَلَ إلى دمشقَ فسَكَنَ في (مدرسة شيخ الإسلامِ أبي عُمَر)، وَقرأ على مشايخ عصرِه \". ومِن الذين تتلمذ عليهم (الشيخُ مُوسَى الحجَّاوي): - أحمد بن محمد الشُّويكِي النَّابُلسِي (939 هـ).",
    "foot_note":"1. هذه الترجمة مأخوذة باختصار من مقدمة تحقيقي لشرح منظمة الآداب للمؤلف.",
    "book_id":"18"
  },
  {
    "serial_number":"4093093",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":14,
    "volume_number":1,
    "text":"- نجم الدين عمر بن إبراهيم ابن مُفلح (910 هـ). - أبو البركات محب الدين أحمد بن محمد خطيب مكة العقيلي. - كمال الدين محمد بن حمزة الحسيني (933 هـ). وغيرهم. *  تلاميذه: تتلمذ على الشيخِ موسى الحجاوي عددٌ كبير مِن طلاب العلم من بلاد متعددة. - وَمنهم: ابنُه يحيى بن موسى الحجَّاوي. - شهاب الدين الوفائي (1035 هـ). - زامل بن سلطان (قاضي الرياض). - أحمد بن محمد بن مشرَّف. - القاضي شهاب الدين أحمد بن محمد الشويكي (1007 هـ). - أبو بكر بن زيتون الصالحي (1012 هـ). - محمد بن شهاب الدين المرداوي المقدسي الشهير (بابن الديوان). - محمد بن أحمد الكردي الصالحي. وَغيرهم كثير.",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093094",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":15,
    "volume_number":1,
    "text":"*  مؤلفاته: ألّفَ الشيخ موسى العديدَ من المؤلفات التي طرح اللهُ تعالى لهَا القبولَ بين الناس؛ حتى صار عليها المعوَّلُ، وَإليها المرجعُ في الفَتوَى عند الأصحاب؛ قال الكمال الغزي: (صاحب المؤلفات التي سارت بها الركبان، وَتلقاها الناس بالقبول زماناً بعد زمان) (1) . ومنها: - الإقناع لطالب الانتفاع. طبع. - حاشية على الإقناع. - حاشية على التنقيح المشبع. طبع. - شرح منظومة الآداب. طبع بتحقيقي عن دار ابن الجوزي بالدمام. - رسالة في معرفة الأرطال العراقية بالأوزان الدمشقية وَغيرها. وهي هذه الرسالة، وسيأتي الحديث عنها بالتفصيل. - زاد المستقنع في اختصار المقنع. طبع. - شرح المفردات. - منظومة الكبائر. طبع مع شرح السَّفاريني لها.",
    "foot_note":"1. النعت الأكمل صـ 124.",
    "book_id":"18"
  },
  {
    "serial_number":"4093095",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":16,
    "volume_number":1,
    "text":"- وغيرها من الكتب. *  وفاته: توفي الشَّيخ مُوسَى بن أحمد الحجَّاوي يوم الخميس، ثاني عشَر ربيع الأول، سنة «968 هـ». ودفن (بسَفْحِ قَاسيُون) -رحمه الله تعالى، وَغَفَرَ لَه وَرَحمَه-.",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093096",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":17,
    "volume_number":1,
    "text":" وصف المخطوط، وطريقة العمل  (1) الرسالة الأولى:  أولاً: وصف المخطوط: اعتمدتُ في إخراج هذه الرسالة على مخطوط فريد محفوظ في مكتبة (بريستون) بالولايات المتحدة الإمريكية برقم (375 ب). ومنه نسخة مصورة في مكتبة الملك فهد الوطنية بالرياض، وقد حصلت على هذه المخطوطة عن طريقهم فلهم من الله الجزاء بالخير، ومني الدُّعَاءُ والثناء. وهذه المخطوطة ملحقة بمخطوط للجراعي ومجلدة معها، لذا لم يفطن لها المُفهرِس للتعريف بها. وتقع المخطوطة في (6) صفحات. وقد كتبت في سنة 966 هـ (أي في حياة المؤلف، وقبيل وفاته بعامين) وكتبها تلميذه محمد بن أحمد الكردي الصالحي. وهي نسخة جيدة في الجملة، لولا سقوط بعض الكلمات، والجمل، حاولت إثباتها في المتن بناءً على نتائج الحساب.  ثانياً: إثبات نسبته للمؤلف: إثبات هذه الرسالة للمؤلف من المسائل المهمة؛ لأن إسناد القول",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093097",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":18,
    "volume_number":1,
    "text":"لقائله يُعطِي المقولَ فائدةً وقوَّة. وقد دلَّ على نسبة هذه الرسالة للشيخ موسى بن أحمد الحجاوي أمور منها: أولاً: ما أثبت على الصفحة الأولى من المخطوط من نسبتها لمؤلفها، مع تقدّم نسخ المخطوط في حياة المؤلف. ثانياً: تشابه أسلوب هذه الرسالة مع غيرها من مؤلفات الشيخ موسى، وذلك باعتنائه فيها بالمذهب الحنبلي، بالإضافة لتشابه فكرة هذه الرسالة مع تعليقه على كتاب (التنقيح المشبع) للمرداوي. إضافة لما يُرى من اعتناء الشيخ موسى بهذه الجزئية في أكثر مِن موضع من مؤلَّفته (1) ، غيرَ مَا أملاه في هذه الرِّسَالة المختصَرة.  ثالثاً: تسمية الرسالة: لم أقف في المخطوط على اسمٍ لهذه الرسالة، ولم أجد اسمها في كُتب المترجمين، فجعلتُ لها اسماً أخذاً من مقدمة المؤلف فإنه قال: (فهذه قاعدة نافعة -إن شاء الله تعالى- تَنفعُ المُبتَدِي، وَتُعِينُ المُنتَهِي في مَعرفَةِ الأرطَال العِرَاقيَّة بالأوزان الدَّمشقية، وَغيرِها من البُلدَانِ الآفَاقِيَّة).",
    "foot_note":"1. ينظر: حواشي التنقيح ص 77 - 78، 92، الإقناع 1\/ 13، وينظر كذلك: كشاف القناع 3\/ 400.",
    "book_id":"18"
  },
  {
    "serial_number":"4093098",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":19,
    "volume_number":1,
    "text":" (2) الرسالة الثانية:  أولاً: وصف المخطوط: اعتمدتُ في إخراج هذه الرسالة على مخطوط أصلي محفوظ في المكتبة المركزية في جامعة الإمام محمد بن سعود الإسلامية بالرياض، مكونة من صفحتين، ولم يذكر فيها اسم الناسخ ولا تاريخ النسخ. وتقع الرسالة في صفحتين بخط النسخ، والورق متأخرٌ من الورق الصناعي، وأظنها مكتوبة في آخر القرن الثالث عشر على أبعد تقدير، أو أوائل الرابع عشر.  ثانياً: إثبات نسبته للمؤلف: هذه الرسالة في مضمونها ما يدلُّ على إثبات صحة نسبتها للشيخ موسى الحجاوي، فإضافةً للتصريح بنسبة هذه الفتيا للشيخ موسى الحجاوي في الغلاف، فإن فيها نقلاً عن اثنين من شيوخ المؤلف وهما الشويكي وابن عطوة؛ كما سيأتي في التوثيق. كما أنّها تتناول مسألةً مشهورةً في ذلك الزمان عند فقهاء الحنابلة عموماً، وفقهاء دمشق ونجد بالخصوص.",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093099",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":20,
    "volume_number":1,
    "text":" (3) الرسالة الثالثة:   أولاً: وصف المخطوط: اعتمدتُ في إخراج هذه الرسالة على فائدة مكتوبة على هامش إحدى النسخ الخطية الأصلية المحفوظة بالرياض. وهذا الجواب مكتوب في هامش الكتاب.   ثانياً: إثبات نسبته للمؤلف: هذا الجواب مضمونه يدلّ على صحة نسبته للحجاوي، وخصوصاً أنّ الشيخ أحمد ابن منقور، قد نقلها بالسند إليه.  (4) الرسالة الرابعة: أولاً: وصف المخطوط: هذه الأبيات ملحقة بالمخطوط المحفوظ في دار الكتب المصرية برقم 739 مجاميع، في وجه الورقة 20 وظهرها. والفضل بعد الله للتنبه لها، وإخراجها للأستاذ صالح بن محمد بن عبد الفتاح، حيث نشرها في كتابه (التقييدات الشهية ص 177)، ومنه استفدتُ في إخراجها. ثانياً: إثبات نسبته للمؤلف: هذه الأبيات منسوبة للشيخ موسى، وهو معروفٌ بنظمه الكثير، كما أن مضمون الأبيات متوافق مع مذهب الحنابلة، وفيها مسائل تعدُّ من مفرداته.",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093100",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":21,
    "volume_number":1,
    "text":"ثالثاً:  طريقة العمل في التحقيق: قمت بنسخ المخطوطات، وتصحيح ما وقع فيه من التحريف، أو السقط، وهي مواضع قليلة، نبهت عليها في الهامش. وذلك أن الرسالة الأولى تعتمد على الحساب في كثير من أجزائها، وربما كان من الناسخ سبق نظر فأسقط بعض الكلمات، أو الجمل، فأثبتها في المتن بين معكوفتين []، مع الإشارة لذلك في الهامش. وأمّا الرسالة الثالثة فإن التعليقات التي أوردها الناسخ فإني أثبتها في الهامش كما هي. ثم علَّقتُ بعد ذلك على بعض المواضع التي رَأيتُ أنها ذات أهمية في ذلك. ووَثَّقتُ المَسَائلَ التي ذكرَهَا المؤلِّفُ.",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093101",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":23,
    "volume_number":1,
    "text":" صور المخطوطات:",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093102",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":26,
    "volume_number":1,
    "text":"صورة مخطوط الرسالة الثانية",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093103",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":27,
    "volume_number":1,
    "text":"صورة مخطوط الرسالة الثالثة",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093104",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":29,
    "volume_number":1,
    "text":" قاعدة في معرفة الأرطال العِرَاقيَّة بالأوزَانِ الدِّمشقِيَّة، وَغيرها من البلدان الآفاقية للشيخ الفقيه موسى بن سالم الحجَّاوي الحنبلي (ت 968 هـ) اعتنى بتحقيقها والتعليق عليها: أ. د. عبد السلام بن محمد الشويعر",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093105",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":31,
    "volume_number":1,
    "text":"بسم الله الرحمن الرحيم الحمد لله رب العَالمين. وَصلى الله على سيدنا محمد وَآله وَصحبه أجمعين .. وَبعد. فهذه قاعدة نافعة (1) -إن شاء الله تعالى- تَنفعُ المُبتَدِي، وَتُعِينُ المُنتَهِي في مَعرفَةِ الأرطَال العِرَاقيَّة (2) بالأوزان الدَّمشقية، وَغيرِها من",
    "foot_note":"1. لخّص المؤلِّفُ هذه المباحث في قاعدة ذكرها في (حواشي التنقيح ص 78) فقال: (قاعدة تعرف منها الأوزان العراقية بالرطل المصري والدمشقي والقدسي والحلبي والبعلي. فإن زدتَ على الأوزان العراقية في القلتين وغيرهما مثلها خمس المرات ومثل ربعها ثم أخذت سُبع المجتمع فهو المصري. وإن زدتَ مثل ثمنها ثم أخذت سُبع المجتمع فهو القدسي. وإن زدتَ مثل ربعها ثم أخذتَ سُبع المجتمع فهو الحلبي. وإن أخذتَ سُبع العراقي من غير زيادة فهو البعلي). \n2. خُصّ التقديرُ بالأرطال العراقيّة؛ لأن المصنفين الأوائل من الحنابلة كانوا يقدّرون الكيل بها؛ وجُلّهم من حنابلة العراق؛ فمِنهم على سبيل المثال: أبو علي ابن أبي موسى (ت 428 هـ) في (الإرشاد ص 21)، وأبو الخطاب الكلوذاني (ت 510 هـ) في (الهداية 1\/ 11)، والسامري (ت 616 هـ) في (المستوعب 1\/ 10)، والبعقوبي (617 هـ)، وابن تميم (ت 675 هـ) في (مختصره 1\/ 36)، وأبو طالب البصري (ت 684 هـ) في (الحاوي الصغير ص 20)، و (الحاوي الكبير 1\/ 77، 142)، وابن حمدان (ت 695 هـ) في (الرعاية الصغرى 1\/ 328)، والدجيلي (ت 732 هـ) في (الوجيز 1\/ 113). وتبعهم الموفق ابن قدامة (620 هـ) في كُتبه (الكافي 1\/ 17)، و (المغني)، و (المقنع). وأمّا في (العمدة) فإنه قدّرها بالدمشقي. وهذا ما سار عليه مؤلفو الحنابلة الدماشقة؛ مثل: يوسف ابن عبد الهادي (ت 909 هـ) في (الدر النقي 1\/ 50)، وابن النجار في (المنتهى 1\/ 21)، وابن بلبان (ت 1083 هـ) في (أخصر المختصرات 1\/ 45 مع كشف المخدرات). بينما مؤلفو الحنابلة المصريون اعتمدوا تقدير القلتين بالرطل المصري؛ مثل البهوتي (ت 1059 هـ) في (عمدة الفقه ص 11)، وابن قايد النجدي ثم المصري في (هداية الراغب 1\/ 20). وأمّا البعليون من الحنابلة فإنهم ذكروا الثلاثة السابقة معاً، وأضافوا لها تقديرها بالرطل البعلي؛ كمحمد ابن بلبان البعلي (ت 1083 هـ) في (كافي المبتدي ص)، وأحمد البعلي (ت 1083 هـ) في (الروض الندي 1\/ 27). وأمّا الحرانيون فذكروها بالرطل الحراني، كابن تميم في (مختصره 3\/ 248).",
    "book_id":"18"
  },
  {
    "serial_number":"4093106",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":32,
    "volume_number":1,
    "text":"البُلدَانِ الآفَاقِيَّة. وَمعرفَةُ ذلك يَتَوقَّفُ على مَعرفة زِنَةِ (الرّطل العراقي) بالدِّرهَم الوَزني (1) ؛ لأن الدِّرهمَ الوَزْنيَّ لم يختلف في جاهلية وَلا إسلام (2) ، فلذلك جُعل الضَّبطُ بِه في المَكَاييل العِرَاقيَّة؛ لأن أصلَها الكيل، وَإنما نقلوا ذلك إلى الوَزنِ ليُحفَظ؛ لأن المكاييلَ تتغيَّر كَثيراً، وَالوَزنُ لا",
    "foot_note":"1. «الدرهم الوزني» ويُسمّى بدرهم الكيل، وهو الدرهم الذي ضربه عبد الملك بن مروان. \n2. قال وهب بن كيسان: (رأيتُ الدنانير والدراهم قبل أن ينقشها عبد الملك ممسوحة. وهى وزن الدنانير التي ضربها عبد الملك). ويُنظر: فتوح البلدان للبلاذري ص 472، الخراج والنظم المالية د. محمد ضياء الريس ص 343. وذكر ابن ظهيرة في (كفاية المحتاج ص 321) أنّ ذلك يُسمّى درهم الكيل؛ لأن الدرهم الشرعي يتركب منه، ومقداره خمسون حبّة وخُمسا حبّة.",
    "book_id":"18"
  },
  {
    "serial_number":"4093107",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":33,
    "volume_number":1,
    "text":"يَتغير؛ كما تقدَّم (1) . وَالأوزَانُ المذكورةُ في كُتُبِ الفقه (2) ، وَغيرها في القُلتين وَغيرهما مِن قَدرِ المَاء الّذي يُتَوَضَّأُ به وَيُغتَسَل (3) ، وَنِصَاب الزكاة من الحُبوب، وَالثمار (4) ، وَالعسل (5) ، والكفارات، وَالفطرة (6) ،",
    "foot_note":"1. الفقهاء قدروا المكاييل بالوزن؛ بسبب عدم وجود مقياسٍ متفق عليه للمساحة عند الأوائل إذ كثيراً ما تتغير أحجام المكاييل؛ قال الحجاوي (مؤلف هذه الرسالة) في كتابه (حواشي تنقيح ص 127): (والوسق والصاع والمد مكاييل نقلت إلى الوزن لأنها لا تعقل). وهذه المسألة -وهي تقدير المكاييل بالوزن- كان وما زالت محلّ إشكال عند كثير من الفقهاء حتى قال ابن الفخَّار القُرطبي المالكي (ت 419 هـ) معترضاً على مَن فعل ذلك: (المكيل لا يُعرَف بالوزن، والوزن لا يُعرَف بالمكيل، وما كان أصلُه الوزن فالكيل فيه مجهول) [التبصرة في نقد الرسالة لابن الفخار ص 108]. \n2. ذكر الشيخ تقي الدين أن عادة النبي × أنه يُقدّر المقدرات بأوعيتها؛ كالصاع، والوسق، والقلال، ونحوها [الفتاوى الكبرى 1\/ 216]. \n3. يحتاج إلى معرفة الكيل في أبواب الطهارة لتقدير الماء الذي لا يحمل الخبث وهو ما زاد على قلتين. ولمعرفة المقدار الذي يستحب الوضوء به وهو مدٌّ، أو يغتسل به وهو الصاع. \n4. والمقدار الذي ورد النصُّ به في زكاة الحبوب هو (الوسق). \n5. وهذا فرع على خلاف اختلاف الفقهاء في زكاة العسل. والمشهور من مذهب الحنابلة وجوب الزكاة فيه وأن نصابَه عشرة أَفْرَاقٍ، كل فَرَق ستون رطلاً. [مسائل الكوسج 1\/ 275، الشرح الكبير والإنصاف 6\/ 567]. \n6. وتقدر الكفارات وزكاة الخارج من الأرض، وزكاة الفطر بوحدة الصاع أو نصفه، أو بالمُد وضعفه. على حسب نوع الكفارة، مع مراعاة خلاف العلماء في ذلك، ونوع الطعام المُخرَج.",
    "book_id":"18"
  },
  {
    "serial_number":"4093108",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":34,
    "volume_number":1,
    "text":"وَغير ذلك (1) إنما هو بالعِرَاقي (2) فاحتَاجَ أهلُ كُلِّ بَلَدٍ مَعرفةَ هذه الأوزان. فإن كان رطلُهم مُوافقَاً لها؛ أي بقدر أوزانها؛ كبغداد اكتفوا بذكرها. وإن كان رطلُهم مخالفاً؛ كأكثر البلدان فإنهم محتاجون إلى",
    "foot_note":"1. كتقدير الخراج، ومقدار الجزية على أهل الذمّة ومَن في حكمهم. وكتقدير المهر، فقد قال إسحاق الحربي: (السنة الزواج على رطل). \n2. ذكر الحجَّاوي هنا أن الرطل المذكور في كتب الفقهاء إنما هو الرطل العراقي. وهو كذلك فإن التقدير بالرطل العراقي هو الغالب عند الفقهاء حتى قال المحب الطبري: (إنه الرطل الشرعي) [كفاية الأخيار 1\/ 382]. لكن ذكر ابن مفلح في (المبدع 3\/ 381) أن الرطل العراقي لم يكن في مَنصوصِ أحمد، وإنما كان المكيِّ. ومِن النصوص عن الإمام أحمد في تقدير الرطل، ما روى الأثرم قال: سُئل أبو عبد الله: إذا أخذ ثلاثة عشر رطلاً وثلثاً دقيقاً، فخبزه وقسم الخبز على عشرة مساكين؟، فقال: (أعجب إليّ ما جاء به الخبز مُدُّ بر، وهذا أرجو أن يجزئه) [الروايتين والوجهين للقاضي أبي يعلى 2\/ 188]. وفي (مسائل عبد الله ص 170) قلتُ: الصاع كم رطل هو؟، فقال: (قدرناه خمسة أرطال وثلث حنطة). وقال الإمام أحمد أيضاً: (المد رطل وثلث) [مسائل عبد الله ص 186، مسائل حرب 188 مخطوط]. وقال عبد الله [مسائله 389]: سألت أبي: عن رجل أوصى أن تكفر عنه أيمان كيف يتصدق بها؟ قال: (أقل الأيمان ثلاثة أيمان، يُعطَى لكلِّ مسكين اقله مُدُّ برٍّ؛ هو رطل وثلث دقيق، أو ثلاثة أرطال إلا ثلث تمراً لكل مسكين). وفي (مسائل ابنه صالح 189): قلتُ: الصاع كم رطلاً؟ قال: (قدرناه فهو خمسة أرطال وثلث حنطة أو تمر).",
    "book_id":"18"
  },
  {
    "serial_number":"4093109",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":35,
    "volume_number":1,
    "text":"معرفته برطلهم وَأوزانهم؛ لأنه أعرفُ عندهم. فجُعل لذلك ضوابطُ وَقواعد كلُّها راجعة إلى الحِسَاب، وَلا بُدَّ لمَن رَامَ ذلك مِن معرفة قدر رطلي البَلَدَين؛ العراقي كما تقدم، وَالآخر رطل البلد المطلوب مَعرفةُ العِرَاقيِّ به (1) .  [تحديد الرطل العراقي] (2) الرطل العراقي زنتُهُ مائةُ درهم وَثمانيةٌ وَعشرون درهماً وَأربعة أسبَاع درهم على الأصح من الأقوال الأربعة (3) .",
    "foot_note":"1. ذكر المؤلف في (الإقناع 1\/ 13) قاعدة عامة في معرفة القلتين بأي رطل، ثم بسط ذلك في هذه الرسالة، فقال: (إذا أردت معرفة القلتين بأي رطل أردت، فاعرف عدد دراهمه، ثم اطرحه من دراهم القلتين مرة بعد أخرى حتى لا يبقى منها شيء، واحفظ الأرطال المطروحة فما كان فهو مقدار القلتين بالرَّطل الذي طرحت به. وإن بقي أقل من رطل فانسبه منه، ثم اجمعه إلى المحفوظ) أ. هـ. \n2. العنوان بين المعكوفتين من المحقق للتوضيح. \n3. في زنة الرطل العراقي أربعة أقوال في المذهب؛ حكاها في (الإنصاف 1\/ 122) وغيره: الأول: ما ذكره المؤلف، وصححه أن الرطل يزن مائة درهم وثمانية وعشرين درهما، وأربعة أسباع درهم. وصححه في (الإنصاف) وقال: \" وعلى هذا جمهور الأصحاب \"، وقال في (المبدع 1\/ 59): \" وهو المشهور \"، واعتمده المؤلِّف في (الإقناع 1\/ 13). واختاره الشيخ تقي الدين (مجموع الفتاوى 21\/ 52، و 25\/ 51). وهو المذهب عند الشافعية [تحرير التنبيه ص 110، المجموع 1\/ 180، الإقناع للشربيني 1\/ 222]، وصححه بعض فقهاء المالكية [مواهب الجليل 2\/ 279]. الثاني: أنه مائة وثمانية وعشرون وثلاثة أسباع درهم. [ينظر: شرح الزركشي على الخرقي 1\/ 125]. قال في (الإنصاف): \" نقله الزركشي عن صاحب التلخيص فيه ولم أجد في النسخة التي عندي إلا كالمذهب المتقدم \" أ. هـ. الثالث: أنه يزن مائة وثمانية وعشرين درهماً؛ وهو في (المغني) القديم. وهو قول عند المالكية [ينظر: الذخيرة 3\/ 78، مواهب الجليل 2\/ 279]، وقول عند فقهاء الشافعية [ينظر: المجموع 1\/ 180]. قال أبو محمد ابن القطان: (وهو مذهب جماهير العلماء) [ينظر: تخريج الدلالات السمعية للخزاعي ص 615]. الرابع: أنه يزن مائة وثلاثين درهماً. ذكره في (الرعاية). وهو قول عند المالكية. ينظر: الذخيرة 3\/ 77، إثبات ما ليس منه بد ص 77. وهو الذي ذكره الرافعي في (العزيز)، وابن الإخوة في (معالم القربة ص 82) قولَ الشافعيّة. قال النووي في (المجموع 6\/ 16): (وهو غريب ضعيف)، وقال في (إعانة الطالبين 1\/ 31): (وهو خلاف المعتمد). قال ابنُ الرفعة: (اختلف النقلةُ في الرطل البغدادي. فقيل: إنه مائة وثمانية وعشرون درهماً. وقيل: مائة وثمانية وعشرون درهماً وأربعة أسباع درهم، وهذا الذي صححه النووي. وقيل: مائة وثلاثون درهماً، وهو الذي يقتضيه إيراد الشيخ أبي إسحاق صاحب المهذب. وهو المصحح عند غيره، وهو الذي تقوَّى في النفس صحته بحسب التجربة .. إلخ) ينظر: الإيضاح والتبيان في معرفة المكيال والميزان لابن الرفعة ص 36، 37. قال ابن ظهيرة في (كفاية المحتاج ص 327): (وهو الذي يقوي في النفس صحته بحسب التجربة)، ثم ذكر ما يؤيده وأطال. وقد وجّه هذا الرأي بعض الفقهاء، قال ابن مفلح في (المبدع 1\/ 199): (الرطل العراقي مائة درهم وثمانية وعشرون وأربعة أسباع درهم وهو تسعون مثقالاً، والمثقال درهم وثلاثة أسباع درهم هكذا كان قديماً. ثم إنهم زادوا فيه مثقالا فجعلوه واحداً وتسعين مثقالا وكمل مائة وثلاثين درهما، وقصدوا بذلك زوال الكسر والعمل على الأول لأنه الذي كان وقت تقدير العلماء المد به). وانظر: المطلع ص 8، الميزان في الأقيسة والأوزان لعلي باشا مبارك ص 89.",
    "book_id":"18"
  },
  {
    "serial_number":"4093110",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":37,
    "volume_number":1,
    "text":"وَأوقيته (1) عشرة دراهم وَخمسة أسباع درهم، وَهي سبعة مثاقيل وَنصف. وَالرطل تسعون مثقالاً (2) . وهو -أي الرطل العراقي- سُبع الرطل الدمشقي، وَنصف سُبعه (3) .",
    "foot_note":"1. «الأوقية»: وحدة وزنية تعدل أربعين درهماً في الأصل؛ كما ذكر ذلك الخليل بن أحمد في كتاب (العين 5\/ 240). ولكن الأوقية في الأرطال تختلف عن تقديرها في الأصل اللغوي، إذ العلماء متفقون على أن الرطل اثنا عشر أوقية. قال الماوردي: (والرطل اثني عشر أوقية .. هذا لا خلاف فيه) [الرتبة ص 170]. وقد أشار للاختلاف في تقدير أوقية الأرطال، وأنها غير الأوقية اللغوية: أبو العباس ابن البنا المراكشي (ت 721 هـ) فقال: (الأوقية المقدر بها الرطل. قيل: إنها زنة عشرة دراهم وثلثي درهم، وهو قول الفقيه أبي يحيى المواق، وأبي الحسن علي بن فرجون .. وقيل: إنها عشرة دراهم، وهو قول الداودي). [مقالة في مقادير المكاييل الشرعية لابن البنا المراكشي ص 74] فذهب أبو يحيى المواق (ت 599 هـ) إلى أن الأوقية عشرة دراهم وثلثا درهم الكيل، ففي الرطل مائة درهم وثمانية وعشرون درهماً) [مقالة في المكاييل والموازين للمواق ص 98]. \n2. هناك آراءٌ في عدد مثاقيل الرطل الواحد: الأول: أنها تسعون مثقالاً، وهو قول الجمهور. والثاني: أنها واحدٌ وتسعون مثقالاً. وقيل غير ذلك. ينظر: الإنصاف 1\/ 122، مغني المحتاج 1\/ 383. \n3. قال المرداوي في (الإنصاف 1\/ 122): (الصحيح من المذهب أن الرطل العراقي سبع الرطل الدمشقي ونصف سبعه وعلى هذا جمهور الأصحاب). وقاله في (المبدع 1\/ 59)، و (الدر النقي 1\/ 50)، و (غاية المطلب ص 33).",
    "book_id":"18"
  },
  {
    "serial_number":"4093111",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":38,
    "volume_number":1,
    "text":"وَستة أسباع المصري، وَرُبع سبعه (1) . وَهو أجود من قوله في (التنقيح) (2) : (نصفه، وَربعه، وَسبعه). وَإن كان معناهما واحداً؛ لأن الكَسْرَ إذا كَانَ مِن جنس واحدٍ خيرٌ من أن يكون من أجناس. وأربعة أسباع الليثي (3) وَنصف سبعه. وثلاثة أسباع الأسكَندري. وَسُبع البعلبكي (4) . وثلاثة [أرباع] (5) سُبْعِ الطَّبرَاني (6) (رطل يتعامل به في بَرِّ صَفَد (7) . وسُبع الرَّقِّي (8) ، وَسَبعَةُ أثمان سُبعِهِ.",
    "foot_note":"1. انظر الإقناع 1\/ 13. \n2. التنقيح المشبع، لعلاء الدين المرداوي ص 33. \n3. نسبة إلى (منية الليث) من أعمال الغربية بمصر [حاشية معالم القربة ص 82]. \n4. انظر الإقناع 1\/ 13. \n5. في الأصل [أسباع]، والصوب ما أُثبت؛ بناءً على سيذكره المؤلف في الحساب. \n6. «طبران»: بلدة من بلدان فلسطين، تقع على بحيرة الجليل التي عرفت باسم (بحيرة طبرية) في وادي الغور بالأردن. \n7. قال في (معجم البلدان 3\/ 412): («صَفَد» بالتحريك مدينة في جبال عاملة المطلة على حمص بالشام وهي من جبال لبنان). والمقصود أن هذا الرطل يُستخدم في هذه البقاع، أمّا الرطل الصَّفدي فسيأتي ص. \n8. «الرقة»: مدينة تقع شرقي حلب على نهر الفرات.",
    "book_id":"18"
  },
  {
    "serial_number":"4093112",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":39,
    "volume_number":1,
    "text":" [معادلته بالرطل الدمشقي وما وافقه] (1) فطريق معرفة العراقي بالرطل الذي زنته ستمائة درهم (وهو الدمشقي) (2) وَأوقيته خمسون درهماً: أن تزيد على العدد العراقي نصفه، ثم تأخذ سُبع المجتمع فما بلغ في العدد فهو الدمشقي. مثاله: في القلتين أن تزيد عليهما مائتين وَخمسين، فيبلغ ذلك سبعمائة [وخمسين، ثم خُذ سُبع ذلك يبلغ مائةً] (3) وَسَبعَةً، وَسُبع رطل (4) ؛ وَهو قدر القلتين بالدمشقي (5) .",
    "foot_note":"1. العنوان بين المعكوفتين من المحقق للتوضيح. \n2. الرتبة للماوردي ص 170، نهاية الرتبة للشيرازي ص 15، معالم القربة لابن الإخوة ص 82. ويُنظر: حاشية ابن عابدين 2\/ 365، كفاية المحتاج 1\/ 382، حاشية البجيرمي على الإقناع 2\/ 20، الفتاوى الكبرى لابن تيمية 1\/ 221، حواشي الإقناع للبهوتي 1\/ 66. وقد عَلَّقَ ابنُ عَابدين الدمشقي بعد ذكر هذا الرأي فقال: (وقد صرح الشارح .. بأن الرطل الشامي ستمائة درهم .. وعليه فالصاع بالرطل الشامي رطل ونصف .. وهكذا رأيته أيضا محررا بخط شيخ مشايخنا إبراهيم السّائحاني وشيخ مشايخنا منلا علي التركماني وكفى بهما قدوة. لكني حررت نصف الصاع في عام ست وعشرين بعد المائتين فوجدته ثُمنيه ونحو ثلثي ثمنيه فهو تقريبا رد مُدٍّ ممسوحاً من غير تكويم، ولا يخالف ذلك ما مرَّ لأن المُدَّ في زماننا أكبر من المد السابق، وكذا الرطل في زماننا فإنه الآن يزيد على سبعمائة درهم وهذا بناء على تقدير الصاع بالماش أو العدس أما على تقديره بالحنطة أو الشعير وهو الأحوط كما يأتي قريبا فيزيد نصف الصاع على ذلك). وقال ابن بدران الدمشقي (ت 1346 هـ): (الرطل الدمشقي قديماً ستمائه درهم، وهو الآن ثمانمائة درهم). ينظر: حاشيته على أخصر المختصرات ص 132. وهذا يفيد أن الرطل الدمشقي تغير تقديره بتغير الزمان، وبه يظهر حلُّ إشكال ابن عابدين. \n3. ما بين المعكوفتين ساقط من الأصل، ولا بُدَّ منه ليستقيم الكلام. والتصويب مستفادٌ من (الإقناع) للمؤلف، والمصادر التالية. \n4. وبمثل هذا التقدير في: الفروع 1\/ 87، والمبدع 1\/ 59، والإنصاف 1\/ 122، وشرح المنتهى، والروض الندى 1\/ 27. وفي (العمدة للموفق ابن قدامة ص 3): (القلتان ما قارب مائةً وثمانية أرطال بالدمشقي). وهذا يدلُّ على أنه بالتقريب لا التحديد؛ كما قال ابن بسام في (حاشيته على العمدة). \n5. قال في (شرح المنتهى): (ما وافقه في قدره كالصفدي).",
    "book_id":"18"
  },
  {
    "serial_number":"4093113",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":40,
    "volume_number":1,
    "text":"وإن شئتَ فخذ سُبع العراقي، وَنصفَ سُبعه، فما بلغ فهو الدمشقي. وإن شئت أسقطتَ من العراقي خمسة أسباعه، وَنصف سبعه، فالباقي هو الدمشقي. وكذا ما وافق رطل دمشق؛ كصَفَد (1) . [معادلته بالرطل القدسي وما وافقه] (2) وطريق معرفته بالرطل الذي زنته ثمانمائة درهم (وهو القدسي) (3)",
    "foot_note":"1. وعكة، وصَيدا. [كشاف القناع 1\/ 43]. \n2. العنوان بين المعكوفتين من المحقق للتوضيح. \n3. ومثله الخليلي [الرتبة ص 170، معالم القربة ص 82].",
    "book_id":"18"
  },
  {
    "serial_number":"4093114",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":41,
    "volume_number":1,
    "text":"وَما وافقه؛ كالنابلسي (1) ، وَالحمصي (2) ، وَأوقيته ستة وَستون درهماً وَثلثا درهم: أن تزيد على العدد العراقي مثل ثُمنه، ثم تأخذ سُبع المجتمع فما بلغ من العدد فهو القدسي. مثاله: في القلتين زد على الخمسمائة ثُمنها؛ وَهو إثنان وستون وَأربعة أسباع، ثم خذ سُبع الجميع يبلغ ثمانين رطلاً وسُبعا (3) رطل، وَنصف سبع رطل، وَهو القلتان بالرطل القدسي (4) . وإن شئتَ فخُذ من العراقي سُبعه، وَثُمن سبعه، فما بلغ فهو القدسي.",
    "foot_note":"1. ذكر المؤلف في (حواشي التنقيح ص 78)، والبهوتي في (كشاف القناع 3\/ 401) أن الرطل القدسي يوافق الرطل النابلسي؛ كما ذكر المؤلف هنا. \n2. كذا ذكره المؤلف في (حواشي التنقيح ص 78) أن الحمصي كالقدسي. وذكر البهوتي في (كشاف القناع 3\/ 401) أن الرطل الحمصي يوافق الرطل الحلبي فتعدل أوقيته ستين درهماً؛ كما سيأتي. وذكر الماوردي في (الرتبة ص 170) أن الرطل الحمصي يعدل تسعمائة وأربعة وأربعين درهماً. وذكر الشيرازي في (نهاية الرتبة ص 16): أن الحمصي ثمانمائة وأربعة وستون درهماً. وعند ابن الإخوة (معالم القربة ص 82) الحمصي يعادل سبعمائة وأربعة وتسعون درهماً. فليحرر. \n3. في الأصل [سبع]، والتصويب من (الإقناع) للمؤلف، والمصادر التالية. \n4. قال في (المبدع 1\/ 59): \" القلتان بالقدسي ثمانون رطلا وسبعا رطل ونصف سبع \". وقال في (شرح المنتهى): \" وهما ثمانون رطلا وسبعان ونصف سبع رطل قدسي وما وافقه كالنابلسي والحمصي \". ومثله في (الكشاف 1\/ 43).",
    "book_id":"18"
  },
  {
    "serial_number":"4093115",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":42,
    "volume_number":1,
    "text":"وإن شئت أسقطتَ من العراقي خمسة أسباعه، وَسبعة أثمان سبعه\/ [48\/ ب] فما بقي فهو القدسي، وَكذا ما وافقه.  [معادلته بالرطل الحلبي وما وافقه] (1) وطريقة معرفته بالرطل الذي زنته سبعمائة وَعشرون درهماً (وهو الحلبي (2) ، وَالبيروني، وَالحموي (3) وَأوقيته ستون درهماً أن تزيد على العراقي مثل ربعه، ثم تأخذ سُبع المجتمع فما بلغ في العدد فهو الحلبي. مثاله في القلتين: زد على الخمسمائة مائة وَخمسة وَعشرين، ثم خذ سُبع ذلك، يبلغ تسعة وَثمانين وَسُبعي رطل؛ وهو القلتان بالحلبي (4) . وإن شئت فأسقط من العراقي خمسة أسباعه وَثلاثة أرباع سبعه فالباقي هو الحلبي. وَكذا ما وافقه.",
    "foot_note":"1. العنوان بين المعكوفتين من المحقق للتوضيح. \n2. كذا في (معالم القربة ص 82). وفي (نهاية الرتبة للشيرازي ص 16) أن الحلبي سبعمائة وأربعة وعشرون درهماً. \n3. في (نهاية الرتبة ص 16) و أيضاً في (معالم القربة ص 82) الحموي يعادل ستمائة وستون درهماً. \n4. قال في (المبدع 1\/ 59): \" القلتان بالحلبي تسعة وثمانون رطلا وسبعا رطل \". وقال في (شرح المنتهى): \" وهما تسعة وثمانون رطلا وسبعا رطل حلبي، وما وافقه كالبيروتي \". ومثله في (الإقناع، والكشاف 1\/ 43). وقد ذكر المؤلف في (حواشي التنقيح ص 78) أن البيروتي كالحلبي.",
    "book_id":"18"
  },
  {
    "serial_number":"4093116",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":43,
    "volume_number":1,
    "text":" [معادلته بالرطل المصري وما وافقه] (1) وطريق معرفته بالرطل الذي زنته مائة وَأربعة وَأربعون درهماً (وهو المصري (2) وَما وافقه؛ كالمكي، وَالمدني (3) -مدينة النبي ×-) وَأوقيته اثنا عشر درهماً: أن تزيد على العراقي خمسة أمثاله، وَمثل ربعه، ثم تأخذ سُبع المجتمع فما بلغ في العدد فهو المصري. مثاله في القلتين: زد على الخمسمائة خمسة أمثالها، يبلغ ذلك ثلاثة آلاف، ثم ربع الخمسمائة وَهو مائة وَخمسة وَعشرون يبلغ مجموع به ثلاثة آلاف وَمائة وَخمسة وَعشرين، فخذ سُبع ذلك؛ وهو أربعمائة وَستة وَأربعون وَثلاثة أسباع، وَهو القلتان بالرطل المصري (4) . وإن شئت أخذتَ ستة أسباع العراقي وَربع سبعه فما بلغ فهو المصري.",
    "foot_note":"1. العنوان بين المعكوفتين من المحقق للتوضيح. \n2. وكذا أيضاً في: الرتبة للماوردي ص 170، نهاية الرتبة للشيرازي ص 16، معالم القربة لابن الإخوة ص 82. فتح القدير لابن الهمام 7\/ 17، البحر الرائق لابن نجيم 6\/ 141، الفتاوى الكبرى لابن تيمية 1\/ 221. \n3. قال في (كشاف القناع 3\/ 401): (الرطل المصري وما وافقه كالمكي والمدني). وكذا ذكره المؤلف أيضاً في (حواشي التنقيح ص 78). \n4. قال في (المبدع 1\/ 59): \" القلتان بالمصري أربعمائة وستة وأربعون رطلا وثلاثة أسباع رطل \". وقال في (شرح المنتهى): \" والقلتان أربعمائة رطل وستة وأربعون رطلا وثلاثة أسباع رطل مصري وما وافقه كالمكي والمدني \". وانظر كشاف القناع 1\/ 43.",
    "book_id":"18"
  },
  {
    "serial_number":"4093117",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":44,
    "volume_number":1,
    "text":"وإن شئتَ أسقَطتَ مِن العِراقي ثلاثةَ أرباع سُبعِهِ، فما بلغ فهو المصري.  [معادلته بالرطل الليثي وما وافقه] (1) وطريق معرفته بالرطل الذي زنته مائتا درهم (وهو الليثي) (2) يتعامل به أهل مصر أيضاً، لكن الرطل المتقدم أشهر عندهم، وَأوقيته ستة عشر وَثلثا درهم: أن تزيد على العدد العراقي ثلاثة أمثاله، وَمثل نصفه، ثم تأخذ سُبع المجتمع، فما بلغ فهو الليثي. مثاله في القلتين: [49\/ أ] زد على الخمسمائة ألفاً وَخمسمائة، يكن ذلك ألفين، ثم زد قدر نصف الخمسمائة؛ وَهو مائتان وَخمسون، يبلغ مجموع ذلك ألفين وَمائتين وَخمسين، فخذ سبعها وَهو ثلاثمائة [وَ] واحدٌ وَعشرون وَثلاثة أسباع رطل (3) وَهو قدر القلتين بالليثي. وإن شئتَ أخذتَ أربعةَ أسباع العراقي وَنصف سبعه فما حصل فهو الليثي.",
    "foot_note":"1. العنوان بين المعكوفتين من المحقق للتوضيح. و (الليثي): نسبة إلى (منية اللَّيث)، وتقدم التعريف بها ص 37. \n2. في (الرتبة للماوردي ص 170)، و (معالم القربة لابن الإخوة ص 82): (الرطل الليثي مائتا درهم). \n3. في الأصل [ورطل]، والصواب حذف الواو.",
    "book_id":"18"
  },
  {
    "serial_number":"4093118",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":45,
    "volume_number":1,
    "text":"وإن شئتَ أسقَطتَ مِن العِرَاقي سُبْعَيه، وَنصفَ سُبعِهِ، فمَا بَقِي فهو اللَّيثِي.  [معادلته بالرطل الأسكندري وما وافقه] (1) وَطريق معرفتِه بالرَّطْلِ الذي زنتُهُ ثلاثمائة درهم (وهو الأسكَندري؛ يتعامل به أهل الأسكَندَرِيَّة (2) ، وَأهل العَرش (3) ، وَغيرهم)؛ [كما ذكر ذلك] (4) أبو كامل شجاع بن أسلم الحاسب (5) في كتاب «المفتاح في علم الحساب»؛ كما يأتي في آخره منبهاً عليه -إن شاء الله تعالى-. وأوقيتُهُ خمسةٌ وَعشرون: أن تزيد على العَدَد العِرَاقيِّ مثلَيه، ثُمَّ تَأخذ سُبع المجتمع، فمَا بَلَغَ في العَدَد فهو الأسكندَري.",
    "foot_note":"1. العنوان بين المعكوفتين من المحقق للتوضيح. \n2. ذكر ابن الإخوة في (معالم القربة ص 83) أن الرطل ثغر الإسكندرية يعادل ثلاثمائة واثنا عشر درهماً). ومثله ابن الهمام في (فتح القدير 7\/ 17)، وابن نجيم في (البحر الرائق 6\/ 141). \n3. كذا في الأصل، ولعل الصواب [العريش]، وهي مدينة من أطراف مصر. انظر [معجم البلدان 4\/ 113]. وانظر [الرتبة للماوردي ص 171]. \n4. ما بين المعكوفتين اجتهاد من المحقق، ليستقيم بها الكلام. \n5. ذكره ابن النديم في (الفهرست ص 392) فقال: \" هو أبو كامل شجاع بن أسلم بن محمد بن شجاع الحاسب من أهل مصر، وكان فاضلاً حاسباً عالماً، وله من الكتب كتاب الفلاح، كتاب مفتاح الفلاح، كتاب الجبر والمقابلة، كتاب العصير، كتاب الطير، كتاب الجمع والتفريق، كتاب الخطائين، كتاب المساحة والهندسة، كتاب الكفاية \" أ. هـ.",
    "book_id":"18"
  },
  {
    "serial_number":"4093119",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":46,
    "volume_number":1,
    "text":"مثاله في القُلَّتين: إذا زَدتَ عَلَى الخمسمائة ألفاً، ثم أخذتَ سُبعَ المجتَمع، بَلَغَ ذلك مائتين وَأربعةَ عَشَرَ وَسُبعي رَطل، وَهو قدر القلتين بالأسكندري. وإن شئتَ أخذتَ ثَلاثَةَ أسبَاعِ العِرَاقي، فمَا بلغ فهو الأسكندري. وإن شئت أسقطت من العراقي أربعة أسباعه، فما بقي فهو الأسكندري.  [معادلته بالرطل البعلبكي وما وافقه] (1) وطريقة معرفته بالرطل الذي زنته تسعمائة درهم، (وَهو البعلبكي، وَما وافقه (2) وَأوقيته خمسة وَسبعون درهماً: أن تأخذ سبع العراقي من غير أن تزيد عليه شيئاً، فما بلغ فهو البعلبكي. مثاله: إذا أخذت سبع القلتين وَهو وَاحدٌ (3) وَسبعون رطلاً وَثلاثة أسباع الرطل فهو القلتان بالبعلبكي (4) .",
    "foot_note":"1. العنوان بين المعكوفتين من المحقق للتوضيح. \n2. ذكر ابن الإخوة في (معالم القربة ص 82) أن الرطل الكركي يعادل تسعمائة درهم. \n3. في الأصل [أحد]. \n4. قال في (شرح المنتهى): \" والقلتان أحد وسبعون رطلا وثلاثة أسباع رطل بعلي وما وافقه \". وانظر (كشاف القناع 1\/ 43).",
    "book_id":"18"
  },
  {
    "serial_number":"4093120",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":47,
    "volume_number":1,
    "text":" [معادلته بالرطل البصري وما وافقه] (1) وطريقة معرفته بالرطل الذي زنته ألف درهم وَثمانمائة درهم (وَهو الرطل البَصْرِي) أن تأخذ نصفَ سُبع العراقي فمَا بَلَغَ فهُوَ البَصْرِي.  [معادلته بالرطل الطبراني وما وافقه] (2) وطريقة معرفته بالرطل الذي زنتُهُ [49\/ ب] ألفُ دِرهَمٍ وَمائتا دِرهَم، وَأوقيتُهُ مائةُ درهم (وهو الطبراني الآن، وَما وافقه) أن تأخُذَ ثَلاثَةَ أربَاعِ سُبعِ العِرَاقي فمَا بَلَغَ فهو الطَّبراني. مثاله في القلتين: سُبعُ الخمسمائة وَاحِدٌ (3) وَسبعُونَ رَطلاً وَثلاثةُ أسباعِ رَطل. ثلاثة أرباع ذلك ثلاثةٌ وَخمسون وَأربعةُ أسباع، وَهو قدر القلتين بالطبراني. وإن شئت أسقطت من العراقي ستة أسباعِه وَرُبع سُبعه، فالباقي هو القلتان بالطبراني.  [معادلته بالرطل الرَّقي وما وافقه] (4) وطريق معرفته بالرطل الذي زنته أربعمائة وَثمانون درهماً؛ (وَهو",
    "foot_note":"1. العنوان بين المعكوفتين من المحقق للتوضيح. \n2. العنوان بين المعكوفتين من المحقق للتوضيح. و (الطبراني) نسبة إلى (طبران) وتقدم التعريف بها ص 37. \n3. في الأصل [أحد]. \n4. العنوان بين المعكوفتين من المحقق للتوضيح.",
    "book_id":"18"
  },
  {
    "serial_number":"4093121",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":48,
    "volume_number":1,
    "text":"الرَّقِّي) وَأوقيته أربعون درهماً، -وَما وافقه كأوزان المدينة النبوية (1) ، فإن أوقيتهم كانت أربعين، وَلهذا جاء في الحديث الصَّحِيح: (ليس فيما دون خمس أواقٍ من الفضة صَدَقة) (2) وَالخَمسُ أواقٍ مائتان بلا خلاف (3) -. أن تزيد على العَدَد العرَاقيِّ سَبعَة أثمَانهِ، فمَا بَلَغَ فخُذ سُبعَه، فمَا حَصَل فهو الرّقي. مثاله في القلتين: ثمنهما اثنان وَستون وَنصف، إذا زدت على الخمسمائة سبعة أثمانها وَهو أربعمائة وَسبعة وَثلاثون وَنصف، بلغ ذلك تسعمائة وَسبعة وَثلاثين وَنصفاً (4) ، سُبع ذلك مائة وَثلاثة [وثلاثون] (5) وَستةُ أسباع رطل وَنصفُ سُبع رطل. وإن أخذت من العراقي سُبعه وَسَبعة أثمان سُبعه فما بلغ فهو القلتان بالرقي.",
    "foot_note":"1. انظر: النقود العربية وعلم النميات للكرملي ص 38، المكاييل في صدر الإسلام د. سامح فهمي ص 46. \n2. رواه الإمام أحمد (3\/ 44)، والبخاري (1340)، ومسلم (979) من حديث أبي سعيد الخدري رضي الله عنه. \n3. لا نزاع أن الخمس أواق تعدل مائتي درهم .. قال ابن الإخوة [معالم القربة ص 82]: (والرطل اثنا عشر أوقية، والأوقية اثنا عشر درهماً؛ هذا لا خلاف فيه). أ. هـ. \n4. في الأصل [نصاً]. \n5. ما بين المعكوفتين ساقط من الأصل، ولا بدَّ منه ليستقيم الحساب.",
    "book_id":"18"
  },
  {
    "serial_number":"4093122",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":49,
    "volume_number":1,
    "text":"وإن شئتَ أسقطت من العراقي خمسة أسباعه، وَثُمن سُبعه، فالباقي هو القلتان بالرقي. تنبيهات أحدها: ما ذكرتُهُ من الطُّرُقِ وَالقواعد في هذه الأوراق فهو مُطَّرِدٌ في كُلِّ الأوزَانِ العِرَاقيَّة، وَلولا خشيةُ الإطالةِ لمثَّلتُ لكُلِّ عَددٍ يُحتَاجُ إليه مَثَلاً؛ كما في نصَاب الزكَاة، وَالكفَّارة، وَغير ذلك، وَلكن لا يخفَى تحصيلُ ذلك على الحَاذق الفَهِمِ إذا فَهِمَ مَا قدَّمتُهُ، وَاستعملَهُ [50\/ أ] في كُلِّ وَزنٍ برِطْلِ أيِّ بَلَدٍ شَاء. الثاني: ذكر أبو كامل الحاسب المتقدم ذكرُه في كتابه «المفتاح» أرطالاً، وَأوزاناً (1) أخذتُ منها ما دَعَتْ الحاجةُ إليه، وَاستنبطتُ له قواعدَ حِسَابيّة. فذكر أن الرطل الليثي وزنه مائتان. وَأن الرَّقِّي وزنُهُ أربعمائة وَثمانون. وَأن الأسكندري وَالعريشي (2) وزنه ثلاثمائة. وَأن الشامي (أي الدمشقي) وزنه ستمائة. الثالث: مجموع القلتين بالدراهم أربعةٌ وَستون ألفاً [ومائتان",
    "foot_note":"1. في الأصل [وزن]. \n2. في الأصل [القريشي]، ولعل الصواب ما أثبت بناءً على ما ذكره المؤلف أول هذه الرسالة.",
    "book_id":"18"
  },
  {
    "serial_number":"4093123",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":50,
    "volume_number":1,
    "text":"وخمسة] (1) وَثمانون وَخمسة أسباع. الرابع: إذا أردتَ معرفة العراقيِّ بوزن أي بَلَدٍ شِئتَ ممَّا تَقدَّم ذكرُهُ أو غيرُه، فابسُطْ أوقيةَ العِرَاقِي أسبَاعَاً يَبلُغُ ذلكَ خمسَةً وَسبعين، ثم ابسط أوقيةَ الرطل الذي تُريدُهُ أسبَاعَاً، فَمَا بَلَغَ فانسب إليه الأوقية العراقية. فإذا عرفتَ النِّسبةَ بَينهما فتصرَّف فيه بمثل تلك النسبة من زيادة أو نقصان، وَلا يكاد يَعرفُ ذلك إلا الحاسب. والله أعلم. قال ذلك الشيخ موسى بن أحمد بن موسى بن سالم بن عيسى بن سالم الحجاوي المقدسي ثم الصالحي غفر الله له وَلوالديه وَلنا وَلوالدينا وَلجميع المسلمين. علقها الفقير إلى رحمة ربه محمد راحد (2) الكردي الصالحي غفر الله له وَلوالديه وَلجميع المسلمين في سنة 966 وَصلى الله على سيدنا محمد.",
    "foot_note":"1. ما بين المعكوفتين ساقط من الأصل، ولا بُدَّ من إثباتها. \n2. كذا تُقرأ في المخطوط.",
    "book_id":"18"
  },
  {
    "serial_number":"4093124",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":51,
    "volume_number":1,
    "text":"(2)  فتيا للشيخ مُوسَى الحجَّاوي رحمه الله في مسألة في الرِّبَا اعتنى بتحقيقها والتعليق عليها: أ. د. عبد السلام بن محمد الشويعر",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093125",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":53,
    "volume_number":1,
    "text":"الحمد لله.  مَا قولُكُم في التمر إذا جُبِلَ (1) وحُمِلَ عليه بالأرْجُل (2) ، حتى دَخَلَ بعضُه في بَعضٍ، هل يَصحّ بيعُه باللَّحَم نَسيئة ؟ إن قلتُم: لا يصحّ. فمَا يَترتب على مُعاطيه بعد عِلمِه بتحريم ذلك؟  الجواب: إذا باع مَكيلاً بموزونٍ نسيئةً جاز (3) . وأمّا العَجْوَة (4) فإن كان قَبلَ أن جُبلَت (5) وقبل اختلاطِ بَعضِها",
    "foot_note":"1. (جُبل) أي عُجن. \n2. أي عُجن التمر بالأرجل، فيكون التمرُ كالعجين، وهو الذي يُسمّى عندنا بـ (العَبيط)، ويُسمّيه البعضُ حالياً في الأسواق بـ (معجون التمر). وهذا النوع لا يتصّور كَيلُهُ، وإنما وزنه فقط. \n3. ينظر: كشاف القناع 8\/ 10. \n4. جاء في كتاب «العامي الفصيح» من إصدارات مجمع اللغة بالقاهرة ما نصّه: (العَجْوَة: ضربٌ من أجود التمر بالمدينة. والعوام يعرِّفُون العجوة بأنها ما يُخْلَطُ من التمر بعضُه ببعضٍ ويُرْكَم). والثاني هو مرادُ المصنّف، فإنّه يقصد بالعجوة إذا خُلط التمر قبل عجنه، فاستخدام المؤلف إنما هو للاستعمال العامي للفظة لا الفصيح. وأمّا في وقتنا الآن فمِن الناسِ مَن لا يُسمّي التمرَ «عَجوةً» إلا بعد عجنه، لذا يُكتب على التمر المعجون (عجوة). فلينتبه لهذا الاختلاف في الاستعمال للفظة. \n5. الأسلوب الذي عبّر به المصنف مِن الأساليب غير المشهورة، حيث أدخل (أنْ) المصدرية على الفعل الماضي المتصرِّف. وهي لغة أجازها بعضُ النحويين، قال الزواوي في (نظم قواعد الإعراب): (أنْ) حَرفُ مَصْدَرٍ مُضَارِعاً نَصَب \n…. وَالقَوْلُ فِي لُقِيَّهِ المَاضِي اضْطَرَب و (أنْ) هنا يصحُّ تأويلها بالمصدر، فتكون الجملة: (قبل جبلها)؛ بدليل أنه عطف عليها بمصدر وهو قوله: (قبل اختلاط).",
    "book_id":"18"
  },
  {
    "serial_number":"4093126",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":54,
    "volume_number":1,
    "text":"ببعضٍ والحَملِ عليها بالأرجُلِ، فهو جَائزٌ فيهما؛ إذ ذاك تمرٌ مكيلٌ (1) ، واللحمُ مَوزُونٌ، فجاز بيعُه نسيئةً. وأمَا بَعْدَ جَبْلِهَا لمْ تَبْقَ تُكَالُ، وَلا تُسَمَّى مَكيْلاً، ولو كان أصلُها مَكيلاً، وإنما تُوزَن. فإذا صَارت تُوزَن لم يَجُزْ أحدُهما بالآخر نَسيئةً؛ لأنه بيعُ موزونٍ بموزونٍ نَسيئَةً. وإذا ظَهَرَ الحَقُّ وَجَبَ اتبَاعُه (2) . ولعلّ فتيا شيخنا الشويكي (3) ، وأحمد بن يحيى (4) ، في ذلك محمولان على ذلك (5) .",
    "foot_note":"1. لأن التمر لم يخرج عن كونه تمراً مكيلاً وإن اختلط أنواعُهُ، ولم يصبح نوعاً واحداً فقط. \n2. فالمصنفُ حمله على اختلاف الحال، وحقيقة رأيه ترجيح قول ابن عطوة على قول الشويكي رحمهما الله تعالى. \n3. الشيخ أحمد بن محمد بن أحمد الشُّويكي الحنبلي (875 - 939 هـ). \n4. هو: الشيخ العلامة أحمد بن يحيى بن عطوة بن زيد التميمي الحنبلي، توفي سنة 948 هـ ودفن بالجبيلة. ينظر: عنوان المجد لابن بشر ص 10. \n5. أي يحمل اختلاف الشيخين على اختلاف الحال. فمَنع الشويكي من وزن العَجوة إنما هو قبل جَبله وعجنه، فيبقى مكيلاً، وعليه فلا ربا في بيعه باللحم. وأمّا ابن عطوة فإنه يصحح الوزن في العجوز محلّه بعد العجن والجبل، فيصبح التمر حينئذٍ موزوناً، فيجري فيه الربا مع اللحم.",
    "book_id":"18"
  },
  {
    "serial_number":"4093127",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":55,
    "volume_number":1,
    "text":"فتُحملُ فَتوَى الشويكي (1) في العَجوة قَبلَ جَبْلِها، وفُتيَا ابنِ يحيى (2) (3) بعد جَبْلِها.",
    "foot_note":"1. قال الشيخ عثمان ابن بشر في (عنوان المجد ص 10): (وقع بين ابن عطوة وبين الشويكي منافرة ومشاجرة وصنّف ابن عطوة مصنفاً رداً عليه في فتياه بأن التمر المعجون إذا عُجن لا يخرجه عن علّة الكيل. وكذلك وقع بينه وبين عبد الله بن رحمة شيء من ذلك، فردّ عليه الشيخ ابن عطوة .. وسجّل على ردّه في ذلك القاضي بن القاضي علي بن زيد قاضي أجود بن زامل صاحب الأحساء، والقاضي عبد القادر بن يزيد المشرفي، والقاضي منصور بن مصبح الباهلي، وعبد الرحمن بن مصبح الباهلي، وعبد الرحمن بن مصبح، والقاضي أحمد بن فيروز بن بسام، وسلطان بن ريس بن مغامس، وكُل هولاء في زمن أجود بن زامل العامري العقيلي ملك الأحساء). وقد أشار الشيخ عبد الله ابن بسام في (علماء نجد 1\/ 449) في ترجمة ابن عطوة، لهذه الفتوى فقال: (وقد جرى بين المترجم وبين زميله الشيخ أحمد الشويكي النابلسي -وهو قرينه على شيخهما: أحمد العسكري- مناظرة، كما وقع بينه وبين الشيخ عبد الله بن رحمة الناصري مثلها، وذلك في التمر المعجون، هل يبقى على معياره الأصلي مكيلاً أو يصير معياره الوزن؟ فنصر المُترجَم القول الثاني، وعارضاه في ذلك، واشتدّت المناظرة بينه وبينهما، فصنف رداً عليهما في ذلك). \n2. نصّ كلام الشيخ أحمد بن يحيى ابن عطوة هو: (فإن قيل: يلزم على قولكم جواز بيع التمر المعجون بالبرّ ونحوه من المكيلات نسأً؛ لاختلاف العلة. قلتُ: هو يقتضي القياس في الظاهر. والتحقيق: منعُ القياس؛ لعدم اتحاد العلتين؛ إذ العلة التي يحرم معها بيع الجنسين بعضها ببعض هي العلة الأصلية، لا العلة الحادثة. ولأنّه مما يسدّ الذريعة إلى الربا، فإن بيع التمر المكيل بالمكيلات نسأً محرّم بالاتفاق، فيمكن من أراد ذلك إخراج التمر عن صفته بالعجن، حتى يتوصّل بذلك إلى غير محله، وإلى قصده الفاسد من الربا؛ ولأن الشيء لا يُباع بما كان مشاركاً في أصله نسأً). ينظر: الفواكه العديدة 1\/ 250، ملخص الفواكه العديدة 1\/ 158. وهناك بعض العبارات صوَّبتُها مِن الملخص. \n3. وكذا الشيخ الشهاب أحمد العُسكري الحنبلي (ت 910 هـ) وافقَ تلميذه الشيخ ابن عطوة. ففي أسئلة سأله إياها أحمد بن يحيى بن عطوة (ل 6)، قال العُسكري: (يلزم من كون التمر معجوناً الربا؛ لاتحاد علّة الثمن والمثمن وهو الوزن، وانتقال التمر عن الكيل بعجنه لعلّه مما لا خلاف فيه عند أحدٍ من العلماء، بل ولا أحدٍ من العقلاء).",
    "book_id":"18"
  },
  {
    "serial_number":"4093128",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":56,
    "volume_number":1,
    "text":"فتكون فُتيا كُلٍّ منهما صَحيحةً. فهذا ما ظهر والله أعلم. كتبه موسى الحجاوي.",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093129",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":57,
    "volume_number":1,
    "text":"(3)  جواب للشيخ مُوسَى الحجَّاوي رحمه الله عن الكتاب المعتمد في المذهب اعتنى بتحقيقها والتعليق عليها: أ. د. عبد السلام بن محمد الشويعر",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093130",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":59,
    "volume_number":1,
    "text":" قال الشيخ أحمد ابن منقور: وَجدتُ بخط الشيخ العلامة حسين بن عثمان (1) في جوابٍ أجاب به سليمان بن محمد بن شمس (2) : أخبرني مَن أثقُ به عن الشيخ مُوسى الحجاوي أنه قال له: (أنتم خالفتم «التنقيح» في مواضع في كتابكم، وحاشيتكم، فهل تأمرون باتباعكم، ومخالفة «التنقيح»؟ فقال -رحمه الله تعالى-: (الذي قدّم صاحب «التنقيح» هو المذهب المعمول به، فعليك به). ولقد صدق وأنصف. ومن خط المنقور أيضاً: قال شيخنا (3) : (المذهب ما في «التنقيح»",
    "foot_note":"1. جاء في هامش الأصل: [قوله: (شمس) كذا وجدت، ولعله (شمس الدين)]. \n2. جاء في هامش الأصل ما نصّه: [وحُسين بن عثمان أول دهره حنبلي، وتبحَّر في مذهب الحنابلة حتى وصل إلى حدّ التأليف، ثم صار آخره شافعياً، وله يد طويل في مذهب الشافعي، وكذلك له يدٌ في الحديث؛ قاله شيخنا]. \n3. جاء في هامش الأصل ما نصّه: [قوله: (شيخنا)؛ مراده به الشيخ الفقيه عبد الله بن محمد بن ذهلان النجدي الحنبلي رحمه الله].",
    "book_id":"18"
  },
  {
    "serial_number":"4093131",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":60,
    "volume_number":1,
    "text":"بلا إشكالٍ ولا شكّ. وإذا اختلف «المنتهى»، و «الإقناع» قدّمنا «المنتهى»).",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093132",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":61,
    "volume_number":1,
    "text":"(4)  منظومة في الوضوء والصلاة للشيخ مُوسَى الحجَّاوي رحمه الله اعتنى بتحقيقها والتعليق عليها: أ. د. عبد السلام بن محمد الشويعر",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093133",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":63,
    "volume_number":1,
    "text":" «شروط الوضوء» لموالانا العمدة الشيخ موسى الحجاوي أَيَا طَالِبَاً مِنِّي شُرُوطَ وُضوئِهِ … سَتُوضَحُ إنْ شَاءَ اللهُ بِلَا عُسْرِ فَأوَّلُهَا: المَاءُ الطَّهُورُ، وَكَونُهُ … مُبَاحَاً، وَتمييزٌ، مَع الفَقْدِ للكُفرِ وَتقديمُ الاستِنْجَاءِ بِالمَاءِ أوَّلَاً … أوْ الحَجَرِ المُنْقِي، وَنِيَّةُ ذِي الطُّهرِ وَأنْ تَدْخُلَ الأوقاتُ في حَقِّ مَن بهِ … مِنْ البَولِ أسْلاسٌ وَأَشبَاهُ ذي الضُّرِّ وَعَقْلٌ، فَرَاغٌ مِنْ مُنَافٍ لكُفرِهِ … إزَالَةُ مَا قَد يمنعُ الماء أن يجري عَلَى جِلْدِهِ كالشَّمْعِ، ثُمَّ نَقَاؤُهُ … مِنْ الحَيْضِ أو شِبْهٍ فَوَاحِدٌ مَع عَشرِ",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093134",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":64,
    "volume_number":1,
    "text":" «فروض الوضوء» وَفَرْضُ وُضوءٍ غَسْلُ وَجْهٍ وَبَعْدَهُ … يَدَيْهِ وَمَسْحُ الكُلِّ مِنْ رَأسِ ذِي الطُّهْرِ وَغَسْلٌ لِرِجْلَيْهِ وَتَرْتِيبُ فَرْضِهِ … مُوَالاتُهُ ذِي سِتَّةٌ عُدَّها تَدْرِي  «شروط الغُسل» وَإِنّ شُروطَ الغُسْلَ فِي الحُكْمِ فَاستَنِدْ … ثَمَانِيةٌ: عَقْلٌ، وَنِيَّةُ ذِي الطُّهْرِ سِوَى مَن أبَتْ غُسْلاً لحَيْضِهَا … تُغَسَّلُ قَهْرَاً كَي يَطَأهَا عَلَى طُهْرِ وَتمييزُهُ شَرْطٌ لِصِحَّةِ غُسلِهِ … وَمَاءٌ طَهُورٌ مَع إباحتُهُ فَادْرِيْ وَالإسْلَامُ لا ذِميَّةٌ مِنْ نُفَاسِهَا … جَنَابَتِهَا أوْ حَيضِهَا جَازَ للعُذرِ إِزَالَةُ مَا قَدْ يمنَعُ المَا وُصُولَهُ … فَرَاغٌ لحَيْضٍ مَعْ نُفَاسٍ لهَا يجرِيْ",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093135",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":65,
    "volume_number":1,
    "text":" «شروط التيمم وفروضه» وَإنَّ شُروطَاً للتَّيممِ سِتَّةٌ … فَعَقْلٌ وَتَمييزٌ مَعَ الفَقْدِ للكُفْرِ وَنِيَّتُهُ ثُمَّ الدُّخُولُ لِوَقتِ مَا … يُصَلِّيْهِ ثُمَّ العَجْزُ في ذَاكَ لِلضُرِّ لإعمَالِ مَاءٍ ثُمَّ فَرْضُ تَيَمُّمٍ … بمَسْحٍ لِوجْهٍ فَاليَدَينِ مَعَ العَفْرِ وَتَرْتِيبِهِ فِي غَيْرِ حُكْمِ جَنَابَةٍ … كَذَاكَ مُوَالاةٌ تُقَدَّرُ بالطُّهْرِ  «شروط الصلاة» وَإِنْ رُمْتَ تَدْرِي بالصَّلَاةِ شُرُوطَها … فَأَوَّلُهَا الوَقْتُ المُقَدَّرُ عَنْ خُبرِ وَسَتْرٌ لِعَوْرَاتٍ وَتَطْهيرُ محْدِثٍ … كَذَاكَ اجْتِنَابٌ لِلنَّجَاسَاتِ وَالكُفْرِ وَمِنْ بَعْدِهِ اسْتِقَبَالُهُ ثُمَّ نِيَّةٌ … وَعَقْلٌ وَتَمْييزٌ فذِي تَسْعَةٌ فَادْرِي",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093136",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":66,
    "volume_number":1,
    "text":" «أركان الصلاة» وَأَرْكَانُهَا إنْ رُمْتَ تَعْرِفُ عَدَّهَا … فتعدَادُهَا قَدْ جَاءَ في السِّتِّ مَعَ عَشْرِ قِيَامٌ لِفَرْضِ القَادِرِينَ وَبَعْدَهُ … فَتَكبيرَةُ الإحْرَامِ فَاتحَةُ الذِّكْرِ لِمُنْفَرِدٍ رَكْنٌ كَذَا لإمَامِهمْ … خَلَا مُقْتَدٍ فَاحْفَظْ هُدِيْتَ إلى اليُسْرِ رُكُوعٌ وَرَفْعٌ مِنْهُ ثُمَّ اعْتِدَالُهُ … سُجُودٌ عَلَى أَعْضَائِهِ السَّبْعِ مَع عَشْرِ كَذَا الرَّفْعُ مِنْهُ وَاعْتِدَالٌ وَجلْسَةٌ … لَهُ وَصَلَاةٌ فِيهِ تخْتَصُ بالطُّهْرِ محَمَّدٍ الهَادِي كَذَاكَ سَلَامُهُ … وَتَرْتيبُهَا وَالحَمْدُ للهِ مَعَ شُكْرِ",
    "foot_note":"None",
    "book_id":"18"
  },
  {
    "serial_number":"4093137",
    "category_id":"17",
    "category":"الفقه الحنبلي",
    "book_title":"مجموعٌ فيه أربع رسائل للحجاوي",
    "edition":"الأولى، 1439 هـ - 2018 م",
    "publisher":"ركائز للنشر والتوزيع",
    "page_number":67,
    "volume_number":1,
    "text":" «شروط الإمامة» وَهَاكَ شُرُوطَاً لِلإمَامَةِ فَإنَّهَا … لَتَبْلُغُ في تعدَادِهَا اثْنَينِ مَعَ عَشْرِ عَدَالَتُهُ إِسْلامُهُ ثُمَّ نُطْقُهُ … طَهَارَتُهُ مَعْ آدَميٍّ كَذَا مُقْرِيْ وَلَيْسَ بِهِ عَجْزٌ عَنْ الذِّكْرِ يَا فَتَى … وَلَيْسَ بِهِ مِنْ بَوْلِهِ سَلَسٌ يجْرِي وَصَحِّحْ مِنْ المَعْذُورِ فِيهَا إِمَامَةٌ … بمُشْبِهِهِ إلَّا بأخْرَسَ للعُذرِ",
    "foot_note":"None",
    "book_id":"18"
  }
]