[
  {
    "text": "Continuing the Look at Refining 'Nukhbat al-Fikar'\nAuthor: عبد العزيز بن ريس الريس\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "category_id": "10",
    "category": "Hadith Sciences",
    "new_page_number": 1
  },
  {
    "text": "sn: 3695\nbook_title: إدامة النظر في تحرير نخبة الفكر\nbook_link: https://shamela.ws/book/270\nbook_id: 270\nauthor_name: عبد العزيز بن ريس الريس\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/3093\nauthor_ID: 3093\neditor: Null\npublisher: Null\nedition: Null\npages: 83\nvolumes: Null\npagination: [الكتاب مرقم آليا]\ncategory: علوم الحديث\ncategory_id: 10",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "category_id": "10",
    "category": "Hadith Sciences",
    "new_page_number": 2
  },
  {
    "serial_number": "3338961",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Hadith Sciences. Book: Continuing the Look at Refining 'Nukhbat al-Fikar'. Author: Dr. Abdul Aziz bin Rayyis Al-Rayyis. Number of Pages: 83 [Book numbering is automatic]. Publication Date in Shamela: 16 Shawwal 1442.\nBook: Continuing the Look at Refining 'Nukhbat al-Fikar'. Author: Dr. Abdul Aziz bin Rayyis Al-Rayyis. Number of Pages: 83 [Book numbering is automatic]. Publication Date in Shamela: 16 Shawwal 1442.\nAuthor: Dr. Abdul Aziz bin Rayyis Al-Rayyis. Number of Pages: 83 [Book numbering is automatic]. Publication Date in Shamela: 16 Shawwal 1442.\n[Book numbering is automatic]. Publication Date in Shamela: 16 Shawwal 1442.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 3
  },
  {
    "serial_number": "3338962",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "In the name of Allah, the Entirely Merciful, the Especially Merciful. Peace be upon you, and the mercy of Allah and His blessings. To proceed: I have reviewed a transcript of a scientific course explaining the text 'Nukhbat al-Fikar' by Hafiz Ibn Hajar Al-Asqalani - may Allah Almighty have mercy on him - prepared by some brothers who also created an index for it. I named it: (Continuing the Look at Refining 'Nukhbat al-Fikar'). I ask Allah the Great to accept it and make it beneficial for His creation, indeed He is the Entirely Merciful, the Especially Merciful. And peace be upon you, and the mercy of Allah and His blessings. Dr. Abdul Aziz bin Rayyis Al-Rayyis @dr_alraies Supervisor of the Ancient Islam Website 23/ 8 / 1441 AH",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 4
  },
  {
    "serial_number": "3338963",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "In the name of Allah, the Entirely Merciful, the Especially Merciful. Introduction: It is known that this text is in the science of Hadith Terminology, and this science, as is not hidden, is one of the instrumental sciences leading to knowing the authenticity and weakness of Hadith. The method in commenting on this text - God willing - is as follows: 1 - Clarifying the intent of Hafiz Ibn Hajar - may Allah Almighty have mercy on him -. 2 - Mentioning what is important in some issues if there is something calling for that. 3 - Mentioning some observations on the words of Al-Hafiz - if found -. I ask Allah to teach us what benefits us and benefit us with what He taught us, indeed He is the Entirely Merciful, the Especially Merciful. Before starting the commentary on this useful text, I present some introductions: First Introduction: The student of knowledge should strive to combine the science of Hadith and the science of Fiqh (Jurisprudence), for whoever combines them strengthens his arm and his status in knowledge becomes great. Therefore, if you look at the condition of many scholars known for knowledge and famous for it, you find that they combined these two sciences. Among the great words of Imam Al-Shafi'i - may Allah Almighty have mercy on him - is that he said: Whoever looks into Hadith, his argument strengthens. And he spoke the truth - may Allah Almighty have mercy on him -, for the jurist needs the hadith of the Messenger of Allah, peace and blessings be upon him, to use as evidence, and his deduction cannot be valid except after establishing its authenticity, and this is only through knowledge of the science of Hadith. Ibn Hibban spoke in his book (Al-Majruhin) about combining the science of Hadith and the science of Fiqh with extremely valuable words. Therefore, we should strive and struggle with ourselves to combine these two sciences, for the science of Hadith refers to the authenticity and establishment of the second source, while the science of Fiqh refers to understanding the Prophetic Hadith and understanding other Sharia evidences. However, it should be known that a scholar might be an imitator (Muqallid) in the science of Hadith, and this is a deficiency, but it is not correct for a scholar to be knowledgeable in Halal and Haram and be an imitator in the science of Fiqh, just as a Muhaddith might",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 5
  },
  {
    "serial_number": "3338964",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "be a Muhaddith and not have depth in the science of Fiqh, being a Mujtahid in the science of Hadith and an imitator in the science of Fiqh. Perfection is to combine both matters, the science of Hadith and the science of Fiqh. I ask Allah by His mercy and grace to bestow upon us all beneficial knowledge and righteous deeds, indeed He is the Entirely Merciful, the Especially Merciful. Allah has blessed us in this era with a rare reviver scholar, the Allama Muhammad Nasir al-Din al-Albani - may Allah Almighty have mercy on him -. This scholar is a reviver in many chapters of religion, but what concerns me is what relates to the science of Hadith, for he is one of the most precise late scholars in knowing the authenticity and weakness of Hadith, and in precision and accuracy, for many late scholars have illusions in attribution and other things, but as for Allama Al-Albani - may Allah Almighty have mercy on him - rarely is such found with him. He is a scholar deeply versed in the science of Hadith, proficient, possessing mastery, knowledge, and accuracy - may Allah Almighty have mercy on him -. Even one of them wrote a treatise critiquing Sheikh Nasir al-Din al-Albani regarding some hadiths and their attribution to some sources... etc., so Sheikh Nasir al-Din al-Albani pointed out in (Al-Silsilah) to respond to the one who wrote this treatise, describing him as a young man, and said: If he were knowledgeable, he would not have critiqued, for I left attributing it to such source because there is an addition which is the letter Waw, and it affects the wording of the hadith, unlike that hadith... So he spoke with valuable words - may Allah Almighty have mercy on him -. Sheikh Nasir al-Din al-Albani has great merit upon the nation of Muhammad, peace and blessings be upon him, in the science of Hadith, for he brought it closer and made it easier. Allah bestowed upon him access to many references that many of his contemporaries did not access - may Allah Almighty have mercy on him -. I have sat with many who care for the science of Hadith, and they agreed that they did not know this science except by studying at first under Sheikh Nasir al-Din al-Albani. Indeed, I met two men known, unfortunately, for attacking Sheikh Nasir al-Din al-Albani, and when conversation took place with them, one of them said: By Allah, I did not know this science except by reading the books of Sheikh Nasir al-Din al-Albani. He even said: I do not think anyone in these times can be a Muhaddith without having learned from his books. The other said: In my early days, I was devoted to his books and reading them. Yet, they denied his merit - may Allah Almighty have mercy on him -.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 6
  },
  {
    "serial_number": "3338965",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "It should be known that there is no correlation between honoring a man and knowing his status, and disagreeing with him. The scholars of Islam have commanded us to follow the evidence even if we disagree with them. So a student of knowledge who possesses the tools has the right to disagree with whomever he disagrees with from the people of knowledge using the rules of the people of knowledge, while preserving their status and rank. We have been tested in these times with those who detract from Allama Al-Albani and lower his rank, until I read one of them saying: Muhammad Nasir al-Din al-Albani is not a Muhaddith!! He wants to deny the sun in broad daylight. I do not want to prolong this, but whoever wants to know this science should benefit from the books of Sheikh Nasir al-Din al-Albani, especially the two Series (Al-Silsilah Al-Sahiha and Al-Da'ifa), Irwa' al-Ghalil, and the extended Takhrij of Sunan Abi Dawud, for in these books there is expansion, collection of paths, and mention of some benefits and rules that are not easily found. I ask Allah to forgive him and all Muslim scholars, and to gather me, you, and him in the highest Paradise, indeed He is the Entirely Merciful, the Especially Merciful. Second Introduction: It should be known that the purpose of studying the science of Terminology is that it is an instrumental science and a means to know the terminologies of the people of knowledge in Hadith. So if the Imams of this field and its knights say: A Gharib (strange) hadith, or a Sahih (authentic) hadith, and other terms, the goal - of the science of Terminology - is to know the meaning of their words. It is a mistake for some who wrote in Terminology, who are not from the people of Hadith, to introduce definitions for terminologies not present among the Imams of this field and the early Imams of Hadith and its knights. They define some terminologies with definitions not present with them, and this is a big mistake, and this will become clear during reading the words of Hafiz Ibn Hajar - may Allah Almighty have mercy on him -. So they define Munkar, Mahfuz, or others with definitions not present among the early scholars. What is assumed in the science of Terminology is to clarify the meaning of the scholars' usage of terms in the science of Hadith, not to introduce meanings for terminologies used by the people of knowledge or to introduce new terminologies not spoken by the early scholars, as will be explained - God willing -.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 7
  },
  {
    "serial_number": "3338966",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "Note: The early scholars, when they spoke about Hadith, were closer to the linguistic meaning than to the terminological meaning, so most of their expressions refer to the linguistic meaning, and they did not bring a new terminology, but rather known Arabic meanings. Third Introduction: Kalam (Theology) never entered a science without corrupting it, for the Mutakallimun (Theologians) are not scholars by consensus of the people of knowledge nor jurists. Ibn Abd al-Barr - may Allah Almighty have mercy on him - mentioned the consensus in his book (Jami' Bayan al-Ilm wa Fadlihi). The words of the Imams of Ahlus-Sunnah like Imam Malik, Al-Shafi'i, Ahmad, and others regarding the prohibition of Kalam and condemning it are numerous, written and recorded. Ibn Abd al-Barr quoted part of it in his book (Jami' Bayan al-Ilm wa Fadlihi), and Qawwam al-Sunnah in his book (Al-Hujjah fi Bayan al-Mahajjah). Al-Harawi authored a complete book titled: (Dhamm al-Kalam wa Ahlihi) [Condemnation of Kalam and its People], and quoted in it useful transmissions from the people of knowledge. The scholars are concurrent in denouncing Kalam and that it is misguidance and falsehood and not permissible in Sharia. Among Kalam is the science of Logic, which is forbidden by consensus of the people of knowledge; the consensus was narrated by Al-Nawawi, Ibn al-Salah, and a group of scholars. Hence, Ibn al-Qayyim - may Allah Almighty have mercy on him - says in his book (Miftah Dar al-Sa'adah): Logic never entered a science without corrupting it. Likewise, Kalam, from which is the science of Logic, never entered a science without corrupting it. Some people might have a craving, or not be knowledgeable of the reality of knowledge, so they say: I will not be convinced of the corruption of Kalam until I study it. The least of the harms in his action is that he wastes his life in what does not benefit, and the Prophet, peace and blessings be upon him, as in Sahih Muslim from the hadith of Zaid bin Arqam, used to say: «O Allah, I seek refuge in You from knowledge that does not benefit». So how about when it contains prohibitions and what leads to misguidance, which Allah knows best about. Groups have studied this science and regretted studying it. Among them from the Mutakallimun is Al-Razi for example, who excelled in this science and regretted studying it. Among them are those from Ahlus-Sunnah who studied it to refute the Mutakallimun as Sheikh al-Islam Ibn Taymiyyah did, and clarified that there is no benefit in this science, rather it is a cause for misguidance. Among them is Al-Shawkani in the explanation of the hadith: «The Halal is clear and the Haram is clear», he said: I inform you about a man who studied this science and completed his study until he reached the utmost in it. Then he clarified that there is no benefit in this science, and that whoever is deceived by this science is one who has not deepened his study of it. Therefore, Kalam never entered a science without corrupting it, including the science of Hadith.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 8
  },
  {
    "serial_number": "3338967",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "Al-Khatib Al-Baghdadi was influenced in his book (Al-Kifayah) in some chapters by Kalam, and after him the influence by Kalam increased even more. Ibn Rajab pointed out in Sharh (Al-Ilal) Al-Khatib's influence by Kalam, saying: Al-Khatib Al-Baghdadi spoke in the chapter of the addition of the trustworthy (Ziyadat al-Thiqah) and introduced the saying of the Mutakallimun into it. Fourth Introduction: A distinction should be made between the speech of the people of Hadith and the speech of the jurists in the science of Hadith and Hadith Terminology. There is a difference between the speech of the people of Hadith and the speech of the jurists, for the reliance and reference in every art is for its people. Ibn Abi Hatim narrated in his book (Al-Marasil) from his father Abu Hatim that the consensus of the people of Hadith is an authority, meaning in Hadith. Ibn Taymiyyah mentioned similar to this as in (Majmu' al-Fatawa) and Ibn al-Qayyim as in (Mukhtasar al-Sawa'iq), that the consensus of the people of every art is an authority in the art itself. It is a mistake for someone who is not specialized and knowledgeable in the science of Hadith among the jurists to speak about the science of Hadith, for whoever does that corrupts this science, as happened to Ibn al-Salah - may Allah Almighty have mercy on him - in the chapter of the addition of the trustworthy; he introduced the speech of jurists into this chapter, and Al-Biqa'i pointed this out. Therefore, confusion occurred with Ibn al-Salah in this chapter because he mixed it with the speech of jurists, and jurists are not people of knowledge in that. Ibn Daqiq al-Eid pointed to this meaning in his book (Al-Muqtarah) when he mentioned: \"without Shadh (anomaly) or 'Illah (defect)\", he said: Shadh is a defect that the Muhaddithun cared about and the jurists neglected. Therefore, a distinction should be made between the speech of the people of the art and the speech of others. The speech of jurists entered the science of Hadith, and what happened in it happened. Among the great words of Al-Bulqini, narrated by Al-Sakhawi from him, is that he said: If we expanded in interpretation (Ta'wil), we would have rejected many of the defects ('Illal) that the Imams of Hadith used to identify. Expanding in interpretation and reconciling between hadiths according to the method of jurists results in rejecting many of the defects brought by the Muhaddithun, and perhaps clarifying some of this will be possible - God willing -. Fifth Introduction: The science of Hadith has knights and Imams, who are the early scholars, the predecessors, like Shu'bah, Al-Thawri, Ahmad, Ibn al-Madini, Yahya bin Ma'in, the two Razis, and their likes.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 9
  },
  {
    "serial_number": "3338968",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "These Imams are the reference in this science, they are its knights and its Imams, and it is not correct for anyone to contradict them. Among the subtle clarifications by Ibn al-Qayyim - may Allah Almighty have mercy on him - during his discussion on the hadith of Anas regarding running fingers through the beard in his book (Tahdhib al-Sunan), when he quoted words from Ibn al-Qattan al-Fasi correcting a hadith that Muhammad bin Yahya al-Dhuhli had weakened, Ibn al-Qayyim said: \"These allowances are not paid attention to by the Imams of Hadith and the doctors of its defects. They know that the hadith is defective due to Al-Zubaidi's Mursal narration of it, and they have a taste that allowances and probabilities do not intervene between them and it.\" Ibn Rajab - may Allah Almighty have mercy on him - mentioned similar to that and said: The Imams of Hadith, if they say a saying, it is not correct for anyone to contradict them. Similarly, Ibn Hajar in his book (Al-Nukat 'ala Ibn al-Salah) said: If the Imams of Hadith and its knights speak in this science and are not contradicted, it is not correct for anyone to contradict them. All this is due to their deep-rootedness in this science and their knowledge of it, for they are the role models in it, and they are the followed Imams in knowing it. Then it should be known that we and they have two states: • First State: Matters we share with them, and they are the origin in them and it is not correct for us to dispute them, because we cannot reach a conclusion regarding the weakness or trustworthiness of a narrator except by referring to their words. The best any of us can do is to excel in collecting their words and summarizing them, so we are dependent on them. This is not just me and you, nor in our century or the previous century, but even in the time of Al-Khatib Al-Baghdadi and Ibn Abd al-Barr, for these do not critique by probing the narrator's condition, but rather rely on the words of the past Imams, so how about me and you? • Second State: Matters in which they separated from us, and distinguished themselves from those after them, for they accessed matters that no one after them can access. Examples of this include: That Imam Al-Bukhari - may Allah Almighty have mercy on him - asked Ismail bin Abi Owais to show him his books, so he showed him his books, and Imam Al-Bukhari - may Allah Almighty have mercy on him - selected from them. Ibn Hajar mentioned this in his introduction to Sahih Al-Bukhari. We cannot reach this level, and the utmost we can do is read the scholars' words about Ismail bin Abi Owais and look into the hadith, whereas Al-Bukhari accessed his books then selected from them a selection, and this is not available to those after them.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 10
  },
  {
    "serial_number": "3338969",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "Therefore, one should submit to the Imams and not oppose them, this is if they do not disagree. If they disagree, we use the rules of the people of knowledge that we received from them. Sixth Introduction: It should be known that the text (Matn) has an effect on the authenticity and weakness of the hadith. Some texts establish a new legal ruling, so strictness is applied to them which is not applied to others. Other texts do not bring a new ruling, so leniency is applied to them which is not applied to others. Examples of this include what Al-Bukhari narrated from Ubayy bin Abbas bin Sahl bin Sa'd Al-Sa'idi from his father from his grandfather regarding the mention of the Prophet's horse, peace be upon him, which was in a garden of theirs called Al-Lakhif. Ubayy bin Abbas is weak, and his brother Abd al-Muhaimin followed him, and he is weaker than him, yet Al-Bukhari narrated it. Ibn Hajar said in (Al-Nukat): Al-Bukhari was lenient in narrating it because it is not from the hadiths of rulings and nothing results from it, so Al-Bukhari - may Allah Almighty have mercy on him - was lenient in it. Therefore, this chain, if applied to another text in rulings, would not be authentic, but it was authentic in such a case. So the type of text should be scrutinized, for based on knowing the type of text, strictness or leniency in the chain is determined. Because of this, scholars were lenient in hadiths of encouragement and intimidation (Targhib and Tarhib). Al-Nawawi said in his book (Al-Adhkar): Scholars agreed on leniency in hadiths of encouragement and intimidation. And the words of Imam Ahmad, Al-Razi, and others said: If we narrate in Halal and Haram we are strict, and in encouragement and intimidation we are lenient. The reason for that, as Ibn Taymiyyah says in (Majmu' al-Fatawa) in the eighteenth volume, and similar was mentioned by Al-Shatibi in his book (Al-I'tisam), and Al-Albani in the introduction to (Sahih al-Targhib wa al-Tarhib), they said: The intended meaning is leniency in hadiths of encouragement and intimidation upon which no rulings are based. So the ruling is established by authentic evidences, thus its desirability or obligation is established, then another hadith mentions the virtue of what this hadith contained, so such is treated with leniency, with conditions such as the weakness not being severe, and so on.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 11
  },
  {
    "serial_number": "3338970",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "The reason for leniency in it is that Allah's bounty is vast, and how many acts of worship we perform without knowing their virtue, yet they may have virtues that only Allah knows. Allah's bounty is vast, then no Halal or Haram results from that, so leniency is applied in it unlike in others. Many make mistakes and authenticate hadiths in encouragement and intimidation while the original ruling indicated by these hadiths is not established by an authentic path, so their authentication of this hadith results in authenticating it in rulings, so strictness should be applied in such cases. An example of this: the hadith of the virtue of Dhikr upon entering the market. The hadith is weak, weakened by Ibn Adi and others. But if a man wanted to be lenient in this hadith on the pretext of leniency in hadiths of encouragement and intimidation, it is said: Authenticating this hadith results in the desirability of this Dhikr, so it returns to rulings; because what indicates desirability, obligation, prohibition, or dislike returns to rulings. No authentic hadith established the desirability of this Dhikr, then a hadith came clarifying its virtue. If a hadith authenticating the desirability of this Dhikr was established, then a hadith came clarifying its virtue, leniency would be applied in this virtue. But to base the matter on authenticating a hadith in virtue resulting in the saying of its desirability, such is not permissible. This is a matter that should be noticed, known, and realized. Seventh Introduction: This great science is grasped by much practice and application, not by theoretical matter. Some people you find prominent in studying the science of Terminology theoretically, but in application and practice they are weak and have little experience. Such a person does not have knowledge of hadiths' authenticity and weakness. I have seen some distinguished in studying the science of Terminology and expansive in it, but extremely weak in knowing hadiths as authentic or weak, and this is a big mistake. The student of knowledge should have practice, experience, and many applications until his arm strengthens and becomes strong, for this science is only grasped by much practice. Al-Khatib Al-Baghdadi - may Allah Almighty have mercy on him - mentioned this, and Ibn Hajar in his book (Al-Nukat), and Ibn Rajab in his explanation of (Al-Ilal), and Ibn al-Salah in some chapters. Whoever does much Takhrij (extraction) and tries to know how scholars judged authenticity and weakness, and practices a lot, his arm strengthens and he becomes strong in this science. Therefore, I advise you to strive in that and benefit from the books of Sheikh Nasir al-Din al-Albani - may Allah Almighty have mercy on him -, and not to stop there, but I advise you to start with them and then expand after that, and rise and ascend until you refer to the Imams and knights of this science.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 12
  },
  {
    "serial_number": "3338971",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "After this, I begin commenting on this blessed text, and I ask Allah to forgive Ibn Hajar - may Allah Almighty have mercy on him -.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 13
  },
  {
    "serial_number": "3338972",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "Hafiz Ibn Hajar - may Allah Almighty have mercy on him - said: In the name of Allah, the Entirely Merciful, the Especially Merciful. Praise be to Allah Who has always been Knowing, Capable. And may Allah send blessings upon our master Muhammad whom He sent to the people as a bearer of glad tidings and a warner, and upon the family of Muhammad and his companions and grant them abundant peace. To proceed: The compilations in the terminology of the people of Hadith have multiplied, expanded, and been abbreviated. Some brothers asked me to summarize for them the important parts of that, so I answered him to his request; hoping to be included in those paths. Hafiz Ibn Hajar - may Allah Almighty have mercy on him - followed the method of logicians in arrangement and division, which is the method of classification and division (Sabr wa Taqsim), and he did that for the sake of approximation and facilitation. Such a thing is not called an innovation, for the method of classification and division is indicated by the Quran, and the people of knowledge followed it before these logicians and theologians. His saying: (Some brothers asked me) A group asked him, among them Al-Zarkashi Al-Shafi'i, Al-Sakhawi - may Allah Almighty have mercy on him - mentioned this in his book: (Al-Jawahir wa al-Durar).",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 14
  },
  {
    "serial_number": "3338973",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "Hafiz Ibn Hajar - may Allah Almighty have mercy on him - said: So I say: The report (Khabar) either has: paths without a specific number, or with a restriction to more than two, or to two, or to one. So the first is: The Mutawatir (Mass Transmitted): Useful for certain knowledge with its conditions. And the second is: The Mashhur (Famous), which is the Mustafid (Extensive) according to an opinion. And the third is Al-Aziz (Rare/Strong), and it is not a condition for the Sahih contrary to who claimed it. And the fourth is: The Gharib (Strange). And all of them - except the first - are Ahad (Singular). Among them is the Accepted and the Rejected; because deducing evidence from them depends on researching the conditions of their narrators unlike the first. And among them may occur what provides theoretical knowledge through indicators according to the chosen view. Ibn Hajar - may Allah Almighty have mercy on him - mentioned that the arrival of Hadith and Khabar to us has two ways. He - may Allah Almighty have mercy on him - mentioned the term Khabar (Report). It should be known that the term (Hadith), (Khabar), and (Athar) are all applied to the Hadith attributed to the Prophet, peace and blessings be upon him; therefore, Al-Majd Ibn Taymiyyah authored: (Muntaqa al-Akhbar) naming the hadiths of the Prophet, peace and blessings be upon him, Akhbar. Also, Al-Tahawi authored: (Sharh Ma'ani al-Athar) naming the hadiths of the Prophet, peace and blessings be upon him, Athar. So Khabar applies to Prophetic Hadith and others, and Athar applies to Prophetic Hadith and others. Al-Nawawi - may Allah Almighty have mercy on him - mentioned that the method of Muhaddithun is that Khabar applies to Hadith, and that some Khurasanis differentiated between Athar and Hadith, saying: Athar is applied to other than the Prophet, peace and blessings be upon him, while Hadith is what is applied to the Prophet, peace and blessings be upon him. The correct view is to say: Khabar, Athar, and Hadith are all applied to the hadiths of the Prophet, peace and blessings be upon him, his sayings, actions, and approvals. So, the arrival of the Khabar to us has two states: • First State: That it reaches the level of Tawatur (Mass Transmission). • Second State: That it does not reach the level of Tawatur, which is Ahad.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 15
  },
  {
    "serial_number": "3338974",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "So whatever is not Mutawatir is Ahad, and Ahad has three divisions: 1 - Gharib. 2 - Aziz. 3 - Mashhur. I begin by explaining the meaning of Mutawatir; because whatever is not Mutawatir is Ahad. Mutawatir according to terminology scholars as clarified by Al-Hafiz in his explanation of this text, which is Nuzhat al-Nazar: What a group narrated from a group whose agreement and collusion on lying is habitually impossible, from the beginning of the chain to its end, and their basis is sensory perception. So the conditions for Tawatur are: • First condition: The narrators must be a group. • Second condition: Habit precludes their agreement and collusion on lying. • Third condition: It must be from the beginning of the chain to its end. • Fourth condition: Their basis must be sensory perception, like saying: I heard, or I saw, and the like. The difference between collusion (Tawatu') and agreement (Tawafuq): Collusion is what happens intentionally, meaning if this group tried to agree on lying they would not be able to, while agreement: meaning they agree on lying without collusion. Al-Manawi mentioned this in his comments on (Nukhbat al-Fikar). Every hadith that gathers these conditions is a Mutawatir hadith, and whatever does not gather these conditions is Ahad, and Ahad has three divisions: First Division: Gharib. It is when there is one narrator in one of the layers of the chain. If it is assumed that a hadith is narrated by five from five from one from five, it is Gharib. Second Division: Aziz. It is when there are two narrators in the smallest layer of the chain. If five narrated from five from two from five, it is an Aziz hadith.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 16
  },
  {
    "serial_number": "3338975",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "Third Division: Mashhur. It is what the narrators were a group more than two, three or more, but the conditions of Mutawatir did not apply to them. So every group from a group... etc. and the conditions of Tawatur did not apply to them, it is Mashhur. An important rule in the science of Terminology should be known: Scarcity prevails over abundance. If you want to judge a hadith whether it is Mutawatir or Ahad, and whether it is Gharib, Aziz, or Mashhur, look at the smallest layer of the chain's narrators. The consideration is for the minimum. If a thousand narrated from a thousand from a thousand from one from a thousand, it is said: It is Gharib, because the view is to the minimum. Similarly, if a thousand narrated from a thousand from a thousand from two from a thousand, the hadith is Aziz, because the view is to the minimum. Similarly, if a thousand narrated from a thousand from two from one from three, it is Gharib, for the view is to the minimum. As Al-Hafiz clarified in (Al-Nuzhah). His saying: (So I say: The report either has: paths without a specific number) His saying without a specific number: This is the Mutawatir, and this is the first division. The second division is his saying: (or with a restriction to more than two, or to two, or to one) This is the Ahad, and he indicated that Ahad are three types. His saying: (or with a restriction to more than two) This is the Mashhur. His saying: (or to two) meaning by the narration of two, and this is the Aziz. His saying: (or to one) And this is the Gharib. His saying: (So the first is: The Mutawatir: Useful for certain knowledge with its conditions) He made the Mutawatir useful for certain knowledge with its conditions, and the conditions of Tawatur were mentioned previously. It should be known that knowledge is of two types: • First Type: Necessary and certain knowledge, which is what does not need observation, deduction, or research. • Second Type: Theoretical knowledge, which is what needs observation and deduction. Hafiz Ibn Hajar made the Mutawatir useful for necessary certain knowledge, meaning without observation and deduction. In this there is a view [reservation] - and Allah knows best -; because many may narrate a single hadith and the reference of the multitude returns to a liar, or thieves who steal hadiths and multiply the paths falsely. Therefore, observation and deduction are necessary. Allama Al-Albani - may Allah Almighty have mercy on him - pointed this out in his comments on",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 17
  },
  {
    "serial_number": "3338976",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "(Nukhbat al-Fikar), and he spoke the truth - may Allah Almighty have mercy on him -. Al-Mu'allimi pointed to this in his comments on the book (Al-Fawa'id Al-Majmu'ah) by Al-Shawkani - may Allah Almighty have mercy on him -. His saying: (And the second is: The Mashhur, which is the Mustafid according to an opinion) meaning what a group narrated but did not reach the limit of Tawatur. His saying: (which is the Mustafid according to an opinion) meaning that some scholars name the Mashhur Mustafid and some differentiate between Mashhur and Mustafid. Ibn Hajar clarified that discussing Mustafid is not among the topics of this art, as he clarified in his explanation of (Nukhbat al-Fikar). Some say that the abundance must be at the beginning of the chain and its end, meaning the abundance should be in the entire chain beginning and end and in between, such is called Mustafid and other than that is called Mashhur. He mentioned other opinions then said: And this is not among the topics of this art. And he spoke the truth - may Allah Almighty have mercy on him -. His saying: (And the third is Al-Aziz, and it is not a condition for the Sahih contrary to who claimed it) Aziz is what two narrated as preceded, and such is not a condition for the authentic hadith. He said: (contrary to who claimed it) and the one who claimed that are the Mu'tazila, like Al-Jubba'i and others. Their disagreement should not be mentioned for their disagreement is not considered and is not used as evidence in the entire religion, so how about the science of Hadith? This was attributed to Abu Abdullah Al-Hakim in his book (Ma'rifat Ulum al-Hadith), and in this attribution there is a view [reservation], for he authenticated many hadiths by the narration of a single narrator. Al-Hakim - may Allah Almighty have mercy on him - only intended that the companionship of a Companion is not established except if two narrate from him, with details according to him. The important thing is that it is not a condition for the authenticity of the hadith that two narrate it, neither Abu Abdullah Al-Hakim nor others from Ahlus-Sunnah nor the Imams of this field from the people of Hadith. His saying: (And the fourth is: The Gharib) It preceded that Gharib is what a single narrator narrated, it is called Gharib. I emphasize that scarcity in this art prevails over abundance, so the least narrated layers are looked at, and based on that the hadith is described whether it is Mutawatir or Ahad, then it is looked at which division of Ahad it is, Gharib, Aziz, or Mashhur? It should be known that the term (Gharib) has a meaning among the early scholars different from its meaning among the later ones. When they say: \"Gharib hadith\", they mean by it that it is a weak hadith. From that is the practice of Al-Tirmidhi - may Allah Almighty have mercy on him -, he says: This is a Gharib hadith. Meaning: Weak.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 18
  },
  {
    "serial_number": "3338977",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "Imam Ahmad said: If you see the people of Hadith saying: Fa'idah (Benefit) or Gharib, leave it. He clarified by this that it is a weak hadith. So when scholars say: Fawa'id of Abu Tammam, Fawa'id of such, meaning his weak hadiths. This is a terminology followed by the early scholars - may Allah have wide mercy on them -. His saying: (And all of them - except the first - are Ahad. Among them is the Accepted and the Rejected; because deducing evidence from them depends on researching the conditions of their narrators unlike the first) He clarified - may Allah Almighty have mercy on him - that Ahad with its three divisions needs research, deduction, and observation until it becomes clear whether it is authentic or weak? His saying: (- except the first -) which is Mutawatir. It preceded that there is a view [reservation] in this, and that Mutawatir needs research and deduction. Then he clarified that Ahad contains the Accepted and the Rejected unlike Mutawatir, and the correct view is that in all hadiths whether Mutawatir or Ahad there is the Accepted and the Rejected as preceded. His saying: (And among them may occur what provides theoretical knowledge through indicators according to the chosen view) This is a discussion on Ahad hadiths and their provision of prevailing opinion (Ghalabat al-Zann) or knowledge (Ilm). The majority of scholars hold that Ahad hadiths provide prevailing opinion. Among those who chose this is Ibn Taymiyyah in his book (Minhaj al-Sunnah) and as in (Majmu' al-Fatawa). But Ibn Taymiyyah - may Allah Almighty have mercy on him - clarified in a useful discussion in (Muqaddimat Usul al-Tafsir) and in (Radd al-I'tiradat al-Misriyyah 'ala al-Fatwa al-Hamawiyyah) that the Ahad hadith if surrounded by indicators provides knowledge, and attributed this to the scholars of the four schools. Even Abu Ishaq Al-Isfarayini said: The hadith narrated by Al-Bukhari and Muslim provides knowledge by consensus. This is an indicator that it provides knowledge, even though Abu Ishaq Al-Isfarayini is from the Mutakallimun, yet he mentioned that the hadith if agreed upon by Al-Bukhari and Muslim provides knowledge by consensus. Therefore, the Ahad report if surrounded by indicators moves from prevailing opinion to knowledge. Among the indicators: that the Ummah acts upon it, or Al-Bukhari and Muslim narrate it, or the Ummah receives it with acceptance, to other numerous indicators. Some scholars like Ibn al-Qayyim as in (Mukhtasar al-Sawa'iq) held that the Ahad report provides knowledge by mere authenticity without being surrounded by indicators, and attributed this to Malik, Ahmad, Al-Shafi'i, and a group. Then Ibn al-Qayyim said: And this knowledge varies in its strength. So it seems Ibn al-Qayyim's disagreement with those who say it provides",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 19
  },
  {
    "serial_number": "3338978",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "prevailing opinion is close to being verbal, because he admitted that this which provides knowledge also varies in the knowledge it provides. The matter is easy, but the following should be known: • First Matter: The Ahad report is evidence in Fiqh and practice. Many proofs indicated this, mentioned by Al-Shafi'i - may Allah Almighty have mercy on him - in his book (Al-Risalah), and elaborated by Al-Khatib Al-Baghdadi in his book (Al-Faqih wa al-Mutafaqqih). Then consensus was narrated that the Ahad report is evidence for practice by a group of scholars including Ibn al-Qass, narrated from him by Al-Khatib Al-Baghdadi in his book (Al-Faqih wa al-Mutafaqqih) and affirmed by Al-Khatib, and Ibn Abd al-Barr in the beginning of his book (Al-Tamhid), and Ibn Taymiyyah in (Daf' al-I'tiradat al-Misriyyah), and Ibn al-Qayyim as in (Mukhtasar al-Sawa'iq). • Second Matter: The Ahad report is evidence in Creeds (Aqa'id) by consensus, due to the many proofs for accepting the Ahad report in Creeds. Among them is what Al-Bukhari and Muslim narrated from Ibn Abbas that the Prophet, peace and blessings be upon him, sent Mu'adh to Yemen and said: «You are going to a people from the People of the Book, so let the first thing you call them to be the testimony that there is no god but Allah» Hadith. He established the proof through Mu'adh, may Allah be pleased with him, and those with him, and these did not reach the limit of Tawatur according to the criterion of Tawatur among the Mutakallimun. As for the consensus that the Ahad report is evidence in the chapter of Creeds, it was narrated by a group including Ibn Abd al-Barr in the beginning of his book (Al-Tamhid) and Ibn Taymiyyah in (Daf' al-I'tiradat al-Misriyyah). After this: Mentioning Tawatur in the science of Hadith is a matter mentioned by past scholars. Among those who mentioned that is Imam Al-Bukhari, he said regarding the hadith: «There is no prayer for he who does not recite the Mother of the Quran»: A Mutawatir hadith. But Tawatur has a meaning among the Imams and knights of this art different from its meaning among Terminology scholars. What was mentioned previously of conditions for Tawatur is the saying of the Mutakallimun not the jurists nor the early Salaf Imams. The first to mention it in books of Hadith Terminology was Al-Khatib Al-Baghdadi - may Allah Almighty have mercy on him -, otherwise its origin is taken from the Mutakallimun. Therefore, these conditions have no mention in the speech of past scholars, neither explicitly nor implicitly. Rather, they have speech indicating the opposite, for Al-Shafi'i has speech indicating criticism of some conditions of Tawatur, and similarly Al-Darimi in his refutation of Bishr al-Marisi.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 20
  },
  {
    "serial_number": "3338979",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "Tawatur with these conditions does not exist in Prophetic hadiths. Ibn Hibban stated this explicitly in the introduction to his Sahih, saying: The entire Sunnah is Ahad. And he spoke the truth - may Allah Almighty have mercy on him -, for on these conditions there is no example for it. Al-Hazimi - may Allah Almighty have mercy on him - mentioned similar, and Ibn al-Najjar who is one of the Usuli Mutakallimun in Sharh (Al-Kawkab), then Ibn al-Salah in the phrase quoted by Al-Hafiz in (Al-Nuzhah) said: Unless it is claimed in the hadith: «Whoever lies about me intentionally», also 'claimed', meaning not asserted. So Tawatur in this sense does not exist in Prophetic Hadith. It preceded that the science of Hadith Terminology studies the terminologies of the people of knowledge, and it is an instrumental science not an end in itself to know Prophetic hadiths authenticity and weakness. Thus, the saying of Tawatur in this sense does not exist. • Note: Past scholars expressed Tawatur, but Mutawatir to them meant: The Abundant (Mutakathir), for their expressions as preceded are closer to the linguistic meaning. Tawatur varies; three might narrate a hadith and it be Mutawatir, and ten might narrate it and it not be Mutawatir. Ibn Taymiyyah said: That is due to the difference in the condition of narrators. Then Ibn Taymiyyah likened this to food, he said: Among food is that which if you eat a little of it you become full like meat, and among food is that which if you eat a lot of it you do not become full. He attributed this to the people of Hadith. And he spoke the truth - may Allah Almighty have mercy on him -. Three narrators might narrate a hadith and it be Mutawatir, five might narrate it and it be Mutawatir, and ten might narrate it and it not be Mutawatir. This is by looking at the condition of narrators. So Tawatur exists in their speech but contrary to these conditions introduced by the Mutakallimun which have no existence in the Prophetic Hadith from the Messenger of Allah, peace and blessings be upon him.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 21
  },
  {
    "serial_number": "3338980",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "Hafiz Ibn Hajar - may Allah Almighty have mercy on him - said: Then the Gharabah (Strangeness): Either it is in the origin of the Sanad (Chain), or not. So the first is: Al-Fard Al-Mutlaq (Absolute Singular). And the second is: Al-Fard Al-Nisbi (Relative Singular), and the application of 'Fardiyyah' to it is rare. And the Ahad report with the transmission of a 'Adl (Upright) Tamm al-Dabt (Perfectly Precise), with a connected Sanad, not Mu'allal (Defective) nor Shadh (Anomalous): Is the Sahih Li-dhatihi (Authentic by itself). And its ranks vary with the variation of these descriptions. Hence Sahih Al-Bukhari is prioritized, then Muslim, then their condition. If the precision is lightened: It is Al-Hasan Li-dhatihi (Good by itself), and with the multiplicity of its paths it becomes Sahih. If they are combined, it is due to hesitation in the transmitter where there is uniqueness, otherwise it is considering two chains. And the addition of their narrator is accepted as long as it does not occur contradictory to one who is more trustworthy. If contradicted by a more preponderant, the preponderant is Al-Mahfuz (Preserved), and its opposite is Al-Shadh. And with weakness, the preponderant is Al-Ma'ruf (Known), and its opposite is Al-Munkar (Denounced). And the Relative Singular: If another agrees with it, it is Al-Mutabi' (Follower), and if a text resembling it is found, it is Al-Shahid (Witness). And tracking the paths for that is Al-I'tibar (Consideration). His saying: (Then the Gharabah: Either it is in the origin of the Sanad, or not. So the first is: Al-Fard Al-Mutlaq. And the second is: Al-Fard Al-Nisbi, and the application of 'Fardiyyah' to it is rare) His intent by this is that strangeness is either in the origin of the chain, i.e., from the Companion, or not. The view for strangeness is not from the Companion himself but in the narrators from the Companions who are the Tabi'un, because in such research one looks at who is after the Companion not at the Companions themselves. If one narrator narrated from the Companion and the Tabi'i was one, it is strange in the origin of the chain, so it is called: Absolute Singular. But if the strangeness is in one of the layers of the chain either from a specific scholar like Shu'bah, so one is unique from Shu'bah, and so on, this is strangeness but it is called: Relative Singular.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 22
  },
  {
    "serial_number": "3338981",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "Al-Hafiz - may Allah Almighty have mercy on him - made Gharib into two types, either in the origin of the chain or after that. In the origin of the chain it is called: Absolute Singular, and what is after that is called Relative Singular. Relative is like being unique from Shu'bah, such is rarely called 'Fardiyyah', but rather it is said: Gharib from the hadith of so-and-so. As for uniqueness (Tafarrud), it is applied if it is in the origin of the chain. What appears - and Allah knows best - from the practice of the Imams of the people of Hadith is that they do not notice such things. Whenever they see uniqueness and there is a benefit in mentioning uniqueness whether in the origin of the chain or otherwise, they say: No one narrated it from so-and-so except so-and-so. And they do not observe such things - and Allah knows best -. His saying: (And the Ahad report with the transmission of a 'Adl Tamm al-Dabt, with a connected Sanad, not Mu'allal nor Shadh: Is the Sahih Li-dhatihi) He began explaining the accepted and rejected hadiths. It should be known that hadiths generally are of two types: • First Type: Accepted hadiths, which are four sections: o First Section: Sahih Li-dhatihi. o Second Section: Sahih Li-ghayrihi. o Third Section: Hasan Li-dhatihi. o Fourth Section: Hasan Li-ghayrihi. • Second Type: Rejected hadiths, and discussion on it and causes of its rejection will come - God willing -. Al-Hafiz began by explaining the definition of Sahih Li-dhatihi, and mentioned five conditions for it, three of which are positive conditions and two are negative. Among the conditions are what relates to the chain only, and among them what relates to the text as well. Shadh and Mu'all relate to the text as well, while narrated by 'Adl Tamm al-Dabt relates to the chain. Shudhudh and 'Illah relate to chain and text. His saying: (with the transmission of a 'Adl Tamm al-Dabt...) First condition: To be 'Adl (Upright). Second condition: To be Tamm al-Dabt (Perfectly Precise). Third condition: To have a connected chain. Fourth condition: Not to be Mu'all (Defective). Fifth condition: Not to be Shadh (Anomalous). If these five conditions gather in a hadith, it is Sahih. If a condition from these conditions is missing, it decreases in its authenticity or becomes Hasan or Da'if (Weak), depending on the deficiency in the condition.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 23
  },
  {
    "serial_number": "3338982",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "Al-Adl: Meaning the narrator possesses piety (Taqwa) and integrity (Muru'ah). Whoever is not like that, his hadith is not Sahih, like being an innovator or Fasiq (sinner). If the narrator is an innovator or Fasiq, his hadith is weak; because this condition he applied even in Hasan. So if this condition is missing, the hadith moves from being Sahih to being Weak. This - and Allah knows best - has a view [reservation]. As for Fisq (sinfulness), it does not prevent accepting the narration, and you do not see in the words of scholars, the Imams of this art, that they rejected a hadith from a man because he is Fasiq as long as he is truthful and precise. This is confirmed by what will come, which is that past scholars are almost unanimous on accepting the narration of the innovator which is worse than Fisq, even if he was a caller to it. Al-Khatib Al-Baghdadi mentioned this in his book (Al-Kifayah) and quoted it from a group of people of knowledge and prolonged the quotation in that. Perhaps clarification of this will come more - God willing -. So, the condition of being 'Adl meaning not being Fasiq and a fortiori not being an innovator has a view [reservation] - and Allah knows best -. And Perfect Precision (Tamam al-Dabt) in the apparent wording: means reaching the highest of precision, and in modern estimations it is said: one hundred percent, because when he mentioned the deficiency of this condition he said: Hasan is what his precision is lightened. This has a view [reservation] - and Allah knows best -, and its clarification will come more in discussing Hasan. That is because among the trustworthy (Thiqat) there are those whose perfect precision decreases and they are still trustworthy. Even Al-Dhahabi has a saying implying that there is no trustworthy narrator except that he has erred, and this is in the majority. His saying: (with a connected Sanad, not Mu'allal nor Shadh) Discussion on connection will come - God willing -. However, it is said: Mu'allal, Ma'lul, or Mu'all are synonymous terms. The term (Mu'all) is found in the speech of linguists who affirmed it, and likewise the term (Ma'lul), while the term (Mu'allal) was denied by many linguists, and the matter in this is easy - God willing. The point is that Terminology scholars made 'Illah a hidden defect impugning the authenticity of the hadith. This means that the apparent matter is not called 'Illah. Al-Nawawi, Al-Iraqi, Al-Sakhawi, and a group rectified this and clarified that 'Illah applies to the hidden matter and the apparent matter, i.e., to the hidden defect and the apparent defect. The books of the Imams of 'Ilal like Imam Ali bin al-Madini, the two Razis, and Al-Daraqutni, indicate that they mention in them what was defective whether by an apparent or hidden defect. It became common among Terminology scholars",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 24
  },
  {
    "serial_number": "3338983",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "that they restrict 'Illah to the hidden matter. Abu Abdullah Al-Hakim spoke similarly in (Ma'rifat Ulum al-Hadith), but it might be said that his speech is regarding the majority, because the speech of the early ones is further from definition and discipline than the speech of those after them, for the later ones care greatly about definitions, and if they define a definition they want it to be inclusive and exclusive... etc. The point is that 'Illah in the speech of past scholars applies to the impugning matter whether hidden or apparent. His saying: (nor Shadh) Shadh is defined - as will come - by the contradiction of a trustworthy narrator to one who is more trustworthy, either in precision or in abundance and number. So if one contradicts a group of trustworthy narrators or those who are more trustworthy than him, it is said about it: Shadh. What appears - and Allah knows best - is that Shudhudh is broader than this, although it indicates this but it is broader than this. Everything that indicates linguistically that it deviated (Shadhdha) - i.e., was unique with a uniqueness that is not accepted - is said about it: Shadh, whether the trustworthy or the weak was unique. Clarification of this will come more - God willing -. Then let it be known that scholars' expression with the term (Shadh) in books of 'Ilal is rare or almost non-existent. I have turned over what Allah facilitated of them and did not find them expressing a hadith as Shadh, but rather they say: Munkar, Khata' (Error), and so on. Therefore, reliance regarding narrators is that they be precise, and truthful, combining truthfulness and precision, then that the chain is not disconnected between him and his sheikh, then that there is nothing in the text preventing its acceptance by contradicting others which are more authentic than it necessitating its rejection. If these matters gather in a hadith, it is an authentic hadith. As for the narrator being Muslim, this is a condition by consensus, for the disbeliever's narration is not accepted; Al-Nawawi - may Allah Almighty have mercy on him - narrated the consensus. His saying: (And its ranks vary with the variation of these descriptions) He spoke the truth - may Allah Almighty have mercy on him - and this indicates that his saying: (Perfect Precision) has a view [reservation]. Perfection is not stipulated, rather he reaches a perfection in precision but it is not stipulated to be complete - and Allah knows best -. Then it should be known that precision according to scholars is of two types: precision of chest (memory), and precision of book.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 25
  },
  {
    "serial_number": "3338984",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "His saying: (Hence Sahih Al-Bukhari is prioritized, then Muslim, then their condition) i.e., because the ranks of Sahih vary, Sahih Al-Bukhari was prioritized over Sahih Muslim. Al-Bukhari's hadiths are authentic and Muslim's hadiths are authentic, but Al-Bukhari's hadiths are more authentic. What is on the condition of Al-Bukhari and Muslim is prioritized over what is on the condition of Al-Bukhari, and what is on the condition of Al-Bukhari is prioritized over what is on the condition of Muslim. Notes: First Note: What the two Sheikhs agreed upon is prioritized over others in general knowing that there is a difference between Muhaddithun and Jurists in the terminology of Muttafaq Alayh (Agreed Upon). Muhaddithun stipulate that the text and the Companion be the same in the two Sahihs, while Jurists, even if the Companion differed, make it Agreed Upon as long as the text is in Al-Bukhari and Muslim. Ibn Hajar benefited this in Al-Nukat. Based on this, the hadith: \"Indeed, some eloquence is magic\" is Agreed Upon according to Jurists unlike Muhaddithun, because Muslim narrated it from Ammar bin Yasir, and Al-Bukhari narrated it from Ibn Umar. Second Note: The hadiths of Sahih Al-Bukhari are prioritized in authenticity over the hadiths of Sahih Muslim in general not individually, as clarified by Al-Zarkashi - may Allah Almighty have mercy on him -. Third Note: Ibn Hajar verified in his book (Al-Nukat) and in (Al-Nuzhah) - which is the explanation of (Al-Nukhbah) - that it is not known from any of the people of knowledge that they preferred Sahih Muslim over Sahih Al-Bukhari. He said: There are some in the Maghreb who preferred Sahih Muslim over Sahih Al-Bukhari but intended arrangement and organization and did not intend authenticity. His saying: (then their condition) The meaning of scholars' saying: On the condition of Al-Bukhari, or condition of Muslim, should be known. The most correct opinion is that the meaning of scholars' saying: \"On the condition of Al-Bukhari\" or \"On the condition of Muslim\" is that the chain of the hadith is in the form of the chain of hadith in Sahih Al-Bukhari, or in the form of the chain of hadith in Sahih Muslim, or in the form of the chain of hadith in the two Sahihs, not that the intended meaning is the men (narrators) of Al-Bukhari and Muslim. This was verified by Ibn Daqiq al-Eid, Al-Dhahabi, Ibn al-Salah, Ibn Hajar, Al-Sakhawi, and a group of people of knowledge.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 26
  },
  {
    "serial_number": "3338985",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "Therefore, whoever wants to say about a hadith that it is on the condition of Al-Bukhari or Muslim must look at their extraction of the narrators of the hadith in the form extracted by Al-Bukhari or Muslim or both. Then after this it is said: It should be known that Al-Bukhari and Muslim did not stipulate a condition, Abu al-Fadl bin Tahir al-Maqdisi mentioned this in Shurut al-A'immah al-Sittah. The utmost of those who speak on this speak by deduction, saying: This is on the condition of Al-Bukhari, and this is on the condition of Muslim. What appears - and Allah knows best - is that upon scrutiny it is not correct to say about a hadith that it is on the condition of Al-Bukhari nor on the condition of Muslim nor on their condition, due to the following: • First Matter: Scholars look at the text and the chain. Al-Bukhari might accept this chain for this text, and not accept this chain for another text, as mentioned in the introduction. Al-Bukhari narrated from Ubayy bin Abbas bin Sahl bin Sa'd Al-Sa'idi from his father from his grandfather regarding the mention of the Prophet's horse, peace be upon him, in a garden of theirs called Al-Lakhif. This chain, if it were for another text in rulings, Al-Bukhari would not accept it. So if someone saw this chain and cited it for another text in rulings, it would become weak. Is it correct to say weak on the condition of Al-Bukhari? This is not correct in any case. So the past scholars observe the text with the chain. Al-Bukhari might be lenient in a chain considering the text, and not lenient in this chain considering another text. There are examples for this and perhaps some will be mentioned during the explanation - God willing -. • Second Matter: Imam Al-Bukhari and Imam Muslim select. It preceded that Al-Bukhari selected from the hadiths of Ismail bin Abi Owais, so he narrated what he saw as selected and authentic. It is not correct for those after them to come to any hadith of Ismail bin Abi Owais and narrate it saying: On the condition of Al-Bukhari, in the form extracted by Al-Bukhari, then say it is on the condition of Al-Bukhari. So what appears - and Allah knows best - is that it is not correct to say about a hadith that it is on the condition of Al-Bukhari or on the condition of Muslim or on their condition, due to what was mentioned. I emphasize that they did not stipulate their conditions in an apparent text. Rather, Muslim indicated in the introduction that he narrates from the first and second layer and selects from the third, unlike Al-Bukhari who narrates from the first and second. Al-Bukhari did not state this either, but it was deduced from his action. What was mentioned may be benefited from the words of Ibn Hajar - may Allah Almighty have mercy on him - in his book (Al-Nukat 'ala Ibn al-Salah).",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 27
  },
  {
    "serial_number": "3338986",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "His saying: (If the precision is lightened: It is Al-Hasan Li-dhatihi) He made the difference between Sahih Li-dhatihi and Hasan Li-dhatihi the lightness of precision. Al-Dhahabi mentioned in his book (Al-Muqizah) saying: I am in despair that a criterion exists for the Hasan hadith. Meaning he says: I despair that a criterion is mentioned for the Hasan hadith. Some thought that when Hafiz Ibn Hajar said: If his precision is lightened then it is the Hasan hadith, that he brought the criterion. This has a view [reservation]. Al-San'ani clarified this in his book (Nata'ij al-Afkar), he said - may Allah Almighty have mercy on him -: And what is the criterion for lightness of precision? It preceded that the narrators of authentic hadiths vary in their precision. As an approximation: Whoever his memorization is one hundred percent, is called Sahih. Whoever his memorization is ninety percent is called Sahih. Whoever his memorization is eighty percent is called Sahih. Whoever his memorization is eighty percent compared to one hundred percent has lightened precision, yet he is called Sahih. So what is the criterion of lightness that makes the hadith Hasan? By this it is known - and Allah knows best - that there is no decisive criterion for the Hasan hadith. Therefore, one should not be strict in the criterion of the Hasan hadith. The early scholars used to include the Hasan hadith in the Sahih hadith. Ibn Taymiyyah mentioned the consensus on that, he said: Until Al-Tirmidhi came and divided the hadith into three divisions, Al-Sakhawi quoted this from him in his book (Fath al-Mughith). The division among the early scholars was Sahih and Da'if (Weak), so whatever is not Weak is Sahih, and Hasan enters into that. This is easier, although a scholar might say: This is a Hasan hadith, indicating that it is in the lowest ranks of precision, i.e., lowest ranks of authenticity, but Hasan does not exit from being Sahih. Some issues in Sahih hadith were mentioned previously. As for issues of Hasan hadith, there are several issues, some of which were mentioned during the explanation, but among the issues: • First Issue: The early scholars include Hasan hadith in Sahih hadith. Ibn Taymiyyah narrated this as a consensus as quoted by Al-Sakhawi in his book (Fath al-Mughith). Therefore, the division according to them is between Sahih and Da'if as previously clarified. This is more precise than the tripartite division due to what was mentioned that there is no precise criterion for the Hasan hadith. • Second Issue: The one who divided Hadith in terms of acceptance into Sahih, Hasan, and Da'if is Al-Tirmidhi - may Allah Almighty have mercy on him -. He is the one famous for dividing Hadith into",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 28
  },
  {
    "serial_number": "3338987",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "these three divisions, and intended by them in terms of validity and rejection, as clarified by Sheikh al-Islam Ibn Taymiyyah - may Allah Almighty have mercy on him -. Hence he said: And the first to single out the Hasan hadith is Al-Tirmidhi. • Third Issue: In the speech of early scholars, there is the usage of Hasan, intending by it several meanings, either the goodness of the text, or the goodness of its wordings, or the strangeness of the text. Thus Shu'bah said: From its goodness (Hasan) I fled... to other meanings. Ibn Hajar - may Allah Almighty have mercy on him - quoted this in his book (Al-Nukat). • Fourth Issue: Imam Ahmad - may Allah Almighty have mercy on him - said: Weak hadith is more beloved to me than opinion (Ra'y). Imam Ahmad - may Allah Almighty have mercy on him - does not intend the weak hadith which opposes the Sahih - i.e., the Rejected - because scholars agree that the weak hadith which is synonymous with Rejected and opposes Sahih is not used as evidence in rulings. Ibn Taymiyyah narrated the consensus as in (Majmu' al-Fatawa). Rather, Imam Ahmad's intent is: Hasan Li-ghayrihi, meaning what became accepted by its corroborations. If you look at it by itself, it is weak, and if you look at it by its corroborations, it became accepted, i.e., Hasan Li-ghayrihi. Imam Ibn Taymiyyah clarified this as in (Majmu' al-Fatawa), Ibn al-Qayyim in (A'lam al-Muwaqqi'in), Ibn Rajab in his explanation of (Al-Ilal), and Al-Shatibi mentioned similar in his book (Al-I'tisam). So Imam Ahmad's saying: \"Weak hadith is more beloved to me than opinion\" means the hadith that is strengthened, i.e., Hasan Li-ghayrihi. Hence Ibn Taymiyyah said: And it is the meaning of Al-Tirmidhi's saying in Hasan hadith: What is narrated from more than one path, and is not Shadh nor Mu'allal. Meaning what is strengthened by more than one path which is Hasan Li-ghayrihi. • Fifth Issue: I emphasize that there is no precise criterion for the Hasan hadith, and that Hafiz Ibn Hajar's saying: If his precision is lightened. Is not a precise criterion in differentiating between Hasan hadith and Weak hadith. His saying: (and with the multiplicity of its paths it becomes Sahih) This indicates that the hadith is strengthened by the sum of its paths, and discussing this will come - God willing -. However, strengthening the hadith by the sum of its paths such that the Weak becomes Hasan, and the Hasan becomes Sahih, is agreed upon. Ibn Taymiyyah - may Allah Almighty have mercy on him - narrated the consensus as in his book (Talkhis al-Istighathah), and also Al-Albani - may Allah Almighty have mercy on him - narrated the consensus in (Risalah fi Tahrim Alat al-Lahw wa al-Tarab). Imam Ahmad explicitly stated this",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 29
  },
  {
    "serial_number": "3338988",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "Ahmad - may Allah Almighty have mercy on him -, i.e., explicitly stated that the hadith is strengthened by the sum of its paths. The Quran indicates it. Ibn Taymiyyah said as in (Majmu' al-Fatawa): The Almighty said: {that if one of the two errs, the other can remind her} [Al-Baqarah: 282]. He said: This is evidence that the hadith is strengthened by the sum of its paths. Discussion on this will come more - God willing -. His saying: (If they are combined, it is due to hesitation in the transmitter where there is uniqueness, otherwise it is considering two chains) His saying: (If they are combined) i.e., if it is said in a hadith: Hasan Sahih. Al-Hafiz says this has two cases: • First Case: Either it has only one path, so the combination is by way of hesitation, such that the critic is hesitant whether it is a Sahih hadith or a Hasan hadith. • Second Case: That it has two paths, so one of the paths is Hasan and the other is Sahih. This is what Al-Hafiz mentioned, and this has a view [reservation] - and Allah knows best - for the practice of scholars is contrary to that. Therefore, most of what Al-Tirmidhi says: Hasan Sahih hadith. It is from the most authentic of Sahih, which is what the two Sheikhs agreed upon. Ibn Rajab - may Allah Almighty have mercy on him - mentioned this in his explanation of (Al-Ilal), and Ibn Hajar in his book (Al-Nukat). Therefore, Al-Tirmidhi's saying: Hasan Sahih. Is an indication to the most authentic of Sahih mostly. • Note: The one who uses these terms the most is Al-Tirmidhi - may Allah Almighty have mercy on him - in his Jami'. He defined one of them which is Hasan, mentioning three conditions: That it is narrated from more than one path, and is not Shadh nor Mu'allal. As for Gharib, the practice of scholars is that it means Weak as proceeded. As for saying: Hasan Sahih. The induction of Ibn Rajab and Ibn Hajar is that it is the most authentic of Sahih as mentioned. As for his saying: Not narrated except from this aspect. This is clear that he means uniqueness (Tafarrud), either absolute or relative uniqueness, and it proceeded that scholars do not scrutinize this and their usages are closer to language than to terminology. • Note: Differences in copies of Al-Tirmidhi are frequent. In some copies: Hasan hadith. In some copies: Hasan Sahih hadith. etc. The most precise - and Allah knows best - is what Al-Mizzi quoted in his book (Tuhfat al-Ashraf). So if you doubt the copies in our hands, refer to (Tuhfat",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 30
  },
  {
    "serial_number": "3338989",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "al-Ashraf) by Al-Mizzi, for he is a distinguished and precise scholar, so what he mentions is more reliable than others - and Allah knows best -. His saying: (And the addition of their narrator is accepted as long as it does not occur contradictory to one who is more trustworthy) i.e., the addition of the narrator of Hasan hadith and the addition of the narrator of Sahih hadith are accepted as long as they do not occur contradictory to one who is more trustworthy. This is a correct foundation. Every trustworthy narrator is accepted, his narration is accepted in principle unless he contradicts one who is more trustworthy than him. This is a clear foundation and Imam Al-Shafi'i - may Allah Almighty have mercy on him - explicitly stated this, saying: It might be by being better in memorization or greater in number. This issue is called the issue of 'Addition of the Trustworthy' (Ziyadat al-Thiqah). Before delving into this issue, an important and very precise foundation should be understood: Contradiction according to scholars of Hadith differs and varies from contradiction according to scholars of Fiqh. Contradiction according to scholars of Hadith does not mean the impossibility of combining. Trustworthy narrators might narrate a hadith, then a trustworthy one is unique among them with an addition that can be combined with the origin of the hadith. But this, according to scholars of Hadith, is called contradiction even if combining is possible, as long as he added a matter upon which a ruling is based, unlike scholars of Fiqh. Therefore, Ibn Hajar's saying here: (as long as it does not occur contradictory) means contradictory according to the method of Muhaddithun not the method of Jurists, as he pointed out in (Hady al-Sari) and in his explanation of Al-Bukhari. He said: Contradiction according to the method of Muhaddithun. There is a difference between contradiction according to the method of Muhaddithun and contradiction according to the method of Jurists. According to Jurists, if one of the narrators added an addition, they say this is specific and that is general, or absolute and restricted, and they try to combine using many methods of combination. As for Muhaddithun, if a trustworthy narrator adds an addition over others upon which a ruling is based - i.e., has a meaning - it is considered an addition and researched as addition of the trustworthy, even if combining is possible. It proceeded what Ibn al-Qayyim mentioned in Tahdhib al-Sunan commenting on Ibn al-Qattan when he mentioned the hadith of Anas in running fingers through the beard, he said: \"These allowances are not paid attention to by the Imams of Hadith and the doctors of its defects. They know that the hadith is defective due to Al-Zubaidi's Mursal narration of it, and they have a taste that allowances and probabilities do not intervene between them and it.\" Ibn al-Qattan tried to combine according to the method of Jurists but Ibn al-Qayyim - may Allah Almighty have mercy on him - refuted him. Similarly, Ibn Hajar said when he said: Contradiction according to the method of Muhaddithun. So if Muhaddithun say: So-and-so contradicted So-and-so. This does not mean that combining is impossible. Yes, combining is possible according to the method of Jurists, but he added something upon which a meaning is based and the rest did not bring it. From",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 31
  },
  {
    "serial_number": "3338990",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "here Al-Bulqini said, as quoted by Al-Sakhawi: If we expanded in interpretation (Ta'wil), we would have rejected many of the defects ('Illal) that the Imams of Hadith used to identify. And he spoke the truth - may Allah Almighty have mercy on him -. Examples of this: The hadith of Abu Qais Al-Awdi from Huzayl bin Shurahbil from Al-Mughirah bin Shu'bah. The hadith of Al-Mughirah bin Shu'bah is famous in the two Sahihs and others, he said: «Leave them, for I put them in while they were pure» then he bent down and wiped over them, peace be upon him, i.e., wiped over the Khuffs (leather socks). Abu Qais Al-Awdi added an addition and said: He wiped over the Khuffs and the sandals (Na'layn). So he added: \"and the sandals\". This addition according to the method of Jurists can be combined; he mentioned a ruling others did not bring so it does not harm. But Muhaddithun said: Abu Qais Al-Awdi contradicted the people and brought the wording \"sandals\" while others did not bring this wording. Others said: Huzayl contradicted the people. Among those are Imam Ali bin al-Madini, who said: He contradicted the people of Medina, Basra, and Kufa and brought the wording \"sandals\". Note that he made it a contradiction. Similarly, Yahya bin Ma'in and Imam Muslim mentioned. Al-Bayhaqi quoted these quotations in his book (Al-Sunan Al-Kubra). Note that Muhaddithun expressed it as contradiction. • Note: If what preceded is understood, a door from the doors of defects opens which many have closed because they followed the method of Jurists not Muhaddithun, and thought that the meaning of \"incompatibility of combination\" or \"contradiction\" is that it is in a way where combination is impossible. They erred, the matter is not so. After this, the topic of Addition of the Trustworthy relates to several issues: • First Issue: The image of the issue is that the hadith is one, and trusted narrators narrate it in one way, then a trustworthy narrator shares with them and narrates it in another way, either stopped (Mawquf) or elevated (Marfu'), or by mentioning an addition. So the topic of Addition of the Trustworthy requires that the hadith be one, and that the trustworthy narrator shares with the rest of the trustworthy narrators and is unique in something. In other words: That the exit (Makhraj) of the hadith be one. Meaning the source must be unified. Ibn Rajab mentioned this in Sharh (Al-Ilal), Ibn Abd al-Hadi in his book (Al-Sarim Al-Munki), Muslim in his book (Al-Tamyiz), and Ibn Hajar in (Al-Nukat). So the exit of the hadith must be one.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 32
  },
  {
    "serial_number": "3338991",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "- Second Issue: The addition of Companions over one another is not included in the topic of Addition of the Trustworthy, rather it is accepted. Ibn Hajar mentioned this in his book (Al-Isabah) and Ibn Abd al-Hadi pointed to it in his book (Al-Sarim Al-Munki). • Third Issue: Addition of the Trustworthy is only discussed if the narrator adds an addition upon which a ruling is based, i.e., it has meaning and judgment. As for explanatory addition or other things upon which no ruling is based, they are not included in the topic of Addition of the Trustworthy. Muslim pointed to this in his book (Al-Tamyiz) and Al-Mu'allimi mentioned it in Al-Fawa'id Al-Majmu'ah. This is confirmed by the fact that the majority of scholars allow narrating hadith by meaning. This indicates that the topic of Addition of the Trustworthy is what a ruling is based upon. But if two narrators narrate one hadith with different wordings and no ruling is based on it, it is from narration by meaning and is not discussed as Addition of the Trustworthy. • Fourth Issue: The Imams of this art and its knights do not have a consistent rule in Addition of the Trustworthy. Sometimes they accept it and sometimes they reject it, and they refer that to indicators (Qara'in). A large group of people of knowledge mentioned this, like Ibn Daqiq al-Eid, Al-Ala'i, Al-Biqa'i, Ibn Hajar, Ibn Rajab, and others. They stated that they do not have a consistent method, but rather look at indicators. Therefore, whoever attributes to the people of Hadith that they accept Addition of the Trustworthy absolutely has erred, or whoever attributes to them that they reject it absolutely has erred. Rather, they look into every hadith for its indicator. There are indicators indicating acceptance or indicators indicating rejection, so indicators are looked at. • Fifth Issue: The default in a single hadith - even if its wordings differ - is lack of multiplicity. Ibn Hajar mentioned this in his book (Fath al-Bari) and this is a valuable benefit. The practice of Muhaddithun indicates this. As for Jurists, they expand and interpret difference in wordings as difference in incidents. From that is Al-Nawawi, for the hadith of Umar in a narration: «I vowed to observe I'tikaf for a night», in a narration: «a day», and in a narration: «a day (24 hours)». Al-Nawawi said: This indicates multiplicity of incidents. Al-Ala'i and Ibn Hajar refuted this and said: The story is one. So the default if the hadith is one is that it does not indicate multiplicity of incidents, but rather the incident is one. Ibn Hajar mentioned this in his explanation of Al-Bukhari - as preceded -, and Ibn Rajab mentioned similar. It is the practice of early scholars, for they make it one hadith then look, if a ruling is based on the addition they are strict. A narrator might say: The Prophet, peace and blessings be upon him, prostrated in one of the two evening prayers ('Isha'), and in some narrations: Asr prayer.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 33
  },
  {
    "serial_number": "3338992",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "This does not entail a ruling, so they are not strict in it. His saying: «I vowed to observe I'tikaf for a night» or «a day» or «a day (24 hours)» does not entail a ruling. But what entails a ruling is what is discussed in the topic of Addition of the Trustworthy. Many Jurists err in such cases from two aspects: o First Aspect: They attribute it to multiplicity of incidents, and it proceeded that this is wrong. o Second Aspect: They deduce rulings from it. In Sahih Muslim: «Whoever performs Wudu on Friday then comes...» and the many wordings: «Whoever performs Ghusl». Some said: This indicates non-obligation of Ghusl, although Ghusl is not obligatory due to other evidences, but this wording is not correct to rely upon because the source is one, and one must prefer between the wording of Ghusl or Wudu. Jurists do not pay attention to such things. Al-Ala'i mentioned this as preceded, and Ibn Daqiq al-Eid, Ibn Taymiyyah, Ibn al-Qayyim, and other scholars criticized Jurists for it. They said: The hadith is one, so preference must be made in it, and a ruling should not be deduced from every hadith, rather preference must be made. This is a precise and important topic. If the hadith is one and some added a wording upon which a ruling is built, strictness is applied and preference is made between wordings, and a ruling is not deduced from this and a ruling from that. Therefore, when Ibn al-Qayyim - may Allah Almighty have mercy on him - mentioned in his book (Al-Hady) the Isra' and Mi'raj and that it was mentioned in more than one hadith, he said: The literalists of Isnad went to multiplicity of incidents, he said: And the incident is one. This is a valuable benefit from Ibn al-Qayyim - may Allah Almighty have mercy on him -. • Sixth Issue: It proceeded that the topic of Addition of the Trustworthy is if the source is one. However, it is found in the speech of knights and Imams of this art that they defect a hadith with another hadith, even if sources differ. For with his wide view and knowledge he knows that the two hadiths are one hadith, so he defects this with that. Disagreement might occur in this among them. Examples of this: Imam Al-Bukhari - may Allah Almighty have mercy on him - defected what Muslim narrated that the Prophet, peace and blessings be upon him, met some people from the Muslims and said: «Who are you?» They said: Muslims. They said: And who are you? He said: «I am the Messenger of Allah» peace and blessings be upon him. A woman lifted a boy to him and said: Is there Hajj for this one? He said: «Yes, and for you is a reward». Narrated by Muslim from the hadith of Ibn Abbas. Al-Bukhari defected it with the saying of Ibn Abbas: \"Any child who performed Hajj then reached puberty must perform Hajj another time.\" He defected it in his book (Al-Tarikh Al-Saghir) and some call it: (Al-Tarikh Al-Awsat) in a discussion he mentioned - may Allah Almighty have mercy on him -. The point of this is that he defected two hadiths whose sources did not agree",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 34
  },
  {
    "serial_number": "3338993",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "This might be done by Imams of Hadith, and this is frequent in the practice of Al-Daraqutni and others. Ibn Rajab - may Allah Almighty have mercy on him - pointed this out in his explanation of (Al-Ilal). This is useful and a valuable topic. Two hadiths might be defected even if they have different sources, but it is not said this is the topic of Addition of the Trustworthy, rather this is defected by that. I mentioned it as a digression so it doesn't get confused with the topic of Addition of the Trustworthy. • Seventh Issue: Uniqueness (Tafarrud) is a defect cared for by early scholars, with which they defected much, and neglected by later scholars. Imam Muslim spoke about Uniqueness in his book (Al-Tamyiz), and Ibn Rajab in Sharh (Al-Ilal) and quoted it from the early Imams, and others from the people of knowledge mentioned it. Uniqueness might share with Addition of the Trustworthy and might be solitary. Meaning: If narrators share in narrating a hadith then one of them is unique with an addition, this is called uniqueness and called Addition of the Trustworthy. But if others did not share with him and he was unique with the entire hadith, this is the topic of Uniqueness. Examples of this - and Allah knows best -: Hadith of Asim bin Kulayb, from his father from Wa'il bin Hujr, regarding the description of the Prophet's prayer, peace and blessings be upon him. Asim bin Kulayb was unique with this hadith, and the likes of him, his uniqueness is not tolerated as clarified by Imam Ali bin al-Madini. Therefore, the one who mentioned this narration the most is Ibn Khuzaymah in his Sahih, and Abu Dawud and others mentioned parts of it. Imam Ali bin al-Madini defected the uniquenesses of Asim bin Kulayb. Uniqueness is a defect that should be scrutinized. Imam Ahmad mentioned that the uniqueness of a trustworthy narrator is treated with strictness, and said: What the great Imams like Al-Thawri and others were unique with might be weakened. Ibn Rajab quoted this in Sharh (Al-Ilal), and Ibn Rajab spoke about this with useful words in Sharh (Al-Ilal). Therefore, if a scholar is unique with a hadith, this hadith should be scrutinized, and whether the likes of him can tolerate uniqueness, and so on... And whether he was unique from a Sheikh whom he accompanied more or not? To other meanings. This is a defect neglected by later scholars to the extreme, and cared for much by early scholars, and it is extremely useful in dealing with hadiths. I mention an example of Addition of the Trustworthy in addition to what preceded: Asim bin Kulayb narrated from his father from his grandfather the description of the Prophet's prayer, peace and blessings be upon him. A group narrated it from Asim including Al-Thawri, Ibn Uyaynah, Shu'bah, and others.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 35
  },
  {
    "serial_number": "3338994",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "A group narrated from Al-Thawri, and Mu'ammal bin Ismail was unique from Al-Thawri, mentioning in it that the Prophet, peace and blessings be upon him, placed his hands on the chest in prayer. Mu'ammal bin Ismail is unique in this. Muhammad bin Yusuf Al-Firyabi, who is among the most trustworthy people in Al-Thawri, and others followed him but did not bring this addition. Then a group followed Al-Thawri including Ibn Uyaynah, Shu'bah, and others and did not bring it. All this indicates that the addition of mentioning placing hands on the chest is Munkar (Denounced) and Shadh (Anomalous) and not authentic; because Mu'ammal bin Ismail contradicted the trustworthy narrators and brought it, in addition to Asim bin Kulayb being solitary with the hadith as established previously. Hence Ibn al-Mundhir said: No hadith is authentic from the Messenger of Allah, peace and blessings be upon him, regarding placing hands on the chest. Imam Ahmad said in Masa'il Abi Dawud: I dislike placing hands on the chest. Another example: The previously mentioned hadith of Wa'il bin Hujr was narrated by a group. Among those who narrated it from Al-Thawri as preceded is Al-Firyabi and others. But the hadith was narrated by a group from Asim bin Kulayb, then from Asim bin Kulayb a group narrated it. Then Abdul Razzaq Al-San'ani was unique from one of them, and brought an addition: \"He said he pointed with his finger then prostrated\". Ibn al-Qayyim in his book (Al-Hady) followed by our Sheikh Ibn Uthaymin - may Allah Almighty have mercy on him - went to say that pointing with the finger between the two prostrations is desirable. This addition is Munkar and Shadh, Abdul Razzaq contradicted people in it. Hence jurisprudentially you do not find scholars mentioning this issue except Ibn al-Qayyim and those who followed him as Allama Al-Albani - may Allah Almighty have mercy on him - clarified. As for Hadith-wise, it is Shadh and Munkar, not acted upon by early scholars. Measure upon this, for there are many examples that should be studied and mastered. This topic, the topic of Addition of the Trustworthy, many issues are built upon it. Among its most important topics are what preceded of issues, and the most important of these issues is knowing the meaning of contradiction and incompatibility according to the early Muhaddithun, not Jurists. His saying: (If contradicted by a more preponderant, the preponderant is Al-Mahfuz (Preserved), and its opposite is Al-Shadh. And with weakness, the preponderant is Al-Ma'ruf (Known), and its opposite is Al-Munkar (Denounced)) Hafiz Ibn Hajar - may Allah Almighty have mercy on him - divided contradiction into two types: • First Type: Contradiction of a trustworthy narrator to one who is more trustworthy than him, either in number or memorization. If a trustworthy narrator contradicts one who is more trustworthy than him either in number or memorization, the narration of the trustworthy one is rejected and called Shadh, and the narration of the trustworthy ones or the more trustworthy is accepted and called Mahfuz. So the rejected is called Shadh, and the accepted is called Mahfuz.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 36
  },
  {
    "serial_number": "3338995",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "- Second Division: The weak contradicts the trustworthy. He made the weak narrator's hadith rejected firstly for his weakness and secondly for his contradiction, naming it Munkar (Denounced), and made the trustworthy's narration accepted, naming it Ma'ruf (Known). It is said: Munkar and its opposite is Ma'ruf. Ibn Qutlubugha mentioned in his explanation of (Nukhbat al-Fikar) that the method of early scholars is contrary to this. He spoke the truth - may Allah Almighty have mercy on him - for the early scholars use Mahfuz more than they use Ma'ruf, but they use Mahfuz in opposition to error. Meaning a weak narrator might contradict other weak narrators, but others are more trustworthy than him so it is said: The path of the more trustworthy is Ma'ruf, even if it is rejected, and it might be said: Mahfuz, even if it is rejected. • Note: Muhaddithun might say: This path is Sahih (correct/sound), not meaning it is established from the Messenger of Allah, peace and blessings be upon him, but rather it is not an error. They might express it saying Mahfuz or Ma'ruf, not intending that it is Sahih and established from the Messenger of Allah, peace and blessings be upon him, but intending it is not an error like the other path. If you flip through books of 'Ilal, you see them saying: And the Mahfuz from So-and-so... And the Sahih from So-and-so. They do not mean it is established, but rather this face is correct and the opposite face is error. Then authenticity and weakness are researched in the correct face. They express the correct face which opposes the error as Ma'ruf, and it is said Mahfuz, and it is said Sahih. Ma'ruf is found in their speech but less used. Therefore, they do not differentiate between the contradiction of a trustworthy to one more trustworthy or the contradiction of a weak to trustworthy ones, contrary to what Hafiz Ibn Hajar mentioned. This is supported by what Abu Dawud narrated from the hadith of Hammam bin Yahya, from Ibn Jurayj, from Al-Zuhri, from Anas, that the Prophet, peace and blessings be upon him, used to remove his ring when entering the toilet. Abu Dawud said: This is a Munkar hadith, Hammam contradicted... etc. Hammam bin Yahya is trustworthy, yet he expressed it saying: Munkar. Therefore, every error is called Munkar, whether from a trustworthy or a weak narrator, i.e., every rejected contradiction according to the method of Muhaddithun is called Munkar, whether from a trustworthy or weak narrator, and whether opposing trustworthy or weak narrators. This benefits us in what will be mentioned in Shawahid (Witnesses) and Mutaba'at (Follow-ups) - God willing -.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 37
  },
  {
    "serial_number": "3338996",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "His saying: (And the Relative Singular: If another agrees with it, it is Al-Mutabi' (Follower), and if a text resembling it is found, it is Al-Shahid (Witness). And tracking the paths for that is Al-I'tibar (Consideration)) Al-Hafiz - may Allah Almighty have mercy on him - mentioned three terminologies: Shahid, Mutabi', and Tatabbu' (Tracking). The meaning of Mutabi': If a narrator narrates a hadith and you find another narrator agreeing with this narrator, it is called Mutabi'. If a narrator narrates a hadith textually and you find another text agreeing with this text, it is called Shahid. So Shawahid are in texts and Mutabi' in narrators. I'tibar is searching for Shawahid and Mutaba'at. His saying: (And the Relative Singular) i.e., Relative Singular unique from an Imam... etc. as preceded. The more correct - and Allah knows best - is to say: Absolute Uniqueness. Any uniqueness for which you find a follower is called: Mutabi', or a text witnessing for it is called Shahid, even if it was absolute uniqueness - i.e., complete - because a scholar might think it is from absolute uniqueness, but after searching finds a follower for it, so it becomes clear it is not absolute uniqueness. Meaning: A Tabi'i might be unique from a Companion in a hadith, so it is thought to be absolute uniqueness, but after searching it becomes clear he has a follower. So this is more inclusive than saying in Relative or Absolute Singular. Al-Hafiz differentiated between Mutabi' and Shahid. In the usage of early scholars, they do not differentiate between these two matters. Their usage is closer to linguistic meaning than terminological meaning, so the matter with them is broad in applying Mutaba'ah and applying Shawahid. Then, among the most important topics of the science of Hadith: Studying when a hadith is strengthened by Shawahid and Mutaba'at, and when it is not strengthened? The basis of this issue is what preceded, that strengthening a hadith by another is indicated by the Book, Consensus, and the practice of Imams of Hadith. Allah Glory be to Him said: {that if one of the two errs, the other can remind her} [Al-Baqarah: 282]. Ibn Taymiyyah used this as evidence as in (Majmu' al-Fatawa). Ibn Taymiyyah narrated consensus as in (Talkhis al-Istighathah) that hadith is strengthened by Shawahid and Mutaba'at. Similarly, Al-Albani in his book (Tahrim Alat al-Lahw wa al-Tarab). As for the practice of Muhaddithun, Imam Ahmad and others from the people of Hadith explicitly stated this, and their words are many in this. Ibn Rajab and others clarified this, that a hadith is strengthened by another. This is theoretically unproblematic. The problem is in application. Strengthening hadith by Shawahid and Mutaba'at relates to issues: • First Issue: That what has severe weakness is not strengthened by Shawahid and Mutaba'at. Ibn al-Salah mentioned this, and others mentioned it. So whoever has severe weakness is not strengthened. Among those who mentioned this",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 38
  },
  {
    "serial_number": "3338997",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "as a foundation is Ibn Hajar in (Al-Nukat). The narration of a liar is not strengthened, and the narration of Shadh as Ibn al-Salah said is not strengthened, and clarification of this will come more - God willing -. Rather, sometimes the multiplicity of paths only increases the hadith in weakness, as Ibn al-Qayyim said in his book (Jala' al-Afham), and Al-Mu'allimi - may Allah Almighty have mercy on him - mentioned in the introduction to (Al-Fawa'id Al-Majmu'ah) that multiplicity of paths might only increase the hadith in weakness. Then he mentioned that later scholars became lenient in strengthening hadith by multiplicity of paths. Similar to this was mentioned by Ahmad Shakir in his book (Al-Ba'ith Al-Hathith). Even Al-Suyuti - who is among the lenient later scholars as Al-Albani says - stated that the narration of a liar is strengthened if paths multiply, as in (Tadrib al-Rawi), and this is a mistake, and contrary to the method of early scholars. • Second Issue: The hadith intended to be strengthened by multiplicity of paths, if it contradicts what is stronger than it, is not strengthened. Al-Bayhaqi mentioned this as quoted by Al-Sakhawi in his book (Fath al-Mughith). So multiplicity of paths if contradicting what is stronger is not strengthened. • Third Issue: Multiplicity of paths if contradicting the Fatwas of Companions is not strengthened. Imam Ahmad pointed to this regarding Wudu with leftover water of a woman. This might be branched from the previous or be an independent issue. If Companions give Fatwas, then a hadith comes intended to be strengthened by paths and its result contradicts Fatwas of Companions, it is not strengthened, because Fatwas of Companions are authority. • Fourth Issue: Imam Ahmad said: Munkar is Munkar forever. This is among the precious and precise points in strengthening hadith by sum of paths. Every hadith where it becomes clear that the narrator erred in it, being a trustworthy contradicting one more trustworthy in memory or number, or weak contradicting one more trustworthy; it falls and is not strengthened because it is an illusion (Wahm). I cannot count the number of practices by many later scholars where they do not pay attention to such things. A narrator might contradict trustworthy narrators, then they bring this addition which is an error and strengthen another hadith with it. This is not correct; because Munkar is Munkar forever as Imam Ahmad said. Hence Ibn al-Salah said: Among what is not strengthened is Shadh, because Shadh is error as preceded. • Fifth Issue: Consideration for strengthening hadith by another hadith... etc., has no consistent criterion, as clarified by Ibn al-Salah, and he said in his book (Ma'rifat Ulum al-Hadith) which is the famous Muqaddimah of Ibn al-Salah, he said: It is only known by much practice. Indicators might sometimes indicate lack of strengthening, so it is not strengthened.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 39
  },
  {
    "serial_number": "3338998",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "Examples of this: «There is no Wudu for him who does not mention the name of Allah upon it». Ahmad said: No hadith is established in it. If this hadith came with a sum of paths, and if these hadiths were established, it would indicate that Tasmiyah (saying Bismillah) is a condition. This is refuted by the fact that Uthman bin Affan in the two Sahihs, Abdullah bin Zaid bin Asim in the two Sahihs, and Ibn Abbas in Al-Bukhari, narrated the description of the Prophet's Wudu, peace be upon him, in detail, especially Uthman, and did not mention saying: \"Bismillah\". This indicates that these paths do not strengthen each other. If they were authentic, they would indicate that saying \"Bismillah\" is a condition. How can it be a condition when these and others did not mention it? While they mentioned the description of the Prophet's Wudu, peace be upon him, in detail? Therefore, indicators must be looked into when strengthening a hadith by sum of paths. This is only obtained by much practice as clarified by Ibn al-Salah - may Allah Almighty have mercy on him -. Ibn Hajar - may Allah Almighty have mercy on him - mentioned in the explanation that Mutaba'ah (Follow-up) might be deficient (Qasirah) and might be complete (Tammah). Meaning: The narrator who brought a ruling, after consideration another narrator is found following him, it is said: Complete follow-up. But if another narrator is found following his Sheikh and not following him, it is said: Deficient follow-up.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 40
  },
  {
    "serial_number": "3338999",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "Hafiz Ibn Hajar - may Allah Almighty have mercy on him - said: Then the Accepted: If free from contradiction, it is Al-Muhkam (Decisive). If contradicted by its like: If combination is possible, it is Mukhtalif al-Hadith (Different Hadith). If the later one is established, it is Al-Nasikh (Abrogator), and the other Al-Mansukh (Abrogated). Otherwise, preference (Tarjih), then stopping (Tawaqquf). Then the Rejected: Either it is due to omission (Saqt) or impugnment (Ta'n): So Omission: Either it is from the beginnings of the chain from a compiler, or from its end after the Tabi'i, or other than that. So the first is: Al-Mu'allaq (Suspended). And the second is: Al-Mursal (Hurried). And the third: If it is by two upwards consecutively, it is Al-Mu'dal (Perplexing). Otherwise, Al-Munqati' (Broken). Then it may be clear or hidden. So the first: Is perceived by lack of meeting, hence the need for history. And the second: Al-Mudallas (Obfuscated) and comes with a format presuming meeting: like 'An (From), and Qala (Said). And likewise Al-Mursal Al-Khafi (Hidden Mursal) from a contemporary who did not meet. His saying: (Then the Accepted: If free from contradiction, it is Al-Muhkam. If contradicted by its like: If combination is possible, it is Mukhtalif al-Hadith. If the later one is established, it is Al-Nasikh, and the other Al-Mansukh. Otherwise, preference, then stopping) It appears to me - and Allah knows best - that it is not correct to discuss this in the science of Hadith, because it relates to Dirayah (comprehension), and Hadith Terminology relates to Riwayah (narration). So such should not be discussed in books of Hadith Terminology but in books of Usul al-Fiqh (Principles of Jurisprudence). The other matter: Ibn Hajar - may Allah Almighty have mercy on him - made Mukhtalif al-Hadith (Different Hadith) applicable if combining is not possible. This implies if combining is possible, the topic of Mukhtalif al-Hadith is not discussed. This has a view [reservation]. Ibn al-Salah disagreed with him and clarified that Mukhtalif al-Hadith includes what can be combined and what cannot be combined. This is evidenced by the practice of Imam Al-Shafi'i in Mukhtalif al-Hadith, Ibn Qutaybah in his book (Ta'wil Mukhtalif al-Hadith), Al-Tahawi in (Sharh Mushkil al-Hadith) etc. The practice of scholars indicates that they included in books of Mukhtalif al-Hadith what can be combined and what cannot be combined, whereas Al-Hafiz's apparent practice restricted it to what can be combined.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 41
  },
  {
    "serial_number": "3339000",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "His saying: (Then the Rejected: Either it is due to omission or impugnment) The author - may Allah Almighty have mercy on him - finished with the Accepted and moved to the Rejected. He clarified that rejection is due to either omission or impugnment, i.e., returns to two matters, either omission or impugnment. It might be said - and Allah knows best -: Rejection returns to three matters: • First Matter: Omission, i.e., Interruption. • Second Matter: Impugnment, i.e., Weakness in the narrator. • Third Matter: Contradiction, for a trustworthy narrator's hadith might be rejected even if he is not impugned due to contradiction. Al-Hafiz mentioned contradiction but included it in impugnment. The matter is easy in this. If three causes were stated, it would be more correct - and Allah knows best - because contradiction might be from a trustworthy narrator whose memorization is not impugned. His saying: (So Omission: Either it is from the beginnings of the chain from a compiler, or from its end after the Tabi'i, or other than that. So the first is: Al-Mu'allaq. And the second is: Al-Mursal. And the third: If it is by two upwards consecutively, it is Al-Mu'dal. Otherwise, Al-Munqati') Al-Hafiz - may Allah Almighty have mercy on him - mentioned that Omission - i.e., Interruption - has cases. The first case is to be from the compiler's Sheikh and is called Mu'allaq. So the compiler like Al-Bukhari, Abu Dawud, Muslim, or others, if he narrates a hadith and does not mention his Sheikh but mentions his Sheikh's Sheikh, or Sheikh of his Sheikh's Sheikh, but did not mention his Sheikh, here the interruption is from the beginnings of the chain from the compiler, so it is called Mu'allaq. Interruption might be from the end of the chain, i.e., before the Prophet, peace and blessings be upon him, i.e., from the Companion by the Tabi'i narrating it from the Companion, so it is called Mursal. Interruption might be in any side of the chain other than the beginnings and ends, and is called Munqati'. Interruption might be due to interrupting two consecutively, so it is called Mu'dal. This is a summary of what Al-Hafiz presented. To approximate that with numbers: Suppose the compiler's Sheikh is number one, narrating from number two from number three from number four from number five who is the Companion, from the Prophet, peace and blessings be upon him.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 42
  },
  {
    "serial_number": "3339001",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "If assumed he dropped number one, it is called Mu'allaq. If he dropped number five the Companion and the Tabi'i narrated from the Prophet, peace and blessings be upon him, it is called Mursal. If he dropped in the middle of the chain like number three only, it is called Munqati'. If he dropped two consecutively, i.e., number two and number three, it is called Mu'dal. He might drop number one and two and it is called Mu'allaq. He might drop number one, two, and three and it is called Mu'allaq, because the compiler's Sheikh dropped. And because there are two drops it is called Mu'dal, so it is said Mu'allaq and Mu'dal. He might drop the entire chain and say: The Prophet, peace and blessings be upon him, said. It is said: Mu'allaq he dropped his Sheikh, and said Mursal he dropped the Companion, and said Mu'dal. Measure upon this. This is what Al-Hafiz - may Allah Almighty have mercy on him - established and it is famous among Terminology scholars. After this we return to the text and take some issues related to it. His saying: (Then the Rejected: Either it is due to omission or impugnment) Omission: Interruption. Impugnment: Weakness. Discussion on it will come. Omission - i.e., Interruption - is weak according to people of knowledge because the intermediary is unknown as Ibn Abd al-Barr said in the beginning of his book (Al-Tamhid) when he spoke about Mursal. He said: And it is weak according to people of knowledge because the intermediary is unknown and not known. Hadiths of the Prophet, peace and blessings be upon him, are treated with caution fearing that the intermediary is weak. This is the reason for scholars rejecting Interruption. When Imam Muslim mentioned the Mursal hadith - which has interruption by the Tabi'i dropping the Companion - he mentioned that scholars of Hadith reject it, as mentioned in the introduction to Sahih Muslim. The reason is ignorance as preceded, because it is not known who was dropped. So the default in Interruption is rejection. But an indicator might indicate acceptance of Interruption even if the default is rejection. The indicator might be Isnad-related or Text-related. As for Text-related indicator, Al-Bukhari narrated from the hadith of Hanzalah bin Abi Sufyan from Salim bin Abdullah bin Umar, that the Prophet, peace and blessings be upon him, supplicated against Suhayl bin Amr and Al-Harith bin Hisham. In this narration he named those supplicated against. The connected narration in Al-Bukhari from Ibn Umar did not name those supplicated against. This narration is Mursal; because it is from the narration of Hanzalah bin Abi Sufyan, from Salim bin Abdullah bin Umar, from the Prophet, peace and blessings be upon him.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 43
  },
  {
    "serial_number": "3339002",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "Yet Al-Bukhari was lenient and included this Mursal narration, because no ruling is based on it. The connected narration in the two Sahihs says he supplicates against so-and-so and so-and-so and did not name them. In this narration he named them. This does not entail a ruling. The verse was revealed: {Not for you is the decision} [Al Imran: 128] to the end of the hadith. Among Text-related indicators: What Malik narrated in Al-Muwatta and Abu Dawud and others from Abu Umamah bin Sahl bin Hunaif, from the Prophet, peace and blessings be upon him, that a man struck his father with an evil eye (Nabat Abahu). The hadith is Mursal, because Abu Umamah bin Sahl is a Tabi'i and did not meet the Prophet, peace and blessings be upon him - so he did not witness the story, yet Malik included it in Al-Muwatta. The default in what Malik includes in Al-Muwatta is that it is proof, and this hadith likewise. The reason for leniency in it is that this story relates to his family, so such becomes famous among his family, so they were lenient in it. This is another Text-related indicator. As for Isnad-related indicator, it is the narration of Abu Ubaidah bin Abdullah bin Masoud from his father. The narration of Abu Ubaidah bin Abdullah bin Masoud from his father is a disconnected narration, for Abu Ubaidah did not meet his father Abdullah bin Masoud. Ali bin al-Madini, Al-Nasa'i, Al-Tirmidhi, and other people of knowledge stated the disconnection. Yet, they agreed on accepting it. Yaqub bin Shaybah narrated the consensus, saying: People of knowledge studied it and saw it as upright. Ibn Taymiyyah mentioned similar as in (Majmu' al-Fatawa), and Ibn Rajab established this in Sharh (Al-Ilal). The reason for their accepting it is that they saw his narration as upright. This is supported by the fact that it is a son's narration from his father, so they were lenient in this indicator. Therefore, scholars accept the narration of Abu Ubaidah from his father, even if they declare the disconnection. This is an Isnad-related indicator. Among the hadiths narrated from this path: What Al-Tirmidhi, Al-Nasa'i, and Abu Dawud narrated from the hadith of Abu Ubaidah bin Abdullah bin Masoud, from his father, that the Prophet, peace and blessings be upon him, when he sat in the first Tashahhud, it was as if he was sitting on heated stones (Radf) - meaning out of haste - then he would stand up. Radf: Stone heated by fire. This indicates hastening in the first Tashahhud and not prolonging it. Al-Tirmidhi said after narrating it: And the practice is on this according to the people of knowledge. Ibn Rajab said: Al-Tirmidhi's saying: And the practice is on this according to the people of knowledge, indicates consensus on the issue. He mentioned this in another issue in his explanation of Al-Bukhari.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 44
  },
  {
    "serial_number": "3339003",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "Therefore, the people of knowledge are for not prolonging the first Tashahhud, unlike the second Tashahhud. The point is that this is an Isnad-related indicator they were lenient with, otherwise the default is not to accept. This is an important topic. The people of Hadith look at indicators and care for that. Among the words of the great reviver Allama Muhammad Nasir al-Din al-Albani - may Allah Almighty have mercy on him - is that he said: The science of Hadith is not (one plus one equals two), but rather indicators are looked at in it. His saying: (Al-Mu'allaq) Among those famous for suspending hadiths is Abu Dawud in his Sunan and more than that. Among those famous for suspending as well is Imam Al-Bukhari, and he has a method. He suspends the hadith, he and others, but the speech of people of knowledge became famous regarding Al-Bukhari and they singled out discussion on him due to their care and study of him. They said: Al-Bukhari's Mu'allaqat are two types: • First Type: With a formula of uncertainty (Tamrid), like Al-Bukhari saying: It is mentioned (Yudhkar) from the Prophet, peace and blessings be upon him, or: It is mentioned from Ibn Abbas. • Second Type: With a formula of certainty (Jazm), he might say: The Prophet, peace and blessings be upon him, said. Silah said. Ammar said... etc. As for what he asserted with certainty, it is authentic to the one he asserted it from. If he said: Silah said, Ammar said. Then it is authentic to Silah. As for what is after Silah, you look at the chain. If he asserted it from the Prophet, peace and blessings be upon him, it is authentic from the Prophet, peace and blessings be upon him. But if Al-Bukhari suspended it saying: It is mentioned... etc., Ibn Hajar said in (Al-Nukat): If it is a hadith from the Prophet, peace and blessings be upon him, and he cited it as evidence, it is either Sahih, Hasan, or Weak strengthened by others. As for Imam Muslim's Mu'allaqat, they are few, and he connected all of them except one hadith, which is the hadith of Abu Jahm, which contains removing the patterned curtain. Otherwise, all his suspended hadiths he connected - may Allah Almighty have mercy on him -. Also among those famous for suspension is Abu Dawud as preceded. His saying: (And the second is: Al-Mursal) Mursal according to the method of people of Hadith is rejected as preceded in the words of Imam Muslim in the introduction to his Sahih, and indicated by the words of others. This is looking at the chain as narration (Riwayah), it is rejected, because the intermediary is unknown as preceded in Ibn Abd al-Barr's words. As for comprehension (Dirayah), they accept Mursal considering other matters, considering Shawahid and Mutaba'at, and considering that it did not bring a new ruling so leniency is applied... etc., as clarified by Al-Nawawi - may Allah Almighty have mercy on him - in his explanation of",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 45
  },
  {
    "serial_number": "3339004",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "Muslim, and Ibn Rajab in Sharh (Al-Ilal) who said: Ibn Jarir said: Rejecting Mursal is an innovation that happened after the two hundreds. His intent: rejecting it from the aspect of Dirayah and argumentation, not from the aspect of Riwayah. As for Dirayah and argumentation, it is not rejected absolutely, rather it is looked into as Al-Shafi'i clarified in his book (Al-Risalah), and Ibn Abd al-Hadi explained this in his book (Al-Sarim Al-Munki), and Ibn Rajab in Sharh (Al-Ilal). So, considering Riwayah it is rejected. Considering Dirayah it is not rejected absolutely, but the type of Mursal is looked at, and whether it has Shawahid or not, and whether it brought a new ruling or not? ... etc. Then it should be known that Mursals of Companions are accepted by consensus as clarified by Ibn Hajar and others, except that they do not accept Mursals of young Companions, i.e., those who saw the Prophet, peace and blessings be upon him, and were young and did not narrate from him, like Tariq bin Shihab and his like. Hafiz Ibn Hajar stated this in his book (Al-Isabah) and book (Al-Nukat). So scholars' saying that Mursals of Companions are accepted: means those fit for bearing (Tahammul). As for those not fit for bearing due to young age, their Mursals are not accepted. This should be detailed so it is not thought that their saying Mursals of Companions are accepted includes even those not fit for bearing, like Tariq bin Shihab and his like. His saying: (If it is by two upwards consecutively, it is Al-Mu'dal. Otherwise, Al-Munqati') The practice of past scholars is that they apply Mursal to any interruption, whether on Mu'allaq, on Munqati' in the sense of Terminology scholars, and on Mursal in their sense. So any interruption they call Mursal, as indicated by Ibn Abi Hatim's book on Marasil, and Abu Dawud's book on Marasil. A group of people of knowledge mentioned this like Al-Sakhawi and others, that they apply Mursal to any interruption, and do not restrict it to interruption by dropping the Companion and narration of Tabi'i as preceded. Similarly, Munqati' (Interruption) is applied to any interruption even if consecutive. Their saying: Mu'dal, is applied to interruption of two consecutively, and they also apply Mu'dal to what is difficult (Mu'dal) in understanding from the aspect of text. His saying: (Then it may be clear or hidden. So the first: Is perceived by lack of meeting, hence the need for history. And the second: Al-Mudallas and comes with a format presuming meeting: like 'An, and Qala, And likewise Al-Mursal Al-Khafi",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 46
  },
  {
    "serial_number": "3339005",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "from a contemporary who did not meet) These are precise topics. His saying: (may be clear or hidden. So the first: Is perceived by lack of meeting) like a Tabi'i narrating from the Prophet, peace and blessings be upon him, like Abu Al-Aliyah, Ata, Al-Hasan, or others. It is known by history through lack of meeting, that this is Mursal. His saying: (hence the need for history) by looking at the date of birth of this one and date of death of this one, and so on for those below that from one narrator narrating from another narrator, and measure upon this. So the first which is clear is perceived by lack of meeting, and this is known to Muhaddithun, unlike others. His saying: (And the second...) i.e., the hidden. Hidden applies to two types: Mudallas (Obfuscated), and Mursal Khafi (Hidden Mursal). The difference between Mudallas and Mursal Khafi: according to what Al-Hafiz - may Allah Almighty have mercy on him - established is that the Mudallas has narrated from his Sheikh hadiths he heard and gave the impression he is narrating from him other hadiths he did not hear, and came with a format not explicit in updating (Tahdith). As Imam Muslim narrated from the hadith of Al-A'mash from Abu Salih from Abu Huraira: «No people gathered in a house of the houses of Allah...» Hadith. Al-Tirmidhi said: Al-A'mash said: I was told (Huddithtu) from Abu Salih. This indicates that Al-A'mash did not hear it from Abu Salih. In Sahih Muslim he said: \"From\" ('An) and did not come with an explicit formula in hearing. Al-A'mash heard hadiths from Abu Salih, but this hadith he did not hear, so he is called Mudallis. So, the Mudallis heard hadiths from his Sheikh and gave the impression he heard other hadiths he did not hear, provided the formula is not explicit in hearing, because if it was explicit in hearing and he did not hear it, he would be a liar. Mursal Khafi is one who narrates from a narrator he realized and was contemporary with, but did not hear from him, so he narrated from him with a formula presuming hearing and not explicit. So the difference between Mursal Khafi and Mudallis: That Mudallis heard hadiths and gave impression he heard other hadiths he did not hear. As for the one sending Hidden Mursal, he did not hear anything but could have heard, and both came with a formula presuming hearing and not explicit. His saying: (... from a contemporary who did not meet) i.e., it is possible for him to meet. Notice his saying: (like 'An, and Qala) because they are not explicit in hearing. This is the difference between Mudallis and Mursal via Hidden Transmission, or Mudallas and Mursal via Hidden Transmission. This is according to Al-Hafiz's method. Al-Bazzar and Ibn al-Qattan al-Fasi preceded him in that. Al-Iraqi said in (Al-Taqyid wa al-Idah): The method of Muhaddithun is contrary to the practice of Al-Bazzar",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 47
  },
  {
    "serial_number": "3339006",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "and Ibn al-Qattan al-Fasi, which is that they apply Mudallis to the one sending Hidden Mursal. The comprehensive term for it is the linguistic meaning which is Tadlis (Obfuscation), that there is obfuscation in it. This is what is benefited from the words of Al-Khatib in his book (Al-Kifayah) and Ibn al-Salah in his introduction. What appears - and Allah knows best - is that scholars describe the one sending Hidden Mursal as Mudallis, but they might not describe him and might describe him. The comprehensive term is Tadlis, and it includes Hidden Sending and known Tadlis. Important issues arise in Tadlis: • First Issue: Ruling of Tadlis. Its ruling fundamentally is permissible, because it is not explicit in lying but rather it is equivocation (Tawriyah), although it is better not to do it. But fundamentally it is permissible, because it is not lying, and it is a usage that spread among Muhaddithun, so it is permissible. This is common among people of knowledge, contrary to those who were strict in it out of piety or saw its prohibition. • Second Issue: Tadlis generally is two types: o First Type: Tadlis of Sheikhs, and Tadlis of Isnad. Intended by Tadlis of Sheikhs: He narrates from his Sheikh with different names, titles, and Kunyas giving the impression he is more than one Sheikh while he is one Sheikh. It has motives and reasons. o Second Type: Tadlis of Isnad. It is to give the impression of hearing from this Sheikh while he did not hear from him, as preceded in Al-A'mash's saying: I was told from Abu Salih, and in Sahih Muslim: From Abu Salih. Most research in books of Hadith and Terminology is Tadlis of Isnad, because authenticity and weakness are built upon it. They research Tadlis of Sheikhs to distinguish the narrator, but the frequent research is Tadlis in Isnad. • Third Issue: Not every Mudallis narration is rejected if he does not come with an explicit wording in hearing. Rather, the narration of one whose Tadlis is frequent and dominant in his hadith relative to his narrations is rejected. He might be prolific in narration like Abu Ishaq, and might do much Tadlis but it is little relative to his narrations. Similar is Al-A'mash, his Tadlis is much but little relative to his narrations. Ali bin al-Madini mentioned this, saying: The narration of the Mudallis is rejected if he does it frequently. Al-Khatib Al-Baghdadi narrated it from him, and Ibn Hajar quoted it in (Al-Nukat).",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 48
  },
  {
    "serial_number": "3339007",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "Abu Hatim said in (Al-Ilal) when he mentioned Al-A'mash's narration from Mujahid: I fear he did not hear it from him, because he has few narrations from him. Note he looked at scarcity and abundance, but here scarcity not in all his narrations but in his narration from this specific person. So if a narrator does Tadlis, his hadith is not rejected absolutely. Rather it is rejected if his Tadlis is frequent relative to his narrations, so if he narrates a hadith possible of hearing it is rejected. Yaqub Al-Fasawi mentioned that the narration of Al-A'mash, Abu Ishaq Al-Sabi'i, and Al-Thawri is authentic, and that is - and Allah knows best - because their Tadlis is little relative to their narrations. If you say: How do I distinguish who had little Tadlis relative to his narration or much? It is said: By matters. Sometimes scholars themselves state it. If they state it, it is rejected as Ahmad stated regarding Ibn Jurayj, and as others stated regarding Muhammad bin Ishaq the author of Siyar and Maghazi, and measure upon this. They state that if he comes with a formula not explicit in hearing, it is not accepted. Sometimes this is known by looking at the practice of the authors of the two Sahihs, Al-Bukhari and Muslim. Often if they narrate frequently from a narrator described with Tadlis with a wording not explicit in hearing, and it becomes clear by research or scholars' text that he did not state hearing in other places, it indicates that his Tadlis is little relative to his narrations. Al-Subki asked Al-Mizzi about Mudallisin in the two Sahihs and that they used 'An'an (said 'From'), did they hear from them in another place? Al-Mizzi said: Their hearing from him was not established in another place, but this is said out of good opinion of the two Sahihs. Ibn Hajar quoted this in (Al-Nukat). So if the authors of Sahih, Al-Bukhari and Muslim, narrate a hadith by narration of a Mudallis with 'An'an and his declaration of hearing is not known in another place, this is an indication that his Tadlis is little relative to his narrations. Thus other indicators are researched. Among what became famous with later scholars is that they reject the narration of Abu Ishaq Al-Sabi'i if he uses 'An'an, and Al-A'mash if he uses 'An'an. This has a view [reservation]. The default is that the narration of Abu Ishaq Al-Sabi'i is accepted as Yaqub Al-Fasawi mentioned, and as is the practice of Al-Bukhari and Muslim in their Sahihs. Similarly Al-A'mash's narration is accepted, except regarding whom he narrates little from like Mujahid, as stated by Abu Hatim in Al-Ilal, and measure upon this. • Note: It might be established with a Hadith scholar that So-and-so did Tadlis, yet he accepts his hadith, due to external indicators as preceded that they accept the narration of the interrupted (Munqati') for external indicators. Like the hadith of Al-A'mash from Abu Salih from Abu Huraira: «No people sat in a house of the houses of",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 49
  },
  {
    "serial_number": "3339008",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "Allah...», Muslim was lenient in it and extracted it in his Sahih, because it has witnesses, established from Abu Sa'id in Sahih Muslim. Then if you contemplate its meaning, you won't find it bringing a new ruling, so Imam Muslim - may Allah Almighty have mercy on him - was lenient in it. It preceded that they are lenient in Interruption for a Text-related indicator or Isnad-related indicator. • Fourth Issue: If the narrator is known and famous for frequent Tadlis, his hadith is not accepted until he states hearing. Imam Muslim stated this in his book (Al-Tamyiz), Imam Ahmad - may Allah Almighty have mercy on him - mentioned this in the narration of Ibn Jurayj, and others mentioned it regarding other narrators, like Ibn Adi in his book (Al-Kamil). So if the Mudallis is famous and frequent in Tadlis relative to his narrations, he is not accepted until he states hearing. I saw some contemporaries falling into innovation saying: The narration of the Mudallis is accepted whether he did it frequently or not even if he narrated with a formula not explicit in hearing, claiming that the early Salaf were on that. He erred and fell into a major innovation upon which many errors are built. The words of Imam Ahmad and Muslim in (Al-Tamyiz) and other people of knowledge preceded. So one must differentiate between who frequented Tadlis relative to his narrations and who did not frequent as detailed previously. His saying: (And likewise Al-Mursal Al-Khafi from a contemporary who did not meet) The author - may Allah Almighty have mercy on him - will speak about stipulating hearing and meeting... etc. But Mursal via Hidden Transmission which is sending from whom he did not hear and could have heard from but did not hear from with a formula bearing hearing, this is called Hidden Mursal, and is called Tadlis as preceded. Attention should be paid to an important matter: when studying hadiths, it is not sufficient to look at the narrator's trustworthiness. Rather, if the formula is not explicit in hearing, one must refer to books of hearing (Sama'). Scholars' words on So-and-so not hearing from So-and-so have been singled out in compilations and mentioned in books of biographies, as mentioned by Al-Mizzi in (Tahdhib al-Kamal) and Ibn Hajar in (Tahdhib al-Tahdhib). Bashar Awad mentioned it in his footnote on (Tahdhib al-Kamal) and mentioned many benefits from Mughultay and others. Al-Ala'i singled out a useful book on that which he named: (Jami' al-Tahsil), and Al-Iraqi also wrote a book titled: (Tuhfat al-Tahsil), including what Al-Ala'i mentioned and adding to it.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 50
  },
  {
    "serial_number": "3339009",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "Among the useful books in this is a new printed version of Tuhfat al-Tahsil, its verifier mentioned in the footnote many benefits related to hearing and lack thereof. Also Taqrib al-Tahdhib was printed by Hassan Abdul Mannan, and he mentioned Al-Hafiz's words and added to that by mentioning hearings and lack thereof. This is extremely useful, apart from the person of Hassan Abdul Mannan and his badness and Al-Albani speaking against him - may Allah Almighty have mercy on him - but his transmission and attribution concern me. Also among what is useful are the books of Allama Muqbil Al-Wadi'i, for he is interested in this. Among them: (Ahadith Mu'allah Zahiruha Al-Sihhah). This is an extremely valuable book, mentioning precise defects, including hearings and others. To other books. So care should be given to hearing and lack thereof. How many hadiths were authenticated and it was proven that the narrator did not hear from his Sheikh, sometimes proven he did not hear from him in the hadith itself and sometimes did not hear from him at all. Examples of this: What Abu Dawud narrated from the hadith of Khalid Al-Hadhdha from Abu Al-Aliyah, from Aisha, may Allah be pleased with her, that the Prophet, peace and blessings be upon him, said in Sujud Al-Tilawah: «My face prostrated to the One who created it, and split its hearing and sight...» Hadith. Abu Dawud mentioned that Khalid Al-Hadhdha narrates it from a man from Abu Al-Aliyah. This indicates that Khalid Al-Hadhdha did not hear it. Ibn al-Salah in his introduction, and Ibn Rajab in Sharh (Al-Ilal) benefited that the early scholars deduce the narrator's lack of hearing from the narrator by the fact that in places he introduces a man between them and sometimes two men, so they deduce by this that he did not hear from him. Therefore, care should be given to such and it should be scrutinized. I saw some wanting to strengthen Aisha's hadith in Sujud Al-Tilawah: «My face prostrated to the One who created it and split its hearing and sight...» with what is in Muslim from the hadith of Ali that the Prophet, peace and blessings be upon him, used to say in his prostration: «My face prostrated to the One who created it, and split its hearing and sight...». It is said: It is not correct for this to be a witness for that, because this is in all prostrations, and the research is in Sujud Al-Tilawah. So it is not correct for this to be a witness for that. This is from the leniency of later scholars in Shawahid. An example of their leniency in Shawahid in what we are dealing with: Abu Dawud narrated that the Prophet, peace and blessings be upon him, used to say between the Yemeni Corner and the Black Stone: «Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire». In its chain is an unknown narrator and it is not authentic. I saw some authenticated it because it was established from Umar that he used to say that in the entire Tawaf. It is said: There is a difference between Tawaf",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 51
  },
  {
    "serial_number": "3339010",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "as a whole and saying it is desirable between the two corners. Such is not correct to be a witness for it. These issues need precision and knowledge.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 52
  },
  {
    "serial_number": "3339011",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "Hafiz Ibn Hajar - may Allah Almighty have mercy on him - said: Then the Impugnment: Either it is due to the lying of the narrator, or accusing him of that, or grossness of his mistake, or his heedlessness, or his Fisq (sinfulness), or his Wahm (illusion), or his contradiction, or his ignorance, or his innovation, or badness of his memory. So the first is: Al-Mawdu' (Fabricated). And the second is: Al-Matruk (Abandoned). And the third is: Al-Munkar (Denounced) according to an opinion. And likewise the fourth and fifth. Then Wahm (Illusion): If discovered through indicators and gathering paths: It is Al-Mu'allal (Defective). Then Contradiction: If it is by changing the context: It is Mudraj al-Isnad (Interpolated in Chain), or by merging a Mawquf with a Marfu': It is Mudraj al-Matn (Interpolated in Text), or by advancing or delaying: It is Al-Maqlub (Inverted), or by adding a narrator: It is Al-Mazid fi Muttasil al-Asanid (Addition in Connected Chains), or by substituting him and there is no preponderant: It is Al-Mudtarib (Disturbed). Substitution may occur intentionally for testing. Or by changing with the context remaining: It is Al-Musahhaf (Misspelled) and Al-Muharraf (Distorted). It is not permissible to intentionally change the text by reduction and synonym except for a scholar of what alters meanings. If the meaning is hidden, explanation of Gharib (Strange words) and clarification of Mushkil (Problematic) is needed. Then Ignorance: Its cause is that the narrator may have many descriptions so he is mentioned by other than what he is famous for, for a purpose. They authored Al-Muwaddih concerning it. Or he may be scarce [in narration] so taking from him is not frequent. They authored Al-Wuhdan concerning it. Or he is not named for brevity. In it is Al-Mubhamat (Vague ones). The Mubham is not accepted even if vaguely described with modification wording according to the most correct view. If named and only one narrated from him: He is Majhul al-Ayn (Unknown in Person). Or two upwards and he was not authenticated: He is Majhul al-Hal (Unknown in Condition), which is Al-Mastur (Covered). Then Innovation: Either with [belief] causing disbelief, or causing Fisq. So the first: The majority do not accept its holder. And the second: Accepted is he who was not a caller [to it] according to the most correct view, unless he narrates what strengthens his innovation, then he is rejected according to the chosen view, and Al-Juzajani, Sheikh of Al-Nasa'i, stated this explicitly.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 53
  },
  {
    "serial_number": "3339012",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Continuing the Look at Refining 'Nukhbat al-Fikar'",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "Then Bad Memory: If it is permanent, it is Al-Shadh according to an opinion. Or emergent, it is Al-Mukhtalit (Mixed). Whenever the one with bad memory is followed up by a considered [narrator], and likewise the Mastur, the Mursal, and the Mudallas: Their hadith becomes Hasan not by itself, but by the sum. His saying: (Then the Impugnment: Either it is due to the lying of the narrator) This is clear, meaning the narrator lies about the Messenger of Allah, peace and blessings be upon him. If the narrator lies against the Prophet, peace and blessings be upon him, his hadith is not authentic but fabricated as will be explained. His saying: (or accusing him of that) Known by two things: That he is unique in narrating a hadith contradicting the rules of Islam, or being known for lying in people's speech. If he is known for his lying in people's speech, his hadith is not accepted. His saying: (or grossness of his mistake) Meaning abundance of his mistake. His saying: (or his heedlessness) Meaning being heedless, not mastering when narrating hadiths. His saying: (or his Fisq) Meaning being Fasiq. Fasiq according to Ahlus-Sunnah is the committer of a major sin who did not repent from it, as explained by Al-Saffarini in his poem, and indicated by the speech of others. Some said: One whose sins dominated. This has a view [reservation]. Rather, whoever committed one major sin and did not repent from it is Fasiq according to Ahlus-Sunnah. It preceded that Fisq is not a cause for rejecting hadith as previously clarified. His saying: (or his Wahm) Meaning he narrates hadiths while doubting their authenticity by way of illusion. His saying: (or his contradiction) Discussion on contradiction preceded. His saying: (or his ignorance) Discussion on ignorance will come. The default in ignorance is that it is rejected, because only the trustworthy is accepted in the hadith of the Prophet, peace and blessings be upon him, which is based on precaution. His saying: (or his innovation) Discussion will come that innovation is not a cause for rejecting hadith. His saying: (or badness of his memory) Meaning his illusion equaled his precision, or his illusion dominated. This is a summary of what Al-Hafiz clarified in his explanation of Al-Nukhbah in his book (Al-Nuzhah). Then after that he will mention the ruling of each hadith. This which he will establish has a view [reservation], because he made the Fabricated the hadith of the liar. This absolutely has a view [reservation]. No doubt the liar's hadith is fabricated, but it might",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 54
  },
  {
    "serial_number": "3339013",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "Also described as 'Fabricated' (Mawdu') is what is not actually so. Among what Ibn Taymiyyah verified when it was asked: Are there fabricated hadiths in Musnad Ahmed or not? He said: If by the narration of a liar intentionally, then no. But if it is meant that someone erred so the hadith became fabricated, then yes, meaning it became fabricated without intent. Therefore, Al-Hafiz mentioned these ten causes and then mentioned their rulings. This codification and division is questionable, and scholars only differ in judgment by looking at the text (Matn) and the condition of the narrator as previously explained.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 55
  },
  {
    "serial_number": "3339014",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "Al-Hafiz Ibn Hajar - may Allah have mercy on him - said: The first is the Fabricated (Mawdu'), the second is the Abandoned (Matruk), the third is the Denounced (Munkar) according to one opinion, and likewise the fourth and fifth. Then the Illusion (Wahm): if it is discovered through indicators and gathering paths: it is the Defective (Mu'allal). Then Contradiction: if it is by changing the context: it is Mudraj al-Isnad (Interpolated in Chain), or by merging a suspended (Mawquf) narration with a raised (Marfu') one: it is Mudraj al-Matn (Interpolated in Text), or by advancing or delaying: it is the Inverted (Maqlub), or by adding a narrator: it is the Addition in Connected Chains (Mazid fi Muttasil al-Asanid), or by replacing it with no preponderant factor: it is the Disturbed (Mudtarib). Replacement may occur intentionally for testing. Or by changing [the letters] while the script remains the same: it is the Misplaced Dotting (Musahhaf) and Misplaced Voweling (Muharraf). It is not permissible to intentionally change the text by omission or synonyms except for a scholar who knows what alters meanings. If the meaning is obscure, it requires an explanation of the Strange (Gharib) and clarification of the Problematic (Mushkil). Then Ignorance (Jahalah): its cause is that a narrator may have many descriptions and is mentioned by other than what he is famous for, for a purpose; they wrote 'Al-Muwaddih' regarding this. \nHis saying: (The first: The Fabricated): Fabricated is the narration of a liar. His saying: (The second: The Abandoned): Meaning the one accused of lying. His saying: (The third: The Denounced according to an opinion): Meaning one whose mistake is excessive. This is questionable as previously mentioned, for the early scholars used 'Munkar' to mean contradiction and uniqueness; thus mere uniqueness which is not accepted is called Munkar. His saying: (...and likewise the fourth and fifth): In any case, this division with this precision is questionable as previously explained. His saying: (Then the Illusion: if it is discovered through indicators and gathering paths: it is the Defective): It indicates the Defective hadith is what is proven to be an error by gathering paths, and this is correct. However, the term \"Illah\" (Defect), although famous for hidden defects, is applied to both hidden and apparent defects as previously explained. But the greatest way to know the hadith defective by a hidden defect is gathering paths, as stated by Yahya bin Ma'in, Ali bin al-Madini, and Imam Ahmed - may Allah have mercy on him.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 56
  },
  {
    "serial_number": "3339015",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "His saying: (Then Contradiction: if it is by changing the context: it is Mudraj al-Isnad... or by replacing it with no preponderant factor: it is the Disturbed): He mentioned contradiction then listed sections under it: \n• Section One: Mudraj al-Isnad (Interpolated in Chain), by changing the context. It has forms, including: A narrator narrates the first part of a hadith, and another narrates the second part, then someone comes after them and narrates the full hadith from both, giving the impression that both narrated it completely. This is called Mudraj al-Isnad; this is one of its forms.\n• Section Two: Mudraj al-Matn (Interpolated in Text). This is inserting words into the text that are not from the speech of the Messenger of Allah, peace be upon him. It may be at the beginning, end, or middle. An example is what Al-Bukhari and Muslim narrated from Ibn Umar and Aisha: \"Bilal calls the Adhan at night, so eat and drink until Ibn Umm Maktum calls it. He was a blind man who would not call it until it was said to him: Morning has come, morning has come.\" This was narrated by Al-Bukhari, and it [the description of him being blind] is interpolated at the end of the hadith and is not from the Prophet's speech. Books have been written on this. The point is whatever is inserted into the text that is not from the Prophet's speech is called Mudraj in the text. \nWarnings:\nWarning 1: The default is lack of interpolation, and it is not asserted unless evidence indicates it, as scholars establish in Fiqh and commentaries, such as Al-San'ani in *Al-Subul*. Among hadiths where interpolation is not conceded is: \"Whoever among you is able to extend his white blaze and white limbs, let him do so.\" The correct view is that it is not interpolated, as is the practice of Muslim, and Al-Khatib did not mention it in his book on Interpolation, nor is there authentic evidence indicating it is interpolated, contrary to Al-Mundhiri and those who followed him.\nWarning 2: The interpolated part is not proof like the Hadith because it is not the Prophet's speech. It might be the companion's speech, so it would be proof under conditions, or the speech of someone below him.\nWarning 3: Interpolation is known by things including: 1. The arrival of a detailed narration separating the interpolated part.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 57
  },
  {
    "serial_number": "3339016",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "2. By the narrator explicitly stating it. 3. By the statement of some knowledgeable Imams. 4. By the impossibility of the Prophet, peace be upon him, saying it. Ibn Hajar noted this in *Al-Nuzhah*.\n• Section Three: By advancing or delaying, it is the Inverted (Maqlub). Advancing and delaying can be in the name, flipping the narrator's name, or in the text as came in a narration: \"Until his left hand does not know what his right hand spends.\" This is an inversion in the text, because the correct version is \"Until his right hand does not know what his left hand spends.\"\n• Section Four: The Addition in Connected Chains (Al-Mazid fi Muttasil al-Asanid). If you contemplate this type, you find that Hafiz Ibn Hajar in *Al-Nukat* listed it as rejected; so it is a rejected addition according to Al-Hafiz, not an accepted one. The form of 'Addition in Connected Chains' is: A hadith is narrated with a chain, then another chain comes with an additional narrator, and this addition in the other chain is rejected, so it is called 'Addition in Connected Chains'. Al-Hafiz mentioned in the explanation: For this addition to be clearly rejected, two things are required:\n o First: The first chain without the addition must have the student explicitly declaring hearing from his Sheikh.\n o Second: The one who did not add it must be more trustworthy than the one who added it, so the narration of the one who added it is rejected.\nThus, Al-Hafiz presented 'Addition in Connected Chains' as rejected, and Ibn al-Salah preceded him in this in his Introduction. However, the practice of Al-Khatib Al-Baghdadi - who was the first to mention this type and wrote a book on it - is that he made some of it rejected and some accepted, as mentioned by Ibn Rajab in the explanation of *Al-Ilal*, because Al-Khatib's book did not reach us, but Ibn Rajab mentioned this about him and agreed with him. Therefore, the correct view is that 'Addition in Connected Chains' has two parts: a rejected part and an accepted part. Whatever indicators show is rejected is rejected, and whatever indicators show is accepted is accepted. It should not be categorized solely as rejected as Ibn al-Salah and then Ibn Hajar did. The early Hadith scholars do not use the term:",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 58
  },
  {
    "serial_number": "3339017",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "\"Addition in Connected Chains\", but rather they express it by saying: \"So-and-so's mention is an error\" or they say: \"His mention is correct and the error is in omitting him,\" using synonyms indicating this. Thus, according to early scholars, it may be accepted or rejected, or both faces may be valid—mentioning the intermediary may be correct and omitting it may be correct. This occurs if the narrator has extensive narrations like Al-Zuhri and Abu Ishaq Al-Sabi'i and their likes, so it is possible he narrated it via more than one path, with and without addition. So, 'Addition in Connected Chains' falls into three categories: sometimes the addition is rejected, sometimes accepted, and sometimes both (addition and omission) are accepted. \nHis saying: (OR BY REPLACING IT WITH NO PREPONDERANT FACTOR: IT IS THE DISTURBED [MUDTARIB]): This is the fifth section. Sometimes disturbance occurs among narrators; one narrates it one way, another a different way, with no preponderant factor (Murajjih). It is said: This is disturbed (Mudtarib), and we cannot prefer one because it is disturbed. Disturbance occurs in text and chain, as clarified by Ibn al-Salah and mentioned by Ibn Hajar in his explanation. The topic of disturbance has issues, but the most important thing to know is that Al-Hafiz establishes it happens in text and chain as he explained, and that it exists in the absence of a preponderant factor; if a preponderant exists, it is not called disturbance. The correct view - and Allah knows best - and the practice of early Hadith scholars is that disturbance is mentioned whether a preponderant exists or not. Whenever difference is found, it is called disturbance. A preponderant may exist so one aspect is acted upon, or none exists so all are abandoned. This is their practice; they do not restrict it to the absence of a preponderant. Disturbance is revealed by gathering paths, and it is treated like the 'addition of a trustworthy narrator' discussed earlier: sometimes accepted, sometimes rejected. One must scrutinize disturbance in the text: does a legal ruling depend on it or not? The source must be one. It is close to the topic of 'addition of a trustworthy narrator' and overlaps with it.\nHis saying: (REPLACEMENT MAY OCCUR INTENTIONALLY FOR TESTING): A narrator may be subjected to testing by others, so they swap the chain.\nHis saying: (OR BY CHANGING [THE LETTERS] WHILE THE SCRIPT REMAINS THE SAME: IT IS THE MISPLACED DOTTING [MUSAHHAF] AND MISPLACED VOWELING [MUHARRAF]): This is the sixth type, with sections under it. What Al-Hafiz Ibn Hajar established is that Musahhaf",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 59
  },
  {
    "serial_number": "3339018",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "and Muharraf mean the shape of the word is the same, but the difference is in vowels (Harakat) or dots. By this, Al-Hafiz - may Allah have mercy on him - distinguished between them. He made Musahhaf and Muharraf share the word shape, but distinguished by dots or vowels. However, the practice of scholars before him did not differentiate between Musahhaf and Muharraf. They mostly used \"Tashif\" (Misplacement). They might apply it to a complete change of name, or even a change in the word's drawing, as found in the speech of Al-Shafi'i and others. Thus, early scholars mostly use \"Tashif\". They might use \"Tahrif\", but \"Tashif\" is dominant. Furthermore, they do not restrict Tashif to dots and Tahrif to vowels as Al-Hafiz established in his explanation of *Al-Nukhbah*. Rather, they make Musahhaf general for dots, vowels, and even the drawing of the word. Ahmad Shakir - may Allah have mercy on him - clarified this in his footnotes on *Alfiyat al-Suyuti*, noting that the early scholars did not differentiate between them, and the matter is simple.\nHis saying: (IT IS NOT PERMISSIBLE TO INTENTIONALLY CHANGE THE TEXT BY OMISSION OR SYNONYMS EXCEPT FOR A SCHOLAR WHO KNOWS WHAT ALTERS MEANINGS): A disagreement occurred among scholars regarding narrating Hadith by meaning. Defining the point of dispute: What is used for worship by its wording, like Adhkar (supplications), cannot be narrated by meaning, as mentioned by Al-Suyuti and Al-Sakhawi. Al-Suyuti even mentioned that 'Jawami al-Kalim' (concise comprehensive speech) cannot be narrated by meaning. As for what is worshipped by its wording like Adhkar, this is clear, as in the hadith of Al-Bara' who said: \"And your Messenger whom You sent,\" and the Prophet corrected: \"And your Prophet whom You sent,\" clarifying his error because it is worshipped by its wording. As for 'Jawami al-Kalim' mentioned by Al-Suyuti, it is possible it is so, depending on the narration by meaning.\n• Warning: It should be known that if a narrator narrates a hadith by meaning and errs, the Hadith scholars and Imams of this art and guardians of the Sharia will clarify his error. This has happened often, for Allah preserves His religion. Ibn Rajab mentioned examples, and others mentioned that some narrators erred in hadiths because they narrated by meaning and erred in doing so. After this: The most correct of the two scholarly opinions, which is the view of the majority, is that narrating Hadith by meaning is permissible. It is the view of Al-Hasan and others. The strongest evidence for this - and Allah knows best - is that Allah mentioned to us",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 60
  },
  {
    "serial_number": "3339019",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "the stories that happened to previous prophets, and He mentioned them to us by meaning, even though they were in their languages and not in Arabic, yet He mentioned them to us in Arabic. Thus, narration by meaning is valid.\nWarnings:\n• Warning 1: Al-Mu'allimi - may Allah have mercy on him - said: The fear in narrating by meaning is only in verbal hadiths (sayings), not actions. He mentioned this in the intro to *Al-Tankil*. He spoke the truth, may Allah have mercy on him, because the action-based hadith is recounted and interpreted by the narrator, unlike the verbal hadith which is based on hearing.\n• Warning 2: Ibn Hajar mentioned in *Al-Nuzhah*, and others mentioned, that the strongest evidence for the permissibility of narrating by meaning is the permissibility of translating the meanings of the Quran. It is said: This evidence is questionable; because translating the meanings of the Quran is not narrating the Quran by meaning, but rather translating the meaning from one language to another. There is a difference between translating meaning from language to language and narrating the wording with another meaning [in the same language]. Therefore, it is questionable - and Allah knows best - and the evidence is what was previously mentioned.\nHis saying: (IF THE MEANING IS OBSCURE, IT REQUIRES AN EXPLANATION OF THE STRANGE [GHARIB] AND CLARIFICATION OF THE PROBLEMATIC [MUSHKIL]): This also has no relation to the science of Terminology (Mustalah), because this relates to Dirayah (understanding/comprehension), and our discussion is in Riwayah (narration).\nHis saying: (THEN IGNORANCE [JAHALAH]: ITS CAUSE IS THAT A NARRATOR MAY HAVE MANY DESCRIPTIONS AND IS MENTIONED BY OTHER THAN WHAT HE IS FAMOUS FOR, FOR A PURPOSE; THEY WROTE 'AL-MUWADDIH' REGARDING THIS. OR HE MAY HAVE FEW NARRATIONS SO TAKING FROM HIM IS NOT FREQUENT; THEY CLASSIFIED 'AL-WUHDAN' [THOSE WITH ONE NARRATOR] REGARDING THIS. OR HE IS NOT NAMED FOR ABBREVIATION; THIS INCLUDES THE AMBIGUOUS [MUBHAMAT]. THE AMBIGUOUS IS NOT ACCEPTED EVEN IF MADE AMBIGUOUS WITH A WORD OF MODIFICATION [TA'DIL] ACCORDING TO THE MORE CORRECT VIEW): He mentioned - may Allah have mercy on him - that among the causes for rejecting a hadith and impugning a narrator is being unknown (Majhul). He made ignorance a cause for impugning the narrator, and this is correct, because the unknown's condition is not known, and accepting hadiths is based on precaution; only the report of a trustworthy person is accepted, so the narration of the unknown is not accepted. He mentioned causes of ignorance: The narrator might have many descriptions and be mentioned by other than what he is famous for. They wrote concerning this - and Allah knows best - *Al-Muwaddih* (The Clarifier) - with stress - meaning: what clarifies those with many descriptions. Al-Khatib Al-Baghdadi - may Allah have mercy on him - wrote a book on this. The second cause for ignorance is his saying: (OR HE MAY HAVE FEW NARRATIONS SO TAKING FROM HIM IS NOT FREQUENT; THEY CLASSIFIED 'AL-WUHDAN' REGARDING THIS) meaning one from whom only one person narrated. His saying: (OR HE IS NOT NAMED FOR ABBREVIATION) is the third cause for ignorance.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 61
  },
  {
    "serial_number": "3339020",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "His saying: (THIS INCLUDES THE AMBIGUOUS [MUBHAMAT]): It should be known that there is a difference between the Ambiguous (Mubham) and the Neglected (Muhmal). The Muhmal is when a man is named but what distinguishes him is not mentioned, so it is said: \"Muhammad told us.\" He does not name his father or anyone else, so Muhammad is not known and is called Muhmal. As for the Mubham, it is said: \"A man told me.\" Just like that, it is not known who this man is. Or he says: \"The trustworthy one told me.\" This is Mubham because he did not name this man. So there is a difference between Mubham and Muhmal. Then he digressed - may Allah have mercy on him - in mentioning the Mubham, saying: (THE AMBIGUOUS IS NOT ACCEPTED EVEN IF MADE AMBIGUOUS WITH A WORD OF MODIFICATION ACCORDING TO THE MORE CORRECT VIEW). He stated that this Mubham is not accepted even if a man says about him: \"The trustworthy one told me,\" because it is not known who this man is; he might be trustworthy to him but not to others. So this ambiguous authentication is not accepted, and this is the correct view.\nHis saying: (IF HE IS NAMED AND ONLY ONE PERSON NARRATES FROM HIM: HE IS 'MAJHUL AL-AYN' [UNKNOWN ENTITY]. OR TWO OR MORE, AND HE IS NOT AUTHENTICATED: HE IS 'MAJHUL AL-HAL' [UNKNOWN CONDITION], WHICH IS 'AL-MASTUR' [THE VEILED]): Al-Hafiz divided the unknown into two types:\n• Type One: Majhul al-Ayn (Unknown Entity).\n• Type Two: Majhul al-Hal (Unknown Condition).\nHe said regarding Majhul al-Ayn: One from whom only one person narrated. Meaning: and this man was not authenticated, so he is called Majhul al-Ayn. But if two or more narrated from him and he was not authenticated, he is called Majhul al-Hal. So Majhul al-Ayn and Majhul al-Hal share that they are not authenticated, except that Majhul al-Ayn has one narrator from him, and Majhul al-Hal has two or more. This is what Al-Hafiz established. However, Ibn Abd al-Barr and Al-Khatib Al-Baghdadi mentioned something additional to this. They said: If the man is famous for asceticism or generosity... etc., even if only one person narrated from him, he is called Majhul al-Hal. So he rises from Majhul al-Ayn to Jahalat al-Hal. Al-Khatib's words imply that Hadith scholars hold this view. So, one from whom only one person narrated but is famous for either asceticism, generosity, or bravery is called Majhul al-Hal. This is correct and closer to the meaning of Majhul al-Hal. Both Majhul al-Ayn and Majhul al-Hal are weak and [their narrations] are not valid. I draw attention to issues regarding the Unknown, and what should be mentioned might come later, but I mention it and refer to it later:",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 62
  },
  {
    "serial_number": "3339021",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "• Issue One: The Unknown is rejected as previously mentioned because he is unknown and his condition is not known, and the hadiths of the Prophet, peace be upon him, are based on precaution, so verification is necessary. However, some scholars use the term \"Jahalah\" (Ignorance/Anonymity) to mean he is not famous for narration, just as Imam Ahmed applied \"Jahalah\" to Abd al-Rahman bin Wa'lah, who is one of Muslim's narrators and has been authenticated; he meant that he is not famous for narration. It should be known that scholars have specific usages known by looking into biographical books and comparing their speech with others, etc. So \"Jahalah\" may be used to mean lack of fame.\n• Issue Two: Some scholars' authentication is not relied upon because they are lax in authenticating, such as merely Ibn Hibban mentioning a man in his book *Al-Thiqat*. It does not indicate his trustworthiness; in fact, he once mentioned a man and said: \"I do not know him nor his father,\" yet he counted him among the trustworthy (Thiqat) based on his principle that the default state of Muslims is probity (Adalah). Such is not accepted. Similarly, Al-Ijli; Al-Mu'allimi mentioned in his book *Al-Tankil* and *Al-Anwar Al-Kashifah* that Al-Ijli is lax, especially regarding the Successors (Tabi'in). So if you find a narrator among the Successors mentioned in *Al-Thiqat* only by Ibn Hibban and authenticated only by Al-Ijli in his book *Al-Thiqat*, it is not accepted because they are known for laxity, especially Al-Ijli regarding Successors. Examples of this - and Allah knows best - are when a scholar says: \"So-and-so is among the trustworthy of the people of Yamama\" or \"trustworthy of such-and-such...\" Such usage also intends probity by authentication, because general authentication means general probity, like the book *Mashahir Ulama' al-Amsar* by Ibn Hibban, which uses this often, and others. If it is said: \"From the trustworthy of such-and-such,\" the intent is probity, not \"Thiqah\" meaning precision (Dabt). This is something that should be regulated.\n• Issue Three: Some scholars do not narrate except from a trustworthy person. Such a person's hadith is not accepted absolutely [as authentication for his sources], like Imam Ahmed and Imam Malik and others, for they do not narrate except from a trustworthy person. Abu Hatim said: \"Unless it becomes clear that he is weak\" - meaning mostly unless it becomes clear he is weak - the default is they do not narrate except from a trustworthy person. But if his weakness becomes clear, the general authentication is not accepted merely because they do not narrate except from a trustworthy person. \nWarning: If you find a hadith regarding rulings and find no biography for its narrator, but Ahmed or Malik or their likes who do not narrate except from trustworthy people narrated from him, this hadith is not corrected in",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 63
  },
  {
    "serial_number": "3339022",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "rulings. Al-Dhahabi said: The majority view is that a narrator from whom a group of trustworthy people narrate and who does not bring something denounced (Munkar), his hadith is accepted. His saying: \"and who does not bring something denounced,\" means - and Allah knows best -: he does not stand alone with a ruling. For if he stands alone with a ruling, he has brought something denounced. Thus Al-Dhahabi says in *Al-Muqizah*: The Truthful (Saduq) - who is below Thiqah - if he stands alone with a ruling, sometimes it is accepted and sometimes rejected. This is regarding one who is authenticated, so how about one who is not specifically authenticated? This is an important topic that should be regulated. If they say: \"So-and-so does not narrate except from a trustworthy person,\" the meaning is unless his weakness becomes apparent, i.e., mostly. Then if this \"trustworthy person\" stands alone with a ruling, this hadith is not relied upon.\n• Issue Four: If a group of trustworthy people narrate from a narrator and he does not bring what is denounced, Al-Dhahabi and Ibn al-Qattan al-Fasi mentioned that the majority accept him. This is correct as mentioned, but the meaning of \"does not bring what is denounced\" must be understood, i.e., he does not stand alone with a new ruling. If he stands alone with a new ruling, it is not accepted from a \"Saduq\", so how about one who is not authenticated but merely narrated from by trustworthy people?\n• Issue Five: If it is said regarding a narrator that the people of such-and-such neighborhood narrated from him, or his students narrated from him, and his students are known only as trustworthy, his hadith is accepted according to the most correct scholarly views. As Al-Bukhari - may Allah have mercy on him - did in narrating the hadith of Al-Bariqi; he accepted the narrators of his neighborhood. Similarly, Ibn al-Qayyim and others did regarding the narration of Mu'adh's companions from Mu'adh. He said: Because Mu'adh's companions are trustworthy. He said: If his companions narrate from him and his companions are known only as trustworthy, this is considered authentic according to the most correct scholarly views. \n...And other topics related to the Unknown.\nHis saying: (THEN INNOVATION: EITHER EXCOMMUNICATING [MUKAFFIR], OR CORRUPTING [MUFASSIQ]. THE FIRST: THE MAJORITY DO NOT ACCEPT ITS AUTHOR. THE SECOND: HE IS ACCEPTED IF HE IS NOT A CALLER [TO IT] ACCORDING TO THE MORE CORRECT VIEW, UNLESS HE NARRATES WHAT STRENGTHENS HIS INNOVATION, THEN IT IS REJECTED ACCORDING TO THE CHOSEN VIEW, AND AL-JUZJANI, THE SHEIKH OF AL-NASA'I, STATED THIS): If the innovator is a disbeliever, his narration is not accepted by consensus, as narrated by Al-Nawawi - may Allah have mercy on him. However, it should be known that a narrator may fall into a disbelief-causing act without becoming a disbeliever individually; there is no necessary correlation between falling into Kufr and being a Kafir. Ibn Taymiyyah said as in *Majmu' al-Fatawa*: The Book, the Sunnah, Consensus, and Consideration indicate this. But the point is whoever is proven to be a disbeliever, his narration is not accepted.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 64
  },
  {
    "serial_number": "3339023",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "As for the one whose disbelief is not proven by being an innovator, Al-Hafiz detailed regarding him, but he said before this: (OR CORRUPTING), and it was previously mentioned that Fisq (corruption/sinfulness) is not a barrier. His saying: (THE FIRST: THE MAJORITY DO NOT ACCEPT ITS AUTHOR) meaning the excommunicating one. It is said: If it means he committed Kufr [and became a Kafir], then by consensus as narrated by Al-Nawawi. If it means he did not become a Kafir, then if he did not become a Kafir, he is an innovator, and it will be mentioned that it is like a consensus among Hadith scholars to accept the narration of the innovator. \nHis saying: (THE SECOND: HE IS ACCEPTED IF HE IS NOT A CALLER [TO IT] ACCORDING TO THE MORE CORRECT VIEW, UNLESS HE NARRATES WHAT STRENGTHENS HIS INNOVATION, THEN IT IS REJECTED ACCORDING TO THE CHOSEN VIEW, AND AL-JUZJANI, THE SHEIKH OF AL-NASA'I, STATED THIS): Meaning the one who fell into a corrupting innovation (HE IS ACCEPTED IF HE IS NOT A CALLER...). It should be known that dividing innovations into excommunicating and non-excommunicating is agreed upon by consensus, as narrated by Sheikh Hafiz Hakami in *Ma'arij al-Qabul*, and many scholars established that there are excommunicating and non-excommunicating innovations. If it is said: How is excommunicating innovation distinguished from non-excommunicating? It is said: By looking at the ruling of the action itself apart from the description of innovation. Like invoking saints; this is Kufr without looking at the description of innovation. As for collective Dhikr (remembrance), this is not Kufr without looking at the description of innovation. If looked at with the description of innovation, it becomes an innovation - i.e., collective supplication. Invoking saints, if worshipped thereby, is an excommunicating innovation, because the ruling of the action without the description of innovation is Kufr. \nThe most apparent view - and Allah knows best - is that the narration of the innovator is accepted, and it is like a consensus among people of knowledge as narrated by Al-Khatib Al-Baghdadi in his book *Al-Kifayah*. He said: This is the view of Ali bin al-Madini... and he listed a large group of scholars. It is the practice of the authors of the two Sahihs, Imam Al-Bukhari and Muslim. Al-Bukhari and Muslim narrated with their chains from Qais bin Abi Hazim from Amr bin Al-Aas that the Prophet, peace be upon him, said: \"Verily the family of so-and-so are not my allies (Awliya'), my Ally is only Allah...\" 'Family of so-and-so' means the family of Abu Talib. Qais bin Abi Hazim, although trustworthy, was accused of Nasb (hatred of Ali), and this hadith strengthens his innovation, yet Al-Bukhari and Muslim accepted the hadith. \nSecond Example: Imam Muslim narrated the hadith of Ali bin Abi Talib containing Adi bin Thabit, which is that Ali said: \"The Unlettered Prophet covenanted to me that none loves me but a believer and none hates me but a hypocrite.\" This hadith outwardly strengthens the innovation of Shi'ism, and Adi bin Thabit was an Imam of the Shia and their preacher, yet Muslim narrated",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 65
  },
  {
    "serial_number": "3339024",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "what strengthens his innovation outwardly, because Qais bin Abi Hazim and Adi bin Thabit are trustworthy, known for truthfulness and do not lie. Had they lied, the Hadith scholars would have exposed them. Since they are truthful (Saduq), scholars accepted these two hadiths. In fact, Al-Bukhari and Muslim narrated them; Al-Bukhari and Muslim narrated the first hadith, and Muslim narrated the second hadith, even though it strengthens their innovation. This is the apparent view - and Allah knows best - for the reliance is on precision and truthfulness.\nHis saying: (THEN BAD MEMORY: IF IT IS INHERENT, IT IS THE ANOMALOUS [SHADH] ACCORDING TO ONE OPINION, OR IF IT OCCURRED LATER, IT IS THE MIXED UP [MUKHTALIT]): It was previously mentioned that these detailed classifications are not correct. However, his saying: (IF IT IS INHERENT, IT IS THE ANOMALOUS ACCORDING TO ONE OPINION), it was mentioned that the meaning of Shadh is absolute uniqueness; it may be from a trustworthy person or a weak one. \nHis saying: (OR IF IT OCCURRED LATER, IT IS THE MIXED UP): The Mukhtalit (Mixed up) narrator. Attention should be paid to an important topic, which is that mixing (Ikhtilat) and change (Taghayyur) are two types:\n• Type One: Non-harmful mixing.\n• Type Two: Harmful mixing.\nNon-harmful mixing is when a narrator's memory changes a change that does not make him alter hadiths and their chains, or he changes a change that alters hadiths and chains but he did not narrate during his harmful mixing, as his sons and students prevented him... etc. \nAs for harmful mixing, it is one who changed a harmful change and narrated during his change. The criterion to distinguish between them: If scholars say: If he narrated early, his early students were precise, unlike his students after that who were not. Or they distinguished between years, saying: Whoever narrated from him before year such-and-such was precise, and after year such-and-such was not... If they mention what indicates defining the time of his precision and lack thereof, and acceptance of his narration and non-acceptance based on his condition, time, and self; this is harmful change and is called Ikhtilat. This is a summary of what Al-Mu'allimi established in his book *Al-Tankil*, which is a precious research worth writing in gold water. Many Hafizs undergo change, and not every change causes the hadith to be rejected. It might be a change that does not harm, though his memory isn't like before. Or it might be a change that harms, which is Ikhtilat. Then, the one who changed a harmful change might not have narrated during his change, so his change does not harm because he did not narrate during it. What harms is one who changed a harmful change and then narrated.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 66
  },
  {
    "serial_number": "3339025",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "This topic mentioned by Al-Mu'allimi is extremely precious; because through it, one can practically distinguish between narrators accused of mixing and change. Not everyone accused of mixing is rejected, and not everyone accused of change is rejected. It must be regulated by what was previously mentioned.\nHis saying: (AND WHENEVER THE ONE WITH BAD MEMORY IS CORROBORATED BY A CONSIDERED NARRATOR, AND LIKEWISE THE VEILED [MASTUR], THE MURSAL, AND THE MUDALLIS: THEIR HADITH BECOMES HASAN NOT BY ITSELF, BUT BY THE TOTALITY): The discussion on this has preceded. If such narrators are corroborated, it indicates they were precise; because the Mastur is unknown in condition, and there is nothing indicating his hadith is error or illusion, so it was left as a precaution. But if corroborated, this doubt is removed. Similarly, the Mursal narrator was left fearing the intermediary might be weak, but if corroborated, the opposite becomes clear. Likewise, the Mudallis is like the Mursal.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 67
  },
  {
    "serial_number": "3339026",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "Al-Hafiz Ibn Hajar - may Allah have mercy on him - said: Then the chain (Isnad): Either it ends at the Prophet - peace be upon him -, explicitly or judgmentally: from his saying, action, or approval. Or to the Companion likewise, and he is: whoever met the Prophet - peace be upon him and his family - believing in him, and died on Islam, even if apostasy intervened according to the more correct view. Or to the Successor (Tabi'i): and he is whoever met the Companion likewise. The first is: The Raised (Marfu'), the second: The Suspended (Mawquf), the third: The Cut (Maqtu'). And whoever is below the Successor is like him. The last two are called: The Effect (Al-Athar). And the Musnad is: The raised narration of a Companion with a chain that is outwardly connected. If its number [of narrators] is few: it either ends at the Prophet - peace be upon him -, or to an Imam of high description like Shu'bah. The first is: Absolute High [Isnad]. The second: Relative. It includes Agreement (Muwafaqah): which is reaching the Sheikh of one of the authors via other than his path. And Substitution (Badal): which is reaching the Sheikh of his Sheikh likewise. And Equality (Musawah): which is the equality of the number of the chain from the narrator to its end, with the chain of one of the authors. And Handshaking (Musafahah): which is equality with the student of that author. Opposing High [Isnad] in its types is: Descent (Nuzul). If the narrator and the one narrating from him share age and meeting, it is Peers (Aqran). If each of them narrates from the other: it is Mudabbaj. If he narrates from someone below him: it is Elders from Youngers (Akabir 'an Asaghir); from it is Fathers from Sons. In its opposite [Sons from Fathers] is abundance; from it is one who narrates from his father from his grandfather. If two share a Sheikh, and the death of one preceded, it is: The Previous and The Later (Sabiq wa Lahiq). If he narrates from two with the same name, and they are not distinguished, then by his specialty with one of them, the Neglected (Muhmal) is clarified.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 68
  },
  {
    "serial_number": "3339027",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "IF THE SHEIKH DENIES HIS NARRATION WITH CERTAINTY: IT IS REJECTED, OR WITH PROBABILITY: IT IS ACCEPTED ACCORDING TO THE MORE CORRECT VIEW. INCLUDED IN IT IS: \"WHOEVER NARRATED AND FORGOT\". IF THE NARRATORS AGREE IN THE FORMULAS OF PERFORMANCE, OR OTHER STATES, IT IS THE SERIAL (MUSALSAL).\nHis saying: (...THE FIRST: THE RAISED [MARFU'], THE SECOND: THE SUSPENDED [MAWQUF], THE THIRD: THE CUT [MAQTU'], AND WHOEVER IS BELOW THE SUCCESSOR IS LIKE HIM. THE LAST TWO ARE CALLED: THE EFFECT [AL-ATHAR]): The summary of the foregoing: What is narrated from the Prophet, peace be upon him, is Marfu'; what is narrated from the Companion is Mawquf; and what is narrated from the Successor is Maqtu'. Then he divided Marfu' into two types: either explicitly Marfu' or judgmentally Marfu'. This explicit Marfu' and judgmental Marfu' can be from his saying, action, or approval. Explicit Marfu' from his saying is like saying: The Prophet, peace be upon him, said: \"Actions are but by intentions.\" Or his action: The Prophet, peace be upon him, when he prostrated, did not spread his arms... etc., hadiths mentioning his action, peace be upon him. Or his approval: that he sees something and approves them on it; this is the explicit. The Judgmental (Hukmi): is what indicates that but is not explicit, like a Companion saying: \"It is from the Sunnah such-and-such\" or \"Two dead things and two bloods were made lawful for us.\" This is judgmentally Marfu' from his saying, peace be upon him. Similarly, if a Companion says: \"It is from the Sunnah to do such-and-such,\" this is also judgmentally Marfu'. His approval [judgmentally] is that something is done in his time and the Prophet, peace be upon him, did not see it, like Jabir's saying: \"We used to practice coitus interruptus while the Quran was being revealed.\" This is from his judgmental approval. So Marfu' can be judgmental or explicit, and can be verbal, active, or approval.\nAs for Mawquf, it is not divided into explicit and judgmental. Mawquf is the saying of the Companion, his action, or his approval. Similarly, Maqtu', and Maqtu' is for those below the Successor; it is the saying, action, and approval of the Successor. It can be for those below him like the Successor of the Successor, so what is said about those below the Successor is like what is said about the Successor. \nIt should be known that some early scholars used \"Maqtu'\" for \"Munqati'\" (disconnected), as Al-Bardiji did, and some used \"Munqati'\" meaning \"Maqtu'\", as Imam Al-Shafi'i did.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 69
  },
  {
    "serial_number": "3339028",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "This depends on the practice of scholars, their terminologies, and actions. Therefore, a student of knowledge should be well-read and read extensively to know the incidental terminologies of scholars, either by looking into books of Terminology or commentaries on Hadith, and so on as will be mentioned - Allah willing.\nHis saying: (THE LAST TWO ARE CALLED: THE EFFECT [AL-ATHAR]): The last two: meaning the Mawquf and Maqtu'. Al-Nawawi - may Allah have mercy on him - mentioned that Hadith scholars do not differentiate between Hadith and Athar. He said: As for the Khurasanis, they differentiate between them, making the saying of the Prophet, peace be upon him, \"Hadith\" and the saying of those below him \"Athar\". This was mentioned in the beginning of the explanation. The correct view is that all are called Athar, and using \"Hadith\" for what is raised to the Prophet, peace be upon him, became famous.\nHis saying: (AND THE MUSNAD IS: THE RAISED NARRATION OF A COMPANION WITH A CHAIN THAT IS OUTWARDLY CONNECTED): So you say: This is a Musnad hadith. His saying: (WITH A CHAIN THAT IS OUTWARDLY CONNECTED) means the hadith might be Mudallas (concealed) or Mursal Khafi (hidden disconnected). In a similar way, Abu Abdullah Al-Hakim defined it in his book *Ma'rifat Ulum al-Hadith*. The more correct view - and Allah knows best - is that scholars include in \"Masanid\" even hadiths that are clearly and obviously Mursal, as is evident by looking at the Musnad of Imam Ahmed - may Allah have mercy on him. The matter in this is simple - Allah willing. The meaning of Musnad: whatever is attributed to the Prophet, peace be upon him, even if it is Mursal. The matter is easy, praise be to Allah.\nHis saying: (IF ITS NUMBER [OF NARRATORS] IS FEW: IT EITHER ENDS AT THE PROPHET - PEACE BE UPON HIM -, OR TO AN IMAM OF HIGH DESCRIPTION LIKE SHU'BAH. THE FIRST IS: ABSOLUTE HIGH [ISNAD]. THE SECOND: RELATIVE): It should be known that there is what is called High (Ali) and Low (Nazil). If the narrators between the author and the Prophet, peace be upon him, are few, it is called a High Hadith. If the narrators are many, it is called a Low Hadith. In Bukhari there are Thulathiyat (chains with three narrators), so this is considered a High Hadith. Hadith scholars love the High Chain, so much that when Ibn Ma'in was asked: What do you desire? He said: I desire a high chain and an empty house. Ibn al-Salah mentioned this in his Introduction. The benefit of the High Chain is that since the number of narrators is few, it becomes easier to reach a conclusion on the authenticity or weakness of the hadith, unlike if the chain is Low, as it requires greater effort, and there is a probability of an unnoticed error... etc.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 70
  },
  {
    "serial_number": "3339029",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "Then he divided Highness into two types: Absolute Highness, which is to the Prophet, peace be upon him, as mentioned previously. Or Relative Highness, meaning between the author and Shu'bah, for example, there are two [narrators], while usually there would be three for someone like him. This is called: Relative Highness.\nHis saying: (IT INCLUDES AGREEMENT [MUWAFAQAH]: WHICH IS REACHING THE SHEIKH OF ONE OF THE AUTHORS VIA OTHER THAN HIS PATH. AND SUBSTITUTION [BADAL]: WHICH IS REACHING THE SHEIKH OF HIS SHEIKH LIKEWISE): It should be known that the division is as follows: Muwafaqah and Badal are counterparts, and Musawah and Musafahah are counterparts. The meaning of Muwafaqah: Someone narrates a hadith and reaches the Sheikh of the author, like the Sheikh of Al-Bukhari for example, via a path other than Al-Bukhari's. This is called Muwafaqah. Or reaching the Sheikh of Al-Bukhari's Sheikh, which is called Badal. These are counterparts.\nHis saying: (AND EQUALITY [MUSAWAH]: WHICH IS THE EQUALITY OF THE NUMBER OF THE CHAIN FROM THE NARRATOR TO ITS END, WITH THE CHAIN OF ONE OF THE AUTHORS. AND HANDSHAKING [MUSAFAHAH]: WHICH IS EQUALITY WITH THE STUDENT OF THAT AUTHOR): If a narrator narrates a hadith and between him and the Prophet, peace be upon him, is the same number as between Al-Bukhari and the Prophet, peace be upon him, it is called Musawah. Or if between him and the Prophet, peace be upon him, is the same number as between Al-Bukhari's student and the Prophet, peace be upon him, it is called Musafahah. These are branches of High and Low Hadith. \nHis saying: (OPPOSING HIGH [ISNAD] IN ITS TYPES IS: DESCENT [NUZUL]): Because Descent is the counterpart of Highness and opposes it.\nHis saying: (IF THE NARRATOR AND THE ONE NARRATING FROM HIM SHARE AGE AND MEETING, IT IS PEERS [AQRAN]. IF EACH OF THEM NARRATES FROM THE OTHER: IT IS MUDABBAJ): So these two things are required for Peers: Age and Meeting. If they are equal in age and meeting, they are Peers. If the two peers narrate from each other, it is called Mudabbaj.\nHis saying: (IF HE NARRATES FROM SOMEONE BELOW HIM: IT IS ELDERS FROM YOUNGERS [AKABIR 'AN ASAGHIR], FROM IT IS FATHERS FROM SONS. IN ITS OPPOSITE [SONS FROM FATHERS] IS ABUNDANCE; FROM IT IS ONE WHO NARRATES FROM HIS FATHER FROM HIS GRANDFATHER): The default is the son narrating from his father. If reversed and the father narrates from his son, he said: It is Elders from Youngers... His saying: (IN ITS OPPOSITE IS ABUNDANCE) meaning narration of sons from fathers. From it is one who narrated from his father from his grandfather. This is a famous chain in many narrators. Most famous are the narration of: Bahz bin Hakim from his father from his grandfather, and the narration of Amr bin Shu'aib from his father from his grandfather. The narration of Bahz bin Hakim from his father from his grandfather is more authentic than the narration of Amr bin Shu'aib from his father from his grandfather. The default in the narration of Bahz bin Hakim from",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 71
  },
  {
    "serial_number": "3339030",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "his father from his grandfather is that it is accepted. As for what Amr bin Shu'aib stands alone in narrating from his father from his grandfather, the default is that it is not accepted, but it is valid for witnesses (Shawahid) and corroborations (Mutaba'at), but it is not valid independently to establish a legal ruling. Therefore, Hadith scholars use it as proof (Yahtajjun bihi), and the phrase \"Yahtajjun\" sometimes means: they accept it in witnesses and corroborations, i.e., they use it as proof along with others, not by itself. Therefore, Abu Ubayd said in his book *Al-Amwal* regarding the hadith of Amr bin Shu'aib from his father from his grandfather on Zakat of jewelry: Scholars continue to speak about it, past and present. Thus, if Amr bin Shu'aib stands alone from his father from his grandfather with a hadith, it is not strong enough to independently establish a legal ruling. Similarly, Muhammad bin Ishaq, the author of *Al-Siyar wa Al-Maghazi*. Imam Ahmed and Al-Dhahabi mentioned that what he stands alone in is not accepted, because he has errors. Among them is the hadith of Sahl bin Hunaif narrated by Abu Dawood and others that Madhiy is sprinkled [with water], meaning the impurity of Madhiy is lightened so sprinkling is sufficient and washing is not required. Muhammad bin Ishaq, the author of *Al-Siyar wa Al-Maghazi*, stood alone in this, so it is not accepted. It was previously mentioned that Hadith scholars deem uniqueness (Tafarrud) a defect. Among the hadiths Muhammad bin Ishaq stood alone with: The hadith of Ubada bin Samit in Imam Ahmed and others: \"Perhaps you recite behind your Imam?\" We said: Yes. He said: \"Do not do so except with Fatihat al-Kitab (The Opening of the Book), for there is no prayer for one who does not recite it.\" This has more than one defect, including the uniqueness of Muhammad bin Ishaq, and that he contradicted Al-Zuhri, among other defects.\nHis saying: (IF TWO SHARE A SHEIKH, AND THE DEATH OF ONE PRECEDED, IT IS: THE PREVIOUS AND THE LATER [SABIQ WA LAHIQ]): If two narrate, even if they differ in age, from one Sheikh, and one dies before the other, it is called: The Previous and The Later.\nHis saying: (IF HE NARRATES FROM TWO WITH THE SAME NAME, AND THEY ARE NOT DISTINGUISHED, THEN BY HIS SPECIALTY WITH ONE OF THEM, THE NEGLECTED [MUHMAL] IS CLARIFIED): It was previously mentioned that the Neglected is one whose name is mentioned alone, saying: Muhammad, or Sufyan, or Hammad. It could be Hammad bin Zaid or Hammad bin Salamah. In Sufyan, it could be Ibn Uyainah or Al-Thawri. So how to distinguish between them? One looks at who narrated from him; is he a student who narrates frequently from one of them or not? Suppose he narrates frequently from Ibn Uyainah, it is said: This Neglected one is Ibn Uyainah.\nHis saying: (IF THE SHEIKH DENIES HIS NARRATION WITH CERTAINTY: IT IS REJECTED, OR WITH PROBABILITY: IT IS ACCEPTED ACCORDING TO THE MORE CORRECT VIEW. INCLUDED IN IT IS: \"WHOEVER NARRATED AND FORGOT\"): The Sheikh's denial of the hadith narrated by the student has three states:",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 72
  },
  {
    "serial_number": "3339031",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "• State One: That he belies him. If he belies him, his hadith is rejected and not accepted by consensus, as narrated by Al-Nawawi - may Allah have mercy on him.\n• State Two: That he asserts his error. The majority accept it as narrated by Ibn Hajar, and the practice of Al-Bukhari and Muslim indicates this.\n• State Three: That he does not assert his error but hesitates. This is accepted all the more, and Ibn Hajar narrated consensus on it, and Al-Sakhawi quoted it.\nHis saying: (IF THE NARRATORS AGREE IN THE FORMULAS OF PERFORMANCE, OR OTHER STATES, IT IS THE SERIAL [MUSALSAL]): The Musalsal is when a student narrates from his Sheikh by anything that follows a sequence. Sometimes by formula, they all say: \"I heard\" (Sami'tu). Sometimes by action, like extending his hand or smiling. Sometimes he says: \"I love you for the sake of Allah.\" So what accompanies the narration and the Sheikh narrates to his student, and the student to his student... etc., is called Musalsal. It may be from the beginning of the chain to its end, or in part of the chain. Most Musalsals are weak and not authentic as Al-Dhahabi said. The Musalsal has no benefit except that it indicates hearing (Sama'). So if it is assumed he is a Mudallis, his hadith is accepted because it indicates hearing, as Ibn al-Salah and others mentioned.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 73
  },
  {
    "serial_number": "3339032",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "Al-Hafiz Ibn Hajar - may Allah have mercy on him - said: AND FORMULAS OF PERFORMANCE: 'I HEARD' (SAMI'TU) AND 'HE TOLD ME' (HADDATHANI); THEN 'HE INFORMED ME' (AKHBARANI) AND 'I READ TO HIM' (QARA'TU 'ALAYH); THEN 'IT WAS READ TO HIM WHILE I LISTENED'; THEN 'HE INFORMED ME' (ANBA'ANI); THEN 'HE HANDED ME' (NAWALANI); THEN 'HE SPOKE TO ME' (SHAFAHANI); THEN 'HE WROTE TO ME' (KATABA ILAYYA); THEN 'FROM' (AN), AND THE LIKE. THE FIRST TWO: FOR WHOEVER HEARD ALONE FROM THE SHEIKH'S WORDING. IF HE WAS WITH OTHERS, THEN 'WITH OTHERS' [HE TOLD US]. THE FIRST IS THE MOST EXPLICIT AND HIGHEST IN DICTATION. THE THIRD AND FOURTH: FOR WHOEVER READ HIMSELF. IF WITH OTHERS: THEN LIKE THE FIFTH. AND 'INBA'' (INFORMING) MEANS 'IKHBAR' (INFORMING), EXCEPT IN THE USAGE OF LATE SCHOLARS, IT IS FOR PERMISSION (IJAZAH) LIKE 'AN' (FROM). AND THE 'AN'ANAH' OF A CONTEMPORARY IS CONSTRUED AS HEARING EXCEPT FROM A MUDALLIS. IT IS SAID: PROOF OF THEIR MEETING IS A CONDITION - EVEN IF ONCE - AND THIS IS THE CHOSEN VIEW. THEY APPLIED 'MUSHAFAHAH' (ORAL TRANSMISSION) TO SPOKEN PERMISSION, AND 'MUKATABAH' (CORRESPONDENCE) TO WRITTEN PERMISSION. THEY STIPULATED FOR THE VALIDITY OF 'MUNAWALAH' (HANDING OVER) ITS ASSOCIATION WITH PERMISSION TO NARRATE, AND IT IS THE HIGHEST TYPE OF PERMISSION. LIKEWISE, THEY STIPULATED PERMISSION IN 'WIJADAH' (FINDING), 'WASIYYAH' (BEQUEST) OF A BOOK, AND 'I'LAM' (INFORMING). OTHERWISE, THERE IS NO CONSIDERATION FOR IT, LIKE GENERAL PERMISSION, AND FOR THE UNKNOWN, AND FOR THE NON-EXISTENT, ACCORDING TO THE MORE CORRECT VIEW IN ALL THAT. THEN THE NARRATORS: IF THEIR NAMES AGREE, AND THEIR FATHERS' NAMES AND UPWARDS, BUT THEIR PERSONS DIFFER: IT IS THE AGREED AND SEPARATED (MUTTAFIQ WA MUFTARIQ). IF THE NAMES AGREE IN WRITING BUT DIFFER IN PRONUNCIATION: IT IS THE CONSONANT AND DISSONANT (MU'TALIF WA MUKHTALIF). IF THE NAMES AGREE AND FATHERS DIFFER, OR VICE VERSA: IT IS THE RESEMBLING (MUTASHABIH). LIKEWISE IF AGREEMENT OCCURS IN THE NAME AND FATHER'S NAME, AND DIFFERENCE IN LINEAGE. TYPES ARE COMPOSED OF IT AND WHAT PRECEDED IT: AMONG THEM IS THAT AGREEMENT OR RESEMBLANCE OCCURS EXCEPT IN A LETTER OR TWO, OR BY ADVANCING AND DELAYING OR THE LIKE. \nHis saying: (AND FORMULAS OF PERFORMANCE: 'I HEARD' AND 'HE TOLD ME'; THEN 'HE INFORMED ME' AND 'I READ TO HIM'; THEN 'IT WAS READ TO HIM WHILE I LISTENED'; THEN 'HE INFORMED ME'; THEN 'HE HANDED ME'; THEN 'HE SPOKE TO ME'; THEN 'HE WROTE TO ME'; THEN 'FROM', AND THE LIKE. THE FIRST TWO: FOR WHOEVER HEARD ALONE FROM THE SHEIKH'S WORDING. IF HE WAS WITH OTHERS, THEN 'WITH OTHERS'): The first two means: Sami'tu and Haddathani. His saying: (IF HE WAS WITH OTHERS) meaning Sami'na and Haddathana. His saying: (THE FIRST IS THE MOST EXPLICIT AND HIGHEST IN DICTATION) is the saying: Sami'tu (I heard).",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 74
  },
  {
    "serial_number": "3339033",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "His saying: (AND 'INBA'' (INFORMING) MEANS 'IKHBAR' (INFORMING), EXCEPT IN THE USAGE OF LATE SCHOLARS, IT IS FOR PERMISSION (IJAZAH) LIKE 'AN' (FROM)): The origin is that there is no difference between saying: Sami'tu, Haddathani, or Sami'na, Haddathana, or Akhbarani or Akhbarana. The origin is there is no difference between them. Yahya bin Sa'id explicitly stated this as narrated by Al-Khatib Al-Baghdadi in his book *Al-Kifayah*. There is no difference between Sami'tu, Sami'na, Haddathani, Haddathana, Akhbarani, Akhbarana. Imam Ahmed - may Allah have mercy on him - mentioned something similar, unless it becomes clear that a scholar has a specific terminology; otherwise, the default is no difference between these formulas.\nHis saying: (AND THE 'AN'ANAH' OF A CONTEMPORARY IS CONSTRUED AS HEARING EXCEPT FROM A MUDALLIS. IT IS SAID: PROOF OF THEIR MEETING IS A CONDITION - EVEN IF ONCE - AND THIS IS THE CHOSEN VIEW): Scholars disputed regarding the 'An'anah' of a contemporary whose meeting and hearing from his Sheikh is not proven. Two men were contemporaries and it was possible for the student to hear from his Sheikh or for one to hear from the other, but it did not come in any path that one heard from the other, rather he narrated with a formula allowing for hearing; this is called 'An'anah of the Contemporary'. Imam Muslim - may Allah have mercy on him - went in his Introduction to the view that 'An'anah' of a contemporary is valid and accepted. Imam Al-Bukhari went to the view that 'An'anah' of a contemporary is not accepted until meeting (Liqa') is proven. Al-Bukhari's view is more correct; in fact, Ibn Rajab narrated it as consensus among Hadith scholars before Imam Muslim, as he narrated in the explanation of *Al-Arba'in* and in the explanation of *Al-Ilal*. Hadith scholars are unanimous on Al-Bukhari's condition, that the 'An'anah' of a contemporary is not accepted until his meeting with him is proven even once, either by explicitly declaring hearing or something similar. This is confirmed by the fact that even if a narrator is free from Tadlis (obfuscation), he might not be free from Hidden Irsal (sending). This cannot be regulated except by proving meeting. If meeting is proven even once and he is not described as a Mudallis, the default is his narration is accepted. Because it was previously mentioned that Tadlis applies to known Tadlis and Hidden Irsal, but it might not apply to Hidden Irsal, and he is not called a Mudallis even if he has Hidden Irsal in the sense mentioned by Hafiz Ibn Hajar as previously explained. And Tadlis might be applied to one who has Hidden Irsal. So the point is Al-Bukhari's condition is more correct, and this is what early Hadith scholars before Imam Muslim were upon. Abu Hatim said: Agreement of Hadith scholars is proof. This is strengthened by the fact that it blocks the door for those of Hidden Irsal, as Ibn Hajar explained in *Al-Nukat ala Ibn al-Salah*. I draw attention to issues:",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 75
  },
  {
    "serial_number": "3339034",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "• Issue One: If a Mudallis explicitly declares hearing, his hadith is accepted by consensus. Ibn Abd al-Barr narrated the consensus, and the words of early scholars indicate it.\n• Issue Two: A narrator might say in a hadith: \"So-and-so told us\" or \"So-and-so told me\" or \"So-and-so informed me\"... etc., and it is a mistake by him, as Imam Ahmed and others explained regarding a group of narrators. Ibn Rajab quoted some of that in the explanation of *Al-Ilal*. Therefore, if Hadith scholars say: His saying \"Haddathana\" or \"Sami'tu\" is a mistake, their word is final.\n• Issue Three: A narrator's hearing from another narrator might not be proven, but his hadith is accepted due to an indicator (Qarinah). It was previously mentioned that what is proven to be disconnected is accepted [in certain contexts or if supported], so how about what is not so regarding unproven meeting? Thus, accepting Imam Muslim's condition does not necessitate that he built his Sahih on it, because he takes precaution in the Sahih, so he does not include except what is not like that [disconnected] or what is like that but indicators pointed to its acceptance. Therefore, when Ibn Rajab preferred this view - which is Al-Bukhari's condition - he said: And a hadith where meeting is not proven might be accepted, meaning by indicators as previously explained.\nHis saying: (THEY APPLIED 'MUSHAFAHAH' (ORAL TRANSMISSION) TO SPOKEN PERMISSION, AND 'MUKATABAH' (CORRESPONDENCE) TO WRITTEN PERMISSION): Mushafahah: Meaning so-and-so spoke to me. And Spoken: Meaning saying \"I permitted you\" or \"I permitted those present.\" Mukatabah: He wrote a permission to so-and-so, so he says \"He corresponded with me.\"\nHis saying: (THEY STIPULATED FOR THE VALIDITY OF 'MUNAWALAH' (HANDING OVER) ITS ASSOCIATION WITH PERMISSION TO NARRATE, AND IT IS THE HIGHEST TYPE OF PERMISSION): If a Sheikh hands his books to his student but does not permit him to narrate, they said: The student's narration from his Sheikh's books which he handed to him is not considered if he did not permit him. This is the majority view. There is a second view in the issue: That it is considered, and this is the default, unless it becomes clear by an indicator that there is something in the books; otherwise, the default is it is considered - and Allah knows best. That is like Wijadah (finding). Muslim narrated from the hadith of Makhramah bin Bukayr from his father, and Makhramah bin Bukayr found his father's books and narrated from them without permission from his father, because he found them after his father's death. Imam Muslim accepted it, and narrated several hadiths from that in Sahih Muslim, including: What Muslim narrated from the hadith of Aisha: \"There is no day on which Allah frees servants more than the Day of Arafah, and indeed He draws near to the servants...\" This is from the narration of Makhramah bin Bukayr from his father. Muslim placed it in the principles (Usul) and not",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 76
  },
  {
    "serial_number": "3339035",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "in the witnesses (Mushahadat) and followers (Tawabi'), but rather placed it in the principles and relied on it due to his validation of narration by Wijadah, along with other hadiths. Therefore, the more correct view - and Allah knows best - is the second view, that if he hands to his student, or [the student] finds his Sheikh's books... etc., the default is it is valid to narrate from them unless it becomes clear there is something [wrong] in the books.\nHis saying: (LIKEWISE, THEY STIPULATED PERMISSION IN 'WIJADAH', 'WASIYYAH' OF A BOOK, AND 'I'LAM', OTHERWISE THERE IS NO CONSIDERATION FOR IT, LIKE GENERAL PERMISSION, AND FOR THE UNKNOWN, AND FOR THE NON-EXISTENT, ACCORDING TO THE MORE CORRECT VIEW IN ALL THAT): Stipulating permission in Wijadah is the majority view; otherwise, there is a second view in the issue that permission is not a condition, and it is the correct view as previously mentioned. Examples of narrators: Makhramah bin Bukayr from his father. His saying: (AND 'WASIYYAH' OF A BOOK): That he bequeaths his books upon his death to his son or his student so-and-so, but does not permit him to narrate. Or he bequeaths his books upon his travel to his student so-and-so, but does not permit him to narrate. According to the correct view, narration is valid for him even without permission. His saying: (AND IN 'I'LAM', OTHERWISE THERE IS NO CONSIDERATION FOR IT): Meaning it is known he has books, so he says to one of his students: \"I have books,\" and informs him of his books, but did not permit him to narrate. His student found these books; he has the right to narrate from these books. Clearer than this is if the Sheikh informs his student that he narrates from Sheikh so-and-so and that he heard from so-and-so; his informing him is considered. Similarly in what was mentioned before, if he informs him he has books from so-and-so and did not permit him to narrate from him, it is also considered. His saying: (OTHERWISE THERE IS NO CONSIDERATION FOR IT) meaning without permission; this is the majority view and the correct view is opposite as mentioned. His saying: (OTHERWISE THERE IS NO CONSIDERATION FOR IT) meaning like that which is not considered (LIKE GENERAL PERMISSION, AND FOR THE UNKNOWN, AND FOR THE NON-EXISTENT, ACCORDING TO THE MORE CORRECT VIEW IN ALL THAT). In General Permission he says: \"I permitted the people of Medina\" or \"I permitted Muslims generally.\" This is not considered. He may also permit an unknown person, saying: \"I permitted a man,\" and this man is unknown not recognized. Or he says: \"I permitted Muhammad.\" This is Neglected (Muhmal) and is a type of Unknown. As for the Non-existent, like saying: \"I permitted the children of so-and-so if they are born.\" And they do not exist. His saying: (ACCORDING TO THE MORE CORRECT VIEW IN ALL THAT): Regarding Ijazah (Permission), the matter is as Al-Hafiz mentioned. As for what preceded regarding Wasiyyah, Munawalah, Wijadah... etc., the correct view is the Sheikh's permission is not stipulated - and Allah knows best. \nThen I warn against exaggeration in Ijazat (Licenses). Sheikh Muhammad Nasir al-Din al-Albani used to condemn these licenses that spread in these later times. Also, the great scholar and Hafiz Sheikh Abdullah Al-Duwaish - may Allah have mercy on him - used to condemn these licenses and say: There is no benefit in them. And he spoke the truth - may Allah have mercy on him. Many students are eager for these licenses and may travel East",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 77
  },
  {
    "serial_number": "3339036",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "and West and waste their time to obtain an Ijazah from so-and-so. Such things have absolutely no benefit. In fact, sometimes you meet a Sheikh and he says: \"I permitted you with all my narrations,\" while perhaps you can barely read a line. So the student becomes afflicted with vanity and might exaggerate this Ijazah, and might get tired. These Ijazat might harm the student by causing vanity, or harm him by expending great effort to obtain them, wasting his time. They might not harm him but they are of no benefit. Some say: This is preservation of Isnad (Chain of Transmission) which is a characteristic of this Ummah... However, it should be known that Isnad is desired for other than itself, not for itself; it is desired for preserving the Prophetic Hadith, so it is not desired for itself. One should not exaggerate in these Ijazat nor waste times nor squander them in acquiring them.\nHis saying: (THEN THE NARRATORS: IF THEIR NAMES AGREE, AND THEIR FATHERS' NAMES AND UPWARDS, BUT THEIR PERSONS DIFFER: IT IS THE AGREED AND SEPARATED [MUTTAFIQ WA MUFTARIQ], IF THE NAMES AGREE IN WRITING BUT DIFFER IN PRONUNCIATION: IT IS THE CONSONANT AND DISSONANT [MU'TALIF WA MUKHTALIF]): Agreed and Separated is broader than what Al-Hafiz mentioned. The meaning of Agreed and Separated: Similarity occurring in narrators until it is thought they are one, while they are two persons. They might agree in Kunyas (nicknames), in Lineage, in Name and Father's Name and Lineage, or in Name and Father's Name. The unifying factor is that they are thought to be one narrator, while in reality, they are two or more narrators. \nHis saying: (IF THE NAMES AGREE IN WRITING BUT DIFFER IN PRONUNCIATION: IT IS THE CONSONANT AND DISSONANT [MU'TALIF WA MUKHTALIF]): Like Muhammad bin 'Aqil, as Al-Hafiz - may Allah have mercy on him - explained in his commentary *Nuzhat al-Nazar*, saying: Like Muhammad bin 'Aqil - with Fatha on 'Ayn - and Muhammad bin 'Uqil - with Damma. The first is Naysaburi, the second Faryabi. Both are famous and their class (Tabaqah) is close.\nHis saying: (IF THE NAMES AGREE AND FATHERS DIFFER, OR VICE VERSA: IT IS THE RESEMBLING [MUTASHABIH]): The Resembling combines the Agreed and Separated with the Consonant and Dissonant; meaning there is agreement in things and difference in things, so it is called Resembling.\nHis saying: (LIKEWISE IF AGREEMENT OCCURS IN THE NAME AND FATHER'S NAME, AND DIFFERENCE IN LINEAGE. TYPES ARE COMPOSED OF IT AND WHAT PRECEDED IT: AMONG THEM IS THAT AGREEMENT OR RESEMBLANCE OCCURS EXCEPT IN A LETTER OR TWO, OR BY ADVANCING AND DELAYING OR THE LIKE): His saying: (EXCEPT IN A LETTER OR TWO) like: Muhammad bin Sayyar and Muhammad bin Sinan. His saying: (OR BY ADVANCING AND DELAYING) like: Al-Aswad bin Yazid and Yazid bin Al-Aswad, and so on.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 78
  },
  {
    "serial_number": "3339037",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "Scholars wrote works on this so that narrators would not be confused with one another, thinking a trustworthy one is weak or a weak one is trustworthy.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 79
  },
  {
    "serial_number": "3339038",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "Al-Hafiz Ibn Hajar - may Allah have mercy on him - said: CONCLUSION. AND IT IS IMPORTANT: TO KNOW THE LAYERS (TABAQAT) OF NARRATORS, THEIR BIRTHS, DEATHS, LANDS, AND CONDITIONS: REGARDING MODIFICATION (TA'DIL), WOUNDING (JARH), AND IGNORANCE (JAHALAH). AND RANKS OF WOUNDING: THE WORST IS: DESCRIPTION WITH 'AF'AL' (SUPERLATIVE), LIKE 'AKDHAB AL-NAS' (MOST LYING OF PEOPLE), THEN 'DAJJAL' (IMPOSTOR), OR 'WADDA' (FABRICATOR), OR 'KADHDHAB' (LIAR). AND THE EASIEST IS: 'LAYYIN' (SOFT/PLIABLE), OR 'SAYYI' AL-HIFZ' (BAD MEMORY), OR 'FIHI MAQAL' (IN HIM IS SPEECH). AND RANKS OF MODIFICATION: THE HIGHEST IS: DESCRIPTION WITH 'AF'AL' (SUPERLATIVE): LIKE 'AWTHAQ AL-NAS' (MOST TRUSTWORTHY OF PEOPLE), THEN WHAT IS EMPHASIZED WITH AN ATTRIBUTE OR TWO, LIKE 'THIQAH THIQAH' (TRUSTWORTHY TRUSTWORTHY), OR 'THIQAH HAFIZ' (TRUSTWORTHY MEMORIZER). AND THE LOWEST IS: WHAT INDICATES NEARNESS TO THE EASIEST WOUNDING, LIKE: 'SHEIKH'. AND VOUCHING (TAZKIYAH) IS ACCEPTED FROM ONE WHO KNOWS ITS CAUSES, EVEN FROM ONE PERSON, ACCORDING TO THE MORE CORRECT VIEW. AND WOUNDING TAKES PRECEDENCE OVER MODIFICATION IF IT IS ISSUED EXPLAINED BY ONE WHO KNOWS ITS CAUSES. IF IT IS DEVOID OF MODIFICATION: IT IS ACCEPTED GENERALLY, ACCORDING TO THE CHOSEN VIEW. \nHis saying: (CONCLUSION: AND IT IS IMPORTANT TO KNOW THE LAYERS OF NARRATORS, THEIR BIRTHS, DEATHS, LANDS, AND CONDITIONS: REGARDING MODIFICATION, WOUNDING, AND IGNORANCE): As for the layers of narrators, it should be known that there is no specific criterion for narrator layers. Rather, they are those who share something. Some scholars wrote and made everyone who gathered in ten years a layer, like the practice of Al-Dhahabi in *Tarikh al-Islam*. Others made a generation a layer, like Ibn Hibban in his book *Al-Thiqat* and Al-Dhahabi in *Tarikh al-Islam*. Others made those who gathered in forty years a layer, as Ibn Kathir quoted in his book *Mukhtasar Ulum al-Hadith* from some of them. So, it has no specific criterion. The goal of layers is to distinguish narrators, because two narrators might share one name, so this one is in a layer and that one in another layer, so you find they are two narrators. This was needed greatly before. But for us, after the existence of these indexed books arranged wonderfully alphabetically, then the electronic libraries came, it has become much easier, so we don't need this much, praise be to Allah. His saying: (AND THEIR BIRTHS AND DEATHS AND LANDS...) this is to distinguish narrators from one another. I emphasize that after the existence of these facilities and printing books indexed alphabetically, then the electronic libraries came, it became much easier.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 80
  },
  {
    "serial_number": "3339039",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "His saying: (REGARDING MODIFICATION, WOUNDING, AND IGNORANCE): Narrator modification, wounding, and ignorance are known by referring to biographical books, and it has been facilitated, praise be to Allah, as mentioned. \nHis saying: (AND RANKS OF WOUNDING): The default in this topic is that it is linguistic. Hadith scholars do not have a consistent terminology. Meaning if they say: \"Thiqah Thiqah\" (Trustworthy Trustworthy), linguistically this is higher than saying: \"Thiqah\". And their saying: \"Awthaq al-Nas\" (Most Trustworthy of People), linguistically this is a higher degree than saying: \"Thiqah\". So the default in this topic is that it is linguistic, unless it becomes clear that Hadith scholars have a terminology, like saying: \"Sheikh\". For \"Sheikh\" is the lowest rank of the trustworthy as Abu Hatim explained in his book *Al-Jarh wa Al-Ta'dil*, or that Hadith scholars have a specific terminology in some words. But that they have a general terminology in all words covering all Hadith scholars, this is not known unless some of them explicitly stated things over others. \nHis saying: (AND RANKS OF MODIFICATION: THE HIGHEST IS: DESCRIPTION WITH 'AF'AL' (SUPERLATIVE): LIKE 'AWTHAQ AL-NAS', THEN WHAT IS EMPHASIZED WITH AN ATTRIBUTE OR TWO, LIKE 'THIQAH THIQAH', OR 'THIQAH HAFIZ'. AND THE LOWEST IS: WHAT INDICATES NEARNESS TO THE EASIEST WOUNDING, LIKE: 'SHEIKH'): So I emphasize that the default in these topics is that they are linguistic topics unless it becomes clear there is a special terminology. After this, I draw attention to matters: \nMatter One: If we want to accept a scholar's statement, we must know the proven chain to him. A scholar might say something about another scholar but the chain to him is not proven, as came from Ibn Abbas that he called Ikrimah a liar; this chain is not authentic as Ibn Rajab explained in the explanation of *Al-Ilal* and Ibn Hajar in *Hady al-Sari*. This is needed during severe contradiction. But if their words concur on weakening or authentication, such [verification] is not needed. Also, some books' authors guaranteed the authenticity of the chain [to the critic], like Al-Mizzi in his book *Tahdhib al-Kamal* and Ibn Hajar in *Tahdhib al-Tahdhib* as Al-Mu'allimi - may Allah have mercy on him - explained. \nMatter Two: One should scrutinize when scholars' statements conflict regarding a term different from the scholars' description by way of answer to a question. Sometimes it might be a question and the answer was such. Or it might be a comparison between two narrators so he answered with this. So scrutiny is needed in such cases. He might be severe in stating his weakness because he was compared to a great trustworthy man, and other meanings. So if conflict occurs, one must scrutinize",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 81
  },
  {
    "serial_number": "3339040",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "the method of questioning. Al-Mu'allimi - may Allah have mercy on him - pointed to this meaning in his book *Al-Tankil* while answering some problems raised by the Jahmi Al-Kawthari. \nMatter Three: Some scholars have special terminologies that must be noted. Like Ibn Ma'in, for example, if he says: \"Laysa bi-shay'\" (He is nothing), he intends he is weak OR he intends he has few narrations, as Ibn al-Qattan al-Fasi explained in his book *Bayan al-Wahm wa al-Iham*. Some express with two terms and the difference is not noticed, like saying regarding a narrator: \"Laysa bi-al-Qawi\" (Not the strong one) and \"Laysa Qawiyyan\" (Not strong). Their saying \"Laysa bi-Qawi\" is weaker than \"Laysa Qawiyyan\". The reference for this is the language, and Al-Mu'allimi - may Allah have mercy on him - explained this in his book *Al-Tankil*. So the special terminologies of scholars must be known as mentioned about Ibn Ma'in. \nMatter Four: Some scholars are interested in this field - Jarh and Ta'dil - like Yahya bin Ma'in. Therefore, if a Sheikh sees him, he might beautify himself with the best hadith, so Yahya is deceived by him. Thus, if you see the words of scholars concurring on a meaning except Yahya bin Ma'in, it might be of this nature, as Al-Mu'allimi explained in his book *Al-Tankil*. \nMatter Five: Scholars vary in their strictness. Some scholars are strict in wounding like Abu Hatim, Ibn Kharash, and Yahya bin Sa'id. Some are moderate like Ibn Mahdi and Imam Ahmed. Some are lax as mentioned like Ibn Hibban and Al-Ijli regarding Successors. So the layers of scholars and degrees of scholars in laxity and strictness must be known. This helps during conflict, for the man's method of laxity or strictness or moderation has an effect on him. Al-Dhahabi mentioned this in his book *Al-Muqizah*. If the statement of a strict one conflicts with a moderate one, the moderate one is prioritized, and so on. Some scholars are strict in one thing but not another, like Ibn Hibban; he is severe in wounding, such that he is destructive (Khassaf) in wounding; if he finds the man's illusions he destroys him. Conversely, he is lax in authenticating unknown narrators. So knowing the method and terminology of scholars is important. This is known by extensive reading. What helps is reading extensively in scholars' books and Terminology books. Among the most useful is Al-Sakhawi's book *Fath al-Mughith* because it is distinguished by many quotations, and the book *Al-Nukat ala Muqaddimat Ibn al-Salah* by Hafiz Ibn Hajar, for it is distinguished by quotations and abundant criticism. Reading Ibn Rajab's explanation of *Al-Ilal*, for it has precious benefits. Reading *Bayan al-Wahm wa al-Iham* by Ibn al-Qattan al-Fasi, for it has very important scattered benefits. Reading the two Series (*Silsilahs*) and *Irwa' al-Ghalil* and the detailed graduation (Takhrij)",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 82
  },
  {
    "serial_number": "3339041",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "of Sunan Abi Dawood by Sheikh Nasir al-Din al-Albani, for it contains great treasures. Reading all available books of scholars and extracting and collecting these benefits. Reading the book *Tali'at al-Tankil* and *Al-Tankil* by the scholar Al-Mu'allimi, and Al-Mu'allimi's footnotes on *Al-Fawa'id al-Majmu'ah*, and Al-Mu'allimi's refutation of Abu Rayyah, and other such useful books, for they contain precious and scattered benefits. Therefore, by extensive reading, the student can gather scattered points and benefits. \nHis saying: (AND VOUCHING [TAZKIYAH] IS ACCEPTED FROM ONE WHO KNOWS ITS CAUSES, EVEN FROM ONE PERSON, ACCORDING TO THE MORE CORRECT VIEW): If a scholar who knows the causes of modification vouches for and modifies someone, even if only one, it is accepted, because he is trustworthy and knowledgeable, so his word is accepted. The word of one person is accepted regarding the Unknown narrator to modify or wound him, because this Unknown has no modification or wounding; he is devoid of modification and wounding. So if a trustworthy scholar knowing the causes of wounding authenticates or wounds him, his word is accepted. \nHis saying: (AND WOUNDING TAKES PRECEDENCE OVER MODIFICATION IF IT IS ISSUED EXPLAINED BY ONE WHO KNOWS ITS CAUSES. IF IT IS DEVOID OF MODIFICATION: IT IS ACCEPTED GENERALLY, ACCORDING TO THE CHOSEN VIEW): If wounding and modification conflict, there are two cases:\n• Case One: They conflict and the reason is not mentioned; modification takes precedence.\n• Case Two: The reason is mentioned and it is a clear, explained, proven reason; wounding takes precedence. If the reason is not mentioned or an unsupported reason is mentioned, one returns to modification. \nHe attributed this to the majority of scholars and preferred it. This is extremely useful in many disputes that occur regarding some men. A scholar might say: \"This one is a partisan (Hizbi),\" or \"innovator,\" or \"misguided,\" with a general wound, while others authenticated him. The word of that man is not accepted unless with two conditions:\n• Condition One: That he be known for moderation, knowledge, cognizance, justice, and fairness.\n• Condition Two: That he mentions his evidence for this. If he brings evidence, fine; otherwise, it is not accepted.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 83
  },
  {
    "serial_number": "3339042",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "Al-Hafiz Ibn Hajar - may Allah have mercy on him - said: CHAPTER. AND IT IS IMPORTANT: TO KNOW THE KUNYAS OF THOSE NAMED, AND THE NAMES OF THOSE KNOWN BY KUNYAS, AND WHOSE NAME IS HIS KUNYA, AND WHOSE KUNYA IS DISPUTED, AND WHO HAS MANY KUNYAS OR DESCRIPTIONS, AND WHOSE KUNYA AGREES WITH HIS FATHER'S NAME, OR VICE VERSA, OR HIS KUNYA IS HIS WIFE'S KUNYA, AND WHO IS ATTRIBUTED TO OTHER THAN HIS FATHER, OR TO HIS MOTHER, OR TO OTHER THAN WHAT COMES TO MIND, AND WHOSE NAME AND FATHER'S AND GRANDFATHER'S NAME AGREE, OR HIS SHEIKH'S NAME AND HIS SHEIKH'S SHEIKH'S NAME AND UPWARDS. AND WHOSE SHEIKH'S NAME AND THE NARRATOR FROM HIM AGREE. AND KNOWLEDGE OF ABSTRACT AND SINGULAR NAMES, KUNYAS, TITLES, AND LINEAGES. THEY OCCUR RELATING TO TRIBES AND HOMELANDS: LANDS, OR FARMS, OR ALLEYS, OR PROXIMITY; AND TO CRAFTS AND TRADES. AGREEMENT AND RESEMBLANCE OCCUR IN THEM LIKE NAMES, AND THEY MAY OCCUR AS TITLES. AND KNOWLEDGE OF THE CAUSES OF THAT. AND KNOWLEDGE OF CLIENTS (MAWALI) FROM ABOVE AND FROM BELOW: BY SLAVERY, OR BY ALLIANCE. AND KNOWLEDGE OF BROTHERS AND SISTERS. AND KNOWLEDGE OF THE MANNERS OF THE SHEIKH AND STUDENT, AND THE AGE OF ENDURANCE AND PERFORMANCE, AND THE MANNER OF WRITING HADITH, ITS PRESENTATION, HEARING IT, RECITING IT, TRAVELING FOR IT, AND CLASSIFYING IT: EITHER ON MASANID, OR CHAPTERS, OR ILLS (ILAL), OR PARTS (ATRAF). AND KNOWLEDGE OF THE CAUSE OF HADITH: SOME SHEIKHS OF JUDGE ABU YA'LA IBN AL-FARRA' WROTE ON IT. THEY WROTE ON MOST OF THESE TYPES. THEY ARE PURE TRANSMISSION, APPARENT IN DEFINITION, NEEDING NO EXAMPLES, AND ENUMERATING THEM IS DIFFICULT: SO LET THEIR DETAILED WORKS BE REVIEWED. AND ALLAH IS THE GRANTER OF SUCCESS AND THE GUIDE, THERE IS NO GOD BUT HIM. \nEverything mentioned previously regarding knowledge of Kunyas and Lineages... etc., was extremely important in the past. But after the existence of books facilitated by indexes alphabetically and otherwise, then electronic libraries, we do not need to memorize this; because as soon as you encounter a man you need to check, you return to these books. Beware of relying on your memory, for memory is treacherous. Ali bin al-Madini said: My master Ahmed bin Hanbal ordered me not to narrate except from a book, for memory is treacherous. Some, when they see a chain and want to judge it, become lax and say: In the chain is Hisham bin Hassan who is trustworthy, narrating from Al-Hasan Al-Basri who is trustworthy... etc., so the hadith is authentic. His action is wrong and lax, for there is no doubt Hisham bin Hassan is trustworthy, but from Al-Hasan Al-Basri he is weak.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 84
  },
  {
    "serial_number": "3339043",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 82,
    "volume_number": 1,
    "text": "Similarly, one might see the 'An'anah' of Ibn Jurayj and reject it because he is a Mudallis, which is true, but his narration in the chain might be from Ata', and Ibn Jurayj's narration from Ata' is accepted even if he uses 'An', for he does not practice Tadlis from Ata'. Such matters are not known except by referring to biographical books. So the student must expand, and it is not sufficient to refer to the book *Taqrib al-Tahdhib*; although useful for knowing Al-Hafiz's summary judgment, we treat it like other scholars' judgments to reach a conclusion. I emphasize: Beware of relying on memory. Even if assumed the men are trustworthy, it remains: did they hear from each other or not? Then if assumed they heard from each other, it remains: did the early Hafizs criticize this text or not? For in some hadiths, a student hears from his Sheikh except this specific hadith he did not hear from him. Examples include the hadith of Tashahhud; Al-Nasa'i narrated from Ibn Masud that he said: \"We used to stand before the Tashahhud was obligated upon us...\" The chain appears authentic, and many late scholars concurred on authenticating it, except that Imam Ahmed clarified in *Al-Ilal* that Sufyan bin Uyainah did not hear it from his Sheikh. This is a subtle defect that only becomes clear by referring to books of Ilal (Defects). So looking at the trustworthiness of narrators is not enough; one must return to books of Ilal. \nAs for Manners (Adab), it is extremely important. The student of knowledge should strive to acquire manners and not be content with the habits he was raised on. He should read books of manners like *Adab al-Talab* to beautify and improve himself with manners. We are in dire need of manners, whether we are old or young. We continue to read on manners and learn manners to beautify ourselves with manners, like manners of learning, manners of seeking, etc. I ask Allah to beautify us with manners and improve our character, O Lord of the Worlds. \nHis saying: (AND THE AGE OF ENDURANCE [TAHAMMUL] AND PERFORMANCE [ADA']): There is a difference between Endurance and Performance. According to the most correct scholarly views, if a narrator is discerning (Mumayyiz), his endurance is valid. Even if he was a disbeliever, his endurance is valid, but his performance is not accepted until after Islam, and that is after puberty. So one must differentiate between the age of endurance and the age of performance. \nHis saying: (AND THE MANNER OF WRITING HADITH, ITS PRESENTATION, HEARING IT, RECITING IT, TRAVELING FOR IT, AND CLASSIFYING IT: EITHER ON MASANID, OR CHAPTERS, OR ILLS, OR PARTS): As for the manner of writing hadith, presenting it, hearing it, and reciting it, I think we do not need this as we are not in the time of writing hadith [manually like before].",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 85
  },
  {
    "serial_number": "3339044",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Idamat al-Nazar fi Tahrir Nukhbat al-Fikar",
    "edition": "None",
    "publisher": "None",
    "page_number": 83,
    "volume_number": 1,
    "text": "His saying: (TRAVELING FOR IT): Traveling for seeking knowledge is extremely useful, and it is a path to acquiring knowledge. Thus scholars were people of travel. However, it is desired for other than itself, not for itself. Imam Malik, the Imam of the World, was not known for travel because he was in Medina and people used to come to Medina, and he took knowledge from them. As for scholars known for travel like Imam Ahmed, Ibn Ma'in, Abu Hatim, and others, travel for knowledge is a great worship. Jabir traveled a month for one hadith as Al-Bukhari noted. It is a great worship, but I emphasize it is desired for other than itself, not for itself. \nHis saying: (AND KNOWLEDGE OF THE CAUSE OF HADITH: SOME SHEIKHS OF JUDGE ABU YA'LA IBN AL-FARRA' WROTE ON IT): The cause of hadith is important in knowing the meaning of the hadith, but many causes are not authentic from the Prophet, peace be upon him. What is authentic among them is useful in knowing the meaning of the hadith, like causes of revelation in verses. \nHis saying: (THEY WROTE ON MOST OF THESE TYPES. THEY ARE PURE TRANSMISSION, APPARENT IN DEFINITION, NEEDING NO EXAMPLES, AND ENUMERATING THEM IS DIFFICULT: SO LET THEIR DETAILED WORKS BE REVIEWED. AND ALLAH IS THE GRANTER OF SUCCESS AND THE GUIDE, THERE IS NO GOD BUT HIM): He spoke the truth, for scholars did not fall short, and they wrote many books in every art - may Allah have mercy on them broadly. \nI conclude by clarifying the Stance on Books of Terminology (Mustalah). Someone might say: You mentioned many errors mentioned by Terminology scholars, does this mean we leave them, abandon them, and fight them? It is said: No. We should be moderate in this matter, neither excessive nor negligent. We should not be like those who exaggerated in fighting Terminology books, praising their opposition and calling for not reading them. Nor, on the other hand, should we be among those who exaggerated in attachment to them, making them their path and beacon. Rather, we should be as the people of knowledge were, making annotations/critiques. So read Terminology books, understand them, and clarify the error, without excess or negligence. For they contain treasures and benefits that only Allah knows. I ask Allah to forgive us all, and to make this explanation an argument for us not against us, and I ask Allah to forgive Hafiz Ibn Hajar - may Allah have mercy on him - and to gather me, you, him, and our parents in the Highest Paradise, O Lord of the Worlds.",
    "foot_note": "None",
    "book_id": "270",
    "new_page_number": 86
  }
]