[
  {
    "text": "حكمة الإشراق في كتّاب الآفاق\nالمؤلف: محمد بن محمد بن عبد الرزاق الحسيني أبو الفيض الملقب بمرتضى الزبيدي\nسنة الوفاة: 1205",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "category_id": "29",
    "category": "كتب اللغة",
    "new_page_number": 1
  },
  {
    "text": "sn: 6988\nbook_title: حكمة الإشراق في كتّاب الآفاق [مطبوع ضمن كتاب «نوادر المخطوطات»]\nbook_link: https://shamela.ws/book/984\nbook_id: 984\nauthor_name: محمد بن محمد بن عبد الرزاق الحسيني أبو الفيض الملقب بمرتضى الزبيدي\nauthor_year: 1205\nnickname: أبو الفيض\nauthor_link: https://shamela.ws/author/906\nauthor_ID: 906\neditor: عبد السلام هارون (تحقيق)\npublisher: شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر\nedition: الثانية، 1393 هـ‍ - 1972 م\npages: 52\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: كتب اللغة\ncategory_id: 29",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "category_id": "29",
    "category": "كتب اللغة",
    "new_page_number": 2
  },
  {
    "serial_number": "6337031",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: كتب اللغة الكتاب : حكمة الإشراق في كتّاب الآفاق [ مطبوع ضمن كتاب « نوادر المخطوطات »] المؤلف : محمد مرتضى الزبيدي تحقيق : عبد السلام هارون الناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nالكتاب : حكمة الإشراق في كتّاب الآفاق [ مطبوع ضمن كتاب « نوادر المخطوطات »] المؤلف : محمد مرتضى الزبيدي تحقيق : عبد السلام هارون الناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\n[ مطبوع ضمن كتاب « نوادر المخطوطات »] المؤلف : محمد مرتضى الزبيدي تحقيق : عبد السلام هارون الناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nالمؤلف : محمد مرتضى الزبيدي تحقيق : عبد السلام هارون الناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nتحقيق : عبد السلام هارون الناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nالناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nالطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nعدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\n[ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nتاريخ النشر بالشاملة : 5 محرم 1444",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 3
  },
  {
    "serial_number": "6337032",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 49,
    "volume_number": 1,
    "text": "حكمة الإشراق إلى كتاب الآفاق جمع العبد الفقير إلى الله تعالى محمد مرتضى الحسيني عفى عنه بمنه آمين",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 4
  },
  {
    "serial_number": "6337033",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 50,
    "volume_number": 1,
    "text": "مقدمة وهذا كتاب في تاريخ الخط والخطاطين، هو امتداد لمؤلفات قديمة، من أشهرها كتاب أدب الكتاب لمحمد بن يحيى الصولي المتوفى سنة 336، وفصول طوال في فهرست ابن النديم المتوفى سنة 385، وصبح الأعشى للقلقشندي المتوفى سنة 821. وقد ألف السيد مرتضى الزبيدي هذا الكتاب مشتملا على «فضيلة الخط والقلم وما جاء فيهما من الآثار، وما للحكماء فيهما من الأسرار، وبيان من وضع الخط أولاً وألف الحروف، وألبسها حلل التفصيل وأحلها في أحسن الظروف، ثم بيان الأجلة من الكتاب والأعيان من أهل الفن». وقد جعل هذه الرسالة هدية إلى خزانة نابغة الخط الأمير حسن أفندي الملقب بالرشدى (1) . وقسمها إلى عشرة فصول وخاتمة: الفصل الأول: في ذكر من وضع الخط وأصله، ووصله وفصّله. الفصل الثاني: في فضل الخط وما قيل فيه. الفصل الثالث: في القلم، وما لهم فيه من الحكم.",
    "foot_note": "1. هو حسن أفندي بن عبد اللّه، الملقب بالرشدى، الرومي الأصل، توفى في السنة التي توفى فيها الزبيدي. قال الجبرتى في ترجمته: «مولى على آغا بشير دار السعادة، المكتب المصري، اشتراه سيده صغيرا، وهذبه ودربه وشغله بالخط فاجتهد فيه، وجوده على عبد اللّه الأنيس، وكان ليوم إجازته محفل نفيس، جمع فيه المرءوس والرئيس، ثم زوجه ابنته وجعله خليفته ولم يزل في حال حياة سيده معتكفا على المشق والتسويد، معتنيا بالتحرير والتجويد إلى أن فاق أهل عصره في الجودة في الفن، \n…. ولما توفى شيخ المكتبين المرحوم إسماعيل الوهبى جعل المترجم شيخا باتفاق منهم \n…. وألف من أجله شيخنا السيد محمد مرتضى كتاب حكمة الإشراق إلى كتاب الآفاق \n…. ولم يزل شيخا ومتكلما على جماعة الخطاطين والكتاب، وعميدهم الذي يشار إليه عند الأرباب، نسخ بيده عدة مصاحف وأحزاب. وأما نسخ الدلائل فكثرتها لا تدخل تحت الحساب، إلى أن طافت به المنية طواف الوداع، ونثرت عقد ذلك الاجتماع. وبموته انقرض نظام هذا الفن». تاريخ الجبرتى 2: 211.",
    "book_id": "984",
    "new_page_number": 5
  },
  {
    "serial_number": "6337034",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 51,
    "volume_number": 1,
    "text": "الفصل الرابع: في الدواة وصفتها وآلاتها. الفصل الخامس: في المداد والحبر. الفصل السادس: في برى الأقلام. الفصل السابع: في النقط. الفصل الثامن: في الشكل. الفصل التاسع: في ذكر حروف المعجم وسرها في تعيين العدد. الفصل العاشر: في ذكر الكتبة الكرام، من لدن زمن النبي صلى الله عليه وسلم إلى زمن المؤلف. ثم الخاتمة وفيها فصلان: الأول: في أدب التلميذ مع الشيخ. الثاني: نصيحة لسائر الخطاطين.",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 6
  },
  {
    "serial_number": "6337035",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 52,
    "volume_number": 1,
    "text": "السيد مرتضى الزبيدي والسيد مرتضى الزبيدي عالم لغوى جليل من علماء القرن الثالث عشر، أفرد له الجبرتى في تاريخه ترجمة نفيسة، آثرت أن أنقل جمهورها بلفظه ونسقه، حرصا على ما بها من تصوير كامل لحياة هذا الرجل، وصلاته برجال عصره. قال الجبرتى في ترجمته (1) : مات شيخنا علم الأعلام، والساحر اللاعب بالأفهام، الذي جاب في اللغة والحديث كل فج، وخاض من العلم كل لج، المذلّل له سبل الكلام، والشاهد له الورق والأقلام، ذو المعرفة والمعروف، وهو العلم الموصوف، العمدة الفهامة والرّحلة النسابة، الفقيه المحدّث اللغوي، النحوي الأصولىّ، الناظم الناثر الشيخ أبو الفيض السيد محمد بن محمد بن محمد بن عبد الرزاق الشهير بمرتضى الحسيني الزّبيدى (2) الحنفي. هكذا ذكر عن نفسه ونسبه. ولد سنة 1145 كما سمعته من لفظه، ورأيته بخطه. ونشأ ببلاده وارتحل في طلب العلم وحج مرارا، واجتمع بالشيخ عبد اللّه السندي، والشيخ عمر بن أحمد بن عقيل المكي، وعبد اللّه السقاف، والمسند محمد ابن علاء الدين المزجاجى، وسليمان بن يحيى، وابن الطيب. واجتمع بالسيد عبد الرحمن العيدروس بمكة، وبالشيخ عبد اللّه ميرغني الطائفي في سنة ثلاث وستين ونزل بالطائف بعد ذهابه إلى اليمن ورجوعه في سنة ست وستين، فقرأ على الشيخ عبد اللّه في الفقه وكثيرا من مؤلفاته وأجازه. وقرأ على الشيخ عبد الرحمن العيدروس مختصر السعد، ولازمه ملازمة كلية، وألبسه (الخرقة)، وأجازه بمروياته، ومسموعاته. قال: «وهو الذي شوّقنى إلى دخول مصر بما وصفه لي من علمائها وأمرائها وأدبائها، وما فيها من المشاهد الكرام، فاشتاقت نفسي لرؤياها، وحضرت مع الركب، وكان الذي كان». وقرأ عليه طرفا من الإحياء، وأجازه بمروياته.",
    "foot_note": "1. انظر عجائب الآثار 2: 196 - 210 في حوادث سنة 1205. وقد لخص هذه الترجمة الشبلنجي في نور الأبصار 214، وعلى مبارك في الخطط التوفيقية 3: 93 - 94. \n2. نسبة إلى زبيد، بفتح الزاي، وهي مدينة مشهورة باليمن.",
    "book_id": "984",
    "new_page_number": 7
  },
  {
    "serial_number": "6337036",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 53,
    "volume_number": 1,
    "text": "ثم ورد إلى مصرفى تاسع صفر سنة 1167 وسكن بخان الصاغة، وأول من عاشره وأخذ عنه السيد على المقدسي الحنفي من علماء مصر، وحضر دروس أشياخ الوقت كالشيخ أحمد الملوى، والجوهري، والحفنى، والبليدى، والصعيدى، والمدابغى وغيرهم، وتلقى عنهم وأجازوه وشهدوا بعلمه وفضله وجود حفظه. واعتنى بشأنه «كتخدا عزبان (1) ». ووالاه بره حتى راج أمره وترونق حاله واشتهر ذكره عند الخاص والعام، ولبس الملابس الفاخرة وركب الخيول المسومة. وسافر إلى الصعيد ثلاث مرات واجتمع بأكابره وأعيانه وعلمائه، وأكرمه شيخ العرب همام، وإسماعيل أبو عبد اللّه، وأبو علي، وأولاد نصير، وأولاد وافى، وهادوه وبرّوه. وكذلك ارتحل إلى الجهات البحرية مثل دمياط ورشيد والمنصورة وباقي البنادر العظيمة مرارا حين كانت مزينة بأهلها، عامرة بأكابرها، وأكرمه الجميع، واجتمع بأكابر النواحي وأرباب العلم والسلوك، وتلقى عنهم وأجازوه وأجازهم، وصنف (عدة رحلات) في انتقالاته في البلاد القبلية والبحرية تحتوى على لطائف ومحاورات ومدائح نظما ونثرا لو جمعت مجلدا ضخما، وكناه سيدنا أبو الأنوار بن وفا (بأبى الفيض)، وذلك يوم الثلاثاء سابع عشر شعبان سنة 1182 وذلك برحاب ساداتنا بنى الوفا يوم زيارة المولد المعتاد. ثم تزوج وسكن بعطفة الغسال مع بقاء سكنه بوكالة الصاغة، وشرع في (شرح القاموس) حتى أتمه في عدة سنين نحو أربعة عشر مجلدا سماه «تاج العروس» ولما أكمله (أولم وليمة حافلة) جمع فيها طلاب العلم وأشياخ الوقت بغيط المعدية وذلك في سنة 1181 وأطلعهم عليه واغتبطوا به وشهدوا بفضله وسعة اطلاعه ورسوخه في علم اللغة، وكتبوا عليه تقاريظهم نثرا ونظما». ثم ساق الجبرتى أسماء هؤلاء المقرظين، وبعض تقاريظهم، ثم قال: «ولما أنشأ محمد بيك أبو الذهب جامعه المعروف به بالقرب من الأزهر وعمل فيه خزانة للكتب، واشترى جملة من الكتب، ووضعها بها، أنهوا إليه شرح القاموس هذا وعرفوه أنه إذا وضع بالخزانة كمل نظامها، وانفردت بذلك دون غيرها، ورغّبوه في ذلك فطلبه وعوضه عنه مائة ألف درهم فضة، ووضعه فيها.",
    "foot_note": "1. معنى كتخدا: وزير الأمور الداخلية، كما جاء في تخليص الإبريز لرفاعة الطهطاوي ص 72.",
    "book_id": "984",
    "new_page_number": 8
  },
  {
    "serial_number": "6337037",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 54,
    "volume_number": 1,
    "text": "ولم يزل المترجم يخدم العلم ويرقى في درج المعالي، ويحرص على جمع الفنون التي أغفلها المتأخرون، كعلم الأنساب والأسانيد وتخاريج الأحاديث واتصال طرائق المحدثين المتأخرين بالمتقدمين. وألف في ذلك كتبا ورسائل ومنظومات وأراجيز جمة، ثم انتقل إلى منزل بسويقة اللالا، تجاه جامع محرم أفندي، بالقرب من مسجد شمس الدين الحنفي، وذلك في أوائل سنة 1189، وكانت تلك الخطة إذ ذاك عامرة بالأكابر والأعيان، فأحدقوا به وتحبب إليهم واستأنسوا به وواسوه وهادوه، وهو يظهر لهم الغنى والتعفف، ويعظهم ويفيدهم بفوائد وتمائم ورقى، ويجيزهم بقراءة أوراد وأحزاب. فأقبلوا عليه من كل جهة، وأتوا إلى زيارته من كل ناحية، ورغبوا في معاشرته لكونه غريبا وعلى غير صورة العلماء المصريين وشكلهم، (ويعرف باللغة التركية والفارسية)، بل وبعض لسان الكرج، فانجذبت قلوبهم إليه، وتناقلوا خبره وحديثه. ثم شرع في إملاء الحديث على طريق السلف في ذكر الأسانيد والرواة والمخرجين من حفظه على طرق مختلفة. وكل من قدم عليه يملى الحديث المسلسل بالأولية، وهو حديث الرحمة برواته ومخرجيه، ويكتب له سندا بذلك وإجازة وسماع الحاضرين فيعجبون من ذلك. ثم إن بعض علماء (الأزهر) ذهبوا إليه وطلبوا منه إجازة، فقال لهم: لا بد من قراءة أوائل الكتب، واتفقوا على الاجتماع بجامع شيخون بالصليبة الاثنين والخميس تباعدا عن الناس، فشرعوا في صحيح البخاري بقراءة السيد حسين الشيخونى، واجتمع عليهم بعض أهل الخطة والشيخ موسى الشيخونى إمام المسجد وخازن الكتب، وهو رجل كبير معتبر عند أهل الخطة وغيرها. وتناقل في الناس سعى علماء الأزهر مثل الشيخ أحمد السجاعى، والشيخ مصطفى الطائي، والشيخ سليمان الأكراشى وغيرهم للأخذ عنه، فازداد شأنه وعظم قدره، واجتمع عليه أهل تلك النواحي وغيرها من العامة والأكابر والأعيان، والتمسوا منه تبيين المعاني فانتقل من الرواية إلى الدراية، وصار درسا عظيما، فعند ذلك انقطع عن حضوره أكثر الأزهرية، وقد استغنى عنهم هو أيضا وصار يملى على الجماعة بعد قراءة شيء من الصحيح حديثا من المسلسلات أو فضائل الأعمال، ويسرد رجال سنده ورواته من حفظه ويتبعه (بأبيات من الشعر) كذلك، فيتعجبون من ذلك لكونهم لم يعهدوها فيما سبق في المدرسين المصريين.",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 9
  },
  {
    "serial_number": "6337038",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 55,
    "volume_number": 1,
    "text": "وافتتح درسا آخر في مسجد الحنفي، وقرأ الشمائل في غير الأيام المعهودة بعد العصر، فازدادت شهرته، وأقبلت الناس من كل ناحية لسماعه ومشاهدة ذاته، لكونها على خلاف هيئة المصريين وزيهم. ودعاه كثير من الأعيان إلى بيوتهم، وعملوا من أجله ولائم فاخرة، فيذهب إليهم مع خواص الطلبة والمقرئ والمستملى وكاتب الأسماء، فيقرأ لهم شيئا من الأجزاء الحديثية كثلاثيات البخاري أو الدارمي، أو بعض المسلسلات، بحضور الجماعة وصاحب المنزل وأصحابه وأحبابه وأولاده (وبناته ونسائه من خلف الستائر)، وبين أيديهم مجامر البخور بالعنبر والعود مدة القراءة ثم يختمون ذلك بالصلاة على النبي صلى الله عليه وسلم على النسق المعتاد، ويكتب الكاتب أسماء الحاضرين والسامعين حتى النساء والصبيان والبنات، واليوم والتاريخ، ويكتب الشيخ تحت ذلك: «صحيح ذلك». وهذه كانت طريقة المحدثين في الزمن السابق كما رأيناه في الكتب القديمة. يقول الحقير: إني كنت مشاهدا وحاضرا في غالب هذه المجالس والدروس، ومجالس أخر خاصة بمنزله ويسكنه القديم بخان الصاغة، وبمنزلنا بالصنادقية وبولاق وأماكن أخر كنا نذهب إليها للنزهة مثل غيط المعدية (والأزبكية) وغير ذلك. فكنا نشغل غالب الأوقات بسرد الأجزاء الحديثية وغيرها، وهو كثير، بثبوت المسموعات على النسخ وفي أوراق كثيرة موجودة إلى الآن. وانجذب إليه (بعض الأمراء الكبار) مثل مصطفى بيك الإسكندرانى، وأيوب بيك الدفتردار، فسعوا إلى منزله: وترددوا لحضور مجالس دروسه، وواصلوه بالهدايا الجزيلة والغلال، واشترى الجواري، وعمل الأطعمة للضيوف، وأكرم الواردين والوافدين من الآفاق البعيدة. وحضر عبد الرزاق أفندي الرئيس من الديار الرومية إلى مصر وسمع به، فحضر إليه والتمس منه الإجازة وقراءة مقامات الحريري، فكان يذهب إليه بعد فراغه من درس شيخون ويطالع له ما تيسر من المقامات ويفهمه معانيها اللغوية. ولما حضر محمد باشا عزت الكبير رفع شأنه عنده وأصعده إليه، وخلع عليه فروة سمور؛ ورتب له تعيينا من كلاره لكفايته، من لحم وسمن وأرز وحطب وخبز، ورتب له علوفة جزيلة بدفتر الحرمين والسائرة، وغلالا من الأنبار، وأنهى إلى الدولة شأنه، فأتاه مرسوم بمرتب جزيل بالضربخانة وقدره مائة وخمسون نصفا فضة في كل يوم وذلك في سنة 1191 فعظم أمره وانتشر صيته. وطلب إلى الدولة",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 10
  },
  {
    "serial_number": "6337039",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 56,
    "volume_number": 1,
    "text": "في سنة 94 فأجاب ثم امتنع، وترادفت عليه المراسلات من أكابر الدولة وواصلوه بالهدايا والتحف والأمتعة الثمينة في صناديق. وطار ذكره في الآفاق، وكاتبه ملوك النواحي من الترك والحجاز والهند واليمن والشام والبصرة والعراق وملوك المغرب والسودان وفزان والجزائر والبلاد البعيدة، وكثرت عليه الوفود من كل ناحية، وترادفت عليه منهم الهدايا والصلات والأشياء الغريبة، وأرسلوا إليه من أغنام فزان وهي عجيبة الحلقة عظيمة الجثة، يشبه رأسها رأس العجل، وأرسلها إلى أولاد السلطان عبد الحميد فوقع لهم موقعا، وكذلك أرسلوا إليه من طيور الببغا والجواري والعبيد والطواشية، فكان يرسل من طرائف الناحية إلى الناحية المستغرب ذلك عندها، ويأتيه في مقابلتها أضعافها. وأتاه من طرائف الهند وصنعاء واليمن وبلاد سرت وغيرها أشياء نفيسة، وماء الكادى، والمربيات والعود والعنبر والعطر شاه بالأرطال، وصار له عند أهل المغرب شهرة عظيمة ومنزلة كبيرة واعتقاد زائد. وربما اعتقدوا فيه (القطبانية العظمى) حتى إن أحدهم إذا ورد إلى مصر حاجا ولم يزره ولم يصله بشئ لا يكون حجه كاملا، فإذا ورد عليه أحدهم سأله عن اسمه ولقبه وبلده وخطته وصناعته وأولاده، وحفظ ذلك أو كتبه، ويستخبر هذا عن ذاك بلطف ورقة، فإذا ورد عليه قادم من قابل سأله عن اسمه وبلده فيقول له: فلان من بلدة كذا. فلا يخلو إما أن يكون عرفه من غيره سابقا، أو عرف جاره أو قريبه، فيقول له: فلان طيب؟ فيقول: نعم سيدي. ثم يسأله عن أخيه فلان وولده فلان وزوجته وابنته، ويشير له باسم حارته وداره وما جاورها، فيقوم ذلك المغربي ويقعد ويقبل الأرض تارة ويسجد تارة ويعتقد أن ذلك من باب الكشف الصريح. فتراهم في أيام طلوع الحج ونزوله مزدحمين على بابه من الصباح إلى الغروب، وكل من دخل منهم قدم بين يدي نجواه شيئا إما موزونات فضة أو تمرا أو شمعا، على قدر فقره وغناه وبعضهم يأتيه بمراسلات وصلات من أهل بلاده وعلمائها وأعيانها ويلتمسون منه الأجوبة، فمن ظفر منهم بقطعة ورقة ولو بمقدار الأنملة فكأنما ظفر بحسن الخاتمة، وحفظها معه كالتميمة، ويرى أنه قد قبل حجه وإلا فقد باء بالخيبة والندامة، وتوجه عليه اللوم من أهل بلاده، ودامت حسرته إلى يوم ميعاده. وقس على ذلك ما لم يقل. وشرع في شرح (إحياء العلوم) للغزالي، وبيض منه أجزاء وأرسل منها إلى الروم والشام والغرب ليشتهر مثل شرح القاموس ويرغب في طلبه واستنساخه.",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 11
  },
  {
    "serial_number": "6337040",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 57,
    "volume_number": 1,
    "text": "و (ماتت زوجته) في سنة 96 فحزن عليها حزنا كثيرا، ودفنها عند المشهد المعروف بمشهد السيدة رقية وعمل على قبرها مقاما ومقصورة وستورا وفرشا وقناديل ولازم قبرها أياما كثيرة، وتجتمع عنده الناس والقراء والمنشدون، ويعمل لهم الأطعمة والثريد والكسكسو والقهوة والشربات. واشترى مكانا بجوار المقبرة المذكورة وعمره بيتا صغيرا وفرشه وأسكن به أمها، ويبيت به أحيانا. وقصده الشعراء بالمراثي، فيقبل منهم ذلك ويجيزهم عليه. ورثاها هو بقصائد وجدتها بخطه بعد وفاته في أوراقه المتشتة، على طريقة شعر مجنون ليلى». وساق الجبرتى ست مقطعات للزبيدى في رثائها ثم قال: «ثم تزوج بعدها بأخرى وهي التي مات عنها وأحرزت ما جمعه من مال وغيره. ولما بلغ ما لا مزيد عليه من الشهرة وبعد الصيت وعظم القدر والجاه عند الخاص والعام وكثرت عليه الوفود من سائر الأقطار، وأقبلت عليه الدنيا بحذافيرها من كل ناحية، لزم داره واحتجب عن أصحابه الذين كان يلم بهم قبل ذلك إلا في النادر لغرض من الأغراض، وترك الدروس والإقراء واعتكف بداخل الحريم وأغلق الباب ورد الهدايا التي تأتيه من أكابر المصريين ظاهرة، وأرسل إليه مرة أيوب بيك الدفتردار مع نجله خمسين إردبا من البر، وأحمالا من الأرز والسمن والعسل والزيت وخمسمائة ريال نقود وبقج كساوى أقمشة هندية وجوخا وغير ذلك فردها، وكان ذلك في رمضان، وكذلك مصطفى بيك الإسكندرانى وغيرهما، وحضرا إليه فاحتجب عنهما ولم يخرج إليهما ورجعا من غير أن يواجهاه. ولما حضر حسن باشا على الصورة التي حضر فيها إلى مصر لم يذهب إليه، بل حضر هو لزيارته وخلع عليه فروة تليق به، وقدم له حصانا معدودا مرخنا بسرج وعباءة، قيمته ألف دينار، أعده وهيأه قبل ذلك. وكانت شفاعته عنده لا ترد، وإن أرسل إليه إرسالية في شيء تلقاها بالقبول والإجلال وقبّل الورقة قبل أن يقرأها ووضعها على رأسه ونفذ ما فيها. وأرسل مرة إلى أحمد باشا الجزار مكتوبا وذكر له فيه أنه (المهدى المنتظر) وسيكون له شأن عظيم، فوقع عنده بموقع الصدق لميل النفوس إلى الأماني، ووضع ذلك المكتوب في حجابه المقلد به مع الأحراز والتمائم، فكان يسير بذلك إلى بعض من يرد عليه ممن يدعى المعارف في الجفور والزايرجات ويعتقد صحته بلا شك. ومن قدم عليه من جهة مصر وسأله عن المترجم فإن أخبره وعرّفه أنه اجتمع به وأخذ",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 12
  },
  {
    "serial_number": "6337041",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 58,
    "volume_number": 1,
    "text": "عنه وذكره بالمدح والثناء أحبّه وأكرمه وأجزل صلته، وإن وقع منه خلاف ذلك قطّب منه وأقصاه عنه وأبعده، ومنع عنه بره ولو كان من أهل الفضائل. واشتهر ذلك عند من عرف منه ذلك بالفراسة، ولم يزل على حسن اعتقاده في المترجم حتى انقضى نحبهما. واتفق أن مولاي محمد سلطان المغرب رحمه الله وصله بصلات قبل انجماعه الأخير وتزهده، وهو يقبلها بالحمد والثناء والدعاء، فأرسل له في سنة 201 صلة لها قدر، فردّها وتورع عن قبولها وضاعت ولم ترجع إلى السلطان، وعلم السلطان ذلك من جوابه فأرسل إليه مكتوبا قرأته، وكان عندي ثم ضاع في الأوراق، ومضمونه العتاب والتوبيخ في رد الصلة، ويقول له: إنك رددت الصلة التي أرسلناها إليك من بيت مال المسلمين، وليتك حيث تورعت عنها كنت فرقتها على الفقراء والمحتاجين فيكون لنا ولك أجر ذلك، إلا أنك رددتها وضاعت. (ويلومه) أيضا على شرحه كتاب الإحياء ويقول له: كان ينبغي أن تشغل وقتك بشئ نافع غير ذلك، ويذكر وجه لومه له في ذلك وما قاله العلماء وكلاما مفحما مختصرا مفيدا. رحمه الله. وللمترجم من المصنفات خلاف شرح القاموس (1) وشرح الإحياء (2) تأليفات كثيرة منها: 1 - كتاب الجواهر المنيفة، في أصول أدلة مذهب الإمام أبي حنيفة رضى اللّه عنه مما وافق فيه الأئمة الستة (3) . وهو كتاب نفيس حافل رتبه ترتيب كتب الحديث من تقديم ما روى عنه في الاعتقاديات ثم في العمليات على ترتيب كتب الفقه. 2 - والنفحة القدسية، بواسطة البضعة العيدروسية، جمع فيه أسانيد العيدروس، وهي في نحو عشرة كراريس. 3 - والعقد الثمين، في طرق الإلباس والتلقين. 4 - وحكمة الإشراق إلى كتاب الآفاق.",
    "foot_note": "1. طبعت خمسة أجزاء منه بالمطبعة الوهبية سنة 1286. ثم طبع كاملا في عشرة أجزاء بالمطبعة الخيرية سنة 1306. \n2. طبع بفاس سنة 1302 في 13 جزءا، ثم في الميمنية سنة 1311 في 10 أجزاء. باسم «إتحاف السادة المتقين، بشرح أسرار إحياء علوم الدين». \n3. طبع بالإسكندرية سنة 1292 في جزءين.",
    "book_id": "984",
    "new_page_number": 13
  },
  {
    "serial_number": "6337042",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 59,
    "volume_number": 1,
    "text": "5 - وشرح الصدر، في شرح أسماء أهل بدر، في عشرين كراسا، ألفها لعلى أفندي درويش. ورسائل كثيرة جدا منها. 1 - رفع نقاب الخفا، عمن انتمى إلى وفا وأبى الوفا. 2 - بلغة الأريب، في مصطلح آثار الحبيب (1) . 3 - إعلام الأعلام، بمناسك حج بيت اللّه الحرام. 4 - زهر الأكمام، المنشق عن جيوب الإلهام، بشرح صيغة سيدي عبد السلام. 5 - رشفة المدام المختوم البكري، من صفوة زلال صيغ القطب البكري. 6 - رشف سلاف الرحيق، في نسب حضرة الصديق. 7 - القول المثبوت، في تحقيق لفظ التابوت. 8 - تنسيق قلائد المنن، في تحقيق كلام الشاذلي أبى الحسن. 9 - لقط اللآلي، من الجوهر الغالي. وهي في أسانيد الأستاذ الحفنى، وكتب له إجازته عليها في سنة 67 وذلك سنة قدومه إلى مصر. 10 - النوافح المسكية، على الفوائح الكشكية. 11 - جزء في حديث «نعم الإدام الخل». 12 - هدية الإخوان، في شجرة الدخان. 13 - منح الفيوضات الوفية، فيما في سورة الرحمن من أسرار الصفة الإلهية. 14 - إتحاف سيد الحي، بسلاسل بنى طي. 15 - بذل المجهود، في تخريج حديث «شيبتنى هود». 16 - المربى الكابلي، فيمن روى عن الشمس البابلي. 17 - المقاعد العندية، في المشاهد النقشبندية. 18 - رسالة في المناشى والصفين! 19 - شرح على خطبة الشيخ محمد البحيرى البرهاني على تفسير سورة يونس. 20 - تفسير على سورة يونس مستقل، على لسان القوم. 21 - شرح على حزب البر، للشاذلى (2) .",
    "foot_note": "1. طبع في مصر سنة 1326. \n2. طبع بمطبعة السعادة سنة 1333 في 78 صفحة باسم «تنبيه العارف البصير. على أسرار الحزب الكبير».",
    "book_id": "984",
    "new_page_number": 14
  },
  {
    "serial_number": "6337043",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 60,
    "volume_number": 1,
    "text": "22 - تكملة على شرح حزب البكري للفاكهى. 23 - مقامة سماها إسعاف الأشراف. 24 - أرجوزة في الفقه، نظمها باسم الشيخ حسن بن عبد اللطيف الحسنى المقدسي. 25 - حديقة الصفا، في والدي المصطفى. وقرظ عليها الشيخ حسن المدابغى. 26 - رسالة في طبقات الحفاظ. 27 - رسالة في تحقيق قول أبى الحسن الشاذلي: «وليس من الكرم» الخ. 28 - عقيلة الأتراب، في سند الطريقة والأحزاب، صنفها للشيخ عبد الوهاب الشربيني. 29 - التعليقة، على مسلسلات ابن عقيلة. 30 - المنح العلية، في الطريقة النقشبندية. 31 - الانتصار، لوالدي النبي المختار. 32 - ألفية السند ومناقب أصحاب الحديث. 33 - كشف اللثام، عن آداب الإيمان والإسلام. 34 - رفع الشكوى، لعالم السر والنجوى. 35 - ترويح القلوب، بذكر ملوك بنى أيوب. 36 - رفع الكلل، عن العلل. 37 - مسامرة الحبيب. ذكره في تاج العروس في مادة (بزز) وقال: «ومنية البز بالفتح: قرية بمصر، وقد دخلتها وألفت فيها مسامرة الحبيب في ليلة واحدة». 38 - رسالة سماها قلنسوة التاج، ألفها باسم الأستاذ العلامة الصالح الشيخ محمد بدير المقدسي، وذلك لما أكمل شرح القاموس المسمى بتاج العروس، فأرسل إليه كراريس من أوله حين كان بمصر، وذلك في سنة 82 ليطلع عليها شيخه الشيخ عطية الأجهورى ويكتب عليها تقريظا، ففعل ذلك وكتب يستجيزه، فكتب إليه أسانيده العالية في كراسة وسماها قلنسوة التاج (1) . وقد لخص الجبرتى هذه الرسالة. وذكر ما يتعلق بها، ثم ذكر أن للزبيدى أشعارا كثيرة، روى بعضا منها.",
    "foot_note": "1. بقي عليه مما لم يذكره «كتاب نشوة الارتياح، في بيان حقيقة الميسر والقداح». طبع في ليدن 1303.",
    "book_id": "984",
    "new_page_number": 15
  },
  {
    "serial_number": "6337044",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 61,
    "volume_number": 1,
    "text": "ثم روى خبر وفاته بعد إصابته بالطاعون، وأن زوجته أخفت خبره حتى استولت على معظم ما ترك من نفائس، ودفن بقبر أعده لنفسه بجانب زوجته. ثم قال في نعته: «وكان صفته ربعة نحيف البدن، ذهبي اللون، متناسب الأعضاء، معتدل اللحية، قد وخطه الشيب في أكثرها، مترفها في ملبسه، ويعتم مثل أهل مكة عمامة منحرفة بشاش أبيض، ولها عذبة مرخية على قفاه، ولها حبكة وشراريب حرير طولها قريب من فتر، وطرفها الآخر داخل طي العمامة، وبعض أطرافه ظاهر. وكان لطيف الذات، حسن الصفات، بشوشا بسوما، وقورا محتشما، مستحضرا للنوادر والمناسبات، ذكيا لوذعيا، فطنا ألمعيا». نسخة الأصل: هي نسخة نفيسة بمكتبة الأخ المحدث الجليل الأستاذ الشيخ أحمد محمد شاكر مصورة من نسخة بخط المؤلف نفسه، تكرم حفظه اللّه بإعارتي إياها لنشرها. ولهذه المصورة أخت بدار الكتب المصرية برقم 2799 تاريخ، صور معهد المخطوطات بجامعة الدول العربية نسخة منها في القلم 404. وهي تقع في 14 ورقة في كل صفحة منها 19 سطرا، وفي كل سطر نحو عشر كلمات مكتوبة بالخط الفارسي المعتاد. وبهامشها بعض إلحاقات وتصحيحات بقلم الزبيدي. وفيما يلي نصها:",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 16
  },
  {
    "serial_number": "6337045",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 62,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرحيم الحمد لله الذي خلق الإنسان وعلمه البيان، وفضله على سائر الأجناس بالتمييز والتبيان، والصلاة والسلام على سيدنا محمد أرشد موجوداته وأسعد مخلوقاته سيد ولد عدنان، وعلى آله وصحبه وتابعيهم ما ترنمت البلابل بالألحان، وغردت سواجع الأطيار على فنن الأغصان. وبعد فإنه لما كانت صناعة الخط أنفع بضاعة للكتاب، وأوسع كفاية للطلاب في هذا الباب، وأشرف وسيلة للتقريب، وألطف وصيلة لتوسيع الرزق والترحيب، كما قال الشاعر: لا تعدُ عن حقِّ الكتابة إنَّها … مغنى الغنى ومفاتحُ الأرزاق واخشَ اليراعةَ وارجها فهي التي … عرفت بنفث السُّمِّ والدِّرياق وكان المتصف به جهينة الأخبار، وحقيبة الأسرار، وبحي العظماء، وكبير الندماء، وترجمان السلطان، وصندوق البيان، ألفت هذه الرّسالة مشتملة على فضيلة الخط والقلم، وما جاء فيهما من الآثار، وما للحكماء فيهما من الأسرار، وبيان من وضع الخط أولاً وألف الحروف وألبسها حلل التفصيل وأحلها في أحسن الظروف. ثم بيان الأجلة من الكتاب، والأعيان من أهل الفن بحسن النسق المستطاب. وقد جعلتها هدية إلى خزانة من نبغ فيه واشتهر كاشتهار الشمس في رابعة النهار (1) ، وهذب قواعده وأتقن مراتبه بحسن الضبط والاعتبار، جمال هذا الفن الذي فاق فيه وبرع، وجمع بين المتانة والحسن ما لم يسبق به فللّه",
    "foot_note": "1. كذا جاءت «رابعة» بالباء واضحة. ولها وجهها.",
    "book_id": "984",
    "new_page_number": 17
  },
  {
    "serial_number": "6337046",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 63,
    "volume_number": 1,
    "text": "ما جمع، فلو شاهده ابن هلال لأقر له بالإتقان، أو عاصره ياقوت لقال هذا إنسان عين الزمان، أو رآه الشّيخ (1) لافتخر به في عصره، وأذعن أنه فريد مصره، المولي الكامل الماهر الكاتب، ذي الخط البديع المشرق كالكواكب، صاحب العرف الندي، الأمير حسن أفندي الملقب بالرشدي، جمل الله بجماله هذه الصناعة وأربابها، ويسّر له سبل الخيرات وفتح له أبوابها. فخذها جريدة مفيدة للمتدرب الكاتب، وخريدة منجية للمتعلم عن المتاعب، وسفينة جارية على مقاصد المتأملين فيها من كل باب، ودفينة رزينة لمن يتعرض في اقتناء الدر من مناهج الصواب، جريدة شحنت مسكاً زواياها، وحقة ملئت دراً خباياها، أمليتها من غرائب بنات الأفكار، ونوادر نتائج ثمرات الأخيار. وكلُّ سطرٍ من الياقوت زاد علاً … فلا تقيسوه بالمنحوت من حجر وكسرتها على عشرة فصول وخاتمة، وسميتها: «حكمة الإشراق، إلى كتاب الآفاق». وعلى الله توكلي وبه أستعين، في أمور الدّنيا والدّين.",
    "foot_note": "1. يعنى الشيخ حمد الله ابن الشيخ مصطفى الأماسي.",
    "book_id": "984",
    "new_page_number": 18
  },
  {
    "serial_number": "6337047",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 64,
    "volume_number": 1,
    "text": "فصل في ذكر من وضع الخط وأصله، ووصله وفصَّله يقال: إن أول من وضع الخط والكتب كلها آدم عليه السلام قبل موته بثلاثمائة سنة، كتبها في طين وطبخه، فلمّا أضلّ القوم الغرق أصاب كل قوم كتابهم. وقيل: أول من وضعه أخنوخ، وهو إدريس عليه السلام. وقيل إن نفيس (1) ، ونصر (2) ، وتيما، ورومه، بنو إسماعيل، وضعوا كتاباً واحداً وجعلوه سطراً واحدا غير متفرق، موصول الحروف كلها، ثم فرقه نبت (3) ، وهميسع وقيذار، وفرقوا الحروف وجعلوا الأشباه. وأما الخط العربي فأول من وضعه وألف حروفه ستة أشخاص من طسم، كانوا نزولا عند عدنان بن أدد، وكانت أسماؤهم: أبجد هوز حطى كلمن سعفص قرشت، فوضعوا الكتابة والخط على أسمائهم، فلما وجدوا في الألفاظ حروفاً ليست في أسمائهم ألحقوها بها، وسموها الروادف، وهي ثخذ ضظغ. وقيل: أول من وضع الخط العربي مرامر بن مرة (4) وقيل، عامر بن جدرة - وقد ذكر كلّا منهما صاحب القاموس - وقيل أسلم بن سدرة، وهم نفر من",
    "foot_note": "1. تسميه التوراة: «نافيش». تكوين 25: 15. \n2. كذا. وإنما هو «يطور». تكوين 25: 15. \n3. هو «نبايوت». وهو بكر إسماعيل. تكوين 25: 13. \n4. ويقال «ابن مروة». اللسان (مرر).",
    "book_id": "984",
    "new_page_number": 19
  },
  {
    "serial_number": "6337048",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 65,
    "volume_number": 1,
    "text": "بولان رسموه أحرفاً مقطعة، ثم قاسوه على هجاء السريانية، فوضع مرامر صوره، وعامر أعجمه، وأسلم وصل وفصل. وقال ابن خلكان (1) : والصحيح عند أهل العلم أن أول من خط هو مرامر بن مرة من أهل الأنبار، وقيل إنه من بني مرة. ومن الأنبار انتشرت الكتابة في الناس. قال الأصمعي: ذكروا أن قريشاً سئلوا: من أين لكم الكتابة؟ فقالوا: من الأنبار (2) . وقال هشام بن محمد بن السائب: تعلم بشر بن عبد الملك الكتابة من أهل الأنبار وخرج إلى مكة وتزوج الصهباء بنت حرب بن أمية. تعلم (3) منه حرب، ومنه ابنه سفيان، ومنه ابن أخيه سيدنا معاوية رضي الله عنه، ثم انتشر في قريش، وهو الخط الكوفي الذي استنبطت منه الأقلام التي هي الآن. وفيه كلام في الإعلام (4) للسهيلي، والمزهر للسيوطي، والأوليات للعسكري، وقد ذكرنا كلامهم في كتابنا «تاج العروس لشرح جواهر القاموس». فمن أراد الزيادة على ذلك فليراجعه.",
    "foot_note": "1. في الوفيات 1: 346 في ترجمة علي بن هلال، المعروف بابن البواب. \n2. الذي في الوفيات: «فقالوا من الحيرة. وقيل لأهل الحيرة: من أين لكم الكتابة؟ فقالوا: من الأنبار». \n3. كذا. بدون واو قبلها. \n4. هو «التعريف والإعلام، فيما أبهم في القرآن من الأسماء الأعلام». وقد طبع في مصر بتصحيح محمود ربيع سنة 1356. انظر منه ص ص 40 - 41.",
    "book_id": "984",
    "new_page_number": 20
  },
  {
    "serial_number": "6337049",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 66,
    "volume_number": 1,
    "text": "فصل في فضل الخط وما قيل فيه جاء في تفسير قوله تعالى: يَزِيدُ فِي الْخَلْقِ ما يَشاءُ: انه الخط الحسن. وعن ابن عباس رضي الله عنهما في قوله تعالى: أَوْ أَثارَةٍ مِنْ عِلْمٍ قال: الخط. ويروى في الخبر المأثور: من كتب بسم اللّه الرحمن الرحيم فحسّنه أحسن اللّه إليه. كذا في منهاج الإصابة للزّفتاوى. وفي شرعة الإسلام (1) : من كتب بسم الله الرحمن الرحيم فجوده غفر الله له. وفي الجامع الصغير (2) من رواية سلمة (3) : «الخطّ الحسنُ يزيد الحقَّ وضحا» وفيه أيضاً: «قيِّدوا العلم بالكتاب (4) »، قال شارحه المناوي (5) : العلم يعقل ثم يحفظ، والنسيان كامن في القلب، فلخوف ذهاب العلم قيد بالكتابة. وجاء في حديث آخر: «حق الوالد على ولدهِ أن يعلمه الكتابة والسِّباحة والرِّماية، وأن لا يرزقهُ إلا طيِّباً (6) ». وفي رواية أخرى: «حقّ الوالد على",
    "foot_note": "1. شرعة الإسلام، للإمام الواعظ محمد بن أبي بكر المعروف بإمام زاده الحنفي، المتوفى سنة 573. \n2. الجامع الصغير في أحاديث البشير النذير، لجلال الدين السيوطي المتوفى سنة 911. \n3. كذا بخطه. وفي الجامع الصغير 4134 «أم سلمة». وأشار السيوطي إلى أنه حديث ضعيف. وروى الحديث منسوبا إلى علي في صبح الأعشى 3: 2. \n4. الجامع الصغير 6167 عن أنس وابن عمرو. وأشار إلى أنه حديث صحيح. \n5. هو شمس الدين محمد المدعو بعبد الرؤوف المناوي الشافعي المتوفى سنة 1030. خلاصة الأثر 2: 412. وقد طبع شرحه «التيسير» ملخص شرحه الكبير «فيض القدير» في مجلدين ببولاق سنة 1286. \n6. في الجامع الصغير 3742 من حديث أبي رافع، وقد أشار إلى أنه ضعيف.",
    "book_id": "984",
    "new_page_number": 21
  },
  {
    "serial_number": "6337050",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 67,
    "volume_number": 1,
    "text": "ولده أن يحسِّن اسمه، ويزوِّجه إذا أدرك، ويعلِّمه الكتاب (1) ». قال الشارح: يعني القرآن، ويحتمل إرادة الخط. وفي الحديث أيضاً، قال صلى الله عليه وسلم لزيد بن ثابت - وهو أحد كتابه كما سيأتي -: «إذا كتبت بسم الله الرحمن الرحيم فبيِّن السِّين فيه» (2) . وذكر صاحب الشرعة أيضاً أنه صلى الله عليه وسلم قال لمعاوية رضي الله عنه وهو يكتب بين يديه. «ألقِ الدَّواةَ، وحرِّف القلم، وانصب الباء، وفرِّق السين، ولا تعوِّرِ الميم، وحسِّن الله، ومدَّ الرَّحمن، وجوِّد الرحيم. وقالوا: لما كانت الكتابة شريفة كان حسن الخط فيها فضيلة. وقال المأمون: لو فاخرتنا الملوك الأعاجم بأمثالها لفخرناها بما لنا من أنواع. الخط يقرأ بكل مكان، ويترجم بكل لسان، ويوجد مع كل زمان. وقال النظام: الخط أصل في الروح يظهر بآلة جسدانية (3) . وقال بعض الحكماء (4) : الخط سمط الحكمة، بها (5) يفصّل شذورها وينتظم منثورها. ويقال: قريش أهل الله، لأنهم كتبة حسنة (6) . وكان يقال: حسن الخط أحد اللسانين، كما قيل: قلّة العيال أحد اليسارين.",
    "foot_note": "1. في الجامع 3743 عن أبي هريرة. وذكر أنه ضعيف. \n2. حديث ضعيف، كما في الجامع الصغير 835. \n3. صبح الأعشى: «الخط أصل الروح، له جسدانية في سائر الأعمال». \n4. في صبح الأعشى 3: 2 أنه «جعفر بن يحيى». \n5. كذا في الأصل. وفي صبح الأعشى: «وبه تفصل شذورها، وينتظم منثورها». \n6. كذا. وفي أدب الكتاب للصولى 28: «وقد روى عن النبي صلى الله عليه وسلم أنه قال: «قريش أهل اللّه، وهم الكتبة الحسبة»: جمع كاتب وحاسب.",
    "book_id": "984",
    "new_page_number": 22
  },
  {
    "serial_number": "6337051",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 68,
    "volume_number": 1,
    "text": "وقال بعض العلماء (1) : الخط كالروح في الجسد، فإذا كان الإنسان جميلاً وسيماً حسن الهيئة كان في العيون أعظم، وفي النفوس أفخم، وبضد ذلك تسأمه النفوس. فكذلك الخط إذا كان حسن الوصف، مليح الرصف، مفتح العيون، أملس المتون، كثير الائتلاف، قليل الاختلاف، هشت إليه النفوس واشتهته الأرواح، حتى إن الإنسان ليقرؤه - وإن كان فيه كلام دنئ، ومعنى ردئ - مستزيداً منه ولو كثر، من غير سأم يلحقه ولا ضجر. وإن كان الخط قبيحاً مجته الأفهام، ولفظته العيون والأفكار، وسئمه قارئه وإن كان فيه من الحكمة عجائبها، ومن الألفاظ غرائبها. وقيل: إن وزن الخط مثل وزن القراءة، فأجود الخط أبينه، كما أن أجود القراءة أبينها (2) . فحرفة أصول الخط وهندسته، وكيفيته وحقيقته، أشرف من عمله تقليداً من غير تحقيق. قيل: وصف أحمد بن إسماعيل خطاً فقال: لو كان نباتاً لكان زهراً، ولو كان معدناً لكان تبرا، أو مذاقاً لكان حلواً، أو شراباً لكان صفواً (3) . وقال عمرو بن مسعدة: الخطوط رياض العلوم، وهي صورة روحها البيان، وبدنها السرعة، وقدمها التسوية، وجوارحها معرفة الفصول، وتصنيفها كتصنيف النغم واللّحون.",
    "foot_note": "1. انظر صبح الأعشى 3: 20 - 21. \n2. صبح الأعشى 3: 21. \n3. أدب الكتاب للصولى 45.",
    "book_id": "984",
    "new_page_number": 23
  },
  {
    "serial_number": "6337052",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 69,
    "volume_number": 1,
    "text": "وقيل: إن أحمد الخطوط رسماً ما اعتدلت أقسامه، وانتصبت ألفه ولامه، واستقامت سطوره، وضاهى صعوده وحدوره (1) ، وتفتّحت عيونه، ولم تشتبه راؤه ونونه، وقدرت أصوله (2) ، واندمجت وصوله، وتناسب دقيقه وجليله. ولا يجمع في سطر بين مدتين ولا ياءين مردودتين، ويراعى مواضع الفصول والوصول، ولا تقطع كلمة بحرف يفرد في غير سطره.",
    "foot_note": "1. كذا. وفي أدب الكتاب 50: «وضاهى صعوده حدوره». \n2. كذا. وفي أدب الكتاب: «فصوله».",
    "book_id": "984",
    "new_page_number": 24
  },
  {
    "serial_number": "6337053",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 70,
    "volume_number": 1,
    "text": "فصل في القلم، وما لهم فيه من الحكم قيل: هو أول ما خلقه الله تعالى، وبذكره بدأ في القرآن، فقال تعالى: الَّذِي عَلَّمَ بِالْقَلَمِ. عَلَّمَ الْإِنْسانَ ما لَمْ يَعْلَمْ. وقال تعالى: ن. وَالْقَلَمِ وَما يَسْطُرُونَ فأبان سبحانه وتعالى أن صناعة القلم أفضل الصّنائع (1) ، وأجلّ البضائع. قيل: لا يسمى قلماً حتى يبرى، وإلا فهو قصبة. ولا يقال للرمح رمح إلا وعليه سنان، وإلا فهو قناة. ولا يقال مائدة إلا وعليها طعام، وإلا فهي خوان. ولا يقال كأس إلا إذا كان فيه شراب، وإلا فهو زجاجة. وقال بعض ملوك اليونان (2) : أمر الدنيا والدين واقع تحت شيئين: سيف وقلم، والسيف تحت القلم. قال أبو الفتح البستي: إذا أقسمَ الأبطالُ يوماً بسيفهم … وعدُّوه مما يكسبُ المجدَ والكرمْ كفى قلمَ الكتاب عزَّا ورفعةً … مدى الدَّهرِ أنَّ اللهَ أقسمَ بالقلم (3) وقال الإسكندر: ما أقرته الأقلام، لم تطمع في دروسه الأيام. وقيل: القلم لسان البصر، ومطيّة الفكر.",
    "foot_note": "1. الكلمة وردت قديما في التنبيه والإشراف للمسعودي 5 وأخبار العلماء للقفطى 195 والدرر الكامنة 3: 420. \n2. أدب الكتاب للصولى 45. وفي صبح الأعشى 2: 447: «بعض حكماء اليونان». \n3. صبح الأعشى 2: 445.",
    "book_id": "984",
    "new_page_number": 25
  },
  {
    "serial_number": "6337054",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 71,
    "volume_number": 1,
    "text": "وقال آخر: بالقلم تزف بنات العقول، إلى خدور الكتب. وقال العتابي: ببكاء الأقلام تضحك الصحف. وقال ابن المعتز: القلم يخدم الإرادة، ولا يمل الاستزادة، يسكت قائماً وينطق سائراً، في أرض بياضها مظلم، وسوادها مضئ. وقال أرسطاطاليس (1) : الكاتب العلة الفاعلية، والقلم العلة الآلية، والمداد العلة الهيولانية، والخط العلة الصورية، والبلاغة العلة الغائية. وقال إبراهيم بن العباس الصولي لكاتب (2) : أطل خرطوم قلمك. فقال (3) : أله خرطوم؟ قال: نعم وأنشد: كأنَّ أنوفَ الطَّير في عرصاتها … خراطيم أقلامٍ تخطُّ وتعجمُ وأما قدره وإمساكه وحالاته فقال الأستاذ ابن مقلة: أحسن قدود القلم أن لا يتجاوز به الشبر بأكثر من جلفته (4) . قال الشاعر: له ترجمانٌ أخرسُ اللَّفظ صامتٌ … على قابِ شبرٍ بل يزيدُ على الشِّبر (5) وقال الشيخ محمَّد بن العفيف (6) رحمه الله تعالى: صنعة مسكه بالإبهام والوسطى، وتكون السبابة تمنعه من الميل والاضطراب، وتكون مبسوطة غير",
    "foot_note": "1. أدب الكتاب للصولى 45 وصبح الأعشى 448. \n2. في صبح الأعشى 2: 459: «الكاتب». \n3. في صبح الأعشى: «فقيل له». \n4. في تاريخ بغداد 5: 217 أن الجلفة فتحة رأس القلم. وكلام ابن مقلة تجده في صبح الأعشى 2: 454. \n5. قبله في صبح الأعشى: فتى لو حوى الدنيا لأصبح عاريا \n…. من المال معتاضا ثيابا من الشكر \n6. الكلام باختصار في صبح الأعشى 3: 37.",
    "book_id": "984",
    "new_page_number": 26
  },
  {
    "serial_number": "6337055",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 72,
    "volume_number": 1,
    "text": "مقبوضة، لأن ببسط الأصابع يتمكن الكاتب من إدارة القلم. ولا يتكئ على القلم الاتكاء الشديد المضعف له، ولا يمسك الإمساك الضعيف فيضعف اقتداره في الخط، لكن يجعل الكاتب اعتماده في ذلك معتدلاً. وقال إسحاق بن حماد: القلم للكاتب، كالسيف للشجاع. وقال الضحاك بن عجلان: يا من تعاطى الكتاب، اجمع قلبك عند ضربك القلم، فإنما هو عقلك تظهره. وأما حاله في الصلابة والرخاوة فإنه تابع للصّحيفة، لأنها إذا كانت لينة احتاجت أن يكون في الأنبوب لين، وفي لحمه فضل، وفي قشره صلابة. وإن كانت صلبة احتاجت أن يكون في الأنبوب يبس وصلابة. قال: وعلة ذلك أن حاجته من المداد في الصحيفة الرخوة أكثر من حاجته إليه في الصحيفة الصلبة فرطوبته ولحمه يحفظان عليه غزارة الاستمداد، ويكون في الصحيفة الصلبة ما وصل إليها من القلم الصلب الخالي من المداد كافياً (1) . وقال شيخ هذه الصناعة عماد الدين الشيرازي (2) : أحمد الأقلام ما توسطت حالاته في الطول والقصر، والغلظ والرقة، فإن الرقيق الضئيل تجتمع عليه الأنامل فيبقى مائلاً إلى ما بين الثلاث، والغليظ المفرط لا تحمله الأنامل. وقال ابن الزيات (3) : خير الأقلام ما استحكم نضجه وخف بزره، وبلغ أشدّه واستوى.",
    "foot_note": "1. صبح الأعشى 2: 455. \n2. انظر صبح الأعشى 2: 454. \n3. هو بعبارة أطول في صبح الأعشى 2: 453.",
    "book_id": "984",
    "new_page_number": 27
  },
  {
    "serial_number": "6337056",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 73,
    "volume_number": 1,
    "text": "فصل في الدواة وصفتها وآلاتها قال الحسن بن وهب (1) : سبيل الدواة أن تكون متوسطة في قدرها، لا باللطيفة فتقصر أقلامها وتقبح، ولا بالكثيفة فيثقل محملها. قال الفضل: ينبغي أن يتخذ من أجود العيدان وأرفعها ثمناً كالآبنوس والساسم والصندل (2) . وأما (الجونة) التي فيها حق المداد فينبغي أن يكون شكلاً مدور الرأس، تجتمع على زاويتين قائمتين، ولا يكون مربعاً على حال، لأنه إذا كان مربعاً يتكاثف المداد، فإذا كان مستديرا كان أنقى للمداد (3) وأسعد في الاستمداد. ويجتهد في تحسينها وتجويدها وتصوينها. وأنشد المدائني (4) : جوِّدْ دواتك واجتهد في صونها … إنَّ الدُّويَّ خزائن الآدابِ ومن آلاتها (الليقة) ويكون من الحرير والقطن والصوف. وسمت العرب كل ذلك كرسفا. وقال بعضهم (5) : من لم يحسن الاستمداد وبري القلم والشّقّ والقطّ",
    "foot_note": "1. انظر صبح الأعشى 2: 442. \n2. صبح الأعشى 2: 441. \n3. في صبح الأعشى 2: 468: «أبقى للمداد». \n4. في صبح الأعشى 2: 443: «وللّه در المدائني حيث يقول». \n5. ذكر في صبح الأعشى 2: 456 أنه المقر العلائي ابن فضل اللّه.",
    "book_id": "984",
    "new_page_number": 28
  },
  {
    "serial_number": "6337057",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 74,
    "volume_number": 1,
    "text": "وإمساك الطومار، وقسمة حركة اليد حين الكتابة فليس هو من الكتابة في شيء. وقال ابن العفيف: من لم يدر وجه القلم وصدره وعرضه فليس هو من الكتابة في شيء (1) . وقال آخر (2) : على حسب تمكن الكاتب من إدارة قلمه وسرعة يده في الدوران يكون صفاء جوهر حروفه (3) . وإذا مد الكاتب فليكن القلم من أصابعه على صورة إمساكه له في حين الكتابة ولا يديره للاستمداد، لأن أحسن المذاهب فيه أن يكون من يد الكاتب على وضعه في الكتاب. ويحرك رأس القلم من باطن يده إلى خارجها، فإنه يمكنه معه مقام القلم على نصبته في الأصابع. ومتى عدل عن هذا لحقته المشقة في نقل نصبه الأصابع في كل مدة. وهذا من أكبر ما يحتاج إليه الكاتب، لأن هذا هو الذي عليه مدار جودة الخط، وقلما يدريك علم هذا إلا رؤيته من العالم الحاذق (4) بهندسة الخط، مع ما يكون معه من الأناة وحسن التأدية. قال بعض الكتاب: ويتعين على الكاتب أن يتفقد الليقة ويطيبها بأجود ما يكون، فإنها تتغير على طول المدى. وأنشد: متظرِّف شهدت عليه دواته … إنّ الفتى لا كان غير ظريف",
    "foot_note": "1. صبح الأعشى 2: 464. \n2. هو ابن العفيف كما في صبح الأعشى 3: 38. \n3. الكلام التالي نسب في صبح الأعشى 3: 38 إلى الشيخ عماد الدين العفيف. \n4. في صبح الأعشى: «وقلما يدرك علم هذا الفصل إلا العالم الحاذق».",
    "book_id": "984",
    "new_page_number": 29
  },
  {
    "serial_number": "6337058",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 75,
    "volume_number": 1,
    "text": "وكان بعض الكتّاب يطيّب دواته ببعض ما عنده من طيب نفسه، فسئل عن ذلك فقال: لأنا نكتب به اسم الله تعالى واسم نبيه صلى الله عليه وسلم. وقال آخر: يتعين على الكاتب تجديد الليقة في كل شهر، وأن يطبق المحبرة حين فراغه لئلا يقع فيها ما يفسد الخط. وقال آخر (1) : ينبغي للكاتب أن لا يكثر الاستمداد، بل يمد مداً معتدلاً، ولا يحرك الليقة من مكانها، ولا ينثر بالقلم (2) ولا يرد القلم إلى الليقة حتى يستوعب ما فيه من المداد، ولا يدخل منه الدواة كثيراً بل إلى حد شقيه (3) لا يجاوز ذلك إلى آخر الفتحة. ومن آلاتها (السكين) وهي المدية. قالوا: لا يستعمل لغير بري القلم. ويستحب المبالغة في سقيها وحدها، ليتمكن من البري، فيصفو جوهر القلم ولا يتشظى قطته. وهي مسن الأقلام تشحذ بها إذا كلت، وتطلقها إذا وقفت وتلمها إذا تشعثت وأحسنها ما عرض صدره، وأرهف حدّه، ولم يفصل عن القبضة نصابه (4) ، واستوى من غير اعوجاج. وكانوا يستحسنون العقابية (5) ، وهي التي صدرها أعرض من بطنها. ومن آلاتها (الملواق) لأنّه به تلاق الدواة وأحسن ما يكون من الآبنوس، لئلا يغيره لون المداد، ويكون مستديراً مخروطاً، عريض الرّأس نحيفه.",
    "foot_note": "1. هو المقر العلائي، ابن فضل اللّه، كما في صبح الأعشى 3: 39. \n2. صبح الأعشى: «ولا يعثر بالقلم». \n3. صبح الأعشى: «شقة». \n4. أدب الكتاب 115. \n5. انظر صبح الأعشى 2: 467.",
    "book_id": "984",
    "new_page_number": 30
  },
  {
    "serial_number": "6337059",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 76,
    "volume_number": 1,
    "text": "فصل في المداد والحبر سمي مداداً لأنه يمدّ القلم، أي يعينه. وإنما استعمل فيه السواد دون غيره لمضادته لون الصحيفة. وليس شيء من الألوان ضد (1) لصاحبه إلا السواد والبياض. وقال آخر (2) : صورة المداد في الأبصار سوداء، وفي البصائر بيضاء. والمداد ركن من أركان الكتابة وعليه معول الكتاب (3) . وأنشدوا في ذلك: ربع الكتابةِ في سواد مدادها … والرُّبع حسنُ صناعة الكتَّاب والرُّبع من قلمٍ سويٍّ بريهُ … وعلى الكواغدِ رابع الأسباب (4) ونظر جعفر بن محمد إلى فتى على ثيابه أثر المداد وهو يستره منه، فقال له: يا هذا، إن المداد على الثياب من المروة (5) . وقال ابن العفيف: شيئان لا يتم المداد إلا بهما، وهما العسل والصّبر. أمّا",
    "foot_note": "1. كذا في الأصل، على الوصفية. وفي صبح الأعشى 2: 473 «يضاد صاحبه كمضادة السواد للبياض. \n2. في صبح الأعشى 2: 472: «بعض الحكماء». \n3. في صبح الأعشى 2: 473: «وعليه مدار الربع منها». \n4. صبح الأعشى 2: 473: «تسوى بريه». وكواغذ، وردت بالذال المعجمة. والكاغد والكاغذ لغتان في الفارسية، وهو الورق الذي يكتب فيه. استينجاس 1006 وفي صبح الأعشى: «كواغد» بالمهملة. \n5. صبح الأعشى 2: 472.",
    "book_id": "984",
    "new_page_number": 31
  },
  {
    "serial_number": "6337060",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 77,
    "volume_number": 1,
    "text": "العسل فإنه يحفظه على مرور الأيام ولا يكاد يتغير عن حالته، وأما الصبر فإنه يمنع الذباب من النزول عليه. وقال بعض الأدباء: عطروا دفاتر الآداب بسواد الحبر (1) . وقال آخر (2) : يبريق الحبر تهتدي العقول لخبايا الحكم، لأنه أبقى على الدّهر، وأنمى للذّكر، وأزيد للأجر.",
    "foot_note": "1. صبح الأعشى 2: 472. \n2. هو فارس بن حاتم، كما في صبح الأعشى 2: 473.",
    "book_id": "984",
    "new_page_number": 32
  },
  {
    "serial_number": "6337061",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 78,
    "volume_number": 1,
    "text": "فصل في بري الأقلام حكى أن الضَّحاك كان إذا أراد أن يبرى قلماً توارى بحيث لا يراه أحد ويقول: الخط كله للقلم (1) . وكان الأنصاري إذا أراد أن يبري فعل ذلك، وإذا أراد أن يقوم من الديوان قطع رؤوس الأقلام (2) . وقالوا: تعليم البراية أكبر من تعليم الخط (3) . وقال ابن العفيف: فساد البراية من بلادة السكين. وقال بعضهم (4) : جودة البراية نصف الخط. وقيل: كان بعضهم (5) إذا أخذ الأنبوبة ليبريها تفرّس فيها قبل ذلك، وإذا أراد أن يقط توقف، ثم تحرى فتوقف، ثم يقط على تثبت. وروى بخط ابن مقلة: ملاك الخط حسن البراية. ومن أحسنها سهل عليه الخط، ومن وعى قلبه كثرة أجناس قط الأقلام كان مقتدراً على الخط، ولا يتعلم ذلك إلا عاقل.",
    "foot_note": "1. في صبح الأعشى 2: 456 «القلم» .. والضحاك هذا هو الضحاك بن عجلان. \n2. زاد في صبح الأعشى 2: 456: «حتى لا يراها أحد». \n3. صبح الأعشى 2: 456. \n4. هو المقر العلائي ابن فضل اللّه. صبح الأعشى 2: 456. \n5. انظر صبح الأعشى 2: 462.",
    "book_id": "984",
    "new_page_number": 33
  },
  {
    "serial_number": "6337062",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 79,
    "volume_number": 1,
    "text": "وقال ابن هلال (1) : كل قلم تقصر جلفته فإن الخط يجيء به أوقص أي قصير العنق. وقال ابن البربري: إياك والخرق في البراية وترك التجويد لها، ومن فسدت آلته فسد عمله. وقال ابن العفيف (2) إذا طالت البراية جاء الخط بها أخف وأضعف وأحلى، وإذا قصرت جاء الخط أصفى وأثقل وأقوى. وأما صفة شقه فقال ابن هلال: يكون في وسطه، وليكن غلظ السنين جميعاً سواء. قال: ويجوز أن يكون الأيمن أغلظ من الأيسر ولا يكون العكس على حال (3) . وأما قطه فهو على صفات: منها المحرف، والمستوي، والقائم، والمصوب. وأجودها المحرفة المعتدلة التحريف، وأفسدها المستوي، لأن المستوي أقل من المحرف تصرفاً. قاله ابن العفيف. قال عبد الحميد الكاتب لرغبان، وكان يكتب بقلمٍ قصير البراية: أتريد أن يجود خطك؟ قال: نعم. قال: فأطل جلفة قلمك، وأسمنها، وحرف القطة وأيمنها. قال رغبان: ففعلت ذلك فجاد خطي (4) . وقال ابن مقلة لأخيه: إذا قططت القلم فلا تقطه إلا على مقط أملس صلب،",
    "foot_note": "1. هو أبو الحسن علي بن هلال، المعروف بابن البواب المتوفى سنة 423. وانظر صبح الأعشى 2: 459. \n2. صبح الأعشى 2: 459. \n3. صبح الأعشى 2: 461. \n4. صبح الأعشى 2: 459.",
    "book_id": "984",
    "new_page_number": 34
  },
  {
    "serial_number": "6337063",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 80,
    "volume_number": 1,
    "text": "غير مثلم ولا خشن، لئلا يتشظى القلم، واستحد السكين حدا، ولتكن ماضية جداً؛ فإنها إذا كانت كالةً جاء الخط رديئاً مضطربا. وتضجع السكين قليلاً إذا عزمت على القط ولا تنصبها نصبا (1) . وقال ابن العفيف: يتعين أن يكون من عود صلب كالآبنوس والعاج، ويكون مسطح الوجه الذي يقطع عليه، ولا يكون مستديرا.",
    "foot_note": "1. صبح الأعشى 2: 463 مع اختصار.",
    "book_id": "984",
    "new_page_number": 35
  },
  {
    "serial_number": "6337064",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 81,
    "volume_number": 1,
    "text": "فصل في النقط هو الذي يستدل به على حروف المعجم، ويفصل به بينها، فتعرف به الباء من الثاء. ويقال: أول من نقط المصاحف ووضع العربية أبو الأسود الدّئلى، من تلقين أمير المؤمنين علي بن أبي طالب رضى اللّه عنه. قال ابن مقلة: وللنقط صورتان: أحدهما شكل مربع، والآخر شكل مستدير. وإذا كانت نقطتان على حرف فإن شئت جعلت واحدة فوق أخرى، أو جعلتهما في سطر معاً. وإذا كان بجوار ذلك الحرف حرف ينقط لم يجز أن تكون النقط إذا انشفعت إلا واحدة فوق أخرى. والعلة في ذلك أن النقط إذا كن في سطر وخرجن عن حروفهن وقع اللبس والإشكال، فإذا جعل بعضها على بعض كان على كلّ حرف قسطه من النقط، فزال الإشكال.",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 36
  },
  {
    "serial_number": "6337065",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 82,
    "volume_number": 1,
    "text": "فصل في الشكل قال بعض أهل اللغة: شكل الحروف مأخوذ من شكل الدابة، لأن الحروف تضبط به وتقيد، فلا يلتبس إعرابها، كما تضبط الدابة بالشكال. وقال بعضهم: حلوا غرائب الكلم بالتقييد، وحصنوها عن شبه التصحيف والتحريف. وهو ثلاث حركات: رفع ونصب وخفض. وأما الجزم فصورته بخلاف صور الحركات دائرة كلّها، كأنّهم يريدون بها الميم من اجزم، وحذفوا عرافة الميم استخفافاً. وقال ابن العفيف: إذا كان الحرف مفتوحاً منوناً فعلامته خطتان من فوقه وتكون بينهما كقدر واحدة منهما، وإذا كان مضموماً منوناً فعلامته سين بغير عراقة، كأنك تريد أوّل «شديد» (1) . وإذا كان مجزوما فعلامته خاء بلا عراقة، كأنك تريد أول «خفيف». هذا مذهب الأستاذ أبي الحسن (2) ، وعليه جملة أهل المشرق. وإذا كان مهموزاً فعلامته أن تثبت فوقه عيناً بلا عراقة وذلك لقرب مخرج الهمزة من العين. قال، ولا بد من تناسب الشّكل والنّقط وتناسب البياضات في ذلك (3) .",
    "foot_note": "1. صبح الأعشى 3: 163. \n2. أبو الحسن علي بن هلال، المعروف بابن البواب. انظر ص 76. \n3. انظر صبح الأعشى 3: 167.",
    "book_id": "984",
    "new_page_number": 37
  },
  {
    "serial_number": "6337066",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 83,
    "volume_number": 1,
    "text": "فصل في ذكر حروف المعجم وسرها في تعيين العدد قال كراع: إنما سميت الحروف المقطعات حروف المعجم لأنها كانت مبهمة حتى بينت بالنقط. قال بعض المنجمين: عدد حروف العربية ثمانية وعشرون حرفاً، على عدد منازل القمر. وغاية ما تبلغ الكلمة منها مع الحروف الزوائد التي تلحقها سبعة أحرف، على عدد الدراري السبعة. قال: وصور حروف الزيادة اثني عشر (1) على عدد البروج الاثني عشر. وحروف الزيادة عشرة أحرف، يجمعها «سألتمونيها». وقد تقدم أن جملة الحروف ثمانية وعشرون حرفاً، فالذي تندغم لام التعريف فيها من هذه الحروف أربعة عشر حرفاً كالتي تخفى تحت الأرض من منازل القمر، وباقيها يظهر معه التعريف، وهي أربعة عشر حرفاً كالمنازل الظاهرة. وقد تقدم الكلام على أن حروف المعجم ثمانية وعشرون حرفاً مفردة، ويتركب منها اللام ألف، فذلك تسعة وعشرون حرفاً. ولها ثماني عشر (2) صورة، لأن ما اتفقت صورته فليس في ذكر شبهه فائدة، لأن ذكر أحد الصور (1) ينوب عن جميعها، كالباء والتاء والثاء، والجيم والحاء والخاء، وتتناهى هذه الصور الثمانية عشر (1) مفردة ومركبة، كما هو مبين في محلّه.",
    "foot_note": "1. كذا في الأصل. \n2. كذا في الأصل. والوجه «ثماني عشرة».",
    "book_id": "984",
    "new_page_number": 38
  },
  {
    "serial_number": "6337067",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 84,
    "volume_number": 1,
    "text": "فصل في ذكر الكتبة الكرام من لدن زمن النبي صلى الله عليه وسلم إلى زماننا هذا، على نسق الترتيب وحسن التهذيب. فمن كتب له صلى الله عليه وسلم وتشرف بخدمته بالكتابة الخلفاء الأربعة، وعامر بن فهيرة، وعبد الله بن الأرقم، وأبي بن كعب، وثابت بن قيس بن شماس، وخالد بن سعيد بن العاص، وحنظلة بن الربيع الأسيّدى، وزيد بن ثابت، ومعاوية بن أبي سفيان، وشرحبيل بن حسنة، وغير هؤلاء كما هو مسطور في المواهب وكتب السيرة، رضي الله عنهم أجمعين. وكان ألزمهم بذلك وأخصهم به زيد بن ثابت، ومعاوية بن أبي سفيان. ثم انتهت جودة الخط وضرب جليله إلى الضحاك (1) ، وإسحاق بن حماد. فأخذ إبراهيم السجزي عن إسحاق ضرب الجليل، فاخترع منه أخف حركات وأحسن مزاوجات، فسماه قلم الثلثين. ثم اخترع من هذا القلم ما هو أخف منه وأجرى فسماه قلم الثلث. قال الشيخ عماد الدين محمد بن العفيف: بهذا القلم وقلم النسخ يعرف اقتدار الكاتب على صناعته. ثم أخذ عن إسحاق يوسف واخترع قلماً هزيلاً تاماً مفرط التمام مفتحاً، فأعجب ذا الرّئاستين الفضل بن سهل، فأمر بتحرير الكتب السلطانية به، وسمّى القلم الرّياسىّ (2) .",
    "foot_note": "1. هو الضحاك بن عجلان، كان في أول خلافة بنى العباس، ابن النديم 10 وصبح الأعشى 3: 12. وكان من أهل الشام. \n2. صبح الأعشى: «قال بعض المتأخرين: وأظنه قلم التوقيعات».",
    "book_id": "984",
    "new_page_number": 39
  },
  {
    "serial_number": "6337068",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 85,
    "volume_number": 1,
    "text": "وكان وجه النعجة مقدماً في قلم الجليل، وأبو زرجان (1) مقدماً في قلم النصف. وكان أحمد بن حفص (2) أحلى الكتاب خطاً في قلم الثلث. قال الوزير (3) : معنى قول الكتاب قلم النصف والثلث والثلثين، إنما هو راجع إلى الأصل. وذلك أن للخط جنسين من الأربعة عشر (4) طريقة التي هي الأصول، هي له كالحاشيتين أحدهما قلم الطومار، وهو قلم مبسوط كله، ليس فيه شيء مستدير، وكثيراً ما كتب به المصاحف المدنية القدم، وقلم آخر يسمى غبار الحلبة، وهو قلم مستدير كله ليس فيه شيءٌ مستقيم. فالأقلام كلها تؤخذ من المستقيمة والمستديرة نسبا مختلفة. فما كان فيه من الخطوط المستقيمة ما يوازى ما فيه من الخطوط المستديرة سمي قلم النصف. فإن كان الذي فيه من الخطوط المستقيمة الثلث سمي قلم الثلث. وإن كان فيه من الخطوط المستقيمة الثلثان سمي قلم الثلثين. فعلى هذا تتركب هذه الأقلام. وقد برع فيه حيون بن عمرو أخو الأحول، وكان أخط من أخيه. ثم انتهت جودة الخط وحسنه وتحريره في رأس الثلاثمائة إلى الأستاذ في هذا الفن الوزير أبي علي محمد بن الحسن بن مقلة الكاتب، وفاته في سنة 328، ثم إلى تلميذيه محمد بن أسد الغافقي ومحمد السمساني، وعنهما أخذ الأستاذ الكبير أبو الحسن علي بن هلال البغدادي المعروف بابن البواب، وعنه أخذ محمد بن منصور",
    "foot_note": "1. صبح الأعشى: «وكان محمد بن معدان، يعنى المعروف بأبى ذرجان». \n2. صبح الأعشى: «أحمد بن محمد بن حفص المعروف بزاقف». \n3. الوزير أبو علي محمد بن مقلة. وزر للمقتدر، ثم للقاهر باللّه، ثم للراضى باللّه، وقد حدثت بينهما جفوة عاقبه فيها بقطع يده اليسرى، ثم أمر «يحكم التركي» بقطع لسانه، فقطع أيضا. وتوفى سنة 328. وكانت ولادته سنة 272. \n4. كذا في الأصل، وفي صبح الأعشى 3: 48 «أن للخط الكوفي أصلين من أربع عشرة طريقة».",
    "book_id": "984",
    "new_page_number": 40
  },
  {
    "serial_number": "6337069",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 86,
    "volume_number": 1,
    "text": "ابن عبد الملك، وعنه الشيخة الكاتبة المحدثة زينب - ويقال أيضاً فاطمة - وهي ابنة الشيخ أبي الفرج، وتعرف بشهدة بنت الأبري (1) ، وقد ترجمها الحافظ الذهبي في تاريخه. وممن جود عليها الشيخ أبو الدر أمين الدين ياقوت بن عبد الله الموصلي الكاتب ويعرف أيضاً بالنوري، وبالملكي (2) ، وبالشرفي، انتشر خطه في الآفاق، ولم يكن في آخر زمانه من يقاربه في حسن الخط ولا من يؤدي طريقة ابن البواب في النسخ مثله، مع فضل غزير. وكان مغرى بنقل صحاح الجوهري فكتب منها نسخاً كثيرة، كل واحدة في مجلد تباع كل نسخة بمائة دينار. وقد رأيت نسخةً منها بمصر. ووفاته سنة 618 بالموصل. وأما ياقوت الرومي ويعرف أيضاً بالحموي فإن وفاته سنة 626 بحلب عن اثنين (3) وخمسين سنة. وممن كتب على ياقوت المذكور، أبو الحسن علي بن زنكى المعروف ب «الولىّ العجمي». ووجدت في تاريخ الحافظ السخاوي أن الولي العجمي أخذ عن شهدة الكاتبة من غير واسطة ياقوت. ثم انتهت جودة الخط إلى الشيخ «عفيف الدين محمد الحلبي»، ويعرف أيضاً بالشيرازي. وعنه أخذ ولده «عماد الدين محمد»، وهو إمام النحاة والكتاب في زمانه. وممن كتب عليه الإمام العلامة شمس الدين «محمد بن علي بن أبي رقبة (4) ».",
    "foot_note": "1. كذا ضبط في الأصل. وفي ترجمة «شهدة» من وفيات الأعيان بكسر الهمزة وفتح الباء. \n2. نسبة إلى السلطان «ملكشاه أبى الفتح بن سلجوق»، كما في وفيات الأعيان. \n3. كذا في الأصل. \n4. في صبح الأعشى 3: 14 «شمس الدين بن أبي رقيبة محتسب الفسطاط، وهو ممن عاصرناه».",
    "book_id": "984",
    "new_page_number": 41
  },
  {
    "serial_number": "6337070",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 87,
    "volume_number": 1,
    "text": "وعنه الإمام العلامة «أبو علي محمد بن أحمد بن الزفتاوي» المكتب (1) ، ولد سنة 750 وسمع الحديث علي خليل بن طرنطاي (2) ، وصنف في علم الخط «منهاج الإصابة» وانتفع به أهل مصر. وقد كتب عليه الحافظ ابن حجر، وكفى به شرفاً. مات سنة 806، وكان رفيقه في الكتابة على شيوخه الإمام شهاب الدين غازي. وعنه تلميذه الإمام نور الدين الوسيمي، وعليه كتب الإمام زين الدين عبد الرحمن بن يوسف القاهري، المعروف «بابن الصّائغ» شيخ هذا الفن على الإطلاق، ولد بمصر سنة 769 ولازم شيخه المذكور في إتقان قلم النسخ حتى فاق عليه، وأحب طريقة ابن العفيف فسلكها واستفاد فيها من أبي علي الزفتاوي المصري، وصارت للزين طريقة منتزعة من طريقتي ابن العفيف وغازي، كما وقع لغازي شيخ شيخه، فإنه كتب أولاً على ابن أبي رقبة شيخ الزفتاوي المذكور وتلميذ ابن العفيف ثم تحول غازي عن طريقة ابن العفيف شيخ شيخه إلى طريقة ولدها بينها وبين طريقة الولي العجمي، ففاق أهل زمانه في حسن الخط. وانتفع النّاس بابن الصّائغ طبقة بعد طبقة؛ ونسخ عدة مصاحف وغيرها من الكتب والعقائد، وصار شيخ الكتاب في زمانه، وشهد له الحافظ ابن حجر",
    "foot_note": "1. قال القلقشندي في شأنه وشأن تلميذه: «وصنف مختصرا في قلم الثلث مع قواعد ضمها إليه في صنعة الكتابة، أحسن فيه الصنيع، وبه تخرج صاحبنا الشيخ زين الدين شعبان ابن محمد بن داود الآثاري محتسب مصر. ونظم في صنعة الخط ألفية وسمها بالعناية الربانية في الطريقة الشعبانية، لم يسبق إلى مثلها. ثم توجه بعد ذلك إلى مكة، ثم إلى اليمن والهند، ثم عاد إلى مكة فأقام بها ونبغ». وإلى هنا تنتهى سلسلة الخطاطين عند القلقشندي. وما سيأتي امتداد لهذه السلسلة التي لم يدركها. \n2. الدرر الكامنة 2: 89.",
    "book_id": "984",
    "new_page_number": 42
  },
  {
    "serial_number": "6337071",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 88,
    "volume_number": 1,
    "text": "بمهارته، وأثنى عليه في تاريخه. وقد سمع الحديث على الجمال الحلاوي. وفاته سنة 845. ثم انتهت جودة الخطّ وحسنه بعد ابن الصائغ وطبقته إلى قبلة الكتاب، وشيخ هذا الفن المستطاب، من سجدت لجلالته الأقلام، واتفق على تفضيله الخاص والعام، الإمام الأوحد، والهمام المفرد، مولانا شيخ المشايخ الشيخ حمد الله ابن الشيخ مصطفى الأماسي (1) ، المعروف «بابن الشيخ» تغمده الله برحمته. ولد تقريباً في سنة 847 بعد وفاة ابن الصّائغ بسنتين أو ثلاثة، وهو الذي استنبط هذه السموت (2) المعروفة في زماننا من خطوط المتقدمين كما وقع لغيره ممن سبق ممن اخترع الطريقة بين الطريقتين، حتى برع كتاب زمانه، وفاق أهل عصره وأوانه. وكان والده رجلا صالحا مجازا في طريقة المشايخ السّهرورديّة، وقد حل نظره على ولده المذكور حتى فاق بالرتب العلية، وكفاه فخراً أنه ليس على الأرض الآن سند يعتمد عليه إلا من طريقه، ولا طريقة يرغب إليها بين أهل الفن إلا من تحقيقه وتدقيقه. وكان ممن عاصره رجلان من كبار الكتبة في زمانهما، وهما «يحيى الرومي» و «علي بن يحيى». وفاة الأخير في سنة 866. ويقال إن الشيخ كتب على «خير الدين المرعشي» ووفاته في سنة 896. وهو على «عبد الله الصيرفي»، وهو على «أحمد بن علي» المعروف بطيب شاه السّهروردىّ، وهو على «محمد البدشي العجمي»، وهو على «الولي العجمي». ويقال إن الشيخ رحمه الله تعالى كتب بيده الشريفة أربعة وأربعين مصحفاً ونسخة من كتاب المصابيح للبغوي، وكتاب المشارق للصّغانى، كلاهما في جلد",
    "foot_note": "1. نسبة إلى «أماسية» من ولاية سيواس بتركيا. \n2. جمع سمت، وهو الطريقة.",
    "book_id": "984",
    "new_page_number": 43
  },
  {
    "serial_number": "6337072",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 89,
    "volume_number": 1,
    "text": "الغزال، وكلا من سورة الأنعام والكهف والأدعية والأوراد مقدار ألف نسخة وجملة من الأدراج والطومار، وكان قد عرضت له وهو في الثامن والثمانين من عمره حادثة الرعشة في رأسه. وأما يده وقت الكتابة فلم ترتعش قط، حتى كان خطه في آخر عمره يضاهي خطه في شبابه. وقد خدمته الملوك ومسكوا له الدواة بين يديه، وأعطي من القبول والشهرة ما لم يعط أحد من قبله ولا من بعده. وكراماته شهيرة. وتوفي تقريباً سنة 957 عن مائة وعشرة سنة. ودفن بإسكدار في صفة مقابلة للتكية المعروفة بقراجا أحمد، وذلك في زمن السلطان أبي الفتح سليمان خان ابن سليم خان، رحمه الله تعالى (1) . ثم انتهت جودة الخط وحسنه إلى تلامذته، وهم «محيي الدين جلال زاده» عاش مائة سنة وكتب سبعة وتسعين مصحفاً، و «جمال الدين الأماسي» وأخوه «عبد الله» عاش كل منهما ثمانين سنة. غير أن قواعد هؤلاء الثلاثة أكثر ميلاً إلى قواعد ياقوت المستعصمي. ومن خواص تلامذة الشيخ رحمه الله «حسام الدين خليفة» كان ماهراً في الأقلام الستة والنسخ السادة. قلد طريقة شيخه حتى غلط كثير من المميزين والمشخصين في التمييز بين خطيهما. عاش سبعة وستين سنة، وكتب تسعة وثمانين مصحفاً. ومنهم «شكر الله خليفة» كان ماهراً في الأقلام الستة والنسخ السادة وكتب عدة مصاحف وأوراد.",
    "foot_note": "1. كتب المصنف بخطه على هامش النسخة ما نصه: «جلوس سلطان محمد خان غازي في سنة 855 كان عمر الشيخ إذ ذاك تسعة سنوات. جلوس سلطان بايزيد ولى في سنة 886 كان عمر الشيخ إذ ذاك أربعين سنة. جلوس سلطان سليم غازي في سنة 918 كان عمر الشيخ إذ ذاك اثنين وسبعين سنة. جلوس سلطان سليمان بن سليم في سنة 926 ووفاته في 22 .. سنة 974».",
    "book_id": "984",
    "new_page_number": 44
  },
  {
    "serial_number": "6337073",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 90,
    "volume_number": 1,
    "text": "ومنهم «رجب خليفة» كان ماهراً في الأقلام الستة والنسخ السادة، وكتب ثلاثة وتسعين مصحفاً وجملة من سورة الأنعام والأوراد. وكان في آخر عصر الشيخ من الماهرين في الخط رجل يسمى «أحمد أفندي قراحصارى» يقال إنه أجازه الشيخ بالكتبة، ولكنه في آخره مال على طريقة ياقوت وجمع بين الطريقتين، وكتب جملة من المصاحف والأوراد. توفى سنة 963. ومن خواص تلامذته «حسين چلبى خليفة»، أحيا طريقة شيخه وكتب عدة من المصاحف. ثم جاء من بعده «دلي يوسف أفندي» فأجاد، لأنه جمع بين طريقة شيخه والطريقة الحمدية فصار مقبولا إلى الغاية، وكتب عدة مصاحف على هذه الطريقة. ثم جاء من بعده «قره علي أفندي» ثم من بعده «تكنه جى حسن چلبى» ولم يشتهر بعده في هذه السلسلة أحد. وكان من الممتازين في عصر هؤلاء ولد الشيخ لصلبه الإمام الماهر الضابط «مصطفى دده» المعروف كأبيه بابن الشيخ، سماه أبوه باسم والده تبركا. وكان قد برع في حياة والده في حسن الخط وشهد له الأفاضل، وقد أجازه والده بالكتبة وكان ماهراً في الأقلام الستة كأبيه، كتب عدة من المصاحف والأوراد والأدعية. مات عن أربعين سنة، ودفن عند والده بإسكدار. وممن كان في عصره من كبار تلامذة والده الإمام الماهر محمود أفندي الشهير ب «طنچانلى» كان مشهوراً بحسن التقليد للشيخ، كتب عدة من المصاحف الشريفة والأنعام والأذكار. وكان في عصره «عبد الكريم خليفة» المعروف بوقاية زاده، و «شكر اللّه",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 45
  },
  {
    "serial_number": "6337074",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 91,
    "volume_number": 1,
    "text": "خليفة» و «أحمد چلبى». وممن اشتهر في زمانهم «عبد الله أفندي القريمي» كتب على طريقة الشيخ مسارقة من خطوطه، لأنه يقال: إنه طلب التعليم والإجازة من الشيخ فلم يرض، واجتهد حتى صار متقناً في الفن، وكتب عدة مصاحف وانتزع لنفسه طريقة منتزعة بين طريقة الشيخ وطريقة أحمد طيب شاه واخترع منهما نوعاً من الثلث، ولكن سقط مقامه بين الكتاب والبهاء، وصار من قبيل مذبذبين بين ذلك لا إلى هؤلاء ولا إلى هؤلاء. وكان ممن أحيا طريقته من بعده رجل اسمه «أمر الله أفندي» فإنه قلده في طريقته المنتزعة مع ميله إلى الطريقة الحمدية كثيراً، بدقة طبعه ولطافة فكره، فحسن الثناء عليه والقبول. وكتب بذلك عدة من المصاحف والأنعام والأذكار. ثم انتهت جودة الخط بعد هؤلاء إلى الإمام الماهر «پير أفندي» وهو حفيد الشيخ، أجازه والده الدرويش محمد بالكتبة، وأحيا طريقة جدوده، مع ملازمة حدوده، وكتب عدة من المصاحف والأنعام. وكان ممن كتب عليه معاصرة الإمام الماهر «حسن أفندي» المعروف «بإسكدارى حسن چلبى»، تولى مشيخة السراي بعد شيخه، وكتب عدة من المصاحف والأنعام والأذكار. وعنه أخذ الإمام المجود والضابط «خالد أفندي» المعروف بالعزيز. أجاز له بالكتبة شيخه الإسكداري، وكتب عدة من المصاحف والأذكار، وسورة الأنعام. وكان في عصره من الماهرين «قره حسين أفندي» تولى مشيخة مكتب الآغا، وكتب عدة من المصاحف والأذكار، وكان موصوفاً بالجمال المفرط، وشهد له يعض تلامذته بالكرامة.",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 46
  },
  {
    "serial_number": "6337075",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 92,
    "volume_number": 1,
    "text": "ثم انتهت جودة الخط إلى الإمام الماهر الضابط المرحوم «درويش علي أفندي» الملقب بالشيخ الثاني، كتب أولاً على قره حسين أفندي المذكور، وبعد وفاته حصل التكميل والإجازة على يدي خالد العزيز. وكتب ثمانية وثمانين مصحفاً وجملة من سورة الأنعام والأوراد والأذكار. وخطه هو العمدة عليه في زماننا هذا. توفي سنة 1086 عن سبعة وثمانين سنة. ومن كراماته أنه رفع إصبعه السبابة بعد موته عند قول المغسل بالشهادتين، وغسل بماء أغلي ببراية أقلامه (1) . وكان ممن عاصره من الخطاطين رمضان بن إسماعيل، يقال إنه كتب ثلاثمائة وستين مصحفاً، وجملة من سورة الأنعام والأذكار. وفاته في سنة 1097. ومن المعاصرين أيضاً علي أفندي نفسىزاده، وعمر بيك نصوح باشازاده، ومحمد أفندي الإمام، وعلى أفندي قاشقجىزاده، وأحمد أفندي قزقابان زاده، ومحمد أفندي نقاش زاده، وخليل أفندي الملقب بالحافظ، ومحمد أفندي عرب زاده المتوفى سنة 1122، ومحمد أفندي خواجة زاده. ويقال إن هذين الأخيرين أجاز لهما الدرويش علي. ومنهم إسماعيل أفندي ترك، توفي غريقاً في البحر سنة 1085. ويوسف أفندي المتوفى في سنة 1119 وهذان الاثنان كانا بمصر. ثم انتهت جودة الخط إلى (تلامذة درويش علي)، منهم مصطفى أفندي الأيّوبى المعروف بسيولجىزاده، وفاته في سنة 1099.",
    "foot_note": "1. مثله ما روى في أخبار أبى الفرج ابن الجوزي، أنه جمعت براية أقلامه التي كتب بها حديث رسول اللّه صلى الله عليه وسلم فحصل منها شيء كثير، وأوصى أن يسخن بها الماء الذي يغسل به بعد موته، ففعل ذلك فكفت وفضل منها. انظر ترجمته في وفيات الأعيان (1: 279).",
    "book_id": "984",
    "new_page_number": 47
  },
  {
    "serial_number": "6337076",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 93,
    "volume_number": 1,
    "text": "ومنهم إسماعيل أفندي خليفة المعروف بابن علي، كتب أربعة وأربعين مصحفاً، وكمل مصحف شيخه الثامن والثمانين، وهو آخر المصاحف التي مات وخلاه إلى سورة الأنعام، فكمله بخطه. ومنهم أحمد أفندي قزانجىزاده كان مشهوراً بحسن التقليد لخط الشيخ، كتب تسعة عشر مصحفاً وعدة من سورة الأنعام والأذكار، توفي سنة 1116. ومنهم الإمام الماهر الضابط عثمان أفندي المعروف بالحافظ، الملقب بالشيخ الثالث، كتب جملة من المصاحف والأنعام والأوراد والأذكار، توفي سنة 1112. ومنهم أحمد أفندي المعروف بشيخ زاده، كتب سبعة عشر مصحفاً وجملة من سورة الأنعام والأذكار ودلائل الخيرات. ومنهم فضل اللّه أفندي، وفاته في سنة 1107، كتب عدة من المصاحف والأوراد والأذكار. ومنهم عنبر مصطفى آغا، كان متين اليد إلى الغاية، كتب عدة من المصاحف والأنعام، توفي سنة 1117. ومنهم الإمام الماهر عمر أفندي كاتب السراي. ومنهم جابىزاده محمد أفندي، وهما من جملة خلفائه. ومن (معاصري هذه الطبقة) كوچك درويش على أفندي، وكوچك عرب زاده محمد أفندي، وأحمد أفندي الدرويش، وعبد الله أفندي الوفائي، وإبراهيم أفندي ابن رمضان، وعلي أفندي إمام أمير آخور.",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 48
  },
  {
    "serial_number": "6337077",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 94,
    "volume_number": 1,
    "text": "ومن خواص خلفاء الدرويش علي الإمام الماهر المجود الضابط، مجدد الرسوم الحمدية، في الديار المصرية، مولاه ومعتقه حسين أفندي الجزائري، لازم خدمة أستاذه حتى برع وفاق، كتب ربعة شريفة في ثلاثين جزءاً، ومصحفين شريفين أحدهما في الشام والثاني بمصر، وشرع في الثالث فبلغ إلى النصف منه ومات، فكمله فيما بعد المرحوم حسن الضيائي. وممن كتب على فضل الله أفندي محمد أفندي الشهري المعروف بالبستانجي. وممن كتب على عمر أفندي كاتب السراى صالح أفندي، المعروف بحمامجىزاده. ومن كتب على أحمد أفندي شيخ زاده ولده الماهر الضابط إبراهيم أفندي شيخ زاده. ثم انتهت جودة الخط إلى (تلامذة الجزائري)، منهم الإمام الماهر الضابط المجود سليمان أفندي الملقب بالشاكري. ومنهم الإمام الماهر الضابط المجود السيد محمد بن إبراهيم المقدسي الملقب بالنوري. ومنهم مصطفى أفندي خليفة، وقاسم أفندي، وغير هؤلاء. وقد جود الشاكري أيضاً في مبادئ أمره على محمد خواجه زاده، ومحمد الشهري البستانجي، وحافظ عثمان فالبستانجي كتب على فضل الله أفندي وحافظ عثمان كلاهما على الدرويش علي. فمن كتب على الشاكري الإمام الضابط المعمر حسن بن حسن المعروف",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 49
  },
  {
    "serial_number": "6337078",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 95,
    "volume_number": 1,
    "text": "بالضيائي، ولد سنة 1098، وكتب في مبدأ أمره على والده ثم على شيخه السيد علي، وعلى صالح أفندي المعروف بحمامجىزاده، وأدرك الجزائري أيضاً بعد وفاة والده باثني عشر (1) سنة، وكتب عليه من غير واسطة، وقد أجازه بالكتبة الشاكرى، وحمامجىزاده، الأخير عن عمر أفندي كاتب السراي عن الدرويش علي. كان رحمه الله كثير الإتقان شديد الاحتراز، على نهج السلف الصالح في التحري والضبط في سائر ما يكتبه، كما هو مشاهد في خطوطه. توفى سنة 1182 عن أربع وثمانين سنة. وممن كتب على الشاكري الأستاذ الفاضل الماهر الضابط المجود الشيخ شهاب الدين أحمد الأفقم المكنى بأبي الإرشاد، وقد برع في الفنّ واجتهد حتّى فال الشهرة والقبول، وكتب عدة من نسخ الدلائل والأوراد والأذكار وغيرها. وفي الموجودين من تلامذته الآن مولانا السيد إبراهيم الرويدي الحسيني، المكنى بأبي الفتح الحمامي الوفائي، والشيخ أحمد المكنى بأبي العز، بارك الله في مدتهما، ونفع بهما المسلمين. وممن كتب على السيد محمد النوري رحمه الله تعالى خلق كثير على اختلاف الطبقات. وأجاز بالكتبة من لا يحصى. فمن أشهر تلامذته الإمام الماهر الضابط المرحوم عبد الله أفندي المولوي، الملقب بالأنيس رحمه الله تعالى، وقد جود أولاً على الشاكري وغيره، وكان تكميله وإجازته على يد السيد محمد النوري. ومنهم الجناب المكرم الأمير إسماعيل أفندي الملقب بالوهبىّ، والجناب",
    "foot_note": "1. كذا في الأصل، والوجه «باثنتي عشرة».",
    "book_id": "984",
    "new_page_number": 50
  },
  {
    "serial_number": "6337079",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 96,
    "volume_number": 1,
    "text": "المكرم الأمير أحمد أفندي الملقب بالشكري، بارك اللّه في مدّتهما ونفع بهما المسلمين. فممن كتب على الأنيس من طرزت هذا النبذة باسمه الشريف الضابط، الجناب المكرم، والملاذ المفخم، الأمير حسن أفندي تابع المرحوم الحاج علي آغا، وكيل دار السعادة، والملقب بالرشدي، أرشده الله لكل خير، وبارك في مدته وحياته، ودفع عنه كل ضير، فهو الذي أحيا هذه الطريقة، وجدد رسومها في الحقيقة، وأثنت عليه الألسن من كل جانب، وأعطى القبول والحب ونال أعلى المراتب، فالله تعالى يحرسه بعين عنايته، ويحمي فضله من عين الحسود ونكايته.",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 51
  },
  {
    "serial_number": "6337080",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 97,
    "volume_number": 1,
    "text": "خاتمة نسأل الله حسن الخاتمة، وفيها فصلان:  الأول: في بيان أدب التلميذ مع الشيخ فاعلم أن الطالب لهذا الفن والراغب إليه لا بد له من شيخ يريه دقائق الفنّ ويحقّق له حقائقه، ويكشف له رموزه ويفتح له لغوزه ويقرب له رقائقه؛ فقد ورد في بعض الآثار، عن بعض الأخيار: «لولا المربي، ما عرفت ربي». فإذا يسر الله له الأستاذ فله معه شروط، منها حفظ مقامه في الغيبة والحضور على قدر الإمكان، فلا يرفع صوته على صوته، ولا يقول له من شيء قال: لم هذا؟ فإن أشكل عليه شيء سأل بيانه بالأدب. ومنها عدم محادثة أحد بجانبه في حضرته إلّا في أمر ضرورىّ. ومنها أن لا يضحك في حضرة أستاذه إلا تبسماً لمقتض. ومنها عدم مسابقة قوله، بل يسكت إلى أن ينتهي فيما يقوله. ومنها أن يجلس في حضرته كهيئة التشهد يسارق وجه أستاذه النظر. ومنها عدم مخاصمته لأحد من أتباع أستاذه ومن ينتسب إليه. ومنها حفظ متعلّقاته عن الجرأة عليها، فلا يلبس ثوبه ولا نعله، ولا يركب دابته، ولا يجلس على سجادته، ولا يشرب من الإناء الذي أعد له إلا أن يأذن له في شيء من ذلك. ومنها أن يداوم على الإدمان والاجتهاد فيما يقول له ويأمره به الأستاذ. فهذه آداب التلميذ مع الأستاذ، من ابتلى باختلال شيء منها تساهلاً أو غفلة لا يفلح أبداً.  الثاني: نصيحة لسائر الخطاطين قال الله تعالى في كتابه العزيز: وَمَا الْحَياةُ الدُّنْيا إِلَّا مَتاعُ الْغُرُورِ. وقد ذكر العارفون بهذا الفن أن من أكبر موجبات التكميل للطالب في هذا",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 52
  },
  {
    "serial_number": "6337081",
    "category_id": "29",
    "category": "كتب اللغة",
    "book_title": "حكمة الإشراق في كتّاب الآفاق",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 98,
    "volume_number": 1,
    "text": "الفنّ ترك العرور في نفسه، وترك الترفع على أبناء جنسه، فإنه ربما اجتهد في الكتابة كثيراً فيأتيه الشيطان فيوسوس له بالغرور، ويوقعه في الشرور، ومتى سلم من هذا يرجى له القبول، والرقي لمراتب الوصول. ومتى تساهل في أمر نفسه، وتكبر على أبناء جنسه، عوقب بالحرمان والوسواس، وسقط عن مرتبته التي كان فيها عند الله وعند الناس. نسأل الله العفو والرضا، والتجاوز عما مضى، إنه على كل شيء قدير، وبكل فضل جدير، وحسبنا الله ونعم الوكيل، ولا حول ولا قوة إلا بالله العلي العظيم. وصلى الله على سيدنا ومولانا محمد وعلى آله وصحبه وسلم تسليماً كثيراً إلى يوم الدين. أملي هذه الحروف على الاستعجال وصنوف الاشتغال، العبد المقصر المعترف بذنبه، الفقير محمد مرتضى الحسيني سامحه الله بمنه وكرمه، وذلك في مجالس آخرها 12 من شهر ذي الحجة الحرام ختام سنة 1184 ختمت بخير وعلى خير. آمين آمين آمين",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 53
  }
]