[
  {
    "text": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)\nAuthor: عبد الرحمن بن أبي بكر جلال الدين السيوطي\nYear: 911",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "new_page_number": 1
  },
  {
    "text": "sn: 7287\nbook_title: الوفية باختصار الألفية (ألفيةِ ابن مالك)\nbook_link: https://shamela.ws/book/105\nbook_id: 105\nauthor_name: عبد الرحمن بن أبي بكر جلال الدين السيوطي\nauthor_year: 911\nnickname: Null\nauthor_link: https://shamela.ws/author/7\nauthor_ID: 7\neditor: حمزة مصطفى حسن أبو توهة (دراسة وتحقيق)\npublisher: مؤسسة «عِلْم» لإحياء التراث والخدمات الرقمية\nedition: الأولى، 2019 م - 1440 هـ\npages: 97\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: النحو والصرف\ncategory_id: 31",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "new_page_number": 2
  },
  {
    "serial_number": "6606222",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Grammar and Morphology. Book: Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik). Author: Jalal al-Din al-Suyuti (Died: 911 AH). Study and Verification: Hamza Mustafa Hasan Abu Toha. Publisher: ‘Ilm’ Foundation for Heritage Revival and Digital Services. Edition: First, 2019 AD - 1440 AH. Number of Pages: 97 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 26 Rabi' al-Awwal 1442.\nBook: Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik). Author: Jalal al-Din al-Suyuti (Died: 911 AH). Study and Verification: Hamza Mustafa Hasan Abu Toha. Publisher: ‘Ilm’ Foundation for Heritage Revival and Digital Services. Edition: First, 2019 AD - 1440 AH. Number of Pages: 97 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 26 Rabi' al-Awwal 1442.\nAuthor: Jalal al-Din al-Suyuti (Died: 911 AH). Study and Verification: Hamza Mustafa Hasan Abu Toha. Publisher: ‘Ilm’ Foundation for Heritage Revival and Digital Services. Edition: First, 2019 AD - 1440 AH. Number of Pages: 97 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 26 Rabi' al-Awwal 1442.\nStudy and Verification: Hamza Mustafa Hasan Abu Toha. Publisher: ‘Ilm’ Foundation for Heritage Revival and Digital Services. Edition: First, 2019 AD - 1440 AH. Number of Pages: 97 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 26 Rabi' al-Awwal 1442.\n[Book numbering corresponds to the printed version]. Publication Date in Shamela: 26 Rabi' al-Awwal 1442.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 3
  },
  {
    "serial_number": "6606223",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 1,
    "volume_number": 1,
    "text": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik). A summary by the scholar Imam Jalal al-Din al-Suyuti (Died 911 AH). Study and Verification by Hamza Mustafa Hasan Abu Toha.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 4
  },
  {
    "serial_number": "6606224",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 4,
    "volume_number": 1,
    "text": "Publisher's Introduction. Praise be to Allah who said: {Indeed, We have sent it down as an Arabic Qur'an}, and peace and blessings be upon the one who was given the comprehensive words, who taught his companions to read the Quran fresh and tender. To proceed: The Proof, the Scholar Imam Ibn Malik al-Andalusi al-Jayyani wrote his Alfiyah, which became the destination for students, and was explained by many knowing scholars, and was also summarized. Imam al-Suyuti, may Allah have mercy on him, was a man of high ambition and the renewer of his era; he mastered arts and sciences and loved to have a share in that. Thus, he summarized Ibn Malik's Alfiyah into (635) verses. Surprisingly, Egypt was devoid of a copy of this summary of the Alfiyah; indeed, the entire world was devoid of it as far as we know, except for Andalusia (Spain). Allah preserved this summary for us in the Escorial Library in Spain. It is a precious copy written by his noble student, the scholar Imam Muhammad bin Ali al-Dawudi, author of Tabaqat al-Mufassirin. What a blessed copy, in the handwriting of a blessed Imam, for a blessed Imam, summarizing the Alfiyah of a blessed Imam. It was verified by a virtuous, blessed, occupied, achieving, and artistic brother, the virtuous brother Hamza Abu Toha, may Allah keep him safe, from the holy lands of Sham, Palestine. Praise be to Allah who honored us with publishing it. We ask Allah for benefit through it, sincerity, and acceptance; He is the Guardian of the answer, Glory be to Him. Written by the servant of the Islamic Nation's heritage, Abd al-Ati Muhyi al-Sharqawi Abu Yaqub al-Azhari.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 5
  },
  {
    "serial_number": "6606225",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 5,
    "volume_number": 1,
    "text": "Introduction. The science of grammar has had a plentiful share of scientific poems. Some of them collected most chapters of grammar, such as Alfiyat Ibn Mu'ti, Alfiyat Ibn Malik, Alfiyat al-Athari, and Alfiyat al-Suyuti, and before them Mulhat al-I'rab. Others specialized in singular issues, such as al-Qasidah al-Majradiyah, Al-Muradi's poem on sentences, Al-Zawawi's poem on rules of parsing, and the Mimiyah poem by Hazim al-Qartajanni. Perhaps the first poem in grammar—as it is said—is the poem of Al-Khalil bin Ahmad al-Farahidi, though the scholar Dr. Al-Tanahi questioned this attribution to Al-Khalil bin Ahmad and preferred that the first era of poems was after the fourth century (1). The most famous of these poems are Mulhat al-I'rab by Al-Hariri, Alfiyat Ibn Mu'ti, Al-Wafiyah by Ibn al-Hajib, Alfiyat Ibn Malik, and Alfiyat al-Suyuti called Al-Faridah. Alfiyat Ibn Malik is the most famous absolutely; if the word 'Alfiyah' is used, it refers to it without ambiguity. Since Alfiyat Ibn Malik is the most useful of grammar poems, major scholars dedicated themselves to explaining it, teaching it in their circles, and writing comments, restrictions, footnotes, and explanations for the evidences in its explanations, and some summarized it. Among the most important of these summaries is \"Al-Wafiyah bi-Ikhtisar al-Alfiyah\" by Imam Jalal al-Din al-Suyuti. The resolve was set to dedicate oneself to this summary for verification and study, due to the benefit it holds for students, in the form of summarizing the grammatical benefit with fewer words while preserving the rule, or perhaps adding a benefit over the Alfiyah. And Allah is the Granter of success. Hamza Mustafa Hasan Abu Toha 23/7/2018.",
    "foot_note": "1. See: Al-Fusul al-Khamsun 29.",
    "book_id": "105",
    "new_page_number": 6
  },
  {
    "serial_number": "6606226",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 7,
    "volume_number": 1,
    "text": "The Study",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 7
  },
  {
    "serial_number": "6606227",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 9,
    "volume_number": 1,
    "text": "Biography of Imam Ibn Malik (1). He is Muhammad bin Abdullah bin Abdullah bin Malik, the unique scholar, Jamal al-Din, Abu Abdullah al-Ta'i, al-Jayyani, al-Shafi'i, the Grammarian. He became famous as \"Ibn Malik,\" attributed to his great-grandfather, and his Kunya was Abu Abdullah. He is famous beyond description, so we need not elaborate on his biography. There is a difference regarding his year of birth; Al-Hawari and Ibn Qadi Shuhbah believed he was born in the year 598 AH. Ibn Shakir, Ibn Kathir, Al-Firuzabadi, and Al-Suyuti believed he was born in the year 600 AH. Al-Safadi believed he was born in the year 601 AH. The most correct view is that he was born in 598 AH, based on what his contemporary Kamal al-Din bin al-Adim said, that Ibn Malik told him so. Ibn Malik was born in the city of Jaen in Andalusia, received knowledge there, then traveled to the lands of the East, then Egypt, and finally settled in Damascus, where he died in the middle of the year 672 AH. Many people studied under Ibn Malik, including: 1. Muhammad bin Abd al-Rahman bin Muhammad bin Abd al-Rahman al-Sulami al-Dimashqi al-Hanafi, Badr al-Din, known as Ibn al-Fuwaira (d. 672). 2. Muhammad bin Abd al-Qawi bin Badran al-Mardawi al-Jama'ili al-Hanbali, Abu Abdullah, Shams al-Din (d. 699 AH). 3. Muhammad bin Abd al-Rahman bin Yusuf bin Muhammad al-Ba'labkki al-Hanbali, Abu Abdullah, Shams al-Din (d. 699 AH).",
    "foot_note": "1. See: Al-Wafi bil-Wafiyat 3/285, Tabaqat al-Shafi'iyyah al-Kubra 8/67, Bughyat al-Wu'at 1/130, Nafh al-Tib 2/228, and Alfiyat Ibn Malik 11.",
    "book_id": "105",
    "new_page_number": 8
  },
  {
    "serial_number": "6606228",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 10,
    "volume_number": 1,
    "text": "4. Muhammad bin Mansur bin Musa bin Muhammad al-Halabi al-Shafi'i, Abu Abdullah, Shams al-Din (d. 700 AH). 5. Muhammad bin Ghalib bin Yunus bin Shu'bah al-Ansari, Abu Abdullah, Shams al-Din (d. 702 AH). 6. Abu Bakr bin Ya'qub bin Salim al-Dayri al-Rahbi al-Shafi'i, Shihab al-Din (d. 703 AH). 7. Muhammad bin al-Fadl bin Sultan bin Imad bin Tamam al-Ja'bari al-Halabi, known as Ibn al-Khatib (d. 713 AH). 8. Isma'il bin al-Hussein bin Abi al-Sa'ib bin Abi al-Aish al-Ansari al-Dimashqi, Majd al-Din (d. 721 AH). 9. Muhammad bin Isma'il bin Ibrahim al-Dimashqi al-Ansari al-Abbadi, Abu Abdullah, known as Ibn al-Khabbaz (d. 756 AH). Ibn Malik had three children, the most famous being his son Badr al-Din Abu Abdullah, his eldest son, who died in 686 AH; his son Taqi al-Din, nicknamed 'The Lion' (Al-Asad), for whom Ibn Malik wrote 'Al-Muqaddimah Al-Asadiyah', who died in 699 AH; and his son Shams al-Din, who died in 719 AH. Among Ibn Malik's works are 'Al-Mu'assal fi Nazm al-Mufassal', which he then dissolved and called 'Sabk al-Manzum wa Fakk al-Makhtum'—and whoever says its name is 'Fakk al-Manzum wa Sabk al-Makhtum' has contradicted transmission and reason. Among Ibn Malik's books are 'Al-Kafiyah Al-Shafiyah' (three thousand verses) and its explanation; 'Al-Khulasah' which is the summary of Al-Kafiyah Al-Shafiyah; 'Ikmal al-I'lam bi-Muthallath al-Kalam', a large volume with many benefits indicating great knowledge; 'Lamiyat al-Af'al' and its explanation; 'Fa'ala wa Af'ala'; 'Al-Muqaddimah Al-Asadiyah' written in the name of his son Al-Asad;",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 9
  },
  {
    "serial_number": "6606229",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 11,
    "volume_number": 1,
    "text": "and 'Uddat al-Lafiz wa Umdat al-Hafiz', 'Al-Nazm al-Awjaz fima Yuhmaz', 'Al-I'tidad fi al-Za' wa al-Dad' (a volume), 'I'rab Mushkil al-Bukhari', 'Tuhfat al-Mawdud fi al-Maqsur wa al-Mamdud', and others such as the explanation of Al-Tashil (1). His Status: Al-Dhahabi said: \"He was an Imam in Recitations (Qira'at) and their defects; he composed a Dal-rhymed poem (Daliyyah) containing symbols equivalent to Al-Shatibiyyah. As for language, he was the ultimate authority in citing its rarities and knowing its obscure terms. As for grammar and morphology, he was an ocean that could not be kept up with and a scholar that could not be rivaled. As for the Arabic poetry used as evidence for language and grammar, the leading Imams were bewildered by him and amazed at where he retrieved it from. Composing poetry was easy for him, whether Rajaz, Tawil, Basit, or others, along with his solid religion, truthful tongue, frequent voluntary prayers, good bearing, softness of heart, perfect intellect, dignity, and deliberation\" (2). Ibn Kathir said: \"He advanced and prevailed in the arts of grammar and recitations, achieving a great deal in them, and surpassing many who preceded him in this regard, along with religion, truthfulness, good bearing, frequent voluntary prayers, perfect intellect, dignity, and friendliness\" (3).",
    "foot_note": "1. See: Nafh al-Tib 2/225. \n2. See: Tarikh al-Islam 15/249. \n3. See: Tabaqat al-Shafi'iyyin 908.",
    "book_id": "105",
    "new_page_number": 10
  },
  {
    "serial_number": "6606230",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 12,
    "volume_number": 1,
    "text": "Biography of Imam Al-Suyuti (1). His Name: Abd al-Rahman bin al-Kamal Abi Bakr bin Muhammad bin Sabiq al-Din bin al-Fakhr Uthman bin Nazir al-Din Muhammad bin Sayf al-Din Khidr bin Najm al-Din Abi al-Salah Ayyub bin Nasir al-Din Muhammad bin Sheikh Humam al-Din al-Humam al-Khudayri al-Asyuti. Al-Suyuti said: \"As for my great-grandfather Humam al-Din, he was among the people of spiritual reality (Ahl al-Haqiqah). As for our attribution 'Al-Khudayri', I do not know what this refers to except Al-Khudayriyyah, a quarter in Baghdad. Someone I trust told me that he heard my father—may Allah have mercy on him—mention that his great-grandfather was a non-Arab or from the East, so it appears the attribution is to the mentioned quarter. I was born after Maghrib on the eve of Sunday, the beginning of Rajab in the year 849. I was carried during my father's life to Sheikh Muhammad al-Majdhub, a man who was among the major saints near the Nafisi Shrine, and he blessed me. I grew up an orphan, memorized the Quran while I was under eight years old, then memorized Al-Umdah, Minhaj al-Fiqh and al-Usul, and Alfiyat Ibn Malik. I began engaging in knowledge from the beginning of the year 64. I took Fiqh and Grammar from a group of Sheikhs. I took inheritance law (Fara'id) from the scholar, the inheritance expert of his time, Sheikh Shihab al-Din al-Sharmasahi, who was said to have reached a very old age, well over a hundred, and Allah knows best. I read to him his explanation of Al-Majmu', and I was granted a license to teach Arabic at the beginning of the year 66.",
    "foot_note": "1. This biography is transferred from Al-Suyuti's biography of himself in Husn al-Muhadarah 1/335.",
    "book_id": "105",
    "new_page_number": 11
  },
  {
    "serial_number": "6606231",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 13,
    "volume_number": 1,
    "text": "I authored in this year; the first thing I authored was [on] Isti'adha (Seeking Refuge) and Basmalah. I presented it to our Sheikh, Sheikh al-Islam Alam al-Din al-Bulqini, and he wrote a commendation for it. I stayed with him in Fiqh until he died, then I stayed with his son, reading to him from the beginning of 'Al-Tadrib' by his father up to Agency (Wakalah). I heard from him from the beginning of 'Al-Hawi Al-Saghir' to Number (Al-Adad), from the beginning of 'Al-Minhaj' to Zakat, from the beginning of 'Al-Tanbih' to near the chapter of Zakat, a piece of 'Al-Rawdah' from the chapter of Judiciary, a piece of 'Takmilat Sharh al-Minhaj' by Al-Zarkashi, and from Reviving Dead Land (Ihya' al-Mawat) to Wills or thereabouts. He licensed me to teach and issue fatwas from the year 76 and attended my inaugural lecture. When he died in the year 78, I stuck to Sheikh al-Islam Sharaf al-Din al-Manawi, reading a piece of 'Al-Minhaj' to him and hearing it from him regarding division, except for sessions I missed. I heard lessons from the explanation of 'Al-Bahjah' and a footnote on it, and from the Tafsir of Al-Baydawi. In Hadith and Arabic, I stuck to our Sheikh, the scholar Imam Taqi al-Din al-Shibli al-Hanafi; I attended him for four years. He wrote a commendation for me on the explanation of Alfiyat Ibn Malik and on 'Jam' al-Jawami' in Arabic, which I authored, and he testified more than once to my advancement in sciences with his tongue and pen. I stuck to our Sheikh, the scholar, the Teacher of Existence, Muhyi al-Din al-Kafiji for fourteen years, taking from him the arts of Exegesis (Tafsir), Principles (Usul), Arabic, Semantics (Ma'ani), and others, and he wrote me a great license. I attended numerous lessons with Sheikh Sayf al-Din al-Hanafi in 'Al-Kashhaf', 'Al-Tawdih' and its footnote, 'Talkhis al-Miftah', and 'Al-Adud'. I began classifying (writing books) in the year 66. I traveled, praise be to Allah, to the lands of Sham, Hijaz, Yemen, India, Morocco, and Takrur. When I performed Hajj, I drank Zamzam water for several matters, among them that I reach the rank of Sheikh Siraj al-Din al-Bulqini in Fiqh and the rank of Hafiz Ibn Hajar in Hadith.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 12
  },
  {
    "serial_number": "6606232",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 14,
    "volume_number": 1,
    "text": "I issued fatwas from the beginning of the year 71, and held dictation sessions for Hadith from the beginning of the year 72. I was blessed with deep knowledge in seven sciences: Exegesis, Hadith, Fiqh, Grammar, Semantics (Ma'ani), Rhetoric (Bayan), and Badi' (Metaphors/Style), according to the method of the Arabs and eloquent scholars, not the method of the Persians and philosophers. What I believe is that what I have reached in these seven sciences, other than Fiqh and the transmissions I have seen in them, none of my Sheikhs reached or stood upon, let alone those below them. As for Fiqh, I do not say that; rather, my Sheikh in it had a broader view and a longer reach. Below these seven in knowledge are: Principles of Jurisprudence (Usul al-Fiqh), Dialectics (Jadal), and Morphology (Tasrif). Below them are Composition (Insha'), Epistolography (Tawassul), and Inheritance (Fara'id). Below them are Recitations (Qira'at), which I did not take from a Sheikh. Below them is Medicine. As for the science of Arithmetic (Hisab), it is the hardest thing for me and the furthest from my mind; if I look into a problem related to it, it is as if I am trying to carry a mountain. The tools of Ijtihad have been completed for me now, praise be to Allah Almighty. I say this speaking of Allah's blessing, not out of pride; for what is there in this world that seeking to acquire it would be a source of pride, when departure is imminent, gray hair has appeared, and the best of life is gone! If I wished to write a book on every issue with its sayings, transmitted and analogical evidences, their contexts, refutations, answers, and weighing between the differences of schools of thought, I would be able to do that by Allah's grace, not by my power or strength. There is no power or strength except by Allah; what Allah wills happens; there is no strength except by Allah. In the early stages of seeking knowledge, I read something in the science of Logic, then Allah cast a hatred for it into my heart, and I heard that Ibn al-Salah issued a fatwa prohibiting it, so I left it for that reason, and Allah Almighty compensated me for it with the science of Hadith, which is the noblest of sciences.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 13
  },
  {
    "serial_number": "6606233",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 15,
    "volume_number": 1,
    "text": "As for my Sheikhs in narration, by hearing and license, they are many. I listed them in the dictionary (Mu'jam) in which I collected them, and their number is about one hundred and fifty. I did not engage much in hearing narration because I was occupied with what is more important, which is reading for comprehension (Dirayah). Ended from Husn al-Muhadarah. Al-Suyuti—may Allah have mercy on him—died in the year 911 AH.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 14
  },
  {
    "serial_number": "6606234",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 16,
    "volume_number": 1,
    "text": "The Book. Documentation and attribution of this book to Al-Suyuti is something no two people would differ on, nor two goats would butt heads over. This has been proven to me beyond doubt. I relied on several things for this, including: 1. Al-Suyuti mentioned it in his book 'Al-Tahadduth bi-Ni'mat Allah' among his works, saying: \"Al-Wafiyah bi-Ikhtisar al-Alfiyah, six hundred verses\" (1). 2. Al-Suyuti mentioned it in the index of his works saying: \"Al-Wafiyah bi-Ikhtisar al-Alfiyah\" (2). 3. Haji Khalifa said when mentioning the Alfiyah and Al-Suyuti's explanation of it: \"He has a summary of the Alfiyah in six hundred and thirty lines, and he named it 'Al-Wafiyah'\" (3). 4. This appears clearly in the introduction of the book, where Al-Suyuti said in the first verse: The hoper of the Exalted's mercy says... A servant of Rahman, the son of Al-Suyuti (4)",
    "foot_note": "1. See: Al-Tahadduth bi-Ni'mat Allah 113 and 135. \n2. See: Fahras Mu'allafat al-Suyuti 11. \n3. See: Kashf al-Zunun 1/152. \n4. The verse is not metrically balanced with this narration.",
    "book_id": "105",
    "new_page_number": 15
  },
  {
    "serial_number": "6606235",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 17,
    "volume_number": 1,
    "text": "Definition of Alfiyat Ibn Malik. Imam Ibn Malik composed his Alfiyah in the city of Hama at the request of Imam Sharaf al-Din al-Barzi. Ibn al-Wardi said: \"Our Sheikh, the Chief Judge Sharaf al-Din Hibatullah bin al-Barzi told me: Sheikh Jamal al-Din organized 'Al-Khulasah Al-Alfiyah' in Hama at our place for my study. I was a young man and served him, and I saw the blessing of my service to him\" (1). This Alfiyah contains seventy-eight chapters and sections, containing most of the purposes of grammar, as Ibn Malik said at its conclusion: It included most of the important matters in verse (2). This Alfiyah is originally a summary of a large poem by Ibn Malik called \"Al-Kafiyah Al-Shafiyah\", the number of its verses being two thousand seven hundred and fifty-something. Ibn Malik said at the conclusion of Al-Kafiyah Al-Shafiyah (3): Its verses are two thousand and seven hundred... And fifty and something completed it. He mentioned in the Alfiyah that this Alfiyah is a summary of Al-Kafiyah Al-Shafiyah, saying: The Summary (Al-Khulasah) enumerated from Al-Kafiyah (4). Allah wrote fame and spread for this Alfiyah; riders traveled with it, people carried it everywhere, and major scholars gathered in its courtyards explaining and extracting its hidden gems.",
    "foot_note": "1. See: Tarikh Ibn al-Wardi 2/216. \n2. See: Al-Alfiyah p. 188, verse 999. \n3. See: Sharh al-Kafiyah al-Shafiyah 4/2252. \n4. See: Al-Alfiyah p. 188, verse 1000.",
    "book_id": "105",
    "new_page_number": 16
  },
  {
    "serial_number": "6606236",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 18,
    "volume_number": 1,
    "text": "Among the most important of these explanations are the explanation of Ibn al-Nazim, explanation of Abu Hayyan, explanation of Al-Muradi, explanation of Ibn Aqil, explanation of Ibn Hisham, explanation of Al-Shatibi, explanation of Al-Makudi, explanation of Al-Suyuti, and many other explanations. Some scholars summarized the Alfiyah, among them Muhammad bin Muhammad bin Ali bin Umar al-Isnawi, as well as Imam Ibn al-Wardi who summarized the Alfiyah in one hundred and fifty verses calling it 'Al-Tuhfah Al-Wardiyyah', then he explained this summary and it has been printed. Among them is a summary called 'Al-Mukhtasar al-Mufid' by Mahmud Mahfuz al-Dimashqi; a copy of it exists in Cairo (Than 2: 158). And among these summaries is this summary which we are verifying: 'Al-Wafiyah bi-Ikhtisar al-Alfiyah' by Imam Al-Suyuti.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 17
  },
  {
    "serial_number": "6606237",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 19,
    "volume_number": 1,
    "text": "Al-Wafiyah bi-Ikhtisar al-Alfiyah. The number of verses in Al-Wafiyah reached six hundred and thirty-five verses, which is approximately two-thirds the size of the Alfiyah. Al-Suyuti was truthful when he said in the conclusion of Al-Wafiyah (1): I organized it in about two-thirds of its original... And you will never see a summary like it. This does not contradict what Haji Khalifa said in Kashf al-Zunun, where he said: \"He has a summary of the Alfiyah in six hundred and thirty lines, and he named it 'Al-Wafiyah'\" (2), because this count is approximate, as is the custom of scholars in determining the number of verses in poems. A questioner might ask: What is the benefit of Al-Wafiyah? I say that in addition to being a summary of the Alfiyah that reduces the wording of the grammatical rule, it was in many places of added benefit. Look at Al-Suyuti's saying: And 'Ya' of the self with the verb follows... The Nun of protection, and in \"Layta\" connect it. And its deletion is anomalous, and the reverse of it is \"La'alla\"... In four (3) give choice, and Yahya (4) the connection was rare. Look at his saying: \"and Yahya the connection was rare\"; it is an addition to the wording of the Alfiyah. And his saying: And possessor of addition becomes a proper noun... If it prevails, or \"Al\" (5), and its deletion (6) requires. If you add or call out, I said the Lam in... \"Allah\" was not added and did not define. Look at him adding the disagreement regarding the Alif and Lam in the majestic word \"Allah\".",
    "foot_note": "1. See verse 632. \n2. See: Kashf al-Zunun 1/152. \n3. He means the abrogating letters other than La'alla and Layta, which are: Inna, Anna, Lakinna, and Ka'anna. \n4. He refers to Imam Al-Farra, Abu Zakariya Yahya bin Ziyad. See his opinion in Sharh Al-Muradi 1/381. \n5. Meaning: And possessor of \"Al\" becomes a proper noun if it prevails. \n6. Meaning: deletion of Al.",
    "book_id": "105",
    "new_page_number": 18
  },
  {
    "serial_number": "6606238",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 20,
    "volume_number": 1,
    "text": "When you return to the places of initiating with an indefinite noun, and to his saying: And \"raghbatun fi al-khayri khayratun\", and text... Of a ruling gives benefit, and that which is general and specific (1). You see him adding \"and that which is general and specific\". Among the characteristics of this summary is that—despite its small size—it did not neglect comparing Ibn Malik's words with his other books. He said: And similar to it in \"Khiltanihi\", \"Kuntuhu\"... The connection has been preferred, and I saw him (2). Contradict in Al-Tashil (3) following a text... Of Amr (4), and prioritize in connection the more specific. And he said: And he added in Kafiyah (5) other things... Possessing fame, and other than these is rare. Al-Suyuti did not neglect citing scholars' opinions in this summary. He said: And what is in \"Bi'sa ma ishtaraw\" (6) is a discriminator (7)... And Sibawayh (8) [said] it is a doer and they distinguished.",
    "foot_note": "1. Abu Hayyan attributed the permissibility of starting with an indefinite noun to two things: Generality and Specificity. He said in his poem \"Nihayat al-I'rab\": And everything I mentioned in the division returns to specification and generalization. See: Al-Ashbah wal-Naza'ir 2/113. \n2. Meaning: I saw Ibn Malik. \n3. See: Tashil al-Fawa'id 27. \n4. See: Al-Kitab 2/363, and Sharh al-Tashil 1/153. \n5. See: Sharh al-Kafiyah al-Shafiyah 4/1745 - 1746. \n6. Al-Baqarah 90. \n7. See: Al-Tibyan by Al-Ukbari 1/91, Al-Bahr al-Muhit 1/472, and Al-Durr al-Masun 1/507. \n8. See: Al-Kitab 3/155.",
    "book_id": "105",
    "new_page_number": 19
  },
  {
    "serial_number": "6606239",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 21,
    "volume_number": 1,
    "text": "And he said: Future in meaning, and acts are specific to it... And \"Anna\" is a subject upon which Amr (1) stated (2). And he said: And its deletion is anomalous, and the reverse of it is \"La'alla\"... In four (3) give choice, and Yahya (4) the connection was rare.",
    "foot_note": "1. Meaning Sibawayh. \n2. Sibawayh said: \"And you say: Law annahu dhahibun lakana khayran lahu (If he were going, it would be better for him), so Anna is built upon Law just as it was built upon Lawla, as if you said: Law dhaka (If that...)\". See: Al-Kitab 3/121. \n3. He means the abrogating letters other than La'alla and Layta, which are: Inna, Anna, Lakinna, and Ka'anna. \n4. He refers to Imam Al-Farra, Abu Zakariya Yahya bin Ziyad. See his opinion in Sharh Al-Muradi 1/381.",
    "book_id": "105",
    "new_page_number": 20
  },
  {
    "serial_number": "6606240",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 22,
    "volume_number": 1,
    "text": "Al-Suyuti's Relationship with Ibn Malik's Works. Al-Suyuti was aware of the value of Ibn Malik's works; he was among the scholars most attached to Ibn Malik's works. We mention among them: His book 'Al-Bahjah Al-Mardiyah' or 'Al-Nahjah Al-Mardiyah', in which he explained Alfiyat Ibn Malik with a mixed explanation (interwoven text), which is an intermediate explanation. His book 'Al-Nukat ala Al-Alfiyah wal-Kafiyah wal-Shafiyah wal-Shudhur wal-Nuzhah', where Al-Suyuti combined these books, edited the issues in them, cited objections to important parts, and discussed their authors. His book 'Ham' al-Hawami'', and if you ask what the relationship is, I say: One of the greatest grammar texts is 'Al-Tashil' by Ibn Malik, and the greatest explanation of Al-Tashil is Abu Hayyan's explanation called 'Al-Tadhyil wal-Takmil'. Abu Hayyan stripped this great explanation of the reasoning of its issues in a book called 'Irtishaf al-Darb'. The book 'Ham' al-Hawami'' kept Ibn Malik's Tashil and Irtishaf al-Darb in sight, as Al-Suyuti stated in the introduction of Al-Ham' saying: \"Encompassing the summary of the books Al-Tashil and Al-Irtishaf\" (1). Also, Al-Suyuti's book 'Al-Faridah', which is his Alfiyah in grammar; he summarized Ibn Malik's Alfiyah in it in about six hundred verses and added four hundred verses of his own.",
    "foot_note": "1. See: Ham' al-Hawami' 1/20.",
    "book_id": "105",
    "new_page_number": 21
  },
  {
    "serial_number": "6606241",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 23,
    "volume_number": 1,
    "text": "Between Al-Faridah and Al-Wafiyah. Perhaps the first to open the door for organizing an Alfiyah (thousand-verse poem) in grammar was Imam Ibn Mu'ti. He said, may Allah have mercy on him, in the introduction of his Alfiyah (1): And this drove truthful brothers of mine to... Demand from me that I organize. A concise poem (Urjuzah) in grammar... Its count is a thousand, free from stuffing. Because of their knowledge that memorizing poetry... Is suitable for the intelligent and the slow of understanding. Then came Imam Ibn Malik after Ibn Mu'ti, and he organized his Alfiyah known as 'Al-Khulasah', and stated in its introduction that he followed Ibn Mu'ti's footsteps in the composition, as Ibn Mu'ti preceded him, and he is following his tradition. Ibn Malik said about his Alfiyah (2): And it requires satisfaction without anger... Surpassing the Alfiyah of Ibn Mu'ti. And he, by precedence, possesses preference... Deserving of my beautiful praise. And Allah decrees abundant gifts... For me and for him in the degrees of the Hereafter. The truth that must be said is that Ibn Malik's Alfiyah is more comprehensive and containing, while Ibn Mu'ti's Alfiyah is smoother and sweeter (3). Also, Al-Khulasah surpassed it by being organized on one meter, whereas Ibn Mu'ti's Alfiyah was on two meters: Rajaz and Sari'. Ibn Mu'ti said in the introduction of his Alfiyah (4): Especially the split meter of Rajaz... When built upon concise rhyming couplets. Or what resembles it from Sari'... With rhyming hemistichs like Tasri' (opening rhyme).",
    "foot_note": "1. See: Alfiyat Ibn Mu'ti 2. \n2. See: Alfiyat Ibn Malik 68. \n3. See: Nafh al-Tib 2/232. \n4. See: Alfiyat Ibn Mu'ti 2.",
    "book_id": "105",
    "new_page_number": 22
  },
  {
    "serial_number": "6606242",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 24,
    "volume_number": 1,
    "text": "While Ibn Malik's Alfiyah was on one meter, which is the Rajaz meter. After that came Imam Al-Athari, and he organized an Alfiyah which he named \"Kifayat al-Ghulam fi I'rab al-Kalam\", in which he versified the counted introduction of Ibn Babishadh, and he stated this author in his explanation of the Alfiyah (1). Undoubtedly, Al-Athari was following the approach of Ibn Mu'ti and Ibn Malik, so you find him saying in the introduction about his Alfiyah (2): Surpassing with the most useful paths... That of Ibn Mu'ti and that of Ibn Malik. However, this Alfiyah was not destined to have the fame that its two predecessors had. After that came Imam Al-Suyuti, and he organized his famous Alfiyah known as 'Al-Faridah', and explained it in a book he named 'Al-Matali' al-Sa'idah fi Sharh al-Faridah'. Undoubtedly, Al-Suyuti had Ibn Malik's Alfiyah in his sights, as it is the crown jewel of poems. Al-Suyuti said in the introduction about his Alfiyah (3): So this is an Alfiyah regarding it that contained... Its principles and intended the benefit of students. Surpassing the Alfiyah of Ibn Malik... Due to being clear in paths. And gathering from principles what [the other] lacked... And fixing loose issues that were neglected. Al-Suyuti said about his Alfiyah: \"I summarized in it Alfiyat Ibn Malik in six hundred verses, and I added to it four hundred verses containing rules, benefits, and additions that a student of grammar cannot do without. Thus, it surpassed Alfiyat Ibn Malik, and surpassed it also by alerting to restrictions that Ibn Malik neglected",
    "foot_note": "1. See: Kifayat al-Ghulam 21. \n2. See: Kifayat al-Ghulam 39. \n3. See: Al-Faridah 2.",
    "book_id": "105",
    "new_page_number": 23
  },
  {
    "serial_number": "6606243",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 25,
    "volume_number": 1,
    "text": "to mention, and by being clearer in expression than the expression of the Alfiyah. So these are three things by which it surpassed it, and alerting to that in the poem is better than remaining silent about it\" (1). It is necessary that we link between Al-Faridah and Al-Wafiyah; since their source was one, which is Alfiyat Ibn Malik. Through comparison, we found that the amount of similarity between the two poems, Al-Faridah and Al-Wafiyah, is large, and nothing indicates that more than citing some examples for illustration, not limitation. Before the examples, it is necessary to determine which of the two poems was earlier, Al-Faridah or Al-Wafiyah. Returning to the ends of the two poems, we find that Al-Wafiyah was composed in the year 869 AH, and Al-Faridah was composed in the year 885 AH. He said in the conclusion of Al-Wafiyah (2): I finished it on the back of the Red Sea (Bahr al-Qulzum)... Traveling to the Sacred Land. And in Rabi' the flower of its composition appeared... And in Jumada the musk of its conclusion diffused. Of the year nine and sixty which... Is after eight hundred of the Hijra. And he said—may Allah have mercy on him—in the conclusion of Al-Faridah (3): I organized it with a marvelous approach... Easy, and the conclusion came in Dhu al-Hijjah. Of the year five and eighty which... Is after eight hundred of the Hijra. It appears from this that he benefited from Al-Wafiyah in composing Al-Faridah.",
    "foot_note": "1. See: Al-Matali' al-Sa'idah 1/80. \n2. See: Al-Faridah 89/B. \n3. See: Al-Faridah: 74.",
    "book_id": "105",
    "new_page_number": 24
  },
  {
    "serial_number": "6606244",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 26,
    "volume_number": 1,
    "text": "First Example: Al-Suyuti said in Al-Wafiyah in the chapter of Speech and what it is composed of: Our speech is a useful statement that is intended... . . . . . . . . . . . . . If you refer to Al-Faridah, you would find this hemistich textually there (1). Al-Suyuti said in Al-Wafiyah in the chapter of Declinable and Indeclinable: And the noun, build it for resembling the particle in... Placement, and usage, and meaning, you will fulfill. And other than it is declinable, and the past is built... And the imperative, and the third is declinable if. It is free from the females and the confirmation if... It touches it, and the particle acts by building (2). If you browse the same chapter in Al-Faridah, you find the three verses as they are in Al-Faridah, except that he added a verse after the second verse (2). Second Example: He said in the chapter of Proper Noun in Al-Wafiyah: The Proper Noun: The one specifying the named... Without restriction, for those of familiarity [is] Ma. And this verse is as it is in Al-Faridah (3). Third Example: He said in Al-Wafiyah in Demonstrative Pronoun: Point with \"Dha\" to a male, and \"Dhih\" and \"Dhi\"... \"Ti\", \"Ta\" for the female, \"Dhani\", \"Tani\" for that which. Is dual, and \"Dhaini\", \"Taini\" other than raising... And with \"Ula\" for the absolute of plural.",
    "foot_note": "1. See: Al-Faridah 2. \n2. See: Al-Faridah 3. \n3. See: Al-Faridah 10.",
    "book_id": "105",
    "new_page_number": 25
  },
  {
    "serial_number": "6606245",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 27,
    "volume_number": 1,
    "text": "If you refer to Al-Faridah, you would find the two verses there as they are (1). And measure upon this; the examples of similarity, even identity, are very many. We have the right to ask about the reason for this great similarity between Al-Wafiyah and Al-Faridah. The closest answer, if not the most correct, is that Al-Wafiyah is a summary of the Alfiyah, and Al-Suyuti wanted his Alfiyah to be superior to Ibn Malik's Alfiyah, so he strove to summarize the Alfiyah and add to it. This is what he stated in his explanation of Al-Faridah where he said he summarized Al-Khulasah in six hundred verses and added four hundred verses. If you return to Al-Suyuti's words about Al-Wafiyah, you will find he said he summarized the Alfiyah in Al-Wafiyah in six hundred verses, and thus you know the reason for this similarity. Thus, you know that Al-Suyuti saved himself a lot of trouble when he was organizing Al-Faridah, because his effort in Al-Wafiyah served him greatly.",
    "foot_note": "1. See: Al-Faridah 11.",
    "book_id": "105",
    "new_page_number": 26
  },
  {
    "serial_number": "6606246",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 28,
    "volume_number": 1,
    "text": "The Manuscript Copy. I relied in verification on a unique copy, though I spared no effort in searching for another copy, but I did not find anything useful in the indexes I returned to. The manuscript is from El Escorial, consisting of twenty-five plates; in each plate are two leaves. It is under number 1792, from leaf 66b to leaf 90b. It is written in a normal Naskh script without diacritics, has no margins, is compared (muqabalah), and was written during the author's life in the year 903 AH. My Work in Verification: 1 - Writing the manuscript copy according to modern spelling rules, trying my best to reach the correct reading of its words relying on available sources. 2 - Referencing Quranic verses by mentioning the Surah name and verse number. 3 - Referencing Prophetic Hadiths—which are few—by mentioning the books they appeared in with the completion of the Hadith text. 4 - Referencing poetic evidences by attributing them to their sayer, stating their meter and the place of witness in them, and documenting them from approved books. 5 - Documenting the quotes the author brought from the books he quoted from. 6 - Linking Al-Suyuti's ambiguous words to the words of the Alfiyah to clarify the obscure wording. 7 - Commenting on what needs commenting in the poem. 8 - Comparing the manuscript copy with books related to it like Al-Faridah, Al-Matali' Al-Sa'idah, and Al-Bahjah Al-Mardiyah to correct the text in the best way Al-Suyuti intended.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 27
  },
  {
    "serial_number": "6606247",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 29,
    "volume_number": 1,
    "text": "Images of the Manuscript Copy: Title Page",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 28
  },
  {
    "serial_number": "6606248",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 30,
    "volume_number": 1,
    "text": "The First Page",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 29
  },
  {
    "serial_number": "6606249",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 31,
    "volume_number": 1,
    "text": "The Last Page",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 30
  },
  {
    "serial_number": "6606250",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 35,
    "volume_number": 1,
    "text": "In the name of Allah, the Entirely Merciful, the Especially Merciful. 1. The hoper of the Exalted's mercy says... A servant of Rahman, the son of Al-Suyuti (1). 2. I begin praising the Eternal God... Praying upon the Prophet Ahmad (2). 3. And I ask Allah for help in summarizing... The summary of grammar (Al-Khulasah) without shortcoming. 4. And perhaps I refine what is presented... And perhaps I add something pleasing. 5. And I ask Allah for the ornaments of acceptance (Ridwan)... For me and for him (3) and for those of faith (4). Speech and What It Is Composed Of. 6. Our speech is a useful wording that is intended... And that of three is Kalim (words) (5), and the singular. 7. Is a word (Kalimah), and it is a noun (Suma) (6) or a verb... Or a particle of meaning, and 'Saying' (Qawl) encompasses [all] (7).",
    "foot_note": "1. The verse is not metrically balanced with this narration. \n2. Its non-declension is a necessity (of poetry). \n3. Meaning for Ibn Malik. \n4. In this is a subtle reference, where Al-Suyuti avoided what Ibn Malik did in his introduction, as Ibn Malik was objected to for not generalizing the supplication when he said: \"And Allah decrees abundant gifts... For me and for him in the degrees of the Hereafter.\" But Al-Suyuti here generalized and said: \"For me and for him and for those of faith.\" See: Alfiyat Ibn Malik p. 68 Verse 7. \n5. Meaning what collects three words is Kalim, and usefulness is not a condition for it, rather only the number is a condition. See: Awdah al-Masalik 35, and Sharh Ibn Aqil 1/15. \n6. One of the dialects for 'Ism' (Noun) is 'Suma'. \n7. Meaning that 'Qawl' encompasses Speech (Kalam), Words (Kalim), and Word (Kalimah), so between it and them is absolute generality and specificity. See: Awdah al-Masalik 36, and Tamhid al-Qawa'id 1/138.",
    "book_id": "105",
    "new_page_number": 31
  },
  {
    "serial_number": "6606251",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 36,
    "volume_number": 1,
    "text": "8. So the noun [is distinguished] by attribution and Tanween... And the verb by the two Ta's (1) and Tanween (2). 9. Other than them is the particle; a present tense verb [is distinguished] by \"Lam\"... And the past by the two Ta's (3) distinguish it like \"Amma\". 10. And the imperative by the Nun [of emphasis] and a command understood (4)... And understood [command] that does not accept the Nun is 'Suma' (5). The Declinable and The Indeclinable. 11. And the noun, build it for resembling the particle in... Placement, and usage, and meaning, you will fulfill. 12. And other than it (6) is declinable, and the past is built... And the imperative, and the third (7) is declinable if. 13. It is free from the females and the confirmation (8) if... It touches it, and the particle acts by building (is worthy of it) (9). 14. And the origin in the built is sukoon (silence) like \"Lam\"... And Fath, Kasr, and Damm occurred in it. 15. Raising and installing (Nasb) for the possessor of declension is mandatory (10)... And the noun is dragged (Jarr) and the verb is jussive (Jazm) (11). 16. So raise with Damm and install with Fath and drag... With Kasr and silence for the jussive like \"Lam Yazur\". 17. And other than this substitutes, so install with Alif... And raise with Waw and with Ya drag what I describe. 18. Aban (Father), Akhan (Brother), Haman (In-law), Hanan, and the deficiency is exalted (12)... In this (13) and was rare without shortening in the first ones.",
    "foot_note": "1. Ta of the doer and the static Ta of femininity. \n2. Thus in the manuscript. \n3. Ta of the doer and the static Ta of femininity. \n4. Meaning the imperative verb is distinguished by its indication of a command along with the permissibility of the Nun of emphasis entering it. \n5. Meaning a verbal noun of command (Ism Fi'l Amr) is whatever indicates a command and does not accept the Nun of emphasis. \n6. Meaning the noun not resembling the particle. \n7. Meaning the present tense verb. \n8. Meaning their Nuns. \n9. Meaning deserving and worthy. \n10. He transfers the Fatha of the Hamza of I'rab to the Lam before it, and by deleting the Ya of \"Dhi\" and snatching the Kasra. \n11. Meaning dragging (Jarr) is specific to the noun and jussive (Jazm) is specific to the verb. \n12. Meaning better, preferable, and greater. \n13. The reference here is to the last mentioned, which is the word \"Hanan\".",
    "book_id": "105",
    "new_page_number": 32
  },
  {
    "serial_number": "6606252",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 37,
    "volume_number": 1,
    "text": "19. And \"Dha\" (possessor) for companionship, \"Faman\" (Mouth) if you delete... Its end, and all of them if you add. 20. To other than Ya (1), raise with Alif and with Ya... Install and drag: \"Ithnayn\" (Two) with what was dualized. 21. And if you add to a pronoun \"Kilta\", \"Kila\"... With \"Ithnatayn\" after the Fath of what followed (2). 22. And raise with Waw and with Ya drag and install... The sound plural of \"Ahmad\" and \"Mujtabi\". 23. And \"Al-Ishrun\" (Twenties) and \"Al-Sinuna\" (Years) were appended... And the chapter of Dhayn, and likewise \"Al-Ahluna\" (Families). 24. \"Ulu\" and \"Alamuna\" (Worlds), \"Illiyyuna\"... And like \"Hin\" (Time), \"Sinuna\" may come. 25. And breaking the Nun for a dual was followed... And opening was rare contrary to what was gathered (pluralized) (3). 26. With Kasr is the installation of the plural of Ta and Alif... Likewise \"Ulatu\" and a named one that was comprised (4). 27. With Fath is the dragging of the noun that is diptote (non-declining)... But if it is added or follows \"Al\" then it declines. 28. And make the Nun for raising \"Taf'aleena\"... And the likes of \"Taf'alani\", \"Taf'aluna\". 29. And delete for installing and for jussive, and mark... Like \"Al-Mustafa\" the defective (5) or like \"Al-Mu'tami\". 30. So the first is Maqsur (shortened), estimate all (6)... And the second is Manqus (deficient), and installation make apparent.",
    "foot_note": "1. Meaning Ya of the speaker. \n2. Meaning after the Fath of the letter before the letter of dual inflection, which are Alif and Ya. \n3. It is strange that Ibn Malik organized this issue in Al-Khulasah in two verses, while in Al-Kafiyah Al-Shafiyah—which is the mother of the Alfiyah and the Alfiyah is its summary—he organized it in one verse. He said in Al-Kafiyah Al-Shafiyah: \"And the Nun in a plural has the Fath and in dualization Kasr, and the reverse may fulfill.\" And he said in the Alfiyah: \"And the Nun of a collected [plural] and what is appended to it, open it, and few are those who speak with its breaking. And the Nun of what is dualized and appended to it, with the reverse of that they used it so pay attention.\" See: Alfiyat Ibn Malik p. 74 Verse 39 and 40, and Sharh al-Kafiyah al-Shafiyah 1/191. \n4. Like Arafat and Adhri'at. See: Al-Tasrih 1/82. \n5. Object of the verb \"Sim\". \n6. Meaning all vowels.",
    "book_id": "105",
    "new_page_number": 33
  },
  {
    "serial_number": "6606253",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 38,
    "volume_number": 1,
    "text": "31. And the verb possessing Waw at the end and Alif... And Ya is defective, so its deletion is accustomed. 32. In jussive, and the raising of all of them is estimated... And the installation in Waw and Ya appears. The Indefinite and The Definite. 33. That which accepts \"Al\" affecting [it] (1) or falls... In its place is indefinite and common. 34. And other than it is definite like: Hum (They), and Dhi (This)... Ya Rajulu (O Man), Al-Fadil (The Virtuous), Hind, Ibni (My son), Alladhi (The one who) (2). 35. So designate the indicator of absence and presence (3)... With a pronoun, and possessor of connection (connected pronoun) from it did not. 36. Fall in the beginning or following \"Illa\"... Like the Ya and the Kaaf, and the son of Kulla (4). 37. And the wording of the possessor of dragging is like installation, and for all... \"Na\" (5), and for what is addressed or absent indicates. 38. A Nun, a Waw, an Alif; and a pronoun... Hidden in: Qum (Stand), Sah (Hush), Na'ata (Groaned), Idrib (Hit), Tushkuru (You are thanked). 39. The possessor of separation (detached) raised: Ana (I), Anta (You), and Huwa (He)... And the branch, \"Iyya\" for that which you install. 40. And a detached one did not come if possible... Is a connection (attached), with it \"Salnihi\" (Ask me it) improve both (6).",
    "foot_note": "1. Meaning affecting definition in it. \n2. He indicated with these the types of definites: Hum: Pronoun, Dhi: Demonstrative, Ya Rajulu: Intended vocative, Al-Fadil: Defined by the article, Hind: Proper noun, Ibni: Added to a definite, Alladhi: Relative pronoun. Ibn Malik said in Al-Kafiyah Al-Shafiyah: \"What is common in a genus like 'Abd' is indefinite, and other than it is definite like 'Antarah'. So the pronoun is the most definite, then the proper noun, and demonstrative noun, and complete relative pronoun. And possessor of the instrument or a specific vocative, or possessor of addition by which it is clarified.\" See: Sharh al-Kafiyah al-Shafiyah 1/222. \n3. Meaning \"Name\". \n4. Meaning all pronouns are built. \n5. Meaning the pronoun \"Na\" is suitable for raising, installing, and dragging. Allah Almighty said: \"Rabbana Innana Sami'na Munadiyan\" (Our Lord, indeed we have heard a caller). Al Imran 193. \n6. Meaning connection and separation, Salnihi or Salni Iyyahu.",
    "book_id": "105",
    "new_page_number": 34
  },
  {
    "serial_number": "6606254",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 39,
    "volume_number": 1,
    "text": "41. And similar to it in \"Khiltanihi\", \"Kuntuhu\"... The connection has been preferred, and I saw him (1). 42. Contradict in Al-Tashil (2) following a text... Of Amr (3), and prioritize in connection the more specific. 43. And what you wish in separation, and that which united... In rank, separate it, and in absence (4) occurred. 44. A connection, and Ya of the self with the verb follows... The Nun of protection, and in \"Layta\" connect it. 45. And its deletion is anomalous, and the reverse of it is \"La'alla\"... In four (5) give choice, and Yahya (6) the connection was rare. 46. And like \"Laysi\" and \"Mini\", \"Ani\" reject... And \"Laduni\" was rare, likewise \"Qatni\" tighten (add Nun). The Proper Noun. 47. The Proper Noun: The one specifying the named... Without restriction, for those of familiarity [is] Ma. 48. Name, Kunya, and Title, and this (7)... With other than it delay it, and let it be added if. 49. They were singulars, and if equal the second follows... And from it is possessor of transfer and improvisation (8) with. 50. Compound of attribution and mixing, and Ibn Ma... With \"Wayhi\", and the added became common as a proper noun.",
    "foot_note": "1. Meaning I saw Ibn Malik. \n2. See: Tashil al-Fawa'id 27. \n3. See: Al-Kitab 2/363, and Sharh al-Tashil 1/153. \n4. Meaning the pronoun of absence. \n5. He means the abrogating letters other than La'alla and Layta, which are: Inna, Anna, Lakinna, and Ka'anna. \n6. He refers to Imam Al-Farra, Abu Zakariya Yahya bin Ziyad. See his opinion in Sharh Al-Muradi 1/381. \n7. He means the Title (Laqab), for it is delayed if it combines with the Kunya and the Name. See: Sharh al-Tashil 1/174, Takhlis al-Shawahid 118, and Ta'liq al-Fara'id 2/148. \n8. He said in Al-Ham': \"The proper noun is divided into Transferred and Improvisational and a medium between them described neither by transfer nor improvisation; this is the opinion of the majority. Some held that all proper nouns are transferred and none are improvisational. Al-Zajjaj held that they are all improvisational.\" See: Ham' al-Hawami' 1/285, Al-Murtajal 293, Al-Muqaddimah Al-Jazuliyah 63, and Tawjih al-Luma' 311.",
    "book_id": "105",
    "new_page_number": 35
  },
  {
    "serial_number": "6606255",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 40,
    "volume_number": 1,
    "text": "51. And the Generic Proper Noun is similar to what preceded... In wording, and in meaning to indefiniteness (1) it was appended. 52. Like \"Umm 'Iryat\" and \"Barrah\" (2)... Two names for the scorpion and righteousness. The Demonstrative Pronoun. 53. Point with \"Dha\" to a male, and \"Dhih\" and \"Dhi\"... \"Ti\", \"Ta\" for the female, \"Dhani\", \"Tani\" for that which. 54. Is dual, and \"Dhaini\", \"Taini\" other than raising... And with \"Ula\" for the absolute of plural. 55. And extension is better, and for a Kaf so add... With a Lam or without it in distance. 56. And alone with the follower of \"Ha\", and the plural extend... And for the place \"Hahuna\" and if distant. 57. Then the Kaf connect as passed, or \"Hanna\"... Or \"Thamma\" say, and the Ta (3) add, or \"Hinna\". The Relative Pronoun. 58. For Alladhi (4) Allati the Relative Noun did not dualize... So the Ya delete and the Nun of it emphasize (Shadda). 59. As compensation (5) like the Nun of \"Dhaini\", \"Taina\"... And the plural for \"Alladhi\": \"Al-Ula\", \"Alladhina\". 60. And \"Allati\" and \"Alla\" (6) for \"Allati\", and like \"Alladhi\"... \"Alla\" (7) came, and \"Man\" and \"Ma\" and \"Al\" like this (8). 61. And \"Dhu\" in Tayyi' is like that, or like \"Allati\"... \"Dhatu\" and like \"Allati\", \"Dhawatu\" came.",
    "foot_note": "1. Meaning to the indefinite. \n2. See: Sharh al-Mufassal 1/111, Safar al-Sa'adah 1/367, and Al-Muzhir 1/400. \n3. So you say: \"Thammat\". \n4. He means: Alladhi. \n5. See: Al-Tadhyil wal-Takmil 3/26 and Sharh Al-Makudi 34. \n6. Meaning Al-La' (The ones - fem). \n7. Meaning Al-La'. \n8. He means they are relative nouns like the ones that passed. See: Sharh al-Tashil 1/201, Al-Jana al-Dani 202, and Khizanat al-Adab 23.",
    "book_id": "105",
    "new_page_number": 36
  },
  {
    "serial_number": "6606256",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 41,
    "volume_number": 1,
    "text": "62. And \"Dha\" as long as it is not cancelled after \"Ma\" and \"Man\"... Being interrogative, and all of them (1) then require. 63. Following them with a connection (Sila) with a pronoun... Suitable, and it is a sentence possessing a news (Khabar). 64. Or resembling it, and the pure description is for \"Al\"... And the declinable verb, and it was anomalous (2) with sentences. 65. \"Ayyun\" is like \"Ma\", and it is declinable as long as it is not added... With deletion of a returner (pronoun), and other than it was deleted. 66. Its returner if connection is long is glimpsed... And the remainder was not suitable for connection. 67. And a connected returner if it is installed... By a verb or description, then deletion is not refused. 68. Likewise, that which was dragged by a description that operated... Or a particle [that] dragged the relative pronoun first. The Defined by the Article of Definition. 69. \"Al\" is a defining particle or the Lam, and add (3)... Like \"Allat\" necessarily, and in poetry (4) was found. 70. In a proper noun and in a discriminator, and connect... With a proper noun to glimpse what it was transferred from. 71. And possessor of addition becomes a proper noun... If it prevails, or \"Al\" (5), and its deletion (6) requires. 72. If you add or call out, I said the Lam in... \"Allah\" was not added and did not define.",
    "foot_note": "1. Meaning all relative nouns. \n2. Here Al-Suyuti disagreed with Ibn Malik; the apparent meaning of Ibn Malik's words is that connecting Al to a sentence is permissible though rare, not anomalous. Al-Suyuti should not have disagreed with Ibn Malik because he is summarizing Ibn Malik's text, not composing something independent for himself. See: Sharh al-Tashil 1/201, Al-Jana al-Dani 202, and Awdah al-Masalik 1/170. \n3. Meaning it is an obligatory addition. See: Al-Kitab 3/282, Al-Usul fi al-Nahw 2/262, and Al-Jana al-Dani 197. \n4. Meaning the saying of Rashid al-Yashkuri: \"Ra'aytuka lamma an 'arafta wujuhana, sadadta watibta al-nafsa ya Qaysu 'an 'Amri\" (I saw you when you recognized our faces, you turned away and were content in soul, O Qays, regarding Amr), where \"Al\" entered here upon the discriminator, and the discriminator is indefinite. See: Sharh al-Sirafi 2/79, Tawjih al-Luma' 444, and Al-Maqasid al-Nahwiyah 1/470. \n5. Meaning: And possessor of \"Al\" becomes a proper noun if it prevails. \n6. Meaning: deletion of Al.",
    "book_id": "105",
    "new_page_number": 37
  },
  {
    "serial_number": "6606257",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 42,
    "volume_number": 1,
    "text": "Inception (Al-Ibtida). 73. Subject and Predicate \"Dha Dani\" (This is close)... And like \"Ma Qa'imun Al-Zaydani\" (The two Zayds are not standing). 74. Subject and Doer sufficed for this... \"A Qa'imun Dhani\" and \"Man ya'ud inbidha\". 75. And if other than singular matches what followed... Then a preceding predicate (....) (1). 76. Inception raised a subject and this (2) predicate... And it is the completer of benefit (3), singular it settled. 77. And a sentence with a link to the subject... Unless it is same in meaning like \"Huwa\" (4), and the singular. 78. Empty it if rigid, and a pronoun is hidden... In possessor of derivation, and obligatorily settled. 79. Where it ran upon that which is not for it... Like \"Zaydun Al-Hunudu Mufdihunna Hu\" (Zayd, the Hinds, their ransomer is he). 80. And an adverb or resembling it with like \"Istaqarra\" (Settled)... Was suspended (5), and time did not come as a predicate. 81. For a body (concrete noun) unless it benefits like inception... With the indefinite (6) like \"Inda Ahmada Huda\" (With Ahmad is guidance). 82. And \"Hal Fatay Fikum\" (Is there a youth among you), \"Fama Khillun Lana\" (So no friend for us)... And \"Rajulun min al-kirami 'indana\" (A man of the noble ones is with us) (7).",
    "foot_note": "1. Smudged and unclear. \n2. Meaning this predicate. This is one of multiple schools of thought. See: Al-Usul fi al-Nahw 1/58, Al-Intisar li-Sibawayh 130, Al-Idah al-Adudi 29, Ilal al-Nahw 263, Al-Khasa'is 167, Al-Insaf 1/38, and Sharh al-Mufassal 1/229. \n3. Meaning the utility/meaning. \n4. Meaning it is like it in meaning. \n5. A controversial issue among grammarians. See: Al-Masa'il al-Halabiyat 105, Al-Insaf 1/197, and Nata'ij al-Fikr 324. \n6. Meaning with the indefinite. \n7. It is said that Ibn Malik meant Imam Al-Nawawi by this. See: Nashr Fayd al-Inshirah 1/491 and Hashiyat al-Khudari 1/225.",
    "book_id": "105",
    "new_page_number": 38
  },
  {
    "serial_number": "6606258",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 43,
    "volume_number": 1,
    "text": "83. And \"Raghbatun fi al-khayri khayratun\" (Desire for good is good), and text... Of a ruling gives benefit, and that which is general and specific (1). 84. And the origin in predicates is delay, and it may... Precede, and prevent its precedence if it united. 85. With a subject in definition and indefiniteness and confused... Or came restricted, and a verb when it reversed. 86. Or a predicate for a necessary frontal [word], and in... \"Li Waladayya Dirhamun\" (My two sons have a dirham) prioritize, you will fulfill. 87. Likewise, that which a pronoun returned to... From a subject, or its right is fronting. 88. Or it was restricted, and deletion of what is known... From subject and predicate permit completing (2). 89. And after \"Lawla\" and oath the text with... Waw like \"Ma'a\" (With), so delete the predicate, you will be followed. 90. And before a state (Hal) not suitable as a predicate... For it like \"Darbi Dha Musi'an\" (My hitting this one is [when he is] officiating) settled. 91. For a subject informed about by an oath... Or a source about its verb, deletion is mandatory. 92. Like two forms after this and count... With conjunction or no predicate for a subject. Kana and Its Sisters. 93. Raise with \"Kana\" the subject as a noun and install... Its predicate, and [with] Dhalla, Bata you will be correct. 94. Adha and Amsa, Sara, Laisa, Asbaha... Fati'a and Infakka and Zala, Bariha. 95. If negation or resemblance (3) follows these four... And \"Dama\" after \"Ma\", and this (4) you will not be prevented.",
    "foot_note": "1. Abu Hayyan attributed the permissibility of starting with an indefinite noun to two things: Generality and Specificity. He said in his poem \"Nihayat al-I'rab\": And everything I mentioned in the division returns to specification and generalization. See: Al-Ashbah wal-Naza'ir 2/113. \n2. Meaning that the understanding of the meaning is complete; but if the meaning is not understood with deletion, then it is not permissible. \n3. Resemblance to negation like prohibition and supplication. \n4. Meaning this operation/rule.",
    "book_id": "105",
    "new_page_number": 39
  },
  {
    "serial_number": "6606259",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 44,
    "volume_number": 1,
    "text": "96. The rest of conjugations if they occur... And mediate the predicate in them, and refused. 97. Is its precedence [over] \"Dama\" and what (1) by \"Ma\" was negated... And \"Laisa\", and the complete (2) with raising suffices. 98. And other than it is the defective, require \"Fati\" (3)... And \"Zala\", \"Laisa\", and prevent following of Ti (4). 99. The agent of predicates other than the adverb and what... Resembles it, and interpret the delusive. 100. And \"Kana\" add in the stuffing and delete, and the predicate... Keep, and after \"In\" and \"Law\" this became famous. 101. And after \"An\", substitution of \"Ma\" for it was followed... And delete the Nun of the jussive present tense. Ma, La, In, and Lat Resembling \"Laisa\". 102. Like \"Laisa\": \"Ma\" if negation remained, and [not]... Delayed the possessor of installation, and if \"In\" (5) was not added. 103. And precedence of an adverb while it is an agent of the predicate... Permit, and conjunction after installation settled. 104. With \"Lakin\" or \"Bal\" its raising is mandatory, and drag... From after \"Ma\" and \"La\" and \"Laisa\" the Ba [drags] the predicate (6). 105. Like the negation of \"Kana\" and like \"Laisa\": \"La\" operated... In indefinites, this (7) with \"Lat\", \"In\" is rare. 106. And \"Lat\" with \"Hin\" (Time) and what followed it... Is specific, and its noun is frequently deleted (8). Verbs of Appropinquation (Af'al al-Muqarabah). 107. Like \"Kana\": \"Kada\" and \"Asa\", but the predicate... Of these two is a present tense verb, and connecting \"An\" (9) is rare.",
    "foot_note": "1. Meaning that which was negated by \"Ma\". \n2. With lightening of the Mim, as two silences do not meet here in the stuffing of the verse. \n3. Lightened from \"Fati'a\". \n4. Reference to the verbs of this chapter, which are Kana and its sisters. \n5. He means the negating In. \n6. Meaning that the Ba may drag the predicates of Ma, La, and Laisa. \n7. Meaning this operation. \n8. Like His saying: \"Walata hina manas\" (And it was not a time for escape). Sad 3. \n9. Connecting it with the predicate.",
    "book_id": "105",
    "new_page_number": 40
  },
  {
    "serial_number": "6606260",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 45,
    "volume_number": 1,
    "text": "108. In \"Kada\" not \"Asa\", and like this is \"Hara\"... And \"Ikhlawlaqa\", require \"An\" for these two's predicate. 109. In \"Awshaka\" the dominant is \"An\", and \"Karaba\"... Is like \"Kada\", and abandoning \"An\" has become mandatory. 110. In \"Tafiqa\", \"Insha\" and \"Ja'altu\" and \"Akhadha\"... \"Aliq\" (1), and from \"Kada\" and \"Awshaka\" was taken. 111. A present tense, and \"Awshaka\" is a participle (Ism Fa'il)... After \"Asa\", \"Ikhlawlaqa\", \"Awshaka\" make. 112. \"An\" with a verb substituting for a predicate... And hide or strip Dhih if you mention. 113. Before it a noun, and \"Asaytu\" is broken... The Sin of it, and opening is more common. Inna and Its Sisters. 114. For \"Inna\", \"Anna\" is reverse of what for \"Kana\" settled... \"Alla\", \"Ka'anna\", \"Layta\", \"Lakinna\", the predicate. 115. Delay except for the adverb, and the Hamza of \"Anna\" (2)... From a source is opened (3), and break [it]. 116. In inception and start of connection of oath... Or recounted by saying or a state (Hal) you fulfill (4). 117. And from it is what was suspended by the Lam and in... Following \"Idha\" of surprise (5) two faces were followed. 118. And following Fa of reward and following an oath... No Lam after it and this also was attributed. 119. In like \"Khayru al-qawli inni adhkuru\"... And the Lam require [in] the predicate of that which is broken. 120. Not in what is negated and a verb like \"Wali\"... And with \"Qad\" it follows, and with separation connect. 121. And the noun at the end and the agent of the predicate... In the middle, and if you connect with these 'Ma' it was rare.",
    "foot_note": "1. Because contradiction occurs; the particle \"An\" purifies the verb for the future, and these letters are for commencement. See: Sharh al-Sirafi 1/18, Al-Masa'il al-Basriyat 1/705, Asrar al-Arabiyah 223, Sharh al-Mufassal 4/375, and Al-Tadhyil wal-Takmil 4/336. \n2. The Alif is for release, he means \"Anna\". \n3. Meaning it is opened if it fills the place of a source. \n4. Jussive response to the request \"Break\" in the previous verse. \n5. He means suddenness.",
    "book_id": "105",
    "new_page_number": 41
  },
  {
    "serial_number": "6606261",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 46,
    "volume_number": 1,
    "text": "122. Operating them, and conjoin to the noun of \"Inna\" (1)... After completion raising and \"Anna\" (2). 123. \"Lakinna\", and neglect if you lightened \"Inn\"... Is more common, and the Lam require if it is not clear (3). 124. And let it follow the abrogator mostly, and \"Ann\"... If lightened then the noun deletion require. 125. And a sentence is its predicate, so if it fulfilled... A verb for non-request conjugated. 126. Then the best is separation by \"Qad\" or negation or... Future marker (Tanfis) or \"Law\", and mentioning \"Law\" is rare. 127. And \"Ka'anna\" was lightened so its noun is hidden... And they affirmed (4), and \"Alla\" was not lightened. \"La\" Resembling \"Inna\". 128. Like \"Inna\": \"La\" in indefinites, so install... An added or resembling it, and compound. 129. Singular upon the Fath, and let the predicate follow it... And like \"La Hawla wa la Quwwata\" settled. 130. Opening and raising the second, prevent installation of this... If the first is raised, and install and raise. 131. And open intending description of a built noun and it followed... And leave the opening if you add or separate.",
    "foot_note": "1. Its Alif is for release. \n2. It is \"Anna\" and the Alif is for release. \n3. To distinguish between In lightened from Inna and it when it is negating, so connecting the Lam in the predicate of the lightened is mandatory, and the Lam may be deleted if there is a context, like the poet's saying: \"Ana Ibn ubat al-daym min Al Malik -- Wa In Malik kanat kiram al-ma'adin\" (I am the son of refusers of injustice from the family of Malik -- And indeed Malik was of noble minerals). See: Sharh al-Tashil 2/34, Shawahid al-Tawdih wal-Tashih 105, and Al-Durr al-Masun 8/521. \n4. And on this verse: \"Wa yawman tuwafina bi-wajhin muqassamin -- Ka'an zabyatun ta'tu ila wariq al-sam\" (And a day you come to us with a divided face -- As if a doe stretching to the leafy sam tree). In the narration raising 'zabyah', its noun is a hidden pronoun of the matter, and in the narration installing 'zabyah', it is its noun. See: Al-Kitab 2/134, Al-Asma'iyat 157, Al-Kamil 1/71-72, Al-Usul 1/245, Al-Adhdad 107, Al-Zahir 1/155, and Huruf al-Ma'ani wal-Sifat 29.",
    "book_id": "105",
    "new_page_number": 42
  },
  {
    "serial_number": "6606262",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 47,
    "volume_number": 1,
    "text": "132. Like conjunction without repetition for \"La\"... And \"La\" with the Hamza is like what passed (1). 133. And for evidence deletion of the predicate was common... And whoever permits it absolutely do not support (2). \"Dhanna\" and Its Sisters. 134. \"Dhanna\" installs a predicate and a subject... Ra'a (Saw), Alimtu (I knew), Khala (Imagined), 'Adda (Counted), Wajada (Found). 135. Jaha and Hab (Grant), Ta'allama (Learn), Ihsab (Calculate/Think) and Dara (Knew)... Za'amtu (I claimed) and Ij'al (Make) and that which is like \"Sayyara\" (Became/Made). 136. And Hab, Ta'allam: are rigid, and make... For non-past what belongs to it, and what is devoid. 137. Of these two then cancel permissibly not in inception... And interpret, and before Lam of inception. 138. Suspension is necessary and Lam of oath... And negation of \"Ma\" and \"In\" and \"La\" (3) the interrogative (4). 139. For one \"Dhunna\" accuse like knowledge of... Custom, and for two \"Ra'a\" in dream (5). 140. And deletion of an object or two without... Context is banned, and like \"Dhann\" make. 141. \"Taqulu\" following interrogation or... Separated by an agent and with the adverb they saw. \"A'lama\" and Its Sisters. 142. Install with \"A'lama\" three and \"Ara\"... Akhbara (Informed), Nabba (6), Haddatha (told), Anba (7), Khabbara. 143. For the second and third of this what belonged... To the two of \"Alimtu\" and \"Ra'a\" and \"Alima\". 144. Possessor of one with Hamza for two connected... Their second like the second of \"Kasa\" happened.",
    "foot_note": "1. Meaning that the ruling of \"Ala\" compounded from the interrogative Hamza and La of generic negation is like the ruling of La of generic negation alone. \n2. He refers to Imam Al-Zamakhshari as he permitted that in Al-Mufassal. See: Al-Mufassal 52 and Al-Bahjah Al-Mardiyah 181. \n3. \"La\" the negating. \n4. He means interrogation. \n5. In the manuscript \"Al-Hukm\", and the correction is from Al-Faridah 22 and Al-Matali' Al-Sa'idah 1/336. \n6. Lightened from Nabba'a. \n7. He means Anba'a.",
    "book_id": "105",
    "new_page_number": 43
  },
  {
    "serial_number": "6606263",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 48,
    "volume_number": 1,
    "text": "The Doer (Al-Fa'il). 145. The Doer is that which is like the two raised ones: \"Khataba... Zaydun balighan wa'zuhu\" (Zayd spoke eloquently in his preaching) (1), and it was mandatory. 146. From after a verb explicitly and implicitly (2)... And the verb if attributed to other than the implicit. 147. From proper noun of two and plural was stripped... And a verb raises the doer whatever (3) appeared. 148. And the Ta require with the past attributed to... Possessor of vagina (4) or a pronoun for her followed. 149. And leaving is better if with \"Illa\" this separated... In other than it and the metaphorical pronoun was rare. 150. Two faces in the explicit of metaphorical settled... \"Ni'ma\" and plural of non-sound masculine. 151. And the origin is connection of doer and separation... Of its object, and connection may come. 152. Or precede the verb, and delay is mandatory... For ambiguity or a doer was hidden and did not. 153. Restrict, and possessor of restriction with \"Illa\" delay... Or \"Innama\", and prioritize if it appears. 154. And common is like \"Khafa Rabbahu Umar\" (Umar feared his Lord)... And anomalous is like \"Zana Nawruhu Al-Shajar\" (Its blossom adorned the trees) (5). The Deputy of the Doer (Al-Na'ib 'an Al-Fa'il). 155. In place of a doer in what belongs to it, the object (6) with it... Establish, and join (Damma) the start of a verb like \"Nubiha\". 156. And before the last break in what passed... And open it in a present tense like \"Yurtada\". 157. And the second following Ta of compliance... And third of connection join following. 158. And break or smell (Ishmam) the Fa of possessor of Ayn defected... Or join, and the confuser from this was prohibited.",
    "foot_note": "1. The two raised ones are Zayd and Wa'z. \n2. Meaning existence of a doer after the verb is mandatory whether the doer is explicit or implicit. \n3. \"Ma\" here is adverbial source. \n4. Meaning possessor of female private part. \n5. It is not prohibited according to Ibn Jinni. See: Al-Khasa'is 1/294 and Sharh al-Kafiyah al-Shafiyah 2/585. \n6. Object of the verb \"Aqim\" after it.",
    "book_id": "105",
    "new_page_number": 44
  },
  {
    "serial_number": "6606264",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyah bi-Ikhtisar al-Alfiyah (Alfiyat Ibn Malik)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 49,
    "volume_number": 1,
    "text": "159. And like this is \"Habba\" and what belongs to Dhi the Fa... For before Ayn of \"Ikhtara\" and \"Inqada\" is found. 160. And accepting from adverb or resemblance establish... Or source this if that (1) was lacking. 161. And the second may substitute from the chapter of \"Kasa\"... And \"Dhanna\", \"A'lama\" if not (2) confused. Preoccupation (Al-Ishtighal). 162. If the pronoun occupied for a preceding noun... A verb from the noun then with the agreeing. 163. Implicitly that noun is installed... Or raise, and installation in it is mandatory. 164. If it follows what is specific to the verb, and what... Is specific to inception its raising require. 165. Like before possessor of the front, and if this preceded... Possessor of request then installation in it is selected. 166. Like following what its following of the verb rose (3)... And following a conjunction without separation upon. 167. A verbal sentence, so if it followed a verb a predicate... About a subject then equality has settled. 168. In other than this raising was preferred, and settled... Like connection a separated by what operates dragging. 169. And the operator of description without preventer... Is like the verb, and occupy a pronoun with a follower. Transitivity and Intransitivity of Verb. 170. What Ha (4) other than source in it acts as seal... It is the transitive, and other than it is the intransitive. 171. Like habits (5) and \"If'alalla\", \"Iq'ansasa\"... And what required cleanliness or dirt. 172. Or complied with the one, and the intransitive count... With a preposition, and if deletion occurred. 173. Then install or drag by hearing, and measure... With \"An\" and with \"Anna\" if not confusing. 174. And the origin is precedence of doer in meaning, and may... Be necessary or prevented mandatorily, and occurred. 175. Deletion for a surplus with these was not mandatory... Or restricted, and the installer delete (6), and became mandatory (7).",
    "foot_note": "1. Reference to the object. \n2. \"Ma\" here is negating not added. \n3. Meaning prevailed. \n4. He means Ha. \n5. He means verbs of character traits. \n6. If known. \n7. Meaning in some places deletion of the operator in the object became mandatory.",
    "book_id": "105",
    "new_page_number": 45
  },
  {
    "serial_number": "6606265",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 50,
    "volume_number": 1,
    "text": "Contention in Government (At-Tanazu')\n176. If two [operators] seek a noun and it did not precede (1) ... then one operates, and the second is more entitled.\n177. And [for] Kufa the first [is entitled] (2), not the objection ... For the operation of the second, the permitter necessitates.\n178. And the neglected [operator] operates on the pronoun of the one ... possessed of contention; take nothing but the nominative.\n179. For a surplus (Fadlah) delete, and delay the pillars (essential parts) ... and my saying encompasses what was narrated regarding the principle (3).\n180. And the pronoun reporting about other than that which ... matches what interprets it; make it apparent and cast it away.\n\nThe Absolute Object (Al-Maf'ul Al-Mutlaq)\n181. The Masdar (Source/Infinitive) is the name of an event; with its like ... it is erected (accusative), or by its description, or its verb.\n182. And these two are its branches (4), and as a type or number ... it comes, or emphasizing, and replaces it.",
    "foot_note": "1. Meaning that the noun did not precede the two operators, but came after them.\n2. See: Ma'ani al-Qur'an by Al-Farra 1/19 and Al-Insaf 1/71.\n3. By 'the principle' he means the Alfiyyah, and he means it is the best of what Ibn al-Nazim rectified upon his father in his saying: 'Rather, requires its deletion if it is not news * and delay it if it is the news.' Ibn al-Nazim said: 'If he had said instead: Delete it if it is not a required object * and if it is that, then delay it, you will be correct.' Al-Muradi rectified Ibn al-Nazim saying: 'If he had said: Rather its deletion if it was a surplus is mandatory * and for other than it, its delay is committed' he would have done well. Then Imam Al-Ghazzi rectified Al-Muradi's verse saying: 'Rather the mention of a pillar and a deluder is mandatory * delayed, and other than it delete, you will be correct.' Perfection belongs to Allah alone. See: Alfiyyah Ibn Malik p. 106 verse 283, Sharh Ibn al-Nazim 188, Sharh al-Muradi 2/642, and Sharh al-Ghazzi verse 3341.\n4. Meaning that the verb and the description are branches of the Masdar which is the origin, and this is the school of most Basrans. See: Al-Insaf 1/190 and Al-Maqasid Al-Shafiyah 3/222.",
    "book_id": "105",
    "new_page_number": 46
  },
  {
    "serial_number": "6606266",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 51,
    "volume_number": 1,
    "text": "183. \"Kull\" (All), and whatever indicates it, and separate ... is emphasizing, and the deletion of what requires it is rejected (1).\n184. No other, and it is with 'At' (coming) as a substitute ... from its verb is mandatory, and what has detailed.\n185. And the deputy of the verb which came as news ... about a concrete noun, they repeated or it was restricted.\n186. And whatever emphasized for itself or for another ... and following a sentence, seemingly appeared.\n\nThe Object For Its Sake (Al-Maf'ul Lahu)\n187. The causative Masdar united ... in time and actor like \"Khawfan Ajhadu\" (Out of fear, I strive).\n188. It is erected as an object for its sake, and the particle drags (genitive) ... for the loss of some of these (2), and even if found, it settles (3).\n189. It is rare in the abstract, and common in ... the one with \"Al\" (The), and believe in equality if you add (Idafah).\n\nThe Object In It (Al-Maf'ul Fihi) Named the Adverb (Zarf)\n190. The Adverb is time or place implying ... \"Fi\" (in) regularly, and erect the times (accusative).\n191. With the nasib (erector) of the Masdar absolutely even if ... implied, and in place, they refused.\n192. Except that which is vague and the derived ... and measure it if it is in accordance with the verb (4).\n193. And the mutable which comes as an adverb ... and other than it, and what acts as an adverb alone.\n194. Then the non-mutable, and in place ... a Masdar substitutes, and it is common in time.\n\nThe Object With It (Al-Maf'ul Ma'ahu)\n195. The follower of the Waw is erected as an object with it ... by the preceding verb and a likeness in capacity.\n196. And like \"Ma anta wa Zaydan?\" (What are you and Zayd?) conceal ... a being, and when conjunction is possible, choose it.",
    "foot_note": "1. Meaning that the deletion of its operator is rejected.\n2. The conditions.\n3. Meaning with the existence of conditions, the preposition may exist.\n4. Meaning agreeing with the verb in its root material.",
    "book_id": "105",
    "new_page_number": 47
  },
  {
    "serial_number": "6606267",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 52,
    "volume_number": 1,
    "text": "197. And if it is weak, prefer the erection (Nasb), and if ... it is prevented, then the necessity of erection is noted (1).\n198. He said like \"Ma laka wa Zaydan?\" so look ... and erection if conjunction is not possible with an implied [verb].\n\nThe Exception (Al-Istithna')\n199. What \"Illa\" (Except) excepted in positive speech is complete (3) by it ... so erect it, and following a negation or what resembles it.\n200. Connected, follows 'La' if it precedes ... And 'La' if it is cut off; this is what (4) was selected.\n201. And cancel \"Illa\" if you empty what is before it ... for what follows it, and if you compose the like of it.\n202. And if repeated not for emphasis, then if ... you emptied or delayed, then erect them, you will be effortless.\n203. Not one, so make for it what is required ... and the erection of all of them when advanced is accepted.\n204. And except a genitive with \"Ghayr\" and \"Siwa\" ... parse like the excepted with \"Illa\" and \"Suwa\" (5).\n205. With \"La Yakunu\", \"Laysa\": erection is mandatory ... likewise \"Khala\", \"'Ada\", or drag (make genitive) with them (6).\n206. And after \"Ma\" erect, and genitive is rare ... and these two are verbs if they do not make genitive.\n207. And like \"Khala\": \"Hasha\", \"Hasha\", \"Hash\", and \"Ma\" ... do not accompany it, and interpret whatever is delusional.\n\nThe State (Al-Hal)\n208. The Hal is a surplus description understanding in ... a state, and the derivation possesses familiarity.\n209. Like transition, and rigidity has occurred ... in a price (7) or interpreted (8), and it is believed.",
    "foot_note": "1. i.e., Known.\n2. With difficulty, the reading appeared from the manuscript, and in some words of this hemistich, we have written the closest reading.\n3. i.e., Complete.\n4. Relative pronoun.\n5. One of the dialects of \"Siwa\".\n6. They are then prepositions.\n7. Like \"I sold it a Mudd for such-and-such.\"\n8. Like your saying: \"Zayd attacked [like] a lion.\"",
    "book_id": "105",
    "new_page_number": 48
  },
  {
    "serial_number": "6606268",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 53,
    "volume_number": 1,
    "text": "210. Indefiniteness of Hal, its wording is what is made indefinite ... and it came often as an indefinite Masdar.\n211. And the owner of the Hal (Dhu al-Hal) is mostly not indefinite if ... you do not find what in the beginning was noted.\n212. And its precedence over a genitive by a particle has disagreement (1) ... and it did not come from that to which it is added.\n213. Except that which operates or part of that which ... it was added to, or like part of this.\n214. And it is advanced erected by the verb or ... a conjugated description, and its precedence they refused.\n215. Its operator which has the meaning of the verb settled ... not its particle like \"Tilka\", \"Layta\", and it is rare.\n216. Like \"Sa'id mustaqirran fi Halab\" ... not \"Dhaka busran atyabu minhu rutab\" (2).\n217. And enumerate the Hal for a single or number ... and it came for emphasis of an operator.\n218. And a sentence it emphasized, so it was delayed ... and an operator, according to the most correct view, was implied.\n219. And bring it as an adverb and a sentence containing ... a pronoun if its beginning is a present tense verb fixed.\n220. Like its negation with \"Ma\" and \"La\" and forbidden is ... the Waw, and intend a subject in what is delusional.\n221. Like the past tense before \"Aw\" or \"Illa\" followed ... and connect other than this sentence with the Waw.\n222. Or a pronoun and with both, and deleted is ... the operator of Hal, and obligatorily it is familiar.",
    "foot_note": "1. Ibn Malik permitted it following Ibn Kaysan, Ibn Burhan, Abu Ali Al-Farisi, and Ibn Jinni. See: Idah al-Shi'r by Abu Ali 1/481, Sharh al-Umdah 1/429, Sharh al-Tashil 2/337, and Ham' al-Hawami' 2/306.\n2. This is one of the most famous sayings teeming in grammar books. Al-Suyuti devoted a separate treatise to this issue called \"Tuhfat al-Nujaba fi Qawlihim: Hadha Busran Atyabu Minhu Rutaban\" and included it in his great book Al-Ashbah wa Al-Naza'ir. Ibn Tulun did likewise in his book \"Al-Masa'il Al-Mulaqqabat fi Ilm Al-Nahw\" where he called it \"The Busriyyah Issue\". See: Al-Ashbah wa Al-Naza'ir 4/652, Al-Masa'il Al-Mulaqqabat 61, and Sharh Al-Radi 'ala Al-Kafiyah 2/34.",
    "book_id": "105",
    "new_page_number": 49
  },
  {
    "serial_number": "6606269",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 54,
    "volume_number": 1,
    "text": "The Distinction (At-Tamyiz)\n223. A noun with the meaning of \"Min\" (from), clarifying, indefinite ... erected as Tamyiz by what interpreted it.\n224. Of number, measure, weight, and possessed of (1) ... area, and everything resembling this (2).\n225. And after other than number, make genitive if you add ... and erection after what is added is known.\n226. If it does not suffice instead of what is added to it ... like the agent in meaning, by the noun he preferred it.\n227. And after an exclamation (Ta'ajjub), distinguish ... and dragging with \"Min\" (3) possessing number (4) \"Ma\" (5) was permitted.\n228. Like an agent converted from an agent or ... object or added (6), and the other they saw.\n229. And the operator of Tamyiz inevitably preceded ... and its precedence over the conjugated (7) the Sheikh (8) selected.\n\nThe Prepositions (Huruf Al-Jarr)\n230. Here are the prepositions, start with \"Min\" ... partition and clarify, and with negation increase.\n231. And its like in an indefinite (9), and as a substitute ... understood like the Ba, and for the end \"Ila\".\n232. \"Hatta\" and Lam, and for possession this (10) follows ... and its like, and increase and transgress, give reason.",
    "foot_note": "1. Meaning owner of.\n2. Demonstrative.\n3. \"Min\" in meaning is an agent.\n4. \"Dha\" is an object for the Masdar \"Jarr\".\n5. \"Ma\" here is a negation particle.\n6. Deletion of Tanween from \"Mudaf\" is a necessity, similar to \"Bashashata\" from the saying: Taghayyara kullu dhi ta'min wa lawnin * Wa qalla bashashata al-wajhu al-malihu. See: Al-Insaf 2/545 and Ham' al-Hawami' 3/276.\n7. Meaning the operator of the Tamyiz, the conjugated verb, precedes it.\n8. i.e., Ibn Malik. See: Al-Alfiyyah p. 115 verse 363.\n9. Meaning the indefinite noun.\n10. i.e., The Lam.",
    "book_id": "105",
    "new_page_number": 50
  },
  {
    "serial_number": "6606270",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 55,
    "volume_number": 1,
    "text": "233. With \"Fi\" and Ba take adverbiality and causality ... and like \"Ma'a\" and \"Min\" and \"'An\" the Ba comes.\n234. And transgress, compensate, attach, seek help with this ... with \"'An\" transgression, \"'Ala\" (1), \"Ba'da\" (2) take.\n235. \"'Ala\" for elevation and the meaning of \"'An\" and \"Fi\" ... and the Kaf liken, increase, and give reason, you will follow.\n236. And it may come as a noun like \"'Ala\" and \"'An\", and dragged ... this with a particle and added settled.\n237. And \"Mudh\" and \"Mundhu\", and for time these two drag ... like \"Min\" in the past, and like \"Fi\" in what is present.\n238. And two nouns if the sentence follows them or ... nominative, and dragging other than an apparent noun they refused.\n239. Like the Kaf: Hatta, the Waw, Rubba, the Ta. And Rubb ... specified indefinite, and Ta-Allahi and Rabb.\n240. And the increase of \"Ma\" in \"Min\" and \"'An\" does not restrain ... and Ba, and mostly \"Rubba\" and Kaf are restrained.\n241. And \"Rubba\" was implied so it dragged after \"Bal\" ... and the Waw, Fa, and without \"Rubba\" that is rare.\n\nThe Genitive Construction (Al-Idafah)\n242. Tanween or a Nun for declension delete ... from what you add, and the second make genitive and intend \"Fi\".\n243. Or Lam or \"Min\", and specify the first or ... define with the second; the indefinite absolutely they followed.\n244. In the first resembling \"Yaf'alu\" the description ... and name this verbal, lightened (3).\n245. And that is semantic and pure (4) ... and the connection of \"Al\" with this added we accept.",
    "foot_note": "1. Meaning it comes with the meaning of \"'Ala\" (on), like the poet's saying: Lah ibnu 'ammika la afdalta fi hasabin * 'anni wa la anta dayyani fatakhzuni. See: Huruf al-Ma'ani wa al-Sifat by Al-Zajjaji 79, Idah al-Shi'r by Abu Ali Al-Farisi 1/41, Amali Ibn al-Shajari 2/195, and Sharh al-Tashil 3/159.\n2. Meaning it comes with the meaning of \"Ba'da\" (after), like His saying: \"Latarkabunna tabaqan 'an tabaq\". See: Ma'ani al-Qur'an by Al-Farra 3/251, Al-Tibyan by Al-Ukbari 2/1279, Tawjih al-Luma' 529, Sharh al-Kafiyah al-Shafiyah 2/809, and Al-Tadhyil wa al-Takmil 11/225.\n3. Which is where the Mudaf is a description resembling \"Yaf'alu\". See: Sharh Ibn al-Nazim 275 and Sharh al-Muradi 2/786.\n4. Reference to the first section where the Idafah is on the meaning of the preposition. See: Sharh Ibn Aqil 3/45 and Al-Maqasid Al-Shafiyah 4/35.",
    "book_id": "105",
    "new_page_number": 51
  },
  {
    "serial_number": "6606271",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 56,
    "volume_number": 1,
    "text": "246. If it is plural or dual or connected ... to the second or what worked the genitive in it.\n247. Masculinity gain the first if, were it lost ... it would not be breached (1), and do not add to the united.\n248. In meaning (2), and interpret (3), and added forever ... names (4), and some of them with a wording singular.\n249. And some of them prevent from being added to an apparent noun ... like \"Wahda\", \"Labba\" and \"Dawalay\" and worthy.\n250. And compel the sentence to \"Haythu\" and \"Idh\" ... and if \"Idh\" takes Tanween it is singular, and what is like these.\n251. In meaning like this add, and this build and parse ... and before a verb built (past), the building was chosen.\n252. And before a declinable and a subject, anomalous (5) ... is its declension, and compel the verb to \"Idha\".\n253. For two generally not separated: \"Kila\" ... \"Kilta\", and for the individual defined then no.\n254. \"Ayy\" add (6) unless repeated or intended ... parts, and for the relative pronoun generally believe.\n255. And the Hal and the description for an indefinite absolutely ... and its interrogation and condition were released.\n256. And drag the follower of \"Lad\" and \"Ma'\" then minimize ... and open or break for a sukun that followed.\n257. And \"Ghayr\" join (with Damma) necessarily its building ... if you do not add it intending its meaning.\n258. Like: Qablu, Hasbu, Awwalu, Duna, Wara ... 'Alu, and if you make indefinite then erect (7) and drag.",
    "foot_note": "1. In the manuscript \"Lam Yanjazim\", and perhaps the correct is what we established.\n2. Because a thing is not added to itself. See: Al-Muqtadab 3/241, Sharh Al-Sirafi 1/445, and Al-Ta'liqah by Al-Farisi 1/142.\n3. Meaning you interpret everything appearing to be added to itself.\n4. Shortened from \"Asma'\" out of necessity.\n5. i.e., \"Shaddha\", and this is the school of the Basrans, while the Kufans permitted its building and Ibn Malik followed them, so he said in the Alfiyyah: \"Wa min bana falan yufannada\". See: Al-Alfiyyah p. 119 verse 402 and Al-Bahjah Al-Mardiyyah 320.\n6. Perhaps it is \"Adif\" (Imperative).\n7. In the manuscript \"Insib\" without the Fa, and without it the meter is disturbed.",
    "book_id": "105",
    "new_page_number": 52
  },
  {
    "serial_number": "6606272",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 57,
    "volume_number": 1,
    "text": "259. And the Mudaf (added) is deleted, so the follower for this ... succeeds in the ruling, or drag it (genitive) if.\n260. The deleted resembles what is conjoined after ... and the first remains if the second is deleted.\n261. In its state on condition of conjunction following ... you added it to the like of the follower of the first.\n262. An object or adverb, permit that they separate ... the operator, the Mudaf, from a second following.\n263. Likewise the oath with \"Imma\" is forgiven ... and the adjective and the call and the alien are rare.\n\nThe Added to the Yaa of the Speaker\n264. The end of this with the Yaa break, and say excepted is ... the one with a defect, the plural, and the dual.\n265. So the Yaa and the Waw with this Yaa are assimilated (1) ... and an Alif not in Hudhayl (2) was safe.\n266. I said (3): And the names: Abi, Akhi, Hani ... Fi, Hami, and Dhi, were not improved (4).\n\nOperation of the Masdar (Verbal Noun)\n267. Like its verb is the Masdar if it takes the place ... of a verb and \"An\" or \"Ma\", added or with \"Al\".\n268. Or not, and it is not implied, and complete ... nominative and accusative after dragging what followed.\n269. And the dragged follows in wording or place (5) ... and for the Noun of Masdar, i.e., the Mimic, is an operation.",
    "foot_note": "1. \"Iddaghama\" is the school of the Basrans, \"Adghama\" is the school of the Kufans. See: Al-Kitab 4/431, Sharh Al-Mufassal 5/512, Sharh Al-Kafiyah Al-Shafiyah 4/2175, and Al-Tashil 320.\n2. See: Ma'ani Al-Qur'an by Al-Zajjaj 3/354, Al-Lamat 98, I'rab Al-Qur'an by Al-Nahhas 1/48, Sharh Al-Sirafi 4/162, and Al-Masa'il Al-Askariyyat 85.\n3. Al-Suyuti means himself. See: Al-Bahjah Al-Mardiyyah 337.\n4. Al-Farra permitted it. See: Al-Bahjah Al-Mardiyyah 337.\n5. Meaning: It follows on its wording so it is genitive, or it follows on its place so it is accusative or nominative.",
    "book_id": "105",
    "new_page_number": 53
  },
  {
    "serial_number": "6606273",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 58,
    "volume_number": 1,
    "text": "Operation of the Active Participle (Ism Al-Fa'il)\n270. Like its verb is the active participle if it is isolated ... from the past and for a negation followed.\n271. Or an interrogative particle or came as an attribute ... or a predicate or attribute of what has deleted.\n272. And if it is the connection of \"Al\", then absolutely ... \"Fa'al\" or \"Mif'al\" like the one preceding.\n273. Likewise \"Fa'ul\" and \"Fa'il\" and \"Fa'il\" ... and whatever is other than the singular like it operates.\n274. And an operator erects or lowers (genitive) what ... follows, and the erection of other than it is mandatory.\n275. And the dragged follows in wording or place ... and for the Passive Participle (Ism Maf'ul) like it is an operation.\n276. With its condition and ruling, no exception ... or add to the one with elevation in meaning (1).\n\nStructures of Masdars\n277. \"Fa'l\" for the one with three transitive (2), \"Fa'al\" ... like \"Farah\" for the intransitive on \"Fa'ila\".\n278. And \"Fa'ala\" the intransitive possessed of \"Fu'ul\" ... like \"Ghada\" (3) and this is not encompassing.\n279. Rather possessed of refusal, for it is \"Fi'al\" (4) ... and the ailment and the sound, for it is \"Fu'al\" (5).\n280. And \"Fa'alan\" for it possesses volatility (6) ... for movement, and the sound \"Fa'il\" was chosen (7).\n281. \"Fu'ulah\", \"Fa'alah\" for \"Fa'ula\" (8) ... and what for this differed, take what was transmitted.\n282. And other than the one with three is measured ... its Masdar like \"Quddisa al-Taqdisu\".\n283. And \"Zakkihi Tazkiyatan\" and \"Ajmila ... Ijmala man tajammulan tajammala\".\n284. And \"Ista'idh Isti'adhatan\" then \"Aqim ... Iqamatan\", and mostly this Ta is required.",
    "foot_note": "1. Thus it is permissible to add the passive participle to its nominative, and it is not permissible to add the active participle to its nominative.\n2. Like: Daraba Darban.\n3. Its Masdar is Ghuduww.\n4. Like: Aba Iba'an.\n5. Like: Sa'ala Su'alan.\n6. Like: Dara Dawaranan.\n7. Like: Sarakha Surakhan.\n8. Like: Sahula Suhulah, and Jazula Jazalah.",
    "book_id": "105",
    "new_page_number": 54
  },
  {
    "serial_number": "6606274",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 59,
    "volume_number": 1,
    "text": "285. And extend and open following a seal (end) and break ... the third of the one with Hamza, you will find the Masdar.\n286. And the fourth join (Damma) in \"Tafa'lala\" ... \"Fi'lal\" (1) or \"Fa'lalah\" for \"Fa'lala\".\n287. And \"Fa'ala\": \"Al-Fi'al\" and \"Al-Mufa'alah\" ... and \"Fa'lah\" for a specific instance similar.\n288. And \"Fi'lah\" for a specific mode, and other than the ... three with the Ta, and the mode cast away (2).\n\nStructures of Active Participles and Attributes Resembling Them\n289. Like \"Fa'il\" is the active participle of the triliteral ... for \"Fa'ila\" of colors and events.\n290. So \"Af'al\" and \"Fa'lan\" possessed of fullness (3) ... and what is for accidents, formulate it \"Fa'ila\" (4).\n291. And not \"Fa'ultu\" for it has \"Fa'il\" (5) ... and \"Al-Fa'l\" (6) take and \"Af'al\" (7) is rare.\n292. And \"Af'al\" (8), and other than \"Fa'il\" was described ... \"Fa'al\" opened with it like the description of \"'Aff\" (9).\n293. And other than the one with three is like the present tense ... with joining of the first and breaking the fourth.\n294. And if you open, then it is a passive participle, and the ... one with three on the weight of Maf'ul take.\n295. And represented by transmission on its behalf \"Fi'l\" (10) and \"Fa'al\" (11) ... \"Fa'il\" (12) in their meaning except operation.\n\nThe Attribute Resembling the Active Participle (Al-Sifah Al-Mushabbahah)\n296. The Attribute Resembling the Active Participle ... is that which dragging its agent was deemed good.\n297. From an intransitive for a present, and it operates ... like a participle, and in conditions it is placed.",
    "foot_note": "1. In the manuscript \"Fa'al\", and the correction is from the Alfiyyah. See: Alfiyyah Ibn Malik p. 125 verse 453.\n2. For it is anomalous in other than the triliteral.\n3. Like Ahmar (Red) and Shab'an (Full).\n4. Like Ashir.\n5. Like Jamil.\n6. Like Dakhm.\n7. Like Batal.\n8. Like Akhtab.\n9. So he is 'Afif.\n10. Like Dhibh.\n11. Like Qabd meaning Maqbud.\n12. Like Kahil.",
    "book_id": "105",
    "new_page_number": 55
  },
  {
    "serial_number": "6606275",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 60,
    "volume_number": 1,
    "text": "298. And the implied described connect with the operated ... and its precedence to it for its branch (1) is prohibited.\n299. So raise and drag and erect with it with \"Al\" and no ... possessor of \"Al\" and possessor of addition and what is devoid.\n300. And do not drag with \"Al\" a name from \"Al\" devoid ... and from addition to what followed it.\n\nThe Wonder (Al-Ta'ajjub)\n301. \"Af'il\" and \"Ma Af'ala\" take for wonder ... and following this (2) erect, and that (3) drag with Ba.\n302. And its deletion (4) permit if the meaning is known ... and for the rigidity of the two forms, it is committed.\n303. And the formulation from a triliteral, conjugated ... accepting excess, possessed of completeness, what (5) is negated.\n304. Whose description is not \"Af'ala\" (6), or like \"Yutta'ad\" ... and lacking, replace it: \"Ashdid\" or \"Ashadd\".\n305. Its Masdar after \"Ashadda\" erect, and drag ... with Ba after \"Ashdid\", and other than this is rare (7).\n306. And the verb of this chapter advance it, and connect ... its operated, and separation by the adverb was transmitted (8).\n\nNi'ma and Bi'sa and What Runs in Their Course\n307. Two verbs: \"Ni'ma\", \"Bi'sa\", rigid ... for two nouns defined, so they are raisers (nominative).\n308. Or an implied [noun] interpreted by a distinguisher (Tamyiz) ... and its combination with an agent is permitted.",
    "foot_note": "1. Because it is a branch of the Active Participle, so it is weak.\n2. \"Ma Af'ala\".\n3. \"Af'il\".\n4. i.e., deletion of the Ba and what is after it, similar to His saying: \"Asmi' bihim wa Absir\".\n5. \"Ma\" here is negative.\n6. i.e., its description is not on Af'al.\n7. Like their saying: \"Ma adhra'aha\".\n8. Like the saying of Al-Abbas bin Mirdas: Wa qala nabiyyu al-muslimina taqaddamu * wa ahbib ilayna an takuna al-muqaddama. See: Sharh al-Tashil 3/35, Al-Lamhah fi Sharh al-Mulhah 1/523, and Al-Maqasid Al-Nahwiyyah 3/1480.",
    "book_id": "105",
    "new_page_number": 56
  },
  {
    "serial_number": "6606276",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 61,
    "volume_number": 1,
    "text": "309. And what is in \"Bi'sa ma ishtaraw\" (1) is a distinguisher (2) ... and Sibawayh (3) is an agent and they distinguished.\n310. And afterwards came the specific [noun] not with a pointer ... as a subject or predicate for an implied.\n311. Like \"Bi'sa\": \"Sa'a\", and like \"Ni'ma\": \"Fa'ula\" ... from the triliteral, and \"Habbadha\" make.\n312. Its agent \"Dha\", and with \"La\" say blameworthy ... and follow \"Dha\" its specific whatever.\n313. And keep \"Dha\" and what is other than it raise with \"Habba\" ... or drag with Ba, and from it the joining (Damma) of the Ha dominated.\n\nThe Elative (Af'al al-Tafdil)\n314. Af'al for preference is like the wonder (4) ... in formulation and prevention and connection of what was refused.\n315. And if stripped connect with \"Min\" and make indefinite ... unify as added to the indefinite.\n316. And the follower of \"Al\" matches, and if added to ... a known and the meaning of \"Min\" you discarded, then like this.\n317. And if you intended, then with two faces speak ... and if for \"Min\" an interrogative with it followed.\n318. Advance them, and its raising of the apparent is rare (5) ... and common if it occupied the place of the verb.\n319. Like \"Ma ra'aytu rajulan ahsana fi ... 'aynayhi kuhlun minhu fi 'ayni al-safi\".\n\nThe Adjective (Al-Na't)\n320. Follows in declension the first names ... Adjective and Emphasis and Conjunction and Substitute.\n321. So the adjective is a follower completing (6) what it described ... either for it or its causal it was fixed.\n322. So let it run like the described in indefiniteness and in ... definition and it is like a verb if followed.",
    "foot_note": "1. Al-Baqarah 90.\n2. See: Al-Tibyan by Al-Ukbari 1/91, Al-Bahr Al-Muhit 1/472, and Al-Durr Al-Masun 1/507.\n3. See: Al-Kitab 3/155.\n4. Their rulings are from one chapter. See: Al-Ashbah wa Al-Naza'ir 4/477.\n5. This is called the Kuhl Issue.\n6. Permissible with Tanween and without Tanween with addition of what is after it to it.",
    "book_id": "105",
    "new_page_number": 57
  },
  {
    "serial_number": "6606277",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 62,
    "volume_number": 1,
    "text": "323. Masculine, singular, and branch, and describe ... with the description and the resembling it like \"Dhi\" (1) and \"Ti\" (2).\n324. And a sentence with a connector not for request ... indefinite, and a Masdar and it was mandatory.\n325. Its masculinity and singularity, and the differing ... from the description of other than the singular distinguish inclined.\n326. And the description of two operated by unique operation ... and meaning follow it like descriptions following.\n327. Needful and if without them it is distinguished ... or some of them, allow following and cutting.\n328. Nominative and accusative by that which deletion adhered ... and they deleted a description and a described known (3).\n\nThe Emphasis (Al-Tawkid)\n329. With \"Al-Nafs\" (Self) emphasize names and \"Al-'Ayn\" (Eye/Same) ... with a pronoun matching, and gather these two.\n330. With \"Af'ul\" if they followed the dual ... and \"Kull\" (All) mention if inclusion is meant.\n331. \"Kilta\", \"Jami'an\" and \"Kila\" with a pronoun ... and \"Fa'ilan\" from \"'Amma\" with the Ta mention (4).\n332. And after \"Kull\" come with \"Ajma'\", \"Juma'\" ... \"Jam'a'\", \"Ajma'in\" or leave all.\n333. And it is what I see, for the Eloquent One said (5): ... \"Sallu Julusan Ajma'un\" (Pray sitting all together) in the Sahih (6).\n334. And do not emphasize an indefinite unless it benefits (7) ... and in the dual the formulation of \"Ajma'\" is lost.\n335. And if you emphasize a nominative connected pronoun ... with \"Al-Nafs\" and \"Al-'Ayn\" then after the disconnected.\n336. Not with other than these two, and the verbal ... is repeated, and that is semantic (8).",
    "foot_note": "1. Meaning Owner (Sahib).\n2. Demonstrative noun.\n3. Deletion of the described is frequent, and deletion of the description is rare.\n4. He did not explicitly state \"'Ammah\" because it leads to the meeting of two still letters in the stuffing of the verse, and this is not permissible.\n5. He means the Prophet, peace be upon him.\n6. See: Sahih Al-Bukhari 1/139 and Sahih Muslim 1/309.\n7. The issue is disputed between the two schools. See: Al-Insaf 2/369, Sharh Al-Tashil 3/296, and Al-Maqasid Al-Shafiyah 5/16.\n8. He refers by \"that\" to what passed of Al-Nafs, Al-'Ayn, Kila, Kilta, etc.",
    "book_id": "105",
    "new_page_number": 58
  },
  {
    "serial_number": "6606278",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 63,
    "volume_number": 1,
    "text": "337. And if you repeat a relative pronoun, then the one which ... you connected with, and the particle likewise.\n338. Other than an answer, and with a pronoun separated ... for the nominative emphasize every connected pronoun.\n\nThe Explanatory Apposition ('Atf Al-Bayan)\n339. 'Atf Al-Bayan is a follower to what comes ... clarifying like an adjective in agreement with the first.\n340. Come with them both defined or indefinite ... and as a substitute it is seen except in two.\n341. Like \"Al-Tariki Al-Bakriyyi Bishrin\" (1) for example ... and \"Ya Ghulamu Ya'mura\", and it was problematic (2).\n\nThe Conjunction ('Atf Al-Nasaq)\n342. Conjoin with Waw, Fa and \"Thumma\" coordinated ... \"Hatta\", \"Am\", \"Aw\" and these followed absolutely.\n343. And \"Bal\" and \"Lakin\", \"La\" verbally, and conjoin ... accompanying or preceding or following.\n344. With the Waw with possessor of partnership like \"Istaffa\" (3) ... and specify with order and speed the Fa.\n345. And conjunction of other than a connection to the connection ... and \"Thumma\" for order and separation (4) make it.\n346. A part and an end with \"Hatta\" and \"Am\" that is ... after a Hamza equating or like \"Ay\".\n347. And it is like \"Bal\" if it is empty, and doubt and allow ... with \"Aw\" and give choice, divide, be vague, and you will be correct.",
    "foot_note": "1. Reference to the saying of Al-Murrar Al-Asadi from the Wafir meter: Ana Ibn Al-Tariki Al-Bakriyyi Bishr * 'Alayhi al-tayru tarqubuhu wuqu'an. The witness in it is his saying \"Bishr\" for it is 'Atf Bayan not a substitute from \"Al-Bakri\" because the substitute is on the intention of repeating the operator so it would be \"Al-Tariki Bishr\" and this is not permissible because it necessitates adding the one with \"Al\" to one devoid of it, and that is not permissible, so 'Atf Bayan was determined. See: Al-Kitab 1/182, Al-Usul 1/135, Sharh Al-Kafiyah Al-Shafiyah 3/1196, Sharh Ibn Aqil 3/222, Ham' al-Hawami' 3/161, and Khizanat Al-Adab 4/284.\n2. The one who found it problematic against Ibn Malik is Ibn Hisham in his footnote on Al-Tashil. See: Al-Bahjah Al-Mardiyyah 404.\n3. The Alif is for duality.\n4. Meaning with a delay, and every delay is according to it.",
    "book_id": "105",
    "new_page_number": 59
  },
  {
    "serial_number": "6606279",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 64,
    "volume_number": 1,
    "text": "348. Like \"Bal\" and like the Waw if confusion is negated ... and like \"Aw\": \"Imma\" and this did not conjoin.\n349. A call affirmatively and a command do not follow ... a negation and prohibition \"Bal\" and \"Lakin\" and transmit.\n350. With \"Bal\" for a second the ruling of a first at ... a command and positive, and \"Laysa\" make good.\n351. Conjunction with it in meaning only and it is the most worthy ... for Al-Shafi'i, our Imam, spoke with it (1).\n352. And conjoin to a connected nominative pronoun ... with a separator, and common is the conjunction of what separated.\n353. And the genitive pronoun repeat if you conjoin ... to it a dragger (preposition), and leaving it was selected.\n354. And the Fa is deleted and a follower if safe ... and the Waw likewise, and specification (2) was noted.\n355. By conjunction of an operator you deleted and remained ... its operated, and deletion of a followed was selected.\n356. If it appeared, and the conjunction in the verb was taken ... as long as it did not differ in time, so it was cast away (3).\n357. And conjoin to a noun resembling a verb, a verb ... and its opposite, and the conjunction particle delete originally.\n\nThe Substitute (Al-Badal)\n358. The substitute following without a particle (4), intended ... by the ruling, a part or matching appears.\n359. Or possessed of inclusion or like the follower of \"Bal\" and this ... if intended as strike (Idrab) appeared (5), or cast away (6).",
    "foot_note": "1. Imam Al-Shafi'i said in Kitab Al-Umm: \"Li'anna al-taharati kullaha innama ju'ilat 'ala ma yazharu laysa 'ala al-ajwaf\". See: Al-Umm 1/252 and Ham' al-Hawami' 3/218.\n2. Meaning that it is specific to conjoining a deleted operator whose operated remained.\n3. See: Al-Bahjah Al-Mardiyyah 419.\n4. Caution against what is after Bal and Lakin. See: Sharh Al-Kafiyah Al-Shafiyah 3/1276.\n5. Called Substitute of Strike (Badal al-Idrab) and Appearance (Bada'). See: Al-Bahjah Al-Mardiyyah 421.\n6. Meaning if it was without intention, it is called Substitute of Error or Mistake. See: Al-Bahjah Al-Mardiyyah 422.",
    "book_id": "105",
    "new_page_number": 60
  },
  {
    "serial_number": "6606280",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 65,
    "volume_number": 1,
    "text": "360. By it the mistake, and apparent is not a substitute ... from an absent pronoun except what included.\n361. Or came as encompassment and part (1), and say ... indicates what included Hamza this follows.\n362. And the substitution of the verb from the verb appears ... and a sentence from a sentence and single (2).\n\nThe Call (Al-Nida')\n363. Call a distant or likewise with \"Ya\", \"Aya\" ... \"Haya\" and \"Ay\", \"A\", \"A\" with Hamza near.\n364. And \"Ya\" and \"Wa\" possessor of lamentation, \"Ya\" for confusion leave ... and deletion from lamentation and implied is prevented.\n365. Like the succored (Mustaghath) and it is rare in names ... of pointing and the genus, not other than them.\n366. And build on the nominative the unique (3) defined ... and intend with a built [noun] like the renewal of the adjective.\n367. And the individual indefinite and the added erect and generalize ... the semi-added or \"Jamila Al-Wajhi\" (Beautiful of face) join (Damma).\n368. And join and open from \"A Zaydu bna 'Ali\" ... and join if \"Ibn\" followed two proper nouns.\n369. And add Tanween to the built out of necessity then erect ... or join, and the combination of \"Ya\" and \"Al\" was refused.\n370. Except with \"Allah\" and the narrated sentences ... and the most common is \"Allahumma\". \"Ya Allahumma\" (4) is rare.",
    "foot_note": "1. i.e., what conveyed a part.\n2. Meaning a sentence substitutes a singular, like the saying of Ibn Abi Rabi'ah: Ila Allahi ashku bi-al-Madinati hajatan * wa bi-al-Shami ukhra kayfa yaltaqiyani. See: Sharh Al-Tashil 3/340, Sharh Al-Muradi 2/1050, and Mughni Al-Labib 273.\n3. He means the singular.\n4. Reference to the Rajaz of Abu Kharash: Inni idha ma hadithun alama * aqulu ya Allahumma ya Allahumma. The witness in it is his saying \"Ya Allahumma\" where the poet combined the particle of calling and the stressed Mim which comes as a substitute for it if deleted, and this is a necessity. See: Al-Fawa'id Al-Ajibah 29, Al-Muqtadab 4/242, Al-Insaf 1/279, Sharh Al-Kafiyah Al-Shafiyah 3/1307, and Al-Lamhah 2/798.",
    "book_id": "105",
    "new_page_number": 61
  },
  {
    "serial_number": "6606281",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 66,
    "volume_number": 1,
    "text": "Section\n371. Erect an added without \"Al\" following (1) a Damma ... and raise or erect other than it, and make intended (2).\n372. Like an independent in coordination and substitute ... and a coordinated with \"Al\" with two faces ascended.\n373. Nominative (3), and \"Ayyuha\" specify inevitably with this ... \"Al\" raising and with the pointed to and \"Alladhi\".\n374. And the description of a pointer to it lacked ... so raise, and \"Sa'du Sa'da Al-Awsi\" (4) the erection settled.\n375. In the second, and the first join and open ... to the follower of the second it was added in the most correct view.\n\nThe Called Added to the Yaa\n376. Added of Ya (5) correct called: 'Abdiya ... 'Abdi and 'Abdi, 'Abda, 'Abda delete for Ya.\n377. And open or break Ya Ibna Umma, Ya Ibna 'Amm ... Abati, Ummati with this the two faces complete.\n\nNames Adhering to the Call\n378. Lu'man, Nawman, Fulu specify with the call ... and \"Ya Khabathi\" abuse of the female is regular (6).\n379. From the triliteral, and \"Fu'alu\" was common ... for a male, and dragged in poetry \"Fulu\" (7).",
    "foot_note": "1. Object for his saying \"Erect\".\n2. It appears that his saying \"Tu'ammu\" is a parenthetical sentence, and the meaning: \"And make like an independent in coordination...\"\n3. His saying: \"Ascended a raising\" means that the nominative is selected and chosen. See: Al-Alfiyyah p. 141 verse 587.\n4. Reference to his saying from the Tawil meter: Aya Sa'du Sa'da Al-Awsi kun anta nasiran * wa ya Sa'du Sa'da Al-Khazrajina Al-Ghatarifi. The witness is: \"Ya Sa'du Sa'da Al-Awsi\" where he repeated the called one added so the erection of the second is mandatory and in the first are faces, and the intended two Sa'ds are Sa'd bin Mu'adh and Sa'd bin Ubadah. See: Hashiyat Ibn Hamdun 2/41, Al-Mujalasah wa Jawahir Al-Ilm 4/96, Al-Mustadrak 'ala Al-Sahihayn 3/283, Akam Al-Marjan 190, Hawatif Al-Jinan 36, and Al-Tamhid 24/105.\n5. i.e., Yaa of the speaker.\n6. In the manuscript: \"Wa ittirada\" and with the Waw the verse breaks.\n7. He means: Tadillu minhu ibili bi-al-hawjali * tadafu'a al-shaybi wa lam tuqtali * fi lujjatin amsik fulana 'an fuli. The Rajaz is by Abu Al-Najm Al-Ijli from the famous poem starting: Al-Hamdu lillahi al-'aliyyi al-ajlali * al-wasi'i al-fadli al-wahubi al-mujzili. The witness in it is his saying \"'an fuli\" where he used it in other than the call and dragged it with the preposition. See: Al-Kitab 2/248, Al-Muqtadab 4/238, Al-Usul 1/349, and Sharh Al-Kafiyah Al-Shafiyah 3/1331.",
    "book_id": "105",
    "new_page_number": 62
  },
  {
    "serial_number": "6606282",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 67,
    "volume_number": 1,
    "text": "The Cry for Help (Al-Istighatha)\n380. Lower (genitive) with a Lam a succored (Mustaghath) that came with ... an opening (Fatha) like in the conjoined with \"Ya\", and take.\n381. In other than this the break (Kasra) (1), and for it append ... with an Alif likewise the possessor of wonder.\n\nThe Lamentation (Al-Nudba)\n382. Like the one of the call is the one of lamentation, and the indefinite not ... lamented and the vague not what was connected.\n383. And with an Alif connect it, and if followed by ... its end delete it like \"Wa Musahu\".\n384. Tanween of what completed it likewise, and if ... delusional then from it the Alif flip not weak.\n385. And the Ha increase in stopping permissibly, \"Abdiya\" ... \"Abda\" sang who in the call silenced Ya.\n\nThe Truncation (Al-Tarkhim)\n386. Truncate by deleting the end the called ... feminine with the Ha or what increased.\n387. Over three a proper noun not added ... and rare if supported, and its follower delete.\n388. If it was soft still and extra ... completing four and upwards.\n389. Like the end of the compound, and in the Waw differed ... and the Ya and not the opening, and if for what deleted.\n390. You intended, keep its follower like what ... before and otherwise like if it were completed.\n391. Like \"Ya Thamu\" and \"Ya Thami\" upon them ... \"Muslimatu\" the first in it obligate (2).\n392. And permit the two faces in like \"Maslamah\" ... and acceptable of the call out of necessity truncate.",
    "foot_note": "1. Object to his saying \"Take\" in the end of the previous verse.\n2. Meaning that one must treat \"Muslimah\" upon truncation according to the dialect of the one who waits only, so you say: \"Ya Muslima\", and it is not permissible to run it on the dialect of the one who does not wait, so you do not say: \"Ya Muslimu\"; so that the masculine is not confused with the feminine, Muslim with Muslimah. See: Sharh Ibn Al-Nazim 427, Al-Maqasid Al-Shafiyah 5/454, and Sharh Al-Makudi 255.",
    "book_id": "105",
    "new_page_number": 63
  },
  {
    "serial_number": "6606283",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 68,
    "volume_number": 1,
    "text": "The Specialization (Al-Ikhtisas)\n393. Specialization is like a call without \"Ya\" ... for \"Ayy\" or for \"Al\" coming following.\n\nThe Warning and Incitement (Al-Tahdhir wa Al-Ighra')\n394. \"Iyyaka wa al-Sharra\" (Beware of evil) with warning erected ... concealed inevitably like \"Iyyaka al-Ghadab\" (Beware anger).\n395. And other than \"Iyya\" the mention of its verb permit ... not the one of repetition and the one of conjunction valid.\n396. \"Iyyaka\", \"Iyyahu\" is anomalous and likewise ... with other than \"Iyya\" what was incited with take.\n\nNames of Verbs and Sounds (Asma' Al-Af'al wa Al-Aswat)\n397. What substituted for a verb named the verb like \"Sah\" ... and what is with the meaning of \"If'al\" (1) is many like \"Mah\".\n398. And rare is other than it like \"Hayhata\" and \"Way\" ... and from names of the verb \"Ruwayda\", \"Balha\", i.e.\n399. If they erected, and as two Masdars they lowered (2) ... \"'Alayka\", \"Dunaka\", \"Ilayka\" turn (3).\n400. And like a deputy for it operate advanced ... and if it takes Tanween then with its indefiniteness judge.\n401. And its like is the narrated with it or addressed ... other than the one who reasons a sound like \"Qaba\" (4).\n\nThe Two Nuns of Emphasis\n402. Emphasize with two Nuns severe and possessor (5) ... of lightness, a command and the present tense which.\n403. Came as a request or a condition \"Imma\" followed ... or positive in an oath future.\n404. And after \"Ma\" and \"Lam\" and \"La\" it did not preponderate ... and other than \"Imma\", and its end open.",
    "foot_note": "1. He means the imperative verbal noun.\n2. Meaning if they erected what follows them, they are verbal nouns, and if they dragged what follows them, they are Masdars, and what follows them is added to.\n3. He means the meaning of \"Ilayka\" is turn away.\n4. \"Qab\" is a narration of the sound of a sword strike. See: Al-Muhkam wa Al-Muhit Al-A'zam 6/143 and Taj Al-Arus 3/514.\n5. i.e., owner, meaning: \"possessed of lightness\".",
    "book_id": "105",
    "new_page_number": 64
  },
  {
    "serial_number": "6606284",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 69,
    "volume_number": 1,
    "text": "405. And vowelize it before a soft pronoun with what ... matches, and the pronoun its deletion commit.\n406. Not an Alif, and the end of the verb the Alif ... Ya make if the Alif raises, and deleted.\n407. If the Waw or the Ya raises, and vowelize ... these two and match, and the light does not follow.\n408. For an Alif rather its sister and break, and with ... a Nun of females an Alif before gathered.\n409. And delete a light one for a silent following ... and after other than the Fatha in pause ascended.\n410. And return what for it in connection was deleted ... and after a Fatha flip Alif like \"Qifa\".\n\nWhat Does Not Inflect (Ma La Yansarif)\n411. Inflection is Tanween clarifying a meaning (1) ... so the Alif of femininity however appeared (2).\n412. Prevents from inflection, and two extras in ... \"Fa'lan\" descriptive a Ta with its female was negated (3).\n413. And an original description with \"Af'al\" prevented ... its femininity with the Ta, and the accidental (4) leave.\n414. In the description and the name like \"Al-Adham, Arba'i\" ... two faces in like \"Ajdal\", and prevent.\n415. A description with deviation ('Adl) like \"Thulatha\" and \"Ukhar\" ... \"Mathna\" and the weight of these two for the four settled.\n416. And the plural possessor of the weight of \"Mafa'il\" and possessor ... of \"Mafa'il\", and the possessor of its defect take.\n417. Nominative and genitive deletion of a Ya and add Tanween to it ... and prevent \"Sarawil\" for a resemblance in weight (5).\n418. And the mixed proper noun or possessor of Alif ... and Nun of \"Fa'lan\" or the Ha prevent you fulfill.\n419. And prevent a feminine with other than the Ha settled ... above three or like \"Jawra\" or \"Saqar\".",
    "foot_note": "1. Which is that the noun is established in nominality, so it did not resemble the particle strongly to be built, nor the verb to be prevented from inflection.\n2. The Alif in \"'Anna\" is for release (poetic license).\n3. Ibn Malik has a poem for these words that came on Fa'lan Fa'lana in his book Nazm Al-Fawa'id. See: Nazm Al-Fawa'id 62.\n4. Meaning accidental descriptiveness and nominality.\n5. i.e., in the weight. See: Al-Alfiyyah p. 149 verse 660.",
    "book_id": "105",
    "new_page_number": 65
  },
  {
    "serial_number": "6606285",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 70,
    "volume_number": 1,
    "text": "420. Or its origin is masculine and if lost ... this and foreignness then its prevention find.\n421. Like the foreign in placement and definition cited ... above three, or with the weight of the verb specified.\n422. Or dominant, and a proper noun possessor of Alif ... of appending or possessor of deviation did not inflect.\n423. And the proper noun of the female \"Fa'ali\" prevent likewise ... Tamim (1) and building with Kasra is the right of this.\n424. And whatever definition influenced inflect ... indefinite, and from it the possessor of deficiency followed.\n425. A defective plural, and out of necessity inflect ... the possessor of prevention and the inflected its prevention followed.\n\nDeclension of the Verb\n426. Raise a present tense free from two operators of ... erection and jussive, and erect with \"Lan\" and \"Kay\".\n427. And \"An\" except from after knowledge and that which ... from after supposition, raise and erect with this (2).\n428. And with \"Idhan\" beginning, future ... connected or with an oath separated.\n429. And after conjunction of this like \"An\" from after supposition ... and between \"La\" and a Lam commit the mention of \"An\".\n430. And upon loss of \"La\" imply or show ... and after negation of \"Kana\" inevitably imply.\n431. Like \"Aw\" if \"Hatta\" or \"Illa\" was valid (3) ... its place and after \"Hatta\" this became clear.\n432. And following it the future erect and raise ... a present state and if you answer with a Waw like \"Ma'in\".\n433. And the Fa of pure request or negation ... implied \"An\" and after other than negation.\n434. If the Fa drops make jussive and after prohibition place ... \"In\" before \"La\" if it differs then jussive leave.",
    "foot_note": "1. See: Al-Kitab 3/277 and Al-Muqtadab 3/49.\n2. Because it is then lightened from the heavy and its subject is the pronoun of the affair and the sentence after it is the predicate.\n3. Meaning that \"An\" must be implied after \"Aw\" if \"Hatta\" or \"Illa\" is valid in its place. See: Al-Kitab 3/47, Al-Muqtadab 2/28, Sharh Abyat Sibawayh 2/71, Sharh Ibn Al-Nazim 479, Sharh Al-Muradi 3/1246, and Al-Maqasid Al-Shafiyah 6/32.",
    "book_id": "105",
    "new_page_number": 66
  },
  {
    "serial_number": "6606286",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 71,
    "volume_number": 1,
    "text": "435. And the command other than \"If'al\" its answer make jussive ... and in an answer for hope erection obligate.\n436. Or establish \"An\" and deletion of \"An\" and erection is anomalous ... in other than what passed and whoever analogized cast away.\n437. And conjoin to a pure noun a verb with Fa ... or Waw or \"Thumma\" and erect and delete.\n\nFactors of the Jussive (Jazm)\n438. With \"La\" and Lam of request the verb make jussive ... and \"Lam\" and \"Lamma\", \"In\" and \"Idhma\", \"Haythuma\".\n439. \"Ayyan\", \"Ayna\", \"Man\" and \"Ayy\", \"Mahma\" ... \"Anna\", \"Mata\", \"Ma\", following \"Idhma\" are names (1).\n440. And \"In\" and its follower for two verbs made jussive ... the condition then the recompense this the answer name.\n441. Two present tense verbs, two past verbs (2) or possessors of ... difference, and raise a recompense properly i.e.\n442. From after a past and other than it whatever opened ... and couple with Fa inevitably an answer whatever was valid.\n443. As a condition, likewise \"Idha\" and \"Mahma\" conjoined ... a verb to the recompense with Waw or with Fa.\n444. Triplicate and the follower of Fa or Waw midst ... the two sentences erect it and make jussive only.\n445. And what from the recompense and condition is known ... deleted, and what was delayed its answer deleted.\n446. From an oath and the condition but if preceded ... a subject then the condition for mention is more entitled.",
    "foot_note": "1. Idhma, Haythuma, Ayyan, Ayna, Man, Ayy, Mahma, Anna, Mata, Ma.\n2. In this is a nice subtlety from Al-Suyuti, where he presented the present tense over the past, while Ibn Malik presented the past over the present, and presenting the present over the past is more appropriate because the present is more frequent. Ibn Jabir Al-Hawari said: \"And his right was to present the two present tenses for their originality, but the poem ruled over him.\" But if we went along with Ibn Malik's school in necessity, there is no scope for what Ibn Malik fell into, and he could have avoided it. Al-Ghazzi said in his explanation on the Alfiyyah: And the most is the second so if he presented it * it would be better like if he organized it: Mudari'ayni thumma madiyyayni * tulfihima aw mutakhalifayni. See: Sharh Al-Kafiyah Al-Shafiyah 1/300, Shawahid Al-Tawdih wa Al-Tashih 160, Sharh Ibn Jabir Al-Hawari 4/145, Sharh Al-Ghazzi Verse 7024, and Khizanat Al-Adab 1/33.",
    "book_id": "105",
    "new_page_number": 67
  },
  {
    "serial_number": "6606287",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 72,
    "volume_number": 1,
    "text": "\"Law\" the Conditional\n447. \"Law\" is a particle of condition in the past, and shifts ... to it a present tense following it, and rare.\n448. Future in meaning, and with the verb it is specified ... and \"Anna\" a subject upon it 'Amr (1) cited (2).\n\n\"Amma\" and \"Lawla\" and \"Lawma\"\n449. \"Amma\" like \"Mahma yakun min shay'in\" and whatever ... verb follows this for a meaning known.\n450. And Fa for its follower obligate and anomalous is ... in prose its deletion without a saying cast away.\n451. \"Lawla\" and \"Lawma\" for prevention since existed ... a thing for the beginning commit and benefit.\n452. With these two incitement and \"Halla\", \"Alla\" ... and with \"Ala\" offer, and they specified a verb.\n\nReporting with \"Alladhi\" and Alif and Lam\n453. With \"Alladhi\" with its branches if you report ... a subject precede and come with the predicate.\n454. And it is that which is said: Report about it ... and other than these two as a connection center it.\n455. And the condition of what is reported about is that it accepted ... delay and a pronoun about it replaced (3).\n456. Or a foreign [word] and with \"Al\" about some of this ... a verb advanced so report and mimic.\n457. If the formulation of a connection from it for \"Al\" is valid ... and its raising an implied of other than it separated.",
    "foot_note": "1. He means Sibawayh.\n2. Sibawayh said: \"And you say: Law annahu dhahibun lakana khayran lahu, so Anna is built on Law as it was built on Lawla, as if you said: Law dhaka\". See: Al-Kitab 3/121.\n3. i.e., permissibility of dispensing with it by a pronoun. See: Sharh Ibn Al-Nazim 515, Sharh Ibn Aqil 4/63, and Sharh Al-Makudi 300.",
    "book_id": "105",
    "new_page_number": 68
  },
  {
    "serial_number": "6606288",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 73,
    "volume_number": 1,
    "text": "The Number (Al-'Adad)\n458. \"Thalathah\" to \"'Ashrah\" say for the male ... and its opposite (1) strip from the Ta, and dragged.\n459. Its Tamyiz, and a plural of paucity appeared ... and \"Mi'ah\" to \"Al-Alf\" dragged what was single.\n460. And rare is dragging (2) the plural, and mention in the male ... compound \"Ahad\" before \"'Ashar\".\n461. In the opposite \"Ihda 'Ashrata\" or break ... a Shin (3), and take \"Thalathah\" for the other.\n462. As passed, and \"Al-'Ashr\" then decree absolutely ... for it as for one preceded (4).\n463. In the male \"Ithna 'Ashara\", the female \"Ithnata ... 'Ashrata\", and the first (5) declense, and other than Ta.\n464. Is built on Fatha except \"Thamani\" ... for they permitted deletion with silence (Sukun).\n465. With one \"'Ishruna\" is distinguished if ... made indefinite with compound or son of this.\n466. Adding it, and formulate from \"Ithnayn\" to ... \"'Asharah\": \"Fa'ilah\" and \"Fa'ila\".\n467. And add if you want with it some of that which ... from it you built it like \"Thani ithnayn dha\".\n468. And if you want making the lesser like what ... is above then like the active participle operate and commit.\n469. And if you wanted like \"Thani ithnayn\" ... compound then come with two compounds.\n470. Or \"Fa'il\" add it to the compound ... or come with \"Hadi 'Ashar\" the succeeding.\n471. And \"Fa'il\" before what is \"'Ishrina\" ... and the Waw take like \"Al-Hadi wa Al-Tis'ina\".",
    "foot_note": "1. i.e., The feminine.\n2. In the manuscript \"Yujarru\" and perhaps the correct is what we established.\n3. Breaking the Shin is the dialect of Tamim. See: Ma'ani Al-Qur'an by Al-Akhfash 1/104, Sharh Al-Sirafi 2/9, and 'Ilal Al-Nahw 499.\n4. With the Ta with the masculine, and without it with the feminine.\n5. He means by the first \"Ithna, Ithnata\" for they are parsed with the inflection of the dual.",
    "book_id": "105",
    "new_page_number": 69
  },
  {
    "serial_number": "6606289",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 74,
    "volume_number": 1,
    "text": "\"Kam\" and \"Ka'ayyin\" (1) and \"Kadha\"\n472. Distinguish like \"'Ishrina\": \"Kam\" if you interrogate ... and drag with \"Min\" an implied if \"Kam\" dragged.\n473. Like \"'Ashr\" or like \"Mi'ah\" informing this ... and erect the two distinguishers of \"Ka'ayyin\" and \"Kadha\" (2).\n\nThe Quotation (Al-Hikayah)\n474. What is for the indefinite with \"Ayy\" quote if ... you ask with it about it and in pause appeared (3).\n475. And the Nun saturate and \"Manani\" if you make dual ... \"Manayni\", \"Mantani\", \"Manah\" the singular (4) appeared.\n476. \"Manatu\" with \"Manina\" if plural is meant ... \"Manuna\" the Nun of what passed silence.\n477. And if you connect then the wording of \"Man\" does not differ ... and quote with it proper nouns if they did not curve.\n\nThe Femininity (Al-Ta'nith)\n478. Alif or Ta is the mark of femininity, in ... names intend a Ta, and with a pronoun know.\n479. And the return in diminutive and reporting ... and Hal and adjective and with the pointer.\n480. And \"Mif'ala\" does not follow \"Fa'ul\" originally ... \"Mif'al\", \"Mif'il\" and anomalous is what followed.\n481. And mostly prevented from \"Fa'il\" ... following the described like \"Al-Qatil\".\n482. And Alif of shortening and extending the first ... like \"Marata\" and \"Uraba\" and \"Al-Tula\".\n483. And the weight of \"Fa'la\", \"Summaha\", \"Hubara\" ... \"Dhikra\", \"Sibatra\" of walking and \"Al-Shuqqara\".",
    "foot_note": "1. Thus in the manuscript, and in Al-Ham': \"As for 'Ka'ayyin' it is written with the Nun as a single saying\". See: Ham' al-Hawami' 3/502.\n2. Abu Hayyan has a book dedicated to \"Kadha\" called \"Al-Shadha fi Mas'alat Kadha\", explained by Ibn Hisham in a book he called \"Fawh Al-Shadhal bi Mas'alat Kadha\", quoted by Al-Suyuti in Al-Ashbah wa Al-Naza'ir. See: Al-Ashbah wa Al-Naza'ir: 4/281.\n3. Thus in the manuscript and perhaps it is unbalanced.\n4. Does not balance.",
    "book_id": "105",
    "new_page_number": 70
  },
  {
    "serial_number": "6606290",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 75,
    "volume_number": 1,
    "text": "484. And the weight of \"Fi'ila\", \"Fu'ulla\", \"Faw'ala\" ... and the weight of \"Fu'ayla\" and the weight of \"Fa'lala\".\n485. And he increased in Kafiyah (1) other things ... possessing fame and other than these rare.\n486. For extension \"Fa'la'\" and absolute \"Af'ila\" ... in 'Ayn and \"Fa'lala\", \"Fi'ala\", \"Fu'lula\".\n487. And \"Fa'liya'\", \"Fa'ila\", \"Fa'ula\" ... and \"Fa'ala\" absolute Fa \"Maf'ula\".\n488. And absolute 'Ayn \"Fa'ala\" and he mentioned ... in the Origin (2) weights all of them famous.\n\nThe Shortened and Extended (Al-Maqsur wa Al-Mamdud)\n489. Possessor of soundness from before its end opened ... its counterpart the defective its shortening clarified.\n490. Like \"Fi'al\" and \"Fu'al\" plural known ... for \"Fi'lah\" and \"Fu'lah\" and possessor of Alif.\n491. From before its end its counterpart extend ... like a Masdar with Hamza of connection begun.\n492. And the lacking of the counterpart possessor of shortening and extension ... by transmission, and shorten for necessity the extended.\n\nHow to Dualize the Shortened and Extended and Pluralize Them Correctly\n493. The end of a shortened you dualize lacking ... three or its origin is Ya flip it to Ya.\n494. Like the rigid implied and flip the Alif ... in other than this to Waw and \"Sahra'\" flip.\n495. With Waw and that which is like \"Haya\", \"Ilba\" take ... with Waw or Hamza and correct other than this.\n496. And the end of the shortened in the plural delete ... and the Fatha keep and with Ta and Alif.\n497. If pluralized then the Hamza flip and the Alif ... as you dualize it and the Ta of this Ta deleted.\n498. And the 'Ayn sound silent in a noun on ... three feminine and even if devoid.\n499. Follows Fa in its shape and silent ... following other than Fatha or open, it eases.\n500. And \"Dhirwah\", and \"Zubyah\" do not follow ... and other than what was presented is anomalous so hear.",
    "foot_note": "1. See: Sharh Al-Kafiyah Al-Shafiyah 4/1745 - 1746.\n2. He means by the Origin the Alfiyyah.",
    "book_id": "105",
    "new_page_number": 71
  },
  {
    "serial_number": "6606291",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 76,
    "volume_number": 1,
    "text": "The Broken Plural (Jam' Al-Taksir)\n501. For paucity: \"Af'ilah\", \"Af'ul\" then ... \"Fi'lah\", \"Af'al\" or the multitude aim.\n502. With it like the opposite of this for \"Fa'l\" a noun sound ... in 'Ayn and possessor of four a noun if clarifies.\n503. Like \"Al-'Anaq\" and \"Al-Dhira'\", \"Af'ul\" ... and possessor of three what has no this is made.\n504. \"Af'al\" and the dominant \"Fi'lan\" cited ... for \"Fu'al\" and for a noun of four male.\n505. \"Af'ilah\" if extended third and in ... \"Fa'al\" or \"Fi'al\" with doubling.\n506. Or defect take and for \"Fa'la Af'ali\" ... \"Fu'l\" and \"Fi'lah\" comes so transmit.\n507. For a noun quadraliteral sound in Lam increased extension ... of its third and not doubled when it appeared.\n508. With Alif \"Fu'ul\", make \"Fu'ula\" ... for \"Fu'lah\", \"Fu'la\" likewise make \"Fi'ala\".\n509. For \"Fi'lah\", and in like \"Ramin\": \"Fu'alah\" ... regular and \"Kamil\" and \"Kamalah\".\n510. And for \"Qatil\", \"Zamin\" and \"Mayyit\" ... and \"Halik\" and \"Ahmaq\": \"Fa'la\" establish.\n511. For \"Fu'l\" a noun sound in Lam \"Fi'alah\" ... and rare in \"Fa'l\", and \"Fu'u'al\" make.\n512. For \"Fa'il\" descriptive and with the Ta mention ... and like it \"Al-Fu'u'al\" in the masculine.\n513. And in defective (1) Lam they were rare and prevented ... \"Fa'l\" and \"Fa'lah\": \"Fi'al\" for them.\n514. And rare in what its 'Ayn or Fa is Ya ... and \"Fa'al\" for it \"Fi'al\" was excepted.\n515. Defective of Lam and doubled and this ... for \"Fu'l\" or \"Fa'alah\", \"Fi'l\" take.\n516. And for \"Fa'il\" description of \"Fa'il\" likewise ... \"Fa'lan\", \"Fu'lan\" and female of all this.\n517. And for \"Tawil\" and \"Fu'ul\" for \"Fa'il\" ... and \"Fa'l\" a noun absolute Fa and \"Fa'al\".",
    "foot_note": "1. In the manuscript \"Fu'al\", and perhaps the correct is what we established. See: Alfiyyah Ibn Malik p. 165 verse 807.",
    "book_id": "105",
    "new_page_number": 72
  },
  {
    "serial_number": "6606292",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 77,
    "volume_number": 1,
    "text": "518. \"Fi'lan\" for \"Al-Fu'al\" with \"Fu'l\", \"Fa'al\" ... defective of the 'Ayn and in other than it rare.\n519. \"Fu'lan\" for \"Al-Fa'l\" names \"Fa'il\" ... and \"Fa'al\" sound and for \"Al-Bakhil\".\n520. Take \"Fu'ala\" and \"Af'ila'\" in the defective ... Lam and doubled and other than that rare.\n521. \"Fawa'il\" for \"Faw'al\" and \"Fa'il\" ... and \"Fa'ila\" (1) and \"Ha'id\" and \"Kahil\".\n522. \"Fa'ilah\" and \"Sahil\" and anomalous in ... like \"Faris\" and for \"Fa'alah\" followed.\n523. \"Fa'a'il\" and its like even if deleted ... Ta and \"Fa'ali\" with \"Fa'ala\" was known.\n524. For like \"Sahra'\" and \"Adhara\" and select ... for like \"Kursiy\": \"Fa'aliyy\" you correct.\n525. And extra of the three other than what noted ... for it \"Fa'alil\" and its like and from.\n526. Possessor of five stripped of the seal delete ... or four resembling the possessor of increase fulfill.\n527. And extra in it delete if what came ... soft on the end and the Sin and Ta.\n528. From like \"Mustad'in\" remove and with remaining ... the Mim is better or likewise what preceded.\n529. From Hamza or Ya, Waw of \"Hayzabuna\" ... remove, \"Saranda\" in it they gave us choice.\n\nThe Diminutive (Al-Tasghir)\n530. Belittle a triliteral: \"Fu'ayl\", and that which ... exceeded: \"Fu'ay'il\", \"Fu'ay'il\" take.\n531. And what with it you reached for plural for this ... connect, and just before end increase Ya if.\n532. Deleted is some of the noun in these two and what ... differed what we said is scarce in them.\n533. From before Ta of femininity open following ... to the Ya and extension of that or \"Af'al\".\n534. And extension of \"Sakran\", and not deleted in ... this chapter Ta of female and extension of Alif.",
    "foot_note": "1. Shortening \"Fa'ila'\" is a necessity.",
    "book_id": "105",
    "new_page_number": 73
  },
  {
    "serial_number": "6606293",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 78,
    "volume_number": 1,
    "text": "535. And the labeling in dualization and the relation (Nasab) ... and the plural and the end of the compound.\n536. And from added increase of \"Fa'lan\" which ... from after four and possessor of shortening if.\n537. Increased over four delete if preceded ... by extension so it is with two faces worthy.\n538. And return to origin a second soft flipped ... from it and this for ultimate plural is mandatory.\n539. And anomalous \"A'yad\": \"'Uyayd\" and made ... the Alif the second extra or ignored.\n540. What its origin is Waw and return the deletion in ... like \"Shafah\" and \"Ma\" and with the origin suffice.\n541. Diminutive of truncation and with the Ta sealed ... feminine bare triliteral understood.\n542. And anomalous is leaving and appending of other than the ... three likewise diminutive of \"Alladhi\".\n\nThe Relation (Al-Nasab)\n543. In relation increase a stressed Ya broken ... what is before it and deletion of its like cited.\n544. And flag of femininity and the extension in ... \"Hubla\" and \"Malha\", \"Arta\" flip and delete.\n545. And remove the fifth from Ya and Alif ... and the fourth the Ya flip and the first if deleted.\n546. And the third flip necessarily so in \"Al-Fata\" ... say \"Fatawi\" and where flipping has come.\n547. Opening follows from \"Fa'il\" the 'Ayn opened ... and \"Fu'il\" and \"Fi'il\" and in the most correct.\n548. \"Marmiyy\" in \"Al-Marmi\" and said \"Marmawi\" ... and it is the example, and with \"Hayy\": \"Hayawi\".\n549. And flag of dualization the plural (1) cast away ... and Ya of \"Tayyib\" and \"Ta'iyy\" is anomalous.\n550. And \"Fa'aliyy\" in \"Fa'ilah\" and in ... \"Fu'aylah\" say \"Fu'ali\" and even if negated.\n551. Ta and defective the Lam and give it what is returned ... \"Tawilah\", \"Jalilah\" and Hamza of extension.",
    "foot_note": "1. i.e., and the plural.",
    "book_id": "105",
    "new_page_number": 74
  },
  {
    "serial_number": "6606294",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 79,
    "volume_number": 1,
    "text": "552. Here (1) and in dualization in a path ... and relate to two chests of a sentence and mixture.\n553. And to that which \"Ibn\" was added to and \"Ab\" ... or defined the first other than this related.\n554. To first if confusion is not feared and in ... this is a view I deposited in the Sufficient Explanation (2).\n555. And return inevitably deletion of Lam if returned ... in plural or dualization and permitted return.\n556. If not returned in them and the Ta delete ... from \"Bint\", \"Ukht\" and for its male select.\n557. Second of a biliteral with soft double ... and \"Shiyah\" force and open the 'Ayn you fulfill.\n558. And relate to plural so with singular satisfied ... if not become a proper noun like \"Al-Faradi\".\n559. From Ya dispense with \"Al-Fa'il\", \"Fa'al\", \"Fa'il\" ... in relation and other than passed transmitted.\n\nThe Pause (Al-Waqf)\n560. Tanween following Fatha make Alif ... in pause likewise \"Idhan\" and other than this delete.\n561. Like connection of the pronoun not in Fatha this ... in Ya of defective with Tanween if.\n562. Not erected is worthier its opposite possessor of \"Al\" and in ... like \"Muri\" the Ya return inevitably and fulfills.\n563. And other than it voweled silence and intent (Rum) ... its movement or smell (Ishmam) that which is joined.\n564. Or other than Hamza and defective stress ... after a voweled and for that which silenced.\n565. And permitted if voweled a movement transmitted ... and from other than the Hamzated Fatha whatever selected.\n566. And prevent it if lacked a counterpart of what passed ... possessor of Hamza, Ta of femininity of the noun Ha make.\n567. In pause if not following a silent valid ... in plural of correction and likeness what preferred.",
    "foot_note": "1. i.e., in relation.\n2. He means that he - Al-Suyuti - objected to Ibn Malik, and that is in Al-Suyuti's explanation on Alfiyyah Ibn Malik called Al-Bahjah Al-Mardiyyah, or Al-Nahjah Al-Mardiyyah. See: Al-Bahjah Al-Mardiyyah 499",
    "book_id": "105",
    "new_page_number": 75
  },
  {
    "serial_number": "6606295",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 80,
    "volume_number": 1,
    "text": "568. And pause with Ha of silence on a verb deleted ... its end in \"'Ih\", \"Ya'ih\" inevitably familiar.\n569. And \"Ma\" for interrogation dragged likewise ... and commit if dragged by the noun and anomalous (1).\n570. Its connection to possessor of building adhered ... voweled, and connection like pause belonged.\n\nThe Inclination (Al-Imala)\n571. The Alif the end from Ya or made ... Ya without anomaly or increased incline.\n572. And Alif following Ha of femininity with ... substitute of 'Ayn what like past for \"Yuba'\".\n573. And follower of Ya or by a particle separated ... or with Ha or before Kasra or followed.\n574. Follower of Kasra or silence this followed ... or with Ha, and the Ra and the elevated letter (2).\n575. For two apparent of Kasra and Ya restrained following ... an elevated letter and likewise if separated.\n576. By a particle or two particles or before if ... not broken or not silenced following this.\n577. And restrained restraint breaking of Ra and do not incline ... for a reason separated and restrained what separated.\n578. And for proportionality incline \"Talaha\" (3) ... not possessor of building other than \"Na\" and not \"Ha\".\n579. And the Fatha before breaking of Ra in an end ... incline and in like \"Rahmatin\" if you pause.\n\nThe Morphology (Al-Tasrif)\n580. Other than particles and similar morph ... and other than possessor of two if not deleted.\n581. End of a noun did not exceed five, and generalized ... possessor of increase seven, and open and break and join.\n582. Other than last possessor of three and silenced ... second, and neglect \"Fi'ula\" likewise reverse.",
    "foot_note": "1. Lightened from \"Shaddha\" for necessity.\n2. i.e., The letter of elevation (Isti'la').\n3. Refers to His saying: \"Wa al-Shamsi wa Duhaha * Wa al-Qamari idha Talaha\". Al-Shams 1-2.",
    "book_id": "105",
    "new_page_number": 76
  },
  {
    "serial_number": "6606296",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 81,
    "volume_number": 1,
    "text": "583. For four stripped the verb mention ... possessor of increase six and open join and break.\n584. Second of triliteral and increased \"Fu'ila\" ... for a noun stripped quadraliteral \"Fa'lala\".\n585. And \"Fi'lila\" and \"Fi'lala\" and \"Fu'lula\" ... and \"Fu'lala\", \"Fi'alla\", and that which ascended.\n586. \"Fu'allal\", \"Fa'lalil\", \"Fu'allil\" ... \"Fi'lall\", what differed this is interpreted.\n587. And the origin is a letter necessary and the other not ... in the weight guarantee \"Fa'ala\" originally accepting.\n588. And extra by wording weigh and repeat ... Lam if origin remained like \"Ja'far\".\n589. And extra like the origin weigh as originated ... and \"Simsim\" and \"Lamlama\" all originated.\n\nHamza of Connection (Hamz Al-Wasl)\n590. In the start increase for connection a Hamza preceding ... in the past and Masdar from it exceeding.\n591. Four and its command and command of possessor ... of three and in \"Ism\", \"Ist\" followed.\n592. And \"Ibn\", \"Ibnum\", \"Ithnayn\" with \"Imri'in\" and in ... their femininity and \"Aymun\" transmission followed.\n593. And \"Al\" and in interrogation substitute extension or ... ease \"Al\" a noun \"Aymu\", \"Im\", Amu\" they told.\n\nThe Substitution (Al-Ibdal)\n594. Letters of substitution \"Hada'ta Mutiyan\" ... so substitute the Hamza from Waw and Ya.\n595. Finally following Alif increased and this ... in \"Fa'il\" of defective 'Ayn and take.\n596. Increased like \"Al-'Aja'iz\", \"Al-Saha'if\" ... and second of two softs with like \"Al-Nayayif\".\n597. And Hamza of this open and return Ya in defective ... Lam and Waw in \"Harawa\" (1) for heaviness.\n598. And Hamza substitute first of two Waws in ... start except \"Wufiya\" and extension followed.",
    "foot_note": "1. In the manuscript \"Haway\" and perhaps the correct is what we established. See: Al-Alfiyyah p. 181 verse 947.",
    "book_id": "105",
    "new_page_number": 77
  },
  {
    "serial_number": "6606297",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 82,
    "volume_number": 1,
    "text": "599. From second of two Hamzas in a word silenced ... if opened following joining or opening take.\n600. And Waw following breaking Ya and if broken ... then the Ya absolutely and if joining become.\n601. Waw like from \"Amma\", \"A'ummu\" and regular ... triplication of Fa not what finally occurred.\n602. Then the Ya absolutely and correct or flipped ... like \"A'umm\" and Alif Ya turns.\n603. Following Kasra and Ya of diminutive this ... in the Waw finally and before Ta take.\n604. And in \"Shajiyyah\" and \"Ghazyan\" and in ... like \"Siyam\" and \"Thiyab\" this followed.\n605. And \"Al-Mu'tayani Yurdayani fi Al-Hiyal\" ... this they preferred or corrected in like \"Al-Hiwal\".\n606. And \"Kiwazah\" and the Alif flip after joining ... and the Waw this for Ya with \"Muqin\" more general.\n607. Like the Ya Lam of a verb or from before Ta ... or in like \"Sab'uan\" and those which.\n608. In plural of \"Abyad\" keep and \"Al-Ghurr\" break ... in 'Ayn of \"Fu'la\" the description two faces mention.\n609. In Lam of \"Fa'la\" the noun this flipping dominated ... and Lam of \"Fu'la\" the description conversely flipped.\n610. And the silent preceding from connected ... Waw and Ya without accident flip i.e.\n611. The Waw Ya and assimilate and substitute Alif ... from Ya or Waw for opening followed.\n612. If voweled and voweled that which followed ... and correct if silenced except the Lam then no.\n613. As long as not its follower Ya stressed ... or Alif and correct past \"Aghyada\".\n614. And its origin and the Waw 'Ayn for \"Ifta'al\" ... meaning of \"Tafa'ul\" indicated not defected.\n615. Second defected if for two letters deserved ... this and 'Ayn of what its end attached.\n616. What specified the noun correct, and the Nun possessor ... of silence Mim before Ya flip like \"Inbidha\".\n617. From 'Ayn of verb not wonder and not ... doubled and like \"Ahwa\" so transmit.\n618. Its vowel to silent sound and from ... a noun like a verb with labeling noted.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 78
  },
  {
    "serial_number": "6606298",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 83,
    "volume_number": 1,
    "text": "619. And \"Al-Mif'al\", \"Al-Mif'al\" (1) correct and Alif ... \"If'al\", \"Al-Istif'al\" for transmission deleted.\n620. Like Waw of \"Maf'ul\" and may be corrected ... possessor of Ya and in possessor of Waw this does not preponderate.\n621. And they improved correction of Maf'ul \"Ada\" ... likewise \"Fu'ul\" its Lam Waw appeared.\n622. Fa for \"Ifti'al\" of soft Ta substitute and anomalous ... in the Hamza and the Ta in Ifti'al \"Tattakhidh\".\n623. Ta following a closing (Mutbaq) and this not in \"Izdadi\" ... and \"Iddakiri\", \"Iddana\" and in \"Ya'id\", \"'Idi\".\n624. And \"'Idah\" deleted Fa and the Hamza from ... \"Af'ala\" and the two descriptions with deletion worthy.\n625. And in present tense, and \"Zaltu Ziltu\" in ... \"Zaliltu\" say and \"Qirna\" in \"Iqrirna\" followed.\n\nThe Assimilation (Al-Idgham)\n626. First of two likes voweled in ... a word assimilate not \"Dadan\" and \"Sufafi\".\n627. And \"Dhulul\" and \"Labab\" and \"Kilal\" ... and \"Jussas\", \"Haylala\" and the breaking transmit.\n628. And \"Hayiya\" break and assimilate with \"Istatar\" ... and \"Tatajalla\" and with Ta this settled.\n629. And break when silenced before pronoun of ... raising and in jussive and similar choose.\n630. And break \"Af'il\" the wonder ... opposite \"Halumm\", and completed the Wafiyyah.\n631. So I praise Allah praying upon ... Muhammad and his family and who followed.\n632. I organized it in about two thirds of its original ... and you will not see a summary like it.\n633. I sealed it at the back of the sea of Qalzam (Red Sea) ... traveling to the Forbidden Land (Mecca).\n634. And in Rabi' appeared the flower of its organization ... and in Jumada diffused the musk of its seal.\n635. From the year nine and sixty which ... after eight hundred of the Hijra.",
    "foot_note": "1. In the manuscript \"Wa al-Fa'al\" and perhaps the correct is what we established. See: Al-Alfiyyah p. 185 verse 979.",
    "book_id": "105",
    "new_page_number": 79
  },
  {
    "serial_number": "6606299",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 84,
    "volume_number": 1,
    "text": "And Muhammad bin Ali Al-Dawudi wrote in two sessions, the last of them on Saturday the sixth of Jumada Al-Ula of the year three and nine hundred, concluded with goodness.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 80
  },
  {
    "serial_number": "6606300",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 85,
    "volume_number": 1,
    "text": "Sources and References\n1. Asrar Al-Arabiyyah, Abd al-Rahman bin Muhammad bin Ubaid Allah al-Ansari, Abu al-Barakat, Kamal al-Din al-Anbari 577 AH, Dar Al-Arqam bin Abi Al-Arqam, First Edition 1420 AH - 1999 AD.\n2. Al-Ashbah wa Al-Naza'ir fi Al-Nahw, Abd al-Rahman bin Abi Bakr, Jalal al-Din al-Suyuti 911 AH, Abd al-Ilah Nabhan - Ghazi Mukhtar Talimat - Ibrahim Muhammad Abdullah - Ahmad Mukhtar al-Sharif, Academy of the Arabic Language in Damascus, Publication Year 1407 AH - 1987 AD.\n3. Al-Asma'iyyat, Al-Asma'i Abu Sa'id Abd al-Malik bin Qurayb bin Ali bin Asma' 216 AH, Ahmad Muhammad Shakir - Abd al-Salam Muhammad Harun, Dar Al-Ma'arif - Egypt, Seventh Edition, 1993 AD.\n4. Al-Usul fi Al-Nahw, Abu Bakr Muhammad bin al-Sari bin Sahl al-Nahwi known as Ibn al-Sarraj 316 AH, Abd al-Hussein al-Fatli, Mu'assasat al-Risalah, Lebanon - Beirut.\n5. Al-Addad, Abu Bakr, Muhammad bin al-Qasim bin Muhammad bin Bashar bin al-Hasan bin Bayan bin Sama'ah bin Farwah bin Qatan bin Du'amah al-Anbari 328 AH, Muhammad Abu al-Fadl Ibrahim, Al-Maktabah Al-Asriyyah, Beirut - Lebanon, Publication Year 1407 AH - 1987 AD.\n6. I'rab Al-Qur'an, Abu Ja'far Al-Nahhas Ahmad bin Muhammad bin Ismail bin Yunus al-Muradi al-Nahwi 338 AH, Abd al-Mun'im Khalil Ibrahim, Publications of Muhammad Ali Baydun, Dar Al-Kutub Al-Ilmiyyah, Beirut, First Edition, 1421 AH.\n7. Akam Al-Marjan fi Ahkam Al-Jann, Muhammad bin Abdullah al-Shibli al-Dimashqi al-Hanafi, Abu Abdullah, Badr al-Din Ibn Taqi al-Din 769 AH, Ibrahim Muhammad al-Jamal, Maktabat Al-Qur'an - Egypt - Cairo.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 81
  },
  {
    "serial_number": "6606301",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 86,
    "volume_number": 1,
    "text": "8. Alfiyyah Ibn Malik, Muhammad bin Abdullah, Ibn Malik al-Ta'i al-Jayyani, Abu Abdullah, Jamal al-Din 672 AH, Abd al-Latif al-Khatib, Maktabat Dar Al-Urubah for Publishing and Distribution in Kuwait.\n9. Al-Umm, Al-Shafi'i Abu Abdullah Muhammad bin Idris bin al-Abbas bin Uthman bin Shafi' bin Abd al-Muttalib bin Abd Manaf al-Muttalibi al-Qurashi al-Makki 204 AH, Dar Al-Ma'rifah - Beirut, Edition without edition, Publication Year 1410 AH/1990 AD.\n10. Amali Ibn Al-Shajari, Diya' al-Din Abu al-Sa'adat Hibat Allah bin Ali bin Hamza, known as Ibn al-Shajari 542 AH, Dr. Mahmoud Muhammad al-Tanahi, Maktabat Al-Khanji, Cairo, First Edition, 1413 AH - 1991 AD.\n11. Al-Intisar li Sibawayh 'ala Al-Mubarrid, Abu al-Abbas, Ahmad bin Muhammad bin Wallad al-Tamimi al-Nahwi 332 AH, Dr. Zuhair Abd al-Muhsin Sultan, Mu'assasat al-Risalah, First Edition, 1416 AH - 1996 AD.\n12. Al-Insaf fi Masa'il Al-Khilaf bayna Al-Nahwiyyin Al-Basriyyin wa Al-Kufiyyin, Abd al-Rahman bin Muhammad bin Ubaid Allah al-Ansari, Abu al-Barakat, Kamal al-Din al-Anbari 577 AH, Al-Maktabah Al-Asriyyah, First Edition 1424 AH - 2003 AD.\n13. Awdah Al-Masalik ila Alfiyyah Ibn Malik, Abdullah bin Yusuf bin Ahmad bin Abdullah Ibn Yusuf, Abu Muhammad, Jamal al-Din, Ibn Hisham 761 AH, Yusuf al-Sheikh Muhammad al-Biqa'i, Dar Al-Fikr for Printing, Publishing and Distribution.\n14. Al-Idah Al-'Adudi, Abu Ali Al-Farisi 377 AH, Dr. Hasan Shadhli Farhud, First Edition, 1389 AH - 1969 AD.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 82
  },
  {
    "serial_number": "6606302",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 87,
    "volume_number": 1,
    "text": "15. Al-Bahr Al-Muhit fi Al-Tafsir, Abu Hayyan Muhammad bin Yusuf bin Ali bin Yusuf bin Hayyan Athir al-Din al-Andalusi 745 AH, Sidqi Muhammad Jamil, Dar Al-Fikr - Beirut, Edition 1420 AH.\n16. Bughyat Al-Wu'at fi Tabaqat Al-Lughawiyyin wa Al-Nuhat, Abd al-Rahman bin Abi Bakr, Jalal al-Din al-Suyuti 911 AH, Muhammad Abu al-Fadl Ibrahim, Al-Maktabah Al-Asriyyah - Lebanon / Sidon.\n17. Al-Bahjah Al-Mardiyyah, Abd al-Rahman bin Abi Bakr, Jalal al-Din al-Suyuti 911 AH, Muhammad Salih bin Ahmad al-Gharsi, Dar Al-Salam, First Edition 2000 AD.\n18. Taj Al-Arus min Jawahir Al-Qamus, Muhammad bin Muhammad bin Abd al-Razzaq al-Husayni, Abu al-Fayd, nicknamed Murtada, Al-Zabidi 1205 AH, Group of Editors, Dar Al-Hidayah.\n19. Tarikh Ibn Al-Wardi, Umar bin Muzaffar bin Umar bin Muhammad Ibn Abi al-Fawaris, Abu Hafs, Zayn al-Din Ibn al-Wardi al-Ma'arri al-Kindi 749 AH, Dar Al-Kutub Al-Ilmiyyah - Lebanon / Beirut, First Edition, 1417 AH - 1996 AD.\n20. Tarikh Al-Islam wa Wafayat Al-Mashahir wa Al-A'lam, Shams al-Din Abu Abdullah Muhammad bin Ahmad bin Uthman bin Qaymaz al-Dhahabi 748 AH, Dr. Bashar Awwad Ma'ruf, Dar Al-Gharb Al-Islami, First Edition, 2003 AD.\n21. Al-Tibyan fi I'rab Al-Qur'an, Abu al-Baqa' Abdullah bin al-Hussein bin Abdullah al-Ukbari 616 AH, Ali Muhammad al-Bijawi, Isa al-Babi al-Halabi and Partners.\n22. Al-Tahadduth bi Ni'mat Allah, Abd al-Rahman bin Abi Bakr, Jalal al-Din al-Suyuti 911 AH, Elizabeth Mary Sartain, Al-Matba'ah Al-Arabiyyah Al-Hadithah.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 83
  },
  {
    "serial_number": "6606303",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 88,
    "volume_number": 1,
    "text": "23. Takhlis Al-Shawahid wa Talkhis Al-Fawa'id, Jamal al-Din Abu Muhammad Abdullah bin Yusuf bin Hisham al-Ansari 761 AH, Dr. Abbas Mustafa al-Salihi, Dar Al-Kitab Al-Arabi, First Edition, 1406 AH - 1986 AD.\n24. Al-Tadhyil wa Al-Takmil fi Sharh Kitab Al-Tashil, Abu Hayyan al-Andalusi 745 AH, Dr. Hasan Hindawi, Dar Al-Qalam - Damascus and Dar Kunuz Ishbilia, First Edition.\n25. Tashil Al-Fawa'id wa Takmil Al-Maqasid, Muhammad bin Abdullah, Ibn Malik al-Ta'i al-Jayyani, Abu Abdullah, Jamal al-Din 672 AH, Muhammad Kamil Barakat, Dar Al-Kitab Al-Arabi for Printing and Publishing, Publication Year 1387 AH - 1967 AD.\n26. Ta'liq Al-Fara'id 'ala Tashil Al-Fawa'id, Muhammad Badr al-Din bin Abi Bakr bin Umar al-Damamini 827 AH, Dr. Muhammad bin Abd al-Rahman bin Muhammad al-Mufadda, First Edition, 1403 AH - 1983 AD.\n27. Al-Ta'liqah 'ala Kitab Sibawayh, Al-Hasan bin Ahmad bin Abd al-Ghaffar al-Farisi Origin, Abu Ali 377 AH, Dr. Awad bin Hamad al-Quzi, First Edition, 1410 AH - 1990 AD.\n28. Al-Tamhid lima fi Al-Muwatta' min Al-Ma'ani wa Al-Asanid, Abu Umar Yusuf bin Abdullah bin Muhammad bin Abd al-Barr bin Asim al-Namari al-Qurtubi 463 AH, Mustafa bin Ahmad al-Alawi, Muhammad Abd al-Kabir al-Bakri, Ministry of General Endowments and Islamic Affairs - Morocco, Publication Year 1387 AH.\n29. Tawjih Al-Luma', Ahmad bin al-Hussein bin al-Khabbaz 639 AH, Prof. Dr. Fayez Zaki Muhammad Diab, Dar Al-Salam for Printing, Publishing, Distribution and Translation - Arab Republic of Egypt, Second Edition, 1428 AH - 2007 AD.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 84
  },
  {
    "serial_number": "6606304",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 89,
    "volume_number": 1,
    "text": "30. Al-Jami' Al-Sahih, Muhammad bin Ismail Abu Abdullah al-Bukhari al-Ju'fi, Dr. Mustafa Dib al-Bugha, Dar Ibn Kathir, Al-Yamamah - Beirut, Third Edition, 1407 - 1987.\n31. Al-Jana Al-Dani fi Huruf Al-Ma'ani, Abu Muhammad Badr al-Din Hasan bin Qasim bin Abdullah bin Ali al-Muradi al-Misri al-Maliki 749 AH, Dr. Fakhr al-Din Qabawah - Prof. Muhammad Nadim Fadil, Dar Al-Kutub Al-Ilmiyyah, Beirut - Lebanon, First Edition, 1413 AH - 1992 AD.\n32. Hashiyat Ibn Hamdun, Ibn Hamdun, Dar Ihya' Al-Kutub Al-Arabiyyah, 1955.\n33. Hashiyat Al-Khudari, Muhammad bin Mustafa bin Hasan al-Khudari al-Shafi'i 1287 AH, Turki Farhan al-Mustafa, Dar Al-Kutub Al-Ilmiyyah, Third Edition 2009 AD.\n34. Huruf Al-Ma'ani wa Al-Sifat, Abd al-Rahman bin Ishaq al-Baghdadi al-Nahawandi al-Zajjaji, Abu al-Qasim 337 AH, Ali Tawfiq al-Hamad, Mu'assasat al-Risalah - Beirut, First Edition, 1984 AD.\n35. Husn Al-Muhadarah fi Tarikh Misr wa Al-Qahirah, Abd al-Rahman bin Abi Bakr, Jalal al-Din al-Suyuti 911 AH, Muhammad Abu al-Fadl Ibrahim, Dar Ihya' Al-Kutub Al-Arabiyyah - Isa al-Babi al-Halabi and Partners - Egypt, First Edition 1387 AH - 1967.\n36. Khizanat Al-Adab wa Lubb Lubab Lisan Al-Arab, Abd al-Qadir bin Umar al-Baghdadi 1093 AH, Abd al-Salam Muhammad Harun, Maktabat Al-Khanji, Cairo, Fourth Edition, 1418 AH - 1997 AD.\n37. Al-Khasa'is, Abu al-Fath Uthman bin Jinni al-Mawsili 392 AH, Egyptian General Book Authority, Fourth Edition.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 85
  },
  {
    "serial_number": "6606305",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 90,
    "volume_number": 1,
    "text": "38. Al-Durr Al-Masun fi Ulum Al-Kitab Al-Maknun, Abu al-Abbas, Shihab al-Din, Ahmad bin Yusuf bin Abd al-Da'im known as Al-Samin al-Halabi 756 AH, Dr. Ahmad Muhammad al-Kharrat, Dar Al-Qalam, Damascus.\n39. Al-Zahir fi Ma'ani Kalimat Al-Nas, Muhammad bin al-Qasim bin Muhammad bin Bashar, Abu Bakr al-Anbari 328 AH, Dr. Hatim Salih al-Damin, Mu'assasat al-Risalah - Beirut, First Edition, 1412 AH - 1992.\n40. Sifr Al-Sa'adah wa Safir Al-Ifadah, Ali bin Muhammad bin Abd al-Samad al-Hamadani al-Misri al-Shafi'i, Abu al-Hasan, Alam al-Din al-Sakhawi 643 AH, Dr. Muhammad al-Dali, Preface by Dr. Shakir al-Fahham, Dar Sadir, Second Edition, 1415 AH - 1995 AD.\n41. Sharh Ibn Al-Nazim 'ala Alfiyyah Ibn Malik, Badr al-Din Muhammad Ibn Al-Imam Jamal al-Din Muhammad bin Malik 686 AH, Muhammad Basil Uyun al-Sud, Dar Al-Kutub Al-Ilmiyyah, First Edition, 1420 AH - 2000 AD.\n42. Sharh Ibn Jabir Al-Hawari, Abu Abdullah bin Ahmad bin Jabir al-Hawari al-Andalusi, Abd al-Hamid al-Sayyid Muhammad Abd al-Hamid, Al-Maktabah Al-Azhariyyah li Al-Turath.\n43. Sharh Ibn Aqil 'ala Alfiyyah Ibn Malik, Ibn Aqil, Abdullah bin Abd al-Rahman al-Aqili al-Hamadani al-Misri 769 AH, Muhammad Muhyi al-Din Abd al-Hamid, Dar Al-Turath - Cairo, Dar Misr for Printing, Sa'id Judah al-Sahhar and Partners, Twentieth Edition 1400 AH - 1980 AD.\n44. Sharh Abyat Sibawayh, Yusuf bin Abi Sa'id al-Hasan bin Abdullah bin al-Marzuban Abu Muhammad al-Sirafi 385 AH, Dr. Muhammad Ali al-Rih Hashim, Maktabat Al-Kulliyyat Al-Azhariyyah, Dar Al-Fikr for Printing, Publishing and Distribution, Cairo - Egypt, Publication Year 1394 AH - 1974 AD.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 86
  },
  {
    "serial_number": "6606306",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 91,
    "volume_number": 1,
    "text": "45. Sharh Al-Tashil named Tamhid Al-Qawa'id bi Sharh Tashil Al-Fawa'id, Muhammad bin Yusuf bin Ahmad, Muhibb al-Din al-Halabi then al-Misri, known as Nazir al-Jaysh 778 AH, Prof. Dr. Ali Muhammad Fakher and others, Dar Al-Salam for Printing, Publishing, Distribution and Translation, Cairo - Arab Republic of Egypt, First Edition, 1428 AH.\n46. Sharh Al-Tasrih 'ala Al-Tawdih or Al-Tasrih bi Madmun Al-Tawdih fi Al-Nahw, Khalid bin Abdullah bin Abi Bakr bin Muhammad al-Jarjawi al-Azhari, Zayn al-Din al-Misri 905 AH, Dar Al-Kutub Al-Ilmiyyah - Beirut - Lebanon, First Edition 1421 AH - 2000 AD.\n47. Sharh Al-Radi 'ala Al-Kafiyah li Ibn Al-Hajib, Radi al-Din Muhammad bin al-Hasan al-Istarabadhi al-Nahwi 686 AH, Prof. Dr. Yusuf Hasan Umar, Publication Date 1395 - 1975 AD, Garyounis University - Libya.\n48. Sharh Al-Kafiyah Al-Shafiyah, Muhammad bin Abdullah, Ibn Malik al-Ta'i al-Jayyani, Abu Abdullah, Jamal al-Din 672 AH, Abd al-Mun'im Ahmad Haridi, Umm Al-Qura University Center for Scientific Research and Revival of Islamic Heritage, College of Sharia and Islamic Studies Mecca, First Edition.\n49. Sharh Al-Muradi, Abu Muhammad Badr al-Din Hasan bin Qasim bin Abdullah bin Ali al-Muradi al-Misri al-Maliki 749 AH, Abd al-Rahman Ali Sulayman, Professor of Linguistics at Al-Azhar University, Dar Al-Fikr Al-Arabi, First Edition 1428 AH - 2008 AD.\n50. Sharh Al-Makudi 'ala Al-Alfiyyah, Abu Zayd Abd al-Rahman bin Ali bin Salih al-Makudi 807 AH, Dr. Abd al-Hamid Hindawi, Al-Maktabah Al-Asriyyah, Beirut - Lebanon, Publication Year 1425 AH - 2005.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 87
  },
  {
    "serial_number": "6606307",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 92,
    "volume_number": 1,
    "text": "51. Sharh Tashil Al-Fawa'id, Muhammad bin Abdullah, Ibn Malik al-Ta'i al-Jayyani, Abu Abdullah, Jamal al-Din 672 AH, Dr. Abd al-Rahman al-Sayyid, Dr. Muhammad Badawi al-Makhtun, Hajar for Printing, Publishing, Distribution and Advertising, First Edition (1410 AH - 1990 AD).\n52. Sharh Umdat Al-Hafiz wa 'Uddat Al-Lafiz, Muhammad bin Abdullah, Ibn Malik al-Ta'i al-Jayyani, Abu Abdullah, Jamal al-Din 672 AH, Adnan al-Duri, Al-Ani Press, 1977 AD.\n53. Sharh Kitab Sibawayh, Abu Sa'id al-Sirafi al-Hasan bin Abdullah bin al-Marzuban 368 AH, Ahmad Hasan Mahdali, Ali Sayyid Ali, Dar Al-Kutub Al-Ilmiyyah, Beirut - Lebanon, First Edition, 2008 AD.\n54. Sharh Mufassal Al-Zamakhshari, Ya'ish bin Ali bin Ya'ish Ibn Abi al-Saraya Muhammad bin Ali, Abu al-Baqa', Muwaffaq al-Din al-Asadi al-Mawsili, known as Ibn Ya'ish and Ibn al-Sani' 643 AH, Introduced by Dr. Emil Badi' Ya'qub, Dar Al-Kutub Al-Ilmiyyah, Beirut - Lebanon, First Edition, 1422 AH - 2001 AD.\n55. Shawahid Al-Tawdih wa Al-Tashih li Mushkilat Al-Jami' Al-Sahih, Muhammad bin Abdullah, Ibn Malik al-Ta'i al-Jayyani, Abu Abdullah, Jamal al-Din 672 AH, Dr. Taha Muhsin, Maktabat Ibn Taymiyyah, First Edition, 1405 AH.\n56. Sahih Muslim, Abu al-Hussein Muslim bin al-Hajjaj al-Qushayri al-Naysaburi 261 AH, Group of Editors, Dar Al-Jil - Beirut, Edition photocopied from the Turkish edition printed in Istanbul year 1334 AH.\n57. Tabaqat Al-Shafi'iyyah Al-Kubra, Taj al-Din Abd al-Wahhab bin Taqi al-Din al-Subki 771 AH, Dr. Mahmoud Muhammad al-Tanahi, Dr. Abd al-Fattah Muhammad al-Hulu, Hajar for Printing, Publishing and Distribution, Second Edition, 1413 AH.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 88
  },
  {
    "serial_number": "6606308",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 93,
    "volume_number": 1,
    "text": "58. Tabaqat Al-Shafi'iyyin, Abu al-Fida' Ismail bin Umar bin Kathir al-Qurashi al-Basri then al-Dimashqi 774 AH, Dr. Ahmad Umar Hashim, Dr. Muhammad Zaynhum Muhammad Azab, Maktabat Al-Thaqafah Al-Diniyyah, Publication Date 1413 AH - 1993 AD.\n59. 'Ilal Al-Nahw, Muhammad bin Abdullah bin al-Abbas, Abu al-Hasan, Ibn al-Warraq 381 AH, Mahmoud Jasim Muhammad al-Darwish, Maktabat Al-Rushd - Riyadh / Saudi Arabia, First Edition, 1420 AH - 1999 AD.\n60. Al-Fusul Al-Khamsun, Zayn al-Din Abu al-Hussein Yahya bin Abd al-Mu'ti al-Maghribi 628 AH, Mahmoud al-Tanahi, Isa al-Babi al-Halabi and Partners.\n61. Fahras Mu'allafat Al-Suyuti.\n62. Al-Fawa'id Al-Ajibah fi I'rab Al-Kalimat Al-Gharibah, Ibn Abidin, Muhammad Amin bin Umar bin Abd al-Aziz Abidin al-Dimashqi al-Hanafi 1252 AH, Dr. Hatim Salih al-Damin, Dar Al-Ra'id Al-Arabi - Beirut, First Edition, 1410 AH - 1990 AD.\n63. The Holy Qur'an.\n64. Al-Kamil fi Al-Lughah wa Al-Adab, Muhammad bin Yazid al-Mubarrid, Abu al-Abbas 285 AH, Muhammad Abu al-Fadl Ibrahim, Dar Al-Fikr Al-Arabi - Cairo, Third Edition 1417 AH - 1997 AD.\n65. Kitab Al-Shi'r or Sharh Al-Abyat Al-Mushkilat Al-I'rab, Al-Hasan bin Ahmad bin Abd al-Ghaffar al-Farisi Origin, Abu Ali 377 AH, Dr. Mahmoud Muhammad al-Tanahi, Maktabat Al-Khanji, Cairo - Egypt, First Edition, 1408 AH - 1988 AD.\n66. Al-Kitab, Amr bin Uthman bin Qanbar al-Harithi by loyalty, Abu Bishr, nicknamed Sibawayh 180 AH, Abd al-Salam Muhammad Harun, Maktabat Al-Khanji, Cairo, Third Edition, 1408 AH - 1988 AD.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 89
  },
  {
    "serial_number": "6606309",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 94,
    "volume_number": 1,
    "text": "67. Kashf Al-Zunun 'an Asami Al-Kutub wa Al-Funun, Mustafa bin Abdullah Katib Chalabi al-Qustantini known as Haji Khalifa or Al-Hajj Khalifa 1067 AH, Maktabat Al-Muthanna - Baghdad, Publication Date 1941 AD.\n68. Al-Lamat, Abd al-Rahman bin Ishaq al-Baghdadi al-Nahawandi al-Zajjaji, Abu al-Qasim 337 AH, Mazin al-Mubarak, Dar Al-Fikr - Damascus, Second Edition, 1405 AH 1985 AD.\n69. Al-Lamhah fi Sharh Al-Mulhah, Muhammad bin Hasan bin Siba' bin Abi Bakr al-Judhami, Abu Abdullah, Shams al-Din, known as Ibn al-Sa'igh 720 AH, Ibrahim bin Salim al-Sa'idi, Deanship of Scientific Research at the Islamic University, Medina, Kingdom of Saudi Arabia, First Edition, 1424 AH/2004 AD.\n70. Al-Mujalasah wa Jawahir Al-Ilm, Abu Bakr Ahmad bin Marwan al-Dinawari al-Maliki 333 AH, Abu Ubaydah Mashhur bin Hasan Al Salman, Islamic Education Society (Bahrain - Umm Al-Hassam), Dar Ibn Hazm (Beirut - Lebanon), Publication Date 1419 AH.\n71. Al-Muhkam wa Al-Muhit Al-A'zam, Abu al-Hasan Ali bin Ismail bin Sidah al-Mursi 458 AH, Abd al-Hamid Hindawi, Dar Al-Kutub Al-Ilmiyyah - Beirut, First Edition, 1421 AH - 2000 AD.\n72. Al-Murtajal fi Sharh Al-Jumal, Abu Muhammad Abdullah bin Ahmad bin Ahmad bin Ahmad Ibn al-Khashshab 567 AH, Ali Haydar, Damascus Edition, 1392 AH - 1972 AD.\n73. Al-Mizhar fi Ulum Al-Lughah wa Anwa'iha, Abd al-Rahman bin Abi Bakr, Jalal al-Din al-Suyuti 911 AH, Fu'ad Ali Mansur, Dar Al-Kutub Al-Ilmiyyah - Beirut, First Edition, 1418 AH 1998 AD.\n74. Al-Masa'il Al-Basriyyat, Abu Ali Al-Farisi 377 AH, Dr. Muhammad al-Shatir Ahmad Muhammad Ahmad, Al-Madani Press, First Edition, 1405 AH - 1985 AH.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 90
  },
  {
    "serial_number": "6606310",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 95,
    "volume_number": 1,
    "text": "75. Al-Masa'il Al-Halabiyyat, Abu Ali Al-Farisi 377 AH, Dr. Hasan Hindawi, Dar Al-Qalam for Printing, Publishing and Distribution, Damascus - Dar Al-Manarah for Printing, Publishing and Distribution, Beirut, First Edition, 1407 AH - 1987 AD.\n76. Al-Masa'il Al-Askariyyat, Al-Hasan bin Ahmad bin Abd al-Ghaffar al-Farisi Origin, Abu Ali 377 AH, Dr. Ali Jabir al-Mansuri, Al-Dar Al-Ilmiyyah Al-Dawliyyah for Publishing and Distribution and Dar Al-Thaqafah for Publishing and Distribution Amman - Jordan, Publication Year 2002 AD.\n77. Al-Masa'il Al-Mulaqqabat fi Al-Nahw, Ibn Tulun, Abd al-Fattah Salim, Maktabat Al-Adab, 1st Ed, 2007 AD.\n78. Al-Mustadrak 'ala Al-Sahihayn, Abu Abdullah Al-Hakim Muhammad bin Abdullah bin Muhammad bin Hamdawayh bin Nu'aym bin al-Hakam al-Dabbi al-Tahmani al-Naysaburi known as Ibn al-Bay' 405 AH, Mustafa Abd al-Qadir Ata, Dar Al-Kutub Al-Ilmiyyah - Beirut, First Edition, 1411 - 1990.\n79. Ma'ani Al-Qur'an by Al-Akhfash, Abu al-Hasan al-Mujasha'i by loyalty, al-Balkhi then al-Basri, known as Al-Akhfash Al-Awsat 215 AH, Dr. Huda Mahmoud Qara'ah, Maktabat Al-Khanji, Cairo, First Edition, 1411 AH - 1990 AD.\n80. Ma'ani Al-Qur'an wa I'rabuhu, Ibrahim bin al-Sari bin Sahl, Abu Ishaq al-Zajjaj 311 AH, Abd al-Jalil Abduh Shalabi, Alam Al-Kutub - Beirut, First Edition 1408 AH - 1988 AD.\n81. Ma'ani Al-Qur'an, Abu Zakariya Yahya bin Ziyad bin Abdullah bin Manzur al-Daylami al-Farra 207 AH, Ahmad Yusuf al-Najati / Muhammad Ali al-Najjar / Abd al-Fattah Ismail al-Shalabi, Dar Al-Misriyyah for Authorship and Translation - Egypt, First Edition.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 91
  },
  {
    "serial_number": "6606311",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 96,
    "volume_number": 1,
    "text": "82. Mughni Al-Labib 'an Kutub Al-A'arib, Abdullah bin Yusuf bin Ahmad bin Abdullah Ibn Yusuf, Abu Muhammad, Jamal al-Din, Ibn Hisham 761 AH, Dr. Mazin al-Mubarak / Muhammad Ali Hamdallah, Dar Al-Fikr - Damascus, Sixth Edition, 1985.\n83. Al-Mufassal fi San'at Al-I'rab, Abu al-Qasim Mahmoud bin Amr bin Ahmad, Al-Zamakhshari Jar Allah 538 AH, Dr. Ali Bu Mulhim, Maktabat Al-Hilal - Beirut, First Edition, 1993.\n84. Al-Maqasid Al-Shafiyah fi Sharh Al-Khulasah Al-Kafiyah (Sharh Alfiyyah Ibn Malik), Abu Ishaq Ibrahim bin Musa al-Shatibi 790 AH, Dr. Abd al-Rahman bin Sulayman al-Uthaymin and others, Institute of Scientific Research and Revival of Islamic Heritage at Umm Al-Qura University - Mecca, First Edition, 1428 AH - 2007 AD.\n85. Al-Maqasid Al-Nahwiyyah fi Sharh Shawahid Shuruh Al-Alfiyyah known as Sharh Al-Shawahid Al-Kubra, Badr al-Din Mahmoud bin Ahmad bin Musa al-Ayni 855 AH, Prof. Dr. Ali Muhammad Fakher, Prof. Dr. Ahmad Muhammad Tawfiq al-Sudani, Dr. Abd al-Aziz Muhammad Fakher, Dar Al-Salam for Printing, Publishing, Distribution and Translation, Cairo - Arab Republic of Egypt, First Edition, 1431 AH - 2010 AD.\n86. Al-Muqtadab, Muhammad bin Yazid bin Abd al-Akbar al-Thumali al-Azdi, Abu al-Abbas, known as Al-Mubarrid 285 AH, Muhammad Abd al-Khaliq Azimah., Alam Al-Kutub. - Beirut.\n87. Al-Muqaddimah Al-Jazuliyyah fi Al-Nahw, Isa bin Abd al-Aziz bin Yalalbakht al-Jazuli al-Barbari al-Marrakushi, Abu Musa 607 AH, Dr. Sha'ban Abd al-Wahhab Muhammad, Reviewed by Dr. Hamid Ahmad Nil - Dr. Fathi Muhammad Ahmad Jumu'ah, Printed and Published by Umm Al-Qura Press.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 92
  },
  {
    "serial_number": "6606312",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Al-Wafiyyah bi-Ikhtisar Al-Alfiyyah (Summary of Ibn Malik's Alfiyyah)",
    "edition": "First, 2019 AD - 1440 AH",
    "publisher": "‘Ilm’ Foundation for Heritage Revival and Digital Services",
    "page_number": 97,
    "volume_number": 1,
    "text": "88. Nata'ij Al-Fikr fi Al-Nahw, Abu al-Qasim Abd al-Rahman bin Abdullah bin Ahmad al-Suhayli 581 AH, Dar Al-Kutub Al-Ilmiyyah - Beirut, First Edition 1412 - 1992 AD.\n89. Nashr Fayd Al-Inshirah, Abu Abdullah Muhammad bin al-Tayyib al-Fasi 1170 AH, Mahmoud Fajjal, Dar Al-Buhuth Al-Islamiyyah wa Ihya' Al-Turath, Second Edition 2002 AD.\n90. Nazm Al-Fawa'id Muhammad bin Abdullah, Ibn Malik al-Ta'i al-Jayyani, Abu Abdullah, Jamal al-Din 672 AH, Sulayman al-Ayid, Journal of Umm Al-Qura University, First Year Second Issue, 1409 AH.\n91. Nafh Al-Tib min Ghusn Al-Andalus Al-Ratib, wa Dhikr Waziriha Lisan al-Din bin al-Khatib, Shihab al-Din Ahmad bin Muhammad al-Maqqari al-Tilmisani 1041 AH, Ihsan Abbas, Dar Sadir - Beirut - Lebanon.\n92. Ham' Al-Hawami' fi Sharh Jam' Al-Jawami', Abd al-Rahman bin Abi Bakr, Jalal al-Din al-Suyuti 911 AH, Abd al-Hamid Hindawi, Al-Maktabah Al-Tawfiqiyyah - Egypt.\n93. Hawatif Al-Jinan, Abu Bakr Muhammad bin Ja'far bin Muhammad bin Sahl bin Shakir al-Khara'iti 327 AH, Ibrahim Salih, Dar Al-Basha'ir for Printing, Publishing and Distribution, First Edition, 1421 AH - 2001 AD.\n94. Al-Wafi bi Al-Wafayat, Salah al-Din Khalil bin Aybak bin Abdullah al-Safadi 764 AH, Ahmad al-Arna'ut and Turki Mustafa, Dar Ihya' Al-Turath - Beirut 1420 AH - 2000 AD.",
    "foot_note": "None",
    "book_id": "105",
    "new_page_number": 93
  }
]