[
  {
    "text": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him\nAuthor: نوال بنت عبد العزيز العيد\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 1
  },
  {
    "text": "sn: 8264\nbook_title: موقف المسلم من الفتن في ضوء حديث عبد الله بن عمرو - رضي الله عنه -\nbook_link: https://shamela.ws/book/1073\nbook_id: 1073\nauthor_name: نوال بنت عبد العزيز العيد\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/195\nauthor_ID: 195\neditor: Null\npublisher: دار الحضارة للنشر والتوزيع\nedition: الأولى، 1434 هـ - 2013 م\npages: 82\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: كتب عامة\ncategory_id: 39",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 2
  },
  {
    "serial_number": "7544606",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: General Books. Book: The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him - Author: Nawal bint Abdul Aziz Al-Eid. Publisher: Dar Al-Hadara for Publishing and Distribution. Edition: First, 1434 AH - 2013 AD. Number of Pages: 82 [Book pagination matches the print]. Publishing Date in Shamela: 27 Rabi' al-Awwal 1444.\nBook: The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him - Author: Nawal bint Abdul Aziz Al-Eid. Publisher: Dar Al-Hadara for Publishing and Distribution. Edition: First, 1434 AH - 2013 AD. Number of Pages: 82 [Book pagination matches the print]. Publishing Date in Shamela: 27 Rabi' al-Awwal 1444.\nAuthor: Nawal bint Abdul Aziz Al-Eid. Publisher: Dar Al-Hadara for Publishing and Distribution. Edition: First, 1434 AH - 2013 AD. Number of Pages: 82 [Book pagination matches the print]. Publishing Date in Shamela: 27 Rabi' al-Awwal 1444.\n[Book pagination matches the print]. Publishing Date in Shamela: 27 Rabi' al-Awwal 1444.\nPublishing Date in Shamela: 27 Rabi' al-Awwal 1444",
    "foot_note": "None",
    "book_id": "1073",
    "new_page_number": 3
  },
  {
    "serial_number": "7544607",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 5,
    "volume_number": 1,
    "text": "Introduction\nPraise be to Allah who favored this nation over all other nations, sent down to it the best of books, and sent to it the best of messengers. Peace and blessings be upon the Trustworthy Prophet, who left no good but guided his nation to it, and left no evil but warned his nation against it; may Allah's peace and blessings be upon him, his family, and his companions abundantly.\nTo proceed:\nWhoever contemplates the conditions of the time will witness clearly the news of the Messenger of Allah, peace and blessings be upon him, regarding what is happening and what will happen of changes on all levels and fields: legislative, economic, social, security, cosmic, and others. Because the most precious thing to preserve and the most valuable thing to care for is the servant's religion, by which is his salvation and success in this world and the Hereafter, the legislative texts came to clarify the danger of tribulations (Fitnahs) and the stance of the Muslim towards them. For if he does not observe their state, nor look at their results, and the legislative stance in dealing with them is not clarified to him, his religion becomes vulnerable to dangers, and he becomes a victim of doubts (Shubuhat) and desires (Shahawat). The tribulations transform from small private tribulations targeting individuals to large general ones targeting societies. It was not fitting for the Messenger of Allah, peace and blessings be upon him—given the situation—to leave his followers without",
    "foot_note": "None",
    "book_id": "1073",
    "new_page_number": 4
  },
  {
    "serial_number": "7544608",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 6,
    "volume_number": 1,
    "text": "preparing their souls for what they will face and how they will deal with it, so that they may walk upon light and insight protecting them from misguidance, deviation, confusion, and doubt. Thus, they stand firm while people fall, understand while people are ignorant, and refrain while those who plunge in plunge in. So their actions and words come built upon knowledge received by the Messenger of Allah, peace and blessings be upon him, from his Lord, not from a deficient mind, or a followed desire, or ignorance that destroys its owner.\nTherefore, the predecessors (Salaf) of the nation were keen to collect the Hadiths of tribulations, seek their explanation, and understand them. They dedicated special chapters for them in their books. Indeed, one of the earliest chapters singled out for classification by Hadith scholars is the 'Chapter of Tribulations' (Bab Al-Fitan), in which Nu'aym bin Hammad Al-Khuza'i (d. 228 AH) authored a book that has been printed. (Then the successful ones of their followers walked in their footsteps, standing with the proof and evidence, walking with the truth wherever its mounts went, and settling with correctness wherever its tents were pitched. If the evidence appeared to them, they flew to it in groups and singly. And if the Messenger, peace and blessings be upon him, called them to a matter, they hastened to it, not asking him for proof of what he said. His texts are more majestic in their chests and greater in their souls than to prioritize over them the saying of anyone among people or to oppose them with opinion or analogy) (1).",
    "foot_note": "1. I'lam al-Muwaqqi'in (6 - 7).",
    "book_id": "1073",
    "new_page_number": 5
  },
  {
    "serial_number": "7544609",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 7,
    "volume_number": 1,
    "text": "We, in this time—the time of tribulations of various colors—are in need of contemplating the verses and Hadiths reported regarding tribulations, taking lessons, admonitions, and rulings, and emerging with the understanding of what should be done during tribulations in the light of the Book of Allah and the authentic Sunnah of His Messenger, peace and blessings be upon him, according to the understanding of the righteous predecessors. Among the Hadiths that contained important rules regarding the Muslim's stance towards tribulation is the Hadith narrated by the noble companion Abdullah bin Amr bin Al-Aas, may Allah be pleased with him, in which the Messenger said to him: 'Stick to your house, control your tongue, and take what...' In light of the foregoing, I wanted to contribute my share to this topic in addition to the following reasons:\n1. The people's dire need in such times to present the topic of tribulations and clarify the ways of salvation from them.\n2. The confusion of people's stances during tribulations due to their lack of knowledge and ignorance.\n3. Audacity against constants and indisputable matters, and delving into the religion of Allah without knowledge and by unqualified people.\n4. Many people plunging into great matters that are slippery slopes for understanding, from which a Muslim should refrain.",
    "foot_note": "None",
    "book_id": "1073",
    "new_page_number": 6
  },
  {
    "serial_number": "7544610",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 8,
    "volume_number": 1,
    "text": "5. Serving the Hadiths of the Messenger of Allah, peace and blessings be upon him, in terms of narration (Riwayah) and comprehension (Dirayah).\n6. The inclusion of the Hadith of Abdullah bin Amr of comprehensive directives and important rules that a Muslim cannot do without when tribulations occur.\n7. Clarifying the stance of Ahlus-Sunnah wal-Jama'ah towards tribulations, their Hadiths, and their events.\n8. The dire need for such contemporary topics that are alive in the arena today, to guide the Muslim to guidance, equip him with goodness and piety, illuminate the path for him, and save him from every deep pitfall.\n\nResearch Topics:\nI divided the research into an introduction, a preface, three chapters, and a conclusion.\nIntroduction: Includes: The importance of the research, and the research plan.\nPreface: Contains the definition of tribulations (Fitnahs).\nChapter One: Types of Tribulations.\nChapter Two: Takhrij (Authentication) of the Hadith of Abdullah bin Amr, and the study of its chain of narration.",
    "foot_note": "None",
    "book_id": "1073",
    "new_page_number": 7
  },
  {
    "serial_number": "7544611",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 9,
    "volume_number": 1,
    "text": "Chapter Three: Contains three sections:\nSection One: 'Stick to your house.'\nSection Two: 'Control your tongue.'\nSection Three: 'Leave the affair of the general public, and take care of your own self specifically.'\nConclusion: Contains the most important results and recommendations.",
    "foot_note": "None",
    "book_id": "1073",
    "new_page_number": 8
  },
  {
    "serial_number": "7544612",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 11,
    "volume_number": 1,
    "text": "Preface\nContains the definition of tribulations (Fitnahs) and an explanation of their usages:\n\nDefinition of Tribulations (Al-Fitan):\nLinguistically: Al-Fitan is the plural of Fitnah. Ibn Faris said: 'The Fa, Ta, and Nun are a sound root indicating trial and testing' (1). Its origin is taken from your saying: 'I tested (Fatantu) silver and gold,' if you melted them with fire to distinguish the bad from the good (2). Al-Khalil said: Al-Fatn is burning. It is said: Waraq Fatin, meaning burnt silver. And the Harrah (volcanic rocky terrain) is called Fatin, as if its stones are burnt (3). From it is His saying, Exalted is He: {Indeed, those who have tortured (Fatanu) the believing men and believing women} (4), meaning burned them with fire (5). And 'Iftatana' the man, and 'Futina' so he is 'Maftun' (tested/tempted), if a Fitnah befalls him and his wealth or intellect goes away (6). Fitnah is also your admiration for something.",
    "foot_note": "1. Maqayis Al-Lughah, by Ibn Faris (4/ 472), entry (Fatana).\n2. Lisan Al-Arab, by Ibn Manzur (6/ 3344) entry (Fatana).\n3. Al-Sihah, by Al-Jawhari (2175) entry (Fatana).\n4. Surah Al-Buruj: 10.\n5. Lisan Al-Arab, by Ibn Manzur (6/ 3344) entry (Fatana).\n6. Al-Qamus Al-Muhit, by Al-Fairuzabadi (1575) entry (Fatana).",
    "book_id": "1073",
    "new_page_number": 9
  },
  {
    "serial_number": "7544613",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 12,
    "volume_number": 1,
    "text": "Fitnah also means misguidance and sin, and the 'Fatin' is the one who misleads from the truth (1). The 'Fattan' is Satan (2). It came in the Hadith: 'A Muslim is the brother of a Muslim; water and trees accommodate them both, and they cooperate against the Fattan (tempter/Satan)' (3). It is said 'Fatana' the man, meaning he deviated from what he was upon (4). From it is His saying: {And indeed, they were about to tempt (Yaftinunaka) you away from that which We revealed to you} (5). Fitnah is also the fighting that occurs between people (6). From that is the saying of the Prophet, peace and blessings be upon him: 'I see tribulations (Fitan) falling amongst your houses' (7). Fitnah also means killing, and from it is His saying, Exalted is He: {If you fear that those who disbelieve may disrupt [or attack] (Yaftinakum) you} (8).\nTerminologically: The meaning of Fitnah originally is testing and trial. Then",
    "foot_note": "1. Lisan Al-Arab, by Ibn Manzur (6/ 3345) entry (Fatana).\n2. Al-Sihah, by Al-Jawhari (2175) entry (Fatana).\n3. Narrated by Abu Dawud in his Sunan, Book of Kharaj and Leadership, Chapter on Cutting off Lands (3070), (3/ 451), and Al-Albani weakened it in Da'if Sunan Abi Dawud (309).\n4. Lisan Al-Arab, by Ibn Manzur (6/ 3345) entry (Fatana).\n5. Surah Al-Isra: 73.\n6. Lisan Al-Arab, by Ibn Manzur (6/ 3345) entry (Fatana).\n7. Narrated by Muslim in Al-Sahih, Book of Tribulations, Chapter on the Descent of Tribulations like the Falling of Rain, (2885), (18/ 224).\n8. Surah An-Nisa: 101.",
    "book_id": "1073",
    "new_page_number": 10
  },
  {
    "serial_number": "7544614",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 13,
    "volume_number": 1,
    "text": "it was used for every matter where testing reveals evil, and for what the trial and testing lead to of hateful things. Then it was applied to every hateful thing or what leads to it, such as disbelief, sin, burning, scandal, immorality, and fighting out of ignorance seeking the worldly life or following desire, and other than that (1). Imam Ahmad said: 'Fitnah is when there is no Imam to manage the people's affairs' (2). Al-Zamakhshari defined it saying: 'Fitnah: Trial by severe obligations such as separation from homelands, striving against enemies and other difficult acts of obedience, abandoning desires and pleasures through poverty and drought, various calamities in lives and wealth, and enduring the harm, plotting, and injury of disbelievers' (3). The summary of these definitions: Fitnah is: What distinguishes the state of people regarding good or evil, whether the distinction is by gifts and blessings or by calamities and afflictions.\n\nThe Relationship between the Linguistic Meaning and the Legal Terminology of Fitnah:\nThe relationship between the linguistic and legal meaning of Fitnah lies in the fact that",
    "foot_note": "1. Fath Al-Bari, by Ibn Hajar (13/ 34).\n2. Al-Masa'il wa Al-Rasa'il reported from Imam Ahmad in Creed by Al-Ahmadi (2/ 12).\n3. Al-Kashshaf (3/ 182).",
    "book_id": "1073",
    "new_page_number": 11
  },
  {
    "serial_number": "7544615",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 14,
    "volume_number": 1,
    "text": "Fitnah reveals the truthful believer from the pretender, and indicates the bad intention of the one in whose heart faith has not settled. It expels corruption (daghl) from the hearts of believers, so they emerge after the affliction with pure hearts and believing souls, just as happens when gold or silver is put into the fire, so the impurity goes away and the good remains (1). And Allah knows best.",
    "foot_note": "1. The previous reference (38).",
    "book_id": "1073",
    "new_page_number": 12
  },
  {
    "serial_number": "7544616",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim’s Stance on Tribulations in Light of the Hadith of Abdullah ibn Amr (RA)",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 15,
    "volume_number": 1,
    "text": "Chapter One: Types of Tribulations\n\n*Tribulations by type:* Tribulations are divided into two types: the tribulation of doubts (intellectual confusion), and the tribulation of desires.\n\nA. The Tribulation of Doubts: This is the most severe type and concerns the minds and hearts, such as doubts in religion, falling into polytheism or innovations, and similar matters.\n\n**Cause:** It arises from weak insight and lack of knowledge, especially when accompanied by corruption of intention and the dominance of desires. Even if the error seems small, one with misguided intentions, ruled by desire rather than guidance, and with weak insight and little knowledge, falls into it. They are among those about whom Allah, the Exalted, says: {They follow nothing but assumption and what their souls desire.} [An-Najm: 23]\n\nAllah also warns that following desire leads astray from His path: {O Dawud, indeed We made you a successor upon the earth, so judge between the people in truth and do not follow desire, lest it mislead you from the way of Allah. Indeed, those who go astray from the way of Allah — for them is severe punishment for forgetting the Day of Account.} [Sad: 29]\n\n**Danger:** Its danger lies in that the ultimate outcome for its bearer is disbelief and hypocrisy. It is the tribulation of the hypocrites and innovators, according to the levels of their innovations, where confusion arises.",
    "foot_note": "1. Surah An-Najm: 23.\n2. Surah Sad: 29.",
    "book_id": "1073",
    "new_page_number": 13
  },
  {
    "serial_number": "7544617",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 16,
    "volume_number": 1,
    "text": "astray from the way of Allah will have a severe punishment for having forgotten the Day of Account} (2). Its Danger: Its danger lies in the fact that its outcome leads its owner to disbelief and hypocrisy. It is the Fitnah of the hypocrites and the people of innovation according to the levels of their innovations, where truth was confused with falsehood and guidance with misguidance for them, and refuge is sought with Allah.\nSalvation from it: Is by stripping oneself to follow the Messenger, peace and blessings be upon him, and judging by his Sunnah, and that is by learning it. For all guidance revolves around his sayings and actions, and whatever deviates from them is misguidance. If the heart resolves on that and turns away from everything else, weighing it by what the Messenger, peace and blessings be upon him, brought—if it agrees, he accepts it, and if it disagrees, he rejects it, regardless of who said it—then this is the one who is saved from the Fitnah of doubts. If he misses any of that, he is afflicted by its Fitnah according to what he missed of it. Al-Miqdam bin Ma'di Karib narrates: 'The Messenger of Allah, peace and blessings be upon him, forbade things on the day of Khaybar, then he said: It is imminent that one of you will belie me while reclining on his couch; a Hadith of mine is narrated to him, and he says: Between us and you is the Book of Allah. What we find lawful in it, we treat as lawful, and what we find unlawful in it, we treat as unlawful. Verily, what the Messenger of Allah forbade is like what Allah forbade' (1). Abu Rafi' and others narrated in a Marfu' narration: 'Let me not find one of you reclining on",
    "foot_note": "1. Reported by Ahmad (4/ 1322) 17233, Al-Darimi (1/ 153), Al-Marwazi in Al-Sunnah (1/ 71), Al-Tabarani in Al-Kabir (20/ 274), Al-Daraqutni (4/ 286), Al-Hakim (1/ 191), and Al-Bayhaqi in Al-Kubra (7/ 76) and in Dala'il al-Nubuwwah (1/ 24). It was also reported from the phrase: (It is imminent...): by Abu Dawud (4/ 328), Al-Tirmidhi (5/ 38), Ibn Majah (1/ 6), Al-Tahawi in Sharh Ma'ani al-Athar (4/ 209), Ibn Hibban (1/ 189), and Al-Lalaka'i in I'tiqad Ahl al-Sunnah (1/ 82). Al-Albani authenticated it in Mishkat al-Masabih (1/ 35). \n2. Surah Sad: 26.",
    "book_id": "1073",
    "new_page_number": 14
  },
  {
    "serial_number": "7544618",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim’s Stance on Tribulations in Light of the Hadith of Abdullah ibn Amr (RA)",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 17,
    "volume_number": 1,
    "text": "When a person is confronted with a matter he is commanded to do or avoid, he may say: 'I do not know what we found in the Book of Allah, we followed it.'\n\nB. The Tribulation of Desires: This is the prevailing type, such as attraction to women, forbidden wealth, positions of authority, and similar matters.\n\n**Cause:** It arises from excessive sins, immoral acts, the domination of worldly concerns over the heart, indulgence in lawful desires leading to following one’s whims, neglect of obedience, bad companionship, contempt and negligence of one’s sinful actions, and ignorance of the value of the worldly life.\n\n**Danger:** It causes various forms of corruption on earth — in water, air, crops, fruits, and dwellings. Allah, the Exalted, says: {Corruption has appeared on land and sea because of what the hands of people have earned, so He may let them taste some of what they have done, in order that they may return [to righteousness].} [Ar-Rum: 41] It is also a reason for the removal of blessings.",
    "foot_note": "1. Reported by Abu Dawud (4/329), Al-Tirmidhi (5/37), Ibn Majah (1/6), Al-Shafi‘i in his Musnad (1/151), Al-Humaydi in his Musnad (1/252), Al-Ruwaiyani in his Musnad (1/473), Al-Tahawi in Sharh Ma‘ani al-Athar (4/209), Al-Tabarani in Al-Kabir (1/316) and Al-Awsat (8/350), Al-Hakim (1/190), Al-Bayhaqi in Ma‘rifat al-Sunan (1/8). Verified by Al-Albani in Mishkat al-Masabih (1/35) 162. Similarly reported from Al-Arbaad ibn Sariyah: Abu Dawud (3/135), Al-Bayhaqi in Al-Kubra (9/204). From Abu Huraira: Al-Bazzar (2/442).\n2. Surah Ar-Rum: 41.",
    "book_id": "1073",
    "new_page_number": 15
  },
  {
    "serial_number": "7544619",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 18,
    "volume_number": 1,
    "text": "Salvation from it: Is by certainty in Allah's promise and threat, remembering the Hereafter and what is in it, and sensing the greatness of Allah Almighty and knowing Him truly. The Almighty said: {They have not appraised Allah with true appraisal, while the earth entirely will be [within] His grip on the Day of Resurrection, and the heavens will be folded in His right hand. Exalted is He and high above what they associate with Him} (1). These two sections were mentioned in the Quran in one verse, in His saying: {Like those before you; they were stronger than you in power and more abundant in wealth and children. They enjoyed their portion [of worldly enjoyment], and you have enjoyed your portion as those before you enjoyed their portion, and you have engaged [in vanities] like that in which they engaged} (2). Meaning they enjoyed their share of the world and its desires. 'Khalaq' (portion) is the decreed share. Then He said: {and you have engaged [in vanities] like that in which they engaged}. This engaging in falsehood is the doubts (Shubuhat). So, He, Glory be to Him, indicated in this verse what causes corruption of hearts and religions from enjoying the portion and engaging in falsehood, because corruption of religion is either by believing in falsehood and speaking it, or by acting contrary to correct knowledge.",
    "foot_note": "1. Surah Az-Zumar: 67.\n2. Surah At-Tawbah: 69.",
    "book_id": "1073",
    "new_page_number": 16
  },
  {
    "serial_number": "7544620",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 19,
    "volume_number": 1,
    "text": "The first: Is innovation and what follows it, which is corruption from the side of doubts. The second: Is immorality of deeds, which is corruption from the side of desires. For this reason, the predecessors used to say: Beware of two types of people: A person of desire who has been seduced by his desire, and a person of the world who has been blinded by his world. And they used to say: Beware of the Fitnah of the wicked scholar and the ignorant worshiper, for their Fitnah is a Fitnah for everyone who is tempted. The origin of every Fitnah is indeed from prioritizing opinion over Sharia (revelation) and desire over intellect (1). The Fitnah of doubts is repelled by knowledge and certainty, and the Fitnah of desires is repelled by patience and certainty in Allah's promise and threat, and sensing His greatness, Glory be to Him. Therefore, He, Glory be to Him, made leadership in religion contingent upon these two matters, saying: {And We made from among them leaders guiding by Our command when they were patient and [when] they were certain of Our signs} (2). This indicates that by patience and certainty, leadership in religion is attained. He also combined them in His saying: {And advised each other to truth and advised each other to patience} (3).",
    "foot_note": "1. See all the foregoing in: Ighathat Al-Lahfan by Ibn Al-Qayyim (2/ 167).\n2. Surah As-Sajdah: 24.\n3. Surah Al-Asr: 3.",
    "book_id": "1073",
    "new_page_number": 17
  },
  {
    "serial_number": "7544621",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 20,
    "volume_number": 1,
    "text": "So they advised each other to the truth which repels doubts, and to patience which restrains from desires.\n\n* Tribulations in terms of Time:\nTribulations are divided in terms of their time into: Tribulations of Life, and Tribulations of Death.\nThe basis for this division is the Hadith of Aisha, the wife of the Prophet, peace and blessings be upon him: That the Messenger of Allah, peace and blessings be upon him, used to supplicate in prayer: 'O Allah, I seek refuge in You from the torment of the grave, and I seek refuge in You from the Fitnah of the Antichrist (Al-Masih Ad-Dajjal), and I seek refuge in You from the Fitnah of life and the Fitnah of death. O Allah, I seek refuge in You from sin and debt.' Someone said to him: 'How often you seek refuge from debt!' He said: 'Indeed, when a man is in debt, he speaks and lies, and promises and breaks his promise' (1).\nThe First Fitnah: The Fitnah of (Mahya - Life): With a Fatha on the Meem. It is what a person is exposed to during his life of being tempted by the world, its desires, and ignorance. Or it is trial with the disappearance of patience (2). Or it is everything a person is given of good or evil; if it is good, he is tested in it: Does he perform gratitude for the blessing? And if it is evil: Does he be patient",
    "foot_note": "1. Sahih Al-Bukhari, Book of Description of Prayer / Chapter on Supplication before Salam (1/ 286) No. 798, and Muslim, Book of Mosques (2/ 93) No. 1353.\n2. Fath Al-Bari (3/ 236).",
    "book_id": "1073",
    "new_page_number": 18
  },
  {
    "serial_number": "7544622",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 21,
    "volume_number": 1,
    "text": "over it? And they are more than can be counted.\nThe Second: The Fitnah of (Mamat - Death). There are two interpretations for it:\nA. What a person is tested with at death, and it was attributed to death due to its proximity to it. Based on this, the intended meaning of 'Fitnah of Life' would be what precedes that. This Fitnah might be called the Fitnah of dying (Ihtidar) because Satan may tempt a human being sometimes by making him doubt his Creator and his Return, sometimes by discontent with decree, and sometimes by turning him away from preparing to meet his Lord by repenting from a slip and rectifying a lapse, and so on (1).\nB. Or the intended meaning of the Fitnah of Death is: The Fitnah of the Grave, i.e., the questioning of the two angels. It has been authentically reported in the Hadith of Asma: 'You will be tested in your graves like or close to the Fitnah of the Dajjal' (2). With this interpretation, it is not repetitive with the phrase 'torment of the grave' because torment is a consequence of the Fitnah, and the cause is different from the effect. Al-Nawawi said: As for combining the Fitnah of life and death, the Fitnah of the Antichrist, and the torment of the grave, it is from the category of mentioning the specific after the general, and its parallels are many (3).",
    "foot_note": "1. See: Fath Al-Bari (11/ 177), and Kashf Al-Mushkil min Hadith Al-Sahihayn (1/ 921).\n2. Sahih Al-Bukhari, Book of Ablution / Chapter: Whoever does not perform ablution except from fainting (1/ 79) 182.\n3. Sharh Al-Nawawi on Muslim (5/ 85).",
    "book_id": "1073",
    "new_page_number": 19
  },
  {
    "serial_number": "7544623",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 22,
    "volume_number": 1,
    "text": "* Tribulations in terms of Size:\nTribulations are divided in terms of their size into: Small tribulations and great, enormous tribulations. The evidence for this division is what was reported from Hudhayfah bin Al-Yaman that he said: 'By Allah, I am the most knowledgeable of people regarding every Fitnah that is to happen between me and the Hour. It is not that the Messenger of Allah, peace and blessings be upon him, confided in me something regarding that which he did not tell anyone else, but the Messenger of Allah, peace and blessings be upon him, said while speaking to a gathering in which I was present about tribulations. The Messenger of Allah, peace and blessings be upon him, said while counting the tribulations: 'Among them are three that will hardly leave anything. And among them are tribulations like summer winds; among them are small ones and among them are large ones.' Hudhayfah said: So all that group left except me' (1) (2). His saying (And among them are tribulations like summer winds) means they have some severity, and summer was specified because winter winds are stronger. And it was said: Meaning they have some severity, but it is a severity that passes and is not like winter winds (3).",
    "foot_note": "1. Reported by Muslim, Book of Tribulations and Signs of the Hour (8/ 172) No. 7444.\n2. Hudhayfah's saying, may Allah be pleased with him: 'So all that group left except me', meaning those who heard this. Al-Raht: A group less than ten, and it is said: Up to forty. It is as if he feared that some of these tribulations would overtake him! Kashf Al-Mushkil min Hadith Al-Sahihayn (1/ 261).\n3. Al-Makhraj min Al-Fitan by Khalid Al-Sabt (1/ 3).",
    "book_id": "1073",
    "new_page_number": 20
  },
  {
    "serial_number": "7544624",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 23,
    "volume_number": 1,
    "text": "It was reported from Umar bin Al-Khattab, may Allah be pleased with him, that he said: 'Which of you memorized the saying of the Messenger of Allah, peace and blessings be upon him, regarding Fitnah?' Hudhayfah said: 'I memorized it just as he said it.' He said: 'Bring it, indeed you are bold.' He said: The Messenger of Allah, peace and blessings be upon him, said: 'A man's Fitnah in his family, wealth, and neighbor is expiated by prayer, charity, enjoining good, and forbidding evil.' Umar said: 'This is not what I meant, but rather the one that surges like the surging of the sea.' He said: 'O Commander of the Faithful, there is no harm upon you from it; indeed, between you and it is a closed door' (1). The Hadith indicates that: Among tribulations are those specific to every individual from which he cannot be separated, and among them are those general to everyone, which is what Umar, may Allah be pleased with him, asked about. Ibn Rajab said: 'Fitnah is of two types: One: Specific, pertaining to a man in himself. The second: General, encompassing people. As for the specific Fitnah: It is a man's trial in his own self with his family, wealth, child, and neighbor. Allah Almighty has said: {Your wealth and your children are but a trial (Fitnah)} (2), for that often distracts from seeking",
    "foot_note": "1. Sahih Al-Bukhari, Book of Times of Prayer / Chapter: Prayer is Expiation (1/ 196) 502, and Muslim, Book of Tribulations and Signs of the Hour (8/ 173) 7450.\n2. Surah At-Taghabun: 15.",
    "book_id": "1073",
    "new_page_number": 21
  },
  {
    "serial_number": "7544625",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 24,
    "volume_number": 1,
    "text": "the Hereafter and preparing for it, and occupies one from that... Thus it appears: That a human being is tested with his wealth, child, family, and neighbor adjacent to him, and is tempted by that. Sometimes preoccupation with it distracts him from what benefits him in his Hereafter. Sometimes his love for it compels him to do for its sake some things that Allah does not love. Sometimes he falls short in the right obligatory upon him. And sometimes he wrongs it and commits towards it what Allah hates of word or deed, so he is asked about it and held accountable for it. If any of these specific tribulations happen to a human, then he prays, fasts, gives charity, enjoins good, or forbids evil, that becomes an expiation for him. If a human is saddened by his sin and does a righteous deed for it, that is evidence of his faith. As for general tribulations: They are the ones that surge like the waves of the sea, are turbulent, and follow one another like sea waves. The first of them was the Fitnah of the killing of Uthman, may Allah be pleased with him, and what arose from it of the division of Muslims' hearts, the branching of their desires, their declaring each other disbelievers, and shedding each other's blood. The closed door between people and tribulations was Umar, may Allah be pleased with him. The killing of Umar was the breaking of that door, so that door was never closed after him. Hudhayfah was the person who asked the Prophet, peace and blessings be upon him, most about tribulations, and the most knowledgeable of people about them. He had knowledge from the Prophet, peace and blessings be upon him, about general and specific tribulations. He had",
    "foot_note": "None",
    "book_id": "1073",
    "new_page_number": 22
  },
  {
    "serial_number": "7544626",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 25,
    "volume_number": 1,
    "text": "told Umar about the details of general tribulations, and about the door that is between people and them, and that it is Umar. That is why he said: 'I told him a Hadith that is not mistakes (Aghalit).' Aghalit: Plural of Ughlutah, which is used to mislead... This is evidence that the narration of someone like Hudhayfah yields certain knowledge in which there is no doubt for the one who hears it; for Hudhayfah mentioned that Umar knew that and was certain of it as he was certain that night precedes tomorrow, due to the Hadith he told him which bore nothing but truth and honesty. The Companions knew in the time of Umar that the survival of Umar was a safety for people from tribulations (1). In his comparison, peace and blessings be upon him, of tribulations to surging like the waves of the sea, there is a clear indication of their strength and intensity, then their succession, and that no one can stand before them; because no one can stand before the waves of the sea. And that people facing these tribulations will have their movement disturbed, their balance disrupted, their chests tightened, and their breath cut off, and this is the state of one struggling against waves. If we know that sea waves multiply and grow great with the intensity of wind and the spread of clouds; then we can visualize the atmosphere of tribulations as a dark atmosphere. For the one who",
    "foot_note": "1. See Fath Al-Bari by Ibn Rajab (3/ 35).",
    "book_id": "1073",
    "new_page_number": 23
  },
  {
    "serial_number": "7544627",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 26,
    "volume_number": 1,
    "text": "witnesses the fierce sea waves, the blueness of the sea appears before him along with the darkness and abundance of clouds, with the intensity of the blowing winds and their strength; likewise is the one who faces these tribulations. Darknesses and hurricanes surround him, so he is worried and distressed outwardly and inwardly. Waves have a sound, and what a sound! These tribulations have a sound; the one standing in them hears nothing but it, but rather it closes in on him. It is like the deafening blast (As-Sakhkhah). So the one standing in it remains bewildered, afraid, anxious, looking for safety but not finding it. Does anyone escape the sea and the intensity of its waves except one who is far from it? When people face sea waves together, in any of its states, screaming, wailing, quarreling, and disputing is heard from them. None of them hears the other, and each wants to save himself, and one of them might drown another to save himself (1). The intensity of tribulations may reach the point of taking a Muslim out of his religion. In the Hadith of Abu Huraira from the Prophet, peace and blessings be upon him, he said: 'Hasten to do good deeds before tribulations like pieces of a dark night, when a man will be a believer in the morning and a disbeliever by evening, or a believer in the evening and a disbeliever by morning, selling his religion for a paltry gain of this world' (2). The weight and intensity of these tribulations on a Muslim may reach the point that he wishes for death",
    "foot_note": "1. Mawqif Al-Muslim min Al-Fitan, Hussein bin Muhsin Abu Dhira' Al-Hazimi (102).\n2. Reported by Muslim, Book of Faith (1/ 76) 328.",
    "book_id": "1073",
    "new_page_number": 24
  },
  {
    "serial_number": "7544628",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 27,
    "volume_number": 1,
    "text": "and hopes for it to be rid of the affliction. From Abu Huraira, from the Prophet, peace and blessings be upon him, he said: 'The Hour will not be established until a man passes by the grave of another man and says: Would that I were in his place' (1).",
    "foot_note": "1. Sahih Al-Bukhari, Book of Tribulations / Chapter: The Hour will not be established until the people of the graves are envied (6/ 2604) 6698, and Muslim, Book of Tribulations and Signs of the Hour, Sahih Muslim (8/ 182) 7485.",
    "book_id": "1073",
    "new_page_number": 25
  },
  {
    "serial_number": "7544629",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 28,
    "volume_number": 1,
    "text": "Chapter Two: The Hadith of Abdullah bin Amr: Authentication and Study\nHadiths in the chapter of tribulations, and ways of salvation from them, and what a Muslim must do when surrounded by them are many. Among them is the Hadith of Abdullah bin Amr which mentioned the description of Fitnah, and the legal guidelines for one afflicted by it. The Hadith of Abdullah was reported by Imam Ahmad in his 'Musnad' (1). He said: Abu Nu'aym told us, Yunus told us. Meaning: Ibn Abi Ishaq. From Hilal bin Khabbab Abu Al-Ala, who said: Ikrimah told me, Abdullah bin Amr told me, saying: While we were around the Messenger of Allah, peace and blessings be upon him, they mentioned Fitnah - or it was mentioned in his presence. He said: (If you see the people when their covenants have become corrupt and their trusts have lightened, and they became like this - and he interlaced his fingers). He said: So I stood up to him and said to him: How should I act at that time, may Allah make me your ransom? He said: (Stick to your house, control your tongue, take what you know, leave what you denounce, and upon you is the affair of your own self specifically, and leave the affair of the general public).",
    "foot_note": "1. [Note: The footnote reference here seems to be a mistake in the original text, as it points to the previous page's footnote about Bukhari/Muslim. This is Ahmad's Musnad].",
    "book_id": "1073",
    "new_page_number": 26
  },
  {
    "serial_number": "7544630",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 29,
    "volume_number": 1,
    "text": "Authentication (Takhrij) of the Hadith:\nIt was reported by Abu Dawud 4/ 217 (4342), Ibn Abi Shaybah in his 'Musannaf' 15/ 9 (38270), Al-Tahawi in 'Mushkil Al-Athar' 3/ 217 (1181), Al-Tabarani in 'Al-Du'a' 1/ 546 (1963), Al-Khattabi in 'Al-Uzlah' 1/ 10, and Abu Nu'aym in 'Al-Hilyah' 3/ 1723 from the path of Abu Nu'aym with it similarly.\n- And it was reported by Al-Nasa'i in 'Al-Kubra' 6/ 59 (9962), and in 'Amal Al-Yawm wa Al-Laylah' 1/ 230 (205), Abu Amr Al-Dani in 'Al-Sunan Al-Waridah fi Al-Fitan' 2/ 363, Ibn Al-Mubarak in his 'Musnad' 1/ 159 (257), Ibn Al-Sunni in 'Amal Al-Yawm wa Al-Laylah' 2/ 337 (438), and Al-Hakim in his 'Mustadrak' 4/ 282 (7758) - 4/ 524 (8600) from paths via Yunus bin Abi Ishaq with it similarly.\nIkrimah was followed (corroborated): So it was reported by Abu Dawud 4/ 216 (4344), Ahmad 11/ 634 (7063), Al-Tahawi in 'Mushkil Al-Athar' 3/ 217 (1176), and Al-Hakim in his 'Mustadrak' 2/ 171 (2671) - 4/ 1481 (8340) from paths via Umarah bin Amr bin Hazm.",
    "foot_note": "None",
    "book_id": "1073",
    "new_page_number": 27
  },
  {
    "serial_number": "7544631",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 30,
    "volume_number": 1,
    "text": "- And it was reported by Al-Bazzar in his 'Musnad' 6/ 447 (2484) from the path of Sa'id bin Zarbi, and (2485) from the path of Uqbah bin Aws (1).\n- And it was reported by Ahmad 11/ 626 (7049) from the path of Amr bin Shu'ayb from his father from his grandfather.\n- And it was reported by Abu Amr Al-Dani 2/ 365, and Ahmad 11/ 54 (6508), from the path of Al-Hasan with a dispute regarding his hearing from Abdullah bin Amr bin Al-Aas.\nAll of them: Ikrimah, Sa'id bin Zarbi, Uqbah bin Aws, Amr bin Shu'ayb from his father, Umarah bin Amr, and Al-Hasan from Abdullah bin Amr bin Al-Aas with it. However, the narration of Yunus bin Abi Ishaq from Hilal bin Khabbab from Ikrimah from Abdullah bin Amr was unique with the wording 'Stick to your house, and hold your tongue,' and no one followed him in this. Even the witness (corroborating narration) for this Hadith",
    "foot_note": "1. Al-Bazzar said: This Hadith is narrated from Abdullah bin Amr through [several] ways, and we do not know of a better chain for it than the chain of Uqbah bin Aws from Abdullah bin Amr.",
    "book_id": "1073",
    "new_page_number": 28
  },
  {
    "serial_number": "7544632",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 31,
    "volume_number": 1,
    "text": "from the Hadith of Abu Huraira, may Allah be pleased with him (1), and others (2), did not contain this",
    "foot_note": "1. Reported by Ibn Hibban in his 'Sahih' (13/ 279) (5290) from the path of Rawh bin Al-Qasim from Al-Ala' from his father: From Abu Huraira who said: The Messenger of Allah, peace and blessings be upon him, said: (How will you be, O Abdullah, when you remain among the chaff of people?) He said: And what are they, O Messenger of Allah? He said: (That is when their trusts and covenants become corrupt and they become like this) and he interlaced his fingers. He said: So how should I be, O Messenger of Allah? He said: (Do what you know, leave what you denounce, work on your own self, and leave the common people). Sheikh Shu'ayb Al-Arna'ut said: Its chain is authentic upon the condition of Muslim, and Al-Albani said likewise in Al-Sahihah (1/ 416) 206. And it was reported by Al-Tabarani in Al-Kabir (19/ 228) from Rawh bin Al-Qasim. And it was reported by Abu Amr Al-Dani in Al-Sunan Al-Waridah fi Al-Fitan (3/ 575), Al-Tahawi in Sharh Mushkil Al-Athar (3/ 140), and Al-Tabarani in Al-Kabir (20/ 16) and in Al-Awsat (8/ 334) all from Amr bin Abi Amr. Both (Amr and Rawh) from Al-Ala' bin Abd al-Rahman from his father from Abu Huraira with it.\n2. The Hadith has a witness from the Hadith of Sahl bin Sa'd who said: The Messenger of Allah, peace and blessings be upon him, came out to us while we were in a gathering containing Amr bin Al-Aas and his two sons... so he mentioned similar to it - i.e., similar to the Hadith of Abu Huraira - and added: And beware of changing colors in religion. See Fath Al-Bari 13/ 39. Reported by Ibn Abi Al-Dunya in Commanding Good and Forbidding Evil (1/ 30) 29, in Punishments (1/ 12) 42, in Noble Manners (1/ 91) 276, Al-Tabarani in Al-Kabir (6/ 196) 5984 and (6/ 164) 5868, Ibn Adi in Al-Kamil (4/ 70) 918, (2/ 30) 270, Ibn Shahin in Hadith Umar bin Ahmad (1/ 44) 41, (1/ 45) 42, Ibn Asakir in his Mu'jam (1/ 225) 451 all from the path of Abu Hazim from Sahl bin Sa'd, may Allah be pleased with him. And it was reported by Al-Ruyani in his Musnad (2/ 234) 1118, Al-Bayhaqi in Shu'ab Al-Iman (7/ 46) 9398 from Abu Ayyash from Sahl bin Sa'd and it does not contain the phrase: (And beware of changing colors in religion). It has a witness from the Hadith of Umar bin Al-Khattab: Reported by Al-Tabarani in Al-Awsat (6/ 225) from Muhammad bin Ka'b Al-Qurazi from Al-Hasan bin Abi Al-Hasan from Shurayh from Umar: That the Prophet, peace and blessings be upon him, said: You will be sifted until you become among chaff of people whose covenants have become corrupt and whose trusts are ruined. So one of us said: How should we be, O Messenger of Allah? He said: Act according to what you know, leave what you denounce, and say: I find no one to help us against those who wronged us, and suffice us against those who oppressed us. He said: This Hadith is not narrated from Shurayh the Judge except with this chain; Ya'qub bin Hamid was unique in reporting it. And it was reported by Abu Nu'aym in Hilyat Al-Awliya (4/ 138) from Al-Qurazi with it. And it has a witness from the Hadith of Ibn Umar reported by Abu Ya'la in his Musnad (9/ 442) from Waqid from his father from Ibn Umar from: The Prophet, peace and blessings be upon him, said: How will you be, O Abdullah bin Umar, when you remain among chaff of people whose covenants and trusts have become corrupt, differed, and became like this? And he interlaced his fingers. He said: So how, O Messenger of Allah? He said: Take what you know, leave what you denounce, turn to your own self, and leave their common people. Hussein Salim Asad said: Its chain is weak. And it was reported by Ibn Al-Shajari in Al-Amali Al-Shajariyyah (1/ 478) from Umarah bin Amr bin Hazm from Abdullah bin Umar similarly.. Al-Haythami said in Majma' Al-Zawa'id (7/ 220): Abu Ya'la narrated it from his sheikh Sufyan bin Waki' and he is weak.",
    "book_id": "1073",
    "new_page_number": 29
  },
  {
    "serial_number": "7544633",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 32,
    "volume_number": 1,
    "text": "addition. And Hilal bin Khabbab, as mentioned by Ibn Hajar: Truthful (Saduq) but changed at the end [of his life] (1). Ibn Hibban mentioned him in Al-Thiqat (The Trustworthy) and said: He errs and contradicts (2).",
    "foot_note": "1. Taqrib Al-Tahdhib - (2/ 575).\n2. Al-Thiqat (7/ 574).",
    "book_id": "1073",
    "new_page_number": 30
  },
  {
    "serial_number": "7544634",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 33,
    "volume_number": 1,
    "text": "Study of the Chain and Ruling on the Hadith:\nAl-Albani said in Al-Silsilah Al-Sahihah (1): 'Al-Hakim said: 'Authentic in chain' and Al-Dhahabi agreed. Al-Mundhiri and Al-Iraqi said: 'Its chain is good (Hasan)'; Al-Munawi transmitted it in 'Al-Fayd', and I approve of them, and it is as they said. For this Hilal has some criticism regarding him that does not lower his Hadith from the rank of Hasan unless he is contradicted. And he has been corroborated on the origin of the Hadith... (then he listed three paths that do not contain the addition 'Stick to your house, and hold your tongue')... And he said: It is noted that these three paths do not contain the addition found in the path before this one 'Stick to your house and control your tongue.' So the heart leans towards it being an anomalous (Shadh) addition, because the one who was unique with it is Hilal bin Khabbab, and there is criticism regarding him as previously mentioned, so he is not used as proof if he contradicts the trustworthy.'\nThe origin of this Hadith was suspended (Mu'allaq) by Al-Bukhari (480) with the wording: 'O Abdullah bin Amr, how will you be when you remain among the chaff of people with this' and Ibrahim Al-Harbi connected it in 'Gharib Al-Hadith', and Hanbal bin Ishaq in 'Al-Fitan' as in Al-Fath 1/ 566, 13/ 39, and in Taghliq Al-Ta'liq 2/ 245.",
    "foot_note": "1. (1/ 415) 250.",
    "book_id": "1073",
    "new_page_number": 31
  },
  {
    "serial_number": "7544635",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 34,
    "volume_number": 1,
    "text": "Al-Hakim authenticated the Hadith 4/ 315 saying: This is a Hadith with an authentic chain and they did not extract it, and Al-Dhahabi agreed. Al-Mundhiri graded it Hasan in 'Al-Targhib wa Al-Tarhib' 3/ 443, and Al-Iraqi in 'Takhrij Al-Ihya' 2/ 232. Al-Albani included it in the Series of Authentic Hadiths (205) and said: 'It is as they said - meaning the Hadith is Hasan - for this Hilal has some criticism regarding him that does not lower his Hadith from the rank of Hasan unless he is contradicted, and he has been corroborated on the origin of the Hadith.' Shu'ayb Al-Arna'ut authenticated it.\nSo what appears from this is that the origin of the Hadith is authentic, and Hilal's addition is anomalous in the Hadith of Abdullah bin Amr as Al-Albani, may Allah have mercy on him, said. However, it has been authenticated from the Hadith of others, and Allah knows best.\n\nWitnesses for this Addition:\nThis addition has been authenticated from other Hadiths. The Hadith has a witness from the Hadith of Uqbah, Thawban, and Abu Musa Al-Ash'ari, may Allah be pleased with them. Al-Albani said in Al-Sahihah (1/ 416) 206: 'But this addition: 'Stick to your house...' has been established in other Hadiths.'\nAs for the Hadith of Uqbah bin Amir, it was reported by Al-Tirmidhi 4/ 605 from",
    "foot_note": "None",
    "book_id": "1073",
    "new_page_number": 32
  },
  {
    "serial_number": "7544636",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 35,
    "volume_number": 1,
    "text": "Abu Umamah from Uqbah bin Amir who said: I said, 'O Messenger of Allah, what is salvation?' He said: 'Control your tongue, let your house suffice you, and weep over your sin.' Abu Isa said: This is a Hasan Hadith (1).\n- As for the Hadith of Thawban, it was reported by Al-Tabarani in Al-Mu'jam Al-Awsat 3/ 21 and Al-Saghir 1/ 140, and in Musnad Al-Shamiyyin (1/ 313) from Isa bin Sulayman Al-Shayzari",
    "foot_note": "1. Reported by Ibn Al-Mubarak in Al-Zuhd 1/ 43, Ibn Wahb in Al-Jami' 1/ 378, Ahmad in his 'Musnad' 4/ 148, 5/ 259, and in 'Al-Zuhd' 1/ 15, Ibn Abi Al-Dunya in Al-Riqqah wa Al-Buka' 1/ 31, in Al-Samt 1/ 41, and in Al-Uzlah wa Al-Infirad 1/ 48, Ibn Abi Asim in Al-Zuhd 1/ 16, Al-Tabarani in Al-Kabir (12/ 234) and in Musnad Al-Shamiyyin 1/ 156, Al-Ruyani in his Musnad 1/ 146, Ibn Adi in Al-Kamil 4/ 324, 5/ 165, 7/ 216, Al-Malini in Al-Arba'un fi Shuyukh Al-Sufiyyah 1/ 136, Abu Nu'aym in 'Al-Hilyah' 2/ 9, Al-Bayhaqi in 'Shu'ab Al-Iman' 1/ 492, 4/ 239, 6/ 260, in Al-Adab 1/ 176, and in Al-Zuhd Al-Kabir 1/ 130, Al-Khatib in 'Tarikh Baghdad' 8/ 270, Ibn Al-Banna in Al-Risalah Al-Mughniyah 1/ 35, Ibn Al-Shajari in 'Al-Amali Al-Shajariyyah' 1/ 376, 1/ 412, Al-Baghawi in Sharh Al-Sunnah 14/ 317, Ibn Asakir in Tarikh Dimashq 40/ 496, 48/ 275, Abu Tahir Al-Silafi in Mu'jam Al-Safar 1/ 119, and Ibn Qudamah Al-Maqdisi in Al-Mutahabbin fi Allah 1/ 96. All of them from Al-Qasim from Abu Umamah. And it was reported by Ahmad (4/ 158), and Hannad in Al-Zuhd 1/ 265, 2/ 545, from Farwah bin Mujahid Al-Lakhmi. Both from Uqbah bin Amir with it. The Hadith was authenticated by Al-Albani in Sahih Al-Tirmidhi (5/ 406) 2406.",
    "book_id": "1073",
    "new_page_number": 33
  },
  {
    "serial_number": "7544637",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 36,
    "volume_number": 1,
    "text": "who said: Isma'il bin Ayyash told us from Shurahbil bin Muslim from Thawban, the freed slave of the Messenger of Allah, peace and blessings be upon him, who said: The Messenger of Allah, peace and blessings be upon him, said: (Blessed is he who controls his tongue, whose house suffices him, and who weeps over his sin). He said: This Hadith is not narrated from Thawban except with this chain; Isa bin Sulayman was unique in reporting it, and he is trustworthy (1).\nAs for the Hadith of Abu Musa Al-Ash'ari, may Allah be pleased with him, it was reported by Abu Dawud in his Sunan 4/ 164: From Affan bin Muslim who said, Abdul-Wahid bin Ziyad told us, he said, Asim Al-Ahwal told us from Abu Kabshah who said, I heard Abu Musa say: The Messenger of Allah, peace and blessings be upon him, said: 'Indeed, before you are tribulations like pieces of a dark night. A man will be a believer in the morning and a disbeliever by evening, and a believer in the evening and a disbeliever by morning. The one sitting in them is better than the one standing, and the one standing in them is better than the one walking, and the one walking in them is better than the one running.' They said: 'So what do you command us?' He said: 'Be the mats of your houses [i.e., stay home]' (2).",
    "foot_note": "1. And it was reported by Abu Dawud in Al-Zuhd 1/ 397, Ibn Abi Asim in Al-Zuhd (1/ 29), and Ibn Abi Al-Dunya in Al-Uzlah wa Al-Infirad 1/ 49 from paths all from Isma'il bin Ayyash from Shurahbil bin Muslim from Thawban with it. Al-Albani graded it Hasan in Sahih Al-Jami' Al-Saghir (3/ 451) 7376.\n2. And reported by Ahmad 4/ 408 from his path from Affan at length. And reported by Al-Ajurri in Al-Shari'ah 1/ 41, Al-Daraqutni in Al-Mu'talif wa Al-Mukhtalif 4/ 59 at length, Al-Khattabi in Al-Uzlah 1/ 11, Al-Hakim in Al-Mustadrak 4/ 487 and said: This is a Hadith with an authentic chain and they did not extract it, and Ibn Al-Banna in Al-Risalah Al-Mughniyah 1/ 43, from paths from Abdul-Wahid bin Ziyad from Asim Al-Ahwal from Abu Kabshah from Abu Musa with it. Shu'ayb Al-Arna'ut said in the commentary on Musnad Ahmad 4/ 408: Authentic Hadith, and this chain is weak due to the anonymity of Abu Kabshah. Al-Albani authenticated it in Sahih Sunan Abi Dawud 9/ 262.",
    "book_id": "1073",
    "new_page_number": 34
  },
  {
    "serial_number": "7544638",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 37,
    "volume_number": 1,
    "text": "Chapter Three: The Stance of the Muslim Towards Fitnah in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him\nWhoever contemplates the Hadith of Abdullah bin Amr, may Allah be pleased with him, will encounter the Messenger of Allah's, peace and blessings be upon him, description of a temporal phase that some individuals of his nation will live through. The Messenger of Allah, peace and blessings be upon him, mentions the most prominent characteristics of this phase after tribulations were mentioned in his presence. He informed that (A time is imminent when people will be sifted thoroughly, and a chaff of people will remain) as came in Al-Mustadrak from the path of Umarah bin Hazm (1). Look at (sifted) and (chaff), as if people are purified with a sieve so their best go away, and the bad, vile chaff remains in that time. 'Hathalah' (chaff) in the language (2): The bad of everything. In that time - may Allah protect us from it - the chaff of",
    "foot_note": "1. Its authentication preceded.\n2. See Al-Nihayah (1/ 890), Lisan Al-Arab (11/ 142) entry (Hathala).",
    "book_id": "1073",
    "new_page_number": 35
  },
  {
    "serial_number": "7544639",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 38,
    "volume_number": 1,
    "text": "people will abound, and what is meant is their lowliest, worst, and those in whom there is no good. Then the Messenger of Allah, peace and blessings be upon him, enumerated the most important descriptions of this chaff: (Their covenants have become corrupt, and their trusts have lightened), meaning: covenants have become mixed and corrupted. So breaking the covenant became the most prominent trait of the individuals of that time period; no sanctity of a pact is observed, and no covenant is trusted. Trustworthiness among those individuals became a subject of betrayal, not preservation and protection, although Islam expects its adherent to have a vigilant conscience, by which the rights of Allah and the rights of people are preserved, and actions are guarded against motives of negligence and carelessness. Trustworthiness (Amanah) in the view of the Lawgiver has a broad significance, symbolizing various meanings, all hinging on a person's feeling of responsibility in every matter entrusted to him, and his firm realization that he is responsible for it before his Lord (1). Whoever contemplates many verses will encounter this meaning. The Almighty says: {O you who have believed, fulfill [all] contracts} (2), and He said: {And fulfill the covenant; indeed, the covenant will be questioned} (3), {And those who are to their trusts and their promise attentive} (4), {O you who have believed, do not betray Allah and the Messenger or betray your trusts while you know} (5).",
    "foot_note": "1. See: Khuluq Al-Muslim by Al-Ghazali (38).\n2. Surah Al-Ma'idah: 1.\n3. Surah Al-Isra: 34.\n4. Surah Al-Ma'arij: 32.\n5. Surah Al-Anfal: 27.",
    "book_id": "1073",
    "new_page_number": 36
  },
  {
    "serial_number": "7544640",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 39,
    "volume_number": 1,
    "text": "These tribulations continue to spread until these reprehensible morals become a societal trait and a general characteristic. Discord creeps in and chaos spreads, to the point that the Messenger of Allah, peace and blessings be upon him, used a vivid image to clarify this meaning which might not be imagined by someone living in the Prophetic society—the society whose slogan was trustworthiness, loyalty, unity, and rejection of division. He likened the state of societal discord to the interlacing of fingers. It came in the Hadith of Abdullah that the Messenger of Allah, peace and blessings be upon him, said: 'And they differed and became like this - and he interlaced his fingers.' Al-Hafiz said when explaining the Hadith of Hudhayfah (1): (It combines with it lack of trustworthiness, non-fulfillment of covenants, and severity of difference; and in each of them is an addition not in the other). Al-Azim Abadi (2) has another interpretation for the meaning of the Hadith, where he said: (Meaning: They mix with one another, and their religious affair becomes confused, so the trustworthy is not known from the treacherous, nor the righteous from the wicked). In the words of the author of Al-Awn, there is an indication of the confusion of people's affairs due to the abundance of corruption. There is no objection to interpreting the Hadith with both meanings, for both are correct.",
    "foot_note": "1. The long Hadith of Hudhayfah, in which: '...that trustworthiness descended into the roots of men's hearts, then they learned from the Quran, then they learned from the Sunnah. And he told us about its lifting, saying: A man sleeps a sleep, and trustworthiness is taken from his heart, so its trace remains like the trace of a blister...' Sahih Al-Bukhari, Book of Al-Riqaq / Chapter: The Lifting of Trustworthiness (5/ 2382) 6132.\n2. Awn Al-Ma'bud (11/ 334).",
    "book_id": "1073",
    "new_page_number": 37
  },
  {
    "serial_number": "7544641",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 40,
    "volume_number": 1,
    "text": "Due to the eagerness of the Companions of the Messenger of Allah, peace and blessings be upon him, for knowledge, Abdullah bin Amr asked the Messenger of Allah, peace and blessings be upon him, about the stance of the Muslim by which he can be saved from these tribulations, which is what I titled the sections of this chapter. May Allah protect us from Fitnah. So he, peace and blessings be upon him, guided him to practical steps to avoid it. Other evidences have come mentioning legal guidelines for the Muslim's stance towards Fitnah; we list some of them generally, before detailing the guidelines mentioned in the Hadith of Abdullah bin Amr, may Allah be pleased with him. Among these guidelines:\n1. Holding fast to the Book and the Sunnah. The Almighty says: {And whoever holds firmly to Allah has [indeed] been guided to a straight path} (1).\n2. Piety (Taqwa) and adhering to worship. He, peace and blessings be upon him, said: 'Worship during Harj (turmoil/killing) is like immigration to me' (2).\n3. Adhering to the community (Jama'ah) of Muslims. He, peace and blessings be upon him, said: 'Whoever sees something from his ruler that he dislikes, let him be patient with it, for whoever separates from the community by a handspan and dies, dies a death of Jahiliyyah' (3).",
    "foot_note": "1. Surah Al Imran: 101.\n2. Reported by Muslim in his Sahih, Book of Tribulations, Chapter: The Virtue of Worship during Harj (4/ 2268) 2948.\n3. Reported by Al-Bukhari in his Sahih, Book of Tribulations, Chapter: The saying of the Prophet, peace and blessings be upon him: 'You will see after me things you disapprove of' (9/ 47) 7054, and Muslim in his Sahih, Book of Leadership, Chapter: The Obligation of Adhering to the Community of Muslims upon the Appearance of Tribulations (3/ 1477) 1849.",
    "book_id": "1073",
    "new_page_number": 38
  },
  {
    "serial_number": "7544642",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Stance of the Muslim Towards Tribulations in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 41,
    "volume_number": 1,
    "text": "4. Isolating oneself from places of tribulations. The Almighty says: {And fear a trial which will not strike those who have wronged among you exclusively} (1). And from Imran bin Husain, from the Prophet, peace and blessings be upon him, he said: 'Whoever hears of the Dajjal, let him keep far from him; for a man will come to him thinking he is a believer, but will remain with him due to the doubts he brings until he follows him' (2).\n5. Verification, deliberation, and lack of haste. {O you who have believed, if there comes to you a disobedient one with information, investigate, lest you harm a people out of ignorance and become, over what you have done, regretful} (3).\n6. Adhering to supplication and seeking refuge in Allah from tribulations. 'The Prophet, peace and blessings be upon him, ascended the pulpit one day and said: Ask me about nothing but I will explain it to you... A man stood up who, when he argued, was attributed to other than his father, and said: O Prophet of Allah, who is my father? He said: Your father is Hudhafah. Then Umar stood up and said: We are pleased with Allah as Lord, Islam as religion, and Muhammad as Messenger; we seek refuge in Allah from the evil of tribulations. The Prophet, peace and blessings be upon him, said: I have never seen good and evil like today. Paradise and Hell were depicted for me until I saw them",
    "foot_note": "1. Surah Al-Anfal: 25.\n2. Reported by Abu Dawud in Al-Sunan (3/ 102) 4319, Ahmad in Al-Musnad (33/ 107) 19875, and Al-Hakim in Al-Mustadrak (4/ 531) and said: This Hadith has an authentic chain according to the condition of Muslim and they did not extract it, and it is as he said. Al-Albani authenticated it in Sahih Sunan Abi Dawud (4319).\n3. Surah Al-Hujurat: 6.",
    "book_id": "1073",
    "new_page_number": 39
  },
  {
    "serial_number": "7544643",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim’s Stance on Tribulations in Light of the Hadith of Abdullah ibn Amr (RA)",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 42,
    "volume_number": 1,
    "text": "\"Without the wall.\" (1)\n\n7. Following the Godly Scholars: {And when there comes to them a matter of security or fear, they spread it around; but if they had referred it to the Messenger and to those in authority among them, it would have been better for those who extract it from them. And if not for the favor of Allah upon you and His mercy, you would have followed Satan except for a few.} (2)\n\nAbu Bakrah said: Allah benefited me with a single statement during the Days of Camel, when the Prophet ﷺ heard that a Persian had given rule to the daughter of Khosrow, he said: 'A people who are ruled by a woman will not succeed.' (3) Consider how Abu Bakrah (RA) benefited from a single statement he heard from the Messenger of Allah ﷺ and refrained from tribulations.\n\nI have limited this to practical steps mentioned in the religious texts; otherwise, they are many. For those who wish to study further, they may refer to books authored on this topic. (4)",
    "foot_note": "1. Reported by Al-Bukhari in Sahih, Book of Tribulations, Chapter: Acclimating to Tribulations (9/53) 7089.\n2. Surah An-Nisa: 83.\n3. Reported by Al-Bukhari in Book of Tribulations / Chapter: Tribulations that surge like the waves of the sea (6/2600).\n4. References: Kitab Al-Fitan by Abu Amr Al-Dani, Kitab Al-Fitan by Nu‘aym ibn Hammad, Al-Nihayah fi Al-Fitan wa Al-Malahim by Ibn Kathir, Kitab Al-Fitan by Al-Hazmi, Seerah of Scholars of the Salaf during Tribulations by Ali Al-Sabah, Fiqh of Dealing with Tribulations by Zain Al-Abidin Al-Ghamdi, Al-Mukhraj min Al-Fitan Al-Muqbil by Al-Wadi‘i, Ma‘alim fi Al-Ta‘amul ma‘a Al-Fan by Muhammad Al-Hamad, Ma‘alim fi Awqat Al-Fitan wa Al-Nawazil by Abdul Aziz Al-Sadhan, Basair fi Al-Fitan by Muhammad Ismail Al-Muqaddam, Mawkif Al-Muslim min Al-Fitan by Abdullah Al-Abilan.",
    "book_id": "1073",
    "new_page_number": 40
  },
  {
    "serial_number": "7544644",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 43,
    "volume_number": 1,
    "text": "The First Requirement: \"Stick to your house\"\nIt was mentioned in the second section (1) that this addition is irregular (shadh) in the Hadith of Abdullah bin Amr, but it is established in other Hadiths, so it was included due to its authenticity. The first directive mentioned by the Prophet (peace be upon him) during times of trials (Fitnah) and the disturbance of people's affairs is: (Stick to your house).\nAl-Tibi said: \"(Ilzam - Stick to) with a kasra, then sukoon, then fatha; (Baytaka - your house) means: your place of residence, whether a house, a place of seclusion, or otherwise. The command ostensibly applies to the physical house, but in reality, it addresses the addressee, meaning: expose yourself to what causes one to stick to the house, such as busying oneself with Allah, finding comfort in His obedience, and emptying oneself of others\" (2).\nThe command to stick to the house sheds light on the subject of isolation (Uzlah), which is of utmost importance and is serious if its rulings, wisdom, times, effects, positives, and negatives are not known. Moderation and balance are required between mixing with people (Khulta) and isolation. This is what Imam Al-Khattabi, may Allah have mercy on him, exemplified in the summary of his opinion...",
    "foot_note": "1. P. (10). \n2. Fayd al-Qadir: 2/ 210, 2/ 249.",
    "book_id": "1073",
    "new_page_number": 41
  },
  {
    "serial_number": "7544645",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 44,
    "volume_number": 1,
    "text": "...regarding isolation, and he is one of the pioneers of this subject, if not the pioneer. The schools of thought among scholars regarding mixing vs. isolation for the believer, and which is better, have differed into two opinions:\n\nThe First Opinion: Sufyan Al-Thawri, Ibrahim bin Adham, Al-Fudayl bin Iyad, and others (1) held that isolation is better. They used the following as evidence for the preference of isolation:\n1. The saying of Allah the Almighty, narrating about Ibrahim (peace be upon him): {And I will leave you and those you invoke other than Allah and will invoke my Lord. I expect that I will not be in invocation to my Lord unhappy.} (2) Then Allah said in the following verse: {So when he had left them and those they worshipped other than Allah, We granted him Isaac and Jacob, and each [of them] We made a prophet.} (3). This indicates that this was due to the blessing of isolation.\n2. They also argued using the saying of Musa (peace be upon him): {But if you do not believe me, then leave me alone.} (4) So he resorted to isolation when he despaired of them.\n3. And by His saying regarding the People of the Cave: {And when you have withdrawn from them and that which they worship other than Allah, retreat to the cave. Your Lord will spread out for you of His mercy...} (5).",
    "foot_note": "1. Al-Ihya: 2/ 242, Mukhtasar Minhaj Al-Qasidin: 109. \n2. Surah Maryam: 48 \n3. Surah Maryam: 49 \n4. Surah Ad-Dukhan: 21 \n5. Surah Al-Kahf: 16",
    "book_id": "1073",
    "new_page_number": 42
  },
  {
    "serial_number": "7544646",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 45,
    "volume_number": 1,
    "text": "The response is: The previously mentioned evidences were revealed regarding isolating oneself from disbelievers and those warring against the Muslim regarding his religion, not regarding isolation from believers. Thus, they are outside the point of contention and cannot be used as evidence (1).\n4. They used the Hadith of Uqbah bin Amir and Abdullah bin Amr as evidence (2).\n5. And the Hadith of Abu Said Al-Khudri (may Allah be pleased with him) who said: It was said, O Messenger of Allah: Which people are best? The Messenger of Allah (peace be upon him) said: \"A believer striving in the path of Allah with his self and his wealth.\" They said: Then who? He said: \"A believer in one of the mountain passes fearing Allah and sparing people from his evil.\" (3).\nAl-Ghazali says: (Using these Hadiths as proof is subject to scrutiny. As for his saying to Uqbah bin Amir, it cannot be interpreted except based on what the Prophet (peace be upon him) knew through the light of Prophethood regarding his [Uqbah's] condition, and that sticking to the house was more appropriate and safer for him than mixing. For he did not command all the Companions to do so. A person's safety might lie in isolation like that, not in mixing, just as one's safety might lie in sitting at home and not going out to...",
    "foot_note": "1. See: Al-Uzlah: 62, Al-Ihya: 2/ 246 \n2. Its citation preceded on p. 9, 11 \n3. Narrated by Al-Bukhari in Jihad, Chapter: The best of people is a believer striving with himself (6/ 8) No. 2635 and the wording is his, and Muslim in Al-Imara, Chapter: The Virtue of Jihad (6/ 9) No. 4994.",
    "book_id": "1073",
    "new_page_number": 43
  },
  {
    "serial_number": "7544647",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 46,
    "volume_number": 1,
    "text": "...Jihad, but that does not indicate that abandoning Jihad is better. Furthermore, mixing with people involves struggle and endurance. Therefore, he (peace be upon him) said: \"The one who mixes with people and bears their harm with patience is better than the one who does not mix with people and does not bear their harm with patience.\" (1) (2).\n6. And by his saying (peace be upon him): \"Allah loves the God-fearing, self-sufficient (rich of soul), hidden servant.\" (3). The meaning of 'hidden' as mentioned by Al-Nawawi, may Allah have mercy on him, is: (The idle one devoted to worship and busying himself with his own affairs. He mentioned—may Allah have mercy on him—that in this Hadith there is proof for those who say isolation is better than mixing. There is disagreement on the issue... and those who prefer mixing may interpret this as applying to isolation during times of tribulation and the like) (4).\n\nThe Second Opinion: Most of the Tabi'in, including Sa'id bin Al-Musayyib, Al-Sha'bi, Ibn Uyainah, Ibn Al-Mubarak, Al-Shafi'i, Ahmad, and a group went with this opinion. It is the opinion of the majority (5) that mixing is better than isolation.",
    "foot_note": "1. From the Hadith of Ibn Umar, its citation will come on p. 23. \n2. Al-Ihya: 2/ 247 \n3. Narrated by Muslim in Zuhd, Chapter: Asceticism and Heart-Softeners: (4/ 2277) No. 2965. \n4. Sharh Al-Nawawi Ala Muslim: 18/ 100 - 101. \n5. See: Al-Ihya: 2/ 242, Mukhtasar Minhaj Al-Qasidin: 110.",
    "book_id": "1073",
    "new_page_number": 44
  },
  {
    "serial_number": "7544648",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 47,
    "volume_number": 1,
    "text": "They used many evidences cited and discussed by Al-Khattabi and Al-Ghazali (1), including:\n1. What Allah Almighty commanded regarding unity, and what He denied and warned against regarding division. He Almighty said: {And hold firmly to the rope of Allah all together and do not become divided. And remember the favor of Allah upon you - when you were enemies and He brought your hearts together and you became, by His favor, brothers} (2).\n2. And His saying: {And brought together their hearts. If you had spent all that is in the earth, you could not have brought their hearts together; but Allah brought them together} (3). The point of evidence is Allah bestowing favor upon His Messenger by uniting the hearts of the believers, and unity does not occur except with mixing and gathering.\n3. They also argued using His saying: {And do not be like those who divided and differed after the clear proofs had come to them} (4).\nAl-Ghazali (5) responded to their deduction by saying: (He bestowed favor upon the people through the cause of unity, and this [deduction against isolation] is weak; because what is meant by [division] is the divergence of opinions and difference of schools of thought regarding the meanings of the Book of Allah and the principles of Sharia. And what is meant by unity is the removal of...",
    "foot_note": "1. Al-Uzlah: 53 - 60, Al-Ihya: 2/ 243 - 245. \n2. Surah Ali 'Imran: 103. \n3. Surah Al-Anfal: 63. \n4. Surah Ali 'Imran: 105. \n5. Al-Ihya: 2/ 244.",
    "book_id": "1073",
    "new_page_number": 45
  },
  {
    "serial_number": "7544649",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 48,
    "volume_number": 1,
    "text": "...rancor from the chests, which are the causes that stir up tribulations and move disputes. Isolation does not contradict that).\n4. They argued using his saying: \"The believer is friendly and befriended, and there is no good in one who is not friendly and is not befriended\" (1).\nAl-Ghazali responded to their deduction using this Hadith by saying: (This is weak because it indicates the blame of bad character which prevents friendship. It does not include the one of good character who, if he mixed, would be friendly and befriended, but who left mixing to busy himself with himself and to seek safety from others).\n5. And by his saying (peace be upon him): \"Whoever sees something from his commander that he hates, let him be patient with it, for whoever separates from the community (Jama'ah) by a handspan and dies, dies a death of Jahiliyyah (pre-Islamic ignorance)\" (2).",
    "foot_note": "1. Narrated by Ahmad 5/ 335, Al-Tabarani in Al-Kabir No. 5744 (6/ 131), Abu Al-Sheikh 179, Al-Quda'i in Musnad Al-Shihab: 1/ 108, Al-Khatib: 11/ 376. Al-Haythami cited it in Al-Majma' in two places (8/ 87 and 10/ 273) and said in the second of them: (Its chain is good). Al-Suyuti authenticated it in Al-Jami' Al-Saghir: (6/ 253 with Al-Fayd). Al-Albani authenticated it in Al-Sahihah No. 426 and 427, and he elaborated—may Allah have mercy on him—on mentioning its paths and witnesses and their takhrij, so look there. \n2. Narrated by Al-Bukhari in the Book of Fitan/ Chapter: You will see after me affairs that you deny (6/ 21) 4896, and Muslim in the Book of Imara/ Chapter: The obligation of adhering to the community of Muslims (3/ 1477) 1849.",
    "book_id": "1073",
    "new_page_number": 46
  },
  {
    "serial_number": "7544650",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 49,
    "volume_number": 1,
    "text": "The basis of their argument using these Hadiths is that (they said: These reports state that the one who isolates himself from people, separating from them, is a separator from the Community, deviating from the whole, splitting the staff of the Ummah [causing disunity], casting off the yoke [of allegiance], and opposing the Sunnah) (1).\nThe answer to that is to say: (This is also weak. Because what is meant by 'the Community' is the group whose opinions have agreed upon an Imam through a contract of allegiance. Rebelling against them is transgression. That [rebellion] is opposition in opinion and going out against them, which is prohibited due to the necessity of creation for an obeyed Imam to unite their opinion. This only happens through the allegiance of the majority. So opposition is a disruption that stirs up tribulation. There is nothing in this that addresses isolation) (2).\n6. They argued using the saying of the Prophet: (The believer who mixes with people and bears their harm with patience has a greater reward than the believer who does not mix with people and does not bear their harm with patience) (3).",
    "foot_note": "1. Al-Uzlah: 56. \n2. Al-Ihya: 2/ 44. \n3. From the Hadith of Ibn Umar, narrated by Al-Tirmidhi (4/ 662), Ibn Majah (2/ 1338), Al-Tayalisi in his Musnad (3/ 399), Ibn Al-Ja'd in his Musnad (1/ 121), Ibn Abi Shaybah in his Musnad (2/ 425) and in his Musannaf (5/ 293), Ahmad (2/ 43), Hannad in Al-Zuhd (2/ 588), Al-Bukhari in Al-Adab Al-Mufrad (1/ 140), Al-Tahawi in Sharh Mushkil Al-Athar (14/ 83), Al-Khara'iti in I'tilal Al-Qulub (1/ 75), Al-Tabarani in Al-Kabir (11/ 155), Ibn Shahin in Al-Targhib fi Fada'il Al-A'mal (1/ 315), Abu Nu'aym in Akhbar Asbahan (2/ 431), Al-Bayhaqi in Al-Kubra (10/ 89) and in Shu'ab Al-Iman (7/ 127) and in Al-Adab (1/ 99) and in \"Al-Arba'un Al-Sughra\" (1/ 167). Authenticated by Al-Albani in Al-Silsilah Al-Sahihah (2/ 614) 939.",
    "book_id": "1073",
    "new_page_number": 47
  },
  {
    "serial_number": "7544651",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 50,
    "volume_number": 1,
    "text": "Al-San'ani clarified in his book \"Subul al-Salam\" the mixing intended by the Hadith: (In it is the preference for the one who mixes with people, a mixing in which he enjoins them to do good and forbids them from evil and treats them well; he is better than the one who isolates himself from them and does not have patience for mixing. Conditions vary according to the differences in people and times, and for every situation there is a saying) (1).\nLooking at the aforementioned evidences of both parties, we observe that it is not possible to prefer mixing over isolation absolutely, nor the reverse. The issue requires detailing. Al-Hafiz Ibn Hajar verified the issue of preference between mixing and isolation, providing benefit and excellence. I quote his words, may Allah have mercy on him, where he said: \"The Salaf differed regarding the principle of isolation. The majority said mixing is better because of what it contains of gaining religious benefits, establishing the rituals of Islam, increasing the number of Muslims, and delivering various types of good to them such as help, relief, visiting the sick, and so on. A group said: Isolation is better to achieve safety, provided one knows what is obligatory... Al-Nawawi said: The chosen view...",
    "foot_note": "1. Subul al-Salam, (2/ 546).",
    "book_id": "1073",
    "new_page_number": 48
  },
  {
    "serial_number": "7544652",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 51,
    "volume_number": 1,
    "text": "...is the preference of mixing for the one who does not predominantly think that he will fall into sin. If the matter is ambiguous, then isolation is better. Others said: It varies according to different people. For some, one of the two matters is imperative, and for some, one outweighs the other—the discussion is not about this. rather, if they are equal, it varies according to different conditions. If they conflict, it varies according to different times. Thus, mixing is imperative for the one who has the power to remove evil; it is obligatory upon him either as an individual duty (Fard Ayn) or a communal duty (Fard Kifayah) according to the situation and possibility. It is preferable for the one who predominantly thinks he will be safe in himself if he undertakes enjoining good and forbidding evil. And they are equal for the one who is safe regarding himself but realizes he will not be obeyed. This is where there is no general tribulation (Fitnah). However, if Fitnah occurs, isolation becomes preferable due to what usually arises in it of falling into prohibitions. Punishment may befall the people of Fitnah and encompass those who are not of its people, as Allah Almighty said: {And fear a trial which will not strike those who have wronged among you exclusively} (1). This mentioned detailing is supported by the Hadith of Abu Said as well: \"The best of people is a man who strove with his self and his wealth, and a man in one of the mountain passes worshiping his Lord and sparing people from his evil\" (2). Al-Khattabi, may Allah have mercy on him, divided separation into two types, and the group into two types, and elaborated on that until he said: (And we do not intend - may Allah have mercy on you -...",
    "foot_note": "1. Surah Al-Anfal: 25. \n2. Al-Fath (13/ 42).",
    "book_id": "1073",
    "new_page_number": 49
  },
  {
    "serial_number": "7544653",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 52,
    "volume_number": 1,
    "text": "By this isolation (Uzlah) that we choose, we do not mean leaving people during congregations and Friday prayers, or abandoning their rights in acts of worship, spreading the greeting of peace (Salam), returning greetings, and similar obligatory duties towards them, or the functions of Sunan and commendable customs among them. These are excepted according to their conditions and run their course, as long as a preoccupation does not intervene or an excusable barrier does not prevent them. We only intend by isolation the abandonment of excessive companionship, discarding the surplus of it, and dropping the excess that you have no need for. For whoever persists in the companionship of people and increasing acquaintances based on what the passion of souls and the familiarity of habits call for, abandoning moderation in it and the limitation that necessity calls for, deserves not to be praised for its outcome and to find its consequence unwholesome. His path in that is the path of one who eats food when not hungry and takes from it more than his need; for such a person will soon fall into wasting diseases and destructive illnesses. One who knows is not like one who is ignorant, nor is one who has tried and tested like one who acts intuitively and takes risks...) (1). In the Hadith of Abdullah, the Prophet, peace and blessings be upon him, pointed to the time when reforming the general public becomes impossible due to people's differences, conflict, grinding against each other, the lightness of...",
    "foot_note": "1. Al-Uzlah (53 - 57). Al-Hazimi mentioned in 'Mawqif Al-Muslim min Al-Fitnah fi Daw' Al-Kitab wa Al-Sunnah' cases where isolation is legislated; refer to it, for its writer has provided benefit (99).",
    "book_id": "1073",
    "new_page_number": 50
  },
  {
    "serial_number": "7544654",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 53,
    "volume_number": 1,
    "text": "...their intellects and trusts, and the corruption of their covenants and vows. He, peace and blessings be upon him, described the people of that time as being the 'chaff' (scum) of mankind. This is an indication of the establishment of general deviation, comprehensive alienation, and the prevalence of evil and corruption—a prevalence with which one cannot hope for the reformation of the general public. There is no doubt that in such a time, staying at home and occupying oneself with reforming one's own self is better than draining energies and scattering efforts in a matter that is difficult. Indeed, a believer might even be touched by the evil of this time and may not be safe from Fitnah (trial) himself. Therefore, many scholars interpreted the Hadiths regarding isolation as applying to isolation during times of Fitnah and wars, or for someone from whom people are not safe, or who cannot be patient with them, or similar specific cases. Among the texts that indicate interpreting the Hadiths of isolation as applying to times of Fitnah is the saying of the Prophet, peace and blessings be upon him: 'There will be Fitnah (trials); the one sitting during it is better than the one standing, the one standing is better than the one walking, and the one walking during it is better than the one running. Whoever exposes himself to it, it will expose him (to destruction). So whoever finds a refuge or a shelter, let him seek refuge in it.' (1).",
    "foot_note": "1. Narrated by Al-Bukhari, Book of Fitan / Chapter: There will be a Fitnah where the sitter is better than the stander (6/2594) 6607, and Muslim, Book of Fitan and Signs of the Hour (8/168) number 7431.",
    "book_id": "1073",
    "new_page_number": 51
  },
  {
    "serial_number": "7544655",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 54,
    "volume_number": 1,
    "text": "And the Hadith of Abu Bakrah, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: 'Indeed, there will be Fitnahs (trials), behold, then there will be a Fitnah where the one reclining during it is better than the one sitting, the one sitting during it is better than the one standing, the one standing during it is better than the one walking, and the one walking during it is better than the one rushing towards it. Behold, when it descends or occurs, whoever has camels, let him join his camels; whoever has sheep, let him join his sheep; and whoever has land, let him join his land. And whoever has none of that, let him take his sword and strike its edge with a stone, then let him save himself if he can find salvation. O Allah, have I conveyed? O Allah, have I conveyed?' (1). As for normal conditions where there is no general Fitnah, the principle is that the Muslim who is able to mix with people, bears their harm with patience, and delivers religious and worldly benefit to them is better than the one who does not mix with them and does not bear their harm with patience, but rather isolates himself from their evils and remains alone.",
    "foot_note": "1. Narrated by Muslim, Book of Fitan and Signs of the Hour, Chapter: The descent of Fitnahs like the falling of rain (8/169) 7432.",
    "book_id": "1073",
    "new_page_number": 52
  },
  {
    "serial_number": "7544656",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 55,
    "volume_number": 1,
    "text": "Requirement Two: 'Control your tongue.' The true Muslim is the one who is extremely cautious regarding his tongue; because he will be held accountable for every word, indeed every utterance he speaks. The Almighty says: {Not a word does he utter but there is a watcher by him, ready.} (1). The Prophet, peace and blessings be upon him, was asked about what mostly causes people to enter the Fire? He said: 'The mouth and the private parts.' (2). Mu'adh asked the Prophet, peace and blessings be upon him, about an action that would admit him into Paradise and distance him from the Fire. The Prophet, peace and blessings be upon him, informed him of its head, its pillar, and its highest peak, then said: 'Shall I not inform you of what controls all of that?' He said: 'Yes, O Messenger of Allah!' So he took hold of his own tongue and said: 'Restrain this.' He said: 'Are we held accountable for what we speak?' He said: 'May your mother be bereaved of you, O Mu'adh! Does anything cast people onto their faces—or onto their noses—except the harvests of their tongues?' (3). In the Musnad of Imam Ahmad, from Abu Sa'id al-Khudri, he said: 'When...",
    "foot_note": "1. Surah Qaf: 18.\n2. Narrated by Al-Tirmidhi (4/363), Ibn Majah (2, 1418), and Ahmad (2/291), and declared Hasan by Al-Albani in Al-Sahihah 2/669.\n3. Narrated by Al-Tirmidhi (5/11) and he said: A Hasan Sahih Hadith, Al-Nasa'i in Al-Kubra (6/428), Ibn Majah (2/1314), and Ahmad (5/231). Declared Sahih by Al-Albani in Sahih Al-Tirmidhi 6/116.",
    "book_id": "1073",
    "new_page_number": 53
  },
  {
    "serial_number": "7544657",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 56,
    "volume_number": 1,
    "text": "...the son of Adam wakes up, his limbs bow (in submission) to the tongue, saying: Fear Allah regarding us; for if you are upright, we are upright, and if you are crooked, we are crooked.' (1). From Anas bin Malik, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: 'The faith of a servant is not straight until his heart is straight, and his heart is not straight until his tongue is straight, and he will not enter Paradise until his neighbor is safe from his calamities (evil).' (2). From Abu Huraira, from the Prophet, peace and blessings be upon him, who said: 'Indeed, a servant may speak a word from the pleasure of Allah, to which he gives no attention, by which Allah raises him degrees. And indeed, a servant may speak a word from the wrath of Allah, to which he gives no attention, by which he falls into Hell.' (3). From Abu Huraira, from the Prophet, peace and blessings be upon him, who said: 'Do you know who the bankrupt (Muflis) is? They said: The bankrupt among us, O Messenger of Allah, is the one who has no dirham and no goods. He said: Indeed, the bankrupt of my nation is the one who comes on the Day of Resurrection with prayer, fasting, and zakat, but comes having...",
    "foot_note": "1. Narrated by Al-Tirmidhi (4/605). Declared Hasan by Al-Albani in Sahih Sunan Al-Tirmidhi 5/407, 3/95.\n2. Narrated by Ibn Abi Al-Dunya in 'Al-Samt' and Ahmad (3/198). Declared Hasan by Al-Albani in Sahih Al-Targhib wa Al-Tarhib 3/56.\n3. Al-Bukhari, Book of Riqaq / Chapter: Guarding the Tongue (5/2377) 6113.",
    "book_id": "1073",
    "new_page_number": 54
  },
  {
    "serial_number": "7544658",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 57,
    "volume_number": 1,
    "text": "...insulted the honor of this one, slandered this one, and consumed the wealth of this one. So he will sit, and this one will take from his good deeds, and that one from his good deeds. If his good deeds are exhausted before what he owes is settled, some of their sins will be taken and cast upon him, then he will be cast into the Fire.' (1). From Abdullah bin Amr, may Allah be pleased with them both, who said: The Messenger of Allah, peace and blessings be upon him, said: 'Whoever is silent is saved.' (2). From Abu Huraira, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, who said: 'Whoever believes in Allah and the Last Day, let him speak good or remain silent.' (3). Imam Al-Nawawi, may Allah have mercy on him, commenting on this Hadith said:",
    "foot_note": "1. Muslim, Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship (8/18) 6744.\n2. Narrated by Al-Tirmidhi in Description of the Resurrection, Chapter 50 (4/660 No. 2501), Ibn Al-Mubarak in Al-Zuhd 385 and via him Abu Al-Sheikh in Al-Amthal, Ahmad 2/159 and 177, Al-Darimi 2/299, 107, Al-Tabarani in Al-Kabir 17, and Al-Quda'i in Musnad Al-Shihab 1/219 No. 243. The chain of Al-Tirmidhi was weakened by Imam Al-Nawawi, may Allah have mercy on him, in Al-Adhkar 520. Al-Munawi quoted in Fayd Al-Qadir: 6/171 from Al-Zain Al-Iraqi saying: (Al-Tirmidhi's chain is weak, but it is in Al-Tabarani with a good chain). Then he quoted Al-Hafiz Ibn Hajar saying: (Its narrators are trustworthy). Declared Sahih by Al-Albani in Al-Sahihah 536.\n3. Narrated by Al-Bukhari in Riqaq, Chapter: Guarding the Tongue (11/314 No. 6475 with Al-Fath) and Muslim in Faith, Chapter: Exhortation to Honor the Neighbor and Guest and Adhere to Silence Except for Good: 1/68 No. 47.",
    "book_id": "1073",
    "new_page_number": 55
  },
  {
    "serial_number": "7544659",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 58,
    "volume_number": 1,
    "text": "(I say: This Hadith, agreed upon for its authenticity, is an explicit text that one should not speak unless the speech is good, which is that for which benefit is apparent. Whenever one doubts the appearance of benefit, he should not speak. Imam Al-Shafi'i, may Allah have mercy on him, said: If one wishes to speak, he must think before his speech. If a benefit appears, he speaks; and if he doubts, he does not speak until it appears.) (1). Imam Malik mentioned in Al-Muwatta: From Umar bin Al-Khattab, may Allah Almighty be pleased with him and safeguard him - that he entered upon Abu Bakr Al-Siddiq while he was pulling his tongue - meaning: dragging it intensely. Umar said to him: 'Stop! May Allah forgive you.' Abu Bakr said: 'This has brought me to these resources (dangerous places).' (2). Al-Nawawi said in Al-Adhkar (3): 'It has reached us that Quss bin Sa'ida and Aktham bin Sayfi met, and one said to his companion: How many flaws have you found in the son of Adam?!",
    "foot_note": "1. Al-Adhkar: 517.\n2. (5/1438), narrated by Ibn Abi Shaybah (5/320), Abu Ya'la in his Musnad (1/17 No. 5) and via him Ibn Al-Sunni in 'Amal Al-Yawm wa Al-Laylah 7 No. 7. Al-Haythami mentioned it in Al-Majma' 10/302 and said: (...and its men are men of the Sahih...). Al-Suyuti quoted in Al-Jami' Al-Kabir from Al-Hafiz Ibn Kathir that he said: (Its chain is good). Al-Albani said in Al-Sahihah: 2/62 No. 535: (Authentic chain on the condition of Al-Bukhari).\n3. / 423.",
    "book_id": "1073",
    "new_page_number": 56
  },
  {
    "serial_number": "7544660",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 59,
    "volume_number": 1,
    "text": "He said: They are too many to count, but I counted eight thousand flaws. However, I found one trait that if you use it, it covers all flaws. He asked: What is it? He said: Guarding the tongue.' All that has preceded confirms the importance of a person guarding his tongue, and being cautious in preserving it at all times and eras. Guarding the tongue is even more emphasized in times of Fitnah (trials) than in others, as stated in the saying of the Messenger of Allah, peace and blessings be upon him, to Abdullah bin Amr: 'Control your tongue' (Amlik 'alayka lisanaka): ('Amlik') with cutting the Hamza and breaking the Lam ('alayka lisanaka) means guard it, protect it, and do not move it except in what is for you, not against you, or withhold it from what does not concern you. He singled it out because the limbs follow it; if it is upright, they are upright, and if it is crooked, they are crooked (1). It is said in Mirqat Al-Mafatih: 'Control your tongue' (Amlik 'alayka lisanaka) with Fatha on the Hamza and Kasra on the Lam means guard your tongue from what contains no good. The more apparent meaning is: restrain your tongue, thereby guarding your affairs and observing your conditions; so it contains a type of implication (Tadmin)' (2).",
    "foot_note": "1. See: Masabih Al-Tanwir 'ala Sahih Al-Jami' Al-Saghir (Summary of Fayd Al-Qadir Sharh Al-Jami' Al-Saghir by Imam Abdul Raouf Al-Munawi), by: Muhammad Nasir Al-Din Al-Albani, prepared and arranged by: Abu Ahmed Moataz Ahmed Abdulfattah (28).\n2. Mirqat Al-Mafatih Sharh Mishkat Al-Masabih (14/111).",
    "book_id": "1073",
    "new_page_number": 57
  },
  {
    "serial_number": "7544661",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 60,
    "volume_number": 1,
    "text": "Other Hadiths have been narrated confirming the importance of guarding the tongue during Fitnah, and that the impact of the tongue in those trials is more severe than the strike of a sword. Among them is the Hadith of Abdullah bin Amr, that the Messenger of Allah, peace and blessings be upon him, said: 'There will be a Fitnah that will eradicate (Tastan-dhifu) the Arabs (1), its slain are in the Fire (2). The tongue in it is more severe than the blow of the sword.' (3).",
    "foot_note": "1. Meaning: It will encompass them in destruction. It is said: 'Ista-ndhaftu al-shay' (I cleaned out the thing) when you take all of it. From it is their saying: 'Istan-dhaftu al-kharaj' (I took the entire land tax), and one does not say 'nazzaftuhu' (I cleaned it). Al-Nihayah fi Gharib Al-Hadith (5/79) entry (N Z F).\n2. Al-Qadi, may Allah have mercy on him, said: The meaning of 'its slain' is those killed in that Fitnah. They are only of the people of the Fire because they did not intend by that fighting and going out to it the elevation of religion, or repelling an oppressor, or aiding a person of truth. Rather, their intent was mutual oppression and conflict out of greed for wealth and dominion. Quoted by Al-Mubarakpuri in Tuhfat Al-Ahwadhi (6/335).\n3. Narrated by Abu Dawood in Fitan, Chapter on Restraining the Tongue in Fitnah: 4/461 No. 4265, Ibn Majah in Fitan, Chapter on Restraining the Tongue in Fitnah: 2/1312 No. 3967, Al-Tirmidhi (5/178) 2178, and Ahmad (11/170 No. 6980). Al-Tirmidhi said: This is a Gharib (strange) Hadith. I heard Muhammad bin Ismail say: Ziyad bin Simin Kush is not known for anything other than this Hadith. Hammad bin Salamah narrated it from Layth elevating it (Marfu'), and Hammad bin Zayd narrated it from Layth stopping it (Mawquf). Its chain is weak due to the weakness of Layth bin Abi Sulaym. Al-Hafiz said in Al-Taqrib (5985): 'Truthful but became very confused and his hadith could not be distinguished, so he was abandoned.' Ziyad bin Simin Kush (with Kasra on the negligence and Mim), Al-Hafiz said about him: 'Acceptable' Al-Taqrib (2081). Al-Albani weakened it in Da'if Ibn Majah: 319, and in Al-Silsilah Al-Da'ifah (7/217) 3230.",
    "book_id": "1073",
    "new_page_number": 58
  },
  {
    "serial_number": "7544662",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 61,
    "volume_number": 1,
    "text": "Reflect on his saying, peace and blessings be upon him: 'The tongue in it is more severe than the blow of the sword.' Qadi Iyad says: 'Meaning: its impact and stabbing, implying a possessive construction. This is indicated by the narration: (Unleashing/Looking over of the tongue - Ishraf al-Lisan), meaning: releasing it and elongating it is more severe than the blow of the sword, because if the sword is used to strike, it affects one person, but the tongue strikes a thousand souls in that state.' (1). Al-Qurtubi, may Allah have mercy on him, said: (His saying: 'The tongue in it is more severe than the blow of the sword': Meaning: by lying to the imams of oppression and conveying news to them. For perhaps from that arises looting, killing, flogging, and great corruptions exceeding what arises from the occurrence of the Fitnah itself) (2). Among the Hadiths that pointed to the danger of the word in Fitnah is the Hadith of Abu Huraira, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: 'There will be a deaf, dumb, and blind Fitnah. Whoever looks towards it (Ashrafa laha), it will draw him in (Istashrafat lahu). And the unleashing of the tongue in it is like the falling of the sword.' (3).",
    "foot_note": "1. See: Tuhfat Al-Ahwadhi (6/335).\n2. Al-Tadhkirah: (2/249).\n3. Narrated by Abu Dawood in Fitan, Chapter on Restraining the Tongue in Fitnah: 4/460 No. 4264. Al-Hafiz Ibn Kathir cited it in Al-Nihayah fi Al-Fitan: 1/79 as evidence and did not mention a defect. Al-Suyuti authenticated it in Al-Jami' Al-Saghir: (4/101 with Al-Fayd). Al-Munawi critiqued it in Al-Fayd: 4/101. Al-Mundhiri said in Mukhtasar Sunan Abi Dawood: 6/148 (In its chain is Abd al-Rahman bin al-Baylamani, and his hadith is not used as proof). Al-Hafiz said about Abd al-Rahman bin al-Baylamani: Weak. Taqrib Al-Tahdhib (Bio Number: 3819). Al-Albani weakened it in Da'if Abi Dawood No. (917) and Da'if Al-Jami' No. 3257.",
    "book_id": "1073",
    "new_page_number": 59
  },
  {
    "serial_number": "7544663",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 62,
    "volume_number": 1,
    "text": "The Fitnah was described with the attributes of its people, meaning: truth is not heard in it nor spoken, and falsehood is not clarified from truth. They do not distinguish in it between truth and falsehood, nor do they listen to advice, enjoining good, and forbidding evil. Rather, whoever speaks the truth in it is harmed and falls into trials and tribulations. Then he, peace and blessings be upon him, informed that: 'Whoever looks towards it, it draws him in,' meaning: whoever cranes his neck to look at it, it pulls him to itself. So salvation lies in keeping away from it, and destruction lies in approaching it. He, peace and blessings be upon him, also informed that: 'The unleashing of the tongue in it is like the falling of the sword,' meaning: releasing and elongating it with speech is considered like the falling of the sword in effect and warfare. In a narration: ((More severe than the sword)) (1). Ibn al-Arabi said: (The reason for it being more severe is: that if the sword strikes a single blow, it passes, but the tongue strikes a thousand souls in that single state. Then this possibly is a report about wars that occurred among the first generation, and possibly it will be. Whatever the case, it is one of his miracles because it is...",
    "foot_note": "1. Awn Al-Ma'bud: 11/346, Fayd Al-Qadir: 4/101.",
    "book_id": "1073",
    "new_page_number": 60
  },
  {
    "serial_number": "7544664",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 63,
    "volume_number": 1,
    "text": "...a report about the unseen) (1). Whoever contemplates the previous Hadiths will understand the stance of the believer during a time of Fitnah. He is the cautious, reserved person who does not unleash words due to his belief that Allah will ask him about them, and that the word is a weapon used to split the ranks of the Muslim community and tear apart its unity. The believer does not accept for himself to be a tool used by enemies to spread rumors and publish them, especially in our current era where words travel at tremendous speed via rapid communication means. If only we disciplined ourselves with what came in the Book of Allah and the Sunnah of His Messenger when any news arrives, the outcome would be good in this world and the Hereafter. The Almighty says: {And when there comes to them a matter of security or fear, they spread it. But if they had referred it back to the Messenger or to those of authority among them, then the ones who [can] draw correct conclusions from it would have known it. And if not for the favor of Allah upon you and His mercy, you would have followed Satan, except for a few.} (2). Ibn Kathir says in the interpretation of the verse: '...Denunciation of those who hasten to matters before verifying them, so they report them, divulge them, and publish them, while they may not have...",
    "foot_note": "1. Attributed to him by the author of Awn Al-Ma'bud: 11/346, Fayd Al-Qadir: 4/101, and Tuhfat Al-Ahwadhi: 6/403.\n2. Surah Al-Nisa: 83.",
    "book_id": "1073",
    "new_page_number": 61
  },
  {
    "serial_number": "7544665",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 64,
    "volume_number": 1,
    "text": "validity. Muslim said in the introduction to his Sahih (1) ... from Abu Huraira, from the Prophet, peace and blessings be upon him, said: \"It is enough of a lie for a person to speak of everything he hears.\" ... And in the Two Sahihs (2), from Al-Mughira bin Shu'ba: \"That the Messenger of Allah, peace and blessings be upon him, forbade 'Qil wa Qal' (gossip/hearsay),\" meaning one who speaks much about what people say without verification, contemplation, or clarification. Let us mention here the Hadith of Umar bin Al-Khattab agreed upon for its authenticity (3) when it reached him that the Messenger of Allah had divorced his wives. He came from his house until he entered the mosque and found people saying that. He could not wait until he sought permission to enter upon the Prophet, so he asked him for clarification: Did you divorce your wives?! He said: \"No.\" So I (Umar) said: Allah is the Greatest, and mentioned the Hadith at length. In Muslim, he said: So I said: Did you divorce them? He said: \"No.\" So I stood at the door of the mosque and called out at the top of my voice: The Messenger of Allah did not divorce his wives. And this verse was revealed: {And when there comes to them a matter of security or fear, they spread it. But if they had referred it back to...",
    "foot_note": "1. (1/8) 7.\n2. Al-Bukhari, Book of Riqaq / Chapter: What is disliked of 'Qil wa Qal' (6/294) 6473, and Muslim, Book of Judgments (5/130) 4583.\n3. Al-Bukhari, Book of Knowledge / Chapter: Taking turns in seeking knowledge (1/93) 89, and Muslim, Book of Divorce (4/188) 3764.",
    "book_id": "1073",
    "new_page_number": 62
  },
  {
    "serial_number": "7544666",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 65,
    "volume_number": 1,
    "text": "the Messenger or to those of authority among them, then the ones who [can] draw correct conclusions from it would have known it}. So I was the one who drew that conclusion.' (1). Sheikh Al-Sa'di says commenting on the verse: 'This is a discipline from Allah to His servants regarding this inappropriate action of theirs. And that they should, when a matter of importance and public interest comes to them regarding security and the joy of believers, or regarding fear that involves a calamity upon them, they should verify and not hasten to spread that news. Rather, they should refer it to the Messenger, peace and blessings be upon him, and to those of authority among them—people of opinion, knowledge, advice, intellect, and composure, who know matters and know benefits and their opposites. If they see that spreading it contains a benefit and encouragement for believers, and joy for them, and caution against their enemies; they do it. And if they see that there is no benefit in it, or there is a benefit but its harm exceeds its benefit; they do not spread it. For this reason He said: {then the ones who [can] draw correct conclusions from it would have known it}. Meaning: They extract it with their sound thoughts and rational views and their guided sciences. In this is evidence for a moral rule, which is that if research occurs in a matter, it should be assigned to one who is qualified for it and left to its people, and one should not advance...",
    "foot_note": "1. See: Tafsir Ibn Kathir / Dar Al-Fikr - (1/655).",
    "book_id": "1073",
    "new_page_number": 63
  },
  {
    "serial_number": "7544667",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 66,
    "volume_number": 1,
    "text": "before them, for that is closer to correctness and more conducive to safety from error. It also contains a prohibition against haste and rushing to publish matters upon hearing them, and a command to contemplate before speaking and looking into it: is it a benefit, so one proceeds with it, or not, so one refrains from it' (1). It is upon the scholars of the nation and its students of knowledge to root for the general public in general and the youth in particular the obligation of restraining the tongue during trials, and the necessity of verification and clarification when news arrives, and referring it to those of authority and expertise as the All-Wise, All-Aware guided us, especially in the era of globalization and the rapid spread of information. Requirement Three: 'Take what you know and leave what you deny (dislike), and leave the affairs of the public, and stick to your private self.' Whoever contemplates this part of the Hadith sees that the Messenger of Allah, peace and blessings be upon him, commanded Abdullah bin Amr upon the corruption of the times, the scarcity of the righteous and their departure, and the lightness of covenants and their loss—as mentioned in the introduction—with two commands: First: (Take what you know, and leave what you deny). In this phrase of the Hadith...",
    "foot_note": "1. Tafsir Al-Sa'di (190).",
    "book_id": "1073",
    "new_page_number": 64
  },
  {
    "serial_number": "7544668",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 67,
    "volume_number": 1,
    "text": "...is advice that outlines for the individual the optimal method of reception in a time like the one whose description the Messenger of Allah, peace and blessings be upon him, mentioned. Al-Munawi says in the explanation of the Hadith: '(And take what you know) of the matter of religion: meaning stick to doing what you know to be truth from your conditions that benefit you in this world and the hereafter. (And leave) abandon (what you deny) of the people's affairs that contradict the Sharia, and look at Allah's arrangement in them with your heart, for He divided their characters among them just as He divided their provisions among them. Had He willed, He would have gathered them on one character. So do not neglect looking at His management, the Exalted, in them. If you see a sin, praise Allah that He diverted it from you, and be gentle in enjoining and forbidding with kindness, patience, and tranquility. If it is accepted from you, praise Allah; otherwise, seek His forgiveness for your shortcoming' (1). Second: (And leave the affairs of the public, and stick to your private self): The Messenger of Allah, peace and blessings be upon him, outlines for the believer in this section the stance of the believer regarding such a society where corruption and lack of integrity have become widespread. Scholars have interpretations for the Hadith: First: Imam Al-Khattabi sees that what is meant by 'private' (Khassah) in this Hadith is what concerns the human being in himself regarding helping his family, managing his relatives, and attending...",
    "foot_note": "1. Fayd Al-Qadir 1/353.",
    "book_id": "1073",
    "new_page_number": 65
  },
  {
    "serial_number": "7544669",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 68,
    "volume_number": 1,
    "text": "...to them, and striving for their interests. This direction is considered related to worldly interests. As for 'leaving the public' - according to him - it means abandoning exposure to their affairs, engaging in their politics, seeking leadership over them, and mediating in their matters (1). If the Hadith is interpreted with this meaning, the person becomes required to limit himself from the world and from mixing with its people to what is necessary for managing his livelihood and the livelihood of those he supports. Second: That 'private' (Khassah) refers to a person's companions, sincere friends, and intimates, because he singles them out for affection and sincere friendship. The poet said: 'Indeed, a man has singled me out deliberately with his affection... despite the distance, for which I am not ungrateful' (2). Al-Azhari said: The 'Khassah' is the one whom you have singled out for yourself (3). According to this meaning, the intent of the Hadith is commanding the compliant person to care for the affairs of the elite among his companions, sincere friends, and those he loves for the sake of Allah...",
    "foot_note": "1. Al-Uzlah wa Al-Khultah: 74 - 75.\n2. Taj Al-Arus 4/387, attributed to Abu Zubayd. See: Al-Qamus: 2/313.\n3. Tahdhib Al-Lughah: 6/552.",
    "book_id": "1073",
    "new_page_number": 66
  },
  {
    "serial_number": "7544670",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 69,
    "volume_number": 1,
    "text": "...and caring for the righteousness of their religious and worldly affairs, accompanying them, and leaving the affairs of the public. Third: (And stick to the private matter of yourself) meaning use it in what is legislated and restrain it from what is prohibited, stick to your own affair, stick to your religion, leave people alone and do not follow them (1). It is said: Strive for your salvation, and do not perish with those who perish. As came from some scholars who said: A person should not be deceived by the path of evil even if those walking it are many, nor should he abstain from the path of good even if those walking it are few. The wonder is not at those who perished how they perished, but rather the wonder is at those who were saved how they were saved, because those perishing are many (2). There is no impediment to interpreting the Hadith according to all mentioned interpretations as there is no contradiction between them. During the consolidation of Fitnah, a person should turn to the salvation and righteousness of himself, establishing the religious and worldly affairs of his family, and reforming the condition of his companions and loved ones whom he influences and who influence him. And Allah knows best.",
    "foot_note": "1. Previous reference.\n2. Sharh Sunan Abi Dawood by Abdul Muhsin Al-Abbad (2/100).",
    "book_id": "1073",
    "new_page_number": 67
  },
  {
    "serial_number": "7544671",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 70,
    "volume_number": 1,
    "text": "This applies in the situation where the description mentioned in the Hadiths fits, which is of two types: First: That it occurs in a specific time, in a specific place of the land of Islam; this is possible to occur in every era. Second: That it occurs encompassing the entire earth, in a complete manner. This is what is preferred to be just before the Hour, where no command or prohibition is of benefit. So the believers characterized by the traits of the Victorious Group are commanded to concern themselves with rectifying their private condition and leave the affair of the public until the command of Allah comes. And Allah knows best (1). There is no evidence in the foregoing for the dropping of a ritual from the rituals of religion, the ritual of Enjoining Good and Forbidding Evil. Rather, Enjoining Good and Forbidding Evil is a communal obligation (Fard Kifaya); if some people perform it, the burden falls from the rest. If everyone abandons it, everyone who was capable of it without excuse or fear sins. Furthermore, it may become an individual obligation (Fard Ayn), such as when it is in a place where only he knows of it, or no one can remove it except him, and like one who sees his wife, child, or servant upon a wrong or...",
    "foot_note": "1. Mawqif Al-Muslim min Al-Fitan by Al-Hazimi (451).",
    "book_id": "1073",
    "new_page_number": 68
  },
  {
    "serial_number": "7544672",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 71,
    "volume_number": 1,
    "text": "...negligence in a right (1). However, there are some cases where Enjoining Good and Forbidding Evil with the hand and tongue drops, but denying with the heart does not drop in any case: 1 / That his speech is not accepted, nor benefited from: If the believer strongly assumes there is no benefit in his enjoining and forbidding, the obligation of enjoining and forbidding drops from him. Rather, it remains recommended for him; so that the voice of Sharia remains heard and declared, reminding people that it stands and has not died. Imam Al-Ghazali says regarding this meaning: 'If he knows that his denial is useless, but he does not fear harm, then accountability (Hisbah) is not obligatory upon him due to its lack of benefit, but it is recommended to manifest the rituals of Islam and remind people of the matter of religion' (2). Confirming this meaning is the Hadith of Abdullah bin Amr, the subject of research, and what came from Umayyah Al-Sha'bani who said: I asked Abu Tha'labah Al-Khushani, saying: O Abu...",
    "foot_note": "1. Sharh Al-Nawawi 'ala Muslim - (2/23), Al-Amr bil-Ma'ruf wa Al-Nahy 'an Al-Munkar by Sulaiman Al-Huqail (55), Al-Amr bil-Ma'ruf by Khalid Al-Sabt (100).\n2. Ihya' Ulum Al-Din (2/280). See also Al-Amr bil-Ma'ruf by Al-Huqail (72), Al-Amr bil-Ma'ruf wa Al-Nahy 'an Al-Munkar by Al-Sabt (116).",
    "book_id": "1073",
    "new_page_number": 69
  },
  {
    "serial_number": "7544673",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 72,
    "volume_number": 1,
    "text": "Tha'labah, what do you say regarding this verse: {Take care of your own selves} (1). He said: By Allah, I asked one who is well-informed about it; I asked the Messenger of Allah, peace and blessings be upon him, about it. He said: 'Nay, enjoin one another to do good and forbid one another from evil, until you see stinginess obeyed (2), desires followed, the worldly life preferred (3), and everyone with an opinion impressed by his own opinion. Then upon you is - meaning yourself - and leave the common people. For indeed, ahead of you are days of patience; patience in them is like holding onto a hot coal. For the worker among them is a reward like that of fifty men working like his work' (4).",
    "foot_note": "1. Al-Ma'idah: 105.\n2. Meaning: Avarice that is obeyed such that your self obeys it and others comply with it. Stated by Al-Qari. Awn Al-Ma'bud (11/332).\n3. Which refers to wealth and status in the lowly abode (preferred): meaning chosen over matters of religion. Awn Al-Ma'bud (11/332).\n4. Narrated by Abu Dawood (4/215), Al-Tirmidhi (5/257), Ibn Majah (2/1330), Abu Amr Al-Dani in Al-Sunan Al-Waridah fi Al-Fitan (3/641, 642, 644), Al-Qasim bin Salam in Al-Nasikh wa Al-Mansukh (1/455), Al-Bukhari in Khalq Af'al Al-Ibad (1/64), Ibn Abi Al-Dunya in Al-Amr bil-Ma'ruf wa Al-Nahy 'an Al-Munkar (1/3) and in Al-Uqubat (1/11), Ibn Abi Asim in Al-Zuhd (1/133), Al-Marwazi in Al-Sunnah (1/14), Al-Tahawi in Sharh Mushkil Al-Athar (3/136), Al-Tabari in his Tafsir (11/146), Ibn Abi Hatim in his Tafsir (5/127), Ibn Hibban (2/108), Al-Tabarani in Al-Kabir (16/92), Al-Hakim (4/358), Abu Nu'aym in Al-Hilyah (2/30), Al-Bayhaqi in Al-Kubra (10/91), in Shu'ab Al-Iman (6/83) (7/127), and in Al-Adab (1/90), Ibn Abd Al-Barr in Al-Tamhid (24/316), Al-Baghawi in Tafsir (3/110), Ibn Asakir in Tarikh Dimashq (64/39), (64/40), and Abdul Ghani Al-Maqdisi in Al-Amr bil-Ma'ruf (1/13) (1/22). Al-Tirmidhi said: A Hasan Gharib Hadith. I have reservations about it, for Amr bin Jariyah and Abu Umayyah were not declared trustworthy by any of the early Imams except Ibn Hibban in Al-Thiqat (9758, 6233), and he is lenient in declaring trustworthiness as is known among scholars. Therefore, Al-Hafiz did not declare them trustworthy in 'Al-Taqrib', but said regarding each: 'Acceptable' meaning when corroborated, otherwise soft in Hadith as stated in the 'Introduction' of 'Al-Taqrib' (Translation Numbers: 4997, 7947). Al-Albani said in Mishkat Al-Masabih (3/115): Weak, but has some corroborating evidence, and he discussed its weakness at length in Al-Silsilah Al-Da'ifah (3/94) 1025.",
    "book_id": "1073",
    "new_page_number": 70
  },
  {
    "serial_number": "7544674",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 73,
    "volume_number": 1,
    "text": "It has been narrated from a group of Companions regarding the Almighty's saying: {Take care of your own selves, it will not harm you who has gone astray if you are guided}; they said its interpretation has not come yet, its interpretation is only at the end of time (1). A person should not understand from the verse that if he is guided, the misguidance of others does not harm him if they stray, or that Enjoining Good and Forbidding Evil is not obligatory. However, the Hadith of Abu Bakr, may Allah be pleased with him, clarified the truth when he stood up, praised Allah Mighty and Majestic and extolled Him, then said: 'O people, you recite this verse: {O you who have believed, take care of your own selves, it will not harm you who has gone astray if you are guided} to the end of the verse - and you place it in the wrong place. And indeed I heard...",
    "foot_note": "1. See: Tafsir Al-Tabari (11/138), Tafsir Al-Qurtubi (6/342), Fath Al-Qadir (2/85), Jami' Al-Ulum wa Al-Hikam (1/323).",
    "book_id": "1073",
    "new_page_number": 71
  },
  {
    "serial_number": "7544675",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 74,
    "volume_number": 1,
    "text": "...the Messenger of Allah, peace and blessings be upon him, say: Indeed, if people see evil and do not change it, Allah is about to encompass them with His punishment (1).' So he clarified that this [verse's application] is after a person enjoins and forbids. It does not mean he abandons enjoining and forbidding, but rather if he performs what is upon him, then at that point the misguidance of those who stray does not harm him if he is guided. As for abandoning enjoining and forbidding and sufficing with being guided oneself, this is not correct (2), or the verse is carried upon a time that has not yet come as many Companions interpreted it. 2 - If harm befalls the Enjoiner of Good and Forbidder of Evil. If a recognized harm (makruh) befalls the Muslim due to Enjoining Good and Forbidding Evil, harming him in his self, wealth, or status (3), the obligation drops from him. This is indicated by the Hadith of Abu Sa'id al-Khudri who said: I heard the Messenger of Allah, peace and blessings be upon him, say: 'Indeed, Allah will question the servant on the Day of Resurrection until He says: What prevented you when you saw evil from denying it? So when Allah prompts the servant with his argument, he says: O Lord, I hoped in You and feared the people.' (4).",
    "foot_note": "1. Narrated by Ahmad (1/5), Ibn Hibban (1/539). Shu'aib Al-Arna'ut said: Its chain is authentic on the condition of the Two Sheikhs.\n2. Sharh Sunan Abi Dawood, Abdul Muhsin Al-Abbad (2/101).\n3. Professor Khalid bin Uthman Al-Sabt elaborated in his book (Al-Amr bil-Ma'ruf wa Al-Nahy 'an Al-Munkar) on the definition of legally recognized harm and its controls; refer to it for he has provided benefit and excellence (118-124).\n4. Narrated by Ibn Majah in Al-Sunan (2/1322) 4017, Abd bin Hamid in his Musnad (1/301), and Abu Ya'la in his Musnad (2/499). Declared Sahih by Al-Albani in Sahih Sunan Ibn Majah and Al-Sahihah (3/3) 929.",
    "book_id": "1073",
    "new_page_number": 72
  },
  {
    "serial_number": "7544676",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 75,
    "volume_number": 1,
    "text": "3 - That Enjoining Good and Forbidding Evil results in the occurrence of a corruption greater than that evil. In that case, enjoining and forbidding is abandoned. This is a general rule in Sharia about which Sheikh Al-Islam says: 'The sum of that falls under the \"General Rule\": regarding when interests and corruptions, and good deeds and bad deeds conflict or crowd one another; then the preponderant one must be preferred. When interests and corruptions crowd and conflict, then enjoining and forbidding, even if it entails acquiring an interest and repelling a corruption, one must look at what opposes it. If what is missed of interests or what occurs of corruptions is greater, it is not commanded, rather it becomes prohibited if its corruption is greater than its benefit. However, the consideration of the magnitudes of interests and corruptions is by the scale of Sharia. Whenever a person is able to follow the texts, he should not deviate from them; otherwise, he strives with his opinion to know the similars and parallels. It is rare that texts are lacking for one who is expert in them and their indications regarding rulings. Based on this, if a person or a group combines good and evil such that they do not separate between them, but either do them both or leave them...",
    "foot_note": "None",
    "book_id": "1073",
    "new_page_number": 73
  },
  {
    "serial_number": "7544677",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 76,
    "volume_number": 1,
    "text": "...both: it is not permissible to command them with the good nor forbid them from the evil. It is considered: if the good is greater, it is commanded; even if it necessitates what is less than it of evil, and evil is not forbidden if it necessitates missing a good greater than it. Rather, forbidding in that case would be blocking the path of Allah and striving for the cessation of His obedience and the obedience of His Messenger and the cessation of good deeds. If the evil is predominant, it is forbidden; even if it necessitates missing what is less than it of good. Commanding that good which necessitates the evil that exceeds it would be commanding evil and striving in disobedience to Allah and His Messenger. If the inseparable good and evil are equal, they are neither commanded nor forbidden. So sometimes commanding is appropriate, sometimes forbidding is appropriate, and sometimes neither commanding nor forbidding is appropriate where the good and evil are inseparable; and that is in specific occurrences' (1). Evidence from the Sunnah indicates this rule, such as the Prophet, peace and blessings be upon him, leaving Abdullah bin Ubayy the Hypocrite (2), expecting greater harm to Islam...",
    "foot_note": "1. Majmu' Al-Fatawa by Ibn Taymiyyah (28/129).\n2. That was when this hypocrite said: 'If we return to Medina, the more honored will surely expel therefrom the more humbled.' This reached the Prophet, peace and blessings be upon him, so Umar stood up and said: 'O Messenger of Allah, let me strike the neck of this hypocrite.' The Prophet, peace and blessings be upon him, said: (Leave him, let not the people talk that Muhammad kills his companions). Narrated by Al-Bukhari, Book of Tafsir, Chapter of Surah Al-Munafiqun (4/1861) 4622, and Muslim, Book of Virtue, Enjoining Good Manners... (8/19) 6748.",
    "book_id": "1073",
    "new_page_number": 74
  },
  {
    "serial_number": "7544678",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 77,
    "volume_number": 1,
    "text": "...from his continued existence (killing him), and likewise leaving the alteration of the House (Kaaba) and placing it upon the foundations of Ibrahim, peace be upon him (1), and others. Ibn Al-Qayyim says (2): 'The Prophet, peace and blessings be upon him, legislated for his nation the obligation of denying evil, so that by its denial, the good that Allah and His Messenger love is obtained. If denying the evil necessitates what is more evil than it and more hated to Allah and His Messenger, then denying it is not permissible, even if Allah hates it and despises its people. This is like denying [the actions of] kings and rulers by rebelling against them, for it is the basis of every evil and trial until the end of time... The Prophet, peace and blessings be upon him, said: \"Whoever sees from his commander something he hates, let him be patient, and let him not withdraw a hand from obedience.\" Whoever contemplates what has befallen Islam during major and minor trials sees it stemming from the neglect of this principle, and lack of patience with an evil, seeking its removal, which then generated what was greater than it. The Messenger of Allah, peace and blessings be upon him, used to see the greatest evils in Mecca, and he could not change them. Indeed, when Allah opened Mecca...",
    "foot_note": "1. As came in Al-Bukhari, Book of Knowledge / Chapter: Leaving some choices for fear that some people's understanding will fall short and they will fall into something more severe (1/59) 126 from the hadith of Aisha, may Allah be pleased with her, who said: The Prophet, peace and blessings be upon him, said to me: (O Aisha, were it not that your people are new to - Ibn Al-Zubayr said - disbelief, I would have demolished the Kaaba and made two doors for it, a door for people to enter and a door for them to exit). So Ibn Al-Zubayr did it. Similar in Muslim, Book of Hajj (4/98) 3308.\n2. I'lam Al-Muwaqqi'in (3/3).",
    "book_id": "1073",
    "new_page_number": 75
  },
  {
    "serial_number": "7544679",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 78,
    "volume_number": 1,
    "text": "...and it became an abode of Islam, he resolved to change the House and return it to the foundations of Ibrahim. But he was prevented from that, despite his ability to do it, out of fear of the occurrence of something greater than it, due to Quraysh's intolerance of that because of their recent closeness to Islam and being new to leaving disbelief. For this reason, he did not permit denying rulers by hand (force) because of what results from it of the occurrence of what is greater than it. Denying evil has four degrees: First: That it disappears and is replaced by its opposite. Second: That it decreases even if it doesn't disappear entirely. Third: That it is replaced by what is equal to it. Fourth: That it is replaced by what is more evil than it. The first two degrees are legislated, the third is a matter of Ijtihad (judgment), and the fourth is prohibited.'",
    "foot_note": "1. [*] (Al-Shamela comment): This page was missing from the printed version, and it is established in the electronic original sent to us by the author, may Allah reward her with good.",
    "book_id": "1073",
    "new_page_number": 76
  },
  {
    "serial_number": "7544680",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 79,
    "volume_number": 1,
    "text": "Conclusion. Praise be to Allah, abundant, good, and blessed praise as befits the majesty of His Face and the greatness of His Authority. To Him belongs praise in the first and the last. To proceed: This is what Allah has bestowed upon me after this blessed scientific journey through which I learned about the Muslim's stance on Fitnah (trials) in light of the Hadith of Abdullah bin Amr - may Allah be pleased with him - and I concluded with these results and recommendations. Important Results: • Fitnahs are divided into three sections: Section One: Divided by type into: Fitnah of Doubts (Shubuhat), and Fitnah of Desires (Shahawat). Section Two: Divided by time into: Trials of Life, and Trials of Death. Section Three: Divided by size into: Small trials, and great major trials.",
    "foot_note": "None",
    "book_id": "1073",
    "new_page_number": 77
  },
  {
    "serial_number": "7544681",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 80,
    "volume_number": 1,
    "text": "• Authenticity of the Hadith of Abdullah bin Amr regarding Fitnah, and the addition of Hilal is singular/odd (Shadh) in the Hadith of Abdullah bin Amr as Al-Albani said, may Allah have mercy on him, and Allah knows best. • The practical steps recommended by the Prophet to avoid Fitnah through the Hadith of Abdullah bin Amr. • Mixing cannot be preferred over Isolation absolutely nor the reverse. Therefore, many scholars interpreted the Hadiths of isolation as applying to isolation during times of Fitnah and wars, or for one from whom people are not safe, or who cannot suffer them, or similar specific cases; as for normal conditions where there is no general Fitnah, the principle is that the Muslim who is able to mix encounters people, is patient with their harm, and delivers religious and worldly benefit to them is better than the one who does not mix with them and is not patient with their harm, but rather isolates himself from their evils and remains alone. • The true Muslim is the one who is extremely cautious regarding his tongue; because he will be held accountable for every word, indeed every utterance he speaks. • The impact of the tongue in Fitnah is more severe than the blow of the sword. • Enjoining Good and Forbidding Evil with the hand and tongue drops in...",
    "foot_note": "None",
    "book_id": "1073",
    "new_page_number": 78
  },
  {
    "serial_number": "7544682",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 81,
    "volume_number": 1,
    "text": "...certain cases, unlike denial with the heart, for it does not drop in any case. • The degrees of denying evil are four: First: That it disappears and is replaced by its opposite. Second: That it decreases even if it doesn't disappear entirely. Third: That it is replaced by what is equal to it. Fourth: That it is replaced by what is more evil than it. The first two degrees are legislated, the third is a matter of Ijtihad, and the fourth is prohibited. Important Recommendations: • Publishing the [correct] stance of the Muslim in times of Fitnah globally, through Islamic initiatives to hold conferences, adopted by specialized entities. • The community cadres undertaking the spread of the culture of what a Muslim must do in times of Fitnah, each according to their specialization and field. • Intensifying the [teaching of the] Muslim's stance on Fitnah in media and education.",
    "foot_note": "None",
    "book_id": "1073",
    "new_page_number": 79
  },
  {
    "serial_number": "7544683",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Muslim's Stance on Trials in Light of the Hadith of Abdullah bin Amr - may Allah be pleased with him",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 82,
    "volume_number": 1,
    "text": "• Activating the role of Imams and preachers regarding clarifying the correct Muslim methodology in times of Fitnah, and giving them Sharia courses on this subject. • Emphasizing the Muslim methodology in receiving and broadcasting news through specialized scientific courses adopting a contemporary presentation of the Salafi methodology. This is what the effort of one with little could encompass, what the pen yielded, and time allowed. Whatever is correct in it is from Allah alone, and whatever is error or deficiency is from me and Satan, and Allah and His Messenger are innocent of it. I seek forgiveness from Allah for it, for that is the way of Allah with the children of Adam. I do not claim perfection, for it is an attribute of the Great, the Exalted; deficiency, shortcoming, and difference of viewpoints are attributes of the human race. It suffices me that I expended my effort and placed a brick on the path of one who wants to complete the building. That is only by the success of Allah. I ask the Almighty Lord to benefit me with it, and benefit all Muslims with it. Indeed, He is capable of all things, and worthy of answering.",
    "foot_note": "None",
    "book_id": "1073",
    "new_page_number": 80
  }
]