[
  {
    "text": "Ease and Tolerance in Islam\nAuthor: فالح بن محمد بن فالح الصغير\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Ease and Tolerance in Islam",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 1
  },
  {
    "text": "sn: 8287\nbook_title: اليسر والسماحة في الإسلام\nbook_link: https://shamela.ws/book/1138\nbook_id: 1138\nauthor_name: فالح بن محمد بن فالح الصغير\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/346\nauthor_ID: 346\neditor: Null\npublisher: الكتاب منشور على موقع وزارة الأوقاف السعودية بدون بيانات\nedition: Null\npages: 59\nvolumes: Null\npagination: [الكتاب مرقم آليا غير موافق للمطبوع]\ncategory: كتب عامة\ncategory_id: 39",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Ease and Tolerance in Islam",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 2
  },
  {
    "serial_number": "7501750",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: General Books\nBook: Ease and Tolerance in Islam\nAuthor: Falih bin Muhammad Al-Saghir\nNumber of pages (Paper Book): 47 [Book numbering is automatic, not matching the printed version]\nNumber of pages: 59\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "1138",
    "new_page_number": 3
  },
  {
    "serial_number": "7501751",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 1,
    "volume_number": 1,
    "text": "Ease and Tolerance in Islam\nPrepared by Prof. Dr. Falih bin Muhammad Al-Saghir\nCollege of Usul al-Din - Imam University\nIn the name of Allah, the Most Gracious, the Most Merciful\n\nIntroduction\nPraise be to Allah, and peace and blessings be upon the Messenger of Allah, and upon his family and companions until the Day of Judgment. To proceed:\nIslam is the religion that Allah Almighty chose for His servants, since He created the first creation, Adam, peace be upon him. Allah Almighty says: {Indeed, the religion in the sight of Allah is Islam} (1). And He also says: {And whoever desires other than Islam as religion - never will it be accepted from him} (2). He made for this religion one central axis until the Day of Resurrection, which is His Oneness (Tawhid), Glory be to Him and Exalted is He. This is the axis to which the prophets and messengers called their peoples and followers. He, the Exalted, says: {And We certainly sent into every nation a messenger, [saying], \"Worship Allah and avoid Taghut\"} (3). And He says: {And I did not create the jinn and mankind except to worship Me} (4).",
    "foot_note": "1. (1) Surah Al Imran, Verse: 19.\n2. Surah Al Imran, Verse: 85.\n3. Surah An-Nahl, Verse: 36.\n4. Surah Adh-Dhariyat, Verse: 56.",
    "book_id": "1138",
    "new_page_number": 4
  },
  {
    "serial_number": "7501752",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 2,
    "volume_number": 1,
    "text": "However, the rulings of this religion differed from one message to another, and those rulings were limited to specific peoples and individuals in specific times and places. The rulings of any message do not last for a long time after the death of its prophet, for distortion and alteration quickly befall them, corrupting Tawhid among people, and sins and injustices become widespread, until Allah Almighty sends another prophet to renew the religion for people and return them to the Oneness of Allah and His guidance. This was the way (Sunnah) of Allah Almighty in previous nations. Until Allah Almighty sent His last messenger, peace be upon him, with the last message. This message came for all Jinn and mankind, white and black, Arab and non-Arab. It is the message that carried two new contents: Mercy and Universality, due to His saying: {And We have not sent you, [O Muhammad], except as a mercy to the worlds} (1).",
    "foot_note": "1. (1) Surah Al-Anbiya, Verse: 107.",
    "book_id": "1138",
    "new_page_number": 5
  },
  {
    "serial_number": "7501753",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 3,
    "volume_number": 1,
    "text": "This global religion addressing all people, of all ethnicities and spectrums, in all corners of the earth, must be characterized by qualities and characteristics suitable for people's conditions and circumstances in different countries of the world. Thus, it came carrying ease and breadth in its rulings and legislations. There is no obligatory duty or ritual except that Allah Almighty has bestowed upon it an ease that makes a person capable of applying it and performing it in the manner Allah Almighty and His Messenger, peace be upon him, wanted. For He, Mighty and Majestic, never burdens a soul beyond its capacity: {Allah does not charge a soul except [with that within] its capacity. It will have [the consequence of] what [good] it has gained, and it will bear [the consequence of] what [evil] it has earned} (1).",
    "foot_note": "1. (1) Surah Al-Baqarah, Verse: 286.",
    "book_id": "1138",
    "new_page_number": 6
  },
  {
    "serial_number": "7501754",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 4,
    "volume_number": 1,
    "text": "This reality becomes clearer to us in the message of Islam when comparing the hardship and difficulty that previous nations were under with the ease and facility that the Nation of Islam is upon. Allah Almighty says: {Those who follow the Messenger, the unlettered prophet, whom they find written in what they have of the Torah and the Gospel, who enjoins upon them what is right and forbids them what is wrong and makes lawful for them the good things and prohibits for them the evil and relieves them of their burden and the shackles which were upon them. So they who have believed in him, honored him, supported him and followed the light which was sent down with him - it is those who will be the successful} (1).",
    "foot_note": "1. (1) Surah Al-A'raf, Verse: 157.",
    "book_id": "1138",
    "new_page_number": 7
  },
  {
    "serial_number": "7501755",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 5,
    "volume_number": 1,
    "text": "Allah Almighty has lightened for His servants the shackles and burdens that accompanied their laws, weighing down their shoulders and making their lives difficult. This is a great favor from Allah Almighty to this nation. This was not a casual matter, but rather for a wisdom known to Allah, intended for His servants in line with their nature (Fitrah) and to help them in performing their obediences and worships, and consequently achieving their interests in all their affairs. Every ruling or legislation carries with it an interest for people in their selves, wealth, children, and others. If we want to delve into the depths of the principle of facilitation and tolerance in the religion of Allah Almighty, we will find ourselves before a vast sea of evidence, texts, and events that affirm this principle and urge Muslims to adopt and follow it. Therefore, we will talk about this great Islamic principle through some of the landmarks where it appeared clearly and evidently with some brevity, as required by the context; since this research was written at the request of: (The International Conference on Islam's Stance on Terrorism) sponsored by Imam Muhammad bin Saud Islamic University in Riyadh. The elements of the research are:\n- The Concept of Ease.\n- The Islamic Religion is based on Ease and Tolerance.\n- The Foundations of the Approach of Ease in Islamic Sharia.",
    "foot_note": "None",
    "book_id": "1138",
    "new_page_number": 8
  },
  {
    "serial_number": "7501756",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 6,
    "volume_number": 1,
    "text": "- Areas of Facilitation and Tolerance in Islam.\n- Legal Maxims Derived from Texts Mentioning Facilitation.\n- Effects of Straying from the Approach of Facilitation.\n- Research Summary.\nI ask Allah Almighty to make this beneficial, and may peace and blessings be upon our Prophet Muhammad and upon all his family and companions.\nWritten by Falih bin Muhammad bin Falih Al-Saghir\nRiyadh 1424 AH\nP.O. Box 41961 Riyadh 11531\nfalehmalsgair@yahoo.com",
    "foot_note": "None",
    "book_id": "1138",
    "new_page_number": 9
  },
  {
    "serial_number": "7501757",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 7,
    "volume_number": 1,
    "text": "The Concept of Ease\n'Yusr' (Ease) linguistically: The opposite of hardship ('Usr'). From it is \"Religion is 'yusr' (easy)\" meaning easy, tolerant, with little strictness (1).\nAs for terminologically: It is the application of legal rulings in a moderate manner as they came in the Book of Allah and the Sunnah of His Prophet, peace be upon him, without strictness that prohibits the lawful, nor laxity that permits the forbidden.\nIncluded under this name are tolerance (Samahah), breadth (Sa'ah), removal of hardship (Raf' al-Haraj), and other terms that carry the same meaning.\nWe will discuss ease and tolerance in light of the following elements:",
    "foot_note": "1. (1) Al-Mu'jam Al-Wasit, entry: Yusr 2/1078.",
    "book_id": "1138",
    "new_page_number": 10
  },
  {
    "serial_number": "7501758",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 8,
    "volume_number": 1,
    "text": "First - The Islamic Religion is Based on Ease and Tolerance\nThe Islamic religion in its entirety is based on ease and the removal of hardship, starting from Creed (Aqeedah) and ending with the smallest matters of rulings and worships, in a way that aligns with human nature and is accepted by the human soul without affectation or stubbornness. This is what Allah Almighty pointed to in many places in His Noble Book, including His saying: {and has not placed upon you in the religion any difficulty} (1), and His saying: {Allah intends for you ease and does not intend for you hardship} (2), and His saying, Mighty and Majestic: {Allah wants to lighten for you [your difficulties]; and mankind was created weak} (3).\nFollowing these noble verses, the Prophetic Sunnah came with many hadiths carrying meanings of ease in matters of religion and lack of extremism and strictness in worship and obedience. The Prophet, peace be upon him, indicated that one of the most important features distinguishing the message of Islam from previous divine messages is tolerance and ease, as in his saying, peace be upon him: «Religion is very easy and whoever overburdens himself in his religion will not be able to continue in that way. So you should not be extremists, but try to be near to perfection and receive the good tidings that you will be rewarded; and gain strength by worshipping in the mornings, the afternoons, and during the last hours of the nights» (4).",
    "foot_note": "1. (1) Surah Al-Hajj, Verse: 78.\n2. Surah Al-Baqarah, Verse: 185.\n3. Surah An-Nisa, Verse: 28.\n4. Sahih Al-Bukhari, number 39, pp. 9-10.",
    "book_id": "1138",
    "new_page_number": 11
  },
  {
    "serial_number": "7501759",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 9,
    "volume_number": 1,
    "text": "Anyone contemplating the Prophetic biography (Seerah) will find that the behavior of the Prophet, peace be upon him, and his dealings with his companions are built on the methodology of facilitation and tolerance. The evidence is more than can be counted, but we suffice with narrating an incident that happened to one of the companions who came to the Messenger, peace be upon him, wanting a way out for it while he was a poor companion not owning his daily sustenance. It dispenses with mentioning all the embarrassments that used to happen to the companions. Abu Huraira, may Allah be pleased with him, says: «While we were sitting with the Prophet (peace be upon him), a man came and said, \"O Allah's Messenger! I have been ruined.\" Allah's Messenger (peace be upon him) asked, \"What is the matter with you?\" He replied \"I had sexual intercourse with my wife while I was fasting.\" Allah's Messenger (peace be upon him) asked, \"Can you afford to manumit a slave?\" He replied in the negative. Allah's Messenger (peace be upon him) asked, \"Can you fast for two successive months?\" He replied in the negative. The Prophet (peace be upon him) asked, \"Can you afford to feed sixty poor persons?\" He replied in the negative. The Prophet (peace be upon him) kept silent (for a while) and while we were in that state, a big basket full of dates was brought to the Prophet (peace be upon him). He asked, \"Where is the questioner?\" He replied, \"I (am here).\" The Prophet (peace be upon him) said, \"Take this and give it in charity.\" The man said, \"Am I to give it to one who is poorer than I, O Allah's Messenger? By Allah, there is no poorer family between its two labbahs (i.e., the two lava plains of Medina) than mine.\" The Prophet (peace be upon him) smiled till his canine teeth became visible and then said, \"Feed your family with it.\"» (1).",
    "foot_note": "1. (1) Sahih Al-Bukhari, number 1936, p. 311. Narrated by Muslim in his Sahih, number 2595, p. 453.",
    "book_id": "1138",
    "new_page_number": 12
  },
  {
    "serial_number": "7501760",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 10,
    "volume_number": 1,
    "text": "1 - Concession (Rukhsa)\n'Rukhsa' in language: Facilitation and easing, or ease and facility. 'Rukhs' is the opposite of high cost ('Ghala'). Someone 'yatarakh-khas' in a matter if he does not investigate thoroughly. It is transitive with Hamza and doubling (1).\nAs for terminologically, Al-Baydawi defined it as: \"The ruling established contrary to the evidence due to an excuse\" (2).\nRukhsa is a great rule among the rules of this religion as it includes all matters and aspects of religion in Creed, Worship, Transactions, Penalties, and others. It is a grant and charity from Allah Almighty to His servants, as the Prophet, peace be upon him, said: «It is a charity which Allah has bestowed upon you, so accept His charity» (3). Rukhsa can be described as one of the most important landmarks of ease in this religion, and that Allah Almighty only permitted it to lighten the burden of some obligations for His servants, and excuse them from what they cannot bear. Therefore, it is recommended to take this grant and act upon it in places of permissibility. The Prophet, peace be upon him, says: «Allah loves that His concessions be taken as He dislikes that His disobedience be committed» (4). Reference can be made to some of these concessions that Allah and His Messenger, peace be upon him, clarified for the nation through the following examples:",
    "foot_note": "1. (1) Al-Misbah Al-Munir 1/304. Al-Qamus Al-Muhit 2/304.\n2. Nihayat Al-Sul 1/87.\n3. Sahih Muslim, number 1573, p. 279.\n4. Musnad Ahmad, number 5873, p. 453. Its narrators are trustworthy.",
    "book_id": "1138",
    "new_page_number": 13
  },
  {
    "serial_number": "7501761",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 11,
    "volume_number": 1,
    "text": "a - Concession in Travel: This is by shortening the four-unit obligatory prayers, and combining the Zuhr and Asr prayers, as well as Maghrib and Isha prayers, either by advancing (Jam' Taqdim) or delaying (Jam' Ta'khir). Also, breaking the fast during it, due to His saying: {So whoever among you is ill or on a journey - then an equal number of days [are to be made up]} (1). And his saying, peace be upon him: «It is not righteousness to fast on a journey» (2).\nb - Dry Ablution (Tayammum) with dust when water is not available or when its use is impossible, due to His saying: {But if you are ill or on a journey or one of you comes from the place of relieving himself or you have contacted women and do not find water, then seek clean earth and wipe over your faces and hands with it. Allah does not intend to make difficulty for you, but He intends to purify you and complete His favor upon you that you may be grateful} (3).\nc - Concession in Menstruation and Postpartum Bleeding: These are excuses for prayer, fasting, touching the Mushaf, and Tawaf for women.",
    "foot_note": "1. (1) Surah Al-Baqarah, Verse: 184.\n2. Sahih Al-Bukhari, number 1946, p. 313. Narrated by Muslim in his Sahih, number 2612, p. 456.\n3. Surah Al-Ma'idah, Verse: 6.",
    "book_id": "1138",
    "new_page_number": 14
  },
  {
    "serial_number": "7501762",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 12,
    "volume_number": 1,
    "text": "2 - The Original State of Things is Permissibility\nOne of the most important pillars upon which the methodology of facilitation in Islam is based is that the origin in things is lawfulness and permissibility, not prevention and prohibition. Everything created in this universe is subjected for humans and prepared for their enjoyment, as long as there is no explicit prohibition. Allah Almighty says: {And He has subjected to you whatever is in the heavens and whatever is on the earth - all from Him} (1). Since the Lawgiver has clarified that, no one has the right to forbid this permissible thing, for by doing so he enters the scope of extremism and obstinacy which is forbidden. For this reason, the divine warning came against forbidding permissible matters or permitting the forbidden. Such questioning was a cause for taking people out of the true religion and bringing Allah's wrath upon them, as happened to some previous nations. Allah Almighty says: {O you who have believed, do not ask about things which, if they are shown to you, will distress you. But if you ask about them while the Qur'an is being revealed, they will be shown to you. Allah has pardoned that which is past; and Allah is Forgiving and Forbearing} {A people asked about them before you; then they became therein disbelievers} (2).",
    "foot_note": "1. (1) Surah Al-Jathiya, Verse: 13.\n2. Surah Al-Ma'idah, Verses: 101, 102.",
    "book_id": "1138",
    "new_page_number": 15
  },
  {
    "serial_number": "7501763",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 13,
    "volume_number": 1,
    "text": "The Prophet, peace be upon him, says: «The greatest sinner of the Muslims amongst Muslims is one who asked about a certain thing which had not been prohibited, and it was prohibited because of his asking» (1).",
    "foot_note": "1. (1) Sahih Al-Bukhari, number 7289, p. 1254. Narrated by Muslim in his Sahih, number 6116, p. 103.",
    "book_id": "1138",
    "new_page_number": 16
  },
  {
    "serial_number": "7501764",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 14,
    "volume_number": 1,
    "text": "3 - Mistake, Forgetfulness, and Compulsion\nThe tolerance of Islam appears in its compatibility with the sound human nature created within man. Part of this nature is the mistake that man falls into in most of his conditions unintentionally, as well as the forgetfulness that befalls him. This is what Allah Almighty mentioned on the tongue of the believers who said: {Our Lord, do not impose blame upon us if we have forgotten or erred}. Allah Almighty said: \"I have done so\" (1).\nAs for compulsion, it is a matter beyond human will. Not every human can bear the harm, damage, or threat of killing or cutting of a limb etc. that he might be exposed to. In that case, the Lawgiver permitted him to concede some of his religious concepts to escape the state he is suffering and the torture befalling him, as happened to Ammar bin Yasir, may Allah be pleased with them both, when he mentioned the gods of Quraish with good and spoke ill of the Messenger of Allah, peace be upon him, under the pressure of torture, and his parents were killed before his eyes. He complained about that to the Messenger of Allah, peace be upon him, so the Messenger, peace be upon him, said to him: «(How do you find your heart?), he said: At peace with faith. The Prophet, peace be upon him, said: (If they return, then return)» (2).",
    "foot_note": "1. (1) Sahih Muslim, number 330, p. 67.\n2. Narrated by Al-Hakim in Al-Mustadrak 2/357. Mentioned by Ibn Hajar in Al-Fath from Abd bin Hamid via Ibn Sirin and said: It is Mursal and its narrators are trustworthy, and he mentioned other Mursal narrations with this meaning then said: These Mursal narrations strengthen each other.",
    "book_id": "1138",
    "new_page_number": 17
  },
  {
    "serial_number": "7501765",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 15,
    "volume_number": 1,
    "text": "This is nothing but mercy towards the servants and easing upon them, because mistake and forgetfulness are natural matters from which no one is safe. As for compulsion, it is because endurance strength varies from one person to another. For this reason, this divine legislation came in this facilitated form suitable for people's natures and instincts.",
    "foot_note": "None",
    "book_id": "1138",
    "new_page_number": 18
  },
  {
    "serial_number": "7501766",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 16,
    "volume_number": 1,
    "text": "4 - Prohibition of Extremism in Religion\nThe religion of Allah Almighty carries happiness and justice for people in its application, not misery and torment. The person who takes this religion as Allah Almighty wanted, with moderation, understanding, and awareness, attains happiness and salvation in this world and the Hereafter. As for the one who goes to extremes in it and is strict where strictness is not placed, and prohibits the lawful and permissible, he attains misery and torment in this world and the Hereafter. Our Lord, Mighty and Majestic, refers to this meaning at the beginning of Surah Taha saying: {Ta, Ha.} {We have not sent down to you the Qur'an that you be distressed} (1).\nThe Prophet, peace be upon him, says: «Ruined are those who indulge in hair-splitting (extremism)» he said it three times (2). The hair-splitters (Mutanatti'un), as interpreted by Al-Nawawi, may Allah have mercy on him: Those who go too deep and are strict in places where strictness is not appropriate (3).",
    "foot_note": "1. (1) Surah Taha, Verses: 1, 2.\n2. Sahih Muslim, number 6784, p. 1162.\n3. Riyad As-Salihin, p. 54, Chapter: Moderation in Worship.",
    "book_id": "1138",
    "new_page_number": 19
  },
  {
    "serial_number": "7501767",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 17,
    "volume_number": 1,
    "text": "The acceptance of obedience is not linked to the extent of fatigue and toil, because Allah Almighty does not like to be obeyed by other than what He revealed to His servants. He who worships Allah night and day in a manner contrary to the methodology of Allah Almighty, his worship is not accepted no matter how much he tires and exhausts himself. Allah Almighty is in no need of the servants' deeds, but He - Exalted is His affair - rejoices when He sees His servants upon His upright religion. The Mother of Believers Aisha, may Allah be pleased with her, says: «The Prophet (peace be upon him) came in when a woman was sitting with me. He said, \"Who is this?\" I said, \"She is so-and-so,\" and I mentioned her (excessive) prayers. He said, \"Do not do that! You should do only that which you can do, for by Allah, Allah does not get tired (of giving reward) but you get tired,\" and the most beloved religion (deeds) to him was that in which its doer persists» (1). Anas bin Malik, may Allah be pleased with him, says: «The Prophet (peace be upon him) entered the mosque and saw a rope hanging between two pillars. He said, \"What is this rope?\" The people said, \"This rope is for Zainab who, when she feels tired, holds it (to keep standing for the prayer.)\" The Prophet (peace be upon him) said, \"Don't use it. Remove the rope. You should pray as long as you feel active, and when you get tired, sit down\"» (2).",
    "foot_note": "1. (1) Narrated by Al-Bukhari, number 43, p. 10. Narrated by Muslim in his Sahih, number 1834, pp. 318-319.\n2. Sahih Al-Bukhari, number 1150, p. 184. Narrated by Muslim in his Sahih, number 1831, p. 318.",
    "book_id": "1138",
    "new_page_number": 20
  },
  {
    "serial_number": "7501768",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 18,
    "volume_number": 1,
    "text": "5 - Repentance (Tawbah)\nRepentance is one of the solid foundations upon which the methodology of facilitation in Islam rests. It is a cause for the believer's steadfastness and remaining upon the religion of Allah Almighty, as it removes from his shoulders the worries of sins and the burdens of violations, and pushes him to always work towards the better. Allah Almighty says: {Say, \"O My servants who have transgressed against themselves [by sinning], do not despair of the mercy of Allah. Indeed, Allah forgives all sins. Indeed, it is He who is the Forgiving, the Merciful.\"} (1). Repentance is a cause for Allah's love for the human when he turns back to Him after disobeying Him, and regrets his action: {Indeed, Allah loves those who are constantly repentant and loves those who purify themselves} (2). This meaning is supported by his saying, peace be upon him: «Allah is more pleased with the repentance of His servant than anyone of you is with finding his lost animal» (3).",
    "foot_note": "1. (1) Surah Az-Zumar, Verse: 53.\n2. Surah Al-Baqarah, Verse: 222.\n3. Sahih Muslim, number 6953, p. 1189.",
    "book_id": "1138",
    "new_page_number": 21
  },
  {
    "serial_number": "7501769",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 19,
    "volume_number": 1,
    "text": "A person should not deem it too much to repent to his Lord if he disobeys, or struggle with himself and enter it into the swamps of obsessive whispering (Waswas) if his hands commit a sin or his eye falls upon a transgression, by saying: 'Allah Almighty will not forgive me after this.' This is a major sin, a corrupt belief, and thinking ill of Allah, Exalted is His affair. It is one of Satan's doors to prevent him from returning to his Lord again and doing good deeds. The Prophet, peace be upon him, says: «By Him in Whose Hand is my life, if you were not to commit sin, Allah would simply eliminate you and would substitute you with a people who would commit sin and ask forgiveness from Allah, and He would forgive them» (1). And he, peace be upon him, says: «Every son of Adam sins, and the best of the sinners are the repentant» (2). From the ease, breadth, and mercy of this religion is that Allah Almighty made good deeds expiations for the sins of the sons of Adam, due to His saying: {Except for those who repent, believe and do righteous work. For them Allah will replace their evil deeds with good. And ever is Allah Forgiving and Merciful} (3). And his saying, peace be upon him, to Abu Dharr, may Allah be pleased with him: «Fear Allah wherever you are, follow a bad deed with a good deed and it will wipe it out, and behave well towards the people» (4).",
    "foot_note": "1. (1) Sahih Muslim, number 6965, p. 1191.\n2. Sunan Ibn Majah, number 4251, p. 619. Narrated by Al-Tirmidhi in his Jami', number 2499, pp. 568-569. Its narrators are trustworthy except Zaid bin Hubab, about whom Imam Ahmad said: Truthful, makes many mistakes.\n3. Surah Al-Furqan, Verse: 70.\n4. Jami' Al-Tirmidhi, number 1987, p. 460. Al-Tirmidhi said: Hasan Sahih hadith.",
    "book_id": "1138",
    "new_page_number": 22
  },
  {
    "serial_number": "7501770",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 20,
    "volume_number": 1,
    "text": "Many hadiths have been reported clarifying deeds that expiate bad deeds and reduce them, and raise ranks and increase status with Allah Almighty. We mention some of them:\na - Ablution (Wudu), for it expiates the Muslim's sins and misdeeds as long as major sins are avoided, due to his saying, peace be upon him: «He who performed ablution well, his sins would come out from his body, even coming out from under his nails» (1).\nb - The five daily prayers and Friday prayer to the next Friday prayer, as well as fasting Ramadan; all of them expiate the sins of the son of Adam and raise his ranks and status with Allah Almighty. The Prophet, peace be upon him, says: «The five daily (prayers) and the Friday (prayer) to the Friday (prayer) and Ramadan to Ramadan are expiations for what is between them if major sins are avoided» (2). From Abu Qatadah Al-Ansari, may Allah be pleased with him, «The Messenger of Allah (peace be upon him) was asked about fasting on the day of Arafah. He said, 'It expiates the sins of the previous year and of the coming year.' He was asked about fasting on the day of Ashura. He said, 'It expiates the sins of the previous year'» (3).\nc - Every trial and calamity a Muslim is afflicted with is an expiation for him, due to his saying, peace be upon him: «No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a Muslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for that» (4).",
    "foot_note": "1. (1) Sahih Muslim, number 578, p. 121.\n2. Sahih Muslim, number 552, p. 117.\n3. Sahih Muslim, number 2747, p. 477.\n4. Sahih Al-Bukhari, number 5641, p. 999. Narrated by Muslim similarly, number 6568, p. 1128.",
    "book_id": "1138",
    "new_page_number": 23
  },
  {
    "serial_number": "7501771",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 21,
    "volume_number": 1,
    "text": "1 - In Creed (Aqeedah)\nThe Islamic religion is distinguished from other religions and creeds by the clarity of its creed and the ease of faith in Allah Almighty. It commanded people to worship Allah alone, that He is the One God who neither begot nor was born, and there is none co-equal or comparable to Him. In His hand is the dominion of the heavens and the earth, there is no deity worthy of worship except Him, and there is no mediation between servants and their Creator, nor partners with Him. The Islamic creed contains no puzzles known only to a group of rabbis and monks, nor does it have ambiguity and obscurity as in other creeds like splitting the One into three. It does not insult the human mind by worshipping stones, persons, and animals as in Buddhism and others. Rather, it is a creed of utmost ease and tolerance, understood by the Bedouin living in the desert when he said: The droppings indicate the camel, and the footprint indicates walking. So a dark night, and a sky with constellations, do they not indicate the One, the Subduer? Or as he said.",
    "foot_note": "None",
    "book_id": "1138",
    "new_page_number": 24
  },
  {
    "serial_number": "7501772",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 22,
    "volume_number": 1,
    "text": "It is known that ambiguity and lack of understanding in creed put a person in embarrassment and distress, and cause him to fall into misguidance and polytheism (Shirk). He does not know his Lord with sound knowledge, nor does he know the way to reach Him except through intermediaries, whether humans, stones, or wood. So he takes a corrupt conception about Allah Almighty, contaminating his deeds with this conception, and they scatter in the air as dispersed dust, as Allah Almighty said: {And We will regard what they have done of deeds and make them as dust dispersed} (1). This is regarding the overall creedal conception, and it is likewise in the details of creed such as the six pillars of faith.",
    "foot_note": "1. (1) Surah Al-Furqan, Verse: 23.",
    "book_id": "1138",
    "new_page_number": 25
  },
  {
    "serial_number": "7501773",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 23,
    "volume_number": 1,
    "text": "2 - In Acts of Worship (Ibadat)\nThe principle of ease and tolerance appears clearly in acts of worship more than any other aspect of religion, as they are apparent behavior. All acts of worship are based on this principle which Allah Almighty bestowed upon this nation over other nations, both obligatory and voluntary ones. The Prophet, peace be upon him, says: «Do only that which you can do, for by Allah, Allah does not get tired (of giving reward) but you get tired» (1). We can point out some of these manifestations in the following acts of worship:\na - In Purification (Taharah):",
    "foot_note": "1. (1) Sahih Al-Bukhari, number 43, p. 10. Narrated by Muslim in his Sahih, number 1834, pp. 318-319.",
    "book_id": "1138",
    "new_page_number": 26
  },
  {
    "serial_number": "7501774",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 24,
    "volume_number": 1,
    "text": "The principle of ease and tolerance appears clearly in purification because it is the gateway to acts of worship. Ease in it is necessary because a Muslim performs ablution five times a day and night, and bathes from sexual impurity (Janabah) as well, and is exposed to some impurities here and there. Strictness in purification puts him in distress and embarrassment and makes his self weary of worship itself, let alone purification, as is the case with many who suffer from obsessive-compulsive disorder (Waswasah) during ablution, purification, or when some impurities fall on clothes, etc. This is what the Prophet, peace be upon him, forbade. It is part of the tolerance and ease of this religion, and a favor from Allah Almighty to His servants so they rush towards obedience and performing worships in the required manner. He, peace be upon him, says regarding the purity of water: «Water is not made impure by anything except what overcomes its smell, taste, and color» (1). And he, peace be upon him, says about sea water: «Its water is purifying and its dead (animals) are lawful» (2). The ease of this religion in purification is evident from the story of the Bedouin who urinated in the mosque, so the people got up to beat him. The Messenger of Allah, peace be upon him, said to them: «Leave him and pour a bucket or a tumbler of water over his urine, for you have been sent to make things easy and not to make them difficult» (3).",
    "foot_note": "1. (1) Sunan Ibn Majah, number 521, p. 74. Narrated similarly by Al-Tirmidhi, number 66, p. 18, and said: Hasan hadith.\n2. Sunan Abu Dawood, number 86, p. 23. Narrated by Al-Tirmidhi, number 69, p. 19. Said: Hasan Sahih hadith.\n3. Sahih Al-Bukhari, number 220, p. 41. The story is narrated by Muslim in his Sahih, number 661, p. 133.",
    "book_id": "1138",
    "new_page_number": 27
  },
  {
    "serial_number": "7501775",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 25,
    "volume_number": 1,
    "text": "Also from ease in purification is that if dirt sticks to shoes, wiping them on the ground purifies them, due to his saying, peace be upon him: «When one of you comes to the mosque, he should look: if he sees filth or dirt on his sandals, he should wipe it off and pray in them» (1). From the ease of this religion in purification is that impurity falling on clothes is removed with water. This is a great ease when compared to what the Children of Israel were upon before, where they were required to cut off the part of the clothing affected by impurity. We cannot enumerate all forms of ease and tolerance in purification in this context.\nb - In Dry Ablution (Tayammum): From the ease in this religion is that if a Muslim does not find water to perform ablution with, or has a disease or wound preventing him from performing ablution with water, he may perform Tayammum with dust, as a favor from Allah Almighty and a facilitation for him, due to His saying: {But if you are ill or on a journey or one of you comes from the place of relieving himself or you have contacted women and do not find water, then seek clean earth and wipe over your faces and hands with it. Allah does not intend to make difficulty for you, but He intends to purify you and complete His favor upon you that you may be grateful} (2).",
    "foot_note": "1. (1) Sunan Abu Dawood, number 650, p. 104. Its narrators are trustworthy.\n2. Surah Al-Ma'idah, Verse: 6.",
    "book_id": "1138",
    "new_page_number": 28
  },
  {
    "serial_number": "7501776",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 26,
    "volume_number": 1,
    "text": "Unlike previous laws where prayer was not accepted without purification with water. Confirmation of this matter came in the Prophetic Sunnah in his saying, peace be upon him: «I have been given five things which were not given to anyone else before me: I have been helped by terror (in the hearts of enemies) spanning the distance of a month's journey. The earth has been made for me (and for my followers) a place for praying and a thing to perform Tayammum, therefore anyone of my followers can pray wherever the time of a prayer is due. The booty has been made lawful for me yet it was not lawful for anyone else before me. I have been given the right of intercession. Every Prophet used to be sent to his nation only but I have been sent to all mankind» (1).\nc - In Prayer (Salah): Some forms of facilitation in prayer can be clarified through the following points:\n- Its obligation is five times a day and night, so it does not take a long time, nor does it distract a person from performing his daily work. Rather, they are meetings with Allah Almighty in which the believer renews the covenant with his Lord for obedience, uprightness, and righteousness. Fifty prayers were initially obligated during the Ascension (Mi'raj) of the Prophet, peace be upon him, then they became five prayers with the reward of fifty prayers, and in that is tolerance and mercy.",
    "foot_note": "1. (1) Sahih Al-Bukhari, number 335, p. 58. Narrated by Muslim in his Sahih, number 1163, p. 212.",
    "book_id": "1138",
    "new_page_number": 29
  },
  {
    "serial_number": "7501777",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 27,
    "volume_number": 1,
    "text": "- Legitimacy of combining and shortening prayers during travel, rain, or illness, due to the circumstances a person experiences in these cases such as lack of water, cold, fear of the road, or increased illness. Therefore, Islam made prayer in a different form suitable for these circumstances, permitting him to combine and shorten, where four-unit prayers are shortened to two units only. From Jabir bin Abdullah, may Allah be pleased with him, said: «The Messenger of Allah (peace be upon him) stayed in Tabuk for twenty days shortening the prayer» (1).\nThe mode and manner of prayer also change in case of fear during war, attack by a predator, flood, or similar, and its matter is facilitated and shortened, due to the benefit for Muslims and protection for them from their enemy who might betray them during prayer. This prayer is called the Fear Prayer. He Almighty said: {And when you travel throughout the land, there is no blame upon you for shortening the prayer, [especially] if you fear that those who disbelieve may disrupt [or attack] you. Indeed, the disbelievers are ever to you a clear enemy} (2). Then the following verse mentioned how to perform this prayer in two batches.",
    "foot_note": "1. (1) Musnad Ahmad, number 14186, p. 990. Narrated by Abu Dawood in his Sunan, number 1235, pp. 183-184, and said: Others besides Ma'mar narrate it as Mursal not Musnad.\n2. Surah An-Nisa, Verse: 101.",
    "book_id": "1138",
    "new_page_number": 30
  },
  {
    "serial_number": "7501778",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 28,
    "volume_number": 1,
    "text": "There are many hadiths and evidences regarding shortening the prayer due to the existence of circumstances that make it difficult to perform these prayers as in normal conditions.\n- Permissibility of praying in any place on earth, whereas it was not permissible for previous nations except in temples and monasteries. The Prophet, peace be upon him, says: «I have been given five things which were not given to anyone else before me: I have been helped by terror (in the hearts of enemies) spanning the distance of a month's journey. The earth has been made for me (and for my followers) a place for praying and a thing to perform Tayammum, therefore anyone of my followers can pray wherever the time of a prayer is due. The booty has been made lawful for me yet it was not lawful for anyone else before me. I have been given the right of intercession. Every Prophet used to be sent to his nation only but I have been sent to all mankind» (1).",
    "foot_note": "1. (1) Sahih Al-Bukhari, number 335, p. 58. Narrated by Muslim in his Sahih, number 1163, p. 212.",
    "book_id": "1138",
    "new_page_number": 31
  },
  {
    "serial_number": "7501779",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 29,
    "volume_number": 1,
    "text": "- Lightening the prayer and not elongating it, because congregational prayer gathers the young, the old, and the sick, so this should be considered. This is what the Messenger, peace be upon him, warned his companions about. Jabir bin Abdullah Al-Ansari, may Allah be pleased with him, says: «A man came with two camels used for watering and the night had fallen. He found Mu'adh praying so he made his camel kneel and joined Mu'adh, but the latter recited Surah Al-Baqarah or Surah An-Nisa, so the man left the prayer and went away. When he learned that Mu'adh had criticized him, he went to the Prophet (peace be upon him) and complained against Mu'adh. The Prophet (peace be upon him) said, \"O Mu'adh! Are you putting the people to trial?\" Thrice. \"It would have been better if you had recited 'Sabbih Isma Rabbika-l-A'la' (87), Wash-Shamsi wadh-uhaha (91), or Wal-Laili idha yaghsha (92), for the old, the weak and the needy pray behind you.\"» (1). The Prophet, peace be upon him, says: «I stand for prayer intending to prolong it, but on hearing the cries of a child, I shorten it, as I dislike to trouble his mother» (2).\n- Prayer is lifted from menstruating women and those with postpartum bleeding, and is not made up after purification. This is ease and kindness towards women, as they suffer pain and blood during menstruation and postpartum periods, making prayer difficult, and the period may be long making make-up difficult. So divine mercy came to the woman with this facilitation, and she was not asked to make up those missed prayers.",
    "foot_note": "1. (1) Sahih Al-Bukhari, number 705, p. 115. Narrated by Muslim in his Sahih, number 1040, p. 194.\n2. Sahih Al-Bukhari, number 707, p. 116. Narrated by Muslim in his Sahih, number 1056, p. 196.",
    "book_id": "1138",
    "new_page_number": 32
  },
  {
    "serial_number": "7501780",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 30,
    "volume_number": 1,
    "text": "- The legitimacy of Prostration of Forgetfulness (Sujud al-Sahw) to mend defects that occur in prayer, and repeating it was not requested.\nAll this ease and tolerance came in the second pillar of Islam after the two testimonies, which is Prayer, the greatest practical deed. In this is a great witness and clear proof of the ease and tolerance of this religion in worship.\nd - In Zakat:\nThe manifestations of ease and facilitation in performing the obligation of Zakat are evident through the following matters:\n- It did not apply to all properties, real estate, and funds, but was limited to certain categories such as: grazing livestock, gold and silver (currency), crops, and trade goods.\n- Then it is stipulated in the categories where Zakat is obligatory that they reach the Nisab (minimum amount). For silver it is two hundred dirhams, for gold twenty mithqals, for grazing camels five, for cows thirty, for sheep forty, and for grains, crops, and fruits five Awsuq. Many hadiths have clarified this.\n- Also from the ease of Islam in performing this obligation is that it made paying Zakat only once a year, after a lunar year passes over it.\n- From that is that the amount of money obligated to be paid for Zakat is very small relative to the money on which Zakat is obligatory, such that it does not affect it much, nor is its owner affected by that.",
    "foot_note": "None",
    "book_id": "1138",
    "new_page_number": 33
  },
  {
    "serial_number": "7501781",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 31,
    "volume_number": 1,
    "text": "This is in addition to how Islam deals with Zakat on crops, where it obligated one-tenth on those irrigated by rain water, and half of one-tenth on those irrigated by waterwheels and wells, due to his saying, peace be upon him: «A tenth is payable on what is watered by rivers, or rains, or springs, and half a tenth on what is watered by camels» (1). Such conditions and descriptions for Zakat make the owner of wealth rush to pay the Zakat of his wealth willingly, without boredom, weariness, or heaviness.\ne - In Fasting:\nSome forms of facilitation in the obligation of fasting can be listed by clarifying the following points:\n- That fasting was not obligated except in one month of the year, which is the month of Ramadan, due to His saying: {[Fasting for] a limited number of days} (2). This is facilitation and breadth in the time of this obligation; the believer can perform it acceptably without hardship or difficulty.\n- That the time of fasting is from dawn to sunset, and it is not permissible to exceed this time. For this reason, continuous fasting (Wisal), which is connecting the fast of two or three consecutive days, was forbidden due to the hardship and distress on the soul and danger to the human it entails. The Prophet, peace be upon him, says: «Do not practice Al-Wisal» (3) meaning in fasting.",
    "foot_note": "1. (1) Sahih Al-Bukhari, number 1483, p. 241.\n2. Surah Al-Baqarah, Verse: 184.\n3. Musnad Ahmad, number 11619, p. 820. Its narrators are trustworthy.",
    "book_id": "1138",
    "new_page_number": 34
  },
  {
    "serial_number": "7501782",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 32,
    "volume_number": 1,
    "text": "- Whoever breaks the fast by mistake or forgetfully completes his fast, and there is no blame on him, for Allah has fed him and given him drink. The Prophet, peace be upon him, says: «If one eats forgetfully while he is fasting, let him complete his fast, for it is Allah Who has fed him and given him drink» (1).\n- Permissibility of breaking the fast during travel or illness, due to His saying: {The month of Ramadhan [is that] in which was revealed the Qur'an, a guidance for the people and clear proofs of guidance and criterion. So whoever sights [the new moon of] the month, let him fast it; and whoever is ill or on a journey - then an equal number of other days. Allah intends for you ease and does not intend for you hardship and [wants] for you to complete the period and to glorify Allah for that [to] which He has guided you; and perhaps you will be grateful} (2).\n- That whoever cannot fast makes it up or feeds (the poor) if he cannot make it up.\n\nf - In Hajj:\nForms of tolerance in Hajj are evident through the following points:\n- Capability in provision and mount, and that he has no debt or other financial obligation from others' rights, due to His saying: {And [due] to Allah from the people is a pilgrimage to the House - for whoever is able to find thereto a way} (3).",
    "foot_note": "1. (1) Sahih Al-Bukhari, number 6669, p. 1151-152. Narrated by Muslim in his Sahih, number 2716, p. 471.\n2. Surah Al-Baqarah, Verse: 185.\n3. Surah Al Imran, Verse: 97.",
    "book_id": "1138",
    "new_page_number": 35
  },
  {
    "serial_number": "7501783",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 33,
    "volume_number": 1,
    "text": "- It is obligatory once in a lifetime, because it involves hardship and trouble, so it is difficult for the believer to perform it every year. Abu Huraira, may Allah be pleased with him, says: «The Messenger of Allah (peace be upon him) addressed us and said: 'O people, Allah has made Hajj obligatory for you; so perform Hajj.' A man said: 'Every year, O Messenger of Allah?' He kept silent until he said it three times. Then the Messenger of Allah (peace be upon him) said: 'If I had said \"yes\", it would have become obligatory and you would not have been able to do it.' Then he said: 'Leave me as I have left you, for those who came before you were destroyed because of their excessive questioning and their disagreement with their prophets. So when I command you to do something, do it as much as you can, and if I forbid you from doing something, leave it'» (1).\n- Choosing between the three rites: Tamattu', Qiran, and Ifrad.\n- Choosing the order between the three actions on the Day of Eid: Throwing pebbles (Ramy), Shaving (Halq), and Circumambulation (Tawaf). This eases things for the pilgrim who suffers from the crowd of people, transportation, and travels. Ibn Abbas, may Allah be pleased with them, says: «A man said to the Prophet (peace be upon him), \"I performed Tawaf before Ramy.\" He replied, \"No harm.\" Another man said, \"I had my head shaved before slaughtering.\" He replied, \"No harm.\" Another man said, \"I slaughtered the animal before Ramy.\" He replied, \"No harm.\"» (2).",
    "foot_note": "1. (1) Sahih Muslim, number 3257, p. 564.\n2. Sahih Al-Bukhari, number 6666, p. 1151.",
    "book_id": "1138",
    "new_page_number": 36
  },
  {
    "serial_number": "7501784",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 34,
    "volume_number": 1,
    "text": "And Abdullah bin Amr bin Al-Aas, may Allah be pleased with them, says in Muslim's narration: «I did not see the Prophet (peace be upon him) being asked about anything on that day but he said: 'Do it and there is no harm'» (1).\n- Every defect in the obligations of Hajj done unintentionally is mended by a ransom (Fidyah), and his Hajj is valid if the shortcoming is from this aspect only.\n- From the ease and tolerance in this blessed pillar is that Allah Almighty made it a cause for the forgiveness of sins and misdeeds. The Prophet, peace be upon him, promised the pilgrim Paradise and that he returns like the day his mother gave birth to him, his record pure white free from sins and misdeeds: «Whoever performs Hajj to this House and does not approach his wife for sexual relations nor commits sins (while performing Hajj), he will come out as sinless as a newly born child» (2). And he also says: «The reward of Hajj Mabrur (the one accepted by Allah) is nothing except Paradise» (3).\nAllah Almighty made it one of the virtuous deeds following belief in Allah and Jihad in His cause. «The Prophet (peace be upon him) was asked, \"Which is the best deed?\" He said, \"To believe in Allah and His Apostle.\" He was then asked, \"Which is the next (in goodness)?\" He said, \"To participate in Jihad in Allah's Cause.\" He was then asked, \"Which is the next?\" He said, \"To perform Hajj Mabrur\"» (4).",
    "foot_note": "1. (1) Sahih Muslim, number 3163, p. 550.\n2. Sahih Al-Bukhari, number 1819, p. 293. Narrated by Muslim in his Sahih, number 3291, p. 569.\n3. Sahih Al-Bukhari, number 1773, p. 285. Narrated by Muslim in his Sahih, number 3289, p. 569.\n4. Sahih Al-Bukhari, number 1519, p. 247. Narrated by Muslim in his Sahih, number 248, pp. 51-52.",
    "book_id": "1138",
    "new_page_number": 37
  },
  {
    "serial_number": "7501785",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 35,
    "volume_number": 1,
    "text": "4 - In Transactions:\nEase in Islam was not limited to Creed (Aqidah) and Worship (Ibadah) but extended to transactions which occupy a wide area of practical human life. Trade, industry, agriculture, education, and others all fall under the umbrella of transactions. People are more prone to sins and offenses in transactions because their driving force is money, and the extent of money's influence on the human soul, nature, and behavior is well known. Therefore, Quranic and Prophetic texts followed one another in adopting ease and tolerance in transactions. He, peace and blessings be upon him, says: «May Allah have mercy on a man who is easy when he sells, when he buys, and when he demands his rights» (1). He also says: «Whoever cancels the sale of a Muslim, Allah will cancel his slip on the Day of Resurrection» (2). Some forms of ease in transactions can be clarified through the following points:",
    "foot_note": "1. (1) Sahih Al-Bukhari, No. 2076, p. 333. \n2. Sunan Ibn Majah, No. 2199, p. 315. Also narrated by Abu Dawood in his Sunan under No. 3460, p. 500. Its narrators are trustworthy.",
    "book_id": "1138",
    "new_page_number": 38
  },
  {
    "serial_number": "7501786",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 36,
    "volume_number": 1,
    "text": "A - In sales, Islam allowed the buyers and sellers the option (Khiyar) in a number of situations, such as when they are in the session of the sale, to remove the embarrassment that one of them might fall into, because great harm might occur if this contract is concluded. He, peace and blessings be upon him, says: «When two men conduct a sale, each one of them has the option as long as they have not separated and are together; or one of them gives the other the option, and if they agree on that, the sale becomes binding. And if they separate after conducting the sale and neither of them cancels the sale, the sale becomes binding» (1).\nB - Furthermore, this religion prohibited usury (Riba), which involves injustice to people and exploitation of their circumstances, and is a cause for the spread of obscene poverty and wealth, and a cause for planting hatred and grudges among members of the same society. So Allah prohibited usury and permitted the good loan (Qard Hasan). Allah Almighty says: {Allah destroys interest and gives increase for charities} (2). And He, Glorified be His Praise, says: {And lend to Allah a good loan} (3).\nC - This religion also prohibited hoarding food and goods and withholding them at a time when people's need for them is intense. He, peace and blessings be upon him, says: «No one hoards but a sinner» (4). And he, peace and blessings be upon him, says: «Whoever interferes in any of the prices of the Muslims to increase them against them, it is a right upon Allah, the Blessed and Exalted, to seat him in a great place of Fire on the Day of Resurrection» (5).",
    "foot_note": "1. (1) Sahih Al-Bukhari, No. 2112, p. 339. Narrated by Muslim in his Sahih under No. 3855, p. 664. \n2. Surah Al-Baqarah, Verse: 276. \n3. Surah Al-Muzzammil, Verse: 20. \n4. Sahih Muslim, No. 4123, p. 702. \n5. Musnad Imam Ahmad, No. 20579, p. 1487. Its narrators are trustworthy.",
    "book_id": "1138",
    "new_page_number": 39
  },
  {
    "serial_number": "7501787",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 37,
    "volume_number": 1,
    "text": "D - Ease towards the insolvent debtor: This is a great principle brought by Islam, out of mercy for his condition and appreciation for his harsh circumstances. It is a strong element of social solidarity among the members of the nation, making society a solid unit based on love, harmony, cooperation, and mutual compassion. This is a practical application of His Almighty's saying: {And if someone is in hardship, then [let there be] postponement until [a time of] ease. But if you give [from your right as] charity, then it is better for you, if you only knew} (1). This blessed principle of ease towards the insolvent debtor is missed by the contemporary world amidst this massive civilized development, and despite the existence of major international associations concerned with human affairs, freedoms, and rights. It is the commandment of the Messenger, peace and blessings be upon him, since fourteen centuries ago to his companions and the nation after them in his saying: «Whoever is pleased that Allah saves him from the distress of the Day of Resurrection, let him relieve an insolvent person or alleviate his debt» (2). And he, peace and blessings be upon him, says in the story of a man from previous nations who used to overlook insolvent people: «There was a merchant who used to lend to people. If he saw an insolvent person, he would say to his servants: Overlook him, perhaps Allah will overlook us. So Allah overlooked him» (3).",
    "foot_note": "1. (1) Surah Al-Baqarah, Verse: 280. \n2. Sahih Muslim, No. 4000, p. 684. \n3. Sahih Al-Bukhari, No. 2078, p. 333. Narrated by Muslim in his Sahih under No. 3997, p. 684.",
    "book_id": "1138",
    "new_page_number": 40
  },
  {
    "serial_number": "7501788",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 38,
    "volume_number": 1,
    "text": "5 - In Punishments:\nIslamic Sharia is distinguished from other laws and legislations in criminal legislation and establishing appropriate punishments for people's actions that harm lives, properties, honors, and others. The Sharia has bestowed upon these punishments colors of tolerance and ease, such that the human soul accepts them in all its conditions, and even demands them if such actions occur. We can clarify this tolerance and breadth through explaining only two punishments, which are:\nA - Punishment for killing a soul:\nKilling a soul without right is considered one of the biggest crimes and greatest sins in the sight of Allah Almighty. Allah Almighty says: {And do not kill the soul which Allah has forbidden, except by right. This has He instructed you that you may use reason} (1). Allah - the Exalted - has made killing a single soul tantamount to killing all people, and saving a soul tantamount to saving all people. Allah Almighty says: {Because of that, We decreed upon the Children of Israel that whoever kills a soul unless for a soul or for corruption [done] in the land - it is as if he had slain mankind entirely} (2). And he, peace and blessings be upon him, says: «The demise of the world is less significant to Allah than the killing of a Muslim man» (3).",
    "foot_note": "1. (1) Surah Al-An'am, Verse: 151. \n2. Surah Al-Ma'idah, Verse: 32. \n3. Sunan An-Nasa'i, No. 3992, p. 557. Narrated by At-Tirmidhi in his Jami' under No. 1395, p. 338, and Ibn Majah in his Sunan under No. 2619, p. 376. Its narrators are trustworthy.",
    "book_id": "1138",
    "new_page_number": 41
  },
  {
    "serial_number": "7501789",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 39,
    "volume_number": 1,
    "text": "So killing a soul is a heinous act and a great crime; it must have a punishment commensurate with this offense and act. Thus, Allah's judgment was life for life, as per His Almighty's saying: {And We ordained for them therein a life for a life, an eye for an eye, a nose for a nose, an ear for an ear, a tooth for a tooth, and for wounds is legal retribution} (1). The ease and tolerance of Islam in applying punishment to the killer appear through the following points:\n- No one is held accountable for the crime of another; meaning, only the killer himself is punished, and his family, relatives, and tribe have no part in his action or the application of punishment upon him, without arbitrariness or transgression. This is unlike what was in the days of ignorance (Jahiliyyah), where wars would break out, honors would be violated, and more than one man would be killed for one man, all because of a murder crime that happened to one of their members. As per His Almighty's saying: {And whoever is killed unjustly - We have given his heir authority, but let him not exceed limits in [the matter of] taking life. Indeed, he has been supported [by the law]} (2).",
    "foot_note": "1. (1) Surah Al-Ma'idah, Verse: 45. \n2. Surah Al-Isra, Verse: 33.",
    "book_id": "1138",
    "new_page_number": 42
  },
  {
    "serial_number": "7501790",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 40,
    "volume_number": 1,
    "text": "- It is from the ease and tolerance of Islam that it left the field open for the guardian of the victim and gave him the choice between one of three: Retribution (Qisas), Blood Money (Diyah), or Pardon. As per his saying, peace and blessings be upon him: «Whoever is afflicted with blood or injury (khabal means wounds), he has the choice between one of three: either to retaliate, take the blood money (Aql), or pardon. If he wants a fourth, hold his hands. If he does any of that [takes revenge after accepting blood money or pardoning], then transgresses afterwards and kills, for him is the Fire, abiding eternally therein forever» (1).\n- Also from the ease and tolerance of Islam before applying this punishment is that it entices the family of the victim with what is with Allah Almighty if they overlook the killer and pardon him. As per his saying, peace and blessings be upon him: «No man pardons but Allah increases him in honor, and charity does not decrease wealth, and no man pardons ever but Allah increases him in honor» (2).",
    "foot_note": "1. (1) Musnad Ahmad, No. 16489, p. 1164. Narrated by Ibn Majah in his Sunan under No. 2623, p. 277. Its narrators are trustworthy. \n2. Musnad Ahmad, No. 9641, p. 697. Narrated by At-Tirmidhi in his Jami' with this meaning under No. 2325. He said: A Hasan Sahih Hadith.",
    "book_id": "1138",
    "new_page_number": 43
  },
  {
    "serial_number": "7501791",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 41,
    "volume_number": 1,
    "text": "This was the way of the righteous predecessors from the Companions and Followers, may Allah be pleased with them. It was narrated that a man from Quraysh broke the tooth of a man from the Ansar, so he sought judgment against him from Muawiyah. The Qurashi said: 'This man knocked out my tooth.' Muawiyah said: 'Nay, we shall satisfy him.' But when the Ansari insisted, Muawiyah said: 'Deal with your companion.' Abu Ad-Darda was sitting there, so Abu Ad-Darda said: 'I heard the Messenger of Allah, peace and blessings be upon him, say: No Muslim suffers an injury in his body and gives it as charity [forgives] but Allah raises him a degree thereby and removes a sin from him.' The Ansari said: 'Did you hear this from the Messenger of Allah, peace and blessings be upon him?' He said: 'Yes, my ears heard it and my heart retained it.' Meaning he pardoned him (1).\n- From the tolerance and ease of Islam is that it stipulated for the permissibility of applying retribution the agreement of all blood guardians. If one is found among them who pardons the killer, even if it is a woman, the ruling is dropped, and retribution is prevented. Likewise, if among the blood guardians there is one who has not reached the age of discernment or is absent, his reaching maturity or return from absence is awaited to take his opinion. If he pardons the offender, the ruling is dropped. This might take years, and in that is wisdom; perhaps these guardians will forget their anger over their blood and the burden will lighten upon them, so pardon then becomes closer than retribution.",
    "foot_note": "1. (1) Musnad Ahmad, No. 28084, p. 2055. Narrated by At-Tirmidhi in his Jami' with this meaning under No. 1393, p. 337-338. He said: This is a Ghareeb (strange) Hadith; we do not know it except from this route.",
    "book_id": "1138",
    "new_page_number": 44
  },
  {
    "serial_number": "7501792",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 42,
    "volume_number": 1,
    "text": "B - Punishment for Adultery:\nThe crime of adultery is one of the moral crimes that corrupt families and societies, mix lineages, and spread grudges and hatred. Therefore, this crime was among the major sins for which Allah threatened the doer with painful punishment in this world and the Hereafter. As per His Almighty's saying: {Indeed, those who like that immorality should be spread [or publicized] among those who have believed will have a painful punishment in this world and the Hereafter. And Allah knows and you do not know} (1).\nThe punishment for the adulterer is stoning for the married (Muhsan) and lashes for the unmarried (non-Muhsan). In this, there is ease and tolerance, by proportionate punishment with the nature of the adulterer himself. The married adulterer has committed a greater crime than the non-married adulterer; therefore, his punishment came harsher and more severe, which is stoning.",
    "foot_note": "1. (1) Surah An-Nur, Verse: 19.",
    "book_id": "1138",
    "new_page_number": 45
  },
  {
    "serial_number": "7501793",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 43,
    "volume_number": 1,
    "text": "From the ease and tolerance of Islam in enforcing punishment on the adulterer is that it required the testimony of four persons to the indecency. This is by way of extra verification, avoiding the application of punishment, and so people do not attack the honors of others. Not only this, but it set a punishment for the one who slanders others and accuses them of adultery without bringing four witnesses; then he receives the punishment for slander (Qadhf). Allah Almighty says: {And those who accuse chaste women and then do not produce four witnesses - lash them with eighty lashes and do not accept from them testimony ever after. And those are the defiantly disobedient} (1).",
    "foot_note": "1. (1) Surah An-Nur, Verse: 4.",
    "book_id": "1138",
    "new_page_number": 46
  },
  {
    "serial_number": "7501794",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 44,
    "volume_number": 1,
    "text": "In order to establish this principle within the Ummah, the Messenger, peace and blessings be upon him, used to try to avoid applying the Hadd punishment for the adulterer, or find excuses for the one confessing to adultery hoping he might retract his confession. «A man came to the Messenger of Allah, peace and blessings be upon him, while he was in the mosque and called out to him saying: 'O Messenger of Allah, indeed I have committed adultery.' He turned away from him until he repeated it four times. When he testified against himself four times, the Prophet, peace and blessings be upon him, called him and said: 'Are you insane?' He said: 'No.' He said: 'Are you married (Muhsan)?' He said: 'Yes.' So the Prophet, peace and blessings be upon him, said: 'Take him and stone him.' Ibn Shihab said: One who heard Jabir bin Abdullah informed me saying: 'I was among those who stoned him. We stoned him at the Musalla (prayer place). When the stones hurt him, he fled, so we caught him at Al-Harrah and stoned him'» (1). Islam worked to reduce the occurrence of adultery and attempt to cover up the perpetrator, and that repentance takes place between him and Allah Almighty. The matter returns to Allah Almighty on the Day of Resurrection; if He wills, He punishes him, and if He wills, He pardons him.",
    "foot_note": "1. (1) Sahih Al-Bukhari, No. 7167, p. 1234. Narrated by Muslim in his Sahih under No. 4420, p. 750.",
    "book_id": "1138",
    "new_page_number": 47
  },
  {
    "serial_number": "7501795",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 45,
    "volume_number": 1,
    "text": "Fourth - Legal Maxims Derived from Texts Regarding Ease:\nScholars of Usul (Principles of Jurisprudence) derived some maxims from the texts concerning the tolerance and ease of Islam and made them landmarks for the science of Usul. We mention two fundamental maxims:\n1 - \"Hardship brings ease\" (1):\nThe meaning of this Usuli maxim is that rulings whose application results in difficulty for the accountable person (Mukallaf) and hardship upon himself or his wealth, the Sharia has permitted him not to perform them. This legal maxim relies on many evidences from the Book of Allah and the Sunnah of His Messenger, peace and blessings be upon him, which were referred to during the research (2), through clarifying the ease of Islam, its breadth, and its mercy towards servants in worship, transactions, granting licenses, and others. The hardship that permits doing the prohibited and brings ease is that which is beyond human capacity, so the human soul cannot bear it, and if a person undertakes it, he is exposed to harm and damage in the essentials of his life: self, wealth, mind, and honor. Other sub-maxims emerged from this Usuli maxim such as: \"If a matter narrows, it widens,\" or \"If a matter widens, it narrows\" (3) and others.\n2 - \"Necessities permit prohibitions\" (4):",
    "foot_note": "1. (1) See regarding this maxim and its details: Al-Ashbah wa Al-Naza'ir fi Qawa'id wa Furu' Fiqh Al-Shafi'iyyah, by Al-Suyuti, p. 76-82. And other books on Fiqh maxims. \n2. Among them, for example but not limited to, His Almighty's saying: {So whoever among you is ill or on a journey - then an equal number of other days} [Surah Al-Baqarah, Verse: 184] and his saying, peace and blessings be upon him, to the one asking him in Hajj about advancing a rite over another: «No harm [La Haraj]» and his saying, peace and blessings be upon him: «It is not righteousness to fast while traveling». \n3. See: Al-Ashbah wa Al-Naza'ir fi Qawa'id wa Furu' Fiqh Al-Shafi'iyyah, by Al-Suyuti, p. 83. \n4. See: Sharh Al-Qawa'id Al-Fiqhiyyah, by Ahmad Al-Zarqa, p. 131.",
    "book_id": "1138",
    "new_page_number": 48
  },
  {
    "serial_number": "7501796",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 46,
    "volume_number": 1,
    "text": "The basis on which this Usuli maxim relied is His Almighty's saying: {And He has explained to you in detail what He has forbidden to you, excepting that to which you are compelled} (1). Attached to this maxim is another maxim which serves as a control and restriction for it, which is: \"Necessities are estimated according to their extent\" (2). Meaning that the permissible part of doing prohibited acts is according to the person's need so that the harm threatening him is negated. He should not exceed this amount, otherwise he falls into sin. Like one approaching death from thirst; he is not allowed to drink wine beyond what quenches his thirst and saves him from death. If he does that [drinks more], he is a sinner and bears the burden of drinking wine.",
    "foot_note": "1. (1) Surah Al-An'am, Verse: 119. \n2. See: Sharh Al-Qawa'id Al-Fiqhiyyah, by Ahmad Al-Zarqa, p. 133-134.",
    "book_id": "1138",
    "new_page_number": 49
  },
  {
    "serial_number": "7501797",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 47,
    "volume_number": 1,
    "text": "Fifth - Effects of Straying from the Methodology of Ease:\nStraying from the methodology of ease has serious effects on the individual and society, including:\n1 - Burdening with what is unbearable:\nAny excessive strictness in applying the rulings and obligations of this religion, and any transgression of the line Allah - the Exalted - drew for His servants, will expose its owner to falling into difficulty and sin. The Messenger of Allah, peace and blessings be upon him, clarified this to those individuals who tried to burden themselves with what they could not bear. Anas bin Malik, may Allah be pleased with him, says: «A group of three men came to the houses of the wives of the Prophet, peace and blessings be upon him, asking how the Prophet, peace and blessings be upon him, worshipped. When they were informed about that, they considered their worship insufficient and said: \"Where are we from the Prophet, peace and blessings be upon him, as his past and future sins have been forgiven.\" Then one of them said: \"I will offer the prayer throughout the night forever.\" The other said: \"I will fast throughout the year and will not break my fast.\" The third said: \"I will keep away from women and will not marry forever.\" The Messenger of Allah, peace and blessings be upon him, came to them and said: \"Are you the same people who said so-and-so? By Allah, I am more submissive to Allah and more afraid of Him than you; yet I fast and break my fast, I do sleep and I also marry women. So he who does not follow my Sunnah in religion, is not from me (not one of my followers)» (1).",
    "foot_note": "1. (1) Sahih Al-Bukhari, No. 5063, p. 906. Narrated by Muslim in his Sahih under No. 3403, p. 586.",
    "book_id": "1138",
    "new_page_number": 50
  },
  {
    "serial_number": "7501798",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 48,
    "volume_number": 1,
    "text": "Human nature and instinct cannot bear persisting in actions that contradict this nature and instinct. Sleep is an instinct and instinctual need that a human must satisfy. One whose sleep decreases cannot perform his scientific, preaching, and livelihood activities during the day. Allah - the Exalted - mentioned that it is rest and slumber for humans in more than one place in His Dear Book: {And made your sleep [a means for] rest} (1). Likewise, marriage, through which life continues and human progeny increases, is a Sunnah from which a human cannot detach. Whoever wants to abstain from marriage contradicts his nature, contributes to the destruction of life, and violates the Law of Allah - the Exalted - who mandated the principle of marriage and encouraged it in many texts from the Book and the Prophetic Sunnah. The third matter indicated by the Hadith is abstaining from eating and continuous fasting. This is also a burden on the soul and a load incompatible with human nature and instinct, which leans towards enjoying the good things Allah brought out for His servants from this earth.",
    "foot_note": "1. (1) Surah An-Naba, Verse: 9.",
    "book_id": "1138",
    "new_page_number": 51
  },
  {
    "serial_number": "7501799",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 49,
    "volume_number": 1,
    "text": "To establish the principle of ease and tolerance in applying this religion, the Prophet, peace and blessings be upon him, rushed to bring these individuals and clarify the grave error they tried to fall into. He informed them afterwards that he, peace and blessings be upon him, is the most fearful of Allah and most pious towards Him, yet he does not neglect one thing at the expense of another. He sleeps and prays, marries women, fasts and breaks his fast. This is the moderation, tolerance, and breadth brought by this great religion.\n2 - Incorrect Understanding of This Religion:\nWhoever ignores the methodology of ease and tolerance in Islam develops a deficiency in understanding this religion, because he did not understand this religion as Allah - the Exalted - intended for His servants, and as His Messenger, peace and blessings be upon him, clarified to them. This incorrect understanding, over time, extends to dive into the entirety of religious matters and fields. It does not stop at some acts of worship or specific rulings, but penetrates inside until perceptions and ideas alien to the spirit of this religion are generated in its owner, and he invites people to them, thinking he is doing good.",
    "foot_note": "None",
    "book_id": "1138",
    "new_page_number": 52
  },
  {
    "serial_number": "7501800",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 50,
    "volume_number": 1,
    "text": "This was the state of many who renounced the world, abandoned good things, abstained from marriage, and left wealth and children, intending to devote themselves to worship and Da'wah. This led them into the misguidance of polytheism (Shirk) and the absurdities of Sufism, and they introduced into the religion rituals and innovations for which Allah sent down no authority. All of that was only due to their strictness and extremism which led to an incorrect understanding of this religion and a lack of realizing the methodology of ease and tolerance in it.\n3 - Negative Impact on Calling to Allah (Da'wah):\nThe human soul always leans towards tolerance and breadth in everything, and becomes impatient with hardship and distress in everything as well. This soul also leans towards those people who adopt tolerance in their lives and becomes more attached to them than those who adopt otherwise.",
    "foot_note": "None",
    "book_id": "1138",
    "new_page_number": 53
  },
  {
    "serial_number": "7501801",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 51,
    "volume_number": 1,
    "text": "It is known that one of the most important factors for the success of Da'wah to Allah - the Exalted - is for people to become familiar with the Da'iyah (caller) and love him. This is through his understanding of the religion of Allah - the Exalted - and his method of conveying this religion in the image intended by Allah - the Exalted - and His Messenger, peace and blessings be upon him. This is essential in Da'wah. If the Da'iyah is among those who adopt tolerance and breadth in conveying Islam and its principles, and does not burden people beyond their capacities as the Messenger, peace and blessings be upon him, used to do, then he is on good, and his Da'wah proceeds towards success and divine guidance. But if he is strict with people and burdens them with what they cannot bear, such as condemning everything even if it is permissible, and forbidding them what Allah and His Messenger, peace and blessings be upon him, did not forbid, then this Da'iyah is merely blowing into the wind and proceeding towards certain failure. This is because he contradicted the Law (Shar') and human natures, and ignored their instincts, desires, and needs. Mother of the Believers Aisha, may Allah be pleased with her, says clearly: «Whenever the Messenger of Allah, peace and blessings be upon him, was given a choice between two matters, he would choose the easier of the two, as long as it was not a sin. If it was a sin, he was the furthest of people from it» (1).",
    "foot_note": "1. (1) Sahih Al-Bukhari, No. 3560, p. 597. Narrated by Muslim in his Sahih under No. 6045, p. 1026.",
    "book_id": "1138",
    "new_page_number": 54
  },
  {
    "serial_number": "7501802",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 52,
    "volume_number": 1,
    "text": "Strictness that is out of place alienates people from religion and makes them follow paths in life other than Allah's path. This is human nature; it wants ease, breadth, and tolerance and cannot bear otherwise. Abu Huraira, may Allah be pleased with him, says: «A Bedouin urinated in the mosque, so the people rose to attack him. The Prophet, peace and blessings be upon him, said: Leave him and pour a bucket of water or a pail of water over his urine, for you have been sent to make things easy and not to make them difficult» (1).",
    "foot_note": "1. (1) Previously referenced.",
    "book_id": "1138",
    "new_page_number": 55
  },
  {
    "serial_number": "7501803",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 53,
    "volume_number": 1,
    "text": "So let the callers who mix with people and teach them their religious matters look at this great stance of the Prophet, peace and blessings be upon him, who is the role model and example for us until the Day of Judgment, to know the extent of space and breadth Allah made in His religion, and the wisdom in inviting people to it. This Bedouin coming from the desert does not know the sanctity or holiness of the mosque and thinks it is like other places, so he wanted to relieve himself in it. The Companions rose against him to beat him and scold him for this act. The Messenger of Mercy, peace and blessings be upon him, stopped them and let him finish urinating, then ordered them to pour a bucket of water over his urine to purify the place. Then he took the Bedouin gently and softly, and taught him that these places are houses of Allah established for remembrance and prayer, and it is not permissible to cause impurities in them. Then the Bedouin realized his mistake and regretted his act, and loved the Messenger of Allah, peace and blessings be upon him, for his wisdom and kindness towards him, compared to the Companions' behavior towards him and their attempt to beat and discipline him. He could not help but say: «O Allah, have mercy on me and Muhammad and do not have mercy on anyone else with us. When the Prophet, peace and blessings be upon him, finished prayer, he said to the Bedouin: You have narrowed a vast thing, meaning the mercy of Allah» (1).",
    "foot_note": "1. (1) Sahih Al-Bukhari, No. 6010, p. 1051.",
    "book_id": "1138",
    "new_page_number": 56
  },
  {
    "serial_number": "7501804",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 54,
    "volume_number": 1,
    "text": "For this reason, the Prophet, peace and blessings be upon him, advised Mu'adh and Abu Musa, may Allah be pleased with them, with ease when he sent them to Yemen, saying: «Make things easy and do not make them difficult, give glad tidings and do not repel people, cooperate and do not disagree» (1). He is the one who said, peace and blessings be upon him: «Religion is very easy and whoever overburdens himself in his religion will not be able to continue in that way. So you should not be extremists, but try to be near to perfection and receive the good tidings that you will be rewarded; and gain strength by worshipping in the mornings, the afternoons, and during the last hours of the nights» (2).\n4 - Among the dangerous effects: Saying about Allah Almighty and His Messenger, peace and blessings be upon him, what He did not say, and burdening the Sharia with what it cannot bear. This is a crime of great magnitude, which made the Prophet, peace and blessings be upon him, say: «Whoever turns away from my Sunnah is not from me» (3). Consequently, religion is described with what is not in it.",
    "foot_note": "1. (1) Sahih Al-Bukhari, No. 3038, p. 501. Narrated by Muslim in his Sahih under No. 4526, p. 769. \n2. Previously referenced. \n3. Previously referenced.",
    "book_id": "1138",
    "new_page_number": 57
  },
  {
    "serial_number": "7501805",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 55,
    "volume_number": 1,
    "text": "Research Summary\nThrough this brief narrative about the tolerance and ease of Islam in applying rulings and performing acts of worship and others, we conclude with some results and recommendations which we summarize as follows:\n1 - The principle of ease and tolerance is established in this religion, and it is a great objective of Islamic Sharia. No one denies it except those ignorant of the rulings of Islam and the reality of its message. It is a principle taken from many texts reported in the Book of Allah and the Sunnah of His Prophet, peace and blessings be upon him, and the traditions of the Companions and Followers, may Allah be pleased with them.\n2 - Moderation of this religion in all its aspects, in Creed, Worship, Transaction, Behavior, and others. This is in compliance with His Almighty's saying: {And thus we have made you a just community that you will be witnesses over the people and the Messenger will be a witness over you} (1).",
    "foot_note": "1. (1) Surah Al-Baqarah, Verse: 143.",
    "book_id": "1138",
    "new_page_number": 58
  },
  {
    "serial_number": "7501806",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 56,
    "volume_number": 1,
    "text": "3 - Straying from this methodology inherits negative effects and dangerous damages on human action and behavior in his religion and worldly life. It might take him out of the straight path to divergent paths and deviant ideas, opening the doors of innovation and novelties into this religion. Furthermore, straying from the methodology of ease has a dangerous impact on the movement of Da'wah to Allah Almighty, especially among those people who are new to this religion.\n4 - Finally, establishing the principle of tolerance and ease in religion does not mean:\n- Violation of the objectives of Sharia and Religion. The principle of ease should not be understood as negligence or laxity in applying the rulings of this religion and executing its commands, because this ease is not in sin or disobedience as Mother of the Believers Aisha, may Allah be pleased with her, narrated in a previous hadith: «Whenever the Messenger of Allah, peace and blessings be upon him, was given a choice between two matters, he would choose the easier of the two, as long as it was not a sin. If it was a sin, he was the furthest of people from it» (1). This must be noted and warned against.",
    "foot_note": "1. (1) Previously referenced.",
    "book_id": "1138",
    "new_page_number": 59
  },
  {
    "serial_number": "7501807",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 57,
    "volume_number": 1,
    "text": "- This principle does not mean transgressing the Halal (permissible) and Haram (forbidden) or violating Islamic concepts and public morals, because it is originally based on clear Quranic texts and Prophetic Hadiths. So establishing this principle is not innovation or introducing a new matter into religion, as per His Almighty's saying: {Allah intends for you ease and does not intend for you hardship} (1). And His saying: {And He has not placed upon you in the religion any difficulty} (2).\n- Establishing this principle does not mean judging by whims and desires, and achieving personal interests behind it. Those weak in faith might exploit it to judge by their whims and desires and call this ease or tolerance. Rather, ease and tolerance must be based on the original sources of legislation which are the Holy Quran, the Prophetic Sunnah, and Consensus (Ijma).\nFinally, I ask Allah - the Exalted - to grant us sincerity in sayings and deeds, and grant us Fiqh (understanding) in religion with insight, and teach us what benefits us and benefit us with what He taught us. Indeed, He is All-Hearing, Near, Responsive. May Allah send peace and blessings upon our Prophet Muhammad and upon his family and companions all together.\nWritten by Faleh bin Muhammad bin Faleh Al-Sghair\nRiyadh 1424 AH\nP.O. Box 41961 Riyadh 11531\nfalehmalsgair@yahoo.com",
    "foot_note": "1. (1) Surah Al-Baqarah, Verse: 185. \n2. Surah Al-Hajj, Verse: 78.",
    "book_id": "1138",
    "new_page_number": 60
  },
  {
    "serial_number": "7501808",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 58,
    "volume_number": 1,
    "text": "List of References\n* The Holy Quran.\n* Al-Ashbah wa Al-Naza'ir fi Qawa'id wa Furu' Fiqh Al-Shafi'iyyah, by Imam Jalal al-Din bin Abd al-Rahman al-Suyuti, 1st ed., Dar al-Kutub al-Ilmiyyah, Beirut - Lebanon 1403 AH, 1983 AD.\n* Jami' At-Tirmidhi, supervised by Saleh bin Abdul Aziz Al-Sheikh. 1st ed., Darussalam, Riyadh 1420 AH, 1999 AD.\n* Sunan Ibn Majah, supervised by Saleh bin Abdul Aziz Al-Sheikh. 1st ed., Darussalam, Riyadh 1420 AH, 1999 AD.\n* Sunan Abi Dawood, supervised by Saleh bin Abdul Aziz Al-Sheikh. 1st ed., Darussalam, Riyadh 1420 AH, 1999 AD.\n* Sunan An-Nasa'i, supervised by Saleh bin Abdul Aziz Al-Sheikh. 1st ed., Darussalam, Riyadh 1420 AH, 1999 AD.\n* Sharh Al-Qawa'id Al-Fiqhiyyah, Ahmad Al-Zarqa; introduced by his son Mustafa Al-Zarqa, and Abdul Fattah Abu Ghuddah, 1st ed., Dar Al-Gharb Al-Islami, 1403, 1983 AD.\n* Sahih Al-Bukhari. 2nd ed., Darussalam, Riyadh 1419 AH, 1999 AD.\n* Sahih Muslim. 1st ed., Darussalam, Riyadh 1419 AH, 1998 AD.\n* Al-Mustadrak 'ala Al-Sahihayn, by Al-Hakim Al-Naysaburi, Dar Al-Fikr edition.\n* Musnad Imam Ahmad, Bayt Al-Afkar Al-Dawliyah for Publishing and Distribution, 1419 AH, 1998 AD.",
    "foot_note": "None",
    "book_id": "1138",
    "new_page_number": 61
  },
  {
    "serial_number": "7501809",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Ease and Tolerance in Islam",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 59,
    "volume_number": 1,
    "text": "* Al-Mu'jam Al-Wasit, directed by Ibrahim Mustafa, Ahmad Hasan Al-Zayyat, Hamid Abd Al-Qadir, Muhammad Ali Al-Jar; supervised by Abd Al-Salam Harun.",
    "foot_note": "None",
    "book_id": "1138",
    "new_page_number": 62
  }
]