[
  {
    "text": "Warning the Worshipper against Taking Graves as Mosques\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Warning the Worshipper against Taking Graves as Mosques",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 1
  },
  {
    "text": "sn: 374\nbook_title: تحذير الساجد من اتخاذ القبور مساجد\nbook_link: https://shamela.ws/book/349\nbook_id: 349\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: المكتب الإسلامي - بيروت\nedition: الرابعة\npages: 132\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: العقيدة\ncategory_id: 1",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Warning the Worshipper against Taking Graves as Mosques",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 2
  },
  {
    "serial_number": "69508",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against Taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Creed\nBook: Warning the Worshipper against Taking Graves as Mosques\nAuthor: Muhammad Nasir al-Din al-Albani (d. 1420 AH)\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nBook: Warning the Worshipper against Taking Graves as Mosques\nAuthor: Muhammad Nasir al-Din al-Albani (d. 1420 AH)\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nAuthor: Muhammad Nasir al-Din al-Albani (d. 1420 AH)\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\n[Book numbering matches the printed version]\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nPublication date in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 3
  },
  {
    "serial_number": "69509",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against Taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 1,
    "volume_number": 1,
    "text": "Warning the Worshipper against Taking Graves as Mosques\nBy the pen of Muhammad bin Nasir al-Din al-Albani\nFourth Edition\nThe Islamic Office",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 4
  },
  {
    "serial_number": "69510",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against Taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 2,
    "volume_number": 1,
    "text": "Introduction to the Second Edition",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 5
  },
  {
    "serial_number": "69511",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper Against Taking Graves as Places of Worship",
    "edition": "Fourth Edition",
    "publisher": "Al-Maktab al-Islami – Beirut",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the Name of Allah, the Most Merciful, the Most Compassionate\n\nIndeed, all praise is due to Allah; we praise Him, seek His help, seek His forgiveness, and repent to Him. And we seek refuge in Allah from the evils of our own souls and from our misdeeds. Whomever Allah guides, none can mislead; and whomever He leaves astray, none can guide. And I bear witness that there is no deity worthy of worship except Allah alone, without partner; and I bear witness that Muhammad is His servant and messenger.\n\n{O you who believe! Fear Allah as He should be feared, and do not die except as Muslims} (1)\n\n{O mankind! Fear your Lord who created you from a single soul, and created from it its mate, and dispersed from them many men and women; and fear Allah through whom you ask one another, and the wombs. Indeed, Allah is ever watching over you} (2)\n\n{O you who believe! Fear Allah and speak words of appropriate justice. He will rectify your deeds for you and forgive you your sins; and whoever obeys Allah and His Messenger has certainly attained a great triumph} (3)",
    "foot_note": "1. Surah Al-Baqarah, verse 132\n2. Surah An-Nisa’, verse 1\n3. Surah Al-Ahzab, verse 70",
    "book_id": "349",
    "new_page_number": 6
  },
  {
    "serial_number": "69512",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 4,
    "volume_number": 1,
    "text": "As for what follows, I had printed at the end of the year (1377) AH a treatise titled \"Warning the Worshipper against Taking Graves as Mosques.\" My personal copy of this edition was with me throughout this period; whenever I came across an additional benefit suitable for its topic, I would annotate it, hoping to include it when reprinting it expanded and revised. Thus, I accumulated many important additions. When the noble professor Zuhair Al-Shawish, owner of Al-Maktab Al-Islami, asked me to present it to him to reprint it, I looked for it but did not find it. When I despaired of finding it, I sent him another copy I borrowed from some of my friends to be printed as is, based on the rule: \"What cannot be fully attained should not be fully abandoned.\" While my brother Professor Zuhair Al-Shawish was preparing to print it, I found it by the grace and generosity of Allah Almighty. I hastened to send it to him after refining it and preparing it for the second edition. Since the writing of the mentioned treatise had special circumstances and specific conditions at that time, wisdom required its style to be contrary to calm research and solid reasoning. That is because it was a response to people who did not like our call to the Book and the Sunnah according to the methodology of the righteous predecessors (Salaf) and the plan of the four Imams and others who followed them in goodness. So they initiated writing and responding to us. Would that it had been a calm scientific response; then I would have met them with better than it. But unfortunately, it was not so; rather, it was devoid of any scientific research, filled with insults and abuse, and inventing accusations never heard before. Therefore, we did not see at that time that it was wise to remain silent about them and leave them to spread their treatises among the people without having an author to unveil the ignorance and accusations therein, {so that those who perished [through disbelief] would perish upon evidence and those who lived [in faith] would live upon evidence} (4). Therefore, it was necessary to respond to them by name. Although I did not meet their aggression and fabrication with the like, the treatise, despite its scientific nature, was a direct response to them. It may contain some harshness or severity in style in the opinion of some people who pretend to be displeased with responding to fabricating opponents and wish they were left without being held accountable for their ignorance and accusation of the innocent, imagining that silence about them is tolerance that may fall under the like of the Almighty's saying {And when the ignorant address them [harshly], they say [words of] peace} (5). They forget or pretend to forget that this helps them continue in their misguidance and misleading of others, and Allah Almighty says {And do not cooperate in sin and aggression} (6). And what sin and aggression is greater than accusing a Muslim of what is not in him, rather, contrary to what he is? If some of those pretending what we mentioned were afflicted by aggression less than what afflicted us, they would hasten to respond, and their state would recite:",
    "foot_note": "1. (4) - Surah Al-Anfal Verse 42 \n2. - Surah Al-Furqan Verse 63 \n6. - Surah Al-Ma'idah Verse 2",
    "book_id": "349",
    "new_page_number": 7
  },
  {
    "serial_number": "69513",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 5,
    "volume_number": 1,
    "text": "Let no one act ignorantly against us, lest we act more ignorantly than the ignorant. I say despite that: I see that reprinting the treatise in its previous form has no significant benefit. Therefore, it was necessary to delete some comments and modify a few phrases to refine its style and suit its new edition without diminishing its scientific value and important research. I had mentioned in the introduction to the first edition that the subject of the treatise is confined to two very important matters: First: The ruling on building mosques over graves. Second: The ruling on praying in these mosques. I preferred researching them because some people delved into them without knowledge and said what no scholar before them had said, especially since most people have absolutely no knowledge about it. They are heedless of it, oblivious, and ignorant of the truth. They are supported in this by the silence of scholars about them - except whom Allah wills, and how few they are - out of fear of the common people or flattering them to preserve their status in their hearts, forgetting the saying of Allah Blessed and Exalted {Indeed, those who conceal what We sent down of clear proofs and guidance after We made it clear for the people in the Scripture - those are cursed by Allah and cursed by those who curse} (7) and his saying, peace be upon him: \"Whoever conceals knowledge, Allah will bridle him on the Day of Resurrection with a bridle of fire.\" (8) The result of this silence and that ignorance was that many people ended up committing what Allah Almighty forbade and cursed its doer, as will be explained. Would that the matter stopped at this limit, but some of them began to draw closer to Allah Blessed and Exalted by that. You see many lovers of goodness and construction among them spending huge amounts of money to establish a mosque for Allah, but he prepares a grave in it recommending that he be buried in it after his death. The latest example I know of this, and may it be the last, God willing, is this mosque at the head of Baghdad Street from the western side in Damascus, known as \"Ba'ira Mosque,\" and his grave is in it. We were informed that the Awqaf (Endowments) objected to his burial at first, then we do not know the real reasons that prevented them from what they wanted, and \"Ba'ira\" was buried in his mosque, rather in its Qibla. Indeed to Allah we belong and indeed to Him we return, and He is the Helper to get rid of these evils and their likes.",
    "foot_note": "1. (7) - Surah Al-Baqarah Verse 159 \n8. - Hasan Hadith narrated by Ibn Hibban in his Sahih number (296) and Al-Hakim (1 / 102) and he authenticated it and Al-Dhahabi agreed.",
    "book_id": "349",
    "new_page_number": 8
  },
  {
    "serial_number": "69514",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 6,
    "volume_number": 1,
    "text": "A few days ago, one of the Shafi'i Muftis passed away, and his relatives wanted to bury him in one of the old mosques east of Damascus. The Awqaf also objected to that, so he was not buried there. We thank the Awqaf for these good stances and its keenness to prevent burial in mosques, hoping from Allah Blessed and Exalted that the motive for this prevention is the pleasure of Allah Almighty and following His Sharia, not other political or social considerations, etc., and that this be a good beginning from it in the way of purifying mosques from the innovations and evils crowded in them, especially since the Minister of Awqaf, his eminence Sheikh Al-Baqouri, has noble stances in fighting many of these evils, especially building mosques over graves, and he has useful words on this subject that will be quoted in the appropriate place, God willing. It is truly regrettable for every believer that many mosques in Syria and elsewhere are not free from the presence of a grave or more in them, as if Allah Blessed and Exalted commanded that and did not curse its doer. How well the Awqaf would do if it tried with its wisdom to purify these mosques from them. I do not doubt that it is not wise to surprise public opinion with that; rather, it must be informed first of all that the grave and the mosque do not gather in the religion of Islam, as some prominent scholars said as will come, and that their gathering together contradicts the sincerity of Tawhid and worship to Allah Blessed and Exalted, this sincerity for the realization of which mosques are built, as the Almighty said {And [He revealed] that the masjids are for Allah, so do not invoke with Allah anyone} (9). (9) - Surah Al-Jinn Verse 18",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 9
  },
  {
    "serial_number": "69515",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 7,
    "volume_number": 1,
    "text": "I believe that clarifying this is an inescapable duty, and perhaps I have succeeded in doing so in this treatise. I have collected in it the Mutawatir (mass transmitted) hadiths prohibiting that and followed them by mentioning the Madhhabs (schools of thought) of scholars and their considered opinions that indicate that, and testify at the same time that the Imams, may Allah be pleased with them, were most keen on following the Sunnah and inviting people to follow it and warning against opposing it. But Allah the Great spoke the truth saying: {But there came after them successors who neglected prayer and pursued desires; so they are going to meet evil} (10). These are the chapters of the treatise: Chapter One: On the hadiths prohibiting taking graves as mosques. Chapter Two: On the meaning of taking graves as mosques. Chapter Three: On taking graves as mosques being among the major sins. Chapter Four: Doubts and their answers. Chapter Five: On the wisdom of prohibiting building mosques over graves. Chapter Six: On the dislike of praying in mosques built over graves. Chapter Seven: That the previous ruling includes all mosques except the Prophet's Mosque. Within these chapters are other sub-chapters containing important useful benefits, God willing. I have named the treatise: (Warning the Worshipper against Taking Graves as Mosques). That is what I wrote in the introduction to the first edition. I ask Allah Blessed and Exalted to benefit Muslims with this edition more than the previous one, and to accept it from me and all my righteous deeds with good acceptance, and reward the one undertaking its printing with good. Damascus on 23 Jumada Al-Awwal 1392 AH.",
    "foot_note": "1. (10) - Surah Maryam Verse 59 Muhammad Nasir al-Din al-Albani",
    "book_id": "349",
    "new_page_number": 10
  },
  {
    "serial_number": "69516",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 8,
    "volume_number": 1,
    "text": "Chapter One",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 11
  },
  {
    "serial_number": "69517",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 9,
    "volume_number": 1,
    "text": "Hadiths Prohibiting Taking Graves as Mosques",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 12
  },
  {
    "serial_number": "69518",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 10,
    "volume_number": 1,
    "text": "1 - From Aisha, may Allah be pleased with her, she said: The Messenger of Allah, peace be upon him, said during his illness from which he did not recover: \"Allah cursed the Jews and the Christians; they took the graves of their prophets as mosques.\" She said: \"Were it not for that, his grave would have been made prominent (11), but it was feared that it might be taken as a mosque.\" (12) (11) - Meaning his grave, peace be upon him, would be uncovered and no barrier would be taken over it, and the intent is buried outside his house. So in \"Fath Al-Bari\". Benefit: This statement of Aisha clearly indicates the reason for which they buried the Prophet, peace be upon him, in his house, which is to block the way for anyone who might build a mosque over him. Thus, it is not permissible in this case to use that as evidence for burying anyone other than him, peace be upon him, in the house. This is supported by the fact that it is contrary to the principle because the Sunnah is burial in cemeteries. Therefore, Ibn Urwah said in \"Al-Kawkab Al-Durri\" (Vol. 1, Folio 188 / Tafsir 548): \"Burial in Muslim cemeteries is more pleasing to Abu Abdullah (meaning Imam Ahmad) than burial in houses because it is less harmful to the living among his heirs, more like the dwellings of the Hereafter, and more conducive to supplication for him and asking for mercy upon him. His companions, the followers, and those after them continued to be buried in the deserts. If it is said: But the Prophet, peace be upon him, was buried in his house and his two companions were buried with him? We say: Aisha said: That was done only so that his grave would not be taken as a mosque. Also, because the Prophet, peace be upon him, used to bury his companions in Baqi', and his action is more worthy than the action of others. His companions only saw fit to single him out with that. And because it was narrated: 'Prophets are buried where they die,' and to protect them from frequent trampling, distinguishing him from others.\" (2) - Narrated by Al-Bukhari (3 / 156 & 198 & 8 / 114), Muslim (2 / 76), Abu Awana (1 / 399), Ahmad (6 / 80 & 121 & 255), Al-Siraj in his \"Musnad\" (3 / 48 / 2) from Urwa from her, and Ahmad (6 / 146 & 252) and Al-Baghawi in \"Sharh Al-Sunnah\" (Vol. 1 p. 415) printed by Al-Maktab Al-Islami from Saeed bin Al-Musayyib from her, and its chain is authentic according to the conditions of the two Sheikhs.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 13
  },
  {
    "serial_number": "69519",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 11,
    "volume_number": 1,
    "text": "Similar to this saying of Aisha is what was narrated from her father, may Allah be pleased with them both. Ibn Zanjawayh narrated from Umar Mawla Ghufra who said: When they consulted about the burial of the Messenger of Allah, peace be upon him, someone said: We bury him where he used to pray in his place. Abu Bakr said: I seek refuge in Allah that we make him an idol to be worshipped. Others said: We bury him in Baqi' where his brothers from the Muhajirin were buried. Abu Bakr said: We dislike taking the grave of the Messenger of Allah, peace be upon him, out to Baqi' lest people seek refuge with him from the One to whom belongs the right upon him, and Allah's right is above the right of His Messenger, peace be upon him. If we take him out (Original: delay him), we waste Allah's right, and if we protect him (), we protect the grave of the Messenger of Allah, peace be upon him. They said: So what do you see, O Abu Bakr? He said: I heard the Messenger of Allah, peace be upon him, saying: \"Allah has never taken a prophet except that he was buried where his soul was taken.\" They said: Then you are, by Allah, a pleasing convincing one. Then they drew a line around the bed, then Ali, Al-Abbas, Al-Fadl, and his family carried him, and the people fell to digging where the bed was. (13)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 14
  },
  {
    "serial_number": "69520",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 12,
    "volume_number": 1,
    "text": "2 - From Abu Huraira, may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said: \"May Allah fight the Jews; they took the graves of their prophets as mosques.\" (14)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 15
  },
  {
    "serial_number": "69521",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 13,
    "volume_number": 1,
    "text": "3 - And 4 from Aisha and Ibn Abbas that when death approached the Messenger of Allah, peace be upon him, he began casting a piece of Khamisa (15) of his over his face. When he felt distressed, he uncovered it from his face and said: \"The curse of Allah (13) - Ibn Kathir said: It is disconnected (Munqati') from this aspect, for Umar Mawla Ghufra, along with his weakness, did not catch the days of Al-Siddiq. So in (Al-Jami' Al-Kabir) by Al-Suyuti (3 / 147 / 12) (4) - Narrated by Al-Bukhari (2 / 422), Muslim, Abu Awana, Abu Dawud (2 / 71), Ahmad (2 / 284 & 366 & 396 & 453 & 518), Abu Ya'la in his \"Musnad\" (278 / 1), Al-Siraj, Al-Sahmi in \"Tarikh Jurjan\" (349), and Ibn Asakir (14 / 367 / 2) from Saeed bin Al-Musayyib from him, and Muslim also from Yazid bin Al-Asamm from him. Abdur-Razzaq narrated it in his \"Musannaf\" (1 / 406 / 1589) from the first aspect from him but he stopped it (Mawquf). (15) - A garment of Khazz (silk/wool blend) or wool with markings. So in \"Al-Nihaya\". I say: The intent here is the second because Khazz is silk as is known now, and it is forbidden for men as established in the Sunnah contrary to those who make it lawful among those who give no weight to the Sunnah be upon the Jews; they took the graves of their prophets as mosques.\" Aisha says: He was warning against what they did. (16) Al-Hafiz Ibn Hajar said: \"It is as if he, peace be upon him, knew that he was departing from that illness, so he feared that his grave would be glorified as those before did, so he cursed the Jews and Christians indicating the condemnation of whoever does their deed.\" I say: Meaning from this Ummah, and in the coming hadith (6) is the explicit prohibition for them from that, so pay attention.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 16
  },
  {
    "serial_number": "69522",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 14,
    "volume_number": 1,
    "text": "5 - From Aisha, may Allah be pleased with her, she said: During the illness of the Prophet, peace be upon him, some of his wives mentioned a church in the land of Abyssinia called Mariyah. Umm Salama and Umm Habiba had been to the land of Abyssinia, so they mentioned its beauty and its images. She said: [So the Prophet, peace be upon him, raised his head] and said: \"Those people, if a righteous man among them died, they built a mosque over his grave and painted those images. They are the worst of creatures in the sight of Allah [on the Day of Resurrection].\" (17) Al-Hafiz Ibn Rajab said in \"Fath Al-Bari\": (16) - Narrated by Al-Bukhari (1 / 422 & 6 / 386 & 8 / 116), Muslim (2 / 67), Abu Awana (1 / 399), Al-Nasa'i (1 / 115), Al-Darimi (1 / 326), Ahmad (1 / 218 & 6 / 34 & 229 & 275), and Ibn Saad in \"Al-Tabaqat\" (2 / 258). Abdur-Razzaq narrated it in \"Al-Musannaf\" (1 / 406 / 1588) from Ibn Abbas alone. (17) Narrated by Al-Bukhari (1 / 416 & 422), Muslim (2 / 66 /), Al-Nasa'i (1 / 115), Ibn Abi Shaybah in \"Al-Musannaf\" (4 / 140 Indian print), Ahmad (6 / 51 Al-Maktab Al-Islami print), Abu Awana in his \"Sahih\" (1 / 400-401) and the context is his, Ibn Saad in \"Al-Tabaqat\" (2 / 241), Al-Siraj in his \"Musnad\" (48 / 2), Abu Ya'la in \"Al-Tabaqat\" (Folio 220 / 2), Al-Bayhaqi (4 / 80), and Al-Baghawi (2 / 415-416). This hadith indicates the prohibition of building mosques over the graves of the righteous and painting their images in them as Christians do. There is no doubt that each of them is forbidden on its own; painting images of humans is forbidden, and building graves over mosques on its own is forbidden as indicated by other texts, some of which will be mentioned. He said: The images in the church mentioned by Umm Habiba and Umm Salama were on walls and the like and had no shadow. Painting images in the likeness of prophets and righteous people to seek blessings and intercession through them is forbidden in the religion of Islam and is of the kind of idol worship. It is what the Prophet, peace be upon him, informed that its people are the worst of creatures in the sight of Allah on the Day of Resurrection. Painting images to emulate seeing them or for amusement and entertainment is forbidden and is among the major sins, and its doer is among the most severely punished people on the Day of Resurrection, for he is unjust, imitating the actions of Allah which no one else can do, and He, the Exalted, there is nothing like unto Him neither in His essence nor in His attributes nor in His actions, Glory be to Him and Exalted. Mentioned in \"Al-Kawakib Al-Darari\" (Vol. 65 / 82 / 2). I say: There is no difference in prohibition between manual photography and mechanical and photographic photography; rather, differentiating between them is rigidity and modern literalism as I explained in my book \"Adab Al-Zifaf\" (p. 106-116 Second Edition, Al-Maktab Al-Islami print).",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 17
  },
  {
    "serial_number": "69523",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 15,
    "volume_number": 1,
    "text": "6 - From Jundub bin Abdullah Al-Bajali that he heard the Prophet, peace be upon him, five days before he died saying: I have had brothers and friends among you, and I clear myself (18) to Allah from having a Khalil (close friend) among you. For Allah Almighty has taken me as a Khalil just as He took Abraham as a Khalil. If I were to take a Khalil from my Ummah, I would have taken Abu Bakr as a Khalil. Verily [those] who were before you [used to] take the graves of their prophets and righteous people as mosques. Verily, do not take graves as mosques, for I forbid you from that. (19)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 18
  },
  {
    "serial_number": "69524",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 16,
    "volume_number": 1,
    "text": "7 - From Al-Harith Al-Najrani, he said: I heard the Prophet, peace be upon him, five days before he died saying: Verily, those who were before you used to take the graves of their prophets and righteous people as mosques. Verily, do not take graves as mosques; I forbid you from that. (20) From Usama bin Zaid that the Messenger of Allah, peace be upon him, said during his illness in which he died: \"Bring my companions to me.\" So they entered upon him while he was veiled with a Ma'afiri (21) garment. [He uncovered the veil] and said: \"Allah cursed the Jews [and the Christians]; they took the graves of their prophets as mosques.\" (22)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 19
  },
  {
    "serial_number": "69525",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 17,
    "volume_number": 1,
    "text": "9 - From Abu Ubaidah bin Al-Jarrah who said: The last thing the Prophet, peace be upon him, spoke was: Expel the Jews of the people of Hijaz and the people of Najran from the Arabian Peninsula, and know that the worst of people are those who took (and in a narration: take) (23) the graves of their prophets as mosques. (24)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 20
  },
  {
    "serial_number": "69526",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 18,
    "volume_number": 1,
    "text": "10 - From Zaid bin Thabit that the Messenger of Allah, peace be upon him, said: \"Allah cursed (and in a narration: May Allah fight) the Jews; they took the graves of their prophets as mosques.\" (25)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 21
  },
  {
    "serial_number": "69527",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 19,
    "volume_number": 1,
    "text": "24 - () 19 - Narrated by Muslim (2 / 67-68), Abu Awana (1 / 401) and the context is his, and Al-Tabarani in \"Al-Kabir\" (1 / 84 / 2). Ibn Saad narrated it (2 / 240) concisely without mentioning brothers and taking a Khalil. He said: 18 - Meaning I abstain from this and deny it. Al-Khalil is the one solely relied upon. It is said: It is derived from Al-Khalla with Fath on Khaa which is need, and it is said: From Al-Khulla with Damm on Khaa which is the permeation of love in the heart. So he, peace be upon him, denied that his need and devotion be to other than Allah Almighty. \"Sharh Muslim\" by Al-Nawawi. (20) - Narrated by Ibn Abi Shaybah (Folio 2 / 83 / 2 and Print 2 / 376) and its chain is authentic according to Muslim's conditions. (21) - Garments in Yemen attributed to Ma'afir, a tribe in Yemen. \"Nihaya\". (22) - Narrated by Al-Tayalisi in his Musnad (2 / 113 of his arrangement), Ahmad (5 / 204), and Al-Tabarani in \"Al-Kabir\" (Vol. 1 Folio 22 / 1) and its chain is Hasan with witnesses. Al-Shawkani said in \"Nayl Al-Awtar\" (2 / 114) \"Its chain is Jayyid (good)\". Al-Haythami said in \"Majma' Al-Zawa'id\" (2 / 27) \"Its men are trustworthy (Muwaththaqun)\". (23) - There is a clear difference between the two narrations. The first narration refers to people who passed, namely the Jews and Christians as in the previous hadiths. The other narration refers to those who follow their path from this Ummah, and it is supported by hadiths (6, 7, 12). (25) Narrated by Ahmad (5 / 184, 186) and its men are trustworthy except Uqba bin Abdul-Rahman who is Ibn Abi Ma'mar and is unknown (Majhul) as in \"Al-Taqrib\". Do not be deceived by Al-Haythami's saying (2 / 27): \"Narrated by Al-Tabarani in Al-Kabir and its men are trustworthy (Muwaththaqun)\" what Al-Shawkani did, for he said (2 / 114) \"and its chain is Jayyid\". This is because saying \"Muwaththaqun\" is less than saying \"Thiqat\" (trustworthy). Their saying \"Muwaththaqun\" is an indication from them that some of its narrators' authentication is not strong. It is as if Al-Haythami is indicating that this Uqba was only authenticated by Ibn Hibban and that Ibn Hibban's authentication is not reliable, and Allah knows best. The fact that Ibn Hibban's authentication is not reliable is something not doubted by those deeply versed in this noble science. I have detailed this in my reply to the treatise \"Al-Ta'aqub Al-Hathith\" by Sheikh Abdullah Al-Habashi, published in Al-Tamaddun Al-Islami in consecutive articles, then published in a separate treatise titled \"Al-Radd 'ala Al-Ta'aqub Al-Hathith\", so refer to (p. 18-21). Furthermore, saying about a hadith \"its men are trustworthy\" or \"its men are men of Sahih\" does not mean that its chain is authentic as I clarified elsewhere. See for example \"Silsilat Al-Ahadith Al-Sahihah\" (Vol. 2 p. 5 Al-Maktab Al-Islami print). However, the hadith is authentic due to its previous witnesses.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 22
  },
  {
    "serial_number": "69528",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 20,
    "volume_number": 1,
    "text": "And he has (2 / 241) a witness from the hadith of Abu Umamah, and a second witness narrated by Al-Tabarani from Ka'b bin Malik with a chain that has no harm as Ibn Hajar Al-Haytami said in \"Al-Zawajir\" (1 / 120), and Al-Hafiz Nur Al-Din Al-Haythami weakened it in \"Majma' Al-Zawa'id\" (9 / 45).",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 23
  },
  {
    "serial_number": "69529",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 21,
    "volume_number": 1,
    "text": "Narrated by Ahmad (Numbers 1691, 1694), Al-Tahawi in \"Mushkil Al-Athar\" (4 / 13), Abu Ya'la (57 / 1), and Ibn Asakir (8 / 367 / 2) with an authentic chain. Al-Haythami said in \"Al-Majma'\" (5 / 325): Narrated by Ahmad with chains (Original: with two chains) and the men of two of them are trustworthy, their chain is connected. And Abu Ya'la narrated it. I say: There is a clear observation on this statement because the pivot of the three paths he referred to is Ibrahim bin Maymun from Saad bin Samura, except that the third path had some narrators insert Ishaq bin Saad bin Samura between them, which is a mistake as clarified by Al-Hafiz in \"Al-Ta'jeel\". Also, it does not contain \"and know that the worst of people...\" Then Al-Haythami mentioned this hadith elsewhere (2 / 82) similarly and said: Narrated by Al-Bazzar and its men are trustworthy. It has a Mursal witness from Umar bin Abdul-Aziz raised similarly. Narrated by Ibn Saad (2 / 254).",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 24
  },
  {
    "serial_number": "69530",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 22,
    "volume_number": 1,
    "text": "From Abu Huraira, he said: The Messenger of Allah, peace be upon him, said: \"O Allah, do not make my grave an idol (26). Allah cursed a people who took the graves of their prophets as mosques.\" (27)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 25
  },
  {
    "serial_number": "69531",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 23,
    "volume_number": 1,
    "text": "12 - From Abdullah bin Mas'ud, he said: I heard the Messenger of Allah, peace be upon him, saying: Indeed, among the worst of people are those upon whom the Hour comes while they are alive, and those who take graves as mosques. (28) (27) - Narrated by Ahmad (Number 7352), Ibn Saad (2 / 241-242), Al-Mufaddal Al-Jandi in \"Fada'il Al-Madina\" (66 / 1), Abu Ya'la in his \"Musnad\" (312 / 1), Al-Humaydi (1025), and Abu Nu'aym in \"Al-Hilya\" (6 / 382 & 7 / 317) with an authentic chain. It has a Mursal witness narrated by Abdur-Razzaq in \"Al-Musannaf\" (1 / 406 / 1587) and likewise Ibn Abi Shaybah (4 / 141) from Zaid bin Aslam. Its chain is strong. (26) - \"Ibn Abd al-Barr said: Wathan means idol. He says: Do not make my grave an idol to be prayed to, prostrated towards, and worshipped. Allah's wrath has intensified against those who do that. The Messenger of Allah, peace be upon him, was warning his companions and his entire Ummah against the bad deed of previous nations who prayed to the graves of their prophets and took them as Qibla and mosque, as the idolaters did with idols they prostrated to and venerated. That is the major Shirk. The Messenger of Allah, peace be upon him, was informing them of Allah's displeasure and wrath in that, and that it is something He does not approve of, fearing for them to follow their ways. He, peace be upon him, loved opposing the People of the Book and all disbelievers, and he feared for his Ummah to follow them. Do you not see his saying, peace be upon him, by way of rebuke and reprimand 'You will surely follow the ways of those before you, step by step, even if one of them entered a lizard's hole, you would enter it?'\" So in \"Fath Al-Bari\" by Ibn Rajab (65 / 90 / 2) from \"Al-Kawakib\". (28) - Narrated by Ibn Khuzaimah in his \"Sahih\" (1 / 92 / 2), Ibn Hibban (340 & 341), Ibn Abi Shaybah in \"Al-Musannaf\" (4 / 140 Indian print), Ahmad (Numbers 3844 & 4143), Al-Tabarani in \"Al-Mu'jam Al-Kabir\" (3 / 77 / 1), Abu Ya'la in his \"Musnad\" (257 / 1), and Abu Nu'aym in \"Akhbar Isfahan\" (1 / 142) with a Hasan chain. And Ahmad also (Number 4342) with another Hasan chain supporting the previous one. The hadith by their sum is authentic. Sheikh Al-Islam Ibn Taymiyyah said in \"Minhaj Al-Sunnah\" (1311) and \"Al-Iqtida\" (p. 185): \"And its chain is Jayyid (good)\". Al-Haythami said (2 / 27): \"Narrated by Al-Tabarani in Al-Kabir and its chain is Hasan.\" His limitation in attribution to Al-Tabarani alone is an apparent deficiency, while it is in the Musnad in three places as we indicated just now. The first part of the hadith was narrated by Al-Bukhari in his Sahih (13 / 15) suspended (Mu'allaq).",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 26
  },
  {
    "serial_number": "69532",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 24,
    "volume_number": 1,
    "text": "And another narrated by Malik in \"Al-Muwatta\" (1 / 185) and from him Ibn Saad (2 / 240-241) from Ata bin Yasar raised. Its chain is authentic. Al-Bazzar connected it from him from Abu Saeed Al-Khudri. Ibn Abd al-Barr authenticated it as Mursal and connected, saying: \"This hadith is for those who accept Mursals of trustworthy narrators, and for those who accept Musnad due to Umar bin Muhammad's chain for it, and he is one whose addition is accepted.\" See \"Tanwir Al-Hawalik\" by Al-Suyuti. There is an observation on what Ibn Abd al-Barr said about this Umar. Al-Hafiz Ibn Rajab said in \"Al-Fath\": Al-Bazzar narrated it from his path, and this Umar is Ibn Sahban, attributed in some copies of Al-Bazzar. Ibn Abd al-Barr thought he was Umar bin Muhammad Al-Umari, and it appears he was mistaken. Similar has been narrated from the hadith of Abu Salama from Abu Huraira with a chain containing observation.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 27
  },
  {
    "serial_number": "69533",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 25,
    "volume_number": 1,
    "text": "13 - From Ali bin Abi Talib, he said: Al-Abbas met me and said: O Ali, let us go to the Prophet, peace be upon him. If there is something of command for us, or else he recommends people regarding us. So we entered upon him while he was unconscious. He raised his head and said: Allah cursed the Jews; they took the graves of prophets as mosques.\" Added in a narration: \"Then he said it a third time.\" When we saw his condition, we left and did not ask him anything. (29)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 28
  },
  {
    "serial_number": "69534",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 26,
    "volume_number": 1,
    "text": "14 - From the Mothers of the Believers that the companions of the Messenger of Allah, peace be upon him, said: How should we build the grave of the Messenger of Allah, peace be upon him? Should we make it a mosque? Abu Bakr Al-Siddiq said: I heard the Messenger of Allah, peace be upon him, say: Allah cursed the Jews and Christians; they took the graves of their prophets as mosques. (30)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 29
  },
  {
    "serial_number": "69535",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 27,
    "volume_number": 1,
    "text": "Chapter Two",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 30
  },
  {
    "serial_number": "69536",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 28,
    "volume_number": 1,
    "text": "The Meaning of Taking Graves as Mosques It has become clear from the previous hadiths the danger of taking graves as mosques and the severe threat from Allah Almighty upon whoever does that. We must understand the meaning of the mentioned taking so we can avoid it. I say: What can be understood from this taking is only three meanings: (29) - Narrated by Ibn Saad (4 / 28) and Ibn Asakir (12 / 172 / 2) from two paths from Uthman Ibn Al-Yaman told us Abu Bakr Ibn Abi Awn that he heard Abdullah bin Isa bin Abdul-Rahman bin Abi Laila from his father from his grandfather or said: from his father or from his grandfather said: I heard Ali bin Abi Talib say: I say: This chain is Hasan were it not that I do not know this Abu Bakr, and Al-Dawlabi and Abu Ahmad Al-Hakim did not mention him in \"Al-Kuna\". (30) - Narrated by Ibn Zanjawayh in \"Fada'il Al-Siddiq\" as in \"Al-Jami' Al-Kabir\" (3 / 147 / 1).",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 31
  },
  {
    "serial_number": "69537",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 29,
    "volume_number": 1,
    "text": "First: Praying on graves meaning prostrating on them. Second: Prostrating towards them and facing them in prayer and supplication. Third: Building mosques over them and intending to pray in them. Scholars' Statements on the Meaning of the Mentioned Taking A group of scholars held each of these meanings, and explicit texts came with them from the Master of Prophets, peace be upon him. As for the first, Ibn Hajar Al-Haytami said in \"Al-Zawajir\" (1 / 121): Taking the grave as a mosque means praying on it or towards it. This is a text from him that he understands the mentioned taking as including two meanings, one of which is praying on the grave. Al-San'ani said in \"Subul Al-Salam\" (1 / 214): \"Taking graves as mosques is more general than meaning praying towards them or meaning praying on them.\" I say: Meaning it includes both meanings, and it is possible that he intended the three meanings, which is what Imam Al-Shafi'i, may Allah have mercy on him, understood, and his text on that will come. Witnesses for the first meaning are hadiths: First: From Abu Saeed Al-Khudri: \"That the Messenger of Allah, peace be upon him, forbade building over graves, sitting on them, or praying on them.\" (31) Second: His saying, peace be upon him: \"Do not pray towards a grave nor pray on a grave.\" (32) Third: From Anas: That the Prophet, peace be upon him, forbade... and was asked about praying amidst graves. He said: It was mentioned to me that the Prophet, peace be upon him, said: \"The Children of Israel took the graves of their prophets as mosques, so Allah Almighty cursed them.\" (33) As for the second meaning: Al-Munawi said in \"Fayd Al-Qadir\" explaining the third hadith mentioned above: Meaning they took them as their Qibla direction with their false belief. Taking them as mosques necessitates (34) taking mosques over them and vice versa. He clarified by this the reason for their cursing due to the exaggeration in veneration. Al-Qadi (meaning Al-Baydawi) said: Since the Jews used to prostrate to the graves of their prophets out of veneration for their status and make them a Qibla and turn towards them in prayer, taking them as idols, Allah cursed them and prevented Muslims from the like of that and forbade them from it. I say: This is a meaning explicitly forbidden, so he, peace be upon him, said: Do not sit on graves nor pray towards them. (35)",
    "foot_note": "1. (31) - Narrated by Abu Ya'la in his \"Musnad\" (Folio 66 / 2) and its chain is authentic. Al-Haythami said (3 / 61): \"Its men are trustworthy.\" \n32. - 2 Narrated by Al-Tabarani in \"Al-Mu'jam Al-Kabir\" (3 / 145 / 2) and from him Al-Diya Al-Maqdisi in \"Al-Mukhtara\" from Abdullah bin Kaysan from Ikrimah from Ibn Abbas raised. Al-Maqdisi said: Abdullah bin Kaysan, Al-Bukhari said of him: Munkar al-Hadith. Abu Hatim Al-Razi said weak. Al-Nasa'i said not strong. \"Except that when I saw Ibn Khuzaimah and Al-Busti extracted for him, we extracted it.\" \n33. - Narrated by Abdur-Razzaq (1591) and it is Mursal with authentic chain. The point of witness is that Umar used the hadith as evidence for the prohibition of praying between graves, indicating he meant the mentioned meaning. \n34. - Meaning: Prostrating towards them necessitates building mosques over them, as building mosques over them necessitates prostrating towards them, and this is an observed reality. \n35. - Narrated by Muslim (3 / 62), Abu Dawud (1 / 71), Al-Nasa'i (1 / 124), Al-Tirmidhi (2 / 154), and Al-Tahawi in \"Sharh\".",
    "book_id": "349",
    "new_page_number": 32
  },
  {
    "serial_number": "69538",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 30,
    "volume_number": 1,
    "text": "I say: But the hadith is authentic, for it has another path better than this one with Al-Tabarani (3 / 150 / 1) from Ibn Abbas, suspended by Al-Bukhari in \"Al-Tarikh Al-Saghir\" (p. 163). Its first part has a witness from the hadith of Abu Marthad coming soon.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 33
  },
  {
    "serial_number": "69539",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 31,
    "volume_number": 1,
    "text": "Al-Ma'ani\" (1 / 296), Al-Bayhaqi (3 / 435), Ahmad (4 / 135), and Ibn Asakir (2 / 1512 and 152 / 2) from the hadith of Abu Marthad Al-Ghanawi. Ahmad said: \"Its chain is good.\" As for the statement of Sheikh Suleiman, the grandson of Sheikh Muhammad bin Abdul Wahhab (may Allah have mercy on them), in his footnote on \"Al-Muqni'\" (1125): \"Agreed upon,\" it is an illusion from him. He then attributed it (p. 281) to Muslim alone, which was correct. Despite his knowledge and virtue, he has very many illusions in such extractions, which makes relying on him for hadith extraction unreliable. I strike these other examples as a notification to students of knowledge and as advice to them, for indeed, the religion is advice.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 34
  },
  {
    "serial_number": "69540",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 32,
    "volume_number": 1,
    "text": "1 - He said on \"p. 20\": Jabir (may Allah be pleased with him) narrated that the Prophet (peace and blessings of Allah be upon him) said: \"Do not benefit from the dead animal (carrion) in any way.\" Narrated by Al-Daraqutni with a good chain. I say: It is a weak hadith, and there is something in the Sahih that contradicts it. Attributing it to Al-Daraqutni is an illusion; I have not found anyone who preceded him in this.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 35
  },
  {
    "serial_number": "69541",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 33,
    "volume_number": 1,
    "text": "2 - He said on \"p. 28\" regarding his saying (peace and blessings of Allah be upon him): \"Whoever cleanses himself from wind (flatulence), he is not of us,\" narrated by Al-Tabarani in his \"Al-Mu'jam Al-Saghir.\" I say: This is not in the \"Mu'jam,\" and I inform the people of this, and praise be to Allah, for I have served it and arranged it according to the Musnads of the Companions, extracted its hadiths, and created a comprehensive index for its hadiths. Furthermore, being certain about attributing it to the Prophet (peace and blessings of Allah be upon him) is questionable because it is from the narration of Abu Al-Zubayr from Jabir, as extracted by Al-Jurjani (272) and others, and Abu Al-Zubayr is a Mudallis (one who obfuscates chains) and used the 'an'anah form (saying 'from').",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 36
  },
  {
    "serial_number": "69542",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 34,
    "volume_number": 1,
    "text": "3 - He said on \"p. 29\": The Prophet (peace and blessings of Allah be upon him) said: \"The smell of the mouth of a fasting person...\" narrated by Al-Tirmidhi. I say: It is in \"Sahih Al-Bukhari\" and \"Sahih Muslim.\"",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 37
  },
  {
    "serial_number": "69543",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 35,
    "volume_number": 1,
    "text": "Sheikh Ali Al-Qari said in \"Al-Mirqah\" (2 / 372) explaining the reasoning for the prohibition: \"Because of the excessive veneration involved, as if it were the rank of the Worshipped. If this veneration were truly for the grave or its occupant, the one venerating would commit disbelief (Kufr). Thus, imitating it is disliked (Makruh), and the dislike should be that of prohibition (Tahrim). Similar to it regarding meaning, or even more so, is the funeral (Janazah) placed (meaning as the Qiblah of the worshippers). This is a trial that the people of Mecca have been afflicted with, where they place the funeral near the Kaaba and then face towards it.\" I say: He means during the obligatory prayer. This is a general affliction that has spread to the lands of Sham, Anatolia, and others. We came across a very ugly photograph a month ago depicting a row of worshippers prostrating towards coffins lined up in front of them containing the bodies of a group of Turks who had died drowning in a ship. On this occasion, we draw attention to the fact that the predominant guidance of the Prophet (peace and blessings of Allah be upon him) was to pray over funerals in the \"Musalla\" (place of prayer) outside the mosque. Perhaps one of the wisdoms behind that is to keep the worshippers far from falling into such violations as warned by the scholar Al-Qari (may Allah have mercy on him). Similar to the previous hadith is what Thabit Al-Bunani narrated from Anas (may Allah be pleased with him) who said: I was praying near a grave, so Omar bin Al-Khattab saw me and said: \"The grave, the grave!\" So I raised my sight to the sky, thinking he was saying: \"The moon\" (36). As for the third meaning: Imam Al-Bukhari held this view, for he titled the first hadith with his saying: \"Chapter: What is disliked regarding taking graves as a place of worship upon the graves.\" He indicated by this that the prohibition of taking graves as a place of worship necessitates the prohibition of building mosques upon them. This is a clear matter, and Al-Manawi explicitly stated it recently. Al-Hafiz Ibn Hajar said in the explanation of the hadith: \"Al-Kirmani said: The implication of the hadith is the prevention of taking the grave as a mosque, and the meaning of the chapter title is taking a mosque upon the grave; their concepts are different. It is answered that they are concomitant, even if the concepts differ.\"",
    "foot_note": "1. (36) - Narrated by Abu Al-Hasan Al-Dinawari in \"A Part containing Councils from the Amali of Abu Al-Hasan Al-Qazwini (Folio 3 / 1) with a Sahih chain, and Al-Bukhari suspended it (1 / 437 Fath), and Abdul Razzaq also connected it in his \"Musannaf\" (1 / 404 // 1581) and added: \"I only say the grave: Do not pray towards it.\"",
    "book_id": "349",
    "new_page_number": 38
  },
  {
    "serial_number": "69544",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 36,
    "volume_number": 1,
    "text": "This meaning is what Aisha (may Allah be pleased with her) pointed to in her statement at the end of the first hadith: \"If not for that, his grave would have been made prominent, but he feared it would be taken as a mosque.\" The meaning is: If not for that curse which the Jews and Christians deserved because of their taking graves as mosques—which necessitates building upon them—his grave (peace and blessings of Allah be upon him) would have been made in prominent, exposed land. However, the Companions (may Allah be pleased with them) did not do that for fear that a mosque would be built upon it by some of those who come after them, thus including them in the curse. This is supported by what Ibn Sa'd narrated (2 / 241) with a Sahih chain from Al-Hasan (Al-Basri) who said: They consulted (37) about burying him (peace and blessings of Allah be upon him) in the mosque, so Aisha said: Indeed, the Messenger of Allah (peace and blessings of Allah be upon him) had his head placed in my lap when he said: \"May Allah kill peoples who took the graves of their prophets as mosques.\" So their opinion settled on burying him where his soul was taken, in Aisha's house. I say: This narration, despite being Mursal (hurried), indicates two things: First: That Aisha understood from the \"taking\" mentioned in the hadith that it includes the mosque which might encompass the grave, so it applies even more so to the mosque built upon the grave. Second: That the Companions confirmed her on this understanding, and thus they returned to her opinion and buried him (peace and blessings of Allah be upon him) in her house. This indicates that there is no difference between building a mosque on the grave or introducing the grave into the mosque; all is forbidden (Haram) because the concern is one. Therefore, Al-Hafiz Al-Iraqi said: \"If one builds a mosque intending to be buried in part of it, he enters into the curse. Rather, burial in the mosque is forbidden, and even if it is stipulated that he be buried in it, the stipulation is invalid due to its contradiction with designating it as a mosque\" (38).",
    "foot_note": "1. (37) - Meaning they consulted each other.\n38. - Al-Manawi quoted it in \"Fayd al-Qadir\" (5 / 274) and affirmed it.",
    "book_id": "349",
    "new_page_number": 39
  },
  {
    "serial_number": "69545",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 37,
    "volume_number": 1,
    "text": "I say: In this is an indication that the mosque and the grave do not combine in the religion of Islam, as mentioned previously and will be mentioned. This meaning is witnessed by the fifth hadith mentioned earlier with the wording: \"Those are a people who, when a righteous man among them died, built a mosque over his grave... Those are the worst of creation...\" It is an explicit text regarding the prohibition of building a mosque over the graves of prophets and the righteous, because he stated that it is one of the causes for them being the worst of creation in the sight of Allah the Exalted. It is supported by the hadith of Jabir (may Allah be pleased with him) who said: \"The Messenger of Allah (peace and blessings of Allah be upon him) forbade plastering the grave, sitting on it, and building over it\" (39). Due to its generality, it includes building a mosque over the grave, just as it includes building a dome over it; rather, the former is more deserving of prohibition, as is obvious. Thus, it is established that this meaning is also correct, indicated by the word \"taking\" (Itikhadh) and supported by other evidences. As for the inclusion of the prohibition of praying in mosques built over graves in the hadiths, its indication is even clearer. This is because prohibiting the building of mosques over graves necessitates prohibiting prayer within them, based on the principle that prohibiting the means necessitates prohibiting the intended end and using it as a means to that end. An example of this is: If the Lawgiver forbids selling alcohol, then the prohibition of drinking it is included in that, as is obvious; rather, the prohibition is a fortiori. It is very clear that prohibiting the building of mosques over graves is not intended for itself, just as the command to build mosques in neighborhoods and localities is not intended for itself, but all of that is for the sake of prayer within them, negatively or positively. The following example clarifies this: If a man built a mosque in a desolate place, uninhabited and visited by no one for prayer, this man would have no reward for building this mosque; rather, in my view, he is sinful for wasting money and placing a thing in other than its place. So if the Lawgiver commands building mosques, He implicitly commands praying in them because that is the purpose of the building. Likewise, if He forbids building mosques over graves, He implicitly forbids praying in them because that is the purpose of the building as well. This is clear and not hidden from a rational person, Allah willing. Preference for the hadith covering all meanings and Al-Shafi'i's statement on that. Summary of the speech: The \"taking\" mentioned in the previous hadiths includes all these three meanings. It is from his (peace and blessings of Allah be upon him) comprehensive speech. Imam Al-Shafi'i (may Allah have mercy on him) held this view. In his book \"Al-Umm\" (1 / 246), the text reads: \"I dislike that a mosque be built over a grave, or that it be leveled or prayed upon while it is not leveled (meaning it is prominent and known) or prayed towards.\" He said: \"And if he prays towards it, it suffices him, but he has done wrong. Malik informed us that the Messenger of Allah (peace and blessings of Allah be upon him) said: 'May Allah kill the Jews and Christians; they took the graves of their prophets as mosques.'\" He said: \"I dislike this due to the Sunnah and the relics (Athar), and strictly dislike—and Allah knows best—that anyone of the Muslims be venerated (meaning his grave be taken as a mosque) and there is no safety in that from Fitnah (trial) and misguidance for those who come after him.\"",
    "foot_note": "1. (39) - Narrated by Muslim (3 / 62), and the context is his, and Ibn Abi Shaybah (4 / 134), and Al-Tirmidhi (2 / 155) and he authenticated it, and Ahmad (3 / 339, 399).",
    "book_id": "349",
    "new_page_number": 40
  },
  {
    "serial_number": "69546",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 38,
    "volume_number": 1,
    "text": "Know that this hadith of Jabir regarding the prohibition of building over the grave is a Sahih hadith; no one with knowledge of the methods of authentication and weakening doubts that. So do not be deceived by Al-Kawthari's defecting of it in his \"Maqalat\" (p. 159) claiming that \"it contains the 'an'anah (saying 'from') of Abu Al-Zubayr.\" For Ibn Al-Zubayr explicitly stated he heard it (Tahdith) in Muslim and likewise in Ahmad. I do not believe this is hidden from Al-Kawthari, but he does that deliberately, which is the habit of the people of desires (Ahl al-Ahwa), ancient and modern; they weaken Sahih hadiths if they are against them and authenticate weak hadiths if they are for them. This Al-Kawthari is famous for that among the people of knowledge, and I have clarified some of this in \"The Weak and Fabricated Hadiths and Their Evil Effect on the Nation\" (Hadiths 23, 24, and 25), so let whoever wishes to verify what we say refer to it. Another example will come to you in this book. Supporting the authenticity of the hadith is that Abu Al-Zubayr was not alone in narrating it; rather, Suleiman bin Musa followed him in Ahmad and others. When Al-Tirmidhi authenticated it, he said: \"It has been narrated from more than one path from Jabir.\" Abu Nadrah also followed him in Ibn Al-Najjar's \"Tail of the History of Baghdad\" (10 / 201 / 1). It has a corroborating evidence (Shahid) from Umm Salamah in Ahmad, and another from Abu Sa'id as in \"Al-Kawakib Al-Darari\" (Folio 86-87 Tafsir 548).",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 41
  },
  {
    "serial_number": "69547",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 39,
    "volume_number": 1,
    "text": "He inferred from the hadith the three meanings mentioned in the context of his speech, so it is clear evidence that he understands the hadith in its generality. The researcher Sheikh Ali Al-Qari did likewise, quoting some Imams of the Hanafis, saying in \"Mirqat al-Mafatih Sharh Mishkat al-Masabih\" (1 / 45): \"The reason for cursing them: Either because they used to prostrate to the graves of their prophets out of veneration for them, and that is clear Shirk (Polytheism). Or because they used to undertake prayer to Allah the Exalted in the burial places of the prophets, and prostration upon their graves, and facing towards their graves during prayer, considering that as worship of Allah and exaggeration in venerating the prophets. That is hidden Shirk, because it contains what amounts to venerating a created being in a way not permitted. So the Prophet (peace and blessings of Allah be upon him) forbade his nation from that, either due to the resemblance of that action to the way of the Jews or to eliminate hidden Shirk. This was said by some commentators from our Imams. It is supported by what came in a narration: 'He warns against what they did.'\" I say: The first reason he mentioned, which is prostrating to the graves of prophets out of veneration for them, even if its occurrence among Jews and Christians is not unlikely, it is not what immediately comes to mind from his saying (peace and blessings of Allah be upon him): \"They took the graves of their prophets as mosques.\" For its apparent meaning is that they took them as mosques for the worship of Allah within them according to the previous meanings, seeking blessings through those buried therein from the prophets. Even if this led them, as it leads others, to fall into clear Shirk, as Sheikh Al-Qari mentioned.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 42
  },
  {
    "serial_number": "69548",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 40,
    "volume_number": 1,
    "text": "Chapter Three",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 43
  },
  {
    "serial_number": "69549",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 41,
    "volume_number": 1,
    "text": "Taking Mosques upon Graves is among the Major Sins. After the meaning of \"taking\" mentioned in the previous hadiths has become clear to us, it is appropriate for us to pause a little at these hadiths to recognize from them the ruling of the mentioned \"taking,\" guided in that by what scholars have mentioned about it. I say: Everyone who contemplates those noble hadiths will see in a manner that leaves no doubt that the mentioned \"taking\" is forbidden, rather it is a major sin among the Major Sins (Kabir). This is because the curse mentioned in them and the description of the violators as being the worst of creation in the sight of Allah, the Blessed and Exalted, cannot be applied to one who commits something that is not a major sin, as is not hidden regarding the schools of the scholars on this. The four schools of thought have agreed on the prohibition of that, and some of them have explicitly stated that it is a major sin. Here are the details of the schools on that:",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 44
  },
  {
    "serial_number": "69550",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 42,
    "volume_number": 1,
    "text": "1 - The Shafi'i School: It is a major sin. The jurist Ibn Hajar Al-Haytami said in \"Al-Zawajir 'an Iqtiraf Al-Kaba'ir\" (The Deterrents from Committing Major Sins) (1 / 120): \"The ninety-third, ninety-fourth, ninety-fifth, ninety-sixth, ninety-seventh, and ninety-eighth major sins are: Taking graves as mosques, lighting lamps upon them, taking them as idols, circumambulating them, touching them (for blessing), and praying towards them.\" Then he cited some of the previously mentioned hadiths and others, then said (p. 111): \"[Note]: Counting these six as major sins occurred in the speech of some Shafi'is, and it seems he took that from what I mentioned of the hadiths. The reason for taking a grave as a mosque being one of them is clear, because he cursed the one who did that with the graves of his prophets, and made those who do that with the graves of their righteous ones the worst of creation in the sight of Allah the Exalted on the Day of Resurrection. In this is a warning to us, as in the narration: 'He warns against what they did,' meaning he warns his nation by saying that to them, lest they do as those did and be cursed as they were cursed. Hence our companions said: Praying towards the graves of prophets and saints for blessing and veneration is forbidden, and similar to it is praying upon it for blessing and veneration. That this action is a major sin is apparent from the mentioned hadiths, as you have known.\" Some Hanbalis said:",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 45
  },
  {
    "serial_number": "69551",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 43,
    "volume_number": 1,
    "text": "\"A man's intention to pray at a grave seeking blessing by it is the essence of opposing Allah and His Messenger (peace and blessings of Allah be upon him) and innovating a religion that Allah did not authorize, due to the prohibition against it. Then, by consensus, the greatest of prohibitions and causes of Shirk is praying at them and taking them as mosques or building over them. The saying of 'dislike' (Karahah) is interpreted as other than that [i.e., prohibition], for it is not thought of the scholars that they would permit an action for which the doer is cursed by Mutawatir narration from the Prophet (peace and blessings of Allah be upon him). It is obligatory to rush to demolish them and demolish the domes over the graves, for they are more harmful than the Mosque of Harm (Masjid al-Dirar) because they were founded on disobedience to the Messenger of Allah (peace and blessings of Allah be upon him), as he forbade that. The Messenger of Allah (peace and blessings of Allah be upon him) commanded the demolition of elevated graves. It is obligatory to remove every lantern or lamp on a grave, and its endowment (Waqf) and vow (Nadhr) are not valid. End quote.\" All of this is the speech of the jurist Ibn Hajar Al-Haytami, and the researcher Al-Alusi affirmed him in \"Ruh al-Ma'ani\" (5 / 31). It is speech that indicates understanding and jurisprudence in the religion. His saying regarding what he quoted from some Hanbalis: \"The saying of 'dislike' is interpreted as other than that,\" seems to point to Shafi'i's saying \"And I dislike that a mosque be built over a grave...\" etc., his speech which I quoted in full previously (p. 27). His followers among the Shafi'is are upon this, as in \"Al-Tahdhib\" and its explanation \"Al-Majmu'.\" It is strange that they argue for this using some of the previously mentioned hadiths, even though they are explicit in prohibiting it and cursing the doer. If 'dislike' meant prohibition to them, the matter would be close, but for them, it is for purification (Tanzih). So how does the saying of (Karahah/Dislike) align with those hadiths they use as evidence for it? I say this, although I do not rule out interpreting 'dislike' in Shafi'i's previous statement specifically as Prohibitive Dislike (Karahah Tahrimiyyah), because that is the intended Sharia meaning in Quranic usage. There is no doubt that Shafi'i is influenced by the style of the Quran to the utmost degree. So if we find in his speech a term that has a special meaning in the Holy Quran, it is obligatory to interpret it according to that, not according to the meaning coined by later scholars. For Allah the Exalted said: {But He has made hateful [karraha] to you disbelief, defiance, and disobedience} (40). These are all forbidden things. This meaning, and Allah knows best, is what Shafi'i (may Allah have mercy on him) intended by his previous saying \"And I dislike.\" This is supported by the fact that he said following that: \"And if he prays towards it, it suffices him, but he has done wrong.\" For his saying \"he has done wrong\" (asa'a) means he committed a Sayyi'ah (sin/evil deed), meaning a forbidden act (Haram). For this is what is intended by Sayyi'ah in the Quranic style as well. Allah the Exalted said in Surah (Al-Isra) after forbidding the killing of children, approaching adultery, killing the soul, and other things: {All that - its evil [sayyi'uhu] is ever, in the sight of your Lord, detested [makruhan]} (41), meaning forbidden.",
    "foot_note": "1. (40) - Surah Al-Hujurat Verse 7 \n41. - Surah Al-Isra Verse 38",
    "book_id": "349",
    "new_page_number": 46
  },
  {
    "serial_number": "69552",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 44,
    "volume_number": 1,
    "text": "Confirming that this meaning is what is intended by \"dislike\" (Karahah) in Shafi'i's speech on this issue is that his methodology is that the default in prohibition is Tahrim (forbidden status) unless there is evidence indicating another meaning, as he explicitly stated in his treatise \"Jima' al-Ilm\" (p. 125) and similarly in his book \"Al-Risala\" (p. 343). It is known to everyone who has studied this issue with its evidences that there is no evidence diverting the prohibition mentioned in some of the previous hadiths to anything other than Tahrim. How could there be, when the hadiths confirm it is for Tahrim as previously mentioned? Therefore, I am certain that Tahrim is the view of Shafi'i, especially since he explicitly stated the dislike after mentioning the hadith \"May Allah kill the Jews and Christians; they took the graves of their prophets as mosques\" as mentioned before. So it is no surprise then if Al-Hafiz Al-Iraqi, who is Shafi'i in Madhhab, explicitly stated the prohibition of building a mosque over a grave as previously mentioned. And Allah knows best. For this reason, we say: He erred who attributed to Imam Shafi'i the opinion permitting a man to marry his daughter from Zina (adultery) based on the argument that he explicitly stated the \"dislike\" of that, and dislike does not negate permissibility if it is for Tanzih (purification/preference). Ibn al-Qayyim said in \"I'lam al-Muwaqqi'in\" (1 / 47-48): \"Shafi'i stated the dislike of a man marrying his daughter from the water of Zina, and he never said it is permissible or allowed. What befits his majesty, leadership, and the position Allah placed him in religion is that this dislike from him is on the basis of prohibition. He used the term 'dislike' because the Haram is disliked by Allah and His Messenger (peace and blessings of Allah be upon him). Allah the Exalted said following the mention of what He forbade of prohibitions from His saying {And your Lord has decreed that you not worship except Him...} (42) to His saying {And do not kill the soul which Allah has forbidden, except by right...} (43) to His saying {And do not pursue that of which you have no knowledge} (44)",
    "foot_note": "1. (42) - Surah Al-Isra Verse 23 \n43. - Surah Al-An'am Verse 151 \n44. - Surah Al-Isra Verse 36 until the end of the verses, then He said: {All that - its evil is ever, in the sight of your Lord, detested [makruhan]} (45). And in the Sahih: 'Verily Allah, the Mighty and Majestic, disliked for you: gossip (he said, she said), asking too many questions, and wasting wealth.' The Salaf used to use 'Karahah' in the meaning in which it was used in the speech of Allah and His Messenger (peace and blessings of Allah be upon him). However, later scholars coined a terminology restricting 'Karahah' to what is not forbidden, where leaving it is preferable to doing it. Then, those among them who did so interpreted the speech of the Imams according to the modern terminology, and thus erred in that. An even uglier error is one who interprets the word 'Karahah' or the phrase 'it is not appropriate' in the speech of Allah and His Messenger (peace and blessings of Allah be upon him) according to the modern terminological meaning.\" On this occasion, we say: It is obligatory for people of knowledge to pay attention to the modern meanings that have occurred to Arabic words which carry specific known meanings among the Arabs that are different from these modern meanings. Because the Quran was revealed in the language of the Arabs, its vocabulary and sentences must be understood within the limits of what the Arabs upon whom the Quran was revealed understood. It is not permissible to interpret it with these emergent terminological meanings agreed upon by later scholars; otherwise, the interpreter using these meanings will fall into error and fabricating against Allah and His Messenger (peace and blessings of Allah be upon him) without realizing it. I have presented an example of that with the word (Karahah). Here is another example: The word (Sunnah). Linguistically, it is the path/way. This includes everything the Messenger (peace and blessings of Allah be upon him) was upon of guidance and light, whether obligatory or voluntary. As for terminologically, it is specific to what is not obligatory of his guidance (peace and blessings of Allah be upon him). So it is not permissible to interpret the word (Sunnah) that appeared in some noble hadiths with this terminological meaning, such as his saying (peace and blessings of Allah be upon him): \"...And upon you is my Sunnah...\" and his saying (peace and blessings of Allah be upon him) \"...So whoever turns away from my Sunnah is not of me.\" Similar is the hadith cited by some late Sheikhs urging adherence to the Sunnah in its terminological meaning, which is: \"Whoever leaves my Sunnah will not obtain my intercession.\" They erred twice: \n45. - Surah Al-Isra Verse 38",
    "book_id": "349",
    "new_page_number": 47
  },
  {
    "serial_number": "69553",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 45,
    "volume_number": 1,
    "text": "First: Their attribution of the hadith to the Prophet (peace and blessings of Allah be upon him), and it has no basis as far as we know. Second: Their interpretation of the Sunnah with the terminological meaning, out of heedlessness of its Sharia meaning. How often do people err in what we are discussing due to such heedlessness? For this reason, Sheikh al-Islam Ibn Taymiyyah and his student Ibn al-Qayyim (may Allah have mercy on them) frequently drew attention to this and commanded referring to the language, not the custom (Urf), when interpreting Sharia terms. This is, in reality, a foundation for what is called today \"The Historical Study of Terms.\" It is appropriate for us to indicate that one of the most important purposes of the Arabic Language Academy in the United Arab Republic in Egypt is \"creating a historical dictionary of the Arabic language and publishing precise research on the history of some words and the changes that occurred to their implications,\" as stated in the second paragraph of the second article of Law No. (434) (1955) regarding the organization of the Arabic Language Academy (see \"Majallat al-Mujtama'\" Vol 8 p 5). Perhaps the Academy will undertake this great work and entrust it to Muslim Arab hands, for the people of Mecca know its mountain passes best, and the owner of the house knows best what is in it. By doing so, this project will be safe from the plotting of Orientalists and the deceit of colonialists.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 48
  },
  {
    "serial_number": "69554",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 46,
    "volume_number": 1,
    "text": "2 - The Hanafi School: Prohibitive Dislike (Karahah Tahrimiyyah). Dislike in this Sharia meaning has been held by the Hanafis here. Imam Muhammad, the student of Abu Hanifa, said in his book \"Al-Athar\" (p. 45): \"We do not see that anything should be added to what came out of the grave, and we dislike that it be plastered or clayed, or that a mosque be made near it.\" Dislike according to the Hanafis, if used absolutely, implies prohibition (Tahrim) as is known among them. Ibn Al-Malik from among them explicitly stated prohibition in this issue, as will follow.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 49
  },
  {
    "serial_number": "69555",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 47,
    "volume_number": 1,
    "text": "3 - The Maliki School: Prohibition. Al-Qurtubi said in his Tafsir (10 / 38) after mentioning the fifth hadith:",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 50
  },
  {
    "serial_number": "69556",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 48,
    "volume_number": 1,
    "text": "\"Our scholars said: It is forbidden for Muslims to take the graves of prophets and scholars as mosques.\"",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 51
  },
  {
    "serial_number": "69557",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 49,
    "volume_number": 1,
    "text": "4 - The Hanbali School: Prohibition. The Hanbali school also holds the view of prohibition, as in \"Sharh al-Muntaha\" (1 / 353) and others. Rather, some of them explicitly stated the invalidity of prayer in mosques built over graves and the obligation to demolish them. Ibn al-Qayyim said in \"Zad al-Ma'ad\" (3 / 22) regarding the jurisprudence and benefits contained in the Battle of Tabuk, and after mentioning the story of the Mosque of Harm (Masjid al-Dirar) which Allah the Blessed and Exalted forbade His Prophet from praying in, and how he (peace and blessings of Allah be upon him) demolished and burned it, said: \"From this is the burning of places of disobedience where Allah and His Messenger (peace and blessings of Allah be upon him) are disobeyed. A mosque where prayer is performed and the name of Allah is mentioned, when its construction causes harm and division among the believers and is a shelter for hypocrites, and every place of this nature; it is obligatory upon the Imam (46) to disable it, either by demolishing or burning, or by altering its form and taking it out of what it was established for. If this is the case for the Mosque of Harm, then the shrines of Shirk whose custodians call for taking those within them as rivals besides Allah are more deserving of that and more obligatory. Likewise are the places of disobedience and immorality, such as taverns, houses of winemakers, and lords of vices. Omar bin Al-Khattab burned a whole village where wine was sold, and he burned the shop of Ruwayshid Al-Thaqafi (47) and named him...",
    "foot_note": "1. (46) - I say: The implication of this is that it is not obligatory on other than the Imam, and likewise whoever deputizes for him. This is what correct reasoning dictates, because if others were to do it, it would result in corruption and trials among Muslims that might be greater than the benefit intended to be brought. \n47. - Narrated by Al-Dawlabi in \"Al-Kuna\" (1 / 189) from Ibrahim bin Abdul Rahman bin Awf who said: I saw Omar burn the house of Ruwayshid Al-Thaqafi until it was like a ember or coal, and he was our neighbor selling wine. Its chain is Sahih. And Abdul Razzaq narrated it from Safiyyah bint Abi Ubayd as in \"Al-Jami' Al-Kabir\" (3 / 204 / 1) and Abu Ubayd in \"Al-Amwal\" (p. 103) from Ibn Umar, and its chain is also Sahih.",
    "book_id": "349",
    "new_page_number": 52
  },
  {
    "serial_number": "69558",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 50,
    "volume_number": 1,
    "text": "Fuwaysiq (little sinner). He burned the palace (48) of Sa'd when he secluded himself from the subjects. The Messenger of Allah (peace and blessings of Allah be upon him) intended to burn the houses of those who abandoned attending the congregation and Friday prayer (49), and he was only prevented by the presence of women and offspring within them upon whom it is not obligatory, as he reported about that (50). From this: An endowment (Waqf) is not valid for other than righteousness or closeness to Allah, just as the endowment of this mosque was not valid. Based on this, the mosque is demolished if built over a grave, just as the dead is exhumed if buried in a mosque. Imam Ahmad and others explicitly stated this. A mosque and a grave do not combine in the religion of Islam; rather, whichever of them occurred to the other is prevented from it, and the ruling is for the former. If they were placed together, it is not permissible. This endowment is not valid, it is not permissible, and prayer in this mosque is not valid due to the prohibition of the Messenger of Allah (peace and blessings of Allah be upon him) against that and his cursing of the one who takes the grave as a mosque or lights a lamp over it (51). This is the religion of Islam with which Allah sent His Messenger and Prophet, and its strangeness among people is as you see.\"",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 53
  },
  {
    "serial_number": "69559",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 51,
    "volume_number": 1,
    "text": "51 - He refers to the hadith of Ibn Abbas \"Allah cursed the women who visit graves and those who take mosques and lamps over them.\" Narrated by Abu Dawood and others, but its chain is weak, even if many Salafis are fond of mentioning it. The truth is more deserving of being said and followed. Among those who weakened it from the earlier scholars is Imam Muslim, who said in \"Kitab al-Tafsil\":",
    "foot_note": "1. (48) - Meaning the door of the palace. The story was narrated by Abdullah bin Al-Mubarak in \"Al-Zuhd\" (179 / 1) from \"Al-Kawakib Al-Darari\" Tafsir (575 and No. 513, 528 printed) and Ahmad (No. 390) with a chain whose men are trustworthy. \n49. - Agreed upon from the hadith of Abu Hurairah, extracted in \"Sahih Abi Dawood\" (557 and 558). (Note): The Friday prayer hadith is another hadith from the narration of Ibn Mas'ud raised (Marfu'), extracted by Muslim without Al-Bukhari. \n50. - I say: This, although it is reasonable, the chain regarding it is not Sahih from him (peace and blessings of Allah be upon him), for it contains Abu Ma'shar Najih Al-Madani, who is weak due to his poor memory. Rather, his hadith is Munkar (denounced) as I clarified in \"Takhrij Al-Mishkat\" (1073) Second Investigation.",
    "book_id": "349",
    "new_page_number": 54
  },
  {
    "serial_number": "69560",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 52,
    "volume_number": 1,
    "text": "\"This hadith is not established, and Abu Saleh Badham: people have avoided his hadith, and hearing from Ibn Abbas is not established for him.\" Ibn Rajab quoted it in \"Al-Fath\" as in \"Al-Kawakib\" (65 / 82 / 1). I have explained the weakness of this hadith in \"The Weak and Fabricated Hadiths and Their Evil Effect on the Nation\" No. (225). I mentioned there that the hadith is Sahih due to other evidence (Sahih li-ghayrihi) except for \"taking lamps,\" which is Munkar (denounced) and did not come except from this weak path. I have now come across a gross error regarding this hadith. In the book \"Al-Qawl Al-Mubin\" by one of the virtuous contemporary Salafi scholars, it says (p. 79): \"This hadith, even if there is some criticism in its chain according to the authors of the Sunan, its chain according to Al-Hakim is free from this criticism because Al-Hakim's path is different from theirs.\" I say: The pivot of the hadith in Al-Hakim and others is on Abu Saleh from Ibn Abbas. Al-Hakim said following it (1 / 374): \"Abu Saleh is Badham, and they did not use him as proof.\" I say: He is weak according to the majority of Imams, and no one authenticated him except Al-Ajli alone as Al-Hafiz said in Al-Tahdhib. Al-Ajli is known for leniency in authentication like Ibn Hibban. We did not find another path for the hadith to strengthen it after further searching for it. Perhaps the referenced person meant by his speech some of the corroborating evidences (Shawahid) I mentioned there, but those do not contain the mention of the \"lamp\" at all, so it is an illusion upon an illusion. It is clear from what we have quoted from the scholars that the four schools agree on what the previous hadiths indicated regarding the prohibition of building mosques over graves. The most knowledgeable of people regarding their sayings and their points of agreement and disagreement, Sheikh al-Islam Ibn Taymiyyah (may Allah have mercy on him), confirmed the scholars' consensus on that. He was asked: Is prayer valid in a mosque if there is a grave in it and people gather in it for congregational and Friday prayers or not? And should the grave be leveled or a barrier or wall be made over it? He answered: \"Praise be to Allah. The Imams agreed that a mosque should not be built over a grave because the Prophet (peace and blessings of Allah be upon him) said: 'Those before you used to take graves as mosques. Beware! Do not take graves as mosques, for I forbid you from that.' And that it is not permissible to bury a dead person in a mosque. If the mosque was before the burial, it is changed either by leveling the grave or by exhuming it if it is new. If the mosque was built after the grave, then either the mosque is removed or the image of the grave is removed. The mosque that is over the grave is not to be prayed in, neither obligatory nor voluntary prayer, for it is forbidden.\" This is in his Fatawa (1 / 107 / 2 / 192). The Dar al-Ifta in the Egyptian lands adopted this fatwa of Sheikh al-Islam Ibn Taymiyyah and quoted it from him in a fatwa it issued stating the impermissibility of burial in a mosque. Let whoever wishes refer to it in \"Majallat al-Azhar\" (Vol 112 p 501 and 503) (52). Ibn Taymiyyah said in \"Al-Ikhtiyarat Al-Ilmiyyah\" (p. 52): \"It is forbidden to light lamps over graves and to take graves as mosques over them and between them. It is designated to remove them, and I know of no dispute regarding it among the known scholars.\" Ibn Urwah Al-Hanbali quoted it in \"Al-Kawakib Al-Darari\" (2 / 244 / 1) and affirmed it. Thus, we see that all scholars agreed on what the hadiths indicated of the prohibition of taking mosques over graves. So let the believers beware of opposing them and departing from their path, fearing that the threat of His saying, the Mighty and Majestic, might include them: {And whoever opposes the Messenger after guidance has become clear to him and follows other than the way of the believers - We will give him what he has taken and drive him into Hell, and evil it is as a destination} (53) and {Indeed in that is a reminder for whoever has a heart or who listens while he is present [in mind]} (54).",
    "foot_note": "1. (52) - In the same magazine, there is another article on the absolute prohibition of building over graves, see (Volume year 1930 p 359 and 364). \n53. - Surah Al-Nisa Verse 115 \n54. - Surah Qaf Verse 37",
    "book_id": "349",
    "new_page_number": 55
  },
  {
    "serial_number": "69561",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 53,
    "volume_number": 1,
    "text": "Chapter Four",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 56
  },
  {
    "serial_number": "69562",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 54,
    "volume_number": 1,
    "text": "Doubts and their Answers. A speaker might say: If the prohibition of building mosques over graves is established in the Sharia, there are many matters indicating the contrary. Here is their clarification: First: His saying, the Exalted, in Surah Al-Kahf: {Said those who prevailed in the matter, \"We will surely take [for ourselves] over them a mosque\"} (55). The aspect of the verse's indication of that: Those who said this statement were Christians as mentioned in the books of Tafsir, so taking a mosque over a grave was part of their Sharia, and the Sharia of those before us is a Sharia for us if Allah mentioned it and did not follow it with what indicates its rejection, as in this noble verse. Second: The presence of the grave of the Prophet (peace and blessings of Allah be upon him) in his noble mosque. If that were not permissible, they would not have buried him (peace and blessings of Allah be upon him) in his mosque. Third: The prayer of the Prophet (peace and blessings of Allah be upon him) in Masjid al-Khaif even though there are the graves of seventy prophets in it, as he (peace and blessings of Allah be upon him) said. Fourth: What is mentioned in some books that the grave of Ismail (peace be upon him) and others are in the Hijr of the Sacred Mosque, which is the best mosque for a worshipper to seek. Fifth: Abu Jandal (may Allah be pleased with him) building a mosque over the grave of Abu Basir (may Allah be pleased with him) during the time of the Prophet (peace and blessings of Allah be upon him) as stated in \"Al-Isti'ab\" by Ibn Abd al-Barr. Sixth: Some claimed that the prevention of taking graves as mosques was due to the reason of fearing trial (Fitnah) by the buried person, and this was removed by the firmness of Monotheism (Tawhid) in the hearts of the believers, so the prevention is removed.",
    "foot_note": "1. (55) - Surah Al-Kahf Verse 21",
    "book_id": "349",
    "new_page_number": 57
  },
  {
    "serial_number": "69563",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 55,
    "volume_number": 1,
    "text": "The Answer to the First Doubt: As for the first doubt, the answer to it is from three aspects: First: The correct view established in the science of Principles (Usul) is that the Sharia of those before us is not a Sharia for us due to many evidences (56), among them his saying (peace and blessings of Allah be upon him): \"I was given five things which no one of the prophets before me was given... (and he mentioned them, ending with) and a Prophet used to be sent to his people specifically, and I have been sent to all mankind\" (57). If this is clear, we are not obligated to take what is in the verse even if it indicated that the permissibility of building a mosque over a grave was a Sharia for those before us. Second: Suppose the correct view is the saying of those who say: \"The Sharia of those before us is a Sharia for us.\" That is conditional upon there being nothing in our Sharia that contradicts it. This condition is absent here because the hadiths are Mutawatir (consecutive/abundant) in forbidding the mentioned building as previously stated. That is proof that what is in the verse is not a Sharia for us. Third: We do not concede that the verse implies that this was a Sharia for those before us. The most it contains is that a group of people said: {We will surely take [for ourselves] over them a mosque}. It does not explicitly state that they were believers. Even if conceded, it does not imply they were righteous believers adhering to the Sharia of a sent prophet; rather, the apparent meaning is the opposite. Al-Hafiz Ibn Rajab said in \"Fath al-Bari fi Sharh al-Bukhari\" (65 / 280) from \"Al-Kawakib Al-Darari\" (58): \"The hadith 'May Allah curse the Jews who took the graves of their prophets as mosques.' The Quran has indicated something similar to what this hadith indicated, which is the saying of Allah the Mighty and Majestic in the story of the Companions of the Cave: {Said those who prevailed in the matter, 'We will surely take [for ourselves] over them a mosque'}. He made taking graves as mosques the action of those who prevailed in matters, which implies that its basis is coercion, dominance, and following desires, and that it is not the action of the people of knowledge and virtue who support what Allah sent to His messengers of guidance.\" Sheikh Ali bin Urwah said in \"Mukhtasar al-Kawakib\" (10 / 207 / 2) following Al-Hafiz Ibn Kathir in his Tafsir (3 / 78): Ibn Jarir narrated two opinions regarding those who said that (59): One of them: That they were the Muslims among them. The second: The people of Shirk among them. Allah knows best. The apparent meaning is that those who said that were the people of power and influence. But are they praiseworthy or not? There is a question in that because the Prophet (peace and blessings of Allah be upon him) said: \"May Allah curse the Jews and Christians; they took the graves of their prophets as mosques,\" warning against what they did. We have narrated from Omar bin Al-Khattab that when he found the grave of Daniel in Iraq during his time, he commanded that it be hidden from the people and that the parchment found with him containing some epics and other things be buried.\" If you know this, it is not correct to use the verse as evidence in any way. The researcher scholar Al-Alusi said in \"Ruh al-Ma'ani\" (5 / 31): \"Using the verse as evidence for the permissibility of building over the graves of scholars, taking a mosque over them, and the permissibility of prayer in that has been done by some, among them Al-Shihab Al-Khafaji in his footnotes on Al-Baydawi. It is a false, idle, corrupt, and stagnant saying, for it has been narrated...\"",
    "foot_note": "(58) - A manuscript in the Zahiriyah Library in Damascus, which is a very great book collecting rare gems from the books of early scholars and their treatises, most of which have not been printed as far as I know. I am currently in the process of extracting these books and treatises into a special index I am creating for the volumes of this book available in the library and elsewhere if I am successful in that. Then the mentioned extraction was completed from the library's volumes, so may Allah grant success to view others and extract the treasures within them.\n(56) - See if you wish the lengthy works of Principles of Jurisprudence, especially \"Al-Ihkam\" by Ibn Hazm.\n(57) - Extracted by Al-Bukhari and Muslim, and it is extracted in \"Irwa' al-Ghalil\" (No. 285).\n(59) - I say: Ibn al-Jawzi also narrated them in his Tafsir \"Zad al-Masir\" (5 / 123 Islamic Office edition) without preferring one over the other as is his habit.",
    "book_id": "349",
    "new_page_number": 58
  },
  {
    "serial_number": "69564",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 56,
    "volume_number": 1,
    "text": "Then he mentioned some of the previously mentioned hadiths and followed them with the speech of Al-Haytami in \"Al-Zawajir,\" affirming him. Then he quoted him in his book \"Sharh al-Minhaj\" stating: \"A group has issued a fatwa to demolish all buildings in the Qarafa (cemetery) of Egypt, even the dome of Imam Al-Shafi'i (upon him be mercy) which was built by some kings. It is appropriate for everyone to demolish that as long as no corruption is feared from it; otherwise, the removal is designated to the Imam, taking from the speech of Ibn Al-Rif'ah regarding reconciliation.\" End quote. Then Imam Al-Alusi said: \"Do not say: The verse is apparent in that what was mentioned is from the Sharia of those before us, and it has been used as evidence. For it has been narrated that he (peace and blessings of Allah be upon him) said: 'Whoever sleeps through a prayer or forgets it...' (60) the hadith, then he recited His saying {And establish prayer for My remembrance} (20:14), which was said to Moses (peace be upon him), and its context is evidentiary. And Abu Yusuf argued for retaliation (Qisas) occurring between male and female using the verse {And We ordained for them therein...}, and Al-Karkhi argued for it occurring between the free and the slave, and the Muslim and the Dhirnmi (61) using that verse revealed regarding the Children of Israel, and so on. For we say: Our school regarding the Sharia of those before us, even if it is binding upon us as our Sharia, implies that it is not absolute. Rather, if Allah narrated it to us without rejection, [then rejection] by His Messenger (peace and blessings of Allah be upon him) is like rejection by Him, the Mighty and Majestic (62). And you have heard that he (peace and blessings upon him) cursed those who take mosques over graves. Furthermore, that what was mentioned is from the laws of those before us is prohibited. How can taking mosques over graves be from the earlier Sharias given what you have heard of the cursing of the Jews and Christians for taking the graves of their prophets as mosques? The verse is not like the verses we mentioned just now regarding the Imams' argumentation with them. It contains nothing more than a narration of the saying of a group of people and their determination to do that. It does not come in the context of praising them or urging emulation of them. Thus, when it is not established that there was an infallible person among them, their action or determination does not indicate the legitimacy of what they were about to do.\"",
    "foot_note": "1. (60) - I say: This hadith is Sahih, extracted in the Two Sahihs, so it is not correct to preface it with \"it was narrated\" (ruwiya) because that indicates weakness in the terminology of scholars as I clarified in \"Salat al-Tarawih\" (p. 63-64), so be aware. The hadith is extracted by me in \"Sahih Abi Dawood\" (461) and (Al-Irwa') (263). \n61. - Surah Ta-Ha Verse 14 \n62. - Due to his saying (peace and blessings of Allah be upon him) \"...For what the Messenger of Allah forbade is like what Allah forbade.\" It is a Sahih hadith, even if the nose of the author of \"Al-Adwa'\" is rubbed in dust. See \"Al-Mishkat\" with my extraction (163).",
    "book_id": "349",
    "new_page_number": 59
  },
  {
    "serial_number": "69565",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 57,
    "volume_number": 1,
    "text": "\"What strengthens the lack of confidence in their action is the saying that the intended meaning refers to the rulers and sultans, as narrated from Qatada. Based on this, one can say: The first group were believers who knew the illegitimacy of taking mosques over graves, so they advised building over the entrance of the cave and blocking it, and stopping interference with its occupants. But the rulers did not accept from them, and this angered them until they swore to take a mosque. If you insist on having a good opinion of the second group, you can say: Their taking a mosque over them is not in the manner of taking mosques over graves which is forbidden and whose doer is cursed. Rather, it is taking a mosque near them and close to their cave. The explicit mention of 'indiyyah' (at/nearness) came in the narration of the story from Al-Suddi and Wahb. Such taking is not prohibited, as the most that follows from it is that the relation of the mosque to the cave understood from it is like the relation of the Prophet's Mosque to the Noble Shrine (may Allah bless and grant peace to the one in it). His saying {We will surely take... over them} would be, in this manner, like the saying of the group (Build over them). Or if you wish, say: That taking was on a cave above the mountain in which they were. There is a report from Mujahid that the King left them in their cave and built a mosque over their cave. This is closer to the apparent wording, as is obvious. All of this is needed only on the saying that the Companions of the Cave died after they were discovered. As for the saying that they slept as they slept the first time, there is no need for it as has been said (63). In summary, it is not appropriate for anyone with the slightest guidance to go against what the authentic reports and explicit narrations have articulated, relying on reasoning with this verse. For that is the utmost error and the end of lack of intelligence. I have seen those who permit what the ignorant do regarding the graves of the righteous—raising them, building them with gypsum and bricks, hanging lanterns on them, praying towards them, circumambulating them, touching them, and gathering at them at specific times, etc.—arguing with this noble verse and with what came in some narrations of the story about the King making a feast for them every year and placing them in coffins of teak. They draw analogies of one to another. All of that is opposing Allah the Exalted and His Messenger (peace and blessings of Allah be upon him) and innovating a religion that Allah the Mighty and Majestic did not authorize. It suffices you in knowing the truth to follow what the Companions of the Messenger of Allah (peace and blessings of Allah be upon him) did regarding his grave (peace and blessings of Allah be upon him), which is the best grave on the face of the earth, and understanding their actions in visiting him and greeting him. So follow that and contemplate what is here and what is there, and Allah the Glorious will take charge of your guidance.\" I say: Some contemporaries (64) have used the mentioned verse as evidence for the alleged permissibility, rather the desirability, of building mosques over graves. But from another innovated perspective slightly different from what was previously narrated and refuted. He said:",
    "foot_note": "1. (63) - He refers to what he mentioned at the beginning of the first of the two referenced pages, which is his saying: \n64. - He is Sheikh Abu Al-Fayd Ahmad Al-Siddiq Al-Ghumari in his book titled \"Ihya' al-Maqbur min Adillat Istihbab Bina' al-Masajid wa al-Qibab 'ala al-Qubur\" (Reviving the Buried with Evidences for the Desirability of Building Mosques and Domes over Graves). This book is among the strangest things Muslims have been afflicted with in this era and farthest from honest scientific research. For the author claims to abandon blind imitation (Taqlid) and act upon the Noble Hadith. I met him a few months ago in the Zahiriyah Library, and it appeared to me from the conversation between us that he is knowledgeable in the sciences of Hadith and calls for Ijtihad and fights Taqlid relentlessly, and he has some works on that as he told me. However, the session was short and did not enable me to know his direction in Aqidah (Creed), although I felt from some paragraphs of his speech that he is a Khalafi Sufi. Then that was confirmed after I read this book of his and others, where it became clear to me that he fights the People of Tawhid and opposes them in their creed intensely, and says 'Good Bid'ah' (Innovation) and supports the innovators. He did not benefit from his claim of Ijtihad except to support desires and their people, exactly as the Mujtahids of the Shia do. If you want proof of what I say, this book \"...Al-Maqbur\" is sufficient proof. For he buried all the Mutawatir hadiths regarding the prohibition of building mosques over graves held by the great Imams without known dispute among them. He is—and the truth must be said—bold, but in fighting the truth. How could he not be, when he rejects everything we mentioned of hadiths and the consensus of Imams without any proof except following the ambiguous texts like this Cave verse, his condition in that being like the condition of the innovators in rebutting the decisive texts with the ambiguous. We seek refuge in Allah from forsakenness. Some other examples of what we mentioned from his speech will come to you, and Allah is the Helper.",
    "book_id": "349",
    "new_page_number": 60
  },
  {
    "serial_number": "69566",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 58,
    "volume_number": 1,
    "text": "\"And from Al-Hasan: that he took it (meaning the mosque) for the Companions of the Cave to pray in when they woke up.\" Al-Alusi said: \"This is based on the premise that they did not die but slept as they slept the first time. Some held this view; it was even said: They will not die until the Mahdi appears and they will be among his supporters. There is no reliance on that, and in my view, it is most similar to superstitions. The evidence from this verse is Allah's approval of them in what they said and His lack of rejecting them.\" I say: This deduction is false from two aspects: First: It is not correct to consider the lack of rejection of them as an approval for them unless it is established that they were Muslims and righteous people adhering to the Sharia of their prophet. There is nothing in the verse indicating even slightly that they were so; rather, it is probable that they were not so. This is closer: that they were disbelievers or wicked people as previously mentioned in the speech of Ibn Rajab, Ibn Kathir, and others. In that case, the lack of rejection of them is not considered approval but rejection, because narrating a saying from disbelievers and wicked people is sufficient in rejecting it by attributing it to them. Thus, silence is not considered",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 61
  },
  {
    "serial_number": "69567",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 59,
    "volume_number": 1,
    "text": "approval, as is obvious. This is supported by the following aspect: Second: The mentioned deduction only stands according to the method of the people of desires from the past and contemporaries who suffice with the Quran regarding religion and do not give weight to the Sunnah. As for the method of the People of Sunnah and Hadith who believe in both Revelations, confirming his saying (peace and blessings of Allah be upon him) in the famous Sahih hadith: \"Verily I have been given the Quran and something like it with it.\" And in a narration: \"Verily, what the Messenger of Allah forbade is like what Allah forbade\" (65). This deduction according to them—and the one deducing claims to be of them—is false, clearly false. Because the rejection which he denied has occurred in the Mutawatir Sunnah as previously mentioned. So how can he say: Allah approved them and did not reject them, while Allah cursed them on the tongue of His Prophet (peace and blessings of Allah be upon him)? What rejection is clearer and more evident than this? The likeness of one who uses this verse as evidence against the previous hadiths is only like one who uses evidence for the permissibility of making statues and idols with His saying, the Exalted, regarding the Jinn who were subservient to Solomon (peace be upon him): {They made for him what he willed of elevated chambers, statues, and bowls like reservoirs, and stationary kettles} (66), using it against the Sahih hadiths that forbid statues and images. No Muslim who believes in his hadith (peace and blessings of Allah be upon him) does that. With this, the discussion on the First Doubt, which is using the Cave verse as evidence (67), and the answer to it and what branched from it, ends. The Answer to the Second Doubt: As for the second doubt, which is that the grave of the Prophet (peace and blessings of Allah be upon him) is in his mosque as is seen today, and if that were forbidden, he would not have been buried in it. The answer: This, although it is what is seen today, was not the case during the time of the Companions (may Allah be pleased with them). When the Prophet (peace and blessings of Allah be upon him) died, they buried him in his room which was next to his mosque, and a wall separated them containing a door from which the Prophet (peace and blessings of Allah be upon him) used to exit to the mosque. This is a known matter, decisive among scholars, and there is no dispute about it among them. When the Companions (may Allah be pleased with them) buried him (peace and blessings of Allah be upon him) in the room, they did so only so that no one after them could take his grave as a mosque, as previously explained in the hadith of Aisha and others (p. 9-10). However, something happened after them that was not in their calculation. That is that Al-Walid bin Abdul Malik commanded in the year eighty-eight to demolish the Prophet's Mosque and add the rooms of the wives of the Messenger of Allah (peace and blessings of Allah be upon him) to it. So he introduced the Prophetic Room—Aisha's room—into it, and thus the grave became inside the mosque (68). There was no one from the Companions in Medina at that time, contrary to what some have imagined. The Scholar Al-Hafiz Muhammad Ibn Abd al-Hadi said in \"Al-Sarim Al-Munki\" (p. 136):",
    "foot_note": "1. (65) - A Sahih hadith as previously mentioned. \n66. - Surah Saba Verse 13 \n67. - See p (40) \n68. - History of Ibn Jarir (5 / 222-223) and History of Ibn Kathir (9 / 74-75).",
    "book_id": "349",
    "new_page_number": 62
  },
  {
    "serial_number": "69568",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 60,
    "volume_number": 1,
    "text": "\"The room was only introduced into the mosque during the Caliphate of Al-Walid bin Abdul Malik after the death of all the Companions who were in Medina. The last of them to die was Jabir bin Abdullah, who died during the Caliphate of Abdul Malik; he died in the year seventy-eight. Al-Walid took over in the year eighty-six and died in the year ninety-six. The building of the mosque and the introduction of the room into it were between that (69). Abu Zaid Omar bin Shabbah Al-Numayri mentioned in 'Kitab Akhbar al-Madinah' (News of the City of the Messenger, peace and blessings of Allah be upon him) from his Sheikhs from those they narrated from: That when Ibn Omar bin Abdul Aziz was a deputy for Al-Walid over Medina in the year ninety-one, he demolished the mosque and built it with engraved stones, teak, and gold water, and he demolished the rooms of the wives of the Prophet (peace and blessings of Allah be upon him) and introduced the grave into it.\"",
    "foot_note": "1. (69) - I say: Al-Hafiz Ibn Abd al-Hadi did not name the year in which that occurred because it did not come in a firmly established narration according to the method of the Muhaddithin (Hadith scholars). What we quoted from Ibn Jarir is from the narration of Al-Waqidi, who is accused (of lying), and the narration of Ibn Shabbah coming in the speech of Al-Hafiz Ibn Abd al-Hadi revolves around unknown narrators (Majahil) who narrate from an unknown narrator, as is apparent. So there is no proof in any of that. The reliance is only on the agreement of historians that introducing the room into the mosque was during the mandate of Al-Walid. This amount is sufficient to prove that this was after the death of the Companions who were in Medina as clarified by Al-Hafiz. However, it is opposed by what Abu Abdullah Al-Razi narrated in his Mashyakhah (218 / 1) from Muhammad bin Al-Rabi' Al-Jizari: \"Sahl bin Sa'd died in Medina when he was one hundred years old, and his death was in the year ninety-one, and he was the last of the Companions of the Prophet (peace and blessings of Allah be upon him) to die in Medina.\" But I do not know this Al-Jizari, and furthermore, it is Mu'dal (perplexing/missing two or more narrators). Al-Hafiz Ibn Hajar mentioned something similar in \"Al-Isabah\" (2 / 87) from Al-Zuhri from his saying, so it is also Mu'dal or Mursal. Then he followed it by saying: \"It was said before that.\" And Ibn Abi Dawood claimed that he died in Alexandria. In \"Al-Taqrib,\" he asserted that he died in the year 88. So Allah knows best.",
    "book_id": "349",
    "new_page_number": 63
  },
  {
    "serial_number": "69569",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 61,
    "volume_number": 1,
    "text": "In summary, we do not have any text that can serve as evidence that any of the Companions were present during this time of change. Whoever claims otherwise must provide proof. As for what appears in Sharh Muslim (5/1314) that this occurred during the time of the Companions, perhaps his basis is that problematic (mu'dal) or disconnected (mursal) narration. Such narrations cannot serve as proof, especially since it is more specific than the claim; for even if it were authentic, it would only prove the existence of *one* of the Companions at that time, not \"the Companions\" [as a group]. As for the claim of some who have written on this issue without knowledge: \"Since Uthman, may Allah be pleased with him, expanded the Prophet's Mosque and included in the mosque what was not part of it, and the three graves became surrounded by the mosque, no one from the Salaf denied that,\" this is from their limitless ignorance. I do not wish to say it is from their fabrications, for no scholar has ever said that the inclusion of the three graves occurred during the time of Uthman, may Allah be pleased with him. Rather, they agreed that it happened during the reign of Al-Walid bin Abdul-Malik, as mentioned before, which is about half a century after Uthman. But they speak of what they do not know. This is because Uthman, may Allah be pleased with him, did the opposite of what they attributed to him. When he expanded the noble Prophet's Mosque, he was careful to avoid violating the hadiths referred to, so he did not expand the mosque from the side of the chambers and did not include them in it. This is exactly what his predecessor, Umar bin Al-Khattab, may Allah be pleased with them all, did. Rather, he indicated that expanding from the side referred to contains the prohibition mentioned in the previous hadiths, as will be mentioned from him shortly.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 64
  },
  {
    "serial_number": "69570",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 62,
    "volume_number": 1,
    "text": "As for their saying: \"And no one from the Salaf denied that,\" we say: How do you know that? For one of the most difficult things for rational people is to prove the negation of something that could have happened but was not known, as is well known among scholars. This is because it requires complete induction and comprehensive knowledge of everything that happened and was said about the incident regarding which the matter is to be negated. And how could such people do that, even if they were capable? If they had reviewed some books on this issue, they would not have fallen into that scandalous ignorance, and they would have found what would prevent them from not denying what they did not fully know. For Al-Hafiz Ibn Kathir said in his history (Vol. 9, p. 75) after mentioning the story of the inclusion of the Prophet's grave into the mosque: \"It is reported that Said bin Al-Musayyib denied the inclusion of Aisha's chamber into the mosque, as if he feared that the grave would be taken as a mosque.\" It does not matter much to me whether this narration is authentic or not, because we do not base a legal ruling on it. But the assumption about Said bin Al-Musayyib and other scholars who witnessed that change is that they denied it most vehemently because it clearly contradicts the previous hadiths, especially the narration of Aisha which says: \"Were it not for that, his grave would have been made prominent, but it was feared that it might be taken as a mosque.\" What the Companions, may Allah be pleased with them, feared has unfortunately happened with the inclusion of the grave into the mosque. For there is no difference between burying him, peace and blessings be upon him, in the mosque when he died—far be it from them to do so—and what those after them did by including his grave into the mosque through its expansion. The prohibition is present in any case, as previously mentioned from Al-Hafiz Al-Iraqi and Sheikh Al-Islam Ibn Taymiyyah. This assumption is supported by the fact that Said bin Al-Musayyib is one of the narrators of the second hadith as mentioned before. Is it fitting for someone who acknowledges his knowledge, virtue, and boldness in the truth to think that he denied those who contradicted the hadith he narrated, or to attribute to him the lack of denial, as claimed by those referred to when they said \"no one from the Salaf denied that\"?",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 65
  },
  {
    "serial_number": "69571",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 63,
    "volume_number": 1,
    "text": "The truth is that their statement implies a clear defamation of all the Salaf, if they only knew. For including the grave in the mosque is a clear evil (munkar) to anyone aware of the aforementioned hadiths and their meanings. It is impossible to attribute ignorance of this to all the Salaf; they, or at least some of them, knew this with certainty. If this is the case, it must be said that they denied it, even if we have not come across a text regarding it, because history has not preserved everything that happened for us. So how can it be said: \"They did not deny that\"? O Allah, forgive! Among their ignorance is their statement, following their previous one: \"And likewise the Umayyad Mosque; the Muslims entered Damascus, including Companions and others, and the grave was within the mosque, yet no one denied that.\" Their logic is strange and bizarre. They imagine that everything they see now in the Umayyad Mosque existed during the time of its first builder, Al-Walid bin Abdul-Malik. Would any rational person say this? No, no one says that except these people. We assert the invalidity of their statement and that none of the Companions or Tabi'in saw a visible grave in the Umayyad Mosque or elsewhere. Rather, the most that has been reported in some narrations from Zaid bin Arqam bin Waqid is that during the operations, they found a cave containing a box with a basket (a complete container), and in the basket was the head of John the son of Zechariah (Yahya bin Zakariya), peace be upon them, with writing on it: \"This is the head of Yahya, peace be upon him.\" Al-Walid ordered it to be returned to its place and said: \"Make the pillar above it different from the other pillars.\" So a pillar shaped like a basket for the head was placed over it. Narrated by Abu Al-Hasan Al-Raba'i in Fada'il Al-Sham (33), and via him Ibn Asakir in his history (Vol. 2, Folio 9/10). Its chain of narration is very weak; it contains Ibrahim bin Hisham Al-Ghassani, whom Abu Hatim and Abu Zur'ah declared a liar, and Al-Dhahabi said he is \"abandoned\" (matruk). Despite this, we assert that there was no image of a grave in the mosque until the late second century, based on what Al-Raba'i and Ibn Asakir narrated from Al-Walid bin Muslim, who was asked, \"Where did you hear the head of Yahya bin Zakariya is?\" He said: \"I heard it is there,\" and pointed with his hand to the basket-shaped pillar, the fourth from the eastern corner. This indicates that there was no grave there during the time of Al-Walid bin Muslim, and he died in the year 194 AH.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 66
  },
  {
    "serial_number": "69572",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 64,
    "volume_number": 1,
    "text": "As for whether that head is indeed the head of Yahya, peace be upon him, it cannot be proven. Therefore, historians have differed greatly, and the majority hold that the head of Yahya, peace be upon him, is buried in the mosque of Aleppo, not in the mosque of Damascus, as verified by our Sheikh in Ijazah (authorization), the scholar Muhammad Raghib Al-Tabbakh, in a research he published in the Journal of the Arab Scientific Academy in Damascus (Vol. 1, p. 41, 1482) under the title \"The Head of Yahya and the Head of Zakariya.\" Let whoever wishes refer to it. From a religious perspective, it does not matter to us whether this or that is proven. Whether the noble head is in this mosque or that one is the same to us. Indeed, even if we were certain of its absence in both mosques, the existence of the image of a grave in them is sufficient for it to be a violation, because the rulings of the purified Sharia are based on the apparent, not the hidden, as is well known. Testimony to this from the words of some scholars will follow. The violation is most severe if the grave is in the qibla of the mosque, as is the case in the mosque of Aleppo, and there is no denier of this from its scholars. Know that it does not avail in removing the violation that the grave is inside the mosque within an enclosure (maqsura), as the authors of the treatise claimed, because in any case, it is visible and intended by the common people and those like them among the elite for purposes intended only for Allah Almighty, such as turning towards it and seeking help from it instead of Allah, Blessed and Exalted. The visibility of the grave is the cause of the prohibition, as will be mentioned from Al-Nawawi, may Allah have mercy on him. The summary of the speech is that the statement of those we referred to, that the grave of Yahya, peace be upon him, was within the Umayyad Mosque since the Companions and others entered Damascus and no one denied it, is nothing but pure fabrication.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 67
  },
  {
    "serial_number": "69573",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 65,
    "volume_number": 1,
    "text": "It becomes clear to us from what we have presented that the noble grave was only introduced into the Prophet's Mosque when there were no Companions left in Medina, and that this was contrary to their purpose when they buried him in his chamber, peace and blessings be upon him. Therefore, it is not permissible for a Muslim, after knowing this truth, to use what happened after the Companions as evidence because it contradicts the authentic hadiths and what the Companions and Imams understood from them, as previously explained. It also contradicts the actions of Umar and Uthman when they expanded the mosque and did not include the grave in it. Therefore, we assert the error of what Al-Walid bin Abdul-Malik did, may Allah forgive him. Even if he was compelled to expand the mosque, he could have expanded it from other directions without touching the noble chamber. Umar bin Al-Khattab pointed out this type of error when he, may Allah be pleased with him, expanded the mosque from other directions and did not touch the chamber, but rather said, \"There is no way to it\" (70), indicating, may Allah be pleased with him, the prohibition expected from demolishing it and annexing it to the mosque. Despite this clear violation of the aforementioned hadiths and the Sunnah of the Rightly Guided Caliphs, those who violated the command when they introduced the Prophet's grave into the noble mosque took some precautions. They tried to minimize the violation as much as possible. Al-Nawawi said in \"Sharh Muslim\" (5/14): \"When the Companions (71) and the Tabi'in needed to increase the mosque of the Messenger of Allah, peace and blessings be upon him, when the Muslims increased in number, and the expansion extended to include the houses of the Mothers of the Believers, including the chamber of Aisha, may Allah be pleased with her, the burial place of the Messenger of Allah, peace and blessings be upon him, and his two companions Abu Bakr and Umar, may Allah be pleased with them, they built high, circular walls around the grave so that it would not appear in the mosque (72) and the common people would pray towards it, leading to the prohibition. Then they built two walls from the two northern corners of the grave and slanted them until they met, so that no one could face the grave directly.\" Al-Hafiz Ibn Rajab quoted similar to this in \"Al-Fath\" from Al-Qurtubi, as in \"Al-Kawkab\" (65/91/1). Ibn Taymiyyah mentioned in \"Al-Jawab Al-Bahir\" (Folio 9/2): \"When the chamber was introduced into the mosque, its door was blocked and another wall was built over it to protect him, peace and blessings be upon him, from his house being taken as a place of celebration (Eid) and his grave as an idol to be worshipped.\"",
    "foot_note": "1. (70) - See \"Tabaqat Ibn Sa'd\" (4/21) and \"Tarikh Dimashq\" by Ibn Asakir (8/478/2). Al-Suyuti said in \"Al-Jami' Al-Kabir\" (3/272/2): \"Its chain is authentic except that Salim Abu Al-Nadr did not meet Umar.\" Also \"Wafa' Al-Wafa\" by Al-Samhudi (1/343) and \"Al-Mushahadat Al-Ma'sumiyyah 'inda Qabr Khayr Al-Bariyyah\" by the scholar Muhammad Sultan Al-Ma'sumi, may Allah have mercy on him (p. 43), who is the author of the treatise \"Hidayat Al-Sultan ila Bilad Al-Yaban\" which one of the doctors claimed was not his but belonged to some of our brothers, even though I received it from him as a printed gift when I visited him in Mecca during my first Hajj in 1368 AH.\n71. - Attributing this to the Companions is not established as previously mentioned (p. 58-59), so be aware.\n72. - In this is clear evidence that the appearance of the grave in the mosque, even from behind windows, iron, and doors, does not remove the prohibition, as is the case with the grave of Yahya, peace be upon him, in the Umayyad Mosque in Damascus and Aleppo. Therefore, Ahmad stated that prayer is not permissible in a mosque whose qibla is towards a grave until there is another barrier between the mosque wall and the graveyard, as will be mentioned. So how about if the grave is inside the qibla of the mosque without a separating wall? From this, you learn that the saying of some:",
    "book_id": "349",
    "new_page_number": 68
  },
  {
    "serial_number": "69574",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 66,
    "volume_number": 1,
    "text": "\"Prayer in a mosque that contains a grave, like the Prophet's Mosque and the Umayyad Mosque, cannot be said to be prayer in a graveyard, for the grave is within an enclosure separate from the mosque itself, so what prevents praying in it?\" This is a statement not issued from knowledge or understanding, because the prohibition regarding the Umayyad Mosque still stands, which is the visibility of the grave from behind the enclosure. Evidence for this is people intending the grave, supplicating at it and by it, seeking help from it instead of Allah, and other things that Allah does not approve of. The Wise Lawgiver only forbade building mosques on graves to block the means and prevent such matters that occur at this grave, as will be explained. So what is the value of this decorated enclosure? It is merely another type of evil that leads people to disobey Allah and His Messenger, peace and blessings be upon him, and to venerate the occupant of the grave in ways not religiously permissible, which is observed and well-known, and some of which has been alluded to. Is it not sufficient proof of the prohibition that people face the grave during prayer intentionally or unintentionally? Perhaps those referred to and their likes say: \"There is no prohibition from this facing either due to the presence of a barrier between the worshippers and the grave, namely the grave's windows and its brass grille.\" We say: If this barrier were sufficient to prevent [the prohibition], they would not have surrounded the noble Prophet's grave with a high, circular wall, and not being satisfied with that, built two walls to prevent facing the grave, even if it were behind the circular wall. It is authentically reported from Ibn Jurayj that he said: \"I said to Ata: Do you dislike praying in the midst of graves? Or in a mosque facing a grave? He said: Yes, that used to be forbidden.\" Narrated by Abdur-Razzaq in his \"Musannaf\" (1/404). If this illustrious Tabi'i (Ata bin Abi Rabah) did not consider the mosque wall a barrier between the worshipper and the grave when it is outside the mosque, would windows, grilles, and the grave inside the mosque be considered a barrier?",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 69
  },
  {
    "serial_number": "69575",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 67,
    "volume_number": 1,
    "text": "Is there in this what convinces those writers of their ignorance, error, and rushing to speak about what they have no knowledge of? Perhaps. As for the Noble Prophet's Mosque, there is no dislike in praying in it, contrary to what they fabricated against us. The detailed discussion on it will come in \"Chapter Seven,\" Allah willing. However, I do not want to miss alerting the noble readers that those writers admit in their previous statement that prayer in a mosque containing a grave not surrounded by an enclosure is a disliked prayer, due to the absence of the reason for which they negated the dislike of prayer in the Umayyad Mosque according to their claim. Can they openly declare this admission to the people? Or is it something they were compelled to say to escape contradicting the previous hadiths publicly, even if they do not call people to act upon it for a purpose not hidden to the intelligent?",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 70
  },
  {
    "serial_number": "69576",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 68,
    "volume_number": 1,
    "text": "I said: It is regrettable that this structure has been built over for centuries, if that high green dome has not been removed, and the noble grave has been surrounded by brass windows, decorations, curtains, and other things that the occupant of the grave himself, peace and blessings be upon him, would not approve of. Indeed, when I visited the noble Prophet's Mosque and had the honor of greeting the Messenger of Allah, peace and blessings be upon him, in the year 1368 AH, I saw at the bottom of the northern wall of the grave a small mihrab and behind it a platform slightly raised above the floor of the mosque, indicating that this place is designated for prayer behind the grave. I wondered then how this idolatrous phenomenon remained in the era of the State of Monotheism (Tawhid). I say this while acknowledging that I did not see anyone coming to that place to pray due to the strict surveillance by the guards appointed to prevent people from doing anything contrary to Sharia at the noble grave. This is something for which the Saudi state is thanked, but it is not enough nor does it cure. I said three years ago in my book \"Ahkam Al-Jana'iz wa Bida'uha\" (p. 208 of my original): \"The duty is to return the Prophet's Mosque to its previous state by separating it from the Prophet's grave with a wall extending from north to south, so that one entering the mosque does not see in it any violation that would displease its founder, peace and blessings be upon him. I believe this is obligatory upon the Saudi state if it truly wants to be the protector of Monotheism. We have heard that it has ordered the expansion of the mosque again, so perhaps it will adopt this proposal of ours and make the increase from the western side and others, and thereby fill the shortage that will affect the capacity of the mosque if the proposal is implemented. I hope Allah achieves that at its hand, and who is more worthy of that than it?\" But the mosque was expanded about two years ago without returning it to what it was in the time of the Companions. And Allah is the Helper. Answer to the Third Doubt: As for the third doubt, which is that the Prophet, peace and blessings be upon him, prayed in the Mosque of Al-Khaif, and it has been mentioned in a hadith that seventy prophets are buried in it, the answer is: We do not doubt his prayer, peace and blessings be upon him, in this mosque, but we say: What was mentioned in the doubt that seventy prophets were buried in it is not proof for two reasons: First: We do not accept the authenticity of the hadith referred to because it was not narrated by anyone concerned with recording authentic hadith, nor was it authenticated by anyone whose authentication is trusted among the early Imams. Nor does hadith criticism support its authentication, for its chain contains narrators who narrate oddities (ghara'ib), which makes the heart not at ease with the authenticity of what they narrated uniquely. Al-Tabarani said in his \"Al-Mu'jam Al-Kabir\" (3/204/2): Abdan bin Ahmad told us, Isa bin Shadhan told us, Abu Hammam Al-Dallal told us, Ibrahim bin Tahman told us, from Mansur, from Mujahid, from Ibn Umar, raised (marfu') with the wording: \"In the Mosque of Al-Khaif is the grave of seventy prophets.\" Al-Haythami mentioned it in \"Al-Majma'\" (3/298) with the wording: \"Seventy prophets are buried,\" and said: \"Narrated by Al-Bazzar and its men are trustworthy.\" This is a deficiency in extraction from him, for Al-Tabarani also narrated it as you saw. I said: And the men of Al-Tabarani are also trustworthy except Abdan bin Ahmad, who is Al-Ahwazi as mentioned by Al-Tabarani in \"Al-Mu'jam Al-Saghir\" (p. 136), and I did not find a biography for him. He is different from Abdan bin Muhammad Al-Marwazi, who is also one of Al-Tabarani's sheikhs in \"Al-Saghir\" (p. 136) and elsewhere, and he is a trustworthy Hafiz with a biography in \"Tarikh Baghdad\" (11/135) and \"Tadhkirat Al-Huffaz\" (2/230) and others. But among the men of this chain are those who narrate oddities, like Isa bin Shadhan; Ibn Hibban said of him in \"Al-Thiqat\": \"He narrates oddities.\" And Ibrahim bin Tahman; Ibn Ammar Al-Mawsili said of him: \"Weak in hadith, confused in hadith.\" Although this absolute statement is rejected against Ibn Ammar, it indicates that there is something about Ibn Tahman's hadith. This is supported by Ibn Hibban's statement in \"Thiqat Atba' Al-Tabi'in\" (2/1): \"His matter is ambiguous; he has entry among the trustworthy and entry among the weak. He has narrated straight hadiths resembling the hadiths of the reliable, and he has narrated unique things from the trustworthy that are problematic (mu'dalat). We will mention him, Allah willing, in the Book of Separation between Transmitters if Allah, Glory be to Him, decrees that, as well as everything regarding which we paused concerning those who have entry among the trustworthy.\" Therefore, Al-Hafiz Ibn Hajar said of him in \"Al-Taqrib\": \"Trustworthy, narrates oddities.\" And Mansur's sheikh, who is Ibn Al-Mu'tamir, is trustworthy, and Ibn Tahman narrated another hadith from him in his Mashyakha (244/2) (73). So the hadith is from his oddities or from the oddities of Ibn Shadhan (74). I fear that the hadith was distorted by one of them, saying: \"Qubira\" (was buried) instead of \"Salla\" (prayed), because this second wording is the famous one in the hadith. Al-Tabarani narrated in \"Al-Kabir\" (3/1551) with a chain whose men are trustworthy from Said bin Jubayr from Ibn Abbas, raised: \"Seventy prophets prayed in the Mosque of Al-Khaif...\" the hadith. Likewise, Al-Tabarani narrated it in \"Al-Awsat\" (1/119/2 Zawa'iduhu) (75), and from him Al-Maqdisi in \"Al-Mukhtarah\" (249/2), Al-Mukhallis in \"The Third of the Sixth of Al-Mukhallisiyyat\" (70/1), and Abu Muhammad bin Shaiban Al-Adl in \"Al-Fawa'id\" (2/222/2). Al-Mundhiri said (2/116): \"Narrated by Al-Tabarani in Al-Awsat and its chain is good (hasan).\" There is no doubt about the goodness of the hadith in my view, for I found another path for it from Ibn Abbas narrated by Al-Azraqi in \"Akhbar Makkah\" (p. 35) from him as stopped (mawquf) on him, and its chain is suitable for citation as I explained in my large book \"Hajjat Al-Wada'\" (not yet completed). Then Al-Azraqi narrated it (p. 38) from the path of Muhammad bin Ishaq who said: Someone I do not suspect told me from Abdullah bin Abbas with it as stopped. This is what is known regarding this hadith, and Allah knows best. The summary of the speech is that the hadith is weak; the heart is not at ease with its authenticity. If it is authentic, the answer to it is",
    "foot_note": "1. (76) - I have extracted some of the hadiths reported regarding that in \"Irwa' Al-Ghalil\" (971 and 1129).\n(73) - Manuscript in Al-Zahiriyah Library in Damascus.\n(75) - Manuscript missing the beginning and end, preserved in Al-Zahiriyah Library, and a complete copy of it is in the Library of the Grand Mosque in Mecca.\n(74) - Then I saw that it has been corroborated. I came across Al-Bazzar's chain for the hadith in his \"Zawa'id\" (p. 123, Al-Maktab Al-Islami photocopy). He says: Ibrahim told us, from Al-Mustamir Al-Aruqi, Muhammad told us, Ibrahim bin Tahman told us with it. Al-Bazzar said: \"Ibrahim was unique in narrating it from Mansur, and we do not know it from Ibn Umar with a better chain than this.\" This is an acceptable corroboration. Al-Aruqi with a Qaf is truthful (saduq) who narrates oddities as in \"Al-Taqrib\". So the responsibility for the hadith lies with Ibn Tahman. Al-Haythami followed the apparent aspect of its chain and said in \"Zawa'id Al-Bazzar\": \"I say: It is an authentic chain.\" Perhaps his previous statement \"and its men are trustworthy\" is more precise due to the oddity we mentioned. This is because such a phrase does not imply authenticity, as is not hidden from those who practice this craft, because the integrity of the narrators and their trustworthiness is only one of the many conditions of authenticity. Indeed, a scholar does not resort to this phrase, turning away from declaring it authentic, unless he knows that in the chain, despite the trustworthiness of its men, there is a defect preventing the declaration of its authenticity, or at least he did not know the fulfillment of the other conditions in it, so he did not declare it authentic. This is an important issue often overlooked by beginners in this noble science and others. Therefore, I drew attention to it in the introduction to \"Tamam Al-Minnah 'ala Fiqh Al-Sunnah li-Sayyid Sabiq\". Even if I were to use what is not correct in my view as argument, I would argue against the authentication of the hadith by some contemporary imitators by saying that Al-Suyuti weakened it by symbolizing it with weakness (Da'if) in \"Al-Jami' Al-Saghir\". This occurred in the copy printed by Bulaq Press in Egypt, in the copy with Al-Munawi's commentary, and in a manuscript copy in Al-Zahiriyah Library (2329 General) and others. However, I do not trust the symbols of (Al-Jami' Al-Saghir) for reasons I mentioned in the aforementioned introduction, then in the introduction to my books \"Sahih Al-Jami' Al-Saghir wa Ziyadatuhu\" and \"Da'if Al-Jami' Al-Saghir wa Ziyadatuhu\" (both have been printed by Al-Maktab Al-Islami). Nevertheless, the weakening is applicable against them because they have no verification; rather, they are imitators in everything by their own admission. So it is most likely that they rely on those symbols, and thus the mentioned weakening is proof against them if they are fair\" from the following aspect, which is:\nSecond: The hadith does not say that the graves are visible in the Mosque of Al-Khaif. Al-Azraqi devoted several chapters in the History of Mecca (406-410) to describing the Mosque of Al-Khaif and did not mention that there are prominent graves in it. It is known that the Sharia bases its rulings on the apparent. Since there are no visible graves in the mentioned mosque, there is absolutely no prohibition in praying in it because the graves are obliterated and no one knows them. Indeed, were it not for this report which you knew is weak, it would not have crossed anyone's mind that there are seventy graves in its ground. Therefore, the corruption that usually occurs in mosques built on visible and elevated graves does not occur in it.",
    "book_id": "349",
    "new_page_number": 71
  },
  {
    "serial_number": "69577",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 69,
    "volume_number": 1,
    "text": "The answer is: No, absolutely not. Here is the clarification from several aspects: First: It has not been proven in a raised (marfu') hadith that Ismail, peace be upon him, or any other noble prophets were buried in the Sacred Mosque. Nothing of that has been reported in any of the relied-upon books of Sunnah, such as the Six Books, Musnad Ahmad, the three Mu'jams of Al-Tabarani, and others, as weak, rather fabricated according to some verifiers (77). The most that has been reported regarding this are problematic (mu'dal) narrations with flimsy, stopped (mawquf) chains extracted by Al-Azraqi in \"Akhbar Makkah\" (p. 39, 219, and 220). They are not to be paid attention to, even if some innovators presented them as accepted facts (78). Similar to this is what Al-Suyuti cited in \"Al-Jami'\" from the narration of Al-Hakim in \"Al-Kuna\" from Aisha, raised, with the wording: \"The grave of Ismail is in the Hijr.\" Second Aspect: The graves allegedly existing in the Sacred Mosque are not visible or prominent. Therefore, they are not intended instead of Allah Almighty, so there is no harm in their presence in the belly of the mosque's earth. Thus, it is not valid to use these narrations as evidence for the permissibility of establishing mosques over graves raised above the surface of the earth, due to the clear difference between the two images. This was the answer of Sheikh Ali Al-Qari, may Allah have mercy on him, in \"Mirqat Al-Mafatih\" (1/456) after he quoted the saying of the commentator I referred to in the footnote: \"Others mentioned that the image of Ismail's grave, peace be upon him, is in the Hijr under the spout, and that in the Hatim between the Black Stone and Zamzam is the grave of seventy prophets.\" Al-Qari said: \"Regarding this, the image of Ismail's grave, peace be upon him, and others is obliterated, so it is not suitable for inference.\" This is the answer of a deeply knowledgeable scholar and skilled jurist. It contains an indication of what we mentioned earlier, which is that the consideration in this issue is regarding visible graves, and that graves in the belly of the earth do not have a legal ruling attached to them in terms of appearance. Rather, the Sharia is above such a ruling because we know by necessity and observation that the entire earth is a graveyard for the living, as the Exalted said: {Have We not made the earth a container * Of the living and the dead?} [Al-Mursalat: 25-26]. Al-Sha'bi said: \"Its belly is for your dead and its back is for your living\" (79).",
    "foot_note": "1. (77) - Al-Suyuti quoted in \"Al-Tadrib\" from Ibn Al-Jawzi: \"He said: How excellent is the saying of the speaker: If you see a hadith contradicting reason, or opposing the transmitted, or conflicting with the principles, know that it is fabricated. He said: And the meaning of conflicting with the principles is that it is outside the collections of Islam, such as the Musnads and famous books. As in 'Al-Ba'ith Al-Hathith'\" (p. 85 of the second edition).\n78. - \"See Ihya' Al-Maqbur\" (47-48). Among the wonders of ignorance of the Sunnah is that some late commentators used these flimsy narrations as evidence for the permissibility of praying in the graveyard with the intention of seeking support from the spirit of the deceased or the arrival of some trace of his worship (1), not for venerating him or turning towards him. This is despite the fact that there is no evidence in them for what he claimed of permissibility; rather, it contradicts the generality of evidences prohibiting prayer in graveyards and similar mosques built on graves. For this reason, Al-Munawi refuted the argument of the referred commentator by saying: \"But the report of the Two Sheikhs is the dislike () of building mosques on graves absolutely, and the intended meaning is the graves of Muslims, fearing that the buried would be worshipped, due to the context of the report: O Allah, do not make my grave an idol to be worshipped.\" Al-San'ani said in \"Subul Al-Salam\" (2/214), also commenting on him: \"His saying: (not for venerating him); it is said: Intending blessing (tabarruk) by him is venerating him. Furthermore, the hadiths of prohibition are absolute, and there is no evidence for the reasoning he mentioned. The apparent meaning is that the reason is blocking the means and distancing from resembling idol worshippers who venerate inanimate objects that neither benefit nor harm, and because spending money on that is futility and waste devoid of benefit entirely, and because it is a cause for lighting lamps over them, the doer of which is cursed, and the evils of what is built on graves of shrines and domes are innumerable.\"\n79. - Narrated by Al-Dawlabi (1/129) from him, and his men are trustworthy.",
    "book_id": "349",
    "new_page_number": 72
  },
  {
    "serial_number": "69578",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 70,
    "volume_number": 1,
    "text": "I said: And their saying \"the doer of which is cursed\" refers to the hadith of Ibn Abbas, the weakness of which I explained previously (p. 43), so be aware. Similar to this is the poet's saying: O friend, these are our graves filling the open space So where are the graves from the era of 'Ad? Tread lightly, I do not think the surface of the earth Is anything but these bodies Walk if you can in the air slowly Not arrogantly over the remains of the servants. It is clear and evident that if a grave is not visible and its location is unknown, no corruption results from it, as is observed where you see idolatries and polytheistic practices occurring only at elevated graves, even if they are fake, not at obliterated graves, even if they are real. Wisdom dictates differentiating between the two types, and this is what the Sharia brought as we explained earlier. So it is not permissible to equate them. And Allah is the Helper. Answer to the Fifth Doubt: As for Abu Jandal, may Allah be pleased with him, building a mosque over the grave of Abu Basir, may Allah be pleased with him, during the time of the Prophet, peace and blessings be upon him, it is a doubt not worth recounting. Were it not that some contemporary people of desires relied on it to reject those confirmed hadiths, I would not have allowed myself to blacken pages to answer it and clarify its invalidity. The discussion on it is from two aspects: First: Rejecting the proof of the alleged building from its foundation because it does not have a chain that stands as evidence. It was not narrated by the authors of the \"Sahihs,\" \"Sunan,\" \"Musnads,\" and others. Rather, Ibn Abd al-Barr cited it in the biography of Abu Basir in \"Al-Isti'ab\" (4/21-23) as mursal (hurried), saying: \"He has a wondrous story in the Maghazi mentioned by Ibn Ishaq and others. Ma'mar narrated it from Ibn Shihab. Abdur-Razzaq mentioned from Ma'mar from Ibn Shihab in the story of the Year of Hudaybiyyah, he said: Then the Messenger of Allah, peace and blessings be upon him, returned, and Abu Basir, a man from Quraysh who was a Muslim, came to him. Quraysh sent two men seeking him, and they said to the Messenger of Allah, peace and blessings be upon him: The covenant you made with us is that you return to us everyone who comes to you as a Muslim. So the Prophet, peace and blessings be upon him, handed him over to the two men. They went out until they reached Dhu Al-Hulaifah, where they dismounted to eat some dates they had. Abu Basir said to one of the two men: By Allah, I see this sword of yours is good, O so-and-so. The other drew it and said: Yes, by Allah, it is indeed good; I have tried it and tried it. Abu Basir said to him: Show me, let me look at it. So he enabled him to take it, and he struck him until he grew cold (died). The other fled until he came to Medina and entered the mosque running. The Prophet, peace and blessings be upon him, said to him when he saw him: This one has seen terror. When he reached the Prophet, peace and blessings be upon him, he said: By Allah, my companion has been killed and I am killed. Then Abu Basir came and said: O Messenger of Allah, by Allah, Allah has fulfilled your obligation: You returned me to them, then Allah saved me from them. The Prophet, peace and blessings be upon him, said: Woe to his mother, a kindler of war, if only there were someone with him.\" When he heard that, he knew that he would return him to them, so he left until he came to the seashore. He said: And Abu Jandal bin Suhayl bin Amr escaped from them and joined Abu Basir... And Musa bin Uqbah mentioned this report about Abu Basir with more complete wordings and fuller context. He said: ... And the Messenger of Allah, peace and blessings be upon him, wrote to Abu Jandal and Abu Basir to come to him along with those Muslims with them. The letter of the Messenger of Allah, peace and blessings be upon him, arrived to Abu Jandal while Abu Basir was dying. So he died with the letter of the Messenger of Allah, peace and blessings be upon him, in his hand reading it. Abu Jandal buried him in his place, prayed over him, and built a mosque over his grave.\" I said: You see that this story revolves around Al-Zuhri. It is mursal considering he is a minor Tabi'i who heard from Anas bin Malik, may Allah be pleased with him; otherwise, it is problematic (mu'dal). Whatever the case, it does not stand as proof. Moreover, the point of evidence in it, which is his saying: \"and built a mosque over his grave,\" does not appear from Ibn Abd al-Barr's context of the story to be from Al-Zuhri's mursal nor from Abdur-Razzaq's narration from Ma'mar from him. Rather, it is from the narration of Musa bin Uqbah as stated by Ibn Abd al-Barr without passing him. Ibn Uqbah did not hear from any of the Companions. So this addition, i.e., his saying \"and built a mosque over his grave,\" is problematic (mu'dal) (80). Indeed, it is denounced (munkar) in my view because the story was narrated by Al-Bukhari in his \"Sahih\" (5/351-371) and Ahmad in his \"Musnad\" (4/328-331) as connected (mawsul) from the path of Abdur-Razzaq from Ma'mar who said: Urwa bin Al-Zubair informed me from Al-Miswar bin Makhramah and Marwan with it without this addition. Likewise, Ibn Ishaq cited it in \"Al-Sirah\" from Al-Zuhri as mursal as in \"Mukhtasar Al-Sirah\" by Ibn Hisham (3/331-339), and Ahmad connected it (4/323-326) from the path of Ibn Ishaq from Al-Zuhri from Urwa with it like Ma'mar's narration and more complete, and it does not contain this addition. Likewise, Ibn Jarir narrated it in his history (3/271-285) from the path of Ma'mar, Ibn Ishaq, and others from Al-Zuhri with it without this addition. All this indicates that it is a denounced addition due to its problematic nature and the lack of its narration by trustworthy narrators. And Allah grants success. Second Aspect: If that were authentic, it would not be permissible for the explicit hadiths prohibiting building mosques on graves to be rejected by it for two reasons: First: There is nothing in the story indicating that the Prophet, peace and blessings be upon him, knew about that and approved it. Second: Even if we assume that the Prophet, peace and blessings be upon him, knew about that and approved it, it must be interpreted as being before the prohibition, because the hadiths are explicit that the Prophet, peace and blessings be upon him, prohibited that at the end of his life as previously mentioned. It is not permissible to abandon the later text for the sake of the earlier text, assuming its authenticity, in case of conflict. This is clear and not hidden. We ask Allah Almighty to protect us from following desires. Answer to the Sixth Doubt: As for the claim that the prohibition was only for a cause, which is the fear of being tempted by the buried person, and that it has ceased, so the prohibition has ceased, I do not know any scholar who held this doubt except the author of \"Ihya' Al-Maqbur.\" He clung to it and made it his support in rejecting those previous hadiths and the consensus of the Ummah on them. He said (textually) (p. 81, 19): (80) - Do not be deceived, O reader, by what the author of \"Ihya' Al-Maqbur\" did here. He cited (p. 44) the story we mentioned above from the path of Ibn Abd al-Barr, except that the author deleted from his words \"And Musa bin Uqbah mentioned this report\" and connected the narration of Abdur-Razzaq from Al-Zuhri with the narration of Musa bin Uqbah so that they became as if they were one narration. It appeared to the onlooker in his context that the story of building the mosque over the grave is from the narration of Abdur-Razzaq from Al-Zuhri, whereas it is from the narration of Musa bin Uqbah without a chain.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 73
  },
  {
    "serial_number": "69579",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 71,
    "volume_number": 1,
    "text": "Then I found the narration of Musa bin Uqbah in \"Tarikh Ibn Asakir\" (8/334/1). He narrated it with two chains from him from Ibn Shihab as mursal and mu'dal with the wording: \"and made a mosque at his grave.\" This wording, if authentic, is less contradictory because it is not a text stating that the building was on the grave, but rather at it, and there is a great difference between them. Also, it does not state that Abu Jandal is the one who built the mosque. So reflect.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 74
  },
  {
    "serial_number": "69580",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 72,
    "volume_number": 1,
    "text": "\"As for the prohibition of building mosques on graves, they agreed on justifying it with two causes: One is that it leads to dirtying the mosque (81)... and the second, which is the saying of the majority, nay all, even those who stated the previous cause, is that this may lead to misguidance and temptation by the grave. Because if it is located in the mosque and is the grave of a Waliy (saint) famous for goodness and righteousness, it is not secure with the passage of time that the belief of the ignorant in him increases, leading them to excessive veneration to the point of intending to pray towards him if he is in the qibla of the mosque, thus leading them to disbelief and polytheism.\" Then he cited some quotes regarding the mentioned cause from some scholars, including Imam Al-Shafi'i, and his text on that has preceded (p. 43-44). Then the referred author said (p. 20-21): \"The mentioned cause has been negated by the firm establishment of faith in the souls of the believers and their upbringing on pure Monotheism and the belief in negating any partner with Allah Almighty and that He, Glory be to Him, is the Unique in creation, existence, and disposal (). With the negation of the cause, the ruling based on it is negated, which is the dislike of establishing mosques and domes on the graves of the Awliya and the righteous.\" I said: The answer is: It is said: Establish the throne then engrave (Prove the basis first). Prove first that the mentioned fear is the sole cause of the prohibition, then prove that it has been negated. Doing that is harder than stripping thorns. As for the first, there is absolutely no evidence that the cause is the mentioned fear only. Yes, it is possible to say: It is part of the cause. But limiting it to that is invalid because it is also possible to add other rational matters such as imitating the Christians, as preceded in the words of the jurist Al-Haytami and the verifier Al-San'ani, and such as extravagance in spending money on what has no benefit in Sharia, and other things that may appear to the critical researcher. (81) - I said: This cause is invalid for reasons there is no room to explain now. Among the proofs for that specifically regarding the graves of Prophets is that their bodies do not decay as authentically reported from the Messenger of Allah, peace and blessings be upon him, so how can the earth be dirtied by them?",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 75
  },
  {
    "serial_number": "69581",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 73,
    "volume_number": 1,
    "text": "As for his claim that the cause has been negated by the firm establishment of faith in the souls of the believers etc., it is also an invalid claim. Its explanation is from several aspects: First: The claim is built on a false foundation, which is that believing that Allah is the Unique in creation and existence is sufficient to realize the saving faith with Allah Almighty. It is not so, for this Tawhid, known among scholars as Tawhid Al-Rububiyyah (Lordship), was believed by the polytheists to whom the Messenger of Allah, peace and blessings be upon him, was sent, as the Exalted said: {And if you asked them, \"Who created the heavens and earth?\" they would surely say, \"Allah.\"} (82). Despite that, this Tawhid did not benefit them at all because they disbelieved in Tawhid Al-Uluhiyyah (Worship) and denied it against the Prophet, peace and blessings be upon him, most vehemently by saying, as Allah recounted about them: {Has he made the gods [only] one God? Indeed, this is a curious thing.} (83). Among the requirements of this Tawhid which they denied is abandoning seeking help from other than Allah, abandoning supplication and slaughtering for other than Allah, and other acts of worship specific to Allah Almighty. So whoever dedicates any of that to other than Allah Almighty has associated partners with Him and made a rival for Him, even if he testifies for Him with Tawhid Al-Rububiyyah. The saving faith is only combining Tawhid Al-Rububiyyah and Tawhid Al-Uluhiyyah and singling out Allah with that. This is detailed elsewhere. If this becomes clear, we know that true faith is not firmly established in the souls of many of those who believe in Tawhid Al-Rububiyyah. I do not want to take the noble reader far in giving examples; it suffices me here to quote what the author we are refuting mentioned. He said after lines of his previous speech (p. 21-22): \"We see them (meaning the common people) swearing by the Awliya and uttering regarding them what appears to be blatant disbelief, rather it is disbelief in reality without doubt or suspicion... Many of the ignorant commoners in Morocco utter what is blatant disbelief regarding our master Abdul-Qadir Al-Jilani, may Allah be pleased with him... For we have in Morocco those who say about the Great Pole (Al-Qutb Al-Akbar) our master Abdul-Salam Ibn Mashish, may Allah be pleased with him, that he is the one who created religion and the world. And among them are those who said while rain was falling heavily: O our master Abdul-Salam, be gentle with your servants. This is disbelief.\"",
    "foot_note": "1. (82) - Surah Luqman Verse 25\n83. - Surah Sad Verse 5",
    "book_id": "349",
    "new_page_number": 76
  },
  {
    "serial_number": "69582",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 74,
    "volume_number": 1,
    "text": "I said: This disbelief is more severe than the disbelief of the polytheists because this contains a declaration of Shirk in Tawhid Al-Rububiyyah as well, which is something we do not know occurred from the polytheists themselves. As for Shirk in Uluhiyyah, it is more frequent among the ignorant of this Ummah, and I do not say their commoners. If this is the state of Muslims today and before today, how can this man say: \"And the cause has been negated by the firm establishment of faith in the souls of the believers\"? If he means by \"the believers\" the Companions, may Allah be pleased with them, there is no doubt that they were truly believers, knowing the reality of Tawhid which the Messenger of Allah, peace and blessings be upon him, brought to them. But the Islamic Sharia is a general eternal Sharia, so the negation of the cause, even if proven for them, does not necessitate the negation of the ruling for those after them because the cause still exists, and reality is the truest witness to that. Second Aspect: You learned from the previous hadiths that the Prophet, peace and blessings be upon him, warned against taking graves as mosques at the end of his life, indeed during his death illness. So when did the cause he mentioned cease? If it is said: It ceased after his death, peace and blessings be upon him, this is a contradiction of what all Muslims hold, that the best of people is his generation, peace and blessings be upon him. Because saying that implies, based on his previous words, that faith had not yet become firmly established in the souls of the Companions, may Allah be pleased with them, but became established after his death, peace and blessings be upon him, and that is why the cause did not cease and the ruling remained. This is something I cannot imagine anyone saying due to its clear invalidity. If it is said: It ceased before his death, peace and blessings be upon him, we say: How can that be when he, peace and blessings be upon him, only forbade that in the last breath of his life? This is supported by: Third Aspect: That some of the previous hadiths state the continuation of the ruling until the Hour, like Hadith (12). Fourth Aspect: That the Companions, may Allah be pleased with them, only buried him in his chamber, peace and blessings be upon him, fearing that his grave might be taken as a mosque, as previously mentioned from Aisha, may Allah be pleased with her, in Hadith (4). This fear, either it is said: It was focused on the Companions themselves or on those after them. If the first is said, we say: The fear for those after them is more appropriate. If the second is said, which is the correct view in our opinion, it is definitive proof that the Companions, may Allah be pleased with them, did not see the cessation of the cause necessitating the cessation of the ruling, neither in their era nor afterwards. Claiming contrary to their opinion is clear misguidance. This is supported by:",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 77
  },
  {
    "serial_number": "69583",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 75,
    "volume_number": 1,
    "text": "Fifth Aspect: That the practice of the Salaf continued on this ruling and similar things which necessitate the continuation of the previous cause, which is the fear of falling into Fitnah and misguidance. If the referred cause were negated, the practice on its effect would not have continued, as is clear and not hidden. Praise be to Allah. Here are some examples of what we mentioned:",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 78
  },
  {
    "serial_number": "69584",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 76,
    "volume_number": 1,
    "text": "1 - From Abdullah bin Shurahbil bin Hasana who said: I saw Uthman bin Affan ordering the leveling of graves. It was said to him: This is the grave of Umm Amr bint Uthman. So he ordered it and it was leveled. (84)",
    "foot_note": "1. ( \n…. ) Two valuable manuscripts. The first one has some of its volumes preserved in Al-Zahiriyah Library and a complete copy exists elsewhere. The other has a photocopy in the Arab Scientific Academy in Damascus.\n84. - Narrated by Ibn Abi Shaybah in \"Al-Musannaf\" (4/138) and Abu Zur'ah in his \"Tarikh\" (66/2, 121/2) ( \n…. ) with an authentic chain from this Abdullah. Ibn Abi Hatim listed him in \"Al-Jarh wa Al-Ta'dil\" (3/2/8182) and did not mention any criticism or praise for him.",
    "book_id": "349",
    "new_page_number": 79
  },
  {
    "serial_number": "69585",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 77,
    "volume_number": 1,
    "text": "2 - From Abu Al-Hayyaj Al-Asadi who said: Ali bin Abi Talib said to me: Shall I not send you on the same mission as the Messenger of Allah, peace and blessings be upon him, sent me? That you do not leave an image without obliterating it, nor a raised grave without leveling it. (85) Since this hadith is clear evidence invalidating what Sheikh Al-Ghumari went to in his aforementioned book, he tried to escape it in two ways: First: Interpreting it to agree with his doctrine. Second: Casting doubt on its establishment. He said (p. 57): \"It must be one of two things: either it is not established in itself, or it is carried on other than its apparent meaning necessarily.\" I said: As for its establishment, there is no doubt about it because it has many paths, some in \"Al-Sahih\" as preceded. But the people of desires do not adhere to scientific rules in authentication and weakening; rather, whatever is against them, they weaken even if it is authentic in itself like this hadith (86), and whatever is for them, they authenticate or pass even if it is weak in itself. Some other examples of this will follow. And Allah's help is sought. As for its interpretation, he mentioned flimsy reasons, the strongest of which is his saying: \"It is a report whose apparent meaning is abandoned by agreement, because the Imams agree on the dislike of leveling the grave and on the recommendation of raising it about a hand span.\"",
    "foot_note": "1. 85. - Narrated by Muslim (3/61), Abu Dawud (3/70), Al-Nasa'i (1/285), Al-Tirmidhi (2/153-154), Al-Bayhaqi (4/3), Al-Tayalisi (1/168), and Ahmad (No. 7411064). It has paths in Al-Tayalisi, Ahmad (No. 657, 658, 889, 1175, 1176, 1177, 1238, 1283), Ibn Abi Shaybah (4/139), and Al-Tabarani in \"Al-Saghir\" p. 29. \"There is no contradiction between this hadith and what is established in the Sunnah regarding the legitimacy of raising the grave a span or two so that it is distinguished and protected from being disrespected, because the intended meaning is leveling what is built upon it of construction, even if the contrary is said. Sheikh Ali Al-Qari said in 'Al-Mirqat' (2/372) in explaining the hadith: '(a raised grave) is one that has been built upon until it became high, not the one marked with sand and pebbles or marked () with stones to be known and not stepped on. (without leveling it) In Al-Azhar: Scholars said: It is recommended to raise the grave about a hand span and it is disliked above that, and demolition is recommended. There is disagreement about its amount; it was said to the ground strictly. This is closer to the wording, i.e., the wording of the hadith, than leveling.'\"\n86. - Similarly, one of the extremist Shia did in his book \"Kashf Al-Irtiyab\" (p. 366), explicitly weakening the hadith from Muslim's path and attacking its narrators, all of whom are trustworthy. Also, Al-Kawthari Al-Jahmi hinted at its lack of authenticity in his \"Maqalat\" (p. 159). Thus, you see the people of desires, despite their different doctrines, following one another in rejecting the authentic hadith with the flimsiest doubts, following their desires. We seek refuge in Allah Almighty from abandonment. Likewise in \"Tuhfat Al-Ahwadhi\" (2/154) quoting from \"Al-Mirqat\".",
    "book_id": "349",
    "new_page_number": 80
  },
  {
    "serial_number": "69586",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 78,
    "volume_number": 1,
    "text": "I said: It is strange for someone who claims Ijtihad and forbids Taqlid (blind following) how he diverts hadiths and interprets them to agree with the sayings of the Imams according to his claim, while correct Ijtihad requires the exact opposite. Furthermore, the hadith does not contradict the mentioned agreement because it is specific to the grave built upon; in that case, it is leveled to the ground as preceded from Al-Azhar. The agreement of the Imams is only regarding the origin that should be observed when burying the dead, so it is raised slightly. This is not what the hadith refers to, as Al-Qari, may Allah have mercy on him, stated in what was quoted shortly before in the footnote (p. 73). Then Al-Ghumari quoted in interpreting the hadith from the Shafi'is that they said: He did not mean leveling it to the ground, but rather flattening it, reconciling the hadiths. I said: If this is accepted, it is evidence against Al-Ghumari, not for him, because he does not say it is obligatory to flatten it, but says it is recommended to raise it without limit and recommended to build a dome or mosque over it. Then Al-Ghumari said in the final answer to the hadith: \"And the correct view in our opinion is that he meant the graves of the polytheists which they used to sanctify in the Jahiliyyah and in the lands of the disbelievers which the Companions, may Allah be pleased with them, conquered, evidenced by the mention of images with them.\" I said: In some paths of the hadith in Ahmad, Ali's sending of Abu Al-Hayyaj, may Allah be pleased with him, was to some outskirts of Medina when the Messenger of Allah, peace and blessings be upon him, was in it. This invalidates his claim that the sending was to the lands of the disbelievers. Furthermore, the point of evidence in the hadith is Ali's sending of Abu Al-Hayyaj to level the graves, and he was the chief of police. This contains clear evidence that Ali, and likewise Uthman, may Allah be pleased with them, in the previous report, knew this ruling after his death, peace and blessings be upon him, contrary to what Al-Ghumari claimed.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 81
  },
  {
    "serial_number": "69587",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 79,
    "volume_number": 1,
    "text": "3 - From Abu Burda who said: Abu Musa advised when death approached him, saying: \"When you proceed with my funeral, walk quickly, do not let a censer follow me, do not place anything in my grave that comes between me and the earth, and do not build a structure over my grave. I call you to witness that I am innocent of every Haliqa (shaver), Saliqa (wailer), or Khariqa (tearer) (87).\" They said: Did you hear anything about it? He said: Yes, from the Messenger of Allah, peace and blessings be upon him. (88)",
    "foot_note": "1. (87) (Al-Haliqa): The one who shaves her hair during a calamity - (Al-Saliqa): The one who raises her voice (Al-Khariqa): The one who tears her clothes during a calamity.\n88. - 2 Narrated by Ahmad (4/397) and its chain is strong.",
    "book_id": "349",
    "new_page_number": 82
  },
  {
    "serial_number": "69588",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 80,
    "volume_number": 1,
    "text": "4 - From Anas: He used to dislike building a mosque among graves. (89)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 83
  },
  {
    "serial_number": "69589",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 81,
    "volume_number": 1,
    "text": "5 - From Ibrahim that he used to dislike making a mosque over a grave. This Ibrahim is Ibn Yazid Al-Nakha'i, the trustworthy Imam. He is a minor Tabi'i who died in the year (96). He undoubtedly received this ruling from some of the major Tabi'in from the Companions. This contains definitive proof that they saw the continuation of this ruling and its persistence after him, peace and blessings be upon him. So when was it abrogated?",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 84
  },
  {
    "serial_number": "69590",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 82,
    "volume_number": 1,
    "text": "6 - From Al-Ma'rur bin Suwayd who said: We went out with Umar in a Hajj he performed. He recited to us in Fajr {Have you not considered how your Lord dealt with the companions of the elephant} (90) and {For the accustomed security of the Quraysh} (91). When he finished his Hajj and returned, people were rushing. He said: What is this? It was said: A mosque in which the Messenger of Allah, peace and blessings be upon him, prayed. He said: This is how the People of the Book were destroyed; they took the traces of their prophets as places of worship. Whoever among you is present for prayer in it, let him pray, and whoever is not present for prayer in it, let him not pray. (92)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 85
  },
  {
    "serial_number": "69591",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 83,
    "volume_number": 1,
    "text": "7 - From Nafi' who said: It reached Umar bin Al-Khattab that people were coming to the tree under which the pledge was made, so he ordered it to be cut down. (93)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 86
  },
  {
    "serial_number": "69592",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 84,
    "volume_number": 1,
    "text": "8 - From Qaza'a who said: I asked Ibn Umar: Shall I go to Al-Tur? He said: Leave Al-Tur and do not go to it. And he said: Journeys are not to be undertaken except to three mosques. (94)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 87
  },
  {
    "serial_number": "69593",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 85,
    "volume_number": 1,
    "text": "9 - From Ali bin Husayn: That he saw a man coming to a gap that was at the grave of the Prophet, peace be upon him (sic in original), entering it and supplicating. So he called him and said: Shall I not tell you a hadith I heard from my father from my grandfather, the Messenger of Allah, peace and blessings be upon him? He said: \"Do not take my grave as a place of celebration (Eid), nor your houses as graves. Send blessings upon me, for your blessings and greetings reach me wherever you are.\" (95) It is strengthened by what Ibn Abi Shaybah also narrated, and Ibn Khuzaimah in \"Hadith Ali Ibn Hajar\" (Vol. 4 / No. 48) and Ibn Asakir (4/217/1) (96) from two paths from Suhail bin Abi Suhail that he saw the grave of the Prophet, peace and blessings be upon him, and he embraced it and wiped [it]. He said: Hasan bin Hasan bin Ali bin Abi Talib pelted me and said: The Messenger of Allah, peace and blessings be upon him, said: Do not take my house as a place of celebration, and do not take your houses as graves. [And send blessings upon me wherever you are, for your blessings reach me]\" (97) wherever you are\" (99)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 88
  },
  {
    "serial_number": "69594",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 86,
    "volume_number": 1,
    "text": "11 - And Ibn Umar saw a tent (100) on the grave of Abdur-Rahman, so he said: \"Remove it, O boy, for only his deeds shade him.\" (101) 13 And Ibn Abi Shaybah and Ibn Asakir (7/96/2) narrated similar from Abu Sa'id Al-Khudri. (103)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 89
  },
  {
    "serial_number": "69595",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 87,
    "volume_number": 1,
    "text": "14 - From Muhammad bin Ka'b who said: These tents that are on the graves are an innovation. (104)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 90
  },
  {
    "serial_number": "69596",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 88,
    "volume_number": 1,
    "text": "15 - Said bin Al-Musayyib that he said in his illness in which he died: When I die, do not pitch a tent over my grave. (105)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 91
  },
  {
    "serial_number": "69597",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 89,
    "volume_number": 1,
    "text": "16 - From Salim, the freed slave of Abdullah bin Ali bin Husayn, who said: Muhammad bin Ali Abu Ja'far advised saying: Do not raise my grave above the ground. (106)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 92
  },
  {
    "serial_number": "69598",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 90,
    "volume_number": 1,
    "text": "17 - From Amr bin Shurahbil who said: Do not raise my grave mound, for I saw the Muhajirin disliking that. (107) Know that these reports, although their indications vary, agree on the general prohibition of everything that indicates the veneration of graves in a way that is feared to lead to Fitnah and misguidance, such as building mosques and domes over graves, pitching tents over them, raising them more than the prescribed limit, traveling and frequenting them (108), wiping over them, and such as seeking blessings from the relics of Prophets and the like. All these matters are not legislated according to the Salaf whom we named from the Companions and others. That indicates that they all saw the continuation of the cause of prohibiting building mosques over graves and venerating them with what is not legislated, which is the fear of misguidance and being tempted by the dead, as stated by Imam Al-Shafi'i, may Allah have mercy on him, previously. Evidence for this is their continuation on the ruling based on this cause, for the continuation of one implies the continuation of the other, as is clear. This is regarding those of them who explicitly stated the dislike of building mosques over graves apparently. As for those who explicitly prohibited other than that, such as raising the grave and pitching a tent over it and the like of what we summarized previously, they hold the continuation of the mentioned ruling a fortiori. This is for two reasons: Ibn Abbas, may Allah be pleased with him, said: Between Noah and Adam were ten centuries, all of them on a Sharia of truth, then they differed, so Allah sent the prophets as bringers of good tidings and warners. (110) Ibn Urwah Al-Hanbali said in {{Al-Kawkab}} (6/212/1): }} This refutes the saying of those among the historians of the People of the Book who claimed that Cain and his sons worshipped fire. {{ I said: And in it is a refutation also of some philosophers and atheists who claim that the origin in humans is polytheism and that monotheism is the emergent thing. This is invalidated and the previous verse supported by two authentic hadiths: from their religion, and I forbade upon them what I made lawful for them, and I commanded them to associate with Me what I did not send down authority for.\") (112) Second: His saying, peace and blessings be upon him: }} No child is born but upon Fitra (natural disposition), then his parents make him a Jew or a Christian or a Magian, just as an animal produces a perfect baby animal. Do you perceive in it any mutilation? {{ Abu Huraira said: And read if you wish } The nature of Allah upon which He has created people. No change should there be in the creation of Allah { (113) The verse (114). If this is clear, it is very important for the Muslim to learn how polytheism occurred to the believers after they were monotheists? Many narrations have been reported from a group of the Salaf in interpreting the saying of Allah, Glory be to Him, regarding the people of Noah: } And said, 'Never leave your gods and never leave Wadd or Suwa' or Yaghuth and Ya'uq and Nasr. { (115) That these five, Wadd and those mentioned with him, were righteous servants. When they died, Satan inspired their people to devote themselves at their graves. Then he inspired those who came after them to take idols for them, and beautified that for them claiming it would be more conducive for them to remember them and emulate their righteous deeds. Then he inspired the third generation to worship them instead of Allah Almighty, and deluded them that their fathers used to do that. So Allah sent Noah, peace be upon him, to them commanding them to worship Allah Almighty alone, but they did not respond to him except a few of them. Allah Almighty has recounted his story with them in Surah Nuh. He said: And the first thing worshipped other than Allah on earth was }} Wadd {{ whom they named Wadd {{ (117) and swearing by their owners, for all that leads to exaggeration regarding them and worshipping them instead of Allah Almighty, especially when knowledge is extinguished, ignorance abounds, advisors are few, and devils of Jinn and mankind cooperate to mislead people and take them out of the worship of Allah, Blessed and Exalted. It is not hidden that if it is accepted among us Muslims that part of the wisdom of prohibiting prayer at the three times is blocking the means and avoiding resemblance to the polytheists who worship the sun at those times, then the means in resembling them in building mosques on graves and praying in them is stronger and clearer. Do you not see that until today we have not found any bad effect from some people praying at these prohibited times, while we see the worst effects of praying in these mosques and shrines built on graves, such as wiping over them (119), seeking help from their owners, vowing to them, swearing, and even prostrating to them and other misguidance which is observed and well-known. So the wisdom of the Blessed and Exalted required prohibiting all these matters so that Allah, Blessed and Exalted, is worshipped alone and nothing is associated with Him, thus realizing the command of the Exalted to call upon Him alone in His saying }} And [He revealed] that the masjids are for Allah, so do not invoke with Allah anyone. {{ (120) It is indeed regrettable for every pure-hearted Muslim to find many Muslims falling into violation of the Sharia of the Master of Messengers, peace and blessings be upon him, which came to distance from everything that scratches Tawhid. Then he increases in regret when he sees few or many Sheikhs approving them on that violation claiming that their intentions are good. Allah bears witness that many of them have had their intentions corrupted and polytheism has rusted upon them due to the silence of the likes of these Sheikhs, nay, their justification of all what they see of manifestations of polytheism with that false claim? (121) Where is the good intention, O people, from people who whenever they fall into distress come to a dead person whom they consider righteous, so they call upon him instead of Allah and seek help from him and ask him for well-being and healing and other things that are not asked except from other than Allah and what only Allah is capable of? Rather, if the foot of their animal slips, they call out: O Allah, O Baz. While these Sheikhs may know that the Prophet, peace and blessings be upon him, one day heard some Companions saying to him: What Allah wills and you will. He said: Have you made me a rival to Allah? (122) If this was the denial of the Messenger of Allah, peace and blessings be upon him, against those who believed in him, peace and blessings be upon him, fleeing from polytheism, then why do these Sheikhs not deny people saying: O Allah, O Baz, even though it is clearer and more apparent in indicating polytheism than the phrase \"What Allah wills and you will\"? And why do we see the common people saying without any hesitation: \"We relied on Allah and on you\" and \"We have no one but Allah and you\"? That is because these Sheikhs are either like them in misguidance, and one who lacks a thing cannot give it, or they are flattering them, rather cajoling them, so as not to be stigmatized with some stigmas that eliminate their jobs and livelihoods, indifferent to the saying of Allah Almighty } Indeed, those who conceal what We sent down of clear proofs and guidance after We made it clear for the people in the Scripture - those are cursed by Allah and cursed by those who curse { (123) O regret for these Muslims. It was supposed for them to be callers for all people to the religion of Tawhid and a cause for saving them from idolatry and its filth. But due to their ignorance of their religion and following their desires, they became a proverb for idolatry by the polytheists themselves. So they began describing them as being like the Jews in their building of mosques over graves. It came in the book \"Da'wat Al-Haqq\" by Professor Abdur-Rahman Al-Wakil, may Allah have mercy on him (p. 176-177): As the Jews used to do \" The Western disbelievers knew this misguidance into which many Muslims fell, especially the Shia among them, so they exploited it even for the sake of achieving their colonial ambitions. The virtuous Professor Sheikh Ahmad Hasan Al-Baqouri said in a fatwa of his on the prohibition of decorating graves and building domes and mosques over them: And the capable writer and famous historian, the verifier Professor Rafiq Bey Al-Azm said in the conclusion of the biography of Abu Ubaidah, may Allah be pleased with him, from his book \"Ashhar Mashahir Al-Islam\" (p. 521-524) under the title (A Word on Graves): \"We do not intend by this title to research the history of graves like sarcophagi and pyramids and similar landmarks of early idolatry. Rather, we want to pause the reader's thought at the difference of historians regarding the location of Abu Ubaidah's grave, like their difference in determining many of the graves of the illustrious noble Companions who subdued this great kingdom and adorned themselves with those lofty traits and reached a limit of virtue, grace, piety, and righteousness reached by no one from the early and later ones. Historians have elaborated on the news of those great men and took care to record their great deeds in the conquests of kingdoms and countries until they left no need in souls for more. Excellent is what they served the Ummah and the religion with, and the most honorable mention is in the most honorable deeds. For this reason, the graves of the senior Companions and illustrious Mujahideen disappeared from those who came after their generation, except rarely. Then the transmitters of news differed in determining their locations due to the difference of narrators and the conflict of the transcribers' conjectures. If there had been in early Islam a trace of venerating graves and preserving the places of the dead by erecting domes and mosques over them, there would not have been any of this difference, and the graves of those noble Companions would not have been absent from us until now, just as the graves of the imposters and pseudo-sheikhs, which the innovators of Muslims invented after the first eras, have not been absent. They opposed the action of the Companions and Tabi'in until most of these domes came to represent the temples of the ancients and bring back the biography of idolatry in its ugliest types and furthest tendencies from the truth and closest to polytheism. If Muslims had taken a lesson afterwards from the disappearance of the graves of the Companions from whom they took this religion and by whom Allah granted victory to Islam, they would not have dared to erect domes over graves and venerate the dead, which reason and Sharia refuse. They opposed in all this the Companions and Tabi'in who delivered to us the trust of their Prophet, so we wasted it, and the secrets of the Sharia, so we toyed with them. Here is what Muslim narrated in his \"Sahih\" regarding graves from Abu Al-Hayyaj Al-Asadi who said: Ali bin Abi Talib, may Allah be pleased with him, said: Shall I not send you on the same mission as the Messenger of Allah, peace and blessings be upon him, sent me? That you do not leave an image without obliterating it, nor a raised grave without leveling it. And in his \"Sahih\" also from Thumamah bin Shufayy who said: We were with Fadalah bin Ubaid in the land of the Romans at \"Rodos\". A companion of ours died, so Fadalah ordered his grave and it was leveled. Then he said: I heard the Messenger of Allah, peace and blessings be upon him, ordering their leveling (127). Thus, those who delivered to us the trust of the Messenger of Allah, peace and blessings be upon him, conveyed to us. Then, confirming the covenant of trust, they started with everything the Messenger, peace and blessings be upon him, commanded them with themselves so that we may follow their Sunnah and be guided by the guidance of their Prophet. But our minds fell short of grasping the meaning of those particulars, and our perceptions declined from the station of knowledge of the wisdom of divine legislation and the Prophetic command decreeing not to erect graves. Gradation in the steps of idolatry governed us, so we did not heed that wisdom, and we judged with our deficient [minds] against the Sharia, so we judged the permissibility of erecting graves as a recommendation for such particulars until they became universals and a breach in religion and a corruption of the doctrine of Tawhid. For we kept graduating until we made mosques over them and sought their remains with vows and offerings, and we fell thereby into what the Lawgiver commanded us to obliterate graves for (128). All this while we are still in heedlessness of the wisdom of legislation, colliding with the truth and it collides with us until we perish with those who perish.\" I said: Some people, especially those of modern culture among them, may think that polytheism has vanished and there is no return for it due to the spread of sciences and the enlightenment of minds by them. This is a false thought, for reality contradicts it, since it is observed that polytheism in its various types and manifestations is still striking its pegs in most parts of the earth, especially in the lands of the West, the heartland of disbelief and worship of prophets, saints, idols, matter, great men, and heroes. Among the most prominent manifestations of that to the eye is the spread of statues among them. It is regrettable that this phenomenon has begun to spread slowly in some Islamic countries without any denial from Muslim scholars. Why do we take the readers far? Here are many Muslim countries, especially the Shia among them, containing numerous manifestations of polytheism and idolatry such as prostrating to graves, circumambulating them, facing them in prayer and prostration, calling upon them instead of Allah Almighty, and other things mentioned previously. Even if we assume that the earth has been purified from the filth of polytheism and idolatry of various types, it is not permissible for us to permit taking means that are feared to lead to polytheism, because we are not secure that these means will lead some Muslims to polytheism. Rather, we are certain that polytheism will occur in this Ummah at the end of time if it has not occurred now. Here are some texts reported regarding that from the Prophet, peace and blessings be upon him, so that you may be clear about the matter:",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 93
  },
  {
    "serial_number": "69599",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 91,
    "volume_number": 1,
    "text": "1 - \"The Hour will not be established until the buttocks of the women of Daws wobble around Dhi Al-Khalasa.\" (129)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 94
  },
  {
    "serial_number": "69600",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 92,
    "volume_number": 1,
    "text": "2 - \"Night and day will not pass until Al-Lat and Al-Uzza are worshipped. Aisha said: O Messenger of Allah, I thought when Allah revealed: {It is He who sent His Messenger with guidance and the religion of truth to manifest it over all religion, although those who associate others with Allah dislike it} (131) that this would be complete. He said: There will be of that what Allah wills (132), then Allah will send a pleasant wind which will take the soul of everyone who has a mustard seed's weight of faith in his heart, and there will remain those in whom there is no good, so they will return to the religion of their fathers.\" (133)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 95
  },
  {
    "serial_number": "69601",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 93,
    "volume_number": 1,
    "text": "3 - \"The Hour will not be established until tribes of my Ummah join the polytheists and until tribes of my Ummah worship idols.\" (134)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 96
  },
  {
    "serial_number": "69602",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 94,
    "volume_number": 1,
    "text": "4 - \"The Hour will not be established until it is not said on earth: Allah, Allah (and in a narration: La ilaha illa Allah).\" (135) In these hadiths is definitive proof that Shirk will occur in this Ummah. If this is the case, Muslims must avoid all means and causes that may lead one of them to Shirk, such as what we are discussing of building mosques over graves and similar things which the Messenger of Allah, peace and blessings be upon him, forbade and warned his Ummah against. Let no one be deceived by modern culture, for it does not guide a stray person nor increase a believer in guidance except as Allah wills. Rather, guidance and light are in what the Messenger, peace and blessings be upon him, brought. And Allah the Great spoke the truth when He said: {There has come to you from Allah a light and a clear Book. By which Allah guides those who pursue His pleasure to the ways of peace and brings them out from darknesses into the light, by His permission, and guides them to a straight path.} (136)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 97
  },
  {
    "serial_number": "69603",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 95,
    "volume_number": 1,
    "text": "Chapter Five",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 98
  },
  {
    "serial_number": "69604",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 96,
    "volume_number": 1,
    "text": "The Wisdom behind Prohibiting Building Mosques over Graves It is established in the Sharia that people from their beginning were one nation upon pure Tawhid, then Shirk occurred to them. The origin of this is the saying of Allah Blessed and Exalted: {Mankind was [of] one religion [before their deviation]; then Allah sent the prophets as bringers of good tidings and warners} (109) (109) - Surah Al-Baqarah Verse 213",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 99
  },
  {
    "serial_number": "69605",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 97,
    "volume_number": 1,
    "text": "First: His saying, peace and blessings be upon him, in what he narrates from his Lord: {{I created My servants as Hunafa (inclining to truth) all of them, but the devils came to them and turned them away (ajtalahum) (111) (111) - meaning: they took them lightly so they roamed with them in misguidance. It is said: Jala and Ajtala: if he went and came, from it is Jawlan (roaming) in war. (Nihayah) and similar in (Gharib Al-Harbi).",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 100
  },
  {
    "serial_number": "69606",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 98,
    "volume_number": 1,
    "text": "It came in Sahih Al-Bukhari (8/543) from Ibn Abbas: }} That these five are names of righteous men from the people of Noah. When they perished, Satan inspired their people: 'Erect idols at their gatherings where they used to sit, and name them with their names.' So they did. Until when those perished and knowledge was abrogated, they were worshipped. {{ Similar is in the Tafsir of Ibn Jarir and others from more than one of the Salaf, may Allah be pleased with them. And in }} Al-Durr Al-Manthur {{ (6/269): }} Abd bin Humaid narrated from Abu Mutahhar who said: Yazid bin Al-Muhallab was mentioned in the presence of Abu Ja'far (Al-Baqir), so he said: Indeed, he was killed in the first land where other than Allah was worshipped. Then he mentioned }} Wadd {{. He said: }} Wadd was a Muslim man who was beloved among his people. When he died, they camped around his grave in the land of Babylon and grieved for him. When Iblis saw their grief for him, he took the form of a human and said: 'I see your grief for this man, shall I make an image like him for you so that it can be in your meeting place and you remember him by it?' They said: 'Yes.' So he made an image like him for them. They placed it in their meeting place and began remembering him. When he saw how much they remembered him, he said: 'Shall I make for each man among you an image like him in his house so that it can be in his house and he remembers him?' They said: 'Yes.' So he made for each household an image like him. They accepted it and began remembering him by it. He said: Then their children grew up and saw what they were doing with it. They multiplied, and the matter of remembering him was obliterated until they took him as a god instead of Allah (116). (116) - Added in (Al-Kawakib) from the narration of Ibn Hatim (their grandchildren).",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 101
  },
  {
    "serial_number": "69607",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 99,
    "volume_number": 1,
    "text": "So the wisdom of the God Blessed and Exalted required, having sent Muhammad, peace and blessings be upon him, as the Seal of Messengers and making his Sharia the seal of Sharias, that he prohibits all means that are feared to be a pretext, even after a while, for people falling into Shirk which is the greatest of major sins. Therefore, he prohibited building mosques over graves as he prohibited undertaking journeys to them and taking them as places of celebration (Eid).\" (118) (118) - He said: Al-Nawawi, Etiquette of visiting his grave, peace and blessings be upon him, from his book (Manasik Al-Hajj) (69/2) which is a manuscript in Al-Zahiriyah in Damascus (General 3656). (Malik, may Allah have mercy on him, disliked for the people of Medina whenever one of them entered and left [the mosque] to stand at the grave. He said: That is only for strangers. He said: There is no harm for someone who arrived from a journey or is leaving for a journey to stand at the grave of the Prophet, peace and blessings be upon him, pray for him, and supplicate for him and for Abu Bakr and Umar, may Allah be pleased with them. Al-Baji said: Malik differentiated between the people of Medina and strangers because strangers intended that, while the people of Medina are residing there. And he, peace and blessings be upon him, said: O Allah, do not make my grave an idol to be worshipped.)",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 102
  },
  {
    "serial_number": "69608",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 100,
    "volume_number": 1,
    "text": "(It is not permissible to circumambulate his grave, peace and blessings be upon him, and it is disliked to stick the belly and back to the walls of the grave, said by Al-Halimi and others. And it is disliked to wipe it with the hand and kiss it; rather, etiquette is to keep distance from it... This is the correct view. It is what the scholars said and agreed upon. One should not be deceived by many of the common people contradicting that, for following and acting is only by the sayings of scholars, and no attention is paid to the innovations of the common people and their ignorance. The majestic master Abu Ali Al-Fudayl bin Iyad did well in his saying meaning (Follow the paths of guidance and do not be harmed by the scarcity of followers, and beware of the paths of misguidance and do not be deceived by the abundance of those perishing). Whoever thinks that wiping with the hand and the like is more conducive to blessing is from his ignorance and heedlessness, because blessing is only in what agrees with the Sharia and the sayings of scholars, and how can virtue be sought in opposing what is correct?). / I said: May Allah have mercy on Imam Al-Nawawi, for with this word he gave those Sheikhs who wipe themselves with graves in action or praise it in words the status they deserve, as he made them among the common people whose ignorance should not be paid attention to (So is there any who will remember)?",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 103
  },
  {
    "serial_number": "69609",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 101,
    "volume_number": 1,
    "text": "A long discussion took place a few years after authoring between me and one of the Friday preachers in his house about seeking help (Istighatha) from other than Allah. The Sheikh declared its permissibility arguing that the seeker of help knows that the dead person does not harm nor benefit. I said to him: If the matter were so, why does he call upon him? He said: An intermediary. I said: Allah is Greatest! You said as others said: {We only worship them that they may bring us nearer to Allah in position} {Surah Az-Zumar Verse 3}. Then I said to him: If you truly believe that they do not believe they can harm or benefit, do you see any harm in the seeker of help from other than Allah revealing his alleged belief by saying: {O Baz? O you who neither harms nor benefits? He said: Yes, it is permissible. I said: So this",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 104
  },
  {
    "serial_number": "69610",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 102,
    "volume_number": 1,
    "text": "\"The malicious English orientalist Edward Lane recorded this idolatry against Muslims in his book 'The Modern Egyptians,' saying (p. 167-181): Muslims, especially Egyptians of various sects except Wahhabis, hold for deceased saints a respect and sanctification unsupported by the Quran or Hadiths, more than they hold for the living among them. They build over most graves of famous saints large and beautiful mosques, and erect over the graves of those less famous small structures whitened with lime and crowned with a dome. Directly over the grave, a rectangular monument of stone or brick called 'Tarkiba' or of wood called 'Tabut' is erected. The monument is usually covered with silk or linen embroidered with Quranic verses, and it is surrounded by bars or a screen of wood called 'Maqsura'. Most shrines of saints in Egypt are burial places, but most of them contain few traces of them, and some are nothing but empty graves erected as a memorial to the deceased... until he says: It has become customary for Muslims, as the Jews used to do, to renovate the building of their saints' graves, whiten and decorate them, and sometimes cover the Tarkiba or Tabut with a new cover. Most of those do that out of ostentation (124) (124) - I said: This is from some of them, but others do it as an act of worship and drawing closer to Allah according to their claim.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 105
  },
  {
    "serial_number": "69611",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 103,
    "volume_number": 1,
    "text": "\"On this occasion, I mention that one of the great Easterners told me about some methods of colonization in Asia, that necessity required diverting caravans coming from India to Baghdad across that vast area to a new direction in which the colonizer had an interest. No means of propaganda was found to make the caravans choose it. Finally, they were guided to erecting several shrines and domes at close distances on this road. I would like to send it as a sincere word for the sake of Allah to Muslims in the East and West of the earth: to desist from aggrandizing graves, for it is a chauvinism for the individual and a call to egoism and the detested aristocracy that killed the spirit of the East, and to return to the spaciousness of religion which equalizes between all people, living or dead; there is no superiority for anyone over another except by piety and what his hands have put forth of sincere deeds for the sake of Allah.\" (125) (125) - \"Not from Islam\" (p. 174) by Professor Muhammad Al-Ghazali.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 106
  },
  {
    "serial_number": "69612",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 104,
    "volume_number": 1,
    "text": "Indeed, if the reader pauses with his thought at this matter contemplatively, he will soon be taken by wonder at the first instance at the loss of the graves of those great men and the disappearance of their locations from the view of the transmitters of news and recorders of artifacts, despite the greatness of their owners' status and their fame that covered the horizons and filled souls with reverence for their worth and acknowledgment of the virtue of their precedence to faith and spreading the call of the Quran. Undoubtedly, the least the reader's self would suggest upon contemplating this matter is: That those men's graves should be known by specification, and high domes with pillars should be erected over them, if not for their fame for righteousness, piety, true faith, and companionship of the Prophet, peace and blessings be upon him, then for what they performed of great deeds that the greatest of men are incapable of. So how did their graves disappear from the view of historians, and their tombs containing the senior Companions and Tabi'in become obliterated, until the biographers differed in determining their locations, and traces were wiped out on most of them except what they knew later by conjecture and guessing, and showed its trace by building on it after that time? While what is observed among Muslims is directing care to the graves of the dead to the utmost by being meticulous in raising and constructing them, erecting domes over them, and taking mosques near them, especially the graves of unjust rulers who had no praiseworthy trace in Islam, and the pseudo-sheikhs and imposters, most of whom were ignorant of the rulings of faith. There is no comparison between them and those great men like Abu Ubaidah bin Al-Jarrah and his brothers from the senior noble Companions who transmitted the religion fresh and tender and reached a far place in piety and virtue? The answer to this is that the Companions and Tabi'in were not, in their era, less appreciative of the worth of men and venerating the status of those who excelled among them of famous heroes and the best of the Ummah. However, they used to disdain constructing graves of the dead and venerating remains, due to their realization of the explicit prohibition of that from the Owner of the bright, tolerant Hanifiyyah Sharia which came to eradicate the root of idolatry and wipe out traces of venerating remains or devotion to the graves of the dead. They see that the best of generations are the obliterated ones (126) (126) - I said: This is not a hadith. The Sunnah is raising the grave above the ground about a hand span. Its explanation is in my book \"Ahkam Al-Jana'iz wa Bida'uha\" (p. 208-209) printed by Al-Maktab Al-Islami).",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 107
  },
  {
    "serial_number": "69613",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 105,
    "volume_number": 1,
    "text": "I said: Refer for that to our book \"Ahkam Al-Jana'iz\".",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 108
  },
  {
    "serial_number": "69614",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 106,
    "volume_number": 1,
    "text": "It was an idol worshipped by Daws in the Jahiliyyah (130) (130) - Narrated by Al-Bukhari (13 / 62), Muslim (8 / 182), and Ahmad (2 / 271).",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 109
  },
  {
    "serial_number": "69615",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 107,
    "volume_number": 1,
    "text": "(Refer to the Hadith of the Conquest and its extraction in \"Al-Ahadith Al-Sahihah\" (Number 4). So Muslims must prepare themselves for that by returning to their Lord, applying His Book, following the Sunnah of His Prophet, avoiding His prohibitions, and uniting on what pleases Him, Glory be to Him. On the horizon there is what might herald that Muslims have resumed the march towards that. May Allah Almighty realize hopes.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 110
  },
  {
    "serial_number": "69616",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 108,
    "volume_number": 1,
    "text": "Chapter Six",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 111
  },
  {
    "serial_number": "69617",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 109,
    "volume_number": 1,
    "text": "Dislike of Praying in Mosques Built over Graves After we have finished answering the previous doubts, and it has become clear from them to the noble reader that the prohibition of building mosques over graves is a confirmed ruling established until the Day of Judgment, and we have finished explaining the wisdom of the prohibition, it is appropriate for us to move to another issue which is a requisite of the mentioned ruling, namely the ruling on praying in these mosques built over graves. We mentioned previously (p. 30) that the prohibition of building mosques over graves implies the prohibition of praying in them, based on the principle that prohibiting the means implies prohibiting the end a fortiori. It results from this that praying in these mosques is forbidden, and the prohibition in such a place implies invalidity as is known among scholars (137). Imam Ahmad and others held the view of the invalidity of prayer in them. But we see that the issue needs detailing, so I say: Second: That praying in them is a means to venerating the one buried in them with a veneration outside the limit of Sharia, so it is forbidden as a precaution and to block the means, especially since the evils of mosques built over graves are visible to the eye as mentioned repeatedly. Scholars have stated both causes. The scholar Ibn Al-Malak from the Hanafi scholars said: Taking mosques over them was forbidden because praying in them is imitating the Sunnah of the Jews. Al-Qari quoted it in \"Al-Mirqat\" (1 / 470) and approved it. Some late Hanafi scholars and others said likewise as will come. Sheikh Al-Islam Ibn Taymiyyah said in \"Al-Qa'idah Al-Jalilah\" (p. 22): Taking a place as a mosque means taking it for the five prayers and others as mosques are built for that. A place taken as a mosque is intended for the worship of Allah and supplicating to Him, not supplicating to creatures. So he, peace be upon him, forbade taking their graves as mosques intended for prayers in them as mosques are intended, even if the one intending that intends only the worship of Allah alone [because that is a means to intending the mosque for the sake of the grave's occupant and supplicating to him and supplicating at his place]. So the Messenger of Allah, peace be upon him, forbade... so many of them permitted it at these times, which is the more apparent of the two sayings of scholars. Because if the prohibition is for blocking the means, it is permitted for a preponderant interest. Performing prayers with specific causes is needed at these times, and if not done in them, its interest is missed, so they were permitted due to the interest in them, unlike what has no cause for it can be done at another time, so no preponderant interest is missed by prohibiting it, and it contains harm necessitating its prohibition. If his prohibition of prayer at these times was to block the means to Shirk lest it leads to prostrating to the sun and supplicating to it and asking it as the people of calling upon the sun, moon, and stars do, who call upon them and ask them, it was known that calling upon the sun and prostrating to it is forbidden in itself and greater in prohibition than the prayer which he forbade lest it leads to calling upon the stars. Likewise, when he forbade taking the graves of prophets and righteous people as mosques, and forbade intending them for prayer at them lest that leads to calling upon them, calling upon them and prostrating was greater in prohibition than taking their graves as mosques. Know that the dislike of prayer in these mosques is a matter agreed upon by scholars as previously explained (p. 44) and will come. They only differed regarding its invalidity. The apparent Madhhab of the Hanbalis is that it is not valid, and the verifier Ibn al-Qayyim asserted this as preceded (p. 41-43). Sheikh Al-Islam Ibn Taymiyyah said in \"Iqtida' Al-Sirat Al-Mustaqim Mukhalafat Ashab Al-Jahim\" (p. 159): Al-Ayni Al-Hanafi mentioned similar in (Umdat Al-Qari) (4 / 149). And in (Al-Kawkab Al-Durri 'ala Jami' Al-Tirmidhi) by the investigating Sheikh Muhammad Yahya Al-Kandahlawi Al-Hanafi, the text is (p. 153): (As for taking mosques over them, it is due to the resemblance to the Jews and their taking mosques over the graves of their prophets and elders, and due to the veneration of the dead and remote resemblance to idol worshippers if the grave is in the direction of the Qibla. The dislike of it being in the direction of the Qibla is greater than the dislike of it being on the right or left. If it is behind the worshipper, it is lighter than all that but is not free from dislike.\"",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 112
  },
  {
    "serial_number": "69618",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 110,
    "volume_number": 1,
    "text": "Chapter Seven",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 113
  },
  {
    "serial_number": "69619",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 111,
    "volume_number": 1,
    "text": "The Previous Ruling Includes All Mosques Except the Prophet's Mosque\n\nThen know that the previous ruling includes all mosques, the large and the small, the old and the new, due to the generality of the evidences (142). No mosque containing a grave is excepted from this except the Noble Prophet's Mosque, because it has a special virtue not found in any other mosque over graves (143). This is due to his saying (peace and blessings of Allah be upon him): \"A prayer in this mosque of mine is better than a thousand prayers elsewhere, except the Sacred Mosque (Al-Masjid Al-Haram), [for it is better]\" (144). And due to his saying (peace and blessings of Allah be upon him) also: \"What is between my house (145) and my pulpit is a garden from the gardens of Paradise\" (146), and other virtues. If one were to say that prayer in it is disliked (Makruh), that would mean equating it with other mosques and removing these virtues from it, and this is not permissible as is apparent. We derived this meaning from the previous words of Ibn Taymiyyah (p. 127-128) regarding the reason for the permissibility of prayers with specific causes (Dhat al-Asbab) during the prohibited times. Just as prayer was permitted during these times because prohibiting it would lead to wasting it such that its virtue could not be retrieved due to the passing of its time, likewise it is said regarding prayer in his Mosque (peace and blessings of Allah be upon him). Then I found that Ibn Taymiyyah explicitly stated this, saying in his book \"Al-Jawab Al-Bahir fi Zuwwar Al-Maqabir\" (147) (p. 22 / 12):",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 114
  },
  {
    "serial_number": "69620",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 112,
    "volume_number": 1,
    "text": "145 - This is the correct wording: \"my house.\" As for the wording famous on tongues, \"my grave,\" it is an error by some narrators, as affirmed by Al-Qurtubi, Ibn Taymiyyah, Al-Asqalani, and others. Therefore, it was not extracted in any of the Sahih books. Its occurrence in some narrations does not make it authentic because it is a narration by meaning. Sheikh al-Islam Ibn Taymiyyah said in \"Al-Qa'idah Al-Jalilah\" (p. 74) after mentioning the hadith:\n(143) - On this occasion, I say: One of the most amazing flimsy reports and misleading illusions we have seen is what the scholar Ibn Abidin quoted in the Hashiyah (1 / 41) from the book \"Akhbar al-Duwal\" with a chain to Sufyan Al-Thawri that \"Prayer in the Mosque of Damascus is equal to thirty thousand prayers.\" I say: It is false and has no basis from the Messenger of Allah (peace and blessings of Allah be upon him), nor even from Sufyan Al-Thawri. Abu Al-Hasan Al-Raba'i extracted it in \"Fada'il al-Sham wa Dimashq\" (p. 35-37) and Ibn Asakir in \"Tarikh Dimashq\" (2 / 12) from Ahmad bin Anas bin Malik, who said Habib the Muezzin informed us, who said Abu Ziyad Al-Sha'bani and Abu Umayyah Al-Sha'bani informed us, saying: We were in Mecca, and there was a man in the shade of the Kaaba, and it was Sufyan Al-Thawri. A man said: \"O Abu Abdullah, what do you say about prayer in this land?\" He said: \"Equal to one hundred thousand prayers.\" He said: \"Then in the Mosque of the Messenger of Allah (peace and blessings of Allah be upon him)?\" He said: \"Equal to fifty thousand prayers.\" He said: \"Then in Bayt al-Maqdis (Jerusalem)?\" He said: \"Equal to forty thousand prayers.\" He said: \"Then in the Mosque of Damascus?\" He said: \"Equal to thirty thousand.\"\n(142) - Al-Shawkani said in \"Sharh al-Sudur fi Tahrim Raf' al-Qubur\" after mentioning the hadith of Jabir mentioned earlier with the wording: \"The Messenger of Allah (peace and blessings of Allah be upon him) forbade plastering the grave and building over it\" (p. 70).\n(135) - Narrated by Muslim (1 / 91) and Al-Tirmidhi (3 / 224) and he authenticated it; Al-Hakim (4 / 494-495) and Ahmad (3 / 107, 259, 268) and Ibn Mandah in \"Al-Tawhid\" (49 / 1). Yusuf bin Umar Al-Qawwas in \"His Hadith\" (68 / 1). The second narration is his, which is also a narration of Ahmad and Al-Hakim, who said: \"Sahih according to the condition of Muslim,\" and it is as he said. It has a corroborating evidence (Shahid) with him from the hadith of Ibn Mas'ud, and he authenticated it according to the condition of the two Sheikhs (Bukhari and Muslim), and Al-Dhahabi agreed with him.\n(132) - In this hadith is a clarification that the 'appearance' (dominance) mentioned in the verse was not realized completely, but rather it will be realized in the future. There is no doubt that the circle of dominance expanded after his death (peace and blessings of Allah be upon him) during the time of the Rightly Guided Caliphs and those after them. But perfection will not be except by the dominance of Islam over the entire globe. This will certainly happen due to the Messenger of Allah (peace and blessings of Allah be upon him) informing of it. It is authentically reported from him (peace and blessings of Allah be upon him) that he said: \"This matter will certainly reach what the night and day reach, and Allah will not leave a house of mud nor fur (tent) except that Allah will cause this religion to enter it, with the honor of an honored one or the humiliation of a humiliated one. An honor by which Allah strengthens Islam and a humiliation by which Allah humiliates disbelief.\" Narrated by Ahmad (4 / 203), Ibn Bishran in \"Al-Amali\" (60 / 1), Al-Tabarani in \"Al-Mu'jam Al-Kabir\" (1 / 126 / 1), Ibn Mandah in \"Kitab Al-Iman\" (102 / 1), Al-Hafiz Abdul Ghani Al-Maqdisi in \"Dhikr Al-Islam\" (166 / 1) who said: \"A Hasan Sahih hadith,\" and Al-Hakim (4 / 430-431) who said: \"Sahih according to the condition of the two Sheikhs,\" and Al-Dhahabi agreed with him, though it is only on the condition of Muslim. It has... regarding the interpretation of the noble verse. So in its light and with its broad comprehensive meaning, the mentioned verse must be interpreted. Among the details of the verse and hadith is what is authentically reported from him (peace and blessings of Allah be upon him) that the Muslims will conquer the city of Rome, the capital of the Pope, after their conquest of Constantinople. The first conquest has been realized, so the second conquest must inevitably be realized {And you will surely know its information after a time}.\n(127) - The hadiths narrated regarding the prohibition of erecting graves, venerating them, cursing those who take them as mosques, and targeting them with vows are many. Many of the reformist Imams have exhaustively discussed them, such as Sheikh al-Islam Ibn Taymiyyah and Ibn al-Qayyim and their likes. So let them be reviewed in their places in the books of the people, such as \"Al-Wasitah,\" \"Ighathat al-Lahfan,\" and others (121).\n(119) - Al-Nawawi said in his book (Manasik al-Hajj) (68 / 2):\n(93) - I say: Ibn Abi Shaybah also narrated it (2 / 73 / 2), and its men are all trustworthy, but it is interrupted (Munqati') between Nafi' and Omar, so perhaps the intermediary between them is Abdullah bin Omar (may Allah be pleased with them both).\n(89) - 3 Narrated by Ibn Abi Shaybah (2 / 185) and its men are trustworthy, the men of the two Sheikhs. Abu Bakr Ibn Al-Athram narrated it as in \"Fath al-Bari\" by Ibn Rajab (65 / 81 / 1 of Al-Kawakib).",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 115
  },
  {
    "serial_number": "69621",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 113,
    "volume_number": 1,
    "text": "4 - Narrated by Ibn Abi Shaybah (4 / 134) with a Sahih chain from him.\n(90) - Surah Al-Fil Verse 1.\n(91) - Surah Quraysh Verse 1.\n(92) - Narrated by Ibn Abi Shaybah (2 / 84 / 1) and its chain is Sahih according to the condition of the two Sheikhs.\n(94) - Narrated by Ibn Abi Shaybah also (2 / 83 / 2) and Al-Azraqi in \"Akhbar Makkah\" (p. 304), and its chain is Sahih. Ahmad (6 / 8), Abu Ya'la, and Ibn Mandah in \"Al-Tawhid\" (26 / 1, 2) narrated something similar from Abu Basrah Al-Ghifari, and it is also Sahih. I extracted it in \"Silsilat Al-Ahadith Al-Sahihah\" at the end of the third hundred, and in \"Irwa' al-Ghalil\" number (970).\n(95) - Ibn Abi Shaybah also extracted it (2 / 83 / 2). And from him Abu Ya'la in his \"Musnad\" (Folio 32 / 2), and Isma'il Al-Qadi in the book \"Fadl al-Salat 'ala al-Nabi\" (Virtue of Prayer upon the Prophet, peace and blessings of Allah be upon him), Hadith 20 of the Islamic Office edition. Al-Diya' narrated it in \"Al-Mukhtarah\" (1 / 154) via Abu Ya'la, and Al-Khati in \"Al-Muwaddih\" (2 / 30). Its chain is consecutive (Musalsal) with the People of the House (Ahl al-Bayt) may Allah be pleased with them, except that one of them, Ali bin Umar, is hidden (Mastur) as Al-Hafiz said in \"Al-Taqrib\".\n(96) - This, and the sources mentioned before it, are all manuscripts, and most of them are in the Zahiriyah Library and the Awqaf Library in Aleppo.\n(97) - I say: Abdul Razzaq also extracted it in his \"Musannaf\" (3 / 577 / 6694). This Suhayl: Ibn Abi Hatim mentioned him in \"Al-Jarh wa al-Ta'dil\" (2 / 1 / 24) and mentioned two narrators from him: one of them is Muhammad bin Ajlan, who is the narrator of this hadith from him in Ibn Abi Shaybah, and the other is Sufyan Al-Thawri, and he did not mention any criticism or praise regarding him. He has a third narrator, who is Isma'il, the narrator of this from him in Ibn Khuzaymah, and he is Isma'il bin Ulayyah. This is a precious benefit you will not find in the books of narrators (Rijal), for three trustworthy narrators narrated from him, so he is known (Ma'ruf) and not unknown (Majhul). And Allah knows best.\n(99) - Narrated by Abu Dawood (2042) and Ahmad (2 / 367) with a Hasan chain. Abu Ya'la narrated it in his \"Musnad\" (4 / 1597) book copy from the hadith of Al-Hasan bin Ali bin Abi Talib with a chain that has some issues.\n(100) - Al-Sustat is a verse of poetry in \"Al-Lisan\". And in \"Al-Kawakib Al-Darari\" (Folio 87 / 1 Tafsir 548): \"Ahmad disliked that a tent (Fustat) be pitched over a grave.\"\n(101) - Narrated by Al-Bukhari in a suspended form (Mu'allaq) (2 / 98).\n(103) - Its chain is weak, but it has other paths in Ibn Asakir, so it is Sahih through them.\n(104) - Narrated by Ibn Abi Shaybah also, and its men are trustworthy except Tha'labah, who is Ibn Al-Furat. Abu Hatim and Abu Zur'ah said: \"I do not know him,\" as in \"Al-Jarh wa al-Ta'dil\" (1 / 464 / 465).\n(105) - Narrated by Ibn Sa'd (5 / 142).\n(106) - Narrated by Al-Dawlabi (1 / 134-135) and its men are trustworthy except this Salim, for he is unknown (Majhul) as Al-Dhahabi said in \"Al-Mizan\" and the Shiite Al-Hilli in \"Khulasat al-Aqwal\" (p. 108).\n(107) - Narrated by Ibn Sa'd (6 / 108) with a Sahih chain.\n(108) - Frequent visitation to it (Al-Ikhtilaf ilayha): meaning frequenting it for visitation. This is derived from his saying (peace and blessings of Allah be upon him) \"O Allah, do not make my grave an 'Eid.\"\n(110) - Narrated by Ibn Jarir in his \"Tafsir\" (4 / 275 researched by Ahmad Shakir, may Allah have mercy on him) and Al-Hakim (2 / 546) who said: Sahih according to the condition of Al-Bukhari, and Al-Dhahabi agreed with him. I say: Ibn Urwah Al-Hanbali attributed it to Sahih Al-Bukhari, which is an illusion. As for what Al-Awfi narrated from Ibn Abbas: (The people were one nation) he says: they were disbelievers (so Allah sent the prophets as bringers of good tidings and warners), it is not authentic from Ibn Abbas because Al-Awfi is weak and not used as proof. Fakhr Al-Razi erred among the commentators in narrating this saying from Ibn Abbas while remaining silent about it. Therefore, Al-Hafiz Ibn Kathir said (1 / 250): The first saying from Ibn Abbas is more correct in chain and meaning, because people were upon the religion of Adam until they worshipped idols, so Allah sent Noah (peace be upon him) to them. He was the first messenger Allah sent to the people of the earth. This saying is the one Ibn al-Qayyim authenticated in \"Ighathat al-Lahfan\" (2 / 205).\n(112) - Narrated by Muslim (8 / 159), Ahmad (4 / 162), Al-Harbi in (Al-Gharib) (5 / 24 / 2), Al-Baghawi in (Hadith Hudbah bin Khalid) (1 / 251 / 2), and Ibn Asakir (15 / 328 / 1).\n(113) - Narrated by Al-Bukhari (11 / 418), Muslim (18 / 52), Al-Dawlabi (1 / 98) and others. I extracted it in (Al-Irwa') number 1220.\n(114) - Surah Al-Rum Verse 30.\n(115) - Surah Nuh Verse 23.\n(117) - I say: Ibn Abi Hatim also narrated it as in (Al-Kawakib Al-Darari) by Ibn Urwah Al-Hanbali (6 / 112 / 2) and he listed its chain, which is Hasan, to this Abu Al-Mutahhar. I did not know him, and Al-Dawlabi did not mention him in (Al-Kuna wa Al-Asma') nor Muslim in (Al-Kuna)... from (Index of Shia Men).\n(120) - Surah Al-Jinn Verse 18.\n(122) - The greatest proof that you, let alone the common people, believe that calling upon them brings benefit. Otherwise, you would have equated calling upon them with calling upon inanimate objects and stones, indeed idols. I do not think you see the permissibility of calling upon those either, under the pretext that they do not harm or benefit. So he was confounded. (So take warning, O you with eyes).\n(123) - Surah Al-Baqarah Verse 159.\n(128) - See our previous comment.\n(129) - It is a place in Yemen, not the Tabalah which is used in proverbs saying: \"Easier on Al-Hajjaj than Tabalah,\" because that one is in Ta'if. \"Nawawi\".\n(131) - Surah Al-Saff Verse 9.\n(133) - Narrated by Muslim (8 / 182) and likewise Ahmad as in \"Al-Kawakib\" (130 / 1 Tafsir 555) and he said: \"Its chain is Sahih.\" I say: Abu Ya'la narrated it in his \"Musnad\" (Folio 216 / 2) and Al-Hakim (4 / 446, 447, 549) appending it to Muslim, so he was mistaken.\n(134) - Narrated by Abu Dawood (2 / 202) and Al-Tirmidhi (3 / 284) and Al-Hakim authenticated it (4 / 448, 449), Al-Tayalisi (Number 991), Ahmad (5 / 284), and Al-Harbi in \"Al-Gharib\" (5 / 167 / 1) from the hadith of Thawban in a raised (Marfu') form. Al-Hakim said: \"Sahih according to the condition of the two Sheikhs,\" and Al-Dhahabi agreed with him. However, it is only on the condition of Muslim, and he extracted this hadith in his Sahih (8 / 171). It has a corroborating evidence from the hadith of Abu Hurairah in Al-Tayalisi (2501).",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 116
  },
  {
    "serial_number": "69622",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 114,
    "volume_number": 1,
    "text": "(136) - Surah Al-Ma'idah Verses 15-16.\n(137) - I say: That is because prayer in these mosques is forbidden in itself. Therefore, scholars distinguished between a prohibition due to a meaning specific to the worship, which invalidates it, and one that is not specific to it, which does not invalidate it. See the clarification of this important issue and some examples in \"Jami' al-Ulum wa al-Hikam\" by the Jurist Al-Hafiz Ibn Rajab Al-Hanbali (p. 43).\n(144) - Extracted by Al-Bukhari and Muslim and others from the hadith of Abu Hurairah. Muslim and Ahmad (the addition is his) extracted it from the hadith of Ibn Umar. It has many paths with him and numerous corroborating evidences from a group of Companions. I have mentioned its paths in \"Al-Thamar Al-Mustatab fi Fiqh Al-Sunnah wa Al-Kitab.\"\n(146) - Narrated by Al-Bukhari and Muslim and others from the hadith of Abdullah bin Zaid Al-Mazini, and it is a Mutawatir hadith as Al-Suyuti said. I have mentioned seven paths for it from him (peace and blessings of Allah be upon him) in the previous source.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 117
  },
  {
    "serial_number": "69623",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 115,
    "volume_number": 1,
    "text": "147 - A manuscript in the Zahiriyah Library, which is a precious comprehensive book in its field. Allah granted success to someone to print it. Then Allah fulfilled the wish, and it was printed based on the Zahiriyah copy at the Salafiyyah Press in Cairo. It was published by the two noble scholars: Sheikh Abdul Malik bin Ibrahim, head of the Committee for the Promotion of Virtue in the Hijaz (may Allah bless his life), and Sheikh Muhammad Nasif (may Allah have mercy on him and reward him well for the Sunnah).",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 118
  },
  {
    "serial_number": "69624",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 116,
    "volume_number": 1,
    "text": "Then I rectified and said: What makes all of that unlikely is what Al-Bukhari extracted in his \"Sahih\" (Book of Jihad) from another path from Nafi', who said: Ibn Umar (may Allah be pleased with them both) said: \"We returned the next year, and no two people agreed on the tree under which we pledged allegiance. That was a mercy from Allah\" - meaning its concealment from them. This is a text stating that the location of the tree did not remain known so that it could be cut down by Omar. This indicates the weakness of the narration about cutting it down, which is indicated by the apparent interruption within it. What adds to its weakness is what Al-Bukhari narrated in \"Al-Maghazi\" of his \"Sahih\" from Saeed bin Al-Musayyib from his father (who said): \"I saw the tree, then I came to it later and did not recognize it.\" And via Tariq bin Abdul Rahman who said: I set out for Hajj and passed by people praying. I said: \"What is this mosque?\" They said: \"This is the tree where the Messenger of Allah (peace and blessings of Allah be upon him) took the Pledge of Satisfaction (Bay'at al-Ridwan).\" So I came to Saeed bin Al-Musayyib and he laughed and said: \"My father told me that he was among those who pledged allegiance to the Messenger of Allah (peace and blessings of Allah be upon him) under the tree. When we went out the next year, we forgot it and could not find it.\" In a narration: \"It became obscured to us.\" Saeed said: \"The Companions of Muhammad (peace and blessings of Allah be upon him) did not know it, but you know it? Then you are more knowledgeable!\" I say: Even if we lost this interrupted narration as a witness in our research after confirming its weakness, we have gained what is stronger than it, which is suitable as evidence for our topic: the hadith of Al-Musayyib and the hadith of Ibn Umar. Al-Hafiz said in his explanation of it: \"The wisdom in that is so that no temptation (Fitnah) occurs with it due to the good that happened under it. If it had remained, there would be no safety from some ignorant people venerating it, until the matter might lead them to believe it has the power to benefit or harm, as we see observed now regarding what is less than it.\" Ibn Umar pointed to this by saying: \"It was a mercy from Allah,\" meaning its concealment from them after that was a mercy from Allah the Exalted. I say: Among those trees referred to by Al-Hafiz was a tree I saw more than ten years ago east of the Martyrs of Uhud cemetery, outside its wall. It had many rags on it. Then I saw it in the season of last year (1371 AH) having been uprooted from its roots, praise be to Allah. May Allah protect the Muslims from the evil of other trees and Taghuts (idols/false gods) worshipped besides Allah the Exalted.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 119
  },
  {
    "serial_number": "69625",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 117,
    "volume_number": 1,
    "text": "10 - From Abu Hurairah who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Do not make your houses graves, and do not make my grave a place of celebration ('Eid), and send blessings upon me, for your blessings reach me\" (98).\n(98) - His saying \"reach me\": This hadith and others mentioned previously are explicit that he (peace and blessings be upon him) does not hear the prayers of those praying upon him. So whoever claims that the Prophet (peace and blessings of Allah be upon him) hears them has lied against him. So what is the state of one who claims that he (peace and blessings of Allah be upon him) hears other things?",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 120
  },
  {
    "serial_number": "69626",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 118,
    "volume_number": 1,
    "text": "12 - From Abu Hurairah, that he bequeathed that no tent (Fustat) be pitched over his grave (102).\n(102) - Narrated by Abdul Razzaq (3 / 418 / 6129), Ibn Abi Shaybah (4 / 135), Al-Raba'i in \"Wasaya al-Ulama\" (141 / 2), and Ibn Sa'd (4 / 338), and its chain is Sahih.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 121
  },
  {
    "serial_number": "69627",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 119,
    "volume_number": 1,
    "text": "First: That building mosques over graves is a greater crime than raising graves and pitching tents over them because of the curse reported regarding building, unlike raising and pitching mentioned.\nSecond: That it is assumed of those Salaf to have understanding and knowledge. If a prohibition is established from one of them regarding something that is less than what the Lawgiver forbade, and this prohibition [of the greater thing] was not narrated from one of them, we are certain that he forbids it as well. Even if we assume the prohibition did not reach him, his prohibition of what is less than this necessitates prohibition of it [the greater] a fortiori, as is not hidden. Thus, it is proven that the claim of the negation of the mentioned cause, and everything built upon it, is false due to its contradiction of the method of the righteous Salaf (may Allah be pleased with them) and its collision with the authentic hadiths. And Allah is the One sought for help.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 122
  },
  {
    "serial_number": "69628",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 120,
    "volume_number": 1,
    "text": "[Intending to Pray in Mosques Built over Graves Invalidates the Prayer]\nThe worshipper in the mentioned mosques has two states:\nFirst: That he intends to pray in them for the sake of the graves and seeking blessing from them, as many of the common people and not a few of the elite do.\nSecond: That he prays in them coincidentally, not intending the grave.\nIn the first state, there is no doubt about the prohibition of prayer therein, rather its invalidity. Because if he (peace and blessings of Allah be upon him) forbade building mosques over graves and cursed the one who does that, then the prohibition of intending to pray in them is more deserving, and the prohibition here implies invalidity (Batil), as previously mentioned recently.\n[Dislike of Prayer in the Mentioned Mosques Even if Not Intended for the Sake of the Grave]",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 123
  },
  {
    "serial_number": "69629",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 121,
    "volume_number": 1,
    "text": "As for the second state, the ruling of the invalidity of prayer therein does not appear clear to me, but rather only Dislike (Karahah). This is because the verdict of invalidity in this case requires specific evidence. The evidence by which we established invalidity in the previous case was valid based on the prohibition of building a mosque over a grave. So it is valid to say that intending to pray in this [is prohibited], but only with the realization of the intent of building. Thus, it is valid to say the prayer in it is invalid [if intended]. Without intent, there is no specific prohibition one can rely on regarding it, nor can it be analogized to it with a correct analogy, let alone a fortiori. Perhaps this is the reason the majority went for Dislike rather than Invalidity. I say this acknowledging that the subject requires further investigation and that the saying of invalidity is probable. Whoever has knowledge regarding any of that, let him kindly explain it with evidence, thanked and rewarded. As for the saying of the Dislike of prayer in mosques built over graves, this is the least a researcher can say, for two reasons:\nFirst: That praying in them involves resembling the Jews and Christians who used to, and still do, intend worship in those mosques built over graves (138).\n(138) - I read an article in \"Al-Mukhtar\" magazine, May 1958 issue, under the title \"The Vatican: The Ancient Holy City,\" in which its writer \"Ronald Carlos Petit\" describes St. Peter's Church in this city, saying (p. 40):",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 124
  },
  {
    "serial_number": "69630",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 122,
    "volume_number": 1,
    "text": "\"St. Peter's Church is the largest church of its kind in the Christian world. It stands on a square dedicated to Christian worship for more than seventeen centuries. It stands over the grave of the Saint himself, the fisherman, the disciple of Christ. Under its floors lies a maze of ancient tombs and old Roman ruins.\" Then he mentioned that about one hundred thousand people visit it during major holidays for worship.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 125
  },
  {
    "serial_number": "69631",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 123,
    "volume_number": 1,
    "text": "(peace and blessings of Allah be upon him) [prohibited] taking this place for the worship of Allah alone lest it be taken as a means to Shirk with Allah. An action, if it leads to corruption and has no preponderant benefit, is forbidden, just as prayer is forbidden during the three times because of the preponderant corruption in it, which is resembling the polytheists, which leads to Shirk. Intending to pray during those times has no preponderant benefit because voluntary prayer is possible in other times. For this reason, scholars disputed regarding [prayers with] specific causes (139).\n(139) - Meaning prayers with specific causes, like the two rak'ahs of greeting the mosque, the Sunnah of ablution, and similar ones.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 126
  },
  {
    "serial_number": "69632",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 124,
    "volume_number": 1,
    "text": "\"So these mosques built over the graves of prophets, righteous people, kings, and others must be removed by demolition or otherwise. This is something I know of no disagreement about among the known scholars. Prayer in them is disliked without any disagreement I know of, and it is not valid according to us in the apparent view of the Madhhab (school of thought), due to the prohibition and curse reported regarding that, and due to other hadiths. There is no difference in this issue whether the buried person is one; our companions only differed regarding a cemetery devoid of a mosque: is its limit three graves, or is prayer forbidden near a single grave even if there is no other grave near it? There are two views.\" I say: The second view is the one he preferred in \"Al-Ikhtiyarat Al-Ilmiyyah,\" where he said (p. 25): \"There is no such distinction in the speech of Ahmad and the generality of his companions. Rather, the generality of their speech, reasoning, and deduction necessitates preventing prayer near one of the graves, and this is the correct view. A 'Maqbarah' (cemetery) is wherever someone is buried, not that it is a collection of graves. Our companions said: And whatever enters into the name of the cemetery from what is around the graves, prayer is not performed in it. This designates that the prevention covers the prohibited area (Haram) of the single grave and the courtyard added to it. Al-Amidi and others mentioned that prayer is not permissible in it (i.e., the mosque whose Qiblah is towards the grave) until there is another barrier between the wall and the cemetery. Some of them mentioned that it is explicitly stated by Ahmad.\" Abu Bakr Al-Athram said: I heard Abu Abdullah, meaning Ahmad, being asked about prayer in the cemetery? He disliked prayer in the cemetery. It was said to him: 'If the mosque is between the graves, is prayer performed in it?' He disliked that the obligatory prayer be performed in it, but permitted funeral prayers in it. Imam Ahmad also said: 'Prayer is not performed in a mosque between graves except funerals, because this is the Sunnah for funerals.' Al-Hafiz Ibn Rajab said in 'Al-Fath': He refers to the action of the Companions. Ibn Al-Mundhir said: Nafi', the freed slave of Ibn Umar, said: We prayed over Aisha and Umm Salamah, and the Imam that day was Abu Hurairah, and Ibn Umar attended that. See 'Al-Kawakib Al-Darari' (65 / 81 / 1 and 2).\"",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 127
  },
  {
    "serial_number": "69633",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 125,
    "volume_number": 1,
    "text": "Perhaps Imam Ahmad's restriction in the first narration to mentioning the Obligatory prayer only does not indicate that other Sunnah prayers are permissible. For it is known that performing voluntary prayers in houses is better, and for that reason, he did not mention them with the Obligatory prayer. This is supported by the generality of his saying in the second narration: \"Prayer is not performed in a mosque between graves except funerals.\" This is an explicit text regarding what we said. It is supported by what is explicitly narrated from Ahmad regarding Anas: He used to dislike that a mosque be built over graves. It is explicit that the wall of the mosque does not suffice as a barrier between it and the grave. Rather, perhaps this saying negates the permissibility of building a mosque between graves absolutely, and this is closer [to the truth] because it cuts off the material of Shirk. Then Sheikh al-Islam Ibn Taymiyyah said in \"Al-Iqtida\": \"The structure over the grave of Ibrahim (peace be upon him) was closed; no one entered it until around the fourth century. It was said that some women connected to the Caliphs saw a dream regarding that, so they opened it. It was said: When the Christians took over these areas, they opened that. Then it was left as a mosque after the later conquests. The people of virtue among our Sheikhs used not to pray in the entirety of that structure, and they forbade their companions from praying in it, following the command of the Messenger (peace and blessings of Allah be upon him) and fearing disobedience to him, as mentioned previously. This was how their Sheikhs were in the past. As for our Sheikhs today, they are in heedlessness of this Sharia ruling. Many of them intend to pray in such mosques. I used to go with some of them when I was young, not yet learned in the Sunnah, to the grave of Sheikh Ibn Arabi to pray with him near it. When I learned the prohibition of that, I debated the referenced Sheikh a lot regarding it until Allah guided him, and he refrained from praying there. He used to admit that to me and thank me for being a cause for his guidance. May Allah have mercy on him and forgive him. Praise be to Allah who guided us to this, and we would not have been guided had Allah not guided us.\"\n[Dislike of Prayer in the Mosque Built over the Grave even without facing it]",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 128
  },
  {
    "serial_number": "69634",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 126,
    "volume_number": 1,
    "text": "Know that the dislike of prayer in mosques built over graves is consistent in every case, whether the grave is in front of him, behind him, to his right, or to his left. Prayer therein is disliked in every case. However, the dislike intensifies if the prayer is towards the grave, because in this case, the worshipper commits two violations: the first is praying in these mosques, and the other is praying towards the grave, which is forbidden absolutely, whether in a mosque or other than a mosque, by the authentic text from the Messenger of Allah (peace and blessings of Allah be upon him) as previously mentioned (p. 24). Rulings of scholars on that: Al-Bukhari pointed to this meaning by his saying in \"Al-Sahih\": \"Chapter: What is disliked regarding taking mosques over graves. And when Al-Hasan bin Al-Hussein bin Ali (may Allah be pleased with him) died, his wife pitched a dome over his grave for a year, then it was removed. They heard a shouter saying: 'Have they found what they lost?' Another answered him: 'Nay, they despaired, so they turned back.'\" Then he cited some of the previously mentioned hadiths. Al-Hafiz Ibn Hajar Al-Shafi'i said in his explanation: \"The suitability of this trace to the chapter is that the one residing in the tent (Fustat) is not free from praying there, so it necessitates taking a mosque near the grave. The grave might be in the direction of the Qiblah, so the dislike increases (140).\"\n(140) - Sheikh Muhammad bin Mukhaimar, one of the scholars of Al-Azhar, quoted in \"Al-Qawl Al-Mubin\" (p. 81) from Al-Hafiz Ibn Hajar that he said in \"Sharh Al-Fath\" regarding the hadith of Dhu al-Khalasah from \"Sahih Al-Bukhari\" in the discussion on battles, the text of which is: \"In the hadith is the prohibition of praying in mosques that contain graves by which people are tempted, and that it is obligatory to remove them.\" I say: I did not see it in the mentioned place of \"Al-Fath\", so it is possible it is in another place in it. And Allah knows best.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 129
  },
  {
    "serial_number": "69635",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 127,
    "volume_number": 1,
    "text": "And in \"Shir'at al-Islam\" from the books of the Hanafis, the text is (p. 569): \"It is disliked to build a mosque over a grave to pray in.\" This, in its absolute sense, supports what we mentioned of the scholars' opinions. Similar was mentioned previously from Imam Muhammad (may Allah have mercy on him) (p. 58). In these quotes is support for what we went towards regarding the dislike of prayer in mosques built over graves absolutely, whether he prays towards it or not. One must distinguish between this issue and prayer towards a grave that does not have a mosque over it. In this image, the dislike is realized only when facing the grave. Although some scholars did not stipulate facing it in this image either, and said it is prevented to pray around the grave absolutely, as mentioned recently from the Hanbalis. Similar is in \"Hashiyat al-Tahtawi\" on \"Maraqi al-Falah\" from the Hanafi books (p. 208). This is what befits the chapter of Blocking the Means (Sadd al-Dhara'i), due to his saying (peace and blessings of Allah be upon him): \"...So whoever avoids doubtful matters has cleared himself in regard to his religion and his honor, and whoever falls into doubtful matters falls into the Haram, like the shepherd who grazes around a sanctuary, all but grazing therein...\" the Hadith (141).\n(141) - Agreed upon from the hadith of Al-Nu'man bin Bashir, and it is extracted in \"Takhrij al-Halal\" (20).",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 130
  },
  {
    "serial_number": "69636",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 128,
    "volume_number": 1,
    "text": "From \"Al-Majmu'ah Al-Muniriyyah\": \"In this is an explicit declaration of the prohibition of building over graves. It applies to one who builds on the sides of the grave's pit, as many people do by raising the graves of the dead a cubit or more. Because it is not possible to make the grave itself a mosque. That indicates that the meaning is some of what is near it which connects to it. It applies to one who builds near the sides of the grave as well, as in domes, mosques, and large shrines, in a way that the grave is in their middle or in a side of them. For this is 'building over the grave' as is not hidden to anyone with the slightest understanding. Just as it is said: 'The Sultan built' even though the thickness of the building only directly touched the sides of the city, village, or place. There is no difference whether those sides upon which the building was placed are close to the center, as in a small city, small village, and narrow place, or far from the center, as in a city, large village, and wide place. Whoever claims that there is something in the Arabic language that prevents this usage does not know the language of the Arabs, does not understand their tongue, and does not know what is used in their speech.\"",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 131
  },
  {
    "serial_number": "69637",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 129,
    "volume_number": 1,
    "text": "I say: This chain is weak. Abu Ziyad Al-Sha'bani is unknown (Majhul). It appears he is Khiyar bin Salamah Abu Ziyad Al-Shami, and his peer is Abu Umayyah Al-Sha'bani (he is Yuhmad with a Damma on the Ya, Sukun on the Muhmala [Ha], and Kasra on the Mim). Both are acceptable (Maqbul) as in \"Al-Taqrib\". However, the narrator from them, Habib the Muezzin, is unknown. Ibn Asakir mentioned him in his \"Tarikh\" and did not add to his biography more than saying about him: \"He used to call the Adhan in the Suq al-Ahad mosque.\" The narrator from him, Ahmad bin Anas, I did not find a biography for him. What invalidates this trace from Sufyan is that he is one of the narrators of the hadith of Abu Hurairah coming later that prayer in his mosque (peace and blessings of Allah be upon him) is equal to a thousand prayers. It is unlikely that he would say something contrary to what is authentic according to him from the Prophet (peace and blessings of Allah be upon him). Also invalidating it is that the most authentic report from him (peace and blessings of Allah be upon him) regarding the virtue of prayer in Bayt al-Maqdis is that it is equal to a thousand prayers. Narrated by Ibn Majah (1 / 429-430) and Ahmad (6 / 463) with a good (Jayyid) chain. This trace says: It is equal to forty thousand prayers. Then it appeared to me that its chain is not good; it has a defect that impugns its authenticity, even if I had a predecessor in authenticating it. I clarified it in \"Da'if Abi Dawood\", \"Chapter on Lamps in Mosques.\" Yes, it is authentically reported that prayer in Bayt al-Maqdis is a quarter of the prayer in the Prophet's Mosque. Narrated by Al-Bayhaqi. In this invalidates the trace of Al-Thawri a fortiori, as is not hidden.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 132
  },
  {
    "serial_number": "69638",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 130,
    "volume_number": 1,
    "text": "\"This is the established correct [wording]. However, some of them narrated it by meaning and said (my grave). But he (peace and blessings of Allah be upon him), when he said this statement, had not yet been buried (peace and blessings of Allah be upon him). For this reason, none of the Companions used this as proof when they disputed regarding the place of his burial. If this were with them, it would have been a text regarding the point of dispute. But he was buried in the 'Room of Aisha' in the place where he died. May my father and mother be ransomed for him, blessings of Allah and His peace be upon him.\"\n(Note) Among the illusions of scholars is that Al-Nawawi in \"Al-Majmu'\" attributed the hadith to the two Sheikhs (Bukhari and Muslim) with the wording \"my grave,\" and it has no basis in their books. This required notification.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 133
  },
  {
    "serial_number": "69639",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 131,
    "volume_number": 1,
    "text": "\"And prayer in mosques built over graves is forbidden absolutely, unlike his mosque (peace and blessings of Allah be upon him), for prayer in it is equal to a thousand prayers. It was founded on piety. Its sanctity existed during his life (peace and blessings of Allah be upon him) and the lives of his Rightly Guided Caliphs before the Room was entered into it. It was only entered after the extinction of the era of the Companions.\" Then he said (67 / 169 / 2): \"The mosque was virtuous before the Room entered it. The virtue of the mosque was because the Prophet (peace and blessings of Allah be upon him) built it for himself and for the believers to pray to Allah—he and the believers—until the Day of Resurrection. So its construction by him is a virtue. How so, when he said: 'A prayer in this mosque of mine is better than a thousand prayers elsewhere except the Sacred Mosque' (148). And he said: 'Do not set out on a journey except to three mosques: The Sacred Mosque, Al-Aqsa Mosque, and this mosque of mine' (149). This virtue is established for it before the Room entered it. It is not permissible to think that it became better than it was by the Room entering it. They did not intend to enter the Room into it; rather, they intended to expand it by including the rooms of the wives of the Prophet (peace and blessings of Allah be upon him), so the Room entered it by necessity, with the dislike of those among the Salaf who disliked that.\" (150) Then he said (5512): \"Whoever believes that before the grave it had no virtue—while the Prophet (peace and blessings of Allah be upon him) used to pray in it along with the Emigrants and Helpers—and that virtue only occurred for it during the Caliphate of Al-Walid bin Abdul Malik when he introduced the Room into his mosque: such a person says this only if he is an ignoramus excessive in ignorance, or a disbeliever. He is denying what he (the Prophet) brought, deserving of death. The Companions used to supplicate in his mosque just as they used to supplicate during his life; no Sharia occurred for them other than the Sharia he taught them during his life... Rather, he forbade them from taking his grave as a place of celebration ('Eid) or the grave of anyone else as a mosque to pray in to Allah the Mighty and Majestic, to block the means to Shirk. So may Allah send blessings upon him and his family and grant them peace, and reward him with the best He rewarded a prophet on behalf of his nation. For he conveyed the message, fulfilled the trust, advised the nation, strove for Allah as He deserves to be striven for, and worshipped Allah until certainty (death) came to him from his Lord.\"\n(148) - Agreed upon from the hadith of Abu Hurairah. I extracted it in \"Al-Irwa'\" (1 / 971).\n(149) - Agreed upon from the hadith of Abu Hurairah as well. It is extracted in my book \"Ahkam al-Jana'iz wa Bida'uha\" (Rules of Funerals and their Innovations) (p. 224-225).\n(150) - See what was mentioned previously (at the beginning of the book regarding examples of the Salaf's dislike for that).",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 134
  },
  {
    "serial_number": "69640",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Warning the Worshipper against taking Graves as Mosques",
    "edition": "Fourth",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 132,
    "volume_number": 1,
    "text": "This is the last of what Allah the Blessed and Exalted granted success in collecting for this treatise. Praise be to Allah by whose grace good deeds are completed and good things endure. Glory be to You, O Allah, and with Your praise, I bear witness that there is no deity except You. I seek Your forgiveness and repent to You. May Allah send blessings and peace upon our Prophet Muhammad, the Unlettered Prophet, and upon his family and companions. And our final call is that praise be to Allah, Lord of the Worlds.",
    "foot_note": "None",
    "book_id": "349",
    "new_page_number": 135
  }
]