[
  {
    "serial_number": "4644326",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Jurisprudential Issues\nBook: And Protect Your Oaths (Wa Ihfazu Aimanakum)\nAuthor: Abdul Mannan Al-Talibi\nNumber of Pages: 80\n[The research is not printed]\nPublication date in Al-Shamela: 1 Rabi' al-Awwal 1442\n\nBook: And Protect Your Oaths\nAuthor: Abdul Mannan Al-Talibi\nNumber of Pages: 80\n[The research is not printed]\nPublication date in Al-Shamela: 1 Rabi' al-Awwal 1442\n\nAuthor: Abdul Mannan Al-Talibi\nNumber of Pages: 80\n[The research is not printed]\nPublication date in Al-Shamela: 1 Rabi' al-Awwal 1442\n\nNumber of Pages: 80\n[The research is not printed]\nPublication date in Al-Shamela: 1 Rabi' al-Awwal 1442\n\n[The research is not printed]\nPublication date in Al-Shamela: 1 Rabi' al-Awwal 1442\n\nPublication date in Al-Shamela: 1 Rabi' al-Awwal 1442",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644327",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "{AND PROTECT YOUR OATHS}\nAuthored by Dr. Abdul Mannan Al-Talibi\nWith an appendix of legal fatwas regarding oaths\nBy His Eminence the Judge and Scholar / Muhammad bin Ismail Al-Amrani\nIntroduced by the Judge and Scholar / Muhammad bin Ismail Al-Amrani\nThe Scholar Doctor / Hasan Muhammad Maqbuli Al-Ahdal\nSheikh / Muhammad Al-Sadiq Mughallis",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644328",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "Introduction:\nThe Judge and Scholar / Muhammad bin Ismail Al-Amrani, may Allah preserve him\nPraise be to Allah, Lord of the Worlds, and peace and blessings be upon the Master of Prophets and Messengers, and upon his pure and good family, and upon the noble and auspicious Companions, and upon those who follow them in goodness until the Day of Judgment... To proceed:\nThis book (And Protect Your Oaths), which was penned by my dear son, the active young scholar: Abdul Mannan Al-Talibi, is one of the best scientific compositions that have come out in these days because he has spoken in this work of his with good, strong, and focused speech on every issue with its correct evidence. He did not use as evidence any Prophetic Hadiths except what was authentic and referenced, and he purified it from weak Hadith, and was not lenient in using flimsy Hadiths as evidence, neither in encouraging nor in obligating and forbidding. Thus, it is a book worth traveling for, and should be written with gold water due to the countless benefits and valuable issues it contains that cannot be limited. May Allah be pleased with him and reward him with good and increase the youth like him. Amen. Glory be to Allah and praise be to Him, Glory be to Allah the Great.\nRabi' al-Thani year 1430 AH\nMuhammad bin Ismail Al-Amrani",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644329",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "Introduction:\nThe Judge and Scholar / Muhammad bin Ismail Al-Amrani, may Allah preserve him",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644330",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Introduction by Sheikh / Muhammad Al-Sadiq Mughallis",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644331",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\n\nIntroduction:\nPraise be to Allah, Lord of the Worlds, and peace and blessings be upon His Trustworthy Messenger, and upon his pure family and rightly guided companions, and those who follow them in goodness until the Day of Judgment... To proceed:\nOne of the greatest acts of closeness and most majestic acts of obedience is gaining understanding (Fiqh) in religion. Therefore, Allah Almighty encouraged it in His Noble Book, saying: {And it is not for the believers to go forth [to battle] all at once. For there should separate from every division of them a group [remaining] to obtain understanding in the religion and warn their people when they return to them that they might be cautious}. The Prophet, peace and blessings be upon him, praised those who gain understanding in religion and clarified that Allah intended good for them when He guided them towards this noble goal, saying, peace and blessings be upon him: «Whomever Allah wills good for, He gives him understanding in the religion» Agreed upon.\nThus, the virtue of understanding religion over all other sciences becomes clear. Part of understanding religion is enlightening people about their religious matters, warning them against the misleading paths of desires and slippery slopes of seduction, and taking their hands towards the path of truth and correctness.\nThere is no chapter of Fiqh except that you find people have some Sharia violations in it. Among this is what concerns oaths. The observer of the condition of some people today finds that they have deviated from the guidance of the Prophet, peace and blessings be upon him, in this chapter by swearing by other than Allah Almighty's names and attributes with various formulas and phrases since a long time ago. In this small-sized book, I have addressed important topics in the chapter of oaths and the rulings related to them, and the violations attached to them which people have taken lightly, such as swearing by Haram, swearing by divorce, and swearing the Zubayri oath which some still swear by and believe in until",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644332",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "our day, despite it being forbidden and Shirk, impermissible to swear by.\nI also touched upon the punishment of the false oath (Al-Yamin Al-Fajirah) and its consequences in this world and the Hereafter, so that whoever takes oaths lightly and swears false oaths to wrongfully take others' rights may be deterred. I was keen that the issues of this book be coupled with Sharia evidence from the Book and the authentic Sunnah, while attributing sayings to their sayers in their considered sources; to make it easy for the reader to understand and benefit from them.\nI benefited greatly from the corrections and notes of my esteemed Sheikhs who reviewed this research and introduced it.\nTo complete the benefit, I have collected what was easy for me to collect of fatwas by our esteemed Sheikh, the Judge and Scholar / Muhammad bin Ismail Al-Amrani regarding oaths with their different formulas and multiple violations, asking the Lord Almighty to make this humble effort purely for His Noble Face and to make it beneficial, indeed He is Praiseworthy, Glorious.\nWritten by the one in need of Allah / Abdul Mannan Al-Talibi\naltalaby10@hotmayl.com",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644333",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "And Protect Your Oaths\nWe will talk under the shade of this noble divine directive about the oath, its rulings, its expiation, and the violations related to it in four sections as follows:\n- Section One: The Oath.\n- Section Two: Types of Oaths.\n- Section Three: Rulings of Oaths.\n- Section Four: Expiation of Oaths.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644334",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "Section One: The Oath\n\nIntroduction:\nThe oath is a legitimate means of proving a right, known since ancient times. Its forms and methods of performance varied in societies according to beliefs, religions, and ideas. It was prevalent among the Arabs in the Pre-Islamic era (Jahiliyyah); so the Wise Lawgiver affirmed it in a way consistent with the sound creed far from polytheism (Shirk). The oath has remained in laws and regulations until our present time, despite the variation of beliefs and the prevalence of atheistic and materialistic doctrines.\nI will discuss it in five requirements:\n- Requirement One: Definition of the Oath - Its meanings - Reason for its naming.\n- Requirement Two: Legitimacy of the Oath - Its ruling - Its conditions.\n- Requirement Three: Description of the Oath - Ruling of swearing by other than Allah - Forms of swearing by other than Allah.\n- Requirement Four: The command to protect oaths, and the warning against false swearing.\n- Requirement Five: Formulas of oaths of the Prophet, peace and blessings be upon him, and his Companions, may Allah be pleased with them, which they used to swear by.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644335",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "Requirement One: Definition of the Oath - Its meanings - Reason for its naming\n\nFirst: Definition of the Oath:\nAl-Yamin (The Oath) linguistically: Its origin is the right hand, and its plural is Ayman and Aymun (1). From it is His saying Almighty: {And what is that in your right hand (Bi-Yaminika), O Moses?} (2).\nAmong its meanings:\n(a) Strength (3), from it is His saying Almighty: {We would have seized him by the right hand (Bil-Yamin)} (4).\n(b) Direction (5), from it is His saying Almighty: {(About) on the right (Al-Yamin) and on the left, in separate groups} (6).\n(c) Swearing (Half), Oath (Qasam), and Covenant (Ahd) (7), from it is His saying Almighty: {And they swore by Allah their strongest oaths (Aymanihim)...} (8). And His saying Almighty: {And if they break their oaths (Aymanahum) after their agreement...} (9).\nThe Oath in Sharia: \"It is the confirmation of a thing by mentioning a name or attribute of Allah\". This is the most concise definition... and the closest (10).\n\nSecond: Reason for its naming:\nSwearing was called Yamin (Right Hand): Because when they swore an alliance, each one of them would strike his right hand (Yamin) on the right hand of his companion, so swearing was metaphorically called Yamin (11).\n- And it was said: Because the right hand's nature is preserving things, so swearing was called that to preserve the sworn matter, and the sworn matter was called Yamin due to its connection with it (12).\n- And it was said: Because swearing is strengthened by the oath (Qasam) (13).\n- And it was said: Because it provides strength for the sworn matter, whether doing or leaving it (14).",
    "foot_note": "1. Al-Misbah Al-Munir fi Gharib Al-Sharh Al-Kabir by Al-Rafi'i, authored by the scholar Al-Muqri Al-Fayoumi, (351). \n2. Surah Taha Verse (17). \n3. Al-Misbah Al-Munir fi Gharib Al-Sharh Al-Kabir by Al-Rafi'i, authored by the scholar Al-Muqri Al-Fayoumi, (351). \n4. Al-Haqqah, Verse (45). \n5. Al-Misbah Al-Munir fi Gharib Al-Sharh Al-Kabir by Al-Rafi'i, authored by the scholar Al-Muqri Al-Fayoumi, (351). \n6. Al-Ma'arij (37). \n7. Lisan Al-Arab by Ibn Manzur (13/ 458), Nuzhat Al-A'yun Al-Nawazir, by Abu Al-Faraj Ibn Al-Jawzi (1/ 642). \n8. Al-Nahl (38). \n9. At-Tawbah (12). \n10. Fath Al-Bari Sharh Sahih Al-Bukhari, by Al-Hafiz Ibn Hajar, (11/ 629). \n11. Al-Misbah Al-Munir fi Gharib Al-Sharh Al-Kabir by Al-Rafi'i, authored by the scholar Al-Muqri Al-Fayoumi (852). \n12. Fath Al-Bari Sharh Sahih Al-Bukhari, by Al-Hafiz Ibn Hajar, (11/ 629). \n13. Radd Al-Muhtar 'ala Al-Durr Al-Mukhtar Sharh Tanwir Al-Absar (13/ 490). \n14. Previous Reference.",
    "book_id": "85"
  },
  {
    "serial_number": "4644336",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "Requirement Two: Legitimacy of the Oath - Its ruling - Its conditions\n\nFirst: Legitimacy of the Oath:\nThe basis for its legitimacy and the establishment of its ruling is the Book, the Sunnah, and Consensus.\nAs for the Book, it is the saying of Allah Glory be to Him and Most High: {Allah will not impose blame upon you for what is meaningless in your oaths, but He will impose blame upon you for [breaking] what you intended of oaths...} (1). And His saying Almighty: {And do not break oaths after their confirmation...} (2).\nAllah commanded His Prophet, peace and blessings be upon him, to swear in three places:\n- He Almighty said: {And they ask you, \"Is it true?\" Say, \"Yes, by my Lord, indeed it is truth, and you will not cause failure [to Allah]\"} (3).\n- And He Glory be to Him said: {Say, \"Yes, by my Lord, it will surely come to you\"} (4).\n- And He Glory be to Him said: {Say, \"Yes, by my Lord, you will surely be resurrected\"} (5).\nAs for the Sunnah, it is the saying of the Prophet, peace and blessings be upon him: \"By Allah, if Allah wills, I do not swear an oath and then see something else better than it, except that I do what is better and expiate for it\" (6).\nThe most frequent oath of the Prophet, peace and blessings be upon him, was \"And the Turner of hearts - and the Changer of hearts - and by the One in Whose Hand is my soul\" as will come later.\n- The oath may be subject to the five rulings, so its ruling becomes the ruling of what it leads to: Obligation, Prohibition, Recommendation, Dislike, or Permissibility.\nThe Ummah agreed on the legitimacy of the oath, the establishment of its ruling, and its original placement for emphasizing the sworn matter (7).",
    "foot_note": "1. Al-Ma'idah Verse (89). \n2. Al-Nahl Verse (91). \n3. Yunus Verse (53). \n4. Saba (3). \n5. At-Taghabun (7). \n6. Narrated by Al-Bukhari (11/ 688) No. (6680), and Muslim (11/ 101) No. (1649). \n7. Al-Mughni (13/ 217, 218)",
    "book_id": "85"
  },
  {
    "serial_number": "4644337",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "Second: Dislike of excessive swearing:\nThe principle is not to swear excessively, due to His saying Almighty: {And protect your oaths...} (1). It was said: He meant by it leaving swearing. i.e., do not swear. And it was said - which is the more correct view: He meant by it if you swear, do not break the oath (2).\nExcessive swearing by Allah Almighty is disliked; due to His saying Almighty: {And do not obey every worthless habitual swearer} (3). This is a dispraise of him which implies the dislike of his action. If it does not reach the limit of excess, it is not disliked unless accompanied by what necessitates its dislike (4).\n\nThird: Pillar of the Judicial Oath and its conditions:\nThe jurists agreed on stipulating six conditions for the Judicial Oath, which are:\n1 - That the swearer be accountable (Mukallaf) (adult, sane, choosing freely). So a child and a madman do not swear, and the oath of a sleeper and coerced person is not considered.\n2 - That the defendant denies the plaintiff's right. If he acknowledges, there is no need for swearing.\n3 - That the opponent requests the oath from the judge or the judge directs it to the swearer.\n4 - That the oath be personal, so swearing by proxy is not accepted because it relates to the swearer's liability and religion. So the agent or the guardian of a minor does not swear, and the matter is paused until he reaches puberty.\n5 - That it not be in rights purely for Allah Almighty like Hudud (prescribed punishments) and Qisas (retribution).\n6 - That it be in rights where acknowledgement is permissible. So the oath is not permissible in rights where acknowledgement is not permissible. Thus, the agent, executor, and guardian do not swear; because their acknowledgement against others is not valid (5).\nIts pillar:\n- The wording used in it. (6)",
    "foot_note": "1. Al-Ma'idah (89). \n2. Tafsir Al-Baghawi (3/ 93). \n3. Al-Qalam (10). \n4. Al-Mughni (13/ 223, 228), Al-Sharh Al-Mumti' by Ibn Uthaymeen (341). \n5. Al-Fiqh Al-Islami wa Adillatuh (6/ 597). \n6. Radd Al-Muhtar 'ala Al-Durr Al-Mukhtar Sharh Tanwir Al-Absar (5/ 472).",
    "book_id": "85"
  },
  {
    "serial_number": "4644338",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "Requirement Three: Description of the Oath - Ruling of swearing by other than Allah - Forms of swearing by other than Allah\n\nFirst: Description of the Oath:\nThe oath is only by a name of Allah Almighty's names, or an attribute of His attributes Glory be to Him, whether it is from the Attributes of Essence or the Attributes of Actions.\nThe evidences for swearing by the name of Allah Almighty are apparent; among them is the saying of the Prophet, peace and blessings be upon him: \"Whoever has to take an oath should swear by Allah or remain silent\" (1). And in Abu Dawood and Al-Tirmidhi with the wording: \"or keep quiet\" (2). And in a narration by Muslim: \"Whoever has to take an oath, let him not swear except by Allah\" (3).\nImam Al-Nawawi said - in his explanation of the previous Hadith -: \"In the Hadith is the permissibility of swearing by Allah Almighty and all His attributes, and this is agreed upon\" (4).\nAs for swearing by Attributes of Action; it is due to his swearing, peace and blessings be upon him, by the Turner of hearts (Muqallib al-Qulub), and by the Changer of hearts (Musarrif al-Qulub). In Sahih Al-Bukhari from the Hadith of Ibn Umar, may Allah be pleased with them both, he said: \"The oath of the Prophet, peace and blessings be upon him, used to be 'No, and the Turner of hearts'\" (5). And in Sunan Ibn Majah \"and the Changer of hearts\" (6).\nAl-Hafiz said in Al-Fath: \"Qadi Abu Bakr bin Al-Arabi said: In the Hadith - referring to the Hadith 'No, and the Turner of hearts' - is the permissibility of swearing by Allah's actions if He is described by them and His name is not mentioned (7)\".\nAs for swearing by Attributes of Essence, it is due to what Al-Tirmidhi and Al-Nasa'i narrated from the Hadith of Abu Huraira, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, said: \"When Allah created Paradise, He sent Gabriel and said: Look at it and at what I have prepared for its people in it. So he looked at it, then returned and said: No, by Your Might (Izzatika), no one hears of it except that he enters it\" (8).",
    "foot_note": "1. Al-Bukhari with Fath Al-Bari (11/ 646), No. (6646). \n2. Tuhfat Al-Ahwadhi (4/ 478), and Al-Albani authenticated it in Sahih Sunan Ibn Majah No. (2094). \n3. Sahih Muslim with Al-Nawawi's explanation (11/ 96) No. (1646). \n4. Sahih Muslim with Al-Nawawi's explanation (11/ 95, 96). \n5. Previously referenced. \n6. Previously referenced. \n7. Fath Al-Bari (11/ 642). \n8. Narrated by Al-Tirmidhi (4/ 693) No. (2560), and Al-Albani classed it as Hasan in Sahih Sunan Al-Tirmidhi No. (2698).",
    "book_id": "85"
  },
  {
    "serial_number": "4644339",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "Al-Bukhari titled a chapter in his Sahih - Chapter: Swearing by Allah's Might, Attributes, and Words - and cited Hadiths in it: Among them the Hadith of Ibn Abbas, may Allah be pleased with them both: The Prophet, peace and blessings be upon him, used to say: \"I seek refuge in Your Might\". And the Hadith of Abu Huraira from the Prophet, peace and blessings be upon him: \"A man remains between Paradise and Hell; so he says: O Lord, turn my face away from the Fire, no, by Your Might, I ask You for nothing else\" (1).\nIn the previous Hadiths and their likes is the permissibility of swearing by Allah Almighty's attributes like Might and similar ones such as Power, Majesty, Pride, and Greatness.\n\nSecond: Ruling of swearing by other than Allah:\nSwearing by other than Allah is not permissible. Prohibition of it has been reported and that it is Shirk. In Sunan Abu Dawood from the Hadith of Ibn Umar - may Allah be pleased with them both, said: I heard the Prophet, peace and blessings be upon him, say: \"Whoever swears by other than Allah has committed Shirk\" (2). And in the narration of Al-Tirmidhi: \"Has committed Kufr (disbelief) or Shirk\" (3).\nAl-Hafiz Ibn Hajar said: \"The expression with his saying 'has committed Kufr or Shirk' is for exaggeration in deterring and being strict about that\" (4).\nIbn Abd al-Barr said: \"Scholars agreed that the oath by other than Allah is disliked and forbidden, no one is permitted to swear by it\" (5).\n- This type of Shirk: is called Verbal Shirk, and it is Minor Shirk, like swearing by fathers, the Kaaba, Trust (Amanah)... etc.\nThe wisdom behind the prohibition of swearing by other than Allah is \"that swearing by something implies glorifying it, and true greatness belongs only to Allah alone, so no one else should be likened to Him\" (6). \"And because whoever swears by other than Allah has glorified other than Allah with a glorification resembling the glorification of the Lord Blessed and Exalted. Therefore, it was called Shirk because he associated other than Allah with Allah Almighty in glorifying Him by swearing by him...\" (7)",
    "foot_note": "1. Fath Al-Bari (11/ 664). \n2. Awn Al-Ma'bud Sharh Sunan Abi Dawood (6/ 155), No. (3249), and Al-Albani authenticated it in Sahih Sunan Al-Tirmidhi No. (1590). \n3. Tuhfat Al-Ahwadhi bi Sharh Jami' Al-Tirmidhi (4/ 479), No. (1535) and Al-Albani authenticated it in Al-Irwa' No. (2561). \n4. Fath Al-Bari (11/ 647, 684). \n5. Fath Al-Bari (11/ 647, 684). \n6. Fath Al-Bari (11/ 647, 684). \n7. Al-Mughni (13/ 222, 223).",
    "book_id": "85"
  },
  {
    "serial_number": "4644340",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "Third: Forms of swearing by other than Allah:\nThe forms of swearing by other than Allah have multiplied in ancient and modern times, and people have taken them lightly, indifferent to the deterrent texts reported regarding them. I will mention a part of these forms despite their abundance and multiplicity, but the saying of the Prophet, peace and blessings be upon him, encompasses them: \"Every oath sworn by other than Allah is Shirk\" (1).\n1) Swearing by Fathers and Mothers: It is the oath of the polytheists in Jahiliyyah, for Quraysh used to swear by their fathers. Prohibition of it has been reported in our religion. In Al-Bukhari and Muslim from the Hadith of Ibn Umar, may Allah be pleased with them both, that the Messenger of Allah, peace and blessings be upon him, caught up with Umar bin Al-Khattab, may Allah be pleased with him, while he was traveling in a group - swearing by his father - so he said: \"Verily Allah forbids you from swearing by your fathers... (2)\". Umar said: By Allah, I have not sworn by it since I heard the Prophet, peace and blessings be upon him, mentioning [the prohibition] nor narrating it [from others]. Meaning: I did not swear by it nor did I narrate that from others. And in Sunan Abu Dawood from the Hadith of Abu Huraira, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"Do not swear by your fathers nor by your mothers... (3)\"\n2) Swearing by Idols (Andad) and Tyrants (Tawaghit): Due to the Hadith of Abdul Rahman bin Samra, may Allah be pleased with him - that the Prophet, peace and blessings be upon him, said: \"Do not swear by Tawaghi...\" (4) And in Al-Nasa'i \"nor by Tawaghit\" (5). Tawaghi is the plural of Taghiya, which are idols, named by the verbal noun because of the disbelievers' tyranny in worshipping them because it is the cause of their tyranny and disbelief (6). And in Sunan Abu Dawood from the Hadith of Abu Huraira, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"Do not swear by your fathers, nor by your mothers, nor by idols, and do not swear except by Allah, and do not swear unless you are truthful\" (7).",
    "foot_note": "1. Mustadrak Al-Hakim No. (44) and Al-Albani authenticated it in Sahih Al-Targhib wa Al-Tarhib (3/ 131), No. (2952). \n2. Fath Al-Bari (11/ 645 - 646) No. (6646), and Sahih Muslim with Al-Nawawi's explanation (11/ 95) No. (1646). \n3. Awn Al-Ma'bud (6/ 154) No. (3246) and Al-Albani authenticated it in Sahih Sunan Abi Dawood No. (3248). \n4. Sahih Muslim (11/ 98) No. (1648). \n5. Sunan Al-Nasa'i (7/ 10) No. (7383) and Al-Albani authenticated it in Sahih Sunan Al-Nasa'i No. (3774). \n6. Sahih Muslim (11/ 98) No. (1648). \n7. Previously referenced.",
    "book_id": "85"
  },
  {
    "serial_number": "4644341",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "3) Swearing by Al-Lat and Al-Uzza: In Al-Bukhari and Muslim from the Hadith of Abu Huraira, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, said: \"Whoever swears and says in his oath 'By Al-Lat and Al-Uzza', let him say 'La ilaha illa Allah' (There is no god but Allah)...\" (1).\n4) Swearing by Disavowal from Islam: In Sunan Al-Nasa'i and Abu Dawood from Abdullah bin Buraidah from his father said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever swears saying 'I am innocent of Islam', if he is lying then he is as he said, and if he is truthful he will not return to Islam safely\" (2).\n5) Swearing by a religion other than Islam: In Al-Bukhari from Thabit bin Al-Dahhak, may Allah be pleased with him, said: The Prophet, peace and blessings be upon him, said: \"Whoever swears by a religion other than Islam is as he said...\" (3). And in Mustadrak Al-Hakim from the Hadith of Abu Huraira, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, said: \"Whoever swears an oath, he is as he swore: if he says he is a Jew, he is a Jew; and if he says he is a Christian, he is a Christian; and if he says he is innocent of Islam, he is innocent of Islam\" (4).\n6) Swearing by Trust (Amanah): In Sunan Abu Dawood from the Hadith of Abdullah bin Buraidah from his father said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever swears by Trust is not one of us\" (5).\n- And in Musnad Ahmad with the wording: \"He is not one of us who swears by Trust\" (6).",
    "foot_note": "1. Fath Al-Bari (11/ 653) No. (6650), and Muslim with Al-Nawawi's explanation (11/ 97) No. (1647). \n2. Awn Al-Ma'bud (6/ 159) No. (3255), and Al-Albani authenticated it in Al-Irwa (8/ 201). \n3. Fath Al-Bari (11/ 655) No. (6652). \n4. Mustadrak Al-Hakim No. (7900) and Al-Albani authenticated it in Sahih Al-Targhib (3/ 131) No. (2956). \n5. Awn Al-Ma'bud (6/ 156) No. (3251), and Al-Albani authenticated it in Sahih Al-Jami' No. (6203). \n6. Musnad Ahmad (38/ 82), and Al-Albani authenticated it in Sahih Al-Jami' (2/ 956) No. (5436).",
    "book_id": "85"
  },
  {
    "serial_number": "4644342",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "7) Swearing by the Kaaba: In Sunan Al-Tirmidhi from the Hadith of Ibn Umar, may Allah be pleased with them both, that he heard a man saying: No, and the Kaaba. Ibn Umar said: Do not swear by other than Allah, for I heard the Messenger of Allah, peace and blessings be upon him, say: \"Whoever swears by other than Allah has committed Kufr or Shirk\" (1). The Commander of the Faithful Umar, may Allah be pleased with him, heard Ibn Al-Zubayr swearing by the Kaaba, so he said to him: If I knew that you thought about it before swearing, I would have punished you. Swear by Allah then sin or be righteous (2). And in Sunan Al-Nasa'i from the Hadith of Abdullah bin Yasar from Qutaylah bint Saifi, may Allah be pleased with them both, that a Jew came to the Prophet, peace and blessings be upon him, and said: You commit Shirk (Tundid) and you commit Shirk, you say 'What Allah wills and you will' and you say 'And the Kaaba'. So the Prophet, peace and blessings be upon him, commanded them if they wanted to swear to say 'And the Lord of the Kaaba', and to say 'What Allah wills then you will'\" (3). And in a narration from her: \"Whoever swears, let him swear by the Lord of the Kaaba\" (4). And in the Hadith of Abu Rimthah, he said: I went with my father towards the Prophet, peace and blessings be upon him, then the Prophet, peace and blessings be upon him, said to my father: \"Is this your son?\" My father said: \"And by the Lord of the Kaaba\". He said: \"Really?\" He said: \"I bear witness to it.\" He said: So the Messenger of Allah smiled laughing\" (5).",
    "foot_note": "1. Tuhfat Al-Ahwadhi (4/ 479) No. (1535), and Al-Albani authenticated it in Sahih Al-Targhib No. (2952). \n2. Al-Muhalla by Ibn Hazm (8/ 46). \n3. Sunan Al-Nasa'i (7/ 6) and Sheikh Muqbil Al-Wadi'i authenticated it in Al-Jami' Al-Sahih (4/ 453). \n4. Al-Mu'jam Al-Kabir by Al-Tabarani (18/ 192) and Sheikh Muqbil Al-Wadi'i authenticated it in Al-Jami' Al-Sahih (2/ 1068). \n5. Musnad Imam Ahmad (11/ 680) and Sheikh Muqbil Al-Wadi'i authenticated it in Al-Jami' Al-Sahih (4/ 467).",
    "book_id": "85"
  },
  {
    "serial_number": "4644343",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "Requirement Four: The command to protect oaths - and the warning against false swearing\n\nFirst: The command to protect oaths:\nAllah Almighty commanded the protection of oaths, saying: {And protect your oaths...}. Imam Al-Baghawi said: \"He meant by it if you swear, do not break the oath, so the meaning is preserving the oath from breaking (Hinth)...\" (1).\nImam Al-Qurtubi said: The meaning is: \"Do not swear frequently by Allah\" (2).\nAllah dispraised those who swear frequently, saying: {And do not obey every worthless habitual swearer}. This is a dispraise of him which implies the dislike of his action. Al-Shawkani said - in the interpretation of the verse: - \"One who swears frequently falsely. The Arabs in Jahiliyyah used to praise themselves for few oaths, until one of them said: Few oaths, keeper of his oath ** And if an oath comes from him, it is truthful (3)\".\nAllah explained in His Book that among the characteristics of hypocrites is frequent false swearing. The Almighty said regarding them: {They swear by Allah to you to please you. But Allah and His Messenger are more worthy for them to satisfy, if they were believers} (4).\nIn Al-Bukhari and Muslim from the Hadith of Abdullah bin Masoud - may Allah be pleased with him - said: The Prophet, peace and blessings be upon him, was asked: Which people are best? He said: \"My generation, then those who follow them, then those who follow them, then there will come a people whose testimony precedes their oath, and whose oath precedes their testimony\" (5).\nImam Al-Nawawi said: \"This is a dispraise for one who testifies and swears along with his testimony\" (6).\nImam Al-Tahawi said: \"Meaning they swear frequently in everything until it becomes a habit for them, so one of them swears where an oath is not required from him and before he is asked to swear\" (7).",
    "foot_note": "1. Tafsir Al-Baghawi (2/ 80). \n2. Al-Jami' li Ahkam Al-Quran (3/ 97). \n3. Fath Al-Qadir (264). Al-Aliyah is: The Oath. \n4. At-Tawbah (62). \n5. Fath Al-Bari (11/ 662) No. (6658) and Muslim with Al-Nawawi's explanation (16/ 79) No. (2533). \n6. Sahih Muslim with Al-Nawawi's explanation (4/ 1962). \n7. Fath Al-Bari (11/ 663).",
    "book_id": "85"
  },
  {
    "serial_number": "4644344",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "The Piety of the Companions regarding swearing by other than Allah and their protection of their oaths:\nIbn Masoud, may Allah be pleased with him, said: To swear by Allah falsely is more beloved to me than to swear by other than Allah truthfully. The like of his saying was reported from Ibn Umar (1) and Ibn Abbas - may Allah be pleased with them. Sheikh Al-Islam Ibn Taymiyyah said, commenting on Ibn Masoud's words: \"Because the good deed of Tawhid is greater than the good deed of truthfulness, and the sin of lying is easier than the sin of Shirk. Allah Almighty said: {Indeed, Allah does not forgive association with Him, but He forgives what is less than that for whom He wills} (2).\nWhen the prohibition from the Prophet, peace and blessings be upon him, regarding swearing by fathers reached the Commander of the Faithful Umar, may Allah be pleased with him, he said: \"By Allah, I have not sworn by them since I heard the Prophet, peace and blessings be upon him, mentioning [the prohibition] nor narrating it\" (3).\nWhen Umar heard Ibn Al-Zubayr swearing by the Kaaba, he said: \"If I knew that you thought about it before swearing, I would have punished you. Swear by Allah then sin or be righteous\" (4).\nIt was narrated from Jubayr bin Mut'im, may Allah be pleased with him, that he ransomed his oath with ten thousand Dirhams, then said: \"By the Lord of this Mosque, if I swore, I swore truthfully, but it is something I ransomed my oath with\" (5).\nAl-Ash'ath bin Qais said: \"I bought my oath once for seventy thousand\" (6).\nThus was the piety of those after the Companions from the Followers and others in preserving their oaths. Amir Al-Sha'bi - may Allah have mercy on him - said: \"To swear by Allah and break the oath is more beloved to me than to swear by other than Him and fulfill it\" (7).\nIbrahim Al-Nakha'i - may Allah have mercy on him - said: \"Our companions (our Sheikhs) used to forbid us, and it was reported with the word 'beat us', while we were boys, from swearing by Testimony and Covenant\". In this is the desire to train the young on obeying their Lord and forbidding them from what harms them (8).\nIt was reported from Al-Shafi'i that he said: \"I never swore by Allah, neither truthfully nor falsely\".",
    "foot_note": "1. Irwa Al-Ghalil (8/ 191). \n2. Al-Nisa (48). \n3. Previously referenced. \n4. Previously referenced. \n5. Narrated by Al-Tabarani in Al-Awsat with a good chain (1/ 270) No. (881). \n6. Al-Mu'jam Al-Tabarani Al-Kabir, (1/ 234) No. (639). \n7. Fath Al-Bari (11/ 652). \n8. Fath Al-Bari (11/ 662).",
    "book_id": "85"
  },
  {
    "serial_number": "4644345",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "Second: - Warning against False Swearing:\nThe Prophet, peace and blessings be upon him, warned against false swearing. In Al-Mu'jam Al-Tabarani from the Hadith of Abu Huraira, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"Indeed, Allah, exalted is His mention, permitted me to speak about a rooster whose legs have pierced the earth and whose neck is bent under the Throne, saying: Glory be to You, how great You are our Lord. He replies to it: He does not know that who swore by Me falsely\" (1).\nFalse swearing is a characteristic of hypocrisy. The Almighty said - narrating their state -: {And they swear to untruth while they know} (2). He described them with this description in many verses of the Holy Quran. The Almighty said: {They swear by Allah to you to please you. But Allah and His Messenger are more worthy for them to satisfy, if they were believers} (3). And He Almighty said: {And they swear by Allah that they are from among you while they are not from among you; but they are a people who are afraid} (4).\nThe sin of the false oath increases when it relates to a human right. In Al-Bukhari, the Prophet, peace and blessings be upon him, said: \"Whoever swears a false oath to misappropriate the wealth of a Muslim man - or he said his brother - will meet Allah Almighty while He is angry with him\" (5). So the Muslim must beware of false oaths, and seek truthfulness in his oath, for Allah has magnified the one who swears by Him falsely. He, peace and blessings be upon him, said: \"Swear by Allah, be righteous, and speak the truth, for Allah loves to be sworn by\" (6).",
    "foot_note": "1. Narrated by Al-Tabarani in Al-Mu'jam Al-Awsat (7/ 220) No. (7324), and Al-Albani authenticated it in Sahih Al-Targhib No. (1839). \n2. Al-Mujadilah (14) \n3. At-Tawbah (62) \n4. At-Tawbah (56) \n5. Sahih Al-Bukhari (6/ 6283). \n6. Narrated by Abu Nu'aym in Al-Hilyah (7/ 267), and Al-Albani authenticated it in Sahih Al-Jami': (1/ 102), No. (211).",
    "book_id": "85"
  },
  {
    "serial_number": "4644346",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "Requirement Five: Formulas of oaths of the Prophet, peace and blessings be upon him, and his Companions, may Allah be pleased with them, which they used to swear by\n\nFirst: Oaths of the Prophet, peace and blessings be upon him, which he used to swear by:\nThe oath of the Prophet, peace and blessings be upon him, which he used to swear by and use frequently was:\n(a) Wallahi (By Allah): In Sahih Al-Bukhari from the Hadith of the Mother of Believers Aisha, may Allah be pleased with her, from the Prophet, peace and blessings be upon him, that he said: \"O Nation of Muhammad, by Allah, if you knew what I know, you would weep much and laugh little\" (1). And due to what Al-Tirmidhi narrated from Abdullah bin Adi bin Hamra' who said: \"I saw the Messenger of Allah, peace and blessings be upon him, standing on Al-Hazwarah (2) saying: \"By Allah, you are the best of Allah's land and the most beloved of Allah's land to Allah, and were it not that I was expelled from you, I would not have left\" (3).\n(b) Wa-alladhi nafsi bi-yadihi (By the One in Whose Hand is my soul): Due to what Al-Bukhari narrated from Jabir bin Samura from the Prophet, peace and blessings be upon him, said: \"When Caesar perishes, there will be no Caesar after him, and when Khosrow perishes, there will be no Khosrow after him. And by the One in Whose Hand is my soul, you will surely spend their treasures in the path of Allah\" (4).\nThis oath was reported from him, peace and blessings be upon him, with several wordings, including: \"By the One in Whose Hand is the soul of Muhammad\", and some starting with the phrase \"No, and by the One in Whose Hand is my soul\", and some with the phrase \"Ama (Behold/Truly) and by the One in Whose Hand is my soul\", and some with the phrase \"Wa-aymu (By) the One in Whose Hand is my soul\", and all are wordings established in the Sahih (5). And in Abu Dawood with the wording: \"By the One in Whose Hand is the soul of Abu Al-Qasim\" (6).",
    "foot_note": "1. Fath Al-Bari: (1/ 637) No. (6631). \n2. Ibn Al-Athir said: \"It is a place at the gate of the Wheat Sellers\". Al-Suhaili said: \"Name of a market that was in Mecca and was included in the Mosque when it was expanded\", Taj Al-Arus (11/ 10). \n3. Narrated by Ahmad in Al-Musnad (30/ 13), and Sheikh Muqbil Al-Wadi'i classed it as Hasan in Al-Jami' Al-Sahih (4/ 459). \n4. Fath Al-Bari (11/ 637) No. (6629). \n5. Fath Al-Bari (11/ 637 - 640) from No. (6628 - 6645). \n6. Narrated by Abu Ya'la in his Musnad (11/ 462), and Al-Albani authenticated it in Al-Silsilah Al-Sahihah No. (2733).",
    "book_id": "85"
  },
  {
    "serial_number": "4644347",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "(c) La wa Muqallib al-Qulub (No, and by the Turner of hearts): In Al-Bukhari from the Hadith of Ibn Umar said the oath of the Prophet, peace and blessings be upon him, was \"No, and by the Turner of hearts\" (1).\n(d) La wa Musarrif al-Qulub (No, and by the Changer of hearts): Due to what Ibn Majah narrated from the Hadith of Ibn Umar said: \"Most of his oaths were No, and by the Changer of hearts\" (2).\n(e) Wa Rabb al-Kaaba (And by the Lord of the Kaaba): Due to what Al-Bukhari narrated from Abu Dharr, may Allah be pleased with him, said I came to him - to the Prophet, peace and blessings be upon him, while he was saying in the shade of the Kaaba: \"They are the losers, by the Lord of the Kaaba, they are the losers, by the Lord of the Kaaba... I said who are they, may my father and mother be sacrificed for you O Messenger of Allah? He said: Those with the most wealth except who said like this and like this and like this\" (3).\n\nSecond: Oaths of the Companions, may Allah be pleased with them:\nThe oaths of the Companions, may Allah be pleased with them, were like the oaths of the Prophet, peace and blessings be upon him, for they used to swear like his swearing and emulate him, peace and blessings be upon him. Examples of that include:\n(a) Wallahi (By Allah): It was their most frequent oath, due to the Hadith of the Bedouin who came asking about Islam and in it he said \"By Allah, I will not increase upon this nor decrease. The Messenger of Allah, peace and blessings be upon him, said: He has succeeded if he is truthful\" (4).\n- And the Hadith of Aisha when she had postpartum bleeding during Hajj, she said: \"I would have loved, by Allah, that I had not performed Hajj this year...\" (5).\n- And the Hadith of Jabir in Al-Khandaq (The Trench) and in it that the Commander of the Faithful Umar, may Allah be pleased with him, said \"By Allah, O Messenger of Allah, I could hardly pray until the sun was about to set\" (6).",
    "foot_note": "1. Fath Al-Bari (11/ 637) No. (6628). \n2. Sunan Ibn Majah (1/ 677), and Al-Albani authenticated it in Sahih Al-Jami' (2/ 871). \n3. Fath Al-Bari (11/ 639) No. (6638). \n4. Sahih Al-Bukhari No. (45). \n5. Sahih Al-Bukhari No. (297). \n6. Sahih Al-Bukhari No. (609)",
    "book_id": "85"
  },
  {
    "serial_number": "4644348",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "(b) Wa-alladhi nafsi bi-yadihi (By the One in Whose Hand is my soul): As in the Hadith of Nu'aym Al-Mujmir, he said: I prayed behind Abu Huraira, so he recited Bismillah Al-Rahman Al-Rahim then recited the Mother of the Book until he reached \"ghayri al-maghdubi 'alayhim wa-la al-dallin\", he said: Amin, so the people said: Amin. When he bowed he said: Allahu Akbar. When he raised his head he said: Sami'a Allahu liman hamidah. Then he said: Allahu Akbar. Then he prostrated. When he raised [his head] he said: Allahu Akbar. When he prostrated he said: Allahu Akbar. When he raised [his head] he said: Allahu Akbar. Then he stood up straight with Takbir. When he stood up from the two [Rak'ahs] he said: Allahu Akbar. When he gave Taslim he said: By the One in Whose Hand is my soul, I am the closest of you in resemblance to the prayer of the Messenger of Allah, peace and blessings be upon him\" (1).\n(c) Wa Rabb al-Kaaba (And by the Lord of the Kaaba): Due to the Hadith of Abu Rimthah who said: I went with my father towards the Prophet, peace and blessings be upon him, then the Prophet, peace and blessings be upon him, said to my father: \"Is this your son?\" He said: Yes (I), by the Lord of the Kaaba. He said: Really? He said: I bear witness to it. He said: So the Messenger of Allah, peace and blessings be upon him, smiled laughing.\" (2).\n(d) Wa Rabb Muhammad (And by the Lord of Muhammad): This was reported in the Hadith of Aisha who said: The Messenger of Allah, peace and blessings be upon him, said: \"I know when you are pleased with me and when you are angry with me; when you are pleased you say: No, by the Lord of Muhammad, and when you are angry with me you say: No, by the Lord of Abraham\" (3).",
    "foot_note": "1. Sunan Al-Nasa'i (5/ 100), and Al-Arna'ut authenticated it No. (1797). \n2. Narrated by Abu Dawood in his Sunan (4/ 287), and Sheikh Muqbil authenticated it in Al-Jami' Al-Sahih (4/ 467). \n3. Sahih Al-Bukhari (7/ 47) No. (5228).",
    "book_id": "85"
  },
  {
    "serial_number": "4644349",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "Section Two: Types of Oaths\nRequirement One: The Vain Oath (Yamin al-Laghw) - Its nature - Its ruling.\nRequirement Two: The Contracted Oath (Al-Yamin Al-Mun'aqidah) - Its nature - Its ruling.\nRequirement Three: The False Oath (Al-Yamin Al-Ghamus) - Its nature - Reason for its naming - Its ruling.\nRequirement Four: Punishment of the Perjurous Oath and what entails from it in this world and the Hereafter.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644350",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "Requirement One: The Vain Oath (Yamin al-Laghw) - Its nature - Its ruling\nThe Vain Oath:\n(First) Meaning of Laghw:\nAl-Raghib Al-Asfahani said: \"It is originally speech that is not considered, and what is meant by it in oaths is what is uttered without thought, so it runs the course of Laga which is the sound of sparrows and similar birds\" (1).\nThere was disagreement in its interpretation on several opinions:\nThe most famous: which is the school of the majority of scholars, is that it is a man's speech 'No by Allah' and 'Yes by Allah' without intending an oath. Due to what Abu Dawood narrated in his Sunan from Ibrahim Al-Sa'igh who said: I asked Ata about Laghw in the oath? He said: - Aisha said - The Messenger of Allah, peace and blessings be upon him, said: \"It is a man's speech 'No by Allah' and 'Yes by Allah'\" (2). The Hadith was reported from Aisha, may Allah be pleased with her, as Mawquf (stopped at companion), as in Al-Bukhari, and Marfu' (raised to Prophet) as in... Sahih Ibn Hibban.\n(Second) Its ruling:\nThere is no expiation (Kaffarah) for it and no blame for it. Due to His saying Almighty: {Allah will not impose blame upon you for what is meaningless in your oaths...} (3).\nAl-Shawkani said - in the interpretation of this verse -: \"And in the verse is evidence that Allah does not hold the swearer accountable for Vain Oaths, and no expiation is obligatory for them\" (4).\nImam Ibn Qudamah said: \"And most people of knowledge are of the view that the Vain Oath has no expiation. And Ibn Abd al-Barr said: The Muslims agreed on this\" (5).",
    "foot_note": "1. Mufradat Alfaz Al-Quran by Al-Raghib Al-Asfahani (742). \n2. Awn Al-Ma'bud (6/ 204) No. (3315), and Al-Albani authenticated it as Marfu' in Sahih Mawarid Al-Zaman No. (488). \n3. Al-Ma'idah: (89). \n4. Fath Al-Qadir (2/ 81). \n5. Al-Mughni (13/ 245).",
    "book_id": "85"
  },
  {
    "serial_number": "4644351",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "Requirement Two: The Contracted Oath (Al-Yamin Al-Mun'aqidah) - Its nature - Its ruling\nThe Contracted Oath:\n(First) Its nature:\nThe Contracted Oath (Al-Mun'aqidah): Derived from 'Aqd (tying/contracting), and it is the heart's determination regarding the future not to do something then doing it, or to surely do something then not doing it (1).\n(Second): Its ruling:\nIt is obligatory to fulfill what was sworn upon, and if he breaks the oath (Hinth), expiation is obligatory.\nAllah Almighty said: {Allah will not impose blame upon you for what is meaningless in your oaths, but He will impose blame upon you for what your hearts have earned. And Allah is Forgiving and Forbearing} (2).\nAnd He Almighty said: {Allah will not impose blame upon you for what is meaningless in your oaths, but He will impose blame upon you for [breaking] what you intended of oaths...} (3).\nAnd he, peace and blessings be upon him, said: \"Whoever swears an oath and sees something else better than it, let him do what is better and expiate for his oath\" (4).\nIbn Abd al-Barr said: \"The oath that has expiation by the consensus of Muslims is that which is regarding future actions\" (5).",
    "foot_note": "1. Al-Jami' li Ahkam Al-Quran by Al-Qurtubi: (3/ 214). \n2. Al-Baqarah: (225). \n3. Al-Ma'idah: (89). \n4. Sahih Muslim No. (1650). \n5. Al-Mughni: (13/ 234, 235).",
    "book_id": "85"
  },
  {
    "serial_number": "4644352",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "Requirement Three: The False Oath (Al-Yamin Al-Ghamus) - Its nature - Reason for its naming - Its ruling\nThe False Oath (Al-Yamin Al-Ghamus): Also called the Patient Oath (Al-Yamin Al-Sabirah).\n(First) Its nature:\nAl-Yamin Al-Ghamus: Al-Manawi said: Al-Yamin Al-Ghamus is swearing falsely regarding a past action or omission (1).\nIts explanation was reported from the Prophet, peace and blessings be upon him, in the Hadith narrated by Al-Bukhari, Al-Tirmidhi, and Al-Nasa'i from the Hadith of Abdullah bin Amr bin Al-Aas, may Allah be pleased with them both, from the Prophet, peace and blessings be upon him, said: \"The major sins are associating partners with Allah, disobeying parents, and the Ghamus Oath\". And in a narration that a Bedouin came to the Prophet, peace and blessings be upon him, and said: O Messenger of Allah, what are the major sins? He said: \"Associating partners with Allah.\" He said: Then what? He said: \"The Ghamus Oath?\" I said: And what is the Ghamus Oath? He said: \"The one who appropriates the wealth of a Muslim man by an oath in which he is lying\" (2).\nAnd in Mustadrak Al-Hakim from the Hadith of Ibn Masoud, may Allah be pleased with him, said: We used to count among the sins that have no expiation the Ghamus Oath. It was said: And what is the Ghamus Oath? He said: A man appropriating with his oath the wealth of a man\" (3).\n(Second) Reason for its naming:\nAl-Hafiz said: It was named so because it dips (Taghmis) its owner in sin, then in Fire. It was said: The origin of that is that when they wanted to make a covenant, they would bring a bowl and put perfume or blood or ashes in it, then swear when they dip their hands in it to complete by that the intended confirmation of what they wanted. So that oath was called Ghamusa when its owner betrayed because he went to the extreme in breaking the covenant, as if it is, based on this, taken from the dipped hand...\" (4).",
    "foot_note": "1. Al-Tawqif 'ala Muhimmat Al-Ta'arif (1/ 751). \n2. Fath Al-Bari (13/ 677) No. (6675), and Al-Albani authenticated it in Sahih Al-Targhib (2/ 366) No. (1831). \n3. Mustadrak Al-Hakim (4/ 329), and Al-Albani authenticated it in Sahih Al-Targhib wa Al-Tarhib (2/ 367) No. (1833). \n4. Fath Al-Bari, (3/ 677), Al-Nihayah fi Gharib Al-Hadith by Ibn Al-Athir (1/ 386).",
    "book_id": "85"
  },
  {
    "serial_number": "4644353",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "(Third) Its ruling:\nThe Ghamus Oath is one of the major sins. It has no expiation according to the majority of scholars, because it is an oath of deception, trickery, and lying, and the swearer has burdened himself with its sin. The Almighty said: {And do not take your oaths as [means of] deceit between you, lest a foot slip after it was [firmly] planted, and you taste evil because you averted [people] from the way of Allah, and you have a great punishment} (1).\nRegarding it, the saying of Allah Almighty was revealed: {Indeed, those who exchange the covenant of Allah and their [own] oaths for a small price - they will have no share in the Hereafter, and Allah will not speak to them or look at them on the Day of Resurrection, nor will He purify them; and they will have a painful punishment} (2).\nIn Musnad Ahmad from the Hadith of Abu Huraira, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"Five have no expiation: Associating partners with Allah, killing a soul without right, slandering a believer, fleeing from the battlefield, and a patient oath (Yamin Sabirah) by which wealth is appropriated without right\" (3).\nIbn Masoud said: \"We used to count among the sins that have no expiation the Ghamus Oath\" (4).\nSaeed bin Al-Musayyib said: \"It is from the major sins and it is greater than to be expiated\" (5). The obligation in it is repentance and returning rights to their owners.",
    "foot_note": "1. Al-Nahl (49). \n2. Al Imran (77). \n3. Musnad Ahmad (2/ 200), and Al-Albani classed it as Hasan in Sahih Al-Targhib (2/ 386) No. (1836). \n4. Mustadrak Al-Hakim (4/ 429), and Al-Albani authenticated it in Sahih Al-Targhib (2/ 367) No. (1833). \n5. Al-Mughni (13/ 240).",
    "book_id": "85"
  },
  {
    "serial_number": "4644354",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "Requirement Four: Punishment of the Perjurous Oath and what entails from it in this world and the Hereafter\nThe Perjurous Oath (Al-Yamin Al-Fajirah) by which a Muslim appropriates his brother's wealth has effects entailed upon it, and punishments that befall its owner, some of which are immediate in this world, and some are postponed to the Day of Resurrection. I will mention them in this requirement in detail:\n(First) Punishment of the Perjurous Oath and its effect on its owner in this world.\n(a) The Perjurous Oath by which a Muslim appropriated his brother's wealth takes away the wealth he swore for:\nDue to the Hadith of Abdul Rahman bin Awf, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: \"The perjurous oath takes away the wealth, or goes away with the wealth\" (1).\n(b) The Perjurous Oath is a black spot in the heart of its owner until the Day of Resurrection:\nDue to the Hadith of Abdullah bin Unais Al-Juhani - may Allah be pleased with him - said: The Messenger of Allah, peace and blessings be upon him, said: \"No swearer swears by Allah a patient oath (Yamin Sabr), introducing into it the weight of a mosquito's wing, except that it is made a spot in his heart until the Day of Resurrection\" (2). And he, peace and blessings be upon him, said: \"Whoever appropriates the wealth of a Muslim man by a false oath, it will be a black spot in his heart that nothing changes until the Day of Resurrection\" (3).\n(c) The Perjurous Oath makes homes desolate and leaves them empty (Balaqi'):\nIn the Hadith of Abu Huraira, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"There is nothing by which Allah is disobeyed that is swifter in punishment than oppression (Baghy), and nothing in which Allah is obeyed that is swifter in reward than maintaining ties (Silah), and the perjurous oath leaves homes empty (Balaqi')\" (4). Balaqi': Plural of Balqa', which is empty land with nothing in it. He means that the swearer becomes poor and the sustenance in his house goes away. And it was said: It is that Allah scatters his affairs, and changes upon him what He bestowed upon him of blessing\" (5).\nIn the Hadith of Abu Huraira, may Allah be pleased with him, also said: The Messenger of Allah, peace and blessings be upon him, said: \"And indeed the swiftest disobedience in punishment is oppression and treachery, and the Ghamus Oath takes away wealth and leaves homes empty\" (6).",
    "foot_note": "1. Narrated by Al-Bazzar (3/ 245) and Al-Albani classed it as Hasan in Sahih Al-Targhib (2/ 368) No. (1835). \n2. Narrated by Al-Tirmidhi (5/ 86) and Al-Albani classed it as Hasan in Sahih Al-Targhib (2/ 367) No. (1832). \n3. Narrated by Al-Hakim in his Mustadrak (4/ 327) and Al-Albani authenticated it in Sahih Al-Targhib (2/ 369) No. (1838). \n4. Narrated by Al-Bayhaqi (10/ 35), and Al-Albani classed it as Hasan in Sahih Al-Targhib (2/ 368) No. 1836. \n5. Al-Qamus Al-Muhit by Al-Firuzabadi (649), Al-Nihayah fi Gharib Al-Hadith wa Al-Athar by Ibn Al-Athir (1/ 153). \n6. Mu'jam Al-Tabarani Al-Awsat No. (1/ 155) and Al-Albani authenticated it in Al-Silsilah Al-Sahihah (3/ 52).",
    "book_id": "85"
  },
  {
    "serial_number": "4644355",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "(d) The Perjurous Oath hastens punishment for its owner in this world before the Hereafter:\nDue to his saying, peace and blessings be upon him: \"Whoever severs a kinship tie or swears a perjurous oath will see its evil consequence before he dies\" (1).\n(e) The Perjurous Oath's owner is stripped of blessing by the invocation of the Prophet, peace and blessings be upon him:\nIn the Hadith of Saeed bin Zaid Al-Qurashi said: I testify I heard the Messenger of Allah, peace and blessings be upon him, say: \"Whoever appropriates the wealth of a Muslim man by an oath, may Allah not bless him in it\" (2).\n(Second) Punishment of the Perjurous Oath and its effect on its owner in the Hereafter.\n(a) It is among the greatest sins with Allah Almighty on the Day of Resurrection:\nDue to the Hadith of Abu Ruhm Al-Sama'i said: The Messenger of Allah, peace and blessings be upon him, said: \"... And indeed among the greatest sins is one who appropriates the wealth of a Muslim man without right...\" (3).\n(b) The Perjurous Oath is a cause for Allah's anger upon the servant on the Day of Resurrection:\nFrom Abdullah bin Masoud, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: Whoever swears a patient oath (Yamin Sabr) to appropriate by it the wealth of a Muslim man meets Allah while He is angry with him, so Allah revealed the confirmation of that: {Indeed, those who exchange the covenant of Allah and their [own] oaths for a small price - they will have no share in the Hereafter, and Allah will not speak to them or look at them on the Day of Resurrection, nor will He purify them; and they will have a painful punishment} (4). Then Al-Ash'ath bin Qais entered and said: What did Abu Abdul Rahman tell you? They said: Such and such. He said: It was revealed about me. I had a well in the land of a cousin of mine, so I came to the Messenger of Allah, peace and blessings be upon him, and he said: Your evidence or his oath. I said: Then he will swear on it, O Messenger of Allah. So the Messenger of Allah, peace and blessings be upon him, said: \"Whoever swears a patient oath while he is perjurous in it to appropriate by it the wealth of a Muslim man meets Allah on the Day of Resurrection while He is angry with him\" (5).\nAl-Hafiz said: \"It contains strictness against one who swore falsely to take the right of a Muslim, and this is unanimously interpreted as referring to one who died without valid repentance (6).",
    "foot_note": "1. Narrated by Al-Bukhari in Al-Tarikh (3/ 207) and Al-Albani authenticated it in Sahih Al-Jami' No. (6475). \n2. Narrated by Ahmad in his Musnad No. (1640) and Sheikh Al-Arna'ut said its chain is strong.. \n3. Narrated by Al-Tabarani in Al-Kabir (16/ 194) and Al-Haythami said in Majma' Al-Zawaid: Narrated by Al-Tabarani in Al-Kabir and its men are trustworthy, and some have comments [about them] that do not harm. \n4. Al Imran (77). \n5. Al-Bukhari with Al-Fath (11/ 679, 680), No. (6676, 6677). \n6. Fath Al-Bari (11/ 685).",
    "book_id": "85"
  },
  {
    "serial_number": "4644356",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "(c) The Perjurous Oath is a cause for Allah's turning away from the servant on the Day of Resurrection and not looking at him:\nDue to the Hadith of Wa'il bin Hujr, may Allah be pleased with him, said: A man from Hadramaut and a man from Kinda came to the Prophet, peace and blessings be upon him. The Hadrami said: O Messenger of Allah, this man has overcome me regarding a land that belonged to my father. The Kindi said: It is my land in my hand, I farm it, he has no right in it. The Prophet, peace and blessings be upon him, said to the Hadrami: Do you have evidence? He said: No. He said: \"Then you have his oath\". He said: O Messenger of Allah, the man is perjurous, he does not care what he swears on, and does not refrain from anything. He said: \"You have nothing from him except his oath\". So he went to swear. When he turned back, the Prophet, peace and blessings be upon him, said: \"If he swore on wealth to consume it unjustly, he will surely meet Allah while He is turning away from him\" (1).\nIn the Hadith of Abu Musa, may Allah be pleased with him, said: Two men disputed before the Prophet, peace and blessings be upon him, regarding a land, one of them from Hadramaut. He said: He assigned the oath to one of them. The other cried out and said: Then he will take my land. He said: If he appropriated it by his oath unjustly, he would be among those whom Allah does not look at on the Day of Resurrection nor purify, and he has a painful punishment. He said: The other refrained and returned it\" (2).\n(d) Whoever swears a perjurous oath comes on the Day of Resurrection mutilated (Ajdham):\nDue to the Hadith of Al-Ash'ath bin Qais said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever swears a patient oath to appropriate by it the wealth of a Muslim man while he is perjurous in it meets Allah mutilated (Ajdham)\" (3). Al-Ajdham: Is the one whose limbs are all gone. (4). And it was said Ajdham: Cut off hand, or blessing, or argument, or movement, or cut off from means.\n(e) The Perjurous Oath obligates Fire for its owner and forbids him from Paradise:\nIn the Hadith of Abu Umama - may Allah be pleased with him - that the Messenger of Allah, peace and blessings be upon him, said: Whoever appropriates the right of a Muslim man by his oath, Allah has obligated the Fire for him and forbidden Paradise for him. They said: Even if it was something small, O Messenger of Allah? He said: Even if it was a twig of Arak\" (5).\nAnd from Al-Harith bin Al-Barsa', may Allah be pleased with him, said: I heard the Messenger of Allah, peace and blessings be upon him, in Hajj between the two Jamrat saying: \"Whoever appropriates the wealth of his brother by a perjurous oath, let him take his seat in the Fire, let your present convey to your absent, twice or thrice\" (6). And in a narration: \"Let him take a house in the Fire\" (7).",
    "foot_note": "1. Sahih Muslim with Al-Nawawi's explanation, (10/ 123), No. (139). \n2. Musnad Ahmad (32/ 247, 275) and Al-Arna'ut authenticated it No. (19514). \n3. Sahih Ibn Hibban (11/ 486) and Al-Arna'ut classed it as Hasan No. (5088). \n4. Al-Nihayah fi Gharib Al-Hadith by Ibn Al-Athir (1/ 251). \n5. Sahih Muslim with Al-Nawawi's explanation, (1/ 122), No. (137). \n6. Mustadrak Al-Hakim (4/ 294), and Al-Albani authenticated it in Sahih Al-Targhib (2/ 368) No. (1834). \n7. Mu'jam Al-Tabarani Al-Kabir (3/ 413) and Al-Albani authenticated it in Sahih Al-Targhib No. (1834).",
    "book_id": "85"
  },
  {
    "serial_number": "4644357",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "Section Three: Rulings of Oaths\nRequirement One: Rulings related to swearing.\nRequirement Two: Rulings related to the swearer.\nRequirement Three: General rulings.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644358",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "Requirement One: Rulings related to swearing\nMany rulings relate to swearing, including:\n1 - It is not permissible to swear except by a name of Allah Almighty's names or an attribute of His attributes:\nDue to his saying, peace and blessings be upon him: \"Whoever has to take an oath should swear by Allah or remain silent\" (1). And in a narration: \"Whoever has to take an oath, let him not swear except by Allah\" (2). And the oath of the Prophet, peace and blessings be upon him, was \"No, and by the Turner of hearts\" (3), \"No, and by the Changer of hearts\" (4). And in the Hadith of Ibn Abbas - may Allah be pleased with them both, said: The Prophet, peace and blessings be upon him, used to say: \"I seek refuge in Your Might\" (5)\n2 - Swearing by other than Allah is forbidden:\nDue to his saying, peace and blessings be upon him: \"Do not swear by your fathers, nor by your mothers, nor by idols, and do not swear except by Allah...\" (6). And due to his saying, peace and blessings be upon him: \"Whoever swears by other than Allah has committed Kufr or Shirk\" (7). And due to his saying, peace and blessings be upon him: \"Every oath sworn by other than Allah is Shirk\" (8).\n3 - Swearing by Allah falsely is forbidden:\nAllah Almighty dispraised it in His saying: {And they swear to untruth while they know} (9). And due to his saying, peace and blessings be upon him: \"Whoever swears a perjurous oath to appropriate by it the wealth of a Muslim man meets Allah while He is angry with him\" (10). And he, peace and blessings be upon him, said: \"Indeed, Allah permitted me to speak about a rooster whose legs have pierced the earth, and whose neck is bent under the Throne saying: Glory be to You, how great You are. So it is replied to it: \"He does not know that who swore by Me falsely\" (11).",
    "foot_note": "1. Previously extracted. \n2. Previously extracted. \n3. Previously extracted. \n4. Previously extracted. \n5. Previously extracted. \n6. Previously extracted. \n7. Previously extracted. \n8. Previously extracted. \n9. Previously extracted. \n10. Previously extracted. \n11. Previously extracted.",
    "book_id": "85"
  },
  {
    "serial_number": "4644359",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "4 - Swearing in buying and selling is disliked even if truthful:\nDue to his saying, peace and blessings be upon him: \"Swearing is a mover for the goods, a remover for the blessing\" (1). And due to his saying, peace and blessings be upon him: \"Beware of excessive swearing in selling, for it sells then wipes out [blessing]\" (2).\n5 - Whoever his Muslim brother swears to him, should believe him in his oath even if he knows otherwise from him:\nDue to the Hadith of Ibn Umar - may Allah be pleased with them both, said: The Prophet, peace and blessings be upon him, heard a man swearing by his father. He said: \"Do not swear by your fathers, and whoever swears by Allah let him be truthful, and whoever is sworn to by Allah let him be content, and whoever is not content is not from Allah\" (3).\nFrom Abu Huraira that the Prophet, peace and blessings be upon him, said: \"Jesus son of Mary saw a man stealing, so he said: Did you steal? He said: No, by the One whom there is no god but Him. Jesus said: I believed in Allah and denied my sight\" (4).\n6 - Breaking oaths is forbidden, and fulfilling them (Birr) and keeping them is obligatory:\nThe Almighty said: {And fulfill the covenant of Allah when you have taken it, and do not break oaths after their confirmation...} (5) and prohibition implies forbiddance. And due to his saying, peace and blessings be upon him: \"Swear by Allah, be righteous, and speak the truth, for Allah loves to be sworn by\" (6).\n7 - Introducing other than the oath into the oath is forbidden:\nDue to his saying, peace and blessings be upon him: \"No swearer swears by Allah a patient oath introducing into it the weight of a mosquito's wing except that it is made a spot in his heart until the Day of Resurrection\" (7).\n8 - The principle in oath is that it is on the defendant:\nDue to the Hadith of Ibn Abbas - may Allah be pleased with them both - that the Messenger of Allah, peace and blessings be upon him, said: \"If people were given according to their claims, people would claim the blood of men and their wealth. But the oath is upon the defendant\" (8). And in a narration in Al-Tirmidhi: \"Evidence is upon the plaintiff and the oath is upon the defendant\" (9).",
    "foot_note": "1. Sahih Al-Bukhari (3/ 78) No. (2087). \n2. Sahih Muslim (3/ 1228) No. (1607). \n3. Sunan Ibn Majah (1/ 679) and Al-Albani authenticated it in Sahih Sunan Ibn Majah (2/ 196) No. (1721). \n4. Sunan Ibn Majah (1/ 679) and Al-Albani authenticated it in Sahih Sunan Ibn Majah (2/ 196, 197) No. (1722). \n5. Al-Nahl (91/ 92). \n6. Hilyat Al-Awliya (7/ 267) and Al-Albani authenticated it in Sahih Al-Jami' (1/ 102) No. (211). \n7. Musnad Ahmad (25/ 436) and Al-Arna'ut authenticated it No. (16043). \n8. Sahih Muslim with Al-Nawawi's explanation (12/ 3) No. (1711). \n9. Narrated by Al-Tirmidhi (3/ 626) and Al-Albani authenticated it in Sahih Al-Jami' No. (2897).",
    "book_id": "85"
  },
  {
    "serial_number": "4644360",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "9 - By the oath, the dispute is cut off:\nIbn al-Qayyim said, and the oath has benefits, including:\n- Frightening the defendant of the bad consequence of false swearing, carrying him thereby to acknowledge the truth.\n- And among them is judging against him by his refusal (Nukul) to take it.\n- And among them is cutting off the dispute and demand immediately, and freeing each of the disputants from the pursuit of the other; but it does not drop the right, nor absolve the liability inwardly or outwardly. So if the plaintiff established evidence after the defendant swore, it is heard and judged by. Likewise if the oath was returned to the plaintiff and he refused, then the plaintiff established evidence, it is heard and judged by.\n- And among them is establishing the right by it if it is returned to the plaintiff or he established one witness.\n- And among them is hastening the punishment of the lying denier of the right upon him, for the Ghamus Oath leaves homes empty, so the oppressed becomes miserable by that instead of his oppression by losing his right, and Allah knows best (1).\n10 - Oaths are built on custom:\nThe scholar Sayyid Muhammad Rashid Rida said: \"The matter of oaths is built on the general custom among people by consensus, not on linguistic indications and Sharia terminologies. So whoever swore not to eat meat, then ate fish, does not break his oath even if Allah named it fresh meat, unless he intended it...\" (2).\n11 - Fulfilling the oath is prescribed if it is an act of obedience or if breaking it is not better than fulfilling it:\nDue to the Hadith of Abu Hazim that Ibn Umar passed by a man with some sheep of his, so he said to him: How much do you sell these sheep for? He said: For such and such. Ibn Umar said: I take them for such and such. He swore not to sell them. Ibn Umar went and finished his need then passed by him, so he said: O Abu Abdul Rahman take them for what you gave me. He said: \"I swore an oath and I would not help Satan against you by making myself break my oath\" (3).\nAnd from Abu Al-Fayd said: I heard Abdullah - a man from the people of Homs - say: I saw Abu Darda, may Allah be pleased with him, bargaining with a man for a sheep, so he swore not to sell it, then said later: I sell it. Abu Darda said: I hate to carry you to sin, so he refused to buy it\" (4).",
    "foot_note": "1. Al-Turuq Al-Hukmiyyah fi Al-Siyasah Al-Shar'iyyah by Ibn Qayyim Al-Jawziyyah (98). \n2. Tafsir Al-Quran Al-Hakim famous as Tafsir Al-Manar by Sayyid Muhammad Rashid Rida (7/ 40). \n3. Narrated by Al-Tabarani in Al-Kabir (10/ 410) No. (12896), he said in Majma' Al-Zawaid its men are men of the Sahih. \n4. Al-Sunan Al-Kubra by Al-Bayhaqi (10/ 35) No. (19652).",
    "book_id": "85"
  },
  {
    "serial_number": "4644361",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "And from Al-Bara' bin Azib, may Allah be pleased with him, said: \"The Messenger of Allah, peace and blessings be upon him, commanded us to fulfill the oath of the swearer\" (1).\nHinth in the oath: Breaking it and violating it, and it is as if from Ith'm (sin) and disobedience (2). And he Hanitha in his oath if he did not fulfill it (3).\n12 - The rights in which the oath is permissible are:\na) \"The jurists agreed on the impermissibility of swearing in purely Allah Almighty's rights, whether they are Hudud like adultery and theft... or acts of worship like prayer, fasting, and Hajj... unless a human right is attached to it, then it is permissible because Hudud are averted by doubts...\".\nb) And the jurists agreed - also - on the permissibility of the oath in wealth and what leads to wealth, so the defendant swears in affirmation and negation due to His saying Almighty: {Indeed, those who exchange the covenant of Allah and their [own] oaths for a small price...} (4), and due to the previous Hadith: \"If people were given according to their claims, people would claim the blood of men and their wealth, but the oath is upon the defendant\".\nc) And the jurists agreed on the permissibility of swearing in felonies of retribution and wounds and in some issues of personal status, and differed in some of its issues...\" (5).\n13 - And one exits the obligation of the oath by one of three things:\nFirst: Fulfilling it (Ibrar) by doing what was sworn upon.\nSecond: Expiation, and it is permissible before Hinth and after it according to verification.\nThird: Exception by something like Insha'Allah - following the oath...\" (6).",
    "foot_note": "1. Sunan Ibn Majah (1/ 683) and Al-Albani authenticated it in Sahih Sunan Ibn Majah (2/ 200) No. (1732). \n2. Al-Nihayah fi Gharib Al-Hadith (1/ 449). \n3. Mufradat Alfaz Al-Quran (260). \n4. Al Imran (77) \n5. Al-Fiqh Al-Islami wa Adillatuh, Dr. Wahbah Al-Zuhaili (6/ 608), (609) with adaptation. \n6. Adwa' Al-Bayan by Al-Shanqiti, (2/ 123, 124).",
    "book_id": "85"
  },
  {
    "serial_number": "4644362",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "Requirement Two: Rulings related to the swearer\nRulings related to the swearer have been clarified by texts of the Book and Sunnah, including:\n1 - He should not swear except on what he is certain of:\nDue to the Hadith of Abu Al-Hawra' Al-Sa'di said: I said to Al-Hasan bin Ali, may Allah be pleased with them both, what did you memorize from the Messenger of Allah, peace and blessings be upon him: \"Leave what makes you doubt for what does not make you doubt, for truthfulness is tranquility and lying is doubt\" (1).\n2 - He should not swear that Allah will not forgive so-and-so:\nDue to the Hadith of Abu Huraira, may Allah be pleased with him, said: I heard the Messenger of Allah, peace and blessings be upon him, say: \"There were two men from the Children of Israel who were brothers. One of them would sin, and the other exerted himself in worship. The diligent one would constantly see the other in sin; so he would say: Shorten [stop]. One day he found him on a sin, so he said to him: Shorten. He said: Leave me and my Lord; were you sent as a watcher over me? He said: By Allah, Allah will not forgive you - or Allah will not admit you to Paradise. So their souls were taken, and they gathered before the Lord of the Worlds. He said: To this diligent one, were you knowledgeable of Me or were you capable over what is in My Hand? And He said to the sinner: Go and enter Paradise by My mercy. And He said to the other: Take him to the Fire\" (2).\n3 - Whoever swears an oath then sees something else better than it, let him expiate for his oath and do what is better:\nIn the Hadith of Abu Musa Al-Ash'ari said: The Messenger of Allah, peace and blessings be upon him, said: \"... And indeed I, by Allah, if Allah wills - do not swear an oath then see something else better than it except that I do what is better and expiate it\" (3).\nFrom Abdul Rahman bin Samra said: The Prophet, peace and blessings be upon him, said: \"O Abdul Rahman bin Samra, do not ask for authority, for if you are given it due to asking, you will be left to it, and if you are given it without asking, you will be helped in it. And if you swore an oath then saw something else better than it, then expiate for your oath and do what is better\" (4).",
    "foot_note": "1. Narrated by Al-Tirmidhi (7/ 221) and Sheikh Muqbil Al-Wadi'i authenticated it in Al-Jami' Al-Sahih Mimma Laysa fi Al-Sahihayn (4/ 445). \n2. Narrated by Abu Dawood (4/ 427) and Sheikh Muqbil Al-Wadi'i classed it as Hasan in Al-Jami' Al-Sahih Mimma Laysa fi Al-Sahihayn (4/ 446 - 447). \n3. Al-Bukhari with Al-Fath (11/ 630) No. (6623) and Sahih Muslim with Al-Nawawi's explanation (11/ 99) No. (1649). \n4. Al-Bukhari with Al-Fath (11/ 629) No. (6622) and Sahih Muslim with Al-Nawawi's explanation (11/ 104) No. (1652).",
    "book_id": "85"
  },
  {
    "serial_number": "4644363",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "4 - Whoever swears not to do a matter of good should not use the oath as an excuse, but should expiate for his oath:\nDue to His saying Almighty: {And do not make [your oath by] Allah an excuse against your being righteous...} (1).\nAl-Shawkani said: \"Meaning do not make Allah a barrier and preventer for what you swore upon. That is, a man would swear against some good like joining ties of kinship, or kindness to others, or reconciliation between people, that he will not do that, then he refrains from doing it reasoning for that refraining that he has sworn not to do it. This meaning is what the majority mentioned in interpreting the verse...\" (2).\nIbn Abbas said: \"A man swears not to join his kinship while Allah has made a way out for him in expiation, so He commanded him not to use Allah as an excuse, but to expiate and be righteous\" (3).\n5 - It is not permissible to persist in an oath if the swearer's family is harmed by it:\nDue to his saying, peace and blessings be upon him: \"By Allah, for one of you to persist in his oath regarding his family is more sinful for him with Allah than to give his expiation which Allah enjoined\" (4).\nAl-Nawawi said \"The meaning of the Hadith is that if he swears an oath relating to his family and they are harmed by his non-breaking (of the oath), and breaking it is not a sin, then he should break it and do that thing and expiate for his oath. If he says I will not break it, rather I will refrain from committing Hinth and I fear sin in it, he is mistaken in this saying. Rather, his persistence in non-breaking and continuing harm on his family is more sinful than Hinth. And Lajaj (Persistence) in language: is insisting on a thing\" (5). And Lajaj is: Continuing in stubbornness in doing the action forbidden (6).\n6 - Whoever swears on what he does not own or on a sin or on severing a kinship tie, has no oath and owes expiation:\nDue to the Hadith of Saeed bin Al-Musayyib that two brothers from the Ansar had an inheritance between them, so one asked his companion for division. He said: If you return to ask me for division, I will never speak to you, and all my wealth is for the door/cover (Ritaj) of the Kaaba. Umar bin Al-Khattab, may Allah be pleased with him, said: The Kaaba is rich without your wealth. Expiate for your oath, and speak to your brother. For I heard the Messenger of Allah, peace and blessings be upon him, say: \"No oath is upon you nor vow in disobedience, nor in severing a kinship tie, nor in what you do not own\" (7).\n- Ritaj Al-Kaaba means: its interests or adornment (8). Abu Al-Tayyib Al-Azim Abadi said: And the meaning: binding this oath upon you is not obligatory, but expiation is upon you\".",
    "foot_note": "1. Al-Baqarah (225). \n2. Fath Al-Qadir (1/ 263). \n3. Sunan Al-Bayhaqi (10/ 33). \n4. Al-Bukhari with Al-Fath (11/ 630) No. 6625, Sahih Muslim with Al-Nawawi's explanation (11/ 17) No. (1655). \n5. Sahih Muslim with Al-Nawawi's explanation (11/ 111). \n6. Mufradat Alfaz Al-Quran (736). \n7. Narrated by Ibn Hibban (10/ 197) No. (4355) and Shu'aib Al-Arna'ut authenticated it. \n8. Awn Al-Ma'bud (6/ 208).",
    "book_id": "85"
  },
  {
    "serial_number": "4644364",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "And he, peace and blessings be upon him, said: \"... And whoever swears on a sin has no oath, and whoever swears on severing a kinship tie has no oath\"... And he also said \"There is no vow in disobedience to Allah and its expiation is the expiation of an oath\". And in the Hadith of Malik Al-Jushami, may Allah be pleased with him, said: I said O Messenger of Allah: A cousin comes to me so I swear not to give him nor connect with him. He said: \"Expiate for your oath\" (1).\n7 - Whoever swears while angry, the oath is binding on him and he owes expiation:\nFrom Abu Musa Al-Ash'ari, may Allah be pleased with him, said: I came to the Messenger of Allah, peace and blessings be upon him, with a group of Ash'aris and I met him while he was angry. We asked him for mounts, so he swore not to mount us, then said... By Allah, if Allah wills, I do not swear an oath then see something else better than it except that I do what is better and expiate it\" (2).\nQadi Iyad said: \"In the Hadith is evidence for the binding nature of the oath of anger\" (3).\n8 - Whoever swears and makes an exception in his oath, he has the choice, if he wishes he proceeds and if he wishes he leaves without Hinth (breaking oath) nor expiation upon him:\nDue to the Hadith of Ibn Umar, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever swears and makes an exception, he has the choice, if he wishes he proceeds, and if he wishes he leaves without Hinth\" (4). And in a narration \"Whoever swears and says: Insha'Allah (If Allah wills), does not break his oath\" (5).\nAnd due to the Hadith of Abu Huraira, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: \"Whoever swears and says Insha'Allah has made an exception\" (6).\nQadi Iyad said: \"Muslims agreed that saying Insha'Allah prevents the contracting of the oath on the condition that it is connected\" (7).\n9 - Whoever swears forgetfully, there is no expiation upon him:\nDue to His saying Almighty: {And there is no blame upon you for that in which you have erred...} (8).",
    "foot_note": "1. Sunan Ibn Majah (1/ 6810) and Al-Albani authenticated it in Sahih Al-Jami' No. (7522). \n2. Al-Bukhari with Al-Fath (11/ 688) No. (6680). \n3. Kamal Al-Mu'lim Sharh Sahih Muslim (2/ 210). \n4. Sahih Ibn Hibban (10/ 184) and Al-Arna'ut said its chain is strong. \n5. Narrated by Al-Tirmidhi (3/ 160) and Al-Albani authenticated it in Irwa Al-Ghalil No. (2570). \n6. Previous Reference. \n7. Sahih Muslim with Al-Nawawi's explanation (11/ 107). \n8. Al-Ahzab, Verse (5).",
    "book_id": "85"
  },
  {
    "serial_number": "4644365",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "And due to His saying Glory be to Him: {Do not blame me for what I forgot...} (1).\nAnd due to his saying, peace and blessings be upon him: \"Indeed, Allah has overlooked for my Ummah what their souls whispered - or spoke - to them as long as they do not act upon it or speak\" (2).\n10 - Whoever swears under coercion, there is no sin upon him and no expiation is required:\nDue to His saying Almighty: {Except for one who is forced while his heart is secure in faith...} (3).\nFrom Ibn Abbas, may Allah be pleased with them both, said: The Messenger of Allah, peace and blessings be upon him, said: \"Indeed, Allah has overlooked for my Ummah mistake, forgetfulness, and what they are coerced into\" (4).\n11 - Whoever swears, let him not say 'What Allah wills and you will' but let him say 'What Allah wills then you will':\nFrom Ibn Abbas, may Allah be pleased with them both, said: The Messenger of Allah, peace and blessings be upon him, said: \"If one of you swears, let him not say 'What Allah wills and you will', but let him say 'What Allah wills then you will'\" (5).\nAnd from Hudhayfah bin Al-Yaman, may Allah be pleased with him, that a man from the Muslims saw in a dream that he met a man from the People of the Book. He said: What a good people you are, were it not that you commit Shirk and say: What Allah wills and Muhammad wills. He mentioned that to the Prophet, peace and blessings be upon him, so he, peace and blessings be upon him, said: \"By Allah, I knew it in you, say 'What Allah wills then Muhammad wills'\" (6).",
    "foot_note": "1. Al-Kahf Verse (73). \n2. Al-Bukhari with Al-Fath (11/ 668) No. (6664). \n3. Al-Nahl Verse (106). \n4. Sahih Ibn Hibban (16/ 202) and Al-Albani authenticated it in Irwa Al-Ghalil No. (82). \n5. Sunan Ibn Majah (1/ 684) and Al-Albani authenticated it in Sahih Sunan Ibn Majah (2/ 200) No. (1733). \n6. Sunan Ibn Majah (1/ 685) and Al-Albani authenticated it in Sahih Sunan Ibn Majah (2/ 200) No. (1734).",
    "book_id": "85"
  },
  {
    "serial_number": "4644366",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "Requirement Three: General rulings\nSwearing by Haram - Swearing by Divorce - Swearing the Zubayri Oath\n\nFirst: Swearing by Haram:\n(a) Its formula\nImam Ibn al-Qayyim _ may Allah Almighty have mercy on him _ said:\n- Swearing by Haram has two formulas:\n- One of them: If I do such and such, you are Haram to me, or what Allah made lawful is Haram to me.\nSecond: The Haram is binding on me not to do such and such\" (1).\n(b) Sayings of the Jurists and their evidences regarding it:\nThis issue was disputed by the Salaf from the Companions and Followers and the Khalaf from the Mujtahid Imams until the Scholar Al-Qurtubi the commentator counted eighteen opinions (2). Al-Hafiz said others added to them (3). Imam Ibn al-Qayyim spoke about this issue at length, reaching fifteen principal opinions branching into twenty schools (4). The closest of them are the following:\n- The First Opinion: That it is vain (Laghw) and void, entailing nothing.\nIbn al-Qayyim said: It is one of the two narrations from Ibn Abbas, may Allah be pleased with them both. Al-Sha'bi, Masruq, Rabi'ah, Abu Salamah bin Abdul Rahman, Ata, Dawud, and all the Literalists (Ahl al-Zahir), and most of the People of Hadith said it. It is one of the two opinions of the Malikis, chosen by Asbagh bin Al-Faraj (5).\n- Their Evidences:\nThey used as evidence His saying Almighty: (And do not say about what your tongues assert of untruth, \"This is lawful and this is unlawful...\") [Surah: Al-Nahl - Verse: 116]. They said: So what Allah has not made unlawful, no one has the right to make unlawful, nor does it become unlawful by his prohibition (6). And Allah said to His Prophet (7). \"(... Why do you forbid what Allah has made lawful for you...)\" [Surah At-Tahrim - Verse: 1].",
    "foot_note": "1. I'lam Al-Muwaqqi'in by Ibn al-Qayyim in (- 2/ - 77). \n2. Al-Jami' li Ahkam Al-Quran (18/- 142). \n3. Fath Al-Bari (- 9/- 461). \n4. Zad Al-Ma'ad (- 5/- 300) and following, I'lam Al-Mu'minin, (- 2/- 77), and following. \n5. I'lam Al-Muwaqqi'in, (2/ - 78). \n6. Al-Jami' li Ahkam Al-Quran, (- 18/- 140). \n7. Subul Al-Salam, (3/ 1091).",
    "book_id": "85"
  },
  {
    "serial_number": "4644367",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "And Allah addressed the believers saying: (O you who have believed, do not prohibit the good things which Allah has made lawful to you) [Surah: Al-Ma'idah - Verse: 87]. They also cited what is mentioned in Sahih Al-Bukhari (1) from Sa'id bin Jubayr that he heard Ibn Abbas, may Allah be pleased with them both, say: \"If a man declares his wife forbidden [to himself], it is nothing. And he recited: (There has certainly been for you in the Messenger of Allah an excellent pattern...) [Surah Al-Ahzab - Verse: 21].\" It is authentically reported from Masruq that he said: \"I do not care whether I declared my wife forbidden or a bowl of Tharid (a dish).\" And it is authentically reported from Al-Sha'bi regarding forbidding the wife: \"It is easier to me than my sandals.\" Abu Salamah said: \"I do not care whether I declared my wife forbidden or the water of the river forbidden\" (2). - This view was preferred and supported by the scholar of Yemen, Allamah Ibn al-Amir al-San'ani. He said in Subul al-Salam: \"This view is the closest of the mentioned views and the most preponderant to me...\" (3). It was also preferred by Allamah Al-Shawkani in Nayl al-Awtar, who said: \"And this school of thought is the preponderant one to me if he intended the prohibition of the entity itself\" (4). The Second View: That it is an oath which requires the expiation of an oath in any case. Ibn al-Qayyim said: (5) \"This is authentically reported from Abu Bakr Al-Siddiq, Umar bin Al-Khattab, Ibn Abbas, and Aisha... and Zaid bin Thabit, Ibn Masoud, Abdullah bin Umar, Ikrimah, Ata, Makhul, Qatadah, Al-Hasan, Al-Sha'bi, Sa'id bin Al-Musayyib, Sulaiman bin Yasar, Jabir bin Zaid, Sa'id bin Jubayr, Nafi', Al-Awza'i, Abu Thawr, and a multitude of others.\" The argument for this view: The apparent meaning of the Quran, for Allah Almighty mentioned the obligation of dissolving oaths following the prohibition of the lawful, so it must certainly cover it (6). This is in His saying, Glory be to Him: (Allah has already ordained for you [Muslims] the dissolution of your oaths...) [At-Tahrim: 2]. They also cited what is in Sahih Muslim from the Hadith of Ibn Abbas, may Allah be pleased with them both, who said: \"If a man forbids his wife [to himself], it is an oath which he must expiate\" (7). This view was preferred by Sheikh Al-Islam Ibn Taymiyyah, and likewise by his student Ibn al-Qayyim in I'lam al-Muwaqqi'in and others (8).",
    "foot_note": "1. Al-Bukhari with Al-Fath, (9/464).\n2. I'lam al-Muwaqqi'in, (2/78).\n3. Subul al-Salam (3/1091).\n4. Nayl al-Awtar, (6/316).\n5. I'lam al-Muwaqqi'in (2/81-84).\n6. Previous reference.\n7. Majmoo' al-Fatawa al-Kubra, (3/226-227).\n8. Majmoo' al-Fatawa al-Kubra (3/226), (227), (17/45).",
    "book_id": "85"
  },
  {
    "serial_number": "4644368",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "The Third View: That it is Zihar (a specific form of divorce by equating the wife to a prohibited relative), and it requires the expiation of Zihar. Ibn al-Qayyim said (1): \"This is authentically reported from Ibn Abbas as well, and Abu Qilabah, Sa'id bin Jubayr, Wahb bin Munabbih, and Uthman Al-Taymi, and it is one of the narrations from Imam Ahmad.\" The argument for this view is: \"That Allah Almighty made likening the wife to his mother, who is forbidden to him, Zihar, and He called it a blameworthy utterance and falsehood. If likening her to a prohibited woman makes him a Muzahir (one who commits Zihar), then explicitly declaring her forbidden is more deserving of being Zihar. This is the most analogically sound and jurisprudentially deep of the views\" (2). This was preferred among contemporaries by Allamah Muhammad Al-Amin Al-Shanqiti in Adwa' al-Bayan (3). The Fourth View: That it depends on his intention. If he intended divorce, it is divorce; if he intended Zihar, it is Zihar; if he intended an oath, it is an oath and requires the expiation of an oath; and if he did not intend anything, he owes the expiation of an oath (4). Ibn Hajar said: \"And this was said by Al-Nakha'i, Al-Shafi'i, and Ishaq, and similar was narrated from Ibn Masoud, Ibn Umar, and Tawus (5). It is the view of Al-Zuhri, and a narration from Al-Hasan, as in Al-Fath regarding the prohibited thing: 'If he intends an oath, it is an oath; and if divorce, it is divorce'\" (6). Ibn al-Qayyim said: \"The argument for this view is that the wording is suitable for all of that, so one is not distinguished from the other except by intention. Also, it is a metonym (Kinayah) for divorce; if he intended it, it is divorce, and if he did not intend it, it is an oath, due to His saying: (O Prophet, why do you prohibit what Allah has made lawful for you, seeking the approval of your wives? And Allah is Forgiving and Merciful) to His saying: (...the dissolution of your oaths. And Allah is your protector, and He is the Knowing, the Wise) [At-Tahrim: 1, 2]\" (7). This view is what our virtuous Sheikh, the Judge and Allamah Muhammad bin Ismail Al-Amrani, may Allah preserve him, issues fatwas based on. Scholars have many schools of thought on this issue as I mentioned previously; some considered it a revocable divorce, some considered it an irrevocable divorce, some said she is forbidden to him by virtue of his prohibition, some suspended judgment on it, and some said other than that. I have limited it to the four previous schools due to the strength of the evidence used by their proponents and because this book is built on brevity. The reason for the scholars' disagreement on this issue:",
    "foot_note": "1. I'lam al-Muwaqqi'in, (2/81).\n2. Adwa' al-Bayan (6/539).\n3. Al-Siraj Al-Wahhaj, (307).\n4. Fath al-Bari, (9/461).\n5. Fath al-Bari, (9/461).\n6. I'lam al-Muwaqqi'in (2/81).\n7. Nayl al-Awtar (6/314).",
    "book_id": "85"
  },
  {
    "serial_number": "4644369",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "Allamah Al-Qurtubi said: \"Our scholars said - the reason for the disagreement in this chapter is that there is no explicit text or authentic apparent meaning in the Book of Allah or the Sunnah of the Messenger of Allah (peace be upon him) to rely upon in this issue, so the scholars contended over it. Those who held to the original freedom from liability said: There is no ruling; nothing is required by it. Those who said it is an oath said: Allah named it an oath. Those who said: An expiation is obligatory for it but it is not an oath, based it on two things: First, they thought Allah Almighty obligated expiation for it even if it wasn't an oath. Second, that the meaning of an oath to them is prohibition, so the expiation applied to the meaning. Those who said it is one revocable divorce interpreted the wording in its minimal sense... And likewise, the perspective of those who said it is three [divorces] interpreted it in its maximal sense, which is triple divorce... Those who said it is Zihar [did so] because it is the lowest degree of prohibition... And those who said it is an irrevocable divorce relied on the fact that revocable divorce does not prohibit the divorcee while irrevocable divorce does prohibit her...\" (1). What I lean towards from the previous opinions is the fourth view, because it brings together all the other sayings and schools of thought, and because the word 'prohibition' (Tahrim) is a metonym that may mean divorce, Zihar, or an oath. Therefore, one does not turn to any of them except by intention, so acting upon the intention is necessary. This is the view our scholars issue fatwas with.",
    "foot_note": "1. Al-Jami' li-Ahkam al-Quran, (18/142).",
    "book_id": "85"
  },
  {
    "serial_number": "4644370",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "Second: Swearing by Divorce: It is called suspended divorce (At-Talaq Al-Mu'allaq). - It is called an oath: metaphorically by the majority of scholars because: - The condition contains the meaning of an oath, in terms of it being a clause that is not independent without the answer, so it resembled saying 'By Allah', 'By Allah', and 'By Allah'. - It was said: Because it has the ruling of an oath in terms of what it implies of urging, preventing, confirming, or denying. This issue is something many Muslims have been afflicted with, and the calamity has become widespread. \"We are in a time where men have become accustomed to babbling words of divorce; making the marital bonds of their women like toys in their hands, disposing of them however they wish, respecting neither the sanctity of Sharia nor the rights of companionship...\" (1). The matter of swearing by divorce is serious; indeed, it has been narrated in some traditions that it is from the oaths of the corrupt (Fusuq) (2). It is something regarding which giving fatwas arose after the end of the era of the Companions. It is an innovation introduced into the Ummah by Al-Hajjaj bin Yusuf Al-Thaqafi in what is called the Oaths of Allegiance (Ayman al-Bay'ah), which include swearing by Allah Almighty, divorce, manumission, and charity of wealth (3). - Its Formula: Imam Ibn al-Qayyim, may Allah have mercy on him, said: Swearing by divorce has two formulas: - One of them: 'If you do such and such, you are divorced' - This is called the formula of suspension, i.e., suspending divorce on a condition. - The second: 'Divorce is binding upon me, I will not do such and such' (4) - This is called the formula of an oath.",
    "foot_note": "1. The Complete Works of Sheikh Muhammad Abduh (2/134) via the Internet.\n2. Islamic Network, Encyclopedia of Fatwas.\n3. Majma' Fatawa Ibn Taymiyyah (35/243).\n4. I'lam al-Muwaqqi'in (2/3) (77).",
    "book_id": "85"
  },
  {
    "serial_number": "4644371",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "Its Ruling: The majority of jurists agreed on the validity of the oath by divorce or suspending divorce on a condition in general (1). \"Divorce was legislated by Allah Almighty for severe need, when harmony between spouses becomes impossible. Allah did not legislate it for people to misuse, nor for the rabble to make it an oath they swear by in buying, selling, and disputes. It has come in the Sahih that he, peace be upon him, said: 'Whoever swears, let him swear by Allah alone.' Thus, swearing by divorce is disliked - and it is said swearing by it is forbidden and he who swears by it should be disciplined - and according to our scholars (the Malikis), it is from the oaths of the corrupt which impugns one's integrity...\" (2). - Scholars' Disagreement regarding it: Scholars from the Salaf (predecessors) and Khalaf (successors) differed on the ruling of swearing by divorce into three views, which can be elaborated along with their evidence as follows: - The First View: That whoever swears by divorce, divorce is not binding upon him - nor is expiation obligatory if he breaks it, because it is nonsense (Laghw) and void, resulting in nothing; for divorce is only as Allah Almighty commanded. This was the view of the Commander of the Faithful Ali, may Allah be pleased with him, Shuraih, Ikrimah, and Tawus. It is the school of Dawood, Ibn Hazm, and all the Zahiris (3) and others from the later scholars. Ibn Hazm said: \"The oath by divorce is not binding whether fulfilled or broken; no divorce occurs by it, and there is no divorce except as Allah Almighty commanded...\" (4). They reasoned that: The Commander of the Faithful Ali, may Allah be pleased with him, gave a fatwa to one who swore by divorce that he owes nothing, and no opponent from the Companions is known (5). - And it is authentic from Shuraih, the judge of the Commander of the Faithful Ali, and Ibn Masoud that divorce is not binding by it (6). - And it is authentic from Ikrimah regarding a man who said to his slave, 'If I do not whip you a hundred lashes, my wife is divorced', he said: 'He does not whip his slave and his wife is not divorced; this is from the footsteps of Satan' (7). - And it is authentic from Tawus from the narration of Abdul Razzaq from Ma'mar from Ibn Tawus from him: \"Swearing by divorce is nothing\" (8).",
    "foot_note": "1. The Fiqh Encyclopedia (29/37).\n2. Al-Mudawwanah in Maliki Fiqh (666) and following.\n3. Al-Muhalla by Ibn Hazm (10/268) and following.\n4. Previous reference (10/211).\n5. I'lam al-Muwaqqi'in (2, 3/71) and following, Ighathat al-Lahfan (2/400) and following.\n6. The two previous references.\n7. The two previous references, Majmoo' al-Fatawa (17/75) and following.\n8. The two previous references.",
    "book_id": "85"
  },
  {
    "serial_number": "4644372",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "- They also used as evidence the saying of the Almighty: (Allah will not impose blame upon you for what is meaningless in your oaths, but He will impose blame upon you for [breaking] what you intended of oaths. So its expiation is the feeding of ten needy people from the average of that which you feed your [own] families or clothing them or the freeing of a slave. But whoever cannot find [or afford it] - then a fast of three days [is required]. That is the expiation for oaths when you have sworn. But guard your oaths. Thus does Allah make clear to you His verses that you may be grateful.) [Al-Ma'idah: 89]. Ibn Hazm argued with this to show that \"there is no divorce except as Allah Almighty commanded, and no oath except as Allah Almighty commanded upon the tongue of His Messenger (peace be upon him).\" And the oath by divorce is not among them (1). He also used as evidence his saying (peace be upon him): \"Whoever swears, let him swear by Allah alone,\" saying \"Thus the confusion is lifted that every oath by other than Allah Almighty is a sin and not a [valid] oath\" (2). - Imam Al-Shawkani, may Allah have mercy on him, said: \"As for the sayer saying 'Divorce is upon him' or 'Divorce is binding upon him', and the like, this is nothing of that sort. Allah Almighty did not make it a divorce, nor did He bind any of His servants with it. It is not valid for a servant to impose upon himself other than what Allah imposed upon him, nor to bind it with other than what Allah bound it with... In summary, there is nothing in the Sharia indicating the occurrence of this divorce, neither in wording nor in intent, so ponder this\" (3). The Second View: That swearing by divorce does not cause divorce to occur, and its owner is obliged to pay the expiation of an oath unless he intended it [divorce], in which case it occurs. - This opinion was transmitted from Tawus bin Kaysan Al-Yamani, and a group of the Salaf and Khalaf said it, and some companions of Malik and Al-Shafi'i gave fatwas with it in some forms (4). It is the school of thought of Sheikh Al-Islam Ibn Taymiyyah and his student Ibn al-Qayyim who supported it and provided evidence for it in his books. The argument of the proponents of this view: - Analogy (Qiyas): They analogized divorce to manumission. Ibn Umar, Ibn Abbas, Abu Hurairah, Aisha, Hafsa, Umm Salamah, Zainab the stepdaughter of the Prophet (peace be upon him), and more than one of the Companions gave fatwas concerning one who said 'If I do such and such, every slave I own is free,' saying he expiates for his oath and manumission is not binding upon him. This is despite manumission being an act of obedience and closeness to God, so divorce is not binding upon him by greater reason (5).",
    "foot_note": "1. Al-Muhalla (10/211).\n2. Previous reference.\n3. Al-Sayl al-Jarrar (412).\n4. Al-Fatawa al-Kubra (3/243).\n5. Ahkam al-Usra by Al-Qulaisi (2/66-67).",
    "book_id": "85"
  },
  {
    "serial_number": "4644373",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "- They also cited what is authentically reported from Ibn Abbas - may Allah be pleased with them both - as in Al-Bukhari: \"Divorce is out of need, and manumission is what is sought for the sake of Allah.\" The point of evidence: Ibn Abbas - may Allah be pleased with them both - clarified that divorce only occurs for one whose purpose is to effect it, not for one who dislikes its occurrence (1). They also cited what was reported from the Mother of the Believers Aisha - may Allah be pleased with her - that she said: \"Every oath, even if severe, its expiation is the expiation of an oath by Allah.\" This covers all oaths including swearing by divorce, manumission, vows, and the like (2). - They built upon this deduction \"that Allah has made an expiation for this oath where He, Glory be to Him, said: (Allah has already ordained for you the dissolution of your oaths. And Allah is your protector, and He is the Knowing, the Wise) [Surah: At-Tahrim - Verse: 2], and He said: (Allah will not impose blame upon you for what is meaningless in your oaths, but He will impose blame upon you for [breaking] what you intended of oaths. So its expiation is the feeding of ten needy people from the average of that which you feed your [own] families or clothing them or the freeing of a slave. But whoever cannot find [or afford it] - then a fast of three days. That is the expiation for oaths when you have sworn. But guard your oaths. Thus does Allah make clear to you His verses that you may be grateful) [Surah: Al-Ma'idah - Verse: 89].\" And it is proven from the Prophet (peace be upon him) from the Hadith of Abu Hurairah, Adi bin Hatim, and Abu Musa Al-Ash'ari, may Allah be pleased with them, that he said: \"Whoever swears an oath and then sees something else better than it, let him do that which is better and let him make expiation for his oath\" (3). - As for Sheikh Al-Islam Ibn Taymiyyah, he detailed this issue and distinguished between the two formulas of swearing by divorce: The First Formula: The formula of suspension, i.e., suspending divorce on a condition, such as a man saying to his wife: 'If you leave the house without my permission, you are divorced.' The ruling for this formula according to him is \"that the intention of the swearer is considered. If his intention was urging, preventing, confirming, or denying, then this is considered an oath. And if his intention was the occurrence of divorce upon her if she opposed and did what he forbade her from, then it effects a divorce if the condition is met\" (4).",
    "foot_note": "1. Al-Bukhari with Al-Fath (9/486).\n2. Al-Fatawa al-Kubra (3/235) and following.\n3. Majmoo' al-Fatawa (17/36).\n4. Al-Fatawa al-Kubra (10/234) and following - Al-Mufassal (2/402) and following.",
    "book_id": "85"
  },
  {
    "serial_number": "4644374",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "As for the Second Formula: It is the formula of an oath, such as a man saying - 'Divorce is binding upon me, I will surely do such and such' or saying 'By divorce, I will surely do such and such.' This formula is considered an oath by the agreement of linguists and the agreement of groups of jurists, but they differed in its ruling (1). Sheikh Al-Islam said: \"And the most apparent of the opinions, and the opinion that agrees with the established sayings from the Companions, and is indicated by the Book, the Sunnah, and consideration, is that the expiation of an oath suffices him as in all oaths of Muslims, which is the expiation upon breaking the oath... then he said... and this is the saying of a group of the Salaf and Khalaf like Tawus and others... and many Malikis and others issue fatwas with it... and it is the implication of the texts of Ahmad bin Hanbal and his principles in more than one place...\" (2). The Third View: That swearing by divorce causes divorce to occur regardless of whether he intended it or not, and whether it was suspended on a condition like 'If you enter the house you are divorced' or without suspension like 'Divorce is upon me, I will surely do such and such.' - This is the school of the majority of scholars. Sheikh Al-Islam Ibn Taymiyyah said: It is the famous view of most jurists and later scholars (3). They reasoned that: \"Divorce is a type of forfeiture, and what is a type of forfeiture accepts suspension on a condition, like manumission, so suspending divorce is permissible. - Also, divorce is a legal disposition whether immediate or suspended, so it must be fulfilled because it falls under the scope of the noble verse: 'O you who have believed, fulfill [your] obligations...'. - Also, he committed to a matter upon the existence of a condition, so what he committed to is binding upon him because the conditional is like the immediate upon the existence of the condition, so it falls under the scope of the noble Prophetic Hadith which says 'Muslims are bound by their conditions except a condition that makes the lawful unlawful or the unlawful lawful' (4) and suspending divorce on a condition is not making the unlawful lawful or the lawful unlawful (5). - It is said in Al-Durr Al-Mukhtar: \"And among the used phrases are 'Divorce is binding upon me', 'The unlawful is binding upon me', 'Upon me is divorce', and 'Upon me is the unlawful'; so it occurs without intention due to custom\" (6).",
    "foot_note": "1. Majmoo' al-Fatawa (33/140).\n2. Al-Fatawa al-Kubra (3/223), and following.\n3. Al-Fatawa al-Kubra (3/241), Bada'i' al-Sana'i' (3/41), Rawdat al-Talibin (8/14) and following, Al-Mudawwanah (2/379).\n4. The Hadith is in Al-Bukhari suspended (2/794) and Al-Albani authenticated it in Al-Sahihah under number (2915) without mentioning \"except a condition that makes the lawful unlawful or the unlawful lawful\".\n5. Al-Mufassal fi Ahkam al-Mar'ah (7/471), and following, Al-Majmoo' (18/296).\n6. Al-Durr al-Mukhtar (4/343).",
    "book_id": "85"
  },
  {
    "serial_number": "4644375",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "- It is said in Al-Mudawwanah: \"The view that suspended divorce occurs has been transmitted with authentic chains from a group of Companions, from the general jurists of the Tabi'in, from the seven famous jurists of Medina, and from the majority of jurists after them, including the four Imams. Only a small group of scholars disagreed with it, having no reliable basis for their disagreement except a fatwa by Ali bin Abi Talib, may Allah be pleased with him, despite the probability in its indication regarding non-occurrence\" (1). What I consider preponderant: After this presentation of the scholars' views and their evidence, is the school of the majority of scholars. - So whoever suspends divorce on a condition, divorce occurs upon the realization of the condition for the following reasons: - 1 - Because the conditional is like the immediate upon the existence of the condition (2). 2 - Because the principle regarding sexual relations is prohibition, so one should take the more cautious path in matters of divorce, and be pious regarding them, so that those who are lenient do not dare violate the limits of Allah and play with them. The Almighty said: (And do not take the verses of Allah in jest) [Surah: Al-Baqarah - Verse: 231]. - In Sunan Al-Nasa'i from the Hadith of Mahmud bin Labid, he said: \"The Messenger of Allah, peace be upon him, was informed about a man who divorced his wife three times all at once. He stood up angry and said: Is the Book of Allah being played with while I am among you? Until a man stood up and said: O Messenger of Allah, shall I kill him?\" (3). If the Prophet, peace be upon him, considered the one who divorces his wife three times at once to be playing with the Book of Allah, then how about the one who makes divorce his habit in all his affairs? - Imam Ibn Abidin said in his Hashiyah quoting Al-Saruji: \"I say the truth is [divorce] occurs by it in this time due to its fame in the meaning of divorce, so it must be referred to and relied upon, acting on precaution in the matter of private parts\" (4). 3 - Deterring the one swearing by divorce: The Commander of the Faithful Umar, may Allah be pleased with him, when he saw people's haste in the matter of divorce, enforced it upon them as three. In Sahih Muslim from the Hadith of Ibn Abbas, may Allah be pleased with them both, he said: \"Divorce during the time of the Messenger of Allah, peace be upon him, Abu Bakr, and two years of the caliphate of Umar was [counted as] one for the three [pronouncements]. Then Umar bin Al-Khattab, may Allah be pleased with him, said: People have hastened in a matter in which they had respite; so if we were to enforce it upon them! So he enforced it upon them\" (5).",
    "foot_note": "1. Al-Mudawwanah (2/687) and following.\n2. Al-Binayah Sharh al-Hidayah (5/410).\n3. Sunan al-Nasa'i (3401) and Al-Albani authenticated it in Ghayat al-Maram (261).\n4. Hashiyat Ibn Abidin (4/344).\n5. Sahih Muslim with Al-Nawawi's explanation (5/2/60).",
    "book_id": "85"
  },
  {
    "serial_number": "4644376",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "\"So the Muslim must fear Allah Almighty regarding himself and not swear by divorce nor by anything else which the Lawgiver forbade swearing by, because swearing by divorce exposes the marital bond to destruction. Indeed, some scholars mentioned that the one who does it cannot be secure about his wife remaining with him, for she might be in [a state of] adultery due to his frequent swearing. This is what Ibn Mayaba versified saying: - And frequent swearing by divorce ... * ... Is immorality and a defect necessitating separation. Whatever is like that must be warned against and avoided\" (1). \"Finally, I advise you, my brother, not to make divorce a chewed item in your mouth. If you want to emphasize and urge yourself or your wife to do something or prevent it, then swear an oath by Allah Almighty, for divorce was not legislated in the law of Islam to emphasize news or to urge or prevent\" (2).",
    "foot_note": "1. Islamic Network - Encyclopedia of Fatwas.\n2. Fatawa Mustafa al-Zarqa, (310).",
    "book_id": "85"
  },
  {
    "serial_number": "4644377",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "Third: Swearing the Zubayri Oath: The Zubayri oath is an oath that some still use to make people swear. It is believed that whoever swears it falsely is swiftly punished. I will write about it as follows: - A) Its formula: - That the swearer be told to say: \"I have disavowed the power and strength of Allah and sought refuge in my own power and strength, and assumed power and strength without Allah, out of arrogance against Allah, dispensing with Him and exalting myself over Him, if I said such and such or did such and such...\" B) The first to make someone swear by it: - It was Imam Yahya bin Abdullah bin Al-Hasan bin Al-Hasan bin Ali bin Abi Talib, may Allah be pleased with him. Abdullah bin Mus'ab Al-Zubayri swore by it when he slandered him to Al-Rashid, claiming he wanted the Caliphate instead of him. C) The reason for making someone swear by it: There is a story for making someone swear this oath mentioned by historians like Ibn Jarir Al-Tabari, Ibn Kathir, and others. Its summary is: - That Yahya bin Abdullah bin Al-Hasan bin Al-Hasan bin Ali bin Abi Talib, may Allah be pleased with him, appeared in the land of Daylam during the time of Harun Al-Rashid. His power intensified, his command grew strong, and people traveled to him from the regions. Al-Rashid was greatly distressed and anxious about his affair. He assigned Al-Fadl bin Yahya bin Khalid bin Barmak with fifty thousand men and senior commanders to go to him. Al-Fadl marched to that region and wrote to Yahya bin Abdullah promising him, raising his hopes, and assuring him that if he came out to him, he would provide an excuse for him to Al-Rashid. Yahya refused to come out to them until Al-Rashid wrote a letter of safety (Aman) for him by his own hand on a copy sent to him. Al-Fadl wrote this to Al-Rashid, and Al-Rashid rejoiced and it had a great impact on him. He wrote the safety by his hand and had judges, jurists, and the elders of Banu Hashim witness it. He sent it with prizes and gifts. Al-Fadl sent that to him, so Yahya bin Abdullah arrived, and Al-Fadl arrived with him in Baghdad. Al-Rashid met him with everything he liked, ordered much wealth for him, gave him generous gifts, and the Barmakids served him greatly. Then Al-Rashid turned against Yahya bin Abdullah and changed towards him. It is said he imprisoned him then summoned him while groups of Hashimites were present. He brought the safety he had sent to him. Al-Rashid asked Muhammad bin Al-Hasan the jurist, the companion of Abu Yusuf: Is this safety valid? He said yes. Al-Rashid became angry with him. Then he asked Abu Al-Bakhtari, who said: This is void from such and such perspective and this is nothing, so judge regarding it as you wish, and Abu Al-Bakhtari tore the safety and spat on it. Al-Rashid said: You are the Judge of Judges and you know best about that. Slanderers had spread gossip between Al-Rashid and Yahya bin Abdullah. Whenever Al-Rashid softened towards him, they stirred up malice in his soul against him. They mentioned that Yahya said to Al-Rashid: O Commander of the Faithful, we have kinship",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644378",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "and mercy... We and you are people of one house, so I remind you of Allah regarding our kinship to the Messenger of Allah, peace be upon him, why do you imprison me and torture me? Harun softened towards him. Abdullah bin Mus'ab Al-Zubayri, who was the governor of Medina during the days of Al-Rashid, said to him: O Commander of the Faithful, do not let the speech of this one deceive you, for he is a rebellious dissenter. This is only deception and malice from him. He has corrupted our city against us and manifested disobedience in it. Yahya replied to him, and among what he said was: O Commander of the Faithful, this one came to me when my brother Muhammad bin Abdullah bin Al-Hasan was killed and said: May Allah curse his killer, and recited to me about twenty verses of poetry. And he said to me: If you move in this matter, I will be the first to pledge allegiance to you. What prevents you from joining Basra when our hands are with you? Al-Zubayri's face changed and he denied it and began swearing solemn oaths that he was lying about that. Al-Rashid was confused, then said to Yahya: Do you memorize anything of the elegy? He said: Yes, and recited part of it to him: - Rise with your command, we will rise with our obedience ** The Caliphate is among you, O sons of Hasan. Al-Zubayri increased in denial and said: By Allah, O Commander of the Faithful, besides Whom there is no god... until he reached the end of the Ghamus (false) oath, nothing of what he said happened. Al-Rashid turned to Yahya and said: He has sworn. Do you have evidence who heard this elegy from him? He said: No, O Commander of the Faithful, but make him swear by what I want. He said: Make him swear. He turned to Al-Zubayri and said: Say: If I am lying, I disavow the power and strength of Allah and seek refuge in my own power and strength, and assume power and strength without Allah, out of arrogance against Allah, dispensing with Him and exalting myself over Him, if I said it. Al-Zubayri refused to swear by that. Al-Rashid insisted and got angry at him, so he swore by it. No sooner had he left Al-Rashid's presence than Allah struck him with hemiplegia (paralysis) and he died instantly. Then Al-Rashid released Yahya bin Abdullah and gave him one hundred thousand dinars. It is said he only imprisoned him for part of a day, and it is said three days. He lived after all that for one month then died, may Allah Almighty have mercy on him (1).",
    "foot_note": "1. Tarikh al-Tabari (8/242) and following, Al-Bidaya wa'l-Nihaya by Ibn Kathir (10/178-180), Asr al-Ma'mun by Dr. Ahmed Farid (1/122) and following.",
    "book_id": "85"
  },
  {
    "serial_number": "4644379",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "D) Ruling on Swearing by it: Making someone swear the Zubayri oath is forbidden (Haram), for swearing is only by a name of Allah Almighty or an attribute of His attributes, due to his saying, peace be upon him, as in Al-Bukhari: \"Whoever swears, let him swear by Allah or let him remain silent.\" In a narration by Abu Dawood and Al-Tirmidhi with the wording \"or let him hold his tongue\", and by Muslim \"Whoever swears, let him not swear except by Allah.\" Swearing by other than Allah has been prohibited and declared Shirk (polytheism), due to his saying, peace be upon him, as in Sunan Abu Dawood from the hadith of Ibn Umar, may Allah be pleased with them both, said: I heard the Prophet, peace be upon him, say: \"Whoever swears by other than Allah has committed Shirk\" (1). And in Al-Tirmidhi: \"Has committed Kufr (disbelief) or Shirk\" (2). Because swearing by something implies its glorification, and greatness belongs only to Allah alone, so nothing else should be compared to Him. Therefore, making someone swear by disavowing Allah's power and strength and adhering to one's own power and strength is forbidden, rather it is Shirk. How about if added to this is that this disavowal is arrogance against Allah, dispensing with Him, and exalting oneself over Him? That leads a person to the limit of Kufr, may Allah protect us, especially if he believes it. For all power and strength belong to Allah and are by Allah; there is no power nor strength for a Muslim except by Allah. The Prophet, peace be upon him, taught his companions to say \"La Hawla wa La Quwwata illa Billah\" (There is no power nor strength except by Allah) (3). He used to advise them with it. He, peace be upon him, advised Abu Musa Al-Ash'ari, may Allah be pleased with him, saying to him: Say: \"La Hawla wa La Quwwata illa Billah, for it is a treasure from the treasures of Paradise\" (4). He, peace be upon him, likewise advised Abu Dharr - may Allah be pleased with him - where he said: I was walking behind the Prophet, peace be upon him, and he said to me, O Abu Dharr: Shall I not guide you to a treasure from the treasures of Paradise? I said yes. He said: \"Say La Hawla wa La Quwwata illa Billah\" (5). Al-Khattabi said: \"The meaning of treasure in this hadith is the reward that its sayer obtains and the recompense stored for him in it\" (6). Thus, he, peace be upon him, guided his nation to increase saying La Hawla wa La Quwwata illa Billah. He said, as in the hadith of Abu Sa'id Al-Khudri, may Allah be pleased with him: \"Increase in the Enduring Good Deeds.\" It was said: What are they, O Messenger of Allah? He said: \"Tahleel (La ilaha illa Allah), Takbeer (Allahu Akbar), Tasbeeh (Subhan Allah), Tahmeed (Alhamdulillah), and La Hawla wa La Quwwata illa Billah\" (7). Through these hadiths, it becomes clear to us that a Muslim must always disavow his own power and strength and declare constantly that he has no power nor strength except by Allah.",
    "foot_note": "1. Previously referenced.\n2. Previously referenced.\n3. Sunan al-Tirmidhi (5/580) and Al-Albani authenticated it in Sahih al-Targhib under number (1580).\n4. Sahih Al-Bukhari (16/161) under number (6384) and Muslim (4/2076) under number (2704).\n5. Sunan Ibn Majah (2/1256) and Al-Albani authenticated it in Sahih al-Jami' under number (7820).\n6. Tuhfat al-Dhakirin: Al-Shawkani (1/372).\n7. Ahmad narrated it in Al-Musnad (18/241) under number (11713) and Al-Arna'ut graded it Hasan.",
    "book_id": "85"
  },
  {
    "serial_number": "4644380",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "Section Four: Expiation of Oaths\nFirst Requirement: Definition of Expiation - Its nature - Its legitimacy - Reason for its naming - Wisdom behind it.\nSecond Requirement: What constitutes Expiation - Conditions for its obligation.\nThird Requirement: Rulings related to Expiation.\nFourth Requirement: Forms of people's negligence regarding oaths.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644381",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "First Requirement: Definition of Expiation - Its legitimacy - Reason for its naming - Wisdom behind it\nFirst: Definition of Expiation (Kaffarah):\nKaffarah is derived from 'Kufr' which means covering. It indicates that there is a sin that needs covering, and this sin is the violation of the sanctity of the One sworn by. Al-Raghib said: \"Kaffarah is what covers the sin, and from it is the expiation of an oath... and likewise the expiation of other sins... and Takfir is covering it and hiding it until it becomes as if it was not done\" (1). It is from Allah's mercy to His servants that He made expiation available for them upon breaking an oath as a form of relief, otherwise the original principle is to fulfill the oath; and this is something specific to this Ummah.\nSecond: Its Legitimacy:\nThe basis for its legitimacy and the establishment of its ruling is the Book, the Sunnah, and Consensus. As for the Book, it is the saying of Allah Almighty: {Allah will not impose blame upon you for what is meaningless in your oaths, but He will impose blame upon you for [breaking] what you intended of oaths. So its expiation is the feeding of ten needy people from the average of that which you feed your [own] families or clothing them or the freeing of a slave. But whoever cannot find [or afford it] - then a fast of three days. That is the expiation for oaths when you have sworn. But guard your oaths. Thus does Allah make clear to you His verses that you may be grateful.} (2). As for the Sunnah, it is the saying of the Prophet, peace be upon him: \"If you swear an oath and see something else better than it, then do that which is better and make expiation for your oath.\" The Muslims agreed on the legitimacy of expiation for an oath sworn by Allah Almighty (3).\nThird: Reason for its Naming:\nIt was named Kaffarah because it covers the sin, i.e., hides it (4).\nFourth: Wisdom behind it:\nSince failing to fulfill an oath causes its owner to fall into Hinth (breaking an oath), which is a sin, expiation was legislated to lift the sin (5).",
    "foot_note": "1. Mufradat Alfaz al-Quran by Al-Raghib Al-Isfahani (717), Al-Sharh Al-Mumti' (6/341).\n2. Surah: Al-Ma'idah (89).\n3. Al-Mughni (13/333).\n4. Fath al-Bari (11/723).\n5. From what Dr. Abdul Wahab Al-Daylami, may Allah preserve him, benefited me with.",
    "book_id": "85"
  },
  {
    "serial_number": "4644382",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "Second Requirement: What constitutes Expiation - Conditions for its obligation\nFirst: What constitutes Expiation:\nScholars agreed that expiation in oaths consists of the four types mentioned by Allah in His Book: {So its expiation is the feeding of ten needy people from the average of that which you feed your [own] families or clothing them or the freeing of a slave. But whoever cannot find [or afford it] - then a fast of three days. That is the expiation for oaths when you have sworn} (1). The swearer has a choice between the three: feeding, clothing, or manumission. He is not permitted to fast unless he is unable to do these three, due to His saying: {But whoever cannot find [or afford it] - then a fast of three days} (2). Ibn Qudamah said: \"People of knowledge agreed that the one who breaks his oath has the choice: if he wishes he feeds, if he wishes he clothes, and if he wishes he frees a slave; whichever he does suffices him, because Allah Almighty coordinated some of these traits with others using the particle 'aw' (or), which is for choice...\" (3). The details are:\n(1) Feeding: No textual evidence specified the amount or type of food. All of that refers to custom for its estimation. So the food is estimated by what a person feeds his family - mostly - not from the highest quality used for seasons and occasions, nor from the lowest fed occasionally (4). Ibn Abbas, may Allah be pleased with them both, said: \"A man used to feed his family a provision with abundance, and a man used to feed his family a provision with hardship, so it was revealed: {from the average of that which you feed your families...} (5)\".\n(2) Clothing: It is apparel, and whatever is called clothing suffices, the least of which is what the needy usually wear. So a comprehensive shirt with trousers suffices, and a cloak or an Izar (lower garment) and Rida (upper garment) suffices... etc\" (6).",
    "foot_note": "1. Bidayat al-Mujtahid wa Nihayat al-Muqtasid by Ibn Rushd (2/405).\n2. Bidayat al-Mujtahid wa Nihayat al-Muqtasid by Ibn Rushd (2/405).\n3. Al-Mughni (13/333-334).\n4. Fiqh al-Sunnah (3/98).\n5. Sunan Ibn Majah (1/682) and Al-Albani authenticated it in Sahih Sunan Al-Tirmidhi under number (1730).\n6. Fiqh al-Sunnah (3/99-100).",
    "book_id": "85"
  },
  {
    "serial_number": "4644383",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "(3) Manumission: It is freeing slaves and liberating them from bondage, even if the slave is a disbeliever, acting upon the generality of the verse according to Abu Hanifa, Abu Thawr, and Ibn al-Mundhir. The majority stipulated faith [for the slave], carrying the absolute here upon the restricted in the expiation of accidental killing, as the verse says: {then the freeing of a believing slave} (1). The view of the majority in carrying the absolute in the expiation of an oath upon the restricted in the expiation of accidental killing is the preferred one; therefore, faith is a condition for the slave in manumission.\n(4) Fasting when unable [to do the above]: Continuity is recommended in it - Ubayy bin Ka'b and Ibn Masoud recited \"then a fast of three consecutive days\" (2).\nSecond: Conditions for the obligation of Expiation:\nThree conditions are required for the obligation of expiation:\nFirst: That the oath is concluded (valid): Which is that the owner intended to contract it regarding a possible future matter.\nSecond: That he swears voluntarily. If he swears under duress, his oath is not concluded - as we previously mentioned.\nThird: Breaking the oath (Hinth); by doing what he swore to leave, or leaving what he swore to do, voluntarily and remembering. If he swore under duress or while forgetting, there is no expiation (3).",
    "foot_note": "1. Fiqh al-Sunnah (3/99-100).\n2. Irwa' al-Ghalil (8/203).\n3. Al-Sharh Al-Mumti' (6/339).",
    "book_id": "85"
  },
  {
    "serial_number": "4644384",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "Third Requirement: Rulings related to Expiation\nThere are rulings related to expiation, including the following:\n1 - It is recommended to help the insolvent with expiation: On the authority of Abu Hurairah, may Allah be pleased with him, he said: A man came to the Messenger of Allah, peace be upon him, and said: I am ruined. He said: What is it? He said: I fell upon my wife in Ramadan. He said: Can you find a slave [to free]? He said: No. He said: Can you fast two consecutive months? He said: No. He said: Can you feed sixty poor people? He said: No. He said: Then a man from the Ansar came with an 'Araqa' - and the 'Araqa' is a basket containing dates - so he said: Go with this and give it in charity. He said: To someone poorer than us, O Messenger of Allah? By the One who sent you with the truth, there is no household between its two lava fields (Madinah) poorer than us. Then he said: Go and feed it to your family\" (1). - It is benefitted from the Hadith: That expiation does not drop from the poor, but it is recommended to help him if he is insolvent.\n2 - Expiation is prescribed before breaking the oath and after it: Jurists agreed that expiation is not obligatory except upon breaking the oath (Hinth), but they differed on the permissibility of advancing it before it or delaying it after it. The majority of jurists see that it is a concession legislated by Allah to dissolve what was tied of an oath, so it suffices before Hinth and after it. This view is attributed to fourteen Companions and a large number of Tabi'in. They cited the apparent meanings of texts, including: His saying, peace be upon him: \"By Allah, if Allah wills, I do not swear an oath then see something better than it except that I make expiation for my oath and do that which is better\" (2). And his saying, peace be upon him: \"Whoever swears an oath and sees something else better than it, let him do that which is better and let him make expiation for his oath\" (3). Abu Hanifa sees that expiation is not valid except after breaking the oath, to realize its cause at that time, and due to his saying, peace be upon him: \"Whoever swears an oath and sees something else better than it, let him do that which is better and let him make expiation for his oath\" (4). The correct view is that of the majority due to the confirmation of Hadiths about expiation before Hinth and after it. And because 'waw' (and) does not indicate order, but rather absolute gathering.",
    "foot_note": "1. Al-Bukhari with Al-Fath (11/726), under number (6710).\n2. Al-Bukhari with Al-Fath (11/630) under number (6623), and Muslim with Al-Nawawi's explanation (11/99) under number (1649).\n3. Muslim with Al-Nawawi's explanation (11/103) under number (1650).\n4. Sahih Muslim (3/1271) under number (1650).",
    "book_id": "85"
  },
  {
    "serial_number": "4644385",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "3 - Continuity in fasting for expiation is recommended according to the majority of scholars: Their argument for this is the reading of Ubayy and Ibn Masoud. Ubayy bin Ka'b and Ibn Masoud recited \"then a fast of three consecutive days\" (1). The reading, even if anomalous (Shadh) and not recited as Quran, is acted upon in legal rulings, and is equivalent to a solitary (Ahad) Hadith when authentic. It is valid for restricting the absolute and specifying the general as established in Usul. Ibn Qudamah said: \"If this is Quran, it is a proof... And if it is not Quran, it is a narration from the Prophet, peace be upon him... and it does not fall short of the degree of the Prophet's interpretation of the verse, peace be upon him. Under both estimations, it is a proof to be relied upon...\" (2). Imam Malik, Al-Shafi'i in the clearer view, Ahmad in a narration, and it is the school of the Zahiris, held that continuity is not a condition for fasting; rather he can fast them consecutively or separately. Their argument is the apparent meaning of the verse, for the command in it is absolute (3). The first view is correct due to the confirmation of the reading of Ubayy and Ibn Masoud regarding continuity.\n4 - It is a condition for expiation by manumission that the slave be a believer: According to the majority of scholars. They carried the absolute in the expiation of an oath upon the restricted in the expiation of accidental killing and said that only a believing slave suffices in both expiations. Abu Hanifa, may Allah have mercy on him, did not stipulate the slave being a believer because the Hanafis do not hold the view of carrying the absolute upon the restricted in the case of unity of ruling and difference of cause. Rather, they said the absolute is applied in its place and the restricted in its place. So in the expiation of an oath and Zihar, a disbelieving slave suffices according to them, acting on the absolute nature, and in the expiation of accidental killing, only a believing slave suffices according to them, acting on the restriction (4). The first view is correct.",
    "foot_note": "1. Previously referenced.\n2. Al-Mughni (8/752).\n3. Al-Ihtijaj bi'l-Qira'ah al-Shadhah wa Atharuhu fi Ikhtilaf al-Fuqaha by Muhammad Mashhuri Muhammad Na'im (273).\n4. Athar al-Ikhtilaf fi al-Qawa'id al-Usuliyyah Dr. Mustafa al-Khinn (261, 262).",
    "book_id": "85"
  },
  {
    "serial_number": "4644386",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "Fourth Requirement: Forms of people's negligence regarding oaths\n1 - Frequent swearing in buying and selling: Many texts have been reported forbidding this, including: The saying of the Prophet, peace be upon him: \"Four whom Allah Almighty hates: The seller who swears frequently, the arrogant poor person, the adulterous old man, and the unjust leader\" (1). And his saying, peace be upon him, in the hadith of Abu Dharr - may Allah be pleased with him -: \"Three to whom Allah will not look on the Day of Resurrection, nor will He purify them, and they will have a painful punishment - the Messenger of Allah, peace be upon him, recited it three times - I said: They have failed and lost, who are they O Messenger of Allah? He said: \"The one who drags his garment (out of pride), the one who reminds others of his favors, and the one who sells his commodity by false swearing\" (2). And his saying, peace be upon him: \"Three to whom Allah will not look on the Day of Resurrection, nor will He purify them, and they will have a painful punishment: A gray-haired adulterer, an arrogant dependent, and a man who made Allah his merchandise, he does not buy except with his oath and does not sell except with his oath\" (3). - The 'Ushaymit' (diminutive of gray-haired): From 'Shamat' which is graying of hair (4). The Prophet, peace be upon him, advised merchants to give charity; because swearing and lying attend the sale. He said: O assembly of merchants, indeed this sale is attended by swearing and lying, so mix your sale with charity\" (5). Included under this form are: - A - Swearing that this commodity cost such and such while it is not so: Based on his saying, peace be upon him: \"Three to whom Allah will not speak on the Day of Resurrection, nor look at, nor purify, and they will have a painful punishment: A man possessing surplus water in a desert who withholds it from the wayfarer, and a man who sold a man his commodity after Asr and swore by Allah that he took it for such and such and the buyer believed him and took it while it was otherwise, and a man who pledged allegiance to a leader only for worldly gain; if he gave him what he wanted he remained loyal, and if he didn't give him he did not remain loyal\" (6).",
    "foot_note": "1. Shu'ab al-Iman by Al-Bayhaqi (4/220) and Al-Albani authenticated it in Sahih al-Jami' under number (880).\n2. Sahih Muslim with Al-Nawawi's explanation (1/71) under number (306).\n3. Mu'jam Al-Tabarani Al-Saghir (2/82-83) and Al-Albani authenticated it in Sahih al-Jami' under number (3072).\n4. Al-Nihayah fi Gharib al-Hadith by Ibn al-Athir (2/501).\n5. Sunan Al-Nasa'i (7/14) and Al-Albani authenticated it in Sahih Sunan Ibn Majah under number (2145).\n6. Al-Bukhari (1/3598) under number (7212) and Muslim (1/103) under number (108).",
    "book_id": "85"
  },
  {
    "serial_number": "4644387",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "B - Swearing that he has been offered more than he was offered, while he is lying. Based on his saying, peace be upon him: \"Three to whom Allah will not speak on the Day of Resurrection, nor look at, a man who swore on his commodity that he was offered more for it than he was offered, while he is lying...\" (1). Wathilah bin Al-Asqa', may Allah be pleased with him, said: The Messenger of Allah, peace be upon him, used to come out to us, and we were merchants, and he would say: \"O assembly of merchants, beware of lying\" (2). C - Swearing not to sell for such [a price] then selling: From Abu Sa'id Al-Khudri - may Allah be pleased with him - he said: A Bedouin passed by with a sheep, so I said: Will you sell it to me for three Dirhams? He said: No, by Allah. Then he sold it to me. I mentioned that to the Messenger of Allah, peace be upon him, and he said: He sold his Hereafter for his worldly life\" (3). 2 - Negligence in 'Masburah' (Compulsory) Oaths enforced by the judge, and swearing them falsely and wickedly, and introducing bad intentions into them: It is known through authentic texts that they are based on the intention of the one requesting the oath. Imran bin Husain, may Allah be pleased with him, narrated that the Messenger of Allah, peace be upon him, said: \"Whoever swears a compulsory oath falsely, let him take his seat in the Fire\" (4). And he, peace be upon him, said: \"No one swears by Allah a compulsory oath and introduces into it the like of a gnat's wing except that it will be a black spot in his heart on the Day of Resurrection\" (5). - Compulsory Oaths (Al-Ayman Al-Masburah): Are those for which the person is held and detained. 3 - Swearing for every truth and falsehood: Based on his saying, peace be upon him: \"Three to whom Allah will not look tomorrow: An old adulterer, a man who made oaths his merchandise swearing for every truth and falsehood, and an arrogant poor person\" (6).",
    "foot_note": "1. Sahih Al-Bukhari (3/148) under number (2369).\n2. Al-Mu'jam Al-Kabir by Al-Tabarani (15/433) and Al-Albani authenticated it in Sahih Al-Targhib under number (1793).\n3. Sahih Ibn Hibban (11/276) and Al-Arna'ut graded it Hasan under number (4909).\n4. Sunan Abu Dawood (3/213) and Al-Albani authenticated it in Al-Silsilah Al-Sahihah under number (2332).\n5. Previously referenced.\n6. Al-Mu'jam Al-Kabir by Al-Tabarani (12/129) and Al-Albani authenticated it in Sahih Al-Jami' under number (3070).",
    "book_id": "85"
  },
  {
    "serial_number": "4644388",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "Appendix of Sharia Fatwas Regarding Oaths by His Eminence the Judge and Scholar / Muhammad bin Ismail Al-Amrani - May Allah Preserve Him -",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644389",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "Question One / What is legislated regarding oaths?\nAnswer / What is legislated is swearing by Allah, or by a name from the Names of Allah Almighty, or an attribute from the Attributes of Allah Almighty.\nQuestion Two / What is the ruling on swearing by other than Allah?\nAnswer / Swearing by other than Allah is forbidden (Haram).\nQuestion Three / What is the meaning of the Almighty's saying \"AND DO NOT MAKE ALLAH A HINDRANCE TO YOUR OATHS\"?\nAnswer / The meaning of the verse is that a person should not multiply oaths, like some saying \"By Allah this, by Allah that, by Allah this,\" swearing dozens of times in a single day. This is not appropriate.\nQuestion Four / A man swears by the religion of the Kaaba. We answered that it is not permissible to swear by this. He answered that the Kaaba has no religion. Is it permissible to swear in this way? And is it permissible to say that the Kaaba has no religion?\nAnswer / Know that the Messenger, peace be upon him, said: \"Do not swear by your fathers nor by your mothers, and whoever swears let him swear by Allah or let him remain silent.\" Based on that, whoever swears by the religion of the Kaaba has contradicted the Messenger, peace be upon him, and must repent and seek forgiveness. There is no difference between saying 'by the Kaaba' or 'by the religion of the Kaaba', both are not permissible. However, there is no objection to swearing by the Lord of the Kaaba because the Lord of the Kaaba is Allah. So if he swears by the Lord of the Kaaba, it is as if he swore by Allah, and the ruling of swearing by the Lord of the Kaaba is like swearing by Allah Almighty.\nQuestion Five: What is the ruling on one who swears by honesty (Amanah) - by the Kaaba - and by honor?\nAnswer: The Prophet, peace be upon him, forbade swearing by honesty, just as it is not permissible to swear by the Kaaba, but there is no objection to swearing by the Lord of the Kaaba, who is Allah.\nQuestion Six: Is it permissible to make someone swear by \"By Allah, the Destroyer, the Avenger\"?\nAnswer: The Destroyer (Al-Hatim) and the Avenger (Al-Naqim) are not among the names of Allah.\nQuestion Seven: What is the ruling of Sharia on one who swears by the Prophet, peace and blessings be upon him?\nAnswer: It is not permissible to swear by other than Allah Almighty, neither by fathers, nor by mothers, nor by any creature, even if it be the Prophets and Messengers.\nQuestion Eight: Is it prescribed to fulfill the oath of a Muslim (make him truthful)?\nAnswer: Yes, it is prescribed for a Muslim to fulfill his brother's oath due to the hadith \"Among the rights of a Muslim upon a Muslim is fulfilling his oath.\"",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644390",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "Question Nine: We hope for clarification from your Eminence regarding the saying of the Prophet, peace be upon him, \"He has succeeded, by his father, if he is truthful,\" for in this hadith there is swearing by other than Allah?\nAnswer: Some scholars said: The Prophet, peace be upon him, used it not intending the meaning of an oath, because some phrases are not meant literally, like \"may your hands be dusted\" which means \"a prayer for poverty against him\" until his right hand sticks to the dust. Even assuming no interpretation, the hadiths prohibiting swearing [by others] are preponderant because the saying of the Messenger, peace be upon him, as a conveyor is weightier than his action. Also, there is a rule: \"If a hadith indicating prohibition conflicts with a hadith indicating permissibility, the hadith indicating prohibition is acted upon as a precaution.\"\nQuestion Ten: What is the ruling on one who swears by Allah Almighty falsely/wickedly then regrets his action? What is required of him?\nAnswer: He must repent to Allah sincerely, regret what happened, and resolve not to return to this great sin. If he has cut off someone's wealth, part of the completion of repentance is to return what he took. His repentance is not complete except by returning what he took, whether much or little, and repentance is not valid nor accepted except by restoring rights to their owners.\nQuestion Eleven: What is the unintentional oath (Yamin al-Laghw)?\nAnswer: Scholars differed in defining it into three opinions:\nThe First View: The view of the Hanafis and Zaydis (Hadawiya) is that it is the oath sworn by the swearer thinking it is true regarding what he swore upon, then the opposite is revealed.\nThe Second View: The view of the Shafi'is: It is the oath that comes out unintentionally, like what Aisha, may Allah be pleased with her, said: \"It is a man's saying 'No by Allah' and 'Yes by Allah'.\" The interpretation of a Companion takes precedence over others.\nThe Third View: The view of Sa'id bin Al-Musayyib that it is the oath of anger.\nThe correct view is the saying of Aisha, which is \"that the unintentional oath is the one by which the swearer does not intend an oath, but rather it is a man's saying 'No by Allah' and 'Yes by Allah' without intending to swear.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644391",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "Question Twelve: We see some people speaking whatever insults and curses they like, and when someone disapproves of them, they say \"Allah does not impose blame upon you for what is meaningless in your oaths.\" Some people seize the property of others, i.e., wrong them, then get rid of their deed by an oath and make expiation for it, believing that the expiation clears them of the sin. Some people lie and swear by Allah, and when you rebuke them, they say to you \"I will make expiation for my oath.\" We ask our virtuous scholars for a comprehensive answer.\nAnswer: Know that the unintentional oath (Laghw) is the oath a person swears regarding something thinking it happened, then the opposite is revealed, like swearing that Muhammad is in the mosque thinking he is in the mosque, then it is revealed that he has left the mosque and was not in the mosque at the time of the oath. Or it is the oath that comes out of a person's mouth without intent or resolve for an oath, like a man saying 'No by Allah' and 'Yes by Allah'. This oath Allah does not hold the swearer accountable for. Rather, He holds him accountable for the knotted oath which the swearer swears to cut off the property of his Muslim brother or similar things. As for insults and cursing, it is forbidden in Sharia, and the believer is not a curser nor a defamer. Whoever insults, curses, or defames his Muslim brother is a sinner in Sharia. His excuse that he does this relying on the Almighty's saying \"Allah does not impose blame upon you for what is meaningless in your oaths\" is an incorrect and unacceptable excuse. It is under the saying \"An excuse worse than the deed\" because he added to the Sharia-prohibited insults and curses something extra to the sin and uglier than it, which is interpreting the noble verse with a meaning not indicated by the language either by conformity, implication, or commitment, and which no Sharia evidence indicates. Know that expiation of an oath is prescribed for every oath issued from a human, but it is for what the text mentioned, such as a person swearing on something then seeing that good lies in not doing it, like swearing not to speak to his father, brother, or friend, then regretting the oath since there is no good in abandoning a father, brother, or friend. The good, all the good, is in maintaining ties with the father, brother, or friend, or not abandoning them. For such a person, it is prescribed not to abandon his father, brother, or friend, and to speak to them and make expiation for his oath, acting upon the saying of the Messenger, peace be upon him: \"Whoever swears an oath and sees something else better than it, let him make expiation for his oath and do that which is better.\" As for the one who seizes some of his brother's wealth or wrongs him with any kind of injustice, then gets rid of that aggression emanating from him against wealth or part of it or aggression by his injustice of any kind by an oath, believing that the oath has severed the relationship between him and his adversary who was aggressed against before Allah Almighty, this person is mistaken in his belief that the oath has absolved him or made him not responsible before Allah because he made expiation for this oath with any type of expiation mentioned in the Quran. This expiation does not justify taking his brother's money without a Sharia right, nor does it permit the injustice that issued from him. He is still responsible before Allah Almighty for taking the money or for wronging his brother with any type of injustice, even if he has become innocent before the judge, because the judge's ruling is executed outwardly not inwardly, as indicated by authentic evidence from the purified Prophetic Sunnah, upon its owner and his family be the best prayers and peace. Whoever claims against a person that he has a sum of money, and the defendant denies this claim and demands proof, and the plaintiff is unable to establish proof because his documents are lost or he did not write a document against his opponent for what he owes him, and he is forced to request an oath from his denying opponent, and the opponent swears; the judge will rule for the plaintiff to be satisfied and to cease litigation against the defendant. This ruling will be effective outwardly, meaning the plaintiff has no remaining right to demand from the opponent as long as he could not prove his claim and requested the oath from the defendant and the defendant indeed swore. However, inwardly, the ruling is not effective and the defendant is still responsible before Allah Almighty.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644392",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "Question Thirteen: What is the Ghamus (False/Dipping) Oath and does it have an expiation?\nAnswer: The Ghamus Oath is the oath in which the swearer swears a wicked oath in order to take the wealth of his Muslim brother without right. There is no expiation for it; rather, he must repent and return what he took.\nQuestion Fourteen: What is the ruling on the oath of a coerced person?\nAnswer: The oath of a coerced person does not require fulfillment, he does not sin by breaking it, and no expiation is required of him. The limit of coercion is that a person is threatened with killing or severing a limb, and the threatener is capable of his threat and holds the instrument of killing or cutting, like having a rifle or pistol to kill him or a knife or similar to cut his parts. Also, that the threatener has locked the door on the coerced person and confined him in a place alone, and the threatener is capable and able to execute the threat, and the swearer strongly believes the threatener will carry out the threat. In such a case, it is considered coercion. However, if the coerced person is threatened with imprisonment or similar, it is not considered coercion.\nQuestion Fifteen: If a person stands in an embarrassing situation and has no way out except an oath, what is the ruling on the oath here?\nAnswer: Embarrassment is one thing and coercion is another. Whoever swears while embarrassed is a sinner, and whoever divorces while embarrassed, his wife is divorced, because embarrassment is not coercion.\nQuestion Sixteen: Is it permissible to swear jokingly, and is it considered an unintentional (Laghw) oath?\nAnswer: It is not permissible for any person to swear jokingly or in jest. Jesting and joking with oaths is forbidden, and his oath is not called an unintentional oath, and he is held accountable for it.\nQuestion Seventeen: What is the ruling on one who swears that this commodity cost such and such while it is not as he says? Is this considered a Ghamus Oath? Benefit us, may you be rewarded.\nAnswer: This oath is forbidden absolutely, and if he cuts off the wealth of a Muslim by it, it is Ghamus.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644393",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "Question Eighteen: What is the Sharia ruling on one who swears by \"Haram and Talaq\" (Unlawful and Divorce)?\nAnswer: It is not permissible nor appropriate to swear by divorce. If he swears saying \"The Unlawful and Divorce are upon me\" or \"Unlawful and Divorce\", it refers to his intention. If he intended divorce, one divorce occurs because this speech is a metonym for divorce. Metonyms for divorce, if divorce was intended by them, one divorce occurs. If he intended an oath, he pays the expiation of an oath. His word is accepted, and he must swear by Allah the Great that he did not intend divorce. He should have mercy on himself and not swear except with certainty, otherwise he will be punished with the punishment of an oath, then the punishment of the woman remaining with him while she has become forbidden to him.\nQuestion Nineteen: What is the Sharia ruling on one who says to his wife \"You are forbidden (Haram) to me\"?\nAnswer: This is a metonym for divorce. If he intended divorce by it, one divorce occurs. If he did not intend divorce by it, no divorce occurs, and he owes the expiation of an oath if he intended an oath. His word is accepted, and he must swear that he did not intend divorce.\nQuestion Twenty: What is the ruling on one who says \"Haram and Divorce\"?\nAnswer: This is a metonym from the metonyms of divorce. If the speaker intended divorce, one divorce occurs; otherwise, no. His word is accepted, and he must swear by Allah that he did not intend divorce. If he swears, no divorce occurs. He should have mercy on himself and not swear except with certainty.\nQuestion Twenty-One: What is the Sharia ruling on one who says \"Divorce is upon me\"? Is this considered divorce?\nAnswer: This is a metonym for divorce. If he intended divorce, one divorce occurs. If he intended an oath, he owes the expiation of an oath. His word is accepted, and he owes the oath. Let him fear Allah and not swear except with certainty, otherwise the punishment is great.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644394",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "Question Twenty-Two: If a man says \"Haram and Oath\", is the word 'Haram' called divorce or an oath? And does he owe expiation?\nAnswer: The word 'Haram', if the person intends divorce by it, it occurs as divorce. If he intends an oath by it, it occurs as an oath. Sayyid Allamah Muhammad bin Ismail Al-Amir said: It does not occur as divorce nor as an oath because it is not an attribute of Allah Almighty's attributes and there is no expiation for it.\nQuestion Twenty-Three: What is the ruling of the Hanif Sharia regarding a man who said to his wife \"Haram and Divorce, if you go to your father's house, you will not enter a house of mine\"?\nAnswer: If he intended divorce and she disobeyed, one divorce occurs.\nQuestion Twenty-Four: A man said to his wife \"Haram and Divorce, you will not spend the night in a house of mine\", then she spent the night in his house. Is it considered a divorce?\nAnswer: If he intended divorce, one divorce occurs; otherwise, no.\nQuestion Twenty-Five: What is the Sharia ruling on one who says \"The Haram is upon me\"?\nAnswer: This is a metonym for divorce, not an explicit divorce. So if he intended divorce, one divorce occurs if he breaks it. If he intended an oath, it occurs as an oath.\nQuestion Twenty-Six: What is the ruling on a person who said to his wife \"If you go to the wedding, I will not forbid you like my mother\"? So she went to the wedding. Is this considered a divorce?\nAnswer: This is a verb in the present/future tense (Mudari'), it does not occur [as divorce].\nQuestion Twenty-Seven: What is the ruling on a man who said to his wife \"Haram and Divorce, if you go to the wedding you are divorced\"?\nAnswer: Divorce and a condition. So she should not go. If she goes, one divorce occurs. If she does not go, it does not occur.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644395",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "Question Twenty-Eight: The phrase \"Haram and Divorce\" has become common on the tongues of youth in our country, where most of them say it for the most trivial reasons like \"Haram and Divorce you will not come to us tonight, and Haram and Divorce I will surely give you the money tomorrow.\" What is the ruling on this phrase and is it considered divorce or not?\nAnswer: This is from the metonyms of divorce. If the speaker intends divorce by it, one divorce occurs. If he intends an oath, he pays the expiation of an oath. His word is accepted, and he owes the oath. He should have mercy on himself and not swear except with certainty, otherwise he owes two punishments.\nQuestion Twenty-Nine: What is the ruling on one who swore by Allah or by divorce regarding something then did it forgetfully?\nAnswer: He is not held accountable.\nQuestion Thirty: Is testimony accepted after the acceptance of an oath?\nAnswer: This is a disputed issue among scholars. The Zaydis (Hadawiya) and a group of scholars held that testimony is accepted. Imam Yahya bin Muhammad Hamidaddin held in his choices that just testimony is not accepted after taking an oath, due to the hadith \"Your two witnesses or his oath\"; the hadith used the word \"or\" which implies choice. Since the defendant has sworn, he has incurred the Fire by breaking his oath if he cut off a Muslim's wealth with it, but provided that the performance of the oath was upon the request of the adversary and in his presence. However, if the defendant swore without the oath being requested from him, the testimony does not fall. If he swore without the presence of the plaintiff, he must repeat the oath in the presence of the plaintiff if the plaintiff requests that. This last view is the preponderant one according to Sheikh Al-Islam Al-Shawkani, may Allah have mercy on him.\nQuestion Thirty-One: Is an oath binding on another person?\nAnswer: According to the Hadawiya, an oath is binding on another person. Based on this view, whoever swears on another person and he does not fulfill his oath, the swearer must make expiation. But the later scholars of Yemen like Al-Maqbali, Al-Jalal, Al-Shawkani, and Al-Amir said: The oath is not binding on another because the other person is not under the authority of the swearer, and because the other has his will, power, and capacity, and the swearer has his will, power, and capacity. Humans are not held accountable except for their own actions and are not held accountable for the actions of others. It would have been better for the other person to fulfill his brother's oath and meet his brother's request to comfort him. The other person did wrong by not fulfilling his brother's oath and sinned.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644396",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "Question Thirty-Two: If a man invites a man to have lunch at his place and the inviter swears on the invited, and the inviter strongly believes the invited will respond to him, but the invited did not attend, does the swearer break his oath and owe expiation?\nAnswer: The swearer does not break his oath because an oath on another is not binding. The one sworn upon sins by not fulfilling the swearer's oath, but no expiation is owed by him. This is what a group of scholars held, including Imam Sharaf Al-Din, Al-Jalal, Al-Maqbali, Al-Amir, and Al-Shawkani.\nQuestion Thirty-Three: I invited one of my friends for lunch and he did not agree, so I said to him \"By Allah, you must come and have lunch at my place.\" I waited for him and he did not arrive. I asked some scholars: one said you owe expiation, and I asked others and they said you owe no expiation. I am confused, so advise me, may Allah reward you with good.\nAnswer: Whoever answered you, O questioner, that you owe expiation based it on the view that an oath is binding on another, which is Al-Hadi's school. Whoever answered you that you owe no expiation based it on the view that an oath is not binding on another, which is the school of Al-Maqbali, Al-Amir, and Al-Shawkani. Based on that, you owe expiation according to the Hadawiya, and you do not owe expiation according to Al-Shawkani, Al-Amir, and others. My personal opinion is that expiation is not obligatory because an oath on another is not binding for several reasons:\n1) Because it is not within the swearer's capability and not within his possibility, and scholars stipulate for an oath that it be within the swearer's capability.\n2) The Almighty said: \"And protect your oaths,\" and protecting it on another is impossible.\n3) The dream that Abu Bakr, may Allah be pleased with him, interpreted in the presence of the Prophet, peace be upon him and his family. The Messenger, peace be upon him and his family, said to him: You were right in some and wrong in some. Abu Bakr, may Allah be pleased with him, said: By Allah, you must tell me what I was wrong in. The Prophet, peace be upon him and his family, said to him: \"Do not swear,\" and did not explain to him a ruling resulting from his oath nor commanded him with expiation, even though it was a time of need, and delaying explanation past the time of need is not permissible.\nQuestion Thirty-Four: What is the ruling on one who swore on something, then another came and said \"I will make expiation for your oath on your behalf.\" Is it permissible for a person to make expiation for another?\nAnswer: There is no objection after the swearer authorizes and deputizes him.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644397",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "Question Thirty-Five: What is the ruling on exception in oaths?\nAnswer: Exception in oaths is permissible, but on the condition that the exception be connected (immediate). Delay is not permissible except for necessity like coughing, swallowing saliva, sneezing, or similar.\nQuestion Thirty-Six: Whoever swore and said secretly \"Insha'Allah\" (If Allah wills), what is the ruling on his oath?\nAnswer: \"Insha'Allah\" is not an exception unless the oath is suspended on something in the future. As for if he swore that he did not do something in the past, saying \"Insha'Allah\" has no effect because people have played with the phrase \"Insha'Allah\".\nQuestion Thirty-Six [*]: Is there a scholarly opinion permitting delay in exception in oaths?\nAnswer: It is the school of the Scholar of the Ummah \"Abdullah bin Abbas\", but it is a weak school because it would lead to the non-completion of financial transactions and other contracts like sale, preemption, leasing, pledging allegiance to caliphs, and other transactional contracts.\nQuestion Thirty-Seven: What is the Sharia ruling on one who swore not to speak to a specific person, or a friend, or not to enter a house, then wants to speak to his friend or enter that house? What is required of him?\nAnswer: He pays the expiation then speaks to him.\nQuestion Thirty-Eight: If a person swears on something where there is no good in breaking it nor in doing the thing. Is it prescribed for the swearer to make expiation for the oath even if there is no good in doing it?\nAnswer: The swearer does not make expiation unless there is good in doing the thing sworn against. But if there is no good in doing it, he does not make expiation.\nQuestion Thirty-Nine: I swore never to marry except when my brothers tell me to, and I have sworn several times not to marry. What is required of me if I want to marry?\nAnswer: Know that when a wife becomes available to you and you contract marriage with her, you must pay expiation, which is feeding ten poor people, because the Prophet, peace be upon him, commanded that in the authentic hadith stating \"Whoever swears an oath on something and sees something better than it, let him do that which is better and let him make expiation for his oath.\" Marriage is better than celibacy due to the hadith \"O assembly of youth, whoever among you can afford marriage, let him marry, and whoever cannot, let him fast.\"",
    "foot_note": "1. [*] The preparer of the book for Shamela said: Thus in the original, the number was repeated",
    "book_id": "85"
  },
  {
    "serial_number": "4644398",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "Question Forty: I swore on something and after that I saw to do otherwise. What is the ruling?\nAnswer: The Prophet, peace be upon him, said: \"Whoever swears on something and sees other than it better than it, let him make expiation for his oath and come to that which is better.\" So if what you swore not to do is better, then make expiation and do it. And if there is no good in it, do not do it and do not make expiation for it. For example: \"If you swore not to speak to your friend, make expiation and speak to him. If you swore not to smoke tobacco, do not smoke tobacco and do not make expiation because tobacco is not good; rather it is harmful as decided by doctors.\"\nQuestion Forty-One: What is the ruling on one who swore not to chew Qat and not to smoke tobacco then returned to them?\nAnswer: He is a sinner for returning. This person must leave what he swore not to do and quit it.\nQuestion Forty-Two: Is the oath on the intention of the swearer or on the intention of the one requesting the oath? And what is the Sharia ruling on one who swears on something and harbors something else?\nAnswer: The oath is on the intention of the one requesting the oath in rights, not on the intention of the swearer, except in what was a false sinful claim and regarding one who asks a citizen for what he has no right to, but rather to cause harm and injury to him.\nQuestion Forty-Three: What is the Sharia ruling on one who said \"I am innocent of Islam\" as an oath?\nAnswer: This is forbidden and he owes repentance, and it is not an oath.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644399",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "Question Forty-Four: What is your advice - virtuous Sheikh - regarding one who says: He is a Jew if he surely does such and such or surely brings such and such, then he does not do it. Is it considered an oath and is expiation required for it?\nAnswer: He owes sincere repentance.\nQuestion Forty-Five: What is the ruling on one who swears and says \"He is a Jew and divorce is upon him\". Is this considered divorce or an oath if he breaks it?\nAnswer: His saying \"He is a Jew\", he owes sincere repentance. His saying \"And divorce is upon him\" is a metonym for divorce. If he intended divorce by this word, one divorce occurs. If he intended an oath by it, he owes the expiation of an oath and he must swear by Allah the Great that he did not intend divorce. If he swears, no divorce occurs. He should have mercy on himself and not swear except with certainty, otherwise he will be punished with the punishment of the oath if he was lying and the punishment of the woman remaining after her divorce.\nQuestion Forty-Six: Is it permissible to feed one poor person for ten days as expiation for an oath, or give the money to one poor person?\nAnswer: The majority say the oath-breaker must feed ten poor people due to the Almighty's saying: \"feeding ten needy people\", so the oath-breaker feeds ten poor people. This is contrary to the Hanafis who say the oath-breaker feeds a poor person for ten days, interpreting the Almighty's saying: \"feeding ten needy people\" as meaning the oath-breaker gives out the feeding of ten poor people even if he gave them to one poor person, which is a far-fetched interpretation.\nQuestion Forty-Seven: Is the feeding of the ten poor people one meal or two meals? And is it possible to give them money instead of food?\nAnswer: Scholars said they are fed two meals. As for the permissibility of giving them money, one looks at the condition of the poor person. If he will spend the money on the price of medicine or feeding his children, he is given money. If he will spend the money on the price of Qat or cigarettes, the swearer feeds him and the poor person is not given money.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644400",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "Question Forty-Eight: If a person swore and wanted to make expiation by feeding ten poor people, is it permissible for him to feed his family even though they are among the poorest people?\nAnswer: If the person is rich, he feeds ten poor people other than his family. If he is poor, he fasts three days.\nQuestion Forty-Nine: If oaths are numerous, does he make expiation for every oath or does one expiation suffice?\nAnswer: If the oaths were about different things, like saying 'By Allah I will not read' and he read, 'By Allah I will not enter the house' and he entered the house, 'By Allah I will not write such and such' and he wrote. Then he makes expiation for every oath he swore. If the oaths were about one thing, like saying 'By Allah I will not enter the house', then on the second day it is said to him enter the house and he said 'By Allah I will not enter the house', and on the third day it was said to him enter the house and he said 'By Allah I will not enter the house'. This is not devoid of two cases: either the swearer made expiation in between them, so he makes expiation for every oath. Or if he did not make expiation, he makes one expiation because the oaths are effectively one oath, so the second oath is considered confirmation of the first and the third confirmation of the second and so on.\nQuestion Fifty: Is it permissible to give expiation to poor relatives?\nAnswer: Yes, it is permissible and it counts as upholding ties and expiation.\nQuestion Fifty-One: Is it permissible to give expiation to a charity organization?\nAnswer: If the charity organization has a clause for taking expiation and spending it on the poor, it is permissible on the condition that the person giving it to them clarifies that it is expiation for an oath so they spend it on the poor.\nQuestion Fifty-Two: Is it permissible to give expiation to Mujahideen?\nAnswer: The text stated giving it to the poor (Masakin), but if he gave it to Mujahideen, there is no objection if they are poor.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644401",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "Question Fifty-Three: Is the expiation for an oath by choice or by order?\nAnswer: By order, not by choice, because Allah Almighty says in the Quran \"But whoever cannot find [or afford it] - then a fast of three days\".\nQuestion Fifty-Four: Is continuity a condition in fasting for expiation?\nAnswer: Yes, due to Ibn Masoud's reading \"mutatabi'at\" (consecutive).\nQuestion Fifty-Five: Does giving the value suffice instead of the expiation [food/clothing]?\nAnswer: There is no objection.\nQuestion Fifty-Six: First: It happened that a woman said to her son: that she will not speak to her son a second time, and if she speaks to him she will be to him like his sisters. What do the scholars say about that? Second: What is your saying regarding a mother who frequently searches her children's clothes to protect them from any harm, is there an objection to that or is there no objection, advise us?\nAnswer: Know, O asking sister, that if she swore by a name of Allah's names or an attribute of Allah's attributes then broke the oath, she owes expiation which is feeding ten poor people. If she is unable to feed them due to poverty, she owes fasting three consecutive days. As for the speech mentioned in the question, expiation is not permissible for it, although it contains what contradicts the etiquette a Muslim woman should possess, especially if the woman is a mother with her son. The answer to the second: Know that there is no objection to that.\nQuestion Fifty-Seven: What is the Sharia ruling on one who stipulates swearing on the Noble Quran, or on a specific Surah from it like Surah Al-Hashr?\nAnswer: There is no necessity for that. However, if the Sharia judge sees interest (Maslahah) in that, he does it. That is because some citizens, if frightened by swearing on the Quran or in the 'Masmurah' and 'Manqurah' (specific places), get scared and refuse, whereas if told to swear in any place in any manner, they swear.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644402",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "Question Fifty-Eight: What is the Sharia ruling on one who stipulates on the swearer to swear on the heads of his children or swear on his condition and wealth?\nAnswer: Swearing is only by a name of Allah's names or an attribute of His attributes, and swearing is not by other than that as indicated by the evidence.\nQuestion Fifty-Nine: What is the ruling in Sharia for one who stipulates the oath at the grave of a Wali (saint) among the Awliya?\nAnswer: This is not permissible.\nQuestion Sixty: Does interlocking hands during swearing have a basis in Sharia? And is it permissible?\nAnswer: This is a custom, not Sharia.\nQuestion Sixty-One: What is the ruling on swearing in the Grand Mosque between the 'Masmurah' and 'Manqurah'?\nAnswer: If the judge or the adversary sees interest in this spot, there is no objection, otherwise there is no necessity.\nQuestion Sixty-Two: What is the ruling on specifying swearing at the Qibla of the mosque and on Surah Al-Hashr?\nAnswer: If the ruler, the adversary, or the mediators see interest in this matter, there is no objection, otherwise no.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644403",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "Scientific References\n1 - Al-Jami' li-Ahkam al-Quran - by Al-Qurtubi - Al-Maktabah Al-Tawfiqiyyah, and Dar Alam Al-Kutub.\n2 - Tafsir Al-Baghawi - Dar Taiba - Investigation: Muhammad Al-Nimr, Uthman Jum'ah, and Suleiman Al-Jarash.\n3 - Mufradat Alfaz al-Quran by Al-Raghib Al-Isfahani - Dar Al-Qalam Damascus - Al-Dar Al-Shamiyah - Investigation: Safwan Adnan Dawoudi.\n4 - Tafsir Al-Manar by Sayyid Muhammad Rashid Rida - Dar Al-Kutub Al-Ilmiyyah - Beirut.\n5 - Fath Al-Qadir by Judge Muhammad bin Ali Al-Shawkani - Dar Ibn Kathir and Dar Al-Kalim Al-Tayyib.\n6 - Adwa' al-Bayan fi Tafsir al-Quran bi'l-Quran by Al-Shanqiti. Dar Al-Fikr - Beirut.\n7 - Al-Mu'jam Al-Mufahras li Alfaz al-Quran al-Karim - by Muhammad Fuad Abdul Baqi - Dar Al-Hadith Cairo.\n8 - Nuzhat al-A'yun al-Nawazir fi Ilm al-Wujuh wa al-Naza'ir - by Abu al-Faraj Ibn al-Jawzi - Mu'assasat al-Risalah - Beirut - Investigation: Muhammad Abdul Karim Kazim al-Radi.\n9 - Fath al-Bari Sharh Sahih Al-Bukhari by Al-Hafiz Ibn Hajar Al-Asqalani - Dar Al-Salam - Dar Al-Fayha.\n10 - Sahih Al-Bukhari - Dar Al-Sha'b - Cairo.\n11 - Sahih Muslim with Al-Nawawi's explanation - Dar Al-Athar.\n12 - Ikmal al-Mu'lam Sharh Sahih Muslim by Judge Iyad.\n13 - Awn al-Ma'bud Sharh Sunan Abi Dawood by Abu Al-Tayyib Shams Al-Haqq Al-Azim Abadi.\n14 - Sunan Abi Dawood Al-Sijistani - Dar Al-Kitab Al-Arabi - Beirut.\n15 - Sunan Al-Nasa'i with Al-Hafiz Al-Suyuti's explanation and Al-Sindi's footnote - Dar Al-Ma'rifah.\n16 - Sunan Al-Tirmidhi - Dar Al-Gharb Al-Islami - Beirut.\n17 - Sunan Ibn Majah - Dar Al-Fikr - Beirut - Investigation: Muhammad Fuad Abdul Baqi.\n18 - Sahih Sunan Al-Tirmidhi - by Al-Albani - Maktabat Al-Tarbiyah Al-Arabi li Duwal Al-Khalij.\n19 - Sahih Sunan Ibn Majah by Al-Albani - Maktabat Al-Ma'arif - Riyadh.\n20 - Tuhfat Al-Ahwadhi Sharh Jami' Al-Tirmidhi by Al-Mubarakpuri - Dar Al-Hadith - Riyadh.\n21 - Sahih Ibn Hibban investigation by Shu'ayb Al-Arna'ut - Mu'assasat Al-Risalah.\n22 - Al-Mustadrak ala al-Sahihayn by Al-Hakim Al-Naysaburi - Dar Al-Kutub Al-Ilmiyyah Beirut.\n23 - Sahih Mawarid al-Zam'an ila Zawa'id Ibn Hibban by Al-Albani - Dar Al-Asimi.\n24 - Mu'jam Al-Tabarani Al-Saghir - Al-Maktab Al-Islami - Beirut - Investigation: Muhammad Shakur Mahmoud.\n25 - Mu'jam Al-Tabarani Al-Awsat - Dar Al-Haramain Publications - Cairo.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644404",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "26 - Mu'jam Al-Tabarani Al-Kabir - Dar Ihya Al-Turath Al-Arabi.\n27 - Al-Sunan Al-Kubra by Al-Bayhaqi - Dar Al-Kutub Al-Ilmiyyah Beirut - Investigation: Muhammad Abdul Qadir Ata.\n28 - Musnad Imam Ahmad - Mu'assasat Al-Risalah - Investigation: Shu'ayb Al-Arna'ut, and Adil Murshid.\n29 - Musnad Al-Bazzar - Maktabat Al-Ulum wa Al-Hikam - Medina.\n30 - Musnad Abi Ya'la - Dar Al-Ma'mun lil-Turath - Damascus - Investigation: Hussein Salim Assad.\n31 - Shu'ab Al-Iman by Al-Bayhaqi - Dar Al-Kutub Al-Ilmiyyah - Beirut - Investigation: Muhammad Al-Sa'id Basyuni.\n32 - Hilyat Al-Awliya wa Tabaqat Al-Asfiya by Abu Nu'aym Al-Asbahani - Dar Al-Kitab Al-Arabi - Beirut.\n33 - Jam' Al-Fawa'id min Jami' Al-Usul wa Majma' Al-Zawa'id by Al-Maghribi - Maktabat Ibn Kathir, and Dar Ibn Hazm investigation by Suleiman Al-Azmi.\n34 - Majma' Al-Zawa'id wa Manba' Al-Fawa'id by Al-Haytami - Investigation: Abdullah Muhammad Al-Darwish - Dar Al-Fikr.\n35 - Irwa' Al-Ghalil fi Takhrij Ahadith Manar Al-Sabil by Al-Albani - Al-Maktab Al-Islami.\n36 - Sahih Al-Jami' Al-Saghir wa Ziyadatuhu by Al-Albani - Al-Maktab Al-Islami.\n37 - Sahih Al-Targhib wa Al-Tarhib - by Al-Albani - Maktabat Al-Ma'arif.\n38 - Al-Jami' Al-Sahih mimma laysa fi Al-Sahihayn by Sheikh Muqbil Al-Wadi'i - Dar Al-Haramain Cairo.\n39 - Al-Nihayah fi Gharib Al-Hadith wa Al-Athar by Ibn Al-Athir - Mu'assasat Al-Tarikh Al-Arabi.\n40 - Lisan Al-Arab by Ibn Manzur - Dar Al-Fikr.\n41 - Al-Misbah Al-Munir fi Gharib Al-Sharh Al-Kabir li Al-Rafi'i by Allamah Al-Maqri Al-Fayoumi - Dar Al-Baz Makkah Al-Mukarramah.\n42 - Taj Al-Arus min Jawahir Al-Qamus by Al-Murtada Al-Zabidi - Dar Al-Hidayah.\n43 - Al-Qamus Al-Muhit - by Al-Firuzabadi - Dar Ihya Al-Turath Al-Arabi.\n44 - Al-Bidaya wa Al-Nihaya by Al-Hafiz Ibn Kathir Al-Dimashqi - Dar Ihya Al-Turath Al-Arabi.\n45 - Tarikh Al-Tabari by Abu Ja'far Muhammad bin Jarir Al-Tabari - Investigation: Muhammad Abu Al-Fadl Ibrahim - Beirut - Lebanon.\n46 - Asr Al-Ma'mun by Dr. Ahmed Farid Rifa'i - Dar Al-Kutub Al-Misriyyah - Cairo.\n47 - Al-Binayah Sharh Al-Hidayah by Badr Al-Din Al-Ayni - Dar Al-Kutub Al-Ilmiyyah.\n48 - Al-Tawqif 'ala Muhimmat Al-Ta'arif by Muhammad Abdul Ra'uf Al-Munawi - Dar Al-Fikr Al-Mu'asir - Investigation: Dr. Muhammad Radwan Al-Dayah.\n49 - Bada'i' Al-Sana'i' fi Tartib Al-Shara'i' - Dar Ihya Al-Turath Al-Arabi.\n50 - Al-Furuq by Imam Al-Qarafi - Al-Maktabah Al-Asriyyah.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644405",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "51 - Al-Majmu' by Imam Al-Nawawi - Dar Ihya Al-Turath Al-Arabi.\n52 - Al-Mughni by Imam Ibn Qudamah Al-Maqdisi - Dar Al-Hadith.\n53 - Rawdat Al-Talibin wa Umdat Al-Muftin by Al-Nawawi - Al-Maktabah Al-Islamiyyah.\n54 - Al-Muhalla by Ibn Hazm - Investigation: Ahmad Shakir - Dar Al-Turath - Cairo.\n55 - Radd Al-Muhtar 'ala Al-Durr Al-Mukhtar by Ibn Abidin - Dar Ihya Al-Turath Al-Arabi.\n56 - Bidayat Al-Mujtahid wa Nihayat Al-Muqtasid by Ibn Rushd the Grandson - Investigation: Hallaq - Maktabat Ibn Taymiyyah.\n57 - Mudawwanat Al-Fiqh Al-Maliki by Dr. Al-Sadiq Abdul Rahman Al-Ghariyani - Mu'assasat Al-Rayyan.\n58 - Nayl Al-Awtar bi Sharh Muntaqa Al-Akhbar: by Al-Shawkani - Dar Al-Hadith.\n59 - Subul Al-Salam: by Allamah Muhammad bin Ismail Al-Amir Al-San'ani - Dar Al-Aqidah.\n60 - Tawdih Al-Ahkam min Bulugh Al-Maram by Al-Bassam - Maktabat Al-Nahdah Al-Hadithah - Makkah Al-Mukarramah.\n61 - Al-Sharh Al-Mumti' 'ala Zad Al-Mustaqni' by Allamah Ibn Uthaymeen - Maktabat Al-Ansar.\n62 - Al-Rawd Al-Murbi' - Sharh Zad Al-Mustaqni' by Mansour Al-Bahuti - Investigation: Al-Sa'di and Ibn Uthaymeen - Dar Al-Mu'ayyad and Mu'assasat Al-Risalah.\n63 - Al-Iqna' by Ibn Al-Mundhir - Investigation: Saghir Al-Ansari - Maktabat Makkah Al-Thaqafiyyah.\n64 - Al-Darari Al-Mudiyyah Sharh Al-Durar Al-Bahiyyah by Al-Shawkani - Investigation: Hallaq - Maktabat Al-Irshad.\n65 - Al-Siraj Al-Wahhaj 'ala Matn Al-Minhaj by Imam Al-Nawawi - Dar Al-Fikr.\n66 - Al-Sayl Al-Jarrar Al-Mutadaffiq 'ala Hada'iq Al-Azhar by Allamah Al-Shawkani - Dar Ibn Hazm.\n67 - Kitab Al-Fiqh 'ala Al-Madhahib Al-Arba'ah: by Al-Hariri - Dar Al-Hadith.\n68 - Zad Al-Ma'ad fi Hadyi Khayr Al-Ibad by Ibn Al-Qayyim Al-Jawziyyah - Investigation: Shu'ayb and Abdul Qadir Al-Arna'ut - Mu'assasat Al-Risalah.\n69 - Al-Fiqh Al-Islami wa Adillatuh - Dr. Wahbah Al-Zuhayli - Dar Al-Fikr.\n70 - Al-Mufassal min Ahkam Al-Mar'ah Dr. Abdul Karim Zaidan - Mu'assasat Al-Risalah.\n71 - Al-Akhbar Al-Ilmiyyah wa Al-Ikhtiyarat Al-Fiqhiyyah by Sheikh Al-Islam Ibn Taymiyyah - Author: Ala' Al-Din Al-Dimashqi with comments by Ibn Uthaymeen - Dar Al-Asimah.\n72 - Majmoo' Fatawa Sheikh Al-Islam Ibn Taymiyyah Dar Al-Wafa, and Al-Fatawa Al-Kubra by Ibn Taymiyyah - Dar Al-Kutub Al-Ilmiyyah.\n73 - I'lam Al-Muwaqqi'in 'an Rabb Al-Alamin by Ibn Al-Qayyim Al-Jawziyyah - Dar Al-Fikr.\n74 - Al-Turuq Al-Hukmiyyah fi Al-Siyasah Al-Shar'iyyah by Ibn Al-Qayyim Al-Jawziyyah - Dar Al-Hadith - Cairo.\n75 - Fath Al-Majid - Sharh Kitab Al-Tawhid by Abdul Rahman bin Hasan - Jam'iyat Al-Ihsan edition.",
    "foot_note": "None",
    "book_id": "85"
  },
  {
    "serial_number": "4644406",
    "category_id": "19",
    "category": "Jurisprudential Issues",
    "book_title": "And Protect Your Oaths",
    "edition": "None",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "76 - Ighathat Al-Lahfan min Masa'id Al-Shaytan by Ibn Al-Qayyim - Dar Al-Hadith.\n77 - Athar Al-Ikhtilaf fi Al-Qawa'id Al-Usuliyyah fi Ikhtilaf Al-Fuqaha Dr. Mustafa Al-Khinn - Mu'assasat Al-Risalah.\n78 - Fiqh Al-Sunnah by Sayyid Sabiq - Dar Ihya Al-Turath Al-Arabi.\n79 - Ahkam Al-Usra fi Al-Shari'ah Al-Islamiyyah Dr. Al-Qulaisi - Maktabat Al-Jil Al-Jadid.\n80 - Al-Qada' wa Al-Ithbat Al-Shar'i Dr. Saleh Al-Dabyani.\n81 - Fatawa Sheikh Mustafa Al-Zarqa - Dar Al-Qalam.\n82 - Fatawa Al-Mar'ah Al-Muslimah by Ibn Uthaymeen.\n83 - Islamic Network - Encyclopedia of Fatwas.\n84 - Al-Mawsu'ah Al-Fiqhiyyah Ministry of Awqaf and Islamic Affairs in Kuwait.\n85 - Fatawa Sayyid Muhammad Rashid Rida - Dar Al-Kitab Al-Jadid - Beirut.\n86 - Al-Ihtijaj bi Al-Qira'ah Al-Shadhah wa Atharuhu fi Ikhtilaf Al-Fuqaha by Muhammad Mashhuri Muhammad Na'im.",
    "foot_note": "None",
    "book_id": "85"
  }
]