[
  {
    "text": "Al-Ilal (The Defects)\nAuthor: علي بن عبد الله بن جعفر السعدي بالولاء المديني البصري أبو الحسن\nYear: 234",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al-Ilal (The Defects)",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "new_page_number": 1
  },
  {
    "text": "sn: 3306\nbook_title: العلل\nbook_link: https://shamela.ws/book/6038\nbook_id: 6038\nauthor_name: علي بن عبد الله بن جعفر السعدي بالولاء المديني البصري أبو الحسن\nauthor_year: 234\nnickname: أبو الحسن\nauthor_link: https://shamela.ws/author/472\nauthor_ID: 472\neditor: محمد مصطفى الأعظمي [ت ١٤٣٩ هـ]\npublisher: المكتب الإسلامي - بيروت\nedition: الثانية، 1980\npages: 101\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: العلل والسؤلات الحديثية\ncategory_id: 9",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al-Ilal (The Defects)",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "new_page_number": 2
  },
  {
    "serial_number": "3306092",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Hadith Defects and Questions. Book: Al-Ilal. Author: Ali bin Abdullah bin Ja'far Al-Sa'di (by clientage) Al-Madini, Al-Basri, Abu Al-Hasan (d. 234 H). Investigator: Muhammad Mustafa Al-A'zami [d. 1439 H]. Publisher: Al-Maktab Al-Islami - Beirut. Edition: Second, 1980. Number of pages: 101 [Book numbering matches the printed version]. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\nBook: Al-Ilal. Author: Ali bin Abdullah bin Ja'far Al-Sa'di (by clientage) Al-Madini, Al-Basri, Abu Al-Hasan (d. 234 H). Investigator: Muhammad Mustafa Al-A'zami [d. 1439 H]. Publisher: Al-Maktab Al-Islami - Beirut. Edition: Second, 1980. Number of pages: 101 [Book numbering matches the printed version]. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Ali bin Abdullah bin Ja'far Al-Sa'di (by clientage) Al-Madini, Al-Basri, Abu Al-Hasan (d. 234 H). Investigator: Muhammad Mustafa Al-A'zami [d. 1439 H]. Publisher: Al-Maktab Al-Islami - Beirut. Edition: Second, 1980. Number of pages: 101 [Book numbering matches the printed version]. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\nInvestigator: Muhammad Mustafa Al-A'zami [d. 1439 H]. Publisher: Al-Maktab Al-Islami - Beirut. Edition: Second, 1980. Number of pages: 101 [Book numbering matches the printed version]. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\nNumber of pages: 101 [Book numbering matches the printed version]. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\n[Book numbering matches the printed version]. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\nPublication date in Shamela: 8 Dhu al-Hijjah 1431.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 3
  },
  {
    "serial_number": "3306093",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 1,
    "volume_number": 1,
    "text": "The Book of Defects (Kitab Al-Ilal)",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 4
  },
  {
    "serial_number": "3306094",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 36,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. He said: The two Sheikhs, the Imam, the Hafiz Abu Tahir Ahmad bin Muhammad bin Ahmad Al-Silafi Al-Asbahani and Abu Muhammad Abdullah bin Abdul-Rahman bin Yahya informed us in their writings to me; they said: Abu Al-Hasan Ali bin Musharraf bin Muslim Al-Anmati informed us from the original of his hearing; the Hafiz Abu Tahir said: And Abu Al-Hasan Ali bin Al-Hussein bin Omar Al-Farra Al-Mawsili informed us in Egypt; they said: Abu Ishaq Ibrahim Ibn Sa'id bin Abdullah the Hafiz in Egypt informed us; Abu Muhammad Abdul-Rahman bin Omar Ibn Muhammad bin Sa'id, known as Ibn Al-Nahhas Al-Mu'addil, informed us by reading upon him in Egypt in Muharram of the year four hundred and seven. Abu Muhammad Da'laj bin Ahmad bin Abdul-Rahman Al-Sijzi informed us, he came to us in the year three hundred and thirty-seven; Abu Al-Hasan Muhammad bin Ahmad bin Al-Bara informed us in Rabi' al-Awwal of the year two hundred and eighty-eight; Abu Al-Hasan Ali bin Abdullah bin Ja'far bin Najih Al-Sa'di Al-Madini told us by reading upon him, he said: 1 - I looked and found that the Isnad (chain of transmission) revolves around six people. For the people of Medina: 1 - Ibn Shihab, who is Muhammad bin Muslim bin Abdullah bin Shihab, and his Kunyah is Abu Bakr; he died in the year one hundred and twenty-four. And for the people of Mecca: 2 - Amr bin Dinar, the Mawla (client) of Jumah, and his Kunyah is Abu Muhammad; he died in the year one hundred and twenty-six.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 5
  },
  {
    "serial_number": "3306095",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 37,
    "volume_number": 1,
    "text": "And for the people of Basra: 3 - Qatada bin Di'amah Al-Sadusi, and his Kunyah is Abu Al-Khattab; he died in the year one hundred and seventeen. 4 - And Yahya bin Abi Kathir, and his Kunyah is Abu Nasr; he died in the year one hundred and thirty-two in Al-Yamamah. And for the people of Kufa: 5 - Abu Ishaq, and his name is Amr bin Abdullah bin Ubayd, and he died in the year one hundred and twenty-nine. 6 - And Sulayman bin Mihran, the Mawla of Banu Kahil from Banu Asad, and his Kunyah is Abu Muhammad; he died in the year one hundred and forty-eight, and he was handsome. 2 - Then the knowledge of these six transferred to the people of categories (authors/classifiers) from those who compiled. So for the people of Medina: 1 - Malik bin Anas bin Abi Amir Al-Asbahi, his count is among Banu Taym Allah, and he died in the year one hundred and seventy-nine, and he heard from Ibn Shihab. 2 - And Muhammad bin Ishaq bin Yasar, the Mawla of Banu Makhramah, and his Kunyah is Abu Bakr; he died in the year one hundred and fifty-two, and he heard from Ibn Shihab and Al-A'mash. And from the people of Mecca: 3 - Abdul-Malik bin Abdul-Aziz bin Jurayj, a Mawla of Quraysh, and his Kunyah is Abu Al-Walid; he died in the year one hundred and fifty-one.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 6
  },
  {
    "serial_number": "3306096",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 38,
    "volume_number": 1,
    "text": "4 - And Sufyan bin Uyaynah bin Maymun, the Mawla of Muhammad bin Muzahim, the brother of Al-Dhahhak bin Muzahim Al-Hilali, and his Kunyah is Abu Muhammad; he died in the year one hundred and ninety-eight. Sufyan met Ibn Shihab, Amr bin Dinar, Abu Ishaq, and Al-A'mash. And from the people of Basra: 5 - Sa'id bin Abi Aruba, the Mawla of Banu Adi bin Yashkur, and he is Sa'id bin Mihran, and his Kunyah is Abu Al-Nadr; he died in the year one hundred and fifty-eight or nine. 6 - And Hammad bin Salama, he said: I reckon him to be a Mawla of Banu Sulayman, and his Kunyah is Abu Salama; he died in the year one hundred and sixty-eight. 7 - And Abu Awana, and his name is Al-Waddah, the Mawla of Yazid bin Ata Al-Wasiti; he died in the year one hundred and seventy-five. 8 - And Shu'bah bin Al-Hajjaj Abu Bistam, the Mawla of Al-Ashafir; he died in the year one hundred and sixty.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 7
  },
  {
    "serial_number": "3306097",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 39,
    "volume_number": 1,
    "text": "9 - And Ma'mar bin Rashid, and his Kunyah is Abu Urwah, the Mawla of Al-Huddani, and he died in Yemen in the year one hundred and fifty-four; he heard from Ibn Shihab, Amr bin Dinar, Qatada, and from Yahya bin Abi Kathir, and from Abu Ishaq. And from the people of Kufa: 10 - Sufyan bin Sa'id Al-Thawri, and his Kunyah is Abu Abdullah, and he died in the year one hundred and sixty-one. And from the people of Sham (Levant): 11 - Abdul-Rahman bin Amr Al-Awza'i, and his Kunyah is Abu Amr; he died in the year one hundred and fifty-one. And from the people of Wasit: 12 - Hushaym bin Bashir, the Mawla of Banu Sulaym, and his Kunyah is Abu Mu'awiyah; he died in the year one hundred and eighty-three. Ibrahim Al-Harawi told us, Hushaym bin Bashir Al-Qasim bin Dinar told us.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 8
  },
  {
    "serial_number": "3306098",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 40,
    "volume_number": 1,
    "text": "The Mawla of Khuzaima bin Khazim, the Commander of the Believers; the Muhaddith (narrator); his Kunyah is Abu Mu'awiyah. 3 - Then the knowledge of these three from the people of Basra and the knowledge of the twelve ended up with six: 1 - To Yahya bin Sa'id Al-Qattan, and his Kunyah is Abu Sa'id, and he is a Mawla of Banu Taym, and he died in the year one hundred and ninety-eight in Safar. 2 - And Yahya bin Zakariya bin Abi Za'idah, and his Kunyah is Abu Sa'id, a Mawla of Hamdan; he died in the year one hundred and eighty-two. 3 - And Waki' bin Al-Jarrah bin Mulayh bin Adi bin Faras, and his Kunyah is Abu Sufyan; he died in the year one hundred and ninety-nine. 4 - To Abdullah bin Al-Mubarak, and he is Hanzali, and his Kunyah is Abu Abdul-Rahman, and he died in the year one hundred and eighty-one in Hit. 5 - And Abdul-Rahman bin Mahdi Al-Asadi, and his Kunyah is Abu Sa'id; he died in the year one hundred and ninety-eight. 6 - And Yahya bin Adam, and his Kunyah is Abu Zakariya, and he is the Mawla of Khalid bin Abdullah Ibn Usayd, according to my estimation; he died in the year two hundred and three. 4 - He said: And it used to be said that the judges of the Ummah are four: Omar bin Al-Khattab, Ali bin Abi Talib, Zaid bin Thabit, and Abu Musa Al-Ash'ari. 5 - He also said: The judges of this Ummah are four: Omar, Ali, Zaid, and Abu Musa Al-Ash'ari, may Allah have mercy on them.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 9
  },
  {
    "serial_number": "3306099",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 41,
    "volume_number": 1,
    "text": "6 - They said: Judgment (judiciary knowledge) among the Companions of the Messenger of Allah, may Allah bless him and grant him peace, was with six: Omar, Ali, Abdullah, Zaid bin Thabit, Abu Musa, and Ubayy bin Ka'b. 7 - Mutarrif said, on the authority of Al-Sha'bi: For the people of Medina, Abdullah, Ali, and Abu Musa are sufficient for them. 8 - And on the authority of Masruq, he said: Knowledge was with six of the Companions of the Messenger of Allah, may Allah bless him and grant him peace; half of them were for the people of Kufa. One of them was Abu Musa - he says 'one of the half'. Then he named them: Omar, Ali, Abdullah, Abu Musa, Ubayy, and Zaid bin Thabit. 9 - He said: The Companions of the Messenger of Allah, may Allah bless him and grant him peace, used to be close to one another; they would ascend with a question (issue), and a man among them would get it right, then they would ascend with the question and the other would get it right. People used to take from six: Omar, Ali, Abdullah, Ubayy, Abu Musa, and Zaid bin Thabit. He said: So I said to Al-Sha'bi: What about Abu Musa? He said: He was a Faqih (jurist). 10 - And on the authority of Al-Sha'bi, he said: Knowledge was taken from six: Omar, Abdullah bin Mas'ud, Zaid bin Thabit, and Ubayy - and these used to ask for fatwas from one another - and Ali and Abu Musa. He said: So I said to Al-Sha'bi: So was Abu Musa included? He said: He was a scholar. He said: I said: So where is Mu'adh? He said: He died before that.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 10
  },
  {
    "serial_number": "3306100",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 42,
    "volume_number": 1,
    "text": "11 - He said: Masruq said: I tested (examined) the Companions of Muhammad, may Allah bless him and grant him peace, and I found their knowledge ended up with six men among them: Omar, Ali, Abdullah, Abu Al-Darda, Ubayy bin Ka'b, and Zaid bin Thabit. Then I tested these six and found their knowledge ended up with two men among them: with Ali and Abdullah. 12 - And on the authority of Masruq, he said: I tested the Companions of the Messenger of Allah, may Allah bless him and grant him peace, and they were like cisterns (Ikhadh): among them was one that satisfies a man, and among them was one that satisfies two men, and among them was one that satisfies three, and among them was one that satisfies the people; and Abdullah bin Mas'ud was among those who satisfy the people. 13 - He said: Masruq said: I did not liken the Companions of the Prophet, may Allah bless him and grant him peace, except to a cistern (Ikhadhah) in which water gathers; the cistern suffices a rider, and the cistern suffices two riders, and the cistern suffices more than that - I reckon it was Shu'bah who doubted, and he is not one to doubt in himself - and the cistern suffices a multitude of people; and I asked Omar, Uthman, and Ali, but when I met Abdullah, he sufficed me. 14 - There was no one among the Companions of the Messenger of Allah, may Allah bless him and grant him peace, who had companionship, whose school was followed, whose fatwa was used for issuing judgments, and whose path was treaded, except three: Abdullah bin Mas'ud, Zaid bin Thabit, and Abdullah bin Abbas. 15 - So the companions of Abdullah bin Mas'ud who issue fatwas according to his fatwa and read according to his reading are: Alqama bin Qays, Al-Aswad bin Yazid, Masruq, Ubaydah Al-Salamani, Al-Harith bin Qays, and Amr bin Shurahbil. 16 - Ibn Sirin said: The companions of Abdullah were five; there were",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 11
  },
  {
    "serial_number": "3306101",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 43,
    "volume_number": 1,
    "text": "among them those who start with Ubaydah and place Al-Harith second, and among them those who start with Al-Harith and place Ubaydah second, and place Masruq third, and Alqama, and Shuraih. And all of them had a defect in them: Al-Harith was one-eyed, Ubaydah was one-eyed, Masruq was hunchbacked, and regarding Alqama they used to say he was lame, and Shuraih was hairless (sparse-bearded). 17 - He said: Muhammad bin Sirin said: The companions of Abdullah whom none could equal were five. Among people were those who would start with Al-Harith Al-Hamadani and place Ubaydah second, and among them were those who would start with Ubaydah, Al-Harith, Alqama, Masruq, and Shuraih; and all of them place Shuraih as the last of them. This is how Ibn Sirin narrated it, making them five and including Shuraih and Al-Harith Al-A'war among them. 18 - Ibrahim Al-Nakha'i disagreed with him, and Ibrahim, in my view, was among the most knowledgeable of people regarding the companions of Abdullah and the most intimate with him. He said: The companions of Abdullah who read (teach Quran) and issue fatwas were six: Alqama, Al-Aswad, Masruq, Ubaydah, Amr bin Shurahbil, and Al-Harith Al-A'war. I do not see Ibn Sirin except that he added Al-Harith bin Qays, because Al-Harith Al-A'war was not on the path of Abdullah's companions; his narration and school of thought were towards Ali bin Abi Talib, and I do not know him to have narrated from Abdullah except two hadiths, and he differs from him in one of them. 19 - And the companions of these six from the companions of Abdullah, from those who speak with their speech and issue fatwas according to their fatwa, is Ibrahim Al-Nakha'i. 20 - And Ibrahim met from these: Al-Aswad, Alqama, Masruq, and Ubaydah.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 12
  },
  {
    "serial_number": "3306102",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 44,
    "volume_number": 1,
    "text": "And he did not hear from Al-Harith bin Qays nor Amr bin Shurahbil, and he narrated from Hammam bin Al-Harith from him. 21 - And Amir heard from all of them except Al-Harith bin Qays, and Al-Harith was killed alongside Ali, may Allah be pleased with him. 22 - And the most knowledgeable of people regarding these from the people of Kufa, from those who issue fatwas according to their fatwa and follow their school, were Al-A'mash and Abu Ishaq. And Al-A'mash was the most knowledgeable of people regarding those who passed from these, more than any man. And Al-A'mash did not meet anyone of these. Abu Ishaq met from them Al-Aswad bin Yazid, Masruq, Ubaydah Al-Salamani, and Amr bin Shurahbil, but he did not meet Alqama nor Al-Harith bin Qays. 23 - And after these was Sufyan Al-Thawri; he used to follow their school and issue fatwas according to their fatwa. 24 - And after Sufyan was Yahya bin Sa'id Al-Qattan; he used to follow the school of Sufyan Al-Thawri and the companions of Abdullah. 25 - And the companions of Ibn Abbas who follow his school and tread his path are: Ata, Tawus, Mujahid, Jabir bin Zaid, Ikrimah, and Sa'id bin Jubayr; so the most knowledgeable of these is Sa'id bin Jubayr and the most reliable of them in it. 26 - And the most knowledgeable of people regarding these was Amr bin Dinar, and he used to love Ibn Abbas and love his companions. Then there was Ibn Jurayj and Sufyan bin Uyaynah, they used to love the companions of Ibn Abbas and love his path. So Ibn Jurayj heard from Tawus and Mujahid, but he did not meet Jabir bin Zaid, nor Ikrimah, nor Sa'id bin Jubayr. 27 - And the companions of Zaid bin Thabit who used to take from him and issue fatwas according to his fatwa - among them were those who met him and among them were those who did not meet him - were twelve men: Sa'id bin",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 13
  },
  {
    "serial_number": "3306103",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 45,
    "volume_number": 1,
    "text": "Al-Musayyib, Urwah bin Al-Zubayr, Qabisah bin Dhu'ayb, Kharijah bin Zaid, Sulayman bin Yasar, Aban bin Uthman, Ubayd Allah bin Abdullah, Al-Qasim bin Muhammad, Salim bin Abdullah, Abu Bakr bin Abdul-Rahman, Abu Salama Ibn Abdul-Rahman, Talha bin Abdullah bin Awf, and Nafi' bin Jubayr bin Mut'im. As for those who met him among them, and whose meeting is established with us: Sa'id bin Al-Musayyib, Urwah Ibn Al-Zubayr, Qabisah bin Dhu'ayb, Kharijah bin Zaid, Aban bin Uthman, and Sulayman bin Yasar. And hearing from Zaid is not established with us for the rest according to what was delivered to us, except that they used to follow his school in Fiqh (jurisprudence) and knowledge. 28 - And there was no one in Medina after these more knowledgeable about them than Ibn Shihab, Yahya bin Sa'id, Abu Al-Zinad, and Bukayr bin Abdullah Al-Ashaj. Then there was no one more knowledgeable about these and their school than Malik bin Anas. Then after Malik, Abdul-Rahman bin Mahdi used to follow their school and emulate their path. Ibn Abi Hatim Al-Razi cited it. 29 - Ali said: There was no one from the Companions of the Prophet, may Allah bless him and grant him peace, who had companions that issued fatwas according to his saying in Fiqh except three: Abdullah bin Mas'ud, Zaid bin Thabit, and Ibn Abbas. Each man of them had companions who upheld his saying and issued fatwas to the people. Al-Dhahabi cited it. 30 - And the companions of Abdullah who read according to his reading and issue fatwas to them",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 14
  },
  {
    "serial_number": "3306104",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 46,
    "volume_number": 1,
    "text": "according to his saying and follow his school were Alqama bin Qays, Al-Aswad bin Yazid, Masruq Ibn Al-Ajda', Ubaydah Al-Salamani, Amr bin Shurahbil, and Al-Harith bin Qays; these six, Ibrahim Al-Nakha'i counted them. 31 - He said: And the companions of Abdullah who taught people according to his reading and issued fatwas to them were six: Alqama, Al-Aswad, and Masruq - he counts these six. And the most knowledgeable of the people of Kufa regarding the companions of Abdullah, their path, and their school were Ibrahim and Al-Sha'bi, except that Al-Sha'bi used to follow the school of Masruq, taking from Ali, the people of Medina, and others, while Ibrahim used to follow the school of his companions, these companions of Abdullah. 32 - Abu Ishaq and Sulayman Al-A'mash were the most knowledgeable of the people of Kufa regarding the school of Abdullah and his path and the ruling after these two. And Sufyan bin Sa'id was the most knowledgeable of people regarding these two, their Hadith, and their path. And Yahya bin Sa'id Al-Qattan used to love Sufyan and love this path and would not put anyone ahead of him. 33 - And the companions of Zaid bin Thabit who follow his school in Fiqh and speak according to his saying were these twelve. Among them were those who met him and among them were those who did not meet him. Among those who met him from these twelve were Qabisah bin Dhu'ayb, Kharijah bin Zaid bin Thabit, Aban bin Uthman, and Sulayman bin Yasar. And among those who speak according to his saying, whose meeting is not established, are the likes of these four: Sa'id bin Al-Musayyib, Urwah bin Al-Zubayr, Abdul-Malik bin Marwan, and Qabisah bin Dhu'ayb. And the most knowledgeable of the people of Medina regarding these twelve, their school, and their path were Ibn Shihab, Yahya Ibn Sa'id, Abu Al-Zinad, and Abu Bakr bin Hazm. 34 - Then after these, following this school and undertaking this matter was",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 15
  },
  {
    "serial_number": "3306105",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 47,
    "volume_number": 1,
    "text": "Malik bin Anas, Ruthayir bin Farqad, Al-Mughira bin Abdul-Rahman Al-Makhzumi, and Abdul-Aziz bin Abi Salama Al-Majishun. And Abdul-Rahman bin Mahdi loves this path and follows this school and does not put anyone ahead of him. 35 - And the companions of Ibn Abbas were six. He said: And I heard Yahya bin Sa'id saying - I think he said: The companions of Ibn Abbas are six; after these, those who speak according to his saying, issue fatwas by it, and follow his school are these six: Sa'id bin Jubayr, Jabir bin Zaid, Tawus, Mujahid, Ata, and Ikrimah. And the most knowledgeable of people regarding these, their path, and this school was Amr bin Dinar, and he had met all of them. 36 - And Ibn Abi Najih used to follow this school and issue fatwas with this fatwa, except that he met some of these and did not meet some of them. And the most knowledgeable of people regarding these, their path, and their school were Ibn Jurayj and Sufyan bin Uyaynah. [Section]: Who narrated from Zaid bin Thabit. 37 - He said: And I heard Yahya say: Those who narrated from Zaid bin Thabit from the Companions of the Prophet, may Allah bless him and grant him peace, were Ali bin Abi Talib, Sa'd bin Abi Al-Waqqas, Ibn Omar, Abu Sa'id Al-Khudri, Ibn Abbas, and Anas bin Malik. 38 - And those who narrated from Zaid bin Thabit from those who met him from the people of Medina among the Tabi'un were Abu Umamah bin Sahl bin Hanif, Mahmoud bin Labid, and Qabisah bin",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 16
  },
  {
    "serial_number": "3306106",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 48,
    "volume_number": 1,
    "text": "Dhu'ayb, Kharijah bin Zaid bin Thabit, Nufay' the Mawla of Umm Salama, Abdul-Rahman bin Sa'id bin Yarbu', Hafs bin Asim, Aban bin Uthman, Utbah bin [gap] and Abu Salih the Mawla of Al-Saffah, Ata bin Yasar, Sulayman Ibn Yasar, Kathir the Mawla of Al-Salt, Nistas the Mawla of Kathir bin Al-Salt, Khalid the Mawla of Ubayd bin Al-Sabbaq, Marwan bin Al-Hakam, Al-Sa'ib bin Jundab bin Kathir bin Aflah Abu Murrah the Mawla of Uqayl bin Abi Talib, Wuhaib the Mawla of Zaid bin Thabit, Abdullah bin Amir bin Rabi'ah, and Muhammad bin Abdul-Rahman bin Thawban. 39 - And from the people of Kufa: Masruq bin Al-Ajda', Al-Aswad bin Yazid, and Thabit bin Utbah. And from the people of Medina, from those who narrated from him among those who caught his time, but meeting him is not established for him nor is hearing from him established: 40 - Sa'id bin Al-Musayyib. Yahya bin Sa'id said: Malik bin Anas said: Sa'id bin Al-Musayyib did not hear from Zaid bin Thabit. And he narrated from Ali bin Zaid from Sa'id bin Al-Musayyib, he said: I attended the funeral of Zaid bin Thabit. 41 - And Urwah bin Al-Zubayr narrated from Zaid bin Thabit, and he narrated from those who narrated from him. And Hisham bin Urwah narrated from his father that he heard Abu Humaid narrating the Hadith of Sadaqah (Charity), so Abu Humaid said: My ears heard and my eyes saw, and ask Zaid bin Thabit, for he heard it with me. Imam Ahmad included it in Al-Musnad. This indicates that Urwah heard",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 17
  },
  {
    "serial_number": "3306107",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 49,
    "volume_number": 1,
    "text": "this from Abu Humaid while Zaid was alive. 42 - And Abu Salama narrated from him, and he narrated from Nufay' the Mawla of Abu Salama from him. 43 - And Al-Qasim narrated from him, and it is not established that he heard anything from him. 44 - And Salim narrated from him, and it is not established with us that he heard anything from him. 45 - Busr bin Sa'id. I said to Yahya: Busr bin Sa'id? He said: What do you deny? I said: He narrated from the Mawla of Al-Saffah from Zaid bin Thabit. He said: Shaqiq has narrated from Abdullah, and from a man from Abdullah. Qays bin Abi Hazim. 46 - Ali said: Qays bin Abi Hazim heard from Abu Bakr, Omar, Uthman, Ali, Sa'd bin Abi Waqqas, Zubayr, Talha bin Ubayd Allah, Abu Rahm, Jarir bin Abdullah Al-Bajali, and Abu Mas'ud Al-Badri,",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 18
  },
  {
    "serial_number": "3306108",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 50,
    "volume_number": 1,
    "text": "and Khabbab bin Al-Aratt, Al-Mughira bin Shu'bah, Mirdas bin Malik Al-Aslami, Al-Mustawrid bin Shaddad Al-Fihri, Dukayn bin Sa'd Al-Muzani, Mu'awiyah bin Abi Sufyan, Amr bin Al-Aas, Abu Sufyan bin Harb, Khalid bin Al-Walid, Hudhayfah bin Al-Yaman, Abdullah bin Mas'ud, Sa'id bin Zaid, and Abu Juhayfah. It was said to Ali: Did Qays bin Abi Hazim hear from all of these directly (Sama'an)? He said: Yes, he heard from them directly, and were it not for that, we would not count it as hearing for him. It was said to him: Did he witness the Camel (Battle)? He said: No, he was Uthmani (pro-Uthman). And he also narrated from Abu Huraira, and from Qays bin Fahd. And he narrated from Bilal but did not meet him, and from Al-Sunabih bin Al-A'sar Al-Ahmasi. And he narrated from Uqbah bin Amir, and I do not know if he heard from him or not. And from Qays bin Fahd directly. He said: And I saw Asma, daughter of Abu Bakr. 47 - And his father is Abu Hazim, and the name of Abu Hazim is Auf bin Abdul-Harith. He narrated from Ammar. They differed regarding Yazid bin Abi Khalid about it; some of them said: From Ibn Abi Khalid from Yahya bin Abis: Ammar said 'Bury me in my clothes.' And some of them said: Ismail from Qays: Ammar said 'Bury me in my clothes.' 48 - Qays bin Abi Hazim heard from Sa'd bin Mas'ud, the uncle of Al-Mukhtar, and he was among the Companions of the Prophet, may Allah bless him and grant him peace. And Qays bin Abi Hazim did not hear from Abu Al-Darda nor Salman.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 19
  },
  {
    "serial_number": "3306109",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 51,
    "volume_number": 1,
    "text": "Al-Hasan Al-Basri. 49 - Ali said: Al-Hasan heard from Uthman bin Affan while he was a boy and he (Uthman) was preaching, and from Uthman bin Abi Al-Aas, and from Abu Bakrah. 50 - And he did not hear anything from Imran bin Husain, and it is not correct; a hearing of Al-Hasan from Imran is not authentic from a correct, established path. I said: Did Al-Hasan hear from Jabir? He said: No. I said: Did Al-Hasan hear from Abu Sa'id Al-Khudri? He said: No, he was in Medina during the days Ibn Abbas was over Basra; Ali had appointed him over it, and he went out to Siffin. And he said regarding the Hadith of Al-Hasan: 'Ibn Abbas addressed us in Basra,' the Hadith - Abu Dawood included it - it is only like the saying of Thabit: 'Imran bin Husain arrived upon us,' and like the saying of Mujahid: 'Ali went out to us,' and like the saying of Al-Hasan that Suraqah bin Malik bin Ju'shum told them, and like his saying: 'Mujashi' bin Mas'ud raided with us.' Al-Hasan did not hear from Ibn Abbas and never saw him; Ibn Abbas was in Basra. And (narrations) from Abdullah bin Mughaffal, and from Ma'qil bin Yasar, and from Anas bin Malik, and from Samura bin Jundab.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 20
  },
  {
    "serial_number": "3306110",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 52,
    "volume_number": 1,
    "text": "51 - He said: And Habib bin Al-Shahid said: Ibn Sirin commanded me to ask Al-Hasan from whom he heard his Hadith regarding the Aqiqah. He said: So I asked him, and he said: I heard it from Samura. He said: Samura said: Every newborn is mortgaged by his Aqiqah, it is slaughtered on his behalf on his seventh day. Bukhari included it in (the chapter of) Al-Aqiqah. 52 - And from the Prophet, may Allah bless him and grant him peace: Every newborn is mortgaged by his Aqiqah, it is slaughtered on his behalf on his seventh day, his head is shaved, and he is named. Abu Dawood included it. 53 - And from Samura bin Jundab from the Prophet, may Allah bless him and grant him peace: Every boy is mortgaged by his Aqiqah, it is slaughtered on his behalf on his seventh day, and he is smeared with blood (Yudma). This is how Hammam said: 'He is smeared with blood.' And Sa'id bin Abi Aruba said: 'And he is named (Yusamma).' Hammam said to Qatada: How is he smeared with blood? He said: The Aqiqah is slaughtered, then its jugular veins are met with a piece of wool or cotton, then it is placed on the fontanelle of the boy. Abu Dawood included it. 54 - He said: Yunus bin Ubayd was asked about the boy whose head is smeared with the blood of his Aqiqah. He said: Al-Hasan used to say: It is filth; the people of Jahiliyyah used to do it. Ibn Abi Shaybah included it. And from Al-Hasan and Muhammad bin Sirin that they both disliked that the head of the boy be smeared with the blood of his Aqiqah.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 21
  },
  {
    "serial_number": "3306111",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 53,
    "volume_number": 1,
    "text": "55 - And from Hayyaj bin Imran Al-Burjami, he said: A slave of my father's ran away, so he vowed that if he caught him, he would cut off his hand or cut off a portion of him. He said: So he came to Samura bin Jundab and mentioned that to him. He said: The Messenger of Allah, may Allah bless him and grant him peace, never delivered a sermon to us except that he forbade us from mutilation and commanded us with charity. And he came to Imran bin Husain and asked him, and he said the like of what Samura said. Imam Ahmad included it from Hayyaj from Imran and Samura with similar wording. 56 - And he did not narrate anything from Al-Hasan saying 'I read in the book of Samura' except one Hadith narrated by Ibn Awn: 'When is it lawful for a man to eat carrion?' And I do not know anyone who narrated it from Al-Hasan from Samura. And if anyone narrated it from Al-Hasan from Samura, Ibn Awn narrated it: 'I read in the book of Samura.' And these Hadiths are in the book of Samura, but his Hadiths which he narrated from Samura are other than this Hadith. 57 - And Samura narrated more than thirty Marfu' (elevated to Prophet) Hadiths and others. And Al-Hasan had heard from Samura because he was fourteen years and some months old during the era of Uthman, and Samura died during the era of Ziyad. 58 - Yahya bin Ayyub Al-Maqabiri told us, Ali bin Hashim told us, from Abdullah bin Muharrir, from Qatada, from Anas that the Prophet, may Allah bless him and grant him peace, performed Aqiqah for himself after Allah sent him as a Prophet. Al-Bazzar included it. 59 - He said: And I saw Ibn Al-Zubayr pledging allegiance to Ali in a garden (Hush). And Musa disagreed with him",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 22
  },
  {
    "serial_number": "3306112",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 54,
    "volume_number": 1,
    "text": "bin Dawud; he said: I saw Talha pledging allegiance to Ali in a garden. So Khalid Ibn Al-Qasim asked him about this Hadith. He said: It is not among the authentic Hadith of Hushaym. And Al-Hasan did not see Ali unless he saw him in Medina while he was a boy. Ibn Abi Hatim included it. 60 - Al-Hasan saw Umm Salama but did not hear from her, and he was small, and the mother of Al-Hasan used to serve Umm Salama, and she narrated from her. Al-Hasan did not hear from Abu Musa Al-Ash'ari, and he was in Basra during the time of Omar. 61 - The Hadith of Abdul-Rahman bin Samura from the Prophet, may Allah bless him and grant him peace, he said: 'Do not ask for leadership.' And Ash'ath narrated from Al-Hasan, he said: We were with Abdul-Rahman bin Samura in Kabul. Imam Ahmad cited it in his Musnad. 62 - He was asked about the Hadith of Suraqah regarding the pursuit of the Prophet, may Allah bless him and grant him peace. He said: Ma'mar narrated from Al-Zuhri from Abdul-Rahman bin Malik from Suraqah, the long Hadith, that Suraqah went out seeking the Prophet, may Allah bless him and grant him peace, and placed one hundred camels in it. Imam Ahmad included it. And Al-Hasan bin Abi Al-Hasan narrated that Suraqah told them, in the narration of Ali bin Zaid bin Jud'an. It is a chain that the heart rejects (does not accept), that Al-Hasan heard from Suraqah, unless the meaning of 'told them' is 'told the people', for this is more likely.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 23
  },
  {
    "serial_number": "3306113",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 55,
    "volume_number": 1,
    "text": "63 - And he was asked about the Hadith of Al-Aswad, who is Ibn Sari': The Messenger of Allah, may Allah bless him and grant him peace, sent a detachment so they killed many. Imam Ahmad included it. He said: Its chain is broken (Munqati'). The narration of Al-Hasan from Al-Aswad bin Sari', and Al-Hasan according to us did not hear from Al-Aswad, because Al-Aswad left Basra in the days of Ali, and Al-Hasan was in Medina. So I said to him: Al-Mubarak, meaning Ibn Fadalah, says in the Hadith of Al-Hasan from Al-Aswad: 'I came to the Messenger of Allah, may Allah bless him and grant him peace, and I said: I have praised my Lord with praises.' Al-Aswad informed me. Imam Ahmad included it in Al-Musnad. So he did not rely on Al-Mubarak in that. And he did not hear from Al-Dahhak bin Sufyan anything. 64 - And he was asked about the Hadith of Al-Dahhak: The Messenger of Allah, may Allah bless him and grant him peace, said: 'What is your food?' In Al-Musnad. He said: A Basri Hadith, its chain is broken, because Al-Hasan did not hear from Al-Dahhak, for Al-Dahhak used to be in the desert, and he did not hear from him. 65 - He heard from Jundab bin Abdullah, but he did not hear from Abdullah bin Amr anything. And from Amr bin Taghlib. And he heard from Ibn Omar. And from Sa'd the Mawla of",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 24
  },
  {
    "serial_number": "3306114",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 56,
    "volume_number": 1,
    "text": "66 - He was asked about the Hadith of Al-Hasan from 'Aidh bin Amr. He said: It is nothing - and he shook his head - I do not see that he heard anything from him. And he did not hear from Abu Barzah Al-Aslami anything. And he did not hear from Usama bin Zaid anything. 67 - And Al-Hasan narrated from Usama from the Prophet, may Allah bless him and grant him peace: 'The cupper and the cupped break their fast.' Imam Ahmad included it in Al-Musnad. And Yunus narrated it from Al-Hasan from Abu Huraira from the Prophet, may Allah bless him and grant him peace. Imam Ahmad included it in his Musnad. And Qatada narrated it from Al-Hasan from Thawban from the Prophet, may Allah bless him and grant him peace. And Ata bin Al-Sa'ib narrated it from Al-Hasan from Ma'qil bin Yasar from the Prophet, may Allah bless him and grant him peace, in the Musnad of Ibn Hanbal. And Mutahhar narrated it from Al-Hasan from Ali from the Prophet, may Allah bless him and grant him peace.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 25
  },
  {
    "serial_number": "3306115",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 57,
    "volume_number": 1,
    "text": "Ali informed us by reading upon him, Mu'tamir informed us from his father, from Al-Hasan, from more than one of the Companions of the Prophet, may Allah bless him and grant him peace; he said: The cupper and the cupped break their fast. 68 - And he did not hear from Uqbah bin Amir anything. And he did not hear from Abu Tha'labah Al-Khushani anything. And he did not hear from Abu Huraira Al-Dawsi anything. And he did not hear from Abu Sa'id Al-Khudri anything, nor from Jabir bin Abdullah anything. 69 - From Al-Ahnaf bin Qays: Authentic (Sahih). And Al-Ahnaf has no Companionship. And from Qays bin Abbad, Mutarrif, Sa'd bin Hisham, Hattan bin Abdullah Al-Raqashi, and Sa'sa'ah bin Mu'awiyah. 70 - And from Al-Hasan from Salama bin Al-Muhabbiq, he said: No one entered between them - meaning between Al-Hasan and Salama. And from Yunus from Al-Hasan from Salama bin Al-Muhabbiq in the Musnad of Ahmad: And no one entered between them. Sufyan said: Between Al-Hasan and Salama is a person. That the Prophet, may Allah bless him",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 26
  },
  {
    "serial_number": "3306116",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 58,
    "volume_number": 1,
    "text": "and grant him peace, judged regarding a man who had intercourse with the maid of his wife. He said: If he forced her, she is free and he owes her mistress her like (value). And if she obeyed him, she belongs to him and he owes her mistress her like. Sufyan said: So Abu Bakr Al-Hudhali said to Amr: Was the man named to you? He said: No. He said: He is Qabisah bin Hurayth. Sufyan said: Abu Bakr only knew him because he was from his people, from Hudhayl. 71 - From Qabisah bin Hurayth from Salama bin Al-Muhabbiq, he said: The Prophet, may Allah bless him and grant him peace, judged regarding a man who had intercourse with the maid of his wife: If he forced her, she is free and he owes her mistress her like. Imam Ahmad narrated it in his Musnad. 72 - And he was asked about the Hadith of Imran that the Prophet, may Allah bless him and grant him peace, used to command charity. He said: A Basri Hadith, Al-Hasan narrated it from Hayyaj bin Imran, and he is an unknown man, from Hayyaj Al-Burjami. 73 - From Imran, he said: I heard the Prophet, may Allah bless him and grant him peace, saying: Whoever reads the Quran, let him ask by it. A Hadith whose beginning is Kufi and its end is Basri. Al-A'mash narrated it from Khaythamah bin Abi Khaythamah. Imam Ahmad narrated it in his Musnad. And Mansur narrated it from Khaythamah. The origin of this is Basri, but the people of Kufa narrate from him, and its chain is weak, and it is a Munkar (denounced) Hadith; it only came from the path of Khaythamah from Al-Hasan.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 27
  },
  {
    "serial_number": "3306117",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 59,
    "volume_number": 1,
    "text": "74 - Ali said: The Hadith of Salama bin Al-Muhabbiq: The Prophet, may Allah bless him and grant him peace, judged regarding a man who had intercourse with the maid of his wife. He said: A Basri Hadith. Al-Hasan narrated it from Qabisah bin Hurayth from Salama bin Al-Muhabbiq. So Qatada narrated it, and Amr bin Dinar. And Ibn Uyaynah narrated it from Amr bin Dinar from Al-Hasan Al-Basri from Salama bin Al-Muhabbiq, and there is no one between Al-Hasan and Salama. Imam Ahmad included it in his Musnad. So I said to Sufyan: Qatada says: From Al-Hasan from Qabisah bin Hurayth from Salama. So Sufyan said to me: Amr said to me: Between them is a man from the people of Aslam or a person. So Al-Hudhali, meaning Abu Bakr, said: Between them is Qabisah bin Hurayth. Then Sufyan said: This Hudhali only knew that he was from the people of Aslam. And Shu'bah and Ma'mar narrated it from Qatada from Al-Hasan from Qabisah bin Hurayth from Salama. And Bakr bin Bakkar narrated it from Shu'bah from Qatada from Al-Hasan from Salama Ibn Al-Muhabbiq. And this, in my view, is false (Batil). Yunus and Ash'ath narrated it from Salama from Al-Hasan, there is no one between them. And Abdul-Malik bin Nawfal bin Musahiq narrated it - Al-Hasan heard - Mursal. It was only connected by Ma'mar bin Rashid from Qatada from Al-Hasan from Qabisah",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 28
  },
  {
    "serial_number": "3306118",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 60,
    "volume_number": 1,
    "text": "Amr bin Dinar narrated it from Al-Hasan, so he placed a man between him and Salama, not knowing who he was. 75 - And he was asked about the Hadith of Ibn Abbas from the Prophet, may Allah bless him and grant him peace, regarding Zakat al-Fitr. He said: A Basri Hadith, and its chain is Mursal. Al-Hasan and Muhammad bin Sirin narrated it from Ibn Abbas. Humayd Al-Tawil narrated it from Al-Hasan. Abu Dawood included it. And from Muhammad bin Sirin, Thabit bin Yazid (narrated) from Asim from Muhammad from Ibn Abbas. Muhammad bin Sirin. 76 - Shu'bah said: The Hadiths of Muhammad bin Sirin from Ibn Abbas, Muhammad only heard them from Ikrimah; he met him during the days of Al-Mukhtar. It was said to him: Khalid from Yunus from Ibn Sirin from Anas that the Prophet, may Allah bless him and grant him peace, was cupped and gave the cupper his wage, but he denied it and said: This is profit. He said: Shu'bah said: The Hadiths of Muhammad bin Sirin, he only heard them from Ikrimah; he met him during the days of Al-Mukhtar. And Ibn Sirin did not hear anything from Ibn Abbas. Ibrahim Al-Nakha'i. 77 - Ali said: Ibrahim Al-Nakha'i did not meet anyone from the Companions of the Prophet, may Allah bless him and grant him peace. It was said to him: What about Aisha? He said: This was not narrated by anyone except Sa'id",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 29
  },
  {
    "serial_number": "3306119",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 61,
    "volume_number": 1,
    "text": "Ibn Abi Aruba from Abu Ma'shar from Ibrahim, and he is weak. And he saw Abu Juhayfah, Zaid bin Arqam, and Ibn Abi Awfa, but he did not hear from them. Hammam bin Al-Harith. 78 - Ali said: Hammam bin Al-Harith met Abu Mas'ud, Usama bin Zaid, and Abdullah bin Mas'ud. And from Hammam bin Al-Harith, he said: Omar prayed with us. And this, in my view, is an illusion (Wahm). Abdul-Rahman said: From Sufyan Al-A'mash from Ibrahim from Hammam that Omar, may Allah be pleased with him, prayed in Mecca. And the Hadith of Yahya bin Adam is nothing in my view. And he met Adi bin Hatim. And he narrated it from Abu Al-Darda, and his meeting is not denied by us, and he had met him, but he did not say 'I heard.' Masruq. 79 - And I do not put anyone ahead of Masruq in anything regarding the companions of Abdullah. And he prayed behind Abu Bakr, and met Omar and Ali, but he did not narrate from them anything.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 30
  },
  {
    "serial_number": "3306120",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 62,
    "volume_number": 1,
    "text": "And Zaid bin Thabit, and Abdullah bin Al-Mughira. This is what reached us regarding his meeting the Companions of the Prophet, may Allah bless him and grant him peace. From Al-Sha'bi, he said: I never saw anyone who was more seeking of knowledge in any horizon of the horizons than Masruq. Ziyad bin Ilaqah. 80 - Ali said: Ziyad bin Ilaqah met Umarah bin Aws, Mirdas Ibn Urwah, and Arfajah bin Shuraih. And they differed regarding the lineage of Arfajah; Yazid bin Ziyad bin Abi Al-Ja'd said: From Arfajah bin Darikh. And Abdullah bin Al-Mukhtar said: Shuraih. And Shu'bah narrated it; he said: I heard Arfajah... a word was hidden. And Al-Mughira bin Shu'bah and Usama bin Sharik.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 31
  },
  {
    "serial_number": "3306121",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 63,
    "volume_number": 1,
    "text": "Al-Qasim bin Abdul-Rahman. 81 - Ali said: Al-Qasim bin Abdul-Rahman did not meet anyone from the Companions of the Messenger of Allah, may Allah bless him and grant him peace, other than Jabir bin Samura. It was said to him: Did he meet Ibn Omar? He said: He used to narrate two Hadiths from Ibn Omar, but he did not hear anything from Ibn Omar. He used to narrate from Ibn Omar, may the mercy of Allah be upon him: 'Between the East and the West is a Qibla,' and another Hadith. Salim bin Abi Al-Ja'd. 82 - Salim bin Abi Al-Ja'd had met a number of the Companions of the Messenger of Allah, may Allah bless him and grant him peace. He met Jabir bin Abdullah, Abdullah bin Amr, Ibn Omar, and Al-Nu'man Ibn Bashir. And he saw Anas bin Malik, Salama bin Nu'aym, and Nabit bin Sharit. 83 - Abu Al-Hasan Muhammad bin Ahmad bin Al-Bara informed us in the month of Rabi' Al-Akhir in the year two hundred and eighty-eight; Ali bin Al-Madini told us: The Hadiths of Hisham from Al-Hasan, the generality of them revolve around Hawshab. As for his Hadiths from Muhammad, they are authentic (Sahih).",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 32
  },
  {
    "serial_number": "3306122",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 64,
    "volume_number": 1,
    "text": "84 - And I copied from the book of Ali bin Al-Madini, but I did not hear it: There is no one more firm (Athbat) in Ibn Sirin than Ayyub and Ibn Awn. It was said: And if they differ? He said: Ayyub is more firm. And Hisham is more firm than Khalid Al-Hadhdha in Ibn Sirin. And all of them are firm (Thabt). And likewise is Salama bin Alqama and Asim Al-Ahwal. And there is no one among the people like Ayyub and Ibn Awn. And Yunus is more firm in Al-Hasan than Ibn Awn. And Yazid bin Ibrahim is more firm in Al-Hasan. And Hisham Al-Dastuwa'i is firm. 85 - And Ismail bin Muslim Al-Abdi, and he was the judge of the Island, the Island of the Sea. He only narrated around thirty or forty Hadiths. And Ismail bin Muslim Al-Makki, his Hadith is not written. Abu Uthman Al-Nahdi. 86 - Ali said: Abu Uthman Al-Nahdi is Abdul-Rahman bin Mall. He was from the Jahiliyyah (pre-Islamic era), trustworthy (Thiqah). He met Omar, Ibn Mas'ud, Abu Bakr, Sa'd, and Usama. And he narrated from Abu Musa and from Ubayy bin Ka'b. And he said in some of his Hadith:",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 33
  },
  {
    "serial_number": "3306123",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 65,
    "volume_number": 1,
    "text": "Ubayy bin Ka'b. And he had caught the time of the Prophet, may Allah bless him and grant him peace. 87 - And I copied from the book of Ali bin Al-Madini, but I did not hear it from him: Abu Uthman Al-Nahdi, and his name is Abdul-Rahman bin Mall, and it is said Mull. His origin is Kufi, and he went to Basra afterwards. He is from the Arabs. He caught the Jahiliyyah and emigrated to Medina after the death of Abu Bakr, and coincided with the succession of Omar. He heard from Omar. And he narrated from Ali bin Abi Talib. And he narrated from Sa'd Ibn Malik, Sa'id bin Zaid, Usama bin Zaid, and from Abu Bakrah, Abu Barzah Al-Aslami, Ubayy bin Ka'b, Mujashi' bin Mas'ud, Amr bin Al-Aas, Abdullah bin Amr, Ibn Omar, Ibn Abbas, Qabisah bin Mukhariq, Abdul-Rahman bin Abi Bakr, Ibn Mas'ud, Hudhayfah, Salman Al-Farisi, Abu Huraira, Abu Sa'id Al-Khudri, Jabir bin Abdullah, and Abu Musa Al-Ash'ari. And from the Tabi'un: Amir bin Malik from Safwan bin Umayyah; I do not know this Amir bin Malik, nor do I know anyone who narrated from him other than him. And he narrated from Abdullah bin Amir from Al-Zubayr.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 34
  },
  {
    "serial_number": "3306124",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 66,
    "volume_number": 1,
    "text": "And from Anas bin Jandal from Abu Musa Al-Ash'ari. And Mutarrif bin Auf from Abu Dharr. And from Ziyad bin Abi Sufyan bin Mina, and Ibn Mayyash, and Jundab bin Ka'b. Ata bin Abi Rabah. 88 - Ali said: Ata bin Abi Rabah met Abdullah bin Omar. And he saw Abu Sa'id Al-Khudri; he saw him circumambulating the House (Kaaba) but did not hear from him. And Jabir and Ibn Abbas. And he saw Abdullah bin Amr. And he did not hear from Zaid bin Khalid Al-Juhani, nor from Umm Salama, nor from Umm Hani. And he heard from Abdullah bin Al-Zubayr and Ibn Omar. And he did not hear from Umm Kurz anything. And he narrated from Umm Habibah bint Maysarah from Umm Kurz. And he heard from Aisha and Jabir bin Abdullah. Habib bin Thabit. 89 - Ali said: Habib bin Thabit met Ibn Abbas and heard from Aisha, but did not hear from other than these two from the Companions of the Messenger of Allah, may Allah bless him and grant him peace. Abu Rashid. 90 - Ali said: And Abu Shaybah bin Abi Rashid - or Rashid - narrated from Ubaydah bin Umayr.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 35
  },
  {
    "serial_number": "3306125",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 67,
    "volume_number": 1,
    "text": "Al-A'mash narrated from him. Sufyan told us from him. Ibn Jurayj narrated from him, except that Ibn Jurayj says 'Shaybah told me.' Abu Al-Abbas. 91 - Ali said: The name of Abu Al-Abbas the poet is Al-Sa'ib bin Farrukh. He used to narrate from Abdullah bin Omar. Habib bin Abi Thabit, Abu Al-Zubayr, and Amr bin Dinar narrated from him. Ziyad bin Ilaqah. 92 - Ali said: Ziyad met Sa'd in my view, and he was old. He had met a number of the Companions of the Messenger of Allah, may Allah bless him and grant him peace. He met Al-Mughira bin Shu'bah and Jarir bin Abdullah, and men from the Companions of the Prophet, may Allah bless him and grant him peace, from whom no one other than him narrated; among them are Usama bin Sharik, Arfajah bin Shuraih, and Qutbah bin Malik - except that Abdul-Malik bin Umayr narrated from Qutbah bin Malik. Abu Razin. 93 - Abu Razin is the Mawla of Abu Wa'il; his name is Mas'ud. Mansur, Al-A'mash, Asim, and others narrated from him. And he was forbearing (Halim). 93 - Abu Maryam Al-Asadi. 94 - Ali said: Abu Maryam Al-Asadi, his name is Abdullah bin Ziyad. Shamr bin Atiyyah, Ash'ath bin Sulaym Al-Muharibi, and Abu Husain narrated from him. Al-Asadi. 94 - Nu'aym bin Hakim. 95 - Ali said: And Yahya bin Sa'id Al-Qattan has narrated from Nu'aym bin Hakim.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 36
  },
  {
    "serial_number": "3306126",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 68,
    "volume_number": 1,
    "text": "And Abu Awana, Muhammad bin Bishr Al-Abdi, and Ubayd Allah bin Musa. And he mentioned a Hadith, so he said: Shababa bin Siwar Al-Fazari told us with it, Nu'aym bin Hakim told me. Ata Al-Shami. 96 - Ali said: Ata Al-Shami is, in my view, Ata bin Yazid, because he used to dwell in Ramla. And Ata was trustworthy (Thiqah); people narrated from him, and Suhail bin Abi Salih, and Abu Ubayd the companion of Sulayman bin Abdul-Malik. And Hilal bin Maymun Al-Ramli narrated from him. And Ata bin Yazid met the Companions of the Prophet, may Allah bless him and grant him peace; he met Abu Ayyub, Abu Huraira, Abu Sa'id Al-Khudri, Tamim Al-Dari, and Abu Shuraih Al-Khuza'i. And we do not deny that he heard from Abu Usayd. Yusayr bin Amr. 97 - Ali said: This Yusayr is Abu Omar, from the companions of Abdullah bin Mas'ud. The people of Kufa and the people of Basra narrated from him. He was known in Kufa as Yusayr bin Amr and in Basra as Yusayr bin Jabir. So Al-Musayyib bin Rafi', Abu Ishaq Al-Shaibani, and Qays bin Yusayr - his son - narrated from him from the people of Kufa. He narrated from his father that he clothed Owais Al-Qarni with two garments from nakedness.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 37
  },
  {
    "serial_number": "3306127",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 69,
    "volume_number": 1,
    "text": "And from the people of Basra: Muhammad bin Sirin, Abu Nadra, Waqi' bin Sahban, Abu Imran Al-Jawni, and Zurara bin Abi Awfa narrated from him. We only knew that Yusayr bin Jabir is Yusayr bin Amr because Shu'bah narrates all the Hadiths of Abu Ishaq Al-Shaibani, and he says in them: Yusayr bin Amr. Al-Qasim bin Rabi'ah. 98 - Ali said: Al-Qasim bin Rabi'ah bin Jawshan Al-Ghatafani is trustworthy (Thiqah). Ayyub, Khalid Al-Hadhdha, Humayd, Uyaynah bin Abdul-Rahman, and others narrated from him. Abu Al-Mutawakkil. 99 - Ali said: The name of Abu Al-Mutawakkil is Ali bin Dawud from Banu Najiyah, from themselves (their own lineage). Qatada, Ali bin Ali Al-Rifa'i, Ismail bin Muslim Al-Abdi, Bakr bin Abdullah Al-Muzani, Humayd, Ali bin Zaid, Abu Aqil, and others narrated from him. And he was trustworthy (Thiqah). Muhammad bin Qays. 100 - Ali said: Muhammad bin Qays, Waki', Ibn Uyaynah, Hafs, Abu Nu'aym, and more than one narrated from him. Ali said: Muhammad bin Qays Al-Zayyat, Abu Zukayr Al-Nahwi - and he is Yahya bin Muhammad - narrated from him. Uthman bin Omar bin Faris narrated from him. And Abu Bakr Al-Hanafi narrated from him. And Abu Amir Al-Aqadi narrated from him.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 38
  },
  {
    "serial_number": "3306128",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 70,
    "volume_number": 1,
    "text": "Abdullah bin Al-Harith. 101 - Ali said: Abdullah bin Al-Harith is trustworthy (Thiqah). He heard from Omar, and from Uthman, Ali, Safwan bin Umayyah, Umm Hani, and Ibn Abbas. And he did not hear from Ibn Mas'ud anything. And he heard from Al-Abbas bin Abdul-Muttalib and Ka'b. Hattan bin Abdullah Al-Raqashi. 102 - Ali said: Hattan bin Abdullah Al-Raqashi, Al-Hasan, Yunus Ibn Jubayr, Abu Mijlaz, and Abu Harun Al-Ghanawi narrated from him. He is firm (Thabt). Muhammad bin Zaid bin Muhajir. 103 - Ali said: Muhammad bin Zaid bin Muhajir bin Qunfudh Al-Tamimi, from the clan of Abu Bakr, is a Qurashi. Bishr bin Al-Mufaddal, Hafs, and Al-Darawardi narrated from him. Nu'aym bin Abi Al-Hind. 104 - Ali said: Nu'aym bin Abi Al-Hind Al-Ashja'i, Ayyub and Al-Zubayr narrated from him.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 39
  },
  {
    "serial_number": "3306129",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 71,
    "volume_number": 1,
    "text": "Ibn Al-Khirrit and Salama bin Kuhayl. And Abu Malik Al-Ashja'i and others narrated from him. His Kunyah is not known. Shu'bah had met him and narrated one Hadith from him. Ya'qub bin Zaid bin Talha. 105 - Ali said: And he mentioned Ya'qub bin Zaid bin Talha bin Abdullah bin Jud'an. He said: And this is a known Sheikh. Sufyan bin Uyaynah and Malik Ibn Anas narrated from him. 106 - Ja'far bin Awn said: Musa bin Ubayda told us from Ya'qub bin Zaid from Abu Umamah bin Sahl bin Hanif from his father, he said: The Messenger of Allah, may Allah bless him and grant him peace, said: Whoever says 'Peace be upon you.' Yazid bin Hurmuz. 107 - Ali said: And he mentioned Yazid. He said: And they claimed that Yazid is Yazid bin Hurmuz. And Muhammad bin Ali bin Husain, Al-Zuhri, Amr bin Dinar, Qays bin Sa'd, and Sa'id Al-Maqburi narrated from this Yazid bin Hurmuz. Sulayman bin Qannah. 108 - Ali said: Sulayman bin Qannah - and Qannah is his mother - I know his dwelling in Basra.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 40
  },
  {
    "serial_number": "3306130",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 72,
    "volume_number": 1,
    "text": "Humayd, Ali bin Zaid, Asim Al-Jahdari, and Musa bin Abi Aisha narrated from him. The Companions of Thabit. 109 - Ali said: There was no one among the companions of Thabit more firm (Athbat) than Hammad Ibn Salama, then after him Sulayman bin Al-Mughira, then after him Hammad bin Zaid - and they are authentic (Sahih). And Humayd narrated something from him. As for Ja'far, he narrated abundantly from Thabit and wrote Mursal narrations, and there were Munkar (denounced) Hadiths in them. And from Thabit from the Prophet, may Allah bless him and grant him peace: 'One of you asks his Lord, Exalted is He, until he asks Him for the shoelace of his sandal and salt.' And in the Hadiths of Ma'mar from Thabit are strange (Gharaib) and denounced (Munkara) Hadiths; he made Thabit from Anas that the Prophet, may Allah bless him and grant him peace, was such-and-such - a thing he mentioned. But this is only the Hadith of Aban bin Abi Ayyash from Anas. And regarding Thabit in the story of Habib, he said: Abdul-Razzaq told us from Ma'mar; no one other than him narrated it from Thabit. 110 - Ali said regarding the report of Bahz from Hammad bin Salama: He said: I used to check (turn over) Thabit Al-Bunani's Hadith. Salim bin Abi Al-Ja'd. 111 - Ali said: Salim bin Abi Al-Ja'd did not meet Ibn Mas'ud.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 41
  },
  {
    "serial_number": "3306131",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 73,
    "volume_number": 1,
    "text": "And Tawus did not hear anything from Mu'adh b. Jabal. Ali said: Ali b. Hashim b. al-Barid was truthful (saduq) but was weak. 112 - Defects of the Hadith: Whoever is appointed to the judiciary. Ali said: The Hadith of Abu Hurayrah from the Prophet, may Allah bless him and grant him peace: 'Whoever is appointed to the judiciary has been slaughtered without a knife.' He said: Ibn Abi Dhi'b narrated it from Uthman b. Muhammad al-Akhnasi. And this Uthman narrated rejected/denounced narrations (Manakir) from Sa'id b. al-Musayyib from Abu Hurayrah. And Abdullah b. Ja'far narrated it, contradicting Ibn Abi Dhi'b in its chain of transmission (Isnad); he narrated it from al-Akhnasi from al-Maqburi and Abdur-Rahman al-A'raj from Abu Hurayrah.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 42
  },
  {
    "serial_number": "3306132",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 74,
    "volume_number": 1,
    "text": "And the Hadith, in my view, is the Hadith of al-Maqburi. Deaths of some Hadith Scholars: 113 - Ayyub died in the year [one hundred and] thirty-one in the plague. Yunus died in the year [one hundred and] thirty-nine. Ibn Awn died in the year fifty [one hundred and fifty]. Hisham died in the year forty-eight. Ibrahim al-Nakha'i died in the year ninety-five. Sa'id b. Jubayr was killed in the year ninety-five, and in it died al-Hajjaj. Hisham b. Sa'd died in the year one hundred and sixty. Abu Awanah died in the year seventy-five [one hundred and seventy-five]. Bishr b. al-Mufaddal, Muhammad b. Sawa, Fudayl b. Iyad, and Mu'tamir died in the year eighty-seven [one hundred and eighty-seven]. Abu Mu'awiyah died in the year ninety-five [one hundred and ninety-five]. Ibn Umar died seventeen years after the death of Mu'awiyah. Qatadah died in the year one hundred and seventeen, and he was fifty-six years old. Malik died while he was eighty-four; he died in the year seventy-nine [one hundred and seventy-nine]. Abu al-Ahwas and Hammad b. Zayd [also died then]. Malik was born in the year ninety-five.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 43
  },
  {
    "serial_number": "3306133",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 75,
    "volume_number": 1,
    "text": "And Tawus died in the year one hundred and four. Yazid b. Zuray' and Sufyan b. Habib died in the year eighty-two [one hundred and eighty-two]. Ath-Thawri died in the year one hundred and sixty-one. Shu'bah died in the year one hundred and sixty. Yahya b. Zakariyya b. Abi Za'idah died in the year eighty-two [one hundred and eighty-two]. Hammad b. Salamah died in the year seventy-six [one hundred and seventy-six]. 114 - Defects of the Hadith: If one of you eats, let him eat with his right hand. Ali said: The Hadith of Abu Hurayrah from the Prophet, may Allah bless him and grant him peace: 'If one of you eats, let him eat with his right hand.' He said: Nu'man b. Rashid narrated it from Ibn Shihab from Sa'id from Abu Hurayrah. And Ma'mar narrated it from al-Zuhri from Salim from his father. And Ibn Uyayanah and Salih b. Kaysan narrated it from al-Zuhri from Abu Bakr b. Ubaydullah from Ibn Umar (Sunan al-Darimi). And Abdur-Rahman b. Ishaq narrated it just as Ibn Uyayanah narrated it. And Juwayriyah narrated it from Malik from al-Zuhri from Abu Bakr b. Ubaydullah from Ibn Umar (Sunan al-Darimi). So what Ma'mar narrated from al-Zuhri from Abu Bakr b. Ubaydullah is Mursal (hurried/disconnected). And the Hadith of al-Nu'man is Munkar (denounced); no one followed him in it. And the Hadith of Malik is like the Hadith of Juwayriyah; it is old and he used to support/connect it.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 44
  },
  {
    "serial_number": "3306134",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 76,
    "volume_number": 1,
    "text": "115 - Defects of the Hadith: Whoever prays over a funeral procession. Sufyan narrated it from Abdul-Malik b. Umayr from Salim al-Barrad from Abu Hurayrah. And Ibn Abi Khalid narrated it from Salim al-Barrad from Ibn Umar (Imam Ahmad cited it in the Musnad). And the Hadith, in my view, is the Hadith of Abu Hurayrah. And the Hadith of Ibn Abi Khalid is an illusion (wahm)—meaning the Hadith of 'Whoever prays over a funeral procession'. 116 - Defects of the Hadith: Our camping place tomorrow, if Allah wills, is at the Khayf of Bani Kinanah. Ali said: The Hadith of Abu Hurayrah from the Prophet, may Allah bless him and grant him peace: 'Our camping place tomorrow, if Allah wills, is at al-Khayf at the time of Duha (forenoon).' Al-Zuhri narrated it, and there was disagreement regarding al-Zuhri in its chain of transmission. Al-Awza'i, Ibrahim b. Sa'd, al-Nu'man b. Rashad [Rashid], and Ibrahim b. Isma'il b. Majma' all narrated it from al-Zuhri from Abu Salamah from Abu Hurayrah.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 45
  },
  {
    "serial_number": "3306135",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 77,
    "volume_number": 1,
    "text": "Except that Ma'mar inserted it into the Hadith of Ali b. Husayn from Amr b. Uthman from Usamah b. Zayd: 'Did Aqil leave us any dwelling?' so he inserted the speech 'Our camping place tomorrow' into it. And Muhammad b. Abi Hafsah narrated it from al-Zuhri from Ali b. Husayn from Amr b. Uthman from Usamah, and he did not mention in it 'Our camping place at al-Khayf'. Defects of the Hadith: That the Prophet saw a man supplicating raising his hands. 117 - Ali said: The Hadith of Abu Hurayrah that the Prophet, may Allah bless him and grant him peace, saw a man supplicating raising his hands, is from al-Qa'qa' from Abu Salih from Abu Hurayrah. And Jarir narrated it from al-A'mash from Abu Salih as Mursal (disconnected). And Abu Mu'awiyah narrated it from al-A'mash from Abu Salih from Sa'id. And Waki' narrated it from al-A'mash from the Prophet, may Allah bless him and grant him peace, that he saw Sa'd. And the Hadith, in my view, is the Hadith of al-Qa'qa'. And Abu Mu'awiyah used to say in the Hadith 'that'. 118 - Ali said: The Hadith of Abu Hurayrah: 'The likeness of the one who goes early to the Friday prayer...'",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 46
  },
  {
    "serial_number": "3306136",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 78,
    "volume_number": 1,
    "text": "Ma'mar and the companions of al-Zuhri narrated it from al-Agharr from Abu Hurayrah, except that Ibn Uyayanah narrated it from al-Zuhri from Abu Sa'id from Abu Hurayrah. And all of them are authentic (Sahih). 119 - Ali said: The Hadith of Abu Hurayrah: 'Whoever believes in Allah and the Last Day, let him honor his neighbor.' He said: Malik and Ibn Ajlan narrated it from Sa'id al-Maqburi from Abu Shurayh al-Khuza'i. And Abdur-Rahman b. Ishaq narrated it, contradicting them both, so he narrated it from Sa'id al-Maqburi from Abu Hurayrah. And the Hadith, in my view, is the Hadith of Malik and Ibn Ajlan; and Abdur-Rahman b. Ishaq erred. 120 - Ali said: The Hadith of Abu Hurayrah from the Prophet, may Allah bless him and grant him peace: 'Whoever lies down in a place where he does not remember Allah in it, there will be regret/vengeance upon him.' He said: Ibn Ajlan narrated it from Sa'id from Abu Hurayrah. Ibn Abi Dhi'b narrated it and inserted a man between Sa'id and Abu Hurayrah.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 47
  },
  {
    "serial_number": "3306137",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 79,
    "volume_number": 1,
    "text": "So he narrated it from Sa'id from Abu Ishaq, the client (Mawla) of Abdullah b. al-Harith, from Abu Hurayrah. And Salih, the client of al-Taw'amah, narrated it from Abu Hurayrah. 121 - Ali said: The Hadith of Abu Hurayrah that the Prophet, may Allah bless him and grant him peace, used to seek refuge from four things, saying: 'O Allah, I seek refuge in You from a heart that is not humble, and from a soul that is not satisfied.' He said: Ibn Ajlan narrated it from Sa'id from Abu Hurayrah. And Ibn Abi Dhi'b narrated it and inserted a man between Sa'id and Abu Hurayrah, so he narrated it from Sa'id from Abdur-Rahman b. Mihran from Abu Hurayrah. 122 - Ali said: The Hadith of Abu Hurayrah that the Prophet, may Allah bless him and grant him peace, sent Abdullah b. Hudhafah to circulate through Mina. He said: Salih b. Abi al-Akhdar narrated it from al-Zuhri from Sa'id from Ibn al-Musayyib from Abu Hurayrah. And Ma'mar narrated it from al-Zuhri from Mas'ud b. al-Hakam that the Prophet, may Allah bless him and grant him peace, sent Ibn Hudhafah. And the Hadith is the Hadith of Ma'mar; and the Hadith of Salih is a mistake. Defects of the Hadith: I have been ordered to fight the people until they say 'There is no god but Allah'. 123 - Ali said: And the Hadith of Abu Hurayrah that the Prophet, may Allah bless him and grant him peace, said: 'I have been ordered to fight the people until they say There is no god but Allah.'",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 48
  },
  {
    "serial_number": "3306138",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 80,
    "volume_number": 1,
    "text": "He said: Salih narrated it from Ibn Shihab from Ibn al-Musayyib from Abu Hurayrah (Muslim included it). And Uqayl (264b) narrated it, contradicting Salih in its chain, so he narrated it from Ubaydullah b. Abdullah and from Abu Hurayrah from Umar b. al-Khattab. And Ibn Uyayanah narrated it from Abu Hurayrah as Mursal. And Ma'mar narrated it from al-Zuhri from Ubaydullah as Mursal. And Sufyan b. Husayn narrated it from al-Zuhri from Ubaydullah from Abu Hurayrah. And Imran al-Qattan narrated it, contradicting them all, so he narrated it from Ma'mar from al-Zuhri from Anas from Abu Bakr. And the Hadith is the Hadith of Ubaydullah. 124 - Ali said: The Hadith of Abu Hurayrah: 'There was between Khallad and Abdur-Rahman b. Awf some of what occurs between people.' He said: Za'idah narrated it from Asim from Abu Salih from Abu Hurayrah. And al-A'mash narrated it, contradicting Asim in its chain, so he narrated it from Abu Salih from Abu Sa'id. And it is not preserved from the Hadith of Suhayl; and al-A'mash is more established regarding Abu Salih than others.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 49
  },
  {
    "serial_number": "3306139",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 81,
    "volume_number": 1,
    "text": "Defects of the Hadith: If the slave girl of one of you commits adultery. 125 - Ali said: The Hadith of Abu Hurayrah from the Prophet, may Allah bless him and grant him peace: 'If the slave girl of one of you commits adultery and her adultery becomes evident, let him flog her.' Ibn Ishaq narrated it from Sa'id b. Abi Sa'id al-Maqburi from Abu Hurayrah. And Abdur-Rahman b. Ishaq narrated it from Sa'id, saying 'I heard Abu Hurayrah.' So I looked, and found that Sa'id did not hear it from Abu Hurayrah. And Ibn Ishaq and Layth b. Sa'd narrated it from Sa'id b. Abi Sa'id from his father from Abu Hurayrah. And Ayyub b. Musa narrated it from Sa'id from Abu Hurayrah. And the Hadith, in my view, is the Hadith of Sa'id from his father from Abu Hurayrah. And the Hadith of Abdur-Rahman b. Ishaq from Sa'id saying 'I heard Abu Hurayrah saying' is an illusion (wahm), and I fear that he did not memorize it. Defects of the Hadith: One suck or two sucks (of breastfeeding) do not prohibit (marriage). 126 - Ali said: The Hadith of Abu Hurayrah from the Prophet, may Allah bless him and grant him peace:",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 50
  },
  {
    "serial_number": "3306140",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 82,
    "volume_number": 1,
    "text": "'One suck or two sucks do not prohibit.' Ya'qub b. Ibrahim b. Sa'd narrated it from his father from Ibn Ishaq from Hisham b. Urwah from his father from Abdullah b. al-Zubayr from al-Hajjaj b. Abi al-Hajjaj from Abu Hurayrah. And this is a mistake. And Yahya b. Sa'id narrated it from Hisham b. Urwah from his father from Abdullah b. al-Zubayr from the Prophet, may Allah bless him and grant him peace. And Hisham b. Urwah narrated it from his father from al-Hajjaj b. Abi al-Hajjaj that he asked the Prophet, may Allah bless him and grant him peace: 'What removes from me the obligation/blame of breastfeeding?' He said: 'A ghurrah (giving a slave) male or female.' And the Hadith of Ibn Ishaq, according to them, is an error; he inserted one Hadith into another. And the Hadith, in my view, is the Hadith of Hisham b. Urwah from his father from Abdullah b. al-Zubayr from the Prophet, may Allah bless him and grant him peace: 'One suck or two sucks do not prohibit.' And the Hadith of Hisham b. Urwah from al-Hajjaj b. Abi al-Hajjaj (265a) that he asked the Prophet, may Allah bless him and grant him peace: 'What removes the obligation/blame of breastfeeding?'",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 51
  },
  {
    "serial_number": "3306141",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 83,
    "volume_number": 1,
    "text": "And from Hisham b. Urwah from al-Hajjaj b. Abi al-Hajjaj from Abu Hurayrah: 'Breastfeeding is what splits the intestines.' And the statement is Abu Hurayrah's. And the three Hadiths are authentic (Sahih), but the Hadith of Ibn Ishaq is an illusion (wahm). 127 - Ali said: The Hadith of Abu Hurayrah: 'The Messenger of Allah, may Allah bless him and grant him peace, sent a reconnaissance expedition and appointed Asim b. Thabit over them.' Ma'mar narrated it from al-Zuhri from Amr b. Abi Sufyan al-Thaqafi from Abu Hurayrah. And Yunus narrated it from al-Zuhri from Amr b. Usayd b. Jariyah al-Thaqafi from Abu Hurayrah, contradicting Ma'mar in its chain. And the Hadith, in my view, is the Hadith of Yunus because others followed him on [the name] Amr b. Usayd, and it is the correct one. 128 - The Hadith of Abu Hurayrah from the Prophet, may Allah bless him and grant him peace: 'None of you should wish for death.' Muhammad b. Abi Hafsah narrated it from Ibn Shihab from Abu Ubayd, the client of Abdur-Rahman b. Awf, from Abu Hurayrah.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 52
  },
  {
    "serial_number": "3306142",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 84,
    "volume_number": 1,
    "text": "And Yunus narrated it from al-Zuhri from Abu Ubayd from Abu Hurayrah, so he followed Ibn Abi Hafsah. And Ibn Abi al-Akhdar and Sufyan b. Husayn contradicted them, so they narrated it from al-Zuhri from Ubaydullah from Abu Hurayrah. 129 - Ali said: The Hadith of Abu Salih from Abu Hurayrah from the Prophet, may Allah bless him and grant him peace: 'If the slave obeys his master.' He said: Hammad b. Salamah narrated it from Asim from Abu Salih from Abu Hurayrah. And al-A'mash contradicted him, so he narrated it from Abu Salamah from Ka'b. 130 - Ali said: The Hadith of Abu Salamah from Abu Hurayrah from the Prophet, may Allah bless him and grant him peace: 'The womb/kinship is a branch (shajanah) from the Merciful.' Imam Ahmad included it in the Musnad. Muhammad b. Amr narrated it from Abu Salamah from Abu Hurayrah. And it is, in my view, a mistake with no doubt in it, because al-Zuhri narrated it from Abu Salamah from Abu Rawaad al-Laythi from Abdur-Rahman b. Awf, and that is, in my view, the correct one. 131 - Ali said: Tamim b. Huways, Ma'mar and Nuh b. Qays narrated from him; he met Ibn Abbas.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 53
  },
  {
    "serial_number": "3306143",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 85,
    "volume_number": 1,
    "text": "Ali said: Muhammad b. Ja'far b. Abi Kathir is known, and he is the brother of Isma'il b. Ja'far; Mu'tamir narrated from him. Ali said: Uthman b. Hakim from Uthman b. Abi al-As is not connected; it is Mursal (disconnected) because he did not hear from Uthman. Amr b. Uthman, who narrates from Musa b. Talhah, is trustworthy, trustworthy (Thiqah Thiqah). 132 - Ali said: Dawud b. Abi Asim from Abdullah b. Abdur-Rahman; Uthman b. Abdullah b. Aws informed us from Uthman from the Prophet, may Allah bless him and grant him peace, regarding lightening the prayer. Abu Asim and Abu Nu'aym narrated it. He contradicted him regarding Abdur-Rahman; this Abdur-Rahman narrates from Abdul-Rabbuh b. Uthman. And I think he was confused by the Sheikh, because Abu Amir and Abu Nu'aym agreed on Asim, and I think he said (265b): Abu Asim is more knowledgeable about the Hadith of this Sheikh, and I think he was confused by the Sheikh. 133 - Ali said: The Hadith of Umar that he complained to the Messenger of Allah, may Allah bless him and grant him peace, about whispering (waswasah). Al-Hakam b. Abdul-A'la narrated it from al-Jariri from Abu al-Ala from Uthman b. Abi al-As.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 54
  },
  {
    "serial_number": "3306144",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 86,
    "volume_number": 1,
    "text": "And Hammad b. Salamah narrated it from al-Jariri from Abu al-Ala from Mutarrif from Uthman. And Abu al-Ala heard from Uthman, so he inserted Mutarrif between Uthman and himself. 134 - Ali said: Isra'il is weak. Ali said: Anbasah al-Basri who narrated from al-Hasan, Abdul-Wahhab al-Thaqafi narrated from him; he is weak. 135 - Ali said: Ibrahim b. al-Hasan al-Kindi narrated from Abdullah b. Isa from Abu al-Hakam, the client of Uthman b. Abi al-As, from Uthman from the Prophet, may Allah bless him and grant him peace: 'A child of adultery does not enter Paradise.' He said: As for Ibrahim b. al-Hasan and Abdullah b. Isa, they are unknown (Majhulan), and he weakened them and said: I do not know them. 136 - Ali said: Ghadirah b. Urwah al-Faqimi is an unknown Sheikh; no one narrated from him other than Asim b. Hilal. 137 - Ali said: The Hadith of Yunus and Ali b. Zayd from al-Hasan from a man from Bani Salit: 'I came to the Prophet, may Allah bless him and grant him peace, in a crowd (Azfalah) of people.' The Imam included it in the Musnad. I asked about this man, and he said: He is Ulathah b. Sahhar al-Saliti. 138 - Ali said: The Hadith of Abu Rifa'ah: 'I came to the Prophet, may Allah bless him and grant him peace, while he was on a chair of iron.' Sulayman b. al-Mughirah narrated it.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 55
  },
  {
    "serial_number": "3306145",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 87,
    "volume_number": 1,
    "text": "from Abu Hilal from Abu Rifa'a, and in my view, he did not meet Abu Rifa'a. And if Humayd was... some of them narrated from Humayd bin Hilal from Abu Al-Dahma and Abu Qatada from a man. And the name of Abu Rifa'a is Tamim bin Asad. 139 - Ali said: Abdul-Aziz bin Bashir bin Ka'b, Abu Na'amah narrated from him. He narrated from Sulayman bin Amir bin Abi Tahya 'they sought refuge against him,' so he said: Unknown (Majhul), we do not know him. Ka'b is known, an Adawi. And the name of Abu Na'amah is Amr bin Isa. Ali said: Al-Rabab who narrated from Salman bin Amir is Umm Al-Rabi' bint Sulay'. Ali said: Abu Al-Ushara Al-Darimi, Hammad bin Salama narrated from him; no one other than Hammad narrated from him. Ali said: The Hadith of Abdul-Rahman bin Khanbash 'The devils descended from the mountain passes and valleys upon the Messenger of Allah, may Allah bless him and grant him peace...' Abu Al-Tayyah narrated it from Abdul-Rahman bin Khanbash. And Abu Al-Tayyah is known, Yazid bin Humayd. And Ibn Khanbash, no one narrated from him except Abu Al-Tayyah. And I saw in the book of Abu Al-Tayyah 'from Abdullah bin Khanbash,' and it is a mistake; it is only Abdul-Rahman. 141 - Ali said: Husayn bin Abi Al-Hurr is known, narrated from him...",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 56
  },
  {
    "serial_number": "3306146",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 88,
    "volume_number": 1,
    "text": "Abdul-Malik 266 Ibn Umayr. 142 - Ali said: The Hadith of Arfajah bin As'ad 'his nose was hit on the day of Al-Kulab' (Ahmad included it in Al-Musnad). Abu Al-Ashhab narrated it from Abdul-Rahman bin Tarafa from Arfajah bin As'ad bin Karr (b). He said: And his grandfather narrated from his grandfather Arfajah bin As'ad. 143 - Ali said: Dirghamah bin Alibah Al-Ghanawi, no one narrated from him except Qurrah bin Khalid. Ali said: Muhammad bin Masmul is a Sheikh from the people of Mecca, and I caught (met) him. Ali said: Ubayd Allah bin Salama bin... and Hammad... I do not know this Ubayd Allah.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 57
  },
  {
    "serial_number": "3306147",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 89,
    "volume_number": 1,
    "text": "Ali said: Bahz bin Hakim is trustworthy (Thiqah). Ali said: Regarding Abu Qaza'ah Al-Bahili, he is trustworthy, and his name is Suwayd bin Hujayr. 144 - Ali said: The Hadith of Al-Jarud bin Al-Mu'alla from the Prophet, may Allah bless him and grant him peace: 'The stray animal...' Abu Al-Ala narrated it from Mutarrif from Abu Muslim Al-Jadhmi from Al-Jarud alone. And Humayd narrated it from Al-Hasan from Mutarrif from his father; Humayd contradicted Abu Al-Ala. 145 - Ali said: Thabit from Al-Jarud, so he said: He did not meet Al-Jarud. Ali said: Ya'ish, from whom Al-Harith bin Murrah narrated, is unknown; no one narrated from him except Al-Harith. Ali said: Abdul-Malik bin Qatada, Anas bin Sirin narrated from him; no one narrated from him except Anas. 146 - Ali said: The Hadith of Salman regarding Ghusl (washing) on Friday (Imam Ahmad included it in Al-Musnad). Ibn Abi Dhi'b narrated it from Sa'id Al-Maqburi, he informed me from Abdullah bin Wadi'ah from Salman.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 58
  },
  {
    "serial_number": "3306148",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 90,
    "volume_number": 1,
    "text": "And Ibn Abi Dhi'b contradicted Ibn Ajlan, for he narrated it from Sa'id Al-Maqburi from his father from Abdullah bin Wadi'ah from Abu Dharr. And the Hadith, in my view, is the Hadith of Salman because he narrated it from Ibn Abi Ma'shar from Sa'id Al-Maqburi from Ibn Wadi'ah from Salman and did not say 'from his father,' and he followed Ibn Abi Dhi'b. And Mansur and Mughira narrated it from Ibrahim from Alqama from Al-Qartha' from Salman. 147 - Ali said: The Hadith of Salman 'Any man whom I reviled or cursed...' Za'idah narrated it from Omar bin Qays Al-Masir from Amr bin Abi Qurrah from a man from Salman, so he corrupted it (Imam Ahmad narrated it). And Amr bin Abi Qurrah from Salman was better. 148 - Ali said: Ubayd Zuhar is Munkar al-Hadith (denounced in Hadith). Ali said: From Sa'id bin Mas'ud Jarwal from Salman. Ali said: Abu Ishaq from Abdul-Rahman bin Zaid Al-Fayshi, and I do not know anyone who narrated from him except Abu Ishaq. Ali said: Hurayth bin Abi Hurayth asked Abdullah bin Omar. And Yunus bin Maysarah bin Halbas (narrated) from him, and I do not memorize from him other than this. Iyad bin Musafi', I think he said: Abu Bakrah informed me. And no one narrated from this one",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 59
  },
  {
    "serial_number": "3306149",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 91,
    "volume_number": 1,
    "text": "except Talha bin Abdullah bin Awf. And Al-Zuhri narrated from Talha from him. 149 - Ali said: He said: Abdul-Aziz, who is Ibn Abdul-Samad, told us, Malik bin Dinar told us from Al-Hasan that the Messenger of Allah, may Allah bless him and grant him peace, said: 'The Muslim is the brother of the Muslim, he does not wrong him nor forsake him.' Ali told us, Affan bin Muslim told us, Hammad bin Salama told us, Ali bin Zaid informed us from Al-Hasan, he said: A man from Banu Salit passed by, he said: I came to the Prophet, may Allah bless him and grant him peace, while he was in a crowd of people, so I heard him saying: 'The Muslim is the brother of the Muslim, he does not wrong him nor forsake him.' Ali said: It is said the name of this man who passed from Banu Salit is Ulathah Ibn Suhar. 150 - He said: A man from the Companions of the Prophet, may Allah bless him and grant him peace, told me that Jibril, peace be upon him, was given power over the town of the people of Lot, so he inserted his wing into its bottom. So I did not know who Bishr was, and I began wanting to know Bishr. So lo, 'Bishr' is a mistake from Abdul-Samad; rather Hammad bin Salama narrates it from Ata bin Al-Sa'ib from Abdul-Rahman bin Bishr. And this one is known; people narrated from him: Muhammad Ibn Bishr, Abu Husain, and Raja Al-Ansari. And he used to be known as Abdul-Rahman Ibn Bishr Al-Azraq. 151 - Ali said: Sufyan said: I came to Al-Harrah, so a man prayed to my side",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 60
  },
  {
    "serial_number": "3306150",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 92,
    "volume_number": 1,
    "text": "from the people of Sham (Levant), so he said: I heard Raja bin Haywah (saying) that the Messenger of Allah, may Allah bless him and grant him peace, said: 'O Allah, I ask You from the best of what You give, so give me from the best of what we ask.' And it reached me from Abu Bakr bin Ayyash that he narrated it from Mujalid from Raja bin Haywah. 152 - Ali said: The sons of Khirash are three: Rib'i, Rabi', and Mas'ud Ibn Khirash. And nothing was narrated from Mas'ud except his speech after death. Ali said: Sa'id bin Dhi La'wah is unknown. Ali said: I did not see anyone who knows Salm bin Abi Al-Dhayyal except Ismail Ibn Ibrahim, and he used to narrate from Al-Hasan; Mu'tamir heard from him, and he narrated Hadiths resembling the Hadiths of Al-Hasan. 153 - Ali said: Abu Al-Fayd, Shu'bah narrated from him. And he was asked about Abu Al-Fayd, but he did not know his name, and no one narrated from him except Shu'bah. Ali said: And no one narrated from Ziyad bin Labid except Ibrahim Al-Nakha'i. Ali said: Al-Aswad, meaning Ibn Qays, narrated from ten unknown people who are not known. Ali said: Al-Walid bin Jamil, I do not know anyone who narrated from him except Yazid bin Harun. I said to him: How are his Hadiths? He said: They resemble the Hadiths of Al-Qasim Ibn Abdul-Rahman, and he approved of him.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 61
  },
  {
    "serial_number": "3306151",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 93,
    "volume_number": 1,
    "text": "He said: And Ayyub is unknown. Ali said: Thumamah bin Uqbah Al-Bajali, no one narrated from him except Harun bin Sa'd and Al-A'mash. 154 - Ali said: Regarding the Hadith of Omar 'Verily a man is not asked regarding why he beat his wife' (Ibn Majah included it in Marriage), its chain is unknown. A man from the people of Kufa called Dawud bin Abdullah Al-Awdi narrated it; I do not know anyone who narrated from him anything except Abdul-Rahman Al-Masli, and he is, in my view, Abu Wabarah Al-Masli. 155 - Ali said: Regarding the Hadith of Omar about building the mosque, its chain is unknown. And the unknown person in its chain is Sayyar bin Al-Ma'rur; no one narrated from him except Simak bin Harb. And Yasar bin Al-Ma'rur is the one whom we know. And Ibrahim used to say 'Yasar bin...' and he is unknown. 156 - Ali said: Regarding Hadiths of Suhayb, among them the Hadith of Suhayb that the Prophet, may Allah bless him and grant him peace, used to say when he saw a town: 'O Allah, Lord of the seven heavens and what they shade...' (Al-Haithami included it in Majma' Al-Zawa'id).",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 62
  },
  {
    "serial_number": "3306152",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 94,
    "volume_number": 1,
    "text": "And among them from Salman that the Prophet, may Allah bless him and grant him peace, used to supplicate saying: 'O Allah, You are not a god whom we invented' (Al-Tabarani narrated it). 157 - And among them from Suhayb that the Prophet, may Allah bless him and grant him peace, used to say when he finished prayer: 'O Allah, rectify my religion for me.' He said: The chain of this is Madani (from Medina) from known men, except one man whom I do not memorize in anything of the Hadiths from his father; I do not memorize them from Suhayb except from this aspect: Abdul-Rahman bin Mughith. 158 - Ali said: Regarding the Hadith of the Prophet, may Allah bless him and grant him peace, 'The best of my Ummah is my generation.' This is a known Basri Hadith, except one man who heard it from Omar bin Al-Khattab, called Kahmas, a man from Banu Hilal or from Banu Salul. 159 - Ali said: Regarding the Hadith of Omar that the Prophet, may Allah bless him and grant him peace, said: 'I am holding you by your waists to keep you from the Fire.' He said: This Hadith has a Hasan (good) chain. And Hafs bin Humayd is unknown; I do not know anyone who narrated from him except Ya'qub",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 63
  },
  {
    "serial_number": "3306153",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 95,
    "volume_number": 1,
    "text": "Al-Qummi. And we did not find this Hadith from Omar except from this path. And the people of Hijaz only narrate it from the Hadith of Abu Huraira. 160 - Ali said: Al-Shaibani from Al-Hakam from Hanash bin Rabi'ah: Hanash is not known. Al-Hasan bin Al-Hurr said: From Al-Hakam from a man called Hanash. And this strengthens what Al-Shaibani said: 'Hanash bin Rabi'ah.' And we do not know Hanash bin Rabi'ah in anything of Hadith. And we do not know anyone who narrated from Malik bin Umayr except Ismail bin Sami' Al-Hanafi. 161 - Ali said: From Ibn Thumamah Al-Qushayri from Ibn Aghyad. Ali said: Fatimah came to the Prophet, may Allah bless him and grant him peace, asking him for a servant. And this is a Basri Hadith, and its chain is Basri, and it is a known chain except one man: Ibn Aghyad; I do not know a Hadith from him other than this. 162 - Ali said: Regarding the Hadith of Uthman that the Prophet, may Allah bless him and grant him peace, said: 'There is no Muslim for whom a prescribed prayer arrives, so he perfects its ablution...' (Muslim included it in his Sahih). A man from Quraysh who was in Kufa, from the children of Sa'id bin Al-Aas, narrated it. And only those who met him in Kufa met him",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 64
  },
  {
    "serial_number": "3306154",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 96,
    "volume_number": 1,
    "text": "and this is a Madani chain, and the people of Medina did not narrate anything from him. 163 - Ali said: And the Hadith of Uthman that he said: 'Whoever knows that the prayer is a truth...' (Imam Ahmad included it). Imran bin Hudayr - and he is trustworthy - narrated it from an unknown man called Abdul-Malik bin Ubayd; he narrates it from Humran. 164 - Ali said: Regarding the Hadith of Ammar from the Prophet, may Allah bless him and grant him peace, that he forbade eating the meat of sacrificial animals beyond three (days). Ibn Abi Habib narrated it from a Sheikh; I do not know anyone who narrated from him other than him, from Abu Ubayd. And Ibn Shihab has narrated this Hadith from Abu Ubayd as Mawquf (stopped at the Companion). 165 - He said: And he mentioned the Hadith of Talha regarding the graves of martyrs. He said: A trustworthy Sheikh called Muhammad bin Ma'n narrated it. And Muhammad bin Ma'n bin Nadlah bin Amr Al-Ghifari narrated it from Dawud bin Khalid bin Dinar from Rabi'ah bin Abi Abdul-Rahman from Rabi'ah bin Al-Hadir from Talha bin Ubayd Allah. And its chain is all good (Jayyid), except that this Dawud bin Khalid is not preserved (memorized/known) from him except this Hadith from any aspect.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 65
  },
  {
    "serial_number": "3306155",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 97,
    "volume_number": 1,
    "text": "166 - Ali said: And he mentioned the Hadith of Al-Zubayr from the Prophet, may Allah bless him and grant him peace: 'There is no morning except a caller calls...' Musa bin Ubayda narrated it from Muhammad bin Thabit bin Shurahbil from Banu Abd Al-Dar. And I do not know anyone who narrated from him except Musa bin Ubayda. And he narrated it from Abu Hakim Mawla... and no one narrated from this Abu Hakim except from this path. 167 - And he mentioned the Hadith of Al-Zubayr from the Prophet, may Allah bless him and grant him peace, regarding the meat of sacrificial animals. So he said: Ibn Ishaq narrated it from Abdullah bin Ata bin Ibrahim from his father. And nothing is preserved from this Abdullah bin Ibrahim other than this Hadith. And I do not know anyone who narrated from him except Ibn Ishaq. 168 - Ali said: (Al-Tirmidhi narrated it, Ahmad narrated it in Al-Musnad, Bukhari narrated it) in the Hadith of Sa'd from the Prophet, may Allah bless him and grant him peace, 'Whoever intends humiliation for Quraysh, Allah humiliates him.' So this is a Madani Hadith; in its chain are two men from whom I do not know any knowledge was narrated.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 66
  },
  {
    "serial_number": "3306156",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 98,
    "volume_number": 1,
    "text": "Ya'qub bin Ibrahim told us it from his father from Salih bin Kaysan from Ibn Shihab from Muhammad bin Abi Sufyan from Muhammad bin Sa'd bin Abi Waqqas from his father, he said: I heard the Messenger of Allah, may Allah bless him and grant him peace, saying: 'Whoever humiliates Quraysh, Allah humiliates him.' So Ya'qub bin Ibrahim left out one of the two men whom we described as having nothing narrated from them, so he named Muhammad bin Abi Sufyan and left the other. And from Muhammad bin Sa'd from his father that the Messenger of Allah, may Allah bless him and grant him peace, said: 'Whoever intends humiliation for Quraysh, Allah humiliates him.' So Abu Ayyub Al-Hashimi named the man whom Ya'qub bin Ibrahim bin Sa'd did not name, and he is Yusuf Abu Al-Hajjaj Ibn Yusuf. 169 - Ali said: The Hadith of Ibn Mas'ud that the Prophet, may Allah bless him and grant him peace, used to dislike ten traits (Al-Nasa'i included it). This is a Kufi Hadith, and in some of its chain is one who is not known in this path. And Al-Rukin bin Al-Rabi' narrated it from Al-Qasim bin Hassan from Abdul-Rahman Ibn Harmala from Ibn Mas'ud. And I do not know anyone who narrated from this Abdul-Rahman bin Harmala anything except from this path, and we do not know him among the companions of Abdullah. 170 - Ali said: The Hadith of Ibn Mas'ud from the Prophet, may Allah bless him and grant him peace, that he said: 'Give charity, O assembly of women,' the Hadith (Al-Nasa'i included it). He said: Mansur narrated it",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 67
  },
  {
    "serial_number": "3306157",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 99,
    "volume_number": 1,
    "text": "and Al-Hakam and Al-A'mash from Dharr bin Abdullah Al-Hamadani from Wa'il bin Mahana. And we do not know anyone who narrated from Wa'il bin Mahana except Dharr. 171 - Ali said: Regarding the Hadith of Ibn Mas'ud from the Prophet, may Allah bless him and grant him peace, regarding killing the delegation, the Hadith (Al-Darimi narrated it). He narrated it from Asim bin Bahdala. And Abu Bakr bin Ayyash narrated it, so he made the chain excellent. 172 - Ali said: Regarding the Hadith of Ibn Mas'ud that the Prophet, may Allah bless him and grant him peace, cut (the hand of) a man from the Ansar. So this is a Hadith narrated by Yahya bin Abdullah Al-Jabiri - and he is known - from a man whose Kunyah is Abu Majid Al-Hanafi. And we do not know anyone who narrated from this Abu Majid except Yahya Al-Jabiri. So I heard Sufyan bin Uyaynah say: I said to Yahya Al-Jabiri - and I tested him - 'Who is this Abu Majid?' He said: 'A Sheikh who came upon us from Basra.' And Abu Majid has narrated more than one Munkar Hadith. 173 - Ali said: Regarding the Hadith of Ibn Mas'ud that the Prophet, may Allah bless him and grant him peace, used to not sit except the duration of saying 'O Allah, You are Peace' (Al-Nasa'i included it). Asim Al-Ahwal narrated it from a man called Awsaja bin Al-Rammah. And we do not know anyone who narrated from this Awsaja except Asim Al-Ahwal. And I do not think it is anything but this (an error/confusion) because he narrates it from Ibn Abi Al-Hudhayl. And Ibn Abi Al-Hudhayl is Kufi, from the companions of Abdullah, and his name is Abdullah bin Abi Al-Hudhayl, and his Kunyah is Abu Al-Mughira. And I do not memorize this from Abdullah bin Mas'ud except from this path",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 68
  },
  {
    "serial_number": "3306158",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 100,
    "volume_number": 1,
    "text": "And he has narrated from Aisha from the Prophet, may Allah bless him and grant him peace. 174 - Ali said: Regarding the Hadith of Ibn Mas'ud regarding the Night of the Jinn. More than one narrated it from Abdullah, among them Alqama, Abu Uthman Al-Nahdi, Amr Al-Bikali, Abu Uthman bin Sunnah Al-Khuza'i, and Abu Zaid the Mawla of Amr bin Hurayth. As for Alqama, he used to deny that Ibn Mas'ud was with him on the Night of the Jinn, and he was the most knowledgeable of them about Abdullah. As for Abu Uthman Al-Nahdi, Al-Taymi narrated it from Abu Uthman and did not elevate it (to the Prophet). Abu Tamimah Al-Sulami narrated it from Abu Uthman from Abdullah. And Yahya narrated it from Ja'far bin Maymun. And he narrated it from Abu Tamimah from Abu Uthman from Abdullah. So in my view, it was Abu Uthman Al-Nahdi due to the narration of Al-Taymi from Abu Uthman from Ibn Mas'ud regarding part of the Hadith. And Sulayman Al-Taymi narrated it from another path from Abu Tamimah from Amr Al-Bikali, that he narrated it with wording other than the wording of Abu Uthman. And Ibn Shihab narrated it from Abu Uthman bin Sunnah Al-Khuza'i from Ibn Mas'ud, and with wording other than the wording of Amr Al-Bikali. And Sufyan narrated it from Abu Fazara from Abu Zaid the Mawla of Amr bin Hurayth from Abdullah bin Mas'ud. So I feared that Abu Zaid did not hear it from Abdullah because I did not know him and I did not know his title (Laqab). So Sharik narrated it from Abu Fazara from",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 69
  },
  {
    "serial_number": "3306159",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Al-Ilal (The Defects)",
    "edition": "Second, 1980",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 101,
    "volume_number": 1,
    "text": "Abu Zaid, he said: Abdullah bin Mas'ud told us. So he improved it (made it excellent/clear) by his saying 'Abdullah bin Mas'ud told us.' 175 - Ali said: Regarding the Hadith of Ibn Mas'ud from the Prophet, may Allah bless him and grant him peace, he said: 'Verily your companion is the Close Friend (Khalil) of Allah.' Abdul-Malik bin Umayr narrated it from Khalid bin Rib'i from Abdullah bin Mas'ud from the Prophet, may Allah bless him and grant him peace. And this is a Kufi Hadith; Abdul-Malik narrated it, and no one narrates from this Khalid bin Rib'i anything other than this Hadith. 176 - Ali said: Regarding the Hadith of Abdullah from the Prophet, may Allah bless him and grant him peace, he said: 'There is no night conversation (Samar) except for a praying person or a traveler' (Imam Ahmad included it in Al-Musnad). Mansur narrated it from Khaythamah from a man from Abdullah. And in its chain is a disconnection (Inqita') from the side of this man whom Khaythamah did not name. Khaythamah has narrated from the companions of Abdullah, and I do not know if this man is from the companions of Abdullah or not, and he did not name this man. And Khaythamah narrated from more than one of his people from Ju'fi from the companions of Abdullah; among them Suwayd bin Ghafla, and among them Fulfala. He said: And this man whom Jarir mentioned in his Hadith from Mansur from Khaythamah from a man from his people. And I hope that he is one of the Ju'fis from the companions of Abdullah, because Khaythamah is Ju'fi, and he is Khaythamah bin Abdul-Rahman bin Abi Sabrah. End of the Book. And praise be to Allah, Lord of the Worlds. And may Allah bless our Master Muhammad, his family, and his companions and grant them peace. And Allah is sufficient for us, and He is the best Disposer of affairs.",
    "foot_note": "None",
    "book_id": "6038",
    "new_page_number": 70
  }
]