[
  {
    "text": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)\nAuthor: عبد العزيز بن ريس الريس\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "new_page_number": 1
  },
  {
    "text": "sn: 3939\nbook_title: الإقناع في حجية الإجماع\nbook_link: https://shamela.ws/book/267\nbook_id: 267\nauthor_name: عبد العزيز بن ريس الريس\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/3093\nauthor_ID: 3093\neditor: Null\npublisher: مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة\nedition: الأولى، 1440 ه\npages: 85\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: أصول الفقه\ncategory_id: 11",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "new_page_number": 2
  },
  {
    "serial_number": "3425118",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Principles of Jurisprudence\nBook: Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)\nAuthor: Dr. Abdul Aziz bin Rayyis al-Rayyis\nShamela Publication Date: 30 Ramadan 1442\n\nBook: Al-Iqna' fi Hujjiyat al-Ijma'\nAuthor: Dr. Abdul Aziz bin Rayyis al-Rayyis\nShamela Publication Date: 30 Ramadan 1442\n\nAuthor: Dr. Abdul Aziz bin Rayyis al-Rayyis\nShamela Publication Date: 30 Ramadan 1442\n\nShamela Publication Date: 30 Ramadan 1442\n\nShamela Publication Date: 30 Ramadan 1442\n\nShamela Publication Date: 30 Ramadan 1442\n\n[Book pagination matches the printed version]\nShamela Publication Date: 30 Ramadan 1442\n\nShamela Publication Date: 30 Ramadan 1442",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 3
  },
  {
    "serial_number": "3425119",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 5,
    "volume_number": 1,
    "text": "Introduction\nIn the name of Allah, the Most Gracious, the Most Merciful\nPeace, mercy, and blessings of Allah be upon you.\nTo proceed:\nThis is a transcription (1) of the lesson \"The Authority of Consensus and Clarifying Some Doubts,\" which I delivered on the night of the twenty-fourth of Jumada al-Akhirah in the year 1438 AH. The importance of this lesson is evident in the eagerness of innovators, both past and present, to reject the evidence of Consensus (Ijma') or to weaken it, and conversely, the neglect of this practically important evidence by many students of knowledge.\nTherefore, I reviewed the transcribed material and refined it to produce this treatise composed of an introduction, a preface, two chapters, and a conclusion. I named it \"Al-Iqna' fi Hujjiyat al-Ijma'\" (Persuasion regarding the Authority of Consensus), and it is structured as follows:\n- Introduction: Which is what is before you.\n- Preface: The importance of Consensus, and some other matters.\n- Chapter One: Issues related to Consensus, containing thirteen issues:\n- First Issue: Definition of Consensus.",
    "foot_note": "1. Some virtuous brothers undertook its transcription, documentation, formatting of the original, making additions, and altering the style to bring it closer to an authored book rather than a transcription. They also created an index for it. I reviewed it and found it good, so may Allah reward them with good and bless them.",
    "book_id": "267",
    "new_page_number": 4
  },
  {
    "serial_number": "3425120",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 6,
    "volume_number": 1,
    "text": "- Second Issue: Evidences for Consensus.\n- Third Issue: The stance of the people of innovation regarding Consensus.\n- Fourth Issue: The two types of Consensus.\n- Fifth Issue: Tacit Consensus (Ijma' Sukuti).\n- Sixth Issue: The inevitability of Consensus being based on a text.\n- Seventh Issue: The authority of Consensus before and after a disagreement.\n- Eighth Issue: The criterion for an anomalous (Shadh) opinion.\n- Ninth Issue: The authority of the consensus of experts of each art in their art.\n- Tenth Issue: The condition of the extinction of the era (Inqirad al-Asr) in Consensus.\n- Eleventh Issue: It is not permissible in Sharia to introduce a new opinion.\n- Twelfth Issue: The method of knowing Consensus.\n- Thirteenth Issue: Consensus is a revealing evidence (Dalil Kashif).\n- Chapter Two: Problems regarding the evidence of Consensus, containing twenty-four doubts and their clarifications:\n- First Doubt: Rejecting Consensus by claiming that the Messenger of Allah, peace and blessings be upon him, is his Salaf (predecessor).\n- Second Doubt: Rejecting Consensus by claiming that the Companion narrating the hadith is his Salaf.\n- Third Doubt: Rejecting Consensus by claiming that he is not among those who form the Consensus.\n- Fourth Doubt: Rejecting Consensus on the grounds that claimed consensuses have been proven broken.\n- Fifth Doubt: Rejecting Consensus due to some scholars contradicting the consensuses of the Companions.\n- Sixth Doubt: Rejecting Consensus on the grounds that many late jurists do not consider Tacit Consensus valid.",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 5
  },
  {
    "serial_number": "3425121",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 7,
    "volume_number": 1,
    "text": "- Seventh Doubt: Rejecting Consensus due to what is attributed to Al-Shafi'i: \"What has no disagreement in it is not Consensus.\"\n- Eighth Doubt: Rejecting Consensus on the grounds that the Sunnah is an authority in itself and does not need practice (amal).\n- Ninth Doubt: Rejecting Consensus on the grounds that the Consensus used as proof by Imam Ahmad and Sheikh al-Islam Ibn Taymiyyah is the Consensus of the Companions.\n- Tenth Doubt: The Consensus that is authoritative is [only] what is known from the religion by necessity, excluding others.\n- Eleventh Doubt: Lack of knowledge of a dissenter does not indicate Consensus.\n- Twelfth Doubt: It is not correct to use Consensus as evidence to oppose a [textual] evidence, lest we agree with the innovators.\n- Thirteenth Doubt: Rejecting Consensus on the grounds that Consensus which is not definitive is speculative (Zann).\n- Fourteenth Doubt: If a Hadith is authentic, it is obligatory to act upon it even if it is not known who acted upon it; because it is an authority without dispute.\n- Fifteenth Doubt: Leaving a Hadith due to lack of knowledge of a dissenter is a practice of the later scholars (Mutakhireen), not the early ones (Mutaqaddimeen).\n- Sixteenth Doubt: If a text exists that was not acted upon, there must be someone who acted upon it, and it is not required that the saying of the one who acted upon it be transmitted.\n- Seventeenth Doubt: Opposing someone whose statement is not authoritative (referring to Consensus) is more excusable than opposing someone whose statement is authoritative, which is the Quran and Sunnah. So how can the Authority (Quran and Sunnah) be abandoned for what is not authority?",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 6
  },
  {
    "serial_number": "3425122",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 8,
    "volume_number": 1,
    "text": "- Eighteenth Doubt: That a group of scholars held opinions they were not preceded in, which indicates the permissibility of introducing a new opinion.\n- Nineteenth Doubt: Rejecting Consensus on the grounds of Ishaq ibn Rahwayh's statement in a specific issue: \"...I did not think anyone agreed with me.\"\n- Twentieth Doubt: Scholars have customarily prioritized the Quran and Sunnah over Consensus; therefore, if a text and Consensus conflict, the text is prioritized.\n- Twenty-First Doubt: There is no Consensus in the instrumental sciences (Ulum al-Alah) because there are no texts in them, and there is no Consensus unless it is based on a text.\n- Twenty-Second Doubt: The reality of a Tabi'i (Successor) opposing a Sahabi (Companion) is essentially introducing a new opinion.\n- Twenty-Third Doubt: Prioritizing the Quran and Sunnah over speculative Consensus, but not definitive Consensus.\n- Twenty-Fourth Doubt: Rejecting Consensus on the grounds that Al-Nawawi said: A text is acted upon even if no one acted upon it.\n- Conclusion.\nI ask Allah to accept this treatise and to make it beneficial to His creation and acceptable to Him, Glory be to Him.\nPeace, mercy, and blessings of Allah be upon you.\nDr. Abdul Aziz bin Rayyis al-Rayyis\nSupervisor of the Ancient Islam Website\n18/4/1439 AH",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 7
  },
  {
    "serial_number": "3425123",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 9,
    "volume_number": 1,
    "text": "Preface\nBefore entering the core of this research, it should be known that the evidence of Consensus (Ijma') is one of the most important evidences for the scholars of Ahl al-Sunnah. \"Upon it revolves most rulings regarding differentiation and gathering, upon it analogies and lessons rely, and by it deduction is supported in the paths of thought\" (1).\nThe importance of Consensus becomes evident when looking at many evidences from the Quran and Sunnah which, when cited in many issues, are objected to by many opponents; claiming they are not definitive in their indication but allow for this and that... and they proceed to diversify approaches and multiply sects. Therefore, one of the most beneficial things to preserve the creed and methodology of Ahl al-Sunnah is: The understanding of the Salaf in explaining and understanding, accepting and rejecting, negation and affirmation, establishing principles and rules... and so on.\nThe understanding of the Salaf is a form of Consensus; hence, mastering Consensus is extremely important, as is caring for it; so that the creed of Ahl al-Sunnah is preserved and protected from that halo called \"Definitive and Speculative Indication\" (Qat'i and Zanni al-Dalalah). That halo which turned Islam upside down and back to front, where those theologians (Mutakallimun) reject many apparent clear evidences claiming they are not definitive in their indication or that they are speculative in their establishment. This does not mean we deny what is termed \"Definitive Indication and Speculative Indication,\" but rather this is a citation in the context of refuting the theologians who rejected evidences on the pretext that they are speculative in indication or establishment. For example, theologians reject the solitary report (Khabar al-Ahad) arguing it is not definitive in establishment. Then, if you bring them what is definitive in establishment, like the Mutawatir report from the Prophetic Sunnah or from the Quran: those people stir up their storm to cast doubt on its indication, and thus refuse to use it as proof... and this is their habit.",
    "foot_note": "1. See: \"Ghiyath al-Umam\" by Abu al-Ma'ali al-Juwayni (p. 45).",
    "book_id": "267",
    "new_page_number": 8
  },
  {
    "serial_number": "3425124",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 10,
    "volume_number": 1,
    "text": "So the division of evidences into definitive and speculative is, in itself, a division with no issue; as it is a reality that cannot be pushed aside. It is not correct to reject it, but what is obligatory is that this division not be used in a devilish manner to reject evidences and refuse them.\nIf this is clear, then know that one of the most important things regulating this matter is Consensus; because the merit of the evidence of Consensus is that it is decisive (Qati') in its indication, as stated by Al-Ghazali in \"Al-Mustasfa\" (1), Ibn Qudamah in \"Rawdat al-Nazir\" (2), and quoted by Al-Zarkashi in \"Al-Bahr al-Muhit\" (3) and Al-Shawkani in \"Irshad al-Fuhul\" (4) from Al-Sayrafi, Ibn Burhan, and Al-Asfahani; indeed Al-Asfahani declared it is the famous view.\nThe meaning of it being decisive in its indication involves two matters:\nFirst Matter: Its indication does not allow for more than one interpretation.\nSecond Matter: It is not valid for it to be abrogated; because Consensus only occurred after the death of the Prophet, peace and blessings be upon him, so it cannot be abrogated. Rather, the opposite is correct according to the correct view: Consensus indicates the abrogation of evidences; because it relies on a text and is not the abrogator in itself (5).",
    "foot_note": "1. See: \"Al-Mustasfa\" by Al-Ghazali p. 142 and following. \n2. See: \"Rawdat al-Nazir\" by Ibn Qudamah (1/378) and following. \n3. See: \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/388). \n4. See: \"Irshad al-Fuhul\" by Al-Shawkani (1/209). \n5. See regarding this: \"Al-Mustasfa\" by Al-Ghazali (1/101), \"Al-Mahsul\" by Al-Razi (3/354), \"Al-Ihkam fi Usul al-Ahkam\" by Al-Amidi (3/160-162), \"Al-Bahr al-Muhit\" by Al-Zarkashi (5/284-289), \"Sharh Mukhtasar al-Rawdah\" by Al-Tufi (2/330-332) and others.",
    "book_id": "267",
    "new_page_number": 9
  },
  {
    "serial_number": "3425125",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 11,
    "volume_number": 1,
    "text": "Chapter One\nIssues Related to Consensus\n\nFirst Issue: Definition of Consensus\nOne should not exaggerate in definitions as is the path of the theologians (Mutakallimun) who exaggerated in definitions and limits, such that one of them does not bring a definition without another objecting to it, arguing it is not inclusive or not exclusive or that its terms are synonymous, etc. (1).\nThe purpose of a definition is merely to bring the defined concept closer, and the purpose of a limit is to bring the limited closer. As for a true real limit, this does not exist, as explained by Sheikh al-Islam, may Allah have mercy on him, in \"Majmu' al-Fatawa\" (2). So the intended purpose of the definition is knowledge of the defined thing. The early Salaf from the jurists of Ahl al-Hadith, like Malik, Shafi'i, Ahmad, and others, did not concern themselves with these definitions; thus, you do not find them in their books, nor do you find them caring for them, let alone exaggerating in them, as explained by Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, in his refutation of the logicians in \"Majmu' al-Fatawa\" (3).\nThe meaning of Consensus in general terms is: \"The agreement of the Mujtahids of the Ummah on a Sharia issue after the death of the Prophet, peace and blessings be upon him.\"\nThis is because the research concerns Sharia issues and concerns Mujtahids (qualified jurists), and Consensus is only authoritative after the death of the Prophet, peace and blessings be upon him.",
    "foot_note": "1. As in: \"Al-Ihkam fi Usul al-Ahkam\" by Al-Amidi (1/195-196), and \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/379-382) and others. \n2. See: \"Majmu' al-Fatawa\" by Sheikh al-Islam Ibn Taymiyyah (9/85-86). \n3. See previous source.",
    "book_id": "267",
    "new_page_number": 10
  },
  {
    "serial_number": "3425126",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 12,
    "volume_number": 1,
    "text": "Whatever occurred during his lifetime, peace and blessings be upon him, is authoritative for two reasons:\nFirst: Either he knew about it, so it is an approval from him, peace and blessings be upon him.\nSecond: Or Allah did not denounce it, so this is an approval from Allah, and it is authoritative according to the correct view. Indeed, Ibn Hajar attributed its authority to the majority of scholars in his book \"Al-Nukat 'ala Muqaddimat Ibn al-Salah\" (1).\nAmong the evidences for this: What Muslim narrated from the hadith of Jabir, who said: \"We used to practice coitus interruptus (Azl) (2) while the Quran was being revealed\" (3).\nHe used the fact that Allah did not denounce it as evidence for the permissibility of Azl. Sufyan bin Uyainah said: If it were prohibited, the Quran would have prohibited it (4).\nSo Consensus is: \"The agreement of the Mujtahids of the Ummah on a Sharia issue after the death of the Messenger of Allah, peace and blessings be upon him.\"\nSome theologians, like Abu Bakr Al-Baqillani (5) and Al-Amidi (6) in \"Usul al-Ahkam,\" said that the opinion of the laypeople (Awam) is counted in Consensus regarding agreement and disagreement, meaning if the laypeople disagree, the Consensus is invalid. This contains significant speculation, rather it is an error; because the laypeople in Sharia issues are followers of the scholars. So if the scholars agree, the laypeople follow them, and it is not valid for a layperson to disagree. This was mentioned by",
    "foot_note": "1. See \"Al-Nukat 'ala Muqaddimat Ibn al-Salah\" by Ibn Hajar (2/515) and following. \n2. Azl: Is the man withdrawing his water (semen) from his maidservant/wife during intercourse so she does not become pregnant. See: \"Lisan al-Arab\" by Ibn Manzur (11/441). \n3. Narrated by Al-Bukhari (5208) and Muslim (1440). \n4. Narrated by Muslim (2/1065) number (1440). \n5. See: \"Al-Mahsul\" by Al-Razi (4/196), and \"Sharh Mukhtasar al-Rawdah\" by Al-Tufi (3/31). \n6. See: \"Al-Ihkam fi Usul al-Ahkam\" by Al-Amidi (1/228).",
    "book_id": "267",
    "new_page_number": 11
  },
  {
    "serial_number": "3425127",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 13,
    "volume_number": 1,
    "text": "Abu al-Khattab al-Hanbali in \"Al-Tamhid\" (1). * * *\n\nSecond Issue: Evidences for Consensus\nThe evidences have varied and combined to support the authority of Consensus. Here are some of them:\nFirst Evidence: The saying of the Almighty: {And whoever opposes the Messenger after guidance has become clear to him and follows other than the way of the believers - We will give him what he has taken and drive him into Hell, and evil it is as a destination.} [An-Nisa: 115].\nA group of Usul scholars used this verse as evidence, such as Al-Amidi in his book \"Usul al-Ihkam\" (2), Ibn Qudamah in \"Al-Rawdah\" (3), and Sheikh al-Islam Ibn Taymiyyah as in \"Majmu' al-Fatawa\" (4). Indeed, most who wrote on Usul, when mentioning the issue of Consensus, brought this verse (5). Some attributed this deduction to Al-Shafi'i (6), while others disputed this deduction (7).",
    "foot_note": "1. See: \"Al-Tamhid fi Usul al-Fiqh\" by Abu al-Khattab (3/251). \n2. See: \"Al-Ihkam fi Usul al-Ahkam\" by Al-Amidi (1/228). \n3. See: \"Rawdat al-Nazir\" by Ibn Qudamah (1/380-381). \n4. See: \"Majmu' al-Fatawa\" by Ibn Taymiyyah (19/178), and (19/192). \n5. See: \"Al-Mu'tamad\" by Abu al-Husayn (2/7), \"Al-Tamhid fi Usul al-Fiqh\" by Abu al-Khattab (3/251), \"Al-Mahsul\" by Al-Razi (4/35-36), \"Al-Tahbir Sharh al-Tahrir\" by Al-Mardawi (4/1531-1532), \"Al-Kawkab al-Munir\" by Ibn al-Najjar (2/215) and others. \n6. See: \"Ahkam al-Quran\" by Al-Shafi'i (1/39), and see the story of his deduction in \"Siyar A'lam al-Nubala\" by Al-Dhahabi (10/83-84). Among those who attributed it to him: Al-Amidi in \"Al-Ihkam fi Usul al-Ahkam\" (1/200), Al-Ghazali in \"Al-Mustasfa\" (1/138), Ibn Taymiyyah in \"Majmu' al-Fatawa\" (19/178) and others. \n7. See: \"Al-Mustasfa\" by Al-Ghazali (1/138).",
    "book_id": "267",
    "new_page_number": 12
  },
  {
    "serial_number": "3425128",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 14,
    "volume_number": 1,
    "text": "The point of evidence from this verse: Allah arranged punishment for abandoning the way of the believers. This indicates that following the way of the believers is obligatory. Therefore, if the believers among the people of knowledge and Mujtahids are upon an opinion in this issue, then their saying is authoritative, and this is what is intended.\nSecond Evidence: His saying, Glory be to Him: {And if you disagree over anything, refer it to Allah and the Messenger, if you should believe in Allah and the Last Day. That is the best [way] and best in result.} [An-Nisa: 59].\nAbu al-Husayn (1), Al-Amidi (2), and Sheikh al-Islam Ibn Taymiyyah as in \"Majmu' al-Fatawa\" (3) and others used this verse as evidence.\nThe point of evidence: That one acts directly upon what has no dispute in it, unlike what has dispute in it, which is referred to the Book and the Sunnah.\nThird Evidence: His saying Almighty: {You are the best nation produced [as an example] for mankind. You enjoin what is right and forbid what is wrong} [Al-Imran: 110].\nAbu al-Husayn (4), Al-Amidi (5), Al-Tufi (6), and Sheikh al-Islam Ibn Taymiyyah (7) and others used this verse as evidence.\nThe point of evidence: If the Ummah agrees on a saying, then this saying is good (Khayr); because they enjoined it. If it were not good, there would be found in the Ummah someone to deny it, and it is impossible that the preponderated (Marjuh) and erroneous opinion be transmitted to us without the preponderant (Rajih) opinion.",
    "foot_note": "1. See: \"Al-Mu'tamad\" by Abu al-Husayn (2/15). \n2. See: \"Al-Ihkam fi Usul al-Ahkam\" by Al-Amidi (1/218). \n3. See: \"Majmu' al-Fatawa\" by Ibn Taymiyyah (1/9), (19/67), and (19/91). \n4. See: \"Al-Mu'tamad\" by Abu al-Husayn (2/6). \n5. See: \"Al-Ihkam fi Usul al-Ahkam\" by Al-Amidi (1/214). \n6. See: \"Sharh Mukhtasar al-Rawdah\" by Al-Tufi (3/17). \n7. See: \"Majmu' al-Fatawa\" by Ibn Taymiyyah (19/176).",
    "book_id": "267",
    "new_page_number": 13
  },
  {
    "serial_number": "3425129",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 15,
    "volume_number": 1,
    "text": "Fourth Evidence: His saying Almighty: {And thus we have made you a just (Wasat) community} [Al-Baqarah: 143]. The meaning of 'Wasat' is just and chosen. So if the scholars agree on a saying, this is the true saying and it is the choice that Allah loves. This verse was used as evidence by Abu al-Husayn (1), Al-Amidi (2), Al-Tufi (3), and Sheikh al-Islam Ibn Taymiyyah (4) and others.\nFifth Evidence: Al-Bukhari and Muslim narrated from the hadith of Mu'awiyah bin Abi Sufyan, may Allah be pleased with them both, who said: I heard the Messenger of Allah, peace and blessings be upon him, saying: \"A group of my Ummah will remain standing on the command of Allah, unharmed by those who forsake them or oppose them, until the command of Allah comes while they are dominant over the people\" (5).\nAl-Bukhari and Muslim also narrated it from the hadith of Al-Mughirah bin Shu'bah (6), and Muslim from the hadith of Jabir (7), Thawban (8), Sa'd bin Abi Waqqas (9), and other Companions (10) of the Messenger of Allah, peace and blessings be upon him.\nThe point of evidence from this hadith: If the Ummah agrees on a saying, then inevitably and necessarily that Victorious Group (Ta'ifah Mansurah), which is never upon anything but the truth, must be among them; thus it becomes clear that this saying is truth, and this is the goal as it indicates the authority of Consensus.",
    "foot_note": "1. See: \"Al-Mu'tamad\" by Abu al-Husayn (2/4). \n2. See: \"Al-Ihkam fi Usul al-Ahkam\" by Al-Amidi (1/211). \n3. See: \"Sharh Mukhtasar al-Rawdah\" by Al-Tufi (3/15). \n4. See: \"Majmu' al-Fatawa\" by Ibn Taymiyyah (19/177). \n5. Narrated by Al-Bukhari (3641), and Muslim (1037/174) - wording is his. \n6. Narrated by Al-Bukhari (7311), and Muslim (1921). \n7. Narrated by Muslim (156), and (1923). \n8. Narrated by Muslim (1920). \n9. Narrated by Muslim (1925). \n10. Such as Uqbah bin Amir as in Muslim (1924), Abu Hurairah as in Ibn Majah (7), and Qurrah bin Iyas as in Tirmidhi (2192) and Ibn Majah (6).",
    "book_id": "267",
    "new_page_number": 14
  },
  {
    "serial_number": "3425130",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 16,
    "volume_number": 1,
    "text": "Let us assume that the Ummah at a certain time agreed on a specific saying, then definitely this saying is the preponderant one and the one Allah loves; because among those agreeing is that Victorious Group.\nSixth Evidence: It is established by Ahmad and others from Ibn Masud, may Allah be pleased with him, that he said: \"...So whatever the Muslims see as good, it is good in the sight of Allah, and whatever they see as bad, it is bad in the sight of Allah\" (1). This is evidence for the authority of Consensus as stated by Ibn Hazm (2), Ibn al-Qayyim in \"Al-Farusiyyah\" (3), Al-Shatibi in \"Al-I'tisam\" (4), and other people of knowledge.\nAl-Khatib Al-Baghdadi narrated it (5) as Marfu' (attributed to the Prophet) from Anas, may Allah be pleased with him, but it is not authentic as a hadith of Anas, as explained by Ibn Hazm (6), Ibn al-Qayyim in his book \"Al-Farusiyyah\" (7), Ibn Abd al-Hadi as quoted by Al-Ajluni (8), and the scholar Al-Albani (9).\nSeventh Evidence: Established by Ibn Abi Asim from Abu Masud Al-Badri that he said: \"Adhere to the Jama'ah (community/group), for Allah will not unite the Ummah of Muhammad, peace and blessings be upon him, on error\" (10).",
    "foot_note": "1. Narrated by Ahmad (3600), Al-Bazzar (1816), Ibn Al-A'rabi in \"Al-Mu'jam\" (861), Al-Tabarani in \"Al-Mu'jam Al-Kabir\" (9/112), Al-Hakim (4465) and he authenticated it, and others. \n2. See: \"Al-Ihkam fi Usul al-Ahkam\" by Ibn Hazm (6/18-19). \n3. See: \"Al-Farusiyyah\" by Ibn al-Qayyim (p. 299). \n4. See: \"Al-I'tisam\" by Al-Shatibi (3/46, 325). \n5. Narrated by Al-Khatib Al-Baghdadi in \"Tarikh Baghdad\" (5/270). \n6. See: \"Al-Ihkam fi Usul al-Ahkam\" by Ibn Hazm (6/18). \n7. See: \"Al-Farusiyyah\" by Ibn al-Qayyim (p. 298). \n8. See: \"Kashf al-Khafa\" by Al-Ajluni (2/221). \n9. See: \"Al-Silsilah Al-Da'ifah\" by Al-Albani (532). \n10. Narrated by Ibn Abi Asim in \"Al-Sunnah\" (85), Ibn Abi Shaybah (37615), Al-Lalaka'i in \"Sharh Usul al-I'tiqad\" (1/122), and Al-Hakim (8545) and he authenticated it.",
    "book_id": "267",
    "new_page_number": 15
  },
  {
    "serial_number": "3425131",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 17,
    "volume_number": 1,
    "text": "This is a text on the authority of Consensus. It has come as Marfu' (1), but the more correct view - and Allah knows best - is that it is not authentic as Marfu', but rather it is authentic as the saying of Abu Masud Al-Badri, may Allah be pleased with him... and other evidences.\n* Notice: Some Usul scholars used evidences that do not indicate the authority of Consensus, including:\n1 - They argued using evidences indicating that sticking to the Jama'ah is obligatory and whoever leaves the Jama'ah and dies, dies a death of Jahiliyyah (ignorance). Like what Muslim narrated from Abu Hurairah, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: \"Whoever leaves obedience and separates from the Jama'ah and dies, dies a death of Jahiliyyah\" (2).\nAnd Ahmad and Abu Dawood narrated from the hadith of Abu Dharr, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: \"Whoever separates from the Jama'ah by a handspan has cast off the yoke of Islam from his neck\" (3).\nThe most apparent view, and Allah knows best, is that deducing from this is incorrect, because the 'Jama'ah' meant in this hadith is the group of bodies, which refers to hearing and obeying the ruler in other than disobedience to Allah, and it does not mean the consensus of the Ummah; rather, it means the group of bodies. Al-Khattabi, may Allah have mercy on him, mentioned in his book \"Al-Uzlah\" (Seclusion): That separation is of two types: separation of bodies and separation of religions; and conversely, unity is of two types: unity of bodies and unity of religions (4).",
    "foot_note": "1. As in Abu Dawood (4253) from the hadith of Abu Malik Al-Ash'ari, Ibn Majah (3950) from the hadith of Anas, and others. \n2. Narrated by Muslim (1848/53) from the hadith of Abu Hurairah. \n3. Narrated by Ahmad (21560) and Abu Dawood (4758), authenticated by Al-Albani in \"Sahih Sunan Abi Dawood\" (4758) Ma'arif edition. Also narrated from the hadith of Abu Malik Al-Ash'ari by Ahmad (22910) and Tirmidhi (2863) who said: Hasan Sahih. Authenticated by Al-Albani in \"Sahih Sunan al-Tirmidhi\" (2863) Ma'arif edition. \n4. See: \"Al-Uzlah\" by Al-Khattabi (p. 8).",
    "book_id": "267",
    "new_page_number": 16
  },
  {
    "serial_number": "3425132",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 18,
    "volume_number": 1,
    "text": "So the 'Jama'ah' meant in this hadith is the group of bodies, i.e., gathering around the ruler in hearing and obedience in other than disobedience to Allah. There is a difference between this and the Consensus of the Ummah on a Sharia issue.\n\nThird Issue\nThe Stance of the People of Innovation Regarding Consensus\nThe people of innovation - in general - fall into two groups regarding Consensus:\nThe First Group: Denied Consensus and said Consensus is not proof. The first to deny Consensus and become famous for that was Al-Nazzam the Mu'tazilite, as attributed to him by Ibn Qudamah in \"Rawdat al-Nazir\" (1) and attributed to him by a group (2). Sheikh al-Islam Ibn Taymiyyah mentioned (3) that the Mu'tazilah and Shia disagreed on the authority of Consensus. Therefore, everyone who denied the authority of Consensus, his predecessor (Salaf) is Al-Nazzam the Mu'tazilite, for he was the first to disagree on the authority of Consensus (4).\nThe Second Group: Made the existence of Consensus difficult without explicitly denying it. So their tongue of speech says: We affirm Consensus. But their tongue of condition says: Consensus does not exist. Examples of this:\n1 - A group said: Consensus is not Consensus until the laypeople (commoners) agree with the scholars.",
    "foot_note": "1. See: \"Rawdat al-Nazir\" by Ibn Qudamah (1/379). \n2. Such as: Abu al-Husayn in \"Al-Mu'tamad\" (2/4), Al-Ghazali in \"Al-Mustasfa\" (1/137), Al-Amidi in \"Al-Ihkam\" (1/200), Al-Zarkashi in \"Al-Bahr al-Muhit\" (6/384) and others. \n3. See: \"Majmu' al-Fatawa\" by Ibn Taymiyyah (11/341). \n4. Abu al-Ma'ali al-Juwayni said in \"Al-Burhan fi Usul al-Fiqh\" (1/261): The first to openly reject it was Al-Nazzam, then sects of the Rawafid followed him.",
    "book_id": "267",
    "new_page_number": 17
  },
  {
    "serial_number": "3425133",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 19,
    "volume_number": 1,
    "text": "The attribution of this view to Al-Baqillani and Al-Amidi has preceded. The reality of this view is that Consensus does not exist due to the difficulty of achieving that. Ibn Qudamah said: \"This saying boils down to invalidating Consensus; since the saying of the entire Ummah in a single incident is unimaginable. And if it were imagined: Who would transmit the saying of all of them, given their large numbers and their dispersion in the deserts, cities, and villages?!\" (1).\n2 - A group said: Tacit Consensus (Ijma' Sukuti) is not proof. The discussion of Tacit Consensus will come - Allah willing. Its meaning is: That a group of scholars speak [on an issue] and this saying becomes famous, and others do not deny it. This group said: This Consensus is not proof. If you scrutinize this saying, you will find it returns to the saying of the theologians, as will be explained - Allah willing -; because the necessary implication of saying Tacit Consensus is not proof is that no proof-worthy Consensus exists. Abu Bakr Al-Jassas said in his book \"Al-FUsul fi Al-Usul\" in summary: The implication of denying the authority of Tacit Consensus is that no Consensus exists (2). And he spoke the truth, may Allah have mercy on him.",
    "foot_note": "1. See: \"Rawdat al-Nazir\" by Ibn Qudamah (1/391). \n2. See: \"Al-Fusul fi Al-Usul\" by Al-Jassas (3/290). Where he said: \"...Therefore, by this, their silence after the appearance and spread of the saying must be: an indication of agreement. If Consensus were not valid from this aspect, no Consensus would ever be valid, for it is impossible to attribute any saying to the entire Ummah: on the basis that they [all] said it and uttered it. Rather, they rely on the appearance of the saying among them, without any dissent against them.\"",
    "book_id": "267",
    "new_page_number": 18
  },
  {
    "serial_number": "3425134",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 20,
    "volume_number": 1,
    "text": "Ibn Qudamah mentioned something similar in \"Rawdat al-Nazir\" (1). In fact, in \"Al-Mughni,\" when he mentioned an issue and cited the saying of some Companions without opposition, he said: There is no way to transmit the saying of all Companions in an issue, nor to transmit the saying of the ten [promised Paradise], and Consensus does not exist except as the widespread saying (2). So Ahl al-Sunnah should not be deceived by the sayings of the people of innovation and should be insightful. Among those who disagreed on the authority of Consensus or narrowed it greatly are the Zahiris (Literalists), and the discussion on the Zahiris and their school in this regard will come - Allah Almighty willing.\n\nObjection and Rebuttal\nIf it is said: What is said about Imam Ahmad's statement: \"Whoever claims Consensus is a liar\"?\nIt is said: The answer is from two aspects:\nFirst Aspect: Imam Ahmad definitely did not intend to deny Consensus, evidenced by the fact that Imam Ahmad himself used Consensus as proof in many issues, including:\n1 - Imam Ahmad's saying: \"They agreed (Ajma'u) that Takbir - i.e., the restricted one - begins from the morning of the day of Arafah\" (3).\n2 - His saying: \"They agreed that the children of Muslims are in Paradise\" (4).",
    "foot_note": "1. See: \"Rawdat al-Nazir\" by Ibn Qudamah (1/437), where he said: \"...If this were not Consensus: the existence of Consensus would be impossible; since the explicit saying of every scholar of the era has not been transmitted to us in any issue.\"\n2. See: \"Al-Mughni\" by Ibn Qudamah (2/310) in meaning.\n3. See: \"Al-Uddah fi Usul al-Fiqh\" (4/1061), \"Al-Mughni\" by Ibn Qudamah (2/292), and \"Fath al-Bari\" by Ibn Rajab (9/22, 24).\n4. See: \"Ahkam Ahl al-Milal\" by Al-Khallal (1/11) with the wording: \"There is no disagreement in it\", and \"Al-Mughni\" by Ibn Qudamah (4/37) with the wording: \"There is no difference in it\".",
    "book_id": "267",
    "new_page_number": 19
  },
  {
    "serial_number": "3425135",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 21,
    "volume_number": 1,
    "text": "3 - His saying: \"The people of knowledge agreed that selling debt for debt is not permissible\" (1).\n4 - His saying: \"The consensus of the scholars and the early Imams is that the Quran is the Speech of Allah, uncreated. This is the religion upon which I found the Sheikhs, and the Sheikhs found those before them upon this\" (2).\n5 - His saying: \"They agreed that whoever remembers a resident prayer while traveling, prays it as a resident prayer\" (3).\n6 - His saying regarding His Almighty's statement: {So when the Qur'an is recited, then listen to it and pay attention that you may receive mercy} [Al-A'raf: 204]: \"The people agreed that this verse is regarding Prayer\" (4).\n7 - His saying: \"They agreed that blood is impure\" (5).\n8 - His saying: \"The people did not differ that if a man embraces Islam, he remains on his marriage\" (6).\nAnd other issues where Imam Ahmad cited Consensus and lack of disagreement. The intended point is that the consensuses reported from Imam Ahmad are not few, so how could he deny Consensus while he himself used it as proof?!\nSecond Aspect: Imam Ahmad's companions did not understand his denial of Consensus [as absolute]; thus, they divided into groups regarding the interpretation of his words, as follows:",
    "foot_note": "1. See: \"Al-Mughni\" by Ibn Qudamah (4/51). \n2. See: \"Tabaqat al-Hanabilah\" by Ibn Abi Ya'la (1/172). \n3. See: \"Al-Mughni\" by Ibn Qudamah (2/208), with wording: \"As for the resident, if he remembers it during travel, then by consensus he prays four.\"\n4. See: \"Masa'il Abi Dawood\" (48). \n5. See: \"Sharh al-Umdah\" by Ibn Taymiyyah (1/105), and \"Ighathat al-Lahfan\" by Ibn al-Qayyim (1/151). \n6. See: \"Ahkam Ahl al-Milal\" by Al-Khallal (509), and (507).",
    "book_id": "267",
    "new_page_number": 20
  },
  {
    "serial_number": "3425136",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 22,
    "volume_number": 1,
    "text": "1 - Some of them interpreted it as precaution/piety (Wara'), like Abu Ya'la in \"Al-Uddah\" (1).\n2 - Some interpreted it as referring to the Consensus claimed by people of innovation who are not qualified to narrate Consensus. This is the other view mentioned by Abu Ya'la in \"Al-Uddah\" (2). Close to this is what Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, mentioned in \"Bayan al-Dalil fi Butlan al-Tahlil\" (3), and close to it is what Ibn al-Qayyim mentioned in \"I'lam al-Muwaqqi'in\" (4).\n3 - Also, Ibn Taymiyyah has a third interpretation as in \"Al-Musawwada,\" he said: Imam Ahmad's speech refers to Consensus after the preferred centuries (5).\n* The most apparent of these interpretations is that Imam Ahmad's speech - may Allah Almighty have mercy on him - concerns those who are not qualified to narrate Consensus, like the people of innovation and the people of opinion (Ahl al-Ra'y) who reject texts based on [claimed] consensuses, while they are not qualified to narrate Consensus. Therefore, Imam Ahmad said in the continuation of the speech: \"This is the claim of Bishr and Al-Asamm...\" etc., meaning the claim of the people of innovation.\nIbn Taymiyyah, may Allah Almighty have mercy on him, explained in \"Al-Tis'iniyyah\" that the people of innovation often claim consensuses in creedal issues while they are mistaken in that. He, may Allah have mercy on him, said: \"...And this Consensus corresponds to other false consensuses claimed in theology (Kalam) and other fields - and how many they are -. Whoever contemplates will find that most corrupt doctrines are built upon premises that are established only by a claimed consensus or analogy, both of which upon investigation are false\" (6).",
    "foot_note": "1. See: \"Al-Uddah fi Usul al-Fiqh\" by Abu Ya'la (4/1060). \n2. See: \"Al-Uddah fi Usul al-Fiqh\" by Abu Ya'la (4/1060). \n3. See: \"Bayan al-Dalil fi Butlan al-Tahlil\" by Ibn Taymiyyah (1/327). \n4. See: \"I'lam al-Muwaqqi'in\" by Ibn al-Qayyim (2/53-54), and (3/558-559). \n5. See: \"Al-Musawwada\" by Ibn Taymiyyah (p. 316). \n6. See: \"Al-Tis'iniyyah\" by Ibn Taymiyyah (2/492).",
    "book_id": "267",
    "new_page_number": 21
  },
  {
    "serial_number": "3425137",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 23,
    "volume_number": 1,
    "text": "Fourth Issue\nThe Two Types of Consensus\nConsensus is divided into two types:\nFirst Type: Definitive Consensus (Qat'i).\nSecond Type: Speculative Consensus (Zanni).\nConsensus is divided into definitive and speculative in its establishment, not in its indication (Dalalah); because Consensus in its indication does not depart from being decisive and definitive - as previously mentioned - but the research is in its establishment. So Consensus in its establishment divides into definitive and speculative. This was mentioned by Ibn Qudamah in \"Rawdat al-Nazir\" (1), Ibn Taymiyyah as in \"Majmu' al-Fatawa\" (2), Al-Zarkashi in \"Al-Bahr al-Muhit\" (3), and other people of knowledge.\nThe criterion for Definitive Consensus: - And Allah knows best -: Is what was built upon an apparent text and scholars concurred upon it, like the obligation of Prayer and Zakat and the like. If an apparent text exists and scholars concurred on it, such is called a Definitive Consensus. This is derived from the words of Sheikh al-Islam (4) may Allah Almighty have mercy on him, and Al-Zarkashi (5), and our Sheikh, the scholar Ibn Uthaymeen (6) may Allah Almighty have mercy on him, explicitly stated it.\nAs for Speculative Consensus: It is other than that, which relies on the induction of the people of knowledge (7).",
    "foot_note": "1. See: \"Rawdat al-Nazir\" by Ibn Qudamah (1/440-441). \n2. See: \"Majmu' al-Fatawa\" by Ibn Taymiyyah (19/267-268). \n3. See: \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/414-415). \n4. See: \"Majmu' al-Fatawa\" by Ibn Taymiyyah (19/267-268). \n5. See: \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/499). \n6. See: \"Al-Usul min Ilm al-Usul\" by Ibn Uthaymeen (p. 65-66). \n7. See: \"Majmu' al-Fatawa\" by Ibn Taymiyyah (19/267), and \"Al-Usul min Ilm al-Usul\" by Ibn Uthaymeen (p. 65-66).",
    "book_id": "267",
    "new_page_number": 22
  },
  {
    "serial_number": "3425138",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 24,
    "volume_number": 1,
    "text": "Question and Answer\nIs the denier of Consensus judged as a disbeliever?\nTo answer this question, one must differentiate between one who denies Definitive Consensus and one who denies Speculative Consensus.\nThe First: Is judged as a disbeliever; because he denies apparent texts like the obligation of Zakat and Prayer.\nThe Second: Such a person is not judged as a disbeliever. This was mentioned by Sheikh al-Islam Ibn Taymiyyah as in \"Majmu' al-Fatawa\" (1), and Al-Zarkashi in \"Al-Bahr al-Muhit\" (2).\nNote: It should be known that Speculative Consensus is of levels, not of a single level, as transmitted by Al-Zarkashi (3). And he spoke the truth, may Allah have mercy on him, for the Consensus which scholars concur on narrating is not like the Consensus which only one scholar narrates; they vary in strength.\n\nFifth Issue\nTacit Consensus (Ijma' Sukuti)\nThis issue is one of the important issues that should be regulated with scientific precision; due to the many doubts and problems that arise regarding it, and the discussion of that will come - Allah willing.\nThe meaning of Tacit Consensus: That a group of scholars speak [on an issue] and the rest remain silent. Some say: A group of scholars speak, their saying becomes famous, and others do not oppose them",
    "foot_note": "1. See: \"Majmu' al-Fatawa\" by Ibn Taymiyyah (19/270). \n2. See: \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/496) and following. \n3. See: \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/389).",
    "book_id": "267",
    "new_page_number": 23
  },
  {
    "serial_number": "3425139",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 25,
    "volume_number": 1,
    "text": "(1). Scholars regarding Tacit Consensus are of two opinions:\n1 - Some restrict Tacit Consensus to the Companions.\n2 - Others generalize it to the Companions and those after them.\nAl-Ala'i mentioned both opinions in \"Ijmal al-Isabah fi Hujjiyat Qawl al-Sahabah\" (2).\nThe view that Tacit Consensus is authoritative is the correct view without doubt (3). Indeed, saying it is not authoritative is like saying Consensus is not authoritative; because there is no Consensus except Tacit Consensus, for there is no spoken consensus [where everyone speaks], as previously mentioned in the words of Al-Jassas (4)",
    "foot_note": "1. See definitions of Tacit Consensus in: \"Al-Ihkam\" by Al-Amidi (1/252), \"Ijmal al-Isabah fi Aqwal al-Sahabah\" by Al-Ala'i (p. 20), \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/456), \"Sharh Mukhtasar al-Rawdah\" by Al-Tufi (3/78) and others. \n2. See: \"Ijmal al-Isabah fi Aqwal al-Sahabah\" by Al-Ala'i (p. 20) and following, and see \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/465-467). \n3. This is held by: Ahmad bin Hanbal, the majority of Hanafis, Malikis, and Shafi'is. Ibn Burhan said: And all scholars have gone to this view. \"Ijmal al-Isabah fi Aqwal al-Sahabah\" by Al-Ala'i (p. 20), and \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/457). \n4. Al-Jassas also said as in \"Al-Fusul fi Al-Usul\" by Al-Jassas (3/285-286): \"Then those by whom Consensus is convened are either: That the existence of their consensus is considered by knowing the saying of each one of them specifically, or that the saying appears from some of them and spreads among all of them without appearance of disagreement from the rest against them, nor denial against those saying it. It is not permissible that the validity of Consensus be dependent on the existence of a saying in the issue from every single one of them, agreeing with the others; because if that were a condition for Consensus, no Consensus would ever be valid, since it is impossible for anyone to narrate in any issue the saying of every single person of the people of an era in which consensus convened on something, whether you wish from the first generation or those after them. When the validity of the Consensus of the Ummah is established for us by the proofs we presented, and the existence of Consensus by establishing the saying of every single one of the Companions and Successors in an issue is impossible, we knew: that this is not a condition.\"",
    "book_id": "267",
    "new_page_number": 24
  },
  {
    "serial_number": "3425140",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 26,
    "volume_number": 1,
    "text": "and Ibn Qudamah (1).\n\nObjection and Rebuttal\nIf a questioner says: It is famous among some people of knowledge that Al-Shafi'i disagreed on the authority of Tacit Consensus, as he said: \"No statement is attributed to a silent person\" (2). This indicates that Al-Shafi'i does not view Tacit Consensus as proof.\nIt is said: A group of people of knowledge disagreed with attributing this to Al-Shafi'i. Among those who disagreed with that are the verifier of the Shafi'i school and its Imam Abu Hamid Al-Isfarayini, Abu Hamid Al-Shirazi, and Al-Nawawi, may Allah Almighty have mercy on him. They stated that Al-Shafi'i views Tacit Consensus as proof in the Old and New [schools], and they mentioned examples for Al-Shafi'i, may Allah Almighty have mercy on him, indicating that Tacit Consensus is proof (3). Indeed, Ibn Burhan mentioned: The view that Tacit Consensus is authoritative is what the Imams are upon (4). And he spoke the truth - may Allah Almighty have mercy on him - for the first to disagree on its authority were the theologians. As for the Imams of Islam, they concur that Tacit Consensus is proof, because when they said Consensus is proof and used it practically in many issues, they thereby view that Tacit Consensus is proof.\nThe most apparent view - and Allah knows best - is that Tacit Consensus is not restricted to the Companions as is the practice of scholars and recurrent in their actions, but applies to the Companions and those after them, as will be explained Allah willing.",
    "foot_note": "1. See: \"Rawdat al-Nazir\" by Ibn Qudamah (1/391). \n2. See attribution of this saying to Al-Shafi'i in: \"Al-Tabsira fi Usul al-Fiqh\" by Al-Shirazi (p. 517), and \"Al-Burhan fi Usul al-Fiqh\" by Imam al-Haramayn (1/271) and others. \n3. See: \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/457) quoting from \"Sharh al-Wasit\" by Al-Nawawi. \n4. See: \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/457).",
    "book_id": "267",
    "new_page_number": 25
  },
  {
    "serial_number": "3425141",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 27,
    "volume_number": 1,
    "text": "Indeed, the Companions might differ on two opinions, then Consensus is convened after that, so scholars act upon this Consensus. This indicates that Tacit Consensus is not specific to the Companions. Examples of this: The Companions differed regarding the one who had intercourse - i.e., penetrated - without ejaculation? Does Ghusl (ritual bath) become obligatory upon him or not? There are two opinions of the Companions (1), but Consensus was convened after that, and this was stated by Ibn al-Mundhir (2), Ibn Abd al-Barr (3), and other people of knowledge. Other examples will be mentioned - Allah willing. So the intended point is that Tacit Consensus is not specific to the Companions but is consistent among the people of knowledge. If a scholar mentions an issue and it becomes famous from him, it is proof. It appears to me - and Allah knows best - that restricting the matter to fame (Ishtihar) or lack thereof is not practical. Merely that a scholar mentions a view and no denial is known from others makes it proof, for two reasons:\nFirst: If it were objectionable, there must be found in the Ummah someone to deny it, and it is impossible that Allah transmits to us the preponderated (incorrect) view without the preponderant (correct) one. Ibn al-Qayyim mentioned in his book \"I'lam al-Muwaqqi'in\" (4) that the preponderated opinion is an error from an aspect, so the preponderated is not transmitted without the preponderant.",
    "foot_note": "1. See them in: \"Al-Awsat\" by Ibn al-Mundhir (2/76) and following, and \"Al-Tamhid\" by Ibn Abd al-Barr (23/100) and following. \n2. See: \"Al-Awsat\" (2/81), and \"Al-Ijma'\" (24) both by Ibn al-Mundhir. \n3. See: \"Al-Tamhid\" by Ibn Abd al-Barr (23/105). However, he said: \"Upon this view is the majority of the people of Fatwa in Hijaz, Iraq, Sham, and Egypt, and to it went Malik, Al-Shafi'i, Abu Hanifa and their companions, Al-Layth bin Sa'd, Al-Awza'i, Al-Thawri, Ahmad bin Hanbal, Ishaq, Abu Thawr, Abu Ubayd, and Al-Tabari.\" \n4. See: \"I'lam al-Muwaqqi'in\" by Ibn al-Qayyim (5/569) (6/37).",
    "book_id": "267",
    "new_page_number": 26
  },
  {
    "serial_number": "3425142",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 28,
    "volume_number": 1,
    "text": "Second: We are commanded to follow the way of the believers, and what is known of the way of the believers in this issue is the saying of this man, whether he is a Companion, a Successor, or one after him, and no opposition from others is known. We are commanded to follow the way of the believers, so therefore following this saying is obligatory because it is the way of the believers in this issue as far as we know.\nSo Tacit Consensus is proof in any form, and this is common practice among scholars. They concurred on the saying of Ibn Abbas narrated by Malik in Al-Muwatta: \"Whoever leaves a ritual or forgets it, let him spill blood (sacrifice)\" (1), and they acted upon it; because Ibn Abbas said it and none of the people of knowledge and famous jurists of Islam opposed him, rather they used it as proof. Examples of this are many.\n* * *\n\nSixth Issue\nThe Inevitability of Consensus Being Based on a Text\nConsensus must be based on a text. It is impossible for Consensus to be authoritative unless it relies on a text, and there is no Consensus except that it relies on a text. So whenever the validity of this Consensus is asserted, it is definitely based on a text. The evidence for this includes:\nFirst Evidence: His saying Almighty {And if you disagree over anything, refer it to Allah and the Messenger} [An-Nisa: 59]. So upon dispute, we refer it to Allah and the Messenger, and upon agreement, we act by it; because it is what the Speech of Allah and the speech of His Messenger, peace and blessings be upon him, indicated. This was stated by Ibn Taymiyyah as in \"Majmu' al-Fatawa\" (2).\nSecond Evidence: His saying Almighty: {And whoever opposes the Messenger after guidance has become clear to him and follows other than the way of the believers} [An-Nisa: 115]. He made the way of the believers consistent with what the Messenger brought, so every Consensus is based on a text.",
    "foot_note": "1. See: \"Al-Muwatta - Narration of Yahya Al-Laythi\" by Imam Malik (1/419) number (240) Ihya al-Turath edition. \n2. See: \"Majmu' al-Fatawa\" by Ibn Taymiyyah (19/91).",
    "book_id": "267",
    "new_page_number": 27
  },
  {
    "serial_number": "3425143",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 29,
    "volume_number": 1,
    "text": "Third Evidence: Only those who are anomalous (Shadh) opposed in that, as clarified by Al-Amidi (1). It suffices to know that the opponent in that is among those who deviated.\nFourth Evidence: When scholars held a view in an issue, they either held it by pure opinion or by an opinion based on evidence, and definitely it is the latter. Since it is the latter, this indicates that what they agreed upon is definitely based on a text. However, it is not required that this basis be known, nor does the deduction depend on it; rather, the deduction is made directly upon merely knowing the Consensus on a specific issue.\n\nQuestion and Answer\nMust there exist in the Ummah someone who knows the basis (textual evidence) of the Consensus?\nSheikh al-Islam has words indicating this, although his words that I found are not explicit. The most explicit I found is in his book \"Al-Jawab al-Sahih\" (2). Note that he has explicit words regarding the issue of Abrogation by Consensus, stating that the basis of the Consensus that abrogates the text must be known (3). Ibn Taymiyyah said: Ibn Jarir and a group say: Consensus is not convened except from a text they narrated from the Messenger, despite their saying in the validity of Analogy. We do not stipulate that all of them knew the text and narrated it by meaning as reports are narrated, but we investigated the instances of Consensus and found them all text-based. Many scholars might not know the text yet agreed with the group, just as one might argue by analogy while there is a Consensus he did not know, so he agrees with the Consensus (4).",
    "foot_note": "1. See: \"Al-Ihkam\" by Al-Amidi (1/261). \n2. See: \"Al-Jawab al-Sahih li-man Baddala Din al-Masih\" by Ibn Taymiyyah (1/361-362). \n3. See: \"Majmu' al-Fatawa\" by Ibn Taymiyyah (28/112). \n4. Majmu' al-Fatawa (19/196).",
    "book_id": "267",
    "new_page_number": 28
  },
  {
    "serial_number": "3425144",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 30,
    "volume_number": 1,
    "text": "The important point is if it is said: There must be someone in the Ummah who knows the basis of the Consensus. It is said: This does not benefit us practically; because practically, whenever we see Consensus, we use it as proof, whether we know the basis or not, and whether we know if there is someone in the Ummah who knows its basis or not. This is because the Sharia clarified that Consensus is proof and did not stipulate knowing the basis. Therefore, every evidence indicating that Consensus is proof is evidence for not stipulating knowledge of the basis.\n\nSeventh Issue\nAuthority of Consensus Before and After Disagreement\nThe intent of this issue is: To clarify that Consensus is authoritative whether Consensus convened after a disagreement, or a disagreement occurred after Consensus.\nAs for Consensus followed by disagreement, there is no doubt it is authoritative, and the dissenters must return to the Consensus. This is supported by every evidence indicating that Consensus is proof. So whoever opposes the old Consensus, his opposition is definitely an error; because he opposed the truth which is what the people of knowledge agreed upon. This has parallels and examples, such that Ibn al-Qayyim, may Allah have mercy on him, said in \"Mukhtasar al-Sawa'iq\": There are two hundred examples of this (1). Meaning: That an old Consensus occurred, then a disagreement occurred. This is precise Fiqh, which the student of knowledge should scrutinize, for there are not a few issues where disagreement is narrated, but if the matter is scrutinized, it becomes clear that the disagreement is after a previous Consensus; thus, the disagreement is rejected by the previous Consensus.",
    "foot_note": "1. See: \"Mukhtasar al-Sawa'iq\" by Ibn al-Qayyim (p. 276). With the wording: \"...And more eloquent than this is the narration of Consensus often on what the old Consensus contradicts. This is very frequent and only the people of knowledge know it. If we traced it, it would exceed two hundred places.\"",
    "book_id": "267",
    "new_page_number": 29
  },
  {
    "serial_number": "3425145",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 31,
    "volume_number": 1,
    "text": "Also, Consensus may convene after a disagreement, meaning there are two opinions on an issue, then the scholars agree on one of these two opinions. This Consensus is proof, and every evidence indicating Consensus is proof indicates this is proof. When scholars agreed on one of the opinions, their consensus revealed to us the preponderant of these two opinions and clarified to us that the first opinion is correct excluding the second opinion (1).\nI draw attention to the fact that Abu Ya'la in \"Al-Uddah\" (2) attributed to Imam Ahmad a narration that he does not see Consensus after disagreement as authoritative. However, this attribution and what it relied upon is questionable; therefore, Abu al-Khattab al-Hanbali (3) - who is Abu Ya'la's student - did not agree with him in making this opinion a narration from Imam Ahmad, nor did Ibn Qudamah in \"Rawdat al-Nazir\" (4).\nThe practical practice of Ahl al-Sunnah indicates it is authoritative. Ahl al-Sunnah used the consensus of the people of knowledge as evidence for the prohibition of rebelling against the ruler, even though there was disagreement among the Successors (Tabi'in), but Consensus convened after that. There are examples for this issue, including:\nFirst Example: The issue of rebelling against the ruler. There was disagreement on the issue among the Successors, then Consensus convened after that. Ibn Taymiyyah said in \"Minhaj al-Sunnah\": The saying of Ahl al-Sunnah settled on not rebelling against the ruler (5).",
    "foot_note": "1. See regarding this: \"Al-Mu'tamad\" by Abu al-Husayn (2/38), \"Al-Ihkam\" by Al-Amidi (1/275), \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/504), \"Sharh Mukhtasar al-Rawdah\" by Al-Tufi (3/95) and others. \n2. See: \"Al-Uddah\" by Abu Ya'la (4/1105). \n3. See: \"Al-Tamhid fi Usul al-Fiqh\" by Abu al-Khattab (3/298). \n4. See: \"Rawdat al-Nazir\" by Ibn Qudamah (1/428-429). \n5. See: \"Minhaj al-Sunnah\" by Ibn Taymiyyah (4/529).",
    "book_id": "267",
    "new_page_number": 30
  },
  {
    "serial_number": "3425146",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 32,
    "volume_number": 1,
    "text": "Imam Ahmad in \"Usul al-Sunnah\" (1), Ali bin al-Madini (2), the two Razis (Abu Hatim and Abu Zur'ah) in their \"Treatise on Creed\" (3), Ibn Abi Zayd al-Qayrawani (4), Al-Muzani (5), and a large group of Sunni Imams narrated the Consensus of Ahl al-Sunnah on that. Indeed, they stated that whoever dissents is an innovator. This indicates that they view the issue as consensual even if disagreement occurred before that during the era of the Successors.\nSecond Example: The Companions differed on Riba al-Fadl (usury of excess). Ibn Abbas (6) held that it is not usury, and some of his companions followed him, but Consensus convened after that (7).\nThird Example: Meat of domestic donkeys. A disagreement occurred among the Companions regarding its prohibition (8), then Consensus convened on its prohibition (9).\nFourth Example: Obligation of Ghusl for one who had intercourse without ejaculation. It was previously mentioned that there was disagreement in the issue, then Consensus convened.",
    "foot_note": "1. See: \"Usul al-Sunnah\" by Imam Ahmad (p. 46). \n2. See: \"Sharh Usul I'tiqad Ahl al-Sunnah\" by Al-Lalaka'i (1/189) number (318) in the chapter of the creed of Ali bin al-Madini. \n3. See: \"Sharh Usul I'tiqad Ahl al-Sunnah\" by Al-Lalaka'i (1/199) number (321), and (1/204) number (323) in the chapter of the creed of the two Razis. \n4. See: \"Introduction to Risalah al-Qayrawani\" (p. 61), Dar Al-Asimah edition. \n5. See: \"Sharh al-Sunnah\" by Al-Muzani (p. 84). \n6. See: \"Al-Awsat\" by Ibn al-Mundhir (10/181). \n7. See the Consensus in: \"Al-Awsat\" by Ibn al-Mundhir (10/180). \n8. See the disagreement in: \"Al-Tamhid\" by Ibn Abd al-Barr (10/123), and cited in \"Al-Mughni\" (9/409) and approved. \n9. See the Consensus in: \"Al-Awsat\" by Ibn al-Mundhir (2/428), and in \"Al-Tamhid\" by Ibn Abd al-Barr (10/123).",
    "book_id": "267",
    "new_page_number": 31
  },
  {
    "serial_number": "3425147",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 33,
    "volume_number": 1,
    "text": "Examples of this are not few. The evidence that it is authoritative is every evidence indicating that Consensus is authoritative; because Consensus reveals the preponderant opinion from the preponderated opinion.\nAs for those who disagreed on this from the theologians and some Usul scholars who were influenced by the theologians when they said: Opinions do not die with the death of their holders; their saying is preponderated (incorrect) based on what was previously mentioned.\n* * *\n\nEighth Issue\nCriterion for the Anomalous (Shadh) Opinion\nYour eyes often fall upon the saying of scholars in their speech: \"This saying is anomalous (Shadh).\" So what is the criterion for that anomalous saying?\nIt is said, and success is with Allah Almighty: The criterion for the anomalous saying - and Allah knows best - is: The saying contrary to Consensus.\nSo if Consensus convenes on an issue, then a saying arises, this saying is anomalous. What I mentioned is derived from the practice of Ibn Qudamah in \"Rawdat al-Nazir\" (1).\nThere has been an expansion by many scholars in describing an opinion as anomalous, to the point that if an opinion becomes famous among the people of a land and someone opposes it, they say: His opinion is anomalous on the grounds that he opposed the people of the land or the common and widespread view.\nThis is an error. The opinion that became famous among the people of the land might only be the school of thought (Madhhab) popular among the people of that land. For instance, the Hanbali school might be popular among them, so the people of the land adopt this opinion because they are Hanbalis, and this opinion is unique to the Hanbali school. So if someone opposes them based on evidence, seeing himself following the Hanafis, Malikis, and Shafi'is in that, his opinion is described",
    "foot_note": "1. See: \"Rawdat al-Nazir\" by Ibn Qudamah (1/410), his wording: \"Anomaly (Shudhudh) is realized by opposition after agreement.\"",
    "book_id": "267",
    "new_page_number": 32
  },
  {
    "serial_number": "3425148",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 34,
    "volume_number": 1,
    "text": "as anomalous, and this is an error. The usage of 'anomalous' should not be expanded but must be regulated by its criterion, which is every opinion contrary to Consensus.\n\nQuestion and Answer\nA disagreement might occur between Companions and Successors, then Consensus convenes on one of the opinions. Is it said that the opinion of the first Companion who disagreed or the Successor is considered anomalous?\nThe answer to this is to say: Before the convening of Consensus, the disagreement was valid (Sa'igh); because Consensus had not convened, so it is not described as anomalous. But after the convening of Consensus, his opinion is described as anomalous; because he adopted an opinion contrary to Consensus. Ibn Abd al-Barr used this in some issues.\n* * *\n\nNinth Issue\nAuthority of the Consensus of Experts of Each Art in Their Art\nThis is what was mentioned by Al-Razi in \"Al-Mahsul\" (1), Ibn Qudamah in \"Rawdat al-Nazir\" (2), Sheikh al-Islam Ibn Taymiyyah, may Allah Almighty have mercy on him, as in \"Majmu' al-Fatawa\" (3), Al-Zarkashi in \"Al-Bahr al-Muhit\" (4), Ibn al-Qayyim as in \"Mukhtasar al-Sawa'iq\" (5), and others.\nAbu Hatim said in \"Al-Marasil\": And the agreement of the people of Hadith on something is proof (6).",
    "foot_note": "1. See: \"Al-Mahsul\" by Al-Razi (4/198). \n2. See: \"Rawdat al-Nazir\" by Ibn Qudamah (1/392-393). \n3. See: \"Majmu' al-Fatawa\" by Ibn Taymiyyah (18/49, and 51) and Al-Minhaj (8/418, 419). \n4. See: \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/415). \n5. See: \"Mukhtasar al-Sawa'iq\" by Ibn al-Qayyim (p. 563). \n6. See: \"Al-Marasil\" by Ibn Abi Hatim (p. 192).",
    "book_id": "267",
    "new_page_number": 33
  },
  {
    "serial_number": "3425149",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 35,
    "volume_number": 1,
    "text": "So if the people of Hadith agree on a saying, it is proof. If the people of Fiqh agree on a saying, it is proof. Indeed, if the people of Language agree on a saying, it is proof among the people of Language. Therefore, the consensus of the people of every art is proof.\nAmong the consensuses in Language: Al-Azhari narrated the consensus of the people of Language that 'Iman' linguistically means 'Tasdiq' (verification/belief) (1), meaning in language not in Sharia. This is proof; because the consensus of the people of every art is proof, and whoever opposes is refuted by this consensus.\nAs for in Sharia, it is: Word, deed, and belief; it increases with obedience and decreases with disobedience (2).\n\nObjection and Rebuttal\nIf it is said: It was previously mentioned that Consensus is proof in Sharia because Sharia is preserved, so how does this apply to Language?\nIt is said: Because Language is a means to understand Sharia; therefore Al-Mu'allimi, may Allah have mercy on him, mentioned: That Language is preserved by the preservation of the Quran. He Almighty said: {Indeed, it is We who sent down the Dhikr (Quran) and indeed, We will be its guardian} [Al-Hijr: 9]. He said: And part of that is that the language of the Arabs is preserved because the Quran is understood by it (3).",
    "foot_note": "1. See: \"Tahdhib al-Lugha\" by Al-Azhari (15/368). Wording: \"And the people of knowledge among linguists and others agreed that the meaning of (Iman) is: Tasdiq (Verification/Belief).\" \n2. Sheikh al-Islam Ibn Taymiyyah said in \"Majmu' al-Fatawa\" (3/151): \"From the principles of Ahl al-Sunnah is that Religion and Iman are word and deed: word of the heart and tongue, and deed of the heart, tongue, and limbs, and that Iman increases with obedience and decreases with disobedience.\" And he said - quoting Ibn Abd al-Barr affirming him - (7/330): \"The people of Fiqh and Hadith agreed that Iman is word and deed, and there is no deed without intention, and Iman according to them increases with obedience and decreases with disobedience, and all acts of obedience are Iman according to them...\". \n3. See: \"Al-Tankil\" by Al-Mu'allimi Al-Yamani (1/234).",
    "book_id": "267",
    "new_page_number": 34
  },
  {
    "serial_number": "3425150",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 36,
    "volume_number": 1,
    "text": "Issue\nThe saying of the theologians (Mutakallimun) is not counted, neither in Fiqh nor in Usul al-Fiqh, and in Creed (Aqidah) essentially; because theologians are not people of knowledge (scholars).\nIbn Abd al-Barr said: \"The people of Fiqh and Athar (traditions) from all regions agreed that the people of Kalam (theology) are people of innovation and deviation and are not considered by anyone among the ranks of jurists. Rather, the scholars are the people of Athar and understanding of it, and they excel in it by precision, discernment, and understanding\" (1).\nSo if theologians disagree in an issue, their disagreement is not used as proof against it [consensus], and Imam Ibn al-Qayyim, may Allah Almighty have mercy on him, clarified this (2).\nSo if a consensus of Ahl al-Sunnah occurs in a creedal issue; the opposition of theologians is not cited. However, if the theologian is a jurist, his saying in Fiqh is considered; because he is a jurist, not because he is a theologian. But practically, if this man disagreed in an issue and was unique in it, his saying is innovated (new); because the school of theologians is late, so he is refuted by the Consensus that preceded him.\n* * *\n\nTenth Issue\nCondition of the Extinction of the Era in Consensus\nA group stipulated for the validity of Consensus that the era must pass (expire). So if scholars in the era of the Companions agreed on a saying, this Consensus is not considered valid until this era ends and its Mujtahids pass away. If its Mujtahids pass away and none of them retracted his opinion, then the Consensus is valid. But if they gathered on an opinion, then one of the late-dying Companions",
    "foot_note": "1. See: \"Jami' Bayan al-Ilm wa Fadlihi\" by Ibn Abd al-Barr (2/942). \n2. As in: \"Mukhtasar al-Sawa'iq\" by Ibn al-Qayyim (p. 563).",
    "book_id": "267",
    "new_page_number": 35
  },
  {
    "serial_number": "3425151",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 37,
    "volume_number": 1,
    "text": "like Anas or Jabir retracted, then this Consensus is not considered valid (1).\nThis opinion, in terms of evidence, is preponderated (weak) and not relied upon; because the evidences are clear on the authority of Consensus and did not stipulate the extinction of the era, and the mention of evidences has preceded. So whenever Consensus is realized, it becomes proof, even if realized for a moment, due to the generality of the evidences. It is supported by the fact that if they gathered even for a moment, the Saved Sect is among them, and the saying of the Saved Sect is truth as previously established.\nSo stipulating the extinction of the era has no evidence for it; rather, evidences are against it. Whatever the proponents of stipulating the extinction of the era used as evidence is refuted. Here is the clarification of some of it:\n1 - Abu Ya'la (2) attributed that to Imam Ahmad and based it on what Al-Bayhaqi and others narrated that Ali bin Abi Talib, may Allah be pleased with him, retracted his opinion on the prohibition of selling mothers of children (Umm Walad), and Ubaydah Al-Salmani, the famous Successor, said: \"Your opinion with the opinion of Umar is more beloved to me than your opinion alone\" (3).\nThe point of evidence: That it was valid for Ali to oppose the Consensus, for when his saying and Umar's saying agreed, the issue became a Consensus, so it was valid for him to oppose that; because Ali sees that Consensus",
    "foot_note": "1. See regarding this: \"Al-Mu'tamad\" by Abu al-Husayn (2/41) and following, and (2/70), \"Al-Uddah fi Usul al-Fiqh\" by Abu Ya'la (4/1095) and following, \"Al-Tamhid fi Usul al-Fiqh\" by Abu al-Khattab (3/346) and following, \"Al-Ihkam\" by Al-Amidi (1/256-261), \"Al-Mahsul\" by Al-Razi (4/147), \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/478) and others. \n2. See: \"Al-Uddah fi Usul al-Fiqh\" by Abu Ya'la (4/1095). \n3. Narrated by Abd al-Razzaq in \"Al-Musannaf\" (13224), Ibn Abi Shaybah in \"Al-Musannaf\" (6/436), Al-Bayhaqi in \"Al-Sunan Al-Kubra\" (10/343, and 438), Ibn Abd al-Barr in \"Bayan Jami' al-Ilm wa Fadlihi\" (1616) and others, and authenticated by Al-Albani in \"Al-Silsilah Al-Sahihah\" (5/416).",
    "book_id": "267",
    "new_page_number": 36
  },
  {
    "serial_number": "3425152",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 38,
    "volume_number": 1,
    "text": "is not proof until the era expires, and the era had not expired; because Ali had not died.\nRelying on such a thing contains significant speculation, so Abu al-Khattab in \"Al-Tamhid\" did not agree with Abu Ya'la on this (1). This is because the agreement of Umar and Ali is not Consensus but the meeting of two. Consensus implies that the scholars agree such that a group speaks and others do not oppose them. But for Ali and Umar to agree on a saying then one of them retracts his saying, this is not Consensus.\nFrom another aspect: Abu al-Khattab (2) and others mentioned that Umar's speech with Ali was by way of consultation.\nSo the point is: The saying of Umar and Ali is not Consensus. The Consensus sought is the agreement of the Mujtahids of the Ummah. As for two people saying a statement then one of them retracting his statement, this is not considered Consensus; thus attributing it to Ahmad is questionable.\nIn fact, the first to explicitly establish this condition was Judge Abu Ali Al-Jubba'i the Mu'tazilite as in \"Al-Mu'tamad\" (3), and Abu al-Husayn Al-Basri the Mu'tazilite, author of Al-Mu'tamad, also adopted it. Al-Ala'i (4) did not attribute this saying except to Abu Ali Al-Jubba'i the Mu'tazilite, which indicates that they do not see that anyone like Imam Ahmad said this opinion, especially since attributing it to Ahmad by Abu Ya'la's deduction is questionable as previously established.\nSo it is important to know that this opinion was not held by the early scholars, but rather a group of Mu'tazilah adopted it, then some late Usul scholars adopted it.",
    "foot_note": "1. See: \"Al-Tamhid fi Usul al-Fiqh\" by Abu al-Khattab (3/353). \n2. See: \"Al-Tamhid fi Usul al-Fiqh\" by Abu al-Khattab (3/353), wording: \"As for the report of Ali, the correct version is that he said: My opinion and the opinion of Commander of the Faithful Umar were...\". \n3. See: \"Al-Mu'tamad\" by Abu al-Husayn (2/70). \n4. See: \"Ijmal al-Isabah fi Aqwal al-Sahabah\" by Al-Ala'i (p. 20).",
    "book_id": "267",
    "new_page_number": 37
  },
  {
    "serial_number": "3425153",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 39,
    "volume_number": 1,
    "text": "2 - They used as evidence what Al-Bukhari and Muslim narrated from Anas bin Malik: \"That a man who had drunk alcohol was brought to the Prophet, peace and blessings be upon him, so he beat him with two palm stalks about forty times.\" He said: Abu Bakr did it too. When it was Umar['s time], he consulted the people, and Abd al-Rahman said: The lightest of punishments (Hadd) is eighty, \"So Umar ordered it\" (1).\nThe point of evidence: Since lashing the drinker forty was the practice during the time of Abu Bakr and part of Umar's caliphate, this was considered Consensus, then Umar disagreed, and the cause was the non-extinction of the era.\nIbn al-Qayyim answered this (2) that it is a matter of discretionary punishment (Ta'zir) which varies based on interests with time and place. Umar saw fit to be severe regarding drinking alcohol due to its spread, so this is from Ta'zir and has no relation to the validity of opposing Consensus if the era has not expired.\nIf this is clear, then know that the saying stipulating the extinction of the era is not correct due to the following:\nFirst: The first known to hold this condition are the theologians.\nSecond: The opposition of this condition to the evidence.\nThird: What they relied upon has no indication as preceded.\nFourth - and finally -: The saying stipulating the extinction of the era, if scrutinized, is unregulated, as pointed out by Al-Ruyani (3) as quoted by Al-Zarkashi in \"Al-Bahr al-Muhit\" (4). He mentioned words implying it is unregulated, then wanted to mention a criterion for it, which contains a problem because if referred to a specific time, Mujtahids might remain after this time, so new Mujtahids exist.",
    "foot_note": "1. Narrated by Al-Bukhari (6773), and Muslim (1706/35) - wording is his. \n2. See: \"Zad al-Ma'ad\" by Ibn al-Qayyim (5/44). \n3. See: \"Bahr al-Madhhab\" by Al-Ruyani (11/130-131). \n4. See: \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/490-491).",
    "book_id": "267",
    "new_page_number": 38
  },
  {
    "serial_number": "3425154",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 40,
    "volume_number": 1,
    "text": "For in the era of the Companions, new Mujtahids from the Successors emerged, like Sa'id bin al-Musayyib. So it follows from this that one must wait until Sa'id's era ends, and other Mujtahids might emerge, so they wait, and so on... etc.\nIf it is said: The meaning is that all Mujtahids in the era of the Companions die? We say: Even if this is conceivable in the era of the Companions, it is difficult to conceive in those after them, from a practical realistic perspective. In fact, its implication is rejecting many consensuses; because their opponent can say: Have you proven the extinction of the era so that this Consensus is proof?\nTwo things suffice in weakening this condition:\nFirst: That there is no evidence for it, and the first to say it were the Mu'tazilah as previously explained.\nSecond: That the evidence is against it.\n* * *\n\nEleventh Issue\nIt is Not Permissible in Sharia to Introduce a New Opinion (1)\nIf scholars differ on two opinions, it is not valid for anyone to introduce a third new opinion. If the Ummah differs on four opinions, it is not valid for anyone to introduce a fifth opinion. If the Ummah has only one opinion, it is not valid for anyone to introduce a second opinion. Whoever does that has opposed Consensus from the aspect that since the Ummah differed on two opinions, they agreed that the truth is in one of these two opinions. From another aspect, he has fallen into innovation (Ihdat), and innovation is forbidden",
    "foot_note": "1. See regarding this: \"Al-Mu'tamad\" by Abu al-Husayn (2/44) and following, and (2/70), \"Al-Uddah fi Usul al-Fiqh\" by Abu Ya'la (4/1113-1115), \"Al-Tamhid fi Usul al-Fiqh\" by Abu al-Khattab (3/310-314), \"Al-Ihkam\" by Al-Amidi (1/268-272), \"Al-Mahsul\" by Al-Razi (4/127-130), \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/516) and following, and others.",
    "book_id": "267",
    "new_page_number": 39
  },
  {
    "serial_number": "3425155",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 41,
    "volume_number": 1,
    "text": "in Sharia. Ibn Taymiyyah (1) may Allah have mercy on him used as evidence for prohibiting innovation the generality of the hadith of Aisha, may Allah be pleased with her, who said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever introduces into this affair of ours that which is not of it, it is rejected\" (2).\nFrom that, if the Companions differed on two opinions, it is not permissible to introduce a third opinion. Imam Ahmad was asked about a man who says: If the Companions differed on two opinions, we depart from their two opinions. He said: This is a foul saying, this is the saying of the people of innovation (3). So it is not permissible to introduce a new opinion. This is what the early scholars were upon. Its permissibility was attributed to some Hanafis (4), but the attribution is questionable. Rather, those who see the permissibility of introducing a new opinion are the Zahiris (5), like Dawood Al-Zahiri and those after him; hence his school became an innovated school. For that reason, Sheikh al-Islam Ibn Taymiyyah said in the fifth volume of \"Minhaj al-Sunnah\": And every opinion the Zahiris were unique in is an error (6). He pointed to the reason, which is that they are latecomers.\nIbn Rajab clarified this further in \"Fath al-Bari\" (7) and stated that the Zahiris see the permissibility of introducing a new opinion, so they thereby opposed the early Salaf. He also pointed to this in \"Fadl Ilm al-Salaf 'ala al-Khalaf\" (8).",
    "foot_note": "1. See: \"Majmu' al-Fatawa\" by Ibn Taymiyyah (1/334), (11/613), and (22/188-189). \n2. Narrated by Al-Bukhari (2697), and Muslim (1718). \n3. See: Al-Musawwada p. 315 and Al-Uddah by Abu Ya'la (4/1059). \n4. As in: \"Al-Ihkam\" by Al-Amidi (1/268), \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/517-518) and others. \n5. As in: \"Al-Mu'tamad\" by Abu al-Husayn (2/44), and (2/70), \"Al-Ihkam\" by Al-Amidi (1/268), \"Al-Mahsul\" by Al-Razi (4/127), \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/518) and others. \n6. See: \"Minhaj al-Sunnah\" by Ibn Taymiyyah (5/178). \n7. See: \"Fath al-Bari\" by Ibn Rajab (4/242). \n8. See: \"Fadl Ilm al-Salaf 'ala al-Khalaf\" by Ibn Rajab (p. 67). Dar Al-Sumay'i - Second Edition.",
    "book_id": "267",
    "new_page_number": 40
  },
  {
    "serial_number": "3425156",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 42,
    "volume_number": 1,
    "text": "So the Zahiri school is innovated in Fiqh and in Creed; because Dawood Al-Zahiri has creedal errors, and the Salaf were severe against Dawood in his Fiqh school and his Creed school, as known by referring to Dawood's biography by Ibn Abi Hatim in \"Al-Jarh wa al-Ta'dil\". The biography is missing from the printed \"Al-Jarh wa al-Ta'dil\" book, but it exists in \"Lisan al-Mizan\" by Hafiz Ibn Hajar (1). What concerns us in what we are dealing with is his Fiqh school.\nThe reason for his deviation in Fiqh goes back to matters Ibn al-Qayyim mentioned four of (2), and Ibn Rajab added a fifth, which is the permissibility of introducing a new opinion, so they oppose what the early Salaf were upon. Then Ibn Rajab mentioned (3) that it is a mistake to say that the Zahiri school is the school of Ahl al-Hadith as has become common and spread in these later eras.\nAl-Shatibi mentioned in two places in \"Al-I'tisam\" that scholars continue to consider the Zahiris innovators (4). Also among those who declared them innovators is Ibn al-Arabi al-Maliki (5) and other people of knowledge. Severity against the Zahiris was famous among the Maliki Maghrebis; because Ibn Hazm was from the people of the Maghreb, and he was the one who made this school famous and broadcast it, leading to the intensification of the Malikis' confrontation and opposition to him.",
    "foot_note": "1. See: \"Lisan al-Mizan\" by Ibn Hajar (2/422-424). \n2. See: \"I'lam al-Muwaqqi'in\" by Ibn al-Qayyim (3/98-107). \n3. See: \"Fadl Ilm al-Salaf 'ala al-Khalaf\" by Ibn Rajab (p. 67). \n4. See: \"Al-I'tisam\" by Al-Shatibi (2/457), and (3/198). \n5. See: \"Siyar A'lam al-Nubala\" by Al-Dhahabi (18/188-190) where Ibn al-Arabi was severe against the Zahiris and Ibn Hazm, and Al-Dhahabi critiqued him on that.",
    "book_id": "267",
    "new_page_number": 41
  },
  {
    "serial_number": "3425157",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 43,
    "volume_number": 1,
    "text": "Issue\nTalfeeq (Patching/Amalgamation) Between Opinions\nThe meaning of Talfeeq: That scholars differ on two opinions, and a third opinion is patched together that does not contradict the two opinions from every aspect, but agrees with each of them from an aspect. However, if it contradicts both opinions from every aspect, it is rejected and is [a form of] introducing a new opinion.\nA group of late people of knowledge, mostly theologians, held the permissibility of Talfeeq, such as Al-Razi (1), Al-Amidi (2), Al-Tufi (3), and Ibn Badran in his \"Hashiyah on Rawdat al-Nazir\" (4). Al-Zarkashi (5) attributed this to Al-Shafi'i, but the attribution is questionable and not correct. Rather, the theologians and some late jurists became famous for this.\nIt is stipulated in Talfeeq that it should not clash with all previous opinions from every aspect, but rather take something from every opinion. If it clashes with them, it is not valid.\nExamples of clash where Talfeeq is invalid: What Ibn Badran mentioned in his \"Hashiyah on Rawdat al-Nazir\", which is that scholars differed on two opinions regarding the retaliation (Qawad) against a father for [killing] his child:\nA- Some said - and they are the majority - that the father is not killed in retaliation for his child.\nB- Malik held that he is killed for him if he was deliberate, intending to kill him, he is killed for it, unlike if he did not intend it (6).",
    "foot_note": "1. See: \"Al-Mahsul\" by Al-Razi (4/128). \n2. See: \"Al-Ihkam\" by Al-Amidi (1/269). \n3. See: \"Sharh Mukhtasar al-Rawdah\" by Al-Tufi (3/93-94). \n4. See: \"Hashiyah Ibn Badran 'ala Rawdat al-Nazir\" (1/312). \n5. See: \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/518-519). \n6. See: \"Hashiyah Ibn Badran 'ala Rawdat al-Nazir\" (1/312).",
    "book_id": "267",
    "new_page_number": 42
  },
  {
    "serial_number": "3425158",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 44,
    "volume_number": 1,
    "text": "So if someone were to voice a third opinion, that: The father is killed absolutely [regardless of intent], his saying would be contrary to the two previous opinions. It contradicts the majority because the majority do not see that he is killed, and it contradicts Malik's opinion because Malik does not see that the unintentional killer is killed. Such a case is not called Talfeeq.\nExamples of Valid Talfeeq:\nFirst Example: Scholars differed in defining the time for wiping over leather socks on two opinions:\nFirst Opinion: Malik held in one of his two opinions that it is not defined by a time, whether in travel or residence (1). This opinion was attributed to Rabi'ah and others (2).\nSecond Opinion: The opinion of the majority (3) that the traveler is limited to three days and the resident to a day and a night, according to the hadith of Ali narrated by Muslim (4).\nSo if someone says: It is limited for the traveler to three days and for the resident to a day and a night, unless he is in a travel of necessity and is hard pressed for time; then it is not limited. Such an opinion is patched (Mulaffaq); it agreed with the majority except in the case of necessity, and agreed with the opinion that does not say there is a limit in the case of choice.\nSecond Example: The Companions, may Allah be pleased with them, differed on two opinions regarding facing the Qibla and turning one's back to it when answering the call of nature (5):",
    "foot_note": "1. See: \"Al-Awsat\" by Ibn al-Mundhir (2/86), and \"Al-Tamhid\" by Ibn Abd al-Barr (11/151-152). \n2. See: \"Al-Awsat\" by Ibn al-Mundhir (2/87). \n3. See: \"Al-Tamhid\" by Ibn Abd al-Barr (11/152), and \"Al-Mughni\" by Ibn Qudamah (1/209). \n4. Narrated by Muslim (276). \n5. See the opinions in: \"Al-Majmu'\" (2/81), \"Sharh Muslim\" (3/154), and \"Sharh Abi Dawood\" (p. 106) all three by Al-Nawawi, and \"Al-Mughni\" (1/209) and others.",
    "book_id": "267",
    "new_page_number": 43
  },
  {
    "serial_number": "3425159",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 45,
    "volume_number": 1,
    "text": "First Opinion: The Qibla is neither faced nor is the back turned to it when answering the call of nature, neither in built-up areas nor in the desert. This is the opinion of Abu Ayyub Al-Ansari, narrated by Al-Bukhari and Muslim (1).\nSecond Opinion: The Qibla is faced and backed, but in built-up areas, not in open space or desert. This is the opinion of Ibn Umar, narrated by Al-Daraqutni (2) and a group.\nSo if someone says: The back is turned to it but it is not faced, his saying would be a patched opinion with respect to the opinions of the Companions, not the opinions of the people of knowledge; because disagreement occurred among the people of knowledge after that.\nThird Example: The Companions differed on two opinions regarding the regular Sunnah prayers (Rawatib) during travel:\nFirst Opinion: That the regular Sunnah prayers in travel are prayed absolutely. This is the opinion of the majority of Companions like Jabir, may Allah be pleased with him (3), and Al-Hasan Al-Basri attributed it to the Companions (4).\nSecond Opinion: That they are not prayed. This is the opinion of Ibn Umar, may Allah be pleased with him. In a narration from Ibn Umar, the night regular Sunnahs are prayed, not the day regular Sunnahs, they are not prayed, i.e., for the traveler (5). These are two known opinions of the Companions.\nSo if someone says: The traveler does not pray any of the regular Sunnahs except the two rak'ahs of Fajr, his saying would be patched and innovated relative to the opinions of the Companions, may Allah be pleased with them.\nBenefit: The majority of the people of knowledge from the followers of the four schools hold that the traveler prays the regular Sunnahs night and day. This is the school of Hanafis, Malikis, Shafi'is, and Hanbalis, but some late Hanafis and Hanbalis disagreed.",
    "foot_note": "1. Narrated by Al-Bukhari (394), and Muslim (264). \n2. Narrated by Al-Daraqutni (1/92) number (161), and he said after it: This is authentic, all are trustworthy. \n3. See: \"Al-Awsat\" by Ibn al-Mundhir (5/248). \n4. See: \"Al-Awsat\" by Ibn al-Mundhir (5/248), and (5/250). \n5. See: \"Al-Awsat\" by Ibn al-Mundhir (5/247-248).",
    "book_id": "267",
    "new_page_number": 44
  },
  {
    "serial_number": "3425160",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 46,
    "volume_number": 1,
    "text": "As for the famous opinion among the four schools, the traveler prays the regular Sunnahs night and day (1).\nThe point: Whoever makes an exception for the Fajr Sunnah, his saying is a patched opinion. What was reported from Ibn Umar about excluding the Fajr Sunnah has an unsound chain of narration (2). And the hadith that the Prophet, peace and blessings be upon him, used to persist in travel on the two rak'ahs of Fajr and Witr is not authentic.\nThe view held by the early scholars and jurists is that Talfeeq is not valid, and it was only known by the theologians and late scholars as previously mentioned. They refute Talfeeq with the following:\nFirst Refutation: It was only known by late scholars from the theologians and others.\nSecond Refutation: When the Companions or those after them differed on two opinions, the Victorious Group is on one of these two opinions, and it has adopted the whole truth. Therefore, Talfeeq is abandoning part of the truth.\nThird Refutation: The one who patched came out with a preponderated (incorrect) opinion definitely because he took a part from this and a part from that, so he must have taken a part from the preponderated opinion and formed an opinion collected from two preponderated opinions instead of the third preponderant opinion.\nFourth Refutation: Every evidence prohibiting innovation (Ihdat) is a refutation of the opinion of Talfeeq.\nFinally: I saw some people of knowledge attribute to some scholars the opinion of Talfeeq based on the fact that their action indicates that in some issues, as they attributed this opinion to Sheikh al-Islam Ibn Taymiyyah. I did not find anything in his books indicating that he sees the patched opinion [as valid], nor did I see anything from the words of his student Ibn al-Qayyim indicating that Ibn al-Qayyim himself or his Sheikh sees patching between",
    "foot_note": "1. See this in: \"Badai' al-Sanai'\" by Al-Kasani (1/93), \"Tabyin al-Haka'iq\" (1/211) by Al-Zayla'i, \"Al-Majmu'\" by Al-Nawawi (4/400-401), and \"Al-Insaf\" by Al-Mardawi (2/322). \n2. Narrated by Ibn Abi Shaybah in Al-Musannaf (1/342) and the report is weak due to contradicting the narration of the majority from him.",
    "book_id": "267",
    "new_page_number": 45
  },
  {
    "serial_number": "3425161",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 47,
    "volume_number": 1,
    "text": "opinions. I did not see anyone who spoke about the patched opinion in the past attributing this to Ibn Taymiyyah quoting his words. Rather, the reliance of those who attribute this to Sheikh al-Islam from among some contemporaries is that Ibn Taymiyyah decided on patched opinions.\nIt is said: There is a difference between a scholar's theorizing (Ta'sil) and his application (Tanzil) of this theorizing to examples and incidents. A scholar might err and introduce a new opinion, but this does not indicate that he views introducing a new opinion as permissible. Indeed, he might use a weak hadith as proof which he clarified as weak in another place, forgetting this, so he used it. Is it said that he views the permissibility of using weak hadiths in rulings? No. Therefore, Ata said, as narrated by Ibn Abd al-Barr in \"Jami' Bayan al-Ilm wa Fadlihi\": And the weakest knowledge also is the knowledge of observation, that a man says: I saw so-and-so doing such-and-such, and perhaps he did it forgetfully (1). So one should not rely on the application of a scholar, for he may err in application and action, but reliance is on his theorizing.\n* * *\n\nTwelfth Issue\nMethod of Knowing Consensus\nConsensus is known if a scholar of induction narrates it. If a scholar of induction narrates a Consensus, the default is the validity of his Consensus unless its breach is proven, and the matter is easy in this. Thus Ibn al-Mundhir narrated - and Ibn al-Mundhir holds a high rank in induction and knowing opinions -, and worthier than Ibn al-Mundhir is Muhammad bin Nasr Al-Khuza'i, and worthier than him is Imam Ahmad",
    "foot_note": "1. See: \"Jami' Bayan al-Ilm wa Fadlihi\" by Ibn Abd al-Barr (1448).",
    "book_id": "267",
    "new_page_number": 46
  },
  {
    "serial_number": "3425162",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 48,
    "volume_number": 1,
    "text": "and Al-Shafi'i and Ishaq ibn Rahwayh. If one of these Imams or others narrates a Consensus, the default is the correctness of the Consensus unless it is proven that it is broken (Makhroom). If it turns out to be broken, the Consensus falls. Just as if one of these scholars or others uses a hadith from the Sunnah of the Prophet, peace and blessings be upon him, as proof, the default is that the hadith is authentic, but if it turns out to be weak, it is rejected, but the default is that it is authentic. Just as if one of these scholars declares a hadith authentic, which is stronger than using it as proof, the default is its authenticity, but if it turns out to be weak, one moves from this default to what appeared to the observer and Mujtahid. Similarly, if he narrates a Consensus, the default is that the Consensus is correct, but if it turns out that the Consensus is broken, the Consensus falls and using it as proof falls.\nHowever, one should not rush to claim the breach of Consensus. The Consensus might be old and the disagreement new. Al-Nawawi might narrate a Consensus intending the Consensus of the Companions and Successors, and people in the fourth century disagreed. One should contemplate such matters, for the dissenter might be refuted by the previous Consensus, so it is not correct to rush. But if it is assumed that the breach of Consensus is proven, the Consensus falls. The observer must keep in mind when researching such things that the Consensus should not be previous with disagreement occurring later, and conversely, that there should not be disagreement in the issue then Consensus convened later, like the four Takbirs in funeral prayers. Ibn Abd al-Barr (1) and Al-Nawawi (2) narrated",
    "foot_note": "1. See: \"Al-Tamhid\" by Ibn Abd al-Barr (6/334). Where he said: \"The Salaf differed on the number of Takbirs in the funeral prayer, then they agreed on four Takbirs, and whatever opposes that is an anomaly resembling innovation and invention.\" \n2. See: \"Al-Majmu'\" by Al-Nawawi (5/230). Where he said: \"The four Takbirs are pillars; this prayer is not valid without them, and this is agreed upon. There was a disagreement among some Companions and others whether the prescribed Takbir is five or four or other than that, then that disagreement expired and the Ummah agreed now that it is four Takbirs without addition or decrease.\"",
    "book_id": "267",
    "new_page_number": 47
  },
  {
    "serial_number": "3425163",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 49,
    "volume_number": 1,
    "text": "Consensus and mentioned that the opinions of the people of knowledge settled after that on not exceeding four in the funeral prayer, while there had been disagreement among the Companions on this.\nThe point is that one should contemplate such issues and not rush. But if it becomes clear to the observer that the Consensus is broken, it is said to be broken. Conversely, do not rush; for the default in what a scholar of induction narrates, as previously mentioned like Al-Nawawi or Ibn Qudamah or others, is the correctness of the Consensus. The proof of this is research and examination, for upon research, the correctness of their saying often becomes clear.\nHowever, some break the Consensus due to the opposition of Ibn Hazm Al-Zahiri or the opposition of Dawood Al-Zahiri, and this is an error as examples of this will come, Allah willing. I even saw someone write a research paper saying: Consensus was mentioned in the issue by so-and-so and so-and-so, except that this Consensus is not valid; because Ibn Hazm opposed it. This is strange! How can one rely on Ibn Hazm to invalidate a previous Consensus?! Ibn Hazm is refuted by the Consensus, and such matters should be noted (1).\nIt is worth noting that there are scholars who narrate Consensus intending the majority and do not consider the opposition of the few. Among these:\n1 - Ibn Jarir al-Tabari (2): It became famous among the people of knowledge that if Ibn Jarir al-Tabari narrates Consensus, he does not consider the opposition of the few like one or two and others, so such a Consensus is not relied upon if only he narrated it.",
    "foot_note": "1. Ibn Rajab said in \"Fath al-Bari\" (4/242): \"If one of the Zahiris deviates according to their habit, not caring about breaching the consensus of Muslims, he is blocked by the Consensus before him.\" And he said in (6/105): \"An anomaly from the late Zahiris opposed it; their opposition is not heeded against the old Consensus.\" \n2. See: \"Al-Ihkam\" by Al-Amidi (1/235), and \"Sharh Mukhtasar al-Rawdah\" by Al-Tufi (3/53). Sheikh al-Islam Ibn Taymiyyah said in \"Al-Radd 'ala al-Subki fi Mas'alat Ta'liq al-Talaq\" by Ibn Taymiyyah (1/597): \"As for Ibn Jarir al-Tabari, Consensus to him is the saying of the majority; so his report is not used as proof\" in summary.",
    "book_id": "267",
    "new_page_number": 48
  },
  {
    "serial_number": "3425164",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 50,
    "volume_number": 1,
    "text": "2 - And Ibn Abd al-Barr, may Allah Almighty have mercy on him: Sometimes he narrates Consensus intending the majority (1), and sometimes he narrates Consensus intending real Consensus (2). This is known by context (preceding and following text); if he says: The scholars agreed on that and whoever opposed has deviated (Shadhdha) like Ata or others, he intends by this Consensus [proper], and sometimes he intends by Consensus the consensus of the most. So one should look into the Consensus narrated by Ibn Abd al-Barr; sometimes he narrates Consensus in its known meaning and sometimes he narrates it intending the majority.\nAs for Imam Ibn al-Mundhir, the later scholars relied on him in narrating Consensus and Disagreement as Sheikh al-Islam Ibn Taymiyyah says in \"Majmu' al-Fatawa\" (3). So it is a mistake to say: If Ibn al-Mundhir narrates Consensus, he intends the most, because he says: The scholars agreed except so-and-so (4). Since the single person disagreed, he clarified it. If Consensus to him meant the most, he would not have needed to clarify the opposition of one or two.\n* * *\n\nThirteenth Issue\nConsensus is a Revealing Evidence (Dalil Kashif)\nIt should be known that the evidence of Consensus is a revealing evidence. Consensus is not proof in itself but due to the text it relied upon as previously explained. So it reveals that there is an evidence indicating this issue. It is not an evidence in itself like the Speech of Allah and the speech of His Messenger, peace and blessings be upon him, and this is extremely useful.",
    "foot_note": "1. As in: \"Al-Istidhkar\" (1/314), and (2/15). \n2. As in: \"Al-Istidhkar\" (7/478). \n3. See: \"Majmu' al-Fatawa\" by Ibn Taymiyyah (21/559). \n4. As in: \"Al-Awsat\" (1/411).",
    "book_id": "267",
    "new_page_number": 49
  },
  {
    "serial_number": "3425165",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 51,
    "volume_number": 1,
    "text": "In this is an answer to the one who says: Allah says {O you who have believed, obey Allah and obey the Messenger} [An-Nisa: 59] and did not say return to Consensus.\nIt is said: Returning to Consensus is obedience to Allah and obedience to His Messenger, peace and blessings be upon him; because it reveals the saying of Allah and the saying of His Messenger, peace and blessings be upon him.\nA group of Usul scholars stated that Consensus is revealing, such as Safi al-Din al-Hindi (1), Al-Zarkashi (2), and others.\nIt is not required that the basis upon which Consensus relies be an explicit text; rather, it may be understood by any type of understanding that is authoritative in religion; because there is no evidence that the basis of Consensus cannot be anything but an explicit text.\nWith this, the discussion on the issues of Consensus ends.",
    "foot_note": "1. See: \"Al-Fa'iq fi Usul al-Fiqh\" by Al-Safi Al-Hindi (2/52, and 111). \n2. See: \"Al-Bahr al-Muhit\" by Al-Zarkashi (6/485).",
    "book_id": "267",
    "new_page_number": 50
  },
  {
    "serial_number": "3425166",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Iqna' fi Hujjiyat al-Ijma' (Persuasion regarding the Authority of Consensus)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 52,
    "volume_number": 1,
    "text": "Chapter Two\nDoubts and Problems Regarding the Evidence of Consensus\nThe problems and objections to the evidence of Consensus in practice are many from some of Ahl al-Sunnah (1). These are all the problems that came to my mind, and I do not observe a specific order in mentioning them, but rather as they came to mind.\n\nFirst Doubt\nRejecting Consensus in an issue despite the absence of a Salaf (predecessor), except his claim that the Messenger of Allah, peace and blessings be upon him, is the Salaf.\nLike the deduction of some regarding the prohibition of singling out Saturday for fasting based on the hadith of Al-Samma' bint Busr: \"Do not fast on Saturday except in what has been made obligatory upon you\" (2). When it was said to him: Imam Ibn Taymiyyah (3) narrated Consensus that no one said it is prohibited to single out Saturday for fasting, i.e., regarding the obligation to fast another day with it. He said: This Consensus is not accepted... etc., and it suffices me that my Salaf in this issue is the Messenger of Allah, peace and blessings be upon him.\nUncovering this doubt is to say: This is definitely an error; because this is reasoning using the point of dispute. That is because the opponent does not concede that this is the understanding from the Hadith, i.e., he does not concede that this is understood from the speech of the Messenger of Allah, peace and blessings be upon him. So the disagreement goes back to the understanding of the speech of the Messenger of Allah, peace and blessings be upon him, so",
    "foot_note": "1. The discussion is not with Al-Nazzam and the Mu'tazilah who deny the evidence of Consensus. \n2. Narrated by Ahmad (27075), Al-Darimi (1790), Abu Dawood (2421), Al-Tirmidhi (744) and others, and authenticated by Al-Albani in \"Sahih Sunan Abi Dawood\" (2421) Ma'arif edition. \n3. See: \"Sharh al-Umdah by Ibn Taymiyyah Book of Fasting\" (2/653).",
    "book_id": "267",
    "new_page_number": 51
  },
  {
    "serial_number": "3425167",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 53,
    "volume_number": 1,
    "text": "It is not correct for either party to use the point of dispute as evidence. So if he says, \"My precedent (Salaf) is the speech of the Messenger of Allah, peace and blessings be upon him,\" then he has confiscated the investigation and used the point of dispute as evidence, while the investigation is ongoing regarding this understanding: is it correct or not? Imam Ibn Taymiyyah recounts the consensus that this understanding was not understood, and he says: \"I understood this understanding.\" So the disagreement goes back to understanding, thus it is not correct to say: \"My precedent is the Messenger of Allah, peace and blessings be upon him,\" because the investigation is ongoing regarding the understanding of the speech of the Messenger of Allah, peace and blessings be upon him.\n* * *\n\nThe Second Doubt\nWhen a consensus was mentioned to some of them, and it was said, \"There is no precedent for saying such and such or in this issue,\" he said: \"Yes, there is a precedent, which is the Companion who narrates the hadith.\" The discussion regarding this is like the discussion regarding the previous problem. Uncovering this doubt is to say: This is using the point of dispute as evidence, so it is not conceded that this is the understanding of the Companion. The investigation between us is whether this is the intent of the Messenger of Allah, peace and blessings be upon him, and the Companion's understanding of it, or not? Especially since the narration of a Companion of something does not necessitate that he adopts it or holds it as an opinion. Rather, he might leave it because it is abrogated. The many abrogated hadiths narrated by the Companions after the death of the Prophet, peace and blessings be upon him, were narrated by them while they knew they were abrogated. So there is a difference between the chapter of narration (Riwayah) and the chapter of comprehension (Dirayah). It does not follow from a Companion's narration of a hadith that he has adopted it; rather, he might narrate a hadith knowing it is abrogated or knowing it is specific... etc.",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 52
  },
  {
    "serial_number": "3425168",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 54,
    "volume_number": 1,
    "text": "The Third Doubt\nThat some of them, when told: \"There is a consensus on the issue,\" said: \"This is incorrect. How can there be a consensus on the issue while I disagree, so my disagreement is a violation of the consensus?\" Uncovering this doubt is to say: First: The implication of this statement is that there is no consensus until just before the Hour, so we can be sure that no scholar disagreed until just before the Hour. This implication is false, and if the implication is false, the implied is false. Second: The evidences that clarified that consensus is an authority did not restrict it to a time, as discussed previously regarding the extinction of the era. So whenever consensus is convened, it becomes an authority.\n* * *\n\nThe Fourth Doubt\nSome said: Consensus has been claimed in issues, and it turned out to be breached, so how can these consensuses be relied upon? Uncovering this doubt is to say: This is true; but the default is the validity of the consensus due to the evidences previously mentioned. If its breach becomes clear, it is not said to be consensus, just as if some scholars authenticated a hadith to be used as evidence, then it later appeared to be weak, we abandon his authentication of this specific hadith, but without saying: The authentication of this scholar is not relied upon. Most scholars who authenticated and weakened, it might become clear to other Mujtahids contrary to",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 53
  },
  {
    "serial_number": "3425169",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 55,
    "volume_number": 1,
    "text": "their saying. It is not correct for this Mujtahid to say: \"Since it became clear to me that the scholar Al-Albani erred in a hadith or two, his authentication is not relied upon.\" Rather, it is said that he is an Imam in Hadith, authentication, and weakening. If it appears that his opinion is outweighed in a hadith or two or ten, this does not detract from his status, and the default remains, which is using his authentication and weakening as evidence. This is the case with other scholars as well. So, the default is that if someone recounts a consensus, it is correct. But if it appears that it is breached, it is said that this consensus is not relied upon, just as if a scholar authenticated a hadith and it appeared that his authentication is incorrect, it is said that this authentication is not relied upon and is incorrect, while his status remains and his judgments in authentication and weakening are accepted unless the contrary of his judgment becomes clear.\n* * *\n\nThe Fifth Doubt\nConsensuses of the Companions were recounted, then disagreement occurred, and many scholars did not consider these consensuses. This indicates that consensus is undisciplined; because many scholars did not consider this consensus. From another angle: It indicates that opposing the old consensus is not considered anomalous (Shadh). It was previously explained that the criterion for an anomalous opinion is: opposing consensus. Uncovering this doubt is to say: If a consensus of the Companions is established for the observer and Mujtahid, it is evidence that became clear to him and was hidden from others, so he must act upon it. Just as if the authenticity of a hadith became clear to a Mujtahid or he came across evidence that many other Mujtahids did not come across, he must act upon this evidence, and he has no right to leave the evidence and the hadith because a group of Mujtahids did not act upon this hadith and this evidence.",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 54
  },
  {
    "serial_number": "3425170",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 56,
    "volume_number": 1,
    "text": "It is not a condition for evidence to be an authority in Sharia that it be known and acted upon, and that all Mujtahids know about it. Just as it is conceivable that many evidences and Prophetic hadiths from the Messenger of Allah, peace and blessings be upon him, are hidden from many Mujtahids, the same is said regarding the evidence of consensus which was hidden from many Mujtahids. However, it is said: The manifestation of consensus is not on one level:\n1 - There is consensus that is apparent to all scholars, like the definitive consensus previously mentioned.\n2 - And from the speculative consensus is what is apparent to scholars.\n3 - And from it is what is apparent to most scholars.\n4 - And from it is what might be hidden from many scholars.\nAnd so on; but if it becomes clear to the Mujtahid that there is a consensus on the issue, it is an authority to hold onto, just as if it becomes clear to him that there is an authentic hadith on the issue, it is an authority to hold onto and be relied upon for him in preferring the opinion he holds. It is not necessary for the validity of the evidence that the entire Ummah acts upon it. Similar to this is what happened regarding a consensus from the time of the Companions, may Allah be pleased with them - sometimes it might be from the Companions and the Tabi'in - and it became clear to some Mujtahids, so they act upon it. This does not indicate that the consensus is not an authority. Just as this is said regarding the Prophetic Sunnah if it appeared to some Mujtahids without most Mujtahids, it is not said that this Sunnah is not an authority from the aspect of describing the opinion as anomalous. For such a consensus whose violation became famous among scholars is valid as evidence, but it is not correct to say about the one who violated it that he has fallen into an anomalous opinion. This is following the understanding of the scholars, for the scholars did not understand that regarding consensuses that might be hidden and regarding which mentioning the disagreement in this issue became famous among scholars. Rather, whoever the consensus appeared to acts upon it,",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 55
  },
  {
    "serial_number": "3425171",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 57,
    "volume_number": 1,
    "text": "and in return, he does not describe the opinion as anomalous; because the consensus is hidden and not apparent. This is unlike the apparent consensus regarding which the agreement of scholars with this consensus and holding it, or not opposing it, became famous, and then someone was found who opposed it; in this case, it is said that his opinion is anomalous. Because scholars do not cite the disagreement in this issue in books of Fiqh and high-level disagreement. Scholars like Al-Shafi'i, Imam Ahmad, Al-Marwazi, Al-Tahawi, Ibn Abd al-Barr, and others do not recount that there is disagreement in such issues, but rather affirm that there is consensus on the issue.\n\nThe Sixth Doubt\nThere are many later jurists who do not consider tacit consensus (Ijma' Sukuti) on the pretext that a group spoke and the rest did not speak, and the utmost of the matter is that the rest remained silent. The discussion on this issue has been presented, but I draw attention to two matters:\nThe First Matter: If scholars recount tacit consensus and a long time passes over its recounting and no one disagrees, then this tacit consensus is an authority by consensus. This was mentioned by Al-Tilmisani (1), Al-Zarkashi (2), and a group of scholars. This is beneficial regarding many consensuses that many later scholars or those influenced by theologians want to drop. Examples of this include: the prohibition of singing accompanied by musical instruments.\nBenefit: Scholars have successively recounted for centuries the consensus on the prohibition of singing accompanied by musical instruments. Some later scholars opposed and said: There is no consensus on the issue on the pretext that the utmost in it is tacit consensus, and tacit consensus is not an authority.",
    "foot_note": "1. See: \"Sharh Al-Ma'alim fi Usul Al-Fiqh\" by Al-Tilmisani (2/122). \n2. See: \"Al-Bahr Al-Muhit\" by Al-Zarkashi (6/472).",
    "book_id": "267",
    "new_page_number": 56
  },
  {
    "serial_number": "3425172",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 58,
    "volume_number": 1,
    "text": "It is said: Even if it is conceded that tacit consensus is not an authority, such a thing is not said regarding the tacit consensus on the prohibition of singing accompanied by music; because it is something regarding which a long time has passed with scholars mentioning it, and they did not oppose it, so the likes of it is an authority by consensus.\nThe Second Matter: It is known with certainty that Al-Shafi'i does not intend by that to reject tacit consensus. This is because Imam Al-Shafi'i himself established the principle of consensus and that it is an authority, and said: And consensus is an authority over everything; because error is impossible in it (1). This is only found in tacit consensus. This is confirmed by the fact that Al-Shafi'i himself used consensus as evidence practically. He held that if a slave and a boy performed Hajj and then were manumitted or reached puberty after that, this does not suffice for the Hajj of Islam. He recounted consensus on that in \"Al-Umm\" (2), and the utmost in such a case is tacit consensus. Examples of this are numerous from Al-Shafi'i and others. So Al-Shafi'i's statement is definitively not interpreted as a denial of tacit consensus; because he affirms consensus.\nNote: Al-Ala'i (3) then Al-Zarkashi (4) mentioned that some of Al-Shafi'i's companions interpreted his saying: (No statement is attributed to a silent person) to refer to other than the consensus of the Companions, but this is questionable; because Al-Shafi'i recounted consensus in many issues and established its principle and did not state that it is specific to the consensus of the Companions. Some Shafi'is interpreted this to refer to tacit consensus for which a long time has not passed since its mention (5); because what has had a long time pass since its mention is an authority by consensus as previously mentioned.",
    "foot_note": "1. See: \"Al-Ilm\" by Al-Shafi'i p. 22. \n2. See: \"Al-Umm\" by Al-Shafi'i (2/120). \n3. See: \"Ijmal Al-Isabah\" by Al-Ala'i (p. 24). \n4. See: \"Al-Bahr Al-Muhit\" by Al-Zarkashi (6/459). \n5. See: \"Ijmal Al-Isabah\" by Al-Ala'i (p. 24), and \"Al-Bahr Al-Muhit\" by Al-Zarkashi (6/459).",
    "book_id": "267",
    "new_page_number": 57
  },
  {
    "serial_number": "3425173",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 59,
    "volume_number": 1,
    "text": "It is said: Although Al-Shafi'i definitively uses this type of consensus as evidence, restricting his statement to such a case requires proof and evidence. Had it been so, he would have established this in \"Al-Risalah\", for he spoke in \"Al-Risalah\" about the authority of consensus and did not stipulate the passage of a long time since its mention. Had this been a condition for him, he would have clarified it clearly in \"Al-Risalah\" or others of his books, especially since it is where he established the principle of the authority of the evidence of consensus (1). What is definitively certain is that such speech from Al-Shafi'i is not valid to rely upon to reject every tacit consensus, although Al-Shafi'i, may Allah have mercy on him, might rely on it to reject a consensus he does not see as valid. And if it is said to him: So-and-so and So-and-so held this opinion... Al-Shafi'i sees through indicators that others besides these did not speak on this issue, and their lack of speech does not indicate approval of those who spoke due to indicators. But to make this speech from Al-Shafi'i a principle in rejecting tacit consensus is not valid in any case - and Allah knows best.\n* * *\n\nThe Seventh Doubt\nAl-Shafi'i, may Allah have mercy on him, said: \"What has no disagreement in it is not consensus.\" Ibn Hazm (2), may Allah have mercy on him, narrated this phrase, and discussion on it will come. But the apparent meaning of this phrase is that an issue about which it is said there is no disagreement in it is not consensus. This, on its face, is strong in indicating that a scholar's saying \"I do not know of any disagreement\" or \"there is no disagreement\"... etc. does not signify consensus. Uncovering this doubt is from several aspects:\nThe First Aspect: The one who narrated this phrase is Ibn Hazm in his book \"Al-Ihkam fi Usul Al-Ahkam\" and elsewhere, and I have not seen anyone precede Ibn Hazm in narrating this phrase from",
    "foot_note": "1. See: \"Al-Risalah\" by Al-Shafi'i (pp. 471-475). \n2. See: \"Al-Ihkam fi Usul Al-Ahkam\" by Ibn Hazm (4/188).",
    "book_id": "267",
    "new_page_number": 58
  },
  {
    "serial_number": "3425174",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 60,
    "volume_number": 1,
    "text": "Imam Al-Shafi'i. Ibn Hazm attributed it to the book \"Al-Risalah\", and it is not present in the book \"Al-Risalah\" that is in our hands. Indeed, I have not seen the Shafi'is narrating this saying and attributing it to Al-Shafi'i. Rather, I saw Al-Zarkashi in \"Al-Bahr Al-Muhit\" (1) narrating this saying and attributing it to Ibn Hazm. Those after Ibn Hazm, if they narrate this phrase from Al-Shafi'i, either mention the intermediary, who is Ibn Hazm, or bring the text of Ibn Hazm's phrase. So the reliance in narrating this saying is Ibn Hazm. It is extremely unlikely that this text belongs to Imam Al-Shafi'i, may Allah have mercy on him, and the scholars overlooked it. Al-Shafi'i has a great status among scholars and has companions who supported his opinions and school. If the saying was established from Imam Al-Shafi'i, may Allah have mercy on him, you would have seen his companions concurring on it; indeed, you would have seen scholars mentioning such a statement; because Al-Shafi'i, may Allah have mercy on him, has a great status among scholars.\nThe Second Aspect: Imam Al-Shafi'i, may Allah have mercy on him, himself used the negation of disagreement as evidence in not a few issues. He said, may Allah have mercy on him, in the book \"Al-Umm\": \"And I do not know of any disagreement that there is no Zakat on gold until it reaches twenty Mithqals, so if it reaches twenty Mithqals, there is Zakat on it\" (2). He also said: \"And the blood money (Aqilah) for the free man and the slave is something in which I do not know of any disagreement\" (3). He said in his book \"Ikhtilaf Al-Hadith\": \"Because the Book, then the Sunnah, then what I do not know of any disagreement in indicates that the one enjoying Umrah until Hajj... etc.\" (4). He also said in his book \"Al-Umm\": \"He said from Al-Hasan from a man from the Companions of the Prophet, peace and blessings be upon him, if two guardians marry off [a woman], the first is more entitled - ... etc. Then among what Al-Shafi'i, may Allah have mercy on him, mentioned is that he said - so the marriage of the first",
    "foot_note": "1. See: \"Al-Bahr Al-Muhit\" by Al-Zarkashi (6/488). \n2. See: \"Al-Umm\" by Al-Shafi'i (2/43). \n3. See: \"Al-Umm\" by Al-Shafi'i (3/262). \n4. See: \"Ikhtilaf Al-Hadith\" by Al-Shafi'i (8/679).",
    "book_id": "267",
    "new_page_number": 59
  },
  {
    "serial_number": "3425175",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 61,
    "volume_number": 1,
    "text": "is valid; because he is an appointed guardian, and whoever marries her after him, his marriage is invalid. This is the saying of the general body of jurists; I do not know of any disagreement among them regarding it, nor do I know if Al-Hasan heard from him or not\" (1). Meaning he did not rely on the weak narrated report from this man, but rather relied on the fact that there is no disagreement on the issue. So Al-Shafi'i himself uses the negation of disagreement as evidence.\nThe Third Aspect: That a scholar's saying \"I do not know of any disagreement or there is no disagreement among scholars\" and other such phrases indicates consensus; because the meaning of consensus is equal to the meaning of their saying that scholars did not disagree. Meaning they are agreed. However, it is not in the degree of a scholar's certainty if he says \"they agreed\", unlike if he says \"I do not know of any disagreement in it\" or \"there is no disagreement among scholars\". The saying \"I do not know\" is a lower degree than the saying \"there is no disagreement on the issue\", and lower than both is his saying \"this is the saying of everyone I memorized from among the people of knowledge\"... etc. Sheikh Al-Islam Ibn Taymiyyah (2) pointed to this meaning, and discussion on this will come, Allah willing.\nThe Fourth Aspect: That the issue about which a scholar says there is no disagreement in it or I do not know of any disagreement in it... etc. It is said: The way of the believers in what this scholar recounts through his induction is such and such, and we are commanded to follow the way of the believers. Therefore, it is not correct to depart from what this scholar mentioned unless it is established for us that what he recounted is breached and that the way of the believers in this issue is not what this scholar mentioned. We are commanded to follow the way of the believers based on the prevailing conjecture (Ghalabat al-Zann), meaning what we know to be the way of the believers, we follow based on prevailing conjecture, even if it is the lowest degrees of prevailing conjecture.",
    "foot_note": "1. See: \"Al-Umm\" by Al-Shafi'i (5/192). \n2. See: \"Al-Radd 'ala Al-Subki fi Mas'alat Ta'liq Al-Talaq\" by Ibn Taymiyyah (1/598-599).",
    "book_id": "267",
    "new_page_number": 60
  },
  {
    "serial_number": "3425176",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 62,
    "volume_number": 1,
    "text": "The Eighth Doubt\nThat the Sunnah is an authority in itself and does not need practice. This foundation, whether using the term Sunnah, Hadith, or Report (Khabar)... etc., apparently indicates that the evidence is an authority in itself and does not need anyone to act upon it for it to be used as evidence. Uncovering this doubt is from several aspects:\nThe First Aspect: That something similar to this statement was established by Imam Al-Shafi'i, may Allah have mercy on him. He mentioned in his book \"Al-Risalah\" what relates to the ruler's judgment (Wali Al-Amr), then he mentioned an issue related to what we are dealing with. He said, may Allah have mercy on him: \"Since it was known, and Allah knows best, to Umar that the Prophet, peace and blessings be upon him, ruled regarding the hand [diya] with fifty [camels], and the hand has five fingers varying in beauty and utility, he gave them their positions and ruled for each of the fingers according to its proportion of the palm's diya. This is analogy (Qiyas) based on the report. But when we found the book of the family of Amr bin Hazm containing that the Messenger of Allah, peace and blessings be upon him, [said]: 'And in every finger of that there are ten camels', they turned to it and did not accept the book of the family of Amr bin Hazm - and Allah knows best - until it was established for them that it was the book of the Messenger of Allah, peace and blessings be upon him. In the hadith, there are two indications: one is the acceptance of the report, and this has no problem. The other is that the report is accepted at the time it is established, even if no practice by the Imams has passed according to the report they accepted\" (1). He means by Imams the rulers who judge in such issues. Then he said: \"And an indication that even if practice by one of the Imams had passed, then a report from the Prophet, peace and blessings be upon him, was found contradicting his practice, his practice would be left for the report of the Messenger of Allah, peace and blessings be upon him - and this is also a strong witness",
    "foot_note": "1. See: \"Al-Risalah\" by Al-Shafi'i (p. 420).",
    "book_id": "267",
    "new_page_number": 61
  },
  {
    "serial_number": "3425177",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 63,
    "volume_number": 1,
    "text": "against this mentioned doubt - and an indication that the hadith of the Messenger of Allah, peace and blessings be upon him, is established by itself, not by the practice of others after him...\" (1).\nSo, the First Aspect: The context of Al-Shafi'i's speech relates to the ruler when he judges cases. He is not talking about all scholars, but rather about the judgment of a ruler. Umar judged with a ruling, and rulers before or after him judged with a ruling. So he is not talking about the consensus of scholars on leaving action upon the report, but rather about the judgment of a ruler who judged based on a report; there might be those who agree or disagree, but he definitely contradicts a ruler before him, or it is not known that a ruler before him judged with this. This does not mean that there is no one among the people of knowledge who holds this opinion.\nThe Second Aspect: Al-Shafi'i, may Allah have mercy on him, establishes that it is valid to abrogate a report by consensus. If scholars agree that this report is abrogated, he leaves the text for the consensus. Al-Zarkashi said in \"Al-Bahr Al-Muhit\": \"The consensus of the Companions, like Ramadan abrogating the fasting of the day of Ashura, and Zakat abrogating other rights in wealth, mentioned also by Ibn Al-Sam'ani, and similarly the hadith: 'Whoever withholds his Zakat, we will take it and half his wealth' (2). The Companions agreed on abandoning their use of this, so their turning away from it indicates its abrogation. Al-Shafi'i also stated this in what Al-Bayhaqi quoted in Al-Madkhal, saying: The abrogating and abrogated are not inferred except by a report from the Messenger, peace and blessings be upon him, another timed one indicating that one of them is after the other, or by the saying of one who heard the hadith, or the general public - meaning the consensus of the people of knowledge -\" (3). Then Al-Zarkashi elaborated on explaining the scholars' speech.",
    "foot_note": "1. See: \"Al-Risalah\" by Al-Shafi'i (p. 420). \n2. Narrated by Ahmad (20041), Al-Darimi (1719), Abu Dawud (1575), and Al-Nasa'i (5/15), and Al-Albani classified it as Hasan in \"Sahih Sunan Abi Dawud\" (1575) Al-Ma'arif edition. \n3. See: \"Al-Bahr Al-Muhit\" by Al-Zarkashi (5/319).",
    "book_id": "267",
    "new_page_number": 62
  },
  {
    "serial_number": "3425178",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 64,
    "volume_number": 1,
    "text": "The intention: Imam Al-Shafi'i relied on consensus in abrogation, so he left a proof because scholars agreed on leaving it because it is abrogated.\nThe Third Answer: The saying that the hadith, report, or verse is an authority in itself and not in need of anything else is true. The verse is not in need of anything else to be used as evidence, and the same is said regarding the hadith of the Messenger of Allah, peace and blessings be upon him; it is an authority in itself. But there is a difference between this and saying that it has been established that no one acted upon this, so this is a preventer from acting. The default is to act upon the report, and it is an authority in itself and not in need of anything else. But if it turns out there is a preventer preventing action upon it, such as it being abrogated or scholars agreeing on leaving it, then this is another matter. So there is a difference between it being an authority in itself, which it is, and leaving the authority for another reason, such as this verse or hadith being abrogated or scholars having agreed on leaving it. So there is no correlation between them.\n* * *\n\nThe Ninth Doubt\nSome scholars established that the consensus used as evidence by Imam Ahmad and Sheikh Al-Islam Ibn Taymiyyah is the consensus of the Companions. The answer to this is as follows:\nThe First Aspect: There is no evidence for restricting consensus in the words of Imam Ahmad or Ibn Taymiyyah to the Companions, and whoever claims that is required to provide the transmission.\nThe Second Aspect: Imam Ibn Taymiyyah himself stated in the eleventh volume on page three hundred and forty-one that the consensus that is disciplined... etc., he said: It is the consensus of",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 63
  },
  {
    "serial_number": "3425179",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 65,
    "volume_number": 1,
    "text": "the Companions mostly (1). So he expressed it with 'mostly'. Expressing with 'mostly' is one thing, and the consistency of that always being the case is another thing. There is no doubt that the consensus that is disciplined mostly is the consensus of the Companions, but this is one thing, and using other than the consensus of the Companions as evidence is another thing.\nThe Third Aspect: Imam Ahmad states in his issues that the Companions agreed on such and such and the Companions did not disagree on such and such. When he wanted to restrict the matter to the Companions, he stated it explicitly. And in places he says: The Muslims agreed, or the scholars agreed, or the scholars did not disagree... and so on, which indicates that Imam Ahmad does not restrict consensus to the consensus of the Companions. Similarly, Sheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him, mentions consensus in places and intends by it the consensus of the Companions, and sometimes explicitly states the consensus of the Companions, and in places he speaks generally and does not restrict the matter to the Companions. This indicates that he does not restrict consensus to the consensus of the Companions.\nThe Fourth Aspect: Imam Ahmad said regarding the minimum duration of menstruation: A day and a night. Then he said: And the highest [authority] in the chapter is the saying of Ata (2). Ata is definitively not an authority in himself, but because it is a form of consensus, it is the way of the believers in this issue. The discussion has preceded that the saying of the Salaf is a form of consensus and the way of the believers is one of the evidences of consensus.\nAlso, among what Sheikh Al-Islam, may Allah have mercy on him, mentioned: That the agreement of the Imams of the four schools is not an authority",
    "foot_note": "1. See: \"Majmu' Al-Fatawa\" by Ibn Taymiyyah (11/341). Where he said: \"Consensus is agreed upon among the general Muslims from jurists, Sufis, people of Hadith and Kalam, and others in general, and denied by some people of innovation from the Mu'tazila and Shi'a. But the known part of it is what the Companions were upon, and as for what is after that, knowledge of it is mostly impossible.\" \n2. See: \"Masa'il Abi Dawud\" (152), and \"Masa'il Ibn Hani\" (148).",
    "book_id": "267",
    "new_page_number": 64
  },
  {
    "serial_number": "3425180",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 66,
    "volume_number": 1,
    "text": "by consensus (1). So he does not mean by that the consensus of the Companions; because the four schools came after the Companions.\n* * *\n\nThe Tenth Doubt\nSome said the consensus that is an authority is what is known from the religion by necessity without anything else, and upon this Imam Ahmad's saying is interpreted when he said: Whoever claims consensus is a liar. Uncovering this doubt is from several aspects:\nThe First Aspect: The evidences came for the authority of consensus whenever it is conceived, and did not restrict that to what is known from the religion by necessity nor anything else, meaning they did not restrict that to necessary consensus nor speculative, but rather they encompass all types of consensus. So whenever consensus occurs, it is an authority.\nThe Second Aspect: The two Imams, Al-Shafi'i and Ahmad, recounted consensuses in issues that are not from necessary consensus nor from what is known from the religion by necessity. Examples of this include: Imam Al-Shafi'i said in his book \"Al-Umm\": \"The Muslims did not differ regarding what I described concerning those who have not reached puberty and slaves, if they performed Hajj, that the obligation of Hajj is not [lifted] from any of them\" (2). Meaning he establishes that their Hajj is valid but does not suffice for the obligatory Hajj, and he recounts consensus on this.",
    "foot_note": "1. See: \"Majmu' Al-Fatawa\" by Ibn Taymiyyah (20/10). Where he said: \"As for the sayings of some Imams like the four jurists and others; they are not a binding authority nor a consensus by the agreement of Muslims.\" \n2. See: \"Al-Umm\" by Al-Shafi'i (2/120).",
    "book_id": "267",
    "new_page_number": 65
  },
  {
    "serial_number": "3425181",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 67,
    "volume_number": 1,
    "text": "And he also says: \"Because there are proofs for it, including the saying of the Messenger of Allah, peace and blessings be upon him: (A believer is not killed for a disbeliever), and the consensus is that a man is not killed for his son if he kills him\" (1). This is not from necessary consensus nor from what is known from the religion by necessity. He also said: \"Consensus is that a man is not killed for his slave - and this is likewise - nor for one granted security in the abode of war, nor for a woman in the abode of war, nor a boy\" (2). These issues are all not from what is known from the religion by necessity. There are narrations from Imam Ahmad like them. From that is what Sheikh Al-Islam Ibn Taymiyyah narrated in Sharh Al-Umdah (3), and Ibn Al-Qayyim in Ighathat Al-Lahfan (4) from Imam Ahmad, may Allah have mercy on him, that he said: \"Muslims do not differ that blood is impure.\" This is not from what is known from the religion by necessity. Also from that is his saying: \"They agreed that Takbir - i.e., the restricted one - begins from the morning of the day of Arafah\" (5). Likewise his saying: \"They agreed that the children of Muslims are in Paradise\" (6). And his saying: \"The people of knowledge agreed that selling debt for debt is not permissible\" (7).",
    "foot_note": "1. See: \"Al-Umm\" by Al-Shafi'i (6/26). \n2. See: \"Al-Umm\" by Al-Shafi'i (6/26). \n3. See: \"Sharh Al-Umdah\" by Ibn Taymiyyah (1/105). \n4. See: \"Ighathat Al-Lahfan\" by Ibn Al-Qayyim (1/273). \n5. See: \"Masa'il Al-Kawsaj\" (1453), \"Al-Mughni\" by Ibn Qudamah (2/292), and \"Fath Al-Bari\" by Ibn Rajab (9/22,24). \n6. See: \"Ahkam Ahl Al-Milal\" by Al-Khallal (1/66) with the wording: \"There is no disagreement in it\", and \"Al-Mughni\" by Ibn Qudamah (9/365) with the wording: \"There is no difference in it\". \n7. See: \"Al-Mughni\" by Ibn Qudamah (4/37).",
    "book_id": "267",
    "new_page_number": 66
  },
  {
    "serial_number": "3425182",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 68,
    "volume_number": 1,
    "text": "And his saying regarding the verse: {So when the Qur'an is recited, then listen to it and pay attention that you may receive mercy} [Al-A'raf: 204]: \"People agreed that this verse is regarding prayer\" (1). This is not from what is known from the religion by necessity. In addition to other numerous issues in which Imam Ahmad, may Allah have mercy on him, spoke, which are not from what is known from the religion by necessity, yet they used them as evidence. So restricting consensus according to Imam Ahmad or Al-Shafi'i to being what is known from the religion by necessity is a mistake contradicted by their practice, and before that contradicted by the Sharia foundation, for the Sharia made consensus an authority whenever it is found.\n* * *\n\nThe Eleventh Doubt\nSome said: Lack of knowledge of a dissenter does not indicate consensus. Uncovering this doubt is from several aspects:\nThe First Aspect: The concept of consensus is that a group speaks and others do not oppose them; this is the reality of consensus as previously explained. This is present in the lack of knowledge of a dissenter as also previously explained.\nThe Second Aspect: The practice of Imams Al-Shafi'i, Ahmad, and others is that they use lack of knowledge of a dissenter as evidence, and something of that has been mentioned. Ibn Taymiyyah, may Allah have mercy on him, has a marvelous foundation in such matters. Among what he established is that issues in which no disagreement is known are an authority, and it is not correct for anyone to introduce a new saying unless he knows he has a precedent. He said, may Allah have mercy on him, in \"Majmu' Al-Fatawa\": \"As for the speculative, it is the Approbatory (Iqrari) and Inductive (Istiqra'i) consensus:",
    "foot_note": "1. See: \"Masa'il Abi Dawud\" (223).",
    "book_id": "267",
    "new_page_number": 67
  },
  {
    "serial_number": "3425183",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 69,
    "volume_number": 1,
    "text": "where he surveys the sayings of scholars and finds no disagreement in that, or the saying becomes famous regarding the Quran and no one is known to have denied it. This consensus, even if it is permissible to use as evidence...\" to the end of his speech (1). He made this inductive. And he said in his response to Al-Subki regarding an issue in suspending divorce: \"So the types of consensus that can be used as evidence are three: Encompassing consensus, Approbatory consensus, and Inductive consensus. The first: Is what is encompassed by knowledge that the Companions or Tabi'in were upon, like what we know is from the apparent known religion of the Messenger, peace and blessings be upon him, which no one denies except one who disbelieves in it. The second: That the saying or action becomes famous among the Salaf and no denier denies it; this is Approbatory consensus, for the Ummah does not agree on approving falsehood. Rather, just as the Messenger, peace and blessings be upon him, is infallible in his saying, action, and approval, likewise the Ummah is infallible in its saying, action, and approval. This is like Umar bin Al-Khattab, may Allah be pleased with him, making the land conquered by force [state property] among the Muslims, and other things. If it is said regarding such things: Perhaps some of them denied it. It is said: The assumption does not drop by the denial of error unless the denial appears. Had a denier denied that, it would have been among things for which motives to transmit are abundant; just as they transmitted the dispute of Ibn Abbas, may Allah be pleased with them both, in 'Awl and the two 'Umariyyat cases, and the dispute of Ibn Al-Zubayr, may Allah be pleased with them both, in the inheritance of the irrevocably divorced woman, and similar things. As for the third: It is Inductive consensus, which is that a scholar tracks as much as he can of the sayings of scholars and finds no one who disagreed in that\" (2). So he made consensus three types and makes all of them authority, but he has a way of dealing with them if they contradict a text.",
    "foot_note": "1. See: \"Majmu' Al-Fatawa\" by Ibn Taymiyyah (19/267). \n2. See: \"Al-Radd 'ala Al-Subki fi Mas'alat Ta'liq Al-Talaq\" by Ibn Taymiyyah (1/611).",
    "book_id": "267",
    "new_page_number": 68
  },
  {
    "serial_number": "3425184",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 70,
    "volume_number": 1,
    "text": "Among his useful speech also is what he said in his book \"Raf' Al-Malam 'an Al-A'immah Al-A'lam\": \"It is not possible for a scholar to initiate a saying for which he knows no sayer; while knowing that people have said the opposite, such that some of them suspend the saying and say: 'If there is consensus on the issue, then it is most worthy to be followed, otherwise the saying according to me is such and such.' This is like the one who says: 'I do not know anyone who permitted the testimony of a slave,' while its acceptance is preserved from Ali, Anas, Shurayh, and others. And another says: 'They agreed that the partially manumitted slave does not inherit' ...\" (1) then he mentioned who disagreed in that. This is a great foundation. Among what Sheikh Al-Islam, may Allah have mercy on him, mentioned in his response to Al-Subki: \"That a scholar's saying 'I do not know of any disagreement in it' implies consensus but it is less than his saying 'they agreed'\" (2). This is true. And among what implies consensus but is less than what is before it: \"That less than that is to say: Everyone we memorized from agreed\" (3). This also implies consensus but is less. So they are all ranks indicating consensus but they vary. It suffices that it implies consensus by way of prevailing conjecture, even if it is the lowest degrees of prevailing conjecture. What strengthens the prevailing conjecture in such cases and makes the soul reassured to act upon it is to say: An issue in which it is known that ten scholars said it is forbidden, for example, and someone wanted to disagree with them, and no precedent is known for him in disagreeing with them, then his saying is an error because it is innovated and contrary to the way of the believers in what is known. So one must return to the saying of those for whom no opponent is known. Also, any issue in which a scholar with inductive knowledge did not recount consensus is likely to be",
    "foot_note": "1. See: \"Raf' Al-Malam 'an Al-A'immah Al-A'lam\" by Ibn Taymiyyah (p. 32). \n2. See: \"Al-Radd 'ala Al-Subki fi Mas'alat Ta'liq Al-Talaq\" by Ibn Taymiyyah (1/598-599). \n3. See: \"Al-Radd 'ala Al-Subki fi Mas'alat Ta'liq Al-Talaq\" by Ibn Taymiyyah (1/598-599).",
    "book_id": "267",
    "new_page_number": 69
  },
  {
    "serial_number": "3425185",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 71,
    "volume_number": 1,
    "text": "consensual or controversial. The side of consensus prevails due to this scholar recounting consensus, so it becomes consensus by way of prevailing conjecture.\n* * *\n\nThe Twelfth Doubt\nSheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him, mentioned in Al-Tis'iniyyah (1) and others that the general body of innovators oppose evidences on the pretext of consensus, and their consensus is breached and incorrect. Therefore, it is not valid to use consensus as evidence in opposing evidence, lest we agree with the people of innovation. Uncovering this doubt is from several aspects:\nThe First Aspect: There is no doubt that there are breached consensuses, yet that is not a justification to reject all consensuses. Rather, consensus remains an authority until it is proven to be breached. Like the Prophetic Hadith; there is no doubt that there are weak hadiths, but this is not a justification to reject authentic hadiths. Rather, it is said: What is proven to be authentic is used as evidence until the contrary becomes clear.\nThe Second Aspect: There are issues in which consensus was recounted, then a group claimed it was breached, and the error of their claim became clear. Examples of this include: More than one scholar like Al-Tahawi (2), Qadi Iyad (3), and Ibn Jarir (4):",
    "foot_note": "1. See: \"Al-Tis'iniyyah\" by Ibn Taymiyyah (2/492). \n2. Qadi Iyad quoted it from him in \"Al-Shifa\" (2/62). Al-Tahawi said in \"Ahkam Al-Quran\" (1/181): \"Al-Shafi'i, may Allah have mercy on him, held that prayer upon the Prophet, peace and blessings be upon him, is obligatory on people following the Tashahhud in the end of their prayers, and that their prayers do not suffice them without that. Those other than him from the people of knowledge disagreed with him in that.\" \n3. See: \"Al-Shifa\" by Qadi Iyad (2/61). \n4. Like Ibn Jarir Al-Tabari, Qadi Iyad quoted it from him in \"Al-Shifa\" (2/62).",
    "book_id": "267",
    "new_page_number": 70
  },
  {
    "serial_number": "3425186",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 72,
    "volume_number": 1,
    "text": "recounted consensus that prayer upon the Prophet, peace and blessings be upon him, is not obligatory in the final Tashahhud. Some scholars tried to show that this consensus is breached, so they narrated that from Abu Mas'ud Al-Badri, Ibn Mas'ud Al-Hudhali, and Abu Ja'far Al-Baqir (1). Then it became clear that his narration from Ibn Mas'ud is an illusion (2), and it is only from the saying of Abu Mas'ud Al-Badri, and the chain of Abu Mas'ud Al-Badri is weak as Al-Bayhaqi (3) and others clarified. So nothing remained except the transmission from Abu Ja'far Al-Baqir, about which some said: It is preserved. However, the chain of Abu Ja'far is not authentic; it contains Hajjaj bin Artah who is known for his weakness (4). Al-Bayhaqi, although he is Shafi'i, when he cited the chain of Abu Ja'far, he only cited it from the path of Ibn Artah. It is known that Al-Bayhaqi strives to support the Shafi'i school - and Ibn Taymiyyah mentioned about him in \"Al-Radd 'ala Al-Bakri\" that he mentions what is for the Shafi'is without what is against them (5) - so if he had it from an authentic path he would have clarified it. He wanted to support the saying of the Shafi'is in this issue, and wanted to attribute this saying to Abu Ja'far Al-Baqir, yet he did not attribute it except from a weak path. And he attributed it to Al-Sha'bi (6) without a chain. Had Al-Bayhaqi possessed an authentic chain, he would not have",
    "foot_note": "1. See those quotations: In \"Al-Sunan Al-Kubra\" by Al-Bayhaqi (2/379). And in \"Jala' Al-Afham\" (p. 333). \n2. Al-Bayhaqi said in \"Al-Sunan Al-Kubra\" (2/379) following the narration of Ibn Mas'ud: \"Thus said Abdullah bin Mas'ud, may Allah be pleased with him, and Allah knows best.\" Ibn Al-Qayyim said in \"Jala' Al-Afham\" (p. 57): \"For Yahya bin Al-Sabbaq and his sheikh - both are from the men of the chain - are not known for probity nor criticism.\" \n3. See: \"Al-Sunan Al-Kubra\" by Al-Bayhaqi (2/379), where he said: \"Jabir Al-Ju'fi was alone in narrating it, and he is weak.\" And he said in \"Ma'rifat Al-Sunan wa Al-Athar\" (3/69): \"And this Jabir is Al-Ju'fi and he is weak.\" \n4. Among those who weakened him is Ibn Sa'd. See \"Al-Tabaqat Al-Kubra\" by Ibn Sa'd (6/359). \n5. See: \"Radd Ibn Taymiyyah 'ala Al-Bakri\" (1/78). \n6. See: \"Al-Sunan Al-Kubra\" by Al-Bayhaqi (2/379).",
    "book_id": "267",
    "new_page_number": 71
  },
  {
    "serial_number": "3425187",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 73,
    "volume_number": 1,
    "text": "left it. This indicates that one should not rush with everyone who wants to breach a consensus. Rather, one must verify its breach, and verify the authenticity of the chains to those to whom the disagreement is attributed.\n* * *\n\nThe Thirteenth Doubt\nSome said consensus which is not definitive is from conjecture (Zann), and in other words: Consensus which is not definitive regarding the absence of a dissenter is from conjecture. So how can evidence be left for conjecture? Uncovering this doubt is from several aspects:\nThe First Aspect: It should be known that consensus of both types, whether definitive or speculative, its strength lies in being definitive in its indication as previously explained. So if, in the view of the Mujtahid, speculative consensus in its establishment contradicts a hadith or verse, then a definitive evidence in its indication - which is consensus - has contradicted a text that might bear more than one facet and might be probable, so it is thought to be improbable. But what is definitive is that the indication of consensus is definitive. So if there is an apparent contradiction, the observer must review himself; because consensus cannot be impugned from the aspect of its indication, but rather impugned from the aspect of its establishment. The discussion now is on indication, and the text contradicting consensus apparently might be said to bear more than one meaning. So from the origin, consensus is prioritized; because the meaning that scholars agreed on this: is that the understandings of scholars united that this ruling is forbidden or that this ruling is recommended etc. ... So it is not valid to reject it unless it is said to be breached. As for the aspect of indication, it is definitive as preceded. Based on this, if a text contradicts a consensus - even if the consensus is speculative in its establishment - it is prioritized; because its indication is only definitive unlike the text.",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 72
  },
  {
    "serial_number": "3425188",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 74,
    "volume_number": 1,
    "text": "The Second Aspect: Most of what is thought from texts to be contradictory to consensus, the reality of the situation is that consensus is specifying, restricting, or clarifying. From that is that some scholars thought that the saying of the Companions that the fasting done on behalf of the guardian (Wali) is the fasting of vows without others contradicts what Aisha narrated from the Messenger of Allah, peace and blessings be upon him, that he said: \"Whoever dies and has fasting due upon him, his guardian fasts on his behalf.\" Agreed upon (1). Had he dealt with the saying of the Companions like Aisha and Ibn Abbas, who did not disagree, as consensus and that this text bears more than one meaning, he would have specified this general text with the fatwas of the Companions and would not have needed to make their sayings contradictory to the text. Therefore, some Shafi'is like Al-Nawawi (2) and others went to rejecting these traditions based on thinking they contradict the text. The priority is to act upon both proofs, not to reject one of them, and to make the saying of the Companions which did not disagree a specifier for the apparent meaning of the text, as is the saying of Al-Layth bin Sa'd (3), Ahmad in a narration (4), Ibn Al-Qayyim (5), and Al-Albani (6).\n* * *\n\nThe Fourteenth Doubt\nSome said if the hadith is authentic, it is obligatory to act upon it even if it is not known who acted upon it; because it is an authority without disagreement. Uncovering this doubt is to say:",
    "foot_note": "1. Narrated by Al-Bukhari (1952), and Muslim (1147). \n2. See: \"Al-Majmu'\" by Al-Nawawi (6/369), and \"Sharh Muslim\" by Al-Nawawi (8/25). \n3. See: \"Sharh Muslim\" by Al-Nawawi (8/25). \n4. See: \"Sharh Muslim\" by Al-Nawawi (8/25), and \"Al-Insaf\" by Al-Mardawi (7/506-507). \n5. See: \"Tahdhib Al-Sunan\" (3/278-282), and \"Al-Ruh\" (p. 120), both by Ibn Al-Qayyim. \n6. See: \"Al-Silsilah Al-Sahihah\" by Al-Albani (4/591).",
    "book_id": "267",
    "new_page_number": 73
  },
  {
    "serial_number": "3425189",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 75,
    "volume_number": 1,
    "text": "There is no doubt that if the hadith is authentic, it is an authority in itself and does not need for its use as evidence to look at who acted upon it as preceded. But this is one thing, and leaving acting upon it for an impediment such as being abrogated, or agreed upon to be left - for example - is another thing. And our discussion is in the second, not the first. Scholars understood this, and some attributed it to the Salaf. Among those who understood this is Imam Al-Tirmidhi, who is one of the Imams of Sunnah and Imams of the Salaf. When he finished his Jami', he said: \"Everything in this Jami' has been acted upon by scholars except for two hadiths upon which scholars agreed not to act\" (1). So Al-Tirmidhi accepted this foundation, and Al-Tirmidhi is not among the later scholars but rather among the early ones. Yet he accepted it, even though his assumption that scholars agreed on abandoning action on the two hadiths was disputed. Some insist that Al-Tirmidhi's saying is correct and whoever opposed him, his opposition is incorrect. The point is that Al-Tirmidhi acknowledges this foundation aside from the two examples he mentioned. Among the great words in this regard is what Ibn Rajab said in his book \"Bayan Fadl Ilm Al-Salaf 'ala Al-Khalaf\": \"As for the Imams and jurists of the people of Hadith, they follow the authentic hadith wherever it is if it was acted upon by the Companions and those after them or by a group of them. As for what they agreed on abandoning, it is not permissible to act upon it; because they did not abandon it except out of knowledge that it is not acted upon. Umar bin Abd al-Aziz said: Take from opinion what agrees with those before you, for they were more knowledgeable than you...\" (2), etc. of his speech, may Allah have mercy on him. This is explicit from Ibn Rajab, narrating it from the people of knowledge, that if scholars abandoned acting upon a hadith, then this hadith is not acted upon, and he attributes it to the Salaf. And the practice of",
    "foot_note": "1. See: \"Siyar A'lam Al-Nubala\" (13/274), and \"Tadhkirat Al-Huffaz\" (2/154), both by Al-Dhahabi, with similar wording. \n2. See: \"Bayan Fadl Ilm Al-Salaf 'ala Al-Khalaf\" (pp. 50-51).",
    "book_id": "267",
    "new_page_number": 74
  },
  {
    "serial_number": "3425190",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 76,
    "volume_number": 1,
    "text": "Al-Tirmidhi is a witness to this.\n* * *\n\nThe Fifteenth Doubt\nSome said: Abandoning the hadith due to lack of knowledge of a dissenter is [a view held by] the later scholars, excluding Al-Shafi'i and Ahmad. Uncovering this doubt is from several aspects:\nThe First Aspect: It preceded that Imam Al-Shafi'i, may Allah have mercy on him, establishes leaving action upon the hadith if it is abrogated.\nThe Second Aspect: The practice of Al-Tirmidhi and what Ibn Rajab mentioned about the people of knowledge preceded, for they abandoned acting upon the hadith if it was not acted upon. So it is not correct to attribute that to the later scholars excluding the early ones; because Al-Tirmidhi is early and Ibn Rajab attributes it to the early ones.\n* * *\n\nThe Sixteenth Doubt\nSome said: If a text is found that was not acted upon, there must be someone who acted upon it, and it is not necessary to transmit the saying of the one who acted upon it (1); because there is definitely someone who acted upon it. So it is not correct to say: That scholars agreed on abandoning action upon the hadith; because this is inconceivable. Uncovering this doubt is from several aspects:\nThe First Aspect: That if there is someone among the scholars who acted upon it, it must be transmitted to us who acted upon it so that it is not thought that there is consensus on the issue and consensus is an authority.\nThe Second Aspect: Al-Shafi'i's speech on abrogation preceded, and that he - may Allah have mercy on him - abandoned a hadith; because the scholars",
    "foot_note": "1. i.e., merely by the existence of the text, even if the people of knowledge did not find anyone who acted upon it.",
    "book_id": "267",
    "new_page_number": 75
  },
  {
    "serial_number": "3425191",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 77,
    "volume_number": 1,
    "text": "agreed on its abrogation. So he does not accept this implication. The Third Aspect: That there is no evidence for this claim, and whoever wants to claim it is required to provide evidence.\n* * *\n\nThe Seventeenth Doubt\nSome said: Opposing one whose saying is not an authority, regarding which consensus was recounted, is more excusable than opposing one whose saying is an authority, which is the Book and the Sunnah. So how can the authority, which is the Book and the Sunnah, be left for one whose saying is not an authority? Uncovering this doubt is from several aspects:\nThe First Aspect: That consensus is an authority. If it becomes clear that scholars agreed on abandoning a hadith, the one opposing the consensus is opposing a Sharia authority and sins by that. There is a difference between opposing individual people of knowledge and opposing their consensus. Just as the Quran and Sunnah are authority, likewise consensus is authority. Just as one is not excused for abandoning the Book and Sunnah without a justification or Sharia warrant, likewise one is not excused for abandoning consensus.\nThe Second Aspect: That such a thing is only said if a text from the Book or Sunnah contradicts a consensus. The reality is that there is no contradiction between them; because consensus is definitive and must be prioritized either by specification, restriction, clarification, or by saying it is abrogated as explicitly stated by Imam Al-Shafi'i, may Allah have mercy on him, and stated by others of the people of knowledge.\n* * *\n\nThe Eighteenth Doubt\nSome said: A group of people of knowledge said opinions they were not preceded in, so this indicates the permissibility of initiating a new opinion. Uncovering this doubt is from several aspects:",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 76
  },
  {
    "serial_number": "3425192",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 78,
    "volume_number": 1,
    "text": "The First Aspect: There is a difference between a scholar's foundational theory (Ta'sil) and his practice. He might err and think he has a precedent. So a foundation is not taken from his practice if it contradicts his foundation. Rather, it is said: He erred in applying this principle to the branch, not that he invalidates the principle. If a scholar said: The command implies obligation. And he did not say it is obligatory in an issue containing a command without a diverting factor, it is not said: He has another opinion on the indication of the command for obligation. Rather, it is said he erred in applying this principle to this branch.\nThe Second Aspect: That the implication of this saying is the permissibility of initiating a new opinion. This is a calamity, and discussion with him is different from discussion with the rest; because whoever permits initiating a new opinion, the reality of his saying is that consensus is not an authority; because any consensus can be opposed by initiating a new opinion. Therefore, every evidence indicating that consensus is an authority is a refutation of this. It is also said: Every evidence indicating that innovations are prohibited in Sharia, like the saying of the Prophet, peace and blessings be upon him: «Whoever introduces into this affair of ours that which is not of it, it is rejected» (1), is a refutation of him, and the explanation of this has preceded.\n* * *\n\nThe Nineteenth Doubt\nSome said: Imam Ishaq bin Rahwayh said in \"Masa'il Ishaq bin Mansur\": It was said to Ishaq bin Rahwayh: Your brother Ahmad bin Hanbal answered in it similar to your answer. He said: I did not think that anyone agreed with me (2). This indicates that Ishaq bin Rahwayh sees the initiation of a new opinion; because he spoke on an issue in which he did not think anyone agreed with him.",
    "foot_note": "1. Narrated by Al-Bukhari (2697), and Muslim (1718). \n2. See: \"Masa'il Ishaq bin Mansur\" (5/2075), with the wording: \"I thought that no one followed me in it.\" And the wording above, see it in \"Al-Muhalla\" by Ibn Hazm (5/247).",
    "book_id": "267",
    "new_page_number": 77
  },
  {
    "serial_number": "3425193",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 79,
    "volume_number": 1,
    "text": "Uncovering this doubt: This is incorrect; because he did not think any of his contemporaries or famous scholars of his time [agreed], not that he sees himself as having initiated this opinion. In another style it is said: Ishaq's words bear the possibility that he permits initiating a new opinion, and bear the possibility that he does not think any of the scholars contemporary to him agree with him in this opinion. Definitively, it is interpreted as the second without the first; because neither Ishaq nor others of the Imams of Sunnah see the permissibility of initiating a new opinion. Had they seen that, it would have been transmitted from them and attributed to them by the people of knowledge.\n* * *\n\nThe Twentieth Doubt\nSome said: Scholars have customarily prioritized the Book and Sunnah over consensus and make consensus the last rank of evidences. So he says: The Book, Sunnah, and consensus indicated this. Therefore, if consensus contradicts the Hadith or consensus contradicts the Verse, the Verse or Hadith is prioritized. It is said: As for prioritizing the Book and Sunnah over consensus in terms of arrangement, there is no doubt in this. The discussion is not about such things, but rather the discussion is about one who thinks from texts that it contradicts consensus, whether this thought is prioritized or consensus which is definitive in its indication is prioritized. In another way it is said: If a Mujtahid thinks that this text indicates such and such, no matter how high his status, he is between being certain or conjecturing. His certainty and conjecture are prone to error. So if he thinks the text contradicts consensus, then definitively consensus is prioritized over his conjecture because consensus is definitive. This is unlike his understanding which is prone to error. So the infallible definitive is prioritized over the speculative prone-to-error understanding. If this were disciplined, many issues would be uncovered; because many of those who want to reject consensus in the apparent meaning of texts assume contradiction while in reality there is no contradiction.",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 78
  },
  {
    "serial_number": "3425194",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 80,
    "volume_number": 1,
    "text": "The Twenty-First Doubt\nSome said: There is no consensus in instrumental sciences (Ulum Al-Alah) because there are no texts in them, and there is no consensus except that it is based on a text. To uncover this doubt, it should be known that instrumental sciences are of two types:\nThe First Type: Instrumental sciences that go back to theologians and their sayings. What is such is supposed not to be researched legally. This type includes instrumental sciences that go back to language, so the authority in them is the speech of linguists.\nThe Second Type: Instrumental sciences based on legal research, so they must be referred to Sharia evidences. In Principles of Jurisprudence (Usul Al-Fiqh), the command implies obligation, consensus is an authority, and prohibition implies unlawfulness... etc. These are from instrumental sciences and they are agreed upon. The Companions agreed that the command implies obligation (1), and agreed that prohibition implies unlawfulness (2). So this second type related to legal matters from instrumental sciences must have Sharia evidences, between consensus or other, and from that are evidences whose indication is disputed.\n* * *\n\nThe Twenty-Second Doubt\nSome said: The reality of a Tabi'i opposing a Companion is initiating a new opinion. Does this mean that the Tabi'i sees initiating a new opinion?",
    "foot_note": "1. See: \"Al-Ihkam\" by Al-Amidi (2/148), and \"Rawdat Al-Nazir\" by Ibn Qudamah (1/556). \n2. See: \"Al-Ihkam\" by Al-Amidi (2/190).",
    "book_id": "267",
    "new_page_number": 79
  },
  {
    "serial_number": "3425195",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 81,
    "volume_number": 1,
    "text": "Uncovering this doubt: There is a difference between a scholar's foundational theory and his practice. A Tabi'i might think he has a precedent from the Companions and based on this initiated a new opinion. Or the Tabi'i might not know that there is a Companion who disagreed with him, so he spoke by his Ijtihad. It does not follow that if a Tabi'i opposes a Companion, he is among those who see the permissibility of initiating a new opinion.\n* * *\n\nThe Twenty-Third Doubt\nSome said: Consensus and lack of knowledge of a dissenter are acted upon and there is no problem in that. The problem is only in one particular: if it contradicts an evidence from the Book and Sunnah, then the Book and Sunnah are prioritized over this consensus. Definitively, this is not in definitive consensus but rather in speculative consensus. Uncovering this doubt is from several aspects:\nThe First Aspect: That if he acknowledges that consensus is an authority, then he should deal with the text and consensus as two authorities that conflicted, so combining them is better than canceling one of them. Consensus is definitive in its indication and the text does not necessarily have to be so even if the Mujtahid thinks so. As for consensus, because it is definitive, the indication of consensus is prioritized either by specifying a general [text], restricting an absolute one, clarifying an ambiguous one, or consensus on abandoning the text because it is abrogated.\nThe Second Aspect: If scholars agree that this text is abrogated, it should be known that the abrogator is not the consensus itself, but rather what the consensus relied upon, which is the other text. So the reality of the matter is that if consensus differs with a text, the difference is between two texts, except that the evidence of consensus has an advantage over being based on a text, which is that it is definitive in its indication.\nThe Third Aspect: If this foundation were adhered to, which is that consensus is an authority unless",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 80
  },
  {
    "serial_number": "3425196",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 82,
    "volume_number": 1,
    "text": "its speculative part contradicts a text, the disagreement would become little with those who see prioritizing the text over consensus. But if one scrutinizes the practice of those holding this foundation, it becomes clear that they expand even into other issues where there is no text but rather generalities and other things to which they resort and reject consensuses because of them. Then even if their saying is accepted for the sake of argument, it hardly exists. And if it existed, it is said: Rejecting speculative consensus because it contradicts the text is a conjecture prone to error and correctness. As for the indication of consensus, it is definitive even if it is speculative in its establishment; it is not probable in its indication. So the indication of the definitive is prioritized over the indication of the probable speculative. And the text is directed with what suits it of restriction, specification, clarification, abrogation, or consensus on abandoning action upon it.\n* * *\n\nThe Twenty-Fourth Doubt\nSome mentioned that Al-Nawawi, may Allah have mercy on him, mentioned in his explanation of Muslim that the text is acted upon even if no one acted upon it. He mentioned this when discussing fasting six days of Shawwal. He said, may Allah have mercy on him, in his \"Sharh on Muslim\": \"And the proof for Al-Shafi'i - i.e., those who said to fast six of Shawwal - and those who agreed with him is this explicit authentic hadith. And if the Sunnah is established, it is not left for the abandonment of some people or most of them or all of them of it\" (1). This is the witness. Uncovering this doubt is from several aspects:\nThe First Aspect: That Al-Nawawi's own practice is contrary to that. Al-Nawawi, may Allah have mercy on him, agreed with Al-Tirmidhi (2) on not killing the drinker of alcohol on the fourth time and relied on consensus (3). And he established in more than one place in \"Sharh on Muslim\" and his book \"Al-Majmu'\" that consensus abrogates.",
    "foot_note": "1. See: \"Sharh Muslim\" by Al-Nawawi (8/56). \n2. See: \"Jami' Al-Tirmidhi\" (4/48) following hadith (1444). \n3. See: \"Sharh Muslim\" by Al-Nawawi (11/217).",
    "book_id": "267",
    "new_page_number": 81
  },
  {
    "serial_number": "3425197",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 83,
    "volume_number": 1,
    "text": "Indeed, he mentioned what is more severe than that, which is: \"That it has come from the Prophet, peace and blessings be upon him, and from the Companions more than four Takbirs on the funeral.\" Yet he said: \"But consensus convened that no more than four Takbirs are said\" (1). So he made all the Takbirs established from the Prophet, peace and blessings be upon him, exceeding four abrogated by consensus, and that the Sunnah is Takbir four times only.\nThe Second Aspect: Al-Nawawi's extensive practice is contrary to that. Therefore, those who adopt such issues, you see them not relying on Al-Nawawi, and they are harsh in speaking about him.\nThe Third Aspect: That Al-Nawawi's phrase is problematic, so one should pause regarding it or interpret it with a meaning consistent with the rest of his speech; because in his \"Sharh Muslim\" itself and in his book \"Al-Majmu'\" and others, he established that consensus is an abrogator and mentioned more than one text whose practice was abandoned; because scholars agreed on abandoning it.\nThe Fourth Aspect: Let us assume for the sake of argument that Al-Nawawi, may Allah have mercy on him, went to this opinion. It is said that he erred and that the saying of others is prioritized over his saying due to what preceded in previous aspects. Finally, these are the most famous doubts and problems mentioned by some of Ahlus-Sunnah in rejecting consensus or rejecting using it as evidence in places or weakening it or accepting it in cases without others without straight proof.",
    "foot_note": "1. See: \"Al-Majmu'\" by Al-Nawawi \"Al-Majmu'\" (5/230). And it preceded.",
    "book_id": "267",
    "new_page_number": 82
  },
  {
    "serial_number": "3425198",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 84,
    "volume_number": 1,
    "text": "Conclusion\nThe most important results extracted from this treatise are as follows:\n1 - The importance of the evidence of consensus, and its advantage over other evidences.\n2 - Not exaggerating in definitions and boundaries, and that exaggeration in them is the method of theologians.\n3 - The evidences for the authority of consensus, and the evidences used by some Usulis for the authority of consensus which have no indication in them.\n4 - The stance of the people of innovation towards the evidence of consensus.\n5 - The implication of the saying that tacit consensus is not an authority.\n6 - Imam Ahmad does not deny consensus, and his saying: \"Whoever claims consensus\" he intends by it..\n7 - Consensus is of two types: definitive and speculative, and their criteria.\n8 - Discussion on the meaning of tacit consensus and the ruling of using it as evidence.\n9 - Directing Al-Shafi'i's saying: No statement is attributed to a silent person.\n10 - It is stipulated in consensus that it be based on a text, and knowing this text is not stipulated.\n11 - Consensus is an authority whether preceded by disagreement or followed by disagreement, and the answer to Ahmad's narration that he does not see consensus after disagreement.\n12 - Examples of consensus after disagreement.\n13 - The criterion of the anomalous opinion, and its wrong usages.\n14 - The consensus of the people of each art is an authority.\n15 - The consensus of theologians is not considered by consensus.\n16 - Extinction of the era is not stipulated, and the meaning of stipulating extinction of the era.",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 83
  },
  {
    "serial_number": "3425199",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Persuasion in the Authority of Consensus",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 85,
    "volume_number": 1,
    "text": "17 - It is not permissible to initiate a new opinion.\n18 - The Zahiri school is an innovated school.\n19 - The prohibition of Talfeeq (mixing schools), its meaning and examples.\n20 - The default is the validity of consensus recounted by one with inductive knowledge, and the method of knowing consensus.\n21 - Those who recounted consensus and intended the majority.\n22 - The evidence of consensus is revelatory.\n23 - Uncovering the doubt of breaching consensus by claiming that the Prophet, peace and blessings be upon him, is his precedent.\n24 - Uncovering the doubt that consensus is not used as evidence because there is breached consensus.\n25 - Consensus is not on one degree but varying degrees.\n26 - The passage of a long time on recounting tacit consensus makes it an authority by consensus.\n27 - Uncovering the doubt that negation of disagreement is not consensus.\n28 - The meaning of Sunnah being an authority in itself.\n29 - The consensus used as evidence by Ahmad and Ibn Taymiyyah is not specific to the consensus of the Companions.\n30 - Consensus is not specific to necessity.\n31 - Types of consensuses are three.\n32 - It is correct to use consensus as evidence in opposing evidence.\n33 - Uncovering the doubt that a hadith is not left due to lack of knowledge of who acts upon it.\n34 - That some scholars said opinions and had no precedent.\n35 - Consensus in instrumental sciences.\n36 - Uncovering the doubt that consensus is not acted upon if it contradicts an evidence.\n37 - Consensus of scholars on abrogating a hadith is an authority.",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 84
  }
]