[
  {
    "text": "Al-Zabad fi Mustalah al-Hadith\nAuthor: فضل الرحمن عبد العليم صافي\nYear: 1442",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "category_id": "10",
    "category": "Hadith Sciences",
    "new_page_number": 1
  },
  {
    "text": "sn: 3541\nbook_title: الزبد في مصطلح الحديث (شرح منظومة الشيخ عبد الرحمن أبي بكر الملا، المسماة «إلهام المغيث في أقسام الحديث»)\nbook_link: https://shamela.ws/book/797\nbook_id: 797\nauthor_name: فضل الرحمن عبد العليم صافي\nauthor_year: 1442\nnickname: Null\nauthor_link: https://shamela.ws/author/177\nauthor_ID: 177\neditor: Null\npublisher: دار عمار للنشر والتوزيع - عمان - الأردن\nedition: الأولى، 1428 هـ - 2007 م\npages: 60\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: علوم الحديث\ncategory_id: 10",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "category_id": "10",
    "category": "Hadith Sciences",
    "new_page_number": 2
  },
  {
    "serial_number": "3349054",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Sciences of Hadith\nBook: Al-Zabad fi Mustalah al-Hadith (The Cream in Hadith Terminology) - A commentary on the poem of Sheikh Abdul Rahman Abu Bakr Al-Mulla, titled \"Ilham Al-Mughith fi Aqsam Al-Hadith\" (Inspiration of the Aider regarding the Categories of Hadith)\nAuthor: Fadl Al-Rahman Abdul Alim Safi (Died 1442 AH)\nPrinted at the expense of: The son of the poet, Professor Abu Bakr bin Sheikh Abdul Rahman Abu Bakr Al-Mulla\n\nBook: Al-Zabad fi Mustalah al-Hadith (Commentary on the poem of Sheikh Abdul Rahman Abu Bakr Al-Mulla, titled \"Ilham Al-Mughith fi Aqsam Al-Hadith\")\nAuthor: Fadl Al-Rahman Abdul Alim Safi (Died 1442 AH)\nPrinted at the expense of: The son of the poet, Professor Abu Bakr bin Sheikh Abdul Rahman Abu Bakr Al-Mulla\n\nAuthor: Fadl Al-Rahman Abdul Alim Safi (Died 1442 AH)\nPrinted at the expense of: The son of the poet, Professor Abu Bakr bin Sheikh Abdul Rahman Abu Bakr Al-Mulla\n\n[The book's numbering matches the printed version]",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 3
  },
  {
    "serial_number": "3349055",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 1,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful.\nPraise be to Allah, the Lord of the Worlds, who says in the precise Revelation: {And We revealed to you the message that you may make clear to the people what was sent down to them and that they might give thought}. (1)\nPeace and blessings be upon His trustworthy Messenger, our master Muhammad, who said: \"Beware, I have been given the Qur'an and the like of it with it,\" (2) and upon all his family and companions.\nTo proceed:\nSince the noble Prophetic Sunnah is the second source of legislation, our early scholars, generation after generation, took great care in correcting, scrutinizing, and controlling it regarding narration (Riwayah) and understanding (Dirayah), both in text (Matn) and chain of transmission (Sanad). This was out of fear of falling into what is not established from the Wise Lawgiver. Books were authored in this regard, known as the science of Terminology (Mustalah). Among these books are extensive works such as \"Tadrib al-Rawi\" by Al-Suyuti, his \"Alfiyyah\", and the \"Muqaddimah\" of Ibn al-Salah, and many others. Among them are concise works, which are also numerous, such as: \"Al-Bayquniyyah\" and its commentaries, and \"Nukhbat al-Fikr\" with its commentary by Al-Hafiz Ibn Hajar...",
    "foot_note": "1. Surah An-Nahl, Verse 44.\n2. Reported by Abu Dawood, Book of Sunnah, Chapter on Adhering to the Sunnah (4604) from Al-Miqdam ibn Ma'dikarib regarding the Messenger of Allah (peace be upon him) that he said: \"Beware, I have been given the Qur'an and the like of it with it.\"",
    "book_id": "797",
    "new_page_number": 4
  },
  {
    "serial_number": "3349056",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 2,
    "volume_number": 1,
    "text": "...Al-Asqalani, and \"Taysir Mustalah al-Hadith\" by Mahmoud Al-Tahhan. The later scholars, may Allah have mercy on them, aimed for simplification for students in these concise works, especially students of institutes and universities. This poem (Manzumah) which is before us is by Sheikh Abdul Rahman bin Sheikh Abu Bakr Al-Mulla, along with its commentary by Sheikh Fadl Al-Rahman Safi. The reader will find in this poem an aspect of brevity that does not compromise content, along with the strength of wording and soundness of style. This is one of the attributes of a godly scholar who teaches his students issues of knowledge, the small ones before the big ones, gradually according to the student's understanding.\nWe find that our Sheikhs from Al-Ahsa, may Allah have mercy on them, had great care for this lofty science, and they had an ample share in the science of narration and understanding up to our days, praise and gratitude be to Allah. They left us a Hadith heritage to be a trust upon our necks, to bring it out to the light so we may benefit and benefit others. Among what those predecessor masters left us in this science is a lot, including, for example: \"Mukhtasar Sahih Al-Bukhari\" by the scholar Sheikh Muhammad bin Omar bin Abdul Rahman Al-Mulla. As for Sheikh Abu Bakr bin Sheikh Muhammad Al-Mulla, he has many books in this science, including, for example: \"Sharh Sahih Al-Imam Al-Bukhari\", \"Sharh Shama'il Al-Imam Al-Tirmidhi\", and \"Al-Radd Al-Fasih 'ala Munkir Al-Amal bi Al-Nass Al-Sarih\".",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 5
  },
  {
    "serial_number": "3349057",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 3,
    "volume_number": 1,
    "text": "As for Sheikh Muhammad bin Saeed Al-Omair, he has a supplication for the completion of Sahih Al-Imam Al-Bukhari. As for Sheikh Abdul Rahman bin Sheikh Abu Bakr Al-Mulla, he has his poem named \"Ilham Al-Mughith fi Aqsam Al-Hadith\", and what is in your hands is a commentary on it. Brother Murad bin Abdullah Al-Mulla asked me to write a foreword for this book, and since I could not go against his wish, I wrote these brief lines given the limited space, hoping for success from Allah and that He benefits students of knowledge with it, and makes our work purely for His Noble Face; indeed He is Hearing and Responsive. Finally, we ask Allah Almighty to grant us success in learning and teaching, and serving the Islamic heritage in a way that befits this great religion. May Allah have mercy on our Sheikh, the poet, and grant him abundant reward, and may Allah reward the commentator with all good, forgive his parents, and benefit [others] through his knowledge. May Allah send blessings and peace upon our master Muhammad and upon his family and companions.\nWritten by Ahmed bin Sheikh Abdullah bin Sheikh Abu Bakr Al-Mulla\nBeginning of Rabi' Al-Thani 1426 AH - Al-Ahsa",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 6
  },
  {
    "serial_number": "3349058",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 4,
    "volume_number": 1,
    "text": "Biography of the Poet (Al-Nazim), May Allah Almighty Have Mercy on Him\n\nHis Name and Lineage:\nHe is the scholar, the Hadith specialist (Muhaddith), the jurist (Faqih), the man of letters, Sheikh Abdul Rahman bin Sheikh Abu Bakr bin Sheikh Abdullah Al-Mulla. The Al-Mulla family is attributed to the house of Al-Wa'iz (the Preacher), whose lineage goes back to the great companion, our master Abdul Rahman bin Abu Bakr Al-Siddiq, may Allah be pleased with him. The uncle, Sheikh Abdul Rahman, indicated this in his elegy for his father, the grandfather Sheikh Abu Bakr, may Allah have mercy on them, saying:\n\"From Quraysh, your noble fathers came ... They are the protectors of the den, the cave (refuge) of the guest.\nTo Abu Bakr they belong, and from Taym ... Branches sequenced from roots.\"\n\nHis Upbringing:\nOur Sheikh, the poet, may Allah have mercy on him, grew up in a house known for piety, devoutness, and righteousness. His father raised him on noble character and strove with him and his brothers, teaching them the Holy Qur'an, reading, writing, jurisprudence (Fiqh), Prophetic litanies (Awrad), and Sharia sciences. The house of Sheikh Abu Bakr at that time was a landing place for guests, including scholars, the poor, and wayfarers. His father was known for honoring them, caring for them, meeting their needs,",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 7
  },
  {
    "serial_number": "3349059",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 5,
    "volume_number": 1,
    "text": "and providing appropriate housing and food for them. This matter had an impact and influence on the formation of the personality of the poet, may Allah Almighty have mercy on him.\n\nHis Teachers (Shuyukh):\nThe poet, may Allah have mercy on him, studied under his father, Sheikh Abu Bakr, learning from him the Holy Qur'an, reading, writing, Fiqh, and other subjects. He also learned from his father's student, the scholar and jurist Sheikh Muhammad bin Abdul Latif Al-Mulla. He learned grammar from Sheikh Abdul Latif Al-Ja'fari and Sheikh Ahmed Al-Ali Al-Arfaj. He also read to the pious scholar Sheikh Abdul Aziz Al-Alji, and learned Fiqh from Sheikh Muhammad Al-Halabi Al-Hanafi, who was among the scholars who came to Al-Ahsa during his father's time. Then his father sent him to Makkah Al-Mukarramah to complete his studies there, so he joined Al-Sawlatiyyah School and graduated from it. He accompanied the scholars of the Meccan Haram, which was like an open university sought by the great scholars of the Ummah to spread their knowledge. He learned from the scholars he met at that time. Then he traveled to Al-Madinah Al-Munawwarah and accompanied a number of famous scholars there. During this time, may Allah have mercy on him, he would not hear of a versatile Sheikh except that he would accompany him and learn from him. Among his most prominent teachers whom he learned from outside his hometown of Al-Ahsa were: The scholar and Muhaddith Sheikh Omar Hamdan Al-Mahrasy in the Six Books [of Hadith], and the scholar, Muhaddith, and Mujahid Sayyid Muhammad Abdul Hayy Al-Kattani",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 8
  },
  {
    "serial_number": "3349060",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 6,
    "volume_number": 1,
    "text": "in the noble Hadith, and the jurist scholar Sheikh Hussein Abdul Ghani Al-Hanafi, and the scholar, jurist, and legal theorist Sheikh Muhammad Yahya Aman. He also read to the righteous jurist Sheikh Baha' al-Din Al-Afghani, and the scholar and Muhaddith Sheikh Abdul Ra'uf Al-Masri. He took Prophetic Biography (Seerah) and Islamic History from the scholar Sayyid Muhammad Al-Arabi Al-Tabani. He read grammar to the scholar Sheikh Muhammad bin Ali bin Hussein Al-Maliki, and learned from Sayyid Sheikh Abbas Al-Maliki, and learned from Sheikh As'ad Al-Maliki.\n\nHis Students:\nSince our Sheikh, the poet, may Allah Almighty have mercy on him, had a comprehensive knowledge of Sharia and Arabic sciences and their related fields, students of knowledge flocked to him to learn from him, acquire his knowledge, and connect with his Hadith chains of transmission (Asanid), which are considered among the highest and most elevated chains after the death of his teachers and peers. A group of students of noble knowledge gathered around him when he was residing in Makkah Al-Mukarramah. When he settled in his birthplace, Al-Ahsa, his house became a destination for students of knowledge and scholars starting from Al-Ahsa, Najd, and Hijaz, to the rest of the neighboring countries. As we mentioned, the Sheikh's comprehensive knowledge and versatility in various sciences, added to his care for literature and composing poetry, all of that and more gave the Sheikh acceptance and status among his students and visitors. He was",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 9
  },
  {
    "serial_number": "3349061",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 7,
    "volume_number": 1,
    "text": "may Allah have mercy on him, frequent in citing poetry, anecdotes, and appropriate witticisms during his lessons. Therefore, his session was never boring, and his listener would listen attentively and enjoy his speech.\n\nHis Works:\nThe Sheikh, may Allah have mercy on him, left us several treatises and various fatwas in numerous arts. He also left us a collection of poetry (Diwan), prose pieces, and literary Maqamat, which are on their way to see the light soon, God willing, under the care of his grandsons Sheikh Murad and Sheikh Ra'id, the sons of Abdullah Al-Mulla.\n\nHis Death:\nOur Sheikh, the poet, may Allah Almighty have mercy on him, passed away on the evening of the twenty-sixth of Shawwal in the year 1429 AH, at the age of ninety-eight. He spent them, may Allah have mercy on him, in learning and teaching, benefiting Muslims through Ruqyah Shar'iyyah (spiritual healing), supporting the oppressed, restoring their rights, and helping the poor and needy. May Allah grant him wide mercy, dwell him in His vast gardens, and bless his offspring, his household, his students, and all Muslims with every good and righteous deed.\n\nWritten by his student and nephew, Ahmed bin Sheikh Abdullah bin Sheikh Abu Bakr Al-Mulla.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 10
  },
  {
    "serial_number": "3349062",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 8,
    "volume_number": 1,
    "text": "Text of the Poem (Urjuza)\n\"Ilham Al-Mughith fi Aqsam Al-Hadith\"\n(Inspiration of the Aider regarding the Categories of Hadith)\n\nThe Poet - may Allah Almighty have mercy on him - said:\n\n1. O you who ask me about Hadith, watching expectantly ... Take its categories in an accessible poem.\n2. The Sahih (Authentic) is that whose chain is connected ... Without irregularity (Shudhudh) and narrated by precise narrators (Dabit) indicating [authenticity].\n3. The Hasan (Good) is the known one, lower than the first ... Its men (narrators) are not like the exalted Sahih.\n4. As for the Da'if (Weak), it is lower than the Hasan ... Due to losing its conditions, so clarify it.\n5. And what is attributed to the Prophet or ascribed ... This is the Marfu' (Raised), so memorize it and you will be correct.\n6. And what is restricted to the saying of the Companion ... This is the Mawquf (Stopped), O one of insight.\n7. And what has a chain that is connected to him ... This is the Mawsul (Connected) wherever it occurs.\n8. And Mursal (Sent/Hurried) is what the Tabi'i (Successor) has raised ... Like his saying: \"On the authority of the Prophet\", who is followed.\n9. And what comes from a Tabi'i as Mawquf ... That is Maqtu' (Severed), coming as known.\n10. And what has a drop in individual narrators of it ... Is Munqati' (Disconnected), it has dropped from the Sahih.",
    "foot_note": "1. The Sukun on the Ya here is for poetic necessity.",
    "book_id": "797",
    "new_page_number": 11
  },
  {
    "serial_number": "3349063",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 9,
    "volume_number": 1,
    "text": "11. The Mu'dal (Problematic) is that from which two have dropped ... consecutively, so follow my explanation.\n12. And what is deleted from the beginning of the chain ... Is Mu'allaq (Hanging), not [from] the middle, by this it is known.\n13. And whoever has dropped [the name] of his Sheikh ... That is Mudallas (Concealed), as has been recorded.\n14. As for the Gharib (Strange), it is what was narrated by ... A single individual among the narrators, no other.\n15. And whoever has contradicted the trustworthy ones (Thiqat) ... His Hadith is Shadh (Irregular) among the narrators.\n16. And the Munkar (Denounced) is that whose text is unknown ... From other than its narrator, and it was not accepted.\n17. And what was narrated from different aspects ... From one [source] is Mudtarib (Disordered), so know it.\n18. And the last of the categories is what was fabricated (Wudi') ... And its attribution to the Prophet has been forbidden.\n19. And the composer of the categories for clarification ... Is the poor one, the worshiper of the Most Merciful (Abid Al-Rahman).\n20. The son of Abu Bakr, the famous one of noble lineage ... Who ascended by his knowledge to the highest ranks.\n21. Upon him be the mercy of the Creator God ... The One of vast mercy for the creatures.\n22. Then the blessings of Allah and peace ... Upon the one whom the clouds shaded.\n23. Muhammad and his pure family ... And his companions, the rising points of lights.\n24. As long as the rain descends from the clouds ... And as long as the full moon appears from the darkness.",
    "foot_note": "1. The Sukun on the Ya here is for poetic necessity.",
    "book_id": "797",
    "new_page_number": 12
  },
  {
    "serial_number": "3349064",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 10,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\n\nIntroduction of the Poet (Al-Nazim), may Allah have mercy on him.\n(1) O you who ask me about Hadith, watching expectantly ... Take its categories in an accessible poem.\n(1) In this verse, the poet, may Allah have mercy on him, calls out to the person who asked him about the types of Hadith. Perhaps this person is one of his students and disciples in acquiring knowledge, and one of those committed to him; we understand this from the style of address. The meaning of the verse in brief is: O questioner who asked me about the definition of Hadith, and you are waiting for me to explain the types of Hadith, then know and take the explanation of the types of Hadith in a close, easy poem in which you will find no difficulty understanding.\nIn this verse, the mention of \"Hadith\" occurred, and I would like to briefly mention the definition of Hadith and Sunnah, so that the reader may distinguish the difference between them. So, with the help of Allah, I say:\nHadith linguistically: The new, opposite of the old. As it is said: So-and-so is new (Hadith) to Islam. It may be applied to speech, as it is said: I heard your Hadith, meaning: your speech. And it is said: So-and-so spoke (Tahaddatha), meaning: talked.\nHadith in the terminology of the people of Athar (Tradition): What is attributed to the Messenger of Allah (peace be upon him) of saying, action, tacit approval, or physical or moral characteristic. It is often applied to what is attributed",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 13
  },
  {
    "serial_number": "3349065",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 11,
    "volume_number": 1,
    "text": "to the Messenger of Allah (peace be upon him) regarding sayings.\nSunnah linguistically: The followed path. It has many usages. Sometimes it is applied to what is evidenced by the Book or the Sunnah, meaning: the legal ruling taken from the Book or the Sunnah. Sometimes it is applied to what opposes innovation (Bid'ah).\nSunnah according to Jurists (Fuqaha): What is not obligatory. Sunnah is also applied to what the practice of the Companions settled upon.\nSunnah in the terminology of the people of Athar: Synonymous with Hadith, meaning: what is attributed to the Messenger of Allah (peace be upon him) of saying, action, tacit approval, or characteristic. However, Sunnah is often applied to what is attributed to the Messenger of Allah (peace be upon him) regarding actions. Thus, the difference between Hadith and Sunnah appears in terms of linguistic and technical meaning, where Hadith is often applied to the sayings of the Prophet (peace be upon him), and Sunnah is often applied to the actions of the Prophet (peace be upon him).",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 14
  },
  {
    "serial_number": "3349066",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 12,
    "volume_number": 1,
    "text": "The First Type: The Sahih (Authentic)\n(2) The Sahih (Authentic) is that whose chain is connected ... Without irregularity (Shudhudh) and narrated by precise narrators (Dabit) indicating [authenticity].\n(2) With this verse, the Sheikh and Poet, may Allah have mercy on him, began explaining the types of Hadith. It is worth mentioning that Hadith, according to the terminologies of the people of Hadith, varies into many types, and each type has a term or special name given to it by the scholars of Hadith. The Hadith in itself or intrinsically does not divide except into three categories: Sahih (Authentic), Hasan (Good), and Da'if (Weak). Other types like: Marfu', Mawsul, Mawquf, and Munqati' are not considered categories of the [acceptability of] Hadith, because each category does not combine with its counterpart; for example, the Weak does not combine with the Authentic, so it is not correct to say this Hadith is Authentic and Weak. As for the type, it combines with another type, so it is correct to say: This Hadith is Marfu', Mawsul, and Sahih. Thus, what comes in the poem of the Sheikh - may Allah have mercy on him and make Paradise his abode - he mentioned to us in the second verse of his poem the definition of the Sahih Hadith, saying:\nThe Sahih, meaning the Sahih Hadith: is what its chain (Sanad) is connected, meaning it is the Hadith whose chain is connected without Shudhudh (irregularity),",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 15
  },
  {
    "serial_number": "3349067",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 13,
    "volume_number": 1,
    "text": "Meaning: its text (Matn) is not irregular (Shadh). And indicated by precise narrators (Dabiteen), meaning: narrated by the transmission of upright (Adl), precise narrators. His saying at the end of the verse: \"wa bi-Dabiteen\" is in the form of the sound masculine plural genitive with Ya, so it should not be thought to be dual.\nSo the definition of the Sahih Hadith in brief is: \"The Hadith whose chain of transmission is connected by the transfer of an upright, precise person from his like until its end, without irregularity or defect ('Illah).\"\nBy looking at the definition of the Sahih Hadith, it becomes clear to us that five conditions must be present in a Hadith for it to be called a Sahih Hadith, which are:\n1 - Connection of the Chain (Ittisal al-Sanad): Meaning that every narrator among its narrators took it directly from the one above him, from the beginning of the chain to its end.\n2 - Integrity of Narrators ('Adalat al-Ruwat): Meaning that every narrator among its narrators is characterized by being a Muslim, adult, sane, not corrupt (Fasiq), and not having his dignity (Muru'ah) comprised.\n3 - Precision of Narrators (Dabt al-Ruwat): Meaning that every narrator among its narrators is perfectly precise, either precision of memory (chest) or precision of writing (book).\n4 - Absence of Irregularity (Shudhudh): Meaning after the presence of the three mentioned conditions, the text of the Hadith is not irregular. Shudhudh is: the contradiction of a trustworthy person to one who is more trustworthy than him.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 16
  },
  {
    "serial_number": "3349068",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 14,
    "volume_number": 1,
    "text": "5 - Absence of Defect ('Illah): Meaning: The Hadith should not be defective. The intended meaning of 'Illah in this condition is: The hidden, obscure cause that impugns the authenticity of the Hadith despite its presence, which no one perceives except the experts and skilled among the Muhaddithin (Hadith scholars). The appearance of the chain and the Hadith seems free from this defect. If one of these five conditions is missing, the Hadith is then not called a Sahih Hadith.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 17
  },
  {
    "serial_number": "3349069",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 15,
    "volume_number": 1,
    "text": "The Second Type: The Hasan (Good)\n(3) The Hasan (Good) is the known one, lower than the first ... Its men (narrators) are not like the exalted Sahih.\n(3) The poet, may Allah have mercy on him, mentioned in this verse the definition of the second category of Hadith categories, which is: The Hasan Hadith. He said, may Allah have mercy on him: The Hasan Hadith is: The Hadith that is known among the Muhaddithin, but it did not reach the degree of the Sahih, and the men of its chain do not have a high degree as the men of the Sahih degree have. This is the meaning of the verse regarding the definition of the Hasan Hadith. We can mention the definition of the Hasan Hadith briefly: The Hasan Hadith is: The Sahih Hadith, if the precision of its narrator is light, meaning: his precision is less. Meaning: The Hasan Hadith is that in which the conditions of the Sahih Hadith exist, such as connection of the chain, integrity of narrators, along with their precision and its freedom from irregularity and defect, but its narrators do not reach in precision the degree of the narrators of the Sahih.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 18
  },
  {
    "serial_number": "3349070",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 16,
    "volume_number": 1,
    "text": "The Third Type: The Da'if (Weak)\n(4) As for the Da'if (Weak), it is lower than the Hasan ... Due to losing its conditions, so clarify it.\n(4) The poet, may Allah have mercy on him, mentioned in this verse the definition of the third category of Hadith categories, which is the Da'if Hadith. He said, may Allah have mercy on him: The Da'if Hadith is the Hadith: which is lower in rank than the Sahih Hadith, due to the lack of the conditions of the Hasan Hadith in it. We recall that the conditions of the Sahih and Hasan Hadith are five:\n1 - Connection of the chain.\n2 - Integrity of narrators.\n3 - Precision of narrators.\n4 - Freedom of the Hadith from irregularity.\n5 - Its freedom from hidden defects.\n6 - If these conditions are lost, or one of them, in a Hadith, it descends to the degree of the Da'if Hadith. Then, weakness has levels. The lowest of them is: that its narrator has bad memory, meaning: the five mentioned conditions exist in it, but its narrators or one of its narrators has bad memory, unable to memorize except with many attempts and difficulties, and if he memorizes, he forgets quickly. The highest degrees of the Da'if Hadith is that its narrator is a liar and fabricator. This type of narrator, his narration is not looked at nor is his speech accepted at all.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 19
  },
  {
    "serial_number": "3349071",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 17,
    "volume_number": 1,
    "text": "The Fourth Type: The Marfu' (Raised)\n(5) And what is attributed to the Prophet or ascribed ... This is the Marfu' (Raised), so memorize it and you will be correct.\n(5) The poet - may Allah's mercy be upon him - mentioned in this verse a type of Hadith, and this type among the Muhaddithin is called: The Marfu'. The definition of Marfu' - as mentioned by the poet, may Allah have mercy on him - is: The Hadith that is attributed, meaning: ascribed, to the Prophet (peace be upon him). In the end of the verse, the poet - may Allah's mercy be upon him - asked us saying: \"So memorize it\": meaning memorize the known definition of the Hadith as I mentioned to you. And his saying: \"You will be correct\": is the answer to the command, meaning: If you memorize the definition of the Marfu' Hadith and know it, you will be correct in your opinion and saying.\nKnow, O noble reader: That the Marfu' Hadith can be a Sahih Hadith, or a Hasan Hadith, or a Da'if Hadith. Its weakness may be due to Irsal (omission of the Companion), or due to Inqita' (disconnection) - meaning: by dropping one of the narrators from the chain -, or due to I'dal (perplexity) - meaning: dropping two consecutive narrators from the chain -, or due to Idtirab (disorder) - meaning: difference in the narration from a single narrator in the text or chain -, without the existence of a way to prefer [one over the other].",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 20
  },
  {
    "serial_number": "3349072",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 18,
    "volume_number": 1,
    "text": "We will mention - God willing - later at the end of the poem an applied example for the types of Hadith mentioned in this poem, so review it to consolidate the information you have. However, I would like to mention in this place the types of Marfu' Hadith with examples, so I say: The Marfu' Hadith is of four types:\nFirst: The Verbal Marfu', its example: That the Companion or someone else says: The Messenger (peace be upon him) said: Such and such...\nSecond: The Action Marfu', its example: That the Companion or someone else says: (The Messenger of Allah, peace be upon him, did such and such...\nThird: The Tacit Approval (Taqriri) Marfu', its example: That the Companion or someone else says: (Such and such was done in the presence of the Prophet, peace be upon him, and his denial of that action is not narrated).\nFourth: The Descriptive Marfu', its example: That the Companion or someone else says: (The Messenger of Allah, peace be upon him, was the best of people in character).",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 21
  },
  {
    "serial_number": "3349073",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 19,
    "volume_number": 1,
    "text": "The Fifth Type: The Mawquf (Stopped/Suspended)\n(6) And what is restricted to the saying of the Companion ... This is the Mawquf (Stopped), O one of insight.\n(6) The poet, may Allah have mercy on him, mentioned in this verse the definition of the Mawquf Hadith. He said: The Hadith that is restricted to the saying of the Companion is called Mawquf. And the poet's saying, may Allah have mercy on him, at the end of the verse: \"O one of insight\", means: O owner of insight, pay attention and memorize what I mentioned to you of the definition of the Mawquf Hadith.\nIn short, we say in the definition of Mawquf: It is what is attributed or ascribed to a Companion or a group of Companions, whether this attributed thing is a saying, an action, or a tacit approval, and whether the chain to them is connected or disconnected.\nExample of Verbal Mawquf: The narrator's saying: Ali bin Abi Talib, may Allah be pleased with him, said: \"Speak to people according to what they know; do you want Allah and His Messenger to be belied?\"\nExample of Action Mawquf: The statement of Imam Al-Bukhari: \"Ibn Abbas led the prayer while he had performed Tayammum.\"\nExample of Tacit Approval Mawquf: The saying of some Tabi'in - for example -: \"I did such and such in front of the Companions, and they did not deny it for me.\"",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 22
  },
  {
    "serial_number": "3349074",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 20,
    "volume_number": 1,
    "text": "It is worth mentioning that some Muhaddithin - specifically the Khurasanis - call the Mawquf Hadith \"Athar\" (Trace/Tradition), and the Marfu' Hadith \"Khabar\" (Report).",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 23
  },
  {
    "serial_number": "3349075",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 21,
    "volume_number": 1,
    "text": "The Sixth Type: The Mawsul (Connected)\n(7) And what has a chain that is connected to him ... This is the Mawsul (Connected) wherever it occurs.\n(7) The poet, may Allah have mercy on him, explains to us in this verse that the Hadith which has a connected chain from the narrator to the Prophet (peace be upon him), or to the Companion - meaning: there is no interruption or Irsal in its chain - is called a Mawsul Hadith. Thus, we can say: The Mawsul Hadith is: The Hadith whose chain is connected from its beginning to its end, meaning: from the first of the chain to the last of the chain, who is the Prophet (peace be upon him) or the Companion. For example, Imam Al-Bukhari said in his Sahih when he narrated the first Hadith in his book: \"Al-Humaydi told us, he said: Sufyan told us, he said: Yahya bin Saeed Al-Ansari told us, he said: Muhammad bin Ibrahim Al-Taymi informed me: that he heard Alqama bin Waqqas Al-Laythi say: I heard Umar bin Al-Khattab, may Allah be pleased with him, on the pulpit say: I heard the Messenger of Allah (peace be upon him) say: 'Actions are but by intentions, and every person will have but what he intended. So whoever emigrated for a worldly benefit or for a woman to marry, his emigration is to what he emigrated for.'\" This Hadith is called Mawsul; due to the connection of its chain from Imam Al-Bukhari to the Prophet (peace be upon him), meaning:",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 24
  },
  {
    "serial_number": "3349076",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 22,
    "volume_number": 1,
    "text": "that every one of the narrators in the chain heard the Hadith from his Sheikh, and that is from the beginning of the chain to its end. Then after that, we can say: The Mawsul Hadith can be a Marfu' Hadith, Sahih, or Hasan due to the lack of contrast or contradiction between these types. And Allah knows best the truth.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 25
  },
  {
    "serial_number": "3349077",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 23,
    "volume_number": 1,
    "text": "The Seventh Type: The Mursal (Sent/Hurried)\n(8) And Mursal (Sent/Hurried) is what the Tabi'i (Successor) has raised ... Like his saying: \"On the authority of the Prophet\", who is followed.\n(8) In this verse of the poem, we find the definition of the Mursal Hadith. Mursal in language: is the passive participle of 'Arsala' (to send), and the meaning of 'Arsalahu' is: he released it and let it go. Mursal in the terminology of Muhaddithin, as mentioned by the poet, may Allah have mercy on him, is: The Hadith which the Tabi'i raised - meaning: attributed - to the Prophet (peace be upon him). For example, if Said bin Al-Musayyib, or Qatada bin Di'ama, or Muhammad bin Sirin, or Al-Hasan Al-Basri, and their likes said: The Prophet (peace be upon him) said, or on the authority of the Prophet (peace be upon him) that he said such and such, or did such and such, or approved such and such, then this Hadith is called Mursal, because the Tabi'i left out the mention of the Companion in the chain, as if he released the chain from connection.\nThe Mursal Hadith: is a weak Hadith according to the Muhaddithin; it is not permissible to use it as proof. Some jurists permitted using it as proof, like Imam Abu Hanifa, Malik, and Ahmad, may Allah have mercy on them, on the condition that it is a Mursal of a Tabi'i. Imam Al-Shafi'i, may Allah have mercy on him, permits utilizing the Mursal of the senior Tabi'in with conditions, and this is not the place to elaborate on them. However, the Mursal of a Companion is a proof by the agreement of the majority of Muhaddithin and Jurists. The Mursal of a Companion is: That one of the junior Companions, like Ibn Abbas, Ibn Umar, and Ibn Al-Zubair, may Allah be pleased with them, for example, hears a Hadith from one of...",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 26
  },
  {
    "serial_number": "3349078",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 24,
    "volume_number": 1,
    "text": "...the senior Companions, then during the narration he attributes it or narrates it directly from the Prophet (peace be upon him). This type of narration is called the Mursal of a Companion. And Allah is the Grantor of success.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 27
  },
  {
    "serial_number": "3349079",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 25,
    "volume_number": 1,
    "text": "The Eighth Type: The Maqtu' (Severed)\n(9) And what comes from a Tabi'i as Mawquf ... That is Maqtu' (Severed), coming as known.\n(9) The Muhaddithin have agreed in the arts of Hadith to call the saying of a Tabi'i or his action: a Maqtu' Hadith. The poet, may Allah have mercy on him, mentioned in this verse the definition of the Maqtu' Hadith, saying: What came, meaning: was narrated, from a Tabi'i as Mawquf (stopped at him), meaning: from his saying or action, this is called Maqtu'. This is how it became famous and known in the terminology of the Muhaddithin. The Maqtu' is a type of weak Hadith; it is not permissible to use it as proof according to the people of knowledge. And Allah is the Grantor of success.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 28
  },
  {
    "serial_number": "3349080",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 26,
    "volume_number": 1,
    "text": "The Ninth Type: The Munqati' Hadith (Disconnected)\n(10) And what has a drop in individual narrators of it ... Is Munqati' (Disconnected), it has dropped from the Sahih.\n(10) In this verse of the poem came the definition of the Munqati'. This term among the Muhaddithin pertains to the chain of the Hadith. Disconnection (Inqita') is a description of the chain, not the text, but the text of the Hadith may also be described as disconnected, considering its chain. The Munqati' Hadith - as mentioned by the poet, may Allah have mercy on him - is: The Hadith from whose chain one narrator has dropped, whether in one place or in two separate places, because if the disconnection occurred in two consecutive places, it is called Mu'dal. The poet's saying - mercy be upon him -: \"It has dropped from the Sahih\", means: The Munqati' Hadith has dropped - i.e., descended - from the rank of the Sahih Hadith. Therefore, the Munqati' Hadith is a weak Hadith, not permissible to use as proof. And Allah is the Grantor of success to what is correct.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 29
  },
  {
    "serial_number": "3349081",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 27,
    "volume_number": 1,
    "text": "The Tenth Type: The Mu'dal Hadith (Problematic)\n(11) The Mu'dal (Problematic) is that from which two have dropped ... consecutively, so follow my explanation.\n(11) The poet, may Allah have mercy on him, mentioned in this verse the definition of a type of weak Hadith, which is: The Mu'dal Hadith. He said: \"The Mu'dal Hadith is: The Hadith from whose chain two narrators have dropped consecutively, i.e., successively.\" Then he asked the reader of this poem to follow his explanation, i.e., accept his saying in defining the Mu'dal, because it has no definition other than what was mentioned.\nWe want to clarify the meaning of Mu'dal by mentioning an example: \"Al-Qa'nabi from Malik: That it reached him that Abu Huraira said: The Messenger of Allah (peace be upon him) said: 'The slave is entitled to his food and clothing according to what is reasonable, and he should not be burdened with work except what he can bear.'\" This Hadith's chain is Mu'dal, because two consecutive [narrators] dropped from its chain between Imam Malik, may Allah have mercy on him, and Abu Huraira, may Allah be pleased with him... to the end of the Hadith.\nThis type of chain is called Mu'dal; because Mu'dal is the passive participle of 'A'dala', meaning: it exhausted him and tired him, as if the narrator, when he dropped two narrators from the chain, it exhausted him, meaning: he became tired and weak, unable to bear the chain of the Hadith and leaning on it.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 30
  },
  {
    "serial_number": "3349082",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 28,
    "volume_number": 1,
    "text": "The Eleventh Type: The Mu'allaq (Hanging)\n(12) And what is deleted from the beginning of the chain ... Is Mu'allaq (Hanging), not [from] the middle, by this it is known.\n(12) The meaning of the verse: The Hadith from the beginning of whose chain narrators were deleted is called Mu'allaq. But if deleted from its middle, it is not called Mu'allaq. This is what is known among the Muhaddithin. End.\nI say: The Mu'allaqat of Imam Al-Bukhari are known, and they are what he mentioned without a chain in the chapter title, or in the chapter title before starting the narration of the connected Hadith. For example, in Sahih Al-Bukhari, may Allah have mercy on him, in the Book of Irrigation (Musaqat), Chapter No. (17), i.e., \"Chapter: The man who has a path or share of water in a garden or palm trees\". This sentence is called the chapter translation (title). After this sentence, Imam Al-Bukhari said: \"The Prophet (peace be upon him) said: 'Whoever sells palm trees after they have been pollinated, then their fruit belongs to the seller... etc.'\" So the saying of Imam Al-Bukhari: \"The Prophet (peace be upon him) said... etc.\" is called Mu'allaq, because he deleted the chain of the Hadith from its beginning. Imam Al-Bukhari, after mentioning this Mu'allaq, narrated a connected Hadith, and at the end of the Hadith he said: \"And from Malik, from Nafi', from Ibn Umar, from Umar regarding the slave.\" This narration is also among the Mu'allaqat, because Imam Al-Bukhari deleted his chain to Imam Malik, may Allah have mercy on him.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 31
  },
  {
    "serial_number": "3349083",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 29,
    "volume_number": 1,
    "text": "The Mu'allaqat in other than Sahih Al-Bukhari are of the weak Hadith type. Muhaddithin have tracked the Mu'allaqat in Sahih Al-Bukhari and found the majority of them to be connected (Musnad) from the Sahih and Hasan types. And Allah is the Grantor of success.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 32
  },
  {
    "serial_number": "3349084",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 30,
    "volume_number": 1,
    "text": "The Twelfth Type: The Mudallas (Concealed)\n(13) And whoever has dropped [the name] of his Sheikh ... That is Mudallas (Concealed), as has been recorded.\n(13) The meaning of the verse: If the narrator drops the name of his Sheikh from whom he heard the Hadith when narrating the Hadith, meaning: he did not mention him, but mentions the one above him, he is called: Al-Mudallis - with a Kasra on the Lam, active participle - and his Hadith which he narrated without mentioning his Sheikh's name is called: Al-Mudallas - with a Fatha on the Lam, passive participle - and this action of his is called: Tadlis.\nTadlis linguistically: Concealing the defect of the goods from the buyer. The origin of Tadlis is derived from Dalas, which is darkness, or mixing of darkness. As if the Mudallis - with Kasra on the Lam - darkened and hid the matter of the Hadith from the hearer, so the Hadith became: Mudallas - with Fatha on the Lam.\nTadlis in terminology: Hiding a defect in the chain and improving its appearance. Then Tadlis is of two types:\nThe First Type: Tadlis al-Isnad (Concealing the Chain), which is: What the poet, may Allah have mercy on him, defined in this verse, and we explained its meaning previously. We add here an illustration of this type of Tadlis, so we say: Suppose a narrator named Ali, lived with a Sheikh named Muhammad in one era, met him, and heard Ahadith from him. Then he heard another person named Sulaiman narrating from his Sheikh Muhammad, so he wrote a Hadith from him. If Ali narrates the mentioned Hadith from Sulaiman, from Muhammad, his chain is connected. But if...",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 33
  },
  {
    "serial_number": "3349085",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 31,
    "volume_number": 1,
    "text": "...he narrated it from Muhammad directly with the wording: \"He said\" (Qala), or: \"From\" ('An), giving the impression that he heard it from him, and deleted his Sheikh, Sulaiman, then he has committed Tadlis by this action, Tadlis al-Isnad, because he deleted his Sheikh from whom he heard the Hadith and wrote from, and attributed it to a Sheikh above him with wording that bears the possibility of hearing the mentioned Hadith from him, and bears the possibility of non-hearing.\nThe Second Type: Tadlis al-Shuyukh (Concealing the Teachers), which is: The narrator hiding the identity of his Sheikh from the listener, by mentioning him during narration with a name and Kunya (nickname) not known for him. For example: Imam Al-Bukhari, may Allah have mercy on him, is known to everyone by the name: Abu Abdullah Muhammad bin Ismail Al-Bukhari. In his lineage chain came: Ibn Bardizbah Al-Ju'fi - this narrator is called a Mudallis, because he mentioned his Sheikh by a name not known, so it is as if he wanted to cover him and hide him from people so they wouldn't know him.\nRuling on Tadlis and the Mudallis: Tadlis is disliked (Makruh) among Muhaddithin, and its dislike intensifies if the purpose of it is to hide the condition of a weak narrator. Some Muhaddithin said: Tadlis is the brother of lying. The Mudallis is weak if his purpose is bad, and the narration containing Tadlis is not acceptable. However, the Mudallis...",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 34
  },
  {
    "serial_number": "3349086",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 32,
    "volume_number": 1,
    "text": "...if he narrates another Hadith without Tadlis, and explicitly states hearing (Sama') in it, his narration is accepted.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 35
  },
  {
    "serial_number": "3349087",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 33,
    "volume_number": 1,
    "text": "The Thirteenth Type: The Gharib (Strange)\n(14) As for the Gharib (Strange), it is what was narrated by ... A single individual among the narrators, no other.\n(14) The poet, may Allah have mercy on him, wanted to explain to us in this verse of his poem the definition of the Gharib Hadith. He said: As for the Gharib - meaning the Hadith described as Gharib - it is: The Hadith narrated by only one narrator. Meaning: It has no one but one narrator, even if it is famous on the tongues of people. For example: The Hadith \"Actions are but by intentions\" is called a Gharib Hadith; because no one narrated it from the Companions except Umar, may Allah be pleased with him, and no one narrated it from Umar, may Allah be pleased with him, except Alqama bin Waqqas Al-Laythi, and no one narrated it from Alqama except Muhammad bin Ibrahim Al-Taymi, and no one narrated it from Muhammad bin Ibrahim Al-Taymi except Yahya bin Saeed Al-Ansari. Then hundreds of people narrated it from Yahya bin Saeed. The Hadith is Gharib, having one narrator in the layer of Companions, Tabi'in, and their followers. Therefore, it is permissible for a Gharib Hadith to be Sahih, or Hasan, Mawsul, Marfu' or Mawquf. And Allah knows best the truth.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 36
  },
  {
    "serial_number": "3349088",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 34,
    "volume_number": 1,
    "text": "The Fourteenth Type: The Shadh Hadith (Irregular)\n(15) And whoever has contradicted the trustworthy ones (Thiqat) ... His Hadith is Shadh (Irregular) among the narrators.\n(15) The poet - may Allah's mercy be upon him - wanted in this verse to define the Shadh Hadith. He said: If the narrator of the Hadith contradicts the trustworthy ones (Thiqat), then his Hadith is called Shadh among the Muhaddithin. Meaning: A number of trustworthy narrators - for example - narrated a Hadith from Abu Huraira, may Allah be pleased with him, and one narrator stood up, being trustworthy, and narrated it from Ibn Umar, may Allah be pleased with him. This narration of his is called a Shadh narration. Likewise, if a number of trustworthy narrators agreed on the wording of the Hadith, and another narrator stood up, being trustworthy, and contradicted them in the wording, his Hadith is called Shadh.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 37
  },
  {
    "serial_number": "3349089",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 35,
    "volume_number": 1,
    "text": "The Fifteenth Type: The Munkar Hadith (Denounced)\n(16) And the Munkar (Denounced) is that whose text is unknown ... From other than its narrator, and it was not accepted.\n(16) The poet, may Allah have mercy on him, mentioned in this verse the definition of the Munkar Hadith. Munkar: is a passive participle from the chapter of Inkar (denial). We know that denial begins with ignorance (not knowing); since a person does not deny something unless he is ignorant of it (doesn't know it/doesn't recognize it). For that reason, the poet, may Allah have mercy on him, said in the definition of the Munkar Hadith: It is the Hadith whose text is unknown to the narrators, known by no one other than the one who narrated it. There is another description for the narrator whose narration is among the Munkarat; mentioned in the books of Terminology, which is: Weakness. The weakness that made his isolation in narration unacceptable. So if the narrator is weak and is alone in narrating a certain Hadith, contradicting the trustworthy ones in it, his Hadith is said to be: Munkar. We previously mentioned in the definition of the Shadh Hadith that if the narrator is trustworthy and contradicts the trustworthy ones, his Hadith is called Shadh. This is the difference between Shadh and Munkar. Note: The Hadith that is opposite to Shadh or Munkar is called Marfu' and Mahfuz (Preserved). And Allah knows best.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 38
  },
  {
    "serial_number": "3349090",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 36,
    "volume_number": 1,
    "text": "The Sixteenth Type: The Mudtarib (Disordered)\n(17) And what was narrated from different aspects ... From one [source] is Mudtarib (Disordered), so know it.\n(17) This is the definition of the Mudtarib Hadith. The Mudtarib Hadith - as defined by the poet, may Allah's mercy be upon him - is: The Hadith narrated by a number of narrators from one Sheikh, but they differ in their narration either in the chain of the Hadith, or in the text of the Hadith, and it is not possible to prefer (Tarjih) between the aspects of difference. The poet's saying, may Allah have mercy on him: \"Fa'l-ta'rifuh\" (So know it), is a present tense verb addressed to the second person starting with the Fa of sequence and the Lam of command. The poet - upon him be clouds of mercy - commands us to know and memorize the definition of the Mudtarib Hadith as he mentioned. I will give an example for clarification:\nThree narrators narrated from Said bin Al-Musayyib from Abu Huraira, may Allah be pleased with him, a Hadith. One of them narrated it connected and raised (Marfu'), saying: From Said bin Al-Musayyib from Abu Huraira, may Allah be pleased with him, from the Prophet (peace be upon him). The second narrated it as Stopped (Mawquf), saying: From Said bin Al-Musayyib from Abu Huraira, may Allah be pleased with him. The third narrated it as Sent (Mursal), saying: From Said bin Al-Musayyib, from the Prophet (peace be upon him). We cannot prefer the narration of one of them over the others, because in terms of strength and integrity they are in one degree. So we call this difference of theirs regarding Said bin Al-Musayyib: Idtirab (Disorder) in the chain. If they differed in the wording of the Hadith, we would call it: Idtirab in the text. And Allah knows best.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 39
  },
  {
    "serial_number": "3349091",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 37,
    "volume_number": 1,
    "text": "The Seventeenth Type: The Mawdu' (Fabricated)\n(18) And the last of the categories is what was fabricated (Wudi') ... And its attribution to the Prophet has been forbidden.\n(18) Meaning: The last of the types of Hadith is the Hadith that was fabricated. The Mawdu' Hadith is: The speech that one of the narrators attributed to the Prophet (peace be upon him) lying and fabricating. Then the poet, may Allah have mercy on him, explained in the second half of the verse the ruling of the Mawdu' Hadith by saying: (And its attribution to the Prophet has been forbidden), meaning: Attributing the Mawdu' Hadith to the Prophet (peace be upon him) is forbidden and prohibited according to Muslim scholars.\nThe poet's saying - may Allah's mercy be upon him -: (And the last of the categories) undoubtedly means the last of the categories mentioned in this poem. By categories, he means types. Perhaps he, may Allah have mercy on him, mentioned in this poem the types of Hadith and its sciences that he saw important for the beginner student of Hadith science, and left the rest because they do not circulate much on the tongues of Hadith students. So the poet - may Allah's mercy be upon him - mentioned in this poem (17) seventeen types of Hadith and its sciences; and there is no doubt that what he mentioned are the important types, and the student needs to know them when studying Hadith books. Here I mention the titles of the remaining types with a brief explanation of their meanings to complete the benefit, so I say:",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 40
  },
  {
    "serial_number": "3349092",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 38,
    "volume_number": 1,
    "text": "The Eighteenth [Type] of Hadith types and sciences: Knowledge of the Musnad:\nThe Musnad of Hadith is: The Hadith that was narrated with a chain. For example: If we say: The Prophet (peace be upon him) said: \"The best of you is he who learns the Qur'an and teaches it,\" this is called a Hadith, but it is not Musnad. But if we say: From Uthman bin Affan, may Allah be pleased with him, he said: The Prophet (peace be upon him) said; then it is called Musnad.\n\nThe Nineteenth Type of Hadith types and sciences: Al-Mudraj (Interpolated)\nMudraj is the passive participle of Idraj, and its meaning is: Insertion. If the narrator inserts speech from himself into the chain of the Hadith or its text, the Hadith is called Mudraj - with a Fatha on the Ra. For example: If the chain of the Hadith is: From Qatada from Anas he said: The Prophet (peace be upon him) said... Then a narrator came and added from himself: (From Qatada bin Di'ama, from Anas), meaning: he mentioned the name of Qatada's father. His action is called: Idraj (Insertion), and the chain: Mudraj.\nIt came in a Hadith narrated by Imam Al-Bukhari: \"The Prophet (peace be upon him) used to perform Tahannuth in the cave of Hira.\" The narrator mentioned from himself the explanation of Tahannuth, and said: It is worship for a number of nights. This is called: Mudraj in the text.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 41
  },
  {
    "serial_number": "3349093",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 39,
    "volume_number": 1,
    "text": "The Twentieth Type: The Maqlub (Inverted)\nThe Maqlub of Hadith can be either in text or in chain. If one of the narrators narrates a Hadith and makes the end of the text its beginning, and its beginning its end, this is called: Maqlub in the text. However, if he puts the chain of a Hadith to another Hadith and the chain of the second Hadith to the first, it is called: Maqlub al-Isnad (Inverted Chain). If the narrator's intention in inverting Ahadith is blinding and causing ignorance to the listeners, it is an ugly - forbidden - act that impugns his narration. If his intention is testing, then he clarifies the correct one and returns the Hadith to its original wording and chain, then there is no harm in this.\n\nThe Twenty-First Type: The Mufrad (Singular)\nAl-Mufrad in the knowledge of individuals (Afrad), and what is meant by it is the narrator being alone in narrating a Hadith from a Sheikh, and others did not narrate it from him. If the people of a city among cities are alone in narrating a Hadith, it is also called: among the Afrad. It is said, for example: The people of Mecca were alone with it, or the people of Medina, or the people of Kufa, and so on. The difference between Al-Fard and Al-Gharib: Al-Gharib is what has only one narrator, and Al-Fard bears the possibility of having more than one narrator; so every Gharib is Fard, but not every Fard is Gharib.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 42
  },
  {
    "serial_number": "3349094",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 40,
    "volume_number": 1,
    "text": "The Twenty-Second Type: Ziyadat al-Thiqa (Addition of the Trustworthy)\nMeaning: A number of trustworthy narrators narrated a Hadith, and one of them has an addition, either in the text or in the chain, not found with his companions. Is this addition accepted from him or not? The Muhaddithin differed on that. Some of them accepted it absolutely, some rejected it absolutely, and some mentioned details regarding it. The elaboration on this issue is in the books of Terminology.\n\nThe Twenty-Third Type: The Mu'allal (Defective) Hadith\nIt is the Hadith in which there is a hidden defect that only the experts and critics among the Muhaddithin can uncover. If the defect is uncovered, it is named after that by the name of the defect, either Mursal, or Munqati', or Mu'dal, and so on.\n\nThe Twenty-Fourth Type: Knowing whose narration is accepted and whose is not? And the statement of Jarh (Discrediting) and Ta'dil (Declaring trustworthy)\nIn this type there are many issues elaborated and detailed in the books of Terminology. We say here briefly: The one whose narration is accepted is: The trustworthy, precise narrator of what he narrates. If it is said: When is the narrator trustworthy and precise in what he narrates? We say in answer:",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 43
  },
  {
    "serial_number": "3349095",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 41,
    "volume_number": 1,
    "text": "If the following attributes gather or are found in him:\n1 - That he is a Muslim.\n2 - That he is sane.\n3 - That he is an adult.\n4 - That he is free from causes of wickedness (Fisq) and things that damage dignity (Muru'ah).\n5 - That he is alert, not heedless; memorizing if he narrates from memory, understanding if he narrates by meaning.\nIf one of these five conditions is missing or flawed, his narration is rejected and not accepted.\n\nThe Twenty-Fifth Type: On the manner of hearing Hadith and bearing it (Tahammul)\nMeaning: How does the narrator of Hadith take the Hadith from his Sheikh? Hadith scholars clarified eight ways to take Hadith and bear it from Sheikhs:\n1 - Hearing from the wording of the Sheikh.\n2 - Reading to the Sheikh.\n3 - Taking permission (Ijazah) from the Sheikh.\n4 - Munawala (Handing over): Meaning: The Sheikh giving the student a book of Hadith from what he heard; to narrate it from him.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 44
  },
  {
    "serial_number": "3349096",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 42,
    "volume_number": 1,
    "text": "5 - Mukataba (Correspondence): A Sheikh writes some of his Hadith to another person; to narrate from him.\n6 - I'lam al-Sheikh (Notification by the Sheikh): Meaning an Imam of Hadith informs a specific person with the news that such-and-such book is what he heard from such-and-such Sheikh. Groups of Muhaddithin and Jurists permitted narration merely by that. But if the Sheikh combines his notification with permission to narrate, this is called Ijazah, and narration by it is permissible according to the majority.\n7 - Wasiyyah (Bequest): Its form is that a person bequeaths a book he used to narrate to another person, to be given to him after his death. Some Muhaddithin permitted narration by this type of bearing by analogy to Munawala and I'lam. Imam Abu Amr ibn al-Salah, author of the Muqaddimah in Sciences of Hadith, considered that unlikely. This means that the majority of Muhaddithin do not permit narration by bequest.\n8 - Wijadah (Finding): Its form is that we find in a person's book in his handwriting, or in someone else's handwriting, a Hadith. Is it permissible for us to narrate it from him or not? The majority of scholars said: That is permissible on the condition that he says: \"I found in the book of so-and-so in his handwriting,\" as Abdullah son of Imam Ahmad used to do in his father's books. Likewise, it is permissible with the wording: \"So-and-so said,\" or \"So-and-so mentioned,\" but it is not permissible with wordings that imply the narrator heard from the book's owner. And Allah knows best.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 45
  },
  {
    "serial_number": "3349097",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 43,
    "volume_number": 1,
    "text": "The Twenty-Sixth Type: Writing Hadith and controlling it\nIn this type, scholars spoke about methods of writing Hadith and its manner, and controlling the wordings of Hadith and names of narrators, noting them in the margin.\n\nThe Twenty-Seventh Type: Description of narrating Hadith\nIts meaning is: If the narrator took and bore the Hadith from his Sheikh, how does he narrate it afterwards? At what age does he narrate it? What are the wordings of narration? Is he allowed to shorten the Hadith? Is he allowed to narrate by meaning? We find the details of these issues in this type in the books of Terminology.\n\nThe Twenty-Eight Type: On the Etiquette of the Muhaddith\nSuch as having good character, good way, correct intention, not narrating in the presence of someone who is more worthy than him and higher in degree in Hadith. If he starts narrating, he convenes the narration assembly and opens his assembly with recitation from the Holy Qur'an.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 46
  },
  {
    "serial_number": "3349098",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 44,
    "volume_number": 1,
    "text": "The Twenty-Ninth Type: On the Etiquette of the Student of Hadith\nIncluding sincerity in intention. He must first hasten to hear the high chain (Sanad 'Ali) in his town, then travel to other lands. He should act upon virtuous deeds, and not prolong the listening session for the Sheikh to the point of boring him. He should not disdain writing from someone who is below him in narration and understanding, and other required etiquettes for the student of Hadith.\n\nThe Thirtieth Type: Knowing the High ('Ali) and Low (Nazil) Chain\nIf the men (narrators) of the Hadith chain are few, it is called High ('Ali), and if they are many, it is called Low (Nazil). The High Chain is desired; due to its freedom from defects, and rarely is a Low Chain free from defect. However, if the men of the Low Hadith are trustworthy and strong, and the men of the High Chain are below them, then the Low is better, preferred, and more desired. And Allah knows best.\n\nThe Thirty-First Type: Knowing the Famous (Mashhur) Hadith\nFame in Hadith is a relative matter. A Hadith may be famous in a region or town, and not famous in another. It may be famous among Jurists and not famous among Muhaddithin, or vice versa. The text of the Hadith might be famous on peoples' tongues while its chain is strange (Gharib), or it has no origin or chain. A Hadith may be famous considering its chain, meaning:",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 47
  },
  {
    "serial_number": "3349099",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 45,
    "volume_number": 1,
    "text": "the number of its narrators in every layer of the chain exceeds three. This type of Mashhur is also called Mustafid. This is what is called Terminological Mashhur among Muhaddithin. The Mashhur Hadith considering its chain is of two types:\nIf the number of its narrators in every layer of narration reaches the limit of Tawatur (mass transmission), meaning: their number increases to a limit where reason deems it impossible for them to collude - i.e., agree - on a lie, then this Hadith is Mutawatir. This is the first type.\nIf it does not reach the limit of Tawatur, meaning: its narrators exceeded three, but did not reach the limit of Tawatur, then the Hadith is called Mashhur in the terminology of Muhaddithin.\n\nThe Thirty-Second Type: Knowing the Gharib and the Aziz\nThe Gharib of Hadith: What has one narrator, and its definition preceded in the poem at number (14). As for the Aziz of Hadith, it is what was narrated by two or three after the Companion. If its narrators exceed three, it is called Mashhur as previously mentioned.\n\nThe Thirty-Third Type: Knowing the strange words (Gharib Alfaz) of Hadith\nThis type talks about the strange words in the text, i.e., words whose meanings are not easily understood. They need checking books authored in this type. The most famous book in this is: \"Al-Nihayah fi Gharib Al-Hadith\" by Imam Majd al-Din Abu al-Sa'adat: Al-Mubarak ibn Muhammad, known as Ibn al-Athir al-Jazari (606 AH).",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 48
  },
  {
    "serial_number": "3349100",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 46,
    "volume_number": 1,
    "text": "The Thirty-Fourth Type: Knowing the Musalsal (Patterned)\nA Hadith is called Musalsal if a characteristic or an action follows in succession and sequence among the narrators of its chain; like if every narrator among its narrators says upon narrating \"I heard him\", or says: \"He told us\", or says \"He informed us\", or every narrator says \"So-and-so told me while he was eating\" - for example - or going to Eid prayer. If there are four narrators in the chain of the Hadith, for example, and each one of them says upon narrating \"So-and-so told me while he was going to Eid prayer\", the Hadith is called: Musalsal of Eid. The benefit of Tasalsul (Sequencing) is ensuring the chain is free from disconnection and Irsal.\n\nThe Thirty-Fifth Type: Knowing the Abrogating (Nasikh) and Abrogated (Mansukh) of Hadith\nJust as we find in the Holy Qur'an abrogated and abrogating verses, likewise in Ahadith there is abrogating and abrogated. This type discusses [that].\n\nThe Thirty-Sixth Type: Knowing the control of Hadith wordings in text and chain, and guarding against Tashif (Misreading/Misspelling) in them\nIn this type, the student of Hadith is alerted not to fall into errors and mistakes; so he misspells or distorts words in the text or names in the chain, as happened to some Muhaddithin in the Hadith: \"O Abu Umair, what did the Nughayr (small bird) do?\" He misspelled it and said:",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 49
  },
  {
    "serial_number": "3349101",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 47,
    "volume_number": 1,
    "text": "\"O Abu Umair, what did the Ba'ir (Camel) do?\" Likewise, they distorted the Hadith \"Salah fi ithr salah kitab fi 'illiyyin\" (Prayer following prayer is a record in Illiyyin), they distorted it to: \"Kinar fi ghalas\" (Like fire in darkness). So the student of Hadith must be vigilant and alert, and when he hears or writes the Hadith from a Sheikh, he should control and restrict its words with dots, shapes, and vowels.\n\nThe Thirty-Seventh Type: Knowing the Mukhtalif al-Hadith (Divergent Hadith)\nThis type talks about books authored on Ahadith whose apparent meaning implies contradiction between them. The authors of these books undertook interpretation and direction by removing the contradiction and reconciling between the Ahadith. Famous books in this type are: \"Mukhtalif al-Hadith\" by Imam Al-Shafi'i, \"Ta'wil Mukhtalif al-Hadith\" by Ibn Qutaybah, and \"Mushkil al-Athar\" by Imam Abu Ja'far Ahmad bin Muhammad ibn Salamah Al-Tahawi Al-Hanafi (d. 321 AH).\n\nThe Thirty-Eighth Type: Knowing Al-Mazid fi Muttasil al-Asanid (Addition in Connected Chains)\nIt is when a narrator adds a man in the chain whom others did not mention. For example: A number of narrators narrated a Hadith from Abdullah bin Al-Mubarak, from Abdullah bin Yazid bin Jabir, he said: Busr bin Ubaidullah told me. Then another narrator came and said: From Abdullah bin Al-Mubarak, from Sufyan, from Abdullah bin Yazid - meaning: he added between Ibn Al-Mubarak and Ibn Yazid...",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 50
  },
  {
    "serial_number": "3349102",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 48,
    "volume_number": 1,
    "text": "...another narrator, who is Sufyan - this type of addition is called: Al-Mazid fi Muttasil al-Asanid (The addition in connected chains). If the narrator who added is trustworthy, his addition is accepted, otherwise no.\n\nThe Thirty-Ninth Type: Knowing the Hidden of Mursals (Al-Khafi min al-Marasil)\nMeaning: If there is in the chain of Hadith a defect of Inqita' (disconnection), or I'dal (perplexity), or Irsal (omission), but it is hidden, not understood from the apparent chain, understood only by experts and critics among Muhaddithin, this type of chain is called: The Hidden of Mursals.\n\nThe Fortieth Type: Knowing the Companions (Sahaba)\nThis type talks about the definition of the Companion - who is the one who saw the Prophet (peace be upon him) and believed in him, and died on Islam - and about the number of Companions, their degrees in preference, and the prolific narrators among them.\n\nThe Forty-First Type: On knowing the Successors (Tabi'in)\nThe Tabi'i is the one who saw the Companion and accompanied him, and narrated from him a Hadith or two.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 51
  },
  {
    "serial_number": "3349103",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 49,
    "volume_number": 1,
    "text": "The Forty-Second Type: On knowing the narration of Seniors (Akabir) from Juniors (Asaghir)\nA person great in status or age or both may narrate from someone who is below him in all or some of these aspects. The most famous example of this type: The narration of the Messenger (peace be upon him) from Tamim Al-Dari, that he told him about seeing the Dajjal in that island in the sea. The Hadith is in Sahih Muslim under number (2942).\n\nThe Forty-Third Type: Knowing the Mudabbaj\nMeaning: The narration of peers (Aqran), equal in age and contemporaries, from each other.\n\nThe Forty-Fourth Type: Knowing Brothers and Sisters\nMeaning: Knowing that so-and-so, narrator of Ahadith, has brothers and sisters; and they are also narrators of Ahadith. There are many examples of that, like: Al-Nu'man bin Muqarrin the Companion, and his five brothers are all Companions and narrators of Ahadith. And from the Tabi'in: Muhammad bin Sirin and his five brothers.\n\nThe Forty-Fifth Type: Knowing the narration of Fathers from Sons\nThis is frequent, its example: The narration of Abu Dawood Al-Sijistani, author of the Sunan, from his son Abu Bakr - Abdullah bin Abu Dawood.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 52
  },
  {
    "serial_number": "3349104",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 50,
    "volume_number": 1,
    "text": "The Forty-Sixth Type: On the narration of Sons from Fathers\nThis is also frequent, like Amr bin Shu'aib from his father from his grandfather; Bahz bin Hakim, from his father from his grandfather: Mu'awiyah, and so on.\n\nThe Forty-Seventh Type: On knowing the narration of the Former (Sabiq) and the Latter (Lahiq)\nMeaning: The sharing of two narrators in narration from one Sheikh. One of them is older than the Sheikh and died years before the Sheikh's death, and the second is younger than the Sheikh and died years after the Sheikh's death. The first is called the Former (Sabiq), and the second the Latter (Lahiq). For example: Imam Al-Bukhari, and Abu Al-Hasan Ahmad bin Muhammad Al-Khaffaf Al-Naysaburi, both narrated from: Muhammad bin Ishaq Al-Sarraj. But Imam Al-Bukhari, may Allah have mercy on him, died formerly in the year (256 AH), and Al-Khaffaf died subsequently in the year (395 AH) three hundred and ninety-five. So between their deaths is one hundred and thirty-nine (139) [years].\n\nThe Forty-Eighth Type: Knowing who had no narrator except one\nFrom a Companion, Tabi'i, and others. An example among Companions: Urwah bin Mudarris, a Companion from whom only Amir bin Sharahil Al-Sha'bi narrated. An example among Tabi'in: Abu Al-Ashra' Al-Darimi from his father, no one narrated from him except Hammad bin Salamah.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 53
  },
  {
    "serial_number": "3349105",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 51,
    "volume_number": 1,
    "text": "The Forty-Ninth Type: Knowing the Narrator who has multiple names\nLike Muhammad bin Sa'ib Al-Kalbi, for he was famous by more than four names.\n\nThe Fiftieth Type: Knowing the Unique Names (Mufradah) and Kunyas\nWhich there is no other in every letter. For example, in the letter Alif with the name (Awsat) there is only one narrator, who is Awsat bin Amr Al-Bajali, a Tabi'i. And in the letter Ta with the name (Tadum) there is only one, who is: Tadum bin Subh Al-Kala'i. And in the letter Jim with the name (Jaylan) one, who is: Jaylan bin Abi Farwa, a Tabi'i, and so on. Muhaddithin have collected biographies of such narrators and researched their conditions.\n\nThe Fifty-First Type: Knowing Names and Kunyas\nMeaning: Knowing the names of narrators and their Kunyas (nicknames). Some of them do not have a Kunya, some are known by the Kunya and have no name at all, some are famous by their name and Kunya, some have a name and Kunya but are famous by name, not Kunya, and some are the opposite, and so on.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 54
  },
  {
    "serial_number": "3349106",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 52,
    "volume_number": 1,
    "text": "The Fifty-Second Type: On knowing the Titles (Alqab) of Muhaddithin\nNarrators became famous with various titles, like Ghundar, Ghunjar, Sa'iqa (Thunderbolt), Shabab, Bundar, Sunayd, Rustah, and so on. It is necessary to know them and know their owners, and know the meanings of these titles; so that the title of one narrator is not confused with another narrator, and consequently the narrator is distinguished perfectly.\n\nThe Fifty-Third Type: Knowing the Harmonious (Mu'talif) and Divergent (Mukhtalif) in Names and Kunyas\nThis relates to controlling the names of narrators and their Kunyas and pronouncing them correctly. The meaning of Mu'talif and Mukhtalif: What agrees in written form (script), and differs in spoken form. Like: Salam and Sallam - the first with light Lam and the second with stressed Lam. And 'Umarah and 'Imarah - the first with Damma on the unpointed 'Ain, and the second with Kasra. And like: Hizam and Haram - the first with Kasra on the unpointed Ha followed by Zai, and the second with Fatha on the unpointed [Ha] followed by Ra. Thus, if the name is composed of letters agreeing in drawing and pronunciation but differing in vowels, or composed of letters agreeing in drawing but differing in pronunciation, this is called Mu'talif and Mukhtalif, meaning: its composition is one and agreed upon, but its vowels and pronunciation are different.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 55
  },
  {
    "serial_number": "3349107",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 53,
    "volume_number": 1,
    "text": "The Fifty-Fourth Type: Knowing the Agreed (Muttafiq) and Separated (Muftariq) of Names and Lineages\nIts meaning: A number of narrators whose names and their fathers' names agree, but the named persons are separate (different). For example: Al-Khalil bin Ahmad, six persons became famous among narrators with this name, and undoubtedly they are separate. So if we gather the names of this type of narrators, we call them: The Agreed in Names and Separated in Named Persons. Al-Khatib Al-Baghdadi has a valuable book on this type.\n\nThe Fifty-Fifth Type: A type composed of Mu'talif and Mukhtalif, and Muttafiq and Muftariq\nIn the terminology of Muhaddithin it is called Al-Mutashabih (Similar). Meaning: If the name of the narrators agrees with the name of another narrator, and his father's name is harmonious (Mu'talif) with the other's father's name, this type is called Al-Mutashabih. For example: Musa bin 'Ali, and Musa bin 'Uli. The name Musa and Musa are agreed (Muttafiq), but the father's name is harmonious (Mu'talif); because the first is with Fatha on the unpointed 'Ain, and the second with Damma. Likewise if it is the opposite; meaning Hizam bin Ahmad, and Haram bin Ahmad, so they are agreed and separated in the father's name, and harmonious and different in their names.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 56
  },
  {
    "serial_number": "3349108",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 54,
    "volume_number": 1,
    "text": "The Fifty-Sixth Type: On the Similar (Mutashabihin) in Name and Father's Name, or Lineage with separation in Timing (Muqaranah)\nThis one is earlier and this one is later. Its example: Yazid bin Al-Aswad, three narrators; and Al-Aswad bin Yazid, name of four narrators for example. This is called Mutashabih by advancement and delay.\n\nThe Fifty-Seventh Type: On knowing narrators attributed to other than their fathers\nLike Mu'adh and Mu'awwidh the two sons of 'Afra', both are Companions, and 'Afra' is their mother. And Bilal bin Hamamah the Mu'adhin, his father's name is: Rabah. And like Muhammad bin Al-Hanafiyyah, who is Muhammad bin Ali bin Abi Talib. Al-Hanafiyyah is the title of his mother, her name is: Khawlah. And like Ya'la bin Munyah, and Munyah is the name of his grandmother from his father. And like Ibn Taymiyyah, who is Ahmad bin Abdul Halim bin Abdul Salam. And Taymiyyah is the name of the mother of one of his distant grandfathers. Imam Ahmad bin Hanbal is attributed to his grandfather, who is Ahmad bin Muhammad bin Hanbal. Abu Bakr bin Shaybah is attributed to his grandfather, who is Abdullah bin Muhammad bin Abi Shaybah, and so on.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 57
  },
  {
    "serial_number": "3349109",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 55,
    "volume_number": 1,
    "text": "The Fifty-Eighth Type: On Lineages (Nisab) that are contrary to their appearance\nAs it is said of Uqbah bin Amr: Badri (of Badr), not because he witnessed the Battle of Badr, but because he lived in Badr, so he was attributed to it. Khalid Al-Hadhdha' (The Cobbler), was called Al-Hadhdha' because he used to sit with cobblers, not because he was one of them. Yazid Al-Faqir (The Poor), was called Faqir because he had pain in the vertebrae (Faqar) of his back, and he was not poor in wealth.\n\nThe Fifty-Ninth Type: On knowing the Ambiguous (Mubhamat) of names of Men and Women\nWhether in the chain, like the narrator saying \"From a man from Abu Huraira, may Allah be pleased with him, said...\" Or in the text, like: \"A man came to the Prophet (peace be upon him)\", or \"A woman asked the Prophet (peace be upon him)\". The Muhaddithin, by researching the paths of the Hadith and different narrations, were able to remove much of the ambiguity, whether in the text or the chain. Al-Khatib Al-Baghdadi has a valuable and famous book on this type.\n\nThe Sixtieth Type: Knowing the Deaths of Narrators, their Births, and the extent of their Ages\nThe Muhaddithin paid utmost attention to knowing the deaths of narrators and the extent of their ages; because by that they know if the narrator actually met his Sheikh from whom he narrated or not,",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 58
  },
  {
    "serial_number": "3349110",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 56,
    "volume_number": 1,
    "text": "For example - if the narrator says: From so-and-so, or so-and-so told me. If we know the date of his Sheikh's death, and the date of the narrator's birth; we can say: Whether he actually heard from him or did not hear.\n\nThe Sixty-First Type: Knowing the Trustworthy (Thiqat) and Weak (Du'afa) among Narrators and others\nThis art is among the most important sciences, the highest, and most beneficial, for by it the authenticity of the Hadith is known from its weakness. The Muhaddithin have authored on this in the past and present. Among the most famous of that is the book \"Al-Jarh wa Al-Ta'dil\" by Ibn Abi Hatim, the book \"Al-Thiqat\" by Ibn Hibban, and the book \"Tarikh Baghdad\" by Al-Khatib Al-Baghdadi.\n\nThe Sixty-Second Type: On knowing who became Confused (Ikhtalat) at the end of his life\nFrom the care of Muhaddithin in the matter of narrators is that they strove every effort; to identify narrators whose memorizations became confused either due to fear, or harm that befell them, or illness, or an accident like Abdullah bin Lahi'ah, when his books went, meaning: were lost or missing, he became confused in his mind. So whoever heard from these before their confusion, their narration is accepted, and whoever heard after that or doubt exists in that, it is not accepted.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 59
  },
  {
    "serial_number": "3349111",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 57,
    "volume_number": 1,
    "text": "The Sixty-Third Type: On knowing the Layers (Tabaqat)\nMeaning layers of narrators among Companions and others. For example: The Companions, may Allah be pleased with them, among them are the first forerunners from the people of Badr, and among them are the people of the Pledge of Ridwan, and among them are the Muhajirun (Emigrants), and among them are the Ansar (Helpers), and among them are the Nuqaba (Leaders), and among them are the Jurists, and among them are those skilled in Jihad and expeditions, and among them are those skilled in knowing lineages. And similarly the layers among the Tabi'in and those after them.\n\nThe Sixty-Fourth Type: On knowing the Mawali (Freed Slaves/Clients) among Narrators and Scholars\nA group of the masters of scholars in the time of the Salaf were from the Mawali, meaning: slaves, then they were freed, and became high masters among people.\n\nThe Sixty-Fifth Type: Knowing the Homelands of Narrators and their Towns\nThe Muhaddithin did not leave any aspect of the life of Hadith narrators except that they investigated it and identified it, even to the point that they tried every attempt to know the homelands of narrators and their towns. Consequently, the Hadith arrives through these narrators with a pure chain, free from all types of defects, otherwise they judged it with the appropriate ruling.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 60
  },
  {
    "serial_number": "3349112",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 58,
    "volume_number": 1,
    "text": "O Noble Reader: What I wanted of the summarized explanation of the types of Hadith sciences, which the poet - may Allah's mercy be upon him - did not address much in his poem, has ended. As I said previously: Perhaps he left them due to their lack of importance for the beginner student. But I mentioned their summary to complete the benefit, asking Allah - the Glorious and Exalted - for reward and recompense for what I intended. I ask Allah the Almighty, the Capable, to benefit via the poem and its explanation firstly, and via its completion secondly, all students of knowledge and its people. Indeed He is Hearing, Near, Answerer of prayers.\nHere I am beginning the explanation of the final verses of the poem, so with the help of Allah I say:",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 61
  },
  {
    "serial_number": "3349113",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 59,
    "volume_number": 1,
    "text": "Conclusion of the Poet (Al-Nazim), may Allah have mercy on him\n(19) And the composer of the categories for clarification ... Is the poor one, the worshiper of the Most Merciful (Abid Al-Rahman).\n(20) The son of Abu Bakr, the famous one of noble lineage ... Who ascended by his knowledge to the highest ranks.\n(21) Upon him be the mercy of the Creator God ... The One of vast mercy for the creatures.\n(22) Then the blessings of Allah and peace ... Upon the one whom the clouds shaded.\n(23) Muhammad and his pure family ... And his companions, the rising points of lights.\n(24) As long as the rain descends from the clouds ... And as long as the full moon appears from the darkness.\n\nThe Poet, may Allah have mercy on him, in the nineteenth and twentieth verse of the poem, mentioned his name and noble lineage. He mentioned that he is the poor one unto Allah: Abdul Rahman bin Abu Bakr Al-Mulla. He praised his late father by saying: Who is of famous lineage, and who ascended and reached by his knowledge the highest ranks. Then he prayed for him saying: Upon him be the mercy of the Creator God of this universe, Allah whose mercy is vast for all creatures; that is in the twenty-first verse. In the last three verses, the Poet, may Allah have mercy on him, poured out blessings and peace upon our master, our patron, and our beloved Muhammad bin Abdullah, the Chosen One, whom the clouds used to shade; to protect him from the heat of the sun, and this was a miracle for the Master of the Righteous. He also sent blessings upon his pure family, and his companions who were and still are the place of the rising of lights, and their source, as long as descends...",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 62
  },
  {
    "serial_number": "3349114",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Zabad fi Mustalah al-Hadith",
    "edition": "First Edition, 1428 AH - 2007 CE",
    "publisher": "Dar Ammar for Publishing and Distribution - Amman - Jordan",
    "page_number": 60,
    "volume_number": 1,
    "text": "...rain from the clouds, and the full moon appears from the darkness. Meaning upon them be blessings and peace as long as the universe exists and the world remains.\nThis is the last of what my soul allowed me to explain of this blessed, valuable, beneficial poem, in clarifying the types of Hadith and its sciences. I ask Allah to make this work of mine purely for His Noble Face, beneficial and useful to students of knowledge, and to grant me and my parents goodness and reward. Our last prayer is that praise be to Allah, Lord of the Worlds, and may Allah bless our master Muhammad, the Messenger of Allah, and all his family and companions. Amen.\nThe completion of its draft was on Monday, the night of Tuesday, at a quarter to twelve, on the date: The second of the month of Dhu al-Qi'dah for the year four hundred and twenty-five after the thousand of the blessed Prophetic Migration (1425 AH), upon its owner be the best blessings and perfect peace.\nWritten by Dr. Fadl Al-Rahman Abdul Alim Safi.\nTeacher at Al-Sawlatiyyah School.\nIn Makkah Al-Mukarramah 8/11/1425 AH.",
    "foot_note": "None",
    "book_id": "797",
    "new_page_number": 63
  }
]