[
  {
    "text": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'\nAuthor: محمد يوسف حافظ أبو طلحة\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "category_id": "10",
    "category": "Hadith Sciences",
    "new_page_number": 1
  },
  {
    "text": "sn: 3696\nbook_title: الحافظ زين الدين العراقي، وكتابه «تكملة شرح الترمذي»\nbook_link: https://shamela.ws/book/686\nbook_id: 686\nauthor_name: محمد يوسف حافظ أبو طلحة\nauthor_year: Null\nnickname: أبو طلحة\nauthor_link: https://shamela.ws/author/3145\nauthor_ID: 3145\neditor: Null\npublisher: مجلة الهند, المجلد: العاشر، العدد: الأول، يناير - مارس ٢٠٢١ م\nedition: Null\npages: 56\nvolumes: Null\npagination: [الترقيم موافق للمجلة]\ncategory: علوم الحديث\ncategory_id: 10",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "category_id": "10",
    "category": "Hadith Sciences",
    "new_page_number": 2
  },
  {
    "serial_number": "3345878",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Sciences of Hadith\nBook: Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'\nAuthor: Muhammad Yusuf Hafiz Abu Talha\nResearch published in: Majallat al-Hind (Indian Journal), (A refereed quarterly journal, started publication in 2012, Editor-in-Chief Dr. Aurangzeb al-Azami).\nNumber of pages: 56 [Numbering corresponds to the journal]\nDate of publication in Shamela: 29 Rabi' al-Awwal 1443\n\nBook: Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'\nAuthor: Muhammad Yusuf Hafiz Abu Talha\nResearch published in: Majallat al-Hind, (A refereed quarterly journal, started publication in 2012, Editor-in-Chief Dr. Aurangzeb al-Azami).\nNumber of pages: 56 [Numbering corresponds to the journal]\nDate of publication in Shamela: 29 Rabi' al-Awwal 1443\n\nAuthor: Muhammad Yusuf Hafiz Abu Talha\nResearch published in: Majallat al-Hind, (A refereed quarterly journal, started publication in 2012, Editor-in-Chief Dr. Aurangzeb al-Azami).\nNumber of pages: 56 [Numbering corresponds to the journal]\nDate of publication in Shamela: 29 Rabi' al-Awwal 1443\n\nResearch published in: Majallat al-Hind, (A refereed quarterly journal, started publication in 2012, Editor-in-Chief Dr. Aurangzeb al-Azami).\nNumber of pages: 56 [Numbering corresponds to the journal]\nDate of publication in Shamela: 29 Rabi' al-Awwal 1443\n\nNumber of pages: 56 [Numbering corresponds to the journal]\nDate of publication in Shamela: 29 Rabi' al-Awwal 1443\n\nNumber of pages: 56 [Numbering corresponds to the journal]\nDate of publication in Shamela: 29 Rabi' al-Awwal 1443\n\n[Numbering corresponds to the journal]\nDate of publication in Shamela: 29 Rabi' al-Awwal 1443\n\nDate of publication in Shamela: 29 Rabi' al-Awwal 1443",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 3
  },
  {
    "serial_number": "3345879",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 98,
    "volume_number": 1,
    "text": "Al-Hafiz Zain al-Din al-Iraqi, and his book: \"Takmilat Sharh al-Tirmidhi\" (Completion of the Explanation of al-Tirmidhi). Dr. Muhammad Yusuf Hafiz Abu Talha (1)\n\nAbstract\nThis research includes an introduction, two sections, and a conclusion.\nAs for the introduction, it contains the statement of reasons for choosing the topic, and the research plan.\nAs for the first section, it contains the biography of Al-Hafiz Abu al-Fadl Zain al-Din Abd al-Rahim ibn al-Husayn al-Iraqi (725 - 806 AH), through which it becomes clear that he was among the major Hadith scholars in the eighth Hijri century, and he raised a blessed generation of Hadith scholars, at the head of whom were Al-Hafiz Ibn Hajar, Abu Zur'ah al-Iraqi, and Nur al-Din al-Haythami. He has valuable works in Hadith and other sciences that testify to his skill and advancement, among the most important of which is Takmilat Sharh al-Tirmidhi.\nAs for the second section, it contains the introduction to his valuable book: \"Takmilat Sharh al-Tirmidhi\". He started his explanation from where Ibn Sayyid al-Nas stopped in: \"Al-Nafh al-Shadhi\". So he began his explanation from \"The Chapter on What Came regarding the Entire Earth Being a Mosque Except the Graveyard and the Bathhouse\", and he reached in his explanation to \"The Chapter on the Compassion of a Muslim for a Muslim\" from the Chapters of Righteousness and Relations (Al-Birr wa al-Silah). Half of the book remained which he did not cover with explanation, and death overtook him before its completion. It is one of the best explanations on Jami' al-Tirmidhi, distinguished by features, the most important of which are: The explainer's concern with the Takkhrij (extraction/referencing) of the chapter's hadith, editing al-Tirmidhi's ruling on it, and discussing him if a contrary view appeared to him, his attention to the Takhrij of what al-Tirmidhi said about: \"And in the chapter are hadiths [from so-and-so]\", his catching up on what al-Tirmidhi missed of hadiths related to the chapter, his clarification of the jurisprudential issues deduced from the hadiths of Jami' al-Tirmidhi, and his statement of the schools of scholars regarding",
    "foot_note": "1. Dean of the Faculty of Arabic Language and Islamic Studies at Muhammadiyah University, Mansura, Malegaon, India. Email: mdyusuftalha@gmail.com.",
    "book_id": "686",
    "new_page_number": 4
  },
  {
    "serial_number": "3345880",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 99,
    "volume_number": 1,
    "text": "the issue, and his critiques of those who preceded him among the people of knowledge with great politeness and complete humility. Because of these features and others, major scholars praised this explanation of his, and most of the major explainers who came after him scooped from its seas.\nAs for the conclusion, it contains the most important results and recommendations.\nKeywords: The Noble Hadith, Explanations of Hadith, Explanations of Jami' al-Tirmidhi, Al-Hafiz al-Iraqi, Takmilat Sharh al-Tirmidhi.\n\nIntroduction\nPraise be to Allah alone, and prayers and peace be upon him after whom there is no prophet. As for what follows:\nThe Prophetic Sunnah is among the most honorable and majestic of sciences, for it is the explainer of the Book of Allah, its interpreter, the clarifier of what is summarised of its verses, and the restricter of many of its generalities. Hence, the scholars of Islam have cared for it since the first era, diversified in its classification, and excelled in its compilation in many ways and numerous forms out of keenness to preserve it.\nAmong these was: Imam Al-Hafiz Abu Isa al-Tirmidhi, who died in the year 279 AH. He authored various books on the Sunnah, the greatest in benefit and highest in rank being the book Al-Jami' (Jami' al-Tirmidhi), whose fame flew in the East and the West, which made scholars compete in explaining it, clarifying it, and documenting biographies of its men.\nAmong those who explained it was Judge Abu Bakr Ibn al-Arabi, who died in the year 543 AH, in his book (Aridat al-Ahwadhi), then Al-Hafiz Abu al-Fath Muhammad ibn Muhammad ibn Muhammad Ibn Sayyid al-Nas al-Ya'muri, who died in the year 734 AH, in his book (Al-Nafh al-Shadhi), but he did not complete it. So Al-Hafiz Zain al-Din al-Iraqi (d. 806 AH) came and started the explanation from where Ibn Sayyid al-Nas stopped.\nSince Al-Iraqi's explanation - despite its importance and abundance of benefits - is still a manuscript that has not yet been printed, I desired",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 5
  },
  {
    "serial_number": "3345881",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 100,
    "volume_number": 1,
    "text": "to introduce it in detail with a brief biography of its author; for I lived with the manuscript of this book for more than three years. So to Allah belongs praise and favor.\n\nReasons for choosing the topic:\n1 - The scientific status of the explainer, for he is one of the major Hadith scholars in the eighth Hijri century, and under his care major Hadith scholars were raised, including Al-Hafiz Ibn Hajar, Al-Hafiz Al-Haythami, Al-Hafiz Al-Busiri, and Allamah Al-Ayni. And most of the Hadith scholars who came after him scooped from his spring.\n2 - The importance of the explained book, for it is an explanation of Jami' al-Tirmidhi, which is one of the six books on which Islam revolves.\n3 - The scientific value of the explanation, for it is an explanation full of benefits and investigations, and is distinguished by features, the most important of which are:\n(a) The explainer's concern with the Takhrij of the chapter's hadith, editing al-Tirmidhi's ruling on it, and discussing him if a contrary view appeared to him.\n(b) His care for the Takhrij of what al-Tirmidhi said about: \"And in the chapter are hadiths [from so-and-so]\".\n(c) Catching up on the hadiths related to the chapter that al-Tirmidhi missed.\n(d) His interpretation of the strange vocabulary of the hadith from the mother lexicons and original books of Gharib (strange/uncommon words).\n(e) His clarification of the jurisprudential issues deduced from the hadiths of Jami' al-Tirmidhi, and his statement of the schools of scholars regarding the issue.\n(f) His critiques of those who preceded him among the explainers of the book like Ibn al-Arabi and Ibn Sayyid al-Nas, and those who preceded him among the biographers of the book's narrators like Al-Mizzi, and those who preceded him in ruling on the hadith like Al-Hakim.\n(g) Its being an important reference in documenting al-Tirmidhi's ruling on the hadith.\nBecause of these features and others, Al-Shawkani praised this precious explanation in the biography of Ibn",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 6
  },
  {
    "serial_number": "3345882",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 101,
    "volume_number": 1,
    "text": "Sayyid al-Nas, saying: \"And when I stood upon the part of the explanation of Al-Tirmidhi ... by Zain al-Iraqi, that dazzled me, and I saw it degrees above what the owner of the biography [Ibn Sayyid al-Nas] explained.\" End quote. (1)\n\nResearch Plan:\nI divided the research into an introduction, two sections, and a conclusion.\nIntroduction: In it, I clarified the reason for choosing the topic, and the research plan.\nThe first section: Biography of the explainer Al-Iraqi, may Allah have mercy on him, and it contains eight demands:\nFirst Demand: His name and lineage\nSecond Demand: His birth\nThird Demand: His scientific upbringing\nFourth Demand: Scholars' praise of him\nFifth Demand: His sheikhs\nSixth Demand: His students\nSeventh Demand: His works\nEighth Demand: His death\nThe second section: Study of the book \"Takmilat Sharh al-Tirmidhi\", and it contains six demands:\nFirst Demand: Verification of the book's name\nSecond Demand: Documentation of the book's attribution to its author\nThird Demand: The subject of the book\nFourth Demand: On the explanations of Al-Tirmidhi, and the position of Takmilat Sharh al-Tirmidhi by Al-Iraqi among them.",
    "foot_note": "1. Al-Badr al-Tali' (p. 767).",
    "book_id": "686",
    "new_page_number": 7
  },
  {
    "serial_number": "3345883",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 102,
    "volume_number": 1,
    "text": "Fifth Demand: The author's methodology in his explanation\nSixth Demand: Some of the author's resources in his explanation.\nSeventh Demand: Description of the manuscript copies available in the libraries of the world as much as was possible to locate.\nConclusion: In it I mentioned the most important results and recommendations.\nI ask Allah to grant me sincerity in word and deed, and to show me the truth as truth and grant me the following of it, and show me falsehood as falsehood and grant me the avoidance of it.\n\nThe First Section: Biography of Al-Hafiz Al-Iraqi, may Allah have mercy on him - (1)\n\nFirst Demand: His Name and Lineage\nHe is the great Imam, the memorize (Hafiz), the skilled Hadith scholar, Abu al-Fadl",
    "foot_note": "1. Among the sources for his biography: Tarikh Ibn Hijji (2/620-621), Dhayl al-Taqyid by Al-Fasi (3/9-13), Ghayat al-Nihayah by Ibn al-Jazari (1/382), Tarikh Ibn Qadi Shuhbah (4/379-382), Tabaqat al-Shafi'iyyah by him (4/29-33), Inba' al-Ghumr bi-Abna' al-'Umr by Ibn Hajar (2/275-279), Al-Majma' al-Mu'assis by him (2/176-230), Dhayl al-Durar al-Kaminah by him (p. 143-145), Lahz al-Alhaz by Ibn Fahd (p. 220-239), Al-Manhal al-Safi by Ibn Taghribirdi (7/245-250), Al-Dalil al-Shafi 'ala al-Manhal al-Safi by him (1/409), Al-Nujum al-Zahirah fi Muluk Misr wa al-Qahirah by him (12/284), Al-Daw' al-Lami' by Al-Sakhawi (4/171-178), Husn al-Muhadarah by Al-Suyuti (1/360-362), Tabaqat al-Huffaz by him (p. 543-544), Dhayl Tadhkirat al-Huffaz by him (p. 370-372), Durrat al-Hijal by Ibn al-Qadi (3/113), Shadharat al-Dhahab by Ibn al-Imad (9/87-88), Al-Badr al-Tali' by Al-Shawkani (p. 361-363), Al-Risalah al-Mustatrafah by Al-Kattani (p. 161), Fahras al-Faharis by him (2/814-818), and Hadiyat al-Arifin by Al-Baghdadi (1/562). And his son Abu Zur'ah authored a separate book on his father's biography titled: Tuhfat al-Warid bi-Tarjamat al-Walid. (See: Lahz al-Alhaz p. 287). And among contemporary references: Al-A'lam by Al-Zirikli (3/344), Mu'jam al-Mu'allifin by Umar Rida Kahhalah (2/130), Introduction to the verification of the book Dhayl Mizan al-I'tidal by Dr. Abd al-Qayyum Abd Rabb al-Nabi (p. 15-30), Introduction to the verification of the book Al-Taqyid wa al-Idah by Dr. Osama al-Khayyat (1/45-92), Introduction to the verification of the book Fath al-Mughith by Dr. Abd al-Karim al-Khudair (1/15-66), The Methodology of Al-Hafiz Zain al-Din al-Iraqi in his book \"Tarh al-Tathrib\" Master's thesis at Imam Muhammad bin Saud Islamic University by student Muhammad Yahya Bilal Minyar, and Al-Hafiz al-Iraqi and his impact on the Sunnah in five volumes by Dr. Ahmad Ma'bad Abd al-Karim.",
    "book_id": "686",
    "new_page_number": 8
  },
  {
    "serial_number": "3345884",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 103,
    "volume_number": 1,
    "text": "Zain al-Din Abd al-Rahim ibn al-Husayn ibn Abd al-Rahman ibn Abi Bakr ibn Ibrahim (1) al-Raziani, Iraqi in origin, Kurdish (2), Mihrani (3), Egyptian, Shafi'i. (4)\nHis son Abu Zur'ah Ibn al-Iraqi (d. 826 AH) said: \"Al-Iraqi by attribution to Iraq of the Arabs, which is the broader region (5), otherwise he is Kurdish in origin. His ancestors resided in a town of the works of Irbil (6): called Razian. They have feats and virtues there, until his father moved to Egypt while he was young with some of his relatives.\" (7)\n\nSecond Demand: His Birth\nAl-Hafiz Al-Iraqi was born on the twenty-first of the month of Rajab in the year seven hundred and twenty-five in Mansha'at al-Mihrani (8) between Misr (Old Cairo) (9) and Cairo on the bank of the Nile. (10)\n\nThird Demand: His Scientific Upbringing\nAl-Hafiz Al-Iraqi was born into a house of knowledge and religiosity, (11) for his father was",
    "foot_note": "1. Up to here Al-Iraqi himself mentioned his lineage in his biography of his son Ahmad in Tarh al-Tathrib (1/16), and thus Ahmad listed his lineage in his signature in Tarh al-Tathrib, as the verifier of Tarh al-Tathrib quoted in the introduction of his verification (p. 9) from the original manuscript.\n2. With Damma on the Kaf and Sukun on the Ra, attributed to the Kurds, a well-known group inhabiting northern Iraq. (Al-Lubab fi Tahdhib al-Ansab 3/92).\n3. This attribution is to Mansha'at al-Mihrani, his birthplace, as will come.\n4. See: Tabaqat al-Qurra (1/382), Inba' al-Ghumr (2/275), Tabaqat Ibn Qadi Shuhbah (4/29), and Lahz al-Alhaz (p. 220).\n5. And not to Iraq in the specific sense which is the land of Babylon. (See Mu'jam al-Buldan 4/93-95).\n6. With Kasra then Sukun, and broken Ba Muwahhada, a large city located eighty kilometers southeast of Mosul in Iraq. (See Mu'jam al-Buldan (1/138, and Al-Hafiz Al-Iraqi and his impact on the Sunnah 1/139).\n7. Al-Sakhawi narrated it from him in Al-Daw' al-Lami' (4/171).\n8. This Mansha'ah (establishment/area) was attributed to Prince Sayf al-Din Balban al-Mihrani; because he was the first to build a house there and inhabit it, then people followed, until the water receded from the eastern side so it was ruined. (See: Al-Khitat by Al-Maqrizi 1/346).\n9. Misr is used for the city adjacent to Cairo (Fustat), and used for the broader region (Egypt), so Cairo enters then in its application. In the saying of Al-Iraqi's biographers: \"Between Misr and Cairo\", it is the first application. (See Mu'jam al-Buldan 5/137-143, and Al-Hafiz Al-Iraqi and his impact on the Sunnah 1/144-145).\n10. See: Al-Majma' al-Mu'assis (2/176), Lahz al-Alhaz (p. 221), Al-Dalil al-Shafi (1/409), and Al-Daw' al-Lami' (4/171).\n11. See about his family Al-Ujalah al-Saniyyah 'ala Alfiyat al-Sirah al-Nabawiyyah (p. 4), and Al-Daw' al-Lami' (4/171).",
    "book_id": "686",
    "new_page_number": 9
  },
  {
    "serial_number": "3345885",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 104,
    "volume_number": 1,
    "text": "a righteous, devout, virtuous man, raised on engagement with knowledge. He adhered to Sheikh Al-Sharif Taqi al-Din Muhammad ibn Ja'far ibn Muhammad ibn Abd al-Rahim al-Qina'i al-Shafi'i (1) as he used to work in his service, (2) and attended [lessons] with other scholars, and wrote with his hand much of Tafsir, Fiqh, and Raqa'iq (heart-softeners). (3) His mother also was righteous, devout, patient, content, diligent in types of acts of closeness to Allah. (4)\nHis father took care of his upbringing. Al-Sakhawi (d. 902 AH) said: \"His father repeatedly brought him to Al-Taqi, so he would treat him kindly and honor him.... And likewise he made him hear in the year thirty-seven from Prince Sanjar al-Jawli, and Judge Taqi al-Din al-Akhna'i al-Maliki, and others.\" (5)\nSo Al-Iraqi grew up in such a righteous environment. Allah bestowed upon him extreme intelligence and quick memory, so he memorized the Quran when he was eight years old, and memorized Al-Tanbih (6), and most of Al-Hawi Al-Saghir by Al-Qazwini (7), and likewise he memorized Al-Ilmam by Ibn Daqiq al-Eid, and perhaps he memorized from it in a single day four hundred lines, in addition to other memorizations. (8)\nHe studied Arabic, Fiqh and its principles (Usul), and other sciences, but his absorption was in the science of Qira'at (Recitations), and he used to strive in it greatly, until Judge Izz al-Din Ibn Jama'ah (d. 767 AH) advised him, saying to him: \"It is a science of much fatigue, little utility, and you possess a burning mind,",
    "foot_note": "1. He narrated hadith in Cairo, taught at Al-Masruriyyah, held the mashyakha of Khanqah Raslan, and died in the year 728 AH. (See Al-Durar al-Kaminah 3/415).\n2. See Lahz al-Alhaz (p. 220), and Al-Daw' al-Lami' (4/171).\n3. See Dhayl al-Wali al-Iraqi 'ala al-Ibar (Obituaries of year 763 AH) (1/86-87).\n4. Al-Sakhawi described her as such in Al-Daw' al-Lami' (4/171).\n5. Al-Daw' al-Lami' (4/171). Mention of Al-Jawli and Al-Akhna'i will come in the section of Sheikhs.\n6. Al-Tanbih fi Fiqh al-Shafi'iyyah by Abu Ishaq al-Shirazi, printed.\n7. Al-Hawi Al-Saghir fi al-Furu' by Sheikh Najm al-Din Abd al-Ghaffar ibn Abd al-Karim al-Qazwini (d. 665 AH). (See Kashf al-Zunun 1/625-627).\n8. See: Al-Majma' al-Mu'assis (2/177), Lahz al-Alhaz (p. 227), and Al-Daw' al-Lami' (4/171-172).",
    "book_id": "686",
    "new_page_number": 10
  },
  {
    "serial_number": "3345886",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 105,
    "volume_number": 1,
    "text": "so direct your ambition to Hadith.\" That was in the year seven hundred and forty-two. (1) So Allah made that beloved to him, and he dedicated himself to it from the year fifty-two, until he won the admiration of the Imams of his time. (2)\nHe traveled in pursuit of Hadith to Mecca, Medina, Sham (Greater Syria), Aleppo, Homs, Damascus, Gaza, Jerusalem, and Alexandria, completing thirty-six cities which he singled out with Takhrij (referencing) under the name Al-Arba'un al-Buldaniyyah (The Forty of Countries). (3)\nIbn Fahd al-Makki (d. 871 AH) said: \"No year passes for him without a journey either for Hajj or seeking Hadith.\" (4)\nNotice: Taqi al-Din Ibn Fahd al-Makki said: \"His father died while he was three years old.\" End quote. (5)\nThis is a mistake, for Abu Zur'ah Ibn al-Iraqi (d. 826 AH) mentioned that the father of Abu al-Fadl al-Iraqi died in the year seven hundred and sixty-three. (6) So Al-Iraqi, at the time of his father's death, was a man of about thirty-eight years old. Perhaps Ibn Fahd confused the death of Taqi al-Din Muhammad ibn Ja'far al-Qina'i with the death of Al-Iraqi's father, for Al-Qina'i died in the year 728 AH, while Zain al-Iraqi was three years old. (7)\n\nFourth Demand: Scholars' Praise of Him\nAl-Hafiz Al-Iraqi strove in seeking [knowledge] and worked hard, toured countries, met prominent Imams, and divine success accompanied him, until he became well-versed in many sciences,",
    "foot_note": "1. See: Lahz al-Alhaz (p. 222), and Al-Daw' al-Lami' (4/172). Mention of Ibn Jama'ah will come in the section of Sheikhs.\n2. See: Al-Majma' al-Mu'assis (2/177-178), and Al-Daw' al-Lami' (4/172).\n3. See Tarikh Ibn Qadi Shuhbah (4/380), Lahz al-Alhaz (p. 225-226), and Al-Daw' al-Lami' (4/172-173).\n4. Lahz al-Alhaz (p. 225-226).\n5. Lahz al-Alhaz (p. 221). Sheikh Ahmad Ma'bad asserted that Ibn Fahd was unique among the early biographers in this statement, then refuted him with three points (See Al-Hafiz Al-Iraqi and his impact on the Sunnah 1/179-181).\n6. Dhayl Abi Zur'ah al-Iraqi 'ala al-Ibar (Obituaries of year 763 AH) (1/86).\n7. Al-Tanbih wa al-Iqaz lima fi Dhuyul Tadhkirat al-Huffaz (p. 99-100). The biography of Al-Qina'i preceded on (p. 7).",
    "book_id": "686",
    "new_page_number": 11
  },
  {
    "serial_number": "3345887",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 106,
    "volume_number": 1,
    "text": "and his personality emerged in the noble Sunnah, so the tongues of Imams overflowed with praise for him.\nHis student Al-Hafiz Ibn Hajar (d. 852 AH) said: \"He advanced in the art of Hadith such that the sheikhs of the age exaggerated in praising him for knowledge, like Al-Subki, Al-Ala'i, Al-Izz Ibn Jama'ah, Al-Imad Ibn Kathir, and others.\" End quote. (1)\nBelow are examples of their praise for him:\nHis sheikh Al-Isnawi (d. 772 AH) said in the biography of Ibn Sayyid al-Nas: \"He explained a piece of Al-Tirmidhi, about two volumes, and the Hafiz of the time Zain al-Din al-Iraqi began completing it, a completion appropriate to its origin.\" End quote. (2)\nAl-Isnawi used to praise his understanding, find his speech in Usul good, listen to his discussions, and say: \"His mind is sound, it does not accept error.\" (3)\nHis sheikh Taqi al-Din al-Subki (d. 756 AH) mentioned him in his lesson, honoring him for his status, spoke highly of him, and described him with knowledge, proficiency, and understanding. (4) From his honoring of him is that when he came to Cairo in the year seven hundred and fifty-six, the people of Hadith wanted to hear [Hadith] from him, so he refused that and said: I will not narrate except in his presence. Al-Iraqi was absent in Alexandria, so Al-Subki died before he arrived, and did not narrate to them. (5)\nAlso, his sheikh Al-Ala'i (d. 761 AH) described him with understanding, knowledge, proficiency, and memorization. (6)",
    "foot_note": "1. Al-Majma' al-Mu'assis (2/178-179).\n2. Tabaqat al-Shafi'iyyah by Al-Isnawi (2/511).\n3. See: Al-Daw' al-Lami' (4/172).\n4. See: Lahz al-Alhaz (p. 223).\n5. See: Lahz al-Alhaz (p. 224).\n6. See: Lahz al-Alhaz (p. 225).",
    "book_id": "686",
    "new_page_number": 12
  },
  {
    "serial_number": "3345888",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 107,
    "volume_number": 1,
    "text": "His sheikh Izz al-Din Ibn Jama'ah (d. 767 AH) said: \"Anyone who claims Hadith in the Egyptian lands other than him is a pretender.\" (1)\nHis sheikh Al-Hafiz Taqi al-Din Muhammad ibn Rafi' ibn Hajras al-Salami (d. 774 AH) said—while he was in Mecca in the year 763 AH, and Al-Iraqi had passed by him—: \"There is no Muhaddith in Cairo except this one, and Judge Izz al-Din Ibn Jama'ah.\" When news of the death of Judge Izz al-Din reached him—while he was in Damascus—he said: Now there remains no Muhaddith in Cairo except Sheikh Zain al-Din al-Iraqi.\" (2)\nHis student Al-Hafiz Ibn Hajar (d. 852 AH) said: \"We have not seen in this art anyone more proficient than him, and most of the people of his time graduated under him.\" End quote. (3) And he said in the beginning of his questions to him: \"I asked our master, our role model, our teacher, our benefactor, our extractor (of hadith), Sheikh al-Islam, the unique among notables, the beauty of the days, the Hafiz of the time.\" End quote. (4) He eulogized him in a long poem (5) in which he praised him greatly, and among it is his saying:\nAnd for sixty years he has not been matched ... nor did the matcher hope to catch up.\nHis student Al-Haythami (d. 807 AH) said: \"My master, and my sheikh, the Allamah, Sheikh of the Huffaz in the East and the West, and the benefactor of the seniors and those below them: Sheikh Zain al-Din Abu al-Fadl Abd al-Rahim al-Iraqi, may Allah be pleased with him and please him, and make Paradise our abode and his abode.\" End quote. (6)\nHis student Al-Ayni (d. 855 AH) said: \"The Sheikh, the Imam, the Allamah, the Mufti of mankind, Sheikh",
    "foot_note": "1. Lahz al-Alhaz (p. 227), and Al-Daw' al-Lami' (4/173).\n2. Lahz al-Alhaz (p. 227).\n3. Inba' al-Ghumr (2/276).\n4. Al-Daw' al-Lami' (4/175).\n5. Inba' al-Ghumr (2/279).\n6. Majma' al-Zawa'id (1/7).",
    "book_id": "686",
    "new_page_number": 13
  },
  {
    "serial_number": "3345889",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 108,
    "volume_number": 1,
    "text": "al-Islam, the Hafiz of Egypt and Sham.\" (1)\nHis student Taqi al-Din al-Fasi al-Makki (d. 832 AH) said: \"He was a proficient Hafiz, knowledgeable in the arts of Hadith, Fiqh, Arabic, and other than that, of many virtues and merits.\" End quote. (2)\nHis student Ibn al-Jazari (d. 833 AH) said: \"The Hafiz of the Egyptian lands, its Muhaddith, and its Sheikh. He excelled in Hadith, text and chain, and studied Fiqh under our sheikh Al-Isnawi and others. He wrote, authored, collected, extracted, and was unique in his time.\" End quote. (3)\nShihab al-Din Abu al-Abbas Ahmad ibn Hijji (d. 816 AH) said: \"He was the Muhaddith of the Egyptian lands; knowledge of the science of Hadith ended with him.\" (4)\nIbn Qadi Shuhbah (d. 851 AH) said: \"The great Hafiz, the proficient benefactor, the critical editor, the Muhaddith of the Egyptian lands, possessor of useful compilations.\" (5)\nTaqi al-Din Ibn Fahd al-Makki (d. 871 AH) said: \"The unique Imam, the authoritative Allamah, the critical scholar, the pillar of mankind, the Hafiz of Islam, the unique of his age, and the single of his era, who surpassed in memorization and proficiency in his time, and the Imams of his age and time testified to his uniqueness in his art.\" End quote. (6)\nAl-Sakhawi (d. 902 AH) said: \"He was an Imam, Allamah, reciter, jurist of the Shafi'i school, Usuli, peerless in the arts of Hadith and its craft. He traveled for it to distant lands, and the Imams of his age testified to his uniqueness in it, and relied on him in it. His compilations in it and other [fields] circulated,",
    "foot_note": "1. Umdat al-Qari (1/4).\n2. Dhayl al-Taqyid (3/11)..\n3. Ghayat al-Nihayah fi Tabaqat al-Qurra (1/382).\n4. Tarikh Ibn Hijji (2/621).\n5. Tabaqat al-Shafi'iyyah by him (2/359). = (4/29).\n6. Lahz al-Alhaz (p. 220).",
    "book_id": "686",
    "new_page_number": 14
  },
  {
    "serial_number": "3345890",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 109,
    "volume_number": 1,
    "text": "and he taught, gave fatwas, narrated, and dictated ... \" (1)\nAl-Suyuti (d. 911 AH) said: \"What I say is: The Muhaddithun are now dependents in [the science of] narrators and other arts of Hadith on four: Al-Hafiz Al-Mizzi, Al-Hafiz Al-Dhahabi, Al-Hafiz Al-Iraqi, and Al-Hafiz Ibn Hajar.\" End quote. (2)\nThis is a drop from an ocean, and everyone who wrote his biography praised him, and in its totality it is a word of consensus, as Al-Sakhawi said. (3)\n\nFifth Demand: His Sheikhs (4)\nAl-Iraqi toured many countries, met their scholars, and took from them. So his auditions and sheikhs were extremely numerous, as Al-Taqi Al-Fasi said (5). I will suffice with mentioning some of them arranged alphabetically:\n• Ibrahim ibn Lajin ibn Abdullah al-Rashidi al-Agharr (d. 749 AH). (6)\n• And Ahmad ibn Abi al-Faraj ibn al-Baba al-Shafi'i (d. 749 AH). (7)\n• And Ahmad ibn Qasim ibn Abd al-Rahman al-Umari al-Harrazi al-Shafi'i, Mufti of Mecca (755 AH). (8)\n• And Ahmad ibn Yusuf ibn Muhammad the Reciter the Grammarian, known as Al-Samin al-Halabi, author of",
    "foot_note": "1. Fath al-Mughith (1/3).\n2. Dhayl Tabaqat al-Huffaz (p. 348).\n3. Fath al-Mughith (1/4).\n4. See: Al-Majma' al-Mu'assis (2/176-178), Lahz al-Alhaz (p. 221-226), Ghayat al-Nihayah (1/382), Al-Daw' al-Lami' (4/171-172), and Al-Hafiz Al-Iraqi and his impact on the Sunnah (1/227-229, 236-237, 317-331, and 374-383).\n5. See Dhayl al-Taqyid (3/11).\n6. His biography in Tabaqat al-Qurra (1/28).\n7. His biography in Lahz al-Alhaz (p. 128).\n8. His biography in Al-Iqd al-Thamin (3/116).",
    "book_id": "686",
    "new_page_number": 15
  },
  {
    "serial_number": "3345891",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 110,
    "volume_number": 1,
    "text": "Al-Durr al-Masun (d. 756 AH). (1)\n• And Khalil ibn Kaykaldi ibn Abdullah al-Ala'i, Salah al-Din, author of Jami' al-Tahsil (d. 761 AH). (2)\n• And Sanjar ibn Abdullah al-Jawli, the Great Prince (d. 745 AH). (3)\n• And Abd al-Rahman ibn Ahmad ibn Ali ibn al-Mubarak al-Baghdadi al-Shafi'i (d. 781 AH). (4)\n• And Abd al-Rahim ibn Ibrahim ibn Hibat Allah al-Juhani, known as Ibn al-Barizi, Judge of Hama, and son of its judge (764 AH). (5)\n• And Abd al-Rahim ibn al-Hasan ibn Ali al-Qurashi, Jamal al-Din al-Isnawi (d. 772 AH) (6), from whom he took the science of Usul, and under whom he studied Fiqh. (7)\n• And Abd al-Rahim ibn Abdullah ibn Yusuf al-Ansari, known as Ibn Shahid al-Jaysh (d. 746 AH). (8)\n• And Abd al-Aziz ibn Muhammad ibn Ibrahim ibn Sa'd Allah ibn Jama'ah al-Kinani, Izz al-Din, the Shafi'i Judge (d. 767 AH). (9)\n• And Abdullah ibn Muhammad ibn Ibrahim ibn Nasr al-Dimashqi, known as Ibn Qayyim al-Daba'iyyah (d. 761 AH). Ibn Hajar said: Our Sheikh Al-Iraqi narrated much from him. (10)",
    "foot_note": "1. His biography in Ghayat al-Nihayah (1/152).\n2. His biography in Dhayl Tadhkirat al-Huffaz by Al-Husayni (p. 43).\n3. His biography in Tabaqat al-Subki (10/41), and Al-Durar al-Kaminah (2/170).\n4. His biography in Tabaqat al-Qurra (1/364), and Inba' al-Ghumr (1/203).\n5. His biography in Fawat al-Wafiyat by Al-Kutubi (2/306-308).\n6. His biography in Tabaqat Ibn Qadi Shuhbah (3/98-101).\n7. See: Lahz al-Alhaz (p. 226).\n8. His biography in Al-Durar al-Kaminah (1/357), and Dhayl al-Taqyid (3/13-15).\n9. His biography in Tabaqat al-Isnawi (1/388-390), and Al-Durar al-Kaminah (2/378-382).\n10. Al-Durar al-Kaminah (2/283/ Biography of Ibn Qayyim al-Daba'iyyah).",
    "book_id": "686",
    "new_page_number": 16
  },
  {
    "serial_number": "3345892",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 111,
    "volume_number": 1,
    "text": "• And Ali ibn Abd al-Kafi ibn Ali al-Shafi'i, Taqi al-Din al-Subki (d. 756 AH). (1)\n• And Ali ibn Uthman ibn Ibrahim al-Mardini al-Hanafi, famous as Ibn al-Turkmani, Judge of Egypt, author of \"Al-Jawhar al-Naqi fi al-Radd 'ala al-Bayhaqi\" (d. 749 AH), (2) he benefited from him greatly, and graduated under him. (3)\n• And Umar ibn Muhammad ibn Ali ibn Futuh al-Damanhuri, the Shafi'i Jurist, Sheikh of the Reciters (d. 752 AH), (4)\n• And Muhammad ibn Ahmad ibn Abd al-Mu'min ibn al-Labban al-Shafi'i (d. 749 AH). (5)\n• And Muhammad ibn Abi Bakr ibn Isa ibn Badran al-Sa'di, Chief Judge in Egypt, known as Taqi al-Din al-Ikhna'i al-Maliki (d. 750 AH). (6)\n• And Muhammad ibn Isma'il ibn Ibrahim ibn al-Dimashqi, known as Ibn al-Khabbaz (d. 756 AH). (7)\n• And Muhammad ibn Abdullah ibn Muhammad ibn Abd al-Hamid ibn Abd al-Hadi (d. 769 AH). (8)\n• And Muhammad ibn Muhammad ibn Ibrahim ibn Abi al-Qasim al-Maydumi, Musnid of Egypt (d. 754 AH). Ibn Hajar said: \"He is the highest sheikh according to our Sheikh Al-Iraqi from the Egyptians, and he narrated much from him.\" (9)\n• And Muhammad ibn Muhammad ibn Muhammad ibn Abi al-Haram, Abu al-Haram ibn Abi al-Fath al-Qalanisi al-Hanbali",
    "foot_note": "1. His biography in Dhayl al-Tadhkirah by Al-Husayni (p. 39).\n2. His biography in Lahz al-Alhaz (p. 86).\n3. See: Lahz al-Alhaz (p. 222).\n4. His biography in Ghayat al-Nihayah (1/597-598).\n5. His biography in Tabaqat al-Subki (4/94-96).\n6. His biography in Dhayl al-Taqyid (1/186).\n7. His biography in Al-Durar al-Kaminah (4/4-5). (3/384).\n8. His biography in Al-Durar al-Kaminah (3/482-483).\n9. Al-Durar al-Kaminah (4/157-158/ Biography of Al-Maydumi).",
    "book_id": "686",
    "new_page_number": 17
  },
  {
    "serial_number": "3345893",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 112,
    "volume_number": 1,
    "text": "(d. 765 AH). (1)\nAnd other than these a large multitude; whoever investigates Al-Durar al-Kaminah by Ibn Hajar will find many of them.\n\nSixth Demand: His Students (2):\nAl-Iraqi's personality became famous in the horizons for his deep knowledge in Prophetic Hadith along with participation in other sciences, as the Imams of his time testified. He undertook the task of teaching in Dar al-Hadith al-Kamiliyyah (3), the Old Zahiriyyah School (4), the Fadiliyyah School (5), Ibn Tulun Mosque (6), and other schools. (7) And he revived the Sunnah of dictation sessions (Majalis al-Imla') after they had become extinct. (8) All of that made people travel to him from every direction and side.\nTaqi al-Din Ibn Fahd al-Makki said: \"He was sought from the easts of the earth and its wests. A massive crowd traveled to him to take from him and hear, the great of them and the small. So they adhered to him, benefited from him, and all the Imams from the notable scholars and Huffaz possessing merit and criticism wrote from him...\" (9)\nBelow is a mention of some of these notables who studied under him:",
    "foot_note": "1. His biography in Al-Durar al-Kaminah (4/335).\n2. See: Al-Hafiz Al-Iraqi and his impact on the Sunnah (1/471 - 2/512), and (2/574-602).\n3. It is the school established by Sultan Al-Malik Al-Kamil Nasir al-Din Muhammad son of Al-Malik Al-Adil Abu Bakr ibn Ayyub in Cairo in the year 622 AH. (See Al-Khitat by Al-Maqrizi 2/375, and Husn al-Muhadarah 2/262).\n4. It is the school established by Al-Malik Al-Zahir Rukn al-Din Abu al-Futuh Baybars al-Turki (d. 676 AH) in Cairo. He began its construction in the second Rabi' al-Akhir in the year six hundred and sixty, and finished it in the year sixty-two. (See Al-Khitat by Al-Maqrizi 2/378-379, and Husn al-Muhadarah 2/264).\n5. It is the school built by Judge Al-Fadil Abu Ali Abd al-Rahim ibn Ali al-Baysani (d. 596 AH) next to his house in Cairo in the year five hundred and eighty. (See Al-Khitat by Al-Maqrizi 2/366-367).\n6. It is the mosque built by Prince Abu al-Abbas Ahmad ibn Tulun (d. 270 AH) in Cairo. He began its construction in the year two hundred and sixty-three, and finished it in the year sixty-six. The expenditure in its construction reached one hundred and twenty thousand Dinars. (Khitat Al-Maqrizi 2/265-269, and Husn al-Muhadarah 2/246-250).\n7. See: Al-Daw' al-Lami' (4/174), and Dhayl al-Taqyid (3/9).\n8. See: Fath al-Mughith (3/251), and Al-Daw' al-Lami' (4/174).\n9. Lahz al-Alhaz (p. 234).",
    "book_id": "686",
    "new_page_number": 18
  },
  {
    "serial_number": "3345894",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 113,
    "volume_number": 1,
    "text": "• Al-Hafiz Shihab al-Din Ahmad ibn Ali ibn Muhammad ibn Ali ibn Hajar al-Asqalani, author of Fath al-Bari, Tahdhib al-Tahdhib, and Lisan al-Mizan. (773 - 852 AH). (1)\n• And his son, the Muhaddith Jurist Wali al-Din Abu Zur'ah Ahmad ibn Abd al-Rahim, known as Ibn al-Iraqi, author of Takmilat Tarh al-Tathrib, and Tuhfat al-Tahsil. (762 - 826 AH). (2)\n• And his son-in-law Al-Hafiz Nur al-Din Abu al-Hasan Ali ibn Abi Bakr ibn Sulayman ibn Abi Bakr ibn Umar al-Haythami, author of Majma' al-Zawa'id, and Majma' al-Bahrain (735 - 807 AH). He adhered to Al-Iraqi in his travel and residence, and Al-Iraqi married him to his eldest daughter Khadijah. (3)\nThese three were his most illustrious students. It was said to Al-Iraqi when death approached him: Who remains of the Huffaz? He said: Ibn Hajar, then my son Abu Zur'ah, then Al-Haythami. (4)\nThere is a very large number of his students, I mention some of them alphabetically.\n• Ibrahim ibn Muhammad ibn Khalil al-Tarabulsi, Burhan al-Din al-Halabi known as Al-Sibt Ibn al-Ajami (753 - 841). (5)\n• And Ahmad ibn Abi Bakr ibn Isma'il al-Busiri, author of Misbah al-Zujajah, and Ithaf al-Khiyarah al-Maharah. (762 - 840). (6)\n• And Ahmad ibn Ali ibn Abd al-Qadir al-Maqrizi, the Allamah Historian, author of Khitat al-Qahirah (766 - 845 AH). (7)",
    "foot_note": "1. His biography in Lahz al-Alhaz (326-342), and Al-Sakhawi wrote a biography for him in a separate work he named: Al-Jawahir wa al-Durar fi Tarjamat Shaykh al-Islam Ibn Hajar.\n2. His biography in Raf' al-Isr (p. 60-61), and Lahz al-Alhaz (p. 284-291).\n3. His biography in Inba' al-Ghumr (2/309), and Al-Daw' al-Lami' (5/200-203).\n4. See: Inba' al-Ghumr (2/277).\n5. His biography in Lahz al-Alhaz (p. 308), and Al-Daw' al-Lami' (1/138).\n6. His biography in Inba' al-Ghumr (4/53), and Al-Daw' al-Lami' (1/251).\n7. His biography in Al-Daw' al-Lami' (2/21-25).",
    "book_id": "686",
    "new_page_number": 19
  },
  {
    "serial_number": "3345895",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 114,
    "volume_number": 1,
    "text": "• And Abd al-Rahman ibn Muhammad ibn Abdullah al-Masri, al-Hanbali, Zain al-Din al-Zarkashi (758 - 846 AH) (1)\n• And Abd al-Rahim ibn Muhammad ibn Abd al-Rahim al-Masri, al-Hanafi, known as Ibn al-Furat, Musnid of the Egyptian lands. (759 - 851 AH). (2)\n• And Muhammad ibn Ahmad ibn Ali al-Makki, Taqi al-Din al-Fasi, author of Al-Iqd al-Thamin, and Dhayl al-Taqyid, (775 - 832 AH). (3)\n• And Muhammad ibn Abd al-Da'im al-Barmawi, commentator on Sahih al-Bukhari (763 - 831). (4)\n• And Muhammad ibn Abdullah ibn Zahirah al-Qurashi, Hafiz of Mecca, and its Judge. (751 - 817 AH). (5)\n• And Muhammad ibn Muhammad ibn Hasan al-Shumni Kamal al-Din (766 - 821 AH). (6)\n• And Muhammad ibn Muhammad ibn Muhammad ibn Ali, Abu al-Khayr Shams al-Din known as Ibn al-Jazari, Imam of the Reciters (751 - 833 AH). (7)\n• And Mahmud ibn Ahmad ibn Musa al-Ayni, author of Umdat al-Qari. (762 - 855 AH). (8)\n• And Juwayriyah daughter of the subject Abd al-Rahim ibn al-Husayn al-Iraqi (788 - 863 AH). (9)\n• And Zaynab daughter of the subject (791 - 865 AH). (10)",
    "foot_note": "1. His biography in Al-Daw' al-Lami' (4/136-137), and Husn al-Muhadarah (1/483-484).\n2. His biography in Al-Daw' al-Lami' (4/186).\n3. His biography in Lahz al-Alhaz (p. 291).\n4. His biography in Al-Daw' al-Lami' (7/280-282).\n5. His biography in Lahz al-Alhaz (p. 253), and Al-Daw' al-Lami' (8/92-95).\n6. His biography in Al-Majma' al-Mu'assis (3/301), and Al-Daw' al-Lami' (9/74-75).\n7. His biography in Ghayat al-Nihayah (5/247-251), and Al-Daw' al-Lami' (9/255).\n8. His biography in Al-Daw' al-Lami' (10/131-135).\n9. Her biography in Al-Daw' al-Lami' (12/18).\n10. Her biography in Al-Daw' al-Lami' (12/41).",
    "book_id": "686",
    "new_page_number": 20
  },
  {
    "serial_number": "3345896",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 115,
    "volume_number": 1,
    "text": "And a large multitude of others, and many people. Whoever investigates Inba' al-Ghumr by Ibn Hajar, and Al-Daw' al-Lami' by Al-Sakhawi will find many, many. May Allah reward their sheikh for raising this blessed generation and teaching them the best reward.\n\nSeventh Demand: His Works (1)\nAl-Hafiz Al-Iraqi began classifying [authoring] early, becoming fond of extracting the hadiths of Ihya' Ulum al-Din by Al-Ghazali, while he was close to twenty years old. (2) Starting in youth aids in mastery and practice, and this appeared clearly in his works in quantity and quality; for he authored many useful works in various sciences. I mention what I found mentioned of them arranged alphabetically below:\n1. Ajwibat Ibn al-Arabi. (3)\n2. Al-Ahadith al-Mukharrajah fi al-Sahihayn al-lati tukullima fiha bi-da'f wa inqita' (The Hadiths Extracted in the Two Sahihs which were spoken of with weakness and interruption): He did not make a fair copy of this book because two quires of its draft were missing. (4)\n3. Ihya' al-Qalb al-Mayyit bi-Dukhul al-Bayt (Reviving the Dead Heart by Entering the House [Kaaba]). (5)\n4. Akhbar al-Ahya' bi-Akhbar al-Ahya': In four volumes, he finished drafting it in the year seven hundred and fifty-one, then fair-copied about forty-five quires of it,",
    "foot_note": "1. Dr. Ahmad Ma'bad Abd al-Karim has a lengthy study on Al-Iraqi's works in his extensive book: \"Al-Hafiz Al-Iraqi and his impact on the Sunnah (2/657 - 5/2239), but he did not cover the study of some of Al-Iraqi's works in these volumes, including Takmilat Sharh al-Tirmidhi. He mentioned at the end of the fifth part that it is followed by the sixth and final part, and this part has not been printed yet even though about fifteen years have passed since the printing of its sisters. Perhaps Allah will bring about something after that.\n2. See: Lahz al-Alhaz (p. 228).\n3. See: Lahz al-Alhaz (p. 231).\n4. See: Al-Taqyid wa al-Idah (p. 29), Al-Nukat 'ala Ibn al-Salah (1/380), Lahz al-Alhaz (p. 231), and Ibn Hajar did not find it after long searching for it, and asking the author.\n5. See: Lahz al-Alhaz (p. 231).",
    "book_id": "686",
    "new_page_number": 21
  },
  {
    "serial_number": "3345897",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 116,
    "volume_number": 1,
    "text": "reaching in it to the end of Hajj. (1)\n5. Al-Arba'un al-Buldaniyyah: He mentioned therein hadiths from thirty-six countries, and aimed to complete them to forty, but that was not facilitated for him. (2)\n6. Al-Arba'un al-Buldaniyyah: He selected it from Sahih Ibn Hibban. (3)\n7. Al-Arba'un al-Tusa'iyyah (The Forty with Nine-Link Chains) from the narration of Abu al-Fath Muhammad ibn Muhammad al-Maydumi. (4)\n8. Al-Arba'un al-Tusa'iyyah: From the narration of Al-Bayani. (5)\n9. Al-Arba'un al-Ushariyyah (The Forty with Ten-Link Chains): He dictated it in Al-Rawdah, and it is his first dictation. (6) (Printed).\n10. Arba'un Hadithan min al-Muwatta' (Forty Hadiths from Al-Muwatta') - Narration of Yahya ibn Bukayr - (7)\n11. Al-Isti'adhah bi-al-Wahid min Iqamat Jumu'atayn fi Makan Wahid (Seeking Refuge in the One from Establishing Two Friday Prayers in One Place). (8)\n12. Atraf Sahih Ibn Hibban: He reached in it to the beginning of the sixtieth type of the third section. (9)\n13. Alfiyyat al-Hadith, named Al-Tabsira wa al-Tadhkira, printed. (10)",
    "foot_note": "1. See: Lahz al-Alhaz (p. 229), and Inba' al-Ghumr (2/276).\n2. See: Lahz al-Alhaz (p. 233).\n3. See: Lahz al-Alhaz (p. 232).\n4. See: Lahz al-Alhaz (p. 232), and Fahras al-Faharis (2/817).\n5. See: Lahz al-Alhaz (p. 232), and Fahras al-Faharis (2/817). This Al-Bayani is Sheikh Al-Musnid Abu Abdullah Muhammad ibn Ibrahim ibn Muhammad ibn Abi Bakr ibn Ahmad ibn Ya'qub ibn Ilyas al-Ansari al-Khazraji al-Bayani al-Maqdisi, as came on his handwritten copy at the Egyptian National Library (433/Hadith/Taymur), as stated by Sheikh Ahmad Ma'bad in his book Al-Hafiz Al-Iraqi and his impact on the Sunnah (5/2029). Al-Bayani has a biography in Al-Durar al-Kaminah (3/295).\n6. See: Lahz al-Alhaz (p. 232), and it was printed with verification by Badr ibn Abdullah al-Badr.\n7. See: Mu'jam al-Shuyukh by Umar ibn Fahd al-Makki (p. 92).\n8. See: Lahz al-Alhaz (p. 231), Al-Daw' al-Lami' (4/173), and Al-Badr al-Tali' (1/355).\n9. See: Lahz al-Alhaz (p. 232).\n10. Printed several times, the best of which is the edition of Dar al-Minhaj in Riyadh.",
    "book_id": "686",
    "new_page_number": 22
  },
  {
    "serial_number": "3345898",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 117,
    "volume_number": 1,
    "text": "14. Al-Alfiyyah fi Gharib al-Qur'an. (1)\n15. Al-Amali 'ala Amali al-Rafi'i. (2)\n16. Al-Amali 'ala al-Arba'in al-Nawawiyyah. (3)\n17. Al-Insaf fi al-Marasil: It is among the last things he authored. (4)\n18. Al-Ba'ith 'ala al-Khalas min Hawadith al-Qussas: (5) (Printed).\n19. Tatimmat al-Muhimmat: It is a supplement to Al-Muhimmat by his sheikh Al-Isnawi. (6)\n20. Al-Tahrir fi Usul al-Fiqh. (7)\n21. Takhrij al-Ahadith allati yushiru ilayha al-Tirmidhi fi kulli bab (Takhrij of the Hadiths which Al-Tirmidhi refers to in every chapter). (8)\n22. Takhrij al-Ahadith wa al-Athar al-Waqi'ah fi Minhaj al-Baydawi. (9) (Printed).\n23. Tartib man lahu dhikr - tajrih, aw ta'dil - fi Bayan al-Wahm wa al-Iham li-Ibn al-Qattan 'ala Huruf al-Mu'jam (Arrangement of those mentioned - impugning or validation - in Bayan al-Wahm wa al-Iham by Ibn al-Qattan alphabetically). (10)\n24. Tarjamat al-Isnawi. (11)",
    "foot_note": "1. See: Lahz al-Alhaz (p. 230), and Al-Daw' al-Lami' (4/173).\n2. See: Al-Majma' al-Mu'assis (2/185), and Lahz al-Alhaz (p. 233). A part of it was found in eight pages within the collections of Al-Zahiriyyah Library in Damascus under number (3963/General). (See Al-Hafiz Al-Iraqi and his impact on the Sunnah 5/2087).\n3. See: Al-Majma' al-Mu'assis (2/184), and Lahz al-Alhaz (p. 233).\n4. See: Al-Majma' al-Mu'assis (2/181), Lahz al-Alhaz (p. 231), and Al-Daw' al-Lami' (4/173).\n5. Printed with verification by Dr. Muhammad Lutfi al-Sabbagh in Riyadh 1422 AH.\n6. See: Al-Daw' al-Lami' (4/173).\n7. See: Al-A'lam by Al-Zirikli (3/344).\n8. See: Al-Risalah al-Mustatrafah (p. 186).\n9. See: Lahz al-Alhaz (p. 232). Printed by Dar al-Basha'ir with verification by Muhammad Nasir al-Ajmi in the year 1409 AH.\n10. See: Lahz al-Alhaz (p. 232).\n11. See: Lahz al-Alhaz (p. 231).",
    "book_id": "686",
    "new_page_number": 23
  },
  {
    "serial_number": "3345899",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 118,
    "volume_number": 1,
    "text": "25. Tarjamat Mughlatay. (1)\n26. Tafdil Zamzam 'ala kulli ma'in qalil Zamzam. (2)\n27. Taqrib al-Asanid wa Tartib al-Masanid fi al-Ahkam (3): The translator compiled this book from sixteen chains said to be: The most authentic chains. It is printed.\n28. Al-Taqyid wa al-Idah lima utliqa wa ughliqa min Kitab Ibn al-Salah. Printed. (4)\n29. Takmilat Sharh al-Tirmidhi: Discussion on it will come in the second section.\n30. Takmilat Sharh al-Muhadhdhab li-l-Nawawi: Al-Sakhawi said: \"He built upon the writing of his sheikh Al-Subki, so he wrote places (sections).\" (5)\n31. Juz' fi al-Ruwat alladhina kharraja lahum al-Bukhari wa Muslim fi Sahihayhima min ghayr al-Sahabah, wa lam yarwi 'an kulli minhum illa rawin wahid (Part on Narrators whom Bukhari and Muslim recorded in their Sahihs other than Companions, and only one narrator narrated from each of them). (6)\n32. Juz' fi al-Kalam 'ala al-Ahadith allati tukullima fiha bi-al-wad', wa hiya fi Musnad Ahmad, wa al-Radd 'ala Ibn al-Jawzi (Part on discussing Hadiths spoken of as fabrication while they are in Musnad Ahmad, and Refutation of Ibn al-Jawzi). (7) Ibn Hajar included it entirely in Bidayat al-Qawl al-Musaddad (8).\n33. Juz' fi al-Kalam 'ala hadith «Al-Mawt Kaffarah li-kulli Muslim» (Part on discussing the hadith 'Death is expiation for every Muslim'). (9)",
    "foot_note": "1. See: Al-Jawahir wa al-Durar (3/1275).\n2. See: Lahz al-Alhaz (p. 231).\n3. See: Lahz al-Alhaz (p. 230), and Al-Daw' al-Lami' (4/173). Printed in Beirut in the year 1404 AH.\n4. It has several editions, the best of which is the edition of Sheikh Raghib al-Tabbakh, and the edition of Dr. Osama Khayyat.\n5. See: Al-Daw' al-Lami' (4/173).\n6. See: Al-Taqyid wa al-Idah (p. 126).\n7. See: Al-Taqyid wa al-Idah (p. 57).\n8. (p. 3-11).\n9. See: Lahz al-Alhaz (p. 231). And the hadith is fabricated. (See Al-Da'ifah (4685)).",
    "book_id": "686",
    "new_page_number": 24
  },
  {
    "serial_number": "3345900",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 119,
    "volume_number": 1,
    "text": "34. Al-Jawab 'an su'al yatadammanu tarikh tahrim al-Riba (The Answer to a question containing the date of the prohibition of usury). (1)\n35. Hawashi 'ala Tuhfat al-Ashraf li-l-Mizzi (Notes on Tuhfat al-Ashraf by Al-Mizzi). (2)\n36. Al-Durar al-Saniyyah fi Nazm al-Sirah al-Zakiyyah: It is the Alfiyyah (Thousand-verse poem) of Sirah, containing one thousand and thirty-two verses. (3) (Printed).\n37. Dhayl 'ala Dhayl al-Ibar li-l-Dhahabi (Tail/Supplement to the Tail of Al-Ibar by Al-Dhahabi): From year seven hundred and forty-one to year seven hundred and sixty-three, and his son Al-Hafiz Wali al-Din added a tail to it. (4)\n38. Dhayl 'ala Jami' al-Tahsil fi Bab al-Mudallisin. (5)\n39. Dhayl 'ala Dhayl Ibn Aybak 'ala Wafiyat al-A'yan li-Ibn Khallikan. (6)\n40. Dhayl 'ala Dhayl Abd al-Baqi ibn Abd al-Majid al-Yamani al-Makhzumi (d. 743 AH) (7) 'ala Wafiyat al-A'yan li-Ibn Khallikan. (8)",
    "foot_note": "1. See: Lahz al-Alhaz (p. 331). And Al-Daw' al-Lami' (4/173).\n2. See: Al-Nukat al-Ziraf (1/5-6 on the margin of Tuhfat al-Ashraf).\n3. See: Lahz al-Alhaz (p. 231), published by the Mosques Administration in Hawalli Governorate, Kuwait, care of Mansour Al-Atiqi.\n4. See: Lahz al-Alhaz (p. 231), and Sheikh Ahmad Ma'bad mentioned that what came in the catalog of Koprulu Muhammad Pasha Library: Dhayl Tarikh al-Dhahabi by Abd al-Rahim ibn al-Husayn al-Iraqi under number (1081) is a mistake, rather what is in it is authored by his son Abu Zur'ah. (See: Al-Hafiz Al-Iraqi and his impact on the Sunnah 3/1169-1173).\n5. See: Ta'rif Ahl al-Taqdis (p. 65).\n6. See: Tabaqat Ibn Qadi Shuhbah (4/32), and Kashf al-Zunun (2/2018). It has a copy in Koprulu Zade Library within a collection number (1626), the cataloguer mentioned it under the name: A book in history entitled: Al-Wafiyat al-Iraqiyyah. (See: Al-Hafiz Al-Iraqi and his impact on the Sunnah 3/1212). Ibn Aybak is the beneficial Imam Shihab al-Din Ahmad ibn Aybak ibn Abdullah al-Husami, known as Al-Dimyati, who died in the year 749 AH. (See Dhayl Tadhkirat al-Huffaz by Al-Husayni p. 54-55).\n7. His biography in Al-Wafiyat by Ibn Rafi' (1/437).\n8. See: Kashf al-Zunun (2/2018), and Al-Mustadrak 'ala Mu'jam al-Mu'allifin (p. 367).",
    "book_id": "686",
    "new_page_number": 25
  },
  {
    "serial_number": "3345901",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 120,
    "volume_number": 1,
    "text": "41. Dhayl 'ala Mukhtasar al-Dhahabi li-Usd al-Ghabah fi Ma'rifat al-Sahabah li-Ibn al-Athir. (1)\n42. Dhayl 'ala Mizan al-I'tidal li-l-Dhahabi: It was not fair-copied. (2) (Printed).\n43. Dhayl 'ala Wafiyat al-Naqalah li-Ibn Aybak al-Dimyati. (3)\n44. Dhayl Mashyakhat al-Qadi Abi al-Haram al-Qalanisi. (4)\n45. Dhayl Mashyakhat Muhammad ibn Ibrahim al-Bayani. (5)\n46. Rijal Sunan al-Daraqutni siwa man fi al-Tahdhib. (6)\n47. Rijal Sahih Ibn Hibban siwa man fi al-Tahdhib: He reached in it to the beginning of the sixtieth type of the third section. (7)\n48. Al-Radd 'ala al-Saghani fi Risalatihi al-Durr al-Multaqat fi Bayan al-Ghalat. (8) (Printed).\n49. Sharh al-Bukhari: Not completed, if completed it would have had no peer in its field. (9)\n50. Sharh al-Tabsira wa al-Tadhkira: It is a medium explanation of Alfiyyat al-Hadith. He had started a lengthy explanation on it from which he wrote about six quires, then left it, and made this explanation. (10) (Printed)",
    "foot_note": "1. See: Sharh al-Tabsira wa al-Tadhkira by Al-Iraqi (3/3).\n2. See: Lahz al-Alhaz (p. 231), and it was printed with verification by Dr. Abd al-Qayyum Abd Rabb al-Nabi.\n3. See: Sharh al-Tabsira wa al-Tadhkira (3/133), and Al-Hafiz Al-Iraqi and his impact on the Sunnah (3/1192).\n4. See: Lahz al-Alhaz (p. 232), and Al-Daw' al-Lami' (4/173).\n5. See: Al-Durar al-Kaminah (3/295), and Al-Hafiz Al-Iraqi and his impact on the Sunnah (3/1288).\n6. See: Lahz al-Alhaz (p. 233).\n7. Same source (232-233).\n8. A part of it was printed at the end of the book Musnad al-Shihab with verification by Hamdi Abd al-Majid al-Salafi.\n9. See: Al-Ujalah al-Saniyyah fi Sharh Alfiyyat al-Sirah al-Nabawiyyah by Al-Munawi (p. 4).\n10. See: Lahz al-Alhaz (p. 230), Inba' al-Ghumr (2/276), and it has several editions. The book was printed under the name \"Fath al-Mughith\", and this is an alien name; the first to declare this name was the author of Kashf al-Zunun (1235). See Al-Hafiz Al-Iraqi and his impact on the Sunnah (2/840).",
    "book_id": "686",
    "new_page_number": 26
  },
  {
    "serial_number": "3345902",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 121,
    "volume_number": 1,
    "text": "51. Sharh al-Taqrib wa al-Taysir li-Ma'rifat Sunan al-Bashir al-Nadhir li-l-Nawawi. (1)\n52. Al-Sharh al-Kabir 'ala Alfiyyat al-Hadith, he reached the [chapter of] Weak [hadith] in it. (2)\n53. Sharh Sunan Abi Dawud: Not completed. (3)\n54. Tarh al-Tathrib Sharh Taqrib al-Masanid: He did not complete it, so his son Abu Zur'ah completed it, (4) (Printed).\n55. Turuq Hadith «Man kuntu mawlahu fa-'Aliyyun mawlahu». (5)\n56. Al-Adad al-Mu'tabar min al-Awjuh allati bayna al-Suwar. (6)\n57. Al-Ishrun al-Thamaniyyah min riwayat al-Bayani. (7)\n58. Fadl Hira'. (8)\n59. Qurrat al-Ayn bi-Wafa' al-Dayn: It is the last of his works. (9) (Printed).\n60. Al-Kashf al-Mubin 'an Takhrij Ihya' Ulum al-Din: It is intermediate between the lengthy Takhrij called Akhbar al-Ahya', and the concise Takhrij called Al-Mughni. (10)\n61. Al-Kalam 'ala al-Hadith al-Warid fi Aqall al-Hayd wa Aktharih (Discussion on the Hadith reported regarding the minimum and maximum of menstruation). (11)",
    "foot_note": "1. See: Kashf al-Zunun (1/465).\n2. See: Sharh al-Tabsira wa al-Tadhkira (1/3), and Al-Hafiz Al-Iraqi and his impact on the Sunnah (2/830).\n3. See: Al-Ujalah al-Saniyyah 'ala Alfiyyat al-Sirah al-Nabawiyyah (p. 4).\n4. See: Lahz al-Alhaz (p. 230).\n5. See: Lahz al-Alhaz (p. 231). And see the Hadith in Al-Sahihah (1750).\n6. See: Idah al-Maknun (2/96).\n7. See: Lahz al-Alhaz (p. 232).\n8. See: Lahz al-Alhaz (p. 231).\n9. Lahz al-Alhaz (p. 231), printed by Dar al-Sahabah in Tanta 1411 AH.\n10. See: Lahz al-Alhaz (p. 230).\n11. See: Lahz al-Alhaz (p. 232). And it is a weak hadith.",
    "book_id": "686",
    "new_page_number": 27
  },
  {
    "serial_number": "3345903",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 122,
    "volume_number": 1,
    "text": "62. Al-Kalam 'ala Hadith al-Tawsi'ah yawm 'Ashura'. (1)\n63. Al-Kalam 'ala Sawm Sitt min Shawwal. (2)\n64. Al-Kalam 'ala Mas'alat al-Sujud li-Tark al-Qunut. (3)\n65. Ma rawahu al-Sahabah 'an al-Tabi'in 'an al-Sahabah. (4)\n66. Majlis fi al-Istisqa': Ibn Hajar said: When the Nile stopped, and excessive price inflation occurred, he dictated a session related to seeking rain (Istisqa'). (5)\n67. Majlis fi Fada'il al-Dhikr wa al-Du'a' yawm 'Arafah. (6)\n68. Mahajjat al-Qurab fi Mahabbat al-Arab. (7) (Printed).\n69. Mukhtasar Taqrib al-Asanid: In about half its size. (8)\n70. Mukhtasar Kitab al-Mi'atayn min Hadith Abi Uthman al-Sabuni (d. 449 AH). (9)\n71. Mas'alat al-Shurb Qa'iman (The issue of drinking while standing). (10)\n72. Mas'alat Qass al-Sharib (The issue of trimming the mustache). (11) (Printed).",
    "foot_note": "1. See: Lahz al-Alhaz (p. 231). The wording of the hadith is «Whoever expands upon his family on the day of Ashura, Allah expands upon him for the rest of his year». Imam Ahmad said: This hadith is not authentic. (See Al-Manar al-Munif p. 111-112).\n2. See: Lahz al-Alhaz (p. 231).\n3. See: Lahz al-Alhaz (p. 231).\n4. See: Tadrib al-Rawi (2/920).\n5. See: Al-Majma' al-Mu'assis (2/186).\n6. See: Silat al-Khalaf bi-Mawsul al-Salaf (p. 395).\n7. See: Lahz al-Alhaz (p. 231). Printed by Dar al-Asimah 1420 AH with verification by Abd al-Aziz ibn Abdullah.\n8. See: Lahz al-Alhaz (p. 230).\n9. Mentioned by Al-Zabidi in Ithaf al-Sadah al-Muttaqin (4/432). And see Al-Hafiz Al-Iraqi and his impact on the Sunnah (5/2137).\n10. See: Lahz al-Alhaz (p. 231).\n11. Same source. Printed with verification by Moulay Abd al-Rahim Mubarak by Dar al-Basha'ir 1424 AH.",
    "book_id": "686",
    "new_page_number": 28
  },
  {
    "serial_number": "3345904",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 123,
    "volume_number": 1,
    "text": "73. Al-Mustakhraj 'ala al-Mustadrak. (1) (Printed).\n74. Mashyakhat al-Qadi Nasir al-Din Ibn al-Nunisi, wa Dhayluha. (2)\n75. Mashyakhat Abd al-Rahman ibn al-Qari'. (3)\n76. Mu'jam kharrajahu li-nafsih (Dictionary he extracted for himself), Al-Sakhawi doubted its existence, saying: And among the strange is the saying of Al-Burhan al-Halabi that he extracted a Mu'jam for himself, and our Sheikh did not see it, nor did I see it. (4)\n77. Mu'jam Shuyukh Ibn Jama'ah: Not completed. (5)\n78. Al-Mughni 'an Haml al-Asfar fi al-Asfar fi Takhrij ma fi al-Ihya' min al-Akhbar: It is the concise Takhrij of the hadiths of Ihya' Ulum al-Din by Al-Ghazali. This summary became famous during his lifetime, and numerous copies were written of it, carried by riders to Andalusia and other countries. Because of it, the Sheikh slowed down in completing the fair copy of the original. (6) (Printed).\n79. Mu'jam mushtamil 'ala tarajim jama'ah min ahl al-qarn al-thamin (Dictionary containing biographies of a group from the people of the eighth century): Ibn Fahd said: Most of them are sheikhs of his sheikhs, and among them are some of his sheikhs. (7)\n80. Man rawa 'an Amr ibn Shu'ayb min al-Tabi'in. (8)",
    "foot_note": "1. See the biography of Abd al-Hamid ibn Abd al-Rahman al-A'raj from Dhayl Mizan al-I'tidal (p. 322-323). A part of it was printed with verification by Muhammad Abd al-Mun'im Rashad, published by Maktabat al-Sunnah in Cairo in the year 1410 AH.\n2. See: Dhayl al-Ibar by Abu Zur'ah (Obituaries 763 AH), (1/87-88), and Lahz al-Alhaz (p. 231).\n3. See: Mu'jam al-Shuyukh by Ibn Fahd (p. 302), and Lahz al-Alhaz (p. 232). Ibn al-Qari' is Abd al-Rahman ibn Ali ibn Muhammad al-Tha'labi, Zain al-Din Abu al-Faraj, who died in the year 776 AH. (See Al-Durar al-Kaminah 2/337).\n4. See: Al-Daw' al-Lami' (4/174).\n5. See: Dhayl al-Ibar by Al-Wali al-Iraqi (Obituaries of year 767 AH), (1/204).\n6. See: Inba' al-Ghumr (2/276), and Lahz al-Alhaz (p. 230). Printed repeatedly with Ihya' Ulum al-Din, then printed separately care of Ashraf Abd al-Maqsud.\n7. See: Lahz al-Alhaz (p. 232), a copy of it is in Al-Maktabah al-Kattaniyyah in Morocco. (See introduction of the verifier of Sharh al-Tabsira wa al-Tadhkira p. 18).\n8. See: Sharh al-Tabsira wa al-Tadhkira (3/66).",
    "book_id": "686",
    "new_page_number": 29
  },
  {
    "serial_number": "3345905",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 124,
    "volume_number": 1,
    "text": "81. Manzumah fi al-Wudu' al-Mustahabb. (1)\n82. Al-Mawrid al-Hani fi al-Mawlid al-Sani. (2)\n83. Al-Najm al-Wahhaj fi Nazm al-Minhaj fi Usul al-Fiqh li-l-Baydawi, in one thousand three hundred and sixty-seven verses. (3)\n84. Nazm al-Iqtirah li-Ibn Daqiq al-Eid in four hundred and twenty-seven verses. (4)\n85. Al-Nukat 'ala al-Najm al-Wahhaj: He explained in it the wisdom of his diverging from the wording of Al-Minhaj with alerting to the subtleties of that. Not completed; he reached in it to the course of the fifth chapter of the section of Abrogating and Abrogated. (5)\n\nAmong what was attributed to him by mistake:\n• Al-Mustafad min Mubhamat al-Matn wa al-Isnad, Umar Rida Kahhalah attributed it in Al-Mustadrak 'ala Mu'jam al-Mu'allifin (6), but the correct view is that it is by his son Abu Zur'ah. (7)\n• Juz' 'Awali Ibn al-Shaykhah (8): Hajji Khalifa attributed it in Kashf al-Zunun (9) to Zain al-Iraqi, which is a mistake. The correct view is that it is by his son Abu Zur'ah, as Ibn Hajar attributed it in Al-Majma' al-Mu'assis (10).",
    "foot_note": "1. See: Kashf al-Zunun (2/1867).\n2. See: Lahz al-Alhaz (p. 231).\n3. See: Lahz al-Alhaz (p. 230), and Dhayl al-Tadhkira by Al-Suyuti (p. 371).\n4. See: Lahz al-Alhaz (p. 230-231), a copy of it is in Laleli Library (1392/ Usul Hadith). (See Al-Hafiz Al-Iraqi and his impact on the Sunnah (3/1035).\n5. See: Lahz al-Alhaz (p. 230).\n6. (p. 367).\n7. It is printed and circulated with verification by Abd al-Rahman Abd al-Hamid al-Barr.\n8. Ibn al-Shaykhah is Imam Abu al-Faraj Abd al-Rahman ibn Ahmad ibn Mubarak al-Ghazzi, who died in the year 799 AH. (See: Al-Majma' al-Mu'assis 2/107-137).\n9. (2/1178).\n10. (2/108).",
    "book_id": "686",
    "new_page_number": 30
  },
  {
    "serial_number": "3345906",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 125,
    "volume_number": 1,
    "text": "Eighth Demand: His Death:\nAl-Hafiz Al-Iraqi died following his exit from the bathhouse in Cairo in the middle of the night of Wednesday, the eighth of the month of Sha'ban in the year eight hundred and six, at the age of eighty-one years and three months less a few days. Sheikh Shihab al-Din al-Dhahabi (1) prayed over him, and he was buried at Bab al-Barqiyyah. (2) Ibn Hajar eulogized him in a long poem starting with:\nA calamity that did not give respite for choking .. Made tears a neighbor to the eye-sockets (3)\nAmong the curiosities is what Ibn Hajar also said in the biography of Ibn al-Mulaqqin in Inba' al-Ghumr (4): \"These three: Al-Iraqi, Al-Bulqini, and Ibn al-Mulaqqin were the wonder of this age at the head of the century. The first in the knowledge of Hadith and its arts, the second in expansion in the knowledge of the Shafi'i school, and the third in the abundance of compositions. It was destined that each one of the three was born a year before the other, and died a year before him. The first of them, Ibn al-Mulaqqin, was born in year twenty-three and died in year eight hundred and four. Al-Bulqini was born in year twenty-four and died in year eight hundred and five. And Al-Iraqi was born in year twenty-five and died in year eight hundred and six.\" End quote. May Allah have wide mercy on them and dwell them in His vast gardens.\n\nThe Second Section: Study of the Book\n\nFirst Demand: Verification of the Book's Name\nAl-Hafiz Al-Iraqi did not state a specific name for his explanation of Jami' al-Tirmidhi in the introduction, but the name \"Takmilat Sharh al-Tirmidhi\" (Completion of the Explanation of Al-Tirmidhi) appeared on the cover of",
    "foot_note": "1. He is Ahmad ibn al-Jawban al-Dhahabi al-Dimashqi, the skilled writer, died in the year 816 AH. (See: Al-Daw' al-Lami' (1/268).\n2. See: Dhayl al-Durar al-Kaminah (p. 145), Al-Majma' al-Mu'assis (2/188), Inba' al-Ghumr (2/277), Al-Dalil al-Shafi (1/409), and Al-Daw' al-Lami' (4/177).\n3. See: Inba' al-Ghumr (2/278-279).\n4. (2/318-319).",
    "book_id": "686",
    "new_page_number": 31
  },
  {
    "serial_number": "3345907",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 126,
    "volume_number": 1,
    "text": "the manuscript copy of the book (1). Ibn Hajar (2), Ibn Qadi Shuhbah (3), Ibn Fahd (4), and Al-Suyuti (5) named it so. It is a name corresponding to reality; for Al-Iraqi explained Jami' al-Tirmidhi from where Ibn Sayyid al-Nas stopped in his explanation named \"Al-Nafh al-Shadhi\". Some named it briefly: \"Sharh al-Tirmidhi\". (6)\n\nSecond Demand: Documentation of the Book's Attribution to its Author\nThere is no doubt in attributing this book to its author; for the following reasons:\n1. The existence of parts of the book's copy in the handwriting of the explainer, and the presence of the explainer's name on the cover of all available manuscript copies. (7)\n2. The explainer referred to this book of his in his other works. For example, he referred in his book Al-Taqyid wa al-Idah (8) where he discussed the hadith of the helmet (Mighfar) briefly, then said: \"And I have clarified that in Sharh al-Tirmidhi.\" End quote. His speech on this exists in the Chapters of Jihad, Chapter on What Came regarding the Helmet.\n3. Many people of knowledge quoted from this book. Among those who quoted from it are Ibn Hajar in Fath al-Bari, Al-Ayni in Umdat al-Qari, Al-Suyuti in Uqud al-Zabarjad, Al-Munawi in",
    "foot_note": "1. See: The Suleymaniye copy number (512).\n2. In Al-Majma' al-Mu'assis (2/182).\n3. In Tabaqat al-Shafi'iyyah (4/31).\n4. In Lahz al-Alhaz (p. 232).\n5. In Dhayl Tabaqat al-Huffaz (p. 371).\n6. See: Durrat al-Hijal (3/113), and Fath al-Bari (2/330, 411, and 3/27).\n7. The Suleymaniye copy (No. 511), and the Feyzullah Efendi copy (No. 364). Both are in the handwriting of the explainer, and it was written on their title pages: \"In the handwriting of its author Al-Hafiz Al-Iraqi\". See also Suleymaniye (No. 513).\n8. (p. 87).",
    "book_id": "686",
    "new_page_number": 32
  },
  {
    "serial_number": "3345908",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 127,
    "volume_number": 1,
    "text": "Fayd al-Qadir, and Al-Shawkani in Nayl al-Awtar. I compared some texts quoted by Al-Munawi from Sharh al-Tirmidhi, and found them exactly as they are in this book. (1)\n4. The mention by his biographers that he has a book explaining Al-Tirmidhi with which he completed the explanation of Ibn Sayyid al-Nas. (2)\n\nThird Demand: The Subject of the Book\nThe book is an explanation of Jami' al-Tirmidhi, except that Al-Iraqi explained it from where Ibn Sayyid al-Nas stopped in his explanation named: \"Al-Nafh al-Shadhi\". Al-Iraqi said in the introduction of his explanation: \"... but death overtook him before its completion ..., and the last I saw of it in his handwriting was his explanation of part of 'Chapter on What Came that the Earth is All a Mosque Except the Graveyard and the Bathhouse' ..., so I began building upon it from the beginning of this chapter.\" (3)\nAl-Iraqi also died before completing it. Ibn Fahd said: Takmilat Sharh Jami' al-Tirmidhi (Completion of the Explanation of Jami' al-Tirmidhi) for Ibn Sayyid al-Nas, which is from 'Chapter on What Came that the Earth is All a Mosque Except the Graveyard and the Bathhouse' to his saying during the Book of Righteousness and Relations: 'Chapter on What Came Regarding Covering for Muslims', thirteen volumes. He fair-copied from that up to the middle of Fasting, nearly six volumes. (4)\nThe apparent meaning of Ibn Fahd's statement is that Al-Iraqi did not explain the chapter of Covering for Muslims, but stopped at it,",
    "foot_note": "1. See: Fath al-Bari (2/330, 411, and 3/27), Umdat al-Qari (6/131, 175, 208), and (10/83). Uqud al-Zabarjad (1/149, 224), Fayd al-Qadir (1/82), (2/480), (5/228), and (6/51), Nayl al-Awtar (2/80, 148, 152). The texts quoted by Al-Munawi, I researched in Takmilat Sharh al-Tirmidhi and found them textually in Takmilat Sharh al-Tirmidhi respectively in: Chapter on What Came regarding Opening (fighting) with the Poor Muslims, Chapter on What Came regarding Bells on Horses, Chapter on What Came regarding Betting, and Chapter on What Came regarding Consultation.\n2. See for example: Al-Majma' al-Mu'assis (2/182), Tabaqat al-Shafi'iyyah by Ibn Qadi Shuhbah (4/31), Lahz al-Alhaz (p. 232), Al-Daw' al-Lami' (4/173), and Dhayl Tabaqat al-Huffaz by Al-Suyuti (p. 371).\n3. Takmilat Sharh al-Tirmidhi (Vol 1/ f 2/ a) from the Escorial copy.\n4. Lahz al-Alhaz (p. 232).",
    "book_id": "686",
    "new_page_number": 33
  },
  {
    "serial_number": "3345909",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 128,
    "volume_number": 1,
    "text": "meaning by completing the explanation of the chapter before it, which is the Chapter on What Came regarding the Compassion of a Muslim for a Muslim. This is consistent with what appeared on the title page of the copy preserved in the Suleymaniye Library under number (513): \"The last of Sharh al-Tirmidhi by Al-Hafiz Al-Iraqi from the Chapter on Steadfastness in Fighting from Jihad to the Chapter on What Came regarding the Compassion of a Muslim, which is the last the explainer reached, and he did not complete the book.\"\nThis explanation has reached us, so praise and favor belong to Allah.\n\nFourth Demand: On the Explanations of Jami' al-Tirmidhi, and the Position of Al-Iraqi's Explanation Among Them:\n\nFirst: Explanations of Jami' al-Tirmidhi (1):\nThe Jami' of Imam Al-Tirmidhi is one of the collections of Sunnah on which Islam revolves, hence it enjoyed the attention of scholars, so more than one explained it. Among its explanations:\n1. Aridat al-Ahwadhi (2) in Explanation of Sunan al-Tirmidhi by Judge Abu Bakr Muhammad ibn Abdullah al-Ishbili, al-Maliki, known as Ibn al-Arabi, who died in the year 543 AH. It is a medium explanation, its author focused on rulings deduced from hadiths, and jurisprudential issues focusing on the opinions of the Malikis. He did not pay attention to the Takhrij of Al-Tirmidhi's hadiths, nor what Al-Tirmidhi refers to in",
    "foot_note": "1. See: Introduction to Tuhfat al-Ahwadhi (1/180-190), Al-Imam Al-Tirmidhi and his methodology in his book Al-Jami' by 'Addab al-Hamash (1/39-45), Introduction of the verifier of Al-Nafh al-Shadhi (1/70-85), and Al-Ahadith al-Hisan al-Ghara'ib by Abd al-Bari al-Ansari (69-74).\n2. Ibn Khallikan said: \"And the meaning of Aridat al-Ahwadhi: Al-Aridah is the ability to speak, it is said: So-and-so is strong of Aridah if he is capable of speech. Al-Ahwadhi is the one light in a thing due to his skill. Al-Asma'i said: The one striving in matters, overcoming them, from whom nothing of them escapes. It is with Fatha on the Hamza, Sukun on the un-dotted Ha, Fatha on the Waw, Kasra on the dotted Dhal, and at its end is a stressed Ya. (Wafiyat al-A'yan 3/424). Sa'id A'rab commented on Ibn Khallikan, saying: It is an interpretation contrary to what the context of his speech indicates in more than one place in this book, that it means what occurs to the mind from the meanings of the Book. (Ma'a al-Qadi Abi Bakr Ibn al-Arabi p. 137).",
    "book_id": "686",
    "new_page_number": 34
  },
  {
    "serial_number": "3345910",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 129,
    "volume_number": 1,
    "text": "the chapter, and he sometimes mentions the grade of the hadith. He might gather chapters that have one meaning, explaining them all in one place, (1) and he might neglect some chapters (2) from the explanation. It is the oldest of his explanations that reached us, and was printed in thirteen parts in seven volumes with Jami' al-Tirmidhi.\n2. Al-Nafh al-Shadhi fi Sharh Jami' al-Tirmidhi by Al-Hafiz Abu al-Fath Muhammad ibn Muhammad ibn Sayyid al-Nas al-Ya'muri, who died in the year 734 AH. It is an extensive enjoyable explanation, except that Ibn Sayyid al-Nas ended in it during the Chapter on What Came that the Earth is All a Mosque Except the Graveyard and the Bathhouse, as Al-Iraqi mentioned in his completion. (3)\nAl-Kamal Ja'far ibn Tha'lab al-Udfuwi al-Shafi'i (d. 748 AH) said: \"He started (meaning Ibn Sayyid al-Nas) explaining Al-Tirmidhi, and had he limited himself in it to the art of Hadith regarding speaking on chains of transmission, it would have been completed. But he intended to follow his sheikh Ibn Daqiq al-Eid, so he stopped short of what he wanted.\" End quote. (4)\nIts author took care of the Takhrij of the chapter's hadiths which Al-Tirmidhi extracted or referred to, and caught up on him what he missed of hadiths. He spoke on the chain of the hadith, conditions of narrators, places of weakness and deficiency ('ilal), and paid attention to interpreting the strange vocabulary of hadith, and explaining jurisprudential issues, taking care to state the disagreement in them. (5) A piece of it was printed in two volumes with verification by Dr. Ahmad Ma'bad. (6)",
    "foot_note": "1. See for example: Aridat al-Ahwadhi (1/50-55), (2/209-218), and (5/227-281).\n2. See for example: Chapter on What Came regarding Dislike of Adhan without Wudu, Chapter on What Came There is no Zakat on Horses and Slaves, and Chapter on What Came regarding Dislike of Najsh in Sales.\n3. (Vol 1/ f 2/ a) from the Escorial copy.\n4. Al-Durar al-Kaminah (4/209). See biography of Al-Udfuwi in Al-Durar al-Kaminah (1/535).\n5. Introduction of the verifier of Al-Nafh al-Shadhi (1/92-128).\n6. The printed part ends with the tenth hadith. Our Sheikh Abd al-Rahman Salih Muhyi al-Din verified in his PhD thesis which he submitted in 1405 AH from the beginning of the book to the Chapter on Madhiy Getting on Clothes (Hadith 115). As for the remaining part, a number of researchers have undertaken its verification commissioned by the Deanship of Scientific Research at the Islamic University of Madinah; it intends to print it with Takmilat Sharh al-Tirmidhi. May Allah facilitate its printing.",
    "book_id": "686",
    "new_page_number": 35
  },
  {
    "serial_number": "3345911",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 130,
    "volume_number": 1,
    "text": "3. Takmilat Sharh al-Tirmidhi by Al-Hafiz Al-Iraqi, who died in the year 806 AH. It is the subject of this research, and I will talk about his methodology in the fifth demand. Al-Iraqi died before completing it, as preceded.\n4. Takmilat Sharh al-Tirmidhi by Wali al-Din Abu Zur'ah Ahmad ibn Abd al-Rahim al-Iraqi (d. 826 AH). Al-Munawi mentioned that Abu Zur'ah completed his father's book. (1) Dr. Ahmad Ma'bad said: \"I have not found a copy of that completion, or a quote from it.\" (2)\n5. Takmilat Sharh al-Tirmidhi by Abu al-Khayr Muhammad ibn Abd al-Rahman al-Sakhawi (d. 902 AH). Al-Sakhawi mentioned in Al-Daw' al-Lami' (3) that he authored a completion to Sharh al-Tirmidhi by Al-Iraqi, and wrote from it more than two volumes covering several pages of the text. It appears he started it from where Al-Iraqi stopped, which is the Chapter on What Came regarding the Compassion of a Muslim for a Muslim, the eighteenth chapter of the Book of Righteousness and Relations. This is sensed from the fact that when Al-Sakhawi extracted in Al-Maqasid al-Hasanah (4) hadiths in condemnation of obscenity - among them the hadith «The worst people in position on the Day of Resurrection is the one people leave for fear of his obscenity» - he said: \"And I have fully covered what is in the meaning in what I wrote of the completion of Sharh al-Tirmidhi.\" End quote. The mentioned hadith was extracted by Al-Tirmidhi in the fifty-ninth chapter of the Book of Righteousness and Relations. (5) Dr. Ahmad Ma'bad said: \"I have not found a copy of it despite diligent searching.\" (6)\n6. Sharh al-Tirmidhi by Al-Hafiz Abd al-Rahman ibn Ahmad ibn Rajab al-Hanbali (d. 795 AH). Al-Hafiz Ibn Hajar said: He authored a designated explanation of Al-Tirmidhi, and did well in it, in about twenty volumes. (7) Nothing has reached us from it except the explanation of Al-Ilal which is at the end of the Jami', and a small piece of the Book of",
    "foot_note": "1. See Al-Ujalah al-Saniyyah 'ala Alfiyat al-Sirah al-Nabawiyyah (p. 4).\n2. Introduction to the verification of Al-Nafh al-Shadhi (1/76).\n3. (8/16).\n4. (p. 350).\n5. (3/532 No. 1996).\n6. Introduction of the verifier of Al-Nafh al-Shadhi (1/76), and see Al-Hafiz Al-Sakhawi and his efforts in Hadith (1/237).\n7. Inba' al-Ghumr (1/460), and see Al-Jawhar al-Munaddad (p. 48).",
    "book_id": "686",
    "new_page_number": 36
  },
  {
    "serial_number": "3345912",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 131,
    "volume_number": 1,
    "text": "Clothing (Libas) (1). Yusuf ibn Abd al-Hadi said: \"Most of what he worked on of Sharh al-Tirmidhi was burnt in the Fitna (strife).\" (2)\nFrom the existing piece, it can be said: He extracts the hadiths of the chapter taking care to mention supporting narrations (Mutaba'at), just as he extracts the hadiths Al-Tirmidhi refers to with his saying: (And in the chapter), and adds to it those of the Companions Al-Tirmidhi did not mention, and extracts their hadiths. He takes care in extracting all these hadiths to discuss places of weakness and deficiency ('illal), and concludes the chapter by mentioning the jurisprudence of the hadith, taking care in that regarding the sayings of the early jurists. (3)\nIt is an expanded explanation. This is indicated by the fact that Ibn Rajab prolongs the discussion in the explanation of Sahih al-Bukhari on some hadiths, then says: \"We have fully covered the hadiths regarding that, and the discussion on them in Sharh al-Tirmidhi.\" (4)\nAs for the explanation of Al-Ilal at the end of the Jami', it is the utmost in verification, indispensable for the student of knowledge.\n7. Injaz al-Wa'd al-Wafi fi Sharh Jami' al-Tirmidhi by Al-Hafiz Siraj al-Din Umar ibn Ali, famous as Ibn al-Mulaqqin (d. 804 AH). A manuscript piece of it exists, (5) mostly in the author's handwriting, ending at the beginning of the Chapter on What Came regarding How to Sit in the Tashahhud from the Chapters of Prayer. It is an explanation of the additional hadiths in Jami' al-Tirmidhi over the hadiths of the Two Sahihs, and Sunan",
    "foot_note": "1. This piece from the Book of Clothing was printed with verification by Sami Jad Allah in 1439 AH.\n2. Al-Jawhar al-Munaddad (p. 49). It appears that the Fitna refers to what Tamerlane did in the year 803 AH when he attacked Damascus, made a peace treaty with its people, then betrayed them, burning the city and committing varieties of atrocities against its people. (See Al-Nujum al-Zahirah 12/190-194).\n3. See the study by Dr. Hammam Sa'id at the beginning of Sharh Ilal al-Tirmidhi by Ibn Rajab (1/277-285).\n4. Fath al-Bari (6/179).\n5. In Chester Beatty Library under number (5187), and a copy of it is with the virtuous Dr. Abdullah Abdul Aziz Al-Faleh, faculty member at the College of Noble Hadith and Islamic Studies at the Islamic University of Madinah.",
    "book_id": "686",
    "new_page_number": 37
  },
  {
    "serial_number": "3345913",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 132,
    "volume_number": 1,
    "text": "Abi Dawud. (1) Ibn Qadi Shuhbah mentioned a number of his works, including this book, then said: \"But that was not found after him; because his books were burnt shortly before his death.\" (2)\n8. Al-Arf al-Shadhi 'ala Jami' al-Tirmidhi by Abu Hafs Siraj al-Din Umar ibn Raslan, known as Al-Bulqini (d. 805 AH). Ibn Qadi Shuhbah said when mentioning his works: \"Al-Arf al-Shadhi 'ala Jami' al-Tirmidhi, he wrote a good piece of it. The reason for not completing most of his works was his busyness with duties, teaching, narrating hadith, and issuing fatwas.\" End quote. (3) Ibn Fahd mentioned that Al-Bulqini has two explanations on Al-Tirmidhi, one on craft (hadith science) and the other on jurisprudence. (4) Dr. Ahmad Ma'bad said: \"In any case, I have not found anything of what Al-Bulqini explained of Jami' al-Tirmidhi.\" (5)\n9. Sharh al-Tirmidhi by Ibn Hajar al-Asqalani (d. 852 AH). Al-Sakhawi said: \"He started it in the year eight hundred and eight in lessons when he first undertook teaching Hadith at Al-Shaykhuniyyah (6). He wrote from it the amount of a volume in draft, then his determination for it slackened. Had it been completed, it would have come in fifteen volumes, or six large volumes, according to what I read in his handwriting in two places.\" (7) Al-Suyuti, Abu al-Tayyib al-Sindi, and Dr. Ahmad Ma'bad mentioned that they did not find it. (8)",
    "foot_note": "1. See Inba' al-Ghumr (2/217).\n2. Tabaqat al-Shafi'iyyah by him (4/45).\n3. Tabaqat al-Shafi'iyyah (4/42-43).\n4. See: Lahz al-Alhaz (p. 216).\n5. Introduction to the verification of Al-Nafh al-Shadhi by Dr. Ahmad Ma'bad (1/80).\n6. Al-Madrasah al-Shaykhuniyyah in Egypt: Established by Shaykhu, Sayf al-Din al-Umari (d. 758 AH), finished its construction in the year 757 AH. (See: Husn al-Muhadarah 2/266).\n7. Al-Jawahir wa al-Durar (2/676).\n8. See: Qut al-Mughtadhi (1/15), Sharh Abi al-Tayyib al-Sindi 'ala Jami' al-Tirmidhi (1/4), and Introduction of the verifier of Al-Nafh al-Shadhi (1/81).",
    "book_id": "686",
    "new_page_number": 38
  },
  {
    "serial_number": "3345914",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 133,
    "volume_number": 1,
    "text": "10. Qut al-Mughtadhi 'ala Jami' al-Tirmidhi by Al-Hafiz Jalal al-Din Abd al-Rahman ibn Abi Bakr al-Suyuti (d. 911 AH). It is a brief explanation like a footnote. In it, Al-Suyuti paid attention to the meanings of words, their grammatical analysis, and vocalization of some names appearing in the chain and text, all in the briefest expression and most concise indication. He introduced it with a valuable introduction containing a statement of Al-Tirmidhi's condition, his status among scholars, his narrators from him, and his terminologies. (1) It was printed long ago with the explanation of Abu al-Tayyib al-Sindi in Kanpur, India in the year 1299 AH.\n11. Sharh al-Tirmidhi by Majd al-Din Muhammad ibn Tahir al-Siddiqi al-Fatani (d. 986 AH). (2) Al-Mubarakfuri (3) mentioned that he did not find it, nor does he know if he completed it or not.\n12. Hashiyat Abi al-Hasan Muhammad ibn Abd al-Hadi al-Sindi (d. 1138 AH) (4) on Jami' al-Tirmidhi. Al-Sindi's attention in it focused on explaining words and clarifying the intent. It was printed in Egypt on the margin of Jami' al-Tirmidhi. (5)\n13. Hayat al-Muhjah wa Idah al-Wujhah 'ala Sunan al-Hafiz al-Hujjah Abi Isa al-Tirmidhi by Abu al-Tayyib Muhammad ibn Abd al-Qadir al-Sindi al-Hanafi (d. 1149 AH) (6). It is more like a footnote. Al-Sindi said in its introduction: \"I sought Allah's guidance to explain an explanation that resolves all its words except what is rare.\" (7) Dr. Ahmad Ma'bad said: I did not find its author adhering to this condition of his to explain all words, or most of them; rather I found him leaving much of what",
    "foot_note": "1. See: Introduction to the verification of Al-Nafh al-Shadhi (1/82), and Al-Ahadith al-Hisan al-Ghara'ib (p. 73).\n2. He has a biography in Nuzhat al-Khawatir (1/409), and Introduction to Tuhfat al-Ahwadhi (1/189).\n3. In Introduction to Tuhfat al-Ahwadhi (1/384).\n4. His biography in Al-A'lam by Al-Zirikli (6/253).\n5. See: Introduction to Tuhfat al-Ahwadhi (1/190).\n6. Introduction to the verification of Al-Nafh al-Shadhi (1/82-83).\n7. Sharh Abi al-Tayyib al-Sindi (1/5).",
    "book_id": "686",
    "new_page_number": 39
  },
  {
    "serial_number": "3345915",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 134,
    "volume_number": 1,
    "text": "previous [scholars] explained ... just as he extracts what Al-Tirmidhi referred to by his saying in the chapter, and sometimes leaves it.\" (1) It was printed long ago with Qut al-Mughtadhi in Kanpur, India in the year 1299 AH.\n14. Hashiyat Ahmad Ali ibn Lutf Allah al-Saharanpuri (d. 1297 AH) (2) on Jami' al-Tirmidhi. It is extremely brief, including clarification of strange hadith and vocalization of its words. It was printed on the margin of the Sunan with Naf' Qut al-Mughtadhi, and Al-Arf al-Shadhi by Al-Saharanpuri in one large volume.\n15. Naf' Qut al-Mughtadhi by Ali ibn Sulayman al-Daminti al-Maghribi (d. 1306 AH). (3) It is an abridgment of Al-Suyuti's explanation \"Qut al-Mughtadhi\". Printed.\n16. Al-Kawkab al-Durri 'ala Jami' al-Tirmidhi by Rashid Ahmad al-Kankuhi (d. 1323 AH) (4). His student Muhammad Yahya ibn Muhammad Isma'il al-Kandahlawi (d. 1334 AH) collected it from his teachings. It is more like notes than an explanation; most of it relates to meanings of hadiths and answering objections against the Hanafi school. (5) It was printed in four volumes.\n17. ... Al-Arf al-Shadhi 'ala Jami' al-Tirmidhi by Muhammad Anwar Shah al-Kashmiri (d. 1352 AH). (6) The book is originally comments written by his student Muhammad Chiragh Ali from the dictation of his sheikh Al-Kashmiri during his explanation of the Jami'. His main concern is with the evidences of the Hanafis, and answering objections against the Hanafi school. It was printed in Pakistan with some footnotes on Jami' al-Tirmidhi.",
    "foot_note": "1. Introduction to the verification of Al-Nafh al-Shadhi (1/83).\n2. His biography in Juhud Mukhlisah (p. 89).\n3. He has a biography in Al-A'lam by Al-Zirikli (5/121), and Hadiyat al-Arifin (1/776).\n4. He has a biography in Juhud Mukhlisah (p. 223).\n5. See: Nazarat fi al-Hadith al-Nabawi (p. 169-170), and Al-Ahadith al-Hisan al-Ghara'ib (p. 74).\n6. He has a biography in Juhud Mukhlisah (p. 232-235).",
    "book_id": "686",
    "new_page_number": 40
  },
  {
    "serial_number": "3345916",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 135,
    "volume_number": 1,
    "text": "18. Tuhfat al-Ahwadhi Sharh Jami' al-Tirmidhi by the Allamah Muhammad Abd al-Rahman ibn Abd al-Rahim al-Mubarakfuri (d. 1353 AH). (1) It is a comprehensive explanation. He introduced it with an introduction in the style of Hady al-Sari by Al-Hafiz Ibn Hajar, in which he spoke about the science of Hadith and the various works authored in it, and also spoke about Al-Tirmidhi and his Jami' in detail. He paid attention to the Hadith craft (Sina'ah) by briefly giving biographies of the chain's narrators, extracting the chapter's hadiths, and what Al-Tirmidhi refers to by saying: (And in the chapter). He sometimes mentions some hadiths Al-Tirmidhi missed, clarifies problems in chains and texts, and deals with jurisprudential rulings deduced from the hadith while stating the sayings of scholars regarding them, mentioning their evidences, and discussing them. He cares about stating the difference of copies in Imam Al-Tirmidhi's ruling on the hadith, except that he rarely cares to explain the reasons for those rulings. (2)\n19. Al-Tib al-Shadhi 'ala Jami' al-Tirmidhi by Ashfaq al-Rahman al-Kandahlawi (d. 1377 AH). (3) Its author took care of the biography of the chain's narrators and explaining words, and explaining the Hanafi school thoroughly, supporting it after clarifying other schools. At the beginning of the book is an introduction comprising the history of recording Hadith, biography of Imam Al-Tirmidhi, his terminologies, and some principles of Hadith sciences. The first part was printed in the year 1344 AH by the Khayriyyah Press in Egypt under the supervision of Sheikh Ashiq Ilahi al-Miruti.\n20. Ma'arif al-Sunan by Muhammad Yusuf ibn Muhammad Zakariya al-Binnuri (d. 1397 AH). (4) He takes care",
    "foot_note": "1. He has a biography at the end of the introduction to Tuhfat al-Ahwadhi by Abu al-Fadl Abd al-Sami' al-Mubarakfuri (p. 615-635/ Beirut Edition), and in \"Juhud Mukhlisah fi Khidmat al-Sunnah al-Mutahharah\" by Al-Faryawa'i (p. 146-150).\n2. See what Abu al-Fadl Abd al-Sami' al-Mubarakfuri wrote (p. 627-628), and Al-Ahadith al-Hisan al-Ghara'ib (p. 73-74).\n3. See Tarikh al-Turath al-Arabi (1/303), and Juhud Mukhlisah (p. 236), and he has a biography there.\n4. He has a biography in Juhud Mukhlisah (p. 237), and at the beginning of the first part of Ma'arif al-Sunan by Dr. Abd al-Razzaq Iskandar (d-h).",
    "book_id": "686",
    "new_page_number": 41
  },
  {
    "serial_number": "3345917",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 136,
    "volume_number": 1,
    "text": "of explaining strange words, prolongs discussion in jurisprudential issues, cares to mention the four schools, and supports the Hanafi school in all issues with all his might. He might address some terminological issues. He benefited in it from the researches of his sheikh Muhammad Anwar Shah al-Kashmiri. He does not address defining the chain's narrators unless there is a need, nor extraction (Takhrij) except rarely. (1) It is noted on this explanation that its author transgresses against some people of knowledge in it, among them: Allamah Ibn Taymiyyah (2), Ibn al-Qayyim (3), and Al-Mubarakfuri (4). Indeed, he cares greatly about refuting Al-Mubarakfuri, and venerates the likes of Ibn Arabi the Sufi (5), and Al-Kawthari (6). Six volumes of it were printed, ending at the last chapters of Hajj.\n\nSecond: The Position of Al-Iraqi's Explanation Among Explanations of Al-Tirmidhi:\nLooking at the explanations of Al-Tirmidhi, it becomes clear that the most important of them are the explanation of Ibn al-Arabi, the explanation of Ibn Sayyid al-Nas, its completion by Al-Iraqi, its completion by Abu Zur'ah and Al-Sakhawi, the explanation of Ibn Rajab, and the explanation of Al-Mubarakfuri.\nAs for Ibn al-Arabi's explanation, it is a brief explanation, in which the Hadith craft is absent except rarely, but it won by virtue of precedence; for how many sayings of his were relied upon by those who came after him.\nAs for Ibn Rajab's explanation, nothing reached us except a piece of it, which heralds its expansiveness and abundance of material. To Allah is the complaint.\nAs for Al-Mubarakfuri's explanation, it is late; mostly relying on those before him like Ibn Hajar and Al-Shawkani, but it is the most extensive complete explanation of Jami' al-Tirmidhi, and its author is distinguished by adherence to the Sunnah. Ibn Sayyid al-Nas did not complete",
    "foot_note": "1. See Ma'arif al-Sunan (1/2).\n2. See the same source (4/413).\n3. See the same source (1/387), and (4/412-413).\n4. See the same source (1/27, and 28).\n5. Same source (2/69).\n6. Same source (1/17), and (4/138).",
    "book_id": "686",
    "new_page_number": 42
  },
  {
    "serial_number": "3345918",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 137,
    "volume_number": 1,
    "text": "his explanation, so Al-Iraqi built his explanation upon it. Thus they are tantamount to one book. Al-Iraqi followed his methodology, and surpassed him in expansion and editing.\nAl-Shawkani said about Ibn Sayyid al-Nas's explanation: \"It is enjoyable in all that he discussed of the art of Hadith and others... Then he said: And when I stood upon the part of the explanation of Al-Tirmidhi which follows this part by Zain al-Iraqi, that dazzled me, and I saw it degrees above what the owner of the biography [Ibn Sayyid al-Nas] explained.\" (1)\nHe also said about Al-Iraqi's explanation: \"It is a comprehensive enjoyable explanation, containing benefits not found elsewhere, especially in speaking on the hadiths of Al-Tirmidhi, and all that he refers to in the chapter, and in reporting schools of thought in a strange style and wondrous manner.\" (2)\nClarifying its status is that everyone who stood upon this book scooped from its seas, like Ibn Hajar in Fath al-Bari, Al-Ayni in Umdat al-Qari, Al-Suyuti in Uqud al-Zabarjad, Al-Munawi in Fayd al-Qadir, and Al-Shawkani in Nayl al-Awtar (3). In the next section, his methodology will be explained, heralding its good arrangement and abundance of material.\n\nFifth Demand: The Author's Methodology in His Explanation\nAspects of Al-Hafiz Al-Iraqi's methodology in his explanation can be extracted in the following points:\n1 - He mentions the text of the chapter from Jami' al-Tirmidhi completely without any change before starting the explanation, which made it like a copy of the copies of the Jami', useful when differences occur in the copies of the Jami', especially in Al-Tirmidhi's rulings on the hadith.",
    "foot_note": "1. Al-Badr al-Tali' (p. 767).\n2. Same source (p. 362).\n3. See: Fath al-Bari (2/330, 411, and 3/27), Umdat al-Qari (6/131, 175, 208), and (10/83). Uqud al-Zabarjad (1/149, 224), Fayd al-Qadir (1/82), (2/480), (5/228), and (6/51), Nayl al-Awtar (2/80, 148, 152).",
    "book_id": "686",
    "new_page_number": 43
  },
  {
    "serial_number": "3345919",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 138,
    "volume_number": 1,
    "text": "2 - Al-Iraqi's explanation is considered among the objective explanation books that divide the explanation of the hadith into objective paragraphs, and speak on each paragraph separately. Al-Iraqi begins the explanation of the chapter by saying: \"Discussion on it is from [several] aspects/faces,\" then details that. The least found of these aspects is one aspect (1), and sometimes it reaches more than twenty aspects (2).\n3 - He usually makes the first aspect for extracting the hadiths that Al-Tirmidhi connected (Isnad), then those he referred to.\n4 - He usually makes the second aspect for mentioning hadiths related to the chapter from what Al-Tirmidhi did not mention if the explainer found them. He first lists the names of the Companions who have hadiths, saying: The second in the chapter from what he did not mention from so-and-so, and so-and-so... Then he extracts them hadith by hadith, saying: As for the hadith of so-and-so, so-and-so extracted it from the narration of so-and-so, and mentions its text. And so on.\n5 - If the chapter's hadith is among what the authors of the Six Books extracted, or one of them, he extracts it from them, and takes care to exhaust its paths in them, and prioritizes mentioning the one who is most complete in following Al-Tirmidhi. If the chapter's hadith is not with anyone of the authors of the Six Books, he says: The author was unique with it. He often limits himself to this unless there is a benefit in the chain or text, then he extracts it from others. It should be known that the explainer, if he extracts a hadith from the Six Books, intends the place of witness from it, not its origin.\n6 - If the hadiths Al-Tirmidhi referred to, or those the explainer caught up on, are from the Six Books, he extracts them from them; otherwise he extracts them usually from the Musnads of Ahmad, Abu Ya'la, Al-Bazzar, and the three Mu'jams of Al-Tabarani.",
    "foot_note": "1. See explanation of the Chapter on What Came regarding Leaving during Panic from the Chapters of Jihad.\n2. See explanation of the Chapter on What Came regarding Betting from the Chapters of Jihad, and in it are twenty-one aspects.",
    "book_id": "686",
    "new_page_number": 44
  },
  {
    "serial_number": "3345920",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 139,
    "volume_number": 1,
    "text": "7 - If the hadith is long, he suffices with mentioning the witness from it.\n8 - He judges the hadiths either generally or in detail.\n9 - He sometimes explains the reasons for Al-Tirmidhi's rulings on the hadith, and devotes a separate aspect for that.\n10 - He sometimes mentions the difference of narrators in the chain or the text.\n11 - He alerts to the difference occurring between copies of the Jami' if necessary.\n12 - If the narrator whose hadith Al-Tirmidhi extracted is among those with few narrations, he mentions what hadiths he has in Jami' al-Tirmidhi and in the rest of the Six Books, and devotes a separate aspect for this.\n13 - He speaks on the narrators regarding impugning and validation (Jarh wa Ta'dil), especially those spoken about, and upon whom the pivot was. He may generalize or detail.\n14 - He takes care to clarify the neglected (Muhmal) among narrators, the one named by Kunya, the ambiguous (Mubham), and the Agreed and Separated (Muttafaq wa Muftaraq).\n15 - He takes care to interpret strange words, and often mentions his source from books of Gharib and language, such as Al-Sihah by Al-Jawhari, Al-Nihayah by Ibn al-Athir, and Al-Muhkam by Ibn Sidah, and devotes a separate aspect for that.\n16 - He takes care to speak on the rulings deduced from the hadith. If there is disagreement among the people of knowledge, he mentions it. He is concerned with mentioning the faces (awjuh) in the Shafi'i school, relying in that mostly on Al-Umm by Al-Shafi'i, Al-Wasit by Al-Ghazali, Al-Aziz by Al-Rafi'i, and Rawdat al-Talibin by Al-Nawawi, and cares for the preferences of Al-Rafi'i and Al-Nawawi.\n17 - He sometimes presents potential objections to the ruling deduced from the hadith, then answers them.\n18 - He takes care to reconcile between hadiths whose appearance is contradiction, and makes a separate aspect for that.\n19 - In case the chapter's hadiths do not suit the chapter heading, he alerts to that.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 45
  },
  {
    "serial_number": "3345921",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 140,
    "volume_number": 1,
    "text": "20 - He takes care to highlight Hadith rules in his explanation.\n21 - He has critiques of those scholars who preceded him, like Al-Tirmidhi, Ibn Hibban, Ibn al-Turkmani, and Al-Mizzi.\n\nSixth Demand: Some of the Author's Resources in His Explanation\nThe author relied in this explanation of his on the mother books of Hadith and its sciences, books of Tafsir, explanations, history, biographies, Fiqh, language, and others. The explanation is very large, and still a manuscript, so it is very difficult to limit his resources. But what cannot be done completely should not be left completely. So I inventoried the explanation of the Chapters of Jihad from the Messenger of Allah, peace and blessings be upon him, to recognize some of his resources.\nFrom books of Tafsir and Causes of Revelation: Asbab al-Nuzul by Al-Wahidi, Tafsir Ibn Jurayj, Tafsir Ibn Jarir al-Tabari, Tafsir Ibn Mardawayh, and Tafsir Abd ibn Humayd.\nFrom mother books of Hadith: The Six Books, Al-Muwatta', Sahih Ibn Khuzaymah, Sahih Ibn Hibban, Sahih Al-Barqani, Mustadrak Al-Hakim, Sunan Al-Daraqutni, Al-Sunan by Abu Bakr ibn Lal, Al-Sunan Al-Kubra by Al-Bayhaqi, Musnad Ahmad, Musnad Al-Darimi, Musnad Ishaq ibn Rahwayh, Musnad Al-Bazzar, Musnad Abu Ya'la al-Mawsili, Musnad Al-Harith ibn Abi Usama, Musnad al-Firdaws by Al-Daylami, the three Mu'jams of Al-Tabarani, and Ma'rifat al-Sunan wa al-Athar by Al-Bayhaqi.\nFrom Hadith parts (Ajza'): Al-Adab al-Mufrad by Al-Bukhari, Al-Jihad by Ibn Abi Asim, Al-Khil'iyyat (Fawa'id al-Khil'i), Al-Da'awat by Al-Bayhaqi, Al-Da'awat by Al-Mustaghfiri, Fawa'id Abi Bakr al-Shafi'i (known as Al-Ghilaniyyat), Mu'jam al-Shuyukh by Ibn Musdi, and Makarim al-Akhlaq by Al-Khara'iti.\nFrom books of Sirah and Shama'il: Dala'il al-Nubuwwah by Al-Bayhaqi, Al-Shama'il by Al-Tirmidhi, Al-Shama'il by Ibn al-Muqri, and Maghazi Muhammad ibn Ishaq.\nFrom books of Hadith explanations: Al-Istidhkar by Ibn Abd al-Barr, Ikmal al-Mu'lim by Qadi Iyad,",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 46
  },
  {
    "serial_number": "3345922",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 141,
    "volume_number": 1,
    "text": "and Al-Tamhid by Ibn Abd al-Barr, Sharh Sahih al-Bukhari by Ibn Battal, Sharh Sahih Muslim by Al-Nawawi, Ma'alim al-Sunan by Al-Khattabi, and Al-Mufhim by Abu al-Abbas al-Qurtubi.\nFrom books of History and Biographies: Al-Isti'ab by Ibn Abd al-Barr, Al-Alqab by Al-Shirazi, Al-Tarikh al-Awsat by Al-Bukhari, Tarikh Baghdad by Al-Khatib al-Baghdadi, Al-Tarikh al-Kabir by Al-Bukhari, Tarikh Marw by Al-Ma'dani, Tarikh Naysabur by Al-Hakim, Al-Tanbih 'ala Awham al-Isti'ab by Ibn Fathun, Tahdhib al-Kamal by Al-Mizzi, Thiqat Ibn Hibban, Al-Jarh wa al-Ta'dil by Ibn Abi Hatim, Al-Huruf fi Asma' al-Sahabah by Abu Ali Ibn al-Sakan, Al-Dhayl 'ala al-Isti'ab by Ibn Fathun, Du'afa' Al-Uqayli, Tabaqat Ibn Sa'd, Al-Ibar by Al-Dhahabi, Al-Kamil by Ibn Adi, Al-Kamal by Abd al-Ghani al-Maqdisi, Al-Ma'arif by Ibn Qutaybah, Ma'rifat al-Sahabah by Ibn Mandah, Kuna Abi Ahmad al-Hakim, and Al-Kuna by Ibn al-Jarud.\nFrom books of Atraf, Ilal, and Terminology: Atraf Ibn Asakir, Atraf Al-Mizzi (Tuhfat al-Ashraf), Al-Afrad by Al-Daraqutni, Al-Durr al-Naqi (known as Al-Jawhar al-Naqi) by Ibn al-Turkmani, Ilal Al-Daraqutni, Al-Ilal al-Munfarid 'an al-Jami' by Al-Tirmidhi, Ulum al-Hadith by Ibn al-Salah, Al-Kifayah by Al-Khatib, and Al-Muttafaq wa al-Muftaraq by him.\nFrom books of Fiqh: Al-Umm by Al-Shafi'i, Al-Khilafiyyat by Al-Bayhaqi, Rawdat al-Talibin by Al-Nawawi, Sharh al-Muhadhdhab (Al-Majmu') by Al-Nawawi, Al-Mukhtasar by Al-Muzani, Minhaj al-Talibin by Al-Nawawi, Al-Muhimmat by Al-Isnawi, Al-Aziz by Al-Rafi'i, and Al-Wasit by Al-Ghazali.\nFrom books of Language and Gharib: Al-Dhayl 'ala al-Gharibayn by Abu Musa al-Madini (Al-Majmu' al-Mughith), Al-Sihah by Al-Jawhari, Al-Kamil by Al-Mubarrad, Al-Muhkam by Ibn Sidah, Al-Mashariq by Qadi Iyad, and Al-Nihayah by Ibn al-Athir.\nAmong these resources are what is considered lost now, like Atraf Ibn Asakir, Al-Alqab by Al-Shirazi, Tarikh Marw by Al-Ma'dani, Tarikh Naysabur by Al-Hakim, Tafsir",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 47
  },
  {
    "serial_number": "3345923",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 142,
    "volume_number": 1,
    "text": "Ibn Mardawayh, Tafsir Abd ibn Humayd, Al-Tanbih 'ala Awham al-Isti'ab by Ibn Fathun, Al-Huruf fi Asma' al-Sahabah by Abu Ali Ibn al-Sakan, Al-Dhayl 'ala al-Isti'ab by Ibn Fathun, Al-Sunan by Abu Bakr ibn Lal, Sahih Al-Barqani, Al-Da'awat by Al-Mustaghfiri, Al-Shama'il by Ibn al-Muqri, Al-Kuna by Ibn al-Jarud, and Mu'jam al-Shuyukh by Ibn Musdi. Some of them may be manuscripts in the libraries of the world.\n\nSeventh Demand: Mention of the Existing Manuscript Copies of the Book\nThe book has multiple copies; some in the author's handwriting, some in his students' handwriting, and some late. I will mention what was found of its copies in summary.\n1 - The copy preserved in the Escorial Library in Spain, number (1464), its photocopy is in the Library of the Islamic University number (1296). It begins from the start of Al-Iraqi's completion, and ends during the Chapter on What Came regarding Humility in Prayer.\n2 - The copy preserved in Al-Maktabah al-Mahmudiyyah in Madinah, number (512), number of folios (278). It begins from the start of the book to the end of Chapters of the Two Eids. It is in the handwriting of Al-Hafiz Ibn Hajar.\n3 - The copy preserved in Al-Maktabah al-Mahmudiyyah number (536), number of folios (395). It contains a large part of Ibn Sayyid al-Nas's explanation, then the first part of Al-Hafiz Al-Iraqi's completion, which begins from folio (78/a) to the end of the copy.\n4 - The copy preserved in Al-Maktabah al-Mahmudiyyah in Madinah number (537/1), number of folios (193). It begins from the start of the Book of Fasting, and ends with the end of the Book of Hajj.\n5 - The copy preserved in Al-Maktabah al-Mahmudiyyah number (537/2), number of folios (196). It begins from the start of the Chapters of Breastfeeding, and ends with the conclusion of the Book of Fawa'id and Ahkam.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 48
  },
  {
    "serial_number": "3345924",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 143,
    "volume_number": 1,
    "text": "6 - The copy preserved in the General Library in Rabat, number of folios (265), its photocopy is in the Library of the Islamic University number (3010). It begins from the start of Chapters of Funerals, and ends at the Chapter on What Came regarding Dislike of Women Going Out in Adornment from the Book of Breastfeeding.\n7 - The copy preserved in the Egyptian National Library number (2504), number of folios (256). It is in the handwriting of Al-Hafiz Al-Iraqi. It begins from the Chapter on Dislike of Covering the Stallion from the Book of Sales, and includes chapters from the Book of Judgments, Blood Money, Hudud, Hunting and Slaughtering, Foods, Benefits and Rulings, and Sacrifices. There is a great defect in the order of its folios.\n8 - The copy preserved in Feyzullah Efendi Library in Turkey number (363), number of folios (226). It begins during the explanation of the Chapter on What Came regarding the Imam of the Subjects from the Book of Judgments, and ends during the explanation of the Chapter on Dislike of Eating Predators with Fangs and Claws from the Book of Foods.\n9 - The copy preserved in Feyzullah Efendi Library in Turkey number (364). There is a microfilm copy of it in the Library of the Islamic University under number (9758/3). It is the completion of Al-Hafiz Al-Iraqi's copy, consisting of two hundred and seventy-six plates. It includes the explanation of chapters from the Books of Hajj, Biographies (Siyar), Virtues of Jihad, Jihad, Foods, Drinks, and Righteousness and Relations, with great mixing in the papers.\n10 - The copy preserved in the Suleymaniye Library in Turkey under number (506): There is a microfilm copy of it in the Library of the Islamic University number (1999). It consists of (215) plates. It begins from the Chapter on What Came regarding Sacrifice with Two Rams from the Chapters of Sacrifices, and ends with the Chapter on What Came regarding One Who is Martyred while in Debt from the Chapters of Jihad, except that several chapters fell from its middle.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 49
  },
  {
    "serial_number": "3345925",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 144,
    "volume_number": 1,
    "text": "11 - The copy preserved in the Suleymaniye Library in Turkey number (507), number of folios (201), its photocopy in the Library of the Islamic University number (2156). It begins from the start of Al-Iraqi's completion to the Chapter on The Man Speaking after Tashahhud from the Chapters of Prayer.\n12 - The copy preserved in the Suleymaniye Library in Turkey number (508), number of folios (230). It begins from during the explanation of (Chapter on What Came: If Night Approaches and Day Departs, the Fasting Person has Broken Fast), from the Book of Fasting, and ends during the explanation of (Chapter on What Came regarding Descending at Al-Abtah) from the Book of Hajj. It has many blank spaces in multiple places.\n13 - The copy preserved in the Suleymaniye Library in Turkey number (509), number of folios (224). It is in Al-Iraqi's handwriting. It begins from the start of the Book of Funerals, and ends with the end of the explanation of Chapter on What Came: A Woman is Not Married Over Her Paternal Aunt Nor Over Her Maternal Aunt from the Book of Marriage.\n14 - The copy preserved in the Suleymaniye Library in Turkey number (510), number of folios (226). It begins from the Chapter on What Came regarding Qunut in Witr, and ends with the explanation of the Chapter on What Came regarding Siesta on Friday. It is in the handwriting of Al-Hafiz Al-Iraqi.\n15 - The copy preserved in the Suleymaniye Library number (511): There is a microfilm copy of it in the Library of the Islamic University under number (9840/2). It is in the handwriting of Al-Hafiz Al-Iraqi, as written on the title page. It consists of two hundred and forty-five plates. It is not free from gaps, and has much striking out and correction. Also, its order is disturbed where overlap occurred between the explanation of Chapters of Jihad, Clothing, Hajj, Foods ...\n16 - The copy preserved in the Suleymaniye Library in Turkey number (512), number of folios (251). It is in the handwriting of Al-Hafiz Al-Iraqi. It begins from the Chapter on What Came regarding the Two Prostrations of Forgetfulness after Salam, and ends at the end of the explanation of Chapter on What Came: What is Recited in Witr.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 50
  },
  {
    "serial_number": "3345926",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 145,
    "volume_number": 1,
    "text": "17 - The copy preserved in the Suleymaniye Library number (513): There is a microfilm copy of it in the Library of the Islamic University under number (9840/1). It consists of three hundred plates. Its script is good and clear, except that the last six plates are in fine script, different from the first. It begins from the Chapter on What Came regarding Steadfastness in Fighting from the Chapters of Jihad, and ends with the Chapter on What Came regarding the Compassion of a Muslim from the Chapters of Righteousness and Relations. This is the last the explainer reached, as written on the title page. It is not free from gaps. At the end of the manuscript came the wording: \"I saw in the handwriting of Al-Hafiz Ibn Hajar at this place of the original: This is the last of what was found in the handwriting of our Sheikh Al-Hafiz Abu al-Fadl of Sharh al-Tirmidhi.\"\nThe book is being printed at the Deanship of Scientific Research at the Islamic University of Madinah. May Allah facilitate its printing.\n\nConclusion\nPraise be to Allah by whose grace good deeds are completed, and prayers and peace be upon the Gifted Mercy. As for what follows:\nAt the conclusion of this research, I would like to record some results and recommendations that appeared to me during the research:\n• Al-Hafiz Abu al-Fadl Zain al-Din al-Iraqi (725 - 806 AH) was among the major Hadith scholars in the eighth Hijri century. He studied under the major scholars of his time without differentiation between Shafi'i, Hanafi, Maliki, and Hanbali. Likewise, students of knowledge studied under him without differentiation, because their concern was to seek knowledge from his spring. The people of knowledge in our time should follow this methodology; for it is a successful methodology and effective cure. Hateful partisanship has been noticed recently in some countries, so to Allah is the complaint.\n• A single word from the teacher may be a reason for brilliant success in the life of a student of knowledge if it comes from good intention. The word of Al-Izz Ibn Jama'ah had a visible effect on Al-Iraqi's scientific life, and changed the course of his scientific life until he became one of the major Hadith scholars",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 51
  },
  {
    "serial_number": "3345927",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 146,
    "volume_number": 1,
    "text": "in the eighth century, and raised a blessed generation of Hadith scholars, at the head of whom were Al-Hafiz Ibn Hajar, Abu Zur'ah al-Iraqi, and Nur al-Din al-Haythami.\n• Al-Hafiz Al-Iraqi was widely read, and he was good at criticism - when necessary - of scholars who preceded him with great politeness and complete humility. His scientific personality appears in his critiques and criticisms.\n• Takmilat Sharh al-Tirmidhi is the best explanation on Jami' al-Tirmidhi, although it was not completed, but most of the major explainers who came after him scooped from it.\n• Al-Iraqi began his explanation from where Ibn Sayyid al-Nas stopped in his explanation named: \"Al-Nafh al-Shadhi\". So he began his explanation from \"The Chapter on What Came that the Earth is All a Mosque Except the Graveyard and the Bathhouse\", but he reached in his explanation to \"The Chapter on the Compassion of a Muslim for a Muslim\" from the Chapters of Righteousness and Relations. Half of the book remained which he did not cover with explanation, and death overtook him before its completion. His son Abu Zur'ah completed it, and Al-Sakhawi also completed it, according to what biographical books mentioned, but locating their completions was not facilitated. Researchers should search for them in the libraries of the world, or proficient specialists should complete it according to Al-Iraqi's methodology in his explanation; for the path of completing the works of predecessors is a path practiced by the people of knowledge since ancient times, and Al-Iraqi's explanation is a magnificent example of this path.\n• Studies and researches written about Al-Iraqi did not benefit from this explanation in highlighting Al-Iraqi's scientific personality, even though it is a great effort that took years of his life. It is recommended to highlight his scientific personality through this book in researches and scientific theses.\nI ask Allah Almighty to grant us success to what He loves and pleases.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 52
  },
  {
    "serial_number": "3345928",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 147,
    "volume_number": 1,
    "text": "Sources and References\n1. Ithaf al-Sadah al-Muttaqin bi-Sharh Ihya' Ulum al-Din: by Al-Zabidi, Muhammad ibn Muhammad al-Husayni. Beirut: Mu'assasat al-Tarikh al-Arabi, 1414 AH.\n2. Al-Ahadith al-Hisan al-Ghara'ib by Abd al-Bari ibn Hammad al-Ansari, PhD thesis at the College of Noble Hadith at the Islamic University of Madinah.\n3. Al-I'lam bi-man fi Tarikh al-Hind min al-A'lam al-Musamma bi-\"Nuzhat al-Khawatir wa Bahjat al-Masami' wa al-Nawazir\": Abd al-Hayy ibn Fakhr al-Din al-Hasani. 1st ed., Beirut: Dar Ibn Hazm, 1420 AH - 1999 AD.\n4. Al-A'lam: by Khayr al-Din al-Zirikli. 5th ed., Beirut: Dar al-Ilm li-l-Malayin, 1980 AD.\n5. Al-Imam al-Tirmidhi, wa Manhajuhu fi Kitabihi al-Jami': by 'Addab Mahmud al-Hamash. 1st ed., Amman: Dar al-Fath for Studies and Publishing - Jordan, 1423 AH.\n6. Inba' al-Ghumr bi-Abna' al-'Umr: by Ibn Hajar. Verification: Hasan Habashi, Egypt: Ministry of Awqaf, 1418 AH.\n7. Al-Badr al-Tali' bi-Mahasin man ba'd al-Qarn al-Sabi': by Muhammad ibn Ali al-Shawkani (1250 AH). Verification: Husayn ibn Abdullah al-Amri, 1st ed., Beirut: Dar al-Fikr al-Mu'asir, 1419 AH.\n8. Tarikh Ibn Qadi Shuhbah. Verification: Adnan Darwish, Damascus: The French Scientific Institute for Arab Studies, 1997 AD.\n9. Tarikh al-Turath al-Arabi: by Fuat Sezgin. Translation: Mahmud Fahmi Hijazi, Riyadh: Imam Muhammad bin Saud Islamic University, 1411 AH.\n10. Al-Tarikh: by Abu al-Abbas Ahmad ibn Hijji al-Dimashqi (816 AH). Commentary: Abu Yahya Abdullah al-Kandari, 1st ed., Beirut: Dar Ibn Hazm, 1424 AH.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 53
  },
  {
    "serial_number": "3345929",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 148,
    "volume_number": 1,
    "text": "11. Tuhfat al-Ahwadhi bi-Sharh Jami' al-Tirmidhi: by Abu al-Ala Muhammad Abd al-Rahman ibn Abd al-Rahim al-Mubarakfuri (d. 1353 AH). Beirut: Dar al-Kitab al-Arabi, photocopy of an Indian edition.\n12. Tadhkirat al-Huffaz: by Al-Dhahabi. Correction: Abd al-Rahman ibn Yahya al-Mu'allimi. Beirut: Dar Ihya' al-Turath al-Arabi, photocopy of the Da'irat al-Ma'arif edition, India.\n13. Ta'rif Ahl al-Taqdis bi-Maratib al-Mawsufin bi-al-Tadlis: by Ibn Hajar al-Asqalani. Verification: Dr. Ahmad ibn Ali Sayr al-Mubaraki. 3rd ed., Riyadh 1422 AH.\n14. Al-Taqyid wa al-Idah by Al-Iraqi, (Introduction of the verification by Dr. Osama al-Khayyat). 4th ed., Beirut, Dar al-Basha'ir al-Islamiyyah, 1435 AH.\n15. Al-Taqyid wa al-Idah: by Zain al-Din Abu al-Fadl Abd al-Rahim ibn al-Husayn al-Iraqi (d. 806 AH). Verification: Muhammad Raghib al-Tabbakh, 2nd ed., Beirut: Dar al-Hadith, 1405 AH.\n16. Takmilat Sharh al-Tirmidhi: by Al-Hafiz Zain al-Iraqi, (Manuscript), Suleymaniye copy (No. 511, 512, 513), and Feyzullah Efendi copy (No. 364).\n17. Al-Tanbih wa al-Iqaz lima fi Dhuyul Tadhkirat al-Huffaz: by Ahmad Rafi' al-Husayni al-Qasimi. Beirut: Dar Ihya' al-Turath al-Arabi.\n18. Juhud Mukhlisah fi Khidmat al-Sunnah al-Mutahharah: by Dr. Abd al-Rahman ibn Abd al-Jabbar al-Faryawa'i. 2nd ed., India: Salafi University-Banaras, 1406 AH.\n19. Hashiyat Abi al-Tayyib al-Sindi 'ala Jami' al-Tirmidhi. Kanpur: India, 1299 AH.\n20. Al-Hafiz Al-Sakhawi wa Juhuduhu fi al-Hadith wa Ulumihi: by Dr. Badr ibn Muhammad al-Ammash. 1st ed., Saudi Arabia: Maktabat al-Rushd, 1421 AH.\n21. Al-Hafiz Al-Iraqi wa Atharuhu fi al-Sunnah: by Dr. Ahmad Ma'bad Abd al-Karim. 1st ed., Riyadh: Adwa' al-Salaf, 1425 AH.\n22. Husn al-Muhadarah fi Tarikh Misr wa al-Qahirah: by Al-Suyuti. Verification: Muhammad Abu al-Fadl Ibrahim, 1st ed., Egypt: Dar Ihya' al-Kutub al-Arabiyyah, 1387 AH.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 54
  },
  {
    "serial_number": "3345930",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 149,
    "volume_number": 1,
    "text": "23. Durrat al-Hijal fi Asma' al-Rijal: by Abu al-Abbas Ahmad ibn Muhammad al-Miknasi, famous as Ibn al-Qadi (d. 1025 AH). Verification: Muhammad al-Ahmadi Abu al-Nur, Cairo: Dar al-Turath, and Tunis: Al-Maktabah al-Atiqah, n.d.\n24. Al-Durar al-Kaminah fi A'yan al-Mi'ah al-Thaminah: by Ibn Hajar. Beirut: Dar al-Jil.\n25. Al-Dalil al-Shafi 'ala al-Manhal al-Safi: by Abu al-Mahasin Yusuf ibn Taghribirdi (d. 874 AH). Verification: Fahim Muhammad Shaltut, Makkah Al-Mukarramah: Umm Al-Qura University.\n26. Dhayl al-Taqyid li-Ma'rifat Ruwat al-Sunan wa al-Masanid: by Al-Taqi Al-Fasi Muhammad ibn Ahmad al-Husayni (d. 832 AH). Verification: Muhammad Salih ibn Abd al-Aziz al-Murad, 1st ed., Makkah Al-Mukarramah: Umm Al-Qura University, 1411 AH.\n27. Dhayl al-Durar al-Kaminah: by Ibn Hajar al-Asqalani. Verification: Dr. Adnan Darwish. Cairo, Institute of Arabic Manuscripts, 1412 AH.\n28. Dhayl Tadhkirat al-Huffaz li-l-Dhahabi: by Abu al-Mahasin Muhammad ibn Ali al-Husayni al-Dimashqi (d. 765 AH). Beirut, Dar Ihya' al-Turath al-Arabi.\n29. Dhayl Tabaqat al-Huffaz li-l-Dhahabi: by Al-Suyuti. Beirut: Dar Ihya' al-Turath al-Arabi.\n30. Al-Dhayl 'ala al-Ibar fi Khabar man 'Abar: by Abu Zur'ah Ahmad ibn Abd al-Rahim al-Iraqi (d. 826 AH). Verification: Salih Mahdi Abbas, 1st ed., Beirut: Mu'assasat al-Risalah, 1409 AH.\n31. Dhayl Mizan al-I'tidal: by Abu al-Fadl Zain al-Din al-Iraqi, Verification: Dr. Abd al-Qayyum Abd Rabb al-Nabi. 1st ed., Makkah Al-Mukarramah, Umm Al-Qura University 1406 AH.\n32. Al-Risalah al-Mustatrafah li-Bayan Mashhur Kutub al-Sunnah al-Musharrafah: by Muhammad ibn Ja'far al-Kattani (d. 1345 AH). Care: Muhammad al-Muntasir ibn Muhammad al-Zamzami ibn Muhammad ibn Ja'far al-Kattani. 5th ed., Beirut: Dar al-Basha'ir al-Islamiyyah, 1425 AH.\n33. Raf' al-Isr 'an Qudat Misr: by Ibn Hajar. Verification: Dr. Ali Muhammad Umar. 1st ed., Cairo: Maktabat",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 55
  },
  {
    "serial_number": "3345931",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 150,
    "volume_number": 1,
    "text": "Al-Khanji, 1418 AH.\n34. Shadharat al-Dhahab fi Akhbar man Dhahab: by Shihab al-Din Abu al-Falah Abd al-Haqq ibn Ahmad ibn Muhammad al-Dimashqi, famous as Ibn al-Imad al-Hanbali (d. 1089 AH). Verification: Abd al-Qadir al-Arna'ut, and Mahmud al-Arna'ut, 1st ed., Damascus and Beirut: Dar Ibn Kathir, 1413 AH.\n35. Sharh Ilal al-Tirmidhi: by Ibn Rajab al-Hanbali. Verification: Hammam Abd al-Rahim Sa'id. 2nd ed., Riyadh: Maktabat al-Rushd, 1421 AH.\n36. Al-Daw' al-Lami' li-Ahl al-Qarn al-Tasi': by Al-Sakhawi, Beirut: Dar al-Jil.\n37. Tabaqat al-Shafi'iyyah al-Kubra: by Al-Subki Taj al-Din Abu Nasr Abd al-Wahhab ibn Ali (d. 771 AH) Verification: Abd al-Fattah Muhammad al-Hulu, and Mahmud Muhammad al-Tanahi. Cairo: Dar Ihya' al-Kutub al-Arabiyyah.\n38. Tabaqat al-Shafi'iyyah: by Abu Bakr ibn Ahmad ibn Muhammad, known as Ibn Qadi Shuhbah (d. 851 AH), Verification: Dr. Al-Hafiz Abd al-Alim Khan, 1st ed., Beirut: Dar Alam al-Kutub, 1407 AH.\n39. Tabaqat al-Shafi'iyyah: by Al-Isnawi Jamal al-Din Abd al-Rahim ibn al-Hasan (d. 772 AH). Verification: Abdullah al-Jabburi. Riyadh: Dar al-Ulum for Printing and Publishing, 1400 AH.\n40. Tarh al-Tathrib fi Sharh al-Taqrib: by Zain al-Din Abu al-Fadl Abd al-Rahim ibn al-Husayn al-Iraqi (d. 806 AH), and his son Abu Zur'ah Wali al-Din Ahmad (826 AH). Beirut: Dar Ihya' al-Turath al-Arabi, 1413 AH.\n41. Aridat al-Ahwadhi bi-Sharh Sahih al-Tirmidhi: by Ibn al-Arabi (543 AH), Beirut: Dar Ihya' al-Turath al-Arabi.\n42. Al-Ujalah al-Saniyyah 'ala Alfiyyat al-Iraqi fi al-Sunnah al-Nabawiyyah: by Muhammad Abd al-Ra'uf al-Munawi.\n43. Al-Iqd al-Thamin fi Tarikh al-Balad al-Amin: by Al-Taqi Al-Fasi. Verification: Fu'ad al-Sayyid, n.e., Cairo: Matba'at al-Sunnah al-Muhammadiyyah.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 56
  },
  {
    "serial_number": "3345932",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 151,
    "volume_number": 1,
    "text": "44. Uqud al-Zabarjad fi I'rab al-Hadith, by Jalal al-Din al-Suyuti (911 AH), Beirut: Dar al-Jil, 1414 AH.\n45. Umdat al-Qari Sharh Sahih al-Bukhari: by Badr al-Din Abu Muhammad Mahmud ibn Ahmad al-Ayni (d. 855 AH). Beirut: Dar al-Fikr, 1399 AH.\n46. Ghayat al-Nihayah fi Tabaqat al-Qurra: by Shams al-Din Muhammad ibn Muhammad ibn al-Jazari (d. 833 AH). Care: G. Bergstrasser. Cairo: Maktabat al-Mutanabbi.\n47. Fath al-Bari bi-Sharh Sahih al-Bukhari: by Ibn Hajar al-Asqalani, Egypt, Al-Maktabah al-Salafiyyah.\n48. Fath al-Bari Sharh Sahih al-Bukhari: by Ibn Rajab al-Hanbali. Verification: Tariq ibn Awad Allah, 1st ed., Dammam: Dar Ibn al-Jawzi, 1417 AH.\n49. Fath al-Mughith bi-Sharh Alfiyyat al-Hadith: by Abu Abdullah Muhammad ibn Abd al-Rahman al-Sakhawi (d. 902 AH). Verification: Ali Husayn Ali, 1st ed., Banaras: The Salafi University, 1409 AH.\n50. Fath al-Mughith by Al-Sakhawi, (Introduction of the verification by Dr. Abd al-Karim al-Khudair and Muhammad al-Fuhayd). 1st ed., Riyadh, Dar al-Minhaj 1426 AH.\n51. Fahras al-Faharis wa al-Athbat, wa Mu'jam al-Ma'ajim wa al-Mashyakhat wa al-Musalsalat: by Abd al-Hayy ibn Abd al-Kabir al-Kattani. Verification: Ihsan Abbas, 2nd ed., Beirut: Dar al-Gharb al-Islami, 1402 AH.\n52. Qut al-Mughtadhi: by Jalal al-Din al-Suyuti, Kanpur: India, 1299 AH.\n53. Kashf al-Zunun 'an Asami al-Kutub wa al-Funun. By Mustafa ibn Abdullah al-Qustantini, known as Hajji Khalifa (d. 1067 AH). Dar al-Fikr 1402 AH.\n54. Al-Lubab fi Tahdhib al-Ansab: by Izz al-Din Abu al-Hasan Ali ibn Muhammad known as Ibn al-Athir al-Jazari (d. 630 AH), Beirut: Dar Sadir, 1400 AH.\n55. Lahz al-Alhaz bi-Dhayl Tabaqat al-Huffaz: by Taqi al-Din Abu al-Fadl Muhammad ibn Muhammad ibn Muhammad",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 57
  },
  {
    "serial_number": "3345933",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 152,
    "volume_number": 1,
    "text": "ibn Fahd al-Hashimi, al-Makki (d. 871 AH), Beirut: Dar Ihya' al-Turath al-Arabi.\n56. Majma' al-Zawa'id, wa Manba' al-Fawa'id: by Abu Bakr al-Haythami. 2nd ed., Beirut: Dar al-Kitab al-Arabi, 1402 AH.\n57. Al-Majma' al-Mu'assis li-l-Mu'jam al-Mufahras: by Ibn Hajar. Verification: Yusuf Abd al-Rahman al-Mar'ashli, 1st ed., Beirut: Dar al-Ma'rifah, 1415 AH.\n58. Al-Mustadrak 'ala Mu'jam al-Mu'allifin: by Umar Rida Kahhalah. 1st ed., Beirut: Mu'assasat al-Risalah, 1406 AH.\n59. Ma'arif al-Sunan Sharh Jami' al-Tirmidhi: by Muhammad Yusuf ibn Muhammad Zakariya al-Binnuri, H. M. Saeed Company, Karachi: Adab Manzil, 1413 AH.\n60. Mu'jam al-Buldan: by Yaqut al-Hamawi. Beirut: Dar Sadir, 1397 AH.\n61. Mu'jam al-Shuyukh: by Umar ibn Fahd al-Makki (d. 885 AH). Verification: Muhammad al-Zahi, Riyadh: Dar al-Yamamah for Research, Translation and Publishing.\n62. Mu'jam al-Mu'allifin: by Umar Rida Kahhalah, 1st ed., Beirut, Mu'assasat al-Risalah 1414 AH.\n63. Al-Maqasid al-Hasanah fi Bayan Kathir min al-Ahadith al-Mushtaharah 'ala al-Alsinah: by Al-Sakhawi. Commentary: Abd al-Rahman Muhammad al-Siddiq, 1st ed., Beirut: Dar al-Kutub al-Ilmiyyah, 1399 AH.\n64. Manhaj Al-Hafiz Zain al-Din al-Iraqi fi kitabihi \"Tarh al-Tathrib\" by Muhammad Yahya Bilal Minyar, Master's thesis at Imam Muhammad bin Saud Islamic University in Riyadh.\n65. Al-Manhal al-Safi, wa al-Mustawfi ba'd al-Wafi: by Ibn Taghribirdi. Verification: Dr. Muhammad Amin, Egypt: The Egyptian General Book Organization, 1984 AD.\n66. Al-Mawa'iz wa al-I'tibar bi-Dhikr al-Khitat wa al-Athar, known as Al-Khitat al-Maqriziyyah: by Abu al-Abbas Ahmad ibn Ali al-Maqrizi (d. 845 AH), Beirut: Dar Sadir.\n67. Al-Nujum al-Zahirah fi Muluk Misr wa al-Qahirah: by Abu al-Mahasin Yusuf ibn Taghribirdi (d. 874 AH). Commentary: Muhammad Husayn Shams al-Din, 1st ed., Beirut: Dar al-Kutub al-Ilmiyyah, 1413 AH.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 58
  },
  {
    "serial_number": "3345934",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Al-Hafiz Zain al-Din al-Iraqi, and his book 'Takmilat Sharh al-Tirmidhi'",
    "edition": "None",
    "publisher": "None",
    "page_number": 153,
    "volume_number": 1,
    "text": "68. Nazarat fi al-Hadith wa fi al-Sihah al-Sittah wa Nubdhah 'an Tarikh Tadwin al-Hadith: by Abu al-Hasan al-Nadwi, 1st ed., Beirut and Damascus, Dar Ibn Kathir, 1420 AH.\n69. Al-Nafh al-Shadhi fi Sharh Jami' al-Tirmidhi: by Abu al-Fath Muhammad ibn Muhammad ibn Muhammad ibn Sayyid al-Nas al-Ya'muri (d. 734 AH), Verification: Dr. Ahmad Ma'bad Abd al-Karim, Dar al-Asimah, 1st Edition 1409 AH.\n70. Al-Nukat 'ala Kitab Ibn al-Salah: by Ibn Hajar al-Asqalani. Verification: Dr. Rabi' ibn Hadi al-Madkhali, 4th ed., Riyadh: Dar al-Rayah for Publishing and Distribution, 1417 AH.\n71. Nayl al-Awtar Sharh Muntaqa al-Akhbar: by Muhammad ibn Ali al-Shawkani (d. 1250 AH). Verification: Isam al-Din al-Sababti. 4th ed., Cairo: Dar al-Hadith, 1417 AH.\n72. Hadiyat al-Arifin, Asma' al-Mu'allifin, wa Athar al-Musannifin min Kashf al-Zunun: by Isma'il Pasha al-Baghdadi, Beirut: Dar al-Fikr, 1402 AH.\n73. Wafiyat al-A'yan, wa Anba' Abna' al-Zaman: by Abu al-Abbas Shams al-Din Ahmad ibn Muhammad ibn Abi Bakr ibn Khallikan (d. 681 AH). Verification: Ihsan Abbas, Beirut: Dar Sadir.\n74. Al-Wafiyat: by Abu al-Ma'ali Muhammad ibn Rafi' al-Salami (d. 774 AH), Verification: Salih Mahdi Abbas, 11th ed., Beirut: Mu'assasat al-Risalah, 1402 AH.",
    "foot_note": "None",
    "book_id": "686",
    "new_page_number": 59
  }
]