[
  {
    "text": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar (The Victory in the Authority of the Saying of the Righteous Companions)\nAuthor: عبد العزيز بن ريس الريس\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar (The Victory in the Authority of the Saying of the Righteous Companions)",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "new_page_number": 1
  },
  {
    "text": "sn: 3940\nbook_title: الانتصار في حجية قول الصحابة الأخيار\nbook_link: https://shamela.ws/book/271\nbook_id: 271\nauthor_name: عبد العزيز بن ريس الريس\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/3093\nauthor_ID: 3093\neditor: Null\npublisher: مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة\nedition: الأولى، 1440 ه\npages: 56\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: أصول الفقه\ncategory_id: 11",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar (The Victory in the Authority of the Saying of the Righteous Companions)",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "new_page_number": 2
  },
  {
    "serial_number": "3428239",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar (The Victory in the Authority of the Saying of the Righteous Companions)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Principles of Jurisprudence. Book: Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar. Author: Dr. Abdul Aziz bin Rayyis Al-Rayyis. Publisher: Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina. Edition: First, 1440 AH. Number of Pages: 56 [Book numbering matches the printed version]. Publication Date in Shamela: 30 Ramadan 1442.\nBook: Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar. Author: Dr. Abdul Aziz bin Rayyis Al-Rayyis. Publisher: Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina. Edition: First, 1440 AH. Number of Pages: 56 [Book numbering matches the printed version]. Publication Date in Shamela: 30 Ramadan 1442.\nAuthor: Dr. Abdul Aziz bin Rayyis Al-Rayyis. Publisher: Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina. Edition: First, 1440 AH. Number of Pages: 56 [Book numbering matches the printed version]. Publication Date in Shamela: 30 Ramadan 1442.\n[Book numbering matches the printed version]. Publication Date in Shamela: 30 Ramadan 1442.",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 3
  },
  {
    "serial_number": "3428240",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 5,
    "volume_number": 1,
    "text": "Introduction. In the name of Allah, the Entirely Merciful, the Especially Merciful. Peace be upon you, and the mercy of Allah and His blessings. To proceed: This is a transcript (1) of the lesson \"The Authority of the Companion's Saying,\" which I delivered on the night of the twenty-ninth of the fifth month of the year one thousand four hundred and thirty-eight from the migration of the Prophet - may Allah's prayers and peace be upon him and his family and companions. Proceeding from the importance of this evidence which is greatly needed, I reviewed the transcribed material, refined it, and documented it to come out in this treatise consisting of an introduction, a preface, three chapters, and a conclusion, and I named it \"Al-Intisar li Hujjiyat Qawl Al-Sahabah Al-Akhyar\" (The Victory for the Authority of the Saying of the Righteous Companions). It is as follows: - Introduction: This is what is before you now. - Preface: Definition of the Companion and his Madhhab (school of thought/opinion), and other things. - Chapter One: It has five sections: - Section One: Defining the point of contention regarding the authority of the Companion's Madhhab. - Section Two: Types of the Companion's Madhhab in general. - Section Three: Two important premises.",
    "foot_note": "1. It was transcribed by some virtuous brothers, who documented it, formatted the original, added to it, and changed the style to bring it closer to an authored book instead of being a transcript, and they created an index for it. I reviewed it and found it good, so may Allah reward them with good and bless them.",
    "book_id": "271",
    "new_page_number": 4
  },
  {
    "serial_number": "3428241",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 6,
    "volume_number": 1,
    "text": "- Section Four: Evidences for the authority of the Companion's saying. - Section Five: The strongest arguments held by those who say the Companion's saying is not an authority. - Chapter Two: The Companion's Madhhab and its divisions, containing three sections: - Section One: The Companion initiating a legal ruling. - Section Two: The Companion's interpretation of the text, either by specification, restriction, or clarification. - Section Three: Action when Companions disagree. - Chapter Three: Important notes, containing three sections: - Section One: Refutation of those who said: The Companion's saying is an authority in interpreting the text, not in initiating a ruling. - Section Two: Verifying the basis (Manat) of the Companion's Madhhab. - Section Three: Those who wasted the use of the Companion's Madhhab as evidence. - Conclusion. I ask Allah to accept this treatise, and to make it beneficial for His creation, accepted by Him, Glory be to Him. And peace be upon you, and the mercy of Allah and His blessings. Dr. Abdul Aziz bin Rayyis Al-Rayyis. Supervisor of the Ancient Islam Website. 18/ 4/ 1439 AH.",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 5
  },
  {
    "serial_number": "3428242",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 7,
    "volume_number": 1,
    "text": "Preface. It should be known that the Companion (Sahabi): is everyone who met the Prophet, peace and blessings be upon him, believing in him, and died upon that, even if apostasy occurred in between (1). The evidence that meeting the Prophet, peace and blessings be upon him, while believing in him is a condition for being a Companion is two proofs: The First Proof: Muslim narrated from the hadith of Abu Huraira, that the Messenger of Allah, peace and blessings be upon him, said: \"I wish we had seen our brothers.\" They said: Are we not your brothers, O Messenger of Allah? He said: \"You are my Companions, and our brothers are those who have not come yet\" (2). So the difference between his Companions and his brothers: is that he met his Companions, but did not meet his brothers. Therefore, both are believers in him, except that his Companions met him, unlike his brothers. Thus, the Companion is the one who met the Prophet, peace and blessings be upon him, believing in him. The Second Proof: The consensus of Ahlus-Sunnah recounted by Imam Ahmad in \"Usul Al-Sunnah\" (3). Indeed, Imam Ahmad recounted that whoever met the Prophet, peace and blessings be upon him, even for an hour, is a Companion. What he recounted in \"Usul Al-Sunnah\" is fundamentally agreed upon by Ahlus-Sunnah. Imam Ali",
    "foot_note": "1. See regarding this: \"Al-Ihkam\" by Al-Amidi (2/92), \"Al-Bahr Al-Muhit\" by Al-Zarkashi (6/190-191), \"Sharh Mukhtasar Al-Rawdah\" by Al-Tufi (2/180-186), \"Sharh Mukhtasar Al-Tahrir\" by Ibn Al-Najjar (2/465), \"Fath Al-Mughith\" by Al-Sakhawi (4/78-79), \"Tadrib Al-Rawi\" by Al-Suyuti (2/667-670), and \"Irshad Al-Fahul\" by Al-Shawkani (1/188-189). \n2. Narrated by Muslim (249). \n3. See: \"Usul Al-Sunnah\" by Imam Ahmad (p. 39-41).",
    "book_id": "271",
    "new_page_number": 6
  },
  {
    "serial_number": "3428243",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 8,
    "volume_number": 1,
    "text": "bin Al-Madini - may Allah Almighty have mercy on him - recounted similar in his Creed narrated by Al-Lalaka'i (1). If this is clear, then this treatise will be - by Allah's permission - in discussing the \"authority of the Companion's Madhhab\". It may be expressed by their saying \"authority of the Companion's saying\", and the matter is easy, except that the expression \"Madhhab\" is more inclusive; because it includes saying, action, and approval. Perhaps the expression became famous among scholars by their saying: \"Companion's saying\" by way of predominance; because saying is more frequent, and there is latitude in that matter. * * *",
    "foot_note": "1. See: \"Sharh Usul I'tiqad Ahl Al-Sunnah\" by Al-Lalaka'i (1/187-188).",
    "book_id": "271",
    "new_page_number": 7
  },
  {
    "serial_number": "3428244",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 9,
    "volume_number": 1,
    "text": "Chapter One. It has five sections: * Section One: Defining the point of contention regarding the authority of the Companion's Madhhab. * Section Two: Types of the Companion's Madhhab in general. * Section Three: Two important premises. * Section Four: Evidences for the authority of the Companion's saying. * Section Five: The strongest arguments held by those who say the Companion's saying is not an authority.",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 8
  },
  {
    "serial_number": "3428245",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 11,
    "volume_number": 1,
    "text": "Section One. Defining the Point of Contention Regarding the Authority of the Companion's Madhhab. Defining the point of contention regarding the authority of the Companion's Madhhab involves four matters: First Matter: That the Companion does not contradict a text. If the Companion contradicts a text, then his saying is rejected. This was mentioned by Sheikh Al-Islam Ibn Taymiyyah in \"Majmu' Al-Fatawa\" (1), Ibn Al-Qayyim in his book \"I'lam Al-Muwaqqi'in\" (2), and Al-Ala'i in his book \"Ijmal Al-Isabah\" (3). Indeed, Imam Al-Shafi'i recounted consensus on that, where he said - may Allah Almighty have mercy on him -: \"The scholars agreed that whoever the Sunnah of the Prophet, peace and blessings be upon him, becomes clear to, has no right to leave it for the saying of anyone, whoever he may be\" (4). Second Matter: That the Companion does not contradict another Companion. If a Companion contradicts another Companion, neither of their sayings is more worthy than the other, except what will come in the section on the Rightly Guided Caliphs - God willing -. On this is the consensus of the people of knowledge. The consensus was recounted by Al-Amidi (5), Sheikh Al-Islam Ibn Taymiyyah as in \"Majmu' Al-Fatawa\" (6), and Al-Ala'i in his book \"Ijmal Al-Isabah\" (7), and Ibn Al-Qayyim established its foundation in his book \"I'lam Al-Muwaqqi'in\" (8).",
    "foot_note": "1. See: \"Majmu' Al-Fatawa\" by Ibn Taymiyyah (1/283-284). \n2. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (6/36-37). \n3. See: \"Ijmal Al-Isabah\" by Al-Ala'i (p. 90-91). \n4. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (2/11). \n5. See: \"Al-Ihkam\" by Al-Amidi (4/149). \n6. See: \"Majmu' Al-Fatawa\" by Ibn Taymiyyah (1/283-284), and (20/14). \n7. See: \"Ijmal Al-Isabah\" by Al-Ala'i (p. 78). \n8. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (5/546).",
    "book_id": "271",
    "new_page_number": 9
  },
  {
    "serial_number": "3428246",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 12,
    "volume_number": 1,
    "text": "Third Matter: That the Companion's saying does not have the ruling of being raised [to the Prophet] (Marfu'). A Companion might say a saying or do an action that has the ruling of being raised [to the Prophet]. Whatever has the ruling of being raised, the likes of it is an authority; because it is revelation, not because it is the Companion's saying. Imam Ibn Al-Qayyim - may Allah Almighty have mercy on him - clarified this in his book \"I'lam Al-Muwaqqi'in\" (1). Fourth Matter: That the Companion's saying is not abandoned (Mahjur), meaning: that the people of knowledge do not follow the Companion. If a Companion held an opinion, and scholars agreed not to act upon this saying, then this saying is not an authority and must be left. Indeed, if scholars agreed to leave a Prophetic Hadith, this Hadith is not acted upon; because this consensus indicates either the weakness of this Hadith, or that the Hadith is abrogated. So the Companion's saying is more deserving [of being left in such a case]. Examples of this: What Al-Bazzar narrated with an authentic chain, that Abu Talha Al-Ansari, may Allah be pleased with him, ate hail while fasting and said: It is not food nor drink (2). This tradition, that hail does not invalidate the fasting of the fasting person, scholars have agreed on the contrary. The consensus was recounted by Ibn Al-Salah in his book \"Sharh Mushkil Al-Wasit\" (3), and Al-Shatibi in his book \"Al-Muwafaqat\" (4).",
    "foot_note": "1. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (6/31-33). \n2. Narrated by Al-Bazzar in \"Al-Musnad\" (7428), Al-Tahawi in \"Sharh Mushkil Al-Athar\" (5/115) and others, stopped (Mawquf) at Abu Talha. Ibn Hazm authenticated it as Mawquf in \"Al-Muhalla\" (4/304), and \"Al-Ihkam\" (6/83-84), as well as Al-Albani in \"Al-Silsilah Al-Da'ifah\" (4/154). It came raised (Marfu') via a weak path as in Abu Ya'la in \"Al-Musnad\" (1424), and (3999) and others, and Al-Albani weakened it in \"Al-Silsilah Al-Da'ifah\" (63). \n3. See: \"Sharh Mushkil Al-Wasit\" by Ibn Al-Salah (3/198-199). \n4. See: \"Al-Muwafaqat\" by Al-Shatibi (3/274-275).",
    "book_id": "271",
    "new_page_number": 10
  },
  {
    "serial_number": "3428247",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 13,
    "volume_number": 1,
    "text": "So if scholars agree not to act upon a Companion's Madhhab, whether it is a saying, action, or approval, it is not acted upon as previously established. After defining the point of contention regarding the authority of the Companion's Madhhab, it becomes clear: That the Companion's saying is an authority absolutely. If scholars dispute over an issue with two opinions, and one of the opinions contains the saying of the Companions, then this opinion is preponderant; because the Companion held this opinion. * * *",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 11
  },
  {
    "serial_number": "3428248",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 14,
    "volume_number": 1,
    "text": "Section Two. Types of the Companion's Madhhab in General. If this is clear, the Companion's Madhhab in general is of two types: First Type: That the Companion's saying is famous and known. Imam Ibn Al-Qayyim - may Allah Almighty have mercy on him - mentioned in his book \"I'lam Al-Muwaqqi'in\" (1) that if a Companion says a saying and it becomes famous, a group held that it is consensus, and another said: It is an authority but not consensus. A small group of theological jurists and later scholars held that it is neither consensus nor an authority. Then Imam Ibn Al-Qayyim refuted this - may Allah Almighty have wide mercy on him -. The evidences he mentioned for the authority of the Companion's saying will come in the second type, which is evidence that the first type is an authority a fortiori. Second Type: That the Companion's saying is not famous, or it is not known whether it became famous or not. Imam Ibn Al-Qayyim established that it is an authority. He said: This is the saying of Abu Hanifa, Malik, Ahmad, and Al-Shafi'i in the old and new [schools] (2). And he said after mentioning the quotations from Al-Shafi'i: This is the speech of Al-Shafi'i - may Allah have mercy on him and be pleased with him - textually, and we testify by Allah that he did not retract it, rather his speech in the new [school] conforms to this and agrees with it as his wording was mentioned previously (3). Because some of Al-Shafi'i's companions disagreed and said: This is not a saying of Al-Shafi'i in the new [school] (4).",
    "foot_note": "1. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (5/548-550). \n2. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (5/550-554). \n3. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (5/554). \n4. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (5/550-552).",
    "book_id": "271",
    "new_page_number": 12
  },
  {
    "serial_number": "3428249",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 15,
    "volume_number": 1,
    "text": "But Al-Ala'i in his book \"Ijmal Al-Isabah\" (1) - and he is a Shafi'i - established that it is Al-Shafi'i's saying in the old and the new [schools]. Al-Bayhaqi mentioned (2) that Al-Shafi'i has speech indicating his view of the authority of the Companion's saying in the new [school], so it is his saying in the old and new. Sheikh Al-Islam Ibn Taymiyyah mentioned similar as in \"Majmu' Al-Fatawa\" (3). So, this is the saying of the Imams of the four schools, and it is the saying of Abu Ubaid Al-Qasim bin Salam and Ishaq bin Rahwayh (4). Then Imam Ibn Al-Qayyim, may Allah have mercy on him, mentioned forty-six proofs (5) for the authority of the Companion's saying, and elaborated on that - may Allah have wide mercy on him -. I will try in this treatise to summarize what is possible of the important matters pointed out by Ibn Al-Qayyim, may Allah have mercy on him; because the one who researched this issue most extensively and best is Imam Ibn Al-Qayyim, may Allah have mercy on him, in his book \"I'lam Al-Muwaqqi'in\". * * *",
    "foot_note": "1. See: \"Ijmal Al-Isabah\" by Al-Ala'i (p. 36 and following). \n2. See: \"Ma'rifat Al-Sunan wa Al-Athar\" (1/183-184), and \"Al-Madkhal ila Al-Sunan Al-Kubra\" (p. 109-110). \n3. See: \"Majmu' Al-Fatawa\" by Ibn Taymiyyah (20/14). \n4. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (5/550). \n5. See them in: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (5/566) to (6/30).",
    "book_id": "271",
    "new_page_number": 13
  },
  {
    "serial_number": "3428250",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 16,
    "volume_number": 1,
    "text": "Section Three. Two Important Premises. Before I begin mentioning the evidences for the authority of the Companion's saying, I present two extremely important premises, which are - in my view - the key to this issue: First Premise: The Companion's saying is not an authority in itself; for the Companion is not infallible in himself, evidenced by the fact that Companions differ on two opinions. So the Companion's saying is not an authority in itself, but rather it is an authority due to what is added to it, as Imam Ibn Al-Qayyim, may Allah have mercy on him, said (1). With this, a problem repeated by the Zahiris and some theologians and those influenced by them from Ahlus-Sunnah is answered. They say: How can it be said: The Companion's saying is an authority, while he is not infallible and may err? The answer to this problem is to say: This is correct, and it is not an authority in itself, but an authority due to what is added to it; that is - in approximate terms from one aspect - a form of transmitting consensus. If a Companion says a saying and is not opposed, then this is consensus, so it is an authority due to what is added to it, which is consensus. Second Premise: The Companion's saying is an authority based on prevailing conjecture (Ghalabat al-Zann). Ibn Al-Qayyim stated this in his book \"I'lam Al-Muwaqqi'in\" (2); that is because speculative consensus is consensus based on prevailing conjecture. For consensus is of two types: definitive and speculative. What is based on an apparent text, like His saying: {Establish prayer and give Zakat}, is definitive consensus, and what is not like that is speculative consensus. So the saying of the authority of the Companion's saying is based on prevailing conjecture. * * *",
    "foot_note": "1. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (6/37). \n2. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (6/21).",
    "book_id": "271",
    "new_page_number": 14
  },
  {
    "serial_number": "3428251",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 17,
    "volume_number": 1,
    "text": "Section Four. Evidences for the Authority of the Companion's Saying. After these two previous premises, the evidences for the authority of the Companion's saying are as follows: First Evidence: Every evidence for the authority of the proof of consensus is evidence that the Companion's Madhhab is an authority. That is because if a Companion, or two, or three, or four... say a saying and are not opposed, then this is consensus. It is not correct for anyone to say: Such consensus is not accepted, or say what became common among theologians that this is tacit consensus (Ijma' Sukuti) and then reject it. That is because the implication of rejecting tacit consensus is that there is no consensus; because there is no spoken consensus, meaning: that every scholar uttered a saying in this issue (1). Indeed, if you wanted to prove from the people of Badr that they stated the obligation of the five prayers, you would not be able to prove that. So if you cannot do that in the five prayers, and regarding people like the people of Badr, then other issues are a fortiori. So the saying that every scholar must speak implies dropping the evidence of consensus. Ibn Qudamah, may Allah have mercy on him, mentioned this meaning in his book \"Rawdat Al-Nazir\" (2). Thus, the First Evidence: Every evidence indicating the authority of consensus indicates the authority of the Companion's saying. Among that: His saying Almighty: {And whoever opposes the Messenger after guidance has become clear to him and follows other than the way of the believers - We will give him what he has taken and drive him into Hell, and evil it is as a destination}. If you are asked in an issue where there is a saying of the Companions or two or three or four sayings: What is the highest",
    "foot_note": "1. Review regarding that our treatise \"Hujjiyat Al-Ijma' wa Kashf Ba'd Al-Shubuhat\". \n2. See: \"Rawdat Al-Nazir\" by Ibn Qudamah (1/437).",
    "book_id": "271",
    "new_page_number": 15
  },
  {
    "serial_number": "3428252",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 18,
    "volume_number": 1,
    "text": "saying in this issue? The answer: It is the saying of the Companion. Therefore, it is the way of the believers in this issue as far as you know, and whoever opposes them afterwards is defeated by argument through them, in addition to other evidences for the authority of consensus (1). Second Evidence: Evidences specific to the Companions. I will mention two evidences: a textual traditional evidence, and an evidence from the aspect of meaning. As for the first textual traditional one: Muslim narrated from the hadith of Abu Musa Al-Ash'ari, that the Prophet, peace and blessings be upon him, said: \"The stars are trust-keepers for the heaven, so if the stars go, there comes to the heaven what it is promised. And I am a trust-keeper for my Companions, so if I go, there comes to my Companions what they are promised. And my Companions are trust-keepers for my Ummah, so if my Companions go, there comes to my Ummah what they are promised\" (2). The Prophet, peace and blessings be upon him, likened himself to a star, and the star is used for guidance. He likened the Companions to that, indicating that they are an authority. So whoever is guided by them walks the straight path, and whoever follows their methodology is saved. This is clear evidence for the authority of the Companion's saying. Similar to that is what came regarding some Companions, as the Five except Al-Nasa'i narrated from the hadith of Al-Irbad bin Sariyah, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: \"You must follow my Sunnah and the Sunnah of the Rightly Guided Caliphs, hold on to it with your molars\" (3). This is explicit regarding the authority of the saying of some Companions, like the Rightly Guided Caliphs. Also from that is what Muslim narrated from the hadith of Abu Qatadah, that the Prophet, peace and blessings be upon him, said: \"If the people obey Abu Bakr",
    "foot_note": "1. Review them in my treatise \"Hujjiyat Al-Ijma' wa Kashf Ba'd Al-Shubuhat\". \n2. Narrated by Muslim (2531). \n3. Narrated by Ahmad (4/126), Ibn Majah (42), Abu Dawud (4607), and Al-Tirmidhi (2676) and said: Hasan Sahih. Al-Albani authenticated it in \"Sahih Sunan Abi Dawud\" (4607) Al-Ma'arif edition.",
    "book_id": "271",
    "new_page_number": 16
  },
  {
    "serial_number": "3428253",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 19,
    "volume_number": 1,
    "text": "and Umar, they will be rightly guided\" (1). This is regarding some Companions as well. As for the second evidence which refers to meaning: It is what Ibn Al-Qayyim, may Allah have mercy on him, mentioned. He said: \"We and the Companions share in perceptions, and they separate from us by perceptions. The perceptions by which they separate are as follows: A Companion, if he says a saying, it is possible he heard it from the Prophet, peace and blessings be upon him; it is possible he heard it from someone who heard it from the Prophet, peace and blessings be upon him; it is possible he is transmitting a consensus in their time; it is possible it is an understanding that appeared to him which did not appear to us; and it is possible - this is a fifth possibility - that it is a matter indicated by the language, and they are Imams in the chapter of language, and knew it by context, language, and other things. These five possibilities indicate that his saying is an authority. They said: There is a sixth possibility: That the Companion exercised Ijtihad and erred. But these six matters - which are the perceptions by which they separated from us - indicate that their saying is an authority based on prevailing conjecture, and prevailing conjecture is an authority in Sharia. These are perceptions by which they separated from us (2). There are perceptions in which we and they shared, but the difference between us and them in them is like the difference between the heaven and the earth. That is known by what Ibn Al-Qayyim - may Allah Almighty have mercy on him - mentioned: That if one of us wants to study language, he takes a branch from his mind, while for the Companion it is his natural disposition upon which he was raised. And Hadith takes a branch from his mind, while the Companion says: I saw Muhammad, peace and blessings be upon him, and Muhammad, peace and blessings be upon him, said. And the science of Usul takes a branch from his mind, while the Companion does not need that. Until he said after that: Then if we finish all this, we arrive with minds that have become dull and tired. Some of us strive in the journey, and some of us do not strive. All this is not the case with the Companion (3).",
    "foot_note": "1. Narrated by Muslim (681). \n2. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (6/19-21). \n3. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (6/21-22).",
    "book_id": "271",
    "new_page_number": 17
  },
  {
    "serial_number": "3428254",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 20,
    "volume_number": 1,
    "text": "So, this is a matter in which we and they shared, except that the difference between us and them is extremely great - may Allah be pleased with them and please them -. The summary of what preceded is in two things: First thing: Every evidence indicating the authority of consensus indicates the authority of the Companion's saying, so this is not specific to them. Second thing: There are evidences specific to them or some of them, including what was previously mentioned in shared perceptions and separate perceptions. * * *",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 18
  },
  {
    "serial_number": "3428255",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 21,
    "volume_number": 1,
    "text": "Section Five. The Strongest Arguments Held by Those Who Say the Companion's Saying is Not an Authority. The strongest arguments held by those who say the Companion's saying is not an authority are two matters: First Matter: That in case of disagreement, reference is made to what Allah and the Messenger, peace and blessings be upon him, said. The Almighty said: {And if you disagree over anything, refer it to Allah and the Messenger}, to other evidences. They said: And Allah did not say: Refer it to Abu Bakr and Umar, nor to the Companions. This, if you look at the beginning and start of the matter, you might think strong. However, it is one of the weakest evidences. That is because the implication of saying the Companion's saying is an authority is that it is a referral to Allah and His Messenger, peace and blessings be upon him. Those who said the Companion's saying is an authority only said so because evidences indicated that, this is firstly. Secondly: This implies that consensus is not an authority, so by this we agree with the Mu'tazila; because the first to deny consensus was Al-Nazzam the Mu'tazili, as mentioned by Ibn Qudamah (1), and other scholars (2). So, the requirement of returning to the Book of Allah and the Sunnah of the Prophet, peace and blessings be upon him, is the saying that the Companion's saying is an authority; because the Sharia indicated this. Second Matter: That the Companions are not infallible, and may err. So how do we refer in knowing truth and falsehood, Halal and Haram, to people who may err?",
    "foot_note": "1. See: \"Rawdat Al-Nazir\" by Ibn Qudamah (1/379). Abu Al-Ma'ali Al-Juwayni said in \"Al-Burhan fi Usul Al-Fiqh\" (1/261): \"The first to openly reject it was Al-Nazzam, then groups of the Rawafid followed him.\" \n2. Review our treatise \"Hujjiyat Al-Ijma' wa Kashf Ba'd Al-Shubuhat\".",
    "book_id": "271",
    "new_page_number": 19
  },
  {
    "serial_number": "3428256",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 22,
    "volume_number": 1,
    "text": "This has been indicated previously, and I confirm it with the following: It was previously mentioned that the authority is not in the Companion himself. The Companion in himself is not infallible; rather he errs and is correct. Therefore, if they differ on two opinions, the truth is in one of these two opinions. Arguing by their saying is only from the aspect of prevailing conjecture. Then it is not for itself, but for what is added to it, which is that it is a form of recounting consensus. Thus, if a Companion says a saying and is not opposed, the issue is consensus, so the authority is in the lack of others opposing him, not in the Companion himself. So, the summary of the answer is to say: The authority is not by the Companion himself, but for what is added to it; because arguing by it is from the aspect of prevailing conjecture, and it is a form of consensus. * * *",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 20
  },
  {
    "serial_number": "3428257",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 23,
    "volume_number": 1,
    "text": "Chapter Two. The Companion's Madhhab and its Divisions. The Companion's Madhhab is divided into three divisions: First Division: The Companion initiating a legal ruling. Second Division: The Companion's interpretation of the text, either by specification, restriction, or clarification. Third Division: Action when Companions disagree.",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 21
  },
  {
    "serial_number": "3428258",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 25,
    "volume_number": 1,
    "text": "Section One. The Companion Initiating a Legal Ruling. This is the first division of the Companion's Madhhab. Examples include: First Example: Sitting for Tashahhud in the two prostrations of forgetfulness (Sujud al-Sahw) if the prostration is after the Salam. Raised hadiths came regarding this, but they are not authentic, as Ibn Taymiyyah (1) and others clarified. Rather, it is established from Abdullah bin Masoud, may Allah be pleased with him, in what Ibn Abi Shaybah narrated (2). Abu Hanifa (3) and Ahmad (4) - may Allah have mercy on them - went to this, and Ibn Masoud was not opposed. So this saying is an authority; because the Companion initiated a new ruling and was not opposed. Second Example: Zakat on trade goods. No hadith from the Messenger of Allah, peace and blessings be upon him, is authentic regarding it. Rather, the reliance in it is on traditions (Athar), and on its establishment from the Companions, like Ibn Umar (5) and others (6) - may Allah be pleased with them and please them -.",
    "foot_note": "1. See: \"Majmu' Al-Fatawa\" by Ibn Taymiyyah (23/48-51). \n2. Narrated by Ibn Abi Shaybah (4492), and (4493). \n3. See: \"Al-Ikhtiyar li-Ta'lil Al-Mukhtar\" by Ibn Mawdud Al-Hanafi (1/72). \n4. See: \"Al-Awsat\" by Ibn Al-Mundhir (3/315). \n5. Narrated by Ibn Abi Shaybah (10560), and Al-Bayhaqi in \"Al-Sunan Al-Kubra\" (4/147). \n6. Like Umar bin Al-Khattab, may Allah be pleased with him, narrated by Abdul Razzaq (7099), Ibn Abi Shaybah (10557), and (10558), Abu Ubaid in \"Al-Amwal\" (1/520), Al-Bayhaqi in \"Al-Sunan Al-Kubra\" (4/147) and others.",
    "book_id": "271",
    "new_page_number": 22
  },
  {
    "serial_number": "3428259",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 26,
    "volume_number": 1,
    "text": "The majority of scholars went to this; because the Companion was not opposed in that (1). Third Example: Raising hands in the Takbirs of the funeral prayer, except for the opening Takbir. Scholars disputed over it. The most correct opinions: Hands are raised in all Takbirs of the funeral prayer. The evidence for that is that it was established from Ibn Umar, may Allah be pleased with them both, in what Ibn Abi Shaybah (2) and Ibn Al-Mundhir (3) narrated. So raising hands is recommended; because it is a Companion's saying that was not opposed. Fourth Example: Obligation of Wudu from washing the dead. Raised hadiths came regarding it, but they are not authentic (4). Rather, the reliance is on its establishment from Abdullah bin Abbas, may Allah be pleased with them both, in Abdul Razzaq (5). Imam Ahmad went to this (6), and Ibn Qudamah said: There is no disagreement among the Companions regarding that (7), so it is an authority.",
    "foot_note": "1. Ibn Qudamah said in \"Al-Mughni\" (4493): \"Zakat is obligatory on the value of trade goods, in the opinion of most people of knowledge. Ibn Al-Mundhir said: The people of knowledge agreed that trade goods intended for trade have Zakat, if a year passes over them. This was narrated from Umar, his son, and Ibn Abbas. And the seven jurists, Al-Hasan, Jabir bin Zaid, Maymun bin Mihran, Tawus, Al-Nakha'i, Al-Thawri, Al-Awza'i, Al-Shafi'i, Abu Ubaid, Ishaq, and the people of opinion (Ashab al-Ra'y) held this.\" \n2. Narrated by Ibn Abi Shaybah (11498). \n3. Narrated by Ibn Al-Mundhir in \"Al-Awsat\" (3108). \n4. Ibn Al-Mundhir said in \"Al-Awsat\" (5/350): \"Ghusl from washing the dead is not obligatory, and there is no report established in it. Ahmad said: 'No hadith is established in it'.\" \n5. Narrated by Abdul Razzaq (6101), and Ibn Al-Mundhir in \"Al-Awsat\" (2939). \n6. See: \"Al-Insaf\" by Al-Mardawi (1/215). \n7. See: \"Al-Mughni\" by Ibn Qudamah (1/123), where he said: \"So it was narrated from Ibn Umar and Ibn Abbas that they used to command the washer of the dead to perform Wudu. And from Abu Huraira, he said: The least in it is Wudu. And we do not know of any opponent to them among the Companions.\"",
    "book_id": "271",
    "new_page_number": 23
  },
  {
    "serial_number": "3428260",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 27,
    "volume_number": 1,
    "text": "Fifth Example: Non-invalidation of purity by the exit of non-excessive blood: This was established in Abdul Razzaq from Ibn Umar (1), and from other Companions (2). To this opinion went Abu Hanifa (3) and Ahmad (4). Ibn Qudamah said: There is no disagreement among the Companions regarding that (5). So, reliance is on the saying of a Companion, or two, or three in the previous issues or others, and others from the Companions did not oppose them. So every saying initiated by a Companion, and not opposed, is an authority. * * *",
    "foot_note": "1. Narrated by Abdul Razzaq (553), Ibn Abi Shaybah (1478), and Ibn Al-Mundhir in \"Al-Awsat\" (65). \n2. Like Abu Huraira and others as in Abdul Razzaq (556), Ibn Abi Shaybah (66), and Ibn Al-Mundhir in \"Al-Awsat\" (66). \n3. See: \"Al-Mughni\" by Ibn Qudamah (1/120). \n4. See: \"Al-Mughni\" by Ibn Qudamah (1/120). \n5. See: \"Al-Mughni\" by Ibn Qudamah (1/120), where he said: \"It is famous from the Companions, may Allah be pleased with them. Ibn Abbas said regarding blood: If it is excessive, he must repeat [Wudu/Prayer]. Ibn Abi Awfa spat blood then stood and prayed. Ibn Umar squeezed a pimple and blood came out, and he prayed, and did not perform Wudu. Abu Abdullah said: Several Companions spoke about it. Abu Huraira used to put his fingers in his nose. Ibn Umar squeezed a pimple. Ibn Abi Awfa squeezed a boil. Ibn Abbas said: If it is excessive. Jabir put his fingers in his nose. Ibn Al-Musayyib put his ten fingers in his nose, and took them out stained with blood. Meaning: While in prayer. Abu Hanifa said: If blood flows, Wudu is required, and if it stops at the head of the wound, it is not required.\"",
    "book_id": "271",
    "new_page_number": 24
  },
  {
    "serial_number": "3428261",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 28,
    "volume_number": 1,
    "text": "Section Two. The Companion's Interpretation of the Text, Either by Specification, Restriction, or Clarification. This is the second division which is: That the Companion says a saying interpreting a text, either by specifying a general, restricting an absolute, or clarifying an ambiguous. What is such, is an authority; because evidences indicated the authority of the Companion's saying and did not differentiate between it being an initiation or in interpreting a text. In other words: If a general text comes, and the general text is an authority, and a specific saying of a Companion comes, and the Companion's saying is an authority as preceded, then acting by both proofs is better than neglecting one of them. Therefore, the general is specified, the absolute is restricted, and the ambiguous is clarified in such cases by the Companion's saying. Note: People of knowledge disputed much regarding the examples of this division: Is it from interpretation of the text or from the Companion contradicting the text? If it is from the Companion contradicting the text, then it is rejected; due to what preceded in defining the point of contention: That the Companion's saying is rejected if it contradicts the text by consensus. But if it is interpretation of the text, then it is an authority as established. The criterion in this is what Imam Ibn Al-Qayyim - may Allah Almighty have mercy on him - established in his book \"I'lam Al-Muwaqqi'in\". He said, may Allah have mercy on him, in purport: If the Companion contradicts the text, another Companion must deny it upon him. So if another Companion does not deny it upon him, it is not from contradicting the text, but rather from clarifying the text (1). Therefore, if you doubt a Companion's saying whether it contradicts the text so it is rejected, or interprets it so it is accepted? Look: Did another Companion oppose him or not? If another Companion did not oppose him, it is from the interpretation and clarification of the text.",
    "foot_note": "1. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (5/575-576).",
    "book_id": "271",
    "new_page_number": 25
  },
  {
    "serial_number": "3428262",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 29,
    "volume_number": 1,
    "text": "The evidence for this: Allah Glory be to Him said: {You are the best nation produced for mankind. You enjoin what is right and forbid what is wrong}. Ibn Al-Qayyim said: And the wrong saying is Munkar (wrong) from an aspect. If this saying was outweighed (Marjuh) according to this Companion, another Companion must deny it upon him. So when another Companion did not deny it upon him, it indicated that his saying is not outweighed, and it is not possible that Allah transmits to us the outweighed saying and leaves the preponderant saying; while He commanded us to follow the way of the believers (1). If the observer contemplates this criterion, he can distinguish between the saying that is rejected because it contradicts the text, and the saying that is accepted because it is an interpretation of the text. How much disturbance and difference there is in such matters, but if this criterion mentioned by Ibn Al-Qayyim is controlled, the matter becomes very clear, and the student and observer proceeds on a straight line without disturbance or contradiction. Before mentioning examples, let it be known that some examples might be disputed: Are they from initiating a ruling: i.e., from the first division, or from the second division? Some dispute in understanding might occur, but generally, whether it is from the first or second division, it is an authority in both cases. First Example: The two Sheikhs narrated from the hadith of Aisha, may Allah be pleased with her, the Prophet, peace and blessings be upon him, said: «Whoever dies and has fasting due upon him, his guardian fasts on his behalf» (2). It was established in Abu Dawud from Ibn Abbas that he specified it to the fast of vows (Nadhar) (3). So this is from the chapter of interpreting the text; because Ibn Abbas was not opposed, so this Hadith is carried to mean the fast of vows.",
    "foot_note": "1. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (5/569). \n2. Narrated by Al-Bukhari (1952), and Muslim (1147). \n3. Narrated by Abu Dawud (2401), and Al-Albani authenticated it in \"Sahih Sunan Abi Dawud\" (2401) Al-Ma'arif edition.",
    "book_id": "271",
    "new_page_number": 26
  },
  {
    "serial_number": "3428263",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 30,
    "volume_number": 1,
    "text": "Al-Layth bin Sa'd (1), Ahmad in a narration (2), the choice of Ibn Al-Qayyim (3), and the choice of Allama Al-Albani (4) - may Allah have mercy on all - went to this. Second Example: Taking from the beard the amount of a fist: The Sharia came with letting it grow and leaving it loose etc. Then it was established in Al-Bukhari from Ibn Umar that he used to take the amount of a fist (5). It came from Jabir in Abu Dawud that he said: «We used to leave the mustache grow except in Hajj or Umrah» (6). It also came from Abu Huraira, may Allah be pleased with him (7). Ibn Jarir narrated from Ibn Abbas, he said: {Then let them end their untidiness}, he said in its interpretation: That means taking from his sideburns (8). The point: What came from the Companions is absolute taking, but Ibn Umar interpreted that as the amount of a fist, and what is less than that, no. So letting it grow which the Sharia brought is what is the amount of a fist. So what exceeds the fist is taken as recommended; because Ibn Umar did it, may Allah be pleased with them both. To this went Imam Ahmad (9) and Al-Shafi'i (10). Ahmad used to take from its length",
    "foot_note": "1. See: \"Al-Mughni\" by Ibn Qudamah (3/39). \n2. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (6/545), and \"Al-Insaf\" by Al-Mardawi (3/336). \n3. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (6/545). \n4. See: \"Ahkam Al-Jana'iz\" by Al-Albani (p. 169-170), and \"Al-Ta'liq 'ala Tamam Al-Minnah\" by Al-Albani (p. 427-428). \n5. Narrated by Al-Bukhari (5892), and Ibn Abi Shaybah (25997). \n6. Narrated by Abu Dawud (4201), and Al-Albani weakened it in \"Da'if Sunan Abi Dawud\" (4201) Al-Ma'arif edition. Narrated by Ibn Abi Shaybah (25998) with a weak chain as well. \n7. Narrated by Ibn Abi Shaybah (25999). \n8. Narrated by Al-Tabari in \"Al-Tafsir\" (16/526). \n9. See: \"Masa'il Ibn Hani\" (1848), and \"Al-Tarajjul\" by Al-Khallal (1/129). \n10. See: \"Al-Majmu'\" by Al-Nawawi (8/201).",
    "book_id": "271",
    "new_page_number": 27
  },
  {
    "serial_number": "3428264",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 31,
    "volume_number": 1,
    "text": "and breadth (1). However, scholars differed: Is this in Hajj and Umrah or general? The more apparent of the two opinions: It is general as is Ahmad's saying; because Ibn Umar used to, if he broke his fast from Ramadan, if he intended Hajj he would not take (2), so the concept of opposition: if he did not intend Hajj he would take - beautifying for Eid -. So Ibn Umar limited letting it grow to the amount of a fist. This is a Companion's saying, and his saying is an authority in interpreting the text. It is the saying of Al-Shafi'i and Imam Ahmad as preceded, and Allama Muhammad Nasir al-Din al-Albani supported it greatly (3) - may Allah have mercy on all -. Third Example: Glory be to Him said: {So whoever among you is ill or on a journey - then an equal number of other days}. The Sharia came with making up absolutely, and came with voluntary fasting absolutely, and did not stipulate for voluntary fasting that no obligatory fast remains upon him. Rather, it came with the desirability of fasting absolutely. But it was established from Abu Huraira, may Allah be pleased with him, in Abdul Razzaq, that he said: «Start with what Allah made obligatory upon you» (4). This indicated that it is not valid for anyone to fast voluntarily while he owes an obligatory fast. Imam Ahmad went to this in a narration (5), and the reliance is on the tradition of Abu Huraira, may Allah be pleased with him. Fourth Example: Wiping over the splint: Wiping over the splint was established from Ibn Umar, may Allah be pleased with him, narrated by Al-Bayhaqi and others (6).",
    "foot_note": "1. See: \"Masa'il Ibn Hani\" (1848). \n2. Narrated by Malik in \"Al-Muwatta - Yahya Al-Laythi narration\" (888). \n3. See: \"Al-Silsilah Al-Da'ifah\" by Al-Albani (5/125), and under (2355), and (6203). \n4. Narrated by Abdul Razzaq (7715) from Abu Huraira, and a man asked him saying: I have days from Ramadan, should I fast the ten [of Dhul-Hijjah] voluntarily? He said: «No, why? Start with Allah's right, then volunteer after what you wish». \n5. See: \"Al-Insaf\" by Al-Mardawi (3/350). \n6. Narrated by Al-Bayhaqi in \"Al-Sunan Al-Kubra\" (1/228) and he authenticated it.",
    "book_id": "271",
    "new_page_number": 28
  },
  {
    "serial_number": "3428265",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 32,
    "volume_number": 1,
    "text": "Abu Hanifa (1), Malik (2), Ahmad (3), and Al-Shafi'i in a saying of his (4) went to this. The saying of wiping over the splint is the correct one; because Ibn Umar was not opposed as Ibn Taymiyyah said in Sharh Al-Umdah (5), and Al-Bayhaqi mentioned that no hadith was authentic in it (6). So, wiping over the splint became legislated, and the reliance in that is the action of Ibn Umar, may Allah be pleased with him. This bears the possibility of being from interpretation of text, and bears being from initiating a ruling, and the matter is easy in that as preceded. Fifth Example: Stipulating the passage of a year (Hawl) in Zakat. For the Sharia came with Zakat, and were it not for what came of traditions in stipulating the passage of a year, the passage of a year would not have been stipulated. This bears possibility that it is from interpretation of text, and bears being from initiating a ruling. Al-Bayhaqi said: No hadith was authentic in that, but the reliance is on traditions, and this was established from Uthman and Ibn Umar, may Allah be pleased with them both (7). And the four schools are upon it (8).",
    "foot_note": "1. See: \"Bada'i' Al-Sana'i'\" by Al-Kasani (1/13). \n2. See: \"Al-Mudawwanah\" by Malik (1/129-130), and \"Al-Awsat\" by Ibn Al-Mundhir (2/23). \n3. See: \"Al-Awsat\" by Ibn Al-Mundhir (2/23), \"Al-Mughni\" by Ibn Qudamah (1/171-172), \"Al-Insaf\" by Al-Mardawi (1/171-172), and \"Kashshaf Al-Qina'\" by Al-Bahuti (1/112). \n4. See: \"Al-Awsat\" by Ibn Al-Mundhir (2/144), \"Al-Majmu'\" by Al-Nawawi (1/476) with (2/325-327). \n5. See: \"Sharh Al-Umdah\" by Ibn Taymiyyah (1/285). \n6. See: \"Al-Sunan Al-Kubra\" by Al-Bayhaqi (1/228). \n7. See: \"Al-Sunan Al-Kubra\" by Al-Bayhaqi (4/95). \n8. See: \"Bada'i' Al-Sana'i'\" by Al-Kasani (2/13), \"Al-Dhakhirah\" by Al-Qarafi (3/32), \"Al-Majmu'\" by Al-Nawawi (6/8), \"Mukhtasar Al-Khiraqi ma'a Al-Mughni\" (2/257).",
    "book_id": "271",
    "new_page_number": 29
  },
  {
    "serial_number": "3428266",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 33,
    "volume_number": 1,
    "text": "Sixth Example: It was established in Ibn Abi Shaybah and others from Ibn Abbas that they used to turn back whoever entered the Haram without Ihram (1). So no one enters the Haram except in Ihram, even if he did not intend Hajj or Umrah. Ibn Taymiyyah said in Sharh Al-Umdah: This is the saying of Ibn Abbas, and he has no opponent (2). If it is said: What is said about the hadith of Ibn Abbas in what the two Sheikhs narrated from him, when he mentioned the Mawaqit he said: «They are for them and for whoever comes upon them from other than their people who intends Hajj and Umrah» (3), the concept of opposition: that whoever does not intend Hajj or Umrah does not enter Ihram? It is said: His saying: «who intends Hajj and Umrah» came out according to the usual case (Ghalib), and what comes out according to the usual case has no concept (Mafhum). Also, if it were estimated that this concept is on its apparent meaning, Ibn Abbas's saying is explicit (Mantuq), and explicit proof is prioritized over implied proof (Mafhum). To this went the majority of Hanafis (4), Malikis (5), and Hanbalis (6), and it is a saying among Shafi'is (7): That no one enters the Haram except in Ihram, even if he is among those who do not intend Hajj or Umrah.",
    "foot_note": "1. Narrated by Ibn Abi Shaybah (13691), and (14386), and Al-Tahawi in Sharh Ma'ani Al-Athar (2/263), and (3/329). \n2. See: \"Sharh Al-Umdah\" by Ibn Taymiyyah (2/342). \n3. Narrated by Al-Bukhari (1524), and Muslim (1181). \n4. See: \"Bada'i' Al-Sana'i'\" by Al-Kasani (2/164), \"Al-Binayah Sharh Al-Hidayah\" by Al-Ayni (4/162), and \"Al-Mughni\" by Ibn Qudamah (3/116-117). \n5. See: \"Al-Mudawwanah\" by Malik (1/405), and \"Al-Mughni\" by Ibn Qudamah (3/116-117). \n6. See: \"Al-Mughni\" by Ibn Qudamah (3/116-117), and \"Sharh Al-Umdah\" by Ibn Taymiyyah (2/343-344). \n7. See: \"Al-Majmu'\" by Al-Nawawi (7/10) and following.",
    "book_id": "271",
    "new_page_number": 30
  },
  {
    "serial_number": "3428267",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 34,
    "volume_number": 1,
    "text": "Seventh Example: Allah commanded Zakat on what comes out of the earth, and this is general. But it was established in Ibn Abi Shaybah from Abu Musa Al-Ash'ari that he restricted that to four: No Zakat except in wheat, barley, raisins, and dates (1). It came raised (Marfu'), but it is not authentic (2), but the correct is that it is stopped (Mawquf) at Abu Musa Al-Ash'ari, may Allah be pleased with him. This is Ahmad's saying in a narration (3). So by the saying of Abu Musa Al-Ash'ari, that was restricted to these four. Examples of this are many, but I emphasize that there might be dispute in some examples: Are they from interpreting the text or initiating the ruling? In both cases there is no problem in that according to what was explained previously. * * *",
    "foot_note": "1. Narrated by Ibn Abi Shaybah (10118). \n2. Narrated by Ahmad (5/228) number (21989) and others, and authenticated by the verifiers of Al-Musnad. \n3. See: \"Al-Mughni\" by Ibn Qudamah (2/293).",
    "book_id": "271",
    "new_page_number": 31
  },
  {
    "serial_number": "3428268",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 35,
    "volume_number": 1,
    "text": "Section Three. Action if Companions Disagree. The discussion in this section is about the third division of the Companion's Madhhab, which is: What if the Companions, may Allah be pleased with them, disagree on an issue? It is good to note that the default is that there is no disagreement among Companions; therefore, one must try to reconcile their sayings so that their sayings become one saying. A group of people of knowledge did that, including Ibn Qudamah - may Allah Almighty have mercy on him - in \"Al-Mughni\" in an issue related to Sujud Al-Tilawah (1). And Sheikh Al-Islam Ibn Taymiyyah in \"Sharh Al-Umdah\" (2) when he mentioned an issue and elaborated on it, he clarified - may Allah have mercy on him - that the default is that the sayings of Companions are one, so he reconciled the sayings and removed the disagreement in that. This is true, because the default in the sayings of Companions is that they are one saying, and disagreement among them is little. Their closeness to revelation and their witnessing of the Messenger of Allah, peace and blessings be upon him, minimizes disagreement among them. But with the condition that if Companions' sayings are combined, one does not exit with a new innovated saying. If scholars differ on an issue with three sayings, and disagreement occurred among Companions, and one combined their sayings, resulting in a fourth innovated saying, this is a mistake. This division - which is what Companions differed in - has two cases: First Case: That there is evidence in the issue: If evidence appears in the issue, it is obligatory to act",
    "foot_note": "1. See: \"Al-Mughni\" by Ibn Qudamah (1/447) where he said in it: \"... And we do not know of any opponent to them in their time except the saying of Ibn Umar: Prostration is only upon the one who hears it. So it bears the possibility that he meant whoever hears with intent, so his speech is interpreted to reconcile between their sayings.\" \n2. See: \"Sharh Al-Umdah\" by Ibn Taymiyyah (1/105)",
    "book_id": "271",
    "new_page_number": 32
  },
  {
    "serial_number": "3428269",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Al-Intisar fi Hujjiyat Qawl Al-Sahabah Al-Akhyar",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 36,
    "volume_number": 1,
    "text": "by the evidence by consensus. Al-Shafi'i's saying preceded: Scholars agreed that whoever the Sunnah of the Prophet, peace and blessings be upon him, becomes clear to, has no right to leave it for the saying of anyone, whoever he may be (1). So if Abu Bakr, Umar, Uthman, and Ali are on one side, and Ibn Abbas is on another, and the textual evidence is with Ibn Abbas, then the saying is the saying of Ibn Abbas due to the obligation of acting by the evidence. Second Case: That there is no evidence in the issue: This case has two divisions: First Division: That there is a saying of the Rightly Guided Caliphs in the issue, or a saying of one of them, but he was not opposed. Like if it is Ali's saying, but none of the Rightly Guided Caliphs opposed him. In such a case, the saying of the four agreed upon, or the saying of one of them who was not opposed by them, is preferred; due to what preceded of the hadith of Al-Irbad bin Sariyah: «You must follow my Sunnah and the Sunnah of the Rightly Guided Caliphs, the Guided ones» (2), and the hadith of Abu Qatadah: «If the people obey Abu Bakr and Umar, they will be rightly guided» (3). It was established from Ibn Abbas in what Ibn Abd al-Barr (4) and others narrated, that he used to argue with the saying of Abu Bakr and Umar, may Allah be pleased with them and please them. To this went Imam Al-Shafi'i (5) and Ahmad in a narration (6), and Imam Ibn Al-Qayyim, may Allah have mercy on him, established it strongly in his book \"I'lam Al-Muwaqqi'in\" (7).",
    "foot_note": "1. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (2/11). \n2. Its referencing preceded. \n3. Its referencing preceded. \n4. Narrated by Ibn Abd al-Barr in \"Jami' Bayan Al-Ilm wa Fadlihi\" (1600), and it is in Ibn Abi Shaybah (23448), and Al-Hakim (1/127) and he said: This is a Sahih hadith on the condition of the two Sheikhs, and it has Tawqif (being raised to Prophet) and they did not extract it. \n5. See: \"Al-Bahr Al-Muhit\" by Al-Zarkashi (8/55), and (8/58). \n6. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (5/546-547). \n7. See: \"I'lam Al-Muwaqqi'in\" by Ibn Al-Qayyim (3/556), and (5/546-547), and (6/5-6).",
    "book_id": "271",
    "new_page_number": 33
  },
  {
    "serial_number": "3428270",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 37,
    "volume_number": 1,
    "text": "Examples of this include the following:\n\nFirst Example: Scholars disputed regarding the recitation of the Qur'an by a person in a state of major ritual impurity (Junub), holding two opinions:\nIbn Abbas said, as suspended (mu'allaq) by Al-Bukhari: There is no harm for a Junub to recite the Qur'an (1).\nThe second opinion: It is established from Umar and Ali. Ali said, as narrated by Ibn Abi Shaybah: He should not read, not even a letter, meaning the Junub (2). The prohibition for the Junub to recite the Qur'an is also established from Umar in Al-Bayhaqi's \"Al-Khilafiyyat\" (3). Therefore, the opinion that it is impermissible for a Junub to recite the Qur'an is preferred; because it is an opinion held by some of the Righteous Caliphs, and this is the view adopted by the Imams of the four schools of thought (4).\n\nSecond Example: Scholars disputed regarding staying overnight in Mina for the pilgrim. Ibn Abbas held that staying overnight in Mina is not obligatory (5). However, Umar opposed this, as narrated by Malik in \"Al-Muwatta\" (6), where he used to send people back so they would stay overnight in Mina. This indicates the obligation of staying overnight in Mina, and this is the correct view. This opinion was adopted by Malik (7), Al-Shafi'i (8), and Ahmad in one narration (9).\n\nNotice: Ibn al-Qayyim clarified that if the four [Caliphs] differ, the saying of Abu Bakr takes precedence over Umar, and the saying of Abu Bakr and Umar takes precedence over Uthman. He said: Whoever studies the depths of issues, this matter, or something of it, will become apparent to him (10).",
    "foot_note": "1. Narrated by Al-Bukhari in a suspended form (mu'allaq) in (1/68) before hadith (305).\n2. Narrated by Ibn Abi Shaybah (1092), and it is in Abd al-Razzaq (1306) and others.\n3. See: \"Al-Khilafiyyat\" by Al-Bayhaqi (2/38) number (325).\n4. See: \"Bada'i' al-Sana'i'\" by Al-Kasani (1/37-38), \"Al-Dhakhira\" by Al-Qarafi (1/316), \"Al-Muhadhdhab ma'a Al-Majmu'\" by Al-Shirazi (1/64), \"Mukhtasar Al-Khiraqi ma'a Al-Mughni\" (1/96).\n5. Narrated by Ibn Abi Shaybah (14614), and he has another opinion similar to the opinion of Umar, may Allah be pleased with them both, as in Ibn Abi Shaybah (14602) as well.\n6. See: \"Al-Muwatta - Yahya al-Laithi's Narration\" (910), and similarly in Ibn Abi Shaybah (14603) and others.\n7. See: \"Al-Mughni\" by Ibn Qudamah (2/231).\n8. See: \"Al-Mughni\" by Ibn Qudamah (2/231).\n9. See: \"Al-Mughni\" by Ibn Qudamah (2/231).\n10. See: \"I'lam al-Muwaqqi'in\" by Ibn al-Qayyim (5/546-547).",
    "book_id": "271",
    "new_page_number": 34
  },
  {
    "serial_number": "3428271",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 38,
    "volume_number": 1,
    "text": "The Second Category: That there is no opinion from one of the four Righteous Caliphs regarding the issue, but the disagreement is among the rest of the Companions. - And I emphasize that the issue is raised if there is no [explicit] text regarding it -: If the Companions other than the Righteous Caliphs differ among themselves, the opinion that is most similar to the Qur'an and Sunnah is preferred. This was stated by Imam Al-Shafi'i (1) and Ahmad (2) - may Allah Almighty have mercy on them broadly.\n\nThere are examples of this:\nFirst Example: Scholars disputed regarding facing the Qibla or turning one's back to it for someone who wants to relieve themselves. The Companions have two opinions on this issue:\nThe First Opinion: The prohibition of facing or turning one's back to it, even inside buildings. This is the opinion of Abu Ayyub Al-Ansari in the \"Two Sahihs\" (3).\nThe Second Opinion: The permissibility of facing and turning one's back to it inside buildings but not in the open desert. This is the opinion of Ibn Umar, may Allah be pleased with him. Al-Daraqutni and others narrated that when he wanted to relieve himself, he placed his mount in front of him and relieved himself. When he was asked about it, he said: That applies only in open space (4).",
    "foot_note": "1. See: \"Al-Ihkam\" by Al-Amidi (4/149), and \"Al-Bahr Al-Muhit\" by Al-Zarkashi (8/57).\n2. See: \"Al-Ihkam\" by Al-Amidi (4/149), \"Al-Bahr Al-Muhit\" by Al-Zarkashi (8/57), and \"I'lam al-Muwaqqi'in\" by Ibn al-Qayyim (2/55).\n3. Narrated by Al-Bukhari (394), and Muslim (264). See his opinion in: \"Al-Musannaf\" by Ibn Abi Shaybah (1/150), \"Al-Muhalla\" by Ibn Hazm (1/189), and \"Al-Majmu'\" by Al-Nawawi (2/81). It is also the opinion of Ibn Masud and Abu Hurairah as in: \"Al-Muhalla\" by Ibn Hazm (1/189).\n4. Narrated by Al-Daraqutni (1/92) number (161), and he said: This is authentic, all of them are trustworthy (thiqat). See his opinion in: \"Al-Muhalla\" by Ibn Hazm (1/190), \"Al-Majmu'\" by Al-Nawawi (2/81). It is also narrated from Al-Abbas bin Abd al-Muttalib as in: \"Al-Majmu'\" (2/81), \"Sharh Muslim\" (3/154), and \"Sharh Abi Dawood\" (p. 106), all three by Al-Nawawi.",
    "book_id": "271",
    "new_page_number": 35
  },
  {
    "serial_number": "3428272",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 39,
    "volume_number": 1,
    "text": "The point is that Ibn Umar differentiated between the two situations, unlike Abu Ayyub Al-Ansari. We wanted to understand deeply and look at which of the two opinions is more akin to the Qur'an and Sunnah. We found that it is established from the Messenger of Allah, peace and blessings be upon him, in the \"Two Sahihs\" (1) that he urinated with his back towards the Qibla inside a building. This action is more akin to the opinion of the one distinguishing between buildings and open deserts; therefore, Ibn Umar's opinion is preferred.\nIf it is said: Why not say that turning the back is permissible but facing it is not? It is said: Because this opinion is not found among the Companions. Rather, the Companions differed on two opinions, and it is not permissible for us to depart from their two opinions. This is an important rule; Imam Ahmad was asked about a man who says: 'If the Companions differed on two opinions, we depart from their two opinions.' He said: 'This is a foul statement; this is the statement of the people of innovation' (2). Because we are commanded to follow the path of the believers, and the path of the believers in this issue consists of two opinions, so we do not depart from them.\n\nSecond Example: Scholars disputed regarding the regular Sunnah prayers (Rawatib) for the traveler: Are they prayed or not? There are two opinions on the issue:\nThe First Opinion: The opinion of Ibn Umar: That they are not prayed (3).\nThe Second Opinion: That they are prayed. This is the opinion of the majority of the Companions, narrated by Al-Hasan Al-Basri from the Companions, and it is the opinion of Jabir, Ibn Abbas, and a group of the Companions (4).\nThe opinion most similar to the Book and Sunnah becomes clear by looking at the evidences: It is established in \"Sahih Muslim\" from the hadith of Abu Qatada, that the Prophet, peace and blessings be upon him, was traveling,",
    "foot_note": "1. Narrated by Al-Bukhari (145) and (148), and Muslim (266).\n2. See: Al-Musawwada p. 315 and Al-Uddah by Abu Ya'la (4/1059).\n3. Narrated by Ibn al-Mundhir in \"Al-Awsat\" (2763). See: Muslim (689).\n4. See: \"Al-Awsat\" by Ibn al-Mundhir (5/248).",
    "book_id": "271",
    "new_page_number": 36
  },
  {
    "serial_number": "3428273",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 40,
    "volume_number": 1,
    "text": "and he missed the Fajr prayer, so he stood up and prayed the Sunnah of Fajr, then he prayed Fajr as he used to pray (1). So, he prayed the regular Sunnah (Ratibah), and this agrees with the opinion of the majority of the Companions, so it is more akin to the Book and Sunnah.\nIf someone were to say: None of the regular Sunnahs are prayed except the Sunnah of Fajr, it is said: This is an innovated saying regarding the opinions of the Companions. This has not been established, as far as I know, from Ibn Umar or anyone else—meaning the exception. Rather, what is established from Ibn Umar is that he does not pray [Sunnahs] absolutely, or he distinguishes between night and day: meaning it is permissible to pray the regular Sunnahs at night but not during the day (2). In both possibilities: the implication of his school is that the Fajr Sunnah is not prayed. Yet, it is established in the Sunnah from the Messenger of Allah, peace and blessings be upon him, that he prayed the Fajr Sunnah while traveling. This indicates that the traveler prays the regular Sunnahs. This is the famous opinion in the four schools of thought; in fact, the four schools are upon this (3).\n\nThird Example: Al-Bukhari noted in a suspended form from Buraydah ibn al-Husayb, may Allah be pleased with him, that he requested that two palm branches be placed on his grave (4); because it is established from the Messenger of Allah, peace and blessings be upon him, from the hadith of Ibn Abbas in the \"Two Sahihs\", that he placed a fresh palm branch on the grave, and then said: \"Perhaps it will lighten [the punishment] for them as long as they do not dry out\" (5). So Buraydah ibn al-Husayb, may Allah be pleased with him, did that, and Ibn Umar opposed him. Al-Bukhari mentioned that when Ibn Umar saw a man shading a grave, he said: Do not shade it, for only his deeds shade him (6). So the deceased",
    "foot_note": "1. Narrated by Muslim (681).\n2. Narrated by Ibn al-Mundhir in \"Al-Awsat\" (2764) from Ibn Umar.\n3. See: \"Al-Durr Al-Mukhtar with Ibn Abidin's Footnote\" (2/131), \"Al-Istidhkar\" by Ibn Abd al-Barr (2/254), \"Al-Majmu'\" by Al-Nawawi (4/400-401), \"Al-Insaf\" by Al-Mardawi (2/322).\n4. Narrated by Al-Bukhari in a suspended form in (2/95) before hadith (1361).\n5. Narrated by Al-Bukhari (1361), and Muslim (292).\n6. Narrated by Al-Bukhari in a suspended form in (2/95) before hadith (1361).",
    "book_id": "271",
    "new_page_number": 37
  },
  {
    "serial_number": "3428274",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 41,
    "volume_number": 1,
    "text": "is not benefited by shading his grave nor by anything done upon it. So Ibn Umar opposed Buraydah.\nThe opinion most akin to the Book and Sunnah is known by the fact that the Prophet, peace and blessings be upon him, justified placing the palm branches on the two graves with something that implies revealing the Unseen; because he said: \"They are being punished,\" and this [knowledge] is not for anyone else, nor did he, peace and blessings be upon him, do it for others. This indicates that the correct view is the school of Ibn Umar, may Allah be pleased with them both.\n\nFourth Example: It is established that Ibn Umar used to imitate the Prophet, peace and blessings be upon him, so he would go via the path he went... etc (1). And it is established from Umar in Ibn Abi Shaybah that he saw people tracking the places of the Prophet, peace and blessings be upon him, so he disapproved of them. Meaning, when they returned from Hajj, he saw groups praying in a place, so he asked them. They said: The Prophet, peace and blessings be upon him, prayed in this [place]. So he disapproved of them, saying: 'Those before you were only destroyed by their tracking the places of worship and synagogues of their prophets. So whoever is overtaken by prayer [time] let him pray, otherwise let him leave' (2). So the saying of Umar takes precedence over the saying of Ibn Umar; because he is a Righteous Caliph, and for other preferring factors.\nExamples of this are many, and I only intended by these examples to mention an instance so that others may be known, and to make it easy to apply this to other numerous issues.\n* * *",
    "foot_note": "1. Narrated by Ibn Abi Shaybah (35793), and Al-Bayhaqi in \"Al-Sunan Al-Kubra\" (5/249) and others.\n2. Narrated by Ibn Abi Shaybah (7632), and it is in Abd al-Razzaq (2734), and Ibn Waddah in \"Al-Bida'\" (101) and others.",
    "book_id": "271",
    "new_page_number": 38
  },
  {
    "serial_number": "3428275",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 43,
    "volume_number": 1,
    "text": "Chapter Three\nImportant Alerts\nIt contains three sections:\n* Section One: Refuting those who said: The saying of a Companion is proof in interpreting the text, not in initiating a ruling.\n* Section Two: Verifying the application (Tahqiq al-Manat) of the Companion's school of thought.\n* Section Three: Those who wasted the use of the Companion's school of thought as proof.",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 39
  },
  {
    "serial_number": "3428276",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 45,
    "volume_number": 1,
    "text": "Section One\nRefuting those who said: The saying of a Companion is proof in interpreting the text, not in initiating a ruling\nSome claimed: That the saying of a Companion is proof in interpreting the text, not in initiating a ruling. This is undoubtedly a contradiction; because whoever says: It is proof in interpreting the text; because it is the path of the believers... and other evidences, then the proof is a proof whether it interprets a text or initiates a ruling. That is because one must either say: It is not a proof neither in interpreting the text nor in initiating a ruling, or that it is a proof in interpreting the text and initiating a ruling. This is because acting upon two evidences is better than neglecting one of them. As for differentiating between them, it is differentiating between similarities, and such is a contradiction.\n* * *",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 40
  },
  {
    "serial_number": "3428277",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 46,
    "volume_number": 1,
    "text": "Section Two\nVerifying the application of the Companion's school of thought\nTwo scholars or two students of knowledge might agree that the school of thought of a Companion is proof, but differ in applying that. This is a wide door, and the Usul scholars call it \"Tahqiq al-Manat\" (Verifying the Applicability of the Rule).\nVerifying the applicability applies to two things:\nOne of them: Applying issues to realities: Two people might dispute in applying issues to reality. One might say: It is obligatory to act upon the saying of the Companion, while in another issue he does not act upon it; that is because the saying of the Companion was hidden from him, or he thinks it contradicts the text while it does not... etc. Therefore, we do not invalidate the principles of a scholar by his action. Ata said: The weakest knowledge is to say: 'I saw [someone doing]'. Ibn Abd al-Barr extracted it in \"Jami' Bayan al-Ilm wa Fadlihi\" (1). A scholar might establish principles for things but oppose that in practice. This is a wide door due to the difference among people in understanding and perception.\nSheikh al-Islam's book \"Raf' al-Malam\" is extremely useful in this regard. Sheikh al-Islam attributed it to the following:\nFirst Matter: The evidence might not have reached the scholar, and in what we are dealing with, the Athar (Companion's report) did not reach him.\nSecond Matter: It might have reached him, but he understood it differently.\nThird Matter: He might think it is abrogated (2).",
    "foot_note": "1. See: \"Bayan Jami' al-Ilm wa Fadlihi\" by Ibn Abd al-Barr (1/778).\n2. See: \"Raf' al-Malam 'an al-A'immah al-A'lam\" by Ibn Taymiyyah (p. 9).",
    "book_id": "271",
    "new_page_number": 41
  },
  {
    "serial_number": "3428278",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 47,
    "volume_number": 1,
    "text": "And Sheikh al-Islam's speech is regarding what relates to the hadiths of the Prophet, peace and blessings be upon him, and the entire discussion is about the establishment of the text. So how much more so when two might differ on the establishment of an Athar (Companion report), just as they differ on the establishment of a Hadith. The disagreement in this is vast, and what is important is that we agree on the principles.\n* * *",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 42
  },
  {
    "serial_number": "3428279",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 48,
    "volume_number": 1,
    "text": "Section Three\nThose who wasted the use of the Companion's school of thought as proof\nTwo groups have wasted the use of the Companion's school of thought as proof:\n\nThe First Group: The Zahiris (Literalists):\nThe Zahiris have innovated principles, which are five principles. Ibn al-Qayyim mentioned four in \"I'lam al-Muwaqqi'in\" (1), and Ibn Rajab mentioned a fifth in his explanation of Al-Bukhari (2) and his treatise \"The Superiority of the Knowledge of the Salaf over the Knowledge of the Khalaf\" (3). So the Zahiris went astray through five principles. The fifth principle concerns me, which is the one mentioned by Ibn Rajab in his treatise \"The Superiority of the Knowledge of the Salaf over the Knowledge of the Khalaf\" and in his explanation of Al-Bukhari, and Ibn Taymiyyah, may Allah have mercy on him, pointed to it in the fifth volume of his book \"Minhaj al-Sunnah\" (4).\nThat is, the Zahiris view [it permissible] to introduce a new opinion in Fiqh. So if the Companions differed on two opinions, or indeed even if the Companions agreed on an opinion, the Zahiris do not care about it and see the permissibility of introducing a new opinion. Therefore, their school is misguided, and it is a mistake to attribute it to Ahl al-Hadith. Ibn Rajab, may Allah have mercy on him, clarified this error in his treatise \"The Superiority of the Knowledge of the Salaf over the Knowledge of the Khalaf\" (5). Unfortunately, many attribute the school of Dawood and the school of Ibn Hazm to Ahl al-Hadith, yet",
    "foot_note": "1. See: \"I'lam al-Muwaqqi'in\" by Ibn al-Qayyim (3/98-107).\n2. See: \"Fath al-Bari\" by Ibn Rajab (4/242), and (6/105).\n3. See: \"Majmu' Rasa'il Ibn Rajab - Risalah Fadl Ilm al-Salaf 'ala al-Khalaf\" (2/24).\n4. See: \"Minhaj al-Sunnah\" by Ibn Taymiyyah (5/178).\n5. See: \"Majmu' Rasa'il Ibn Rajab - Risalah Fadl Ilm al-Salaf 'ala al-Khalaf\" (2/24).",
    "book_id": "271",
    "new_page_number": 43
  },
  {
    "serial_number": "3428280",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 49,
    "volume_number": 1,
    "text": "Al-Shatibi, may Allah have mercy on him, mentioned in two places in his book \"Al-I'tisam\" (1), and before him Ibn al-Arabi mentioned (2), that the Zahiris are innovators; because they went astray in major principles. This was previously discussed in the treatise \"The Authority of Consensus and Clarifying Some Doubts\" (3).\nThe point is that the Zahiri view of the permissibility of introducing a new opinion is what has spread today among some students of knowledge, and they have started calling that \"the School of Ahl al-Hadith.\" They say: We are Hadith scholars (Muhaddithun), and concerned with Hadith, and they do not care about the sayings of the Companions, neither in interpreting the text nor in initiating a ruling, or they act upon it in interpreting the text but do not act upon it in initiating a ruling. This is from being influenced by the Zahiri school.\n\nAs for the second group that went astray in this chapter: They are the fanatics of the four schools of thought. That is because the fanatics of the four schools did not only go astray in the chapter of turning away from the authority of the Companion's saying, but even from the Qur'an and Sunnah, and from Consensus and Analogy, and all evidences of Sharia. What matters to them is adhering to the Madhhab. Fanaticism for the four schools was dead and buried in the eras of the three reviver Imams: Ibn Baz, Al-Albani, and Ibn Uthaymeen - may Allah have mercy on them.\nThe beginning of fighting fanaticism strongly launched in the era of Imam Muhammad bin Abd al-Wahhab - may Allah Almighty have mercy on him -, where he fought fanaticism intensely, as mentioned in various places, including \"The Six Principles\" (4), and \"The Book of Monotheism\" (5), and in his letter to Abdullah bin Muhammad bin",
    "foot_note": "1. See: \"Al-I'tisam\" by Al-Shatibi (2/457), and (3/198).\n2. See: \"Siyar A'lam al-Nubala\" by Al-Dhahabi (18/188-190) where Ibn al-Arabi was harsh against the Zahiris and Ibn Hazm, and Al-Dhahabi critiqued him on that.\n3. See: \"Hujjiyat al-Ijma' wa Kashf Ba'd al-Shubuhat\" (p.).\n4. See: \"Al-Usul al-Sitta ma'a Kashf al-Shubuhat - The Sixth Principle\" by Ibn Abd al-Wahhab (p. 148).\n5. See: \"Kitab al-Tawhid ma'a al-Qawl al-Mufid - Chapter: Whoever obeys scholars and rulers in prohibiting what Allah permitted or permitting what He prohibited has taken them as lords\" by Ibn Abd al-Wahhab (2/149).",
    "book_id": "271",
    "new_page_number": 44
  },
  {
    "serial_number": "3428281",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 50,
    "volume_number": 1,
    "text": "Abd al-Latif found in \"Al-Durar Al-Sunniyyah\" (1). He was strict and explained to him the prohibition of fanaticism and that it is invalid. He mentioned to him the great debate narrated by Ibn Abd al-Barr from Al-Muzani in his book \"Jami' Bayan al-Ilm wa Fadlihi\" (2), and that everything the fanatics argue with is an argument against them, not for them.\nThis doctrinal stagnation caused much harm, but Imam Muhammad bin Abd al-Wahhab played a major role in eliminating it. The Najdi Salafi Da'wah became famous for fighting doctrinal fanaticism. Therefore, if they explain Hanbali texts, they explain them and conceptualize the issues, but they state what became apparent to them through evidence. They might explain according to the Madhhab, but they state the choices of Sheikh al-Islam Ibn Taymiyyah and Ibn al-Qayyim, and they deny innovations found in the Madhhab, such as seeking blessings [from things/people not legislated] and affirming innovated tawassul, and so on... then they give fatwa based on Sharia evidence. They study the Madhhab and learn Fiqh through it as a means to understanding Fiqh, and they do not care about this means [as an end in itself], until Imam Ibn Baz, Imam Al-Albani, and Imam Ibn Uthaymeen came and eliminated what remained of the legacy of fanaticism.\nI remember that a group of Hanbalis present with us in Najd, from the fanatics of the Madhhab, were not like this in their early days. Rather, they used to study it as a means, then after that, they became fanatics... This is because nothing remained with them except this knowledge - which is studying the Madhhab as a means - so their lives passed on this path, and they were ashamed to say to people: \"We do not know.\" So they resorted to fanaticism because it was easier for them. Many of their Sheikhs do not verify issues, nor can they verify them. If they verify a number of issues, they do not verify most of them. Therefore, they resorted to doctrinal fanaticism; because it is the fastest way for a man to be described as a jurist (Faqih). This became famous until these three scholars eliminated it. I even remember - more than twenty years ago - I met one of the fanatics of",
    "foot_note": "1. See: \"Al-Durar Al-Sunniyyah fi Al-Kutub Al-Najdiyyah\" (1/35 and following).\n2. See: \"Jami' Bayan al-Ilm wa Fadlihi\" by Ibn Abd al-Barr (2/992).",
    "book_id": "271",
    "new_page_number": 45
  },
  {
    "serial_number": "3428282",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 51,
    "volume_number": 1,
    "text": "the Hanbali Madhhab. When he did something, I said to him: What you are doing contradicts the evidence. He said: Glory be to Allah! Should I take your saying and leave the saying of Imam Ahmad who memorized a million hadith? This is fanaticism itself; {They follow not except assumption}.\nThe reality of this objection destroys doctrinal fanaticism - if he understood - for it could be said to him: Should I take Ahmad's saying and leave the saying of Umar, Uthman, and Ali; who are the noble Companions? Then a Shafi'i comes and says: Should I take Ahmad's saying and leave the saying of his teacher Al-Shafi'i? I even heard a Shafi'i scholar a while ago starting his first lesson saying: The author whose book we want to explain follows the Shafi'i Madhhab. Then he said: On this occasion, I invite those present among us from the Hanbalis to return to the Shafi'i Madhhab; because Al-Shafi'i is Ahmad's teacher, and he [Ahmad] is a fruit of Al-Shafi'i's fruits, so return to the Shafi'i Madhhab... This was a lesson in Tawheed (Monotheism) and he started it with fanaticism and blind imitation?!\nReturning to the news of the man who said: Should I take your saying and leave the saying of Imam Ahmad who memorized a million hadith? With discussion, he said: I studied the four schools and I understand them well, but I do not leave Ahmad's school. He said: I attended Sheikh Al-Sa'di's lessons, and every saying Sheikh Al-Sa'di said contradicting Ahmad's saying, I threw it against the wall. Then I attended for a few years with Sheikh Ibn Uthaymeen, and every saying Ibn Uthaymeen said contradicting Ahmad's school, I threw it against the wall. Do you see how fanaticism is? This man did not reach what he reached directly, but rather firstly: he studied the Madhhab, then secondly: he faulted following the evidence; either because it was difficult for him or because one of his Sheikhs raised him on fanaticism in the name of grounding in Fiqh... etc.",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 46
  },
  {
    "serial_number": "3428283",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 52,
    "volume_number": 1,
    "text": "I visited a person years ago, after he was appointed to a Sharia position. A discussion took place regarding issues of knowledge. When the dispute intensified, he would open \"Al-Rawd\" [a Hanbali fiqh book], read the issue, then say: The author of \"Al-Rawd\" says such and such, he doesn't have [in his mind]: The Prophet, peace be upon him, said...!!\nAmong the many words of our Sheikh Ibn Baz - may Allah Almighty have mercy on him - which I heard from him repeatedly, and others heard even more, is that if it was said to him regarding an issue: Ibn Taymiyyah said such and such, how can you oppose Ibn Taymiyyah? He would say: Is he a Prophet? The consideration is the evidence. He repeated this often, may Allah have mercy on him. An interview was conducted with him where he stated about himself that he studied the Hanbali Madhhab, - then he said -: But I do not know of a single day where I gave a fatwa without evidence, whether it agreed with Ahmad's school or opposed it (1).\nWe should be moderate; we study the schools of thought, but we do not abandon relying on evidence, nor do we fault this. Rather, we combine both matters; because time is limited. It is possible to proceed in a way where you study one of the four schools in Fiqh and conceptualize the issues, and at the same time study it with evidence under a trustworthy scholar. Because there is no time; people are no longer as they were before, finishing \"Al-Zad\" in a year, studying it in a daily lesson, studying it slowly. If someone could be found who finishes \"Al-Zad\" in a year slowly, conceptualizing its issues, it would be beneficial to study \"Al-Zad\" with him, then after that launch into Ijtihad (independent reasoning) and knowing the evidence, not stopping at this limit.\nThe reality of many is that they start with a brief text, then intermediate, then extensive, sticking to the Madhhab. They study this for ten or fifteen years, then they slacken from looking",
    "foot_note": "1. See something similar in: \"Majmu' Fatawa wa Rasa'il Sheikh Ibn Baz - Meeting with Al-Rayah Al-Sudaniyyah Newspaper\" edited by Al-Shuway'ir (4/166).",
    "book_id": "271",
    "new_page_number": 47
  },
  {
    "serial_number": "3428284",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 53,
    "volume_number": 1,
    "text": "at the evidence. Not wanting to be described as ignorant, they said: \"We are Hanbalis,\" and found fault with others who study with evidence. Then they increased in fanaticism, justifying their fanaticism with things including:\nFirst Matter: Their saying: \"Are you more knowledgeable than Ahmad?\" While noting that this sectarian view might not even have been said by Ahmad. Therefore, Imam Muhammad bin Abd al-Wahhab said: Most of what is in \"Al-Iqna'\" and \"Al-Muntaha\" contradicts Ahmad's texts (1). Indeed, it is possible he said the opposite, or it was attributed to him by extrapolation (Takhrij) and not textually, and extrapolation differs in its attribution to the Imam. Yet it is said: Ahmad said it. If you scrutinized, perhaps you wouldn't find Ahmad saying it, but rather finding Ahmad saying the opposite.\nSecond Matter: Their saying: You have not reached the degree of Ijtihad to say: Allah said such and such, and the Prophet, peace be upon him, said such and such. By saying this, we returned to closing the door of Ijtihad. They might not explicitly say the door of Ijtihad is closed, but they prevent Ijtihad on the pretext that you haven't reached it, and call for blind imitation (Taqlid) and fanaticism.\nThe answer to this is to say: Ijtihad is divisible. We have studied the tool of inference and deduction, and I have studied this issue, and such and such became apparent to me, and the tool of Ijtihad says such and such. So by what argument before Allah do I oppose that?\nFinally: Just as fanaticism for the Zahiris in the name of Ahl al-Hadith is fought - which has begun to decrease, praise be to Allah, though it still exists - likewise fanaticism for the Madhhabs is fought. These fanatics have become types and parties fighting each other; until I saw one of them in a certain country criticizing those who explain the Hanbali Madhhab according to the method of so-and-so...",
    "foot_note": "1. See: \"Hashiyat al-Rawd al-Murbi'\" by Ibn Qasim (1/17-18).",
    "book_id": "271",
    "new_page_number": 48
  },
  {
    "serial_number": "3428285",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 54,
    "volume_number": 1,
    "text": "This man says: How can the Hanbali Madhhab be explained according to the method of Sheikh Muhammad bin Abd al-Wahhab? These people corrupted the Madhhab. We want the Madhhab as it is: meaning according to the old method of the people of Sham (Levant) that was famous among the people of Sham. Some followers of the Madhhab respond to that man, saying: Your call opens the door to innovations; because Imam Muhammad bin Abd al-Wahhab purified the Madhhab from innovated sayings, relying in that on the saying of Sheikh al-Islam Ibn Taymiyyah, Ibn al-Qayyim, and the Salaf, and so on...\n* * *",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 49
  },
  {
    "serial_number": "3428286",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 55,
    "volume_number": 1,
    "text": "Conclusion\nI ask Allah, besides Whom there is no god, to teach us what benefits us, and benefit us with what He taught us, and guide us to the Straight Path, and keep us all alive on Tawheed and Sunnah, and cause us to die upon that, and avoid us trials, what is apparent of them and what is hidden.",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 50
  },
  {
    "serial_number": "3428287",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "The Victory in the Authority of the Sayings of the Chosen Companions (Al-Intisar fi Hujjiyat Qawl al-Sahabah al-Akhyar)",
    "edition": "First, 1440 AH",
    "publisher": "Sutoor Center for Scientific Research, Dar Al-Imam Muslim for Publishing and Distribution - Medina",
    "page_number": 56,
    "volume_number": 1,
    "text": "The most important results extracted from this treatise are as follows:\n1 - Defining the point of dispute regarding the authority of the Companion's saying in four matters.\n2 - The saying of the Companions is proof whether it became famous or not.\n3 - The authority of the Companion's saying is from predominant conjecture (Zann Ghalib).\n4 - Among the evidences for the authority of the Companion's saying are the evidences for the authority of Consensus.\n5 - The Companions have perceptions we share with them and perceptions they are separate from us in.\n6 - The saying of the Companions is proof whether in initiating a ruling or interpreting a text by specification, restriction, or clarification.\n7 - The method of reconciling between the sayings of the Companions when there is disagreement.\n8 - The saying of the Righteous Caliphs takes precedence over others.\n9 - The Zahiris do not view the saying of the Companions as authoritative, and some people of knowledge were influenced by them.\n10 - People of knowledge declaring the Zahiris as innovators and that they are not from Ahl al-Hadith.\n11 - Just as Zahirism is an error, so too doctrinal fanaticism is an error like it.",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 51
  }
]