[
  {
    "text": "The Virtue of Sending Blessings upon the Prophet (Fadl as-Salat 'ala an-Nabi), Peace Be Upon Him\nAuthor: القاضي أبو إسحاق إسماعيل بن إسحاق بن إسماعيل بن حماد بن زيد الأزدي البصري ثم البغدادي المالكي الجهضمي\nYear: 282",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Virtue of Sending Blessings upon the Prophet (Fadl as-Salat 'ala an-Nabi), Peace Be Upon Him",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 1
  },
  {
    "text": "sn: 5247\nbook_title: فضل الصلاة على النبي صلى الله عليه وسلم\nbook_link: https://shamela.ws/book/684\nbook_id: 684\nauthor_name: القاضي أبو إسحاق إسماعيل بن إسحاق بن إسماعيل بن حماد بن زيد الأزدي البصري ثم البغدادي المالكي الجهضمي\nauthor_year: 282\nnickname: أبو إسحاق\nauthor_link: https://shamela.ws/author/485\nauthor_ID: 485\neditor: تحقيق: محمد ناصر الدين الألباني\npublisher: المكتب الإسلامي - بيروت\nedition: الثالثة - 1977\npages: 87\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الرقائق والآداب والأذكار\ncategory_id: 23",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Virtue of Sending Blessings upon the Prophet (Fadl as-Salat 'ala an-Nabi), Peace Be Upon Him",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 2
  },
  {
    "serial_number": "4965196",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet (Fadl as-Salat 'ala an-Nabi), Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Softening Hearts, Etiquette, and Remembrances\nBook: The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him\nAuthor: Ismail bin Ishaq Al-Qadi Al-Azdi Al-Jahdami (d. 282 AH)\nVerification (Tahqiq): Muhammad Nasir al-Din al-Albani\n[Numbering of the book corresponds to the printed version]\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nBook: The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him\nAuthor: Ismail bin Ishaq Al-Qadi Al-Azdi Al-Jahdami (d. 282 AH)\nVerification: Muhammad Nasir al-Din al-Albani\n[Numbering of the book corresponds to the printed version]\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nAuthor: Ismail bin Ishaq Al-Qadi Al-Azdi Al-Jahdami (d. 282 AH)\nVerification: Muhammad Nasir al-Din al-Albani\n[Numbering of the book corresponds to the printed version]\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nVerification: Muhammad Nasir al-Din al-Albani\n[Numbering of the book corresponds to the printed version]\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nVerification: Muhammad Nasir al-Din al-Albani\n[Numbering of the book corresponds to the printed version]\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nVerification: Muhammad Nasir al-Din al-Albani\n[Numbering of the book corresponds to the printed version]\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\n[Numbering of the book corresponds to the printed version]\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\n[Numbering of the book corresponds to the printed version]\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 3
  },
  {
    "serial_number": "4965197",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 1,
    "volume_number": 1,
    "text": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him\nBy Imam Ismail bin Ishaq Al-Jahdami Al-Qadi Al-Maliki\nVerification by the Allamah, the Muhaddith Muhammad Nasir al-Din al-Albani\nAl-Maktab Al-Islami, 3rd Edition - 1977 Beirut\n\n1 - (Sahih li-ghayrihi / Authentic due to other evidence) Abu Talhah said: The Messenger of Allah, peace and blessings be upon him, came out to them one day with visible joy on his face. They said: \"We see joy on your face today, O Messenger of Allah.\" He said: \"Yes, a comer from my Lord came to me just now and informed me that no one from my Ummah sends blessings upon me except that Allah returns it to him ten times over.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 4
  },
  {
    "serial_number": "4965199",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 22,
    "volume_number": 1,
    "text": "2 - (Sahih li-ghayrihi / Authentic due to other evidence) From Abdullah ibn Abi Talhah, from his father: That the Messenger of Allah, peace and blessings be upon him, came one day and joy was seen on his face. They said: \"O Messenger of Allah, we see joy on your face that we have not seen before.\" He said: \"Yes, an angel came to me and said: 'O Muhammad, does it not please you that no one from your Ummah sends blessings upon you except that I send blessings upon him ten times, and no one sends peace upon you except that I send peace upon him ten times?'\" [22]\n\n3 - (Isnaduhu Da'if / Its chain is weak) The Messenger of Allah, peace and blessings be upon him, said: \"Whoever sends blessings upon me once, Allah sends blessings upon him ten times. So let him increase in number of that or decrease.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 5
  },
  {
    "serial_number": "4965201",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 23,
    "volume_number": 1,
    "text": "4 - (Isnaduhu Da'if / Its chain is weak) He said: I heard Anas bin Malik say: The Prophet, peace and blessings be upon him, went out to relieve himself and did not find anyone to follow him. So Umar hurried and followed him with a water container (midhah), meaning a leather vessel (idawah), and found him prostrating in a grassy drinking area with no trees. Umar moved aside and sat behind him until he raised his head. He said: He then said, \"You did well, O Umar, when you found me prostrating and moved away from me. Jibreel, peace be upon him, came to me and said: 'Whoever sends blessings upon you once, Allah sends blessings upon him ten times and raises him ten degrees.'\" [23]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 6
  },
  {
    "serial_number": "4965202",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 24,
    "volume_number": 1,
    "text": "5 - (Isnaduhu Da'if / Its chain is weak) From Umar bin Al-Khattab, he said: The Prophet, peace and blessings be upon him, went out to relieve himself, so I followed him with a leather vessel. I found he had finished and found him prostrating to Allah in a drinking area, so I moved away from him. When he finished, he raised his head and said: \"You did well, O Umar, when you moved away from me. Jibreel came to me and said: 'Whoever sends blessings upon you once, Allah sends blessings upon him ten times and raises him ten degrees.'\" [24]\n\n6 - (Isnaduhu Da'if / Its chain is weak) From Asim bin Ubaydullah bin Amir bin Rabi'ah, from his father, he said: I heard the Prophet, peace and blessings be upon him, say: \"There is no servant who sends blessings upon me except that the angels send blessings upon him as long as he sends blessings upon me. So let him decrease from that or increase.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 7
  },
  {
    "serial_number": "4965204",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 25,
    "volume_number": 1,
    "text": "7 - (Isnaduhu Sahih li-ghayrihi / Its chain is authentic due to other evidence) From Abdul Rahman bin Awf, he said: I came to the Prophet, peace and blessings be upon him, while he was prostrating, and he prolonged the prostration. He said: \"Jibreel came to me and said: 'Whoever sends blessings upon you, I send blessings upon him, and whoever sends peace upon you, I send peace upon him.' So I prostrated to Allah in gratitude.\" [25]\n\n8 - (Isnaduhu Sahih / Its chain is authentic) From Abu Huraira that the Messenger of Allah, peace and blessings be upon him, said: \"Whoever sends blessings upon me, Allah sends blessings upon him ten times.\"\n\n9 - (Sahih / Authentic) From Abu Huraira that the Messenger of Allah, peace and blessings be upon him, said: \"Whoever sends blessings upon me once, Allah sends blessings upon him ten times.\"",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "684",
    "new_page_number": 8
  },
  {
    "serial_number": "4965207",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 26,
    "volume_number": 1,
    "text": "10 - (Sahih li-ghayrihi / Authentic due to other evidence) Ibn Awf said: Five or four of the Companions of the Prophet, peace and blessings be upon him, used to never leave his side day or night to attend to his needs. He said: So I came and found he had left, so I followed him. He entered a garden from the gardens of Al-Aswaf and prayed. He prostrated a prostration which he prolonged, so I became sad and wept. I said: 'I think the Messenger of Allah, peace and blessings be upon him, has had his soul taken by Allah.' He said: Then he raised his head and saw me, so he called me and said: 'What is the matter with you?' I said: 'O Messenger of Allah, you prostrated a prostration which you prolonged, so I became sad and wept and said: I think the Messenger of Allah, peace and blessings be upon him, has had his soul taken by Allah.' He said: 'This is a prostration I performed in gratitude to my Lord for what He gave me regarding my Ummah: whoever sends blessings upon me once, Allah writes for him ten good deeds.' [26]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 9
  },
  {
    "serial_number": "4965208",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 27,
    "volume_number": 1,
    "text": "11 - (Isnaduhu Sahih / Its chain is authentic) From Abu Huraira, he said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever sends blessings upon me once, Allah writes for him ten good deeds.\" [27]\n\n12 - (Isnaduhu Da'if Mawquf / Its chain is weak, stopped at the Companion) From Abdul Rahman bin Amr, he said: \"Whoever sends blessings upon the Prophet, peace and blessings be upon him, Allah writes for him ten good deeds, erases from him ten bad deeds, and raises him ten degrees.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 10
  },
  {
    "serial_number": "4965210",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 28,
    "volume_number": 1,
    "text": "13 - Sahih Mursal (Authentic disconnected chain) From Ya'qub bin Zaid bin Talhah Al-Taymi, he said: The Messenger of Allah, peace and blessings be upon him, said: \"A comer from my Lord came to me and said: 'There is no servant who sends blessings upon you once except that Allah sends blessings upon him thereby ten times.'\" A man stood up to him and said: \"O Messenger of Allah, shall I make half of my supplication for you if you wish?\" He said: \"Shall I make two-thirds of my supplication for you?\" He said: \"If you wish.\" He said: \"Shall I make all of my supplication for you?\" He said: \"Then Allah will suffice you the worries of this world and the worries of the Hereafter.\" [28]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 11
  },
  {
    "serial_number": "4965211",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 29,
    "volume_number": 1,
    "text": "14 - (Hasan Sahih / Good Authentic) From At-Tufayl bin Ubayy bin Ka'b, from his father, he said: The Messenger of Allah, peace and blessings be upon him, used to go out in the last two-thirds of the night and say: \"The quaking one has come, followed by the subsequent one. Death has come with what is in it.\" Ubayy said: \"O Messenger of Allah, I pray during the night. Shall I make one-third of my prayer for you?\" The Messenger of Allah, peace and blessings be upon him, said: \"Half.\" He said: \"Shall I make half of my prayer for you?\" The Messenger of Allah, peace and blessings be upon him, said: \"Two-thirds is more.\" He said: \"Shall I make all of my prayer for you?\" He said: \"Then your sin will be entirely forgiven.\" [29]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 12
  },
  {
    "serial_number": "4965212",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 30,
    "volume_number": 1,
    "text": "15 - (Sahih bi-shawahidihi / Authentic with its supporting evidences) Salamah bin Wardan told us, he said: I heard Anas bin Malik say: The Prophet, peace and blessings be upon him, ascended the pulpit one step and said 'Amin', then ascended the second and said 'Amin', then ascended the third and said 'Amin'. Then he stood straight and sat. His companions said: \"For what did you say Amin?\" He said: \"Jibreel came to me and said: 'May the nose be rubbed in dust of a man in whose presence you are mentioned and he does not send blessings upon you.' So I said: 'Amin.' He said: 'May the nose be rubbed in dust of a man who reaches his parents and does not enter Paradise.' So I said: 'Amin.' He said: 'May the nose be rubbed in dust of a man who reaches Ramadan and is not forgiven.' So I said: 'Amin.'\" [30]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 13
  },
  {
    "serial_number": "4965213",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 31,
    "volume_number": 1,
    "text": "16 - (Sahih / Authentic) From Abu Huraira, he said: The Messenger of Allah, peace and blessings be upon him, said: \"May the nose be rubbed in dust of a man in whose presence I am mentioned and he does not send blessings upon me. And may the nose be rubbed in dust of a man who reaches his parents in old age and they do not cause him to enter Paradise. And may the nose be rubbed in dust of a man whom Ramadan enters upon and then passes before he is forgiven.\" [31]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 14
  },
  {
    "serial_number": "4965214",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 32,
    "volume_number": 1,
    "text": "18 - (Isnaduhu Hasan / Its chain is good) From Abu Huraira: That the Messenger of Allah ascended the pulpit and said: \"Amin, Amin, Amin.\" It was said to him: \"O Messenger of Allah, you did not used to do this.\" He said: \"Jibreel said to me: 'May the nose be rubbed in dust of a servant whom Ramadan enters upon and he is not forgiven.' So I said: 'Amin.' Then he said: 'May the nose be rubbed in dust of a servant who reaches his parents or one of them and they do not cause him to enter Paradise.' So I said: 'Amin.' Then he said: 'May the nose be rubbed in dust of a servant in whose presence you are mentioned and he does not send blessings upon you.' So I said: 'Amin.'\" [32]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 15
  },
  {
    "serial_number": "4965215",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 33,
    "volume_number": 1,
    "text": "19 - (Isnaduhu Sahih bi-shawahidihi / Its chain is authentic with its supporting evidences) From Ka'b bin Ujrah, he said: The Messenger of Allah, peace and blessings be upon him, said: \"Attend the pulpit.\" So we attended. When he ascended a step he said: \"Amin.\" Then he ascended the second step and said: \"Amin.\" Then he ascended the third step and said: \"Amin.\" When he finished, he came down from the pulpit. He said: So we said to him: \"O Messenger of Allah, we heard from you today something we used not to hear.\" He said: \"Jibreel appeared to me and said: 'Distance to him who reaches Ramadan and is not forgiven.' So I said: 'Amin.' When I ascended the second, he said: 'Distance to him in whose presence you are mentioned and he does not send blessings upon you.' So I said: 'Amin.' When I ascended the third, he said: 'Distance to him who reaches his parents in old age or one of them and they do not cause him to enter Paradise.' So I said: 'Amin.'\" [33]\n\n20 - (Sahih li-ghayrihi / Authentic due to other evidence) Ali bin Hussein said to him: My father informed me from his grandfather that he said: The Messenger of Allah, peace and blessings be upon him, said: \"Do not make my grave a place of festivity (Eid), and do not make your houses graves. Send blessings upon me and send peace wherever you may be, for your peace and blessings will reach me.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 16
  },
  {
    "serial_number": "4965217",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 34,
    "volume_number": 1,
    "text": "21 - (Sahih / Authentic) From Abdullah, who is Ibn Mas'ud, from the Prophet, peace and blessings be upon him, he said: \"Indeed, Allah has angels roaming the earth who convey to me the peace from my Ummah.\" [34]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 17
  },
  {
    "serial_number": "4965218",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 35,
    "volume_number": 1,
    "text": "22 - (Isnaduhu Sahih / Its chain is authentic) From Aws bin Aws that the Messenger of Allah, peace and blessings be upon him, said: \"Indeed, among your best days is Friday. In it Adam was created, and in it he was taken (died), and in it is the blowing of the Trumpet, and in it is the swoon. So increase in sending blessings upon me in it, for your blessings are presented to me.\" They said: \"O Messenger of Allah, how are our blessings presented to you when you have decayed ('aramta)?\" - they say: worn away. He said: \"Indeed, Allah has forbidden the earth from consuming the bodies of the Prophets.\" [35]\n\n23 - (Sahih bima qablahu / Authentic due to what precedes it) He said: I heard Al-Hasan say: The Messenger of Allah, peace and blessings be upon him, said: \"The earth does not consume the body of one whom the Holy Spirit spoke to.\"\n\n24 - (Sahih / Authentic) From Ayyub, he said: It has reached me, and Allah knows best, that an angel is appointed for everyone who sends blessings upon the Prophet, peace and blessings be upon him, until he conveys it to the Prophet, peace and blessings be upon him.",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "684",
    "new_page_number": 18
  },
  {
    "serial_number": "4965221",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 36,
    "volume_number": 1,
    "text": "25 - (Isnaduhu Da'if / Its chain is weak) From Bakr bin Abdullah Al-Muzani: The Messenger of Allah, peace and blessings be upon him, said: \"My life is good for you; you speak (narrate/innovate) and things are spoken for you. When I die, my death will be good for you; your deeds will be presented to me. If I see good, I will praise Allah, and if I see other than that, I will ask forgiveness of Allah for you.\" [36]\n\n26 - (Da'if / Weak) From Bakr bin Abdullah that the Messenger of Allah, peace and blessings be upon him, said: \"My life is good for you and my death is good for you. You speak and things are spoken for you. When I die, your deeds will be presented to me. If I see good, I will praise Allah, and if I see evil, I will ask forgiveness of Allah for you.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 19
  },
  {
    "serial_number": "4965223",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 37,
    "volume_number": 1,
    "text": "27 - (Isnaduhu Da'if / Its chain is weak) From Yazid Al-Raqashi: That an angel is appointed on Friday for whoever sends blessings upon the Prophet, peace and blessings be upon him, to convey it to the Prophet, peace and blessings be upon him, saying: 'So-and-so from your Ummah sent blessings upon you.' [37]\n\n28 - (Isnaduhu Sahih / Its chain is authentic) From Al-Hasan, from the Prophet, peace and blessings be upon him, he said: \"Increase sending blessings upon me on Friday.\"\n\n29 - (Isnaduhu Sahih / Its chain is authentic) From Al-Hasan, he said: The Messenger of Allah, peace and blessings be upon him, said: \"Increase sending blessings upon me on Friday, for it is presented to me.\"",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "684",
    "new_page_number": 20
  },
  {
    "serial_number": "4965226",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 38,
    "volume_number": 1,
    "text": "30 - (Isnaduhu Sahih / Its chain is authentic) From Suhayl, he said: I came to greet the Prophet, peace and blessings be upon him, while Hasan son of Hussein was eating dinner in a house near the Prophet, peace and blessings be upon him. He called me, so I came to him. He said: \"Come close and eat dinner.\" He said: I said: \"I do not want it.\" He said: \"Why did I see you standing?\" He said: \"I stood to greet the Prophet, peace and blessings be upon him.\" He said: \"If you enter the Mosque, greet him.\" Then he said: The Messenger of Allah, peace and blessings be upon him, said: \"Pray in your houses and do not make your houses graveyards. May Allah curse the Jews who took the graves of their prophets as places of worship. And send blessings upon me, for your blessings reach me wherever you are.\" [38]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 21
  },
  {
    "serial_number": "4965227",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 39,
    "volume_number": 1,
    "text": "31 - (Sahih / Authentic) From Ali bin Hussein, from his father, that the Messenger of Allah, peace and blessings be upon him, said: \"Indeed, the miser is he in whose presence I am mentioned and he does not send blessings upon me.\" [39]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 22
  },
  {
    "serial_number": "4965228",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 40,
    "volume_number": 1,
    "text": "32 - (Sahih / Authentic) From Abdullah bin Ali bin Al-Hussein, from his father, from his grandfather, he said: The Messenger of Allah, peace and blessings be upon him, said: \"The miser is he in whose presence I am mentioned and he does not send blessings upon me.\" [40]\n\n33 - (Da'if / Weak) That Abdullah bin Ali bin Hussein told him that he heard his father say: The Messenger of Allah, peace and blessings be upon him, said: \"Indeed, the miser is he in whose presence I am mentioned and he does not send blessings upon me.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 23
  },
  {
    "serial_number": "4965230",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 41,
    "volume_number": 1,
    "text": "34 - (Da'if / Weak) Ali ibn Abi Talib said: The Messenger of Allah, peace and blessings be upon him, said: \"Indeed, the miser is he who, if I am mentioned in his presence, does not send blessings upon me.\" [41]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 24
  },
  {
    "serial_number": "4965231",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 42,
    "volume_number": 1,
    "text": "35 - (Sahih / Authentic) From his father, from his grandfather, that the Messenger of Allah, peace and blessings be upon him, said: \"Indeed, the miser is he in whose presence I am mentioned and he does not send blessings upon me.\" [42]\n\n37 - (Sahih / Authentic) From Abu Dharr that the Messenger of Allah, peace and blessings be upon him, said: \"Indeed, the most miserly of people is he in whose presence I am mentioned and he does not send blessings upon me.\"\n\n38 - (Sahih / Authentic) I heard Al-Hasan say: The Messenger of Allah, peace and blessings be upon him, said: \"It is sufficient miserliness for a man that I am mentioned in his presence and he does not send blessings upon me.\"",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "684",
    "new_page_number": 25
  },
  {
    "serial_number": "4965234",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 43,
    "volume_number": 1,
    "text": "39 - (Da'if / Weak) From Al-Hasan, he said: The Messenger of Allah, peace and blessings be upon him, said: \"It is sufficient stinginess for him that I am mentioned among a people and they do not send blessings upon me.\" [43]\n\n40 - (Sahih li-ghayrihi / Authentic due to other evidence) From Al-Hasan, he said: The Messenger of Allah, peace and blessings be upon him, said: \"Increase sending blessings upon me on Friday.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 26
  },
  {
    "serial_number": "4965236",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 44,
    "volume_number": 1,
    "text": "41 - (Sahih li-ghayrihi / Authentic due to other evidence) From Ja'far, from his father, that the Prophet, peace and blessings be upon him, said: \"Whoever forgets sending blessings upon me has missed the gates of Paradise.\" [44]\n\n42 - (Sahih li-ghayrihi / Authentic due to other evidence) From Muhammad bin Ali bin Hussein, he said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever forgets sending blessings upon me has missed the path to Paradise.\" The Messenger of Allah, peace and blessings be upon him, said: \"Whoever I am mentioned in his presence and he does not send blessings upon me has missed the path to Paradise.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 27
  },
  {
    "serial_number": "4965238",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 45,
    "volume_number": 1,
    "text": "43 - (Sahih / Authentic) From Muhammad bin Ali, he said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever forgets sending blessings upon me has missed the path to Paradise.\" [45]\n\n44 - (Sahih / Authentic) From Ja'far bin Muhammad, from his father, that the Prophet, peace and blessings be upon him, said: \"Whoever I am mentioned in his presence and he does not send blessings upon me has missed the path to Paradise.\"\n\n45 - (Da'if / Weak) From Abu Huraira that the Prophet, peace and blessings be upon him, said: \"Send blessings upon the Prophets of Allah and His Messengers, for Allah sent them just as He sent me.\"",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "684",
    "new_page_number": 28
  },
  {
    "serial_number": "4965241",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 46,
    "volume_number": 1,
    "text": "46 - (Da'if / Weak) From Abu Huraira, he said: The Messenger of Allah, peace and blessings be upon him, said: \"Send blessings upon me, for your sending blessings upon me is purification (Zakat) for you.\" He said: \"And ask Allah for Al-Wasilah for me.\" He said: Either he told us or we asked him, he said: \"Al-Wasilah is the highest degree in Paradise, attained only by one man, and I hope that I am that man.\" [46]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 29
  },
  {
    "serial_number": "4965242",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 47,
    "volume_number": 1,
    "text": "47 - (Da'if / Weak) From Ka'b, from the Prophet, peace and blessings be upon him, he said: \"Send blessings upon me, for your sending blessings upon me is purification (Zakat) for you. And ask Allah for Al-Wasilah for me.\" Either they asked him or he informed them, he said: \"It is the highest degree in Paradise, attained only by one man, and I hope that I am he.\" [47]\n\n48 - (Da'if / Weak) From Ibn Abbas, he said: The Messenger of Allah, peace and blessings be upon him, said: \"Ask Allah for Al-Wasilah for me. No Muslim or believer asks it for me except that I will be a witness or intercessor for him\" or \"intercessor or witness\".",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 30
  },
  {
    "serial_number": "4965244",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 48,
    "volume_number": 1,
    "text": "49 - (Sahih / Authentic) That Abu Sa'id Al-Khudri says: The Messenger of Allah, peace and blessings be upon him, said: \"Indeed, Al-Wasilah is a degree with Allah, there is no degree above it. So ask Allah to give me Al-Wasilah over His creation.\" [48]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 31
  },
  {
    "serial_number": "4965245",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 49,
    "volume_number": 1,
    "text": "50 - (Sahih / Authentic) From Abdullah bin Amr, he said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever sends blessings upon me or asks for Al-Wasilah for me, my intercession becomes incumbent upon him on the Day of Resurrection.\" [49]\n\n51 - (Da'if / Weak) From Awn bin Abdullah that the Prophet, peace and blessings be upon him, said: \"Indeed, there is a seat in Paradise that no one before me was given, and I hope to be given it. So ask Allah for Al-Wasilah for me.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 32
  },
  {
    "serial_number": "4965247",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 50,
    "volume_number": 1,
    "text": "52 - (Sahih / Authentic) From Ibn Abbas, he says: \"O Allah, accept the great intercession of Muhammad, and raise his high degree, and give him his request in the Hereafter and the First (life), just as You gave Abraham and Moses, peace be upon them.\" [50]\n\n53 - Da'if (Weak) Ruwaifi' Al-Ansari said that he heard the Prophet, peace and blessings be upon him, say: \"Whoever says: 'O Allah, send blessings upon Muhammad and settle him in the seat near to You on the Day of Resurrection,' intercession becomes obligatory for him.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 33
  },
  {
    "serial_number": "4965249",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 51,
    "volume_number": 1,
    "text": "54 - (Sahih / Authentic) From Abu Huraira, he said: The Messenger of Allah, peace and blessings be upon him, said: \"No people sit in a gathering where they do not mention Allah and do not send blessings upon their Prophet, peace and blessings be upon him, except that their gathering will be a regret for them on the Day of Resurrection. If He wills, He forgives them, and if He wills, He takes them (punishes them).\" [51]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 34
  },
  {
    "serial_number": "4965250",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 52,
    "volume_number": 1,
    "text": "55 - (Sahih / Authentic) From Abu Sa'id, he said: \"There are no people who sit and then stand up without sending blessings upon the Prophet, peace and blessings be upon him, except that it will be a regret for them on the Day of Resurrection, even if they enter Paradise for reward.\" [52]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 35
  },
  {
    "serial_number": "4965251",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 53,
    "volume_number": 1,
    "text": "56 - Isnaduhu Sahih (Its chain is authentic) From Ka'b bin Ujrah that he said: \"Shall I not give you a gift? The Messenger of Allah, peace and blessings be upon him, came out to us, so we said: 'O Messenger of Allah, we have known how to send peace upon you, so how do we send blessings?' He said: 'Say: O Allah, send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Abraham, indeed You are Praiseworthy, Glorious.'\" [53]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 36
  },
  {
    "serial_number": "4965252",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 54,
    "volume_number": 1,
    "text": "57 - (Da'if / Weak) From Ka'b bin Ujrah, he said: When this verse was revealed {Indeed, Allah and His angels send blessings upon the Prophet. O you who have believed, ask [Allah to confer] blessing upon him and ask [Allah to grant him] peace} [Al-Ahzab 56], we said: \"O Messenger of Allah, we have known the peace, so how is the blessing?\" He said: \"Say: O Allah, send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon Abraham and the family of Abraham, indeed You are Praiseworthy, Glorious. And bless Muhammad and the family of Muhammad as You blessed and sent blessings upon Abraham and the family of Abraham, indeed You are Praiseworthy, Glorious.\" [54]\n\n58 - (Da'if / Weak) From Ka'b bin Ujrah, he said: I said: \"O Messenger of Allah, we have known the peace upon you, so how is the blessing upon you?\" He said: \"You say: O Allah, send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon Abraham and the family of Abraham, indeed You are Praiseworthy, Glorious.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 37
  },
  {
    "serial_number": "4965254",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 55,
    "volume_number": 1,
    "text": "59 - (Isnaduhu Hasan / Its chain is good) From Uqbah bin Amr, he said: A man came to the Messenger of Allah until he sat before him and said: \"O Messenger of Allah, as for peace upon you, we have known it. As for the blessing, inform us about it, how do we send blessings upon you?\" He said: The Messenger of Allah, peace and blessings be upon him, fell silent until we wished that the man who asked him had not asked him. Then he said: \"When you send blessings upon me, say: O Allah, send blessings upon Muhammad the Unlettered Prophet and upon the family of Muhammad as You sent blessings upon Abraham and upon the family of Abraham. And bless Muhammad the Unlettered Prophet and upon the family of Muhammad as You blessed Abraham and upon the family of Abraham, indeed You are Praiseworthy, Glorious.\" [55]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 38
  },
  {
    "serial_number": "4965255",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 56,
    "volume_number": 1,
    "text": "60 - (Sahih / Authentic) From Zaid bin Abdullah that they used to like to say: \"O Allah, send blessings upon Muhammad the Unlettered Prophet.\" [56]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 39
  },
  {
    "serial_number": "4965256",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 57,
    "volume_number": 1,
    "text": "61 - Da'if (Weak) From Abdullah that he said: \"When you send blessings upon the Prophet, peace and blessings be upon him, do so excellently, for you do not know, perhaps that will be presented to him.\" They said: \"So teach us.\" He said: \"Say: O Allah, place Your blessings, Your mercy, and Your benedictions upon the Master of the Messengers, the Imam of the Pious, and the Seal of the Prophets, Muhammad, Your servant and Messenger, the Imam of Good, the Leader of Good, and the Messenger of Mercy. O Allah, raise him to a praiseworthy station envied by the first and the last. O Allah, send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon Abraham and upon the family of Abraham, indeed You are Praiseworthy, Glorious. O Allah, bless Muhammad and upon the family of Muhammad as You blessed Abraham and the family of Abraham, indeed You are Praiseworthy, Glorious.\" [57]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 40
  },
  {
    "serial_number": "4965257",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 58,
    "volume_number": 1,
    "text": "62 - (Da'if / Weak) It was said to Abdullah bin Amr or Ibn Umar: How is the sending of blessings upon the Prophet, peace and blessings be upon him? He said: \"O Allah, place Your blessings, Your benedictions, and Your mercy upon the Master of the Muslims, the Imam of the Pious, and the Seal of the Prophets, Muhammad, Your servant and Messenger, the Imam of Good, and the Leader of Good. O Allah, raise him on the Day of Resurrection to a praiseworthy station envied by the first and the last. And send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon Abraham and upon the family of Abraham.\" [58]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 41
  },
  {
    "serial_number": "4965258",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 59,
    "volume_number": 1,
    "text": "63 - Sahih (Authentic) From Abu Mas'ud Al-Ansari, he said: The Messenger of Allah, peace and blessings be upon him, came to us in the gathering of Sa'd bin Ubadah. Bashir bin Sa'd said: \"Allah has commanded us to send blessings upon you, O Messenger of Allah, so how do we send blessings upon you?\" He said: The Messenger of Allah, peace and blessings be upon him, fell silent until we wished that he had not asked him. Then the Messenger of Allah, peace and blessings be upon him, said: \"Say: O Allah, send blessings upon our master Muhammad and upon the family of Muhammad as You sent blessings upon the family of Abraham. And bless Muhammad and upon the family of Muhammad as You blessed the family of Abraham in the worlds. Indeed You are Praiseworthy, Glorious. And the peace is as you have known.\" [59]\n\n64 - (Sahih / Authentic) From Ibrahim, he said: They said: \"O Messenger of Allah, we have known the peace upon you, so how is the blessing upon you?\" He said: \"Say: O Allah, send blessings upon Your servant and Messenger and his household as You sent blessings upon the family of Abraham, indeed You are Praiseworthy, Glorious. And bless him and his household as You blessed Abraham, indeed You are Praiseworthy, Glorious.\"\n\n65 - (Sahih / Authentic) I heard Al-Hasan say: When it was revealed: {Indeed, Allah and His angels send blessings upon the Prophet. O you who have believed, ask [Allah to confer] blessing upon him and ask [Allah to grant him] peace}, they said: \"O Messenger of Allah, this peace, we have known how it is. So how do you command us to send blessings upon you?\" He said: \"You say: O Allah, place Your blessings and Your benedictions upon the family of Muhammad as You placed them upon the family of Abraham, indeed You are Praiseworthy, Glorious.\"",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "684",
    "new_page_number": 42
  },
  {
    "serial_number": "4965261",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 61,
    "volume_number": 1,
    "text": "66 - (Sahih / Authentic) From Abu Sa'id Al-Khudri, he said: They said: \"O Messenger of Allah, this peace upon you we have known, so how is the blessing?\" He said: \"You say: O Allah, send blessings upon Muhammad, Your servant and Messenger, as You sent blessings upon the family of Abraham. And bless Muhammad and upon the family of Muhammad as You blessed Abraham.\" [61]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 43
  },
  {
    "serial_number": "4965262",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 62,
    "volume_number": 1,
    "text": "67 - (Sahih / Authentic) From Abu Sa'id Al-Khudri, he said: We said: \"O Messenger of Allah, this peace upon you, so how is the blessing upon you?\" He said: \"Say: O Allah, send blessings upon Muhammad, Your servant and Messenger, as You sent blessings upon Abraham. And bless Muhammad and the family of Muhammad as You blessed Abraham and the family of Abraham.\" [62]\n\n68 - (Sahih / Authentic) From Musa bin Talhah - Al-Qadi said: I think it is from his father, 'from his father' fell from my book - he said: I said: \"O Messenger of Allah, how is the blessing upon you?\" He said: \"Say: O Allah, send blessings upon Muhammad as You sent blessings upon Abraham, indeed You are Praiseworthy, Glorious. And bless Muhammad and upon the family of Muhammad as You blessed Abraham, indeed You are Praiseworthy, Glorious.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 44
  },
  {
    "serial_number": "4965264",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 63,
    "volume_number": 1,
    "text": "69 - (Sahih / Authentic) From Zaid bin Kharijah, brother of Banu Al-Harith ibn Al-Khazraj, he said: I said: \"O Messenger of Allah, we have known how to send peace upon you, so how do we send blessings upon you?\" He said: \"Send blessings upon me and say: O Allah, bless Muhammad and upon the family of Muhammad as You blessed Abraham and the family of Abraham, indeed You are Praiseworthy, Glorious.\" [63]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 45
  },
  {
    "serial_number": "4965265",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 64,
    "volume_number": 1,
    "text": "70 - (Sahih / Authentic) From Abu Humaid Al-Sa'idi that they said: \"O Messenger of Allah, how do we send blessings upon you?\" The Messenger of Allah, peace and blessings be upon him, said: \"Say: O Allah, send blessings upon Muhammad and his wives and his offspring as You sent blessings upon the family of Abraham. And bless Muhammad and his wives and his offspring as You blessed the family of Abraham, indeed You are Praiseworthy, Glorious.\" [64]\n\n71 - (Sahih / Authentic) From Abdul Rahman bin Bishr bin Mas'ud, he said: It was said: \"O Messenger of Allah, you commanded us to send peace upon you and to send blessings upon you. We have known how to send peace upon you, so how do we send blessings?\" He said: \"You say: O Allah, send blessings upon the family of Muhammad as You sent blessings upon the family of Abraham. And bless the family of Muhammad as You blessed the family of Abraham.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 46
  },
  {
    "serial_number": "4965267",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 65,
    "volume_number": 1,
    "text": "72 - (Sahih / Authentic) From Abdul Rahman bin Bishr bin Mas'ud, he said: They said: \"O Messenger of Allah, we have known how to send peace upon you, so how is the blessing upon you?\" He said: \"Say: O Allah, send blessings upon Muhammad as You sent blessings upon the family of Abraham. O Allah, bless Muhammad as You blessed the family of Abraham.\" [65]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 47
  },
  {
    "serial_number": "4965268",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 66,
    "volume_number": 1,
    "text": "73 - (Sahih / Authentic) From Muhammad bin Abdul Rahman bin Bishr bin Mas'ud, he said: We said or it was said to the Prophet, peace and blessings be upon him: \"We have been commanded to send blessings upon you and send peace upon you. As for the peace, we have known it, but how do we send blessings upon you?\" He said: \"You say: O Allah, send blessings upon the family of Muhammad as You sent blessings upon the family of Abraham. O Allah, bless Muhammad as You blessed the family of Abraham.\" [66]\n\n74 - (Da'if / Weak) I heard Sa'id bin Al-Musayyib say: \"There is no supplication in which blessings are not sent upon the Prophet, peace and blessings be upon him, before it, except that it is suspended between the heaven and the earth.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 48
  },
  {
    "serial_number": "4965270",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 67,
    "volume_number": 1,
    "text": "75 - Sahih (Authentic) From Ibn Abbas that he said: \"Do not send blessings (Salah) upon anyone except upon the Prophet, peace and blessings be upon him, but supplication for forgiveness is made for the Muslim men and Muslim women.\" [67]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 49
  },
  {
    "serial_number": "4965271",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 68,
    "volume_number": 1,
    "text": "76 - (Sahih / Authentic) From Ja'far ibn Burqan, he said: Umar bin Abdul Aziz wrote: \"As to what follows, indeed some people have sought the world through the work of the Hereafter, and indeed the storytellers have introduced in sending blessings upon their caliphs and princes the equal of their blessings upon the Prophet, peace and blessings be upon him. So when this letter of mine reaches you, order them that their blessings be upon the Prophets, and their supplication be for the Muslims in general, and let them leave what is other than that.\" [68]\n\n77 - Sahih (Authentic) From Jabir bin Abdullah that a woman said: \"O Messenger of Allah, send blessings upon me and upon my husband.\" The Prophet, peace and blessings be upon him, said: \"May Allah send blessings upon you and upon your husband.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 50
  },
  {
    "serial_number": "4965273",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 69,
    "volume_number": 1,
    "text": "78 - (Sahih / Authentic) From Muhammad: That he used to supplicate for the young and ask forgiveness [for them] just as he supplicated for the old. It was said to him: \"This one has no sin?\" He said: \"The Prophet, peace and blessings be upon him, Allah forgave him his past and future sins, yet I have been commanded to send blessings upon him.\" [69]\n\n79 - Da'if (Weak) I heard Al-Qasim bin Muhammad say: \"It was recommended for a man, when he finished his Talbiyah, to send blessings upon the Prophet, peace and blessings be upon him.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 51
  },
  {
    "serial_number": "4965275",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 70,
    "volume_number": 1,
    "text": "80 - (Da'if Jiddan / Very Weak) Ali ibn Abi Talib, may Allah be pleased with him, said: \"If you pass by mosques, send blessings upon the Prophet, peace and blessings be upon him.\" [70]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 52
  },
  {
    "serial_number": "4965276",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 71,
    "volume_number": 1,
    "text": "81 - Sahih (Authentic) I heard Umar bin Al-Khattab say: \"If you arrive, circumvent the House seven times, and pray two Rak'ahs at the Station (Maqam). Then come to Safa and stand where you can see the House. Say Takbir seven times; between every two Takbirs praise Allah and extol Him, send blessings upon the Prophet, peace and blessings be upon him, and ask for yourself. And [do] upon Marwah like that.\" [71]\n\n82 - (Sahih li-ghayrihi / Authentic due to other evidence) From his mother Fatimah bint Al-Hussein, from Fatimah bint the Prophet, peace and blessings be upon him, she said: The Messenger of Allah, peace and blessings be upon him, said to me: \"When you enter the mosque, say: 'In the name of Allah, and peace be upon the Messenger of Allah. O Allah, send blessings upon Muhammad and upon the family of Muhammad, and forgive us and make easy for us the gates of Your mercy.' And when you finish, say the like of that, except say: 'and make easy for us the gates of Your bounty.'\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 53
  },
  {
    "serial_number": "4965278",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 72,
    "volume_number": 1,
    "text": "83 - (Da'if / Weak) From Fatimah bint the Prophet, peace and blessings be upon him, she said: The Messenger of Allah, peace and blessings be upon him, said to me: \"O little daughter, when you enter the mosque, say: 'In the name of Allah, and peace be upon the Messenger of Allah. O Allah, send blessings upon Muhammad and upon the family of Muhammad. O Allah, forgive us and have mercy on us and open for us the gates of Your mercy.'\" [72]\n\n84 - (Da'if / Weak) From Fatimah bint the Prophet, peace and blessings be upon him, from the Prophet, peace and blessings be upon him, similar to that.",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 54
  },
  {
    "serial_number": "4965280",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 73,
    "volume_number": 1,
    "text": "85 - Da'if (Weak) From Abu Ishaq, he said: I heard Sa'id bin Dhi Haddan say: I said to Alqamah: \"What do I say when I enter the mosque?\" He said: \"Say: May Allah and His angels send blessings upon Muhammad. Peace be upon you, O Prophet, and the mercy of Allah and His blessings.\" [73]\n\n86 - (Da'if / Weak) From Yazid bin Dhi Haddan, he said: I said to Alqamah: \"O Abu Shibl, what do I say when I enter the mosque?\" He said: \"Say: May Allah and His angels send blessings upon Muhammad. Peace be upon you, O Prophet, and the mercy of Allah.\" I said: \"Who told you? Did you hear it?\" He said: \"No, Abu Ishaq Al-Hamdani told me.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 55
  },
  {
    "serial_number": "4965282",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 74,
    "volume_number": 1,
    "text": "87 - (Da'if / Weak) That Umar used to say Takbir on Safa three times, saying: \"There is no god but Allah alone, He has no partner. To Him belongs the dominion and to Him belongs praise, and He is capable of all things.\" Then he sends blessings upon the Prophet, peace and blessings be upon him, then supplicates and prolongs the standing and supplication. Then he does likewise on Marwah. [74]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 56
  },
  {
    "serial_number": "4965283",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 75,
    "volume_number": 1,
    "text": "88 - (Sahih / Authentic) Abdullah said: \"You begin and say one Takbir to start the prayer, and you praise your Lord and send blessings upon the Prophet Muhammad, peace and blessings be upon him, then you supplicate. Or you say Takbir and do likewise, then say Takbir and do likewise, then say Takbir and do likewise. Then you recite, then say Takbir and bow. Then you stand and recite and praise your Lord and send blessings upon the Prophet Muhammad, peace and blessings be upon him, then you supplicate and say Takbir to Allah and do likewise, then say Takbir and do likewise, then you bow.\" Hudhayfah and Abu Musa said: \"Abu Abdul Rahman has spoken the truth.\" [75]\n\n89 - Sahih (Authentic) From Hisham, he said in it: \"Then you say Takbir and bow.\" Hudhayfah and Al-Ash'ari said: \"Abu Abdul Rahman has spoken the truth.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 57
  },
  {
    "serial_number": "4965285",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 76,
    "volume_number": 1,
    "text": "90 - (Sahih / Authentic) From Abdullah bin Abi Bakr, he said: We were at Al-Khayf and Abdullah ibn Abi Utbah was with us. He praised Allah and extolled Him, and sent blessings upon the Prophet, peace and blessings be upon him, and supplicated with supplications, then stood and led us in prayer. [76]\n\n91 - (Sahih / Authentic) From Al-Sha'bi, he said: \"The first Takbir of the funeral prayer is praise of Allah, the Mighty and Majestic. The second is sending blessings upon the Prophet, peace and blessings be upon him. The third is supplication for the deceased. And the fourth is the Taslim (Salutation).\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 58
  },
  {
    "serial_number": "4965287",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 77,
    "volume_number": 1,
    "text": "92 - (Sahih / Authentic) From Ibn Umar: That he says Takbir over the funeral, sends blessings upon the Prophet, peace and blessings be upon him, then says: \"O Allah, bless him, send blessings upon him, forgive him, and bring him to the Pool (Haud) of Your Prophet, peace and blessings be upon him.\" [77]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 59
  },
  {
    "serial_number": "4965288",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 78,
    "volume_number": 1,
    "text": "93 - (Sahih / Authentic) From Abu Huraira, he was asked: \"How do we pray over the funeral?\" He said to us: \"By Allah, I will inform you. I follow it from its family. When it is placed, I say Takbir, praise Allah, and send blessings upon His Prophet, peace and blessings be upon him. Then I say: 'O Allah, this is Your servant, the son of Your servant, and the son of Your maidservant. He used to testify that there is no god but You and that Muhammad is Your servant and Messenger, and You know best about him. O Allah, if he was a doer of good, increase his good deeds, and if he was an evildoer, overlook his bad deeds. O Allah, do not deprive us of his reward and do not try us after him.'\" [78]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 60
  },
  {
    "serial_number": "4965289",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 79,
    "volume_number": 1,
    "text": "94 - (Sahih / Authentic) Sa'id bin Al-Musayyib said: \"The Sunnah in the funeral prayer is to recite the Opening of the Book (Al-Fatihah), send blessings upon the Prophet, peace and blessings be upon him, then sincerely supplicate for the deceased until he finishes. And he recites only once, then says Taslim to himself.\" [79]\n\n95 - (Sahih / Authentic) From Abu Al-Aliyah {Indeed, Allah and His angels send blessings upon the Prophet}. He said: \"The Salah (blessing) of Allah, Mighty and Majestic, upon him is: His praising of him. And the Salah of the angels upon him is: Supplication.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 61
  },
  {
    "serial_number": "4965291",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 80,
    "volume_number": 1,
    "text": "96 - (Da'if / Weak) From Al-Dahhak, he said: \"The Salah of Allah is His mercy, and the Salah of the angels is supplication.\" [80]\n\n97 - (Da'if Jiddan / Very Weak) From Al-Dahhak {It is He who confers blessing upon you, and His angels}. He said: \"The Salah of Allah is His forgiveness, and the Salah of the angels is supplication.\"\n\n98 - (Sahih / Authentic) From Abdullah bin Dinar that he said: \"I saw Abdullah bin Umar standing at the grave of the Prophet, peace and blessings be upon him, sending blessings upon the Prophet, peace and blessings be upon him, and upon Abu Bakr and Umar, may Allah be pleased with them both.\"",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "684",
    "new_page_number": 62
  },
  {
    "serial_number": "4965294",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 81,
    "volume_number": 1,
    "text": "99 - (Sahih / Authentic) Abdullah bin Dinar said: \"I saw Ibn Umar, when he arrived from a journey, enter the mosque and say: 'Peace be upon you, O Messenger of Allah. Peace be upon Abu Bakr. Peace be upon my father,' and pray two Rak'ahs.\" [81]\n\n100 - (Sahih / Authentic) From Nafi': That Ibn Umar, when he arrived from a journey, would enter the mosque then come to the grave and say: \"Peace be upon you, O Messenger of Allah. Peace be upon you, O Abu Bakr. Peace be upon you, O my father.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 63
  },
  {
    "serial_number": "4965296",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 82,
    "volume_number": 1,
    "text": "101 - (Da'if / Weak) From Nafi': That Ibn Umar, when he arrived from a journey, would pray two prostrations (Rak'ahs) in the mosque, then come to the Prophet, peace and blessings be upon him, place his right hand on the grave of the Prophet, peace and blessings be upon him, turn his back to the Qiblah, and then greet the Prophet, peace and blessings be upon him, then Abu Bakr and Umar, may Allah be pleased with them both. [82]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 64
  },
  {
    "serial_number": "4965297",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 83,
    "volume_number": 1,
    "text": "102 - (Isnaduhu Sahih / Its chain is authentic) That Ka'b entered upon Aisha and they mentioned the Messenger of Allah, peace and blessings be upon him. Ka'b said: \"No dawn breaks except that seventy thousand angels descend until they surround the grave, beating their wings and sending blessings upon the Prophet, peace and blessings be upon him. Until when evening comes, they ascend and seventy thousand descend until they surround the grave, beating their wings and sending blessings upon the Prophet, peace and blessings be upon him. Seventy thousand by night and seventy thousand by day. Until when the earth splits, he will emerge among seventy thousand angels escorting him.\" [83]\n\n103 - (Sahih / Authentic) From Mujahid: {And We raised high for you your repute}. He said: \"I am not mentioned except you are mentioned: I bear witness that there is no god but Allah, I bear witness that Muhammad is the Messenger of Allah.\"",
    "foot_note": "None\n\nNone",
    "book_id": "684",
    "new_page_number": 65
  },
  {
    "serial_number": "4965299",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 84,
    "volume_number": 1,
    "text": "104 - (Sahih / Authentic) From Qatadah: {And We raised high for you your repute}. The Prophet, peace and blessings be upon him, said: \"Begin with servitude ('Ubudiya) and follow with Messengerhood (Risalah).\" Ma'mar said: \"I bear witness that there is no god but Allah and that Muhammad is His servant: this is servitude. And His Messenger: that he says His servant and His Messenger.\" [84]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 66
  },
  {
    "serial_number": "4965300",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 85,
    "volume_number": 1,
    "text": "105 - (Sahih / Authentic) From Abu Ishaq: That he saw them facing the Imam when he delivered the sermon, but they were not striving (to hear/act), it was only storytelling and sending blessings upon the Prophet, peace and blessings be upon him. [85]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 67
  },
  {
    "serial_number": "4965301",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 86,
    "volume_number": 1,
    "text": "106 - (Sahih / Authentic) I heard Fadalah bin Ubayd, a companion of the Messenger of Allah, peace and blessings be upon him, say: The Messenger of Allah, peace and blessings be upon him, heard a man supplicating in his prayer without glorifying Allah nor sending blessings upon the Prophet, peace and blessings be upon him. The Messenger of Allah, peace and blessings be upon him, said: \"This one was hasty.\" Then he called him and said to him or to someone else: \"When one of you prays, let him begin by glorifying Allah and praising Him, then send blessings upon the Prophet, peace and blessings be upon him, then supplicate afterwards with whatever he wishes.\" [86]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 68
  },
  {
    "serial_number": "4965302",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Virtue of Sending Blessings upon the Prophet, Peace Be Upon Him",
    "edition": "Third - 1977",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 87,
    "volume_number": 1,
    "text": "107 - (Sahih / Authentic) From Qatadah, from Abdullah bin Al-Harith: That Abu Halimah Mu'adh used to send blessings upon the Prophet, peace and blessings be upon him, in the Qunut. [87]",
    "foot_note": "None",
    "book_id": "684",
    "new_page_number": 69
  }
]