[
  {
    "text": "The Wisdom of Illumination in the Writers of Horizons (Hikmat al-Ishraq fi Kuttab al-Afaq)\nAuthor: محمد بن محمد بن عبد الرزاق الحسيني أبو الفيض الملقب بمرتضى الزبيدي\nYear: 1205",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Wisdom of Illumination in the Writers of Horizons (Hikmat al-Ishraq fi Kuttab al-Afaq)",
    "category_id": "29",
    "category": "Language Books",
    "new_page_number": 1
  },
  {
    "text": "sn: 6988\nbook_title: حكمة الإشراق في كتّاب الآفاق [مطبوع ضمن كتاب «نوادر المخطوطات»]\nbook_link: https://shamela.ws/book/984\nbook_id: 984\nauthor_name: محمد بن محمد بن عبد الرزاق الحسيني أبو الفيض الملقب بمرتضى الزبيدي\nauthor_year: 1205\nnickname: أبو الفيض\nauthor_link: https://shamela.ws/author/906\nauthor_ID: 906\neditor: عبد السلام هارون (تحقيق)\npublisher: شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر\nedition: الثانية، 1393 هـ‍ - 1972 م\npages: 52\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: كتب اللغة\ncategory_id: 29",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Wisdom of Illumination in the Writers of Horizons (Hikmat al-Ishraq fi Kuttab al-Afaq)",
    "category_id": "29",
    "category": "Language Books",
    "new_page_number": 2
  },
  {
    "serial_number": "6337031",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons (Hikmat al-Ishraq fi Kuttab al-Afaq)",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Language Books\nBook: The Wisdom of Illumination in the Writers of Horizons (Hikmat al-Ishraq fi Kuttab al-Afaq) [Printed within the book \"Rare Manuscripts\" (Nawadir al-Makhtutat)]\nAuthor: Muhammad Murtada al-Zabidi\nInvestigation: Abd al-Salam Harun\n[The numbering of the book matches the printed version]\nDate of publication in Shamela: 5 Muharram 1444\n\nBook: The Wisdom of Illumination in the Writers of Horizons [Printed within the book \"Rare Manuscripts\"]\nAuthor: Muhammad Murtada al-Zabidi\nInvestigation: Abd al-Salam Harun\n[The numbering of the book matches the printed version]\nDate of publication in Shamela: 5 Muharram 1444\n\n[Printed within the book \"Rare Manuscripts\"]\nAuthor: Muhammad Murtada al-Zabidi\nInvestigation: Abd al-Salam Harun\n[The numbering of the book matches the printed version]\nDate of publication in Shamela: 5 Muharram 1444\n\nAuthor: Muhammad Murtada al-Zabidi\nInvestigation: Abd al-Salam Harun\n[The numbering of the book matches the printed version]\nDate of publication in Shamela: 5 Muharram 1444\n\nInvestigation: Abd al-Salam Harun\n[The numbering of the book matches the printed version]\nDate of publication in Shamela: 5 Muharram 1444\n\n[The numbering of the book matches the printed version]\nDate of publication in Shamela: 5 Muharram 1444\n\n[The numbering of the book matches the printed version]\nDate of publication in Shamela: 5 Muharram 1444\n\n[The numbering of the book matches the printed version]\nDate of publication in Shamela: 5 Muharram 1444\n\n[The numbering of the book matches the printed version]\nDate of publication in Shamela: 5 Muharram 1444\n\nDate of publication in Shamela: 5 Muharram 1444",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 3
  },
  {
    "serial_number": "6337032",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 49,
    "volume_number": 1,
    "text": "The Wisdom of Illumination for the Book of Horizons\nCollected by the poor servant of Allah Almighty, Muhammad Murtada al-Husseini, may Allah pardon him by His grace. Amen.",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 4
  },
  {
    "serial_number": "6337033",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 50,
    "volume_number": 1,
    "text": "Introduction\nThis is a book on the history of calligraphy and calligraphers. It is an extension of ancient works, most notably the book \"Adab al-Kuttab\" by Muhammad bin Yahya al-Suli who died in the year 336 AH, long chapters in the \"Fihrist\" of Ibn al-Nadim who died in the year 385 AH, and \"Subh al-A'sha\" by al-Qalqashandi who died in the year 821 AH.\nSayyid Murtada al-Zabidi authored this book to include \"the virtue of calligraphy and the pen and the traditions (Athar) reported about them, the secrets the wise have regarding them, an explanation of who first established the script and composed the letters, clothed them in the robes of detail and placed them in the best of conditions, and then an explanation of the illustrious writers and notables of the art.\"\nHe made this treatise a gift to the library of the genius of calligraphy, Prince Hassan Effendi, nicknamed al-Rushdi (1).\nHe divided it into ten chapters and a conclusion:\nChapter One: On the mention of who established the script and its origin, and who connected and separated it.\nChapter Two: On the virtue of calligraphy and what has been said about it.\nChapter Three: On the pen, and their wisdom regarding it.",
    "foot_note": "1. He is Hassan Effendi bin Abdullah, nicknamed al-Rushdi, of Roman origin. He died in the same year al-Zabidi died. Al-Jabarti said in his biography: \"The freed slave of Ali Agha Bashir Dar al-Sa'ada, the Egyptian scribe. His master bought him when he was young, disciplined him, trained him, and occupied him with calligraphy, so he strove in it. He perfected it under Abdullah al-Anis, and the day of his Ijazah (certification) was a precious gathering that brought together subordinates and chiefs. Then he married him to his daughter and made him his successor. He remained during his master's life devoted to practice and drafting, caring for editing and improvement until he surpassed the people of his time in quality in the art... And when the Sheikh of the two offices, the late Ismail al-Wahbi died, the translator (biographee) was made Sheikh by their agreement... And for his sake, our Sheikh Sayyid Muhammad Murtada authored the book 'Hikmat al-Ishraq ila Kitab al-Afaq'... He remained a Sheikh and spokesman for the group of calligraphers and writers, and their dean who is pointed out among the masters. He copied with his hand several Qurans and Hizbs (portions). As for copies of Dalail al-Khayrat, their abundance cannot be counted, until death circumambulated him the farewell circumambulation, and scattered the necklace of that gathering. And with his death, the order of this art became extinct.\" Tarikh al-Jabarti 2: 211.",
    "book_id": "984",
    "new_page_number": 5
  },
  {
    "serial_number": "6337034",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 51,
    "volume_number": 1,
    "text": "Chapter Four: On the inkwell, its description, and its tools.\nChapter Five: On ink (Madad) and ink (Hibr).\nChapter Six: On sharpening pens.\nChapter Seven: On dotting (Nuqat).\nChapter Eight: On vowelization (Shakl).\nChapter Nine: On the mention of the alphabet letters and their secret in determining number.\nChapter Ten: On the mention of the noble scribes, from the time of the Prophet, peace be upon him, to the time of the author.\nThen the Conclusion, which contains two sections:\nFirst: On the etiquette of the student with the Sheikh.\nSecond: Advice for all calligraphers.",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 6
  },
  {
    "serial_number": "6337035",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 52,
    "volume_number": 1,
    "text": "Sayyid Murtada al-Zabidi\nSayyid Murtada al-Zabidi was a venerable linguist scholar from the scholars of the thirteenth century. Al-Jabarti devoted a precious biography to him in his history, most of which I preferred to transmit in his wording and arrangement, keen on the complete depiction it contains of this man's life and his connections with the men of his era.\nAl-Jabarti said in his biography (1): Our Sheikh, the flag of flags, and the magician playing with understandings, who roamed every path in language and Hadith, and waded into every depth of knowledge, the one for whom the paths of speech were humbled, and to whom paper and pens testify, the possessor of knowledge and the well-known, and he is the described flag, the reliable, the very understanding, the traveler, the genealogist, the jurist, the Muhaddith, the linguist, the grammarian, the Usuli (scholar of principles), the poet, the prose writer, Sheikh Abu al-Fayd Sayyid Muhammad bin Muhammad bin Muhammad bin Abd al-Razzaq, famous as Murtada al-Husseini al-Zabidi (2) al-Hanafi. This is how he mentioned about himself and his lineage. He was born in the year 1145 AH as I heard it from his utterance and saw it in his handwriting. He grew up in his country and traveled seeking knowledge and performed Hajj multiple times. He met Sheikh Abdullah al-Sindi, Sheikh Umar bin Ahmad bin Aqil al-Makki, Abdullah al-Saqqaf, the Musnid Muhammad Ibn Ala al-Din al-Mizjaji, Sulayman bin Yahya, and Ibn al-Tayyib. He met Sayyid Abd al-Rahman al-Aydarus in Mecca, and Sheikh Abdullah Mirghani al-Taifi in the year sixty-three. He stayed in Taif after going to Yemen and returning in the year sixty-six. He read Fiqh with Sheikh Abdullah and many of his works, and he granted him Ijazah. He read the Mukhtasar of al-Sa'd with Sheikh Abd al-Rahman al-Aydarus, accompanied him closely, and he dressed him in the (Khirqa) and granted him Ijazah for his narrations and what he heard. He said: \"He is the one who made me yearn to enter Egypt by what he described to me of its scholars, princes, and litterateurs, and the noble shrines therein, so my soul longed to see it, and I came with the caravan, and what happened happened.\" He read part of the Ihya with him, and he granted him Ijazah for his narrations.",
    "foot_note": "1. See Aja'ib al-Athar 2: 196 - 210 in the events of the year 1205 AH. This biography was summarized by Al-Shiblanji in Nur al-Absar 214, and Ali Mubarak in Al-Khitat al-Tawfiqiyya 3: 93 - 94. \n2. Attributed to Zabid, with a Fatha on the Zay, which is a famous city in Yemen.",
    "book_id": "984",
    "new_page_number": 7
  },
  {
    "serial_number": "6337036",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 53,
    "volume_number": 1,
    "text": "Then he arrived in Egypt on the ninth of Safar in the year 1167 AH and lived in Khan al-Saghah. The first person he associated with and took knowledge from was Sayyid Ali al-Maqdisi al-Hanafi, one of the scholars of Egypt. He attended the lessons of the sheikhs of the time such as Sheikh Ahmad al-Mallawi, al-Jawhari, al-Hifni, al-Bulaydi, al-Sa'idi, al-Mudabighi, and others. He received knowledge from them, and they granted him Ijazah and testified to his knowledge, virtue, and quality of memorization. The \"Katkhuda of Azban (1)\" took care of his affairs and bestowed his kindness upon him until his affair became popular, his condition flourished, and his mention became famous among the elite and the general public. He wore luxurious clothes and rode marked horses. He traveled to Upper Egypt three times and met its grandees, notables, and scholars. Sheikh of the Arabs Hamam, Ismail Abu Abdullah, Abu Ali, the children of Nusayr, and the children of Wafi honored him, gave him gifts, and treated him kindly. Likewise, he traveled to the coastal regions such as Damietta, Rosetta, Mansoura, and the rest of the great towns multiple times when they were adorned with their people and populated by their grandees. Everyone honored him, and he met the grandees of the regions and the masters of knowledge and behavior (Sufism). He received from them, and they granted him Ijazah and he granted them Ijazah. He authored (several travelogues) about his movements in the southern and northern lands containing anecdotes, dialogues, and praises in verse and prose that, if collected, would make a huge volume. Our master Abu al-Anwar bin Wafa gave him the Kunya (Abu al-Fayd), and that was on Tuesday, the seventeenth of Sha'ban in the year 1182 AH, in the courtyards of our masters Bani al-Wafa on the day of the customary Mawlid visit. Then he married and lived in Atfat al-Ghassal while keeping his residence in Wikalat al-Saghah. He began (explaining al-Qamus) until he completed it in several years in about fourteen volumes, naming it \"Taj al-Arus\". When he completed it, he (held a lavish banquet) in which he gathered students of knowledge and sheikhs of the time in Ghayt al-Ma'diyah, and that was in the year 1181 AH. He showed it to them, and they rejoiced in it and testified to his merit, breadth of knowledge, and firmness in the science of language. They wrote their commendations on it in prose and verse.\" Then al-Jabarti listed the names of these commenders and some of their commendations, then said: \"When Muhammad Bey Abu al-Dhahab established his mosque known by his name near al-Azhar and made a library in it, and bought a number of books and placed them there, they informed him about this explanation of al-Qamus and told him that if it were placed in the library, its system would be complete, and it would be unique in that over others. They encouraged him in that, so he requested it and compensated him for it with one hundred thousand silver dirhams, and placed it there.",
    "foot_note": "1. The meaning of Katkhuda: Minister of Internal Affairs, as stated in Takhlis al-Ibriz by Rifa'a al-Tahtawi p. 72.",
    "book_id": "984",
    "new_page_number": 8
  },
  {
    "serial_number": "6337037",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 54,
    "volume_number": 1,
    "text": "The subject (of the biography) continued to serve knowledge and ascend the degrees of highness, keen on collecting the arts that the later scholars neglected, such as the science of genealogies, chains of transmission (Isnad), graduation (Takhrij) of Hadiths, and connecting the methods of later Muhaddiths with the earlier ones. He authored many books, treatises, poems, and Rajaz verses on that. Then he moved to a house in Suwayqat al-Lala, opposite the mosque of Muharram Effendi, near the mosque of Shams al-Din al-Hanafi. That was in the early part of the year 1189 AH. That area was then populated by grandees and notables, so they surrounded him, and he endeared himself to them, and they became familiar with him, comforted him, and gave him gifts. He showed them richness and abstinence, preached to them, benefited them with benefits, amulets, and Ruqyahs, and granted them Ijazah to read litanies and Hizbs. So they came to him from every direction, and came to visit him from every side, desiring his company because he was a stranger and not in the image or form of Egyptian scholars. (He knew Turkish and Persian languages), and even some of the Georgian language. So their hearts were attracted to him, and they transmitted his news and speech. Then he began dictating Hadith in the manner of the Salaf, mentioning chains of transmission, narrators, and graduators from his memory in different ways. To everyone who came to him, he would dictate the Hadith patterned with firstness (Musalsal bil-Awwaliyyah), which is the Hadith of Mercy, with its narrators and graduators, and write for him a Sanad (chain) for that, an Ijazah, and the hearing of those present, so they would marvel at that. Then some of the scholars of (Al-Azhar) went to him and asked him for Ijazah. He said to them: The beginnings of the books must be read. They agreed to meet at the mosque of Shaykhun in al-Saliba on Mondays and Thursdays to be away from people. So they began Sahih al-Bukhari with the reading of Sayyid Hussein al-Shaykhuni. Some people of the area gathered with them, along with Sheikh Musa al-Shaykhuni, the Imam of the mosque and librarian, who was a great man respected by the people of the area and others. People circulated the news of the pursuit of Al-Azhar scholars like Sheikh Ahmad al-Sajja'i, Sheikh Mustafa al-Ta'i, Sheikh Sulayman al-Akrashi, and others to take from him. So his status increased and his worth became great. The people of those areas and others, from the commoners, grandees, and notables, gathered around him and requested him to explain the meanings, so he moved from narration (Riwaya) to comprehension (Diraya), and it became a great lesson. At that point, most of the Azharites stopped attending, and he also dispensed with them. He began dictating to the group, after reading something from the Sahih, a hadith from the Musalsalat or the virtues of deeds, listing the men of its chain and its narrators from his memory and following it (with verses of poetry) as well. So they would marvel at that because they were not accustomed to it previously from Egyptian teachers.",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 9
  },
  {
    "serial_number": "6337038",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 55,
    "volume_number": 1,
    "text": "He opened another lesson in the Hanafi mosque, and read Al-Shama'il on days other than the usual ones after Asr prayer. So his fame increased, and people came from every side to hear him and see his person, because it was contrary to the appearance and dress of the Egyptians. Many notables invited him to their homes and held lavish banquets for him. He would go to them with the elite students, the reciter, the dictation writer (Mustamli), and the name writer. He would read to them something from the Hadith parts like the Thulathiyyat of Al-Bukhari or Al-Darimi, or some Musalsalat, in the presence of the group, the owner of the house, his companions, loved ones, children, (and his daughters and women from behind curtains). Before them were incense burners with ambergris and oud for the duration of the reading. Then they would conclude that with prayers upon the Prophet, peace be upon him, in the usual manner. The writer would write the names of the attendees and listeners, even women, boys, and girls, and the day and date, and the Sheikh would write under that: \"That is correct.\" This was the method of the Muhaddiths in the past times as we saw in old books. The humble one (the author) says: I was a witness and present in most of these gatherings and lessons, and other private gatherings in his home and his old residence in Khan al-Saghah, and our home in al-Sanadiqiyya and Bulaq and other places we used to go to for recreation like Ghayt al-Ma'diyah (and al-Azbakiyya) and other than that. We used to occupy most times reciting Hadith parts and others, which is much, with the confirmation of what was heard on the copies and in many papers existing until now. (Some great princes) were attracted to him, like Mustafa Bey al-Iskandarani and Ayyub Bey the Defterdar. So they sought his home: and frequented the attendance of his lesson gatherings. They continued giving him abundant gifts and grains. He bought slave girls, made food for guests, and honored comers and arrivals from distant horizons. Abdul Razzaq Effendi the Chief came from the Roman lands to Egypt and heard of him, so he came to him and requested Ijazah from him and reading the Maqamat of Al-Hariri. He used to go to him after finishing the lesson of Shaykhun and study for him what was easy of the Maqamat, and he would explain to him their linguistic meanings. When Muhammad Pasha Izzat the Great arrived, he raised his status with him and elevated him to himself, and bestowed upon him a sable fur coat. He arranged for him an allocation from his pantry for his sufficiency, of meat, ghee, rice, firewood, and bread. He arranged for him a plentiful stipend in the register of the Two Holy Mosques and the convoy, and grains from the granary. He reported his status to the State, so a decree came to him with a plentiful salary from the Mint, amounting to one hundred and fifty silver halves every day, and that was in the year 1191 AH. So his affair became great and his fame spread. He was invited to the State",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 10
  },
  {
    "serial_number": "6337039",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 56,
    "volume_number": 1,
    "text": "in the year 94 AH, so he accepted then refused. Correspondence from the grandees of the State followed successively to him, and they continued giving him gifts, masterpieces, and precious goods in boxes. His mention flew in the horizons, and kings of the regions wrote to him, from the Turks, Hejaz, India, Yemen, Sham, Basra, Iraq, and the kings of Morocco, Sudan, Fezzan, Algeria, and distant lands. Delegations to him increased from every side, and gifts, connections, and strange things followed successively from them to him. They sent him sheep from Fezzan, which are of strange creation and huge body, their head resembles the head of a calf. He sent them to the children of Sultan Abdul Hamid, and they were well received. Likewise, they sent him parrots, slave girls, slaves, and eunuchs. He used to send from the novelties of one region to the region where that is considered strange, and multiples of it would come to him in return. Precious things came to him from the novelties of India, Sana'a, Yemen, Sirte lands, and others, and Kadi water, jams, oud, ambergris, and Attar Shah by the pounds. He gained great fame, high status, and excessive belief among the people of Morocco. They might have believed him to have (the Great Qutbiyya/Poleship) such that if one of them arrived in Egypt as a pilgrim and did not visit him or connect with him with something, his Hajj would not be complete. If one of them came to him, he would ask him about his name, title, country, area, profession, and children, and memorize that or write it down. He would ask this one about that with kindness and gentleness. If a comer came to him the next year, he would ask him about his name and country, so he would say to him: So-and-so from such town. It would not be without him either knowing him from someone else previously, or knowing his neighbor or relative, so he would say to him: Is So-and-so well? He would say: Yes, my master. Then he would ask him about his brother So-and-so, his son So-and-so, his wife, and his daughter, and indicate to him the name of his neighborhood, his house, and what is next to it. So that Moroccan would stand up and sit down, kiss the ground once and prostrate once, and believe that this is from the clear unveiling (Kashf). You would see them in the days of the Hajj ascent and descent crowding at his door from morning to sunset. Everyone who entered among them presented something before his private conversation, either weighed silver, dates, or candles, according to his poverty or wealth. Some of them would come to him with correspondence and connections from the people of his country, its scholars, and notables, requesting answers from him. Whoever among them obtained a piece of paper, even the size of a fingertip, it was as if he obtained a good ending. He would keep it with him like an amulet, and consider that his Hajj had been accepted, otherwise he would have returned with disappointment and regret, and blame would be directed at him from the people of his country, and his regret would last until the day of his appointment. Measure upon that what has not been said. He began explaining (Ihya' 'Ulum al-Din) by al-Ghazali, and wrote fair copies of parts of it and sent some to Rome (Turkey), Sham, and the West so it would become famous like the explanation of al-Qamus and people would desire to request and copy it.",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 11
  },
  {
    "serial_number": "6337040",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 57,
    "volume_number": 1,
    "text": "And (his wife died) in the year 96 AH, so he grieved for her greatly. He buried her at the shrine known as the Shrine of Sayyida Ruqayya, and built a maqam (structure), enclosure, curtains, furnishings, and lamps over her grave. He stayed at her grave for many days. People, reciters, and singers would gather with him, and he would make food, Tharid, couscous, coffee, and sherbet for them. He bought a place next to the mentioned cemetery, built a small house on it, furnished it, and housed her mother in it, and he would sleep there sometimes. Poets aimed at him with elegies, and he would accept that from them and reward them for it. He eulogized her with poems I found in his handwriting after his death in his scattered papers, in the style of the poetry of Majnun Layla.\" Al-Jabarti cited six pieces by al-Zabidi eulogizing her, then said: \"Then he married another after her, who is the one he left behind when he died and who acquired what he collected of wealth and other things. When he reached the ultimate fame, far-reaching reputation, and great value and status among the elite and general public, and delegations came to him from all regions, and the world came to him in its entirety from every side, he stuck to his house and veiled himself from his companions whom he used to meet before that, except rarely for some purpose. He left lessons and teaching, secluded himself inside the Harem, locked the door, and overtly rejected the gifts coming to him from the Egyptian grandees. Ayyub Bey the Defterdar once sent him with his son fifty Ardabs of wheat, and loads of rice, ghee, honey, and oil, and five hundred Riyals cash, and bundles of clothing of Indian fabrics and broadcloth and other things, but he returned them. That was in Ramadan. Likewise, Mustafa Bey al-Iskandarani and others came to him, but he veiled himself from them and did not come out to them, and they returned without meeting him face to face. When Hasan Pasha arrived in the manner he arrived in Egypt, he (al-Zabidi) did not go to him; rather, he (Hasan Pasha) came to visit him. He (al-Zabidi) bestowed upon him a fur coat suitable for him, and presented him with a prepared, trained horse with a saddle and abaya, valued at a thousand dinars, which he had prepared and readied before that. His intercession with him was not rejected. If he sent him a message regarding something, he received it with acceptance and reverence, kissed the paper before reading it, placed it on his head, and executed what was in it. Once he sent a letter to Ahmad Pasha al-Jazzar mentioning in it that he is (the Awaited Mahdi) and will have a great affair. It was received by him as truth due to the inclination of souls towards desires. He placed that letter in his amulet that he wore along with charms and talismans. He used to show that to some who came to him claiming knowledge in Jafas and Zaijahs and believed its authenticity without doubt. Whoever came to him from the direction of Egypt and asked him about the translator (al-Zabidi), if he told him and informed him that he met him and took",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 12
  },
  {
    "serial_number": "6337041",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 58,
    "volume_number": 1,
    "text": "from him and mentioned him with praise and commendation, he loved him, honored him, and gave him a generous gift. If the opposite happened from him, he frowned at him, excluded him, distanced him, and withheld his kindness from him, even if he was a person of virtue. This became famous among those who knew that from him by physiognomy. He remained having a good opinion of the translator (al-Zabidi) until both passed away. It happened that Mawlay Muhammad, Sultan of Morocco, may Allah have mercy on him, connected with him with gifts before his final seclusion and asceticism, and he accepted them with praise, commendation, and supplication. He sent him in the year 1201 a gift of value, but he returned it and abstained from accepting it, and it was lost and did not return to the Sultan. The Sultan knew that from his answer, so he sent him a letter I read, which I had then was lost in papers. Its content was blame and rebuke for returning the gift. He says to him: You returned the gift we sent you from the treasury of Muslims. Would that, since you abstained from it, you had distributed it to the poor and needy, so we and you would have the reward for that, but you returned it and it was lost. (He also blames him) for his explanation of the book Al-Ihya, saying to him: You should have occupied your time with something beneficial other than that. He mentions the reason for his blame of him in that and what the scholars said, and silencing, brief, useful words. May Allah have mercy on him. The translator (al-Zabidi) has many compositions other than Sharh al-Qamus (1) and Sharh al-Ihya (2), including:\n1 - Kitab al-Jawahir al-Munifah, fi Usul Adillat Madhhab al-Imam Abu Hanifa (The Lofty Jewels, on the Principles of Evidences of the School of Imam Abu Hanifa), may Allah be pleased with him, regarding what the six Imams agreed upon (3). It is a precious, full book he arranged in the order of Hadith books by presenting what was narrated from him in beliefs then in actions according to the order of Fiqh books.\n2 - Al-Nafha al-Qudsiyya, bi-Wasitat al-Bid'a al-Aydarusiyya (The Holy Breath, through the Aydarus Part), in which he collected the chains of transmission of al-Aydarus, and it is in about ten fascicles.\n3 - Al-Iqd al-Thamin, fi Turuq al-Ilbas wal-Talqin (The Precious Necklace, on the Methods of Clothing (the Sufi cloak) and Instruction).\n4 - Hikmat al-Ishraq ila Kitab al-Afaq (The Wisdom of Illumination for the Book of Horizons).",
    "foot_note": "1. Five parts of it were printed at the Wahbi Press in 1286 AH. Then it was printed completely in ten parts at the Khayriyya Press in 1306 AH. \n2. Printed in Fez in 1302 AH in 13 parts, then in the Maymaniyya Press in 1311 AH in 10 parts, under the name \"Ithaf al-Sadah al-Muttaqin, bi-Sharh Asrar Ihya' 'Ulum al-Din\". \n3. Printed in Alexandria in 1292 AH in two parts.",
    "book_id": "984",
    "new_page_number": 13
  },
  {
    "serial_number": "6337042",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 59,
    "volume_number": 1,
    "text": "5 - Sharh al-Sadr, fi Sharh Asma' Ahl Badr (Expanding the Chest, in Explaining the Names of the People of Badr), in twenty fascicles, authored for Ali Effendi Darwish.\nAnd very many treatises, including:\n1 - Raf' Niqab al-Khafa, 'amman Intama ila Wafa wa Abi al-Wafa (Lifting the Veil of Hiddenness, from those who belong to Wafa and Abu al-Wafa).\n2 - Bulghat al-Arib, fi Mustalah Athar al-Habib (The Goal of the Intelligent, in the Terminology of the Traditions of the Beloved) (1).\n3 - I'lam al-A'lam, bi-Manasik Hajj Bayt Allah al-Haram (Informing the Notables, of the Rituals of Hajj to the Sacred House of Allah).\n4 - Zahr al-Akmam, al-Munshaqq 'an Juyub al-Ilham, bi-Sharh Sighat Sayyidi Abd al-Salam (The Flower of Calyxes, Splitting from the Pockets of Inspiration, in Explaining the Formula of Sidi Abd al-Salam).\n5 - Rashfat al-Mudam al-Makhtum al-Bakri, min Safwat Zulal Sigh al-Qutb al-Bakri (A Sip of the Sealed Bakri Wine, from the Purity of the Clear Water of the Formulas of the Pole al-Bakri).\n6 - Rashf Sulaf al-Rahiq, fi Nasab Hadrat al-Siddiq (Sipping the Choicest Nectar, in the Lineage of His Presence al-Siddiq).\n7 - Al-Qawl al-Mathbut, fi Tahqiq Lafz al-Tabut (The Established Say, in Verifying the Word Tabut).\n8 - Tansiq Qala'id al-Minan, fi Tahqiq Kalam al-Shadhili Abi al-Hasan (Arranging the Necklaces of Favors, in Verifying the Speech of al-Shadhili Abu al-Hasan).\n9 - Laqt al-La'ali, min al-Jawhar al-Ghali (Picking Pearls, from the Precious Jewel). It is on the chains of transmission of Professor al-Hifni, and he wrote his Ijazah for him on it in the year 67 AH, which is the year of his arrival in Egypt.\n10 - Al-Nawafih al-Miskiyyah, 'ala al-Fawa'ih al-Kishkiyyah (The Musk Breaths, on the Kishki Fragrances).\n11 - A part on the Hadith \"What an excellent condiment is vinegar.\"\n12 - Hadiyat al-Ikhwan, fi Shajarat al-Dukhan (The Gift of Brothers, on the Smoke Tree (Tobacco)).\n13 - Minah al-Fuyudat al-Wafiyyah, fima fi Surat al-Rahman min Asrar al-Sifah al-Ilahiyyah (The Gifts of Abundant Overflowings, regarding the Secrets of Divine Attribute in Surat al-Rahman).\n14 - Ithaf Sayyid al-Hayy, bi-Salasil Bani Tayy (Gifting the Master of the Tribe, with the Chains of Bani Tayy).\n15 - Badhl al-Majhud, fi Takhrij Hadith \"Shayjabatni Hud\" (Exerting Effort, in Graduating the Hadith \"Hud has aged me\").\n16 - Al-Murabba al-Kabili, fiman Rawa 'an al-Shams al-Babili (The Kabuli Jam, regarding who narrated from Shams al-Babili).\n17 - Al-Maqa'id al-'Indiyyah, fi al-Mashahid al-Naqshbandiyyah (The 'Indiyya Seats, in the Naqshbandi Scenes).\n18 - A treatise on Al-Manashi and Al-Saffayn!\n19 - Explanation of the sermon of Sheikh Muhammad al-Buhayri al-Burhani on the interpretation of Surat Yunus.\n20 - An independent interpretation of Surat Yunus, in the language of the people (Sufis).\n21 - Explanation of Hizb al-Barr, by al-Shadhili (2).",
    "foot_note": "1. Printed in Egypt in the year 1326 AH. \n2. Printed at al-Sa'ada Press in the year 1333 AH in 78 pages under the name \"Tanbih al-Arif al-Basir, 'ala Asrar al-Hizb al-Kabir\".",
    "book_id": "984",
    "new_page_number": 14
  },
  {
    "serial_number": "6337043",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 60,
    "volume_number": 1,
    "text": "22 - Supplement to the explanation of Hizb al-Bakri by al-Fakihi.\n23 - A Maqama he named Is'af al-Ashraf (Aiding the Nobles).\n24 - A poem in Rajaz meter on Fiqh, composed in the name of Sheikh Hasan bin Abd al-Latif al-Hasani al-Maqdisi.\n25 - Hadiqat al-Safa, fi Waliday al-Mustafa (The Garden of Purity, regarding the Parents of the Chosen One). Sheikh Hasan al-Mudabighi commended it.\n26 - A treatise on the classes of Huffaz (Hadith masters).\n27 - A treatise on verifying the saying of Abu al-Hasan al-Shadhili: \"It is not of generosity...\" etc.\n28 - Aqilat al-Atrab, fi Sanad al-Tariqa wa al-Ahzab (The Choice of Peers, on the Chain of the Path and Hizbs), authored for Sheikh Abd al-Wahhab al-Shirbini.\n29 - Al-Ta'liqa, 'ala Musalsalat Ibn Aqila (The Commentary, on the Musalsalat of Ibn Aqila).\n30 - Al-Minah al-Aliyya, fi al-Tariqa al-Naqshbandiyyah (The High Gifts, in the Naqshbandi Path).\n31 - Al-Intisar, li-Waliday al-Nabi al-Mukhtar (The Victory, for the Parents of the Chosen Prophet).\n32 - Al-Alfiyyah (Poem of 1000 verses) on Sanad and the Merits of the People of Hadith.\n33 - Kashf al-Litham, 'an Adab al-Iman wa al-Islam (Unveiling the Veil, from the Etiquettes of Iman and Islam).\n34 - Raf' al-Shakwa, li-'Alim al-Sirr wa al-Najwa (Raising the Complaint, to the Knower of Secret and Private Counsel).\n35 - Tarwih al-Qulub, bi-Dhikr Muluk Bani Ayyub (Refreshing Hearts, by Mentioning the Kings of Bani Ayyub).\n36 - Raf' al-Kalal, 'an al-'Ilal (Lifting Fatigue, from Defects).\n37 - Musamarat al-Habib (Conversing with the Beloved). He mentioned it in Taj al-Arus under the entry (Bazz) and said: \"Minyat al-Bazz with Fath: A village in Egypt, I entered it and authored Musamarat al-Habib in it in one night.\"\n38 - A treatise he named Qalansuwah al-Taj (The Cap of the Crown), authored in the name of the righteous scholar Sheikh Muhammad Budair al-Maqdisi. That was when he completed the explanation of al-Qamus named Taj al-Arus, he sent fascicles from its beginning while he was in Egypt, in the year 82 AH, for his Sheikh, Sheikh Attiya al-Ajhuri to look at them and write a commendation on them. He did so and wrote asking him for Ijazah. So he wrote him his high chains of transmission in a booklet and named it Qalansuwah al-Taj (1).\nAl-Jabarti summarized this treatise and mentioned what relates to it, then mentioned that al-Zabidi has many poems, and narrated some of them.",
    "foot_note": "1. He missed mentioning \"Kitab Nashwat al-Irtiyah, fi Bayan Haqiqat al-Maysir wa al-Qidah\". Printed in Leiden 1303.",
    "book_id": "984",
    "new_page_number": 15
  },
  {
    "serial_number": "6337044",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 61,
    "volume_number": 1,
    "text": "Then he narrated the news of his death after being afflicted with the plague, and that his wife hid the news until she seized most of what he left of precious things. He was buried in a grave he had prepared for himself next to his wife.\nThen he said describing him: \"His description was medium height, thin body, golden color, proportionate limbs, moderate beard, gray hair had mixed in most of it, luxurious in his dress. He wore a turban like the people of Mecca, a tilted turban with white muslin, having a tail hanging on his nape, and having a braiding and silk tassels about a span long, and its other end inside the fold of the turban, with some of its ends visible. He was of gentle self, good qualities, cheerful, smiling, dignified, modest, recalling anecdotes and occasions, intelligent, witty, sagacious, brilliant.\"\n\nThe Original Copy:\nIt is a precious copy in the library of the noble brother, the Muhaddith Professor Sheikh Ahmad Muhammad Shakir, photocopied from a copy in the author's own handwriting. He honored me, may Allah preserve him, by lending it to me to publish it.\nThis photocopy has a sister in the Egyptian National Library under number 2799 History. The Institute of Manuscripts at the Arab League photocopied a copy of it in film 404. It consists of 14 folios, each page containing 19 lines, and each line about ten words written in the usual Persian script. In its margin are some additions and corrections by the pen of al-Zabidi.\nThe following is its text:",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 16
  },
  {
    "serial_number": "6337045",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 62,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\nPraise be to Allah who created man and taught him expression, and favored him over all other species with distinction and clarification. Blessings and peace be upon our master Muhammad, the most guided of His beings and the happiest of His creatures, the master of the children of Adnan, and upon his family, companions, and their followers as long as bulbuls trill with melodies and warbling birds sing on the branches of trees.\nTo proceed, since the craft of calligraphy is the most useful merchandise for writers, and the widest sufficiency for students in this chapter, and the most honorable means for closeness, and the kindest connection for expanding sustenance and welcome, as the poet said:\nDo not turn away from the right of writing for it is... the abode of wealth and the keys of sustenance\nAnd fear the quill and hope in it for it is that which... is known for blowing poison and antidote\nAnd the one characterized by it is the trust of news, the bag of secrets, the confidant of the great, the senior of companions, the interpreter of the Sultan, and the chest of expression, I authored this treatise including the virtue of calligraphy and the pen, the traditions reported about them, the secrets the wise have regarding them, an explanation of who first established the script and composed the letters, clothed them in the robes of detail and placed them in the best of conditions. Then an explanation of the illustrious writers and notables of the art in a good, pleasant order.\nI have made it a gift to the library of the one who excelled in it and became famous like the fame of the sun in the middle of the day (1), refined its rules and perfected its ranks with good control and consideration, the beauty of this art in which he surpassed and excelled, and combined between solidity and beauty what was not preceded. So to Allah belongs",
    "foot_note": "1. It appeared as \"Rabi'a\" (fourth) with 'Ba' clearly. It has its interpretation (meaning mid-day).",
    "book_id": "984",
    "new_page_number": 17
  },
  {
    "serial_number": "6337046",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 63,
    "volume_number": 1,
    "text": "what he gathered. If Ibn Hilal saw him, he would acknowledge his mastery, or if Yaqut was his contemporary, he would say this is the pupil of the eye of time. Or if the Sheikh (1) saw him, he would be proud of him in his era, and admit that he is the unique one of his city. The perfect, skilled master, the writer, possessor of the wondrous script shining like stars, possessor of the fragrant scent, Prince Hassan Effendi nicknamed al-Rushdi. May Allah beautify this craft and its people with his beauty, facilitate for him the paths of goodness, and open its doors for him.\nSo take it as a useful newspaper for the trainee writer, and a saving unbored pearl for the learner from troubles, and a ship sailing to the purposes of those contemplating it from every chapter, and a weighty treasure for one who exposes himself to acquiring pearls from the paths of correctness. A newspaper whose corners are laden with musk, and a casket whose hiding places are filled with pearls. I dictated it from the strange daughters of thoughts, and the rare results of the fruits of the righteous.\nEvery line of the ruby (Yaqut) increased in height... So do not compare it with what is carved from stone\nI broke it down into ten chapters and a conclusion, and named it: \"The Wisdom of Illumination, for the Book of Horizons\". Upon Allah is my reliance and in Him I seek help, in matters of the world and religion.",
    "foot_note": "1. Meaning Sheikh Hamdullah son of Sheikh Mustafa al-Amasi.",
    "book_id": "984",
    "new_page_number": 18
  },
  {
    "serial_number": "6337047",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 64,
    "volume_number": 1,
    "text": "Chapter: On the mention of who established the script and its origin, and who connected and separated it\nIt is said: The first to establish script and all books was Adam, peace be upon him, three hundred years before his death. He wrote them in clay and baked it. When the drowning led the people astray, every people found their book.\nIt is said: The first to establish it was Enoch, who is Idris, peace be upon him.\nIt is said that Nafis (1), Nasr (2), Tayma, and Dumah, sons of Ismail, established one script and made it one connected line, not separated, all letters connected. Then Nabt (3), Hamaysa, and Qaydar separated it, separated the letters, and made the similarities.\nAs for the Arabic script, the first to establish it and compose its letters were six persons from Tasm, who were staying with Adnan bin Udad. Their names were: Abjad, Hawwaz, Hutti, Kalamun, Sa'fas, Qarashat. They established writing and script based on their names. When they found letters in words that were not in their names, they appended them to them, and called them the Ruwadif (followers), which are Thakhadh, Dazagh.\nIt is said: The first to establish Arabic script was Muramir bin Murrah (4), and it is said, Amir bin Jadrah - the author of al-Qamus mentioned each of them - and it is said Aslam bin Sidrah. They were a group from",
    "foot_note": "1. The Torah calls him: \"Naphish\". Genesis 25: 15. \n2. Thus. But it is \"Jetur\". Genesis 25: 15. \n3. He is \"Nebaioth\". He is Ismail's firstborn. Genesis 25: 13. \n4. And it is said \"Ibn Marwah\". Al-Lisan (Marar).",
    "book_id": "984",
    "new_page_number": 19
  },
  {
    "serial_number": "6337048",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 65,
    "volume_number": 1,
    "text": "Bulan. They drew it as separated letters, then measured it against the Syriac spelling. So Muramir established its forms, Amir made it unpointed (no diacritics), and Aslam connected and separated.\nIbn Khallikan said (1): The correct view among scholars is that the first to write was Muramir bin Murrah from the people of Anbar. It is said he is from Bani Murrah. From Anbar, writing spread among people. Al-Asma'i said: They mentioned that Quraysh were asked: Where did you get writing from? They said: From Anbar (2).\nHisham bin Muhammad bin al-Sa'ib said: Bishr bin Abd al-Malik learned writing from the people of Anbar and went out to Mecca and married al-Sahba bint Harb bin Umayyah. Harb learned (3) from him, and from him his son Sufyan, and from him his brother's son our master Muawiya, may Allah be pleased with him. Then it spread in Quraysh, and it is the Kufic script from which the pens (scripts) that exist now were derived.\nThere is discussion on this in Al-I'lam (4) by al-Suhayli, Al-Muzhir by al-Suyuti, and Al-Awwaliyyat by al-Askari. We have mentioned their words in our book \"Taj al-Arus li-Sharh Jawahir al-Qamus\". Whoever wants more than that should refer to it.",
    "foot_note": "1. In Wafiyat al-A'yan 1: 346 in the biography of Ali bin Hilal, known as Ibn al-Bawwab. \n2. In Wafiyat: \"They said from al-Hirah. And the people of al-Hirah were asked: Where did you get writing from? They said: From Anbar.\" \n3. Thus. Without 'Waw' before it. \n4. It is \"Al-Ta'rif wa al-I'lam, fima Ubhima fi al-Qur'an min al-Asma' al-A'lam\". Printed in Egypt corrected by Mahmud Rabi' in 1356. See pages 40-41.",
    "book_id": "984",
    "new_page_number": 20
  },
  {
    "serial_number": "6337049",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 66,
    "volume_number": 1,
    "text": "Chapter: On the virtue of calligraphy and what has been said about it\nIt came in the interpretation of the Almighty's saying: \"He increases in creation what He wills\": that it is beautiful handwriting.\nFrom Ibn Abbas, may Allah be pleased with them both, regarding the Almighty's saying: \"or a trace of knowledge\", he said: Handwriting.\nIt is narrated in the reported tradition: Whoever writes Bismillah al-Rahman al-Rahim and beautifies it, Allah will treat him beautifully. Thus in Minhaj al-Isabah by al-Zaftawi.\nIn Shir'at al-Islam (1): Whoever writes Bismillah al-Rahman al-Rahim and improves it, Allah will forgive him.\nIn Al-Jami' al-Saghir (2) from the narration of Salama (3): \"Good handwriting increases the truth in clarity.\" Also in it: \"Bind knowledge by writing (4).\" Its commentator al-Munawi (5) said: Knowledge is understood then memorized, and forgetfulness is inherent in the heart, so for fear of knowledge departing, it was bound by writing.\nIt came in another Hadith: \"The right of a parent upon his child is to teach him writing, swimming, and shooting, and to provide him with nothing but what is good (Halal) (6).\" In another narration: \"The right of a parent upon",
    "foot_note": "1. Shir'at al-Islam, by Imam the Preacher Muhammad bin Abi Bakr known as Imam Zadeh al-Hanafi, died in 573 AH. \n2. Al-Jami' al-Saghir fi Ahadith al-Bashir al-Nadhir, by Jalal al-Din al-Suyuti died in 911 AH. \n3. Thus in his handwriting. In Al-Jami' al-Saghir 4134 \"Umm Salama\". Al-Suyuti indicated it is a weak Hadith. The Hadith was narrated attributed to Ali in Subh al-A'sha 3: 2. \n4. Al-Jami' al-Saghir 6167 from Anas and Ibn Amr. He indicated it is an authentic Hadith. \n5. He is Shams al-Din Muhammad called Abd al-Ra'uf al-Munawi al-Shafi'i died in 1030 AH. Khulasat al-Athar 2: 412. His commentary \"Al-Taysir\", a summary of his large commentary \"Fayd al-Qadir\", was printed in two volumes in Bulaq in 1286 AH. \n6. In Al-Jami' al-Saghir 3742 from the Hadith of Abu Rafi', and he indicated it is weak.",
    "book_id": "984",
    "new_page_number": 21
  },
  {
    "serial_number": "6337050",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 67,
    "volume_number": 1,
    "text": "his child is to give him a good name, marry him off when he matures, and teach him the Book (1).\" The commentator said: Meaning the Quran, and it possibly means writing.\nAlso in the Hadith, he, peace be upon him, said to Zaid bin Thabit - who is one of his scribes as will come -: \"If you write Bismillah al-Rahman al-Rahim, then make the Sin clear in it\" (2).\nThe author of Al-Shir'a also mentioned that he, peace be upon him, said to Muawiya, may Allah be pleased with him, while he was writing before him: \"Put the inkwell, sharpen the pen, erect the Ba', separate the Sin, do not blind the Mim, beautify Allah, extend al-Rahman, and improve al-Rahim.\"\nThey said: Since writing is noble, good handwriting in it is a virtue.\nAl-Ma'mun said: If the non-Arab kings boasted to us with their likes, we would boast over them with our types.\nHandwriting is read in every place, translated in every tongue, and found with every time.\nAl-Nazzam said: Handwriting is an origin in the spirit that appears with a bodily instrument (3).\nSome wise men said (4): Handwriting is the necklace of wisdom, by it (5) its fragments are detailed and its scattered parts organized.\nIt is said: Quraysh are the people of Allah, because they are good scribes (6).\nIt used to be said: Good handwriting is one of the two tongues, just as it was said: Few dependents is one of the two eases.",
    "foot_note": "1. In Al-Jami' 3743 from Abu Huraira. And he mentioned it is weak. \n2. Weak Hadith, as in Al-Jami' al-Saghir 835. \n3. Subh al-A'sha: \"Handwriting is the origin of the spirit, it has a bodily form in all actions.\" \n4. In Subh al-A'sha 3: 2 it is \"Ja'far bin Yahya\". \n5. Thus in the original. In Subh al-A'sha: \"And by it its fragments are detailed, and its scattered parts organized.\" \n6. Thus. In Adab al-Kuttab by al-Suli 28: \"It was narrated from the Prophet, peace be upon him, that he said: 'Quraysh are the people of Allah, and they are the scribes (Katabah), the reckoners (Hasabah)': plural of Katib and Hasib.\"",
    "book_id": "984",
    "new_page_number": 22
  },
  {
    "serial_number": "6337051",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 68,
    "volume_number": 1,
    "text": "Some scholars said (1): Handwriting is like the spirit in the body. If a person is beautiful, handsome, and of good appearance, he is greater in the eyes and more magnificent in the souls. And with the opposite of that, souls tire of him. Likewise, handwriting, if it is of good description, pleasant arrangement, open eyes, smooth texts, much harmony, little difference, souls delight in it and spirits desire it, such that a person reads it - even if it contains base speech and bad meaning - seeking more of it even if it is much, without boredom or annoyance affecting him. And if the handwriting is ugly, understandings reject it, eyes and thoughts cast it away, and its reader tires of it even if it contains the wonders of wisdom and the oddities of expressions.\nIt is said: The weight of handwriting is like the weight of reading; the best handwriting is the clearest, just as the best reading is the clearest (2). The profession of the principles of handwriting and its geometry, its quality and reality, is more honorable than doing it by imitation without verification.\nIt is said: Ahmad bin Ismail described handwriting saying: If it were a plant, it would be a flower; if it were a mineral, it would be gold dust; or a taste, it would be sweet; or a drink, it would be pure (3).\nAmr bin Mas'ada said: Scripts are the gardens of sciences. Their form is its spirit is clarity, its body is speed, its foot is equality, its limbs are knowing the separations, and its classification is like the classification of melodies and tunes.",
    "foot_note": "1. See Subh al-A'sha 3: 20 - 21. \n2. Subh al-A'sha 3: 21. \n3. Adab al-Kuttab by al-Suli 45.",
    "book_id": "984",
    "new_page_number": 23
  },
  {
    "serial_number": "6337052",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 69,
    "volume_number": 1,
    "text": "It is said: The most praiseworthy scripts in drawing are those whose sections are balanced, whose Alif and Lam are erect, whose lines are straight, whose ascent matches its descent (1), whose eyes are open, whose Ra' and Nun are not confused, whose origins are estimated (2), whose connections are merged, and whose thin and thick parts are proportionate. One should not combine in a line between two extensions or two returned Ya's, and the places of separations and connections should be observed, and a word should not be cut by a letter isolated in another line.",
    "foot_note": "1. Thus. In Adab al-Kuttab 50: \"and its ascent matches its descent.\" \n2. Thus. In Adab al-Kuttab: \"its joints/sections.\"",
    "book_id": "984",
    "new_page_number": 24
  },
  {
    "serial_number": "6337053",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 70,
    "volume_number": 1,
    "text": "Chapter: On the Pen, and their wisdom regarding it\nIt is said: It is the first thing Allah Almighty created, and with its mention He began in the Quran, saying Almighty: \"Who taught by the pen. Taught man that which he knew not.\" And He Almighty said: \"Nun. By the pen and what they inscribe.\"\nSo He, Glory be to Him and Exalted, clarified that the craft of the pen is the best of crafts (1), and the most glorious of goods.\nIt is said: It is not called a pen (Qalam) until it is sharpened (Yubra), otherwise it is a reed (Qasabah). A spear is not called a spear unless it has a head, otherwise it is a shaft (Qanat). A table is not called a table (Ma'idah) unless it has food on it, otherwise it is a tray (Khiwan). A cup is not called a cup (Ka's) unless it has drink in it, otherwise it is a glass (Zujajah).\nSome of the Greek kings said (2): The affair of the world and religion falls under two things: a sword and a pen, and the sword is under the pen.\nAbu al-Fath al-Busti said:\nIf heroes swear one day by their sword... And count it among what earns glory and generosity\nIt suffices the pen of scribes in glory and loftiness... For eternity that Allah swore by the pen (3)\nAlexander said: What pens have established, days have not coveted to erase.\nIt is said: The pen is the tongue of sight, and the mount of thought.",
    "foot_note": "1. The word appeared long ago in Al-Tanbih wa al-Ishraf by al-Masudi 5, Akhbar al-Ulama by al-Qifti 195, and Al-Durar al-Kaminah 3: 420. \n2. Adab al-Kuttab by al-Suli 45. In Subh al-A'sha 2: 447: \"Some Greek sages.\" \n3. Subh al-A'sha 2: 445.",
    "book_id": "984",
    "new_page_number": 25
  },
  {
    "serial_number": "6337054",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 71,
    "volume_number": 1,
    "text": "Another said: By the pen, the daughters of minds are wedded to the curtained chambers of books.\nAl-Attabi said: By the weeping of pens, the pages smile.\nIbn al-Mu'tazz said: The pen serves the will, and does not tire of seeking more. It is silent while standing and speaks while walking, in a land whose whiteness is dark, and whose blackness is luminous.\nAristotle said (1): The writer is the effective cause, the pen is the instrumental cause, the ink is the material cause, the script is the formal cause, and eloquence is the final cause.\nIbrahim bin al-Abbas al-Suli said to a scribe (2): Lengthen the trunk (Khurtum) of your pen. He said (3): Does it have a trunk? He said: Yes, and recited:\nAs if the noses of birds in its courtyards... Are trunks of pens writing and dotting\nAs for its size, holding it, and its conditions, the master Ibn Muqla said: The best size of a pen is that it does not exceed a span by more than its Jilfah (nib/tip section) (4).\nThe poet said:\nHe has an interpreter, mute in utterance, silent... At the measure of a span, nay, exceeding the span (5)\nSheikh Muhammad bin al-Afif (6), may Allah Almighty have mercy on him, said: The craft of holding it is with the thumb and middle finger, and the index finger prevents it from tilting and shaking. It should be extended, not",
    "foot_note": "1. Adab al-Kuttab by al-Suli 45 and Subh al-A'sha 448. \n2. In Subh al-A'sha 2: 459: \"The Scribe\". \n3. In Subh al-A'sha: \"It was said to him\". \n4. In Tarikh Baghdad 5: 217, Jilfah is the opening of the pen's head. Ibn Muqla's words can be found in Subh al-A'sha 2: 454. \n5. Before it in Subh al-A'sha: A youth, if he possessed the world, would become naked... Of money, compensated with clothes of thanks \n6. The speech is summarized in Subh al-A'sha 3: 37.",
    "book_id": "984",
    "new_page_number": 26
  },
  {
    "serial_number": "6337055",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 72,
    "volume_number": 1,
    "text": "clenched, because by extending the fingers, the writer can rotate the pen. He should not press on the pen heavily, weakening it, nor hold it weakly, weakening his ability in writing. Rather, the writer should make his reliance in that moderate.\nIshaq bin Hammad said: The pen to the writer is like the sword to the brave.\nAl-Dahhak bin Ajlan said: O you who undertake writing, gather your heart when you strike the pen, for it is only your mind that you are displaying.\nAs for its state in hardness and softness, it follows the paper. Because if it is soft, it needs the tube (Unbub) to have softness, its flesh to have excess, and its skin to have hardness. If it is hard, it needs the tube to have dryness and hardness. He said: The reason for that is that its need for ink on soft paper is greater than its need for it on hard paper. So its moisture and flesh preserve for it the abundance of ink supply, while on hard paper, whatever reaches it from the hard pen free of ink is sufficient (1).\nThe Sheikh of this craft, Imad al-Din al-Shirazi (2), said: The most praiseworthy pens are those whose states are moderate in length and shortness, thickness and thinness. For the thin, slender one, the fingertips gather on it, so it remains inclined to what is between the three, and the excessively thick one is not carried by the fingertips.\nIbn al-Zayyat said (3): The best of pens is what has matured firmly, its seed has lightened, reached its prime, and straightened.",
    "foot_note": "1. Subh al-A'sha 2: 455. \n2. See Subh al-A'sha 2: 454. \n3. It is in a longer phrase in Subh al-A'sha 2: 453.",
    "book_id": "984",
    "new_page_number": 27
  },
  {
    "serial_number": "6337056",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 73,
    "volume_number": 1,
    "text": "Chapter: On the inkwell, its description, and its tools\nAl-Hasan bin Wahb said (1): The way of the inkwell is to be moderate in its size, not small so its pens become short and ugly, nor thick so its carrying becomes heavy.\nAl-Fadl said: It should be made from the best woods and highest in price, like Ebony, Sasim, and Sandalwood (2).\nAs for the (Juna - pot) in which the ink container is, it should be a round-headed shape, meeting at two right angles. It should not be square in any case, because if it is square, the ink thickens. If it is round, it is purer for the ink (3) and happier in supplying ink. One should strive in improving, perfecting, and maintaining it. Al-Mada'ini recited (4):\nPerfect your inkwell and strive to maintain it... For inkwells are the treasuries of manners\nAmong its tools is the (Liqa - threads/fiber put in inkwell), and it is made of silk, cotton, and wool. The Arabs called all that Kursuf.\nSome of them said (5): Whoever does not do well in supplying ink, sharpening the pen, splitting, cutting,",
    "foot_note": "1. See Subh al-A'sha 2: 442. \n2. Subh al-A'sha 2: 441. \n3. In Subh al-A'sha 2: 468: \"More lasting for the ink.\" \n4. In Subh al-A'sha 2: 443: \"To Allah belongs the goodness of Al-Mada'ini where he says.\" \n5. Mentioned in Subh al-A'sha 2: 456 that he is Al-Muqri Al-Ala'i Ibn Fadl Allah.",
    "book_id": "984",
    "new_page_number": 28
  },
  {
    "serial_number": "6337057",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 74,
    "volume_number": 1,
    "text": "holding the scroll (Tumar), and the division of hand movement during writing, is nothing in writing.\nIbn al-Afif said: Whoever does not know the face of the pen, its chest, and its width, is nothing in writing (1).\nAnother said (2): According to the writer's ability to rotate his pen and the speed of his hand in turning, the purity of the essence of his letters will be (3).\nIf the writer takes ink, let the pen be in his fingers in the form of his holding it during writing, and let him not turn it to take ink, because the best method in it is to be in the writer's hand in its position for writing. He moves the head of the pen from the inside of his hand to its outside, for he can maintain the pen's position in the fingers with it. When he deviates from this, hardship befalls him in transferring the finger positioning in every dip. This is one of the greatest things a writer needs, because this is what the quality of handwriting revolves around. Rarely does the knowledge of this inform you except seeing it from a scholar skilled (4) in the geometry of handwriting, along with what accompanies him of deliberation and good performance.\nSome writers said: It is incumbent on the writer to inspect the Liqa and scent it with the best available, for it changes over the long term. And he recited:\nA witty person, his inkwell testified against him... That the young man was never other than witty",
    "foot_note": "1. Subh al-A'sha 2: 464. \n2. He is Ibn al-Afif as in Subh al-A'sha 3: 38. \n3. The following speech was attributed in Subh al-A'sha 3: 38 to Sheikh Imad al-Din al-Afif. \n4. In Subh al-A'sha: \"And rarely does one grasp the knowledge of this chapter except the skilled scholar.\"",
    "book_id": "984",
    "new_page_number": 29
  },
  {
    "serial_number": "6337058",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 75,
    "volume_number": 1,
    "text": "Some writers used to scent their inkwell with some of the perfume they had for themselves. He was asked about that, and he said: Because we write with it the name of Allah Almighty and the name of His Prophet, peace be upon him.\nAnother said: It is incumbent on the writer to renew the Liqa every month, and to close the inkwell when he finishes so that nothing falls into it that spoils the writing.\nAnother said (1): The writer should not take too much ink, but take a moderate amount. He should not move the Liqa from its place, nor scatter with the pen (2), nor return the pen to the Liqa until he exhausts what ink is in it. He should not insert much of it into the inkwell but up to the limit of its split (3), not exceeding that to the end of the opening.\nAmong its tools is the (Knife), which is the blade. They said: It is not used for anything other than sharpening the pen. It is desirable to exaggerate in watering and sharpening it, to enable sharpening, so the essence of the pen becomes pure and its cut does not splinter. It is the whetstone of pens; they are sharpened with it if they become blunt, released if they stop, and gathered if they become disheveled. The best of them is what has a wide chest, a thin edge, and its handle is not separated from the grip (4), and is straight without curvature. They used to prefer the 'Uqabiyyah (Eagle-like) (5), which is the one whose chest is wider than its belly.\nAmong its tools is the (Milwaq - stirrer) because the inkwell is stirred with it. The best is made of Ebony, so the ink color does not change it. It should be round, conical, with a wide head and thin [end].",
    "foot_note": "1. He is Al-Muqri Al-Ala'i, Ibn Fadl Allah, as in Subh al-A'sha 3: 39. \n2. Subh al-A'sha: \"Nor stumble with the pen.\" \n3. Subh al-A'sha: \"Shaqqah\" (its split). \n4. Adab al-Kuttab 115. \n5. See Subh al-A'sha 2: 467.",
    "book_id": "984",
    "new_page_number": 30
  },
  {
    "serial_number": "6337059",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 76,
    "volume_number": 1,
    "text": "Chapter: On Ink (Madad) and Ink (Hibr)\nIt was named Madad because it aids (Yamuddu) the pen, i.e., helps it. Black was used in it over others because of its contrast to the color of the paper. No color is an opposite (1) to its companion except black and white.\nAnother said (2): The image of ink in eyes is black, and in insights is white. Ink is a pillar of the pillars of writing and upon it is the reliance of writers (3). They recited regarding that:\nA quarter of writing is in the blackness of its ink... And a quarter is the good craft of the writers\nAnd a quarter is from a pen whose sharpening is straight... And upon the papers is the fourth of causes (4)\nJa'far bin Muhammad looked at a young man who had ink trace on his clothes while he was hiding it from him. He said to him: O you, ink on clothes is of chivalry (5).\nIbn al-Afif said: Two things without which ink is not complete are Honey and Gum (Sabr). As for",
    "foot_note": "1. Thus in the original, as an adjective. In Subh al-A'sha 2: 473: \"Opposes its companion like the opposition of black to white.\" \n2. In Subh al-A'sha 2: 472: \"Some wise men.\" \n3. In Subh al-A'sha 2: 473: \"And upon it revolves a quarter of it.\" \n4. Subh al-A'sha 2: 473: \"Tasawwa baryuhu\" (its sharpening was equal). And Kawaghid, appeared with the dotted Dhal. Kaghad and Kaghid are two dialects in Persian, meaning the paper written on. Steingass 1006. In Subh al-A'sha: \"Kawagid\" with undotted Dal. \n5. Subh al-A'sha 2: 472.",
    "book_id": "984",
    "new_page_number": 31
  },
  {
    "serial_number": "6337060",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 77,
    "volume_number": 1,
    "text": "honey, it preserves it over the passage of days and it hardly changes from its state. As for gum, it prevents flies from landing on it.\nSome litterateurs said: Perfume the notebooks of manners with the blackness of ink (1).\nAnother said (2): By the glitter of ink, minds are guided to the hidden treasures of wisdom, because it is more lasting over time, more growing for remembrance, and more increasing for reward.",
    "foot_note": "1. Subh al-A'sha 2: 472. \n2. He is Faris bin Hatim, as in Subh al-A'sha 2: 473.",
    "book_id": "984",
    "new_page_number": 32
  },
  {
    "serial_number": "6337061",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 78,
    "volume_number": 1,
    "text": "Chapter: On Sharpening Pens\nIt is narrated that Al-Dahhak, when he wanted to sharpen a pen, would hide so no one would see him and say: Handwriting is all about the pen (1).\nAl-Ansari, when he wanted to sharpen, would do that, and when he wanted to stand up from the Diwan, he would cut off the heads of the pens (2).\nThey said: Teaching sharpening is greater than teaching handwriting (3).\nIbn al-Afif said: The corruption of sharpening is from the dullness of the knife.\nSome of them said (4): The quality of sharpening is half of handwriting.\nIt is said: Some of them (5), when taking the tube to sharpen it, would inspect it beforehand. When wanting to cut, he would pause, then investigate and pause, then cut with deliberation.\nIt is narrated in Ibn Muqla's handwriting: The essence of handwriting is good sharpening. Whoever does it well, handwriting becomes easy for him. Whoever's heart retains the many types of pen cutting is capable of handwriting, and only a wise person learns that.",
    "foot_note": "1. In Subh al-A'sha 2: 456 \"The pen\"... And this Al-Dahhak is Al-Dahhak bin Ajlan. \n2. Added in Subh al-A'sha 2: 456: \"So no one sees them.\" \n3. Subh al-A'sha 2: 456. \n4. He is Al-Muqri Al-Ala'i Ibn Fadl Allah. Subh al-A'sha 2: 456. \n5. See Subh al-A'sha 2: 462.",
    "book_id": "984",
    "new_page_number": 33
  },
  {
    "serial_number": "6337062",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 79,
    "volume_number": 1,
    "text": "Ibn Hilal said (1): Every pen whose Jilfah (nib section) is short, the script comes from it Awqas, i.e., short-necked.\nIbn al-Barbari said: Beware of clumsiness in sharpening and leaving improving it. Whoever's instrument is corrupt, his work is corrupt.\nIbn al-Afif said (2): If the sharpening is long, the script comes with it lighter, weaker, and sweeter. If it is short, the script comes purer, heavier, and stronger.\nAs for the description of splitting it, Ibn Hilal said: It should be in its middle, and let the thickness of both teeth be equal. He said: It is permissible for the right one to be thicker than the left, but the reverse is not permissible in any case (3).\nAs for cutting it, it is on descriptions: Including the inclined (Muharraf), the level (Mustawi), the upright (Qa'im), and the sloped (Musawwab). The best is the inclined with moderate inclination, and the worst is the level, because the level has less maneuverability than the inclined. Ibn al-Afif said it.\nAbd al-Hamid the Scribe said to Raghban, who was writing with a pen of short sharpening: Do you want your handwriting to improve? He said: Yes. He said: Lengthen the Jilfah of your pen, thicken it, incline the cut, and direct it right. Raghban said: I did that, and my handwriting improved (4).\nIbn Muqla said to his brother: If you cut the pen, do not cut it except on a smooth, hard cutting board (Maqatt),",
    "foot_note": "1. He is Abu al-Hasan Ali bin Hilal, known as Ibn al-Bawwab, died in 423 AH. See Subh al-A'sha 2: 459. \n2. Subh al-A'sha 2: 459. \n3. Subh al-A'sha 2: 461. \n4. Subh al-A'sha 2: 459.",
    "book_id": "984",
    "new_page_number": 34
  },
  {
    "serial_number": "6337063",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 80,
    "volume_number": 1,
    "text": "neither notched nor rough, so the pen does not splinter. Sharpen the knife sharply, and let it be very penetrating; for if it is dull, the script comes bad and disturbed. Lay the knife down slightly if you intend to cut, and do not erect it steeply (1).\nIbn al-Afif said: It is incumbent that it be of hard wood like Ebony and Ivory, and the face cut upon should be flat, not round.",
    "foot_note": "1. Subh al-A'sha 2: 463 with abbreviation.",
    "book_id": "984",
    "new_page_number": 35
  },
  {
    "serial_number": "6337064",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 81,
    "volume_number": 1,
    "text": "Chapter: On Dotting (Nuqat)\nIt is what indicates the letters of the alphabet, and separates between them, so Ba' is known from Tha' by it. It is said: The first to dot the Mushafs and establish Arabic grammar was Abu al-Aswad al-Du'ali, by instruction from the Commander of the Faithful Ali bin Abi Talib, may Allah be pleased with him.\nIbn Muqla said: Dots have two forms: One is a square shape, and the other is a round shape. If there are two dots on a letter, if you wish, place one above the other, or place them together in a line. If next to that letter is a letter that is dotted, it is not permissible for the dots, if paired, to be anything but one above the other. The reason for that is that if the dots are in a line and exit their letters, confusion and ambiguity occur. If some are placed on others, each letter has its share of dots, and ambiguity is removed.",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 36
  },
  {
    "serial_number": "6337065",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 82,
    "volume_number": 1,
    "text": "Chapter: On Vowelization (Shakl)\nSome linguists said: The shape (Shakl) of letters is taken from the shackle (Shikal) of the beast, because letters are controlled and restricted by it, so their syntax is not confused, just as the beast is controlled by the shackle.\nSome of them said: Adorn the strange words with restriction, and fortify them against the semblance of misspelling and distortion. It is three movements: Raf' (nominative), Nasb (accusative), and Khafd (genitive).\nAs for Jazm (jussive/sukoon), its form is contrary to the forms of movements, entirely circular, as if they intend by it the Mim from \"Ijzim\" (make jazm), and deleted the tail of the Mim for lightness.\nIbn al-Afif said: If the letter is Fathah with Tanwin, its sign is two lines above it, and between them is like the measure of one of them. If it is Dammah with Tanwin, its sign is Sin without a tail, as if you intend the beginning of \"Shadid\" (1). If it is Jazm, its sign is Kha' without a tail, as if you intend the beginning of \"Khafif\". This is the doctrine of the master Abu al-Hasan (2), and upon it are the generality of the people of the East. If it is hamzated, its sign is to fix above it an 'Ayn without a tail, due to the proximity of the exit of Hamzah from 'Ayn. He said: There must be proportion between the vowelization and the dots, and proportion of white spaces in that (3).",
    "foot_note": "1. Subh al-A'sha 3: 163. \n2. Abu al-Hasan Ali bin Hilal, known as Ibn al-Bawwab. See p. 76. \n3. See Subh al-A'sha 3: 167.",
    "book_id": "984",
    "new_page_number": 37
  },
  {
    "serial_number": "6337066",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 83,
    "volume_number": 1,
    "text": "Chapter: On the mention of the alphabet letters and their secret in determining number\nKura' said: The separated letters were called alphabet letters (Huruf al-Mu'jam) because they were ambiguous until clarified by dots.\nSome astronomers said: The number of Arabic letters is twenty-eight letters, on the number of the moon's mansions. The maximum a word reaches from them with the extra letters attached to it is seven letters, on the number of the seven planets. He said: The forms of extra letters are twelve (1) on the number of the twelve zodiac signs. The extra letters are ten letters, gathered in \"Sa'altumuniha\".\nIt preceded that the total letters are twenty-eight letters. Those into which the Lam of definition (Al-) is assimilated from these letters are fourteen letters, like those hidden under the earth from the moon's mansions. The rest appear with the definition, and they are fourteen letters like the visible mansions.\nIt preceded that the alphabet letters are twenty-eight single letters, and Lam-Alif is composed from them, so that is twenty-nine letters. They have eighteen (2) forms, because what agreed in form, there is no benefit in mentioning its likeness, because mentioning one of the forms (1) substitutes for all of them, like Ba', Ta', and Tha', and Jim, Ha', and Kha'. These eighteen (1) forms end up single and compound, as explained in its place.",
    "foot_note": "1. Thus in the original. \n2. Thus in the original. The correct form is \"Thamani 'Ashrah\".",
    "book_id": "984",
    "new_page_number": 38
  },
  {
    "serial_number": "6337067",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 84,
    "volume_number": 1,
    "text": "Chapter: On the mention of the noble scribes\nFrom the time of the Prophet, peace be upon him, to this time of ours, in order of arrangement and good refinement.\nThose who wrote for him, peace be upon him, and were honored to serve him by writing were the four Caliphs, Amir bin Fuhayra, Abdullah bin al-Arqam, Ubayy bin Ka'b, Thabit bin Qays bin Shammas, Khalid bin Sa'id bin al-Aas, Hanzala bin al-Rabi' al-Usayyidi, Zaid bin Thabit, Muawiya bin Abi Sufyan, Shurahbil bin Hasana, and others as recorded in Al-Mawahib and Seerah books, may Allah be pleased with them all. The most adherent of them to that and most specialized in it were Zaid bin Thabit and Muawiya bin Abi Sufyan.\nThen the quality of handwriting and its Jalil (large/majestic) type ended with Al-Dahhak (1) and Ishaq bin Hammad. Ibrahim al-Sijzi took the Jalil type from Ishaq, and invented from it lighter movements and better pairings, naming it the Two-Thirds Pen (Qalam al-Thuluthayn). Then he invented from this pen what is lighter than it and more fluent, naming it the Third Pen (Qalam al-Thuluth). Sheikh Imad al-Din Muhammad bin al-Afif said: By this pen and the Naskh pen, the capability of the writer in his craft is known.\nThen Yusuf took from Ishaq and invented a complete lean pen, excessively complete and open. It pleased Dhu al-Ri'asatayn al-Fadl bin Sahl, so he ordered the royal books to be written with it, and it was named the Ri'asi Pen (2).",
    "foot_note": "1. He is Al-Dahhak bin Ajlan, was in the early Abbasid Caliphate, Ibn al-Nadim 10 and Subh al-A'sha 3: 12. He was from the people of Sham. \n2. Subh al-A'sha: \"Some later scholars said: And I think it is the Tawqi'at (Signature) pen.\"",
    "book_id": "984",
    "new_page_number": 39
  },
  {
    "serial_number": "6337068",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 85,
    "volume_number": 1,
    "text": "Wajh al-Na'jah was foremost in the Jalil pen, and Abu Zarjan (1) was foremost in the Half pen. Ahmad bin Hafs (2) was the sweetest of writers in handwriting in the Thuluth pen.\nThe Vizier (3) said: The meaning of the writers' saying Half pen, Third pen, and Two-Thirds pen, goes back to the origin. That is that script has two genera from the fourteen (4) methods which are the origins, they are like two edges for it. One is the Tumar pen, which is a completely spread pen with nothing round in it, and the old Madini Mushafs were often written with it. And another pen called Ghubar al-Halbah, which is a completely round pen with nothing straight in it. All pens are taken from the straight and the round in different ratios. Whatever has straight lines equal to round lines is called the Half pen. If the straight lines in it are one third, it is called the Third pen. If the straight lines in it are two thirds, it is called the Two-Thirds pen. Upon this, these pens are composed.\nHayyun bin Amr, the brother of Al-Ahwal, excelled in it, and he was a better calligrapher than his brother.\nThen the quality of handwriting, its beauty, and its editing ended at the beginning of the three hundreds with the master in this art, the Vizier Abu Ali Muhammad bin al-Hasan bin Muqla the Scribe, his death was in the year 328. Then to his two students Muhammad bin Asad al-Ghafiqi and Muhammad al-Simsani. From them, the great master Abu al-Hasan Ali bin Hilal al-Baghdadi known as Ibn al-Bawwab took it. From him, Muhammad bin Mansur",
    "foot_note": "1. Subh al-A'sha: \"It was Muhammad bin Ma'dan, meaning known as Abu Dharjan.\" \n2. Subh al-A'sha: \"Ahmad bin Muhammad bin Hafs known as Zaqif.\" \n3. The Vizier Abu Ali Muhammad bin Muqla. He was vizier for Al-Muqtadir, then Al-Qahir Billah, then Al-Radi Billah. An alienation occurred between them in which he punished him by cutting off his left hand, then ordered \"Yahkam the Turk\" to cut off his tongue, so it was cut off too. He died in the year 328. His birth was in the year 272. \n4. Thus in the original, and in Subh al-A'sha 3: 48 \"That the Kufic script has two origins from fourteen methods.\"",
    "book_id": "984",
    "new_page_number": 40
  },
  {
    "serial_number": "6337069",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 86,
    "volume_number": 1,
    "text": "Ibn Abd al-Malik took it, and from him the Sheikhah, Scribe, and Muhaddithah Zaynab - also called Fatimah - who is the daughter of Sheikh Abu al-Faraj, known as Shuhda bint al-Abari (1). Al-Hafiz al-Dhahabi wrote her biography in his history.\nAmong those who perfected under her was Sheikh Abu al-Durr Amin al-Din Yaqut bin Abdullah al-Mawsili the Scribe, also known as al-Nuri, al-Malaki (2), and al-Sharafi. His handwriting spread in the horizons, and in his late time there was no one who approached him in beauty of handwriting nor anyone who performed Ibn al-Bawwab's method in Naskh like him, with abundant virtue. He was fond of copying Sahih al-Jawhari, so he wrote many copies of it, each one in a volume, each copy sold for one hundred dinars. I saw a copy of it in Egypt. His death was in the year 618 in Mosul.\nAs for Yaqut al-Rumi, also known as al-Hamawi, his death was in the year 626 in Aleppo at fifty-two (3) years old.\nAmong those who wrote under the mentioned Yaqut was Abu al-Hasan Ali bin Zanki known as \"al-Wali al-Ajami\". I found in the history of Al-Hafiz al-Sakhawi that al-Wali al-Ajami took from Shuhda the Scribe without the mediation of Yaqut.\nThen the quality of handwriting ended with Sheikh \"Afif al-Din Muhammad al-Halabi\", also known as al-Shirazi. His son \"Imad al-Din Muhammad\" took from him, and he was the Imam of grammarians and scribes in his time.\nAmong those who wrote under him was the Allamah Imam Shams al-Din \"Muhammad bin Ali bin Abi Raqabah (4)\".",
    "foot_note": "1. Thus vocalized in the original. In the biography of \"Shuhda\" in Wafiyat al-A'yan with Kasra on Hamza and Fatha on Ba'. \n2. Attributed to Sultan \"Malik Shah Abu al-Fath bin Saljuq\", as in Wafiyat al-A'yan. \n3. Thus in the original. \n4. In Subh al-A'sha 3: 14 \"Shams al-Din bin Abi Raqibah, the Muhtasib of Fustat, and he is among those we were contemporary with.\"",
    "book_id": "984",
    "new_page_number": 41
  },
  {
    "serial_number": "6337070",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 87,
    "volume_number": 1,
    "text": "And from him the Allamah Imam \"Abu Ali Muhammad bin Ahmad bin al-Zaftawi\" the teacher (1). He was born in the year 750 and heard Hadith from Khalil bin Tarantay (2). He authored \"Minhaj al-Isabah\" in the science of calligraphy, and the people of Egypt benefited from it. Al-Hafiz Ibn Hajar wrote under him, and that suffices as an honor. He died in the year 806. His companion in writing under his sheikhs was Imam Shihab al-Din Ghazi.\nAnd from him his student Imam Nur al-Din al-Wasimi. And under him wrote Imam Zayn al-Din Abd al-Rahman bin Yusuf al-Qahiri, known as \"Ibn al-Sa'igh\", the Sheikh of this art absolutely. He was born in Egypt in the year 769 and adhered to his mentioned sheikh in perfecting the Naskh pen until he surpassed him. He loved the method of Ibn al-Afif, so he followed it and benefited in it from Abu Ali al-Zaftawi al-Masri. Al-Zayn came to have a method extracted from the methods of Ibn al-Afif and Ghazi, as happened to Ghazi, his sheikh's sheikh. For he wrote first under Ibn Abi Raqabah, the sheikh of the mentioned al-Zaftawi and student of Ibn al-Afif, then Ghazi shifted from the method of Ibn al-Afif, his sheikh's sheikh, to a method he generated between it and the method of al-Wali al-Ajami, so he surpassed the people of his time in beauty of handwriting. People benefited from Ibn al-Sa'igh layer after layer; he copied several Mushafs and other books and creeds, and became the Sheikh of scribes in his time. Al-Hafiz Ibn Hajar testified to",
    "foot_note": "1. Al-Qalqashandi said regarding him and his student: \"He authored a summary in the Thuluth pen with rules he added to it in the craft of writing, in which he did well. Our companion Sheikh Zayn al-Din Sha'ban Ibn Muhammad bin Dawud al-Athari, the Muhtasib of Egypt, graduated through it. He composed a poem of a thousand verses (Alfiyyah) in the craft of calligraphy and named it 'Al-Inaya al-Rabbaniyyah fi al-Tariqa al-Sha'baniyyah', unequaled. Then he went after that to Mecca, then to Yemen and India, then returned to Mecca and resided there and excelled.\" Here ends the chain of calligraphers according to Al-Qalqashandi. What follows is an extension of this chain which he did not realize. \n2. Al-Durar al-Kaminah 2: 89.",
    "book_id": "984",
    "new_page_number": 42
  },
  {
    "serial_number": "6337071",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 88,
    "volume_number": 1,
    "text": "his skill, and praised him in his history. He heard Hadith from al-Jamal al-Halawi. His death was in the year 845.\nThen the quality and beauty of handwriting ended after Ibn al-Sa'igh and his layer with the Qibla of scribes, and the Sheikh of this pleasant art, to whose majesty pens prostrated, and on whose preference the elite and general public agreed, the unique Imam, and the singular magnanimous one, our master the Sheikh of Sheikhs, Sheikh Hamdullah son of Sheikh Mustafa al-Amasi (1), known as \"Ibn al-Sheikh\", may Allah cover him with His mercy. He was born approximately in the year 847, two or three years after the death of Ibn al-Sa'igh. He is the one who devised these Samuts (styles/methods) (2) known in our time from the scripts of the predecessors as happened to others before him who invented the method between two methods, until he excelled the scribes of his time, and surpassed the people of his era and age.\nHis father was a righteous man authorized in the path of the Suhrawardi Sheikhs. His gaze fell upon his mentioned son until he surpassed in high ranks. It suffices him as pride that there is no Sanad (chain) on earth now relied upon except from his path, nor a method desired among the people of the art except from his verification and scrutiny.\nAmong his contemporaries were two men from the great scribes of their time, namely \"Yahya al-Rumi\" and \"Ali bin Yahya\". The latter's death was in the year 866.\nIt is said that the Sheikh wrote under \"Khair al-Din al-Mar'ashi\", who died in the year 896. And he under \"Abdullah al-Sayrafi\", and he under \"Ahmad bin Ali\" known as Tayyib Shah al-Suhrawardi, and he under \"Muhammad al-Badashi al-Ajami\", and he under \"al-Wali al-Ajami\".\nIt is said that the Sheikh, may Allah Almighty have mercy on him, wrote with his noble hand forty-four Mushafs and a copy of the book Al-Masabih by al-Baghawi, and the book Al-Mashariq by al-Saghani, both in Gazelle",
    "foot_note": "1. Attributed to \"Amasya\" from the province of Sivas in Turkey. \n2. Plural of Samt, which is the method.",
    "book_id": "984",
    "new_page_number": 43
  },
  {
    "serial_number": "6337072",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 89,
    "volume_number": 1,
    "text": "skin, and about a thousand copies each of Surat Al-An'am, Al-Kahf, supplications, and litanies, and a number of scrolls and rolls. While he was in his eighty-eighth year, an incident of trembling occurred in his head. As for his hand at the time of writing, it never trembled, such that his handwriting at the end of his life matched his handwriting in his youth. Kings served him and held the inkwell for him in his hands, and he was given acceptance and fame such as no one before him nor after him was given. His karamat (miracles) are famous. He died approximately in the year 957 at one hundred and ten years old. He was buried in Uskudar in a platform opposite the Takiyya known as Karaca Ahmad, during the time of Sultan Abu al-Fath Suleiman Khan son of Selim Khan, may Allah Almighty have mercy on him (1).\nThen the quality and beauty of handwriting ended with his students. They are \"Muhyi al-Din Jalal Zadeh\" who lived a hundred years and wrote ninety-seven Mushafs, and \"Jamal al-Din al-Amasi\" and his brother \"Abdullah\", each of whom lived eighty years. However, the rules of these three lean more towards the rules of Yaqut al-Musta'simi.\nAmong the special students of the Sheikh, may Allah have mercy on him, was \"Husam al-Din Khalifa\". He was skilled in the six scripts and plain Naskh. He imitated his sheikh's method until many discriminators and identifiers erred in distinguishing between their handwritings. He lived sixty-seven years and wrote eighty-nine Mushafs.\nAmong them was \"Shukrullah Khalifa\", who was skilled in the six scripts and plain Naskh and wrote several Mushafs and litanies.",
    "foot_note": "1. The author wrote in his handwriting on the margin of the copy the following text: \"Accession of Sultan Muhammad Khan Ghazi in the year 855, the Sheikh was then nine years old. Accession of Sultan Bayezid Veli in the year 886, the Sheikh was then forty years old. Accession of Sultan Selim Ghazi in the year 918, the Sheikh was then seventy-two years old. Accession of Sultan Suleiman bin Selim in the year 926 and his death in 22 .. year 974.\"",
    "book_id": "984",
    "new_page_number": 44
  },
  {
    "serial_number": "6337073",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 90,
    "volume_number": 1,
    "text": "Among them was \"Rajab Khalifa\", who was skilled in the six scripts and plain Naskh, and wrote ninety-three Mushafs and a number of Surat Al-An'am and litanies.\nIn the late era of the Sheikh, there was a man among those skilled in calligraphy named \"Ahmad Effendi Karahisari\". It is said that the Sheikh granted him Ijazah in writing, but in his later years he leaned towards Yaqut's method and combined both methods. He wrote a number of Mushafs and litanies. He died in the year 963.\nAmong his special students was \"Hussein Chelebi Khalifa\", who revived his sheikh's method and wrote several Mushafs.\nThen came after him \"Deli Yusuf Effendi\" who excelled, because he combined his sheikh's method and the Hamdi method, so he became extremely accepted, and wrote several Mushafs in this method.\nThen came after him \"Kara Ali Effendi\", then after him \"Tekneci Hasan Chelebi\", and no one became famous after him in this chain.\nAmong the distinguished in the era of these was the Sheikh's own son, the skilled, precise Imam \"Mustafa Dede\", known like his father as Ibn al-Sheikh. His father named him with his father's name for blessing. He had excelled during his father's life in good handwriting, and the virtuous testified for him. His father granted him Ijazah in writing, and he was skilled in the six scripts like his father. He wrote several Mushafs, litanies, and supplications. He died at forty years old and was buried next to his father in Uskudar.\nAmong those in his era from the senior students of his father was the skilled Imam Mahmoud Effendi famous as \"Topçulu\". He was famous for good imitation of the Sheikh, wrote several Noble Mushafs, Al-An'am, and Adhkar.\nIn his era were \"Abd al-Karim Khalifa\" known as Wiqayah Zadeh, and \"Shukr Allah",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 45
  },
  {
    "serial_number": "6337074",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 91,
    "volume_number": 1,
    "text": "Khalifa\" and \"Ahmad Chelebi\".\nAmong those famous in their time was \"Abdullah Effendi al-Qirimi\". He wrote in the Sheikh's method by stealing from his scripts, because it is said: He requested teaching and Ijazah from the Sheikh but he did not agree. He strove until he became proficient in the art, wrote several Mushafs, and extracted for himself a method derived between the Sheikh's method and Ahmad Tayyib Shah's method, inventing from them a type of Thuluth. But his status fell between the writers and Bahais, and he became of those wavering between that, neither to these nor to those.\nAmong those who revived his method after him was a man named \"Amrullah Effendi\". He imitated him in his derived method with much leaning towards the Hamdi method, due to the precision of his nature and subtlety of his thought, so praise and acceptance of him was good. He wrote with that several Mushafs, Al-An'am, and Adhkar.\nThen the quality of handwriting ended after these with the skilled Imam \"Pir Effendi\", who is the Sheikh's grandson. His father Dervish Muhammad granted him Ijazah in writing. He revived the method of his ancestors, while adhering to its limits, and wrote several Mushafs and Al-An'am.\nAmong those who wrote under him was his contemporary the skilled Imam \"Hassan Effendi\" known as \"Uskudari Hasan Chelebi\". He assumed the Sheikhdom of the Serai after his sheikh, and wrote several Mushafs, Al-An'am, and Adhkar.\nFrom him the precise, perfecting Imam \"Khalid Effendi\" known as Al-Aziz took. His sheikh Al-Uskudari granted him Ijazah in writing, and he wrote several Mushafs, Adhkar, and Surat Al-An'am.\nIn his era among the skilled was \"Kara Hussein Effendi\". He assumed the Sheikhdom of the Agha's office, and wrote several Mushafs and Adhkar. He was described with excessive beauty, and some of his students testified to his karamah (miracle).",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 46
  },
  {
    "serial_number": "6337075",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 92,
    "volume_number": 1,
    "text": "Then the quality of handwriting ended with the skilled, precise Imam, the late \"Dervish Ali Effendi\" nicknamed the Second Sheikh. He wrote first under the mentioned Kara Hussein Effendi, and after his death obtained completion and Ijazah at the hands of Khalid Al-Aziz. He wrote eighty-eight Mushafs and a number of Surat Al-An'am, litanies, and Adhkar. His handwriting is the reliance in this time of ours. He died in the year 1086 at eighty-seven years old. Among his karamat is that he raised his index finger after his death when the washer said the Shahadah, and he was washed with water boiled with the shavings of his pens (1).\nAmong his contemporary calligraphers was Ramadan bin Ismail. It is said he wrote three hundred and sixty Mushafs, and a number of Surat Al-An'am and Adhkar. His death was in the year 1097.\nAlso among the contemporaries were Ali Effendi Nefeszadeh, Omar Bey Nasuhpashazadeh, Muhammad Effendi the Imam, Ali Effendi Kasikcizade, Ahmad Effendi Kazkazbanzadeh, Muhammad Effendi Nakkashzadeh, Khalil Effendi nicknamed Al-Hafiz, Muhammad Effendi Arabzadeh who died in 1122, and Muhammad Effendi Khawajahzadeh. It is said that Dervish Ali granted Ijazah to these last two.\nAmong them Ismail Effendi Turk, who died drowned in the sea in the year 1085. And Yusuf Effendi who died in the year 1119. These two were in Egypt.\nThen the quality of handwriting ended with (the students of Dervish Ali), among them Mustafa Effendi al-Ayyubi known as Suyolcuzade, his death was in the year 1099.",
    "foot_note": "1. Similar to what was narrated in the news of Abu al-Faraj Ibn al-Jawzi, that the shavings of his pens with which he wrote the Hadith of the Messenger of Allah, peace be upon him, were collected and amounted to a lot. He bequeathed that the water used to wash him after his death be heated with them. That was done, and it sufficed and some remained. See his biography in Wafiyat al-A'yan (1: 279).",
    "book_id": "984",
    "new_page_number": 47
  },
  {
    "serial_number": "6337076",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 93,
    "volume_number": 1,
    "text": "Among them was Ismail Effendi Khalifa known as Ibn Ali. He wrote forty-four Mushafs, and completed his sheikh's eighty-eighth Mushaf, which was the last of the Mushafs he died leaving at Surat Al-An'am, so he completed it in his handwriting.\nAmong them was Ahmad Effendi Kazancizade, who was famous for good imitation of the Sheikh's handwriting. He wrote nineteen Mushafs and a number of Surat Al-An'am and Adhkar. He died in the year 1116.\nAmong them was the skilled, precise Imam Uthman Effendi known as Al-Hafiz, nicknamed the Third Sheikh. He wrote a number of Mushafs, Al-An'am, litanies, and Adhkar. He died in the year 1112.\nAmong them was Ahmad Effendi known as Sheikhzadeh. He wrote seventeen Mushafs and a number of Surat Al-An'am, Adhkar, and Dalail al-Khayrat.\nAmong them was Fadlullah Effendi, his death was in the year 1107. He wrote several Mushafs, litanies, and Adhkar.\nAmong them was Anbar Mustafa Agha, who had an extremely solid hand. He wrote several Mushafs and Al-An'am. He died in the year 1117.\nAmong them was the skilled Imam Omar Effendi, scribe of the Serai.\nAmong them was Jabizadeh Muhammad Effendi, and both are among his successors.\nAmong (the contemporaries of this layer) were Kucuk Dervish Ali Effendi, Kucuk Arabzadeh Muhammad Effendi, Ahmad Effendi Al-Dervish, Abdullah Effendi Al-Wafa'i, Ibrahim Effendi Ibn Ramadan, and Ali Effendi Imam of Amir Akhur.",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 48
  },
  {
    "serial_number": "6337077",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 94,
    "volume_number": 1,
    "text": "Among the special successors of Dervish Ali was the skilled, perfecting, precise Imam, renewer of the Hamdi traditions in the Egyptian lands, his freed slave and manumitted one, Hussein Effendi al-Jaza'iri. He adhered to serving his teacher until he excelled and surpassed. He wrote a Noble Rab'ah in thirty parts, and two Noble Mushafs, one in Sham and the second in Egypt. He started the third and reached half of it and died, so the late Hassan al-Dhiya'i completed it later.\nAmong those who wrote under Fadlullah Effendi was Muhammad Effendi al-Shahri known as al-Bustanji.\nAmong those who wrote under Omar Effendi scribe of the Serai was Salih Effendi, known as Hamamcizade.\nWhoever wrote under Ahmad Effendi Sheikhzadeh was his skilled, precise son Ibrahim Effendi Sheikhzadeh.\nThen the quality of handwriting ended with (the students of al-Jaza'iri), among them the skilled, precise, perfecting Imam Suleiman Effendi nicknamed al-Shakiri.\nAmong them the skilled, precise, perfecting Imam Sayyid Muhammad bin Ibrahim al-Maqdisi nicknamed al-Nuri.\nAmong them Mustafa Effendi Khalifa, Qasim Effendi, and others.\nAl-Shakiri had also perfected in the beginning of his affair under Muhammad Khawajahzadeh, Muhammad al-Shahri al-Bustanji, and Hafiz Uthman. Al-Bustanji wrote under Fadlullah Effendi, and Hafiz Uthman, both under Dervish Ali.\nSo who wrote under Al-Shakiri was the precise, long-lived Imam Hassan bin Hassan known",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 49
  },
  {
    "serial_number": "6337078",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 95,
    "volume_number": 1,
    "text": "as al-Dhiya'i. He was born in the year 1098. He wrote in the beginning of his affair under his father, then under his sheikh Sayyid Ali, and under Salih Effendi known as Hamamcizade. He also caught up with al-Jaza'iri twelve (1) years after his father's death, and wrote under him without intermediary. Al-Shakiri granted him Ijazah in writing, and Hamamcizade, the latter from Omar Effendi scribe of the Serai from Dervish Ali. He, may Allah have mercy on him, was very precise, severely cautious, following the path of the righteous Salaf in investigation and accuracy in all that he wrote, as is witnessed in his scripts. He died in the year 1182 at eighty-four years old.\nAmong those who wrote under Al-Shakiri was the virtuous, skilled, precise, perfecting teacher Sheikh Shihab al-Din Ahmad al-Afqam, kunya Abu al-Irshad. He excelled in the art and strove until he attained fame and acceptance. He wrote several copies of Dalail, litanies, Adhkar, and others.\nAmong his existing students now are our master Sayyid Ibrahim al-Ruwaydi al-Husseini, kunya Abu al-Fath al-Hamami al-Wafa'i, and Sheikh Ahmad kunya Abu al-Izz. May Allah bless their lifespan and benefit Muslims through them.\nAmong those who wrote under Sayyid Muhammad al-Nuri, may Allah Almighty have mercy on him, were many people of various classes. He granted Ijazah in writing to countless people. Among his most famous students was the skilled, precise Imam, the late Abdullah Effendi al-Mawlawi, nicknamed al-Anis, may Allah Almighty have mercy on him. He perfected first under Al-Shakiri and others, and his completion and Ijazah were at the hand of Sayyid Muhammad al-Nuri.\nAmong them the honored gentleman Prince Ismail Effendi nicknamed al-Wahbi, and the gentleman",
    "foot_note": "1. Thus in the original. The correct form is \"Bi-ithnatai 'Ashrah\".",
    "book_id": "984",
    "new_page_number": 50
  },
  {
    "serial_number": "6337079",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 96,
    "volume_number": 1,
    "text": "the honored Prince Ahmad Effendi nicknamed al-Shukri. May Allah bless their lifespan and benefit Muslims through them.\nAmong those who wrote under Al-Anis is the one whose noble name I embroidered this summary with, the precise, the honored gentleman, and the majestic refuge, Prince Hassan Effendi, follower of the late Hajj Ali Agha, agent of Dar al-Sa'ada, nicknamed al-Rushdi. May Allah guide him to every good, bless his lifespan and life, and ward off all harm from him. He is the one who revived this method, renewed its traditions in reality, tongues praised him from every side, was given acceptance and love, and attained the highest ranks. May Allah Almighty guard him with the eye of His care, and protect his virtue from the eye of the envier and his spite.",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 51
  },
  {
    "serial_number": "6337080",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 97,
    "volume_number": 1,
    "text": "Conclusion\nWe ask Allah for a good ending. It has two sections:\nFirst: In explaining the etiquette of the student with the Sheikh\nKnow that the seeker of this art and the one desiring it must have a Sheikh who shows him the subtleties of the art, verifies its realities for him, reveals its symbols to him, opens its puzzles for him, and brings its intricacies closer to him. It has been reported in some traditions, from some of the righteous: \"Were it not for the educator, I would not have known my Lord.\"\nIf Allah facilitates a teacher for him, he has conditions with him. Among them is preserving his status in absence and presence as much as possible. He should not raise his voice over his voice, nor say to him about anything he said: Why this? If something confuses him, he asks for its clarification with politeness.\nAmong them is not conversing with anyone beside him in his presence except for a necessary matter.\nAmong them is not to laugh in the presence of his teacher except smiling for a reason.\nAmong them is not anticipating his speech, but remaining silent until he finishes what he is saying.\nAmong them is sitting in his presence like the posture of Tashahhud, stealing glances at his teacher's face.\nAmong them is not quarreling with any of his teacher's followers and those attributed to him.\nAmong them is preserving his belongings from boldness against them; he should not wear his clothes or shoes, ride his mount, sit on his prayer rug, or drink from the vessel prepared for him unless he permits him in any of that.\nAmong them is to persist in practice and diligence in what the teacher tells him and commands him.\nThese are the etiquettes of the student with the teacher. Whoever is afflicted with the disruption of any of them out of negligence or heedlessness will never succeed.\nSecond: Advice for all calligraphers\nAllah Almighty said in His Aziz Book: \"And the life of this world is only the enjoyment of deception.\"\nThe knowers of this art mentioned that one of the greatest causes of completion for the student in this",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 52
  },
  {
    "serial_number": "6337081",
    "category_id": "29",
    "category": "Language Books",
    "book_title": "The Wisdom of Illumination in the Writers of Horizons",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 98,
    "volume_number": 1,
    "text": "art is abandoning conceit in himself, and abandoning arrogance over the sons of his gender. For he might strive in writing much, then Satan comes to him and whispers conceit to him, and drops him into evils. Whenever he is safe from this, acceptance and ascending to the ranks of arrival are hoped for him. Whenever he is negligent in the matter of his self, and arrogant over the sons of his gender, he is punished with deprivation and whispers, and falls from his rank that he was in with Allah and with people.\nWe ask Allah for pardon and satisfaction, and overlooking what has passed. Indeed, He is over all things competent, and worthy of every bounty. Allah is sufficient for us, and [He is] the best Disposer of affairs. There is no power and no strength except in Allah, the Most High, the Great.\nMay Allah bless our master and lord Muhammad and his family and companions and grant them peace abundantly until the Day of Judgment.\nThese letters were dictated in haste and varieties of occupation, by the negligent servant confessing his sin, the poor Muhammad Murtada al-Husseini, may Allah pardon him by His grace and generosity. That was in sessions, the last of which was the 12th of the sacred month of Dhu al-Hijjah, the conclusion of the year 1184. It ended well and upon good.\nAmen Amen Amen",
    "foot_note": "None",
    "book_id": "984",
    "new_page_number": 53
  }
]