[
  {
    "text": "Regulations of Takfir in the Light of the Prophetic Sunnah\nAuthor: نوال بنت عبد العزيز العيد\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 1
  },
  {
    "text": "sn: 549\nbook_title: ضوابط التكفير في ضوء السنة النبوية\nbook_link: https://shamela.ws/book/1064\nbook_id: 1064\nauthor_name: نوال بنت عبد العزيز العيد\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/195\nauthor_ID: 195\neditor: Null\npublisher: دار الحضارة للنشر والتوزيع\nedition: الأولى، 1434 هـ - 2013 م\npages: 72\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: العقيدة\ncategory_id: 1",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 2
  },
  {
    "serial_number": "96040",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Creed (Aqeedah)\nBook: Regulations of Takfir in the Light of the Prophetic Sunnah\nAuthor: Nawal bint Abdul Aziz Al-Eid",
    "foot_note": "None",
    "book_id": "1064",
    "new_page_number": 3
  },
  {
    "serial_number": "96041",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 5,
    "volume_number": 1,
    "text": "Introduction\nPraise be to Allah, Lord of the Worlds, and peace and blessings be upon the most noble of Prophets and Messengers. To proceed:\nWhoever contemplates many of the issues witnessed in our Islamic arena—whether on the creedal, legislative, intellectual, psychological, or social level—realizes the Muslim's dire need for a legal (Shar'i) grounding for their stance on these issues in the light of the Quran and the authentic Sunnah. Among the issues that have emerged on the Islamic scene is the issue of (Takfir - excommunication/declaring someone a disbeliever). There has been much discussion about it, both in the past and present. It is a place where understanding goes astray and feet slip, potentially leading to conflict, schism, and the legitimization of the forbidden in the name of religion.\nPeople have divided into two extremes and a middle path regarding it; a party believes that Takfir requires declaring the act lawful (Istihlal) or denial (Juhud), so whoever commits any sin, as long as they do not declare it lawful, does not become a disbeliever, even if this sin is explicitly stated as Kufr (disbelief). They may judge acts of Kufr as not being disbelief, classifying them merely as sins less than Kufr. Opposing them in extremism is another group that declares Takfir based on doubts and hunts for...",
    "foot_note": "None",
    "book_id": "1064",
    "new_page_number": 4
  },
  {
    "serial_number": "96042",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 6,
    "volume_number": 1,
    "text": "...slips and stumbles. One of them appoints himself, without legally recognized qualification, as a judge ruling on whomever he wishes with whatever he wishes. He declares Takfir and expels whomever he wants from the fold of Islam, indifferent to the danger of this matter upon himself, the society, and the unity of the Islamic rank. The truth is a middle path between these and those, like the moderation of the Ahlus Sunnah wal-Jama'ah (People of the Sunnah and the Community) amidst the sects leaning right or left from the Path. Therefore, the Predecessors (Salaf) did not leave (the Takfir of Muslims), despite its danger, as a sanctuary open for anyone to violate. Rather, they studied it, grounded it, and regulated it. This research (Regulations of Takfir in the Light of the Prophetic Sunnah) comes as a contribution to addressing this issue with a foundational approach through the Hadith of the Messenger of Allah (peace be upon him), in addition to the following:\n1. The trial (Fitnah) of Takfir that has torn the body of the Islamic nation is the first innovation and trial to appear in Islam. It is the source of many creedal, behavioral, moral, and psychological deviations that the Muslim nation has suffered from over fourteen centuries. Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, says: \"The first innovation to appear in Islam, and the one most clearly condemned in the Sunnah and Athar (narrations), is the innovation of the renegade Haruriyyah (Kharijites). The first of them said to the Prophet (peace be upon him) to his face: 'Be just, O Muhammad!...",
    "foot_note": "None",
    "book_id": "1064",
    "new_page_number": 5
  },
  {
    "serial_number": "96043",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 7,
    "volume_number": 1,
    "text": "...for you have not been just' (1). The Prophet (peace be upon him) ordered that they be killed and fought, and the Companions of the Prophet (peace be upon him) fought them alongside the Commander of the Faithful, Ali bin Abi Talib. The Hadiths from the Prophet (peace be upon him) are abundant in describing and condemning them\" (2).\n2. The danger of Takfir, whether for the one who issues this judgment without legally recognized qualification, or for the society when sanctities are violated and blood is shed in the name of religion.\n3. The legal grounding (Ta'sil) of the issue of Takfir and purifying it from the extremism of the Kharijites and the negligence of the Murji'ah.\n4. Regulating Takfir with the legal regulations that came in the Book of Allah and the authentic Sunnah of the Messenger of Allah (peace be upon him).\n5. The infiltration of this Fitnah into our society, with its various categories and segments, makes it imperative for us to contribute to immunizing the society against it through legal grounding and correct understanding of the issue of Takfir.\n6. Limiting the regulations of Takfir through an inductive reading of the texts of the Book...",
    "foot_note": "1. Recorded with this wording by Ibn Majah (1/61) and authenticated by Al-Albani in Sahih Sunan Ibn Majah (1/244). Recorded by Al-Bukhari, Book of Repentance of Apostates/Chapter: Leaving the fighting of Kharijites for reconciliation (6/2450) 6534, and Muslim, Book of Zakat (3/93) 2496.\n2. Al-Fatawa (19/71).",
    "book_id": "1064",
    "new_page_number": 6
  },
  {
    "serial_number": "96044",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 8,
    "volume_number": 1,
    "text": "...and the Sunnah constitutes an intellectual immunity for society against the trial of Takfir.\n7. Serving the topics of Creed through Hadith studies.\nI have divided the research into a preamble, two chapters (Mab'hath), and a conclusion.\nPreamble: Includes the definition of Kufr linguistically and technically, and an indication of the danger of Takfir.\nChapter One: General Regulations in Takfir in the Light of the Prophetic Sunnah:\n1. Takfir is a legal ruling and a right belonging to the Lord of the Worlds.\n2. The competence/qualification of the one pronouncing Takfir.\n3. Judging by the apparent.\n4. Differentiating between Absolute Takfir and Specific Takfir (Takfir al-Mu'ayyan).\nChapter Two: Regulations of Specific Takfir in the Light of the Prophetic Sunnah (Conditions and Impediments).\n1. Knowledge is a condition, and its impediment is ignorance.\n2. Intent is a condition, and its impediment is mistake/error.\n3. Will is a condition, and its impediment is compulsion.\n4. Lack of interpretation (Ta'wil) is a condition, and its impediment is interpretation.",
    "foot_note": "None",
    "book_id": "1064",
    "new_page_number": 7
  },
  {
    "serial_number": "96045",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 9,
    "volume_number": 1,
    "text": "Preamble\nKufr in the language of the Arabs means covering and concealing. Farmers were called 'Kuffar' because they cover the seeds with soil. From this is His saying: {Like the example of a rain whose [resulting] plant growth pleases the tillers (kuffar)} [Al-Hadid: 20]. The disbeliever (Kafir) was named Kafir because disbelief covered his entire heart, or because he concealed the blessings of Allah upon him. Kufr also comes with the meaning of denial (Juhud). It is said: 'So-and-so 'kafara' me my right,' if he denied it. A 'Kafir' man is one who denies the blessings of Allah. From this is His saying: {And they said, \"Indeed we, in all that, are disbelievers\"} [Al-Qasas: 48], meaning: deniers.\nAs for Kufr in terminology, it is the opposite of faith (Iman) in Allah. It is of two types:\nMajor Kufr (Kufr Akbar) which expels one from the Religion (Millah): This is every disbelief that removes its doer from the circle of Iman, and the legal texts have decreed that its doer is eternally abiding in the Fire. This is the intended subject of the research. It has six types: Denial (Takdhib), Rejection (Juhud), Obstinacy (Inad), Turning Away (I'rad), Hypocrisy (Nifaq), and Doubt (Shakk).\nMinor Kufr (Kufr Asghar) which does not expel one from the Religion: This is everything to which the Lawgiver applied the word 'Kufr', while evidence stands that Major Kufr expelling from the Religion was not intended, but rather the Lawgiver intended threat and deterrence.\nTakfir is charging a Muslim who has testified that there is no god but Allah and that Muhammad is...",
    "foot_note": "None",
    "book_id": "1064",
    "new_page_number": 8
  },
  {
    "serial_number": "96046",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 10,
    "volume_number": 1,
    "text": "...the Messenger of Allah with disbelief in Allah and His Messenger, expelling him from the light of faith and guidance to the darkness of disbelief and ignorance, and from the path of Allah to the paths of Satan. It involves expelling him from the community of Muslims, the negation of his guardianship over his offspring, the prohibition of his wife to him, the forfeiture of his inheritance, the impermissibility of his slaughtered meat, the impermissibility of washing him and praying over him if he dies, that he is not buried in Muslim cemeteries, the impermissibility of seeking forgiveness for him, and other such rulings with which books of jurisprudence and creed are filled. Therefore, Islam has taken a strict stance regarding it, warning against the consequences of unleashing it and the danger of leniency with those who take charge of it. Sheikh al-Islam says: \"It is not permissible to declare a Muslim a disbeliever for a sin he committed or for an error he made, such as the issues in which the People of the Qibla (Muslims) disputed. For Allah the Almighty said: {The Messenger has believed in what was revealed to him from his Lord, and [so have] the believers. All of them have believed in Allah and His angels and His books and His messengers, [saying], \"We make no distinction between any of His messengers.\" And they said, \"We hear and we obey. [We seek] Your forgiveness, our Lord, and to You is the [final] destination.\"} [Al-Baqarah: 285]. It is established in the Sahih that Allah the Almighty answered this supplication and forgave the believers their error (1). The renegade Kharijites whom the Prophet (peace be upon him) ordered to be fought were fought by the Commander of the Faithful Ali bin Abi Talib, one of the Rightly Guided Caliphs. The Imams of the religion from the Companions, the Successors, and those after them agreed on fighting them. Yet, Ali bin...",
    "foot_note": "1. Recorded by Muslim, Book of Faith (1/80, 81) 344, 345.",
    "book_id": "1064",
    "new_page_number": 9
  },
  {
    "serial_number": "96047",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 11,
    "volume_number": 1,
    "text": "...Abi Talib, Sa'd bin Abi Waqqas, and others from the Companions did not declare them disbelievers; rather, they considered them Muslims despite fighting them. Ali did not fight them until they shed sacred blood and raided the wealth of Muslims; so he fought them to repel their injustice and aggression, not because they were disbelievers. For this reason, he did not take their women as captives nor did he take their wealth as spoils of war. If these people, whose deviation is established by text and consensus, were not declared disbelievers despite Allah and His Messenger ordering that they be fought, then what about the differing sects to whom the truth was confused in issues where those more knowledgeable than them have erred?\" (1).\nTalk about Takfir has increased, and rushing into it and boldness regarding it have been observed, even though delving into it is a slippery slope. Especially as we see some young people—whose increase in knowledge is merely 'it was said' and 'he said', and upon whom no trace of knowledge or adherence to Sunnah appears—delving into such issues that if they were presented to Umar, he would have gathered the people of Badr for them! (2). This research comes to address the regulations of Takfir in the light of the Prophetic Sunnah—upon its owner be the best prayers and most complete peace—clarifying that one should not delve into Takfir before the believer understands its principles and verifies its conditions and impediments; otherwise, he leads himself to destruction and incurs wrath from Allah.",
    "foot_note": "1. Majmoo' al-Fatawa (3/282).\n2. 'So that you do not bear its burden', Sheikh Al-Suhaim, adapted.",
    "book_id": "1064",
    "new_page_number": 10
  },
  {
    "serial_number": "96048",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 12,
    "volume_number": 1,
    "text": "Chapter One\nGeneral Regulations in Takfir in the Light of the Prophetic Sunnah\n\nFirst Regulation\nTakfir is a legal ruling, and a right belonging to Allah, the Lord of the Worlds.\n(Takfir is a legal ruling and a pure right of the Lord, Glory be to Him. No entity or group possesses it. Personal taste or reason has no consideration in it, nor does overwhelming enthusiasm or apparent enmity play a part. The injustice of an oppressor who persists in his injustice and deviation does not justify it. Rather, no one is declared a disbeliever except the one whom Allah and His Messenger have declared a disbeliever) (1).\nSheikh al-Islam says: \"This is contrary to what some people used to say, such as Abu Ishaq al-Isfarayini and those who followed him, who say: 'We do not declare as disbelievers except those who declare us disbelievers.' For Takfir is not their right; rather, it is the right of Allah. A human does not have the right to lie about someone who lies about him, nor to commit immorality with the family of someone who committed immorality with his family. Indeed, if a man forced him into sodomy, he would not have the right to force him into that...",
    "foot_note": "1. Takfir in the Light of the Prophetic Sunnah by Basim Al-Jawabrah (58).",
    "book_id": "1064",
    "new_page_number": 11
  },
  {
    "serial_number": "96049",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 13,
    "volume_number": 1,
    "text": "...and if he killed him by forcing him to drink wine or sodomized him, it would not be permissible to kill him by such means, because this is forbidden as a right of Allah the Almighty. If the Christians cursed our Prophet, we would not have the right to curse the Messiah. And if the Rafidah (Shiites) declare Abu Bakr and Umar disbelievers, we do not have the right to declare Ali a disbeliever.\" (1)\n\nSecond Regulation\nThe Qualification of the One Pronouncing Takfir\nTakfir is a legal ruling and a major issue that should not be undertaken except by great Imams and people of knowledge whom Allah ordered to be asked and to whom matters should be referred, when He said: {So ask the people of the message if you do not know} [Al-Nahl: 43]. This regulation will address the one qualified to issue a judgment of Takfir.\n\nA. Definition of Qualification (Ahliyyah):\nIt is said: 'Ahl' for such: meaning deserving of it; singular and plural are the same in this. And it is said: He is 'Ahl' for that, and 'Ahl' to that. And it is said: He made him 'Ahlan' (qualified) for that matter, qualifying him (Ta'hilan). And he considered him qualified (Ahhalahu): saw him as worthy of it. And 'Ista'halahu': he deserved it (2).\n\nB. Conditions of the One Pronouncing Takfir:\nThe one pronouncing Takfir must be a scholar (Alim) and a Mujtahid, because Takfir relies on legal proofs, either Quranic of known establishment, or Hadith-based...",
    "foot_note": "1. Minhaj al-Sunnah al-Nabawiyyah (5/244).\n2. Lisan al-Arab: Entry (Ahl).",
    "book_id": "1064",
    "new_page_number": 12
  },
  {
    "serial_number": "96050",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 14,
    "volume_number": 1,
    "text": "...which one cannot be certain of their establishment, nor possess the tools to understand them soundly, except the scholars. As for the common people, it is obligatory for them to refer to scholars in these matters and other issues of creed and rulings. The Almighty says: {And We sent not before you except men to whom We revealed [Our message]. So ask the people of the message if you do not know} [Al-Nahl: 43]. And the Messenger of Allah (peace be upon him) says: \"...Indeed, the Quran was not revealed for one part to belie another, but rather for one part to verify another. So what you know of it, act upon it, and what you are ignorant of, refer it to its scholar\" (1).\nThe people of desires, since ancient times, pursue a suspicious path in attacking scholars, dropping their prestige from souls so that they are not referred to, just as they previously dropped the prestige of the rulers. Ibn al-Mubarak said: \"Whoever belittles the scholars, his Hereafter is gone. Whoever belittles the rulers, his worldly life is gone. And whoever belittles the brothers, his chivalry (Muru'ah) is gone\" (2).",
    "foot_note": "1. Recorded by Ahmad in his Musnad (11/304). Shu'ayb al-Arna'ut said: Sahih. And Al-Tabarani in Al-Awsat (1/165).\n2. Narrated by Ibn al-Mubarak in Al-Zuhd, number (61), and Abu Amr Al-Dani in Al-Fitan (2/62), and mentioned by Al-Albani in Al-Silsilah Al-Sahihah, number (695). See: Takfir in the Light of the Sunnah by Basim Al-Jawabrah (92).",
    "book_id": "1064",
    "new_page_number": 13
  },
  {
    "serial_number": "96051",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 15,
    "volume_number": 1,
    "text": "C. Texts regarding the qualification of the one pronouncing Takfir:\n1. Allah ordered asking the People of Remembrance (Ahl al-Dhikr): {And We sent not before you except men to whom We revealed [Our message]. So ask the people of the message if you do not know} [Al-Nahl: 43]. Sheikh Al-Sa'di said: (Although the cause of this verse is specific to asking about the state of previous messengers to the People of Remembrance—who are the People of Knowledge—it is general for every issue of religion, its fundamentals and branches, if a person does not have knowledge of it, that he asks someone who teaches him) (1).\n2. {O you who have believed, obey Allah and obey the Messenger and those in authority among you} [An-Nisa: 59]. Sheikh Al-Sa'di said: \"He ordered obedience to 'those in authority', who are: those in charge of people, including rulers, judges, and muftis. For people's religious and worldly affairs cannot be set right except by obeying them and submitting to them, in obedience to Allah and desiring what is with Him, but on the condition that they do not order disobedience to Allah. If they order that, there is no obedience to a created being in disobedience to the Creator. Perhaps this is the secret behind omitting the verb when ordering obedience to them while mentioning it with obedience to the Messenger, for the Messenger does not order anything except obedience to Allah, and whoever obeys him has obeyed Allah. As for those in authority, the condition for the command to obey them is that it is not a sin.\" (2)",
    "foot_note": "1. Tafsir Al-Sa'di (p. 322).\n2. Tafsir Al-Sa'di (p. 183).",
    "book_id": "1064",
    "new_page_number": 14
  },
  {
    "serial_number": "96052",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 16,
    "volume_number": 1,
    "text": "3. {And when there comes to them information about [public] security or fear, they spread it around. But if they had referred it back to the Messenger or to those of authority among them...} [An-Nisa: 83]. Sheikh Al-Sa'di said: \"This is a discipline from Allah to His servants regarding this improper action of theirs. It implies that when an important matter or public interest concerning security and the joy of believers, or concerning fear wherein lies calamity for them, comes to them, they should verify and not rush to spread that news. Rather, they should refer it to the Messenger and to those of authority among them—people of opinion, knowledge, advice, intellect, and composure, who know affairs and know benefits and their opposites.\" (1)\n4. Imam Muslim narrated from Jundub that the Messenger of Allah (peace be upon him) told that a man said: \"By Allah, Allah will not forgive so-and-so.\" And Allah the Almighty said: \"Who is he who swears by Me that I will not forgive so-and-so? For I have forgiven so-and-so, and I have nullified your deeds.\" (2)\nPerhaps we all find what that man said grievous and ask ourselves: Who can say what that man said? Who can restrict what is vast? Or judge a Muslim to eternal Hellfire? I say: Whoever carries the broad banner of Takfir can say that, indeed...",
    "foot_note": "1. Tafsir Al-Sa'di (p. 190).\n2. (p. 1053) 2621 Book of Birr, Silah, and Adab.",
    "book_id": "1064",
    "new_page_number": 15
  },
  {
    "serial_number": "96053",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 17,
    "volume_number": 1,
    "text": "...must say that? Anyone who dares to pronounce Takfir or is lenient in its matter falls into that inevitably: How is that? If he judges a specific person as a Kafir, he has judged that Allah will not forgive him, and he has said by his state, if not by his tongue: By Allah, Allah will not forgive so-and-so. This is a matter of utmost danger!! (1)\n\nD. Categories of those who pronounce Takfir:\n\nFirst Category: That the one pronouncing Takfir is from the righteous of the Ummah but is interpreting incorrectly (Muta'awwil) and mistaken, and he is of those for whom interpretation is permissible: This person and his likes are among those from whom blame and sin are lifted due to his Ijtihad (striving) and expending his effort, as in the story of Hatib bin Abi Balta'a (may Allah be pleased with him). Umar (may Allah be pleased with him) described him as having hypocrisy and asked the Messenger of Allah (peace be upon him) for permission to kill him. The Messenger of Allah (peace be upon him) said to him: \"And what do you know? Perhaps Allah looked at the people of Badr and said: 'Do what you wish, for I have forgiven you'\" (2). Yet, he did not rebuke Umar for saying to Hatib: He has committed hypocrisy.\n\nSecond Category: The one who declares someone from this Ummah a disbeliever based on a text and proof from the Book of Allah and the Sunnah of His Messenger, having seen clear disbelief (Kufr Buwah),",
    "foot_note": "1. (So that you do not bear its burden) Sheikh Al-Suhaim.\n2. Recorded by Al-Bukhari, Book of Repentance of Apostates/Chapter: What came regarding those who misinterpret (6/2452) 6540, and Muslim, Book of Virtues of Companions (7/167), 2494.",
    "book_id": "1064",
    "new_page_number": 16
  },
  {
    "serial_number": "96054",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 18,
    "volume_number": 1,
    "text": "such as associating partners with Allah (Shirk), worshipping other than Him, mocking Him the Almighty, His verses, or His messengers, denying them, hating what Allah sent down of guidance and the religion of truth, denying the truth, denying the attributes of Allah the Almighty and His qualities of majesty, and the like: The one who declares Takfir for this and similar things is correct and rewarded, obedient to Allah and His Messenger. Allah the Almighty said: {And We certainly sent into every nation a messenger, [saying], \"Worship Allah and avoid Taghut.\" And among them were those whom Allah guided, and among them were those upon whom error was [deservedly] decreed} [Al-Nahl: 36]. So whoever is not among the people of worshipping Allah the Almighty, affirming His attributes of perfection and qualities of majesty, believing in what His messengers brought, avoiding every Taghut (false deity) that calls to oppose what the messengers brought, is among those upon whom error was decreed, and is not among those whom Allah guided to believe in Him and what the messengers brought from Him. Takfir for abandoning these fundamentals and not believing in them is one of the greatest pillars.\n\nThird Category: Whoever unleashes his tongue in Takfir merely out of enmity, desire, or difference in school of thought (Madhab), as happens with many ignorant people: This is a clear error. Daring to declare Takfir, Tafsiq (declaring someone a sinner), and Tadlil (declaring someone astray) is not permissible except for one who sees clear Kufr for which he has proof from Allah. Disagreement in issues of Ijtihad, where the ruling might be hidden...",
    "foot_note": "None",
    "book_id": "1064",
    "new_page_number": 17
  },
  {
    "serial_number": "96055",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 19,
    "volume_number": 1,
    "text": "...from many people, does not necessitate Kufr or Fisq (sin). The ruling might be definitive and clear to some people, while to others, the ruling is ambiguous and hidden. Allah does not burden a soul beyond its capacity. It is obligatory upon everyone to fear Allah as much as they can. Whatever appears to the elite people of understanding and knowledge is not obligatory upon those to whom it is hidden when they are unable to know it. Following (Taqlid) is not obligatory; at most, it is permissible when needed. Some scholars of Islam have established that laws are not binding until after puberty and the establishment of proof. It is not lawful for anyone to declare Takfir or Tafsiq merely for disagreeing with an opinion or school of thought.\n\nFourth Category: Those who declare Takfir for sins less than Shirk, such as theft, adultery, and drinking alcohol: These are the Kharijites, and according to Ahlus Sunnah, they are people of error and innovation. The Companions of the Messenger of Allah (peace be upon him) fought them because the Hadith is authentic in commanding to fight them and encouraging it. In it: \"They recite the Quran but it does not exceed their throats.\" (1)\n\nThird Regulation\nJudging by the Apparent (Al-Zahir)\nThe Imams of Ahlus Sunnah wal-Jama'ah agreed on the rule (Whoever's Islam is established cannot be removed by doubt); they were the most cautious of people because declaring a Muslim a disbeliever is a dangerous issue...",
    "foot_note": "1. Al-Ithaf fi al-Radd 'ala al-Sahhaf [p. 27].",
    "book_id": "1064",
    "new_page_number": 18
  },
  {
    "serial_number": "96056",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 20,
    "volume_number": 1,
    "text": "...one must avoid delving into it without proof and evidence. One should guard against Takfir as long as there is a way to do so. The door of Takfir is dangerous, and the Prophet (peace be upon him) warned against anyone declaring another a disbeliever without proof. The principle regarding a Muslim is freedom from Fisq and Kufr. If this principle is established, it becomes the certainty, and... (Certainty is not removed by doubt). One does not deviate from this certainty or principle except with clear, authentic evidence. As for conjecture and guessing, this is never their place. If this rule dictates that it is not permissible to judge a Muslim's ablution as broken except with evidence, then how is the case when judging his Islam as broken entirely?! (1)\nDerived from this principle is the sanctity of a Muslim's blood, honor, and wealth. The evidence is the Hadith of the Messenger of Allah (peace be upon him) in his sermon on the Day of Sacrifice during the Farewell Pilgrimage, recorded by Al-Bukhari (2) and Muslim (3) in their Sahihs: (...Indeed, your blood, your wealth, and your honor are sacred to you, like the sanctity of this day of yours, in this month of yours, in this land of yours. Let the witness inform the absent). (4)",
    "foot_note": "1. Qawa'id al-Ahkam (2/26).\n2. Book of Hajj, Chapter: The Sermon during the Days of Mina (4/335) 1741.\n3. Book of Oaths and Belligerents (3/2305) 1679.\n4. [Waqfat Ta'siliyyah] (Takfir between Knowledge and Ignorance) Dr. Fahd bin Saad Al-Zaidi Al-Juhani.",
    "book_id": "1064",
    "new_page_number": 19
  },
  {
    "serial_number": "96057",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 21,
    "volume_number": 1,
    "text": "Before discussing the evidence for judging by the apparent, we must understand the meaning of 'Apparent' (Al-Zahir):\n\nA. Definition of 'Apparent':\nZahara (appeared), Yazharu (appears), Zuhuran (appearing), so it is Zahir (apparent). The apparent is the opposite of the hidden (Batin). (1)\n\nB. Judging by the Apparent and Evidence for that (2):\nThis is one of the great issues in the methodology of Ahlus Sunnah regarding judging people. Their judgments are not based on conjectures, illusions, or claims for which they possess no proof. This is from Allah's mercy and facilitation for His servants and part of charging them with what they can bear and are capable of. All that preceded is intended for the worldly judgment of a person as Muslim or Kafir. As for judging the reality (inner truth), there is no way to that. Imam Al-Shatibi, may Allah have mercy on him, explaining the importance of this principle and the danger of neglecting it, says: (The principle of judging by the apparent is definitive in rulings specifically, and regarding belief in others generally. For the Master of Mankind, despite being informed by Revelation, conducted matters according to their outward appearances regarding the hypocrites...",
    "foot_note": "1. Lisan al-Arab: Entry (Zahara).\n2. Benefited from 'Nawaqid al-Iman al-I'tiqadiyyah' Dr. Muhammad Al-Wahibi (1/201).",
    "book_id": "1064",
    "new_page_number": 20
  },
  {
    "serial_number": "96058",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 22,
    "volume_number": 1,
    "text": "...and others, even though he knew the secrets of their conditions. That did not remove him from conducting matters according to appearances as they occurred. It should not be said: This was of the type he mentioned: 'For fear that people would say Muhammad kills his companions' (1), implying the reason is different from what you claimed. So if the stated reason is absent, there is no restriction. Because we say: This is the strongest evidence for what has been established, because opening this door leads to not preserving the order of outward appearances. For whoever deserves death due to an apparent cause, the excuse in it is apparent and clear. But whoever is sought to be killed without an apparent cause, but merely by a command of the Unseen, it might confuse minds and cloud appearances. It is understood from the Sharia that this door is closed entirely. Do you not see the chapter of Claims based on 'The burden of proof is on the plaintiff and the oath is on the one who denies' (2)? He did not except anyone from that, such that the Messenger of Allah (peace be upon him) needed proof in that regard, asking 'Who will bear witness for me?' until Khuzaymah bin Thabit testified for him (3), so he made...",
    "foot_note": "1. Part of a Hadith narrated by Al-Bukhari, Book of Tafsir, Chapter: His saying {? ? ? ? ...} the verse... Al-Fath (8/648) 4622.\n2. Recorded by Al-Bukhari 8/398 in Tafsir of Surah Al-Ahzab.\n3. As for Khuzaymah, he is: Khuzaymah bin Thabit bin Al-Fakih bin Tha'labah bin Sa'idah, Abu Ammar Al-Ansari Al-Madani, 'Dhu al-Shahadatayn' (Possessor of the Two Testimonies). He witnessed Uhud and what followed. He was martyred with Ali, may Allah be pleased with him, on the day of Siffin. A glorious Companion who has Hadiths. See for his biography: Tabaqat Ibn Sa'd 4/378, Usd al-Ghabah 2/133, and Al-Isabah 3/930.",
    "book_id": "1064",
    "new_page_number": 21
  },
  {
    "serial_number": "96059",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 23,
    "volume_number": 1,
    "text": "...his testimony equal to two testimonies (1). So what do you think of individual members of the Ummah? If the most lying of people made a claim against the most righteous of people, the burden of proof would be on the plaintiff, and the oath on the one who denies. This is part of that, and the pattern is one: unseen considerations are neglected according to legal commands and prohibitions) (2).\nAhlus Sunnah relied on many proofs to establish this great principle, including:\n1. The Almighty's saying: {O you who have believed, when you go forth [to fight] in the cause of Allah, investigate; and do not say to one who gives you [a greeting of] peace \"You are not a believer,\" aspiring for the goods of worldly life} [An-Nisa: 94].",
    "foot_note": "1. The story regarding this: The Prophet (peace be upon him) bought a horse from a Bedouin. The Prophet (peace be upon him) walked ahead to pay him the price of his horse, so the Messenger of Allah (peace be upon him) walked fast while the Bedouin walked slowly. Men began to intercept the Bedouin, bargaining for the horse, not realizing that the Prophet (peace be upon him) had bought it. The Bedouin called out to the Messenger of Allah (peace be upon him) saying: \"If you are buying this horse, [do so], otherwise I will sell it.\" The Prophet (peace be upon him) stopped when he heard the Bedouin's call and said: \"Have I not already bought it from you?\" The Bedouin said: \"No, by Allah, I did not sell it to you.\" The Prophet (peace be upon him) said: \"Yes, I bought it from you.\" The Bedouin began saying: \"Bring a witness.\" Khuzaymah bin Thabit said: \"I testify that you pledged allegiance to him (bought it).\" The Prophet (peace be upon him) turned to Khuzaymah and said: \"On what basis do you testify?\" He said: \"Based on believing you, O Messenger of Allah.\" So the Prophet (peace be upon him) made Khuzaymah's testimony equal to the testimony of two men. Recorded by Abu Dawood (2/331), Al-Nasa'i (7/301), and Ahmad (5/215). Authenticated by Al-Albani in Sahih Sunan Abi Dawood 3607.\n2. Al-Muwafaqat by Al-Shatibi 2/271, 272.",
    "book_id": "1064",
    "new_page_number": 22
  },
  {
    "serial_number": "96060",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 24,
    "volume_number": 1,
    "text": "Al-Shawkani said: (The meaning here is: Do not say to one who surrenders to you and submits, 'You are not a believer.' 'Salm' and 'Salam' both mean submission/surrender. It is also said they mean Islam: i.e., Do not say to one who offers you submission and says 'Peace be upon you': 'You are not a believer.' The intent is to forbid Muslims from disregarding what a disbeliever presents as indication of his Islam and saying that he only brought that for refuge and dissimulation (Taqiyyah)) (1).\nImam Al-Mujaddid Muhammad bin Abd al-Wahhab, may Allah have mercy on him, said: (The verse indicates that it is obligatory to desist from him and verify. If something contradicting Islam becomes apparent from him after that, he is killed, due to His saying: {investigate}. If he were not to be killed if he said it, there would be no meaning to verification... until he says: And whoever outwardly displays Tawhid and Islam, it is obligatory to desist from him until something contradicting that becomes clear from him) (2).\n2. They inferred from his (peace be upon him) saying: \"I have been ordered to fight the people until they testify that there is no god but Allah, and that Muhammad is the Messenger of Allah, establish prayer, and pay zakat. If they do that, they have protected their blood and wealth from me, except for the right of Islam...",
    "foot_note": "1. Fath al-Qadir 1/501.\n2. Kashf al-Shubuhat 49.",
    "book_id": "1064",
    "new_page_number": 23
  },
  {
    "serial_number": "96061",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 25,
    "volume_number": 1,
    "text": "...and their account is with Allah.\" (1)\nThe witness from the Hadith is his saying (and their account is with Allah). Ibn Rajab said: (As for the Hereafter, their account is with Allah Almighty. If he was truthful, Allah will admit him to Paradise for that. If he was a liar, he is among the hypocrites in the lowest depth of the Fire) (2).\nAl-Hafiz said in Al-Fath: (Meaning the matter of their inner secrets... In it is evidence for accepting outward deeds and judging by what the apparent dictates) (3).\nImam Al-Baghawi said: (In the Hadith is evidence that people's affairs in dealing with one another run according to the apparent of their conditions, not the hidden. Whoever manifests the symbol of the Religion, its ruling applies to him, and his inner state is not investigated. If a circumcised man is found among uncircumcised dead, he is separated from them in burial. If a foundling is found in a land of Muslims, he is judged to be Muslim) (4).",
    "foot_note": "1. Recorded by Al-Bukhari, Book of Faith, {But if they repent and establish prayer...} the verse (Al-Fath) 1/75, and Muslim, Book of Faith, Chapter: The Command to Fight People until they say (There is no god but Allah, Muhammad is the Messenger of Allah) (Sharh Al-Nawawi) 1/210.\n2. Jami' al-Ulum wa al-Hikam 83.\n3. Fath al-Bari 1/77. See Sharh Al-Nawawi 1/212, and Jami' al-Ulum wa al-Hikam 83.\n4. Sharh al-Sunnah 1/70.",
    "book_id": "1064",
    "new_page_number": 24
  },
  {
    "serial_number": "96062",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 26,
    "volume_number": 1,
    "text": "3. They also inferred from the famous story of Usamah (may Allah be pleased with him). He said: \"The Messenger of Allah (peace be upon him) sent us in a detachment, and we reached Al-Huraqat of Juhaynah (1) in the morning. I caught up with a man and he said: 'There is no god but Allah,' but I stabbed him. Then I felt something in myself about that, so I mentioned it to the Prophet (peace be upon him). The Messenger of Allah (peace be upon him) said: 'Did he say There is no god but Allah and you killed him?' I said: 'O Messenger of Allah, he only said it out of fear of the weapon.' He said: 'Did you tear open his heart so you would know if he said it or not?' He kept repeating it to me until I wished I had embraced Islam that day\" (2), (3).\nThe Hadith contains a severe rebuke and warning against killing someone who utters Tawhid, and a clear warning against bypassing the apparent and judging what is in the heart without proof. Al-Nawawi, may Allah have mercy on him, said: (His saying, peace be upon him, 'Did you tear open his heart so you would know if he said it or not?' The subject in his saying 'he said it' is the heart (4), and its meaning is...",
    "foot_note": "1. Al-Huraqat of Juhaynah: They are a clan of Juhaynah. See the reason for their naming in Al-Fath 12/195.\n2. Until I wished I had embraced Islam that day: (Meaning my Islam had not preceded, but I started Islam now so that what preceded would be erased from me) Sharh Al-Nawawi 2/104.\n3. Recorded by Muslim, and the wording is his, Book of Faith, \"Chapter: Prohibition of killing the Disbeliever after he says There is no god but Allah\" (Muslim with Sharh Al-Nawawi 2/99), and Al-Bukhari, Book of Blood Money \"Chapter: The saying of Allah Almighty: {And whoever saves one...} the verse) (Al-Fath 7/517, 12/191). See similar Hadiths, Muslim with Sharh Al-Nawawi 2/98-101, \"Book of Campaigns\" Chapter: The Prophet sending Usamah.\n4. i.e., Did the heart say it out of fear of the weapon or not?",
    "book_id": "1064",
    "new_page_number": 25
  },
  {
    "serial_number": "96063",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 27,
    "volume_number": 1,
    "text": "...that you are only charged with acting upon the apparent and what the tongue pronounces. As for the heart, you have no way to know what is in it. So he rebuked him for refraining from acting upon what appeared on the tongue. He said: 'Did you tear open his heart to look: did the heart say it and believe it and was it in it, or was it not in it but only ran on the tongue?' Meaning: And since you are not capable of this, restrict yourself to the tongue only and do not seek other than it) (1). He also said in his commentary on his saying (peace be upon him): \"Did you tear open his heart?\": (In it is evidence for the well-known rule in Fiqh and Usul that judgments are based on the apparent, and Allah handles the inner secrets) (2).\n4. Among the great Hadiths in this chapter is the Hadith of the slave girl of Mu'awiyah bin Al-Hakam Al-Sulami when he asked the Messenger of Allah (peace be upon him): \"Should I not free her? He said: Bring her to me. So I brought her to him. He said to her: Where is Allah? She said: In the sky. He said: Who am I? She said: You are the Messenger of Allah. He said: Free her, for she is a believer\" (3).\nSheikh al-Islam said in his commentary on this Hadith: (...For the faith upon which worldly rulings are suspended is the apparent faith, which is...",
    "foot_note": "1. Muslim with Sharh Al-Nawawi 2/104.\n2. Ibid 2/107.\n3. Recorded by Muslim, Book of Mosques, \"Chapter: Prohibition of speaking during Prayer\" number 537.",
    "book_id": "1064",
    "new_page_number": 26
  },
  {
    "serial_number": "96064",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 28,
    "volume_number": 1,
    "text": "...Islam. The name is one in apparent rulings. For this reason, when Al-Athram mentioned to Ahmad the argument of the Murji'ah using the saying of the Prophet (peace be upon him): \"Free her, for she is a believer,\" he answered that the meaning is: her ruling in this world is the ruling of a believer. He did not mean that she is a believer with Allah deserving to enter Paradise without Fire if she meets Him merely with this affirmation) (1), (Because apparent faith upon which rulings run in this world does not necessitate faith in the inner self by which the owner belongs to the people of happiness in the Hereafter) (2).\nTherefore, the Prophet (peace be upon him) used to treat hypocrites according to their outward appearances despite his knowledge of the hypocrisy of many of them. (In appearance, they are believers; they pray with the people, fast, perform Hajj, and go on military expeditions. Muslims marry with them and inherit from them... The Prophet (peace be upon him) did not judge the hypocrites with the judgment of those who openly display Kufr, neither in marriage nor inheritance nor the like. Rather, when Abdullah bin Ubayy bin Salul died—and he was among the most famous people for hypocrisy—his son Abdullah, who was among the best of believers, inherited from him. Likewise, all of them who died were inherited by their believing heirs. If one of them had an heir, they inherited with the Muslims... because inheritance is based on apparent allegiance (Wala'), not on the love in hearts. For if...",
    "foot_note": "1. Al-Iman 398. See 201, 202, 243.\n2. Ibid 197.",
    "book_id": "1064",
    "new_page_number": 27
  },
  {
    "serial_number": "96065",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 29,
    "volume_number": 1,
    "text": "...it were suspended on that, it could not be known. Wisdom, if hidden or scattered, has the ruling suspended on its presumption (Mazannah), which is what they displayed of allegiance to the believers... Likewise, they were treated like other Muslims in rights and penalties) (1).\n\nFourth Regulation\nDifferentiating between Absolute Takfir and Specific Takfir (Takfir al-Mu'ayyan)\nIt is among the principles of Ahlus Sunnah wal-Jama'ah to differentiate between absolute Takfir and the Takfir of a specific individual. Because a Muslim might say a saying or do a deed which the Book, the Sunnah, and the Consensus of the Ummah indicate is Kufr and apostasy from Islam, but there is no necessary correlation for them between saying 'this is Kufr' and declaring the specific person a Kafir. (2)\nAbsolute Takfir (Takfir Mutlaq): Judging Kufr upon the saying, deed, or belief that negates the foundation of Islam and contradicts it, and upon the doers in a general sense, without specifying anyone in particular.\nSpecific Takfir (Takfir al-Mu'ayyan): Judging a specific individual as a Kafir for committing something that contradicts Islam, after the conditions of Takfir are met in him and the impediments are absent. (3)",
    "foot_note": "1. Al-Iman by Ibn Taymiyyah 198.\n2. Al-Iman Haqiqatuhu, Khawarimuhu, Nawaqiduhu 'inda Ahlis Sunnah wal-Jama'ah (107/1).\n3. Manhaj Ibn Taymiyyah fi Mas'alat al-Takfir by Abdullah Al-Musha'bi (1/193).",
    "book_id": "1064",
    "new_page_number": 28
  },
  {
    "serial_number": "96066",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 30,
    "volume_number": 1,
    "text": "Judging an apparent deed as Kufr relates to clarifying the legal ruling absolutely. As for the doer, one must look at his intent for what he did and clarify his condition regarding that before being certain. The intent here does not mean merely the intent to perform the action, for action does not occur without this except the action of a madman or a sleeper. It is in reality the decisive will to realize the action such that the human is chosen to do the action or not do it; this intent is the locus of accountability (Taklif). Rather, the intent here means the intent of the action which is the goal of the doer from his action, the motive for him to do it, and the drive to realize it and his desire by it. For this reason, the intent of the action is the reality of the intention (Niyyah) upon which reward, punishment, praise, and blame are based. It is what is meant in the saying of the Messenger (peace be upon him): \"Actions are but by intentions, and every person shall have what he intended\" (1) (2).\n\nA. Texts warning against unleashing Takfir on a specific person.\nSince the principle regarding a Muslim is uprightness (Adalah), legal texts came warning against applying Kufr to a person specifically unless conditions met...",
    "foot_note": "1. Recorded by Al-Bukhari in Book: How Revelation began to the Messenger of Allah (1/1) 1, and Muslim, Book of Leadership (6/48) 5036.\n2. Dawabit al-Takfir 'inda Ahlis Sunnah wal-Jama'ah by Abdullah Al-Qarni p. 275.",
    "book_id": "1064",
    "new_page_number": 29
  },
  {
    "serial_number": "96067",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 31,
    "volume_number": 1,
    "text": "...and impediments are absent. Among the Hadiths warning against declaring a Muslim a disbeliever:\n1. From Abdullah bin Umar (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: \"Any man who says to his brother 'O Kafir', one of them returns with it\" (1). In a narration by Ibn Hibban from Abu Sa'id, he said: The Messenger of Allah said: \"No man ever calls another man Kafir except that one of them returns with it; if he was a Kafir [then good], otherwise he disbelieved by his Takfir.\" (2)\nThere are several views on the interpretation of the Hadith:\nFirst: It is carried upon the one who declares that lawful (Mustahill), and this person becomes a disbeliever.\nSecond: It means his disparagement of his brother and the sin of his Takfir return upon him.\nThird: It is carried upon the Kharijites who declare believers to be disbelievers. Qadi Iyad reported this view from Imam Malik bin Anas.",
    "foot_note": "1. Recorded by Al-Bukhari, Book of Adab/Chapter: Whoever calls his brother Kafir without interpretation is as he said (5/2246) 5753, and Muslim, Book of Faith (1/65) 225.\n2. Sahih Ibn Hibban (1/483). Also recorded by Al-Tahawi in Sharh Mushkil al-Athar (2/202), Al-Khara'iti in Masawi' al-Akhlaq (1/20), Al-Asbahani in Al-Hujjah fi Bayan al-Mahajjah (2/452). Al-Albani said in Sahih al-Targhib wal-Tarhib: Sahih li-ghayrihi (3/35).",
    "book_id": "1064",
    "new_page_number": 30
  },
  {
    "serial_number": "96068",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 32,
    "volume_number": 1,
    "text": "Fourth: It means that it leads him to Kufr. This is because sins, as they said, are the courier of Kufr, and it is feared for the one who commits them frequently that their ominous consequence will be ending up in Kufr. This view is supported by what appeared in a narration by Abu Awanah Al-Isfarayini in his book extracted on Sahih Muslim: \"If he was as he said [then good], otherwise he has returned with Kufr.\" And in a narration: \"If he says to his brother 'O Kafir', Kufr becomes incumbent upon one of them\" (1).\nFifth: Al-Hafiz Ibn Hajar preferred another meaning and deemed it good: That whoever says that to someone known for Islam without having a specious argument (Shubhah) for claiming he is a Kafir, implies that he disbelieves by that... The meaning of the Hadith is that his Takfir returns upon him; so the Takfir returns, not the Kufr itself. It is as if he declared himself a disbeliever because he declared someone like himself a disbeliever. And no one declares him (the believer) a disbeliever except a disbeliever who believes in the falsehood of the religion of Islam. This is supported by the fact that in some of its paths it says \"Kufr became incumbent upon one of them.\" (2)\n2. It came in Al-Bukhari from the Hadith of Thabit bin Al-Dahhak from the Prophet (peace be upon him) who said: \"Whoever swears by a religion other than Islam falsely, he is as he said. And whoever kills himself with something will be punished with it in the Fire of Hell. And cursing a believer is like killing him. And whoever accuses a believer...",
    "foot_note": "1. See Sharh Al-Nawawi on Muslim (1/153).\n2. Fath al-Bari 17/199.",
    "book_id": "1064",
    "new_page_number": 31
  },
  {
    "serial_number": "96069",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 33,
    "volume_number": 1,
    "text": "...of Kufr, it is like killing him\" (1).\n3. And from Jundub (may Allah be pleased with him) that the Messenger of Allah told: \"That a man said: By Allah, Allah will not forgive so-and-so. And Allah the Almighty said: Who is he who swears by Me (2) that I will not forgive so-and-so? For I have forgiven so-and-so and I have nullified your deeds.\" Or as he said (3).\n4. And from Abu Dharr (may Allah be pleased with him) that he heard the Prophet (peace be upon him) say: \"No man accuses another man of Fusuq (sinfulness) nor accuses him of Kufr except that it rebounds upon him if his companion is not like that\" (4).\nAnd from Abu Dharr also that he heard the Messenger of Allah (peace be upon him) say: \"There is no man who knowingly claims for himself a father other than his own except that he has disbelieved. And whoever claims what is not his is not of us, and let him take his seat in the Fire. And whoever calls a man by 'Kufr' or says 'Enemy of Allah' and he is not so, except that it returns (5) upon him\" (6).",
    "foot_note": "1. Book of Adab/Chapter: Whoever calls his brother Kafir without interpretation is as he said (5/2264) 5754.\n2. Yata'alla: Swears, and Al-Aliyyah is the oath. Sharh Al-Nawawi on Muslim (16/174).\n3. Recorded by Muslim, Book of Birr, Silah, and Adab (8/36) 6847.\n4. Recorded by Al-Bukhari, Book of Adab/Chapter: What is forbidden of cursing and damning (5/2247) 5968.\n5. Hara 'alayhi: Returned upon him. Al-Hawr means return. Ikmal Al-Mu'lim Sharh Sahih Muslim by Qadi Iyad (1/224).\n6. Recorded by Muslim, Book of Faith (1/75) 226.",
    "book_id": "1064",
    "new_page_number": 32
  },
  {
    "serial_number": "96070",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 34,
    "volume_number": 1,
    "text": "5. It came from Mu'adh bin Jabal (1) and Hudhayfah (2) (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: \"The thing I fear most for you is three: A man who reads the Book of Allah until its splendor is seen upon him and he was a support for Islam, Allah changed him to what He willed (or stripped him of it); he unsheathed his sword and struck his neighbor with it, and accused him of Shirk.\" We said: \"O Messenger of Allah, is the accuser more deserving of it (Shirk) or the accused?\" He said: \"The accuser\" (3).\nWhen Ali bin Abi Talib (may Allah be pleased with him) was asked about the people of Nahrawan (Kharijites): \"Are they polytheists (Mushrikun)?\" He said: \"From Shirk they fled.\" He was asked: \"Are they hypocrites?\" He said:",
    "foot_note": "1. Recorded by Al-Tabarani in Al-Mu'jam Al-Kabir (14/497), in Musnad Al-Shamiyyin (2/254), Al-Fasawi in Al-Ma'rifah wal-Tarikh (2/358). Ibn Abi Asim in Al-Sunnah (1/24), in Al-Diyat (1/91), Abd Al-Ansari in Dhamm Al-Kalam wa Ahlih (1/102), Al-Asbahani in Al-Hujjah fi Bayan Al-Mahajjah (2/452). Al-Haythami said in Majma' Al-Zawa'id (5/276): Narrated by Al-Tabarani in Al-Kabir and Al-Saghir with similar wording, and it contains Shahr bin Hawshab who is weak but his hadith is written. Sheikh Hamoud Al-Tuwaijri commented on Al-Haythami's words in Ithaf Al-Jama'ah (1/325) saying: Ahmad and Ibn Ma'in authenticated him, and their authentication is sufficient. Al-Ijli, Yaqub bin Shaybah, and Yaqub bin Sufyan also authenticated him. Al-Bukhari narrated from him in Mu'allaq form, and Muslim, and Al-Tirmidhi authenticated his hadith. This is sufficient to accept his hadith.\n2. Recorded by Ibn Hibban (1/281), Al-Tahawi in Sharh Mushkil Al-Athar (2/202), Abdullah Al-Ansari in Dhamm Al-Kalam wa Ahlih (1/103), Ibn Asakir in Tabyin Kadhib Al-Muftari (1/403), Al-Asbahani in Al-Hujjah fi Bayan Al-Mahajjah (2/453). Al-Bukhari narrated it briefly in Al-Tarikh (4/301). Ibn Kathir said in his Tafsir: Its chain is good (Jayyid) (2/324).\n3. Al-Albani authenticated the text of the Hadith in Al-Sahihah (8/208).",
    "book_id": "1064",
    "new_page_number": 33
  },
  {
    "serial_number": "96071",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 35,
    "volume_number": 1,
    "text": "\"The hypocrites do not remember Allah except a little, and those remember Allah morning and evening. Rather, they are our brothers who transgressed against us.\" (1)\n\nB. Sayings of the People of Knowledge regarding the prohibition of declaring a specific person a disbeliever without establishing proof:\nSheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, said: (No one has the right to declare anyone of the Muslims a disbeliever, even if he erred and made a mistake, until the proof is established against him and the clear path is explained to him. Whoever's Islam is established with certainty, it is not removed from him by doubt; rather, it is not removed except after establishing the proof and removing the specious argument/doubt.) (2)\nHe also said: (I am among the people who most strictly forbid attributing specific individuals to Takfir, Tafsiq, or disobedience, unless it is known that the Messengers' proof has been established against him, which whoever opposes becomes a Kafir at times, a Fasiq at others, and disobedient at others.) (3)\nIbn Abi Al-Izz Al-Hanafi said: (As for the specific person, if it is said: Do you testify that he is from the people of the Threat (Hellfire) and that he is a Kafir? We do not testify against him except with a matter with which testimony is permissible. For it is the greatest oppression to testify against a specific person that Allah will not forgive him...",
    "foot_note": "1. Recorded by Al-Bayhaqi (8/173), and Ibn Abi Shaybah (7/535) and its chain is authentic.\n2. Majmoo' al-Fatawa (12/466).\n3. Majmoo' al-Fatawa (3/229).",
    "book_id": "1064",
    "new_page_number": 34
  },
  {
    "serial_number": "96072",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 36,
    "volume_number": 1,
    "text": "...and will not have mercy on him, but rather will keep him eternally in the Fire. For this is the ruling on the Kafir after death.) (1)\nIt came in the statement of the Council of Senior Scholars regarding extremism and Takfir and the corruption resulting from them: (Since the reference of the ruling of Takfir is to Allah and His Messenger, it is not permissible to declare anyone a disbeliever except the one whom the Book and Sunnah indicate is a Kafir with clear indication. Mere suspicion and conjecture are not sufficient for that, due to the dangerous rulings entailed by it. If Hudud (prescribed punishments) are warded off by doubts, even though what they entail is less than what Takfir entails, then Takfir is more deserving to be warded off by doubts.) (2)\nIt becomes clear from the above that Ahlus Sunnah apply Takfir in general terms, as well as the Threat (Wa'id), but judging a specific person with Kufr and the Threat requires precision and caution to ensure conditions are met and impediments are absent. (For absolute Takfir is like the absolute Threat; it does not necessitate the Takfir of a specific person until the proof which makes its abandoner a Kafir is established against him. As established in...",
    "foot_note": "1. Sharh Al-Aqeedah Al-Tahawiyyah (1/316).\n2. 'Majallat al-Buhuth al-Islamiyyah' Issue (56), (p. 357-362) and the book 'Al-Fatawa al-Shar'iyyah fi al-Qadaya al-'Asriyyah' collected and prepared by Muhammad bin Fahd Al-Husayn 65-70. See also (Hadith hawla al-Ahdath: Zahirat al-Ghulu wal-Takfir: Al-Usul, Al-Asbab, wal-Ilaj) by Dr. Nasser Al-Aql p. 16.",
    "book_id": "1064",
    "new_page_number": 35
  },
  {
    "serial_number": "96073",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 37,
    "volume_number": 1,
    "text": "...the Sahih collections from the Prophet (peace be upon him) regarding the man who said: 'When I die, burn me, then crush me, then scatter me in the sea; for by Allah, if Allah is able to get hold of me, He will punish me with a punishment He has not punished anyone of the worlds with.' Allah said to him: 'What carried you to do what you did?' He said: 'Fear of You.' So He forgave him) (1). This man believed that Allah was not capable of gathering him if he did that, or he doubted it and that He would not resurrect him. Each of these beliefs is Kufr that makes the one against whom proof is established a Kafir. But he was ignorant of that, and knowledge did not reach him to turn him back from his ignorance. He had faith in Allah, His command and prohibition, His promise and threat, so he feared His punishment, so Allah forgave him due to his fear.) (2)\nHowever, some deluded people thought, due to reading these texts and their likes, that Ahlus Sunnah do not declare specific individuals disbelievers, absolutely like that. This thought of theirs is similar to the thought of those who believed that Ahlus Sunnah are lenient in the issue of Takfir. The truth is that Ahlus Sunnah do declare specific individuals disbelievers, and that is if the proof is established against them, the doubt is removed, and impediments are absent, and they are certain of his persistence and denial. They do not refrain from specific Takfir absolutely. Rather, whoever brings a statement of Kufr that expels from the Religion, or an action of Kufr that expels from the Religion, or a belief of Kufr that expels from the Religion, or doubt and skepticism...",
    "foot_note": "1. Recorded by Al-Bukhari, Book of Tawhid/Chapter: The saying of Allah Almighty: (They wish to change the words of Allah) (6/2725) 7067, and Muslim, Book of Repentance (8/97) 7156.\n2. Al-Istiqamah by Ibn Taymiyyah (1/164).",
    "book_id": "1064",
    "new_page_number": 36
  },
  {
    "serial_number": "96074",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 38,
    "volume_number": 1,
    "text": "...that expels from the Religion; then after the meeting of conditions and absence of impediments, the scholar or judge rules upon him with what is necessary of apostasy and killing after seeking repentance (Istitabah) in most cases.",
    "foot_note": "None",
    "book_id": "1064",
    "new_page_number": 37
  },
  {
    "serial_number": "96075",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 39,
    "volume_number": 1,
    "text": "Chapter Two\nRegulations of Specific Takfir in the Light of the Prophetic Sunnah (Conditions and Impediments)\nThere must be the presence of conditions and the absence of impediments for the Takfir of a specific accountable person (Mukallaf). Here is their clarification:\n\nFirst: Knowledge is a condition and its impediment is Ignorance:\nA Muslim is not declared a disbeliever for a saying, deed, or belief except after the proof is established against him and the doubt is removed from him.\nKnowledge (Ilm) linguistically: The opposite of ignorance. It is: perceiving a thing as it really is, with a decisive perception. (1)\nTechnically: Some people of knowledge said: It is recognition (Ma'rifah) and it is the opposite of ignorance. Others of the people of knowledge said: Knowledge is clearer than to be defined. (2)\nIgnorance (Jahl) linguistically: It is the emptiness of the soul from knowledge. (3)",
    "foot_note": "1. Lisan al-Arab, (12/416) Entry (A L M).\n2. Kitab al-Ilm, 2 by Ibn Uthaymeen.\n3. See: Lisan al-Arab (11/129). Entry (J H L).",
    "book_id": "1064",
    "new_page_number": 38
  },
  {
    "serial_number": "96076",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 40,
    "volume_number": 1,
    "text": "Technically: It is: doing a thing contrary to how it should be done, whether he believed in it with a correct belief or a corrupt one. (1)\n\nA. Evidences for Excuse due to Ignorance:\n1. The Almighty's saying: {[We sent] messengers as bringers of good tidings and warners so that mankind will have no argument against Allah after the messengers. And ever is Allah Exalted in Might and Wise} [An-Nisa: 165].\nSheikh al-Islam Ibn Taymiyyah said: \"But among people are those who are ignorant of some of these rulings with an ignorance for which they are excused. So no one is judged with Kufr until the proof is established against him by way of the conveyance of the Message, as the Almighty said: {so that mankind will have no argument against Allah after the messengers} [An-Nisa: 165], and the Almighty said: {And never would We punish until We sent a messenger} [Al-Isra: 15]. For this reason, if a man embraced Islam and did not know that prayer was obligatory upon him, or did not know that wine is forbidden, he does not become a disbeliever for not believing in the obligation of this and the prohibition of that. Rather, he is not even punished until the Prophetic proof reaches him.\" (2)\n2. The Hadith of the man from the Children of Israel who ordered his family to burn him. Here is its text, from Abu Hurairah (may Allah be pleased with him) from the Prophet (peace be upon him) who said:",
    "foot_note": "1. See: Al-Mufradat, p. 102.\n2. Majmoo' al-Fatawa, (11/406).",
    "book_id": "1064",
    "new_page_number": 39
  },
  {
    "serial_number": "96077",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 41,
    "volume_number": 1,
    "text": "\"There was a man who transgressed against himself [by sinning]. When death approached him, he said to his sons: 'When I die, burn me, then grind me, then scatter me in the wind. For by Allah, if Allah is able to get hold of me, He will punish me with a punishment He has not punished anyone with.' When he died, that was done to him. So Allah commanded the earth, saying: 'Gather what is in you of him.' It did so, and behold, he was standing. He said: 'What carried you to do what you did?' He said: 'O Lord, fear of You.' So He forgave him.\" (1)\nAl-Hafiz Ibn Abd al-Barr (may Allah have mercy on him) said: (...As for this man mentioned in this Hadith being ignorant of an attribute among the attributes of Allah regarding His knowledge and power, that does not expel him from Faith...) Then he inferred this by the Companions' questioning (may Allah be pleased with them) regarding Decree (Qadar) (2), then he said: (It is known that they only asked him about that while they were ignorant of it, and it is not permissible according to any Muslim that they were disbelievers by asking about that... nor did their ignorance of it harm them before they learned it). (3)\nImam Ibn Hazm (may Allah have mercy on him) said after mentioning the Hadith:",
    "foot_note": "1. Recorded by Al-Bukhari, Book of Prophets, Chapter \"Or have you thought that the companions of the cave and the inscription...\" (8/592) 3481, and the wording is his; and Muslim, Book of Repentance (4/2109) 2756.\n2. Regarding that: From Imran bin Husayn who said: It was said, 'O Messenger of Allah, are the people of Paradise known from the people of the Fire?' He said, 'Yes.' It was said, 'Then for what do the workers work?' He said, 'Everyone is facilitated for what he was created for.' Sahih Muslim, Book of Decree (8/48) 6907.\n3. Al-Tamhid, (18/46).",
    "book_id": "1064",
    "new_page_number": 40
  },
  {
    "serial_number": "96078",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 42,
    "volume_number": 1,
    "text": "(...So this is a human who remained ignorant until he died that Allah Almighty is capable of gathering his ashes and resurrecting him, yet He forgave him due to his affirmation, his fear, and his ignorance). (1)\n3. Among the Hadiths also is what Abdullah bin Abi Awfa narrated, saying: When Mu'adh arrived from Sham (the Levant), he prostrated to the Prophet (peace be upon him). He said: \"What is this, O Mu'adh?\" He said: \"I came to Sham and found them prostrating to their bishops and patriarchs, so I wished in myself that we should do that for you.\" The Messenger of Allah (peace be upon him) said: \"Do not do so. For if I were to order anyone to prostrate to other than Allah, I would have ordered the woman to prostrate to her husband.\" (2)\nImam Al-Shawkani said in his commentary on the Hadith: \"In this Hadith is evidence that whoever prostrates to other than Allah out of ignorance does not become a disbeliever.\" (3)",
    "foot_note": "1. Al-Fisal, (3/252).\n2. Recorded by Ibn Majah (1/595) and the wording is his, Ibn Hibban (9/479), Ahmad bin Hanbal (4/381), Al-Bayhaqi in Al-Kubra (7/292), Al-Shashi in his Musnad (3/231), and Al-Bazzar (2/133). Al-Busiri said in Misbah al-Zujajah (1/285): \"This chain is weak due to the weakness of Ali bin Zaid bin Jud'an in its chain, who is weak. However, the Hadith has another path narrated by Abu Bakr bin Abi Shaybah in his Musnad like this with an addition at the beginning as mentioned in Zawa'id al-Masanid al-Ashara. It has a witness from the Hadith of Talq bin Ali narrated by Al-Tirmidhi and Al-Nasa'i, and Al-Tirmidhi and Ibn Majah narrated it from the Hadith of Umm Salamah.\" Al-Albani said about it: Hasan Sahih as in Sahih Sunan Ibn Majah (4/353). See Sahih Al-Targhib wal-Tarhib (2/197).\n3. Nayl al-Awtar (6/234).",
    "book_id": "1064",
    "new_page_number": 41
  },
  {
    "serial_number": "96079",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 43,
    "volume_number": 1,
    "text": "4. The Hadith of Abu Waqid Al-Laythi, who said: We went out with the Messenger of Allah (peace be upon him) to Hunayn, and we had recently left Kufr (disbelief) behind—they had embraced Islam on the day of the Conquest. We passed by a tree, so we said: \"O Messenger of Allah, appoint for us a Dhat Anwat (Tree of Hanging Things) just as they have a Dhat Anwat.\" The disbelievers had a lote tree around which they would devote themselves and hang their weapons; they called it Dhat Anwat. When we said that to the Prophet (peace be upon him), he said: \"Allah is Most Great! You have said, by the One in Whose Hand is my soul, just as the Children of Israel said to Moses: {Make for us a god just as they have gods. He said, 'Indeed, you are a people behaving ignorantly.'} [Al-A'raf: 138]. You will surely follow the ways of those before you.\" (1)\nImam Al-Mujaddid Muhammad bin Abd al-Wahhab (may Allah have mercy on him) said: (...Likewise, there is no disagreement that if those whom the Prophet (peace be upon him) forbade had not obeyed him...",
    "foot_note": "1. Recorded by Al-Tirmidhi (4/475), and he said: This Hadith is Hasan Sahih. Also Al-Nasa'i in Al-Kubra (6/346), Ahmad (5/218), Ibn Hibban (15/94), Al-Tayalisi (2/682), Ibn Abi Shaybah (8/634), Abd al-Razzaq in Al-Musannaf (20763) and in Al-Tafsir (2/415), Al-Humaydi (2/357), Abu Ya'la (3/30), Al-Tabarani in Al-Kabir (3/393, 394, 395, 396), Al-Bayhaqi in Al-Ma'rifah (1/75), Al-Azraqi in Akhbar Makkah (1/98), Al-Tabari in Al-Tafsir (13/81, 82), Ibn Abi Hatim in Al-Tafsir (6/166), Ibn Abi Asim in Al-Sunnah (76), Al-Lalaka'i in I'tiqad Ahl al-Sunnah (1/124), Al-Marwazi in Al-Sunnah (1/61), and Abdullah Al-Ansari in Dhamm Al-Kalam wa Ahlih (3/110). Authenticated by Al-Albani as in Al-Mishkat (3/174) and Zilal al-Jannah (1/31).",
    "book_id": "1064",
    "new_page_number": 42
  },
  {
    "serial_number": "96080",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 44,
    "volume_number": 1,
    "text": "...and had taken a Dhat Anwat after his prohibition, they would have disbelieved. This is the intended point. However, the story indicates that a Muslim, indeed a scholar, may fall into types of Shirk without realizing it, which indicates the necessity of learning and precaution... It also indicates that if a Muslim Mujtahid (one who strives to reach the truth) speaks words of Kufr without realizing it, and is then alerted to it and repents immediately, he does not become a disbeliever, just as the Children of Israel and those who asked the Prophet (peace be upon him) did). (1)\n\nB. Some Important Issues\n1. Merely pronouncing the two testimonies (Shahada) is sufficient to judge a person as Muslim:\nSheikh al-Islam Ibn Taymiyyah (may Allah have mercy on him) said: \"It is known by necessity from the religion of the Messenger (peace be upon him), and agreed upon by the Ummah, that the foundation of Islam, and the first thing creation is commanded with, is the testimony that there is no god but Allah and that Muhammad is the Messenger of Allah. By it, the disbeliever becomes a Muslim, the enemy becomes an ally (Wali), and the one whose blood and wealth were lawful becomes protected in blood and wealth.\" (2)\nAl-Hafiz Ibn Hajar says: \"...And in the Hadith of Ibn Abbas (the Hadith of sending Mu'adh to Yemen), among the benefits is: Sufficing with the acknowledgment of the two testimonies to judge the Islam of a disbeliever.\" (3)\nSome researchers confuse the worldly judgment with the judgment in the Hereafter, so they think...",
    "foot_note": "1. Kashf al-Shubuhat, 45-46, by Sheikh Muhammad bin Abd al-Wahhab.\n2. See: Dar' Ta'arud al-Aql (8/7).\n3. Fath al-Bari (13/367).",
    "book_id": "1064",
    "new_page_number": 43
  },
  {
    "serial_number": "96081",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 45,
    "volume_number": 1,
    "text": "...that judging a person as Muslim entails judging him to be saved in the Hereafter. Or they think that the conditions mentioned by scholars for the word of Tawhid—such as knowledge, sincerity, certainty, etc.—mean that a person is not judged as Muslim until after these conditions are understood [by him]. But the truth is that mere pronunciation of the word of Tawhid does not save the servant before Allah unless its conditions are met. As for the worldly judgment, mere pronunciation is sufficient to judge a person as Muslim until what contradicts that becomes apparent to us after the proof is established. Thus, we realize the error of those who believe that those who fall into some forms of Shirk, like vowing and slaughtering for other than Allah and circumambulating graves, among those who testify the testimony of Tawhid, are original disbelievers (Kuffar Asliyun) on the basis that they did not understand Tawhid.\" (1)\n2. Establishment of Proof differs according to times, places, and persons:\nIbn Taymiyyah (may Allah have mercy on him) said: \"Many people may grow up in places and times where much of the knowledge of prophethood has been obliterated, to the extent that there remains no one to convey what Allah sent His Messenger with of the Book and Wisdom. Thus, he does not know much of what Allah sent His Messenger with, and there is no one there to convey it to him. Such a person does not become a disbeliever. Therefore, the Imams agreed that whoever grows up in a remote desert far from the people of knowledge and faith, and was new to Islam, and denied these apparent, widely known rulings...",
    "foot_note": "1. Nawaqid al-Iman al-I'tiqadiyyah by Al-Wuhaibi (1/237).",
    "book_id": "1064",
    "new_page_number": 44
  },
  {
    "serial_number": "96082",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 46,
    "volume_number": 1,
    "text": "...then he is not judged as a disbeliever until he knows what the Messenger brought.\" (1)\nIt is possible to analogize those who grow up in lands where Shirk and deviation are prevalent, and where the call to Tawhid is weak among them, to those new to Islam and those who grew up in a remote desert. Sheikh Muhammad bin Abd al-Wahhab said: \"If we do not declare as disbeliever the one who worships the idol on the grave of Abdul Qadir, and the idol on the grave of Ahmad Al-Badawi, and their likes, due to their ignorance and the lack of someone to alert them...\" (2)\nDr. Al-Wuhaibi says after quoting texts of scholars regarding the issue: \"We can extract from the previous sayings of the Imams the following:\n* The agreement of the Imams that the one new to Islam or one who grew up in a remote desert is excused for ignorance of the apparent, mass-transmitted (Mutawatir) rulings such as the obligation of prayer and Zakat and the prohibition of drinking wine, etc.\n* That whoever denies these matters in the Abode of Islam and Knowledge, and was not new to Islam, becomes a disbeliever merely by that. Thus, we realize the error of those who think that the ignorant person is never declared a disbeliever absolutely.\n* That there are apparent, mass-transmitted rulings upon which there is consensus, and hidden issues...",
    "foot_note": "1. Majmoo' al-Fatawa (11/407).\n2. Majmu'at al-Sheikh Fatawa wa Masa'il (9/11).",
    "book_id": "1064",
    "new_page_number": 45
  },
  {
    "serial_number": "96083",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 47,
    "volume_number": 1,
    "text": "...which are not apparent, but are only known through the elite among the people of knowledge. Regarding these, if one of the general public denies them, he does not become a disbeliever. However, if one of the elite denies them, he becomes a disbeliever if someone like him should not be ignorant of them.\n* Also, those who grow up in lands where Shirk and deviation are prevalent and the call to Tawhid is weak among them can be analogized to those new to Islam and those who grew up in a remote desert.\" (1)\n3. The Manner of Establishing Proof against a Specific Person:\nProof must be established that negates any doubt or interpretation from the one against whom it is established. Ibn Taymiyyah says: \"Likewise, regarding statements whose sayer becomes a disbeliever: The man may not have received the texts necessitating knowledge of the truth; or they may be with him but not established [as authentic] to him; or he was unable to understand them; or he may have encountered doubts for which Allah excuses him. So whoever among the believers strives in seeking the truth and errs, Allah forgives him his error whatever it may be, whether in theoretical or practical issues. This is what the Companions of the Prophet (peace be upon him) and the majority of the Imams of Islam are upon. They did not divide issues into fundamental issues (Usul) whose denial constitutes Kufr, and branch issues (Furu') whose denial does not constitute Kufr.\" (2)",
    "foot_note": "1. Nawaqid al-Iman al-I'tiqadiyyah (1/242).\n2. Majmoo' al-Fatawa (23/346).",
    "book_id": "1064",
    "new_page_number": 46
  },
  {
    "serial_number": "96084",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 48,
    "volume_number": 1,
    "text": "Imam Ibn Hazm (may Allah have mercy on him) says: \"Everything we said regarding the doer becoming a Fasiq (sinner) or Kafir is after the proof is established. As for before the proof is established against him, he is excused and rewarded even if he is mistaken. The nature of establishing proof against him is that it reaches him such that he has nothing to contradict it. And success is with Allah.\" (1)\nFrom here, the role of scholars in establishing proof against the ignorant person becomes clear, such that doubts are negated from him and ignorance is removed.\n\nSecond: Intent (Qasd) is a condition, and its impediment is Mistake (Khata):\nAmong the regulations of specific Takfir according to Ahlus Sunnah is that the person must have intended his action and not be mistaken in it.\nIntent (Qasd) linguistically: The straightness of the path. Qasada, Yaqsidu, Qasdan, so he is Qasid (intending). The Almighty's saying: {And upon Allah is the direction of the [right] way (Qasd al-Sabeel)} [Al-Nahl: 9] means upon Allah is the clarification of the straight path. Qasd also means justice (2).\nTechnically: Will (Irada). (3)",
    "foot_note": "1. Al-Ihkam, (1/67), by Ibn Hazm.\n2. Lisan al-Arab, (3/303) Entry (Q S D).\n3. Hashiyat al-Attar, (2/59).",
    "book_id": "1064",
    "new_page_number": 47
  },
  {
    "serial_number": "96085",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 49,
    "volume_number": 1,
    "text": "Mistake (Khata) linguistically: The opposite of correctness. (1)\nTechnically: Everything that issues from the accountable person (Mukallaf), in word or deed, devoid of his will and not accompanied by intent from him. (2)\n\nA. Evidences for the condition of Intent, and Excuse due to Mistake:\n1. The Almighty's saying: {Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us} [Al-Baqarah: 286]. It is established in the Sahih Hadith that Allah Glory be to Him answered this supplication and said: \"I have done so.\" (3)\n2. The Almighty's saying: {And there is no blame upon you for that in which you have erred but [only for] what your hearts intended} [Al-Ahzab: 5].\n3. The Hadith of Al-Nu'man bin Bashir from the Messenger of Allah (peace be upon him): \"Allah is more pleased with the repentance of His servant when he repents to Him than one of you who was on his mount in a desert land, and it escaped from him carrying his food and drink. He despaired of it, so he came to a tree and lay down in its shade, having despaired of his mount. While he was like that, behold, it was standing beside him. He took hold of its rein, then said out of intense joy: 'O Allah, You are my servant...",
    "foot_note": "1. Lisan al-Arab, (1/65-68) Entry (Kh T A).\n2. See: Al-Mufradat, 102.\n3. Recorded by Muslim, Book of Faith (1/80, 81) 344, 345.",
    "book_id": "1064",
    "new_page_number": 48
  },
  {
    "serial_number": "96086",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 50,
    "volume_number": 1,
    "text": "...and I am your Lord.' He made a mistake out of intense joy.\" (1)\n4. His saying (peace be upon him) as narrated by Ibn Abbas: \"Allah has overlooked for my Ummah mistake, forgetfulness, and what they are coerced into.\" (2) Al-Hafiz Ibn Rajab said in his explanation of this Hadith: \"Mistake: It is when one intends something by his action but his action results in other than what he intended, such as intending to kill a disbeliever but accidentally killing a Muslim. Forgetfulness is being aware of something then forgetting it at the time of action. Both are pardoned: meaning there is no sin in them. However, lifting the sin does not negate that a ruling may result from his forgetfulness; if he killed a believer by mistake, expiation (Kaffarah) and blood money (Diyyah) are upon him by the text of the Book. Likewise, if he destroyed another's property by mistake thinking it was his own property...\" (3)\n5. His saying (peace be upon him): \"If a judge rules and strives (makes Ijtihad) then is correct, he has two rewards. And if he rules and strives then errs, he has one reward.\" (4) Al-Hafiz Al-Khatib...",
    "foot_note": "1. Recorded by Muslim in Book of Repentance (8/91) 7136.\n2. Recorded with this wording by Ibn Majah (1/659), and Al-Tabarani in Al-Awsat (8/161). Al-Busiri said about this chain: This chain is authentic if it is free from interruption, but it appears to be interrupted. Misbah al-Zujajah (1/314). Authenticated by Al-Albani in Sahih Sunan Ibn Majah (5/45). The Hadith is narrated via paths from Ibn Umar, Abu Hurairah, Abu Bakrah, Uqbah bin Amir, Abu Dharr, Abu Darda, and Thawban (may Allah be pleased with them).\n3. Jami' al-Ulum wa al-Hikam, 352.\n4. Recorded by Al-Bukhari, Book of Holding Fast to the Book and Sunnah/Chapter: Reward of the Judge if he strives (18/344) 7352, and Muslim in Al-Aqdiyyah (3/1342) 1716.",
    "book_id": "1064",
    "new_page_number": 49
  },
  {
    "serial_number": "96087",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 51,
    "volume_number": 1,
    "text": "...Al-Baghdadi (may Allah have mercy on him) said: \"If it is said: How is it permissible for the mistaken one to have a reward for what he erred in, while he is closer to having a sin in that due to his slackness and negligence in Ijtihad until he erred? The answer: This is a mistake, because the Prophet (peace be upon him) did not assign the mistaken one a reward for his mistake. Rather, he assigned him a reward for his Ijtihad, and pardoned his mistake because he did not intend it. As for the correct one, he has a reward for his Ijtihad, and a reward for his correctness.\" (1)\nSheikh al-Islam says: \"As for 'Takfir': The correct view is that whoever strives (makes Ijtihad) from the Ummah of Muhammad (peace be upon him) and intends the truth but errs, does not become a disbeliever; rather, his error is forgiven. But whoever the Message brought by the Messenger becomes clear to, yet opposes the Messenger after guidance has become clear to him and follows other than the way of the believers: he is a Kafir. And whoever follows his desire, falls short in seeking the truth, and speaks without knowledge, he is a disobedient sinner; he may be a Fasiq (rebellious sinner), or he may have good deeds that outweigh his bad deeds.\" (2)\nAfter presenting the evidences, it becomes clear to us that the mistaken person is excused, and his ruling is the ruling of the ignorant and the interpreter (Muta'awwil). He is not declared a disbeliever except after the proof is established against him. If he was a Mujtahid in matters where Ijtihad is permissible, he has the reward of his Ijtihad even if he erred. But if he was not a Mujtahid and erred, he sins for his negligence.",
    "foot_note": "1. Al-Faqih wal-Mutafaqqih, (1/191).\n2. Majmoo' al-Fatawa, (12/180).",
    "book_id": "1064",
    "new_page_number": 50
  },
  {
    "serial_number": "96088",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 52,
    "volume_number": 1,
    "text": "Third: Will (Irada) is a condition, and its impediment is Compulsion (Ikrah):\nAmong the conditions of specific Takfir according to Ahlus Sunnah is that the person must be willing his action, not coerced into it.\nWill (Irada) linguistically: Volition (Mashia'ah).\nTechnically: In the usage of jurists, it is \"Intent\" (Qasd), meaning the determination to do the act and directing towards it (1).\nAs for Compulsion (Ikrah) linguistically: It is coercion and forcing without love, consent, or choice. (2)\nTechnically, it is: \"Compelling another to do what he does not want.\" Or \"Forcing [someone] to do a thing coercively\" (3).\n\nA. Types of Compulsion:\nThe majority of Usulis (legal theorists) and jurists divided compulsion into two types: Compulsion that leaves no choice (Mulji' - Resorting/Complete), which is Perfect Compulsion, and Compulsion that leaves some choice (Ghayr Mulji' - Non-Resorting/Incomplete), which is Imperfect Compulsion.\nResorting/Complete Compulsion (Perfect): That which befalls the self (life) of the coerced: leaving the person with no capability or choice, such as threatening a person with killing him or cutting off a limb...",
    "foot_note": "1. Al-Mawsu'ah al-Fiqhiyyah al-Kuwaitiyyah - (2/315).\n2. See: Lisan al-Arab 13/534.\n3. See: Fath al-Bari 12/311, Hashiyat al-Sharqawi 'ala Tuhfat al-Tullab 2/390.",
    "book_id": "1064",
    "new_page_number": 51
  },
  {
    "serial_number": "96089",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 53,
    "volume_number": 1,
    "text": "...of his limbs like his hand or leg, or with severe beating leading to his destruction, or destruction of all his wealth. So when it seems most likely to him that what he was threatened with will happen to him, it is permissible for him to do what he was pushed to do by the threat, considering him to be in a state of legal necessity (1).\nNon-Resorting/Incomplete Compulsion (Imperfect): It is the threat or warning with something less than loss of life or limb, such as frightening with beating, binding, imprisonment, or destruction of some wealth. This type spoils consent (Rida) but does not spoil choice (Ikhtiyar) because there is no necessity to perform what he was coerced into, due to his ability to endure what he was threatened with (2).\nAttached to this type may be the threat of imprisoning the father, son, wife, sister, mother, or brother. There is a dispute regarding considering this section as a type of compulsion (3). Juristic Preference (Istihsan) counts it as compulsion, because the coerced person is afflicted with distress...",
    "foot_note": "1. See Al-Ikrah wa Atharuhu fi 'Uqud al-Mufawadat al-Maliyyah by Dr. Ibrahim Al-Urwan, Al-Bada'i' by Al-Kasani 7/175, Hashiyat Ibn Abidin 5/109. See regarding the difference between compulsion and necessity: Al-Tashri' al-Jina'i 1/576, 577, and Al-Ikrah wa Atharuhu fi al-Tasarrufat, Dr. Muhammad Al-Ma'ini 37-44.\n2. See Kashf al-Asrar by Al-Bazdawi 4/383, Tabyin al-Haqa'iq by Al-Zayla'i 5/181, Hashiyat Ibn Abidin 5/109.\n3. Some Hanafis went to consider this section a third type, while the rest of the jurists included it in the previous two types. See Kashf al-Asrar 4/383, Al-Ikrah wa Atharuhu fi al-Tasarrufat by Dr. Isa Shaqrah 61.",
    "book_id": "1064",
    "new_page_number": 52
  },
  {
    "serial_number": "96090",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 54,
    "volume_number": 1,
    "text": "...concern, sadness, and constriction if harm befalls one of his close relatives (Mahrams), so he is driven to commit what he was ordered to do, just as if the harm, or worse, befell him (1).\nImam Ibn Qudamah (may Allah have mercy on him) said: (If he is threatened with the torture of his child, it has been said it is not compulsion because the harm befalls another. The more correct view is that it is compulsion because that is greater to him than taking his wealth. Since the threat of that [wealth] is compulsion, then this is likewise) (2) (3).\n\nB. Evidences for the condition of Will, and Excuse due to Compulsion:\nThe Imams of Ahlus Sunnah wal-Jama'ah agreed that compulsion to commit Kufr, with its legal regulations and conditions, is considered one of the impediments to Takfir regarding a specific person. The evidences for that include:\n1. The Almighty's saying: {Whoever disbelieves in Allah after his belief... except for one who is forced [to renounce his religion] while his heart is secure in faith. But those who [willingly] open their breasts to disbelief, upon them is wrath from Allah, and for them is a great punishment} [Al-Nahl: 106].",
    "foot_note": "1. See Al-Ikrah wa Atharuhu fi al-Tasarrufat, Dr. Isa Shaqrah, 60, 61. See for the preference of that: Al-Mabsut by Al-Sarakhsi 24/143, 144.\n2. Al-Mughni 7/120. See in that regard Mughni al-Muhtaj by Al-Shirbini 3/290, Asna al-Matalib 3/283, Fath al-Bari 12/324.\n3. Nawaqid al-Iman al-I'tiqadiyyah by Al-Wuhaibi Vol 2 p 15-16.",
    "book_id": "1064",
    "new_page_number": 53
  },
  {
    "serial_number": "96091",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 55,
    "volume_number": 1,
    "text": "The famous reason for its revelation is what Abu Ubaydah bin Muhammad bin Ammar bin Yasir narrated from his father, who said: (The polytheists seized Ammar bin Yasir and did not leave him until he reviled the Prophet (peace be upon him) and mentioned their gods with good. Then they left him. When he came to the Messenger of Allah (peace be upon him), he said: 'What is behind you?' He said: 'Evil, O Messenger of Allah. I was not left until I insulted you and mentioned their gods with good.' He said: 'How do you find your heart?' He said: 'Secure in faith.' He said: 'If they return, then return [to saying it].') (1)\nAl-Hafiz Ibn Kathir said in the Tafsir of His saying {except for one who is forced [to renounce his religion] while his heart is secure in faith}: (This is an exception for the one who disbelieves with his tongue and agrees with the polytheists in wording while coerced, due to the beating and harm that befell him, while his heart refuses what he says and is secure in faith in Allah and His Messenger) (2).\nImam Al-Shawkani said: {But those who [willingly] open their breasts to disbelief} means they believed and their souls were pleased with it and rested in it (3). Therefore, tranquility of the heart with faith, and hatred and dislike of Kufr, are necessary...",
    "foot_note": "1. Recorded by Al-Tabari in his Tafsir (17/304), Ibn Sa'd in Al-Tabaqat (3/249), Al-Bayhaqi in Al-Kubra (8/208), Al-Hakim in Al-Mustadrak (2/389), and he said: Authentic chain and they did not record it, and Al-Dhahabi agreed with him. Ibn Hajar mentioned other Mursal paths for it then said: These Mursal narrations strengthen each other (Al-Fath 12/312).\n2. Tafsir Ibn Kathir 2/587.\n3. Fath al-Qadir 3/196.",
    "book_id": "1064",
    "new_page_number": 54
  },
  {
    "serial_number": "96092",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 56,
    "volume_number": 1,
    "text": "...and this is a condition agreed upon) (1) (2).\n2. And the saying of the Prophet (peace be upon him): (Allah has overlooked for my Ummah mistake, forgetfulness, and what they are coerced into) (3).\n\nC. Conditions of Compulsion:\nNot everyone who claims compulsion is accepted. Rather, there are conditions that must be met for the compulsion to be considered valid and effective regarding what the accountable person undertakes of words, deeds, or abandonment. These conditions are:",
    "foot_note": "1. Some jurists stipulated for pronouncing the word of Kufr that the compulsion be Complete (Resorting). Others stipulated using ambiguity (Ta'reed) and equivocation (Tawriyah) regarding Kufr during compulsion, but they did not support their words with valid evidence. See some of these opinions in Bada'i' al-Sana'i' 7/177, Hashiyat Ibn Abidin 6/134, Ahkam al-Quran by Ibn al-Arabi 3/1178 and Ahkam al-Jassas 3/192, 194, Al-Ikrah wa Atharuhu fi al-Tasarrufat by Dr. Isa Shaqrah 115-118, and Al-Ikrah wa Atharuhu fi al-Ahkam by Dr. Abd al-Fattah al-Sheikh 63-66.\n2. Nawaqid al-Iman al-I'tiqadiyyah wa Dawabit al-Takfir by Dr. Muhammad Al-Wuhaibi Vol 2 p 17-18.\n3. From the Hadith of Ibn Abbas, recorded by Ibn Hibban (16/202), Al-Bayhaqi in Al-Kubra (7/356) (10/60) and in Al-Ma'rifah (12/2299) (15/327), Al-Tabarani in Al-Kabir (9/340) and Al-Saghir (2/52), Al-Tahawi in Sharh Ma'ani al-Athar (3/95), Ibn Hazm in Al-Ahkam (5/713). Al-Nawawi classified its chain as Hasan in Al-Arba'in Hadith 39, and Al-Albani authenticated it in Al-Mishkat due to its paths (3/372). The Hadith is narrated via paths from Ibn Umar, Abu Hurairah, Abu Bakrah, Uqbah bin Amir, Abu Dharr, Abu Darda, and Thawban (may Allah be pleased with them).",
    "book_id": "1064",
    "new_page_number": 55
  },
  {
    "serial_number": "96093",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 57,
    "volume_number": 1,
    "text": "1. That the coercer is capable of carrying out what he threatened, because compulsion is not realized except with capability. If he is not capable, the compulsion has no meaning or consideration.\n2. That the coerced person is incapable of defending himself by fleeing, seeking help, resisting, or the like.\n3. That it seems most likely to him that the threat will occur if he does not do what is asked of him (1).\nHowever, we should know that although saying or doing Kufr due to compulsion is permissible, patience is better and greater in reward. Ibn Battal (may Allah have mercy on him) said: (They agreed that whoever is coerced into Kufr and chooses death, has a greater reward with Allah than the one who chooses the license) (2).\nImam Ibn Al-Arabi (may Allah have mercy on him) says: (Although Kufr under compulsion is permissible according to scholars, whoever is patient over the trial and does not succumb to temptation until he is killed is a martyr (Shahid); there is no disagreement on that. The traditions of the Sharia indicate this, the listing of which would be long...) (3).\nAl-Hafiz Ibn Kathir (may Allah have mercy on him) said: (It is better and more appropriate for the Muslim to remain firm...",
    "foot_note": "1. Nawaqid al-Iman al-I'tiqadiyyah by Al-Wuhaibi (2/15).\n2. Fath al-Bari 12/317. See Tafsir Al-Qurtubi 10/188.\n3. Ahkam al-Quran 3/1179.",
    "book_id": "1064",
    "new_page_number": 56
  },
  {
    "serial_number": "96094",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 58,
    "volume_number": 1,
    "text": "...on his religion even if it leads to his killing) (1).\nThey cited many Hadiths for this. Among the most famous is the Hadith of Khabbab bin Al-Aratt (may Allah be pleased with him), in which the Prophet (peace be upon him) said: (Among those before you, a man would be taken and a pit dug for him in the earth and he would be placed in it. Then a saw would be brought and placed on his head, splitting him into two halves, and he would be combed with iron combs separating his flesh from his bones, yet that would not turn him away from his religion) (2).\nImam Al-Qurtubi (may Allah have mercy on him) said: (The Prophet (peace be upon him) described this regarding past nations by way of praising them, and for patience over what is disliked for the sake of Allah, and that they did not disbelieve outwardly while concealing faith inwardly to ward off punishment from themselves. This is proof for whoever prefers beating, killing, and humiliation over the license...) (3).\nPatience is emphasized for the one whom the common people emulate and follow in his actions and words. In this meaning is the saying of the Imam of Ahlus Sunnah Ahmad bin Hanbal (may Allah have mercy on him) when asked about the scholar and whether he can practice Taqiyyah (dissimulation). He said: (If the scholar answers out of Taqiyyah, and the ignorant is ignorant, then when will the truth become clear?) (4)",
    "foot_note": "1. Tafsir Ibn Kathir 2/588. See Al-Mughni 8/146, and Ahkam al-Quran by Al-Jassas 3/192.\n2. Recorded by Al-Bukhari, Book of Compulsion/Chapter: Whoever chooses beating, killing, and humiliation over Kufr (17/364) 6943.\n3. Tafsir Al-Qurtubi 10/188.\n4. See: Nawaqid al-Iman by Al-Wuhaibi Vol 2 p 18.",
    "book_id": "1064",
    "new_page_number": 57
  },
  {
    "serial_number": "96095",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 59,
    "volume_number": 1,
    "text": "Fourth: Lack of Interpretation (Ta'wil) is a condition, and its impediment is Interpretation:\nTa'wil in language: The root (Awl) in all its linguistic usages conveys the meaning of return and reverting. (1)\nTa'wil in terminology: In the terminology of scholars, Ta'wil has three meanings:\nFirst: That Ta'wil means the reality to which the speech leads (Actualization). This is the meaning intended by the word Ta'wil in the Quran and Sunnah, such as His saying: {Do they await except its result (Ta'wil)? The Day its result (Ta'wil) comes those who disregarded it before will say, \"The messengers of our Lord had come with the truth...\"} [Al-A'raf: 53]. And from it is the saying of Aisha (may Allah be pleased with her): (The Messenger of Allah (peace be upon him) used to say frequently in his bowing and prostration: 'Glory be to You, O Allah, our Lord, and praise be to You. O Allah, forgive me,' acting upon (Yata'awwal) the Quran) (2).\nSecond: The word Ta'wil means: (Tafsir/Explanation). This is the terminology of many exegetes (Mufassirin).\nThird: That the word (Ta'wil) means: Diverting the wording from the probable meaning to the improbable meaning due to evidence associated with it (3). This is the Ta'wil which...",
    "foot_note": "1. Lisan al-Arab 11/32-34 Entry (A W L).\n2. Recorded by Al-Bukhari, Adhan, Chapter: Tasbih and Dua in Sujud (2/228) 817, and Muslim, Prayer (2/50) 1113.\n3. Majmoo' al-Fatawa 4/68-70. See 3/54-68, 5/28-36, 13/277-313, Al-Sawa'iq al-Mursalah 1/175-233, Sharh Al-Tahawiyyah 231-236.",
    "book_id": "1064",
    "new_page_number": 58
  },
  {
    "serial_number": "96096",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 60,
    "volume_number": 1,
    "text": "...most of the later scholars meant when discussing issues of Attributes and Decree and the like. It is one of the greatest sources of deviation and misguidance, as it became a pretext for the extremist Jahmiyyah, Batinis, and Sufis to interpret legal obligations contrary to their intent, or to drop them, or to interpret all Names and Attributes metaphorically.\nThe meaning of Ta'wil intended here is: Falling into and committing Kufr while interpreting (misunderstanding), without intending Kufr. (1)\n\nA. Types of Interpretation\n• The Interpreter Excused for his Mistake:\nThe Mujtahid, if he is correct, has two rewards. If he strives and errs, he has one reward. The interpreter (Muta'awwil) is a Mujtahid. So is he rewarded and excused for his mistake always and forever? We have before us a number of texts from which it is understood: That the mistaken interpreter is excused if the motive for his interpretation is a proof that is plausible in appearance, even if he is mistaken in reality. Al-Bukhari dedicated a chapter to \"What came regarding those who interpret\" in the Book of \"Repentance of Apostates and Stubborn Opposers and Fighting Them\" in his Sahih. He mentioned four Hadiths indicating the condition in which the interpreter is excused and not held accountable for his mistake. He mentioned:",
    "foot_note": "1. Al-Iman Haqiqatuhu, Khawarimuhu, Nawaqiduhu 'inda Ahlis Sunnah wal-Jama'ah by Abdul Rahman Al-Mahmoud p 127.",
    "book_id": "1064",
    "new_page_number": 59
  },
  {
    "serial_number": "96097",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 61,
    "volume_number": 1,
    "text": "1. The Hadith of Umar bin Al-Khattab rebuking Hisham bin Hakim for reciting Surah Al-Furqan differently from how the Messenger of Allah (peace be upon him) taught it to him, and accusing him of lying about hearing it from the Messenger of Allah (peace be upon him) (1). The point of evidence in the Hadith: The Messenger of Allah (peace be upon him) did not rebuke Umar for accusing Hisham bin Hakim of lying and being harsh with him by dragging him by his collar, because Umar was excused, thinking that the Quran does not have multiple ways of recitation. So Umar took by the apparent situation, thus his interpretation was plausible. Ibn Hajar said: \"Its relevance to the chapter heading is that the Prophet (peace be upon him) did not hold Umar accountable for accusing Hisham of lying, nor for gathering his garment at his neck and wanting to punish him. Rather, he verified Hisham in what he narrated, and excused Umar's denial, and did no more than explain the proof for the permissibility of the two readings\" (2).\n2. The Hadith of the Companions interpreting 'Zulm' (Injustice/Wrongdoing) in His saying: {Those who believe and do not mix their belief with injustice} [Al-An'am: 82], generally, and that this distressed them until the Messenger of Allah (peace be upon him) explained to them that it is Shirk, as in the verse of Luqman {Indeed Shirk is great injustice} [Luqman: 13].",
    "foot_note": "1. Sahih Al-Bukhari with Sharh Al-Asqalani 12/216.\n2. Previous Reference 12/323.",
    "book_id": "1064",
    "new_page_number": 60
  },
  {
    "serial_number": "96098",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 62,
    "volume_number": 1,
    "text": "The witness in the Hadith: The Companions were excused in their understanding when they carried 'Zulm' on its absolute and general meaning, which is all sins, because that is the apparent meaning familiar in the language of the Arabs. So it was a plausible interpretation even if mistaken in reality. Therefore, the Prophet (peace be upon him) did not rebuke them for understanding that. Ibn Hajar said: \"The reason for its inclusion in the chapter is that he (peace be upon him) did not hold the Companions accountable for carrying 'Zulm' in the verse on its generality to include every sin; rather, he excused them because it is apparent in interpretation, then he explained to them the intended meaning which removed the confusion\" (1).\n3. The Hadith of Itban bin Malik who says: \"The Messenger of Allah (peace be upon him) came to me in the morning... A man said: Where is Malik bin Al-Dukhshun? A man from among us said: That is a hypocrite who does not love Allah and His Messenger. The Prophet (peace be upon him) said: 'Do not say that. Does he not say There is no god but Allah seeking thereby the face of Allah?' He said: Yes. He said: 'For indeed, no servant meets [Allah] on the Day of Resurrection with it except that Allah forbids the Fire for him.'\" The witness in the Hadith: The Messenger of Allah (peace be upon him) did not hold accountable those who spoke against Malik bin Al-Dukhshun describing him as a hypocrite; rather, he explained that rulings of Islam are applied to the apparent, not the inner secrets (2).\n4. The Hadith in which Umar bin Al-Khattab asked the Messenger of Allah (peace be upon him) to...",
    "foot_note": "1. Fath al-Bari 12/318.\n2. Previous Source.",
    "book_id": "1064",
    "new_page_number": 61
  },
  {
    "serial_number": "96099",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 63,
    "volume_number": 1,
    "text": "...strike the neck of Hatib bin Abi Balta'a after he sent [a letter] to Quraysh informing them of the Messenger's march (peace be upon him) to them to conquer Mecca. Umar requested to strike his neck saying: \"He has betrayed Allah, His Messenger, and the believers.\" In some narrations he described him as a hypocrite and in others as a disbeliever (1). The witness in the Hadith: The Messenger of Allah (peace be upon him) did not rebuke or hold Umar accountable for speaking harshly to Hatib due to his writing to Quraysh and describing him as a traitor. Rather, he excused him because the apparent situation indicated that (2), for spying on the Muslim army in a way that leads to the complete failure of its plan and its entrapment is not usually done except by a hypocrite or a treacherous disbeliever. Therefore, the Messenger of Allah (peace be upon him) did not scold Umar for his saying and his intent to kill him.\n\nScholars' statements on the Interpretation for which the owner is excused:\n1. Ibn Hajar said regarding the regulation of rejected interpretation for which the owner is excused and not blamed: \"The scholars said: Every interpreter is excused by his interpretation and is not sinful if his interpretation is plausible in the Arabic language and has a basis in knowledge.\" (3) This is what the Permanent Committee for Scholarly Research and Ifta in Saudi Arabia stated, saying: \"The excused mistaken one is the one who errs in theoretical issues subject to Ijtihad, not the one who errs in what is established by explicit text, nor...",
    "foot_note": "1. Previous Source.\n2. Previous Source.\n3. Previous Source.",
    "book_id": "1064",
    "new_page_number": 62
  },
  {
    "serial_number": "96100",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 64,
    "volume_number": 1,
    "text": "...in what is known from the religion by necessity.\" (1)\n2. Imam Ibn Hazm (may Allah have mercy on him) says: (Whoever receives a command from the Messenger of Allah (peace be upon him) via an established path, and is a Muslim, then interprets contrary to it, or rejects what reached him based on another text; as long as the proof has not been established regarding his error in leaving what he left and taking what he took, he is rewarded and excused, due to his intent for the truth and his ignorance of it. But if the proof is established against him in that regard and he remains obstinate, there is no interpretation [excuse] after the establishment of proof). (2)\n3. Sheikh al-Islam Ibn Taymiyyah (may Allah have mercy on him) established this in several places and used the story of the man from the Children of Israel, Qudamah bin Maz'un, and others as evidence. He said (may Allah have mercy on him): (Takfir is part of the Threat. For even if a saying is a denial of what the Messenger (peace be upon him) said, the man might be new to Islam, or raised in a remote desert. Such a person does not become a disbeliever by denying what he denies until the proof is established against him. The man might not have heard those texts, or heard them but they were not established [as authentic] to him, or another contradictory factor opposed them in his view necessitating their interpretation, even if he was mistaken. I always mention the Hadith in the two Sahihs regarding the man who said: 'When I die, burn me, then crush me, then scatter me in the sea; for by Allah, if Allah is able to get hold of me, He will punish me with a punishment He has not punished anyone of the worlds with.' So they did that to him...",
    "foot_note": "1. Fatawa of the Permanent Committee for Scholarly Research and Ifta by Ahmad Al-Duwaish 2/39.\n2. Al-Durrah fima yajib I'tiqaduhu by Ibn Hazm 414.",
    "book_id": "1064",
    "new_page_number": 63
  },
  {
    "serial_number": "96101",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 65,
    "volume_number": 1,
    "text": "...Then Allah said to him: 'What carried you to do what you did?' He said: 'Fear of You.' So Allah forgave him) (1). This man doubted the capability of Allah and His resurrection of him if he was scattered; rather, he believed he would not be resurrected. This is Kufr by the consensus of Muslims. However, he was ignorant and did not know that, and was a believer who feared Allah would punish him, so He forgave him for that. The interpreter (Muta'awwil) from the people of Ijtihad who is eager to follow the Messenger (peace be upon him) is more deserving of forgiveness than such a person) (2). He also said: (A saying might be Kufr, like the statements of the Jahmiyyah who said: Allah does not speak and is not seen in the Hereafter. However, it might be hidden from some people that it is Kufr, so the statement declaring the sayer a Kafir is released generally, as the Salaf said: 'Whoever says the Quran is created is a Kafir,' and 'Whoever says Allah is not seen in the Hereafter is a Kafir.' But the specific person is not declared a Kafir until the proof is established against him as mentioned previously. Like the one who denied the obligation of prayer and Zakat, and legalized alcohol and adultery interpreting [texts]; for the appearance of those rulings among Muslims is greater than the appearance of these [theological issues]. If the mistaken interpreter in those matters is not judged as a Kafir until after clarification to him and seeking his repentance, as the Companions did regarding the group who legalized alcohol) (3), then in other matters...",
    "foot_note": "1. Its referencing preceded.\n2. Majmoo' al-Fatawa 3/231.\n3. Like Qudamah bin Maz'un and his companions (may Allah be pleased with them). Recorded by Al-Nasa'i in Al-Kubra (3/253), Al-Bayhaqi in Al-Kubra (8/315), Abd al-Razzaq in his Musannaf (9/240), Abu Nu'aym Al-Asbahani in Tathbit Al-Imamah wa Tartib Al-Khilafah (1/127), and Ibn Shabbah Al-Numayri in Tarikh Al-Madinah Al-Nabawiyyah (2/65).",
    "book_id": "1064",
    "new_page_number": 64
  },
  {
    "serial_number": "96102",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 66,
    "volume_number": 1,
    "text": "...it is even more appropriate and fitting...) (1) (2)\n\n• The Interpreter Not Excused for his Mistake\nHowever, if the interpreter has no apparent proof for his interpretation, such that he interprets definitive matters (Qat'iyyat) regarding which ignorance is not an excuse for people like him, then he sins and may become a disbeliever by his interpretation depending on his state. Because there is no disagreement among Muslims that if a man openly denies apparent, mass-transmitted obligations, and apparent prohibitions, and the like, he is asked to repent, otherwise he is killed as a disbelieving apostate. This is contrary to the Murji'ah who say: 'No sin harms with Faith, just as no obedience benefits with Kufr' (3).\nThe commentator of Al-Tahawiyyah said: \"A man may be a believer inwardly and outwardly but interprets with an interpretation in which he errs, either striving (Mujtahid) or negligent and sinful. It is not said: His faith is nullified merely for that, unless a legal proof indicates that. Rather, this is of the same genus as the saying of the Kharijites and Mu'tazilah (i.e., absolute Takfir). Nor do we say he does not disbelieve (like the Murji'ah). Rather, justice is the middle path: That false, innovated, prohibited statements which imply negating what the Messenger affirmed or affirming what he negated, or commanding what he forbade or forbidding what he commanded: the truth is spoken regarding them, and the Threat indicated by texts is established for them, and it is explained that they are Kufr, and it is said: Whoever says them is a Kafir...",
    "foot_note": "1. Majmoo' al-Fatawa 7/619.\n2. Nawaqid al-Iman by Dr. Muhammad Al-Wuhaibi Vol 2 p 23-33.\n3. Sharh Al-Aqeedah Al-Tahawiyyah - verified by Al-Albani - p 316.",
    "book_id": "1064",
    "new_page_number": 65
  },
  {
    "serial_number": "96103",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 67,
    "volume_number": 1,
    "text": "...As for the specific person, if it is said: Do you testify that he is from the people of the Threat and that he is a Kafir? We do not testify against him except with a matter with which testimony is permissible. For it is the greatest oppression to testify against a specific person that Allah will not forgive him and will not have mercy on him, but rather will keep him eternally in the Fire; for this is the ruling on the Kafir after death. However, this abstention regarding the matter of the Hereafter does not prevent us from punishing him in this world to prevent his innovation, and asking him to repent; if he repents [good], otherwise we kill him... If the saying itself is Kufr: it is said that it is Kufr, and the sayer of it becomes Kafir with conditions and absence of impediments. This does not happen unless he is a hypocritical heretic (Zindiq). For it is not conceivable that anyone from the People of the Qibla who outwardly display Islam becomes a disbeliever unless he is a hypocritical Zindiq\" (1).\nThus, the interpreter may become a disbeliever and not be excused for his ignorance or error in his Ijtihad, and his saying is judged as Kufr, and it is said: Whoever says this is a Kafir. However, he is not declared a Kafir [personally] nor judged to be eternally in the Fire [immediately], but he is asked to repent; if he repents [good], otherwise he is killed and his affair is with Allah.\nThe commentator of Al-Tahawiyyah cited evidences for this, including:\n1. The Companions seeking the repentance of Qudamah bin Maz'un when he drank wine after its prohibition, he and a group, interpreting the Almighty's saying: {There is not upon those who believe and do righteous deeds any blame concerning what they have eaten [in the past] if they [now] fear Allah and believe and do righteous deeds...} [Al-Ma'idah: 93].",
    "foot_note": "1. Previous Source.",
    "book_id": "1064",
    "new_page_number": 66
  },
  {
    "serial_number": "96104",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 68,
    "volume_number": 1,
    "text": "Umar bin Al-Khattab, Ali bin Abi Talib, and all the Companions agreed that if they admitted to the prohibition, they would be flogged the prescribed punishment for alcohol, and if they persisted in declaring it lawful, they would be killed, i.e., for apostasy. This which the Companions agreed upon is agreed upon among the Imams of Islam (1). So Umar and the Companions did not excuse these people in their ignorance of the prohibition of alcohol nor in their interpretation. Because that had become known, famous, and established. They were not new to Islam, so the doubt occurring to them had no consideration if they persisted in declaring it lawful. So whoever carries texts on distant meanings not intended by the Lawgiver and persists on them after the proof is clarified, he becomes a disbeliever if that leads to legalizing mass-transmitted prohibitions or denying mass-transmitted obligations.\n\nSummary of the ruling on the Mistaken Interpreter:\n1. That if his interpretation has a plausible aspect in the language or is indicated by context and the apparent situation, then its owner is excused and not sinful, even if his interpretation is a mistake in reality.\n2. That he is sinful and bears a burden if he forces an interpretation without justification from language or context.",
    "foot_note": "1. Previous Reference.",
    "book_id": "1064",
    "new_page_number": 67
  },
  {
    "serial_number": "96105",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 69,
    "volume_number": 1,
    "text": "3. That he may become a disbeliever if he interprets texts in a way that leads to legalizing mass-transmitted prohibitions or denying mass-transmitted obligations regarding which people like him are not excused for ignorance.\n4. That innovated, prohibited statements which imply affirming what the text negated or negating what it affirmed, or commanding what it forbade or forbidding what it commanded: the Threat established by texts applies to them, and it is said regarding them: Whoever says them is a Kafir absolutely without specification.\n5. That this abstention in judging the specific person regarding the Hereafter does not prevent us from applying worldly rulings to him, such as seeking his repentance; if he repents [good], otherwise he is killed.\n6. That it is not a condition for the mistaken interpreter in definitive matters to intend to leave Islam; rather, he may become a disbeliever and exit the Religion without intent from him, despite his belief in Islam generally.",
    "foot_note": "None",
    "book_id": "1064",
    "new_page_number": 68
  },
  {
    "serial_number": "96106",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 70,
    "volume_number": 1,
    "text": "Conclusion\nPraise be to Allah, abundant, good, and blessed praise. And peace and blessings be upon the most noble of Prophets and Messengers. After Allah has bestowed upon me the completion of this research, among the most important results and recommendations are:\n1. Clarifying the moderation of Ahlus Sunnah wal-Jama'ah between the extremism of the Kharijites and the negligence of the Murji'ah in the issue of Takfir.\n2. Takfir is a legal ruling and a right belonging to the Lord of the Worlds. It is not permissible for the common Muslims to delve into it, because it is a slippery slope causing stumbles. Rather, it is undertaken by the people of knowledge who are firmly grounded.\n3. Differentiating between Takfir by description (general) and Takfir by person (specific).\n4. Caution in declaring a specific person a disbeliever, and the danger of declaring him a disbeliever without proof.\n5. The principle regarding a Muslim is uprightness. He is not declared a disbeliever except after the meeting of the conditions of Takfir—Knowledge, Intent, Will, and Lack of Interpretation—and the absence of impediments—Ignorance, Mistake, Compulsion, and Interpretation.\n6. Incorporating the topics of Takfir, the methodology of Ahlus Sunnah wal-Jama'ah regarding it, and its applications into the curricula of public education and higher education, and for non-specialists...",
    "foot_note": "None",
    "book_id": "1064",
    "new_page_number": 69
  },
  {
    "serial_number": "96107",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Regulations of Takfir in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadarah for Publishing and Distribution",
    "page_number": 71,
    "volume_number": 1,
    "text": "...such as dedicating one of the units of the Islamic Culture course to it.\n7. Printing research papers on Takfir after simplifying them and bringing them closer to the common people, distributing them in gathering places like hospitals and airports, and uploading them to the Web to educate the society in all its segments about issues of Takfir and immunize the society against the ideology of Takfiri groups.\n8. Adopting educational campaigns in youth circles inside and outside universities to discuss issues of Takfir and answer doubts regarding this issue, provided that the presentation is attractive and dialogic.\n9. Holding competitions regarding books on Takfir according to Ahlus Sunnah wal-Jama'ah and allocating valuable prizes for winners.\n10. Holding media programs by legal specialists to discuss issues of Takfir and marketing these programs well.\nAnd may Allah send peace and blessings upon our Prophet Muhammad.",
    "foot_note": "None",
    "book_id": "1064",
    "new_page_number": 70
  }
]