[
  {
    "text": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette\nAuthor: أحمد بن سيف الدين تركستاني\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 1
  },
  {
    "text": "sn: 8277\nbook_title: الحوار مع أصحاب الأديان مشروعيته وشروطه وآدابه\nbook_link: https://shamela.ws/book/1132\nbook_id: 1132\nauthor_name: أحمد بن سيف الدين تركستاني\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/332\nauthor_ID: 332\neditor: Null\npublisher: الكتاب منشور على موقع وزارة الأوقاف السعودية بدون بيانات\nedition: Null\npages: 61\nvolumes: Null\npagination: [الكتاب مرقم آليا غير موافق للمطبوع]\ncategory: كتب عامة\ncategory_id: 39",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 2
  },
  {
    "serial_number": "7490144",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: General Books\nBook: Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette\nAuthor: Ahmed bin Saif Al-Din Turkistani\nNumber of pages (Paper Book): 39 [The book is automatically numbered, not matching the printed version]\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 3
  },
  {
    "serial_number": "7490145",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 1,
    "volume_number": 1,
    "text": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette\n\nPrepared by Dr. Ahmed bin Saif Al-Din Turkistani\nAssociate Professor, Department of Media\nCollege of Da'wah and Media - Imam University\n\nIn the name of Allah, the Most Gracious, the Most Merciful\n\nPreface\n\nPraise be to Allah, Lord of the Worlds, and peace and blessings be upon the Master of Prophets and Messengers, our Prophet Muhammad, and upon his family and companions all together. To proceed:\n\nOne could term this era the era of cultural convergence, coexistence, and dialogue. What Professor Marshall McLuhan predicted about forty years ago has largely come true, as the technological push has moved forward faster than what was in the mind of that pioneering media theorist. Who would have imagined a few decades ago that the World Wide Web (the Internet) could connect the world in this manner, whether by transmitting information instantly or by allowing dialogue across the globe with complete freedom and minimal costs—often merely nominal?! This is in addition to the progress that has occurred in other means of communication, the ease of travel and transportation, trade exchange, and other means that provide countless opportunities for meetings between peoples and learning about various cultures and civilizations.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 4
  },
  {
    "serial_number": "7490146",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 2,
    "volume_number": 1,
    "text": "The recession of the Cold War and the end of the old international political polarization came to provide cultural and intellectual opportunities that could reduce the scourges of fanaticism, lying in wait for the other, and the insistence on intellectual invasion. It has become more possible than before to spread ideas naturally without—mostly—parties and states standing behind them, but rather unorganized and not well-funded groups exerting their effort to spread their ideas quietly without the historically known obstacles. This situation is closer to achieving peaceful cultural coexistence and civilizational exchange that opens opportunities for all parties. This matter invites us to consider how to benefit from these available opportunities in dialogue and presenting opinions away from coercion and compulsion. It also leads us to the status of dialogue with the \"other\" in our Islamic religion and our long heritage.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 5
  },
  {
    "serial_number": "7490147",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 3,
    "volume_number": 1,
    "text": "The dialogue of Muslims with people of other religions has never ceased, because it is recorded in the Holy Quran and Muslims recite it morning and evening in many verses, such as the Almighty's saying: {Say, \"O People of the Scripture, come to a word that is equitable between us and you - that we will not worship except Allah and not associate anything with Him...\"} (Al Imran / 64), and His saying: {O People of the Scripture, why do you confuse the truth with falsehood and conceal the truth while you know [it]?} (Al Imran / 71), and His saying: {Say, \"O People of the Scripture, you are [standing] on nothing until you uphold the [law of the] Torah, the Gospel, and what has been revealed to you from your Lord.\"} (Al-Ma'idah / 68), and His saying: {Say, \"Who revealed the Scripture that Moses brought as light and guidance to the people? You [Jews] make it into pages, disclosing [some of] it and concealing much. And you were taught that which you knew not - neither you nor your fathers.\"} (Al-An'am / 91), and His saying: {And indeed, those who were given the Scripture know that it is the truth from their Lord.} (Al-Baqarah / 144), and His saying: {And if you brought...",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 6
  },
  {
    "serial_number": "7490148",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 4,
    "volume_number": 1,
    "text": "...to those who were given the Scripture every sign, they would not follow your qiblah. Nor will you be a follower of their qiblah. Nor would they be followers of one another's qiblah. So if you were to follow their desires after what has come to you of knowledge, indeed, you would then be among the wrongdoers.} (Al-Baqarah / 145), and other verses of the Wise Remembrance that mention scenes of dialogue between Muslims and the People of the Book. These verses number in the dozens and permeate many chapters of the Holy Quran.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 7
  },
  {
    "serial_number": "7490149",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 5,
    "volume_number": 1,
    "text": "In the biography (Seerah) of the Prophet, peace and blessings be upon him, there are numerous instances of conversation and dialogue with the People of the Book, starting with the story of Bahira the monk who saw the seal of prophethood on the Prophet's back, peace be upon him, and advised good care for the Prophet, peace be upon him; and Waraqa bin Nawfal the Christian who said when he learned of the revelation: \"This is the Great Namus (Archangel Gabriel) who came to Moses.\" Ibn Hisham, the historian of the Prophet's biography, narrates regarding his dialogue, peace be upon him, with the Jews about the Spirit (Ruh): \"Ibn Ishaq said: I was told on the authority of Ibn Abbas that he said: 'When the Messenger of Allah, peace be upon him, arrived in Medina, the Jewish rabbis said: O Muhammad, what do you say about your statement: {And you have not been given of knowledge except a little}? Do you mean us, or your own people? He said: No [I mean everyone]. They said: But you recite in what has come to you that we have been given the Torah, and in it is the explanation of everything. The Messenger of Allah, peace be upon him, said: It is but a little in the Knowledge of Allah, and you have in that what suffices you if you uphold it. He said: So Allah Almighty revealed regarding what they asked him about that: {And if whatever trees upon the earth were pens and the sea [was ink], replenished thereafter by seven [more] seas, the words of Allah would not be exhausted. Indeed...",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 8
  },
  {
    "serial_number": "7490150",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 6,
    "volume_number": 1,
    "text": "...Allah is Exalted in Might and Wise.} [Luqman: 27]: meaning that the Torah, in relation to this, is but a little of Allah's knowledge'\" (Ibn Hisham, Vol 2 / 308).",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 9
  },
  {
    "serial_number": "7490151",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 7,
    "volume_number": 1,
    "text": "Ibn Hisham also narrates the story of a delegation of Christians from Abyssinia who came and debated the Messenger of Allah, peace be upon him, in the mosque and believed. Then he narrates the story of their dialogue after they believed with those who tried to turn them back from Islam. He says: \"Ibn Ishaq said: Then 'twenty men or close to that from the Christians came to the Messenger of Allah, peace be upon him, while he was in Mecca, when news of him reached them from Abyssinia. They found him in the mosque, sat with him, spoke to him, and asked him questions, while men from Quraysh were in their gathering places around the Kaaba. When they finished asking the Messenger of Allah, peace be upon him, what they wanted, the Messenger of Allah, peace be upon him, invited them to Allah Almighty and recited the Quran to them. When they heard the Quran, their eyes overflowed with tears, then they responded to Allah, believed in him (the Prophet), verified him, and recognized in him what was described to them in their book regarding his matter. When they stood up from him, Abu Jahl ibn Hisham intercepted them with a group from Quraysh. They said to them: May Allah disappoint you as a group of riders! Those behind you from the people of your religion sent you to bring them news of the man, but no sooner did you settle in the seats with him than you left your religion and believed him in what he said! We do not know of a more foolish caravan than you. Or words to that effect. They replied to them: Peace be upon you, we will not act ignorantly towards you; we have what we are upon, and you have what you are upon; we have not spared...",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 10
  },
  {
    "serial_number": "7490152",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 8,
    "volume_number": 1,
    "text": "...ourselves any good.'\" (Ibn Hisham, Vol 2, pp. 291 - 292). These are mere examples from a multitude of dialogue reports narrated by Ibn Hisham regarding the Messenger of Allah, peace be upon him, with the People of the Book and others, and then regarding the companions of the Messenger of Allah, peace be upon him, like Salman Al-Farsi, may Allah be pleased with him, with the People of the Book. Furthermore, books on sects, religions, and denominations mention numerous examples of the dialogues of Al-Shahrastani, Ibn Hazm, Ibn al-Walid al-Baji, Ibn Taymiyyah, and others with rabbis, monks, and representatives of other religious sects.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 11
  },
  {
    "serial_number": "7490153",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 9,
    "volume_number": 1,
    "text": "Definition of Dialogue (Hiwar)\n\nDialogue in the language: The exchange of speech back and forth. In Lisan Al-Arab: (They engage in *Hiwar*, meaning: they exchange speech back and forth. And *Muhawarah*: The exchange of logic and speech in address).\n\nAs for Debate/Argument (*Jadal*): Ibn Faris said: (The [letters] Jim, Dal, and Lam form a single root, which pertains to the strengthening of a thing, involving persistence, extension of dispute, and exchanging speech).\n\nDialogue in terminology: It is the same linguistic meaning mentioned above. It is thus: An exchange of speech between two or more parties without the necessity of hostility between them.\n\nAs for Debate (*Jadal*): It is: (The manifestation by disputants of the implications of their views regarding mutual repulsion and negation through words or what stands in their place such as signs and indications).\n\nScholars distinguish between dialogue and debate, as debate is a likely place for fanaticism, persistence in supporting an opinion whether right or wrong, and arbitrariness in presenting doubts and suspicions about the truth if it emerges from the other direction.\nThere are terms similar to dialogue (*Hiwar*) and debate (*Jadal*), including: Argumentation (*Muhajjah*), Disputation (*Munazarah*), Discussion (*Munaqashah*), and Research/Inquiry (*Mubahathah*).",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 12
  },
  {
    "serial_number": "7490154",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 10,
    "volume_number": 1,
    "text": "From the foregoing, it becomes clear that dialogue is the exchange of information, ideas, and opinions, whether it is a formal or informal exchange, written or oral. Dialogue is constituted merely by recognizing the viewpoints of others, contemplating them, evaluating them, and commenting on them. From this understanding, dialogue can be applied to the cross-pollination of cultures with one another and what results from that in terms of the meeting of interlocutors, mutual correction, and mutual influence.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 13
  },
  {
    "serial_number": "7490155",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 11,
    "volume_number": 1,
    "text": "Definition of Religion (Deen)\n\nReligion is defined as obedience, submission, and establishing a methodology of life based on supreme ideals to which a human adheres. Muhammad Farid Wajdi says in defining religion that it is: \"A name for everything by which God is worshipped, and the creed (Milla), and likewise 'Diyana'. The plural of 'Deen' is 'Adyan' and the plural of 'Diyana' is 'Diyanat'.\"\nIn the Global Arabic Encyclopedia: \"Deen linguistically: Ownership, rule, and management, from 'Dana-hu Deenan' meaning he owned him, ruled him, governed him, managed him, subjugated him, held him to account, rewarded him, and compensated him; from this is 'Maliki Yawm ad-Deen' meaning the Day of Reckoning and Reward. And in the Hadith 'The intelligent one is he who subjugates (Dana) himself' meaning he governed and controlled it.\"\nIn the Arabic Encyclopedia: \"The Arabic term 'Deen' comprises various meanings, but they are closely linked. The term is derived from the verb 'Dana' and its root is 'Deen', meaning he humbled, enslaved, and held to account. From it is the Day of 'Deen' which is the Day of 'Recompense' or 'Reward'.\"\nIn European languages, the word (Religion) is used to express religion, which is a word of Latin origin (Religio) meaning re-gathering and harvesting, a reference to contemplation, worship, meditation, and acting according to what is extracted from those meditations.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 14
  },
  {
    "serial_number": "7490156",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 12,
    "volume_number": 1,
    "text": "As for the Islamic religion, 'Deen' means submission to Allah's command of Monotheism (Tawhid), compliance to Him through obedience, freedom from Shirk (polytheism), following the command of the Messenger of Allah, peace be upon him, and taking this submission and following as a creed, a law, and a comprehensive way of life. As Allah Almighty said: {And to Him belongs whatever is in the heavens and the earth, and to Him is the religion [due] constantly.} (An-Nahl / 52), and the Almighty said: {So is it other than the religion of Allah they desire, while to Him have submitted [all] those within the heavens and earth, willingly or by compulsion, and to Him they will be returned?} (Al Imran / 83), and the Almighty said: {Say, \"Indeed, I have been commanded to worship Allah, [being] sincere to Him in religion.\"} (Az-Zumar / 11), meaning purifying the following for Allah Almighty in all His commands covering all aspects of life. From the Islamic perspective, religion is considered the supreme value, and customs and cultures must adapt to it, or gain its approval for what they contain of conventions.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 15
  },
  {
    "serial_number": "7490157",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 13,
    "volume_number": 1,
    "text": "Definition of Culture\n\nCulture is the sum of beliefs, values, and rules that members of a society accept and comply with. This is because culture is a force and authority directing the behavior of society, defining for its members their perceptions of themselves and the world around them, and determining for them what they like and dislike, what they desire and what they avert from, such as the type of food they eat, the type of clothes they wear, the way they speak, the sports they practice, the historical heroes immortalized in their consciences, the symbols they adopt to express their inner selves, and so on.\n\nFrom this definition, it becomes clear that culture:\n1- Has cumulative growth over the long term: Meaning that culture is not ready-made sciences or knowledge that society can obtain, absorb, and assimilate in a short time, but rather it accumulates over long stages of time.\n2- Is transmitted from generation to generation through socialization: The culture of society is transmitted to its new members through socialization, where children acquire the general taste of society during their growth stages.\n3- Is of a collective nature: Meaning it is not a private characteristic of the individual but of the group, where the individual shares it with the rest of the members of his society, and it represents the bond that connects all its members.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 16
  },
  {
    "serial_number": "7490158",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 14,
    "volume_number": 1,
    "text": "Thus, the culture of a people distinguishes their lifestyle from the lifestyles of other peoples, but it does not isolate them nor necessarily lead them to a state of conflict with other cultures. Within every culture, there may exist those who call for isolation and cutting off from others, or worse, for arrogance, self-aggrandizement, and contempt for others. This may reach the stage of hostility towards others and posing a threat to their existence. Therefore, dialogue was essential to alleviate the intensity of this hostility and enable people of different cultures to coexist and understand one another.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 17
  },
  {
    "serial_number": "7490159",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 15,
    "volume_number": 1,
    "text": "The Goal of Dialogue\n\nThe intention of dialogue is not confrontation and silencing the opponent, as that falls under debate and attempting to prevail over the opponent and rendering them unable to respond. Rather, the intention is to achieve all or some of the following:\n1- Knowing the propositions of the other party, their points of view, and arguments regarding the issues that are the subject of the dialogue.\n2- Informing the other party of information, points of view, and proofs that are absent from them or confusing to them regarding the issues that are the subject of the dialogue.\n3- Working to persuade the other party to abandon their points of view and positions, totally or partially, regarding the issues that are the subject of the dialogue, so they may accept and work to adopt them after being convinced, whether immediately after the dialogue or gradually over the long term.\n4- Working to explore what the other party possesses of truths and positives, acknowledging them, accepting them, and benefiting from them, as long as (Wisdom is the lost property of the believer; wherever he finds it, he is most deserving of it).\n5- Working to explore incorrect or inaccurate information held by the interlocutor and the gaps and errors in their points of view or positions, and working to rectify and correct them.\n6- Building a bridge for constructive peaceful communication and blocking the road to confrontations and clashes which dissipate efforts.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 18
  },
  {
    "serial_number": "7490160",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 16,
    "volume_number": 1,
    "text": "7- Dialogue aids in mental alertness, which is a trait inherent in atmospheres of intellectual challenge and mutual dialogue.\n8- Dialogue may lead to clarifying the truth by adding to it, so each individual gives what they know of parts of the truth so it can be assembled completely. Even for the possessor of truth, parts of the truth appear more clearly to them during their mental alertness in moments of dialogue.\n9- Foiling the arguments of extremists and aggressors. Many dialogues of great Islamic scholars with deviant sects revealed the falseness of their ideas, and this has been recorded in immortal heritage books such as *Al-Milal wa Al-Nihal* by Al-Shahrastani, *Al-Fasl bayn al-Milal wa al-Ahwa' wa al-Nihal* by Ibn Hazm, *Al-Radd 'ala al-Jahmiyyah* by Ibn Taymiyyah, *Al-Sawa'iq al-Mursalah* by Ibn al-Qayyim, *The Qadiani Problem* by Mawdudi, and others.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 19
  },
  {
    "serial_number": "7490161",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 17,
    "volume_number": 1,
    "text": "The Holy Quran and the Dialogue of Cultures\n\nThe Holy Quran has clarified in numerous verses that the multiplicity of human cultures and people's differences in religion is a matter of creation's purpose. The Almighty said: {And if your Lord had willed, He could have made mankind one community; but they will not cease to differ. Except whom your Lord has given mercy, and for that He created them.} [Hud: 118-119]. So difference is a predestined matter just as it is an intended matter so that the proof may be established against the dissenter, but not for fighting and conflict, for disbelief (Kufr) in itself is not a permissible reason to kill a disbeliever or take his life.\nAs for diversity in races, ethnicities, colors, and languages, it is intended for mutual acquaintance and closeness, not repulsion and division. Allah Almighty said: {And We made you into nations and tribes that you may know one another.} [Al-Hujurat: 13]. Thus, the intent of cultural plurality and diversity at its lowest levels is meeting, acquaintance, and the exchange of ideas and experiences developed by different lifestyles. This increases the depth of each culture's components through what it generates from other cultures.\nThrough continuous peaceful contact between cultures, human individuals learn to reduce their biases and soften their negative feelings towards owners of other cultures. Thus, tolerance increases among humans, and those erroneous ideas towards...",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 20
  },
  {
    "serial_number": "7490162",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 18,
    "volume_number": 1,
    "text": "...others are corrected. This is a matter a person knows even from their private experiences with individuals. How often does one of us hold a negative idea about another individual where the sole motive is the lack of dialogue with this other and lack of close, documented, sure knowledge of them? But soon the haze of that bias clears as soon as dialogue and close acquaintance take place with them.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 21
  },
  {
    "serial_number": "7490163",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 19,
    "volume_number": 1,
    "text": "In the Holy Quran, there are many verses confirming the diversity of human experiences and [commanding] not to despise others merely for differing from them. Islamic culture has become rich due to contact with other peoples, exchanging ideas with them, and taking what they have of truth, even if that truth comes from those who are hostile to Islam. Muslim peoples accepted the creed of Islam and retained their own customs and traditions that do not contradict Islam, even if they do not agree with the customs and traditions of other Islamic peoples. That is the breadth of Islam and its tolerance which encompassed everyone.\nPerhaps the best that can be extracted from this is that diversity in dialogue is a tool for fertility and enrichment, as expressed by the social thinker Scott Peck when he said: \"The overall mission of human communication and dialogue boils down to (or should boil down to) reaching reconciliation... Efficient communication and dialogue can ultimately achieve the removal of walls and barriers that lead to misunderstanding which distances humans from one another.\"",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 22
  },
  {
    "serial_number": "7490164",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 20,
    "volume_number": 1,
    "text": "The Holy Quran has called for dialogue with others, a refined and polite dialogue, as Allah Almighty said: {And do not argue with the People of the Scripture except in a way that is best} [Al-Ankabut: 46]. And as He, Glory be to Him, said: {Invite to the way of your Lord with wisdom and good instruction} [An-Nahl: 125]. And the Almighty said: {And do not insult those they invoke other than Allah, lest they insult Allah in enmity without knowledge} [Al-An'am: 108]. Mere roughness in dialogue and using dry, rude vocabulary is undesirable, let alone insulting people, harming them, belittling them, and despising them, and other practices stemming primarily from lack of recognition of others and lack of belief in the utility of dialogue itself. Such people should not undertake dialogue, nor can they achieve any positive results from it.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 23
  },
  {
    "serial_number": "7490165",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 21,
    "volume_number": 1,
    "text": "Doubts Regarding the Utility of Dialogue\n\nThere are some doubts regarding the utility and benefit of dialogue, especially in interfaith dialogue. These doubts revolve around some arguments that require us to clarify them and how to respond to them in a way that proves the importance of the principle of dialogue without applying it at every moment and with everyone. Among these arguments:\n\n1- That dialogue might lead to confusion and disturbance, due to the resulting unpraiseworthy intellectual influence. For example, in the case of dialogue between Muslims and Christians: some Muslims fear that Christian discourse might lead to introducing some doubts and intellectual confusion into the minds of Muslims, causing some of their concepts to become disturbed due to that confusion.\nThis statement is true if the interlocutor has little knowledge of the subject of dialogue, or has weak arguments and is unable to clarify and explain. But if he is qualified for dialogue, fortified with knowledge, proof, and good adherence to his religion, then dialogue increases him in solidity, strength, and in revealing the falsehood of the other party and refuting their doubts.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 24
  },
  {
    "serial_number": "7490166",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 22,
    "volume_number": 1,
    "text": "2- That dialogue might lead to more fanaticism and hardening of positions on both sides. In the case of interfaith dialogue, the dialogue is usually between fundamental premises and holistic concepts of existence, divinity, and laws. These are concepts of such strength and rootedness that dialogue does not affect them, and the inevitable result is that things remain as they were, or become more intense than they were.\nTo respond to this, it suffices to mention the clear truth as was the case in most dialogues of the Holy Quran, where the messengers of Allah, peace be upon them, debated their people regarding establishing the Lordship of Allah Almighty, His Divinity, and establishing the Resurrection and Recompense. There is no harm in a dialogue established on these major foundations to proceed from them to what is below them. As for the saying that all position-holders will harden in their stance, it can be said that some interfaith dialogues resulted in major shifts in belief from which Islam gained much, past and present, as it is the religion gaining most from this door, alongside what it achieves in clarifying its position and explaining its creeds, thereby repelling ambiguity and repelling or lessening hostility.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 25
  },
  {
    "serial_number": "7490167",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 23,
    "volume_number": 1,
    "text": "3- That dialogue leads to Fitnah (strife) and clash: This argument is based on the rule of blocking the means (Sadd al-Dhara'i) and erecting barriers, but it may be exaggerated until barriers are erected with others and the Islamic truth remains absent. Dialogue not disciplined by the conditions and etiquette of dialogue may turn into strife and clash, but not every dialogue is destined for that outcome certainly, as long as there is adherence to the conditions of correct dialogue free from futile argumentation or non-adherence to dialogue etiquette, as will be explained later.\n\n4- That dialogue gives an opportunity to polish false opinions: There is a generalization in this statement that is not correct in every case. Mostly, false opinions only acquire their luster if they isolate themselves with the atmosphere and lights, far from being objected to and confronted through dialogue. Dialogue provides the opportunity to weaken false opinions and lower the degree of their glow and luster, through the truth it reveals that contradicts them and the falsehood implied within them.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 26
  },
  {
    "serial_number": "7490168",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 24,
    "volume_number": 1,
    "text": "5- That dialogue might lead to compromising principles, manipulating them, and mixing them with others to reach middle positions for mutual satisfaction, or claiming the relativity of truth and that facts and opinions, however they differ and conflict, are all correct. The truth is that this caution is valid whenever the clarity of principle and the justice of their cause is absent from the interlocutor on the Islamic side, otherwise, they would be a failed lawyer. Eagerness for dialogue from competent people is the safety valve against falling into this deep abyss. The interlocutor must know that compromising principles and mixing Islam with others in its principles and beliefs is not a goal of dialogue, so that the interlocutor does not make it an illusory goal for achievement.\n\n6- That dialogue might land the people of truth in pitfalls and embarrassments: This happens if they do not perform their role well, and thus the people of false opinion win due to their better preparation and better use of logic. In that, there is creating doubt for the people of truth regarding their truth. This result is possible to occur. But the reason for its occurrence is the scientific weakness of the interlocutors or their negligence in preparation, not the dialogue itself.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 27
  },
  {
    "serial_number": "7490169",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 25,
    "volume_number": 1,
    "text": "Some of those who repeat these arguments start from a concern for Islam, its culture, and the purity of its methodology, and this is a praiseworthy matter. Perhaps strengthening these arguments was aided by what accompanied some rounds of dialogue of failure to achieve tangible results due to the lack of seriousness of the interlocutor from the other side. The reason may be that those who undertook the dialogue entered it without knowledge or preparation or without discipline regarding the conditions and etiquette of dialogue, and instead of reconsidering themselves, they resorted to faulting the principle of dialogue instead.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 28
  },
  {
    "serial_number": "7490170",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 26,
    "volume_number": 1,
    "text": "Clash of Civilizations\n\nSome Western theorists have formulated theories about the futility of dialogue between civilizations and cultures, concluding that positive dialogue between civilizations has ended with their evolution into the form of the current Western liberal civilization, and no hope or benefit remains for dialogue. This is what Francis Fukuyama, the author of the \"End of History\" theory in its current form, posited.\nIf Fukuyama concluded that evolution in the line of human history culminated in the victory of liberalism and the defeat of socialism, then Samuel Huntington, author of the \"Clash of Civilizations\" theory, claims that the most violent battles of history are those that have not yet occurred. And that they will not be on the level of nation-states nor on the level of ideological axes, but will evolve to a higher level, which is the level of human civilizations, the widest cultural entity to which a human belongs.\nThe unit of analysis for him is civilization. Although he admits that the civilizational factor is a highly complex factor, he claims nonetheless that he has mastered it - but a mere fleeting look at his definition of civilization confirms that he has not reached a precise definition of that concept.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 29
  },
  {
    "serial_number": "7490171",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 27,
    "volume_number": 1,
    "text": "Civilization, according to Huntington, is a \"cultural identity\". This is his definition of it, and when he realizes that it is a gelatinous definition, and very far from being a comprehensive and exclusive definition - as logicians say - he turns towards more explanation and clarification. He tells us that cultural identity overlaps and falls under larger affiliations: \"The culture of a village in southern Italy may differ from the culture of a village in northern Italy, but both villages inevitably share the characteristics of the overarching Italian national culture, and this overarching culture is what distinguishes all Italian villages from German villages, for example. But that does not prevent all European villages from gathering under the umbrella of a wider culture, which is what is called European culture, which is the culture that distinguishes all European villages from Arab or Asian villages.\"\nThis last cultural level is what Huntington means by civilization, and it is a loose definition, because its author soon enters into confusion and contradicts what he previously established.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 30
  },
  {
    "serial_number": "7490172",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 28,
    "volume_number": 1,
    "text": "Huntington is not a grounded historian like Toynbee, for example, nor a profound sociologist like Max Weber, and therefore he slips into successive errors. For instance, he says in affirming his definition of civilization: \"Arabs, Chinese, and Westerners are not part of any wider civilizational entity.\" This is a pure error, because Arabs are part of Islamic civilization which is the larger unit, and there is no such thing called Arab civilization in isolation from Islamic civilization, nor anything called Islamic civilization in isolation from Arab culture. Huntington's mistake here is in equating Arabs with Islam, and his failure to realize that Arabs do not represent more than one-fifth of the world's Muslims whose geographical expanse extends to Europe and China, a matter which nullifies Huntington's second premise that Westerners or Chinese cannot be part of any wider civilizational entity.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 31
  },
  {
    "serial_number": "7490173",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 29,
    "volume_number": 1,
    "text": "Huntington sees that our contemporary world is formed of seven or eight civilizations: Western, Confucian, Japanese, Islamic, Hindu, Slavic-Orthodox, Latin American, and possibly African civilization if we are lenient in classification. These civilizations, by the previous definition, are more deeply rooted in the earth and in human life than transient beliefs that appear, last for a time, and then disappear. As for these mentioned civilizations, they possess deep constants, supported by language, culture, heritage, and religion, and possess divergent theories towards human relations with God, human relations with one another, relations between ruler and ruled, and family relations among its members, to the end of these relationships.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 32
  },
  {
    "serial_number": "7490174",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 30,
    "volume_number": 1,
    "text": "Based on Huntington's concept, this divergence in ideas and opinions is not destined to decay or disappear at all, no matter how intensified the means of meeting and communication between humans become. These meetings and communications will lead to exactly the opposite, as they will lead to the growth of each civilization's sense of its distinct characteristics that prevent its people from melting into other civilizations. The most profound example of this is what the immigration of Algerian Muslims to France stirs up in terms of awakening the French civilizational sense and the ignition of its hostility towards Muslims. An example like this—and it is not a unique example of its kind—leads us to decide \"that communication and interaction between peoples of divergent civilizations leads to the ignition of civilizational consciousness in a people and increases the intensity of disagreements and enmities extending deep into history.\" Thus, Huntington uses the argument he feared would be used against his theory, using it in favor of his alleged theory. He does not agree that civilizational communication and dialogue will have positive returns, but rather will lead only to conflict, skirmishes, and struggle.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 33
  },
  {
    "serial_number": "7490175",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 31,
    "volume_number": 1,
    "text": "In addition to communication and interaction comes the factor of economic modernization, which Huntington believes will increase the sharpness of civilizational distinction between peoples. Modernization, in Huntington's view, will destroy smaller cultural spheres, such as local and national culture, and liberate peoples from their captivity. At that point, those peoples will find nothing but the larger civilizational melting pot, of which religion is considered the greatest constituent element. Perhaps this is the secret of the spread of religions now, and the secret of the rise of fundamentalist religious movements which \"can be found in Christianity, Judaism, and Buddhism as much as they can be found in Islam\"! In most of these movements, it is no secret that those most attracted to them are the youth due to modernization processes and university graduates, specifically in the fields of pure sciences and technology. These are the ones who have come to fight manifestations of secularism in their societies, and George Weigel's saying applies to them: \"The de-secularization of the world is one of the dominant social facts of life in the late twentieth century\"!",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 34
  },
  {
    "serial_number": "7490176",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 32,
    "volume_number": 1,
    "text": "The well-educated elites in the non-Western world have become more detached from Western culture than the rest of the peoples that produced them: \"In the past, the elites of non-Western societies—those elites who graduated from Oxford, the Sorbonne, and Sandhurst (in Britain)—tended towards shaping their societies according to Western intellectual and cultural data and standards. Those elites enjoyed full power in their societies and possessed the power and resources to help them achieve their desires to Westernize their societies at a time when the majority of the population in those societies was immersed in their local traditional cultures. Now the situation has reversed; the elites have become more sensitive to the cultural identity of their societies, while ordinary citizens in those societies have become more attached to Western values and behavioral patterns.\" There is no doubt that the role of elites in shaping societies is greater than the role of the public in this era, and consequently, the civilizational identity of non-Western societies will be affirmed more significantly, and their distinction, indeed their conflict with Western civilization, will increase.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 35
  },
  {
    "serial_number": "7490177",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 33,
    "volume_number": 1,
    "text": "The clash of civilizations is inevitable in Huntington's estimation of this serious matter. He puts the matter with this stimulating ease: \"As for the clash of civilizations, the question is: Who are you? This is a question you must answer. And as you realize intuitively, giving the wrong answer to this question in Bosnia, the Caucasus, or Sudan means having a bullet aimed at your head immediately.\" Thus the theory is formulated in the language of novels. It is clear that the language in which these examples were formulated contains bias and overwhelming hatred for the Islamic world. The preceding meaning is very clear: a Western person acknowledging his identity origins in any Islamic land might lead to violence against him. The strange thing is that Huntington chooses examples only from these Islamic homelands where majorities are persecuted by minorities supported by Western civilization. Huntington proceeds in this with the random incitement by Western media of the uneducated Western person against what is called the Islamic threat, which is merely an \"illusion\" that these media outlets, by their insistence on it, want to stick in the memory of the Western person who can remain terrified by that \"illusory\" danger!",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 36
  },
  {
    "serial_number": "7490178",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 34,
    "volume_number": 1,
    "text": "This spontaneous \"inevitable\" clash between the questioner and the answerer evolves on two other levels. \"On the first level, the interests of groups massing on the fault lines separating civilizations will clash to acquire land and subjugate competitors. On the second level, states of different civilizations will clash to achieve their economic and military dominance, control international institutions, and spread their political and religious values at the level of the world order.\" Here, the issue of boundaries separating civilizations receives most of Huntington's attention, and he calls them \"boundaries of tension,\" highlighting the features of the boundaries separating Western Christianity on one hand and Orthodox Christianity on the other in Europe. Then he returns to focus on the inflammation of tension boundaries between Western and Islamic civilizations, reviewing the history of the Crusades with their successive campaigns, chapters of the European conflict with the Ottoman Empire, and the wave of Western colonialism directed at the Islamic world. Then the Arab-Israeli wars \"occurred because Israel represents the spirit and contents of Western civilization as he says,\" then the undertaking of those he called \"Arab and Muslim terrorists\" using the weapon of the weak when they carried out...",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 37
  },
  {
    "serial_number": "7490179",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 35,
    "volume_number": 1,
    "text": "...bombing Western aircraft and facilities and taking hostages. Here Huntington forgot to say even a passing word about the Israeli occupation and terrorism that has been pouring down on the Palestinians for more than half a century!",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 38
  },
  {
    "serial_number": "7490180",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 36,
    "volume_number": 1,
    "text": "Huntington presented his theory on the clash of civilizations as a conflict occurring between all civilizations, but it pleased him only to focus on the clash of Islamic and Western civilizations. Of course, he did not forget to place Muslims in the position of the initiator aggressor of the clash. Indeed, he did not forget to resort to confirming this with a falsified testimony from a Muslim writer, the Indian writer M.J. Akbar, where he says: \"The war will start from the side of the Islamic world because it will struggle to build a new world order, and all countries of the Islamic world from Morocco to Pakistan will participate in that conflict.\" Then he followed that with another testimony from his old professor at Harvard, the Jewish historian Professor Bernard Lewis: \"Who made it his concern prematurely to prove that a forgery occurred in the Quranic manuscripts relied upon by Muslims now, and that there are manuscript copies proving the existence of this forgery!\". He cited Lewis's words in his testimonies on the clash of civilizations saying: \"The world will witness a boiling mood that will increase the agitation of governments and lead to the conflict of their plans and policies, and all of that will lead to one certain result, which is the clash of civilizations, nothing else. And Muslims, our old adversaries, will react irrationally...",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 39
  },
  {
    "serial_number": "7490181",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 37,
    "volume_number": 1,
    "text": "...against our shared Judeo-Christian heritage and our secular culture, and against the spread of our heritage and culture across the world.\" These aggressive, deviant opinions rejecting the dialogue of civilizations deserve study and attention by Muslim thinkers and preachers. Dialogue, even without the fulfillment of all its conditions and etiquette by the other party, is better than cutting off from it and turning to a stance of clash. As Khalid bin Abdullah Al-Qasim says in his book \"Dialogue with the People of the Book: Its Foundations and Methods in the Book and Sunnah\": \"As for refraining from dialogue with oppressors and adopting it as a consistent method, this contradicts the method of the Prophet, peace be upon him. He, peace be upon him, debated the Jews in Medina while they were concealing what Allah revealed and confusing truth with falsehood. He also debated the Christians of Najran and called them to Mubahala (mutual invocation of curse), but they refused.\" Thus, Islam's keenness on dialogue becomes clear as it is a tool for clarifying the truth. The duty of Muslims is to adopt it as a way for clarification and to work on activating that tool to convey the religion and alleviate the intensity of conflict between humans, as long as there is a way to convey the call and deliver it through dialogue and the exchange of ideas and opinions.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 40
  },
  {
    "serial_number": "7490182",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 38,
    "volume_number": 1,
    "text": "Issues in Which Dialogue is Not Permissible\n\nIf we are convinced of the legitimacy of dialogue and its apparent benefit, we should look at it as being legitimate within its limits and utility. Dialogue is not absolutely legitimate to cover every matter; it is not a kind of intellectual luxury, curiosity, love of exploration, or splitting hairs in arguments. There are specific issues into which it is not permissible to delve through dialogue or debate, either due to the limitation of the human mind regarding them, or due to the lack of any scientific or practical fruit resulting from them, or because they are fundamentally settled by a legislative text or consensus.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 41
  },
  {
    "serial_number": "7490183",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquette",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 39,
    "volume_number": 1,
    "text": "Delving into research on the Essence (Zat) of Allah Almighty, for example, is religiously forbidden. This is not a field for research, debate, or dialogue, because speaking on that majestic matter is delving without knowledge, and knowledge is a primary condition for entering into dialogue, a condition absent in this case. It falls under what Allah forbade in His saying: {And do not pursue that of which you have no knowledge. Indeed, the hearing, the sight and the heart - about all those [one] will be questioned.} [Al-Isra: 36]. There are many issues upon which no practical ruling is based, such as most of the issues delved into by those called Muslim philosophers like Al-Farabi, Ibn Rushd, and Ibn Sina, and many Sufis like Ibn Arabi, Ibn Sab'in, Al-Suhrawardi, and others. Among the issues in which debate is forbidden is everything in which Allah and His Messenger have ruled with a clear, decisive text or upon which there is consensus (Ijma) of Islamic scholars. Indeed, everything about which speaking is religiously forbidden is absolutely impermissible for dialogue, just as debating its matter is impermissible. Thus, definitive rulings in religion are not a locus for dialogue or debate for the sake of reconsidering, evaluating, or changing them.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 42
  },
  {
    "serial_number": "7490184",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 40,
    "volume_number": 1,
    "text": "There are many issues where dialogue should not take place because they lead to further discord and sedition, such as arguing about the status of the Companions (may Allah be pleased with them) or favoring some over others during the days of fitnah (tribulations), or arguing based on fanatical political or nationalistic grounds, or whatever follows that trend of types of disagreement that stir up anxiety and confusion in society.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 43
  },
  {
    "serial_number": "7490185",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 41,
    "volume_number": 1,
    "text": "Qualifications of the Muslim Dialoguer: The Muslim dialoguer may engage in dialogue with various fronts, whether with Muslims like himself, or with innovating Muslims, or extremists, or negligent ones, or those intellectually defeated before Western propositions and inclined to interpret religion to align with those propositions, or the Muslim may converse with some of the People of the Book or those with no religion. The motives of those the Muslim meets in dialogue vary; some have good intentions in seeking the truth and readiness to accept it when it becomes clear, and some use dialogue as a way to present and spread their views while insisting on not accepting the truth if it comes from another party, even if it becomes clearly evident. The Muslim dialoguer must know the backgrounds of those he converses with well so he can harness his knowledge and talents in a way ensuring he deals with each of these groups appropriately. The following is a presentation of some necessary qualifications for the Muslim dialoguer:",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 44
  },
  {
    "serial_number": "7490186",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 42,
    "volume_number": 1,
    "text": "1- Knowledge of Sharia evidences from the Quran and Sunnah: He who argues for the religion of Allah Almighty must be familiar with its legal evidences from the Book and Sunnah and understanding them as reported from the Salaf (Predecessors), may Allah be pleased with them. This requires knowledge of Tafsir (exegesis) of its types, and expertise in the noble Prophetic Hadith and the basic sciences of Sharia. If complete encompassment of all that is impossible, it is obligatory that a person does not dialogue or argue except in what he knows with certain knowledge regarding matters of Sharia and religious sciences. It is part of the perfection of the jurist's jurisprudence and the scholar's knowledge that he knows his own worth, does not exceed it, verifies his scientific field so as not to exit it, and does not address what he is not qualified for.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 45
  },
  {
    "serial_number": "7490187",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 43,
    "volume_number": 1,
    "text": "2- Knowledge of Fundamental Principles (Usul) and the Objectives of Sharia (Maqasid): This is an important aspect of knowledge because knowing the evidences requires knowing those rules so that rulings are derived on a correct fundamental basis; otherwise, the balance is disturbed, and rulings are manipulated. The Objectives of Sharia are also relied upon in extracting many rulings. The scholars of the Salaf were the most diligent people in investigating the objectives of the Law. Imam Muhammad al-Tahir ibn Ashour says: \"In this work, the ranks of jurists vary, and you see all of them did not dispense with investigating the actions of the Messenger (peace be upon him) nor with deducing causes (Illah). In the era of the Tabi'in (Successors) and their successors, they used to travel to Medina to gain insight from the traces of the Messenger (peace be upon him), his actions, and the actions of the Companions and those Tabi'in who accompanied them. There, it becomes clear to them what wards off many probabilities in the indications of expressions, and what is deduced of causes becomes clear to them following the knowledge of the ruling and the objectives.\"",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 46
  },
  {
    "serial_number": "7490188",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 44,
    "volume_number": 1,
    "text": "3- Knowledge of the subject of dialogue: He who undertakes dialogue on a specific subject must have comprehensive, or at least sufficient, knowledge of the basics of the subject and its details so that he does not argue for a position whose backgrounds he does not fully grasp, thus being defeated in the dialogue. He must also be aware of the other party's point of view so he does not aim the arrows of his dialogue far from the orbits of the subject, causing defeat to be recorded against him as well. The Holy Quran stipulated knowledge for anyone arguing for Allah's upright religion and criticized a people for arguing without knowledge. The Almighty says: {And among the people is he who disputes about Allah without knowledge or guidance or an enlightening book} (Al-Hajj: 8). And He commanded the Muslim to dialogue with knowledge, guidance, and insight, so the Almighty said: {Say, \"This is my way; I invite to Allah with insight, I and those who follow me\"} (Yusuf: 108).",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 47
  },
  {
    "serial_number": "7490189",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 45,
    "volume_number": 1,
    "text": "4- Proclaiming the Truth: Dialogue should not lead to flattery and diplomacy that covers up facts and differences, working to patch them up superficially and fabricating a false stance of agreement. Allah Almighty condemned those who work to conceal the facts of religion, saying: {Indeed, those who conceal what We sent down of clear proofs and guidance after We made it clear to the people in the Scripture - those are cursed by Allah and cursed by those who curse} (Al-Baqarah: 159). And He condemned those among the People of the Book who falsify the reality of matters, saying: {O People of the Scripture, why do you confuse the truth with falsehood and conceal the truth while you know [it]?} (Al Imran: 71). Falsifying facts aborts all objectives of dialogue and cultural exchange, for dialogue was established primarily to exchange information and opinions; if they come adulterated, the intent of the dialogue will be nothing but cheating and hiding behind positions that are not the original positions of the dialogue.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 48
  },
  {
    "serial_number": "7490190",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 46,
    "volume_number": 1,
    "text": "5- Impartiality in seeking the truth: Dialogue is not a military battle whose purpose is victory and breaking the opponent. The dialoguer must assume - even theoretically - the possibility of the truth being established on the opponent's tongue, and that is a great etiquette of dialogue. The Almighty said, guiding the path of dialogue: {Say, \"Who provides for you from the heavens and the earth?\" Say, \"Allah. And indeed, we or you are either upon guidance or in clear error.\"} (Saba: 24). This is the station of condescension that the dialoguer gives - hypothetically - to others to bring them to the dialogue table. 6- Dialogue with kindness: There is no room for violence and harshness in any constructive dialogue, and harshness against the opponent is not resorted to except when he is unjust and transgresses, so he is deterred by force to stop him at his injustice, and this is the exception, not the rule in dialogue. Dialogue with kindness involves the parties of the dialogue benefiting from each other, and a sincere desire to achieve mutual benefit, regardless of who wins the rounds of dialogue.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 49
  },
  {
    "serial_number": "7490191",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 47,
    "volume_number": 1,
    "text": "In defining the polite framework for dialogue, Allah Almighty’s saying came: {And do not argue with the People of the Scripture except in a way that is best, except for those who commit injustice among them}. Some exegetes mentioned that those who committed injustice are meant to be those who set up fighting against Muslims instead of arguing. And Allah Almighty’s saying came confirming the use of gentle speech in addressing others in the recommendation to Moses and Aaron, peace be upon them: {And speak to him with gentle speech that perhaps he may be reminded or fear [Allah]}. The Messenger of Allah (peace be upon him) always recommended gentleness in speech with others and patience with their insolence and harm.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 50
  },
  {
    "serial_number": "7490192",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 48,
    "volume_number": 1,
    "text": "7- Verification and avoiding slips: The one who dialogues must strive to control his nerves to verify matters, not risk speech, not fabricate arguments, and not rush so as to slip and incline towards error simply because he wants to compete with his interlocutor and triumph over him. Often, interlocutors slip because of seeking victory for themselves, and this is what Satan suggests to make the right of the self overcome the pure truth. As Mu'adh bin Jabal, may Allah be pleased with him, said, Satan may speak falsehood on the tongue of the wise. And Tamim Al-Dari, may Allah be pleased with him, said: \"Beware of the slip of the scholar.\" Umar asked him: \"What is the slip of the scholar?\" He said: \"He slips with the people and it is taken from him; so the scholar might repent, but the people continue taking his saying.\"",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 51
  },
  {
    "serial_number": "7490193",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 49,
    "volume_number": 1,
    "text": "8- Methodizing thoughts: Learning requires intelligence, perseverance, diligence, and insight, whereas methodizing thoughts requires a special skill honed by practice and training. Many scholars, no matter how much their harvest of knowledge based on evidence increases, may not be good at arranging its issues in a logical order, so their knowledge appears scattered and mixed with one another. The more their outcome of knowledge increases, the more their minds become mixed and confused, and they transfer that mixture and confusion to the listener. This is the last thing the listener needs and the first thing that spoils the scholar's message and causes his failure in dialogue. The successful dialoguer is the one who trains himself to methodize thoughts, arrange texts and evidences, and extract premises subject to analysis for the purpose of extracting results from them. Giving results without that logical arrangement may not be a subject of conviction or acceptance by the other party in the dialogue nor by the audience of listeners.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 52
  },
  {
    "serial_number": "7490194",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 50,
    "volume_number": 1,
    "text": "The dialoguer must tend to his subject with ample study and logical arrangement and prepare himself for the dialogue well. Even a scholar is subject to forgetfulness, and his memory may fail him, his mind may scatter, and his proofs may fall apart if he does not exert sufficient effort for the duty of dialogue. Here, the owner of the wrong opinion and false argument may win only because he was organized in mind and used logic well, and because he faced a dialoguer who possessed the truth but was a bad representative of his right due to his confusion, weakness, and stumbling in logic. 9- The Logic of Intuition (Common Sense): Indulging deeply in constructing proofs may tempt the dialoguer to stray far from the logic of intuition and from using the first axioms that all people agree upon, thus working on strangeness in generating formulas and chains of reliance. However important this may seem, it wearies the minds and distances one from the warmth of the manifest truth. The successful dialoguer is the one who can pick up observations, axioms, and high self-evident truths in life and build upon them, because building upon such hypotheses serves as building upon solid premises that the other party does not dispute; rather, they arouse the admiration of the listener and drive him to acknowledge the truth and submit to it.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 53
  },
  {
    "serial_number": "7490195",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 51,
    "volume_number": 1,
    "text": "10- Refining the language of dialogue: The dialoguer must master the language in which he dialogues so he can articulate the essence of what he wants to say and choose the strongest words and expressions in conveying those meanings. But if the dialoguer's language is weak, his ideas, however correct or profound, will appear weak, superficial, and highly shaky. People often judge the speaker by the level of his command of language and articulation, not by the level of his command of knowledge and depth of investigation into it. Thus, dialoguers who were right have often been defeated, but their feeble linguistic faculties betrayed them. 11- Submitting to the truth from whatever source it comes: Reaching the truth is the goal of dialogue. Its goal is not to silence the opponent and drag him to submit to the opinion proposed by the one dialoguing with him. Everyone who dialogues must prepare himself to accept the result of the dialogue if the weakness of his opinion and argument appears against the strength of the opponent's opinion and argument. Much of the stubbornness that follows dialogue traces its origin to the dialoguer himself not possessing the humility to compel his self to accept the truth. There is no defeated or victor, but commitment to the truth and turning towards it.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 54
  },
  {
    "serial_number": "7490196",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 52,
    "volume_number": 1,
    "text": "The dialoguer must not make his opponent feel inferior and that he is in error with which there is no correctness and no possibility of any correctness issuing from him. Even disbelievers may issue some correct opinion despite the error they are in, and they can be lured to speak the truth. The general rule is that the dialoguer must prepare his mind to receive correctness from any direction, acting upon the saying of Imam Al-Shafi’i, may Allah have mercy on him: \"My opinion is correct but bears the possibility of error, and the opinion of another is wrong but bears the possibility of correctness,\" and what was narrated about him that he never debated a person except that he hoped the truth would appear on his tongue.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 55
  },
  {
    "serial_number": "7490197",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 53,
    "volume_number": 1,
    "text": "Etiquettes of Dialogue: Once the Muslim dialoguer is qualified to engage in dialogue so that he reaps its fruits and benefits himself and his religion from it, he must adopt the etiquettes of dialogue and adhere to its standards by which the highest benefit is achieved. Among the most important of these etiquettes are: 1- Adhering to the subject of dialogue and not deviating from it. This is a methodological and organizational issue of utmost importance. Failure to adhere to it leads to mixing issues with one another, which leads to none of them maturing through research, questioning, comparison, evaluation, and deduction. This aspect can be addressed by setting the priorities of the dialogue well, and establishing an arbitration body to control the interlocutors whenever they tend to deviate from the framework of the subject. 2- The necessity of defining the terms used in the dialogue and explaining their implications well, because a single term may mean something different to both parties. Here, the speaker must declare what he means specifically by the main term his speech revolves around during the dialogue. 3- Discussing issues according to their importance. It is not proper etiquette of dialogue to amplify branch issues at the expense of original issues, for many branch issues are resolved automatically as soon as their major fundamentals and the source of difference regarding them are discussed.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 56
  },
  {
    "serial_number": "7490198",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 54,
    "volume_number": 1,
    "text": "4- Softening the atmosphere of dialogue every now and then, by offering some expressions of respect and appreciation to the other party, for that is more conducive to curbing the emotion of the other party and calming his tendency towards transgression and lack of objectivity. 5- Not rushing to persuade; because that hurts the feelings of the other party. It is better for the dialoguer to show his point of view clearly, and give the full opportunity to the other party - even if he is an opponent - to show his point of view, then a time opportunity is given to both so that each person contemplates the point of view of his companion. Thus the vision becomes clear with the calmness of minds and the subsiding of the temporary emotion that accompanies the moments of dialogue.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 57
  },
  {
    "serial_number": "7490199",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 55,
    "volume_number": 1,
    "text": "6- Good listening to the other party. Dialogue is a matter of exchanging opinions and not merely transmission from one side and reception from the second side. It is from the etiquettes of dialogue that each party listens well to the opinions of the other party, so he does not neglect listening out of disdain or belittling the opinions of others, nor does he persist in talking until he encroaches on the time allocated to others. It is from the good manners of the Prophets that they used to listen well to their interlocutors; rather, they used to be gracious and grant them the first opportunity to present their opinions and arguments. When the sorcerers said to our master Moses, peace be upon him: {Either you throw, or we will be the first to throw}, {He said, \"Rather, you throw.\"}, so he gave them the first opportunity to present evidences. Ibn Ishaq narrated in his Sira of the Prophet (peace be upon him) «that Utbah bin Rabi'ah said one day while sitting in the assembly of his people, and the Messenger of Allah (peace be upon him) was sitting in the mosque alone: 'O assembly of Quraysh, shall I not get up to Muhammad and speak to him and offer him matters, perhaps he will accept some of them, so we give him whatever he wishes and he desists from us?!' - And that was when Hamza, may Allah be pleased with him, had accepted Islam, and they saw the companions of the Messenger of Allah (peace be upon him) increasing and multiplying - They said: 'Yes, O Abu Al-Walid, get up to him and speak to him.' So Utbah got up until he sat by the Messenger of Allah...",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 58
  },
  {
    "serial_number": "7490200",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 56,
    "volume_number": 1,
    "text": "...peace be upon him, and said: 'O my nephew, indeed you are from us where you know of nobility in the clan and standing in lineage, and you have brought your people a grave matter by which you have divided their community, foolishly mocked their dreams, criticized their gods and religion, and declared as disbelievers those who passed away of their forefathers. So listen to me, I will offer you matters for you to look into, perhaps you will accept some of them.' He said: So the Messenger of Allah (peace be upon him) said: \"Speak, O Abu Al-Walid, I am listening.\" He said: 'O my nephew, if you only want money by what you have brought of this matter, we will collect for you from our wealth until you are the wealthiest of us. And if you want honor by it, we will make you our chief so that we do not decide a matter without you. And if you want sovereignty by it, we will make you king over us. And if this which comes to you is a vision (jinn possession) you see which you cannot repel from yourself, we will seek physicians for you, and we will spend our wealth on it until we cure you of it, for the follower (jinn) may overcome the man until he is treated for it.' Until when Utbah finished and the Messenger of Allah (peace be upon him) was listening to him, he said: \"Have you finished, O Abu Al-Walid?\" He said: Yes. He said: \"Then listen to me.\" He said: I will do so. He said: In the name of Allah, the Most Gracious, the Most Merciful: {Ha, Meem} {A revelation from the Entirely Merciful, the Especially Merciful} {A Book whose verses have been detailed, an Arabic Qur'an for a people who know} and the Messenger of Allah went on...",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 59
  },
  {
    "serial_number": "7490201",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 57,
    "volume_number": 1,
    "text": "...peace be upon him, reciting it until the prostration, and Utbah listened to it until his face changed and he was affected by what he heard. He went to the people praising the Quran, so they said to him: By Allah, Muhammad has bewitched you with his tongue». Whatever the result of the dialogue, the Muslim is tasked with listening to comfort the mind of the speaker, and that is more conducive to bringing him to the side of truth. That is what the Messenger of Allah (peace be upon him) did in this situation, and in every dialogue situation he had with disbelievers and dissenters. If even the disbeliever is granted that opportunity to be listened to so he can present his ideas and opinions, then that same right must be given to dissenters within the framework of the general Islamic conception, or to dissenters from among the people of cultures, civilizations, and scriptural religions in particular. Dialogue is an important mechanism for achieving the performance of the duty of Da'wah (Call) by conveying the message of the true religion. Therefore, the Holy Quran cited numerous examples of it and called for its use conditioned by the etiquettes of dialogue.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 60
  },
  {
    "serial_number": "7490202",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 58,
    "volume_number": 1,
    "text": "Conclusion: From the foregoing, it becomes clearly evident that dialogue derives its legitimacy from the Holy Quran itself, which recounted many dialogues by way of teaching and admonition, starting with the dialogue of Allah Almighty Himself with the angels regarding the creation of Adam: {And [mention, O Muhammad], when your Lord said to the angels, \"Indeed, I will make upon the earth a successive authority.\" They said, \"Will You place upon it one who causes corruption therein and sheds blood, while we declare Your praise and sanctify You?\" He said, \"Indeed, I know that which you do not know.\"} Passing through the dialogues of the Messengers with their peoples, and ending with the dialogues of the Seal of Messengers (peace be upon him) with the Jews and Christians. Muslims have many dialogues with others from the People of the Book, and with innovative sects, recorded in the books of sects and the many books of dialogue, disagreement, and debate that the intellectual history of Islamic civilization abounded with. The books of Islamic jurisprudential schools were also filled with their dialogues with one another regarding many issues of the principles of jurisprudence and its branches.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 61
  },
  {
    "serial_number": "7490203",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 59,
    "volume_number": 1,
    "text": "Due to the importance of dialogue as an ideal mechanism for clarifying facts, many Imams of the Salaf were keen to produce valuable scientific books on the subject of dialogue, such as the book (Al-Insaf fi Masa'il Al-Khilaf) \"Equity in Issues of Disagreement\" by Abu Sa'id Al-Naysaburi, (Al-Burhan fi Al-Khilaf) \"The Proof in Disagreement\" by Abu Al-Muzaffar Al-Marwazi, (Tajrid Al-Masa'il Al-Lataf fi Al-I'tilaf wal-Khilaf) \"Abstracting Subtle Issues in Agreement and Disagreement\" by Nur Al-Din Al-Shafuri, and (Tahdhib Al-Akhlaq bi Dhikr Masa'il Al-Khilaf wal-Wifaq) \"Refining Morals by Mentioning Issues of Disagreement and Accord\" by Muhammad Al-Asadi Al-Qudsi. There are no less than one hundred and fifty books of this type in establishing the mechanism of dialogue, promoting it, and advancing it, and examples of them indicate its vital importance in building Islamic knowledge.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 62
  },
  {
    "serial_number": "7490204",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 60,
    "volume_number": 1,
    "text": "And now, in the shadow of the awakening of Muslims and their turning attention to matters of their religion and the facts of their era which is explosive in terms of knowledge and media, the mechanism of dialogue acquires further importance in the Islamic mind. The holding of many multilateral conferences, seminars, and meetings is but proof of the Muslims' increasing sense of that importance for the principle of dialogue between Muslims and people of other religions and cultures. O Allah, we ask You to return the Muslims to their religion with a praiseworthy return, bring them back to it beautifully, remove the veil of falsehood from eyes, open hearts to the truth, and grant us [the ability of] arguing for Your religion with guidance and light, and calling to Your path with insight. Indeed, You are the best Protector and the best Helper.",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 63
  },
  {
    "serial_number": "7490205",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Dialogue with People of Other Religions: Its Legitimacy, Conditions, and Etiquettes",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Endowments without data",
    "page_number": 61,
    "volume_number": 1,
    "text": "References: * The Holy Quran. * Biography (Sira) of Ibn Hisham. * Dialogue with the People of the Book: Its Foundations and Methodologies in the Book and Sunnah, Khalid bin Abdullah Al-Qasim, Dar Al-Muslim, Riyadh, 1414 AH. * Introduction to the Disagreement of Muslims and Their Division, Muhammad Al-Abdah and Tariq Abdul Halim, Dar Al-Arqam, Kuwait, 1406 AH. * Knowledge of the Science of Jurisprudential Disagreement: A Look at Achieving Islamic Accord, Dr. Zakaria Abdul Razzaq Al-Masri, Mu'assasat Al-Risalah, Beirut, 1410 AH. * Etiquettes of Research and Debate, Muhammad Al-Amin Al-Shanqiti, Maktabat Ibn Taymiyyah, Cairo, no date. * Etiquettes of Dialogue and Debate, Dr. Ali Jreesha, Dar Al-Wafa, Mansoura, 1410 AH. * Etiquette of Dialogue in Islam, Saif Shahin, Dar Al-Ufuq, Riyadh, 1414 AH. * Clash of Civilizations? By: Samuel Huntington, (Foreign Affairs), Summer 1993. pp. ...",
    "foot_note": "None",
    "book_id": "1132",
    "new_page_number": 64
  }
]