[
  {
    "serial_number": "281880",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Sects and Refutations\nBook: The Faithful Guide to Understanding Sufism and the Sufi (Al-Muwafi bi-Ma'rifat Al-Tasawwuf wa Al-Sufi)\nAuthor: Kamal al-Din Abu al-Fadl Ja'far bin Tha'lab al-Adfawi al-Masri (685 - 748 AH)\nVerified, introduced, and annotated by: Dr. Muhammad Isa Salihah [Died 1431 AH]\nPublisher: Dar Al-Orouba Library for Publishing and Distribution - Kuwait\nEdition: First, 1408 AH - 1988 AD\nNumber of Pages: 80\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 19 Rabi' al-Awwal 1442\n\nBook: The Faithful Guide to Understanding Sufism and the Sufi\nAuthor: Kamal al-Din Abu al-Fadl Ja'far bin Tha'lab al-Adfawi al-Masri (685 - 748 AH)\nVerified, introduced, and annotated by: Dr. Muhammad Isa Salihah [Died 1431 AH]\nPublisher: Dar Al-Orouba Library for Publishing and Distribution - Kuwait\nEdition: First, 1408 AH - 1988 AD\nNumber of Pages: 80\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 19 Rabi' al-Awwal 1442\n\nAuthor: Kamal al-Din Abu al-Fadl Ja'far bin Tha'lab al-Adfawi al-Masri (685 - 748 AH)\nVerified, introduced, and annotated by: Dr. Muhammad Isa Salihah [Died 1431 AH]\nPublisher: Dar Al-Orouba Library for Publishing and Distribution - Kuwait\nEdition: First, 1408 AH - 1988 AD\nNumber of Pages: 80\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 19 Rabi' al-Awwal 1442\n\nVerified, introduced, and annotated by: Dr. Muhammad Isa Salihah [Died 1431 AH]\nPublisher: Dar Al-Orouba Library for Publishing and Distribution - Kuwait\nEdition: First, 1408 AH - 1988 AD\nNumber of Pages: 80\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 19 Rabi' al-Awwal 1442\n\nPublisher: Dar Al-Orouba Library for Publishing and Distribution - Kuwait\nEdition: First, 1408 AH - 1988 AD\nNumber of Pages: 80\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 19 Rabi' al-Awwal 1442\n\nEdition: First, 1408 AH - 1988 AD\nNumber of Pages: 80\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 19 Rabi' al-Awwal 1442\n\nNumber of Pages: 80\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 19 Rabi' al-Awwal 1442\n\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 19 Rabi' al-Awwal 1442\n\nPublication date in Al-Shamela: 19 Rabi' al-Awwal 1442",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281881",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 1,
    "volume_number": 1,
    "text": "A Rare Book on Criticizing Sufism\nThe Faithful Guide to Understanding Sufism and the Sufi\nAuthored by Imam Kamal al-Din Abu al-Fadl Ja'far bin Tha'lab al-Adfawi al-Masri (685 - 748 AH)\nVerified, introduced, and annotated by Dr. Muhammad Isa Salihah\nDar Al-Orouba Library for Publishing and Distribution\nKuwait",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281882",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 3,
    "volume_number": 1,
    "text": "All Rights Reserved\nFirst Edition 1408 AH - 1988 AD\nDar Al-Orouba Library for Publishing and Distribution\nP.O. Box: 26223 / Safat\nPostal Code: 13123\nKuwait",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281883",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 5,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\n\nPreface\nThe second century AH witnessed the emergence of the Sufi movement, when people began turning away from the straight path of being mindful of Allah, fearing Him, remembering Him secretly and openly, and renouncing the world. A group of righteous people were alarmed by people's fierce competition for the world and their racing to indulge in pleasures and amusements. So they withdrew aside, turning to the Truth, Glory be to Him, devoting themselves to worship, reciting the Book of Allah, and standing in prayer at night, performing Tahajjud and Tahlil (saying La ilaha illa Allah) secretly and openly.\nA group of these people took it upon themselves to clarify the practical conduct of Sufism. Al-Muhasibi described the behavior of Sufis in a scientific manner in his book \"Al-Ri'ayah li-Huquq Allah\" (Observance of the Rights of Allah). The ways of Sufism until the sixth century AH were generally close to asceticism (Zuhd), despite some deviations from the right path that mixed with it at times. However, the grave events that befell the Islamic state since the late sixth century AH and early seventh century AH created an opposite reaction. Some turned away from life and its affairs and leaned towards fatalism (Tawakul), and asceticism in their customs became a kind of indifference reaching the point of submissiveness.",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281884",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 6,
    "volume_number": 1,
    "text": "The beginning was when the Ayyubids resolved to confront the Shiite current of thought following the collapse of the Fatimid state. The Ayyubids established numerous schools and Hadith houses in Egypt and the Levant, and summoned Sunni scholars and jurists to play their role in those institutions. Many Islamic cities such as Alexandria, Cairo, Qus, Asyut, Jerusalem, Aleppo, Damascus, and Tripoli became vibrant centers for Sunni sciences and thought.\nThen came the fierce Crusader invasion to add other burdens, casting its weight on Saladin. He worked to establish the Arab and Islamic identity of the lands that were the target of the new invaders. He established Khanqahs (Sufi hospices), Ribats (hospices/fortresses), Zawiyas (corners), and Tekkes, in addition to mosques, schools, Hadith houses, and hospitals (Bimaristans). Saladin's goal behind this was to revive religious feeling among Muslims and raise the readiness of the Islamic nation to resist the dangers threatening it.\nA group of people occupied these places, taking up Dhikr (remembrance) and reading the Quran as their profession. They followed the straight path and were good models for the pious and worshippers. However, these places soon became a refuge and sanctuary for every comfort seeker, finding therein what they sought of food, clothing, and drink without significant effort. This was followed by an increase in the numbers of those joining the ranks of Sufism, especially after the number of Khanqahs, Ribats, Zawiyas, and Tekkes multiplied, and people exaggerated in endowing Waqfs (religious endowments) for them, and Sultans, Princes, and the wealthy competed in offering money and gifts to their frequenters. Thus, the life of the Sufis became easy, and they enjoyed a luxurious and opulent life, which led to the spread of innovations later on.\nConsequently, claiming to be Sufi became common for the purpose of livelihood. Many headed to the Khanqahs, wore wool, and shaved their heads, but they did not adopt the morals of",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281885",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 7,
    "volume_number": 1,
    "text": "ascetics or Sufis. The Sufi became, for the most part, a gluttonous man, full of curiosity, whose intrusiveness became proverbial. They said: \"We seek refuge in Allah from the Fire, and from the Sufi if he knows the door of the house.\" Another description of their condition was: \"Eaters, idle, hashish addicts (Satla), having no work or occupation.\" Many jurists defined the group of Sufis as \"men who display Islam but conceal corrupt belief, wearing skulls on their legs and their turbans' tails from the front\" (1).\nWhat increased the rushing of groups of people to join the ranks of Sufism was the occurrence of the devastating Tartar-Mongol invasion of the Islamic world, and the bitterness and disappointment it bequeathed in souls. Also, the hardship of living that characterized that era due to drought and famine, so famines persisted, and infectious diseases like plague and smallpox and other deadly diseases spread.\nThese people found in the Khanqahs ample living and ease of condition, indeed luxury in food, drink, and clothing. This is because many interests and establishments, such as orchards, shops, bathhouses, and markets, were endowed (Waqf) for the Sufis. The Sa'id al-Su'ada Khanqah in Egypt, established in 569 AH = 1173 AD, had a number of interests endowed to it to spend from their revenue on the poor Sufis, including the Habbaniyah orchard and the Sharab Qaysariyah (market). Each Sufi there was allocated three loaves weighing a third of a Ratl in broth, and sweets were made for its Sufis every month, and soap was distributed to them (2). As for the Sufis of the Rukn al-Din Baybars Khanqah, a kitchen was attached to it, from which meat, food, and three loaves were distributed to the residents every day, in addition to",
    "foot_note": "1. Salam: Literature in the Mamluk Era, 1/ 202, and the descriptions appeared in the Treatise, 7a.\n2. Al-Maqrizi: Al-Mawa'iz, 2/ 416.",
    "book_id": "97"
  },
  {
    "serial_number": "281886",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 8,
    "volume_number": 1,
    "text": "sweets. For the Sufis of the Shaykhu Khanqah, in addition to what was mentioned, oil and soap (1). As for the Sufis of the Siryaqus Khanqah, they had the price of clothing every year and extra allowance in every Ramadan, the two Eids, and seasons, on top of what they had of delicious food and pure bread, in addition to sweets, olive oil, soap, and the price of fruits. This is besides the sugar, various drinks, and types of medicines available in the Khanqah. Bathhouses, kitchens, and burial places were also attached to the Khanqahs, and their floors were spread with carpets, copper utensils, books, lamps, and other precious tools, which only kings and princes acquire.\nAnyone who looks at the endowment deeds of Khanqahs, Zawiyas, and Ribats realizes the extent of the economic burden suffered by society due to the narrow base benefiting from the economic interests restricted to Sufis to the exclusion of other segments of society.\nAs evidence of the extravagant and luxurious life enjoyed by the Sufis, we present two examples of Sama' (Sufi musical gatherings) held in Egypt and the Levant in the year 659 AH = 1261 AD.\n\"Mawla Qutb al-Din, may Allah have mercy on him, said: One of the Nasiriyyah narrated to me, saying: When we entered the Egyptian lands, it happened that one of the senior Emirs held a Sama', and he came himself to Emir Jamal al-Din and invited him. He promised him to go to him and attend. When it was the time of the last Isha prayer, he went, and we were with him - a group of his Mamluks and retinue - to that Emir's house. When he entered, he found a group of Emirs sitting in the Iwan of the house, and a group of Fuqara (Sufis) in the middle of the house. He stopped and did not enter, and said to the owner of the house: You erred in what you did. The Fuqara should have been seated above and you",
    "foot_note": "1. Previous Reference, 1/ 283.",
    "book_id": "97"
  },
  {
    "serial_number": "281887",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 9,
    "volume_number": 1,
    "text": "on the floor of the house. He did not sit until the Fuqara moved to the place of the Emirs, and the Emirs to the place of the Fuqara. He and we sat among the Emirs. When the singer sang, one of them stood up with the tambourine in his hand begging. This was the custom of singers in the Egyptian lands. When Emir Jamal al-Din saw him, he scolded him and said: Woe to you.\"\nThe narration continues explaining the condition of the Sufis as they danced and collected gold and silver coins from the Emirs, then eating the most delicious food and drink (1), and leaving happy and joyful.\nQutb al-Din al-Yunini in his \"Dhayl\" (Supplement) to \"Mir'at al-Zaman\" by Sibt ibn al-Jawzi also provided a detailed presentation describing one of those dancing nights. It came in the biography of Lajin bin Abdullah, Emir Husam al-Din al-Jukandari (d. 662 AH / 63 - 1264 AD), where he said: \"...He had a good belief in Fuqara (Sufis) and righteous people, and frequently did good to them and was kind to them, checking on them with spending, clothing, and other things. He used to hold Sama' gatherings for them, bringing in foods, drinks, good perfumes, and candles that dazzle the mind and exceed the limit. It was estimated that what he spent on a single Sama' was approximately eight thousand Dirhams (2)... etc.\nAl-Yunini proceeds to describe a Sama' night he himself attended in Lajin's house located in Al-Uqaybah in Damascus in late 659 AH. The house was lit",
    "foot_note": "1. Habib al-Zayyat: A Night of Royal Dance and Sama' for the Poor, Al-Machriq Journal, Issue 43, Year 1939 AD, quoting from Al-Durr Al-Muntakhab in the Continuation of the History of Aleppo - Manuscript in Al-Ahmadiyya Library in Aleppo, now preserved in Al-Assad Library in Damascus, No. 1214, Folios 270-271 of Part One.\n2. Al-Yunini: \"Dhayl Mir'at al-Zaman\" MS Oxford POC.OR.132 Folios 112 - 113.",
    "book_id": "97"
  },
  {
    "serial_number": "281888",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 10,
    "volume_number": 1,
    "text": "with camphor candles in silver candelabras inlaid with varieties of gems and precious stones. When the Maghrib prayer was performed, he spread a table for the Fuqara (Sufis) containing nearly a hundred Adiliyyah bowls. In each bowl was a whole suckling lamb, and about three hundred bowls in each of which were three chickens, and other types of food. After Isha and completing the prayer, those present began singing and dancing. When they got tired, he spread a table of sweets and Qatayef (pancakes), fresh and fried, made with Egyptian sugar, pistachios, and musk. Then they danced and sang all together. Then, a huge table of rare fruits out of season was spread, including quince, apples, pears, pomegranates, and melons. After that, they returned to dancing and singing. Then he spread a table of various nuts, Iraqi sugarcane, pistachios, hazelnuts, raisins, stuffed cakes, Khushkanan (discs of flour and sweets), rusks, and others. Their drink was made with snow and sugar, willow water (a type of distilled Egyptian willow), and rose water, in addition to censers filled with aloeswood, ambergris, and Indian oud. When it was the time of Suhur (pre-dawn), they entered a bathhouse adjacent to Lajin's house, bathed, and were dressed in new shirts and clothes. After the bath, they returned to the house and were given drinks suitable after a bath, then a table of hot sweets was spread for them, and after that they left.\nTo estimate the condition of the people at that time, Al-Yunini commented on the occurrence of this Sama', stating that it was held while people were in hardship. A Ghararah of wheat in Damascus cost three hundred Dirhams, a Ratl of meat in Damascus cost seven Dirhams, and a chicken cost three Dirhams. All things were very expensive. So look at what luxury and prosperity the Sufis of that era lived in?",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281889",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 11,
    "volume_number": 1,
    "text": "The role of Sufis was not limited to economic sabotage, but extended to influencing political and social events, through the infiltration of the movement among the common people and the elite. Consequently, the state recognized Sufi institutions and brought Sufi sheikhs close, to the extent that Sultans boasted of building Ribats, Khanqahs, and Zawiyas for the Sufi group, believing that the poor Sufis could perform miracles, remove harm from Sultans, and claim unveiling (Mukashafa) and witnessing the Truth (1). Therefore, the poor Sufis were often invited to lift harm from an afflicted person, or to pray for wellness for a sick person (2).\nThe influence of the Sheikh of Sheikhs of the Sa'id al-Su'ada Khanqah reached such an extent that he succeeded in banishing Ibn Taymiyyah from Egypt to the Levant in the year 707 AH = 1307 AD, where he was imprisoned in Damascus, on the pretext of speaking against the Sheikhs of the Path (Tariqa). The Sheikh of Sa'id al-Su'ada had gathered over five hundred Sufis from the Khanqah and marched with them in a demonstration to the Citadel, and large groups of commoners had joined the demonstration. At the Citadel, they complained to the Sultan about Ibn Taymiyyah, who referred them to the Shafi'i judge, who pushed them away to Taqi al-Din Ali bin al-Zawawi al-Maliki, who in turn issued the ruling we referred to (3). Also in Damascus, Ibn Ramadan the Witness was reprimanded because he spoke against the Fuqara (4), and was beaten until he sought repentance and forgiveness. Indeed, Sufis often spilled wines and Boza because they are forbidden for",
    "foot_note": "1. Al-Kalabadhi: Al-Ta'arruf li-Madhhab Ahl al-Tasawwuf, 16.\n2. Al-Saqa'i: Tali Wafayat al-A'yan, 151.\n3. Ibn Tulun: Mufakahat al-Khullan, Vol 1 p 21.\n4. Previous Reference Vol 1 p 9, 7, events of the year 885 AH.",
    "book_id": "97"
  },
  {
    "serial_number": "281890",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 12,
    "volume_number": 1,
    "text": "others, and they might go out into the streets to release one of their own from prison, and many other things. The Sufis persisted in their corruptions, to the extent that some of them issued fatwas prohibiting earning a living except in necessity, because earning, in their view, negates reliance on Allah (Tawakkul) or detracts from it, and Allah has commanded them to rely on Him, and their provision is in the heaven and what they are promised (1). Furthermore, some Sufis never established prayer at all, claiming that they only perform it in sacred places (2).\nCorruption pervaded the life of Sufis in their habits, morals, customs, traditions, clothes, costumes, drinks, and foods. The pretenders among the Sufis became famous for greed in eating and drinking, fondness for dancing, and rushing to Sama' and singing. Until the poet Al-Tahir said about them: [Wafir Meter]\nI see the generation of Sufism as the worst generation ... So say to them, and how light is the Incarnation (Hulul)\nDid Allah say when you worshipped Him ... Eat like cattle and dance for Me (3)\nTherefore, the most prominent manifestations of corruption in the life of Sufis, in addition to what was mentioned, can be summarized as follows:",
    "foot_note": "1. Al-Shaybani: Al-Kasb, 37. Al-Ayni: 'Aqd al-Juman, Vol 33/ 38a. Al-Kalabadhi: Al-Ta'arruf, 102.\n2. Al-Sha'rani: Al-Yawaqit wa al-Jawahir, 1/ 125.\n3. The verses appeared in the published text of the Epistle of Ibn al-Qarih, Ali Mansour al-Halabi, who was a contemporary of Abu al-Ala' al-Ma'arri, to which Risalat al-Ghufran came as a response. The first hemistich of the second verse came as: \"Did Allah say when you loved (ashiqtumuhu) Him\", and perhaps it is more correct, because Sufis love passionately (Ishq) while worship is for all humans. See: Abu al-Ala' al-Ma'arri: Risalat al-Ghufran, with a verified text from Risalat Ibn al-Qarih, investigation by Dr. Bint al-Shati, 6th ed., Dar al-Ma'arif, 1977 pp. 36-37. Bint al-Shati: Jadid fi Risalat al-Ghufran, Beirut ed. 1972, p. 51.",
    "book_id": "97"
  },
  {
    "serial_number": "281891",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 13,
    "volume_number": 1,
    "text": "Manifestations of Corruption in the Life of Sufis\n- Sama' (Listening to Music) and Dancing: Sama' for Sufis are nights held in which they chant and dance. In their definition, Sama' generates a state in the heart called Wajd (ecstasy), and this in turn moves the body members. If the movements are rhythmic, they are clapping and dancing; if unweighted, they are agitations (1). It seems that a kind of whim and overpowering control the Sufi; if he hears singing or a rhythmic beat with a stick, he goes into ecstasy, claps, and perhaps tears his clothes and throws them (2).\nA group of scholars denounced such disgraceful behavior and wrote books and poems condemning their conduct. Imam Muwaffaq al-Din, Abdullah bin Ahmad bin Muhammad bin Qudamah al-Maqdisi wrote a treatise condemning what the pretenders of Sufism do of singing, dancing, going into ecstasy, beating the tambourine, listening to flutes, and raising voices objectionably with what they call Dhikr (remembrance) and Tahlil, claiming it is a type of closeness to Allah Almighty.\nMany poets satirized them, such as Shaddad bin Ibrahim nicknamed Al-Tahir Al-Jazari, and the Dean Abu Muhammad Abdullah, Ahmad bin Ibrahim Al-Zawawi the scribe, and Zahir al-Din the judge of Salamiyah d. 610 AH = 1213 AD (3), who satirized Makki, the Sheikh of the Fuqara Zawiya in Bawazij, a small town near Salamiyah, saying: [Mutaqarib Meter]\nTell Makki the advice of a sincere advisor ... For the right of advice is to be listened to\nWhen did people hear in their religion ... That singing is a Sunnah to be followed?",
    "foot_note": "1. Al-Ghazali: Ihya' Ulum al-Din, 2/ 236. Ibn al-Jawzi: Talbis Iblis 267 (Criticism of Sufi conduct in singing and Sama'. Al-Suhrawardi: Awarif al-Ma'arif, Chapter 24 \"Saying and Sama'\").\n2. Ibn al-Jawzi: Talbis Iblis, 247, 250, 260.\n3. He is Abu Ishaq, Ibrahim bin Nasr bin Askar. See Ibn Khallikan: Wafayat al-A'yan 7/ 37 - 38.",
    "book_id": "97"
  },
  {
    "serial_number": "281892",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 14,
    "volume_number": 1,
    "text": "And that a person eats the eating of a camel ... And dances in the gathering until he falls\nIf he was empty-stomached, hungry ... He would not have spun out of rapture or listened\nThey said we became drunk with the love of God ... And nothing intoxicated the people but the bowls [of food]\nLikewise donkeys, when they graze in fertile land ... Their hydration and fullness make them jump\n- Consorting with Beardless Youths (Amrad) and Young Boys: Some Sufis considered all prohibitions and major sins lawful, and openly displayed immorality, debauchery, and shameful acts. The night of Mashush takes place publicly among the Sufis of Shiraz (1). Al-Tanukhi narrated its news in Nishwar al-Muhadarah (2). Ibn Khafif al-Baghdadi, the Sheikh of the Sufis of Shiraz, had a Sufi companion die, leaving a Sufi wife. The Sufi women gathered to console her. When the burial ceremonies ended, Ibn Khafif arrived at the house and began consoling the woman with Sufi speech until he said: I have become celibate/single. He said to her: Is there a Ghayr (Other) here (3)? She said: No Ghayr (4). He said: So what is the meaning of souls committing to the afflictions of worries and tormenting them with the punishment of griefs? And for what meaning is mixing (Imtizaj) left (5) so that lights meet (6) and souls become pure and",
    "foot_note": "1. See Al-Zayyat (Habib): Kitabat al-Diyarat in the first part of Masalik al-Absar by Ibn Fadlallah al-Umari, Al-Machriq Journal 42: 1948, 297.\n2. Al-Tanukhi: Nishwar al-Muhadarah, Journal of the Arab Academy in Damascus, Issue 17 pp. 261 - 262.\n3. Meaning: Is there anyone here who disagrees with the doctrine?\n4. Meaning: There is no one who opposes.\n5. Metaphor for intercourse.\n6. Meaning the Divine Light.",
    "book_id": "97"
  },
  {
    "serial_number": "281893",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 15,
    "volume_number": 1,
    "text": "differences occur and blessings descend? The women said: If you wish. So the group of men mixed with the group of women all their night. When it was pre-dawn, they left. It seems that incident took place on the first day of the fast, or the first Sunday of the fast according to Al-Shabushti's narration in Al-Diyarat (1), and that day became a celebration for them where men mix with women.\nIbn al-Jawzi pointed out that the Sufis of his time had closed the door of looking at foreign women upon themselves, due to their distance from associating with them and their refraining from mixing with them, and busied themselves with worship instead of marriage. But companionship of young boys happened to them in the guise of discipleship (Irada) and intent of asceticism (2). Ibn al-Jawzi decides that the bane of Sufis in his time was in accompanying young boys and associating with opposites (3). The calamity did not stop at this limit but went beyond it to legitimize that for the Sufis. Abu al-Fadl, Muhammad bin Tahir, known as Ibn al-Qaysarani al-Shaybani d. 507 AH = 1113 AD wrote a treatise on the permissibility of Sama' and looking at beardless youths (4).\nAmong the Sufis famous for shamelessness and permissiveness were Khidr al-Kurdi, the Sheikh of King al-Zahir Baybars, Sheikh Abu al-Hasan al-Hariri, and Sulayman bin al-Muwallah the Majdhub (ecstatic). Ali al-Hariri was the most shameless of Sufis in associating with young boys, \"so whoever",
    "foot_note": "1. Mentioned when discussing the Monastery of Sisters p. 93, and see Ibn Fadlallah al-Umari: Masalik al-Absar, 1/ 280 - 282 (Investigation by Ahmed Zaki Pasha).\n2. Ibn al-Jawzi: Talbis Iblis, 265.\n3. Previous Reference, 276.\n4. Al-Sha'rani: Al-Tabaqat al-Kubra, 2/ 129.",
    "book_id": "97"
  },
  {
    "serial_number": "281894",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 16,
    "volume_number": 1,
    "text": "of the young boys and children of soldiers and princes and others cast his eyes upon him would think well of him, and incline towards him, and would no longer benefit his family, but would stick to him and stay with him, believing in him and inclining towards him\" (1).\nAlthough the phenomenon of accompanying beardless youths, young boys, and effeminates was clear in the late Abbasid eras, it intensified in the Mamluk era, following the arrival of a sect of Oirat Tatars (2), famous for beauty in the year 695 AH = 1295 AD, and their spread in Egypt and the Levant, and then entering the service of Mamluk Emirs. The Mamluk Emirs competed in acquiring their boys and girls. Those remaining of these Oirats after that joined the army, and dispersed in the kingdoms spreading corruption with them. Groups of Sufis found what they were looking for in them, so they exaggerated in conferring Sufi legitimacy on their heinous act. Al-Sha'rani - one of the major Sufis of the tenth century AH - reported to us the news of the righteous Muhammad bin Iraqi, who would not enable his son Ali to go out to the market, when he was beardless, unless he was veiled for fear for him from evil and temptation (Fitna) (3).\nThe matter did not stop at beardless youths and young boys but extended to others like beasts and animals. The Sufi Sheikh Ali Wahish (d. 917 AH / 1511 AD) was a frequent assaulter of beasts and female donkeys (4).\nThis type of Sufism was a mockery of religions, a distance from the path of asceticism and worship, and shamelessness, until the Sufis of the centuries following the sixth",
    "foot_note": "1. Al-Dalaji: Al-Falaka, 72. Ibn al-Fuwati: Al-Hawadith al-Jami'ah, 325.\n2. Mongol tribes that inhabited the upper part of the Yenisei River line in Central Asia.\n3. Al-Sha'rani: Lawaqih al-Anwar, 2/ 257. Zaki Mubarak: Al-Tasawwuf, 1/ 257.\n4. Al-Sha'rani: Al-Tabaqat al-Kubra, 2/ 129 - 130.",
    "book_id": "97"
  },
  {
    "serial_number": "281895",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 17,
    "volume_number": 1,
    "text": "Hijri century deserved the title \"The Saboteur Fuqara\", because they contradict Sunan and customs and depart from etiquettes and laws (1).\n- Consuming Hashish: A number of Sufis persisted in consuming hashish, claiming that it removes dense worries from their hearts, and clears their noble thoughts by its effect. We do not have a reliable text regarding how it entered the Islamic world, as narrations about it have varied. Some narrations attribute it to the Indian Birzatan who carried it with him from India to Persia in the first century AH, and then it was transferred by the Qalandariyyah group who were organized in the ranks of Sufism, and they shaved their heads, eyebrows, and mustaches (2).\nAnother narration attributes its discovery to Sheikh Haydar d. 618 AH = 1221 AD, who made it a Waqf (endowment) for his comrades from the Sufis of Khorasan, and bequeathed that it be planted on his grave after his death. From there it moved to Baghdad, then the Levant and Egypt. It is worth noting that the Haydariyyah group came to Damascus after the year 655 AH = 1257 AD, wearing conical hats (Taratir) on their heads, their beards cut, and their mustaches uncut. They built a Zawiya for themselves outside Damascus, and from there they reached Egypt (3).\nSufi poets sang the praises of hashish, and called it by several names such as the Hashish of the Fuqara, Haydar's Wine, and Qalandariyyah. Their poet Muhammad bin Ali bin al-A'ma was the poet most fond of mentioning the virtues of hashish, so he said: [Tawil Meter]",
    "foot_note": "1. Al-Zayyat: The Saboteur Fuqara, Al-Machriq Journal, Vol 43 Year 1949, 511 - 515.\n2. Ibn Shakir al-Kutubi: Fawat al-Wafayat, 2/ 112.\n3. Al-Maqrizi: Al-Suluk, Vol 1 Part 1 p 407.",
    "book_id": "97"
  },
  {
    "serial_number": "281896",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 18,
    "volume_number": 1,
    "text": "Leave wine and drink from Haydar's brew ... Amber-scented green like chrysolite\nGiven to you by a gazelle from the Turks, tender-necked ... Swaying on a branch of the Ban tree, soft\nYou think it in his palm when he passes it around ... Like the mark of cheek-hair on a rosy cheek\nIt sways with the slightest breeze that blows ... And leans towards the cool of the gentle breeze\nThe pigeons sing on its branches in the forenoon ... Delighting it with the cooing of the singing pigeon\nIt is the virgin not married by cloud water ... Nor squeezed one day by foot or hand\nNor did the priest ever tamper with its cup ... Nor did every crippled one approach its jar\nThere is no text prohibiting it according to Malik ... Nor is it [prohibited] according to Al-Shafi'i and Ahmad\nNor did Al-Nu'man establish the impurity of its essence ... So take it with the edge of the Indian sword\nAnd restrain the palms of worry with the 'Kif' (mood/hashish) and rest ... And do not put off the day of joy until tomorrow (1)\nThe Sufis introduced hashish to the Islamic world since the sixth century AH, and our nation still suffers from the effects of this social disease until today.\n- Claiming to perform Miracles and Supernatural Acts: A belief spread among Sufis that if a human exercises and strives in worship, he may join the noble angels to the extent of flying in the air and walking on water. Through exercise, according to their belief, the Sufi completely detaches from human fortunes. This belief is fundamentally the belief of the Brahmins (2), but it spread among the Sufis, and they were keen to publish news telling of one of them flying in the air. Sheikh Abu Yusuf, Safi al-Din, Al-Husayn bin Jamal al-Din Al-Ansari Al-Khazraji \"rose in his sitting posture to a height of two statures, and circled the expanse of the gathering where the Sufis were, then descended to his place!!\" (3).",
    "foot_note": "1. Al-Maqrizi: Al-Khitat, 3/ 40.\n2. Al-Ghazzi: Lutf al-Samar, 1/ 363.\n3. Safi al-Din al-Khazraji: Siyar al-Awliya, 30, investigation by Ma'mun Mahmoud Yasin and Iffat Wisal, Beirut ed.",
    "book_id": "97"
  },
  {
    "serial_number": "281897",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 19,
    "volume_number": 1,
    "text": "Ibn Taymiyyah denounced the Ahmadiyya Sufis for what they do of entering blazing fires, eating snakes, wearing iron collars on their necks, hanging chains on their shoulders, and wearing iron bracelets on their hands (1) and other supernatural acts.\nThe centuries from the seventh to the tenth AH were filled with news of the miracles and supernatural acts of these Sufis until it became a believed matter, where whoever denied it was exposed to punishment and harm. The effects of that extended to the following eras, especially in the Ottoman era, when Sufi orders became widely spread with many followers.\nSufism in that era was an evil that afflicted society, corrupting values and morals, and destroying laws and Sunan. Both Fath al-Din Ibn Sayyid al-Nas and Salah al-Din al-Safadi expressed the condition of Sufism with convincing phrases reflecting the reality of the Sufis. Sheikh Fath al-Din Muhammad bin Muhammad bin Sayyid al-Nas says about them: [Khafif Meter]\nWhat are the conditions of the Sufi in our time today ... Except six without increase\nWhich are... (2) sodomy and drunkenness and hashish (Satlah) ... And dancing and singing and pimping\nAnd if he raves and shows union (Ittihad) ... And incarnation (Hulul) out of his ignorance and repeats it\nAnd commits objectionable acts by reason and Sharia ... He is the Sheikh of Sheikhs, the owner of the prayer rug (3)\nAl-Safadi also described the appearance of one of the Sufi men, saying: \"An elderly poor sheikh, a harfush (ruffian), bare-headed, with disheveled hair, wearing",
    "foot_note": "1. Al-Maqrizi: Al-Suluk, Vol 2 Part 1 p 16.\n2. Obscene word.\n3. Al-Maqrizi: Al-Khitat, 2/ 424. Ibn Shakir al-Kutubi: Fawat al-Wafayat 3/ 287.",
    "book_id": "97"
  },
  {
    "serial_number": "281898",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 20,
    "volume_number": 1,
    "text": "a thin Dulaq (robe), worn out and thin, dirt has taken hold of it and grown in it and firmly established, gathered from several patches, having a warmer he warms himself with its fire\" (1).\nAnalysis of the Material of the Treatise We Are Publishing:\nThe treatise discussed an important economic issue, which is: Is Waqf (endowment) and Will (Wasiyya) for Sufis valid or not? Because a large number of the town's interests, such as shops, bathhouses, markets, orchards, agricultural villages, mills, presses, and others, were endowed to the Sufis of a Khanqah or recommended to spend their revenue on a specific Sufi group. Consequently, only a handful of society benefits from these interests, enjoying their goods and gifts. They even influenced the course of political and social events in the nation, becoming influential and close to the rulers. In fact, the rulers themselves began to fear them, so they fawned over them by exaggerating in honoring them and lavishing money on them.\nThese Sufis constituted a heavy burden on the economy of society. The locals and farmers were burdened by providing for their needs, hoping to please them and gain their prayers. Goals were reversed, and Sufis drowned in corruption and corruption-spreading, directing social life as they wished. Their aura grew, and their influence exacerbated. So a group of scholars undertook the task of alerting society to the state of deterioration the Sufi movement had reached, by awakening feelings for the principles of true Sufism. This group of scholars re-examined Sufism and the reality of the Sufi in terms of principles and goals. The intent of that was to raise the issue among people, so they could compare the condition of Sufis in their time with what they ought to be.\nThe author of our treatise, Ja'far bin Tha'lab al-Adfawi, was one of those scholars who",
    "foot_note": "1. Salam: Literature in the Mamluk Era, Vol 1 p 203.",
    "book_id": "97"
  },
  {
    "serial_number": "281899",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 21,
    "volume_number": 1,
    "text": "wrote on the subject of Sufism. He dedicated chapters in our treatise to discuss the principles of Sufism, leaning on \"Al-Risalah Al-Qushayriyyah\" and quoting ten opinions of major Sufi jurists from it, presenting them in a simplified manner.\nRegarding the reality of the Sufi and speaking about him, our author addressed the attribution to Sufism, and clarifying to whom the attribution applies. He determined that innovations and the difference of Islamic sects after the year 200 AH are what took Sufism out of its principles and meaning (1). To succeed in convincing the reader or listener of the treatise, he cited more than twenty opinions of Sufi jurists from the people of the Path and people of knowledge and verification (2). The summary of what he concluded is that the Sufi in general custom is one who is characterized by attributes praised in the Sharia, adopts praised morals even if his nature is far from them, turning away from the world, turning towards the Hereafter, walking the path that is worthier for a person\". As for the specific custom, the Sufi is one who wears a specific dress of Dulaq (3) or Farajiyyah (4), has a turban, lets down a short tail from it in front of him, attends",
    "foot_note": "1. See the Treatise, 4b.\n2. The Treatise, 6a.\n3. Dulaq: A type of clothing worn under the outer cloak (Abaya), and it may be like a coat, wide without an opening except for the shoulder opening, woven from blue Tarh silk or black wool. See, Muhammad Isa Salihah: From the Documents of the Noble Sanctuary of Jerusalem, p 27. Dozy: Dictionary, 183. Mayer: Mamluk Costumes, 90.\n4. Farajiyyah: A loose garment, having two wide sleeves that slightly exceed the fingertips, and may have a tail let down from over the head. See Dozy: Dictionary of Clothing, 167 (Translated text published in Al-Lisan Al-Arabi Journal Vol 10 Part 3).",
    "book_id": "97"
  },
  {
    "serial_number": "281900",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 22,
    "volume_number": 1,
    "text": "at the Khanqah after Asr to attend reading and Dhikr, does not engage in lowly crafts like weaving, cupping, or garbage collection, and is not described as wealthy.\nIt is as if Al-Adfawi wanted to say that the conditions for joining the ranks of Sufism in his time were:\n- Dressing in specific costumes.\n- consistently attending the Khanqah after Asr for reading and Dhikr.\n- Not practicing lowly crafts like weaving, cupping, and garbage collection.\n- Not being known for wealth.\nWhatever else of asceticism, worship, and distance from worldly adornments became neglected.\nAl-Adfawi paved the way with the previous two chapters to reach the third chapter, which is \"Who deserves Waqf and Will among the Sufis\". This chapter is the core of the treatise and the main purpose for its composition. This chapter enters into the theories of obligation and commitment in civil law jurisprudence, in the merits of \"Custom\" (Urf). The legal material he presents is that custom is arbiter and decisive in dispute if it is disciplined and undisputed in a specific country. If custom is disturbed in that country, clarification becomes obligatory then, meaning the ruling is linked to causes. Thus, Waqf is not valid for Sufis due to the lack of discipline in the meaning of Sufism and its stopping at a limit.\nThe author of the treatise elaborated in citing what is in the four schools of thought regarding the permissibility or impermissibility of Waqf. The Shafi'is do not permit it, as well as some Hanafi scholars. As for",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281901",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 23,
    "volume_number": 1,
    "text": "the Hanbalis, they permitted Waqf for those devoted to worship and purifying the self from blameworthy morals (1).\nThen our author discussed Al-Ghazali's opinion on Waqf for Sufis, which he mentioned in the book \"Ihya' Ulum al-Din\" (2). Al-Ghazali held that the Sufi is one who is characterized by the following:\n- Righteousness (Salah).\n- Poverty (Faqr).\n- Wearing Sufi attire.\n- Not being occupied with a craft.\n- Mixing with Sufis by way of cohabitation and association (3).\nThe author of our treatise addressed these issues, discussed them, and refuted them point by point, citing the sayings of major figures of asceticism and Sufism to prove his argument and invalidate Al-Ghazali's arguments. Our author based his refutation of Al-Ghazali on the following matters:\n- That Al-Ghazali did not proceed according to jurisprudential rules in what he presented.\n- That Al-Ghazali relied on modern Sufi customs.\n- Al-Ghazali's admission that he has no proof for what he says except habits and special customs.\n- Special custom has no consideration among the people of Fatwa (4).\n- Al-Adfawi presented a number of historical evidences invalidating the claim by attire, negating the condition of cohabitation and association, and even poverty and engaging in one craft over another. As for righteousness,",
    "foot_note": "1. The Treatise, 8a.\n2. Al-Ghazali: Ihya' Ulum al-Din, 2/ 153.\n3. The Treatise, 9a.\n4. The Treatise, 9b.",
    "book_id": "97"
  },
  {
    "serial_number": "281902",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 24,
    "volume_number": 1,
    "text": "the author of our treatise clarified that righteousness is limited to following the Sunnah of the Messenger, peace be upon him, and that the ways of Sufism must be according to the Quran and Sunnah (1), and he brought numerous evidences from the sayings of Sufi Imams famous for righteousness and verification.\nIt is noted that our author resented Al-Ghazali for presenting those views, and even met them with disapproval. When Al-Ghazali discussed staying in the Khanqah, the author of our treatise said: \"And this which Al-Ghazali mentioned does not suit his verification\" (2). In another place he said: \"...And he did not clarify it before, and referred to it, which is strange from him\" (3). In the course of his criticism of the book \"Al-Ihya\", he said: \"Because the book Al-Ihya is not set for verification according to the method of Fiqh, and most of it and much of it is built on Sufi speech\" (4).\nThe summary of what the author of our treatise concluded is that those affiliated with Sufism are three sections:\n- A section who followed what came in the Sharia, and stopped with what the scholars of Sunnah said. They deserve glorification and merit reverence and honoring (5).\n- A section who had extremism in Sufism, so they innovated paths and invented beliefs, and stopped with decorated words they collected. They enter into the group of disbelievers and deserve the Fire.\n- A section upon whom ignorance prevailed, and they stopped with what was innovated of customs and abandoned looking into knowledge (Ma'arif), divine gifts (Awarif), and sciences. They celebrated dancing, Sama', and desires. These are",
    "foot_note": "1. The Treatise 12b - 15a.\n2. The Treatise, 8b.\n3. The Treatise, 8b.\n4. The Treatise, 8b.\n5. He did not mention Waqf as a right for them, but sufficed with their deserving glorification, reverence, and honoring.",
    "book_id": "97"
  },
  {
    "serial_number": "281903",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 25,
    "volume_number": 1,
    "text": "the greatest losers in deeds in this world and the Hereafter (1). As for Waqf for the Sufis of his time, the author of the treatise does not approve it for the legal reasons we referred to. In that is cutting off a source of livelihood for a lazy, idle group that settled in their living to ease and comfort, and found rest pleasant. It was society's mistake to provide them with ways of life without toil, so each one of them filled his belly with delicious food and slept a deep sleep, waiting for more delicious food and easily obtainable pleasure. Truthful is he who said: We seek refuge in Allah from the Fire, and from the Sufi if he knows the door of the house.\nThe Author of the Treatise:\nHe is Ja'far bin Tha'lab bin Ja'far al-Adfawi, Abu al-Fadl, Kamal al-Din. He was born in the town of Edfu (2) in the year 685 AH = 1286 AD, and grew up there. Then he studied at the school of Qus, which had a school comparable to the schools of Cairo. Then he moved to Cairo and studied under a number of the professors of the era, including Abu Hayyan Muhammad bin Ali bin Yusuf al-Andalusi, Athir al-Din, Ibn Daqiq al-Eid, Taj al-Din al-Dashnawi, Ahmad bin Muhammad bin Ahmad Muhyi al-Din al-Qurtubi, and others.\nThe author was described as a historian, knowledgeable in literature, jurisprudence, inheritance laws, and music. He used to mourn the state of knowledge in his time among the scholars of his era, saying: [Kamil Meter]\nIndeed, the lessons in our Egypt in our time ... Were stamped with error and excessive shouting\nAnd discussions that do not end to a conclusion ... Argumentation and transporting apparent errors\nAnd a teacher showing discussions all of which ... Originated from confusion and mixtures",
    "foot_note": "1. See The Treatise, p 17.\n2. It is a town in Upper Egypt between Aswan and Qus. See \"Mu'jam al-Buldan\" (1/ 126) and \"Shadharat al-Dhahab\" (6/ 153) Al-Qudsi edition (M).",
    "book_id": "97"
  },
  {
    "serial_number": "281904",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 26,
    "volume_number": 1,
    "text": "And a narrator whose utmost knowledge became ... Parts he narrates from Al-Dimyati\nAnd so-and-so (female) narrates a high Hadith ... And so-and-so (male) narrates that from Asbat\nAnd the difference between their mighty and their deceived ... Is more eloquent than the tailor and the wheat seller\nAnd the virtuous scholar among them, his habit is ... The saying of (Aristotle) or Hippocrates\nAnd the sciences of Allah's religion called out openly ... This is a time in which my carpet has been folded (1)\nHis Works:\nAmong his most important works that we know:\n- Al-Tali' al-Sa'id al-Jami' Asma' Nujaba' al-Sa'id: He wrote it at the suggestion of his Sheikh Abu Hayyan. In it, he wrote biographies for the notables of his time from the region of Qus, its works, and cities. He arranged his biographies alphabetically, including 594 biographies, among them the biography of four women. The book was printed in 1966, verified by Sa'd Muhammad Hasan.\n- Al-Imta' fi Ahkam al-Sama': It discusses types of singing in terms of its permissibility and prohibition, and contains musical benefits about playing and percussion instruments. There are copies of it in the National Library and Archives, a second in the Azhari Library in Cairo, a third in the Topkapi Museum, Ahmed III Library No. A.1430, and a fourth in the Chester Beatty Library. See Brockelmann, Supplement 2/ 27 (2).\n- Al-Badr al-Safir wa Tuhfat al-Musafir: In it, he wrote biographies for some poets of the seventh century. It falls in two volumes:",
    "foot_note": "1. Al-Shawkani: Al-Badr Al-Tali', 1/ 182 - 183. Ibn Hajar: Al-Durar Al-Kaminah, 1/ 536 Beirut ed. n.d.\n2. See also the book Al-Imta' wa Al-Intifa' fi Mas'alat Sama' Al-Sama' by Al-Adfawi, Madrid National Library No. 246. Habiba Al-Zayyat: Lughat Al-Hadarah, Al-Machriq Journal Issue 63 Part 4, 5, July - August 1965 p 67 - 68.",
    "book_id": "97"
  },
  {
    "serial_number": "281905",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 27,
    "volume_number": 1,
    "text": "The first in the Vatican No. Mus.Borg.L.F.Araba, 168 and the second in Fatih Library in Istanbul No. 4201. And an incomplete copy in Vienna.\n- Fara'id al-Fawa'id wa Maqasid al-Qawa'id fi 'Ilm al-Fara'id: A copy of it is in the Gotha Library in [East] Germany.\n- Kitab al-Is'af: It was mentioned in the treatise we are publishing (1).\n- Kitab al-Muwafi bi-Ma'rifat al-Tasawwuf wa al-Sufi, which is the one we are publishing for the first time.\nIt is worth noting that Kamal al-Din al-Adfawi lived in Cairo, and took the Salihiyya School as a residence where Sheikhs frequented him (2). Al-Isnawi described him saying: \"He participated in multiple sciences, was a writer, poet, intelligent, generous, casting aside affectation, possessing muru'ah (chivalry).\" He died in Cairo after returning from Hajj in the year 748 AH = 1347 AD (3).\nDescription of Copies:\nThe Fatih collection at the Sleymaniye Library in Istanbul - Turkey holds a unique copy of the treatise registered under number 2876. The writer of these lines does not know of any other",
    "foot_note": "1. See The Treatise folio 6b.\n2. Al-Adfawi: Al-Tali' al-Sa'id, Introduction, sh.\n3. Ibn al-Imad al-Hanbali: Shadharat al-Dhahab, 6/ 153 from Al-Qudsi edition. Al-Shawkani: Al-Badr Al-Tali', 1/ 182. Al-Maqrizi: Al-Suluk Vol 2 Part 3 p 793. Al-Suyuti: Husn al-Muhadarah, 1/ 255. Ibn Taghri Bardi: Al-Nujum Al-Zahirah, 10/ 237. Al-Adfawi: Al-Tali' al-Sa'id A - T (Introduction).",
    "book_id": "97"
  },
  {
    "serial_number": "281906",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 28,
    "volume_number": 1,
    "text": "copy in Arab and foreign libraries other than it. On its title page came: Kitab al-Muwafi bi-Ma'rifat al-Tasawwuf wa al-Sufi. Authored by Ja'far bin Tha'lab al-Adfawi al-Shafi'i. In addition to the audition record (Sama') registered on the title page, which we will point out along with other audition records registered at the end of the treatise, there were phrases indicating that Al-Adfawi was a student of Abu Hayyan, in the author's handwriting. Then he converted the word Al-Qaymari to a phrase, a castle between Mosul and Khilat (Lub al-Lubab). Also an indication that the treatise was reviewed by Abu Hayyan al-Andalusi himself.\nAudition Records (Sama'at) on the Treatise:\nFirst: On the title page:\n1 - \"Heard all of this book from the mouth of its author, the Sheikh, the Imam, the Allamah, Kamal al-Din, Abu al-Fadl, Ja'far bin Tha'lab al-Shafi'i al-Adfawi, may Allah benefit by him, in the presence of our master and Sheikh, the Professor, the Imam, the Allamah, unique of his age and singular of his time, and weaver of his own [style], the wonder of time, Athir al-Din, Abu Hayyan, Muhammad bin Ali bin Yusuf bin Hayyan, may Allah extend his duration: Salih bin Abdullah bin Abdullah al-Dimashqi al-Qaymari, and this is his handwriting. And that was valid on Monday, the eighteenth of Safar, year seven hundred and forty-one, at the house of our Sheikh Abu Hayyan in the Salihiyya School between the Two Palaces in Cairo the Guarded. And they authorized me all that is permissible for them to narrate. Praise be to Allah Lord of the Worlds and may Allah bless our Master Muhammad and grant peace\".\nIt is understood from the audition record that the one who registered it is Salih bin Abdullah bin Abdullah al-Dimashqi al-Qaymari, and that was on 18 Safar 741 AH, at Abu Hayyan's house in Cairo, and that this Salih was authorized to narrate by Al-Adfawi and Abu Hayyan.",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281907",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 29,
    "volume_number": 1,
    "text": "Second: On folio 18 or 18b, I found the following audition records:\n1 - Heard it all on its author the Sheikh, the Imam, the Allamah Kamal al-Din, Abu al-Fadl al-Adfawi, may Allah treat him well, by the reading of... etc. the Muhaddith, the Traveler, Izz al-Din bin Hamza bin Ahmad al-Hakkari... etc., Burhan al-Din, Ibrahim bin Ahmad bin Abi Bakr al-Fadi -sic- al-Murshidi and Abdul Aziz bin Muhammad the Muazzin al-Baghdadi and this is his handwriting. Correct and established at Dar al-Hadith al-Kamiliyyah (1) in Cairo, on Thursday eighteenth of Ramadan year seven hundred and forty. May Allah bless our Master Muhammad the Prophet and his family and companions and grant peace.\nIt is understood from the audition record that it took place in Dar al-Hadith al-Kamiliyyah which was established by Sultan al-Malik al-Kamil Nasir al-Din Muhammad bin al-Malik al-Adil Abu Bakr bin Ayyub in the year 622 AH = 1225 AD. It is the second school made for Hadith, and he endowed it for those working in Hadith, and it was located in the Bayn al-Qasrayn district. Three scholars heard it, and the audition record was registered in the handwriting of Abdul Aziz bin Muhammad the Muazzin al-Baghdadi, and its date was before the audition record registered on the title page.\n2 - On page 18b is what indicates the reading of the treatise by Abdul Aziz bin Muhammad bin Khalaf al-Nuri, and Abdul Wahid bin Sa'id al-Ghazazi and Sheikh Muhammad al-Samudi heard it from him. That was at the Salihiyya School in Cairo the Mu'izziyyah on the eighteenth of the month of Muharram al-Haram, the opening of the months of the year 743\". Written by Ja'far bin Tha'lab bin Ja'far bin Ali bin Mutahhar bin Wa'il al-Adfawi, praising Allah and sending blessings on His Prophet, and Allah is Sufficient for us and the Best Disposer of affairs.",
    "foot_note": "1. About Dar al-Hadith al-Kamiliyyah, see Al-Maqrizi: Al-Khitat, 2/ 375. Ahmad Fikri: Mosques and Schools of Cairo, 2/ 55.",
    "book_id": "97"
  },
  {
    "serial_number": "281908",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 30,
    "volume_number": 1,
    "text": "It is understood from the audition record that the author authorized Abdul Aziz al-Nuri to narrate, and he attended the reading on the referenced date. Also on the same page is what indicates its transcription by Yahya al-Ja'fari.\nThe manuscript was written in beautiful Naskh script in black and red ink. The titles were written in red ink, in larger script, and red ink was used to underline important phrases in the treatise. Number of folios: 18 f. Number of lines: 15 l. Dimensions: 19.7 x 14 cm. Number of words per line from (7 - 11) words. The name of the copyist or its date was not mentioned. It seems that the copy was reviewed by someone, and it has ownership notes, as well as a Waqf in the name of Sultan Ghazi Mahmud Khan.\nBefore concluding my speech, I extend my sincere thanks to Professor Dr. Khalid Abdul Karim Jum'ah who had the merit of the book's appearance among the publications of the esteemed Dar Al-Orouba Library. And to Mr. Mahmoud Al-Arna'ut who undertook the extraction (Takhrij) of the Hadiths mentioned in the book.\nKuwait on 27/ Rajab/ 1408 AH corresponding to 15/ March/ 1988 AD\nDr. Muhammad Isa Salihah\n* * *",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281909",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 31,
    "volume_number": 1,
    "text": "A Rare Book on Criticizing Sufism\nThe Faithful Guide to Understanding Sufism and the Sufi\nAuthored by Imam Kamal al-Din Abu al-Fadl Ja'far bin Tha'lab al-Adfawi al-Masri (685 - 748 AH)\nVerified, introduced, and annotated by Dr. Muhammad Isa Salihah\nDar Al-Orouba Library for Publishing and Distribution\nKuwait",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281910",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 33,
    "volume_number": 1,
    "text": "The Faithful Guide to Understanding Sufism and the Sufi\nHeard all of this book from the mouth of its author, the Sheikh, the Imam, the Allamah, Kamal al-Din, Abu al-Fadl, Ja'far bin Tha'lab al-Shafi'i al-Adfawi, may Allah benefit by him, in the presence of our master and Sheikh, the Professor, the Imam, the Allamah, unique of his age and singular of his time, and weaver of his own [style], the wonder of time, Athir al-Din, Abu Hayyan, Muhammad bin Ali bin Yusuf bin Hayyan (1), may Allah extend his duration: Salih bin Abdullah bin Abdullah al-Dimashqi al-Qaymari (2), and this is his handwriting. And that was valid on Monday, the eighteenth of Safar, year seven hundred and forty-one, at the house of our Sheikh Abu Hayyan in the Salihiyya School (3) between",
    "foot_note": "1. See his biography in, Ibn Hajar: Al-Durar Al-Kaminah, 4/ 302. Al-Maqqari: Nafh al-Tib, 1/ 625. Ibn Khaldun: Al-Ibar, 6/ 144. Al-Suyuti: Bughyat al-Wu'at, 121. Ibn Hazm: Jamharat al-Ansab, 464. Al-Adfawi: Al-Tali' al-Sa'id, Introduction from (W - Y).\n2. Ibn Hajar said: (He is one of the prolific students of Hadith, he took care in seeking [knowledge], and toured the Sheikhs after the year (30), increasing in Egypt, Alexandria, and Damascus. See \"Al-Durar Al-Kaminah\" (1/ 202) and \"Dhayl Al-Ibar\" by Al-Husseini p (271).\n3. Al-Salihiyya School: in the Bayn al-Qasrayn district, built by King Najm al-Din Ayyub. He began building it on 13 Dhu al-Hijjah 639 AH, and arranged lessons for the jurists of the four schools in it in the year 641 AH. Al-Adfawi mentioned in Al-Tali' al-Sa'id in the events of the year 724 AH, that Abu Hayyan lived in it on 11 Safar 724 AH. Its name appeared wrongly in the original, as it was mentioned as \"Al-Salahiyya\". See about it, Al-Maqrizi: Al-Khitat, 2/ 347. Al-Suyuti: Husn =",
    "book_id": "97"
  },
  {
    "serial_number": "281911",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 34,
    "volume_number": 1,
    "text": "the Two Palaces in Cairo the Guarded. And they authorized me all that is permissible for them to narrate. Praise be to Allah Lord of the Worlds and may Allah bless our Master Muhammad and grant peace.\n* * *\nIn the name of Allah, the Most Gracious, the Most Merciful\nPraise be to Allah, Knower of what consciences conceal, Aware of what tongues reveal and what secrets hide, the Bestower of various acts of obedience, so that every person performs what they are capable of; whoever misses one type of it, is persevering in another type.\nHe sent Muhammad from the noblest tribes and most honorable elements, and made him foremost in virtue even if his existence was in the later time. And He singled him out with companions who are like shining stars, the elite of creation, and upholders of the truth, so pinkies are counted upon them [in enumerating virtues]. They are the people of purity, masters of loyalty, seniors of masters, and masters of seniors. So may Allah bless him and his family and companions, a prayer by which abundant, ample reward is attained, and clothes with the best garments and finest prides.\nTO PROCEED: A discussion has occurred regarding the name of Sufism (Tasawwuf), the reality of the Sufi, and who deserves the revenue of what is endowed (Waqf) or bequeathed (Wasiyya) to the Sufis. So these are three requirements.\nRequirement One:\nTasawwuf (Sufism): It is an expression for intending the path of a specific group called Sufiyyah, by which one characterizes oneself. It was said about it: It is from the form 'Tafa'ul', when one enters into the action like your saying: 'Taqammasa' (he put on a shirt), if he wore the shirt.\nThe Imam, the Professor, Abu al-Qasim, Abd al-Karim bin Hawazin al-Qushayri (1)",
    "foot_note": "1. = Al-Muhadarah, 2/ 144. Tarikh al-Khulafa', 307. Ibn Habib: Tadhkirat al-Nabih, 1/ 342. Al-Adfawi: Al-Tali' al-Sa'id, 106.\n1. He is Abd al-Karim bin Hawazin bin Abd al-Malik bin Talha al-Naysaburi al-Qushayri =",
    "book_id": "97"
  },
  {
    "serial_number": "281912",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 35,
    "volume_number": 1,
    "text": "-the one connected to their path- said: \"He is called Mutasawwif (Sufi aspirant), and the group Mutasawwifah\" (1). He said: This name has no analogy or derivation from the aspect of Arabic language, nor did a trace appear regarding it; it is a title (Laqab) (2).\nThis is the discussion on it from the aspect of customary coinage, agreed upon terminology. As for people's sayings regarding that, there are articles:\nAbu Uthman, Sa'id bin Isma'il (3) - one of the seniors of this sect - said: Tasawwuf: Companionship with Allah with good manners and continued awe and observation, and companionship with the Messenger of Allah by following his Sunnah and adhering to the apparent knowledge (4).",
    "foot_note": "1. = (d. 145 [Should be 465] AH), from Banu Qushayr bin Ka'b, the professor of the Sufis in his time, one of the Shafi'i jurists, Muhaddith, exegete, linguist, famous for his treatise on Sufism. See, Al-Baghdadi (Al-Khatib), Tarikh Baghdad 11/ 83. Ibn Khallikan: Wafayat, 2/ 375, 3/ 205 (Ihsan Abbas). Abu al-Fayd: Jamharat al-Awliya (A'lam al-Sufiyyah), 2/ 146. Ibn Asakir, Tabyin Kadhib al-Muftari, 271. Al-Subki: Tabaqat al-Shafi'iyyah, 5/ 153. Ibn Khaldun: Al-Ibar, 3/ 259. Ibn al-Imad al-Hanbali: Shadharat, 3/ 319 Al-Qudsi edition.\n1. Appeared in Al-Risalah Al-Qushayriyyah, 2/ 550.\n2. Appeared in Al-Risalah Al-Qushayriyyah, 2/ 550 but the phrase was \"...and the most apparent regarding it is that it is a title.\"\n3. He is Abu Uthman, Sa'id bin Isma'il bin Sa'id bin Mansur al-Hiri (and in some sources al-Jabri, and the first is more correct) d. 298 AH, from Rayy, resided in Nishapur, and spread Sufism in Khorasan. See his biography in, Al-Sulami: Tabaqat al-Sufiyyah, 1/ 170. Abu Nu'aym: Hilyat al-Awliya, 10/ 244. Ibn al-Jawzi: Al-Muntazam, 6/ 106. Ibn Khallikan: Wafayat al-A'yan, 2/ 369. Al-Baghdadi (Al-Khatib): Tarikh Baghdad, 9/ 99. Al-Qushayri: Al-Risalah 1/ 136. Al-Kalabadhi: Al-Ta'arruf, 46. Al-Sha'rani: Al-Tabaqat 1/ 86. Ibn al-Imad: Shadharat, 2/ 230 Al-Qudsi edition.\n4. Appeared in Al-Risalah Al-Qushayriyyah, 1/ 138 - 139.",
    "book_id": "97"
  },
  {
    "serial_number": "281913",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 36,
    "volume_number": 1,
    "text": "Abu al-Husayn, Ahmad bin Muhammad al-Nuri (1) - the Sheikh of the Path - said: Tasawwuf is leaving every share for the self (2).\nAbu Amr Isma'il bin Nujayd (3) said: Tasawwuf is patience under command and prohibition (4).\nAbu Muhammad al-Jurayri (5) said: Tasawwuf is entering into every lofty character and exiting from every lowly character (6).",
    "foot_note": "1. Abu al-Husayn, Ahmad bin Muhammad bin Abd al-Samad al-Nuri d. 295 AH: Born and raised in Baghdad, originally from Bagh, Khurasani, peer of Al-Junayd. Al-Khatib Al-Baghdadi said about him: \"He is the most knowledgeable of the Iraqis in the subtleties of the folk.\" See, Al-Khatib Al-Baghdadi: Tarikh Baghdad, 5/ 130. Abu Nu'aym: Hilyat al-Awliya, 10/ 249 - 255. Ibn al-Jawzi: Al-Muntazam, 6/ 77. Al-Sulami: Tabaqat al-Sufiyyah, 164. Al-Qushayri: Al-Risalah 1/ 140. Al-Kalabadhi: Al-Ta'arruf, 42. Al-Sha'rani: Tabaqat, 1/ 87.\n2. Appeared in Al-Risalah Al-Qushayriyyah, 1/ 140 (Egypt ed.), Al-Ta'arruf li-Madhhab Ahl al-Tasawwuf, 34 and Tabaqat al-Sufiyyah, 166.\n3. He is Abu Amr, Isma'il bin Nujayd bin Ahmad bin Yusuf bin Khalid al-Sulami (d. 366 AH), a highly regarded Sufi, the last to die among the companions of Abu Uthman, Sa'id bin Isma'il. See his biography, Al-Qushayri: Al-Risalah, 1/ 210. Al-Hanbali (Ibn al-Imad): Shadharat al-Dhahab, 3/ 5. Al-Sha'rani: Al-Tabaqat, 1/ 120. Ibn al-Jawzi: Al-Muntazam, 7/ 84. Al-Sulami: Tabaqat al-Sufiyyah, 454 - 457.\n4. Appeared in Al-Risalah Al-Qushayriyyah, 1/ 210.\n5. He is Ahmad bin Muhammad bin al-Husayn al-Jurayri (d. 311 AH), one of the major companions of Al-Junayd. Al-Junayd seated him in his place by his testament. See, Al-Qushayri: Al-Risalah, 1/ 166. Al-Sulami: Tabaqat al-Sufiyyah, 259. Abu Nu'aym: Hilyat al-Awliya, 10/ 347. Al-Baghdadi (Al-Khatib): Tarikh Baghdad, 4/ 430. Al-Sha'rani: Al-Tabaqat, 1/ 94.\n6. Appeared in Al-Risalah Al-Qushayriyyah, 2/ 551, and Al-Luma' by Al-Tusi, 45, where it is narrated from Muhammad bin Ahmad bin Yahya al-Sufi from Abdullah bin Ali al-Tamimi from Abu Muhammad al-Jurayri (by hearing).",
    "book_id": "97"
  },
  {
    "serial_number": "281914",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 37,
    "volume_number": 1,
    "text": "Muhammad bin Ali (1) - one of the Sheikhs - said: Tasawwuf is noble morals (2).\nThe Professor of the Sect, Al-Junayd bin Muhammad the Jurist (3) said: Tasawwuf is Dhikr with gathering, ecstasy (Wajd) with listening, and action with following (4).\nRequirement Two: On the reality of the Sufi\nThe discussion on it is in two standings:\nOne of them: On Attribution.\nThe second: On explaining whom the attribution truly applies to.\nFirst Standing: Attribution.\nProfessor Al-Qushayri said: People after the Prophet used to be called Companions (Sahaba); for there is no virtue above that. Then those who met the Companions were called Followers (Tabi'in), then Followers of the Followers (Atba' al-Tabi'in). Then",
    "foot_note": "1. He is Muhammad bin Ali al-Qassab, Al-Junayd's professor in Sufism. See Al-Tusi: Al-Luma', 45. Al-Risalah Al-Qushayriyyah, 2/ 553.\n2. Appeared in Al-Risalah Al-Qushayriyyah 2/ 552 and its completion is \"appeared in a noble time, from a noble man, with noble people.\"\n3. He is Al-Junayd bin Muhammad the Jurist, al-Baghdadi, Abu al-Qasim al-Kharraz, d. 297 AH, master of the sect and Imam of the Sufis in his time. His upbringing and birth were in Iraq, his origin from Nahavand. He followed the school of Abu Thawr, Ibrahim bin Khalid bin al-Yaman, al-Kalbi. His father was nicknamed Al-Qawariri for working in selling glass. Regarding his biography see, Abu Nu'aym, Hilyat al-Awliya, 10/ 255 - 287. Ibn al-Jawzi: Al-Muntazam 6/ 105. Ibn Khallikan: Wafayat, 1/ 146. Al-Subki: Tabaqat, 2/ 28. Al-Kalabadhi: Al-Ta'arruf, 1/ 132 - 136. Al-Sha'rani: Tabaqat, 1/ 84. Al-Baghdadi (Al-Khatib): Tarikh Baghdad, 7/ 241 - 249. Al-Qushayri: Al-Risalah, 1/ 33 (Egypt ed.). Ibn Khallikan: Wafayat al-A'yan, 1/ 373. Ibn al-Athir: Al-Bidayah, 8/ 62.\n4. Appeared in Al-Risalah Al-Qushayriyyah, 2/ 553.",
    "book_id": "97"
  },
  {
    "serial_number": "281915",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 38,
    "volume_number": 1,
    "text": "people differed and ranks varied, so the elite of people who had intense care for matters of religion were called Ascetics (Zuhhad) and Worshippers (Ubbad). Then innovations appeared and claims arose between sects, so the elite of Ahl al-Sunnah, who observe their selves with Allah, and protect their hearts from the intrusions of heedlessness, singled themselves out with the name of Tasawwuf. He said: This name became famous for them before two hundred years from Hijra (1).\nHe said: Ahmad bin Hanbal, may Allah have mercy on him, used to say to Abu Hamza al-Bazzaz al-Baghdadi (2): What do you say on this issue, O Sufi? He was a jurist knowledgeable in readings (3).\nThen people differed on what this attribution is to? Some of them said: Attributed to Purity (Safa'), when their hearts became pure and cleansed from turbidities, this attribution was made for them (4). Al-Qushayri said: This is far-fetched from the linguistic aspect. It seems he considered it unlikely because attribution to Safa' is Safawi, but it is possible that its origin was Safawi, then alteration occurred from those circulating the word.",
    "foot_note": "1. Appeared in Naqd al-Ilm wa al-Ulama \"Talbis Iblis by Ibn al-Jawzi\", 173. Al-Risalah Al-Qushayriyyah, 2/ 61 - 62.\n2. Abu Hamza al-Bazzaz al-Baghdadi, from the children of Isa bin Aban, was knowledgeable in readings, one of Al-Junayd's companions, but he died before Al-Junayd. We do not know his exact year of death. See Al-Baghdadi (Al-Khatib): Tarikh Baghdad, 1/ 390. Al-Sulami: His Tabaqat, 295. Al-Qushayri: Al-Risalah, 1/ 173. Al-Sha'rani: Al-Tabaqat 1/ 99.\n3. Appeared in Al-Risalah Al-Qushayriyyah, 1/ 173.\n4. Appeared in Al-Ta'arruf li-Madhhab Ahl al-Tasawwuf, 28.",
    "book_id": "97"
  },
  {
    "serial_number": "281916",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 39,
    "volume_number": 1,
    "text": "Some of them said: Attributed to the Suffah (Bench), because they were stripped of worldly fortunes, resembling in their state the state of Ahl al-Suffah (1), so they obtained this attribution. This was objected to because attribution to Suffah is Suffi not Sufi, and it is answered with what the first was answered with (2).\nSome of them said: Attributed to the Saff (Row), as if by what they undertook of eagerness for virtue and deeds that bring closeness and seeking precedence to Allah's pleasure. It is objected to with what was objected, and answered with the like of what was answered with (3).",
    "foot_note": "1. Ahl al-Suffah: A group of poor people who used to reside in the Suffah of the Mosque of the Messenger of Allah, peace and blessings be upon him, which was made for the ascetics of Muslims who renounced worldly goods. Among the most important sources that chronicled them: Kitab Tarikh Ahl al-Suffah by Abu Abd al-Rahman al-Sulami (d. 412 AH), and Kitab al-Tuhfah fi al-Kalam ala Ahl al-Suffah by Taqi al-Din al-Subki (d. [756] AH). Abd al-Rahman Badawi dedicated a chapter to them in his book: Tarikh al-Tasawwuf al-Islami, Kuwait ed., 1975 p 127. Their news appeared in Al-Tabaqat by Ibn Sa'd Vol 2 Part 2 p 13 Sachau edition, Musnad Ahmad bin Hanbal, Sahih Al-Bukhari, Muslim, Sunan Al-Tirmidhi, Sunan Ibn Majah, Kitab Al-Luma' by Abu Nasr al-Sarraj al-Tusi (132 - 134), Kitab Al-Ta'arruf by Al-Kalabadhi, Chapter One p 5, Egypt ed., and Hilyat al-Awliya by Abu Nu'aym, 1/ 337, 2/ 1 - 34) Egypt ed., Kashf al-Mahjub by Al-Hujwiri 97 - 99 (Zhukovsky edition), Ihya' Ulum al-Din by Al-Ghazali, 3/ 167 Cairo ed. 1289 AH, and Talbis Iblis by Ibn al-Jawzi, 176 Cairo ed., 1928 AD. Abu al-Fayd: Jamharat al-Awliya, Ahl al-Suffah, 131. Qasim Ghani: Tarikh al-Tasawwuf, 60.\n2. Appeared in Al-Risalah Al-Qushayriyyah, 1/ 173. Jamharat al-Awliya wa A'yan al-Tasawwuf by Abu al-Fayd, 153.\n3. Regarding definitions see also. Al-Qushayri: Al-Risalah Al-Qushayriyyah (Egypt ed.), 2/ 550 - 551. Al-Kalabadhi: Al-Ta'arruf li-Madhhab Ahl al-Tasawwuf, 28. Ibn al-Jawzi: Talbis Iblis, 162.",
    "book_id": "97"
  },
  {
    "serial_number": "281917",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 40,
    "volume_number": 1,
    "text": "Some of them said: Attributed to wearing Wool (Suf) (1), and this is correct linguistically. Al-Qushayri objected to it saying that the folk did not exclusively wear wool. It is answered that it is predominant on those who seek roughness of living, minimizing the world, and austerity in it. Who leaves soft clothes and is content with rough ones. Wearing wool and cotton is predominant in this state. Wool is more predominant due to the generality of its existence, and its roughness is more than the roughness of cotton. In the Sahih Hadith from Abu Burda, he said: Aisha brought out for us a thick cloak and a thick Izar (lower garment), and said: The [soul of] the Messenger of Allah was taken in these two (2). Al-Tirmidhi narrated from the Hadith of Abdullah bin Masoud from the Prophet who said: \"Upon Moses the day his Lord spoke to him was a cloak of wool, a Jubba of wool, a Kumma (cap) of wool, and trousers of wool (3). Therefore also, those who take themselves to turning away from worldly matters from past nations are characterized by wearing wool like monks and their likes so they hardly separate from it.\nSome of them said: It is an attribution to Musafah (Mutual Purity/Sincerity). The poet said:\nHe was pure (Safa) so he was called Sufi (Sufiya) until he was nicknamed the Sufi (4).",
    "foot_note": "1. See Al-Kalabadhi: Al-Ta'arruf, 29, 30.\n2. Narrated by Al-Bukhari No. 5817 in Clothing: Chapter on Cloaks and Khamis, and in Jihad: Chapter on mentioning the armor of the Prophet, peace and blessings be upon him, his stick and his sword. And Muslim No. (2080) in Clothing: Chapter on Humility in Clothing. See \"Zad al-Ma'ad\" by Ibn Qayyim al-Jawziyyah (1/ 141). (M).\n3. Narrated by Al-Tirmidhi No. (1734) in Clothing: Chapter on what came regarding wearing wool, and it is a weak Hadith. See \"Jami' al-Usul\" by Ibn al-Athir with verification by my father Sheikh Abdul Qadir Al-Arna'ut (M).\n4. See Al-Subki: Mu'id al-Ni'am, 173 where it says: =",
    "book_id": "97"
  },
  {
    "serial_number": "281918",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Faithful Guide to Understanding Sufism and the Sufi",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Orouba Library for Publishing and Distribution - Kuwait",
    "page_number": 41,
    "volume_number": 1,
    "text": "So he is sincere (Musafin) to his Master by service, compliance, turning to what pleases Him, and turning away from what is other than Him. And sincere (Musafin) to creation by discarding what is in their hands, and leaving turning to what is beloved to them. So he is sincere to them, and they are sincere to him. This is as was said about the sparrow of Paradise (1). When it avoided their wheat (Burrahum), it attracted their piety/kindness (Birrahum), or avoided their grain (Habbahum) so it attracted their love (Hubbahum). Likewise, when they became sincere to creation by leaving what is in their hands and not competing with them in their purposes and honors, they became sincere to them with their love, reverence, magnification, and honoring.\nIt was said, attributed to Sufana, which is a legume that grows in the desert. They were attributed to it because they sufficed with little and what is [hardly] paid attention to, content with a legume sufficing with it (2).\nIt was said: Attributed to Sufah, which is a tribe that used to serve the pilgrims in the first era. It is said: 'Ajizi (pass/allow) Sufah' (3). So they were masters of people and their saviors, and the role model",
    "foot_note": "1. = People disputed about the Sufi and differed ... of old and thought him derived from wool (Suf)\nI do not grant this name to other than a youth ... He was pure (Safa) so he was called Sufi (Sufiya) until he was named the Sufi\n1. Appeared in Hayat al-Hayawan \"Sparrow of Paradise\" meaning the Swallow, or Zuwwar al-Hind (Visitor of India). It is one of the birds that travel long distances, desiring closeness to people. It was named Sparrow of Paradise because it abstained from what is in people's hands of foods, so it does not eat wheat or grain, but feeds on flies and mosquitoes. It appeared in poetry:\nBe ascetic regarding what the hand of creation contains ... You will become beloved to all people\nDo you not see the Swallow forbade their provision ... It became a resident in houses, a fosterling\nSee Al-Damiri: Hayat al-Hayawan, 1/ 293. Al-Jahiz: Al-Hayawan, 3/ 332.\n2. See, Ibn al-Jawzi: Talbis Iblis, 163 where it says it is a short Raghba' legume, so they were attributed to it for sufficing with desert plants\". See also, Al-Dimyati: Mu'jam Asma' al-Nabat, 89.\n3. Banu Sufah: A clan from Mudar from Adnan, they are Banu al-Ghawth bin Murr, they used to serve the Kaaba =",
    "book_id": "97"
  },
  {
    "serial_number": "281919",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 42,
    "volume_number": 1,
    "text": "with them. When this group attained this rank, they were attributed to that tribe due to their sharing in precedence and emulating their actions, as mentioned by Abu Nu'aym and others.\n\nThe Second Station: Regarding who this attribution applies to\nIt applies in two considerations:\nFirst, Custom (Urf), in the language of the early people of the Path (Ahl al-Tariqah).\nSecond, in the specific Custom in our time and what is close to it.\nAs for the early ones, their expressions varied regarding that, but the meaning is one or close. Al-Nuri was asked about the Sufi, he said: He who hears the Sama' (spiritual listening) and prefers leaving causes (means of livelihood). Ibn al-Jalla' (1) was asked about him, he said: We do not know him within the condition of knowledge, but he is a Faqir (poor one) stripped of causes, and he was with Allah without a place\" (2).",
    "foot_note": "1. = In the pre-Islamic era (Jahiliyyah) and they would pour forth with the pilgrims from Muzdalifah to Mina, so no one could pass until they passed. They used to say 'Ajizi Sufah', then they became extinct. See Ibn al-Jawzi: Talbis Iblis, 161. Al-Qalqashandi: Nihayat al-Arab, 317. Ibn Manzur, Lisan al-Arab, 11/103. Ibn Khaldun: Al-Ibar, 2/319. Al-Nuwayri: Nihayat al-Arab, 2/344.\n1. Ibn al-Jalla' (Ahmad bin Yahya al-Jalla', Abu Abdullah) d. 306 AH, of Baghdadi origin, lived in Ramla and Damascus. He is one of the three Imams of Sufism in addition to Al-Junayd in Baghdad and Abu Uthman in Nishapur. He was nicknamed Al-Jalla' (The Polisher) because \"when he spoke, he polished hearts, and when he preached, he achieved the desired.\" See Abu Nu'aym: Hilyat al-Awliya, 10/314. Ibn al-Jawzi: Al-Muntazam, 6/148. Al-Khatib Al-Baghdadi: Tarikh Baghdad, 5/213. Al-Sulami: Tabaqat, 176. Al-Sha'rani: Tabaqat, 1/87. Al-Munawi: Al-Kawakib al-Durriyyah, 2/15. Al-Qushayri: Al-Risalah, 1/142-143.\n2. The phrase appeared in Al-Risalah al-Qushayriyyah 2/556. In it \"I heard Abu Hatim al-Sijistani, I heard Abu Nasr al-Sarraj say, Ibn al-Jalla' was asked, what is the meaning of their saying Sufi? =",
    "book_id": "97"
  },
  {
    "serial_number": "281920",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 43,
    "volume_number": 1,
    "text": "And the Sheikh of his time and the unique one of his age, Abu al-Hasan Ibn al-Sabbagh al-Qusi, said: The Sufi (1); he who forgives the stumble, conceals the slip, and fills the need (2).\nAbu Muhammad, Abd al-Latif bin Abi Tahir al-Tarsi al-Baghdadi known as al-Mutajjin (3) mentioned in his book \"Al-Dalil fi al-Tariq\" (The Guide in the Path); that he asked a group of people of knowledge and Sufism about the Sufi, so each of them mentioned a saying.\nSheikh Ahmad al-Rifa'i (4) said - and he was a jurist of the Shafi'i school -: He who fulfilled all the requirements and was purified from all turbidities.",
    "foot_note": "1. = He said: We do not know him within the condition of knowledge, but we know that whoever is a faqir stripped of causes, and is with Allah Almighty without a place and the Truth (Allah) Glory be to Him does not prevent him from knowledge of every place, is called a Sufi.\n1. He is Ali bin Hamid bin Ismail bin Yusuf, Sheikh Abu al-Hasan bin al-Sabbagh al-Qusi d. 612 AH, or 613 AH. The Sheikh of the age in Sufism, by the agreement of all references that translated his biography. Nubian most likely. He accompanied Sheikh Abd al-Rahim bin Ahmad bin Hajun al-Maghribi. His affair became famous in Upper Egypt. He grew up in his house amidst potential. He undertook teaching and dictation. He excelled in Fiqh, and leadership of the Sufis ended up with him. He died in Qena in Upper Egypt and was buried in his Ribat there. See Al-Adfuwi: Al-Tali' al-Sa'id, 383. Al-Shattanufi: Bahjat al-Asrar wa Ma'din al-Anwar, 221, Cairo edition 1304 AH. Al-Suyuti: Husn al-Muhadarah, 1/220. Ibn al-Imad al-Hanbali: Shadharat al-Dhahab, 5/52. Ibn Taghri Bardi: Al-Nujum al-Zahirah, 6/215. Al-Yafi'i: Mir'at al-Jinan, 4/24. Ali Safi Hussein: Al-Adab al-Sufi fi Misr, Ibn al-Sabbagh al-Qusi, Dar al-Ma'rifah edition in Egypt 1971 AD. Al-Mundhiri: Al-Takmilah li-Wafayat al-Naqalah, investigation by Dr. Bashar Awwad, Mu'assasat al-Risalah edition, 2/340.\n2. The phrase appeared in Al-Tali' al-Sa'id, 383.\n3. He is Abu Muhammad, Abd al-Latif bin Abi Tahir Ahmad bin Muhammad bin Hibat Allah al-Hashimi al-Baghdadi (d. in Seville after the year 615 AH). See Ismail al-Baghdadi: Idah al-Maknun, 3/479 AH.\n4. He is Ahmad bin Ali bin Yahya al-Rifa'i al-Husayni, Abu al-Abbas (d. 578 AH), born in the village of Hasan in the works of Wasit in Iraq, studied Fiqh there and became a Sufi. He used to live in the village of Umm Abidah =",
    "book_id": "97"
  },
  {
    "serial_number": "281921",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 44,
    "volume_number": 1,
    "text": "Sheikh Ibn al-Khatib said: The Sufi; is he whose heart is filled with love and his tongue recites with gnosis.\nSheikh Muhammad bin al-Baqillani (1) said: He is the one who gives food, is sweet of speech, fasts the day, and prays at night while people are asleep.\nSheikh Ali bin al-Buqi said: He is the one who stands with the Sharia, and is humble in nature.\nSheikh Ramadan al-Kurdi said: He is the one whose secret is pure with the Truth (Allah), and his public conduct is good with creation.\nSheikh Ahmad al-Baqli said: He is the one whose heart is free from desires, his limbs are busy with acts of worship, annihilated in Allah from all existences, safe from lapses.",
    "foot_note": "1. = in the land of Bataih (between Wasit and Basra), and founded the Rifa'i order. He has Rahyq al-Kawthar (a treatise on his sayings). See Ibn Khallikan, Wafayat: 1/55. Al-Sha'rani: Al-Tabaqat 1/14. Al-Zirikli: Al-A'lam, 1/174. Ibn Kathir: Al-Bidaya wa al-Nihaya 12/312. Ibn al-Imad al-Hanbali: Shadharat al-Dhahab, 4/259.\n1. Muhammad bin al-Tayyib bin Muhammad bin Ja'far al-Baqillani, Abu Ja'far d. 403 AH. Born in Basra and died in Baghdad. One of the scholars of Kalam, leadership of the Ash'aris ended up with him. He had debates in Constantinople with Christian scholars when Adud al-Dawla sent him as an ambassador to the King of the Romans. Among his books are \"I'jaz al-Qur'an\", \"Al-Insaf\", and \"Manaqib al-A'immah\" and others. Regarding his biography see Ibn Khallikan: Wafayat al-A'yan, 1/481. Al-Khatib Al-Baghdadi: Tarikh Baghdad, 5/379. Al-Zirikli: Al-A'lam, 6/177. Al-Baqillani: Kitab al-Bayan 'an al-Firaq, investigation by Richard McCarthy, Al-Maktabah al-Sharqiyyah edition, 1958 (Introduction).",
    "book_id": "97"
  },
  {
    "serial_number": "281922",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 45,
    "volume_number": 1,
    "text": "Sheikh Hasan al-Farisi (1) said: He is the one who observes the secrets of the Quran, opposes Satan, restrains his tongue from speech, turns back on himself with blame, and prays at night while people are asleep.\nThe possessor of Karamat (miracles), Abd al-Malik al-Attar said: He is the one who sought the Halal, accompanied the Men (of God), and restrained his tongue from speech, so his state informs about him.\nAbu al-Fadl, Ibn Abi Sa'id said: He is the one who is generous with what is present and nothing missing crosses his mind, and he is not resentful regarding the rights of brothers, and he is a loving servant to them, and if he leaves the world he does not return to it.\nThe Hafiz, Abu al-Faraj Abd al-Rahman bin al-Jawzi the Jurist (2) said: He is the one who renounced desires, abandoned lusts, made up for what passed of his life, revived what died of it, protected his mind from dispersion, and feared his Lord until death.",
    "foot_note": "1. He is Al-Hasan bin al-Khatir bin Abi al-Husayn al-Nu'mani al-Farisi (d. 589 AH). Attributed to Al-Nu'maniya, a village between Baghdad and Wasit, and to his grandfather Al-Nu'man bin al-Mundhir. He is called Al-Farisi (The Persian) because he studied Fiqh in Shiraz according to the school of Abu Hanifa. He was prominent in grammar, prosody, rhymes, poetry, and news, knowledgeable in Quranic exegesis, Fiqh, Kalam, arithmetic, logic, astronomy, and medicine. See Al-Suyuti: Bughyat al-Wu'at, 1/502.\n2. Ibn al-Jawzi: (Abd al-Rahman bin Ali bin Muhammad (d. 579 AH), Hanbali, Muhaddith, Hafiz, Exegete, Jurist, Historian, well-known, literateur. See Ibn Rajab: Dhayl Tabaqat al-Hanabilah, 1/399. Al-Dhahabi: Siyar A'lam al-Nubala 20/365. Ibn Taghri Bardi: Al-Nujum al-Zahirah, 6/174. Al-Suyuti Tabaqat al-Mufassirin, 17. Ibn al-Athir: Al-Kamil, 12/71. Ibn Khallikan: Wafayat, 3/140. Ibn Khaldun: Al-Ibar, 4/297.",
    "book_id": "97"
  },
  {
    "serial_number": "281923",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 46,
    "volume_number": 1,
    "text": "The Sharif Abu al-Futuh al-Sufi (1) said: Who adheres to piety in all his times and is patient over affliction, and his time with Allah is equal in secret and private conversation.\nSheikh al-Muwaffaq al-Baghdadi the Hafiz said: He is the one who is easy and compliant in his movements, forgiving of his brothers' slips, and weeps and laments over his religion.\nSheikh Muhadhdhab al-Din Abu al-Muzaffar al-Duri (2) said: He is the one who is disciplined by the Sharia, refined by the Tariqah (Path), punished his self with struggle (Mujahadah), and occupied himself with the remembrance of the Truth (Allah) away from mother and father.\nThese are the sayings of the people of the Path and the people of knowledge and verification. Their pivot is entirely that the Sufi is the one who is characterized by the attributes praised in the Sharia, and adopts the praiseworthy morals, even if his nature is far from them, turning away from the world, turning towards the Hereafter, walking the path which is more appropriate and fitting for a person.\nAs for: The Specific Custom, it is what I sketched in the book \"Al-Is'af\" and most",
    "foot_note": "1. Abu al-Futuh al-Sufi: He is Al-Sayyid Abu al-Futuh al-Murtada bin al-Hasan bin Khalifa al-Hasan al-Sufi, from the people of Rayy, servant of Ribat Bakhtiyar al-Sufi and his son-in-law. He heard in Isfahan Abu Ali al-Hasan bin Ahmad al-Haddad. Abd al-Karim al-Sam'ani heard from him. See Al-Sam'ani: Al-Tahbir fi al-Mu'jam al-Kabir, 2/293. Mu'jam al-Shuyukh, folio 259a, copy of Ahmed III - Istanbul No. 2953, microfilm of it in the Institute of Arab Manuscripts in Cairo No. 164.\n2. He is Muhammad bin Ali bin Nasr al-Ball al-Duri (d. 598 AH), Abu al-Muzaffar, preacher. Born in Al-Dur (i.e., Dur al-Wazir Ibn Hubayrah) in Dujayl in the year 516 AH, or 517 AH, and grew up there. He came to Baghdad in his youth: became famous for preaching until he matched Abu al-Faraj Ibn al-Jawzi and rivaled him. He used to preach at the tomb of the mother of Caliph Al-Nasir in the year 589 AH. See Al-Baghdadi (Abd al-Rahman bin Ahmad), Ibn Rajab: Al-Dhayl 'ala Tabaqat al-Hanabilah, 4/74-76.",
    "book_id": "97"
  },
  {
    "serial_number": "281924",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 47,
    "volume_number": 1,
    "text": "of what applies to the one who wears a specific dress of Daliq (1) or Farjiya (2) or (Jalank) (3), and has a small turban from which he lets down a short tail (4) from in front of him, and attends the Khanqah after Asr to attend reading and Dhikr, not engaging in base crafts like weaving and cupping and their like, not described with wealth.\n\nThe Third Requirement: Who deserves Endowment and Bequest for the Sufis:\nIf we validate that, then some jurists said: It is not valid due to lack of regulation and stopping at a limit. There is no doubt that this is the apparent view, if we make Sufism return to morals and praiseworthy attributes of the soul, for we have no insight into inner states, and the outward appearances that indicate that may correspond to what is inside, and may not, as he said: \"A man may do the deeds of the people of Paradise in what appears to people, while he is of the people of Fire\" (5).",
    "foot_note": "1. Al-Daliq: Previously explained on p. 21 footnote (3).\n2. Farjiya: A loose garment, with two wide long sleeves extending slightly beyond the fingertips, and it may have a tail let down from over the head. See Dozy: Al-Malabis, published in Al-Lisan Al-Arabi, p. 166-169. Mayer: Al-Malabis al-Mamlukiyyah, 930. Ibn al-Furat: Tarikh, Vol 9 p. 460.\n3. An illegible word written as \"Halank\" and perhaps it is \"Jilbab\" or Hiltik, and it is usually made of sheep's wool.\n4. Adhbah i.e., an end that hangs down on the clothes. See Al-Suyuti: Husn al-Muhadarah, 2/218.\n5. A piece of a long hadith narrated by Al-Bukhari No. (3208) in Bad' al-Khalq: Chapter on Mention of Angels, and Muslim No. (2643) in Al-Qadar: Chapter on How Human Creation is Formed in the Mother's Womb. See the completion of its referencing and commentary in my book \"Sharh al-Arba'in al-Nawawiyyah\" printed by Dar Ibn Kathir in Damascus p. (23-25) (M).",
    "book_id": "97"
  },
  {
    "serial_number": "281925",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 48,
    "volume_number": 1,
    "text": "And nothing has come to us from the Sharia regarding that so that we may attach the ruling to apparent causes. We have clarified that the name 'Sufism' originated after the Prophet, the Companions, the Tabi'in, and the followers of the Tabi'in. The principle in legal rulings is that they are attached to a regulated matter. It only departs from this where the Sharia requires an action from us and we find it does not link to a regulated matter, so we attach the ruling to a matter that indicates that well for the sake of the Lawgiver's request. Endowment for Sufis or bequest to them did not appear in the Sharia. Perhaps it occurred after the extinction of the blessed eras and the departure of the Imams of Ijtihad, for I have not come across it for anyone before four hundred (AH).\nThen, what we link it to of appearance does not remove dispute and difference due to its instability. Some say: This amount is sufficient, and some say: It does not suffice, rather matters must be considered, and that invalidates it, just as if custom fluctuates in issues of hiring and sharecropping (Musaqat), then clarification is obligatory otherwise it is void. Among that is the issue of ink, is it upon the copyist or not? And its like. And 'who is healthy in most times', is the intent night or day, or night and day? Being decisive about one of them needs editing, and this is a reason necessitating invalidity. The saying of invalidity is plausible (1), and it is the choice of Sheikh Abu Muhammad al-Juwayni (2) and some Hanafis.\nSome Hanafis also say: The descriptions to which the name applies",
    "foot_note": "1. Mutajjih meaning it has a valid aspect/basis.\n2. Abu Muhammad al-Juwayni: He is Abdullah bin Yusuf bin Abdullah al-Juwayni (d. 438 AH), father of Imam al-Haramayn. Born in Juwayn. He has knowledge of Usul, Grammar, Fiqh, Tafsir, and Literature. See Al-Subki: Tabaqat, 5/73. Ibn Khallikan: Wafayat, 2/250. Al-Ash'ari: Tabyin Kadhib, 257. Ibn Kathir: Al-Bidaya wa al-Nihaya 2/55.",
    "book_id": "97"
  },
  {
    "serial_number": "281926",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 49,
    "volume_number": 1,
    "text": "of Sufi in their custom, Endowment is not valid for the one characterized by them. The like of this is narrated from Al-Shafi'i, may Allah have mercy on him. I saw in a part of Al-Muzani's (1) speech that Al-Shafi'i was asked about the Sufi, he said: A man who eats much, is very ignorant, very intrusive, and in some of his ways sleeps much.\nThe Hafiz, Abu Abdullah Ibn al-Najjar (2) cited the like of it from Al-Shafi'i: \". . . and Endowment for the one characterized by these attributes and bequest to him is not valid\".\nAs for those who said it is valid, their opinions differed regarding the deserving recipient.\nAl-Qadi al-Husayn al-Shafi'i said in his \"Ta'liqa\" (3), if endowment is made for the Sufis it is valid, and it is spent on the one occupied with worship in most times. As for the one who occupies himself with eating, Sama', and dancing, then no.\nAbu Sa'id al-Mutawalli (4) followed him in that",
    "foot_note": "1. Al-Muzani is Ismail bin Yahya, Abu Ibrahim d. 264 AH. He has Mukhtasar Al-Muzani in Shafi'i branches printed on the margin of Kitab Al-Umm by Al-Shafi'i in the year 1321 AH / 1913, at the Grand Amiri Press in Bulaq. See Ibn Khallikan: Wafayat, 2/217 (Biography 93). Al-Husayni, Abu Bakr Hidayat Allah, Tabaqat al-Shafi'iyyah, 20.\n2. He is the Hafiz, Muhibb al-Din, Abu Abdullah, Muhammad bin Mahmud bin al-Hasan, known as Ibn al-Najjar al-Baghdadi d. 643 AH. See his biography in Al-Dhahabi: Tadhkirat al-Huffaz, 4/212 (Hyderabad ed.). Ibn al-Imad al-Hanbali: Shadharat al-Dhahab, 5/226. Ibn al-Fuwati: Al-Hawadith al-Jami'ah, 205. Al-Kutubi: Fawat al-Wafayat, 2/522 (Cairo ed.).\n3. Al-Qadi al-Husayn: He is Abu Ali, al-Husayn bin Muhammad bin Ahmad al-Marwrudhi (d. 462 AH). One of the senior companions of Al-Qaffal. Nicknamed the Scholar of the Ummah, and one of the senior Shafi'i jurists. He has the famous Ta'liqa in Fiqh. See Al-Subki: Tabaqat 3/155. Ibn al-Imad al-Hanbali: Shadharat al-Dhahab, 3/310. Ibn Khallikan: Wafayat al-A'yan, 2/134. Ibn Khaldun: Al-Ibar, 3/249.\n4. He is Abu Sa'id, Abd al-Rahman bin Ma'mun bin Ali bin Ibrahim al-Naysaburi (Al-Mutawalli) =",
    "book_id": "97"
  },
  {
    "serial_number": "281927",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 50,
    "volume_number": 1,
    "text": "and added, saying: It is spent on everyone who is occupied with acts of worship in most of his conditions, and is turning away from worldly matters. Al-Rafi'i (1) followed him.\nThe Judge of Judges, Abu Muhammad al-Harithi al-Hanbali the Hafiz (2), said in \"Sharh al-Muqni'\": \"Endowment for Sufis is valid, and they are those devoted to worship and purifying the soul from blameworthy morals. These did not consider poverty, dress, wearing the Khirqa (Sufi cloak) from the hand of a Sheikh, nor mixing with Sufis in their residences in the Khanqah. Rather, they limited themselves to mentioning what I mentioned. Indeed, Al-Harithi stated explicitly regarding them, that wealth, dress, and wearing the Khirqa from the hand of the Sheikh are not considered\".\nSome Hanafis said: \"Endowment is valid, and it is spent on whoever does not possess the Nisab (minimum amount liable) for Zakat\".",
    "foot_note": "1. = d. 478 AH. Jurist, debater, knowledgeable in Usul, taught at Al-Nizamiyyah. Wrote in benefits and issues of dispute, and he has Al-Tatimmah. See Ibn al-Imad al-Hanbali: Shadharat al-Dhahab, 3/358. Al-Subki: Tabaqat, 5/106. Ibn Khallikan: Wafayat, 3/133. Al-Husayni: Tabaqat al-Shafi'iyyah 176. Ibn al-Jawzi: Al-Muntazam, 9/18.\n1. Imam Al-Rafi'i: He is Sheikh al-Islam, Abd al-Karim bin Muhammad bin al-Fadl al-Qazwini (d. 624 AH). One of the senior Shafi'i jurists, exegete, muhaddith. He has Fath al-Aziz fi Sharh al-Wajiz and Sharh Musnad al-Shafi'i and others. See Ibn al-Imad: Shadharat, 5/108. Al-Subki: Tabaqat, 5/119. Ibn Shakir al-Kutubi: Fawat al-Wafayat, 2/7. Al-Husayni: Tabaqat, 218-220.\n2. He is Mas'ud bin Ahmad bin Mas'ud bin Zayd bin Ayyash al-Harithi, the Hafiz, Judge of Judges, Abu Muhammad (d. 711 AH). Born in 653 AH. Heard from Al-Burhan al-Harrani and Al-Rida Ibn al-Burhan, and a group of Al-Jawhari's companions. Explained Sunan Abi Dawud, and explained a part of Al-Muqni'. Al-Harithi: Attribution to the village of Al-Harithiyyah located west of Baghdad. See Al-Adfuwi: Al-Tali' al-Sa'id, 113. Ibn Rajab: Tabaqat al-Hanabilah, 4/262-264. Al-Muqni' is the book Al-Muqni' in Fiqh by Al-Mahamili (Ahmad bin Muhammad bin Ahmad al-Dabbi) (d. 415 AH), =",
    "book_id": "97"
  },
  {
    "serial_number": "281928",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 51,
    "volume_number": 1,
    "text": "Al-Ghazali said in Al-Ihya (1): \"Sufism is an internal matter, not visible, so the ruling cannot be linked to it, but rather to apparent matters relied upon by people of custom in applying the name Sufi. He said: \"The general rule is that anyone with a characteristic, if he stays in the Khanqah belonging to the Sufis, and his staying there and mixing with them is not considered objectionable by them, then he is included in their crowd\" (2). This which Al-Ghazali mentioned does not suit his verification, because the book Al-Ihya is not designed for verification according to the method of Fiqh, and most or much of it is built on Sufi speech, and his classification in Fiqh was after that. He referred in his Fiqh books to things he mentioned in Al-Ihya. So his saying, that it is considered objectionable by them, while the discussion is about who the Sufi is so that if we know him we consider his objection, and he did not explain it before, and referred to it, is strange from him\".\nHe said: \"As for detail, five attributes are observed in it: Righteousness, Poverty, Sufi dress, not being occupied with a craft, and mixing with them by way of cohabitation in the Khanqah\" (3).\nHe said: \"Then some of these attributes, thereof (4) its disappearance necessitates the disappearance of the name, and some of them compensate for each other. Immorality (Fisq) prevents entitlement, for the Sufi in",
    "foot_note": "1. = Al-Suyuti: Husn al-Muhadarah, 1/358. Ibn al-Imad: Al-Hanbali: Shadharat, 6/28.\n1. Al-Ghazali: He is Muhammad bin Muhammad, Abu Hamid (d. 505 AH), philosopher, mystic, well-known. Al-Ihya is the book Ihya Ulum al-Din. See Ibn al-Imad al-Hanbali: 4/10-13. Al-Ash'ari: Tabyin: 291-306. Al-Safadi: Al-Wafi bi al-Wafayat, 4/101-182. Al-Husayni: Tabaqat al-Shafi'iyyah, 192.\n2. Appeared in Ihya Ulum al-Din, 2/153.\n3. Previous reference same page.\n4. In Al-Ihya \"of what necessitates\".",
    "book_id": "97"
  },
  {
    "serial_number": "281929",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 52,
    "volume_number": 1,
    "text": "general is an expression for a man of righteousness with a specific attribute. So he whose immorality appears, even if he is in their dress, does not deserve what was bequeathed to the Sufis, and we do not consider minor sins in it.\nAs for craft and occupation with books, it prevents entitlement. So the farmer, the worker, the merchant, the jeweler (1) in his shop or house, and the hireling who serves for his wage, all of these do not deserve from the endowment for the Sufis and are not compensated by dress and mixing.\nAs for copying (Warraqah) and tailoring and what is close to them of what is appropriate for Sufis to engage in, if he engages in them not in a shop nor by way of earning and craft, that does not prevent entitlement and is compensated by cohabitation along with being characterized by the rest of the attributes. And the ability to do them without practicing does not prevent.\nAs for preaching and teaching, it does not contradict the name of Sufism if the rest of the descriptions of dress, cohabitation, and poverty are present, since Sufi Reciter, Preacher, Scholar, Teacher (2) does not contradict, all of this does not contradict. What contradicts is to say Farmer or Merchant or Worker.\nAs for Poverty, if it is removed by excessive wealth by which the man is attributed to apparent riches, entitlement is prevented even if he has wealth, but his income does not cover his expenditure, or he has wealth falling short of the obligation of Zakat. If he has no expenditure, entitlement is not prevented.\nHe said: These are matters for which there is no evidence except customs (3).",
    "foot_note": "1. In Al-Ihya \"The Artisan\".\n2. In Al-Ihya 2/153 \"And Sufi preacher and Sufi scholar or Sufi teacher\".\n3. Al-Ihya 2/153.",
    "book_id": "97"
  },
  {
    "serial_number": "281930",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 53,
    "volume_number": 1,
    "text": "As for Mixing and Cohabitation, it has an effect. But he who does not mix with them while being in his house or in a mosque while being in their dress and adopting their morals, he is a partner to them in entitlement, and leaving mixing was compensated by (adherence to) (1) the dress. If he is not in their dress, and the rest of the attributes are present, he does not deserve unless he cohabits with them in the Ribats, so their ruling applies to him by dependency.\nHe said: As for wearing the patched cloak (Muraqqa') from the hand of a Sheikh of their Sheikhs, it is not a condition for entitlement, and its absence does not harm with the presence of the rest of the mentioned conditions.\nAl-Suhrawardi (2) also said: Al-Ghazali made wearing the Khirqa from a Sheikh and its absence equal.\nThen Al-Ghazali said: As for the married one hesitating between the Ribat and the dwelling, he does not exit their group (3).\nHe said: And the Faqih may stay with them if he is in their dress and morals, and ignorance is not a condition in Sufism according to one who knows Sufism.\nHe said: And no attention is paid to the superstitions of some fools, that knowledge is a veil, for ignorance is the veil\" (4). -This is the completion of Al-Ghazali's speech-.",
    "foot_note": "1. Addition from Al-Ihya, 2/153.\n2. He is Abd al-Qahir bin Abdullah bin Muhammad al-Bakri al-Siddiqi, Abu al-Najib al-Suhrawardi (d. 563 AH), Shafi'i jurist, preacher, mystic, lived in Baghdad and several Ribats were built for him there, and he died in Baghdad. He has Adab al-Muridin, Awarif al-Ma'arif. See Ibn Khallikan: Wafayat al-A'yan, 1/294. Al-Subki: Tabaqat al-Shafi'iyyah, 4/356. Al-Sha'rani: Tabaqat, 1/140. Haji Khalifa: Kashf al-Zunun, 1/43. Al-Dhahabi: Al-Ibar, 4/181. Ibn al-Imad al-Hanbali: Al-Shadharat, 4/208.\n3. See Ihya Ulum al-Din, 3/154.\n4. Previous reference, same page.",
    "book_id": "97"
  },
  {
    "serial_number": "281931",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 54,
    "volume_number": 1,
    "text": "And in much of it he did not follow the Fiqh rules, but rather walked in it according to the innovated customs of Sufism. He admitted that there is no evidence for it except customs. If he claims that this is a consistent custom in times and places, there is no evidence for it, and what he said is not accepted. And if he claims a custom specific to a time or place, it is a specific custom, and specific custom has no consideration according to the people of Fatwa.\nDo you not see that Musaqat (sharecropping) according to our companions is carried upon custom, and they made the oxen upon the owner considering the general custom in their induction. Then the custom of our entire lands is that it is upon the worker, and he did not pay attention to this specific one, rather they stated that if it was stipulated upon the worker the contract is void, and likes of that are many in various chapters.\nThen, custom if found is only considered where it agrees with what evidences indicated its consideration, and the opponent from Sharia or language is negated from it, and it is general among that group. And what he mentioned is originated after four hundred, and after the passing of the people of realities from this Sufi group, and the masters of observed customs. And there is no consideration for one who occurred and innovated an event.\nWe speak on the details of what he mentioned, detailed, decided, and established. His saying: That he considers the dress, has no origin from the Sharia and he did not say that, nor was it transmitted from the considered ancients. Rather, limiting to it is contrary to what he and his companions were upon. For he wore a Jubbah with narrow sleeves, and wore a suit, and used to wear a turban and let its end down between his shoulders, and he also turned the turban under the chin (Tahannak), and wore a black turban, and wore a Rida (cloak). Likewise, the Companions wore different types and a group of them wore the Taylasan, among them,",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281932",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 55,
    "volume_number": 1,
    "text": "Jabir bin Abdullah (1) and Jubayr bin Mut'im (2).\nThe Hafiz Abu Umar al-Namari (3) mentioned that some Companions used to wear a green Taylasan (4). And wearing a mask (Taqannu') was also reported, which is placing the Rida on the head.\nAl-Tirmidhi narrated in his \"Jami'\" from Jubayr bin Mut'im, that he said: \"I rode the donkey, wore the Shamlah (5), and milked the sheep\". Indeed he said: The Messenger of Allah said whoever does this, there is nothing of pride in him\" (6). And he said: A Hasan Hadith.\nAl-Suhrawardi said: And among people are those who do not intend wearing a specific garment neither for roughness",
    "foot_note": "1. He is Jabir bin Abdullah bin Amr bin Haram bin Tha'labah al-Ansari, from the people of Bay'at al-Ridwan (d. 77 AH or 78 AH). See, Khalifa bin Khayyat: Al-Tabaqat biography 623. Ibn al-Athir: Usud al-Ghabah, 1/256. Al-Dhahabi: Siyar A'lam al-Nubala, 3/489.\n2. Jubayr bin Mut'im bin Adi bin Nawfal bin Abd Manaf bin Qusayy, the Sheikh of Quraysh in his time, from the Tulaqa' (those released at the conquest of Mecca) whose Islam was good (d. 58 AH or 59 AH). See Ibn Habib: Al-Muhabbar, 67, 69. Ibn al-Athir: Usud al-Ghabah, 1/323. Al-Dhahabi: Siyar A'lam al-Nubala, 3/95.\n3. He is Ibn Abd al-Barr al-Namari: Yusuf bin Abdullah bin Muhammad bin Abd al-Barr bin Asim al-Namari al-Qurtubi, Abu Umar (d. 463 AH). One of the great Hafiz of Hadith, historian, literateur, researcher, he has Al-Isti'ab, Bahjat al-Majalis, and others. See Ibn Khallikan: Wafayat, 7/66. Al-Dabbi: Bughyat al-Multamis, 474. Al-Zirikli: Al-A'lam, 8/240. Al-Dhahabi: Al-Ibar, 3/255. Ibn al-Imad al-Hanbali: Shadharat al-Dhahab, 3/314.\n4. Al-Taylasan: A piece of cloth worn on the shoulders and hangs down in the form of two tails and is long. See Dozy: Dictionary of Clothing - entry Taylasan. Yaqut: Mu'jam al-Udaba, 1/373, 5/261.\n5. Al-Shamlah: Like a cloak (Kisa'), wrapped around the body like an Izar, and can be long or short. See Ibn Manzur: Lisan - entry Shaml. Abu al-Faraj al-Isfahani: Al-Aghani, 4/83.\n6. A piece of a hadith narrated by Al-Tirmidhi No. (2002) in Birr and Silah: Chapter on what came regarding Pride, and he said: This is a Hasan Sahih Gharib Hadith. My father, may Allah preserve him, said after referencing it in \"Jami' al-Usul\" (10/623): And it is as he said. (M).",
    "book_id": "97"
  },
  {
    "serial_number": "281933",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 56,
    "volume_number": 1,
    "text": "nor for softness, but wears what comes to him rightfully and is by the ruling of the time, and this is good (1).\nHe said: And our Sheikh Abu al-Najib used to wear what happened to be available, and did not restrict himself to a form of dress. He used to wear a turban worth ten Dinars, and wear a turban of little value.\nHe said: And Sheikh Abd al-Qadir (2) used to wear a specific form and wear the Taylasan.\nHe said: And Sheikh Abu al-Sa'ud (3) used to have a soft garment brought to him and he would wear it. It was said: Perhaps you will be disapproved of. He would say: We only meet one of two men, a man who demands the apparent of Sharia from us, so we say to him: Do you see the Sharia disliking this? And a man who demands the realities of the people (Sufis) from us, so we say to him: Do you see for us a choice in what we wore? (4).\nSo restricting to one dress and doing no other is the action of one rejected upon his doer, judged with invalidity in its ends and beginnings, and there is no closeness (to Allah) in it so that it be considered in the Endowment for the general direction.\nAs for his stipulation of Mixing and Cohabitation, what indicated it? For",
    "foot_note": "1. Appeared in Awarif al-Ma'arif, 356.\n2. He is Abd al-Qadir bin Musa bin Abdullah bin Janki Dost al-Husayni, Muhyi al-Din al-Jilani (d. 561 AH), founder of the Qadiriyya order, ascetic, mystic, born in Gilan - Tabaristan - moved to Baghdad, excelled in preaching. See Ibn Taghri Bardi: Al-Nujum al-Zahirah, 5/371. Al-Sha'rani: Al-Tabaqat, 1/126. Al-Kutubi: Fawat al-Wafayat, 2/2. Ibn al-Imad al-Hanbali: Shadharat, 4/198.\n3. The intended is Sheikh Abu al-Sa'ud bin Abi al-Asha'ir bin Sha'ban bin al-Tayyib al-Bathini (d. 644 AH), from Wasit in Iraq - moved to Egypt, and was among the illustrious Sufis of Egypt. See Al-Sha'rani: Tabaqat, 1/162. Al-Suyuti: Min al-Muhadarah, 1/297. Ibn al-Mulaqqin: Tabaqat al-Awliya, 406.\n4. Appeared in Awarif al-Ma'arif 357 \"but with modification by Al-Adfuwi\".",
    "book_id": "97"
  },
  {
    "serial_number": "281934",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 57,
    "volume_number": 1,
    "text": "the name Sufism and Sufi is true without that, and do not say (1) that the ancients were characterized by it.\nAs for Cohabitation, there were no Khanqahs (2) nor Ribats for Sufis there, and that only happened after four hundred.\nAs for Mixing, the Salaf differed on whether Isolation is better or not?.\nAbu Sa'id al-Khudri said: The Messenger of Allah was asked, which people are best? He said: \"A man striving in the path of Allah\". They said: Then. He said: \"Then a believer in one of the mountain passes worshipping his Lord (Yashqa bihi - serving Him diligently), and leaving people from his evil\" (Sahih Hadith) (3).\nWhoever preferred mixing with people, did not restrict it to a specific group. Rather, there is no doubt that isolation is more preferable than mixing with one who innovated customs and made them Sharia. And what witness is the consideration of one who wears a Jumjum (4) on his feet and puts his tail between his hands or has a long Tartur (conical hat) like an elephant's trunk.\nIt is established in \"Sahih Muslim\" that the Messenger of Allah said: \"Verily Allah does not look at your forms and your wealth but He looks at your hearts and your deeds\" (5). So something Allah does not look at cannot be a condition for entitlement to what is used to draw close to Him.",
    "foot_note": "1. Previous reference and same page.\n2. The correct is \"Khawaniq\".\n3. Narrated by Imam Ahmad in \"Al-Musnad\" (3/56) and the author mentioned it by meaning and briefly, and it is a weak hadith. (M)\n4. Al-Jumjum: A type of measure, see Al-Lisan -entry- Jumjum.\n5. Narrated by Muslim No. (2564) in Birr and Silah: Chapter on Prohibition of Suspicion, Spying and Competition from the hadith of Abu Hurairah. (M).",
    "book_id": "97"
  },
  {
    "serial_number": "281935",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 58,
    "volume_number": 1,
    "text": "Then the dress differs, a group of them has a dress, and others a dress. And so on always in different places, so which is the considered one. If we consider every region by its dress, if people of that region come to another region, are they obliged to follow their region or the region they moved to? And it continues, and all of that is proof against it.\nAs for the stipulation of Poverty, the word has no indication of it, but custom implies it, so it follows the case of bequest to orphans.\nAl-Mawardi (1) said: \"The narrations regarding it are that if he bequeathed to orphans of a specific tribe, poverty is not stipulated in the orphans of that tribe, otherwise there are two views, in one of them the wording is looked at, and the other custom. For the custom is running that a person does not bequeath to orphans who have wealth. Likewise if he bequeathed to widows of a tribe, therein is what we mentioned. Likewise bequest to the chronically ill, some of them cut that poverty is not stipulated, and some of them applied the difference.\nIf we make the Sufis attributed to Ahl al-Suffah due to their resemblance to them in actions and states. And the stipulation of poverty apparently, his intent is, the state of Ahl al-Suffah was poverty, and likewise if we make them attributed to wearing wool (Suf), for wearing wool mostly was for people of need and those with little of the world, desiring away from it.",
    "foot_note": "1. Al-Mawardi: (Abu al-Hasan Ali bin Muhammad bin Habib d. 450 AH), born in Basra and studied Fiqh there, excelled in Fiqh after moving to Baghdad, was Judge of Judges in the year 429 AH, was trusted by the Buwayhid kings. Regarding his journey see: Ibn al-Jawzi: Al-Muntazam, 8/151. Ibn al-Athir: Al-Lubab fi Tahdhib al-Ansab, 3/90. Al-Baghdadi: Tarikh Baghdad, 12/102. Al-Subki: Tabaqat 5/267. Ibn Kathir: Al-Bidaya, 11/80. Yaqut: Mu'jam al-Buldan 5/406. Al-Isnawi: Tabaqat al-Shafi'iyyah (Investigation by Abdullah al-Jaburi, Baghdad edition 1971 AD).",
    "book_id": "97"
  },
  {
    "serial_number": "281936",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 59,
    "volume_number": 1,
    "text": "As for Jurists, Muhaddiths, Reciters and others of what is in their meaning, poverty is not stipulated in them, as we know no difference in it, rather whoever the name encompasses is given. So the Sufi in reality, is that he is characterized by psychological morals. Al-Ghazali agreed on that, and for those morals are things in the apparent indicating them, and poverty does not indicate them nor is included in their customary reality.\nThis group has based its path to Ali bin Abi Talib may Allah be pleased with him, and the Hafiz Abu Muhammad bin Hazm (1) mentioned, that he was rich, and that he did not die except leaving wealth.\nThe last of the Sheikhs of the group, Imam Abu Hafs, Umar al-Suhrawardi (2). People mentioned, that he was of people of wealth, and spent money in faces of righteousness, and held positions, and was sent as a messenger on behalf of the Caliphate and other than that, but custom specifies, and the apparent of Endowment for them, implies poverty.\nAs for crafts and earning, crafts differ, some are praised, like teaching and its likes, so it is not disputed that this does not prevent entitlement by being characterized with it. And some their practitioner is attributed in custom to baseness like the cupper and the trash collector, and this may be said regarding the Sufi: That his choosing a base craft contradicts Sufism, and",
    "foot_note": "1. He is Ali bin Ahmad bin Sa'id bin Hazm al-Andalusi, Abu Muhammad d. 456 AH, jurist, literateur, Usuli, Muhaddith, Hafiz, theologian, literateur participating in history, genealogy, grammar, language, poetry, medicine, logic and philosophy, well-known famous. See, Yaqut: Mu'jam al-Udaba, 12/235. Kahhalah: Mu'jam al-Mu'allifin, 7/16. Al-Dhahabi: Siyar A'lam al-Nubala, 8/184. Al-Qifti: Tarikh al-Hukama 232. Ibn Khallikan: Wafayat al-A'yan, 3/325.\n2. He is Shihab al-Din, Abu Hafs Umar bin Muhammad bin Ammuwayh al-Suhrawardi d. 632 AH, Shafi'i in Madhhab, many Sufis graduated under him, accompanied Abu al-Najib al-Suhrawardi (his uncle) and Sheikh Abd al-Qadir al-Jilani, author of Awarif al-Ma'arif. See, Abu al-Fayd: Jamharat al-Awliya 2/200. Al-Isnawi: Tabaqat al-Shafi'iyyah 2/63.",
    "book_id": "97"
  },
  {
    "serial_number": "281937",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 60,
    "volume_number": 1,
    "text": "the jurists considered that in testimony; a group of them preferred accepting the testimony of one practicing a base craft, and there are aspects and details in it, mentioned in books of Fiqh.\nAnd some are intermediate between them like copying and sewing and their like, but performing them is of collective obligations, and practicing them is not baseness, so the one characterized by them is not free from two matters: Either he is independent of them by having wealth or a stipend in the Khanqah, or in functions, of knowledge enriching him from practicing them. Or he is in need of them to support himself if alone or his family. If he is independent, practicing them in the shop or earning by them affects preventing entitlement because it involves seeking increase of wealth, and Sufism is based on minimizing the world, and he said: \"O Allah make the provision of the family of Muhammad sustenance\" (1), and said: \"The poor enter Paradise before the rich by five hundred years\" (2).\nIf he is in need of it, the Sharia requested him to earn, and said: \"For one of you to take a rope on his shoulder and gather firewood is better for him\" (3) -the Hadith-. And he said: \"It is sufficient sin for a man to neglect whom he feeds\" (4). And in a wording: \"whom",
    "foot_note": "1. Narrated by Al-Bukhari (11/250) in Al-Riqaq: Chapter on how was the living of the Prophet peace be upon him, and Muslim No. (1055) in Al-Zuhd, and see completion of its referencing in \"Jami' al-Usul\" (4/671). (M).\n2. Narrated by Al-Tirmidhi No. (2354) in Al-Zuhd: Chapter on what came that the poor of Muhajirin enter Paradise before their rich, and it is a Hasan Hadith, and see \"Jami' al-Usul\" (4/673). (M).\n3. Narrated by Al-Bukhari No. (1470) in Zakat: Chapter on abstaining from begging, and (1480) Chapter on the saying of Allah Almighty: {They do not ask people importunately} [Al-Baqarah: 273] and (2074) in Sales: Chapter on man's earning and working with his hand, and (2374) in Musaqat: Chapter on selling firewood and grass, and Muslim No. (1042) in Zakat: Chapter on dislike of begging people. (M).\n4. Authentic Hadith narrated by Muslim No. (996) in Zakat: Chapter on virtue of spending on dependents, and Abu Dawud No. (1692) in Zakat: Chapter on maintaining ties of kinship. Narrated by Ahmad in \"Al-Musnad\" (2/160 =",
    "book_id": "97"
  },
  {
    "serial_number": "281938",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 61,
    "volume_number": 1,
    "text": "he supports\" (1). And he said: \"The best a man eats is from the earning of his hand\" (2). This is general in earning so preventing him from entitlement by that is not valid. Likewise his saying regarding the hireling that he is prevented entitlement, is fallen speech if he is in need of that. How so when Moses hired himself, and the Prophet said, that he used to shepherd for the people of Mecca for Qirats before Prophethood, and Ali hired himself.\nAl-Qushayri mentioned about the great of the group, Ibrahim bin Adham (3), that he used to eat from the work of his hand from harvesting and guarding orchards (4).",
    "foot_note": "1. = and 193 and 194 and 195) and Al-Bayhaqi in \"Al-Sunan Al-Kubra\" (7/467) and Al-Hakim in \"Al-Mustadrak\" (1/415) from the hadith of Abdullah bin Amr bin al-Aas may Allah be pleased with them. And narrated by Al-Bayhaqi in \"Al-Sunan Al-Kubra\" (9/25) from the hadith of Jabir bin Abdullah may Allah be pleased with him. And narrated by Al-Tabarani in \"Al-Mu'jam Al-Kabir\" from the hadith of Abdullah bin Umar may Allah be pleased with him as in \"Majma' al-Zawa'id\" and Al-Nasa'i in \"Ishrat al-Nisa\" from \"Al-Sunan Al-Kubra\" No. (295) printed in Cairo. (M).\n1. Narrated with this wording by Al-Nasa'i in \"Ishrat al-Nisa\" from \"Al-Sunan Al-Kubra\" No. (294) printed in Cairo, and Al-Hakim in \"Al-Mustadrak\" (4/500) from the hadith of Abdullah bin Amr bin al-Aas may Allah be pleased with him (M).\n2. Narrated by Ibn Majah No. (2138) in: Trade: Chapter on encouraging earnings from the hadith of Al-Miqdam bin Ma'di Karib al-Zubaidi may Allah be pleased with him and his wording is: \"No man earned an earning better than the work of his hand...\" The Hadith and the author mentioned it by meaning. (M).\n3. Ibrahim bin Adham bin Mansur, from the district of Balkh, traveled in Iraq, Sham and Hijaz (from the major Sufis), Al-Qushayri: Al-Risalah, 1/63. Al-Kalabadhi: Al-Ta'arruf, 37. Al-Sha'rani: Al-Tabaqat, 1/69. Abu Nu'aym: Hilyat al-Awliya, 7/367-395. Ibn al-Imad al-Hanbali: Shadharat, 1/255. Al-Kutubi, Fawat al-Wafayat, 1/3. Al-Sulami: Tabaqat al-Sufiyyah, 30.\n4. Appeared in Al-Risalah Al-Qushayriyyah, 1/64.",
    "book_id": "97"
  },
  {
    "serial_number": "281939",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 62,
    "volume_number": 1,
    "text": "Al-Suhrawardi said about this group: Some of them used to earn, and some of them used to beg, and he made that according to the state, and investigating that would be long.\nThis speech on the detail of what he detailed, we have clarified its invalidity from the aspect of inference in terms of transmission for it is contrary to what is in the books of rulings for the groups of jurists of rulers, who stipulated the issue and peace.\nSome of them argued that the rich is not prevented, for the Hadith of the rich where the poor came to the Messenger of Allah and said: \"The people of great wealth have gone with rewards and high ranks and eternal bliss\" (1). -The Hadith- The arguer said: The rich obtains reward and virtue and the like of what was mentioned, and his deduction is invalid as if the discussion is not about whether the rich obtains good or not? Nor that it is a deficiency in the person nor that another is better than him. Rather the discussion is, does this name which is Sufism contradict richness or not?.\nFor Endowment for the Sufi implies poverty from the aspect of custom. For he intends by Endowment for Sufis helping them to free themselves for worship, so he suffices them the provision necessitating earning, and taking causes. And it does not prevent that others be more knowledgeable and better and more rewarding and abundant. If a person made endowment for jurists it would be spent on Muslim bin Khalid al-Zanji (2) and Al-Hajjaj bin Artah (3), and not spent",
    "foot_note": "1. Narrated by Muslim No. (1006) in Zakat: Chapter on explanation that the name of charity applies to every type of good deed, and it is with others of the Imams also with different wordings and narrations, see them with their referencing in \"Jami' al-Usul\" (9/218-221). (M).\n2. He is Muslim bin Khalid bin Sa'id bin Jurjah, from the people of Sham, and he is a client of the family of Sufyan bin Abd al-Asad al-Makhzumi, jurist, worshipper, d. in Mecca in the year 180 AH, in the caliphate of Harun al-Rashid. See, Ibn Sa'd: Al-Tabaqat, 5/499, 2/307.\n3. Al-Hajjaj bin Artah bin Thawr bin Sharahil bin Ka'b Mufti of Kufa, from the seas of knowledge, and held =",
    "book_id": "97"
  },
  {
    "serial_number": "281940",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 63,
    "volume_number": 1,
    "text": "to some of those listed among Companions who have no Fiqh, even if they are more virtuous and proud and greater in mention and destiny.\nLikewise if he bequeathed to Shafi'is, it is spent on Ibn al-Ansari (1) and not spent on Al-Tahawi (2) and Abu Ya'la al-Farra (3) and likes of that.\nThen wealth is a vehicle for tyranny and temptation, and a cause by which disobedience is reached. Allah Almighty said {No! [But] indeed, man transgresses (6) Because he sees himself self-sufficient} (4). And Almighty said: {Your wealth and your children are but a trial} (5).",
    "foot_note": "1. = Judicature of Basra (d. 149 AH), Al-Dhahabi: Siyar A'lam al-Nubala, 7/68. Ibn Sa'd: Al-Tabaqat, 6/359. Ibn Khallikan: Wafayat al-A'yan, 2/54-56.\n1. Salman bin Nasir al-Ansari: Abu al-Qasim (d. 512 AH), student of Imam al-Haramayn, was knowledgeable in Kalam and Tafsir, ascetic, pious, firmly grounded in the science of Sufism, explained Al-Irshad by Imam al-Haramayn, has books in Fiqh. See, Al-Subki: Tabaqat al-Shafi'iyyah, 4/222. Ibn al-Imad al-Hanbali: Shadharat al-Dhahab, 4/34.\n2. The intended is Abu Ja'far al-Tahawi (d. 321 AH) he is Ahmad bin Muhammad Ibn Salamah bin Salamah al-Azdi al-Tahawi, jurist leadership of Hanafis in Egypt ended with him, son of Al-Muzani's sister, was Shafi'i then turned to Hanafis. See, Ibn Hajar: Lisan al-Mizan, 1/274-282. Ibn al-Imad al-Hanbali: Shadharat, 2/306. Al-Yafi'i: Mir'at al-Jinan, 2/289. Ibn al-Athir: Al-Lubab, 2/17.\n3. He is Muhammad bin al-Husayn bin Muhammad bin Khalaf bin al-Farra, Abu Ya'la (d. 458 AH), scholar in Usul and Furu' and types of arts Baghdadi, Al-Qa'im appointed him Dar al-Khilafah and Al-Harim, of his books, Al-Ahkam al-Sultaniyyah, Al-Iman and others, was Sheikh of Hanbalis. See, Ibn Abi Ya'la: Tabaqat al-Hanabilah, 2/193. Al-Khatib Al-Baghdadi: Tarikh Baghdad, 2/256. Al-Kutubi: Al-Wafi bi al-Wafayat, 3/7.\n4. Surah Al-Alaq, verse: 6.\n5. Surah Al-Taghabun, verse: 15.",
    "book_id": "97"
  },
  {
    "serial_number": "281941",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 64,
    "volume_number": 1,
    "text": "In the \"Two Sahihs\": That when Abu Ubaidah came with the wealth of Bahrain, the Ansar heard, so they attended Fajr prayer - the Hadith. And in it: That the Prophet, said: \"I do not fear poverty for you, but I fear for you that the world will be spread out for you as it was spread out for those before you, so you will compete for it as they competed for it and it will destroy you as it destroyed them (1)\". And in a narration: \"And it will divert you as it diverted them\" (2).\nAnd in the hadith of Ka'bah bin Iyad: (I heard the Messenger of Allah, saying: \"Verily for every nation there is a trial, and the trial of my nation is wealth\" (Narrated by Al-Tirmidhi), and he said: Hasan Sahih (3).\nAnd in \"Sahih Al-Bukhari\": That the Prophet, when he saw on Fatima's door a decorated curtain, and returned -the Hadith- and in it he said: \"What have I to do with the world\" (4).\nAnd in the hadith of Abu Umamah: That the Prophet, said: \"O son of Adam, if you spend the surplus",
    "foot_note": "1. A piece of a hadith narrated by Al-Bukhari No. (3157) in Jizyah: Chapter on Jizyah and Truce with Ahl al-Dhimmah and War, and (4015) in Maghazi: Chapter No. (12), and Muslim No. (2961) in Zuhd and Riqaq, in its opening, and Al-Tirmidhi No. (2462) in Description of Resurrection: Chapter No. (28), and Ibn Majah No. (3997) in Fitan: Chapter on Trial of Wealth, and Ahmad in \"Al-Musnad\" (4/137 and 327) from the hadith of Al-Miswar bin Makhramah may Allah be pleased with him. (M).\n2. A piece of a hadith narrated by Al-Bukhari No. (6425) in Riqaq, Chapter on what is warned of the bloom of the world and competing in it, and Muslim No. (2962) (. . .) in Zuhd and Riqaq, in its opening.\n3. Narrated by Al-Tirmidhi No. (2336) in Zuhd: Chapter on what came that the trial of this nation is in wealth, and he said: This is a Hasan Sahih Gharib Hadith we only know it from the hadith of Mu'awiyah bin Salih. I say: And Mu'awiyah bin Salih, is Mu'awiyah bin Salih bin Hudayr al-Hadrami Abu Amr and Abu Abd al-Rahman al-Himsi Judge of Andalusia, truthful has delusions as Hafiz Ibn Hajar said in \"Taqrib al-Tahdhib\" p (538). Narrated also by Ahmad in \"Al-Musnad\" (4/160), and Al-Hakim in \"Al-Mustadrak\" (4/318). And he authenticated it and Al-Dhahabi agreed. (M).\n4. Narrated by Al-Bukhari No. (2613) in Gift: Chapter on gifting what is disliked to wear, and the author cited it briefly and by meaning, from the hadith of Abdullah bin Umar bin al-Khattab may Allah be pleased with them. (M).",
    "book_id": "97"
  },
  {
    "serial_number": "281942",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 65,
    "volume_number": 1,
    "text": "it is better for you, and if you withhold it, it is evil for you, and you are not blamed for sufficiency (Kafaf), and begin with those you support (1). (Narrated by Al-Tirmidhi, and said: Hasan Sahih).\nAbu Nu'aym the Hafiz narrated with his chain: That it was said (to Abu Bakr al-Siddiq: O Caliph of the Messenger of Allah, do you not employ the people of Badr? He said: \"I see their place, but I dislike to pollute them with the world\" (2).\nThere is no doubt that minimizing the world is the slogan of the righteous and the affiliation of ascetics and gnostics. So Endowment and Bequest to the Sufi implies poverty inevitably.\nBut here is a branch, which is if we stipulate poverty, is the claim of one who claims Sufism accepted, that he is a Sufi?.\nThere is no doubt that Endowment and Bequest to Jurists, the claim of one who claims Fiqh is not accepted in it, and likewise Hadith and likes of that. If endowment is made to rich people it must be proven. And if endowment is made to the poor, the claim of the one claiming poverty is accepted.\nThe Sufi fluctuates between that, if we make Sufism an expression for psychological attributes then no doubt his word is accepted, just as if he said to his wife: If you menstruate you are divorced, her word is accepted, rather that is more worthy of acceptance, for menstruation evidence can be established on it, and the husband's knowledge of it and by vision and signs. Likewise if we say: The Sufi occupied with acts of worship mostly for we do not intend by acts of worship except what is beyond",
    "foot_note": "1. Narrated by Al-Tirmidhi No. (2343) in Zuhd: Chapter No. (32) and it is with Imam Muslim No. (1036) in Zakat: Chapter on explanation that the upper hand is better than the lower hand, and Ahmad in \"Al-Musnad\" (5/262) from the hadith of Abu Umamah may Allah be pleased with him. (M).\n2. Mentioned by Abu Nu'aym in \"Hilyat al-Awliya\" (1/37) in the late biography of Abu Bakr al-Siddiq may Allah be pleased with him. With this our referencing of the hadiths of this beneficial book is completed at the beginning of the month of Rajab the Great of the year (1408) AH, and praise be to Allah by whose grace good deeds are completed, and I ask Allah Almighty to reward its author, investigator and publisher the best reward. (M).",
    "book_id": "97"
  },
  {
    "serial_number": "281943",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 66,
    "volume_number": 1,
    "text": "obligatory acts, and most of them are what the Sharia recommended hiding. Like in supererogatory prayers where performing them in the house and likes of it was requested, and you do not say reveal it to establish evidence on it, for it is opposite to what is preferred in the view of the Lawgiver. Likewise who said: Endowment for Sufis, is spent on the poor, his word is accepted, where the word of the poor is accepted.\nAs for Al-Ghazali's method in Dress, Mixing and Cohabitation, in this it appears that evidence must be established, for establishing evidence on it is not difficult nor hard, and it is of apparent actions, so it was joined with what is in its meaning.\nThis is the completion of what I summarized and the last of what I edited according to my knowledge and the limit of my understanding. And we seal it with a conclusion, so I say:\nConclusion:\nIt became famous among the later ones who inserted themselves into Sufism that their path is divergent from the path of Jurists in word and deed, so due to that a repulsion occurred necessitating speech of some of them against others, and we mention from the speech of their Imams and the example among them, what informs you that Sufism is following the Sunnah which the Jurists are characterized by.\nThe Master Abu al-Qasim al-Qushayri -one of their notable Sheikhs, and followed in this affair- mentioned a group of their sayings in Tawhid, and principles of creeds in his Risalah. And said: That he only mentioned them so it be known that their creeds are in accordance with the Book and Sunnah, so we do not prolong speech by mentioning them (1). And mentioned from their sayings what we mention some of to be a proof against them, for they are their examples and the first satisfied with a way from who travels it [*]. He narrated first from Abu Abdullah bin",
    "foot_note": "1. See Al-Risalah al-Qushayriyyah, 1/32-55. [*] The preparer of the book for Shamela said: From a famous witness for Hudhayl poets, which is the saying of Khalid bin Zuhayr to his uncle Abu Dhu'ayb: So do not panic from a Sunnah (way) you walked it ... For the first satisfied with a Sunnah is who walks it. He says: You made it current among people [Lisan al-Arab 4/390]",
    "book_id": "97"
  },
  {
    "serial_number": "281944",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 67,
    "volume_number": 1,
    "text": "Khafif (1), that he said: Imitate five of our Sheikhs, and submit to the rest in their states, he mentioned Al-Harith bin Asad al-Muhasibi (2) and Al-Junayd bin Muhammad, and Abu Muhammad Ruwaym (3) and Abu al-Abbas bin Ata (4) and Amr bin Uthman al-Makki (5).",
    "foot_note": "1. He is Muhammad bin Khafif al-Shirazi, Abu Abdullah (d. 371 AH), was from princes, resided in Shiraz, became a Sufi and became Sheikh of Sheikhs. See, Al-Qushayri: Al-Risalah, 1/212-213. Al-Sha'rani: Al-Tabaqat, 1/120. Al-Sulami: Tabaqat al-Sufiyyah, 462. Abu Nu'aym: Hilyat al-Awliya, 10/385. Ibn al-Imad al-Hanbali: Shadharat al-Dhahab, 3/76.\n2. Al-Harith bin Asad al-Muhasibi (d. 243 AH), Abu Abdullah, first Sunni Sufi whose works show complete theological culture (well-known famous). Regarding his biography see Ibn al-Nadim: Al-Fihrist, 184. Al-Qushayri: Al-Risalah, 1/89. Al-Kalabadhi: Al-Ta'arruf, 45. Al-Sha'rani: Al-Tabaqat, 1/75. Abu Nu'aym: Hilyat al-Awliya, 10/73. Al-Sulami: Tabaqat, 56. Ibn Khallikan: Wafayat, 1/157. Ibn al-Imad al-Hanbali: Shadharat, 2/102. Al-Khatib Al-Baghdadi: Tarikh Baghdad, 8/211.\n3. Abu Muhammad, Ruwaym bin Ahmad (d. 303 AH), Baghdadi from the illustrious Sheikhs, was a reciter and jurist, on the Madhhab of Dawud al-Zahiri. See, Al-Qushayri: Al-Risalah, 1/144. Al-Kalabadhi: Al-Ta'arruf, 43. Al-Sha'rani: Al-Tabaqat, 1/88. Al-Sulami: Tabaqat al-Sufiyyah, 180. Abu Nu'aym: Hilyat al-Awliya 10/296. Ibn al-Jawzi: Al-Muntazam, 6/136. Al-Khatib Al-Baghdadi: Tarikh Baghdad, 8/130. Ibn Kathir: Al-Bidaya wa al-Nihaya, 11/125.\n4. Abu al-Abbas Ahmad bin Muhammad bin Sahl bin Ata al-Adami (attribution to selling Adam, leather) d. 309 AH, from senior Sufi Sheikhs. See, Al-Qushayri: Al-Risalah, 1/168. Al-Sha'rani: Al-Tabaqat, 1/95. Al-Kalabadhi: Al-Ta'arruf, 43. Ibn al-Jawzi: Al-Muntazam, 6/160. Abu Nu'aym: Hilyat al-Awliya, 10/302. Ibn al-Imad al-Hanbali: Shadharat, 2/257.\n5. Amr bin Uthman al-Makki (Abu Abdullah) d. 291 AH, Sheikh of the people Imam of the sect in Usul and Tariqah, died in Baghdad. See, Al-Qushayri: Al-Risalah, 1/150. Al-Kalabadhi: Al-Ta'arruf, 43. Al-Sha'rani: Al-Tabaqat, 1/89. Al-Sulami: Tabaqat al-Sufiyyah, 202. Abu Nu'aym: Hilya, 1/291. Al-Khatib Al-Baghdadi: Tarikh Baghdad, 12/223. Ibn al-Imad al-Hanbali: Shadharat al-Dhahab, 2/225.",
    "book_id": "97"
  },
  {
    "serial_number": "281945",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 68,
    "volume_number": 1,
    "text": "He said: These are imitated because they combined between Knowledge and Realities.\nAbu Yazid al-Bistami (1) said: I worked in Mujahadah for thirty years, and I did not find anything harder on me than knowledge and following it, and were it not for the difference of scholars I would have remained, and difference of scholars is a mercy except in Tawhid (2).\nHe said: If you look at a man given Karamat (miracles) until he sits cross-legged in the air do not be deceived by him until you look how you find him regarding command and prohibition and keeping limits and performing Sharia (3).\nAbu Hafs Umar al-Haddad (4) said: Whoever does not weigh his states and actions at every time with the Book and Sunnah is not counted in the Diwan (register) of Men.",
    "foot_note": "1. Abu Yazid bin Tayfur bin Isa al-Bistami (d. 261 AH), from senior Sufis, see Al-Qushayri: Al-Risalah, 1/100. Al-Kalabadhi: Al-Ta'arruf, 1 p. Al-Sha'rani Al-Tabaqat, 1/76. Al-Sulami: Tabaqat al-Sufiyyah, 67. Abu Nu'aym: Hilyat al-Awliya, 10/33. Ibn Khallikan: Wafayat al-A'yan, 2/531. Ibn al-Imad al-Hanbali: Shadharat, 2/143. Al-Munawi: Al-Kawakib (Al-Tabaqat), 1/244.\n2. In Al-Risalah Al-Qushayriyyah 1/100 appeared \"I worked in Mujahadah thirty years, and I did not find anything harder on me than knowledge and following it, and were it not for the difference of scholars I would have remained (lagged/tired) and difference of scholars is a mercy except in \"stripping Tawhid\".\n3. The intended by the text is encouraging following the Book and Sunnah, and not exiting the Sunan.\n4. Abu Hafs, Umar bin Salama al-Haddad (d. 260 AH and odd), from the village of Kurd Abadh at the gate of Nishapur city on the road to Khurasan, first to show Sufism there. See, Al-Qushayri: Al-Risalah, 1/118-119. Al-Kalabadhi: Al-Ta'arruf 41. Al-Sha'rani: Al-Tabaqat, 1/82. Abu Nu'aym: Hilyat al-Awliya: 10/229. Ibn al-Imad al-Hanbali: Shadharat al-Dhahab, 2/150. Al-Sulami: Tabaqat al-Sufiyyah, 1/115-122.",
    "book_id": "97"
  },
  {
    "serial_number": "281946",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 69,
    "volume_number": 1,
    "text": "The Master of the sect Al-Junayd said: All paths are closed to creation except who followed the trace of the Messenger (1). . . .\nAnd said also: Whoever did not read Quran and did not write Hadith is not imitated (2) in this matter, because our knowledge is restricted by Book and Sunnah.\nAnd said also: This knowledge of ours is supported (3) by the hadith of the Messenger of Allah.\nAbu Uthman, Sa'id bin Ismail said: Whoever made Sunnah commander over himself in word and deed spoke with wisdom, and whoever made desire commander spoke with innovation (4).\nAbu al-Husayn al-Nuri said: Whoever you see claiming a state with Allah taking him out of the limit of Sharia knowledge do not go near him.\nAbu Hamza al-Baghdadi said: No evidence on the path to Allah except following the Messenger in states and actions (5).\nAbu al-Qasim, Ibrahim bin Muhammad al-Nasrabadhi (6) Sheikh of Khurasan in his time said:",
    "foot_note": "1. Appeared in Al-Risalah Al-Qushayriyyah, 1/134.\n2. In original \"by them\".\n3. In Al-Risalah Al-Qushayriyyah 1/135 \"built up/strengthened\".\n4. Appeared in Al-Risalah Al-Qushayriyyah, 1/139. Abu Nasr al-Sarraj al-Tusi: Al-Luma', 144.\n5. Appeared in Al-Risalah Al-Qushayriyyah, 1/173.\n6. Ibrahim bin Muhammad, Abu al-Qasim al-Nasrabadhi (d. 369 AH), from Imams of Sufis, Sheikh of Khurasan in his time, referred to in types of sciences from memorizing Sunan and collecting them, narrated much. See Al-Munawi: Al-Kawakib al-Durriyyah, 2/6. Al-Qushayri: Al-Risalah, 1/222. Al-Sha'rani: Al-Tabaqat, 1/122. Ibn al-Imad al-Hanbali: Shadharat al-Dhahab, 3/58. Ibn al-Jawzi: Al-Muntazam, 484. Al-Sulami: Tabaqat, 484. Al-Safadi: Al-Wafi, 6/117.",
    "book_id": "97"
  },
  {
    "serial_number": "281947",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 70,
    "volume_number": 1,
    "text": "The basis of Sufism is adhering to the Book and Sunnah, leaving desires and innovations, and leaving committing concessions and interpretations (1).\nAl-Suhrawardi said: Every reality diverging from Sharia is heresy (Zandaqa).\nThis is the speech of the Sheikhs of the Path, and to whom Gnosis and Reality are attributed and whose saying is complied with among creation.\nIn the Dear Book and Prophetic Sunnah of glorifying Sharia knowledge and its bearers is what is not hidden from possessors of intellects and none denies it except people of Veil. Those attributed to Sufism are sections:\nA section followed what came in the Sharia, and stood with what Sunni scholars from people of Usul (Principles) and masters of Furu' (Branches) said. They are those who deserve glorification and necessitate reverence and honoring.\nA section attained extremism in a path they innovated and beliefs they invented, and stood with decorated words they collected, so they were entered into the totality of disbelievers and judged with deserving Fire.\nJudge Iyad (2) mentioned in Al-Shifa and others: And a section dominated by",
    "foot_note": "1. Appeared at Al-Adfuwi in abbreviated form, while in Tabaqat al-Sufiyyah by Al-Sulami 488, and Al-Kawakib al-Durriyyah, by Al-Munawi 2/6 it was \"after innovations\" and glorifying sanctities of Sheikhs, and seeing excuses of creation - and good companionship of fellows and undertaking their service and using beautiful morals and persistence on Awrad (litanies) and leaving concessions and interpretations.\n2. Al-Qadi Iyad: Iyad bin Musa bin Iyad bin Amrur al-Yahsubi d. 544 AH, scholar of Maghrib and Imam of Hadith people in his time, knowledgeable in Arab speech and their genealogies, famous well-known, of his works, Al-Shifa. See, Ibn Khallikan: Wafayat, 1/392 Al-Dabbi: Bughyat al-Multamis 425. Al-Humaydi: Jadhwat al-Muqtabis, 377. Al-Dhahabi: Siyar A'lam al-Nubala, 2/212, =",
    "book_id": "97"
  },
  {
    "serial_number": "281948",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 71,
    "volume_number": 1,
    "text": "Ignorance, and standing with what was innovated of customs, and left looking into Ma'arif (gnoses) and Awarif and sciences. So Satan took hold of them, and tyranny and disobedience overcame them. They celebrated dancing and Sama' and lusts stirred by natures not following a Sharia, nor avoiding an innovated matter. They are the greatest losers in deeds, {Those whose effort is lost in worldly life, while they think that they are doing well in work} (1).\nAbu Hafs al-Haddad said: If you see the Murid (seeker) loving Sama', know that in him is a remnant of idleness (2). Abu Ali al-Rudhbari (3), the verifying scholar Imam was asked about who listens to musical instruments, and says it is Halal for me, because I have reached a degree where difference of states does not affect him (4). Abu Ali said: Yes he reached Saqar (Hell).\nWe ask Allah for well-being and safety and praise be to Allah who continued His favor upon us. And blessings upon the one specified with the Praiseworthy Station on the Day of Resurrection. Sufficient for us is Allah, and [He is] the best Disposer of affairs.",
    "foot_note": "1. = Ibn al-Athir: Tahdhib, 2/43. Ibn Kathir, Al-Bidaya: 12/225.\n1. Surah Al-Kahf, verse 104.\n2. See Al-Risalah Al-Qushayriyyah, 1/185. Al-Suhrawardi: Awarif, 187.\n3. He is Abu Ali, Ahmad bin Muhammad al-Rudhbari d. 322 AH, Baghdadi resided in Egypt, accompanied Al-Junayd and Al-Nuri and Ibn al-Jalla'. See, Al-Qushayri: Al-Risalah 1/185. Al-Kalabadhi: Al-Ta'arruf, 44. Al-Sha'rani: Al-Tabaqat, 106.\n4. In Al-Risalah \"in me\" which is correct.",
    "book_id": "97"
  },
  {
    "serial_number": "281949",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 73,
    "volume_number": 1,
    "text": "Investigation Sources and References\n- Ibn Abi Ya'la (Muhammad bin Muhammad): Tabaqat al-Hanabilah, supervised its printing Muhammad Hamid al-Fiqi, Cairo ed. 1952 AD.\n- Ibn al-Athir al-Jazari (Ali bin Muhammad): Usud al-Ghabah fi Ma'rifat al-Sahabah, Beirut ed. 1328 AH.\n- Al-Kamil fi al-Tarikh, Beirut ed. 1966.\n- Al-Lubab fi Tahdhib al-Ansab, investigation Mustafa Abd al-Wahid, Cairo ed. 1971 AD.\n- Al-Adfuwi (Ja'far bin Tha'lab), Al-Tali' al-Sa'id al-Mujami' Asma' Nujaba' al-Sa'id, investigation Sa'd Muhammad Hasan, Egypt ed. 1966 AD.\n- Al-Isnawi (Abd al-Rahman bin al-Hasan): Tabaqat al-Shafi'iyyah, investigation Abdullah al-Jaburi, Baghdad ed. 1971 AD.\n- Al-Asbahani, Abu al-Faraj (Ali bin al-Husayni): Al-Aghani, Egypt ed. 1969 AD.\n- Al-Baqillani (Muhammad bin al-Tayyib): Kitab al-Bayan 'an al-Firaq, investigation Richard McCarthy, Beirut ed. 1958 AD.\n- Badawi (Abd al-Rahman): Tarikh al-Tasawwuf al-Islami, Kuwait ed., 1975 AD.\n- Al-Baghdadi (Ahmad bin Ali): Tarikh Baghdad aw Madinat al-Salam, Beirut ed., N.D.\n- Al-Baghdadi (Ismail bin Muhammad): Idah al-Maknun fi al-Dhayl 'ala Kashf al-Zunun, Tehran ed. 1947 AD, Offset ed. (Al-Maktabah al-Islamiyyah, 1967 AD).\n- Hadiyyat al-Arifin fi Asma' al-Mu'allifin wa Athar al-Musannifin, Tehran ed., 1947 AD.\n- Ibn Taghri Bardi (Yusuf bin Abdullah): Al-Nujum al-Zahirah fi Akhbar Misr wa al-Qahirah, Cairo ed. N.D.",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281950",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 74,
    "volume_number": 1,
    "text": "- Al-Tanukhi (Ali bin al-Muhsin): Nishwar al-Muhadarah, published by Majallat al-Majma' al-Ilmi in Damascus, Issue 17, year 1948 AD.\n- Al-Jahiz (Amr bin Bahr): Al-Hayawan, investigation, Abd al-Salam Muhammad Harun, Cairo ed.\n- Ibn al-Jawzi (Abd al-Rahman bin Ali): Talbis Iblis, Beirut ed., 1368 AH, Al-Muntazam fi Tarikh al-Muluk wa al-Umam, Hyderabad ed., 1358 AH.\n- Ibn Habib (Al-Hasan bin Umar): Tadhkirat al-Nabih fi Ayyam al-Mansur wa Banih, investigation Muhammad Muhammad Amin, Egypt ed., Vol 1 - 1976, Vol 2 - 1982 AD.\n- Ibn Habib (Muhammad bin Habib): Al-Muhabbar, Beirut ed. Offset from Hyderabad ed., year 1942 AD.\n- Ibn Hajar (Ahmad bin Ali): Al-Durar al-Kaminah fi A'yan al-Mi'ah al-Thaminah, Cairo ed., 1929 AD.\n- Lisan al-Mizan, Beirut ed., 1971 AD.\n- Ibn Hazm (Ali bin Ahmad): Jamharat Ansab al-Arab, investigation Abd al-Salam Muhammad Harun, 4th ed., Egypt, 1977 AD.\n- Al-Hamawi (Yaqut bin Abdullah): Mu'jam al-Udaba, published by Margoliouth, Cairo ed., 1936 AD - 1938 AD.\n- Ibn Hanbal (Ahmad bin Muhammad): Musnad al-Imam Ahmad bin Hanbal, Cairo ed., 1948 AD.\n- Hussein (Ali Safi): Al-Adab al-Sufi fi Misr (Ibn al-Sabbagh al-Qusi), Egypt ed., 1971 AD.\n- Ibn Khaldun (Abd al-Rahman bin Muhammad): Kitab al-Ibar, Beirut ed., 1971 AD.\n- Ibn Khallikan (Ahmad bin Muhammad): Wafayat al-A'yan wa Anba' Abna' al-Zaman, investigation Ihsan Abbas, Beirut ed., 1974 AD - 1977 AD, Maktabat al-Nahdah Egypt ed., 1948 AD (investigation Muhammad Muhyi al-Din Abd al-Hamid).\n- Khalifa (Haji): Kashf al-Zunun 'an Asami al-Kutub wa al-Funun, Tehran ed., 1947 AD.\n- Al-Dalaji (Ahmad bin Ali): Al-Falakah wa al-Maflukun, Baghdad ed., 1385 AH.\n- Al-Dumyati (Mahmud Mustafa): Mu'jam Asma' al-Nabat, Egypt ed., 1965 AD.",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281951",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 75,
    "volume_number": 1,
    "text": "- Al-Damiri (Kamal al-Din): Hayat al-Hayawan, Beirut ed., N.D.\n- Dozy (Reinhart): Al-Mu'jam al-Mufassal bi Asma' al-Malabis 'inda al-Arab, translation Akram Fadil, Text published in Majallat al-Lisan al-Arabi, Volume 8, Part 3, and Volume 9, Part 2, and Volume 10, Part 3.\n- Al-Dhahabi (Muhammad bin Ahmad): Tadhkirat al-Huffaz, Al-Muthanna ed. Offset, Baghdad, 1966 AD.\n- Siyar A'lam al-Nubala (Parts 1 - 22), Mu'assasat al-Risalah ed., Beirut, 1985 AD.\n- Mu'jam al-Shuyukh, manuscript in Ahmed III Library, No. 22953, microfilm in Institute of Arab Manuscripts Cairo, No. 164 F).\n- Ibn Rajab (Abd al-Rahman bin Ahmad): Al-Dhayl 'ala Tabaqat al-Hanabilah, care of Muhammad Hamid al-Fiqi, Cairo ed., 1952 AD.\n- Al-Zirikli (Khayr al-Din): Al-A'lam, Beirut, 1979 AD.\n- Al-Zayyat (Habib al-Zayyat al-Dimashqi): Laylat Raqs wa Sama' Amiriyyah lil-Fuqara, Majallat al-Mashriq, Issue 43, year 1939, quoting from Al-Durr al-Muntakhab fi Takmilat Tarikh Halab, Manuscript preserved in Al-Ahmadiyyah Library in Aleppo, No. 1214, Part One. Al-Fuqara al-Mukharribun, Majallat al-Mashriq, Volume 43, 1949 AD.\n- Al-Subki (Abd al-Wahhab bin Ali): Tabaqat al-Shafi'iyyah, investigation Al-Tanahi and Al-Hulu, Cairo ed., year 1388 AH.\n- Mu'id al-Ni'am wa Mubid al-Niqam, Beirut ed., 1983 AD.\n- Al-Sakhawi (Muhammad bin Abd al-Rahman): Al-Daw' al-Lami' li Ahl al-Qarn al-Tasi', Beirut ed., N.D.\n- Ibn Sa'd (Muhammad bin Sa'd): Al-Tabaqat al-Kubra, Beirut ed., 1968 AD.\n- Sallam (Muhammad Zaghlul): Al-Adab fi al-Asr al-Mamluki, Egypt ed., 1971 AD.\n- Al-Sulami (Muhammad bin al-Husayni): Tabaqat al-Sufiyyah, Cairo ed., 1969 AD.\n- Al-Sam'ani (Abd al-Karim bin Muhammad): Al-Tahbir fi al-Mu'jam al-Kabir, investigation Munira Naji, Baghdad ed., 1975 AD.\n- Al-Suhrawardi (Umar bin Muhammad, Abu Hafs): Awarif al-Ma'arif, Beirut ed., 1966 AD.",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281952",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 76,
    "volume_number": 1,
    "text": "- Al-Suyuti (Abd al-Rahman bin Abi Bakr): Bughyat al-Wu'at fi Tabaqat al-Lughawiyyin wa al-Nuhat, investigation Muhammad Abu al-Fadl Ibrahim - Cairo ed., 1964.\n- Tarikh al-Khulafa, investigation Muhammad Muhyi al-Din Abd al-Hamid, Egypt ed., 1953 AD.\n- Husn al-Muhadarah fi Tarikh Misr wa al-Qahirah, Egypt ed., 1967 AD.\n- Tabaqat al-Mufassirin, Cairo ed., 1976 AD.\n- Ibn Shakir al-Kutubi (Muhammad bin Shakir): Fawat al-Wafayat, investigation Ihsan Abbas, Beirut ed., 1973 AD, investigation Muhammad Muhyi al-Din Abd al-Hamid, Cairo ed., 1951 AD.\n- Al-Shatanufi (Ali bin Yusuf): Bahjat al-Asrar wa Ma'din al-Anwar, Egypt ed., 1304 AH.\n- Al-Sha'rani (Abd al-Wahhab bin Muhammad): Al-Tabaqat al-Kubra (Lawaqih al-Anwar fi Tabaqatih al-Akhyar) Cairo ed., 1965 AD.\n- Al-Yawaqit wa al-Jawahir fi Bayan Aqa'id al-Akabir, Cairo ed., 1932 AD.\n- Al-Shaybani (Muhammad bin al-Hasan): Al-Kasb, investigation Suhayl Zakkar, Damascus ed., 1980 AD.\n- Salihiyya (Muhammad Isa): Min Watha'iq al-Haram al-Qudsi al-Sharif, Kuwait ed., 1984 AD.\n- Al-Safadi (Khalil bin Aybak): Al-Wafi bi al-Wafayat, Part Three, care of S. Dedering Wiesbaden, 1974 AD.\n- Safi al-Din al-Khazraji (Al-Husayn bin Jamal al-Din): Siyar al-Awliya fi al-Qarn al-Sabi' al-Hijri, investigation Ma'mun Mahmud Yasin, and Iffat Wisal Hamzah, Beirut ed., N.D.\n- Al-Suqa'i (Fadl Allah bin Fakhr): Tali Wafayat al-A'yan, investigation Jacqueline Sublet, Beirut ed., 1974 AD.\n- Ibn Tulun al-Dimashqi (Muhammad bin Ali): Mufakahat al-Khillan fi Hawadith al-Zaman, investigation Muhammad Mustafa Ziadah, Cairo ed., 1962, 1964 AD.\n- Al-Dabbi (Ahmad bin Yahya): Bughyat al-Multamis fi Tarikh Rijal Ahl al-Andalus, Cairo ed., 1967 AD.",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281953",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 77,
    "volume_number": 1,
    "text": "- Ibn Asakir (Ali bin al-Hasan bin Hibat Allah): Tabyin Kadhib al-Muftari fima Nusiba ila al-Imam Abi al-Hasan al-Ash'ari, Damascus ed., 1347 AH.\n- Abu al-Ala al-Ma'arri: Risalat al-Ghufran, and with it edited text from Risalat Ibn al-Qarih, investigation Bint al-Shati, 6th ed., Egypt, 1977 AD. Jadid fi Risalat al-Ghufran, Beirut ed., 1972 AD.\n- Ibn al-Imad al-Hanbali (Abd al-Hayy bin Ahmad): Shadharat al-Dhahab fi Akhbar Man Dhahab, Beirut ed., 1970 AD.\n- Al-Umari (Ahmad bin Yahya): Masalik al-Absar, investigation Ahmad Zaki, Cairo ed., 1924 AD.\n- Al-Ayni (Badr al-Din, Mahmud bin Ahmad): Aqd al-Juman fi Tarikh Ahl al-Zaman, manuscript in Salim Aga Library - Turkey, No. 834 History, Part Thirty-Three.\n- Al-Ghazali (Muhammad bin Muhammad, Abu Hamid): Ihya Ulum al-Din, Beirut ed., N.D.\n- Al-Ghazali (Muhammad bin Muhammad, Najm al-Din): Lutf al-Samar wa Qatf al-Thamar, investigation Mahmud al-Shaykh, Damascus ed., 1981, 1982 AD.\n- Ibn al-Furat (Muhammad bin Abd al-Rahim): Tarikh al-Duwal wa al-Muluk, investigation Constantine Zurayk, Beirut ed., 1938 AD - 1942 AD.\n- Fikri (Ahmad): Masajid al-Qahirah wa Madarisuha, Egypt ed., 1965 AD.\n- Ibn al-Fuwati (Abd al-Razzaq bin Muhammad): Al-Hawadith al-Jami'ah wa al-Tajarib al-Nafi'ah fi al-Mi'ah al-Sabi'ah, investigation Mustafa Jawad, Baghdad ed., 1932 AD.\n- Abu al-Fayd (Mahmud Abu al-Fayd al-Manufi): Jamharat al-Awliya (A'lam al-Sufiyyah) Cairo ed., 1967 AD.\n- Al-Qushayri (Abd al-Karim bin Hawazan): Al-Risalah al-Qushayriyyah, Beirut ed., N.D.\n- Al-Qalqashandi (Ahmad bin Ali): Nihayat al-Arab fi Ma'rifat Ansab al-Arab, investigation Ibrahim al-Abyari, Egypt ed., 1980 AD.\n- Al-Qifti (Ali bin Yusuf): Tarikh al-Hukama, investigation Julius Lippert, Baghdad and Egypt ed., year 1903 (Offset).\n- Ibn Kathir (Ismail bin Umar): Al-Bidaya wa al-Nihaya, Beirut ed., 1966 AD.\n- Kahhalah (Umar Rida): Mu'jam al-Mu'allifin, Beirut ed., 1957 AD.\n- Al-Kalabadhi (Muhammad bin Ibrahim): Al-Ta'arruf li Madhhab Ahl al-Tasawwuf, investigation",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281954",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 78,
    "volume_number": 1,
    "text": "Abd al-Halim Mahmud, and Taha Abd al-Baqi, Cairo ed., 1960 AD.\n- Al-Maqqari: Nafh al-Tib fi Ghusn al-Andalus al-Ratib, Beirut ed., 1949 AD.\n- Mayer (L.): Al-Malabis al-Mamlukiyyah, translation Salih al-Shini, Cairo ed., 1972 AD.\n- Mubarak (Zaki): Al-Tasawwuf al-Islami fi al-Adab wa al-Akhlaq, Beirut ed., N.D.\n- Al-Maqrizi (Ahmad bin Ali): Al-Suluk li Ma'rifat Duwal al-Muluk, published by Muhammad Mustafa Ziadah 1942, 1958 AD. Al-Mawa'iz wa al-I'tibar, Bulaq ed. 1270 AH / 1853 AD.\n- Al-Munawi (Abd al-Ra'uf Muhammad bin Taj al-Arifin): Al-Kawakib al-Durriyyah fi Tarajim al-Sadah al-Sufiyyah, published by Mahmud Hasan Rabi', Cairo ed., 1938.\n- Al-Mundhiri (Muhammad Abd al-Azim bin Abd al-Qawi): Al-Targhib wa al-Tarhib fi al-Hadith al-Sharif, Cairo ed., 1954 AD.\n- Al-Takmilah li Wafayat al-Naqalah, investigation Dr. Bashar Awwad Ma'ruf, Mu'assasat al-Risalah ed., Beirut, 1981 AD.\n- Ibn Manzur (Muhammad bin Mukarram): Lisan al-Arab, Beirut ed., N.D.\n- Abu Nasr al-Sarraj al-Tusi (Abdullah bin Ali): Al-Luma', investigated by Abd al-Halim Mahmud and Taha Abd al-Baqi, Egypt and Baghdad ed., 1960 AD.\n- Abu Nu'aym al-Asbahani (Ahmad bin Abdullah): Hilyat al-Awliya wa Tabaqat al-Asfiya, Beirut ed., 1967 AD.\n- Al-Nuwayri (Ahmad bin Abd al-Wahhab): Nihayat al-Arab fi Funun al-Adab, Cairo ed., 1976 AD.\n- Al-Yafi'i (Abdullah bin As'ad): Mir'at al-Jinan wa Ibrat al-Yaqzan fi Ma'rifat ma Yu'tabar min Hawadith al-Zaman, Beirut ed., 1970 AD.\n- Al-Yunini (Qutb al-Din, Musa bin Muhammad): Dhayl Mir'at al-Zaman, Oxford manuscript No. OR.POC.132 * * *",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281955",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 79,
    "volume_number": 1,
    "text": "Hadith Referencing Sources and References\n Tuhfat al-Ashraf bi Ma'rifat al-Atraf, by Hafiz al-Mizzi, investigation Sheikh Abd al-Samad Sharaf al-Din, reprint of Al-Maktab al-Islami from Al-Dar al-Qayyimah edition in India, Beirut 1403 AH.\n Jami' al-Usul fi Ahadith al-Rasul peace be upon him, by Imam Ibn al-Athir, investigation Sheikh Abd al-Qadir al-Arna'ut, Maktabat al-Halwani, Matba'at al-Mallah, Maktabat Dar al-Bayan, Damascus 1389 AH.\n Hilyat al-Awliya, by Abu Nu'aym al-Asbahani, reprint of Dar al-Kitab al-Arabi, Beirut 1405 AH.\n Zad al-Ma'ad fi Hadi Khayr al-Ibad, by Ibn Qayyim al-Jawziyyah, investigation Sheikhs Shu'ayb al-Arna'ut and Abd al-Qadir al-Arna'ut, Mu'assasat al-Risalah Beirut and Maktabat al-Manar al-Islamiyyah in Kuwait 1399 AH.\n Sunan Ibn Majah, investigation Professor Muhammad Fu'ad Abd al-Baqi, reprint of Dar Ihya al-Turath al-Arabi, Beirut 1395 AH.\n Sunan al-Tirmidhi, investigation Sheikh Ahmad Muhammad Shakir, and Professor Muhammad Fu'ad Abd al-Baqi, and Sheikh Ibrahim Atwah Awad.\n Al-Sunan al-Kubra by Al-Bayhaqi, reprint of Dar al-Fikr, Beirut N.D.\n Sharh al-Arba'in al-Nawawiyyah fi al-Ahadith al-Sahihah al-Nabawiyyah, compiled by Mahmud al-Arna'ut, reviewed by Sheikh Abd al-Qadir al-Arna'ut, Dar Ibn Kathir, Damascus - Beirut 1406 AH.\n Sahih Muslim, investigation Professor Muhammad Fu'ad Abd al-Baqi, Dar Ihya al-Turath al-Arabi, Beirut N.D.",
    "foot_note": "None",
    "book_id": "97"
  },
  {
    "serial_number": "281956",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Mufi bi-Ma'rifat al-Tasawwuf wa al-Sufi (The Fulfiller in Knowing Sufism and the Sufi)",
    "edition": "First, 1408 AH - 1988 AD",
    "publisher": "Dar Al-Urubah Library for Publishing and Distribution - Kuwait",
    "page_number": 80,
    "volume_number": 1,
    "text": " Fath al-Bari bi Sharh Sahih al-Bukhari, by Ibn Hajar, under supervision of Allama Sheikh Abd al-Aziz bin Baz, Al-Maktabah al-Salafiyyah in Cairo 1393 AH.\n Kitab Ishrat al-Nisa (from Al-Sunan al-Kubra) by Al-Nasa'i, investigation Professor Amr Ali Umar, Maktabat al-Sunnah, Cairo 1408 AH.\n Al-Mustadrak 'ala al-Sahihayn, by Al-Hakim, reprint of Dar al-Kitab al-Arabi, Beirut N.D.\n Musnad al-Imam Ahmad bin Hanbal, reprint of Al-Maktab al-Islami, and Dar Sadir, Beirut 1389 AH.\n Al-Mu'jam al-Mufahras li Alfaz al-Hadith al-Nabawi, Dr. Wensinck, Brill 1356 AH.\n* * *",
    "foot_note": "None",
    "book_id": "97"
  }
]