[
  {
    "text": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study\nAuthor: نهار بن عبد الرحمن العتيبي\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 1
  },
  {
    "text": "sn: 677\nbook_title: أثر الشك والوسواس في وجود الله عز وجل على عقيدة المسلم -دراسة عقدية-\nbook_link: https://shamela.ws/book/1136\nbook_id: 1136\nauthor_name: نهار بن عبد الرحمن العتيبي\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/1921\nauthor_ID: 1921\neditor: Null\npublisher: Null\nedition: Null\npages: 58\nvolumes: Null\npagination: [كتاب إلكتروني بترقيم الشاملة]\ncategory: العقيدة\ncategory_id: 1",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 2
  },
  {
    "serial_number": "5597",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Doctrine. Book: The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study. Author: Nahar bin Abdul Rahman Al-Otaibi. Number of Pages: 58 [E-book with Shamela numbering]. Publication Date in Shamela: 6 Jumada al-Ula 1444.\nBook: The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study. Author: Nahar bin Abdul Rahman Al-Otaibi. Number of Pages: 58 [E-book with Shamela numbering]. Publication Date in Shamela: 6 Jumada al-Ula 1444.\nAuthor: Nahar bin Abdul Rahman Al-Otaibi. Number of Pages: 58 [E-book with Shamela numbering]. Publication Date in Shamela: 6 Jumada al-Ula 1444.\n[E-book with Shamela numbering]. Publication Date in Shamela: 6 Jumada al-Ula 1444.",
    "foot_note": "None",
    "book_id": "1136",
    "new_page_number": 3
  },
  {
    "serial_number": "5598",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Introduction\nPraise be to Allah, Lord of the Worlds, and may peace and blessings be upon our Prophet Muhammad, his family, and all his companions. To proceed:\nMany Muslims suffer from frequent doubts and whispers regarding the existence of God Almighty, alongside the abundance of those who cast doubt on God's existence and their spread in various media outlets, especially on the World Wide Web and social media platforms. This necessitates clarifying the ruling on doubt and whispers regarding the existence of God Almighty, as this pertains to God Almighty, and the honor of knowledge is derived from the honor of the known subject, especially this knowledge related to the greatest principle of faith, which is belief in God Almighty.\nResearching the issue of the existence of God Almighty is the most important and loftiest of researches, for belief in His existence, Glory be to Him, relative to the rest of the principles and branches, is like the root of a tree relative to the trunk and branches. It is the root of roots and the foundation of religion. The greater a person's share of belief in God, the greater his share in Islam. Casting doubt on the existence of God Almighty for a Muslim makes the disbelief of people greater, to the point that a specialist in doctrine said: 'It would have been appropriate for us not to dwell much on the proofs of God's existence, because human nature (Fitrah) testifies to that, and hardly any denier of the Creator's existence was known in the past except for a very few, who do not represent a significant percentage of humanity. However, the deviation today has reached the lowest depths, so we now see people claiming there is no Creator, making this statement a doctrine upon which they build their lives. States numbering hundreds of millions of people have been established on this doctrine. This statement has spread everywhere, books have been written on it, it has developed a philosophy taught [in schools], and its proponents have tried to call it the scientific method and provide evidence for it.' (1)\nWith the spread of whispers (Waswasah) among many people, there was a great necessity to clarify the ruling on whispers regarding the existence of God Almighty, to know the extent of its impact on the Muslim's belief, what rulings result from those whispers, and how a Muslim deals with them.",
    "foot_note": "1. Al-Aqidah fi Allah (Belief in Allah), Omar bin Suleiman Al-Ashqar, Dar Al-Nafais, 2nd Edition, 1419 AH, Jordan, (72).",
    "book_id": "1136",
    "new_page_number": 4
  },
  {
    "serial_number": "5599",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "Definition of Scientific Terms:\n1 - First: Definition of 'Athar' (Effect/Trace) Linguistically and Terminologically:\nA - 'Athar' Linguistically: It is used to mean several things. Ibn Faris (d. 395 AH) said: (Athar) has three roots: presenting something, mentioning something, and the trace of the thing remaining. (1) Ibn Manzur (d. 711 AH) said: Al-Athar with a movement (on the Tha) - what remains of the trace of a thing. Al-Ta'athur is retaining the trace in the thing, and 'Athara fi al-shay' means he left a trace in it. (2)\nB - 'Athar' Terminologically: The usage of the word (Athar) does not depart from the linguistic meanings. It is used to indicate three meanings: The first meaning is the result, which is what is obtained from the thing. The second is the sign. The third meaning is the part, or what results from the thing. (3) Therefore, the predecessors (Salaf), may Allah have mercy on them, see that 'Athar' is intended to mean knowledge, or the essence of knowledge, or knowledge that is extracted, or the result of a thing. Ibn Jarir, may Allah have mercy on him, said in the interpretation of the Almighty's saying: {or a trace of knowledge, if you should be truthful} [Al-Ahqaf: 4], meaning: 'The remainder of knowledge, because that is what is known in the speech of the Arabs.' (4)",
    "foot_note": "1. Mu'jam Maqayis al-Lughah, edited by: Abd al-Salam Harun, Dar al-Kutub al-Ilmiyyah, Book of Hamza - Chapter of Hamza and Ta and what follows them, (1/53).\n2. Lisan al-Arab, entry (Athar) (1/52).\n3. Kitab al-Ta'rifat, Ali bin Muhammad bin Ali al-Jurjani, edited by Ibrahim, Dar al-Kitab al-Arabi, 4th Edition, 1418 AH, Beirut (23), Majallat al-Buhuth al-Islamiyyah, Issue 66, for the year 1423 AH, (66/259).\n4. Jami' al-Bayan 'an Ta'wil al-Qur'an, Muhammad bin Jarir al-Tabari, Dar al-Salam, 1st Edition, 1425 AH (9/7392 - 7393).",
    "book_id": "1136",
    "new_page_number": 5
  },
  {
    "serial_number": "5600",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "Second: Definition of Doubt (Shakk) Linguistically and Terminologically\nDoubt Linguistically: Doubt is used to mean several things, most importantly:\n1 - Interpenetration/Piercing, as in: I pierced him (shakaktuhu) with the spear, meaning I stabbed him with it; so its head entered his body. (1)\n2 - Doubt meaning lack of certainty; so his saying: I doubted (shakaktu) the matter or became doubtful (tashakaktu) about it means my certainty went away, because for the doubter, it is as if the two matters were pierced (shukka) into a single pierce (mishk); and he is not certain of either of them. That is why it is said: You pierced (shakakta) between two leaves, if you stuck the stick into them and they joined together. (2)\n3 - Hesitation: Meaning hesitation between two things; without preferring one over the other. (3)\nAnd from it is the Almighty's saying: {So if you are in doubt, [O Muhammad], about that which We have revealed to you, then ask those who have been reading the Scripture before you. The truth has certainly come to you from your Lord, so never be among the doubters.} [Yunus: 94].",
    "foot_note": "1. Mu'jam Maqayis al-Lughah, Ibn Faris, (3/173).\n2. Mu'jam Maqayis al-Lughah, Ibn Faris, (3/173).\n3. Al-Misbah al-Munir, Ahmad al-Maghribi, Dar al-Kutub al-Ilmiyyah edition, (n.d.), (167).",
    "book_id": "1136",
    "new_page_number": 6
  },
  {
    "serial_number": "5601",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Doubt Terminologically\nThe definition of doubt in terminology is not far from the linguistic definition. Doubt is defined as: \"That which contradicts certainty, and its holder wavers between two things\" (1). This is indicated by one of the interpretations of the Almighty's saying: {Their messengers said, \"Can there be doubt about Allah, Creator of the heavens and earth? He invites you that He may forgive you of your sins, and He delays your death for a specified term.\"} [Ibrahim: 10]. Al-Hafiz Ibn Kathir, may Allah have mercy on him, said: \"Is there doubt about His existence? For the natural dispositions (Fitrah) testify to His existence and are naturally inclined to acknowledge Him. Acknowledgment of Him is necessary in sound natural dispositions. However, doubt and confusion may occur to some of them, so they need to look into the evidence leading to His existence; that is why the messengers said to them, guiding them to the way of knowing Him, that He is the (Creator of the heavens and earth) who created and originated them without a preceding example. The evidences of occurrence, creation, and subjugation are apparent upon them, so they must have a Maker, who is Allah, there is no god but He, the Creator of everything, its God and its Owner.\" (2)\nSo doubt in the existence of God Almighty is hesitation regarding His existence, Glory be to Him; and lack of certainty in His existence, Glory be to Him and Exalted is He. (3)",
    "foot_note": "1. Tafsir al-Qur'an al-Azim, Al-Hafiz Ibn Kathir, (2/691 - 692).\n2. Tafsir al-Qur'an al-Azim, Al-Hafiz Ibn Kathir, (He said, may Allah have mercy on him: \"The second meaning in their saying: (Can there be doubt about Allah) is: Is there doubt about His divinity and His singleness in the obligation of worship to Him, while He is the Creator of all existents, and none deserves worship except Him, alone with no partner; for most nations acknowledged the Maker, but worshipped others with Him as intermediaries they thought would benefit them or bring them near to Allah.\" (Previous reference, 2/692).\n3. Tajrid al-Tawhid al-Mufid, Allamah Ahmad bin Ali Al-Maqrizi, (766 - 845 AH), printed and published by the General Presidency for Scholarly Research and Ifta in the Kingdom of Saudi Arabia, 2nd Edition, 1432 AH, Riyadh, p. 48.",
    "book_id": "1136",
    "new_page_number": 7
  },
  {
    "serial_number": "5602",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "Third: Definition of Whisper (Waswas) Linguistically and Terminologically\nWaswas Linguistically\nWaswas: \"The devil, the whisper of the hunter and dogs, the sound of jewelry. And Waswasah: the speech of the soul and the devil with what has no benefit.\" (1)\nWaswas Terminologically\nWaswas and Waswasah are: What is cast into the heart and is hidden from creation so they do not view it, either as self-talk or by the act of the devil. It is a mere passing thought that did not settle in the heart, let alone the heart knotting upon it; rather, it hates it. (2)\nIt was said that Waswasah is: \"Thoughts that are not stable, nor brought about by a doubt that occurred, and have no basis.\" (3)\nThe Difference Between Doubt and Whisper\nGiven the confusion among many Muslims between doubt and whisper, the difference between them must be clarified. The difference between them has an impact on the ruling of each, as will become clear in the coming sections, God willing. The predecessors (Salaf), may Allah have mercy on them, see that doubt contradicts certainty; doubt and certainty do not gather. As for whisper, it is merely thoughts and ideas, either what the soul whispers or what the devil whispers, while certainty remains in the heart regarding the existence of God Almighty, (4) evidenced by the saying of God Almighty: {Indeed, there is for him no authority over those who have believed and rely upon their Lord} [An-Nahl: 99]. So he has no power over the believers due to the tranquility of their hearts with faith.",
    "foot_note": "1. Al-Qamus al-Muhit, Muhammad bin Yaqub al-Fairuzabadi, Dar al-Kutub al-Ilmiyyah, 2nd Edition, 1428 AH, Beirut (603) under (Al-Was).\n2. Al-Fatawa, Sheikh al-Islam Ibn Taymiyyah, (7/281), Al-Radd 'ala al-Mantiqiyyin, Al-Qayyimah Edition, Bombay, 1368 AH, (508).\n3. Sharh al-Nawawi 'ala Muslim, Yahya bin Sharaf Abu Zakaria al-Nawawi, Dar al-Khair, 1416 AH, Book of Faith, Chapter on clarifying whispering in faith and what one who finds it should say, (3/318).\n4. Aqidah al-Salaf wa Ashab al-Hadith, Ismail bin Abdul Rahman al-Sabuni, edited by: Dr. Nasser bin Abdul Rahman al-Jada', Dar al-Asimah, 2nd Edition, 1419 AH, Riyadh (296).",
    "book_id": "1136",
    "new_page_number": 8
  },
  {
    "serial_number": "5603",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "Doubt may come with the meaning of whisper, and this becomes clear from the context, as in the saying of the Prophet, peace and blessings be upon him: (We are more entitled to doubt than Abraham) (1). Ibn Abbas, may Allah be pleased with them both, said: \"This is regarding what occurs in the chests and what the devil whispers. So Allah was pleased with Abraham, peace be upon him, for saying: Yes (I believe).\" (2) \"So the intended meaning of doubt here is the thoughts that do not stabilize. As for the terminological doubt, which is stopping between two matters without preference for one over the other, it is categorically negated for the Friend (Abraham) because its occurrence is far-fetched for one whose faith is firmly established in his heart, so how about one who reached the rank of prophethood.\" (3)",
    "foot_note": "1. Al-Bukhari, Book of Stories of the Prophets, Chapter on the Almighty's saying: And inform them about the guests of Abraham, Hadith No. (3372), and Muslim, Book of Faith, Chapter on increasing the tranquility of the heart, Hadith No. (151).\n2. Fath al-Bari Sharh Sahih al-Bukhari, Ahmad bin Ali bin Hajar al-Asqalani, Dar al-Salam, 1st Edition, 1421 AH, Riyadh (6/498).\n3. Fath al-Bari, Ibn Hajar (6/500), Al-Awasim min al-Qawasim fi al-Dhabb 'an Sunnah Abi al-Qasim, Muhammad bin Ibrahim bin al-Wazir al-Yamani, edited by: Shu'ayb al-Arna'ut, Mu'assasat al-Risalah, 2nd Edition, Beirut, (1/212).",
    "book_id": "1136",
    "new_page_number": 9
  },
  {
    "serial_number": "5604",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "Fourth: Definition of Doctrine (Aqidah) Linguistically and Terminologically\nA - Aqidah Linguistically: Derived from 'Al-Aqd' (tying/knotting). One tied (Aqada) the rope means he tightened it (1). 'Al-Aqd' is tying firmly, and from it comes tightening, ratification, cohesion, compacting, affirming, and securing. (2) It is applied to what is in the heart, so it is said: He believed (I'taqada) such and such with his heart (3). Allah the Blessed and Almighty said: {Allah will not impose blame upon you for what is meaningless in your oaths, but He will impose blame upon you for [breaking] what you intended of oaths} [Al-Ma'idah: 89]. \"It is: The judgment in which there is no doubt for the one who believes it. So Aqidah in religion is what is intended as belief without action, like the belief in the existence of God and the sending of messengers. The plural is 'Aqa'id'. In summary, whatever a person knots his heart upon with certainty is an Aqidah, whether it is true or false\" (4).\nB - Aqidah Terminologically: Aqidah in general terminology is: \"Matters which the heart must believe in, and the soul must find tranquility in, until they become a steadfast certainty not mixed with doubt nor mingled with suspicion. Meaning: Firm faith that is not infiltrated by doubt for the believer. It must be consistent with reality, accepting neither doubt nor conjecture. If knowledge does not reach the level of firm certainty, it is not called Aqidah.\" (5)\nIslamic Aqidah: Is \"Firm belief in Allah and what is due to Him in His Divinity, Lordship, Names, and Attributes; belief in His Angels, Books, Messengers, the Last Day, and Destiny, its good and its evil; and in everything that authentic texts brought regarding the principles of religion, matters of the unseen and its news, and what the predecessors (Salaf) agreed upon; and submission to Allah Almighty in judgment, command, destiny, and legislation, and to His Messenger, peace and blessings be upon him, with obedience, arbitration, and following.\" (6)\nAqidah, in terms of being a science according to the concept of Ahl al-Sunnah wal-Jama'ah, includes the following topics: Tawhid - Tawhid of Divinity (Uluhiyyah), Tawhid of Lordship (Rububiyyah), and Tawhid of Names and Attributes - Faith (Iman), Islam, Unseen matters (Ghaybiyyat), Prophethoods, Destiny, Reports, Principles of definitive rulings, and all principles of religion and belief. Following this is the refutation of the people of desires and innovations and all deviant sects and creeds, and the stance towards them (7).",
    "foot_note": "1. - Al-Qamus al-Muhit, Al-Fairuzabadi, under: (Aqd), (324).\n2. - Lisan al-Arab, Abu al-Fadl Jamal al-Din Ibn Manzur, Dar Sader, Beirut, Vol 3, pp. 295-300, Al-Mu'jam al-Wasit, Academy of the Arabic Language in Cairo, Dar Ihya al-Turath al-Islami, Vol 2, pp. 620-621.\n3. - Mukhtar al-Sihah, Muhammad bin Abi Bakr bin Abdul Qadir al-Razi, 11th Edition, 1426 AH, Mu'assasat al-Risalah, Beirut, Lebanon, p. 390.\n4. Al-Wajiz fi Aqidah al-Salaf al-Salih Ahl al-Sunnah wal-Jama'ah, Abdullah bin Abdul Hamid al-Athari, 3rd Edition, 1425 AH, Dar al-Rayah, Riyadh, p. 29.\n5. Al-Wajiz fi Aqidah al-Salaf al-Salih, Al-Athari, p. 30.\n6. Mabahith fi Aqidah Ahl al-Sunnah wal-Jama'ah, Al-Aql Nasser bin Abdul Karim, p. 9.\n7. Previous reference, (6).",
    "book_id": "1136",
    "new_page_number": 10
  },
  {
    "serial_number": "5605",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "Topic One: The Reality of the Existence of God Almighty\nThe reality of the existence of God Almighty is an established truth according to the righteous predecessors (Salaf al-Salih), may Allah have mercy on them. The default for them is certainty in the existence of God Almighty, unlike the deviant sects from the people of Kalam (speculative theology) and those who agreed with them in the past and in our present time. For the default for them is doubt, not certainty, contrary to the righteous predecessors, Ahl al-Sunnah wal-Jama'ah. \"Deviation in affirming the existence of God Almighty was found among the Jahmiyyah and innovators, as a result of being influenced by the Zanadiqah (heretics) and the Indian Sumaniyyah. The deviation of the Mutakallimin (theologians) from the Mu'tazila (1) and others expanded, so they stipulated speculative reasoning (Nazar) and inference (Istidlal), and doubt for the attainment of knowledge of the Maker, according to their claim. Sheikh al-Islam refuted",
    "foot_note": "1. The Mu'tazila is a deviant sect that differed from the consensus of the Ummah regarding the perpetrator of a major sin, led by Wasil bin Ata and Amr bin Ubayd during the time of Al-Hasan Al-Basri. The Mu'tazila believe in five principles in which they contradict Ahl al-Sunnah wal-Jama'ah, which are: Tawhid (Unity), Justice (Adl), the Promise and the Threat (Al-Wa'd wa Al-Wa'id), the Position between the two positions (Al-Manzilah bayn Al-Manzilatayn), and Enjoining Good and Forbidding Evil, through which they view rebelling against the ruler and fighting him. (Contemporary Sects Attributing Themselves to Islam and Islam's Stance on Them, Dr. Ghalib bin Ali Awaji, Al-Maktabah Al-Asriyyah Al-Dhahabiyyah, 5th Edition, 1426 AH, Jeddah, 3/1163 - 1198, The Fundamental Principles of the Mu'tazila: A Study and Evaluation, Dr. Ali bin Saad bin Saleh Al-Dhuwayhi, Maktabat Al-Rushd, 2nd Edition, 1417 AH, Riyadh, p. 45 and following).",
    "book_id": "1136",
    "new_page_number": 11
  },
  {
    "serial_number": "5606",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "this false claim, saying: This is not the saying of anyone from the predecessors of the Ummah nor its Imams, nor did any of the prophets and messengers say it, nor is it the saying of the theologians (Mutakallimin), nor most of them. Rather, this is a innovated saying in Islam, innovated by the theologians of the Mu'tazila, and similar theologians whom the predecessors of the Ummah and its Imams agreed on condemning. Sects of theologians from the Murji'ah, Shi'a, and others disputed them in that, and said: Rather, acknowledgment of the Maker is innate, necessary, and axiomatic; it does not have to depend on speculative reasoning and inference. Indeed, the predecessors of the Ummah and its Imams agreed that knowing God and acknowledging Him does not depend on these methods mentioned by the people of speculative reasoning\" (1). So the Mu'tazila and those who agreed with them see that the first duty on the accountable person (Mukallaf) is speculative reasoning leading to knowledge, and therefore they argued for the obligation of doubt. While the first duty according to the Salaf is Tawhid because God Almighty commanded it. Knowledge leads to Tawhid, and God Almighty has created people with the innate knowledge of Him. The Messenger of Allah, peace and blessings be upon him, stated this in his advice to Mu'adh when he sent him to Yemen, saying: (Let the first thing you call them to be to unify God (Tawhid)) and in a narration: The testimony that there is no god but Allah and that Muhammad is the Messenger of Allah, peace be upon him (2). (3)",
    "foot_note": "1. Naqd Ta'sis al-Jahmiyyah, Sheikh al-Islam Ibn Taymiyyah, (5/473), Majmu' Fatawa Sheikh al-Islam Ibn Taymiyyah, Ahmad bin Abdul Halim Ibn Taymiyyah, edited by: Abdul Rahman bin Muhammad bin Qasim, 1st Edition, 1398 AH (6/350), Al-Aqidah Al-Islamiyyah wa Juhud Ulama Al-Salaf fi Taqriraha wa Al-Difa' Anha hatta Nihayat Al-Asr Al-Umawi, Atallah Bakhit Hammad Al-Ma'aitah, Dar Al-Afaq Al-Fikriyyah, 1st Edition, 1422 AH, Egypt (13).\n2. Al-Bukhari, Book of Tawhid, Chapter on what came regarding the supplication of the Prophet, peace be upon him, Hadith No. (6848) and narrated by Muslim in the Book of Faith, Chapter on clarifying the pillars of Islam and its great supports, Hadith No. (16).\n3. The Maturidis believe that knowledge of God is not achieved through necessary innate knowledge but only through rational acquisition. Therefore, one of the principles upon which their doctrine is built is (the obligation of knowing God through reason), and they based on that the obligation of speculative reasoning and inference, making it the first duty on the servant. The Ash'aris differed in their expressions regarding the first duty on the accountable person after agreeing that the command to worship Him is not the first duty. The Ash'aris narrated from Al-Ash'ari the saying that the first duty on the accountable person is knowledge (Ma'rifah). And knowledge for them means knowing the existence of God and His uniqueness in creating the world. According to Al-Baqillani, the first duty is: Speculative reasoning (Nazar). He said: The first thing God Almighty imposed on all servants is to look into His signs. And the second of God Almighty's obligations on all servants is faith in Him and acknowledgment of His books and messengers. The intended meaning of Nazar for them is: Arranging two known matters to arrive through their arrangement at unknown knowledge. (Majmu' Al-Fatawa, (2/37038), Dar' Ta'arud Al-Aql wa Al-Naql, (8/8).",
    "book_id": "1136",
    "new_page_number": 12
  },
  {
    "serial_number": "5607",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "Therefore, the Salaf express it as 'Ma'rifah', meaning knowing God Almighty. That is why Al-Saffarini (1) says in 'Al-Durra Al-Madiyyah fi 'Aqd Ahl Al-Firqah Al-Mardiyyah': The first duty on the slaves is knowing the God with guidance (2). Sheikh Muhammad Al-Uthaymeen, may Allah have mercy on him, commenting on that said: \"The correct view is what the author, may Allah have mercy on him, said, that the first duty is knowing God. As for speculative reasoning, we do not say it is obligatory, but if we assume that a person needed to reason, then reasoning becomes obligatory on him.\" (3)\nThe very many evidences have indicated what the Salaf went to, that God Almighty exists, whether the evidence is from the Fitrah (innate nature) upon which God created people, or the evidence is from the Book of God Almighty or the Sunnah of His Prophet, peace and blessings be upon him, or the evidence is a rational evidence, or a sensory evidence. The basis for this according to the Salaf, may Allah have mercy on them, is the evidence from the Book of God Almighty and the Sunnah of His Prophet, peace and blessings be upon him, then the rest of the evidences come to support it. This can be clarified as follows:",
    "foot_note": "1. He is the grand Imam, the learned scholar Muhammad bin Ahmad bin Salim bin Suleiman Al-Saffarini, Al-Nabulsi Al-Hanbali, author of famous works. He was born in the village of Saffarin, one of the villages of Nablus in the year 1114 AH. He recited the Great Quran then traveled to Damascus to seek knowledge, taking knowledge from many sheikhs. He has many works, including: Sharh Thulathiyyat Musnad Ahmad, Sharh Nuniyyah Al-Sarsari, Tahbir Al-Wafa fi Sirat Al-Mustafa, and Ghidha' Al-Albab fi Sharh Manzumat Al-Adab, and others. He died, may Allah have mercy on him, in the year 1188 AH. He is upon the creed of Ahl al-Sunnah wal-Jama'ah, but there are some observations against him for being influenced by some phrases of the people of Kalam, such as his saying: (The Quran is the pre-eternal speech of God) and his saying: And all His action-based attributes such as Istiwa (rising), Descending, Coming, Arrival, Takwin (formation) and the like are pre-eternal to God Almighty, nothing of them is originated (Muhdath)) and like his talk about Tafwid (relegating the meaning) of speech. This does not detract from his knowledge, may Allah Almighty have mercy on him, for he is upon the creed of the righteous predecessors. (Abdul Rahman bin Qasim, Introduction to Hashiyat Al-Durra Al-Madiyyah by Al-Saffarini, 5-6, Lawa'ih Al-Anwar Al-Saniyyah wa Lawaqih Al-Afkar Al-Sunniyyah Sharh Qasidat Abi Dawud Al-Ha'iyyah fi Aqidah Ahl Al-Athar Al-Salafiyyah, Muhammad bin Ahmad bin Salim Al-Saffarini, edited by: Dr. Abdullah bin Muhammad bin Suleiman Al-Busayri, Maktabat Al-Rushd, 1st Edition, 1421 AH, Riyadh, 1/50 - 53).\n2. Sharh Al-Aqidah Al-Saffariniyyah (Al-Durra Al-Madiyyah fi 'Aqd Ahl Al-Firqah Al-Mardiyyah), Muhammad bin Saleh Al-Uthaymeen, Madar Al-Watan, 2nd Edition, 1434 AH, Riyadh, p. 147.\n3. Previous reference, p. 149.",
    "book_id": "1136",
    "new_page_number": 13
  },
  {
    "serial_number": "5608",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "First: The Evidence of Fitrah (Innate Nature)\nPeople of sound nature are all agreed on acknowledging God Almighty. (1) \"For acknowledgment of the Creator, Glory be to Him, and His perfection, is an innate, necessary matter for one whose nature is sound\" (2). \"Sound nature testifies to the existence of God without proof. The Quran did not prolong the argumentation for the existence of God Almighty, because the Quran establishes that sound natures, and souls that have not been polluted by the filth of polytheism, are naturally disposed to acknowledge His existence, Glory be to Him. Indeed, His unification - Glory be to Him - is an innate, axiomatic matter; Allah Almighty said: {So direct your face toward the religion, inclining to truth. [Adhere to] the fitrah of Allah upon which He has created [all] people. No change should there be in the creation of Allah. That is the correct religion, but most of the people do not know.} [Ar-Rum: 30]. The Prophet, peace and blessings be upon him, stated the innate nature of acknowledging the Creator. In the two Sahihs from Abu Huraira, may Allah be pleased with him, he said: The Messenger of Allah, peace and blessings be upon him, said: (No child is born but upon Fitrah. He is made a Jew, a Christian, or a Magian by his parents. As a beast produces a whole beast; do you perceive any defect in it?) Then Abu Huraira, may Allah be pleased with him, says: Read if you wish (The fitrah of Allah upon which He has created [all] people) (3). The Prophet, peace and blessings be upon him, did not say in the Hadith 'and they make him a Muslim', because Islam is in agreement with Fitrah.\" (4)\nTherefore, the Salaf, may Allah have mercy on them, did not engage much in proving the existence of God Almighty, nor did they amass evidences to establish it, because it is one of the accepted issues settled in human nature.\" (5)",
    "foot_note": "1. Majmu' al-Fatawa, Sheikh al-Islam Ibn Taymiyyah (6/386).\n2. Previous reference, (6/73).\n3. Narrated by Al-Bukhari in the Book of Funerals, Chapter on what was said regarding the children of polytheists, No. (1385), and narrated by Muslim in the Book of Destiny, Chapter: Every child is born upon Fitrah, No. (2658).\n4. Al-Aqidah fi Allah, Omar Suleiman Al-Ashqar, Dar Al-Nafais, 1419 AH, Jordan, (69-70).\n5. Al-Masa'il Al-Aqadiyyah Allati Haka Fiha Ibn Taymiyyah Al-Ijma', Khalid bin Masoud Al-Ju'aid and others, Dar Al-Huda Al-Nabawi; Dar Al-Fadilah, Egypt - Saudi Arabia, 1st Edition, 1428 AH, (239).",
    "book_id": "1136",
    "new_page_number": 14
  },
  {
    "serial_number": "5609",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "Second: The Indication of Sharia (Revelation)\nWhen looking at the legal evidences from the infallible revelation, we find that they indicate the existence of God Almighty through affirming His attributes, Glory be to Him, which indicate His life, self-subsistence, highness, knowledge, and other attributes pointing to His existence, Glory be to Him. Whether that is in the Book of God Almighty or in the Sunnah of His Prophet, peace be upon him. In the Book of God Almighty, He says, High and Exalted: {Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep... the verse} [Al-Baqarah: 255]. Al-Hafiz Ibn Kathir, may Allah have mercy on him, said: \"{THE EVER-LIVING, THE SUSTAINER} meaning the Living in Himself who never dies, the Sustainer of others.\" (1)\nAnd the Noble Prophet, peace and blessings be upon him, says, clarifying that God Almighty exists, and that He is the Creator of all creatures, including the heavens and the earth: (Allah was, and there was nothing before Him, and His Throne was on the water, then He created the heavens and the earth, and He wrote everything in the Reminder (Preserved Tablet)). (2) And in a narration: (Allah was, and there was nothing other than Him, and His Throne was on the water, and He wrote everything in the Reminder, and He created the heavens and the earth). (3)\nTherefore, the Salaf, may Allah have mercy on them, see that faith in God Almighty is only through faith in His existence, Lordship, Names, and Attributes, Glory be to Him. And that a servant is not a believer until he believes in the six pillars of faith; which are: Belief in Allah, His Angels, His Books, His Messengers, belief in the Last Day, and in Destiny, its good and its evil\" (4), \"and that faith in God Almighty is believing in what He said, commanded, obligated, and forbade; from everything the Messengers brought and the Books revealed\" (5).",
    "foot_note": "1. Tafsir al-Qur'an al-Azim, Al-Hafiz Ismail bin Kathir Al-Qurashi Al-Dimashqi, Dar Al-Fayha - Damascus - Dar Al-Salam - Riyadh, 1st Edition, 1414 AH, (1/413).\n2. Excerpts by Al-Bukhari, may Allah have mercy on him, in the Book of Tawhid (p. 403, vol. 13).\n3. Excerpts by Al-Bukhari, may Allah have mercy on him, in the Book of the Beginning of Creation (p. 286, vol. 6).\n4. Kitab al-Iman, Ibn Mandah, (1/124 - 128).\n5. Kitab al-I'tiqad, Muhammad bin Al-Qadi Abu Ya'la Al-Farra' Al-Hanbali, edited by: Dr. Muhammad bin Abdul Rahman Al-Khamis, Maktabat Al-Ma'arif, 5th Edition, 1426 AH, Riyadh, p. 24.",
    "book_id": "1136",
    "new_page_number": 15
  },
  {
    "serial_number": "5610",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "Third: The Indication of Reason for the Existence of God Almighty\nSound reason indicates the existence of God Almighty, and agrees with the texts of the Sharia in that. This is clearly evident in the following:\n1 - The Argument of Creation and Origination:\nIndeed, these creatures, the preceding and the succeeding ones, must have a Creator who originated them; for they cannot originate themselves by themselves, nor can they come into existence by chance. They cannot originate themselves by themselves because a thing does not create itself; because before its existence it was nothingness; so how can it be a creator?! And they cannot come into existence by chance; because every occurrence must have an originator, and because their existence on this marvelous, precise system, harmonious coordination, and cohesive link between causes and their effects, and between beings with one another, categorically prevents their existence from being by chance. If these creatures could not originate themselves by themselves, nor exist by chance, it is determined that they have an Originator; and He is Allah, Lord of the Worlds. Allah Almighty mentioned this rational evidence and definitive proof in Surah At-Tur; where He Almighty said: {Or were they created by nothing, or were they the creators [of themselves]?} [At-Tur: 35]; meaning they were not created without a creator, nor are they the ones who created themselves; so it is determined that their Creator is Allah, Blessed and Exalted. That is why when Jubayr bin Mut'im, may Allah be pleased with him, heard the Messenger of Allah, peace and blessings be upon him, reciting Surah At-Tur and reached these",
    "foot_note": "None",
    "book_id": "1136",
    "new_page_number": 16
  },
  {
    "serial_number": "5611",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "verses: {Or were they created by nothing, or were they the creators [of themselves]? * Or did they create the heavens and the earth? Rather, they are not certain. * Or have they the depositories [containing the provision] of your Lord? Or are they the controllers [of them]?} [At-Tur: 35-37], and Jubayr was a polytheist at that time, he said: (My heart almost flew, and that was the first time faith settled in my heart) (1). (2)\nSo God Almighty created the creatures, most importantly man, whom God Almighty originated from nothingness. God Almighty says clarifying that: {Does man not remember that We created him before, while he was nothing?} [Maryam: 67]. \"Using the creation of man as evidence for the Creator is of the utmost goodness and uprightness. It is a correct rational method, and it is legitimate (Shar'i); the Quran indicated it, guided people to it, clarified it, and directed towards it.\" (3)\nTherefore, the Holy Quran indicated the creation of creation and that God Almighty is their Creator in many verses; among them His Almighty's saying: {Indeed, your Lord is Allah, who created the heavens and earth in six days and then established Himself above the Throne. He covers the night with the day, [another night] chasing it rapidly; and [He created] the sun, the moon, and the stars, subjected by His command. Unquestionably, His is the creation and the command; blessed is Allah, Lord of the worlds.} [Al-A'raf: 54]. And His Almighty's saying: {Indeed, your Lord is Allah, who created the heavens and the earth in six days and then established Himself above the Throne, arranging the matter. There is no intercessor except after His permission. That is Allah, your Lord, so worship Him. Then will you not remember?} [Yunus: 3]. And He, Glory be to Him, says clarifying that He is the Creator and whatever else is created, and since He is the Creator, Glory be to Him, of everything, then He exists, Glory be to Him: {Allah is the Creator of all things, and He is, over all things, Disposer of affairs. To Him belong the keys of the heavens and the earth. And they who disbelieve in the verses of Allah - it is those who are the losers.} [Az-Zumar: 62-63].",
    "foot_note": "1. Narrated by Al-Bukhari, Book of Interpretation of the Quran, Chapter on the interpretation of Surah (By the Mount), Hadith No. (4375).\n2. Majmu' Fatawa wa Rasa'il Ibn Uthaymeen, (5/107).\n3. Al-Nubuwwat, Sheikh al-Islam Ibn Taymiyyah, edited by Dr. Abdul Aziz Al-Tuwayyan, Adwa' Al-Salaf, Riyadh, Kingdom of Saudi Arabia, 2nd Edition, 1420 AH, (1/292).",
    "book_id": "1136",
    "new_page_number": 17
  },
  {
    "serial_number": "5612",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "2 - The Argument of Care and Perfection:\nGod's care for His servants by sending messengers is proof of His existence, Glory be to Him. For what the messengers brought of God's laws, comprising all that benefits creation, indicates that the One who sent them with it is a Merciful, Wise Lord, especially this Glorious Quran which incapacitated humans and jinn from bringing the like of it. (1) God Almighty says clarifying His sending of messengers to His servants: {Indeed, We have sent you with the truth as a bringer of good tidings and a warner. And there was no nation but that there had passed within it a warner.} [Fatir: 24]. Ibn Kathir, may Allah have mercy on him, said: \"And no nation has passed from the sons of Adam except that God sent warners to them, and removed excuses from them.\" (2)\nThere is no doubt that looking at and pondering over the heavens and the earth and the creatures between them, and the miraculous action, precise management, care, and perfection therein; clearly indicates the existence of the Creating, Wise Lord; who perfected everything He created. God Almighty says clarifying this perfection: {It is not allowable for the sun to reach the moon, nor does the night overtake the day, but each, in an orbit, is swimming.} [Ya-Sin: 40]. Many verses have been reported pointing to this meaning; among them His Almighty's saying: {Have We not made the earth a resting place? And the mountains as stakes? And We created you in pairs.} [An-Naba: 6-8], and His Almighty's saying: {Blessed is He who has placed in the sky great stars and placed therein a [burning] lamp and luminous moon.} [Al-Furqan: 61] and His Almighty's saying: {Then do they not look at the camels - how they are created? And at the sky - how it is raised? And at the mountains - how they are erected? And at the earth - how it is spread out?} [Al-Ghashiyah: 17-20]. \"These verses indicate the encouragement to reflect on God's creatures which indicate His Tawhid (Unity), Glory be to Him. If His Unity is established, acknowledgment of His existence, Glory be to Him, follows inevitably.\" (3)",
    "foot_note": "1. Sharh Al-Aqidah Al-Wasitiyyah, Muhammad Al-Uthaymeen, Dar Ibn Al-Jawzi, 6th Edition, 1421 AH, Dammam (32-33).\n2. Tafsir Al-Qur'an Al-Azim, Ismail bin Kathir Al-Dimashqi, Dar Al-Fayha - Damascus, Dar Al-Salam - Riyadh, 1st Edition, 1414 AH, (3/729).\n3. Taysir Al-Karim Al-Rahman fi Tafsir Kalam Al-Mannan, Abdul Rahman bin Nasser Al-Sa'di, edited by: Abdul Rahman bin Mu'alla Al-Luwaihiq, 1st Edition, 1421 AH, Mu'assasat Al-Risalah, Beirut, (906, 922).",
    "book_id": "1136",
    "new_page_number": 18
  },
  {
    "serial_number": "5613",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "Fourth: The Indication of Sense (Hiss) for the Existence of God Almighty\nSense indicates the existence of God, for a human calls upon God Almighty, saying: O Lord! And asks for something, then it is answered for him. This is a sensory indication. He himself called upon no one but God, and God answered him; he saw that with his own eyes. Similarly, we hear about those who preceded and those in our era, that God answered them. The Bedouin who entered while the Messenger, peace be upon him, was addressing the people on Friday said: Livestock are dying and the roads are cut off; so pray to God to give us rain. Anas said: By God, there was not a cloud or a trace of cloud in the sky, and between us and Sala' (a mountain in Medina from whose direction clouds come) there was no house or building. immediately after the supplication of the Messenger, peace be upon him, a cloud like a shield appeared, rose in the sky, spread, thundered, flashed, and rain fell. The Messenger, peace be upon him, did not descend [from the pulpit] except that rain was dripping from his beard, peace and blessings be upon him. (1) This is a real event indicating the existence of the Creator with sensory evidence. In the Quran, there are many evidences for that, among them His Almighty's saying: {And [mention] Job, when he called to his Lord, \"Indeed, adversity has touched me, and you are the Most Merciful of the merciful.\" * So We responded to him...} the verse [Al-Anbiya: 83-84]. (2)\nAmong the sensory evidences for the existence of God Almighty is witnessing the miracles of the Prophets, for they indicate that their Sender exists, Glory be to Him and Exalted is He. In the Holy Quran, there is what supports the indication of miracles for proving the existence of the Creator, Glory be to Him, in the dialogue that took place between Moses, peace be upon him, and Pharaoh, the denier of the Lord of the Worlds, where God Almighty said: {Pharaoh said, \"And what is the Lord of the worlds?\" [Moses] said, \"The Lord of the heavens and earth and that between them, if you should be convinced.\" [Pharaoh] said to those around him, \"Do you not hear?\" [Moses] said, \"Your Lord and the Lord of your first forefathers.\" [Pharaoh] said, \"Indeed, your 'messenger' who has been sent to you is mad.\" [Moses] said, \"Lord of the east and the west and that between them, if you were to reason.\" [Pharaoh] said, \"If you take a god other than me, I will surely place you among those imprisoned.\" [Moses] said, \"Even if I brought you something manifest?\" [Pharaoh] said, \"Then bring it,",
    "foot_note": "1. Narrated by Al-Bukhari No. (933), and Muslim No. (897).\n2. Sharh Al-Aqidah Al-Wasitiyyah, Muhammad bin Saleh Al-Uthaymeen, Dar Ibn Al-Jawzi, 2nd Edition, 1415 AH Dammam, (1/56).",
    "book_id": "1136",
    "new_page_number": 19
  },
  {
    "serial_number": "5614",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "if you should be of the truthful.\" So he threw his staff, and suddenly it was a serpent manifest. And he drew out his hand; thereupon it was white [with radiance] for the observers.} [Ash-Shu'ara: 23-33]. These verses show that Pharaoh denied the Almighty Lord, and that Moses, peace be upon him, established the proof against him which is considered evidence of the truthfulness of being a messenger from the Lord of the Worlds. The signs are the hand and the staff, and there are other signs which are: shortage of crops, years of drought, the flood, locusts, lice, frogs, and blood. They are nine clear signs (1). As for the miracles of Jesus, peace be upon him, they were numerous, clarified by God's saying: {And [make him] a messenger to the Children of Israel, [who will say], 'Indeed I have come to you with a sign from your Lord in that I design for you from clay [that which is] like the form of a bird, then I breathe into it and it becomes a bird by permission of Allah. And I cure the blind and the leper, and I give life to the dead - by permission of Allah. And I inform you of what you eat and what you store in your houses. Indeed in that is a sign for you, if you are believers.} [Al Imran: 49] (2). As for the miracles of the Noble Prophet Muhammad, peace be upon him, they are many; but the greatest of them is the miracle of the Holy Quran. This is because it is a miracle remaining through time, speaking of his prophethood, peace and blessings be upon him, in every time and place, while all other miracles with which God supported all His other prophets have ended and gone and became history mentioned. Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, said: \"As for those who followed the path of wisdom, they also have paths; such as saying: Indeed God Almighty, if He sends a messenger, commands people to believe and obey him, so He must set up for them evidence indicating his truthfulness. For sending a messenger without a sign and a proof letting those sent to know that he is a messenger: is ugliness, and foolishness in explicit minds, and is a deficiency in all natural dispositions.\" (3)",
    "foot_note": "1. Al-Rusul wa Al-Risalat, Omar bin Suleiman Al-Ashqar, Maktabat Al-Falah, 1st Edition, Kuwait, 1401 AH (128).\n2. Al-Rusul wa Al-Risalat, Al-Ashqar, (130).\n3. Al-Nubuwwat, Ibn Taymiyyah, (2/889).",
    "book_id": "1136",
    "new_page_number": 20
  },
  {
    "serial_number": "5615",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "Topic Two: The Impact of Doubt in the Existence of God Almighty on the Muslim's Belief\nBelief in God Almighty is one of the pillars of faith, and belief in God includes belief in His existence, Glory be to Him; which is one of the matters of the unseen that must be believed in. Whoever denies anything of the unseen matters is outside of Islam. For among the pillars of faith is: Belief in God Almighty by knowing Him and being certain of His existence and believing in His Lordship, Names, and Attributes (1). The Salaf, may Allah have mercy on them, see that faith is speech by the tongue, belief by the heart, and action by the limbs. They say: It is speech, action, and knowledge, meaning: belief and intention (2). Doubt in the existence of God Almighty is contrary to sound natural dispositions as previously mentioned; but given its alarming spread in recent years in Islamic countries (3), it was necessary to clarify its impact on the Muslim's belief. For doubt in the existence of God Almighty is in reality doubt in His Lordship, Glory be to Him. Whoever doubts that there is no Lord, Creator, Owner, and Controller in this universe has fallen into disbelief (Kufr). And whoever denies the Lordship of God Almighty will deny His Divinity (Uluhiyyah) a fortiori; since a human cannot worship something non-existent. Given that doubt in God's Lordship leads to disbelief; because it relates to the belief that a Muslim must hold (4); I will clarify in this section the ruling on doubt in the existence of God Almighty, and what results from doubt in His existence, Glory be to Him, as follows:",
    "foot_note": "1. I'tiqad Ahl al-Sunnah wal-Jama'ah, Imam Adi bin Musafir (467 - 558 AH), edited by: Ahmad Farid Al-Mazid, printed with Kitab Usul al-Sunnah by Imam Ahmad, Dar al-Kutub al-Ilmiyyah, 1427 AH, Beirut, p. (283).\n2. Sharh Usul I'tiqad Ahl al-Sunnah wal-Jama'ah, Hibatullah bin Al-Hasan Al-Lalaka'i, Dar Ibn Hazm, 1st Edition, 1426 AH, Beirut, (2/95), (4/403 - 415), Kitab I'tiqad Ahl al-Sunnah, Al-Isma'ili, p. (43), Kitab al-Iman, Abu Bakr Abdullah bin Muhammad bin Abi Shaybah, edited by: Nasir al-Din al-Albani, Al-Maktab al-Islami, 2nd Edition, 1403 AH, Beirut, p. (50).\n3. Al-Mawsu'ah Al-Muyassarah fi Al-Adyan wa Al-Madhahib wa Al-Ahzab Al-Mu'asirah, Mane' bin Hammad Al-Juhani, 5th Edition, 1424 AH, Dar Al-Nadwah Al-Alamiyyah, Riyadh (2/803 - 804).\n4. Al-I'tiqad 'ala Madhhab al-Salaf Ahl al-Sunnah wal-Jama'ah, Al-Hafiz Abu Bakr Ahmad bin Al-Hasan Al-Bayhaqi, Dar al-Kutub al-Ilmiyyah, 2nd Edition, 1406 AH, Lebanon, p. (95), Kitab al-Iman, Al-Hafiz Muhammad bin Ishaq bin Yahya bin Mandah, edited by: Prof. Ali bin Muhammad Al-Faqihi, Dar Al-Fadilah, 4th Edition, 1421 AH, Riyadh, (1/123), Kitab I'tiqad Ahl al-Sunnah, Al-Hafiz Abu Bakr Ahmad bin Ibrahim Al-Isma'ili (277 - 371), 1st Edition, Dar Al-Minhaj, 1430 AH, Riyadh, p. (35).",
    "book_id": "1136",
    "new_page_number": 21
  },
  {
    "serial_number": "5616",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "First: Ruling on Doubt in the Existence of God Almighty\nTo clarify the ruling on doubt in the existence of God Almighty, it is necessary to state the belief of the Salaf regarding the ruling of one who doubts the existence of God Almighty, and to clarify the refutation of those who used the doubt of prophets as proof, and that doubt in the existence of God Almighty leads to disbelief, as follows:\n1 - The Belief of the Salaf Regarding the Ruling of One Who Doubts the Existence of God Almighty\nThe Salaf, may Allah have mercy on them, believe that God Almighty exists; and that He is the Lord of servants, their Creator, and their Originator from nothingness, and that He is the Creator of everything (1), and that God Almighty is established above His Throne, separate from His creation, encompasses everything in knowledge, there is nothing like unto Him, and He is the Hearing, the Seeing (2). That is why the Salaf, may Allah have mercy on them, say: \"Affirming God Almighty is affirming existence, not affirming modality (Kayfiyyah)\" (3). The Salaf believe that faith in God Almighty is one of the six pillars of faith due to the saying of the Prophet, peace be upon him, in the famous Hadith of Gabriel: (Faith is to believe in Allah, His angels, His books, His messengers, the Last Day, and to believe in Destiny, its good and its evil) (4). Based on that, the first pillar of faith is belief in God Almighty, and belief in God Almighty includes belief in the following (5):",
    "foot_note": "1. Al-I'tiqad 'ala Madhhab al-Salaf, Al-Bayhaqi, p. (8 - 10), Bayan al-Ma'ani fi Sharh Muqaddimah Abi Zayd al-Qayrawani, Saleh bin Fawzan Al-Fawzan, Dar Ibn Al-Jawzi, 1st Edition, 1435 AH, Dammam, p. (50).\n2. Usul al-Sunnah wa I'tiqad al-Din, Imam Abdul Rahman bin Hatim Al-Razi, (d. 327 AH), edited by: Ahmad Farid, printed with Kitab Usul al-Sunnah by Imam Ahmad, Dar al-Kutub al-Ilmiyyah, 1427 AH, Beirut, p. (133).\n3. Jawab Abi Bakr Al-Khatib Al-Baghdadi 'an Su'al Ba'd Ahl Dimashq fi Al-Sifat, printed as an appendix to Kitab I'tiqad Ahl al-Sunnah by Al-Isma'ili, review: Hammad Al-Ansari, 2nd Edition, Dar Al-Minhaj, 1430 AH, Riyadh, p. (72).\n4. Narrated by Muslim, Book of Faith, Chapter on explaining Faith, Islam, and Ihsan No. (8).\n5. Sharh Usul al-Iman, Muhammad bin Saleh Al-Uthaymeen, Dar Al-Watan, 1st Edition, 1410 AH, Riyadh, p. 15 - 23.",
    "book_id": "1136",
    "new_page_number": 22
  },
  {
    "serial_number": "5617",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "A - Belief in His existence, meaning: that He exists, Glory be to Him and Exalted is He.\nB - Belief in His Lordship, meaning: that He, Glory be to Him, is the Lord, with no partner and no helper.\nC - Belief in His Divinity, meaning: that He is the True God with no partner.\nD - Belief in His Names and Attributes, meaning: affirming what God Almighty affirmed in His Book, or what His Messenger, peace be upon him, affirmed in his Sunnah of names and attributes in a manner befitting Him; without distortion (Tahrif), negation (Ta'til), asking how (Takyif), or likening (Tamthil).\nAs for doubt in the existence of God Almighty, the Salaf consider it disbelief in God Almighty, which they call 'Kufr al-Shakk' (Disbelief of Doubt), (1) which is hesitation, and lack of certainty in the truthfulness of the messengers. It is also called 'Kufr al-Zann' (Disbelief of Conjecture), and it is the opposite of resoluteness (Jazm)",
    "foot_note": "1. Scholars divided disbelief into several categories under which many forms and types of polytheism fall, which are: 1) Disbelief of Denial (Juhud) and Rejection (Takdhib): This disbelief is sometimes rejection by the heart - and sometimes rejection by the tongue or limbs by concealing the truth and not submitting to it outwardly while knowing it and recognizing it inwardly, like the disbelief of the Jews in Muhammad, peace be upon him. God Almighty said about them: (And when there came to them that which they recognized, they disbelieved in it) [Al-Baqarah: 89] And He, Glory be to Him, also said: (And indeed, a party of them conceal the truth while they know [it]) (Al-Baqarah: 146). That is because rejection is not realized except from one who knew the truth and rejected it. That is why God negated that the disbelievers' rejection of the Messenger, peace be upon him, was in reality and inwardly, but rather by the tongue only; He said: (For they do not deny you, but the wrongdoers deny the verses of Allah) Al-An'am/33. And He said about Pharaoh and his people: (And they rejected them, while their inner selves were convinced thereof, out of injustice and haughtiness) [An-Naml/14]. Attached to this disbelief is the disbelief of permissible-making (Istihlal), so whoever deems lawful what he knows from the Sharia is forbidden has rejected the Messenger, peace be upon him, in what he brought, and likewise whoever forbids what he knows from the Sharia is lawful. [(A'lam al-Sunnah al-Manshurah 177) and (Nawaqid al-Iman al-Qawliyyah wa al-Amaliyyah, Abdul Aziz Al-Abdul Latif (36 – 46), Dawabit al-Takfir, Abdullah Al-Qarni (183 – 196)] 2) Disbelief of Turning Away (I'rad) and Arrogance (Istikbar): Like the disbelief of Iblis, for God Almighty says about him: (Except for Iblis. He refused and was arrogant and became of the disbelievers) [Al-Baqarah/34]. And as He said: (They say, \"We have believed in Allah and in the Messenger, and we obey\"; then a party of them turns away after that. And those are not believers) An-Nur/47. So He negated faith from those who turned away from action, even if they brought the speech. So it became clear that the disbelief of turning away is: abandoning the truth, not learning it and not acting upon it, whether by speech, action, or belief. The Almighty says: (But those who disbelieve turn away from what they were warned of) [Al-Ahqaf/3]. So whoever turns away from what the Messenger, peace be upon him, brought by speech, like one who says I do not follow him, or by action, like one who turns away and flees from hearing the truth he brought or puts his fingers in his ears so as not to hear, or hears it but turns away with his heart from believing in it, and with his limbs from acting, has disbelieved with the disbelief of turning away. 3) Disbelief of Hypocrisy (Nifaq): It is what is without the belief of the heart and its action, with outward submission to show off to people, like the disbelief of Ibn Salul and other hypocrites about whom God Almighty said: (And of the people are some who say, \"We believe in Allah and the Last Day,\" but they are not believers. They [think to] deceive Allah and those who believe, but they deceive not except themselves and perceive [it] not... etc. verses) Al-Baqarah/8–20. 4) Disbelief of Doubt (Shakk) and Suspicion (Raybah): It is hesitation in following the truth or hesitation in it being the truth, because what is required is certainty that what the Messenger brought is truth with no doubt in it. So whoever allows for the possibility that what he brought is not truth has disbelieved; the disbelief of doubt or conjecture, as He said: (And he entered his garden while he was unjust to himself. He said, \"I do not think that this will perish - ever. And I do not think the Hour will occur. And even if I should be brought back to my Lord, I will surely find better than this as a return.\" His companion said to him while he was conversing with him, \"Have you disbelieved in He who created you from dust and then from a sperm-drop and then proportioned you [as] a man? But as for me, He is Allah, my Lord, and I do not associate with my Lord anyone.\") [Al-Kahf: 35 - 38].",
    "book_id": "1136",
    "new_page_number": 23
  },
  {
    "serial_number": "5618",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "and certainty. The Salaf might express it as 'Niyyah' (Intention); Ibn Mandah, may Allah have mercy on him (1), said: \"Mentioning the obligation of Niyyah for Islam and faith in God alone with no partner\" (2). The evidence for the disbelief of doubt is His Almighty's saying: {And he entered his garden while he was unjust to himself. He said, \"I do not think that this will perish - ever. And I do not think the Hour will occur. And even if I should be brought back to my Lord, I will surely find better than this as a return.\" His companion said to him while he was conversing with him, \"Have you disbelieved in He who created you from dust and then from a sperm-drop and then proportioned you [as] a man? But as for me, He is Allah, my Lord, and I do not associate with my Lord anyone.\"} [Al-Kahf: 35 - 38]. Ibn Jarir al-Tabari, may Allah have mercy on him, said: \"{WHILE HE WAS UNJUST TO HIMSELF} and his injustice to himself is: his disbelief in the Resurrection, his doubt in the establishment of the Hour, and his forgetting the return to God Almighty, so he obligated upon it thereby God's wrath and painful punishment. And his saying: {HE SAID, \"I DO NOT THINK THAT THIS WILL PERISH - EVER\"} He says, Exalted be His praise: He said when he viewed his garden, and saw what was in it of trees, fruits, crops, and flowing rivers, doubting the return to God: I do not think this garden will ever perish, nor cease to exist nor be ruined, and I do not think the Hour which God promised His creation the gathering therein",
    "foot_note": "1. He is the Imam, the Hafiz Abu Abdullah Muhammad bin Ishaq bin Yahya bin Mandah. He was born in the year 310 or 311 AH in Isfahan. He grew up in a scholarly environment, for his father and grandfather were Imams. He traveled seeking knowledge to Nishapur, Iraq, Medina, and others. He died in the year 395 AH. (Introduction to Kitab al-Iman, Ibn Mandah, previous reference, (1/22 - 51).\n2. Kitab al-Iman, Ibn Mandah, (1/154).",
    "book_id": "1136",
    "new_page_number": 24
  },
  {
    "serial_number": "5619",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "will be established and occur. Then he wished another wish based on doubt from him, saying: (AND EVEN IF I SHOULD BE BROUGHT BACK TO MY LORD) returned to Him, while he is not certain that he is returning to Him\" (1). Among the clear evidences also for the disbelief of one who doubts the existence of God Almighty is the saying of God, Glory be to Him and Exalted is He: {Their messengers said, \"Can there be doubt about Allah, Creator of the heavens and earth? He invites you that He may forgive you of your sins, and He delays your death for a specified term.\"} [Ibrahim: 10]. Ibn Kathir said: \"Can there be doubt about Allah? This implies two things; first: Is there doubt about His existence? Indeed, natural dispositions testify to His existence, and are naturally inclined to acknowledge Him. For acknowledgment of Him is necessary in sound natural dispositions. However, doubt and confusion may occur to some of them, so they need to look into the evidence leading to His existence; that is why the messengers said to them, guiding them to the way of knowing Him, that He is the (Creator of the heavens and earth) who created and originated them without a preceding example. The evidences of occurrence, creation, and subjugation are apparent upon them, so they must have a Maker, who is Allah, there is no god but He, the Creator of everything, its God and its Owner. The second meaning in their saying: (Can there be doubt about Allah) is: Is there doubt about His divinity and His singleness in the obligation of worship to Him, while He is the Creator of all existents, and none deserves worship except Him, alone with no partner; for most nations acknowledged the Maker, but worshipped others with Him as intermediaries they thought would benefit them or bring them near to Allah\" (2). The Salaf, may Allah have mercy on them, do not differentiate between one who doubts in God, or in the Angels, or in the Messengers, or in the Resurrection, or in Paradise, or in Hell, or in anything that reached him from the news of God and the news of His Messenger, peace be upon him: so they say he is a disbeliever. They use as evidence for that what Abu Huraira narrated, from the Prophet, peace be upon him, who said: (I testify that there is no god but Allah, and that I am the Messenger of Allah. No servant meets Allah with them, not doubting",
    "foot_note": "1. Jami' al-Bayan 'an Ta'wil Ay al-Qur'an, Muhammad bin Jarir al-Tabari, edited by: Ahmad Abdul Razzaq Al-Bakri and others, Dar Al-Salam, 1st Edition, 1425 AH, Cairo (7/5350).\n2. Tafsir al-Qur'an al-Azim, Ibn Kathir, (2/691).",
    "book_id": "1136",
    "new_page_number": 25
  },
  {
    "serial_number": "5620",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "in them, except that he enters Paradise (1). And what is established in the two Sahihs that the Prophet, peace be upon him, said: (It has been revealed to me: that you will be tested in your graves. It will be said: What is your knowledge of this man? As for the believer or the certain one, he will say: He is Muhammad, the Messenger of Allah, he brought us clear proofs and guidance, so we responded and followed. He is Muhammad - three times. So it will be said: Sleep righteously, we knew that you were certain of him. As for the hypocrite or the doubtful one, he will say: I do not know, I heard people saying something so I said it) (2). So the cause of disbelief here is doubt. The first Hadith indicated that among the conditions of 'La ilaha illa Allah' is certainty which negates doubt (3). As for the second Hadith, it indicates the believer's certainty in testifying that Muhammad is the Messenger of Allah, as it is said to him: (We knew that you were certain of him), while the hypocrite is doubtful and confused; that is why he says: (I heard people saying something so I said it). Also indicating this is the Hadith of Abu Huraira, may Allah be pleased with him, that the Prophet, peace be upon him, said about the dead person: (And the evil man is made to sit in his grave, frightened and terrified. It is said to him: In what were you? He says: I do not know. It is said to him: Who is this man? He says: I heard people saying a saying, so I said it... until he, peace be upon him, said: It is said to him: This is your seat. Upon doubt you were, and upon it you died, and upon it you will be resurrected, if Allah Almighty wills). (4)\nAmong the evidences also for the disbelief of one who doubts God Almighty, is the lack of certainty in what came in the Book of God Almighty, for that is belying the Holy Quran which is the speech of God Almighty, and whoever belies God Almighty, there is no doubt in his disbelief. (5) And the Prophet, peace be upon him, is the conveyer from his Lord Almighty, so whoever doubts his",
    "foot_note": "1. Narrated by Muslim in the Book of Faith, Chapter: Whoever meets Allah with faith, not doubting in it, enters Paradise and is forbidden from the Fire (27).\n2. Narrated by Al-Bukhari in the Book of Knowledge, Chapter: Whoever answers a Fatwa with a sign of the hand and head, Hadith No. (86), and narrated by Muslim in the Book of Mosques and Places of Prayer, Chapter: The desirability of seeking refuge from the punishment of the grave, Hadith No. (963).\n3. Scholars mentioned that 'La ilaha illa Allah' has seven conditions which are: (Knowledge – Certainty – Sincerity – Truthfulness – Love – Submission – Acceptance). (Ma'arij al-Qabul bi Sharh Sullam al-Wusul ila Ilm al-Usul, Hafiz bin Ahmad Hakami, 3rd Edition, Dar Ibn Al-Qayyim, 1415 AH, Dammam, 1/32).\n4. Narrated by Ibn Majah (4268) and authenticated by Al-Albani in \"Sahih Ibn Majah\".\n5. Sharh al-Sunnah, Hasan bin Ali bin Khalaf Al-Barbahari, 1st Edition, Dar Al-Athar, 1429 AH, Cairo, p. (455).",
    "book_id": "1136",
    "new_page_number": 26
  },
  {
    "serial_number": "5621",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "truthfulness; he is a denier of him. Judge Iyad, may Allah have mercy on him, said after mentioning some acts of disbelief: \"And likewise whoever attributes to our Prophet, peace be upon him, intentional lying in what he conveyed and informed of, or doubted his truthfulness, or insulted him, he is a disbeliever by consensus\" (1). Therefore, the Salaf, may Allah have mercy on them, see that whoever says: 'There is no god but Allah' does not enter Paradise unless he says it without doubting it, but rather being certain and believing with his heart. (2) Doubt in the existence of God from a Muslim is apostasy from Islam, for \"apostasy can be by speech, action, or belief. So whoever believes in the non-existence of God Almighty or doubts that, he is an apostate outside of Islam\" (3).\n2 - The Answer of the Salaf to Those Who Argued with the Doubt of Prophets\nIn the foregoing, the belief of the Salaf regarding the ruling of one who doubts the existence of God Almighty became clear. Given that there are those who argue with what happened to some prophets of doubt as God Almighty mentioned about them like Abraham, Lot, and Joseph, peace be upon them (4), this argument is not correct and is refuted and not considered. That is because all prophets have been purified by God Almighty in His Holy Book in many verses; among them His saying: {Those were the ones upon whom Allah bestowed favor from among the prophets of the descendants of Adam and of those We carried with Noah, and of the descendants of Abraham and Israel, and of those whom We guided and chose. When the verses of the Most Merciful were recited to them, they fell in prostration and weeping.} [Maryam: 58]. As for the saying of Abraham, peace be upon him, as God Almighty informed about him: {And [mention] when Abraham said, \"My Lord, show me how You give life to the dead.\" [Allah] said, \"Have you not believed?\" He said, \"Yes, but [I ask] only that my heart may be satisfied.\"} [Al-Baqarah: 260]. Scholars mentioned",
    "foot_note": "1. Al-Shifa, Judge Iyad, (2/608).\n2. Kitab al-Iman, Ibn Mandah, (1/212 - 227).\n3. Al-Udhr bi al-Jahl Taht al-Mijhar al-Shar'i, Midhat bin Al-Hasan Al-Farraj, Maktabat Al-Rushd, 6th Edition, 1428 AH, Riyadh, p. (206).\n4. Kitab al-Iman, Ibn Mandah, previous reference (1/488 - 489).",
    "book_id": "1136",
    "new_page_number": 27
  },
  {
    "serial_number": "5622",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "that this is from the whispers that come to a human while his heart is reassured with faith, and that does not affect certainty. Based on this, Ibn Mandah, may Allah have mercy on him, titled a chapter in the Book of Faith saying: Mention of the degrees of prophets in whispers alongside certainty. Ibn Hajar, may Allah have mercy on him, said: \"The Salaf differed regarding the intended meaning of doubt here. Some took it on its apparent meaning and said: That was before Prophethood. Al-Tabari also carried it on its apparent meaning and made its cause the occurrence of the devil's whisper, but it did not settle nor shake the firm faith. From Ibn Abbas, may Allah be pleased with them both, he said: The most hopeful verse in the Quran is this verse 'And when Abraham said, My Lord, show me how You give life to the dead' the verse. Ibn Abbas said: This is regarding what occurs in the chests and what the devil whispers. So Allah was pleased with Abraham, peace be upon him, for saying: Yes. Others went to interpreting that, saying 'When God took Abraham as a friend (Khalil), the Angel of Death asked His permission to give him glad tidings, so He permitted him.' He mentioned a story with him about how the soul of the disbeliever and the believer is taken. He said 'So Abraham stood calling his Lord: My Lord, show me how You give life to the dead so that I know I am Your friend.' In a narration he said 'So that my heart is satisfied with the friendship (Khullah).' From Sa'id bin Jubayr he said: So that my heart is satisfied that I am Your friend. From Ibn Abbas 'So that I know You answered my supplication.' Then they differed on the meaning of his saying, peace be upon him: We are more entitled to doubt. Some said: Its meaning is we are more longing to see that than Abraham. It was said its meaning is if we do not doubt then Abraham is more worthy not to doubt, meaning if doubt were to occur to prophets I would be more entitled to it than them, and you have known that I did not doubt so know that he did not doubt. He only said that out of humility from him, or before God taught him that he is better than Abraham. It was said: Its meaning is this which you see as doubt, I am more entitled to it because it is not doubt, rather it is a request for more clarification. And for him: (He said, Have you not believed) the interrogation is for affirmation, and its aspect is that he requested the 'how' (modality) which implies believing in the giving of life. His saying: (Yes, but [I ask] only that my heart may be satisfied) meaning to increase in tranquility by viewing added to the heart's belief, because",
    "foot_note": "None",
    "book_id": "1136",
    "new_page_number": 28
  },
  {
    "serial_number": "5623",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "reinforcing evidences brings more stillness to hearts. It is as if he said I am a believer, but for witnessing there is a subtle meaning. Iyad said: Abraham did not doubt that God gives life to the dead, but he wanted tranquility of the heart and leaving contention by witnessing the giving of life. So he obtained the first knowledge of its occurrence, and wanted the second knowledge of its modality and witnessing it. It is possible that he asked for an increase in certainty even if there was no doubt in the first place, because knowledges may vary in their strength, so he wanted to ascend from the knowledge of certainty (Ilm al-Yaqin) to the eye of certainty (Ain al-Yaqin), and God knows best.\" (1).\nAs for what was said about the doubt of Lot, peace be upon him, in the power of God Almighty; Ibn Hajar, may Allah have mercy on him, said refuting that: \"His saying: (May God forgive Lot, indeed he was seeking refuge in a strong pillar) (2) meaning in God Almighty. He, peace be upon him, refers to his saying: 'If only I had against you some power or could take refuge in a strong pillar.' It is said that the people of Lot did not include anyone who gathered with him in lineage because they were from Sodom which is in the Levant, and the origin of Abraham and Lot was from Iraq. So when Abraham emigrated to the Levant, Lot emigrated with him. So God sent Lot to the people of Sodom. He said: If I had protection, relatives, and a clan, I would have sought their help against you to defend my guests\" (3). He, may Allah have mercy on him, said: \"And for him: (Had I stayed in prison as long as Joseph stayed, I would have answered the caller) (4) meaning I would have hastened to answer in leaving the prison, and when I came out I would request exoneration. So he described him with intense patience as he did not hasten to leave. He, peace be upon him, only said it out of humility, and humility does not lower the rank of the great but increases him in elevation and majesty. It was said it is of the same type as his saying 'Do not favor me over Jonah', and it was said he said it before knowing he is the best of all.\" (5)",
    "foot_note": "1. Fath al-Bari, Ibn Hajar, (6/498 - 500).\n2. Narrated by Al-Bukhari in the Book of Stories of the Prophets, Chapter: And Lot when he said to his people, Hadith No. (33375) [Note: Correct number is likely 3375 or similar range].\n3. Fath al-Bari, Ibn Hajar, (6/503 - 504).\n4. Narrated by Al-Bukhari, Book of Prophets, Chapter: And inform them about the guests of Abraham, No. (3372) and narrated by Muslim in the Book of Virtues in the Chapter on the virtues of Abraham the Friend, peace be upon him, Hadith No. (2369).\n5. Fath al-Bari, Ibn Hajar (6/500).",
    "book_id": "1136",
    "new_page_number": 29
  },
  {
    "serial_number": "5624",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Impact of Doubt and Whispers Regarding the Existence of God Almighty on the Muslim's Belief - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "Second: What Results from Doubt in the Existence of God Almighty\nIt has become clear to us from the foregoing that whoever doubts the existence of God Almighty has disbelieved in God and exited Islam. Consequently, he is judged as an apostate, and what applies to apostasy in terms of rulings applies to this. This can be clarified as follows:\n1 - He is asked to repent if he manifests what indicates that; if he repents [he is left alone], otherwise he is killed: For the apostate is not killed until he is asked to repent for three days. This is the saying of the majority of scholars; because apostasy is usually due to a doubt, and it does not disappear immediately, so it is obligatory to wait a period for him to reconsider, and the most appropriate is three days\" (1). The authentic Sunnah has indicated the obligation of killing the apostate. Ibn Abbas, may Allah be pleased with them both, said: The Messenger of Allah, peace be upon him, said: (Whoever changes his religion, kill him) (2). And Abdullah bin Masoud said: The Messenger of Allah, peace be upon him, said: (The blood of a Muslim man who testifies that there is no god but Allah and that I am the Messenger of Allah is not lawful except in one of three cases: a life for a life, the married adulterer, and the one who abandons his religion and separates from the community) (3).\n2 - The nullification of his deeds due to his apostasy: Due to the saying of God Almighty: {And whoever of you reverts from his religion [to disbelief] and dies while he is a disbeliever - for those, their deeds have become worthless in this world and the Hereafter, and those are the companions of the Fire, they will abide therein eternally} [Al-Baqarah: 217]. (4)",
    "foot_note": "1. Al-Mughni, Ibn Qudamah (9/18). Ahkam al-Murtadd fi al-Shari'ah al-Islamiyyah, Dr. Nu'man Abdul Razzaq Al-Samarra'i, Dar Al-Ulum, 2nd Edition, 1303 AH, Riyadh, (164 - 171).\n2. Narrated by Al-Bukhari No. (6922).\n3. Narrated by Al-Bukhari No. (6484), and Muslim No. (1676).\n4. Ahkam al-Riddah, Al-Samarra'i, (265).",
    "book_id": "1136",
    "new_page_number": 30
  },
  {
    "serial_number": "5625",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "3 - His exit from Islam, based on the saying of Allah Almighty: {O you who have believed, whoever of you should revert from his religion - Allah will bring forth [in place of them] a people He will love and who will love Him [who are] humble toward the believers, powerful against the disbelievers; they strive in the cause of Allah and do not fear the blame of a critic. That is the favor of Allah; He bestows it upon whom He wills. And Allah is all-Encompassing and Knowing. * Your ally is none but Allah and [therefore] His Messenger and those who have believed - those who establish prayer and give zakah, and they bow [in worship]. * And whoever is an ally of Allah and His Messenger and those who have believed - indeed, the party of Allah - they will be the predominant.} [Al-Ma'idah: 54 - 56]. (1) Exiting Islam here refers to apostasy, as mentioned previously. Al-Hafiz Ibn Kathir, may Allah have mercy on him, said: \"His saying here: (O you who have believed, whoever of you should revert from his religion) means: turns back from the truth to falsehood.\" (2) 4 - His marriage is annulled, and a separation is made between him and his wife. (3) This is indicated by the saying of Allah Almighty: {And do not marry polytheistic men [to your women] until they believe. And a believing slave is better than a polytheist, even though he might please you.} [Al-Baqarah: 221]. This is general with no specification, whether he is an original disbeliever or an apostate from Islam. (4) 5 - He is not washed, nor shrouded; he does not inherit, nor is he inherited from; he is not prayed over, and he is not buried in Muslim cemeteries. (5) Based on the saying of Allah Almighty: {And whoever of you reverts from his religion [to disbelief] and dies while he is a disbeliever - for those, their deeds have become worthless in this world and the Hereafter, and those are the companions of the Fire, they will abide therein eternally} [Al-Baqarah: 217]. The nullification of deeds here is due to the loss of the condition of Islam and the apostate's persistence in his apostasy. (6) 6 - He is prevented from disposing of his wealth during the period of his call to repentance. If he embraces Islam, it belongs to him; otherwise, it becomes property of the Treasury (Bayt al-Mal) from the time of his execution or his death upon apostasy. It was also said: From the time of his apostasy, it is spent on the interests of the Muslims. (7)",
    "foot_note": "1. Ahkam al-Riddah, al-Samarrai, (61). \n2. Tafsir al-Quran al-Azim, Ibn Kathir, 2/97. \n3. Ahkam al-Riddah, al-Samarrai (217). \n4. Tayseer al-Karim al-Mannan, Ibn Sa'di, (99). \n5. Ahkam al-Riddah, al-Samarrai, (233). \n6. Tayseer al-Karim al-Mannan, Ibn Sa'di, (97). \n7. Ahkam al-Riddah, al-Samarrai, (198).",
    "book_id": "1136",
    "new_page_number": 31
  },
  {
    "serial_number": "5626",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whisperings on the Belief in Allah Almighty – A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "Section Three: The Effect of Whisperings on the Belief in Allah Almighty on the Muslim’s Creed\n\nA Muslim may be subjected to whisperings regarding the existence of Allah Almighty, which can cause difficulty and distress. These whisperings pertain to Allah, and the following clarifies their nature and ruling:\n\n1 - Whisperings about the Existence of Allah Almighty: There is a clear distinction between doubt and whispering. Doubt, as previously explained, is lack of certainty and cannot coexist with certainty. Whispering, however, is an intrusive matter despite certainty in the heart. Doubt occurs by human choice, whereas whisperings occur without choice. Shaykh al-Islam Ibn Taymiyyah (may Allah have mercy on him) said: 'There is a difference between doubt and whispering. Whispering is something that attacks the heart without the person’s choice. If the servant dislikes it and rejects it, this rejection is an explicit sign of faith.' \n\nThe Salaf believed that Allah created the devils; they whisper to humans intending to mislead and ensnare them, as Allah Almighty says: {Indeed, the devils inspire their allies to dispute with you, and if you obey them, indeed, you would be associators.} [Al-An'am: 121]. Allah allows them to target whom He wills and protects from their plots whom He wills. Allah also says: {And provoke whom you can with your voice, and drive them against them with your horses and your feet, and share with them in wealth and children, but Satan only promises them deceit. Indeed, My servants…}",
    "foot_note": "1. Majmoo‘ al-Fatawa (14/18) and see: Al-Diya’ al-Shariq, Sulaiman bin Suhayman, Abdul Salam bin Burjas Al Abdul Karim, Scientific Research and Ifta Administration, Fifth Edition, 1414 AH, (374).",
    "book_id": "1136",
    "new_page_number": 32
  },
  {
    "serial_number": "5627",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "authority over them. And sufficient is your Lord as Disposer of affairs} [Al-Isra: 65]. And He the Almighty said: {So when you recite the Qur'an, [first] seek refuge in Allah from Satan, the expelled [from His mercy]. * Indeed, there is for him no authority over those who have believed and rely upon their Lord. * His authority is only over those who take him as an ally and those who through him associate others with Allah} [Al-Nahl: 98, 100]. (1) Satan has been given the ability to reach the human heart, as in the authentic Hadith: (Indeed, Satan flows through the human being like the flowing of blood, and I feared that he might cast some evil into your hearts) or he said: (something) (2). The Quran described Satan, from whom refuge is sought, as {The one who whispers in the breasts of mankind} [Al-Nas: 5]. It is also authentically established that every human has a companion (Qarin) from the Jinn who commands him to do evil and urges him towards it. In the Quran: {(His [devil] companion will say, \"Our Lord, I did not make him transgress, but he [himself] was in extreme error.\"} [Qaf: 27]. One cannot be rid of this except by resorting to Allah: {Say, \"I seek refuge in the Lord of mankind, * The Sovereign of mankind. * The God of mankind, * From the evil of the retreating whisperer - * Who whispers [evil] into the breasts of mankind - * From among the jinn and mankind.\"} [Al-Nas: 1 - 6]. The devils of the Jinn play a major role in corrupting the natural disposition (Fitrah) and defiling it. It is proven in Sahih Muslim from Iyad bin Himar, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, gave a sermon one day, and part of what he said was: (Behold, my Lord commanded me to teach you what you have been ignorant of, which He taught me this day: 'Every property I have bestowed upon My servants is lawful. I created My servants Hunafa (inclined to true faith), all of them, but the devils came to them and turned them away from their religion, prohibited for them what I had made lawful for them, and commanded them to associate with Me that for which I have sent down no authority') (3) (4). Satan flows through the son of Adam like the flowing of blood in the veins; in Sahih Al-Bukhari and Muslim from Anas, he said: The Messenger of Allah, peace and blessings be upon him, said: (Indeed, Satan flows through the human being like the flowing of blood)",
    "foot_note": "1. Aqeedah al-Salaf wa Ashab al-Hadith, Al-Sabuni, p: (296). \n2. Narrated by Al-Bukhari in the Book of Judgments, Hadith No. (6750), and narrated by Muslim No. (2175). \n3. Narrated by Muslim No. (2765). \n4. Al-Aqeedah fi Allah, Al-Ashqar, (71).",
    "book_id": "1136",
    "new_page_number": 33
  },
  {
    "serial_number": "5628",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "(1). (2) This makes his danger more severe, to the point that he leads the Muslim to doubt his Creator, saying: 'Who created Allah?' In the two Sahihs, he said: The Messenger of Allah, peace and blessings be upon him, said: 'Satan comes to one of you and says, \"Who created such and such?\" until he says to him, \"Who created your Lord?\"' And in another narration: He said: (People will continue to question until it is said: 'Then who created Allah?') (3). Our Lord, Glory be to Him, informed us in His Book that Satan has footsteps; he is not satisfied and does not stop until he causes man to fall into disbelief. He, Glory be to Him, said: {O you who have believed, enter into Islam completely [and perfectly] and do not follow the footsteps of Satan. Indeed, he is to you a clear enemy} [Al-Baqarah: 208]. Ibn Jarir, may Allah have mercy on him, said: 'Work, O believers, by all the laws of Islam, and enter into believing in it by word and deed, and leave the ways of Satan and his tracks, do not follow them, for he is a clear enemy to you in his animosity.' (4) Just as Satan whispers, the self (Nafs) also whispers evil. The self is inclined to evil (Ammarah bis-Su') except for those upon whom my Lord has mercy, as Allah Almighty said in Surah Yusuf, peace be upon him: {Indeed, the soul is a persistent enjoiner of evil, except those upon which my Lord has mercy. Indeed, my Lord is Forgiving and Merciful} [Yusuf: 53]. Al-Sa'di, may Allah have mercy on him, said: '{Indeed, the soul is a persistent enjoiner of evil}, meaning: it frequently commands its owner to do evil, i.e., immorality and all sins, for it is the mount of Satan, and through it, he enters upon man. {Except those upon which my Lord has mercy}, so He saved him from his soul that enjoins evil, until his soul became reassured with its Lord, compliant to the caller of guidance, resistant to the caller of destruction. That is not from the soul itself, but from the bounty of Allah and His mercy upon His servant.' (5)",
    "foot_note": "1. Previously referenced, p: 24. \n2. Alam al-Jinn wa al-Shayatin, Umar Sulaiman Al-Ashqar, Maktabat Al-Falah, Kuwait, 2nd Edition, 1401 AH (22). \n3. Narrated by Al-Bukhari in the Book of Holding Fast to the Book and Sunnah, Chapter on What is Disliked of Excessive Questioning..., No. (6366), and narrated by Muslim in the Book of Faith, Chapter on Whispers in Faith..., No. (134). \n4. Jami' al-Bayan, Ibn Jarir al-Tabari, (2/ 1122). \n5. Tayseer al-Karim al-Mannan, Al-Sa'di, p: (400).",
    "book_id": "1136",
    "new_page_number": 34
  },
  {
    "serial_number": "5629",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "2 - The Effect of Whispers on the Muslim's Creed. Many Muslims may fear that whispers have an effect on the Muslim's creed. However, the scholars of the Salaf believe that whispers have no effect if the Muslim treats them, does not indulge in them, and does not commit acts because of them that are influenced by other factors that impugn his creed (1). The Messenger of Allah, peace and blessings be upon him, clarified to us the lack of effect of whispers on creed, saying: (Praise be to Allah who turned his [Satan's] plot into a whisper) (2). And he said: (So if it presents itself to anyone of you, let him desist) (3). From Abu Hurairah: \"So if it reaches him, let him seek refuge in Allah and let him desist.\" The first Hadith indicates that whispers are the act of Satan, whose nature is whispering. Therefore, Allah Almighty commanded us to seek refuge from him, saying in Surah Al-Nas: {Say, \"I seek refuge in the Lord of mankind, * The Sovereign of mankind. * The God of mankind} then He mentioned what refuge is sought from, saying: {From the evil of the retreating whisperer - * Who whispers [evil] into the breasts of mankind} [Al-Nas: 1 - 6]. The second Hadith indicates the command not to indulge [in the thoughts] so that it does not lead the person to prohibited matters. This indicates that whispers do not affect the creed as long as the heart is reassured with faith. Ibn al-Qayyim, may Allah have mercy on him, said: \"This whispering is a [sign of] strength for the living heart.\" (4) When the Companions, may Allah be pleased with them, complained to the Prophet, peace and blessings be upon him, about the whispers they found, saying: (We find in ourselves what one of us considers too grave to speak of), he said: 'Have you found that?' They said: 'Yes.' He said to them: 'That is explicit faith.') And in another narration: 'Pure",
    "foot_note": "1. Al-Sunnah, Ibn Abi Asim, (1/ 455 - 459). \n2. Narrated by Abu Dawood and Al-Nasa'i in 'Amal al-Yawm wa al-Laylah' No. (667)... Its chain is Hasan. Narrated by Al-Bukhari in his Sahih No. (3276) and Muslim No. (134). \n3. Narrated by Al-Bukhari, Book of Beginning of Creation..., No. (3102), and Muslim in Faith..., No. (136). \n4. Ighathat al-Lahfan, Ibn al-Qayyim, (10/ 10), Kitab al-Iman, Ibn Mandah, (1/ 471).",
    "book_id": "1136",
    "new_page_number": 35
  },
  {
    "serial_number": "5630",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "faith' (1). And in a narration: (We asked the Messenger of Allah, peace and blessings be upon him, about a man finding something [in his mind] such that he would prefer to fall from the sky and be snatched by birds than to speak of it. He said: That is pure faith, or explicit faith.) (2) Al-Nawawi, may Allah have mercy on him, said: \"(That is explicit faith, and pure faith) means that your regarding speaking of it as a grave matter is explicit faith. For regarding this as grave and the intense fear of it and of uttering it, let alone believing it, only belongs to one who has perfected faith in a realized manner, and from whom suspicion and doubts have been negated.\" (3) Ibn al-Qayyim, may Allah have mercy on him, said: \"This is an explicit proof of faith; rather, this is an act of the heart that has increased the servant's faith.\" (4) Al-Baydawi (5) said regarding his saying, peace and blessings be upon him: (That) is a reference to what their saying (considers too grave) indicates; meaning: your finding the corruption of those whispers to be grave, and your souls' refusal and aversion to uttering them, is explicit faith.\" (6) What also indicates that whispers have no effect according to Ahlus-Sunnah wal-Jama'ah, as long as the servant does not act or speak (7), is the saying of the Noble Prophet, peace and blessings be upon him: (Indeed, Allah has overlooked for my Ummah what their souls whisper to them, as long as they do not speak of it or act upon it) (8).",
    "foot_note": "1. Narrated by Muslim, Book of Faith... No. (132). \n2. Narrated by Muslim, Book of Faith... No. (132). \n3. Sharh Muslim, Al-Nawawi, (1/ 318). \n4. Zad al-Ma'ad, Ibn Qayyim al-Jawziyya... (3/ 19); Al-Iman..., Abu Ubaid al-Qasim bin Salam... (64). \n5. Judge Abdullah bin Umar Al-Baydawi... Shafi'i in Madhhab, Ash'ari in Creed... Died 685 AH... \n6. Tuhfat al-Abrar, Al-Baydawi, (137). \n7. Kitab al-Iman, Ibn Mandah, (1/ 475 - 477). \n8. Narrated by Al-Bukhari in Oaths and Vows... No. (6287) and Muslim in Faith... No. (127).",
    "book_id": "1136",
    "new_page_number": 36
  },
  {
    "serial_number": "5631",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "The Fourth Topic: Treating Doubt Regarding the Existence of Allah Almighty. The basic principle is that a Muslim should not expose himself to what makes him doubt his religion, whether by reading the works of disbelievers, or by those influenced by philosophers, or by the creed of the Mu'tazila and those who agreed with them in their call to prove the existence of Allah Almighty through doubt as previously mentioned, or by contemporary atheism and its propagators who target Muslims with it (1), or by what the Modernists (Asraniyoon) disseminate in their books and theses (2), or by what is displayed in various social media, to preserve his faith, so that his creed remains safe. The Messenger of Allah, peace and blessings be upon him, denounced",
    "foot_note": "1. Our Sheikh Dr. Ghalib Awaji, may Allah have mercy on him, said: \"As for the appearance of atheism in Muslim lands, it is due to many reasons, most importantly the state of dazzlement by the appearance of these material things at the hands of non-believers in Allah... And in any case, atheism has appeared in its new studied form as a substitute for all religions...\" [Contemporary Intellectual Doctrines..., Dr. Ghalib bin Ali Awaji... 2/ 1013 - 1014]. \n2. The Modernists (Asraniyoon), as they are called in our present time, denied the Unseen under the pretext of keeping up with the age... Dr. Hassan Hanafi says: A contemporary Muslim can deny the unseen aspect of religion and be a Muslim by his behavior... [The Modernists between Claims of Renewal and Fields of Westernization, Muhammad Hamid al-Nasir... p: (395)].",
    "book_id": "1136",
    "new_page_number": 37
  },
  {
    "serial_number": "5632",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "Umar, may Allah be pleased with him, when he found pages of the Torah in his hands, and he, peace and blessings be upon him, said: (Are you confused (1) about it, O Ibn al-Khattab? By the One in Whose Hand is my soul, I have brought it to you white and pure. Do not ask them about anything lest they tell you the truth and you belie it, or falsehood and you believe it. By the One in Whose Hand is my soul, if Moses, peace be upon him, were alive, he would have no choice but to follow me) (2). As for the treatment of doubt regarding the existence of Allah Almighty when it exists in a Muslim, it is through repentance to Allah Almighty, believing in Him, having complete certainty of His existence, and acknowledging that He is the Creator, the Provider, the Disposer of this universe. This is Tawhid al-Rububiyyah (Oneness of Lordship). The accountable person must not limit himself to this type of Tawhid; rather, Tawhid al-Uluhiyyah (Oneness of Worship) is also necessary, which is singling out Allah Almighty with worship. Sheikh Abd al-Rahman al-Sa'di, may Allah have mercy on him, says in his interpretation of the verse: {And if you are in doubt about what We have sent down upon Our Servant} [Al-Baqarah: 23]: \"Proof that the one for whom guidance from error is hoped is the confused doubter who has not known truth from error. This person, if the truth is clarified to him, is likely to follow it if he is sincere in seeking the truth. As for the stubborn one who knows the truth and leaves it, his return is not possible because he left the truth after it became clear to him... Likewise, the doubter who is not sincere in seeking the truth but is turning away, not striving in his search; this one is mostly not granted success.\" (3) Therefore, we find the Salaf view Doubt (Shakk) and Suspicion (Rayb) in creeds as having the same meaning. Some distinguish between them and see that Shakk is more specific than Rayb (4). Repentance from both is obligatory. Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, says: \"Rayb can be in the knowledge of the heart and the action of the heart, unlike Shakk, for it",
    "foot_note": "1. Al-Hasan said: (Mutahawwikun) means: confused/bewildered. Mentioned by Al-Bayhaqi... (1/ 132). \n2. Narrated by Ahmad (3/ 387), and classed as Hasan by Al-Albani... \n3. Tayseer al-Karim al-Rahman..., Al-Sa'di, (46). \n4. Al-Rayb and Al-Ribah: Doubt, suspicion, and accusation. Al-Qutaybi said: Al-Ribah and Al-Rayb mean Doubt... (Lisan al-Arab, 1/ 442).",
    "book_id": "1136",
    "new_page_number": 38
  },
  {
    "serial_number": "5633",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "is only in knowledge. That is why no one is described with certainty (Yaqin) except one whose heart is reassured in knowledge and action.\" (1) Thus, Shakk is more specific than Rayb, and the doubter is a disbeliever due to violating the condition of knowledge, which is the basis of the 'statement of the heart'.\" (2) Therefore, whoever repents from doubt, believes in the existence of Allah Almighty, and follows that with Tawhid of Allah Almighty in worship, Allah Almighty accepts his repentance. Qadi Iyad, may Allah have mercy on him, said: \"As for the one who fabricates lies against Him, Blessed and Exalted be He, by claiming divinity or messengership, or the one who denies that Allah is his Creator or Lord, or says 'I have no Lord', or the one who speaks irrational things regarding that while drunk or in a fit of insanity, there is no disagreement regarding the disbelief of the sayer and claimant of that, provided his mind is sound as we presented. However, his repentance is accepted according to the well-known opinion, his return benefits him, and it saves him from execution.\" (3) Scholars have clarified that whoever repents to Allah Almighty, Allah accepts his repentance even if his sin was Shirk (polytheism) with Allah Almighty. The door of repentance is open to everyone who disobeyed Allah if its conditions are met. The Almighty said: {And whoever does a wrong or wrongs himself but then seeks forgiveness of Allah will find Allah Forgiving and Merciful} [An-Nisa: 110]. And the Almighty said: {But whoever repents after his wrongdoing and reforms, indeed, Allah will turn to him in forgiveness. Indeed, Allah is Forgiving and Merciful} [Al-Ma'idah: 39]. Al-Sa'di, may Allah have mercy on him, said: \"He forgives the one who repents, so he abandons sins and corrects deeds and faults. That is because to Allah belongs the dominion of the heavens and the earth; He disposes therein as He wills of destined and legislative dispositions, forgiveness and punishment, according to what His wisdom and vast mercy require.\" (4)",
    "foot_note": "1. Majmoo' al-Fatawa 14/ 108, Kitab al-Iman, p: 268. \n2. Nawaqid al-Iman al-I'tiqadiyyah..., Muhammad bin Abdullah al-Wuhaibi... (2/ 73). \n3. Al-Shifa..., Qadi Iyad... (398). \n4. Tayseer al-Karim al-Mannan, Al-Sa'di, p: (254).",
    "book_id": "1136",
    "new_page_number": 39
  },
  {
    "serial_number": "5634",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "Scholars mentioned four conditions for repentance for any sin a Muslim commits, which are as follows (1): 1 - The repentance must be sincerely for Allah Almighty. 2 - He must desist from the sin. 3 - He must regret what has passed. 4 - He must resolve not to return to it in the future. 5 - If the matter relates to the rights of humans, whether their wealth, honor, or bodies, he must ask for forgiveness from the one who has a right over him, or restore the rights to their owners. Ibn al-Qayyim said: (Injustice before Allah Almighty on the Day of Resurrection has three registers (Dawawin): A register that Allah does not forgive anything from, which is Shirk (associating partners) with Him, for Allah does not forgive that partners be associated with Him. A register that Allah Almighty leaves nothing from, which is the injustice of servants to one another, for Allah Almighty exacts it all. And a register that Allah does not care about at all, which is the servant's injustice to himself between him and his Lord Almighty; this register is the lightest of registers and the fastest to be erased, for it is erased by repentance, seeking forgiveness, good deeds that wipe out sins, expiating calamities, and the like. Unlike the register of Shirk, which is not erased except by Tawhid (Monotheism), and the register of injustices [to others], which is not erased except by exiting from them to their owners and seeking their absolution) (2). The lightest of registers is erased by repentance and seeking forgiveness, and Allah Almighty forgives all sins without exception if the servant repents and returns.",
    "foot_note": "1. Riyad al-Salihin..., Al-Nawawi... p: (11). \n2. Al-Wabil al-Sayyib..., Ibn Qayyim al-Jawziyya... (1/ 24).",
    "book_id": "1136",
    "new_page_number": 40
  },
  {
    "serial_number": "5635",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "The Fifth Topic: Treating Whispers Regarding the Existence of Allah Almighty. Whispers present themselves to the Muslim at all times, especially in his creed. His soul whispers to him, or Satan whispers to him. Satan continues to whisper to man and tries to misguide him, as Allah Almighty said: {O you who have believed, do not follow the footsteps of Satan. And whoever follows the footsteps of Satan - indeed, he enjoins immorality and wrongdoing. And if not for the favor of Allah upon you and His mercy, not one of you would have been pure, ever, but Allah purifies whom He wills, and Allah is Hearing and Knowing} [Al-Nur: 21]. This indicates that Satan continues to try with the Muslim until he reaches the point of attempting to make him doubt the existence of Allah Almighty, in addition to the whispering of the soul that enjoins evil. This causes the Muslim distress and anxiety, especially in this grave matter, which calls for seeking a treatment for these whispers from which hardly anyone is safe. Whispers regarding the existence of Allah Almighty can be treated by doing the following things: 1 - Desisting and cutting off the whispering: \"For Allah Almighty has set a limit for thoughts and minds to end at, which they do not exceed. It is impossible, if you tried to exceed it, that you could, because it is impossible. Attempting the impossible",
    "foot_note": "None",
    "book_id": "1136",
    "new_page_number": 41
  },
  {
    "serial_number": "5636",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "is falsehood and foolishness. Among the most absurd of impossibilities is the infinite regress (Tasalsul) in influencers and actors, for created things have a beginning and an end. They may proceed in sequence in many of their affairs until they end at Allah who brought them into existence and brought into existence the attributes, materials, and elements within them. {And that to your Lord is the finality} [Al-Najm: 42]. So if minds reach Allah Almighty, they stop and end, for He is the First before whom there is nothing, and the Last after whom there is nothing. His Firstness, Exalted be He, has no beginning, no matter what is assumed\" (1). Similarly, if whispering occurs to him, let him cut it off, stop, and not indulge in it, due to the saying of the Prophet, peace and blessings be upon him: (So if it reaches him, let him seek refuge in Allah and let him desist). (2) Ibn Hajar said: \"'Let him seek refuge in Allah and let him desist' means let him stop thinking about that thought and seek refuge in Allah if the thinking does not leave him. The wisdom in this is that the knowledge of Allah Almighty's independence from everything whispered by Satan is a necessary matter that does not need argumentation and debate. If any of that occurs, it is from the whispering of Satan, which is endless. Whenever he is opposed with an argument, he finds another path of fallacy and continuation, so time is wasted. If one is safe from his trial, there is no stronger measure to repel him than resorting to Allah Almighty by seeking refuge in Him. (3) 2 - To repel it with the opposite faith in Allah and His Messengers. The Muslim should say: 'I believe in Allah', or say: 'Allah is One. Allah is the Eternal Refuge. He neither begets nor is born. Nor is there to Him any equivalent', due to the saying of the Noble Prophet, peace and blessings be upon him: 'Whoever finds any of that, let him say: (I believe in Allah)', and in a narration: (I believe in Allah and His Messengers) (4). And he, peace and blessings be upon him, said: 'If he says that,",
    "foot_note": "1. Bahjat Qulub al-Abrar..., Abd al-Rahman bin Nasir al-Sa'di... (18). \n2. Narrated by Al-Bukhari... No. (3102), Muslim... No. (136). \n3. Fath al-Bari..., Ibn Hajar al-Asqalani... (13/ 273). \n4. Narrated by Muslim... No. (134).",
    "book_id": "1136",
    "new_page_number": 42
  },
  {
    "serial_number": "5637",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "then say: Allah is One. Allah is the Eternal Refuge. He neither begets nor is born, nor is there to Him any equivalent) (1). For Allah Almighty and His noble messengers informed that He, the Exalted, is the First before whom there is nothing, and that He, the Exalted, is Unique in Oneness, and in creating and bringing into existence previous and subsequent beings. This correct, truthful, certain faith repels all doubts that contradict it, for truth repels falsehood, and doubts do not oppose certainty. (2) 3 - The Muslim should spit (dryly) to his left and seek refuge from Satan. Our Prophet, peace and blessings be upon him, informed us of this remedy, saying: (Then let him spit to his left three times and seek refuge from Satan). (3) His seeking refuge in Allah from Satan is because this is from his whispers and his casting into hearts to make people doubt faith in their Lord. So the servant, if he finds that, must seek refuge in Allah from him. Whoever seeks refuge in Allah with sincerity and strength, Allah grants him refuge, drives Satan away from him, and his false whispers vanish (4). And the Muslim should be reassured about his faith and not abandon deeds due to the presence of whispers, because they have no effect on faith as mentioned previously. Allah Almighty has commanded in His Noble Book to seek refuge in Him, Glory be to Him, from Satan, and clarified to His servants that he has no authority over the believers and that his authority is over those who take him as an ally. {So when you recite the Qur'an,",
    "foot_note": "1. Narrated by Abu Dawood... No. (4722), Al-Nasa'i... No. (10497), Authenticated by Al-Albani... No. (8182). \n2. Al-Sunnah, Ibn Abi Asim... (1/ 45-455), Bahjat Qulub al-Abrar, Al-Sa'di, (19). \n3. Narrated by Abu Dawood... No. (4722), Al-Nasa'i... No. (10497), Authenticated by Al-Albani... No. (8182). \n4. Bahjat Qulub al-Abrar, Al-Sa'di, (18).",
    "book_id": "1136",
    "new_page_number": 43
  },
  {
    "serial_number": "5638",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "seek refuge in Allah from Satan, the expelled [from His mercy] (98) Indeed, there is for him no authority over those who have believed and rely upon their Lord (99) His authority is only over those who take him as an ally and those who through him associate others with Allah} (Al-Nahl 98 - 100). Ibn Jarir, may Allah have mercy on him, said: \"He has no authority over those who believed and sought refuge in Allah from him as Allah Almighty recommended seeking refuge {and rely upon their Lord} against what presents itself to them of his footsteps and whispers\" (1).",
    "foot_note": "1. Jami' al-Bayan, Al-Tabari, (6/ 5052).",
    "book_id": "1136",
    "new_page_number": 44
  },
  {
    "serial_number": "5639",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "Results and Recommendations. Many results were reached in this study, and they can be clarified as follows: 1 - That Allah Almighty exists, He is the Ever-Living, the Sustainer of existence, and He, Glory be to Him, is the Creator of creation and their Originator from non-existence. This truth is indicated by sound natural disposition (Fitrah), the purified Law (Sharia), sound Reason, as well as Sense perception through witnessing great creations, miracles of Prophets, and answering the prayers of supplicants. 2 - That doubt regarding the existence of Allah Almighty is disbelief (Kufr) that expels one from Islam. The legal evidences from the Book of Allah Almighty and the Sunnah of His Prophet, peace and blessings be upon him, indicate that the Kufr of doubt applies to everyone who doubts the existence of Allah Almighty. Denying His existence, Exalted be He, is a denial of His Lordship, so whoever doubts that is a denier of the Messengers of Allah, peace be upon them. 3 - That if a Muslim doubts the existence of Allah Almighty, he has apostatized from the religion of Allah, and the rulings of apostasy apply to him; he is asked to repent, so if he repents [it is accepted], otherwise he is executed as an apostate. He exits Islam, his deeds are nullified, his marriage is annulled and he is separated from his wife, he is prevented from disposing of his wealth during the period of his call to repentance, and if he dies, he is not inherited from, nor washed, nor shrouded, nor prayed over, nor buried in Muslim cemeteries. 4 - That whispers regarding the existence of Allah Almighty come from the soul that enjoins evil, and from Satan who tries to misguide the Muslim and push him to doubt the existence of Allah Almighty. Therefore, seeking refuge from Satan and his whispers is prescribed. 5 - There is no effect of whispers on the Muslim's creed according to the Salaf, if the Muslim repels them and does not indulge in them. If he does that, it does not harm him, and that is explicit faith.",
    "foot_note": "None",
    "book_id": "1136",
    "new_page_number": 45
  },
  {
    "serial_number": "5640",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "6 - That it is obligatory for the Muslim to stay away from everything that raises doubts in his religion, whether by reading atheist books, or other magazines, or what is published in various media outlets that make him doubt his religion or shake his creed. 7 - That the cure for doubt regarding the existence of Allah Almighty is repentance from this doubt; this necessitates entering into Islam, believing in the existence of Allah Almighty, and testifying to His Oneness and to His Prophet, peace and blessings be upon him, with the Message. 8 - That the cure for whispers is by cutting them off, not indulging in them, and for the Muslim to say: 'I believe in Allah'; or say: 'I believe in Allah and His Messengers', or say: 'Allah is One. Allah is the Eternal Refuge. He neither begets nor is born. Nor is there to Him any equivalent', then spit to his left and seek refuge in Allah from Satan. 9 - I recommend my brothers among preachers and students of knowledge to publish and clarify the rulings related to doubt regarding the existence of Allah Almighty, so that it becomes clear to every Muslim, and so that Muslims are warned against the callers of misguidance who invite them to doubt the existence of Allah, and to clarify to them the danger of this matter and that it is disbelief in Allah Almighty, so they refrain from obeying them in this grave matter. 10 - I recommend my brothers among preachers and students of knowledge to clarify the ruling of whispers regarding the existence of Allah Almighty, with which many Muslims are afflicted, and that they do not affect their creed, so that their hearts are reassured, and so they do not abandon righteous deeds for fear of falling into Shirk, because they are Muslims, and whispers have no effect on their religion, while clarifying the importance of cutting off whispers and not indulging in them.",
    "foot_note": "None",
    "book_id": "1136",
    "new_page_number": 46
  },
  {
    "serial_number": "5641",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "References: 1 - Ahkam al-Murtad fi al-Shari'ah al-Islamiyyah (Rulings of the Apostate in Islamic Sharia), Dr. Nu'man Abd al-Razzaq al-Samarrai, Dar al-Ulum, 2nd Edition, 1303 AH, Riyadh. 2 - Usul al-Sunnah wa I'tiqad al-Din (Principles of Sunnah and Belief of Religion), Imam Abd al-Rahman bin Hatim al-Razi (d. 327 AH), Investigation: Ahmad Farid, printed with Kitab Usul al-Sunnah by Imam Ahmad, Dar al-Kutub al-Ilmiyyah, 1427 AH, Beirut. 3 - I'tiqad Ahl al-Sunnah wa al-Jama'ah (Creed of the People of Sunnah and the Community), Imam Adi bin Musafir (467 - 558 AH), Investigation: Ahmad Farid al-Mazid, printed with Kitab Usul al-Sunnah by Imam Ahmad, Dar al-Kutub al-Ilmiyyah, 1427 AH, Beirut. 4 - Al-I'tiqad 'ala Madhhab al-Salaf Ahl al-Sunnah wa al-Jama'ah (Belief according to the School of the Salaf, People of Sunnah and Community), Al-Hafiz Abu Bakr Ahmad bin Al-Hussein Al-Bayhaqi, Dar al-Kutub al-Ilmiyyah, 2nd Edition, 1406 AH, Lebanon. 5 - Ara' al-Mu'tazila al-Usuliyyah Dirasah wa Taqwiman (Fundamental Opinions of the Mu'tazila: A Study and Evaluation), Dr. Ali bin Saad bin Salih al-Duwaihi, Maktabat al-Rushd, 2nd Edition, 1417 AH, Riyadh. 6 - Al-Iman Ma'alimuhu wa Sunanuhu wa Istikmal Darajatihi (Faith: Its Landmarks, Sunan, and Completion of its Degrees), Abu Ubaid al-Qasim bin Salam, Investigation: Muhammad Nasir al-Din al-Albani, Dar al-Arqam, 2nd Edition, Kuwait. 7 - Bahjat Qulub al-Abrar wa Qurrat 'Uyun al-Akhyar fi Sharh Jawami' al-Akhbar (Joy of the Hearts of the Righteous... in Explaining Comprehensive Narrations), Abd al-Rahman bin Nasir al-Sa'di, 4th Edition, 1423 AH, Ministry of Islamic Affairs, Dawah and Guidance.",
    "foot_note": "None",
    "book_id": "1136",
    "new_page_number": 47
  },
  {
    "serial_number": "5642",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "8 - Bayan al-Ma'ani fi Sharh Muqaddimat Abi Zaid al-Qairawani (Clarification of Meanings in Explaining the Introduction of Abu Zaid al-Qairawani), Salih bin Fawzan al-Fawzan, Dar Ibn al-Jawzi, 1st Edition, 1435 AH, Dammam. 9 - Tajrid al-Tawhid al-Mufid (Abstracting the Useful Tawhid), Al-Allamah Ahmad bin Ali al-Maqrizi (766 - 845 AH), Printed and Published by the General Presidency for Scholarly Research and Ifta in Saudi Arabia, 2nd Edition, 1432 AH, Riyadh. 10 - Tuhfat al-Abrar Sharh Masabih al-Sunnah (Masterpiece of the Righteous: Explanation of Masabih al-Sunnah), Abdullah bin Umar al-Baydawi, Investigation: Prof. Dr. Muhammad bin Ishaq bin Muhammad Ibrahim, 1st Edition, 1420 AH, Riyadh. 11 - Tafsir al-Quran al-Azim (Interpretation of the Great Quran), Ismail bin Kathir al-Dimashqi, Dar al-Fayha - Damascus, Dar al-Salam - Riyadh, 1st Edition, 1414 AH. 12 - Tayseer al-Karim al-Rahman fi Tafsir Kalam al-Mannan (Facilitation of the Generous Merciful in Interpreting the Speech of the Benefactor), Abd al-Rahman bin Nasir al-Sa'di, Investigation: Abd al-Rahman bin Mu'alla al-Luwaihiq, 1st Edition, 1421 AH, Mu'assasat al-Risalah, Beirut. 13 - Jami' al-Bayan 'an Ta'wil Ay al-Quran (The Comprehensive Exposition on the Interpretation of the Verses of the Quran), Muhammad bin Jarir al-Tabari, Investigation: Ahmad Abd al-Razzaq al-Bakri and others, Dar al-Salam, 1st Edition, 1425 AH, Cairo. 14 - Al-Radd 'ala al-Mantiqiyyin (Refutation of the Logicians), Ibn Taymiyyah, Al-Tab'ah al-Qayyimah, Bombay, 1368 AH. 15 - Al-Rusul wa al-Risalat (The Messengers and the Messages), Umar bin Sulaiman al-Ashqar, Maktabat al-Falah, 1st Edition, Kuwait, 1401 AH. 16 - Riyad al-Salihin min Kalam Sayyid al-Mursalin (Gardens of the Righteous from the Words of the Master of Messengers), Muhyi al-Din Abu Zakariya al-Nawawi, Dar Maktabat al-Hayah, 1983 AH.",
    "foot_note": "None",
    "book_id": "1136",
    "new_page_number": 48
  },
  {
    "serial_number": "5643",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "17 - Zad al-Ma'ad fi Hady Khayr al-Ibad (Provisions for the Hereafter in the Guidance of the Best of Servants), Ibn Qayyim al-Jawziyya, Investigation: Shu'aib al-Arna'ut, Mu'assasat al-Risalah - Maktabat al-Manar al-Islamiyyah, Kuwait, 3rd Edition, 1402 AH. 18 - Al-Sunnah, Abu Bakr Ahmad bin Amr bin Abi Asim, Investigation: Prof. Dr. Basim Faisal al-Jawabrah, Dar al-Sumay'i, 2nd Edition, 1426 AH, Riyadh. 19 - Sharh Usul I'tiqad Ahl al-Sunnah wa al-Jama'ah (Explanation of the Principles of Belief of the People of Sunnah and Community), Hibatullah bin Al-Hasan al-Lalaka'i, Dar Ibn Hazm, 1st Edition, 1426 AH, Beirut. 20 - Sharh al-Aqeedah al-Wasitiyyah (Explanation of the Wasiti Creed), Muhammad al-Uthaimin, Dar Ibn al-Jawzi, 6th Edition, 1421 AH, Dammam. 21 - Sharh al-Aqeedah al-Wasitiyyah, Muhammad bin Salih al-Uthaimin, Dar Ibn al-Jawzi, 2nd Edition, 1415 AH, Dammam. 22 - Sharh al-Nawawi 'ala Muslim (Al-Nawawi's Explanation of Muslim), Yahya bin Sharaf Abu Zakariya al-Nawawi, Dar al-Khair, 1416 AH. 23 - Al-Shifa bi Ta'rif Huquq al-Mustafa (The Healing by Defining the Rights of the Chosen One), Qadi Iyad al-Yahsubi, Al-Maktabah al-Asriyyah, (No Date), 1428 AH, Beirut. 24 - Al-Shakk Asbabuhu wa Atharuhu wa 'Ilaj al-Islam lahu (Doubt: Its Causes, Effects, and Islam's Treatment for It), Master's Thesis by researcher Ahmad bin Ibrahim Asiri, Umm Al-Qura University, College of Dawah and Usul al-Din, Department of Creed. 25 - Sahih al-Jami' al-Saghir wa Ziyadatuhu (The Authentic Small Collection and its Additions), Muhammad Nasir al-Din al-Albani, Investigation: Zuhair al-Shawish, Al-Maktab al-Islami, Beirut, 3rd Edition, 1408 AH. 26 - Al-Diya' al-Shariq (The Shining Light), Sulaiman bin Sahman, Abd al-Salam bin Barjas Al Abd al-Karim, Presidency of Scholarly Research and Ifta, 5th Edition, 1414 AH.",
    "foot_note": "None",
    "book_id": "1136",
    "new_page_number": 49
  },
  {
    "serial_number": "5644",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "27 - Alam al-Jinn wa al-Shayatin (The World of Jinn and Devils), Umar bin Sulaiman al-Ashqar, Maktabat al-Falah, Kuwait, 2nd Edition, 1401 AH. 28 - Al-Asraniyyun bayna Maza'im al-Tajdid wa Mayadin al-Taghrib (The Modernists between Claims of Renewal and Fields of Westernization), Muhammad Hamid al-Nasir, Maktabat al-Kawthar, 2nd Edition, 1422 AH. 29 - Al-Aqeedah al-Islamiyyah wa Juhud Ulama' al-Salaf fi Taqririhah... (Islamic Creed and Efforts of Salaf Scholars in Establishing It... until the end of the Umayyad Era), Atallah Bakhit Hammad al-Ma'ayta, Dar al-Afaq al-Fikriyyah, 1st Edition, 1422 AH, Egypt. 30 - Al-Aqeedah fi Allah (Belief in Allah), Umar bin Sulaiman al-Ashqar, Dar al-Nafa'is, 2nd Edition, 1419 AH, Jordan. 31 - Aqeedah al-Salaf wa Ashab al-Hadith (Creed of the Salaf and People of Hadith), Ismail bin Abd al-Rahman al-Sabuni, Investigation: Dr. Nasir bin Abd al-Rahman al-Jadi', Dar al-Asimah, 2nd Edition, 1419 AH, Riyadh. 32 - Al-Awasim min al-Qawasim fi al-Dhabb 'an Sunnah Abi al-Qasim (Defenses against Calamities in Defending the Sunnah of Abu al-Qasim), Muhammad bin Ibrahim bin al-Wazir al-Yamani, Investigation: Shu'aib al-Arna'ut, Mu'assasat al-Risalah, 2nd Edition, Beirut. 33 - Fath al-Bari Sharh Sahih al-Bukhari, Ahmad bin Ali bin Hajar al-Asqalani, Dar al-Salam, 1st Edition, 1421 AH, Riyadh. 34 - Firaq Mu'asirah Tantasib lil-Islam... (Contemporary Sects Attributing Themselves to Islam and Islam's Stance on Them), Dr. Ghalib bin Ali Awaji, Al-Maktabah al-Asriyyah al-Dhahabiyyah, 5th Edition, 1426 AH, Jeddah. 35 - Al-Qamus al-Muhit, Muhammad bin Yaqub al-Fairuzabadi, Dar al-Kutub al-Ilmiyyah, 2nd Edition, 1428 AH, Beirut.",
    "foot_note": "None",
    "book_id": "1136",
    "new_page_number": 50
  },
  {
    "serial_number": "5645",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "36 - Kitab al-I'tiqad (Book of Belief), Muhammad bin Al-Qadi Abu Ya'la al-Farra' al-Hanbali, Investigation: Dr. Muhammad bin Abd al-Rahman al-Khamis, Maktabat al-Ma'arif, 5th Edition, 1426 AH, Riyadh. 37 - Kitab I'tiqad Ahl al-Sunnah (Book of Belief of People of Sunnah), Al-Hafiz Abu Bakr Ahmad bin Ibrahim al-Isma'ili (277 - 371), 1st Edition, Dar al-Minhaj, 1430 AH, Riyadh. 38 - Kitab al-Iman (Book of Faith), Abu Bakr Abdullah bin Muhammad bin Abi Shaybah, Investigation: Nasir al-Din al-Albani, Al-Maktab al-Islami, 2nd Edition, 1403 AH, Beirut. 39 - Kitab al-Iman, Al-Hafiz Muhammad bin Ishaq bin Yahya bin Mandah, Investigation: Prof. Dr. Ali bin Muhammad al-Faqihi, Dar al-Fadilah, 4th Edition, 1421 AH, Riyadh. 40 - Kitab al-Ta'rifat (Book of Definitions), Ali bin Muhammad bin Ali al-Jurjani, Investigation Ibrahim, Dar al-Kitab al-Arabi, 4th Edition, 1418 AH, Beirut. 41 - Lisan al-Arab, Abu al-Fadl Jamal al-Din Ibn Manzur, Dar Sadir, Beirut. 42 - Mu'jam Maqayis al-Lughah, Investigation: Abd al-Salam Harun, Dar al-Kutub al-Ilmiyyah. 43 - Al-Mu'jam al-Wasit, Arabic Language Academy in Egypt, Dar Ihya' al-Turath al-Islami. 44 - Majmoo' Fatawa Shaykh al-Islam Ibn Taymiyyah, Ahmad bin Abd al-Halim Ibn Taymiyyah, Investigation: Abd al-Rahman bin Muhammad bin Qasim, 1st Edition, 1398 AH. 45 - Mukhtar al-Sihah, Muhammad bin Abi Bakr bin Abd al-Qadir al-Razi, 11th Edition, 1426 AH, Mu'assasat al-Risalah, Beirut, Lebanon. 46 - Al-Madhahib al-Fikriyyah al-Mu'asirah... (Contemporary Intellectual Doctrines...), Dr. Ghalib bin Ali Awaji, Al-Maktabah al-Asriyyah al-Dhahabiyyah, 1st Edition, 1327 AH, Jeddah.",
    "foot_note": "None",
    "book_id": "1136",
    "new_page_number": 51
  },
  {
    "serial_number": "5646",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Effect of Doubt and Whispers Regarding the Existence of Allah Almighty on the Muslim's Creed - A Doctrinal Study",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "47 - Al-Masa'il al-Aqdiyah allati Haka fiha Ibn Taymiyyah al-Ijma' (Doctrinal Issues in which Ibn Taymiyyah Narrated Consensus), Khalid bin Masoud al-Ju'aid and others, Dar al-Fadilah - Saudi Arabia, 1st Edition, 1428 AH, Riyadh. 48 - Al-Misbah al-Munir, Ahmad al-Maghribi, Dar al-Kutub al-Ilmiyyah edition, (No Date). 49 - Ma'arij al-Qabul bi Sharh Sullam al-Wusul... (Ascent of Acceptance in Explaining the Ladder of Arrival...), Hafiz bin Ahmad Hakami, 3rd Edition, Dar Ibn al-Qayyim, 1415 AH, Dammam. 50 - Al-Mawsu'ah al-Muyassarah fi al-Adyan wa al-Madhahib wa al-Ahzab al-Mu'asirah (The Simplified Encyclopedia of Contemporary Religions, Sects, and Parties), Mani' bin Hammad al-Juhani, 5th Edition, 1424 AH, Dar al-Nadwa al-Alamiyyah, Riyadh. 51 - Al-Nubuwwat (Prophethoods), Sheikh al-Islam Ibn Taymiyyah, Investigation Dr. Abd al-Aziz al-Tuwayan, Adwa' al-Salaf, Riyadh, Saudi Arabia, 2nd Edition, 1420 AH. 52 - Nawaqid al-Iman al-I'tiqadiyyah wa Dawabit al-Takfir 'inda al-Salaf (Doctrinal Nullifiers of Faith and Rules of Takfir according to the Salaf), Muhammad bin Abdullah al-Wuhaibi, Dar al-Muslim, 2nd Edition, 1426 AH, Riyadh. 53 - Al-Hady al-Nabawi (Prophetic Guidance); Dar al-Fadilah, Egypt - Saudi Arabia, 1st Edition. 54 - Al-Wabil al-Sayyib min al-Kalim al-Tayyib (The Pouring Rain of Good Words), Muhammad bin Abi Bakr Ibn Qayyim al-Jawziyya, Investigation: Sayyid Ibrahim, Dar al-Hadith - Cairo, 3rd Edition, 1999 AD. 55 - Al-Wajiz fi Aqeedah al-Salaf al-Salih Ahl al-Sunnah wa al-Jama'ah (The Concise [Book] on the Creed of the Righteous Salaf...), Abdullah bin Abd al-Hamid al-Athari, 3rd Edition, 1425 AH, Dar al-Rayah, Riyadh. 56 - Al-Waswasah fi al-Iman Haqiqatuha wa Asbabuha wa 'Ilajuha (Whispering in Faith: Its Reality, Causes, and Cure), Dr. Sarah bint Farraj bin Ali al-Uqla, Journal of Umm Al-Qura University for Sharia..., Safar 1424 AH. 57 - Al-Waswasah fi Allah Azza wa Jalla wa 'Ilajuha fi Daw' Aqeedah al-Salaf (Whispering regarding Allah Almighty and its Cure in Light of the Salaf's Creed), Dr. Abd al-Rahman bin Abdullah al-Turki, Journal of Sharia, Imam Muhammad bin Saud Islamic University, 5th Issue, Shawwal, 1433 AH.",
    "foot_note": "None",
    "book_id": "1136",
    "new_page_number": 52
  }
]