[
  {
    "text": "الحق والثبات في الأسماء والصفات\nالمؤلف: عبد العزيز العتيبي\nسنة الوفاة: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "الحق والثبات في الأسماء والصفات",
    "category_id": "1",
    "category": "العقيدة",
    "new_page_number": 1
  },
  {
    "text": "sn: 800\nbook_title: الحق والثبات في الأسماء والصفات\nbook_link: https://shamela.ws/book/225\nbook_id: 225\nauthor_name: عبد العزيز العتيبي\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/3161\nauthor_ID: 3161\neditor: Null\npublisher: دار الصميعي للنشر والتوزيع\nedition: الأولى، 1442 هـ - 2021 م\npages: 56\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: العقيدة\ncategory_id: 1",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "الحق والثبات في الأسماء والصفات",
    "category_id": "1",
    "category": "العقيدة",
    "new_page_number": 2
  },
  {
    "serial_number": "39656",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: العقيدة الكتاب : الحق والثبات في الأسماء والصفات إعداد : عبد العزيز العتيبي الناشر : دار الصميعي للنشر والتوزيع الطبعة : الأولى ، 1442 هـ - 2021 م عدد الصفحات : 56 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 15 جُمادَى الآخرة 1443\nالكتاب : الحق والثبات في الأسماء والصفات إعداد : عبد العزيز العتيبي الناشر : دار الصميعي للنشر والتوزيع الطبعة : الأولى ، 1442 هـ - 2021 م عدد الصفحات : 56 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 15 جُمادَى الآخرة 1443\nإعداد : عبد العزيز العتيبي الناشر : دار الصميعي للنشر والتوزيع الطبعة : الأولى ، 1442 هـ - 2021 م عدد الصفحات : 56 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 15 جُمادَى الآخرة 1443\nالناشر : دار الصميعي للنشر والتوزيع الطبعة : الأولى ، 1442 هـ - 2021 م عدد الصفحات : 56 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 15 جُمادَى الآخرة 1443\nالطبعة : الأولى ، 1442 هـ - 2021 م عدد الصفحات : 56 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 15 جُمادَى الآخرة 1443\nعدد الصفحات : 56 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 15 جُمادَى الآخرة 1443\n[ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 15 جُمادَى الآخرة 1443\nتاريخ النشر بالشاملة : 15 جُمادَى الآخرة 1443",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 3
  },
  {
    "serial_number": "39657",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 5,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرحيم  المقدمة بسم الله والحمد لله والصلاة والسلام على رسول الله وعلى صحبه أجمعين أما بعد: أقدم لكم هذا الكتاب عن أسماء الله وصفاته وقد سمَّيته \" الحق والثبات في الأسماء والصفات\" وهو كتاب مختصر لكي يسهل على الناس حفظه وفهم معانيه، ولا يخفى على أحد فضل العلم بأسماء الله وصفاته وأهميته في حياة المسلم فهو أشرف وأفضل العلوم التي يجب على المسلم معرفته لأن شرف العلم بشرف المعلوم وهو أحد أنواع التوحيد الثلاثة وهي: 1 - توحيد الربوبية ومعناه \" إفراد الله بأفعاله عَزَّوَجَلَّ كالخلق والملك والإحياء والإماتة والرزق ونحو ذلك\". وهذا النوع يُقِرُّ به جميع الخلق حتى الكفار ولكن لا ينفعهم وحده، بل لابد من الإيمان بأنواع التوحيد الثلاثة لكي يدخلوا في الإسلام كما قال تعالى مخبراً عن المشركين {وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمَاوَاتِ وَالأَرْضَ لَيَقُولُنَّ اللَّهُ قُلِ الْحَمْدُ لِلَّهِ بَلْ أَكْثَرُهُمْ لا يَعْلَمُونَ} [لقمان: 25].",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 4
  },
  {
    "serial_number": "39658",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 6,
    "volume_number": 1,
    "text": "إذاً لا ينفع المشركين توحيد الربوبية وحدة ما داموا لم يوحِّدُوا الله في ألوهيته \" عبادته\" وأسمائه وصفاته. 2 - توحيد الألوهية ومعناه \" إفراد الله بالعبادة مثل الصلاة والصوم والدعاء والنحر والاستغاثة والتوكُّل وغيرها من العبادات\" فمن صرف أي نوع من أنواع العبادة لغير الله فقد أشرك وحبط عمله، وتوحيد الألوهية متضمن لتوحيد الربوبية بمعنى أن من عَبَدَ الله وحْدَه لابد أن يكون قد وحَّدَهُ في ربوبيته، لأنه قد عبد الله لاعتقاده أنه هو الخالق والرازق والملك وحْدَه. وتوحيد الربوبية مستلزم لتوحيد الألوهية بمعنى أن من وحَّد الله في ربوبيته واعتقد أن الله هو الرب والخالق فإن هذا الاعتقاد وهذا التوحيد يوجب له أن يوحِّد الله في ألوهيته. وتوحيد الأسماء والصفات يشمل النوعين لأن من أسماء الله (الخالق والرازق والملك والرب) وهذا هو توحيد الربوبية، ومن أسمائه أيضاً (الله والغفور والتواب) وهذا هو توحيد الألوهية. 3 - توحيد الأسماء والصفات ومعناه \" إفراد الله بأسمائه الحسنى وصفاته العلى الواردة في القرآن والسنة من غير تمثيل ولا تشبيه ولا تحريف ولا تعطيل ولا تكييف\".",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 5
  },
  {
    "serial_number": "39659",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 7,
    "volume_number": 1,
    "text": "فربنا تبارك وتعالى واحد في ربوبيته وألوهيته وأسمائه وصفاته لا شريك له، ولقد ضلَّ كثير من الناس في هذا الباب ولم يهتدوا إلى الصواب، فالحمد لله الذي هدى أهل السُّنَّة والجماعة إلى معرفة أسمائه وصفاته على الوجه الصحيح. • • •",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 6
  },
  {
    "serial_number": "39660",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 8,
    "volume_number": 1,
    "text": "بعض قواعد الأسماء والصفات وليست جميعها * القاعدة الأولى: أسماء الله كلها حُسنى ومتضمنه لصفات كاملة كما قال تعالى: {وَلِلَّهِ الأَسْمَاء الْحُسْنَى فَادْعُوهُ بِهَا} [الأعراف: 180]. والحسنى \" جمع الأحسن\" أي أن فيها مبالغة في الحسن. * القاعدة الثانية: قال الشيخ ابن عثيمين في \"القواعد المثلى\": أسماء الله أعلام وأوصاف، أعلام باعتبار دلالتها على الذات وأوصاف باعتبار دلالتها على المعاني، وأما أسماء الناس فهي أعلام لأنها تدل على الذات فقط، فقد تجد من الناس من اسمه كريم وهو بخيل ومن اسمه عادل وهو ظالم، فأسماء الله سبحانه وتعالى وأسماء الرسول صلى الله عليه وسلم والقرآن الكريم واليوم الآخر متضمنه لأوصاف، فلا يوجد في أسماء الله أي اسم جامد \" لا يدل على معنى\" كالدَّهر مثلاً فهو ليس من أسماء الله، وقد ورد في الحديث القدسي أن النبي صلى الله عليه وسلم قال: قال الله عَزَّوَجَلَّ \" يؤذيني بن آدم يسب الدهر، وأنا الدهر بيدي الأمر، أقلِّب الليل والنهار\" رواه البخاري ومسلم. فالليل والنهار هما الدهر فكيف يكون المقلِّب بكسر اللام هو المقلَّب بفتحها \"انتهى من كلامه\".",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 7
  },
  {
    "serial_number": "39661",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 9,
    "volume_number": 1,
    "text": "قال الإمام النووي رحمه الله: \" لأن العرب كانت تسب الدهر عند النوازل والمصائب التي تصيبها، والذي يدبر الأمور ويفعل النوازل والحوادث هو الله وليس الدهر فمن سَبَّ فاعل النوازل وقع هذا السَّب على الله ولا يقع على الدهر لأنه مخلوق\" \" شرح مسلم\" (15/ 3). ومعلوم أن الدهر اسم للزمن والوقت. * القاعدة الثالثة: إحصاء أسماء الله من أسباب دخول الجنة لقول النبي عليه الصلاة والسلام: \" إن لله تسعةً وتسعين اسماً مائة إلا واحداً من أحصاها دخل الجنة\" رواه البخاري ومسلم. ومعنى كلمة إحصائها الواردة في الحديث يشمل: 1 - حفظها. 2 - معرفة معانيها. 3 - دعاء الله بها كقولنا \" يا الله - يا رحيم\". 4 - العمل بمقتضاها ومثال ذلك: إذا علمت أنه الأحد فلا تشرك معه غيره، وإذا علمت أنه الرحيم فاعمل الأعمال الصالحة التي تكون سبباً لرحمته لك لأن مقتضى الرحيم الرحمة.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 8
  },
  {
    "serial_number": "39662",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 10,
    "volume_number": 1,
    "text": "* القاعدة الرابعة: هناك أسماء خاصة بالله لا يجوز أن يَتَسَمَّى بها غيره مثل: (الله، الإله، الرحمن، الواحد، الأحد، الرب، الخالق، القُدُّوس، السُّبُّوح، البارئ، الصمد، الرازق، الأول، الآخر، الظاهر، الباطن، القاهر، المتكبر، الجبار) فكل اسم من هذه الأسماء لا يجوز لأحدٍ غير الله التسمي به حتى لو كان غير مُحَلَّى بـ \"ال\" وأما غير هذه الأسماء فإذا كان الاسم مُحَلَّى بأل فلا يجوز أن يُسَمَّى به غير الله وإذا كان غير مُحَلَّى بـ \"ال\" وقُصِدَت الصفة فلا يجوز وأيضاً إذا لوحظ فيه إثبات ما تَضَمَّنَهُ من صفة فلا يجوز، أمَّا إذا قُصِدَ الاسم المُجَرَّد ولم تُقْصَد الصفة ولم يلاحَظ فيه إثبات ما تَضَمَّنَهُ من صفه فيجوز التَّسَمِّي به. * القاعدة الخامسة: وهناك صفات خاصة بالله لا تُطْلَق على غيره مثل: (فَعَّال لما يريد) (يحيي) (يميت) وغيرها. * القاعدة الخامسة: الاشتراك بين الخالق والمخلوق في الاسم والمعنى لا يدل على الاشتراك في الحقيقة والكيفية: فإن من أسماء الله العليم والحي ولكن ليس علم الخالق كعلم",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 9
  },
  {
    "serial_number": "39663",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 11,
    "volume_number": 1,
    "text": "المخلوق وليست حياة الخالق كحياة المخلوق لأن الله له الكمال المطلق في أسمائه وصفاته بخلاف المخلوق فإن أسماءه وصفاته ناقصة، فإذا كان نفي التشبيه بين صفات المخلوقات بعضها ببعض أمر معلوم فنفي تشبيه صفات الخالق بصفات الخلق من باب أولى. * القاعدة السادسة: أسماء الله وصفاته توقيفية: \" يعني أن إثباتها متوقف على الأدلة الشرعية ولا مجال للعقل في إثباتها\" لأن العقل لا يمكنه إدراك ما يستحقه الله من أسماء وصفات، فما أثبته الشرع أثبتناه وما نفاه الشرع نفيناه وما سكت عنه سكتنا عنه \" القواعد المثلى لابن عثيمين\". * القاعدة السابعة: أهل السنة والجماعة يثبتون أسماء الله وصفاته من غير تكييف ولا تحريف ولا تعطيل ولا تمثيل ولا تشبيه \" تفسير ابن كثير سورة طه الآية 5\" أما التكييف فلأنه لا يعلم كيفية صفات الله إلا هو سبحانه فمن ادَّعى أنه يعلم كيف يجيء الله يوم القيامة أو كيف يستوي على عرشه فهو كاذب، وأمَّا التعطيل فمعناه نفي أو جحد ألفاظ أو معاني الأسماء والصفات وهو باطل فكيف ننفي اسم أو صفة قد ثبتت في الشرع لله",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 10
  },
  {
    "serial_number": "39664",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 12,
    "volume_number": 1,
    "text": "ولم يَنْفِها عنه الرسول صلى الله عليه وسلم وهو أعلم بأسماء الله وصفاته مِنَّا، وأمَّا التحريف فهو تغيير ألفاظ أو معاني الأسماء والصفات فهو باطل أيضاً وكذب على الله وتعريفه هو \" صرف اللفظ عن ظاهره المتبادر منه إلى غيره بغير دليل شرعي\" ومن أمثلة التحريف قول الجُهَّال أن المراد بيد الله نعمته وقدرته وأن الاستواء على العرش بمعنى الاستيلاء، وأمَّا التمثيل والتشبيه فالله سبحانه منزه عن مماثلة أو مشابهة المخلوقين لقوله عَزَّوَجَلَّ {لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ} [الشورى: 11] فنحن نثبت أنَّ لله وجه ولكن ليس كوجوه المخلوقات وله سمع لا يماثل ولا يشابه سمع المخلوقات فهو يسمع كل شيء سبحانه أما المخلوق فسمعه لا يُدرِك كل الأصوات، وصفات الله لها الكمال المطلق أما صفات المخلوق فهي ناقصة. * القاعدة الثامنة: يجب إثبات أدلة الأسماء والصفات على ظاهرها وحقيقتها ولا نصرفها عن الظاهر ولا نُحَرِّف معناها \" القواعد المثلى لابن عثيمين\"، ونعني بالظاهر أنه \" المتبادر من معنى الكلام إلى الذهن عند الإطلاق\" فلابد من إثبات اللفظ وإثبات معناه الذي",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 11
  },
  {
    "serial_number": "39665",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 13,
    "volume_number": 1,
    "text": "دل عليه ثم تفويض علم الكيفية إلى الله سبحانه، قال الشيخ بن عثيمين رحمه الله: اشْتُهِر عن السلف كمالك بن أنس ومكحول والزهري وسفيان الثوري والليث بن سعد والأوزاعي قول: \" أَمِرُّوها كما جاءت بلا كيف\" ففي قولهم \" أَمِرُّوها كما جاءت\" رد على المعطلة وفي قولهم \" بلا كيف\" رد على الممثلة ولو كانوا لا يعتقدون لها معنى لقالوا: (أمروا لفظها ولاتتعرضوا لمعناها) \" مجموع الفتاوى لابن عثيمين \" واستمع لقول ربنا تبارك وتعالى: {قُلْ إِنَّمَا حَرَّمَ رَبِّيَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَالإِثْمَ وَالْبَغْيَ بِغَيْرِ الْحَقِّ وَأَن تُشْرِكُواْ بِاللَّهِ مَا لَمْ يُنَزِّلْ بِهِ سُلْطَانًا وَأَن تَقُولُواْ عَلَى اللَّهِ مَا لَا تَعْلَمُونَ} [الأعراف: 33]. الشاهد قوله: {وَأَن تَقُولُواْ عَلَى اللَّهِ مَا لَا تَعْلَمُونَ} * القاعدة التاسعة: هناك أسماء ذُكِرَت مقرونه مع بعض في القرآن مثل: (العفو القدير) (العزيز الحكيم) (الغني الحميد) (السميع البصير) والفائدة من اقترانها أن كل اسم يتضمن صفة كمال فإذا جُمِعَت مع بعضها حصل كمال فوق كمال \" القواعد المثلى لابن عثيمين\". فمثلاً: (العفو القدير) فربنا يعفو عن قدرة وليس كعفو بعض",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 12
  },
  {
    "serial_number": "39666",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 14,
    "volume_number": 1,
    "text": "الناس الذي قد يكون من ضعف وأيضاً يقدر على العفو سبحانه. (العزيز الحكيم) فعزته لا تقتضي ظُلماً وجوراً لأنها مقرونه بِحِكْمَه وأيضاً حكمته لا يعتريها ذل. (الغني الحميد) أي أنه يُحمد من الخلق بعد أن يُنْعِم عليهم، فليس كل غني يجود وينعم. (السميع البصير) وكثيرٌ ما يُجمع بين هذين الاسمين في القرآن لأن السمع والبصر فيهما معنى الإحاطة والعلم بالخلق. * القاعدة العاشرة: هناك عدة فروق بين الأسماء والصفات: جاء في فتاوى اللجنة الدائمة للإفتاء (أسماء الله كل ما دل على ذات الله مع صفات الكمال القائمة به مثل السميع والعليم والحكيم فإن هذه الأسماء دلت على ذات الله وعلى ما قام بها من السمع والعلم والحكمة، أما الصفات فهي نعوت الكمال القائمة بالذات كالعلم والحكمة والسمع والبصر، فالاسم دل على أمرين، والصفة دلت على أمر واحد، ويقال: الاسم متضمن للصفة والصفة مستلزمة للاسم). وأيضاً يُشتق من الأسماء صفات ولا يُشتق من الصفات أسماء فنشتق من اسم الرحيم صفة الرحمة ونشتق من اسم العليم صفة العلم،",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 13
  },
  {
    "serial_number": "39667",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 15,
    "volume_number": 1,
    "text": "لكن لا نشتق من صفات المجيء والمكر أسماء الجائي والماكر. والأسماء والصفات مشْتَرِكَة في جواز الاستعاذة والحلف بها فيجوز الحلف بالاسم كقولنا (والله). وتجوز الاستعاذة به كقولنا (أعوذ بالله). ويجوز الحلف بالصفة كقولنا (وعزة الله). وتجوز الاستعاذة بها كقولنا (أعوذ بعزة الله). أما التعبُّد والدعاء فهي خاصة بالأسماء فنقول عبد الكريم ولا نقول عبد الكرم وهذا من التعبُّد وندعو بالاسم ولا ندعو بالصفة فنقول يا رحيم ولا نقول يا رحمة الله لأن الصفة لا تدل على الذات أما الاسم فهو يدل على الذات. * القاعدة الحادي عشر: تنقسم الصفات من حيث الكمال والنقص إلى: أولاً: صفات كمال لا نقص فيها وهذه نثبتها لله كما ثبتت في الشرع كالعلم والسمع والرحمة. ثانياً: صفات نقص وهذه لا يوصف بها الله تعالى أبداً كالنوم والظُّلم وغيرها.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 14
  },
  {
    "serial_number": "39668",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 16,
    "volume_number": 1,
    "text": "ثالثاً: صفات يمكن أن تكون كمال ويمكن أن تكون نقص على حسب الحال والسياق التي تذكر فيه فهذه لا يوصف بها الله مطلقاً ولا تنفى عنه مطلقاً. فنقول: في الحال التي تكون كمال يوصف بها الله وفي الحال التي تكون نقص لا يوصف بها، مثل المكر والمخادعة والكيد والمِحَال والاستهزاء والسخرية فهي صفات كمال إذا كان المقصود بها هم أعداء الله الذين بدأوا بها وتدل على أن الله يقدر على مكرهم وهزيمتهم، ولم تذكر هذه الصفات لله في القرآن مُطْلَقاً بل ذكرت مقيدة بالكفار والمنافقين، فنقول: إن من صفات الله عَزَّوَجَلَّ أنه يمكر بمن بدأ بمكر الإسلام والمسلمين ويخادع من بدأ بمخادعته، وهكذا قولنا في سائر الصفات المقيدة بالكفار والمنافقين، فالمكر في محله كمال والمخادعة في محلها كمال \" القواعد المثلى لابن عثيمين\" * القاعدة الثاني عشر: أسماء الله إن دلت على وصف متعدي تضمنت ثلاثة أمور: أولاً: ثبوت ذلك الاسم. ثانياً: ثبوت الصفة التي تضمَّنها هذا الاسم.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 15
  },
  {
    "serial_number": "39669",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 17,
    "volume_number": 1,
    "text": "ثالثاً: ثبوت حُكمها ومقتضاها. مثل السميع - نثبت اسم السّميع وصفه السمع ونثبت الحُكم والمُقْتَضَى \" أن الله يسمع كل الأصوات\". أما إذا دلت على وصف غير متعدي تضمنت أمرين فقط وهما: • ثبوت ذلك الاسم. • وثبوت الصفة التي تضمنها هذا الاسم. مثل الحي فهو يتضمن اسم الحي وصفة الحياة فقط. \" القواعد المثلى لابن عثيمين\". تنقسم صفات الله إلى أقسام باعتبارات مختلفة: القسم الأول: باعتبار الثبوت وعدمه وهي نوعان: ثبوتية: هي التي ثبتت في القرآن أو في الأحاديث الصحيحة كالحياة والعلم والاستواء على العرش فالواجب أن نثبتها على الوجه الذي يليق بالله سبحانه. سلبية (منفية): وهي التي نفاها الله عن نفسه أو نفاها النبي عليه الصلاة والسلام عن الله وهذه ننفيها ونثبت كمال ضدها، لأن النفي وحده ليس فيه كمال ومدح إلا إذا تضمن إثباتاً لكمال الضد ولا يمكن أن يَصِف الله نفسه إلا بالكمال فمثلا عندما تقول:",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 16
  },
  {
    "serial_number": "39670",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 18,
    "volume_number": 1,
    "text": "يا فلان أنت لست جبان ولست بخيل فهذا ليس فيه ثناء ومدح، ومثال ذلك ننفي الظلم عن الله ونثبت كمال العدل لقوله عَزَّوَجَلَّ: {وَلا يَظْلِمُ رَبُّكَ أَحَدًا} [الكهف: 49] وقوله سبحانه: {لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ} [البقرة: 255]. ننفي السِّنَة والنوم عن الله ونثبت كمال حياته وقيُّوميته وقوله عَزَّوَجَلَّ: {وَقَالَ الَّذِينَ كَفَرُوا لا تَأْتِينَا السَّاعَةُ قُلْ بَلَى وَرَبِّي لَتَأْتِيَنَّكُمْ عَالِمِ الْغَيْبِ لا يَعْزُبُ عَنْهُ مِثْقَالُ ذَرَّةٍ فِي السَّمَاوَاتِ وَلا فِي الأَرْضِ وَلا أَصْغَرُ مِن ذَلِكَ وَلا أَكْبَرُ إِلاَّ فِي كِتَابٍ مُّبِينٍ} [سبأ: 3]. لا يعزب عنه شيء وذلك لكمال علمه ومعنى لا يعزب \" لا يغيب\" كما قال ابن كثير رحمه الله وتنطبق هذه القاعدة على جميع الصفات السلبية. القسم الثاني: باعتبار أدلة ثبوتها وهي نوعان: 1 - صفات خبرية: وهي الصفات التي لا سبيل إلى إثباتها إلا السمع والخبر عن الله عز وجل أو عن رسوله صلى الله عليه وسلم وتسمى (صفات سمعية أو نقلية) وقد تكون ذاتية كالوجه واليدين وقد تكون فعلية كالفرح والضحك. 2 - صفات سمعية عقلية: وهي الصفات التي يشترك في إثباتها",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 17
  },
  {
    "serial_number": "39671",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 19,
    "volume_number": 1,
    "text": "الدليل السمعي (النقلي) والدليل العقلي وقد تكون ذاتية كالحياة والعلم والقدرة وقد تكون فعلية كالخلق والإعطاء. القسم الثالث: باعتبار تعلقها بذات الله وأفعاله وهي نوعين: 1 - صفات ذاتية: لم يزل ولا يزال الله متصف بها فهي لا تنفك ولا تنفصل عن ذات الله سبحانه مثل العلم والقدرة والحكمة والعَظَمَة واليدين والعينين والوجه. 2 - صفات فعلية: وتسمى أيضاً صفات اختيارية، وهي التي تتعلق بمشيئة الله يفعلها إذا شاء سبحانه مثل الفرح والغضب والاستواء على العرش والنزول إلى السماء الدنيا في الثلث الآخر من الليل وغير ذلك، فالصفات الفعلية ذاتية باعتبار أصل قدرة الله عليها وفعلية باعتبار آحادها، فهي قديمة النوع حادثة الآحاد \" موقع الإسلام سؤال وجواب\". • • •",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 18
  },
  {
    "serial_number": "39672",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 20,
    "volume_number": 1,
    "text": "بعض أسماء الله الحسنى من القرآن والسُّنَّة وليست جميعها 1 - الله: المعبود بحق والمستحق للعبادة. وهذا الاسم دال على جميع الأسماء الحسنى والصفات العلى، ولهذا يضيف الله سائر الأسماء الحسنى إلى اسمه \"الله\" كقوله تعالى: {وَلِلَّهِ الأَسْمَاء الْحُسْنَى فَادْعُوهُ بِهَا } [الأعراف: 180]. 2 - الإله: نفس معنى الله، ومعنى كلمة لا إله إلا الله \" لا معبود بحق إلا الله\" وكل معبود سوى الله فهو باطل، فهي مشتملة على إثبات ونفي، كلمة (لا إله) معناها نفي عبادة ما سوى الله، وكلمة (إلا الله) معناها إثبات العبادة لله وحده، فلا يَصِح إيمان المرء إلا إذا تبرأ من الشرك والمشركين. 3 - المَلِك: الذي يملك جميع المخلوقات ويتصرف فيها وحده \" تفسير بن كثير سورة الحشر آية 23\". 4 - المليك: يدل على كثرة مُلْكِه لأنه على وزن فعيل من صيغ المبالغة. 5 - الرب: بمعنى المالك والسيد والمصلح لأحوال الخلق. 6 - السيد: بمعنى المالك والرب والمولى",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 19
  },
  {
    "serial_number": "39673",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 21,
    "volume_number": 1,
    "text": "7 - القادر: له القدرة الكاملة ولا يعجزه شيء سبحانه. 8 - القدير: على وزن فعيل من صيغ المبالغة في القدرة. 9 - المقتدر: نفس المعنى. 10 - الفتَّاح: له عدة معاني: • الحاكم الذي يقضي بين عباده بالحق والعدل بأحكامه القدرية والشرعية. • الذي يفتح أبواب الرزق والرحمة للخلق. • الذي ينصر المؤمنين وينصر المظلومين. 11 - القريب: قريب ممن يعبده ويدعوه من المؤمنين. 12 - المجيب: الذي يجيب دعاء الداعين ويعطيهم أكثر مما يسألونه. 13 - الخالق: الخلق هو التقدير. 14 - الخَلاَّق: يدل على المبالغة في الخلق. 15 - البارئ: البرء هو تنفيذ ما قدره وإظهاره إلى الوجود. 16 - المُصَوِّر: صَوَّر المخلوقات على ما يريد من الصُّوَر فأعطى كل مخلوق صورة يتميز بها عن غيره.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 20
  },
  {
    "serial_number": "39674",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 22,
    "volume_number": 1,
    "text": "فهي مرتبه الخلق ثم البرء ثم التصوير يعني (التقدير ثم التنفيذ ثم التصوير) ينظر \" تفسير بن كثير سورة الحشر الاية 24 17 - الطَّيِّب: المُنَزَّه عن النقص والسوء لأنه متصف بالكمال. 18 - الواسع: واسع في علمه، واسع في غناه وفي فضله على الخلق فهو يشمل جميع صفات الله. 19 - الأول: قبل كل شيء بغير حد، لأنه كان ولا شيء موجوداً سواه. 20 - الآخِر: بعد كل شيء بغير نهاية لأنه يبقى بعد فناء المخلوقات. فربنا تبارك وتعالى أزلي \" ليس مسبوق بعدم ولا بداية له\" وأبدي \" لا نهاية له\". 21 - الظاهر: ظاهر وعالي فوق كل أحد وليس هناك من هو أظهر أو أعلى منه. 22 - الباطن: لا أحد أقرب إلى أحد منه ولا يعلم بواطن الأمور مثله سبحانه، وقد بينها الرسول صلى الله عليه وسلم في الحديث \" اللهم أنت الأول فليس قبلك شيء وأنت الآخر فليس بعدك شيء وأنت الظاهر فليس فوقك شيء وأنت الباطن فليس دونك شيء\" رواه مسلم.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 21
  },
  {
    "serial_number": "39675",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 23,
    "volume_number": 1,
    "text": "23 - الرؤوف: الرأفة أعلى معاني الرحمة. 24 - الغني: متصف بالغنى الكامل ومستغني عن غيره ومستغني عن الولد والصاحبة والشريك وكل الخلق محتاجون ومفتقرون إليه. 25 - الرفيق: الرِّفق في اللغة هو اللِّين وهو ضد العُنف. 26 - المنَّان: من المن وهو العطاء. 27 - المُعْطِي: يعطي الخلق النعم كنعمة الهداية والعقل والغذاء وغيرها. 28 - الجميل: جميل في ذاته وأسمائه وصفاته. 29 - الحَيِي: يترك ما ليس يتناسب مع رحمته وكرمه. 30 - السَّتِير: هو الذي يستر الناس ولا يفضحهم. 31 - الوهاب: الذي أعطى عباده العقول والأرزاق وجميع النعم. 32 - الحسيب: يشمل أمرين: أولاً: أنه يكفي المتوكلون عليه جميع ما أهمهم. ثانياً: يحفظ الأعمال ثم يجازي الناس بها. 33 - الرازق: الذي رزق الخلق ما يحتاجون إليه وليس الرزق محصور في المال بل يشمل العقول والأولاد والزوجة وغير ذلك.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 22
  },
  {
    "serial_number": "39676",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 24,
    "volume_number": 1,
    "text": "34 - الرَّزَّاق: يدل على كثرة أرزاقه لأنه على وزن فعَّال من صيغ المبالغة. 35 - السميع: سمعه أدرك كل شيء. 36 - البصير: بصره أدرك كل شيء. 37 - الحَكَم: حُكْم الله نوعان: أولاً: حُكم قدري وهو ما يجري على الناس من أقدار كالفقر والمرض والزواج وغير ذلك. وثانياً: حُكم شرعي مثل تحليل أمور وتحريم أمور أخرى. 38 - الحكيم: الذي يضع الأمور في مواضعها الصحيحة وهو حكيم في أفعاله وأقواله. 39 - الحق: المتصف بالوجود الدائم. 40 - النصير: ينصر المسلمين على عدوهم. 41 - الولي: النصير والذي تولى أمر المؤمنين. 42 - المولى: هناك نوعان من الولاية: • ولاية عامة لكل الخلق: وهي بمعنى السيد والمالك والرب. • ولاية خاصة بالمسلمين: بمعنى النصير.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 23
  },
  {
    "serial_number": "39677",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 25,
    "volume_number": 1,
    "text": "43 - الهادي: الهداية أنواع: 1 - هداية عامة لكل الخلق، فهو الذي هدى جميع الخلق إلى ما ينفعهم حتى الحيوانات عَلَّمَها كيف تكسب أرزاقها كما قال عَزَّوَجَلَّ: {قَالَ رَبُّنَا الَّذِي أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ ثُمَّ هَدَى} [طه: 50] 2 - هداية الدلالة والإرشاد وهي لجميع الثقلين ومعناها التعريف بطريق الخير وطريق الشر فربنا قد أنزل الكتب وأرسل الرسل لهداية الإنس والجن وهي المقصودة في قوله سبحانه وتعالى: {وَهَدَيْنَاهُ النَّجْدَيْنِ} [البلد: 10] وهذه يقدر عليها الأنبياء والدعاة والمصلحين كما أثبتها الله للرسول صلى الله عليه وسلم في قوله: {وَإِنَّكَ لَتَهْدِي إِلَى صِرَاطٍ مُّسْتَقِيمٍ} [الشورى: 52] 3 - هداية التوفيق الخاصة بالمسلمين بأن وفقهم وجعلهم يقبلون الحق ويختارونه كما قال سبحانه: {فَمَن يُرِدِ اللَّهُ أَن يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلَامِ وَمَن يُرِدْ أَن يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقًا حَرَجا كَأَنَّمَا يَصَّعَّدُ فِي السَّمَاءِ} [الأنعام: 125]",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 24
  },
  {
    "serial_number": "39678",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 26,
    "volume_number": 1,
    "text": "وهذه لا يقدر عليها إلا الله وحده كما قال سبحانه مخاطبا الرسول صلى الله عليه وسلم {إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللَّهَ يَهْدِي مَن يَشَاءُ} [القصص: 56] 4 - الهداية إلى الجنة والنار: أما هداية المسلمين إلى الجنة فقد وردت في قوله سبحانه: {وَقَالُواْ الْحَمْدُ لِلَّهِ الَّذِي هَدَىنَا لِهَذَا وَمَا كُنَّا لِنَهْتَدِيَ لَوْلَا أَنْ هَدَىنَا اللَّهُ} [الأعراف: 43] ووردت في قول الرسول صلى الله عليه وسلم: \" فو الذي نفس محمد بيده لأحدهم أهدى بمنزله في الجنة منه بمنزله كان في الدنيا\" رواه البخاري. يعني أنهم يعرفون بيوتهم في الجنة أكثر مما يعرفون بيوتهم في الدنيا، وهذه الهداية هي ثمرة الهداية الثالثة بمعنى أنه من حصلت له هداية التوفيق حصلت له الهداية إلى الجنة. وأما هداية الكفار إلى النار فقد وردت في قوله سبحانه: {احْشُرُواْ الَّذِينَ ظَلَمُواْ وَأَزْوَاجَهُمْ وَمَا كَانُواْ يَعْبُدُونَ (22) مِن دُونِ اللَّهِ فَاهْدُوهُمْ إِلَى صِرَاطِ الْجَحِيمِ (23)} [الصافات: 22 - 23]",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 25
  },
  {
    "serial_number": "39679",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 27,
    "volume_number": 1,
    "text": "يعني دُلُّوهم إلى النار فهم يساقون إليها يوم القيامة، وهداية الله للمسلمين إلى الجنة بسبب فضله وهدايته للكفار إلى النار بسبب عدله. 44 - الحميد: يُحمد ويُثنى عليه من خلقه ويستحق أن يُحمد \" تفسير الطبري سورة البقرة آية 267\". 45 - المُبِين: المبَيِّن لعباده سبيل الرشاد والموضح لهم الأعمال الموجبة لثوابه والأعمال الموجبة لعقابه والبيِّن أمره في وحدانيته والذي لا يخفى على أحد. 46 - الدَّيّان: يحاسب الخلق على أعمالهم ويجازيهم بها. 47 - الكريم: يقول بن تيمية في تفسير سورة العلق في مجموع الفتاوى \" لفظ الكرم لفظ جامع للمحاسن والمحامد، لا يراد به مجرد الإعطاء فالإعطاء من تمام معناه\". 48 - الأكرم: مبالغة في الكرم. 49 - العظيم: ذاته وصفاته عظيمة ويُعظِّمُه خلقه. 50 - المجيد: من المجد وهو الشرف الكثير والواسع والعظيم والمجيد تدل على جملة أوصاف عديدة ولا تختص بصفة معينة \" بدائع الفوائد لابن القيم\".",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 26
  },
  {
    "serial_number": "39680",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 28,
    "volume_number": 1,
    "text": "51 - الصمد: الذي تَصْمُد \" تلجأ\" إليه مخلوقاته في حاجاتها. 52 - الحي: متصف بالحياة التي لم يسبقها عدم ولا يلحقها فناء. 53 - القَيُّوم: القائم بنفسه المقيم لغيره والذي قامت به المخلوقات والسموات والأرضين فلا قيام لغيره إلا بإقامته له أما هو فمستغني عن الخلق. 54 - الواحد: يعني أن الله واحد في ربوبيته وألوهيته وأسمائه وصفاته ليس له شريك ولا مثيل ولا شبيه. 55 - الأحد: نفس معنى الواحد ولكن بينهما عدة فروق: الأول: أن الواحد اسم لمفتتح العدد، فيقال: واحد واثنان وثلاثة أما أحد فينقطع معه العدد فلا يقال: أحد اثنان ثلاثة. الثاني: أن أحد في النفي أعم من الواحد فيقال: ما في الدار واحد، ويجوز أن يكون هناك اثنان أو ثلاثة أو أكثر أما لو قال: ما في الدار أحد فهو نفي وجود الجنس بالمرة، فليس فيها أحد ولا اثنان ولا ثلاثة ولا أكثر ولا أقل. الثالث: لفظ الواحد يمكن جعله وصفاً لأي شيء أريد، فيصح القول: رجل واحد، وثوب واحد، ولا يصح وصف شيء في جانب",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 27
  },
  {
    "serial_number": "39681",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 29,
    "volume_number": 1,
    "text": "الإثبات بأحد إلا الله الأحد كماقال سبحانه {قُلْ هُوَ اللَّهُ أَحَدٌ} [الإخلاص: 1] فلا يقال: رجل أحد ولا ثوب أحد فكأن الله عَزَّوَجَلَّ استأثر بهذا النعت. [موقع الدرر السنية]. 56 - اللَّطِيف: - يعلم خفايا الأمور. - يُحسِن إلى عباده بطرق تخفى عليهم \" تفسير أسماء الله للسعدي وتفسير أسماء الله للزجاج\". 57 - الحليم: الذي لا يعجل بالعقوبة على العاصي بل يمهله لكي يتوب. 58 - الشَّاكر: الذي لا يضيع عمل العاملين بل يجازيهم بأعمالهم ومن صور ذلك أنه يجازي الحسنة بعشر أمثالها \" الحق الواضح المبين لعبد الرحمن السعدي\". 59 - الشَّكور: يدل على كثرة شكره لأنه على وزن فعول من صيغ المبالغة. 60 - الجواد: كثير العطاء. 61 - الحافظ: يحفظ جميع الخلق من المصائب والمكروهات",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 28
  },
  {
    "serial_number": "39682",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 30,
    "volume_number": 1,
    "text": "ويحفظ أعمالهم لكي يجازيهم بها يوم القيامة ويحفظ اولياؤه المؤمنين من الفتن والضلال 62 - الحفيظ: يدل على كثرة حفظه لأنه على وزن فعيل من صيغ المبالغة. 63 - الرقيب: يعلم بواطن الأمور مثل أعمال القلوب. 64 - الشهيد: يعلم ظواهر الأمور مثل أعمال الجوارح. 65 - العليم: متصف بالعلم الكامل الذي لم يُسبق بجهل ولا يلحقه نسيان \"القواعد المثلى لابن عثيمين\". 66 - العالم: نفس المعنى. 67 - الخبير: يعلم ظواهر الأمور وبواطنها. 68 - العزيز: له عدة معاني: - قوي. - غالب فهو يغلب أعداءه. - ممتنع عن أذى أي أحد وهذا خاص بالله وحده فليس أحد غيره ممتنع عن الأذى حتى أقوى الناس معرض للأذى والظلم. \" تفسير أسماء الله الحسنى للسعدي\". 69 - الجبار: له عدة معاني:",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 29
  },
  {
    "serial_number": "39683",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 31,
    "volume_number": 1,
    "text": "أولاً: جَبْر القوة أي أنه يُجبِر العباد على الأمر الذي يريده ويغلب الجبابرة. وثانياً: جَبْر الرحمة مأخوذ من الجَبْر وهو إصلاح الشيء فالله يَجْبُر الفقير بالغنى ويَجْبُر المريض بالشفاء. ثالثاً: جَبْر العلو فإنه سبحانه فوق مخلوقاته. \" فتاوى العقيدة لابن عثيمين\". 70 - المتكبر: متعالي عن كل سوء. \" ابن كثير سورة الحشر آية 23\". 71 - الكبير: هو الكبير في ذاته وقَدْرِه وكل شيء دونه صغير ولذلك نقول عند ذكره (الله أكبر). 72 - القوي: صاحب القوة التي لا مثيل لها. 73 - المتين: شديد القوة. 74 - البَر: بفتح الباء وهو الذي توسع في فعل الخير للعباد. 75 - المُحِيط: علمه أحاط بكل شيء وقدرته أحاطت بكل شيء. 76 - الوَدُود: يحب رسله وعباده الصالحين، والوُد هو خالص الحُب وأرَقَّه.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 30
  },
  {
    "serial_number": "39684",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 32,
    "volume_number": 1,
    "text": "77 - الرحمن: 78 - الرحيم: الفرق بينهما أن الرحمن يدل على الرحمة العامة لكل الخلق في الدنيا وللمسلمين في الآخرة والرحيم يدل على الرحمة الخاصة بالمسلمين في الدنيا والآخرة. 79 - الُّسبُّوح: المنّزَّه عن كل نقص وعيب المتصف بالكمال. 80 - القُدُّوس: المنَزَّه عن كل نقص وعيب المتصف بالكمال. 81 - السَّلام: الذي سَلِمَت ذاته وأسماؤه وصفاته من النقص لاتصافه بالكمال. \"القُدُّوس والسلام ينظر تفسير ابن كثير سورة الحشر\". 82 - المُؤمِن: الذي صدَّق أنبياءه بالمعجزات التي دلت على صدقهم وصدَّق المؤمنين بنصرهم وقبول إيمانهم وإثابتهم عليه. 83 - العلي: يشمل ثلاثة أمور: - عُلُوّ الذات: لأنه فوق خلقه. - عُلُوّ القدر: لكمال صفاته. - عُلُوّ القهر: قَهَرَ الخلق بقوته. \" شرح أسماء الله لسعيد علي القحطاني\".",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 31
  },
  {
    "serial_number": "39685",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 33,
    "volume_number": 1,
    "text": "84 - الأعلى: مبالغة في العلو. 85 - المُتَعَال: نفس المعنى. 86 - الوِتْر: الواحد الذي لا شريك له في ربوبيته وألوهيته وأسمائه وصفاته. 87 - المُقِيت: القدير. 88 - المُهَيمِن: معناه الرقيب والشهيد. كما قال الزجاجي في \"اشتقاق الأسماء\". 89 - الوكيل: له معنى عام لجميع الخلق: أي أن الله سبحانه الذي تولَّى تدبير أمور خلقه وله معنى خاص بمن توكَّلَ عليه من المسلمين أنه يحفظهم وينصرهم. 90 - الشافي: الذي يشفي من أمراض الأبدان ويشفي من أمراض القلوب مثل الشرك والكفر والنفاق والحسد. 91 - القاهر: الذي قهر الجبابرة من عتاة خلقه بالعقوبة وقهر كل الخلق بالموت \" شأن الدعاء للخطابي\". والذي قهر المخلوقات بسلطانه وقدرته وذلَّت له سبحانه. 92 - القهَّار: مبالغة في القهر.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 32
  },
  {
    "serial_number": "39686",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 34,
    "volume_number": 1,
    "text": "93 - العَفُوّ: الذي يمحو الذنوب. 94 - الغفور: الذي يستر الذنوب. 95 - الغفَّار: على وزن فعَّال من صيغ المبالغة في المغفرة. 96 - التَّوَّاب: يتوب على التائبين ويقبل توبتهم. 97 - الوارث: هو الذي يرث الخلائق ويبقى بعد فنائهم. 98 - المُقَدِّم: 99 - المُؤَخِّر: ولها معنيين: 1 - تقديم أو تأخير كوني: كتقديم أو تأخير بعض المخلوقات على بعض في الرزق أو في الآجال. 2 - تقديم أو تأخير شرعي: كتفضيل الأنبياء على الناس وتفضيل المسلمين على غيرهم وتأخير شرعي مثل تأخير الكفار عن المسلمين. • • •",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 33
  },
  {
    "serial_number": "39687",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 35,
    "volume_number": 1,
    "text": "أدلة الأسماء من القرآن الكريم {هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ (23) هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاءُ الْحُسْنَى يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ (24)} [الحشر: 23 - 24] {الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (2) الرَّحْمَنِ الرَّحِيمِ (3)} [الفاتحة: 2 - 3] {قُلْ هُوَ اللَّهُ أَحَدٌ (2) اللَّهُ الصَّمَدُ (3)} [الإخلاص: 1 - 2] {فَأُوْلَئِكَ عَسَى اللَّهُ أَن يَعْفُوَ عَنْهُمْ وَكَانَ اللَّهُ عَفُوًّا غَفُورا (99)} [النساء: 99] {مَّا يَفْعَلُ اللَّهُ بِعَذَابِكُمْ إِن شَكَرْتُمْ وَءَامَنتُمْ وَكَانَ اللَّهُ شَاكِرًا عَلِيما (147)} … [النساء: 147] {لِيُوَفِّيَهُمْ أُجُورَهُمْ وَيَزِيدَهُمْ مِنْ فَضْلِهِ إِنَّهُ غَفُورٌ شَكُورٌ (30)} [فاطر: 30] {ان رَبِّي قَرِيبٌ مُجِيبٌ (61)} [هود: 61] {إِنَّهُ حَمِيدٌ مَجِيدٌ (73)} [هود: 73] {قُلْ يَجْمَعُ بَيْنَنَا رَبُّنَا ثُمَّ يَفْتَحُ بَيْنَنَا بِالْحَقِّ وَهُوَ الْفَتَّاحُ الْعَلِيمُ (26)} [سبأ: 26]",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 34
  },
  {
    "serial_number": "39688",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 36,
    "volume_number": 1,
    "text": "{وَهُوَ الْغَفُورُ الْوَدُودُ (14)} [البروج: 14] {فَاللَّهُ خَيْرٌ حَافِظًا وَهُوَ أَرْحَمُ الرَّاحِمِينَ (64)} [يوسف: 64] {لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ (11)} [الشورى: 11] {وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ لَا إِلَهَ إِلَّا هُوَ الرَّحْمَنُ الرَّحِيمُ (163)} [البقرة: 163] {فِي مَقْعَدِ صِدْقٍ عِنْدَ مَلِيكٍ مُقْتَدِرٍ (55)} [القمر: 55] {اقْرَأْ وَرَبُّكَ الْأَكْرَمُ (3)} [العلق: 3] {إِنَّ اللَّهَ كَانَ عَلَى كُلِّ شَيْءٍ حَسِيبًا (86)} [النساء: 86] {وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ رَقِيبًا (52)} [الأحزاب: 52] {إِنَّ اللَّهَ كَانَ عَلَى كُلِّ شَيْءٍ شَهِيدًا (55)} [الأحزاب: 55] {أَلَا يَعْلَمُ مَنْ خَلَقَ وَهُوَ اللَّطِيفُ الْخَبِيرُ (14)} [الملك: 14] {وَكَفَى بِرَبِّكَ هَادِيًا وَنَصِيرًا (31)} [الفرقان: 31] {اللَّهُ لَطِيفٌ بِعِبَادِهِ يَرْزُقُ مَنْ يَشَاءُ وَهُوَ الْقَوِيُّ الْعَزِيزُ (19)} [الشورى: 19] {إِنَّا كُنَّا مِنْ قَبْلُ نَدْعُوهُ إِنَّهُ هُوَ الْبَرُّ الرَّحِيمُ (28)} [الطور: 28] {رَبُّ السَّمَوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الْعَزِيزُ الْغَفَّارُ (66)} [ص: 66] {سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى (1)} [الأعلى: 1]",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 35
  },
  {
    "serial_number": "39689",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 37,
    "volume_number": 1,
    "text": "{اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ (255)} [البقرة: 255] {أَلَمْ يَعْلَمُوا أَنَّ اللَّهَ هُوَ يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ وَيَأْخُذُ الصَّدَقَاتِ وَأَنَّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ (104)} [التوبة: 104] {ذَلِكَ بِأَنَّ اللَّهَ هُوَ الْحَقُّ وَأَنَّ مَا يَدْعُونَ مِنْ دُونِهِ الْبَاطِلُ وَأَنَّ اللَّهَ هُوَ الْعَلِيُّ الْكَبِيرُ (30)} [لقمان: 30] {عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْكَبِيرُ الْمُتَعَالِ (9)} [الرعد: 9] {وَتَوَكَّلْ عَلَى اللَّهِ وَكَفَى بِاللَّهِ وَكِيلًا (3)} [الأحزاب: 3] {يَوْمَئِذٍ يُوَفِّيهِمُ اللَّهُ دِينَهُمُ الْحَقَّ وَيَعْلَمُونَ أَنَّ اللَّهَ هُوَ الْحَقُّ الْمُبِينُ (25)} … [النور: 25] {يَا أَيُّهَا الْإِنْسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ (6)} [الانفطار: 6] {وَهُوَ الْقَاهِرُ فَوْقَ عِبَادِهِ وَهُوَ الْحَكِيمُ الْخَبِيرُ (18)} [الأنعام: 18] {يَوْمَ هُمْ بَارِزُونَ لَا يَخْفَى عَلَى اللَّهِ مِنْهُمْ شَيْءٌ لِمَنِ الْمُلْكُ الْيَوْمَ لِلَّهِ الْوَاحِدِ الْقَهَّارِ (16)} [غافر: 16] {إِنَّ اللَّهَ هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ (58)} [الذاريات: 58]",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 36
  },
  {
    "serial_number": "39690",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 38,
    "volume_number": 1,
    "text": "{إِنَّ رَبَّكَ هُوَ الْخَلَّاقُ الْعَلِيمُ (86)} [الحجر: 86] {مَنْ يَشْفَعْ شَفَاعَةً حَسَنَةً يَكُنْ لَهُ نَصِيبٌ مِنْهَا وَمَنْ يَشْفَعْ شَفَاعَةً سَيِّئَةً يَكُنْ لَهُ كِفْلٌ مِنْهَا وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ مُقِيتًا (85)} [النساء: 85] {وَلِسُلَيْمَانَ الرِّيحَ عَاصِفَة تَجْرِي بِأَمْرِهِ إِلَى الْأَرْضِ الَّتِي بَارَكْنَا فِيهَا وَكُنَّا بِكُلِّ شَيْءٍ عَالِمِينَ (81)} [الأنبياء: 81] {مثل الذين ينفقون أموالهم في سبيل الله كمثل حبة انبتت سبع سنابل فِي كُلِّ سُنْبُلَةٍ مِاْئَةُ حَبَّةٍ وَاللَّهُ يُضَاعِفُ لِمَنْ يَشَاءُ وَاللَّهُ وَاسِعٌ عَلِيمٌ (261)} [البقرة: 261] {هُوَ الْأَوَّلُ وَالْآَخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ (81)} [الحديد: 3] {رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ (8)} [آل عمران: 8] {يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ وَاللَّهُ هُوَ الْغَنِيُّ الْحَمِيدُ (15)} [فاطر: 15] {وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ وَأَنَّ اللَّهَ رَءُوفٌ رَحِيمٌ (20)} [النور: 20] {وَلِلَّهِ مُلْكُ السَّمَوَاتِ وَالْأَرْضِ وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (189)} [آل عمران: 189] {فَقَدَرْنَا فَنِعْمَ الْقَادِرُونَ (23)} [المرسلات: 23] {قَالَ نَبَّأَنِيَ الْعَلِيمُ الْخَبِيرُ (3)} [التحريم: 3]",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 37
  },
  {
    "serial_number": "39691",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 39,
    "volume_number": 1,
    "text": "{وَهُوَ الَّذِي يُنَزِّلُ الْغَيْثَ مِنْ بَعْدِ مَا قَنَطُوا وَيَنْشُرُ رَحْمَتَهُ وَهُوَ الْوَلِيُّ الْحَمِيدُ (28)} [الشورى: 28] {ثُمَّ رُدُّواْ إِلَى اللَّهِ مَوْلَىهُمُ الْحَقِّ أَلَا لَهُ الْحُكْمُ وَهُوَ أَسْرَعُ الْحَاسِبِينَ (62)} [الأنعام: 62] ومعنى المولى هنا الولاية العامة لكل الخلق. {وَإِنْ تَوَلَّوْا فَاعْلَمُوا أَنَّ اللَّهَ مَوْلَاكُمْ نِعْمَ الْمَوْلَى وَنِعْمَ النَّصِيرُ (40)} [الأنفال: 40] ومعنى المولى هنا الولاية الخاصة بالمسلمين. {إِنَّ رَبِّي عَلَى كُلِّ شَيْءٍ حَفِيظٌ (57)} [هود: 57] {أَلَا إِنَّهُمْ فِي مِرْيَةٍ مِنْ لِقَاءِ رَبِّهِمْ أَلَا إِنَّهُ بِكُلِّ شَيْءٍ مُحِيطٌ (54)} [فصلت: 54] {لَّا يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ وَلَكِن يُؤَاخِذُكُم بِمَا كَسَبَتْ قُلُوبُكُمْ وَاللَّهُ غَفُورٌ حَلِيمٌ (225)} [البقرة: 225] {وَإِنَّا لَنَحْنُ نُحْيِي وَنُمِيتُ وَنَحْنُ الْوَارِثُونَ (23)} [الحجر: 23] • • •",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 38
  },
  {
    "serial_number": "39692",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 40,
    "volume_number": 1,
    "text": "أدلة الأسماء من الأحاديث النبوية \" إن الله هو الحَكَم وإليه الحُكُم\" رواه أبو داوود والنسائي والحاكم \" إن الله عَزَّوَجَلَّ حيِي سَتِير يحب الحياء والستر فإذا اغتسل أحدكم فليستتر\" رواه أبو داود والنسائي وأحمد. سمع النبي صلى الله عليه وسلم رجلاً يقول: \" اللهم إني أسالك بأن لك الحمد لا إله إلا أنت وحدك لا شريك لك المنان يا بديع السموات والأرض، يا ذا الجلال والإكرام يا حي يا قيوم إني أسالك الجنة وأعوذ بك من النار فقال النبي صلى الله عليه وسلم لقد سأل الله باسمه الأعظم الذي إذا سئل به أعطى وإذا دعي به أجاب\". رواه أبو داوود والترمذي والنسائي وبن ماجه واللفظ له. \" إن الله جميل يحب الجمال\" رواه مسلم. \" ان الله رفيق يحب الرفق\" رواه مسلم \" السيد الله تبارك وتعالى\" رواه أحمد وأبو داوود واللفظ له. \" اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أسرفت وما أنت أعلم به مني انت المقدم وأنت المؤخر لا إله إلا أنت\" رواه مسلم.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 39
  },
  {
    "serial_number": "39693",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 41,
    "volume_number": 1,
    "text": "\" من يُرِد الله به خيرا يفقهه في الدين، والله المعطي وأنا القاسم\" رواه البخاري واللفظ له ومسلم. \" إن الله وتر يحب الوتر\" رواه البخاري ومسلم. عن عبد الله بن أنيس رضي الله عنه قال: سمعت الرسول صلى الله عليه وسلم يقول: \" يحشر الناس يوم القيامة - أو قال: العباد - عراة غرلا بهما\" قال: قلنا: وما بهما؟ قال: \" ليس معهم شيء، ثم يناديهم بصوت يسمعه من بَعُدَ كما يسمعه من قَرُب: أنا الملك، أنا الديان، ولا ينبغي لأحد من أهل النار، أن يدخل النار، وله عند أحد من أهل الجنة حق، حتى أقصه منه، ولا ينبغي لأحد من أهل الجنة أن يدخل الجنة، ولأحد من أهل النار عنده حق، حتى أقصه منه، حتى اللطمة\" قال: قلنا: كيف وإنا إنما نأتي الله عَزَّوَجَلَّ عراة غرلا بهما؟ قال: \" بالحسنات والسيئات\" رواه أحمد. \" سُبُّوح قُدُّوس رب الملائكة والروح\" رواه مسلم وأبو داوود والنسائي. \" أذهب الباس رب الناس اشف وأنت الشافي لا شفاء إلا شفاؤك شفاءً لا يغادر سقماً\" رواه البخاري ومسلم.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 40
  },
  {
    "serial_number": "39694",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 42,
    "volume_number": 1,
    "text": "\" أيها الناس إن الله طَيِّب ولا يقبل إلا طَيِّبًا\" رواه مسلم. عن أنس بن مالك رضي الله عنه قال: قال الناس: يا رسول الله غلا السعر فسعِّر لنا فقال الرسول صلى الله عليه وسلم: \" إن الله هو المُسَعِّر القابض الباسط الرازق وإني لأرجو أن ألقى الله وليس أحد منكم يطالبني بمظلمة في دم ولا مال\" رواه أبو داوود والترمذي وبن ماجه. \" إن الله تعالى جواد يحب الجود\" رواه البيهقي في شعب الإيمان وأبو نعيم في الحلية. • • •",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 41
  },
  {
    "serial_number": "39695",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 43,
    "volume_number": 1,
    "text": "بعض صفات الله من القرآن والسنة وليست جميعها صفة الوجه: قال الله عَزَّوَجَلَّ: {وَيَبْقَى وَجْهُ رَبِّكَ ذُو الْجَلَالِ وَالْإِكْرَامِ (27)} [الرحمن: 27]. ووجه الله ليس كمثل وجوه المخلوقين لأنه مُنَزَّه عن التمثيل بالمخلوقات. صفة العينين: قال النبي عليه الصلاة والسلام: \" إن الله لا يخفى عليكم، إن الله ليس بأعور - وأشار بيده إلى عينه - وإن المسيح الدجال أعور العين اليمنى كأن عينه عنبة طافية\" رواه البخاري. وأيضًا قوله تعالى: {تَجْرِي بِأَعْيُنِنَا جَزَاءً لِمَنْ كَانَ كُفِرَ (14)} [القمر: 14]. يعني أن السفينة كانت بمرأى وحفظ من الله \" تفسير البغوي\". وقوله عَزَّوَجَلَّ: {وَأَلْقَيْتُ عَلَيْكَ مَحَبَّةً مِنِّي وَلِتُصْنَعَ عَلَى عَيْنِي (39)} [طه: 39]. يعني ان تربية موسى كانت بمرأى وحفظ من الله \" تفسير الطبري \" كما نقول: \" جرى هذا الشيء على عيني\" أي حصل وأنا أراه بعيني وأحفظه، وهذا معروف في كلام العرب، ولا يُفْهَم من ذلك أن السفينة في داخل عين الله أو أن موسى ملتصق على عين الله لأن الله سبحانه على عرشه والعرش فوق جميع المخلوقات كما قال تعالي: {الرَّحْمَنُ",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 42
  },
  {
    "serial_number": "39696",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 44,
    "volume_number": 1,
    "text": "عَلَى الْعَرْشِ اسْتَوَى (5)} [طه: 5]. صفة اليدين: نثبتها على ظاهرها وحقيقتها فلا نُحَرِّف معناها ولا نعلم كيفيتها لأن كيفيتها يعلمها الله وحده، قال عَزَّوَجَلَّ: {وَقَالَتِ الْيَهُودُ يَدُ اللَّهِ مَغْلُولَةٌ غُلَّتْ أَيْدِيهِمْ وَلُعِنُوا بِمَا قَالُوا بَلْ يَدَاهُ مَبْسُوطَتَانِ يُنْفِقُ كَيْفَ يَشَاءُ} [المائدة: 64]. وبَسْطَ اليدين يدل على كثرة العطاء \" تفسير الطبري\". وقال تعالى: {تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ وَهُوَ عَلَى كُلِّ شَيْء قَدِيرٌ (1)} … [الملك: 1]. وقال أيضاً {أَوَ لَمْ يَرَوْاْ أَنَّا خَلَقْنَا لَهُم مِّمَّا عَمِلَتْ أَيْدِينَا أَنْعَااما فَهُمْ لَهَا مَالِكُونَ (71)} (سورة يس 71) ذُكِرَت صفة اليد لله بصيغة الإفراد والتثنية والجمع ولا يُراد أنها واحدة أو أكثر من اثنتين لأن المفرد المضاف يعُم فيتناول كل ما ثبت لله من يد وأما صيغة الجمع فيُراد بها التعظيم، وكذلك صفة العين فقد وردت بصيغة الإفراد والتثنية والجمع، فنثبت أن لله عينين اثنتين ويدين اثنتين. صفة الكَف: قال الرسول صلى الله عليه وسلم \" ما تصدق أحد بصدقة من طيب ولا يقبل الله إلا الطيب، إلا أخذها الرحمن بيمينه وإن كانت تمرة فتربو في كف الرحمن حتى تكون أعظم من الجبل كما يربي أحدكم فلوه أو فصيله\" رواه مسلم.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 43
  },
  {
    "serial_number": "39697",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 45,
    "volume_number": 1,
    "text": "صفة الرِّجل: روى البخاري ومسلم أن النبي صلى الله عليه وسلم قال: \"تحاجَّت الجنة والنار فقالتِ النار أو ثرت بالمتكبرِّين والمتجبرِّين وقالتِ الجنة مالي لا يدخلني إلا ضعفاء الناس وسقطهم قال الله تبارك وتعالى للجنة أنتِ رحمتي أرحم بكِ من أشاء من عبادي وقال للنار إنما أنتِ عذابي أعذب بكِ من أشاء من عبادي ولكل واحدة منهما ملؤها فأما النار فلا تمتلئ حتى يضع رجله فتقول قط قط فهنالك تمتلئ ويزوى بعضها إلى بعض ولا يظلم الله عَزَّوَجَلَّ من خلقه أحدا وأما الجنة فإن الله عز وجل ينشئ لها خلقا\" ولفظ مسلم \" فأما النار فلا تمتلئ فيضع قدمه عليها\". صفة القَدَمَين: قال بن عباس رضي الله عنهما\" الكرسي موضع القدمين، والعرش لا يقدر أحد قدره\" رواه بن خزيمة في \"التوحيد\" والحاكم في \"المستدرك\". صفة الأصابع: \" جاء حَبْر إلى الرسول صلى الله عليه وسلم فقال يا محمد أو يا أبا القاسم إن الله تعالى يمسك السموات يوم القيامة على إصبع والأرضين على إصبع والجبال والشجر على إصبع والماء والثرى على إصبع وسائر الخلق على إصبع ثم يهزهن فيقول أنا الملك أنا",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 44
  },
  {
    "serial_number": "39698",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 46,
    "volume_number": 1,
    "text": "الملك فضحك الرسول صلى الله عليه وسلم تعجباً مما قال الحَبْر، تصديقاً له ثم قرأ قول الله سبحانه: {وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ وَالْأَرْضُ جَمِيعًا قَبْضَتُهُ يَوْمَ الْقِيَامَةِ وَالسَّموَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ سُبْحَانَهُ وَتَعَالَى عَمَّا يُشْرِكُونَ (67)} [الزمر: 67]. رواه مسلم. صفة الساق: قال تعالى: {يَوْمَ يُكْشَفُ عَنْ سَاقٍ وَيُدْعَوْنَ إِلَى السُّجُودِ فَلَا يَسْتَطِيعُونَ} [القلم: 42]. يوم القيامة يكشف الله عن ساقه فيسجد له المؤمنين وأما الذين كانوا يسجدون رياءً وسمعة في الدنيا فلا يستطيعون أن يسجدوا لله يوم القيامة \" تفسير بن كثير\". صفة المَعِيَّة وهي نوعان: 1 - مَعِيَّة عامة لجميع الخلق: وتعني العلم والإحاطة بالمخلوقات وتأتي في سياق المجازاة والمحاسبة والتخويف وهي المقصودة في قوله سبحانه: {هُوَ الَّذِي خَلَقَ السَّمَوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَى عَلَى الْعَرْشِ يَعْلَمُ مَا يَلِجُ فِي الْأَرْضِ وَمَا يَخْرُجُ مِنْهَا وَمَا يَنْزِلُ مِنَ السَّمَاءِ وَمَا يَعْرُجُ فِيهَا وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ} … [الحديد: 4]. 2 - مَعِيَّة خاصة للمسلمين: وتعني أن الله معهم بنصره وحفظه",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 45
  },
  {
    "serial_number": "39699",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 47,
    "volume_number": 1,
    "text": "وتأييده وتأتي في سياق المدح والثناء وقد ذُكِرَت في قوله عَزَّوَجَلَّ: {إِلَّا تَنْصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُوا ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ وَأَيَّدَهُ بِجُنُودٍ لَمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلَى وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا وَاللَّهُ عَزِيزٌ حَكِيمٌ (40)} [التوبة: 40]. والمَعِيَّة بنوعيها لا تقتضي الحلول والاختلاط لأن الله على عرشه والعرش فوق جميع المخلوقات وليس هناك تعارض بين علوِّه وبين مَعِيَّتِه لخلقه. ومن صفات الله أنه فَعَّال لما يريد لقوله تعالى: {فَعَّالٌ لِمَا يُرِيدُ} [البروج: 16]. وهذه صفة خاصة لله ولا تنبغي لأحدٍ غيره فكل مخلوق لابد أن يعجز عن فعل أشياء يريدها مهما بَلَغَت قُوَّتُه ومُلْكِه. صفة المَكْر بمن يَمْكُر به أو يَمْكُر بالرسول والمسلمين: قال تعالى: {وَيَمْكُرُونَ وَيَمْكُرُ اللَّهُ وَاللَّهُ خَيْرُ الْمَاكِرِينَ} [الأنفال: 30]. صفة المُخَادَعَة بمن يُخَادِعه: قال تعالى: {إِنَّ الْمُنَافِقِينَ يُخَادِعُونَ اللَّهَ وَهُوَ خَادِعُهُمْ وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَى يُرَاءُونَ النَّاسَ وَلَا يَذْكُرُونَ اللَّهَ إِلَّا قَلِيلًا} [النساء: 142].",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 46
  },
  {
    "serial_number": "39700",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 48,
    "volume_number": 1,
    "text": "صفة شدة المِحَال لمن يحتال عليه: قال تعالى: {وَيُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ وَيُرْسِلُ الصَّوَاعِقَ فَيُصِيبُ بِهَا مَنْ يَشَاءُ وَهُمْ يُجَادِلُونَ فِي اللَّهِ وَهُوَ شَدِيدُ الْمِحَالِ} [الرعد: 13]. صفة الكَيد بمن يَكِيد به: قال تعالى: {إِنَّهُمْ يَكِيدُونَ كَيْدًا (15) وَأَكِيدُ كَيْدًا (16)} [الطارق: 15 - 16]. صفة الاستهزاء بمن يستهزئ بالمؤمنين: قال تعالى: {وَإِذَا لَقُوا الَّذِينَ آَمَنُوا قَالُوا آَمَنَّا وَإِذَا خَلَوْا إِلَى شَيَاطِينِهِمْ قَالُوا إِنَّا مَعَكُمْ إِنَّمَا نَحْنُ مُسْتَهْزِءُونَ (14) اللَّهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ (15)} [البقرة: 14 - 15]. صفة السُّخْرِيَة بمن يسخر من المؤمنين: قوله تعالى: {الَّذِينَ يَلْمِزُونَ الْمُطَّوِّعِينَ مِنَ الْمُؤْمِنِينَ فِي الصَّدَقَاتِ وَالَّذِينَ لَا يَجِدُونَ إِلَّا جُهْدَهُمْ فَيَسْخَرُونَ مِنْهُمْ سَخِرَ اللَّهُ مِنْهُمْ وَلَهُمْ عَذَابٌ أَلِيمٌ (79)} [التوبة: 79] والمكر والمخادعة والكيد والمحال والاستهزاء والسخرية من الصفات المقيدة بالكفار وليست من الصفات المطلقة \" ابن عثيمين في لمعة الاعتقاد\" صفة الغضب: قال تعالى: {أَلَمْ تَرَ إِلَى الَّذِينَ تَوَلَّوْا قَوْمًا غَضِبَ اللَّهُ عَلَيْهِمْ مَا هُمْ مِنْكُمْ وَلَا مِنْهُمْ وَيَحْلِفُونَ عَلَى الْكَذِبِ وَهُمْ يَعْلَمُونَ (14)} [المجادلة: 14]",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 47
  },
  {
    "serial_number": "39701",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 49,
    "volume_number": 1,
    "text": "صفة السُّخْط: قال تعالى: {تَرَى كَثِيرًا مِنْهُمْ يَتَوَلَّوْنَ الَّذِينَ كَفَرُوا لَبِئْسَ مَا قَدَّمَتْ لَهُمْ أَنْفُسُهُمْ أَنْ سَخِطَ اللَّهُ عَلَيْهِمْ وَفِي الْعَذَابِ هُمْ خَالِدُونَ (80)} [المائدة: 80] والفرق بينهما أن الغضب يكون من الكبير على الصغير ومن الصغير على الكبير والسخط لا يكون إلا من الكبير على الصغير، كما يُقَال سَخِطَ الأمير على الحاجب ولا يقال سخط الحاجب على الأمير. صفة الأَسَف: قال تعالى: {فَلَمَّا آَسَفُونَا انْتَقَمْنَا مِنْهُمْ} [الزخرف: 55] والأسف هو أَشَدَّ الغضب صفة الكراهية: قال تعالى: {وَلَوْ أَرَادُواْ الْخُرُوجَ لَأَعَدُّواْ لَهُ عُدَّة وَلَكِن كَرِهَ اللَّهُ ان بِعَاثَهُمْ فَثَبَّطَهُمْ وَقِيلَ اقْعُدُواْ مَعَ الْقَاعِدِينَ} [التوبة: 46] صفة البُغْض: قال النبي صلى الله عليه وسلم: \" أحب البلاد إلى الله مساجدها، وأبغض البلاد إلى الله أسواقها\" رواه مسلم. صفة المَقْتَ: والمَقْت هو أَشَدَّ البُغْض. قال تعالى: {كبر مَقْتًا عِنْدَ اللَّهِ أَنْ تَقُولُوا مَا لَا تَفْعَلُونَ (3)} [الصف: 3]",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 48
  },
  {
    "serial_number": "39702",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 50,
    "volume_number": 1,
    "text": "صفة الانتقام: قال تعالى: {إِنَّا مِنَ الْمُجْرِمِينَ مُنْتَقِمُونَ (22)} [السجدة: 22] صفة اللَّعْن: قال تعالى: {قُلْ هَلْ أُنَبِّئُكُم بِشَرّ مِّن ذَلِكَ مَثُوبَةً عِندَ اللَّهِ مَن لَّعَنَهُ اللَّهُ وَغَضِبَ عَلَيْهِ وَجَعَلَ مِنْهُمُ الْقِرَدَةَ وَالْخَنَازِيرَ وَعَبَدَ الطَّاغُوتَ أُوْلَئِكَ شَرٌّ مَّكَانا وَأَضَلُّ عَن سَوَاءِ السَّبِيلِ (60)} [لمائدة: 60] واللعن هو الطَّرد والإبعاد عن رحمه الله صفة البَطْش: قال تعالى: {إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ (12)} [البروج: 12] يعني أن الله يأخذ الظالمين بالعذاب صفة النور: ذاته نور ووجهه نور سبحانه قال تعالى: {وَأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّهَا وَوُضِعَ الْكِتَابُ وَجِيءَ بِالنَّبِيِّينَ وَالشُّهَدَاءِ وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ وَهُمْ لَا يُظْلَمُونَ (69)} [الزمر: 69] صفة الفَرَح: وردت في الحديث أن النبي عليه الصلاة والسلام قال: \" لله أشد فرحًا بتوبة عبده حين يتوب إليه من أحدكم كان على راحلته بأرض فلاة فانفلتت منه وعليها طعامه وشرابه فأيس منها فأتي شجرة فاضطجع في ظلها قد أيس من راحلته فبينا هو كذلك إذا هو بها قائمة عنده فأخذ بخطامها ثم قال من شدة الفرح اللهم أنت عبدي وأنا ربك",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 49
  },
  {
    "serial_number": "39703",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 51,
    "volume_number": 1,
    "text": "أخطأ من شدة الفرح\" رواه البخاري ومسلم واللفظ له صفة الضَّحِك: قال عليه الصلاة والسلام: \" يضحك الله إلى رجلين يقتل أحدهما الآخر يدخلان الجنة، يقاتل هذا في سبيل الله فيُقتَل، ثم يتوب الله على القاتل فيُستَشْهَد\" رواه البخاري ومسلم ونحن نثبت الضحك والفرح لله عَزَّوَجَلَّ على وجه الكمال وليست مثل ضحك وفرح البشر صفة العَجَب: قال عليه الصلاة والسلام: \" قد عجب الله من صنيعكما بضيفكما الليلة\" رواه مسلم يعني عَجَب استحسان مما صنعاه بضيفهما، وليس مثل عجب المخلوق الذي معناه الدهشة من أمر غير متوقع صفة الإرادة وهي نوعان: 1 - الإرادة الكونية: بمعنى المشيئة وهذه لابد من وقوعها وتتعلق بما يحبه الله وما لا يحبه وقد وردت في قوله تعالى: {إِنَّمَا أَمْرُهُ إِذَا أَرَادَ شَيْئًا أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ (82)} … [يس: 82] 2 - الإرادة الشرعية: بمعنى المحبة وهذه لا يلزم من وقوعها ولا تتعلق إلا بما يحبه الله وقد وردت في قوله تعالى: {يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ (185)} [البقرة: 185]",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 50
  },
  {
    "serial_number": "39704",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 52,
    "volume_number": 1,
    "text": "أي أن الله يريد بالمسلمين اليُسر صفة الكلام: قال تعالى: {وَكَلَّمَ اللَّهُ مُوسَى تَكْلِيمًا (164)} [النساء: 164] وهو كلام حقيقي بحرف وصوت صفة القول: قال تعالى: {وَمَنْ أَصْدَقُ مِنَ اللَّهِ قِيلًا (122)} [النساء: 122] صفة الحديث: قال عَزَّوَجَلَّ {اللَّهُ لَا إِلَهَ إِلَّا هُوَ لَيَجْمَعَنَّكُمْ إِلَى يَوْمِ الْقِيَامَةِ لَا رَيْبَ فِيهِ وَمَنْ أَصْدَقُ مِنَ اللَّهِ حَدِيثًا (87)} [النساء: 87] صفة المُنَاداة: صفة المُنَاجاة: صفتان لله قد وردت في قوله تعالى: {وَنَادَيْنَاهُ مِن جَانِبِ الطُّورِ الْأَيْمَنِ وَقَرَّبْنَاهُ … نَجِيّا (52)} [مريم: 52] والفرق بينهما أن المناداة تكون للبعيد والمناجاة للقريب وكلاهما كلام. صفة الرضا: قال تعالى: {رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ذَلِكَ لِمَنْ خَشِيَ رَبَّهُ (8)} [البينة: 8]",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 51
  },
  {
    "serial_number": "39705",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 53,
    "volume_number": 1,
    "text": "صفة المحبة: قال تعالى: {إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُمْ بُنْيَانٌ مَرْصُوصٌ (4)} [الصف: 4] صفة البَرَكَة: قال تعالى: {رَحْمَتُ اللَّهِ وَبَرَكَاتُهُ عَلَيْكُمْ أَهْلَ الْبَيْتِ} [هود: 73] والبَرَكَة هي كثرة الخير ودوامه صفة الاستواء على العرش قال تعالى: {الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى (5)} طه يعني \" علا على العرش\" \" تفسير الطبري\". والعرش هو سرير الملك \" فتح رب البرية بتلخيص الحموية لابن عثيمين\" صفة المجيء: صفة الإتيان: وذلك أن الله يجيء ويأتي لفصل القضاء بين العباد يوم القيامة كما قال تعالى: {وَجَاءَ رَبُّكَ وَالْمَلَكُ صَفًّا صَفًّا (22)} [الصف: 22] وقوله عَزَّوَجَلَّ: {هَلْ يَنْظُرُونَ إِلَّا أَنْ يَأْتِيَهُمُ اللَّهُ فِي ظُلَلٍ مِنَ الْغَمَامِ وَالْمَلَائِكَةُ وَقُضِيَ الْأَمْرُ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ (210)} [البقرة: 210]",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 52
  },
  {
    "serial_number": "39706",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 54,
    "volume_number": 1,
    "text": "صفة الإحياء: صفة الإماتة: صفتان لله وردت في قوله تعالى: {هُوَ الَّذِي يُحْيِي وَيُمِيتُ فَإِذَا قَضَى أَمْرًا فَإِنَّمَا يَقُولُ لَهُ كُنْ فَيَكُونُ (68)} [غافر: 68] فالله سبحانه يُحْيِي ويُمِيت وهو حي لا يموت صفة نزول الله إلى السماء الدنيا في الثلث الآخر من الليل: قال النبي صلى الله عليه وسلم: \" ينزل ربنا تبارك وتعالى كل ليلة إلى السماء الدنيا حين يبقى ثلث الليل الآخر يقول: من يدعوني فأستجيب له من يسألني فأعطيه من يستغفرني فأغفر له\" رواه البخاري ومسلم. وهذا يدل على فضل وقت الثلث الآخر من الليل. * هناك صفات متنوعة اللفظ مشتركة في أصل المعنى مثل: (الغضب والسخط والأسف). (البغض والكراهية والمقت). (المكر والكيد والمحال والمخادعة). فالسخط والأسف من جنس الغضب، والبُغض والكراهية والمقت أصلها واحد، والمكر والكيد والمِحَال والمُخَادعة متقاربة مع بعضها البعض.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 53
  },
  {
    "serial_number": "39707",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "الحق والثبات في الأسماء والصفات",
    "edition": "الأولى، 1442 هـ - 2021 م",
    "publisher": "دار الصميعي للنشر والتوزيع",
    "page_number": 55,
    "volume_number": 1,
    "text": "فبعض الصفات تكون متقاربة في المعنى لكن لا يعني ذلك أنه لا فرق بين معانيها بل يوجد فرق لكنه بسيط. تم والحمد لله، نسأل الله عَزَّوَجَلَّ أن يعلمنا وأن ينفعنا بما علمنا إنه على كل شيء قدير. وصلى الله وسلم على سيدنا محمد وعلى اله وصحبه أجمعين • • •",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 54
  }
]