[
  {
    "text": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "category_id": "18",
    "category": "General Fiqh",
    "new_page_number": 1
  },
  {
    "text": "sn: 4514\nbook_title: حجة النبي صلى الله عليه وسلم كما رواها عنه جابر رضي الله عنه\nbook_link: https://shamela.ws/book/399\nbook_id: 399\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: المكتب الإسلامي - بيروت\nedition: الخامسة - 1399\npages: 148\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الفقه العام\ncategory_id: 18",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "category_id": "18",
    "category": "General Fiqh",
    "new_page_number": 2
  },
  {
    "serial_number": "4358588",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: General Jurisprudence\nBook: The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him\nAuthor: Muhammad Nasir al-Din al-Albani (d. 1420 AH)\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nBook: The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him\nAuthor: Muhammad Nasir al-Din al-Albani (d. 1420 AH)\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nAuthor: Muhammad Nasir al-Din al-Albani (d. 1420 AH)\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\n[Book numbering matches printed version]\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 3
  },
  {
    "serial_number": "4358589",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 1,
    "volume_number": 1,
    "text": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him\n(Take from me your rituals, for I do not know, perhaps I will not perform Hajj after this year of mine) Noble Hadith\nAuthored by: Muhammad Nasir al-Din al-Albani\nFifth Edition - 1399 AH - Beirut\nAl-Maktab Al-Islami - Beirut",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 4
  },
  {
    "serial_number": "4358590",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 2,
    "volume_number": 1,
    "text": "Indeed, all praise is due to Allah. We praise Him, seek His help, and ask His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whoever Allah guides, there is no misleader for him, and whoever He leaves astray, there is no guide for him. I bear witness that there is no god but Allah alone, having no partner, and I bear witness that Muhammad is His slave and Messenger. As for what follows:\nThis is the second edition of our book (The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him). We resolved to reprint it after its copies became scarce and demand for it increased from many Islamic countries. I re-examined it and added some sentences to its text which I recovered from hadith sources that had not been printed before or whose copies were rare, such as (Mawarid al-Zaman ila Zawa'id Ibn Hibban), (Al-Muntaqa) by Ibn Al-Jarud, (Tabaqat Ibn Sa'd), and some manuscripts [2]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 5
  },
  {
    "serial_number": "4358591",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 3,
    "volume_number": 1,
    "text": "However, I added to it many comments containing abundant benefits, mostly in clarifying some rituals that had escaped me or were not feasible for me to include in its previous edition. Then I appended it with a supplement in which I mentioned a large section of the innovations that some pilgrims fall into from the time they resolve to travel until they return to their families. I included in it the innovations of visiting the Prophet's Mosque and Bayt al-Maqdis (Jerusalem) because many pilgrims combine Hajj with travel to the Prophet's Mosque and Al-Aqsa Mosque. That is a legislated matter encouraged, although it is absolute and not restricted to Hajj, so it is legislated with Hajj before or after it, and without it. I have some advice I wish to present to the noble readers and pilgrims to the Sacred House of Allah, hoping that Allah, Blessed and Exalted, will benefit them with it and write for me the reward of guiding to good by His permission. Indeed, He is capable of whatever He wills and worthy of answering. Undoubtedly, the door of advice is very wide. Therefore, I will select from it what I know many pilgrims are ignorant of or neglectful about. I ask Allah Almighty to teach us what benefits us and grant us success to act upon it, for He is the best One asked [3]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 6
  },
  {
    "serial_number": "4358592",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 4,
    "volume_number": 1,
    "text": "First: Many pilgrims, when they enter Ihram for Hajj, do not feel at all that they have entered into an act of worship that obligates them to stay away from what Allah Almighty has forbidden for them specifically and for every Muslim generally. Likewise, you see them perform Hajj and finish it without any change in their deviant behavior from before Hajj. That is practical proof from them that their Hajj is not complete, if not to say: not accepted. Therefore, every pilgrim must remember this and strive to the best of his ability not to fall into what Allah has forbidden him of immorality and sins. For Allah, Blessed and Exalted, says: (Hajj is [during] well-known months, so whoever has made Hajj obligatory upon himself therein [by entering the state of Ihram], there is [to be for him] no sexual relations and no disobedience and no disputing during Hajj) - Al-Baqarah: 197. And the Messenger of Allah, peace be upon him, said: (Authentic) (Whoever performs Hajj and does not have sexual relations nor commits sin, returns from his sins as the day his mother bore him) extracted by the Two Sheikhs. 'Rafath' is sexual intercourse. Sheikh al-Islam Ibn Taymiyyah said: (And there is nothing among the prohibitions that invalidates Hajj except the genus of sexual intercourse (Rafath), that is why He distinguished between it and Fusuq (disobedience). As for other prohibitions like clothing and perfume, even if one sins by them, they do not invalidate Hajj according to any of the famous Imams). He refers at the end of his speech to the fact that there are scholars who say [4]\n\nthat Hajj is invalidated by any sin the pilgrim commits. Among these is Imam Ibn Hazm, may Allah have mercy on him, for he says: (And whoever intentionally commits a sin, whatever sin it may be, while remembering his Hajj, from the time he completes his Tawaf of the House for Ifadah and stones the Jamrah, his Hajj is invalidated...) and he used the previous verse as evidence. So refer to his book (Al-Muhalla) (7 / 186) for it is important. From the foregoing, it becomes clear that sin from the pilgrim either invalidates his Hajj according to Ibn Hazm's opinion, or he incurs sin by it. But this sin is not like if it issued from a non-pilgrim; rather, it is much more dangerous. For among its effects is that he does not return from his sins as his mother bore him, as stated in the previous hadith. Thus, it is as if he lost his Hajj because he did not obtain the fruit from it, which is the forgiveness of Allah Almighty. So Allah's help is sought. If this is clear, I must warn against some sins which people are frequently afflicted with, and they enter Ihram for Hajj without feeling at all that they must give them up. That is due to their ignorance, the prevalence of heedlessness over them, and their imitation of their fathers.",
    "foot_note": "None\n\nNone",
    "book_id": "399",
    "new_page_number": 7
  },
  {
    "serial_number": "4358594",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 5,
    "volume_number": 1,
    "text": "1 - Polytheism (Shirk) with Allah Almighty: For one of the greatest calamities that some Muslims have been afflicted with is their ignorance [5]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 8
  },
  {
    "serial_number": "4358595",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 6,
    "volume_number": 1,
    "text": "of the reality of Shirk, which is one of the greatest major sins, and one of its characteristics is that it nullifies deeds: (If you should associate [anything] with Allah, your work would surely become worthless) - Az-Zumar: 65. We have seen many pilgrims falling into Shirk while they are in the Sacred House of Allah and in the Mosque of the Prophet, peace be upon him. They leave supplicating to Allah and seeking His aid for seeking help from prophets and righteous people, swearing by them, and invoking them besides Allah Almighty. And Allah Almighty says: (If you invoke them, they do not hear your supplication; and if they heard, they would not respond to you. And on the Day of Resurrection they will deny your association. And none can inform you like [one] Acquainted [with all matters]) - Fatir: 14. The verses with this meaning are very many, and this is sufficient for one who opens his heart to guidance. Since the purpose now is not deep research into this issue but only reminding. I wonder what these people benefit from their Hajj to the Sacred House of Allah if they insist on such Shirk and change its name, calling it: Tawassul (seeking means), Tashaffu' (seeking intercession), and Wasitah (intermediary). Is this not the intermediary that the polytheists of old claimed to justify their Shirk and worship of others besides Him, Blessed and Exalted: (And those who take protectors besides Him [say], \"We only worship them that they may bring us nearer to Allah in position\") - Az-Zumar: 3 [6]\n\nSo O pilgrim, before you resolve to perform Hajj, it is an individual obligation upon you to hasten to know pure Monotheism (Tawhid) and what contradicts it of Shirk, by studying the Book of Allah and the Sunnah of His Prophet, peace be upon him. For whoever holds fast to them is saved, and whoever deviates from them is led astray. And Allah's help is sought.",
    "foot_note": "None\n\nNone",
    "book_id": "399",
    "new_page_number": 9
  },
  {
    "serial_number": "4358597",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 7,
    "volume_number": 1,
    "text": "2 - Adorning oneself by shaving the beard: This sin is one of the most common sins among Muslims in this era due to the disbelievers' domination over most of their lands and their transfer of this sin to them, and Muslims imitating them in it despite his prohibition, peace be upon him, to them regarding that explicitly in his saying, peace be upon him: (Authentic) (Oppose the polytheists: trim the mustaches and grow the beards) narrated by the Two Sheikhs. And in another hadith: (And oppose the People of the Book). In this ugly act are several violations: First: Opposing his explicit command, peace be upon him, to grow it. Second: Imitating the disbelievers. Third: Changing Allah's creation, which involves obedience to Satan in his saying as Allah Almighty recounted that about him: (and I will command them so they will change the creation of Allah). Fourth: Imitating women, and the Messenger of Allah, peace be upon him, cursed whoever does [7]\n\nthat. See the details of this summary in our book (Adab al-Zifaf fi al-Sunnah al-Mutahharah) (p. 126 - 131). One of the observations seen by the one keen on his religion is that masses of pilgrims have let their beards grow due to their Ihram. So when they come out of it, instead of shaving their heads as the Messenger of Allah, peace be upon him, encouraged, they shave their beards which he, peace be upon him, ordered them to grow. Indeed to Allah we belong and indeed to Him we return.",
    "foot_note": "None\n\nNone",
    "book_id": "399",
    "new_page_number": 10
  },
  {
    "serial_number": "4358599",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 8,
    "volume_number": 1,
    "text": "3 - Men wearing gold rings: We have seen many pilgrims adorned with a gold ring. Upon discussing this with them, it became clear that they are of three types: Some of them do not know its prohibition, so they would hasten to remove it after we mention to them some of the prohibiting texts like the hadith: (Authentic) (He, peace be upon him, forbade the gold ring) Agreed upon. And his saying, peace be upon him: (Authentic) (Does one of you intentionally take a coal of fire and put it in his hand?) narrated by Muslim. Some of them know of the prohibition but follow their desires, so for this one we have no way but for Allah to guide him. And some of them admit the prohibition but offer an excuse - which is, as they say, uglier than a sin - saying: It is an engagement ring. And the poor man does not know [8]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 11
  },
  {
    "serial_number": "4358600",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 10,
    "volume_number": 1,
    "text": "that by doing so he combines two sins: Opposing his explicit prohibition, peace be upon him, as preceded, and imitating the disbelievers, because the engagement ring was not known among Muslims until before this era, then this custom spread to them from the traditions of the Christians. I have detailed the discussion on this issue in (Adab al-Zifaf) as well (p. 131 - 138) and clarified in it that the mentioned prohibition includes women as well, contrary to the majority, so refer to (p. 139 - 167) for it is very important. Second: We advise everyone who wants to perform Hajj to study the rituals of Hajj in the light of the Book and the Sunnah before embarking on the Hajj actions so that it may be complete and accepted by Allah Blessed and Exalted. I only said: based on the Book and the Sunnah, because disagreement has occurred in the rituals - regrettably - just as it occurred in other acts of worship. For example: Is it better to intend Tamattu', Qiran, or Ifrad in his Hajj? There are three schools of thought. What we see regarding that is only Tamattu', which is the Madhhab of Imam Ahmad and others. Rather, some verifying scholars went so far as to say it is obligatory if he does not drive the sacrificial animal (Hady) with him, among them Ibn Hazm [10]\n\nand Ibn al-Qayyim, following Ibn Abbas and others from the Salaf. You find the detailed discussion on that in the book (Al-Muhalla) and (Zad al-Ma'ad) and others. I do not wish now to delve into this issue in detail, but rather I want to mention a brief word that will benefit, God willing, whoever is sincere and whose goal is following the truth, not imitating fathers or the Madhhab. So I say: There is no doubt that Hajj, at the beginning of his resumption of it, peace be upon him, was permissible in its three aforementioned types. Likewise, his companions, peace be upon him, some were Mutamatte', some were Qarin, and some were Mufrid, because he, peace be upon him, gave them the choice in that as in the hadith of Aisha, may Allah be pleased with her: (Authentic) (We went out with the Messenger of Allah, peace be upon him, and he said: Whoever among you wants to assume Ihram for Hajj and Umrah, let him do so. And whoever wants to assume Ihram for Hajj, let him assume Ihram. And whoever wants to assume Ihram for Umrah, let him assume Ihram...) The hadith narrated by Muslim. This choice was at the beginning of their Ihram at the Tree (1) as in a narration by Ahmad (6 / 245). However, the Prophet, peace be upon him, did not continue with this choice; rather, he moved them to what is better, which is Tamattu', without imposing it on them or commanding them to do it, and that was on various occasions in",
    "foot_note": "None\n\n1. (1) Meaning at Dhu al-Hulayfah \n[10].",
    "book_id": "399",
    "new_page_number": 12
  },
  {
    "serial_number": "4358602",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 11,
    "volume_number": 1,
    "text": "their way to Mecca. Among that is when they reached (Sarif), a place near Al-Tan'im, about ten miles from Mecca. Aisha said in a narration from her: (Sahih) (...So we camped at Sarif, and the Prophet (peace be upon him) said to his companions: 'Whoever does not have a sacrificial animal (Hady) with him and wishes to make it an Umrah, let him do so, and whoever has a sacrificial animal with him, let him not.' She said: So among his companions, there were those who took it and those who left it [from those who did not have Hady]...) The Hadith is agreed upon, and the addition is from Muslim. And among that is when he (peace be upon him) reached (Dhu Tuwa), a place near Mecca, and spent the night there. When he prayed Fajr, he said to them: (Sahih) ('Whoever wishes to make it an Umrah, let him make it an Umrah'). Recorded by the two Sheikhs from the Hadith of Ibn Abbas. However, we saw him (peace be upon him) when he entered Mecca and performed the Arrival Tawaf (Tawaf al-Qudum) along with his companions, he did not leave them on the previous ruling which was merely preference; rather, he moved them to a new ruling which is obligation. He commanded those among them who did not drive the Hady to annul the Hajj into an Umrah and exit Ihram. Aisha (may Allah be pleased with her) said: (Sahih) ('We went out with the Prophet (peace be upon him) not considering it anything but Hajj. When we arrived in Mecca, we circumambulated the House, and the Prophet (peace be upon him) commanded those who had not driven the Hady to exit Ihram. She said: So those who had not driven the Hady exited Ihram, and his wives had not [11]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 13
  },
  {
    "serial_number": "4358603",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 12,
    "volume_number": 1,
    "text": "driven [the Hady], so they exited Ihram...') The Hadith is agreed upon. And from Ibn Abbas similar to it with the wording: (Sahih) ('So he commanded them to make it an Umrah. That seemed momentous to them, so they said: \"O Messenger of Allah, what kind of Hal (exiting Ihram)?\" He said: \"The complete Hal.\"') Agreed upon. And in the Hadith of Jabir is similar to it and clearer than it, as will come in paragraph (33-45). I say: Whoever contemplates these authentic Hadiths, it will become clear to him with a clarity unmixed with doubt that the choice mentioned in them was only from him (peace be upon him) to prepare the souls and ready them to accept a new ruling that might be difficult for some to accept easily at first glance. That is the command to annul the Hajj into an Umrah, especially since they used to in the Days of Ignorance - as is established in the (Two Sahihs) - consider that Umrah is not permissible in the months of Hajj. And this opinion, even if the Messenger of Allah (peace be upon him) had invalidated it by him (peace be upon him) performing Umrah three times in three years, all of them in the month of Dhu al-Qi'dah, this alone, even if it was sufficient to invalidate that Jahiliyyah innovation, implies - and there is no contextual indicator here, rather it is not sufficient - Allah knows best - to prepare the souls to accept the new ruling. Therefore, he (peace be upon him) paved the way for it by giving them the choice between Hajj and Umrah while explaining what is best for them, then he followed that with the decisive command to annul the Hajj into an Umrah as preceded [12]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 14
  },
  {
    "serial_number": "4358604",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 13,
    "volume_number": 1,
    "text": "So if we know that, then this command is definitively for obligation. The following matters indicate this: First: The default in it is obligation unless there is a contextual indicator [to the contrary], and there is no contextual indicator here. Rather, the contextual indicator here confirms it, which is the following matter: Second: That when he (peace be upon him) commanded them, it seemed momentous to them as preceded just now. If it were not for obligation, they would not have found it momentous. Do you not see that he (peace be upon him) had commanded them before three times with a command of choice, yet they did not find it momentous? This indicates that they understood obligation from the command, and that is what is intended. Third: That in a narration in the Hadith of Aisha (may Allah be pleased with her), she said: (Sahih) (...He entered upon me while he was angry. I said: \"Who has angered you, O Messenger of Allah? May Allah admit him to the Fire.\" He said: \"Have you not felt that I commanded the people with a command, and behold, they are hesitating? Al-Hakam said: As if they are hesitating. I think [he said]: 'And if I had faced my affair as I have turned my back on it, I would not have driven the Hady with me until I bought it, then I would have exited Ihram as they exited.'\") Narrated by Muslim, Al-Bayhaqi, and Ahmad (6 / 175). So in his anger (peace be upon him) is clear evidence that his command was for obligation, especially since his anger (peace be upon him) was only because of their hesitation, not because of their refusal to execute the command - far be it from them to do that. Therefore, they all exited Ihram except for those who had Hady with them, as will come in paragraph (44) [13]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 15
  },
  {
    "serial_number": "4358605",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 14,
    "volume_number": 1,
    "text": "Fourth: His saying (peace be upon him) when they asked him about the annulment which he commanded them: ('Is it for this year of ours or for forever and ever?') So he (peace be upon him) interlaced his fingers one into another and said: ('Umrah has entered into Hajj until the Day of Resurrection. No, rather for forever and ever. No, rather for forever and ever.') As will come in paragraph (24). This is a clear text that Umrah has become an indivisible part of Hajj and that this ruling is not specific to the Companions as some think, rather it continues forever. (1) Fifth: If the command were not for obligation, it would have sufficed for some of the Companions to execute it. So how [can that be] when we have seen the Messenger of Allah (peace be upon him) not satisfying himself with commanding the people to annul generally? For sometimes he commands his daughter Fatimah (may Allah be pleased with her) with that, as will come (paragraph 48), and sometimes he commands his wives with it, as in the (Two Sahihs) from Ibn Umar that the Prophet (peace be upon him) commanded his wives to exit Ihram in the year of the Farewell Hajj. Hafsah said: So I said: \"What prevents you from exiting Ihram?\" He said: ('I have matted my hair...') The Hadith. And when Abu Musa came from Yemen as a pilgrim, he (peace be upon him) said to him: ('With what have you assumed Ihram?') He said: \"I assumed Ihram with the Ihram of the Prophet (peace be upon him).\" He said: \"Have you driven the Hady?\" He said: \"No.\" He said: ('Then circulate around the House and between Safa and Marwah, then exit Ihram...') The Hadith.",
    "foot_note": "1. (1) We have refuted those who claim specificity in the commentary on the referred paragraph of the book, page (63) \n[14].",
    "book_id": "399",
    "new_page_number": 16
  },
  {
    "serial_number": "4358606",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 15,
    "volume_number": 1,
    "text": "Does this intense eagerness from the Prophet (peace be upon him) to convey his command of annulment to every responsible person not indicate obligation? By Allah, indeed obligation is established by less than this. Due to the clarity of these evidences indicating the obligation of annulment - let alone Tamattu' - the opposers had no choice but to submit to their indication. Then they differed in answering them. Some claimed it was specific to the Companions, and you have known the falsehood of that from what preceded. And some claimed it was abrogated, but they were unable to mention even a single evidence worth mentioning and refuting, except for the prohibition of Umar (may Allah be pleased with him) and likewise Uthman and Ibn Al-Zubayr, as in the (Two Sahihs) and others. The answer is from several aspects: First: That those who use this prohibition as proof against Mut'ah (Tamattu') do not hold that view, because their school of thought allows it. So whatever their answer is to it, is our answer. Second: That this prohibition was opposed by a group of the Companions of the Prophet (peace be upon him), among them Ali, Imran bin Husain, Ibn Abbas, and others. Third: That it is an opinion contrary to the Book, let alone the Sunnah. Allah said: [15]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 17
  },
  {
    "serial_number": "4358607",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 16,
    "volume_number": 1,
    "text": "The Exalted said: (Then whoever performs 'Umrah [during the Hajj months] followed by Hajj [offers] what can be obtained with ease of sacrificial animals) Al-Baqarah: 196. Imran bin Husain (may Allah be pleased with him) pointed to this meaning by his saying: (Sahih) ('We performed Tamattu' with the Messenger of Allah (peace be upon him) and the Quran was not revealed regarding it [forbidding it] (and in a narration: The verse of Mut'ah was revealed in the Book of Allah - meaning Mut'ah of Hajj - and the Messenger of Allah (peace be upon him) commanded us with it until he died). A man said with his opinion after that what he wished.') Narrated by Muslim. Umar (may Allah be pleased with him) explicitly stated the legitimacy of Tamattu' and that his prohibition of it or his dislike for it was only an opinion he held for a reason that appeared to him. He said: (Sahih) ('I knew that the Prophet (peace be upon him) and his companions did it, but I disliked that they would remain *mu'arrisiin* with them (1) in the Arak (2) then go for Hajj while their heads were dripping') Narrated by Muslim and Ahmad. Among the matters that draw the attention of the researcher is that this reason which",
    "foot_note": "1. (1) Meaning having intercourse with their women \n2. Meaning in the shelter of the Arak trees, a metonymy for being concealed by it. It is a tree from the Hamd (salt bush) used for Siwak. It is also a place at Arafat, but it is not intended here, contrary to some commentators on Muslim, because the pilgrims in this place would be in Ihram and are not permitted to have intercourse with their women \n[16].",
    "book_id": "399",
    "new_page_number": 18
  },
  {
    "serial_number": "4358608",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 17,
    "volume_number": 1,
    "text": "Umar (may Allah be pleased with him) relied upon for his dislike of Tamattu' is the very same one that the Companions, who did not hasten to execute his command (peace be upon him) to annul, used as an excuse for leaving the immediate action. They said: ('We went out as pilgrims not desiring anything but Hajj. Until there was only four nights between us and Arafat, he commanded us to go in unto our women, so we would come to Arafat with our male organs dripping with semen from the women...') See paragraph (40). The Prophet (peace be upon him) rejected that by his saying: ('Is it by Allah that you teach me, O people? You have known that I am the most God-fearing of you to Allah, the most truthful of you, and the most righteous of you. Do what I command you, for were it not for my Hady, I would have exited Ihram as you exit.') (Paragraph 42). This clarifies to us that if Umar (may Allah be pleased with him) had recalled, when he disliked Tamattu' for the people, this statement of the Companions which is like his statement, and remembered with it the rebuttal of the Prophet (peace be upon him) to them, he would not have disliked that nor forbidden the people from it. In this is evidence that a Sunnah of the Messenger of Allah (peace be upon him) or a saying of his sayings may be hidden from a noble Companion, so he performs Ijtihad with his opinion and errs, and he is despite that rewarded, not burdened with sin. Infallibility belongs to Allah alone, then to His Messenger. A sayer might say: \"What you mentioned of evidences for the obligation of Tamattu' and for rejecting what contradicts it is clear and acceptable, but it is problematic due to what some mention [17]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 19
  },
  {
    "serial_number": "4358609",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 18,
    "volume_number": 1,
    "text": "that the Rightly Guided Caliphs all performed Ifrad for Hajj, so how is the reconciliation between this and what you mentioned? The answer: It has previously been explained that Tamattu' is only obligatory upon the one who did not drive the Hady. As for the one who drove the Hady, that is not obligatory upon him; rather, it is not permissible for him. Instead, he must perform Qiran, which is best, or perform Ifrad. So it is probable that what was reported about the Caliphs regarding Ifrad is only because they had driven the Hady. In that case, there is no contradiction, and all praise is due to Allah. The summary of the speech: Every person who intends Hajj must perform his Ihram for Umrah, then exit from it after finishing the Sa'i between Safa and Marwah by shortening his hair. On the eighth day of Dhu al-Hijjah, he assumes Ihram for Hajj. So whoever had stated Talbiyah for Qiran or Ifrad must annul that into Umrah in obedience to his Prophet (peace be upon him). And Allah Almighty says: (He who obeys the Messenger has obeyed Allah) - An-Nisa: 80. After that, the Mutamatti' (one performing Tamattu') must offer a Hady on the Day of Sacrifice or during the Days of Tashreeq. It is from the completeness of the ritual, and it is a blood of gratitude, not a blood of reparation. It is - as Ibn al-Qayyim said - in the status of the Udhiyah (sacrifice) for the resident, and it is from the completeness of the worship of this day. So the ritual that includes blood is like the Eid that includes the Udhiyah, and it is among the best of deeds. It has come through paths that the Prophet (peace be upon him) was asked: Which deeds are best? [18]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 20
  },
  {
    "serial_number": "4358610",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 19,
    "volume_number": 1,
    "text": "(Sahih) ('Al-Ajj and Al-Thajj') Ibn Khuzaymah, Al-Hakim, and Al-Dhahabi authenticated it, and Al-Mundhiri classified it as Hasan. Al-Ajj is raising the voice with Talbiyah, and Al-Thajj is the spilling of the blood of the Hady. He must eat from his Hady as the Messenger of Allah (peace be upon him) did, as will be explained (paragraph 90), and due to the saying of the Mighty and Majestic regarding what is slaughtered of the Hady in Mina: (So eat of them and feed the miserable and poor) - Al-Hajj: 28. We have contacted many pilgrims and learned from them that despite knowing that Tamattu' is better than Ifrad, they used to perform Ifrad and then perform Umrah after Hajj from Al-Tan'im, in order to avoid the obligation of Hady. In this is opposition to the Wise Lawgiver and a trickery against His law, the corruption of which is not hidden. For Allah, in His wisdom, legislated Umrah before Hajj, while they reverse that. And He made Hady obligatory upon the Mutamatti', while they flee from it. This is not from the deeds of the pious. Then they hope that Allah accepts their Hajj and forgives their sin. Far be it, far be it! For (Allah only accepts from the righteous [who fear Him]) - Al-Ma'idah: 27, not from the stingy tricksters. So be, O pilgrim, fearful of your Lord, following the Sunnah of your Prophet in your rituals, perchance you may return free of your sins as the day your mother gave birth to you. Third: And beware, my brother, of leaving the overnight stay in Mina on the night of Arafat, and likewise [19]\n\nthe overnight stay in Muzdalifah on the night of Sacrifice, for that is from the guidance of your Prophet (peace be upon him). Especially since the overnight stay in Muzdalifah until dawn is a pillar among the pillars of Hajj according to the most correct of the sayings of the people of knowledge. Do not be deceived by the embellished speech of some of those called (Mutawwifs), for they have no concern except collecting money and reducing the work for which they took the wage sufficient and ample for performing it completely. It is the same to them after that whether your Hajj is complete or deficient, whether you followed the Sunnah of your Prophet or opposed it. Fourth: And beware also, my brother, of passing in front of anyone praying in the Sacred Mosque (Al-Masjid Al-Haram) and in other mosques, due to his saying (peace be upon him): (Sahih) ('If the one passing in front of the praying person knew what was upon him, it would be better for him to stand for forty than to pass in front of him.') The narrator said: I do not know if he said: forty days, or months, or years. Narrated by the two Sheikhs in their (Two Sahihs). And just as this is not permissible for you, it is also not permissible for you to pray towards other than a Sutrah (barrier). Rather, you must pray towards anything that prevents people from passing in front of you. If anyone wants to cross between you and your Sutrah, you must prevent him. Regarding that are Hadiths and reports, I will mention some of them:",
    "foot_note": "None\n\nNone",
    "book_id": "399",
    "new_page_number": 21
  },
  {
    "serial_number": "4358612",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 20,
    "volume_number": 1,
    "text": "1 - (Sahih) ('If one of you places in front of him something like the back of a saddle, let him pray and not care who passes beyond that') [20]\n\n2 - (Sahih) ('If one of you prays towards something that screens him from the people, and someone wants to cross in front of him, let him push him in the chest and repel him as much as he can. If he refuses, then let him fight him, for he is only a devil.') (1)\n\n3 - Yahya bin Kathir said: (Sahih) ('I saw Anas bin Malik enter the Sacred Mosque, so he set up something or prepared something to pray towards.') Narrated by Ibn Sa'd (7 / 18) with a Sahih chain.",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 22
  },
  {
    "serial_number": "4358615",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 21,
    "volume_number": 1,
    "text": "4 - From Salih bin Kaysan, he said: (Sahih) ('I saw Ibn Umar praying inside the Kaaba and he would not let anyone pass in front of him.') Narrated by Abu Zur'ah Al-Razi in (Tarikh Dimashq) (91 / 1) (2) and likewise Ibn Asakir in (Tarikh Dimashq) (8 / 106 / 2) with a Sahih chain. So in the first Hadith is the obligation of taking a Sutrah, and that if he does that, he is not harmed by whoever passes beyond it. And in the second Hadith: The obligation of pushing back the one passing in front of the praying person if he is praying towards a Sutrah, and the prohibition of passing intentionally, and that the doer of that is a devil. I wonder, what is the gain that the pilgrim returns with if he returns having deserved this name: (The Devil)?",
    "foot_note": "1. (1) Two Sahih Hadiths extracted in our \"Description of Prayer\" (51 / 53 Third Edition) which is currently being printed in the presses of the Islamic Office \n[21].",
    "book_id": "399",
    "new_page_number": 23
  },
  {
    "serial_number": "4358616",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 22,
    "volume_number": 1,
    "text": "The two Hadiths and what is in their meaning are absolute and are not specific to one mosque over another, nor one place over another. They include the Sacred Mosque and the Prophetic Mosque with greater reason, because he (peace be upon him) only said these Hadiths in his mosque, so it is the one intended by them primarily, and other mosques secondarily. The two mentioned reports are explicit texts that the Sacred Mosque is included in those Hadiths. So what is said by some Mutawwifs and others that the Meccan Mosque and the Prophetic Mosque are excluded from the prohibition has no basis in the Sunnah nor from any of the Companions, except for a single Hadith narrated regarding the Meccan Mosque which has an unsound chain of narration and no indication in it for the claim, as will be explained in (Innovations of Hajj) (Paragraph 124). Fifth: People of knowledge and virtue should seize the opportunity of their meeting with pilgrims in the Sacred Mosque and other holy sites to teach them what is required of Hajj rituals and rulings in accordance with the Book and the Sunnah. And let that not distract them from calling to the essence of Islam for which Messengers were sent and Books were revealed, which is Tawhid (Monotheism). For most of those we met, even those affiliated with knowledge, we found them in extreme ignorance of the reality of Tawhid and the idolatry and paganism that contradicts it. Just as they are in complete heedlessness of the necessity of the Muslims returning, despite their differing schools of thought and numerous parties, [22]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 24
  },
  {
    "serial_number": "4358617",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 23,
    "volume_number": 1,
    "text": "to the practice established in the Book and the Sunnah regarding beliefs, rulings, transactions, morals, politics, economics, and other affairs of life. And that any voice raised and any reform claimed upon other than this upright foundation and straight path, the Muslims will reap nothing from it but humiliation and weakness. The reality is the greatest witness to that. And Allah is the One sought for help. Calling to what preceded may require a little or a lot of arguing in a way that is best, as Allah the Mighty and Majestic said: (Invite to the way of your Lord with wisdom and good instruction, and argue with them in a way that is best) - An-Nahl: 125. So let not the opposition of the ignorant deter you from that by [their quoting of] His saying: (...there is to be no sexual relations and no disobedience and no disputing during Hajj) - Al-Baqarah: 196. For the disputing forbidden in Hajj is like the disobedience forbidden outside of Hajj as well, which is disputing with falsehood. It is different from the disputing commanded in the verse of Dawah. Ibn Hazm (may Allah have mercy on him) said (7 / 196): ('And disputing is of two types: a type that is obligatory and truth, and a type that is in falsehood. So that which is in the truth is obligatory in Ihram and outside Ihram. The Exalted said: (Invite to the way of your Lord...) and whoever argues in seeking a right due to him has invited to the way of his Lord the Exalted and strived to manifest the truth and prevent [23]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 25
  },
  {
    "serial_number": "4358618",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 24,
    "volume_number": 1,
    "text": "from falsehood. And likewise, everyone who argues for a right for another or for Allah the Exalted. But arguing with falsehood and in falsehood deliberately while remembering his Ihram invalidates the Ihram and the Hajj due to His saying: (no disputing during Hajj) Al-Baqarah: 196). All of this is assuming that (Jidal) in the verse means quarreling and wrangling until you anger your companion. A group of the Salaf held this meaning, and Ibn Qudamah attributed it in (Al-Mughni) (3 / 296) to the majority and preferred it. There is another opinion in its interpretation: that it is disputing about the time of Hajj and its rituals. Ibn Jarir chose this, then Ibn Taymiyyah in (Majmu'at Al-Rasa'il Al-Kubra) (2 / 361). According to this, the verse does not apply to what we are discussing at all. Allah knows best. Nevertheless, the caller should observe that if it becomes clear to him that there is no benefit in arguing with the one opposing him due to his fanaticism for his opinion, and that if he persists in the argument, it might result in what is not permissible, then it is better for him at that point to leave the argument with him, due to his saying (peace be upon him): (Hasan) ('I am a guarantor of a house in the outskirts of Paradise for one who leaves arguing even if he is right.') Narrated by Abu Dawood with a Hasan chain from Abu Umamah, and Al-Tirmidhi has similar from the Hadith of Anas and he classified it as Hasan. May Allah grant us and the Muslims success to know the Sunnah of His Prophet (peace be upon him) and follow his guidance. No Haraj (No Sin): These are matters that some pilgrims refrain from feeling it is a sin, while they are permissible: [24]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 26
  },
  {
    "serial_number": "4358619",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 25,
    "volume_number": 1,
    "text": "1 - Bathing for other than a wet dream and rubbing the head. For in the (Two Sahihs) and others (Sahih) from Abdullah bin Hunayn from Abdullah bin Abbas and Al-Miswar bin Makhramah that they disagreed at Al-Abwa. Abdullah bin Abbas said: The Muhrim washes his head. And Al-Miswar said: The Muhrim does not wash his head. So Abdullah bin Al-Abbas sent me to Abu Ayyub Al-Ansari to ask him about that. I found him bathing between the two wooden posts while screening himself with a garment. I greeted him, and he said: \"Who is this?\" I said: \"I am Abdullah bin Hunayn. Abdullah bin Al-Abbas sent me to you to ask you how the Messenger of Allah (peace be upon him) used to wash his head while he was in Ihram?\" So Abu Ayyub placed his hand on the garment and lowered it until his head appeared to me. Then he said to a person pouring on him: \"Pour.\" So he poured on his head. Then he moved his head with his hands, bringing them forward and backward, and said: \"This is how I saw him (peace be upon him) doing.\" Muslim added: (So Al-Miswar said to Ibn Abbas: \"I will never argue with you again.\") Al-Bayhaqi narrated with a Sahih chain from Ibn Abbas who said: (Sahih) ('Sometimes Umar bin Al-Khattab (may Allah be pleased with him) would say to me: \"Come, let us compete in the water to see which of us has longer breath\" while we were in Ihram.') And from Abdullah bin Umar ('That Asim bin Umar and Abdul Rahman bin Zayd [25]\n\nfell into the sea immersing each other (dipping under), one of them causing the head of the other to disappear, while Umar was looking at them and he did not disapprove of that from them.')\n\n2 - Scratching the head even if some hair falls out. The Hadith of Abu Ayyub mentioned just now is evidence for it. Malik narrated (1 / 358 / 92) from Umm Alqamah bin Abi Alqamah that she said: (Sahih) I heard Aisha, the wife of the Prophet (peace be upon him), being asked about the Muhrim: Can he scratch his body? She said: \"Yes, let him scratch it and scratch it hard. If my hands were tied and I found nothing but my foot, I would have scratched with it.\" Its chain is Hasan in corroborations. Sheikh of Islam Ibn Taymiyyah said in (Al-Majmu'ah Al-Kubra) (2 / 368): \"He has the right to scratch his body if it itches, and likewise if he bathes and something of his hair falls out due to that, it does not harm him.\")",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 27
  },
  {
    "serial_number": "4358622",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 26,
    "volume_number": 1,
    "text": "3 - Cupping (Hijama), even with shaving the hair at the place of cupping, due to the Hadith of Ibn Buhaynah (may Allah be pleased with him) who said: (Sahih) ('The Prophet (peace be upon him) was cupped while he was Muhrim at (Lahy Jamal) - a place on the way to Mecca - in the middle of his head.') Agreed upon. Sheikh of Islam Ibn Taymiyyah said in his (Manasik) (2 / 338): ('He has the right to scratch his body if it itches, and to be cupped on his head and other than his head [26]\n\neven if he needs to shave some hair for that, it is permissible. For it has been established in (then he quoted this Hadith, then said) and that is not possible except with shaving some of the hair. Likewise, if he bathes and something of his hair falls out due to that, it does not harm him, even if he is certain that it was detached by the bathing.') This is the school of thought of the Hanbalis as in (Al-Mughni) (3 / 306), but he said: ('And upon him is the Fidya (ransom)'). Malik and others said the same. Ibn Hazm rejected it saying (7 / 257) after this Hadith: ('He (peace be upon him) did not report that there is any fine or ransom in that. If it were obligatory, he would not have neglected that, and he (peace be upon him) had abundant hair, *Afra'* (1), and we were only forbidden from shaving the head in Ihram.')",
    "foot_note": "None\n\nNone",
    "book_id": "399",
    "new_page_number": 28
  },
  {
    "serial_number": "4358624",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 27,
    "volume_number": 1,
    "text": "4 - Smelling Rayhan (sweet basil/aromatic plants) and discarding a nail if it breaks. Ibn Abbas (may Allah be pleased with him) said: (Sahih) ('The Muhrim may enter the bathhouse, pull out his tooth, smell Rayhan, and if his nail breaks, he may discard it and say: \"Remove the harm from yourselves, for Allah the Mighty and Majestic does nothing with your harm.\")\n\nNarrated by Al-Bayhaqi (5 / 62 - 63) with a Sahih chain. Ibn Hazm went to this view (7 / 246). Malik narrated from Muhammad bin Abdullah bin Abi Maryam that he asked Sa'id bin Al-Musayyib about a nail of his that broke while he was Muhrim? Sa'id said: \"Cut it.\"",
    "foot_note": "1. (1) Afra': Having full/complete hair \n[27].\n\nNone",
    "book_id": "399",
    "new_page_number": 29
  },
  {
    "serial_number": "4358626",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 28,
    "volume_number": 1,
    "text": "5 - Shading oneself with a tent or an umbrella (parasol) and in a car and raising its roof. [Forbidding this] is from the strictness and hair-splitting of some sects in the religion, and the Lord of the Worlds did not authorize it. It is authentic that the Prophet (peace be upon him) commanded a dome tent to be set up for him at (Namirah), then he dismounted at it, as will come in the book paragraph (57 - 58). From Umm Al-Husayn (may Allah be pleased with her) who said: (Sahih) ('I performed Hajj with the Messenger of Allah (peace be upon him) in the Farewell Hajj, and I saw Usama and Bilal; one of them was holding the halter of his she-camel and the other was raising his garment to shade him from the heat until he threw [pebbles at] Jamrat al-Aqaba.') As for what Al-Bayhaqi narrated from Nafi' who said: ('Ibn Umar (may Allah be pleased with him) saw a man on his camel while he was Muhrim having shaded between himself and the sun. So he said to him: \"Be exposed to the sun for the One you assumed Ihram for.\") And in a narration from another path that he saw Abdullah bin Abi Rabi'ah having placed [28]\n\na stick on the middle of his mount and placed a garment to shade himself from the sun while he was Muhrim. Ibn Umar met him and forbade him.') I say: Perhaps Ibn Umar (may Allah be pleased with him) had not received the mentioned Hadith of Umm Al-Husayn, otherwise, what he denounced is exactly what the Messenger of Allah (peace be upon him) did. Therefore, Al-Bayhaqi said: \"This is Mawquf (stopped at the Companion), and the Hadith of Umm Al-Husayn is Sahih.\") Meaning it is more worthy to be adopted. He titled a chapter for it saying: (Chapter: The Muhrim shades himself with whatever he wishes as long as it does not touch his head). (1)",
    "foot_note": "None\n\nNone",
    "book_id": "399",
    "new_page_number": 30
  },
  {
    "serial_number": "4358628",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 29,
    "volume_number": 1,
    "text": "6 - And he may fasten a belt and a strap over his Izar (lower garment), and he may tie it when needed, and wear a ring, and wear a wristwatch, and wear eyeglasses due to the absence of a prohibition regarding that. Some traditions have been narrated regarding the permissibility of some of that. (Sahih) From Aisha (may Allah be pleased with her) that she was asked about the *Hamyam* (money belt) for the Muhrim? She said: \"And what is the harm? It is to secure his expenses.\" Its chain is Sahih. And from Ata: \"He wears a ring - meaning the Muhrim - and wears the *Hamyam*.\" Narrated by Al-Bukhari in a suspended (Mu'allaq) form.",
    "foot_note": "1. (1) I say: So the saying of Sheikh of Islam: \"It is better for the Muhrim to be exposed to the sun for the One he assumed Ihram for, as the Prophet (peace be upon him) and his companions used to perform Hajj\" contains a clear questionable point not hidden from the reader \n[29].",
    "book_id": "399",
    "new_page_number": 31
  },
  {
    "serial_number": "4358629",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 30,
    "volume_number": 1,
    "text": "I say: It is not hidden that the watch and eyeglasses are in the meaning of the ring and the belt, with the absence of what forbids them. (And your Lord was never forgetful) Maryam: 64. (Allah intends for you ease and does not intend for you hardship and [wants] for you to complete the period and to glorify Allah for that [to] which He has guided you; and perhaps you will be grateful). Damascus on 15 Shawwal 1384 AH. Muhammad Nasir al-Din al-Albani [30]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 32
  },
  {
    "serial_number": "4358630",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 31,
    "volume_number": 1,
    "text": "Introduction to the First Edition. In the name of Allah, the Most Gracious, the Most Merciful. Praise be to Allah, Lord of the Worlds, who says in His Wise Book: (And [due] to Allah from the people is a pilgrimage to the House - for whoever is able to find thereto a way. But whoever disbelieves - then indeed, Allah is free from need of the worlds) - Aal Imran: 97. And blessings and peace be upon our Prophet Muhammad, who said in what is authentically reported from him: (Sahih) ('Take your rituals from me, for I do not know, perhaps I will not perform Hajj after this year of mine.') And upon his pure family and his chosen companions and whoever recites and follows them in goodness. As for what follows: After I authored (The Description of the Prophet's Prayer, peace be upon him) (1) and published it to the people, it found - and praise be to Allah for His success - popularity beyond what I anticipated, whereas the copies of it, amounting to two thousand, ran out or almost did within two years without any means of",
    "foot_note": "1. (1) Then it was printed after that twice, and the third was expanded and revised, printed in the presses of the Islamic Office in Damascus in the year 1381 AH \n[31].",
    "book_id": "399",
    "new_page_number": 33
  },
  {
    "serial_number": "4358631",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 33,
    "volume_number": 1,
    "text": "advertising known being adopted for it, nor did any of the bookstore owners undertake distributing it. That was only because of what people sensed of the ease of its style in presenting his prayer (peace be upon him) while investigating it and editing what is authentic of it. This matter prompted many to request me to write another book for them on the Description of the Prophet's Hajj (peace be upon him) in the same style. I favored what they requested, but I apologized to them for rushing to fulfill what they desired because I was in the process of writing other books that would benefit Muslims, Allah willing. Among them is a book in which I investigate, as much as possible, the innovations that Muslims have fallen into since ancient times, hoping it would be a motive for them to avoid them and an incentive for them to hold fast to the Muhammadan Sunnah alone. Added to that is what is unavoidable of occupying myself with other subsidiary religious issues, which takes up much of my time, aside from my turning to earning my sustenance from my profession and the earnings of my hand. All of this was hindering me from initiating the fulfillment of their desire and my desire, especially since it requires ample time and much effort to track the Purified Sunnah and extract what relates to this subject from it. While I was in this state, it occurred to mind on the occasion of my reading with some brothers the Book of Hajj from (Al-Rawdah Al-Nadiyyah) by Siddiq Hasan Khan, the King of Bhopal, that I should bring out to the people the Hajj of the Prophet (peace be upon him) as Muslim narrated it in his Sahih from Jabir (may Allah be pleased with him), for it would save me [33]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 34
  },
  {
    "serial_number": "4358632",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 34,
    "volume_number": 1,
    "text": "time and great effort, and it would achieve for those interested their entire goal or most of it; and what cannot be grasped completely should not be left mostly. When this thought took hold of me, I found myself turning to it from every distraction. So I extracted from Sahih Muslim the narration referred to, and I reviewed its text repeatedly. It became clear to me that it lacked some rituals, so I re-extracted it from other books of Sunnah to be mentioned later. I found in them some useful additions, but they were far from fulfilling the duty of rectification. This led me to track every narration of Jabir in which he talks about his Hajj (peace be upon him) other than his previous narration. So I gathered from that benefits and additions of rituals, and I added all of them to the first narration, placing each of them in its appropriate place. By that, the rectification of a not insignificant amount of deficiency was completed. There remained many other things that could not be rectified except by changing this method which I resolved to follow, and by expanding the research and excavation for all narrations of the rest of the Companions regarding this Great Hajj. This is what I postponed to another wider time, for the intention turned after finishing the draft of this ritual guide to writing a book titled: (The Description of the Prophet's Hajj, peace be upon him, from his departure from Medina to his return to it, as if you were accompanying him). In it, I will track all its rituals, events, sermons, incidents, and the answers of the Prophet (peace be upon him) to the questions of the questioners in [34]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 35
  },
  {
    "serial_number": "4358633",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 35,
    "volume_number": 1,
    "text": "its paths and stations, and other than that of useful benefits and interesting points. I will list them moving from one station to another, restricting myself to what is authentic of that, as is my habit in all my writings and compositions. I have collected most of its material so far, so I hope that Allah the Exalted grants me success to classify and write it, then to print and publish it. He is my sufficiency; there is no deity but He. The Praise of Scholars for this Hadith of Jabir: I chose the Hadith of Jabir (may Allah be pleased with him) because, as Al-Nawawi said: ('He is the best of the Companions in context for the narration of the Hadith of the Farewell Hajj, for he mentioned it from the time of the Prophet's departure (peace be upon him) from Medina to its end. So he is more precise in it than others'). And he said: ('It is a magnificent Hadith containing sets of benefits and important bases of rules. Qadi Iyad said: People have spoken about the Fiqh in it and have done so extensively. Abu Bakr bin Al-Mundhir authored a large part on it and extracted from it more than one hundred and fifty types of Fiqh. If one were to be exhaustive, it would exceed this amount by nearly the same.') I say: Muslim titled it (Chapter: The Hajj of the Prophet, peace be upon him) (1) and Abu Dawood titled it (Chapter: The Description of the Hajj of the Prophet, peace be upon him). Al-Hafiz Al-Dhahabi mentioned it in the biography of Jabir, saying: ('He has a small ritual guide [Manasik] on Hajj which Muslim narrated.') Al-Hafiz Ibn Kathir dedicated a chapter to it in the fifth part of (Al-Bidayah wa Al-Nihayah) in which he said: ('It is alone an independent ritual guide.') Then he quoted it (pp. 146-149). This praise from these Imams is only for his Hadith from the first narration. So if you know what we added to it of benefits from other narrations as will be indicated, it will become clear to you that this ritual guide, in its original style, has more benefit and is more complete than his ritual guide based on the first narration [alone], as is evident and not hidden. The Narrations of the Ritual Guide and its Extraction: Know that the pivot of this ritual guide from the narration of Jabir is upon seven of his trustworthy, senior companions: 1 - Muhammad bin Ali bin Al-Husain bin Ali bin Abi Talib, Abu Ja'far Al-Baqir. 2 - Abu Al-Zubayr bin Muhammad bin Muslim Al-Makki. 3 - Ata bin Abi Rabah Al-Makki.\n\n1 - Muhammad bin Ali bin Al-Husain bin Ali bin Abi Talib Abu Ja'far Al-Baqir\n\n2 - Abu Al-Zubayr bin Muhammad bin Muslim Al-Makki\n\n3 - Ata bin Abi Rabah Al-Makki",
    "foot_note": "1. (1) As for the saying of Sheikh Abdul Hayy Al-Kattani in \"Al-Taratib Al-Idariyyah\" (2 / 856): \"Muslim titled it with his saying: The Long Hadith of Jabir\", it is a delusion from him. For Muslim only titled this for another long Hadith of Jabir. See: (Vol 8, pp 231-236 of it) \n[35].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 36
  },
  {
    "serial_number": "4358639",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 36,
    "volume_number": 1,
    "text": "4 - Mujahid bin Jabr Al-Makki [36]\n\n5 - Muhammad bin Al-Munkadir Al-Madani\n\n6 - Abu Salih Dhakwan Al-Samman Al-Madani\n\n7 - Abu Sufyan Talhah bin Nafi' Al-Wasiti, resident of Mecca. The original that we relied on in this ritual is from the narration of the first of them in Sahih Muslim. The others only have a little of it, some more than others according to their mentioned order. I have extracted their benefits additional to the first, then I indicated who extracted the additions of the first ones by placing the symbols explained below above them (1), sufficing with that instead of lengthy referencing for each addition and dispensing with it by this general referencing. So I say:",
    "foot_note": "None\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 37
  },
  {
    "serial_number": "4358643",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 37,
    "volume_number": 1,
    "text": "1 - As for the narration of the first, it was extracted by Muslim, Abu Nu'aym in (Al-Mustakhraj 'ala Sahih Muslim), Abu Dawud, Al-Darimi, Ibn Majah, Ibn Al-Jarud in (Al-Muntaqa), and Al-Bayhaqi from the path of Ja'far bin",
    "foot_note": "1. (1) It was like that in the first edition. As for this edition, we decided to place the symbols immediately after the addition because it is more pleasing to the eye \n[37].",
    "book_id": "399",
    "new_page_number": 38
  },
  {
    "serial_number": "4358644",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 38,
    "volume_number": 1,
    "text": "Muhammad Al-Sadiq from him in its entirety, and the context belongs to Muslim as previously indicated. The greater part of it was extracted by Al-Tayalisi in his Musnad and Ahmad. Separate parts of it were narrated by Muslim, Abu Dawud, Al-Nasa'i, Al-Tirmidhi, Al-Darimi, Ibn Majah, Malik in his Muwatta, Al-Tahawi in (Sharh Al-Ma'ani) and in (Mushkil Al-Athar), Al-Tabarani in (Al-Mu'jam Al-Saghir), Al-Daraqutni in his (Sunan), Al-Hakim in (Al-Mustadrak), Ibn Khuzaimah in his (Sahih) according to what is in (Al-Targhib wal-Tarhib), Al-Bayhaqi in his Sunan Al-Kubra, and Ahmad in [38]\n\n(Musnad), Ibn Sa'd in (Al-Tabaqat Al-Kubra), and Abu Nu'aym in (Hilyat Al-Awliya).",
    "foot_note": "None\n\nNone",
    "book_id": "399",
    "new_page_number": 39
  },
  {
    "serial_number": "4358646",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 39,
    "volume_number": 1,
    "text": "2 - As for the narration of Abu Al-Zubayr, it was extracted by Muslim, Abu Nu'aym in (Al-Mustakhraj 'ala Sahih Muslim), Abu Dawud, Al-Nasa'i, Al-Tirmidhi, Al-Darimi, Ibn Majah, Al-Shafi'i, Al-Tahawi in (Sharh Al-Ma'ani) and in (Mushkil Al-Athar), Al-Daraqutni, Al-Hakim, Al-Bayhaqi, Al-Tayalisi, Ahmad, and Ibn Sa'd [39]\n\n3 - As for the narration of Ata, it was extracted by Al-Bukhari, Muslim, Abu Nu'aym, Abu Dawud, Al-Nasa'i, Al-Darimi, Ibn Majah, Al-Shafi'i, Al-Tahawi in (Al-Sharh) and in (Al-Mushkil), Ibn Hibban in his (Sahih), Al-Hakim, Al-Bayhaqi, Al-Tayalisi, Ahmad, and Ibn Sa'd.\n\n4 - As for the narration of Mujahid, it was extracted by Al-Bukhari, Muslim, Al-Hakim, Al-Bayhaqi, and Ahmad.\n\n5 - As for the narration of Muhammad bin Al-Munkadir, it was extracted by Al-Tirmidhi, Ibn Majah, Al-Bayhaqi, and Ahmad.",
    "foot_note": "None\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 40
  },
  {
    "serial_number": "4358650",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 40,
    "volume_number": 1,
    "text": "6 - 7 - As for the narration of Abu Salih and Abu Sufyan [40]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 41
  },
  {
    "serial_number": "4358651",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 41,
    "volume_number": 1,
    "text": "And here are the symbols we promised:\nFor Al-Bukhari. . . . . . . . . . . . . . . . . . . . . . Kh\nAnd Muslim. . . . . . . . . . . . . . . . . . . . . . . . . . M\nAnd Abu Dawud. . . . . . . . . . . . . . . . . . . . . . D\nAnd Al-Nasa'i. . . . . . . . . . . . . . . . . . . . . . . N\nAnd Al-Tirmidhi. . . . . . . . . . . . . . . . . . . . . . T\nAnd Al-Darimi. . . . . . . . . . . . . . . . . . . . . . Mi\nAnd Ibn Majah. . . . . . . . . . . . . . . . . . . . . . Maj\nAnd Malik in (Al-Muwatta). . . . . . . . . . . . Ma\nAnd Al-Shafi'i in his Musnad and in his Sunan via (Bada'i' Al-Minan). . . . . . . . . . . . . . Sha\nAnd Ibn Sa'd. . . . . . . . . . . . . . . . . . . . . . Sa'\nAnd Al-Tahawi in (Sharh Al-Ma'ani). . . . . . . Tah\nAnd Al-Tahawi in (Mushkil Al-Athar). . . . . . . . Tash\nAnd Al-Tabarani in (Al-Saghir). . . . . . Tas\nAnd Ibn Khuzaimah in his Sahih. . . . . . Khuz\nAnd Al-Daraqutni. . . . . . . . . . . . . . . . . . . . Qat\nAnd Ibn Hibban. . . . . . . . . . . . . . . . . . . . . . . Hib [41]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 42
  },
  {
    "serial_number": "4358652",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 42,
    "volume_number": 1,
    "text": "And Ibn Al-Jarud. . . . . . . . . . . . . . . . . . . Ja\nAnd Al-Hakim. . . . . . . . . . . . . . . . . . . . . . . . . . Ha\nAnd Al-Bayhaqi. . . . . . . . . . . . . . . . . . . . . . . . . Hayq\nAnd Al-Tayalisi. . . . . . . . . . . . . . . . . . . . . . . Tay\nAnd Ahmad. . . . . . . . . . . . . . . . . . . . . . . . . . . . Ham\nAnd Abu Nu'aym in (Al-Mustakhraj). . . . Takh\nI have placed useful comments on the book in which I revealed the meanings of some words, clarified and explained the places mentioned in it, and drew attention to some jurisprudential benefits. I did not elaborate on that for the sake of brevity. I also recovered some rituals that were not mentioned in it, so the benefit of the book as a ritual guide was completed. I named it: (The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir and Narrated by his Trustworthy Senior Companions). I ask Allah Almighty to make it purely for His Noble Face and to benefit Muslims with it. Indeed, He is Hearing, Responsive [42]\n\nJabir, may Allah be pleased with him, said:\n\n1 - The Messenger of Allah, peace be upon him, stayed [in Medina: N Sha Ja Ham] for nine years without performing Hajj (1)\n\n2 - Then he announced among the people in the tenth year: That the Messenger of Allah, peace be upon him, is performing Hajj [this year: N Ja Ham]",
    "foot_note": "None\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 43
  },
  {
    "serial_number": "4358656",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 43,
    "volume_number": 1,
    "text": "3 - So many people came to Medina (and in a narration: No one remained who was able\n\nto come riding or walking except that he came: Y N) [So the people gathered (2) to go out with him: N Sha] all of them seeking to follow the Messenger of Allah, peace be upon him, and do as he does",
    "foot_note": "1. (1) Scholars agreed that the Prophet, peace be upon him, did not perform Hajj after his migration to Medina except for one Hajj, which is this Farewell Hajj, and that it was in the tenth year. They differed regarding the time its obligation began according to several opinions, the closest to the correct one being the ninth or tenth year, which is the opinion of more than one of the Salaf. Ibn Al-Qayyim used strong evidence for it in \"Zad Al-Ma'ad\", so let whoever wishes refer to it. Based on this, the Messenger of Allah, peace be upon him, hastened to perform Hajj immediately without delay, unlike the other opinions which imply that he delayed performing the obligation, and therefore those who hold them were forced to make excuses for him, peace be upon him, and we have no need for that \n[43].\n\nNone",
    "book_id": "399",
    "new_page_number": 44
  },
  {
    "serial_number": "4358658",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 45,
    "volume_number": 1,
    "text": "4 - [And Jabir, may Allah be pleased with him, said: I heard - the narrator said: I think he raised it to the Prophet, peace be upon him (and in a narration he said: The Messenger of Allah, peace be upon him, addressed us: Maj) (3) so he said: (The Meeqat of the people of Medina is from Dhu al-Hulayfah (4) and [the Meeqat of the people of] the other path is Al-Juhfah (5) and the Meeqat of the people of Iraq is from Dhat",
    "foot_note": "1. (2) Meaning they caught up and arrived \n3. This narration has weakness in its chain, but many hadiths from other than Jabir among the Companions, may Allah be pleased with them, testify to it, including Ibn Umar. In his hadith, it was in the Prophet's Mosque. Extracted by the Two Sheikhs and others. And in a narration by Ahmad \"on this pulpit\". It appears that this sermon was before his departure, peace be upon him, from Medina to teach people the rituals of Hajj \n4. A place six miles from Medina as in Al-Qamus. Al-Hafiz Ibn Kathir said in Al-Bidayah: (5: 114): \"at three miles\". Ibn Al-Qayyim said in Al-Zad (2: 178): \"a mile or so\". This is a severe difference \n5. A place between it and Mecca about three stages. Sheikh Al-Islam Ibn Taymiyyah said in \"Manasik Al-Hajj\" (2 / 356) from \"Majmu'at Al-Rasa'il Al-Kubra\": It is a village that was ancient and inhabited, and it used to be called Mahya'ah, and it is in ruins today. Therefore, people started assuming Ihram before it: from the place called (Rabigh). This is a Meeqat for those performing Hajj from the direction of the Maghreb, like the people of Sham, Egypt, and all of the Maghreb. If they pass through Medina Al-Munawwarah as they do in these times, they assume Ihram from the Meeqat of the people of Medina, for this is recommended for them by agreement. If they delay Ihram to Al-Juhfah, there is a dispute. I say: And the most likely is permissibility due to this hadith \n[45].",
    "book_id": "399",
    "new_page_number": 45
  },
  {
    "serial_number": "4358659",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 46,
    "volume_number": 1,
    "text": "Irq (6) The Meeqat of the people of Najd is from Qarn and the Meeqat of the people of Yemen is from\n\nYalamlam) (7): Nakh Maj Sha Tay Hayq Ham]\n\n5 - [He said: So the Messenger of Allah, peace be upon him, went out: D T Maj Hayq Ham] [with five days remaining of Dhu al-Qa'dah or four: N Ja Hayq]. (8)",
    "foot_note": "1. (6) A place in the desert which is the dividing line between Najd and Tihamah as in \"Al-Qamus\" and \"Mu'jam Al-Buldan\". The distance between it and Mecca is forty-two miles as in \"Al-Fath\". Know that this paragraph from the hadith of Jabir, may Allah be pleased with him, has been challenged in its authenticity by some scholars in terms of its chain and text. As for the chain, because he did not assertively raise it to the Prophet, peace be upon him, due to the narrator's saying: \"I think\" and in a narration by Muslim \"I see\", which means doubt and lack of certainty. As for the text, Iraq had not been conquered at that time. The answer to the first is from two perspectives: A - That the doubt has been removed by the narrator's assertion of raising the hadith to the Prophet, peace be upon him, in the narration of Ibn Majah referred to above, which, although weak as previously mentioned, the assertion has been established in another narration extracted by Imam Ahmad. Although it contains Ibn Lahi'ah who is described with poor memory, among his narrators from him is Abdullah bin Wahb with Imam Al-Bayhaqi (5 / 27). Such a narration is authentic according to the verifying Imams because the narration of the Abadillah from Ibn Lahi'ah is authentic according to them, and they are Abdullah bin Al-Mubarak, Abdullah bin Yazid Al-Muqri, and Abdullah bin Wahb. This has been elaborated by the scholar Ibn Al-Qayyim in \"I'lam Al-Muwaqqi'in\" (3 / 13 - 14), so let whoever wants elaboration refer to it. B - Suppose the doubt was not removed by that, the hadith has many witnesses from a group of Companions strengthening Jabir's hadith as asserted by Al-Hafiz Ibn Hajar and others. He cited the referred witnesses in \"Al-Talkhis\". Al-Zayla'i also cited them in \"Nasb Al-Rayah\" (2 / 12 - 15) and Ibn Kathir as in \"Al-Jawhar Al-Naqi\" (5 / 28). This comment cannot bear mentioning those witnesses, so let whoever wishes refer to them in some of the mentioned sources. But it is necessary here to mention one witness that escaped all those extractors, which is what Al-Tahawi extracted (1 / 360) and Abu Nu'aym in \"Al-Hilyah\" (4 / 94) with an authentic chain from Ibn Umar that he said following his hadith referred to regarding the Meeqats: \"And our companions told me that the Messenger of Allah, peace be upon him, set Dhat Irq for the people of Iraq.\" Abu Nu'aym said: This is an authentic established hadith. I say: In this is a refutation of those who weakened the hadith absolutely and those who strengthened it by the sum of its paths not by itself. What is in Sahih Al-Bukhari that Umar bin Al-Khattab is the one who set Dhat Irq for the people of Iraq does not contradict the authenticity of the hadith, as it is possible that this was among the agreements where Umar agreed with the legislation. As for the answer to its defect that Iraq had not been conquered at that time, it is: That this issued from him, peace be upon him, and issued as instruction for the nation of Islam until the Day of Judgment. So it is not necessary that it be conquered at that time. It is like the lands of Sham in this regard, for they had not been conquered either as is known. Therefore, Al-Hafiz Ibn Abd al-Barr said: This is negligence from the one who said this saying, because he, peace be upon him, is the one who set Dhat Irq for the people of Iraq just as he set Al-Juhfah for the people of Sham, and Sham at that time was an abode of disbelief like Iraq. So he set the Meeqats for the people of the regions because he knew that Allah would open Sham, Iraq, and others for his Ummah. Sham and Iraq were only conquered during the time of Umar without dispute. And he, peace be upon him, said: Iraq withheld its dirham and its qafiz. The hadith means according to the people of knowledge it will withhold.\" Ibn Al-Turkmani quoted it in \"Al-Jawhar\" (5 / 28 - 29) and \"and its dirham\" occurred in it instead of \"and its qafiz\", and I corrected it from \"Sahih Muslim\" (8 / 175) \n[46].\n\n1. (7) A place two stages from Mecca, between them thirty miles \n[46].\n\nNone",
    "book_id": "399",
    "new_page_number": 46
  },
  {
    "serial_number": "4358662",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 48,
    "volume_number": 1,
    "text": "6 - [And he drove a sacrificial animal (Hady): N] (9)",
    "foot_note": "1. (8) That was after he combed his hair, applied oil, and wore his lower garment (Izar) and upper garment (Rida), he and his companions. He did not forbid any Izars and Ridas to be worn except the Muza'far. As Ibn Abbas said in Al-Bukhari. The Muza'far is what is dyed with yellow color like saffron. So in it, meaning the hadith of Ibn Abbas, is the legislation of wearing Ihram clothes before the Meeqat, contrary to what many people think. This is unlike the intention of Ihram, for it is not permissible according to the most correct opinion in our view except at the Meeqat or close to it for one who is in an airplane and fears that it will pass the Meeqat and he has not entered Ihram. Know that uttering the intention is not legislated neither in Ihram nor in other acts of worship like purification, prayer, fasting, and others. The intention is only in the heart. As for uttering it, it is an innovation \"and every innovation is a misguidance and every misguidance is in the Fire\". What is authentically reported from him, peace be upon him, in Ihram is only his saying: \"Labbayk Allahumma Umrah and Hajj\". So one stops at this and does not add to it as decided by Sheikh Al-Islam Ibn Taymiyyah in his treatise on \"Intention\" (p. 244 - 245 of Majmu'at Al-Rasa'il Al-Kubra Part One). He has a statement on this issue mentioned in his \"Mansik\" (2 / 359) whose apparent meaning might contradict what we mentioned, so it should not be paid attention to. You must know the truth by its evidence not by its speaker, especially if he has two opinions on the issue \n9. Meaning from Dhu al-Hulayfah as in the \"Two Sahihs\" from the hadith of Ibn Umar. Al-Hafiz Ibn Hajar said in his explanation: It contains the recommendation to drive the sacrificial animal from the Meeqats and from distant places, and it is one of the Sunnahs that many people have neglected. Thus he said, and it is questionable because driving the sacrificial animal is not something his guidance, peace be upon him, settled on. Rather, he regretted it as in the coming paragraph (41): \"Had I known beforehand about my affair what I know now, I would not have driven the sacrificial animal and I would have made it lawful.\" This statement from him, peace be upon him, indicated two important matters: First: That enjoying Umrah until Hajj with releasing from Ihram between them is better than driving the sacrificial animal with Qiran, because he, peace be upon him, regretted not doing that, and it can only be for what is better obviously. So the best is therefore leaving driving the sacrificial animal. Second: That everyone who did not drive the sacrificial animal among the pilgrims, whether he was Qarin or Mufrid, must release from that with an Umrah then assume Ihram for Hajj on the Day of Tarwiyah due to his command, peace be upon him, to do that as will come. Rather, it is authentic that the Prophet, peace be upon him, was angry with those who did not hasten to implement his command to release. He, peace be upon him, confirmed that by saying: \"Umrah has entered into Hajj until the Day of Judgment.\" This is also a text that Umrah has become an integral part of Hajj. So every pilgrim must combine with his Hajj an Umrah, either without releasing from it if he had driven the sacrificial animal with him, or by releasing if he did not drive the sacrificial animal. This was said by Ibn Hazm and he quoted it from Ibn Abbas, Mujahid, Ata, Ishaq bin Rahwayh and others. Ibn Al-Qayyim supported it in \"Zad Al-Ma'ad\" with great support, so let whoever wants elaboration refer to it \n[48].",
    "book_id": "399",
    "new_page_number": 47
  },
  {
    "serial_number": "4358663",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 49,
    "volume_number": 1,
    "text": "7 - So we went out with him [with us were women and children: M Nakh] (10)\n\n8 - Until we came to Dhu al-Hulayfah, and Asma bint Umais gave birth to Muhammad ibn Abi Bakr\n\n9 - So she sent to the Messenger of Allah, peace be upon him: How should I act?\n\n10 - [So] he said: Bathe and bind your private part (Istithfari) (11) with a cloth and assume Ihram",
    "foot_note": "1. (10) As for the addition which is with Ibn Majah and others from Jabir with the wording: \". . . So we said Talbiyah on behalf of the women and threw pebbles on behalf of the boys\", its chain is not authentic. Al-Tirmidhi also narrated it with the wording: \"So we used to say Talbiyah on behalf of the women and throw pebbles on behalf of the boys.\" He said: \"A Gharib Hadith, we do not know it except from this path.\" I say: It has two defects: the 'an'anah of Abu Al-Zubayr and the weakness of Ash'ath bin Yasar. So do not be deceived by the silence of those who remained silent about the hadith among the jurists, old and new, like Sheikh Ibn Qudamah and others. But in Al-Mughni (3 / 254) is the text: Ibn Al-Mundhir said: Everyone I memorized from among the people of knowledge sees throwing on behalf of the boy who is unable to throw. Ibn Umar used to do that, and Ata, Al-Zuhri, Malik, Al-Shafi'i and Ishaq said it. If the issue is one in which there is no disagreement, then it is sufficient. Otherwise, you have known the condition of the hadith. As for Talbiyah on behalf of women, Al-Tirmidhi said following it: The people of knowledge have agreed that no one says Talbiyah on behalf of a woman, and she says Talbiyah for herself, and it is disliked for her to raise her voice with Talbiyah \n[49].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 48
  },
  {
    "serial_number": "4358667",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 50,
    "volume_number": 1,
    "text": "11 - So the Messenger of Allah, peace be upon him, prayed in the mosque [while he was silent: N] (12)\n\nIhram: (13)",
    "foot_note": "1. (11) Imperative from Istithfar. Ibn Al-Athir said in Al-Nihaya: \"It is that she binds her private part with a wide cloth after stuffing it with cotton and ties its two ends to something she binds around her waist, thus preventing the flow of blood\" \n12. Meaning that he did not say Talbiyah yet, but rather he said Talbiyah when his she-camel stood up with him as will come \n[50].\n\nNone",
    "book_id": "399",
    "new_page_number": 49
  },
  {
    "serial_number": "4358669",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 51,
    "volume_number": 1,
    "text": "12 - Then he rode Al-Qaswa (14) until when his she-camel stood up with him on Al-Bayda [he raised his voice (Ahalla) (15) with Hajj (and in a narration: he singled out Hajj: Maj Sa') he and his companions: Maj]",
    "foot_note": "1. (13) And Aisha perfumed him before his Ihram with the best perfume. And the glistening of perfume was seen in the partings of his hair three days after his Ihram. As in the Sahih \n14. It is with Fatha on the Qaf and Madd, the name of his she-camel, peace be upon him. It has other names like \"Al-Adbaa\" and \"Al-Jad'aa\". It was said: These are names of she-camels belonging to him, peace be upon him. See \"Sharh Muslim by Al-Nawawi \n15. From Ihlal which is raising the voice with Talbiyah. It is said: The Muhrim raised his voice with Hajj, he raises it (Yuhillu) raising (Ihlalan): if he said Talbiyah and raised his voice. So in Al-Nihaya. In the hadith, it is stated that he, peace be upon him, assumed Ihram for Hajj alone, but in the hadith of Anas and others in the Two Sahihs and others, it is stated that he, peace be upon him, raised his voice with Hajj and Umrah together, and this is the correct view as explained by Ibn Al-Qayyim in \"Zad Al-Ma'ad\". He cited about twenty hadiths from about twenty Companions that the Prophet, peace be upon him, performed Hajj as Qarin (combining Hajj and Umrah). Let whoever wants to expand on the investigation refer to it. He missed the saying of Aisha: \"O Messenger of Allah, do you set out with Hajj and Umrah and I set out with Hajj\" which is in Al-Bukhari and Ahmad from the hadith of Jabir himself, and it is a text on the issue. See the coming paragraph (111). Based on this, Jabir, may Allah be pleased with him, knew that the Prophet, peace be upon him, was Qarin, so how does he report about him that he raised his voice with Hajj alone and singled it out? The answer is from two perspectives: First: That it is interpreted as the beginning of Ihram. And before his descent, peace be upon him, in Wadi Al-Aqiq where he was commanded with Qiran as Umar, may Allah be pleased with him, reported. He said: I heard the Messenger of Allah, peace be upon him, in Wadi Al-Aqiq: An Umrah in (and in a narration: and) a Hajj\". Narrated by Al-Bukhari and others. There is remoteness in this in my view because Jabir, may Allah be pleased with him, was not alone in narrating Ifrad (singling out) from him, peace be upon him, but a group of Companions followed him in it, like Lady Aisha, may Allah be pleased with her, in the Two Sahihs and others. And in a narration by Muslim and \"Al-Muwatta\" and Ibn Sa'd from her with Jabir's explicit wording: \"He singled out Hajj\". It is difficult then to hold the mentioned interpretation because it attributes lack of knowledge to the Companions. Therefore, a group of scholars chose the first perspective, like Ibn Al-Mundhir, Ibn Hazm and Qadi Iyad, and Al-Hafiz preferred it in \"Al-Fath\". So whoever wants to expand on the investigation let him refer to it. As for Ibn Al-Qayyim's defecting of this explicit narration of Jabir by Al-Darawardi being alone in it, it is refuted by the fact that Abdul-Aziz bin Abi Hazim followed him in it. Ibn Sa'd extracted it in \"Al-Tabaqat\" (2 / 1 / 179) \n[51].",
    "book_id": "399",
    "new_page_number": 50
  },
  {
    "serial_number": "4358670",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 52,
    "volume_number": 1,
    "text": "13 - [Jabir said: D Maj Hayq]: So I looked as far as my eye could see [of: D Mi Maj Ja] in front of him of riders and walkers (16) and on his right",
    "foot_note": "1. (16) Al-Nawawi said in summary: It contains the permissibility of Hajj riding and walking, and it is agreed upon. They differed on which is better. The majority of scholars said: Riding is better following the example of the Prophet, peace be upon him, and because it helps him more in his duties and rituals and because it involves more expenditure. Dawood said: Walking is better because of its hardship. This is corrupt because hardship is not. From it you learn the permissibility, rather the desirability, of Hajj riding in an airplane contrary to what some think. As for the hadith: \"For the riding pilgrim, for every step his mount takes there are seventy good deeds, and for the walker, for every step he takes there are seven hundred good deeds\", it is weak and not established as proof. It was narrated with the wording: \"For the walker is the reward of seventy Hajjs and for the rider the reward of thirty Hajjs\", which is weaker than the first. Whoever wishes to see them, let him refer to our book \"Silsilat Al-Ahadith Al-Da'ifah\" (Numbers 496 - 497). Sheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him, stated in \"Manasik Al-Hajj\" that the wisdom in this issue varies according to different people \"So for some of them, Hajj riding is better, and for some of them, Hajj walking is better.\" I say: Perhaps this is closer to the truth \n[52].",
    "book_id": "399",
    "new_page_number": 51
  },
  {
    "serial_number": "4358671",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 53,
    "volume_number": 1,
    "text": "the like of that, and on his left the like of that, and behind him the like of that. And the Messenger of Allah, peace be upon him, was among us, and the Quran was being revealed to him, and he knows its interpretation. Whatever he did of anything, we did it (17)\n\n14 - So he raised his voice with Monotheism (Tawhid): Labbayk Allahumma Labbayk, Labbayk la sharika laka Labbayk, Inna al-hamda wan-ni'mata laka wal-mulk, la sharika",
    "foot_note": "1. (17) In it is a subtle indication that the Prophet, peace be upon him, is the one who explains to the Companions what was revealed to him of the Quran and that he alone knows its interpretation and explanation truly, and that others - even the Companions - cannot dispense with his explanation, peace be upon him. Therefore, the Companions, may Allah be pleased with them, in this Hajj - as in other acts of worship - were following his footsteps, so whatever he did of anything, they did it. In it is an apparent refutation of two groups of people: A - The Sufis, where one of them dispenses with the Sunnah of the Prophet, peace be upon him and his family, his guidance and his explanation with what they claim of Ladunni (inspired) knowledge, some of them symbolizing it by saying: \"My heart told me from my Lord\". Rather, Al-Sha'rani claimed in \"Al-Tabaqat Al-Kubra\" that one of his Sheikhs (the Majdhubun/ecstatics) with whom he is pleased used to read a Quran other than our Quran and gift the reward of its recitation to the dead Muslims. B - A group calling themselves \"Quranists\" and the Quran is innocent of them. They claim that they have no need for the Sunnah of the Prophet, peace be upon him, to understand the Quran, and knowledge of the Arabic language and its literature is sufficient for that. While this did not suffice Jabir and his companions as you knew, especially since they were pure Arabs and the Quran was revealed in their language, whereas this group are all or mostly non-Arabs. As a result of their mentioned claim, they exited Islam and came with a new religion. Their prayer is not our prayer, their Hajj is not our Hajj, their fasting is not our fasting, and I do not know, perhaps their Tawhid is not our Tawhid. These people emerged in India then their sedition spread to Egypt and Syria. I had read a book by them named \"Al-Din\" without the author's name on it. Whoever reads it knows from it their misguidance and departure from the religion. May Allah suffice Muslims the evil of both groups \n[53].\n\nNone",
    "book_id": "399",
    "new_page_number": 52
  },
  {
    "serial_number": "4358673",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 54,
    "volume_number": 1,
    "text": "15 - And the people raised their voices with this which they raise their voices with (and in a narration: and the people said Talbiyah [and the people were adding: Ja Ham]: Ja Hayq Ham) [Labbayk Dhal-Ma'arij, Labbayk Dhal-Fawadil: D Ham Hayq]. The Messenger of Allah, peace be upon him, did not reject anything of it from them (18)\n\n16 - And the Messenger of Allah, peace be upon him, stuck to his Talbiyah\n\n17 - Jabir said [and we were saying [Labbayk Allahumma: Kh] Labbayk bil-Hajj: M Maj] [screaming loudly: M] we did not know Umrah: Ja) (19) And in another: We, the companions of the Prophet, peace be upon him, raised our voices with Hajj purely, with nothing else with it purely alone: Sa')\n\n18 - [He said: And Aisha came with Umrah until when she was at (Sarif) (20) she menstruated (21): M Nakh] Entering Mecca and Tawaf",
    "foot_note": "1. (18) This indicates the permissibility of adding to the Prophetic Talbiyah because of his approval, peace be upon him, of them for it. Malik and Al-Shafi'i said this. Ahmad narrated from Ibn Abbas that he said: \"Stick to it, for it is the Talbiyah of the Messenger of Allah, peace be upon him.\" Some contemporaries authenticated its chain, but it contains one who became confused. It is authentically reported from Abu Hurairah that part of his Talbiyah, peace be upon him, was: Labbayk Ilaha Al-Haqq. Narrated by Al-Nasa'i and others. Talbiyah is answering the call of Allah Almighty to His creation when He called them to Hajj His House on the tongue of His friend (Khalil). The Mulabbi (one saying Talbiyah) is the submitter, compliant to another, just as the one who is tied by the neck and taken by his throat is compliant. The meaning is: I am answering your call, submitting to your command, obeying your order time after time, I will not cease to do so. Mentioned by Sheikh Al-Islam, may Allah Almighty have mercy on him \n[54].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 53
  },
  {
    "serial_number": "4358677",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 55,
    "volume_number": 1,
    "text": "19 - Until when we came to the House with him [on the morning of the fourth passing of Dhu al-Hijjah: M Nakh D Maj Tah Tay Sa' Hayq Ham] (and in a narration: we entered Mecca at the rising of the forenoon):\n\n20 - The Prophet, peace be upon him, came to the gate of the mosque and made his mount kneel, then entered the mosque: Khuz Ha Hayq)\n\n21 - He touched the Corner (22) (and in a narration: the Black Stone: Ham Ja) (23)\n\n22 - [Then he proceeded to his right: M N Ja Hayq]",
    "foot_note": "1. (19) I say: This was at the beginning of this Hajj and before the Messenger of Allah, peace be upon him, taught them the legitimacy of Umrah in the months of Hajj. There are hadiths about that, including the hadith of Aisha, may Allah be pleased with her, who said: We went out with the Messenger of Allah, peace be upon him (in the year of the Farewell Hajj), and he said: Whoever among you wants to raise his voice with Hajj and Umrah, let him do so, and whoever wants to raise his voice with Umrah, let him raise his voice. Aisha said... and I was among those who raised their voice with Umrah. Narrated by Al-Bukhari and Muslim and the wording is his \n20. With Kasrah on Ra, a place near Al-Tan'im. He said in \"Al-Nihaya\" \"It is ten miles from Mecca, and it was said less and it was said more\" \n21. Meaning she got her period \n[55].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 54
  },
  {
    "serial_number": "4358681",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 56,
    "volume_number": 1,
    "text": "23 - He performed Raml (brisk walking) (24) [until he returned to it: HM] three times and walked four times [at\n\nhis normal pace: TH] (25)\n\n24 - Then he proceeded to the Station (Maqam) of Ibrahim (peace be upon him) and recited: (And take the Station of Ibrahim as a place of prayer) [and he raised his voice so the people could hear: N]\n\n25 - He placed the Station between him and the House [and prayed two rak'ahs: HQ, HM]\n\n26 - [He said: N, T]: He used to recite in the two rak'ahs: (Say, \"He is Allah, [who is] One\") and (Say, \"O disbelievers\") (and in a narration: (Say, \"O disbelievers\") and (Say, \"He is Allah, [who is] One\")\n\n27 - Then he went to Zamzam, drank from it, and poured water on his head: HM]\n\n28 - Then he returned to the Corner and touched it. Standing at Al-Safa and Al-Marwah",
    "foot_note": "1. (22) Meaning he wiped it with his hand, which is a Sunnah in every Tawaf (circumambulation), as stated by Al-Nawawi in the explanation of Muslim.\n23. He also touched the Yemeni Corner in this Tawaf as in the hadith of Ibn Umar, but he did not kiss it; he only kissed the Black Stone, and that was in every circuit. I say: The Sunnah regarding the Black Corner (Stone) is to kiss it. If not possible, touch it with the hand and kiss the hand. If not possible, touch it with something like a stick and kiss it. Otherwise, point to it. None of this is prescribed for the other corners except the Yemeni Corner, where it is good to only touch it. It is Sunnah to say Takbir (Allahu Akbar) at the Black Corner in every circuit due to the hadith of Ibn Abbas who said: \"The Prophet (peace and blessings of Allah be upon him) circumambulated the House on his camel; every time he came to the Corner, he pointed to it with something he had and said Takbir.\" Narrated by Al-Bukhari. As for the Tasmiyah (saying Bismillah), I have not seen it in a Marfu' (elevated to the Prophet) hadith. It is only authentic from Ibn Umar that when he touched the Stone, he said: \"Bismillah, Allahu Akbar.\" Narrated by Al-Bayhaqi (5 / 79) and others with a Sahih chain as stated by Al-Nawawi and Al-Asqalani. Ibn al-Qayyim (may Allah have mercy on him) was mistaken when he mentioned it from the narration of Al-Tabarani as Marfu'. Rather, he narrated it as Mawquf (stopped at the Companion) like Al-Bayhaqi, as mentioned by Al-Hafiz in \"Al-Talkhis.\" So it was necessary to draw attention to this so that what is not part of the explicit Sunnah is not attached to it.\n24. The scholars said: Raml is fast walking with short steps, which is Al-Khabab. Nawawi [56].\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 55
  },
  {
    "serial_number": "4358688",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 57,
    "volume_number": 1,
    "text": "29 - Then he went out from the door (and in a narration: the door of Al-Safa: TS) to Al-Safa. When he neared Al-Safa, he recited: (Indeed, as-Safa and al-Marwah are among the symbols of Allah)\n\nI begin (and in a narration: We begin: D, N, T, MI, MA, JA, HQ, HM, TS) (26) with what Allah began with. So he began with Al-Safa and climbed upon it until he saw the House.\n\n30 - He faced the Qiblah, declared the Oneness of Allah (Tawhid) and magnified Him (Takbir) [three times: N, HQ, HM] and [praised Him: N, MJ]. He said: There is no deity except Allah alone, He has no partner, to Him belongs the dominion and to Him belongs the praise [He gives life and causes death: D, N, MI, MJ, HQ] and He is over all things omnipotent. There is no deity except Allah alone, [He has no partner: MJ], He fulfilled His promise, granted victory to His servant, and defeated the confederates alone (27). Then he supplicated between that. He said something like this three times.",
    "foot_note": "1. (25) He (peace and blessings of Allah be upon him) circumambulated while doing Idtiba' (uncovering the right shoulder) as in other than this hadith. Idtiba' is to place the upper garment (Rida') under his right armpit and throw its end over his left [shoulder], exposing his right shoulder and covering the left \"Qamus\". When he finished Tawaf, he adjusted his garment. Al-Athram said: He adjusts it when he finishes the laps in which he performs Raml. The first opinion is more fitting with the apparent meaning of the hadith, as Ibn Qudamah said in \"Al-Mughni\" [57].\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 56
  },
  {
    "serial_number": "4358691",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 58,
    "volume_number": 1,
    "text": "31 - Then he descended [walking: N] (28) towards Al-Marwah until his feet poured\n\ninto the bottom of the valley, he ran (sa'a) until [when: MJ] [his feet: MJ, MA, N] ascended [the other side: HM] he walked until he came to Al-Marwah [and climbed upon it until he looked at the House: N, HM]\n\n32 - He did on Al-Marwah as he had done on Al-Safa. The Command to Annul Hajj into Umrah",
    "foot_note": "1. (26) As for the other narration with the wording: \"Begin\" in the imperative form, which is found in Al-Daraqutni and others, it is Shadh (anomalous), so I turned away from it. The scholar Ibn Daqiq al-Eid said in \"Al-Ilmam\" (Folio 6 / 2) after mentioning the first narration \"I begin\" and the second \"We begin\": The majority of narrations are upon this, and the source of the hadith is one. Al-Hafiz Ibn Hajar quoted him in \"Al-Talkhis\" (214) as follows: The source of the hadith is one, and Malik, Sufyan, and Yahya bin Sa'id al-Qattan agreed on the narration \"We begin\" with the Nun for plural. Al-Hafiz said: \"They are better memorizers than the rest.\"\n27. Meaning: He defeated them without fighting by humans nor by a cause from their side. The 'confederates' refers to those who allied against the Messenger of Allah (peace and blessings of Allah be upon him) on the Day of the Trench (Al-Khandaq). Nawawi.\n28. This hadith is explicit that he (peace and blessings of Allah be upon him) performed Sa'i walking. In another hadith by Jabir, it states that he (peace and blessings of Allah be upon him) went between Safa and Marwah on a camel so that people could see him, look up to him, and ask him questions, for the people crowded around him. Narrated by Muslim and others. It will come in the book in paragraph (105) that he (peace and blessings of Allah be upon him) did not perform Sa'i between Safa and Marwah after the Tawaf of Return (Tawaf al-Sadr), and in a narration from him that he only performed Tawaf between them once. Thus, it is determined that his Sa'i between them while riding was after the Tawaf of Arrival (Tawaf al-Qudum). The reconciliation is that he first performed Sa'i walking, then performed it riding when people covered him and crowded around him. This is supported by a hadith of Ibn Abbas which explicitly states that he walked first, and when the people became too many around him, he rode. Extracted by Muslim and others. Ibn al-Qayyim mentioned this in Al-Zad and deemed it good [58].\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 57
  },
  {
    "serial_number": "4358694",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 59,
    "volume_number": 1,
    "text": "33 - Until it was his last lap (and in a narration: was the seventh: JA, HM) (29) on Al-Marwah, he said: [O people: HM] If I had known beforehand about my affair\n\nwhat I know now, I would not have driven the sacrificial animal (Hady) and [L: D, JA, HQ, HM] I would have made it an Umrah. So whoever among you does not have a sacrificial animal, let him dissolve his Ihram and make it an Umrah. (And in a narration: He said: Dissolve your Ihram, circumambulate the House and between Al-Safa and Al-Marwah, cut your hair (30), and stay as non-Muhrims (Halal). Until it is the Day of Tarwiyah (31), then assume Ihram for Hajj and make the one you arrived with a Mut'ah (Umrah): KH, M) (32)",
    "foot_note": "1. (29) In this is an explicit refutation of those who said that he (peace and blessings of Allah be upon him) performed Sa'i fourteen times, counting his going and returning as one time. Ibn al-Qayyim said in \"Zad al-Ma'ad\": This is an error attributed to him (peace and blessings of Allah be upon him); no one narrated it from him, nor did any of the Imams whose opinions are famous say it, even if some late scholars claiming affiliation to the Imams adopted it. What clarifies the invalidity of this opinion is that he (peace and blessings of Allah be upon him) indisputably ended his Sa'i at Al-Marwah. If the going and returning were one time, his ending would have occurred at Al-Safa. I say: The correct opinion according to the Hanafis is what agrees with the Sunnah in this issue, as explicitly stated by Al-Samarqandi in \"Tuhfat al-Fuqaha\" (1 / 2 / 866), so the other opinion is weak and it is not permissible to pay attention to it [59].\n\nNone",
    "book_id": "399",
    "new_page_number": 58
  },
  {
    "serial_number": "4358696",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 60,
    "volume_number": 1,
    "text": "34 - Suraqa bin Malik bin Ju'sham stood up (and he was at the bottom of Al-Marwah: JA, HM) and said: O Messenger of Allah, [do you see our Umrah (and in a wording: our Mut'ah: N, MJ, HQ) this one: N, TH] [Is it: NKH, MI, MJ, JA, HQ, HM] for this year of ours or for forever [eternity: MJ]? [He said: MJ] So the Messenger of Allah (peace and blessings of Allah be upon him) interlaced his fingers one into another and said: The Umrah has entered into the Hajj [until",
    "foot_note": "1. (30) This is the Sunnah and best for the Mutamatti' (one performing Tamattu') to cut his hair and not shave it, rather he shaves it on the Day of Sacrifice (Nahr) after finishing the rites of Hajj, as stated by Sheikh al-Islam Ibn Taymiyyah and others. So his saying (peace and blessings of Allah be upon him) \"O Allah, forgive those who shave three times and those who cut once\" is interpreted for other than the Mutamatti', such as the Qarin and the one performing Umrah only. So the opinion that shaving is better for the Mutamatti' - as is the Hanafi school - is not correct.\n31. It is the eighth day of Dhul-Hijjah. It was named so because they used to provide themselves with water (yartawun) for what comes after it, meaning they watered and drew water. Nihaya.\n32. Meaning make the Hajj Ifrad (Hajj only) which you assumed Ihram for into an Umrah, dissolve Ihram from it, and become Mutamatti'in. So he called the Umrah 'Mut'ah' metaphorically, and the relationship between them is apparent. Fath [60].",
    "book_id": "399",
    "new_page_number": 59
  },
  {
    "serial_number": "4358697",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 61,
    "volume_number": 1,
    "text": "the Day of Resurrection: JA, HM] (33) No, but for ever and ever [No, but for ever and ever: D, MI, HQ] [three times: JA]\n\n35 - [He said: O Messenger of Allah, explain our religion to us as if we were created now. What is the deed for? Is it for what the pens have dried upon and the destinies have run with, or for what we face (in the future)? He said: No, rather for what the pens have dried upon and the destinies have run with. He said: Then what is the deed for [then: HM]? He said: Work, for everyone is facilitated: TY, HM] [for what he was created for: HM] (34)",
    "foot_note": "1. (33) Al-Nawawi said: \"According to the majority, its meaning is: That Umrah is permissible to be performed during the months of Hajj, invalidating what the people of Jahiliyyah were upon. It was said its meaning is: The permissibility of Qiran, meaning the actions of Umrah entered into the actions of Hajj. It was said its meaning is: The obligation of Umrah dropped, and this is weak because it implies abrogation without evidence. It was said its meaning is: The permissibility of annulling Hajj into Umrah. He said: And this is weak.\" Thus he spoke. Al-Hafiz responded in \"Al-Fath\" saying: It is critiqued that the context of the question strengthens this interpretation by the apparent meaning, that the question occurred regarding the annulment (Faskh) and the answer occurred regarding what is more general than that, so it covers the mentioned interpretations except the third. And Allah knows best. I say: Fourteen of his companions narrated from him (peace and blessings of Allah be upon him) the command to annul Hajj into Umrah, and their hadiths are all Sahih. Ibn al-Qayyim listed them in Al-Zad (1: 282 - 286) and mentioned that it is the opinion of Ibn Abbas and the school of Ahmad and the People of Hadith. It is the truth in which we have no doubt. Ibn al-Qayyim answered the doubts of the opponents, so refer to it (1: 286 - 303). Know that this hadith of Suraqa contains decisive proof of the invalidity of the hadith narrated by Abu Dawood and others from Al-Harith bin Bilal from his father who said: I said, O Messenger of Allah, is the annulment of Hajj for us specifically or for the people generally? He said: \"Rather, for us specifically.\" How can this be authentic when he (peace and blessings of Allah be upon him) says: \"Umrah has entered Hajj until the Day of Resurrection, no, but for ever and ever...\" especially since it was issued as an answer to a question like the question of Bilal mentioned: \"Is our Mut'ah (Tamattu') for now or for ever and ever?\" Furthermore, this hadith of Al-Harith is defective regarding its chain as well, which is the anonymity (Jahala) of Al-Harith. Therefore, a group of Imams weakened his hadith, such as Ahmad, Ibn Hazm, and Ibn al-Qayyim. I have detailed this in \"Silsilat al-Ahadith al-Da'ifah\" (Number after 1000). As for what Muslim and others narrated from Abu Dharr that Mut'ah in Hajj was specific to them, despite being Mawquf (statement of a Companion), it contradicts the Marfu' (Prophetic) hadith. Its apparent meaning is something no one says, due to the agreement of all scholars - as far as we know - on the permissibility of Tamattu' in Hajj. How could it not be, when it is in the Book of Allah the Exalted: (So whoever performs 'Umrah [during the Hajj months] to be followed by Hajj, [offers] what can be obtained with ease of sacrificial animals) [61].\n\nNone",
    "book_id": "399",
    "new_page_number": 60
  },
  {
    "serial_number": "4358699",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 62,
    "volume_number": 1,
    "text": "36 - (Jabir said: So he ordered us when we dissolved Ihram to offer a sacrifice (Hady) (35) and to share\n\nthe group of us in the sacrifice: M, TY, HM] [every seven of us in a camel: TY, HM] [So whoever did not have a sacrifice with him should fast three days and seven when he returns to his family: MA, HQ]\n\n37 - [He said: So we said: What kind of dissolving (Hill)? He said: The complete dissolving: M, NKH, TH, TY, HM] (36)\n\n38 - [He said: So that was difficult for us and our chests were constrained by it: N, HM] Descending at Al-Batha\n\n39 - [He said: So we went out to Al-Batha (37). He said: So a man would say: My last contact with my wife was today: HM] (38)",
    "foot_note": "1. (34) He added in another hadith: As for the people of happiness, they are facilitated for the deeds of the people of happiness, and as for the people of misery, they are facilitated for the deeds of the people of misery. Then he recited: (As for he who gives and fears Allah * And believes in the best [reward] * We will ease him toward ease * But as for he who withholds and considers himself free of need * And denies the best [reward] * We will ease him toward difficulty). Narrated by Al-Bukhari and others.\n35. Hady (sacrifice), with Tashdid or Takhfif (on the Ya), is what is gifted to the Sacred House from livestock to be slaughtered. Nihaya [62].\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 61
  },
  {
    "serial_number": "4358704",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 63,
    "volume_number": 1,
    "text": "40 - [He said: So we discussed among ourselves and said: We came out as pilgrims intending only Hajj and not intending anything else. Until there was nothing between us and Arafah except four: HM]\n\n(And in a narration: five [nights] we were ordered to go in unto our women, so we come to Arafah with our male organs dripping semen (39) [from women]. He said: Jabir said with his hand (the narrator said): As if I am looking at his saying with his hand moving it. [They said: How can we make it Mut'ah (Tamattu') when we have named it Hajj?: KH, M]\n\n41 - He said: [So that reached the Prophet (peace and blessings of Allah be upon him). We do not know if something reached him from the heaven or something reached him from the people: M] His Sermon (peace and blessings of Allah be upon him) Confirming the Annulment and the Companions' Obedience to Him",
    "foot_note": "1. (36) Meaning that which becomes forbidden for the Muhrim. Al-Hafiz said: It is as if they knew that Hajj has two dissolvings, so they wanted clarification on that. He clarified to them that they dissolve completely because Umrah has only one dissolving.\n37. Meaning the Batha of Mecca. It is Al-Abtah, which is a wide watercourse with fine pebbles, as in Al-Qamus and others, located east of Mecca.\n38. As if they were disapproving of that. This indicates that some of them had dissolved Ihram after his command (peace and blessings of Allah be upon him) to do so, but there remained something in their souls about it. As for the others, they delayed until he (peace and blessings of Allah be upon him) addressed them with the coming sermon and emphasized the command to annul, so they all dissolved Ihram (may Allah be pleased with them) [63].\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 62
  },
  {
    "serial_number": "4358707",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 64,
    "volume_number": 1,
    "text": "42 - [So he stood up: M, NKH, N, MJ, TH] [and addressed the people, praised Allah and extolled Him: TH, SA, HM] and said: [Are you teaching me about Allah, O people?: KHA] You have known that I am the most fearing of Allah among you, the most truthful of you, and the most righteous of you. [Do what I command you, for I: M, KH] if not for my sacrificial animal (Hady), I would have dissolved Ihram as you dissolve. [But no forbidden thing becomes lawful from me (40) until the Hady reaches its place: KH] (41). If I had known beforehand about my affair what I know now, I would not have driven the Hady, so dissolve Ihram: M, NKH, N, MJ, TH, SA, HQ]\n\n43 - [He said: So we had intercourse with women, used perfume, and wore our clothes: M, NKH, N, HM] [And we heard and obeyed: M, NKH, TH]\n\n44 - [So all the people dissolved Ihram and cut their hair except the Prophet (peace and blessings of Allah be upon him) and whoever had a Hady with him: MJ, TH, HQ]\n\n45 - [He said: And no one among them had a Hady except the Prophet (peace and blessings of Allah be upon him) and Talhah: KH, HQ, HM] (42) Arrival of Ali from Yemen imitating the Ihram of the Prophet (peace and blessings of Allah be upon him)\n\n46 - And Ali arrived [from his duties: M, N, SHA, HQ] (43) from Yemen with the camels of the Prophet (peace and blessings of Allah be upon him)",
    "foot_note": "1. (39) It is an indication of the recentness of intercourse with women. Nawawi.\n40. Meaning any forbidden thing. The meaning is: No forbidden thing becomes lawful for me. Fath.\n41. Meaning when it is slaughtered on the day of Mina [64].\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 63
  },
  {
    "serial_number": "4358712",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 65,
    "volume_number": 1,
    "text": "47 - He found Fatimah (may Allah be pleased with her) among those who had dissolved Ihram: [She had combed her hair: JA]\n\nand wore dyed clothes and used kohl. He disapproved of that from her [and said: Who ordered you to do this?: D, HQ]. She said: My father ordered me to do this.\n\n48 - He said: Ali used to say in Iraq: So I went to the Messenger of Allah (peace and blessings of Allah be upon him) complaining (44) about Fatimah for what she did, asking for the verdict of the Messenger of Allah (peace and blessings of Allah be upon him) regarding what she mentioned from him. I informed him that I disapproved of that from her. [She said: My father ordered me to do this: D, HQ]. He said: She spoke the truth, she spoke the truth [she spoke the truth: N, JA, HM]. [I ordered her to do it: N, JA, HM].\n\n49 - Jabir said: He said to Ali: What did you say when you assumed Ihram for Hajj? He said: I said: O Allah, I assume Ihram with what the Messenger of Allah (peace and blessings of Allah be upon him) assumed Ihram with.\n\n50 - He said: Since I have the Hady with me, do not dissolve Ihram [and remain in Ihram as you are: N].",
    "foot_note": "1. (42) This is what Jabir (may Allah be pleased with him) observed, so it does not contradict the saying of Aisha: \"The Hady was with the Prophet (peace and blessings of Allah be upon him), Abu Bakr, Umar, and those of wealth.\" And her sister Asma said: \"Al-Zubayr had Hady so he did not dissolve Ihram.\" Muslim narrated both (4: 30, 55). Because the one who knows is a proof over the one who does not know, and the affirmer takes precedence over the negator. See \"Fath al-Bari\" (3: 473).\n43. Meaning from his work in striving for collecting Sadaqah (charity). But with what is established in the Sharia that Sadaqah is not lawful for Muhammad nor for the family of Muhammad, it is possible that Ali managed the Sadaqah and other things voluntarily, or he was given payment for it from other than the Sadaqah, as Al-Qadi said and Al-Nawawi deemed good. However, Al-Nawawi went further to say that 'Si'aya' (striving/work) is not specific to Sadaqah but is used for general authority, even if its usage is mostly for authority over Sadaqah. See his explanation of Muslim [65].\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 64
  },
  {
    "serial_number": "4358717",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 66,
    "volume_number": 1,
    "text": "51 - He said: He said the total of the Hady that Ali brought from Yemen and what the Prophet (peace and blessings of Allah be upon him) brought [from Medina: D, N, MJ, JA, HQ] was one hundred [camels: MI].\n\n52 - He said: So all the people dissolved Ihram (45) and cut their hair except the Prophet (peace and blessings of Allah be upon him) and whoever had Hady with him (46). Heading to Mina in Ihram on the Eighth Day\n\n53 - When it was the Day of Tarwiyah [and we made Mecca behind us: KH, M, NKH, N, HM] they headed to Mina (47) and assumed Ihram for Hajj [from Al-Batha: KH, M, TH, HQ, HM].",
    "foot_note": "1. (44) Tahreesh: Incitement, and the meaning here is mentioning what necessitates his reprimand. Nawawi [66].\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 65
  },
  {
    "serial_number": "4358720",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 67,
    "volume_number": 1,
    "text": "54 - [He said: Then the Messenger of Allah (peace and blessings of Allah be upon him) entered upon Aisha (may Allah be pleased with her) and found her weeping. He said: What is the matter with you? She said: My matter is that I have menstruated, the people have dissolved Ihram and I have not, and I have not circumambulated the House, and people are going to Hajj now. He said: This is a matter Allah has decreed for the daughters of Adam.\n\nSo bathe, then assume Ihram for Hajj [then perform Hajj and do what the pilgrim does except do not circumambulate the House and do not pray: HM, D] (48). So she did: M, NKH, D, N, TH, HQ, HM]. (And in a narration: So we performed all the rites except that she did not circumambulate the House: HM).\n\n55 - The Messenger of Allah (peace and blessings of Allah be upon him) rode (49) and prayed with her (meaning: Mina, and in a narration: with us: D) Zuhr, Asr, Maghrib, Isha, and Fajr.",
    "foot_note": "1. (45) Al-Nawawi said: \"It uses a general term but intends specificity because Aisha did not dissolve Ihram and she was not among those who drove the Hady. The meaning of his saying: 'All the people dissolved' is most of them.\" I say: As for her not dissolving, it is explicit in hadiths, including this hadith of Jabir in the following paragraph. As for her not driving the Hady, it is Aisha's statement: \"Those who did not drive the Hady dissolved, and his wives did not drive the Hady.\" Muslim and others narrated it from her hadith.\n46. This paragraph preceded under number (44). It is repeated in some of the extractions of the hadith.\n47. Al-Nawawi said: \"In this is a clarification that the Sunnah is that no one proceeds to Mina before the Day of Tarwiyah. Malik disliked that, and some of the Salaf said there is no harm in it. Our school is that it is contrary to the Sunnah [67].\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 66
  },
  {
    "serial_number": "4358723",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 68,
    "volume_number": 1,
    "text": "56 - Then he stayed a little until the sun rose (50).\n\n57 - He ordered a dome [for him: D, JA, HQ] of hair to be pitched for him at Namirah (51). Heading to Arafat and Descending at Namirah",
    "foot_note": "1. (48) I say: In it is evidence for the permissibility of a menstruating woman reciting the Quran because it is undoubtedly among the best actions of Hajj. He permitted her all the actions of the pilgrim except Tawaf and Prayer. If recitation were also forbidden for her, he would have clarified it to her as he clarified the ruling of prayer to her. Indeed, recitation is more deserving of clarification because there is no text for its prohibition on her nor consensus, unlike prayer. So when he forbade her from that and remained silent about recitation, it indicated its permissibility for her, because delaying clarification from the time of need is not permissible as established in the principles (Usul). This is clear and not hidden, and praise be to Allah. As for the hadith \"A Junub (impure) person and a menstruating woman should not recite the Quran,\" it is weak. Imam Ahmad said about it: False. I have detailed the discussion on it in \"Irwa al-Ghalil\" (Number: 191), may Allah facilitate its completion.\n49. In it is that riding in those places is better than walking, just as it is better than walking on the road generally. This is the correct view in both cases according to Al-Nawawi. See comment 16.\n50. In it is that the Sunnah is the dawn (Bayan) in Mina and not to leave it until the sun rises [68].\n\nNone",
    "book_id": "399",
    "new_page_number": 67
  },
  {
    "serial_number": "4358725",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 69,
    "volume_number": 1,
    "text": "58 - So the Messenger of Allah (peace and blessings of Allah be upon him) moved (52). Quraysh did not doubt that he would stop at the Sacred Monument (Mash'ar Al-Haram) [at Muzdalifah: D, JA, HQ] [and his stopping place would be there: M] as Quraysh used to do in the Jahiliyyah (53). But the Messenger of Allah (peace and blessings of Allah be upon him) passed (54) until he came to Arafah and found the dome had been pitched for him at Namirah, so he dismounted there.\n\n59 - Until the sun passed the meridian, he ordered Al-Qaswa (his camel), so it was saddled for him. He [rode until: D, MJ] he came to the bottom of the valley (55). Sermon of Arafat",
    "foot_note": "1. (51) With Fatha on the Nun and Kasra on the Mim. Ibn al-Athir said: \"It is the mountain on which the markers of the Haram are at Arafat.\" Namirah is not part of Arafat.\n52. His companions in this march: some were reciting Talbiyah and some were saying Takbir, as in the hadith of Anas in the Two Sahihs.\n53. The meaning of this is that Quraysh in Jahiliyyah used to stand at the Sacred Monument, which is a mountain in Muzdalifah called Quzah. The rest of the Arabs used to pass Muzdalifah and stand at Arafat. So Quraysh thought the Prophet (peace and blessings of Allah be upon him) would stand at the Sacred Monument according to their habit and not pass it. But he (peace and blessings of Allah be upon him) passed it to Arafat because Allah the Exalted ordered him to do so in His saying: (Then depart from the place from where [all] the people depart), meaning the rest of the Arabs other than Quraysh. Quraysh only stood at Muzdalifah because it is from the Haram, and they used to say: We are the people of Allah's Haram, so we do not leave it. Nawawi.\n54. Al-Nawawi said: This is metaphorical, meaning he approached Arafat because he explained it by saying 'he found the dome pitched at Namirah and dismounted there,' and it preceded that Namirah is not part of Arafat [69].\n\nNone",
    "book_id": "399",
    "new_page_number": 68
  },
  {
    "serial_number": "4358727",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 70,
    "volume_number": 1,
    "text": "60 - He addressed the people and said: (Indeed, your blood and your wealth are sacred to you like the sanctity of this day of yours, in this month of yours, in this land of yours. Behold, [and: MJ, JA] [indeed: D, MI, MJ, HQ] everything of the matter of Jahiliyyah is under [these two: MJ, JA] feet of mine, abolished. The blood feuds of Jahiliyyah are abolished, and the first blood I abolish of our blood is the blood of Ibn Rabi'a bin Al-Harith [bin Abdul Muttalib: D, HQ] - he was nursing among Bani Sa'd and Hudhayl killed him. The usury (Riba) of Jahiliyyah is abolished, and the first usury I abolish is our usury: the usury of Abbas bin Abdul Muttalib, for it is abolished entirely (56). So fear Allah regarding women, for you have taken them by the trust [trust: D, SHA, MJ, HQ] of Allah (57) and made their private parts lawful by the word",
    "foot_note": "1. (55) It is the valley of Uranah, with Damma on the Ayn and Fatha on the Ra. It is not part of Arafat. Nawawi.\n56. Its meaning is the excess over the capital, as Allah the Exalted said: (And if you repent, you may have your principal - [capital]). The meaning of abolition is rejection and annulment.\n57. In it is the urging to observe the rights of women, advise regarding them, and treat them with kindness. Many authentic hadiths have come regarding advising about them, clarifying their rights, and warning against shortcomings in that. Let whoever wishes refer to them in \"Al-Targhib wa Al-Tarhib\" (3: 71 - 74) by Al-Mundhiri and \"Riyad al-Salihin\" by Al-Nawawi [70].",
    "book_id": "399",
    "new_page_number": 69
  },
  {
    "serial_number": "4358728",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Hajj of the Prophet ﷺ as Narrated by Jabir رضي الله عنه",
    "edition": "Fifth Edition – 1399 AH",
    "publisher": "Al-Maktab al-Islami – Beirut",
    "page_number": 71,
    "volume_number": 1,
    "text": "…and [verily: D Mi Maj Haq] you have rights over your wives: that they do not allow anyone into your beds (or homes) whom you dislike (59). And if they do so, then strike them *without severity* (60). And they have rights over you: their provision and their clothing, according to what is reasonable. And [indeed: Ja Haq] I have left among you that which, if you hold fast to it, you will never go astray after me: the Book of Allah (61).\n\nAnd you will be asked (and in a wording: are questioned: D Mi Maj Ja Hayq) about me, so what will you say? They said: We bear witness that you have conveyed [the messages of your Lord: Ja] and fulfilled and advised [your Ummah and discharged what was upon you: Ja]. So he said with his index finger, raising it to the sky and pointing it to the people: O Allah, bear witness, O Allah, bear witness) Combining the Two Prayers and Standing at Arafat\n\n61 - Then [Bilal: Mi Maj Ja Hayq] called Adhan [with one call: Mi]\n\n62 - Then he called Iqamah and prayed Dhuhr, then he called Iqamah and prayed Asr\n\n63 - And he did not pray anything between them",
    "foot_note": "58. There are four interpretations mentioned regarding its meaning in the commentary on Sahih Muslim. The correct one is that it refers to Allah’s saying: “Then marry those that please you of women.”\n59. The preferred meaning: that they must not permit into your homes anyone whom you dislike—whether a non-mahram man, a woman, or even one of the wife's mahrams. The prohibition covers all such cases, as explained by An-Nawawi. Refer to his full discussion in his commentary on Sahih Muslim.\n60. “A severe beating” means a harsh, painful striking. Its meaning here: strike them in a manner that is *not* harsh nor harmful. I (the author) say: This is part of the authority (qiwāmah) of men over women, as Allah said: “Men are guardians over women by what Allah has given one over the other and by what they spend from their wealth… And those [wives] whose disobedience you fear—advise them, forsake them in bed, and strike them; but if they obey you, seek no means against them. Indeed, Allah is Most High, Great.”\n61. I (the author) say: The Messenger of Allah ﷺ spoke the truth: for when the later Muslims—except for a few—did not hold firmly to the Book of Allah and did not adhere to the Sunnah of His Prophet ﷺ, they went astray and were humiliated. This happened when they made the opinions and schools of men the primary reference. Whatever from the Qur’an and Sunnah agreed with them, they accepted; and whatever disagreed, they rejected—until one of them even said: “Every verse or hadith that contradicts the madhhab is considered abrogated.” May Allah have mercy on Mālik, who said: ‘The latter part of this Ummah will not be rectified except by what rectified its earliest part.’ Therefore, Muslims must hold fast to the Book of their Lord and make it the judge in all their affairs, and they must not place over it the opinions of men—whether Eastern or Western.\n[71].\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 70
  },
  {
    "serial_number": "4358733",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 72,
    "volume_number": 1,
    "text": "64 - Then the Messenger of Allah, peace be upon him, rode [Al-Qaswa: Ja] until he came to the standing place (Al-Mawqif), so he made the belly of his she-camel Al-Qaswa face the rocks (62) and put the gathering of pedestrians (63) in front of him and faced the Qibla (64)\n\n65 - So he continued standing until the sun set and the yellow color went a little until the disk disappeared (65)\n\n66 - [And he said: I stood here and all of Arafah is a standing place: D N Mi Maj Ja Ha Ham]",
    "foot_note": "1. (62) They are rocks spread out at the bottom of the Mount of Mercy (Jabal al-Rahmah), which is the mountain in the middle of the land of Arafat. Al-Nawawi said: This is the recommended standing place. As for what is famous among the ignorant commoners of climbing the mountain and their illusion that standing is only valid on it, it is a mistake \n63. Meaning their assembly \n64. It came in more than one hadith that he, peace be upon him, stood supplicating raising his hands. Also from the Sunnah is Talbiyah in his standing at Arafah contrary to what Sheikh Al-Islam mentioned in his Mansik (p. 383). Sa'id bin Jubayr said: We were with Ibn Abbas at Arafah. He said to me: O Sa'id, why do I not hear the people saying Talbiyah? I said: They fear Mu'awiyah. He said: So Ibn Abbas went out of his tent and said: Labbayk Allahumma Labbayk. For they have abandoned the Sunnah out of hatred for Ali, may Allah be pleased with him. Extracted by Al-Hakim (1 / 464 - 465) and Al-Bayhaqi (5 / 113) from the path of Maysarah bin Habib from Al-Minhal bin Amr from him. Al-Hakim said: \"Authentic on the condition of the Two Sheikhs\" and Al-Dhahabi agreed with him. Then Al-Tabarani narrated in \"Al-Awsat\" (1 / 115 / 2) and Al-Hakim from another path from Ibn Abbas that the Messenger of Allah, peace be upon him, stood at Arafat, and when he said: Labbayk Allahumma Labbayk, he said: Indeed, good is the good of the Hereafter. Its chain is Hasan and Al-Hakim authenticated it and Al-Dhahabi agreed with him. And in the chapter from Maymunah, the wife of the Prophet, peace be upon him, from her action. Extracted by Al-Bayhaqi \n[72].\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 71
  },
  {
    "serial_number": "4358736",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 73,
    "volume_number": 1,
    "text": "67 - And he let Usama [bin Zaid: Maj Ja Hayq] ride behind him\n\nDeparture from Arafat\n\n68 - And the Messenger of Allah, peace be upon him, moved (and in a narration: departed and upon him was tranquility: D N Maj) (66) and he pulled the rein of Al-Qaswa tight (67) until its head touched the saddle's front part (68) and he was saying with his right hand [like this: and he pointed with his palm towards the sky: N] O people, tranquility, tranquility\n\n69 - Every time he came to a hill (69) of the hills, he loosened it for her a little so she could climb (70) Combining the two prayers at Muzdalifah and spending the night there",
    "foot_note": "1. (65) And he, peace be upon him, was not fasting in this standing of his, for Umm Al-Fadl sent him a cup of milk while he was standing on his camel, so he drank it. As in the \"Two Sahihs\" from her \n[73].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 72
  },
  {
    "serial_number": "4358740",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 74,
    "volume_number": 1,
    "text": "70 - Until he came to Muzdalifah, so he prayed there [so he combined: D Ja] Maghrib and Isha with one Adhan and two Iqamahs (71)\n\n71 - And he did not glorify (pray voluntary prayers) (72) anything between them\n\n72 - Then the Messenger of Allah, peace be upon him, lay down until dawn broke (73)\n\n73 - And he prayed Fajr when the dawn became clear to him with an Adhan and an Iqamah. Standing at the Sacred Monument (Al-Mash'ar Al-Haram)\n\n74 - Then he rode Al-Qaswa until he came to the Sacred Monument (74) [so he climbed upon it: D Maj Ja Hayq]\n\n75 - So he faced the Qibla and supplicated to Him (and in a wording: and praised Allah: D Maj Ja Hayq] and magnified Him (Takbir) and declared His oneness (Tahlil and Tawhid)\n\n76 - He continued standing until it became very light (morning)",
    "foot_note": "1. (66) It is gentleness and calmness. Al-Nawawi said: So in it is that tranquility in departing from Arafat is a Sunnah, and if he finds a gap, he speeds up as in the other hadith \n67. Meaning he pulled and tightened \n68. It is the place where the rider bends his leg in front of the middle of the saddle if he gets tired of riding \n69. In \"Al-Nihaya\": \"Al-Habl is the elongated sand dune. It is said: The huge one of it, and its plural is Hibal. It is said: Hibal in sand are like mountains in non-sand\" \n70. And in this march of his, he was saying Talbiyah, he did not stop Talbiyah as in the hadith of Al-Fadl bin Abbas in the \"Two Sahihs\" \n71. This is the correct view. As for what is in some schools of thought that he calls Iqamah once, it is contrary to the Sunnah. Even if that was reported in some paths, it is Shadh (anomalous), just as Adhan was not reported at all in some hadiths. See: \"Nasb Al-Rayah\" (3 / 69 - 70) \n[74].\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 73
  },
  {
    "serial_number": "4358747",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 75,
    "volume_number": 1,
    "text": "77 - (And he said: I stood here and all of Muzdalifah is a standing place: M D N Maj Ja Ham)\n\nDeparture from Muzdalifah to throw the Jamrah\n\n78 - So he departed [from Jam': Hayq] before the sun rose [and upon him was tranquility: D T Hayq Ham] (75)\n\n79 - And he let Al-Fadl bin Abbas ride behind him (76) - and he was a man with beautiful hair, white and handsome",
    "foot_note": "1. (72) Meaning he did not pray Subhah, meaning voluntary prayer \n73. Ibn Al-Qayyim said: He did not enliven that night (with prayer), nor is anything authentic from him regarding enlivening the nights of the two Eids. I say: It is as he said, and I have explained the status of those hadiths in \"Al-Ta'liq Al-Ghayb 'ala Al-Targhib wal-Tarhib\" \n74. The intended meaning here is Quzah with Dammah on Qaf and Fatha on Zay and un-dotted Ha, which is a known mountain in Muzdalifah. This hadith is the proof of the jurists that the Sacred Monument is Quzah. The majority of exegetes and people of Seerah and Hadith said: The Sacred Monument is all of Muzdalifah. Nawawi \n[75].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 74
  },
  {
    "serial_number": "4358751",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 76,
    "volume_number": 1,
    "text": "80 - When the Messenger of Allah, peace be upon him, departed, women in litters (77) passed by him running. So Al-Fadl began looking at them, so the Messenger of Allah, peace be upon him, put his hand on Al-Fadl's face. So Al-Fadl turned his face to the other side, so the Messenger of Allah, peace be upon him, turned his hand from the other side on Al-Fadl's face turning his face away from the other side looking (78)",
    "foot_note": "1. (75) And he continued, peace be upon him, with his Talbiyah, not stopping it \n76. In it and in the previous paragraph (Number: 65) is the permissibility of letting someone ride behind if the mount is capable, and the hadiths have supported it as Al-Nawawi said \n77. I say: This story is different from the one narrated by Ali and Ibn Abbas regarding Al-Fadl looking at the Khath'amiyyah woman in several aspects, including: That in their hadith it was on the Day of Nahr, and this was on the morning of Muzdalifah before coming to the valley of Muhassir. And in Ali's hadith is another benefit which is the declaration that the story occurred in Mina at the place of slaughter after throwing Jamrat Al-Aqaba. As narrated by Ahmad (1 / 75 - 76) and his son in his \"Zawa'id\" (1 / 76 and 81) and Al-Mukhallis in \"Al-Fawa'id Al-Muntaqah\" (9 / 220 / 1) with a Hasan chain as Al-Hafiz said and Al-Tirmidhi authenticated. In that is a clear refutation of those among the early and late scholars who claim that the Khath'amiyyah woman was in Ihram and that is why the Prophet, peace be upon him, did not order her to cover her face. They say that to reject the explicit indication of the hadith that the woman's face is not 'awrah, for if it were 'awrah he would have ordered her to cover. Even if it were accepted that she was in Ihram, Ihram does not prevent covering, especially in this case where Satan almost entered between her and Al-Fadl. It only prevents Niqab and Burqa' and the like. So how when there is nothing in the hadith that she was in Ihram? And how when it contains that the story was after throwing the Jamrah and at the place of slaughter as preceded, and in this state everything becomes lawful for her except marriage as will come. So if it were assumed that covering was not permissible for her before that, the prohibition has been removed. I have detailed the discussion on that in \"Hijab Al-Mar'ah Al-Muslimah\", especially in the second edition which is imminent, Allah Almighty willing \n[76].",
    "book_id": "399",
    "new_page_number": 75
  },
  {
    "serial_number": "4358752",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 77,
    "volume_number": 1,
    "text": "81 - Until he came to the valley of Muhassir, so he hurried slightly [and said: Tranquility (Al-Sakinah) be upon you: Mi]\n\nThrowing the Great Jamrah\n\n72 - Then he took the middle road (81) which comes out [at: N D Mi Maj Ja Hayq] the Great Jamrah until he came to the Jamrah which is at the tree\n\n73 - So he threw pebbles at it [in the forenoon (Duha): M Nakh D T Tah Ja Qat Hayq Ham] with seven pebbles (82)",
    "foot_note": "1. (79) With Dammah on Mim, Fathah on Ha, and Kasrah on the stressed Sin. It was named so because the elephant of the People of the Elephant grew weary (Hassara) in it, meaning tired and fatigued. Ibn Al-Qayyim said: \"Muhassir is a barrier between Mina and Muzdalifah, belonging neither to this nor that.\" I say: But in Sahih Muslim and Al-Nasa'i from Al-Fadl bin Abbas that Muhassir is from Mina \n80. Meaning he hastened his pace as in other than this hadith. Al-Nawawi said: It is a Sunnah from the Sunnahs of walking in that place. Ibn Al-Qayyim said: \"This was his habit, peace be upon him, in places where Allah's punishment descended on His enemies. He did likewise when passing through Al-Hijr and the dwellings of Thamud; he covered his head with his garment and hastened his pace\" \n[77].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 76
  },
  {
    "serial_number": "4358756",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 78,
    "volume_number": 1,
    "text": "74 - saying Takbir (Allahu Akbar) with every pebble of them, like the pebbles of Khadhf (flicking) (83)",
    "foot_note": "1. (81) Al-Nawawi said: It implies that taking this road on return from Arafat is a Sunnah, and it is different from the road he took to go to Arafat \n82. And then he stopped, meaning his Talbiyah, as in the hadith of Al-Fadl and others \n83. Al-Nawawi said: \"It is about the size of a broad bean. It should not be bigger nor smaller, but if it is bigger or smaller, it suffices.\" In \"Al-Nihaya\": \"Al-Khadhf is your throwing a pebble or datestone which you hold between your two index fingers and throw.\" I say: This manner has been mentioned in some hadiths from more than one Companion, including Abdul-Rahman bin Mu'adh Al-Tamimi who said: The Messenger of Allah, peace be upon him, addressed us while we were at Mina. He said: So our hearing was opened until we could hear what he was saying while we were in our dwellings. He said: So he began teaching us our rituals until he reached the Jamarat, so he said: With pebbles of Khadhf, and he placed his two index fingers one on the other. The Hadith was extracted by Abu Dawud, Al-Nasa'i, Ahmad, and Al-Bayhaqi, and the context is his, with an authentic chain. And in the chapter from Harmala bin Amr in \"Amali Al-Mahamili\" (5 / 120 / 1) and \"Fawa'id Al-Mukhallis\" (7 / 184 / 2) and Ibn Abbas in \"Tabaqat Ibn Sa'd\" in \"Al-Tabaqat\" (2 / 129) and it is with Muslim in a narration of his (4 / 71). But is the intent of this manner clarification and extra explanation of the pebbles of Khadhf which should be thrown, or is the intent teaching and adhering to it without other manners? Both matters are possible, but the first is more apparent, such that Al-Nawawi did not mention other than it. As for Ibn Al-Humam, he mentioned in \"Al-Fath\" the second possibility and rejected it, asserting that the intent is the first. Based on this, there is no specific manner for throwing in the Sunnah that should be adhered to. So however throwing is easy for him [he does it]. Here are some alerts: First: It is not permissible to throw on the Day of Nahr (Sacrifice) before sunrise, even for the weak and women who are permitted to depart from Muzdalifah after midnight. They must wait until the sun rises then throw, due to the hadith of Ibn Abbas, may Allah be pleased with him, that the Prophet, peace be upon him, sent his family ahead and ordered them not to throw at Jamrat Al-Aqaba until the sun rises\". It is an authentic hadith by the sum of its paths. Al-Tirmidhi and Ibn Hibban authenticated it, and Al-Hafiz graded it Hasan in \"Al-Fath\" (3 / 422). It is not valid to oppose it with what is in Al-Bukhari that Asma bint Abi Bakr threw the Jamrah then prayed Fajr after the death of the Prophet, peace be upon him, because it is not explicit that she did that with permission from him, peace be upon him, unlike her departure after midnight, for she explicitly stated that the Prophet, peace be upon him, permitted that for the weak (Za'n). So it is possible that she understood from this permission permission also to throw at night, and his prohibition, peace be upon him, which Ibn Abbas preserved, did not reach her. Second: There is a concession to throw on this day after the sun passes the meridian (Zawal) even until night. So whoever finds hardship in throwing in the forenoon can enjoy it. The evidence is the hadith of Ibn Abbas also who said: The Prophet, peace be upon him, was being asked on the Day of Nahr at Mina and he would say: No harm (La haraj). A man asked him and said: I shaved before I slaughtered? He said: Slaughter and no harm. He said: I threw after evening came. He said: No harm. Narrated by Al-Bukhari and others. Ash-Shawkani went to this view, and before him Ibn Hazm. He said in \"Al-Muhalla\": The Prophet, peace be upon him, only forbade throwing it before the sun rises on the Day of Nahr, and permitted throwing it after that even if evening comes, and this applies to both night and evening. So preserve this concession, for it saves you from falling into committing the prohibition of the Messenger, peace be upon him, mentioned regarding throwing before sunrise, which many pilgrims violate claiming necessity. Third: That the Muhrim, if he throws Jamrat Al-Aqaba, everything becomes lawful for him except women, even if he has not shaved, due to the hadith of Aisha, may Allah be pleased with her: \"I perfumed the Messenger of Allah, peace be upon him, with my hand with Dharirah for the Farewell Hajj for the lawful state (Hill) and Ihram when he assumed Ihram and when he threw Jamrat Al-Aqaba on the Day of Nahr before he circumambulated the House\". Narrated by Ahmad with an authentic chain on the condition of the Two Sheikhs, and its origin is with them. This was said by Ata, Malik, Abu Thawr, and Abu Yusuf, and it is a narration from Ahmad. Ibn Qudamah said in \"Al-Mughni\" (3 / 439): \"And it is the correct view if Allah Almighty wills.\" Ibn Hazm went to this view, rather he said: It becomes lawful for him just by the entry of the time of throwing even if he did not throw. As for the condition of shaving with throwing as came in some Madhhabs and more than one writer on rituals, it contradicts this authentic hadith and there is no hadith suitable to oppose it. As for the hadith \"If you throw and shave - added in a narration: and slaughter - then everything becomes lawful for you except women\", it is weak in chain and disturbed (Mudtarib) in text as I explained in \"Al-Ahadith Al-Da'ifah\" (Number after one thousand). Fourth: That it is permissible for him to pick up pebbles from wherever he wishes as Ibn Taymiyyah, may Allah have mercy on him, said. That is because the Prophet, peace be upon him, did not specify a place for that. The most that came regarding it is the hadith of Ibn Abbas (and in a narration: Al-Fadl bin Abbas) who said: The Messenger of Allah, peace be upon him, said to me on the morning of Al-Aqaba (and in a narration: the morning of Nahr, and in another: the morning of Jam') while he was on his mount: Pick up for me. So I picked up pebbles for him about the size of pebbles of Khadhf. When I put them in his hand he said: Like these three times, and beware of extremism (Ghulu) in religion, for those before you were destroyed by extremism in religion. Extracted by Al-Nasa'i, Ibn Majah, Ibn Al-Jarud in \"Al-Muntaqa\" (Number 473) and the context is his, Ibn Hibban in his Sahih, Al-Bayhaqi, and Ahmad (1 / 215, 347) with an authentic chain. This, although it has no text regarding the place, implies that picking up was at Jamrat Al-Aqaba according to the second narration and likewise the first, and most narrators are upon it. It seems Ibn Qudamah noticed this meaning so he said in \"Al-Mughni\" (3 / 425) \"And that was at Mina\". So what many pilgrims do of picking up pebbles at Muzdalifah and upon their arrival there is contrary to the Sunnah, along with the burden in it of carrying pebbles for every day. Know that there is no prevention from throwing Jamarat with pebbles that have been thrown with, as no evidence has come for prohibition. Al-Shafi'i and Ibn Hazm, may Allah have mercy on them, said this, contrary to Ibn Taymiyyah. Then in the hadith of Al-Fadl bin Abbas, may Allah be pleased with them, is that throwing with pebbles bigger than pebbles of Khadhf is extremism in religion, and it is bigger than a chickpea and smaller than a hazelnut. So what can be said about what some ignorant people do of throwing Jamarat with shoes/sandals? May Allah reform the condition of Muslims and acquaint them with the Sunnah of their Noble Prophet and grant them success to act upon it if they want true happiness in this world and the Hereafter \n[78].",
    "book_id": "399",
    "new_page_number": 77
  },
  {
    "serial_number": "4358757",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 79,
    "volume_number": 1,
    "text": "85 - [So: D Hayq] he threw from the bottom of the valley [while he was on his mount [while he was: N] saying: Take your rituals (84), for I do not know, perhaps I will not perform Hajj after this Hajj of mine: M D N Hayq Ham Sa'] (85)\n\n86 - [He said: And he threw after the Day of Nahr [in the rest of the Days of Tashreeq: Ham] (86) when the sun passed its meridian: M D N T Mi Maj Taha Ja Ha Hayq Ham]\n\n87 - [And Suraqah met him while he was throwing Jamrat Al-Aqaba and said: O Messenger of Allah, is this for us specifically? He said: No, rather forever: Kh M Hayq Ham] (87) Slaughtering and Shaving\n\n88 - Then he went to the place of slaughter and slaughtered sixty-three [camels (Budnah): Maj] with his own hand",
    "foot_note": "1. (84) This Lam is Lam al-Amr (imperative Lam), meaning take your rituals as occurred in a narration other than Muslim. Its estimation is: These matters I performed in my Hajj of words, actions, and forms are the matters of Hajj and its description, and they are your rituals. So take them from me, accept them, memorize them, act upon them, and teach them to people. This hadith is a great principle in the rituals of Hajj, and it is like his saying, peace be upon him, in prayer: \"Pray as you have seen me praying.\" Nawawi \n85. In it is an indication of bidding them farewell and announcing to them the nearness of his death, peace be upon him, and urging them to care about taking from him and seizing the opportunity to accompany him and learn matters of religion. For this reason, it was called the Farewell Hajj. From him \n[79].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 78
  },
  {
    "serial_number": "4358761",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 82,
    "volume_number": 1,
    "text": "89 - Then he gave to Ali so he slaughtered what remained [he says: what was left: D Ja Hayq] and he made him a partner in his sacrificial animal\n\n90 - Then he ordered a piece (Bad'ah) (88) from every camel, so it was put in a pot and cooked, so they ate from its meat and drank from its broth\n\n91 - (And in a narration he said: The Messenger of Allah, peace be upon him, slaughtered a cow on behalf of his wives: M)\n\n92 - (And in another he said: So we slaughtered the camel (and in another: the camel was slaughtered: Ham) for seven and the cow for seven: M Nakh Ham) (And in a fifth narration from him he said: So we shared in the camel seven [people]. A man said to him: What about the cow, can it be shared? He said: It is only from the Budn (camels/cows for sacrifice): Nakh)",
    "foot_note": "1. (86) They are the three days following the Day of Nahr. The opinion of the majority of scholars is that throwing is not permissible in these three days except after Zawal (sun passing meridian) due to this hadith. Al-Nawawi said: \"And know that throwing the Jamarat of the Days of Tashreeq requires order, which is starting with the First Jamrah next to Masjid Al-Khaif, then the Middle one, then Jamrat Al-Aqaba. It is recommended to stand after throwing the first one near it facing the Qibla for a long time supplicating and remembering Allah, and stand likewise at the second, and not stand at the third. The meaning of that is established in Sahih Al-Bukhari from the narration of Ibn Umar, may Allah be pleased with them, from the Prophet, peace be upon him. This is recommended on each of the three days. And Allah knows best \n87. Thus in this narration which is from the path of Ata from Jabir. In the other narration preceded in paragraph (33) is that Suraqah said that while he was at the bottom of Al-Marwa after he, peace be upon him, finished Sa'y. So it appears he asked twice, as if for verification and confirmation. And Allah knows best\". And see Fath Al-Bari (3: 480) \n[82].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 79
  },
  {
    "serial_number": "4358765",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 83,
    "volume_number": 1,
    "text": "93 - (And in a narration: Jabir said: We used not to eat from the Budn except\n\nthree [days] of Mina, so the Messenger of Allah, peace be upon him, granted us a concession saying: (Eat and store provisions): Ham). [He said: So we ate and stored provisions: Kh Ham] [until we reached Medina with it] (89) Lifting the harm from one who advanced something of the rituals or delayed the Day of Nahr\n\n94 - (And in a narration: The Messenger of Allah, peace be upon him, slaughtered [then shaved: Ham] (90)",
    "foot_note": "1. (88) Al-Nawawi said: \"Al-Bad'ah with Fatha on Ba only, and it is a piece of meat. In it is the recommendation of eating from the voluntary sacrificial animal and his Udhiyah.\" I say: It is known that the Prophet, peace be upon him, was Qarin, and likewise Ali, may Allah be pleased with him, and the Qarin must offer a sacrificial animal. Therefore, his sacrificial animal, peace be upon him, was not all voluntary sacrifice, but some of it was obligatory. The hadith is explicit that he took a piece from every camel. So restricting the recommendation to the voluntary sacrifice is not apparent. Rather, Siddiq Hasan Khan said in \"Al-Rawdah Al-Nadiyyah\" (1: 274) after quoting Al-Nawawi's words: \"The apparent meaning is that there is no difference between voluntary sacrifice and others due to the Almighty's saying: 'So eat from them'\" \n[83].\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 80
  },
  {
    "serial_number": "4358768",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 84,
    "volume_number": 1,
    "text": "95 - And he sat [at Mina on the Day of Nahr: Maj] for the people. So he was not asked [that day: Maj] about anything [advanced before something: Maj] except that he said: (No harm, no harm) (91)\n\nuntil a man came to him and said: I shaved before I slaughtered? He said: (No harm)\n\n96 - Then another came and said: I shaved before I threw? He said: No harm\n\n97 - [Then another came to him and said: I circumambulated before I threw? He said: No harm: Mi Hib]\n\n98 - [Another said: I circumambulated before I slaughtered. He said: Slaughter and no harm: Tah]\n\n99 - [Then another came to him and said: I slaughtered before I threw? He said: [Throw and: Tay Ham] no harm: Mi Maj Tah Hib Tay Ham]",
    "foot_note": "1. (89) And Lady Aisha, may Allah be pleased with her, had perfumed him, peace be upon him, with musk, and that was after his throwing, peace be upon him, of Jamrat Al-Aqaba on the Day of Nahr as preceded \n90. In it is that the Sunnah is shaving after slaughtering and that slaughtering is after throwing. It is from the Sunnah that the barber starts with the right side of the shaved person contrary to the Hanafi school due to the hadith of Anas bin Malik that the Messenger of Allah, peace be upon him, came to his place at Mina and slaughtered, then said to the barber: Take, and pointed to his right side then the left, then began giving it to the people. Narrated by Muslim. The verifier Ibn Al-Humam was fair here, so he said in \"Al-Fath\" after this hadith: And this indicates that the Sunnah in shaving is starting with the right side of the shaved person and his head, which is contrary to what was mentioned in the Madhhab, and this is the correct view \n91. Its meaning is: Do what remains upon you and what you have done suffices you and there is no harm upon you in advancing and delaying. Know that the actions of the Day of Nahr are four: Throwing Jamrat Al-Aqaba, then slaughtering, then shaving, then Tawaf Al-Ifadah. The Sunnah is their order like this as preceded above. If he opposed and advanced some of them over others, it is permissible and there is no ransom upon him due to this hadith and others with its meaning. Al-Nawawi said: And this was said by a group of the Salaf and it is our Madhhab \n[84].\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 81
  },
  {
    "serial_number": "4358774",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 85,
    "volume_number": 1,
    "text": "100 - [Then the Prophet, peace be upon him, said: I slaughtered here and all of Mina is a place of slaughter: Ham Mi M D Ja Hayq] [85]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 82
  },
  {
    "serial_number": "4358775",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 86,
    "volume_number": 1,
    "text": "101 - [And every ravine of Mecca and road and place of slaughter: D Ham Maj Tash Ha Hayq] (92)\n\n102 - [So slaughter in your camps: M Maj D Hayq] Sermon of Nahr\n\n103 - [And Jabir, may Allah be pleased with him, said: He addressed us, peace be upon him, on the Day of Nahr and said: Which day is greatest in sanctity? They said: This day of ours. He said: So which month is greatest in sanctity? They said: Our month. He said: Which land is greatest in sanctity? They said: This land of ours. He said: So indeed your blood and your wealth are sacred upon you like the sanctity of this day of yours in this land of yours in this month of yours. Have I conveyed? They said: Yes. He said: O Allah, bear witness: Ham] Departure for Tawaf Al-Sadr\n\n104 - Then the Messenger of Allah, peace be upon him, rode and departed to the House [so they circumambulated (93)",
    "foot_note": "1. (92) In it is the permissibility of slaughtering sacrificial animals in Mecca as it is permissible to slaughter them in Mina. Al-Bayhaqi narrated in his Sunan (5 / 239) with an authentic chain from Ibn Abbas who said: \"Slaughtering is only in Mecca, and every... is purified from blood, and Mecca is from Mina thus, and in a narration: And Mina is from Mecca and perhaps it is the correct one. Added in the first narration from Ata that Ibn Abbas used to slaughter in Mecca and that Ibn Umar used not to slaughter in Mecca, he used to slaughter in Mina. I say: If pilgrims knew this ruling and a large section of them slaughtered in Mecca, the accumulation of carcasses in Mina and burying them in soil so as not to corrupt the air would decrease, and many would benefit from their sacrifices, and some of what a large section of pilgrims complain about would disappear. That is only due to the ignorance of most of them of Sharia and their abandoning acting upon it and upon what it encouraged of virtues. For example, they sacrifice lean animals and do not seek fat ones, then after slaughtering they leave them without skinning or cutting, so the poor person passes by them and finds nothing in them to encourage him to benefit from them. In my opinion, if they did the following, the complaint would naturally disappear: First: That many of them slaughter in Mecca. Second: That they do not crowd for slaughtering on the Day of Nahr only but slaughter in the Days of Tashreeq as well. Third: Seeking fat sacrifices, skinning and cutting them. Fourth: Eating from them and storing provisions from their meat if possible as the Prophet, peace be upon him, did as preceded in paragraph (90, 93). And the best guidance is the guidance of Muhammad, peace be upon him, and the last of this Ummah will not be rectified except by what rectified its first part. Moreover, there are other means available in this era: If the officials adopted some of them, the problem would be eliminated from its root. One of the easiest is to prepare in the four days of Eid special large trucks with refrigerators to preserve meat, and there be specialized employees in Mina to collect the sacrificial animals and Udhiyahs that their owners did not want, and others to skin and cut them, then they are loaded in those trucks every day of the four days and tour the villages neighboring Mecca Al-Mukarramah and distribute their load of meat from each day to the poor and needy. By that we would have eliminated the problem. Is there anyone to respond? \n[86].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 83
  },
  {
    "serial_number": "4358779",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 87,
    "volume_number": 1,
    "text": "105 - And they did not circumambulate between Safa and Marwa: D Tah Hayq Ham Sa'] (94)\n\n106 - So he prayed Dhuhr in Mecca (95)\n\n107 - So he came to Banu Abdul-Muttalib [while they were: Nakh Mi Maj Ja Hayq] serving water at Zamzam (96). He said: Draw water (97) Banu Abdul-Muttalib, for were it not that people would overcome you for your water service, I would have drawn water with you (98)\n\n108 - So they handed him a bucket and he drank from it) Completion of Aisha's story",
    "foot_note": "1. (93) Then everything forbidden to them became lawful for them as in the Two Sahihs from Aisha and Ibn Umar \n94. Thus Jabir, may Allah be pleased with him, stated generally. Aisha, may Allah be pleased with her, detailed that where she said: \"So those who had raised their voice with Umrah circumambulated the House and between Safa and Marwa, then they became lawful, then they circumambulated another Tawaf after they returned from Mina. As for those who combined Hajj and Umrah, they only circumambulated one Tawaf\". Extracted by the Two Sheikhs. Ibn Al-Qayyim said in \"Zad Al-Ma'ad\": Either it is said Aisha affirmed and Jabir denied and the affirming is prioritized over the denying, or it is said: Jabir's intent is whoever combined with the Prophet, peace be upon him, and drove the sacrificial animal like Abu Bakr, Umar, Talha, Ali and the wealthy, for they only performed Sa'y once and the intent is not the generality of Companions, or Aisha's hadith is defected that her saying: So he circumambulated etc... in the hadith is interpolated (Mudraj) from the saying of Hisham. These are three paths for people regarding her hadith. And Allah knows best. So in Zad Al-Ma'ad. I say: The last path of them is weak because declaring a trustworthy person mistaken without proof is not permissible, especially if he is like Hisham. Then I rectified and said: There is no Hisham in the path of the hadith because it is from the narration of Malik from Ibn Shihab from Urwa bin Al-Zubair from her. This is a chain extremely authentic, so who is the error and interpolation from? Then I found Sheikh Al-Islam Ibn Taymiyyah said in \"Manasik Al-Hajj\" (p. 385 Vol. 2 of Majmu'at Al-Rasa'il Al-Kubra): It has been narrated in the hadith of Aisha that they circumambulated twice, but this addition was said to be from the saying of Al-Zuhri not from the saying of Aisha. Al-Zuhri is a mountain in memorization, so how is he declared mistaken by mere \"it was said\"? I add now in this edition and say: It is strange that Ibn Taymiyyah relies on that and rejects Aisha's hadith with it, saying: Some of them used it - meaning the addition - as evidence that two Tawafs of the House are recommended, and this is weak. The more apparent is what is in Jabir's hadith, supported by his saying: Umrah has entered into Hajj until the Day of Judgment. I say: Aisha's hadith is authentic without doubt, and what it was defected with is not worth mentioning as known. What confirms that are two things: First: That it has another path from her in \"Al-Muwatta\" (Number: 223 Vol. 1: 410) from Abdul-Rahman Ibn Al-Qasim from his father with it, and this is an authentic chain like a mountain in establishment. The other is that it has an explicit authentic witness from the hadith of Ibn Abbas that he was asked about Mut'ah of Hajj so he said: The Muhajirin and Ansar and the wives of the Prophet, peace be upon him, raised their voices in the Farewell Hajj. When we arrived in Mecca the Messenger of Allah, peace be upon him, said: Make your Ihlal with Hajj an Umrah except whoever garlanded the sacrificial animal\". We circumambulated the House and Safa and Marwa and approached women and wore clothes. And he said: \"Whoever garlanded the sacrificial animal, it is not lawful for him until the sacrificial animal reaches its place. Then he commanded us on the evening of Tarwiyah to raise our voices with Hajj. When we finished the rituals we came and circumambulated the House and Safa and Marwa, so our Hajj was complete and upon us was the sacrificial animal...\" The hadith extracted by Al-Bukhari as suspended asserted, and Muslim narrated it outside his Sahih connected, and likewise Al-Isma'ili in his Mustakhraj, and from his path Al-Bayhaqi in his Sunan (5 / 23) and its chain is authentic, its men are men of Sahih. This all confirms the invalidity of the claim of interpolation in the hadith of Aisha, may Allah be pleased with her, and supports that she memorized what Jabir, may Allah be pleased with him, did not memorize. It indicates that Tamattu' necessitates Tawaf again between Safa and Marwa. In the hadith of Ibn Abbas is another very important benefit, which is that whoever does that, his Hajj is complete, and its implication is that whoever does not do that, his Hajj is not complete. This, if it does not indicate that it is a pillar, at least indicates obligation, so how recommendation? As for Sheikh Al-Islam's support for what he went to of non-legitimacy by his saying, peace be upon him: \"Entered Umrah...\", its weakness is not hidden after the command for it was established from the Prophet, peace be upon him and his family and companions \n[87].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 84
  },
  {
    "serial_number": "4358783",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 88,
    "volume_number": 1,
    "text": "109 - [And Jabir, may Allah be pleased with her (sic - him), said: And Aisha menstruated so she performed all the rituals except that she did not circumambulate the House: Kh Ham]\n\n110 - [He said: Until when she became pure, she circumambulated the Kaaba (99) and Safa and Marwa, then he said: You have become lawful from your Hajj and your Umrah together: M D N Hayq Ham]\n\n111 - [She said: O Messenger of Allah, do you set out with Hajj and Umrah and I set out with Hajj? : Kh Ham] (100) [He said: You have the like of what they have: Ham]\n\n112 - [She said: I find in myself that I did not circumambulate the House until I performed Hajj: M D N Tah Hayq Ham]\n\n113 - [He said: And the Messenger of Allah, peace be upon him, was lenient and easy; if she desired something he followed her in it: M Hayq] (101)\n\n114 - [He said: So go with her, O Abdul-Rahman, and let her perform Umrah from Al-Tan'im",
    "foot_note": "1. (95) Thus Jabir said. Ibn Umar said that he prayed Dhuhr at Mina, peace be upon him, as in the \"Two Sahihs\". They differed in preference, and some went to reconciling between the two sayings, but the self is not reassured by any of that. So refer to \"Sharh Muslim\" by Al-Nawawi, \"Zad Al-Ma'ad\", and \"Nayl Al-Awtar\". Completion: Then he returned to Mina and stayed there the Days of Tashreeq throwing the three Jamarat every day in the order mentioned from Al-Nawawi \n96. Meaning they draw water with buckets and pour it into basins and the like and offer it to people \n97. Meaning draw water with buckets and pull them with the rope \n98. Meaning: Were it not for my fear that people would believe that is from the rituals of Hajj and crowd upon it such that they overcome you and push you away from drawing water, I would have drawn water with you due to the abundance of virtue of this drawing water. Nawawi \n[88].\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 85
  },
  {
    "serial_number": "4358789",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 91,
    "volume_number": 1,
    "text": "115 - [So she performed Umrah after Hajj: Kh Ham] [Then she came: Ham] And that was\n\nthe night of Al-Hasbah: M T Hayq Ham] (102)\n\n116 - [And Jabir said: The Messenger of Allah, peace be upon him, circumambulated the House in the Farewell Hajj (103) on his mount touching the Stone with his hooked staff so that people would see him and to be elevated and so they would ask him, for the people covered him: M D Ham]",
    "foot_note": "1. (99) Meaning Tawaf Al-Ifadah and Sadr. Al-Hafiz said (3 / 480): And all narrations agreed that she performed Tawaf Al-Ifadah on the Day of Nahr \n100. In another hadith: She said: Do people return with two rewards and I return with one reward. Narrated by Muslim from her hadith \n101. Meaning: If she desired something that has no deficiency in religion - like her request to perform Umrah and other things - he answered her to it. In it is good companionship of spouses, the Exalted said: (And live with them in kindness), especially in what is from the chapter of obedience. Nawawi \n[91].\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 86
  },
  {
    "serial_number": "4358792",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 92,
    "volume_number": 1,
    "text": "117 - [And he said (104): A woman lifted a boy of hers to the Messenger of Allah, peace be upon him\n\nand said: O Messenger of Allah, is there Hajj for this one? He said: Yes, and for you is a reward: T Maj Hayq] (105) This is the last of what I found of (The Pilgrimage of the Prophet, peace be upon him, by the narration of Jabir, may Allah be pleased with him). Praise be to Allah for His success and I ask Him for more of His favor. I decided to conclude the book by presenting a summary of what was mentioned in it of the rituals of Hajj specifically which concerns every pilgrim to know and be aware of closely, based on the suggestion of some brothers, may Allah reward them with good. To complete the benefit, I will add to that the other rituals which were pointed out in the commentary, so that it becomes a comprehensive summary, if Allah Almighty wills:",
    "foot_note": "1. (102) With Fatha on Ha and Sukun on the un-dotted Sad, it is what is after the Days of Tashreeq. It was named so because they departed from Mina and camped in Al-Muhassab and spent the night there. Nawawi. Al-Muhassab is the ravine whose exit is to Al-Abtah between Mecca and Mina. As in Al-Nihaya. And Jabir, may Allah be pleased with him, despite his good context of the Hajj of the Prophet, peace be upon him, did not mention his Farewell Tawaf, peace be upon him, in the narrations from him that we came across. Lady Aisha, may Allah be pleased with her, mentioned that in this story of hers, saying at its end: \"So we came to the Messenger of Allah, peace be upon him, while he was in his dwelling in the middle of the night. He said: Have you finished? I said: Yes. So he announced departure among his companions, so he went out and passed by the House and circumambulated it before the Fajr prayer, then went out to Medina.\" Narrated by Al-Bukhari and Muslim - and the context is his - and Abu Dawud. He, peace be upon him, did not Raml (trot) in this Tawaf nor in Tawaf Al-Sadr as indicated by the hadith of Umar in the Two Sahihs \n103. There is no specification of this Tawaf in the hadith as you see. It preceded that Tawaf Al-Qudum was done by him, peace be upon him, walking, so this is interpreted - due to necessity of reconciliation - either as Tawaf Al-Ifadah or Tawaf Al-Wada'. And Allah knows best \n104. This hadith also came from Ibn Abbas, and in some of its paths is the declaration that the question occurred during his return from Mecca to Medina in a place called Al-Rawha, so I mentioned it here \n[92].\n\nNone",
    "book_id": "399",
    "new_page_number": 87
  },
  {
    "serial_number": "4358794",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 93,
    "volume_number": 1,
    "text": "1 - Ihram in an Izar (lower garment) and Rida (upper garment) (106)\n\n2 - Wearing them and perfuming before it\n\n3 - Ihram from the Meeqat\n\n4 - Ihram of the woman in postpartum bleeding (Nifas) and menstruation after bathing\n\n5 - Ihram with Hajj and Umrah (107)\n\n6 - Hajj riding\n\n7 - Hajj with women and children\n\n8 - Talbiyah with the Talbiyah of the Prophet, peace be upon him, and raising the voice with it",
    "foot_note": "1. (105) Meaning due to carrying him and making him avoid what the Muhrim avoids and doing what the Muhrim does. Al-Nawawi said: In it is evidence for Al-Shafi'i, Malik, Ahmad and the majority of scholars that the Hajj of a boy is valid and correct and he is rewarded for it, although it does not suffice him for the obligatory Hajj of Islam, but rather occurs as voluntary by consensus. He said: Except a sect that deviated and said: It suffices him. Scholars did not pay attention to their saying. Abu Hanifa said his Hajj is not valid. His companions said: They only did it to train him so he gets used to it and does it. Al-Nawawi said: And this hadith refutes them \n106. Sheikh Al-Islam said in Manasik Al-Hajj: \"The Sunnah is to assume Ihram in an Izar and Rida whether they are stitched or unstitched by agreement of the Imams.\" Our friend the teacher of the Prophet's Mosque Sheikh Abdul-Rahman Al-Afriqi, may Allah have mercy on him, said in his book \"Tawdih Al-Hajj wal-Umrah\" (p. 44): \"The meaning of stitched is that there is sewing in the Rida and Izar across or lengthwise. Many laypeople have erred in this, thinking that the forbidden stitched garment is every garment that is sewn whether it is in the form of a human limb or not, but rather being stitched absolutely. This is not correct. Rather, the stitched garment forbidden to wear is what is in the form of a human limb like the shirt, undershirt, jubbah, vest, trousers and everything that fits the human form surrounding his limbs, it is not permissible for the Muhrim to wear it even if woven. As for the Rida joined because of its shortness or narrowness or sewn because of a tear in it, this is permissible\" \n[93].\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 88
  },
  {
    "serial_number": "4358802",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 94,
    "volume_number": 1,
    "text": "9 - Annulment (Faskh) of Hajj for one who intended it as Mufrid (single) or combined Umrah with it and did not drive the sacrificial animal\n\n10 - Tawaf Al-Qudum seven circuits\n\n11 - Al-Idtibaa' (baring the right shoulder) in it\n\n12 - Al-Raml (trotting) in the first three [circuits] of it\n\n13 - Takbir at the Stone\n\n14 - Kissing the Stone. Or touching the Yamani Corner in every circuit\n\n15 - Praying two Rak'ahs after finishing the circuits\n\n16 - Reciting in them (Qul Ya) and (Qul Huwa)\n\n17 - Praying them behind the Station (Maqam)\n\n18 - Drinking from Zamzam and pouring it on the head\n\n19 - Returning to touch the Black Stone\n\n20 - Standing at Safa facing the Qibla\n\n21 - Mentioning Allah on it, declaring His oneness, magnifying Him, praising Him, and declaring there is no god but Him three times\n\n22 - Walking between it and Marwa seven times",
    "foot_note": "1. (107) Sheikh Al-Islam said in \"Al-Manasik\": \"It is recommended to assume Ihram following a prayer, either obligatory or voluntary if it is a time for voluntary prayer in one of the two opinions. In the other: If he prays an obligatory prayer, he assumes Ihram after it. Otherwise, Ihram does not have a specific prayer. This is more likely correct \n[94].\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 89
  },
  {
    "serial_number": "4358816",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet, peace be upon him, as Narrated by Jabir, may Allah be pleased with him",
    "edition": "Fifth - 1399",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 95,
    "volume_number": 1,
    "text": "23 - Running (Sa'y) between them in the bottom of the valley in every circuit [95]\n\n24 - Standing at Marwa\n\n25 - Mentioning [Allah] on it as he did on Safa\n\n26 - Finishing Sa'y at Marwa\n\n27 - Releasing from Ihram for Tamattu' or Qiran who did not drive the sacrificial animal by trimming the hair and wearing clothes and other things\n\n28 - Release of the Mutamatte' by trimming hair not shaving\n\n29 - Raising the voice with Hajj (assuming Ihram) on the Day of Tarwiyah\n\n30 - Going to Mina and spending the night there\n\n31 - Performing Dhuhr prayer and the rest of the five prayers there\n\n32 - Heading from it after sunrise on the Day of Arafah to Arafat\n\n33 - Descending at Namira near Arafat\n\n34 - Combining Dhuhr and Asr there, advanced combination (Jam' Taqdim)\n\n35 - Standing at Arafah while not fasting\n\n36 - The sermon at Arafah\n\n37 - Facing the Qibla raising his hands supplicating at Arafah\n\n38 - Talbiyah at Arafah",
    "foot_note": "None\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 90
  },
  {
    "serial_number": "4358832",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 96,
    "volume_number": 1,
    "text": "39 - Moving on (Ifadah) from Arafah after sunset, while maintaining tranquility [96]\n\n40 - Combining Maghrib and Isha prayers [with] a delayed combination in Muzdalifah\n\n41 - The Adhan for it [is one], with two Iqamahs\n\n42 - Leaving the Sunnah [prayers] between the two prayers\n\n43 - Spending the night there without enlivening the night [with worship]\n\n44 - Praying Fajr when dawn becomes clear\n\n45 - Standing at Al-Mash'ar Al-Haram in it, facing the Qiblah, supplicating, praising [Allah], saying Takbir, and saying Tahlil until it becomes very bright\n\n46 - Departing from it before the sun rises\n\n47 - Hastening slightly in the bottom of [Wadi] Muhassir\n\n48 - Going to the Jamrah via a path other than the path of going to Arafah\n\n49 - Throwing at the major Jamrah on the Day of Sacrifice from the bottom of the valley with seven pebbles during the forenoon (Duha)",
    "foot_note": "None\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 91
  },
  {
    "serial_number": "4358843",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 97,
    "volume_number": 1,
    "text": "50 - Throwing with small pebbles (size of chickpeas/beans) for flicking [97]\n\n51 - Permissibility of throwing at it after the sun has crossed the meridian (Zawal)\n\n52 - Throwing from the bottom of the valley\n\n53 - Saying Takbir with every pebble\n\n54 - Stopping the Talbiyah upon throwing at the Jamrah\n\n55 - Exiting Ihram with the minor release (at-Tahallul al-Asghar) by throwing\n\n56 - Throwing during the Days of Tashreeq after the sun has crossed the meridian (Zawal)\n\n57 - Slaughtering the Hady by the Qarin and the Mutamatti'; so whoever does not find [an animal] fasts three days during Hajj and seven when he returns\n\n58 - Slaughtering a camel, and likewise a cow, for seven people\n\n59 - Slaughtering in Mina and Mecca\n\n60 - Eating from the Hady (sacrificial animal)\n\n61 - Applying perfume after throwing\n\n62 - Shaving [the head]\n\n63 - Starting with the right side of the person being shaved\n\n64 - The sermon on the Day of Sacrifice",
    "foot_note": "None\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 92
  },
  {
    "serial_number": "4358858",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 98,
    "volume_number": 1,
    "text": "65 - Going (Ifadah) for Tawaf al-Sadr (Tawaf al-Ifadah) without Raml (walking quickly with small steps) [98]\n\n66 - The Sa'i of the Mutamatti' after Tawaf al-Ifadah, unlike the Qarin\n\n67 - The order of rituals on the Day of Sacrifice\n\n68 - Exiting Ihram after it, the complete release (al-Hal al-Kull)\n\n69 - Drinking from Zamzam after finishing the Tawaf\n\n70 - Returning to Mina and staying there for the three Days of Tashreeq\n\n71 - Throwing at the three Jamrahs on each day of them after the sun crosses the meridian",
    "foot_note": "None\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 93
  },
  {
    "serial_number": "4358865",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 99,
    "volume_number": 1,
    "text": "72 - Tawaf for Farewell without Raml. With this, the book ends. And our final prayer is that all praise is due to Allah, Lord of the worlds. I saw fit to append to the book in this edition a section in which I list the innovations (Bid'ah) of Hajj, visiting Al-Madinah Al-Munawwarah, and Bayt Al-Maqdis (Jerusalem), because many people do not know them and fall into them, so I loved to increase my advice to them by explaining them and warning against them. That is because a deed is not accepted by Allah, the Blessed and Exalted, unless two conditions are met in it: First: That it be purely for His Face, the Mighty and Majestic. And the other: That it be righteous. And it is not righteous unless it is in accordance with the Sunnah, not contradicting it. And it is established among the verifiers of [99]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 94
  },
  {
    "serial_number": "4358866",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 100,
    "volume_number": 1,
    "text": "the people of knowledge that every alleged act of worship that the Messenger of Allah (peace be upon him) did not legislate for us by his saying, nor did he draw near to Allah by doing it, acts as a contradiction to his Sunnah. For the Sunnah is of two types: Sunnah of action and Sunnah of abandonment. So whatever he (peace be upon him) abandoned of those acts of worship, it is Sunnah to abandon them. Do you not see, for example, that the Adhan for the two Eids and for burying the deceased, despite being a remembrance and glorification of Allah, the Mighty and Majestic, was not permissible to use as a means to draw near to Allah, the Mighty and Majestic? That is only because it is a Sunnah that the Messenger of Allah (peace be upon him) abandoned. His companions (peace be upon him) understood this meaning, so warnings against innovations abounded from them, a general warning as mentioned in its place, until Hudhayfah bin Al-Yaman (may Allah be pleased with him) said: \"Every act of worship that the companions of the Messenger of Allah (peace be upon him) did not perform, do not perform it.\" And Ibn Mas'ud (may Allah be pleased with him) said: \"Follow and do not innovate, for you have been sufficed; stick to the ancient affair.\" So congratulations to him whom Allah has granted success in his worship to follow the Sunnah of His Prophet (peace be upon him) and has not mixed it with innovation. If so, then let him rejoice in Allah, the Mighty and Majestic, accepting his obedience and admitting him into His Paradise. May Allah make us among those who listen to speech and follow the best of it. Know that the innovations that you will encounter are of two types: Innovations for which I found someone among the people of knowledge stating their innovated nature in their books; for these, the sign is attributing them to them. This type is the majority. And the other: Innovations [100]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 95
  },
  {
    "serial_number": "4358867",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 101,
    "volume_number": 1,
    "text": "for which I did not find anyone stating their innovated nature, but the Sunnah or the fundamental scholarly rules judge them to be innovations. The evidence for this is its lack of attribution. The reference for these innovations is [several] matters: First: Weak Hadiths that are not permissible to use as proof nor attribute to the Prophet (peace be upon him). Working by such is not permissible according to us, as I have explained in the introduction to \"Sifat Salat an-Nabi\" (Description of the Prophet's Prayer), and it is the school of thought of a group of the people of knowledge like Ibn Taymiyyah and others. Second: Fabricated Hadiths or those with no basis, the matter of which was hidden from some jurists, especially the later ones among them. They did not support them with any Shariah evidence; rather, they cited them as taken-for-granted matters until they became Sunnahs to be followed. It is not hidden from one with insight into his religion that this is something that is not permissible to follow, for there is no Shariah except what Allah the Exalted legislated. It is enough for the one who deems something good - if he is a Mujtahid - that it be permissible for him alone to act upon what he deemed good, and that Allah does not hold him accountable for it. As for people taking that as a Shariah and a Sunnah, then no, and again no. How [can that be] when some of them contradict the practical Sunnah, as will be pointed out, Allah the Exalted willing [101]\n\nFourth: Customs and superstitions indicated by neither Shariah nor attested to by reason, even if some ignorant people act upon them and take them as a law for themselves, and do not intend [to follow] anyone who supports them, even if in some of that, among those who claim knowledge and dress in their garb. Then let it be known that these innovations are not of one level of danger; rather, they are of degrees. Some of them are Shirk and explicit Kufr (disbelief), as you will see, and some are less than that. But we must know that the smallest innovation a man brings into the religion is forbidden after its nature as an innovation becomes clear. Innovations do not contain - as some imagine - that which is only of the rank of Makruh (disliked). How [can that be] when the Messenger of Allah (peace be upon him) says: (Sahih) \"Every innovation is misguidance, and every misguidance is in the Fire,\" meaning its doer. Imam Al-Shatibi (may Allah have mercy on him) has verified this most completely in his great book \"Al-I'tisam\". Therefore, the matter of innovation is very dangerous. Most people are still heedless of it, and only a group of the people of knowledge know that. Sufficient for you as evidence of the danger of innovation is his saying (peace be upon him): (Sahih) \"Indeed, Allah has blocked repentance from every person of innovation until he leaves his innovation.\" Narrated by Al-Tabarani and Al-Diya' Al-Maqdisi in \"Al-Ahadith Al-Mukhtarah\" and others with a Sahih chain, and Al-Mundhiri classified it as Hasan. I conclude this word with advice I present to the readers from a great Imam among the early scholars of the Muslims, Sheikh Al-Hasan bin Ali Al-Barbahari [101]",
    "foot_note": "None\n\nNone",
    "book_id": "399",
    "new_page_number": 96
  },
  {
    "serial_number": "4358869",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 103,
    "volume_number": 1,
    "text": "one of the companions of the companions of Imam Ahmad (may Allah have mercy on him), who died in the year (329). He (may Allah the Exalted have mercy on him) said: \"Beware of small newly invented matters, for small innovations return until they become large. Likewise, every innovation invented in this Umrah, its beginning was small, resembling the truth, so he who entered into it was deceived by that, then he could not get out of it. So it became great and became a religion that is practiced. So look, may Allah have mercy on you, at everyone whose speech you hear from the people of your time specifically; do not rush and do not enter into anything of it until you ask and look: Did anyone of the companions of the Prophet (peace be upon him) or any of the scholars speak about it? If you find a trace from them regarding it, then hold fast to it, do not go beyond it for anything, and do not choose anything over it, lest you fall into the Fire. And know, may Allah have mercy on you, that a slave's Islam is not complete until he is a follower, attesting [to the truth] and submitting. So whoever claims that anything remains of the matter of Islam that the companions of the Messenger of Allah (peace be upon him) did not suffice us in, then he has lied against them. And sufficient is this as a division and a defamation against them; so he is an innovator, misguided, misguiding, inventing in Islam what is not in it.\" (108)\n\nMay Allah have mercy on Imam Malik, as he said: \"The latter part of this Ummah will not be rectified except by that which rectified its first part. So what was not a religion then, is not a religion today.\" And may blessings of Allah be upon our Prophet who said: \"I have not left anything that brings you closer to Allah except that I have commanded you with it, and I have not left anything that distances you from Allah and brings you closer to the Fire except that I have forbidden you from it.\" And praise be to Allah by whose grace good deeds are completed. Innovations before Islam\n\n1 - Refraining from travel in the month of Safar and avoiding starting actions in it, such as marriage, consummation, and others. (109)\n\n2 - Avoiding travel during the waning of the moon (Mahaq) and when the moon is in Scorpio. (110)",
    "foot_note": "1. (108) Tabaqat Al-Hanabilah by Ibn Abi Ya'la (2 / 18 - 19) \n[103].\n\nNone\n\n1. (109) And the hadith \"Whoever gives me glad tidings of the exit of Safar, I give him glad tidings of Paradise\" is fabricated, as in \"Al-Fatawa Al-Hindiyyah\" (5 / 330) and books of Fabrications.\n\n1. (110) And regarding it is a hadith that is not authentic, as in \"Tadhkirat Al-Mawdu'at\" p. (122) \n[104].",
    "book_id": "399",
    "new_page_number": 97
  },
  {
    "serial_number": "4358873",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 104,
    "volume_number": 1,
    "text": "3 - Avoiding cleaning the house and sweeping it following the travel of a traveler. (\"Al-Madkhal\" by Ibn Al-Hajj) (2 / 67)\n\n4 - Praying two rak'ahs when leaving for Hajj, reciting in the first after Al-Fatihah (Say, \"O Disbelievers\") and in the second (Al-Ikhlas). When finished, he says: \"O Allah, with You I have spread out, and towards You I have turned...\" And reciting Ayat al-Kursi, Surah Al-Ikhlas, Al-Mu'awwidhatayn, and other things mentioned in some books like (\"Ihya\" by Al-Ghazali), (\"Al-Fatawa Al-Hindiyyah\"), (\"Shir'at Al-Islam\"), and others. (111)\n\n5 - Praying four rak'ahs. (112)",
    "foot_note": "None\n\n1. (111) And the hadith: \"A slave has not left behind with his family anything better than two rak'ahs he prays with them when he intends to travel\" has a weak chain, as I explained in \"Silsilat Al-Ahadith Al-Da'ifah\" number 372. So it is not valid to use it for worship, as is established in the principles. So Al-Nawawi's statement, after explaining its weakness, \"It is Sunnah for him to do that,\" is not correct. Similar to it is the hadith of Anas who said: \"The Messenger of Allah (peace be upon him) did not intend a journey except that he said, when rising from his sitting: O Allah, with You I have spread out...\" The Hadith. Narrated by Ibn Adi and Al-Bayhaqi (5 / 250) and it contains Umar - and it is said Amr - bin Musawir, who is Munkar al-Hadith (rejected in hadith) as Al-Bukhari said, and others weakened him.\n\n1. (112) And the hadith reported regarding them is also weak. Al-Khara'iti narrated it in \"Makarim Al-Akhlaq\" from Anas with the wording: \"No one has left behind in his family a successor more beloved to Allah than four rak'ahs the slave prays in his house when he tightens his travel clothes on him...\" The Hadith. Al-Iraqi said: It is weak \n[105].",
    "book_id": "399",
    "new_page_number": 98
  },
  {
    "serial_number": "4358876",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 105,
    "volume_number": 1,
    "text": "6 - The reading by the one intending Hajj, when leaving his house, of the end of Surah (Al-Imran), Ayat al-Kursi, (Indeed, We sent it down) [Al-Qadr], and (The Mother of the Book) [Al-Fatihah], claiming that in them is the fulfillment of the needs of this world and the Hereafter. (113)\n\n7 - Raising the voice with Dhikr and Takbir when seeing off the pilgrims and upon their arrival. (\"Al-Madkhal\") (4 / 322), (\"Majallat Al-Manar\") (12 / 271)\n\n8 - Calling the Adhan when bidding them farewell\n\n9 - The Mahmal (palanquin) and the celebration of the Kiswah (covering) of the Kaaba. (114) (\"Al-Madkhal\") (4 / 213), (\"Al-Ibda' fi Madarr Al-Ibtida'\") (131 - 132), (\"Tafsir Al-Manar\") (10 / 358)\n\n10 - Bidding farewell to the pilgrims by some states with music",
    "foot_note": "1. (113) And regarding that is a Marfu' hadith, but it is false (Batil) as in \"Al-Tadhkirah\" (123).\n\nNone\n\nNone\n\n1. (114) This innovation has been eliminated, praise be to Allah, years ago, but the innovation that follows it still exists in its place. And in Al-Bajuri on Ibn Al-Qasim (1 / 41): It is forbidden to watch the well-known Mahmal and the covering of Maqam Ibrahim and the like \n[106].\n\nNone",
    "book_id": "399",
    "new_page_number": 99
  },
  {
    "serial_number": "4358882",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 106,
    "volume_number": 1,
    "text": "11 - Traveling alone for intimacy with Allah, as claimed by some Sufis\n\n12 - Traveling without provision, claiming reliance [on Allah] (Tawakkul). (115)\n\n13 - (Traveling to visit the graves of the Prophets and the righteous). (116) (\"Majmu' Al-Rasa'il Al-Kubra\") by Sheikh Al-Islam Ibn Taymiyyah (2 / 395)",
    "foot_note": "None\n\n1. (115) Al-Ghazali deemed that desirable (Mustahabb) in \"Al-Ihya\" (3 / 249) and said in another place (4 / 229): \"Traveling to the deserts without provision is permissible and is the highest station of Tawakkul.\" I say: This is false. If it were as he said, the most deserving of people for it would have been the Messenger of Allah (peace be upon him), and we know with certainty that he did not do that. How [can that be] when he (peace be upon him) took provisions from his Hady (peace be upon him) from Mecca to Medina? I do not know how Al-Ghazali claims that when he is [called] Hujjat al-Islam (The Proof of Islam), while Allah the Mighty and Majestic says: (And take provisions, but indeed, the best provision is fear of Allah). It was revealed regarding people from the people of Yemen who used to perform Hajj and not take provisions, saying, \"We are the ones who rely [on Allah].\" Al-Bukhari and others narrated it. So what turned Al-Ghazali away from this truth indicated by the Book and the Sunnah? Is it ignorance? No, for this is not hidden from someone like him. Rather, it is Sufism that carries its adherent to exit from the Shariah by way of interpreting texts. So in this, he and Ilm al-Kalam (scholastic theology) are alike. May Allah protect us with the Sunnah from everyone who opposes it.\n\n1. (116) As for the visit that is not a journey, it is legislated by the agreement of the scholars, including Ibn Taymiyyah. Anyone who accuses him of denying it is ignorant or biased.",
    "book_id": "399",
    "new_page_number": 100
  },
  {
    "serial_number": "4358885",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 107,
    "volume_number": 1,
    "text": "14 - (A man concluding a marriage contract with a married woman if she intends Hajj and has no Mahram, concluding it with her so that he may be with her as a Mahram). (117)\n\n(\"Al-Sunan wal-Mubtada'at\") (109)\n\n15 - Taking taxes (Maks) from pilgrims intending to perform the obligatory Hajj. (\"Al-Ihya\") (1 / 236)\n\n16 - The traveler praying two rak'ahs whenever he stops at a station and saying: \"O Allah, cause me to land at a blessed landing place, and You are the best of those who bring to land...\" (118)\n\n17 - The traveler reciting at every station he lands at: Surah Al-Ikhlas (11) times, Ayat al-Kursi once, and the verse (They have not appraised Allah with true appraisal) once. (118)\n\n18 - Eating from the onions (*Faha*) of every land the traveler comes to. (119)",
    "foot_note": "1. (117) This is among the most malicious of innovations due to what it contains of trickery against the Shariah and exposure to falling into indecency, as is not hidden \n[107].\n\nNone\n\nNone\n\n1. (118) See \"Sharh Shir'at Al-Islam\" (pp. 369 - 374)\n\n1. (118) See \"Sharh Shir'at Al-Islam\" (pp. 369 - 374)\n\n1. (119) He deemed it desirable in \"Sharh Al-Shir'ah\" (381). Desirability is a Shariah ruling that must have evidence. He used as proof for it his saying: \"And in the Hadith: Whoever eats the onions (*Faha*) of a land, its water will not harm him.\" Meaning onions. It is a strange (Gharib) hadith for which we know no basis except in \"Al-Nihayah\" by Ibn Al-Athir. And how many things in it have no basis! \n[108].",
    "book_id": "399",
    "new_page_number": 101
  },
  {
    "serial_number": "4358891",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 108,
    "volume_number": 1,
    "text": "19 - (Intending a specific spot hoping for good by intending it, while the Shariah did not recommend that, such as the places about which it is said: In them is a trace of the Prophet (peace be upon him), as is said\n\nabout the Rock in Bayt Al-Maqdis (Jerusalem) and the Mosque of the Foot south of Damascus, and likewise the shrines of the Prophets and the righteous). (\"Iqtida' Al-Sirat Al-Mustaqim Mukhalafat Ashab Al-Jahim\") (pp. 151 and 152). (120)\n\n20 - (Unsheathing weapons upon arriving at Tabuk). (\"Al-Ikhtiyarat Al-Ilmiyyah\") by Sheikh Al-Islam Ibn Taymiyyah. Innovations of Ihram, Talbiyah, and others",
    "foot_note": "None\n\n1. (120) And it is authentic from Umar (may Allah be pleased with him) that he saw people during his Hajj rushing to [a place in] Mecca. He said: \"What is this?\" He said: \"A mosque in which the Messenger of Allah (peace be upon him) prayed.\" He said: \"Thus destroyed were the People of the Book; they took the traces of their Prophets as churches. Whoever among you is present for prayer in it, let him pray; otherwise, let him not pray.\" See our book: \"Tahdhir Al-Masajid\" (p. 97). Then compare that with what is in \"Al-Ihya\" (1 / 235 Halabi print), and you will see a wonder.\n\nNone",
    "book_id": "399",
    "new_page_number": 102
  },
  {
    "serial_number": "4358894",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 109,
    "volume_number": 1,
    "text": "21 - Taking special sandals with specific known conditions in some books. (121)",
    "foot_note": "1. (121) For such conditions have not come in the Sunnah. The religion of Allah is ease, as every condition not in the Book of Allah is void, even if it were a hundred conditions, as proven in Sahih Al-Bukhari. All that he (peace be upon him) stipulated regarding sandals is that they do not cover the ankles (Ka'bain), which are the two protruding bones at the joint of the leg mentioned in the verse of Ablution. That is his saying (peace be upon him): \"The Muhrim shall not wear Khuffs (leather socks) unless he does not find sandals, then let him cut them so that they are below the ankles.\" Agreed upon. So sandals like those known in Syria as \"Kundarah\" or \"Subbat\" (shoes) suffice. \n[109].",
    "book_id": "399",
    "new_page_number": 103
  },
  {
    "serial_number": "4358895",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 110,
    "volume_number": 1,
    "text": "22 - Assuming Ihram before the Meeqat. (122)\n\n23 - (Idtiba' [uncovering the right shoulder] at the time of assuming Ihram). (123) (\"Talbis Iblis\") by Ibn Al-Jawzi (p. 154)\n\n24 - Pronouncing the intention (Niyyah). (124)\n\n25 - (Performing Hajj silently, not speaking). (\"Al-Iqtida'\") (p. 60)\n\n26 - (Talbiyah in congregation in one voice). (\"Sharh Al-Tariqah Al-Muhammadiyyah\") by Hajj Rajab (1 / 115) and (\"Al-Madkhal\") by Ibn Al-Hajj (2 / 221)\n\n27 - (Takbir and Tahlil instead of Talbiyah). (\"Kanz Al-Ummal\") from Ibn Abbas (3 / 30)\n\n28 - Saying after Talbiyah: \"O Allah, I intend Hajj, so make it easy for me and help me to perform its obligation and accept it from me. O Allah, I intended to perform Your obligation in Hajj, so make me among those who have answered You...\" (125)",
    "foot_note": "1. (122) Because it is contrary to the Sunnah. As for the hadith \"It is from the completeness of Hajj that you assume Ihram from the hamlet of your family,\" it is a Munkar (rejected) hadith as I explained in \"Silsilat Al-Ahadith Al-Da'ifah\" (No. 210). Furthermore, there has been narrated what contradicts it, Marfu' (elevated) and Mawquf (stopped), from a group of Companions like Umar and Uthman (may Allah be pleased with them), as I mentioned there. How excellent is what Al-Harawi and others narrated from Ibn Uyaynah that he said: I heard Malik bin Anas when a man came to him and said: \"O Abu Abdullah, from where should I assume Ihram?\" He said: \"From Dhu Al-Hulayfah, from where the Messenger of Allah (peace be upon him) assumed Ihram.\" He said: \"I want to assume Ihram from the Mosque from near the Grave.\" He said: \"Do not do it, for I fear Fitnah (trial) for you.\" He said: \"And what Fitnah is in this? It is only miles I am adding.\" He said: \"And what Fitnah is greater than you seeing that you attained a virtue that the Messenger of Allah (peace be upon him) fell short of? I heard Allah say: (So let those beware who dissent from the Prophet's order, lest fitnah strike them or a painful punishment).\" From this, you learn the value of the alleged agreement on the permissibility of Ihram before the Meeqat mentioned in \"Sharh Al-Hidayah\" (2 / 132). And Allah is the One sought for help.\n\n1. (123) Ibn Abidin said in \"Al-Hashiyah\" (2 / 215): The Sunnah is Idtiba' just before Tawaf until its end, not otherwise. And likewise in \"Fath Al-Qadir\" (2 / 150). \n[110].\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 104
  },
  {
    "serial_number": "4358902",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 111,
    "volume_number": 1,
    "text": "29 - (Visiting mosques in Mecca and its surroundings other than the Sacred Mosque, such as the mosque under Al-Safa, the one on the slope of Abu Qubais, the Mosque of the Birthplace, and similar mosques built on relics of the Prophet, peace and blessings of Allah be upon him.\n\n(Majmu'at al-Rasa'il al-Kubra) (2 / 388 - 389) and (Tafsir Surat al-Ikhlas) by Ibn Taymiyyah (179)\n\n30 - (Visiting mountains and places around Mecca such as Mount Hira and the mountain near Mina which is said to be where the Ransom occurred, and similar places). (Majmu'at al-Rasa'il al-Kubra) (2 / 289)\n\n31 - (Intending to pray in the Mosques of Aisha at (Al-Tan'im). (Majmu'at al-Rasa'il al-Kubra) (2 / 357 - 358)\n\n32 - (Making the sign of the cross in front of the House) (Al-Iqtida') (101) Innovations of Tawaf\n\n33 - (Ghusl for Tawaf). (Majmu'at al-Rasa'il al-Kubra) (2 / 380)",
    "foot_note": "1. (124) See comment (number 9). \n125. Al-Ghazali mentioned that this is desirable (Mustahabb), whereas Al-Bajuri said (1 / 329) that it is Sunnah. Perhaps he means the Sunnah of the Sheikhs; otherwise, anyone with knowledge of the [Prophetic] Sunnah knows that it has no basis.\n[111].\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 105
  },
  {
    "serial_number": "4358908",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 112,
    "volume_number": 1,
    "text": "34 - The one circumambulating wearing socks or similar footwear so as not to step on pigeon droppings and covering his hands so as not to touch a woman (126)\n\n35 - The Muhrim praying Tahiyyat al-Masjid when entering the Sacred Mosque (127)\n\n36 - (Saying: I intend by this Tawaf of mine this week such and such). (Zad al-Ma'ad) (1 / 455, 3 / 303) (Al-Rawdah al-Nadiyyah) (1 / 261)\n\n37 - (Raising hands when touching the Black Stone as one raises them for prayer). (Zad al-Ma'ad) (1 / 303) and (Safar al-Sa'adah) by the scholar Al-Fayruzabadi (70) (128)\n\n38 - (Making a sound when kissing the Black Stone). (Al-Madkhal) (4 / 223)",
    "foot_note": "1. (126) Sheikh al-Islam Ibn Taymiyyah said in \"Al-Majmu'ah\" (2 / 374): Whoever does that has opposed the Sunnah, for the Prophet (peace and blessings of Allah be upon him), his Companions, and the Successors always circumambulated the House, and pigeons have always been in Mecca.\n[112].\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 106
  },
  {
    "serial_number": "4358913",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 113,
    "volume_number": 1,
    "text": "39 - Crowding to kiss it and racing the Imam in Taslim in prayer to kiss it\n\n40 - (Tucking up the hem of his garment when touching the Stone or the Yemeni Corner) Hajj Rajab in (Sharh al-Tariqah al-Muhammadiyyah) (1 / 122)\n\n41 - (Their saying when touching the Stone: O Allah, believing in You and confirming Your Book). (Al-Madkhal) (4 / 225) (130)\n\n42 - Their saying when touching the Stone: O Allah, I seek refuge in You from pride, poverty, and ranks of disgrace in this world and the Hereafter (129)\n\n43 - (Placing the right hand over the left during Tawaf). (Previous source: 1 / 122)",
    "foot_note": "1. (127) Its greeting is Tawaf, then prayer behind the Maqam as previously mentioned from his action (peace and blessings of Allah be upon him). See: \"Al-Qawa'id al-Nuraniyyah\" by Ibn Taymiyyah (101).\n128. He mentioned that only the ignorant do this, although it is the Hanafi school. They argued for it in \"Al-Hidayah\" with the hadith \"Hands are not raised except in seven places,\" mentioning touching the Stone among them. However, it is a weak hadith from all its paths. Despite this, Ibn al-Humam indicated in \"Al-Fath\" (2 / 148, 153) that there is no basis for mentioning the Stone in it. It seems he took it from Al-Zayla'i in \"Nasb al-Rayah\" (2 / 38), and there is an issue with this which is not the place to clarify.\n[113].\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 107
  },
  {
    "serial_number": "4358918",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 114,
    "volume_number": 1,
    "text": "44 - Saying opposite the door of the Kaaba: O Allah, the House is Your House, the Sanctuary is Your Sanctuary, the Security is Your Security, and this is the place of one seeking refuge in You from the Fire - pointing to the Station of Ibrahim (peace be upon him)\n\n45 - Supplicating at the Iraqi Corner: O Allah, I seek refuge in You from doubt, polytheism, schism, hypocrisy, bad manners, and an evil return to family, wealth, and children\n\n46 - Supplicating under the Mizab (waterspout): O Allah, shade me in Your shade on the Day when there is no shade but Your shade, and give me a drink from the cup of our master Muhammad (peace and blessings of Allah be upon him), a pleasant, wholesome drink after which I will never thirst. O Possessor of Majesty and Honor\n\n47 - Supplicating during Raml: O Allah, make it an accepted Hajj, a forgiven sin, a thanked effort, and a trade that will not fail, O Mighty, O Forgiver (131)",
    "foot_note": "1. (129) Al-Suyuti mentioned the hadith regarding it in \"Dhayl al-Mawdu'at\" (p. 122) and said: \"It contains Nahshal, a liar.\"\n130. In \"Al-Ma'unah\" (2 / 124), Imam Malik denounced people saying when aligning with the Black Stone: Believing in You... This was narrated from Ali and Ibn Umar as Mawquf with two weak chains. Do not be deceived by Al-Haythami saying about the hadith of Ibn Umar: \"Its men are men of Sahih,\" for he confused one narrator with another, as I clarified in \"Al-Silsilah.\"\n[114].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 108
  },
  {
    "serial_number": "4358922",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 115,
    "volume_number": 1,
    "text": "48 - In the remaining four rounds: My Lord, forgive and have mercy and overlook what You know, You are the Most Mighty, the Most Generous (132)\n\n49 - (Kissing the Yemeni Corner). (Al-Madkhal) (4 / 224)\n\n50 - (Kissing the two Levantine Corners and the Station, and touching them). (Al-Iqtida') (204), (Majmu'at al-Rasa'il) (2 / 371), and (Al-Ikhtiyarat al-Ilmiyyah) by Ibn Taymiyyah (p. 69)\n\n51 - (Wiping oneself on the walls of the Kaaba and the Station). (Tafsir Surat al-Ikhlas) (177), (Ighathat al-Lahfan) (1 / 212), and (Al-Sunan wa al-Mubtada'at) (113)\n\n52 - (The Trustworthy Handhold, which is a high place on the wall of the House opposite the door of the House; the common people claim that whoever reaches it with his hand has grasped the Trustworthy Handhold). (Al-Ba'ith 'ala Inkar al-Bida' wa al-Hawadith) by Abu Shama (p. 69) (133), (Fath al-Qadir) by Ibn al-Humam (2 / 182 - 183), and (Al-Ibtida') (165)",
    "foot_note": "1. (131) Al-Rafi'i cited it as a hadith raised (Marfu') to the Prophet (peace and blessings of Allah be upon him), but it has no basis, as Al-Hafiz indicated by saying in \"Al-Talkhis\" (p. 214): I did not find it.\n132. Sheikh al-Islam said in his Mansik (p. 372): It is recommended for him during Tawaf to remember Allah the Exalted and supplicate to Him with what is legislated. If he recites the Quran silently, there is no harm. There is no specific Dhikr from the Prophet (peace and blessings of Allah be upon him) by his command, saying, or teaching. Rather, he supplicates with general legislated supplications. What many people mention of a specific supplication under the Mizab and the like has no basis. The Prophet (peace and blessings of Allah be upon him) used to end his Tawaf between the two corners by saying: (Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire), just as he used to end all his supplications with that. There is no obligatory Dhikr in that by the consensus of the Imams.\n[115].\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 109
  },
  {
    "serial_number": "4358927",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 116,
    "volume_number": 1,
    "text": "53 - (A nail in the middle of the House they called the navel of the world; one of them would uncover\n\nhis navel and lie flat on that spot until he places his navel on the navel of the world) (134) (Previous sources)\n\n54 - Intending to circumambulate under the rain based on the claim that whoever does so will have his past sins forgiven (135)\n\n55 - Seeking blessings from the rain falling from the Mizab (waterspout) of Mercy of the Kaaba\n\n56 - (Abandoning Tawaf due to unclean clothes). (Al-Iqtida') by Ibn Taymiyyah (60)\n\n57 - The pilgrim pouring the remainder of his Zamzam water into the well saying: O Allah, I ask You for vast provision, beneficial knowledge, and cure from every disease",
    "foot_note": "1. (133) He said: \"They endure hardship and suffering to reach it, climbing over each other, and sometimes a female climbs over a male.\"\n[116].\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 110
  },
  {
    "serial_number": "4358933",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 117,
    "volume_number": 1,
    "text": "58 - Some bathing with Zamzam (136)\n\n59 - (Their concern with sprinkling Zamzam on their beards and sprinkling what money and clothes they have to receive blessings). (Al-Sunan wa al-Mubtada'at) (113)\n\n60 - What is mentioned in some Fiqh books that one should breathe while drinking Zamzam several times, raise his gaze each time, and look at the House (137) after Sa'i between Safa and Marwah\n\n61 - Ablution for walking between Safa and Marwah based on the claim that whoever does so will have seventy thousand degrees written for him for every footstep (138)\n\n62 - (Climbing Al-Safa until sticking to the wall). (Hashiyat Ibn Abidin) (2 / 234)",
    "foot_note": "1. (134) Ibn al-Humam described this innovation and the one before it as false innovations with no basis, and as actions of one who has no intellect, let alone knowledge.\n135. As for the hadith \"Whoever circumambulates seven times in the rain will have his past sins forgiven,\" it has no basis, as said by Al-Bukhari and others.\n136. Ibn Taymiyyah said in his \"Mansik\" (p. 388): It is recommended to drink from Zamzam water, drink one's fill, and supplicate when drinking with whatever supplications one wishes. It is not recommended to bathe with it.\n[117].\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 111
  },
  {
    "serial_number": "4358938",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 118,
    "volume_number": 1,
    "text": "63 - Supplicating while descending from Al-Safa: O Allah, employ me in the Sunnah of Your Prophet\n\nand cause me to die on his religion, and protect me from the misguiding trials by Your mercy, O Most Merciful of the merciful (139)\n\n64 - Saying during Sa'i: My Lord, forgive and have mercy and overlook what You know, You are the Most Mighty, the Most Generous. O Allah, make it an accepted Hajj, or accepted Umrah, and a forgiven sin. Allah is Greatest three times, and praise be to Allah. Allah is Greatest for guiding us, and praise be to Allah for what He bestowed upon us. There is no deity except Allah alone, He has no partner, to Him belongs the dominion and to Him belongs the praise, and He is over all things omnipotent. There is no deity except Allah alone... to his saying: even if the disbelievers dislike it (140)\n\n65 - Performing Sa'i for fourteen laps so that it ends at Al-Safa (141)",
    "foot_note": "1. (137) This innovation has become impossible today, praise be to Allah, because the dome that was over Zamzam has been demolished and leveled to the ground to expand for the worshippers, and the entrance to the well is now underground such that the House cannot be seen from it.\n138. The hadith regarding this is fabricated (Mawdu'). Al-Suyuti and others cited it in \"Al-Mawdu'at,\" so refer to \"Al-Dhayl\" (p. 122) and \"Al-Tadhkirah\" (p. 74).\n[118].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 112
  },
  {
    "serial_number": "4358942",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 119,
    "volume_number": 1,
    "text": "66 - (Repeating Sa'i in Hajj or Umrah). (Explanation of Al-Nawawi on Muslim) (9 / 25)\n\n67 - (Praying two rak'ahs after finishing Sa'i) (142) (Al-Ba'ith 'ala Inkar al-Bida') and (Al-Qawa'id al-Nuraniyyah) by Sheikh al-Islam Ibn Taymiyyah (101)\n\n68 - Their continuing Sa'i between Safa and Marwah while prayer has commenced until they miss the congregational prayer",
    "foot_note": "1. (139) Some of it was narrated from Ibn Umar that he used to say it at Al-Safa. Al-Bayhaqi extracted it with a weak chain.\n140. It is authentically reported as Mawquf from Ibn Mas'ud and Ibn Umar: My Lord, forgive and have mercy, You are the Most Mighty, the Most Generous. Narrated by Al-Bayhaqi. It was narrated as Marfu' but is not authentic.\n141. The Sunnah is seven laps, and ending at Al-Marwah as previously mentioned in paragraph (33).\n[119].\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 113
  },
  {
    "serial_number": "4358945",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 120,
    "volume_number": 1,
    "text": "69 - Adhering to a specific supplication when coming to Mina like the one in (Al-Ihya'): (O Allah, this is Mina, so bestow upon me what You bestowed upon Your friends and people of obedience) and when leaving it: (O Allah, make it the best departure I have ever made...) etc.\n\nInnovations of Arafah\n\n70 - Standing at Mount Arafah on the eighth day for an hour as a precaution fearing error in the crescent moon (143)\n\n71 - (Lighting many candles on the night of Arafah in Mina). (Majmu'at al-Rasa'il al-Kubra) (2 / 377, 378, 379). And Al-Bajirami in his (Hashiyah) (2 / 211)",
    "foot_note": "1. (142) More than one scholar held the view of their desirability by analogy to the two rak'ahs of Tawaf. Ibn al-Humam said in \"Al-Fath\" (2 / 156 - 157): There is no need for this analogy since there is a text, which is what Al-Muttalib bin Abi Wada'ah narrated, saying: I saw the Messenger of Allah (peace and blessings of Allah be upon him) when he finished his Sa'i, he came... and prayed two rak'ahs at the edge of the Mataf with no one between him and those circumambulating. Narrated by Ahmad and Ibn Majah. I say: This is a strange illusion from such a knowledgeable scholar, for the word \"sa'yih\" (his Sa'i) was distorted for him; the correct is \"sab'ah\" (seven) as in Ibn Majah number (2958), and in the Musnad with the wording \"usbu'ah\" (his week/seven rounds), and in another narration of his \"he circumambulated the House seven times then prayed two rak'ahs opposite it...\" Furthermore, the hadith itself is not authentic due to its chain, for it contains confusion and anonymity as I clarified in \"Silsilat al-Ahadith al-Da'ifah\" number (932), as previously noted (p. 23). See comment (173).\n[120].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 114
  },
  {
    "serial_number": "4358949",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 121,
    "volume_number": 1,
    "text": "72 - Supplicating on the night of Arafah with ten phrases a thousand times: Glory be to Him whose Throne is in the sky, Glory be to Him whose foothold is on earth, Glory be to Him whose path is in the sea... etc. (144)\n\n73 - (Their departure on the eighth day from Mecca to Arafah in one go). (Al-Ba'ith 'ala Inkar al-Bida') (69 - 70) (145)\n\n74 - (Leaving Mina for Arafah at night) (146) (Al-Madkhal) (4 / 227)\n\n75 - (Lighting fires and candles on Mount Arafat on the night of Arafah). (Al-Ba'ith 'ala Inkar al-Bida') (2 / 378, 379), (Al-I'tisam) by Al-Shatibi (2 / 273), and (Al-Ibda' fi Madar al-Ibtida') (165)",
    "foot_note": "1. (143) He deemed that good in \"Al-Ihya'\" and said: It is prudence. This is strange from such a jurist, for if it were truly good, the Prophet (peace and blessings of Allah be upon him) would have done it, and he is the most fearing of people. Sheikh al-Islam said in \"Al-Majmu'ah\" (2 / 374): Precaution is good as long as it does not contradict the known Sunnah; if it leads to that, it is an error.\n144. A hadith has come regarding it, but its chain is weak. Ibn al-Jawzi even included it in \"Al-Mawdu'at\" and said: \"It is not authentic.\" Al-Suyuti responded in \"Al-La'ali\" (1 / 120) in a way that implies admitting its weakness.\n[121].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 115
  },
  {
    "serial_number": "4358953",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 122,
    "volume_number": 1,
    "text": "76 - Bathing for the Day of Arafah (147)\n\n77 - His saying when approaching Arafat and laying eyes on the Mount of Mercy: Glory be to Allah, Praise be to Allah, There is no deity except Allah, and Allah is Greatest\n\n78 - (Going to Arafat before the time of Standing begins at midday on the Day of Arafah). (Al-Ibda') (166)\n\n79 - Saying Tahlil at Arafah one hundred times, then reciting Surat al-Ikhlas one hundred times, then praying upon him (peace and blessings of Allah be upon him) adding at the end: and upon us with them one hundred times (148)\n\n80 - Silence on Arafat and abandoning supplication (149)",
    "foot_note": "1. (145) The Sunnah, rather the obligation, is to spend the night in Mina on the eve of Arafah as previously mentioned. People have become very lax with this Sunnah, aided by some guides (Mutawwifin) who do not care about following the Prophet (peace and blessings of Allah be upon him) in his Hajj. They may find among jurists those who make it easy for them, like Al-Ghazali's saying: \"Spending the night in Mina is spending the night at a stopover, and no ritual is attached to it.\"\n146. The Sunnah is to leave Mina after sunrise on the Day of Arafah as previously mentioned.\n147. As for the hadith \"The Prophet (peace and blessings of Allah be upon him) used to bathe on the day of Fitr, the day of Nahr, and the day of Arafah,\" it is very weak as clarified by Al-Zayla'i in \"Nasb al-Rayah\" (1 / 85) and Ibn al-Humam in \"Al-Fath\" (1 / 45). Its status was hidden from Ibn Taymiyyah, so he said in his \"Majmu'\" (2: 380): \"Only three baths have been reported from the Prophet (peace and blessings of Allah be upon him) or his Companions in Hajj: the bath of Ihram, the bath upon entering Mecca, and the bath on the day of Arafah. Whatever is other than that, like bathing for stoning the Jamarat, Tawaf, and spending the night at Muzdalifah, has no basis; rather, it is an innovation.\"\n[122].\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 116
  },
  {
    "serial_number": "4358958",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 123,
    "volume_number": 1,
    "text": "81 - (Climbing the Mount of Mercy in Arafat) (Majmu'at Ibn Taymiyyah) (2 / 380), (his Ikhtiyarat al-Ilmiyyah) (69) (150), and (Al-Madkhal) (4 / 227)\n\n82 - Entering the dome on the Mount of Mercy, calling it the Dome of Adam, praying in it, and circumambulating it like circumambulating the House). (Majmu'at Ibn Taymiyyah) (2 / 380), (Iqtida' al-Sirat al-Mustaqim) by him (149), and (Al-Madkhal) (4 / 237)\n\n83 - (Believing that Allah the Exalted descends on the evening of Arafah on a grey camel, shaking hands with the riders and embracing the pedestrians). (Majmu'at Ibn Taymiyyah) (1 / 279) (151)\n\n84 - The Imam delivering two sermons in Arafah separated by a sitting, as in Jumu'ah (152)",
    "foot_note": "1. (148) The hadith regarding it has a weak chain. Al-Bayhaqi extracted it in \"Al-Shu'ab\" and said: \"This is a strange report, and its chain does not contain anyone accused of fabrication,\" as quoted in \"Al-La'ali\" (1261). Ibn al-Humam mentioned it in \"Al-Fath\" (2 / 167) without the word \"not\" [regarding the accusation].\n149. See \"Al-Madkhal\" (4 / 229).\n150. He said in it: \"Climbing the Mount of Mercy is not legislated by consensus.\"\n[123].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 117
  },
  {
    "serial_number": "4358962",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 124,
    "volume_number": 1,
    "text": "85 - Praying Zuhr and Asr before the sermon (153)\n\n86 - Calling Adhan for Zuhr and Asr in Arafah before the preacher finishes his sermon (154)\n\n87 - The Imam saying to the people of Mecca after finishing prayer in Arafah: Complete your prayer, for we are travelers (155)\n\n88 - Voluntary prayer between Zuhr and Asr in Arafah (156)",
    "foot_note": "1. (151) He mentioned that some narrated this as a hadith, then said: This is among the greatest lies against Allah and His Messenger (peace and blessings of Allah be upon him), and its sayer is among the greatest speakers of untruth against Allah.\n152. He said in \"Al-Hidayah\": \"This is how the Messenger of Allah (peace and blessings of Allah be upon him) did it.\" Ibn al-Humam critiqued him in \"Al-Fath\" (2 / 163) saying: No hadith occurs to me regarding it.\n153. The hadith containing this is Shadh (anomalous) and Munkar (denounced), because it contradicts what preceded in paragraph (58 - 6). See \"Nasb al-Rayah\" (3 / 59 - 60).\n[124].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 118
  },
  {
    "serial_number": "4358966",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 125,
    "volume_number": 1,
    "text": "89 - Designating a specific Dhikr or supplication for Arafah like the supplication of Al-Khidr (peace be upon him) cited in (Al-Ihya'), beginning with: O You whom no matter distracts from\n\nanother matter, nor hearing from another hearing...) and other supplications, some of which reach more than six pages of the size of this book of ours (157)\n\n90 - Some leaving (Ifada) before sunset",
    "foot_note": "1. (154) The Sunnah is to start the Adhan after finishing the sermon as preceded in paragraph (60 - 61).\n155. This came in more than one Hanafi book as one of the Imam's duties in Arafah if he is traveling from it. \"Tuhfat al-Fuqaha\" (1 / 2 / 876). Sheikh al-Islam Ibn Taymiyyah said in his \"Majmu'\" (2 / 378): The people of Mecca and non-Meccans shorten prayers, and likewise combine prayers at Arafah, Muzdalifah, and Mina, just as the people of Mecca used to do behind the Prophet (peace and blessings of Allah be upon him) at Arafah, Muzdalifah, and Mina. They also did so behind Abu Bakr and Umar (may Allah be pleased with them). Neither the Prophet (peace and blessings of Allah be upon him) nor his successors ordered anyone from Mecca to complete the prayer, nor did they tell them at Arafah, Muzdalifah, and Mina: Complete your prayer for we are travelers. Whoever narrated that from them has erred.\n156. It was described in \"Sharh al-Hidayah\" as disliked (Makruh). This means it is an innovation.\n[125].\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 119
  },
  {
    "serial_number": "4358969",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 126,
    "volume_number": 1,
    "text": "91 - What is widely circulated on the tongues of the common people that standing at Arafat on a Friday is equivalent to seventy-two Hajjs (Zad al-Ma'ad) (1 / 23) (158)\n\n92 - (The definition (Ta'rif) that some people do by intentionally gathering on the evening of the Day of Arafah in mosques or a place outside the town, supplicating and remembering Allah with loud voices, sermons, and poetry, imitating the people of Arafat). (Sunan Al-Bayhaqi) (5 / 118) from Al-Hakam, Hammad, and Ibrahim, and (Al-Iqtida') (149) and (Munyat al-Musalli) by Al-Halabi (573). Innovations of Muzdalifah",
    "foot_note": "1. (157) Sheikh al-Islam said in his \"Majmu'\" (2 / 380): The Prophet (peace and blessings of Allah be upon him) did not designate a specific supplication or Dhikr for Arafat. Rather, a man supplicates with whatever legal supplications he wishes, and likewise, he says Takbir, Tahlil, and remembers Allah the Exalted until the sun sets. I say: It should be added to this that it is Sunnah for him to recite Talbiyah as well; see the previous comment number (64).\n158. The origin of this innovation is a fabricated hadith indicated by Ibn al-Qayyim in the aforementioned source. He said: It is false and has no basis from the Messenger of Allah (peace and blessings of Allah be upon him). So do not be deceived by what the scholar Al-Kawthari quoted in \"Al-Ajwiba Al-Fadila\" (p. 37, Aleppo edition) from Sheikh Ali Al-Qari that he said: \"As for some Hadith scholars mentioning that it is weak in its chain, assuming it is authentic [in meaning], it does not harm the intent. For weak hadith is considered in virtuous deeds according to all scholars of perfection. We do not know of anyone who stated only its weakness, despite the ruling of the researcher Ibn al-Qayyim of its falsehood.\" This reality is one of the many examples of the ominousness of what some adopt regarding acting upon weak hadith in virtuous deeds, despite their frequent disagreement in interpreting this doctrine, as you find detailed in the aforementioned Answers. A hadith might be false like this one, yet some label it as weak, then another comes and says one acts upon weak hadith in virtuous deeds without verifying its safety from severe weakness, which is one of the conditions for acting upon it. Note that absolute weakness does not negate severe weakness, nor even fabrication, because they are types of weak hadith as established in the terminology. Moreover, I wonder what is the relation of this hadith to acting upon weak hadith? For that applies where a person has a choice to do or leave something, which is not the case for standing at Arafat coinciding with Friday. Furthermore, you can find the text of the false hadith referred to in my book \"Silsilat al-Ahadith al-Da'ifah wa al-Mawdu'ah\" number (207) with a mention of the scholars who agreed with Ibn al-Qayyim on his ruling of the hadith's falsehood.\n[126].\n\nNone",
    "book_id": "399",
    "new_page_number": 120
  },
  {
    "serial_number": "4358971",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 127,
    "volume_number": 1,
    "text": "93 - (Hastening (Idah) at the time of moving from Arafah to Muzdalifah) [127]\n\n(Zad al-Ma'ad) (1 / 337 - 338)\n\n94 - Bathing for spending the night at Muzdalifah. (Majmu'at Sheikh al-Islam) (2 / 280)\n\n95 - Desirability of the rider dismounting to enter Muzdalifah walking out of respect for the Sanctuary (159)\n\n96 - Adhering to the supplication by saying when reaching Muzdalifah: O Allah, this is Muzdalifah, different tongues have gathered in it asking You for needs to be started anew... etc., as in Al-Ihya'\n\n97 - Leaving the initiative to pray Maghrib immediately upon dismounting in Muzdalifah and being busy with collecting pebbles instead\n\n98 - Praying the Sunnah of Maghrib between the two prayers or combining it with the Sunnah of Isha and Witr after the two obligatory prayers, as Al-Ghazali says\n\n99 - (Increasing the lighting on the night of Sacrifice and at the Sacred Monument). (Al-Ba'ith 'ala Inkar al-Bida' wa al-Hawadith) (25",
    "foot_note": "None\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 121
  },
  {
    "serial_number": "4358979",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 128,
    "volume_number": 1,
    "text": "69 - )\n\n100 - Spending this night in worship (Ihya') (160)\n\n101 - Stopping at Muzdalifah without spending the night. (Al-Rawdah al-Nadiyyah) (1 / 267)\n\n102 - Adhering to the supplication when reaching the Sacred Monument by saying: O Allah, by the right of the Sacred Monument, the Sacred House, the Sacred Month, the Corner, and the Station, convey from us to the soul of Muhammad greetings and peace, and admit us to the Abode of Peace, O Possessor of Majesty and Honor (161)",
    "foot_note": "1. (Note) The previous statement of Al-Qari: that weak hadith is considered in virtuous deeds according to all scholars is incorrect. The disagreement on this is known, which you can find in \"Al-Ajwiba Al-Fadila,\" even if he did not refine the discussion on this issue.\n159. Al-Ghazali deemed that good in his Ihya'. If it were so, the Messenger of Allah (peace and blessings of Allah be upon him) would have done it. It has passed that he came to Muzdalifah riding and that when he prayed Fajr, he rode his she-camel until he came to the Sacred Monument.\n[128].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 122
  },
  {
    "serial_number": "4358983",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 129,
    "volume_number": 1,
    "text": "103 - The statement of Al-Bajuri (1 / 325): (It is Sunnah to take the pebbles he throws on the Day of Sacrifice from Muzdalifah, which are seven, and the rest for the Jamarat\n\nare taken from Wadi Muhassir) (162). Innovations of Throwing (Ramy)\n\n104 - Bathing for throwing the pebbles. (Majmu'at Ibn Taymiyyah) (2 / 380)\n\n105 - Washing the pebbles before throwing (163)\n\n106 - Tasbih or other Dhikr instead of Takbir\n\n107 - Adding to the Takbir their saying: In spite of Satan and his party, O Allah make my Hajj accepted, my effort thanked, and my sin forgiven. O Allah, believing in Your Book and following the Sunnah of Your Prophet",
    "foot_note": "1. (160) Al-Ghazali deemed its Ihya' (spending in worship) good and said it is among the beauties of offerings. You have learned from paragraph (72) that he (peace and blessings of Allah be upon him) slept until dawn broke, and the best guidance is the guidance of Muhammad. Ibn al-Qayyim's speech on that has passed.\n161. This supplication, besides being innovated, contains what contradicts the Sunnah, which is tawassul (seeking means) to Allah by the right of the Sacred Monument, the House, the Month, the Corner, and the Station. One only seeks means to Him, the Exalted, by His Names and Attributes as detailed in the books of Ibn Taymiyyah (may Allah have mercy on him). The Hanafis have stated the dislike (karaha) of this saying: O Allah, I ask You by the right of the Sacred Monument etc... See \"Radd al-Muhtar 'ala al-Durr al-Mukhtar\" from their books.\n[129].\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 123
  },
  {
    "serial_number": "4358989",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 130,
    "volume_number": 1,
    "text": "108 - The statement of Al-Bajuri in his Hashiyah (1 / 325): (It is Sunnah to say with every pebble when throwing: In the name of Allah, and Allah is Greatest, Allah has fulfilled His promise... to his saying: even if the disbelievers dislike it)\n\n109 - Adhering to specific ways of throwing, like some saying: He bites the tip of his right thumb on the middle of the index finger and places the pebble on the back of the thumb as if tying seventy, then throws it. Another said: He curls his index finger and places it on the joint of his thumb as if tying ten (164)\n\n110 - Defining the position of the thrower: That there be between him and the Jamrah five cubits or more\n\n111 - Throwing the Jamarat with sandals. Innovations of Slaughter and Shaving\n\n112 - Reluctance to slaughter the obligatory sacrificial animal (Hady) in favor of giving its price in charity, claiming that its meat goes to waste in the dirt due to its abundance and only a few benefit from it (165)",
    "foot_note": "1. (162) This has no basis in the Sunnah; perhaps he means the Sunnah of the Sheikhs. Al-Ghazali disagreed with the detail he mentioned, saying that one equips oneself with all the pebbles from Muzdalifah. All of this is contrary to the Sunnah as previously mentioned in paragraph (83).\n163. Al-Bajirami said (2 / 400): Purification is not a condition for the stone of throwing.\n[130].\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 124
  },
  {
    "serial_number": "4358994",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 131,
    "volume_number": 1,
    "text": "113 - Some of them slaughtering the Hady of Tamattu' in Mecca before the Day of Sacrifice\n\n114 - Starting shaving with the left side of the shaved person's head (166)\n\n115 - Limiting to shaving a quarter of the head (167)",
    "foot_note": "1. (164) Ibn al-Humam said: This is difficult to enable throwing with amidst the crowd and heat. Then he mentioned that no evidence has been established for the priority of that method, and the principle is what is easiest. See comment (number 83).\n165. I say: This is one of the most malicious innovations because it involves nullifying the Sharia stipulated in the Book and Sunnah based on mere opinion, while those responsible for the lack of full benefit from it are the sacrificers themselves because they do not adhere to the directives of the Wise Lawgiver in slaughtering, as previously clarified in comment number (91).\n[131].\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 125
  },
  {
    "serial_number": "4358997",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 132,
    "volume_number": 1,
    "text": "116 - Al-Ghazali's statement in (Al-Ihya'): (And the Sunnah is to face the Qiblah during shaving). Supplicating during shaving by saying: Praise be to Allah for what He guided me to and bestowed upon us. O Allah, this is my forelock in Your hand, so accept from me and forgive my sin. O Allah, write for me for every hair a good deed, erase by it a bad deed from me, and raise me by it a degree. O Allah, forgive me and those who shave and those who cut short, O Vast in Forgiveness, Amen (168)\n\n118 - Circumambulating the mosques that are near the Jamarat. (Majmu'at al-Rasa'il al-Kubra) (2 / 380)\n\n119 - (Desirability of Eid prayer in Mina on the Day of Sacrifice). (Al-Qawa'id al-Nuraniyyah) (101) (169)\n\n120 - Abandoning Sa'i after Tawaf al-Ifada by the Mutamatti' (170). Various Innovations and Farewell\n\n11 - (Celebrating the covering (Kiswah) of the Kaaba). (Tafsir al-Manar) (1 / 468)\n\n122 - Covering the Station of Ibrahim (peace be upon him) (171)",
    "foot_note": "1. (166) The Sunnah is starting with his right as previously clarified in comment number (90).\n167. The obligation is shaving it all due to the saying of the Exalted (shaving your heads and cutting short) and his saying (peace and blessings of Allah be upon him): \"May Allah have mercy on those who shave...\" and because the mentioned limitation is a clear violation of his prohibition (peace and blessings of Allah be upon him) against Qaza' (partial shaving) and his saying \"Shave it all or leave it all.\" Therefore, Ibn al-Humam said: The implication of the evidence regarding shaving is the obligation of encompassing [the whole head], as is the opinion of Malik, and it is what I worship Allah with.\n168. He deemed that good in \"Fath al-Qadir\" and did not mention any evidence for it. Although this has no basis in the Sunnah as far as I know, I fear that his saying in it: \"O Allah, write for me for every hair a good deed...\" is transgressing in supplication which is forbidden, and that its beginning is adapted from the hadith \"The sacrifice is for its owner a good deed for every hair,\" which is a fabricated hadith as I clarified in \"Al-Ahadith Al-Da'ifah\" under the word \"Al-Udhiyah\" and its number is after one thousand.\n[132].\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 126
  },
  {
    "serial_number": "4359003",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 133,
    "volume_number": 1,
    "text": "123 - Tying rags to the Station and the Minbar for fulfilling needs (172)\n\n124 - Pilgrims writing their names on the pillars of the Kaaba's walls and recommending each other to do so. (Al-Sunan wa al-Mubtada'at) (113)\n\n125 - Their deeming it desirable to pass in front of a praying person in the Sacred Mosque and resisting the praying person who tries to push them back (173)\n\n126 - Calling one who performed Hajj as (Al-Hajj). (Talbis Iblis) by Ibn al-Jawzi (p. 154) and (Nur al-Bayan fi Bida' Akhir al-Zaman) (p. 82)",
    "foot_note": "1. (169) He said: \"This is heedlessness of the Sunnah, for the Prophet (peace and blessings of Allah be upon him) and his successors never prayed Eid in Mina.\" And he said in his \"Majmu'ah\" (2 / 385): There is no Eid prayer in Mina; rather, their throwing of Jamrat al-Aqaba is like the Eid prayer for the people of the cities.\n170. Because the command for this Sa'i is established as previously clarified in comment number (94).\n171. Al-Bajuri said in his Hashiyah (1 / 21): It is forbidden to watch the known Mahmal and the covering of the Station of Ibrahim and the like.\n172. This phenomenon has swelled in recent times more than it was before, which indicates that the \"State of Tawhid\" has begun to be lenient in eliminating what contradicts its Tawhid, which is its capital, and the Sheikhs and the group of Promotion of Virtue [are not doing enough] except whom Allah wills.\n[133].\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 127
  },
  {
    "serial_number": "4359007",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 134,
    "volume_number": 1,
    "text": "127 - (Exiting Mecca for a voluntary Umrah). (Al-Ikhtiyarat al-Ilmiyyah) (70)\n\n128 - (Leaving the Sacred Mosque after Farewell Tawaf walking backwards) (174) (Majmu'at al-Rasa'il al-Kubra) (2 / 288), (Al-Ikhtiyarat al-Ilmiyyah) (70), and (Al-Madkhal) (4 / 238)",
    "foot_note": "1. (173) Even if some people of knowledge said this, there is no doubt it contradicts the Sunnah because the hadiths reported regarding the prohibition of passing in front of a praying person and the command to push back the one passing in front are general, covering every praying person and in any mosque. What they used as evidence for the specificity of Mecca does not stand, which is the hadith of Al-Muttalib bin Abi Wada'ah that he saw the Prophet (peace and blessings of Allah be upon him) with no Sutrah between him and the Kaaba while people were passing in front of him. Besides not being explicit about passing between him and his place of prostration, its chain is weak as I clarified in \"Al-Silsilah\" (number 932).\n[134].\n\nNone",
    "book_id": "399",
    "new_page_number": 128
  },
  {
    "serial_number": "4359009",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 135,
    "volume_number": 1,
    "text": "129 - (Whitewashing the pilgrim's house with lime, decorating it with pictures, and writing the name and date of the pilgrim on it). (Al-Sunan wa al-Mubtada'at) (113). Innovations of Al-Madinah Al-Munawwarah. Since it is Sunnah to travel to visit the Noble Prophet's Mosque and Al-Aqsa Mosque due to the reported virtue and reward in that, and people usually visit them before Hajj or after it, and many of them commit numerous innovations and heresies known to the people of knowledge in the process, I saw it fitting for complete benefit to list what I have come across of them as notification and warning, so I say:\n\n130 - Intending his grave (peace and blessings of Allah be upon him) with the travel (175)\n\n131 - Sending petitions with pilgrims and visitors to the Prophet (peace and blessings of Allah be upon him)\n\n132 - Bathing before entering Al-Madinah Al-Munawwarah\n\n133 - Saying when his eyes fall on the walls of Madinah: O Allah, this is the sanctuary of Your Messenger, so make it for me a protection from the Fire and a security from punishment and evil reckoning\n\n134 - Saying upon entering Madinah: In the name of Allah and upon the religion of the Messenger of Allah. My Lord, cause me to enter a sound entrance and to exit a sound exit and grant me from Yourself a supporting authority\n\n135 - Keeping the Prophet's grave inside his mosque (176)\n\n136 - Visiting his grave (peace and blessings of Allah be upon him) before praying in his mosque",
    "foot_note": "1. (174) Al-Ghazali said in \"Al-Ihya'\" (1 / 232): It is more beloved that he does not turn his gaze away from the House until it disappears from him. Sheikh al-Islam quoted similar in \"Al-Ikhtiyarat\" (p. 70) from Ibn Aqil and Ibn al-Zaghuni, then said: \"This is an innovation.\"\n[135].\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 129
  },
  {
    "serial_number": "4359017",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 136,
    "volume_number": 1,
    "text": "137 - Some of them standing before the grave with utmost humility, placing their right hand over their left as is done in prayer.\n\n138 - Intentionally facing the grave during supplication.\n\n139 - Intending [to go to] the grave to supplicate at it, hoping for an answer. (Al-Ikhtiyarat Al-Ilmiyyah) (50).\n\n140 - Seeking means (Tawassul) through him (peace and blessings of Allah be upon him) to Allah in supplication.\n\n141 - Seeking intercession and other things from him.\n\n142 - The statement of Ibn al-Hajj (178) in (Al-Madkhal) (1 / 259) that among the etiquettes is: (That he should not mention his needs and forgiveness of his sins with his tongue when visiting his grave, peace and blessings of Allah be upon him, because he knows his needs and interests better than him).\n\n143 - His statement also (1 / 264): (There is no difference between his death, peace be upon him, and his life regarding his witnessing of his Ummah and his knowledge of their states, intentions, regrets, and thoughts).\n\n144 - Their placing of hands for blessing on the window of the Prophet's chamber (peace and blessings of Allah be upon him) and some swearing by that, saying: \"By the right of the one on whose window you placed your hand and said: Intercession, O Messenger of Allah.\"",
    "foot_note": "1. (175) The Sunnah is to intend [to visit] the Mosque, based on his saying (peace and blessings of Allah be upon him): \"Do not set out on a journey except to three mosques...\" Hadith. So when he reaches it and prays the greeting prayer, he visits his grave (peace and blessings of Allah be upon him).\n176. It is obligatory to separate it from the mosque with a wall as it was in the era of the Rightly Guided Caliphs, as I clarified years ago in \"Tahdhir al-Masajid min Ittikhadh al-Qubur Masajid\" (Warning Mosques against Taking Graves as Places of Worship).\n177. See: \"Majmu'at al-Rasa'il al-Kubra\" by Sheikh al-Islam (2 / 390)\n[136].\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 130
  },
  {
    "serial_number": "4359025",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 137,
    "volume_number": 1,
    "text": "145 - (Kissing the grave or touching it, or what adjoins the grave of wood and the like).\n\n(Fatawa Ibn Taymiyyah) (4 / 310), (Al-Iqtida) (176), (Al-I'tisam) (2 / 134 - 140), (Ighathat al-Lahfan) (1 / 194), (Al-Ba'ith) by Abu Shama (70), Al-Birgivi in (Atfal al-Muslimin) (234), and (Al-Ibda') (90) (179).",
    "foot_note": "1. (178) This man, despite his virtue and his book being a good reference for knowing innovations, is in himself superstitious (mukharrif) and cannot be relied upon in Tawhid and Creed.\n[137].\n\nNone",
    "book_id": "399",
    "new_page_number": 131
  },
  {
    "serial_number": "4359027",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 138,
    "volume_number": 1,
    "text": "146 - Adhering to a specific form in visiting him (peace and blessings of Allah be upon him) and visiting his two companions, and restricting oneself to a specific greeting and supplication, such as the saying of Al-Ghazali: (He stands at his face, peace and blessings of Allah be upon him, with his back to the Qiblah, facing the wall of the grave about four cubits from the pillar in the corner of the grave's wall, and says: Peace be upon you, O Messenger of Allah, Peace be upon you, O Prophet of Allah... O Trustee of Allah... O Beloved of Allah). He mentioned a long greeting, then a prayer and supplication of similar length, close to three pages. (Then he moves back about a cubit to greet Abu Bakr Al-Siddiq because his head is at the shoulder of the Messenger of Allah, peace and blessings of Allah be upon him. Then he moves back about a cubit and greets Al-Faruq and says: Peace be upon you both, O two ministers of the Messenger of Allah and his assistants in establishing [the religion]... Then he returns to stand at the head of the Messenger of Allah, peace and blessings of Allah be upon him, and faces the Qiblah...). Then he mentioned that he praises and glorifies [Allah]\n\nand recites the verse (And if, when they wronged themselves...), then supplicates with a supplication of about half a page) (180).",
    "foot_note": "1. (179) Al-Ghazali, may Allah the Exalted have mercy on him, did well when he denounced the mentioned kissing and said (1 / 244): It is the custom of Christians and Jews, so is there any lesson [to be learned]?\n[138].\n\nNone",
    "book_id": "399",
    "new_page_number": 132
  },
  {
    "serial_number": "4359029",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 139,
    "volume_number": 1,
    "text": "147 - (Intending to pray towards his grave) (181).\n\n(Al-Radd 'ala Al-Bakri) by Ibn Taymiyyah (71), (Al-Qa'idah Al-Jalilah) (125 - 126), (Al-Ighathah) (1 / 194 - 195), and Al-Khadimi on (Al-Tariqah Al-Muhammadiyyah) (4 / 322).\n\n148 - (Sitting at the grave and around it for recitation and Dhikr). (Al-Iqtida) (183 - 210).\n\n149 - Intending [to go to] the Prophetic Grave to greet him after every prayer (182).\n\n150 - (The people of Madinah intending to visit the Prophetic Grave whenever they enter the mosque or leave it). (Al-Radd 'ala Al-Akhna'i) (150 - 151, 156, 217, 218), (Al-Shifa fi Huquq Al-Mustafa) by Qadi Iyad (2 / 79), and (Al-Madkhal) (1 / 262).",
    "foot_note": "1. (180) The legislated way is the abbreviated greeting: Peace be upon you, O Messenger of Allah, and the mercy of Allah and His blessings. Peace be upon you, O Abu Bakr. Peace be upon you, O Umar. As Ibn Umar used to do. If he adds something slight without neglecting [other duties] or adhering to it [strictly], there is no harm, Allah the Exalted willing.\n181. I saw during the three years I spent in Al-Madinah Al-Munawwarah (1381 - 1383) as a professor at the Islamic University, many innovations performed in the Prophetic Mosque, and the officials there are silent about all of that, just as is the case here in Syria. Among these innovations is what is explicit Shirk, like this innovation: for many pilgrims intentionally pray towards the Noble Grave even after Asr prayer during the disliked time. Encouraging them to do so is that they see the wall of the grave which they face has a small mihrab from the Turkish relics, calling out with the tongue of its state: O Ignorant ones, come to pray at it. Add to that, the place they pray on is furnished with the best carpets. I spoke with some virtuous people about the necessity of intervening between these ignorant people and the violations they commit. One of the simplest things I suggested was removing the carpet from that place, not the mihrab. We were promised good, but the official who has the ability to do so did not do it and will not do it unless Allah the Exalted wills. That is because he goes along with some of the people of Madinah in their desires and whims and does not respond to the sincere advisors among the people of knowledge, even if they are from the people of the country. So complaint is to Allah regarding the weakness of faith and the dominance of desire, against which even Tawhid was of no avail due to the dominance of the love of wealth over its people, except whom Allah wills, and how few they are. The Messenger of Allah (peace and blessings of Allah be upon him) spoke the truth when he said: \"The trial of my Ummah is wealth.\"\n[139].\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 133
  },
  {
    "serial_number": "4359034",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 140,
    "volume_number": 1,
    "text": "151 - Facing the direction of the Noble Grave when entering the mosque or leaving it, and standing far from it with utmost humility.\n\n152 - Raising the voice following the prayer by their saying: Peace be upon you, O Messenger of Allah...) . (Majmu'at al-Rasa'il al-Kubra) (2 / 397).\n\n153 - Their seeking blessing from the pieces of green paint falling with the rain from the dome of the Prophetic Grave.\n\n154 - (Their seeking nearness [to Allah] by eating Saihani dates in the Noble Rawdah between the Minbar and the Grave). (Al-Ba'ith 'ala Inkar al-Bida') (p. 70) and (Majmu'at al-Rasa'il al-Kubra) (2 / 396).\n\n155 - (Cutting off their hair and throwing it into the large lamp near the Prophetic soil). (Previous sources).",
    "foot_note": "1. (182) This, along with being an innovation and exaggeration in religion and contrary to his saying (peace and blessings of Allah be upon him) \"Do not take my grave as a place of celebration, and pray upon me wherever you are, for your prayer reaches me,\" is a cause for wasting many Sunnahs and abundant virtues, which are the Dhikrs and litanies after the Salam, for they abandon them and rush to this innovation. May Allah have mercy on the one who said: \"No innovation is introduced except that a Sunnah is killed.\"\n[140].\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 134
  },
  {
    "serial_number": "4359039",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Pilgrimage of the Prophet (peace and blessings of Allah be upon him) as narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 141,
    "volume_number": 1,
    "text": "156 - Some wiping with their hands the two copper palm trees placed in the mosque west of the Minbar (183).\n\n157 - Many of the people of Madinah and strangers adhering to praying in the old mosque and cutting off the first rows that are in the expansion of Omar and others (184).\n\n1 - Abandoning connecting the rows, which is obligatory according to many hadiths, including his saying (peace and blessings of Allah be upon him): \"Whoever connects a row, Allah connects him, and whoever cuts a row, Allah cuts him.\" Narrated by Al-Nasa'i and others with a Sahih chain. It is observed in the Prophetic Mosque that the first rows in the front expansion are not completed due to the eagerness of those people to pray in the old mosque, and thus they fall into sin.\n\n2 - People of knowledge abandoning prayer behind the Imam despite the Prophet's (peace and blessings of Allah be upon him) command regarding it in his saying: \"Let those of you who are mature and prudent be nearest to me, then those who come after them, then those who come after them.\" Narrated by Muslim.",
    "foot_note": "1. (183) There is absolutely no benefit from these two palm trees; they were placed only for decoration and to tempt people. We were promised when we were there that they would be removed, but in vain.\n[141].\n\n1. (184) Some people of knowledge may fall into this innovation, and their doubt regarding it is seeking [blessing] by the demonstrative noun in his saying (peace and blessings of Allah be upon him): \"A prayer in this mosque of mine is worth a thousand prayers...\" Although this is not explicit text for what they went to, because it does not contradict the extension of virtue to the expansion as is the case in the expansions added to the Meccan Mosque. Knowing that the utmost matter is the encouragement to pray in the mosque and there is no obligation in that. If so, they may adhere to voluntary prayers in it where congregation is not held. As for extending that to congregational prayer, that is a sheer error because by doing so they are like one who builds a palace and destroys a city, especially if they are people of knowledge, for they waste many matters that are far more important than that virtue. Indeed, some of them are obligatory, and the one who leaves them sins. I mention what is easy now:\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 135
  },
  {
    "serial_number": "4359043",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 142,
    "volume_number": 1,
    "text": "3 - Missing out on praying in the first rows for all of them, especially the very first one, despite his saying (peace be upon him): \"The best of the men's rows are the first ones and the worst of them are the last ones...\" Narrated by Muslim and others. And he said: \"If the people knew what is in the Call (Adhan) and the first row, then they found no way except to draw lots for it, they would draw lots.\" Narrated by the two Sheikhs. Although we cannot assert that the virtue of the first row is absolutely better than the later rows in the old mosque [area], likewise no one among them can claim the opposite. But if the two previously mentioned matters are added to it, then there is no doubt at that point in preferring prayer in the expansion over prayer in the old mosque. Therefore, more than one of the scholars and students of knowledge were convinced by this when I discussed the issue with them, and they began praying in the expansion. May Allah have mercy on the one who is fair and does not act arbitrarily. [142]\n\n158 - The visitors of Medina committing themselves to stay in it for a week so that they can pray forty prayers in the Prophet's Mosque, so that a dissociation from hypocrisy and a dissociation from the Fire may be written for them. (185)\n\n159 - (Intending [to visit] any of the mosques and shrines in Medina and around it other than the Prophet's Mosque (peace be upon him), except for the Quba Mosque). (\"Tafsir Surat Al-Ikhlas\") (173 - 177)",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 136
  },
  {
    "serial_number": "4359046",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 143,
    "volume_number": 1,
    "text": "160 - Those known as (Muzawwirin - Guides) dictating to groups of pilgrims some Adhkar (remembrances) and Awrad (litanies) at the Chamber or far from it with raised voices, and these people repeating what they were dictated with even louder voices.\n\n161 - Visiting Al-Baqi' every day and praying in the Mosque of Fatimah (may Allah be pleased with her). (186)\n\n162 - Allocating Thursday for visiting the martyrs of Uhud.",
    "foot_note": "1. (185) The Hadith reported regarding that is weak and cannot be used as proof. I have explained its defect in \"Al-Silsilah\" number (364). It is not permissible to act upon it because it is legislation, especially since some pilgrims may feel distressed by that - as I have known myself - thinking that what is reported in it is established and authentic. They might miss some prayers in it and fall into distress, while Allah has relieved them of it. \n[143].\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 137
  },
  {
    "serial_number": "4359049",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 144,
    "volume_number": 1,
    "text": "163 - Tying rags to the window overlooking the ground of the martyrs. (187)\n\n164 - Seeking blessings by bathing in the pool next to their graves.\n\n165 - (Exiting the Prophet's Mosque walking backward at farewell). (\"Majmu'at Al-Rasa'il Al-Kubra\") (2 / 388) and (\"Al-Madkhal\") (4 / 238). Innovations of Bayt Al-Maqdis (Jerusalem)\n\n166 - Intending to visit Bayt Al-Maqdis with Hajj and their saying: \"May Allah sanctify your Hajj.\" (188)\n\n167 - (Circumambulating the Dome of the Rock in imitation of circumambulating the Kaaba). (\"Majmu'at Al-Rasa'il Al-Kubra\") (2 / 380, 372 - 381)",
    "foot_note": "1. (186) Al-Ghazali deemed this and the one before it desirable, may Allah forgive us and him. He did not mention any evidence for that. Far from it! There is no doubt about the legitimacy of visiting graves, but generally, without restricting that to a specific day or every day; rather, according to what is easy. As for praying in the Mosque of Fatimah (may Allah be pleased with her), if it is a mosque built over her grave, there is no doubt about the prohibition of praying in it. If it is a mosque merely attributed to her, then intending to pray in it is an innovation, as previously quoted from Ibn Taymiyyah two paragraphs ago. \n187. The land containing the grave of Hamzah and others from the martyrs of Uhud had no building on it until last year (1383). However, the Saudi government in this year erected a wall built with cement on their land and made a large iron gate for it on the Qiblah side and an iron window at the end of the eastern wall. When we saw that, we anticipated evil and said: This is a harbinger of evil, and it is not far-fetched that it is a prelude to restoring the mosque and domes over their graves as was the case before the first Saudi rule when the people were enthusiastic for the religion, acting by its rulings. And Allah is predominant over His affair. This is the beginning of the evil, for I have seen rags accumulating on the window while the building of the wall was not yet complete. I was told: Some of them have started praying inside the structure for seeking blessings. If the matter continues in this manner of leniency in applying the Sharia and daring to violate it, I do not rule out that one day the manifestations of idolatry will return to the land of the State of Tawhid as was the case before its rule. May Allah make its steps firm and direct it to act by the Sharia completely; may the blame of a blamer not overtake them in [the cause of] Allah. And He is the One sought for help. \n[144].\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 138
  },
  {
    "serial_number": "4359054",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 145,
    "volume_number": 1,
    "text": "168 - (Venerating the Rock with any type of veneration such as wiping over it, kissing it, driving sheep to it to slaughter them there, defining it [standing there] on the eve of Arafah, building over it, and other than that).\n\n(\"Majmu'at Al-Rasa'il Al-Kubra\") (2 / 56 - 57) (189)",
    "foot_note": "1. (188) Sheikh Al-Islam said in his \"Majmu'ah\" (2 / 60 - 61): \"As for visiting Bayt Al-Maqdis, it is legislated at all times... But traveling to it for the purpose of defining it [standing there like Arafah] believing that this is an act of closeness is forbidden... And traveling to it with Hajj is not an act of closeness. And the saying of the sayer: 'May Allah sanctify your Hajj' is a false statement with no basis. Just as what is narrated: 'Whoever visits me and visits my father (Abraham) in one year, I guarantee Paradise for him' - for this is a lie by the agreement of the people of knowledge of Hadith. Rather, likewise every Hadith narrated regarding visiting the grave of the Prophet (peace be upon him) is weak, indeed fabricated.\" \n[145].\n\nNone",
    "book_id": "399",
    "new_page_number": 139
  },
  {
    "serial_number": "4359056",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 146,
    "volume_number": 1,
    "text": "169 - (Their claim that whoever stands at Bayt Al-Maqdis for four stands, it equals a Hajj).\n\n(\"Al-Ba'ith\") (p. 20)\n\n170 - Their claim that there is a footprint of the Prophet (peace be upon him) and a trace of his turban on the Rock, and some of them think it is the place of the foot of the Lord, Glory be to Him and Exalted. (190)\n\n171 - The place they claim is the cradle of Jesus (peace be upon him).\n\n172 - Their claim that the Sirat (Bridge) and the Mizan (Scale) are there, and that the wall that separates Paradise and Hell is that wall built east of the Mosque.\n\n173 - (Venerating the Chain or its location). (\"Majmu'at Al-Rasa'il\") (2 / 59)",
    "foot_note": "1. (189) He [Ibn Taymiyyah] (may Allah have mercy on him) said (pp. 57 - 58): \"Al-Masjid Al-Aqsa is a name for the entire mosque built by Solomon (peace be upon him). Some people have started calling 'Al-Aqsa' the prayer place built by Umar bin Al-Khattab (may Allah be pleased with him) in the front of it. Praying in this prayer place built by Umar for the Muslims is better than praying in the rest of the mosque. For when Umar bin Al-Khattab opened Bayt Al-Maqdis, there was a great deal of refuse on the Rock because the Christians intended to insult it in opposition to the Jews who used to pray towards it. So Umar (may Allah be pleased with him) commanded the removal of the filth from it and said to Ka'b: 'Where do you see we should build a prayer place for the Muslims?' He said: 'Behind the Rock.' He said: 'O son of a Jewish woman, your Jewishness has mixed with you! Rather, I will build it in front of it, for ours are the fronts of the mosques.' For this reason, the Imams of the Ummah, when they entered the Mosque, intended to pray in the prayer place built by Umar. As for the Rock, neither Umar (may Allah be pleased with him) nor the Companions prayed at it, nor was there a dome over it during the time of the Rightly Guided Caliphs. Rather, it was exposed during the caliphate of Umar, Uthman, Ali, Mu'awiyah, Yazid, and Marwan. But...\" then he mentioned that Abdul Malik bin Marwan was the one who built the dome over it and covered it in winter and summer to encourage people to visit Bayt Al-Maqdis... Then he said: \"As for the people of knowledge among the Companions and those who followed them in goodness, they did not venerate the Rock, for it is an abrogated Qiblah. It is only venerated by the Jews and some Christians.\" I say: From that, you know that its renovation and the renewal of its building, which was announced weeks ago and on which they spent millions of Liras, is only excess and wastefulness and opposition to the path of the first believers. \n[146].\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "399",
    "new_page_number": 140
  },
  {
    "serial_number": "4359062",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 147,
    "volume_number": 1,
    "text": "174 - (And praying at the grave of Abraham the Friend (Al-Khalil), peace be upon him). (Previous Source) (2 / 56)",
    "foot_note": "1. (190) Sheikh Al-Islam (may Allah the Exalted have mercy on him) mentioned all these matters in \"Al-Majmu'ah\" (2 / 58 - 59) and clarified them by saying: \"It is all a lie.\" And he said regarding the place of the cradle: \"It was only a place for the baptism of the Christians.\" \n[147].",
    "book_id": "399",
    "new_page_number": 141
  },
  {
    "serial_number": "4359063",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "The Prophet's Hajj (peace be upon him) as Narrated by Jabir (may Allah be pleased with him)",
    "edition": "Fifth - 1399",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 148,
    "volume_number": 1,
    "text": "175 - Gathering during the Hajj season to sing and play the tambourine in Al-Masjid Al-Aqsa. (\"Iqtida' Al-Sirat Al-Mustaqim\") (p. 149). And this is the last of what was possible to collect of the innovations of Hajj and Visitation. I ask Him, Blessed and Exalted, to make this a pardon for the Muslims to follow the traces of the Master of Messengers and be guided by his guidance (peace be upon him). And (Glory be to You, O Allah, and with Your praise, I bear witness that there is no deity except You, I seek Your forgiveness and I repent to You). [148]",
    "foot_note": "None",
    "book_id": "399",
    "new_page_number": 142
  }
]