[
  {
    "text": "Preparation for Death and the Questioning of the Grave\nAuthor: زين الدين أحمد بن عبد العزيز بن زين الدين بن علي بن أحمد المعبري المليباري الهندي\nYear: 987",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 1
  },
  {
    "text": "sn: 5440\nbook_title: الاستعداد للموت وسؤال القبر\nbook_link: https://shamela.ws/book/483\nbook_id: 483\nauthor_name: زين الدين أحمد بن عبد العزيز بن زين الدين بن علي بن أحمد المعبري المليباري الهندي\nauthor_year: 987\nnickname: Null\nauthor_link: https://shamela.ws/author/435\nauthor_ID: 435\neditor: أبو المنذر سعد كريم الدرعمي\npublisher: دار ابن خلدون - اسكندرية\nedition: Null\npages: 88\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الرقائق والآداب والأذكار\ncategory_id: 23",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 2
  },
  {
    "serial_number": "4940855",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Heart Softeners, Etiquette, and Adhkar. Book: Preparation for Death and the Questioning of the Grave. Author: Zain al-Din bin Abdul Aziz bin Zain al-Din Ibn Ali bin Ahmed Al-Ma'bari Al-Malibari Al-Hindi (Died 987 AH). Editor: Abu Al-Mundhir Saad Karim Al-Dar'ami. Publisher: Dar Ibn Khaldun - Alexandria. Number of Pages: 88 [Numbering of the book matches the printed version]. Publication Date in Shamela: 15 Rabi' al-Awwal 1433.\nBook: Preparation for Death and the Questioning of the Grave. Author: Zain al-Din bin Abdul Aziz bin Zain al-Din Ibn Ali bin Ahmed Al-Ma'bari Al-Malibari Al-Hindi (Died 987 AH). Editor: Abu Al-Mundhir Saad Karim Al-Dar'ami. Publisher: Dar Ibn Khaldun - Alexandria. Number of Pages: 88 [Numbering of the book matches the printed version]. Publication Date in Shamela: 15 Rabi' al-Awwal 1433.\nAuthor: Zain al-Din bin Abdul Aziz bin Zain al-Din Ibn Ali bin Ahmed Al-Ma'bari Al-Malibari Al-Hindi (Died 987 AH). Editor: Abu Al-Mundhir Saad Karim Al-Dar'ami. Publisher: Dar Ibn Khaldun - Alexandria. Number of Pages: 88 [Numbering of the book matches the printed version]. Publication Date in Shamela: 15 Rabi' al-Awwal 1433.\nEditor: Abu Al-Mundhir Saad Karim Al-Dar'ami. Publisher: Dar Ibn Khaldun - Alexandria. Number of Pages: 88 [Numbering of the book matches the printed version]. Publication Date in Shamela: 15 Rabi' al-Awwal 1433.\n[Numbering of the book matches the printed version]. Publication Date in Shamela: 15 Rabi' al-Awwal 1433.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 3
  },
  {
    "serial_number": "4940856",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 7,
    "volume_number": 1,
    "text": "Warning against being deceived by the world. Allah the Almighty said: (O you who have believed, let not your wealth and your children divert you from remembrance of Allah. And whoever does that - then those are the losers. And spend [in the way of Allah] from what We have provided you before death approaches one of you and he says, 'My Lord, if only You would delay me for a brief term so I would give charity and be among the righteous.' But never will Allah delay a soul when its time has come. And Allah is Acquainted with what you do.) [Al-Munafiqun: 9-11]. In the book of Tirmidhi, the Prophet, peace and blessings be upon him, said: 'Frequently remember the destroyer of pleasures: death.' In the two Sahihs, on the authority of Ibn Umar, may Allah be pleased with them both, the Messenger of Allah, peace and blessings be upon him, said: 'It is not right for a Muslim man who has something to bequeath to stay for two nights without his will being written and kept with him.' In the narration of Muslim: 'To stay for three nights.' Ibn Umar, may Allah be pleased with them both, said: 'Not a night has passed me since I heard the Messenger of Allah, peace and blessings be upon him, say that, except that my will is with me.' In Sahih Al-Bukhari, on the authority of Ibn Umar, may Allah be pleased with them both, he said: 'The Messenger of Allah, peace and blessings be upon him, took hold of my shoulder and said: Be in the world as if you were a stranger or a wayfarer, and count yourself among the inhabitants of the graves.' Meaning, do not lean towards it, do not take it as a homeland, do not tell yourself you will remain long in it, do not concern yourself with it, and do not cling to it with what a stranger does not cling to in a land other than his own. Do not occupy yourself in it with what occupies a stranger who wants to go to his family. Ibn Umar, may Allah be pleased with them both, used to say: 'If you reach the evening, do not wait for the morning, and if you reach the morning, do not wait for the evening. Take from your health for your sickness, and from your life for your death.' The Messenger of Allah, peace and blessings be upon him, said: 'Two things the son of Adam dislikes: He dislikes death, yet death is better'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 4
  },
  {
    "serial_number": "4940857",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 8,
    "volume_number": 1,
    "text": "for the believer than fitnah (trial/temptation); and he dislikes the scarcity of wealth, yet scarce wealth means less accountability.' Hatim al-Asam said: 'Everything has an adornment, and the adornment of worship is fear, and the sign of fear is shortening hope.' It was said to Al-Hasan: 'Will you not wash your shirt?' He said: 'The matter is more urgent than that.' Know that it is Sunnah for every responsible person (Mukallaf) to frequently remember death, and one should prepare for it by repenting to Allah Almighty and returning usurped rights. This is even more emphasized for the sick because it softens his heart and causes him to fear, so he returns from injustices and turns towards acts of obedience. Know that the children of Adam are of two groups: A group that looked at the visible illusion of the world and held onto the hope of a long life and did not reflect on the final breath. And a group of wise people who placed the final breath before their eyes to look at what their destination will be, how they will leave the world and depart from it, whether their faith will be intact, what of the world will descend with them into their graves, and what they will leave for their enemies while the burden and punishment of it remain upon them. This reflection is obligatory upon all creation, and it is even more obligatory upon kings and people of the world because they have often disturbed the hearts of creation and instilled terror in their hearts. For the Truth (Allah), may His mention be exalted, has an angel known as the Angel of Death; there is no escape for anyone from his pursuit and his grasp. All agents of kings accept a bribe of gold and food, but this agent takes nothing but the soul as a bribe. With all other agents of sultans, intercession is useful, but with this agent, the intercession of an intercessor is of no use. All agents grant respite to those they are assigned to for a day or an hour, but this agent does not neglect a single breath. It is narrated that there was a king of great wealth who had gathered a vast fortune and amassed every type of worldly good created by Allah Almighty to indulge himself and free himself to consume what he had gathered. He gathered abundant blessings, built a lofty, high, and imposing palace suitable for kings, princes, elders, and the great, installed two sturdy gates on it, and stationed boys, executioners, and guards upon it",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 5
  },
  {
    "serial_number": "4940858",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 9,
    "volume_number": 1,
    "text": "and soldiers and doorkeepers as he desired. He ordered some people to prepare the finest food for him and gathered his family, entourage, companions, and servants to eat with him and receive his gifts. He sat on the throne of his kingdom, leaned on his cushion, and said: 'O soul, you have gathered the blessings of the world in their entirety, so now free yourself for this and eat these blessings, enjoying a long life and abundant fortune.' He had not finished speaking to himself when a man came from outside the palace, wearing worn-out clothes, with a satchel hanging from his neck, in the appearance of a beggar asking for food. He came and knocked the door ring with a mighty, terrifying knock such that the palace shook and the throne trembled. The servants were frightened and leaped to the door, shouting at the knocker, saying: 'O guest, what is this rudeness and bad manners? Wait until we eat and we will give you what is left over.' He said to them: 'Tell your master to come out to me, for I have important business with him and a serious matter.' They said to him: 'Step aside, O guest! Who are you that we should order our master to come out to you?' He said: 'You inform him of what I mentioned to you.' When they informed him, he said: 'Why did you not rebuke him, act harshly towards him, and scold him?' Then he knocked the door ring even harder than the first knock. They rose from their places with sticks and weapons, intending to fight him. He shouted at them with a shout and said: 'Stay in your places, for I am the Angel of Death.' Their minds went blank, their muscles trembled, and their limbs ceased to move. The King said: 'Tell him to take a substitute for me and a replacement instead of me.' He said: 'I will take nothing but your soul, and I did not come except for your sake, to separate between you and the blessings you gathered and the wealth you contained and stored.' He sighed deeply and said: 'May Allah curse this wealth which deceived me, distanced me, and prevented me from worshipping my Lord. I used to think it would benefit me, but today it has become my regret and my trial; I leave empty-handed from it, and it remains for my enemies.' Allah Almighty caused the wealth to speak until it said: 'For what reason do you curse me? Curse yourself! For Allah Almighty created me and you from dust, and placed me in your hand so that you may take provisions from me for your afterlife, give charity from me to the poor, give Zakat from me to the weak, and build with me hospices, mosques, bridges, and archways, to be a help to you on the Last Day. You gathered me and stored me, and spent me on your desires. You did not thank my right, but rather you were ungrateful for me. So now you leave me to your enemies while you remain with your regret and your trial. So what is my sin that you curse me and revile me?' Then the Angel of Death seized his soul before he could eat the food, and he fell upon his throne, a victim of death:",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 6
  },
  {
    "serial_number": "4940859",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 10,
    "volume_number": 1,
    "text": "Prepare for the graves—woe to you—and the tomb... A provision of piety for the longest imprisonment. / For you do not know, if you reach the morning... In the best state you hope for, perhaps you will not reach the evening. / I will tire my soul so that I may find rest... For the humiliation of the soul is honor for the soul. / And renounce the world, for its resident... Restrains his anger regarding it; how similar today is to yesterday.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 7
  },
  {
    "serial_number": "4940860",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 11,
    "volume_number": 1,
    "text": "Preparation for the Descent of Death. Allah Almighty said: (Until, when death comes to one of them, he says, 'My Lord, send me back. That I might do righteousness in that which I left behind.' No! It is only a word he is saying; and behind them is a barrier until the Day they are resurrected. So when the Horn is blown, no relationship will there be among them that Day, nor will they ask about one another.) to the end of the Surah. And on the authority of Abu Sa'id Al-Khudri, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, planted a stick in front of him, and another by his side, and another further away. He said: 'Do you know what this is?' They said: 'Allah and His Messenger know best.' He said: 'This is the human, and this is his destined time (Ajal), and this is his hope (Amal). He chases hope, but the destined time overtakes him before the hope.' It is narrated on the authority of Ibn Abbas, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, that he said to a man while admonishing him: 'Take advantage of five before five: Your youth before your old age, your health before your sickness, your wealth before your poverty, your free time before your busyness, and your life before your death.' Imam Abu Hamid Al-Ghazali wrote to Sheikh Abu Al-Fath bin Salamah: 'It has reached my hearing that you seek from me brief words by way of advice and preaching. I do not see myself worthy of that, for preaching is a Zakat (alms) whose threshold (Nisab) is self-admonition. So he who has no threshold, how can he pay Zakat? And he who lacks light, how can others be illuminated by him? And when will the shadow be straight if the stick is crooked?' Allah Almighty advised Jesus, son of Mary, peace be upon them: 'O Son of Mary, admonish yourself; if you accept the admonition, then admonish the people, otherwise be shy of Me.' Our Prophet, peace and blessings be upon him, said: 'I have left among you a speaker and a silent one.' The speaker is the Quran and the silent one is Death. In them is sufficiency for every person who takes heed. And he who does not take heed from them, how can he admonish others? Indeed, I have admonished myself with them, and it accepted and believed in word and deed, but refused and rebelled in realization and action. So I said to my soul: 'Are you not a believer?'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 8
  },
  {
    "serial_number": "4940861",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 12,
    "volume_number": 1,
    "text": "that the Quran is the Speaking Preacher and that it is the speech of Allah revealed, which falsehood cannot approach from before it or from behind it? She (my soul) said: 'Yes.' So I said to her: Allah Almighty has said: (Whoever desires the life of this world and its adornments - We fully repay them for their deeds therein, and they therein will not be deprived. Those are the ones for whom there is not in the Hereafter but the Fire. And lost is what they did therein, and worthless is what they used to do.) Allah has promised the Fire for desiring the world, and everything that does not accompany one after death is from the world. So have you elevated yourself above the love of the world and desiring it? If a Christian doctor promised you death or sickness for consuming the most delicious desires, you would avoid them, protect yourself, and disdain them. Is the Christian more truthful to you than Allah Almighty? If that is so, how great is your disbelief! Or is the sickness more severe to you than the Fire? If that is so, how great is your ignorance! She conceded, but did not benefit; rather, she persisted in inclining towards the immediate life and continued. Then I turned to her and admonished her with the [other] preacher, so I said to her: The Speaker has informed about the Silent One. Allah Almighty said: (Say, 'Indeed, the death from which you flee - indeed, it will meet you. Then you will be returned to the Knower of the unseen and the witnessed, and He will inform you about what you used to do.') And I said to her: Suppose you incline to the immediate life, do you not believe that death will inevitably come to you, cutting off what you are holding onto and stripping from you everything you desire? And that everything which is coming is near, and the distant is that which is not coming? Allah Almighty has said: (Have you considered: if We gave them enjoyment for years, Then there came to them that which they were promised, Of no avail to them would be whatever they were given of enjoyment.) So it is as if you are removed by this admonition from everything you are in. She said: 'You have spoken the truth.' But it was from her a saying behind which nothing resulted. She never strove in gathering provisions for the Hereafter like her striving in managing the immediate life, nor did she strive for the pleasure of Allah Almighty like her striving to seek her own pleasure and seek",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 9
  },
  {
    "serial_number": "4940862",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 13,
    "volume_number": 1,
    "text": "the pleasure of creation. She was not shy before Allah Almighty as she is shy before a single person from creation. She did not roll up her sleeves to prepare for the Hereafter like her preparation in the summer for the sake of winter, and in the winter for the sake of summer. For she does not feel secure in the beginning of winter unless she has freed herself to gather all she needs for it, even though death might snatch her away and winter might not reach her, while the Hereafter is to her a certainty, so it is inconceivable that it be snatched away from her. So I said to her: 'Do you not prepare for summer according to its length, and make tools for summer according to your patience with the heat?' She said: 'Yes.' I said: 'Then disobey Allah according to your patience with the Fire, and prepare for the Hereafter according to your remaining in it.' She said: 'This is the duty which no one is permitted to abandon except a fool.' Then she continued on her nature, and I found myself as some wise men said: 'Among people is he whom half of him is rebuked, yet his other half is not rebuked,' and I do not see myself but as one of them. When I saw her persisting in transgression, not benefiting from the admonitions of death and the Quran, I saw the most important matter was to investigate the cause of her persistence despite her confession and belief, for that is among the great wonders. My investigation into it was prolonged until I stood upon its cause. Here I am advising myself and you to beware of it. It is the great disease and the cause calling to delusion and negligence: it is the belief in the delay of death and considering its sudden attack unlikely in the near future. For if a truthful person informed one during the daylight that he would die in his night, or die within a week or a month, he would straighten up on the Straight Path and leave everything he is in—which he thinks he is doing for Allah Almighty while he is deceived in it—let alone what is not for Allah Almighty. It was revealed to me with certainty that whoever wakes up hoping to reach the evening, or reaches the evening hoping to wake up, is not free from lethargy and procrastination and is only capable of a weak pace. So I advise you and myself with what the Messenger of Allah, peace and blessings be upon him, advised when he said: 'Pray the prayer of one bidding farewell.' Indeed, he was given the concise speech and the decisive word. One does not benefit from preaching except through this. Whoever believes predominantly in every prayer that it is his last prayer, his fear of Allah Almighty and his awe of Him are present with him. And whoever does not have this thought cross his mind, his life is shortened [in blessing], his death approaches, his heart neglects his prayer, and his soul becomes bored. He remains in perpetual negligence, constant lethargy, and successive procrastination until death overtakes him and destroys him with the regret of missed opportunity. I propose to him that he asks Allah Almighty to grant me this rank, for I am a seeker of it but fall short of it. And I advise him not to be satisfied with himself except",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 10
  },
  {
    "serial_number": "4940863",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 14,
    "volume_number": 1,
    "text": "with it, and to beware of the places of delusion in it, and to guard against the deception of the soul, for its deception is not detected except by the intelligent, and how few they are. The instructions, even if many, and the mentioned matters, even if great, the instruction of Allah is the most perfect, most beneficial, and most comprehensive. Allah Almighty has said in the decisive Quran: (And We have instructed those who were given the Scripture before you and yourselves to fear Allah.) How happy is he who accepts the instruction of Allah Almighty, acts upon it, and stores it for himself to find it on the day of his return and destination. Yazid al-Raqashi said: 'There was a tyrant among the tyrants of the Children of Israel. One day he was sitting on the throne of his kingdom when he saw a man who had entered from the door of the house, possessing a terrifying appearance and a frightening form. His fear intensified at his intrusion, his appearance, and his arrival. He leaped in his face and said to him: 'Who are you, O man, and who gave you permission to enter my house?' He said: ' The Owner of the house gave me permission. I am the one whom no doorkeeper can block, I do not need permission to enter upon kings, I do not fear the authority of a Sultan, no tyrant frightens me, and no one can flee from my grasp.' When he heard these words, he fell on his face and trembling seized his body. He said: 'You are the Angel of Death.' He said: 'Yes.' He said: 'I adjure you by Allah to grant me respite for one day so that I may repent from my sin, ask forgiveness from my Lord, and return the wealth I deposited in my treasuries to its owners, so I do not bear the hardship of its punishment.' He said: 'How can I grant you respite when the days of your life are counted and its times are recorded and written?' He said: 'Grant me an hour.' He said: 'Indeed, the hours are in the account; they have passed while you were heedless, and ended while you were oblivious. You have exhausted your breaths and not a single breath remains for you.' He said: 'Who will be with me when you transfer me to my grave?' He said: 'Nothing will be with you except your deeds.' He said: 'I have no deeds?' He said: 'Undoubtedly, your resting place will be in the Fire and your destination to the anger of the Compeller.' And he seized his soul, so he fell from his throne. The clamor of the people of his kingdom rose and elevated. If they knew what he was going to from the wrath of his Lord, their weeping for him would be greater and their wailing more abundant.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 11
  },
  {
    "serial_number": "4940864",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 15,
    "volume_number": 1,
    "text": "Condemnation of Long Hope (Al-Amal). Allah Almighty said: (Has the time not come for those who have believed that their hearts should become humbly submissive at the remembrance of Allah and what has come down of the truth? And let them not be like those who were given the Scripture before, and a long period passed over them, so their hearts hardened; and many of them are defiantly disobedient.) On the authority of Ubayy bin Ka'b, may Allah be pleased with him, he said: 'When a third of the night had passed, the Messenger of Allah, peace and blessings be upon him, would stand up and say: O people, remember Allah! The Quaking One (Al-Rajifah) has come, followed by the Subsequent One (Al-Radifah). Death has come with what is in it.' On the authority of Ibn Abbas, may Allah be pleased with them both, that the Messenger of Allah, peace and blessings be upon him, used to spill water (urinate) and then perform Tayammum with dust. I would say: 'O Messenger of Allah, the water is near to you.' He would say: 'How do I know? Perhaps I will not reach it.' On the authority of Anas, the Prophet, peace and blessings be upon him, said: 'The son of Adam grows old, but two things remain young in him: Greed for wealth and greed for life.' And the Messenger of Allah, peace and blessings be upon him, said: 'The likeness of the son of Adam: by his side are ninety-nine deaths; if the deaths miss him, he falls into old age.' It is narrated that Al-Hasan was told that so-and-so died suddenly. He said: 'What surprises you about that? If he did not die suddenly, he would have fallen ill suddenly and then died.' Al-Ghazali, may Allah have mercy on him, said: 'You must avoid long hope, for if it is prolonged, it stirs up four things: First, abandoning obedience and laziness in it; he says, 'I will do it later,' and the days are ahead. Second, abandoning repentance and postponing it; he says, 'I will repent later,' and there is ample time in the days, and I am young with few years, and repentance is in my hands whenever I desire it. Perhaps death assassinates him while persisting [in sin], and the destined time snatches away the rectifying of deeds. Third, greed for gathering wealth and occupying oneself with the world over the Hereafter; he says, 'I fear poverty in old age, and perhaps I will become too weak to earn, so I must have something extra to store for sickness, old age, or poverty.' This and similar thoughts stir up desire for the world, greed for it, and concern for provision. You say, 'What will I eat and what will I wear this winter and this summer?' and 'I have nothing.' Perhaps life will be long so I will need it, and need combined with grey hair is severe, and I must have sustenance and independence from people. This",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 12
  },
  {
    "serial_number": "4940865",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 16,
    "volume_number": 1,
    "text": "and its likes stir one to seek the world, desire it, gather for it, and withhold what you have of it. Fourth, hardness of the heart and forgetfulness of the Hereafter, because if you hope for a long life, you do not remember death and the grave.' And from Ali bin Abi Talib, may Allah be pleased with him: 'What I fear most for you are two things: long hope and following desires. Indeed, long hope makes one forget the Hereafter, and following desires blocks you from the truth. Thus, your thought becomes about the talk of the world and the means of living in the company of creation towards it, so the heart hardens. Due to long hope, obedience decreases, repentance is delayed, disobedience increases, greed intensifies, the heart hardens, and negligence becomes great. So it goes, and we seek refuge in Allah. If Allah does not have mercy, what state is worse than this, and what affliction is greater than this? Indeed, the softness of the heart and its purity come from remembering death, its suddenness, the grave, reward and punishment, and the states of the Hereafter.' It is narrated that Dhul-Qarnayn passed by a people who owned nothing of the means of the world. They had dug the graves of their dead at the doors of their houses and were constantly tending to those graves, cleaning them, visiting them, and worshipping Allah Almighty among them. They had no food except grass and the plants of the earth. So Dhul-Qarnayn sent a man to them summoning their king, but he did not answer him and said: 'I have no need of him.' So Dhul-Qarnayn came to him and said: 'How is your condition? For I see no gold or silver, and I see nothing of the blessings of the world with you.' He said: 'Yes, because no one is ever satisfied with the world.' He said: 'Why did you dig the graves at your doors?' He said: 'So that they may be before our eyes; looking at them renews the remembrance of death and cools the love of the world in our hearts, so we are not distracted by it from worshipping our Lord.' He said: 'How do you eat grass?' He said: 'Because we hate to make our stomachs graveyards for animals, and because the pleasure of food does not go beyond the throat.' Then he extended his hand and brought out a human skull, placed it in front of him, and said: 'O Dhul-Qarnayn, do you know who this was?' He said: 'No.' He said: 'The owner of this skull was a king among the kings of the world. He used to oppress his subjects, tyrannize the weak, and spend his time gathering the world. So Allah seized his soul and made the Fire his abode, and this is his head.' Then he extended his hand and placed another skull in front of him and said to him: 'Do you know this one?' He said: 'No.' He said: 'This was a just king, compassionate to his subjects, loving the people of his kingdom. So Allah seized his soul, lodged him in His Paradise, and raised his rank.' Then he placed his hand on the head of Dhul-Qarnayn and said:",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 13
  },
  {
    "serial_number": "4940866",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 17,
    "volume_number": 1,
    "text": "'See which of these two heads this head will be?' Dhul-Qarnayn wept intensely and hugged him to his chest and said to him: 'If you desire my companionship, I will hand over my ministry to you and share my kingdom with you.' He said: 'Far from it! I have no desire for that.' He said: 'Why?' He said: 'Because all creation are your enemies because of wealth and kingdom, and all of them are my friends because of contentment and poverty.' How excellent is the poet who said: Your evidence is that poverty is better than wealth... And that little wealth is better than abundance. / You meet a servant who disobeyed Allah through wealth... But you never met a servant who disobeyed Allah through poverty.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 14
  },
  {
    "serial_number": "4940867",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 18,
    "volume_number": 1,
    "text": "Shortening Hope. Know that shortening hope while loving the world is impossible, and waiting for death while being engrossed in it is not feasible. If [the heart] is filled with something, there is no place for something else in it. Also because the world and the Hereafter are like two co-wives; if you please one, you anger the other. And like the East and the West; however much you approach one, you distance yourself from the other. Allah Almighty said: (Whoever should desire the immediate - We hasten for him from it what We will to whom We intend. Then We have made for him Hell, which he will [enter to] burn, censured and banished.) And Allah Almighty said: (So let not the worldly life deceive you and let not the Deceiver deceive you about Allah.) The Messenger of Allah, peace and blessings be upon him, said: 'Indeed, the world is sweet and green, and indeed Allah is making you successors in it, so He looks at how you act. So fear the world and fear women, for the first trial of the Children of Israel was women.' And the Prophet, peace and blessings be upon him, said: 'Two hungry wolves sent into a sheep pen are not more corrupting to it than a man's greed for wealth and honor is to his religion.' On the authority of Abu Sa'id Al-Khudri, may Allah be pleased with him, he said: The Messenger of Allah, peace and blessings be upon him, said: 'Indeed, what I fear most for you after me is what will be opened for you of the bloom of the world and its adornment.' A man said: 'O Messenger of Allah, does good bring evil?' The Prophet remained silent until we thought that revelation was descending upon him. Then he wiped the sweat from his brow and said: 'Where is the questioner?' As if he praised him. And he said: 'Indeed, good does not bring evil. But indeed, of what the spring grows, some kills or sickens (causes indigestion). Except for the animal that eats vegetation; it eats until its flanks are stretched, then it faces the sun, defecates and urinates, then returns and eats. Indeed, this wealth is green and sweet. So whoever takes it by its right and places it in its right, then what an excellent aid it is. And whoever takes it without its right is like the one who eats and is not satisfied, and it will be a witness against him on the Day of Resurrection.' He means the example of abundant wealth is like the example of what",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 15
  },
  {
    "serial_number": "4940868",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 19,
    "volume_number": 1,
    "text": "grows in the spring season. Some plants are sweet in the mouth of the animal, and it is greedy to eat them, but perhaps it eats too much, so it gets a disease from overeating and dies from that disease or comes close to dying. But if the animal eats only what its stomach can bear, eats and then stops eating until what it ate is digested and until it urinates and defecates, getting relief from the exit of dung and urine, then the eating does not harm it. Likewise, he who acquires much wealth; greed for wealth, excessive eating, drinking, and beautification harden his heart, make his soul arrogant, and he sees himself as better than others. He despises people and harms them, and does not discharge the rights of the wealth such as Zakat, performing expiations and vows, feeding beggars and guests, and the rights of the neighbor. Whoever fits this description, there is no doubt that wealth is evil for him, distances him from Paradise, and brings him closer to the Fire. But whoever fulfills the rights of wealth, does not despise people, does not boast over them, and does not occupy himself with gathering wealth such that he misses obedience, and does good to people, then his wealth is good for him, as he, peace be upon him, said: 'Excellent is the righteous wealth for the righteous man.' If you know this, you know that good and evil do not come to a man from the wealth itself, but rather the soul of the man is what directs the wealth into what is good for him or evil for him. This was said by Al-Mazhari. The Prophet, peace and blessings be upon him, said: 'Every nation has a trial, and the trial of my nation is wealth.' And he, peace be upon him, said: 'Allah Almighty says: O Son of Adam, free yourself for My worship, I will fill your chest with richness and close your poverty. And if you do not do so, I will fill your hands with busyness and will not close your poverty.' It is narrated that Rabi'a Al-Adawiyya, may Allah be pleased with her, used to say: 'Every day has a night, and this is my night in which I might die,' so she would not sleep until morning. And she would say to the day likewise, so she would not sleep until evening. Abu Bakr bin Ayyash said: 'I have completed the Quran in this corner eighteen thousand times.' Ibn Al-Mu'tamir fasted for forty years and stood its nights in prayer. Sulaiman Al-Taimi did not rest his side for twenty years. Abdul Qadir Al-Jilani, may Allah have mercy on him, prayed the Fajr prayer with the ablution of Isha for forty years. Al-Ghazali committed himself to seclusion and the duties of his time in acts of good, such that not a moment passed except in obedience—recitation, teaching, looking into Hadith, especially Al-Bukhari, and perpetual fasting and night prayer and sitting with the people of hearts, until",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 16
  },
  {
    "serial_number": "4940869",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 20,
    "volume_number": 1,
    "text": "he moved to the mercy of Allah Almighty. Al-Nawawi, may Allah have mercy on him, did not rest his side on the ground for about two years, and he would not waste any time in night or day except in the duty of engaging with knowledge, even while walking in the road coming and going, he would engage in repetition and study. Their stories in rushing towards good deeds are many; what we mentioned suffices for those whom Allah guides. All of that is the result of shortening hope. Know that what helps you to remember death is to remember those who passed away from your relatives, brothers, companions, and peers who passed before you. They used to be as greedy as you, strive as you strive, and work in the world as you work. Then death broke their necks, tore out their roots, snapped their backbones, and bereaved their loved ones of them. They were singled out in their desolate graves and became terrifying corpses. The eyes flowed away, the colors changed, the eloquence vanished, and the heads altered and tilted. With a trial that seats them and questions them about what they used to believe. Then their seat in Paradise or Hell is revealed to them until the Day they are resurrected. They see a changed earth, a split sky, a wound-up sun, falling stars, descending angels, terrifying horrors, spread-out pages, a roaring fire, and a decorated Paradise. So count yourself among them. Do not neglect the provision for your return, and do not leave yourself aimless like cattle grazing without knowing. (Leave them to eat and enjoy, and let them be diverted by [false] hope, for they are going to know.) (When the shackles are around their necks and the chains; they will be dragged. In boiling water; then in the Fire they will be filled [with flame].) O builder of the great palace... Between the villages and the castles. / And strip the army that... Filled the plain and the chests. / And conqueror of the land that... Exhausted (others) over the passage of time. / Have you not finished? Do not leave... Building your grave among the graves.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 17
  },
  {
    "serial_number": "4940870",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 21,
    "volume_number": 1,
    "text": "Look at him, you will see how... To you, obstructing, he points. / And remember your sleep in its midst... Under the stones and rocks. / Those armies have been scattered... And those matters have changed. / You have exchanged the fine silk... For the roughness of the large stone. / And left held hostage by it... No wealth, woe to you, nor kin. / Confused, declaring sorrow... Regretful, calling out for destruction. / And you were called by your name after... You used to be called the Prince.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 18
  },
  {
    "serial_number": "4940871",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 22,
    "volume_number": 1,
    "text": "Agonies of Death (Sakrat al-Mawt). Allah Almighty said: (Every soul will taste death, and you will only be given your [full] compensation on the Day of Resurrection. So he who is drawn away from the Fire and admitted to Paradise has attained [his desire]. And what is the life of this world except the enjoyment of delusion.) And He Almighty said: (And the intoxication of death will bring the truth; that is what you were trying to avoid.) Al-Bukhari narrated in his Sahih that Aisha, may Allah be pleased with her, said: 'The Messenger of Allah, peace and blessings be upon him, had a small vessel of water before him. He started dipping his hands in the water and wiping his face with them, saying: There is no god but Allah, indeed death has agonies. Then he raised his hands and started saying: To the Highest Companion, until he passed away.' And in his Sahih: 'When the Prophet, peace and blessings be upon him, became heavy (with illness), distress began to overwhelm him. Fatima, may Allah be pleased with her, started saying: O the distress of my father! He, peace and blessings be upon him, said: There is no distress upon your father after today.' It is narrated that the Prophet, peace and blessings be upon him, entered upon a sick man and said: 'I know what he is encountering. There is not a vein except that it feels pain from death to its utmost intensity.' It is narrated from Makhul from the Prophet, peace and blessings be upon him, that he said: 'If a hair from the hairs of the deceased were placed upon the inhabitants of the heavens and the earth, they would die by the permission of Allah Almighty.' Omar bin Al-Khattab, may Allah be pleased with him, said: 'O Ka'b, tell us about death.' He said: 'Yes, O Commander of the Faithful. It is like a branch with many thorns introduced into the interior of a man, so every thorn hooks onto a vein. Then a man pulls it with a violent pull, taking what he takes and leaving what he leaves.' Ali, may Allah be pleased with him, used to encourage fighting in the way of Allah and say: 'If you are not killed, you will die. By the One in whose hand is the soul of Muhammad, a thousand strikes with the sword are easier than death on a bed.' Shaddad bin Aws said: 'Death is the most terrible horror in this world and the Hereafter for the believer. It is more severe than being sawed with saws, cut with scissors, and boiled in pots. If the dead were resurrected and informed the people of the world about the pain of death, they would not benefit from life nor find pleasure in sleep.' It is narrated that Abraham, peace and blessings of Allah be upon him, when he died, Allah Almighty said to him: 'How did you find death?' He said: 'Like a skewer placed in wet wool then pulled.' He said:",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 19
  },
  {
    "serial_number": "4940872",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 23,
    "volume_number": 1,
    "text": "'Indeed, We made it easy for you.' And from Moses, peace and blessings of Allah be upon him, that when his soul went to Allah Almighty, He said to him: 'O Moses, how did you find death?' He said: 'I found myself like a live sheep being skinned by the hand of the butcher.' Abu Bakr bin Abi Shaybah mentioned from Jabir, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, that he said: 'Narrate about the Children of Israel and there is no harm, for among them were wonders.' Then he began to narrate, saying: 'A group went out and came to a cemetery of theirs. They said: If we prayed two rak'ahs and supplicated to Allah to bring out for us some of the dead to inform us about death. He said: So they did. While they were like that, a man poked his head out of a grave, with the trace of prostration between his eyes. He said: O you people, what did you want with me? By Allah, I died one hundred years ago, yet the heat of death has not subsided from me until now. So pray to Allah to return me as I was.' Amru bin Al-Aas, may Allah be pleased with him, used to say: 'I wish I could see a wise, intelligent man whom death has descended upon, so he could inform me about death.' When death descended upon him, it was said to him: 'O Abu Abdullah, you used to say in the days of your life, I wish I could see a wise, intelligent man whom death has descended upon to inform me about death. You are that wise, intelligent man, and death has descended upon you, so inform us about it.' He said: 'I find it as if the heavens have collapsed upon the earth and I am between them, and as if my soul is exiting through the eye of a needle.' It is narrated that Ibrahim the Friend (Khalil) said to the Angel of Death: 'Can you show me the form in which you take the soul of the wicked?' He said: 'Can you bear that?' He said: 'Yes.' So he turned away, then looked, and behold, he was a man in black clothes, with dark hair, foul-smelling, with flames of fire and smoke coming out of his mouth and nostrils. Ibrahim fainted, then woke up, and the Angel of Death had returned to his first form. He said: 'O Angel of Death, if the wicked person met nothing but the image of your face, that would be sufficient for him.' It is narrated from Aslam, the freed slave of Omar bin Al-Khattab, may Allah be pleased with them both, that he said: 'If there remains upon",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 20
  },
  {
    "serial_number": "4940873",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 24,
    "volume_number": 1,
    "text": "the believer anything of his sins that his deeds did not cover, death is made severe upon him so that he may reach his rank in Paradise through the agonies and severity of death. And indeed, if the disbeliever had good deeds known in the world, death is made easy for him so that he may complete the reward of his good deeds in the world, then he proceeds to the Fire.' Al-Bukhari narrated that Omar bin Al-Khattab, may Allah be pleased with him, said: 'If I had the earth's fill of gold, I would ransom myself with it from before I see him (the Angel of Death or the punishment).' It was said: The son of Adam has not encountered anything more severe than death, and what is after it is more severe than it. In Al-Waseet by Al-Wahidi, with his chain of transmission from Ibn Abbas, he said: The Messenger of Allah, peace and blessings be upon him, said: 'Illnesses and pains are all messengers of death and envoys of death. So when the appointed time comes, the Angel of Death comes himself and says: O servant, how many reports after reports, and how many messengers after messengers, and how many envoys after envoys? I am the report after which there is no report, and I am the messenger after whom there is no messenger. Answer your Lord, willingly or unwillingly. When he seizes his soul and they scream over him, he says: Over whom do you scream and over whom do you weep? By Allah, I did not wrong his lifespan, nor did I eat his provision. Rather, his Lord called him. So let the weeper weep for himself, for I have repeated returns among you, and returns until I do not leave a single one of you.' From Anas bin Malik, he said: 'Gabriel met the Angel of Death at a river in Persia. He said: O Angel of Death, how can you seize souls during a plague? Here are ten thousand and here are such and such. The Angel of Death said: The earth is folded for me until they are as if between my thighs, so I pick them up with my hand.' Know that if we were waiting for the blow of a policeman, our life would be distressed. Yet in every breath, the arrival of death with its hardships is possible, and it is more bitter than being struck by swords and sawed by saws. He wishes he could scream and groan. His soul is pulled from every muscle and vein; his feet grow cold, then his thighs, and so on until it reaches the throat. At that point, his sight of his world is cut off and the door of his repentance is closed to him. The Messenger of Allah, peace and blessings be upon him, said: 'Indeed Allah Almighty accepts the repentance of His servant as long as he does not gargle (the death rattle).' O group of loved ones, I must leave you... O abode of the world, I am departing from you. / O shortness of days, what do I have to do with hopes... O agonies of death, what do I have to do with laughter. / Why do I not weep for myself with a tear... If I do not weep for myself, who will weep? / Lo, which living person is not certain of death... And which certainty is more like doubt today?",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 21
  },
  {
    "serial_number": "4940874",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 25,
    "volume_number": 1,
    "text": "O group of loved ones, I must leave you... O abode of the world, I am departing from you. / O shortness of days, what do I have to do with hopes... O agonies of death, what do I have to do with laughter. / Why do I not weep for myself with a tear... If I do not weep for myself, who will weep? / Lo, which living person is not certain of death... And which certainty is more like doubt today?",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 22
  },
  {
    "serial_number": "4940875",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 26,
    "volume_number": 1,
    "text": "Punishment of the Grave for Disbelievers and Some Disobedient Believers. Allah, Glorious and Exalted, said: (The Fire, they are exposed to it morning and evening. And the Day the Hour appears [it will be said], 'Make the people of Pharaoh enter the severest punishment.') In the book of Tirmidhi, Uthman bin Affan, may Allah be pleased with him, when he stood over a grave, would weep until he wet his beard. It was said to him: 'You remember Paradise and Hell and do not weep, but you weep from this?' He said: 'I heard the Messenger of Allah, peace and blessings be upon him, say: The grave is the first stage of the stages of the Hereafter; if its companion is saved from it, then what comes after it is easier than it. And if he is not saved from it, then what comes after it is more severe than it.' And I heard the Messenger of Allah, peace and blessings be upon him, say: 'I have never seen a sight except that the grave is more horrible than it.' In the books of Abu Dawood and Al-Nasa'i, on the authority of Al-Bara' bin Azib, from the Messenger of Allah, peace and blessings be upon him, he said: 'Two angels come to him and make him sit up. They say to him: Who is your Lord? He says: My Lord is Allah. They say to him: What is your religion? He says: My religion is Islam. They say to him: What is this man who was sent among you? He says: He is the Messenger of Allah, peace and blessings be upon him. They say: And how do you know? He says: I read the Book of Allah and believed in it and verified it. That is His saying: (Allah keeps firm those who believe, with the firm word, in worldly life and in the Hereafter.) He said: Then a caller calls from the sky: My servant has spoken the truth, so furnish him from Paradise, clothe him from Paradise, and open for him a door to Paradise. So its breeze and fragrance come to him, and it is expanded for him therein as far as his eye can see. As for the disbeliever,' he mentioned his death and said: 'His soul is returned to his body, and two angels come to him and make him sit up. They say: Who is your Lord? He says: Hah, hah, I do not know. They say: What is your religion? He says: Hah, hah, I do not know. They say: What is this man who was sent among you? He says: Hah, hah, I do not know. Then a caller calls from the sky: He has lied, so furnish him from the Fire, clothe him from the Fire, and open for him a door to the Fire. He said: So its heat and scorching wind come to him. He said: And his grave narrows upon him until his ribs interlock.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 23
  },
  {
    "serial_number": "4940876",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 27,
    "volume_number": 1,
    "text": "Then a blind, deaf (being) is appointed over him with an iron sledgehammer; if he were to strike a mountain with it, it would become dust. He strikes him with it a blow that everything between the East and the West hears, except the two weighty ones (Jinn and Humans), and he becomes dust, then the soul is returned to him. In the book of Tirmidhi, from Abu Sa'id Al-Khudri, he said: The Messenger of Allah, peace and blessings be upon him, entered for prayer and saw people looking as if they were grinning (or talking excessively). He said: 'Behold, if you frequently remembered the destroyer of pleasures, it would distract you from what I see. So frequently remember the destroyer of pleasures: death. For indeed, the grave does not pass a day without saying: I am the house of alienation, I am the house of solitude, I am the house of dust, and I am the house of worms. When the believing servant is buried, the grave says to him: Welcome and greetings. Indeed, you were among the most beloved of those who walked upon my back to me. So since I have been given charge of you and you have come to me, you will see my treatment of you. He said: So it expands for him as far as his eye can see, and a door from Paradise is opened for him. And when the wicked or disbelieving servant is buried, the grave says to him: No welcome and no greetings. Indeed, you were among the most hated of those who walked upon my back to me. So since I have been given charge of you today and you have come to me, you will see my treatment of you. He said: So it closes in on him until it meets and his ribs interlock.' He said: The Messenger of Allah, peace and blessings be upon him, gestured with his fingers, interlacing them. He said: 'And seventy dragons are appointed over him; if one of them were to breathe on the earth, it would not grow anything as long as the world remained. They bite him and scratch him until he is brought to the Reckoning.' He said: The Messenger of Allah, peace and blessings be upon him, said: 'The grave is either a garden from the gardens of Paradise or a pit from the pits of Hell.' It is narrated that a man entered upon Omar bin Abdul Aziz, may Allah be pleased with him, and saw that his color had changed from excessive worship. He began to marvel at the change in his color and the transformation of his appearance. Omar said to him: 'O son of my brother, what marvels you about me? How (would you be) if you saw me three days after entering my grave, when the pupils have popped out and flowed onto the cheeks, the lips have shrunk away from the teeth, pus and worms have come out of the nostrils and mouth, the belly has swollen and risen above the chest, and the rear has exited from the loins? You would see then something more amazing than what you see now.' Bakr the Worshipper used to say to his mother: 'O mother, I wish you had been barren of me. Indeed, your son has a long imprisonment in the grave, and after that, a departure.'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 24
  },
  {
    "serial_number": "4940877",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 28,
    "volume_number": 1,
    "text": "Hatim al-Asam said: 'Whoever passes by the courtyard of the graves and does not think about himself and does not pray for them has betrayed himself and betrayed them.' Al-Qushayri said: I heard Abu Ali Al-Daqqaq say: 'I entered upon Imam Abu Bakr bin Furak to visit him (when sick). When he saw me, his eyes teared up. So I said to him: Indeed, Allah will heal you and cure you. He said to me: Do you think I fear death? I only fear what is beyond death.' And I heard some of the poor (Sufis) say that the cause of Dawood bin Nasr Al-Ta'i's asceticism was that he heard a mourning woman wailing: 'With which of your cheeks will you show the decay? And which of your eyes (will go first) when they flow?' How strange! If a doctor described your disease and your medicine to you, you would listen to him and obey him. Yet this is the medicine for your great, buried disease which causes its owner to burn in the Fire of Hell, but you do not listen to it with true listening. Perhaps if the gathering is long, you doze off or speak, even though speaking (during the sermon) is condemned. If you were in amusement or a worldly matter, you would not doze off but would be lively for it. That is only due to the wickedness of your inner self and the weakness of your faith. Where are your fathers, and where are your brothers and loved ones? They have inhabited the bellies of the earth and become food for insects, unable to ward off the punishment they encounter: It is time, so be patient; there is no blaming time... We have no escape from the plan of death. / The cup of death is a necessity... And who is the one who will not drink from its cup? / A wise man does not build up the lowly world... If the builder of life in it is destroyed. / Indeed Ali condemned it in his speech... And divorced it, while the deceived ignoramus proposes to it. / When the jug was brought while people were present... He said to them: O men, marvel! / Indeed, in this jug there are admonitions... For the one who takes heed, who fears the darkness of the grave. / How many a mouth and kohl-lined eye are in it... And smooth cheek that was loved and sought. / And how many of great stature whose bones became... A vessel, and from it, water, O people, is drunk.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 25
  },
  {
    "serial_number": "4940878",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 29,
    "volume_number": 1,
    "text": "And transferred from one land to another as a gift... So how strange, after decay, to be exiled. O Allah, reform us, reform the corruption of our hearts, reform the corruption of our deeds, reform the corruption of those in charge of our affairs, and reform us with what You reformed Your righteous servants.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 26
  },
  {
    "serial_number": "4940879",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 30,
    "volume_number": 1,
    "text": "Conditions of the Dead. Ibn Abbas, may Allah be pleased with them both, said: 'The Prophet, peace and blessings be upon him, passed by two graves and said: They are being punished, and they are not being punished for something major. As for one of them, he did not shield himself from urine. As for the other, he used to walk about with gossip (Namimah). Then he took a fresh palm branch, split it in two, and planted one on each grave. He said: Perhaps it will be lightened for them as long as they do not dry up.' Some of the dead were seen in a dream and asked: 'How was your condition?' He said: 'I prayed one day without ablution, so a wolf was appointed over me to terrify me in my grave, so my condition with him is the worst condition.' Another was seen in sleep and asked: 'What did Allah do with you?' He said: 'Leave me, for I was unable to perform Ghusl (ritual bath) for Janabah one day, so Allah clothed me in a garment of fire in which I turn over night and day.' Jesus, son of Mary, peace be upon him, passed by a cemetery and called a man from them. Allah brought him to life. He said: 'Who are you?' He said: 'I was a porter transporting people. I transported firewood for a person one day and broke a toothpick from it and used it. I have been held accountable for it since I died.' Sufyan Al-Thawri was seen in a dream with two wings flying in Paradise from tree to tree. He was asked: 'By what did you attain this?' He said: 'By Wara' (piety/caution).' Hassan bin Abi Sinan stood over the companions of Al-Hasan and said: 'Which thing is hardest for you?' They said: 'Wara'.' He said: 'Nothing is lighter for me than it.' They said: 'How so?' He said: 'I have not quenched my thirst from your river for forty years.' Hassan bin Abi Sinan did not sleep lying down, nor eat fatty food, nor drink cold water for sixty years. He was seen in a dream after he died and was asked: 'What did Allah do with you?' He said: 'Good, except that I am withheld from Paradise because of a needle I borrowed and did not return.' Abdul Wahid bin Zaid had a boy who served him for years and worshipped his Lord for forty years. In the beginning, he was a measurer (of grain). When he died, he was seen in a dream and asked: 'What did Allah do with you?' He said: 'Good, except that I am withheld from Paradise because forty Qafiz (a measure) of dust from the Qafiz (measuring cup) accumulated against me.' It is narrated that a man came to the graves, prayed two Rak'ahs, then lay down on his side and slept.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 27
  },
  {
    "serial_number": "4940880",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 31,
    "volume_number": 1,
    "text": "He saw the occupant of the grave in a dream saying: 'This is it. You work but do not know, and we know but do not work. For two Rak'ahs to be in my record is more beloved to me than the world and what is in it.' Some of the righteous said: 'A brother in Allah of mine died, so I saw him in sleep. I said to him: O so-and-so, you lived, praise be to Allah, Lord of the Worlds. He said to me: Being able to say it—meaning Praise be to Allah, Lord of the Worlds—is more beloved to me than the world and what is in it. Then he said: Did you not see where they were burying me? Indeed, so-and-so came and prayed two Rak'ahs. To be able to pray them is more beloved to me than the world and what is in it.' Abu Sabra mentioned that Munkar and Nakir came to a man in his grave and said: 'We are going to strike you one hundred times.' The dead man said: 'I was such-and-such (righteous),' and he interceded with some of his good deeds until they reduced it by ten. He kept interceding until they reduced it all except one strike. So they struck him one blow, and the grave flared up in fire upon him. He said: 'Why did you strike me?' They said: 'You passed by an oppressed person who sought your help, but you did not help him.' Abdullah bin Umar and a group of his family said: 'We used to pray to Allah Almighty to show us Omar in a dream. I saw him in a dream after twelve years as if he had bathed and was wrapped in a waist wrapper. I said: O Commander of the Faithful, how did you find your Lord and with which of your good deeds did He reward you? He said: O Abdullah, how long has it been since I left you? I said: Twelve years. He said: Since I left you, I was in the Reckoning, and I feared I would perish, except that Allah is Forgiving, Merciful, Generous, and Kind.' This was the condition of Omar, and he possessed nothing of the means of governance in his world except a whip. It is narrated that Abu Shahma, the son of Omar bin Al-Khattab, may Allah be pleased with him, committed fornication, so he lashed him one hundred lashes and he died. Forty days later, Hudhayfah bin Al-Yaman said: 'I saw the Messenger of Allah, peace and blessings be upon him, in a dream, and the youth was with him wearing two green garments. The Messenger of Allah, peace and blessings be upon him, said: Convey my greetings to Omar and tell him: Thus do I order you to read the Quran and establish the limits (Hudud). The boy said: O Hudhayfah, convey my greetings to my father and tell him: Allah purified you as you purified me, and peace.' It is narrated from Abu Bakr bin Abi Al-Dunya from his companions that he said to a grave robber after his repentance: 'What is the cause of your repentance and return to Allah?' He said: 'I dug up a person and found him nailed with nails in all his body, and a large nail in his head and another in his feet.' Another said: 'What is the cause of your repentance?' He said: 'I saw the skull of a human into which lead had been poured.'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 28
  },
  {
    "serial_number": "4940881",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 32,
    "volume_number": 1,
    "text": "It is narrated that some grave robbers dug up a grave one night. When they uncovered the deceased, behold, a fire was burning the deceased. A spark from it flew towards him, so he fled and repented to Allah Almighty. It was said that Al-Awza'i was seen in a dream and said: 'I have not seen a rank here higher than the rank of the scholars, then the sorrowful ones.' Abu Abdullah Al-Naddad was seen in a dream and asked: 'What did Allah do with you?' He said: 'He made me stand and forgave me every sin I confessed to in the world except one I was shy to confess. So He made me stand in sweat until the flesh of my face fell off.' He was asked: 'What was that?' He said: 'I looked at a beautiful person and was shy to mention it.' It is narrated from Hashim bin Hassan that he said: 'A young son of mine died. I saw him in sleep and his hair was grey. I said: O my son, what is this grey hair? He said: When so-and-so came to us, Hell exhaled a sigh at his arrival; not one of us remained but turned grey.' It was said that when Kurz bin Wabrah died, he was seen in a dream as if the people of the graves came out of their graves wearing new white clothes. It was said: 'What is this?' They said: 'The people of the graves were clothed in new garments for the arrival of Kurz among them.' It is narrated that one of the righteous said: 'I had a son who was martyred. I did not see him in a dream until the night Omar bin Abdul Aziz, may Allah be pleased with him, died. He appeared to me that night. I said: O my son, were you not dead? He said: No, but I was martyred, and I am alive with Allah Almighty, being provided for. I said: What brought you? He said: It was announced among the people of the heavens that no prophet, truthful one (Siddiq), or martyr should remain without attending the prayer for Omar bin Abdul Aziz. So I came to witness the prayer, then I came to you to greet you.' It is narrated that Abdul Wahid bin Abdul Majid Al-Thaqafi said: 'I saw a funeral carried by three men and a woman. I took the place of the woman and we went to the cemetery, prayed over it, and buried it. I said to the woman: Who was this to you? She said: My son. I said: Did you not have neighbors? She said: Yes, but they belittled his affair. I said: And what was this? She said: He was a Mukhannath (effeminate man). He said: So I had mercy on her",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 29
  },
  {
    "serial_number": "4940882",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 33,
    "volume_number": 1,
    "text": "and took her to my house and gave her Dirhams, wheat, and clothes. I slept that night and saw as if someone came to me looking like the moon on the night of the full moon, wearing white clothes. He began to thank me. I said: Who are you? He said: I am the Mukhannath whom you buried today; my Lord had mercy on me due to the people's contempt for me. Provide for yourself, O brother, with piety. Whoever knows what is before him does not prefer desire. Whoever reflects on the departure of those who were with him becomes certain of the departure himself. How many deceived by their youth and healthy state did death snatch from their midst? How many inclining to gather their wealth left it as inheritance and passed on with their burdens? Did death show mercy to a sick person for the weakness of his limbs? Did it leave a provider for the sake of his children? The events have informed you of their descent... And called out to you, except that your hearing has deafness. / You wail and weep for loved ones if they pass... But your soul does not weep while you are on the trail. O Allah, have mercy on us and do not punish us, grant us victory and do not forsake us, heal us and do not sicken us, honor us and do not humiliate us, prefer us and do not prefer others over us. Indeed, You are over all things competent.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 30
  },
  {
    "serial_number": "4940883",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 34,
    "volume_number": 1,
    "text": "Signs of the Hour and its Conditions. Allah Almighty said: ([The time of] their account has approached for the people, while they are in heedlessness turning away. No mention comes to them from their Lord [that is] new except that they listen to it while they are at play. With their hearts distracted.) The two Sheikhs (Bukhari and Muslim) narrated that the Messenger of Allah, peace and blessings be upon him, said: 'Indeed, among the signs of the Hour is that knowledge will be lifted, ignorance will increase, fornication will increase, wine drinking will increase, men will decrease, and women will increase until there will be one guardian for fifty women.' It is narrated from Abu Huraira, may Allah be pleased with him, that he said: The Messenger of Allah, peace and blessings be upon him, said: 'When spoils of war are taken as personal wealth, trust is taken as booty, Zakat is taken as a fine, learning is for other than the religion of Allah, a man obeys his wife and disobeys his mother, brings his friend near and drives his father away, voices are raised in the mosques, the sinner of the tribe becomes their chief, the leader of the people is the vilest of them, a man is honored for fear of his evil, singing girls and musical instruments appear, wines are drunk, and the last of this nation curses the first of it; then watch for a red wind, an earthquake, a landslide, transformation, and signs following one another like the beads of a cut necklace following one another.' From Abu Sa'id Al-Khudri, may Allah be pleased with him, he said: The Messenger of Allah, peace and blessings be upon him, mentioned a trial that will afflict this nation until a man cannot find a refuge to seek shelter from oppression. Then Allah will send a man from my lineage and my family who will fill the earth with equity and justice as it was filled with tyranny and oppression. The inhabitants of the heaven and the inhabitants of the earth will be pleased with him. The sky will not leave any of its rain but pour it abundantly, and the earth will not leave any of its vegetation but bring it forth, until the living will wish for the dead. He will live in that for seven years, or eight years, or nine years. In Sahih Muslim, from Hudhayfah bin Asid Al-Ghifari, he said: The Prophet, peace and blessings be upon him, looked out upon us while we were discussing. He said: 'What are you discussing?' They said: We are mentioning the Hour. He said: 'Indeed, it will not be established until'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 31
  },
  {
    "serial_number": "4940884",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 35,
    "volume_number": 1,
    "text": "you see ten signs before it.' He mentioned the Smoke, the Dajjal (Antichrist), the Beast, the rising of the sun from its west, the descent of Jesus son of Mary, Gog and Magog, and three landslides: a landslide in the East, a landslide in the West, and a landslide in the Arabian Peninsula. And the last of that is a fire emerging from Yemen driving the people to their gathering place.' In Sahih Muslim, he said: 'Three things, if they emerge, no soul will benefit from its faith if it had not believed before: The rising of the sun from its west, the Dajjal, and the Beast of the Earth.' There is difference of opinion regarding the first of the signs. It was said the first is the rising of the sun from its west and the emergence of the Beast. It came in the narration of Ibn Abi Shaybah from Abdullah bin Umar, may Allah be pleased with them both, from the Prophet, peace and blessings be upon him, that he said: 'Whichever of the two comes before its companion, the other is right on its trail.' The Beast of the Earth is sixty cubits tall, having legs and fur. It is said it has a mixed creation resembling several animals. Mount Safa will crack open and it will emerge from it on the night of Jam' (gathering at Muzdalifah) while people are descending to Mina. It is said it will emerge from the land of Ta'if. With it are the Staff of Moses and the Ring of Solomon, peace be upon them. No seeker can catch it, and no fleer can escape it. It strikes the believer with the Staff, marking his face as 'Believer', and stamps the disbeliever with the Ring, marking his face as 'Disbeliever'. In Sahih Muslim, from Al-Nawas bin Sam'an, he said: The Messenger of Allah, peace and blessings be upon him, mentioned the Dajjal and said: 'If he emerges while I am among you, I will argue with him on your behalf. And if he emerges and I am not among you, then every man must argue for himself, and Allah is my Successor over every Muslim. He is a young man with curly hair, his eye is floating (blind/defective). I liken him to Abdul Uzza bin Qatan. Whoever among you encounters him, let him read the opening verses of Surah Al-Kahf over him, for they are your protection from his trial. He will emerge on a road between the Levant (Sham) and Iraq. He will spread corruption to the right and corruption to the left. O servants of Allah, stand firm.' We said: O Messenger of Allah, how long will he stay on earth? He said: 'Forty days: a day like a year, a day like a month, a day like a week, and the rest of his days like your days.' We said: For that day which is like a year, will the prayer of one day suffice us? He said: 'No, estimate for it its measure.' We said: O Messenger of Allah, and what is'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 32
  },
  {
    "serial_number": "4940885",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 36,
    "volume_number": 1,
    "text": "his speed in the earth? He said: 'Like the rain driven by the wind. He will come to a people and invite them, and they will believe in him. He will command the sky and it will rain, and the earth and it will grow vegetation. Their livestock will return to them in the evening with the highest humps, the fullest udders, and the widest flanks. Then he will come to a people and invite them, and they will reject his word. He will turn away from them, and they will become drought-stricken, having nothing of their wealth in their hands. He will pass by a ruin and say to it: Bring out your treasures. And its treasures will follow him like drones of bees. Then he will call a man brimming with youth, strike him with the sword, and cut him into two pieces like a shot target. Then he will call him, and he will come forward, his face beaming and laughing. While he is like that, Allah will send the Messiah, son of Mary. He will descend at the white minaret east of Damascus between two yellow garments, placing his hands on the wings of two angels. If he lowers his head, it drips, and if he raises it, drops like pearls descend from it. No disbeliever will find the scent of his breath except that he will die, and his breath reaches as far as his eye can see. He will seek him (Dajjal) until he catches him at the gate of Lod and kills him. Then a people whom Allah has protected from him will come to Jesus, and he will wipe their faces and tell them of their ranks in Paradise. While he is like that, Allah will reveal to Jesus: I have brought out servants of Mine against whom no one has the power to fight, so take My servants safely to Al-Tur (the Mount). Allah will send Gog and Magog, and they will swarm down from every mound. The first of them will pass by the Lake of Tiberias and drink what is in it, and the last of them will pass and say: There was once water here. Then they will march until they reach the Mountain of Khamr, which is the mountain of Bayt al-Maqdis (Jerusalem). They will say: We have killed those on earth, come let us kill those in the sky. So they will throw their arrows towards the sky, and Allah will return their arrows to them dyed with blood. The Prophet of Allah and his companions will be besieged until the head of a bull for one of them is better than a hundred dinars for one of you today. The Prophet of Allah Jesus and his companions will beseech Allah, so Allah will send upon them (Gog and Magog) worms (Naghaf) in their necks, and they will become corpses like the death of a single soul. Then the Prophet of Allah and his companions will descend to the earth, but they will not find a place of a hand span on earth except that their fat and stench has filled it.' It is narrated 'zahmahum' with a Damma on the Zay and Fatha on the Ha, meaning a stench. 'And their stink. So the Prophet of Allah Jesus and his companions will beseech Allah, and Allah will send birds like the necks of Bactrian camels. They will carry them and throw them where Allah wills.' It is narrated 'tatrahuhum' (throw them) into the Nahil (sea/valley). 'And the Muslims will use their bows, arrows, and quivers as firewood for seven years. Then Allah will send a rain from which no",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 33
  },
  {
    "serial_number": "4940886",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 37,
    "volume_number": 1,
    "text": "mud-brick house or tent will shelter. It will wash the earth until it leaves it like a mirror. Then it will be said to the earth: Grow your fruits and return your blessings. On that day, a group will eat from a pomegranate and seek shade under its skin. Milk will be blessed such that a milch-camel will suffice a large group of people, a milch-cow will suffice a tribe of people, and a milch-sheep will suffice a clan of people. While they are like that, Allah will send a pleasant wind that will seize them under their armpits and take the soul of every believer and every Muslim. The worst of people will remain, copulating in public like donkeys, and upon them the Hour will be established.' Some recited: Represent to your heart, O deceived one... The Day of Resurrection and the sky shaking. / The sun of the day has been wound up and multiplied... In heat upon the heads of servants, boiling. / And when the mountains are uprooted from their foundations... And you see them moving like clouds. / And when the pregnant camels are neglected by their owners... The homes are empty, no deceived one is in them. / And when the stars fall and scatter... And change after light to darkness. / And when the wild beasts are gathered after Resurrection... And say to the angels: Where do we go? / It is said: Go, witness scandals... And wonders that have been brought and matters. / And when the fetus clings to its mother... Fearful of the Account, and his heart is terrified. / This is without sin, he fears its horror... How then the one remaining in sins for ages?",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 34
  },
  {
    "serial_number": "4940887",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 38,
    "volume_number": 1,
    "text": "The Blowing of the Horn. Allah Almighty said: (And the Horn will be blown, and whoever is in the heavens and whoever is on the earth will fall dead except whom Allah wills. Then it will be blown again, and at once they will be standing, looking on. And the earth will shine with the light of its Lord, and the record [of deeds] will be placed, and the prophets and the witnesses will be brought, and it will be judged between them in truth, and they will not be wronged. And every soul will be fully compensated [for] what it did; and He is most knowing of what they do. And those who disbelieved will be driven to Hell in groups until, when they reach it, its gates are opened and its keepers will say, 'Did there not come to you messengers from yourselves, reciting to you the verses of your Lord and warning you of the meeting of this Day of yours?' They will say, 'Yes, but the word of punishment has come into effect upon the disbelievers.' It will be said, 'Enter the gates of Hell to abide eternally therein, and wretched is the residence of the arrogant.' And those who feared their Lord will be driven to Paradise in groups until, when they reach it while its gates have been opened and its keepers say, 'Peace be upon you; you have become pure; so enter it to abide eternally therein,' [they will enter]. And they will say, 'Praise to Allah, who has fulfilled for us His promise and made us inherit the earth [so] we may settle in Paradise wherever we will. And excellent is the reward of [righteous] workers.' And you will see the angels surrounding the Throne, exalting [Allah] with praise of their Lord. And it will be judged between them in truth, and it will be said, '[All] praise to Allah, Lord of the worlds.') In the book of Al-Nasa'i from Abu Huraira, may Allah be pleased with him, he said: The Messenger of Allah, peace and blessings be upon him, said: 'How can I be comfortable while the owner of the Horn has put the Horn in his mouth, inclined his ear, and lowered his forehead waiting for when he will be ordered to blow, so he will blow.' They said: O Messenger of Allah, what should we say? He said: 'Say: Allah is Sufficient for us and He is the Best Disposer of affairs; upon Allah we rely.' In Sahih Muslim, from Aisha, may Allah be pleased with her, she said: I heard the Messenger of Allah, peace and blessings be upon him",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 35
  },
  {
    "serial_number": "4940888",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 39,
    "volume_number": 1,
    "text": "say: 'The people will be gathered on the Day of Resurrection barefoot, naked, and uncircumcised.' I said: O Messenger of Allah, women and men together, looking at one another? He said: 'O Aisha, the matter is more severe than for them to look at one another.' In the book of Tirmidhi from Abu Huraira, may Allah be pleased with him, he said: The Messenger of Allah, peace and blessings be upon him, said: 'The people will be gathered on the Day of Resurrection in three categories: a category walking, a category riding, and a category on their faces.' It was said: O Messenger of Allah, how will they walk on their faces? He said: 'Indeed, the One who made them walk on their feet in the world is Able to make them walk on their faces. Lo, they will shield themselves with their faces from every obstacle and thorn.' In Sahih Al-Bukhari from Abu Huraira, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, he said: 'The people will be gathered on the Day of Resurrection in three categories: those hoping and fearing; and two on a camel, three on a camel, four on a camel, and ten on a camel; and the rest of them will be gathered by the Fire, taking a midday nap with them wherever they nap, staying the night with them wherever they stay the night, reaching the morning with them wherever they reach the morning, and reaching the evening with them wherever they reach the evening.' And in it, he, peace be upon him, said: 'Allah will seize the earth on the Day of Resurrection and fold the sky with His Right Hand, then He will say: I am the King, where are the kings of the earth?' And in it, he said: 'The people will be gathered on the Day of Resurrection on a reddish-white land like a loaf of pure bread.' Sahl or someone else said: 'There is no landmark for anyone in it.' And it is authentic that the Messenger of Allah, peace and blessings be upon him, said: 'The dead is resurrected in the clothes in which he died.' It was said: The meaning of clothes is deeds, but Abu Sa'id Al-Khudri interpreted it literally. In Sahih Muslim from Al-Miqdad bin Al-Aswad, he said: I heard the Messenger of Allah, peace and blessings be upon him, say: 'The sun will draw near to the creation on the Day of Resurrection until it is like the measure of a mile.' Sulaym bin Amir said: By Allah, I do not know what he means by the mile: the distance on earth or the stick (mil) used to apply kohl to the eye. He said: 'So the people will be in sweat according to their deeds. Among them are those whom it reaches to their ankles, among them are those whom it reaches to their knees, among them are those whom it reaches to their waists, and among them are those whom the sweat bridles completely.' The Messenger of Allah, peace and blessings be upon him, gestured with his hand to his mouth. In the Musnad of Abu Bakr Al-Bazzar from Jabir bin Abdullah, he said: The Messenger of Allah, peace and blessings be upon him, said: Indeed",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 36
  },
  {
    "serial_number": "4940889",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 40,
    "volume_number": 1,
    "text": "sweat will adhere to a person in the Standing Place until he says: O Lord, sending me to the Fire is easier for me than what I am experiencing—while he knows what severe punishment is in it. Some of the predecessors said: If the sun rose on the earth as it will be on the Day of Resurrection, it would burn the earth, melt the rock, and dry up the rivers. The Messenger of Allah, peace and blessings be upon him, said: 'Seven are those whom Allah Almighty will shade in His shade on the Day when there is no shade but His shade: A just Imam; a youth who grew up in the worship of Allah; a man whose heart is attached to the mosque when he leaves it until he returns to it; two men who loved each other in Allah, met upon that and separated upon that; a man who remembered Allah in solitude and his eyes overflowed; a man whom a woman of beauty and status invited (to sin) and he said: I fear Allah; and a man who gave charity and hid it so that his left hand did not know what his right hand spent.' Al-Hasan Al-Basri, may Allah have mercy on him, said: 'What is your opinion of a day in which they stood on their feet for the duration of fifty thousand years, not eating a meal in it, nor drinking a drink, until their necks were severed from thirst and their insides burned from hunger? Then they were taken to the Fire and given drink from a boiling spring—meaning extremely hot—over which Hell has been stoked since it was created.'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 37
  },
  {
    "serial_number": "4940890",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 41,
    "volume_number": 1,
    "text": "Intercession of the Prophet, peace and blessings be upon him. Allah Almighty said: (Who is it that can intercede with Him except by His permission?) In Sahih Al-Bukhari and Muslim from Abu Huraira, may Allah be pleased with him: Meat was brought to the Prophet, peace and blessings be upon him, and the foreleg was offered to him, which he used to like. He took a bite from it and then said: 'I am the master of the people on the Day of Resurrection. Do you know why that is? Allah will gather the first and the last on a single plain so that a caller can make them hear and the sight can penetrate them. The sun will draw near, and the people will reach a level of distress and grief that they cannot bear or endure. The people will say: Do you not see what has reached you? Do you not look for someone to intercede for you with your Lord? Some people will say to others: Your father Adam. So they will go to Adam and say: You are the father of mankind; Allah created you with His Hand, breathed into you from His Spirit, and commanded the angels to prostrate to you. Intercede for us with your Lord. Do you not see what we are in? Do you not see what has reached us? Adam will say: Indeed, my Lord has become angry today with an anger the likes of which He has never been angry before and will never be angry after. Indeed, He forbade me from the tree and I disobeyed Him. Myself, myself, myself. Go to someone else; go to Noah. They will go to Noah and say: You are the first of the messengers to the earth, and Allah named you a grateful servant. Do you not see what we are in? Do you not see what has reached us? Will you not intercede for us with your Lord? He will say: Indeed, my Lord has become angry today with an anger the likes of which He has never been angry before and will never be angry after. Indeed, I had a supplication which I made against my people. Myself, myself, myself. Go to someone else; go to Abraham. They will go to Abraham and say: O Abraham, you are the Prophet of Allah and His Friend (Khalil) from the people of the earth. Intercede for us with your Lord. Do you not see what we are in? He will say to them: Indeed, my Lord has become angry today with an anger the likes of which He has never been angry before and will never be angry after. Indeed, I told three lies. Myself, myself, myself. Go to someone else; go to Moses. They will go to Moses and say: O Moses, you are the Messenger of Allah; Allah favored you with His message and His speech over the people. Intercede for us with your Lord. Do you not see what we are in? He will say: Indeed, my Lord has become angry today with an anger the likes of which He has never been angry before and will never be angry after. Indeed, I killed a soul I was not commanded to kill. Myself, myself, myself. Go to someone else; go to Jesus. They will go to Jesus and say: O Jesus, you are the Messenger of Allah and His Word which He directed to Mary and a Spirit from Him. You spoke to people in the cradle. Intercede for us with your Lord. Do you not see what we are in? Jesus will say: Indeed, my Lord has become angry today with an anger the likes of which He has never been angry before and will never be angry after. He will not mention a sin. Go to Muhammad, peace and blessings be upon him.' In a narration: 'So they will come to me and say: O Muhammad, you are the Messenger of Allah and the Seal of the Prophets. Allah has forgiven you your past and future sins. Intercede for us with your Lord. Do you not see what we are",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 38
  },
  {
    "serial_number": "4940891",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 42,
    "volume_number": 1,
    "text": "in? So I will go and come under the Throne and fall prostrate for my Lord. Then Allah will open for me of His praises and the beauty of extolling Him what He has not opened for anyone before me. Then it will be said: O Muhammad, raise your head. Ask, and you will be given; intercede, and your intercession will be accepted. So I will raise my head and say: My Ummah (nation), O Lord! My Ummah, O Lord! My Ummah, O Lord! He will say: O Muhammad, admit from your nation those who have no account upon them from the right gate of the gates of Paradise, and they will share with the people in all other gates. Then he said: By the One in whose hand is my soul, the distance between the two door panels of the gates of Paradise is like the distance between Mecca and Hajar, or like the distance between Mecca and Busra.' In the two Sahihs: 'Seventy thousand of my nation will enter Paradise without account. They are those who do not seek Ruqyah (incantations), do not believe in omens, do not use branding (cauterization), and rely upon their Lord.' In a narration in Sahih Muslim: 'Seventy thousand, with every one of them seventy thousand.' He said in Al-Mafatih: 'Tawakkul (reliance) is of two types: Special, which is to abandon medical treatment, Ruqyah, and branding due to extreme trust that nothing will befall him except what Allah has written for him of benefit and harm, and this is what is intended here. And General, which is obligatory upon all, which is to know that there is no influencer except Allah; food does not satisfy and medicines do not cure except by His command. Whoever holds this belief, it is permissible for him to seek medical treatment and Ruqyah, and to earn wealth through trade and crafts.'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 39
  },
  {
    "serial_number": "4940892",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 43,
    "volume_number": 1,
    "text": "The Account (Reckoning). Allah Almighty said: (And Paradise will be brought near to the righteous. And Hellfire will be brought forth for the deviators. And it will be said to them, 'Where are those you used to worship? Other than Allah? Can they help you or help themselves?' So they will be overturned into Hellfire, they and the deviators. And the soldiers of Iblees, all together.) And Allah Almighty said: (Then We will surely question those to whom [the message] was sent, and We will surely question the messengers. Then We will surely relate [their deeds] to them with knowledge, and We were never absent.) In Sahih Muslim from Shaqiq bin Abdullah, the Prophet, peace and blessings be upon him, said: 'Hell will be brought on the Day of Resurrection having seventy thousand reins; with every rein are seventy thousand angels dragging it.' In Sahih Al-Bukhari: 'Noah will be brought on the Day of Resurrection and it will be said: Did you convey? He will say: Yes, O Lord. Then his nation will be asked: Did he convey to you? They will say: No warner came to us. It will be said: Who are your witnesses? He will say: Muhammad and his nation. The Messenger of Allah, peace and blessings be upon him, said: So you will be brought and you will testify. Then the Messenger of Allah, peace and blessings be upon him, recited: (And thus we have made you a just community) He said: Just (Adool), (That you will be witnesses over the people and the Messenger will be a witness over you.)' Muqatil said regarding His saying: (And stand apart today, you criminals): meaning isolate yourselves today, i.e., in the Hereafter, from the righteous. Al-Suddi said: Be aside. In the two Sahihs, the Messenger of Allah, peace and blessings be upon him, said: 'Allah will say: O Adam, stand up and send forth the mission of the Fire. He will say: At Your service and obeying You, and all good is in Your Hands. What is the mission of the Fire? He will say: From every thousand'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 40
  },
  {
    "serial_number": "4940893",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 44,
    "volume_number": 1,
    "text": "nine hundred and ninety-nine. He said: At that time, the young child will turn grey, every pregnant female will drop her load, and you will see the people as if they are drunk, but they are not drunk; but the punishment of your Lord is severe.' This was very hard on them, so they said: 'O Messenger of Allah, where is that man (the one saved)?' The Messenger of Allah, peace and blessings be upon him, said: 'Nine hundred and ninety-nine from Gog and Magog, and one from you.' The people said: 'Allahu Akbar.' The Messenger of Allah, peace and blessings be upon him, said: 'By Allah, I hope that you will be a quarter of the people of Paradise. By Allah, I hope that you will be a third of the people of Paradise. By Allah, I hope that you will be half of the people of Paradise.' The people said Takbir. The Messenger of Allah, peace and blessings be upon him, said: 'You are not among the people on that Day except like a white hair on a black bull, or like a black hair on a white bull.' In Sahih Muslim, the Prophet, peace and blessings be upon him, said: 'You will surely restore rights to their owners, until retribution is taken for the hornless sheep from the horned sheep.' Al-Kalbi said: 'Allah Almighty will say to the cattle, wild beasts, birds, and predators: Be dust. And He will flatten the earth with them. At that, the disbeliever will wish that he were dust, as per the saying of Allah Almighty: (And the disbeliever will say, 'Oh, I wish that I were dust.')' In the book of Tirmidhi and others from Abu Barzah Al-Aslami, may Allah be pleased with him, he said: The Messenger of Allah, peace and blessings be upon him, said: 'The feet of a servant will not move on the Day of Resurrection from before Allah Almighty until he is asked about four things: About his life and in what he spent it; about his body and in what he used it; about his knowledge and what he did with it; and about his wealth, from where he earned it and in what he spent it.' In Sahih Muslim from Anas, may Allah be pleased with him, he said: We were with the Messenger of Allah, peace and blessings be upon him, and he laughed. He said: 'Do you know why I laugh?' We said: Allah and His Messenger know best. He said: 'From the servant's addressing his Lord. He says: O Lord, did You not protect me from injustice? He says: Yes. He says: I do not allow a witness against myself except from myself. He says: Sufficient is your own self against you this Day as a reckoner, and the noble scribes as witnesses. He said: So his mouth is sealed, and it is said to his limbs: Speak. He said: So they speak of his deeds. Then he is allowed to speak again. He says: Away with you and destruction to you! It was for you that I was arguing.' In the two Sahihs from Adi bin Hatim, he said: The Messenger of Allah, peace and blessings be upon him, said: 'There is none of you except that his Lord will speak to him, with no interpreter between him and his Lord. He will look to his right and see nothing",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 41
  },
  {
    "serial_number": "4940894",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 45,
    "volume_number": 1,
    "text": "except what he put forth. He will look to his left and see nothing except what he put forth. And he will look in front of him and see nothing except the Fire facing him. So fear the Fire, even with half a date.' In the two Sahihs from Aisha, may Allah be pleased with her, she said: The Messenger of Allah, peace and blessings be upon him, said: 'Whoever is held to account on the Day of Resurrection will be punished.' I said: Did Allah Almighty not say: (He will be judged with an easy account)? He said: 'That is not the Account (Hisab); that is only the Presentation (Al-Ard). Whoever is debated in the Account on the Day of Resurrection will be punished.' So reflect, may Allah have mercy on you, on your Lord's questioning of you without an intermediary about every little and large thing, every speck and date-stone skin, and the saying of the angels: 'O So-and-so, come to the Standing Place.' It has been narrated from him, peace be upon him: 'Indeed, Allah has an angel, the distance between whose eyelids is a journey of one hundred years.' So what do you think of yourself when you witness such angels sent to you to take you to the place of Presentation? Your muscles will tremble, your limbs will shake, and you will wish to be taken to Hell rather than have your shameful deeds presented to your Lord Almighty. Imagine yourself in the hands of those appointed over you until they bring you to the Throne of the Most Merciful. They throw you from their hands, and Allah Almighty calls you with His Great Speech: 'O Son of Adam, come near to Me.' So you draw near with a beating, sorrowful, fearful heart and a humbled, abased gaze. You are given your book which leaves out nothing small or great but that it has enumerated it. I wonder with what foot you will stand before Allah, with what tongue you will answer, and with what heart you will comprehend what you say and what you are told? If He says: 'Were you not shy of Me? Did you think that I did not see you?' From Al-Fudayl: 'I do not envy being a drawn-near angel, nor a sent prophet, nor a righteous servant. Are these not held accountable in the Resurrection? I only envy the one who was never created.' Some recited: Represent your standing on the Day of Gathering naked... Seeking favor, anxious of heart, confused. / The Fire roars from rage and anger... At the sinners, and you meet the Lord angry. / Read your book, O My servant, slowly... And look at it to see if what happened, happened?",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 42
  },
  {
    "serial_number": "4940895",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 46,
    "volume_number": 1,
    "text": "When you read a book that leaves out not... A letter for me, nor what was in secret or public. / The Majestic One says: Take him, O My angels... Pass with My servant to the Fires, thirsty. / O Lord, do not grieve us on the Day of Account, nor... Give anyone authority over us on that Day.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 43
  },
  {
    "serial_number": "4940896",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 47,
    "volume_number": 1,
    "text": "Section on the Scale (Mizan). Allah Almighty said: (The Striking Calamity (1) What is the Striking Calamity? (2) And what can make you know what is the Striking Calamity? (3) It is the Day when people will be like moths, dispersed, (4) And the mountains will be like wool, fluffed up. (5) Then as for one whose scales are heavy [with good deeds], (6) He will be in a pleasant life. (7) But as for one whose scales are light, (8) His refuge will be an abyss. (9) And what can make you know what that is? (10) It is a Fire, intensely hot. (11)) Abu Bakr Al-Bazzar, may Allah be pleased with him, mentioned from the Prophet, peace and blessings be upon him, he said: 'An angel is appointed over the Scale. The son of Adam is brought and made to stand between the two pans of the Scale. If his scale is heavy, the angel calls out with a voice that all creatures hear: So-and-so has succeeded with a happiness after which he will never be wretched. And if his scale is light, the angel calls out with a voice that all creatures hear: So-and-so has become wretched with a wretchedness after which he will never be happy.' In Sunan Abi Dawood from Aisha, may Allah be pleased with her, that she mentioned the Fire and wept. The Prophet, peace and blessings be upon him, said: 'What makes you weep?' She said: 'I mentioned the Fire and wept. Will you remember your families on the Day of Resurrection?' The Prophet, peace and blessings be upon him, said: 'As for three places, no one will remember anyone: At the Scale until he knows whether his scale is light or heavy; at the Book when it is said: (Here, read my record!) until he knows where his book will fall, in his right hand, his left, or from behind his back; and at the Sirat (Bridge) when it is placed across Hell.' In Al-Waseet from Abu Huraira, may Allah be pleased with him, he said: I heard the Messenger of Allah, peace and blessings be upon him, say: 'Allah will offer three excuses to Adam. Allah will say: O Adam, were it not that I cursed the liars, hated the liar and the oath-breaker, and threatened (punishment), I would have had mercy on your children today, all of them, due to the severity of the punishment I have prepared for them. But the Word from Me has come into effect that if My messengers are denied and My command disobeyed, I will surely fill Hell with Jinn and people all together. And Allah Almighty says: O Adam, know that I will not enter anyone from your offspring into the Fire, nor punish anyone among them with the Fire, except him whom I know by My knowledge that if I returned him to the world, he would return to an evil worse than he was in, and would not return (to good) nor make amends. And He Almighty says: I have made a judgment between Me and your offspring'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 44
  },
  {
    "serial_number": "4940897",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 48,
    "volume_number": 1,
    "text": "Stand at the Scale and look at what is raised to you of their deeds. Whoever among them has his good outweigh his evil by the weight of an atom, to him belongs Paradise, so that you may know that I do not enter anyone of them into the Fire except an oppressor.' In the Sahih from Abu Huraira, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: 'Do you know who is the bankrupt (Muflis)?' They said: 'The bankrupt among us is the one who has no dirham and no goods.' He said: 'Indeed, the bankrupt of my nation is the one who comes on the Day of Resurrection with prayer, Zakat, and fasting, but comes having insulted this one, slandered this one, eaten the wealth of this one, shed the blood of this one, and beaten this one. So this one is given from his good deeds, and this one from his good deeds. If his good deeds are exhausted before what is upon him is settled, their sins are taken and cast upon him, then he is cast into the Fire.' In the Sahih: 'The first thing to be judged is regarding blood.' In Ma'alim al-Tanzil, it is narrated from Abdullah bin Masud that he said: 'When it is the Day of Resurrection, Allah will gather the first and the last. Then a caller will call out: Whoever seeks a wrong done to him, let him come to his right and take it. So a person will rejoice to have a right against his father, his child, his wife, or his brother, so he takes from him, even if it is small. The confirmation of that is in the Book of Allah Almighty: (So when the Horn is blown, no relationship will there be among them that Day, nor will they ask about one another. So those whose scales are heavy - it is they who are the successful. And those whose scales are light - those are the ones who have lost their souls, [being] in Hell, abiding eternally.) The servant is brought, and a caller calls out over the heads of the first and the last: This is So-and-so son of So-and-so. Whoever has a right against him, let him come to his right. Then it is said: Give these their rights. He says: O Lord, from where? The world has gone. Allah Almighty says to the angels: Look into his righteous deeds and give them from them. If an atom's weight of a good deed remains, the angels say: O our Lord, an atom's weight of a good deed remains for him. Allah Almighty says: Multiply it for My servant and enter him into Paradise by the virtue of My mercy. The confirmation of that is in the Book of Allah Almighty: (Indeed, Allah does not do injustice, [even] as much as an atom's weight; while if there is a good deed, He multiplies it.)'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 45
  },
  {
    "serial_number": "4940898",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 49,
    "volume_number": 1,
    "text": "And if he was a wretched servant, the angels say: 'Our God, his good deeds have run out, and claimants remain.' So Allah, the Mighty and Majestic, says: 'Take from their bad deeds and add them to his bad deeds, then write him a cheque to the Fire.' Al-Tirmidhi mentioned from the Hadith of Abdullah bin Amr bin Al-Aas, may Allah be pleased with them both, who said: The Messenger of Allah, peace be upon him, said: 'Allah will single out a man from my nation (Ummah) at the head of all creatures on the Day of Resurrection. Ninety-nine scrolls will be spread out for him, each scroll as far as the eye can see. Then Allah will say: Do you deny anything of this? Have my recording scribes wronged you? He will say: No, O Lord. Allah will say: Do you have an excuse? He will say: No, O Lord. Allah will say: Yes, indeed you have a good deed with Us, and there will be no injustice upon you today. Then a card will be brought out containing: I bear witness that there is no god but Allah, and I bear witness that Muhammad is His Messenger. He will say: Bring your weighing. The man will say: O Lord, what is this card compared to these scrolls? It will be said: You will not be wronged. He said: So the scrolls are placed in one pan and the card in the other pan; the scrolls became light and the card became heavy. He said: Nothing is heavy next to the name of Allah.' Meaning: Whoever has the remembrance of Allah with him, nothing from sins can outweigh it; rather, the remembrance outweighs the sins. So reflect, may Allah have mercy on you, on your scale and beware of your loss. Know that whoever has no bad deed has Paradise, and whoever has no good deed has the Fire, and whoever mixed (good and bad), justice is by the scale. So fear Allah, O servants of Allah, and (fear) the injustices against servants by taking their wealth, attacking their honor, distressing their hearts, and ill conduct in associating with them. For what is between the servant and Allah specifically, forgiveness for it is faster. It is said that if the oppressed clings to the oppressor who is 'Awwab' (frequently returning to Allah), meaning he ceased the sin and did not return to it but could not seek release (from the oppressed), Allah says to the oppressed: 'Raise your head.' He raises his head and sees a magnificent palace looming. He says: 'What is this, O Lord?' He says: 'It is for sale, buy it from Me.' He says: 'I do not have its price.' He says: 'By absolving your brother of his injustice, the palace is yours.' He says: 'I have done so, O Lord.' It is narrated that when death approached Luqman the Wise, he wept. His son said to him: 'What makes you weep, O father?' He said: 'O my son, I do not weep for the world nor its delights, but for what is before me of the long distance, the deep desert, the steep obstacle, the little provision, and the heavy load. I do not know if that load will be lifted from me so I reach the destination, or if I will be burdened until I am driven to the Fire.'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 46
  },
  {
    "serial_number": "4940899",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 50,
    "volume_number": 1,
    "text": "For this I weep. Then he died, may Allah have mercy on him. Some of them recited: I see myself, when I speak to my soul of repentance... An obstacle appears to me preventing that. My life passed in distraction and heedlessness... And deeds of evil, none of them suitable. I was expelled while others are drawn near by righteousness... And before my attainment is a narrow path. How (can I reach) when the slips of the evildoer are many... Does a slave who fled from his masters draw near? To Allah I complain of a bad heart that passion... Has possessed, and attachments have uprooted it. I have a sadness increasing every moment... And the tears of my eyelids race to weep. If You forgive the sin I have committed... That is my hope, and thoughts (of You) agree. The sign of what He bestows of grace is if I... Abandon the worlds or say: You are divorced. There, every magnified secret appears... To my eye, and there the realities cover me.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 47
  },
  {
    "serial_number": "4940900",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 51,
    "volume_number": 1,
    "text": "Passing Over the Sirat (Bridge) and the Hawd (Basin). Allah Almighty said: (So by your Lord, We will surely gather them and the devils; then We will bring them to be present around Hell upon their knees. Then We will surely extract from every sect those of them who were worst against the Most Merciful in insolence. Then, surely it is We who are most knowing of those most worthy of burning therein. And there is none of you except he will come to it. This is upon your Lord an inevitability decreed. Then We will save those who feared Allah and leave the wrongdoers within it, on their knees.) [Maryam: 68-72]. There is disagreement regarding 'coming to it' (Wurud). It was said it is entering it while it is extinguished, so the believers cross it and it collapses with others. And it was said it is passing over the Sirat, for it is extended over it; Al-Nawawi, may Allah have mercy on him, authenticated this. In Sahih Muslim, from Abu Huraira or Hudhayfah, after mentioning the Hadith of Intercession where people resort to him, peace be upon him, for relief from the Standing and judgment between servants, he said: They come to Muhammad, so he stands and is given permission. Trust (Amanah) and Kinship (Rahim) are sent and stand on the sides of the Sirat, right and left. The first of you passes like lightning, then like the passing of birds and the fastest of men; their deeds carry them. Your Prophet, peace be upon him, stands on the Sirat saying: 'Lord, save! Lord, save!' until a man comes unable to proceed except crawling. He said: On the edges of the Sirat are hanging hooks commanded to take whom they are ordered. Some are scratched but saved, and some are piled into the Fire. By the One in Whose hand is the soul of Abu Huraira, the bottom of Hell is seventy autumns (years) deep. He said in 'Ikmal al-Ilm' interpreting the other Hadith: 'A huge rock is thrown from the edge of Hell and falls in it for seventy years until it reaches its resting place.' In Sahih Al-Bukhari, the Messenger of Allah, peace be upon him, said: 'When the believers are saved from the Fire, they are detained on a bridge between Paradise and the Fire, where they settle injustices that occurred between them",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 48
  },
  {
    "serial_number": "4940901",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 52,
    "volume_number": 1,
    "text": "in the world. Until when they are cleansed and purified, they are permitted to enter Paradise. By the One in Whose hand is the soul of Muhammad, one of them is more guided to his dwelling in Paradise than he was to his dwelling in the world.' In Al-Risalah Al-Qushayriyyah, Mu'adh bin Jabal said: The believer's heart is not reassured nor does his fear subside until he leaves the bridge of Hell behind. Abu Maysarah, may Allah be pleased with him, whenever he went to his bed, would say: 'Would that my mother had not borne me,' then he would weep. It was said: 'What makes you weep?' He said: 'We were told that we would come to it (Hell), but we were not told that we would return from it.' Abdullah bin Rawaha wept and said: 'A verse was revealed in which my Lord informs me that I will come to the Fire, but He did not inform me that I will return from it; that is what made me weep.' Al-Hasan said: 'How can a believer not grieve when he has been told by Allah that he will come to Hell, but has not been told that he will return from it?' In Sahih Muslim from Anas, he said: While the Messenger of Allah, peace be upon him, was among us one day, he dozed off briefly, then raised his head smiling. It was said: 'What makes you laugh, O Messenger of Allah?' He said: 'A Surah was revealed to me just now, in which is read: In the name of Allah, the Most Gracious, the Most Merciful: (Indeed, We have granted you, [O Muhammad], al-Kawthar. So pray to your Lord and sacrifice [to Him alone]. Indeed, your enemy is the one cut off).' Then he said: 'Do you know what Al-Kawthar is?' We said: 'Allah and His Messenger know best.' He said: 'It is a river my Lord promised me, upon which is much good. It is a Hawd (Basin) to which my Ummah will come on the Day of Resurrection. Its vessels are as numerous as the stars. A servant from among them will be snatched away, and I will say: O Lord, indeed he is from my Ummah. He will say: You do not know what he introduced after you.' His saying 'yukhtalaj' (snatched away) is in the passive voice, meaning he is turned away from the Hawd; he is either an apostate or a sinner. In the book of Al-Tirmidhi from Samurah bin Jundub, he said: The Messenger of Allah, peace be upon him, said: 'Indeed,",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 49
  },
  {
    "serial_number": "4940902",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 53,
    "volume_number": 1,
    "text": "every Prophet has a Hawd (Basin), and they boast about which of them has the most arrivals (waridah). And I hope that I will have the most arrivals.' In Sahih Al-Bukhari from Sahl bin Sa'd, he said: The Prophet, peace be upon him, said: 'I am your predecessor (Farat) at the Hawd. Whoever passes by me drinks, and whoever drinks will never thirst again. People will come to me whom I recognize and who recognize me, then a barrier will be placed between me and them.' Abu Sa'id Al-Khudri added, so he said: 'I will say: Indeed they are from me. It will be said: Indeed, you do not know what they introduced after you. So I will say: Away, away with those who changed after me.' 'He will never thirst' means never get thirsty. This implies that drinking from it is after the Account and salvation from the Fire. It implies that all those who arrive and pass by him drink, and only those who are driven away are prevented from arriving and passing. 'Suhqan' means away/far. This indicates that they are apostates from the religion, because he intercedes for sinners and cares for their affair, and does not say such things to them. In Sahih Al-Bukhari from Abu Huraira, may Allah be pleased with him, from the Prophet, peace be upon him, he said: 'While I am standing at the Hawd, a group appears. Until when I recognize them, a man comes out between me and them and says: Come. I say: Where to? He says: To the Fire, by Allah. I say: What is their affair? He says: They turned back on their heels as apostates after you. Then another group appears. When I recognize them, a man comes out between me and them and says: Come. I say: Where to? He says: To the Fire, by Allah. I say: What is their affair? He says: They turned back on their heels as apostates. I do not see anyone saved among them except like the neglected cattle (Haml al-Na'am).' Al-Kirmani said in Al-Kawakib Al-Darari: 'Al-Haml' (with two Fathas) is what is left neglected, not tended to or pastured, until it is lost and perishes. Meaning: only a few of them are saved from the Fire. This indicates they are two types: disbelievers and sinners. In Sahih Muslim from Abu Huraira, may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, came to the graveyard and said: 'Peace be upon you, abode of believing people, and we, if Allah wills, will join you. I wish we had seen our brothers.' They said: 'Are we not your brothers, O Messenger of Allah?' He said: 'You are",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 50
  },
  {
    "serial_number": "4940903",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 54,
    "volume_number": 1,
    "text": "my companions, and our brothers are those who have not come yet.' They said: 'How will you recognize those of your Ummah who have not come yet, O Messenger of Allah?' He said: 'Do you not see that if a man has horses with white blazes and white legs (Ghurr Muhajjalun) among jet-black horses, would he not recognize his horses?' They said: 'Yes, O Messenger of Allah.' He said: 'For they will come with white blazes and white limbs from Wudu (ablution), and I am their predecessor at the Hawd. Indeed, men will be driven away from my Hawd just as a stray camel is driven away. I will call out to them: Come here! Come here! It will be said: Indeed, they changed (the religion) after you. So I will say: Away, away!' In the book of Al-Tirmidhi from Thawban from the Prophet, peace be upon him: 'My Hawd is from Aden to Amman Balqa. Its water is whiter than milk and sweeter than honey. Its vessels are as numerous as the stars of the sky. Whoever drinks a sip from it will never thirst after it. The first people to arrive at it are the poor emigrants (Muhajirun), disheveled of head, dirty of clothes, who do not marry wealthy women, and for whom doors are not opened.' Umar bin Abd al-Aziz said: 'But I married wealthy women, and doors were opened for me. I married Fatima bint Abd al-Malik. No doubt, I will not wash my head until it becomes disheveled, and I will not wash my garment that touches my body until it becomes dirty.' In Sahih Al-Bukhari, Ibn Abi Mulaykah used to say: 'O Allah, we seek refuge in You from turning back on our heels or being seduced from our religion.' Know that the Hawd is in the hand of the Prophet, peace be upon him, at the gate of Paradise; the believers drink from it, and it is created today. So repent, O my brother, to your Lord and fear Him so He may relieve you of your worry, and ask Him to protect you from a Fitnah (trial) occurring in your religion, causing you to be driven away from the Hawd of your Prophet. It is said that Allah concealed three things in three: He concealed His pleasure in His obedience, so let none of you belittle anything of obedience, for perhaps a belittled act of obedience contains Allah's pleasure. He concealed His anger in His disobedience, so let none of you belittle anything of disobedience, for perhaps a belittled act of disobedience contains Allah's anger. And He concealed His Wali (saint/friend) among His creation, so let none of you belittle anyone of Allah's creation, for perhaps one who is not paid attention to is a Wali of Allah. He also concealed a fourth, which is the Response to Du'a (supplication), so let none of you belittle anything of Du'a, in any state and in any place. Stand at the door seeking... And shed tears pouring.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 51
  },
  {
    "serial_number": "4940904",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 55,
    "volume_number": 1,
    "text": "And seek means to Him and re... turn from sin repenting. You will meet from His good making... at that time wonders. Do not fear being turned back from... Allah's generosity disappointed. For He rewards for the littl... e and gives desires. A person's honor is in piety... so make truthfulness a companion. And be ashamed that your Lor... d sees you committing sin. Indeed, time has arrows for calamities striking accurately. And matters followed successively... stirring up disasters. So be pleased with Allah and hold fast... and ask Allah desiringly.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 52
  },
  {
    "serial_number": "4940905",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 56,
    "volume_number": 1,
    "text": "The Major Intercession (Al-Shafa'ah Al-Kubra). Allah Almighty said: (That Day, no intercession will benefit except [that of] one to whom the Most Merciful has given permission.) [Ta-Ha: 109]. Abu Bakr Al-Bazzar mentioned from the Prophet, peace be upon him, who said: 'People will be carried on the Day of Resurrection on the Sirat (Bridge), and they will fall off the sides of the Sirat like moths into the Fire. Then permission will be given to the angels, prophets, martyrs, and righteous people; they will intercede and bring out whoever is in the Fire.' It is narrated in the Sahih: 'The first to intercede are the Messengers, then the Prophets, then the Scholars.' In the book of Al-Tirmidhi, he said: The Messenger of Allah, peace be upon him, said: 'More than (the number of) Banu Tamim will enter Paradise through the intercession of a man from my Ummah.' It was said: 'O Messenger of Allah, other than you?' He said: 'Other than me.' In the Musnad of Al-Bazzar: The Messenger of Allah, peace be upon him, said: 'Indeed, among my Ummah are those who will intercede for a large group (Fi'am) of people, and among them are those who will intercede for a tribe ('Usbah), and among them are those who will intercede for a clan (Qabilah), and among them are those who will intercede for a man and his household.' Al-Daraqutni narrated from Abu Umamah who said: The Messenger of Allah, peace be upon him, said: 'I am the best of men for the evil ones of my Ummah.' They said: 'How about for the good ones?' He said: 'As for the good ones, they will enter Paradise by their deeds. As for the evil ones of my Ummah, they will enter Paradise by my intercession.' It is narrated from Awf bin Malik who said: The Messenger of Allah, peace be upon him, said: 'A comer came to me from Allah and gave me a choice between half of my Ummah entering Paradise and intercession. I chose intercession, and it is for whoever dies not associating anything with Allah.' In Al-Wasit by Al-Wahidi from Jabir, he said: I heard the Messenger of Allah, peace be upon him, say: 'A man will say in Paradise: What happened to my friend? While his friend is in Hell. So Allah, Mighty and Majestic, will say: Bring out his friend to Paradise. Then those remaining therein will say: So we have no intercessors nor a close friend.'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 53
  },
  {
    "serial_number": "4940906",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 57,
    "volume_number": 1,
    "text": "In Sahih Muslim from Abu Sa'id Al-Khudri, he said: Some people said: 'O Messenger of Allah, will we see our Lord on the Day of Resurrection?' The Messenger of Allah, peace be upon him, said: 'Yes.' He said: 'Do you have trouble seeing the sun at noon on a clear day with no clouds? And do you have trouble seeing the moon on the night of the full moon on a clear night with no clouds?' They said: 'No, O Messenger of Allah.' He said: 'You will not have trouble seeing Allah, Blessed and Exalted, on the Day of Resurrection except as you have trouble seeing one of them. When it is the Day of Resurrection, a caller will announce: Let every nation follow what it used to worship. So no one who used to worship other than Allah Almighty, such as idols and stones (Ansab), will remain but will fall into the Fire. Until only those who used to worship Allah, righteous or wicked, and the remnants of the People of the Book remain. Then the Jews will be called and it will be said to them: What did you used to worship? They will say: We used to worship Uzair, son of Allah. It will be said: You have lied; Allah has not taken a wife or a son. So what do you want? They will say: We are thirsty, our Lord, so give us drink. It will be signaled to them: Will you not go down to drink? So they will be gathered to the Fire as if it were a mirage, smashing against itself, and they will fall into the Fire. Then the Christians will be called and it will be said to them: What did you used to worship? They will say: We used to worship the Messiah, son of Allah. It will be said to them: You have lied; Allah has not taken a wife or a son. It will be said to them: What do you want? They will say: We are thirsty, O our Lord, so give us drink. He said: It will be signaled to them: Will you not go down to drink? So they will be gathered to Hell as if it were a mirage, smashing against itself, and they will fall into the Fire. Until only those who used to worship Allah Almighty, righteous or wicked, remain. The Lord of the Worlds, Glory be to Him, will come to them in a form closer [to their recognition] than the one they saw Him in. He will say: What are you waiting for? Every nation has followed what it used to worship. They will say: O our Lord, we separated from people in the world when we were most in need of them and did not accompany them. He will say: I am your Lord. They will say: We seek refuge in Allah from you; we do not associate anything with Allah - twice or thrice - until some of them are about to turn away. He will say: Is there a sign between you and Him by which you recognize Him? They will say: Yes. Then the Shin will be uncovered. No one who used to prostrate to Allah of his own accord will remain but Allah will permit him to prostrate. And no one who used to prostrate out of fear or showing off will remain but Allah will make his back a single slab; whenever he wants to prostrate, he will fall on his back. Then they will raise their heads, and He has transformed into His form which they saw Him in the first time. He will say: I am your Lord. They will say: You are our Lord. The Fire has taken up to half their shins and up to their knees. Then the Bridge (Jisr) will be struck over Hell and Intercession will be permitted. They will say: O Allah, save, save. It was said: O Messenger of Allah, what is the Bridge? He said: Slippery",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 54
  },
  {
    "serial_number": "4940907",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 58,
    "volume_number": 1,
    "text": "and sliding, upon it are hooks, claws, and thorns like the thorns of Sa'dan found in Najd. The believers will pass like the blink of an eye, like lightning, like wind, like birds, and like excellent horses and camels. So one is saved unharmed, one is scratched but released, and one is piled into the Fire of Hell. Until when the believers are saved from the Fire - by the One in Whose hand is my soul, none of you is more persistent in pleading to Allah for his right than the believers will be to Allah on the Day of Resurrection for their brothers who are in the Fire. They will say: 'Our Lord, they used to fast with us, pray, and perform Hajj.' It will be said to them: 'Bring out those you recognize.' So their forms will be forbidden to the Fire, and they will bring out many people whom the Fire had taken up to half their shins and up to their knees. Then they will say: 'Our Lord, no one remains therein of those You ordered us [to save].' He will say: 'Return, and whoever you find in his heart the weight of a Dinar of good, bring him out.' So they will bring out many people. Then they will say: 'Our Lord, we have not left therein anyone of those You ordered us [to save].' Then He will say: 'Return, and whoever you find in his heart the weight of half a Dinar of good, bring him out.' So they will bring out many people. Then they will say: 'Our Lord, we have not left any good therein.' Then Allah will say: 'The angels have interceded, the Prophets have interceded, and the believers have interceded, and none remains but the Most Merciful of the merciful.' He will grab a handful from the Fire and bring out people who never did any good, who had turned into charcoal. He will throw them into a river at the mouths of Paradise called the River of Life. They will emerge as a seed emerges in the silt of a flood. Do you not see it facing the stone or the tree? What faces the sun is yellowish and greenish, and what faces the shade is white? They said: 'O Messenger of Allah, it is as if you were herding in the desert.' He said: 'They will emerge like pearls, with seals on their necks. The people of Paradise will recognize them: These are the freed ones of Allah whom Allah admitted to Paradise without any deed they did or good they offered. It will be said to them: You have what you saw and the like of it with it.'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 55
  },
  {
    "serial_number": "4940908",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 59,
    "volume_number": 1,
    "text": "Know that the intercessions are five: First: Relief from the terror of the Standing and hastening the Account; this is specific to Muhammad, peace be upon him. Second: Admitting a people into Paradise without account; this is also narrated for him, peace be upon him. Third: A people who deserved the Fire, so a Prophet intercedes for them, and whoever Allah wills intercedes for them. Fourth: Increasing degrees in Paradise for its people. Fifth: Regarding those who entered the Fire from the sinners; a Prophet and others from the Prophets, Angels, and their believing brothers intercede for them. Then Allah brings out everyone who said 'There is no god but Allah' without the intercession of an intercessor, until none remain in it except the disbelievers, as in the Hadith from Anas: 'Then I return the fourth time and praise Him with those praises, then I fall down prostrate to Him. It is said: O Muhammad, raise your head, and speak, you will be heard; ask, you will be given; and intercede, your intercession will be accepted. So I say: O Lord, permit me regarding whoever said 'There is no god but Allah'. He says: That is not for you, but by My Might, My Pride, My Greatness, and My Grandeur, I will surely bring out whoever said 'There is no god but Allah'.' Meaning: I will bestow favor by bringing them out without the intercession of an intercessor. These are the ones who have mere faith, and for whom permission for intercession was not granted. The narrations only indicate that permission was granted for those who have something extra to faith, such as a righteous deed, hidden remembrance, or an act of the heart like compassion for a poor person, fear of Allah, or sincere intention for a missed deed, and He made for the intercessors from Angels and Prophets a sign upon it. And Allah alone knows",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 56
  },
  {
    "serial_number": "4940909",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 60,
    "volume_number": 1,
    "text": "what the hearts conceal. Mercy is for those who have nothing but faith. His saying 'atom's weight of faith and good', the correct meaning is something extra to mere faith, because mere faith, which is affirmation, is indivisible. So adhere, my brother, to faith: believe in your heart in the religion of Islam and pronounce with that the two testimonies. For if you limit yourself to one of them, you will abide eternally in the Fire of Hell whose fuel is men and stones, and no intercessor's intercession will benefit you. Then you must guard against sins, for sins are the messenger of disbelief. It is narrated that a student of Al-Fudayl bin Iyad was dying. Al-Fudayl entered upon him, sat by his head, and recited Surah Ya-Sin. He said: 'O teacher, do not recite this Surah.' So he fell silent. Then he instructed him, saying: 'Say there is no god but Allah.' He said: 'I will not say it, for I am innocent of it,' and he died upon that. Al-Fudayl entered his house and wept for forty days, not leaving the house. Then he saw him in a dream being dragged to Hell. He said: 'By what thing did Allah remove gnosis (Ma'rifa) from you, and you were the most knowledgeable of my students?' He said: 'By three things: First: Calumny (Namimah); I used to tell my companions the opposite of what I told you. Second: Envy; I envied my companions. Third: I had an illness, so I went to a doctor and asked him about it. He said: Drink a cup of wine every year, for if you do not, the illness will remain with you. So I used to drink it.' We seek refuge in Allah from the wrath we cannot bear. Some said: If the world leaves a man his religion... Then what he missed of it is not harmful. O Allah, have mercy on us and do not punish us, grant us success and do not forsake us, and do not strip faith from us at our ends, for we have no refuge but You, and no reliance but on You, O Most Merciful of the merciful.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 57
  },
  {
    "serial_number": "4940910",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 61,
    "volume_number": 1,
    "text": "The Punishment of Disbelievers in Hell. Allah Almighty said: (But those who disbelieved will have cut out for them garments of fire. Poured upon their heads will be scalding water. By which is melted that within their bellies and [their] skins. And for [striking] them are maces of iron. Every time they want to get out of it from anguish, they will be returned to it, and [it will be said], 'Taste the punishment of the Burning Fire!'). [Al-Hajj: 19-22]. (The Fire will sear their faces, and they therein will have taut smiles). [Al-Mu'minun: 104]. (When the shackles are around their necks and the chains; they will be dragged. In boiling water; then in the Fire they will be filled [with flame]). [Ghafir: 71-72]. (And for those who disbelieve will be the fire of Hell. [Death] is not decreed for them so they may die, nor will its torment be lightened for them. Thus do We recompense every ungrateful one. And they will cry out therein, 'Our Lord, remove us; we will do righteousness - other than what we were doing!' But did We not grant you life enough for whoever would remember therein to remember, and the warner came to you? So taste [the punishment], for there is not for the wrongdoers any helper). [Fatir: 36-37]. (Indeed, the tree of Zaqqum. Is food for the sinful. Like murky oil, it boils within bellies. Like the boiling of scalding water. [It will be commanded], 'Seize him and drag him into the midst of the Hellfire. Then pour over his head from the torment of scalding water. Taste! Indeed, you are the honored, the noble!'). [Ad-Dukhan: 43-49]. (And the companions of the left - what are the companions of the left? In scorching fire and scalding water. And a shade of black smoke. Neither cool nor noble. Indeed, they were before that indulging in affluence. And they used to persist in the great violation. And they used to say, 'When we die and become dust and bones, are we indeed to be resurrected? And our forefathers [as well]?' Say, 'Indeed, the former and the later peoples. Are to be gathered",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 58
  },
  {
    "serial_number": "4940911",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 62,
    "volume_number": 1,
    "text": "for the appointment of a known Day.' Then indeed you, O those astray [who are] deniers, Will be eating from trees of Zaqqum. And filling with it your bellies. And drinking on top of it from scalding water. And will drink as the drinking of thirsty camels. That is their accommodation on the Day of Recompense. We have created you, so why do you not believe?) [Al-Waqi'a: 41-57]. ('Seize him and shackle him. Then into Hellfire drive him. Then into a chain whose length is seventy cubits insert him. Indeed, he did not used to believe in Allah, the Most Great. Nor did he encourage the feeding of the poor. So there is not for him here this Day any devoted friend. Nor any food except from the discharge of wounds. Which none eat except the sinners.') [Al-Haqqah: 30-37]. (Has there reached you the report of the Overwhelming [event]? [Some] faces, that Day, will be humbled. Working [hard] and exhausted. They will [enter to] burn in an intensely hot Fire. They will be given drink from a boiling spring. For them there will be no food except from a poisonous, thorny plant. Which neither nourishes nor avails against hunger.) [Al-Ghashiyah: 1-7]. In the book of Al-Tirmidhi from Abu Huraira, may Allah be pleased with him, he said: The Prophet, peace be upon him, said: 'When Allah created Paradise, He said to Gabriel: Go and look at it. So he went and looked at it and at what Allah had prepared for its people in it. Then he came back and said: O Lord, by Your Might, no one hears of it but enters it. Then He surrounded it with hardships. Then He said: O Gabriel, go and look at it. So he went and looked at it, then came back and said: O Lord, by Your Might, I fear that no one will enter it. He said: When Allah created the Fire, He said: O Gabriel, go and look at it. So he went and looked at it, then said: O Lord, by Your Might, no one hears of it and enters it. So He surrounded it with desires. Then He said: O Gabriel, go and look at it. So he went and looked at it, then said: O Lord, by Your Might, I fear that no one will remain but enter it.' In Sahih Muslim, the Messenger of Allah, peace be upon him, said: 'This fire of yours which the son of Adam kindles is one part of seventy parts of the fire of Hell.' They said: 'By Allah, it would have been sufficient, O Messenger of",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 59
  },
  {
    "serial_number": "4940912",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 63,
    "volume_number": 1,
    "text": "Allah.' He said: 'It exceeds it by sixty-nine parts, each like its heat.' Sufyan bin Uyaynah mentioned from Abu Huraira. The Messenger of Allah, peace be upon him, said: 'This fire of yours is one part of seventy parts of the fire of Hell, and were it not that it was struck with water twice, no one would have benefited from it.' In the book of Al-Tirmidhi from Abu Huraira, may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said: 'The Fire was kindled for a thousand years until it turned red, then kindled for a thousand years until it turned white, then kindled for a thousand years until it turned black, so it is black and dark.' In Sahih Muslim from Abu Huraira, may Allah be pleased with him, he said: We were with the Messenger of Allah, peace be upon him, when he heard a thud. The Prophet, peace be upon him, said: 'Do you know what this is?' He said: We said Allah and His Messenger know best. He said: 'This is a stone thrown into the Fire seventy autumns ago, and it has been falling in the Fire until now it reached its bottom, so you heard its thud.' In the book of Al-Tirmidhi from Abdullah bin Amr bin Al-Aas, he said: The Messenger of Allah, peace be upon him, said: 'If a pebble like this - pointing to a skull - were sent from the sky to the earth, a distance of five hundred years, it would reach the earth before night. And if it were sent from the head of the Chain, it would travel forty autumns, night and day, before reaching its base or bottom.' In Sahih Al-Bukhari from Anas from the Prophet, peace be upon him, he said: 'Allah says to the person of the Fire with the least punishment on the Day of Resurrection: If you had everything on earth, would you ransom yourself with it? He says: Yes. He says: I wanted from you easier than this while you were in the loins of Adam: that you not associate anything with Me, but you refused except to associate.' In Sahih Muslim from Al-Nu'man bin Bashir, may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said:",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 60
  },
  {
    "serial_number": "4940913",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 64,
    "volume_number": 1,
    "text": "'The person of the Fire with the least punishment is one who has two sandals and straps of fire from which his brain boils as a cauldron boils. He does not see anyone with more severe punishment than him, yet he is the one with the least punishment.' In it from Samurah bin Jundub that he heard the Messenger of Allah, peace be upon him, say: 'Among them are those whom the Fire takes up to his ankles, and among them those it takes up to his waist, and among them those it takes up to his neck.' In the Musnad of Al-Bazzar from Abu Huraira, may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said: 'If there were one hundred thousand or more in the mosque and a man from the people of the Fire breathed, he would burn them.' In the book of Al-Tirmidhi from Ibn Abbas, may Allah be pleased with them both, he said: The Messenger of Allah, peace be upon him, said: 'If a drop of Zaqqum were dropped into the world, it would spoil the livelihoods of the people of the world, so how about him whose food it is?' From Abu Sa'id Al-Khudri from the Prophet, peace be upon him, he said: 'The pavilion of the Fire has four walls, and the thickness of each wall is a distance of forty years.' He, peace be upon him, said: 'If a bucket of Ghassaq (pus) were spilled in the world, the people of the world would stink.' Scholars said: It is the sweat and pus of the people of the Fire. It is said: Their tears, which they are made to drink with boiling water. And he, peace be upon him, said: 'Wayl is a valley in Hell into which the disbeliever falls for forty autumns before reaching its bottom. And Al-Sa'ud is a mountain of fire he ascends for seventy autumns and falls likewise forever.' And he, peace be upon him, said: 'If a mace of iron were placed on earth and the two heavy creations (Jinn and Men) gathered, they would not move it from the ground. And he said: If a mountain were struck with a mace of iron, it would crumble and become dust.' In the book of Al-Tirmidhi from Abu Huraira, may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said: 'A neck will emerge from the Fire on the Day of Resurrection having two eyes that see, two ears that hear, and a tongue that speaks. It says: I have been entrusted with three: every obstinate tyrant, everyone who called on another god with Allah, and the picture-makers.' In the book of Al-Tirmidhi from Abu Umamah, may Allah be pleased with him, from the Prophet, peace be upon him, regarding His saying: (",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 61
  },
  {
    "serial_number": "4940914",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 65,
    "volume_number": 1,
    "text": "And he will be given a drink of purulent water. Which he will gulp but will hardly swallow). [Ibrahim: 16-17]. He said: 'It is brought near his mouth, and when it is close, it roasts his face and the scalp of his head falls off. If he drinks it, it cuts his intestines until it exits from his anus.' Allah Almighty says: (And are given to drink scalding water that will sever their intestines). [Muhammad: 15]. And He, Mighty and Exalted, says: (And if they call for relief, they will be relieved with water like murky oil, which scalds the faces). [Al-Kahf: 29]. In it from Abu Huraira, may Allah be pleased with him, from the Prophet, peace be upon him, he said: 'Scalding water will be poured over their heads, and the scalding water will penetrate until it reaches his belly, shearing off what is in his belly until it passes out from his feet. That is the melting (Al-Sahr). Then he is restored as he was.' In it from Abu Sa'id Al-Khudri, may Allah be pleased with him, from the Prophet, peace be upon him, he said: 'And they therein will have taut smiles (Kalihun): He said the Fire burns him so his upper lip contracts until it reaches the middle of his head, and his lower lip hangs down until it strikes his navel.' In the book of Al-Tirmidhi, he said: The Messenger of Allah, peace be upon him, said: 'The thickness of the disbeliever's skin is forty-two cubits, his molar is like Uhud, and his seat in Hell is as the distance between Mecca and Medina.' In Sahih Muslim, he said: 'The molar of the disbeliever or the canine of the disbeliever is like Uhud, and the thickness of his skin is a three-day journey.' He said: 'The distance between the shoulders of the disbeliever in the Fire is a three-day journey for a fast rider.' It is narrated from Ibn Umar, may Allah be pleased with them both, that he said: The Messenger of Allah, peace be upon him, said: 'The disbeliever will drag his tongue a Farsakh or two, and people will tread on it.' In the book of Al-Tirmidhi and others from Anas, he said: The Messenger of Allah, peace be upon him, said: 'O people, weep! If you cannot weep, then pretend to weep. For the people of the Fire weep in the Fire until their tears flow",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 62
  },
  {
    "serial_number": "4940915",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 66,
    "volume_number": 1,
    "text": "on their faces like streams. Until the tears stop and blood flows, and the eyes become ulcerated. If ships were sailed in them (the tears/blood), they would sail.' It is related about Shaqiq Al-Balkhi that he was once rebuking his soul and advising it, saying: 'O Shaqiq, do not disobey Allah except according to what you can bear of His punishment. Work for your Hereafter according to your need for it. Seek provision according to your station in the world. And work for a home that has no end, for you will see when the dust clears whether under you is a horse or a donkey.' It is narrated that Al-Rabi' bin Khuthaym was going to Ibn Mas'ud and passed by a blacksmith's shop. He saw the iron heated in the bellows and fainted. He did not recover until the next day. When he recovered, he was asked about that. He said: 'I remembered the state of the people of the Fire in the Fire.' My brothers, correct your faith: which is the belief of the heart, and it is not considered except with the utterance of the two testimonies, so that you may be saved from eternity in the Fire of Hell. Be keen with every keenness to perform the perfection of the characteristics of Islam so that you may be saved from entering it at all. O worker for the Fire, your body is soft... So test it for practice in the heat of noon. And train it in the sting of wasps, daring... Against the bite of great snakes there. If you cannot endure, woe to you, what... Called you to anger the Lord of creation? You fight with abominations in the evening... And wake up in the garments of asceticism and chastity. So you are bolder against Him than creation... Due to what is in you of ignorance and malicious intent. You say with disobedience: My Lord is Forgiving... You spoke truth, but Forgiving by will. And your Lord is Provider just as He is Forgiving... So why did you not believe in both equally? For you hope for pardon without repentance... But do not hope for provision except with a trick. Although He guaranteed provision Himself... For everyone, but did not guarantee Paradise for everyone. My God, save us from our great sins... And do not disgrace us, and look upon us with mercy.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 63
  },
  {
    "serial_number": "4940916",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 67,
    "volume_number": 1,
    "text": "And take our forelocks to You and grant us... Certainty that protects us from every doubt and suspicion. My God, guide us among those You guided and take us... To the Truth on a clear path in the middle of the way. And be our preoccupation from every preoccupation, and our concern... And our desire from every concern and desire. And bless with a blessing without end upon the one... Whom You made as musk, the Seal of Prophecy.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 64
  },
  {
    "serial_number": "4940917",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 68,
    "volume_number": 1,
    "text": "Eternity in the Fire for Disbelievers. Allah Almighty said: (But they who disbelieved and denied Our signs - those are the companions of the Fire; they will abide therein eternally). [Al-Baqarah: 39]. In the book of Al-Tirmidhi from Abu Al-Darda', may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said: 'Hunger will be cast upon the people of the Fire, equaling the torment they are in. They will seek relief in food, so they will be relieved with food of Dari' (bitter thorny plant) which neither nourishes nor avails against hunger. They will seek relief in food, so they will be relieved with food that chokes. They will remember that they used to pass choking food in the world with drink, so they will seek relief in drink. Scalding water will be raised to them with iron hooks. When it approaches their faces, it roasts their faces. When it enters their bellies, it severs what is in their bellies. They will say: Call the keepers of Hell. They will say: Did there not come to you your messengers with clear proofs? They will say: Yes. They will say: Then pray; and the prayer of the disbelievers is only in error. He said: They will say: Call Malik. They will say: O Malik, let your Lord put an end to us. He said: He will answer them: Indeed, you will remain. Al-A'mash said: It is established that between their call and Malik's answer to them is a thousand years. He said: They will say: Call your Lord, for no one is better than your Lord. They will say: Our Lord, our wretchedness overcame us, and we were a people astray. Our Lord, remove us from it, and if we return, then indeed we are wrongdoers. He said: He will answer them: (Remain despised therein and do not speak to Me). He said: At that, they will despair of all good, and at that they will take to moaning, regret, and woe.' It is narrated that the flame of the Fire lifts the people of the Fire until they fly like sparks fly. When it lifts them, they overlook Paradise, and between them is a barrier. The people of Paradise call to the people of the Fire that we have...",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 65
  },
  {
    "serial_number": "4940918",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 69,
    "volume_number": 1,
    "text": "found what our Lord promised us to be true. Have you found what your Lord promised you to be true? They said: Yes. Then an announcer announced between them that the curse of Allah is on the wrongdoers. And the companions of the Fire called to the companions of Paradise: Pour upon us some water or from whatever Allah has provided you. They said: Indeed, Allah has forbidden them both to the disbelievers. So the angels of punishment return them with iron maces to the bottom of Hell. Some commentators said: This is the meaning of Allah Almighty's saying: (Every time they want to get out of it, they will be returned to it, and it will be said to them, 'Taste the punishment of the Fire which you used to deny'). [As-Sajdah: 20]. In Al-Kashshaf and Anwar al-Tanzil from Ibn Abbas, may Allah be pleased with them both: They have six calls when they enter the Fire. They say for a thousand years: (Our Lord, we have seen and heard, so return us [to the world]; we will work righteousness). They are answered: (But the word from Me has come into effect). They say for a thousand years: (They will say, 'Our Lord, You made us lifeless twice and gave us life twice, and we have admitted our sins. So is there to an exit any way?'). They are answered: (That is because, when Allah was called upon alone, you disbelieved). They say for a thousand years: (O Malik, let your Lord put an end to us). They are answered: (Indeed, you will remain). They say for a thousand years: (Our Lord, delay us for a short term; we will answer Your call). They are answered: (Did you not swear before that for you there would be no cessation?).",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 66
  },
  {
    "serial_number": "4940919",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 70,
    "volume_number": 1,
    "text": "They say for a thousand years: (Our Lord, remove us; we will do righteousness). They are answered: (Did We not grant you life enough for whoever would remember therein to remember, and the warner came to you?). They say for a thousand years: (My Lord, return me. That I might do righteousness in that which I left behind. No! It is only a word he is saying). They are answered: (Remain despised therein and do not speak to Me). Then they will have nothing therein except moaning, sighing, and howling. In Sahih Muslim from Abdullah bin Umar, may Allah be pleased with them both, that the Messenger of Allah, peace be upon him, said: 'When the people of Paradise arrive in Paradise and the people of the Fire in the Fire, Death will be brought until it is placed between Paradise and the Fire. Then it will be slaughtered. Then a caller will call out: O people of Paradise, no death! O people of the Fire, no death! So the people of Paradise will increase in joy upon their joy, and the people of the Fire will increase in sorrow upon their sorrow.' In the book of Al-Tirmidhi: If anyone were to die of joy, the people of Paradise would die; and if anyone were to die of sorrow, the people of the Fire would die. So fear Allah, O my brother, and do not belittle a sin, nor throw something like this behind your back, thinking that it only applies to disbelievers. For Al-Bukhari narrated in his Sahih that the Prophet, peace be upon him, said: 'O Bilal, stand up and announce: None shall enter Paradise except a believer.' And he, peace be upon him, said: 'Indeed, a servant may do the deeds of the people of the Fire while he is of the people of Paradise, and do the deeds of the people of Paradise while he is of the people of the Fire. Indeed, deeds are by their endings.'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 67
  },
  {
    "serial_number": "4940920",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 71,
    "volume_number": 1,
    "text": "Al-Ghazali, may Allah have mercy on him, said: Our Sheikh used to say: If (you consider) the state of the disbelievers and their eternity in the Fire, do not feel safe for yourself, for the matter is dangerous. You do not know what the outcome will be, nor what has been predestined for you in the judgment of the Unseen. Do not be deceived by the purity of times, for beneath them are obscure calamities. From Ibn Abbas, may Allah be pleased with them both, regarding the Almighty's saying: (So let those beware who dissent from the Prophet's order, lest fitnah strike them or a painful punishment). It is death other than martyrdom. [Text missing/garbled here in source, seemingly jumping to another narration] ... half a Dinar of good, bring him out. So they will bring out many people. Then they will say: Our Lord, we have not left therein anyone of those You ordered us [to save]. Then He will say: Return, and whoever you find in his heart an atom's weight... Abu Hafs Al-Haddad said: It is the messenger of disbelief, just as fever is the messenger of death. Hatim Al-Asamm said: Do not be deceived by a righteous place, for no place is more righteous than Paradise, yet Adam encountered in it what he encountered. Do not be deceived by abundance of worship, for Iblis after long worship encountered what he encountered. Do not be deceived by abundance of knowledge, for Balaam (Bal'am) knew the Greatest Name of Allah, so look at what he encountered. Do not be deceived by seeing the righteous, for no person is greater than Al-Mustafa (Muhammad), yet his relatives and enemies did not benefit from meeting him. From Abu Bakr Al-Warraq, may Allah have mercy on him, he said: Most often faith is stripped from the servant at death. We looked into sins and found none more stripping of faith than injustice against servants. Be content, may I be your ransom, with little... And adhere to the company of obscurity. Control your desire, striving... And step away from 'it was said' and 'he said'.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 68
  },
  {
    "serial_number": "4940921",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 72,
    "volume_number": 1,
    "text": "For you will be asked on the Day... The King gathers you, about the wick (futil - smallest thing). And a person is occupied by that... Away from the companion and friend. You must be requited for what you did... Of the small and the great. Step away as much as you can from your sins, morning and evening. If you desire the Gardens, and the shading shade of your Master. It says in 'Ikmal al-Mu'allim': Know that consensus has occurred that disbelievers do not benefit from their deeds, nor are they rewarded for them by lightening of punishment or by bliss. But by adding major sins, evil deeds, and harming believers to disbelief, they increase in punishment. As Allah Almighty said: (What put you into Saqar? They said, 'We were not of those who prayed. Nor did we used to feed the poor. And we used to enter into vain discourse with those who engaged in it. And we used to deny the Day of Recompense. Until there came to us the certainty.' So there will not benefit them the intercession of intercessors). [Al-Muddaththir: 42-48]. So the punishment of Abu Talib is not like the punishment of Abu Jahl. It is mentioned from Al-Hasan that the last one to exit the Fire is called Hannad; he was tortured for a thousand years calling out: 'O Hannan, O Mannan.' Al-Hasan wept and said: 'Would that I were Hannad.' They were amazed at him. He said: 'Woe to you, will he not exit one day?' No doubt, may Allah have mercy on him, he was knowledgeable about the rulings of the Hereafter. Yahya bin Mu'adh said: You do not know which of the two calamities is greater: missing the Gardens, or...",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 69
  },
  {
    "serial_number": "4940922",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 73,
    "volume_number": 1,
    "text": "...entering the Fires. As for Paradise, there is no patience away from it, and as for the Fire, there is no patience upon it. In any case, missing out on bliss is easier than enduring Hellfire. Then the Great Calamity and the Grand Disaster is in Eternity, for what heart can bear it and what soul can endure it?",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 70
  },
  {
    "serial_number": "4940923",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 74,
    "volume_number": 1,
    "text": "Paradise and the Bliss for its People. Allah Almighty said: (And give good tidings to those who believe and do righteous deeds that they will have gardens beneath which rivers flow. Whenever they are provided with a provision of fruit therefrom, they will say, 'This is what we were provided with before.' And it is brought to them in resemblance. And they will have therein purified spouses, and they will abide therein eternally). [Al-Baqarah: 25]. And the Foremost, meaning to migration or good. (And the Foremost are the Foremost. Those are the ones brought near [to Allah]. In the Gardens of Pleasure. A [large] company of the former peoples. And a few of the later peoples. On thrones woven [with gold and precious stones]. Reclining on them, facing each other. There will circulate among them young boys made eternal. With vessels, pitchers, and a cup [of wine] from a flowing spring. No headache will they have therefrom, nor will they be intoxicated. And fruit of what they select. And the meat of fowl, from whatever they desire. And [for them are] fair women with large, [beautiful] eyes. The likes of pearls well-protected. As reward for what they used to do. They will not hear therein ill speech or commission of sin. Only a saying: 'Peace, Peace'). [Al-Waqi'a: 10-26].",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 71
  },
  {
    "serial_number": "4940924",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 75,
    "volume_number": 1,
    "text": "(And the companions of the right - what are the companions of the right? Among lote trees with thorns removed.) Meaning it has no thorns or its branches are bent from the abundance of fruit. (And banana trees layered [with fruit].) Talh means bananas. Mandud means piled up with fruit from bottom to top. (And shade extended.) Meaning spread out or permanent. In the Hadith: 'In Paradise is a tree under whose shade a rider travels for a hundred years without crossing it.' (And water poured out.) Meaning flowing on the surface of the ground without a trench. (And fruit, abundant. Neither limited [to season] nor forbidden.) From anyone. (And upon beds raised high.) As between heaven and earth. ([Some] faces, that Day, will be radiant.) Possessing joy. (With their effort) in the world (satisfied.) In the Hereafter when they see its reward. (In an elevated garden.) In place or rank. (Wherein they will hear no unsuitable speech.) Laghw (vain talk). (Within it is a flowing spring. Within it are couches raised high.) Thick and high; if its owner wants to sit on it, it lowers for him then rises. (And cups put in place.) Before them. (And cushions) Pillows (set in rows.) Beside one another. (And carpets) Luxurious rugs (spread around.) Spread out.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 72
  },
  {
    "serial_number": "4940925",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 76,
    "volume_number": 1,
    "text": "In Sahih Muslim from Abu Huraira, may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said: 'Allah Almighty said: I have prepared for My righteous servants what no eye has seen, no ear has heard, and has not occurred to the heart of a human. Recite if you wish: (And no soul knows what has been hidden for them of comfort for eyes).' [As-Sajdah: 17]. Linguists say 'comfort for eyes' (Qurrat A'yun) expresses joy and seeing what a person loves and agrees with. In Sahih Al-Bukhari from Abu Huraira, may Allah be pleased with him, from the Prophet, peace be upon him: 'Indeed, in Paradise is a tree under whose shade a rider travels for a hundred years. Recite if you wish: (And shade extended). And the space of a bow of one of you in Paradise is better than what the sun rises upon or sets.' In the book of Al-Tirmidhi: 'There is no tree in Paradise except that its trunk is of gold.' In the book of Al-Tirmidhi from Abu Huraira, he said: I said, 'O Messenger of Allah, from what is creation created?' He said: 'From water.' We said, 'Paradise, what is its building?' He said: 'A brick of gold and a brick of silver, its mortar is musk of strong fragrance, its pebbles are pearls and rubies, and its soil is saffron. Whoever enters it is blessed and does not despair, lives eternally and does not die. Their youth does not fade, and their clothes do not wear out.' In Sahih Muslim: The Messenger of Allah, peace be upon him, said: 'The first group to enter Paradise will be in the form of the moon on the night of the full moon. The one following them will be like the light of a glittering star in the sky.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 73
  },
  {
    "serial_number": "4940926",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 77,
    "volume_number": 1,
    "text": "For every man among them are two wives; the marrow of their shanks can be seen from behind the flesh. And there is no bachelor in Paradise.' Also in it: '...They do not urinate, defecate, blow their noses, or spit. Their combs are gold, their sweat is musk, their incense burners are aloeswood, and their wives are houris with large beautiful eyes. Their character is upon the character of one man, in the form of their father Adam, sixty cubits in the sky.' Also in it: '...There is no disagreement among them nor hatred; their hearts are as one heart. They glorify Allah morning and evening.' In it he said: 'The people of Paradise eat and drink therein, but they do not spit, urinate, defecate, or blow their noses.' They said: 'Then what about the food?' He said: 'Belching and sweating like the sweat of musk. They are inspired to glorify and praise (Allah) as you are inspired to breathe.' In the Two Sahihs he said: 'The people of Paradise will look at the people of the chambers above them just as you look at a glittering star far away on the horizon from the East and West, due to the superiority between them.' They said: 'O Messenger of Allah, are those the stations of Prophets that no one else reaches?' He said: 'Nay, by the One in Whose hand is my soul, men who believed in Allah and believed the Messengers.' In the Musnad of Al-Bazzar from Abdullah bin Mas'ud, he said: The Messenger of Allah, peace be upon him, said: 'You will look at a bird in Paradise and desire it, so it will fall down roasted before you.' In the book of Al-Tirmidhi from Ali, may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said: 'In Paradise there are chambers whose outside is seen from their inside, and their inside from their outside.' A Bedouin stood up to him and said: 'For whom are they, O Messenger of Allah?' He said: 'For those who speak good words, feed food, persist in fasting, and pray at night while people are asleep.'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 74
  },
  {
    "serial_number": "4940927",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 78,
    "volume_number": 1,
    "text": "In the book of Al-Tirmidhi from Sa'd bin Abi Waqqas from the Prophet, peace be upon him, he said: 'If what a fingernail carries of what is in Paradise appeared, it would adorn what is between the corners of the heavens and the earth. And if a man from the people of Paradise looked out and his bracelets appeared, his light would obliterate the light of the sun just as the sun obliterates the light of the stars.' In the book of Al-Tirmidhi from Ali, may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said: 'In Paradise there is a market wherein there is no buying or selling, only images of men and women. So if a man desires an image, he enters it.' In the book of Al-Tirmidhi from Sulayman bin Buraydah from his father that a man said: 'O Messenger of Allah, are there horses in Paradise?' He said: 'If Allah admits you into Paradise, you will not wish to be carried therein on a horse of red ruby that flies with you in Paradise wherever you wish, except you will be carried.' A man asked him: 'O Messenger of Allah, are there camels in Paradise?' He said: 'If Allah admits you into Paradise, you will have therein whatever your soul desires and your eye delights in.' In the book of Al-Tirmidhi, he, peace be upon him, said: 'Whoever dies from the people of Paradise, young or old, they are returned to the age of thirty-three in Paradise; they never increase upon that ever. Likewise the people of the Fire.' And he said: 'Upon them are crowns; the lowest pearl of it illuminates what is between the East and West.' In the book of Al-Tirmidhi, he said: 'In Paradise are one hundred degrees; between every two degrees is like what is between the heaven and the earth. Al-Firdaws is the highest degree; from it the four rivers of Paradise gush forth, and above it is the Throne. So if you ask Allah, ask Him for Al-Firdaws.' It is narrated that the companions of Al-Thawri spoke to him about what they saw of his fear and effort and his pathetic state. They said: 'O teacher, if you decreased this effort, you would also attain your desire, God willing.' Sufyan said: 'How can I not strive when it has reached me that the people of Paradise will be in their dwellings when a light appears to them illuminating the eight Gardens. So they will think that light is from",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 75
  },
  {
    "serial_number": "4940928",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 79,
    "volume_number": 1,
    "text": "the Lord, Glory be to Him, and they will fall down prostrate. Then it will be called out to them: Raise your heads, it is not what you think; it is only the light of a bondwoman who smiled in the face of her master.' Then he recited: 'What harm is there for one whose dwelling is Firdaws... Whatever misery and poverty he endured? You see him walking sad, fearful, and timid... To the mosques walking in tatters. O soul, you have no patience for the Fire... The time has come for you to approach after turning away.' It was said to Wahb bin Munabbih: 'Is not \"There is no god but Allah\" the key to Paradise?' He said: 'Yes, but there is no key except that it has teeth. If you bring a key with teeth, it will open for you, otherwise it will not open for you.' Al-Bukhari mentioned it in his Sahih. It is narrated that Allah Almighty revealed to Moses: (How little shame has he who covets My Paradise without deeds. How can I bestow My mercy on one who is stingy with My obedience...). From Shahr bin Hawshab: Asking for Paradise without deeds is a sin among sins. Waiting for intercession without a cause is a type of delusion. And hoping for mercy from One who is not obeyed is folly and disappointment. From Rabi'ah Al-Adawiyyah that she used to recite: 'You hope for salvation but do not tread its paths... Indeed, the ship does not sail on dry land.' Sheikh Al-Yafi'i, may Allah have mercy on him, said: 'O wonder, we know of Fire and Paradise... Yet not for this do we yearn nor of that beware. If there is no fear, longing, or shame... Then what good remains in us to be mentioned? We are not patient with heat or affliction... So how can we endure the Fires, O people? Missing the Gardens of Eternity is the greatest regret... Over that let the regretful regret.'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 76
  },
  {
    "serial_number": "4940929",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 80,
    "volume_number": 1,
    "text": "'Fie upon us, fie, dogs of dunghills... To its stench we go early and do not reflect. We sell the significant for the worthless in blindness... And we have no intellect or enlightened heart. Blessed is he who is given contentment and piety... And spends his times in obedience to Allah.' O Allah, make us among the pious inheritors of Paradise, and do not deprive us of Your aid and mercy, O Possessor of Great Favor.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 77
  },
  {
    "serial_number": "4940930",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 81,
    "volume_number": 1,
    "text": "Description of the Houris (Hoor al-Ayn). Allah Almighty said: (And [for them are] fair women with large, [beautiful] eyes. The likes of pearls well-protected. As reward for what they used to do). [Al-Waqi'a: 22-24]. And Almighty said: (As if they were rubies and coral). [Ar-Rahman: 58]. And He said: (Indeed, We have produced the women of Paradise in a [new] creation. And made them virgins. Devoted [to their husbands] and of equal age. For the companions of the right). [Al-Waqi'a: 35-38]. In Sahih Muslim: The Messenger of Allah, peace be upon him, said: 'In Paradise, the believer will have a tent made of a single hollowed pearl, its length sixty miles. In each corner of it, the believer will have family whom the others do not see; the believer will circulate among them. And two gardens whose vessels and contents are of silver, and two gardens whose vessels and contents are of gold. And between the people and their looking at their Lord is only the Cloak of Pride on His Face in the Garden of Eden.' Meaning the attribute of Pride and Greatness; due to His Pride and Greatness, He does not want anyone of His creation to see Him until He permits them to enter the Garden of Eden, then they see Him therein. In Sahih Muslim he said: 'In Paradise there is a market they come to every Friday. The north wind blows and scatters (fragrance) on their faces and clothes, so they increase in beauty and comeliness. They return to their families having increased in beauty and comeliness. Their families say to them: By Allah, you have increased in beauty and comeliness.'",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 78
  },
  {
    "serial_number": "4940931",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 82,
    "volume_number": 1,
    "text": "In the book of Al-Tirmidhi he said: 'The first group to enter Paradise on the Day of Resurrection, the light of their faces is like the light of the moon on the night of the full moon. The second group is like the most beautiful glittering star in the sky. Each man among them has two wives; on each wife are seventy robes, the marrow of her shank is seen from behind them.' In the book of Al-Nasa'i from Anas, he said: The Messenger of Allah, peace be upon him, said: 'The believer in Paradise is given the strength of such and such in intercourse.' It was said: 'O Messenger of Allah, can he bear that?' He said: 'He is given the strength of a hundred.' In the book of Al-Tirmidhi from Ali, he said: The Messenger of Allah, peace be upon him, said: 'In Paradise there is a gathering for the Houris with voices the likes of which creatures have never heard. They say: We are the eternal ones who never perish, we are the luxurious ones who never become miserable, we are the pleased ones who never become angry. Blessed is he who belongs to us and to whom we belong.' In the book of Al-Tirmidhi: The Messenger of Allah, peace be upon him, said: 'A morning or evening journey in the path of Allah is better than the world and what is in it. And the space of a bow of one of you or the place of his hand in Paradise is better than the world and what is in it. If a woman from the people of Paradise looked at the people of the earth, she would illuminate what is between them and fill what is between them with fragrance. And the scarf on her head is better than the world and what is in it.' In Al-Sahih, Nasif is the Khimar (headcover). In the book of Al-Tirmidhi, the Messenger of Allah, peace be upon him, said: 'The lowest of the people of Paradise is he who has eighty thousand servants and seventy-two wives. A dome is set up for him of pearls, aquamarine, and ruby, as (large as) the distance between Al-Jabiyah and Sana'a.' In the Musnad of Al-Bazzar from Abu Huraira, may Allah be pleased with him, he said: It was said: 'O Messenger of Allah, do we have intercourse with our wives in Paradise?' He said: 'Yes, by the One in Whose hand is my soul, a man will have intercourse in one day with a hundred virgins.' From Abu Sa'id Al-Khudri, he said: The Messenger of Allah, peace be upon him, said: 'The people of Paradise, when they have intercourse with their wives, they return as virgins.' In Sahih Muslim from Al-Mughira bin Shu'ba, from the Prophet, peace be upon him, he said: 'Moses asked",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 79
  },
  {
    "serial_number": "4940932",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 83,
    "volume_number": 1,
    "text": "peace be upon him, his Lord: What is the lowest status of the people of Paradise? He said: He is a man who comes after the people of Paradise have entered Paradise. It is said to him: Enter Paradise. He says: O Lord, how? People have settled in their dwellings and taken their portions. It is said to him: Would you be pleased to have the like of the kingdom of a king of the kings of the world? He says: I am pleased, Lord. He says: This is for you and ten times like it, and for you is what your soul desires and your eye delights in. He says: I am pleased, Lord. He said: Lord, then what is their highest status? He said: Those are the ones whose honor I planted with My hand and sealed upon it. No eye has seen, no ear has heard, and has not occurred to the heart of a human.' He said: And its confirmation is from the Book of Allah Almighty: (And no soul knows what has been hidden for them of comfort for eyes). In Sahih Muslim from Abu Sa'id Al-Khudri, may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said: 'Allah Almighty says to the people of Paradise: O people of Paradise. They say: At Your service, our Lord, and at Your aid, and good is in Your hands. He says: Are you pleased? They say: Why should we not be pleased, O Lord, when You have given us what You have not given anyone of Your creation? He says: Shall I not give you better than that? They say: O our Lord, what thing is better than that? He says: I bestow My pleasure upon you, so I will never be angry with you after it.' Brothers: Leave the world and strive for the Hereafter. Reject the love of worldly women and buy the luxurious Houris, for they are attained with the easiest prices and will be with you eternally in the Gardens. It is narrated about Malik bin Dinar, may Allah be pleased with him, that he was walking one day in the alleys of Basra. Suddenly he saw a bondwoman of the kings riding with servants. When Malik saw her, he called out: 'O bondwoman, does your master sell you?' She said: 'How did you say, O Sheikh?' He said: 'Does your master sell you?' She said: 'Even if he sold me, would someone like you buy me?' He said: 'Yes, and better than you.' She laughed and ordered him to be carried to her house. He was carried. She entered upon her master and informed him. He laughed and ordered him to be brought in to him. He was brought in, and awe of him was cast into the master's heart.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 80
  },
  {
    "serial_number": "4940933",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 84,
    "volume_number": 1,
    "text": "He said: 'What is your need?' He said: 'Sell me your bondwoman.' He said: 'Can you afford her price?' He said: 'Her price with me is two rotten date pits.' They laughed. He said: 'How is her price with you this?' He said: 'Because of her many flaws.' He said: 'What are her flaws?' He said: 'If she does not wear perfume, she smells bad. If she does not use Siwak, her mouth smells. If she does not comb and oil, she gets lice and disheveled. If she lives a little long, she becomes decrepit. She has menstruation, feces, urine, filth, sadness, grief, and troubles. Perhaps she does not love you except for herself, and does not love you except for her comfort. She does not fulfill your covenant, nor is she true in your love. Anyone after you will succeed you over her only to see her as such. And I can take for less than what I asked for your bondwoman in price, a bondwoman created from the essence of camphor, musk, jewels, and light. If her saliva were mixed with the salty sea, it would become sweet. If a dead person were called by her speech, he would answer. If her wrist appeared to the sun, it would darken and eclipse before it. If it appeared in darkness, it would illuminate and shine. If she faced the horizons with her ornaments and robes, they would be perfumed and decorated. She grew up between gardens of musk and saffron, and branches of ruby and coral. She was confined in tents of bliss and fed with the water of Tasnim. She does not break her covenant, nor change her love. So which of them is more worthy of a higher price?' He said: 'The one you described.' He said: 'She is available for a price close to attain in every time.' He said: 'What is her price, may Allah have mercy on you?' He said: 'The easiest spent to attain the hoped-for good: That you empty an hour in your night to pray two Rak'ahs sincerely for your Lord. That your food is placed, you remember a hungry person, so you prefer him for the sake of Allah Almighty over your desire. That you remove a stone or harm (from the road). That you spend your days with sufficiency and little. And lift your concern from the abode of delusion and heedlessness. So you live the world with the honor of contentment and come to the station of dignity safe tomorrow, and descend into Paradise, the abode of bliss, in the neighborhood of the Generous Lord eternally.' He said: 'O bondwoman, did you hear what our Sheikh here said?' She said: 'Yes.' He said: 'Did he speak truth or lie?' She said: 'Rather, he spoke truth, was righteous, and advised.' He said: 'Then you are free for the sake of Allah Almighty. And an estate of such and such is",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 81
  },
  {
    "serial_number": "4940934",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 85,
    "volume_number": 1,
    "text": "charity upon you. And you, O servants, are free, and an estate of such and such is yours. And this house with what is in it is charity along with all my wealth in the path of Allah.' Then he extended his hand to a rough curtain on some of its doors, pulled it, took off all he was wearing, and covered himself with it. The bondwoman said: 'There is no life after you, O my master.' She threw off her clothes, wore a rough garment, and went out with him. Malik bin Dinar bid them farewell and prayed for them. He took a path, and they took another path. They worshipped together until death came and transported them in the state of worship. May Allah have mercy on them and be pleased with them, and benefit us through them and all the righteous. O Allah, make following them easy for us, deliver to us their openings, perpetuate for us their blessings, join us with them, resurrect us in their group, guide us with their guidance, and make us walk their path. Amen.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 82
  },
  {
    "serial_number": "4940935",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 86,
    "volume_number": 1,
    "text": "Seeing Allah, Blessed and Exalted, in Paradise. Allah Almighty said: ([Some] faces, that Day, will be radiant. Looking at their Lord. And [some] faces, that Day, will be contorted. Expecting that there will be done to them [something] backbreaking). [Al-Qiyamah: 22-25]. In Sahih Muslim from Suhayb from the Prophet, peace be upon him, he said: 'When the people of Paradise enter Paradise, Allah Blessed and Exalted says: Do you want anything I should increase you? They say: Did You not whiten our faces? Did You not admit us into Paradise and save us from the Fire? He said: Then the veil is lifted, and they look at the Face of Allah Almighty. They were not given anything more beloved to them than looking at their Lord.' Then he recited: (For those who have done good is the best [reward] and extra). Scholars said: The best reward (Al-Husna) is Paradise, and the extra (Al-Ziyadah) is looking at the Noble Face of Allah Almighty. O Allah, grant us that by Your grace. Imam Ahmad and Al-Tirmidhi narrated from Ibn Umar, may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said: 'The lowest of the people of Paradise in status is one who looks at his gardens, wives, bliss, servants, and couches for a distance of a thousand years. And the most honored of them to Allah is one who looks at His Face Almighty morning and evening.' Then he recited: ([Some] faces, that Day, will be radiant. Looking at their Lord). In the Two Sahihs from Jarir bin Abdullah, he said: 'The Messenger of Allah looked at the moon on the night of the full moon and said: You will see your Lord clearly just as you see this moon; you will not be crowded in seeing Him. If you are able not to be overcome in a prayer before sunrise and before its setting, then do so.' Then he recited: (And exalt [Allah] with praise of your Lord before the rising of the sun and before its setting). In the book of Al-Tirmidhi from",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 83
  },
  {
    "serial_number": "4940936",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 87,
    "volume_number": 1,
    "text": "Sa'id bin al-Musayyib that he met Abu Huraira and said: 'I ask Allah to gather me and you in the market of Paradise.' Sa'id said: 'Is there a market in it?' He said: 'Yes. The Messenger of Allah, peace be upon him, informed me that the people of Paradise, when they enter it, settle therein by virtue of their deeds. Then they are permitted for the duration of a Friday from the days of the world, so they visit their Lord. He reveals His Throne to them and appears to them in a garden of the gardens of Paradise. Pulpits of light, pulpits of pearls, pulpits of rubies, pulpits of aquamarine, pulpits of gold, and pulpits of silver are set up for them. Their lowest - and there is no lowest among them - sits on mounds of musk and camphor. They do not see that the owners of the chairs are in a better seating than them.' Abu Huraira said: I said, 'O Messenger of Allah, will we see our Lord?' He said: 'Yes. Do you doubt in seeing the sun and the moon on the night of the full moon?' We said: 'No.' He said: 'Likewise, you will not doubt in seeing your Lord. There will remain no one in that assembly but Allah will speak to him directly, until He says to a man among them: O so-and-so son of so-and-so, do you remember the day you said such and such? He reminds him of some of his betrayals in the world. He says: Did You not forgive me? He says: By the vastness of My forgiveness you reached this station of yours. While they are upon that, a cloud covers them from above and rains perfume upon them; they never found anything like its scent. Our Lord says: Rise to what I have prepared for you of honor and take what you desire. So they come to a market surrounded by angels, containing what eyes have never seen the like of, ears have never heard, and has not occurred to hearts. What we desire is gathered for us; nothing is sold therein nor bought. In that market, the people of Paradise meet one another.' He said: 'So the man of high status comes and meets one lower than him - and there is no lowest among them - and he is impressed by the clothing he sees (on the latter). His talk does not end until he imagines upon himself what is better than it. That is because it is not fitting for anyone to grieve therein. Then we return to our dwellings, and our wives meet us saying: Welcome and greetings. You have come, and you possess beauty better than what you left us with. We say: Indeed, we sat today with our Lord the Compeller, and we deserve to return with the like of what we returned with.' Some masters said: I saw a boy in the wilderness standing worshipping, with no one with him, cut off from habitation and people. I greeted him and said to him: 'O youth, you are without helper",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 84
  },
  {
    "serial_number": "4940937",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Preparation for Death and the Questioning of the Grave",
    "edition": "None",
    "publisher": "Dar Ibn Khaldun - Alexandria",
    "page_number": 88,
    "volume_number": 1,
    "text": "or companion.' He said: 'Yes, by His Might, the Helper and Companion is with me.' I said: 'Where is the Helper and Companion?' He said: 'He is above me with His power, with me with His knowledge and wisdom, before me with His guidance, on my right with His blessing, and on my left with His protection.' He said: When I heard this speech from him, I said to him: 'Would you like company?' He said: 'Far from it! Your company distracts me from His service, and I would not love for this to be mine even if I had the kingdom of the world from its east to its west.' I said to him: 'Do you not feel lonely in this place?' He said to me: 'O you, one whose Beloved and Companion is the Master, how can he feel lonely?' I said: 'Where do you eat from?' He said: 'O you, He who nourished me with His kindness in the darkness of the bowels when small, sponsored me when big. I have a known provision with Him, and it has a decreed time.' I asked him for supplication. He said to me: 'May Allah veil your eye from His disobedience, fill your heart with His fear, and not make you among those occupied by other than Him from His service.' Then he went to leave, so I clung to him and said to him: 'O my brother, when will I meet you?' He smiled and said: 'As for after this day of yours, do not tell yourself of it in the world. And on the Day of Resurrection, a day in which people gather, if you are among those who meet me, seek me in the group of those looking at Allah.' I said to him: 'And how did you know that?' He said: 'My Lord promised me that. That is because I lowered my gaze from looking at prohibitions, prevented my soul from partaking in desires, and secluded myself in His service in the dark nights.' Then he disappeared from me, and I did not see him. O Allah, make us among those characterized by these three qualities so we succeed in meeting You on the Day of Judgment, and among those to whom the keepers of Paradise say when they come to it: (Peace be upon you; you have become pure; so enter it to abide eternally). And may Allah bless our Master Muhammad and his family and companions and grant them peace. Completed with the praise of Allah and His success.",
    "foot_note": "None",
    "book_id": "483",
    "new_page_number": 85
  }
]