[
  {
    "text": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)\nAuthor: عبد العزيز العتيبي\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 1
  },
  {
    "text": "sn: 800\nbook_title: الحق والثبات في الأسماء والصفات\nbook_link: https://shamela.ws/book/225\nbook_id: 225\nauthor_name: عبد العزيز العتيبي\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/3161\nauthor_ID: 3161\neditor: Null\npublisher: دار الصميعي للنشر والتوزيع\nedition: الأولى، 1442 هـ - 2021 م\npages: 56\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: العقيدة\ncategory_id: 1",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 2
  },
  {
    "serial_number": "39656",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Creed (Aqeedah). Book: Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat. Preparation: Abdul Aziz Al-Otaibi. Publisher: Dar Al-Sumay'i for Publishing and Distribution. Edition: First, 1442 AH - 2021 AD. Number of Pages: 56 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 15 Jumada al-Akhirah 1443.\nBook: Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat. Preparation: Abdul Aziz Al-Otaibi. Publisher: Dar Al-Sumay'i for Publishing and Distribution. Edition: First, 1442 AH - 2021 AD. Number of Pages: 56 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 15 Jumada al-Akhirah 1443.\nPreparation: Abdul Aziz Al-Otaibi. Publisher: Dar Al-Sumay'i for Publishing and Distribution. Edition: First, 1442 AH - 2021 AD. Number of Pages: 56 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 15 Jumada al-Akhirah 1443.\n[Book numbering corresponds to the printed version]. Publication Date in Shamela: 15 Jumada al-Akhirah 1443.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 3
  },
  {
    "serial_number": "39657",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 5,
    "volume_number": 1,
    "text": "In the name of Allah, the Entirely Merciful, the Especially Merciful. Introduction. In the name of Allah, and praise be to Allah, and prayers and peace be upon the Messenger of Allah and upon all his companions. To proceed: I present to you this book about the names and attributes of Allah, and I have named it \"The Truth and Firmness Regarding Names and Attributes\" (Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat). It is a concise book so that it is easy for people to memorize it and understand its meanings. The virtue of knowledge about Allah's names and attributes and its importance in a Muslim's life is hidden from no one, for it is the noblest and best of sciences that a Muslim must know, because the honor of knowledge depends on the honor of the known subject. It is one of the three types of Tawheed (Monotheism), which are: 1 - Tawheed al-Rububiyyah (Unity of Lordship): Its meaning is \"singling out Allah, the Mighty and Majestic, in His actions, such as creation, sovereignty, giving life, causing death, sustenance, and the like.\" This type is acknowledged by all creation, even the disbelievers, but it alone does not benefit them. Rather, belief in the three types of Tawheed is necessary for them to enter Islam, as Allah the Exalted said informing about the polytheists: {And if you asked them, \"Who created the heavens and earth?\" they would surely say, \"Allah.\" Say, \"[All] praise is [due] to Allah\"; but most of them do not know.} [Luqman: 25].",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 4
  },
  {
    "serial_number": "39658",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 6,
    "volume_number": 1,
    "text": "Therefore, Tawheed al-Rububiyyah alone does not benefit the polytheists as long as they do not unify Allah in His Uluhiyyah \"worship\" and His Names and Attributes. 2 - Tawheed al-Uluhiyyah (Unity of Worship): Its meaning is \"singling out Allah in worship, such as prayer, fasting, supplication, sacrifice, seeking help, reliance, and other acts of worship.\" Whoever directs any type of worship to other than Allah has committed Shirk (polytheism) and his deeds are void. Tawheed al-Uluhiyyah implies Tawheed al-Rububiyyah, meaning that whoever worships Allah alone must have unified Him in His Lordship, because he worshipped Allah due to his belief that He alone is the Creator, the Provider, and the Sovereign. And Tawheed al-Rububiyyah necessitates Tawheed al-Uluhiyyah, meaning that whoever unifies Allah in His Lordship and believes that Allah is the Lord and Creator, this belief and this unification obligates him to unify Allah in His Worship. Tawheed of Names and Attributes encompasses both types because among Allah's names are (The Creator, The Provider, The King, The Lord) and this is Tawheed al-Rububiyyah, and among His names are also (Allah, The Forgiving, The Accepter of Repentance) and this is Tawheed al-Uluhiyyah. 3 - Tawheed al-Asma' wa al-Sifat (Unity of Names and Attributes): Its meaning is \"singling out Allah with His Beautiful Names and Exalted Attributes mentioned in the Quran and Sunnah without Tamthil (likening Him to creation), Tashbih (drawing resemblance), Tahrif (distortion), Ta'til (denial), or Takyif (asking how).\"",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 5
  },
  {
    "serial_number": "39659",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 7,
    "volume_number": 1,
    "text": "So our Lord, Blessed and Exalted, is One in His Lordship, His Divinity, and His Names and Attributes; He has no partner. Many people have gone astray in this chapter and have not been guided to the truth. So praise be to Allah who guided Ahl al-Sunnah wa al-Jama'ah to knowing His Names and Attributes in the correct manner. • • •",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 6
  },
  {
    "serial_number": "39660",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 8,
    "volume_number": 1,
    "text": "Some Rules Regarding Names and Attributes, Not All of Them. * First Rule: Allah's names are all beautiful (Husna) and imply complete attributes, as the Exalted said: {And to Allah belong the best names, so invoke Him by them} [Al-A'raf: 180]. And \"Husna\" is the plural of \"Ahsan\" (best), meaning they contain the utmost beauty. * Second Rule: Sheikh Ibn Uthaymin said in \"Al-Qawa'id al-Muthla\": Allah's names are proper names (A'lam) and descriptions (Awsaf); proper names considering their indication of the Essence (Dhat), and descriptions considering their indication of meanings. As for people's names, they are proper names because they indicate the person only. You might find someone named Karim (Generous) who is miserly, and someone named Adil (Just) who is unjust. But the names of Allah, the Glorified and Exalted, and the names of the Messenger (peace and blessings be upon him), the Holy Quran, and the Last Day contain descriptions. There is no name among Allah's names that is rigid (Jamid) \"not indicating a meaning,\" like \"Al-Dahr\" (Time) for example; it is not one of Allah's names. It was reported in the Hadith Qudsi that the Prophet (peace and blessings be upon him) said: Allah the Mighty and Majestic said: \"The son of Adam hurts Me; he curses Time (Al-Dahr), and I am Time; in My hand is the command, I turn the night and the day\" narrated by Al-Bukhari and Muslim. Night and day are time, so how can the One who turns (Muqallib - with Kasra on Lam) be the turned (Muqallab - with Fatha)? \"End of his words\".",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 7
  },
  {
    "serial_number": "39661",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 9,
    "volume_number": 1,
    "text": "Imam Al-Nawawi, may Allah have mercy on him, said: \"Because the Arabs used to curse Time when calamities and disasters befell them, while the One who manages affairs and causes calamities and events is Allah, not Time. So whoever curses the doer of calamities, this curse falls upon Allah and not on Time because it is created\" \"Sharh Muslim\" (15/3). It is known that Al-Dahr is a name for time and duration. * Third Rule: Enumerating Allah's names is one of the causes for entering Paradise, due to the Prophet's saying, peace and blessings be upon him: \"Indeed, Allah has ninety-nine names, one hundred minus one, whoever enumerates them enters Paradise\" narrated by Al-Bukhari and Muslim. The meaning of enumerating them mentioned in the hadith includes: 1 - Memorizing them. 2 - Knowing their meanings. 3 - Supplicating to Allah with them, like saying \"O Allah - O Rahim (Merciful)\". 4 - Acting according to their implications. For example: If you know He is Al-Ahad (The One), do not associate others with Him. And if you know He is Al-Rahim (The Merciful), do righteous deeds that would be a cause for His mercy upon you, because the implication of Al-Rahim is mercy.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 8
  },
  {
    "serial_number": "39662",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 10,
    "volume_number": 1,
    "text": "* Fourth Rule: There are names exclusive to Allah that no one else is allowed to be named with, such as: (Allah, Al-Ilah, Ar-Rahman, Al-Wahid, Al-Ahad, Ar-Rabb, Al-Khaliq, Al-Quddus, As-Subbuh, Al-Bari', As-Samad, Ar-Raziq, Al-Awwal, Al-Akhir, Az-Zahir, Al-Batin, Al-Qahir, Al-Mutakabbir, Al-Jabbar). Any of these names is impermissible for anyone other than Allah to be named with, even if not prefixed with \"Al\". As for other than these names, if the name is prefixed with \"Al\", it is not permissible for other than Allah to be named with it. If it is not prefixed with \"Al\" and the attribute is intended, it is not permissible. Also, if affirming the attribute implied by it is noted, it is not permissible. However, if the mere name is intended without intending the attribute and without noting the affirmation of the implied attribute, then it is permissible to be named with it. * Fifth Rule: There are attributes exclusive to Allah that cannot be applied to others, such as: (Doer of what He wills), (Gives life), (Causes death), and others. * Sixth Rule: Sharing the name and meaning between the Creator and the created does not indicate sharing in reality and modality (Kayfiyyah): For among Allah's names are Al-Alim (The All-Knowing) and Al-Hayy (The Living), but the Creator's knowledge is not like the created's knowledge,",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 9
  },
  {
    "serial_number": "39663",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 11,
    "volume_number": 1,
    "text": "and the Creator's life is not like the created's life because Allah has absolute perfection in His names and attributes, unlike the created whose names and attributes are deficient. If denying resemblance between the attributes of creatures themselves is a known matter, then denying resemblance between the Creator's attributes and creation's attributes is even more appropriate. * Seventh Rule: Allah's names and attributes are Tawqifiyyah (restricted to revelation): \"Meaning that affirming them depends on Sharia evidences, and there is no room for intellect in affirming them\" because the intellect cannot grasp what Allah deserves of names and attributes. So whatever the Sharia affirmed, we affirm, whatever the Sharia denied, we deny, and whatever it was silent about, we remain silent about \"Al-Qawa'id al-Muthla by Ibn Uthaymin\". * Eighth Rule: Ahl al-Sunnah wa al-Jama'ah affirm Allah's names and attributes without Takyif (asking how), Tahrif (distortion), Ta'til (denial), Tamthil (likening), or Tashbih (resemblance) \"Tafsir Ibn Kathir Surah Taha Verse 5\". As for Takyif, it is because no one knows the modality of Allah's attributes except Him, Glory be to Him. So whoever claims he knows how Allah comes on the Day of Resurrection or how He rose over His Throne is a liar. As for Ta'til, it means negating or denying the words or meanings of names and attributes, which is false. How can we deny a name or attribute that has been established in the Sharia for Allah",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 10
  },
  {
    "serial_number": "39664",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 12,
    "volume_number": 1,
    "text": "and the Messenger, peace and blessings be upon him, did not deny it from Him, and he is more knowledgeable about Allah's names and attributes than us? As for Tahrif, it is changing the words or meanings of names and attributes, which is also false and a lie against Allah. Its definition is \"diverting the word from its apparent meaning that comes to mind to another meaning without Sharia evidence.\" Examples of Tahrif include the ignorant saying that Allah's Hand means His favor and power, and that Istiwa (Rising) over the Throne means Istila (Seizing control). As for Tamthil and Tashbih, Allah, Glory be to Him, is free from resembling or being like creatures due to His saying, the Mighty and Majestic: {There is nothing like unto Him, and He is the Hearing, the Seeing} [Al-Shura: 11]. So we affirm that Allah has a Face but not like the faces of creatures, and He has Hearing that does not resemble or equal the hearing of creatures, for He hears everything, Glory be to Him, whereas the creature's hearing does not perceive all sounds. Allah's attributes have absolute perfection, while the creature's attributes are deficient. * Ninth Rule: The evidences of names and attributes must be affirmed according to their apparent meaning (Zahir) and reality, and we do not divert them from the apparent nor distort their meaning \"Al-Qawa'id al-Muthla by Ibn Uthaymin\". By apparent, we mean \"what comes to the mind from the meaning of the speech upon utterance.\" So the word must be affirmed along with the meaning that",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 11
  },
  {
    "serial_number": "39665",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 13,
    "volume_number": 1,
    "text": "it indicated, then delegating the knowledge of the modality (Kayfiyyah) to Allah, Glory be to Him. Sheikh Ibn Uthaymin, may Allah have mercy on him, said: It became famous among the Salaf like Malik bin Anas, Makhul, Al-Zuhri, Sufyan Al-Thawri, Al-Layth bin Sa'd, and Al-Awza'i the saying: \"Pass them as they came without 'how' (bila kayf).\" In their saying \"Pass them as they came\" is a refutation of the Mu'attilah (Deniers), and in their saying \"without how\" is a refutation of the Mumathilah (Likeness-makers). If they did not believe they had a meaning, they would have said: (Pass their wording and do not address their meaning) \"Majmu' Fatawa Ibn Uthaymin\". Listen to the saying of our Lord, Blessed and Exalted: {Say, \"My Lord has only forbidden immoralities - what is apparent of them and what is concealed - and sin, and oppression without right, and that you associate with Allah that for which He has not sent down authority, and that you say about Allah that which you do not know.\"} [Al-A'raf: 33]. The point of evidence is His saying: {and that you say about Allah that which you do not know}. * Tenth Rule: There are names mentioned paired together in the Quran such as: (The Pardoning, The Competent), (The Exalted in Might, The Wise), (The Free of need, The Praiseworthy), (The Hearing, The Seeing). The benefit of their pairing is that each name implies a perfect attribute, so if combined, a perfection upon perfection is achieved \"Al-Qawa'id al-Muthla by Ibn Uthaymin\". For example: (The Pardoning, The Competent), our Lord pardons out of capability, unlike the pardoning of some",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 12
  },
  {
    "serial_number": "39666",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 14,
    "volume_number": 1,
    "text": "people which might be out of weakness; also He is capable of pardoning, Glory be to Him. (The Exalted in Might, The Wise), His might does not necessitate injustice or oppression because it is paired with wisdom, and also His wisdom is not marred by humiliation. (The Free of need, The Praiseworthy), meaning He is praised by creation after He bestows favors upon them, for not every rich person is generous and giving. (The Hearing, The Seeing), these two names are often combined in the Quran because hearing and sight contain the meaning of encompassing and knowing creation. * Eleventh Rule: There are several differences between Names and Attributes: It came in the Fatwas of the Standing Committee for Fatwa (Allah's names are everything indicating Allah's Essence along with the attributes of perfection subsisting in it, such as Al-Sami' (The Hearing), Al-Alim (The Knowing), Al-Hakim (The Wise). These names indicated Allah's Essence and what subsisted in it of Hearing, Knowledge, and Wisdom. As for attributes, they are descriptions of perfection subsisting in the Essence, such as Knowledge, Wisdom, Hearing, and Sight. So the name indicated two things, and the attribute indicated one thing. It is said: The name contains the attribute and the attribute necessitates the name). Also, attributes are derived from names, but names are not derived from attributes. So we derive the attribute of Mercy from the name Al-Rahim, and the attribute of Knowledge from the name Al-Alim,",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 13
  },
  {
    "serial_number": "39667",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 15,
    "volume_number": 1,
    "text": "but we do not derive the names Al-Ja'i (The Comer) and Al-Makir (The Plotter) from the attributes of Coming (Maji') and Plotting (Makr). Names and Attributes share the permissibility of seeking refuge and swearing by them. So swearing by the Name is permissible, like saying (Wallahi - By Allah). And seeking refuge with it is permissible, like saying (A'udhu Billah - I seek refuge in Allah). Swearing by the Attribute is permissible, like saying (Wa Izzatillah - By Allah's Might). And seeking refuge with it is permissible, like saying (A'udhu bi Izzatillah - I seek refuge in Allah's Might). As for worship (naming oneself servant of) and supplication, they are specific to Names. So we say Abdul-Karim and do not say Abdul-Karam, and this is worship. And we supplicate using the Name and do not supplicate using the Attribute, so we say Ya Rahim (O Merciful) and do not say Ya Rahmatallah (O Mercy of Allah) because the attribute does not indicate the Essence, whereas the Name indicates the Essence. * Twelfth Rule: Attributes are divided in terms of perfection and deficiency into: First: Attributes of perfection with no deficiency; these we affirm for Allah as established in the Sharia, such as Knowledge, Hearing, and Mercy. Second: Attributes of deficiency; Allah the Exalted is never described with these, such as Sleep, Injustice, and others.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 14
  },
  {
    "serial_number": "39668",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 16,
    "volume_number": 1,
    "text": "Third: Attributes that can be perfection or deficiency depending on the situation and context in which they are mentioned. These are not described for Allah absolutely nor denied from Him absolutely. So we say: In the situation where they are perfection, Allah is described with them, and in the situation where they are deficiency, He is not described with them. Such as Makr (Plotting), Mukhada'ah (Deception), Kayd (Scheme), Mihal (Plan/Might), Istihza (Mockery), and Sukhriyah (Ridicule). They are attributes of perfection if the intended targets are Allah's enemies who started with them, indicating that Allah is capable of plotting against them and defeating them. These attributes were not mentioned for Allah in the Quran absolutely, but were mentioned restricted to disbelievers and hypocrites. So we say: It is among Allah's attributes, the Mighty and Majestic, that He plots against those who started plotting against Islam and Muslims and deceives those who started deceiving Him. And so is our saying regarding all attributes restricted to disbelievers and hypocrites; for Makr in its place is perfection and Deception in its place is perfection \"Al-Qawa'id al-Muthla by Ibn Uthaymin\". * Thirteenth Rule: If Allah's names indicate a transitive attribute, they imply three things: First: Affirming that name. Second: Affirming the attribute contained in this name.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 15
  },
  {
    "serial_number": "39669",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 17,
    "volume_number": 1,
    "text": "Third: Affirming its ruling and implication. Like Al-Sami' (The Hearing) - we affirm the name Al-Sami' and the attribute of Hearing, and we affirm the ruling and implication \"that Allah hears all sounds\". If they indicate an intransitive attribute, they imply only two things: • Affirming that name. • And affirming the attribute contained in this name. Like Al-Hayy (The Living), it implies the name Al-Hayy and the attribute of Life only. \"Al-Qawa'id al-Muthla by Ibn Uthaymin\". Allah's attributes are divided into sections based on different considerations: Section One: Considering affirmation and negation, they are two types: Affirmative (Thubutiyyah): These are what are affirmed in the Quran or authentic Hadiths, such as Life, Knowledge, and Rising over the Throne. It is obligatory to affirm them in a manner befitting Allah, Glory be to Him. Negative (Salbiyyah/Manfiyyah): These are what Allah denied from Himself or the Prophet, peace and blessings be upon him, denied from Allah. We deny these and affirm the perfection of their opposite, because negation alone is not perfection or praise unless it implies affirming the perfection of the opposite, and Allah cannot describe Himself except with perfection. For example, when you say:",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 16
  },
  {
    "serial_number": "39670",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 18,
    "volume_number": 1,
    "text": "\"O So-and-so, you are not cowardly and not miserly,\" this is not praise or commendation [unless implying bravery and generosity]. An example of this is denying injustice from Allah and affirming perfect justice, due to the saying of the Mighty and Majestic: {and your Lord does not wrong anyone} [Al-Kahf: 49]. And His saying, Glory be to Him: {No slumber seizes Him nor sleep} [Al-Baqarah: 255]. We deny slumber and sleep from Allah and affirm the perfection of His Life and Qayyumiyyah (Self-Subsisting/Sustaining). And the saying of the Mighty and Majestic: {But those who disbelieve say, \"The Hour will not come to us.\" Say, \"Yes, by my Lord, it will surely come to you - [Allah, who is] Knower of the unseen.\" Not absent from Him is an atom's weight within the heavens or within the earth or [what is] smaller than that or greater, except that it is in a clear register} [Saba: 3]. Nothing is absent from Him due to the perfection of His knowledge. The meaning of \"La Ya'zubu\" is \"does not become absent/hidden\" as Ibn Kathir, may Allah have mercy on him, said. This rule applies to all negative attributes. Section Two: Considering the evidence for their affirmation, they are two types: 1 - Report-based Attributes (Sifat Khabariyyah): These are attributes that can only be affirmed through hearing (Sam') and report (Khabar) from Allah the Mighty and Majestic or His Messenger, peace and blessings be upon him. They are called (Sam'iyyah or Naqliyyah attributes). They can be Dhatiyyah (Essence-related) like Face and Hands, or Fi'liyyah (Action-related) like Joy and Laughter. 2 - Heard-Intellectual Attributes (Sifat Sam'iyyah Aqliyyah): These are attributes affirmed by both",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 17
  },
  {
    "serial_number": "39671",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 19,
    "volume_number": 1,
    "text": "auditory evidence (textual) and intellectual evidence. They can be Dhatiyyah like Life, Knowledge, and Power, or Fi'liyyah like Creating and Giving. Section Three: Considering their relation to Allah's Essence and Actions, they are two types: 1 - Essential Attributes (Sifat Dhatiyyah): Allah has always been and continues to be described with them; they do not separate or detach from Allah's Essence, Glory be to Him, such as Knowledge, Power, Wisdom, Greatness, Hands, Eyes, and Face. 2 - Action Attributes (Sifat Fi'liyyah): Also called Optional Attributes (Sifat Ikhtiyariyyah). These are related to Allah's Will; He does them if He wills, Glory be to Him, such as Joy, Anger, Rising over the Throne, and Descending to the lowest heaven in the last third of the night. Action attributes are essential considering the origin of Allah's ability to do them, and action-based considering their specific occurrences. So they are ancient in type, renewed in occurrences. \"Islam Question and Answer website\". • • •",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 18
  },
  {
    "serial_number": "39672",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 20,
    "volume_number": 1,
    "text": "Some of Allah's Beautiful Names from the Quran and Sunnah, Not All of Them 1 - Allah: The One worshipped by right and deserving of worship. This name indicates all the Beautiful Names and Lofty Attributes, which is why Allah annexes all the Beautiful Names to His name \"Allah\", as in His saying: {And to Allah belong the best names, so invoke Him by them} [Al-A'raf: 180]. 2 - Al-Ilah: The same meaning as Allah. The meaning of the phrase \"La ilaha illa Allah\" is \"There is no deity worthy of worship except Allah\", and every deity other than Allah is false. It comprises affirmation and negation; the phrase (La ilaha) means negating the worship of anything other than Allah, and the phrase (illa Allah) means affirming worship for Allah alone. So a person's faith is not valid unless he disavows Shirk and Polytheists. 3 - Al-Malik (The King): The One who owns all creatures and disposes of them alone \"Tafsir Ibn Kathir Surah Al-Hashr verse 23\". 4 - Al-Malik (The Sovereign): Indicates the abundance of His sovereignty because it is on the scale of Fa'il, a form of exaggeration (intensification). 5 - Al-Rabb (The Lord): Meaning the Owner, the Master, and the One who reforms the affairs of creation. 6 - Al-Sayyid (The Master): Meaning the Owner, the Lord, and the Patron.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 19
  },
  {
    "serial_number": "39673",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 21,
    "volume_number": 1,
    "text": "7 - Al-Qadir (The Capable): He has complete power and nothing incapacitates Him, Glory be to Him. 8 - Al-Qadir (The All-Powerful): On the scale of Fa'il, a form of exaggeration in power. 9 - Al-Muqtadir (The Determiner/Omnipotent): The same meaning. 10 - Al-Fattah (The Opener/Judge): It has several meanings: • The Judge who judges between His servants with truth and justice through His decreed and legislative rulings. • The One who opens the doors of provision and mercy for creation. • The One who grants victory to the believers and supports the oppressed. 11 - Al-Qarib (The Near): Near to those who worship and call upon Him among the believers. 12 - Al-Mujib (The Responsive): The One who answers the supplication of the callers and gives them more than what they ask. 13 - Al-Khaliq (The Creator): Creation means estimation/determining. 14 - Al-Khallaq (The All-Creator): Indicates exaggeration (intensification) in creating. 15 - Al-Bari' (The Originator/Maker): Bar' is executing what He determined and bringing it into existence. 16 - Al-Musawwir (The Fashioner): He fashioned creatures in the forms He wanted, giving each creature a form that distinguishes it from others.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 20
  },
  {
    "serial_number": "39674",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 22,
    "volume_number": 1,
    "text": "So the order is Creation (Khalk), then Origination (Bar'), then Fashioning (Taswir); meaning (Estimation, then Execution, then Fashioning). See \"Tafsir Ibn Kathir Surah Al-Hashr Verse 24\". 17 - Al-Tayyib (The Good): The One purified from deficiency and evil because He is described with perfection. 18 - Al-Wasi' (The Vast/All-Encompassing): Vast in His knowledge, vast in His wealth and His favor upon creation. It encompasses all of Allah's attributes. 19 - Al-Awwal (The First): Before everything without limit, because He existed when nothing existed besides Him. 20 - Al-Akhir (The Last): After everything without end because He remains after the annihilation of creatures. So our Lord, Blessed and Exalted, is Azali \"not preceded by non-existence and has no beginning\" and Abadi \"has no end\". 21 - Az-Zahir (The Manifest/High): Manifest and High above everyone, and there is no one more manifest or higher than Him. 22 - Al-Batin (The Hidden/Internal): No one is closer to anyone than Him, and no one knows the inward aspects of matters like Him, Glory be to Him. The Prophet, peace and blessings be upon him, clarified them in the Hadith: \"O Allah, You are the First, so there is nothing before You; and You are the Last, so there is nothing after You; and You are the Manifest, so there is nothing above You; and You are the Hidden, so there is nothing below You\" narrated by Muslim.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 21
  },
  {
    "serial_number": "39675",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 23,
    "volume_number": 1,
    "text": "23 - Al-Ra'uf (The Compassionate): Ra'fah is the highest meaning of mercy. 24 - Al-Ghani (The Rich/Free of Need): Described with complete richness, independent of others, free of need for a child, wife, or partner, while all creation are in need and poverty towards Him. 25 - Al-Rafiq (The Gentle): Rifq in language is gentleness, which is the opposite of violence. 26 - Al-Mannan (The Bestower): From Mann which means giving. 27 - Al-Mu'ti (The Giver): He gives creation blessings like the blessing of guidance, intellect, food, and others. 28 - Al-Jamil (The Beautiful): Beautiful in His Essence, Names, and Attributes. 29 - Al-Hayiyy (The Modest/Shy): He leaves what does not befit His mercy and generosity. 30 - Al-Satir (The Concealer): He who covers people and does not expose them. 31 - Al-Wahhab (The Bestower): The One who gave His servants intellects, provisions, and all blessings. 32 - Al-Hasib (The Reckoner/Sufficer): Includes two things: First: He suffices those who rely on Him in all that concerns them. Second: He records deeds and then recompenses people for them. 33 - Al-Raziq (The Provider): The One who provided creation with what they need. Provision is not limited to money but includes intellects, children, spouses, and other things.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 22
  },
  {
    "serial_number": "39676",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 24,
    "volume_number": 1,
    "text": "34 - Al-Razzaq (The All-Provider): Indicates the abundance of His provisions because it is on the scale of Fa'al, a form of exaggeration. 35 - Al-Sami' (The Hearing): His hearing encompasses everything. 36 - Al-Basir (The Seeing): His sight encompasses everything. 37 - Al-Hakam (The Judge): Allah's judgment is of two types: First: Universal/Decreed Judgment, which is what happens to people of destinies like poverty, illness, marriage, and so on. And Second: Legislative Judgment, like making some things lawful and prohibiting others. 38 - Al-Hakim (The Wise): The One who places things in their correct places, and He is Wise in His actions and words. 39 - Al-Haqq (The Truth): Described with permanent existence. 40 - Al-Nasir (The Helper): He helps the believers against their enemy. 41 - Al-Wali (The Protector/Ally): The Helper and the One who takes charge of the believers' affairs. 42 - Al-Mawla (The Patron/Master): There are two types of Wilayah (Guardianship/Patronage): • General Wilayah for all creation: Meaning Master, Owner, and Lord. • Special Wilayah for believers: Meaning Helper.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 23
  },
  {
    "serial_number": "39677",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 25,
    "volume_number": 1,
    "text": "43 - Al-Hadi (The Guide): Guidance is of types: 1 - General guidance for all creation: He guided all creatures to what benefits them, even teaching animals how to earn their livelihood, as the Mighty and Majestic said: {He said, \"Our Lord is He who gave each thing its form and then guided [it].\"} [Taha: 50]. 2 - Guidance of Indication and Instruction: This is for all Jinn and Mankind, meaning defining the path of good and the path of evil. Our Lord revealed Books and sent Messengers to guide Mankind and Jinn. This is what is intended in His saying, Glory be to Him: {And We showed him the two ways} [Al-Balad: 10]. Prophets, callers, and reformers are capable of this, as Allah affirmed for the Messenger, peace and blessings be upon him, in His saying: {And indeed, you guide to a straight path} [Al-Shura: 52]. 3 - Guidance of Success (Tawfiq) specific to Muslims: By granting them success and making them accept the truth and choose it, as He, Glory be to Him, said: {So whoever Allah wants to guide - He expands his breast to [contain] Islam; and whoever He wants to misguide - He makes his breast tight and constricted as though he were climbing into the sky} [Al-An'am: 125].",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 24
  },
  {
    "serial_number": "39678",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 26,
    "volume_number": 1,
    "text": "And this, no one is capable of except Allah alone, as He, Glory be to Him, said addressing the Messenger, peace and blessings be upon him: {Indeed, [O Muhammad], you do not guide whom you like, but Allah guides whom He wills} [Al-Qasas: 56]. 4 - Guidance to Paradise and Hell: As for guiding Muslims to Paradise, it appeared in His saying, Glory be to Him: {And they will say, \"Praise to Allah, who has guided us to this; and we would never have been guided if Allah had not guided us.\"} [Al-A'raf: 43]. And it appeared in the saying of the Messenger, peace and blessings be upon him: \"By the One in whose hand is the soul of Muhammad, one of them is more guided to his dwelling in Paradise than he was to his dwelling in the world\" narrated by Al-Bukhari. Meaning they know their houses in Paradise more than they knew their houses in the world. This guidance is the fruit of the third guidance, meaning whoever attains the guidance of success attains guidance to Paradise. As for guiding the disbelievers to Hell, it appeared in His saying, Glory be to Him: {Gather those who committed wrong, their spouses, and what they used to worship (22) Other than Allah, and guide them to the path of Hellfire (23)} [Al-Saffat: 22-23].",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 25
  },
  {
    "serial_number": "39679",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 27,
    "volume_number": 1,
    "text": "Meaning lead them to the Fire, so they are driven to it on the Day of Resurrection. Allah's guidance of Muslims to Paradise is due to His grace, and His guidance of disbelievers to the Fire is due to His justice. 44 - Al-Hamid (The Praiseworthy): He is praised and extolled by His creation and deserves to be praised \"Tafsir Al-Tabari Surah Al-Baqarah verse 267\". 45 - Al-Mubin (The Clear/Evident): The One who clarifies to His servants the path of guidance and explains to them the deeds necessitating His reward and deeds necessitating His punishment, and Whose affair in His Oneness is clear and not hidden from anyone. 46 - Al-Dayyan (The Recompenser/Judge): He holds creation accountable for their deeds and recompenses them for them. 47 - Al-Karim (The Generous/Noble): Ibn Taymiyyah says in the interpretation of Surah Al-Alaq in Majmu' Al-Fatawa \"The term Karam is a term gathering virtues and praiseworthy traits; it does not mean mere giving, for giving is part of its full meaning\". 48 - Al-Akram (The Most Generous): Exaggeration in generosity. 49 - Al-Azim (The Great): His Essence and Attributes are great, and His creation glorifies Him. 50 - Al-Majid (The Glorious): From Majd which is abundant, vast, and great honor. Al-Majid indicates a multitude of descriptions and is not specific to a single attribute \"Bada'i' al-Fawa'id by Ibn al-Qayyim\".",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 26
  },
  {
    "serial_number": "39680",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 28,
    "volume_number": 1,
    "text": "51 - Al-Samad (The Eternal/Self-Sufficient Master): The One to Whom His creatures turn \"resort\" for their needs. 52 - Al-Hayy (The Living): Described with life that was not preceded by non-existence and is not followed by extinction. 53 - Al-Qayyum (The Self-Subsisting/Sustainer): Existing by Himself, Sustaining others, by Whom creatures, heavens, and earths exist. There is no existence for others except by His sustaining them, whereas He is independent of creation. 54 - Al-Wahid (The One): Meaning Allah is One in His Lordship, Divinity, and Names and Attributes; He has no partner, equal, or likeness. 55 - Al-Ahad (The One/Unique): The same meaning as Al-Wahid, but there are several differences between them: First: Al-Wahid is a name for the start of counting, so one says: one, two, three. As for Ahad, counting stops with it, so one does not say: Ahad, two, three. Second: Ahad in negation is more general than Wahid. So if it is said: There is no 'Wahid' (one) in the house, it is possible there are two or three or more. But if he says: There is no 'Ahad' (anyone) in the house, it negates the existence of the genus entirely, so there is not one, nor two, nor three, nor more, nor less. Third: The word Wahid can be made a description for anything intended, so it is correct to say: a Wahid man, and a Wahid garment. But it is not correct to describe anything in the context of",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 27
  },
  {
    "serial_number": "39681",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 29,
    "volume_number": 1,
    "text": "affirmation as Ahad except Allah the Unique (Al-Ahad), as He, Glory be to Him, said: {Say, \"He is Allah, [who is] One.\"} [Al-Ikhlas: 1]. So it is not said: a man Ahad nor a garment Ahad, as if Allah the Mighty and Majestic reserved this description for Himself. [Dorar Saniyyah Website]. 56 - Al-Latif (The Subtle/Kind): - Knows the hidden aspects of matters. - Is kind to His servants in ways hidden from them \"Tafsir Asma' Allah by Al-Sa'di and Tafsir Asma' Allah by Al-Zajjaj\". 57 - Al-Halim (The Forbearing): Who does not hasten punishment for the disobedient but gives him respite to repent. 58 - Al-Shakir (The Appreciative): Who does not waste the work of workers but rewards them for their deeds; an example of this is that He rewards a good deed with ten like it \"Al-Haqq Al-Wadih Al-Mubin by Abd al-Rahman Al-Sa'di\". 59 - Al-Shakur (The Most Appreciative): Indicates the abundance of His appreciation because it is on the scale of Fa'ul, a form of exaggeration. 60 - Al-Jawad (The Generous): Abundant in giving. 61 - Al-Hafiz (The Preserver/Guardian): He preserves all creation from calamities and hated things,",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 28
  },
  {
    "serial_number": "39682",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 30,
    "volume_number": 1,
    "text": "and preserves their deeds to recompense them on the Day of Resurrection, and preserves His believing allies from trials and misguidance. 62 - Al-Hafiz (The All-Preserver): Indicates the abundance of His preservation because it is on the scale of Fa'il, a form of exaggeration. 63 - Al-Raqib (The Watchful): Knows the hidden matters like actions of the hearts. 64 - Al-Shahid (The Witness): Knows the apparent matters like actions of the limbs. 65 - Al-Alim (The All-Knowing): Described with complete knowledge not preceded by ignorance and not followed by forgetfulness \"Al-Qawa'id al-Muthla by Ibn Uthaymin\". 66 - Al-Alim (The Knower): Same meaning. 67 - Al-Khabir (The Acquainted): Knows the apparent and hidden aspects of matters. 68 - Al-Aziz (The Mighty): Has several meanings: - Strong. - Dominant, so He defeats His enemies. - Inaccessible to harm from anyone, and this is exclusive to Allah alone, for no one else is immune to harm; even the strongest person is susceptible to harm and injustice. \"Tafsir Asma' Allah al-Husna by Al-Sa'di\". 69 - Al-Jabbar (The Compeller/Restorer): Has several meanings:",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 29
  },
  {
    "serial_number": "39683",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 31,
    "volume_number": 1,
    "text": "First: Jabr of Force, meaning He compels servants to what He wants and overpowers tyrants. Second: Jabr of Mercy, derived from Jabr meaning fixing something; so Allah fixes the poor with wealth and fixes the sick with healing. Third: Jabr of Loftiness, for He, Glory be to Him, is above His creatures. \"Fatawa Al-Aqeedah by Ibn Uthaymin\". 70 - Al-Mutakabbir (The Superior): Transcendent above every evil. \"Ibn Kathir Surah Al-Hashr verse 23\". 71 - Al-Kabir (The Grand): He is Grand in His Essence and Status, and everything else is small, which is why we say when mentioning Him (Allahu Akbar - Allah is Greater). 72 - Al-Qawi (The Strong): Possessor of strength that has no equal. 73 - Al-Matin (The Firm): Very Strong. 74 - Al-Barr (The Beneficent): With Fatha on Ba', He who is expansive in doing good for servants. 75 - Al-Muhit (The Encompassing): His knowledge encompasses everything and His power encompasses everything. 76 - Al-Wadud (The Loving): He loves His messengers and righteous servants, and Wudd is pure and tender love.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 30
  },
  {
    "serial_number": "39684",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 32,
    "volume_number": 1,
    "text": "77 - Al-Rahman (The Entirely Merciful): 78 - Al-Rahim (The Especially Merciful): The difference between them is that Al-Rahman indicates general mercy for all creation in the world and for Muslims in the Hereafter, and Al-Rahim indicates special mercy for Muslims in the world and the Hereafter. 79 - Al-Subbuh (The Perfect/Glorified): Purified from every deficiency and flaw, described with perfection. 80 - Al-Quddus (The Holy/Pure): Purified from every deficiency and flaw, described with perfection. 81 - Al-Salam (The Peace/Flawless): Whose Essence, Names, and Attributes are free from deficiency due to His description with perfection. \"Al-Quddus and Al-Salam see Tafsir Ibn Kathir Surah Al-Hashr\". 82 - Al-Mu'min (The Giver of Security/Faith): Who confirmed His prophets with miracles indicating their truthfulness, and confirmed the believers by granting them victory, accepting their faith, and rewarding them for it. 83 - Al-Ali (The High): Includes three things: - Highness of Essence: Because He is above His creation. - Highness of Status: Due to the perfection of His attributes. - Highness of Subjugation: He subjugated creation with His power. \"Sharh Asma' Allah by Sa'id Ali Al-Qahtani\".",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 31
  },
  {
    "serial_number": "39685",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 33,
    "volume_number": 1,
    "text": "84 - Al-A'la (The Most High): Exaggeration in Highness. 85 - Al-Muta'al (The Exalted): Same meaning. 86 - Al-Witr (The One/Odd): The One who has no partner in His Lordship, Divinity, and Names and Attributes. 87 - Al-Muqit (The Nourisher/Powerful): Al-Qadir (The Capable). 88 - Al-Muhaimin (The Guardian/Witness): Means The Watcher and The Witness. As Al-Zajjaji said in \"Ishtiqaq Al-Asma'\". 89 - Al-Wakil (The Disposer of Affairs): Has a general meaning for all creation: That Allah Glory be to Him took charge of managing the affairs of His creation. And has a special meaning for those who rely on Him among Muslims, that He preserves them and grants them victory. 90 - Al-Shafi (The Healer): Who heals from diseases of the bodies and heals from diseases of the hearts like Shirk, Kufr, hypocrisy, and envy. 91 - Al-Qahir (The Subjugator): Who subjugated the tyrants among His creation with punishment and subjugated all creation with death \"Sha'n Al-Du'a by Al-Khattabi\". And Who subjugated creatures with His authority and power, and they humbled themselves to Him, Glory be to Him. 92 - Al-Qahhar (The Prevailing): Exaggeration in subjugation.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 32
  },
  {
    "serial_number": "39686",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 34,
    "volume_number": 1,
    "text": "93 - Al-Afuww (The Pardoning): Who erases sins. 94 - Al-Ghafur (The Forgiving): Who conceals sins. 95 - Al-Ghaffar (The Perpetual Forgiver): On the scale of Fa'al, a form of exaggeration in forgiveness. 96 - Al-Tawwab (The Accepter of Repentance): Accepts repentance from those who repent. 97 - Al-Warith (The Inheritor): He who inherits creation and remains after their annihilation. 98 - Al-Muqaddim (The Promoter/Advancer): 99 - Al-Mu'akhkhir (The Delayer): They have two meanings: 1 - Cosmic advancing or delaying: Like advancing or delaying some creatures over others in provision or life spans. 2 - Legislative advancing or delaying: Like preferring Prophets over people and preferring Muslims over others, and legislative delaying like delaying disbelievers behind Muslims. • • •",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 33
  },
  {
    "serial_number": "39687",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 35,
    "volume_number": 1,
    "text": "Evidences of Names from the Holy Quran {He is Allah, other than whom there is no deity, the Sovereign, the Pure, the Perfection, the Bestower of Faith, the Overseer, the Exalted in Might, the Compeller, the Superior. Exalted is Allah above whatever they associate with Him. (23) He is Allah, the Creator, the Inventor, the Fashioner; to Him belong the best names. Whatever is in the heavens and earth is exalting Him. And He is the Exalted in Might, the Wise. (24)} [Al-Hashr: 23-24] {[All] praise is [due] to Allah, Lord of the worlds (2) The Entirely Merciful, the Especially Merciful (3)} [Al-Fatihah: 2-3] {Say, \"He is Allah, [who is] One, (2) Allah, the Eternal Refuge. (3)} [Al-Ikhlas: 1-2] {For those it is expected that Allah will pardon them, and Allah is ever Pardoning, Forgiving (99)} [An-Nisa: 99] {What would Allah do with your punishment if you are grateful and believe? And ever is Allah Appreciative and Knowing (147)} ... [An-Nisa: 147] {That He may give them in full their rewards and increase for them of His bounty. Indeed, He is Forgiving and Appreciative. (30)} [Fatir: 30] {Indeed, my Lord is near and responsive. (61)} [Hud: 61] {Indeed, He is Praiseworthy and Glorious. (73)} [Hud: 73] {Say, \"Our Lord will gather us together; then He will judge between us in truth. And He is the Knowing Judge. (26)} [Saba: 26]",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 34
  },
  {
    "serial_number": "39688",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 36,
    "volume_number": 1,
    "text": "{And He is the Forgiving, the Affectionate (14)} [Al-Buruj: 14] {But Allah is the best guardian, and He is the most merciful of the merciful. (64)} [Yusuf: 64] {There is nothing like unto Him, and He is the Hearing, the Seeing. (11)} [Al-Shura: 11] {And your god is one God. There is no deity [worthy of worship] except Him, the Entirely Merciful, the Especially Merciful. (163)} [Al-Baqarah: 163] {In a seat of honor near a Sovereign, Perfect in Ability. (55)} [Al-Qamar: 55] {Recite, and your Lord is the most Generous (3)} [Al-Alaq: 3] {Indeed, Allah is ever, over all things, an Accountant. (86)} [An-Nisa: 86] {And ever is Allah, over all things, an Observer. (52)} [Al-Ahzab: 52] {Indeed Allah is ever, over all things, a Witness. (55)} [Al-Ahzab: 55] {Does He who created not know, while He is the Subtle, the Acquainted? (14)} [Al-Mulk: 14] {And sufficient is your Lord as a guide and a helper. (31)} [Al-Furqan: 31] {Allah is Subtle with His servants; He gives provisions to whom He wills. And He is the Powerful, the Exalted in Might. (19)} [Al-Shura: 19] {Indeed, we used to supplicate Him before. Indeed, it is He who is the Beneficent, the Merciful. (28)} [At-Tur: 28] {Lord of the heavens and the earth and whatever is between them, the Exalted in Might, the Perpetual Forgiver. (66)} [Sad: 66] {Glorify the name of your Lord, the Most High (1)} [Al-A'la: 1]",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 35
  },
  {
    "serial_number": "39689",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 37,
    "volume_number": 1,
    "text": "{Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great. (255)} [Al-Baqarah: 255] {Do they not know that it is Allah who accepts repentance from His servants and receives charities and that it is Allah who is the Accepting of repentance, the Merciful? (104)} [At-Tawbah: 104] {That is because Allah is the Truth, and that what they call upon other than Him is falsehood, and because Allah is the Most High, the Grand. (30)} [Luqman: 30] {Knower of the unseen and the witnessed, the Grand, the Exalted. (9)} [Ar-Ra'd: 9] {And rely upon Allah; and sufficient is Allah as Disposer of affairs. (3)} [Al-Ahzab: 3] {That Day, Allah will pay them in full their deserved recompense, and they will know that it is Allah who is the evident Truth. (25)} ... [An-Nur: 25] {O mankind, what has deceived you concerning your Lord, the Generous, (6)} [Al-Infitar: 6] {And He is the subjugator over His servants. And He is the Wise, the Acquainted. (18)} [Al-An'am: 18] {The Day they come forth nothing concerning them will be concealed from Allah. To whom belongs [all] sovereignty this Day? To Allah, the One, the Prevailing. (16)} [Ghafir: 16] {Indeed, it is Allah who is the [continual] Provider, the firm possessor of strength. (58)} [Adh-Dhariyat: 58]",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 36
  },
  {
    "serial_number": "39690",
    "category_id": "1",
    "category": "Creed",
    "book_title": "The Truth and Steadfastness in the Names and Attributes",
    "edition": "First Edition, 1442 AH - 2021 CE",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 38,
    "volume_number": 1,
    "text": "{Indeed, your Lord—He is the All-Creator, the All-Knowing} (Al-Hijr: 86).\n\n{Whoever intercedes with a good intercession will have a share of it, and whoever intercedes with an evil intercession will have a portion of it. And Allah is Ever, over all things, Keeper} (An-Nisa: 85).\n\n{And to Solomon We subjected the stormy wind, which ran by his command to the land We had blessed. And We are All-Knowing of all things} (Al-Anbiya: 81).\n\n{The example of those who spend their wealth in the path of Allah is like a single grain that sprouts seven ears; in every ear is a hundred grains. And Allah multiplies for whom He wills. And Allah is All-Encompassing, All-Knowing} (Al-Baqarah: 261).\n\n{He is the First and the Last, the Most High and the Most Near; and He is All-Knowing of all things} (Al-Hadid: 3).\n\n{Our Lord, do not let our hearts deviate after You have guided us, and grant us mercy from Yourself. Indeed, You are the Bestower} (Aal 'Imran: 8).\n\n{O mankind, you are in need of Allah, while Allah is the Independent, the Praiseworthy} (Fatir: 15).\n\n{And were it not for the favor of Allah upon you and His mercy—and that Allah is Ever Compassionate, Merciful} (An-Nur: 20).\n\n{To Allah belongs the dominion of the heavens and the earth, and Allah is over all things Powerful} (Aal 'Imran: 189).\n\n{So We determined—and how excellent are We at determining} (Al-Mursalat: 23).\n\n{He said: 'The All-Knowing, the All-Aware has informed me'} (At-Tahrim: 3).",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 37
  },
  {
    "serial_number": "39691",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 39,
    "volume_number": 1,
    "text": "{And it is He who sends down the rain after they had despaired and spreads His mercy. And He is the Protector, the Praiseworthy. (28)} [Al-Shura: 28] {Then they are returned to Allah, their true Master. Unquestionably, His is the judgment, and He is the swiftest of accountants. (62)} [Al-An'am: 62]. The meaning of Al-Mawla here is the general Wilayah (Guardianship) over all creation. {But if they turn away, then know that Allah is your Protector. Excellent is the Protector, and Excellent is the Helper. (40)} [Al-Anfal: 40]. The meaning of Al-Mawla here is the special Wilayah for Muslims. {Indeed my Lord is, over all things, Guardian. (57)} [Hud: 57] {Unquestionably, they are in doubt about the meeting with their Lord. Unquestionably, He is, of all things, encompassing. (54)} [Fussilat: 54] {Allah does not impose blame upon you for what is unintentional in your oaths, but He imposes blame upon you for what your hearts have earned. And Allah is Forgiving and Forbearing. (225)} [Al-Baqarah: 225] {And indeed, it is We who give life and cause death, and We are the Inheritor. (23)} [Al-Hijr: 23] • • •",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 38
  },
  {
    "serial_number": "39692",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 40,
    "volume_number": 1,
    "text": "Evidences of Names from Prophetic Hadiths \"Indeed, Allah is the Judge (Al-Hakam), and to Him belongs judgment.\" Narrated by Abu Dawud, Al-Nasa'i, and Al-Hakim. \"Indeed, Allah the Mighty and Majestic is Modest (Hayiyy) and Concealing (Satir); He loves modesty and concealment. So when any of you bathes, let him conceal himself.\" Narrated by Abu Dawud, Al-Nasa'i, and Ahmad. The Prophet, peace and blessings be upon him, heard a man saying: \"O Allah, I ask You by virtue of the fact that all praise is due to You; there is no deity but You alone, You have no partner; The Bestower (Al-Mannan), O Originator of the heavens and the earth, O Owner of Majesty and Honor, O Ever-Living, O Self-Subsisting, I ask You for Paradise and seek refuge in You from the Fire.\" The Prophet, peace and blessings be upon him, said: \"He has asked Allah by His Greatest Name, by which if He is asked, He gives, and if He is called upon, He answers.\" Narrated by Abu Dawud, Al-Tirmidhi, Al-Nasa'i, and Ibn Majah, and the wording is his. \"Indeed, Allah is Beautiful (Jamil) and loves beauty.\" Narrated by Muslim. \"Indeed, Allah is Gentle (Rafiq) and loves gentleness.\" Narrated by Muslim. \"The Master (Al-Sayyid) is Allah, Blessed and Exalted.\" Narrated by Ahmad and Abu Dawud, and the wording is his. \"O Allah, forgive me what I have sent forth and what I have left behind, what I have concealed and what I have declared, what I have exceeded in, and what You are more knowing of than I. You are the Promoter (Al-Muqaddim) and You are the Delayer (Al-Mu'akhkhir); there is no deity except You.\" Narrated by Muslim.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 39
  },
  {
    "serial_number": "39693",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 41,
    "volume_number": 1,
    "text": "\"Whoever Allah intends good for, He gives him understanding of the religion. And Allah is the Giver (Al-Mu'ti) and I am the distributor (Al-Qasim).\" Narrated by Al-Bukhari - and the wording is his - and Muslim. \"Indeed, Allah is One (Witr) and loves the odd number.\" Narrated by Al-Bukhari and Muslim. From Abdullah bin Unais, may Allah be pleased with him, who said: I heard the Messenger, peace and blessings be upon him, say: \"People - or he said: The servants - will be gathered on the Day of Resurrection naked, uncircumcised, and 'Buhma'.\" He said: We said: What is 'Buhma'? He said: \"They have nothing with them. Then He will call out to them with a voice that the one far away hears just as the one near hears: I am the King (Al-Malik), I am the Recompenser (Al-Dayyan). It is not fitting for anyone of the people of Hell to enter Hell while he has a right owed to him by anyone of the people of Paradise until I settle it from him. Nor is it fitting for anyone of the people of Paradise to enter Paradise while anyone of the people of Hell has a right owed to him until I settle it from him, even a slap.\" He said: We said: How, when we come to Allah the Mighty and Majestic naked, uncircumcised, and having nothing? He said: \"By good deeds and bad deeds.\" Narrated by Ahmad. \"Perfect (Subbuh), Holy (Quddus), Lord of the angels and the Spirit.\" Narrated by Muslim, Abu Dawud, and Al-Nasa'i. \"Remove the harm, O Lord of mankind, heal and You are the Healer (Al-Shafi); there is no healing but Your healing, a healing that leaves no illness.\" Narrated by Al-Bukhari and Muslim.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 40
  },
  {
    "serial_number": "39694",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 42,
    "volume_number": 1,
    "text": "\"O people, indeed Allah is Good (Tayyib) and does not accept except what is good.\" Narrated by Muslim. From Anas bin Malik, may Allah be pleased with him, who said: The people said: O Messenger of Allah, prices have risen, so fix the prices for us. The Messenger, peace and blessings be upon him, said: \"Indeed, Allah is the Price-Fixer (Al-Musa'ir), the Withholder (Al-Qabid), the Extender (Al-Basit), the Provider (Al-Raziq), and I hope to meet Allah while no one among you demands of me an injustice regarding blood or wealth.\" Narrated by Abu Dawud, Al-Tirmidhi, and Ibn Majah. \"Indeed, Allah the Exalted is Generous (Jawad) and loves generosity.\" Narrated by Al-Bayhaqi in Shu'ab Al-Iman and Abu Nu'aym in Al-Hilyah. • • •",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 41
  },
  {
    "serial_number": "39695",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 43,
    "volume_number": 1,
    "text": "Some Attributes of Allah from the Quran and Sunnah, Not All of Them. Attribute of the Face: Allah the Mighty and Majestic said: {And there will remain the Face of your Lord, Owner of Majesty and Honor (27)} [Al-Rahman: 27]. Allah's Face is not like the faces of creation because He is exalted above resemblance to creatures. Attribute of the Two Eyes: The Prophet, peace and blessings be upon him, said: \"Indeed, Allah is not hidden from you; indeed, Allah is not one-eyed - and he pointed with his hand to his eye - and indeed the False Messiah (Al-Masih Al-Dajjal) is blind in the right eye, as if his eye were a floating grape.\" Narrated by Al-Bukhari. Also His saying, the Exalted: {Sailing under Our eyes as reward for he who had been denied (14)} [Al-Qamar: 14]. Meaning the ship was under the sight and protection of Allah \"Tafsir Al-Baghawi\". And His saying, the Mighty and Majestic: {And I bestowed upon you love from Me that you would be brought up under My eye (39)} [Taha: 39]. Meaning Moses's upbringing was under the sight and protection of Allah \"Tafsir Al-Tabari\". Just as we say: \"This thing happened under my eye,\" meaning it happened while I was seeing it with my eye and guarding it. This is known in the speech of the Arabs. It is not understood from this that the ship is inside Allah's eye or that Moses is attached to Allah's eye, because Allah, Glory be to Him, is on His Throne, and the Throne is above all creation, as the Exalted said: {The Most Merciful",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 42
  },
  {
    "serial_number": "39696",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 44,
    "volume_number": 1,
    "text": "rose over the Throne (5)} [Taha: 5]. Attribute of the Two Hands: We affirm them according to their apparent meaning and reality, so we do not distort their meaning nor do we know their modality (how they are), because their modality is known only to Allah. The Mighty and Majestic said: {And the Jews say, \"The hand of Allah is chained.\" Chained are their hands, and cursed are they for what they said. Rather, both His hands are extended; He spends however He wills.} [Al-Ma'idah: 64]. The extension of the hands indicates abundance of giving \"Tafsir Al-Tabari\". And the Exalted said: {Blessed is He in whose hand is dominion, and He is over all things competent (1)} ... [Al-Mulk: 1]. And He also said: {Do they not see that We have created for them from what Our hands have made, grazing livestock, so then they are their owners? (71)} [Ya-Sin: 71]. The attribute of Hand for Allah was mentioned in the singular, dual, and plural forms. It does not mean He has one or more than two, because the singular annexed [to Allah] is general, so it encompasses every hand affirmed for Allah. As for the plural form, it is intended for glorification. Similarly, the attribute of Eye came in singular, dual, and plural forms. So we affirm that Allah has two eyes and two hands. Attribute of the Palm (Kaff): The Messenger, peace and blessings be upon him, said: \"No one gives charity from good (lawful) earnings - and Allah does not accept except what is good - but that the Most Merciful takes it with His right hand. Even if it is a date, it grows in the palm of the Most Merciful until it becomes greater than a mountain, just as one of you raises his foal or young camel.\" Narrated by Muslim.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 43
  },
  {
    "serial_number": "39697",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 45,
    "volume_number": 1,
    "text": "Attribute of the Leg/Foot (Rijl): Al-Bukhari and Muslim narrated that the Prophet, peace and blessings be upon him, said: \"Paradise and Hell argued. Hell said: I have been favored with the arrogant and the tyrants. Paradise said: What is wrong with me that only the weak and the downtrodden of people enter me? Allah the Blessed and Exalted said to Paradise: You are My mercy; I show mercy through you to whom I will of My servants. And He said to Hell: You are only My punishment; I punish through you whom I will of My servants. And for each of you is its fill. As for Hell, it will not be filled until He places His Foot (Rijl) [in it/over it], and it will say: Enough! Enough! (Qat Qat). Thereupon it will be filled and its parts will be gathered together, and Allah the Mighty and Majestic will not wrong anyone of His creation. As for Paradise, Allah the Mighty and Majestic will create a creation for it.\" And the wording of Muslim is: \"As for Hell, it will not be filled so He places His Foot (Qadam) over it.\" Attribute of the Two Feet (Qadamayn): Ibn Abbas, may Allah be pleased with them both, said: \"The Kursi is the place of the two feet, and the Throne - no one can estimate its measure.\" Narrated by Ibn Khuzaymah in \"Al-Tawhid\" and Al-Hakim in \"Al-Mustadrak\". Attribute of the Fingers: \"A rabbi came to the Messenger, peace and blessings be upon him, and said: O Muhammad - or O Abu Al-Qasim - indeed Allah the Exalted will hold the heavens on the Day of Resurrection on a finger, the earths on a finger, the mountains and trees on a finger, the water and soil on a finger, and all other creation on a finger. Then He will shake them and say: I am the King, I am",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 44
  },
  {
    "serial_number": "39698",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 46,
    "volume_number": 1,
    "text": "the King. The Messenger, peace and blessings be upon him, laughed in amazement at what the rabbi said, confirming him. Then he recited the saying of Allah, Glory be to Him: {They have not appraised Allah with true appraisal, while the earth entirely will be [within] His grip on the Day of Resurrection, and the heavens will be folded in His right hand. Exalted is He and high above what they associate with Him (67)} [Az-Zumar: 67].\" Narrated by Muslim. Attribute of the Shin (Saq): The Exalted said: {The Day the shin will be uncovered and they are invited to prostration but the disbelievers will not be able} [Al-Qalam: 42]. On the Day of Resurrection, Allah will uncover His Shin, and the believers will prostrate to Him. But those who used to prostrate in the world for showing off and reputation will not be able to prostrate to Allah on the Day of Resurrection \"Tafsir Ibn Kathir\". Attribute of Ma'iyyah (Togetherness/Withness), which is of two types: 1 - General Ma'iyyah for all creation: Meaning Knowledge and Encompassing of creatures. It comes in the context of recompense, accountability, and intimidation. This is what is intended in His saying, Glory be to Him: {It is He who created the heavens and earth in six days and then established Himself above the Throne. He knows what penetrates into the earth and what emerges from it and what descends from the heaven and what ascends therein; and He is with you wherever you are. And Allah, of what you do, is Seeing.} ... [Al-Hadid: 4]. 2 - Special Ma'iyyah for Muslims: Meaning that Allah is with them through His help, preservation,",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 45
  },
  {
    "serial_number": "39699",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 47,
    "volume_number": 1,
    "text": "and support. It comes in the context of praise and commendation. It was mentioned in the saying of the Mighty and Majestic: {If you do not aid the Prophet - Allah has already aided him when those who disbelieved had driven him out [of Makkah] as one of two, when they were in the cave and he said to his companion, \"Do not grieve; indeed Allah is with us.\" And Allah sent down his tranquillity upon him and supported him with angels you did not see and made the word of those who disbelieved the lowest, while the word of Allah - that is the highest. And Allah is Exalted in Might and Wise. (40)} [At-Tawbah: 40]. Ma'iyyah in both its types does not imply incarnation (Hulul) or mixing (Ikhtilat) because Allah is on His Throne, and the Throne is above all creation. There is no contradiction between His highness (Uluww) and His being with His creation (Ma'iyyah). Among Allah's attributes is that He is the Doer of what He wills, due to His saying: {Doer of what He wills} [Al-Buruj: 16]. This is an attribute exclusive to Allah and does not befit anyone else, for every creature must be incapable of doing some things he wants, no matter how great his power and dominion. Attribute of Makr (Plotting/Planning) against those who plot against Him or against the Messenger and Muslims: The Exalted said: {And they plan, and Allah plans. And Allah is the best of planners.} [Al-Anfal: 30]. Attribute of Mukhada'ah (Deception) against those who try to deceive Him: The Exalted said: {Indeed, the hypocrites [think to] deceive Allah, but He is deceiving them. And when they stand for prayer, they stand lazily, showing [themselves to] the people and not remembering Allah except a little} [An-Nisa: 142].",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 46
  },
  {
    "serial_number": "39700",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 48,
    "volume_number": 1,
    "text": "Attribute of Shadid Al-Mihal (Severe in Plan/Might) against those who plot against Him: The Exalted said: {And the thunder exalts [Allah] with praise of Him - and the angels [as well] from fear of Him - and He sends thunderbolts and strikes therewith whom He wills while they dispute about Allah; and He is severe in assault.} [Ar-Ra'd: 13]. Attribute of Kayd (Scheme) against those who scheme against Him: The Exalted said: {Indeed, they are planning a plan (15) But I am planning a plan (16)} [At-Tariq: 15-16]. Attribute of Istihza' (Mockery) against those who mock the believers: The Exalted said: {And when they meet those who believe, they say, \"We believe\"; but when they are alone with their evil ones, they say, \"Indeed, we are with you; we were only mockers.\" (14) [But] Allah mocks them and prolongs them in their transgression [while] they wander blindly. (15)} [Al-Baqarah: 14-15]. Attribute of Sukhriyah (Ridicule) against those who ridicule the believers: The Exalted said: {Those who criticize the contributors among the believers concerning [their] charities and [criticize] those who find nothing [to spend] except their effort, so they ridicule them - Allah will ridicule them, and they will have a painful punishment. (79)} [At-Tawbah: 79]. Makr, Mukhada'ah, Kayd, Mihal, Istihza', and Sukhriyah are attributes restricted to disbelievers and are not absolute attributes \"Ibn Uthaymin in Lum'at al-I'tiqad\". Attribute of Ghadab (Anger): The Exalted said: {Have you not considered those who make allies of a people with whom Allah has become angry? They are neither of you nor of them, and they swear to untruth while they know [they are lying]. (14)} [Al-Mujadilah: 14].",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 47
  },
  {
    "serial_number": "39701",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 49,
    "volume_number": 1,
    "text": "Attribute of Sukht (Displeasure/Wrath): The Exalted said: {You see many of them becoming allies of those who disbelieved. How wretched is that which they have put forth for themselves in that Allah has become angry with them, and in the punishment they will abide eternally. (80)} [Al-Ma'idah: 80]. The difference between them is that Anger (Ghadab) can be from a superior to an inferior and from an inferior to a superior, while Wrath (Sukht) is only from a superior to an inferior. As it is said: The Emir was displeased (Sakhita) with the chamberlain, but it is not said: The chamberlain was displeased with the Emir. Attribute of Asaf (Regret/Wrath): The Exalted said: {And when they angered Us (Asafuna), We took retribution from them} [Az-Zukhruf: 55]. Asaf here means severe anger. Attribute of Karahiya (Dislike/Hatred): The Exalted said: {And if they had intended to go forth, they would have prepared for it [some] preparation. But Allah disliked their being sent, so He kept them back, and they were told, \"Remain [behind] with those who remain.\"} [At-Tawbah: 46]. Attribute of Bughd (Hatred): The Prophet, peace and blessings be upon him, said: \"The most beloved of places to Allah are mosques, and the most hated of places to Allah are markets.\" Narrated by Muslim. Attribute of Maqt (Odium/Abhorrence): Maqt is intense hatred. The Exalted said: {It is most hateful in the sight of Allah that you say what you do not do. (3)} [As-Saff: 3].",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 48
  },
  {
    "serial_number": "39702",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 50,
    "volume_number": 1,
    "text": "Attribute of Intiqam (Retribution/Revenge): The Exalted said: {Indeed, We will take retribution from the criminals. (22)} [As-Sajdah: 22]. Attribute of La'n (Cursing): The Exalted said: {Say, \"Shall I inform you of [what is] worse than that as penalty from Allah? [It is that of] those whom Allah has cursed and with whom He became angry and made of them apes and pigs and slaves of Taghut. Those are worse in position and further astray from the sound way.\" (60)} [Al-Ma'idah: 60]. Cursing is expulsion and distancing from Allah's mercy. Attribute of Batsh (Seizure/Grip): The Exalted said: {Indeed, the seizure of your Lord is severe. (12)} [Al-Buruj: 12]. Meaning that Allah seizes the unjust with punishment. Attribute of Nur (Light): His Essence is Light and His Face is Light, Glory be to Him. The Exalted said: {And the earth will shine with the light of its Lord, and the record [of deeds] will be placed, and the prophets and the witnesses will be brought, and it will be judged between them in truth, and they will not be wronged. (69)} [Az-Zumar: 69]. Attribute of Farah (Joy): It was mentioned in the Hadith that the Prophet, peace and blessings be upon him, said: \"Allah is more joyful with the repentance of His servant when he repents to Him than one of you who was on his mount in a barren land, and it escaped from him carrying his food and drink. He despaired of it and came to a tree and lay down in its shade, having despaired of his mount. While he was like that, suddenly it was standing by him, so he took hold of its reins and then said out of intense joy: 'O Allah, You are my servant and I am your Lord!'",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 49
  },
  {
    "serial_number": "39703",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 51,
    "volume_number": 1,
    "text": "He made a mistake out of intense joy.\" Narrated by Al-Bukhari and Muslim, and the wording is his. Attribute of Dahik (Laughter): He, peace and blessings be upon him, said: \"Allah laughs at two men, one of whom kills the other, and both enter Paradise. This one fights in the cause of Allah and is killed, then Allah turns in forgiveness to the killer, so he becomes a martyr.\" Narrated by Al-Bukhari and Muslim. We affirm Laughter and Joy for Allah the Mighty and Majestic in a manner of perfection, not like the laughter and joy of humans. Attribute of Ajab (Wonder/Amazement): He, peace and blessings be upon him, said: \"Allah has wondered at what you did with your guest tonight.\" Narrated by Muslim. Meaning wonder of approval at what they did with their guest, not like the wonder of a creature which means astonishment at an unexpected matter. Attribute of Irada (Will), which is of two types: 1 - Universal Will (Irada Kawniyyah): Meaning Mashiyyah (Volition). This must occur and relates to what Allah loves and what He does not love. It was mentioned in His saying, the Exalted: {His command is only when He intends a thing that He says to it, \"Be,\" and it is. (82)} ... [Ya-Sin: 82]. 2 - Legislative Will (Irada Shar'iyyah): Meaning Mahabbah (Love). This does not necessitate occurrence and relates only to what Allah loves. It was mentioned in His saying, the Exalted: {Allah intends for you ease and does not intend for you hardship (185)} [Al-Baqarah: 185].",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 50
  },
  {
    "serial_number": "39704",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 52,
    "volume_number": 1,
    "text": "Meaning that Allah wants ease for Muslims. Attribute of Kalam (Speech): The Exalted said: {And Allah spoke to Moses with [direct] speech. (164)} [An-Nisa: 164]. It is real speech with letters and voice. Attribute of Qawl (Saying): The Exalted said: {And who is more truthful than Allah in statement. (122)} [An-Nisa: 122]. Attribute of Hadith (Discourse/Statement): The Mighty and Majestic said: {Allah - there is no deity except Him. He will surely gather you for the Day of Resurrection, about which there is no doubt. And who is more truthful than Allah in statement. (87)} [An-Nisa: 87]. Attribute of Munadah (Calling out): Attribute of Munajah (Confidential Talk): Two attributes of Allah mentioned in His saying, the Exalted: {And We called him from the side of the mount at [his] right and brought him near, confiding [to him]. (52)} [Maryam: 52]. The difference between them is that Munadah is for the far, and Munajah is for the near, and both are speech. Attribute of Rida (Satisfaction/Pleasure): The Exalted said: {Allah is pleased with them and they are pleased with Him. That is for whoever has feared his Lord. (8)} [Al-Bayyinah: 8].",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 51
  },
  {
    "serial_number": "39705",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 53,
    "volume_number": 1,
    "text": "Attribute of Mahabbah (Love): The Exalted said: {Indeed, Allah loves those who fight in His cause in a row as though they are a [single] structure joined firmly. (4)} [As-Saff: 4]. Attribute of Barakah (Blessing): The Exalted said: {The mercy of Allah and His blessings be upon you, people of the house.} [Hud: 73]. Barakah is the abundance and continuity of good. Attribute of Istiwa (Rising) over the Throne: The Exalted said: {The Most Merciful [who is] above the Throne established. (5)} Taha. Meaning \"rose above the Throne\" \"Tafsir Al-Tabari\". The Throne is the bedstead of the King \"Fath Rabb Al-Bariyyah bi-Talkhis Al-Hamawiyyah by Ibn Uthaymin\". Attribute of Maji' (Coming): Attribute of Ityan (Coming): That Allah comes and arrives to judge between servants on the Day of Resurrection, as the Exalted said: {And your Lord has come and the angels, rank upon rank (22)} [Al-Fajr: 22]. And His saying, the Mighty and Majestic: {Do they wait for anything except that Allah should come to them in shadows of clouds and the angels [as well] and the matter is [then] decided? And to Allah [all] matters are returned. (210)} [Al-Baqarah: 210].",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 52
  },
  {
    "serial_number": "39706",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 54,
    "volume_number": 1,
    "text": "Attribute of Ihya' (Giving Life): Attribute of Imatah (Causing Death): Two attributes of Allah mentioned in His saying, the Exalted: {He it is who gives life and causes death; and when He decrees a matter, He but says to it, \"Be,\" and it is. (68)} [Ghafir: 68]. So Allah, Glory be to Him, gives life and causes death, and He is Living and does not die. Attribute of Nuzul (Descending) of Allah to the Lowest Heaven in the Last Third of the Night: The Prophet, peace and blessings be upon him, said: \"Our Lord, Blessed and Exalted, descends every night to the lowest heaven when the last third of the night remains, saying: Who calls upon Me, so that I may answer him? Who asks of Me, so that I may give him? Who seeks My forgiveness, so that I may forgive him?\" Narrated by Al-Bukhari and Muslim. This indicates the virtue of the time of the last third of the night. * There are attributes varied in wording but sharing the root meaning, such as: (Ghadab - Anger, Sukht - Wrath, Asaf - Regret/Wrath). (Bughd - Hatred, Karahiya - Dislike, Maqt - Abhorrence). (Makr - Plotting, Kayd - Scheme, Mihal - Might, Mukhada'ah - Deception). Sukht and Asaf are of the genus of Ghadab. Bughd, Karahiya, and Maqt share one origin. Makr, Kayd, Mihal, and Mukhada'ah are close to each other.",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 53
  },
  {
    "serial_number": "39707",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Al-Haqq wa Al-Thabat fi Al-Asma' wa Al-Sifat (The Truth and Firmness Regarding Names and Attributes)",
    "edition": "First, 1442 AH - 2021 AD",
    "publisher": "Dar Al-Sumay'i for Publishing and Distribution",
    "page_number": 55,
    "volume_number": 1,
    "text": "So some attributes are close in meaning, but that does not mean there is no difference between their meanings; rather, there is a difference, but it is subtle. Completed, and praise be to Allah. We ask Allah the Mighty and Majestic to teach us and to benefit us with what He taught us. Indeed, He is over all things competent. And may Allah send blessings and peace upon our master Muhammad and upon his family and all his companions. • • •",
    "foot_note": "None",
    "book_id": "225",
    "new_page_number": 54
  }
]