[
  {
    "text": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه\nالمؤلف: أبو الحسن علي بن عمر بن أحمد بن مهدي بن مسعود بن النعمان بن دينار البغدادي الدارقطني\nسنة الوفاة: 385",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "new_page_number": 1
  },
  {
    "text": "sn: 6333\nbook_title: أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه\nbook_link: https://shamela.ws/book/597\nbook_id: 597\nauthor_name: أبو الحسن علي بن عمر بن أحمد بن مهدي بن مسعود بن النعمان بن دينار البغدادي الدارقطني\nauthor_year: 385\nnickname: أبو الحسن\nauthor_link: https://shamela.ws/author/223\nauthor_ID: 223\neditor: نسخهما وعلق عليهما وقدم لهما: جابر بن عبد الله السريع\npublisher: دار العاصمة - الرياض\nedition: الأولى، 1433 هـ - 2012 م\npages: 59\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: التراجم والطبقات\ncategory_id: 26",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "new_page_number": 2
  },
  {
    "serial_number": "5531761",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: التراجم والطبقات الكتاب : أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه المؤلف : أبو الحسن علي بن عمر الدارقطني نسخهما وعلق عليهما وقدم لهما : جابر بن عبد الله السريع الناشر : دار العاصمة - الرياض الطبعة : الأولى ، 1433 هـ - 2012 م عدد الصفحات : 59 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 28 ذو القعدة 1442\nالكتاب : أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه المؤلف : أبو الحسن علي بن عمر الدارقطني نسخهما وعلق عليهما وقدم لهما : جابر بن عبد الله السريع الناشر : دار العاصمة - الرياض الطبعة : الأولى ، 1433 هـ - 2012 م عدد الصفحات : 59 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 28 ذو القعدة 1442\nالمؤلف : أبو الحسن علي بن عمر الدارقطني نسخهما وعلق عليهما وقدم لهما : جابر بن عبد الله السريع الناشر : دار العاصمة - الرياض الطبعة : الأولى ، 1433 هـ - 2012 م عدد الصفحات : 59 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 28 ذو القعدة 1442\nنسخهما وعلق عليهما وقدم لهما : جابر بن عبد الله السريع الناشر : دار العاصمة - الرياض الطبعة : الأولى ، 1433 هـ - 2012 م عدد الصفحات : 59 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 28 ذو القعدة 1442\nالناشر : دار العاصمة - الرياض الطبعة : الأولى ، 1433 هـ - 2012 م عدد الصفحات : 59 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 28 ذو القعدة 1442\nالطبعة : الأولى ، 1433 هـ - 2012 م عدد الصفحات : 59 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 28 ذو القعدة 1442\nعدد الصفحات : 59 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 28 ذو القعدة 1442\n[ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 28 ذو القعدة 1442\nتاريخ النشر بالشاملة : 28 ذو القعدة 1442",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 3
  },
  {
    "serial_number": "5531762",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 1,
    "volume_number": 1,
    "text": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه تأليف الإمام الحافظ أبي الحسن علي بن عمر الدارقطني رحمه الله تعالي ويليها: ذكر أسماء من اتفق محمد بن إسماعيل البخاري ومسلم بن الحجاج على تصحيح الرواية عنه من الصحابة رضي الله عنهم فأخرجا عنه في كتابيهما الموسوم كل واحد منهما بالصحيح وذكر أسماء من انفرد كل واحد بإخراج حديثه دون الآخر تأليف الإمام الحافظ أبي الفتح محمد بن أحمد بن أبي الفوارس رحمه الله تعالى نسخهما، وعلق عليهما، وقدم لهما جابر بن عبدالله السريع",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 4
  },
  {
    "serial_number": "5531763",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 5,
    "volume_number": 1,
    "text": "رسالة الإمام الحافظ أبي الحسن علي بن عمر الدارقطني",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 5
  },
  {
    "serial_number": "5531764",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 7,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرحيم الحمد لله رب العالمين، وصلى الله وسلم على نبينا محمد، وعلى آله وصحابته أجمعين، أما بعد: فقد اعتنى علماء الإسلام بالصحيحين عنايةً فائقةً، وتنوعت مؤلفاتُهم حولَهما، وكان للإمام الحافظ أبي الحسن علي بن عمر الدارقطني المتوفى سنة 385 رحمه الله تعالى نصيبٌ من ذلك، فقد ألَّف في رجال الصحيحين وفي نقدهما عدةَ رسائلَ، منها: 1 - التَتَبُّع، في بيان ما أُخرج في الصحيحين أو أحدِهما وله علة. 2 - جزء فيه بيانُ أحاديث أودعها البخاري كتابَه الصحيح، وفيها علة. 3 - الإِلْزَامات، في ذكر أحاديثَ لم يخرجاها، وأخرجا نظائر لها، وأحاديثِ جماعة من الصحابة رُويت من وجوه لا مطعن فيها، ولم يخرجا منها شيئًا. 4 - ذكر الصحابة الذين صحت الرواية عنهم، وليسوا في الصحيحين. 5 - أسماء الصحابة التي اتفق فيها البخاري ومسلم، وما انفرد به كل واحد منهما دون صاحبه. 6 - ذكر أسماء التابعين ومن بعدهم ممن صحت روايته من الثقات عند البخاري ومسلم، وذكراه في كتابيهما الصحيحين أو أحدِهما. 7 - ذكر أقوام أخرجهم البخاري ومسلم، وأخرجهم النسائي في كتاب الضعفاء، وهو الجزء المعروف بـ» سؤالات ابن بُكَير». وبين يديك -أيها القارئ- الرسالة الخامسة من هذه الرسائل، مطبوعةً لأول مرة، وهي رسالة ألفها الدارقطني لحصر الصحابة والصحابيات الذين ورد ذكرهم في الصحيحين أو أحدهما، تكمِّل رسالته الأخرى التي ألفها في أسماء التابعين في الصحيحين، وينتظم بهما كتاب واحد يجمع رجال الصحيحين معًا.",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 6
  },
  {
    "serial_number": "5531765",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 8,
    "volume_number": 1,
    "text": "التأليف في أسماء الصحابة المخرج لهم في الصحيحين: لم أقف على من سبق الدارقطني إلى التأليف في هذا الموضوع، وإنما ألف العلماء فيه بعد الدارقطني، وأشهرهم تلميذاه: الحاكم أبو عبدالله المتوفى سنة 405، حيث أفرد فصلًا في كتابه: «المدخل إلى الصحيح» لذكر من أخرجهم البخاري ومسلم أو أحدُهما، ابتدأه بذكر الصحابة. وأبو الفتح بن أبي الفوارس المتوفى سنة 412، وله في ذلك رسالة خاصة، عنوانها: «ذكر أسماء من اتفق البخاري ومسلم على تصحيح الرواية عنه من الصحابة، فأخرجا عنه في كتابيهما الموسوم كل واحد منهما بالصحيح، وذكر أسماء من انفرد كل واحد بإخراج حديثه دون الآخر». وألف أبو مسعود الدمشقي المتوفى سنة 401، وخلف الواسطي المتوفى بعد سنة 400: «أطراف الصحيحين»، وعقدا لكل صحابي مسندًا، بينا فيه أحاديثه بطرقها في الصحيحين. وبنى على عملهما أبو عبدالله محمد بن أبي نصر الحميدي المتوفى سنة 488، في كتابه: «الجمع بين الصحيحين»، فاعتنى بالصحابة الذين لهم مسانيد في الصحيحين أو أحدِهما، وذَكَر في كل مسندٍ أحاديثَ صاحبه، وعَدَدَها، مميزًا ما اتفق عليه الشيخان منها، مما انفرد به أحدهما عن الآخر، واستفاد أيضًا من أبي بكر الإسماعيلي المتوفى سنة 371، وأبي بكر البَرْقاني المتوفى سنة 425، في مستخرجيهما على الصحيحين. وأغلب من ألف في هذا الموضوع بعد ذلك اعتمدوا كتابَ الحميدي، فلخصوا ما فيه من الأسماء، وعَدَدَ ما روى كل صحابي، وزاد بعضهم: تراجمَ مختصرة لكل صحابي، وعددَ ما روى من الأحاديث عامةً، وذِكْرَ مَنْ أخرج له مِنْ أصحاب السنن الأربع. ومن هؤلاء: أبو الفرج بن الجوزي المتوفى سنة 597، وله في ذلك عملان: أحدهما: بابٌ عقده في كتابه: «تلقيح فهوم أهل الأثر في عيون التاريخ والسير»، عنوانه: «أسماء الصحابة الذين أُخرج عنهم في الصحيحين، وعدد الأحاديث التي أُخرجت عنهم».",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 7
  },
  {
    "serial_number": "5531766",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 9,
    "volume_number": 1,
    "text": "والآخر: فصولٌ عقدها في كتابه: «المجتنى من المجتبى» (1) ، بدأها بفصل عنوانه: «الإشارة إلى بعض أخبار العشرة»، ثم: «فصل في مسانيدهم»، ثم: «الإشارة إلى المشتهرين بالذكر من الصحابة بعد العشرة، وعدد مسانيدهم»، ثم: «الإشارة إلى أخبار المشتهرات بالذكر من الصحابيات، وذكر مسانيدهم»، بدأه بأزواج النبي صلى الله عليه وسلم، ثم بناته، وختم بفصل عنوانه: «ذكر اللواتي اشتهرن بالذكر من الصحابيات»، وترجم في كل فصل لمن فيه من الصحابة، وذكر عددَ ما رُوي عن كل واحد من الأحاديث إجمالًا، وعددَ ما أَخرج له البخاري ومسلم من ذلك. وألف في هذا الموضوع أبو سعيد العلائي المتوفى سنة 761، كتابه: «كشف النقاب عما روى الشيخان للأصحاب»، ونص في مقدمته على أنه لخصه من كتاب الحميدي، وألف بعده يحيى بن أبي بكر العامري المتوفى سنة 893، كتابه: «الرياض المستطابة في جملة من روى في الصحيحين من الصحابة»، ترجم فيه لكل صحابي، وذكر عدد ما له في الصحيحين، والسنن الأربع. واعتنى العلماء بهذا الموضوع ضمن كتبهم المؤلفة في رجال البخاري ومسلم، مثل أبي نصر الكَلَاباذي المتوفى سنة 398، في كتابه: «رجال البخاري»، وأبي بكر بن مَنْجُويه المتوفى سنة 428، في كتابه: «رجال مسلم»، وأبي الفضل بن طاهر المقدسي المتوفى سنة 507، في كتابه: «الجمع بين رجال الصحيحين»، وهو جَمْع بين كتابَي الكَلَاباذي وابن مَنْجُويه، وأبي",
    "foot_note": "1. طبعه الدكتور علي بن حسين البواب، سنة 1409، بدار الفائز، معتمدًا نسختين، إحداهما محفوظة في مكتبة أحمد الثالث بتركيا، ضمن المجموع 588، تقع بين الورقات (167 - 225)، منسوخة سنة 632، مختلة الترتيب، مع عدم وجود سقط فيها، وعنها صورة في جامعة الإمام بالرقم 10438 ف، وعندي منها صورة.",
    "book_id": "597",
    "new_page_number": 8
  },
  {
    "serial_number": "5531767",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 10,
    "volume_number": 1,
    "text": "الوليد الباجي المتوفى سنة 474، في كتابه: «التعديل والتجريح لمن خرَّج له البخاري في الجامع الصحيح». واعتنى بهذا الموضوع أيضًا عبدالغني المقدسي المتوفى سنة 600، ضمن كتابه: «الكمال في أسماء الرجال»، وهو في رجال الكتب الستة، وتلاه أبو الحجاج المِزِّي المتوفى سنة 742، فاعتنى بهذا الموضوع ضمن كتابيه: «تهذيب الكمال» و «تحفة الأشراف»، ثم استدرك على المِزِّي من ألف على كتابَيْه ممن جاء بعده، كالذهبي، والعراقي، ومُغْلطاي، وأبي زُرعة ابن العراقي، وابن حجر، وسِبْط ابن العَجَمي، والخزرجي وغيرهم، ونبهوا على أوهامه.  نسبة الرسالة للدارقطني، ونُسَخُها الخطية، وعنوانُها: لم أقف على من نسب هذه الرسالة للدارقطني قبل فهارس المخطوطات المتأخرة التي نسبتها له اعتمادًا على ما في النسخ الخطية، لكني وقفت على نقول للعلماء منها، مصرحين بنسبة ما نقلوه إلى الدارقطني، منهم: ابن أبي الفوارس في رسالته في أسماء الصحابة في الصحيحين، وأبو الوليد الباجي في كتابه: «التعديل والتجريح»، وابن الجوزي في كتابيه: «تلقيح فهوم أهل الأثر»، و» المجتنى». وقد أشرت إلى هذه النقول في حواشي الرسالة. واعتمدت في إخراج هذه الرسالة ست نسخ خطية، هذا بيان لها: الأولى: (ت): تقع في أربع ورقات (187 أ - 190 ب) ضمن المجموع 2947 المحفوظ في مكتبة مغنيسيا الوطنية بتركيا، وهي الرسالة الخامسة عشرة فيه، منسوخة سنة 968، ولم يذكر فيها الناسخ. حصلت على صورة منها من موقع «وزارة الثقافة والسياحة التركية» على الشبكة العالمية بواسطة الشيخ عبد الله بن حمد المنصور جزاه الله خيرًا. الثانية (س): تقع في ورقتين (35 ب - 37 أ) ضمن المجموع 620 المحفوظ في مكتبة سيرز التابعة للمكتبة السليمانية بتركيا، وهي الرسالة الخامسة فيه، ولم يذكر فيها تاريخ النسخ، ولا",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 9
  },
  {
    "serial_number": "5531768",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 11,
    "volume_number": 1,
    "text": "الناسخ. حصلت على صورة منها بواسطة الأخ أبي عبدالله مؤيد بن محمد الطيب جزاه الله خيرًا. الثالثة (ك): تقع في ثلاث ورقات ونصف الورقة (1 - 4) ضمن المجموع 801 المحفوظ في دار الكتب المصرية بالقاهرة، وهي الرسالة الأولى فيه، نسخها إسماعيل بن محمد المالكي العدوي، سنة ثمان وثمانين (1) . أهدى لي صورة منها الأخ أبو حاتم المصري جزاه الله خيرًا. الرابعة (ف): تقع في أربع ورقات ونصف الورقة (1 - 5) ضمن المجموع 1966 المحفوظ في مركز الملك فيصل للبحوث والدراسات الإسلامية بالرياض، وهي الرسالة الأولى فيه، منسوخة في القرن الثالث عشر تقريبًا كما في بطاقة الفهرسة، ولم يذكر فيها الناسخ. حصلت على صورة منها من المركز نفسه جزى الله القائمين عليه خيرًا (2) . الخامسة (ي): تقع في ثلاث ورقات (241 ب - 244 أ) في آخر كتاب «تقييد المهمل وتمييز المشكل» لأبي علي الجياني المحفوظ بالرقم 2327 في مكتبة الأوقاف بالجامع الكبير بصنعاء، منسوخة سنة 695، ولم يذكر فيها الناسخ. حصلت على صورة منها من موقع «مركز ودود للمخطوطات» على الشبكة العالمية جزى الله القائمين عليه خيرًا. السادسة (هـ): تقع في ورقتين (157 أ - 158 ب) ضمن المجموع 2276 خ المحفوظ في جامعة الإمام محمد بن سعود الإسلامية بالرياض، وهي الرسالة الخامسة عشرة فيه، نسخها زين العابدين الآروي الشاه آبادي البهاري، سنة 1320. حصلت على صورة منها من",
    "foot_note": "1. كذا جاء في آخر النسخة، ولعل المراد: بعد الألف، فاختصر الناسخ التاريخ، ونقل سزكين عن فهرس دار الكتب أنها منسوخة سنة 1060 هـ. \n2. وقد سقط منها في مصورتي الوجه (أ) من اللوحة الخامسة، وفيه نهاية النسخة، وكذلك وجدته ساقطًا من الفلم المحفوظ في المركز المصور عن النسخة الأصلية، ووقع مكانه ورقة فيها مجموعة أشعار، لا علاقة لها بالرسالة.",
    "book_id": "597",
    "new_page_number": 10
  },
  {
    "serial_number": "5531769",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 12,
    "volume_number": 1,
    "text": "الجامعة نفسها جزى الله القائمين عليها خيرًا. والنسختان الثانية والثالثة ذكرهما فؤاد سزكين في كتابه: «تاريخ التراث العربي» 1/ 422، 423، بالرقمين 17، 19، والرابعة ذكرها الشيخ نجم بن عبدالرحمن خلف في كتابه: «استدراكات على تاريخ التراث العربي في علم الحديث» ص 534، والخامسة ذكرها الشيخان رضا بو شامة وعبدالباري عبدالحميد في مراجع تحقيقهما لكتاب» الإيماء إلى أطراف أحاديث كتاب الموطأ «لأبي العباس الداني 5/ 563، والسادسة ذكرها أصحاب» الفهرس الشامل» 2/ 820، نقلًا عن فهرس المخطوطات والمصورات بجامعة الإمام 1/ 400 (1) . وقد نص الدارقطني في مقدمة رسالته على عنوانها، فقال: «هذه أسماء الصحابة التي",
    "foot_note": "1. ذكر الشيخ عبدالله الرحيلي في كتابه: «الإمام أبو الحسن الدارقطني وآثاره العلمية» ص 213، 214 لرسالة الدارقطني هذه نسخةً محفوظة في المكتبة الآصفية بالهند بالرقم (172 رجال)، ضمن كتابٍ عنوانه: «رجال البخاري ومسلم»، وقال: «هذا الكتاب يتجزأ إلى ثلاثة كتب»، وذكر أن أولها رسالة أسماء الصحابة هذه، وأن أول الرسالة جاء في النسخة هكذا: «الصحابة الذين أخرج لهم البخاري في صحيحه مما اعتنى به الحميدي ونبه عليه»، وأن آخرها: «ما حمر على عدده فذلك العدد في الصحيحين، وما لم يحمر ففي البخاري»، وقال: «ولم يظهر في النسخة المصورة عدد أصلًا»، ولم يزد على هذا. وتعقبه الشيخ خالد بن محمد باسمح في رسالته: «أحاديث أبي إسحاق السبيعي التي ذكر الدارقطني فيها اختلافًا في كتابه العلل»، فقال ص 137 عما نقله الرحيلي من أول الرسالة: «وهذا النص لا يمكن أن يكون للدارقطني، فالحميدي لم يخلق بعد»، ومن ثم شكك في صحة نسبة هذه الرسالة إلى الدارقطني، وجعلها ضمن» الكتب المنسوبة إليه وفي نسبتها نظر « .. وقد حصلت على صورة من هذه النسخة، فتبين أنها ليست للدارقطني، وإنما هي تجريد لأسماء الصحابة الذين ذكر الحميدي في كتابه:» الجمع بين الصحيحين «أن البخاري أخرج لهم، لم يُعرف من قام به، نقله الناسخ بين يدي رسالة أخرى للدارقطني، هي:» ذكر أسماء التابعين ومن بعدهم ممن صحت روايته من الثقات عند البخاري».",
    "book_id": "597",
    "new_page_number": 11
  },
  {
    "serial_number": "5531770",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 13,
    "volume_number": 1,
    "text": "اتفق فيها محمد بن إسماعيل البخاري، ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالى، وما انفرد به كل واحد منهما دون صاحبه «، وأما العنوان في النسخ فجاء مختلفًا قليلًا، ففي (ت) و (س):» الجزء فيه ما اتفق عليه البخاري ومسلم رحمهما الله، وما انفرد به أحدهما عن الآخر، من أسماء الصحابة رضي الله عنهم أجمعين»، وفي (ك) و (ف): «هذه رسالة في أسماء الصحابة التي اتفق فيها البخاري ومسلم في صحيحيهما، وما انفرد به كل واحد منهما دون صاحبه»، ولم يرد للرسالة عنوان في (ي) و (هـ)، وإنما ابتدأتا بكلام الدارقطني مباشرة. وقد اعتمدت العنوان الذي ذكره الدارقطني في بداية الرسالة، لأنه هو الذي ارتضاه عنوانًا لها.  دراسة النسخ الخطية: ليس من نسخ هذه الرسالة نسخةٌ ترقى أن تكون أصلًا معتمدًا، فكلها نسخ متأخرة، ولم تُبيَّن أصولُها التي نُسخت منها، وليس في واحدة منها إسناد إلى الدارقطني، وإنما تبتدئ جميعًا بـ «قال الدارقطني» -إلا ما في النسخة (ي)، وسيأتي-، وتشترك جميعها في كثرة التصحيفات والتحريفات التي تدل على أنها نسخ غير متقنة. ووجدت تشابهًا في الصياغة والتصحيفات بين النسختين (ت) و (س)، كما وجدت تشابهًا بين النسختين (ك) و (ف)، حتى إن هناك حواشيَ متطابقةً مكتوبةٌ في النسختين (ك) و (ف) على غلافَيْهما، وفي صفحاتهما، مع وجود تشابه أحيانًا بين النسخة (ك) والنسختين (ت) و (س). أما (ي) و (هـ) فبينهما تشابه إلى حدٍ ما، وتختلفان عن البواقي. وبعد دراسة النسخ تبين لي أنها فروع ترجع إلى أصلين مختلفين، فالنسختان (ي) و (هـ) ترجعان إلى أصل واحد، والبواقي ترجع إلى أصل آخر، وكل أصل يختلف عن الآخر: زيادة",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 12
  },
  {
    "serial_number": "5531771",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 14,
    "volume_number": 1,
    "text": "في أسماء الصحابة ونقصًا، واختلافًا في الترتيب بينها، وفي جعل بعض الصحابة مما اتفق فيه الشيخان أو انفرد به أحدهما عن الآخر. فالأصل الذي نقلت منه النسختان (ي) و (هـ) جاءت فيه زيادة سبعة عشر اسمًا على الأصل الآخر، والأصل الآخر جاءت فيه زيادة اسم واحد على الأول، واختلف الأصلان في ثمانية أسماء، فجاءت في الأول فيما اتفقا فيه، وجاءت في الآخر فيما انفرد به أحدهما، وجاء فيهما اسم بعكس ذلك، وجاء اسم في أفراد البخاري في الأول، وفي أفراد مسلم في الآخر، واختلف الأصلان في ترتيب ثلاثة أسماء، مع الاتفاق على جعلهم في موضع واحد: فيما اتفقا فيه، أو فيما انفرد به أحدهما. وهذا الاختلاف بين الأصلين يحتمل: أن يكون من الدارقطني نفسه، وأن يكون من الرواة. فقد يكون الدارقطني ألف الرسالة أولًا، فرويت عنه، ثم أعاد فيها النظر، واستدرك أشياء، فرويت عنه ثانيًا. وقد يكون أحد الرواة أصلح فيما رواه أشياء، وأضاف وعدل، فروي عنه ذلك على أنه من الدارقطني. وقد يكون الاختلاف لأمر آخر، لكنه لا يمكن أن يكون من النساخ، لأنه لا يحتمل ذلك، لتعدده، وتنوعه. وأمام هذا الاختلاف بين الأصلين وجدت لكل واحد منهما ما يرجح الأخذ به: فمما يرجح الأخذ بأصل (ي) و (هـ) أن النسخة اليمنية (ي) جاءت عليه، وفيها ميزتان تميزانها عن النسخ الأخرى: أن في بدايتها إسنادًا إلى الدارقطني، وأنها أقدم النسخ كتابة، حيث نسخت سنة 695. والإسناد الذي في بداية (ي) جاء بعد البسملة هكذا: «أبو الحسن علي بن فهد، قرأت على أبا الفتح محمد بن أحمد بن أبي الفوارس، أخبركم أبو الحسن الدارقطني، قال: هذه أسماء الصحابة … ». وفوق الأخطاء اللغوية والتحريفات التي اشتمل عليها هذا الإسناد؛ فإن فيه إشكالًا، خلاصته: أن الراوي عن الدارقطني -وهو ابن أبي الفوارس، أحد الحفاظ",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 13
  },
  {
    "serial_number": "5531772",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 15,
    "volume_number": 1,
    "text": "من تلاميذ الدارقطني- قد ألف رسالة مشابهة لرسالة الدارقطني، وعزا فيها ثمانية أسماء إلى رسالة الدارقطني بقوله: «قال الشيخ أبو الحسن»، ومن بين الذين عزاهم إلى الدارقطني في أفراد مسلم: أبو حبة -ويقال: حية- البدري، مع أنه في النسخة (ي) المروية عن ابن أبي الفوارس عن الدارقطني مذكور فيما اتفقا فيه، فلو كانت تلك النسخة من روايته فعلًا لعزا أبا حبة البدري إلى ما اتفقا فيه، كما هو مثبت في تلك النسخة عنه، فهذا مما يشكك في هذا الإسناد. وأمر آخر: هو أن في هذا الأصل صحابيين، ذُكِرا متبوعين بعبارة: «ذكره الحاكم»، وهذا ليس من كلام الدارقطني قطعًا، لأن المقصود بالحاكم أبو عبدالله ابن البيِّع، وهو أحد تلاميذ الدارقطني، وما ذُكر عنه موجود في كتابه: «المدخل إلى الصحيح»، ويبعد أن ينقل الدارقطني عن أحد تلاميذه شيئًا في رسالة صغيرة كهذه. وقد لاحظت أن أسماء الصحابة التي زادها هذا الأصل على الأصل الآخر مذكورة كلها عند الحاكم، فلعلها زيدت منه إضافة إلى ما عند الدارقطني، ثم أدخلها النساخ فيما بعد في صلب الرسالة. لكن الإشكال قائم فيمن تغير مكانهم بين الأصلين من المتفق عليه إلى ما انفرد به أحدهما، أو العكس، فهذا مما يصعب تغييره وإبقاء نسبته إلى الدارقطني، وليس للنساخ مجال في تغييره دون إشارة. فهذان أمران يجعلان الأخذ بهذا الأصل غير متعين. وتقدُّم تاريخ كتابة النسخة (ي) لا يكفي لتقديمها على بقية النسخ، لأنه تقدم بالنسبة للنسخ الأخرى، وأما الدارقطني فإن تاريخ النَسْخ متأخر عنه بأربعة قرون، هذا مع كون النسخة (ي) في شقها الأكبر -وهو كتاب «تقييد المهمل» الذي جاءت في آخره- كثيرةَ التصحيف والتحريف والسقط، كما ترى وصفها بذلك في مقدمة تحقيق الشيخين علي بن محمد العمران، ومحمد عزير شمس للكتاب، في 1/ 137. ومما يرجح الأخذ بأصل (ت) و (س) و (ك) و (ف) أن نقول العلماء عن الدارقطني في",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 14
  },
  {
    "serial_number": "5531773",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 16,
    "volume_number": 1,
    "text": "هذه الرسالة -مما وقفت عليه- متوافقة معه، ومختلفة -في بعض المواضع- عن الأصل الأول، كما تراه في حواشي الرسالة عند ذكر «الحارث بن عوف أبي واقد الليثي، والرميصاء أم سليم، ولبابة الكبرى أم الفضل، وأبي حبة البدري، وأبي داود». وقد جاء كلام الدارقطني في بعض كتبه الأخرى موافقًا أيضًا لهذا الأصل، مخالفًا للأصل الأول، فمن ذلك: «سلمة بن يزيد الجعفي» ذكر في أصل (ي) و (هـ) فقط، وقد عده الدارقطني في الإلزامات ص 99 فيمن صحت أحاديثهم، ولم يخرَّج لهم شيء في الصحيحين. و «حويطب بن عبدالعزى، وعبدالله بن عامر بن ربيعة، وعبدالله بن صفوان» ذكروا في أصل (ي) و (هـ) فقط، وقد ذكرهم الدارقطني في كتابه: «ذكر أسماء التابعين ومن بعدهم ممن صحت روايته من الثقات عند البخاري ومسلم» 1/ 120، و 1/ 189، 2/ 138، و 2/ 134، فهم عنده من التابعين، على أنه قد ذَكَر في هذا الكتاب غيرَهم ممن اجتمع عليهم الأصلان. والجزم باعتماد أحد هذين الأصلين ليس بسهل، لغياب المرجحات القوية، لكني لِمَا سبق ذكره من وجود أمرين يشككان في الأخذ بأصل (ي) و (هـ)، اعتمدت في أسماء الصحابة أصلَ (ت) و (س) و (ك) و (ف)، فله ما يؤيده، وهو أقرب عندي إلى كونه من تأليف الدارقطني، وأثبتُّ في الحواشي ما في أصل (ي) و (هـ) من أسماء زائدةٍ أو مذكورةٍ في غير المواضع التي ذكرت فيها في الأصل المعتمد.  طريقة الدارقطني في رسالته: قدم الدارقطني لرسالته مقدمةً تبين مضمونها، فقال: «هذه أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري، ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالى،",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 15
  },
  {
    "serial_number": "5531774",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 17,
    "volume_number": 1,
    "text": "وما انفرد به كل واحد منهما دون صاحبه». وختمها بقوله: «فهذه جملة ما خرجا جميعًا من حديث الصحابة من الرجال والنساء رضي الله عنهم، في كتابيهما جميعًا». ورتب الأسماء على حروف المعجم، جاعلًا لكل حرف بابًا، وقدم من اسمه محمد، وهو محمد بن مسلمة وحده، وقدم في كل حرف من اتفقا فيه، ثم أفراد مسلم، ثم أفراد البخاري، وقد يخالف هذا الترتيب أحيانًا. ومزج الرجال بالنساء، فلم يفرد لهن بابًا، وذكرهن غالبًا في آخر الفصل من كل حرف. وعقد في آخر الرسالة بابًا لكنى الرجال، ثم أتبعه بآخر في كنى النساء. وكرر في الكنى بعض من ذكرهم في الأسماء، وهم: أبو سعيد بن المعلى -وأشار إلى أنه تقدم-، وأم سليم، وأم عطية. ووجدت الصحابة الذين ذكرهم الدارقطني في رسالته ثلاثة أنواع: الأول: من له في الصحيحين أو أحدهما حديث مسند يرويه عن النبي صلى الله عليه وسلم، وهذا هو الغالب. الثاني: من له في الصحيحين أو أحدهما رواية عن الصحابة، أو أثر موقوف عليه من قوله أو فعله، وليس له فيهما أو في أحدهما حديث مسند يرويه عن النبي صلى الله عليه وسلم. منهم: أهبان بن أوس، وثعلبة بن أبي مالك، وعبدالله بن المسيب، وعمرو بن سلِمة. الثالث: من له ذِكْرٌ في أحاديث الصحيحين أو أحدهما، في المتون أو الأسانيد، وليست تلك الأحاديث من مسنده ولا من روايته، ولا من قوله أو فعله، وليس له في الصحيحين أو أحدهما حديث مسند يرويه عن النبي صلى الله عليه وسلم، أو عن الصحابة. منهم: إياس بن البكير، وسالم مولى أبي حذيفة، وعامر بن حذيفة أبو الجهم، وعاصم بن ثابت بن أبي الأقلح، وقدامة بن مظعون، وأم سليط. فكل هؤلاء -فيما يظهر من تصرف الدارقطني- يشملهم عنده عنوان الرسالة",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 16
  },
  {
    "serial_number": "5531775",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 18,
    "volume_number": 1,
    "text": "ومضمونها، وهو «الصحابة الذين أخرج لهم البخاري ومسلم أو أحدهما»، فلا بد على هذا من اجتماع شيئين: أن تكون الصحبة ثابتة -ولو من خارج الصحيحين-، وأن يخرِّج الشيخان أو أحدهما للصحابي بأي نوع من الأنواع السابقة. والنوعان الأول والثاني يدخلان في مضمون الرسالة أصالةً، وهما المقصودان بتأليفها، أما النوع الثالث فلا يدخل إلا تبعًا، وليس هو من مقصود التأليف ههنا، وأظن الدارقطني لم يقصد استيعاب هذا النوع، فإن في متون أحاديث الصحيحين جماعة من الصحابة لم يذكرهم، منهم: زيد بن الدثنة، وخبيب بن عدي، والطفيل بن عمرو الدوسي، وعثمان بن مظعون، وهلال بن أمية، ومرارة بن الربيع، وحمزة بن عبدالمطلب، ومصعب بن عمير، وزيد بن حارثة، وسماك بن خرشة، وجليبيب، وعبدالله بن عمرو بن حرام الأنصاري، وغيرهم، وهذا بابه أعلام المتون، ولعل كتاب ابن حجر: «الإعلام بمن ذكر في البخاري من الأعلام» يتناول هذا النوع في صحيح البخاري خاصة.  الموازنة بين ما كتبه الدارقطني في هذه الرسالة وما كتبه الحاكم وابن أبي الفوارس والحميدي، وما كتبه الدارقطني في كتبه الأخرى مما له صلة بالموضوع: وجدت فيما كتبه الحاكم وابن أبي الفوارس والحميدي في هذا الموضوع جماعةً من الصحابة لم يذكرهم الدارقطني: فذكر الحاكم: خولة بنت قيس -وقد قيل: إنها خولة بنت ثامر التي ذكرها الدارقطني، ولم يذكرها الحاكم-، وسعد بن عبادة، وسليك الغطفاني، والضحاك بن سفيان الكلابي -وقد وهم بذكره الحاكم-، وعثمان بن طلحة. وذكر ابن أبي الفوارس: بلال بن الحارث -وقد وهم بذكره-، وعبدالله بن حذافة، ومحمد بن إياس بن البكير -وقال: «عن أبيه»، وقد ذكر أباه الدارقطني-.",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 17
  },
  {
    "serial_number": "5531776",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 19,
    "volume_number": 1,
    "text": "وذكر الحميدي: سراقة بن مالك، وعبدالله بن حذافة، وعبدالله بن رواحة، ومحمد بن إياس بن البكير -ونبه على أنه تابعي، وأن لأبيه ذكرًا لا روايةً في البخاري، وقد ذكر أباه الدارقطني-. ولم يستوعب الدارقطني التنبيه على المسانيد المبهمات، وقد ذكرها ابن أبي الفوارس والحميدي. وأما الأسماء التي زيدت في أصل (ي) و (هـ) -وهي سبعة عشر اسمًا-، فقد ذكر الحاكم وابن أبي الفوارس والحميدي منها: خويلد بن عمرو أبا شريح العدوي، وعائذ بن عمرو المزني، وعمرو بن عبسة السلمي، وعبدالله بن سرجس، ومعمر بن عبدالله العدوي، ونفيعًا أبا بكرة الثقفي، وانفرد الحاكم بذكر: حويطب بن عبدالعزى، وسلمة بن يزيد الجعفي، والضحاك بن قيس الفهري، وعبدالله بن السعدي، وعبدالله بن عبدالأسد أبي سلمة، وعبدالله بن صفوان، وفاطمة بنت أبي حبيش، وأبي الشموس البلوي، وأبي لاس الخزاعي، وأم حبيبة بنت جحش. وانفردت النسخة (ي) من هذا الأصل بذكر: عبدالله بن عامر بن ربيعة، ولم يذكره واحد منهم. وأما الأسماء التي اختلف فيها أصل (ي) و (هـ) وأصل (ت) و (س) و (ك) و (ف) -وهي عشرة أسماء-، فجاءت ستة منها عند ابن أبي الفوارس والحميدي (1) موافقة لما في أصل (ي) و (هـ)، وهي: الحارث بن عوف أبو واقد الليثي، والرميصاء أم سليم -في الموضع",
    "foot_note": "1. لم يلتزم الحاكم في الفصل الذي عقده للصحابة في كتابه أن يميز من أخرج له الشيخان ممن أخرج له أحدهما، وإنما أشار إلى ذلك أحيانًا، لذلك لم أدخله في الموازنة هنا، ولم أجد عنده ما يخالف ما ذكره الدارقطني، إلا في» عائذ بن عمرو المزني «، فقد ذكره في أفراد مسلم، وهو من زيادات أصل (ي) و (هـ) فيما اتفقا فيه.",
    "book_id": "597",
    "new_page_number": 18
  },
  {
    "serial_number": "5531777",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 20,
    "volume_number": 1,
    "text": "الأول (1) -، وسعد بن معاذ، والصعب بن جثامة، وصهيب بن سنان، ولبابة أم الفضل. وجاءت ثلاثة أسماء منها عندهما موافقة لما في أصل (ت) و (س) و (ك) و (ف)، وهي: عبدالله بن يزيد الأنصاري (2) ، وعمرو بن حريث، وعمرو بن الحارث بن المصطلق، وجاء «أبو حبة البدري» عند ابن أبي الفوارس وحده -معزوًا إلى الدارقطني- بموافقة ما في أصل (ت) و (س) و (ك) و (ف). واتفق الأصلان على سبعة أسماء جاءت عند ابن أبي الفوارس والحميدي مخالفة لما عند الدارقطني، وهي: خولة بنت حكيم، وسودة بنت زمعة، وعبدالله بن زمعة، وأبو عبيدة عامر بن عبدالله، وفاطمة بنت قيس، ومحمود بن الربيع، والنعمان بن مقرن. وقد ذكرت عند كل واحد من هؤلاء في موضعه ما يوضح أمره. وبيانهم في الجدول التالي:",
    "foot_note": "1. ذكرها الدارقطني مرتين: في الأسماء وفي الكنى، فجاءت في الأسماء في الأصل الأول فيما اتفقا فيه، وفي الثاني في أفراد مسلم، وجاءت في الكنى في الأصلين فيما اتفقا فيه. \n2. هو مما انفردت به (هـ) مخالفة لـ (ت) و (س) و (ك) و (ف)، ولم يرد في (ي).",
    "book_id": "597",
    "new_page_number": 19
  },
  {
    "serial_number": "5531778",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 21,
    "volume_number": 1,
    "text": "الاسم (ي، هـ) (ت، س، ك، ف) ابن أبي الفوارس الحميدي أبو واقد الليثي خ م م خ م خ م الرميصاء خ م م خ م خ م سعد بن معاذ خ م خ خ الصعب بن جثامة خ م م خ م خ م صهيب بن سنان م خ م م م أم الفضل لبابة خ م م خ م خ م عبدالله بن يزيد خ م خ خ خ عمرو بن حريث خ م م م م عمرو بن الحارث خ م خ خ خ أبو حبة البدري خ م م م × خولة بنت حكيم خ م م م سودة بنت زمعة خ خ م خ عبدالله بن زمعة خ خ م خ م أبو عبيدة عامر بن عبد الله خ م م فاطمة بنت قيس م خ م خ م محمود بن الربيع خ م خ خ النعمان بن مقرن خ م خ خ م ووجدت الدارقطني ذكر: زيد بن الخطاب، وله في الصحيحين حديث مسند، ولم يذكره الحاكم ولا ابن أبي الفوارس ولا الحميدي.",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 20
  },
  {
    "serial_number": "5531779",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 22,
    "volume_number": 1,
    "text": "وذكر أبا رجاء عمران بن ملحان العطاردي، وقال: «وهو مخضرم»، إشارة إلى عدم صحة صحبته، وله في البخاري حديث أسنده إلى زمان النبي صلى الله عليه وسلم، ولم يذكره الحاكم ولا ابن أبي الفوارس، وذكره الحميدي منبهًا عليه. وزاد الدارقطني أسماءً ذكرها بعض هؤلاء دون بعض: فزاد على الحاكم: أسماء بنت أبي بكر، وإياس بن البكير، وثعلبة بن أبي مالك، والحكم ابن عمرو الغفاري، وحزن بن أبي وهب، وسنينًا أبا جميلة، وصفية بنت شيبة -على أنه رجح عدم صحبتها-، وعبدالله بن أبي أوفى، وعبدالله بن قيس أبا موسى الأشعري، وعتبة بن غزوان، وعمارة بن رويبة، وعبدالله بن المسيب، وعبدالله بن أنيس، وعامر بن حذيفة أبا الجهم، وأبا عامر الأشعري، وعامر بن عبدالله أبا عبيدة، وعمرو بن سلِمة الجرمي، وعاصم ابن ثابت بن أبي الأقلح، والعداء بن خالد، وقدامة بن مظعون، ومروان بن الحكم، والنعمان ابن مقرن، ونسيبة أم عطية، ووائل بن حجر، وأبا حبة البدري، وأم حرام بنت ملحان، وأم مبشر. وزاد على ابن أبي الفوارس: بلال بن رباح، وعبدالرحمن بن أبزى، ومجالد بن مسعود. وزاد على الحميدي (1) : الأشعث بن قيس، وحسان بن ثابت، وسلِمة الجرمي والد عمرو، وعبدالرحمن بن أبزى، والعداء بن خالد، ومروان بن الحكم، ونوفل بن معاوية، وأبا حبة البدري.",
    "foot_note": "1. لم أذكر إلا من لهم حديث مسند، لأنهم على شرط الحميدي، وأما من سواهم فليسوا على شرطه، وقد ذكر منهم الدارقطني: ثعلبة بن أبي مالك، وسالمًا مولى أبي حذيفة، وعبدالله بن المسيب، وعامر بن حذيفة أبا الجهم، وعاصم بن ثابت بن أبي الأقلح، وقدامة بن مظعون، وأم سليط، ولم يذكرهم الحميدي.",
    "book_id": "597",
    "new_page_number": 21
  },
  {
    "serial_number": "5531780",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 23,
    "volume_number": 1,
    "text": "وذكر الدارقطني ثلاثة لم يذكرهم هؤلاء، ولم أجد لهم ذكرًا فيما عزاهم إليه: البراء بن مالك، وأبو داود (1) ، ذكرهما في أفراد البخاري، وعبدالله بن ربيعة، ذكره في أفراد مسلم. وبموازنة ما ذكره الدارقطني في هذه الرسالة بما ذكره في كتابه: «الإلزامات» وجدت كلامه متطابقًا فيهما، إذ ذكر فيهما ممن اتفقا فيه: المسيب بن حزن، وعتبان بن مالك، وعمرو بن عوف، ومالك بن صعصعة،، ومعيقيبًا. وممن انفرد به البخاري: مرداسًا الأسلمي، وزاهرًا والد مجزأة، وحزن بن أبي وهب، وعبدالله بن هشام، وعبدالله بن ثعلبة بن صعير، وعمرو بن تغلب، وخولة بنت ثامر، وسويد بن النعمان، وأبا سعيد بن المعلى، وسنينًا أبا جميلة، وشيبة بن عثمان، وأبا عبس بن جبر، وأم العلاء. وممن انفرد به مسلم: طارق بن أشيم والد أبي مالك الأشجعي، ومطيع بن الأسود، وزهير بن عمرو، وقبيصة بن المخارق، وسبرة بن معبد، وجدامة بنت وهب، وذؤيبًا والد قبيصة، والأغر المزني، وأبا رفاعة العدوي، ورافع بن عمرو الغفاري، وربيعة بن كعب الأسلمي، وقطبة بن مالك، ونافع بن عتبة، وأم مبشر. كما ذكر الدارقطني في كتابه: «ذكر أسماء التابعين ومن بعدهم ممن صحت روايته من الثقات عند البخاري ومسلم» جماعةً ذكرهم في رسالته هذه، فذكر في رجال البخاري وفي رجال مسلم: صفية بنت شيبة، وأبا رجاء عمران بن ملحان العطاردي، وزينب بنت أم سلمة، وذكر في رجال البخاري وحده: ثعلبة ابن أبي مالك، وعبدالله بن يزيد الخطمي الأنصاري، ومحمود بن الربيع. وقد ذكرت عند كل واحد منهم في موضعه ما لعله يفسر هذا التكرار.",
    "foot_note": "1. لم يذكر» أبو داود «في (ك) و (ي) و (هـ).",
    "book_id": "597",
    "new_page_number": 22
  },
  {
    "serial_number": "5531781",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 24,
    "volume_number": 1,
    "text": "المنهج المتبع في إخراج الرسالة: 1 - اعتمدت في أسماء الصحابة ما جاء في أصل (ت) و (س) و (ك) و (ف)، وأثبت في الحواشي الأسماءَ الزائدة في أصل (ي) و (هـ) في أماكنها، ونبهت على كل اسم وقع فيه خلاف بين الأصلين، وذكرت مكان وروده في أصل (ي) و (هـ). وأما في صياغة العبارة فتخيرت الصواب من النسخ، وأثبت ما استصوبته من الزيادات فيها. 2 - قسمت الرسالة إلى فقرات، ورقمتها ترقيمًا متسلسلًا، وربطت كل رقم بحاشيةٍ، بينت فيها ما اختلفت فيه النسخ داخل كل فقرة. 3 - نبهت على من ذكرهم الدارقطني ممن ليس لهم مسانيد في الصحيحين أو أحدِهما، وإنما لهم روايات عن الصحابة، أو آثارٌ موقوفة عليهم، أو ذِكْرٌ في الأحاديث من دون رواية، أو ذَكَرهم الدارقطني فيما اتفقا فيه، وإنما أخرج لهم أحدهما، أو العكس. 4 - علقت على بعض المواضع بما يوضحها، وصوبت في الحواشي ما رأيت أنه خطأ في المتن. وأسأل الله تعالى التوفيق في القول والعمل، إنه سميع مجيب. حرر في 19 شوال 1430 jaberaddosary@hotmail.com",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 23
  },
  {
    "serial_number": "5531782",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 25,
    "volume_number": 1,
    "text": "نماذج من صور النسخ الخطية",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 24
  },
  {
    "serial_number": "5531783",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 27,
    "volume_number": 1,
    "text": "الصفحتان الأولى والأخيرة من النسخة (ت)",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 25
  },
  {
    "serial_number": "5531784",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 28,
    "volume_number": 1,
    "text": "الصفحتان الأولى والأخيرة من النسخة (س)",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 26
  },
  {
    "serial_number": "5531785",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 29,
    "volume_number": 1,
    "text": "الصفحتان الأولى والأخيرة من النسخة (ك)",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 27
  },
  {
    "serial_number": "5531786",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 30,
    "volume_number": 1,
    "text": "الصفحتان الأولى والأخيرة من النسخة (ف) التي عندي",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 28
  },
  {
    "serial_number": "5531787",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 31,
    "volume_number": 1,
    "text": "الصفحتان الأولى والأخيرة من النسخة (هـ)",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 29
  },
  {
    "serial_number": "5531788",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 32,
    "volume_number": 1,
    "text": "الصفحتان الأولى والأخيرة من النسخة (ي)",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 30
  },
  {
    "serial_number": "5531789",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 33,
    "volume_number": 1,
    "text": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البُخَاري ومسلم بن الحجاج بن مسلم القُشَيري رحمهما الله تعالى وما انفرد به كل واحد منهما دون صاحبه تأليف الإمام الحافظ أبي الحسن علي بن عمر الدارَقطني رحمه الله تعالى",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 31
  },
  {
    "serial_number": "5531790",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 35,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرحيم 1 - (1) الحمد لله رب العالمين، وصلى الله على سيدنا محمد، وعلى آله، وصحبه، وسلم. 2 - (2) قال الشيخ الحافظ أبو الحسن علي بن عمر الدارَقُطْني رحمه الله: 3 - (3) هذه أسماءُ الصحابة التي اتفق فيها محمد بن إسماعيل البُخَاري، ومسلم بن الحجاج بن مسلم القُشَيري رحمهما الله تعالى، وما انفرد به كلُّ واحد منهما دون صاحبه: 4 - (4) اتفقا في محمد بن مَسْلَمة رضي الله عنه.",
    "foot_note": "1. 1 - «الحمد لله رب العالمين» من ك، ف / «وصلى الله على سيدنا محمد» من ت، س، ك، ف / «وعلى آله وصحبه وسلم» من ف، وفي ك: «وآله وصحبه وسلم»، وفي ي: «وصلى الله على محمد النبي وآله وسلم». \n2. 2 - «الحافظ» من ك، ف، وفي هـ: «الإمام» / «رحمه الله» من ت، س، ك، ف، وفي ي: «أبو الحسن علي ابن فهد، قال: قرأت على أبا الفتح محمد بن أحمد بن أبي الفوارس: حدثكم أبو الحسن الدارقطني، قال». وقوله: «أبو الحسن علي بن فهد» لعل صوابه: أبو القاسم بن علي بن فهد، وهو عبدالواحد بن علي بن محمد بن فهد، أبو القاسم العلاف، آخر من روى عن ابن أبي الفوارس، توفي سنة 486. وقوله: «أبا» الوجه فيه أن يقال: أبي. \n3. 3 - «التي» في هـ: «الذين» / «البخاري» من ت، س، ك، ف / «بن مسلم» من س، ك، ف، وفي ت: «من مسلم» / «القشيري رحمهما الله» من ت، س، ك، ف / «تعالى» من ف / «دون صاحبه» في ي: «دون الآخر صـ صاحبه». \n4. 4 - «في» ليست في ي / «رضي الله عنه» من ت، س.",
    "book_id": "597",
    "new_page_number": 32
  },
  {
    "serial_number": "5531791",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 36,
    "volume_number": 1,
    "text": "باب الألف 5 - (1) اتفقا في أُسَامة بن زيد بن حارثة * وأَنَس بن مالك * وأُبَيّ بن كَعْب * وأُسَيد بن حُضَير * وأَسْلَم أبو (2) رافع * والأَشْعَث بن قيس * وأسماء بنت أبي بكر. 6 - (3) وانفرد مسلم بن الحَجَّاج بأبي أُمَامة بن ثَعْلَبة الحارثي، واسمه: إِيَاس * وبالأَغَرّ المُزَني. [ (4) ] 7 - وانفرد البخاري بأُهْبان بن أَوْس (5) * وإِيَاس بن البُكَير (6) .  باب الباء 8 - (7) اتفقا في بُرَيدة بن الحُصَيب الأَسْلَمي * والبَرَاء بن عازب الأنصاري * وبِلَال بن",
    "foot_note": "1. 5 - «بن حارثة» من ت، س، ك، ف / «وأسلم» في ي: «وأسلمة» / «أبو» في ي، هـ: «بن». \n2. قوله: «أبو» الوجه فيه أن يقال: أبي. \n3. 6 - «بن الحجاج» من ت، س، ك، ف / «الحارثي» في ت، س: «المزني» / «إياس» في ف: «الإياس». \n4. [] عزا ابن أبي الفوارس 66، وابن الجوزي في التلقيح ص 207، والمجتنى (ق 190 أ) إلى الدارقطني ههنا في أفراد مسلم: «أسماء بنت عُمَيس». وقد أخرج البخاري ومسلم عن أبي موسى الأشعري حديث أصحاب السفينة الذين قدموا من الحبشة، وفيه محاورة عمر بن الخطاب لأسماء، ولها ذكر عند مسلم في أحاديث أخر، ولم يخرجا من مسندها ولا من روايتها شيئًا، وقال ابن الجوزي في المجتنى: «وقال الدارقطني: انفرد بالإخراج عنها مسلم، ولم يَذْكر عدد ما أخرج لها». \n5. لم يخرج البخاري من مسنده شيئًا، وأخرج 4174 من فعله موقوفًا عليه، وأنه كان من أصحاب الشجرة. \n6. لم يخرج البخاري من مسنده شيئًا، وأخرج 3991 أنه كان بدريًا. \n7. 8 - «باب الباء» في ي: «حرف الباء»، وكذا ما بعده إلى باب الخاء / «الحصيب» في ت، س: «الخصيب» / «الأسلمي» من ي، ت، س، وفي ك، ف: «السلمي» / «الأنصاري» من ت، س، ك، ف.",
    "book_id": "597",
    "new_page_number": 33
  },
  {
    "serial_number": "5531792",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 37,
    "volume_number": 1,
    "text": "رَبَاح. 9 - (1) وانفرد البخاري بالبَرَاء بن مالك (2) .  باب التاء 10 - (3) خرَّج مسلم عن تَمِيم الداريّ حديثَ: «النصيحة» (4) * وأبي رِفاعة تَمِيم بن أُسَيد العَدَوي، ويقال: أَسِيد، وقيل: عبدالله بن الحارث.  باب الثاء 11 - (5) انفرد مسلم بإخراج ثَوْبان، مولى رسول الله صلى الله عليه وسلم. 12 - (6) وانفرد البخاري بثابت بن قيس بن شَمَّاس.",
    "foot_note": "1. 9 - «وانفرد» في ت، س، ي، هـ: «انفرد». \n2. أخرج مسلم 1496 في قصة الملاعنة، عن أنس: «إن هلال بن أمية قَذَفَ امرأته بشَرِيك بن سَحْماء، وكان أخا البراء بن مالك لأمه»، ولم أجد له في البخاري ذكرًا. ونقله عن الدارقطني: ابن أبي الفوارس 7، وابن الجوزي في التلقيح ص 198، وقال الباجي 1/ 437: «ذكر أبو الحسن الدارقطني أن البخاري انفرد بالإخراج عن البراء بن مالك، ولم أر له في الكتاب ذكرًا». \n3. 10 - «خرج» في هـ: «أخرج» / «حديث النصيحة» من ت، س، ك، ف / «وأبي» في ت، س، ك، ف: «وأبو» / «العدوي» من ت، س، ك، ف / «ويقال أسيد» في هـ: «ويقال ابن أسيد» / «وقيل عبدالله بن الحارث» من ت، س، ك، ف. \n4. يعني: ما أخرجه في الحديث 55 مرفوعًا: «الدين النصيحة»، قلنا: لمن، قال: «لله، ولكتابه، ولرسوله، ولأئمة المسلمين، وعامتهم». \n5. 11 - «انفرد \n…. وسلم» في ي: «لمسلم ثوبان»، وفي هـ: «أخرج مسلم عن ثوبان». \n6. 12 - «وانفرد البخاري بثابت» في ي: «البخاري ثابت»، وفي هـ: «وثابت».",
    "book_id": "597",
    "new_page_number": 34
  },
  {
    "serial_number": "5531793",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 38,
    "volume_number": 1,
    "text": "13 - (1) واتفقا في إخراج ثابت بن الضَحَّاك. 14 - (2) وانفرد البخاري بثَعْلَبة بن أبي مالك، خرج له حديثًا عن قيس بن سَعْد (3) .  باب الجيم 15 - (4) اتفقا في أبي ذَرّ جُنْدُب بن جُنَادة الغِفَاري * وجُنْدَب بن سفيان البَجَلي * وجُبَير ابن مُطْعِم * وجَرِير بن عبدالله البَجَلي * وجابر بن سَمُرة * وجابر بن عبدالله * وجُرْهُم، ويقال: جُرْثُم أبي ثَعْلَبة الخُشَني * وجُوَيرية بنت الحارث. 16 - (5) وخرَّج مسلم دونَ البخاري جُدَامة بنت وهب.  باب الحاء 17 - (6) اتفقا في إخراج حَكِيم بن حِزَام * وحُذَيفة بن اليَمَان * والحارث بن رِبْعِيّ أبي",
    "foot_note": "1. 13 - «واتفقا» في ي: «اتفقا». \n2. 14 - «وانفرد» من ت، س، ك، ف، وفي هـ: «انفرد» / «بثعلبة» في ي: «ثعلبة» / «أبي» من ي / «سعد» في ي: «سعيد». \n3. قال الباجي في ترجمة ثعلبة 1/ 451: «ذكر الشيخ أبو الحسن حديثه عن قيس بن سعد خاصة». وهو ممن اختلف في صحبته، ولم يخرج البخاري من مسنده شيئًا، وأخرج روايته عن عمر بن الخطاب 2881، 4071، وقيس بن سعد 2974. وذكره الدارقطني في التابعين الثقات ممن صحت روايته عند البخاري 1/ 89. \n4. 15 - «الغفاري» من ت، س، ك، ف / «جرثم» في ي، هـ: «جرثوم» / «أبي ثعلبة» في ت، س، ك، ف: «أبو ثعلبة» / «وجويرية» في ك، ف: «وجويرة». \n5. 16 - «وخرج مسلم دون البخاري» في ي، هـ: «ولمسلم وحده» / «جدامة» في ت، س، ك، ف: «جذامة» / «بنت» في ت، س: «بن». \n6. 17 - «إخراج» من ت، س، ك، ف / «حزام» في ك: «جذام»، وفي ف: «حذام» / «أبي قتادة» في ت، س، ك، ف: «أبو قتادة» / «وحارثة» في ت، س: «والحارث»، وفي ك، ف: «وحارث» / تقدم حسان على حفصة في ي، هـ.",
    "book_id": "597",
    "new_page_number": 35
  },
  {
    "serial_number": "5531794",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 39,
    "volume_number": 1,
    "text": "قَتادة * وحارثة بن وَهْب الخُزَاعي * وحَفْصة بنت عمر بن الخَطّاب * وحَسّان بن ثابت. 18 - (1) وانفرد مسلم بحُذَيفة بن أَسِيد أبي سَرِيحة الغِفَاري * وبحَُميل بن بَصْرة أبي بَصْرة الغِفَاري * وبالحارث بن عَوْف أبي واقد اللَيْثي (2) * وبحَنْظَلة الكاتب * وبحمزة بن عمرو الأَسْلَمي (3) . 19 - (4) وانفرد البخاري بإخراج الحَكَم بن عمرو الغِفَاري * وبحَزْن بن أبي وَهْب. [ (5) ]",
    "foot_note": "1. 18 - «أسيد» في ي: «أسد» / «أبي سريحة» في ف: «أبو سريحة» / «أبي بصرة» ليس في هـ / «عوف» في ك، ف: «عزو» / «أبي واقد» في ك، ف: «عواقد» / «وبحنظلة» في ي: «وحنظلة» / «وبحمزة» في ي: «وحمزة» / «عمرو» في ف: «عمر» / «الأسلمي» في ك، ف: «السلمي». \n2. ذكر في ي، هـ فيما اتفقا فيه، وقال الباجي في ترجمته 2/ 512: «قال أبو الحسن الدارقطني: انفرد مسلم بالإخراج عنه، وأراه لم يتذكر هذا الحديث»، يعني: ما أخرجه عنه البخاري 66، 474 في ذكر الجلوس في المسجد، وهو عند مسلم 861، 2176. \n3. قال المنذري -كما في حاشية» الجمع بين رجال الصحيحين «لابن طاهر 1/ 106 - :» قد استشهد البخاري بحمزة بن عمرو الأسلمي في أول كتاب الكفالة «، ورمز له ابن حجر في التقريب» خت «، والمراد: ما أخرجه البخاري 2290 تعليقًا، وفيه قصة لحمزة بن عمرو مع عمر بن الخطاب. وأخرج البخاري 1942، 1943 عن عائشة، أن حمزة بن عمرو الأسلمي قال \n…. ، ورواه مسلم من مسند حمزة بن عمرو. \n4. 19 - «أبي» من ت، س، ك، ف. \n5. [] زيد هنا في ي، هـ: «وحُوَيطِب بن عبدالعُزَّى». وقد روى البخاري حديثه 7163 من طريق عمرو ابن الحارث، عن الزهري، عن السائب بن يزيد، عنه، عن عبدالله بن السَعْدي، عن عمر، ورواه مسلم أيضًا (1045 ط. عبدالباقي، 3/ 98 ط. التركية) من طريق عمرو، فأورده المزي في التحفة 8/ 39 معطوفًا على إسناد البخاري بذكر حويطب فيه، لكنَّ حويطبًا ساقط من إسناد مسلم، وقد نبه العلماء على سقوطه، كأبي علي الجياني في تقييد المهمل 3/ 833، والمازري في المعلم 2/ 20، وعياض في شرح مسلم 3/ 580، ومشارق الأنوار 2/ 349، والرشيد العطار في غرر الفوائد ص 192، والنووي في شرح مسلم 7/ 136، والسيوطي في الديباج 3/ 125. وتعقب المزيَّ فيه: العراقيُ كما في الإطراف لابنه ص 156، وابنُ حجر في النكت 8/ 39، والفتح ح 7163. هذا، وذكر الدارقطني حويطبًا في التابعين الثقات ممن صحت روايته عند البخاري 1/ 120، وقال: «له صحبة، عن ابن السَعْدي، عن عمر»، ولم يورده في رجال مسلم، وذكره الحاكم 2/ 23 في الصحابة، وفي أفراد البخاري من التابعين 2/ 239، ولم يورده ابن أبي الفوارس في رسالته. لكنَّ ابن منجويه ذكره في رجال مسلم 1/ 177، وتبعه ابن طاهر 1/ 114، فذكره فيمن أخرج لهم الشيخان، ورمز له المزي في التهذيب (خ م س)، وتبعه مختصروه، إلا أن ابن حجر قال في التهذيب 2/ 44: «روى له الشيخان والنسائي \n…. ثم سقط ذكر حويطب من كتاب مسلم في جميع النسخ».",
    "book_id": "597",
    "new_page_number": 36
  },
  {
    "serial_number": "5531795",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 40,
    "volume_number": 1,
    "text": "باب الخاء 20 - (1) اتفقا في إخراج خَبَّاب بن الأَرَتّ * وخالد بن زيد أبي أَيُّوبَ الأنصاري * وخالد ابن الوليد * [ (2) ] وخَوْلة بنت حَكِيم (3) .",
    "foot_note": "1. 20 - «زيد أبي» في ف: «زيد بن أبي» / «وخولة» في هـ: «وخويلة». \n2. [] زيد هنا في ي، هـ: «وخُوَيلد بن عمرو أبي شُرَيح العَدَوي». \n3. قال الباجي في ترجمتها 3/ 1282: «ذكر الشيخ أبو الحسن أنهما اتفقا على الإخراج عنها»، ولم يخرج البخاري من مسندها ولا من روايتها شيئًا، وأخرج 5113 عن عروة: كانت خولة بنت حكيم من اللائي وهبن أنفسهن للنبي صلى الله عليه وسلم.",
    "book_id": "597",
    "new_page_number": 37
  },
  {
    "serial_number": "5531796",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 41,
    "volume_number": 1,
    "text": "21 - (1) وانفرد مسلم بخُفَاف بن إِيْماء بن رَحَضة * وخُزَيمة بن ثابت (2) . 22 - (3) وانفرد البخاري بخَوْلة بنت ثامر * وخَنْساء بنت خِذَام.  باب الذال 23 - (4) أخرج مسلم دون البخاري ذُؤَيبًا، والدَ قَبِيصة بن ذُؤَيب.  باب الراء 24 - (5) اتفقا في رِفَاعة بن عبدالمُنْذِر أبي لُبَابة * ورافع بن خَدِيج * والرُبَيِّع بنت مُعَوّذ بن عَفْراء * ورَمْلة أمِّ حَبِيبة بنت أبي سفيان. 25 - (6) وانفرد البخاري برافع بن المُعَلّى أبي سَعِيد * وبرِفَاعة بن رافع الزُرَقي. 26 - (7) وانفرد مسلم برافع بن عمرو الغِفَاري * وبرَبِيعة بن كعب الأَسْلَمي *",
    "foot_note": "1. 21 - «رحضة» في ف: «رخصة». \n2. استدرك ابن حجر على المزي 3/ 123 في مسند خزيمة ما أخرجه البخاري (2807 وغيره) عن زيد بن ثابت، أنه لما جمع القرآن وجد آخر التوبة مع خزيمة بن ثابت. \n3. 22 - «بخولة» في هـ: «بخويلة» / «ثامر» في ي: «تامر» / «وخنساء» في ك، ف: «وبخنساء» / «خذام» في ت، س: «حرام»، وفي ك، ف: «خزام»، وفي ي: «حدام». \n4. 23 - «والد قبيصة بن ذؤيب» ليس في ت. \n5. 24 - «باب الراء اتفقا» ليس في ت / «عبد» من ي، هـ / «أبي» من ي، هـ، وفي ت، س: «بن» / «لبابة» ليس في ك، ف. \n6. 25 - «بن رافع» في هـ: «بن أبي رافع» / «الزرقي» من ي، هـ. \n7. 26 - «عمرو» في ك، ف: «عمص» / «وبالرميصاء» في ت، س: «وبالرميضاء» / «أم» في ت: «من»، وفي س: «بن» / «والله أعلم» من هـ.",
    "book_id": "597",
    "new_page_number": 38
  },
  {
    "serial_number": "5531797",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 42,
    "volume_number": 1,
    "text": "وبالرُمَيصاء أمِّ سُلَيم (1) . والله أعلم.  باب الزاي 27 - (2) اتفقا في إخراج زيد بن ثابت * وزيد بن أَرْقَم * وزيد بن سَهْل أبي طَلْحة * وزيد بن خالد الجُهَني * والزُبَير بن العَوَّام * وزينب بنت أم سَلَمة (3) * وزينب بنت جَحْش * وزينب الثَقَفِية، امرأةِ عبدِالله بن مَسْعُود. 28 - (4) وانفرد مسلم بزيد بن الخَطَّاب (5) * وزُهَير بن عمرو.",
    "foot_note": "1. ذكرت في ي، هـ ههنا فيما اتفقا فيه، وذكرها الدارقطني على الصواب مرة أخرى في باب النساء المكنيات فيما اتفقا فيه، وقال الباجي 3/ 1284: «ذكر الشيخ أبو الحسن أن مسلمًا انفرد بالإخراج عن الرميصاء أم سليم، قال: ويقال بالشين، ثم قال في باب كنى النساء: إنهما اتفقا على الإخراج عن أم سليم». وقوله نقلًا عن الدارقطني: «ويقال بالشين» لعل صوابه: ويقال بالغين، أي: الغُمَيصاء، ولم أجد كلام الدارقطني هذا. \n2. 27 - «الزاي» في ت، س: «الزاء» / «والزبير بن العوام» في ت: «والزبير العوام» / «وزينب بنت أم» في ت: «وزينب أم» / «عبدالله» من ت، س، ك، ف. \n3. ذكرها الدارقطني في التابعين الثقات ممن صحت روايته في الصحيحين 1/ 146، 2/ 303، ولعل ذلك؛ لأن أكثر روايتها عن الصحابة، وقد ثبتت لها الصحبة، ولها في الصحيحين حديث مسند. \n4. 28 - «وانفرد» في ت، س، ك: «انفرد» / «مسلم» ليس في ت / «وزهير» في ت، س: «وزبير». \n5. رمز له المزي» خت «، وتبعه مختصروه -إلا الذهبي في الكاشف؛ فأغفله-، وروى حديثه البخاري 3297، ومسلم 2233، من طريق الزهري، عن سالم، عن ابن عمر، في الأمر بقتل الحيات، وفيه: أن أبا لبابة الأنصاري أخبر ابن عمر بالنهي عن قتل ذوات البيوت؛ واختلف على الزهري فيه؛ فقيل عنه هكذا، وقيل عنه: أخبره أبو لبابة أو زيد بن الخطاب -بالشك-، وقيل عنه: أخبراه كلاهما. فأخرج البخاري الوجه الأول -في مواضع- مسندًا، وأخرج الوجهين الآخرين معلقين، وأخرجها مسلم جميعًا مسندة.",
    "book_id": "597",
    "new_page_number": 39
  },
  {
    "serial_number": "5531798",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 43,
    "volume_number": 1,
    "text": "29 - (1) وانفرد البخاري بزاهر الأَسْلَمي، والدِ مَجْزَأة بن زاهر.  باب السين 30 - (2) اتفقا في سَهْل بن سَعْد الساعِدي * وسَهْل بن حُنَيف * وسَهْل بن أبي حَثْمة * وسَلْمان الفارسي * وسَلَمة بن الأَكْوَع * وسائب بن يزيد * وسَمُرة بن جُنْدَب * وسفيان بن أبي زُهَير * وسُبَيعة الأَسْلَمية * وسليمان بن صُرَد. 31 - (3) وانفرد مسلم بسَبْرة بن مَعْبَد * وسَعْد بن مُعَاذ (4) [ (5) ] * وسَمُرة بن مِعْيَر أبي مَحْذُورة * وسفيان بن عبدالله الثَقَفي * وسُوَيد بن مُقَرِّن * وسَفِينة، مولى رسول الله",
    "foot_note": "1. 29 - «الأسلمي» من ت، س، ك، ف / «بن زاهر» من ي، هـ. \n2. 30 - «اتفقا» من ف، ي، هـ / «في» من ف، هـ، وفي ي: «على» / «سهل بن سعد» في ك، ف: «سهيل بن سعيد» / واو العطف بين الأسماء ليست في ت، س، ك / «سهل» في ك، ف: «سهيل» / «سهل بن أبي» في ت: «بن أبي» / «حثمة» في ي: «حيثمة» / «سائب» في ي، هـ: «السائب» / «يزيد» في ك، ف: «زيب» / «بن أبي زهير» في ت، س، ك، ف: «بن زهير». \n3. 31 - «وسمرة» في هـ: «وسلمة»، وفي حاشيتها: «وقيل: سمرة، وقيل: أوس» / «معير» في ت، س: «مغير»، وفي ك، ف: «معيب» / «أبي» في ت، س: «أبو» / «محذورة» في ي: «معدرة»، وفي س: «محرورة»، وفي حاشيتها: «لعله: أبو محذورة صح». \n4. ذكر في ي، هـ في أفراد البخاري. وأخرج البخاري 3950 حديثًا عن ابن مسعود، عن قصة سعد، وأخرجه قبل ذلك 3632 من مسند ابن مسعود، ولسعدٍ ذكرٌ عند مسلم في عدة أحاديث، ولم يخرج من مسنده ولا من روايته شيئًا. \n5. [] زيد هنا في ي، هـ: «وسَلَمة بن يزيد الجُعْفي». ولم يخرج مسلم من مسنده ولا من روايته شيئًا، وأخرج 1846 عن وائل بن حجر قال: سأل سلمة رسول الله صلى الله عليه وسلم.",
    "book_id": "597",
    "new_page_number": 40
  },
  {
    "serial_number": "5531799",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 44,
    "volume_number": 1,
    "text": "صلى الله عليه وسلم. 32 - (1) واتفقا في سَعْد بن أبي وَقَّاص * وسَعْد بن مالك أبي سَعِيد الخُدْري * وسَعِيد بن زيد بن عمرو بن نُفَيل. 33 - (2) وانفرد البخاري بسَلْمان بن عامر الضَبّي * وسُوَيد بن النُعْمان * وسَلِمة الجَرْمي، والدِ عمرو (3) * وسُنَين أبي جَمِيلة * وسالم، مولى أبي حُذَيفة (4) ، ذكره في حديث عبدالله بن عمرو (5) ، وقد قيل: إن سالمًا رأى النبي صلى الله عليه وسلم (6) *",
    "foot_note": "1. 32 - «واتفقا» في ت، س، ك: «اتفقا» / «الخدري» في س: «الخذري» / «وسعيد» في ف: «وسعد» / «نفيل» في س: «نفنل». \n2. 33 - «وسنين» في ك، ف: «وسفيان» / «أبي جميلة» في ت، س: «بن جميلة»، وفي ف: «بن أبي جميلة» / «عبدالله» من ت، س، ك، ف / «بن عمرو» في هـ: «بن عمر» / «وقد قيل \n…. وسلم» من ت، س، ك، ف / «وسودة» في ك، ف: «وسورة». \n3. نقله عن الدارقطني: ابن الجوزي في التلقيح ص 200. \n4. نقله عن الدارقطني: ابن أبي الفوارس 26، وابن الجوزي في التلقيح ص 200، والمجتنى (ق 212 أ). \n5. يعني: ما أخرجه (3758 وغيره) عن عبدالله بن عمرو بن العاص مرفوعًا: «استقرئوا القرآن من أربعة»، وذكر منهم سالمًا، وأخرج أيضًا 692، 7175 عن عبدالله بن عمر بن الخطاب: كان سالم يؤم المهاجرين الأولين. وقد أخرج مسلم 2464 حديث عبدالله بن عمرو، وأخرج حديثًا آخر 1453، 1454 في ذكر رضاعة سالم وهو كبير. \n6. قوله: «رأى النبي صلى الله عليه وسلم» لعل صوابه: روى عن النبي صلى الله عليه وسلم، وهذه إشارة إلى ضعف ما روي عن سالمٍ من أحاديث مرفوعة إلى النبي صلى الله عليه وسلم. وقال ابن الجوزي في المجتنى (ق 212 أ): «وقد روى عن رسول الله، ولا نحصي كم روى».",
    "book_id": "597",
    "new_page_number": 41
  },
  {
    "serial_number": "5531800",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 45,
    "volume_number": 1,
    "text": "وسَوْدة بنت زَمْعة (1) .  باب الشين 34 - (2) انفرد البخاري بشَيْبة بن عثمان. 35 - (3) وانفرد مسلم بشَرِيد بن سُوَيد الثَقَفي. 36 - واتفقا في إخراج شَدَّاد بن أَوْس.  باب الصاد 37 - اتفقا في أبي أُمَامة صُدَيّ بن عَجْلان * وصُهَيب بن سِنَان (4) * وأبي سُفيان صَخْر ابن حَرْب * وصَفِية بنت حُيَيّ (5) بن أَخْطَب. 38 - (6) وانفرد مسلم بصَفْوان بن أُمَية الجُمَحي (7) * والصَعْب بن",
    "foot_note": "1. لها ذكر عند مسلم في عدة أحاديث، ولم يخرج من مسندها ولا من روايتها شيئًا. \n2. 34 - «بشيبة» في ت: «بشيب». \n3. 35 - «الثقفي» من ي، هـ. \n4. ذكر في ي، هـ في أفراد مسلم، ورمز له المزي» ع «، وتبعه مختصروه، وزاد الخزرجي في الخلاصة:» انفرد له البخاري بحديث، ومسلم بثلاثة «، ولم يخرج البخاري من مسنده شيئًا، وأخرج 2219، 1287، 1290 من قوله موقوفًا عليه. \n5. فوقها في ك، وفي حاشية ف: «تصغير حيّ». \n6. 38 - «بن جثامة» من هـ، وفي ي: «بن حثمامة». \n7. رمز له المزي» خت «، وتبعه مختصروه، وأخرج البخاري قبل 2423 تعليقًا:» اشترى نافع بن عبدالحارث دارًا للسجن بمكة من صفوان بن أمية». وقال الباجي 2/ 789: «قال الشيخ أبو الحسن: انفرد مسلم بالإخراج عن صفوان بن يعلى، وذلك كلُّه في جملة من أَخْرج عنه من الصحابة في الرواية عن النبي صلى الله عليه وسلم، وإنما أخرج البخاري عنه عن أبيه، والله أعلم»، ولعله اشتبه على الباجي صفوانُ بن يعلى بن أمية بصفوان بن أمية الجمحي، فلم يذكر الدارقطني الأول ههنا في الصحابة، وذكره في كتابه: «ذكر أسماء التابعين» 1/ 179، وذكر الثانيَ ههنا في الصحابة، ولم يذكره في» ذكر أسماء التابعين «، ولم يذكر الباجي في كتابه إلا صفوان بن يعلى.",
    "book_id": "597",
    "new_page_number": 42
  },
  {
    "serial_number": "5531801",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 46,
    "volume_number": 1,
    "text": "جَثَّامة (1) . 39 - (2) وانفرد البخاري بإخراج صَفِية بنت شَيْبة، وهو في الأحاديث التي تُعَد فيما أخرجه من المراسيل، وليس بصحيحٍ رُؤْيَتُها للنبي صلى الله عليه وسلم، واختُلف في ذلك (3) . [ (4) ]",
    "foot_note": "1. ذكر في ي، هـ فيما اتفقا فيه، وقد أخرج له البخاري (1825 وغيره) ومسلم 1193، 1194، 1745. \n2. 39 - «وهو في» في ي، هـ: «وهو من»، وفي ك: «وهو» / «فيما» في ي، هـ: «مما» / «بصحيح» في هـ: «يصح» / «رؤيتها» في ت، س، ك، هـ: «روايتها»، وفي ي: «وايتي» / «للنبي» في ي: «إلى النبي» / «واختلف» في ي، هـ: «اختلف». \n3. نقل الباجي 3/ 1290 والعيني في عمدة القاري 20/ 156 كلام الدارقطني ههنا بحروفه، ونقل جماعةٌ -منهم: عياض في مشارق الأنوار 2/ 342، والمزي في التهذيب 35/ 211، والذهبي في السير 6/ 7، وابن حجر في الفتح ح 5172، والتهذيب 6/ 548، والتقريب 8622، وأبو زرعة ابن العراقي في تحفة التحصيل ص 634 - عن الدارقطني أن صفية بنت شيبة لا تصح لها رؤية. وذكرها الدارقطني في التابعين الثقات ممن صحت روايته في الصحيحين 1/ 181، 2/ 302، وإنما ذكرها الدارقطني ههنا؛ لأن لها حديثًا مسندًا. \n4. [] زيد هنا في ي، هـ: «باب الضاد. اتفقا في إخراج الضَحَّاك بن قيس الفِهْري». ولم يخرج البخاري ومسلم من مسنده شيئًا، ولم أجد له في البخاري ذكرًا، وأخرج مسلم 878 عن عبيدالله بن عبدالله، قال: كتب الضحاك بن قيس إلى النعمان بن بشير.",
    "book_id": "597",
    "new_page_number": 43
  },
  {
    "serial_number": "5531802",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 47,
    "volume_number": 1,
    "text": "باب الطاء 40 - اتفقا في إخراج طَلْحة بن عُبَيدالله. 41 - (1) وانفرد مُسْلِم بن الحَجَّاج بطارق بن أَشْيَم بن (2) أبي مالك الأَشْجَعي.  باب الظاء 42 - اتفقا في ظُهَير بن رافع.  باب العين 43 - (3) اتفقا في إخراج عبدالله بن عثمان، وهو أبو بكر الصِدِّيق * وفي عمر بن الخَطَّاب",
    "foot_note": "1. 41 - «بن الحجاج» من ت، س، ك، ف / «أشيم بن أبي» في ي، هـ: «أشيم أبي». \n2. قوله: «بن» صوابه: أبي، أو: والد؛ لأن أبا مالك هو سعد بن طارق بن أشيم، وكنية أبيه طارق: أبو عبدالله. \n3. 43 - «اتفقا في» ليس في ت، س، ك / «إخراج» من ي، هـ / «إخراج عبدالله» في هـ: «إخراج أبي بكر عبدالله» / «وهو» من ف / «أبو بكر» في ي: «بن أبي بكر»، وفي هـ: «أبي قحافة» / «وفي» من ف، وفي ي، هـ: «و»، وواو العطف بين الأسماء ليست في ت، س، ك / تقدم عبدالله بن جعفر على ابن عباس في هـ / جاء عبدالله بن عمر قبل عبدالرحمن بن عوف في ف / «بن العوام» من ت، س، ك، ف / «وعبدالله بن زيد» في ت: «عبد بن زيد» / «مغفل» من ت، س، ك، هـ، وفي ي: «معقل»، وسقط الاسم من ف / «بحينة» في ي: «عنبه»، وفي هـ: «غنية» / «وعبدالله بن بسر» جاء بعد أبي موسى الأشعري في هـ / «بسر» في ت، ك، ف، ي: «بشير»، وفي س: «بشر» / «عبدالله بن عمرو» ليس في هـ، وفي ي جاء بعد أسماء تالية زائدة / «بن العاص» من ي / «وعبدالله بن قيس» في ك، ف: «بن قيس» / «أبي موسى» في ت، س، ك: «أبو موسى» / «سمرة وعبدالرحمن بن» في ف: «سمرة بن» / «أبزى» في ت، س: «اتوا» / «وعبدالرحمن بن سعد» في ك: «عبدالرحمن بن عمرو بن سعد»، وفي ف: «وعبدالرحمن بن سمرة بن عبدالرحمن بن أبي بكر الصديق وعبدالرحمن بن عمرو بن سعد» / «أبي حميد» في ت، س، ك: «أبو حميد» / «الساعدي» في ت: «الساعد» / «وأبي هريرة» في ت، س، ك: «أبو هريرة»، وفي ف: «وعبدالرحمن بن هريرة» / «واسمه عبد» ليس في ف، وفي ي، هـ: «اسمه عبد» / «حاتم والعلاء» في ت، ك: «حاتم بن عمرو العلاء»، وفي ف: «حاتم بن عمرو والعلاء»، وفي س: «حاتم بن عمرو بن العلاء» / «وعقبة .... الأنصاري» ليس في ي / «أبي مسعود» في ت، س، ك: «أبو مسعود» / «وعمر بن أبي سلمة» جاء بعد أبي الدرداء في ي، هـ، وفي ك: «عمرو بن أبي سلمة»، وفي ف: «وعمرو بن أبي سلمة» / «بن أمية» في ف: «بن عمرو بن أمية» / «الضمري» من ي، هـ / «العاص» في ك، ف: «العاصي» / «وعمرو بن عوف وعويمر» في ت، س: «عمر بن عوف عوف بن مالك عويمر»، وفي ك: «عمر بن عوف بن مالك عويمر»، وفي ف: «وعمر بن عوف بن مالك وعويمر» / «أبي الدرداء» في ت، س، ك: «أبو الدرداء» / «رضي الله عنهم» من ت، س، ك، ف.",
    "book_id": "597",
    "new_page_number": 44
  },
  {
    "serial_number": "5531803",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 48,
    "volume_number": 1,
    "text": "* وعثمان بن عَفَّان * وعلي بن أبي طالب * وعبدالرحمن بن عَوْف * وعبدالله بن عَبَّاس * وعبدالله بن جَعْفَر بن أبي طالب * وعبدالله بن عمر بن الخَطَّاب * وعبدالله ابن مَسْعُود * وعبدالله بن الزُبَير بن العَوَّام * وعبدالله بن سَلَام (1) * وعبدالله بن زيد ابن عاصم * وعبدالله بن مُغَفَّل * وعبدالله ابن بُحَينة * وعبدالله بن أبي أَوْفى * وعبدالله بن بُسْر * وعبدالله بن عمرو بن العاص * وعبدالله بن قَيْس أبي موسى الأَشْعَري * [ (2) ] وعبدالرحمن بن سَمُرة * وعبدالرحمن بن أبي بكر الصِدِّيق *",
    "foot_note": "1. فوقها في ك: «بتخفيف اللام»، وفي حاشية ف: «مخففة اللام». \n2. [] زيد هنا في ي، هـ: «وعبدالله بن زيد الأنصاري». وهو عبدالله بن زيد بن عاصم المتقدم آنفًا. ثم ذكر بعده في هـ عبدالله بن يزيد الأنصاري الآتي في أفراد البخاري. ثم زيد في ي: «وعبدالله بن مالك ابن بُحَينة». وهو عبدالله ابن بُحَينة المتقدم آنفًا، وبُحَينة أُمُّه. ثم ذكر فيها بعده عبدالله بن عمرو بن العاص المتقدم آنفًا. ثم زيد فيها: «وعبدالله بن الشمري، وهو عبدالله بن وَقْدان». وقوله: «الشمري» صوابه: السَعْدي، ولم يخرج البخاري ومسلم من مسنده شيئًا، وأخرجا روايته عن عمر بن الخطاب. ثم زيد فيها: «وعبدالله بن عامر بن رَبِيعة». وهو ممن ولد على عهد النبي صلى الله عليه وسلم، ولم يخرج البخاري ومسلم من مسنده شيئًا، وأخرجا روايته عن أبيه وغيرِه. وذكره الدارقطني في التابعين الثقات ممن صحت روايته في الصحيحين 1/ 189، 2/ 138. ثم زيد في ي، هـ: «وعبدالله بن عبدالأَسَد أبي سَلَمة، روى له مسلم، عن أم سَلَمة، عنه». ولم يخرج البخاري ومسلم من مسنده ولا من روايته شيئًا، وله ذكر عندهما في عدة أحاديث، وأخرج الترمذي والنسائي وابن ماجه عن أبي سلمة مرفوعًا: «إذا أصاب أحدكم مصيبة \n…. »، ورواه مسلم من مسند أم سلمة.",
    "book_id": "597",
    "new_page_number": 45
  },
  {
    "serial_number": "5531804",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 49,
    "volume_number": 1,
    "text": "وعبدالرحمن بن أَبْزَى (1) * وعبدالرحمن بن سَعْد أبي حُمَيد الساعدي * وأبي هُرَيرة الدَوْسي، واسمه: عَبْد * وعُبَادة بن الصامت * وعامر بن رَبِيعة * والعَبَّاس بن عبدالمُطَّلِب * وعَدِي بن حاتم * والعَلَاء بن الحَضْرَمي * وعِتْبان بن مالك * وعِمْران ابن حُصَين * وعُقْبة بن عمرو أبي مَسْعُود الأنصاري * وعُقْبة بن عامر الجُهَني * وعُرْوة البارِقي * وعَمَّار بن ياسر * وعَوْف بن مالك * وعمر بن أبي سَلَمة * وعمرو ابن أُمَيّة الضَمْري * وعمرو بن العاص * وعمرو بن عَوْف * وعُوَيمِر أبي الدَرْداء * [ (2) ] وعائشة بنت أبي بكر. رضي الله عنهم. 44 - (3) وانفرد مسلم بعُتْبة بن غَزْوان * وعِيَاض بن حِمَار * وعُمَارة بن رُوَيبة *",
    "foot_note": "1. لم يخرج مسلم من مسنده شيئًا، وأخرج من روايته عدة أحاديث. \n2. [] زيد هنا في ي، هـ: «وعائذ بن عَمرو المُزَني»، وقد أخرج له مسلم 1830، 2504، وأخرج البخاري 4176 من قوله موقوفًا عليه، ولم يخرج من مسنده ولا من روايته شيئًا. \n3. 44 - «وانفرد» في ت، س، ك: «انفرد» / «بعتبة بن غزوان» في س: «بعتيبة بن عزوان» / «وعياض» في ك، ف: «وعياش» / «حمار» في ف: «جمار» / «وعمارة» في ي: «وعمار»، وفي ت: «وعبادة» / «وعمير» في هـ: «وعمر» / «أخطب» في ي: «الأخطب» / تكرر عتبة بن غزوان في ت، س بعد عمرو ابن أخطب / «بن شريح» من ي، هـ، وفي ك، ف: «بن أسعد» / «وعدي» في س: «وعبدي» / «الكندي» من ت، س، ك، ف / «العاص» في ت، س: «العاصي» / «وعبدالمطلب» في ت، س، ك: «عبدالمطلب» وكذا سقطت واو العطف بين الأسماء التالية فيها، ووضعت علامة التصحيح» صح «بين كل اسمين في س /» وعبدالرحمن بن عثمان \n…. ربيعة «ليس في ي /» العابدي «من ي، وفي هـ:» الغامدي» / «جهم» في ت، س، ك، ف: «جعفر».",
    "book_id": "597",
    "new_page_number": 46
  },
  {
    "serial_number": "5531805",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 50,
    "volume_number": 1,
    "text": "[ (1) ] وعُمَير، مولى آبي اللَحْم * وعَمرو بن حُرَيث (2) * وعَمرو بن أَخْطَب * وعَرْفَجة ابن شُرَيح * وعَدِي بن عَمِيرة الكِنْدي * وعثمان بن أبي العاص * وعبدالمُطَّلِب بن رَبِيعة * وعبدالرحمن بن عثمان التَيْمي (3) * وعبدالله بن رَبِيعة (4) * وعبدالله بن السائب (5) * وعبدالله بن الشِخِّير * وعبدالله بن المُسَيّب العابدي (6) * وعبدالله بن",
    "foot_note": "1. [] زيد هنا في ي، هـ: «وعَمرو بن عَبَسة السُلَمي». \n2. ذكر في ي، هـ فيما اتفقا فيه. ولم يخرج البخاري من مسنده شيئًا، وأخرج من روايته عدة أحاديث. \n3. نقله عن الدارقطني: ابن الجوزي في التلقيح ص 203، وسماه: عبدالله بن عثمان، وعند ابن أبي الفوارس 38: «عبدالله بن عثمان»، والصواب فيهما: عبدالرحمن بن عثمان. \n4. نقله عن الدارقطني: ابن أبي الفوارس 38، وابن الجوزي في التلقيح ص 203، ولم أجد له في الصحيحين ذكرًا. \n5. أخرج البخاري حديثه قبل 775 تعليقًا. \n6. قال ابن حجر في التقريب: «وهم من ذكره في الصحابة»، ولم يخرج مسلم من مسنده شيئًا، وأخرج 455 روايته عن عبدالله بن السائب.",
    "book_id": "597",
    "new_page_number": 47
  },
  {
    "serial_number": "5531806",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 51,
    "volume_number": 1,
    "text": "أُنَيس (1) * [ (2) ] وعامر بن حُذَيفة، يكنى بأبي جَهْم (3) * [ (4) ] وعامر بن واثلة أبي الطُفَيل. 45 - (5) وانفرد البخاري بعبدالله بن زَمَْعة (6) * وعبدالله بن ثَعْلَبة بن صُعَير * وعبدالله",
    "foot_note": "1. أخرج البخاري حديثه قبل 7481 تعليقًا. \n2. [] زيد هنا في ي، هـ: «وعبدالله بن سَرْجِس». \n3. نقله عن الدارقطني: ابن أبي الفوارس 38، ولم يخرج مسلم من مسنده ولا من روايته شيئًا، وأخرج هو 556 والبخاري 373، 752، 5817 عن عائشة في الخَمِيصة: «اذهبوا بها إلى أبي جهم». \n4. [] زيد هنا في ي، هـ: «وعبدالله بن صَفْوان، روى عن: حَفْصة، وأمِّ سَلَمة، أُمَّيْ (وفي ي: أم) المؤمنين، ذكره الحاكم» .. وقد اختلف في صحبته، ولم يخرج مسلم من مسنده شيئًا، وأخرج 2882، 2883 روايته عن أمي المؤمنين: أم سلمة وحفصة، وذكره الحاكم في الصحابة 2/ 59، وذكره الدارقطني في التابعين الثقات ممن صحت روايته عند مسلم 2/ 134. \n5. 45 - «زمعة» في ت، س، ك، ف: «ربيعة» / «وعبدالله بن هشام» في ت، س، ك: «وبعبدالله بن هشام» / «جد» في ت، س، ك، ف: «بن» / «بن معبد» من ي، هـ / «أبي عبس بن جبر» في هـ: «بن أبي عبس ابن جبر»، وفي ت، س، ك، ف: «بن عيسى» / «وبأبي عامر» في ي، هـ: «وأبي عامر» / «واسمه» ليس في هـ / «ويقال عمرو» من ت، س، وفي ك، ف: «ويقال له عمرو» / «وبأبي عبيدة» في ك، ي، هـ: «وأبي عبيدة» / «وبعقبة» في ي، هـ: «وعقبة»، وفي س: «وبعتيبة» / «بن الحارث» في ت: «الحارث»، وفي هـ: «بن عامر بن عبدالله وعقبة بن الحارث» / «وبعمرو» في ي، هـ: «وعمرو» / «تغلب» في ي: «ثعلبة»، وفي ك، ف: «ثعلب» / تكرر عقبة بن الحارث في ت، س، ك، ف قبل عاصم بن ثابت / «بن أبي الأقلح» في هـ: «بن الأفلح»، وفي ت، س، ك، ف: «بن الأقلح» / «والعداء» في ك: «والعدي»، وفي ف: «والعدوي»، وفي هـ: «والعباس» / بيض بمقدار كلمة بين» حديث «و» بلا «في ي. \n6. أخرج له مسلم أيضًا 2855.",
    "book_id": "597",
    "new_page_number": 48
  },
  {
    "serial_number": "5531807",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 52,
    "volume_number": 1,
    "text": "ابن هِشَام، جَدِّ زُهْرة بن مَعْبَد * وعبدالله بن يزيد الأنصاري (1) * وعبدالرحمن أبي عَبْس بن جَبْر (2) * وبأبي عامر الأَشْعَري (3) ، واسمه: عُبَيد، ويقال: عَمرو (4) * وبأبي عُبَيدة بن الجَرَّاح عامر بن عبدالله (5) * وبعُقْبة بن الحارث * وبعَمرو بن تَغْلِب * وأبي رَجَاء عِمْرانَ العُطَارِدي، وهو مُخَضْرَم (6) * وعمرو بن سَلِمة الجَرْمي (7) * وعمرو ابن الحارث بن المُصْطَلِق (8) * وعاصم بن ثابت بن أبي الأَقْلَح (9) * والعَدَّاء بن …",
    "foot_note": "1. لم يذكر في ي، وذكر في هـ فيما اتفقا فيه، وقد أخرج له البخاري 2474، 5516، وأخرج هو 1022 ومسلم 1254 من فعله موقوفًا عليه، وذكره الدارقطني في التابعين الثقات ممن صحت روايته عند البخاري 1/ 189، ولعل ذلك؛ لأنه من صغار الصحابة. \n2. أخرج مسلم 1801 عن جابر قصة قتل أبي عبس بن جبر كعبَ بن الأشرف. \n3. أخرج البخاري حديثه 5590 تعليقًا، بالشك بينه وبين أبي مالك الأشعري. \n4. الذي قيل في اسمه: عمرو هو أبو مالك الأشعري .. \n5. أخرج مسلم حديثه 1935، ولم يخرج البخاري من مسنده ولا من روايته شيئًا، وله ذكر \n…. عندهما في عدة أحاديث. \n6. لم تثبت له الصحبة،، وذكره الدارقطني في التابعين الثقات ممن صحت روايته في الصحيحين 1/ 271، 2/ 187، وإنما ذكره الدارقطني ههنا؛ لأن له في البخاري حديثًا أسنده إلى زمان النبي صلى الله عليه وسلم. \n7. لم يخرج البخاري من مسنده شيئًا، وأخرج 4302 روايته عن أبيه. \n8. ذكر في ي، هـ فيما اتفقا فيه، وفي هـ: «وعمرو بن الحارث المُصْطَلِقي». وقد أخرج له البخاري (2739 وغيره)، ولم أجد له في مسلم ذكرًا. \n9. لم يخرج البخاري من مسنده ولا من روايته شيئًا، وأخرج (3045 وغيره) عن أبي هريرة قصة أسر قريشٍ عاصمَ بن ثابت وأصحابَ السرية معه.",
    "book_id": "597",
    "new_page_number": 49
  },
  {
    "serial_number": "5531808",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 53,
    "volume_number": 1,
    "text": "خالد، تَعْليقٌ، حديثٌ بلا إسناد (1) .  باب الفاء 46 - (2) اتفقا في الفَضْل بن عَبَّاس * وأم هانئ، واسمها: فاخِتة بنت أبي طالب * وفاطمة بنت رسول الله صلى الله عليه وسلم، ورضي عنها. 47 - وانفرد مسلم بفَضَالة بن عُبَيد * وفاطمة بنت قَيْس (3) [ (4) ].  باب القاف 48 - (5) اتفقا في حديث قَيْس بن سَعْد. 49 - (6) وانفرد مسلم بقُطْبة بن مالك * وقَبِيصة بن مُخَارِق. 50 - وانفرد البخاري بقُدَامة بن مَظْعُون (7) * وقَتَادة بن النُعْمان.",
    "foot_note": "1. وهو قول البخاري قبل الحديث 2039: «ويذكر عن العداء بن خالد، قال: كتب لي النبي صلى الله عليه وسلم». \n2. 46 - «الفضل» في س: «الفضيل» / «عباس» في ي: «العباس» / «ورضي عنها» من هـ. \n3. أخرج البخاري 5322 عن عائشة قصة طلاق فاطمة، ولم يخرج من مسندها ولا من روايتها شيئًا. \n4. [] زيد هنا في هـ: «وفاطمة بنت أبي حُبَيش». ولم يخرج مسلم من مسندها شيئًا، وأخرج هو والبخاري عن عائشة قصتها في الاستحاضة. \n5. 48 - «حديث» من ت، س، ك، ف. \n6. 49 - «وقبيصة» في ت، س: «وقسطة» / «مخارق» في ي، هـ: «المخارق». \n7. لم يخرج البخاري من مسنده شيئًا، وأخرج 4011 عن عبدالله بن عامر بن ربيعة، أن قدامة شهد بدرًا، وأن عمر استعمله على البحرين.",
    "book_id": "597",
    "new_page_number": 50
  },
  {
    "serial_number": "5531809",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 54,
    "volume_number": 1,
    "text": "باب الكاف 51 - اتفقا في كَعْب بن مالك * وكَعْب بن عُجْرة. 52 - (1) وانفرد مسلم بأبي مَرْثَد كَنَّاز بن حُصَين الغَنَوي، بَدْري * وبأبي اليَسَر كَعْب بن عمرو * وكَعْب بن عاصم أبي مالك الأَشْعَري (2) .  باب اللام 53 - أخرج مسلم أم الفَضْل، واسمُها: لُبَابة، ولم يخرج لها البخاري شيئًا (3) .  باب الميم من اسمُه محمد قد ذكرناه في أول ما ذكرنا. 54 - (4) اتفقا في مالك بن الحُوَيرِث * ومالك بن رَبِيعة أبي أُسَيد الساعِدي * ومالك بن",
    "foot_note": "1. 52 - «كناز» في ك، ف: «كنان» / «حصين» في ي، هـ: «حصن» / «الغنوي» في ف: «الفنوي» / «اليسر» في ي: «السكر بشر» / «وكعب» في ت، س: «وبكعب» / «أبي مالك» من ت، س، ك، ف. \n2. هو غير أبي مالك الأشعري الذي أخرج البخاري حديثه بالشك بينه وبين أبي عامر الأشعري. \n3. جعلت في ي، هـ مما اتفقا فيه، فجاء فيهما: «اتفقا على أم الفضل، واسمها: لبابة (وفي ي: أم لبابة)»، وقد أخرج لها البخاري 763، 4429، (1658 وغيره) ومسلم 462، 1123، 1451. وقال الباجي 3/ 1287: «قال الشيخ أبو الحسن: انفرد مسلم بالإخراج عن أم الفضل لبابة، ولم يخرج لها البخاري شيئًا، وأراه نسي أو تأوّل». \n4. 54 - «في أول» في ي، هـ: «أول» / «ذكرنا» في ي، هـ: «ذكرناه» / «أبي أسيد» في ي: «أبي أسد»، وفي ت، ك، ف: «بن أسيد»، وفي س: «أسيد» / «وأخيه» في ك: «وأخوه»، وفي حاشية س: «في الأصل: وأخوه» / «ومغيرة» في ك، ف: «والمغيرة» / «ومعيقيب» في ي، ف: «ومعيقب» / «الأسود» في س، هـ: «والأسود» / «تبناه» في ف: «بيناه» / «وأبوه» في ي: «أبوه»، وفي ت: «وأبو» / «ومعاوية» في ت، س، ك، ف: «بن معاوية».",
    "book_id": "597",
    "new_page_number": 51
  },
  {
    "serial_number": "5531810",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 55,
    "volume_number": 1,
    "text": "صَعْصَعة * والمِسْوَر بن مَخْرَمة * ومَحْمُود بن الرَبِيع (1) * ومُجَاشع بن مَسْعود * وأخيه مُجَالد * ومُعَاذ بن جَبَل * ومُسَيّب بن حَزْن * ومُغَيرة بن شُعْبة * ومُعَيقِيب * ومَعْقِل بن يَسَار * ومِقْداد بن عمرو -الأَسْودُ تَبَنَّاه، وأبوه: عمرٌو- * ومُعَاوية بن أبي سُفيان * ومَيْمُونة بنت الحارث. 55 - (2) وانفرد مسلم بمُعَاوية بن الحَكَم * ومُطِيع بن الأَسْود * والمُسْتَورِد الفِهْري. [ (3) ] 56 - (4) وانفرد البخاري بالمِقْدام بن مَعْدِيْكَرِب * وبمِرْداس الأَسْلَمي * وبمَعْن بن يزيد السُلَمي * ومَرْوان بن الحَكَم.  باب النون 57 - (5) اتفقا في أبي بَرْزة نَضْلة بن عمرو الأَسْلَمي، ويقال: ابن عُبَيد * والنُعْمان بن بَشِير",
    "foot_note": "1. لم يخرج مسلم من مسنده شيئًا، وأخرج من روايته عدة أحاديث. وذكره الدارقطني في التابعين الثقات ممن صحت روايته عند البخاري 1/ 361، ولعل ذلك؛ لأن أكثر روايته عن الصحابة، وهو من صغارهم. \n2. 55 - «ومطيع» في ي: «وبمطيع» / «والمستورد» في ت، س، ك، ف: «وبالمسور». \n3. [] زيد هنا في ي، هـ: «ومَعْمَر بن عبدالله العَدَوي (وفي ي: العذري)». \n4. 56 - تقدمت أفراد البخاري على أفراد مسلم في ي / «وبمرداس» في ي، هـ: «ومرداس» / تقدم مروان في هـ على معن / «وبمعن» في ت: «وبمغني»، وفي ي، هـ: «ومعن» / «السلمي» في ت، س، ك، ف، هـ: «الأسلمي». \n5. 57 - تأخر باب النون في هـ عن باب الواو / «عبيد» في ت، س، ك، ف: «عمير» / «الأنصاري» من ت، س، ك، ف / «ونوفل» في ك، ف: «ونفيل».",
    "book_id": "597",
    "new_page_number": 52
  },
  {
    "serial_number": "5531811",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 56,
    "volume_number": 1,
    "text": "الأنصاري * [ (1) ] ونَوْفَل بن مُعَاوية (2) * والنُعْمان بن مُقَرِّن (3) * ونَُسيبة أمِّ عَطِية الأنصارية. 58 - (4) وانفرد مسلم بنافع بن عُتْبة * وبالنَوَّاس بن سَمْعان * وبنُبَيشة -اسمِ رَجُلٍ-.  باب الواو 59 - (5) اتفقا في أبي جُحَيفة، واسمُه: وَهْب * وفي واثلة بن الأَسْقَع. 60 - (6) وانفرد مسلم بإخراج وائل بن حُجْر، من رواية ابنِه عَلْقَمة بن وائل وَحْدَه عنه (7) . 61 - وانفرد البخاري بوَحْشِيّ بن حَرْب.",
    "foot_note": "1. [] زيد هنا في ي، هـ: «ونُفَيع أبي بَكْرة الثَقَفي». \n2. نقله عن الدارقطني: ابن أبي الفوارس 49، وابن الجوزي في التلقيح ص 205. وقد أخرج له البخاري 3602 ومسلم 2886 حديثًا بمثل حديثٍ قبله، ولم يسوقا لفظه. \n3. أخرج البخاري له وللمغيرة بن شعبة في حديث واحد 3159، وأخرج له مسلم 1731 ضمن حديث لبريدة بن الحصيب. \n4. 58 - «وبالنواس» في هـ: «والنواس» / «وبنبيشة» في هـ: «ونبيشة»، وفي ك، ف: «وبنبيثة»، وفي س فوقها علامة التصحيح» صح». \n5. 59 - «أبي» من ك، ف، ي، هـ / «جحيفة» في ك، ف: «وهيبة» / «واثلة» في ف: «وائلة» / «بن» ليست في ي. \n6. 60 - «بإخراج» في ت، س، ك: «في إخراج» / «عنه» من ت، س، ك، ف. \n7. لكن جاء عند مسلم 401 عن عبدالجبار بن وائل، عن علقمة بن وائل ومولى لهم، أنهما حدثاه عن أبيه وائل بن حجر.",
    "book_id": "597",
    "new_page_number": 53
  },
  {
    "serial_number": "5531812",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 57,
    "volume_number": 1,
    "text": "باب الهاء 62 - (1) اتفقا في أبي بُرْدة هانئ بن نِيَار * وفي أم سَلَمة هِنْد بنت أبي أُمَيّة، زوجِ النبي صلى الله عليه وسلم. 63 - وانفرد مسلم بهِشَام بن عامر * وهِشَام بن حَكِيم (2) .  باب الياء 64 - اتفقا في يَعْلَى بن أُمَيّة.  باب الكنى 65 - (3) اتفقا في أبي جَهْم (4) بن الحارث * وأبي بَشِير. 66 - (5) وانفرد مسلم بأبي حَبّة البَدْري (6) . [ (7) ]",
    "foot_note": "1. 62 - «بردة» في ت، س: «برزة» / «نيار» في ي، ف: «دينار» / «وفي» في هـ: «و» / «وسلم» في ي: «وسلم السلام». \n2. أخرج البخاري (2419 وغيره) عن عمر بن الخطاب قصة اختلافه مع هشام بن حكيم في قراءة سورة الفرقان. \n3. 65 - «باب» من ت، س، ك، ف / «جهم» في ي: «الجهم» / «بن الحارث» ليس في ي / «بشير» في ت، س: «يسير». \n4. كذا عند مسلم: «جهم»، وصوابه: جُهَيم -بالتصغير-، كما هو عند البخاري وغيره. \n5. 66 - «حبة» في ك، ف: «حية» / «البدري» في س: «البرزي». \n6. ذكر في ي، هـ فيما اتفقا فيه، وقد أخرج له البخاري 349، 3342 ومسلم 163. ونقله عن الدارقطني في أفراد مسلم: ابن أبي الفوارس 60، وابن الجوزي في التلقيح ص 205، وعندهما: «أبو حية»، بالياء، وهو قول. \n7. [] زيد هنا في ي، هـ: «وبأبي رِفَاعة العَدَوي، وقد تقدم في باب التاء». واسمه: تميم بن أسيد.",
    "book_id": "597",
    "new_page_number": 54
  },
  {
    "serial_number": "5531813",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 58,
    "volume_number": 1,
    "text": "67 - (1) وانفرد البخاري بأبي سَعِيد بن المُعَلَّى، وقد تقدم في باب الراء (2) * وبأبي داوُد (3) . [ (4) ]  باب النساء المَكْنِيَّات 68 - (5) اتفقا في أم سُلَيم (6) * وأم كُلْثُوم بنت عُقْبة بن أبي مُعَيط * وأم عَطِية (7) * وأم قَيْس بنت مِحْصَن * وأم شَرِيك * وأم حَرَام بنت مِلْحان. [ (8) ]",
    "foot_note": "1. 67 - «باب» من ت، س، ك، ف / «الراء» في هـ: «الروايات»، وسقط ما بعده في ف إلى آخر الكتاب / «وبأبي داود» من ت، س. \n2. واسمه: رافع بن المعلى. \n3. لم يذكر في ي، هـ، ك، ونقله عن الدارقطني: ابن أبي الفوارس 59، وابن الجوزي في التلقيح ص 205، وهو أبو داود المازني الأنصاري البدري، ولم أجد له في الصحيحين ذكرًا. \n4. [] زيد هنا في ي، هـ: «وبأبي (وفي هـ: أبو) عامر الأَشْعَري، وأبي (وفي هـ: وأبو) الشَمُوس البَلَوي، وأبي (وفي هـ: وأبو) لاسٍ الخُزَاعي (وفي ي: الابتر الجذامي)». وقد تقدم أبو عامر الأشعري في باب العين، وقال هناك: «اسمه: عبيد، ويقال: عمرو». وأخرج البخاري حديث أبي الشموس 3378 تعليقًا، مقرونًا بسبرة بن معبد. وأخرج أيضًا حديث أبي لاسٍ قبل 1468 تعليقًا. \n5. 68 - «قيس» في س: «قيسر». \n6. هي الرميصاء المتقدمة في أفراد مسلم من باب الراء. \n7. هي نسيبة المتقدمة في باب النون. \n8. [] زيد هنا في ي، هـ: «وأم حَبِيبة بنت جَحْش، ذكرها الحاكم». ولم أجد لها في البخاري ذكرًا، وأخرج مسلم 334 عن عائشة قصة استحاضتها، ولم يخرج من مسندها ولا من روايتها شيئًا، وذكرها الحاكم في الصحابيات 2/ 97.",
    "book_id": "597",
    "new_page_number": 55
  },
  {
    "serial_number": "5531814",
    "category_id": "26",
    "category": "التراجم والطبقات",
    "book_title": "أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه",
    "edition": "الأولى، 1433 هـ - 2012 م",
    "publisher": "دار العاصمة - الرياض",
    "page_number": 59,
    "volume_number": 1,
    "text": "69 - (1) وانفرد مسلم بأم مُبَشِّر * وأم الحُصَين * وأم هِشَام بنت حارثة، أختِ عَمْرة. 70 - (2) وانفرد البخاري بأم رُوْمان (3) * وأم خالد بنت خالد بن سَعِيد * وأم العَلَاء (4) * وأم سَلِيط (5) . 71 - (6) فهذه جُمْلة ما خرَّجا جميعًا من حديث الصحابة، من الرجال والنساء، رضي الله عنهم، في كتابَيْهما جميعًا.",
    "foot_note": "1. 69 - «مبشر» في س: «ميسر». \n2. 70 - «رومان» في ت: «رمان» / «بنت خالد بن سعيد» من ي، هـ. \n3. أخرج مسلم 1422 عن عائشة قصة تجهيز أم رومان لها في زواجها. \n4. أخرج مسلم 936 عن أم عطية أن أم العلاء ممن بايعت ألا تَنُوح، فوَفَت. \n5. نقلها عن الدارقطني: ابن أبي الفوارس 65، والباجي 3/ 1301، وابن الجوزي في التلقيح ص 207، ولم يخرج البخاري من مسندها ولا من روايتها شيئًا، وأخرج (2881 وغيره) عن عمر بن الخطاب، أن أم سليط كانت تَزْفِر القِرَب يوم أحد. \n6. 71 - «حديث» من ت، س، ك، وفي ي: «من» / «رضي الله عنهم»،» جميعا «-الثانية- من ت، س. في آخر ت: «والله المستعان، وهو حسبي ونعم الوكيل، تمت في 13 ذي القعدة، في يوم جمعة، في وقت العصر، سنة 968»، وفي آخر س: «والله المستعان، وهو حسبي ونعم الوكيل، آخره، والحمد لله رب العالمين، وصلى الله على سيدنا محمد، وعلى آله، وسلم تسليمًا كثيرًا، تم»، وفي آخر ك: «والله المستعان، والحمد لله رب العالمين، وصلى الله على سيدنا محمد، وعلى آله، وصحبه، وسلم، أجمعين، تحريرًا في ثامن جمادى الثاني، سنة ثمانية وثمانين، على يد فقير رحمة ربه القوي: إسماعيل بن محمد المالكي العدوي، عامله الله بلطفه الخفي، آمين»، وفي آخر ي: «والحمد لله»، وفي آخر هـ: «والله أعلم، تم الجزء في الصحابة الذين روى لهم الشيخان أو أحدهما، بحمد الله ومنه، وصلى الله على رسوله سيدنا محمد النبي الأمي، وعلى آله، وصحبه، وسلم، يوم الأحد، لليلة بقيت من شعبان، سنة 1320، الكاتب: زين العابدين الآروي الشاه آبادي البهاري».",
    "book_id": "597",
    "new_page_number": 56
  }
]