[
  {
    "serial_number": "7523660",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: General Books. Book: Introduction to the Sciences of Sharia. Author: Dr. Abdul Rahman bin Abdul Aziz Al-Aql. Publisher: Center for Scientific Elites. Number of Pages: 94. [Book numbering corresponds to the printed version]. Publication date in Shamela: 27 Dhu al-Hijjah 1441.\nBook: Introduction to the Sciences of Sharia. Author: Dr. Abdul Rahman bin Abdul Aziz Al-Aql. Publisher: Center for Scientific Elites. Number of Pages: 94. [Book numbering corresponds to the printed version]. Publication date in Shamela: 27 Dhu al-Hijjah 1441.\nAuthor: Dr. Abdul Rahman bin Abdul Aziz Al-Aql. Publisher: Center for Scientific Elites. Number of Pages: 94. [Book numbering corresponds to the printed version]. Publication date in Shamela: 27 Dhu al-Hijjah 1441.\nPublisher: Center for Scientific Elites. Number of Pages: 94. [Book numbering corresponds to the printed version]. Publication date in Shamela: 27 Dhu al-Hijjah 1441.\nNumber of Pages: 94. [Book numbering corresponds to the printed version]. Publication date in Shamela: 27 Dhu al-Hijjah 1441.\n[Book numbering corresponds to the printed version]. Publication date in Shamela: 27 Dhu al-Hijjah 1441.\nPublication date in Shamela: 27 Dhu al-Hijjah 1441",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523661",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. Praise be to Allah, who taught by the pen, taught man that which he knew not. And peace and blessings be upon the most noble Prophet, his family, his companions, and those who followed their most upright path. To proceed: These are brief lines and concise words that I place in the hands of the student of knowledge who desires to learn the rulings of Sharia and seeks to study its sciences. These are necessary introductions for the student of knowledge so that he may be insightful and aware of what is required of him before embarking on the quest for knowledge, to facilitate for him the attainment of his goal, and for Allah to bless his knowledge and guide his steps on the path of knowledge. These lines are divided into two parts: Part One: The etiquette of the seeker of truth and the qualities and beautiful traits he should possess during his quest, and what he must avoid that contradicts and opposes knowledge. Part Two: A brief overview of the sciences of Sharia, their most prominent divisions, the fruit of studying them, along with a number of the most important terms in each science. I do not forget to thank everyone who contributed to the production of this treatise. I ask Allah to make this work purely for His sake and to benefit His servants with it. And may Allah send peace and blessings upon our Prophet Muhammad. Written by Dr. Abdul Rahman bin Abdul Aziz Al-Aql, Faculty Member at the College of Sharia, Qassim University.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523662",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 4,
    "volume_number": 1,
    "text": "Part One: Etiquette of the Student of Knowledge",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523663",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 5,
    "volume_number": 1,
    "text": "Etiquette before Seeking Knowledge: Indeed, etiquette and adhering to the traits of people of good character is the beauty of knowledge. A little etiquette with some knowledge is better than much knowledge with poor etiquette. The predecessors (Imams) used to learn etiquette and strive for it just as they strove for knowledge itself or even more. They used to learn etiquette from their sheikhs just as they learned knowledge. Al-Hasan bin Ismail said: I heard my father say: \"About five thousand or more would gather in Ahmad's assembly; less than five hundred would write, and the rest would learn from him good etiquette and good conduct\" (1). Abu Bakr bin Al-Mutawwi'i said: \"I frequented Abu Abdullah Ahmad bin Hanbal for twelve years while he was reading (Al-Musnad) to his children. I did not write a single hadith from him; I only used to observe his guidance, his character, and his etiquette\" (2). The Imams believed that etiquette is the key to knowledge, and that a little of it is better than much knowledge devoid of etiquette. Sharik, may Allah have mercy on him, said: \"A little etiquette is better than much knowledge\" (3). And Makhlad bin Al-Hussein, may Allah have mercy on him, said: \"We are more in need of a little etiquette than we are of much Hadith\" (4).",
    "foot_note": "1. Narrated by Ibn al-Jawzi in Manaqib al-Imam Ahmad p. (288).\n2. Previous source, same location.\n3. Narrated by Ibn Abi Hatim in Al-Jarh wa Al-Ta'dil (4/335).\n4. Narrated by Al-Ramahurmuzi in Al-Muhaddith Al-Fasil p. (559).",
    "book_id": "60"
  },
  {
    "serial_number": "7523664",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 6,
    "volume_number": 1,
    "text": "Likewise, Ibn Al-Mubarak (1) and Al-Layth bin Sa'd (2) used to say these words to students of knowledge. The successful one, the more he rises in knowledge, the more he rises in etiquette and elevates in character. Al-Hasan, may Allah have mercy on him, said: \"A man would seek knowledge, and soon that would be seen in his humility, his guidance, his tongue, his sight, and his hand\" (3). Regarding this, the poet says: Knowledge is light, and a person's ignorance is his darkness ... Would that we race towards the light of knowledge. The stars of knowledge are morals that adorn it ... If you combine them, you set off for glory. A scholar is of no avail without character ... And a person of character is of no avail if he lies/fabricates. admiration for every scholar whom ... A moral soul beautifies, and trusts not in whims. There are types of etiquette and forms of good morals that a student of knowledge should possess: etiquette with himself, etiquette with his teacher, etiquette with his colleagues, and etiquette with the general public. We will discuss these types of etiquette in detail in this brief overview:",
    "foot_note": "1. Narrated from him by Ibn Al-Muqri in his Mu'jam p. (268), and Ibn Asakir in Tarikh Dimashq (32/445).\n2. Narrated by Abu Tahir Al-Silafi in the thirty-fifth of Al-Mashyakha Al-Baghdadiyya p. (68).\n3. Narrated by Ibn Al-Mubarak in Al-Zuhd wa Al-Raqa'iq (1/26) number (79), Al-Bayhaqi in Al-Madkhal ila Al-Sunan Al-Kubra p. (321) number (502), Ibn Abd Al-Barr in Jami' Bayan Al-Ilm (1/258) number (315), Abu Nu'aym in Hilyat Al-Awliya (7/62), and Al-Khatib Al-Baghdadi in Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (1/142) number (175).",
    "book_id": "60"
  },
  {
    "serial_number": "7523665",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 7,
    "volume_number": 1,
    "text": "Type One: The student of knowledge's etiquette with himself: There are numerous etiquettes that a student of knowledge should adopt with his own self that lies between his sides. Many of them relate to his religious duties, which are rights of Allah the Almighty. They are attributed to him because he is required to establish them within himself and adorn himself with them in his words, deeds, conduct, and guidance. Among the most important of them are: (First: Sincerity of intention to Allah Almighty: Know, O student of knowledge, that sincerity is a secret between the servant and his Lord; no angel knows it to write it down, no human knows it to corrupt it, and no desire knows it to sway it. If you intend by seeking knowledge the Face of Allah, reward and recompense from Him, and the removal of ignorance from yourself and your Muslim brothers, know that this is divine success and a Lordly gift, so praise Allah for that. Continually examine your heart and strive against yourself in monitoring sincerity. Al-Hasan Al-Basri, may Allah have mercy on him, said: \"A servant remains in goodness as long as when he speaks, he speaks for Allah, and when he acts, he acts for Allah Almighty\" (1). Therefore, the intentions of seeking knowledge should be as follows: 1 - Reforming the heart and acting upon knowledge: One of the most beautiful fruits of knowledge is that it reforms the heart and the inner self. Here is Imam Ibn Jama'ah, may Allah have mercy on him, guiding you and whispering in your ears, saying: \"Good intention in seeking knowledge is that he intends by it the Face of Allah Almighty, acting upon it, illuminating his heart, adorning his inner self,",
    "foot_note": "1. Narrated by Ibn Al-Mubarak in Al-Zuhd (2/17), and Ibn Abi Shaybah in his Musannaf (7/196).",
    "book_id": "60"
  },
  {
    "serial_number": "7523666",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 8,
    "volume_number": 1,
    "text": "drawing close to Allah Almighty on the Day of Resurrection, and exposing himself to what Allah has prepared for His people of His pleasure and great bounty\" (1). These are among the greatest intentions of seeking knowledge. The aim is that drawing close to Allah through knowledge is one of the purest and most beloved acts of worship to Allah. 2 - Removing ignorance from oneself. 3 - Spreading knowledge, benefiting others, and doing good to Allah's servants: by guiding them and teaching them the religion. This is one of the greatest types of benevolence. Allah says: {And do good; indeed, Allah loves the doers of good} [Al-Baqarah: 195]. 4 - Defending the Sharia by disseminating knowledge and refuting the specious arguments of falsifiers. These four intentions are the fruit of knowledge. Whoever takes it rightfully, Allah loves him and grants him acceptance and awe among people. Ibn Abbas, may Allah be pleased with them, said: \"If the bearers of knowledge took it rightfully as it should be taken, Allah, His angels, and the righteous would love them, and people would hold them in awe. But they sought the world with it, so Allah hated them, and they became despicable to people\" (2). He means by that: those who stripped their intention for other than Allah and wanted the world by seeking knowledge. As for the one who intended by knowledge one of the four previous intentions, or wanted thereby to obtain a position through which he serves Muslims, or wanted by knowledge a job to enrich himself from begging people and to fulfill the obligatory spending on his family, he does not fall under the station of blame, even if he misses the greatest purpose of knowledge.",
    "foot_note": "1. Previous source p. (112).\n2. Narrated by Ibn Abd Al-Barr in Jami' Bayan Al-Ilm (1/655) number (1136).",
    "book_id": "60"
  },
  {
    "serial_number": "7523667",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 9,
    "volume_number": 1,
    "text": "And on the authority of Abu Yusuf, may Allah have mercy on him, he said: \"O people, intend Allah by your knowledge; for I never sat in a gathering intending to humble myself except that I did not stand up until I surpassed them, and I never sat in a gathering intending to surpass them except that I did not stand up until I was exposed\" (1). Treating the Intention: Sincere people agree that intention does not become upright for a servant except through long maintenance and much struggle. Sufyan Al-Thawri, may Allah have mercy on him, said: \"I have not treated anything harder on me than my intention; indeed, it turns over on me\" (2). This does not mean that a student of knowledge should turn away from seeking knowledge and cut himself off from it on the pretext that his intention is not pure. This is an entrance of Satan to turn the servant away from Sharia knowledge. Rather, the student of knowledge must proceed on the path of seeking knowledge, ascend the ladder of knowledge, and strive against himself to correct the intention at the beginning of the quest and during the quest, indeed in all stages of the quest. This striving helps the student to be sincere and seek the Face of Allah Almighty. With continuous striving and diligence in seeking sincerity, the servant is granted success for a righteous intention and good work; because knowledge by its nature nurtures sincerity. Ishaq bin Rahwayh, may Allah have mercy on him, said: \"I asked Waki' about a man who seeks knowledge, and his intention is to discuss it and narrate it or something similar; do you think he sins in that? He said: No,",
    "foot_note": "1. Al-Majmu' Sharh Al-Muhadhdhab (1/28).\n2. Narrated by Al-Khatib Al-Baghdadi in Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (1/317) number (692).",
    "book_id": "60"
  },
  {
    "serial_number": "7523668",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 10,
    "volume_number": 1,
    "text": "O son of my brother. Sufyan told us, from Habib bin Abi Thabit, who said: We sought this knowledge, and we had no intention in it, then the intention and action came afterwards\" (1). Punishment of One Who Seeks Knowledge for Other Than Allah: Whoever seeks knowledge for showing off, reputation, and fame, or to attain a worldly objective, is threatened with punishment. Indeed, it is reported that he is among the first with whom the Fire will be kindled on the Day of Resurrection. On the authority of Abu Hurairah, may Allah be pleased with him, who said: I heard the Messenger of Allah, peace and blessings be upon him, say: \"Indeed, the first of people to be judged on the Day of Resurrection will be a man who was martyred. He will be brought and Allah will make him recognize His blessings and he will recognize them. He (Allah) will say: 'What did you do with them?' He will say: 'I fought for You until I was martyred.' He (Allah) will say: 'You have lied. You fought so that it might be said [that you were] brave, and it was said.' Then he will be ordered to be dragged on his face until he is cast into the Fire. And [then] a man who learned knowledge and taught it and read the Quran. He will be brought and Allah will make him recognize His blessings and he will recognize them. He (Allah) will say: 'What did you do with them?' He will say: 'I learned knowledge and taught it and read the Quran for You.' He (Allah) will say: 'You have lied. You learned knowledge so that it might be said [that you were] a scholar, and you read the Quran so that it might be said [that you were] a reciter, and it was said.' Then he will be ordered to be dragged on his face until he is cast into the Fire. And [then] a man to whom Allah had expanded [wealth] and given from all types of wealth. He will be brought and Allah will make him recognize His blessings and he will recognize them. He (Allah) will say: 'What did you do with them?' He will say: 'I did not leave any path in which You like money to be spent without spending in it for You.' He (Allah) will say: 'You have lied. You did it so that it might be said [that you were] generous, and it was said.' Then he will be ordered to be dragged on his face until he is cast into the Fire\" (2).",
    "foot_note": "1. Narrated by Al-Khatib Al-Baghdadi in Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (2/267) number (1818).\n2. Narrated by Muslim (3/1513) number (1905).",
    "book_id": "60"
  },
  {
    "serial_number": "7523669",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 11,
    "volume_number": 1,
    "text": "And in a narration: \"O Abu Hurairah, those three are the first of Allah's creation with whom the Fire will be kindled on the Day of Resurrection\" (1). (Second: Acting upon Knowledge: The goal and fruit of knowledge is that a person acts upon it hoping for Allah's reward, to win His Paradise, and to be saved from His punishment. Imam Al-Khatib Al-Baghdadi, may Allah have mercy on him, authored a book titled \"Iqtida' Al-Ilm Al-Amal\" (The Demand of Knowledge for Action), in which he spoke about the necessity of acting upon knowledge as is clear from its title, and it is worthy of study, review, and reading. A person will be asked on the Day of Resurrection about his knowledge: what did he do with it, and did he act upon it or not? On the authority of Abu Barzah Al-Aslami, who said: The Messenger of Allah, peace and blessings be upon him, said: \"The feet of a servant will not move on the Day of Resurrection until he is asked about his life and how he spent it, about his knowledge and what he did with it, about his wealth, from where he acquired it and in what he spent it, and about his body and how he wore it out\" (2). Ali bin Abi Talib, may Allah be pleased with him, said: \"Knowledge calls out to action; if it answers, [it stays], otherwise it departs\" (3). The meaning of (hatafa) is called out and shouted (4). Abu Qilabah, may Allah have mercy on him, said: \"If Allah grants you new knowledge, then grant Allah new worship, and let not your concern be to narrate it to people\" (5).",
    "foot_note": "1. Narrated by Al-Tirmidhi (4/593) number (2382), and said: Hasan Gharib.\n2. Narrated by Al-Tirmidhi in his Sunan (4/612) number (2417), and said: (Hasan Sahih Hadith).\n3. Iqtida' Al-Ilm Al-Amal p. (35, 36) number (40).\n4. Al-Mu'jam by Abd al-Khaliq bin Asad al-Hanafi p. (354).\n5. Narrated by Abu Nu'aym in Hilyat Al-Awliya (2/283), Al-Bayhaqi in Al-Madkhal ila Al-Sunan Al-Kubra p. (329) number (527), and Al-Khatib Al-Baghdadi in Iqtida' Al-Ilm Al-Amal p. (34, 35) number (38).",
    "book_id": "60"
  },
  {
    "serial_number": "7523670",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 12,
    "volume_number": 1,
    "text": "If a Muslim acts upon his knowledge, he wins the pleasure of Allah Almighty and attains His Paradise: Act upon your knowledge, you will profit, O man ... Knowledge is of no avail if actions are not good. Knowledge is an adornment, and the fear of Allah is its decoration ... And the pious are occupied with their knowledge. Learn knowledge and act upon it as much as you can ... Let not amusement and argumentation distract you from it (1). The predecessors (Salaf), may Allah have mercy on them, were among the most keen people to act upon knowledge and the quickest to apply it in their daily lives. On the authority of Abu Abd Al-Rahman Al-Sulami, he said: \"Those who used to teach us the Quran from the Companions of the Messenger of Allah, peace and blessings be upon him, told us: That they used to learn ten verses from the Messenger of Allah, peace and blessings be upon him, and they would not take the next ten until they knew what was in these [first ten] of knowledge and action. For we were taught knowledge and action. He said: So we learned knowledge and action together. And the Quran will be inherited after us by a people who will drink it like water, it will not go beyond this - and he pointed with his hand to his jaw\" (2). The Salaf represented wonderful examples in initiating compliance and quickly applying knowledge: Imam Abu Hanifa, may Allah have mercy on him, did not hold the permissibility of wiping over socks (Jawrabayn), then he returned to the view of permissibility three or seven days before his death, and he wiped over his socks during his illness, and said to his visitors: I did what I used to forbid (3).",
    "foot_note": "1. Iqtida' Al-Ilm Al-Amal by Al-Khatib Al-Baghdadi p. (38).\n2. Narrated by Ahmad in his Musnad (38/466) number (23482), and Ibn Abi Shaybah in Al-Musannaf (6/117) number (29929).\n3. See: Tabyin Al-Haqa'iq Sharh Kanz Al-Daqa'iq by Al-Zayla'i (1/52), and Al-Jawharah Al-Nayyirah ala Mukhtasar Al-Quduri by Al-Zabidi (1/28).",
    "book_id": "60"
  },
  {
    "serial_number": "7523671",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 13,
    "volume_number": 1,
    "text": "And here is Imam Malik, may Allah have mercy on him: Ibn Wahb narrated from him saying: \"I heard Malik being asked about running fingers between the toes in Wudu', and he said: That is not [incumbent] upon people. He said: So I left him until the people decreased, then I said to him: We have a Sunnah regarding that. He said: And what is it? I said: Al-Layth ibn Sa'd, Ibn Lahi'ah, and Amr bin Al-Harith told us, from Yazid bin Amr Al-Ma'afiri, from Abu Abd Al-Rahman Al-Hubuli, from Al-Mustawrid bin Shaddad Al-Qurashi who said: I saw the Messenger of Allah, peace and blessings be upon him, rubbing between his toes with his little finger. He said: This hadith is good (Hasan), and I have never heard it except this hour. Then I heard him after that being asked, and he commanded the running of fingers [between toes]\" (1). As for Imam Al-Shafi'i, the example in him is clearer and greater; his Old School in Iraq and New School in Egypt are famous. He retracted his Old School in his New School except for a few issues which some counted as seventeen issues, and others counted as thirty-odd issues, and that was due to his discovering the correct evidence. And here is Imam Ahmad bin Hanbal, may Allah have mercy on him, who did not write a hadith from the Prophet, peace and blessings be upon him, except after he acted upon it. Al-Marwadhi said: Ahmad said to me: \"I did not write a hadith from the Prophet, peace and blessings be upon him, except that I acted upon it, until the hadith passed by me: That the Prophet, peace and blessings be upon him, was cupped and gave Abu Taybah a dinar, so I gave the cupper a dinar when I was cupped\" (2). A severe threat has come against the one who does not act upon his knowledge. On the authority of Usama bin Zaid, may Allah be pleased with them,",
    "foot_note": "1. Narrated by Ibn Abi Hatim in Al-Jarh wa Al-Ta'dil (1/31, 32), and from his path Al-Khalili in Al-Irshad (1/400) number (97).\n2. Narrated by Al-Khatib Al-Baghdadi in Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (1/144) number (184).",
    "book_id": "60"
  },
  {
    "serial_number": "7523672",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 14,
    "volume_number": 1,
    "text": "from the Prophet, peace and blessings be upon him, who said: \"A man will be brought on the Day of Resurrection and thrown into the Fire, so his intestines (1) will spill out (2), and he will go around with them as a donkey goes around a millstone. The people of the Fire will gather around him and say: 'O so-and-so, what is the matter with you? Did you not used to enjoin good and forbid evil?' He will say: 'Yes, I used to enjoin good but not do it, and forbid evil and do it'\" (3). Abu Darda, may Allah be pleased with him, said: \"You will not be a scholar until you are a learner, and you will not be a learner until you are an actor upon what you know\" (4). Ibn Ruslan, may Allah have mercy on him, said: And a scholar who does not act upon his knowledge ... Is punished before the worshippers of idols. (Third: Fear of Allah and awe of Him: Beneficial knowledge is that which cultivates the soul, purifies it from bad qualities, and bequeaths fear of Allah and humility towards His creation. Thus, its possessor becomes a good example among people, and a righteous role model in words and deeds (5). Allah Almighty says: {It is only those who have knowledge among His slaves that fear Allah} [Fatir: 28].",
    "foot_note": "1. Indalaqa: From Indilaq, which is the exiting of something from its place, and everything that protrudes out has indalaqa. See: Gharib Al-Hadith by Abu Ubaid (2/31), Tahdhib Al-Lughah by Al-Azhari (9/45).\n2. Aqtab: Plural of Qatab, which are the intestines. See: Gharib Al-Hadith by Abu Ubaid (2/30), and Tahdhib Al-Lughah by Al-Azhari (9/69).\n3. Narrated by Al-Bukhari (4/121) number (3267), and Muslim (4/2290) number (2989).\n4. Narrated by Waki' in Kitab Al-Zuhd p. (470) number (220), Al-Darimi in his Sunan (1/337) number (301), and Al-Bayhaqi in Al-Madkhal ila Al-Sunan Al-Kubra p. (315) number (488).\n5. Mawarid Al-Zam'an li Durus Al-Zaman (4/516) with modification.",
    "book_id": "60"
  },
  {
    "serial_number": "7523673",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 15,
    "volume_number": 1,
    "text": "\"Meaning: Only the scholars who know Him truly fear Him as He should be feared; because the more complete the knowledge of the Great, Powerful, All-Knowing, described with attributes of perfection and named with the Beautiful Names, the greater and more abundant the fear of Him becomes\" (1). Abdullah bin Masud, may Allah be pleased with him, said: \"Knowledge is not the narration of Hadith, but knowledge is fear [of Allah]\" (2). Yahya bin Abi Kathir, may Allah have mercy on him, said: \"The scholar is the one who fears Allah, and fear of Allah is piety\" (3). Malik, may Allah have mercy on him, said: \"Knowledge is not by abundance of narration; rather, knowledge is a light that Allah places in the heart\" (4). (Fourth: Avoiding Sins: The student of knowledge must stay away from disobeying Allah Almighty, avoid paths of destruction, and beware of tracks of deadly sins, for sins destroy their perpetrator and throw him into a deep ravine. No calamity befalls a servant except due to a sin he committed. Allah Almighty says: {And whatever strikes you of disaster - it is for what your hands have earned; but He pardons much} [Ash-Shura: 30].",
    "foot_note": "1. Tafsir Ibn Kathir (6/482).\n2. Narrated by Yahya bin Salam in his Tafsir (2/786).\n3. Narrated by Al-Bayhaqi in Al-Madkhal ila Al-Sunan Al-Kubra p. (322) number (505) and Abu Nu'aym in Hilyat Al-Awliya (3/67).\n4. Narrated by Al-Ramahurmuzi in Al-Muhaddith Al-Fasil p. (558), and Al-Khatib Al-Baghdadi in Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (2/174) number (1526).",
    "book_id": "60"
  },
  {
    "serial_number": "7523674",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 16,
    "volume_number": 1,
    "text": "Ibn Al-Jawzi, may Allah have mercy on him, said: \"And know that sins block the doors of provision, and that whoever neglects the command of Allah, Allah will neglect him\" (1). There is nothing more beneficial for a student of knowledge in preserving his knowledge, strengthening his understanding, recall, and perception than fearing Allah and staying away from sins. Waki', may Allah have mercy on him, said: \"Seek help in memorization by abandoning sin\" (2). Ibn Hibban, may Allah have mercy on him, said: \"And among the best things a person uses to aid memorization is good nature along with high ambition, and avoiding sins\" (3). Al-Nawawi said - speaking about the etiquette of the student of knowledge -: \"He should purify his heart from impurities so that it becomes fit to receive knowledge, preserve it, and invest it\" (4). Whoever leans towards sin and finds sins agreeable forgets his knowledge, his mind becomes confused, and he is punished with much forgetfulness. Ibn Masud, may Allah be pleased with him, said: \"I truly think a servant forgets knowledge he used to know because of a sin he commits\" (5). May Allah have mercy on Imam Al-Shafi'i when he said:",
    "foot_note": "1. Sayd Al-Khatir p. (450, 451).\n2. Narrated by Ibn Hibban in Rawdat Al-Uqala p. (39).\n3. Previous source, same location.\n4. Al-Majmu' Sharh Al-Muhadhdhab (1/35).\n5. Narrated by Al-Darimi in his Musnad (1/379) number (388), Abu Dawood in Al-Zuhd p. (168) number (169), Ibn Abd Al-Barr in Jami' Bayan Al-Ilm (1/675) number (1195), Zuhair bin Harb in Kitab Al-Ilm p. (31) number (132), and Al-Khatib Al-Baghdadi in Iqtida' Al-Ilm Al-Amal p. (61).",
    "book_id": "60"
  },
  {
    "serial_number": "7523675",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 17,
    "volume_number": 1,
    "text": "I complained to Waki' about my poor memory ... So he guided me to abandon sins. And he informed me that knowledge is light ... And the light of Allah is not guided to a sinner. (Fifth: Worship and Remembrance (Dhikr): Perpetuating the remembrance of Allah, seeking His forgiveness, and praising Him are among the most beautiful forms of servitude, and causes for the heart's purity, health, clarity, and tranquility. {Those who have believed and whose hearts are assured by the remembrance of Allah. Unquestionably, by the remembrance of Allah hearts are assured} [Ar-Ra'd: 28]. Indeed, the remembrance of Allah fills the heart with light and joy; rather, without it, the heart is in darkness and gloom; because \"In the heart there is a void and poverty that nothing can fill at all except the remembrance of Allah Almighty. If remembrance becomes the slogan of the heart such that it is the rememberer fundamentally and the tongue follows it, this is the remembrance that fills the void and ends the poverty. Its possessor becomes rich without wealth, powerful without clan, awe-inspiring without authority. If he is heedless of the remembrance of Allah Almighty, he is the opposite of that: poor despite great wealth, humiliated despite authority, contemptible despite a large clan\" (1). The student of knowledge is the most deserving of people to maintain the remembrance of Allah Almighty, and to have a share of Sunan, voluntary prayers, fasting, night prayer (Qiyam al-Layl), and reading the Holy Quran. It is ugly for a student of knowledge to be negligent in his worship. On the authority of Abu Ismah Asim bin Isam Al-Bayhaqi, he said: \"I spent a night with Ahmad bin Hanbal, so he brought water",
    "foot_note": "1. Al-Wabil Al-Sayyib p. (139 - 140).",
    "book_id": "60"
  },
  {
    "serial_number": "7523676",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 18,
    "volume_number": 1,
    "text": "and placed it. When morning came, he looked at the water and found it as it was. He said: Glory be to Allah! A man seeks knowledge and has no litany (Wird) at night?!\" (1). Indeed, the predecessors (Salaf), may Allah have mercy on them, used to seek help in memorizing knowledge through worship and draw closer to Allah through it so He would open for them the locks of knowledge. Ibrahim bin Ismail said: \"Our companions used to seek help in seeking Hadith through fasting\" (2). (Sixth: Turning to Allah with abundant Supplication (Dua): Supplication is the essence of worship and pure devotion; because it involves complete neediness of Allah and humility before Him. It is the most beneficial worship of the heart and has the most effect on it, especially if the heart of the supplicant is present and he evokes the meanings of what he prays for. If those supplications and invocations are from what Allah Almighty reported of the supplications of His chosen creation, they are most effective for the heart; because they contain the comprehensive words of supplication, true humility, and evocation of the meanings of Lordship (Rububiyyah); that is why they used to start their supplications by saying: \"Our Lord\" (Rabbana). Most supplications in the Quran also come started with seeking means to Allah through His Lordship. It is good for the supplicant, when calling upon Allah using His Lordship as a means, to evoke the meaning of Allah's general nurturing, which is: Creation and Management, and the meaning of special nurturing, which is: His guardianship of the best of His creation, His kindness to them, and His reforming of their religion and worldly life, due to their turning to their Lord and their humility before Him.",
    "foot_note": "1. Narrated by Al-Bayhaqi in Al-Madkhal ila Al-Sunan Al-Kubra p. (330) number (530), and Al-Khatib Al-Baghdadi in Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (1/143) number (178).\n2. Narrated by Al-Khatib Al-Baghdadi in Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (1/143) number (177).",
    "book_id": "60"
  },
  {
    "serial_number": "7523677",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 19,
    "volume_number": 1,
    "text": "It is good for the supplicant to pray with the supplication of those firmly grounded in knowledge; because when He, Glory be to Him, praised them, He mentioned their call: {Our Lord, let not our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower} [Ali 'Imran: 8]. So they sought means to Allah through His Lordship to grant them steadfastness of hearts and their firmness upon what pleases Allah, and their preservation from deviation and turning back from guidance (1). (Seventh: Evoking Allah's Bounty and Favor: The successful student of knowledge is the one who constantly evokes the scenes of his Lord's favors upon him, which no book can enumerate and no counter can count; because they have surrounded the believer with a collar filling the earth and the sky. He is the One who poured upon him blessings, the highest of which is the blessing of guidance, which the tongue fails to fulfill its worth, as his Lord brought him out by it from the darkness of misguidance to the light of guidance and the vastness of faith, \"O My servants, all of you are astray except those whom I have guided, so seek guidance of Me and I shall guide you\" (2). Therefore, Allah admonished those who neglected witnessing His favors, saying: {They consider it a favor to you that they have accepted Islam. Say, \"Do not consider your Islam a favor to me. Rather, Allah has conferred favor upon you that He has guided you to the faith} [Al-Hujurat: 17]. It is the Quranic upbringing that strips the heart of arrogance, erases from it the paths of self-admiration, and fills it with reverence for Allah and acknowledgment of His bounty and favor. This was understood by those of determination and virtue like Umar, may Allah be pleased with him, when he was stabbed and Abdullah bin Abbas, may Allah be pleased with them, said to him consoling: \"O Commander of the Faithful, even if that [death] happens, you accompanied the Messenger of Allah, peace and blessings be upon him, and you were good in his companionship, then you parted from him while he was pleased with you. Then you accompanied Abu Bakr and were good in his companionship,",
    "foot_note": "1. See: Al-Mawahib Al-Rabbaniyyah min Al-Ayat Al-Quraniyyah by Al-Sa'di p. (56 - 58).\n2. Narrated by Muslim (4/1994) number (2577) from the hadith of Abu Dharr, may Allah be pleased with him.",
    "book_id": "60"
  },
  {
    "serial_number": "7523678",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 20,
    "volume_number": 1,
    "text": "then you parted from him while he was pleased with you. Then you accompanied them [the companions] and were good in their companionship, and if you part from them, you will part from them while they are pleased with you.\" He said: \"As for what you mentioned of the companionship of the Messenger of Allah, peace and blessings be upon him, and his pleasure, that is but a favor from Allah Almighty which He bestowed upon me. And as for what you mentioned of the companionship of Abu Bakr and his pleasure, that is but a favor from Allah, Exalted is His mention, which He bestowed upon me. And as for what you see of my anxiety, it is for your sake and the sake of your companions. By Allah, if I had the earth full (1) of gold, I would have ransomed myself with it from the punishment of Allah Almighty before I see Him\" (2). The servant's evocation of Allah's favor upon him removes the haze of vanity from the heart, washes it from the filth of self-admiration, and purifies it from impurity so that it becomes a clean vessel that is purified by faith, rises with the actions of the heart, and benefits from the actions of the limbs. However, if these actions exist with the impurities of vanity and self-admiration for the deed, they crush the heart of their owner completely, leaving no good in it. Allah Almighty says in the Qudsi Hadith about the one who boasted of his deed: \"I have forgiven so-and-so, and thwarted your deed\" (3). So kindle, O student of knowledge, in your mind the spark of feeling Allah's favor and His purification of you, {And if not for the favor of Allah upon you and His mercy, not one of you would have been pure, ever, but Allah purifies whom He wills, and Allah is Hearing and Knowing} [An-Nur: 21].",
    "foot_note": "1. Meaning: What fills it until it overflows and runs over. See: Al-Nihaya fi Gharib Al-Hadith (3/133).\n2. Narrated by Al-Bukhari (5/12) number (3692) from the hadith of Al-Miswar bin Makhramah, may Allah be pleased with him.\n3. Narrated by Muslim (4/2023) number (2621) from the hadith of Jundub, may Allah be pleased with him.",
    "book_id": "60"
  },
  {
    "serial_number": "7523679",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 21,
    "volume_number": 1,
    "text": "(Eighth: Adorning oneself with the qualities of Muru'ah (Chivalry/Manliness): Indeed, what adorns the student of knowledge and beautifies him is adorning himself with (Muru'ah): such as noble manners, a cheerful face, spreading peace (Salam), bearing with people, dignity without pride, might without tyranny, and magnanimity without tribalism or ignorance. Therefore, he must avoid things that violate Muru'ah, whether in nature, speech, or action, such as a degrading profession, or a bad trait like vanity, showing off, arrogance, haughtiness, looking down on others, and frequenting places of suspicion; all of that corrupts knowledge for its seeker (1). (Ninth: Moderation and Avoiding Extremism: Islamic Sharia came with moderation, between extremism and negligence, and between excess and deficiency. Allah Almighty said: {And thus we have made you a just community that you will be witnesses over the people and the Messenger will be a witness over you} [Al-Baqarah: 143]. Warning the People of the Book against extremism in religion has come as in the saying of Allah Glory be to Him: {O People of the Scripture, do not commit excess in your religion or say about Allah except the truth} [An-Nisa: 171]. Then came the warning to us about this chronic disease into which the Jews and Christians fell. On the authority of Ibn Abbas, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: \"Beware of extremism in religion, for indeed those before you were destroyed by extremism in religion\" (2).",
    "foot_note": "1. Hilyat Talib Al-Ilm p. (149) with modification.\n2. Narrated by Al-Nasa'i (5/268) number (3057), Ibn Majah (2/1008) number (3029), Ahmad (3/351) number (1851), Ibn Khuzaimah (4/274) number (2867), and Al-Hakim in Al-Mustadrak (1/637) number (1711), and he said: \"Authentic according to the conditions of the two Sheikhs (Bukhari and Muslim).\"",
    "book_id": "60"
  },
  {
    "serial_number": "7523680",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 22,
    "volume_number": 1,
    "text": "That is because extremism is destructive and leads a person to error and deviation from the path of truth. On the authority of Abdullah bin Masud, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: \"Perished are the extremists (Mutanatti'un), he said it three times\" (1). So the consequence of extremism is dire, and its outcome is ugly. Look at the Christians, how extremism regarding the Prophet of Allah Jesus, peace be upon him, led them to make him a god and a lord! And how extremism led the Khawarij until it caused them to fall into declaring Muslims disbelievers and making their blood lawful, to the point that they declared major Companions disbelievers, including Ali bin Abi Talib, may Allah be pleased with him. The methodology of the Khawarij remains in the Ummah, weakening in one era and strengthening in another. In this era, it has reached its peak in declaring Muslims disbelievers, disregarding bloodshed, and distorting the image of Islam in the corners of the world. So we ask Allah to protect Muslims from their evils and guide them to His straight path. The Muslim must take matters with moderation and deliberation, beware of anomaly and extremism, be gentle with himself and his brothers, and endear himself to Allah's creation and endear Allah's religion to them. On the authority of Anas bin Malik, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: \"Indeed, this religion is firm, so penetrate into it with gentleness\" (2). And on the authority of Aisha, may Allah be pleased with her, from the Prophet, peace and blessings be upon him, who said: \"Indeed, gentleness is not found in anything except that it adorns it, and it is not removed from anything except that it defects it\" (3).",
    "foot_note": "1. Narrated by Muslim (4/2055) number (2670).\n2. Narrated by Ahmad in Al-Musnad (20/346) number (13052). This Hadith, although there is some discussion about it, is Hasan (good) due to its supporting evidences.\n3. Narrated by Muslim (4/2004) number (2594).",
    "book_id": "60"
  },
  {
    "serial_number": "7523681",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 23,
    "volume_number": 1,
    "text": "(Tenth: Open-mindedness in matters of disagreement: One of the most wonderful qualities that adorns knowledge and beautifies its possessor is to be broad-chested and open-minded in dialogue, calm in spirit during disagreement without anger, tension, or nervousness. Here are important matters that a student of knowledge must understand well and observe: 1 - Disagreement is an existing universal norm: Disagreement is an existing universal norm, and its cause is the difference in perceptions, intellects, and understandings. The Salaf among the Companions and those after them differed in the past, and the later generations after them also. Scholars may differ regarding the authenticity of a text or its understanding, and its indication of the intended meaning, as well as their difference in Qiyas (analogy), the saying of a Companion, blocking the means (Sadd al-Dhara'i), and other evidences that are a cause for the emergence of disagreement. 2 - No denial in matters of Ijtihad: A student of knowledge should know that one of the rules established by scholars is that \"there is no denial in matters of Ijtihad\". So it is not permissible for a student of knowledge to denounce anyone in a matter based on Ijtihad, and most issues of religious rulings are of this type. That is why you find the knowledgeable scholar the most open-minded person regarding matters of disagreement because he knows they are based on Ijtihad. 3 - Not to put oneself forward for Fatwa nor be bold in it: The Salaf were the most pious people regarding Fatwa, and they set the most beautiful examples for that, to the point that Ibn Al-Jawzi wrote a book he named (Ta'zim Al-Futya - Magnifying Fatwa) in which he mentioned wonderful images of the Salaf in their caution against putting themselves forward for Fatwa.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523682",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 24,
    "volume_number": 1,
    "text": "In our time, a young person might take upon himself to issue a fatwa on a complex issue which, if presented to the great scholars of the Salaf, they would have refrained from answering. Abu Al-Husayn said: \"One of them gives a fatwa on an issue that if it were presented to (Umar), he would have gathered the people of Badr for it\" (1). 4 - A student of knowledge should not force people to his opinion: Ahmad said in the narration of Al-Marwadhi: \"It is not befitting for a jurist to force people to his Madhhab (school of thought), nor be harsh on them\" (2). Therefore, the methodology of the Salaf was: \"My opinion is correct but accepts the possibility of error, and the opinion of others is wrong but accepts the possibility of correctness\" (3). This is a beautiful rule that outlines the correct methodology in dealing with the opinions and Ijtihads of others. It is a rule that whoever follows it, his mind expands in dealing with situations and opinions. Ibn Uthaymeen said - while listing the etiquettes of a student of knowledge -: \"That his chest be broad in areas of disagreement that stem from Ijtihad; because issues of disagreement among scholars are either those where there is no room for Ijtihad and the matter is clear, so no one is excused for opposing them, or they are those where there is room for Ijtihad, so the one who opposes in them is excused. Your opinion is not a proof against the one who opposes you in it; because if we accepted that, we would say conversely that his opinion is a proof against you\" (4).",
    "foot_note": "1. Narrated by Ibn Batta in Ibtal Al-Hiyal p. (62), Al-Bayhaqi in Al-Madkhal ila Al-Sunan Al-Kubra p. (434) number (803), and Ibn Asakir in Tarikh Dimashq (38/410, 411).\n2. Al-Adab Al-Shar'iyyah by Ibn Muflih (1/166).\n3. See: Al-Ashbah wa Al-Naza'ir by Ibn Nujaim p. (330).\n4. Kitab Al-Ilm p. (23, 24).",
    "book_id": "60"
  },
  {
    "serial_number": "7523683",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 25,
    "volume_number": 1,
    "text": "5 - Not to base Takfir (declaring someone a disbeliever), Tabdi' (declaring someone an innovator), or Tadlil (declaring someone misguided) on disagreement: The Mujtahid in knowledge is not declared a disbeliever, nor misguided, nor a sinner, because he revolves between one reward and two rewards; if he is correct he gets two rewards, and if he errs he gets one reward. This confirms the Hadith of the Prophet, peace and blessings be upon him: \"If a judge judges and strives (exercises Ijtihad) and is correct, he has two rewards. And if he judges and strives and errs, he has one reward\" (1). 6 - Excusing the Imams and Mujtahid scholars: This is a duty of the Ummah towards its scholars who are the heirs of the prophets. For this reason, Sheikh Al-Islam Ibn Taymiyyah wrote an enjoyable book titled (Raf' Al-Malam 'an Al-A'immah Al-A'lam - Lifting the Blame from the Eminent Imams) in which he explained the excuse of the Imams in their contradiction of some texts, and their error in Ijtihad. Among these excuses: that the Hadith did not reach him, or that the Hadith was not proven authentic to him, or that he forgot the Hadith, or his lack of knowledge of the indication of the Hadith, and other excuses. 7 - Adhering to etiquette in disagreement with scholars and those having precedence in Islam: This is done by not disparaging them or attacking them, and mentioning them with goodness and beauty even if they opposed the correct view, and he chose other than their saying (2). And \"The flesh of scholars is poisonous, and Allah's custom in exposing those who belittle them is well known\" (3).",
    "foot_note": "1. Narrated by Al-Bukhari (9/108) number (7352), and Muslim (3/1342) number (1716) from the hadith of Amr bin Al-Aas, may Allah be pleased with him.\n2. This etiquette is discussed extensively in the book Fiqh Al-I'tilaf by Mahmoud Muhammad Al-Khanzadar.\n3. Tabyin Kadhib Al-Muftari by Ibn Asakir p. (29).",
    "book_id": "60"
  },
  {
    "serial_number": "7523684",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 26,
    "volume_number": 1,
    "text": "Type Two: The Student's Etiquette with His Sheikh: The Sheikh or teacher has a great right over his students. He has great merit - after Allah Almighty - in teaching them knowledge and taking their hands towards the path of knowledge and traversing the way of salvation. Hence, it is a duty to observe the right of the teacher; by appreciating and revering him, and observing his rights. This is from the core of knowledge, good manners, and nobility of soul. Ali, may Allah be pleased with him, said: \"I am the slave of him who taught me a single letter; if he wishes he may sell, and if he wishes he may enslave\" (1). Al-Zurnuji, may Allah have mercy on him, said: \"Know that the student of knowledge does not attain knowledge nor benefit from it except by venerating knowledge and its people, and venerating the professor and revering him. It was said: No one arrived (at success) except through reverence (2), and no one fell except by abandoning reverence\" (3). \"And from the reverence of the teacher: that he does not walk in front of him, nor sit in his place, nor initiate speech in his presence except with his permission, nor speak much in his presence, nor ask anything when he is weary, and he should observe the time, and not knock on the door, but wait until the professor comes out\" (4).",
    "foot_note": "1. Ta'lim Al-Muta'allim Tariq Al-Ta'allum p. (25).\n2. The meaning of reverence (Hurma): respecting the Sheikh and being polite with him.\n3. Ta'lim Al-Muta'allim Tariq Al-Ta'allum p. (25).\n4. Ta'lim Al-Muta'allim Tariq Al-Ta'allum p. (26).",
    "book_id": "60"
  },
  {
    "serial_number": "7523685",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 27,
    "volume_number": 1,
    "text": "Among the masterpieces of etiquette with the teacher are the following: First: Etiquette in addressing him: Indeed, it is from beautiful reverence and high etiquette that the student observes manners in addressing his sheikh and teacher; so he does not call him by his bare name, but rather he must address him with speech of reverence, appreciation, and respect, saying to him: O our Sheikh, or O my Sheikh. If it is not fitting for a child to say to his biological father: (O So-and-so) or: (O my father So-and-so), then likewise it is not fitting for him to address with such speech his sheikh who taught him, raised him, and disciplined him (1). The basis for that is the saying of Allah Almighty: {Do not make [your] calling of the Messenger among yourselves as the call of one of you to another} [An-Nur: 63]. The meaning of the noble verse: \"Do not call Muhammad by his name, peace and blessings be upon him, like the calling of one of you to another, but revere him and honor him, and say: O Messenger of Allah, O Prophet of Allah, O Abu Al-Qasim. In the verse is a clarification of revering the teacher of good; because the Messenger of Allah, peace and blessings be upon him, was the teacher of good, so Allah Almighty commanded his reverence and honoring. In it is the recognition of the right of the professor, and in it is the recognition of people of virtue\" (2). The prohibition in His saying: {Do not make [your] calling of the Messenger among yourselves as the call of one of you to another} [An-Nur: 63], is by way of prohibition (Tahrim) regarding the Prophet, peace and blessings be upon him, and by way of contrary to what is best (Khilaf Al-Awla) regarding other than the Prophet, peace and blessings be upon him, among the people of knowledge and all teachers.",
    "foot_note": "1. See: Hilyat Talib Al-Ilm p. (162), and Mawsu'at Al-Akhlaq by Al-Kharraz p. (327).\n2. Bahr Al-Ulum (2/527).",
    "book_id": "60"
  },
  {
    "serial_number": "7523686",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 28,
    "volume_number": 1,
    "text": "Second: Etiquette in asking questions: The student of knowledge's questioning of his sheikh should observe the following: 1 - Supplicating for the Sheikh in the question: Like saying: What do you say, may Allah pardon you, or may Allah have mercy on you, or may Allah grant you success, or may Allah be good to you? (1). 2 - Good questioning and gentleness in it: Indeed, among the wisdoms that have become famous among people: Good questioning is half of knowledge (2). They do not differ on this matter; for if the questioner asks his sheikh well, that calls for him to turn to him to clarify what was confusing to him; because of what he sees of his readiness and receptivity for that. And bad questioning calls for the sheikh to turn away from the student and answering him because of what he sees of his rudeness; so the student is deprived of much good thereby (3). This has been narrated from some of the Salaf: Muhammad bin Sirin said: \"They used to consider good questioning to increase a man's intellect\" (4). Al-Nawawi said - in his discussion of the student's etiquette with his sheikh -: \"And he should be gentle in his questioning, and improve his address\" (5).",
    "foot_note": "1. Al-Faqih wa Al-Mutafaqqih by Al-Khatib Al-Baghdadi (2/383).\n2. Sulaiman bin Yasar said: (Good questioning is half of knowledge) narrated by Ibn Abi Khaythama in Al-Tarikh Al-Kabir (2/150) number (2152).\n3. Al-Tayseer bi Sharh Al-Jami' Al-Saghir (1/424).\n4. Narrated by Ibn Abi Al-Dunya in Kitab Al-Aql wa Fadlih p. (54) number (66).\n5. Al-Majmu' Sharh Al-Muhadhdhab (1/37).",
    "book_id": "60"
  },
  {
    "serial_number": "7523687",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 29,
    "volume_number": 1,
    "text": "3 - Not insisting in questioning: That is by \"not asking him about something out of its place unless he knows from his state that he does not dislike it, nor insisting in asking an annoying insistence, and seizing the opportunity to ask him when he is in good spirits and free, and being gentle in his questioning, and improving his address\" (1). 4 - Seizing the appropriate time for questioning: That is by seeking the best times to ask his sheikh, so he does not ask him in a state of annoyance, boredom, or anger; lest the opposite of truth be conceived with the confusion of the mind, and the least of cases is that the answer falls short (2). \"And if he sees him in a worry that has befallen him, or a matter that comes between him and his mind, and prevents him from fully utilizing his thought, he should refrain from him, until that obstacle is removed, and he returns to the usual state of calmness of heart and goodness of soul, then he asks him\" (3). And Al-Nawawi said: \"And he seizes the opportunity to ask him when he is in good spirits and free\" (4). 6 - Do not be shy to ask about what confuses you: Mujahid, may Allah have mercy on him, said: \"No shy person nor arrogant person learns knowledge\" (5). The serious student \"does not shy away from asking about what confuses him, rather he seeks clarification most completely. For whoever has a thin face (shy), his knowledge becomes thin, and whoever has a thin face when asking, his deficiency appears when meeting men\" (6).",
    "foot_note": "1. Al-Majmu' Sharh Al-Muhadhdhab (1/37).\n2. Al-Fatawa Al-Sa'diyyah p. (102).\n3. Al-Faqih wa Al-Mutafaqqih (2/381).\n4. Al-Majmu' Sharh Al-Muhadhdhab (1/37).\n5. Narrated by Al-Bukhari (1/38) as a suspended narration (Mu'allaq).\n6. Al-Majmu' Sharh Al-Muhadhdhab (1/37) with slight modification.",
    "book_id": "60"
  },
  {
    "serial_number": "7523688",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 30,
    "volume_number": 1,
    "text": "Also, he should, if the Sheikh says to him: Did you understand? not say: Yes, until the intended meaning becomes clearly evident to him; lest he lies and misses understanding: He should not be shy of saying: I did not understand; because verifying gains him immediate and deferred benefits: Of the immediate is memorizing the issue, and his safety from lying by showing understanding of what he did not understand (1). Third: Respecting the Sheikh: This is from the etiquette that the student of knowledge must follow. He should not argue with his sheikh nor harm him, nor be obstinate with him in dialogue and questioning; for the student might be deprived of benefit due to the ominousness of his dealing with his sheikh. No one angered his teacher except that he was deprived of his knowledge. Ibn Hazm, may Allah have mercy on him, said: \"If you attend a gathering of knowledge, let your presence be only the presence of one seeking increase in knowledge and reward, not the presence of one who thinks he can do without what you have; seeking a slip to spread, or a strange thing to defame. These are the actions of the vile, who never succeed in knowledge. If you attend with this intention, you have obtained good in any case. And if you do not attend with this intention, your sitting in your house is more restful for your body, more honorable for your character, and safer for your religion\" (2). Indeed, the teacher and the doctor, both of them ... Do not advise if they are not honored. So be patient with your illness if you insulted its doctor ... And be patient with your ignorance if you were harsh to a teacher.",
    "foot_note": "1. Al-Majmu' Sharh Al-Muhadhdhab (1/37) with slight modification.\n2. Al-Akhlaq wa Al-Siyar fi Mudawat Al-Nufus p. (92).",
    "book_id": "60"
  },
  {
    "serial_number": "7523689",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 31,
    "volume_number": 1,
    "text": "Al-Sha'bi, may Allah have mercy on him, said: \"Abu Salamah (1) used to argue with Ibn Abbas; so he was deprived of much knowledge thereby\" (2), and was deprived of benefiting from him. Abu Salamah admitted that and regretted his behavior and was remorseful for what happened. He said at the end of his life: \"If I had been gentle with Ibn Abbas; I would have obtained much knowledge from him\" (3). \"And among the etiquettes of the learner: That he seeks the pleasure of the teacher even if it contradicts his own opinion, does not backbite in his presence, does not reveal a secret to him, defends him against backbiting if he hears it, and if he is unable, he leaves that assembly; and he should not enter upon him without permission, and if a group enters, they should put forward the best and oldest of them\" (4). The Companions, may Allah be pleased with them, used to teach their students and raise them to ask about what benefits and leave what does not benefit. Ali bin Abi Talib, may Allah be pleased with him, said one day: \"Ask me whatever you wish. Ibn Al-Kawwa' (5) said: What is the blackness in the moon? He said: That belongs to Allah. Did you not ask about what benefits you in your religion and your hereafter? That is the erasure of the night. He said: Tell us about His saying: {And those [clouds] carrying a load [of water]}",
    "foot_note": "1. Abu Salamah bin Abd al-Rahman bin Awf al-Qurashi al-Zuhri, al-Madani. It is said his name was Abdullah, and it is said Ismail, and it is said his name was his kunya. From the trustworthy Tabi'in, narrators of the Six Books narrated from him. He died in Medina in the year (94). See his biography: Tahdhib al-Kamal (33/370-376), and Tarikh al-Islam (2/1198, 1199).\n2. Jami' Bayan Al-Ilm (1/521).\n3. Narrated by Al-Darimi in his Sunan (1/394) number (426), and Al-Khatib Al-Baghdadi in Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (1/209) number (382).\n4. Al-Majmu' Sharh Al-Muhadhdhab (1/36).\n5. He is Abdullah bin Amr Al-Yashkuri, known as (Ibn Al-Kawwa'), one of the heads of the Khawarij, famous for his companionship with Ali and his frequent questions to him. He witnessed Siffin with him, and it is mentioned that he later retracted from the doctrine of the Khawarij. Ibn Asakir said in Tarikh Dimashq (1/360): (What he narrates is not relied upon). See his biography in Lisan Al-Mizan (3/329).",
    "book_id": "60"
  },
  {
    "serial_number": "7523690",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 32,
    "volume_number": 1,
    "text": "[Al-Dhariyat: 2]. He said: May your mother lose you, ask to understand, do not ask to be obstinate. Ask about what concerns you, and leave what does not concern you\" (1). \"Thus were the scholars and wise men when asked about what knowledge does not benefit the questioner, nor ignorance harm him. Or perhaps the answer was also something the questioner could not grasp, nor his understanding reach, they withheld the answer from him, and perhaps they rebuked and scolded him\" (2). If a student of knowledge wants to benefit from his sheikh and obtain his knowledge, he must be patient with harshness coming from him, or bad temper. That should not deter him from sticking with him and benefiting from his knowledge. He should think well of his sheikh, interpret his actions and words that appear contrary to what is correct in the best possible interpretation as much as possible, construe them in the best ways, and strive to find excuses for him. Also, the student of knowledge must bear from his sheikh if he rebukes him or gets angry with him: \"It was said to Sufyan bin Uyaynah: People come to you from the corners of the earth, you get angry with them, they are about to go and leave you? He said: They are fools then, like you, if they leave what benefits them because of my bad temper!\" (3). Al-Khatib Al-Baghdadi titled a chapter in his collection: Chapter \"Gentleness with the Muhaddith, and bearing with him when angry\" (4).",
    "foot_note": "1. Narrated by Ibn Batta in Al-Ibanah Al-Kubra (1/418) number (334).\n2. Al-Ibanah Al-Kubra by Ibn Batta (1/418).\n3. Narrated by Ibn Abi Hatim in Adab Al-Shafi'i wa Manaqibuh p. (158), and Al-Khatib Al-Baghdadi in Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (1/223) number (423).\n4. Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (1/222).",
    "book_id": "60"
  },
  {
    "serial_number": "7523691",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 33,
    "volume_number": 1,
    "text": "Be patient with the bitterness of harshness from a teacher ... For the establishment of knowledge is in his aversion. And whoever has not tasted the bitterness of learning for an hour ... Will swallow the humiliation of ignorance for the length of his life. So whoever does not endure the humiliation of learning remains throughout his life in the blindness of ignorance, and whoever endures it, his affair ends in the honor of this world and the Hereafter. From Ibn Abbas: I was humble as a seeker, so I became mighty as a sought-after one. Fourth: Thanking him for his kindness to him: Allah says: {And do not forget graciousness between you} [Al-Baqarah: 237]. And the Prophet, peace be upon him, said: \"Whoever does not thank people does not thank Allah\" (1). It is obligatory upon a Muslim to preserve the favor for the one who was kind to him, and not forget his merit whoever he may be, so how about the one who was kind to you with knowledge, which is the most majestic aspect of kindness. Sheikh al-Islam, may Allah have mercy on him, said: \"And if a man has been taught by a professor, he recognizes the value of his kindness to him and thanks him\" (2). He also said: \"And upon the learner is to know the sanctity of his professor and thank his kindness to him; for whoever does not thank people does not thank Allah, and he should not deny his right nor reject his favor\" (3).",
    "foot_note": "1. Narrated by Abu Dawood (4/255) number (4811), and Al-Tirmidhi (4/339) number (1954), and he said: (Authentic Hadith).\n2. Majmu' Al-Fatawa (28/17).\n3. Majmu' Al-Fatawa (28/13).",
    "book_id": "60"
  },
  {
    "serial_number": "7523692",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 34,
    "volume_number": 1,
    "text": "Also, the learner should praise Allah for facilitating for him someone to teach him from his ignorance, revive him from his death, and wake him from his slumber. He should seize the opportunity at all times to learn from him, and increase in supplication for him, present or absent, for the Prophet, peace be upon him, said: \"Whoever does you a favor, recompense him; but if you cannot find the means to do so, then pray for him until you feel that you have compensated him\" (1). And what favor is greater than the favor of knowledge, and every favor is cut off except the favor of knowledge, advice, and upbringing. So every issue benefited from a person and above - by which benefit occurred to its learner and others - is a favor and good deeds flowing for its owner (2). Among the nice things reported from the Salaf in this regard is what Yahya bin Saeed Al-Qattan said: \"I pray to Allah Almighty for Al-Shafi'i in every prayer, or every day\", meaning: for what Allah Almighty opened for him of knowledge, and guided him to correctness in it (3). On the authority of Muhammad bin Ishaq bin Rahwayh, he said: \"My father, may Allah have mercy on him, said: Few nights passed but I prayed for those who wrote from us and those we wrote from\" (4). Fifth: To attribute the merit to him: This is an etiquette that a student of knowledge should possess, and to preserve the favor of his sheikh and his merit upon him. Shu'bah, may Allah have mercy on him, said: \"Everyone from whom I wrote a hadith, I am a slave to him\" (5).",
    "foot_note": "1. Narrated by Abu Dawood in his Sunan (2/128) number (1672), and Al-Nasa'i in his Sunan (5/82) number (2567), and its chain is authentic.\n2. Al-Fatawa Al-Sa'diyyah (p. 101, 102) with modification.\n3. Narrated by Ibn Abi Hatim in Adab Al-Shafi'i wa Manaqibuh p. (31, 32), and in Al-Jarh wa Al-Ta'dil (7/202).\n4. Narrated by Al-Bayhaqi in Al-Madkhal ila Al-Sunan Al-Kubra p. (377) number (648).\n5. Narrated by Ibn Al-Ja'd in his Musnad p. (20) number (12).",
    "book_id": "60"
  },
  {
    "serial_number": "7523693",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 35,
    "volume_number": 1,
    "text": "Scholars have stated this in their books that contained such etiquettes: Al-Khatib Al-Baghdadi, may Allah have mercy on him, said: \"Likewise, the learner must acknowledge the virtue of the jurist, and admit that he acquired knowledge from his direction, and took it from him\" (1). Therefore, the guidance of scholars and Imams was that they attribute every good and virtue to their sheikhs and Imams: Ahmad bin Hanbal, may Allah have mercy on him, said: \"This that you see, all or most of it, is from Al-Shafi'i, and I haven't spent a night for thirty years except that I pray for Al-Shafi'i\" (2). Al-Sa'di, may Allah have mercy on him, said in the introduction to his poem on Fiqh maxims: So these are maxims I composed ... From the books of the people of knowledge I obtained them. May the Master reward them with great reward ... And pardon along with His forgiveness and piety. This Imam Al-Sa'di, may Allah have mercy on him, composes this poem on Fiqh maxims, then attributes the merit in it to the people of knowledge in recognition of their great favor and generous bounty upon him. How beautiful it is to acknowledge merit to the people of merit, and return the favor to the people of favor. ",
    "foot_note": "1. Al-Faqih wa Al-Mutafaqqih (2/281).\n2. Narrated by Abu Nu'aym in Hilyat Al-Awliya (9/98).",
    "book_id": "60"
  },
  {
    "serial_number": "7523694",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 36,
    "volume_number": 1,
    "text": "Type Three: The Student's Etiquette with His Colleagues: There are some etiquettes that a student of knowledge should observe with his colleagues and brothers, including: First: Avoiding Envy: Allah says: {Or do they envy people for what Allah has given them of His bounty?} [An-Nisa: 54]. Allah Almighty condemns in this noble verse the envious people who object to Allah's bounty which He specifies for some of His servants. Al-Nawawi said - while listing a number of maladies of students of knowledge -: \"Among them is caution against envy, showing off, self-admiration, and looking down on people even if they are degrees below him. These are maladies and diseases with which many of those with vile souls are afflicted. The way to negate envy is to know that the wisdom of Allah Almighty required placing this virtue in this human being; so do not object to nor dislike what Wisdom required\" (1). Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, said: \"Some of those affiliated with knowledge and others may be afflicted with a type of envy towards one whom Allah has guided with beneficial knowledge or righteous deed. This is a blameworthy trait absolutely, and it is in this position among the morals of those who earned anger\" (2).",
    "foot_note": "1. Al-Majmu' Sharh Al-Muhadhdhab (1/28).\n2. Iqtida' Al-Sirat Al-Mustaqim (1/83).",
    "book_id": "60"
  },
  {
    "serial_number": "7523695",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 37,
    "volume_number": 1,
    "text": "Complaints about the envy of some people of knowledge towards others have been ancient. A group of people of knowledge envied Al-Shafi'i, so Ahmad said defending Al-Shafi'i: \"By Allah, we have seen nothing from him but good, nor heard anything but good. Then Ahmad said to those around him: Know - may Allah Almighty have mercy on you - that a man among the people of knowledge, if Allah grants him something of knowledge and his peers and likes are deprived of it, they envy him and accuse him of what is not in him. What a miserable trait in the people of knowledge\" (1). Let the student of knowledge beware of speaking about his peers inappropriately, and let not Satan enter upon him and blow into the fire of envy between him and his companions among the students of knowledge; rather, let him strive against himself in that. Al-Dhahabi said in the biography of Mutayyan (2): \"Muhammad bin Uthman bin Abi Shaybah (3) spoke against him, and he spoke against Ibn Uthman. The speech of peers is generally not considered, especially if there is competition between them. Ibn Uthman counted about three delusions for Mutayyan, so what? Mutayyan is the more trustworthy of the two men, and the commendation of someone like Al-Daraqutni suffices him\" (4).",
    "foot_note": "1. Narrated by Al-Bayhaqi in Manaqib Al-Shafi'i (2/259).\n2. He is Muhammad bin Abdullah bin Sulaiman Al-Hadrami Al-Kufi, nicknamed and known as (Mutayyan). He was called Mutayyan because he used to play with boys in his childhood, and they would plaster his back with mud (Teen). Abu Nu'aym saw him one day and said: O Mutayyan, why don't you attend the assembly of knowledge? So that became famous. He died in the year (297 AH). See his biography: Talqih Fahoum Ahl Al-Athar p. (356), Tabaqat Al-Hanabila (1/300), and Siyar A'lam Al-Nubala (11/28).\n3. He is Al-Hafiz Abu Ja'far Muhammad bin Uthman bin Abi Shaybah Al-Kufi Al-Absi by loyalty. He had many Hadiths and broad narration. Among his works is Al-Tarikh Al-Kabir. He died in the year (297 AH). See his biography: Tarikh Baghdad (4/68), and Tadhkirat Al-Huffaz (2/171).\n4. Siyar A'lam Al-Nubala (11/28).",
    "book_id": "60"
  },
  {
    "serial_number": "7523696",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 38,
    "volume_number": 1,
    "text": "Second: Not being stingy in benefiting and helping them: Based on the generality of Allah's saying: {And cooperate in righteousness and piety, but do not cooperate in sin and aggression} [Al-Ma'idah: 2]. Meaning: Let some of you help others in righteousness. Righteousness: A comprehensive name for everything Allah loves and is pleased with, of outward and inward deeds, regarding the rights of Allah and the rights of humans... And every trait of good ordered to be done, or trait of evil ordered to be left, the servant is commanded to do it himself, and to help others among his believing brothers in it (1). Among the virtues regarding the student of knowledge: That he strives to convey what he has learned to his colleagues, and exerts effort in informing them, and does not withhold (2) from them what he has; for withholding what he has and stinginess in it is a sign of selfishness and evidence of weak faith restraint. The requirement of faith and brotherhood is to love for his brother what he loves for himself; based on what Anas, may Allah be pleased with him, narrated from the Prophet, peace be upon him, who said: \"None of you [truly] believes until he loves for his brother what he loves for himself\" (3). Third: Reviewing knowledge together: It is beautiful for a student of knowledge to recall knowledge and its issues with his companions, reviving the sunnah of the early predecessors, and practicing dialogue and discussion with his comrades to establish knowledge in his mind, thereby strengthening his memorization and recall, and knowing the places of his errors",
    "foot_note": "1. Tayseer Al-Karim Al-Rahman p. (219) with slight modification.\n2. Yadin: With Kasra on Dad and Fatha, from Dann or Dinn, which is stinginess. See: Tahdhib Al-Lughah (11/321), and Al-Misbah Al-Munir (2/365).\n3. Narrated by Al-Bukhari (1/12) number (13), and Muslim (1/67) number (45).",
    "book_id": "60"
  },
  {
    "serial_number": "7523697",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 39,
    "volume_number": 1,
    "text": "and areas of defect, and benefiting from what others have. Al-Khalil bin Ahmad said: \"Discuss your knowledge; you will remember what you have, and benefit from what you do not have\" (1). Al-Khatib Al-Baghdadi titled two chapters in his collection on this: Chapter One: \"Chapter on Discussion with Followers and Companions\" (2), and Chapter Two: \"Chapter on Discussion with Peers and Equals\" (3). On the authority of Muslim Al-Batin, he said: \"I saw Abu Yahya Al-A'raj - who was knowledgeable in the hadith of Ibn Abbas - he and Sa'id bin Jubayr gathered in the mosque of Kufa, and discussed the hadith of Ibn Abbas\" (4). Ibrahim Al-Nakhai said: \"The night feels long to me, until I meet my companions and discuss with them\" (5). On the authority of Abu Mushir, he said: \"I heard Sa'id bin Abd al-Aziz scolding the companions of Al-Awza'i, saying: Why do you not gather? Why do you not discuss together?!\" (6).",
    "foot_note": "1. Narrated by Al-Khatib Al-Baghdadi in Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (2/273) number (1834).\n2. Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (2/269).\n3. Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (2/273).\n4. Narrated by Al-Khatib Al-Baghdadi in Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (2/273) number (1831).\n5. Narrated by Al-Bayhaqi in Al-Madkhal ila Al-Sunan Al-Kubra p. (293) number (434), Al-Khatib Al-Baghdadi in Al-Jami' li Akhlaq Al-Rawi (2/269) number (1827), and Ibn Abd Al-Barr in Jami' Bayan Al-Ilm (1/428) number (637).\n6. Narrated by Al-Khatib Al-Baghdadi in Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (2/273) number (1833).",
    "book_id": "60"
  },
  {
    "serial_number": "7523698",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 40,
    "volume_number": 1,
    "text": "Type Four: The Student's Etiquette with the General Public: There are a number of etiquettes that a student of knowledge should embody in his dealings with people, which are: First: Teaching them and offering advice to them: The responsibility of the student of knowledge before people is a great responsibility, especially if they are his family, relatives, and clan. Allah Almighty said: {And warn your closest kindred} [Ash-Shu'ara: 214]. And He Glory be to Him said: {O you who have believed, protect yourselves and your families from a Fire whose fuel is people and stones} [At-Tahrim: 6]. And Allah Almighty said: {And it is not for the believers to go forth [to battle] all at once. For there should separate from every division of them a group [remaining] to obtain understanding in the religion and warn their people when they return to them that they might be cautious} [At-Tawbah: 122]. \"Meaning to learn Sharia knowledge, know its meanings, understand its secrets, teach others, and warn their people when they return to them. In this is the virtue of knowledge, especially understanding in religion, and that it is the most important of matters, and that whoever learns knowledge must spread and disseminate it among the servants, and advise them in it, for the spread of knowledge from the scholar is from his blessing and his reward which grows for him\" (1).",
    "foot_note": "1. Tayseer Al-Karim Al-Rahman p. (355).",
    "book_id": "60"
  },
  {
    "serial_number": "7523699",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 41,
    "volume_number": 1,
    "text": "Second: To speak to people about what they know: One of the things a student of knowledge must pay attention to in his call to the general public is to address them with what they understand and comprehend, and not to address them with something their minds cannot grasp, nor understand; because that calls for them to be tempted in their religion, and to understand speech contrary to its intent, so they go astray from where they do not perceive, and it becomes a cause for their misguidance and error (1). Abdullah bin Masud, may Allah be pleased with him, said: \"You do not narrate a hadith to a people that their minds do not grasp, except that it becomes a tribulation (fitnah) for some of them\" (2). Ali bin Abi Talib, may Allah be pleased with him, said: \"Speak to people about what they know. Do you want Allah and His Messenger to be denied?\" (3). Al-Bukhari titled this narration: \"Chapter: Whoever specified knowledge for a people to the exclusion of others; disliking that they might not understand\" (4). \"In this narration is that knowledge should be specified for a people because of their retention and correctness of understanding, and the subtle meaning should not be offered to one who does not deserve it among students and one upon whom license and reliance is feared due to his short understanding\" (5). Ibn Hubayrah, may Allah have mercy on him, said: \"In this hadith is jurisprudence: That the scholar should raise people with knowledge a [proper] upbringing, and feed them it a [proper] feeding; so he raises them with small knowledge before big knowledge,",
    "foot_note": "1. See: Al-Ilm Fadluhu Talabuhu by Al-Amin Al-Haj Muhammad Ahmad p. (159 - 161).\n2. Narrated by Muslim in his Sahih (1/11).\n3. Narrated by Al-Bukhari in his Sahih (1/37) number (127).\n4. Sahih Al-Bukhari (1/37).\n5. Quoted by Ibn Battal from Al-Muhallab in his commentary on Sahih Al-Bukhari (1/207).",
    "book_id": "60"
  },
  {
    "serial_number": "7523700",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 42,
    "volume_number": 1,
    "text": "so he becomes a Rabbani (Lordly scholar) as came in the other hadith. This is clarified by the fact that the child, when his stomach was not strong enough to digest coarse foods, Allah facilitated his provision from his mother's breast for a long period in which he gradually moves to consuming foods remaining in their state. For milk was food, then it turned into milk so it became like the rising thing, so it is of the gentlest foods. If the child's stomach becomes strong, he is fed strong foods. Likewise, the scholar should be gentle with people in teaching, so he does not expose their minds to hearing what they deny before he is certain of the strength of their minds to repel suspicion, accept proof, disbelieve in Taghut, and believe in Allah, otherwise he exposes them to denial, as Ali, may Allah be pleased with him, said: \"Do you want Allah and His Messenger to be denied?\" (1). Ibn Hajar, may Allah have mercy on him, said: \"And in it is evidence that the ambiguous (Mutashabih) should not be mentioned before the common people\" (2). This is the methodology of the Companions, may Allah be pleased with them. - This is Abu Hurairah, may Allah be pleased with him: It came from him that he said: \"I memorized from the Messenger of Allah, peace and blessings be upon him, two vessels: As for one of them, I spread it, and as for the other, if I spread it, this pharynx would be cut\" (3), and the meaning is what happens of tribulations and the like. - And Al-Hasan, may Allah have mercy on him: Denied Anas's narration to Al-Hajjaj of the story of the Uraniyyin; because he took it as a means to what he relied upon of excess in shedding blood with his flimsy interpretation. - And Abu Yusuf, one of the companions of Abu Hanifa, disliked narrating strange things to people. - And Malik disliked narrating to common people the hadiths of Attributes (4).",
    "foot_note": "1. Al-Ifsah 'an Ma'ani Al-Sihah (1/268).\n2. Fath Al-Bari (1/225).\n3. Narrated by Al-Bukhari in his Sahih (1/35) number (120).\n4. See: Fath Al-Bari by Ibn Hajar (1/225).",
    "book_id": "60"
  },
  {
    "serial_number": "7523701",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 43,
    "volume_number": 1,
    "text": "Third: Mercy towards them and showing compassion for them: Allah made Muhammad, peace and blessings be upon him, the role model of creation in mercy and kindness to the believers, and his Lord described him saying: {Concerned over you, to the believers kind and merciful} [At-Tawbah: 128]. Jarir bin Abdullah narrated, he said: The Messenger of Allah, peace and blessings be upon him, said: \"He who does not show mercy to people, Allah Almighty will not show mercy to him\" (1). \"So the Prophet, peace and blessings be upon him, encouraged mercy and kindness to all creation of all animals (2), of their various kinds in more than one hadith, and the most noble of them is the human, even if he is (3) a disbeliever. So be merciful to yourself and others, and do not hoard your good. Have mercy on the ignorant with your knowledge, the humiliated with your status, the poor with your money, the old and young with your compassion and kindness, the sinners with your call, and the animals with your kindness. For the closest people to Allah's mercy are those most merciful to His creation\" (4). And have mercy with your heart on Allah's creation and tend to them ... For the Most Merciful only has mercy on he who shows mercy. And intend by that the Face of Allah our Creator ... Glory be to Him from a God who created the souls. And seek the reward of that from your Master, His mercy ... Allah does not wrong a servant who was noble.",
    "foot_note": "1. Narrated by Al-Bukhari (9/115) number (7376), and Muslim (4/1809) number (2319).\n2. Man on the genus level is an animal, but he is distinguished from other animals by being a rational animal. And the meaning of rationality (Nutq): Readiness for sciences and industries. See: Mafatih Al-Ulum by Al-Khawarizmi p. (166), and Al-Mathal Al-Sa'ir fi Adab Al-Katib wa Al-Sha'ir by Ibn Al-Athir (1/411).\n3. In the printed version: (And if he is), and the correct is what we established.\n4. Sharh Al-Bukhari by Al-Safiri (2/50).",
    "book_id": "60"
  },
  {
    "serial_number": "7523702",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 44,
    "volume_number": 1,
    "text": "Sheikh al-Islam, may Allah have mercy on him, said describing Ahlus-Sunnah: \"They are the most knowledgeable of people about the truth, and the most merciful of them to creation\" (1). This is the trait of the successful student of knowledge; you find him merciful to people, kind and gentle with them, compassionate towards them and having mercy on them, hoping for their guidance, and striving for their religious and worldly interests. Fourth: Casting Salam (Peace) and returning it, and smiling in the faces of others: Casting Salam and returning it are among the causes of spreading love among Muslims. Abu Hurairah, may Allah be pleased with him, narrated from the Messenger of Allah, peace and blessings be upon him, that he said: \"You will not enter Paradise until you believe, and you will not believe until you love one another. Shall I not guide you to something if you do it you will love one another? Spread Salam amongst yourselves\" (2). Indeed, the Prophetic Sunnah came commanding Salam upon everyone: On the authority of Abdullah bin Amr, may Allah be pleased with them: \"That a man asked the Messenger of Allah, peace and blessings be upon him, which Islam is best? He said: To feed food, and to read Salam upon whom you know and whom you do not know\" (3). This is contrary to what some people are upon, who do not greet except their acquaintances, and this is one of the mistakes in the chapter of Salam. Islam encouraged initiating Salam, and arranged virtues upon it, including: The hadith of Abu Umamah, he said: The Messenger of Allah, peace and blessings be upon him, said: \"Indeed the closest people to Allah are those who begin them with Salam\" (4).",
    "foot_note": "1. Minhaj Al-Sunnah Al-Nabawiyyah (5/158).\n2. Narrated by Muslim (1/74) number (54) from Abu Hurairah, may Allah be pleased with him.\n3. Narrated by Al-Bukhari (1/15) number (28), and Muslim (1/65) number (39).\n4. Narrated by Abu Dawood (4/351) number (5197).",
    "book_id": "60"
  },
  {
    "serial_number": "7523703",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to the Sciences of Sharia",
    "edition": "None",
    "publisher": "Center for Scientific Elites",
    "page_number": 45,
    "volume_number": 1,
    "text": "And the hadith of Sayyar bin Abi Sayyar, who said: \"I was walking with Thabit Al-Bunani, and he passed by boys and greeted them. Thabit narrated that he was walking with Anas, and he passed by boys and greeted them. Anas narrated that he was walking with the Messenger of Allah, peace and blessings be upon him, and he passed by boys and greeted them\" (1). We benefit from these hadiths: the legitimacy of spreading Salam and casting it upon everyone, even children, because it is part of being kind to them and winning their hearts. As for smiling, it is one of the highest means of winning hearts; rather, the Prophet, peace and blessings be upon him, considered it an act of worship: He said: \"Your smile in the face of your brother is charity for you\" (2). Al-Tabarani titled a chapter on it: \"Chapter: The virtue of a man smiling in the face of his Muslim brother\" (3). The guidance of the Prophet, peace and blessings be upon him, was smiling without laughing [loudly], as came in the hadith of Jabir bin Samurah who said - while talking about the Companions with the Prophet, peace and blessings be upon him: \"They used to talk and take up matters of the Jahiliyyah, so they would laugh and he would smile\" (4). The student of knowledge's model and ideal example is his Prophet, peace and blessings be upon him. How beautiful is the student of knowledge smiling, cheerful, with a free face. Ibn Uyaynah, may Allah have mercy on him, said: \"Cheerfulness is the trap of affection, and righteousness is an easy thing; a cheerful face and gentle speech.\" Ibn Al-Mubarak, may Allah have mercy on him, said: \"I admire from the readers (of Quran/Scholars) every free-faced laughing one, as for...",
    "foot_note": "1. Narrated by Muslim (4/1708) number (2168).\n2. Narrated by Al-Tirmidhi (4/340) number (1956) from the hadith of Abu Dharr, may Allah be pleased with him, and said: Hasan Gharib Hadith.\n3. Makarim Al-Akhlaq by Al-Tabarani p. (319).\n4. Narrated by Muslim (1/463) number (670).",
    "book_id": "60"
  },
  {
    "serial_number": "7523704",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 46,
    "volume_number": 1,
    "text": "who meets you with cheerfulness, while he meets you with a frown, as if he is conferring a favor upon you with his knowledge; may Allah not increase his likes among the reciters (1). Fifth: Forbearance and Gentleness: Allah Almighty said: {So by mercy from Allah, you were lenient with them. And if you had been rude [in speech] and harsh in heart, they would have disbanded from about you. So pardon them and ask forgiveness for them and consult them in the matter} [Al Imran: 159]. And Allah Almighty says, advising Moses and Aaron: {Go, both of you, to Pharaoh. Indeed, he has transgressed (43) And speak to him with gentle speech that perhaps he may be reminded or fear [Allah]} [Taha: 43, 44]. On the authority of Aisha, may Allah be pleased with her, from the Prophet, peace and blessings be upon him, who said: Gentleness is not found in anything but that it adorns it, and it is not removed from anything but that it defects it (2). The Prophet, peace and blessings be upon him, considered the harsh person to be devoid of goodness, saying: Whoever is deprived of gentleness is deprived of goodness (3). If Allah combines knowledge and forbearance for a student of knowledge, He has gathered for him the edges of goodness. On the authority of Abu Razin, regarding His saying: {Be Rabbaniyyin (pious scholars)} [Al Imran: 79]; he said: Forbearing scholars (4). And regarding Al-Hasan, he said: {And when the ignorant address them [harshly], they say [words of] peace} [Al-Furqan: 63]; Forbearing, even if they are treated ignorantly, they do not act ignorantly (5).",
    "foot_note": "1. Narrated by Al-Bayhaqi in Shu'ab Al-Iman (10/ 409) No. (7710), and Ibn Asakir in Tarikh Dimashq (32/ 458). \n2. Narrated by Muslim (4/ 2004) No. (2594). \n3. Narrated by Muslim (4/ 2003) No. (2592) from the Hadith of Jarir bin Abdullah, may Allah be pleased with him. \n4. Narrated by Ibn Abi Al-Dunya in Kitab Al-Hilm p. (25) No. (9). \n5. Narrated by Ibn Abi Al-Dunya in Kitab Al-Hilm p. (26) No. (10).",
    "book_id": "60"
  },
  {
    "serial_number": "7523705",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 47,
    "volume_number": 1,
    "text": "And on the authority of Ata bin Abi Rabah, he said: {They walk upon the earth easily} [Al-Furqan: 63] he said: Forbearing scholars (1). It was said of old: Nothing has been added to something like forbearance to knowledge (2). Sixth: Not to place himself in a position where knowledge and its people are humiliated: The student of knowledge is a role model for people; he should be in a bright image, for he is the ambassador of knowledge and scholars, reflecting their image and leaving a good impression of them. Therefore, he must distance himself from everything that scratches this beautiful image and challenges this vision, whether in terms of his essence or appearance, his speech or his actions. Among this is: First: Care for appropriate clothing: The predecessors (Salaf) used to care about clothing and good appearance. Yahya bin Muhammad Al-Shahid, may Allah have mercy on him, said: I have not seen a narrator more pious than Yahya bin Yahya, nor one with better clothing than him (3). Ali bin Abi Talib, may Allah be pleased with him, said: Renew (4) the clothes when you wear them, for they are... The adornment of men, by which you are honored and respected.",
    "foot_note": "1. Narrated by Ibn Abi Al-Dunya in Kitab Al-Hilm p. (26) No. (11). \n2. Narrated by Ibn Al-Mubarak in Al-Zuhd wa Al-Raqa'iq (1/ 470) No. (1336), Ibn Abi Al-Dunya in Al-Hilm p. (28) No. (14), and Al-Khatib Al-Baghdadi in Al-Jami' li Akhlaq Al-Rawi (1/ 94) No. (42). \n3. Narrated by Al-Khatib Al-Baghdadi in Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (1/ 381) No. (880). \n4. Ajid: An imperative verb from (Jadda), (Yajiddu) if it becomes new. Al-Jadid: Adjective, Source: Al-Jiddah, Plural: Ajiddah, Judud, and Judad. See: Lisan Al-Arab (3/ 111), and Al-Misbah Al-Munir (1/ 92).",
    "book_id": "60"
  },
  {
    "serial_number": "7523706",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 48,
    "volume_number": 1,
    "text": "And leave humility in clothes out of sin/piety... For Allah knows what you conceal and hide. For the shabbiness of your garment does not increase your nearness... To Allah while you are a sinful servant. And the splendor of your garment does not harm you after you... Fear Allah and avoid what is forbidden (1). It is also recommended for the student of knowledge to take care of himself in terms of cleanliness, bathing, perfuming, and removing unpleasant odors. Al-Nawawi said - speaking about the etiquette of the student of knowledge when entering gatherings of knowledge -: And he should enter with full dignity, his heart empty of distractions, purified, cleaned with Siwak (toothstick), trimming the mustache and nails, and removing unpleasant odors (2). Seventh: Distancing from gatherings of idle talk and clamor: The gatherings that the student of knowledge attends and gains knowledge and reward by attending are gatherings of knowledge, jurisprudence, and etiquette. He distances himself from gatherings of falsehood and amusement, where gossip, backbiting, tale-bearing, obscenity, immorality, shameless stories, mocking religion and its people, and ridiculing them abound; indeed, explicit disbelief might occur therein, and refuge is sought with Allah Almighty. Allah Almighty said: {And those who do not testify to falsehood, and when they pass near ill speech, they pass by with dignity} [Al-Furqan: 72]. The meaning of the verse: Meaning: They do not attend falsehood, meaning: forbidden speech and action. So they avoid all gatherings containing forbidden words or forbidden actions, such as delving into",
    "foot_note": "1. Al-Jami' li Akhlaq Al-Rawi wa Adab Al-Sami' (1/ 382). \n2. Al-Majmu' Sharh Al-Muhadhdhab (1/ 36).",
    "book_id": "60"
  },
  {
    "serial_number": "7523707",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 49,
    "volume_number": 1,
    "text": "the verses of Allah, false argument, backbiting, tale-bearing, cursing, slander, mockery, forbidden singing, drinking alcohol, spreading silk [carpets for men], images, and the like. If they do not witness falsehood, then it is even more appropriate that they do not say or do it (1). The Almighty said: {And it has already come down to you in the Book that when you hear the verses of Allah [recited], they are denied [by them] and ridiculed; so do not sit with them until they enter into another conversation. Indeed, you would then be like them} [An-Nisa: 140]. The summary of the matter: You, O student of knowledge, must not tread on the carpet of those who commit evil in their club, and tear the veils of etiquette, feigning ignorance of that. If you do that, your crime against knowledge and its people is great (2). Eighth: Distancing from commotion (Haishat) and Fitnah (sedition): The student of knowledge must beware of places of recklessness, commotion, and sedition which are populated by those of light minds and bad manners, because they cause knowledge to lose its beauty and prestige. On the authority of Abdullah bin Masoud, he said: The Messenger of Allah, peace and blessings be upon him, said: Beware of the commotions (Haishat) of the markets (3). And the commotions of the markets: meaning their mixing and what occurs in them of trials and raised voices. He wanted them not to be of their people, for correctness is hidden therein, the truth is not clear therein, and every person deserving of delay is advanced therein, and every person deserving of advancement is delayed therein (4).",
    "foot_note": "1. Taysir Al-Karim Al-Rahman p. (587). \n2. Hilyat Talib Al-Ilm p. (151). \n3. Narrated by Muslim in his Sahih (1/ 323) No. (432). \n4. Al-Ifsah 'an Ma'ani Al-Sihah (2/ 109).",
    "book_id": "60"
  },
  {
    "serial_number": "7523708",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 50,
    "volume_number": 1,
    "text": "Sheikh Bakr Abu Zayd, may Allah have mercy on him, said in the book Al-Hilyah: (Turning away from commotions), then he advised: Protecting oneself from clamor and commotions, for error is under the clamor, and this contradicts the etiquette of seeking [knowledge] (1). Conclusion: The student of knowledge should adorn himself with the etiquettes of the soul; such as chastity, forbearance, patience, and humility to the truth. He should adopt the stillness of a bird: dignity, gravity, and lowering the wing (humility); bearing the humiliation of learning for the glory of knowledge and the nobility of its goal. O student of knowledge, beware of the nullifiers of these etiquettes, for along with sin, they establish against yourself a witness that there is a defect in the mind, and indicate deprivation of success. Beware of pride (Al-Khuyala'), for it is hypocrisy and arrogance, and the severity of guarding against it among the predecessors reached a great extent and a far limit (2). These are fragments on the etiquette of the student of knowledge with himself, with his sheikh, with his brothers and colleagues, and with all people. May Allah grant us all success to adhere to these etiquettes, adorn ourselves with them, and act upon them. ",
    "foot_note": "1. Hilyat Talib Al-Ilm p. (152). \n2. Hilyat Talib Al-Ilm p. (145) with adaptation.",
    "book_id": "60"
  },
  {
    "serial_number": "7523709",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 51,
    "volume_number": 1,
    "text": "Methodology of the Student of Knowledge in Seeking Knowledge: After mentioning the etiquette of the student of knowledge, it is worth explaining the sound methodology that the student of knowledge should follow, which is represented in the following: First: Mastering the Fundamentals (Usul): (Whoever does not master the fundamentals; is denied arrival), and (Whoever seeks knowledge in a lump sum, it goes away from him in a lump sum), and it was also said: (Crowding knowledge in the hearing is a misleading of understanding). Therefore, there must be rooting and founding for every art you seek, by mastering its original text and its summary with a proficient sheikh, not by self-acquisition alone. Take knowledge gradually, for it is the path to firmness. Allah Almighty said: {And [it is] a Qur'an which We have separated [by intervals] that you might recite it to the people over a prolonged period. And We have sent it down progressively} [Al-Isra: 106]. So Allah Almighty commanded in this verse to take the Quran over a prolonged period and deliberately. Thus, taking knowledge and acquiring it should be likewise. So before you are matters that must be observed in every art you seek: 1 - Memorizing a summary in it. 2 - Mastering it with a proficient sheikh. 3 - Mastering its explanation. 4 - Reviewing what you have memorized and mastered its explanation constantly; for repeating knowledge is the guarantee of its stability. Second: Receiving knowledge from Sheikhs: The origin in seeking is through dictation and receiving from Sheikhs, and taking from the mouths of men, not from newspapers and the bellies of books.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523710",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 52,
    "volume_number": 1,
    "text": "It has been said: (Whoever enters into knowledge alone; exits alone); meaning: whoever enters into seeking knowledge without a sheikh; exits from it without knowledge. This statement, although not precise, contains much truth. Third: Preserving knowledge by writing: Exert effort in preserving knowledge by writing it; because binding knowledge by writing is a security against loss, especially in issues of knowledge that are not in their expected places. Among its greatest benefits is that in old age and weakness of strength, you will have material to draw from and write in without the trouble of research and investigation. Al-Sha'bi said: If you hear something, write it down, even if on a wall (1). Fourth: Maintaining what is memorized: Maintain your knowledge from time to time, for lack of maintenance is the title of the departure of knowledge, whatever it may be. On the authority of Ibn Umar, may Allah be pleased with them, that the Messenger of Allah, peace and blessings be upon him, said: The example of the companion of the Quran is only like the example of the companion of the hobbled camels; if he tends to them, he keeps them, and if he releases them, they go away (2). Al-Hafiz Ibn Abd Al-Barr, may Allah have mercy on him, said: In this Hadith is evidence that whoever does not tend to his knowledge, it goes away from him (3). If the Quran, which is made easy for remembrance, goes away if not tended to, what do you think of other customary sciences?!.",
    "foot_note": "1. Narrated by Imam Ahmad in Al-Ilal wa Ma'rifat Al-Rijal (1/ 216), and Al-Dulabi in Al-Kuna (3/ 933). \n2. Narrated by Al-Bukhari in his Sahih (6/ 193) No. (5031), and Muslim in his Sahih (1/ 543) No. (789). \n3. Al-Tamhid (14/ 133).",
    "book_id": "60"
  },
  {
    "serial_number": "7523711",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 53,
    "volume_number": 1,
    "text": "Fifth: Resorting to Allah Almighty in seeking and acquisition: Do not be sad if a science is not opened to you. Double the desire, and flee to Allah in supplication, resorting to Him, and breaking down before Him. Sheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him, often said in his supplication if the interpretation of a verse from the Book of Allah Almighty became difficult for him: \"O Teacher of Adam and Abraham, teach me; and O One who gave understanding to Solomon, give me understanding,\" and he would find the opening in that. Sixth: Do not be 'Abu Shibr' (Father of a Span): This is by claiming knowledge of what you do not know, or mastery of what you have not mastered. If you do, it is a thick veil against knowledge. Beware of being (Abu Shibr), for it has been said: Knowledge is three spans. Whoever enters the first span becomes arrogant, whoever enters the second span becomes humble, and whoever enters the third span knows that he does not know. Seventh: Preserving the hours of your life: O student of knowledge, Time, time for acquisition... So preserving time with seriousness and diligence, sticking to the quest, keeping close company with Sheikhs, and occupying oneself with knowledge by reading, teaching, studying, contemplating, memorizing, and researching, especially in the prime of youth and the beginning of life, and the mine of the outcome. So seize this precious opportunity; to attain the high ranks of knowledge, for it is (a time of gathering the heart and concentration of thought); due to the lack of distractions and diversions from life obligations and leadership, and the lightness of burdens and dependents (1).",
    "foot_note": "1. Hilyat Talib Al-Ilm p. (184).",
    "book_id": "60"
  },
  {
    "serial_number": "7523712",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 54,
    "volume_number": 1,
    "text": "Eighth: Eagerness for beneficial sciences: Be eager for what benefits you and brings you closer to Allah among the sciences; for sciences are many and times are scarce. The successful one is he who occupies himself with what deepens his connection with Allah and increases his faith and attachment to his Master. For this reason, among the supplications of our Prophet, peace and blessings be upon him, was that he used to ask Allah for beneficial knowledge, as proven in the Hadith of Umm Salamah - may Allah be pleased with her: That the Prophet, peace and blessings be upon him, used to say: When he prayed the morning prayer, upon giving Salams: O Allah, I ask You for beneficial knowledge, good provision, and acceptable deeds (1). The signs of beneficial knowledge are: 1) Acting upon the knowledge. 2) Increase in faith and abundance of acts of obedience. 3) Dislike of self-praise and commendation. 4) That your humility increases whenever your knowledge increases. 5) Fleeing from the love of leadership, fame, and appearance. 6) Abandoning the claim of knowledge. 7) Thinking ill of oneself, and thinking well of people to avoid falling into [badmouthing] them. 8) Spreading knowledge, and doing good to people by offering it, and seeking reward from Allah for that.",
    "foot_note": "1. Narrated by Ibn Majah (1/ 298) No. (925).",
    "book_id": "60"
  },
  {
    "serial_number": "7523713",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 55,
    "volume_number": 1,
    "text": "Section Two\nA Brief Overview of Sharia Sciences",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523714",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 56,
    "volume_number": 1,
    "text": "Sharia sciences are the sciences derived from Islamic Sharia and its two main sources: the Holy Quran and the Noble Sunnah. It applies to Tafsir (Exegesis) and Quranic sciences, Prophetic Hadith and its sciences, the science of Aqidah (Creed), and Fiqh (Jurisprudence), its principles, and rules. These Sharia sciences are the most noble sciences absolutely, due to the honor of their connection to the two revelations: the Book and the Sunnah. They are the most deserving of what times, money, and efforts are spent on. It is not hidden from anyone with intellect that acquiring these sciences is obligatory on every accountable person, to the extent that ensures his worship of Allah Almighty in the manner prescribed. This is what is known as 'Necessary Knowledge' (Al-Ma'lum min al-din bid-darura), by which rulings are known and acted upon, whether for males or females, since a person's need to reform his religion and purify his soul is no less than his need for food, drink, and other necessities of life. There is no doubt that knowledge is honor, light, and virtue, just as ignorance is evil, affliction, and vice. Beneficial knowledge is the source and spring of virtues, while ignorance is the ambush of vices and their path. Therefore, the highest people in rank, the greatest in status, and the most elevated in position are the people of knowledge of Allah and His Messenger: {Allah will raise those who have believed among you and those who were given knowledge, by degrees} [Al-Mujadila: 11]. So the most worthy thing for competitors to compete in, and the most appropriate thing for racers to race towards, is what guarantees the servant's happiness in his livelihood and hereafter, and is a guide to the path of this happiness. That is beneficial knowledge and righteous deeds, without which there is no happiness for the servant, and no salvation for him except by clinging to their cause. So whoever is blessed with knowledge and action has succeeded and gained, and whoever is deprived of knowledge and action is deprived of all good.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523715",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 57,
    "volume_number": 1,
    "text": "Therefore, Allah honored the people of knowledge and made them witness to His Oneness and His uniqueness in worship and divinity, as He Almighty said: {Allah witnesses that there is no deity except Him, and [so do] the angels and those of knowledge - [that He is] maintaining [creation] in justice. There is no deity except Him, the Exalted in Might, the Wise} [Al Imran: 18]. And for the people of knowledge, Allah facilitates the easiest paths to Paradise, and the inhabitants of the heavens and the earth, even the fish in the sea, ask forgiveness for them, as proven in the Hadith of Abu Darda on the authority of the Messenger of Allah, peace and blessings be upon him, who said: Whoever follows a path seeking knowledge therein, Allah will pave for him a path to Paradise. Indeed, the angels lower their wings in approval of the student of knowledge. And indeed, the scholar, those in the heavens and those on earth ask forgiveness for him, even the fish in the water. The superiority of the scholar over the worshiper is like the superiority of the moon on the night of the full moon over all other stars. Indeed, the scholars are the heirs of the Prophets, and the Prophets did not leave behind a Dinar or a Dirham, but they left behind knowledge. So whoever takes it has taken an abundant share (1). Through knowledge, laws and rulings are known, and the lawful is distinguished from the prohibited. Knowledge is the leader (Imam) and action is the follower (Ma'mum); it is a commander and action is a subordinate. Revising knowledge is glorification (Tasbih), searching for it is Jihad, seeking it is an act of closeness to Allah Almighty, giving it is charity, and studying knowledge is equivalent to fasting and night prayer. The need for it is greater than the need for drink and food. Imam Ahmad, may Allah have mercy on him, said: People are more in need of knowledge than they are of food and drink; because food and drink are needed once or twice a day, but knowledge is needed",
    "foot_note": "1. Narrated by Abu Dawood in his Sunan (3/ 317) No. (3641), and Al-Tirmidhi in his Jami' (5/ 48) No. (2682), and he said: We do not know this Hadith except from the Hadith of Asim bin Raja' bin Haywah, and it is not connected (Muttasil) according to me. This is how Mahmoud bin Khadash told us with this chain. This Hadith is [also] narrated from Asim bin Raja' bin Haywah, from Al-Walid bin Jamil, from Kathir bin Qais, from Abu Darda, from the Prophet, peace and blessings be upon him, and this is more correct than the Hadith of Mahmoud bin Khadash, and Muhammad bin Ismail's opinion is this is more correct.",
    "book_id": "60"
  },
  {
    "serial_number": "7523716",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 58,
    "volume_number": 1,
    "text": "at every moment (1). For this reason, knowing knowledge and action was one of the most obligatory duties upon servants, by which is their salvation and happiness in this world and the Hereafter. A very important warning must be given to the student of knowledge: Knowledge is the greatest worship, and Allah has not been worshipped with anything greater than knowledge. Acting upon knowledge is the fruit of knowledge and cognition. Knowledge is like the tree and acting upon it is its fruit. Whoever acts upon what he knows, Allah Almighty bequeaths him knowledge of what he did not know, as He Almighty said: {And if We had decreed upon them, \"Kill yourselves\" or \"Leave your homes,\" they would not have done it, except for a few of them. But if they had done what they were instructed, it would have been better for them and a firmer position [for them in faith]. (66) And then We would have given them from Us a great reward. (67) And We would have guided them to a straight path} [An-Nisa: 66-68]. So whoever Allah wants good, happiness, salvation, and high status for in this world and the Hereafter, He facilitates for him beneficial knowledge and righteous deeds, as proven in the two Sahihs from the Hadith of Muawiyah bin Abi Sufyan, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: Whomever Allah wills good for, He gives him understanding in the religion (2). Ibn Hajar, may Allah have mercy on him, said: The implication of the Hadith is that whoever does not gain understanding in religion, meaning does not learn the rules of Islam and the branches connected to them, has been deprived of good; because whoever does not know the matters of his religion is neither a Faqih (jurist) nor a student of Fiqh, so it is valid to describe him as one for whom",
    "foot_note": "1. I'lam Al-Muwaqqi'in (2/ 182). \n2. Narrated by Al-Bukhari in his Sahih (1/ 25) No. (71), and Muslim in his Sahih (2/ 719) No. (1037).",
    "book_id": "60"
  },
  {
    "serial_number": "7523717",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 59,
    "volume_number": 1,
    "text": "good was not intended. In this is a clear indication of the superiority of scholars over all other people, and the superiority of understanding religion over all other sciences (1). Here, O student of knowledge, is a brief overview of the Sharia sciences, their categories, and the most prominent terms of each art:",
    "foot_note": "1. Fath Al-Bari (1/ 165).",
    "book_id": "60"
  },
  {
    "serial_number": "7523718",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 60,
    "volume_number": 1,
    "text": "First: The Science of Tafsir (Exegesis): The science of Tafsir occupies the forefront among Sharia sciences; because understanding the meanings of the Quran is a necessary matter for the reader of the Quran and the one seeking understanding in religion. The science of Tafsir is one of the most important sciences that a student of knowledge should care for, since the honor of a science is by the honor of the known subject. Reflect on what Sheikh Al-Islam said at the end of his life when he regretted not dedicating most of his time to the Quran. He said, may Allah have mercy on him: Allah has opened for me in this time, from the meanings of the Quran and from the principles of knowledge, things that many scholars would wish for, and I regretted wasting most of my time on other than the meanings of the Quran (1). Definition of Tafsir: Tafsir linguistically: A noun derived from 'Fassara' - with the doubling of the Sin - taken from 'Al-Fasr': which is uncovering, clarification, and explanation. From that is His saying Almighty: {And they do not come to you with an argument except that We bring you the truth and the best explanation (Tafsira)} [Al-Furqan: 33]. Technically: A science by which the understanding of the Book of Allah Almighty revealed to Muhammad, peace and blessings be upon him, is known, and the clarification of its meanings, and the extraction of its rulings and wisdoms. Divisions of Tafsir: The science of Tafsir varies according to the consideration upon which it was divided; because Tafsir has several divisions based on different considerations. The most important of these divisions is dividing it according to the trends of the commentators (Mufassirin). According to this consideration, it can be divided into three sections:",
    "foot_note": "1. Quoted by Ibn Abd Al-Hadi in Al-Uqud Al-Durriyyah p. (44), and Ibn Rajab in Dhayl Tabaqat Al-Hanabilah (4/ 519).",
    "book_id": "60"
  },
  {
    "serial_number": "7523719",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 61,
    "volume_number": 1,
    "text": "First: Tafsir bi-al-Ma'thur (Interpretation by Tradition/Narration): It is the one that relies on interpreting the Quran by the Quran, or by the Sunnah; or by what was narrated from the Companions; or by what the senior Followers (Tabi'in) said. It is the best section of Tafsir, if it is free from weak Hadiths and Israelite narrations (Isra'iliyyat). Among the books of Tafsir bi-al-Ma'thur: 1) Jami' al-Bayan, by Abu Ja'far Muhammad bin Jarir al-Tabari, died in the year (310 AH). 2) Tafsir al-Quran al-Azim, by Abd al-Rahman bin Abi Hatim, died in the year (327 AH). 3) Tafsir al-Quran al-Azim, by Ismail bin Umar bin Kathir, died in the year (774 AH). Second: Tafsir bi-al-Ra'y wal-Ijtihad (Interpretation by Opinion and Reasoning/Knowledge): This section is of two types: Permissible and Blameworthy. As for the Permissible: It is striving (Ijtihad) to interpret what has no established transmitted text or narrated tradition, according to known conditions. As for the Blameworthy, it is the opposite of that. Like commentaries written to support innovations in beliefs, or commentaries that have no sound basis. Among the books of Tafsir bi-al-Ra'y: 1) Mafatih al-Ghayb, by Muhammad bin Umar Fakhr al-Din al-Razi, died in the year (606 AH). 2) Anwar al-Tanzil, by Abdullah bin Umar al-Baydawi, died in the year (685 AH). 3) Lubab al-Ta'wil, by Abu al-Hasan Ali bin Muhammad al-Khazin, died in the year (741 AH). Third: Al-Tafsir Al-Ishari (Indicative Interpretation): It is interpreting the Quran unlike its apparent meaning for a hidden sign that the Batinis and Sufis believe appears to them. This section of Tafsir is rejected and invalid.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523720",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 62,
    "volume_number": 1,
    "text": "Among the books of Tafsir Al-Ishari: 1) Tafsir al-Quran al-Azim, by Sahl bin Abdullah al-Tustari, died in the year (283 AH). 2) Haqa'iq al-Tafsir, by Muhammad bin al-Husayn al-Sulami, died in the year (412 AH). 3) Al-Bahr al-Madid, by Ahmad bin Muhammad Ibn Ajiba, died in the year (1224 AH). Among the sciences upon which the interpretation of the Quran is based: What is known as Sciences of the Quran (Ulum al-Quran): It refers to the group of sciences whose topics relate specifically to the Holy Quran, whether concerning its revelation, arrangement, collection, writing or drawing, recitation, parsing (I'rab), interpretation, miraculous nature (I'jaz), abrogating and abrogated verses, Meccan and Medinan verses, or refuting doubts about it, etc. The fruit of studying the science of Tafsir and its benefits: Studying the science of Tafsir has many fruits and benefits, including: 1) Filling people's need to understand the Quran, live with it, and achieve happiness through it. 2) Understanding the divine legal discourse, and knowing the rulings, the lawful, and the prohibited. 3) It helps the servant to contemplate the Book of Allah. Ibn Jarir al-Tabari said: I wonder at one who recites the Quran and does not know its interpretation, how he finds pleasure in reading it (1). 4) Understanding the origin and development of the science of Tafsir, and the efforts of the Companions, Followers, and scholars after them in serving the interpretation of the Holy Quran, what distinguished each effort, and how to benefit from it in broadening the comprehension of the meanings of the Holy Quran and standing upon its great secrets.",
    "foot_note": "1. See: Mu'jam Al-Udaba (6/ 2453).",
    "book_id": "60"
  },
  {
    "serial_number": "7523721",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 63,
    "volume_number": 1,
    "text": "5) Knowing the sound methodology and correct ways to interpret the Holy Quran, in a way that observes the rules and regulations of the predecessors, and keeps pace with the spirit of our age and its requirements. 6) Knowing the doctrinal, jurisprudential, theological, and linguistic trends of the commentators, and how these diverse trends enriched the library of Tafsir in its different eras. 7) Standing upon the greatness of the Book of Allah which received this immense amount of care and attention, which earns the servant veneration for the Book of Allah, and fear of the One who revealed it and spoke it, Glory be to Him. Terminology of the Science of Tafsir: The Quran: Is the miraculous Arabic phrasing, revealed to Muhammad, peace and blessings be upon him, through Gabriel, peace be upon him, which is transmitted by recurrence (Tawatur), written in the Mushaf, worshipped by its recitation, beginning with Surah Al-Fatiha, and ending with Surah An-Nas. The Science of Tafsir: Is a science by which the understanding of the Book of Allah Almighty revealed to Muhammad, peace and blessings be upon him, is known, and the clarification of its meanings and extraction of its rulings and wisdoms. Sciences of the Quran: Are topics related to the Holy Quran in terms of its revelation, arrangement, collection, writing, readings, decisive and ambiguous verses, abrogating and abrogated verses, miraculous nature, styles, and refuting doubts about it... etc. Meccan Quran: Is everything revealed of the Quran before the Prophetic Migration (Hijra), even if its revelation was outside Mecca. Medinan Quran: Is everything revealed after the Prophetic Migration, even if its revelation was in Mecca.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523722",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 64,
    "volume_number": 1,
    "text": "Reason for Revelation (Sabab al-Nuzul): Is the incident or question following which the verse or Surah was revealed as an explanation for it. It is either an incident that occurs so the Quran is revealed because of it, or a question addressed to the Prophet, peace and blessings be upon him, so the Quran is revealed clarifying the ruling on it. Isra'iliyyat: Are the news narrated from the People of the Book, Jews or Christians. They were called (Isra'iliyyat) by predominance, because most of them are from the news of the Children of Israel or from their books. Decisive Verses (Ayat Muhkamat): Are the verses with clear meaning that do not bear more than one facet of interpretation. Ambiguous Verses (Ayat Mutashabihat): Are the verses that bear more than one facet of interpretation. Readings (Qira'at): Plural of Qira'ah, which is a school of thought adopted by one of the Imams of the Reciters, differing from others in pronunciation of the Holy Quran, with agreement of narrations and paths from him. Abrogation (Naskh): Is the lifting of a legal ruling by another legal evidence that comes after it. Abrogated Verses (Ayat Mansukha): Are of three types: 1) Verses whose recitation and ruling were abrogated. Example: Abrogation of prohibition of breastfeeding from ten sucklings to five. On the authority of Aisha, may Allah be pleased with her, she said: Among what was revealed of the Quran was: Ten known sucklings prohibit [marriage], then they were abrogated by five known ones. The Messenger of Allah, peace and blessings be upon him, passed away, and they were among what is recited of the Quran (1). 2) Verses whose ruling was abrogated but their recitation remained, and this is the most common type of abrogation.",
    "foot_note": "1. Narrated by Muslim in his Sahih (2/ 1075) No. (1452).",
    "book_id": "60"
  },
  {
    "serial_number": "7523723",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 65,
    "volume_number": 1,
    "text": "Example: Abrogation of the waiting period for the widow from a full year to four months and ten days. Allah Almighty said: {And those who are taken in death among you and leave wives behind - for their wives is a bequest: maintenance for one year without turning [them] out} ... [Al-Baqarah: 240]. Then that was abrogated by His saying: {And those who are taken in death among you and leave wives behind - they, [the wives, shall] wait four months and ten [days]} [Al-Baqarah: 234]. 3) Verses whose recitation was abrogated but their ruling remained. Example: The verse of Stoning The old man and the old woman, if they commit adultery, stone them absolutely, its recitation was abrogated but its ruling remained. Umar bin Al-Khattab, may Allah be pleased with him, said: Indeed, Allah sent Muhammad, peace and blessings be upon him, with the truth, and revealed the Book to him. Among what was revealed to him was the verse of Stoning. We read it and understood it. The Messenger of Allah, peace and blessings be upon him, stoned, and we stoned after him. I feared that if time passed long for people, someone might say: We do not find the verse of Stoning in the Book of Allah, so they would go astray by abandoning a duty revealed by Allah Almighty. Stoning is a right upon whoever commits adultery among men and women if he is married (Muhsan), if evidence is established, or there is pregnancy, or confession. By Allah, were it not that people would say: Umar added to the Book of Allah Almighty, I would have written it: The old man and the old woman, if they commit adultery, stone them absolutely (1). These are the most important and prominent terms related to Tafsir.",
    "foot_note": "1. Narrated by Al-Bukhari (8/ 168) No. (6829), Muslim (3/ 1317) No. (1691), and Abu Dawood (4/ 144) No. (4418), and the wording is his.",
    "book_id": "60"
  },
  {
    "serial_number": "7523724",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 66,
    "volume_number": 1,
    "text": "Second: Hadith and its Sciences: The science of Hadith is among the most noble and majestic sciences, after the knowledge of the Holy Quran which is the origin of religion and the source of the straight path. Hadith is the second source of Islamic legislation; some of it legislates independently, and much of it explains the Book of Allah Almighty and clarifies it. Allah Almighty said: {And We revealed to you the message that you may make clear to the people what was sent down to them} [An-Nahl: 44]. Al-Hafiz Al-Iraqi said: The science of Hadith is of serious impact, great benefit; upon it revolves most rulings, and by it the lawful and prohibited are known. Its people have terminology that the student must understand (1). Definition of Hadith: Hadith linguistically: The new (Al-Jadid), opposite of old (Al-Qadim). From it is his saying, peace and blessings be upon him, regarding rain: It has recently been with its Lord (Hadithu Ahdin bi-Rabbihi) (2) i.e., new. It also refers to news (Al-Khabar). Al-Firuzabadi said: Al-Hadith: The new, and the news. From it is His saying Almighty: {Has there come to you the story (Hadith) of Moses?} [Taha: 9] i.e., news of Moses. Technically: What is attributed to the Prophet, peace and blessings be upon him, of saying, action, approval, or physical or moral description.",
    "foot_note": "1. Sharh Al-Tabsirah (1/ 97). \n2. Narrated by Muslim in his Sahih (2/ 615) No. (898).",
    "book_id": "60"
  },
  {
    "serial_number": "7523725",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 67,
    "volume_number": 1,
    "text": "Divisions of the Science of Hadith: Generally, the science of Hadith is divided into two sections: 1 - The Science of Hadith Narration (Riwayah): It is a science that investigates how Hadiths are connected to the Prophet, peace and blessings be upon him, in terms of the conditions of their narrators regarding precision and integrity, and in terms of the nature of the chain (Sanad) regarding connection, disconnection, etc. 2 - The Science of Hadith Understanding (Dirayah): It is a science related to the jurisprudence of Hadith and what pertains to it regarding knowing the abrogating and abrogated, and the specific and general. It can be divided in detail into: 1) Science of Terminology (Mustalah): A science by which the condition of the narrator and the narrated is known in terms of acceptance and rejection. 2) Science of Extraction (Takhrij): A science specialized in indicating the location of the Hadith in its original sources from the books of Sunnah and presenting it to people with a statement of the Hadith's rank when needed. 3) Science of Men (Rijal/Jarh wa Ta'dil): It is the science of the conditions of Hadith narrators in terms of acceptance and rejection. 4) Science of Hidden Defects (Ilal): It is the science that critiques the Hadiths of trustworthy narrators in which an illusion or hidden error occurred, and it is one of the most precise and difficult sciences. Fruit of studying the science of Hadith and its benefits: 1) Knowing the status of the Sunnah, which is the second source of legislation, and it explains the Quran; and details its generalities.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523726",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 68,
    "volume_number": 1,
    "text": "2) Preserving the Islamic religion from distortion and alteration. The Ummah transmitted the Prophetic Hadith with chains of transmission (Asanid), and distinguished by it the authentic from the sick. Were it not for this science, the authentic Hadith would have been confused with the weak and fabricated, the speech of the Messenger would have mixed with the speech of others, and the sciences of Sharia and rulings of religion would have been lost. 3) Knowing the methods of scholars and Muhaddithin in establishing Hadith and purifying it from intruders, through the disciplined scales and majestic rules they established that combine sound methodology and scientific integrity. 4) That the rules of this science protect the scholar from the danger of the great threat that befalls those who are lenient in narrating Hadith, due to his saying, peace and blessings be upon him, in the widespread Hadith from him: Whoever narrates from me a Hadith which he sees is a lie, then he is one of the liars (1), and his saying, peace and blessings be upon him, in the Mutawatir Hadith: Whoever lies about me intentionally, let him take his seat in the Fire (2). 5) That this science earns its possessors a great benefit in clearing minds and precise observation in knowing the authentic Hadith from the sick, and distinguishing what is valid from what is not. 6) This science opens the way for researchers to investigate the meanings of texts (Mutun) and realize their contents, then feel reassured in using them as evidence in all different sciences. 7) Knowing the conditions of Hadith narrators and their classes. 8) Knowing the method of extracting (Takhrij) Hadiths and verifying their chains.",
    "foot_note": "1. Narrated by Muslim in the Introduction to his Sahih (1/ 8). \n2. Narrated by Al-Bukhari in his Sahih (2/ 80) No. (1291), and Muslim in his Sahih (1/ 10) No. (4).",
    "book_id": "60"
  },
  {
    "serial_number": "7523727",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 69,
    "volume_number": 1,
    "text": "9) The science of Hadith extends its influence to other Islamic sciences. Terminology of the Science of Hadith: Mutawatir (Mass Transmitted): What is narrated by a large number from a large number such that custom or reason deems it impossible for them to collude on a lie. Ahad (Solitary): What lacks a condition of the conditions of Mutawatir. Hadith Qudsi (Divine Hadith): What the Prophet, peace and blessings be upon him, narrates from his Lord Almighty in wording or meaning, other than the Quran. Marfu' (Elevated) Hadith: What is attributed to the Prophet, peace and blessings be upon him, of saying, action, approval, or description. Mawquf (Stopped) Hadith: What is attributed to the Companion of saying, action, or approval, whether connected or disconnected. Maqtu' (Severed) Hadith: What is attributed to the Followers (Tabi'in) and those below them, stopped at them, of their sayings and actions. Sahih Li-dhatihi (Authentic by itself): What has a connected chain by the transmission of a just, perfectly precise narrator from his like until its end, without anomaly (Shudhudh) or defect (Illah). Sahih Li-ghayrihi (Authentic due to others): It is the Hasan Li-dhatihi Hadith if it is narrated from another path similar to it or stronger than it. Hasan Li-dhatihi (Good by itself): It is the Hadith whose chain is connected by the transmission of a just narrator whose precision is light, without anomaly or defect.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523728",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 70,
    "volume_number": 1,
    "text": "Hasan Li-ghayrihi (Good due to others): It is the Weak Hadith if its paths are multiple and it can be strengthened by another. Da'if (Weak) Hadith: It is the Hadith that lacks a condition of the conditions of the Accepted Hadith, and falls short of the rank of Hasan. Mawdu' (Fabricated) Hadith: It is the falsely invented report attributed to the Messenger of Allah, peace and blessings be upon him, falsely. Matruk (Abandoned) Hadith: It is the Hadith in whose chain is a narrator accused of lying, and the Hadith is not known except through him. Shadh (Anomalous) Hadith: What a trustworthy narrator narrates contradicting one who is more trustworthy than him. Munkar (Denounced) Hadith: What a weak narrator narrates contradicting a trustworthy one. Mudraj (Interpolated) Hadith: What is changed in the context of its chain or inserted into its text what is not part of it. Mudtarib (Disordered) Hadith: It is the Hadith narrated in different ways that cannot be reconciled, and it is not possible to combine them. Musahhaf (Distorted) Hadith: It is changing a word in the Hadith from its correct form to another. Muttasil (Connected) Hadith: It is that from whose chain none of its narrators has fallen, whether elevated (Marfu') or stopped (Mawquf). Munqati' (Broken): It is what has fallen from its chain before the Companion, one narrator or more, not consecutively.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523729",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 71,
    "volume_number": 1,
    "text": "Mu'allaq (Suspended) Hadith: What has one or more narrators deleted from the beginning of its chain consecutively, or the entire chain is deleted, or the entire chain is deleted except the Companion. Mu'dal (Perplexing/Double Broken): It is what has two or more narrators fallen from its chain consecutively. Mursal (Hurried): What the Follower (Tabi'i), whether minor or major, elevates to the Prophet, peace and blessings be upon him, by saying: The Messenger of Allah, peace and blessings be upon him, said. Or it is: What has fallen from the end of its chain after the Follower. Mudallas (Obfuscated): It is of two types: First: Tadlis of the Chain: It is for the narrator to narrate from someone he met what he did not hear from him, creating the illusion that he heard it from him. Second: Tadlis of the Sheikhs: It is for the narrator to narrate a Hadith from a Sheikh he heard from, so he names him, or gives him a Kunya, or attributes him, or describes him with what he is not known by; so that he is not recognized due to his weakness or youth or the like. Mursal Khafi (Hidden Mursal): It is the Hadith that a narrator narrates from someone he was contemporary with but did not meet. These are the most prominent terms related to the science of Hadith. ",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523730",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 72,
    "volume_number": 1,
    "text": "Third: The Science of Aqidah (Creed): The science of Aqidah is the science that researches Islamic belief and clarifies what opposes and contradicts it. It is derived from the two revelations: the Book and the Sunnah, and clarifies the approach of the Imams of the Ummah from the Companions and Followers, may Allah be pleased with them, in their dealing with issues of belief. The science of Aqidah is the root of sciences; because a person's safety in his religion depends on the soundness of his creed. Islamic Aqidah, when used generally, is the creed of Ahl al-Sunnah wal-Jama'ah; because it is the Islam that Allah was pleased with as a religion for His servants, and it is the creed of the three favored generations of the Companions, the Followers, and those who followed them in goodness until the Day of Judgment. Everything that contradicts the creed of Ahl al-Sunnah wal-Jama'ah is from false beliefs, and its holder has deviated from the correct belief to deviant heretical beliefs. The intended meaning of Ahl al-Sunnah wal-Jama'ah: Everyone who followed the Sunnah of the Prophet, peace and blessings be upon him, and held fast to it in word, deed, and belief. Definition of Aqidah: Aqidah linguistically: Taken from Al-'Aqd (tying), which is tightening, binding, firmness, and consolidation. It is said: He tied ('Aqada) the rope, tying it ('Ya'qiduhu'): he tightened it. And 'Al-'Aqd' is the opposite of dissolving. Aqidah is applied to firm faith that is not infiltrated by doubt. It is what a person believes in and ties his heart to. If what he believes is a correct, firm belief in the Lordship of Allah Almighty, His Divinity, His Names and Attributes, His Angels, His Books, His Messengers, the Last Day, Destiny - its good and its evil, and all that is proven of the matters of the Unseen,",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523731",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 73,
    "volume_number": 1,
    "text": "and the fundamentals of religion, and what the Righteous Predecessors (Salaf) agreed upon, and complete submission to Allah Almighty in command, judgment, and obedience, and following His Messenger, then this is the correct Salafi Creed. And if what he believes is contrary to that, it is a corrupt creed. Divisions of Aqidah: The division of Aqidah is taken from the six pillars of Faith (Iman), which are: 1) Belief in Allah: It includes: (Belief in His existence, His Lordship, His Divinity, and His Names and Attributes). 2) Belief in the Angels: It includes: (Belief in their existence, belief in those whose names we know among them, belief in what we know of their attributes, and belief in what we know of their actions). 3) Belief in the Revealed Books: It includes: (Belief that their revelation is truly from Allah, belief in those whose names we know among them such as the Quran, the Torah, the Gospel, and the Psalms, along with confirming what is authentic of their news, and acting upon the rulings of what has not been abrogated among them). 4) Belief in the Messengers: It includes: (Belief that their message is truth from Allah, belief in those whose names we know among them by name, along with confirming what is authentic from them of their news, and acting upon the law of the one sent to us among them, who is their seal, Muhammad, peace and blessings be upon him.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523732",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 74,
    "volume_number": 1,
    "text": "5) Belief in the Last Day: It includes: (Belief in the punishment of the grave and its bliss, belief in Resurrection, belief in Gathering and Reckoning, belief in Paradise and Fire, and other matters of the Hereafter). 6) Belief in Destiny (Qadar), its good and its evil: It includes: (Belief that Allah Almighty knows everything generally and in detail, belief that Allah wrote that in the Preserved Tablet, that all beings only exist by the will of Allah Almighty, and belief that all beings are created by Allah Almighty). - Included in the study of Aqidah is the explanation of the doctrines of the sects that opposed the belief of Ahl al-Sunnah wal-Jama'ah in these six principles. Fruit of studying the science of Aqidah and its benefit: 1. Knowing the correct creed which is the root of religion, and the foundation of the call of the Messengers. A servant's faith is not complete nor accepted by Allah Almighty except with it. For this reason, Allah Almighty says: {And whoever denies the faith - his work has become worthless, and he, in the Hereafter, will be among the losers} [Al-Ma'idah: 5]. 2. Knowing that correct creed is a condition for the validity of deeds and their acceptance. 3. Knowing the greatest and most confirmed duties is the Tawhid (Monotheism) of Allah Almighty, and distancing from what contradicts it of associating partners with Allah (Shirk) and the like. 4. Correct creed is the reason for obtaining establishment on earth, and uniting the ranks of Muslims, and upon it their word unites. 5. Through it, security and stability, and happiness in this world and the Hereafter are achieved.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523733",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 75,
    "volume_number": 1,
    "text": "6. Knowing the doctrines of deviant sects and warning against them. 7. Immunity against deviant heretical sects. 8. Studying correct creed increases a person in fear of Allah, and distance from sins and mortal crimes. 9. Islamic civilization is only established on correct creed; because every structure, whether material or moral, must have an ideological foundation upon which it stands. Terminology in the Science of Aqidah: Religion (Din): It is the religion of Islam and the creed of Tawhid which is the religion of all Messengers from Adam and Noah to the Seal of Prophets, Muhammad, peace and blessings be upon him. Faith (Iman): Affirmation with the heart, speech with the tongue, and action with the limbs; it increases with obedience and decreases with disobedience. Islamic Aqidah: It is firm belief in Allah Almighty and what is due to Him of Tawhid and obedience, and in His angels, Books, Messengers, the Last Day, and Destiny, and all that is proven of matters of the Unseen, reports, and principles, whether scientific (theoretical) or practical. Tawhid: Singling out Allah Almighty with what is specific to Him of Lordship, Divinity, and Names and Attributes. Fundamentals of Religion (Usul al-Din): Are the foundations upon which the Islamic religion stands and is built, and are considered a root for it, which the predecessors of this nation agreed upon.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523734",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 76,
    "volume_number": 1,
    "text": "Sunnah: Used by the Salaf for what opposes Bid'ah (Innovation). So whoever follows the Sunnah of the Prophet, peace and blessings be upon him, and the Sunnah of the Companions and Followers and those after them, and follows their methodology, is said to be: from Ahl al-Sunnah. And whoever leaves their methodology and follows the people of desires is said to be: from the innovators (Mubtadi'ah). Sheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him, says: The term 'Sunnah' in the speech of the Salaf includes Sunnah in acts of worship and in beliefs, although many who wrote on Sunnah intended discussion of beliefs. Al-Fiqh Al-Akbar (The Greater Understanding): A name for Aqidah given to it by some. The first to use the term (Al-Fiqh Al-Akbar) was Imam Abu Hanifa Al-Nu'man bin Thabit. This naming does not mean neglecting other jurisprudence (issues of rulings and Halal and Haram), but rather means caring for Aqidah and starting by correcting it before performing actions, and knowing its detailed evidences. Ahl al-Sunnah wal-Jama'ah: They are those who follow what the Prophet, peace and blessings be upon him, and his companions were upon. They were named Ahl al-Sunnah: because of their adherence to and following of the Sunnah of the Prophet, peace and blessings be upon him. They were named Al-Jama'ah: because they are the ones who gathered on the truth and did not separate in religion, and gathered around the Imams of truth and did not rebel against them, and followed what the predecessors of the nation agreed upon. Ahl al-Hadith: They are those attributed to the Hadith of the Messenger of Allah, peace and blessings be upon him, due to their following of it. They are everyone who made the speech of the Messenger of Allah, peace and blessings be upon him, a source of reception from which they derive the beliefs of Islam, whether they are scholars of Hadith, Fiqh, Usul al-Fiqh, or otherwise.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523735",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 77,
    "volume_number": 1,
    "text": "Sheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him, says: We do not mean by Ahl al-Hadith those restricted to hearing it, writing it, or narrating it. Rather we mean by them: everyone who was most deserving of memorizing it, knowing it, and understanding it outwardly and inwardly, and following it inwardly and outwardly, as well as the people of the Quran (1). Al-Salaf (The Predecessors): They are the forefront of this nation from the Companions and Followers, and the Imams of guidance in the three favored centuries. It applies to everyone who followed them and walked on their path in all ages. Al-Khalaf (The Successors): They are those who came after the three favored centuries, from Muslim scholars and their common folk. Al-Bid'ah (Innovation): An invented way in religion that resembles the Sharia, by following which the intention is the same as what is intended by the Sharia way (2). ",
    "foot_note": "1. Majmu' Al-Fatawa (4/ 95). \n2. Defined as such by Al-Shatibi in his book Al-I'tisam (1/ 51).",
    "book_id": "60"
  },
  {
    "serial_number": "7523736",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 78,
    "volume_number": 1,
    "text": "Fourth: Fiqh (Jurisprudence): The science of Fiqh is one of the most majestic Sharia sciences, for by it a person knows the rulings of Obligatory (Wajib), Recommended (Mandub), Permissible (Mubah), Disliked (Makruh), and Forbidden (Haram). Thus, the Muslim builds his worship and dealing with people according to the commands of Allah Almighty, and the commands of His Messenger, peace and blessings be upon him; thereby attaining success in both abodes. Ibn Nujaym said in Al-Ashbah wa Al-Naza'ir: For Fiqh is the most noble of sciences in value, the greatest in reward, the most complete in return, the most general in benefit, the highest in rank, and the most brilliant in virtue. It fills the eyes with light, the hearts with joy, the chests with relief, and provides matters with breadth and openness (1). Definition of Fiqh: Fiqh in language: is understanding. It is said: So-and-so 'faqiha' my saying, i.e., understood it. From it is the saying of Allah Almighty: {And there is not a thing except that it exalts [Allah] by His praise, but you do not understand [la tafqahuna] their [way of] exalting} [Al-Isra: 44], i.e., you do not understand it. And the saying of the Prophet, peace and blessings be upon him: Whomever Allah wills good for, He gives him understanding (yufaqqih-hu) in the religion (2). And Fiqh in terminology: is the knowledge of practical Sharia rulings [derived] from their detailed evidences. Divisions of Fiqh: Scholars divided Fiqh into two main sections:",
    "foot_note": "1. Al-Ashbah wa Al-Naza'ir p. (13). \n2. Narrated by Al-Bukhari (1/ 25) No. (71), and Muslim (2/ 719) No. (1037).",
    "book_id": "60"
  },
  {
    "serial_number": "7523737",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 79,
    "volume_number": 1,
    "text": "Section One: Fiqh of Worship (Ibadat): It includes the practical rulings for the actions of the accountable person related to organizing the human's relationship with his Lord, such as: Purification, Prayer, Zakat, Fasting, Hajj, Vows, and others. Section Two: Fiqh of Transactions (Mu'amalat): It includes the rulings that organize people's relationships with one another, whether they are individuals or groups. These rulings branch into the following: First: Civil Rulings: Intended to organize individuals' financial relationships and preserve rights. It relates to individuals' transactions and exchanges such as sale, lease, pledge, guarantee, partnership, debt, fulfillment of obligations, and otherwise. Second: Family Rulings: Which has been named recently as (Personal Status): Intended to organize the relationship of spouses and relatives with one another. It relates to the Fiqh of marriage, divorce, alimony, custody, inheritance, endowments (Waqf), and the like. Third: Financial and Criminal Rulings: Intended to preserve people's lives, wealth, honor, and rights. It includes Hudud (prescribed punishments) and crimes, and relates to crimes committed by the accountable person and the punishments deserved for them. Fourth: Judicial Rulings: Such as issues of pleading or civil procedures intended to organize procedures to establish justice among people. It relates to judiciary, lawsuits, methods of proof by testimony and oath, presumptions, and others. Fifth: Rulings of Sharia Policy: It includes three types:",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523738",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 80,
    "volume_number": 1,
    "text": "1 - Constitutional Rulings: Intended to define the relationship of the ruler with the ruled, and establish what rights individuals and groups have, and what duties are upon them. It relates to the system of governance and its principles. 2 - International Rulings: Intended to define the type of relationship, cooperation, and mutual respect between states. It relates to organizing the relationship of the Islamic state with other states in peace and war, and the relationship of non-Muslim citizens in the state, including Jihad and treaties. 3 - Economic Rulings: Intended to organize financial relationships between the rich and poor, and between the state and individuals. It relates to individuals' financial rights and obligations in the financial system, and the state's financial rights and duties, and organizing treasury resources and expenditures. Fruit of studying the science of Fiqh and its benefits: 1 - Attaining the pleasure of Allah Almighty and His success, and obtaining the goodness in the Hadith: Whomever Allah wills good for, He gives him understanding in the religion (1). 2 - Organizing the life of individuals and groups: Knowing the jurisprudential rulings related to people's actions helps the Muslim adhere to those rulings, of Halal and Haram, and regulates the lives of individuals and groups with a rational Sharia methodology, far from being influenced by whims and desires.",
    "foot_note": "1. Narrated by Al-Bukhari in Sahih (1/ 25) No. (71), and Muslim in his Sahih (2/ 719) No. (1037).",
    "book_id": "60"
  },
  {
    "serial_number": "7523739",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 81,
    "volume_number": 1,
    "text": "3 - Solving human problems: Studying jurisprudential rulings provides the Muslim with legal solutions to social and economic problems that societies suffer from, such as poverty, unemployment, and others. 4 - Addressing emerging issues: Islamic jurisprudence, with its inherent methods for deriving Sharia rulings, helps the student know the Sharia rulings for life issues that arise in society, such as the ruling on insurance, IVF, and others. 5 - Confirming the suitability of Islam for every time and place: Islamic jurisprudence, with its ability to address emerging issues, generates in the Muslim a complete conviction of Islam's suitability for application in every time and place, and its ability to accommodate the developments of the age and the data of science. Terminology of the Science of Fiqh: The Madhhab (School of Thought): It is: What an Imam among the Imams goes to in issues of Ijtihad based on rules and principles he sees. The Madhhab: Is the jurisprudential path followed by each Imam among the Imams of Ijtihad in deriving rulings, in terms of their reliance on texts or opinion. The Four Madhhabs: Known jurisprudential schools that spread in the second century and beyond. They are the school of Imam Abu Hanifa Al-Nu'man, the school of Imam Malik bin Anas, the school of Imam Al-Shafi'i, and the school of Imam Ahmad bin Hanbal.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523740",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 82,
    "volume_number": 1,
    "text": "Following is a brief overview of each one of them: - Imam Abu Hanifa, he is: Al-Nu'man bin Thabit Al-Kufi Al-Taymi, the Jurist. Born in Kufa in the year (80 AH), his origin is from Persia. The Hanafi school is attributed to him, though correctly it is not his compilation. He died in Iraq in the year (150 AH). - Imam Malik, he is: Malik bin Anas bin Malik bin Abi Amir Al-Asbahi, Al-Himyari Al-Madani Abu Abdullah, the Imam of the Abode of Migration. Born in the Prophetic Medina in the year (93 AH). The Maliki school is attributed to him. Among his works: Al-Muwatta. He died in Medina in the year (179 AH). - Imam Al-Shafi'i, he is: Muhammad bin Idris bin Al-Abbas bin Uthman Al-Shafi'i Al-Muttalibi Al-Qurashi Abu Abdullah. Born in Gaza in the year (150 AH). The Shafi'i school is attributed to him. Among his works are (Al-Risalah), and (Kitab Al-Umm). He died in Egypt in the year (204 AH). - Imam Ahmad: Ahmad bin Muhammad bin Hanbal Abu Abdullah Al-Shaybani Al-Wa'ili, the Muhaddith, Imam of Ahl al-Sunnah. The Hanbali school is attributed to him. Born in Baghdad in the year (164 AH). Among his works are (Al-Musnad), and (The Refutation of the Jahmiyyah and Heretics). He died in Egypt [Note: Error in source, he died in Baghdad] in the year (241 AH) [Note: Error in source text says 204]. Al-Zahiriyyah: A known jurisprudential school, named so due to taking the apparent meaning (Zahir) of texts and not considering causation and analogy. The founder of this school is Dawud bin Ali Al-Zahiri, and Ibn Hazm Al-Andalusi came after him and established foundations for this school and set its rules.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523741",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 83,
    "volume_number": 1,
    "text": "Fard (Obligation): What the Sharia demanded to be done with a decisive demand, such that reward results from doing it, just as punishment results from leaving it. Fard 'Ayni (Individual Obligation): What is demanded to be done by every single individual among the accountable persons with a decisive demand. Fard Kifa'i (Communal Obligation): What is demanded to be done by the collective of accountable persons, not by every single one of them specifically. Meaning: If enough accountable persons perform it, the sin falls from the rest of the accountable persons, and if no one performs it, they all sin, and are disobedient to Allah, Lord of the Worlds. Rukn (Pillar): It is that without which a thing is not complete, and it is part of it and included in its reality. Mandub (Recommended): What the Sharia demanded with a non-decisive demand, i.e., reward results from doing it, and no punishment results from leaving it. Mubah (Permissible): That whose doing and leaving are equal; because the Lawgiver did not command us to leave it, nor did He command us to do it; rather He gave us the freedom of leaving and doing and made them equal in degree. Therefore, neither reward nor punishment results from doing the Mubah or leaving it. Haram (Forbidden): What the Sharia demanded us to leave with a decisive leaving, such that reward results from leaving it in compliance with Allah's command, and punishment results from doing it. Makruh (Disliked): What the Lawgiver demanded to be left with a non-decisive demand, such that if we leave it in compliance with Allah Almighty's command we are rewarded for it, and if we do it we are not punished. Ada' (Performance): Doing the act of worship in the time limited for it by the Sharia. Qada' (Making Up): Doing the act of worship that became obligatory outside the time defined for it by the Sharia. I'adah (Repetition): Doing the act of worship in its time a second time for increased virtue.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523742",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 84,
    "volume_number": 1,
    "text": "Fifth: Principles of Jurisprudence (Usul al-Fiqh): The science of Usul al-Fiqh: is among the most majestic sciences in value and greatest in importance, as it is the science considered by scholars as a basis for establishing proofs, refining issues, and deriving Sharia rulings. Its status in Sharia sciences is great as understanding rulings and knowing their causes relates to it. Definition of Usul al-Fiqh: Usul: Plural of Asl (Root/Origin). Asl in language: What something else is built upon. Usul al-Fiqh technically: Is the science that investigates general jurisprudential evidences, how to benefit from them, and the condition of the beneficiary. Divisions of Usul al-Fiqh: The topics of Usul al-Fiqh are divided into four main sections: 1. Explanation of Rulings: Such as prohibition, dislike, obligation, recommendation, permissibility, condition, impediment, and cause. And validity and invalidity, etc. 2. Study of Evidences: Such as the Book, the Sunnah, Consensus (Ijma'), Analogy (Qiyas), Juristic Preference (Istihsan), Presumption of Continuity (Istishab), Statement of a Companion, Blocking the Means (Sadd al-Dhara'i), and Public Interest (Maslahah Mursalah). 3. Modes of Indication of Evidences: Specific and General, Ambiguous and Clarified, Absolute and Restricted, Command and Prohibition, Abrogating and Abrogated, and the like. 4. Condition of the Deductor and the One Deducted For: These are the conditions of the Mujtahid and conditions of Ijtihad, rulings of following and followers, and rulings of imitation (Taqlid) and imitators.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523743",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 85,
    "volume_number": 1,
    "text": "Fruit of studying the science of Usul al-Fiqh and its benefits: 1) It gives the learner strength in deriving Sharia rulings from subsidiary evidences. 2) Facilitating the process of Ijtihad and giving new occurrences their appropriate rulings. 3) Knowing the controls of Fatwa, and the conditions and etiquette of the Mufti. 4) Protecting Islamic jurisprudence from openness resulting from establishing new sources of legislation, and from rigidity resulting from the claim of closing the door of Ijtihad. 5) Controlling the rules of dialogue and debate, by referring to authentic considered evidences. 6) Recognizing the tolerance and ease of Islamic Sharia, and viewing the beauties of this religion. 7) Clarifying methods of reconciling evidences that seemingly contradict, and refuting the doubts of detractors regarding that. 8) Preserving Islamic Sharia, because the science of Usul al-Fiqh safeguards the evidences of legislation so people do not transgress them, just as it preserves for rulings their arguments and documents, and clarifies the original and subsidiary sources of legislation so that the Sharia retains its rules. 9) Preventing the interpretation of texts of the Book and Sunnah according to opinion or desire. The science of Usul al-Fiqh controls the interpretation of texts, and governs it with comprehensive universal controls and rules agreed upon that refute every transgressor.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523744",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 86,
    "volume_number": 1,
    "text": "10) In it is salvation and protection from division and difference, which arises from incorrect understanding of the Quran and Sunnah. Through it, the school of Hadith and Athar and the school of Ahl al-Ra'y (People of Opinion) were united. 11) Acquiring the jurisprudential faculty (Malakah) that enables the student of knowledge or jurist to understand correctly, fully and comprehensively perceive jurisprudential rulings, view methods of deduction and Ijtihad to benefit from them, and use analogy based on them if needed. 12) Removing sectarian fanaticism among jurists, where the student of knowledge can, through studying Usul al-Fiqh, balance between schools and jurisprudential opinions, and know the most likely, correct, and most worthy of acceptance, based on evidence and fundamental rules. Terminology of the Science of Usul al-Fiqh: Ijtihad: Is expending effort in extracting rulings from their evidences indicating them by looking into that which leads to them. Ijma' (Consensus): Is the agreement of the Mujtahids of the Ummah after the death of the Prophet, peace and blessings be upon him, in any era, on a Sharia ruling. Qiyas (Analogy): Referring a branch to an origin in a specific ruling, due to a common cause between them. Shar' man qablana (Laws of those before us): Are the rulings transmitted to us in the Quran or established Sunnah that were laws for previous nations, like the People of the Book and others.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523745",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 87,
    "volume_number": 1,
    "text": "Urf (Custom): Is what most people are familiar with, and agree upon in actions, and there is no Sharia evidence negating or affirming it. Sadd al-Dhara'i (Blocking the Means): Cutting off the substance of means to corruption by preventing these means and repelling them. Example: Forbidding Muslims from insulting the gods of polytheists for fear that the polytheists would respond by insulting Allah Almighty. This prohibition came in His saying: {And do not insult those they invoke other than Allah, lest they insult Allah in enmity without knowledge} [Al-An'am: 108]. Al-Maslahah Al-Mursalah (Public Interest): Is every interest for which no specific evidence has come from the Lawgiver indicating its consideration or cancellation, and was consistent with the objectives of the Lawgiver. Example: Compiling the Quran in one Mushaf. The Companions agreed on it and there was no text for it, but the interest of preserving the religion required it. Sabab (Cause): What necessitates existence from its existence, and non-existence from its non-existence essentially. It is what something else is linked to in existence and non-existence; so existence of the effect follows from existence of the cause, and non-existence of the effect follows from non-existence of the cause, due to the cause itself. Example: Marriage is a cause for inheritance. Existence of inheritance between spouses follows from existence of marriage, and non-existence of inheritance follows from non-existence of marriage, due to the cause itself; because marriage might exist but the effect (inheritance) fails due to the presence of an impediment, like difference of religion. Shart (Condition): What necessitates non-existence from its non-existence, but existence nor non-existence does not necessitate from its existence essentially. It is what something else is linked to in non-existence not existence. If the condition is absent the ruling is absent, but if the condition is present the ruling might exist or might not.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523746",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 88,
    "volume_number": 1,
    "text": "Example: Purification is a condition; invalidity of prayer follows from its absence, but validity of prayer does not necessarily follow from its presence; because purity might exist (ritual impurity lifted) but another condition fails, preventing the validity of prayer. Mani' (Impediment): What necessitates non-existence from its existence, and neither existence nor non-existence necessitates from its non-existence essentially. It is what something else is linked to in existence not non-existence. If the impediment is found, the ruling is absent, and neither existence nor non-existence of the ruling necessitates from its absence essentially. Example: If menstruation is found, the validity of prayer is non-existent, but the validity of prayer does not necessarily follow from the absence of menstruation; because another impediment might exist. Amr (Command): Is requesting an action by speech from a position of superiority. Our saying: (from a position of superiority) means: that the command came from the higher to the lower. Example: His saying Almighty: {And establish prayer and give zakah and bow with those who bow} ... [Al-Baqarah: 43]. In the verse, Allah commanded His servants to pray and give Zakat. The direction of superiority here: The Highest is Allah Almighty, and the lowest are the servants. Nahy (Prohibition): Is the speech requesting abstention from a position of superiority. Example: His saying Almighty: {O you who have believed, do not approach prayer while you are intoxicated} [An-Nisa: 43]. Aam (General): Is the term encompassing all its individuals without restriction. Khas (Specific): Is the term indicating a restricted number. Example of General and Specific: {And [due] to Allah from the people is a pilgrimage to the House - for whoever is able to find thereto a way} [Al Imran: 97]. His saying: {And [due] to Allah from the people is a pilgrimage to the House} is general including all people,",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523747",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 89,
    "volume_number": 1,
    "text": "and His saying: {for whoever is able to find thereto a way} specified this generality with a description, which is the description of ability. Mutlaq (Absolute/Unrestricted): Is the term indicating the reality/essence without restriction. Example: His saying Almighty regarding expiation for Zihar: {And those who pronounce thihar from their wives and then [wish to] go back on what they said - then [there must be] the freeing of a slave before they touch one another} [Al-Mujadila: 3]. Here, freeing any slave was mentioned in the expiation, whether believing or disbelieving. Muqayyad (Restricted): Is the term indicating the reality/essence with a restriction; such as unity, description, condition, time, place, or others. Example: His saying Almighty regarding expiation for accidental killing: {And whoever kills a believer by mistake - then the freeing of a believing slave} [An-Nisa: 92]. Here, a restriction was mentioned for the slave in the expiation, which is that he must be a believer, not just any slave. Mantuq (Explicit/Spoken Meaning): Is what the wording indicates in the place of utterance. It is the meaning derived from the wording in terms of it being spoken. Mafhum (Implied/Understood Meaning): Is what the wording indicates in other than the place of utterance. It is a meaning understood and derived from the wording. Example of Explicit and Implied: {So do not say to them [parents] \"uff\"} [Al-Isra: 23]. The explicit meaning of the verse is the prohibition of saying \"uff\" to parents, which is uttering \"uff\". The implied meaning of the verse is the prohibition of hitting and cursing. These are the most prominent terms related to the science of Usul al-Fiqh.",
    "foot_note": "None",
    "book_id": "60"
  },
  {
    "serial_number": "7523748",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Introduction to Sharia Sciences",
    "edition": "None",
    "publisher": "Scientific Elites Center",
    "page_number": 90,
    "volume_number": 1,
    "text": "In conclusion, this is what was easy to write in haste, asking Allah the Generous for help, guidance, and success in beneficial knowledge, righteous deeds, and sincerity in speech and action. And may Allah send blessings and peace upon our Prophet Muhammad. Written by Dr. Abdul Rahman bin Abdul Aziz Al-Aql. Al-Qassim - Buraydah. Reviewed on 18/11/1436 AH.",
    "foot_note": "None",
    "book_id": "60"
  }
]