[
  {
    "text": "نخبة الفكر في مصطلح أَهل الأثر\nالمؤلف: أبو الفضل أحمد بن علي بن محمد بن أحمد بن حجر العسقلاني\nسنة الوفاة: 852",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "category_id": "10",
    "category": "علوم الحديث",
    "new_page_number": 1
  },
  {
    "text": "sn: 3452\nbook_title: نخبة الفكر في مصطلح أَهل الأثر\nbook_link: https://shamela.ws/book/616\nbook_id: 616\nauthor_name: أبو الفضل أحمد بن علي بن محمد بن أحمد بن حجر العسقلاني\nauthor_year: 852\nnickname: أبو الفضل\nauthor_link: https://shamela.ws/author/202\nauthor_ID: 202\neditor: د عبد المحسن بن محمد القاسم\npublisher: Null\nedition: الثانية، 1441 هـ - 2020 م\npages: 81\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: علوم الحديث\ncategory_id: 10",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "category_id": "10",
    "category": "علوم الحديث",
    "new_page_number": 2
  },
  {
    "serial_number": "3382294",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: علوم الحديث الكتاب : نخبة الفكر في مصطلح أَهل الأثر المؤلف : أحمد بن علي ابن حجر العسقلاني ( ت 852 هـ ) المحقق : د عبد المحسن بن محمد القاسم محقق على نسخ مقروءة على المصنف وعليها خطه وإجازته الطبعة : الثانية ، 1441 هـ - 2020 م عدد الصفحات : 81 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 17 جُمادَى الآخرة 1443\nالكتاب : نخبة الفكر في مصطلح أَهل الأثر المؤلف : أحمد بن علي ابن حجر العسقلاني ( ت 852 هـ ) المحقق : د عبد المحسن بن محمد القاسم محقق على نسخ مقروءة على المصنف وعليها خطه وإجازته الطبعة : الثانية ، 1441 هـ - 2020 م عدد الصفحات : 81 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 17 جُمادَى الآخرة 1443\nالمؤلف : أحمد بن علي ابن حجر العسقلاني ( ت 852 هـ ) المحقق : د عبد المحسن بن محمد القاسم محقق على نسخ مقروءة على المصنف وعليها خطه وإجازته الطبعة : الثانية ، 1441 هـ - 2020 م عدد الصفحات : 81 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 17 جُمادَى الآخرة 1443\nالمحقق : د عبد المحسن بن محمد القاسم محقق على نسخ مقروءة على المصنف وعليها خطه وإجازته الطبعة : الثانية ، 1441 هـ - 2020 م عدد الصفحات : 81 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 17 جُمادَى الآخرة 1443\nمحقق على نسخ مقروءة على المصنف وعليها خطه وإجازته الطبعة : الثانية ، 1441 هـ - 2020 م عدد الصفحات : 81 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 17 جُمادَى الآخرة 1443\nالطبعة : الثانية ، 1441 هـ - 2020 م عدد الصفحات : 81 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 17 جُمادَى الآخرة 1443\nعدد الصفحات : 81 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 17 جُمادَى الآخرة 1443\n[ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 17 جُمادَى الآخرة 1443\nتاريخ النشر بالشاملة : 17 جُمادَى الآخرة 1443",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 3
  },
  {
    "serial_number": "3382295",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "مُتُونُ طالِبِ العِلِم مُحَقَّقَةٌ عَلى (230) مَخطوُطَة المُتُونُ الإِضَافِيَّةُ (1) نُخْبَةُ الفِكِر فِي مُصطَلح أَهلِ الأَثَرِ مُحَقَّقٌ عَلَى نُسَخٍ مَقرُوءَةٍ عَلَى المُصَنِّفِ وَعَليهَا خَطُّهُ وَإجَازَتُهُ لِلحَافِظِ أَحَمَدَ بْنِ عَليّ ابنِ حَجَرٍ العَسقَلَانيّ رحمه الله (ت 852 هـ) تحقيق د. عَبد المُحْسِن بن مُحَمَّدَ القَاسم إمَامِ وَخَطِيبِ المَسجِدِ النَّبَوي الشَريف",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 4
  },
  {
    "serial_number": "3382296",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "ح عبد المحسن بن محمد القاسم 1440 هـ. فهرسة مكتبة الملك فهد الوطنية أثناء النشر الشافعي، أحمد بن علي ابن حجر نخبة الفكر في مصطلح أهل الأثر./ أحمد بن علي ابن حجر الشافعي؛ ـ ط 2. ـ الرياض 1440 هـ. 80 ص 17 × 24 سم ردمك: 6 - 1003 - 03 - 603 - 978 1 ـ الحديث ـ مصطلح أ. القاسم، عبد المحسن بن محمد (محقق) ب ـ العنوان ديوي 231 … 9752/ 1440 رقم الإيداع: 9752/ 1440 ردمك: 6 - 1003 - 03 - 603 - 978 حقوق الطبع محفوظة الطبعة الثانية 1441 هـ-2020 م",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 5
  },
  {
    "serial_number": "3382297",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "مُتُونُ طالِبِ العِلِم مُحَقَّقَةٌ عَلى (230) مَخطوُطَة المُتُونُ الإِضَافِيَّةُ (1) نُخْبَةُ الفِكِر فِي مُصطَلح أَهلِ الأَثَرِ مُحَقَّقٌ عَلَى نُسَخٍ مَقرُوءَةٍ عَلَى المُصَنِّفِ وَعَليهَا خَطُّهُ وَإجَازَتُهُ لِلحَافِظِ أَحَمَدَ بْنِ عَليّ حَجَرٍ العَسقَلَانيّ رحمه الله (ت 852 هـ) تحقيق د. عَبد المُحْسِن بن مُحَمَّدَ القَاسم إمَامِ وَخَطِيبِ المَسجِدِ النَّبَوي الشَريف",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 6
  },
  {
    "serial_number": "3382298",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "لأهمية المتون لطالب العلم أُنشئ قسم في المسجد النبوي لحفظ هذه المتون، ويضم العديد من الطلاب الصغار والكبار طوال العام، ويمكن الالتحاق به في حلقات التعليم عن بعد على الرابط: www.mottoon.com لتَحْمِيلِ مُتونِ طالبِ العلمِ نُسحةً إلكترُنيَّةً، والاستماعِ إلى شرحِها مباشرةً أو تَحْميلِها على رابط: www.a-alqasim.com",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 7
  },
  {
    "serial_number": "3382299",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرحيم المُقَدِّمَةُ الحَمْدُ لِلَّهِ رَبِّ العَالَمِينَ، وَالصَّلَاةُ وَالسَّلَامُ عَلَى نَبِيِّنَا مُحَمَّدٍ، وَعَلَى آلِهِ وَصَحْبِهِ أَجْمَعِينَ. أَمَّا بَعْدُ: فَإِنَّ شَرَفَ كُلِّ عِلْمٍ بِشَرَفِ مَعْلُومِهِ، وَمَنْزِلَتُهُ تَعْلُو بِقَدْرِ الحَاجَةِ إِلَيْهِ، وَآثَارُ نَفْعِهِ فِي الخَلْقِ تُظْهِرُ فَضْلَهُ عَلَى غَيْرِهِ؛ وَمِنْ أَجَلِّ العُلُومِ قَدْراً، وَأَعْظَمِهَا نَفْعاً: «عِلْمُ الحَدِيثِ»، فَبِهِ حَفِظَ اللَّهُ سُنَّةَ نَبِيِّهِ مُحَمَّدٍ صلى الله عليه وسلم؛ وَمِنْ سُبُلِ حِفْظِهِ تَعَالَى لَهَا: تَسْخِيرُ العُلَمَاءِ الرَّاسِخِينَ لِلتَّصْنِيفِ فِي عُلُومِ الحَدِيثِ مَا بَيْنَ مُطَوَّلٍ وَمُخْتَصَرٍ، وَمِنْ أُولَئِكَ: الحَافِظُ أَحْمَدُ بْنُ عَلِيٍّ ابْنُ حَجَرٍ رحمه الله، فَقَدْ جَمَعَ فِي كِتَابِهِ: «نُخْبَةِ الفِكَرِ فِي مُصْطَلَحِ أَهْلِ الأَثَرِ» مَا تَفَرَّقَ، وَلَخَّصَ فِيهِ عُلُومَ مَنْ سَبَقَ، وَزَادَ فِيهِ فَرَائِدَ وَفَوَائِدَ، مَعَ دِقَّةِ الِاسْتِقْرَاءِ وَالسَّبْرِ وَالتَّقْسِيمِ؛ فَجَاءَ مُصَنَّفُهُ هَذَا نُخْبَةً مُخْتَصَرَةً شَامِلَةً تَلَقَّاهَا أَهْلُ العِلْمِ بِالقَبُولِ. لِذَا عَمِلْتُ عَلَى تَحْقِيقِهِ ضِمْنَ سِلْسِلَةِ تَحْقِيقِ المُتُونِ الإِضَافِيَّةِ مِنْ «مُتُونِ طَالِبِ العِلْمِ»، مُعْتَمِداً فِي ذَلِكَ عَلَى نُسَخٍ خَطِّيَّةٍ نَفِيسَةٍ، لِيَظْهَرَ فِي أَبْهَى حُلَّةٍ كَمَا وَضَعَهُ المُصَنِّفُ، وَقَدْ أَثْبَتُّ فِي حَوَاشِي هَذِهِ النُّسْخَةِ الفُرُوقَ بَيْنَ نُسَخِ المَخْطُوطَاتِ وَغَيْرَ ذَلِكَ، وَأَفْرَدْتُ نُسْخَةً أُخْرَى مُجَرَّدَةً مِنْ ذَلِكَ.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 8
  },
  {
    "serial_number": "3382300",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "وَجَعَلْتُ بَيْنَ يَدَيِ الكِتَابِ: مَنْهَجِي فِي التَّحْقِيقِ، وَوَصْفَ النُّسَخِ المُعْتَمَدَةِ فِي تَحْقِيقِ المَتْنِ، وَتَحْقِيقَ اسْمِ الكِتَابِ، وَتَرْجَمَةَ المُصَنِّفِ، وَنَمَاذِجَ مِنَ المَخْطُوطَاتِ. أَسْأَلُ اللَّهَ أَنْ يَنْفَعَ بِهِ، وَأَنْ يَجْعَلَ عَمَلَنَا فِيهِ خَالِصاً لِوَجْهِهِ الكَرِيمِ. وَصَلَّى اللَّهُ وَسَلَّمَ عَلَى نَبِيِّنَا مُحَمَّدٍ، وَعَلَى آلِهِ، وَصَحْبِهِ أَجْمَعِينَ. د. عبد المحسن بن محمد القاسم إمام وخطيب المسجد النبوي",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 9
  },
  {
    "serial_number": "3382301",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "مَنْهَجِي فِي التَّحْقِيقِ 1 - رَمَزْتُ للنُّسَخِ بالحُرُوف الأبْجَدِيَّة بِحَسَبِ تاريخها؛ الأَقْدَم فالأَقْدَم. 2 - أثبتُّ في المتن ما اتَّفقت أغلبُ النُّسَخ عليه، وربَّما أثبتُّ ما ورد في بعضها أو في إحداها إذا اقتضى النَّظر ذلك، وأُبَيِّنُ السَّبَبَ غالباً. 3 - أَثبتُّ فِي الحَوَاشِي الفُرُوقَ المُهِمَّةَ بَيْنَ النُّسَخِ. 4 - اسْتَعنتُ بِمُراجعة نُزْهةِ النَّظر وشُرُوحِها في التَّرْجِيح بَين بعضِ الفُروقِ الوارِدةِ في نُسخِ المَتْنِ. 5 - أَهْمَلْتُ فِي الغَالِبِ ذِكْرَ ما سَهَا فيه النُّسَّاخُ مِمَّا هُوَ مِنْ قَبِيلِ الأَخْطَاءِ المَحْضَةِ، وَبِخَاصَّةٍ مَا كَانَ مِنْهَا مِنْ قَبِيلِ الخَطَأِ فِي الضَّبط؛ إلَّا إذا كان لهذا الخطأ وجهٌ محتمَلٌ فإنِّي أُثبِتُه. 6 - دَمَجَ المصَنِّفُ رحمه الله في «نزهة النظر» أَلْفَاظَ النُّخْبَةِ بألفاظِ الشَّرح لِيَكونَ أوفَقَ - كما نصَّ على ذلك -، وقد اقتضى ذلك أن يختلفَ ضبطُ بعضِ كلماتِها بين المتن وشرحه؛ بسبب تغيُّر السِّياق، وما يتبعه من اختلاف وجه الإعراب، وقد نبَّه الملَّا علي القارِي على ذلك بقوله - في شرح شرح نخبة الفكر (ص 151) -: «كَثُرَ في هذا الكتابِ",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 10
  },
  {
    "serial_number": "3382302",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "باعتبارِ مَزْجِهِ: أنَّه جَعَلَ لفظاً مُعْرَباً بإعرابٍ في المَتْنِ، وإعرابٍ آخرَ في الشَّرْحِ، وأمثال ذلِكَ»، وَلِذَلِكَ أهملتُ الفروقَ الَّتي من هذا القبيل، واقتصرتُ على اعتبار الضَّبطِ الواردِ في نُسخ المتن؛ إلَّا إذا كان سياقُ المتن لم يتغيَّرْ في الشَّرح. 7 - أثْبَتُّ النَّص على ما اشتهر من قواعد الإملاء المعاصر، ولم أُشِرْ إلى اختلاف النُّسَخِ في ذلك؛ كطريقة كتابة الهمزات، ورسْمِ التَّاء مفتوحة أو مربوطة، ونحو ذلك. 8 - إذا كان الاختلافُ بتقديم كلمةٍ على كلمة؛ فإنِّي أذكر الخلاف فقط في الحاشية، وأقول بعده: «بتقديم وتأخير». 9 - إذا اختلفتِ النُّسخُ في ضبطِ كلمةٍ ما؛ فإنني أُثْبِتُ في المتن الوجهَ الأصحَّ والأشهر، وأُشير في الحاشية إلى بقيَّة الأوجه، مع بيان وجه التَّرجيح من كلام العلماء غالباً. 10 - إذا كُتِبَتْ كَلِمةٌ في إحدى النُّسخ بوجهين في حرفٍ واحدٍ - مثل: التاء والياء، أو النون والياء ونحو ذلك -؛ فإنِّي أَكْتُبُ في الحاشية ما هو موافقٌ للمتن، ثم أُبيِّن أنَّها بالحرفين معاً. 11 - الرُّموز الواردة في حواشي النسخ لم أثبتها كما هي برمزها، وإنما كتبتها باللَّفظ المقصود منها - مثال ذلك حرف: «خ، خـ» المقصود به: الإشارة إلى نسخة أخرى -؛ كتبته هكذا: «في نسخة على حاشية كذا».",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 11
  },
  {
    "serial_number": "3382303",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "12 - إذا ضُبِطَت كلمَةٌ في بعضِ النُّسخِ وأهملت في البقيَّة، مع عدم وجود خلاف بين النُّسخِ المَضْبُوطَة، فإنني أُثْبِتُ الضَّبطَ الموجودَ دونَ إشارة إلى النُّسَخِ المُهْمَلةِ، وإذا اختلفت النُّسَخُ في الضَّبطِ فإنِّي أشير إلى ما في النُّسخ المضبوطة، وأهمل ذكر النُّسخ غير المضبوطة. 13 - راعيتُ في وصف اختلاف ضبط الكلمات: تمييزَ علامة البناء وما يرجع إلى البنية الصَّرفية للكلمة؛ عن علامات الإعراب. 14 - جعلتُ لِلكتابِ نُسْخَتين: أ - النُّسْخةَ الأُولى: وهي النُّسْخة المُتضمِّنة لِحَواشي التَّحقيق؛ مِن الفُروقِ بين النُّسخ، والتَّرجيح بينها، والتَّعليق على ما يحتاج إلى تعليق، وهي هذه النُّسخة. ب - النُّسْخةَ الثَّانية: نُسخةٌ مُجردةٌ من جَميع الحَواشي المشار إليها، وهي أنسبُ للحِفْظ.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 12
  },
  {
    "serial_number": "3382304",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "وَصْفُ النُّسَخِ المُعْتَمَدَةِ فِي تَحْقِيقِ المَتْنِ اعْتَمدْتُ في تحقيق مَتْنِ «نخبة الفِكَر» على ثمانِ نُسخٍ خَطِّيَّةٍ، مُتقدِّمٍ نَسْخُها، وقابلتُ المتن أيضاً على ثمان نُسَخٍ عتيقةٍ لشرحه «نُزْهَةُ النَّظَرِ»، ولم أثبت الفروق بين نُسَخ النزهة، سوى في بعض المواضع المهمَّة دعَتْ إليها الحاجة، وهذه النُّسَخُ حسْبَ تاريخِ نسخِها ما يلي:  أولاً: نُسَخُ «نُخبةِ الفِكَر» .  النُّسخة الأُولى، ورمزت لها بـ (أ): وهي نُسْخَةٌ خَطِّيَّةٌ مَحفُوظةٌ في المَكتَبةِ الوطنيَّة بباريس - فرنسا -، برقم (760/ 1). عدد لوحاتِها: (3) لوحات. تاريخُ نسخِها: (13) ذي الحجَّة، سنة (821 هـ). ناسخها: لم يُذكَر. خطُّها: نسخيٌّ جميل. خَصَائِصُهَا: 1 - نُسْخَةٌ متقنة، مشكولةٌ، لكن وقع فيها خرمٌ ذهب بأكثرَ من ثلثيها؛ من قوله: «مُحَمَّدٍ الَّذِي أَرْسَلَهُ إِلَى النَّاسِ … »، إلى قوله: «الجَرْحِ، وَأَسْوَأُهَا: الوَصْفُ بِأَفْعَلَ».",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 13
  },
  {
    "serial_number": "3382305",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "2 - مكتوبة في حياة المؤلِّف، قبل وفاته بأكثر من ثلاثين سنة. 3 - على أوَّلها وقفٌ لهذه النُّسخة من مالِكها: محمد بن أحمد المظفَّري (1) ، وهو تلميذ السَّخاوي.  النُّسخة الثَّانية، ورمزت لها بـ (ب): وهي نُسْخَةٌ خَطِّيَّةٌ مَحفُوظةٌ في مَكتَبةِ دار الكتب المصريَّة ضِمْنَ مَجَامِيع طلعت - مصر -، برقم (880/ 5). عدد لوحاتِها: (5) لوحات. تاريخُ نسخِها: يوم الخميس (16) المحرم، سنة (834 هـ). ناسخها: محمد بن موسى بن عِمران المقرئ (2) . خطُّها: نَسْخِيٌّ مُعتَاد. خَصَائِصُهَا: 1 - نُسْخَةٌ تَامَّةٌ. 2 - مكتوبة بخط تلميذ المصنِّف. 3 - مكتوبة في حياة المصنِّف، قبل وفاته بـ (18) سنة. 4 - نسخة مصحَّحة - كما هو ظاهرٌ من حواشيها -.",
    "foot_note": "1. هو مُحَمَّد بن أَحْمَدَ المُظَفَّرِي، المَعْرُوف بابن الفَاخورِي، قَرَأَ عَلَى السَّخاوي والدِّيلي وغيرهم، قال السَّخاوِي: «كَانَ لَهُ هِمَّةٌ، وَرَغْبَةٌ فِي الاشتِغَال». الضَّوء اللَّامِع لأهل القرن التاسع (7/ 76). \n2. هو محمد بن موسى بن عمران، شمس الدِّين الغَزِّي، ثمَّ المقدسي، الحنفيُّ، المقرئ، قرأ على الحافظ ابن حجر (نغبة الظَّمآن لأبي حيّان)، وغيرَها سنة (844 هـ)، وتصدَّر للإقراء بالقُدس والقاهرة، وانتفع النَّاس به لصلاحه، توفِّي سنة (873 هـ). الضَّوء اللَّامِع (10/ 58).",
    "book_id": "616",
    "new_page_number": 14
  },
  {
    "serial_number": "3382306",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "النُّسخة الثَّالثة، ورمزت لها بـ (ج): وهي نُسخَةٌ خَطِّيَّةٌ بِمَكْتبةِ آيا صُوفِيَا، ضِمنَ المَكْتبةِ السُّلَيْمانيَّة بِإِسْتَانْبُول - تُركيا-، برقم (440/ 2). عدد لوحاتها: (5) لوحات. تاريخ نسخها: السادس من جمادى الآخرة، سنة (834 هـ). ناسخها: أبو الفتحِ محمَّدُ بنُ مُحمَّدِ ابنُ الجزَرِيِّ النَّابُلسِيُّ. خطُّها: نسخيٌّ واضح. خَصَائِصُهَا: 1 - نُسْخَةٌ تَامَّةٌ، مُتْقنةٌ، وَمُقابَلةٌ. 2 - على حواشيها تصحيحاتٌ في عدة مواضع. 3 - مَكْتُوبَةٌ فِي حَياةِ المُصَنِّفِ رحمه الله. 4 - ميَّز الناسخُ رؤوس المسائل بالحُمرة.  النُّسخة الرَّابعة، ورمزت لها بـ (د): وهي نُسْخَةٌ خَطِّيَّةٌ مَحفُوظةٌ في مَكتَبةِ دار الكتب المصريَّة ضِمْنَ مَجَامِيع طلعت - مصر -، برقم (880/ 2). عدد لوحاتِها: (6) لوحات. تاريخُ نسخِها: الثلاثاء (8) المحرَّم، سنة (850 هـ). ناسخها: محمد بن موسى بن عمران المقرئ - المتقدِّم -. خطُّها: نسخيٌّ معتاد.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 15
  },
  {
    "serial_number": "3382307",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "خَصَائِصُهَا: 1 - نُسْخَةٌ تَامَّةٌ، مضبوطة بالشَّكل. 2 - مكتوبة بخطِّ تلميذ المصنِّف. 3 - مكتوبة في حياة المصنِّف، قبل وفاته بسنتين.  النُّسخة الخامسة، ورمزت لها بـ (هـ): وهي نُسْخَةٌ خَطِّيَّةٌ مَحفُوظةٌ في مَكْتبةِ متحف الإِسْكُورْيَال - إسبانيا -، برقم (1509). عدد لوحاتها: (4) لوحات. تاريخُ نسخِها: أواخر شهر ربيع الأوَّل، سنة (869 هـ). ناسخها: أَحْمَدُ بْنُ عَليِّ بن عليِّ بْنِ عَبْدِ اللَّهِ المَغْرَاوِيُّ. خطُّها: أَنْدَلُسِيٌّ واضح. خَصَائِصُهَا: 1 - نُسْخَةٌ تامَّةٌ، جيِّدةٌ. 2 - غالب كلماتِها مَشكولةٌ. 3 - مَيَّزَ النَّاسِخُ بعضَ رُؤوسِ المَسَائِل بِلَونٍ غامق. 4 - بيَّض النَّاسخ لبعض الكلمات المهمَّة ليكتبها بمدادٍ مغاير - فيما يبدو -، لكنَّه لم ينشط لاستكمالها فترك بعضها غُفلاً، وهِيَ سَبْعةٌ وَعِشرُونَ مَوضِعاً، لم أنبِّهْ عليها في الحَوَاشِي؛ اكتِفَاءً بِالتَّنبِيهِ عَلَيهَا هُنَا.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 16
  },
  {
    "serial_number": "3382308",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "النُّسخة السَّادسة، ورمزت لها بـ (و): وهي نُسْخَةٌ خَطِّيَّةٌ مَحفُوظةٌ في المَكْتبةِ التَّيْمُورِيَّةِ، بِدارِ الكُتبِ المِصْرِيَّةِ - مِصْرَ -، برقم (76). عدد لوحاتِها: (5) لوحات. تاريخُ نسخِها: لَمْ يُذْكَرْ تَارِيخُ نَسْخِهَا، ولكن عَلَيْهَا إِجَازَةٌ مِنَ الشَّيخ عُثْمَانَ الدِّيمِيِّ (1) - تلميذِ المصنِّف - لِلنَّاسِخِ، فِي شَوَّال سنة (876 هـ). ناسخها: سِرَاجُ الدِّينِ أَبُو حَفصٍ، عُمَرُ بنُ أَبِي بَكْرِ بنِ عليٍّ الشَّهِيرُ بِابْنِ المُبَيِّضِ الصَّيْدَاوِيُّ الشَّافِعِيُّ (2) . خطُّها: نَسْخِيٌّ وَاضِحٌ في غاية الحُسن. خَصَائِصُهَا: 1 - نُسْخَةٌ تَامَّةٌ، وَمُتْقنةٌ. 2 - على حواشيها تصحيحاتٌ تدلُّ على العناية بها.",
    "foot_note": "1. هو عُثْمَان بن مُحَمَّد بن عُثْمَان بن نَاصِر، الفَخر، أَبُو عمر، الدِّيمي القاهري، الأَزْهَرِي، الشَّافِعِي، ويُعْرَفُ أوَّلاً بالبُهُوتِي - لكون أمه منها - ثم بالدِّيمي، وهو أحد التسعة الذين أوصى إليهم الحافظ ابن حجر، ووصفهم بكونهم أهل الحديث، ولد فِي المحرم سنة (820 هـ)، وتوفي في سنة (908 هـ). الضَّوء اللَّامِع (5/ 140)، النور السافر عن أخبار القرن العاشر (ص 46). \n2. هو عمر بن أبي بكر الصَّيْداوِيُّ الدِّمَشقِي الشَّافعي، ويعرف بِابْن المُبَيِّض، قال السَّخاويُّ رحمه الله: «شَابٌّ فَاضِلٌ دَيِّنٌ سَاكِنٌ، أَقَامَ بِالقَاهِرَةِ يَسِيراً، وَاشْتَغَلَ عَلَى بَعْضِ الجَمَاعَةِ، وَقَرَأَ عَلَيَّ صَحِيحَ مُسْلِمٍ». الضَّوء اللَّامِع (6/ 77).",
    "book_id": "616",
    "new_page_number": 17
  },
  {
    "serial_number": "3382309",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "3 - مَقْرُوءَةٌ عَلَى الشيخ عثمان الدِّيمِيِّ - تِلْميذِ المُصنِّفِ رحمه الله، وعليها خَطُّهُ وَإِجَازَتُهُ.  النُّسخة السَّابعة، ورمزت لها بـ (ز): وهي نُسْخَةٌ خَطِّيَّةٌ مَحفُوظةٌ في مَكْتَبَةِ رَاغِب بَاشَا، ضِمْنَ المَكْتبةِ السُّلَيْمانيَّةِ بِإِسْتَانْبُولَ - تُرْكِيَا -، ضمن مجموع، برقم (1470/ 2). عدد لوحاتِها: لوحتان. تاريخُ نسخِها: لم يُذكر، لكنَّها منسوخة في القرن التَّاسع؛ فإنَّ ناسخها مولودٌ عام (815 هـ). ناسخها: مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي بَكْرٍ البُوصِيرِيُّ (1) . خطُّها: نَسْخيٌّ معتادٌ. خَصَائِصُهَا: 1 - نُسْخَةٌ تَامَّةٌ. 2 - ناسخها من تلامِيذِ المُصَنِّف رحمه الله. 3 - ميَّز ناسخُها الفواصلَ بين جُمَل المتن وبعضَ الألفاظ بالحُمرة.",
    "foot_note": "1. هو محمد بن أحمد بن أبي بكر البُوصِيرِي، ابن الحافظ البُوْصِيرِي، ويُعْرَفُ بالبُوصِيرِي أيضاً، ويُكنى أبا الفتح، وُلد في خامس عشر رجب سنة خمس عشرة وثمان مئة (815 هـ) بالقاهرة، ونشأَ بها فَحَفِظَ القُرآن وتقريب الأسانيد للعراقي، والنُّخبة لابن حجر، وغيرها، وهو من تلاميذ ابن حجر؛ قال السَّخاويُّ رحمه الله بعد أن ذكر بعض مقروءاته عليه -: «وَقَرَأَ عَلَيْهِ جَمِيعَ النُّخْبَةِ مِنْ تَصْنِيفِهِ أَيْضاً، وَغَيْر ذَلِكَ عَرْضاً». الجواهر والدرر في ترجمة شيخ الإسلام ابن حجر (3/ 1127)، والضَّوء اللَّامِع (6/ 296).",
    "book_id": "616",
    "new_page_number": 18
  },
  {
    "serial_number": "3382310",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "النُّسخة الثَّامنة، ورمزت لها بـ (ح): وهي نُسْخَةٌ خَطِّيَّةٌ مَحفُوظةٌ في مَكتَبةِ عاطف أفندي بِإِسْتَانْبُولَ - تُرْكِيَا -، برقم (379). عدد لوحاتِها: (8) لوحات. تاريخُ نسخِها: الثُّلاثاء (15) شعبان، سنة (1125 هـ)، لكنَّها منقولةٌ من نسخة قديمةٍ. ناسخها: لم يُذكَر. خطُّها: نَسْخِي مُعْتَادٌ وَوَاضِحٌ. خَصَائِصُهَا: 1 - نُسْخَةٌ تامَّة، يَعْتَنِي نَاسِخُهَا بِضَبْطِ المُشْكِلِ. 2 - مَنْقُولَةٌ مِنْ نُسْخَةٍ بِخَطِّ تِلْمِيذٍ للمُصَنِّفِ، وقد قَرَأهَا عَلَيهِ، وكَتَب لَهُ عَلَيْهَا إجَازَةً بِخَطِّه. 3 - أُثبِتَ علَى حواشي النُّسخَةِ تَعلِيقَاتٌ مَنْقُولَةٌ مِن شَرْحِ المُصَنِّفِ.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 19
  },
  {
    "serial_number": "3382311",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "ثانياً: نُسَخ «نُزْهَةِ النَّظَرِ» .  النُّسخة الأُولى، ورمزت لها بـ (ط): وهي نُسْخَةٌ خَطِّيَّةٌ مَحفُوظةٌ في مَكْتَبَةِ برتو بَاشَا، ضِمنَ المَكْتبةِ السُّلَيْمانيَّة بِإِسْتَانْبُول - تُركيا -، برقم (56)، تاريخُ نسخِها: سنة (843 هـ)، وهي مَقرُوءَةٌ عَلَى المُصَنِّفِ، وعليها خطُّه.  النُّسخة الثَّانية، ورمزت لها بـ (ي): وهي نُسْخَةٌ خَطِّيَّةٌ مَحفُوظةٌ في مَكتَبةِ دار الكتُب المصريَّة ضِمْنَ مَجَامِيع طلعت - مصر -، برقم (880/ 6)، تاريخُ نسخِها: سنة (844 هـ) في حياة المصنِّف، وهي بخطِّ تلميذِهِ: محمد بن موسى بن عمران المقرئ.  النُّسخة الثَّالثة، ورمزت لها بـ (ك): وهي نُسْخَةٌ خَطِّيَّةٌ مَحفُوظةٌ في المكتبة الحَمْزَاوِيَّة بإقليم الراشِديَّة بالمغرب، برقم (204)، وهي مَقرُوءَةٌ عَلَى المُصَنِّفِ قراءةَ بحثٍ وتدقيقٍ، وعليها خطُّه، وفي آخرها إجازةٌ من المُصنِّف لمالك النُّسخة نُورِ الدِّين عليّ بن داود الجَوْهَريِّ الحنفيِّ (1) - تلميذ المُصنِّف -؛ في عاشر جمادى الآخرة، سنة (850 هـ).",
    "foot_note": "1. هو علي بن داود بن إبراهيم، نور الدين، القاهري، الجوهري، الحنفي، ويُعرَفُ بابن داود وبابن الصَّيرفِي، ولد في رابع عشر جمادى الآخرة، سنة تسع عشرة وثمان مئة بالقاهرة، ونشأ بها، وقرأ شرح النُّخْبَةِ وغيره على مؤلِّفها الحافظ ابن حجر العسقلاني، ولازم مجلسه في الإملاء وغيره. الضَّوء اللَّامِع (5/ 218)، الجواهر والدرر (3/ 1114).",
    "book_id": "616",
    "new_page_number": 20
  },
  {
    "serial_number": "3382312",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "النُّسخة الرابعة، ورمزت لها بـ (ل): وهي نُسْخَةٌ خَطِّيَّةٌ مَحفُوظةٌ في مَكْتَبَةِ بِرْنسْتُونْ (مجموعة جَارِيتْ) - أَمْرِيكَا -، برقم (3949)، تاريخُ نسخِها: ثالث رجب، سنة (850 هـ)، وناسخُها تلميذُ المُصنِّف: محمد بن مُحمَّد بن مُحمَّد ابنُ المُغَيْزِلِ - وابْنُ حَمَّادٍ - العَبْدَرِيُّ الحَمَويُّ الشَّافِعِيُّ (1) ، وهي مَقْرُوءَةٌ عَلَى المُصَنِّفِ، وَعَلَيْهَا خَطُّهُ وَإِجَازَتُهُ.  النسخة الخامسة، ورمزت لها بـ (م): وهي نُسْخَةٌ خَطِّيَّةٌ مَحفُوظةٌ في دار الكتب الظَّاهريَّة بدمشق - سوريا -، برقم (4895)، تاريخُ نسخِها: رمضان، سنة (851 هـ) - قبل وفاةِ المُصنِّف بنحو سنةٍ واحدةٍ -، وناسخُها: أَحْمَدُ بْنُ مُحَمَّدِ ابْنِ الأَخْصَاصِيِّ الشَّافِعِيُّ (2) - تلميذ المصنف -، وهي مَقْرُوءَةٌ عَلَى المُصَنِّفِ قراءةَ بحث، وَعَلَيْهَا خَطُّهُ.  النُّسخة السادسة، ورمزت لها بـ (ن): وهي نُسْخَةٌ خَطِّيَّةٌ مَحفُوظةٌ في مَكتَبةِ حَكِيم أُوغْلُو؛ ضِمْنَ المَكْتبةِ السُّلَيْمانيَّةِ بِإِسْتَانْبُولَ - تُرْكِيَا -، برقم (155)، تاريخُ نسخِها: شوال،",
    "foot_note": "1. هو محمد بن محمد بن محمد، الزين، أبو البركات، ابن ناصر الدين ابن المُغَيْزِل الحَمَوِيُّ، قال السَّخاويُّ: «قَرَأَ عَلَى شَيْخِنَا شَرْحَ النُّخْبَةِ إِلَّا اليَسِيرَ، فَسَمِعَه بِقِرَاءَةِ غَيْرِهِ»، ومات في سنة (867 هـ). الجواهر والدرر (3/ 1164)، الضَّوء اللَّامِع (9/ 248). \n2. هو أحمد بن محمد بن محمد، الشهاب ابن الأخصاصي الدمشقي، ولد في سنة ثمان عشرة وثمان مئة بدمشق، ونشأ بها فحفظ القرآن، وقرأ في الفقه، وهو من تلاميذ ابن حجر، قال السَّخاويُّ رحمه الله: «ارْتَحَلَ فَقَرَأَ عَلَى شَيْخِنَا شَرْحَ النُّخْبَةِ لَهُ بَحْثاً، وَأَذِنَ لَهُ»، توفي في سنة (889 هـ). الجواهر والدرر (3/ 1083)، الضَّوء اللَّامِع (2/ 194).",
    "book_id": "616",
    "new_page_number": 21
  },
  {
    "serial_number": "3382313",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "سنة (852 هـ) - قبل وَفاةِ المُصنِّف بنحو شهرين -، وناسخها تلميذ المُصنِّف: محمود ابن إسماعيل العَيْنِيُّ (1) .  النُّسخة السَّابعة، ورمزت لها بـ (س): وهي نُسْخَةٌ خَطِّيَّةٌ مَحفُوظةٌ في مَكتَبةِ آيَا صُوفِيَا؛ ضِمْنَ المَكْتبةِ السُّلَيْمانيَّةِ بِإِسْتَانْبُولَ - تُرْكِيَا -، برقم (440/ 1)، تاريخُ نسخِها: سنة (857 هـ)، وناسخُها: يَحْيَى بْنُ عَبْدِ الغَنِيِّ الإِمَامُ، ومَقْرُوءَةٌ عَلَى الشَّيخِ عُثمانَ الدِّيمِيِّ - تِلْمِيذِ المُصَنِّفِ - قِرَاءَةَ بَحْثٍ وتَحْقِيقٍ، وَعَلَيْهَا خَطُّهُ وَإِجَازَتُهُ.  النُّسخة الثَّامنة، ورمزت لها بـ (ع): وهي نُسْخَةٌ خَطِّيَّةٌ مَحفُوظةٌ في مَكْتَبَةِ أَسْعَد أَفَنْدِي؛ ضِمْنَ المَكْتبةِ السُّلَيْمانيَّةِ بِإِسْتَانْبُولَ - تُرْكِيَا -، برقم (3951)، تاريخُ نسخِها: صفر، سنة (869 هـ)، وناسخُها: أَحْمدُ بنُ شَعْبَانَ بنِ عَليِّ بنِ شَعْبانَ بْنِ مُحَمَّدٍ الأَنْصَارِيُّ (2) ، وهي منقولةٌ مِن نُسْخَةٍ مقروءةٍ على المُصَنِّفِ قِرَاءَةَ بَحْثٍ وعَلَيْها خطُّه، ومَقْرُوءَةٌ أيضاً عَلَى الشَّيخ عُثمانَ الدِّيمِيِّ - تِلْمِيذِ المُصَنِّفِ - قِرَاءَةَ بَحْثٍ وتَدْقِيقٍ، وَعَلَيْهَا خَطُّهُ وَإِجَازَتُهُ.",
    "foot_note": "1. هو مظفَّر الدّين، محمود بن أحمد بن حسن بن إسماعيل العيني القاهري الحنفي، المعروف بابن الأمشاطي، ولد في حدود سنة (812 هـ)، واشتغل بالفقه، وبرع في الطِّب وصنَّف فيه، وسمع على جماعة كالحافظ ابن حجر وغيره، توفِّي سنة (902 هـ). الضَّوء اللَّامِع (10/ 128)، البدر الطَّالع بمحاسن مَن بعد القرن السَّابع (2/ 293). \n2. أَحْمد بن شعْبَان بن عَليٍّ، الشهَاب الأنْصَارِيُّ، الغَزِّيُّ الشَّافِعِيُّ، وَيُعْرَفُ بِابْن شعْبَان الكساني، نَشأ بغزة، فحفظ القُرْآن، والمنهاج الفرعي، وَجمع الجَوَامِع، وألفيتي الحَدِيث والنحو، وَغيرها، وبرع وتفنَّن، ونظم وَأفَاد، وتصدَّى للتَّدريس والإفتاء فَانْتَفع بِهِ جمَاعَة، مَعَ تصوُّن وَخير واستقامة، وقدم مصر فأخذ عن السَّخاويِّ تلميذ ابن حجر. الضَّوء اللَّامِع (1/ 312).",
    "book_id": "616",
    "new_page_number": 22
  },
  {
    "serial_number": "3382314",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "اسْمُ الكِتَاب نصَّ المصنِّف رحمه الله نصّاً بيِّناً على اسْم كتابه، وهو الاسْم الَّذي اتَّفَقَت عليه أغلب النُّسَخِ الخَطِّيَّةِ، وهو الوارد في أغلب الإجازات، والخَوَاتِيمِ، والشُّرُوحَات، وكُتُب التَّرَاجِم، والفَهَارِس، ونحوها من مَظانِّ معرفة اسمِ الكتاب، ولذلك اعتمدْتُه، وهو: «نُخْبَةُ الفِكَرِ فِي مُصْطَلَحِ أَهْلِ الأَثَرِ». وقد نصَّ رحمه الله على اسْمِ الكِتاب في مقدمة كتابه: «نُزْهة النَّظر في توضيح نخبة الفكر»؛ فقال: «سَأَلَنِي بَعْضُ الإِخْوَانِ أَنْ أُلَخِّصَ لَهُ المُهِمَّ مِنْ ذَلِكَ؛ فَلَخَّصْتُهُ فِي أَوْرَاقٍ لَطِيفَةٍ، سَمَّيْتُهَا: نُخْبَةَ الفِكَرِ فِي مُصْطَلَحِ أَهْلِ الأَثَرِ» (1) .",
    "foot_note": "1. وانظر: المجمع المؤسِّس للمعجم المفهرس (3/ 302، 342، 366).",
    "book_id": "616",
    "new_page_number": 23
  },
  {
    "serial_number": "3382315",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "تَرْجَمَةُ الحَافِظِ ابْنِ حَجَرٍ العَسْقَلَانِيِّ رحمه الله (1)  اسمُه ونسبُه: أبو الفضل شهابُ الدين، أحمدُ بنُ عليِّ بنِ محمَّدِ بنِ محمَّدِ بنِ عليِّ بنِ محمودٍ ابنُ حجر العسقلانيُّ، المصريُّ، الشَّافعيُّ.  مَولِدُه: ولد في شعبان، سنة ثلاث وسبعين وسبع مئة (773 هـ) بمصر، ونشأ بها يتيماً، وحفظ القرآن، والعمدة، وألفية العراقي، والحاوي الصغير، ومختصر ابن الحاجب، وغيرها، وهو ابن تسع سنين.  رِحلتُه وأَشْهرُ شُيوخِه: كان رحمه الله كثيرَ التِّرحالِ في طلب العلم، باذلاً له وقتَهُ ومالَهُ؛ فرحل داخل مصر، وأخذ عن كبار شيوخها، كما رحل إلى بلاد الحجاز، واليمن، والشَّام، وحلب وغيرها.",
    "foot_note": "1. انظر ترجمته في: ذيل التقييد في رواة السنن والمسانيد للفاسي (1/ 352)، لحظ الألحاظ لابن فهد (ص 211)، المنهل الصافي والمستوفى بعد الوافي ليوسف بن تغري بردي (2/ 17)، الضَّوء اللَّامِع (2/ 36)، تذكرة الحفاظ وتبصرة الأيقاظ لابن المِبْرَد الحنبلي (ص 37) (مطبوع ضمن مجموع رسائل ابن عبد الهادي)، طبقات الحفاظ (552)، وذيله (251)، ونظم العِقْيَان في أعيان الأعيان؛ ثلاثتها للسيوطي (1/ 45)، شذرات الذهب في أخبار من ذهب لابن العماد (1/ 74)، البدر الطالع (1/ 87)، وأوسعها: كتاب تلميذه السخاويِّ: الجواهر والدرر في ترجمة شيخ الإسلام ابن حجر.",
    "book_id": "616",
    "new_page_number": 24
  },
  {
    "serial_number": "3382316",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "ومن أبرز شيوخه: - إبراهيم التنوخي (800 هـ). - برهان الدين الأبناسي (802 هـ). - ابن الملقن (804 هـ). - سراج الدين البُلقيني (805 هـ). - عبد الرحيم العراقي (806 هـ). - نور الدين الهيثمي (807 هـ). - محمد بن يعقوب الفيروز آبادي (817 هـ). - عز الدين ابن جماعة (819 هـ). وغيرهم كثير.  أَشْهرُ تلاميذه: - محب الدين ابن الشحنة (815 هـ). - الكمال بن الهمام (861 هـ). - ابن تغري بردي (874 هـ). - قاسم بن قطلوبغا (879 هـ). - برهان الدين البقاعي (885 هـ). - شمس الدين السخاوي (902 هـ). - زكريا الأنصاري (926 هـ). وغيرهم كثير.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 25
  },
  {
    "serial_number": "3382317",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "ثَناءُ العُلماءِ عليه: - قال الحافظ العِراقيُّ رحمه الله: «الشَّيْخُ العَالِمُ، وَالكَامِلُ الفَاضِلُ، الإِمَامُ المُحَدِّثُ، المُفِيدُ المَجِيدُ، الحَافِظُ المُتْقِنُ، الضَّابِطُ، الثِّقَةُ المَأْمُونُ» (1) . - وقال محمد الفاسيُّ رحمه الله: «هُوَ أَحْفَظُ أَهْلِ العَصْرِ لِلْأَحَادِيثِ وَالآثَارِ، وَأَسْمَاءِ الرِّجَالِ؛ المُتَقَدِّمِينَ مِنْهُمْ وَالمُتَأَخِّرِينَ، وَالعَالِي مِنْ ذَلِكَ وَالنَّازِل، مَعَ مَعْرِفَةٍ قَوِيَّةٍ بِعِلَلِ الأَحَادِيثِ، وَبَرَاعَةٍ حَسَنَةٍ فِي الفِقْهِ وَغَيْرِهِ» (2) . - وقال ابن ناصر الدِّين رحمه الله: «مُحَدِّثٌ حَافِظٌ» (3) . - وقال ابن فهد رحمه الله: «الإِمَامُ العَلَّامَةُ الحَافِظُ، فَرِيدُ الوَقْتِ، مَفْخَرُ الزَّمَانِ، بَقِيَّةُ الحُفَّاظِ، عَلَمُ الأَئِمَّةِ الأَعْلَامِ، عُمْدَةُ المُحَقِّقِينَ، خَاتِمَةُ الحُفَّاظِ المُبْرَزِينَ، وَالقُضَاةِ المَشْهُورِينَ» (4) . - وقال يوسف بن تغري بردي رحمه الله: «شَيْخُ الإِسْلَامِ، حَافِظُ العَصْرِ، رُحْلَةُ الطَّالِبِينَ، مُفْتِي الفِرَقِ، أَمِيرُ المُؤْمِنِينَ فِي الحَدِيثِ» (5) . - وقال السَّخاويُّ رحمه الله: «شَيْخُ الإِسْلَامِ، وَأَوْحَدُ الأَئِمَّةِ الأَعْلَامِ، حَافِظُ العَصْرِ، وَخَاتِمَةُ المُجْتَهِدِينَ … حَامِلُ رَايَةِ العُلُومِ وَالأَثَرِ» (6) .",
    "foot_note": "1. الجواهر والدرر (1/ 270). \n2. ذيل التقييد (1/ 355). \n3. توضيح المشتبه (3/ 128). \n4. لحظ الألحاظ (211). \n5. المنهل الصافي (2/ 17). \n6. الجواهر والدرر (1/ 53).",
    "book_id": "616",
    "new_page_number": 26
  },
  {
    "serial_number": "3382318",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "- وقال أيضاً: «شَهِدَ لَهُ القُدُمَاءُ بِالحِفْظِ وَالثِّقَةِ وَالأَمَانَةِ، وَالمَعْرِفَةِ التَّامَّةِ، وَالذِّهْنِ الوَقَّادِ، وَالذَّكَاءِ المُفْرِطِ، وَسَعَةِ العِلْمِ فِي فُنُونٍ شَتَّى، وَشَهِدَ لَهُ شَيْخُهُ العِرَاقِيُّ بِأَنَّهُ أَعْلَمُ أَصْحَابِهِ فِي الحَدِيثِ» (1) . - وقال الحافظ السُّيوطيُّ رحمه الله: «فَرِيدُ زَمَانِهِ، وَحَامِلُ لِوَاءِ السُّنَّةِ فِي أَوَانِهِ، ذَهَبِيُّ هَذَا العَصْرِ وَنَضَارُهُ، وَجَوْهَرُهُ الَّذِي ثَبَتَ بِهِ عَلَى كَثِيرٍ مِنَ الأَعْصَارِ فَخَارُهُ، إِمَامُ هَذَا الفَنِّ لِلْمُقْتَدِينَ، وَمُقَدَّمُ عَسَاكِرِ المُحَدِّثِينَ، وَعُمْدَةُ الوُجُودِ فِي التَّوْهِيَةِ وَالتَّصْحِيحِ، وَأَعْظَمُ الشُّهُودِ وَالحُكَّامِ فِي بَابَيِ التَّعْدِيلِ وَالتَّجْرِيحِ» (2) . - وقال الإمام الشَّوكانيُّ رحمه الله: «وَتَصَدَّى لِنَشْرِ الحَدِيثِ، وَقَصَرَ نَفَسَهُ عَلَيْهِ مُطَالَعَةً وَإِقْرَاءً وَتَصْنِيفاً، وَتَفَرَّدَ بِذَلِكَ، وَشَهِدَ لَهُ بِالحِفْظِ وَالإِتْقَانِ القَرِيبُ وَالبَعِيدُ، وَالعَدُوُّ وَالصَّدِيقُ؛ حَتَّى صَارَ إِطْلَاقُ لَفْظِ الحَافِظِ عَلَيْهِ كَلِمَةَ إِجْمَاعٍ» (3) .  مؤلَّفاتُه: وهي كثيرة جدّاً؛ منها: - «فتح الباري شرح صحيح البخاري». - «هُدَى الساري مقدمة فتح الباري».",
    "foot_note": "1. الضَّوء اللَّامِع (2/ 39). \n2. نظم العقيان (1/ 45). \n3. البدر الطالع (1/ 88).",
    "book_id": "616",
    "new_page_number": 27
  },
  {
    "serial_number": "3382319",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "- «التمييز في تلخيص تخريج أحاديث شرح الوجيز؛ المشهور بـ (التلخيص الحبير)». - … «تهذيب التهذيب». - «تقريب التهذيب». - «تبصير المنتبه بتحرير المشتبه». - «نخبة الفكر في مصطلح أهل الأثر» وهو كتابُنا هذا. - «نزهة النظر في توضيح نخبة الفكر في مصطلح أهل الأثر». - «الدرر الكامنة في أعيان المئة الثامنة». - «النكت على كتاب ابن الصلاح». - «بلوغ المرام من أدلة الأحكام». - «الإصابة في تمييز الصحابة». - «لسان الميزان». - «إنباء الغمر بأبناء العمر». - «إتحاف المهرة بالفوائد المبتكرة من أطراف العشرة».  وَفاتُه: توفِّي رحمه الله بعد أنْ مرِض أكثرَ من شهر، في ليلة السبت، في أواخر ذي الحِجَّة، سنة اثنتين وخمسين وثمان مئة (852 هـ).",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 28
  },
  {
    "serial_number": "3382320",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "نَمَاذِجُ مِنَ المَخْطُوطَاتِ",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 29
  },
  {
    "serial_number": "3382321",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "صورة اللوحة الأولى لنسخة المكتبة الوطنيّة بباريس (أ)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 30
  },
  {
    "serial_number": "3382322",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "صورة اللوحة الثانية لنسخة المكتبة الوطنيّة بباريس (أ)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 31
  },
  {
    "serial_number": "3382323",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "صورة اللوحة الأخيرة لنسخة المكتبة الوطنيّة بباريس (أ)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 32
  },
  {
    "serial_number": "3382324",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "صورة اللوحة الأولى لنسخة مكتبة دار الكتب المصريّة ضمن مجاميع طَلْعَت (ب)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 33
  },
  {
    "serial_number": "3382325",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "صورة اللوحة الأخيرة لنسخة مكتبة دار الكتب المصريّة ضمن مجاميع طَلْعَت (ب)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 34
  },
  {
    "serial_number": "3382326",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "صورة اللوحة الأولى لنسخة مكتبة آيا صُوفِيَا ضمن المكتبة السّليمانية (ج)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 35
  },
  {
    "serial_number": "3382327",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "صورة اللوحة الأخيرة لنسخة مكتبة آيا صُوفِيَا ضمن المكتبة السّليمانية (ج)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 36
  },
  {
    "serial_number": "3382328",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "صورة اللوحة الأولى لنسخة مكتبة دار الكتب المصريّة ضمن مجاميع طَلْعَت (د)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 37
  },
  {
    "serial_number": "3382329",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "صورة اللوحة الثانية لنسخة مكتبة دار الكتب المصريّة ضمن مجاميع طَلْعَت (د)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 38
  },
  {
    "serial_number": "3382330",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "صورة اللوحة الأخيرة لنسخة مكتبة دار الكتب المصريّة ضمن مجاميع طَلْعَت (د)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 39
  },
  {
    "serial_number": "3382331",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "صورة اللوحة الأولى لنسخة مكتبة الإِسْكُورْيَال (هـ)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 40
  },
  {
    "serial_number": "3382332",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "صورة اللوحة الأخيرة لنسخة مكتبة الإِسْكُورْيَال (هـ)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 41
  },
  {
    "serial_number": "3382333",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "صورة اللوحة الأولى لنسخة المكتبة التَّيْمُورِيَّة بدار الكتب المصرية (و)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 42
  },
  {
    "serial_number": "3382334",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "صورة اللوحة الأخيرة لنسخة المكتبة التَّيْمُورِيَّة بدار الكتب المصرية (و)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 43
  },
  {
    "serial_number": "3382335",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "صورة اللوحة الأولى لنسخة مكتبة راغب باشا ضمن المكتبة السّليمانيّة (ز)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 44
  },
  {
    "serial_number": "3382336",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "صورة اللوحة الأخيرة لنسخة مكتبة راغب باشا ضمن المكتبة السّليمانيّة (ز)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 45
  },
  {
    "serial_number": "3382337",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "صورة اللوحة الأولى لنسخة مكتبة عاطف أفندي ضمن المكتبة السّليمانية (ح)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 46
  },
  {
    "serial_number": "3382338",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "صورة اللوحة الأخيرة لنسخة مكتبة عاطف أفندي ضمن المكتبة السّليمانية (ح)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 47
  },
  {
    "serial_number": "3382339",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "نخبة الفكر في مصطلح أهل الأثر لِلحَافِظِ أَحَمَدَ بْنِ عَليّ ابن حَجَرٍ العَسقَلَانيّ رحمه الله (ت 852 هـ)",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 48
  },
  {
    "serial_number": "3382340",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ (1) الحَمْدُ لِلَّهِ الَّذِي لَمْ يَزَلْ عَالِماً قَدِيراً، وَصَلَّى اللَّهُ عَلَى سَيِّدِنَا مُحَمَّدٍ الَّذِي أَرْسَلَهُ (2) إِلَى (3) النَّاسِ (4) بَشِيراً وَنَذِيراً، وَعَلَى آلِهِ (5)",
    "foot_note": "1. في أ: «قال - سيِّدنا ومولانا، قاضي القضاة، شيخ الإسلام، أبو الفضل - أحمد بن سيدنا العبد الفقير إلى اللَّه تعالى الشيخ نور الدين أبي الحسن علي ابن حجر العسقلاني الشافعي». وفي ب: «ربِّ يسِّر وأعن يا كريم، قال - الشيخ، الإمام، العلامة، الرُّحلة، فريد الدَّهر ووحيد العصر، شهاب الدين - أحمد بن علي ابن حجر العسقلاني، فسح اللَّه في مدَّته، وأسكنه بحبوحة جنَّته». وفي ج زيادة: «رب يسر». وفي د: «ربِّ يسّر يا كريم». وفي هـ زيادة: «صلى اللَّه على سيدنا محمد وسلم تسليماً». وفي و زيادة: «ربِّ يسِّر وأعن، قال - بحرُ الفوائد، سيِّدنا، الشيخ، الإمامُ، العالمُ، العاملُ، العلَّامةُ، شهابُ الدِّين، أبو الفضل - أحمدُ بن علي بن محمد العسقلاني، الشهير بابن حجر الشافعي، رضي الله عنه وأرضاه، وجعل الجنة مأواه، بمحمد وآله» (أ). (أ) والدعاء بهذه الصِّيغة غير مشروع؛ قال الشيخ عبد العزيز ابن باز رحمه الله في فتاوى نور على الدرب (2/ 128) -: «التوسل بجاه النبيِّ، أو بحقِّ النَّبيِّ، أو بجاه الأنبياء، أو بحقِّ الأنبياء، أو بجاه المؤمنين؛ كلُّ هذا غير مشروع؛ بل هو بدعةٌ» وفي ز زيادة: «كتاب نخبة الفكر في مصطلح أهل الأثر، قال - سيدنا، وشيخنا، شيخ الإسلام، قاضي القضاة، حافظ العصر، شهاب الدين - أحمد العسقلاني الكناني الشافعي، الشهير نسبةً بابن حجر رحمة اللَّه عليه». \n2. في ز: «أرسل». \n3. في أ: من هنا يبدأ الخرم، إلى قوله: «وَمرَاتِبِ الجَرْحِ». \n4. في هـ: «بالحق» بدل «إِلَى النَّاسِ». \n5. في ب، ج، د، ح: «وعلى آل محمد»، وفي هـ: «وصلى اللَّه على آل محمد» بدل «وَعَلَى آلِهِ».",
    "book_id": "616",
    "new_page_number": 49
  },
  {
    "serial_number": "3382341",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "وَصَحْبِهِ (1) وَسَلَّمَ تَسْلِيماً كَثِيراً. أَمَّا بَعْدُ: فَإِنَّ التَّصَانِيفَ فِي اصْطِلَاحِ (2) أَهْلِ الحَدِيثِ قَدْ كَثُرَتْ وَبُسِطَتْ وَاخْتُصِرَتْ، فَسَأَلَنِي بَعْضُ الإِخْوَانِ (3) أَنْ أُلَخِّصَ لَهُ (4) المُهِمَّ مِنْ ذَلِكَ، فَأَجَبْتُهُ إِلَى سُؤَالِهِ؛ رَجَاءَ الِانْدِرَاجِ فِي تِلْكَ المَسَالِكِ.",
    "foot_note": "1. «وَصَحْبِهِ» سقطت من ب. \n2. في و: «مصطلح». \n3. في و: «إخواني». \n4. في ب، د: «لهم»؛ والسِّيَاق يقتضي الإفراد؛ للجُمل الواردة بعده.",
    "book_id": "616",
    "new_page_number": 50
  },
  {
    "serial_number": "3382342",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "فَأَقُولُ: *  الخَبَرُ: إِمَّا أَنْ يَكُونَ لَهُ طُرُقٌ (1) بِلَا (2) عَدَدٍ مُعَيَّنٍ، أَوْ مَعَ حَصْرٍ (3) بِمَا فَوْقَ الِاثْنَيْنِ، أَوْ بِهِمَا، أَوْ بِوَاحِدٍ: فَالأَوَّلُ: المُتَوَاتِرُ، المُفِيدُ لِلْعِلْمِ اليَقِينِيِّ بِشُرُوطِهِ. وَالثَّانِي: المَشْهُورُ، وَهُوَ المُسْتَفِيضُ (4) - عَلَى رَأْيٍ -. وَالثَّالِثُ (5) : العَزِيزُ، وَلَيْسَ شَرْطاً لِلصَّحِيحِ - خِلَافاً لِمَنْ زَعَمَهُ -. وَالرَّابِعُ: الغَرِيبُ. وَكُلُّهَا - سِوَى الأَوَّلِ - آحَادٌ. وَفِيهَا المَقْبُولُ وَالمَرْدُودُ (6) ؛ لِتَوَقُّفِ الِاسْتِدْلَالِ بِهَا (7) عَلَى البَحْثِ عَنْ أَحْوَالِ رُوَاتِهَا - دُونَ الأَوَّلِ (8) -، وَقَدْ يَقَعُ فِيهَا مَا يُفِيدُ العِلْمَ النَّظَرِيَّ بِالقَرَائِنِ - عَلَى المُخْتَارِ-.",
    "foot_note": "1. في ج: «طرف»؛ وهو تصحيف، وفي هـ: «يرد من طرقٍ» بدل «يَكُونَ لَهُ طُرُقٌ». \n2. في ب، و زيادة: «حصر». \n3. «حَصْرٍ» سقطت من و. \n4. في ب: «والمستفيض»، وفي ج: «المُسْتَفِيظُ» بالظاء. قال الرَّازي رحمه الله في مختار الصِّحاح مادَّة: ف ي ض (ص 245) -: «مُسْتَفِيضٌ؛ أي: مُنْتَشِرٌ في النَّاس». \n5. في هـ: «الثالث». \n6. في و: «وفيها المردود». \n7. في ج: «بهما»، والمُثْبَتُ موافق لشرح المُصنِّف. \n8. «دُونَ الأَوَّلِ» سقطت من ب.",
    "book_id": "616",
    "new_page_number": 51
  },
  {
    "serial_number": "3382343",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "ثُمَّ الغَرَابَةُ: إِمَّا أَنْ تَكُونَ (1) فِي أَصْلِ (2) السَّنَدِ، أَوْ لَا. فَالأَوَّلُ: الفَرْدُ (3) المُطْلَقُ. وَالثَّانِي: الفَرْدُ (4) النِّسْبِيُّ، وَيَقِلُّ إِطْلَاقُ الفَرْدِيَّةِ عَلَيْهِ.",
    "foot_note": "1. في هـ: «الغريب: إمَّا أن يكون» بدل «الغَرَابَةُ: إِمَّا أَنْ تَكُونَ». \n2. «أَصْلِ» سقطت من ج. \n3. في ز: «المفرد». \n4. في ز: «المفرد»، و «الفَرْدُ» سقطت من هـ.",
    "book_id": "616",
    "new_page_number": 52
  },
  {
    "serial_number": "3382344",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "* وَ خَبَرُ الآحَادِ بِنَقْلِ عَدْلٍ تَامِّ الضَّبْطِ، مُتَّصِلَ (1) السَّنَدِ، غَيْرَ (2) مُعَلَّلٍ وَلَا شَاذٍّ: هُوَ الصَّحِيحُ لِذَاتِهِ. وَتَتَفَاوَتُ (3) رُتَبُهُ بِتَفَاوُتِ هَذِهِ الأَوْصَافِ، وَمِنْ ثَمَّ قُدِّمَ صَحِيحُ البُخَارِيِّ، ثُمَّ مُسْلِمٍ (4) ، ثُمَّ شَرْطُهُمَا (5) . فَإِنْ خَفَّ الضَّبْطُ (6) : فَالحَسَنُ (7) لِذَاتِهِ، وَبِكَثْرَةِ طُرُقِهِ يُصَحَّحُ. فَإِنْ جُمِعَا فَلِلتَّرَدُّدِ (8) فِي النَّاقِلِ حَيْثُ التَّفَرُّدُ (9) ، وَإِلَّا (10) فَبِاعْتِبَارِ إِسْنَادَيْنِ.",
    "foot_note": "1. في و: «مُتَّصِل» بكسر اللَّام وضمِّها، ولم تُشكَّل في بقيَّة النُّسخ، وضُبِطت بالنصب في إحدى نُسخ النزهة. قال القاري رحمه الله في شرح شرح النُّخبة (ص 243) -: «بالنَّصبِ على الحال من (النّقل)، فإنّه مفعول في المعنى على ما أشرنا إليه، أو من المبتدأ - وهو (خبرُ الآحاد) - على القول بجوازه كما هو رأي سيبويه، وقيل: صفة؛ إن جُوِّزَ تقديرُ المتعلَّق معرفة، ولكن منعه الأكثرون» وانظر: قضاء الوطر في نزهة النظر (2/ 664). \n2. في و: «غيرِ» بكسر الرَّاء، والمثبت من د. \n3. في ح: «يتفاوت» بالياء. \n4. في د: «مسلمٌ» بالرَّفع، والمثبت من ج، و. قال القاري رحمه الله في شرح شرح نخبة الفكر (ص 282) -: «بالجرِّ؛ عطف على (البخاريِّ)، بحذف المضاف - في المتن -، وقد صرَّح في الشَّرحِ بهذا المحذوف». \n5. في د: «شُرُوطُهُمَا»، «ثُمَّ مُسْلِمٍ، ثُمَّ شَرْطُهُمَا» سقطت من هـ. \n6. في هـ: «فإن لم يَتِمَّ الضبطُ» بدل «فَإِنْ خَفَّ الضَّبْطُ». قال المصنِّف رحمه الله في نزهة النَّظر -: «فإنْ خفَّ الضبْطُ؛ أي: قلَّ». \n7. في ب: «فهو الحسن». \n8. في ج: «فلترددٍ»، وفي هـ: «فلا تردد». \n9. في ج: «التفردِ» بالجرِّ، والمثبت من د، و، ح. \n10. «وَإِلَّا» سقطت من ز. قال المصنِّف رحمه الله في نزهة النَّظر -: «وإلَّا إذا لم يحصل التَّردُّدُ».",
    "book_id": "616",
    "new_page_number": 53
  },
  {
    "serial_number": "3382345",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "وَزِيَادَةُ رَاوِيهِمَا (1) مَقْبُولَةٌ مَا لَمْ تَقَعْ مُنَافِيَةً لِمَنْ هُوَ أَوْثَقُ. فَإِنْ خُولِفَ بِأَرْجَحَ: فَالرَّاجِحُ المَحْفُوظُ؛ وَمُقَابِلُهُ: الشَّاذُّ. وَمَعَ الضَّعْفِ (2) : الرَّاجِحُ (3) المَعْرُوفُ؛ وَمُقَابِلُهُ: المُنْكَرُ.",
    "foot_note": "1. في هـ: «رواتهما»، وفي ز: «رواتها». \n2. في ب، د: «الضعيف». \n3. في ز: «فالراجح» بزيادة فاء، وهي ممَّا زاده المصنف في النُّزهة.",
    "book_id": "616",
    "new_page_number": 54
  },
  {
    "serial_number": "3382346",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "وَ الفَرْدُ (1) النِّسْبِيُّ: إِنْ وَافَقَهُ غَيْرُهُ: فَهُوَ (2) المُتَابِعُ (3) . وَإِنْ وُجِدَ مَتْنٌ يُشْبِهُهُ (4) : فَهُوَ الشَّاهِدُ. وَتَتَبُّعُ الطُّرُقِ (5) لِذَلِكَ: هُوَ الِاعْتِبَارُ.",
    "foot_note": "1. في هـ: «والمفرد». \n2. في ب: «هو» من غير فاء. \n3. في ز: «التَّابع»؛ وهو وهم، وفي هـ: «المتابَع» بفتح الباء، والضبط المثبت من ب، د، وهو الموافق لقول المصنِّف رحمه الله في نزهة النَّظر-: «بكسر الموحَّدة». \n4. في ز: «بشبهه»، وفي ح: «يشابهه». \n5. في ح: «الطرقُ» بالرَّفعِ؛ وهو وهم.",
    "book_id": "616",
    "new_page_number": 55
  },
  {
    "serial_number": "3382347",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "ثُمَّ  المَقْبُولُ: إِنْ سَلِمَ مِنَ المُعَارَضَةِ: فَهُوَ المُحْكَمُ. وَإِنْ عُورِضَ بِمِثْلِهِ: فَإِنْ أَمْكَنَ الجَمْعُ: فَهُوَ مُخْتَلِفُ (1) الحَدِيثِ. أَوْ ثَبَتَ (2) المُتَأَخِّرُ: فَهُوَ النَّاسِخُ، وَالآخَرُ المَنْسُوخُ، وَإِلَّا فَالتَّرْجِيحُ (3) ، ثُمَّ التَّوَقُّفُ.",
    "foot_note": "1. في ب، د، ح: «مختلَف» بفتح اللَّام، والمثبت من هـ. قال القاري رحمه الله في شرح شرح نخبة الفكر (ص 363) -: «(مختلِف): بكسر اللَّام؛ أي: مُخْتَلِفٌ مَدْلُولُ حَدِيثِه، ويناسبه ما يقابله: (فهو النَّاسخ)، وضَبَطَهُ بعضُهُم: بفتح اللَّام؛ مصدر ميمي، ويلائمه قوله فيما بعد: (فالترجيح)». \n2. في هـ: «يثبت»، وفي ح: «وإن ثبت». قال المصنِّف رحمه الله في نزهة النَّظر -: «فإن عرف وثبت المتأخر به \n…. ». \n3. في و: «فيُرجَّح»، وفي ب: «وإلَّا فلا» بدل «وَإِلَّا فَالتَّرْجِيحُ». قال المصنِّف رحمه الله في نزهة النَّظر -: «فالتَّرجيح إن تعين».",
    "book_id": "616",
    "new_page_number": 56
  },
  {
    "serial_number": "3382348",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "* ثُمَّ  المَرْدُودُ: إِمَّا أَنْ يَكُونَ لِسَقْطٍ (1) أَوْ طَعْنٍ. فَالسَّقْطُ (2) : إِمَّا (3) أَنْ يَكُونَ مِنْ (4) مَبَادِئِ السَّنَدِ مِنْ مُصَنِّفٍ (5) ، أَوْ مِنْ آخِرِهِ بَعْدَ التَّابِعِيِّ، أَوْ (6) غَيْرِ ذَلِكَ. فَالأَوَّلُ: المُعَلَّقُ. وَالثَّانِي: المُرْسَلُ. وَالثَّالِثُ: إِنْ كَانَ بِاثْنَيْنِ فَصَاعِداً مَعَ التَّوَالِي: فَهُوَ المُعْضَلُ، وَإِلَّا فَالمُنْقَطِعُ. ثُمَّ قَدْ يَكُونُ وَاضِحاً أَوْ خَفِيّاً: فَالأَوَّلُ: يُدْرَكُ بِعَدَمِ التَّلَاقِي، وَمِنْ ثَمَّ احْتِيجَ إِلَى التَّارِيخِ. وَالثَّانِي: المُدَلَّسُ، وَيَرِدُ بِصِيغَةٍ تَحْتَمِلُ (7) اللُّقِيَّ (8) : كَـ «عَنْ»، وَ «قَالَ». وَكَذَا المُرْسَلُ الخَفِيُّ مِنْ مُعَاصِرٍ لَمْ يَلْقَ (9) .",
    "foot_note": "1. في ب، د: «لسَقَطٍ» بفتح القاف، والصَّواب إسكان القاف، انظر: شرح شرح النُّخبة (ص 388) للقاري، وفي ح: «لِسِقْطٍ» بكسر السِّين، والمثبت من و. \n2. في ب، د: «فَالسَّقَطُ» بفتح القاف. \n3. «إِمَّا» سقطت من ز. \n4. في و: من قوله: «فَالسَّقْطُ» إلى هنا لم يظهر بسبب الترميم. \n5. في ز: «منصف» وهو تحريف. \n6. في ب زيادة: «مِنْ». \n7. في ب: «تحتمل، يحتمل» بالتاء والياء معاً. قال المصنِّف رحمه الله في نزهة النَّظر -: «ويَرِدُ المدلَّس بصيغةٍ من صِيَغِ الأداء تحتملُ وقوعَ اللِّقَاءِ». \n8. في هـ: «اللقاء». \n9. في د: «يُلْقَ» بضم الياء، و «مِن مُعَاصِرٍ لَمْ يَلْقَ» سقطت من ح، والمثبت من ب.",
    "book_id": "616",
    "new_page_number": 57
  },
  {
    "serial_number": "3382349",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "ثُمَّ الطَّعْنُ: إِمَّا أَنْ (1) يَكُونَ لِكَذِبِ الرَّاوِي، أَوْ تُهَمَتِهِ بِذَلِكَ، أَوْ فُحْشِ غَلَطِهِ، أَوْ غَفْلَتِهِ، أَوْ فِسْقِهِ، أَوْ وَهْمِهِ (2) ، أَوْ مُخَالَفَتِهِ، أَوْ جَهَالَتِهِ (3) ، أَوْ بِدْعَتِهِ، أَوْ سُوءِ حِفْظِهِ. فَالأَوَّلُ: المَوْضُوعُ. وَالثَّانِي: المَتْرُوكُ (4) . وَالثَّالِثُ: المُنْكَرُ - عَلَى رَأْيٍ -. وَكَذَا الرَّابِعُ وَالخَامِسُ. ثُمَّ الوَهْمُ: إِنِ اطُّلِعَ عَلَيْهِ بِالقَرَائِنِ، وَجَمْعِ الطُّرُقِ: فَالمُعَلَّلُ (5) .",
    "foot_note": "1. «أَنْ» سقطت من ز. \n2. تنبيه: قال اللَّقاني - في قضاء الوطر (3/ 1019) -: «فالظَّاهر أنَّ (الوَهمَ) هُنَا: بِمَعنَى ذَهَابِ الوَهْمِ لما يُرَادُ غيرُه؛ لا بِمَعنَى الغَلَطِ، وَلا بِمَعنَى الإِسقَاطِ، وإِلَّا كانَ الوَاجِبُ أَن يُعَبِّرَ بِالإيهَامِ، أو يَلزَمَ التَّكرَارُ مَعَ ذِكْرِ الغَلَطِ، وَعِندَ تَأَمُّلِ قَولِ الشَّارِحِ: بأن يروي \n…. إلخ؛ لا يَتَوَجَّهُ إرَادَةُ شَيءٍ مِن هَذِهِ المَعَانِي البَتَّةَ؛ فليُتَأَمَّل فيه جِدّاً». \n3. في هـ، ح: «جهالة حاله»، والمُثْبَت مُوَافِقٌ لشرح المُصنِّف. \n4. في ز: «المترك»؛ وهو تصحيف. \n5. في د: «المعلَّلِ» بالجرِّ؛ وهو خطأ.",
    "book_id": "616",
    "new_page_number": 58
  },
  {
    "serial_number": "3382350",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "ثُمَّ  المُخَالَفَةُ: إِنْ كَانَتْ (1) بِتَغْيِيرِ (2) السِّيَاقِ: فَمُدْرَجُ (3) الإِسْنَادِ. أَوْ بِدَمْجِ (4) مَوْقُوفٍ (5) بِمَرْفُوعٍ: فَمُدْرَجُ المَتْنِ. أَوْ بِتَقْدِيمٍ وَتَأْخِيرٍ (6) : فَالمَقْلُوبُ. أَوْ بِزِيَادَةِ رَاوٍ: فَالمَزِيدُ فِي مُتَّصِلِ الأَسَانِيدِ (7) . أَوْ بِإِبْدَالِهِ وَلَا مُرَجِّحَ: فَالمُضْطَرِبُ، وَقَدْ (8) يَقَعُ الإِبْدَالُ عَمْداً امْتِحَاناً. أَوْ بِتَغْيِيرِ (9) حُرُوفٍ مَعَ بَقَاءِ السِّيَاقِ: فَالمُصَحَّفُ وَالمُحَرَّفُ (10) . وَلَا يَجُوزُ تَعَمُّدُ تَغْيِيرِ (11) المَتْنِ بِالنَّقْصِ وَالمُرَادِفِ، إِلَّا لِعَالِمٍ (12) بِمَا يُحِيلُ (13) المَعَانِيَ. فَإِنْ خَفِيَ المَعْنَى: احْتِيجَ إِلَى شَرْحِ الغَرِيبِ، وَبَيَانِ المُشْكِلِ (14) .",
    "foot_note": "1. «إِنْ كَانَتْ» سقطت من و. \n2. في ز: «بتغير». قال المصنِّف رحمه الله في نزهة النَّظر -: «الواقِعُ فيه ذلك التَّغْيِيرُ هو: مُدْرَجُ الإِسناد». \n3. في ز: «ومدرج». \n4. في ح: «بدمجٍ» بالجرِّ المنوَّن؛ وهو خطأ. \n5. في هـ: «موقوفاً»؛ وهو وهم. \n6. في و، د: «أو تأخير». \n7. في هـ: «المسانيد»، وفي ز: «الإسناد». \n8. «وَقَدْ» سقطت من ز. \n9. في و: «تغييرُ» من غير باء، وفي ز: «بتغير». قال المصنِّف رحمه الله في نزهة النَّظر -: «أو إِن كانت المُخَالَفَةُ بِتَغْيِيرِ حَرْفٍ أَو حُرُوفٍ». \n10. في ز: «فالمحرف». \n11. في ز: «التغيير بالنقص» بدل «تَغْيِيرِ المَتْنِ بِالنَّقْصِ»، و «تَغْيِيرِ» سقطت من و، وكتب في حاشيتها: «لعلها: تعمد تغيير». \n12. في و: «للعالم». \n13. في ح: «يَحِيلُ» بفتحِ الياء؛ وهو خطأ. \n14. في ز زيادة: «منها»، وفي هـ: مكانها بياض، وهي من ضمن نزهة النَّظر.",
    "book_id": "616",
    "new_page_number": 59
  },
  {
    "serial_number": "3382351",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "ثُمَّ  الجَهَالَةُ: وَسَبَبُهَا: أَنَّ الرَّاوِيَ قَدْ تَكْثُرُ نُعُوتُهُ فَيُذْكَرُ بِغَيْرِ مَا اشْتُهِرَ (1) بِهِ لِغَرَضٍ، وَصَنَّفُوا فِيهِ المُوضِحَ (2) . وَقَدْ (3) يَكُونُ مُقِلّاً فَلَا يَكْثُرُ (4) الأَخْذُ عَنْهُ، وَصَنَّفُوا فِيهِ (5) الوُحْدَانَ (6) . أَوْ لَا يُسَمَّى (7) اخْتِصَاراً، وَفِيهِ المُبْهَمَاتُ، وَلَا يُقْبَلُ المُبْهَمُ وَلَوْ أُبْهِمَ بِلَفْظِ التَّعْدِيلِ (8) - عَلَى الأَصَحِّ -. فَإِنْ سُمِّيَ (9) وَانْفَرَدَ وَاحِدٌ (10) عَنْهُ: فَمَجْهُولُ العَيْنِ (11) . أَوِ اثْنَانِ (12) فَصَاعِداً، وَلَمْ (13) يُوَثَّقْ: فَمَجْهُولُ الحَالِ، وَهُوَ المَسْتُورُ (14) .",
    "foot_note": "1. في ب، د، هـ: «ما اشتَهَر» بفتح التاء والهاء، ولم تُشكَّل في بقية النسخ. \n2. من قوله: «قد تكثر نعوته فيذكر \n…. » إلى هنا ساقط من ج. \n3. في ج: «قد» من غير واو. \n4. في و: «فلا يُكْثِرُ» بضم الياء وكسر الثاء، والمثبت من د. \n5. في ج، د، هـ: «وفيه» بدل «وَصَنَّفُوا فِيهِ»، قال المُصنِّف رحمه الله في نزهة النَّظر -: «وقد صَنَّفُوا فيه الوُحْدَان». \n6. في ز: «الواحدان». \n7. في هـ: «أو لا ويسمى». قال المصنِّف رحمه الله في نزهة النَّظر -: «أو لا يُسَمَّى الرَّاوي - اختصاراً - مِنَ الرَّاوي عنه». \n8. في و: «تعديل». \n9. في ز زيادة: «رَاوٍ»؛ وهي من ضمن نزهة النظر بلفظ: «الراوي». \n10. في ج: «وأخذ»؛ وهو تصحيف، وفي ب: «راوٍ» بدل «وَاحِدٌ»، وفي نسخة على حاشيتها: «واحد»، والضبط المثبت من د، هـ، و. قال المصنِّف رحمه الله في نزهة النَّظر -: «وانْفَرَدَ راوٍ واحدٌ بالرواية». \n11. «العَيْنِ» سقطت من ب. \n12. في هـ: «واثنان». قال المصنِّف رحمه الله في نزهة النَّظر -: «أو إن روى عنه اثْنان فصاعداً». \n13. في ح: «أو لم». \n14. «وَهُوَ المَسْتُورُ» سقطت من ب.",
    "book_id": "616",
    "new_page_number": 60
  },
  {
    "serial_number": "3382352",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "ثُمَّ  البِدْعَةُ: إِمَّا (1) بِمُكَفِّرٍ (2) ، أَوْ بِمُفَسِّقٍ (3) . فَالأَوَّلُ: لَا يَقْبَلُ صَاحِبَهَا (4) الجُمْهُورُ (5) . وَالثَّانِي: يُقْبَلُ مَنْ (6) لَمْ يَكُنْ دَاعِيَةً - فِي الأَصَحِّ -، إِلَّا إِنْ رَوَى (7) مَا يُقَوِّي بِدْعَتَهُ فَيُرَدُّ - عَلَى المُخْتَارِ -، وَبِهِ صَرَّحَ الجُوزَجَانِيُّ (8) - شَيْخُ النَّسَائِيِّ -.",
    "foot_note": "1. في ب زيادة: «أن تكون». \n2. في هـ، ز: «بكفرٍ» \n3. في هـ: «أو بفسقٍ». \n4. في ب: «لا يقبلُه» بدل «لَا يَقْبَلُ صَاحِبَهَا». \n5. في ز: «المجهول»؛ وهو تصحيف، وفي ب زيادة: «وقيل: يقبل». \n6. في ح: «ما». \n7. في ب، و: «يروي». \n8. في د: «الجَوْزَجَانِيُّ» بفتح الجيم، والمثبت من ح. قال ابن رسلان رحمه الله في شرح سنن أبي داود (12/ 372) -: «(الجُوزَجاني) بضم الجيم الأولى، وفتح الزاي والجيم المخففتين، وبعد الألف نون؛ نسبة إلى مدينة بخُراسان مما يلي بلخ؛ يقال لها: جُوزجان»، وانظر: شرح شرح النخبة للقاري (ص 531).",
    "book_id": "616",
    "new_page_number": 61
  },
  {
    "serial_number": "3382353",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "ثُمَّ  سُوءُ الحِفْظِ: إِنْ كَانَ لَازِماً فَالشَّاذُّ - عَلَى رَأْيٍ -، أَوْ طَارِئاً فَالمُخْتَلِطُ (1) . وَمَتَى (2) تُوبِعَ السَّيِّئُ (3) الحِفْظِ بِمُعْتَبَرٍ (4) - وَكَذَا المَسْتُورُ (5) ، وَالمُرْسَلُ، وَالمُدَلَّسُ -: صَارَ حَدِيثُهُمْ حَسَناً؛ لَا لِذَاتِهِ، بَلْ بِالمَجْمُوعِ.",
    "foot_note": "1. في هـ: «فالمختلف»؛ وهو تصحيف، وفي ب، د: «فالمختلَطُ» بفتح اللَّام، والضبط المثبت من و. قال المصنِّف رحمه الله في نزهة النَّظر -: «فهذا هو المختلط». \n2. في هـ: «وإذا». \n3. في د: «سيئ». \n4. في هـ: «فمعتبرٌ»، قال المصنِّف رحمه الله في نزهة النَّظر -: «ومتى تُوبِعَ السَّيِّئُ الحِفْظِ بِمُعْتَبَرٍ - كَأَنْ يَكُونَ فَوْقَهُ أَوْ مِثْلَهُ لَا دُونَه \n…. -». \n5. في هـ: «المشهور»، وفي ب: «وكذا المختلط والمستور» بدل «وَكَذَا المَسْتُورُ».",
    "book_id": "616",
    "new_page_number": 62
  },
  {
    "serial_number": "3382354",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "* ثُمَّ  الإِسْنَادُ: إِمَّا أَنْ يَنْتَهِيَ إِلَى النَّبِيِّ صلى الله عليه وسلم تَصْرِيحاً، أَوْ حُكْماً (1) : مِنْ قَوْلِهِ (2) ، أَوْ فِعْلِهِ، أَوْ تَقْرِيرِهِ. أَوْ إِلَى الصَّحَابِيِّ كَذَلِكَ، وَهُوَ: مَنْ لَقِيَ النَّبِيَّ صلى الله عليه وسلم (3) مُؤْمِناً بِهِ وَمَاتَ عَلَى الإِسْلَامِ - وَلَوْ تَخَلَّلَتْ رِدَّةٌ فِي (4) الأَصَحِّ (5) -. أَوْ إِلَى التَّابِعِيِّ، وَهُوَ: مَنْ لَقِيَ الصَّحَابِيَّ كَذَلِكَ. فَالأَوَّلُ (6) : المَرْفُوعُ (7) . وَالثَّانِي: المَوْقُوفُ (8) . وَالثَّالِثُ: المَقْطُوعُ - وَمَنْ (9) دُونَ التَّابِعِيِّ (10) فِيهِ: مِثْلُهُ -. وَيُقَالُ لِلْأَخِيرَيْنِ: الأَثَرُ (11) .",
    "foot_note": "1. في هـ: «كناية». قال المصنِّف رحمه الله في نزهة النَّظر -: «ومثال المرفوع من القول حكماً لا تصريحاً». \n2. في أ، ز زيادة: «صلى الله عليه وسلم»، و «مِنْ قَوْلِهِ» سقطت من هـ. \n3. «النَّبِيَّ صلى الله عليه وسلم» سقطت من ز. \n4. في و، ح: «على». \n5. «فِي الأَصَحِّ» سقطت من هـ. \n6. في ب: «والأول»، و «فَالأَوَّلُ» سقطت من ز. \n7. في هـ: «مرفوع». \n8. في هـ: «موقوف». \n9. في ح: «مِن» بكسر الميم؛ وهو خطأ. \n10. في ج: «الصحابي». قال المصنِّف رحمه الله في نزهة النَّظر -: «ومَن دون التَّابعيِّ - من أتباع التَّابعين فمَن بعدَهُم -». \n11. «وَيُقَالُ لِلْأَخِيرَيْنِ: الأَثَرُ» سقطت من ز.",
    "book_id": "616",
    "new_page_number": 63
  },
  {
    "serial_number": "3382355",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "* وَ المُسْنَدُ: مَرْفُوعُ صَحَابِيٍّ بِسَنَدٍ ظَاهِرُهُ الِاتِّصَالُ. فَإِنْ قَلَّ عَدَدُهُ: فَإِمَّا أَنْ يَنْتَهِيَ (1) إِلَى النَّبِيِّ صلى الله عليه وسلم، أَوْ إِلَى إِمَامٍ ذِي صِفَةٍ عَلِيَّةٍ كَـ «شُعْبَةَ». فَالأَوَّلُ: العُلُوُّ المُطْلَقُ. وَالثَّانِي: العُلُوُّ (2) النِّسْبِيُّ. وَفِيهِ المُوَافَقَةُ؛ وَهِيَ (3) : الوُصُولُ إِلَى شَيْخِ أَحَدِ المُصَنِّفِينَ مِنْ غَيْرِ طَرِيقِهِ. وَالبَدَلُ (4) ؛ وَهُوَ: الوُصُولُ إِلَى شَيْخِ شَيْخِهِ كَذَلِكَ (5) . وَالمُسَاوَاةُ (6) ؛ وَهِيَ: اسْتِوَاءُ عَدَدِ (7) الإِسْنَادِ (8) مِنَ الرَّاوِي إِلَى آخِرِهِ، مَعَ إِسْنَادِ أَحَدِ المُصَنِّفِينَ. وَالمُصَافَحَةُ (9) ؛ وَهِيَ: الِاسْتِوَاءُ مَعَ تِلْمِيذِ ذَلِكَ المُصَنِّفِ. وَيُقَابِلُ العُلُوَّ بِأَقْسَامِهِ (10) : النُّزُولُ.",
    "foot_note": "1. في هـ، ح: «يكون»، وفي شرح المصنِّف: «ينتهي». \n2. «العُلُوُّ» سقطت من ب، ز. \n3. في هـ: «وهو». \n4. في ب، ز، ح: «وفيه البدل»، وهي من ضمن نزهة النَّظر، وكذا الموضعان الآتيان. \n5. «كَذَلِكَ» سقطت من و. \n6. في ب، ز: «وفيه المساواة». \n7. في ج: «عددُ» بضم الدَّال؛ وهو وهم؛ لأنه مضاف إليه مجرور. \n8. في ج: «الإسنادين»، وفي و: «الأسانيد»، وفي نزهة النَّظر: «الإسناد». \n9. في ب، ز: «وفيه المصافحة». \n10. في ز: «بأقسام». قال المصنِّف رحمه الله في نزهة النَّظر -: «ويقابل العلو بأقسامه المذكورة».",
    "book_id": "616",
    "new_page_number": 64
  },
  {
    "serial_number": "3382356",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "فَإِنْ تَشَارَكَ الرَّاوِي وَمَنْ رَوَى عَنْهُ فِي السِّنِّ وَاللُّقِيِّ (1) فَهُوَ: الأَقْرَانُ (2) . وَإِنْ رَوَى كُلٌّ مِنْهُمَا عَنِ الآخَرِ: فَالمُدَبَّجُ (3) . وَإِنْ رَوَى (4) عَمَّنْ (5) دُونَهُ: فَالأَكَابِرُ عَنِ الأَصَاغِرِ، وَمِنْهُ (6) : الآبَاءُ عَنِ الأَبْنَاءِ؛ وَفِي عَكْسِهِ كَثْرَةٌ (7) ، وَمِنْهُ (8) : مَنْ رَوَى عَنْ أَبِيهِ عَنْ جَدِّهِ (9) . وَإِنِ (10) اشْتَرَكَ اثْنَانِ عَنْ شَيْخٍ، وَتَقَدَّمَ مَوْتُ أَحَدِهِمَا؛ فَهُوَ: السَّابِقُ وَاللَّاحِقُ. وَإِنْ رَوَى عَنِ اثْنَيْنِ مُتَّفِقَيْ الِاسْمِ، وَلَمْ يَتَمَيَّزَا (11) : فَبِاخْتِصَاصِهِ (12) بِأَحَدِهِمَا يَتَبَيَّنُ (13) المُهْمَلُ.",
    "foot_note": "1. في ج: «أو اللُّقي»، وفي د، و، ح: «أو في اللُّقي»، وفي هـ: «أو في اللقاء». قال المصنِّف رحمه الله في نزهة النَّظر -: «واللُّقِيُّ: وهو الأخذ عن المشايخ». \n2. في هـ: «الإقرار»؛ وهو تصحيف. قال المصنِّف رحمه الله في نزهة النَّظر -: «فهو النَّوع الذي يُقال له: رواية الأَقْرَان؛ لأنه حينئذٍ يكون رَوَى عن قَرِينِه». \n3. في و: «فهو المُدَبَّجُ». \n4. «رَوَى» سقطت من ز. \n5. في و زيادة: «هو». \n6. في ب: «وفيه». \n7. في ح: «كثيرة»؛ وهو وهَم. \n8. في هـ: «ومنهم»؛ وهو وهَم. \n9. «وَمِنْهُ: مَنْ رَوَى عَنْ أَبِيهِ عَنْ جَدِّهِ» سقطت من ز. \n10. في هـ: «فإن». \n11. في و: «يُميَّزا»، و «وَلَمْ يَتَمَيَّزَا» سقطت من ب. \n12. في ز: «فبانخفاضه»؛ وهو وهَم. \n13. في ز: «بتبين»؛ وهو تصحيف.",
    "book_id": "616",
    "new_page_number": 65
  },
  {
    "serial_number": "3382357",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "وَإِنْ جَحَدَ الشَّيْخُ مَرْوِيَّهُ جَزْماً: رُدَّ، أَوِ احْتِمَالاً (1) : قُبِلَ - فِي الأَصَحِّ -، وَفِيهِ: مَنْ حَدَّثَ وَنَسِيَ. وَإِنِ اتَّفَقَ (2) الرُّوَاةُ فِي صِيَغِ الأَدَاءِ، أَوْ غَيْرِهَا مِنَ الحَالَاتِ (3) ؛ فَهُوَ المُسَلْسَلُ.",
    "foot_note": "1. في د: «واحْتِمَالاً». \n2. في ب: «اتفقت». \n3. في ح: «الأحوال».",
    "book_id": "616",
    "new_page_number": 66
  },
  {
    "serial_number": "3382358",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "* وَ صِيَغُ الأَدَاءِ (1) : «سَمِعْتُ» وَ «حَدَّثَنِي»، ثُمَّ «أَخْبَرَنِي»، وَ «قَرَأْتُ عَلَيْهِ»، ثُمَّ «قُرِئَ عَلَيْهِ وَأَنَا أَسْمَعُ»، ثُمَّ «أَنْبَأَنِي»، ثُمَّ «نَاوَلَنِي»، ثُمَّ «شَافَهَنِي»، ثُمَّ «كَتَبَ إِلَيَّ»، ثُمَّ «عَنْ» وَنَحْوُهَا. فَالأَوَّلَانِ: لِمَنْ سَمِعَ وَحْدَهُ مِنْ لَفْظِ الشَّيْخِ، فَإِنْ جُمِعَ فَمَعَ غَيْرِهِ (2) . وَأَوَّلُهَا: أَصْرَحُهَا (3) وَأَرْفَعُهَا فِي الإِمْلَاءِ. وَالثَّالِثُ، وَالرَّابِعُ: لِمَنْ قَرَأَ بِنَفْسِهِ. فَإِنْ جُمِعَ: فَهُوَ كَالخَامِسِ (4) . وَالإِنْبَاءُ (5) : بِمَعْنَى الإِخْبَارِ (6) ، إِلَّا فِي عُرْفِ المُتَأَخِّرِينَ؛ فَهُوَ (7) لِلْإِجَازَةِ (8) كَـ «عَنْ». وَعَنْعَنَةُ المُعَاصِرِ مَحْمُولَةٌ (9) عَلَى السَّمَاعِ إِلَّا مِنَ المُدَلِّسِ (10) ، وَقِيلَ: يُشْتَرَطُ ثُبُوتُ لِقَائِهِمَا (11) وَلَوْ مَرَّةً (12) - وَهُوَ المُخْتَارُ -.",
    "foot_note": "1. في د: «الآداء» بالمدِّ. \n2. في هـ: «جماعة» بدل «غَيْرِهِ». قال المصنِّف رحمه الله في نزهة النَّظر -: «(فإن جمع) الرَّاوي أي: \n…. فهو دَلِيلٌ على أَنَّه سَمِعَ منه مَعَ غَيرِهِ، وقد تَكونُ النُّونُ لِلعَظَمة لكن بِقِلَّةٍ». \n3. في هـ: «أصرح». \n4. في و: «الخامس». \n5. في هـ: «الإنباء» بالرَّفع والجرِّ؛ والجرُّ وهمٌ، والمثبت من د. \n6. في د: «والإنباءُ كالإخبار» بدل «وَالإِنْبَاءُ: بِمَعْنَى الإِخْبَارِ». \n7. في ز: «فإنه». \n8. في هـ، و: «الإجازة». \n9. في ج: «محمول». \n10. في و: «مدلِّس»، وفي هـ: «المدلَّس» بفتح اللَّام، والضَّبط المثبت من ب، د، و. \n11. في ز: «لقائها». قال المصنِّف رحمه الله في نزهة النَّظر -: «لقائهما؛ أي: الشيخ، والراوي عنه». \n12. في و: «مرةٌ» بالرفع، والمثبت من ج، د.",
    "book_id": "616",
    "new_page_number": 67
  },
  {
    "serial_number": "3382359",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "وَأَطْلَقُوا المُشَافَهَةَ (1) فِي الإِجَازَةِ المُتَلَفَّظِ بِهَا، وَالمُكَاتَبَةَ فِي الإِجَازَةِ (2) المَكْتُوبِ بِهَا. وَاشْتَرَطُوا فِي صِحَّةِ المُنَاوَلَةِ: اقْتِرَانَهَا بِالإِذْنِ بِالرِّوَايَةِ - وَهِيَ أَرْفَعُ أَنْوَاعِ الإِجَازَةِ -. وَكَذَا اشْتَرَطُوا: الإِذْنَ (3) فِي الوِجَادَةِ، وَالوَصِيَّةِ بِالكِتَابِ (4) ، وَالإِعْلَامِ (5) ، وَإلَّا فَلَا عِبْرَةَ بِذَلِكَ - كَالإِجَازَةِ العَامَّةِ، وَلِلْمَجْهُولِ (6) وَالمَعْدُومِ (7) - عَلَى الأَصَحِّ فِي جَمِيعِ ذَلِكَ.",
    "foot_note": "1. في هـ: «المشافِهة» بكسر الفاء؛ وهو خطأ. \n2. في و: «والإجازة» بدل «فِي الإِجَازَةِ»؛ وهو وَهَمٌ. \n3. «الإِذْنَ» سقطت من و. \n4. في هـ: «بالكتب». \n5. في ح: «وفي الإعلام». \n6. في د، هـ، و، ز: «والمجهول». قال المصنِّف رحمه الله في نزهة النَّظر -: «وكذا الإِجَازَةُ لِلمَجهُول». \n7. في ب، ح: «وللمعدوم»، وزيادة لام الجرِّ من ضمن نزهة النَّظر.",
    "book_id": "616",
    "new_page_number": 68
  },
  {
    "serial_number": "3382360",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "* ثُمَّ الرُّوَاةُ إِنِ اتَّفَقَتْ أَسْمَاؤُهُمْ، وَأَسْمَاءُ آبَائِهِمْ فَصَاعِداً (1) ، وَاخْتَلَفَتْ أَشْخَاصُهُمْ: فَهُوَ المُتَّفِقُ وَالمُفْتَرِقُ. وَإِنِ (2) اتَّفَقَتِ الأَسْمَاءُ خَطّاً، وَاخْتَلَفَتْ نُطْقاً: فَهُوَ المُؤْتَلِفُ وَالمُخْتَلِفُ. وَإِنِ اتَّفَقَتِ الأَسْمَاءُ وَاخْتَلَفَتِ (3) الآبَاءُ، أَوْ بِالعَكْسِ: فَهُوَ المُتَشَابِهُ (4) ، وَكَذَا إِنْ وَقَعَ ذَلِكَ (5) الِاتِّفَاقُ فِي الِاسْمِ وَاسْمِ الأَبِ (6) ، وَالِاخْتِلَافُ فِي النِّسْبَةِ (7) . وَيَتَرَكَّبُ (8) مِنْهُ وَمِمَّا قَبْلَهُ أَنْوَاعٌ؛ مِنْهَا: أَنْ يَحْصُلَ الِاتِّفَاقُ أَوْ الِاشْتِبَاهُ (9) ، إِلَّا فِي حَرْفٍ أَوْ حَرْفَيْنِ، أَوْ بِالتَّقْدِيمِ وَالتَّأْخِيرِ (10) ، وَنَحْوِ (11) ذَلِكَ.",
    "foot_note": "1. «فَصَاعِداً» سقطت من هـ، ح. \n2. في ب: «فإن». \n3. في ز: «اختلف». \n4. في ج: «المشابه»؛ وهو تصحيف. \n5. «ذَلِكَ» سقطت من ح. \n6. في ج، د: «اسمٍ واسمِ أبٍ» بدل «فِي الِاسْمِ وَاسْمِ الأَبِ». \n7. «وَكَذَا إِنْ وَقَعَ ذَلِكَ الِاتِّفَاقُ فِي الِاسْمِ وَاسْمِ الأَبِ، وَالِاخْتِلَافُ فِي النِّسْبَةِ» سقطت من ب، ز. \n8. في ج، د، ز: «ويركب». قال المصنِّف رحمه الله في نزهة النَّظر -: «ويتركب منه». \n9. في هـ: «والاشتباه». \n10. في ب، هـ، و: «أو التأخير». \n11. في و، ز: «أو نحو».",
    "book_id": "616",
    "new_page_number": 69
  },
  {
    "serial_number": "3382361",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "خَاتِمَةٌ (1) * وَمِنَ المُهِمِّ:  مَعْرِفَةُ طَبَقَاتِ الرُّوَاةِ وَمَوَالِيدِهِمْ، وَوَفَيَاتِهِمْ (2) ، وَبُلْدَانِهِمْ، وَأَحْوَالِهِمْ - تَعْدِيلاً، وَتَجْرِيحاً، وَجَهَالَةً -. وَمَرَاتِبِ الجَرْحِ (3) : وَأَسْوَأُهَا: الوَصْفُ بِأَفْعَلَ (4) ؛ كَـ «أَكْذَبِ النَّاسِ» (5) ، ثُمَّ «دَجَّالٌ»، أَوْ «وَضَّاعٌ»، أَوْ «كَذَّابٌ» (6) . وَأَسْهَلُهَا: «لَيِّنٌ»، أَوْ «سَيِّئُ الحِفْظِ»، أَوْ «فِيهِ أَدْنَى (7) مَقَالٍ (8) ». وَمَرَاتِبِ (9) التَّعْدِيلِ: وَأَرْفَعُهَا: الوَصْفُ بِأَفْعَلَ؛ كَـ «أَوْثَقِ (10) النَّاسِ» (11) .",
    "foot_note": "1. «خَاتِمَةٌ» سقطت من ح، ومكانها بياض. \n2. في هـ: «ووفاتهم»، وفي ب: «معرفة طباق المحدثين ومواليهم وقبائلهم» بدل «مَعْرِفَةُ طَبَقَاتِ الرُّوَاةِ وَمَوَالِيدِهِمْ، وَوَفَيَاتِهِمْ». \n3. إلى هنا ينتهي الخرم في أ. \n4. في هـ: «ما فيه مبالغة» بدل «الوَصْفُ بِأَفْعَلَ». قال المصنِّف رحمه الله في نزهة النَّظر -: «وأَسْوَأُهَا: الوَصْفُ بما دلَّ على المُبَالَغَةِ». \n5. في هـ: «كاذب الناس»، وفي د: «كأكذبَ الناسِ» بالنَّصب؛ وهو وهم. \n6. في هـ: «ثم ما تأكد ككذَّابٍ دجَّال ثم هذا بلا تأكيد» بدل «ثُمَّ دَجَّالٌ، أَوْ وَضَّاعٌ، أَوْ كَذَّابٌ»، ولم يذكرها المصنِّف في نزهة النَّظر. \n7. في و: «أو وأدنى» بدل «أَوْ فِيهِ أَدْنَى»، وفي ز: «وفيه أدنى»، و «أَدْنَى» سقطت من ح. \n8. في هـ: «مقالٌ» بالرَّفع المنوَّن، والضبط المثبت من أ، ج، د، و. \n9. في و: «ومراتبُ» بالرَّفع، والمثبت من أ، د. \n10. في د: «أوثق» بالجرِّ والنَّصب، والمثبت من أ، و. \n11. في هـ: «وأرفعها ما فيه مبالغةٌ: كأدين الناس» بدل «وَأَرْفَعُهَا: الوَصْفُ بِأَفْعَلَ: كَأَوْثَقِ النَّاسِ»، ولم يذكرها المصنِّف في نزهة النَّظر.",
    "book_id": "616",
    "new_page_number": 70
  },
  {
    "serial_number": "3382362",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "ثُمَّ مَا تَأَكَّدَ (1) بِصِفَةٍ (2) أَوْ صِفَتَيْنِ (3) كَـ «ثِقَةٍ ثِقَةٍ»، أَوْ «ثِقَةٍ حَافِظٍ» (4) . وَأَدْنَاهَا: مَا أَشْعَرَ بِالقُرْبِ مِنْ أَسْهَلِ التَّجْرِيحِ؛ كَـ «شَيْخٍ». وَتُقْبَلُ التَّزْكِيَةُ مِنْ عَارِفٍ بِأَسْبَابِهَا، وَلَوْ مِنْ وَاحِدٍ - عَلَى (5) الأَصَحِّ -. وَالجَرْحُ مُقَدَّمٌ عَلَى التَّعْدِيلِ إِنْ صَدَرَ مُبَيَّناً (6) مِنْ عَارِفٍ بِأَسْبَابِهِ، فَإِنْ خَلَا عَنْ تَعْدِيلٍ قُبِلَ (7) مُجْمَلاً - عَلَى المُخْتَارِ-.",
    "foot_note": "1. في هـ: «وما تأكد»، وفي و: «ثم تأكدٌ» بدل «ثُمَّ مَا تَأَكَّدَ»، والمُثْبَتُ موافق لنزهة النَّظر. \n2. في ج: «بصفةِ» بكسرة واحدة؛ وهو خطأ، والمثبت من د، و. \n3. «بِصِفَةٍ أَوْ صِفَتَيْنِ» سقطت من هـ. \n4. في هـ: «كثقة حافظ، أو ثقة ثقة» بتقديم وتأخير. \n5. «عَلَى» سقطت من ب، وفي مكانها بياض. \n6. في ح: «مُبَيِّنًا» بكسر الياء، و «مُبَيَّناً» سقطت من هـ، ز، والمثبت من ب، و. \n7. «قُبِلَ» سقطت من ز.",
    "book_id": "616",
    "new_page_number": 71
  },
  {
    "serial_number": "3382363",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "* وَ مَعْرِفَةُ كُنَى المُسَمَّيْنَ (1) ، وَأَسْمَاءِ المُكَنَّيْنَ (2) . وَمَنِ اسْمُهُ كُنْيَتُهُ. وَمَنْ كَثُرَتْ كُنَاهُ أَوْ نُعُوتُهُ. وَمَنْ وَافَقَتْ كُنْيَتُهُ اسْمَ أَبِيهِ، أَوْ بِالعَكْسِ (3) ، أَوْ كُنْيَتُهُ (4) كُنْيَةَ زَوْجَتِهِ. وَمَنْ نُسِبَ إِلَى غَيْرِ أَبِيهِ (5) ، أَوْ (6) إِلَى (7) غَيْرِ مَا يَسْبِقُ إِلَى (8) الفَهْمِ (9) . وَمَنِ اتَّفَقَ (10) اسْمُهُ وَاسْمُ أَبِيهِ وَجَدِّهِ (11) ، أَوْ وَاسْمُ (12) شَيْخِهِ وَشَيْخِ شَيْخِهِ فَصَاعِداً. وَمَنِ اتَّفَقَ اسْمُ شَيْخِهِ وَالرَّاوِي عَنْهُ.",
    "foot_note": "1. في ج: «المسميين» بياءين، وفي هـ، ز: «المسلمين»؛ وهو تصحيف، وفي د: «المسمِّين» بكسر الميم الثانية، والمثبت من أ، و. \n2. في ج، هـ: «المكنيين» بياءين، وفي ب: «المَكْنِينَ» بفتح الميم وسكون الكاف وكسر النون، والمثبت من أ، د، و. \n3. في ج، هـ: «العكس». \n4. «كُنْيَتُهُ» سقطت من أ. \n5. في ب، ز زيادة: «كالمقداد ابن الأسود»، وهي من ضمن نزهة النَّظر. \n6. في أ، زيادة: «نُسِبَ». \n7. «إِلَى» سقطت من د. \n8. «إِلَى» سقطت من أ. \n9. في ب زيادة: «كالحذَّاء»، وفي ج، د، هـ، و: «للفهم». \n10. في ز: «وافق»، والمُثْبَتُ موافق لما في نزهة النَّظر. \n11. «وَجَدِّهِ» سقطت من ب. \n12. في ب، و: «اسم».",
    "book_id": "616",
    "new_page_number": 72
  },
  {
    "serial_number": "3382364",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "* وَ مَعْرِفَةُ الأَسْمَاءِ المُجَرَّدَةِ وَالمُفْرَدَةِ (1) ، وَكَذَا الكُنَى، وَالأَلْقَابُ، وَالأَنْسَابُ (2) . وَتَقَعُ (3) إِلَى القَبَائِلِ، وَالأَوْطَانِ - بِلَاداً (4) ، أَوْ ضِيَاعاً (5) وَسِكَكاً (6) ، وَمُجَاوَرَةً (7) -. وَإِلَى الصَّنَائِعِ وَالحِرَفِ. وَيَقَعُ فِيهَا (8) الِاتِّفَاقُ وَالِاشْتِبَاهُ (9) كَالأَسْمَاءِ. وَقَدْ تَقَعُ (10) أَلْقَاباً. وَمَعْرِفَةُ أَسْبَابِ ذَلِكَ.",
    "foot_note": "1. في ح: «المفرَّدة» بتشديد الرَّاء؛ وهو وهم. \n2. في ز: «والانتساب». \n3. في و، ح: «ويقع» بالياء. \n4. «بِلَاداً» سقطت من ب. \n5. في أ، ج، هـ: «وضياعاً» بواو العطف، وفي و: «ضِيَعاً». \n6. في ز، ح: «أو سككاً»، وزيادة الهمزة من ضمن نزهة النَّظر. \n7. في ز، ح: «أو مجاورة»، وزيادة الهمزة من ضمن نزهة النَّظر. \n8. في ح: «فيه»، وفي د: «منها». \n9. في أ، ج، د، هـ، و: «الاشتباه والاتفاق» بتقديم وتأخير، والمُثْبَتُ مُوَافِقٌ لما في نزهة النَّظر. \n10. في و، ز، ح: «يقع» بالياء، وفي ب، ز زيادة: «الأنساب».",
    "book_id": "616",
    "new_page_number": 73
  },
  {
    "serial_number": "3382365",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "* وَ مَعْرِفَةُ المَوَالِي (1) مِنْ أَعْلَى، وَمِنْ أَسْفَلَ (2) ، بِالرِّقِّ، أَوْ بِالحِلْفِ (3) . * وَ مَعْرِفَةُ الإِخْوَةِ وَالأَخَوَاتِ .",
    "foot_note": "1. في هـ: «المولى». \n2. في ز، ح: «وأسفل» من غير «مِن»، وهي ممَّا حذفه المصنِّف من نزهة النَّظر. \n3. في ب، د: «أو بالحَلِفِ» بفتح الحاء وكسر اللام، وفي ح: «بالخلف»؛ وهو تصحيف، وفي ب زيادة: «أو بالإسلام»، والمثبت من أ، هـ، و.",
    "book_id": "616",
    "new_page_number": 74
  },
  {
    "serial_number": "3382366",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "* وَ مَعْرِفَةُ آدَابِ (1) الشَّيْخِ وَالطَّالِبِ . وَسِنِّ (2) التَّحَمُّلِ (3) وَالأَدَاءِ (4) . وَصِفَةِ (5) كِتَابَةِ الحَدِيثِ (6) ، وَعَرْضِهِ، وَسَمَاعِهِ، وَإِسْمَاعِهِ، وَالرِّحْلَةِ (7) فِيهِ (8) . وَتَصْنِيفِهِ عَلَى المَسَانِيدِ (9) ، أَوِ الأَبْوَابِ (10) ، أَوِ العِلَلِ، أَوِ الأَطْرَافِ (11) .",
    "foot_note": "1. في أ، ج، هـ، ح: «أدب». \n2. في أ، ج، د، هـ: «ووقتَ سنِّ» بدل «وَسِنِّ»، وفي ز: «وسنن»؛ وهو تصحيف. \n3. في ب: «والتحمل» بدل «وَسِنِّ التَّحَمُّلِ». \n4. في أ، ج، د زيادة: «وصفةِ الضبطِ بالحفظِ والكتاب»، وفي هـ زيادة: «وصفةُ الضبط بالحفظ والكَتْبِ»، وسقطت من نزهة النَّظر. \n5. في هـ: «وصفةُ» بالرَّفع، والمثبت من أ، د، و. \n6. في ج: «كتاب». \n7. في هـ: «والرحلةُ» بالرَّفع، والمثبت من ج، د، و. \n8. في ح: «إليه». \n9. في ج: «على الأسانيد»، و «عَلَى المَسَانِيدِ» سقطت من ز، والمُثْبَتُ موافق لما في نزهة النَّظر. \n10. في هـ: «والأبواب»، والمُثْبَتُ مُوَافِقٌ لما في نزهة النَّظر، وفي أ، ج، د زيادة: «أو الشيوخ»، وفي هـ زيادة: «والشيوخ»، وسقطت من نزهة النَّظر. \n11. في ب: «أو العلل والأطراف» بدل «أَوِ العِلَلِ، أَوِ الأَطْرَافِ»، وفي هـ: «والعلل والأطراف»، والمُثْبَتُ مُوَافِقٌ لما في نزهة النَّظر.",
    "book_id": "616",
    "new_page_number": 75
  },
  {
    "serial_number": "3382367",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "* وَ مَعْرِفَةُ سَبَبِ الحَدِيثِ ، وَقَدْ صَنَّفَ فِيهِ بَعْضُ شُيُوخِ (1) القَاضِي (2) أَبِي يَعْلَى ابْنِ الفَرَّاءِ (3) . وَصَنَّفُوا فِي غَالِبِ هَذِهِ (4) الأَنْوَاعِ. وَهِيَ نَقْلٌ مَحْضٌ، ظَاهِرَةُ التَّعْرِيفِ، مُسْتَغْنِيَةٌ (5) عَنِ التَّمْثِيلِ (6) ؛ فَلْتُرَاجَعْ (7) لَهَا (8) مَبْسُوطَاتُهَا. وَاللَّهُ (9) المُوَفِّقُ وَالهَادِي (10) ، لَا إِلَهَ إِلَّا هُوَ (11) (12) . * * * تم بحمد الله",
    "foot_note": "1. في ج: «مشايخ»، وفي ز: «الشيوخ». \n2. «القَاضِي» سقطت من ز. \n3. في ج زيادة: «الحنبلي»، وهي من ضمن نزهة النَّظر. \n4. في ز: «هذا». \n5. في أ: «مستغنيةً» بالنَّصب المنوَّن، وفي هـ: «غنية»، والمثبت من و. \n6. في أ، ج، د زيادة: «وحصرها متعسر»، وفي هـ زيادة: «وحصرها معتبر»، وكلتا العبارتين ضمن نسخ نزهة النَّظر. \n7. في ب، ج، و، ح: «فليراجع»، وفي د: «فلتراجع، فليراجع» بالتاء والياء معاً. \n8. «لَهَا» سقطت من ح. \n9. في و زيادة: «أعلم». \n10. في و، ح: «الهادي» دون واو العطف. \n11. «لَا إِلَهَ إِلَّا هُوَ» سقطت من ح، وفي و زيادة: «وحسبنا اللَّه ونعم الوكيل»، وفي ز زيادة: «عليه توكلت وإليه أنيب، وحسبنا اللَّه ونعم الوكيل». \n12. الخاتمة: في أ: «آخر الكتاب، والحمد للَّه وحده، وصلَّى اللَّه على محمد وآله وصحبه وسلم، بتاريخ ثالث عشر ذي حجة الحرام، سنة إحدى وعشرين وثمان مئة». =",
    "book_id": "616",
    "new_page_number": 76
  },
  {
    "serial_number": "3382368",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "foot_note": "1. = وفي ب: «وهذا آخر نخبة الفكر في مصطلح أهل الأثر، تأليف شهاب الدين ابن علي ابن حجر، والحمد للَّه ربِّ العالمين وصلى اللَّه على سيدنا محمد وآله وصحبه أجمعين، كان الفراغ من نسخها: آخر نهار الخميس، سادس عشر المحرم الحرام، افتتاح عام سنة أربعة وثلاثين وثمان مئة، على يد - أضعف عبيد اللَّه وأحوجهم إلى رحمته وغفرانه -: محمد بن موسى بن عمران، غفر الله له ولوالديه ولمشايخه ولمن دعا له بالتوبة والمغفرة ولجميع المسلمين». وفي ج: «آخر الكتاب، واللَّه أعلم بالصواب، تمت - بحمد اللَّه، وعونه، وحسن توفيقه - ضحوة يوم الأحد، سادس شهر جمادى الآخرة، سنة (834) من الهجرة النبوية، أحسن اللَّه عقباها، على يد - العبد الفقير إلى اللَّه تعالى -: أبي الفتح محمد بن محمد ابن الجزري النابلسي، بمسجد الشيخ شهاب الدين ابن أرسلان - أعاد اللَّه علينا وعلى المسلمين من بركاته آمين -»، وفي حاشيتها: «بلغت مقابلة على أصلها على حسب الطاقة». وفي د: «آخر الكتاب، واللَّه أعلم بالصواب، تمت - بحمد اللَّه وعونه - في يوم الثلاثاء، ثامن المحرم الحرام، سنة خمسين وثمان مئة، على يد - أضعف عبيد اللَّه وأحوجهم إلى رحمته وغفرانه -: محمد بن موسى بن عمران غفر الله له ولوالديه ولمشايخه ولجميع المسلمين أجمعين؛ آمين، وصلّى الله على سيدنا محمد وآله وصحبه وسلم». وفي هـ: «كَمُلت المقدمة، والحمد للَّه حقَّ حمده، والصلاة على محمد نبيه وعبده، أواخر شهر ربيع الأول المبارك، الذي من عام (869)». وفي و: «تم كتاب نخبة الفكر في مصطلح أهل الأثر، والحمد للَّه وحده، وصلَّى اللَّه على محمدٍ وآله وصحبه وسلَّم». وفي آخرها إجازةٌ للنَّاسخ من الحافظ عثمان الدِّيمي، ونصُّها: «الحمد للَّه المحسن على الدَّوام، والصلاةُ على خير خلقِه محمد المصطفى والسَّلام، أما بعد: فقد قرأ عليَّ جميعَ هذه «النُّخبة» - صاحبُها، وناسخُها، الشيخ، المشتغل، المحصِّل، المبارك، الزاهد - سراج الدِّين أبو حفص، عمر بن أبي بكر بن علي الشهير بابن المُبَيِّضِ الصيداويِّ الشافعيِّ - نفعه اللَّهُ بالعلم، وزيَّنه بالحلم، وجعله من العلماء العالمين العاملين -. وأجزتُ له أن يرويَها عنِّي بروايتي لها عن مؤلِّفها - شيخِنا، شيخِ الإسلام، حافظِ العصر - أبي الفضل أحمدَ بنِ عليِّ بنِ محمدٍ ابن حجرٍ العسقلانيِّ رحمه اللَّه تعالى. قاله وكتبه - فقير رحمة ربه، الغنيُّ به عمَّن سواه -: عثمانُ بنُ محمدِ بنِ عثمانَ بنِ ناصرٍ الدِّيمي، في سادس شوال، سنة ست وسبعين وثمان مئة، حامداً مصلِّياً مسلِّماً مُحسبِلاً مُحوقلاً». وفي حاشيتها طبقة سماعٍ أخرى غير واضحة وظهر منها: «الحمد للَّه، ثم قرأ عليَّ الشيخ المذكور جميع الكتاب الموسوم \n…. ».",
    "book_id": "616",
    "new_page_number": 77
  },
  {
    "serial_number": "3382369",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "foot_note": "1. = وفي ز: «تمت النخبة المباركة - بحمد اللَّه عز وجل وعونه، وحسن توفيقه -، وصلى اللَّه على سيدنا محمد وعلى آله وسلم، وعلَّقه: محمد بن أحمد بن أبي بكر البوصيري». وفي ح: «قد وقع الفراغُ من كتابتِها بعون اللَّه الملك الوهَّاب في شهرِ شعبان المعظَّم، من يوم الثّلاثاء، خمس وعشر من ذلك الشَّهر، سنة خمس وعشرين ومئة وألف. فاعتمِد - يا أخي - أنِّي قد كتبتُ هذه الرِّسالة من نسخةٍ قد كتبها تلميذ المصنِّف، وقد قرأها - ذلك النُّسخَة - على المصنِّف، وأجازه المصنِّف في آخر تلك النُّسخة بخطِّه، فحرَّرتُها بلا نقصان ولا زيادة».",
    "book_id": "616",
    "new_page_number": 78
  },
  {
    "serial_number": "3382370",
    "category_id": "10",
    "category": "علوم الحديث",
    "book_title": "نخبة الفكر في مصطلح أَهل الأثر",
    "edition": "الثانية، 1441 هـ - 2020 م",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "فِهْرِسُ أَهَمِّ مَرَاجِعِ التَّحْقِيقِ 1 - البدر الطَّالع بمحاسن مَن بعد القرن السَّابع، لمحمد بن علي الشَّوكاني اليمني، النَّاشر: دار المعرفة، بيروت. 2 - تذكرة الحفاظ وتبصرة الأيقاظ، لجمال الدِّين يوسف بن حسن بن أحمد بن حسن ابن عبد الهادي الصالحي المعروف بابن المِبرَد الحنبلي، ت: نور الدِّين طالب، النَّاشر: دار النَّوادر، سوريا، ط: الأولى، 1432 هـ - 2011 م. 3 - توضيح المشتبه في ضبط أسماء الرواة وأنسابهم وألقابهم وكناهم، لمحمد بن عبد الله القيسي الدمشقي الشافعي، شمس الدين، الشهير بابن ناصر الدين، ت: محمد نعيم العرقسوسي، الناشر: مؤسَّسة الرِّسالة، بيروت - لبنان، ط: الأولى، 1993 م. 4 - الجواهر والدرر في ترجمة شيخ الإسلام ابن حجر، لشمس الدين محمد بن عبد الرحمن السَّخاوي، ت: إبراهيم باجس عبدالمجيد، الناشر: دار ابن حزم، بيروت - لبنان، ط: الأولى، 1419 هـ. 5 - ذيل التقييد في رواة السنن والأسانيد، لأبي الطيب محمد بن أحمد بن علي المكي الحسني الفاسي، ت: كمال يوسف الحوت، الناشر: دار الكتب العلمية، بيروت - لبنان، ط: الأولى، 1410 هـ. 6 - ذيل طبقات الحفَّاظ، لعبد الرَّحمن بن أبي بكر السُّيوطي، ت: زكريا عميرات، النّاشر: دار الكتب العلمية. 7 - شذرات الذهب في أخبار من ذهب، لأبي الفلاح عبد الحي بن أحمد بن محمد ابن العماد العَكري الحنبلي، ت: محمود الأرناؤوط، خرج أحاديثه: عبد القادر الأرناؤوط، الناشر: دار ابن كثير، دمشق - سوريا، ط: الأولى، 1406 هـ. 8 - شرح سنن أبي داود، لشهاب الدين أحمد بن حسين بن علي بن رسلان المقدسي الرملي الشافعي، ت: عدد من الباحثين بدار الفلاح بإشراف خالد الرباط، الناشر: دار الفلاح للبحث العلمي وتحقيق التراث، الفيوم - جمهورية مصر العربية، ط: الأولى، 1437 هـ. 9 - شرح نخبة الفكر في مصطلحات أهل الأثر، لعلي بن سلطان محمد، أبو الحسن نور الدين الملا الهروي القاري، ت: محمد نزار تميم وهيثم نزار تميم، الناشر: دار الأرقم - بيروت. 10 - الضوء اللامع لأهل القرن التاسع، لشمس الدين محمد بن عبد الرحمن السخاوي، الناشر: دار مكتبة الحياة - بيروت. 11 - طبقات الحفاظ، لعبد الرحمن بن أبي بكر السيوطي، الناشر: دار الكتب العلمية - بيروت، ط: الأولى، 1403 هـ. 12 - فتاوى نور على الدَّرب، لعبد العزيز بن عبد الله بن باز، الناشر: الرِّئاسة العامَّة للبحوث العلميَّة والإفتاء، الرِّياض - المملكة العربية السعودية، ط: الأولى، 1428 هـ - 2007 م. 13 - قضاء الوطر في نزهة النظر في توضيح نخبة الفكر في مصطلح أهل الأثر، لبرهان الدِّين إبراهيم بن إبراهيم اللَّقاني، ت: شادي بن محمد بن سالم آل نعمان، الناشر: الدار الأثرية، عمَّان - الأردن، ط: الأولى، 1431 هـ - 2010 م. 14 - لحظ الألحاظ بذيل طبقات الحفاظ، لمحمد بن محمد بن محمد، أبي الفضل تقي الدين ابن فهد الهاشمي المكيّ الشافعي، الناشر: دار الكتب العلمية، ط: الأولى، 1419 هـ - 1998 م. 15 - المجمع المؤسس للمعجم المفهرس، لشهاب الدين أحمد بن علي بن محمد ابن حجر العسقلاني، ت: يوسف عبد الرحمن المرعشلي، الناشر: دار المعرفة - بيروت، ط: الأولى، 1413 هـ - 1415 هـ. 16 - مختار الصحاح، لأبي عبد الله محمد بن أبي بكر بن عبد القادر الحنفي الرازي، ت: يوسف الشيخ محمد، الناشر: المكتبة العصرية - الدار النموذجية، بيروت - صيدا، ط: الخامسة، 1420 هـ. 17 - المنهل الصافي والمستوفى بعد الوافي، لجمال الدين أبي المحاسن يوسف بن تغري بردي بن عبد الله الظاهري الحنفي، ت: محمد محمد أمين، الناشر: الهيئة المصرية العامة للكتاب، 1984 هـ. 18 - نزهة النظر في شرح نخبة الفكر في مصطلحات أهل الأثر، لشهاب الدين أحمد بن علي بن محمد ابن حجر العسقلاني، ت: عبد المحسن بن محمد القاسم. 19 - نظم العِقْيَان في أعيان الأعيان، لعبد الرّحمن بن أبي بكر السُّيوطي، ت: فيليب حتي، الناشر: المكتبة العلمية، بيروت. 20 - النور السافر عن أخبار القرن العاشر، لمحي الدين عبد القادر بن شيخ بن عبد الله العَيْدَرُوس، الناشر: دار الكتب العلمية - بيروت، ط: الأولى، 1405 هـ.",
    "foot_note": "None",
    "book_id": "616",
    "new_page_number": 79
  }
]