[
  {
    "text": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems\nAuthor: عمرو بن بحر بن محبوب الكناني بالولاء الليثي أبو عثمان لجاحظ\nYear: 255",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 1
  },
  {
    "text": "sn: 6861\nbook_title: التبصرة بالتجارة في وصف ما يستظرف في البلدان من الأمتعة الرفيعة والأعلاق النفيسة والجواهر الثمينة\nbook_link: https://shamela.ws/book/6956\nbook_id: 6956\nauthor_name: عمرو بن بحر بن محبوب الكناني بالولاء الليثي أبو عثمان لجاحظ\nauthor_year: 255\nnickname: أبو عثمان\nauthor_link: https://shamela.ws/author/787\nauthor_ID: 787\neditor: حسن حسني عبد الوهاب التونسي\npublisher: مكتبة الخانجي - القاهرة / مصر\nedition: الثالثة، 1414هـ - 1994م\npages: 37\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: البلدان والرحلات\ncategory_id: 28",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 2
  },
  {
    "serial_number": "6268529",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Countries and Journeys\nBook: Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems\nAuthor: Amr ibn Bahr ibn Mahbub al-Kinani by loyalty, al-Laythi, Abu Uthman, famous as Al-Jahiz (Died 255 AH)\nInvestigator: Hasan Husni Abdul-Wahhab Al-Tunisi\n\nBook: Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems\nAuthor: Amr ibn Bahr ibn Mahbub al-Kinani by loyalty, al-Laythi, Abu Uthman, famous as Al-Jahiz (Died 255 AH)\nInvestigator: Hasan Husni Abdul-Wahhab Al-Tunisi\n\nAuthor: Amr ibn Bahr ibn Mahbub al-Kinani by loyalty, al-Laythi, Abu Uthman, famous as Al-Jahiz (Died 255 AH)\nInvestigator: Hasan Husni Abdul-Wahhab Al-Tunisi\n\nInvestigator: Hasan Husni Abdul-Wahhab Al-Tunisi\n\n\n\n\n[Book pagination matches the printed version]",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 3
  },
  {
    "serial_number": "6268530",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 9,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. Abu Uthman Amr ibn Bahr Al-Jahiz Al-Basri wrote: You asked, may Allah honor you, about the descriptions of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems of high value, so that this may serve as material for those refined by experience, and an aid for those engaged in the various aspects of earnings and demands. I have named it the book of \"Al-Tabsira\" (Insight), and Allah is the Grantor of success. Some of the astute ancients claimed that what exists of anything is cheap when it is found, and expensive when it is missing if the need for it becomes pressing. The Romans said: If one of you is not provided for in a land, let him move to another. The Indians said: There is nothing that increases in quantity without becoming cheaper, except for intellect; for the more it increases, the more valuable it becomes. The Non-Arabs (Persians) said: If you do not make a profit in a trade, turn away from it to another, and if one of you is not provided for in a land, let him exchange it for another.",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 4
  },
  {
    "serial_number": "6268531",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 10,
    "volume_number": 1,
    "text": "The Persians said: The winner in every market is the seller of what is in demand there. The Arabs said: If you see a man upon whom the world has turned its favor, attach yourself to him, for he is a magnet for provision. It was said to some wealthy men: How did your wealth increase? He said: I never sold on credit, I never rejected a profit even if it was small, and not a single dirham reached me but that I invested it in something else. And it used to be said: Do not buy what you have no need for, lest you soon sell what you cannot do without. Some wise men claimed that it was found in the testament of the Persians: O Man, there is no kinship between you and a land you are in; so the best of lands is what suits you, the best of time is what improves you, the best of people is the one who benefits you, the best of water is what quenches you, the best of beasts is what carries you, the best of clothes is what covers you, the best of trade is what profits you, the best of knowledge is what guides you, and the best of beauty is what you find beautiful even if it is ugly. And it used to be said: The best industry is silk (*khazz*), and the best trade is cloth (*bazz*). Chapter on Knowing Gold and Silver and Testing Them. The wise man said: What is recommended of gold is the ingot and non-ingot, and that it be",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 5
  },
  {
    "serial_number": "6268532",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 11,
    "volume_number": 1,
    "text": "like a dormant fire, a heaped radiance, and intense sulphur. Its reign has only endured because the malice of schemes does not refute it, nor does the passing of ages corrupt it. It is said that gold became precious only due to the rarity of its alteration and the increase of its freshness and beauty when it ages, and because things diminish with handling and burial except for gold, for it does not diminish at all. The best dinars are the old ones that are red leaning towards greenness. Some of the ancients claimed that a dinar is tested by its adherence to hair and beard and the difficulty of its passing through them. The counterfeit (*nabharaj*) of dinars is judged by its lightness and heaviness. They claimed that the best gold is pure gold (*uqyan*) and the best silver is pure silver (*lujayn*). The taste of pure silver is sweet, and the taste of bad coins (*zuyuf*) is bitter and rusty. The counterfeit (*nabharaj*) of dirhams is that whose ring has a harsh sound, while silver has a clear ring unmixed with dullness, and it quenches thirst if held in the mouth. Chapter on What is Considerd regarding Precious Gems, Their Knowledge, and Value. They claimed that the knowledge of the pearl gem is that you find its taste to be of two types: sweet-tasting is Omani [Oman], and salty-tasting is Qulzumi [Red Sea]. Both sink in water, while the artificial one you find bitter in taste with a greasiness to it, and it is light in weight and floats on water. They claimed that if a pearl has a worm inside it, you find it hot to the suction and touch",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 6
  },
  {
    "serial_number": "6268533",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 12,
    "volume_number": 1,
    "text": "for that is due to a soul-like ailment. If it does not have a worm, it is cold to the suction and touch, and that is its test. The sailors claimed that large pearls whose color has changed should be wrapped in sliced fresh fat tail, placed inside dough, put into an oven that is heated intensely; then it clarifies, improves, and its luster returns. If it is fumigated with camphor, that [effect] occurs, and if treated with bone marrow and melon water, it clarifies. The knowledge of the fleshy gem pearl from the bony shell pearl is that the gem pearl is even in form, soft, and smooth, while the bony one is rough and uneven in structure. The best pearl is the clear Omani one, even in body, intensely round and level. If two beads are equal in shape, form, color, and weight, it raises their price. The Omani is more precious and higher [in value] than the Qulzumi because the Omani is sweet, pure, and clear, while the Qulzumi has salinity and many defects. If the bead reaches half a *mithqal*, it is called a *Durra*. The round one, moderate in roundness, if its weight reaches half a *mithqal*, might reach a price of one thousand *mithqals* of gold. The egg-shaped one is below that in price. Their prices rise with the increase of their weight and roundness. If its weight reaches two *mithqals*, you may set its price at ten thousand dinars if you wish, or one hundred thousand dinars if you wish. A round one of this weight and description has no [set] price, and it is a *Farida* (unique pearl). The clearer and purer it is, the",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 7
  },
  {
    "serial_number": "6268534",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 13,
    "volume_number": 1,
    "text": "higher its price and the more precious it is. The orphan *Durra* (unique pearl) is Qulzumi; they claimed its weight is three *mithqals*. Small pearls are called *Marjan*. The best *Yaqut* (Ruby/Sapphire) is the *Bahramani* (deep red), then the *Muwarrad* (rose-colored) red, then the yellow, then the *Asmanjuni* (sky-blue/violet), and the lowest is the white. *Yaqut* comes from the mountain of Sarandib [Sri Lanka] in India. The [genuine] *Yaquts* are distinguished from the artificial ones by three qualities: their heaviness in weight, their coldness in the mouth when sucked, and the action of the file (*mibrad*) upon them. For the *Yaqut* is a heavy stone, cold in the mouth, and the file works on it slowly. The artificial one among them is light in weight, hot to suck, and the file works on it quickly. The best *Yaqut* is the clear, pure, luminous one of any color. The increase in value depends on its size, large or small. The clear red *Bahramani Yaqut*, if its weight reaches half a *mithqal*, might reach a price of five thousand dinars. The stone of the ring called \"Al-Jabal\" (The Mountain) weighed two *mithqals* and was valued at one hundred thousand dinars,",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 8
  },
  {
    "serial_number": "6268535",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 14,
    "volume_number": 1,
    "text": "and Abu Ja'far Al-Mansur bought it for forty thousand dinars. As for the *Asmanjuni* (sky-blue) *Yaqut*, a stone of it might reach two hundred dinars. The best *Zabarjad* (Peridot/Emerald) is the intensely green, clear gem. The knowledge of superior *Zabarjad* from the artificial manufactured one is like the knowledge of *Yaquts*: by its heaviness, the coldness of its taste, and the file working on it slowly. The manufactured one is soft, light in weight, hot in taste, and [the file] works quickly on it. They claimed that the best *Zabarjad* is the vibrant, clear, pure one. If a piece of it reaches half a *mithqal*, it reaches a price of two thousand *mithqals* of gold. The increase in value depends on the extent of its size. The stone of the ring called \"Al-Bahr\" (The Sea) weighed three *mithqals*; Abu Ja'far Al-Mansur bought it for thirty thousand dinars, and it is today in the treasury of some of the Caliphs. The best *Fayruzaj* (Turquoise) is the *Shirbam*, green, *Asmanjuni* (sky-blue), clear, and old. *Fayruzaj* is",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 9
  },
  {
    "serial_number": "6268536",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 15,
    "volume_number": 1,
    "text": "a stone that the file does not affect, nor does it change in fire or hot water. The maximum price of a *Fayruzaj* stone, if its weight reaches half a *mithqal*, is twenty dinars. The best *Aqiq* (Agate) is the Yemeni, intensely red, in whose face something like lines can be seen. The clearer and more luminous it is, the better the price. The best *Bijadi* (Garnet/Spinel) is the red one, intensely red, whose color flames like the inflammation of fire. The harder and larger it is, the more precious and valuable. The manufactured one is soft. The test of its quality from its badness is that if you bring it close to straw/feathers, it picks them up. The more it picks up feathers, the better it is. The maximum price of a superior *Bijadi* stone, if its weight reaches half a *mithqal*, is thirty dinars. The Precious Gem (Diamond?) has no [set] value due to the wideness of its light and the spread of its ray at night. Crystal (*Ballur*) is chosen for its clarity and size. The best crystal glass is the clear, white, pure,",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 10
  },
  {
    "serial_number": "6268537",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 16,
    "volume_number": 1,
    "text": "and the superior Pharaonic. The best Diamond (*Mas*) is the clear, white, pure crystal-like one, then the red. If its weight reaches half a *mithqal*, its price reaches one hundred dinars. The bigger and greater it is, the higher and more elevated the price. Chapter on Knowing Perfumes, Scents, and Good Fragrances. They claimed that the best Indian Oud (Aloeswood) is the *Mandali*, which has no adulteration. The harder it is, the better. The test of its quality is by the sharpness of its scent and the intensity of its smell. They claimed that the best Indian Oud is the heavy in weight that sinks in water, and the lowest is the light in weight that floats on the surface of the water. The light in weight, according to them, is dead with no spirit in it, and it is weak in scent, while the heavy in weight has sharpness and strength of aroma and smell.",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 11
  },
  {
    "serial_number": "6268538",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 17,
    "volume_number": 1,
    "text": "The best Musk is the Tibetan, dry and light-colored (*fatih*), and the worst is the wet/skin (*badi*?). The adulteration of Musk is with lead (*anuk*), castoreum (*jund badastar*), dragon's blood resin (*dam al-akhawayn*), and *siyah daru* (black remedy). The lighter its weight and the more it diffuses scent, the better it is.",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 12
  },
  {
    "serial_number": "6268539",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 18,
    "volume_number": 1,
    "text": "They claimed that the best Ambergris is the gray *Zabiji* [from Zabag/Java], then the blue, then the yellow, and the lowest of it is unless... [Here is a complete leaf from the original containing thirty lines whose reading was obstructed due to the perforation of its writing and the overtaking of vitriol upon its letters, such that it was not possible to transcribe it in any way, and nothing remained visible",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 13
  },
  {
    "serial_number": "6268540",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 19,
    "volume_number": 1,
    "text": "of it except what is written in red - on the seventeenth line - which is: Chapter on Knowing Clothes and What is Considered High Quality among them]... The best *Washi* (embroidered/patterned fabric) [in robes] is the *Sabiri* and the *Kufi*, and the needlework is named, and the gold-woven. Then the Alexandrian *Washi*, meaning pure linen, then that woven with gold. Then the spun *Washi*, which has no needlework named in it nor gold, and it is the Yemeni, because it rises in this manner of spinning. The needlework is named, and linen does not reach in price what the Yemeni reaches, for the spun robe might reach one thousand dinars.",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 14
  },
  {
    "serial_number": "6268541",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 20,
    "volume_number": 1,
    "text": "The best Squirrel (*Sinjab*) is the Ermine (*Qaqum*), then the backs of it, then the Khazari, then the Khwarazmian, then that which has no adulteration with rabbit down. The best Foxes are the black Khazari with thick fur that is not adulterated with dye, then the white, then the red *Mahsari*, then the red Khazari, then the *Khalanji* (heath/heather colored). The best Ermine is that which has the most tails. The best Sable (*Samur*) is the Chinese, then the Khazari which is intensely white with intense blackness and long fur.",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 15
  },
  {
    "serial_number": "6268542",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 21,
    "volume_number": 1,
    "text": "The best carpets/bedding (*Farsh*), highest in price and quality, is the luminous Armenian crimson goat-wool (*Mar'azi*), then the patterned *Khazz* (silk/fur blend), then the cut *Khazz*, then the Brocade (*Dibaj*) made in the style of the Roman *Khusrawani*, then the *Khazz* brocaded in the *Maysani* style, then the *Buzyun*. Whatever of these types is woven with gold is better and higher in price. All these types may be woven with gold except the Armenian, the *Maysani*, and the *Buzyun*. The best *Buzyun* is the musk-colored finely woven, then the striped, then the scaled (*muflas*), then the plain, then the diamond-patterned, then the dotted. The musk-colored cloak (*ghafara*) if it is fine in workmanship and pure, might reach a price of fifty dinars.",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 16
  },
  {
    "serial_number": "6268543",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 22,
    "volume_number": 1,
    "text": "*Abu Qalamun* is of the *Zalali* Roman *Khusrawani* crimson with varying stripes, violet in red and green. They claimed that it changes colors with the rising of the day and the glare of the sun, and its value is very high. The best robes (*Aksiya*) of wool are Egyptian, then the Persian *Khuzi*, and the goat-wool in goat-wool of Persian Shiraz, then the Isfahani goat-wool in silk of Fasa [Iran], then the Tabari [Tabaristan], then wool in wool. The best shawls (*Tayalisa*) are the Ruyani Tabari, then the Amuli [Amul], then the Egyptian, then",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 17
  },
  {
    "serial_number": "6268544",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 23,
    "volume_number": 1,
    "text": "the Qumisi [Qumis]. The best Felts (*Lubud*) are Chinese, then the red Maghrebi, then the white Taligani, then the Armenian, then the Khurasani. The best Leopards/Panthers (*Numur*) are the Barbary [North African] with sashes, intensely white, saturated black, with long *Sabani* patterns. The most elegant Leopard is that which has a distinct small black dot in the center of its blackness. If its blackness is connected to one another by a light splinter of blackness, it is more elegant. If it has redness with pure whiteness and intense blackness, it is more beautiful and higher in price. The Barbary leopards are small, and the size of the skin from them covers a single saddle; the maximum price of a skin from them is fifty dinars. As for the Maghrebi and Indian ones, they are wider and larger but do not reach that price nor",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 18
  },
  {
    "serial_number": "6268545",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 24,
    "volume_number": 1,
    "text": "rise [in value]. The best Leopards are the patterned ones. The best cotton is white, soft, small-seeded, delicately white, and pure. He claimed that Kermes (*Qirmiz*) is a grass which is at its root a red worm that grows in three places on Earth: in the region of the Maghreb in the land of Andalusia [Spain], in a district called Tarim, and in the land of Fars [Iran]. No one knows this grass and its locations except a sect of Jews who undertake its uprooting every year in the month of Isfandarmadh. That worm dries, and silk, wool, and other things are dyed with it. The best of what is dyed in places is in the land of Wasit.",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 19
  },
  {
    "serial_number": "6268546",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 25,
    "volume_number": 1,
    "text": "They claimed that Balsam (*Balsan*) is a tree in the land of Egypt which is incised in the days of spring, and Balsam oil comes out of it and is taken. It is missing in the entire Earth except Egypt. The Grain of Zalam grows in the land of Shahrazur, and they claimed it is good for intercourse. *Qirmaz* is a tree, in Persian *Banjakasht* (?), rarely found except with oleander (*Difla*). It is a plant that seeks the best from the oleander growing near it, called *Fazahr*, so it is planted with it in the place where it is found. It was said they were both carried from the land of the Romans, and it has a long strange story. Chapter on What is Imported from Countries regarding Rare Goods, Merchandise, Slave Girls, Stones, and Other Things. Imported from India: Tigers, leopards, elephants, leopard skins, red rubies, sandalwood",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 20
  },
  {
    "serial_number": "6268547",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 26,
    "volume_number": 1,
    "text": "white, ebony, and coconut. Imported from China: *Firand* (silk/swords?), silk, porcelain, paper, ink, peacocks, swift workhorses, saddles, felts, cinnamon, and pure *Adarand*. Imported from the Romans (Byzantium): Vessels of silver and gold, pure Caesarean dinars, drugs, bryony, *Abrun*, brocade, swift workhorses, slave girls, rare brass wares, precise locks, *Lura*, hydraulic engineers, experts in agronomy and farming, marble builders, and eunuchs.",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 21
  },
  {
    "serial_number": "6268548",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 27,
    "volume_number": 1,
    "text": "From the land of the Arabs: Arab horses, ostriches, noble camels, spears, and leather. From the Berbers and regions of the Maghreb: Leopards, acacia pods (*Qaraz*), felts, and black falcons. From Yemen: Cloaks (*Burud*), leather, giraffes, buffaloes, agate, frankincense, woad, and saffron (*Wars*). From Egypt: Ambling donkeys, fine clothes, papyrus, balsam oil, and from the mine, superior peridot/emerald.",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 22
  },
  {
    "serial_number": "6268549",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 28,
    "volume_number": 1,
    "text": "From the Khazars: Male and female slaves, armor, helmets, and mail coifs. From the land of Khwarazm: Musk, ermine, sable, squirrel, fennec, and sweet flag (*qasab al-tib*). From Samarkand [Uzbekistan]: Paper.",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 23
  },
  {
    "serial_number": "6268550",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 29,
    "volume_number": 1,
    "text": "From Balkh [Afghanistan] and its regions: Good grapes and *Fushana*. From Bushanj: Preserved capers. From Merv [Turkmenistan]: Lute players, excellent lutes, carpets, and Mervian clothes. From Jurjan [Iran]: Jujube, pheasants, good pomegranate seeds, soft silk (*Yarmaq*),",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 24
  },
  {
    "serial_number": "6268551",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 30,
    "volume_number": 1,
    "text": "and good silk. From Amid [Diyarbakir, Turkey]: Embroidered clothes, handkerchiefs, fine veils, and woolen shawls. From Damavand [Iran]: Arrowheads. From Rayy [Iran]: Peaches, mercury, silk (*Yarmaq*), weapons, fine clothes, combs,",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 25
  },
  {
    "serial_number": "6268552",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 31,
    "volume_number": 1,
    "text": "royal caps, linen bows, and pomegranates. From Isfahan [Iran]: Honeycomb, honey, quince, Chinese pears, apples, salt, saffron, potash, white lead, kohl, layered beds, fine garments, and fruit syrup. From Qumis [Iran]: Axes, sackcloth, umbrellas, and woolen shawls. From Kerman [Iran]: Indigo and cumin. From Jur [Firuzabad, Iran]: Digestive paste (*Jawarish*),",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 26
  },
  {
    "serial_number": "6268553",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 32,
    "volume_number": 1,
    "text": "and psyllium seeds. From Bardha'a [Azerbaijan]: Swift mules. From Nisibis [Nusaybin, Turkey]: Lead. From Fars [Iran]: *Tawzi* and *Sabiri* linen clothes, rose water, water lily oil, jasmine oil, and syrups. From Fasa [Iran]: Pistachios, varieties of fruits, rare dates, and glass. From Oman and the seacoasts: Pearls. From Maysan [Iraq]: Carpets and cushions. From Ahwaz [Iran]: and its regions, sugar and brocaded *Khazz* (silk/fur).",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 27
  },
  {
    "serial_number": "6268554",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 33,
    "volume_number": 1,
    "text": "... castanet players, dancers ... and types of dates, molasses, and sugar candy. From Sus [Shush, Iran]: Citron, violet oil, basil (*Shahsparam*), horse covers, and pack saddles. From Mosul [Iraq]: Curtains, sackcloth, francolin, and quail.",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 28
  },
  {
    "serial_number": "6268555",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 34,
    "volume_number": 1,
    "text": "From Hulwan [Iran]: Pomegranates, figs, and vinegar sauces (*Kamukh*). From Armenia and Azerbaijan: Felts ... pack saddles, bedding, fine rugs, waistbands, and wool. Chapter on What is Selected of Falcons, Peregrines, Sparrowhawks, and Sakers, and other birds of prey. The best white Falcons are those found in the region of the Turks up to Gilan [Iran], then the crow-black ones which",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 29
  },
  {
    "serial_number": "6268556",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 35,
    "volume_number": 1,
    "text": "are in the region of the Zanj to India and to Yemen, then the bright red ones, then the ash-grey ones (*Dizaj*). The best Peregrines are the marine crow-black ones, and the white Jurjani ones. Likewise, for Sparrowhawks, the preferred ones are the marine crow-black ones, then the white Indian ones, then the marine red ones; red in belly and chest, with white spots (?), blossoming in color, large head, sunken eyes without emaciation, broad nostrils, wide chest and raised, soft down, long tail, green legs whose leg is close to the heavy gauntlet. If its weight reaches one hundred and thirty, that is the utmost.",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 30
  },
  {
    "serial_number": "6268557",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 36,
    "volume_number": 1,
    "text": "They claimed that the Merlin (*Yu'yu'*) is the male of the Sakers, and the *Afsa* is the male of the Sparrowhawks, and the male of the Falcons is in the station of the small Merlin. The Persians said: A horse and a hawk rarely are beautiful in appearance without having no internal quality, nor good in internal quality without having no appearance. If internal quality and appearance combine, it is superior. Another Chapter. Every garment of clothing and bedding, if it is softer, smoother, and more splendid, is higher [in value]. Every precious object of gems and stones, if it is clearer and more luminous, is more valuable. Every animal, wild or domestic, if it is larger in body and more obedient, is more preferred and luxurious. Every human, noble or humble, if he is more rational and easier [in temperament], is more beautiful. Every woman, free or slave, if she is more abundant in being, better in condition, scarcer in eating, and more thankful to people, is more preserved. Every bird, plain-dwelling or mountain-dwelling, if it is tamer, is more preferred. Every acquisition and inheritance, if it is purer and more glorious, is more enjoyable. Every enemy, small or large, if he was a close friend, is more hostile and intensely envious. And he whose shelter is unknown, his proximity is to be feared.",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 31
  },
  {
    "serial_number": "6268558",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Tabsira bil-Tijara (Insight into Trade) concerning the description of what is considered elegant in countries regarding fine goods, precious objects, and valuable gems",
    "edition": "Third, 1414 AH - 1994 AD",
    "publisher": "Maktabat Al-Khanji - Cairo / Egypt",
    "page_number": 37,
    "volume_number": 1,
    "text": "States change and provisions are apportioned, so be moderate in seeking, have mercy on the poor, and be kind to the weak; you will be rewarded for it and compensated. Destiny is a bringer that brings matters. The best sleep is that which removes fatigue and laziness. Knowledge of things is by the five senses: the quality of a thing by sight is that it be beautiful and pleasing; by the nose, if it is good and fragrant; by taste, if it is sweet and pleasant; by hearing, that it be clear in impact and sound; and by touch, that it be soft and smooth. The Persians used to say: The heart and sight are partners, taste and feeling are agreed, intellect and memory are companions, and hearing and speech are united. / The best of people is the easygoing, open-faced, humble one. The physiognomy of a bad man is to be constricted, not cheerful, his color seen tending towards yellowness and dullness without illness, to be flighty of heart, hating humor and joking and finding fault with it, and you see him harsh in expression during conversation. The physiognomy of a righteous man is that you see him easygoing, open, with a splendid appearance and appetizing speech, smooth of forehead, not constricted nor reckless, attached, anxious [to please?], not hating humor and joking, mentioning those he mentions with good, soft in conversation, humble. King Sabur claimed that it is not fitting for a wise person to count on the words of seven people: the words of the drunkard, the broker, the jester, the sick, the soothsayer, the talebearer, and women. The book is completed, and to Allah belongs the favor and praise as He deserves. And may Allah bless Muhammad and his family and grant them peace.",
    "foot_note": "None",
    "book_id": "6956",
    "new_page_number": 32
  }
]