[
  {
    "serial_number": "54384",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Doctrine Book: Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book Author: Hamad bin Nasser bin Uthman Al Muammar Al-Tamimi Al-Hanbali (1160 - 1225 AH) Investigator: Abdul Salam bin Barjas bin Nasser Al-Abdul Karim Appreciation: Saleh bin Ibrahim Al-Bulaihi Publisher: Dar Al-Asimah Edition: First, 1407 AH Number of pages: 99 [Book numbering corresponds to the printed version] Date of publication in Shamela: 19 Dhu al-Hijjah 1446\nBook: Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book Author: Hamad bin Nasser bin Uthman Al Muammar Al-Tamimi Al-Hanbali (1160 - 1225 AH) Investigator: Abdul Salam bin Barjas bin Nasser Al-Abdul Karim Appreciation: Saleh bin Ibrahim Al-Bulaihi Publisher: Dar Al-Asimah Edition: First, 1407 AH Number of pages: 99 [Book numbering corresponds to the printed version] Date of publication in Shamela: 19 Dhu al-Hijjah 1446\nAuthor: Hamad bin Nasser bin Uthman Al Muammar Al-Tamimi Al-Hanbali (1160 - 1225 AH) Investigator: Abdul Salam bin Barjas bin Nasser Al-Abdul Karim Appreciation: Saleh bin Ibrahim Al-Bulaihi Publisher: Dar Al-Asimah Edition: First, 1407 AH Number of pages: 99 [Book numbering corresponds to the printed version] Date of publication in Shamela: 19 Dhu al-Hijjah 1446\nInvestigator: Abdul Salam bin Barjas bin Nasser Al-Abdul Karim Appreciation: Saleh bin Ibrahim Al-Bulaihi Publisher: Dar Al-Asimah Edition: First, 1407 AH Number of pages: 99 [Book numbering corresponds to the printed version] Date of publication in Shamela: 19 Dhu al-Hijjah 1446\nAppreciation: Saleh bin Ibrahim Al-Bulaihi Publisher: Dar Al-Asimah Edition: First, 1407 AH Number of pages: 99 [Book numbering corresponds to the printed version] Date of publication in Shamela: 19 Dhu al-Hijjah 1446\nPublisher: Dar Al-Asimah Edition: First, 1407 AH Number of pages: 99 [Book numbering corresponds to the printed version] Date of publication in Shamela: 19 Dhu al-Hijjah 1446\nEdition: First, 1407 AH Number of pages: 99 [Book numbering corresponds to the printed version] Date of publication in Shamela: 19 Dhu al-Hijjah 1446\nNumber of pages: 99 [Book numbering corresponds to the printed version] Date of publication in Shamela: 19 Dhu al-Hijjah 1446\n[Book numbering corresponds to the printed version] Date of publication in Shamela: 19 Dhu al-Hijjah 1446\nDate of publication in Shamela: 19 Dhu al-Hijjah 1446",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54385",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 3,
    "volume_number": 1,
    "text": "Appreciation by the great scholar Sheikh Saleh bin Ibrahim Al-Bulaihi In the name of Allah, the Most Gracious, the Most Merciful Praise be to Allah, Lord of the Worlds. And I bear witness that there is no god but Allah alone, with no partner. And I bear witness that Muhammad is the servant of Allah and His Messenger. May Allah bless him and grant him peace and his family and companions altogether. As for what follows, it is known that Sheikh Muhammad bin Abdul Wahhab, may Allah have mercy on him, is considered one of the renewers of the religion of Islam. Likewise, his children, grandchildren, and all his students carried out what he did and called for what he called for, namely the monotheism of Allah and singling Him out for worship in all its forms. Among his students is a virtuous scholar well-versed in the arts of knowledge, this scholar is \"Hamad bin Nasser bin Uthman Al Muammar\", may Allah have mercy on him. This scholar, who is one of the giants of scholars, has sound and wise answers in the famous messages arranged by Sheikh Abdul Rahman bin Qasim, may Allah have mercy on him. And he has a good, beneficial, and useful treatise that a student of knowledge should read and contemplate well because of the beneficial knowledge it contains. He named this treatise \"Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book\" (The Sweet Fruits in Response to Those Who Did Not Judge by the Sunnah and the Book). The reason for writing the treatise is that Ghalib the Sharif, the Emir of Mecca, sent to Imam Abdul Aziz bin Saud asking him to send him some of the scholars he had to debate the scholars of the Haram. That was in the year 1211 AH, and since this is a great task and has its results and has",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54386",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 4,
    "volume_number": 1,
    "text": "its consequences, the Imam sent him a scholar knowledgeable and well-versed in the arts of knowledge: especially the science of beliefs and monotheism, who is \"Hamad bin Nasser Al Muammar\". When Hamad bin Nasser arrived with his companions in Mecca and performed their Umrah, the Sharif gathered the scholars of Mecca, then the debate took place in several sessions. This debate was attended by a large number of the people of Hijaz. And a large crowd: After exchanges, give and take, and heated debates whose sparks flew: and whose smoke rose, after that the flags of victory were fluttering on the side of Sheikh Hamad bin Muammar: where he prevailed over the debaters: with evidence and proof: and argument and clarification: And so it was and so it will be, everyone who is on the side of truth will rise and will be head held high and will be victorious: and will be triumphant over his opponent. In fulfillment of His saying, the Most High: {And it was incumbent upon Us to help the believers}. And among what happened in the debate sessions is that the scholars of Mecca from the Hanafis, Malikis, and Shafi'is asked Hamad bin Nasser about several issues, so he answered them about three issues. He answered them with what heals the sick and quenches the thirst. And removes doubts. And burns fallacies: And he said if you answer these three issues, we will answer you about the rest of the issues: As it was said and is said, seeing is believing. After that, I give way to the dear reader to read the three issues and read their answer: as they were before him. And Allah is the Granter of success and the Guide to the path of righteousness. After what has preceded, I say to the virtuous readers, we all have a brother in Allah. He is Professor Abdul Salam bin Barjas bin Nasser Al Abdul Karim. And in what I believe is that Allah granted him success, he thought about a subject that no one else thought about, and his blessed idea has been realized by action, and here he is, may Allah guide his steps at the beginning of the road",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54387",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 5,
    "volume_number": 1,
    "text": "This idea is finding and bringing out the books and treatises written by the scholars of the Salafi call: namely Sheikh al-Islam Muhammad bin Abdul Wahhab and his students and the students of the students. So Professor Abdul Salam undertook the publishing of these treatises, verifying them, and graduating their hadiths. And numbering the Quranic verses found in them. And that is only because the books and treatises written by these virtuous scholars, most scholars and students of knowledge who studied in institutes, colleges, universities, intermediate and secondary schools, do not know anything about these valuable books. And they are from our precious and valuable heritage. So may Allah reward the virtuous brother Professor Abdul Salam bin Barjas with the best reward and may Allah reward us and him with the reward of the doers of good and reformers and grant us and him sincerity in intention, word, and deed. And the first treatise that brother Abdul Salam verified and graduated its hadiths and brought to existence is \"Refuting Doubts on Monotheism\" by the huge scholar, the Mufti of the Najdi lands in his time, Abdullah bin Abdul Rahman Aba Butain. And the second treatise that brother Abdul Salam verified is \"Question and Answer in the Most Important Matters\" by Sheikh Abdul Rahman bin Sa'di. And the third treatise is \"Verifying the Speech on the Legitimacy of Aloud Dhikr after Prayer\" by the learned scholar Sulaiman bin Sahman. And the fourth treatise which is \"Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book\" by the scholar Sheikh Ibn Muammar, which is the one before the reader. So may Allah reward brother Abdul Salam on behalf of Islam and Muslims with the best reward and may Allah maximize for us and him the reward and recompense.",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54388",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 6,
    "volume_number": 1,
    "text": "And so students of knowledge should go down to the fields of knowledge to benefit and benefit the nation of Islam with what benefits it in its beliefs and the rulings of its religion. And may Allah bless and grant peace to our Prophet Muhammad and his family and all his companions. Said this and dictated it the needy to Allah Saleh bin Ibrahim Al-Bulaihi. Friday 20/ 7/ 1407 AH.",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54389",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 7,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful \"Investigator's Introduction\" Praise be to Allah who sent His messengers as bringers of good tidings and warners, and sent down with them the Books and the Balance, to establish the argument against all the worlds, and to distinguish the party of Allah from the party of devils. I praise Him, Glory be to Him, for the visible and hidden blessings He has bestowed upon us, and for warding off from us the various evils and misfortunes. And I bear witness that there is no god but Allah alone, with no partner, to Him belongs praise in the first and the last. And I bear witness that our Prophet and Master Muhammad, through whom Allah erased the worship of idols, trees, and statues, and removed through him the landmarks of disbelief, immorality, stone altars, and divining arrows, and nullified through him the oppression and crime that the people of ignorance were upon. So Allah raised through him the Hanifiyya, the religion of Abraham, peace and blessings be upon him, after its landmarks had become obliterated, and promised him to preserve and spread it over the years and days. So He supported him with the Quran in which is guidance, clarification, and healing for ailments, and gave him with it the comprehensive speech and words. So may Allah purify and complete peace upon him and his noble, majestic companions, who realized monotheism and established it properly, and struggled for it with all the strength and good argument they were given, and fought those who deviated and turned away from it and directed worship to other than the All-Knowing King until the settled and the bedouin became upright upon it as it should be and desired. So you do not see in their time anyone rushing to the people of the graves in grave calamities, nor anyone fleeing to supplication and intercession by the prophets and righteous people in great disasters, nor",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54390",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 8,
    "volume_number": 1,
    "text": "anyone building domes, silk, and marble over graves. So may Allah be pleased with them as they preserved the religion of Islam for us, and may Allah be pleased with those who followed them and traced their footsteps until the Day of Resurrection. As for what follows, this is the second treatise from the series of treatises and books of the eminent scholars of Najd, and it is from the writings of the learned scholar Sheikh Hamad bin Nasser Al Muammar - may Allah Almighty have mercy on him - named \"Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book\". This treatise is unique in its chapter, marvelous in its style and address, refined and revised for its students. It included, despite its small size, the establishment of monotheism, and the refutation of the roots of polytheism and denunciation, and that is with clear evidences from the Glorious Book, and from the authentic Sunnah of the best of creation and servants, peace and blessings be upon him. So it is a treatise worthy of attention, high in rank and status, students should seek help from it, and scholars possessing intellect should not turn away from it.",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54391",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 9,
    "volume_number": 1,
    "text": "The copies relied upon in the verification When I started verifying this book, several copies were available to me: First: A manuscript copy preserved in the Riyadh Saudi Library under number \"86/ 613\" consisting of twenty-four plates. It is a copy with good handwriting, in which the name of the copyist and the date of copying were not mentioned. But the copyist mentioned what indicates that it was written during the reign of Imam Abdul Aziz bin Muhammad bin Saud, may Allah have mercy on him, in his saying: \"... Ghalib, the governor of Noble Mecca, requested from Abdul Aziz bin Muhammad bin Saud, the governor of Najd, may Allah let us enjoy his life...\" So based on this, this copy must have been written during the life of the author, may Allah have mercy on him, because Imam Abdul Aziz died in the year \"1218 AH\" and the author died seven years after him. So this copy was definitely written before the year \"1218 AH\" and the symbol for this copy is the letter \"A\". Second: Another manuscript copy also preserved in the Riyadh Saudi Library under number \"86/ 607\" consisting of twenty-five plates. It is a copy with good handwriting, many spelling errors, written in the handwriting of someone named \"Abdullah bin Ahmad\" and its copyist did not mention the date of copying. This copy was written after the death of Imam Abdul Aziz bin Muhammad, i.e., after the year \"1218\" as indicated by the copyist's saying: \"... the governor of Najd, may Allah have mercy on him and cover him with His mercy...\" and the reference to this copy is with the letter \"B\".",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54392",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 10,
    "volume_number": 1,
    "text": "Third: The copy printed at Al-Manar Press in Egypt in the year \"1344 AH\" within the book of the scholar Sheikh Sulaiman bin Sahman \"The Sunni Gift and the Wahhabi Najdi Masterpiece\". And there is a fourth copy printed in Riyadh long ago at \"Al-Noor\" Press which is an exact image of the third copy. Note: In all copies, there was a mistake in the author's name where it was written \"Ahmad\" and the correct is \"Hamad\". And in \"B\" and \"the printed copy\" it occurred as \"Al-Muammari\" and the correct is \"Al-Muammar\" without the relative yaa.. Second note: Due to the many spelling errors in copy \"B\" and the additions that are often from copyists like \"Subhanahu\" at the name of Allah and \"Radiya Allahu Anhu\" at the mention of the Companions and similar things that have no effect, I did not mention the variation of copies in it.",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54393",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 11,
    "volume_number": 1,
    "text": "Author's Biography \" (*) He is the Imam, the scholar, the erudite, the grand scholar, the sea of understanding, the verifier, the Mujtahid, the Hafiz, the multi-talented, the suppressor of the anthropomorphists, and the raiser of the banner of the monotheists, the venerable Sheikh, the noble meticulous investigator, Hamad bin Nasser bin Uthman bin Hamad bin Abdullah bin Muhammad (**) bin Hamad bin Hasan bin Touq bin Saif Al Muammar (1) Al-Anqari Al-Saadi\" (2) Al-Tamimi Al-Najdi Al-Hanbali. And this Hasan bin Touq is the one who migrated from \"Tharmada\" to \"Mulhum\" then came to \"Al-Uyaynah\" and in it were the Al Yazid from Bani Hanifa, so he bought it from them in the year \"(850) AH\" and settled in it, he and his children. And it continued to grow little by little until it reached the peak - among the towns of Najd - in urban progress and large population",
    "foot_note": "1. (*) Sources of the biography: \n1 -. Rawdat Al-Nazirin about the feats of the scholars of Najd and the events of the years by Al-Qadi. \n2 -. Al-Durar Al-Saniyyah in the Najdi Answers Vol 12 by Sheikh Ibn Qasim. \n3 -. Scholars of Najd during six centuries by Al-Bassam. \n4 -. Unwan Al-Majd by Ibn Bishr. (**) In our tree it occurred \"Rajih\" instead of \"Muhammad\". Some of the elders of Al Muammar wrote this lineage to me and affirmed the name \"Muhammad\" instead of \"Rajih\" and this is what the historian Hussein bin Hasan affirmed in his book \"A'lam Tamim - p. 391\". I say perhaps his nickname was \"Rajih\" and \"Muhammad\" was his name, and Allah Almighty knows best. \n1. And the writer of this biography meets with the author in the seventh grandfather. \n2. Attributed to Bani Saad bin Zaid Manat bin Tamim.",
    "book_id": "1"
  },
  {
    "serial_number": "54394",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 12,
    "volume_number": 1,
    "text": "And commercial and scientific movement, especially in the time of the Emir - Abdullah bin Muhammad bin Muammar - as Ibn Bishr said in Unwan Al-Majd. The virtuous Sheikh Abdullah bin Bassam - may Allah protect him - mentioned in his book Scholars of Najd \"1/ 239\" that between the subject of the biography and Hasan bin Touq there is a kinship of ten grandfathers whose names he could not find. So he said: And the correct is that between him and Hasan there are five grandfathers, and their names are known, and I have established them from our tree \"Al Abdul Karim\", and from the elders of the \"Al Muammar\" family. This great scholar was born in the city of \"Al-Uyaynah\" in the year \"1160 AH\" and it was at that time the largest city in Najd, just as it is the town of his clan Al Muammar - the rulers of Al-Uyaynah - so he was from a house of rule and emirate. It is known that Al-Uyaynah, after the establishment of the call of Imam Sheikh Muhammad bin Abdul Wahhab, was influenced by his call, and there were people in it who were supporters of his methodology, so the subject grew up in it and took knowledge from its scholars who are followers of Sheikh Muhammad bin Abdul Wahhab. When he grew up, he desired to increase in knowledge, so he traveled to \"Diriyah\", the headquarters of the call of Sheikh al-Islam. And he adhered to Sheikh al-Islam in it like a shadow, so he benefited from that greatly, just as he took knowledge from other scholars of Diriyah such as Sheikh Sulaiman bin Abdul Wahhab, and Sheikh Hussein bin Ghannam. And he persevered in acquiring knowledge with seriousness and diligence, and that coincided with good understanding, sharp intelligence, and strong memory from him, so he excelled in the Sharia sciences generally, and realized the Arabic sciences well, and reached a great level until he became one of the greatest scholars of Najd, and one of the most knowledgeable and capable, and his answers are the biggest witness to that.",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54395",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 13,
    "volume_number": 1,
    "text": "Ibn Qasim said: He reached a level in the rational and transmitted sciences, having a long hand in principles, branches, hadith, Arabic language, and others, rare in example in religiosity and worship, combined types of virtues and high qualities, combined the two traits of knowledge and forbearance, lineage and nobility, intellect and merit, teaching and authorship, fatwas and advice, the unique of the age in types of virtues, his gatherings are populated with knowledge, filled with jurists, his times are linked with good, and his morals are famous for intelligence, end quote. Ibn Bassam said: When he reached this great level of knowledge, he sat for teaching in the city of Diriyah, blooming with scholars and populated with students and listeners, so Allah Almighty benefited many people with his knowledge, and a large crowd benefited from him. So among his brilliant students were his son Sheikh Abdul Aziz bin Muammar - author of the book \"Minhat Al-Qarib Al-Mujib in Responding to the Worshippers of the Cross\" -, and the Sheikh, the Muhaddith, the Jurist, the Scholar Sulaiman bin Abdullah Al Sheikh, and the Sheikh, the Scholar, the Imam Abdul Rahman bin Hasan, and the Sheikh, the Investigating Scholar Abdullah bin Abdul Rahman Aba Butain, and Sheikh Abdul Aziz bin Hamad bin Musharraf, and Sheikh Uthman bin Abdul Jabbar bin Shabana, and Sheikh Ali bin Hasan Al-Yamani, and Sheikh Jam'an bin Nasser, and other scholars. He was also sought for questions and fatwas from parts of the Arabian Peninsula, so he answered them with edited sound answers that indicate extensive knowledge, pure jurisprudence, and long ability in",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54396",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 14,
    "volume_number": 1,
    "text": "all Sharia sciences, so in his fatwas and treatises came benefits exceeding what was written before him by the jurists, indicating good disposal, and beautiful extraction on the words of the scholars who preceded him. So his fatwas and treatises, if collected, would make a large useful volume, but they were printed scattered with the fatwas and treatises of the scholars of Najd, end quote. And Muhammad bin Uthman Al-Qadi said: He had a prominent position, and a fame that reached the horizons, and his word had influence, and he was the preacher of his time, and his sermons had an impact on the hearts, abundant tears never leaving his cheek... And he used to preach to people after prayers in Diriyah and in Hijaz during his stay there, enjoining good and forbidding evil, and the rulers strengthening his resolve, and Allah benefited nations that cannot be counted through him, and he erased innovations that were in Hijaz, so the Sharif demolished domes that were on graves due to his valuable guidance, and he had prestige, and his speech had an impact on hearts, end quote. Sheikh Ibn Bassam - may Allah protect him - said: The notable of Hijaz, the Salafi Sheikh Muhammad bin Hussein Nasif told me, he said a trustworthy man from Al-Attiyah from the people of Jeddah told me from his father who said: We gathered in Ukasha Mosque when Hamad bin Nasser arrived with the peace treaty between Saud and Ghalib, so he ascended the pulpit and delivered an eloquent sermon revolving around the realization of monotheism and sincerity of worship, then warned against abandoning prayers, and ordered performing them in mosques, and forbade smoking tobacco, selling it and using it, just as he ordered the demolition of domes that were on graves, and ordered attendance to mosques to hear the treatises of Sheikh Muhammad bin Abdul Wahhab, so people complied with all this, so you would not see tobacco neither in use nor sale, and mosques became crowded with worshipers and domes on graves were demolished, and people started attending to hear the lesson, end quote.",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54397",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 15,
    "volume_number": 1,
    "text": "He was trusted by the emirs, for Imam Abdul Aziz sent him in the year \"1211 AH\" to Sharif Ghalib, the Emir of Mecca - and the reason for this mission and what happened in it has been mentioned previously -. Had it not been for his scientific standing and firm mentality, Imam Abdul Aziz would not have chosen him and the scholars of Diriyah would not have supported him to be the great ambassador in this great task, so he began debating the scholars with their schools of thought, and responding to them from their books and the sayings of their imams. In the year \"1222 AH\", Imam Saud sent him as the head of judges of Mecca Al-Mukarramah, so he stayed judging, and was correct in his rulings, and remained in his position until Allah took his soul in the middle ten days of Dhu al-Hijjah in the year \"1225 AH\" in Mecca, and Muslims prayed over him under the honorable Kaaba, then they went out with him from the Haram to Al-Baydiyah, and Imam Saud bin Abdul Aziz came out from the palace and prayed over him with a large number and he was buried in Mecca, end quote. From Ibn Bishr as in Al-Rawdah.",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54398",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 16,
    "volume_number": 1,
    "text": "Found at the beginning of the copies the following text (1): In the name of Allah, the Most Gracious, the Most Merciful, and in Him we seek help (2). Praise be to Allah who supported the religion with argument, sword, and empowerment, and made for His religion those who deny (3) from it the extremism of the extremists, and the distortion of the distorters, with definitive proofs (4) and evidences. As for what follows, when it was the year two hundred and eleven after one thousand of his migration, peace and blessings be upon him, Ghalib, the governor of Noble Mecca, requested from Abdul Aziz bin Muhammad bin Saud, the governor of Najd, may Allah let us enjoy his life (5), to send him a scholar from his scholars, to debate the scholars of the Noble Sanctuary in something of the matters of religion. So Abdul Aziz sent to him Sheikh Hamad (6) bin Nasser bin Uthman Al-Hanbali in a caravan. When they reached the governor of Mecca in it, he gathered the scholars of the Noble Sanctuary, and the followers of the four schools of thought of the Imams except the Hanbalis. So a great debate took place between the mentioned Sheikh Hamad (7) and the scholars of the Noble Sanctuary, and their leader in speech at that time was Sheikh Abdul Malik Al-Hanafi. So the debate took place in several sessions before the governor of Mecca in a great gathering of its people, and that was in the month of Rajab of the mentioned year \"1211 AH\" of his migration, peace and blessings be upon him. So the truth appeared and became clear, and falsehood was lowered and submitted, and the opponent admitted after the clarification. And among what they asked him about were three issues, so he answered, may Allah support him with a spirit from Him, with what heals the sick,",
    "foot_note": "1. And this speech is not from the author's speech as indicated by the context. \n2. \"And in Him we seek help\" is not in \"B\". \n3. In \"B\" \"Yunafi\" (contradicts). \n4. In \"A\" \"Bil-adillah\" (with evidences). \n5. In \"B\" \"May Allah Almighty have mercy on him and cover him with His mercy\". \n6. It occurred in all copies \"Ahmad\" which is an error and the correct is what I established. \n7. It occurred in all copies \"Ahmad\" which is an error and the correct is what I established.",
    "book_id": "1"
  },
  {
    "serial_number": "54399",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 17,
    "volume_number": 1,
    "text": "and delights the one who follows (1) the evidence, and these answers were named \"Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book\" (2) The First Issue ....",
    "foot_note": "1. In \"B\" \"Yabtaghi\" (seeks). \n2. The reason for naming this treatise with this name is what was mentioned in the margin of copy \"A\". The copyist said: And someone I do not suspect told me: Abdul Malik referred to said: We do not submit to the Book of Allah, nor to Sunnah, nor to the speech of Imams except Aba \"*\" Hanifa. So this is the reason for the name of the answers. End. And I think that the one who put this name is the owner of copy \"A\" or the author, and Allah knows best. _________ \"*\" In the original margin: \"Abi Hanifa\".",
    "book_id": "1"
  },
  {
    "serial_number": "54400",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 18,
    "volume_number": 1,
    "text": "Reason for writing this treatise and its description When it was the year two hundred and eleven after one thousand \"1211 AH\" of the migration of the Chosen One, peace and blessings be upon him, the Emir of Mecca Sharif Ghalib bin Musa'id sent to Imam Abdul Aziz bin Saud, may Allah have mercy on him, requesting him to send him some scholars of his country, to verify the essence of their call which was about to enter his city, and to debate the scholars of the Haram on issues of the branches and origin of religion. So Imam Abdul Aziz did nothing but send him some verifying scholars, who have a firm footing in debating with arguments and proofs, to unveil the truth of the call of the people of Najd, the monotheists, and to shoot with the arrows of monotheism the doubts of the polytheists, and at their head was Hamad bin Muammar, one of the prominent scholars. When they arrived at the House of Allah, the Sacred, and performed Umrah in comfort and peace, Sharif Ghalib received them with a beautiful reception, and honored them greatly. Then after that the debate was held, and the dispute and quarrel intensified - between Sheikh Hamad and the scholars of Mecca the Abundant - and crowds gathered for this exchange, and people gathered for it from the settled and the bedouin (1). So Sheikh Hamad established the argument and evidence against them, and cut off the path and way for them, and clarified to them the ugliness of what fathers",
    "foot_note": "1. And how excellent is what Sheikh al-Islam Abu Al-Abbas Ibn Taymiyyah, may Allah have mercy on him, said in his response to Al-Bakri \"p. 359\": And the people of Sunnah, if they confront the people of innovation, have a share of the confrontation between believers and disbelievers, end quote.",
    "book_id": "1"
  },
  {
    "serial_number": "54401",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 19,
    "volume_number": 1,
    "text": "and sheikhs of the generation were upon, of directing worship to other than Allah without proof or reasoning. So their necks submitted to his evidences, and their argument (1) and proof were humiliated before them, and they were certain that the truth was in what came to them. But Satan dictated to them, and adorned for them their evil deeds, so they relapsed on their heads, and said what their followers and ancestors said: {Indeed, we found our fathers upon a religion, and we are following in their footsteps} [Surah Az-Zukhruf - 23]. Sheikh Hussein bin Ghannam said in his book \"Rawdat Al-Afkar wal-Afham\" 2/ 202: And the description of what happened from them is that they attended at the house of the Sharif, facing the Holy House of Allah, so the first thing they opened with speaking and addressing, and agreed upon in demands, and dialogue and negotiation took place between them, and addressing regarding it and discussion, was the issue of fighting the monotheists among people, and revealing the veils of confusion from its face, so Hamad requested clarification of the argument and evidence, and the proof free from defects, and the definitive text for probability and interpretation, and suppressor of all sayings, on that method and way, so he brought them the decisive, suppressive text, for every listening ear and hearer, and brought from the authentic preponderant hadiths, and the brilliant clear evidences, what healed and sufficed, and made them on the brink of cutting the tongue and argument, and removed the darkness from its face and expelled it, so the breeze of truth blew on their spider's house and destroyed it, and tore their traces and lighthouse after it blew on them and scattered them, and stopped them on the textual evidence, so they admitted and submitted to those texts, and submission issued from them after Satan carried them on the fact that those were not written in books, nor connected in them and established, and they uttered that in the presence of the Sharif, until Hamad stopped them on what was there, and quoted from the books",
    "foot_note": "1. Sheikh al-Islam Abu Al-Abbas, may Allah have mercy on him, said in Al-Iqtida \"1/ 87 - Riyadh Ed.\": And Hujjah (Argument): is a name for everything used as proof, whether truth or falsehood, end of his speech.",
    "book_id": "1"
  },
  {
    "serial_number": "54402",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 20,
    "volume_number": 1,
    "text": "which they had what shook their ecstasy, and brought upon them their illness and strain, so their foreheads dripped with sweat, due to the shame and fear that entered them, so they had no escape or trick then, when they read his argument and evidence, and not a human among them could deny that proof, rather there was acknowledgment and submission from them ... until he said, may Allah have mercy on him p. 203: When those days and nights passed, and the hours of debate and argument ended, they asked Hamad bin Nasser bin Muammar to establish the basis of what he demonstrated and argued with and decided, and to write what he recorded against them and wrote, so he undertook that, may Allah prolong his benefit and increase it, so he gathered for them a hurried work and hastened for them in their arenas a treatise, in which he summarized the speech, and brought in it what is sufficient in argument and indication, every fair-minded rational person submits after hearing it, and every virtuous person testifies to the merit of its sayer, and acknowledges its truthfulness and the correctness of its ideal content, and no consideration is given to a hypocrite or stupid or ignorant person. He built a edifice for the clear truth on its foundation, and excelled in what he mastered of editing, clarification and explanation, so he benefited in what he aimed for of writing, proclaiming and declaring, and left his debaters suffering in answering it with toil, so they did not achieve profit from their endeavor, rather they increased in what they embellished away from correctness, distance and displacement. So it is clear to you, and its arguments are read and recited, removing the veil from its bright beauty, revealing the face to critics and examiners, free from the disgrace of prolixity and verbosity ... End with much modification. And indeed this fair-minded Sheikh was truthful in what he decided, and the reader will stand on this by reading what Sheikh Hamad wrote and penned. And Allah is the One asked and hoped to show us the truth as truth and grant us following it, and show us falsehood as falsehood and grant us avoiding it",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54403",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 21,
    "volume_number": 1,
    "text": "And may Allah bless and grant peace to the master of all creation Muhammad bin Abdullah and his family and companions and the followers (1). Written by the one in need of the pardon of his Lord the All-Powerful Abdul Salam bin Barjas bin Nasser Al Abdul Karim Riyadh 20/ 11/ 1405 Hijri",
    "foot_note": "1. And I must not miss in this introduction to extend my sincere thanks and praise to our virtuous Sheikh, the great scholar Saleh bin Ibrahim Al-Bulaihi - may Allah protect him - as he graciously read this treatise and appreciated it despite the preoccupations entrusted to him, and what he undertakes of issuing fatwas, teaching, answering questions, and calling to Allah Almighty with pen and tongue in all forums.",
    "book_id": "1"
  },
  {
    "serial_number": "54404",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 27,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful The First Issue [They said: What is your say regarding one who calls upon a prophet or a saint and seeks aid from them (1) in relieving distresses, like his saying O Messenger of Allah or O Ibn Abbas or O Mahjoub or others from the saints and righteous people]. The Answer: Praise be to Allah, we praise Him (2), and seek His help (2), and seek His forgiveness (2), and seek refuge (2) in Allah from the evils of our souls, and from our bad deeds. Whoever Allah guides, there is no misguider for him, and whoever He leaves astray, there is no guide for him. And I bear witness that there is no god but Allah alone, with no partner, and I bear witness that Muhammad is His servant and Messenger, may Allah bless him, and his family, his companions, and those who follow them in goodness and trace their footsteps until the end of time. As for what follows, indeed (3) Allah Almighty has perfected the religion for us, and His Messenger has conveyed the clear notification, and sent down upon him the Books as guidance and reminder for the believers. The Almighty said: {This day I have perfected for you your religion and completed My favor upon you and have approved for you Islam as religion} [Al-Ma'idah - 3], and the Almighty said: {And We have sent down to you the Book as clarification for all things and as guidance and mercy and good tidings for the Muslims} [An-Nahl - 89], and the Almighty said: {O mankind",
    "foot_note": "1. In \"A\" bihi (from him/it). \n2. Occurred in \"A\" Ahmad (I praise) \n…. Asta'inuhu (I seek His help) \n…. Astaghfiruhu (I seek His forgiveness) \n…. With Hamza (A'udhu - I seek refuge). \n3. In \"A\" Faqad (So indeed).",
    "book_id": "1"
  },
  {
    "serial_number": "54405",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 28,
    "volume_number": 1,
    "text": "there has come to you instruction from your Lord and healing for what is in the breasts and guidance and mercy for the believers} [Yunus - 57], and the Almighty said: {So there will surely come to you from Me guidance, so whoever follows My guidance will neither go astray nor suffer. And whoever turns away from My remembrance - indeed, he will have a depressed life, and We will gather him on the Day of Resurrection blind} [Ta-Ha - 123-124]. Ibn Abbas said: Allah guaranteed for the one who reads the Quran and follows what is in it that he will not go astray in the world nor suffer in the Hereafter (1). And the Almighty said: {And whoever is blinded from remembrance of the Most Merciful - We appoint for him a devil, and he is to him a companion. And indeed, they avert them from the way while they think that they are rightly guided} (2) [Az-Zukhruf - 36-37]. And Imam Malik narrated in Al-Muwatta that the Messenger of Allah, peace and blessings be upon him, said: \"I have left among you two things; you will never go astray as long as you hold fast to them: the Book of Allah and the Sunnah of His Messenger\" (3).",
    "foot_note": "1. Al-Firyabi, Sa'id bin Mansur, Ibn Abi Shaybah, Abd bin Hamid, Muhammad bin Nasr, Ibn Al-Mundhir, Ibn Abi Hatim, Al-Hakim (and authenticated it), and Al-Bayhaqi in Al-Shu'ab extracted it - as in Al-Durr Al-Manthur 5/ 607 - from paths from Ibn Abbas. \n2. Sheikh al-Islam Abu Al-Abbas Ibn Taymiyyah, may Allah have mercy on him, said in his response to Al-Bakri \"p. 183 - Salafiyya Ed. in Egypt - 1346 AH\": So whoever does not worship the Most Merciful worships Satan {And whoever is blinded from remembrance of the Most Merciful - We appoint for him a devil, and he is to him a companion...}. And remembrance of the Most Merciful is intended to be the remembrance that Allah Almighty sent down as He said: {So there will surely come to you from Me guidance, so whoever follows My guidance will neither go astray nor suffer...}. So whoever turns away from the guidance of Allah with which He sent His messengers, and sent down His books, and did not distinguish between what Allah commanded and what He forbade, is turning away from His revealed remembrance, so He appoints for him a devil who blocks him from the way of Allah, so he distinguishes - i.e., between things - merely by his desire {And who is more astray than one who follows his desire without guidance from Allah}. End. \n3. Malik extracted it in Al-Muwatta as Balaghan (reaching him) \"2/ 899\": And Al-Hakim narrated it in his Mustadrak \"1/ 93\", and Ibn Adi in Al-Kamil \"4/ 1386\" and others via the path of Dawud bin Umar Al-Dabbi, Salih bin Musa Al-Talhi told us, Abdul Aziz bin Rafi' told us from Abu Salih from Abu Hurairah who said: The Messenger of Allah, peace and blessings be upon him, said: \"I have left behind two things, you will never go astray after them: the Book of Allah and my Sunnah, and they will not separate until they return to me at the Basin\". =",
    "book_id": "1"
  },
  {
    "serial_number": "54406",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 29,
    "volume_number": 1,
    "text": "And from Abu Darda, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: \"I have left you upon the bright path, its night is like its day, no one deviates from it after me except he is destroyed\" (1). And he, peace and blessings be upon him, said: \"I have not left anything that brings closer to Paradise except that I have told you about it, nor anything that brings you closer to Hell except",
    "foot_note": "1. = And its chain is weak \"Salih bin Musa Al-Talhi\". Abu Hatim said: Weak in hadith, very rejected in hadith (Munkar al-Hadith jiddan), narrates many rejected things from trustworthy narrators. And Al-Nasa'i said: Weak, and he also said: Rejected in hadith \"See Al-Tahdhib 4/ 404\". And Al-Hafiz said in Al-Taqrib \"Abandoned\". Al-Hakim narrated this hadith in his Mustadrak from Ibn Abbas, may Allah be pleased with them \"1/ 93\", and in its chain is Ismail bin Abdullah bin Abi Owais. Ahmad and Ibn Ma'in said there is no harm in him, and Ibn Abi Khaithamah and Al-Nasa'i weakened him, and Ibn Ma'in said he is worth two fils, and Al-Daraqutni said I do not choose him in the Sahih, and Saif bin Muhammad said he used to fabricate hadith \"See Al-Tahdhib 1/ 311\". Al-Hafiz Ibn Hajar said in Al-Taqrib: Truthful, he erred in hadiths from his memory, end quote. And the hadith has witnesses that raise it to the degree of authenticity without the wording \"and my Sunnah\", for its establishment is questionable as you saw from its paths, and Allah knows best. Among its witnesses is what Muslim narrated in his Sahih - Book of Virtues of the Companions - 4/ 873/ from Zaid bin Arqam, may Allah be pleased with him, and in it: \"And I am leaving among you two weighty things: the first of them is the Book of Allah, in it is guidance and light, so take the Book of Allah and hold fast to it\" so he urged upon the Book of Allah and encouraged it, then he said: \"And the people of my house, I remind you of Allah regarding the people of my house...\" The hadith. \n1. Extracted by Ibn Majah in his Sunan - Introduction - \"1/ 4\", and Ibn Abi Asim in Al-Sunnah \"1/ 26\". Ibn Majah said: Hisham bin Ammar Al-Dimashqi told us, Muhammad bin Isa bin Sumay' told us, Ibrahim bin Sulaiman Al-Aftas told us from Al-Walid bin Abdul Rahman Al-Harashi from Jubayr bin Nufayr from Abu Darda who said: The Messenger of Allah, peace and blessings be upon him, came out to us while we were mentioning poverty and fearing it, so he said: \"Is it poverty you fear? By the One in Whose hand is my soul, the world will be poured upon you abundantly until the heart of one of you does not deviate a divine deviation. And by Allah, I have left you upon the like of whiteness, its night and its day are equal\". And this is a Hasan chain: Muhammad bin Isa bin Al-Qasim bin Sumay' has slight criticism, and the preponderant view regarding him is that his hadith is fine, for Ibn Shahin and Hisham bin Ammar documented him, and Abu Dawud said =",
    "book_id": "1"
  },
  {
    "serial_number": "54407",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 30,
    "volume_number": 1,
    "text": "that I have told you about it\" (1). And he, peace and blessings be upon him, said: \"Adhere to my Sunnah and the Sunnah of the Rightly Guided Caliphs after me, hold fast to it and bite onto it with your molars, and beware of newly invented matters, for every innovation is misguidance\" (2).",
    "foot_note": "1. = and Ibn Adi: There is no harm in him. And Al-Hakim said: Upright in hadith. And Al-Daraqutni said: There is no harm in him. And Ibn Hibban said: Upright in hadith if he clarifies hearing in his report. See \"Al-Tahdhib 9/\". As for Abu Hatim's saying: A Sheikh whose hadith is written but not used as proof. And Duhaym's saying: Not from the people of hadith. Perhaps that is because of his hadith from Ibn Abi Dhi'b from Al-Zuhri regarding the killing of Uthman, for he did not hear from Ibn Abi Dhi'b but rather practiced tadlis (concealment) in this hadith so he dropped the intermediary between him and Ibn Abi Dhi'b which is \"Ismail bin Yahya\" and he used to fabricate hadith. I say: This does not necessitate discarding his hadith and not using it as proof, but if he does not declare hearing, then it is not used as proof as Ibn Hibban said. As for Hisham bin Ammar, Al-Hafiz said about him in Al-Taqrib: Truthful, reciter, he aged so he started receiving prompts, so his old hadith is more correct, end quote. And the rest of the men of the chain are trustworthy. Note: The Muhaddith Muhammad bin Nasir al-Din said in his Silsilah Al-Sahihah \"2/ 308\" regarding this hadith: And this is a Hasan chain, its men are all trustworthy, and regarding Hisham bin Ammar and Ibrahim Al-Aftas there is speech that does not lower the hadith from what we mentioned, end quote. And similarly said in Takhrij Al-Sunnah by Ibn Abi Asim 1/ 26. Thus he said - may Allah protect him - and it is a slip of the pen: For Ibrahim bin Sulaiman Al-Aftas was not criticized by anyone - as far as I know - rather Al-Hafiz Ibn Hajar said about him in Al-Taqrib \"Thiqah Thabt\" (Trustworthy, Firm) and this phrase according to a group of hadith scholars is in the highest ranks of authentication. The correct is that the one in whom there is harmless speech is: Muhammad bin Isa as preceded. And for his saying, peace and blessings be upon him: \"I have left you upon...\" there is a witness from the hadith of Al-Irbad bin Sariyah coming up. And for his saying in the hadith \"the world will be poured abundantly\" there are witnesses in the Two Sahihs, the Musnad, and the Sunan, this is not the place to expand on them. \n1. Al-Haythami said in Majma' Al-Zawa'id 8/ 263 - 264\": Narrated by Al-Tabarani and its men are men of the Sahih except Muhammad bin Abdullah bin Yazid Al-Muqri and he is trustworthy. End. \n2. Extracted by Imam Ahmad in his Musnad \"4/ 126 - 127\", and Abu Dawud in his Sunan - Book of Sunnah - \"5/ 13 - 14 - 15\", and Al-Tirmidhi in his Sunan - Book of Knowledge - \"5/ 44 - =",
    "book_id": "1"
  },
  {
    "serial_number": "54408",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 31,
    "volume_number": 1,
    "text": "So whoever listens to the Book of Allah and the Sunnah of His Messenger will find in them guidance and healing. And Allah Almighty has dispraised those who turn away from His Book and call upon the judgment of others in disputes, so the Almighty said: {And when it is said to them, \"Come to what Allah has revealed and to the Messenger,\" you see the hypocrites turning away from you in aversion} [An-Nisa - 61]. If this is known, then we say: What Allah and His Messenger, peace and blessings be upon him, legislated when visiting graves is only remembering the Hereafter, and doing good to the deceased by supplicating for him, asking for mercy upon him, seeking forgiveness for him, and asking for well-being, as in Sahih Muslim from Buraidah who said: The Messenger of Allah, peace and blessings be upon him, used to teach them when they went out to the graveyards to say: \"Peace be upon the people of the dwellings -",
    "foot_note": "1. = 45\", and Ibn Majah in his Sunan - Introduction - \"1/ 15 - 16 - 17\", and Ibn Hibban in his Sahih \"1/ 105\", and Al-Ajurri in Al-Shari'ah \"p. 47\", and Al-Marwazi in Al-Sunnah \"p. 21 - 22\", and Ibn Abi Asim in Al-Sunnah - briefly and at length - \"1/ 17 - 18 - 19 - 20 - 26 - 27 - 29 - 30\", and Al-Tabarani in Al-Kabir \"18/ 245, 246, 247\", and Al-Hakim in his Mustadrak \"1/ 95 - 96 - 97\", and in Al-Madkhal ila Al-Sahih \"p. 79 - 80 - 81\", and Al-Bayhaqi in Dala'il Al-Nubuwwah \"6/ 541\", and in Manaqib Al-Shafi'i \"1/ 10 - 11\". All of them from numerous paths from Abu Najih Al-Irbad bin Sariyah who said: The Messenger of Allah, peace and blessings be upon him, admonished us with an admonition that caused eyes to shed tears and hearts to tremble. We said: O Messenger of Allah, this is an admonition of a farewell, so what do you enjoin upon us? He said: \"I have left you upon the white (path), its night is like its day, no one deviates from it after me except he is destroyed. And whoever among you lives will see much difference, so adhere to what you know of my Sunnah, and the Sunnah of the Rightly Guided Mahdi Caliphs, and adhere to obedience...\" The hadith. Al-Tirmidhi said: A Hasan Sahih hadith. And Al-Hakim said: This is a Sahih hadith having no defect, and Al-Dhahabi affirmed him on this. And Sheikh al-Islam Abu Al-Abbas Ibn Taymiyyah, may Allah have mercy on him, authenticated it \"in Iqtida' Al-Sirat Al-Mustaqim - 2/ 579\", and Al-Hafiz Ibn Kathir said in \"Tuhfat Al-Talib p. 163\" authenticated by Al-Hafiz Abu Nu'aym Al-Asbahani, and Al-Dughuli, and Sheikh al-Islam Al-Ansari said: It is the best hadith among the people of Sham and the finest, end quote.",
    "book_id": "1"
  },
  {
    "serial_number": "54409",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 32,
    "volume_number": 1,
    "text": "And in a wording - \"Peace be upon you, people of the dwellings from the believers and Muslims, and we, if Allah wills, will join you (1). We ask Allah for us and for you well-being\" (2). And in Sunan Abu Dawud from Abu Hurairah that the Messenger of Allah, peace and blessings be upon him, said: \"If you pray over the dead, then be sincere in supplication for him\" (3). And from Aisha, may Allah be pleased with her, from the Prophet, peace and blessings be upon him: \"There is no dead person over whom a nation of Muslims reaches a hundred, all interceding for him, except that they are granted intercession for him\" (4). So after burial it is more appropriate and worthy. So the people of Shirk substituted a saying other than what was said to them, they substituted supplicating for him with supplicating to him, and interceding for him with seeking intercession through him, and they intended by the visit which the Messenger of Allah, peace and blessings be upon him, legislated as kindness to the deceased, asking the deceased, and singling out that spot for supplication which is the marrow of worship by the text of the Messenger of Allah, peace and blessings be upon him. From Anas bin Malik, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: \"Supplication is the marrow of worship\" narrated by",
    "foot_note": "1. In \"B\" \"Lahiqoon\" and this wording was reported from Aisha at Muslim. \n2. Extracted by Muslim in his Sahih - Book of Funerals \"2/ 671\" \n3. Extracted by Abu Dawud in his Sunan - Book of Funerals - \"3/ 538\", and Ibn Majah in his Sunan - Book of Funerals - \"1/ 480\" both from the path of Muhammad bin Salamah Al-Harrani from Muhammad bin Ishaq from Muhammad bin Ibrahim from Abu Salamah bin Abdul Rahman bin Awf from Abu Hurairah who said: The Messenger of Allah, peace and blessings be upon him, was heard... so he mentioned it. And its chain is good except that Ibn Ishaq is a Mudallis and he used 'an'ana (said 'from') but he declared narration (tahdith) at Ibn Hibban as in -Al-Mawarid- \"p. 192\" so this defect disappeared praise be to Allah. \n4. Extracted by Imam Ahmad \"3/ 266\", \"6/ 32 - 40 - 97 - 231\", and Muslim in his Sahih - Book of Funerals - \"2/ 654\" both from the path of Abdullah bin Yazid from Aisha... with it.",
    "book_id": "1"
  },
  {
    "serial_number": "54410",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 33,
    "volume_number": 1,
    "text": "Al-Tirmidhi (1), and from Al-Nu'man bin Bashir who said: The Messenger of Allah, peace and blessings be upon him, said: \"Supplication is worship\" - then the Messenger of Allah, peace and blessings be upon him, recited: {And your Lord says, \"Call upon Me; I will respond to you\"} the verse [Ghafir - 60], narrated by Ahmad, Al-Tirmidhi, Abu Dawud, An-Nasa'i and Ibn Majah (2). It is impossible that calling upon the dead is legislated, and the generations turn away from it",
    "foot_note": "1. Extracted by Al-Tirmidhi in his Sunan - Book of Supplication - \"5/ 456\" and said: A Gharib (strange) hadith from this aspect, we do not know it except from the hadith of Ibn Lahi'ah, end quote. And he is weak in hadith according to them, and in the chain is Al-Walid bin Muslim who is a Mudallis and he used 'an'ana. \n2. Extracted by Imam Ahmad in his Musnad \"4/ 267 - 271 - 276 - 277\", and Abu Dawud in his Sunan - Book of Prayer - \"2/ 161\", and Al-Tirmidhi in his Sunan - Book of Tafsir - \"5/ 211\" and in - Book of Supplication - \"5/ 456\", and Ibn Majah in his Sunan - Book of Supplication - \"2/ 1258\", and Ibn Al-Mubarak in Al-Zuhd \"p. 459\", and Al-Tayalisi in his Musnad \"p. 108\", and Ibn Abi Shaybah in Al-Musannaf \"10/ 200\", and Al-Bukhari in Al-Adab Al-Mufrad \"2/ 178\", and Ibn Jarir Al-Tabari in his Tafsir \"24/ 78 - 79\", and Ibn Hibban in his Sahih - Al-Mawarid - \"p. 595\", and Al-Tabarani in Al-Saghir \"2/ 97\", and Al-Hakim in his Mustadrak \"1/ 490 - 491\", and Al-Baghawi in Sharh Al-Sunnah \"5/ 184\", and in his Tafsir - Ibn Kathir's footnote - \"7/ 309\", and Al-Quda'i in Musnad Al-Shihab \"1/ 51\", and Abu Nu'aym in Al-Hilyah \"8/ 120\" all of them from the path of Yusay' bin Ma'dan from Al-Nu'man bin Bashir raised... with it and its chain is authentic. Al-Hakim authenticated it and Al-Dhahabi affirmed him, and Al-Tirmidhi said Hasan Sahih, and Al-Nawawi authenticated it, as in Al-Adhkar, and Al-Hafiz said in Al-Fath its chain is good \"1/ 49\", and Al-Sakhawi declared it Hasan - as in Sharh Al-Adhkar - by Ibn Allan \"7/ 191\". Al-Suyuti attributed the hadith in Al-Durr Al-Manthur \"7/ 301\" to Sa'id bin Mansur, Abd bin Hamid, Ibn Al-Mundhir, Abu Hatim, Ibn Mardawayh, Abu Nu'aym in Al-Hilyah \"8/ 120\", and Al-Bayhaqi in Shu'ab Al-Iman all from Al-Nu'man bin Bashir .. with it. And Al-Khatib extracted it in his History \"12/ 279\", and Ibn Mardawayh - as in Al-Durr - \"7/ 301\" and Abu Ya'la - as in Sharh Al-Adhkar - \"7/ 191\" from Al-Bara' bin Azib, may Allah be pleased with him.",
    "book_id": "1"
  },
  {
    "serial_number": "54411",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 34,
    "volume_number": 1,
    "text": "The three preferred ones (1) by the text of the Messenger of Allah, peace and blessings be upon him (2), then pause at it",
    "foot_note": "1. Not in \"B\". \n2. Extracted by Imam Ahmad \"1/ 378 - 417 - 434 - 438 - 442\", and Al-Bukhari in his Sahih \"5/ 259\" \"7/ 3\" and \"244 - 543\", and Muslim in his Sahih \"4/ 1962 - 196\", all of them from the path of Ubaidah Al-Salmani from Ibn Masoud who said: The Messenger of Allah, peace and blessings be upon him, said: \"The best of my nation is the generation that follows me, then those who follow them, then those who follow them, then a people will come whose testimony precedes their oath\" this is Muslim's wording. And in a wording of his \"My generation then those who follow them, then those who follow them...\". And Ahmad extracted it in his Musnad \"4/ 427 - 436\", and Al-Bukhari in his Sahih \"5/ 258\" and \"7/ 3\" and \"11/ 244 - 580\", and Muslim in his Sahih \"4/ 1964\" all of them from the path of Zahdam bin Mudarrib who said: I heard Imran bin Husain narrating that the Messenger of Allah, peace and blessings be upon him, said: \"Indeed the best of you is my generation, then those who follow them, then those who follow them, then those who follow them\". Imran said: \"I do not know if the Messenger of Allah, peace and blessings be upon him, said after his generation, two generations or three...\" The hadith, this is Muslim's wording. And extracted by Imam Ahmad in his Musnad \"4/ 426 - 440\", and Muslim in his Sahih \"4/ 1965\" both from the path of Zurarah bin Awfa from Imran... with it. And extracted by Ahmad in the Musnad \"4/ 426\" from the path of Hilal bin Yasaf from Imran bin Husain... with it. And extracted by Ahmad \"6/ 156\", and Muslim in his Sahih \"4/ 1965\" both from the path of Abdullah Al-Bahi from Aisha who said: A man asked the Prophet, peace and blessings be upon him, which people are best? He said: \"The generation I am in, then the second, then the third\" this is Muslim's wording. And extracted by Imam Ahmad \"4/ 267\" from the path of Asim bin Bahdalah from Khaythamah bin Abdul Rahman and Al-Sha'bi from Al-Nu'man bin Bashir who said: The Messenger of Allah, peace and blessings be upon him, said: \"The best of people is my generation, then those who follow them, then those who follow them, then those who follow them...\" The hadith. And extracted by Ahmad \"4/ 276 - 277\" from Khaythamah bin Abdul Rahman from Al-Nu'man bin Bashir... with it. And in the chapter from a group of Companions other than those we mentioned.",
    "book_id": "1"
  },
  {
    "serial_number": "54412",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 35,
    "volume_number": 1,
    "text": "The Khuluf (successors) (1) who say what they do not do, and do what they are not ordered. So this is the Sunnah of the Messenger of Allah, peace and blessings be upon him, and this (2) is the way of the Companions and those who followed them in goodness. Was it reported from any of them with an authentic or hasan (4) transmission (3) that if they had a need they intended the graves and supplicated near them, and rubbed against them, let alone asking their occupants to bring benefits and remove hardships? It is known that something like this is what motivations and incentives abound to transmit, and they had among them many graves of the companions of the Messenger of Allah, peace and blessings be upon him, in the regions, so they were plentiful. Yet none of them sought aid at a grave nor called upon it, nor sought healing by it, nor sought victory by it, nor did any of the Companions seek aid from the Prophet, peace and blessings be upon him, after his death, nor from other prophets, nor did they intend to supplicate at the graves of the prophets, nor pray at them. If there is (5) an authentic or hasan trace regarding this, then show it to us. Rather, what is authentic from them contradicts what you went to. And when people suffered drought in the time (6) of Umar bin Al-Khattab, he sought rain through Al-Abbas and sought means through his supplication and said: \"O Allah, we used to seek means to You through our Prophet so You would give us rain, and we seek means to You through the uncle of our Prophet so give us rain,\" and they would be given rain as (7) established in Sahih Al-Bukhari in the Book (8) of Seeking Rain from his Sahih (9).",
    "foot_note": "1. In \"B\" \"Al-Khalaf\". \n2. In \"B\" \"Fahadhihi\". \n3. In \"A\" \"binaql\". \n4. In \"B\" \"naqlan sahihan aw hasanan\" which is an error. What I established is from \"A\" and from \"Ighathat Al-Lahfan\" by Ibn Al-Qayyim \"1/ 202\" from which the author quoted these lines with modification. \n5. In \"B\" \"minha\". \n6. In \"A\" \"zaman\". \n7. \"Kama\" is omitted from \"A\". \n8. In \"B\" \"Bab\" which is an error. \n9. Extracted by Al-Bukhari in his Sahih - Book of Seeking Rain - \"2/ 494\", and in Virtues of the Companions \"7/ 77\" from Anas bin Malik, may Allah be pleased with him.",
    "book_id": "1"
  },
  {
    "serial_number": "54413",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 36,
    "volume_number": 1,
    "text": "And we know by necessity that the Prophet, peace and blessings be upon him, did not legislate for his nation to call upon any of the dead, neither the prophets, nor the righteous, nor others, neither with the word of Istighatha (seeking aid), nor with anything else. Rather, we know that he forbade all these things, and that this is from the major Shirk which Allah and His Messenger forbade (1). The Almighty said: {And [He revealed] that the masjids are for Allah, so do not invoke",
    "foot_note": "1. Sheikh al-Islam Abu Al-Abbas Ibn Taymiyyah said in his response to Al-Bakri \"p. 232\": Asking the dead and the absent, whether prophet or otherwise, is among the forbidden abominations by agreement of the Imams of Muslims. Allah did not order it nor His Messenger, nor did any of the Companions or those who followed them in goodness do it, nor did any of the Imams of Muslims deem it desirable. And this is among what is known by necessity from the religion of Muslims that none of them used to say: If a calamity befell him or a need presented itself to a dead person, O my master so-and-so I am in your protection or fulfill my need. As some of these polytheists say to those they call upon from the dead and absent. And none of the Companions, may Allah be pleased with them, sought aid from the Prophet, peace and blessings be upon him, after his death nor from other prophets, neither at their graves nor when they were far from them. They used to stand in those great situations facing the polytheists in fighting and the difficulty intensified for them and they thought thoughts, yet with this none of them sought aid from a prophet nor other creatures, nor did they swear by a creature to Allah at all, nor did they intend to supplicate at the graves of prophets nor graves of non-prophets nor pray at them. And scholars like Malik and others disliked that a man stand at the grave of the Prophet, peace and blessings be upon him, supplicating for himself and mentioned that this is from the innovations that the Salaf did not do, end quote. And he said, may Allah have mercy on him and settle him in the highest Paradise - as in Majmu' Al-Fatawa by Ibn Qasim \"1/ 159\": For supplicating to angels and prophets after their death and in their absence and asking them and seeking aid from them and seeking intercession through them in this state and erecting their statues - meaning seeking intercession from them - is from the religion that Allah did not legislate nor send a messenger with nor reveal a book with, and it is not obligatory nor desirable by agreement of Muslims, nor did any of the Companions or those who followed them in goodness do it, nor did any Imam of the Muslims order it. Even if it is something done by many people who have worship and asceticism and they mention stories and dreams about it, all this is from Satan, end quote. And see Al-Fatawa \"1/ 160 - 161 - 162\".",
    "book_id": "1"
  },
  {
    "serial_number": "54414",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 37,
    "volume_number": 1,
    "text": "with Allah anyone} [Al-Jinn - 18], and the Almighty said: {And who is more astray than he who invokes besides Allah those who will not respond to him until the Day of Resurrection, and they, of their invocation, are unaware. And when the people are gathered, they will be enemies to them and be deniers of their worship} [Al-Ahqaf 5 - 6], and the Almighty said: {So do not invoke with Allah another deity and [thus] be among the punished} [Ash-Shu'ara - 213], and the Almighty said: {To Him is the supplication of truth. And those they call upon besides Him do not respond to them with a thing} the verse [Ar-Ra'd - 14], and the Almighty said: {And do not invoke besides Allah that which neither benefits you nor harms you, for if you did, then indeed you would be of the wrongdoers} [Yunus - 106], and the Almighty said: {And those whom you invoke other than Him do not possess [as much as] the membrane of a date seed. If you invoke them, they do not hear your supplication; and if they heard, they would not respond to you. And on the Day of Resurrection they will deny your association...} [Fatir - 13 - 14], and the Almighty said: {Say, \"Invoke those you have claimed [as gods] besides Him, for they do not possess the [ability for] removal of adversity from you or [for its] transfer.\" Those whom they invoke seek means of access to their Lord, [striving as to] which of them would be nearest, and they hope for His mercy and fear His punishment. Indeed, the punishment of your Lord is ever feared} [Al-Isra - 56 - 57]. Mujahid said seeking means of access to their Lord is: Jesus, Uzair and the angels (1). And likewise said Ibrahim Al-Nakha'i said: Ibn Abbas used to say regarding His saying: {Those whom they invoke seek means of access to their Lord} [Al-Isra - 57] it is: (2) Uzair, the Messiah, the sun and the moon (3).",
    "foot_note": "1. Extracted by Ibn Jarir Al-Tabari in Al-Tafsir \"15/ 106\" from the path of Ibn Abi Najih from Mujahid... with it. And Ibn Abi Najih is named Abdullah bin Yasar, trustworthy, except that he did not hear tafsir from Mujahid, stated by Yahya bin Sa'id and Ibn Hibban. And Sheikh al-Islam said in his response to Al-Bakri \"p. 283\": And in the authentic Tafsir from Mujahid... so he mentioned it. \n2. In \"B\" \"Isa\". \n3. Extracted by Ibn Jarir in his Tafsir \"15/ 106\" from the path of Al-Nakha'i Ibrahim Yazid from Ibn Abbas and Al-Nakha'i did not hear from him as stated by Ali bin Al-Madini and others. [See Al-Tahdhib 1/ 177]. =",
    "book_id": "1"
  },
  {
    "serial_number": "54415",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 38,
    "volume_number": 1,
    "text": "And from Al-Suddi from Abu Salih (1) from Ibn Abbas who said: Jesus, his mother and Al-Uzair (2). And from Abdullah bin Masoud who said: It was revealed regarding a group of Arabs who used to worship a group of Jinn, so the Jinn embraced Islam and the humans who used to worship them did not know of their Islam, so this verse was revealed. This was established from him in Sahih Al-Bukhari, he mentioned it in the Book of Tafsir (3). These sayings regarding the meaning of the verse are all true, for the verse encompasses everyone whose worshipped one is a worshipper of Allah, whether from the angels, or from the Jinn, or from humans. So the verse addresses everyone who invoked besides Allah an invoked one, and that invoked one seeks",
    "foot_note": "1. = And this trace was extracted - as in Al-Durr - \"5/ 306\" by Sa'id bin Mansur and Ibn Al-Mundhir. Benefit: The Imam of Ahl al-Sunnah Abu Abdullah Ahmad bin Hanbal, may Allah have mercy on him, said \"Three sciences have no origins: Maghazi, Malahim, and Tafsir\" and in a wording \"have no chains of transmission\". Sheikh al-Islam Abu Al-Abbas Ibn Taymiyyah, may Allah have mercy on him, said in his response to Al-Bakri 1/ 18: \"And the meaning of that is that most of it is Mursal and disconnected\", end quote. \n1. In \"B\" \"from Abu Hurairah\" and in \"A\" \"from Abi\" and both are errors and the correction is from Ibn Jarir's Tafsir, and from the Response to Al-Bakri by Sheikh al-Islam from which the author quoted these interpretations p. 284 - 285. \n2. Extracted by Ibn Jarir in his Tafsir \"15/ 106\" and its chain is weak, Abu Salih is the freed slave of Umm Hani, weak, Mudallis and did not hear from Ibn Abbas. Sheikh al-Islam Abu Al-Abbas said in his response to Al-Bakri \"1/ 17\": Abdullah bin Ahmad said I heard my father say: Ibn Mahdi abandoned Abu Salih Badham. And Sufyan and others weakened him and Al-Sha'bi used to hold his ear and say: \"Woe to you, you do not memorize the Quran, and you interpret the Quran\" and Mujahid used to forbid his interpretation, stated by Al-Bukhari, end quote. And Al-Suyuti attributed this trace to Ibn Abi Shaybah, Ibn Al-Mundhir, Ibn Abi Hatim and Ibn Mardawayh. \n3. Extracted by Al-Bukhari in his Sahih - Book of Tafsir - \"8/ 398\", and Muslim in his Sahih - Book of Tafsir - \"4/ 2321\". And the wording is Muslim's.",
    "book_id": "1"
  },
  {
    "serial_number": "54416",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 39,
    "volume_number": 1,
    "text": "means of access to Allah and hopes for His mercy, and fears His punishment. So everyone who invokes a dead or absent person from the prophets and righteous people, this verse covers him. It is known that the polytheists ask the righteous in the sense that they are intermediaries between them and Allah, and despite this, Allah forbade invoking them, and clarified that they do not possess the removal of harm from the caller (1) nor its transfer, they do not lift it completely, nor transfer it from one place to another, like changing its description or amount, and for this He said {nor transfer} so He mentioned an indefinite noun (2) to encompass types of transfer. So everyone who invokes a dead person from the prophets, or righteous people, or invokes angels, or invokes Jinn, has invoked one who does not aid him, and possesses neither removal of harm from him nor transfer. And these polytheists today, among them are those who if distress (3) befalls them, they do not call except their Sheikh, and do not mention except his name, he has become fond of it as the child is fond (4) of mentioning his mother. So if one of them stumbles he says: O Ibn Abbas, or O Mahjoub. And among them are those who swear by Allah and lie, and swear by Ibn Abbas or others so they tell the truth and do not lie, so the creature becomes greater in his chest than the Creator. So if calling upon the dead implies this mockery of religion, and this opposition to the Lord of the Worlds (5), then which of the two parties is more deserving of mockery (6)",
    "foot_note": "1. In \"B\" \"The callers\". \n2. In \"A\" \"The indefinite noun\". \n3. In \"B\" \"Distresses\". \n4. In \"A\" \"As the lizard might be fond\" and what is in \"B\" is in agreement with what is in \"Response to Al-Bakri\" by Sheikh al-Islam \"p. 352\" from which the author quoted this phrase. \n5. In \"B\": \"To Allah and His Book\". \n6. In \"B\": \"In Allah\" which is an error.",
    "book_id": "1"
  },
  {
    "serial_number": "54417",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in response to those who did not rule by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 40,
    "volume_number": 1,
    "text": "and opposition to Allah (1)? Is it the one who calls upon the dead, and seeks aid from them, or orders that, or the one who does not call upon anyone except Allah alone with no partner as His messengers commanded, and obligates obedience to the Messenger, and following him in everything he brought. And we, praise be to Allah, are among the greatest in obligating the observance of the Messenger's side, believing him in what he informed, and obeying him in what he commanded, and caring to know what he was sent with, and following that rather than what contradicts it, acting upon His saying: {Follow what has been revealed to you from your Lord and do not follow other than Him any allies. Little do you remember} [Al-A'raf - 3], and His saying: {And this is a Book We have revealed [which is] blessed, so follow it and fear Allah that you may receive mercy} [Al-An'am - 155]. And with us, and praise be to Allah, are two great principles. One of them: That (2) we do not worship except Allah, so we do not call except Him, and we do not slaughter sacrifice except for His face, and we do not hope except in Him, and we do not rely except upon Him alone with no partner (3). And the second principle: That (4) we do not worship Him except with what He legislated, we do not worship Him with innovated worship. And these two principles are the realization of the testimony that there is no god but Allah and Muhammad is the Messenger of Allah (5). For the testimony that there is no god but Allah implies the sincerity of divinity to Allah, so the heart does not deify, nor the tongue, nor the limbs other than Him (6), neither with love, nor fear, nor reverence, nor desire, nor dread (7). And the testimony that Muhammad",
    "foot_note": "1. The word \"to Allah\" is not in \"B\". \n2. Not in \"B\" and in the printed version \"that\". \n3. His saying \"alone with no partner\" is not in \"A\". \n4. In \"B\" \"that\". \n5. And these two principles were mentioned by Sheikh al-Islam Abu Al-Abbas - may Allah have mercy on him - in many places in his books and he established and grounded them, may Allah reward him on our behalf with all good. See Al-Fatawa by Ibn Qasim Vol \"1/ 80 - 189 - 310 - 333 - 365\", Vol \"10 - 172\", Vol \"11/ 50 - 53 - 585 - 617 - 619\", Vol \"28 - 23\", Vol \"18 - 317 - 352\". \n6. In \"A\" \"other than Him\" and in the printed version \"with other than Him\". \n7. In \"B\" \"and like them\".",
    "book_id": "1"
  },
  {
    "serial_number": "54418",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 41,
    "volume_number": 1,
    "text": "The Messenger of Allah implies believing him in all that he reported, obeying him, and following him in all that he commanded. So whatever he affirmed must be affirmed, and whatever he negated must be negated... Al-Bukhari reported from the hadith of Abu Hurairah that the Messenger of Allah, may Allah's peace and blessings be upon him, said: \"All of my Ummah will enter Paradise except those who refuse.\" They said: \"And who refuses, O Messenger of Allah?\" He said: \"Whoever obeys me enters Paradise, and whoever disobeys me has refused\" (1). If this is established (2), then we say: What we believe and profess as religion to Allah is that whoever calls upon a prophet, a saint (Wali), or anyone else, asking them to fulfill needs and relieve distress, this is among the greatest Shirk (polytheism) for which Allah declared the polytheists to be disbelievers, as they took allies and intercessors through whom they sought to attract benefits and repel harms according to their claims. Allah the Exalted says: {And they worship other than Allah that which neither harms them nor benefits them, and they say, \"These are our intercessors with Allah\"... up to His saying... Exalted is He and high above what they associate with Him} [Yunus: 18]. So whoever makes the prophets or others, such as Ibn Abbas, Al-Mahjoub, or Abu Talib (3), intermediaries whom they invoke, rely upon, and ask to bring",
    "foot_note": "1. Reported by Imam Ahmad in his Musnad \"2/361\", and Al-Bukhari in his Sahih - Book of Holding Fast to the Quran and Sunnah - \"13 - 249\", both via the path of Ata' bin Yasar from Abu Hurairah, who said the Messenger of Allah, may Allah's peace and blessings be upon him, said... and he mentioned it.\n2. In \"B\": \"If this is known\".\n3. Thus in all copies. It is not far-fetched for the grave-worshippers to invoke Abu Talib besides Allah, even though he died upon Shirk by consensus, due to the corruption of their natural disposition, the cloudiness of their understanding, the effacement of their intellects, and the darkness of their hearts. Sheikh ul-Islam Muhammad bin Abdul-Wahhab said: Know that the Shirk of the earlier ones was lighter than the Shirk of the people of our time in two aspects: First: The earlier ones did not commit Shirk and invoke angels, saints, and idols alongside Allah except in times of ease, but in times of hardship, they would be sincere to Allah, unlike the people of our time. Second: The earlier ones invoked alongside Allah people who were close to Allah, either prophets, saints, or angels, or they invoked stones or trees that are obedient to Allah and not disobedient, whereas the people of our time =",
    "book_id": "1"
  },
  {
    "serial_number": "54419",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 42,
    "volume_number": 1,
    "text": "benefits and repel harms, in the sense that the creation asks them and they ask Allah—just as intermediaries at the courts of kings ask the kings for the people's needs due to their proximity to them, and the people ask them out of politeness so as not to (1) directly ask the king, or because they are closer to the king—whoever establishes them as intermediaries in this manner is a disbelieving polytheist (Kafir Mushrik), whose wealth and blood are lawful. The scholars, may Allah have mercy on them, have stated this textually and cited consensus on it. It is stated in Al-Iqna' and its explanation (2): \"And whoever places intermediaries between himself and Allah, relying on them, invoking them, and asking of them, has disbelieved by consensus (3), because that is like the action of the idol worshippers who say: {We only worship them that they may bring us nearer to Allah in position} [Az-Zumar: 3].\" End quote. And Imam Abu Al-Wafa Ali bin Aqil Al-Hanbali—may Allah the Exalted have mercy on him—said (4):",
    "foot_note": "1. \"An\" (that/to) is missing from \"B\". What is in \"A\" corresponds to the Fatwa of Sheikh ul-Islam Ibn Taymiyyah titled \"The Intermediary between the Truth [Allah] and Creation,\" from which the author quoted these lines. See Majmoo' Fatawa Sheikh ul-Islam by Ibn Qasim 1/124-126.\n2. \"6/168-469\".\n3. In \"A\" it is \"Ijma'un\" (nominative), which is a grammatical error.\n4. Ibn Aqil Al-Hanbali has many works, of which only a scant amount has reached us. Perhaps these words are in his book \"Al-Funun,\" most of which has been lost for a long time—as far as I know. The author copied this phrase of Ibn Aqil from \"Ighathat Al-Lahfan\" by Imam Ibn al-Qayyim, may Allah have mercy on him \"1/195\". Note: Ibn Aqil, although a Hanbali in jurisprudence (Furu'), was not a Hanbali in creed (Usul). Sheikh ul-Islam Abu Al-Abbas [Ibn Taymiyyah], may Allah have mercy on him, said in Al-Dar' \"8/60\": Ibn Aqil has various types of speech, for he was among the smartest of the world, engaging in much thought and consideration of people's speech. Sometimes he takes the path of those who negate the reported attributes (Sifat Khabariyyah) and rebukes those who call them attributes, saying: They are only annexations (Idafat), agreeing with the Mu'tazila, as he did in his book \"Dhamm =",
    "book_id": "1"
  },
  {
    "serial_number": "54420",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 43,
    "volume_number": 1,
    "text": "\"When the religious obligations became difficult for the ignorant and the rabble, they diverted from the established practices of the Shari'ah to glorifying practices they established for themselves, which were easy for them since they did not enter under the command of another by doing them.\" He said: \"And in my view, they are disbelievers due to these practices; such as glorifying graves, honoring them, and adhering to (1) what the Shari'ah has forbidden regarding them, such as lighting fires, taking their soil for blessings, pouring perfume on the graves, undertaking journeys to them, and hanging rags on trees, imitating those who worshipped Al-Lat and Al-Uzza.\" End of his words. And Imam Al-Bakri Al-Shafi'i, may Allah have mercy on him, said in his Tafsir regarding His saying:",
    "foot_note": "1. = al-Tashbih wa Ithbat al-Tanzih\" (Censure of Anthropomorphism and Affirmation of Transcendence) and other books of his. And sometimes he affirms the reported attributes and refutes the negators and the Mu'tazila with various clear proofs. Sometimes he obligates metaphorical interpretation (Ta'wil) as he did in \"Al-Wadih\" and others, and sometimes he forbids Ta'wil, censures it, and prohibits it, as he did in the book \"Al-Intisar li-Ashab al-Hadith\" (Victory for the People of Hadith). Thus, there exists in his speech eloquent, good speech that is honored and thanked, and speech contrary to the Sunnah and Truth that is blameworthy and rejected... etc. End quote summarized. This indicates that the man was fluctuating in creed. However, Ibn Rajab said in Al-Dhayl 'ala al-Tabaqat \"1/144\": It appears from him—meaning Ibn Aqil—at certain times a type of deviation from the Sunnah and interpretation of some attributes, and some of that remained in him until he died, may Allah have mercy on him. End quote. And Imam Al-Dhahabi, may Allah have mercy on him, said in Al-Mizan \"3/146\": Except that he—meaning Ibn Aqil—contradicted the Salaf and agreed with the Mu'tazila in several innovations; we ask Allah for pardon and safety, for excessive immersion in Kalam (speculative theology) may harm its companion, and from the excellence of one's Islam is leaving what does not concern him. End quote. Al-Dhahabi also mentioned in \"Ma'rifat al-Qurra' al-Kibar\" 1/308 that Ibn Aqil had a taint of I'tizal, Jahmism, and deviation from the Sunnah. End quote. Investigating the scholars' words on this would take too long. The intent is merely to provide a note.\n1. In \"A\": \"And binding themselves to them\".",
    "book_id": "1"
  },
  {
    "serial_number": "54421",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 44,
    "volume_number": 1,
    "text": "The Exalted said: {And those who take protectors besides Him [say], \"We only worship them that they may bring us nearer to Allah in position\"} [Az-Zumar: 3]. When the disbelievers were asked who created the heavens and the earth, they said \"Allah.\" But when asked about the worship of idols, they said: \"We only worship them to bring us nearer to Allah in position\" (1), for the sake of seeking their intercession with Allah. This is disbelief (Kufr) on their part. End of his words. So reflect on what the author of Al-Iqna' mentioned, as well as (2) what Ibn Aqil mentioned regarding the glorification of graves and addressing the dead with needs, and that this is Kufr. And Al-Hafiz Imad Ad-Din (3) Ibn Kathir, may Allah have mercy on him, said in his Tafsir (4) regarding His saying: {And those who take protectors besides Him [say], \"We only worship them that they may bring us nearer to Allah in position\"}: Meaning, what drove them to worship them (5) was that they turned to idols which they adopted in the forms of the Angels who are close [to Allah] according to their claim. So they worshipped those images, treating that as equivalent to worshipping the Angels, so that they might intercede for them with Allah regarding their victory, their provision, and whatever worldly matters befell them. As for the Hereafter, they were deniers of it and disbelievers in it (6). Qatadah, Al-Suddi, and Malik, citing Zaid bin Aslam and Ibn Zaid, said regarding {Except that they may bring us nearer to Allah}: Meaning,",
    "foot_note": "1. \"Zulfa\" (in position/nearness) is missing from \"A\".\n2. In \"A\": \"And likewise\".\n3. In \"A\": \"Al-Imad,\" both are correct.\n4. 4/45.\n5. \"Lahu\" (them) is missing from the copies, and I established it from Ibn Kathir.\n6. As Allah the Exalted said: {Those who disbelieve claim that they will never be resurrected. Say, \"Yes, by my Lord, you will surely be resurrected; then you will surely be informed of what you did. And that, for Allah, is easy.\"}.",
    "book_id": "1"
  },
  {
    "serial_number": "54422",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 45,
    "volume_number": 1,
    "text": "to intercede for us and bring us closer to Him. For this reason, they used to say in their Talbiyah when they performed Hajj in their times of ignorance: \"Labbaik (Here I am), You have no partner, except a partner who is Yours; You own him and what he owns\" (1). This doubt (shubha) is what the polytheists relied upon in ancient times and modern ones. The Messengers—may the prayers of Allah and His peace be upon them—came to reject this, forbid it, and call to singling out worship for Allah alone who has no partner, and [to declare] that this is something the polytheists invented from themselves which Allah did not authorize, nor was He pleased with; rather, He detested it and forbade it. The Exalted said: {And We certainly sent into every nation a messenger, [saying], \"Worship Allah and avoid Taghut\"} [An-Nahl: 36], and He said: {And We sent not before you any messenger except that We revealed to him that, \"There is no deity except Me, so worship Me\"} [Al-Anbiya: 25]. And He informed that the Angels in the heavens, the close ones and others, are all servants humble before Allah; they do not intercede with Him except by His permission for whom He is pleased. They are not like princes with their kings who intercede with them without their permission regarding what the kings love or hate (2). {So do not assert similarities to Allah} [An-Nahl: 74]; Exalted is Allah above that with a great (3) height. End of his words. And Imam Al-Bakri, may Allah have mercy on him, said regarding the saying of the Exalted: {Say, \"Who provides for you from the heaven and the earth? Or who controls hearing and sight...\"} [Yunus: 31]: If you say: If they acknowledged that, then how did they worship idols? I say: All of them",
    "foot_note": "1. Reported by Muslim in his Sahih - Book of Hajj 2/843 from Ibn Abbas who said: The polytheists used to say: \"Labbaik, You have no partner.\" He said: The Messenger of Allah, may Allah's peace and blessings be upon him, would say: \"Woe to you! Stop! Stop!\" Then they would say: \"Except a partner who is Yours; You own him and what he owns.\" They would say this while circumambulating the House.\n2. In \"B\": \"And they hated it\" (wa abghaduhu), and in Ibn Kathir \"wa abuhu\" (and they refused it); all are correct.\n3. \"With a great height\" is not in \"A\".",
    "book_id": "1"
  },
  {
    "serial_number": "54423",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 46,
    "volume_number": 1,
    "text": "believed by worshipping idols that they were worshipping Allah the Exalted and drawing closer to Him, but (1) through different ways. One group said: We do not have the eligibility to worship Allah the Exalted without an intermediary due to His greatness, so we worshipped them to bring us closer to Him in position. Another group said: The Angels have status and rank with Allah, so we adopted idols in the form of Angels to bring us closer to Allah in position. Another group said: We made the idols a Qiblah (direction) for us in worship, just as the Kaaba is a Qiblah in worshipping Him. And another group believed that every idol has a devil appointed by Allah's command; whoever worshipped the idol with its due worship, the devil would fulfill his needs by Allah's command, otherwise his devil would afflict him with a calamity by the command of Allah the Exalted. End of his words. So look at the speech of these Imams and their explicit statement that the polytheists only intended, from those they worshipped, closeness to Allah and seeking their intercession with Allah. And reflect on what Ibn Kathir mentioned, and what he narrated from Zaid bin Aslam and Ibn Zaid, then said: And this doubt is (2) what the polytheists relied upon in ancient times and modern ones, and the Messengers, may Allah's prayers and peace be upon them, came to reject it and forbid it. And reflect on what Al-Bakri, may Allah have mercy on him, mentioned regarding the verse of Az-Zumar: That the disbelievers only intended intercession from those they worshipped (3). Then he explicitly stated that this is Kufr (disbelief). Thus, whoever reflects on what Allah the Exalted mentioned in His Book will see that the disbelievers only intended, from those they worshipped, closeness to Allah and seeking their intercession with Allah. For they did not believe about them that they create the creatures, send down rain, or grow plants. Rather, they acknowledged that the Doer of that is Allah alone. The Exalted said: {Say, \"Who provides for you from the heaven and the earth? Or who controls hearing and sight...\" - up to His saying - \"They will say, 'Allah.' Say, 'Then will you not fear Him?'\"}",
    "foot_note": "1. In \"B\": \"We\", which is an error.\n2. \"Is\" (Hiya) is not in \"A\".\n3. Not in \"A\".",
    "book_id": "1"
  },
  {
    "serial_number": "54424",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 47,
    "volume_number": 1,
    "text": "[Yunus: 31]. And The Exalted said: {And if you asked them, \"Who created the heavens and earth and subjected the sun and the moon?\" they would surely say, \"Allah.\" Then how are they deluded?} [Al-Ankabut: 61]. And The Exalted said: {Say, \"To whom belongs the earth and whoever is in it, if you should know?\" They will say, \"To Allah.\" Say, \"Then will you not remember?\" Say, \"Who is Lord of the seven heavens and Lord of the Great Throne?\" They will say, \"[They belong] to Allah...\"} [Al-Mu'minun: 84-85]. Along with other verses in which Allah informs that the polytheists admit that Allah is the Creator, the Sustainer (1). They only worshipped them to bring them closer and intercede for them, as He, the Glorified, mentioned regarding their saying: {And they say, \"These are our intercessors with Allah\"} [Yunus: 18]. So Allah sent the Messengers and revealed the Books so that He would be worshipped (2) alone, and no other god be set up with Him. And He, the Glorified, informed that intercession belongs entirely to Him, and that no one intercedes with Him except by His permission, and that He does not grant permission except for one whose speech and action He is pleased with, and He is not pleased with anything but Tawhid (Monotheism). Thus, intercession is restricted by these conditions. The Exalted said: {Or have they taken other than Allah as intercessors? Say, \"Even though they do not possess anything, nor do they reason?\" Say, \"To Allah belongs [the right to allow] intercession entirely...\"} [Az-Zumar: 43],",
    "foot_note": "1. Sheikh ul-Islam said in the Refutation of Al-Bakri \"p. 184-185\": And this Tawhid, the Tawhid of general Lordship (Rububiyyah), which the polytheists acknowledged, does not alone save one from the Fire, nor does it admit one into Paradise. Rather, the saving Tawhid is the testimony that there is no deity but Allah and that Muhammad is the Messenger of Allah, such that one acknowledges that Allah, the Glorified, is the One deserving of worship to the exclusion of all else, and that Muhammad is His Messenger. So whoever obeys the Messenger has obeyed Allah, and whoever disobeys the Messenger has disobeyed Allah. He makes lawful what Allah and His Messenger made lawful, prohibits what Allah and His Messenger prohibited, commands what Allah and His Messenger commanded, and forbids what Allah and His Messenger forbade. Many of the spiritual seekers (Salikin) erred in this station; they did not distinguish between the first and the second, between Tawhid of Lordship and Tawhid of Divinity (Uluhiyyah). If they followed their premise to its logical conclusion, they would exit the religion just as a hair is pulled from dough. End quote.\n2. \"A\": \"To be worshipped alone,\" both are correct.",
    "book_id": "1"
  },
  {
    "serial_number": "54425",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 48,
    "volume_number": 1,
    "text": "And The Exalted said: {You have not besides Him any protector or any intercessor} [As-Sajdah: 4]. And The Exalted said: {Who is it that can intercede with Him except by His permission?} [Al-Baqarah: 255]. And The Exalted said: {That Day, no intercession will benefit except [that of] one to whom the Most Merciful has given permission and has accepted his word...} [Ta-Ha: 109]. And The Exalted said: {And how many angels there are in the heavens whose intercession will not avail at all except [only] after Allah has permitted [it] to whom He wills and approves} [An-Najm: 26]. And The Exalted said: {And they cannot intercede except on behalf of one whom He approves} [Al-Anbiya: 28]. And The Exalted said: {Intercession does not benefit with Him except for one whom He permits} [Saba: 23]. And in the two Sahihs from multiple paths from the Messenger of Allah, may Allah's peace and blessings be upon him—who is the master of the sons of Adam and the most noble of creation to Allah—that he said: \"I will come under the Throne and fall prostrate to Allah. Then He will open up for me praises that I cannot enumerate now. He will leave me as long as Allah wills to leave me, then it will be said: 'O Muhammad, raise your head. Speak, and you will be heard; intercede, and your intercession will be accepted.' He said: Then a limit will be set for me, and I will admit them into Paradise, then I will return\"—and he mentioned this four times (1)—may Allah's prayers and peace be upon him and upon all the prophets. Imam Al-Bakri Al-Shafi'i, may Allah have mercy on him, said regarding the saying of the Exalted: {And warn by it those who fear that they will be gathered to their Lord - there is not for them besides Him any protector or intercessor} [Al-An'am: 51]: He negated the intercessor even though intercession occurs in the Hereafter, because since it does not occur except by His permission, it is as if it is non-existent from anyone else, and it is so. However, Allah made that to clarify ranks. The sentence of negation is a circumstantial clause (Hal) from the pronoun \"gathered,\" and it is the place of fear, and the intent is the disobedient believers. End quote. He also said regarding the saying of the Exalted: {That Day, no intercession will benefit except [that of] one to whom the Most Merciful has given permission and has accepted his word} [Ta-Ha: 109]: This indicates that intercession is for the believers only.",
    "foot_note": "1. Narrated by Al-Bukhari in his Sahih 13/473, and Muslim 1/182. This hadith has paths and wordings in the two Sahihs, the Sunan, and the Musnads that reach the level of Tawatur (mass transmission).",
    "book_id": "1"
  },
  {
    "serial_number": "54426",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 49,
    "volume_number": 1,
    "text": "And Al-Hafiz Imad Ad-Din Ibn Kathir said regarding the saying of the Exalted: {Say, \"Who is Lord of the heavens and earth?\" Say, \"Allah\"} [Ar-Ra'd: 16] (1): The Exalted affirms that there is no deity but Him because they acknowledge that He (2) is the One who created the heavens and the earth, and He is their Lord and Sustainer. Yet, despite this, they have taken protectors besides Him (3) whom they worship. These polytheists only worshipped alongside Him deities which they acknowledge are created and are His servants. As they used to say in their Talbiyah: \"Labbaik, You have no partner, except a partner who is Yours; You own him and what he owns.\" And as He informed about them in His saying: {We only worship them that they may bring us nearer to Allah in position} [Az-Zumar: 3]. So the Exalted denounced that from them since they believed that, while He, the Exalted, is such that no one intercedes with Him except by His permission, nor does intercession benefit with Him except for whom He permits. Furthermore, He (4) has sent His Messengers from the first of them to the last of them forbidding them from that and prohibiting them from worshipping anyone other than Allah, but they denied them. End quote (5). The intention is to clarify the Shirk of the polytheists whom the Messenger of Allah, may Allah's peace and blessings be upon him, fought, and that they only intended, from those they worshipped, closeness to Allah and seeking their intercession with Allah. And to clarify that seeking needs from the dead and calling for their aid in hardships is of the Shirk for which Allah declared the polytheists to be disbelievers. And to clarify that intercession belongs entirely to Allah; no one has any share of the command with Him. And that there is no intercession except after Allah's permission. And that He, the Exalted, does not grant permission except for one whose speech",
    "foot_note": "1. 2/507.\n2. In Ibn Kathir \"that He\" (Annahu).\n3. In \"A\": \"Besides Allah\"; what is in \"B\" corresponds to the Tafsir of Ibn Kathir.\n4. \"He\" (Annahu) is not in \"A\".\n5. Adapted.\n6. In \"B\": \"Approved\" (Irtada).",
    "book_id": "1"
  },
  {
    "serial_number": "54427",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 50,
    "volume_number": 1,
    "text": "and action He is pleased with. And that He is not pleased with anything except Tawhid. As the evidences indicating that have preceded. It is known that the highest of creation, the best of them, and the most noble of them to Allah are: The Messengers (1) and the Close Angels. Yet they are purely servants; they do not precede Him in speech, nor do they advance before Him, nor do they do anything except after His permission to them and His command. So Allah, the Glorified, permits whom He wills to intercede regarding it. Thus, true intercession belongs to Him, the Exalted, and the one who intercedes (2) with Him only intercedes by His permission and command. The intercession, the Glorified, returns to Himself, which is His will to have mercy on His servant. This is contrary to the polytheistic intercession which the polytheists and those who agreed with them affirmed, which He, the Glorified, invalidated in His Book by saying: {And fear a Day when no soul will suffice for another soul at all, nor will compensation be accepted from it, nor will intercession benefit it} The Verse [Al-Baqarah: 123]. And The Exalted said: {O you who have believed, spend from that which We have provided for you before there comes a Day in which there is no exchange and no friendship and no intercession} [Al-Baqarah: 254]. For this reason, the happiest of people with the intercession of the Master of Intercessors on the Day of Resurrection are the people of Tawhid, as the texts have explicitly stated. Al-Bukhari narrated from Abu Hurairah from the Prophet, may Allah's peace and blessings be upon him, that he said: \"The happiest of people with my intercession on the Day of Resurrection is he who says: 'There is no deity but Allah,' sincerely from his heart\" (3).",
    "foot_note": "1. \"The Messengers\" is missing from \"B\". It is in \"A\" and in \"Ighathat Al-Lahfan\" by Ibn al-Qayyim 1/221, from which the author quoted these lines with abbreviation and adaptation.\n2. In \"A\": \"Interceded\" (Shafa'a).\n3. Reported by Imam Ahmad in his Musnad 2/373, and Al-Bukhari in his Sahih - Book of Knowledge - 1/193 and in - Ar-Riqaq - 11/418, both via the path of Al-Maqburi from Abu Hurairah... with it. And Imam Ahmad reported it 2/307 - 518 via the path of Mu'awiyah bin Mughith - or Mu'attib - Al-Hudhali from Abu Hurairah with a wording close to this.",
    "book_id": "1"
  },
  {
    "serial_number": "54428",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 51,
    "volume_number": 1,
    "text": "And from Awf bin Malik who said: The Messenger of Allah, may Allah's peace and blessings be upon him, said: \"A comer came to me from my Lord and gave me the choice between half of my Ummah entering (1) Paradise and intercession. I chose intercession, and it is for whoever dies not associating anything with Allah.\" Narrated by At-Tirmidhi and Ibn Majah (2). So the happiest of people with the intercession of the Messenger of Allah, may Allah's peace and blessings be upon him, are the people of Tawhid, and those who stripped Tawhid for Allah and purified it from polytheistic attachments. They are the ones whom Allah, the Glorified, is pleased with. The Exalted said: {And they cannot intercede except on behalf of one whom He approves} [Al-Anbiya: 28]. And The Exalted said: {That Day, no intercession will benefit except [that of] one to whom the Most Merciful has given permission and has accepted his word} [Ta-Ha: 109]. So He, the Glorified, informed that on that Day, beneficial intercession will not occur except after His satisfaction with the word of the one interceded for and His permission for the intercessor regarding him. As for the polytheist, He does not approve of him, nor is He pleased with his word, so He does not permit the intercessors to intercede for him. For He, the Glorified, made it conditional upon two matters: His satisfaction with the one interceded for, and His permission for the intercessor. So unless the combination of both matters exists, intercession does not exist. And this intercession, in reality, is from Him, the Glorified, for He is the One who permitted, the One who accepted, the One who was pleased with the interceded for, and the One who guided him to do what makes him deserving of intercession.",
    "foot_note": "1. \"An\" (that/to) is missing from \"B\".\n2. Reported by Imam Ahmad in his Musnad \"6/28-29\", At-Tirmidhi in his Sunan - Book of the Description of Resurrection - \"4/627\", Ibn Hibban - Al-Mawarid - \"p. 644\", and Ibn Khuzaymah - in Kitab at-Tawhid - \"p. 264-265\". Al-Hakim said in his Mustadrak \"1/67\": A rigorously authentic hadith according to their conditions though they did not extract it. And Al-Ajurri in Al-Shari'ah \"p. 345\". All of them from the path of Qatadah from Abu Al-Malih from Awf bin Malik... with it, containing a story. Al-Haythami said in Al-Majma' \"10/370\": Narrated by Al-Tabarani with chains of transmission, and the men of some of them are trustworthy. End quote. The hadith has paths from Awf bin Malik; this is not the place to elaborate on them.",
    "book_id": "1"
  },
  {
    "serial_number": "54429",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 52,
    "volume_number": 1,
    "text": "For the Lord, Blessed and Exalted is He, is the One who bestows favor upon the people of sincerity, forgiving them through the supplication of one He permitted to intercede in order to honor him. Thus, the intercession negated by the Quran is that which contains Shirk. For this reason, He, the Glorified, affirmed it by His permission in places in His Book. And the Prophet, may Allah's peace and blessings be upon him, clarified that it will not be except for the people of Tawhid, as preceded in the hadith of Abu Hurairah and Awf bin Malik. So the one who takes an intercessor is a polytheist; intercession will not benefit him, nor will intercession be made for him. But the one who takes the Lord alone as his God and Object of Worship, He is the One who permits, the Glorified, for the intercessor to intercede for him. The Exalted said: {Or have they taken other than Allah as intercessors? Say, \"Even though they do not possess anything, nor do they reason?\" Say, \"To Allah belongs [the right to allow] intercession entirely...\"} The Verse [Az-Zumar: 43-44]. And The Exalted said: {And they worship other than Allah that which neither harms them nor benefits them, and they say, \"These are our intercessors with Allah.\" Say, \"Do you inform Allah of something He does not know in the heavens or on the earth?\" Exalted is He and high above what they associate with Him} [Yunus: 18]. So He clarified that those who take intercessors are polytheists, and that intercession is not achieved by taking them, but is achieved by His permission, the Glorified and Exalted, for the intercessor, and His satisfaction with the one interceded for, as its explanation has preceded. The intention is that the Book and the Sunnah have indicated that whoever makes the Angels, the Prophets, Ibn Abbas, Abu Talib, Al-Mahjoub \"or others among the Prophets and Righteous\" (1) intermediaries between himself and Allah to intercede for him with Allah due to their closeness to Allah, as is done with kings, is a disbelieving polytheist, whose wealth and blood are lawful, even if he says: I testify that there is no deity but Allah, and I testify (2) that Muhammad is the Messenger of Allah, and prays, and fasts, and claims he is a Muslim. Rather, he is among the greatest losers in deeds, whose effort is lost in worldly life, while they think that they are doing well in work.",
    "foot_note": "1. What is between the parentheses is from \"B\".\n2. \"And I testify\": missing from \"B\".",
    "book_id": "1"
  },
  {
    "serial_number": "54430",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 53,
    "volume_number": 1,
    "text": "Whoever contemplates the Noble Quran will find it explicitly stating that the polytheists whom the Messenger of Allah, may Allah's peace and blessings be upon him, fought, acknowledged that Allah, the Glorified, is the Creator, the Sustainer, and that the seven heavens and whoever is in them, and the seven earths and whoever is in them, are all His slaves, under His coercion and disposal, as He, the Exalted, narrated about them in Surah \"Yunus,\" Surah \"Al-Mu'minun,\" \"Al-Ankabut,\" and other Surahs. And he will find it explicitly stating that the polytheists call upon the righteous, as the Exalted mentioned that (1) about them in Surah \"Subhan\" (Al-Isra), \"Al-Ma'idah,\" and other Surahs. Likewise, He informed (2) about them that they worship the Angels, as He mentioned that in \"Al-Furqan\" (3), \"Saba,\" and \"An-Najm.\" And he will find it explicitly stating also (4) that the polytheists only intended, from those they worshipped, intercession and closeness to Allah, as the Exalted mentioned that about them in Surah \"Yunus,\" \"Az-Zumar,\" and other Surahs (5). So if it becomes clear to you that the Quran has explicitly stated these three issues, meaning: The polytheists' acknowledgment of Tawhid of Lordship (Rububiyyah); that they call upon the righteous; and that they only intended (6) from them intercession \"closeness to Allah\" (7). It becomes clear to you that what is done at the graves today, of asking them to bring benefits and remove hardships, is the Major Shirk for which Allah declared the polytheists to be disbelievers",
    "foot_note": "1. \"That\": Not in \"B\".\n2. In \"A\": \"Mentioned\".\n3. In \"A\": \"The Prophets\".\n4. \"Also\": Not in \"B\".\n5. These verses have been mentioned previously in the text of this book.\n6. In \"B\": \"They want\".\n7. What is between the parentheses is from \"B\".",
    "book_id": "1"
  },
  {
    "serial_number": "54431",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 54,
    "volume_number": 1,
    "text": "because these polytheists are assimilators (Mushabbihah); they likened the Creator, the Exalted, to the creature (1). In the Quran and the speech of the scholars regarding the refutation of these people is what this place cannot",
    "foot_note": "1. Sheikh ul-Islam Abu Al-Abbas [Ibn Taymiyyah], may Allah have mercy on him, said in the Refutation of Al-Bakri \"p. 60-61-62\" summarized: The basis of the polytheists' misguidance is that they thought intercession with Allah is like intercession with others. This is the basis of the Christians' misguidance. Whoever thinks that the customary intercession from creature to creature is effective with Allah—such as a person interceding with someone whom the interceded-to hopes for or fears, like a son, brother, helper, or peer interceding with a king, whom the king fears or hopes for, so he answers their request—for the sake of his hope or fear of them—regarding the one they intercede for with him; even if the king or prince or other dislikes intercession for the one they interceded for, he accepts their intercession out of dislike, and they intercede with him without his permission. But Allah the Exalted is the Lord of everything, its King and Creator. No one intercedes with Him except by His permission, and no one intercedes for anyone except for whom Allah permits the intercessor to intercede. If He permits the intercessor, he intercedes, even if the intercessor did not ask Him. If the intercessor asked for intercession and Allah did not permit, his intercession would not benefit, just as the intercession of Noah for his son, Abraham for his father, Lot for his people, and the Prophet's prayer for the hypocrites and his seeking forgiveness for them did not benefit. So whoever says among the extremists and ignorant that Allah has servants who, if they asked Him not to establish the Hour, He would not establish it, is a lying fabricator. For the best of creation to Him had most of their requests answered regarding what aligned with His decree and command, and some were rejected; so what is the state of those below them? And whatever He informed He would do must happen. Intercession only occurs and benefits, and the rank and status of the intercessor becomes apparent with the One interceded to, if he intercedes for whom He permitted him to intercede, and in His answering his request and accepting his intercession... etc. End of his words, may Allah have mercy on him. When Imam Ibn al-Qayyim, may Allah have mercy on him, mentioned in Al-Ighatha 1/221 the danger of comparing the Creator, the Glorified, to the creature in intercession and other matters, he said: And by this corrupt analogy, idols were worshipped, and the polytheists took intercessors and protectors besides Allah. End quote. In the words of the author, may Allah have mercy on him, will come what clarifies the error of this belief, its danger, and that it is invalid to compare the Creator, Glorified and Exalted, to kings and princes in intercession and other matters.",
    "book_id": "1"
  },
  {
    "serial_number": "54432",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 55,
    "volume_number": 1,
    "text": "accommodate. For the intermediaries between kings and people are of one of three types (1). Either to inform them of (2) the people's conditions regarding matters they do not perceive (3). Whoever says: Allah does not perceive (4) the conditions of the servants until some prophets or other saints and righteous people inform Him of that is a disbeliever. Rather, He, the Exalted, knows the secret and what is more hidden; nothing is hidden from Him on earth or in the heaven. Second: That the king is incapable of managing his subjects and repelling his enemies except with aides who assist him; thus, he must have aides and supporters due to his weakness and inability. But Allah, the Glorified, has no supporter nor protector out of weakness. All causes in existence, He, the Glorified, is their Lord and Creator. He is Rich (Self-Sufficient) beyond all besides Him, and all besides Him are poor (in need) of Him, unlike kings who need their supporters, who are in reality their partners. Allah, the Glorified, has no partner in Dominion; rather, there is no deity except Allah alone, having no partner; to Him belongs the Dominion and to Him belongs the Praise. For this reason, no one intercedes with Him except by His permission—no close angel nor sent prophet, let alone others. For whoever intercedes with Him without His permission is a partner to Him in achieving the objective, influencing Him by his intercession so that He does what is asked of Him. Allah the Exalted has no partner in any way whatsoever. Third: That the king does not desire benefit for his subjects (5) and benevolence towards them, except through a motivator that moves him from the outside. So if someone advises the king addresses him,",
    "foot_note": "1. In \"A\": \"Three\" (Thalath - masculine form).\n2. In \"A\": \"From\" (Min), which corresponds to the Fatawa of Sheikh ul-Islam Ibn Taymiyyah 1/126 from which the author quoted this classification.\n3. In \"A\": \"Regarding matters they do not know,\" which corresponds to the Fatawa of Sheikh ul-Islam 1/126.\n4. In \"A\": \"That Allah does not know,\" and in the Fatawa 1/127 \"That Allah does not possess knowledge of.\"\n5. In \"A\": \"Desiring benefit for his subjects,\" which corresponds to the Fatawa of Sheikh ul-Islam 1/127.",
    "book_id": "1"
  },
  {
    "serial_number": "54433",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 56,
    "volume_number": 1,
    "text": "or admonishes him, or indicates to him (1), such that he hopes for him or fears him, the king's will and determination are moved to fulfill the needs of his subjects. But Allah the Exalted is the Lord of everything and its Sovereign, and He is more merciful to His servants than a mother to her child (2). All causes only exist by His Will and Volition; what He wills happens, and what He does not will does not happen. And He, the Glorified, if He wills to effect benefit for the servants through one another (3), He makes this one do good to that one, or pray for him (4), or intercede for him. So He is the One who created all of that, and He is the One who created in the heart of this doer of good and supplicant the will for benevolence, supplication, and intercession. It is not permissible for there to be in existence anyone who compels Him against His will, or informs Him of what He did not know. The intercessors who intercede with Him do not intercede except by His permission, as its clarification has preceded (5), unlike needy kings. For the intercessor with them is a partner to them in dominion, and may be a supporter to them (6) assisting them in their dominion, and they intercede with kings without the kings' permission.",
    "foot_note": "1. In \"A\": \"Or indicates to him via a hadith such that,\" what is in \"B\" corresponds to the Fatawa of Sheikh ul-Islam 1/127.\n2. As this was reported in the Hadith agreed upon as authentic from Umar bin Al-Khattab, may Allah be pleased with him, who said: Captives came to the Messenger of Allah, may Allah's peace and blessings be upon him. Suddenly, a woman among the captives, her breasts flowing with milk, was running. Whenever she found a boy among the captives, she took him, pressed him to her belly, and suckled him. The Prophet, may Allah's peace and blessings be upon him, said to us: \"Do you see this woman casting her child into the fire?\" We said: No, as long as she is able not to cast him. He said: \"Allah is more merciful to His servants than this woman to her child.\" This is the wording of Al-Bukhari \"10/427 - Fath\". The wording of Muslim is \"And a woman among the captives was searching, when she found a boy among the captives, she took him...\" \"4/2109\".\n3. In \"B\": \"Between them\" instead of \"Through one another\".\n4. \"For him\": Not in \"A\".\n5. In \"A\": \"Explanation\".\n6. In \"B\": \"To them\".",
    "book_id": "1"
  },
  {
    "serial_number": "54434",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 57,
    "volume_number": 1,
    "text": "And the king accepts their intercession sometimes out of his need for them, and sometimes to reward their benevolence and compensate them, to the point that he accepts the intercession of his child and wife for that reason, for he needs the wife and child such that if his child and wife turned away from him, he would be harmed by that. He accepts the intercession of his slave because if he does not accept his intercession, he fears he will not obey him (1). And he accepts the intercession of his brother for fear that he might strive to harm him. The intercession of servants with one another is all of this genus; no one accepts another's intercession except out of desire or fear (2). But Allah the Exalted does not hope for anyone, nor fear him, nor need anyone; rather, He is the Rich (Self-Sufficient), the Glorified, beyond all besides Him, and all besides Him are poor (in need) of Him. The polytheists take intercessors of the genus of intercession they know among created beings. The Exalted said: {And they worship other than Allah that which neither harms them nor benefits them, and they say, \"These are our intercessors with Allah...\" up to His saying... Exalted is He and high above what they associate with Him} [Yunus: 18]. And The Exalted said: {Say, \"Invoke those you have claimed [as gods] besides Him, for they do not possess the [ability for] removal of adversity from you or [for its] transfer.\" Those whom they invoke seek means of access to their Lord, [striving as to] which of them is nearest, and they hope for His mercy and fear His punishment} [Al-Isra: 56-57]. So He, the Glorified, informed that what is invoked besides Him does not possess the removal of adversity nor its transfer, and that they hope for His mercy, fear His punishment, and draw closer to Him. Thus, He, the Glorified, negated what they affirmed of the mediation of Angels and Prophets. In what we have mentioned is sufficiency for whomever Allah wills his guidance (3). As for him whom Allah wills his trial, there is no way for him: {He whom Allah guides is the [rightly] guided, but he whom He leaves astray - never will you find for him a protecting guide} [Al-Kahf: 17].",
    "foot_note": "1. In \"B\": \"Now he does not give him,\" which is an apparent error.\n2. In \"B\": \"For desire or for fear.\"\n3. In \"A\": \"For whomever Allah guided.\"",
    "book_id": "1"
  },
  {
    "serial_number": "54435",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 59,
    "volume_number": 1,
    "text": "The Second Issue [Which is: Whoever says there is no deity but Allah, Muhammad is the Messenger of Allah, yet does not pray and does not pay Zakat, is he a believer?]. We say: As for the one who says there is no deity but Allah, Muhammad is the Messenger of Allah, while persisting in his Shirk, calling upon the dead and asking them to fulfill needs and relieve distress, this is a disbelieving polytheist whose wealth and blood are lawful, even if he says there is no deity but Allah, Muhammad is the Messenger of Allah, prays, fasts, and claims he is a Muslim, as its explanation has preceded. But regarding one who singles out Allah the Exalted (Tawhid) and does not associate partners with Him, but abandons prayer and withholds Zakat: If he denies the obligation, he is a disbeliever by consensus. But if he acknowledges the obligation yet abandons prayer out of laziness, scholars have differed regarding his disbelief. When scholars agree on a consensus, their consensus is a proof; they do not agree on error. But if they dispute over something, what they dispute over is referred back to Allah and the Messenger, since none of them is infallible absolutely; rather, everyone's saying is taken or rejected except for Allah and the Messenger. The Exalted said: {And if you disagree over anything, refer it to Allah and the Messenger} [An-Nisa: 59]. Scholars said referring to Allah is referring to His Book, and referring to the Messenger is referring to the Sunnah after his death. And The Exalted said: {And in anything over which you disagree - its ruling is [to be referred] to Allah} [Ash-Shura: 10]. Allah the Exalted has censured those who turn away from His Book and call to other than it during disputes, saying:",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54436",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 60,
    "volume_number": 1,
    "text": "The Exalted said: {And when it is said to them, \"Come to what Allah has revealed and to the Messenger,\" you see the hypocrites turning away from you in aversion} [An-Nisa: 61]. If you know this, we say: Scholars, may Allah have mercy on them, differed regarding the one who abandons prayer out of laziness without denial. Imam Abu Hanifa, Al-Shafi'i in one of his two views, and Malik held that he is not judged as a disbeliever. They argued with what Ubadah bin As-Samit narrated, saying: I heard the Messenger of Allah, may Allah's peace and blessings be upon him, say: \"Five prayers Allah has written upon the servants. Whoever brings them has a covenant with Allah that He will admit him to Paradise. And whoever does not bring them has no covenant with Allah; if He wills He punishes him, and if He wills He forgives him\" (1).",
    "foot_note": "1. Reported by Imam Malik in Al-Muwatta \"1/123\", Al-Humaidi in his Musnad \"1/191\", Imam Ahmad in his Musnad \"5/315-319-322\", Abu Dawud in his Sunan - Book of Prayer - \"2/130\", Al-Nasa'i in his Sunan - Book of Prayer - \"1/230\", Ibn Majah in his Sunan - Book of Establishing Prayer - \"1/308\", Al-Tahawi in Mushkil al-Athar \"4/223\", Al-Bayhaqi in Sunan \"2/8\", Al-Baghawi in Sharh al-Sunnah \"4/104\", and Ibn Adi in the Introduction to Al-Kamil \"1/62\". All of them via the path of Yahya bin Sa'id from Muhammad bin Yahya bin Habban from Ibn Muhayriz that a man from Banu Kinanah called Al-Makhdaji heard a man in Sham nicknamed Abu Muhammad say: Witr is obligatory. Al-Makhdaji said: So I went to Ubadah bin As-Samit, and intercepted him while he was going to the mosque, and informed him of what Abu Muhammad said. Ubadah said: Abu Muhammad lied, I heard the Messenger of Allah, may Allah's peace and blessings be upon him, say... and he mentioned it - this is Malik's context - and its chain is weak. Al-Makhdaji, it is said his name is Rufay', is unknown, stated by Al-Dhahabi in Al-Mizan \"4/600\". In Al-Manhal Al-Adhb Al-Mawrud \"8/47\", Ibn Abdul-Barr said: Unknown. End quote. The hadith has two other paths from Ubadah bin As-Samit. First Path: Reported by Imam Ahmad in his Musnad \"5/317\", Abu Dawud in his Sunan - Book of Prayer - \"1/295\", and Al-Baghawi in Sharh al-Sunnah \"4/105\", all from Muhammad bin Mutarrif from =",
    "book_id": "1"
  },
  {
    "serial_number": "54437",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 61,
    "volume_number": 1,
    "text": "Our Imam Ahmad bin Hanbal, Al-Shafi'i in one of his two views, Ishaq bin Rahwayh, Abdullah bin Al-Mubarak, Al-Nakha'i, Al-Hakam, Ayyub Al-Sakhtiyani, Abu Dawud Al-Tayalisi, and others from the senior Imams and Tabi'in held that he is a disbeliever. Ishaq bin Rahwayh cited it as a consensus; Sheikh Ahmad bin Hajar Al-Haytami mentioned this from him in Sharh Al-Arba'in. And he mentioned in the book Al-Zawajir 'an Iqtiraf Al-Kaba'ir from the majority of the Companions, may Allah be pleased with them. Imam Abu Muhammad bin Hazm said: The rest of the Companions, may Allah be pleased with them, and those after them from the Tabi'in declare the absolute abandoner of prayer a disbeliever and judge him with apostasy. Among them are Abu Bakr, Umar, his son Abdullah, Abdullah bin Mas'ud, Abdullah bin Abbas, Mu'adh bin Jabal, Jabir bin Abdullah, \"Abu Darda, Abu Hurairah\" (1), and Abdur-Rahman bin Awf, \"and others from the Companions, and we do not know any opposition to these",
    "foot_note": "1. = Zaid bin Aslam from Ata bin Yasar from Abdullah Al-Sanabihi who said: Abu Muhammad claimed that Witr is obligatory. So Ubadah bin As-Samit said: Abu Muhammad lied. I testify that I heard the Messenger of Allah, may Allah's peace and blessings be upon him, say: \"Five prayers Allah the Exalted obligated. Whoever perfects their ablution, prays them at their times, and completes their bowing and humility, has a covenant upon Allah that He will forgive him. And whoever does not do so, has no covenant upon Allah; if He wills He forgives him, and if He wills He punishes him.\" This is Abu Dawud's wording, and its chain is good (Jayyid). Second Path: Reported by Abu Dawud Al-Tayalisi in his Musnad \"p. 78\" from Zam'ah from Al-Zuhri from Abu Idris Al-Khawlani who said: I was in a gathering of the Prophet's companions containing Ubadah bin As-Samit... So he said: I testify that I heard the Messenger of Allah, may Allah's peace and blessings be upon him, say: \"Gabriel came to me and said: O Muhammad, Allah the Mighty and Majestic says: I have obligated upon your Ummah five prayers...\" and he mentioned the hadith. Its chain is weak; Zam'ah is Ibn Salih, they weakened him. See At-Tahdhib \"3/338\".\n1. What is between parentheses is from: \"B\".",
    "book_id": "1"
  },
  {
    "serial_number": "54438",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 62,
    "volume_number": 1,
    "text": "from the Companions, may Allah be pleased with them all\" (1). They answered his saying, may Allah's peace and blessings be upon him: \"Whoever does not bring them has no covenant with Allah; if He wills He punishes him, and if He wills He forgives him\" by saying the meaning is lack of maintaining them in their times, evidenced by verses and hadiths reported about it and about abandoning it. They argued for the disbelief of the abandoner with what Muslim reported in his Sahih from Jabir bin Abdullah who said: The Messenger of Allah, may Allah's peace and blessings be upon him, said: \"Between a man and Shirk and Kufr is the abandonment of prayer\" (2). And from Buraydah bin Al-Husayb who said: I heard the Messenger of Allah, may Allah's peace and blessings be upon him, say: \"The covenant between us and them is prayer, so whoever abandons it has disbelieved.\" Narrated by Imam Ahmad and the authors of the Sunan, and At-Tirmidhi said: A Sahih hadith, its chain is on the condition of Muslim (3). And from Thawban, the freed slave of the Messenger of Allah, may Allah's peace and blessings be upon him, who said: I heard the Messenger of Allah, may Allah's peace and blessings be upon him, say: \"Between the servant and Kufr and Iman is prayer; if he leaves it, he has associated partners with Allah\" (4). And from Abdullah bin Amr bin Al-Aas, may Allah be pleased with them both, from the Prophet, may Allah's peace and blessings be upon him, that he mentioned prayer one day and said: \"Whoever preserves",
    "foot_note": "1. What is between parentheses is from: \"B\".\n2. \"1/88\".\n3. Reported by Imam Ahmad in his Musnad \"5/346\", At-Tirmidhi in his Sunan - Book of Faith - \"5/14\" and said: A Hasan Sahih Gharib hadith, Al-Nasa'i in his Sunan - Book of Prayer - \"1/231\", Ibn Majah in his Sunan - Book of Establishing Prayer - \"1/342\": And its chain is authentic. Al-Hakim said in his Mustadrak \"1/6-7\": Authentic chain, no defect is known for it in any way, and Al-Dhahabi affirmed it.\n4. Imam Ibn al-Qayyim said in his book As-Salah - p. 508 of the Najdi Hadith Collection: Reported by Hibbatullah Al-Tabari and he said: Its chain is authentic on the condition of Muslim. End quote.",
    "book_id": "1"
  },
  {
    "serial_number": "54439",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 63,
    "volume_number": 1,
    "text": "it, it will be a light, a proof, and salvation for him on the Day of Resurrection. And whoever does not preserve it, it will not be a light, a proof, or salvation for him, and on the Day of Resurrection he will be with Qarun, Pharaoh, Haman, and Ubayy bin Khalaf.\" Narrated by Imam Ahmad, Abu Hatim, and Ibn Hibban in his Sahih (1). And from Ubadah bin As-Samit who said: The Messenger of Allah, may Allah's peace and blessings be upon him, advised us saying: \"Do not associate anything with Allah, and do not leave prayer intentionally, for whoever leaves it intentionally has exited the Millah (religion).\" Narrated by Abdur-Rahman bin Abi Hatim in his Sunan (2). And from Mu'adh bin Jabal who said the Messenger of Allah, may Allah's peace and blessings be upon him, said: \"Whoever leaves a prescribed prayer intentionally, the protection of Allah is absolved from him.\" Narrated by Imam Ahmad (3). And from Abu Darda who said: My beloved friend (Abu Al-Qasim), may Allah's peace and blessings be upon him, advised me not to leave prayer intentionally, for whoever leaves it intentionally, the protection is absolved from him. Narrated by Ibn Abi Hatim (4). And from Mu'adh bin Jabal from the Prophet, may Allah's peace and blessings be upon him, that he said:",
    "foot_note": "1. Reported by Imam Ahmad in his Musnad \"2/169\", and Ibn Hibban in his Sahih - Mawarid p. 87. Al-Haythami said in Al-Majma' \"1/292\": Narrated by Ahmad and Al-Tabarani in Al-Kabir and Al-Awsat, and Ahmad's men are trustworthy. I say: In Ahmad's chain is Isa bin Hilal, whom Ibn Hibban authenticated!.\n2. I did not find the chain of Ibn Abi Hatim. Al-Haythami said in Majma' Al-Zawa'id regarding this hadith of Ubadah: Narrated by Al-Tabarani and it contains Salamah bin Shurayh. Al-Dhahabi said: Not known, and the rest of its men are men of the Sahih. End quote. \"5/246\".\n3. Reported by Imam Ahmad in his Musnad \"5/238\" at length, and Al-Tabarani in Al-Kabir \"as in Al-Majma'\". Al-Haythami said in Majma' Al-Zawa'id \"6/215\": Ahmad's men are trustworthy except that Abdur-Rahman bin Jubayr bin Nufayr did not hear from Mu'adh. And Al-Tabarani's chain is connected but contains Amr bin Waqid Al-Qurashi, who is a liar. End quote.\n4. I did not find the chain of Ibn Abi Hatim. Al-Haythami said in Al-Majma' regarding this hadith of Abu Darda: =",
    "book_id": "1"
  },
  {
    "serial_number": "54440",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 64,
    "volume_number": 1,
    "text": "\"The head of the matter is Islam, and its pillar is prayer...\" the Hadith. And from Abdullah bin Shaqiq Al-Uqayli who said: The Companions of Muhammad, may Allah's peace and blessings be upon him, did not view the abandonment of any deed as disbelief except prayer. Narrated by At-Tirmidhi (1). So these hadiths, as you see, are explicit regarding the disbelief of the abandoner of prayer, along with what preceded of the consensus of the Companions, as narrated by Ishaq bin Rahwayh, Ibn Hazm, and Abdullah bin Shaqiq. It is the school of the majority of scholars from (2) the Tabi'in and those after them. Then know, \"may Allah have mercy on you and guide you\" (3), that the scholars are unanimously agreed on killing the one who abandons prayer out of laziness, except for Abu Hanifa, Muhammad bin Shihab Al-Zuhri, and Dawud; they said the abandoner of obligatory prayer is imprisoned until he dies or repents. Whoever argued for this view with his saying, may Allah's peace and blessings be upon him: \"I have been ordered to fight the people until they say 'There is no deity but Allah', so if they say it, they have protected their blood and wealth from me except by its right\" (4), has missed the mark. For this hadith contains no proof [for them]; rather, it is a proof for those who say he should be killed, as will be explained, Allah willing. The majority argued for killing him using the Book and the Sunnah. As for the Book, His saying:",
    "foot_note": "1. = Narrated by Al-Tabarani, and it contains Shahr bin Hawshab, whose hadith is good (Hasan), and the rest of its men are trustworthy. End quote. The correct view regarding Shahr's status is that he is Hasan in Hadith in corroborations and follow-ups. And Allah knows best. This hadith of Abu Darda has many corroborating reports that lift the weakness from it. See Majma' Al-Zawa'id \"5/216-217\".\n1. Reported by At-Tirmidhi in his Sunan - Book of Faith - \"5/14\". Al-Nawawi said in Riyadh as-Salihin \"p. 440\": Its chain is authentic.\n2. \"Min\" (from) fell from \"A\".\n3. What is between brackets is from \"B\".\n4. Discussion on it has preceded.",
    "book_id": "1"
  },
  {
    "serial_number": "54441",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 65,
    "volume_number": 1,
    "text": "The Exalted said: {So kill the polytheists wherever you find them} (1) up to His saying: {But if they repent, establish prayer, and give zakat, then let them go their way} [At-Tawbah: 5]. Thus, He conditioned cessation [of fighting] on repentance from Shirk, establishing prayer, and giving Zakat. So if these three are not found, fighting them does not cease, and their way is not cleared. Ibn Majah said: Nasr bin Ali told us, (2) or Ahmad told us, \"Abu Ja'far Ar-Razi\" (3) told us from Al-Rabi' bin Anas from Anas, may Allah be pleased with him, who said: The Messenger of Allah, may Allah's peace and blessings be upon him, said: \"Whoever departs the world with (4) sincerity to Allah alone and worshipping Him with no partner, establishing prayer, and giving zakat, dies while Allah is pleased with him.\" Anas said: This is the religion of Allah with which the Messengers came and conveyed from their Lord before the confusion of hadiths and the divergence of desires. And the confirmation of that is in the Book of Allah, in the last of what was revealed: {But if they repent}, he said: cast off idols and their worship, {and establish prayer and give zakat} (5) - and He said in another verse - {But if they repent, establish prayer, and give zakat, then they are your brothers in religion} [At-Tawbah: 11] (6) (7).",
    "foot_note": "1. \"Or the verse\" fell from \"B\".\n2. In \"B\" \"Akhbarana\" (informed us), and in Ibn Majah's copy \"Thana\" (told us); both have the same meaning according to one opinion.\n3. What is between brackets fell from the copies. The restoration is from Sunan Ibn Majah.\n4. In \"B\" \"Bi-Al-Ikhlas\" (with sincerity).\n5. In \"A\" and \"B\" \"Fa-khallu sabilahum\" (then let them go their way), which is not in Sunan Ibn Majah.\n6. Reported by Ibn Majah in his Sunan - \"1/27\" - and its chain is weak because the narration of Abu Ja'far Ar-Razi - Isa bin Abi Isa Abdullah bin Mahan - from Al-Rabi' bin Anas is very disturbed (Mudtarib). Ibn Hibban said in Al-Thiqat \"4/228\": People avoid of his hadith what was from Abu Ja'far's narration from him because there is great disturbance in his hadiths from him. End quote. Also, there is slight weakness in Abu Ja'far and Al-Rabi'. Al-Busiri said in Zawa'id Ibn Majah: Its chain is weak. End quote.\n7. The author - may Allah have mercy on him - limited himself to this proof from the Book. The scholar Shams al-Din Ibn al-Qayyim - may Allah have mercy on him - continued =",
    "book_id": "1"
  },
  {
    "serial_number": "54442",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 66,
    "volume_number": 1,
    "text": "As for the Sunnah, it is established in the two Sahihs from Ibn Umar, may Allah be pleased with them both, that the Messenger of Allah, may Allah's peace and blessings be upon him, said: \"I have been ordered to fight the people until they testify that there is no deity but Allah and that Muhammad is the Messenger of Allah, establish prayer, and give zakat. If they do that, they have protected their blood and wealth from me except by the right of Islam, and their reckoning is with Allah\" (1). So he attached protection to the two testimonies, prayer, and zakat. The Prophet, may Allah's peace and blessings be upon him, sent a letter containing: \"From Muhammad the Messenger of Allah to the people of Oman. To proceed: Affirm the testimony that there is no deity but Allah and that I am the Messenger of Allah, pay Zakat, and build mosques. Otherwise, I will raid you.\" Extracted by Al-Tabarani, Al-Bazzar, and others; mentioned by Al-Hafiz Ibn Rajab Al-Hanbali in \"Sharh Al-Arba'in\" (2). Ibn Shihab narrated from Hanzalah from Ali bin Al-Ashja' that Abu Bakr Al-Siddiq sent Khalid bin Al-Walid and ordered him to fight people over five things. Whoever leaves one of them, fight him over it just as you fight over the five: The testimony that there is no deity but Allah and that Muhammad is the Messenger of Allah, establishing prayer, giving zakat, fasting Ramadan, and Hajj to the Sacred House of Allah. Sa'id bin Jubayr said: Umar bin Al-Khattab said: If people abandoned Hajj, we would fight them over leaving it just as we fight over leaving prayer and zakat.",
    "foot_note": "1. = the evidences from the Book on the disbelief of the prayer abandoner up to ten evidences. See them in his valuable book \"As-Salah\" \"p. 499 to p. 507 of the Najdi Hadith Collection\".\n1. Discussion on it has preceded.\n2. Al-Haythami said in Majma' Al-Zawa'id \"1/29\": Narrated by Al-Tabarani in Al-Awsat, and regarding its chain, I did not see anyone mentioning them except that Al-Tabarani said: Musa bin Isma'il was unique in it. I say: It is not Al-Tabudhaki because this one narrates from the Tabi'in, and Allah knows best. End quote.",
    "book_id": "1"
  },
  {
    "serial_number": "54443",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 67,
    "volume_number": 1,
    "text": "In summary, the Book and the Sunnah indicate that fighting extends to the two testimonies, prayer, and zakat, and the scholars have agreed on that. It is stated in Sharh Al-Iqna': Scholars agreed that any group refusing a (1) rite from the rites of Islam must be fought until the religion is entirely for Allah, like bandits, and even more so. End quote. As for the hadith of Abu Hurairah from the Prophet, may Allah's peace and blessings be upon him: \"I have been ordered to fight the people until they say 'There is no deity but Allah,' so if they say it, they have protected their blood and wealth from me except by its right,\" there is no confusion in this - praise be to Allah - (2) and there is no proof in it for you; rather, it is a proof against you. Had there been nothing but his saying: \"Except by its right,\" it would have been sufficient to invalidate your view. Our scholars, may Allah have mercy on them, said: If the disbeliever says 'There is no deity but Allah,' he has initiated the protector (3) of his blood, so one must desist from him. If that is completed, protection is realized, otherwise it is nullified. And the Prophet, may Allah's peace and blessings be upon him, said each hadith at a specific time. He said: \"I have been ordered to fight the people until they say: There is no deity but Allah\" so Muslims would know that if a warring disbeliever says it, he is desisted from and his blood and wealth become protected. Then he, may Allah's peace and blessings be upon him, clarified in the other hadith that fighting extends to the two testimonies and the two acts of worship, saying: \"I have been ordered to fight the people until they testify that there is no deity but Allah and that Muhammad is the Messenger of Allah, establish prayer, and give zakat.\" Thus, he clarified that complete protection and its perfection is only achieved through that, and so that the doubt does not occur that mere acknowledgment protects permanently, as happened to some Companions until Abu Bakr Al-Siddiq clarified it, then they agreed with him, may Allah be pleased with them.",
    "foot_note": "1. In \"A\" \"Min\" (from).\n2. Fell from \"A\".\n3. In \"B\" \"Al-Ma'asim\" (Protectors - plural).",
    "book_id": "1"
  },
  {
    "serial_number": "54444",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 68,
    "volume_number": 1,
    "text": "Among what clarifies the corruption of your view and the error of your understanding regarding the meaning of Abu Hurairah's hadith is that the Companions, may Allah be pleased with them, agreed on fighting those who withheld Zakat after a debate occurred between Abu Bakr and Umar, may Allah be pleased with them both. Umar argued against Abu Bakr with Abu Hurairah's hadith, so the Siddiq of the Ummah, may Allah be pleased with him, clarified that the hadith is proof for fighting those who withhold Zakat even if they testify that there is no deity but Allah and that Muhammad is the Messenger of Allah and pray. We will cite the hadith then mention what the scholars said (1) in its explanation (2) so it becomes clear to you that no scholar held your corrupt understanding, and that it is an ominous, blameworthy understanding contradicting the Book, the Sunnah, and the consensus of the Ummah. We say: It is established in the two Sahihs from Abu Hurairah who said: When the Messenger of Allah, may Allah's peace and blessings be upon him, passed away and those of the Arabs who disbelieved disbelieved, Umar said to Abu Bakr: How can you fight the people when the Messenger of Allah, may Allah's peace and blessings be upon him, said: \"I have been ordered to fight the people until they say: There is no deity but Allah and that Muhammad is the Messenger of Allah. If they say it, they have protected their blood and wealth from me except by its right\"? Abu Bakr said: I will surely fight whoever differentiates between prayer and zakat, for zakat is the right of wealth. By Allah, if they withhold from me a hobbling-rope they used to pay to the Messenger of Allah, may Allah's peace and blessings be upon him, I will fight them for withholding it. Umar said: By Allah, it was nothing but that I saw Allah had expanded Abu Bakr's chest for fighting, so I knew it was the truth. This hadith was reported by Al-Bukhari in the Book of Zakat and Muslim in the Book of Faith. It is among the greatest proofs of the corruption of your view, for Al-Siddiq, may Allah be pleased with him, made mere withholding permissible for fighting, not the denial of obligation.",
    "foot_note": "1. In \"B\" \"Kalam\" (speech).\n2. In \"B\" \"Alayhi\" (on it).",
    "book_id": "1"
  },
  {
    "serial_number": "54445",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 69,
    "volume_number": 1,
    "text": "Al-Nawawi, may Allah have mercy on him, discussed this hadith in the explanation of Sahih Muslim, saying: Chapter on the Command to Fight People until they say: There is no deity but Allah, Muhammad is the Messenger of Allah, establish prayer, give zakat, and believe in all that the Prophet, may Allah's peace and blessings be upon him, brought. And that whoever says that has protected his self and wealth except by its right, and his secrets are entrusted to Allah Almighty. And Fighting whoever withheld Zakat or other rights of Islam. And the Imam's concern with the rites of Islam. He cited (1) the hadith then said: Al-Khattabi said in explaining this speech good words that must be mentioned due to the benefits therein. He, may Allah have mercy on him, said: What must be presented regarding this is knowing that the people of apostasy were of two types. A type who apostatized from the religion, abandoned (2) the Millah, and returned to their disbelief; these are whom Abu Hurairah meant by his saying: \"And those of the Arabs who disbelieved disbelieved.\" The other type differentiated between prayer and zakat; they acknowledged prayer but denied the obligation of zakat and the necessity of paying it to the Imam. Included among these who withheld Zakat (3) were those who allowed Zakat and did not withhold it, except that their leaders prevented them from that view and seized their hands in that matter, like Banu Yarbu', for they gathered their zakat and wanted to send it to Abu Bakr, but Malik bin Nuwayrah prevented them from that and distributed it among them. Regarding these, disagreement arose and doubt occurred to Umar, may Allah be pleased with him, so he reviewed Abu Bakr, may Allah be pleased with him, and debated him, arguing against him with the saying of the Prophet, may Allah's peace and blessings be upon him: \"I have been ordered to fight the people until they say there is no deity but Allah; whoever says there is no deity but Allah has protected his self and wealth.\" This was from Umar an attachment to the apparent meaning of the speech",
    "foot_note": "1. In \"A\" \"Thumma\" (Then). The author, may Allah have mercy on him, abbreviated Al-Khattabi's speech. See it fully in Sahih Muslim Sharh Al-Nawawi \"1/202\" to \"206\".\n2. In \"B\" \"Nabadhu\" (Discarded).\n3. In \"B\" \"meaning those who withheld\" and in \"A\" \"The withholders of Zakat\".",
    "book_id": "1"
  },
  {
    "serial_number": "54446",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 70,
    "volume_number": 1,
    "text": "before looking into its end and contemplating its conditions. So Abu Bakr said to him: Zakat is the right of wealth, meaning that the proposition implies protection of blood and wealth conditioned upon fulfilling its requirements, and a ruling conditioned on two things is not achieved by one while the other is absent. Then he analogized it to prayer and referred zakat to it. In his statement was proof that fighting the one who refuses prayer was a consensus among the Companions—may Allah be pleased with them—therefore he referred the disputed matter to the agreed-upon matter. When the correctness of Abu Bakr's opinion settled with them and its rightness became clear to Umar, he followed him in fighting the people. This is the meaning of his saying: \"When I saw that Allah had expanded Abu Bakr's chest for fighting, I knew it was the truth,\" meaning the expansion of his chest by the argument he presented and the proof he established textually and indicatively. End quote. Reflect on this chapter mentioned by Al-Nawawi—may Allah have mercy on him, who is the Imam of the Shafi'is absolutely—you will find it explicit in refuting your doubt that whoever says: There is no deity but Allah Muhammad is the Messenger of Allah, his blood and wealth are not permissible even if he abandons prayer and withholds Zakat. The heading itself is explicit in refuting your view, for he declared the command to fight for abandoning prayer and withholding Zakat. And reflect on what Al-Khattabi mentioned that among those who withheld Zakat were those who acknowledged it and did not withhold it, except that their leaders prevented them from that view and seized their hands, like Banu Yarbu', for they wanted to send it to Abu Bakr but Malik bin Nuwayrah prevented them from that and distributed it among them. And that disagreement arose and doubt occurred to Umar regarding the matter of these people, then Umar agreed with Abu Bakr on fighting them. And reflect on his saying: Umar argued with the saying of the Prophet, may Allah's peace and blessings be upon him: \"I have been ordered to fight the people until they say there is no deity but Allah.\" This was from Umar an attachment to the apparent meaning of the speech before looking into its end and contemplating its conditions. And reflect on his saying: \"That fighting the one who refuses prayer was a consensus among the Companions.\" And he pointed out",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54447",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 71,
    "volume_number": 1,
    "text": "Al-Khattabi pointed out that Abu Hurairah's hadith is abbreviated. Al-Nawawi, may Allah have mercy on him, said: Al-Khattabi said: It becomes clear to you that Abu Hurairah's hadith is abbreviated because Abdullah bin Umar and Anas, may Allah be pleased with them, narrated it with an addition not mentioned by Abu Hurairah. In Ibn Umar's hadith from the Messenger of Allah, may Allah's peace and blessings be upon him, he said: \"I have been ordered to fight the people until they testify that there is no deity but Allah and that Muhammad is the Messenger of Allah, establish prayer, and give zakat. If they do that, they have protected their blood and wealth from me except by its right.\" In Anas's narration: \"I have been ordered to fight the people until they testify that there is no deity but Allah and that Muhammad is the Messenger of Allah, face our Qiblah, eat our slaughtered animals, and pray our prayer. If they do that, their blood and wealth are forbidden to us except by its right; they have the rights of Muslims and the obligations of Muslims.\" End quote. I say (1): It has been established in the third path mentioned in the Book from the narration of Abu Hurairah that the Messenger of Allah, may Allah's peace and blessings be upon him, said: \"I have been ordered to fight the people until they testify that there is no deity but Allah, and believe in me and what I brought. If they say that, they have protected their blood and wealth from me except by its right.\" In Abu Bakr's reasoning and Umar's objection, may Allah be pleased with him, is proof that they did not memorize from the Messenger of Allah, may Allah's peace and blessings be upon him, what Ibn Umar, Anas, and Abu Hurairah narrated. It seems (2) these three heard this addition in their narration in another gathering. For if Umar had heard that, he would not have disagreed, nor would he have argued with the hadith, because this addition is a proof against him. And if Abu Bakr had heard this addition, he would have argued with it, and would not have argued with analogy and generality. And Allah knows best. End of Al-Nawawi's words.",
    "foot_note": "1. The speaker is Al-Nawawi, may Allah have mercy on him.\n2. In \"A\" and \"B\" \"Wa-kanu\" (And they were), what I established is from the Manar edition and Sharh Muslim.",
    "book_id": "1"
  },
  {
    "serial_number": "54448",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 72,
    "volume_number": 1,
    "text": "Reflect on what Al-Khattabi mentioned, you will find it explicit in refuting your saying. Reflect on his saying: \"For if Umar had heard that, he would not have disagreed, nor would he have argued with the hadith, because this addition is a proof against him.\" In summary, Abu Hurairah's hadith is a proof against you, not for you. Even if it contained nothing but his saying: \"except by its right,\" it would be sufficient to invalidate your doubt, for prayer and zakat are among the greatest rights of 'La ilaha illa Allah,' rather they are the greatest of them absolutely. What also indicates the falsehood of your saying and the corruption of your understanding regarding the meaning of the hadith—meaning Abu Hurairah's hadith \"I have been ordered to fight the people until they say there is no deity but Allah\"—is that all the commentators and annotators did not interpret it according to this interpretation you went to. It is an authentic hadith extracted in the Sahihs. These commentators of Al-Bukhari and its annotators are around (1) forty, as Al-Qastallani noted in the introduction to the explanation of Al-Bukhari, and likewise the commentators of Muslim. Did any of them use it as evidence for abandoning the fighting (2) of one who abandons obligations? Rather, what they mentioned contradicts what you went to. Even if there were nothing but Umar's arguing with it against Abu Bakr and then his agreement with Abu Bakr on fighting the withholders of Zakat, it would be sufficient. We will mention to you the words of the commentators as an excuse and a warning. Al-Nawawi—may Allah the Exalted have mercy on him—said: His saying, peace and blessings be upon him: \"I have been ordered to fight the people until they say there is no deity but Allah, so whoever says: There is no deity but Allah has protected his wealth and self from me except by its right, and his reckoning is with Allah to whom belong might and majesty.\" Al-Khattabi said: It is known that the intended meaning of this is the idolaters, not the People of the Book, because they say 'There is no deity but Allah' yet they are fought and the sword is not lifted from them. He said: And the meaning of \"his reckoning is with Allah\" is",
    "foot_note": "1. In \"A\" and \"B\" \"Nahw\" (about), what I established is from the Manar edition.\n2. In \"B\" \"Qatl\" (Killing).",
    "book_id": "1"
  },
  {
    "serial_number": "54449",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 73,
    "volume_number": 1,
    "text": "regarding what they conceal and hide, not what they neglect openly. He said: In it is evidence that whoever manifests Islam and conceals disbelief, his Islam is accepted from him outwardly. This is the view of most scholars. Malik held that the repentance of a Zindiq (heretic) is not accepted, and this is narrated from Ahmad bin Hanbal (1). This is Al-Khattabi's speech. Al-Qadi Iyad, may Allah have mercy on him, mentioned the meaning of this and added to it and clarified it, saying: The specification of wealth and life protection for one who says 'There is no deity but Allah' is an expression (2) for responding to faith, and the intent is the polytheists of the Arabs and the idol worshippers and those who do not profess monotheism. They were the first to be invited to Islam and fought (3) over it. As for others who acknowledge Tawhid, saying 'There is no deity but Allah' is not sufficient for their protection if they say it while in their disbelief and it is part of their belief. Therefore, the other hadith came: \"And that I am the Messenger of Allah, establish prayer, and give zakat.\" This is the speech of Al-Qadi Iyad. I say: There must be belief in what the Messenger of Allah, may Allah's peace and blessings be upon him, brought, as came in the other narration of Abu Hurairah: \"Until they testify that there is no deity but Allah, and believe in me and what I brought.\" End of Al-Nawawi's speech. Reflect on what Al-Khattabi mentioned and what Al-Qadi mentioned that the intent of saying: \"There is no deity but Allah\" is an expression for responding to faith, and he cited as evidence the other hadith which contains \"And that I am the Messenger of Allah, establish prayer, and give zakat.\"",
    "foot_note": "1. The discussion on Imam Ahmad's Madhhab, may Allah have mercy on him, regarding the repentance of the Zindiq preceded in the first treatise.\n2. In \"B\" \"Ta'biran\" (accusative), which is an error.\n3. In \"B\" \"Qutilu\" (were killed).",
    "book_id": "1"
  },
  {
    "serial_number": "54450",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 74,
    "volume_number": 1,
    "text": "Reflect on his saying: \"The intent of Abu Hurairah's hadith is the Arab polytheists and those who do not profess monotheism. As for others who acknowledge Tawhid, saying 'There is no deity but Allah' is not sufficient for their protection if they say it while in their disbelief and it is part of their belief.\" And reflect on Al-Nawawi's saying: \"There must be belief in what the Messenger of Allah, may Allah's peace and blessings be upon him, brought.\" In summary, his saying, peace and blessings be upon him: \"I have been ordered to fight the people until they say there is no deity but Allah,\" we do not (1) know anyone among the scholars who applied it according to its apparent meaning and said that whoever says 'There is no deity but Allah' is desisted from and his fighting is not permissible even if he abandons prayer and withholds zakat. No scholar has said this. The implication of your saying is that the Jews are not permissible to fight because they say 'There is no deity but Allah.' \"And that the Kharijites whom Ali bin Abi Talib fought are not permissible to fight because they say 'There is no deity but Allah'\" (2). And that the Companions were mistaken in fighting the withholders of Zakat because they say 'There is no deity but Allah.' Nay, the implication of your saying is that Banu Hanifa are Muslims permissible not to be fought because they say 'There is no deity but Allah.' Glory be to Allah, how great is this ignorance! {Thus does Allah seal the hearts of those who do not know} [Ar-Rum: 59]. It is strange that you read in Sahih Al-Bukhari this chapter which he mentioned in the Book of Faith, where he said: Chapter {But if they repent, establish prayer, and give zakat, then let them go their way}. Abdullah bin Muhammad Al-Musnadi (3) told us, Abu Rawh Al-Harami (4) told us, Shu'bah told us from Waqid bin Muhammad who said: I heard my father",
    "foot_note": "1. In \"B\" \"Lam\" (Did not).\n2. What is between parentheses is from the Manar edition.\n3. In the Manar edition \"Al-Sindi\" which is an error.\n4. In the Manar edition \"Al-Jarmi\" and in \"B\" \"Al-Hari\", both are errors.",
    "book_id": "1"
  },
  {
    "serial_number": "54451",
    "category_id": "1",
    "category": "Creed (Aqidah)",
    "book_title": "Al-Fawakih al-Adhab fi al-Radd 'ala man lam Yuhakkim as-Sunnah wa al-Kitab",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 75,
    "volume_number": 1,
    "text": "narrating from Ibn Umar, may Allah be pleased with them both, that the Messenger of Allah, may Allah's peace and blessings be upon him, said: \"I have been ordered to fight the people until they testify that there is no deity but Allah and that Muhammad is the Messenger of Allah, establish prayer, and give zakat. If they do that, they have protected their blood and wealth from me except by the right of Islam, and their reckoning is with Allah.\" Then after that you say whoever says: 'There is no deity but Allah,' his wealth and blood are forbidden. I do not know how you answer this verse and the two hadiths mentioned by Al-Bukhari, and with what thing you repel these evidences? Imam Abu Isa At-Tirmidhi said in his Sunan: Chapter on 'I have been ordered to fight the people until they say there is no deity but Allah.' Hannad told us, Abu Mu'awiyah told us from Al-A'mash from Abu Salih from Abu Hurairah who said the Messenger of Allah, may Allah's peace and blessings be upon him, said: \"I have been ordered to fight the people until they say there is no deity but Allah\" the Hadith. Then he followed it with the hadith of Abu Hurairah regarding Abu Bakr's fighting the withholders of Zakat, and cited the hadith in full. Then he said: Chapter on what has come regarding 'I have been ordered to fight the people until they testify that there is no deity but Allah and establish prayer.' Sa'id bin Ya'qub Al-Taliqani told us, Ibn Al-Mubarak (1) told us, Humaid Al-Tawil told us from Anas bin Malik who said the Messenger of Allah, may Allah's peace and blessings be upon him, said: \"I have been ordered to fight the people until they testify that there is no deity but Allah and that Muhammad is His servant and Messenger, face our Qiblah, eat our slaughtered animals, and pray our prayer. If they do that, their blood and wealth are forbidden to us except by its right; they have what Muslims have and upon them is what is upon Muslims.\" In the chapter there are [narrations] from Mu'adh bin Jabal and Abu Hurairah. This is a Hasan Sahih hadith. The purpose is to clarify the corruption of this doubt which one who claims to be a scholar has inserted upon the ignorant people: that whoever says 'There is no deity but Allah Muhammad is the Messenger of Allah'",
    "foot_note": "1. \"Ibn Al-Mubarak\" is missing from the Manar edition.",
    "book_id": "1"
  },
  {
    "serial_number": "54452",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 76,
    "volume_number": 1,
    "text": "he is a Muslim, and his killing is not permissible even if he abandons the obligations of Islam. This is the speech of Allah, and this is the speech of His Messenger, and this is the explicit speech of the scholars (1) in refuting this doubt. Rather, the Book, the Sunnah, and consensus have indicated that the group abstaining from prayer and withholding Zakat is fought, even if they acknowledge the obligation, as the texts indicating that have preceded. Indeed, the scholars have stated that if the people of a town abandon the Adhan and Iqamah, they are fought, as will come. They also stated that if they abandon establishing the congregational prayer, they are fought. Likewise, if they abandon the Eid prayer. But the scholars of the Noble Sanctuary (2) say: Whoever says 'There is no god but Allah' has protected his wealth and life, even if he does not pray and does not pay Zakat (3). So glory be to Allah, the Turner of hearts and eyes (4), how He wills. Is this anything but opposition to the speech of Allah, the speech of a Messenger, and the speech of the Imams of the schools of thought? Their speech is present in their books, stating that whoever abandons prayer is killed, and that the group abstaining from performing prayer, Zakat, fasting, and Hajj is fought until the religion is all for Allah, and they narrate consensus on it, as stated by the Hanbali Imams in their books. If they state that whoever abandons some of the rituals of Islam, like the people of a village if they abandon the Adhan, or abandon the congregational prayer, or abandon the Eid prayer, are fought, then how about one who abandons prayer altogether? Yet these say: Whoever says 'There is no god but Allah, Muhammad is the Messenger of Allah' has protected his wealth and blood, even if they are a group abstaining from performing prayer and Zakat. Rather, they state that the people (5) of the desert are Muslims (6), their blood and wealth are forbidden to us, despite the certain knowledge that they do not",
    "foot_note": "1. In \"B\" \"sareeh\" (explicit). \n2. In \"B\" and Al-Manar \"Haram Allah\" (Allah's Sanctuary). \n3. In \"A\" and \"B\" \"wa lam yuzakki\" (and does not purify/pay Zakat). \n4. Not in \"A\" and \"B\". \n5. Not in \"A\" and \"B\". \n6. In \"A\" \"Islam\".",
    "book_id": "1"
  },
  {
    "serial_number": "54453",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 77,
    "volume_number": 1,
    "text": "perform Adhan, nor pray, nor pay Zakat. Rather, it is apparent from them that they disbelieve in the laws and deny the resurrection after death. Glory be to Allah, how great is this ignorance. We have mentioned from the speech of Allah, the speech of His Messenger, and the speech of the commentators on Hadith what contains guidance for whom Allah guides. And we clarified that the condition for protection is Tawhid (monotheism), establishing prayer, and giving Zakat. Whoever does not bring these three, is not refrained from, nor is his way cleared. Allah Almighty said: {And fight them until there is no fitnah and [until] the religion, all of it, is for Allah} [Al-Anfal - 39], and He Almighty said: {So kill the polytheists wherever you find them and capture them and besiege them and sit in wait for them at every place of ambush. But if they should repent, establish prayer, and give zakah, let them go on their way} [At-Tawbah - 5], and the Prophet, peace and blessings be upon him, said: \"I have been ordered to fight the people until they testify that there is no god but Allah and that Muhammad is the Messenger of Allah, establish prayer, and give zakah. If they do that, they have protected their blood and wealth from me except for the right of Islam, and their reckoning is with Allah.\" As for the speech of the jurists, we will mention it in detail, if Allah wills! As for the speech of the Malikis, Sheikh Ali Al-Ajhuri said in Sharh Al-Mukhtasar: Whoever delays a prescribed prayer until the remaining (1) time allows only for a rak'ah with its two prostrations out of necessity, is killed by the sword as a Hadd (punishment) according to the well-known opinion. Ibn Habib and a group said the apparent view of the school is that he is killed as a disbeliever, and Ibn Abd al-Salam chose this. End quote. And he said regarding the virtue of Adhan: Al-Maziri said: There are two meanings in Adhan, one is manifesting the rituals and defining that the abode is an abode (2) of Islam, and it is a collective obligation (Fard Kifayah)",
    "foot_note": "1. In \"A\" \"fabaqa'\" (so remaining). \n2. \"Dar\" (abode) is missing from \"A\".",
    "book_id": "1"
  },
  {
    "serial_number": "54454",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 78,
    "volume_number": 1,
    "text": "the people of the village are fought until they perform it. If he is unable to compel them to establish it except by fighting, they are fought (1). The second is calling to prayer and announcing its time. Al-Ubbi said in Sharh Muslim: The well-known view is that Adhan is a collective obligation upon the people of a city because it is a symbol of Islam. For the Messenger of Allah, peace and blessings be upon him, used to raid if he did not hear the Adhan, otherwise he would refrain (2). The author said they are fought over it; fighting over it is not specific to the view of obligation because it is explicitly stated by Iyad. In the author's statement, Witr is not obligatory, except (3) that they differed regarding colluding to abandon the Sunnahs, are they fought over them? The correct view is fighting them and compelling them because colluding to abandon them is causing them to die. End quote. And he said regarding the virtue of congregational prayer: Ibn Rushd said: Congregational prayer is recommended for a man individually (4), a collective obligation in general. By saying 'in general', he means it is a collective obligation upon the people of a city, and if they abandon it, they are fought as preceded. End quote. The phrase of others is: If the people of a town abandon it, they are fought, and the people of a neighborhood are forced to do it. End of Sheikh Ali Al-Ajhuri's speech. So look at their declaration that the abandoner of prayer is killed by the agreement of Malik's companions, but they differed regarding his disbelief, and that Ibn Habib and Ibn Abd al-Salam chose that he is killed as a disbeliever. Reflect on their speech regarding the group abstaining from Adhan or from establishing the congregation in mosques, that they are fought. So where is this from your saying that whoever abandons",
    "foot_note": "1. \"Qutilu\" (they are fought) is missing from \"A\" and \"B\". \n2. Al-Bukhari narrated it in his Sahih \"2/ 89\" and Muslim in his Sahih 2/ 288. \n3. \"Illa\" (except) is missing from \"A\" and \"B\". \n4. It was preceded in the first treatise clarifying that the correct view is the individual obligation of prayer.",
    "book_id": "1"
  },
  {
    "serial_number": "54455",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 79,
    "volume_number": 1,
    "text": "the obligations while acknowledging their obligation, it is not lawful to fight them because they say: 'There is no god but Allah'. As for the speech of the Shafi'is, the Imam, the scholar Ahmad bin Hamdan Al-Adhra'i, may Allah have mercy on him, said in the book \"Qut al-Muhtaj fi Sharh al-Minhaj\": Whoever abandons prayer denying its obligation disbelieves by consensus, and this applies to every denial of something agreed upon and known from the religion by necessity. Whoever abandons it out of laziness is killed as a Hadd (punishment) according to the correct or well-known view. As for his killing, it is because Allah commanded killing the polytheists then said: {But if they repent, establish prayer, and give zakah, let them go on their way}. [At-Tawbah - 5] This indicates that killing is not lifted except by faith, establishing prayer, and giving Zakat. And due to what is in the Two Sahihs: \"I have been ordered to fight the people until they testify that there is no god but Allah and that Muhammad is the Messenger of Allah, establish prayer, and give Zakat. If they do that, they have protected their blood and wealth from me except for its right.\" Then he said: \"Indications\", among them is making his killing apostasy, and a group among them, Mansur Al-Tamimi and Ibn Khuzaymah, inclined towards this. The implication of Al-Rawnaq's speech is that it is a textual statement (1) where he said: If he is killed, then regarding his wealth and burial among Muslims there are two views: One is what Al-Rabi' narrated from Al-Shafi'i that his wealth becomes Fay' (spoils) and he is not buried in Muslim cemeteries. The second is what Al-Muzani narrated from Al-Shafi'i that his wealth goes to his heirs and he is buried in Muslim cemeteries. Mansur said in Al-Musta'mal: I asked Al-Rabi': What do we do with his wealth if we kill him? He said: It becomes Fay'. \"And among them\", he said in Al-Rawdah: The abandoner of Wudu' is killed according to the correct view, Sheikh Abu Hamid asserted this. In Al-Bayan: If he prays naked while able to cover (2) or [prays] the obligatory prayer sitting without excuse, he is killed. Similarly, if he abandons the Tashahhud or standing straight (I'tidal), Ibn Al-Ustadh narrated it from Al-Bahr. If this is correct, it applies to all pillars",
    "foot_note": "1. In the printed version \"Mansur\". \n2. In \"A\" \"Al-Satr\".",
    "book_id": "1"
  },
  {
    "serial_number": "54456",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 80,
    "volume_number": 1,
    "text": "and conditions, and its place must be in what is agreed upon. And among them, if he refrains from fasting and Zakat specifically and prevents the invalidators (of fasting). Imam al-Haramayn said: It is permissible to make the one refraining from what is restricted upon him, like the one refraining from prayer, be compelled to do it; if he refuses, his neck is struck. The author said: The correct view is killing him for one prayer provided it is taken out of the time of necessity. End of Al-Adhra'i's speech. So look at his speech regarding killing the one who abandons prayer out of laziness. And that Rabi' narrated from Al-Shafi'i that his wealth becomes Fay' and he is not buried in Muslim cemeteries. Reflect on the speech of Abu Hamid and the speech of the author of Al-Rawdah regarding killing the abandoner of Wudu', and the speech of the author of Al-Bayan regarding the one who prays naked while able to cover and prays the obligatory prayer sitting without excuse, that he is killed. So where is this from your saying that whoever says 'There is no god but Allah', one refrains from him and his fighting is not permissible in any way. Sheikh Ahmad bin Hajar Al-Haytami (1) said in Al-Tuhfah in the chapter of the ruling on the abandoner of prayer: If he abandons prayer denying its obligation, he disbelieves by consensus, or abandons it out of laziness while believing in its obligation, he is killed due to the verse {But if they repent} and the report \"I have been ordered to fight the people\", for they are two conditions (2) for refraining from killing and fighting: Islam, establishing prayer, and giving Zakat. Because the Imam can take Zakat even by fighting from those who refrain and fight, so it was literal in it, contrary to prayer, for it cannot be done by fighting. So it was in it meaning killing (3). And he said in the chapter of congregational prayer: It is said it is an obligation for men, so it is mandatory",
    "foot_note": "1. In \"A\" and \"B\" \"Al-Haythami\" which is an error. \n2. In \"A\" and \"Al-Manar\" \"sharta\" (two conditions). \n3. Here a lot is missing from \"A\".",
    "book_id": "1"
  },
  {
    "serial_number": "54457",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 81,
    "volume_number": 1,
    "text": "such that the rituals (1) become apparent by it in that place, in the desert or elsewhere. If the symbol does not appear, such that all or some of them refrain - like the people of a quarter of a large village and the symbol does not appear except by them - they are killed, the Imam or his deputy fights them (2) to manifest this great ritual. He said in the chapter of Adhan: Adhan and Iqamah are Sunnah, and it is said a collective obligation, so the people of a town who abandon them or one of them such that they do not manifest the rituals are fought (3). He said in the chapter of Eid prayers: It is Sunnah, and it is said a collective obligation, so based on it, the people of a town who abandon them or one of them are fought. End of his speech in Al-Tuhfah (4). So look at his speech regarding killing the abandoner of prayer out of laziness. And reflect on his saying that the verse and the hadith are two conditions for refraining from killing and fighting: Islam and establishing",
    "foot_note": "1. In both copies \"Al-Shi'ar\" (the symbol). \n2. In \"A\" \"yuqatil\" (he fights). \n3. Imam Ibn Qudamah said in his book Al-Mughni \"1/ 302\": The apparent speech of Al-Khiraqi is that Adhan is a confirmed Sunnah and not obligatory because he made abandoning it disliked. This is the view of Abu Hanifa and Al-Shafi'i, because it is a call to prayer so it resembled his saying: \"Prayer is in congregation\". And Abu Bakr bin Abd al-Aziz said it is one of the collective obligations. This is the view of most of our companions, and the view of Malik's companions. Ata, Mujahid, and Al-Awza'i said: It is obligatory because the Prophet, peace and blessings be upon him, ordered Malik and his companion with it. And he, his caliphs, and his companions persisted on it, and the command implies obligation... etc. End. Sheikh al-Islam Abu al-Abbas preferred the view of the majority of companions \"Majmu' al-Fatawa 22/ 64\" \"Hashiyat al-Rawd al-Murbi' 1/ 429\". \n4. What most of our companions are upon in this issue - as in Al-Insaf - is that it is a collective obligation. There is a narration from Imam Ahmad regarding its obligation chosen by Sheikh al-Islam Ibn Taymiyyah - as in Al-Insaf, and it is the school of Imam Abu Hanifa. And from Imam Ahmad there is another narration of its recommendation in agreement with Malik and most of Al-Shafi'i's companions. See Al-Mughni by Ibn Qudamah \"2/ 272\" and Al-Insaf by Al-Mardawi \"2/ 420\". And Hashiyat al-Rawd al-Murbi' by Ibn Qasim \"2/ 492\".",
    "book_id": "1"
  },
  {
    "serial_number": "54458",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 82,
    "volume_number": 1,
    "text": "prayer and giving Zakat, and that the Imam takes Zakat by fighting from those who refrain or fight. Reflect on his speech in the chapter of congregational prayer, that it is obligatory such that the symbol appears in that place even in the desert, and that they are fought if they refrain. Reflect on his speech regarding Adhan and Iqamah, that the Imam fights over abandoning them and over abandoning one of them according to the view that they are a collective obligation. Reflect on his speech regarding the group if they refrain from the Eid prayers. So where is this from the speech of one who says: The people of the town and the deserts, if they say: 'There is no god but Allah, Muhammad is the Messenger of Allah', fighting them is not permissible even if they do not pray or pay Zakat. Glory be to Allah, how great is this ignorance. As for the speech of the Hanbalis, he said in Al-Iqna' and its commentary in the Book of Prayer: Whoever denies its obligation disbelieves. If he abandons it out of negligence and laziness, not denial (1), the Imam or his deputy calls him to perform it due to the possibility that his abandonment is for an excuse by which he believes it drops, like illness and the like. So he threatens him; if he refuses to pray it until the time of the next one becomes tight, killing him becomes obligatory due to the Almighty's saying: {So kill the polytheists wherever you find them} - up to His saying - {But if they repent, establish prayer, and give zakah, let them go on their way}. [At-Tawbah - 5]. So whoever (2) abandons prayer has not fulfilled the condition for clearing the way, so he remains under the permissibility of killing. And due to his saying, peace be upon him: \"Whoever abandons prayer intentionally, the protection of Allah and His Messenger is absolved from him.\" Narrated by Imam Ahmad from Makhul, and it is a good Mursal (3). He is not killed until he is asked to repent for three days like an apostate (4) according to the text. If he repents by performing it, otherwise he is killed by striking his neck with a sword due to what Jabir narrated from the Prophet, peace and blessings be upon him, that he said: \"Between a man and disbelief is abandoning prayer\" narrated by Muslim. And Buraidah narrated",
    "foot_note": "1. In both copies \"la juhud\" (no denial) which is an error. \n2. In both copies \"famata\" (so when). \n3. Stated by Ibn Muflih in Al-Mubdi'. \n4. Meaning like other apostates.",
    "book_id": "1"
  },
  {
    "serial_number": "54459",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 83,
    "volume_number": 1,
    "text": "that the Prophet, peace and blessings be upon him, said: \"Whoever abandons it has disbelieved.\" Narrated by the five and authenticated by Al-Tirmidhi. End. He said - may Allah have mercy on him - in the chapter of Adhan and Iqamah: If the people of a town abandon them, i.e., Adhan and Iqamah, they are fought, i.e., the Imam or his deputy fights them until they perform them, because they are among the apparent symbols of religion, so they are fought for abandoning them like the Eid prayer. He said - may Allah have mercy on him - in the chapter of congregational prayer: It is obligatory as an individual obligation, so its abandoner is fought like Adhan. But regarding Adhan, fighting is only over its abandonment if all the people of the town abandon it, contrary to the congregation, for its abandoner is fought even if others establish it because its obligation is on individuals, unlike the other. He said - may Allah have mercy on him - in the chapter of Eid prayers: It is a collective obligation. If the people of a town reaching forty abandon it without excuse, the Imam fights them like Adhan because it is among the apparent rituals of Islam, and abandoning it is negligence in religion. He said - may Allah have mercy on him - in \"Chapter of Paying Zakat\": Whoever withholds it out of miserliness or negligence, it is taken from him by force like a debt to a human. If he hid his wealth or concealed it and it was possible to take it by being in the Imam's grasp, it is taken from him without increase. If it is not possible to take it, he is asked to repent for three days obligatorily. If he repents and pays, one refrains from him; otherwise, he is killed due to the consensus of the Companions on fighting those who withhold it. And if it is not possible to take it except by fighting, it is obligatory on the Imam to fight him if he places it in its place. End of his speech in Al-Iqna' and its commentary. So reflect on his speech regarding the one who abandons prayer out of laziness without denial, that he is asked to repent, if he repents, otherwise he is killed as a disbeliever. Reflect on his speech regarding the people of towns, if they abandon Adhan, Iqamah, and Eid prayer, that they are fought merely for abandoning that. This is the speech of the Malikis, this is the speech of the Shafi'is, and this is the speech of the Hanbalis; all of them have explicitly stated what we mentioned. If they explicitly state fighting those who adhere to the laws of",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54460",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 84,
    "volume_number": 1,
    "text": "Islam, except that they abandoned the Adhan, or abandoned the congregational prayer, or abandoned the Eid prayer, then how about one who abandons prayer completely like the Bedouins who do not pray, do not pay Zakat, and do not fast, but rather deny the laws and deny the resurrection after death? This is dominant over them except whom Allah wills, and they are few. Otherwise, most of them do not possess anything of Islam except that they say 'There is no god but Allah'. Yet despite this, the scholars of Noble Mecca argue for them and say: They are Muslims, and their blood and wealth are sacred by the sanctity of Islam, even if they do not pray, do not pay Zakat, and do not fast, except that they say 'There is no god but Allah'. Is this anything but a rejection of Allah Almighty where He said: {So kill the polytheists wherever you find them and capture them and besiege them and sit in wait for them at every place of ambush. But if they should repent, establish prayer, and give zakah, let them go on their way} [At-Tawbah - 5]. And these say their way is cleared even if they do not pray and do not pay Zakat. In the Two Sahihs from the Prophet, peace and blessings be upon him, that he said: \"I have been ordered to fight the people until they testify that there is no god but Allah and that Muhammad is the Messenger of Allah, establish prayer, and give Zakat. If they do that, they have protected their blood and wealth from me except by the right of Islam.\" And these say: Whoever says 'There is no god but Allah', his blood and wealth are protected even if he does not pray and does not pay Zakat {Thus does Allah seal the hearts of those who do not know} [Ar-Rum - 59]. So this is the Book of Allah, this is the Sunnah of His Messenger, and this is the consensus of the Companions on killing whoever abandons prayer or withholds Zakat. The Siddiq of the Ummah Abu Bakr, may Allah be pleased with him, said: \"By Allah, I will fight whoever differentiates between prayer and Zakat. By Allah, if they withheld from me a rope (iqal) they used to give to the Messenger of Allah, peace and blessings be upon him - and in a narration a kid goat - I would fight them for withholding it.\" This is also the consensus of the scholars. He said in Sharh Al-Iqna': The scholars agreed that every group abstaining from a law from the laws of Islam, it (1) is obligatory to fight them until the religion is all for Allah",
    "foot_note": "1. In \"A\" and \"B\" \"fa'innahum\" (then they).",
    "book_id": "1"
  },
  {
    "serial_number": "54461",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 85,
    "volume_number": 1,
    "text": "like combatants (Muharibin) and more so. End. Abu al-Abbas, may Allah have mercy on him, said: \"Fighting is obligatory until the religion is all for Allah and until there is no fitnah. So whenever religion is for other than Allah, fighting is obligatory. So any abstaining group that abstains from some of the obligatory prayers, or Zakat, or fasting, or Hajj, or from adhering to the prohibition of blood, wealth, wine, adultery, gambling, marrying close relatives (Maharim), or from adhering to Jihad against disbelievers, or imposing Jizya on the People of the Book, or other obligations of religion or its prohibitions which no one has an excuse to deny or abandon, which one disbelieves by denying, then the abstaining group is fought over it even if they acknowledge it. This is something I know no disagreement about among the scholars. The jurists only differed regarding the abstaining group if they persist in abandoning some Sunnahs like the two Rak'ahs of Fajr, or Adhan or Iqamah according to those who do not say they are obligatory, and similar rituals; is the abstaining group fought over abandoning them or not? As for the mentioned obligations or prohibitions and the like, there is no disagreement in fighting over them.\" End of his speech. So reflect on the speech of the Imam of the Hanbalis and his declaration that whoever abstains from a law from the apparent laws of Islam like the five prayers, fasting, Zakat, or Hajj, or from abandoning prohibitions like adultery, drinking wine or intoxicants or other things, it is obligatory to fight the group abstaining from that until the religion is all for Allah, and they adhere (1) to all laws of Islam, even if they pronounce the two testimonies with that, and adhere to some laws of Islam. And that this is what the jurists from all the Companions and those after them agreed upon. So where is this from your saying: That whoever says 'There is no god but Allah' has protected his wealth and blood even if he abandons (2) the obligations and commits (3) the prohibitions? Rather, whoever reflects on the biography of the Prophet, peace and blessings be",
    "foot_note": "1. In \"B\" and \"Al-Manar\" \"yaltazimun\" (they adhere). \n2. In \"A\" \"irtakabu - taraku\" (committed - abandoned). \n3. In \"A\" \"irtakabu - taraku\" (committed - abandoned).",
    "book_id": "1"
  },
  {
    "serial_number": "54462",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 86,
    "volume_number": 1,
    "text": "upon him, and the biography of the Rightly Guided Mahdi Caliphs after him knows that this saying of yours contradicts what the Prophet, peace and blessings be upon him, did and what the Rightly Guided Caliphs and those after them did. So glory be to Allah: \"Did you not know that the Messenger of Allah, peace and blessings be upon him, fought the Jews while they were saying 'There is no god but Allah', captured their women, and made lawful their blood and wealth?\" (1) Did you not know that the Messenger of Allah, peace and blessings be upon him, intended to raid Banu Al-Mustaliq when it was said to him they withheld Zakat, and the one who said it was lying? The story is famous in the books of Hadith and Tafsir, mentioned by the commentators at His saying: {O you who have believed, if there comes to you a disobedient one with information, investigate} [Al-Hujurat - 6]. Did you not know that Ali bin Abi Talib, may Allah be pleased with him, burned the Ghaliyah (extremists) even though they say 'There is no god but Allah'? Did you not know that the Companions, may Allah be pleased with them, fought the Khawarij by the command of their Prophet, peace and blessings be upon him, even though he, peace and blessings be upon him, informed that the Companions would belittle their prayer compared to their prayer, and their fasting compared to their fasting, and their recitation compared to their recitation, and said: \"Wherever you find them, kill them\"? Did you not know that the Companions fought Banu Hanifa while they testified that there is no god but Allah and that Muhammad is the Messenger of Allah, and prayed and called Adhan? (2) Did you not know that the Companions fought Banu Yarbu' when they withheld Zakat, even though they acknowledged its obligation and had collected their charities and wanted to send them to Abu Bakr but Malik bin Nuwayrah prevented them? In the matter of these people, a doubt presented itself to Umar, may Allah be pleased with him, until Abu Bakr the Truthful, may Allah be pleased with him, cleared it and said:",
    "foot_note": "1. What is between parentheses is from the printed version. \n2. In the printed version \"and fasted\".",
    "book_id": "1"
  },
  {
    "serial_number": "54463",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 87,
    "volume_number": 1,
    "text": "\"By Allah, if they withheld from me a rope (iqal) - and in a narration a kid goat - they used to give to the Messenger of Allah, peace and blessings be upon him, I would fight them for withholding it.\" Umar said: By Allah, it was nothing but that I saw Allah had expanded Abu Bakr's chest for fighting, so I knew it was the truth. This has been discussed in detail previously, and we mentioned its wording in Sharh Muslim in \"Chapter of the Command to Fight People until they say: There is no god but Allah, establish prayer, and give Zakat\". Did you not know that the Messenger of Allah, peace and blessings be upon him, sent the banner bearer (1) to a man who married his father's wife as Al-Tirmidhi narrated in his Sunan where he said: \"Chapter on what came regarding one who marries his father's wife\". Abu Sa'id Al-Ashajj told us, Hafs bin Ghiyath (2) informed us from Ash'ath from Adi bin Thabit from Al-Bara' who said: My maternal uncle Abu Burdah passed by me having a banner, so I said: Where do you want to go? He said: The Messenger of Allah, peace and blessings be upon him, sent me to a man who married his father's wife to bring him his head. A Hasan Gharib hadith. End (3).",
    "foot_note": "1. In \"A\" and \"B\" \"Al-Rayah\" (the banner) and in the printed version \"Al-Bara'\". \n2. In \"B\" \"Uthman\". \n3. Extracted by Ahmad in his Musnad \"4/ 295\", and Abu Dawud in his Sunan - Book of Hudud - \"4/ 602\", both from the path of Mutarrif bin Tarif from Abu Al-Jahm the freed slave of Al-Bara' from him... with it, and its chain is good. And extracted by Al-Tirmidhi in his Sunan - Book of Judgments - \"3/ 634\", and Al-Nasa'i in his Sunan \"6/ 109\", and Ibn Majah \"2/ 869\" all from the path of Adi bin Thabit from Al-Bara' who said: My maternal uncle passed by me so he mentioned. And extracted by Abu Dawud \"4/ 602\" from the path of Adi bin Thabit from Yazid bin Al-Bara' from his father who said: I met my uncle... so he mentioned it. Al-Tirmidhi said: And Muhammad bin Ishaq narrated this hadith from Adi bin Thabit from Abdullah bin Yazid from Al-Bara'... , end. He said: And in the chapter from Qurrah Al-Muzani. =",
    "book_id": "1"
  },
  {
    "serial_number": "54464",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 88,
    "volume_number": 1,
    "text": "If we were to trace the verses, hadiths, traces, and scholars' speech regarding fighting whoever says: 'There is no god but Allah' if he abandons some of its rights, the speech would be very long. So how about one who abandons (1) Islam entirely, denies it, and mocks it intentionally, except that they say: 'There is no god but Allah' like these Bedouins? In what we mentioned is sufficiency for whoever seeks",
    "foot_note": "1. = Al-Mundhiri, may Allah have mercy on him, said in his Mukhtasar Sunan Abi Dawud \"6/ 268\" regarding this hadith: There has been much disagreement regarding this. It was narrated from Al-Bara' as preceded. And narrated from him from his uncle as we also mentioned. And it was narrated from him saying: \"My maternal uncle Abu Burdah bin Dinar passed by me having a banner\" and this is Al-Tirmidhi's wording. And narrated from him from his maternal uncle and \"Hushaym named him in his hadith: Al-Harith bin Amr\" and this is Ibn Majah's wording. And narrated from him saying: People passed by us going.\" And narrated from him: \"I was observing camels I had in those neighborhoods during the time of the Messenger of Allah, peace and blessings be upon him, when a group came to them with a banner\" and this is in Al-Nasa'i's wording. End. Imam Shams al-Din Ibn al-Qayyim, may Allah have mercy on him, said: All this indicates that the hadith is preserved and this does not necessitate abandoning it in any way. For Al-Bara' bin Azib narrated it from Abu Burdah bin Dinar and his name is Al-Harith bin Amr. Abu Burdah: is his Kunya, and he is his paternal uncle and maternal uncle, and this happens in lineage. He had a group with him, so he limited to mentioning the group once, and identified Abu Burdah bin Dinar from among them by name once, by Kunya another time, by paternal uncle relation at times, and by maternal uncle relation at others. So what defect in this necessitates abandoning the hadith? And Allah is the Grantor of correctness. The hadith has good paths supporting each other. Among them: Mutarrif from Abu Al-Jahm from Al-Bara'. And among them: Shu'bah from Al-Rukin bin Al-Rabi' from Adi bin Thabit from Al-Bara'. And among them: Al-Hasan bin Salih from Al-Suddi from Adi from Al-Bara'. And among them: Ma'mar from Ash'ath from Adi from Yazid bin Al-Bara' from his father. End. \n1. In the printed version \"jahada\" (denied).",
    "book_id": "1"
  },
  {
    "serial_number": "54465",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 89,
    "volume_number": 1,
    "text": "fairness. We have mentioned the evidences from the speech of Allah, the speech of His Messenger, peace and blessings be upon him, the speech of the Companions, and the consensus of the scholars after them. If this which we mentioned has another meaning we did not understand, clarify it to us from the speech of Allah, the speech of His Messenger, and the speech of the scholars. May Allah have mercy on a person who looked after himself, and knew that he will meet Allah who possesses Paradise and Hell.",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54466",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 91,
    "volume_number": 1,
    "text": "The Third Issue which is: [As for the third issue, they said: Is building on graves permissible?]. We say: It is established in the Two Sahihs and the Sunan from the Messenger of Allah, peace and blessings be upon him, that he forbade building on graves and ordered demolishing it, as Muslim narrated in his Sahih where he said: Yahya bin Yahya told us, Waki' told us from Sufyan from Habib bin Abi Thabit from Abu Wa'il from Abu Al-Hayyaj Al-Asadi who said: Ali said to me: Shall I not send you on what the Messenger of Allah, peace and blessings be upon him, sent me on? That you do not leave an image without obliterating it, nor a raised grave without leveling it (1). He also said: Abu Bakr bin Abi Shaybah told us, he said: Hafs bin Ghiyath told us from Ibn Juraij from Abu Al-Zubayr from Jabir, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, forbade plastering the grave, building on it, and writing on it (2). He also said: Harun bin Sa'id Al-Ayli told us, he said: Wahb told us, he said Amr bin Al-Harith told me that Thumamah bin Shufayy told him, he said: We were with Fadalah bin Ubayd in the land of the Romans at Rhodes, and a companion of ours died. So Fadalah ordered regarding his grave and it was leveled, then he said: I heard the Messenger of Allah, peace and blessings be upon him, ordering their leveling (3).",
    "foot_note": "1. Thus the Sheikh quoted Muslim's chain. Muslim has more than one Sheikh in this hadith. He, may Allah have mercy on him, said: Yahya bin Yahya, Abu Bakr bin Abi Shaybah, and Zuhair bin Harb told us. Yahya said informed us. And the other two said: Waki' told us... so he mentioned it \"2/ 666\". \n2. What is in Sahih Muslim \"2/ 667\" is: and sitting on it, instead of writing on it. \n3. Thus the author quoted Muslim's chain. Muslim has several Sheikhs in this hadith. He said =",
    "book_id": "1"
  },
  {
    "serial_number": "54467",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 92,
    "volume_number": 1,
    "text": "Al-Tirmidhi said: \"Chapter on what came regarding leveling graves\". Muhammad bin Bashar told us, Abdul Rahman bin Mahdi told us, Sufyan told us from Habib bin Abi Thabit from Abu (1) Wa'il that Ali, may Allah be pleased with him, said to Abu Al-Hayyaj Al-Asadi: Shall I not send you on what the Messenger of Allah, peace and blessings be upon him, sent me on? That you do not leave a raised grave without leveling it, nor an image without obliterating it. He said: And in the chapter from Jabir. And Ibn Majah said in \"Chapter on what came regarding the prohibition of building on graves, plastering them and writing on them\": Azhar bin Marwan and Muhammad bin Ziyad told us, Abdul Warith told us from Ayyub from Abu Al-Zubayr from Jabir who said: The Messenger of Allah, peace and blessings be upon him, forbade plastering graves (2). And Abdullah bin Sa'id told us, Hafs bin Ghiyath told us from Ibn Juraij from Sulaiman bin Musa from Jabir who said: The Messenger of Allah, peace and blessings be upon him, forbade writing anything on the grave. And Muhammad bin Yahya told us, Muhammad bin Abdullah Al-Raqashi told us, Wahb told us, Abdul Rahman bin Yazid told us from Al-Qasim bin Mukhaimarah from Abu Sa'id that the Prophet, peace and blessings be upon him, forbade building on graves (3).",
    "foot_note": "1. = may Allah have mercy on him: Abu Al-Tahir Ahmad bin Umar told us, and Ibn Wahb told us, Amr bin Al-Harith informed me H and Harun bin Sa'id Al-Ayli told me, Ibn Wahb told us, Amr bin Al-Harith told me \"in Abu Al-Tahir's narration\" that Abu Ali Al-Hamdani told him \"and in Harun's narration\" that Thumamah bin Shufayy told him, he said: We were with Fadalah... so he mentioned it. And his saying \"Rhodes\", Al-Nawawi said: Thus we accurately recorded it in Sahih Muslim and likewise Al-Qadi Iyad transmitted it in Al-Mashariq from the majority. It is an island in the land of the Romans. \n1. In \"A\" \"from Wa'il\" which is an error. \n2. A distortion occurred in the copies in Ibn Majah's chain so we corrected it from the Sunan. \n3. See Sunan Ibn Majah \"1/ 498\". And the graduation of the hadiths of this issue will come in the upcoming treatises, if Allah wills.",
    "book_id": "1"
  },
  {
    "serial_number": "54468",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 93,
    "volume_number": 1,
    "text": "Al-Nawawi, may Allah have mercy on him, said in Sharh Muslim: Al-Shafi'i, may Allah have mercy on him, said in Al-Umm: \"I saw the Imams in Mecca ordering the demolition of what is built, and the demolition is supported by his saying: nor a raised grave without leveling it.\" Al-Adhra'i, may Allah have mercy on him, said in \"Qut al-Muhtaj\": The prohibition of plastering and building is established in Sahih Muslim. And in Al-Tirmidhi and others: The prohibition of writing. Judge Ibn Kajj said: It is not permissible to build domes or other things on them, and the will for them is invalid. Al-Adhra'i said: It is not far-fetched to assert prohibition in his property and others without need for one who knows the prohibition, rather it is the true analogy. The reason for building on graves is boasting and imitating tyrants and disbelievers, and prohibition is established without that. As for the invalidity of the will to build domes and other great structures, and spending much money on it, there is no doubt in its prohibition. And the wonder of all wonders is whoever obliges the heirs with that from the rulers of the age, and acts upon the will for that! End of Al-Adhra'i's speech, may Allah have mercy on him. Whoever combines the Sunnah of the Messenger of Allah, peace and blessings be upon him, regarding graves, what he ordered, what he forbade, and what his companions were upon, and between what you are upon of your action with the grave of Abu Talib, Al-Mahjoub and others, will find one of them opposing the other, contradicting it such that they never meet. The Messenger of Allah, peace and blessings be upon him, forbade building on graves as previously mentioned, and you build great domes on them, and what I saw in Al-Ma'lah is more than twenty domes. And the Messenger of Allah, peace and blessings be upon him, forbade adding to it other than its soil, and you add to it other than soil the coffin which is upon it and the cloth covering, and above that the great dome built with stones and gypsum. Abu Dawud narrated from the hadith of Jabir: That the Messenger of Allah, peace and blessings be upon him, forbade plastering the grave, writing on it, or adding to it.",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54469",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 94,
    "volume_number": 1,
    "text": "And the Messenger of Allah, peace and blessings be upon him, forbade writing on them as preceded in Sahih Muslim. Abu Isa Al-Tirmidhi said \"Chapter on what came regarding plastering graves and writing on them\": Abdul Rahman bin Al-Aswad told us, Muhammad bin Rabi'ah told us from Ibn Juraij (1) from Abu Al-Zubayr from Jabir who said: \"The Messenger of Allah, peace and blessings be upon him, forbade plastering graves, writing on them, building on them, and treading on them\" this is a Hasan Sahih hadith. And these graves with you have Quran and poetry written on them. Abu Dawud said \"Chapter on building on graves\". Ahmad bin Hanbal told us, Abdul Razzaq told us, he said Ibn Juraij (2) informed me, Abu Al-Zubayr told me that he heard Jabir saying: I heard the Prophet, peace and blessings be upon him, forbid sitting on the grave, plastering it, and building on it. End. And the Messenger of Allah, peace and blessings be upon him, cursed whoever lit lamps on them. And what I saw the night of our entry to Mecca - may Allah honor it - in the graveyard was more than a hundred lanterns. This is with your knowledge that the Messenger of Allah, peace and blessings be upon him, cursed the doer of it. Ibn Abbas narrated that the Messenger of Allah, peace and blessings be upon him: Cursed the women who visit graves, and those who take mosques and lamps over them. Narrated by the authors of the Sunan. And greater than all this and more severely prohibited is the major Shirk done at them which is calling upon the buried and asking them for fulfillment of needs, and relief of distresses. But you say to us: This is not done at them and we have no one",
    "foot_note": "1. In \"A\" and \"B\" \"Juraij\" which is an error. \n2. In \"A\" and \"B\" \"Juraij\" which is an error.",
    "book_id": "1"
  },
  {
    "serial_number": "54470",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 95,
    "volume_number": 1,
    "text": "who calls upon them and asks them. We say: O Allah, make what they mentioned true and truthful, and we ask Allah to purify His Sanctuary from Shirk. There is no doubt that calling upon the dead and asking them to bring benefits, and remove hardships is major Shirk by which Allah declared the polytheists disbelievers as previously explained in the first issue. The Almighty said: {And [He revealed] that the masjids are for Allah, so do not invoke with Allah anyone} [Al-Jinn - 18]. And the Almighty said: {Say, \"Invoke those you have claimed [as gods] besides Him, for they do not possess the [ability for] removal of adversity from you or [for its] transfer\"} [Al-Isra - 56]. And the Almighty said: {And do not invoke besides Allah that which neither benefits you nor harms you, for if you did, then indeed you would be of the wrongdoers} [Yunus - 106] (1). And the Almighty said: {And those whom you invoke other than Him do not possess [as much as] the membrane of a date seed. If you invoke them, they do not hear your supplication; and if they heard, they would not respond to you. And on the Day of Resurrection they will deny your association and not...} The verse [Fatir - 13]. And the Almighty said: {And who is more astray than he who invokes besides Allah those who will not respond to him until the Day of Resurrection, and they, of their invocation, are unaware. And when the people are gathered, they will be enemies to them and be deniers of their worship} [Al-Ahqaf - 5-6]. And the Almighty said: {To Him is the supplication of truth. And those they call upon besides Him do not respond to them with a thing, except as one who stretches his hands toward water [from afar, calling it] to reach his mouth, but it will not reach it [thus]. And the supplication of the disbelievers is not but in error [i.e. futility]} [Ar-Ra'd - 14]. Al-Tirmidhi narrated from Anas that the Messenger of Allah, peace and blessings be upon him, said: \"Supplication is the marrow of worship\" (2). And from Al-Nu'man bin Bashir who said: The Messenger of Allah, peace and blessings be upon him, said: \"Supplication is worship\" then the Messenger of Allah, peace and blessings be upon him, recited: {And your Lord says, \"Call upon Me; I will respond to you.\" Indeed, those who disdain My worship will enter Hell [rendered] contemptible} [Ghafir - 60]. Narrated by Ahmad, Abu Dawud and Al-Tirmidhi.",
    "foot_note": "1. This verse is missing from \"A\" \"B\". \n2. Discussion on it preceded.",
    "book_id": "1"
  },
  {
    "serial_number": "54471",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 96,
    "volume_number": 1,
    "text": "Al-Alqami said in Sharh Al-Jami' Al-Saghir, hadith \"Supplication is the marrow of worship\", our Sheikh said: It was said in Al-Nihayah: The marrow of a thing is its purest part. It was the marrow for two reasons: One is that it is compliance with Allah's command where He said: \"Call upon Me; I will respond to you,\" so it is pure worship and its essence. The second: That if he sees success of matters from Allah Almighty, he cuts off his hope from other than Him and calls upon Him for his need alone, and this is the origin of worship. And because the purpose of worship is reward for it, and this is what is sought from supplication. And his saying: \"Supplication is worship\", our Sheikh said: Al-Tibi (1) said: He brought the predicate defined with Lam (Al) to indicate restriction, and that worship is nothing but supplication. Our Sheikh said: Al-Baydawi said: When he judged that supplication is the true worship that deserves to be called worship in the sense that it indicates that its doer is turning to Allah, turning away from other than Him, not hoping except in Him and not fearing except Him. And he used the verse as evidence, meaning His saying: {And your Lord says, \"Call upon Me; I will respond to you\"} [Ghafir - 60] for it indicates that it is a commanded matter, if the responsible person performs it, it is accepted from him inevitably, and the intended result follows it as the reward follows the condition, and the effect follows the cause, and whatever is like that is the most complete worship. End of Al-Alqami's speech, may Allah have mercy on him. Let this be the last speech on these three issues. If you agree with us that this is the truth, then that is what is sought. And if you claim that the truth is contrary to it, then answer us with knowledge from the Book and the Sunnah, for they are the judges between people in what they differed in, as the Almighty said: {And if you disagree over anything, refer it to Allah and the Messenger}. [An-Nisa - 59]. We have mentioned to you the evidences from the Book, the Sunnah, and the speech of the Imams. If you do not submit to these evidences, then mention to us their answer from the Book, the Sunnah, and the speech",
    "foot_note": "1. In the printed version Al-Tayalisi.",
    "book_id": "1"
  },
  {
    "serial_number": "54472",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 97,
    "volume_number": 1,
    "text": "of the Imams. If you answer these three issues, we will answer you about the rest of the issues, if Allah wills. And let us conclude the speech with His saying: {And were it not that Allah checks the people, some by means of others, there would have been demolished monasteries, churches, synagogues, and mosques in which the name of Allah is much mentioned. And Allah will surely support those who support Him. Indeed, Allah is Powerful and Exalted in Might. [And they are] those who, if We give them power in the land, establish prayer and give zakah and enjoin what is right and forbid what is wrong. And to Allah belongs the outcome of [all] matters} [Al-Hajj - 40 - 41]. And praise be to Allah first and last as our Lord loves and is pleased, and may Allah bless our master Muhammad and his family and companions and grant them peace abundantly, and praise be to Allah, Lord of the Worlds.",
    "foot_note": "1. Its verifier, may Allah pardon him, said: What I wanted to comment on this precious treatise was completed before the Asr prayer of the twenty-eighth day of the month of Allah Muharram, year seven and four hundred after one thousand (1407 AH), and praise be to Allah by whose grace good deeds are completed. And may Allah bless and grant peace to our Prophet Muhammad.",
    "book_id": "1"
  },
  {
    "serial_number": "54473",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 98,
    "volume_number": 1,
    "text": "\"The Most Important References According to Their Appearance in the Book\" Note: The references from which I derived information in the first treatise and which are among my references in this treatise, I do not mention in this index, sufficing with my mentioning of them in the first treatise, and so on in all upcoming books of this series, if Allah wills. 1 - Talkhis Al-Radd 'ala Al-Bakri, by Sheikh al-Islam Ibn Taymiyyah, Salafiyya Ed. in Egypt 1346 AH. 2 - Rawdat Al-Afkar wal-Afham, by Ibn Ghannam, Al-Maktabah Al-Salafiyyah Ed. in Riyadh. 3 - Ulama' Najd, by Sheikh Ibn Bassam, Al-Nahdah Library Ed. in Mecca 1398 AH. 4 - Al-Durar Al-Saniyyah, by Sheikh Ibn Qasim, Al-Noor Ed. 5 - Ighathat Al-Lahfan, by Ibn Al-Qayyim, Dar Al-Ma'rifah Ed. in Beirut. 6 - Dar' Ta'arud Al-Naql wal-Aql, by Sheikh al-Islam, Imam Muhammad bin Saud University Ed. 1401 AH. 7 - Ma'rifat Al-Qurra' Al-Kibar, by Al-Dhahabi. 8 - Al-Insaf, by Al-Mardawi, Ansar Al-Sunnah Ed. 1377 AH. 9 - Hashiyat Al-Rawd Al-Murbi', by the scholar Ibn Qasim, Al-Ahliyyah Ed. 1399 AH.",
    "foot_note": "None",
    "book_id": "1"
  },
  {
    "serial_number": "54474",
    "category_id": "1",
    "category": "Doctrine",
    "book_title": "Al-Fawakeh Al-Adhab in Response to Those Who Did Not Judge by the Sunnah and the Book",
    "edition": "First, 1407 AH",
    "publisher": "Dar Al-Asimah",
    "page_number": 99,
    "volume_number": 1,
    "text": "10 - Mukhtasar Sunan Abi Dawud, by Al-Mundhiri with Tahdhib Ibn Al-Qayyim, Ansar Al-Sunnah Ed. 1368 AH.",
    "foot_note": "None",
    "book_id": "1"
  }
]