[
  {
    "text": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding\nAuthor: فهد عبد الله علي الختلان\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 1
  },
  {
    "text": "sn: 4901\nbook_title: الأحاديث والآثار الواردة في نكاح المتعة دراية ورواية\nbook_link: https://shamela.ws/book/980\nbook_id: 980\nauthor_name: فهد عبد الله علي الختلان\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/1248\nauthor_ID: 1248\neditor: إشراف: عبد المحسن بن زبن المطيري\npublisher: Null\nedition: العام الجامعي: 2018 م\npages: 93\nvolumes: Null\npagination: [كتاب إلكتروني بترقيم الشاملة]\ncategory: مسائل فقهية\ncategory_id: 19",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 2
  },
  {
    "serial_number": "4588910",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Jurisprudential Issues\nBook: Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding (Al-Ahadith wa Al-Athar Al-Waridah fi Nikah Al-Mut'ah Dirayatan wa Riwayatan)\nThesis: Master's, Kuwait University - College of Graduate Studies - Hadith and its Sciences Program\nPrepared by: Fahd Abdullah Ali Al-Khatlan\nSupervision: Abdul Muhsin bin Zabin Al-Mutairi\nAcademic Year: 2018 AD\n\nBook: Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding\nThesis: Master's, Kuwait University - College of Graduate Studies - Hadith and its Sciences Program\nPrepared by: Fahd Abdullah Ali Al-Khatlan\nSupervision: Abdul Muhsin bin Zabin Al-Mutairi\nAcademic Year: 2018 AD\n\nThesis: Master's, Kuwait University - College of Graduate Studies - Hadith and its Sciences Program\nPrepared by: Fahd Abdullah Ali Al-Khatlan\nSupervision: Abdul Muhsin bin Zabin Al-Mutairi\nAcademic Year: 2018 AD\n\nPrepared by: Fahd Abdullah Ali Al-Khatlan\nSupervision: Abdul Muhsin bin Zabin Al-Mutairi\nAcademic Year: 2018 AD\n\nSupervision: Abdul Muhsin bin Zabin Al-Mutairi\nAcademic Year: 2018 AD\n\nAcademic Year: 2018 AD\n\n\n[Electronic book with Shamela numbering]",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 3
  },
  {
    "serial_number": "4588911",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Kuwait University\nHadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding\nSubmitted by Student: Fahd Abdullah Ali Al-Khatlan\nA thesis submitted to the College of Graduate Studies in partial fulfillment of the requirements for the Master's degree in: The Program of Hadith and its Sciences\nSupervised by Dr. Abdul Muhsin bin Zabin Al-Mutairi\nKuwait - February / 2018",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 4
  },
  {
    "serial_number": "4588912",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "Kuwait University - College of Graduate Studies\nThe undersigned certify that they have reviewed and approved for the College of Graduate Studies the Master's thesis titled:\nHadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding\nIn the Sciences of the Noble Hadith\nSubmitted by Student: Fahd Abdullah Ali Al-Khatlan, in partial fulfillment of the graduation requirements for the Master's degree in the Program of Hadith and its Sciences.\nProf. Dr. Hakim Ubaysan Al-Mutairi - Professor ... (Committee Chair)\nDr. Abdul Muhsin bin Zabin Al-Mutairi - Assistant Professor (Supervisor)\nProf. Dr. Mubarak Saif Al-Hajri - Professor ... (Examiner)",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 5
  },
  {
    "serial_number": "4588913",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "Abstract\nThe goal of this work and effort is to protect the religion of Islam from alteration and distortion and from those who attack the religion, because undoubtedly, every call has supporters and opponents. Therefore, I have collected the traditions (Athar) and Hadiths related to Mut'ah marriage - temporary marriage - and studied them through narration (Riwayah) and understanding (Dirayah), clarifying the preponderant ruling, and mentioning the most significant negative effects and consequences resulting from the permissibility of Mut'ah marriage.\nThe research was divided into three chapters.\nChapter One: The ruling on Mut'ah in Sharia, containing three sections:\na) The history of the permissibility and prohibition of Mut'ah in the Prophetic Sunnah.\nb) The Hadiths and Athar reported regarding the prohibition of Mut'ah with a statement of their status regarding acceptance and rejection.\nc) The ruling on Mut'ah according to Sunni jurists.\nChapter Two: The ruling on Mut'ah marriage according to the Shi'a, containing three sections:\na) Mentioning the Hadiths they used as evidence for the permissibility of Mut'ah marriage with a statement of their status regarding acceptance and rejection, containing two subsections: First: Discussing the evidences through understanding and narration. Second: Doubts raised about the permissibility of Mut'ah marriage and the answers to them.\nb) Mentioning Hadiths prohibiting Mut'ah marriage from Shi'a books and sources.\nc) Texts from Shi'a scholars who prohibited Mut'ah marriage.\nChapter Three: The corruptions and effects resulting from the permissibility of Mut'ah marriage, containing three sections:\na) Social effects.\nb) Psychological effects.\nc) Health effects.\nI have not found a book authored on this exact subject, as far as I know, that combined the science of narration and understanding by mentioning the Hadiths and Athar and then what results from permitting it in terms of corruptions and harms to individuals and societies.",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 6
  },
  {
    "serial_number": "4588914",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Acknowledgments\nPraise be to Allah, abundant, good, and blessed praise. We thank Him, Glory be to Him, for His apparent and hidden blessings, and for granting me success and facilitating for me the writing of this thesis titled: (Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding). This is a great honor that Allah bestowed upon me due to the scientific benefits in various Sharia and linguistic sciences that I gained during the study and writing; so to You, O Allah, belongs praise and thanks.\nI extend my thanks to my mother - who has passed away, may Allah have mercy on her - for her care and attention to me.\nAnd to my colleagues and friends who participated in choosing my topic.\nAnd to the College of Graduate Studies and the Director of the Master's Program in Hadith Sciences, may Allah reward them with good.\nAnd to my professor, His Eminence Dr. Abdul Muhsin Zabin Al-Mutairi, for his guidance, care, patience, and alerting me during the writing of the thesis and guiding me to what is correct.\nI also thank their Eminences, the professors participating in the discussion of the thesis; may Allah reward them with the best reward and benefit others through them.\nAnd I do not forget the rest of our sheikhs and teachers for their benefit and guidance. And praise be to Allah, Lord of the Worlds.",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 7
  },
  {
    "serial_number": "4588915",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "Introduction\nIndeed, all praise is due to Allah. We praise Him, seek His help, and ask for His forgiveness. We seek refuge in Allah from the evils of our own souls and from our bad deeds. Whomever Allah guides, none can misguide, and whomever He leaves astray, none can guide. I bear witness that there is no god but Allah alone, without partner, and I bear witness that Muhammad is His slave and Messenger.\nTo proceed..\n{O you who have believed, fear Allah as He should be feared and do not die except as Muslims [in submission to Him].} [Al Imran: Verse 102]\n{O mankind, fear your Lord, who created you from one soul and created from it its mate and dispersed from both of them many men and women. And fear Allah, through whom you ask one another, and the wombs. Indeed Allah is ever, over you, an Observer.} [An-Nisa: Verse 1]\n{O you who have believed, fear Allah and speak words of appropriate justice. (70) He will [then] amend for you your deeds and forgive you your sins. And whoever obeys Allah and His Messenger has certainly attained a great attainment.} [Al-Ahzab: Verses 70-71]\nIndeed, the best speech is the Book of Allah, and the best guidance is the guidance of Muhammad, peace and blessings be upon him. The worst of matters are newly invented ones, and every newly invented matter is an innovation, and every innovation is misguidance, and every misguidance is in the Fire.\nThen to proceed:\nUndoubtedly, every owner of a call has supporters and opponents. Among them are those who believe in the Revealed Book, saying \"We believe in it; all is from our Lord\"; so he believes in the clear verses (Muhkam), the ambiguous ones (Mutashabih), the abrogating (Nasikh), and the abrogated (Mansukh). And among them are those who follow what is ambiguous of the evidences and texts, seeking discord and seeking an interpretation other than the truth, as He, Glory be to Him and Exalted, said: {It is He who has sent down to you the Book; in it are verses [that are] precise - they are the foundation of the Book - and others unspecific. As for those in whose hearts is deviation [from truth], they will follow that of it which is unspecific, seeking discord and seeking an interpretation [suitable to them]. And no one knows its [true] interpretation except Allah. But those firm in knowledge say, \"We believe in it. All [of it] is from our Lord.\" And no one will be reminded except those of understanding.} [Al Imran: Verse 7].",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 8
  },
  {
    "serial_number": "4588916",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "And upon him be peace and blessings, he said when asked about this verse: \"If you see those who follow what is unspecific of it, then those are the ones whom Allah has named, so beware of them.\" (1).\nIf we reflect on the state of people today, talk has increased regarding the subject of Mut'ah marriage in terms of permissibility and impermissibility, and that returns to the cause of conflict between evidences and texts that permit Mut'ah marriage and prohibit it.",
    "foot_note": "1. Narrated by Al-Bukhari in his Sahih, Book of Quran Commentary, Chapter (In it are verses [that are] precise) Al Imran: 7 (6/33), and narrated by Muslim, Book of Knowledge, Chapter: Prohibition of following the ambiguous parts of the Quran, warning against those who follow them, and prohibition of disputing about the Quran (4/3053).",
    "book_id": "980",
    "new_page_number": 9
  },
  {
    "serial_number": "4588917",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Reason for choosing the topic:\nWhen talk about the permissibility of Mut'ah marriage (temporary marriage) became widespread and frequent in some Muslim societies, reaching the point where there is organization and arrangement through publishing photos of women desiring Mut'ah marriage with a contract dowry for a specified term, this topic attracted me. Especially since I did not find a book or author, as far as I know, who combined the science of narration (Riwayah) and understanding (Dirayah) regarding the ruling of Mut'ah marriage while mentioning the corruptions and effects resulting from its permissibility.\nGiven that my specialization is in the Department of Hadith, I chose the topic of my Master's thesis to be the collection of narratives from news and traditions related to Mut'ah marriage and verifying them along with the jurisprudence of Sunan and Athar, mentioning the evidences of the Shi'a who permit it, discussing them, and citing the sayings of scholars regarding that.\nThe importance of the research is clarified in the following:\n1 - It addresses a dangerous social problem where the feet of some who claim jurisprudence have slipped, as they permitted what Allah Almighty and His Messenger, peace and blessings be upon him, prohibited of Mut'ah marriage, thus taking a path other than that of the people of verification.\n2 - Also among the importance of this topic is that it is a defense of the religion of Islam sent down from the Wise, the Praiseworthy, which falsehood cannot approach from before it or from behind it. It is inappropriate to attribute the permissibility of Mut'ah marriage to the Sharia after the matter was abrogated in the time of the Prophet, peace and blessings be upon him, while Allah Almighty says: {This day I have perfected for you your religion and completed My favor upon you and have approved for you Islam as religion.} [Al-Ma'idah: 3].\n3 - Also, regarding this topic, when the reader becomes clear on the correct preponderant ruling of Mut'ah marriage, a certain knowledge arises in him that there is no contradiction or conflict in the religion of Allah.\n4 - Among the importance of this topic is appreciating the stance of the Companions, may Allah be pleased with them, clarifying their virtue, defending them, and not attacking some of the Companions whom the Quran praised and the Most Merciful declared just, and may Allah be pleased with them all.",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 10
  },
  {
    "serial_number": "4588918",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "5 - Among the importance of this topic is refuting some of those who attack the Companions, may Allah be pleased with them, due to their disagreement on the prohibition of Mut'ah marriage.\nAnd Allah is behind the intent; He is my sufficiency and in Him I seek help.",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 11
  },
  {
    "serial_number": "4588919",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "My Methodology in the Research:\n1 - I committed to referring to the Six Books along with Muwatta of Imam Malik, Musnad of Imam Ahmad, and Sunan Al-Darimi. I limited myself to them in mentioning the Hadiths raised (Marfu') to the Prophet, peace and blessings be upon him, only. As for the traditions (Athar) narrated from the Companions, may Allah be pleased with them, or the Successors, I mention what I found in some books of Musannafat, Sunan, and Muwatta of Imam Malik, may Allah have mercy on him.\n2 - I extracted the Hadiths raised to the Prophet, peace and blessings be upon him, from the Six Books and then judged them, except for the Two Sahihs. As for the traditions narrated from the Companions and Successors, I sufficed with mentioning the author of the tradition along with its source.\n3 - I relied on explanations of the Hadiths mostly from the book Fath Al-Bari in explaining Sahih Al-Bukhari, and the explanation of Muslim by Imam Al-Nawawi, may Allah have mercy on both of them.\n4 - I committed to referring to books related to the approved Hadiths of the Shi'a, such as Al-Kafi by Al-Kulayni, Al-Istibsar and Tahdhib Al-Ahkam by Al-Tusi, and Wasa'il Al-Shi'a by Al-Hurr Al-Amili mostly, and other books specific to the Shi'a as well.\n5 - I also committed not to attribute anything to the Shi'a or to the Sunnis unless I found it truthfully attributed to them, trying to reveal the facts in this subject without fanaticism for a specific opinion or imitation far from the truth.\n6 - Finally, I provided biographies for some notable figures I came across as needed by the research, such as biographies of some Shi'a scholars and authors. As for the biography of every scholar, this might distract the reader from the main topic, so their place is in books of history and biographies.",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 12
  },
  {
    "serial_number": "4588920",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "The Research Plan came as follows:\nI divided the thesis into an introduction, a preamble, three chapters, a conclusion, and scientific indices.\nIn the Preamble, I explained the title of the thesis and then divided it into the following sections:\nSection One: Definition of Mut'ah marriage linguistically and terminologically.\nSection Two: Terms of Mut'ah in Sharia.\nSection Three: The reality of Mut'ah marriage and its conditions according to the Shi'a.\nSection Four: On the objectives of Islam in legislating marriage.\n\nAs for Chapter One: The Ruling on Mut'ah in Sharia, I divided it into three sections:\nSection One: The history of the permissibility of Mut'ah marriage and its prohibition in the Prophetic Sunnah.\nSection Two: Hadiths and Athar reported regarding the prohibition of Mut'ah marriage with a statement of their status regarding acceptance and rejection.\nSection Three: The ruling on Mut'ah according to Sunni jurists.\n\nAs for Chapter Two: The Ruling on Mut'ah Marriage according to the Shi'a, I divided it into three sections:\nSection One: Mentioning the Hadiths they used as evidence for the permissibility of Mut'ah marriage, containing two subsections:\nFirst: Discussing the evidences through understanding and narration.\nSecond: Answering doubts regarding the Hadiths of Mut'ah of Hajj.\nSection Two: Mentioning Hadiths that prohibit Mut'ah marriage from Shi'a books and sources.\nSection Three: Texts from Shi'a scholars who prohibited Mut'ah marriage.\n\nAs for Chapter Three: The Corruptions and Effects Resulting from the Permissibility of Mut'ah Marriage, I divided it into three sections:\nSection One: Social effects.",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 13
  },
  {
    "serial_number": "4588921",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "Section Two: Psychological effects.\nSection Three: Health effects.\nWhat is new in this thesis is that I combined in it the science of narration and the science of understanding regarding the ruling of Mut'ah marriage, in addition to mentioning academic field studies involving personal interviews with those who permit and practice Mut'ah marriage, both women and men, and the effects and corruptions resulting from that.\nDuring the writing of my research, I faced the problem of the unavailability of all Shi'a books and sources in a nearby place.\nI praise Allah, Blessed and Exalted, for the apparent and hidden blessings He has bestowed upon us, and I thank Him, Mighty and Majestic, for His success and aid. In conclusion to this introduction, I extend my thanks and praise to the supervisor of the thesis, His Eminence Dr. Abdul Muhsin bin Zabin Al-Mutairi - may Allah protect him - for the advice and guidance he offered me regarding the thesis plan, and also His Eminence Dr. Othman bin Muhammad Al-Khamis - may Allah protect him - for what he showed me by mentioning some topics and sections regarding the writing of my thesis. I do not forget the merit of the researchers and workers in the Mabarrah Al-Al wa Al-Ashab, after the grace of Allah Almighty, for helping me in providing some books, sources, and references for the Shi'a sect and undertaking copying and providing them. All of that is by the decree and facilitation of Allah Almighty, and praise be to Allah, Lord of the Worlds.",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 14
  },
  {
    "serial_number": "4588922",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "Preamble\nIt includes four sections:\nSection One: Definition of Mut'ah marriage\nSection Two: Terms of Mut'ah in Sharia\nSection Three: The reality of Mut'ah marriage and its conditions according to the Shi'a\nSection Four: Objectives of Islam in legislating marriage",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 15
  },
  {
    "serial_number": "4588923",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "Explanation of the Thesis Title\n[Hadiths and Athar Reported Regarding Temporary Marriage: Narration and Understanding]\n1 - Al-Ahadith (Hadiths): Plural of Hadith, which linguistically means: opposite of old. Terminologically: What is attributed to the Prophet, peace and blessings be upon him, of speech, action, approval, or description, even movements and rests in wakefulness and sleep; it is more general than Sunnah (1).\n2 - Al-Athar (Traditions): Plural of Athar. Linguistically: The remnant. Terminologically: Hadiths, whether raised (Marfu') or suspended (Mawquf) (2).\n3 - Al-Nikah (Marriage): Linguistically: The verbal noun of Nakaha. It is said 'Nakaha yankihu' the man and the woman 'Nikahan': from the pattern of 'daraba'. Ibn Faris and others said: It applies to intercourse and to the contract without intercourse. It is said: The woman was married (nukihat): she got married.\nTerminologically: Jurists differed in defining Nikah.\nThe Hanafis said: Nikah is a contract that signifies ownership of enjoyment (Mut'ah) with a female intentionally; meaning it signifies the lawfulness of a man's enjoyment of a woman whose marriage is not prevented by a legal impediment (3).\nThe Malikis said: Nikah is a contract for the lawfulness of enjoying a female who is not prohibited, a Magian, or a slave, by a formula (4).",
    "foot_note": "1. Fath Al-Mughith bi Sharh Alfiyyat Al-Hadith by Al-Sakhawi (1/23).\n2. Sharh Nukhbat Al-Fikr by Al-Qari, p. 148.\n3. Al-Durr Al-Mukhtar wa Radd Al-Muhtar (2/258-260), Dar Ihya Al-Turath Al-Arabi, and Fath Al-Qadir (3/99), Dar Ihya Al-Turath Al-Arabi.\n4. Al-Sharh Al-Saghir wa Hashiyat Al-Sawi (2/332-334), Dar Al-Ma'arif / Cairo.",
    "book_id": "980",
    "new_page_number": 16
  },
  {
    "serial_number": "4588924",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "The Shafi'is said: Nikah is a contract that includes the permissibility of intercourse using the word Nikah (marriage) or Tazwij (wedding) or its translation (1).\nThe Hanbalis said: Nikah is the contract of marriage, i.e., a contract in which the word Nikah or Tazwij or its translation is considered (2).\n4 - Al-Riwayah (Narration): Linguistically: Carrying and transporting, or watering and quenching with water. In the terminology of Hadith scholars: It is the transmission of the Hadith and attributing it to whom it is ascribed using one of the formulas of performance, such as 'Haddathana' (told us), 'Akhbarana' (informed us), 'Sami'tu' (I heard), 'An' (from), and the like (3).\n5 - Al-Dirayah (Understanding): Linguistically Dirayah is singular: verbal noun: Dara; knowledge and knowing a thing with diligence and cunning: He has Dirayah of the arts of speech: aware of them (4).\nTerminologically: A science in which the conditions of the narrator and the narrated are examined in terms of acceptance and rejection (5).",
    "foot_note": "1. Mughni Al-Muhtaj (3/123), Hashiyat Al-Ramli 'ala Shuruh Rawd Al-Talib (3/98), Nihayat Al-Muhtaj (6/174), and Al-Qalyubi (3/206).\n2. The Kuwaiti Fiqh Encyclopedia (41/25).\n3. Al-Wasit fi Ulum Mustalah Al-Hadith by Abu Shahba, p. 39.\n4. Mu'jam Al-Lughah Al-Arabiyah Al-Mu'asirah by Dr. Ahmed Mukhtar 1/743.\n5. Sharh Al-Manzumah Al-Bayquniyyah fi Mustalah Al-Hadith by Sheikh Muhammad bin Saleh Al-Uthaymeen, p. 12, Sheikh Muhammad bin Saleh Al-Uthaymeen Charitable Foundation - Dar Al-Riba for Publishing - Third Edition 1424 AH - 2004 AD.",
    "book_id": "980",
    "new_page_number": 17
  },
  {
    "serial_number": "4588925",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "Section One\nDefinition of Mut'ah Marriage\nDefinition of Mut'ah marriage linguistically and terminologically\n\nA - Mut'ah marriage linguistically:\nIbn Faris said: The Meem, Ta, and Ain are a sound root indicating benefit and extension of a period in goodness. From it is 'istamta'tu' (I enjoyed/benefited) from the thing. Mut'ah and Mata' mean benefit, as in the Almighty's saying: {uninhabited houses in which there is benefit [mata'] for you} [An-Nur: Verse 29]. The divorced woman is given Mut'ah (provision) with something because she benefits from it. It is said 'amta'tu' with my wealth, meaning I benefitted/enjoyed. He said:\nTwo partners from two tribes until they passed... a long time, and separation was better/extended (amta'a).\nAl-Asma'i narrated it: \"Bi-tafarruqi\" (with separation). He says: The enjoyment of one of them for his companion was nothing but separation.\nThey say: If you buy this servant boy, you will surely benefit from him as a good servant.\nThey say: A 'mati'' rope: good, meaning the duration extends with it.\nThey say: The day 'mata'a': became long. And the plant 'mata'a' mutuan.\nThe people of verification held that the origin in this chapter is pleasure (Taladh-dhudh). The day 'mata'a' because one enjoys its light. And 'mutti'a' the dust is likened to the enjoyment of the day. And 'Mata'' is benefiting from what has immediate pleasure.\nOthers held that the origin is extension and elevation, and 'Mata'' is benefit with extended time. A 'mati'' drink: red, meaning it is enjoyed due to its quality (1).\nAl-Azhari said: 'Muta'' is the plural of Mut'ah. Al-Layth said: Some of them say 'Mit'ah', and its plural is 'Mita''. Amr narrated from his father that he said: Mut'ah is a little provision, and its plural is Muta'.",
    "foot_note": "1. Mu'jam Maqayis Al-Lughah by Ibn Faris (5/293).",
    "book_id": "980",
    "new_page_number": 18
  },
  {
    "serial_number": "4588926",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "I said: Likewise is the saying of Allah Almighty, the Mighty and Majestic, regarding right guidance {And he who believed said, \"O my people, follow me, I will guide you to the way of right conduct (38) O my people, this worldly life is only [temporary] enjoyment, and indeed, the Hereafter - that is the home of [permanent] settlement} [Ghafir: 38-39], meaning: a sufficiency one reaches with, having no permanence. He said: There is no one who separates from his companion but that he provides him (amta'ahu) with something to remember him by, and what each of these two provided the other was that he separated from him.\nAnd the saying of Allah Almighty {so you enjoyed your portion} [At-Tawbah: 69], Al-Farra' said: 'Istamta'u' says: they were content with their share of this world instead of their shares in the Hereafter, and you did as they did. Al-Zajjaj said something similar. Others said: It means: You enjoyed your share of the Hereafter in this world. Al-Mazini recited this verse:\nAnd from us on the morning of terror are youths of courage... If the fingers are extended (umti'at) after the palms (1).\n\nB - Mut'ah marriage terminologically according to Sunni Jurists:\nAl-Qurtubi - may Allah Almighty have mercy on him - said about Mut'ah marriage: It is \"that a man marries a woman with two witnesses, and the permission of the guardian, for a specified term, and on the condition that there is no inheritance between them, and he gives her what they agreed upon. If the period expires, he has no way over her, and she clears her womb (waits to ensure no pregnancy). If she is not pregnant, she becomes lawful for others\" (2).\nThe Kuwaiti Fiqh Encyclopedia mentioned the definition of Mut'ah terminologically: It is the contract with a woman for a known or unknown period (3).",
    "foot_note": "1. Tahdhib Al-Lughah by Al-Azhari, Chapter of Ain and Ta with Meem (2/176).\n2. Al-Qurtubi, Al-Jami' li-Ahkam Al-Quran (5/87).\n3. The Kuwaiti Fiqh Encyclopedia (14/6).",
    "book_id": "980",
    "new_page_number": 19
  },
  {
    "serial_number": "4588927",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "Section Two\nUsages of the term Mut'ah in Sharia\nAl-Katib Al-Balkhi Al-Khwarizmi mentioned the meaning of Mut'ah according to jurists in three ways:\nFirst: That a man marries a woman for a small dowry for a known period, on the condition that the marriage dissolves upon its expiration without divorce. This is permissible according to the Shi'a.\nSecond: The clothing of a divorced woman if she is divorced before consummation.\nThird: Mut'ah of Hajj, which is that one performs Tamattu' (enjoyment) when he finishes his circumambulation, and what was prohibited becomes lawful for him (1).\nMut'ah is a noun from Tamattu', and from it comes Mut'ah of Hajj, Mut'ah of Divorce, and Mut'ah Marriage.\nIn terminology, Tamattu' is used for two meanings:\nFirst: In the sense of Mut'ah of Nikah, which is the contract with a woman for a known or unknown period. It is void without dispute among the Imams, because the objectives of marriage are not intended by it.\nSecond: In the sense of Mut'ah by Umrah to Hajj. According to the Hanafis, it is performing the actions of Umrah or most of them in the months of Hajj and performing Hajj in that same year without returning to his family a valid return - and valid return is settling in his homeland without the state of Ihram remaining - and assuming Ihram for Hajj from the Haram (2).\nThird: Mut'ah of Divorce. Al-Shirbini Al-Khatib said: Money that a husband must pay to his wife who is separated in life by divorce or what resembles it, with conditions (3).",
    "foot_note": "1. Mafatih Al-Ulum (1/34).\n2. Al-Zayla'i (2/45), and Maraqi Al-Falah with Hashiyat Al-Tahawi (p. 402).\n3. Mughni Al-Muhtaj (3/241).",
    "book_id": "980",
    "new_page_number": 20
  },
  {
    "serial_number": "4588928",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "Section Three\nThe Reality of Mut'ah Marriage and its Conditions according to the Shi'a\nThe reality of Mut'ah marriage:\nThis marriage is: A marriage contract between a man and a woman, with a specific dowry mentioned in the text of the contract, for a specific term. Upon the arrival of the term, or by the husband gifting the period to her, the marriage bond dissolves without the need for divorce. The woman says: \"I married you, or wedded you, or gave myself to you in Mut'ah for a dowry of such amount for a period of a month or a year or less or more.\" The man says to her: \"I accept.\" So the marital status is established until the end of the specified period, or until he gifts her the remaining period.\nAfter the period ends, she observes Iddah (waiting period) - like a female slave - for two menstrual cycles. It is said: one cycle, if she is of those who menstruate. And for forty-five days if she does not menstruate while being of menstruating age. The Iddah of a pregnant woman and one whose husband has died is like the Iddah of a permanent wife.\nAll legal conditions must be met in this marriage, including puberty, sanity, choice... etc., with the absence of any legal impediment such as: lineage, cause (marriage relation), breastfeeding, being currently married (Ihsan), being in Iddah for another, or her being the sister of a wife, or similar things. This is in addition to the availability of other conditions of permanent marriage, as established in jurisprudential books.\nThe child of Mut'ah belongs to his father and inherits from him like all his other children, and all general legal rulings regarding fathers, mothers, brothers, sisters, paternal aunts, maternal aunts... etc. apply to him (1).",
    "foot_note": "1. Kitab Zawaj Al-Mut'ah (1/29), investigation and study by Sayyid Ja'far Murtada Al-Amili, printed by the Islamic Center for Studies - Lebanon - Beirut.",
    "book_id": "980",
    "new_page_number": 21
  },
  {
    "serial_number": "4588929",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "Ali bin Babawayh Al-Qummi (1) said: Mut'ah marriage is a marriage without witnesses or inheritance. It is that the woman is asked: Is she free or occupied with a husband or Iddah or pregnancy? If she is free from that, he says to her: 'Provide me enjoyment of yourself upon the Book of Allah and the Sunnah of His Prophet, peace be upon him and his family, a marriage not fornication, such and such for such and such.' You state the dowry and the term, on the condition that you do not inherit from me nor I from you, and that I place the water (semen) wherever I wish, and that when the term expires, you observe an Iddah of forty-five days. If she agrees, you say to her: 'You have provided me enjoyment of yourself' and repeat all conditions to her, because the first saying, and every condition before the marriage, is void, and the matter is only contracted by the second saying. If she says 'Yes' in the second instance, he pays her the dowry or what is present of it, and what remains is a debt upon you, and her intercourse becomes lawful for you then (2).\nAbu Salah Al-Halabi (3) said: As for Mut'ah marriage, two things are conditions for its validity: specifying the wage and the term. If the wage is mentioned but the term is not, it becomes permanent. If the term is mentioned without the wage, the contract is void. Its description is that the one desiring it says to the one he wants to enjoy - and whose guardianship over herself and contracting upon her is valid due to her puberty, perfect sanity, and freedom from husband, Iddah, and pregnancy: 'I want you to provide me enjoyment of yourself upon the Book of Allah and the Sunnah of His Prophet, peace be upon him and his family, for such and such days or months or years for such and such dirhams or dinars or whatever has value, on the condition that you do not inherit from me nor I from you, and that I place the water wherever I wish, and you have no housing or maintenance, and upon you is the Iddah when the period expires.' If she agrees, he says to her: 'Provide me enjoyment of yourself upon the Book of Allah Almighty and the Sunnah of His Prophet, peace be upon him and his family, such and such for such and such with the mentioned conditions.' When he finishes his saying, she should say: 'I have accepted and agreed.' It is better if she says: 'I have provided you enjoyment of myself such and such for such and such,' and mentions the conditions, and he accepts from her. If this marriage is contracted, the Mut'ah husband must pay the entire wage, and delaying part of it with her consent is permissible.",
    "foot_note": "1. He is Ali bin Babawayh Al-Qummi: Abu Al-Hasan Ali bin Al-Hussein bin Musa, father of Sheikh Al-Saduq. He is nicknamed the First Saduq and his son the Second Saduq. A Twelver Shi'a, he believed in the distortion of the Holy Quran. Al-Najashi said about him: Sheikh of the people of Qom in his time. (Al-Wafiyat wa Al-Ahdath 1/79).\n2. Fiqh Al-Rida, Chapter of Mut'ah Marriage and Breastfeeding p. 232.\n3. Abu Salah Al-Halabi, author of the book Al-Kafi fi Al-Fiqh, Shi'a jurisprudence until the 8th century, died 447 AH.",
    "book_id": "980",
    "new_page_number": 22
  },
  {
    "serial_number": "4588930",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "And she has deserved some of it. There is no housing for her nor upon her (to provide), nor maintenance nor inheritance between them even if stipulated. Ila' (vow of abstinence) and divorce do not apply to her, nor is Li'an (mutual cursing) valid between them, but Zihar is valid. When the term expires, she becomes prohibited for him, and he may initiate a second contract. She must observe Iddah. If she produces a child and he had intercourse with her in the vagina, he must acknowledge it. If he practiced coitus interruptus, it (still) attaches to his lineage. If he denies it in any case, he knows himself best. It is not permissible to practice Mut'ah with a virgin except with her father's permission, but it is permissible with a non-virgin without his permission. It is permissible to combine more than four women in this marriage, and equal division of nights is not required between them. It is permissible to practice Mut'ah with a Jew or Christian woman, but not with other types of disbelievers (1).",
    "foot_note": "1. Al-Kafi fi Al-Fiqh p. 298.",
    "book_id": "980",
    "new_page_number": 23
  },
  {
    "serial_number": "4588931",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "Section Four\nObjectives of Islam in Legislating Marriage\nMarriage in Islamic Sharia has great purposes and virtues, as stated in the Holy Quran, including:\n(1 - Affection, Mercy, and Tranquility. The Almighty said: {And of His signs is that He created for you from yourselves mates that you may find tranquility in them; and He placed between you affection and mercy} [Ar-Rum: Verse 21]. And He said: {It is He who created you from one soul and created from it its mate that he might dwell in security with her. And when he covers her, she carries a light burden and continues therein. And when it becomes heavy, they both invoke Allah, their Lord, \"If You should give us a good [child], we will surely be among the grateful.\"} [Al-A'raf: Verse 189]. These verses indicated the most important goals and objectives of legislating marriage in Islam, including forming the righteous family which constitutes the first nucleus of Islamic society, with its intrinsic characteristics of chastity and purity. This is the secret behind Islam's entire keenness on protecting the Muslim family with an impregnable fence to achieve the goals and objectives for which its rulings were legislated. Thus, it can be said that the permanent wife is the one whom Allah's Sunnah made a tranquility for the man. The Holy Quran indicated that this tranquility and psychological and cardiac reassurance are under the shade of correct permanent marriage; that is Allah's Sunnah in His creation. Perhaps making (Tranquility), (Affection), and (Mercy) a requirement leads to that good fruit which the human soul aspires to by virtue of its nature and instinct. From this, it is known that the basic goal and objective of marriage is not limited to satisfying lust; rather, the intent is the formation of the family whose detailed rulings were legislated by the Holy Quran - from engagement, to marriage, to divorce if the spouses do not agree and cannot establish Allah's limits, then rulings of breastfeeding and maintenance, all to achieve social solidarity) (1).",
    "foot_note": "1. Tawthiq Al-Sunnah bayn Al-Shi'a Al-Imamiyyah wa Ahl Al-Sunnah fi Ahkam Al-Imamah wa Nikah Al-Mut'ah (p. 447).",
    "book_id": "980",
    "new_page_number": 24
  },
  {
    "serial_number": "4588932",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "2 - Offspring: The Almighty said: {And Allah has made for you from yourselves mates and has made for you from your mates sons and grandchildren} [An-Nahl: Verse 72]. Ibn Kathir - may Allah Almighty have mercy on him - said in his interpretation: Allah mentions His blessings upon His servants that He made for them mates from themselves, and made for you from your mates (beings) of your own kind, shape, and form. If He had made mates of another kind, harmony, affection, and mercy would not have occurred. But out of His mercy, He created form the sons of Adam males and females, and made females mates for males. Then He mentioned that He made from the mates sons and grandchildren (*Hafadah*), who are the children of sons. Ibn Abbas, Ikrimah, Al-Hasan, Al-Dahhak, and Ibn Zaid said this. Shu'bah said, from Abu Bishr, from Abu Sa'id bin Jubayr, from Ibn Abbas: (Sons and Hafadah) are the child and the child's child (1).\nBased on this, if enjoyment is devoid of procreation, it misses one of the objectives of the original legislation of marriage. From this, the prohibition of seeking a woman merely for enjoying her and spilling water in her womb is known, as is the case in Mut'ah marriage.\n\n3 - It is obedience to Allah and His Messenger, peace and blessings be upon him. Allah legislated marriage and made it a ritual of His upright religion which He approved for His servants. He said, Glory be to Him: {then marry those that please you of women, two or three or four. But if you fear that you will not be just, then [marry only] one or those your right hand possesses. That is more suitable that you may not incline [to injustice]} [An-Nisa: 3]. And peace and blessings be upon him said: \"O assembly of youth, whoever among you is able to marry, let him marry, for it is more effective in lowering the gaze and guarding chastity...\" (2).\n\n4 - Preserving progeny and increasing the Ummah through reproduction so that the worshipers of Allah Almighty increase, and following His Prophet, peace and blessings be upon him, so that boasting (of numbers) is realized and life is populated by it, as peace and blessings be upon him said: \"Marry",
    "foot_note": "1. Tafsir Ibn Kathir (4/586).\n2. Narrated by Al-Bukhari, Book of Marriage, Chapter on Encouragement of Marriage (7/3).",
    "book_id": "980",
    "new_page_number": 25
  },
  {
    "serial_number": "4588933",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "the loving, the fertile, for I will boast of your numbers before the nations\" (1).\n\n5 - Building the Muslim family and creating the righteous society.\n\n6 - Purifying society from sexually transmitted diseases and moral vices.\n\n7 - Seeking reward from Allah Almighty, as peace and blessings be upon him said: \"And in the intimacy of one of you is charity\" (2).",
    "foot_note": "1. Sunan Abu Dawood (2/220).\n2. Narrated by Muslim, Book of Zakat, Chapter: Clarification that the name of charity applies to every type of good deed (2/667).",
    "book_id": "980",
    "new_page_number": 26
  },
  {
    "serial_number": "4588934",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "Chapter One\nThe Ruling on Mut'ah in Sharia\nIt includes three sections:\nSection One: History of the permissibility of Mut'ah marriage and its prohibition in the Prophetic Sunnah\nSection Two: Hadiths and Athar reported regarding the prohibition of Mut'ah marriage with a statement of their status regarding acceptance and rejection\nSection Three: The ruling on Mut'ah according to Sunni jurists",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 27
  },
  {
    "serial_number": "4588935",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "Section One\nHistory of the permissibility of Mut'ah marriage and its prohibition in the Prophetic Sunnah\n[Sunni jurists do not deny that Mut'ah was permitted in some necessary occasions in the era of the Messenger, peace and blessings be upon him. One who tracks the hadiths of Mut'ah's permissibility in the beginning sees that this permission was not while settled in the homeland and house, but rather it was permitted in distant raids and long travel; when lust intensifies, patience decreases, and trial and weakness of chastity are feared. It was wise that their weaning from immorality be gradual, just as alcohol was prohibited. (Mut'ah marriage was permitted when it was permitted for necessity in the case of travel, raiding, and distance from homeland and wife; as an honor to the Companions of the Messenger of Allah, peace and blessings be upon him, who are the ideal generation that sacrificed themselves and their wealth in the path of Allah, bearing the most expensive sacrifices and gravest hardships. When the reasons for permissibility vanished and souls were gradually weaned from their accustomed habits in that transitional stage from Jahiliyyah to Islam, and the Islamic society took its path to stability, and legislation turned to perfecting the final form of basic rulings, Allah permitted His Prophet to prohibit Mut'ah and abrogate it forever)] (1).\nImam Al-Nawawi quoted in his explanation of \"Sahih Muslim\" from Qadi Iyad saying: \"Hadiths of Mut'ah were narrated by a group of Companions... And in none of these Hadiths was it in residence (*Hadar*), but rather it was in their travels in raids, at their necessity, and lack of women, considering their lands were hot and their patience from them little. It was mentioned in the Hadith of Ibn Umar that it was a license in the beginning of Islam for one driven to it by necessity like carrion and the like...\" (2).\nIbn Abd al-Barr narrated from the Hadith of Sahl bin Sa'd with the wording: The Messenger of Allah, peace and blessings be upon him, only permitted",
    "foot_note": "1. Refer to: Tawthiq Al-Sunnah, Ahmed Harith Al-Suhaimi p (518).\n2. Sharh Sahih Muslim by Al-Nawawi: (9/180) (Pub. Dar Al-Fikr, Beirut, 1978).",
    "book_id": "980",
    "new_page_number": 28
  },
  {
    "serial_number": "4588936",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "Mut'ah due to severe celibacy the people were suffering, then he forbade it. When Khaybar was opened, wealth and captives became abundant for them; so the prohibition of Mut'ah was appropriate due to the removal of the cause of permissibility. That was part of showing gratitude for Allah's blessing of expansion after distress. The permission only occurred in raids that were at a distance involving hardship. Khaybar was contrary to that because it is near Medina, so the prohibition of Mut'ah occurred there; indicating that without prior permission there. Then when they returned to a long-duration journey; which is the raid of the Conquest (of Mecca), and celibacy became hard on them; he permitted Mut'ah for them but restricted to three days only; to repel the need, then he forbade them from it after their expiration. End quote (1).\nBy this, what Ibn al-Qayyim mentioned in establishing that the time adverb in the Hadith of Ali, may Allah be pleased with him, saying: 'the year of Khaybar', refers to the prohibition of domestic donkeys; is repelled by the fact that the Companions were not practicing Mut'ah with Jewish women there nor did they ask the Messenger of Allah, peace and blessings be upon him, for permission (2). The majority of Companions held the prohibition of Mut'ah, and the jurists of the regions agreed upon it after the disagreement. Verified disagreement was not reported except from the Imamiyyah (3), which is a sect of the Shi'a (4).\nAs for the date of prohibiting Mut'ah of women: Jurists differed on the date of its prohibition. It was narrated from Ali, may Allah be pleased with him: That it was prohibited on the day of Khaybar (5). Al-Hazimi narrates that it was prohibited in the Farewell Pilgrimage (6), and in the Sahih (7): That it was prohibited on the day of the Conquest of Mecca.\nThe apparent view is that the prohibition occurred twice: It was lawful before Khaybar, then prohibited on the day of Khaybar, then permitted during the Conquest of Mecca for three days, then prohibited after that forever. Muslim narrated from Al-Rabi' bin Sabra Al-Juhani, that",
    "foot_note": "1. Al-Tamhid fima fi Al-Muwatta min Al-Ma'ani wa Al-Asanid (10/110).\n2. Zad Al-Ma'ad fi Hady Khair Al-Ibad (3/205).\n3. Tawthiq Al-Sunnah p 521.\n4. Its explanation will come in [future sections].\n5. Hadith that the Prophet, peace and blessings be upon him, forbade Mut'ah marriage on the day of Khaybar, Sahih Al-Bukhari (5/35).\n6. Al-I'tibar fi Bayan Al-Nasikh wa Al-Mansukh min Al-Athar, Author: Abu Bakr Muhammad bin Musa bin Uthman Al-Hazimi Al-Hamdani, Da'irat Al-Ma'arif Al-Uthmaniyyah, Second Edition 1359 AH.\n7. Meaning in Sahih Muslim, this will come.",
    "book_id": "980",
    "new_page_number": 29
  },
  {
    "serial_number": "4588937",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "his father told him that he was with the Messenger of Allah, peace and blessings be upon him, in the year of the Conquest, and he said: \"O people, I had permitted you to enjoy women (Mut'ah), and Allah has prohibited that until the Day of Resurrection. So whoever has any of them, let him let her go, and do not take back anything you gave them\" (1).\nIbn Majah narrated with an authentic chain from Ibn Umar that he said: When Umar bin Al-Khattab took office, he addressed the people saying: The Messenger of Allah, peace and blessings be upon him, permitted Mut'ah for us three times, then prohibited it. By Allah, I do not know of anyone practicing Mut'ah while married (*Muhsan*) but that I will stone him with stones, unless he brings me four witnesses testifying that the Messenger of Allah, peace and blessings be upon him, made it lawful after he prohibited it (2).\nThe saying that permission and prohibition occurred in the Farewell Pilgrimage is denied by Ibn Qayyim al-Jawziyya al-Hanbali in his book \"Zad al-Ma'ad\", as he said: \"...And it is an error (*Wahm*) by some narrators; his error traveled from the Conquest of Mecca to the Farewell Pilgrimage... and the travel of error often happens to Hafiz (Hadith masters) and those below them. The correct view is: That Mut'ah was only prohibited in the year of the Conquest...\" (3).\nAl-Qurtubi narrates the abrogation of Mut'ah from Ali bin Abi Talib, may Allah be pleased with him; he said: The Messenger of Allah, peace and blessings be upon him, forbade Mut'ah. He said: It was only for the one who could not find (means). When marriage, divorce, Iddah, and inheritance between husband and wife were revealed, it was abrogated. It was also narrated from Ali, may Allah be pleased with him, that he said: The fasting of Ramadan abrogated every fast, Zakat abrogated every charity, Divorce, Iddah, and Inheritance abrogated Mut'ah, and Sacrifice (*Udhiyah*) abrogated every slaughter.\nFrom Ibn Masud, he said: Mut'ah is abrogated; it was abrogated by Divorce, Iddah, and Inheritance (4).\nSo abrogation applied to Mut'ah twice; it was permitted then prohibited, then permitted, then prohibited with an eternal prohibition.\nAl-Shafi'i said: I do not know anything that was prohibited then permitted then prohibited except Mut'ah (5). Al-Baghawi, who is one of the Imams of the Shafi'is, mentioned saying: Al-Rabi' bin Sulayman said: I heard Al-Shafi'i, may Allah be pleased with him",
    "foot_note": "1. This will come also with mention of its chain.\n2. The chain of the Hadith will be mentioned in the subject: Hadiths and Athar in prohibiting Mut'ah marriage.\n3. Zad Al-Ma'ad: (3/403).\n4. Al-Jami' li-Ahkam Al-Quran by Al-Qurtubi: (5/130) (Dar Al-Kutub Al-Misriyya, 2nd Ed. 1384 AH - 1964 AD).\n5. Mughni Al-Muhtaj ila Ma'rifat Ma'ani Alfaz Al-Minhaj by Al-Khatib Al-Shirbini (4/232).",
    "book_id": "980",
    "new_page_number": 30
  },
  {
    "serial_number": "4588938",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "saying: I do not know anything in Islam that was made lawful then prohibited then made lawful then prohibited other than Mut'ah (1).\nAl-Nawawi said in \"Sharh Sahih Muslim\": (The chosen correct view is: That prohibition and permission occurred twice. It was lawful before Khaybar, then prohibited on the day of Khaybar, then permitted on the day of the Conquest of Mecca - which is the day of Autas due to their connection - then prohibited on that day after three days with an eternal prohibition until the Day of Resurrection. The prohibition continued. It is not permissible to say: That permission was specific to pre-Khaybar, and prohibition on the day of Khaybar was eternal, and that what happened on the day of Conquest was merely a confirmation of prohibition, without permission preceding on the day of Conquest. Because the narrations mentioned by Muslim regarding permission on the day of Conquest are explicit; so dropping them is not permissible, and there is no impediment preventing the repetition of permission. And Allah knows best) (2).\nIbn al-Arabi al-Maliki said: As for Mut'ah of women, it is one of the strangenesses of Sharia; because it was permitted in the beginning of Islam, then prohibited on the day of Khaybar, then permitted in the raid of Autas, then prohibited after that. The matter settled on prohibition. It has no sister in Sharia except the issue of the Qibla, for abrogation occurred on it twice, then it settled after that. End quote (3).\nHe means by the issue of the Qibla: That it was towards the Noble Kaaba first, then turned to Bayt al-Maqdis (Jerusalem), then returned to the Kaaba, and settled on it (4).\nThe Correct view: That what happened in the Farewell Pilgrimage was merely forbidding it on that day; due to the gathering of people, and to convey to the absent, and for the completion of religion, and establishing Sharia and clarifying Halal and Haram on that day. He decided on the prohibition of Mut'ah then by saying: \"Until the Day of Resurrection\" (5).\nThe saying of Imam Al-Nawawi previously: (There is no impediment preventing the repetition of permission); is supported by what he quoted from Al-Maziri saying: (The narration differed in \"Sahih Muslim\" regarding the prohibition of Mut'ah; in it: that peace and blessings be upon him prohibited it on the day of Khaybar, and in it: that he prohibited it on the day of the Conquest of Mecca. If",
    "foot_note": "1. Ma'alim Al-Tanzil fi Tafsir Al-Quran (1/596).\n2. Sharh Muslim by Al-Nawawi: (9/181), Dar Ihya Al-Turath Al-Arabi - Beirut.\n3. Quoted by Imam Al-Qurtubi in his Tafsir: (5/130), Dar Al-Kutub Al-Misriyya - Cairo - Second Edition 1384 AH. See also: Sharh Al-Zarqani 'ala Al-Muwatta: (3/233), Maktabat Al-Thaqafa Al-Arabiyya - Cairo - First Edition 1424 AH.\n4. Nikah Al-Mut'ah, by Sheikh Muhammad Al-Hamid: p. 58.\n5. Previous source: p. 59.",
    "book_id": "980",
    "new_page_number": 31
  },
  {
    "serial_number": "4588939",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "those who permitted Mut'ah marriage cling to this Hadith, and claim that the Hadiths contradicted each other, and that this difference impugns them; we say: This claim is error, and this is not a contradiction; because it is valid to prohibit it at a time, (then prohibit it at another time for emphasis), or to make the prohibition famous so he who did not hear it first hears it. So some narrators heard the prohibition at a time, and others heard it at another time, so each transmitted what he heard, and attributed it to the time of his hearing) End of Al-Maziri's speech (1).",
    "foot_note": "1. Quoted by Al-Nawawi in his explanation of Muslim: (9/181), Publisher: Dar Ihya Al-Turath Al-Arabi - Beirut, Second Edition 1394 AH.",
    "book_id": "980",
    "new_page_number": 32
  },
  {
    "serial_number": "4588940",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "Section Two\nHadiths and Athar Reported Regarding the Prohibition of Mut'ah Marriage with a Statement of Their Status Regarding Acceptance and Rejection\nThe text regarding the prohibition of Mut'ah marriage came from seven Companions, namely:\n\n1 - Hadith of Abu Hurairah, may Allah be pleased with him, said: We were in the raid of Tabuk, our campsite was Thaniyat al-Wada'. The Messenger of Allah, peace and blessings be upon him, saw lamps and women weeping. He said: \"What is this?\" It was said: Women weeping who were enjoyed (Mut'ah). Peace and blessings be upon him said: \"Mut'ah has been prohibited - or he said: demolished - Marriage, Divorce, Iddah, and Inheritance.\" Narrated by Abu Ya'la. It contains Mu'ammal bin Ismail; Ibn Ma'in and Ibn Hibban declared him trustworthy, while Al-Bukhari and others declared him weak. The rest of its men are men of Sahih (1).\n\n2 - Hadith of Abu Nadra, said: Ibn Abbas used to command Mut'ah, and Ibn Al-Zubayr used to forbid it. He said: I mentioned that to Jabir bin Abdullah. He said: Upon me the narration revolved. (We practiced Mut'ah with the Messenger of Allah, peace and blessings be upon him. When Umar stood up, he said: Indeed Allah used to permit for His Messenger what He willed by what He willed, and the Quran has been revealed in its places. So {complete the Hajj and Umrah for Allah} [Al-Baqarah: Verse 196], as Allah commanded you, and confirm the marriage of these women. For no man will be brought to me who married a woman for a term but that I will stone him with stones. Narrated by Muslim (1217) (2), and narrated by Imam Ahmad briefly (369) (3).\n\n3 - Hadith of Iyas bin Salamah bin Al-Akwa', from his father who said: (The Messenger of Allah, peace and blessings be upon him, permitted Mut'ah in the year of Autas for three days, then forbade it). Narrated by Muslim (4), and narrated by Imam Ahmad (5).\nImam Al-Nawawi said in his explanation of Sahih Muslim: (The Messenger of Allah, peace and blessings be upon him, permitted Mut'ah in the year of Autas for three days then forbade it. This is a declaration that it was permitted on the day of the Conquest of Mecca, which is",
    "foot_note": "1. Majma' Al-Zawa'id wa Manba' Al-Fawa'id, by Al-Haythami, Chapter: Nikah Al-Mut'ah (4/264).\n2. Sahih Muslim, Book of Hajj, Chapter on Mut'ah in Hajj and Umrah (2/885).\n3. Musnad Imam Ahmad, Musnad of Rightly Guided Caliphs, Musnad Umar bin Al-Khattab, may Allah be pleased with him (1/437).\n4. Narrated by Muslim, Book of Hajj, Chapter on Recommendation for one who sees a woman and desires her to go to his wife or slave girl and have intercourse with her (2/1023).\n5. Musnad Imam Ahmad, Musnad of Medinans, Remainder of Ibn Al-Akwa's Hadith added to the original (27/84).",
    "book_id": "980",
    "new_page_number": 33
  },
  {
    "serial_number": "4588941",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "the same as the day of Autas, and Autas is a valley in Ta'if (1).\n\n4 - Hadith of Al-Rabi' bin Sabra Al-Juhani from his father who reported (that the Messenger of Allah, peace and blessings be upon him, forbade Mut'ah at the time of the Conquest - Mut'ah of women - and that his father had practiced Mut'ah for two red cloaks). Narrated by Muslim (2). He has a narration adding the mention of his father Sabra's story, that he said: The Messenger of Allah, peace and blessings be upon him, permitted Mut'ah for us. So I and a man went to a woman from Banu Amir, who was like a young long-necked she-camel (3). We offered ourselves to her. She said: What do you give? I said: My cloak. And my companion said: My cloak. My companion's cloak was better than mine, but I was younger than him. If she looked at my companion's cloak she liked it, and if she looked at me she liked me. Then she said: You and your cloak suffice me. So I stayed with her for three (days). Then the Messenger of Allah, peace and blessings be upon him, said: (Whoever has anything of these women whom he enjoys, let him let her go) (4). And he has a narration with the wording: (The Messenger of Allah, peace and blessings be upon him, commanded us with Mut'ah in the year of Conquest, when we entered Mecca, then we did not leave it until he forbade us from it) (5).\nAnd he has a narration also with the wording that he was with the Messenger of Allah, peace and blessings be upon him, and he said: (O people, I had permitted you to enjoy women, and Allah has prohibited that until the Day of Resurrection. So whoever has anything of them, let him let her go, and do not take back anything you gave them) (6).\nAnd he has a narration also with the wording that his father (raided with the Messenger of Allah, peace and blessings be upon him, the Conquest of Mecca), he said: So we stayed there fifteen - thirty between night and day - then the Messenger of Allah, peace and blessings be upon him, permitted for us Mut'ah of women. So I went out with a man from my people, and I had superiority over him in beauty, while he was close",
    "foot_note": "1. Sharh Muslim by Al-Nawawi (9/184).\n2. Sahih Muslim, Book of Marriage, Chapter on Mut'ah Marriage, and clarification that it was permitted, then abrogated, then permitted, then abrogated, and its prohibition settled until the Day of Resurrection, (2/1026) number (26).\n3. (Bakrah 'Ayta') Bakrah is a young female camel. 'Ayta' with Fatha on 'Ain' and Sukun on 'Ya' and 'Ta' and Madd, is the long-necked one in moderation and good stature. (Sharh Muslim by Al-Nawawi 9/184).\n4. Sahih Muslim, Book of Marriage, Chapter on Mut'ah Marriage (2/1023).\n5. Previous Source, Book of Marriage, Chapter on Mut'ah Marriage... (2/125).\n6. Previous Source, Book of Marriage, Chapter on Mut'ah Marriage (2/1025).",
    "book_id": "980",
    "new_page_number": 34
  },
  {
    "serial_number": "4588942",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "to ugliness (1). Each of us had a cloak; my cloak was worn out, while my cousin's cloak was new. Until when we were at the bottom of Mecca - or at its top - a young girl like a long-necked she-camel (Antantah) met us (2). We said: Would you like one of us to enjoy you? She said: And what do you offer? So each of us spread his cloak. She began looking at the two men, and my companion sees her looking at his cloak (*Atif*). He said: This one's cloak is worn out, and my cloak is new and fresh. She says: There is no harm in this one's cloak three times - or twice. Then I enjoyed her, and I did not leave until the Messenger of Allah, peace and blessings be upon him, prohibited it (3). Narrated by Abu Dawood in his Sunan briefly (2073) (4), narrated by Al-Nasa'i (3368) (5), narrated by Ibn Majah (1962) (6), narrated by Imam Ahmad briefly (15337) (7), and narrated by Al-Darimi in his Sunan similarly (2241) (8).\n\n5 - Hadith of Sahl bin Sa'd Al-Sa'idi, said: (The Messenger of Allah, peace and blessings be upon him, only permitted Mut'ah for us due to a severe need the people had, then he forbade it afterwards). Narrated by Al-Tabarani. It contains Yahya bin Uthman bin Salih and Ibn Lahi'ah; the hadith of both is valid (*Hasan*), but there is criticism, and the rest of its men are men of the Two Sahihs (9).\n\n6 - Hadith of Ali bin Abi Talib, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him: (Forbade Mut'ah of women on the day of Khaybar, and eating the meat of domestic donkeys). Narrated by",
    "foot_note": "1. (Al-Damamah) with Fatha on Dal, is ugliness. (Sharh Muslim by Al-Nawawi: 9/185).\n2. (Al-Antantah) with open 'Ain', two 'Nun's (first open), and two 'Ta's; same as 'Ayta' explained before. It is said: Just tall. The first is more famous. (Previous reference: 9/185).\n3. Book of Marriage, Chapter on Mut'ah Marriage (2/1024).\n4. Abu Dawood, Book of Marriage, Chapter on Mut'ah Marriage (2/227).\n5. Al-Nasa'i, Book of Marriage, Chapter on Prohibition of Mut'ah (6/126).\n6. Ibn Majah, Book of Marriage, Chapter on Prohibition of Mut'ah Marriage (1/631).\n7. Musnad Imam Ahmad, Musnad of Meccans, Hadith of Sabra bin Ma'bad may Allah be pleased with him (24/53).\n8. Sunan Al-Darimi, Book of Marriage, Chapter on Prohibition of Mut'ah of Women (3/1403).\n9. Majma' Al-Zawa'id wa Manba' Al-Fawa'id by Al-Haythami, Chapter of Shighar Marriage (4/266).",
    "book_id": "980",
    "new_page_number": 35
  },
  {
    "serial_number": "4588943",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "Al-Bukhari (4216) (1). And he has a narration (5115) with the wording that Ali, may Allah be pleased with him, said to Ibn Abbas: (The Prophet forbade Mut'ah and meat of domestic donkeys at the time of Khaybar) (2). And he has a narration (6961) that Ali, may Allah be pleased with him, was told: Ibn Abbas does not see harm in Mut'ah of women. Then he mentioned the Hadith and added: He said: (Some people say if one used a trick and practiced Mut'ah, the marriage is void), and some said (The marriage is valid and the condition is void) (3). Narrated by Muslim (1407) (4). Narrated by Al-Tirmidhi in his Sunan (1121), and added that in the chapter there are narrations from Sabra Al-Juhani and Abu Hurairah: (The Hadith of Ali is Hasan Sahih), and the practice upon this is according to the people of knowledge from the Companions of the Prophet, peace and blessings be upon him, and others. Although something of a license in Mut'ah was reported from Ibn Abbas, he retracted his saying when informed about the Prophet, peace and blessings be upon him. The consensus of most people of knowledge is on the prohibition of Mut'ah, and it is the saying of Al-Thawri, Ibn Al-Mubarak, Al-Shafi'i, Ahmad, and Ishaq (5). Al-Albani authenticated it (6). Narrated by Al-Nasa'i in his Sunan Al-Sughra (3365) (7). Narrated by Ibn Majah in his Sunan (1961) (8). Narrated by Imam Malik in his Muwatta (9). Narrated by Imam Ahmad in his Musnad (10). Narrated by Al-Darimi in his Sunan (2033) (11).\n\n7 - Hadith of Ka'b bin Malik, said: The Messenger of Allah, peace and blessings be upon him, forbade Mut'ah of women),",
    "foot_note": "1. Sahih Al-Bukhari, Book of Maghazi, Chapter of Battle of Khaybar (5/135). Narrated with this wording by Muslim in his Sahih, Book of Marriage, Chapter on Mut'ah Marriage (2/1027).\n2. Previous source, Book of Marriage, Chapter on Prophet's prohibition of Mut'ah Marriage finally (7/12).\n3. Previous source, Book of Tricks, Chapter on Trickery in Marriage (9/24).\n4. Sahih Muslim, Book of Hajj, Chapter on Recommendation... (2/1027).\n5. Sunan Al-Tirmidhi, Chapter on what came regarding prohibition of Mut'ah Marriage (3/421).\n6. Sahih wa Da'if Sunan Al-Tirmidhi (2/121).\n7. Sunan Al-Nasa'i Al-Sughra, Book of Marriage, Chapter on Prohibition of Mut'ah (6/25).\n8. Sunan Ibn Majah, Book of Marriage, Chapter on Prohibition of Mut'ah (1/630).\n9. Muwatta Imam Malik, Book of Marriage, Chapter on Mut'ah Marriage (2/542).\n10. Musnad Imam Ahmad (592), Musnad of Ali bin Abi Talib may Allah be pleased with him (20/29).\n11. Sunan Al-Darimi, Book of Sacrifices, Chapter on domestic donkey meat (2/1265).",
    "book_id": "980",
    "new_page_number": 36
  },
  {
    "serial_number": "4588944",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "Narrated by Al-Tabarani, and it contains Yahya bin Abi Unaysa, who is abandoned (*Matruk*) (1).\n- And he has a narration saying: The Messenger of Allah, peace and blessings be upon him, forbade Mut'ah and meat of domestic donkeys). Narrated by Al-Tabarani from two paths; one contains Mansur bin Dinar, who is weak, and the other contains Mu'ammal bin Ismail; Ibn Ma'in trusted him but the majority considered him weak (2).",
    "foot_note": "1. Majma' Al-Zawa'id wa Manba' Al-Fawa'id by Al-Haythami, Chapter on Shighar Marriage (4/266).\n2. Previous source, Chapter on Domestic Donkeys (5/49).",
    "book_id": "980",
    "new_page_number": 37
  },
  {
    "serial_number": "4588945",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "Athar (Traditions) Indicating the Prohibition of Mut'ah Marriage from the Sayings of Companions and Successors\n\n1 - Al-Hakim Al-Naysaburi narrated in his Mustadrak: From Mother of Believers Aisha, may Allah be pleased with her, that she was asked about Mut'ah of women. She said: (Between me and you is the Book of Allah, and she recited this verse {And they who guard their private parts (5) Except from their wives or those their right hands possess, for indeed, they will not be blamed (6) But whoever seeks beyond that} [Al-Mu'minun: Verses 5-7] what Allah married him to or gave him possession of, then he has transgressed). He said: This is a Sahih hadith according to the criteria of the Two Sheikhs (Bukhari and Muslim) though they did not extract it (1).\n\n2 - From Ibn Mulaykah, said: Aisha, may Allah be pleased with her, when asked about Mut'ah used to say: Between me and you is the Book of Allah Almighty; Allah Almighty said {And they who guard their private parts (5) Except from their wives} [Al-Mu'minun: Verses 5-6]. She said: Whoever seeks other than what Allah Almighty married him to or gave him possession of, then he has transgressed (2).\n\n3 - Abu Al-Hasan Ali bin Umar Al-Daraqutni narrated in his Sunan from Ibn Abbas, may Allah be pleased with them, that Umar forbade Mut'ah of women and said - meaning Umar: (Allah only permitted for people in the time of the Messenger of Allah, peace and blessings be upon him, women were scarce then, then He prohibited them afterwards. I will not catch anyone doing that but I will inflict punishment on him) (3).\n\n4 - Abu Bakr Abdul Razzaq Al-San'ani narrated in his Musannaf that it was said to Ibn Umar that Ibn Abbas permits Mut'ah of women. He said: (I don't think Ibn Abbas says this). They said: Yes, by Allah he says it. He said: (By Allah, he would not say this in the time of Umar, and Umar would surely punish you for such a thing, and I do not know it except as fornication (Sifah)) (4).\n\n5 - Abu Bakr bin Abi Shaybah narrated in his Musannaf: From Al-Zuhri from Salim from his father, he said:",
    "foot_note": "1. Mustadrak Al-Hakim, Book of Tafsir, Chapter of Tafsir Surah Al-Mu'minun (20/427).\n2. Al-Matalib Al-Aliya bi Zawa'id Al-Masanid Al-Thamaniya, Ibn Hajar, Chapter of Mut'ah (8/470).\n3. Sunan Al-Daraqutni, Book of Marriage / Chapter of Dowry (4/383).\n4. Musannaf Abdul Razzaq, Chapter of Mut'ah (7/502) Dar Al-Maktab Al-Islami - Beirut, 2nd Ed. (1403 AH).",
    "book_id": "980",
    "new_page_number": 38
  },
  {
    "serial_number": "4588946",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "He was asked about Mut'ah of women? He said: (We do not know it except as fornication (Sifah)) (1).\n\n6 - Ibn Majah narrated in his Sunan: From Ibn Umar, may Allah be pleased with him, said: When Umar bin Al-Khattab took office, he addressed the people saying: (The Messenger of Allah, peace and blessings be upon him, permitted Mut'ah for us three times, then prohibited it. By Allah, I do not know of anyone practicing Mut'ah while married but that I will stone him with stones, unless he brings me four witnesses testifying that the Messenger of Allah, peace and blessings be upon him, made it lawful after he prohibited it) (2). Al-Albani declared it Hasan (3).\n\n7 - Abu Al-Qasim Al-Tabarani narrated in his Mu'jam Al-Awsat: From Salim bin Abdullah, said: Abdullah bin Umar was approached and told: Ibn Abbas commands Mut'ah marriage. Ibn Umar said: Glory be to Allah! I don't think Ibn Abbas does that. They said: Yes, he commands it. He said: Was Ibn Abbas anything but a small boy when the Messenger of Allah, peace and blessings be upon him, was alive? Then Ibn Umar said: (The Messenger of Allah, peace and blessings be upon him, forbade us from it, and we were not fornicators) (4). Ibn Hajar said: Its chain is strong (5).\n\n8 - Al-Haythami narrated in his book Majma' Al-Zawa'id wa Manba' Al-Fawa'id, from Ibn Umar that he was asked about Mut'ah and said: Haram (Prohibited). It was said: Ibn Abbas sees no harm in it? He said: By Allah, Ibn Abbas knew that the Messenger of Allah, peace and blessings be upon him, forbade it on the day of Khaybar, and we were not fornicators. Narrated by Al-Tabarani, containing Mansur bin Dinar, who is weak (6).\n\n9 - Abu Bakr Al-Bayhaqi narrated from Ibn Masud, may Allah be pleased with him, said: We used to raid with the Messenger of Allah, peace and blessings be upon him, and our alienation was long, so we said: Shall we not castrate ourselves, O Messenger of Allah? (He forbade us, then permitted us to marry a woman for a term for something [dowry], then he forbade us from it on the day of Khaybar, and from meat of",
    "foot_note": "1. Musannaf Ibn Abi Shaybah, Chapter on Mut'ah Marriage and its Prohibition (3/551) Maktabat Al-Rushd - Riyadh - First Edition (1409 AH).\n2. Sunan Ibn Majah, Chapter on Prohibition of Mut'ah Marriage (1/631).\n3. Sahih wa Da'if Sunan Ibn Majah (4/463).\n4. Mu'jam Al-Awsat by Al-Tabarani (9/119).\n5. Al-Talkhis Al-Habir fi Takhrij Ahadith Al-Rafi'i Al-Kabir (3/333).\n6. Majma' Al-Zawa'id wa Manba' Al-Fawa'id by Al-Haythami, Chapter on Mut'ah Marriage (4/265).",
    "book_id": "980",
    "new_page_number": 39
  },
  {
    "serial_number": "4588947",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "domestic donkeys) (1). Sheikh Ibn Baz said: This is a Hasan path (2).\n\n10 - And he has a narration: From Abdullah bin Masud, may Allah be pleased with him, said: Mut'ah is abrogated; Divorce, Dowry, Iddah, and Inheritance abrogated it (3).\n\n11 - Abu Bakr Abdul Razzaq Al-San'ani narrated in his Musannaf that Hasan and Abdullah, sons of Muhammad, told him, from their father Muhammad bin Ali, that he heard his father Ali bin Abi Talib say to Ibn Abbas (when he heard he permits Mut'ah): Ali said to him: You are a lost man. The Messenger of Allah, peace and blessings be upon him: (Forbade it on the day of Khaybar, and domestic [donkey] meat) (4). Al-Haythami said: Al-Tabarani narrated it in Al-Awsat, and its men are men of Sahih (5).\n\n12 - And he has a narration: From Ali that he said: (Ramadan abrogated every fast, Zakat abrogated every charity, and Divorce, Prayer, Iddah, and Inheritance abrogated Mut'ah) (6).\n\n13 - Al-Hafiz Ibn Hajar Al-Asqalani said in his book (Fath Al-Bari Sharh Sahih Al-Bukhari): (The Hadith of Ali, may Allah be pleased with him, is supported by what Abu Awana extracted and authenticated via Salim bin Abdullah that a man asked Ibn Umar about Mut'ah and he said: Haram. He said: But so-and-so says [it is allowed] regarding it. He said: By Allah, he knew that the Messenger of Allah, peace and blessings be upon him, prohibited it on the day of Khaybar and we were not fornicators) (7).\n\n14 - Ibn Hajar narrated in his book Al-Matalib Al-Aliya bi Zawa'id Al-Masanid Al-Thamaniya from Ibn Umar, said: (Umar, may Allah be pleased with him, said: If I had preceded [in warning] regarding Mut'ah of women, I would have stoned) (8).",
    "foot_note": "1. Musannaf Abdul Razzaq, Chapter of Mut'ah (7/506) and the origin of the Hadith is in the Two Sahihs.\n2. Majmu' Fatawa Al-Allamah Abdul Aziz bin Baz - may Allah have mercy on him - (30/342).\n3. Sunan Al-Bayhaqi Al-Kubra, Chapter on Mut'ah Marriage (7/337).\n4. Musannaf Abdul Razzaq (7/500).\n5. Majma' Al-Zawa'id wa Manba' Al-Fawa'id (4/365).\n6. Previous Source (7/505).\n7. Fath Al-Bari (9/169) Dar Al-Ma'rifah - Beirut - 1379 AH.\n8. Al-Matalib Al-Aliya bi Zawa'id Al-Masanid Al-Thamaniya (9/76).",
    "book_id": "980",
    "new_page_number": 40
  },
  {
    "serial_number": "4588948",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "Al-Busiri said: This chain is Sahih (1).\n\n15 - Abu Bakr Abdul Razzaq Al-San'ani narrated from Ma'mar, from Al-Zuhri, from Al-Qasim bin Muhammad, said: \"I see its prohibition in the Quran\". He said: I said: Where? He said: He recited this verse {And they who guard their private parts (5) Except from their wives or those their right hands possess} [Al-Mu'minun: Verses 5-6] (2).\n\n16 - And he has a narration: From Al-Thawri, from Dawood, from Ibn Al-Musayyib, said: (Inheritance abrogated it) (3).\n\n17 - Abu Bakr Al-Bayhaqi narrated in his Sunan Al-Kubra: From Sa'id bin Al-Musayyib, said: (Inheritance abrogated Mut'ah) (4). Al-Albani said: Its chain is Jayyid (Good) (5).\n\n18 - And he has a narration: From Bassam Al-Sayrafi, said: I asked Ja'far bin Muhammad (Imam Al-Sadiq) about Mut'ah and described it. He said to me: (That is Zina [Fornication]) (6). Al-Albani said: Its chain is Jayyid (Good) (7).",
    "foot_note": "1. Ithaf Al-Khiyarah Al-Maharah bi Zawa'id Al-Masanid Al-Ashara (4/384).\n2. Musannaf Abdul Razzaq, Chapter of Mut'ah (7/502).\n3. Previous Source (7/505).\n4. Sunan Al-Bayhaqi Al-Kubra, Chapter on Mut'ah Marriage (7/337).\n5. Silsilat Al-Ahadith Al-Sahihah (5/538).\n6. Previous Source (7/338).\n7. Previous Source (5/528).",
    "book_id": "980",
    "new_page_number": 41
  },
  {
    "serial_number": "4588949",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "Section Three\nRuling on Mut'ah According to Sunni Jurists\nSunni jurists view that Mut'ah marriage was permitted due to compelling necessity for days in time, in cases of long travel and distant raids in the early days of Islam when Muslims were new to leaving Jahiliyyah. Then it was prohibited decisively and eternally, after the pillar of religion straightened, the strength of believers increased, and their faith and commitment hardened, becoming in no need of seeking such licenses (1).\nSunni jurists inferred the correctness of their school with evidences from the Quran and the Noble Prophetic Sunnah, as well as Consensus (Ijma') and sound Reason. Following are the evidences they used:\n\nEvidences of Sunni Jurists from the Holy Quran and Noble Prophetic Sunnah:\nFirst: The Holy Quran:\nAllah Almighty said: {And they who guard their private parts (5) Except from their wives or those their right hands possess, for indeed, they will not be blamed (6) But whoever seeks beyond that, then those are the transgressors} [Al-Mu'minun: 5-7].\nPoint of Inference: The verses clarified the types of permissible marriages in Islam, restricted to correct permanent marriage and right-hand possession (slaves), and prohibited what is below that. Imam of exegetes Ibn Jarir Al-Tabari says: \"Whoever seeks for his private part a marriage other than his wife or right hand possession, the doers of that are the transgressors, who exceeded what Allah permitted for them to what He prohibited for them, so they are the blamed ones\" (2).\nAl-Khatib Al-Baghdadi mentioned in Tarikh Baghdad a stance of Judge Yahya bin Aktham. He said: We were with Al-Ma'mun on the way to Sham. He ordered a crier to announce the permissibility of Mut'ah. Yahya bin Aktham said to us: Go early",
    "foot_note": "1. Nikah Al-Mut'ah Bayn Al-Ibahah wa Al-Tahrim by Prof. Dr. Ahmed Awad Abu Al-Shabab (p. 185).\n2. Jami' Al-Bayan fi Ta'wil Al-Quran (23/12).",
    "book_id": "980",
    "new_page_number": 42
  },
  {
    "serial_number": "4588950",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "tomorrow to him. If you see a face for speaking, speak; otherwise remain silent until I enter. He said: We entered upon him while he was using a Siwak and saying - while angry -: Two Mut'ahs were in the time of the Messenger of Allah, peace and blessings be upon him, and the time of Abu Bakr, and I forbid them. And who are you O .... (meaning Umar) (1) to forbid what the Prophet, peace and blessings be upon him, and Abu Bakr did? I signaled to Muhammad bin Madkur to hold back; a man saying about Umar bin Al-Khattab what he says, shall we speak to him? So we held back. Yahya came and sat, and we sat. Al-Ma'mun said to Yahya: Why do I see you changed? He said: It is grief, O Commander of the Faithful, for what happened in Islam. He said: And what happened in it? He said: The call to permit Zina (Fornication). He said: Zina? He said: Yes, Mut'ah is Zina. He said: And from where did you say this? He said: From the Book of Allah and the Hadith of the Messenger of Allah, peace and blessings be upon him. Allah Almighty said: {Certainly will the believers have succeeded (1) They who are during their prayer humbly submissive (2) And they who turn away from ill speech (3) And they who are observant of zakah (4) And they who guard their private parts (5) Except from their wives or those their right hands possess, for indeed, they will not be blamed (6) But whoever seeks beyond that, then those are the transgressors} [Al-Mu'minun: Verses 1-7]. O Commander of the Faithful, is the Mut'ah wife a right hand possession? He said: No. He said: Is she the wife whom Allah meant, who inherits and is inherited from, and the child belongs to (the husband), and has her conditions? He said: No! He said: Then the one exceeding these two becomes of the transgressors. And this Al-Zuhri, O Commander of the Faithful, narrates from Abdullah and Al-Hasan sons of Muhammad bin Al-Hanafiyyah from their father Muhammad bin Ali from Ali bin Abi Talib who said: The Messenger of Allah, peace and blessings be upon him, ordered me to call out the prohibition of Mut'ah and its unlawfulness, after he had commanded it. Al-Ma'mun turned to us and said: Is this preserved from the hadith of Al-Zuhri? We said: Yes, O Commander of the Faithful, a group narrated it, among them Malik. He said: I seek forgiveness from Allah; call out the prohibition of Mut'ah. So they called it out (2).\nAs for the Prophetic Sunnah, Sunni jurists inferred the prohibition of Mut'ah with a large group of noble Prophetic Hadiths, which abrogated all Hadiths reported regarding the permissibility of Mut'ah marriage. They are the reliance, and in them is enough clarity to prove the preponderant view.",
    "foot_note": "1. I intentionally deleted it and did not write it as it does not befit the status of the Companions, may Allah be pleased with them.\n2. Tarikh Baghdad wa Dhuyuluhu by Al-Khatib Al-Baghdadi (14/203).",
    "book_id": "980",
    "new_page_number": 43
  },
  {
    "serial_number": "4588951",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "Third: Inference by Consensus (Ijma'):\nThe majority of Companions went to the prohibition of Mut'ah marriage, due to the Prophet's prohibition of it, peace and blessings be upon him, and his prohibiting it eternally. Then Consensus was convened in the time of Commander of the Faithful Umar, may Allah be pleased with him, when he forbade it after news reached him that some men practiced Mut'ah in his days. He reminded them from the pulpit of the Messenger of Allah, peace and blessings be upon him, of the ruling of prohibition, and the Companions approved him in that (1).\nQadi Iyad said: Scholars agreed that this Mut'ah was permissible for a term with no inheritance, and separation occurs by expiration of the term without divorce. Then Consensus occurred after that on its prohibition by all scholars (2).\nAl-Qurtubi said: All narrations agree that the time of Mut'ah's permissibility did not last long and that it became prohibited. Then the Salaf and Khalaf (Predecessors and Successors) agreed on its prohibition except those who are not paid attention to. A group of Imams asserted Ibn Abbas's solitude in permitting it. It is a famous issue, and the opponent is rare. However, Ibn Abd al-Barr said: The companions of Ibn Abbas from the people of Mecca and Yemen held its permissibility, then the jurists of the regions agreed on its prohibition (3).\nAl-Jassas said: We have indicated the establishment of prohibition after permission from the apparent meaning of the Book and Sunnah and consensus of the Salaf. Abu Bakr said: We have mentioned regarding Mut'ah and its ruling of prohibition what is sufficient for one who advises himself. There is no disagreement about it among the first generation as we explained. The jurists of the regions agreed with that on its prohibition and do not differ on it. Jurists differed regarding one who marries a woman for known days. Abu Hanifa, Abu Yusuf, Muhammad, Malik bin Anas, Al-Thawri, Al-Awza'i, and Al-Shafi'i said: If he marries a woman for ten days, it is void and there is no marriage between them (4).\nAl-Shawkani said: There is no meaning to a saying that contradicts the Book of Allah and the Sunnah of His Messenger, peace and blessings be upon him,",
    "foot_note": "1. Nikah Al-Mut'ah Bayn Al-Ibahah wa Al-Tahrim p. 197 by Prof. Dr. Ahmed Awad Abu Al-Shabab.\n2. Sahih Muslim: Sharh Al-Nawawi (9/181).\n3. Fath Al-Bari (9/173).\n4. Al-Jassas li-Ahkam Al-Quran (3/103).",
    "book_id": "980",
    "new_page_number": 44
  },
  {
    "serial_number": "4588952",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "And Iyad said: Then Consensus occurred from all scholars on its prohibition (1).\nFourth: Evidences of Sunni Jurists from Reason:\nThe Truth, Blessed and Exalted, says in His Noble Book: {And of His signs is that He created for you from yourselves mates that you may find tranquility in them; and He placed between you affection and mercy. Indeed in that are signs for a people who give thought.} [Ar-Rum: 21]. If the intent of correct permanent marriage is achieving the greatest amount of security and stability expressed by the Truth, Blessed and Exalted, in His saying (that you may find tranquility in them) [Ar-Rum: 21], to other noble sublime objectives for preserving the continuity of the human species on sound foundations and bases; for that sake, the True Law arranged upon correct permanent marriage a set of necessities, such as validity of divorce, inheritance, Iddah, and obligation of maintenance. All of these are negated in Mut'ah marriage. It carries none of the properties of marriage except the restricted naming presented to it from the aspect of the contract form.\nMoreover, the meaning for which marriage was legislated is not realized in Mut'ah marriage. The Lawgiver required the marriage contract to be a contract of familiarity, love, and partnership in life. What familiarity and partnership come from a contract intended only for satisfying lust temporarily?!\nThe Wise Lawgiver intended the marriage contract to be a contract to realize those objectives we pointed to. So what motherhood and what psychological tranquility comes with a woman who rents her body to everyone? And what partnership results from such a contract whose foundation is built on the edge of a crumbling cliff? And what partnership, psychological tranquility, and affection result from such a marriage that has no objective behind it except satisfying desire and lust, on the condition of once, or an hour, or two hours, or similar, and when he finishes he turns his face away!!!.\nWhat partnership results from Mut'ah marriage, while the woman rents her body for a few dirhams and might not get them if she breaches the contract conditions? Is she not rented? Is there a difference between this contract and Zina occurring between fornicators by mutual consent based on offer, acceptance, and agreement, and if",
    "foot_note": "1. Nayl Al-Awtar Chapter on what came regarding Mut'ah Marriage and statement of its abrogation (6/162).",
    "book_id": "980",
    "new_page_number": 45
  },
  {
    "serial_number": "4588953",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "the immoral woman breaches something agreed upon, not fulfilling his desires, he withholds some of her wage? Therefore, among what Shi'a Imams enacted - claiming unproven narrations - is that a man should be cautious with his dirhams so he isn't exposed to fraud or deception, like her failing him in some conditions or him discovering she is married; so they permitted him to withhold her wage as a precaution, deducting from it according to the time she failed.\nHow can Zina be if this type of marriage is not Zina? Does not Zina occur by mutual consent between fornicators to satisfy desire? And is the Mut'ah marriage contract for anything but this?! Are the corruptions resulting from Zina less than the corruptions resulting from Mut'ah marriage?!\nIf Mut'ah marriage is permitted, wouldn't that be a vehicle people ride to avoid the door of correct marriage and the obligations arising from it? If permitted, how would people know their children?! If they don't know them, who spends on this huge army produced by Mut'ah marriage?! The treasuries and state funds would be burdened by spending on these, and if opened for them, other life facilities for which funds are kept in treasuries would be disabled. We cannot say children belong to the contractors since it is assumed the woman can sit (contract) every hour.\nIf the Mut'ah woman is believed regarding herself, and the man doesn't have to ask if she has a husband or not? And if he discovers - later - she is married, Shi'a scholars enacted for that deceived man to overlook what he gave her of wage, in exchange for what he made lawful of her private part, and withhold what remains with him.\nAmidst this sexual chaos, where do people's lineages become?! Even though mixing two waters (sperms) in the womb is not permissible in any Sharia, as lineage attachment to one of them becomes confusing then. The case is that preserving lineages is what distinguishes humans from animals. If a rational person contemplates the reality of Mut'ah, he finds hidden corruptions in it all contradicting the Sharia (1).",
    "foot_note": "1. Al-Mut'ah Bayn Al-Ibahah wa Al-Tahrim p. 199.",
    "book_id": "980",
    "new_page_number": 46
  },
  {
    "serial_number": "4588954",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "I said: And how can the Hadd (punishment) of Zina be established with the existence of Mut'ah marriage? For anyone found with a woman can claim he is enjoying (Mut'ah) her to escape the Zina punishment.",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 47
  },
  {
    "serial_number": "4588955",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "Chapter Two\nRuling on Mut'ah Marriage According to the Shi'a\nIt includes three sections:\nSection One: Mentioning the traditions (Athar) they used as evidence for the permissibility of Mut'ah marriage\nIt includes two subsections:\nSubsection One: Discussing the evidences through understanding and narration\nSubsection Two: Doubts raised about the permissibility of Mut'ah marriage and answering them\nSection Two: Hadiths prohibiting Mut'ah from Shi'a sources\nSection Three: Texts of Shi'a scholars who prohibited Mut'ah marriage",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 48
  },
  {
    "serial_number": "4588956",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "Section One\nMentioning the Traditions (Athar) They Used as Evidence for Permissibility of Mut'ah Marriage\n\n1 - Sheikh Al-Kulayni (1) narrated in his book Al-Kafi: From several of his companions, from Sahl bin Ziyad, and Ali bin Ibrahim, from his father together, from Ibn Abi Najran, from Asim bin Hamdi, from Abu Basir said: I asked Abu Ja'far peace be upon him about Mut'ah. He said: Revealed in the Quran {So for whatever you enjoy [of marriage] from them, give them their due compensation as an obligation. And there is no blame upon you for what you mutually agree to beyond the obligation} [An-Nisa: Verse 29] (2).\n\n2 - Also narrated by Sheikh Al-Kulayni: From Ali bin Ibrahim, from his father from Ibn Abi Umayr from Umar bin Udhaina, from Zurara said: Abdullah bin Umar Al-Laythi came to Abu Ja'far peace be upon him and said to him: What do you say about Mut'ah of women? He said: Allah made it lawful in His Book and on the tongue of His Prophet, peace and blessings be upon him, so it is lawful until the Day of Resurrection. He said: O Abu Ja'far, someone like you says this when Umar prohibited it and forbade it?! He said: Even if he did. He said: I seek refuge in Allah for you from permitting something Umar prohibited. He said: He said to him: You are on the saying of your companion and I am on the saying of the Messenger of Allah, peace be upon him and his family. Come let me curse you (Mula'anah) that the truth is what the Messenger of Allah, peace and blessings be upon him, said and falsehood is what your companion said. He said: Abdullah bin Umayr came forward and said: Would it please you that your women, daughters, sisters, and cousins do it? He said: Abu Ja'far peace be upon him turned away from him when he mentioned his women and cousins (3).\n\n3 - Also narrated: From Ibn Ibrahim, from his father, from Ibn Umayr, from Ali bin Al-Hasan bin Ribat, from Hariz, from Abdul Rahman bin Abi Abdullah said: I heard Abu Hanifa asking Abu Abdullah peace be upon him about Mut'ah. He said: Which of the two Mut'ahs do you ask?",
    "foot_note": "1. He is Muhammad bin Yaqub Al-Razi Al-Kulayni Abu Ja'far, Sheikh of the Shi'a, and scholar of the Imamiyyah, author of compositions, (d. 328 AH) Siyar A'lam Al-Nubala (11/492).\n2. Al-Kafi: Chapters of Mut'ah (5/448).\n3. Al-Kafi: Chapters of Mut'ah (5/449).",
    "book_id": "980",
    "new_page_number": 49
  },
  {
    "serial_number": "4588957",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "He said: I asked you about Hajj Mut'ah, so inform me about Mut'ah of women, is it true? He said: Glory be to Allah, have you not read the Book of Allah Almighty? {So for whatever you enjoy [of marriage] from them, give them their due compensation as an obligation} [An-Nisa: Verse 29]. Abu Hanifa said: By Allah, it is as if I have never read this verse (1).\n\n4 - Also narrated by Al-Kulayni in Al-Kafi: From Muhammad bin Ismail, from Al-Fadl bin Shadhan, from Safwan bin Yahya, from Ibn Muskan from Abdullah bin Sulayman said: I heard Abu Ja'far peace be upon him say: Ali peace be upon him used to say: Were it not for what Bani Al-Khattab (Umar) preceded me with, no one would commit Zina except a wretched person (2).\n\n5 - Sheikh Al-Tusi (3) narrated in his book Al-Istibsar: From Ali bin Ibrahim from his father from Ibn Mahbub from Ali Al-Saba'i said: I said to Abu Al-Hasan peace be upon him: May I be your ransom, I used to marry Mut'ah then I disliked it and became pessimistic about it, so I gave Allah a covenant between the Corner (Rukn) and the Standing Place (Maqam) and made a vow and fasting upon myself not to marry it (Mut'ah). Then that became hard on me and I regretted my oath, but I have the strength to marry openly. He said: He said to me: You covenanted Allah not to obey Him? By Allah if you do not obey Him you will disobey Him (4).\n\n6 - Also narrated: From Muhammad bin Yahya from Abdullah bin Muhammad bin Ali bin Al-Hakam from Aban bin Uthman from Abu Maryam from Abu Abdullah peace be upon him said: Mut'ah, the Quran was revealed with it and the Sunnah from the Messenger of Allah, peace be upon him and his family, proceeded with it (5).",
    "foot_note": "1. Al-Kafi: Chapters of Mut'ah (5/449).\n2. Al-Kafi: Chapters of Mut'ah (5/448).\n3. He is Muhammad bin Al-Hasan bin Hussein bin Ali, Abu Ja'far Al-Tusi, Sheikh of the Shi'a and their scholar. He has a large Tafsir in twenty volumes and several compositions. Famous. He came to Baghdad, was appointed, and studied Shafi'i jurisprudence, then adhered to Sheikh Al-Mufid and turned Rafidi. Died in Mashhad (d. 459 AH). (Al-Wafi bi Al-Wafiyat 2/258).\n4. Al-Istibsar: Chapter It is not proper to do Mut'ah except with a believing knowing chaste woman (3/142).\n5. Previous Source.",
    "book_id": "980",
    "new_page_number": 50
  },
  {
    "serial_number": "4588958",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "7 - Mulla Fathallah Al-Kashani (1) mentioned in his book Tafsir Kabir Minhaj Al-Sadiqin fi Ilzam Al-Mukhalifin: The Prophet, peace and blessings be upon him, said: Whoever does Mut'ah once is safe from the wrath of the Compeller, whoever does Mut'ah twice is gathered with the righteous, and whoever does Mut'ah three times crowds me in Paradise. Also he said: Whoever does Mut'ah once his degree is like the degree of Hussein, whoever does Mut'ah twice his degree is like the degree of Hasan, whoever does Mut'ah three times his degree is like the degree of Ali, and whoever does Mut'ah four times his degree is like my degree (2).\n\n8 - Al-Hurr Al-Amili (3) narrated in his book Wasa'il Al-Shi'a (Aal Al-Bayt): From Ibn Isa, from Muhammad bin Ali Al-Hamdani, from a man he named from Abu Abdullah peace be upon him said: There is no man who does Mut'ah then bathes but Allah creates from every drop dripping from him seventy angels asking forgiveness for him until the Day of Resurrection and cursing the one avoiding it until the Hour is established (4).\n\n9 - Al-Hurr Al-Amili narrated in his book Wasa'il Al-Shi'a (Aal Al-Bayt): From Ali bin Ibrahim from (his counterpart) from Ahmed bin Idris, from Ahmed bin Muhammad, from Malik bin Abdullah bin Aslam, from his father, from a man, from Abu Abdullah peace be upon him regarding the saying of Allah Almighty {Whatever mercy Allah grants to people, none can withhold it} [Fatir: 2] said: And Mut'ah is of that (5).\n\n10 - Also narrated: From Ali bin Ibrahim, from his father, from Ali bin Asbat, from some of our companions from Muhammad bin Aslam, from Abu Ja'far peace be upon him in a hadith said: (Indeed Allah was compassionate to you so He made Mut'ah a substitute for you for drinks [alcohol]) (6).",
    "foot_note": "1. He is Fathallah bin Shukrallah, Shi'i, Muhaddith, Historian, Jurist, Exegete, (d. 988 AH) (Mu'jam Al-Mu'allifin).\n2. Tafsir Kabir Minhaj Al-Sadiqin fi Ilzam Al-Mukhalifin (2/481).\n3. He is Muhammad bin Al-Hasan bin Ali Al-Amili, nicknamed Al-Hurr. Imami Jurist, Historian. Born in the village of Mashghar (in Jabal Amil, Lebanon), moved to Jaba', then to Iraq, and ended up in Tus (Khorasan) where he resided and died in 1104 AH (Al-A'lam by Khair al-Din Al-Zirikli Al-Dimashqi 6/90).\n4. Wasa'il Al-Shi'a: Chapter on desirability of Mut'ah and what should be intended by it (21/16).\n5. Wasa'il Al-Shi'a: (21/9).\n6. Wasa'il Al-Shi'a: (21/7).",
    "book_id": "980",
    "new_page_number": 51
  },
  {
    "serial_number": "4588959",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "11 - Also narrated from Muhammad bin Ali bin Al-Hussein with his chain from Bakr bin Muhammad, from Abu Abdullah peace be upon him said: I asked him about Mut'ah? He said: I indeed dislike for a Muslim man to leave the world while a habit of the habits of the Messenger of Allah, peace be upon him and his family, remains upon him which he has not fulfilled (1).\n\n12 - Also narrated by Al-Hurr Al-Amili in his book Wasa'il Al-Shi'a (Aal Al-Bayt) and from Ibn Isa, from Muhammad bin Ali Al-Hamdani, from a man he named from Abu Abdullah peace be upon him said: There is no man who does Mut'ah then bathes but Allah creates from every drop dripping from him seventy angels asking forgiveness for him until the Day of Resurrection and cursing the one avoiding it until the Hour is established (2).\n\n13 - Al-Fayd Al-Kashani (3) narrated in his book Al-Wafi: From Muhammad, from Ahmed, from Ibn Faddal from Ibn Bukayr, from Zurara, said: I said to him: Is it permissible for a man to enjoy a woman for an hour or two? He said: (The hour and two hours do not stop at their limit [indefinite/short], but the *'Ard* (4) and two *'Ard*s, and the day and two days and the night and likes of that) (5).\n\n14 - Sayyid Al-Burujerdi (6) narrated in his book Jami' Ahadith Al-Shi'a: From Abu Ja'far peace be upon him that the Prophet, peace and blessings be upon him, when he was taken on the Night Journey to the sky said: Gabriel peace be upon him caught up with me and said: O Muhammad, Allah Blessed and Exalted says: \"I have forgiven the Mut'ah practitioners of your Ummah from women\" (7).",
    "foot_note": "1. Wasa'il Al-Shi'a: (21/13).\n2. Previous Source: (21/16).\n3. He is Muhammad bin Muhsin bin Murtada bin Mahmoud famous as Al-Fayd Al-Kashani, Shi'i exegete, among his works: Al-Safi fi Kalam Allah Al-Wafi Al-Kafi Al-Shafi, and Al-Asfa, both in Tafsir. (Mu'jam Al-Mu'allifin 11/175).\n4. Al-'Ard: The human penis. It is said: The hard strong penis. It is said: The 'Ard is the penis when it erects, extends and hardens.\n5. Al-Wafi: (22/663).\n6. He is Grand Ayatollah Master of the Sect Hajj Sayyid Hussein Al-Tabataba'i Al-Burujerdi (d. 1883 AD) (Jami' Ahadith Al-Shi'a).\n7. Jami' Ahadith Al-Shi'a: (21/20).",
    "book_id": "980",
    "new_page_number": 52
  },
  {
    "serial_number": "4588960",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "15 - Also narrated: From Salih bin Uqbah from his father from Abu Ja'far peace be upon him said: I said to him: Does the Mut'ah practitioner have a reward? He said: If he intends by that the Face of Allah Almighty and opposition to those who deny it, he does not speak a word to her but Allah Almighty writes a good deed for him for it, and does not extend his hand to her but Allah writes a good deed for him. If he approaches her, Allah Almighty forgives him a sin for that. If he bathes, Allah forgives him according to the amount of water that passed over his hair. I said: According to the number of hairs? He said: Yes, according to the number of hairs (1).\n\n16 - Sayyid Al-Khwansari (2) narrated in his book Jami' Al-Madarik: From Aban bin Taghlib said: I said to Abu Abdullah peace be upon him: What do I say to her when I am alone with her? He peace be upon him said: Say: I marry in Mut'ah upon the Book of Allah and the Sunnah of His Prophet, neither inheriting nor inherited from, for such and such days, and if you wish such and such years, for such and such dirhams. And you name from the wage what you mutually agreed upon, little or much. If she says: Yes, then she has accepted and she is your woman and you are the most entitled of people to her (3).\n\n17 - Sheikh Hadi Al-Najafi (4) narrated in his book Mawsu'at Ahadith Ahl Al-Bayt: From Al-Saduq raised it to Al-Arif peace be upon him that he said: Not of us is he who does not believe in our Return (Raj'a) and considers our Mut'ah lawful (5).",
    "foot_note": "1. Wasa'il Al-Shi'a: (21/21).\n2. He is Muhammad bin Al-Hussein bin Muhammad Al-Khwansari (attributed to Khwansar from lands of Iran) Shi'i Imami Jamal al-Din jurist, fundamentalist, wise, died in Ramadan (Mu'jam Al-Mu'allifin 9/255).\n3. Jami' Al-Madarik: (4/287).\n4. He is Ayatollah Hajj Sheikh Mahdi Majd Al-Islam Al-Najafi, contemporary (Book: Alf Hadith fi Al-Mu'min).\n5. Mawsu'at Ahadith Ahl Al-Bayt (10/92).",
    "book_id": "980",
    "new_page_number": 53
  },
  {
    "serial_number": "4588961",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "Subsection One\nDiscussing Shi'a Evidences Used for Permissibility of Mut'ah Marriage through Understanding and Narration\n\nFirst: Discussion through Understanding (Dirayah):\n[Their inference with His saying Almighty {So for whatever you enjoy [of marriage] from them, give them their due compensation as an obligation. And there is no blame upon you for what you mutually agree to beyond the obligation} [An-Nisa: 29] as came in the hadith of Abu Ja'far narrated by Sheikh Al-Kulayni in Al-Kafi. The verse implies the linguistic meaning of 'Istimta'' which is pleasure and benefit. The meaning is (So whatever you benefited and enjoyed of intercourse from women by correct marriage) i.e., by its contract. What necessitates this implication is several matters:\n1 - What is mentioned at the beginning and end of the verses is Marriage (Nikah); it moves us from one ruling in marriage to another ruling in it. The verses are focused on clarifying the ruling of correct marriage, and Mut'ah has no mention in them.\n2 - There is a difference between saying (So-and-so married Mut'ah yesterday, and so-and-so enjoyed [istamta'a] marriage). The first refers to temporary marriage, unlike the second which implies nothing but the meaning of benefit and pleasure in known marriage, and the verse structure is of the second type, indicating pleasure.\n3 - Since the word is intended to mean pleasure, something must be implied after it, lest the apparent meaning of the verse implies that anyone who enjoys a woman and gives her wage is permitted to do so, which is impermissible by consensus. Thus, the word (contract) must be implied, which permits pleasure and intercourse, and we attributed the contract to known marriage due to agreement on the correctness of this implication] (1).\nAlso it is said: Allah Almighty did not express in this noble verse using the verbal noun (Istimta') nor the noun (Mut'ah). He did not say, for example, \"So whatever you married by Mut'ah\", otherwise there would be no disagreement. But",
    "foot_note": "1. Nikah Al-Mut'ah p. 301.",
    "book_id": "980",
    "new_page_number": 54
  },
  {
    "serial_number": "4588962",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "He expressed it with the verb form, saying: (FAMAA ISTAMTA'TUM - So whatever you enjoyed). The difference between them is clear. The verb's meaning revolves around pleasure and benefit, as in language books. Imams of language declared that the verb (istamta'a) in this place has no meaning except what we mentioned. The word (istamta'a) appeared in other than this place and did not mean Mut'ah by agreement, as in His saying Glory be to Him {You exhausted your good things in your worldly life and enjoyed [istamta'tum] them} [Al-Ahqaf: 20] meaning you hastened to benefit from them. And He said {so you enjoyed [fastamta'tum] your portion} [At-Tawbah: 69] (meaning you benefited from your luck and share) (1).\nIbn Al-Jawzi said: As for the verse, it did not imply the permissibility of Mut'ah, because He Almighty said in it {seeking with your wealth [marriage], being chaste, not unlawful fornicators}. This indicates correct marriage (2). Enjoyment (Tamattu') does not necessitate Ihsan (being fortified/chaste) according to permissors, since they do not require stoning for one who commits Zina after Mut'ah. Stoning only applies to one who married permanently. Allah Almighty only permitted seeking with wealth what necessitates Ihsan (3).\nSheikh Al-Islam Ibn Taymiyyah said: As for Mut'ah of women which is disputed, there is no explicit text in the verse for its permissibility. For He Almighty said: {And lawful to you are [all others] beyond these, [provided] that you seek them [in marriage] with your property, desiring chastity, not unlawful sexual intercourse. So for whatever you enjoy [of marriage] from them, give them their due compensation as an obligation. And there is no blame upon you for what you mutually agree to beyond the obligation. Indeed, Allah is ever Knowing and Wise (24) And whoever among you cannot [find] the means to marry free, believing women} [An-Nisa: 24-25]. His saying: (So for whatever you enjoy from them) covers everyone with whom marriage is consummated, for he is ordered to be given the full dowry, unlike the divorced woman before consummation who was not enjoyed, for she deserves only half of it. This is His saying Almighty: {And how could you take it while you have gone in unto each other and they have taken from you a solemn covenant} [An-Nisa: 21]. So He made consummation with the contract a cause for establishing the dowry. This shows that specializing temporary marriage with giving the wage without permanent marriage has no meaning; rather giving",
    "foot_note": "1. Al-Jassas li-Ahkam Al-Quran (3/94).\n2. Zad Al-Masir - Ibn Al-Jawzi (1/392).\n3. Nikah Al-Mut'ah p. 303.",
    "book_id": "980",
    "new_page_number": 55
  },
  {
    "serial_number": "4588963",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "the full dowry in permanent marriage is more appropriate. Thus, the verse must indicate permanent marriage, either by specification or generalization. This is indicated by the fact that He mentioned after this the marriage of slave girls, so it is known that what was mentioned was regarding the marriage of free women absolutely. If it is said: A group of the Salaf read: (So whatever you enjoy from them *to a specified term*), it is said: First: This reading is not Mutawatir, and at most it is like Ahad reports; rather it is of the anomalous (Shadh) readings, and we do not deny that Mut'ah was permitted in early Islam, but the speech is about the indication of the Quran on that. Second: It is said: This letter (phrase), if it was revealed, then undoubtedly, it is not established in the famous reading, so it is abrogated. Its revelation would be when Mut'ah was permissible. When prohibited, 'to a specified term' was abrogated. Wage is obligatory if named, and that is if enjoyment to a specified term was lawful. This was in early Islam. There is nothing in the verse indicating that enjoying her to a specified term is lawful, for He did not say: 'And it is permitted for you to enjoy them to a specified term', but said (So whatever you enjoy from them, give them their wages). This covers whatever enjoyment occurred, whether lawful or as in intercourse by mistake (*Wat' Shubha*) (1).\n\nSecond: Discussion through Narration (Riwayah):\nIt is known that the Sahih Hadith according to Sunni jurists is the Musnad Hadith whose chain is connected by the transmission of a just, precise narrator from a just, precise narrator to its end, and is not Shadh (anomalous) or Mu'allal (defective) (2).\nAs for the Sahih Hadith according to Imami Shi'a (3), it is what connects its chain to the Infallible (Ma'sum) by transmission of",
    "foot_note": "1. Minhaj Al-Sunnah (4/187).\n2. Al-Ba'ith Al-Hathith fi Ikhtisar Ulum Al-Hadith by Ibn Kathir p. 21.\n3. The Imami Twelver Shi'a are that sect of Muslims who claimed that Ali is the most entitled to inherit the Caliphate, excluding the Two Sheikhs and Uthman, may Allah be pleased with them all. They were called Imamiyyah because they made Imamate the fundamental issue that occupies them. They were called Twelvers because they asserted twelve Imams, the last of whom entered the cellar in Samarra according to their claim. They are also the counterpart section to Ahl al-Sunnah wal-Jama'ah in their distinct thought and opinions. They work to spread their doctrine to cover the Islamic world. They have Imams sequenced as follows:\n1. Ali bin Abi Talib may Allah be pleased with him, whom they nickname Al-Murtada, the fourth Rightly Guided Caliph and son-in-law of the Messenger of Allah, peace and blessings be upon him. He died by assassination when the Kharijite Abdul Rahman bin Muljam proceeded to kill him in the mosque of Kufa on the 17th of Ramadan 40 AH.\n2. Al-Hasan bin Ali may Allah be pleased with them, nicknamed Al-Mujtaba (d. 50 AH).\n3. Al-Hussein bin Ali may Allah be pleased with them, nicknamed Al-Shahid (d. 61 AH).\n4. Ali Zain Al-Abidin bin Al-Hasan, nicknamed Al-Sajjad (d. 95 AH).\n5. Muhammad Al-Baqir bin Ali Zain Al-Abidin, nicknamed Al-Baqir (d. 114 AH).\n6. Ja'far Al-Sadiq bin Muhammad Al-Baqir, nicknamed Al-Sadiq (d. 148 AH).\n7. Musa Al-Kazim bin Ja'far Al-Sadiq, nicknamed Al-Kazim (d. 183 AH).\n8. Ali Al-Rida bin Musa Al-Kazim, nicknamed Al-Rida (d. 203 AH).\n9. Muhammad Al-Jawad bin Ali Al-Rida, nicknamed Al-Taqi (d. 220 AH).\n10. Ali Al-Hadi bin Muhammad Al-Jawad, nicknamed Al-Naqi (d. 254 AH).\n11. Al-Hasan Al-Askari bin Ali Abd Al-Hadi, nicknamed Al-Zaki (d. 260 AH).\n12. Muhammad Al-Mahdi bin Al-Hasan Al-Askari, nicknamed Al-Hujjah Al-Qa'im Al-Muntazar. They claim the twelfth Imam entered a cellar in his father's house in Surra Man Ra'a and did not return. They differed on his age at disappearance; some said 4 years, some 8 years. However, most researchers hold that he does not exist at all, and is an invention of the Shi'a, calling him (The Non-existent or The Delusion). (Al-Mawsu'ah Al-Muyassarah fi Al-Adyan wa Al-Madhahib wa Al-Ahzab Al-Mu'asirah, Author: World Assembly of Muslim Youth, Supervision: Dr. Mani' bin Hammad Al-Juhani 1/51).",
    "book_id": "980",
    "new_page_number": 56
  },
  {
    "serial_number": "4588964",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "a just, precise narrator from his like in all layers (1). They do not require the chain of the Imam to connect to the Prophet, peace and blessings be upon him, because the saying of the Infallible Imam is in itself a proof and is from him; he is not asked where he took this.\nWe notice that the claim of these Sheikhs that their Imami Shi'a Imams do not speak except from the Sunnah of the Messenger of Allah, peace and blessings be upon him, and that the reliance for them is the speech of the Messenger of Allah, peace and blessings be upon him, and the Scroll seventy cubits long inherited by the Imams from Ali, may Allah be pleased with him, totally contradicts the claim of their other Sheikhs - like their Sheikh Al-Muzaffar and others - that the Imams according to them are not like narrators from the Prophet and transmitters from him, such that their speech is proof because they are trustworthy in narration; rather because they are appointed by Allah Almighty on the tongue of the Prophet to convey",
    "foot_note": "1. Ma'alim Al-Din wa Maladh Al-Mujtahidin by Hasan bin Zain Al-Din Al-Amili p. 216",
    "book_id": "980",
    "new_page_number": 57
  },
  {
    "serial_number": "4588965",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "actual rulings, and they do not rule except by actual rulings with Allah Almighty as they are, via inspiration (*Ilham*), like the Prophet via revelation (*Wahy*), or via reception from the Infallible before him. Accordingly, their clarification of rulings is not of the type of narrating Sunnah and recounting it, nor of the type of Ijtihad in opinion and deduction from sources of legislation; rather they themselves are a source of legislation (1).\nHis Sheikh Al-Hurr Al-Amili, author of (Wasa'il Al-Shi'a), says: That the reason for mentioning the chain and their direction to care for it is merely for blessing by the connection of the chain of oral address, and to remove the criticism of the Commoners - meaning Ahl al-Sunnah - against the Shi'a that their hadiths are not categorized but copied from the principles of their ancients (2).\nHe also said: Rather, it necessitates the weakness of all Hadiths upon verification, because Sahih according to them is: (What a just, Imami, precise narrator narrated in all layers), and they did not stipulate the justice (*Adalah*) of any narrator except rarely; they only stipulated trustworthiness (*Tawthiq*), which definitively does not necessitate justice (3).\nSayyid Abu Talib Yahya bin Al-Hussein bin Harun Al-Alawi Al-Hasani (one of the Zaydi Imams) says: Many of the Twelver chains are built on a foundation with no named men. He said: I have known among their prolific narrators those who deemed it lawful to fabricate chains for disconnected reports if they fell to him. It was told about some of them that he would collect narrations of Borzuya/Buzurjmihr and attribute them to Imams with chains he fabricated. When asked about that, he said: Attach wisdom to its people (4).\nI say: This benefits us that the chains of sources and books of Imami Shi'a specifically (because they are the ones permitting Mut'ah marriage contrary to what Zaydi Shi'a (5) or Ismaili Shi'a",
    "foot_note": "1. Tawthiq Al-Sunnah p 174.\n2. Wasa'il Al-Shi'a: (20/100).\n3. Wasa'il Al-Shi'a (Aal Al-Bayt) (3/260).\n4. Tawthiq Al-Sunnah bayn Al-Shi'a Al-Imamiyyah wa Ahl Al-Sunnah, p 178.\n5. They are followers of Zaid bin Ali bin Al-Hussein bin Ali bin Abi Talib may Allah be pleased with them. They drove Imamate in the children of Fatimah may Allah be pleased with her, and did not permit Imamate in others, except they permitted every Fatimi knowledgeable brave generous man who rose seeking Imamate, to be an Imam obligatory to obey. (Al-Milal wa Al-Nihal by Abu Al-Fath Muhammad Al-Shahrastani).",
    "book_id": "980",
    "new_page_number": 58
  },
  {
    "serial_number": "4588966",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "(1) hold, for they prohibit Mut'ah marriage according to what I found) that their narrations were without rein or halter until people criticized them for that, so they turned then to mentioning the chain. So the chains we see in their narrations were fabricated later and fitted onto texts and taken from the principles of their beliefs, then these chains were described to avoid the criticism of Ahl al-Sunnah. His saying - i.e., Al-Hurr Al-Amili - that Shi'a chains are not categorized makes it not unlikely that whoever undertakes fabricating those chains would place names and men who have no reality. Confirming this speech, and I am certain, that the Imami Shi'a do not have a single Sahih Musnad Hadith except through the chains of Ahl al-Sunnah wal-Jama'ah, evidenced by the fact that there is not a single book among them dedicated to clarifying weak and fabricated Hadiths.\nOne of their scholars, Abu Al-Hasan Al-Mufid bin Al-Hasan Al-Sha'rani - died recently - admitted that many books they have are fabricated, where he said while talking about the book (Sulaym bin Qais); \"The truth is that this book is fabricated for a correct purpose\" (2).\nConclusion: We say all Shi'a Hadiths and narrations permitting Mut'ah marriage absolutely are not correct neither by understanding nor narration. As we will see, there are Hadiths and narrations prohibiting Mut'ah marriage from Shi'a books, rather they agreed with what is authentic in the Six Books. Also, we will mention texts of Shi'a scholars who prohibited Mut'ah marriage in the next section.",
    "foot_note": "1. Attributed to Ismail bin Ja'far Al-Sadiq claiming lineage to him, because his father Ja'far Al-Sadiq designated his Imamate after him and willed it to him, although genealogists agree that Ismail died in his father's lifetime in 145 AH, but Ismailis claim Ismail did not die in his father's lifetime. (Firaq Mu'asirah Tansib ila Al-Islam wa Bayan Mawqif Al-Islam Minha by Dr. Ghalib bin Ali Awaji 2/486)\n2. Tawthiq Al-Sunnah p 176.",
    "book_id": "980",
    "new_page_number": 59
  },
  {
    "serial_number": "4588967",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "Subsection Two\nDoubts Raised About Permissibility of Mut'ah Marriage and Answers to Them\n\n1 - Doubt of Ibn Abbas's Fatwa - may Allah be pleased with them:\nThe Shi'a argue for their permissibility of Mut'ah with the Fatwa of Ibn Abbas may Allah be pleased with them. The answer to it: Proof is only in the saying of Allah and saying of His Messenger, peace and blessings be upon him, and no one has a say after the saying of Allah and His Messenger. Allah Almighty says {Follow what has been revealed to you from your Lord} [Al-A'raf: 3]. The Messenger of Allah, peace and blessings be upon him, said: (Verily I have been given the Book and its like with it) - meaning the Sunnah - (1). So what was revealed to us from our Lord are the two Revelations (Quran and Sunnah), and whoever claims otherwise must provide evidence, and there is no evidence! We do not claim infallibility for Ibn Abbas or anyone else, for infallibility is only for a Prophet {Nor does he speak from [his own] inclination (3) It is not but a revelation revealed} [An-Najm: 3-4]. Some Companions, may Allah be pleased with them, denied it upon him, including:\nAli, may Allah be pleased with him. Muslim extracted in his Sahih from Al-Hasan and Abdullah sons of Muhammad bin Ali from their father from Ali may Allah be pleased with him that he heard Ibn Abbas being lenient regarding Mut'ah of women. He said: (Gently, O Ibn Abbas) (2). Ali said to him: You are a lost man - for the Messenger of Allah, peace and blessings be upon him, forbade it on the day of Khaybar and meat of domestic donkeys) [Narrated by the Two Sheikhs: Bukhari and Muslim].\nAnd Ibn Umar: From Salim bin Abdullah said: Abdullah bin Umar was approached and told Ibn Abbas commands Mut'ah marriage. Ibn Umar said: Glory be to Allah! I don't think Ibn Abbas does this. They said: Yes he commands it. He said: Was Ibn Abbas anything but a small boy? When the Messenger of Allah, peace and blessings be upon him, was alive. Then Ibn Umar said: (The Messenger of Allah, peace and blessings be upon him, forbade us from it,",
    "foot_note": "1. [Narrated by Ahmad from Al-Miqdam bin Ma'd Yakrib may Allah be pleased with him, see Sahih Al-Jami' by Al-Albani (1/516)]\n2. Musannaf Abdul Razzaq Al-San'ani (7/501).",
    "book_id": "980",
    "new_page_number": 60
  },
  {
    "serial_number": "4588968",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "and we were not fornicators) (1).\nFurthermore, Ibn Abbas, may Allah be pleased with them, did not see permissibility of Mut'ah absolutely as Shi'a spread. Sheikh Al-Ahdal says: What is famous from Ibn Abbas is his license in it for the compelled/distressed (*Mudtarr*), not absolutely. Despite this, it was not conceded to him; Ali, Ibn Umar, Ibn Al-Zubayr, Ibn Abi Amrah and others criticized him, and he retracted this saying (2).\nThe evidence that Ibn Abbas only permitted it for the compelled is the Hadith narrated by Imam Al-Bukhari from Abu Jamra who said: I heard Ibn Abbas being asked about Mut'ah of women, and he permitted it. A client (Mawla) of his said to him: That is only in severe condition and scarcity of women or similar. Ibn Abbas said: Yes (3).\nAl-Bayhaqi has via Al-Ismaili: (That was only in Jihad and women were few. Ibn Abbas said: True) [Al-Sunan Al-Kubra by Al-Bayhaqi (7/204)]. What supports that Mut'ah was in severe condition and few women is what the Two Sheikhs extracted from Ibn Masud may Allah be pleased with him said: (We used to raid with the Messenger of Allah, peace and blessings be upon him, having no women. We said: Shall we not castrate ourselves? He forbade us from that, then permitted us to marry a woman for a garment for a term) (4).\nImam Al-Hazimi may Allah have mercy on him said: (As for what is recounted from Ibn Abbas, he was interpreting its permissibility for those compelled to it due to long celibacy and lack of wealth and capability, then he stopped and withheld fatwa on it) (5).\nA group of scholars recounted Ibn Abbas's retraction of this fatwa before his death, among them: Imam",
    "foot_note": "1. Narrated by Al-Tabarani in Al-Awsat and authenticated by Al-Albani.\n2. Nikah Al-Mut'ah by Al-Ahdal (p. 328).\n3. Narrated by Al-Bukhari, Chapter of Prophet's prohibition of Mut'ah marriage finally, (p. 915 Hadith 5116).\n4. Narrated by Two Sheikhs: Bukhari (908/5075) and Muslim (587/3410).\n5. Al-I'tibar by Al-Hazimi (p. 179).",
    "book_id": "980",
    "new_page_number": 61
  },
  {
    "serial_number": "4588969",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "Al-Nawawi (1), (2).\n\n2 - Doubt of Hadith of Imran bin Husayn - may Allah be pleased with him:\nThe Shi'a argue with the Hadith of the noble Companion Imran bin Husayn may Allah be pleased with him which confused many. He said may Allah be pleased with him: (The Verse of Mut'ah was revealed in the Book of Allah, so we did it with the Messenger of Allah, peace and blessings be upon him, and no Quran was revealed prohibiting it, nor did he forbid it until he died. A man said by his opinion what he wished).\nI say: This Hadith is not regarding Mut'ah of Nikah (marriage), but regarding Mut'ah of Hajj (Tamattu') (3). Al-Hafiz Ibn Hajar Al-Asqalani said in his book Fath Al-Bari Sharh Sahih Al-Bukhari regarding: Chapter 'Whoever performs Umrah enjoying it till Hajj', mentioning therein the Hadith of Imran bin Husayn 'The Verse of Mut'ah was revealed in the Book of Allah' meaning Mut'ah of Hajj (4).\nMoreover, Imran bin Husayn himself, the narrator of this Hadith, stated in another narration in Imam Muslim that it is Mut'ah of Hajj. Imran bin Husayn may Allah be pleased with him said: The Verse of Mut'ah was revealed in the Book of Allah and the Messenger of Allah, peace and blessings be upon him, commanded us with it. Then no verse was revealed abrogating the Verse of Mut'ah of Hajj, nor did the Messenger of Allah, peace and blessings be upon him, forbid it until he died. A man said by his opinion afterwards what he wished) (5). And a narration",
    "foot_note": "1. Sharh Muslim by Al-Nawawi (5/202)], Imam Al-Tahawi [Sharh Ma'ani Al-Athar (3/27)], Ibn Al-Arabi Al-Maliki, Abu Bakr Al-Marghinani Al-Hanafi [Al-Hidayah with Sharh Fath Al-Qadir (3/239)], Imam Al-Qurtubi [Al-Jami' li-Ahkam Al-Quran (5/128)], Exegete Al-Razi [Al-Tafsir Al-Kabir (10/51)], Imam Al-Baghawi [Sharh Al-Sunnah (9/239)], Imam Abu Al-Fath Nasr bin Ibrahim Al-Maqdisi [Tahrim Nikah Al-Mut'ah p 203], Imam Al-Subki [Takmilat Al-Majmu' (17/425)], and Imam Al-Mawardi [Al-Hawi Al-Kabir (9/320)].\n2. I quoted the answer to this doubt from the book Al-Kafi Al-Mumti' Al-Mufid by Al-Qatami (p 47:50).\n3. Sahih Al-Bukhari, Chapter (Whoever performs Umrah enjoying it till Hajj) from Book of Quran Commentary (Surah Al-Baqarah) (767/4518). He also included it in Book of Hajj of his Sahih (255/1571), under Chapter (Tamattu' in the time of Messenger of Allah peace be upon him) and did not include it in Book of Nikah.\n4. Fath Al-Bari (8/235).\n5. Narrated by Muslim (521/2980).",
    "book_id": "980",
    "new_page_number": 62
  },
  {
    "serial_number": "4588970",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "another narration also supports this narration, which is from Mutarrif said: Imran bin Husayn said to me: I will tell you a Hadith perhaps Allah benefits you with it: (The Messenger of Allah, peace and blessings be upon him, combined Hajj and Umrah then did not forbid it until he died, and no Quran was revealed prohibiting it) (1).\nAlso narrated Hadith of Imran bin Husayn containing explicit mention of Mut'ah of Hajj (2).\nThe interpretation of this Mut'ah came on the tongue of the Truthful Trusted One, peace and blessings be upon him. From Ibn Abbas may Allah be pleased with them said: The Messenger of Allah, peace and blessings be upon him, said to me: (This is an Umrah we enjoyed (*Istamta'na*) with, so whoever does not have the sacrificial animal let him exit Ihram completely (*Yahil Al-Hill Kullahu*), for Umrah has entered into Hajj until the Day of Resurrection) (3), (4).",
    "foot_note": "1. Narrated by Muslim (520/2974).\n2. Imam Ahmad in Al-Musnad (4/428), Ibn Majah in Al-Sunan Chapter 'Whoever performs Tamattu' with Umrah to Hajj' (2/991), Ibn Sa'd in Al-Tabaqat Al-Kubra (4/290).\n3. Narrated by Muslim (528/3014).\n4. I quoted the answer to this doubt from the book Al-Kafi Al-Mufid Al-Mumti' by Al-Qatami (p 122).",
    "book_id": "980",
    "new_page_number": 63
  },
  {
    "serial_number": "4588971",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "Section Two\nHadiths Prohibiting Mut'ah Marriage from Shi'a Books and Sources\n\n1 - Sheikh Al-Kulayni narrated in his book Al-Kafi: From Ali bin Ibrahim, from his father, from Ibn Abi Umayr, from Ali bin Yaqtin said: I asked Abu Al-Hasan Musa (Al-Kazim) peace be upon him about Mut'ah. He said: What do you have to do with it? Allah has enriched you from it (1).\n\n2 - Al-Hurr Al-Amili narrated in his book Wasa'il Al-Shi'a (Aal Al-Bayt): From Ahmed bin Muhammad Ibn Isa in his (Nawadir): From Ibn Abi Umayr, from Hisham bin Al-Hakam, from Abu Abdullah peace be upon him regarding Mut'ah said: Only the whores (*Fawajir*) do it among us (2).\n\n3 - Al-Fayd Al-Kashani narrated in his book Al-Kafi: From Ali bin Muhammad, from Salih bin Abi Hammad, from Ibn Sinan, from Al-Mughaffal bin Umar said: I heard Abu Abdullah peace be upon him saying regarding Mut'ah: Leave it, is one of you not ashamed to be seen in a place of shame (*Awrah*), bringing that upon the righteous of his brothers and companions? (3).\n\n4 - Imam Zaid (4) narrated in his Musnad, from his father from his grandfather from Ali (PBUH) said: No marriage except with a guardian and two witnesses; it is not for a dirham or two, nor a day or two; that resembles fornication (*Sifah*), and no condition in marriage (5).\n\n5 - Sayyid Al-Burujerdi narrated in his book Jami' Ahadith Al-Shi'a: From Ibn Abi Umayr from Hisham bin Al-Hakam from Abu Abdullah peace be upon him (regarding Mut'ah) said: None do it except",
    "foot_note": "1. Al-Kafi: Chapter It is obligatory to abstain from it for one who is wealthy, (5/452).\n2. Wasa'il Al-Shi'a: Chapter Believing the woman in denying husband and Iddah (21/30).\n3. Al-Kafi: Chapter Dislike of Mut'ah with wealth/independence (21/348).\n4. He is Zaid bin Ali died 122 AH (Al-A'lam by Al-Zirikli 3/56).\n5. Musnad Imam Zaid: Chapter Guardian and Witnesses in Marriage (p. 304).",
    "book_id": "980",
    "new_page_number": 64
  },
  {
    "serial_number": "4588972",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "whores (1).\n\n6 - Qadi Al-Nu'man Al-Maghribi (2) narrated in his book Da'a'im Al-Islam: From Ja'far bin Muhammad (PBUH) that a man asked him about Mut'ah marriage. He said: Describe it to me. He said: A man meets a woman and says I marry you for this dirham and two dirhams, for companionship or a day or two. He said: This is Zina (Fornication). Only a wicked person does this (3).\n\n7 - Al-Fayd Al-Kashani narrated in his book Al-Wafi: From Sahl, from Ibn Asbat and Muhammad bin Al-Hussein together, from Al-Hakam bin Miskin, from Ammar: Abu Abdullah peace be upon him said to me and Sulayman bin Khalid (I have prohibited Mut'ah upon you two from my part as long as you are in Medina because you visit me frequently so I fear you be caught, and it be said these are companions of Ja'far) (4).\n\n8 - Sayyid Hasan Al-Qabanji (5) narrated in his book Musnad Al-Imam Ali (PBUH) from Muhammad bin Al-Hasan with his chain from Muhammad bin Yahya, from Abu Ja'far, from Abu Al-Jawza' from Al-Hussein bin Alwan, from Amr bin Khalid, from Zaid bin Ali, from his fathers, from Ali peace be upon him said: The Messenger of Allah, peace and blessings be upon him and his family, prohibited on the day of Khaybar meat of domestic donkeys and Mut'ah marriage (6).\n\n9 - Sayyid Al-Burujerdi narrated in his book Jami' Ahadith Al-Shi'a: Narration of Zaid, his saying peace be upon him: The Messenger of Allah, peace and blessings be upon him and his family, prohibited on the day of Khaybar meat of domestic donkeys and Mut'ah marriage (7).",
    "foot_note": "1. Jami' Ahadith Al-Shi'a: Chapter Recommendation of choosing a believing knowing and safe chaste woman (21/31).\n2. Al-Nu'man bin Muhammad bin Mansur, Abu Hanifa bin Hayyun Al-Tamimi, called Qadi Al-Nu'man, pillar of Fatimid Da'wah and their sect in Egypt. Broadly knowledgeable in Fiqh, Quran, Adab, History. Born and raised in Kairouan, studied Maliki Fiqh then turned Batini (d. 363 AH).\n3. Da'a'im Al-Islam: Mentioning conditions in marriage (2/229).\n4. Al-Kafi: Chapter Enjoying Virgins and what necessitates from it (21/363).\n5. He is Sayyid Hasan Al-Qabanji, contemporary, author of Musnad Al-Imam Ali (PBUH).\n6. Twenty-Ninth Chapter on Mut'ah Marriage (5/119).\n7. Chapter Honor of Stallion meat when aroused (23/177).",
    "book_id": "980",
    "new_page_number": 65
  },
  {
    "serial_number": "4588973",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "10 - Zaid bin Ali narrated in his Musnad: From his father from his grandfather from Ali (PBUH) said: The Messenger of Allah (SAW) forbade Mut'ah marriage in the year of Khaybar (1).\n\n11 - Sayyid Ja'far Murtada Al-Amili (2) narrated in his book Zawaj Al-Mut'ah: In another hadith from Ali peace be upon him that the prohibition was in Tabuk, and that he said to Ibn Abbas: You are a lost man, and said: I do not find anyone practicing it but I lash him (3).\n\n12 - Sayyid Al-Burujerdi narrated in his book Jami' Ahadith Al-Shi'a: From Ali bin Ibrahim from his father from Ibn Umar from Ali bin Yaqtin said: I asked Abu Al-Hasan Musa peace be upon him about Mut'ah. He said: What do you have to do with it? Allah has enriched you from it.\n\n13 - Al-Hurr Al-Amili narrated from Ali bin Abi Talib may Allah be pleased with him said: The Messenger of Allah, peace and blessings be upon him, prohibited on the day of Khaybar meat of domestic donkeys and Mut'ah marriage (4).\n\n14 - Al-Siyaghi Al-San'ani (5) narrated from Zaydi Shi'a paths in Musnad Imam Zaid bin Ali from his father from his grandfather Ali may Allah be pleased with him said: (The Messenger of Allah, peace and blessings be upon him, forbade Mut'ah marriage in the year of Khaybar) (6).\n\n15 - Also narrated with his chain from Abdullah bin Al-Hasan from his father from his grandfather from Ali may Allah be pleased with him: (The Messenger of Allah, peace and blessings be upon him, prohibited Mut'ah of women on the day of Khaybar and said I do not find anyone practicing it but I lash him). Al-Siyaghi said: (Perhaps his saying: I do not find anyone practicing it but I lash him is from the saying of Ali may Allah be pleased with him (7).",
    "foot_note": "1. Chapter Guardian and Witnesses in Marriage p. 305.\n2. He is Sayyid Ja'far Murtada Al-Amili, contemporary, author of Kitab Zawaj Al-Mut'ah.\n3. (1/267).\n4. Kitab Wasa'il Al-Shi'a (Aal Al-Bayt), Al-Hurr Al-Amili (21/12).\n5. He is Al-Hussein bin Ahmed bin Al-Hussein Al-Siyaghi: Jurist of Zaydi notables in Yemen, born and died in Sana'a. Among his books (Al-Rawd Al-Nadir) Fiqh, explaining Musnad Imam Zaid bin Ali, a precious explanation, incomplete (Al-A'lam by Al-Zirikli 2/232).\n6. Al-Rawd Al-Nadir by Al-Siyaghi Al-San'ani - Zaydi scholar - (4/213).\n7. Previous Source (4/413).",
    "book_id": "980",
    "new_page_number": 66
  },
  {
    "serial_number": "4588974",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "16 - Al-Kulayni narrated from Ali bin Yaqtin said: I asked Abu Al-Hasan (Imam Al-Kazim) about Mut'ah. He said: What do you have to do with it? Allah has enriched you from it (1).\n\n17 - Also narrated by Al-Kulayni from Ammar said: Abu Abdullah (Imam Al-Sadiq) peace be upon him said to me and Sulayman bin Khalid: I have prohibited Mut'ah upon you two (2).\n\n18 - Also narrated from Abu Abdullah (Imam Al-Sadiq) said about Mut'ah: Leave it, is one of you not ashamed to be seen in a place of shame (*Awrah*), bringing that upon the righteous of his brothers so his companions? (3).\n\n19 - Al-Hurr Al-Amili narrated from Abdullah bin Sinan said: I asked Abu Abdullah (Imam Al-Sadiq) about Mut'ah. He said: Do not soil yourself with it (4).\n\n20 - Al-Majlisi (5) narrated in his book (Bihar Al-Anwar) that Ja'far bin Muhammad (Imam Al-Sadiq) was asked about Mut'ah. He said: Only the whores (*Fawajir*) do it among us (6).\n\n21 - From Ismaili Shi'a paths the Hadith also came: Qadi Al-Maghribi author of Da'a'im Al-Islam narrated from Ja'far bin Muhammad that a man asked him about Mut'ah marriage. He said: Describe it to me. He said: A man meets a woman and says I marry you for this dirham and two dirhams, for an occurrence or a day or two. Al-Sadiq said: This is Zina (Fornication) and only a wicked person does this (7).\n\n22 - Also narrated by Qadi Al-Maghribi from the Messenger of Allah, peace and blessings be upon him and his family, that he prohibited Mut'ah marriage. From Ali may Allah be pleased with him that he said: No marriage except with a guardian and two witnesses, and it is not",
    "foot_note": "1. Al-Kafi by Al-Kulayni (5/452) - Al-Wasa'il by Al-Amili (14/441).\n2. Al-Furu' min Al-Kafi by Al-Kulayni (2/48) - Al-Wasa'il by Al-Amili 14/450.\n3. Al-Kafi by Al-Kulayni 5/453 - Bihar Al-Anwar by Al-Majlisi (100/311).\n4. Al-Wasa'il by Al-Amili (14/450) - Mustadrak Al-Wasa'il by Al-Tabarsi (14/455).\n5. He is Muhammad bin Baqir bin Muhammad Taqi bin Maqsud Ali Al-Asfahani: Imami scholar, held Sheikh of Islam position in Isfahan, translated a large collection of hadiths into Persian (d. 1111 AH) (Al-A'lam by Al-Zirikli 6/48).\n6. Bihar Al-Anwar by Al-Majlisi (15/318), Al-Wasa'il by Al-Amili (14/456).\n7. Da'a'im Al-Islam by Qadi Al-Maghribi (2/229).",
    "book_id": "980",
    "new_page_number": 67
  },
  {
    "serial_number": "4588975",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "for a dirham or two, nor a day or two, that is fornication (*Sifah*), and no condition in marriage (1).\n\n23 - This Hadith also came from Zaydi Shi'a paths in Musnad Imam Zaid from his father from his grandfather from Ali peace be upon him said: No marriage except with a guardian and two witnesses, not for a dirham or two, nor a day or two resembling fornication, and no condition in marriage - meaning the condition of timing (2)",
    "foot_note": "1. Da'a'im Al-Islam by Qadi Al-Maghribi (2/228).\n2. Al-Rawd Al-Nadir by Al-Siyaghi Al-San'ani (4/206).",
    "book_id": "980",
    "new_page_number": 68
  },
  {
    "serial_number": "4588976",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "Section Three\nTexts of Shi'a Scholars Who Prohibited Mut'ah Marriage\nHere it must be noted that there are texts from them - from their own books - confirming explicitly that Mut'ah marriage is Haram (Prohibited). The Messenger of Allah, peace and blessings be upon him, prohibited it, and Ali bin Abi Talib, Al-Hasan, Al-Hussein, Ali Zain Al-Abidin, and Zaid bin Ali, may Allah be pleased with them, prohibited it, even Ja'far Al-Sadiq!!\nTheir Sheikh Al-Tusi mentioned in his book \"Al-Istibsar\" (3), and \"Tahdhib Al-Ahkam\" (4), and also their Sheikh Al-Hurr Al-Amili in \"Wasa'il Al-Shi'a\" (5), via Zaid bin Ali Zain Al-Abidin, from his fathers from Ali, peace be upon them, said: The Messenger of Allah, peace and blessings be upon him, prohibited on the day of Khaybar meat of domestic donkeys and Mut'ah marriage (6).\nBut the Sheikh of the Sect (Twelvers) Al-Tusi did not find a way to escape the proof of this text",
    "foot_note": "3. (3/202), Hadith number (511).\n4. (7/226) Hadith number (1085).\n5. (14/441).\n6. This text appearing in their approved books from Ali bin Abi Talib, may Allah be pleased with him, also came with the same text and letters in the most authentic Sunni books from Ali as well, as narrated by Al-Bukhari and others, as will come.",
    "book_id": "980",
    "new_page_number": 69
  },
  {
    "serial_number": "4588977",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "except by carrying it on *Taqiyyah* (dissimulation) (1). He says: \"For this narration came as Taqiyyah and according to what the opponents of Shi'a go to. Knowledge is obtained for everyone who heard the reports that the religion of our Imams (sic!) is permitting Mut'ah, so no need to elaborate on it\" (2).\nHe says in another place: \"The way regarding this narration is to carry it on Taqiyyah; because it agrees with the schools of the masses (Sunnis)...\"!! End quote (3).\nFor this extremism, they fabricated a narration attributing it to Al-Sadiq: \"Not of us is he who does not believe in our Return (Raj'a), and does not consider our Mut'ah lawful\" (4) (5).\nFor that, their Sheikh Al-Hurr Al-Amili said that permissibility of Mut'ah is of the essentials of the Imami sect (6)!!\nProhibition also came from Abu Abdullah peace be upon him. It came in \"Wasa'il Al-Shi'a\" (7) from Abu Abdullah peace be upon him regarding Mut'ah said: \"Only the whores (*Fawajir*) do it among us\" (8)!!\nRather, as we saw previously, one of their Imams, when asked by one of their narrators: \"Would it please you that your women, daughters, sisters, and cousins do it (Mut'ah)? He turned away from him peace be upon him when he mentioned his women and cousins.\" How do we reconcile this with the alleged saying of Al-Sadiq: \"Not of us is he who does not permit our Mut'ah\", and that it is of the essentials of the sect! While their Mut'ah is among",
    "foot_note": "1. Meaning that Zaid, his fathers, and Ali were all cowards before Ahl al-Sunnah!!\n2. Tahdhib Al-Ahkam: (7/226), and see: Wasa'il Al-Shi'a: (14/441).\n3. Al-Istibsar: (3/202).\n4. Meaning according to them the return of Imams to the world at end of times.\n5. Man La Yahduruhu Al-Faqih: (3/334), Chapter of Mut'ah. Ibn Babawayh mentioned this narration without chain!!!\n6. Wasa'il Al-Shi'a: (14/441), meaning it is not the sect of Ahl al-Bayt Imams, but the sect of Imami Sheikhs.\n7. (14/456), and Bihar Al-Anwar: (100/317).\n8. We say to these Shi'a after this declaration from Imam Al-Sadiq: Can we after that believe the claim of Shi'a like Aal Kashif Al-Ghita and Al-Fakiki and others; where they said: \"And from our reliable paths from Ja'far Al-Sadiq (PBUH) that he used to say: Three I do not practice Taqiyyah in: Mut'ah of Hajj, Mut'ah of women, and Wiping over leather socks\"!! (Asl Al-Shi'a wa Usuluha: p. 203, and Al-Mut'ah by Al-Fakiki: p. 59). Look at this contradiction in their narrations and sayings!!",
    "book_id": "980",
    "new_page_number": 70
  },
  {
    "serial_number": "4588978",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "the best deeds to Allah as mentioned before (1)!!\nWe also find that Imami jurists who give fatwa permitting Mut'ah and recommending practicing it; do not accept something like this for their daughters, sisters, and female relatives! Rather they see it as humiliating and shameful, contradicting family dignity and honor. Blood might spill in some Shi'a areas if a person asks such a thing from a jurist who is master of his people (2).\nTheir Sheikh Muhammad Jawad Mughniya - who was in his life head of Ja'fari Court in Beirut - says: \"Mut'ah is not common in their lands. The common marriage among them is the permanent marriage known and familiar to all sects and nations. It has no trace in their Sharia courts\", \"Shi'a of Syria, Lebanon, and Iraq did not use Mut'ah. It is reported that some elderly women in Iran use Mut'ah\" (3).\nThere are other texts among them regarding Mut'ah representing cohesion and harmony with the Ummah's groups. This Abu Abdullah Ja'far Al-Sadiq whom they attribute permission of Mut'ah to; we find him rebuking his companions for committing this Mut'ah, saying: \"Leave it, is one of you not ashamed to be seen in a place of shame, bringing that upon the righteous of his brothers and companions?\" (4).\nHe considered committing Mut'ah as soiling the soul; from Abdullah bin Sinan said: I asked Abu Abdullah peace be upon him about Mut'ah. He said: \"Do not soil yourself with it\" (5). Their texts decided that Mut'ah is a source of humiliation for the woman, saying: \"Do not do Mut'ah with a believing woman thus humiliating her\" (6). Their texts warn against effects of Mut'ah on family. We find their eighth Imam",
    "foot_note": "1. See: Previous section on Hadiths they used for permissibility of Mut'ah marriage.\n2. See: Al-Shi'a wa Al-Tashih: (p. 113) by Dr. Musa Al-Musawi (Pub. Los Angeles 1988).\n3. Al-Shi'a fi Al-Mizan: (p. 358).\n4. Al-Kafi: (5/453) Chapter It is obligatory to abstain from it for one who is wealthy!! (Dar Al-Adwa'), Wasa'il Al-Shi'a: (14/450). The commentator of Al-Kafi says in margin regarding: (seen in place of shame): \"Meaning people see him in a place they fault finding him in due to their dislike of Mut'ah, so that becomes cause for harm to him and his brothers and companions agreeing with him in sect\" End quote. (5/453).\n5. Bihar Al-Anwar: (100/318), Wasa'il Al-Shi'a: (14/450) (Margin).\n6. Tahdhib Al-Ahkam: (7/227), Hadith number (1089), and Al-Istibsar: (3/204).",
    "book_id": "980",
    "new_page_number": 71
  },
  {
    "serial_number": "4588979",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "Ali Al-Rida complaining about his followers urging him for permission in Mut'ah marriage. The reason for his not permitting them was fear that Shi'a women would disbelieve and curse whoever permitted Mut'ah because their men would be busy with Mut'ah away from them. Abu Al-Hasan peace be upon him wrote to some of his clients: \"Do not insist on Mut'ah, you only have to establish Sunnah (permanent marriage). Do not busy yourselves with it from your beds and free wives, so they disbelieve and disown and supplicate against the one commanding that and curse us\" (1).\nWe find their Infallible Imam rebuked the questioner about Mut'ah while he was permanently married. From Ali bin Yaqtin said: I asked Abu Al-Hasan peace be upon him about Mut'ah; He said: \"What do you have to do with it, Allah has enriched you from it\" (2). This Imam Al-Sadiq did not suffice with rebuking his companions for committing this Mut'ah as we saw previously, but explicitly prohibited it; from Ammar said: Abu Abdullah peace be upon him said to me and Sulayman bin Khalid: \"I have prohibited Mut'ah upon you two\" (3)!!\nAl-Sadiq admitted Mut'ah is Zina; it was said to Abu Abdullah peace be upon him: Why are there four witnesses in Zina and two in murder? He said: Allah made Mut'ah lawful for you, and knew it would be denied upon you, so He made four witnesses as a precaution for you. Were it not for that, it would have been brought against you (punishment), and rarely do four agree on testimony of one matter (4).\nThis is an explicit admission from Al-Sadiq that Mut'ah is Zina. If it weren't so; why if four witnesses gathered and testified that so-and-so did Mut'ah, the Hadd of Zina is established on him? As long as it is Halal, there is no harm if a thousand witnesses testify to it while it is Halal (5).\nRather, Imami Shi'a mention that Abu Ja'far the Second turned away from the questioner who discussed Mut'ah with him when he mentioned his women and cousins. If Mut'ah is Halal, nay among best deeds; why does the ninth Imam Muhammad bin Ali bin Musa not approve it for his family?! Does he permit it for his followers and not allow it for his household?! Is there a proof - and they acknowledge it - more eloquent than this regarding",
    "foot_note": "1. Al-Kafi: (5/453), Wasa'il Al-Shi'a: (14/450).\n2. Al-Kafi: (5/452), Wasa'il Al-Shi'a: (14/449).\n3. Al-Kafi: (5/467), Wasa'il Al-Shi'a: (14/450).\n4. Man La Yahduruhu Al-Faqih: (3/38), Wasa'il Al-Shi'a: (14/439), Ilal Al-Shara'i': (p. 509, 510).\n5. Al-Shi'a wa Al-Mut'ah by Prof. Muhammad Malallah: (p. 24) (4th Ed, Maktabat Ibn Taymiyyah, 1413 AH).",
    "book_id": "980",
    "new_page_number": 72
  },
  {
    "serial_number": "4588980",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "Ahl al-Bayt's hatred for Mut'ah (1)?!\nAl-Sadiq counted women who do that as whores (*Fawajir*) (2).\nAll these narrations - which are Imami Shi'a narrations - show us clearly that Ahl al-Bayt - may Allah be pleased with them - do not approve this corrupt marriage, but forbid it and do not allow it. As for the opposition of Imami Sheikhs in this issue, it has no value; because they are accustomed to this opposition. Whoever investigates history finds that these Shi'a throughout ages were not sincere in loyalty to Aal al-Bayt as they claim, but were a burden upon them (3) (4).",
    "foot_note": "1. See: Previous Reference: (p. 40).\n2. This completely agrees with what was narrated via Ahl al-Sunnah from Imam Al-Sadiq where Al-Bayhaqi reported from Ja'far bin Muhammad that he was asked about Mut'ah and said: It is Zina itself (Nayl Al-Awtar: 6/271). Expansion on Sunni hadiths prohibiting Mut'ah marriage will come in Chapter Two of this section.\n3. Al-Shi'a wa Al-Mut'ah: (p. 41). See for expansion Imam Ali's complaint about his Shi'a and their betrayal and disobedience: Nahj Al-Balagha: (p. 69, 70) (Sermon 27). See Ja'far Al-Sadiq's complaint of many liars against him in his time claiming his love: Rijal Al-Kashshi: (259, 196, 257, 258).\n4. The researcher copied this entire section with its footnotes from the book Tawthiq Al-Sunnah bayn Al-Shi'a Al-Imamiyyah wa Ahl Al-Sunnah fi Ahkam Al-Imam wa Nikah Al-Mut'ah, prepared by Ahmed Harith Suhaimi, a Master's thesis discussed at Faculty of Dar Al-Ulum, Cairo University in 1998 AD.",
    "book_id": "980",
    "new_page_number": 73
  },
  {
    "serial_number": "4588981",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "Chapter Three\nThe Corruptions and Effects Resulting from Permitting Mut'ah Marriage\nIt includes three sections:\nSection One: Social Effects\nSection Two: Psychological Effects\nSection Three: Health Effects",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 74
  },
  {
    "serial_number": "4588982",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Temporary Marriage: A Study of Narration and Understanding",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "Chapter Three\nThe Corruptions and Effects Resulting from Permitting Mut'ah Marriage\nUndoubtedly, everyone who opposes the Sharia of Allah Almighty and the Sunnah of His Prophet, peace and blessings be upon him, destroys himself and loses this world and the Hereafter. For Allah's Sharia came to achieve interests or increase them and repel corruptions or minimize them. Corruption only appeared on earth due to opposing our Sharia. Allah Almighty said: {Corruption has appeared throughout the land and sea by [reason of] what the hands of people have earned so He may let them taste part of [the consequence of] what they have done that perhaps they will return} [Ar-Rum: 41]. Allah Almighty said: {So let those beware who dissent from the Prophet's order, lest fitnah strike them or a painful punishment.} [An-Nur: 63]. Peace and blessings be upon him said: \"Leave me as I have left you, for those before you were destroyed by their many questions and their disagreement with their prophets. So if I forbid you from something, avoid it, and if I command you with something, do of it what you can.\" (1).",
    "foot_note": "1. Narrated by Al-Bukhari (9/94), and Muslim (2/975).",
    "book_id": "980",
    "new_page_number": 75
  },
  {
    "serial_number": "4588983",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Hadiths and Reports Related to Temporary Marriage (Mut‘ah): Analysis and Transmission",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "Section One: Social Consequences. Among the essential necessities that Islamic law came to preserve is the protection of lineage. For this purpose, Allah legislated marriage and encouraged it, saying: {So marry those that please you of women, two or three or four} [An-Nisa: 3]. Conversely, He prohibited adultery, saying: {And do not approach adultery. Indeed, it is ever an immorality and an evil way} [Al-Isra: 32]. Preserving lineage is one of the distinctions that separates human beings from animals. When a thoughtful person reflects on the consequences of temporary marriage (mut‘ah), he finds many harms that contradict the Sharia. Among them is the loss of children: if a man's offspring are scattered in every town, he cannot raise them, and they grow up without proper upbringing, similar to children born of adultery. \n\nAnother consequence is the possibility that the son may unknowingly engage in temporary marriage or permanent marriage with a woman previously engaged by his father, or vice versa. Worse still, it may lead to sexual relations with direct female relatives such as one’s daughter, granddaughter, son's daughter, sister, or sister's daughter in certain situations—particularly over a long period. This is among the gravest prohibitions. The reason is that knowing whether a woman engaging in mut‘ah has conceived within a month or more is uncertain—especially if the mut‘ah occurred during long travel, with a new temporary marriage taking place at each stop. Each encounter could produce a child, and years later—perhaps fifteen years—the man, his brothers, or his sons may pass through the same places and unknowingly engage in mut‘ah or marriage with those daughters. \n\nThe Lebanese Shi'i magazine \"Al-Shira‘\" (Al-Shiraa) wrote that the President of the Islamic Republic of Iran pointed to the existence of a quarter million foundlings in Iran due to temporary marriage. Dr. Shahla Haeri also mentioned in her book *Mut‘ah: Temporary Marriage in Shi‘a Islam* a case…",
    "foot_note": "1. Al-Shiraa Magazine, issue (684), fourth year, p. 4.",
    "book_id": "980",
    "new_page_number": 76
  },
  {
    "serial_number": "4588984",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "Iran 1978 - 1982, and her book is a documented academic study written by the granddaughter of Ayatollah Haeri. She says: The city of Mashhad, where the practice of Mut'ah marriage was common, is the most morally dissolute city in Asia (1). The matter even reached the Shia clergy. Dr. Shahla Haeri mentioned a situation regarding a Shia cleric whose job was a religious preacher \"Akhoond\" [in Persian], whom she met by chance at the shrine of Imam Reza in Mashhad in the summer of 1978, and his name was (Mullah Hashem). She says: Mullah Hashem felt no embarrassment in telling me that since moving to Mashhad, he secretly contracts Mut'ah marriages frequently and regularly. He even said: (In my village in the north, no one practices Mut'ah marriage because it brings shame), but as soon as he arrived in Mashhad, he began practicing Mut'ah marriage. It seemed to me that he was boasting about the frequency of his temporary marriages, as he contracts a Mut'ah marriage once or twice a month, without his wife's knowledge. But when I asked him if he was willing to allow his sixteen-year-old daughter to contract a Mut'ah marriage, he answered firmly, \"Never.\" Among the corruptions and effects resulting from the permissibility of Nikah Mut'ah is what appeared in some narrations from Shia book sources: That there is no need to ask the woman with whom one engages in Mut'ah if she is married or immoral; rather, Nikah Mut'ah is realized by giving her the dowry without the need to ask her if she is married or not!!! Al-Kulayni narrated in his book Al-Kafi: From a number of our companions, from Ahmad bin Muhammad bin Khalid, from Muhammad bin Ali, from Muhammad bin Aslam, from Ibrahim bin Al-Fadl, from Aban bin Taghlib who said: I said to Abu Abdullah (peace be upon him): I am on some roads and I see a beautiful woman, and I am not safe from her being married or one of the prostitutes? He said: This is not upon you; you only have to believe what she says about herself (2).",
    "foot_note": "1. Mut'ah: Temporary Marriage among the Shia, p. 203.\n2. Al-Kafi: (5/462).",
    "book_id": "980",
    "new_page_number": 77
  },
  {
    "serial_number": "4588985",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "Al-Tusi also narrated in his book Tahdhib Al-Ahkam: From Muhammad bin Ahmad bin Yahya, from Ali bin Al-Sindi, from Uthman bin Isa, from Ishaq bin Ammar, from Fadl, the mawla of Muhammad bin Rashid, from Abu Abdullah (peace be upon him) who said: I said, I married a woman via Mut'ah, then it occurred to me that she has a husband, so I investigated that and found she had a husband. He said: And why did you investigate?! (1) Among the corruptions is that it is a door to suspending valid marriage. When it becomes easy for a person to satisfy his lust with a woman for a specific wage, driven by the urge of sexual liberation, to evade the responsibilities and obligations necessitated by valid marriage, this becomes a cause for turning away from it (valid marriage), and a tool for severing family ties upon which human societies are built. It is a path to cutting off offspring and mixing lineages, because the woman who has made renting herself to men her profession prevents pregnancy between her and this profession by using every means leading to the prevention of pregnancy, and thus the offspring, which is the greatest purpose of marriage, is cut off. Sheikh Muhammad Thabit Al-Masri mentioned in his book (A Tour in the Regions of the Near East) speaking to us about his visit and what he witnessed there of the effects of Mut'ah, saying: (My attention was drawn in Najaf to many children wearing special rings in their ears, which is a sign that they are offspring of Mut'ah marriage which is spread among all Shia, especially in Persia. In the Hajj season, when a visitor stays at a hotel, a broker meets him offering him the matter of Mut'ah for a specific wage. If he accepts, the man brings him a group of girls to choose from, and then he goes with her to a scholar to read the marriage contract formula and determine its duration, which varies between hours, months, and years. The girl may marry multiple times in a single night. The custom is for the husband to pay about fifteen piastres for an hour, seventy-five piastres for a day, and about four pounds for a month. There is no shame for anyone in that act because it is legitimate, and no shame whatsoever attaches to the offspring. When the marriage period ends, the couple separates, and the woman does not wait to observe Iddah, but marries one day after that (2).",
    "foot_note": "1. Tahdhib Al-Ahkam: (7/253).\n2. Nikah Al-Mut'ah: Study and Investigation, p. 359.",
    "book_id": "980",
    "new_page_number": 78
  },
  {
    "serial_number": "4588986",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "Among the social corruptions as well: There are many similarities between Mut'ah of women and prostitution: 1 - (Mut'ah marriage is based on offer and acceptance, and so is prostitution. 2 - There is no consideration for the guardian's permission in Mut'ah marriage, and so is prostitution. 3 - There is no announcement for Mut'ah marriage, as it is done in secret, and so is prostitution, which mostly happens in secret. 4 - There is no consideration for duration in Mut'ah marriage; it may be a year, a month, a day, perhaps an hour or two, and it may be the duration of a single act of intercourse, and so is prostitution. 5 - There is no dwelling, no stability, and no Ihsan (chastity/fortification) in Nikah Mut'ah, and so is prostitution) (1). There are common lists between them in terms of motives; those motives you find in Mut'ah of women, you see present in prostitution. 6 - (If the material motive is one of the woman's original motives for attending the Mut'ah marriage contract is money, as stated by Shia jurists (2), then it is not a coincidence to find the same motive present in the woman who practices prostitution, where she works to rent herself to every willing person and mostly to the one who pays more. 7 - If Mut'ah is based on supply and demand, whether this deal is concluded through the woman being enjoyed offering her commodity, or through the man's request for this commodity, then prostitution runs the same course. The more beauty a woman has, the greater her wage, especially if she is a virgin; the same is the case for the woman in prostitution) (3). 8 - (And if the woman being enjoyed is rented and her private part represents the subject of the lease, as decided by Shia jurists, then likewise the woman who practices prostitution is considered rented to the man who",
    "foot_note": "1. Nikah Al-Mut'ah Between Permissibility and Prohibition, Dr. Ahmad Abu Al-Shabab, p. 231.\n2. Mut'ah: Temporary Marriage among the Shia, Dr. Shahla Haeri, p. 119.\n3. Nikah Al-Mut'ah Between Permissibility and Prohibition, Dr. Ahmad Abu Al-Shabab, p. 232.",
    "book_id": "980",
    "new_page_number": 79
  },
  {
    "serial_number": "4588987",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "rented her with his money, or more correctly, who rented her sexual organs, the subject of the lease. 9 - If Shia legislation and jurisprudential rulings require the woman being enjoyed to compensate the man by returning the wage he gave her or part of it if she breaches the conditions of the contract, such as not coming to him as agreed some times to have sex with her, then in prostitution too - as is known - the woman must return the wage to the man if she refuses to have sex with him) (1). 10 - (If the woman in Mut'ah marriage enjoys absolute legal independence - whether she is previously married (Thayyib) or a virgin living with her parents - considering that she \"is the lessor and the subject of the lease at the same time, so she is the one who negotiates with the man about the conditions of the contract. This does not differ from a technical point of view from any other lease contract, in which specific people are hired because of their expertise, and in which work is exchanged for money. In the case of temporary marriage, what is exchanged is the \"right\" to use the woman's sexual organ, not her labor. As Dr. Haeri mentioned in one of the interviews she conducted, the temporary marriage contract resembles \"renting a car\") (2). (And during the negotiation of the contract terms, a specific wage and a specific duration are agreed upon, and perhaps a specific method of sexual practice. So what is the difference between this and prostitution, since the woman, whether previously married or a virgin, possesses absolute independence in negotiation and has absolute freedom to accept or refuse and set the price that suits her for renting her sexual organs? 11 - And if the woman in Mut'ah marriage turns away - in some cases - from the dowry, not caring if she receives a wage or material compensation or not, due to the sexual motive, that is because her primary goal in such a case is limited to satisfying her sexual desires,",
    "foot_note": "1. Nikah Al-Mut'ah Between Permissibility and Prohibition, Dr. Ahmad Abu Al-Shabab, p. 232.\n2. Haeri: Mut'ah: Temporary Marriage among the Shia, p. 107.",
    "book_id": "980",
    "new_page_number": 80
  },
  {
    "serial_number": "4588988",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "especially if her partner possesses striking attractiveness, and she might pay him money to have sex with her) (1). (Likewise, you find the same image present in some forms and shapes of prostitution where the woman intentionally pays some money to her partner to have sex with her, when lust overwhelms her. 12 - And if the wage is determined in Mut'ah marriage according to the availability of certain conditions \"the more beautiful the woman, the higher her dowry, and if she is a beautiful, young virgin, it is certain she will get a good dowry. But if she does not possess these specifications, she accepts anything the man offers her (2). The matter in prostitution does not differ in any detail; the more beautiful the girl, the higher her wage, and she is luckier) (3). 13 - (And if jurisprudential legislations allow what is known as group Mut'ah marriage, which permits the gathering of a group of men on a single woman (4), then what is the difference between what happens in such a marriage and prostitution?! Asharq Al-Awsat newspaper mentioned press reports: Maryam recounts, revealing the bitterness of her experience, saying: \"It is not just me or my children who are victims of the Houses of Chastity (Buyut al-Iffah). They have increased in recent years, and the matter has gone beyond individual cases to become a phenomenon sponsored by the Imams of mosques and shrines in Iran due to the increasing cases of divorce after the wife discovers that the husband has contracted 'Sigheh', i.e., temporary marriage in the Iranian way.\"",
    "foot_note": "1. See some of these examples presented by Dr. Shahla Haeri in her book, Mut'ah: Temporary Marriage, pp. 236 and 239.\n2. Haeri: Mut'ah: Temporary Marriage, p. 195.\n3. Nikah Al-Mut'ah Between Permissibility and Prohibition, Dr. Ahmad Abu Al-Shabab, p. 234.\n4. Previous source, p. 149.",
    "book_id": "980",
    "new_page_number": 81
  },
  {
    "serial_number": "4588989",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "It also mentioned: \"There is sexual chaos threatening the structure of society, of which women form the most important pillars. They are the most popular commodity in the markets of Qom, Mashhad, and Tehran; I do not know the extent of its popularity in other provinces. Children are the biggest victims, and the result of this marriage is foundling children, as Tehran and its cities contain more than (2500) street children, victims of some clerics. With every signing of a Mut'ah marriage document in the Iranian way - there is a signing of a document destroying a human being, male or female, for a sum that becomes a prelude to destroying the life of a human or an innocent child (1). It also mentioned a \"Tsunami\" of divorce striking Iran and causing a collapse every three minutes (2). A new study sounded the alarm in Iran about a divorce \"tsunami\" after its rates exceeded marriage, recording 18.6 divorce cases per hour, which means a family collapse every 3 minutes, despite the absence of official statistics on the disputes storming the Iranian family structure, which has witnessed major transformations according to sociologists. According to the new statistics, divorce increased by 4.2 percent compared to a decline in marriage by about 3.4 percent in the last nine months.",
    "foot_note": "1. Asharq Al-Awsat Newspaper - Report: Roshan Qassem (18/4/2016).\n2. (According to a study examining the conditions of Iranian society during the last two decades, London: Adel Al-Dali 13/1/2016).",
    "book_id": "980",
    "new_page_number": 82
  },
  {
    "serial_number": "4588990",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "The Second Topic: Psychological Effects\nFailure to evaluate the inheritance of the perpetrator of Mut'ah, as his heirs are not known, nor their number, names, or locations, so the matter of inheritance must be suspended. Likewise, the inheritance of those born of Mut'ah must be suspended, for their fathers and brothers are unknown, and inheritance cannot be divided unless the heirs are exclusively enumerated, and assigning a share of shares is impossible unless the attributes of the heirs such as masculinity, femininity, blocking (hajb), and deprivation are known (1). Among the psychological effects is what Dr. Shahla Haeri mentioned: A situation regarding Mullah Hashem, that he says: Women often take the initiative to offer a Mut'ah marriage contract to a man. He described to me in detail the methods women use to inform him of their desires. He says: The woman might stare at him directly, or ask him to read some Quranic verses for her, or to pray for her with a Quranic Istikhara. If these methods fail, some women resort to the direct method, so the woman approaches him and tells him a conventionally known phrase, and in Mullah Hashem's expression, \"This is what will remain a secret between us.\" He says: Many women perform this act (i.e., Mut'ah), seeking its religious reward, and sometimes the woman does not receive any money in return. To confirm his words, he added: \"Yesterday a woman asked me to perform Istikhara for her. I responded to her request, so she asked me for a second one. After the third Istikhara, I asked her the reason for her presence with me, and she said she wanted to earn religious reward (through contracting Mut'ah marriage) and that she was also ready to pay one hundred Tomans, but I refused her offer. She was not the type I like; she was an old woman\"!!. She even said: Mullah Hashem was happy in his religious job, and told me repeatedly that he cannot \"refuse God's blessing,\" meaning an offer from a woman to contract a Mut'ah marriage. The duration of any Mut'ah contract did not exceed two or three hours. He says he used to visit women in homes previously, but these days, i.e., 1978, I do not go to homes, fearing the possibility of falling into a trap.\" He was referring to the escalation of the conflict between the religious establishment and the Pahlavi regime, and he feared",
    "foot_note": "1. Mut'ah Between Permissibility and Prohibition, p. 201.",
    "book_id": "980",
    "new_page_number": 83
  },
  {
    "serial_number": "4588991",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "that Mut'ah marriage would be exploited to bring shame upon the clergy (1). I said: What a great psychological impact for a man to betray his wife, and the resulting great effects and corruptions of destroying homes and the dissolution of societies. If Mut'ah marriage is permissible and lawful, is there anything calling for concealment, secrecy, and shame?! Our Prophet (peace be upon him) spoke the truth when Al-Nawwas bin Sam'an Al-Ansari (may Allah be pleased with him) asked him about righteousness and sin? He said: \"Righteousness is good character, and sin is what wavers in your chest and you hate for people to discover it\" (2). Among the psychological effects resulting from the permissibility of Nikah Mut'ah: Is the permissibility of Mut'ah with a virgin girl without her guardian's permission, as indicated by sources of Shia books. Al-Tusi narrated in his book Al-Istibsar: From Muhammad bin Ahmad bin Yahya bin Musa bin Umar bin Yazid, from Muhammad bin Sinan, from Abu Saeed Al-Tammat, who said: Abu Abdullah (peace be upon him) was asked about enjoying (Mut'ah with) virgins who are between parents (living with them)? He said: There is no harm, and I do not say as those scoundrels (Al-Aqshab) say (3) (4). In a narration, he said: I asked Abu Abdullah (peace be upon him) about a man enjoying a virgin girl. He said: There is no harm in that as long as he does not deem her too young (5). Among the corruptions and effects resulting from the permissibility of Nikah Mut'ah: Is that they permitted enjoying a young girl, and the greater calamity is that they permitted enjoying an infant, as stated by some Shia scholars, including:",
    "foot_note": "1. The Temporary Husband by Dr. Shahla Haeri, pp. 225-227.\n2. Sahih Muslim (4/1980).\n3. Al-Aqshab: Plural of Qashb, like Katif, meaning men in whom there is no good. Refer to the footnote of the book Al-Istibsar by Al-Tusi (3/145).\n4. Al-Istibsar: Chapter on Enjoying Virgins (3/145).\n5. Al-Kafi: (5/463).",
    "book_id": "980",
    "new_page_number": 84
  },
  {
    "serial_number": "4588992",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 82,
    "volume_number": 1,
    "text": "Sheikh Al-Saduq (1) as mentioned in his book \"Man La Yahduruhu Al-Faqih\", a narration from Muhammad bin Yahya Al-Khath'ami, from Muhammad bin Muslim who said: I asked him about the girl, can a man enjoy her? He said: Yes, unless she is a child who can be deceived. I said: May Allah set you right, what is the limit that if she reaches, she cannot be deceived? He said: A girl of ten years (2). As for the infant, they permitted enjoying her limited to touching with desire, hugging, and thighing (Tafkhidh) due to the impossibility of intercourse, as stated by Sayyid Khomeini in his book Tahrir Al-Wasilah: \"As for other enjoyments such as touching with desire, hugging, and thighing, there is no harm in them even with an infant\" (3). Among the corruptions and psychological effects resulting from the permissibility of Nikah Mut'ah is that they permitted lending the private parts of slave girls. Here are some narrations explaining this type of sexual perversion and prohibitions forbidden by Islam: 1 - Al-Kulayni narrated in his book Al-Kafi: From Muhammad bin Yahya, from Ahmad bin Muhammad, and Ali bin Ibrahim, from his father together, from Ibn Mahboub, from Jamil bin Salih, from Al-Fudayl bin Yasar, who said: I said to Abu Abdullah (peace be upon him): May I be your ransom, some of our companions have narrated from you that you said: If a man makes a slave girl lawful for his brother, she is lawful for him? He said: Yes, O Fudayl. I said to him: What do you say about a man who has a precious slave girl who is a virgin, and he makes lawful for his brother what is other than her private part, can he deflower her? He said: No, he has only what he made lawful for him of her, and if he made a kiss from her lawful for him, he has nothing else lawful. I said: Do you see if he made what is other than the private part lawful for him, but lust overcame him and he deflowered her? He said: He should not do that. I said: If he did, is he a fornicator? He said: No, but he is a betrayer, and he owes her owner one-tenth of her value if she was a virgin, and if she was not a virgin, then half of one-tenth of her value.",
    "foot_note": "1. He is Muhammad bin Ali bin Al-Hussein bin Musa Babawayh Al-Qummi, known as Sheikh Al-Saduq, a great Imami Muhaddith. None like him was seen among the people of Qom. He settled in Rayy, and his status rose in Khorasan. He died and was buried in Rayy. He has about three hundred works. (Al-A'lam by Al-Zirikli 6/274).\n2. Man La Yahduruhu Al-Faqih (3/461). [Note: The text says \"Man La Yahduruhu Al-Taqiyya\" which seems to be a typo for \"Al-Faqih\"]\n3. Tahrir Al-Wasilah: (2/241).",
    "book_id": "980",
    "new_page_number": 85
  },
  {
    "serial_number": "4588993",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 83,
    "volume_number": 1,
    "text": "2 - And Sheikh Al-Tusi narrated in his book Al-Istibsar: From Al-Hussein bin Saeed, from Fadala bin Ayyub, from Aban, from Uthman, from Al-Hasan Al-Attar who said: I asked Abu Abdullah (peace be upon him) about lending the private part. He said: There is no harm in it. I said: If a child results from it? He said: It belongs to the owner of the slave girl unless he objects to it (1). (Rather, what do you call the activity carried out by hotel and Khan owners surrounding shrines and cities, of offering girls to guests looking for a woman?! What is the difference between this deviant behavior and adultery and promoting legalized prostitution?! And if Mut'ah is Halal according to their claim, why is the woman who practices it looked upon with contempt, and why does the word \"Sigheh\" carry a meaning of contempt and is used to refer to a woman practicing temporary marriage, and not to the man who practices it?!) (2). The official news site (BBC) mentioned on Saturday 20/6/2007: Report by Frances Harrison, BBC, Tehran: The Iranian Interior Minister, a cleric, said: The Shia sect allows marriage for a specific period, in which a man can conclude any number of marriages or \"Sigheh\". Despite this, Iranian society still views Mut'ah marriage as a cover for prostitution. Promotion of Mut'ah marriage instead of committing sin began in Iran 15 years ago. The Iranian president at that time, Hashemi Rafsanjani, said it is a means for men and women to satisfy their sexual desires. He went further when he said: \"There is no need for a cleric in this marriage, as the man and woman can exchange the oath alone to complete the marriage.\" I said: This confirms the correctness of what Dr. Shahla Haeri mentioned, that there is no difference between Mut'ah marriage and legalized prostitution.",
    "foot_note": "1. Al-Istibsar: (3/138).\n2. Nikah Al-Mut'ah Between Permissibility and Prohibition, Dr. Ahmad Abu Al-Shabab, p. 235.",
    "book_id": "980",
    "new_page_number": 86
  },
  {
    "serial_number": "4588994",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 84,
    "volume_number": 1,
    "text": "A female representative in the Iranian parliament asked the Interior Minister, saying: \"If a man came asking for your daughter's hand, would you accept him based on the number of Mut'ah marriages he has concluded?\". Another deputy warned that advertising Mut'ah marriage could cause numerous problems, and there are indeed tens of thousands of children resulting from Mut'ah marriage not acknowledged by their fathers, and consequently, they are illegitimate children (1). Among the psychological effects mentioned by Asharq Al-Awsat newspaper is that Maryam: A Persian resident of Tehran. During her husband's visit to the shrine of Shah Abdol-Azim in the city of Rayy, south of Tehran, which Shias in Tehran visit: \"He was entrapped; Houses of Chastity where temporary marriage takes place abound there. In these places, there is someone who intercepts the visitor's path to offer him a list of offers including the ages of girls he can contract with.\" Maryam continues: \"Unfortunately, he was an easy prey.\" According to the study, the majority of young families end in divorce in the fourth year of marriage due to economic and social problems. In a related context, the Iranian newspaper \"Vaghaye Ettefaghieh\" warned of the spread of the \"Mut'ah marriage broker\" phenomenon in Tehran and demanded officials in the Ministry of \"Youth and Sports\" and the judiciary take necessary measures to prevent the spread of this phenomenon.",
    "foot_note": "1. Report by Frances Harrison, BBC Tehran 20/6/2007.",
    "book_id": "980",
    "new_page_number": 87
  },
  {
    "serial_number": "4588995",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 85,
    "volume_number": 1,
    "text": "The Third Topic: Health Effects\nFars News Agency mentioned from the Director of AIDS Affairs in the Iranian Ministry of Health (Abbas Sedaghat) that the number of people infected with AIDS in Iran reaches approximately 90,000 cases, while only 30,000 cases are registered in health centers (1), (15/1/2015). Asharq Al-Awsat newspaper also mentioned press reports that Houses of Chastity - temporary marriage - caused the spread of drugs (2). An expert on human rights issues at (Beheshti) University warned earlier of a great danger threatening Iran due to rising divorce rates and the popularity of (divorce parties) in Iranian society, which angered religious and governmental circles in Iran. It is noted that divorce rates in Iran are linked to rising rates of crime, addiction, drugs, and unemployment rampant among Iranian youth (3).",
    "foot_note": "1. Fars News Agency.\n2. Asharq Al-Awsat Newspaper - Report: Roshan Qassem (18/4/2016).\n3. Previous source.",
    "book_id": "980",
    "new_page_number": 88
  },
  {
    "serial_number": "4588996",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 86,
    "volume_number": 1,
    "text": "Conclusion\nPraise be to Allah first and last for His apparent and hidden blessings, and that Allah Almighty has helped me and granted me success to finish the thesis. Since authorship and research have purposes, I ask Him, Glory be to Him, that this work be purely for His Noble Face, to lift ignorance from myself and others, defending my religion from the distortion of the extremists and falsifiers, acting upon His religion, Glory be to Him, until we meet Him.\n\nResearch Result:\n1 - That the reality of Nikah Mut'ah (Temporary Marriage) is contrary to permanent marriage which conforms to the tolerant Sharia of Islam.\n2 - That the statement of Islam's objectives in legislating marriage confirms to us completely the illegitimacy of Nikah Mut'ah due to the great corruptions it entails for the individual and society.\n3 - Through the topic of the history of the permissibility and prohibition of Mut'ah, it has become clear to us that Nikah Mut'ah was abrogated twice and the matter settled on its prohibition forever.\n4 - Clarifying the reality of the methodology of Sunni jurists in authenticating Hadiths and that they do not use as evidence except what is authentic from the Truthful One (Prophet), peace be upon him, especially in legal rulings.\n5 - That what was mentioned of Hadiths and narrations used by the Shia to prove the permissibility of Nikah Mut'ah absolutely, nothing of it is correct, neither in narration nor in understanding (knowledge).\n6 - Through the topic of the texts of Shia scholars who prohibited Nikah Mut'ah, it confirms to us the severity of their contradiction and the incorrectness of their narrations which they used to prove the permissibility of Nikah Mut'ah.\n7 - Through the topic of the preponderant opinion on the ruling of Nikah Mut'ah, it has become clear to us that the Holy Quran, the Sunnah of the Prophet (peace be upon him), and Consensus agree on the prohibition of Nikah Mut'ah and that the command has been abrogated.",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 89
  },
  {
    "serial_number": "4588997",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 87,
    "volume_number": 1,
    "text": "8 - After mentioning the corruptions and effects resulting from permitting Nikah Mut'ah, it confirms to us clearly the prohibition of Nikah Mut'ah, and far be it that this is from the Sharia of Allah.\n\nRecommendations in this regard:\nAfter mentioning the most important results reached by the researcher, I will mention some recommendations that the researcher sees as of great importance, especially in this sensitive subject, so that truth does not mix with falsehood (and corruption spreads in the land). Among these recommendations:\n1 - Establishing a committee dedicated to studying Shia books and sources, in terms of accepting what is authentic from them and rejecting what is false, so that Muslims unite on one ruling, which is taking from everything authentic from our Prophet Muhammad (peace be upon him).\n2 - Encouraging our professors in the Faculty of Islamic Sharia, and some students in graduate studies who specialize, especially in the sciences of the Noble Hadith, to proceed with studying the authentication of Sunnah according to the Shia sect, as an extensive study to obtain Master's and Ph.D. degrees.\n3 - Providing a special library that includes all Shia books, to facilitate for students and specialized researchers to review them and then judge them.\nFinally, I ask Allah Almighty that this thesis be purely for His Noble Face, beneficial to Islam and Muslims. If I have succeeded in it to the truth, then this is from the bounty of the All-Knowing, the Wise, and if I erred, then this is from me and from Satan, and I seek forgiveness from Allah the Almighty, the Great. And may Allah bless our Prophet Muhammad and all his family and companions.",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 90
  },
  {
    "serial_number": "4588998",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 88,
    "volume_number": 1,
    "text": "List of References\nIbn Taymiyyah, Ahmad bin Abd al-Halim (1406 AH), Minhaj al-Sunnah al-Nabawiyyah fi Naqd Kalam al-Shi'ah al-Qadariyyah, Imam Muhammad bin Saud Islamic University, (1st ed.), Investigation: Muhammad Rashad Salim.\nAbu Al-Shabab, Ahmad Awad (1428 AH), Nikah Al-Mut'ah Bayna Al-Ibahah wa Al-Tahrim, Dar Al-Kutub Al-Ilmiyyah, Beirut: Lebanon, (1st ed.).\nAbu Zahra, Muhammad, Al-Imam Al-Sadiq Hayatuhu wa Asruhu - Ara'uhu wa Fiqhuhu, Matba'at Ahmad Ali Mukhaimir (n.d.).\nAbu Shahba, Muhammad bin Muhammad, Al-Waset fi Ulum Mustalah Al-Hadith, Dar Al-Fikr Al-Arabi (n.p.n).\nAl-Ahdal, Muhammad Abd al-Rahman (1403 AH), Nikah Al-Mut'ah, Dirasah wa Tahqiq, Mu'assasat Al-Khafiqain wa Maktabatuha, (1st ed.) (n.p): (n.p.n).\nAl-Bukhari, Muhammad bin Ismail (1422 AH), Al-Jami' Al-Musnad Al-Sahih Al-Mukhtasar min Umur Rasul Allah salla Allahu alayhi wa sallam wa Sunanihi wa Ayyamihi, Dar Tuq Al-Najat (Photocopy of Al-Sultaniyyah with addition of numbering by Muhammad Fuad Abd al-Baqi) (1st ed.) (n.p.n).\nAl-Borujerdi, Haj Hossein Tabatabaei (1412 AH), Jami' Ahadith Al-Shi'ah, Al-Mehr: Qom (n.p.n).\nAl-Baghdadi, Abu Bakr Ahmad bin Ali (1417 AH), Tarikh Baghdad wa Dhuyuluhu, Dar Al-Kutub Al-Ilmiyyah Beirut: Lebanon (1st ed.), Investigation: Mustafa Abd al-Qadir Ata.\nAl-Baghawi, Al-Hussein bin Mas'ud (1420 AH), Ma'alim Al-Tanzil fi Tafsir Al-Quran, Dar Ihya Al-Turath Al-Arabi (1st ed.), Investigation: Abd al-Razzaq Al-Mahdi.\nAl-Busiri, Ahmad bin Abi Bakr (1420 AH), Ithaf Al-Khiyarah Al-Maharah bi-Zawa'id Al-Masanid Al-Ashrah, Dar Al-Watan for Publishing - Riyadh (1st ed.).",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 91
  },
  {
    "serial_number": "4588999",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 89,
    "volume_number": 1,
    "text": "Al-Bayhaqi, Ahmad bin Al-Hussein (1424 AH), Al-Sunan Al-Kubra, Dar Al-Kutub Al-Ilmiyyah, Beirut: Lebanon (3rd ed.), Investigation: Muhammad Abd al-Qadir Ata.\nAl-Tirmidhi, Muhammad bin Isa (1395 AH), Sunan Al-Tirmidhi, Matba'at Mustafa Al-Babi Al-Halabi: Egypt (2nd ed.), Investigation Ahmad Muhammad Shakir (Vol 1) and Muhammad Fuad Abd al-Baqi (Vol 2) and Ibrahim Atwa Awad Teacher at Al-Azhar Al-Sharif (Vol 4/5).\nAsharq Al-Awsat Newspaper.\nAl-Jassas, Ahmad bin Ali, Ahkam Al-Quran (1405 AH), Dar Ihya Al-Turath Al-Arabi, Beirut, Investigation: Muhammad Sadiq Al-Qamhaawi.\nAl-Hamid, Muhammad, Nikah Al-Mut'ah Haram fi Al-Islam (n.p): (n.p.n).\nHaeri, Dr. Shahla Haeri (2007 AD), Al-Mut'ah Al-Zawaj Al-Mu'aqqat 'ind Al-Shi'ah, Sharikat Al-Matbu'at for Distribution and Publishing (12th ed.), Translation: Fadi Hammoud (n.p.n).\nAl-Halabi, Abu Salah, Al-Kafi fi Al-Fiqh, Library of Imam Amir Al-Mu'minin Ali (as) General: Isfahan, Investigation: Reza Ostadi.\nAl-Khawarizmi, Muhammad bin Ahmad, Fatih Al-Ulum, Dar Al-Kitab Al-Arabi, 2nd ed., Investigation Ibrahim Al-Abyari (n.p.n).\nAl-Khunsari, Muhammad bin Al-Hussein (1405 AH), Jami' Al-Madarik, Maktabat Al-Saduq, Tehran, (2nd ed.), Investigation: Ali Akbar Al-Ghafari.\nAl-Daraqutni, Abu Al-Hasan Ali bin Umar (1424 AH), Sunan Al-Daraqutni, Mu'assasat Al-Risalah Beirut: Lebanon (1st ed.), Investigation: Najib Al-Arna'ut, Hasan Abd al-Mun'im Shalabi, Abd al-Latif Harzallah, Ahmad Barhoum.\nAl-Dimashqi, Abu Al-Fida Ismail bin Umar bin Kathir (1420 AH), Tafsir Al-Quran Al-Azim, Dar Taybah for Publishing and Distribution, (2nd ed.), Investigation Sami bin Muhammad Salamah (n.p.n).",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 92
  },
  {
    "serial_number": "4589000",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 90,
    "volume_number": 1,
    "text": "Al-Dimashqi, Umar bin Rida bin Muhammad, Mu'jam Al-Mu'allifin, Dar Ihya Al-Turath: (n.p.n).\nAl-Dhahabi, Shams Al-Din, Abu Abdullah Muhammad bin Ahmad (1427 AH), Siyar A'lam Al-Nubala, Dar Al-Hadith: Cairo.\nAl-Razi, Ahmad bin Faris (1399 AH), Mu'jam Maqayis Al-Lughah, Dar Al-Fikr: Investigation: Abd al-Salam Muhammad Harun (n.p.n).\nAl-Zirikli, Khair Al-Din bin Mahmoud (2002 AD), Al-A'lam, Dar Al-Ilm Lil-Malayin, (5th ed.) (n.p.n).\nAl-Sijistani, Abu Dawud Sulayman bin Al-Ash'ath, Sunan Abi Dawud, Al-Maktabah Al-Asriyyah, Sidon: Beirut, Investigation: Muhammad Muhyi Al-Din Abd Al-Hamid.\nSuhaymi, Ahmad Haris (1429 AH), Tawthiq Al-Sunnah Bayna Al-Shi'ah Al-Imamiyyah wa Ahl Al-Sunnah fi Ahkam Al-Imamah wa Nikah Al-Mut'ah, Dar Al-Salam, (1st ed.) (n.p.n).\nAl-Sakhawi, Shams Al-Din Abu Al-Khair Muhammad bin Abd al-Rahman (1424 AH), Fath Al-Mughith bi-Sharh Al-Alfiyyah Al-Hadith lil-Iraqi, Maktabat Al-Sunnah: Egypt, (1st ed.), Investigation: Ali Khamis Ali.\nWorld Assembly of Muslim Youth (1420 AH), Al-Mawsu'ah Al-Muyassarah fi Al-Adyan wa Al-Madhahib wa Al-Firaq Al-Mu'asirah, Dar Al-Nadwah Al-Alamiyyah for Printing and Distribution (4th ed.), Supervision, planning and review Dr. Maneh bin Hammad Al-Johani (n.p.n).\nAl-Shawkani, Muhammad bin Ali, Nayl Al-Awtar (1413 AH), Dar Al-Hadith, (1st ed.), Investigation: Essam Al-Din Al-Sababti (n.p.n). [Note: text says Al-Abadli but likely Al-Sababti or similar]\nAl-Safadi, Salah Al-Din Khalil bin Aybak (1420 AH), Al-Wafi bi Al-Wafiyat, Dar Ihya Al-Turath, Investigation: Ahmad Al-Arna'ut and Turki Mustafa (n.p.n).\nAl-San'ani, Abu Bakr Abd al-Razzaq bin Hammam (1403 AH), Al-Musannaf, Al-Kutub Al-Islamiyyah Barqa, (2nd ed.) (n.p.n).",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 93
  },
  {
    "serial_number": "4589001",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 91,
    "volume_number": 1,
    "text": "Al-Tabarani, Sulayman bin Ahmad, Al-Mu'jam Al-Awsat, Dar Al-Haramain Cairo, Investigator: Tariq bin Awad Allah bin Muhammad, Abd al-Muhsin bin Ibrahim Al-Husayni (n.p.n).\nAl-Tabari, Muhammad bin Jarir (1420 AH), Jami' Al-Bayan fi Ta'wil Al-Quran, Mu'assasat Al-Risalah, (1st ed.), Investigation: Ahmad Muhammad Shakir (n.p.n).\nAl-Tusi, Muhammad bin Al-Hasan (1305 AH), Tahdhib Al-Ahkam, Dar Al-Kutub Al-Islamiyyah, Tehran, (4th ed.), Investigation: Sayyid Hasan Al-Musawi Al-Khurasan.\nAl-Tusi, Muhammad bin Al-Hasan, Al-Istibsar, Dar Al-Kutub Al-Islamiyyah, Tehran, Investigation: Sayyid Hasan Al-Musawi Al-Khurasan.\nAl-Amili, Hasan bin Zain Al-Din, Ma'alim Al-Din wa Maladh Al-Mujtahidin, Islamic Publishing Foundation affiliated with the Teachers' Association in Holy Qom (n.p.n).\nAl-Amili, Muhammad bin Al-Hasan (1414 AH), Wasa'il Al-Shi'ah (Ahl Al-Bayt), Ahl Al-Bayt (as) Foundation for Reviving Heritage in Holy Qom, (2nd ed.).\nAl-Absi, Abu Bakr bin Abi Shaybah (1409 AH), Abdullah bin Muhammad, Al-Kitab Al-Musannaf fi Al-Ahadith wa Al-Athar, Maktabat Al-Rushd, (1st ed.), Investigation Amal Yusuf Al-Huth (n.p.n). [Note: text says Huth, usually Kamal Yusuf Al-Hout]\nAl-Uthaymeen, Muhammad bin Saleh (1424 AH), Sharh Al-Manzumah Al-Bayquniyyah fi Mustalah Al-Hadith, Sheikh Muhammad bin Saleh Al-Uthaymeen Charitable Foundation, (3rd ed.) (n.p.n).\nAl-Asqalani, Ahmad bin Ali Abu Al-Fadl (1419 AH), Al-Talkhis Al-Habir fi Takhrij Ahadith Al-Rafi'i Al-Kabir, Dar Al-Kutub Al-Ilmiyyah (1st ed.).\nAl-Asqalani, Ahmad bin Ali Abu Al-Fadl (1379 AH), Fath Al-Bari Sharh Sahih Al-Bukhari, Dar Al-Ma'rifah, Beirut, with investigations by the Allamah Abd al-Aziz bin Baz - may Allah have mercy on him.\nAl-Asqalani, Ahmad bin Ali Abu Al-Fadl (1419 AH), Al-Matalib Al-Aliyah bi-Zawa'id Al-Masanid Al-Thamaniyah, Dar Al-Asimah, Dar Al-Ghayth - Saudi Arabia.",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 94
  },
  {
    "serial_number": "4589002",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 92,
    "volume_number": 1,
    "text": "Ali, Zaid bin Ali, Musnad Zaid bin Ali, Publications of Dar Maktabat Al-Hayah, Beirut: Lebanon.\nUmar, Dr. Ahmad Mukhtar Abd al-Hamid (1429 AH), Mu'jam Al-Lughah Al-Arabiyyah Al-Mu'asirah, Alam Al-Kutub (1st ed.) (n.p.n).\nAwaji, Dr. Ghalib bin Ali (1422 AH), Firaq Mu'asirah Tantasib ila Al-Islam wa Bayan Mawqif Al-Islam Minha, Al-Maktabah Al-Asriyyah Al-Dhahabiyyah for Printing, Publishing and Marketing, Jeddah, (4th ed.).\nAl-Qari, Ali bin (Sultan) Muhammad, Sharh Nukhbat Al-Fikr fi Mustalah Ahl Al-Athar, Dar Al-Arqam - Lebanon/Beirut: Investigation: Introduced by: Sheikh Abd al-Fattah Abu Ghuddah, Investigated and annotated by: Muhammad Nizar Tamim, and Haitham Nizar Tamim.\nAl-Qurtubi, Abu Abdullah Muhammad bin Ahmad (1384 AH), Al-Jami' li-Ahkam Al-Quran = Tafsir Al-Qurtubi, Dar Al-Kutub Al-Masriyyah, Cairo, (2nd ed.), Investigation: Ahmad Al-Barduni, Dr. Ibrahim Atfayish.\nAl-Qazwini, Abu Abdullah Muhammad bin Yazid, Sunan Ibn Majah, Dar Ihya Al-Kutub, Investigation: Muhammad Fuad Abd al-Baqi (n.p.n).\nAl-Qatami, Yaqub Badr (1429 AH), Al-Kafi Al-Mufid wa Al-Radd Al-Muf'am Al-Muljim Al-Sadid ala Hadim I'tiqadihi Al-Wahyayni (1st ed.) (n.p) (n.p.n).\nAl-Qummi, Ali bin Babawayh, Fiqh Al-Rida, Publisher: The International Congress for Imam Reza (as), Holy Mashhad.\nAl-Kashani, Mulla Fathullah (1333 AH), Tafsir Kabir Manhaj Al-Sadiqin fi Ilzam Al-Mukhalifin, Chapkhaneh Mohammad Hasan Elmi (n.p.n).\nAl-Kashani, Muhammad bin Muhsin, Al-Wafi (1406 AH), Afsad Nashat Isfahan [Note: Likely Maktabat Al-Imam Amir Al-Mu'minin], Library of Imam Amir Al-Mu'minin (as) General - Isfahan. (1st ed.), Investigation: Diaa Al-Din Al-Husseini Al-Isfahani.",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 95
  },
  {
    "serial_number": "4589003",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Hadiths and Athar Reported Regarding Nikah Mut'ah: Knowledge and Narration",
    "edition": "None",
    "publisher": "None",
    "page_number": 93,
    "volume_number": 1,
    "text": "Al-Kulayni, Muhammad bin Yaqub, Al-Kafi (1367 AH), Dar Al-Kutub Al-Islamiyyah - Tehran (3rd ed.), Investigation: Ali Akbar Al-Ghafari.\nMal Allah, Muhammad (1409 AH), Al-Shi'ah bi-Al-Mut'ah, Maktabat Ibn Taymiyyah, (3rd ed.) (n.p.n).\nAl-Maghribi, Qadi Nu'man, Da'a'im Al-Islam, Dar Al-Ma'arif bi-Misr - Cairo: (2nd ed.), Investigation: Asaf bin Ali Fayzi.\nAl-Mawsu'ah Al-Fiqhiyyah Al-Kuwaitiyyah, Ministry of Awqaf and Islamic Affairs (from 1404 - 1427 AH), (2nd ed.).\nThe Russian News Site (BBC). [Note: Text says Russian, but earlier context says BBC Persian/UK]\nAl-Najafi, Ayatollah Haj Mahdi Majd Al-Islam (1423 AH), Mawsu'at Ahadith Ahl Al-Bayt (as) Dar Ihya Al-Turath Al-Arabi for Printing, Publishing and Distribution, Beirut: Lebanon, (1st ed.).\nAl-Nasa'i, Abu Abd al-Rahman Ahmad bin Shu'ayb (1406 AH), Al-Mujtaba min Al-Sunan = Al-Sunan Al-Sughra li-Al-Nasa'i, Maktabat Al-Matbu'at Al-Islamiyyah, Aleppo, (2nd ed.).\nAl-Nawawi, Abu Zakariya Yasin Al-Madini Yahya bin Sharaf (1392 AH), Al-Minhaj Sharh Sahih Muslim, Ibn Al-Hajjaj, Dar Ihya Al-Turath Al-Arabi, Beirut - (2nd ed.). [Note: \"Yasin Al-Madini\" seems to be an error in the source text, Nawawi is Yahya bin Sharaf]\nAl-Naysaburi, Abu Abdullah Al-Hakim Muhammad bin Abdullah (1411 AH), Al-Mustadrak ala Al-Sahihayn, Dar Al-Kutub Al-Ilmiyyah Beirut: Lebanon (1st ed.), Investigation: Mustafa Abd al-Qadir Ata.\nAl-Naysaburi, Muslim bin Al-Hajjaj, Al-Musnad Al-Sahih Al-Mukhtasar bi-Naql Al-Adl an Al-Adl ila Rasul Allah salla Allahu alayhi wa sallam, Dar Ihya Al-Turath Al-Arabi - Beirut Investigation: Muhammad Fuad Abd al-Baqi.\nAl-Harawi, Muhammad bin Ahmad Al-Azhari (2001 AD), Tahdhib Al-Lughah, Dar Ihya Al-Turath Al-Arabi, Beirut, (1st ed.), Investigation: Muhammad Awad Mar'i.\nAl-Haythami, Nur Al-Din Ali bin Abi Bakr (1414 AH), Majma' Al-Zawa'id wa Manba' Al-Fawa'id, Maktabat Al-Qudsi - Cairo, Investigation: Husam Al-Din Al-Qudsi.",
    "foot_note": "None",
    "book_id": "980",
    "new_page_number": 96
  }
]